{"id": "10004", "subject": "Re: Editing EVP- Are you Crazy?", "author": "LC Duplatt", "timestamp": "2008-04-18T01:53:28Z", "full_text": "I think 10 seconds is about right, IMHO, but any shorter and you&#39;ll \nfind yourself speaking over replies sometimes (even at 10 seconds).  \n\nFormerly being a stickler against editing, I now do edit some.  For \nexample, if I have a 5 second clip and there are some scrub noises \nbetween words that interfere with the message, I now cut it from the \nclip.  This makes it easier for first timers to be able to identify \nand comprehend the &quot;manipulation&quot; and how it sounds...allowing them \nto hear what to listen for in responses.\n\nIf you are going to cut/edit, just keep the raw audio as \nbackup...proof for those who question, if you will.\n\nLC\nhttp://www.AngelsGhosts.com\n\n--- In EVP-ITC@yahoogroups.com, &quot;Steve Hultay&quot; &lt;urkel23@...&gt; wrote:\n&gt;\n&gt; \n&gt; \n&gt; The question, than 10 seconds and that&#39;s it.  Anything else could \nbe \n&gt; made to fit the researchers situation.  I cut out some crap that \n&gt; doesn&#39;t belong, but i only wait 10 seconds before i ask my next \n&gt; question.\n&gt; \n&gt; -Steve\n&gt; \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Joel Smith &lt;shadow71414@&gt; wrote:\n&gt; &gt;\n&gt; &gt; that why i belive that raw filles of  10 sec  help new \nreasearchers \n&gt; learn the right way a lot sooner\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; ----- Original Message ----\n&gt; &gt; From: Early Cuyler &lt;ecuyler@&gt;\n&gt; &gt; To: EVP-ITC@yahoogroups.com\n&gt; &gt; Sent: Thursday, April 17, 2008 8:19:00 PM\n&gt; &gt; Subject: Re: [EVP-ITC] Re: Editing EVP- Are you Crazy?\n&gt; &gt; \n&gt; &gt; I agree with you totally, Juli.  I admit that I used to give \n&gt; upwards of 25 seconds between questions.  I&#39;ve learned that if I&#39;m \n&gt; going to get an answer, it usually comes a lot sooner than that, if \n&gt; not, then I&#39;m not getting an answer at that time.  But that had to \n&gt; come with learning.  \n&gt; &gt; \n&gt; &gt; Jeremy\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; ----- Original Message ----\n&gt; &gt; From: juli velazquez &lt;ghostchasingfool@ yahoo.com&gt;\n&gt; &gt; To: EVP-ITC@yahoogroups .com\n&gt; &gt; Sent: Thursday, April 17, 2008 2:38:48 PM\n&gt; &gt; Subject: Re: [EVP-ITC] Re: Editing EVP- Are you Crazy?\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; For those of you who are paranormal investigators alike, you know \n&gt; the first rule of thumb is NEVER edit your clips!  If you want to \nbe \n&gt; taken serious in this field and not under a microscope with the \n&gt; question of whether or not you in fact did actually get a voice \n&gt; and/or response and that clip is edited, don&#39;t bother putting it up \n&gt; for public display.  You can amplify it, take out the hiss, but you \n&gt; better not splice it in any way, cause your just asking for \ntrouble.  \n&gt; &gt;  \n&gt; &gt; I had this very debate with Bruce long ago.  I know first hand \nthat \n&gt; if in fact its edited many question your motives behind why you in \n&gt; fact would bother removing the dead airtime between.  The very \nfirst \n&gt; thing that came into question when editing EVP from Frank&#39;s Box \nmany \n&gt; moons ago (pun intended) that a certain person was in fact splicing \n&gt; his audio by putting the questions and response right after.  Many \n&gt; now consider him to be a fraud and this was just one of the reason \n&gt; built upon others as a direct result.  You are altering the clip, \nno \n&gt; ifs and or butts about.  It can therefore hurt your creditability \nas \n&gt; a researcher in the paranormal field.  Regardless with you save \nyour \n&gt; original clips.  Everything you do comes into question.  You can \n&gt; clearly tell by the skip in rhythm as you play the audio vs the \nfree \n&gt; flowing of the dial when it has been altered.  Real Time is real \ntime \n&gt; people, not 15 seconds after the fact.  If you have to questions \nwhat \n&gt; you\n&gt; &gt;  got....&quot;If in Doubt, throw It Out&quot;.\n&gt; &gt;  \n&gt; &gt; People, there is one thing that you have to remember.  The word \nof \n&gt; box research is spreading, and there are those who are implementing \n&gt; it as an additional tool on investigations.  This is not just some \n&gt; who are going to give up their current status as a ghost hunter to \n&gt; now slowly be a box researcher ( for that was never a thought for \n&gt; me).  I was hoping that through my research I could in fact \n&gt; incorporate it on my investigations.  Because of the radio \nfragments \n&gt; itself, there are many that do not support this research and \nbelieve \n&gt; we are reaching and grasping at nothing, and literally laugh when \nthe \n&gt; subject of box research comes up.  Do you really want to give them \nan \n&gt; extra ammunition as splicing your clips?  I know myself that there \nis \n&gt; more that meets the eye in this line for communication, and I do \n&gt; stand proud and true of pursuing real time communication, myself, \nbut \n&gt; cutting out the dead air is not just because you don&#39;t want to \nlisten \n&gt; to it, or you can&#39;t\n&gt; &gt;  fit it all is a lame excuse.  Use a different program!\n&gt; &gt;  \n&gt; &gt; I personally have questioned many on their clips and have to tell \n&gt; you that if you truly want to be considered as a professional \n&gt; paranormal investigator/ researcher that if you intend to use this \n&gt; protocol for you evp/box research clips, you stand to loose your \n&gt; creditability and the word fraud may just come into question.\n&gt; &gt;  \n&gt; &gt; However, if you have nothing to loose as far as your reputation \nand \n&gt; or not in it to prove anything to anyone, be my guest.  There are \n&gt; many here that are not involved in the paranormal field and a \nprefer \n&gt; evp-itc researcher vs. other areas of the super natural.  If they \nare \n&gt; not putting themselves out there for God and Country to see, and \nare \n&gt; only doing it for your personal results and curiosity, and can \ncould \n&gt; careless with others thing, then clip away to your hearts content!  \n&gt; &gt;  \n&gt; &gt; Just remember, if someone who is currently studying evp and not \nbox \n&gt; research sees and hears your clips, don&#39;t be surprised, if they \nstart \n&gt; questioning your motives and box research all together!\n&gt; &gt;  \n&gt; &gt; Just adding my 2 cents!\n&gt; &gt; Juli\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; psfponies &lt;psfponies@yahoo. com&gt; wrote: \n&gt; &gt; Yes I get your point Rees. On long messages cutting out the crap \n&gt; &gt; between words in the message.\n&gt; &gt; \n&gt; &gt; Kay\n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups .com, Ron Lederer &lt;ronriko@ &gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; Sorry, don&#39;t get the point rees. Ron L\n&gt; &gt; &gt; \n&gt; &gt; &gt; Wiliam Clarke &lt;reesclarke_ 69@&gt; wrote: My thoughts on \n&gt; &gt; cut out the garbage leads people to believe that the messages \nthat \n&gt; &gt; some people are getting messages are all in one sentence.\n&gt; &gt; &gt; \n&gt; &gt; &gt; Example Question: How are you today? \n&gt; &gt; &gt; \n&gt; &gt; &gt; 1st Answer:(Cut Up) I&#39;m good, me and my spirts friends here \n&gt; &gt; wants to give you a long message for the reseachers to here&gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; 2nd Answer:(Not Cut) I&#39;m blah blah blah blah blah blah blah \nblah \n&gt; &gt; blah blah blah good blah blah.\n&gt; &gt; &gt; \n&gt; &gt; &gt; Does anybody see my point on cut up messages?\n&gt; &gt; &gt; \n&gt; &gt; &gt; Rees\n&gt; &gt; &gt; \n&gt; &gt; &gt; bruce halliday &lt;paranormalinvestig ating@ &gt; wrote:\n&gt; &gt; &gt; Stefan,\n&gt; &gt; &gt; \n&gt; &gt; &gt; I do remove the &quot;garbage&quot; from my files.\n&gt; &gt; &gt; \n&gt; &gt; &gt; At this point in my research, the message is more important to \nme \n&gt; &gt; than the proof of it.\n&gt; &gt; &gt; I think most of us here will agree that we are receiving some \n&gt; sort \n&gt; &gt; of paranormal communication.\n&gt; &gt; &gt; but it definitely exists. now we need to concentrate on the \n&gt; &gt; messages they need us to hear and the answers to the questions\n&gt; &gt; &gt; we ask and in turn our answers to their questions. Anyone that \n&gt; &gt; cleans a file in this way should not be touching any bit of the \nfile\n&gt; &gt; &gt; that has a semblance of speech, only the bits that are odiously \n&gt; &gt; garbage like the &quot;EH O EH AH O EH UR&quot; in between words.\n&gt; &gt; &gt; \n&gt; &gt; &gt; For example &quot;Is there anyone here that wishes to \n&gt; &gt; communicate_ YES_AH ER EEH AR OOO AR_WE ARE_EH IH AHH EHH_HERE&quot;\n&gt; &gt; &gt; It is much easier for me as a researcher to be able to return \nto \n&gt; a \n&gt; &gt; file that I recieved two weeks ago and that I believe may hold \nsome\n&gt; &gt; &gt; relivence to a message I just received and be able to cleanly \n&gt; &gt; listen to it, without the distraction of the garbage sounds.\n&gt; &gt; &gt; \n&gt; &gt; &gt; At this stage in real time communication the messages are the \ntop \n&gt; &gt; priority.\n&gt; &gt; &gt; I do however agree that the untouched version should be \nretained \n&gt; &gt; and made available to individuals that make a request \n&gt; &gt; &gt; for any intelligent sceptical or authenticity challenge that \nmay \n&gt; &gt; be made, and god knows there are always fanatical \n&gt; &gt; &gt; sceptics lurking in the shadows awaiting an opportunity to \nattack \n&gt; &gt; an unwary or injured researcher. I do not think that \n&gt; &gt; &gt; our research files should be made available on request by every \n&gt; &gt; tom dick and harry that is unknown to us and may potentially\n&gt; &gt; &gt; doctor the file to suit their own point and post it as such.\n&gt; &gt; &gt; \n&gt; &gt; &gt; I have had this happen to me in the past so I believe the \n&gt; &gt; researcher that receives the request for raw research data should \n&gt; &gt; &gt; scrutinize the requesting source and use their best judgment \n&gt; &gt; before handing out any research data.\n&gt; &gt; &gt; \n&gt; &gt; &gt; These are my thoughts on the subject of cleaning a file.\n&gt; &gt; &gt; \n&gt; &gt; &gt; Bruce\n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; Bruce Halliday \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; ------------ --------- --------- ---\n&gt; &gt; &gt; To: EVP-ITC@yahoogroups .com\n&gt; &gt; &gt; From: yahoogroups@ ...\n&gt; &gt; &gt; Date: Thu, 17 Apr 2008 09:55:42 +0200\n&gt; &gt; &gt; Subject: [EVP-ITC] Editing EVP\n&gt; &gt; &gt; \n&gt; &gt; &gt; Hi all,\n&gt; &gt; &gt; \n&gt; &gt; &gt; just a general comment on editing EVP: For scientific reasons, \nI \n&gt; &gt; would\n&gt; &gt; &gt; suggest not to edit an EVP message partially, but only as a \n&gt; whole, \n&gt; &gt; in\n&gt; &gt; &gt; order to rule out any possible suspicion of manipulation. You \ncan \n&gt; &gt; for\n&gt; &gt; &gt; instance increase the volume or dynamics of an entire clip \n&gt; &gt; (including\n&gt; &gt; &gt; the experimenter&#39; s voice), filter or denoise it to make it \n&gt; &gt; clearer, but\n&gt; &gt; &gt; not cut out individual pieces (supposed &quot;garbage&quot;) to make an \nEVP \n&gt; &gt; match\n&gt; &gt; &gt; with what it &quot;should be&quot;. At least, the unedited version should \n&gt; &gt; always\n&gt; &gt; &gt; be provided along with the edited version.\n&gt; &gt; &gt; \n&gt; &gt; &gt; But that&#39;s only my personal opinion which I thought I had to \n&gt; &gt; express, as\n&gt; &gt; &gt; we should always be able to present our results to a critical \n&gt; &gt; public.\n&gt; &gt; &gt; \n&gt; &gt; &gt; Stefan\n&gt; &gt; &gt; \n&gt; &gt; &gt; -- \n&gt; &gt; &gt; \n&gt; &gt; &gt; &gt; Believe or not Ron, very little editing is involved for these \n&gt; &gt; files.\n&gt; &gt; &gt; &gt; After my question, i isolate the response section and slow \nthat \n&gt; &gt; &gt; &gt; section down about 20%. Now i can actually start to hear the \n&gt; &gt; message \n&gt; &gt; &gt; &gt; a lot clearer, i also now see a couple sections of just noise \n&gt; &gt; that \n&gt; &gt; &gt; &gt; don&#39;t belong and eliminate them from the mix. You can&#39;t piece \n&gt; &gt; these \n&gt; &gt; &gt; &gt; files together to make something it&#39;s not, so i keep them in \n&gt; &gt; true \n&gt; &gt; &gt; &gt; form pretty much to the original.\n&gt; &gt; &gt; \n&gt; &gt; &gt; &gt; -Steve\n&gt; &gt; &gt; \n&gt; &gt; &gt; &gt; --- In EVP-ITC@yahoogroups .com, Ron Lederer &lt;ronriko@&gt; wrote:\n&gt; &gt; &gt; &gt;&gt;\n&gt; &gt; &gt; &gt;&gt; Hey Steve Forgot to ask...how much editing was needed to get \n&gt; &gt; this \n&gt; &gt; &gt; &gt; file? Did you need to take out a lot of garbage between words \n&gt; &gt; &gt; &gt; withing the message? Ron L\n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; ------------ --------- --------- ---\n&gt; &gt; &gt; More immediate than e-mail? Get instant access with Windows \nLive \n&gt; &gt; Messenger. \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; ------------ --------- --------- ---\n&gt; &gt; &gt; Be a better friend, newshound, and know-it-all with Yahoo! \n&gt; &gt; Mobile. Try it now. \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; ------------ --------- --------- ---\n&gt; &gt; &gt; Be a better friend, newshound, and know-it-all with Yahoo! \n&gt; &gt; Mobile. Try it now.\n&gt; &gt; &gt;\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; The contents of this eletronic correspondence is private & \n&gt; confidential and meant only for the party and/or parties it is \n&gt; addressed to.  \n&gt; &gt;  \n&gt; &gt; No part of this email transmission may be publicly posted or \n&gt; forwarded to other parties without explicit written permission.\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; Be a better friend, newshound, and know-it-all with Yahoo! \nMobile. \n&gt; Try it now. \n&gt; &gt;  \n&gt; &gt; \n&gt; &gt; \n&gt; &gt;       \n&gt; \n______________________________________________________________________\n&gt; ______________\n&gt; &gt; Be a better friend, newshound, and \n&gt; &gt; know-it-all with Yahoo! Mobile.  Try it now.  \n&gt; http://mobile.yahoo.com/;_ylt=Ahu06i62sR8HDtDypao8Wcj9tAcJ\n&gt; &gt;\n&gt;"}