{"id": "10005", "subject": "Undies in a Bundy!", "author": "Jules", "timestamp": "2008-04-18T02:18:58Z", "full_text": "Holy Cow, I leave for my daughters school event at 3:30 and I have \ntoo much email on this subject!\n \nFirst and foremost I was directing those who are in fact are \nparanormal investigators, in field research.  Many here are not!  I \nwas in no way implying that Bruce, Steve, etc. were fabricating their \naudio clips in any way!!!!  I HIGH RESPECT BRUCE, STEVE AND THE the \nother on this board!  I am speaking from my experiences, and being in \nthe line of fire throughout the years regarding cutting and pasting \nclips together.\n \nI don&#39;t care what you do to be completely honest, I just know that \ngiven the drama and know how nasty people can be, I will not cut and \npaste which is my preference.  Just because someone who does, given \ntheir reputation (such as Bruce&#39;s) I certainly would have no reason \nto question the authenticity of his work.  However, there are those \nwho I do question, such as the post of Mr.Roundtrees photo&#39;s (posted \nthe previous day) and given the manufacturing of those so called \nghost photo&#39;s I would serious NEVER take any audio he produced as \ncreditable. This is the point I was trying to make.  \n \nI will also tell you that a year ago upon listening to some of the \nfiles here, the first thing I noticed was that when I played certain \nfiles I could clearly see with the editing software that they were \nnot raw audio.  I immediately formed an opinion that they in fact \ncould be bogus!  That was my initial impression.  It wasn&#39;t until I \nformed a personal friendship with some of them that I know THEY WOULD \nNEVER comprise their integrity and that this specific research was \nextremely important to them.  I will be the first to admit that I was \nvery wrong, but I did base my judgment given what I saw.  Other may \njust do the same.\n \nThe average person who happens upon this search who in fact has been \nsubject to those who do not stand behind their research will not know \nbetter.  They too may just form the same opinion based on what they \nhave come across in this industry. \n \nMany I have had the pleasure of talking to outside this board, and I \nwill tell you that it is an honor to be among good honest creditable \npeople, who truly do care!  I know NONE OF YOU whom I have spoken \nwith would EVER do this, but unfortunately there are those who will.\n \nI hope this clears things up, and people are not going to make a \nmountain out of a mole hill.\n \nJuli"}