{"id": "10029", "subject": "Re: Spirico Device", "author": "alexrondini", "timestamp": "2008-04-18T12:41:33Z", "full_text": "Thanks Guy, I have heard a few people mention that O&#39;Neil hoaxed it \nbut I don&#39;t know enough about this to really pass any sort of \njudgement.  Looking forward to seeing your website.\n\nAlex\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;Guy&quot; &lt;yzzzguy@...&gt; wrote:\n&gt;\n&gt; In regards to the Spiricom story - I have to assume you&#39;re \nreferring to \n&gt; the Mark IV model as diagrammed/written up in the Spiricom manual \n(as \n&gt; opposed to the INCORRECT diagram made by Polish researcher Wojciech \n&gt; Drewniak...http://www.worlditc.org/k_06_spiricom.htm ).\n&gt; \n&gt; While my research is still not finished (and I&#39;ve been working on \nthis \n&gt; for a little over 2 years), I&#39;m leaning toward the Mark IV \n&gt; conversations as having been hoaxed by Bill O&#39;Neil. HOWEVER - I \nbelieve \n&gt; he acted alone and that none of the other members of the \nMetascience \n&gt; Foundation were involved with this hoax. As to O&#39;Neil&#39;s motivation \nfor \n&gt; the hoax - I still don&#39;t know. But I will also say that the \nveridical \n&gt; evidence that O&#39;Neil claims to have received about Dr. George J. \n&gt; Mueller through clairaudience is amazing and it is tough to see how \n&gt; O&#39;Neil would have gotten this information given his finances, \nlocation, \n&gt; the timeframe, etc.\n&gt; \n&gt; I&#39;ve been promising to get my personal website up and operating for \n&gt; some time now but have been busy. Hopefully soon. Then I&#39;ll start \n&gt; posting what I have found out so far.\n&gt; \n&gt; Guy Jackson\n&gt; \n&gt; P.S. The recordings of the Spiricom cassette that can be found at \nthe \n&gt; GOS website ( http://www.ghostpix.com/spiricom/spiricom.html ) are \nvery \n&gt; poor. Scott L over at Ghostly Talk pulled much a much cleaner \nversion \n&gt; directly from a source cassette provided to him by Mark Macy ( see \n&gt; Ghostly Talk show archive noted as a &quot;Bonus&quot; and &quot;Repost&quot; for \nAugust \n&gt; 22, 2006: http://www.ghostlytalk.com/node/616 ). \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;alexrondini&quot; &lt;alexrondini@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hi all,\n&gt; &gt; \n&gt; &gt;     I&#39;m new on this group. Not too sure whether this topic was \n&gt; &gt; discussed already or not but I wanted to get your oppinion on the \n&gt; &gt; Spiricon device.  Does anyone know more about it?\n&gt; &gt; \n&gt; &gt; Alex\n&gt; &gt;\n&gt;"}