{"id": "10020", "subject": "Re: Editing EVP", "author": "purplespacefriend", "timestamp": "2008-04-18T06:25:17Z", "full_text": "For what it&#39;s worth, I seperate out a segment that has the phrase, \nand usually don&#39;t filter, or cut anything out of it. I don&#39;t try to \nget rid of any &quot;garbage&quot; in between words. I too consider that \nsuspicous--really suspicious. Except for Stefan, I&#39;ve been doing this \nbox crap longer than anyone here, and I find the level of ego amongst \nthe &quot;researchers&quot; disturbing. \n\n I&#39;ve said it before, and I&#39;ll say it again, I don&#39;t ask questions. \nThe spirits/entities are in fact in a higher state of being, they \nknow what you need to know, they know when you are listening and \nrecording. There are no acidental &quot;captures&quot;. Asking questions is \npresumptuous at best, who here is wise enough to question the angels \nGod, or spirit!? Why not just record? Let them speak. \n\n Frank-S\n\n\n --- In EVP-ITC@yahoogroups.com, Stefan Bion &lt;yahoogroups@...&gt; wrote:\n&gt;\n&gt; Hi all,\n&gt; \n&gt; just a general comment on editing EVP: For scientific reasons, I \nwould\n&gt; suggest not to edit an EVP message partially, but only as a whole, \nin\n&gt; order to rule out any possible suspicion of manipulation. You can \nfor\n&gt; instance increase the volume or dynamics of an entire clip \n(including\n&gt; the experimenter&#39;s voice), filter or denoise it to make it clearer, \nbut\n&gt; not cut out individual pieces (supposed &quot;garbage&quot;) to make an EVP \nmatch\n&gt; with what it &quot;should be&quot;. At least, the unedited version should \nalways\n&gt; be provided along with the edited version.\n&gt; \n&gt; But that&#39;s only my personal opinion which I thought I had to \nexpress, as\n&gt; we should always be able to present our results to a critical \npublic.\n&gt; \n&gt; Stefan\n&gt; \n&gt; -- \n&gt; \n&gt; &gt; Believe or not Ron, very little editing is involved for these \nfiles.\n&gt; &gt; After my question, i isolate the response section and slow that \n&gt; &gt; section down about 20%.  Now i can actually start to hear the \nmessage \n&gt; &gt; a lot clearer, i also now see a couple sections of just noise \nthat \n&gt; &gt; don&#39;t belong and eliminate them from the mix.  You can&#39;t piece \nthese \n&gt; &gt; files together to make something it&#39;s not, so i keep them in true \n&gt; &gt; form pretty much to the original.\n&gt; \n&gt; &gt; -Steve\n&gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, Ron Lederer &lt;ronriko@&gt; wrote:\n&gt; &gt;&gt;\n&gt; &gt;&gt; Hey Steve   Forgot to ask...how much editing was needed to get \nthis \n&gt; &gt; file?  Did you need to take out a lot of garbage between words \n&gt; &gt; withing the message?   Ron L\n&gt;"}