{"id": "10021", "subject": "Re: 36 box", "author": "purplespacefriend", "timestamp": "2008-04-18T06:39:48Z", "full_text": "Thanks! Yeah, I use two 12 supplies to get the plus and minus 12 \nvolts to run the sweep circuit. I use 7ah gel cells here on the \nbench, then in boxes, if I want to save room and $$ I use AA-8 packs. \nFor boxes that will be used for public demonstrations and regular \ninvestigations, I use 1.2ah gel cells and constant voltage charger. \nThe charging current is low enough for these batteries that excess \ncurrent draw has not been a problem. I am working on one of these \nspecial demonstration boxes that has the built in charger, and can \nrun while charging the batteries--hopefully there won&#39;t be too much \nAC hum pick up by the mic. As with all the boxes so far, still \nexperimental. For what I need I think Lithium ion would be too pricy, \nand NiCads, I just don&#39;t like. NiMh, I&#39;m don&#39;t know much about. \n\n Frank-S\n\n--- In EVP-ITC@yahoogroups.com, Marlboro63@... wrote:\n&gt;\n&gt; Hi Frank,\n&gt;  \n&gt; Starting to all come together and looks really good.  Did you \nstill  set that \n&gt; up for a 12 volt power source?  If so I can make recommendations  \nas for \n&gt; batteries to use and that will last for quite a long time between  \ncharges.  The \n&gt; only problem is that a good battery charger would cost $40.00  or a \nreally \n&gt; cheap one will cost $15.00.\n&gt;  \n&gt; Jeff\n&gt;  \n&gt;  \n&gt; In a message dated 4/15/2008 1:49:59 A.M. Central Daylight Time,  \n&gt; purplealiengirl@... writes:\n&gt; \n&gt;  \n&gt;  \n&gt;  \n&gt; #36, or HackyBox01.\n&gt; \n&gt; Frank-S\n&gt; \n&gt;  \n&gt; ____________________________________\n&gt; Pack up or back up&quot;use SkyDrive to transfer files or keep extra \ncopies. \n&gt; _Learn how._ \n&gt; (hthttp://www.windowslive.com/skydrive/overview.html?\nocid=TXT_TAGLM_WL_Refresh_skydrive_packup_042008)   \n&gt; \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; **************It&#39;s Tax Time! Get tips, forms and advice on AOL \nMoney & \n&gt; Finance.      (http://money.aol.com/tax?NCID=aolcmp00300000002850)\n&gt;"}