{"id": "10035", "subject": "Re: [EVP-ITC] Re: Spirico Device", "author": "Stefan Bion", "timestamp": "2008-04-18T14:10:27Z", "full_text": "When I first listened to the Spiricom samples several years ago, my immediate impression was: Hmm, it sounds like someone using an &quot;electronic larynx&quot; (speech aid device). This impression was strengthened by the observation that the buzzing sound often was even modulated by O&#39;Neill&#39;s own voice during the dialoges between him and &quot;Dr. Mueller&quot;! (Did O&#39;Neill forget to remove the device from his throat while talking to his counterpart?)\n\nAnd what about the &quot;13 frequencies&quot; that are supposed to be used as the &quot;carrier&quot; for the spirit voices? Why aren&#39;t they audible in the recordings? And why does a mixture of the 13 tones created with Audition sound so different from the typical &quot;Spiricom buzz&quot;? - Well, if you analyze the frequency spectrum of the buzzing sound (this can be done with Audition etc.), you will find a lot of harmonics (peaks in the spectrum), and some of these harmonics more or less match the 13 Spiricom frequencies...\n\nTo me, the entire Spiricom saga produces more questions than answers...\n\n----- original Nachricht --------\n\nBetreff: [EVP-ITC] Re: Spirico Device\nGesendet: Fr, 18. Apr 2008\nVon: alexrondini&lt;alexrondini@...&gt;\n\n&gt; Thanks Guy, I have heard a few people mention that O&#39;Neil hoaxed it \n&gt; but I don&#39;t know enough about this to really pass any sort of \n&gt; judgement.  Looking forward to seeing your website.\n&gt; \n&gt; Alex\n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Guy&quot; &lt;yzzzguy@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; In regards to the Spiricom story - I have to assume you&#39;re referring to \n&gt; &gt; the Mark IV model as diagrammed/written up in the Spiricom manual (as \n&gt; &gt; opposed to the INCORRECT diagram made by Polish researcher Wojciech \n&gt; &gt; Drewniak...http://www.worlditc.org/k_06_spiricom.htm ).\n&gt; &gt; \n&gt; &gt; While my research is still not finished (and I&#39;ve been working on this \n&gt; &gt; for a little over 2 years), I&#39;m leaning toward the Mark IV \n&gt; &gt; conversations as having been hoaxed by Bill O&#39;Neil. HOWEVER - I believe \n&gt; &gt; he acted alone and that none of the other members of the Metascience \n&gt; &gt; Foundation were involved with this hoax. As to O&#39;Neil&#39;s motivation for \n&gt; &gt; the hoax - I still don&#39;t know. But I will also say that the veridical \n&gt; &gt; evidence that O&#39;Neil claims to have received about Dr. George J. \n&gt; &gt; Mueller through clairaudience is amazing and it is tough to see how \n&gt; &gt; O&#39;Neil would have gotten this information given his finances, location, \n&gt; &gt; the timeframe, etc.\n&gt; &gt; \n&gt; &gt; I&#39;ve been promising to get my personal website up and operating for \n&gt; &gt; some time now but have been busy. Hopefully soon. Then I&#39;ll start \n&gt; &gt; posting what I have found out so far.\n&gt; &gt; \n&gt; &gt; Guy Jackson\n&gt; &gt; \n&gt; &gt; P.S. The recordings of the Spiricom cassette that can be found at the \n&gt; &gt; GOS website ( http://www.ghostpix.com/spiricom/spiricom.html ) are very \n&gt; &gt; poor. Scott L over at Ghostly Talk pulled much a much cleaner version \n&gt; &gt; directly from a source cassette provided to him by Mark Macy ( see \n&gt; &gt; Ghostly Talk show archive noted as a &quot;Bonus&quot; and &quot;Repost&quot; for August \n&gt; &gt; 22, 2006: http://www.ghostlytalk.com/node/616 ). \n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;alexrondini&quot; &lt;alexrondini@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; Hi all,\n&gt; &gt; &gt; \n&gt; &gt; &gt;     I&#39;m new on this group. Not too sure whether this topic was \n&gt; &gt; &gt; discussed already or not but I wanted to get your oppinion on the \n&gt; &gt; &gt; Spiricon device.  Does anyone know more about it?\n&gt; &gt; &gt; \n&gt; &gt; &gt; Alex"}