{"id": "10036", "subject": "Re: Spiricom Device", "author": "LC Duplatt", "timestamp": "2008-04-18T14:24:32Z", "full_text": "I formally thought &quot;hoax,&quot; too, until I found how easy it is for \nghosts/spirits, etc to use these different devices we have today to \ncommunicate through.  \n\nIt&#39;s almost as if the ability to talk to the other side has been \nthere the whole time, or better yet, that the other side has been \ncommunicating with us the whole time, but we simply needed to \nbecome &quot;awakened&quot; to it...\n\nLC\n\n--- In EVP-ITC@yahoogroups.com, &quot;Stefan Bion&quot; &lt;yahoogroups@...&gt; wrote:\n&gt;\n&gt; When I first listened to the Spiricom samples several years ago, my \nimmediate impression was: Hmm, it sounds like someone using \nan &quot;electronic larynx&quot; (speech aid device). This impression was \nstrengthened by the observation that the buzzing sound often was even \nmodulated by O&#39;Neill&#39;s own voice during the dialoges between him \nand &quot;Dr. Mueller&quot;! (Did O&#39;Neill forget to remove the device from his \nthroat while talking to his counterpart?)\n&gt; \n&gt; And what about the &quot;13 frequencies&quot; that are supposed to be used as \nthe &quot;carrier&quot; for the spirit voices? Why aren&#39;t they audible in the \nrecordings? And why does a mixture of the 13 tones created with \nAudition sound so different from the typical &quot;Spiricom buzz&quot;? - Well, \nif you analyze the frequency spectrum of the buzzing sound (this can \nbe done with Audition etc.), you will find a lot of harmonics (peaks \nin the spectrum), and some of these harmonics more or less match the \n13 Spiricom frequencies...\n&gt; \n&gt; To me, the entire Spiricom saga produces more questions than \nanswers...\n&gt; \n&gt; ----- original Nachricht --------\n&gt; \n&gt; Betreff: [EVP-ITC] Re: Spirico Device\n&gt; Gesendet: Fr, 18. Apr 2008\n&gt; Von: alexrondini&lt;alexrondini@...&gt;\n&gt; \n&gt; &gt; Thanks Guy, I have heard a few people mention that O&#39;Neil hoaxed \nit \n&gt; &gt; but I don&#39;t know enough about this to really pass any sort of \n&gt; &gt; judgement.  Looking forward to seeing your website.\n&gt; &gt; \n&gt; &gt; Alex\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;Guy&quot; &lt;yzzzguy@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; In regards to the Spiricom story - I have to assume you&#39;re \nreferring to \n&gt; &gt; &gt; the Mark IV model as diagrammed/written up in the Spiricom \nmanual (as \n&gt; &gt; &gt; opposed to the INCORRECT diagram made by Polish researcher \nWojciech \n&gt; &gt; &gt; Drewniak...http://www.worlditc.org/k_06_spiricom.htm ).\n&gt; &gt; &gt; \n&gt; &gt; &gt; While my research is still not finished (and I&#39;ve been working \non this \n&gt; &gt; &gt; for a little over 2 years), I&#39;m leaning toward the Mark IV \n&gt; &gt; &gt; conversations as having been hoaxed by Bill O&#39;Neil. HOWEVER - I \nbelieve \n&gt; &gt; &gt; he acted alone and that none of the other members of the \nMetascience \n&gt; &gt; &gt; Foundation were involved with this hoax. As to O&#39;Neil&#39;s \nmotivation for \n&gt; &gt; &gt; the hoax - I still don&#39;t know. But I will also say that the \nveridical \n&gt; &gt; &gt; evidence that O&#39;Neil claims to have received about Dr. George \nJ. \n&gt; &gt; &gt; Mueller through clairaudience is amazing and it is tough to see \nhow \n&gt; &gt; &gt; O&#39;Neil would have gotten this information given his finances, \nlocation, \n&gt; &gt; &gt; the timeframe, etc.\n&gt; &gt; &gt; \n&gt; &gt; &gt; I&#39;ve been promising to get my personal website up and operating \nfor \n&gt; &gt; &gt; some time now but have been busy. Hopefully soon. Then I&#39;ll \nstart \n&gt; &gt; &gt; posting what I have found out so far.\n&gt; &gt; &gt; \n&gt; &gt; &gt; Guy Jackson\n&gt; &gt; &gt; \n&gt; &gt; &gt; P.S. The recordings of the Spiricom cassette that can be found \nat the \n&gt; &gt; &gt; GOS website ( http://www.ghostpix.com/spiricom/spiricom.html ) \nare very \n&gt; &gt; &gt; poor. Scott L over at Ghostly Talk pulled much a much cleaner \nversion \n&gt; &gt; &gt; directly from a source cassette provided to him by Mark Macy ( \nsee \n&gt; &gt; &gt; Ghostly Talk show archive noted as a &quot;Bonus&quot; and &quot;Repost&quot; for \nAugust \n&gt; &gt; &gt; 22, 2006: http://www.ghostlytalk.com/node/616 ). \n&gt; &gt; &gt; \n&gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;alexrondini&quot; &lt;alexrondini@&gt; \nwrote:\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Hi all,\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt;     I&#39;m new on this group. Not too sure whether this topic \nwas \n&gt; &gt; &gt; &gt; discussed already or not but I wanted to get your oppinion on \nthe \n&gt; &gt; &gt; &gt; Spiricon device.  Does anyone know more about it?\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; Alex\n&gt;"}