{"id": "10073", "subject": "Re: mike, about asking questions", "author": "purplespacefriend", "timestamp": "2008-04-19T00:11:18Z", "full_text": "Thanks! More of a figure of speech, as in why give advice when few \nhear it.  \n\n Frank\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;psfponies&quot; &lt;psfponies@...&gt; wrote:\n&gt;\n&gt; I agree please dont give up Frank. You are the reason I come to \nthis \n&gt; site I wanted to learn more about the Franks box and how it works. \nI \n&gt; still find it so mind boggling that you were about to come up with \na \n&gt; box to communicate with the dead. I have only recorded a few \nsession \n&gt; and have already got the message I_see_princess at least the \nspirits \n&gt; all now who started the box research!\n&gt; \n&gt; Newbie Kay\n&gt; \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Wiliam Clarke &lt;reesclarke_69@&gt; \n&gt; wrote:\n&gt; &gt;\n&gt; &gt; Please don&#39;t give up.  I am still learning, and I need a \nteacher.  \n&gt; Even though we don&#39;t know each other.  I try to learn something \n&gt; everday from you, so I will be able to make my own box one day.   \n&gt; Even if is a frankinized 12-469, or made from a car stereo.  I \nwith \n&gt; ya all the way, even though some stuff I know nothing about, and \n&gt; thats why I learn, to get educated on the subject.  I have already \n&gt; studying basic electronics.\n&gt; &gt;    \n&gt; &gt;   William\n&gt; &gt; \n&gt; &gt; Frank Sumption &lt;purplealiengirl@&gt; wrote:\n&gt; &gt;            I give up! Don&#39;t listen to someone that has done this \n&gt; stuff longer than anyone. Just get all your information from TAPS, \n&gt; and Paranormal State, ---- Hollywood! All friggin&#39; glamor and \ngreed \n&gt; and attention seekers, nothing else! And that seems to be all that \n&gt; is sought after on these groups. I don&#39;t have time for this, and \n&gt; this not what I made the boxes for! \n&gt; &gt;  \n&gt; &gt;  Whatever you do don&#39;t let spirit speak, try to second guess \n&gt; everything, always assume y&#39;all are so much more advanced. \n&gt; &gt;  \n&gt; &gt;  \n&gt; &gt;  Frank-S\n&gt; &gt; \n&gt; &gt;   \n&gt; &gt; ---------------------------------\n&gt; &gt;   Get in touch in an instant. Get Windows Live Messenger now.   \n&gt; &gt; \n&gt; &gt;                            \n&gt; &gt; \n&gt; &gt;        \n&gt; &gt; ---------------------------------\n&gt; &gt; Be a better friend, newshound, and know-it-all with Yahoo! \n&gt; Mobile.  Try it now.\n&gt; &gt;\n&gt;"}