{"id": "10077", "subject": "Re: [EVP-ITC] Editing EVP", "author": "Lisby", "timestamp": "2008-04-18T22:54:39Z", "full_text": "William--\n\nI have gotten some very long sequences and have posted them, as they  \nwere given to me. I do not clip anything out. My messages come  \nthrough very, very quickly, so I do slow them and often amplify the  \nsequence. So, long sequences are indeed possible and do happen. I  \njust want you to know that is the case.\n\n\nAnn\n\nOn Apr 18, 2008, at 10:41 AM, Wiliam Clarke wrote:\n\n&gt;\n&gt; Bruce,\n&gt;\n&gt; My only problem with this is when I did started Box research 2 1/2  \n&gt; - 3 Months ago.  From ghost box research (not sound soap, or  \n&gt; EVPmaker) I saw alot of messages/files posted  that were 4-10 words  \n&gt; long, and you and others were bragging on how long of a message  \n&gt; y&#39;all had, and that nobody else could get messages that long.  That  \n&gt; is were I feel that I have been mislead.  I didn&#39;t know that those  \n&gt; files/messages had the garbage cut out of it.  I actually thought  \n&gt; y&#39;all got messages that long from the radio/Franks Box.  I was  \n&gt; trying to get communication like that,  and wondered why I  \n&gt; couldn&#39;t.  I do know now that it is physically possible to get that  \n&gt; type of communication after I lost my session 22, but it doesn&#39;t  \n&gt; happen like that every time.  I mean no disrespect about this  \n&gt; situation.  Also I don&#39;t see myself as a &quot;Newbie&quot; anymore.  If you  \n&gt; want to go by ranks, I would like to be refer ed as a &quot;amateur box  \n&gt; researcher&quot;.  If you have anything else to say, I think it needs to  \n&gt; be taken care of in private emails.  You should have my work and  \n&gt; personal email addresses.\n&gt;\n&gt; Thanks\n&gt;\n&gt; William\n&gt;\n&gt; bruce halliday &lt;paranormalinvestigating@...&gt; wrote:\n&gt; William,\n&gt;\n&gt; With all do respect and I do mean that.\n&gt;\n&gt; You are a newbie and you just started box research.\n&gt; You are pursuing this subject quite passionately.\n&gt;\n&gt; If you feel that you have been misled in any advice or  \n&gt; representation here.\n&gt; Go back and look at the posts from when you first started asking  \n&gt; questions.\n&gt;\n&gt; you will note that I have always said that the &quot;CRAP&quot; was cut from  \n&gt; my files\n&gt; and even have recommended audio programs to new researchers for  \n&gt; that specific purpouse.\n&gt;\n&gt; And you seem to be under the misconception that because you take  \n&gt; out the blips and blurbs\n&gt; that the message or answer somehow changes, no it does not!\n&gt;\n&gt; the message is the same only the bits of noise crap are gone.\n&gt; It&#39;s like you speaking a sentence once and coughing in the middle,  \n&gt; and then repeating the sentence without coughing.\n&gt; It&#39;s the same sentence with the same meaning, minus the cough.\n&gt;\n&gt; William, I like you and your dedication to learning this research,  \n&gt; but you are still learning and should take in subjects like this  \n&gt; and digest them\n&gt; before arguing the point with much more experienced researchers.\n&gt;\n&gt; Again no disrespect meant, just some advice from a friend.\n&gt;\n&gt; Bruce\n&gt;\n&gt;\n&gt; Bruce Halliday\n&gt;\n&gt;\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; From: reesclarke_69@...\n&gt; Date: Thu, 17 Apr 2008 10:07:18 -0700\n&gt; Subject: RE: [EVP-ITC] Editing EVP\n&gt;\n&gt; My point is let everybody know that the clip is cut, because it  \n&gt; just might mislead people (Newbies) in thinking that you get  \n&gt; messages that long without all the bullshit.  They might wander why  \n&gt; they can&#39;t get a messages like that.  I think I been somewhat mis  \n&gt; lead myself on this subject when I first started box research.\n&gt;\n&gt; Rees.\n&gt;\n&gt; Ron Lederer &lt;ronriko@...&gt; wrote:\n&gt; Sorry, don&#39;t get the point rees.  Ron L\n&gt;\n&gt; Wiliam Clarke &lt;reesclarke_69@...&gt; wrote:\n&gt; My thoughts on cut out the garbage leads people to believe that the  \n&gt; messages that some people are getting messages are all in one  \n&gt; sentence.\n&gt;\n&gt; Example Question: How are you today?\n&gt;\n&gt; 1st Answer:(Cut Up) I&#39;m good, me and my spirts friends here wants  \n&gt; to give you a long message for the reseachers to here&gt;\n&gt;\n&gt; 2nd Answer:(Not Cut) I&#39;m blah blah blah blah blah blah blah blah  \n&gt; blah blah blah good blah blah.\n&gt; Does anybody see my point on cut up messages?\n&gt;\n&gt; Rees\n&gt;\n&gt; bruce halliday &lt;paranormalinvestigating@...&gt; wrote:\n&gt; Stefan,\n&gt;\n&gt; I do remove the &quot;garbage&quot; from my files.\n&gt;\n&gt; At this point in my research, the message is more important to me  \n&gt; than the proof of it.\n&gt; I think most of us here will agree that we are receiving some sort  \n&gt; of paranormal communication.\n&gt; but it definitely exists. now we need to concentrate on the  \n&gt; messages they need us to hear and the answers to the questions\n&gt; we ask and in turn our answers to their questions. Anyone that  \n&gt; cleans a file in this way should not be touching any bit of the file\n&gt; that has a semblance of speech, only the bits that are odiously  \n&gt; garbage like the &quot;EH O EH AH O EH UR&quot; in between words.\n&gt;\n&gt; For example &quot;Is there anyone here that wishes to communicate_YES_AH  \n&gt; ER EEH AR OOO AR_WE ARE_EH IH AHH EHH_HERE&quot;\n&gt; It is much easier for me as a researcher to be able to return to a  \n&gt; file that I recieved two weeks ago and that I believe may hold some\n&gt; relivence to a message I just received and be able to cleanly  \n&gt; listen to it, without the distraction of the garbage sounds.\n&gt;\n&gt; At this stage in real time communication the messages are the top  \n&gt; priority.\n&gt; I do however agree that the untouched version should be retained  \n&gt; and made available to individuals that make a request\n&gt; for any intelligent sceptical or authenticity challenge that may be  \n&gt; made, and god knows there are always fanatical\n&gt; sceptics lurking in the shadows awaiting an opportunity to attack  \n&gt; an unwary or injured researcher. I do not think that\n&gt; our research files should be made available on request by every tom  \n&gt; dick and harry that is unknown to us and may potentially\n&gt; doctor the file to suit their own point and post it as such.\n&gt;\n&gt; I have had this happen to me in the past so I believe the  \n&gt; researcher that receives the request for raw research data should\n&gt; scrutinize the requesting source and use their best judgment before  \n&gt; handing out any research data.\n&gt;\n&gt; These are my thoughts on the subject of cleaning a file.\n&gt;\n&gt; Bruce\n&gt;\n&gt;\n&gt; Bruce Halliday\n&gt;\n&gt;\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; From: yahoogroups@...\n&gt; Date: Thu, 17 Apr 2008 09:55:42 +0200\n&gt; Subject: [EVP-ITC] Editing EVP\n&gt;\n&gt; Hi all,\n&gt;\n&gt; just a general comment on editing EVP: For scientific reasons, I would\n&gt; suggest not to edit an EVP message partially, but only as a whole, in\n&gt; order to rule out any possible suspicion of manipulation. You can for\n&gt; instance increase the volume or dynamics of an entire clip (including\n&gt; the experimenter&#39;s voice), filter or denoise it to make it clearer,  \n&gt; but\n&gt; not cut out individual pieces (supposed &quot;garbage&quot;) to make an EVP  \n&gt; match\n&gt; with what it &quot;should be&quot;. At least, the unedited version should always\n&gt; be provided along with the edited version.\n&gt;\n&gt; But that&#39;s only my personal opinion which I thought I had to  \n&gt; express, as\n&gt; we should always be able to present our results to a critical public.\n&gt;\n&gt; Stefan\n&gt;\n&gt; -- \n&gt;\n&gt; &gt; Believe or not Ron, very little editing is involved for these files.\n&gt; &gt; After my question, i isolate the response section and slow that\n&gt; &gt; section down about 20%. Now i can actually start to hear the message\n&gt; &gt; a lot clearer, i also now see a couple sections of just noise that\n&gt; &gt; don&#39;t belong and eliminate them from the mix. You can&#39;t piece these\n&gt; &gt; files together to make something it&#39;s not, so i keep them in true\n&gt; &gt; form pretty much to the original.\n&gt;\n&gt; &gt; -Steve\n&gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com, Ron Lederer &lt;ronriko@...&gt; wrote:\n&gt; &gt;&gt;\n&gt; &gt;&gt; Hey Steve Forgot to ask...how much editing was needed to get this\n&gt; &gt; file? Did you need to take out a lot of garbage between words\n&gt; &gt; withing the message? Ron L\n&gt;\n&gt;\n&gt;\n&gt; More immediate than e-mail? Get instant access with Windows Live  \n&gt; Messenger.\n&gt;\n&gt; Be a better friend, newshound, and know-it-all with Yahoo! Mobile.  \n&gt; Try it now.\n&gt;\n&gt; Be a better friend, newshound, and know-it-all with Yahoo! Mobile.  \n&gt; Try it now.\n&gt;\n&gt; Be a better friend, newshound, and know-it-all with Yahoo! Mobile.  \n&gt; Try it now.\n&gt;\n&gt;\n&gt; Going green? See the top 12 foods to eat organic.\n&gt;\n&gt;\n&gt; Be a better friend, newshound, and know-it-all with Yahoo! Mobile.  \n&gt; Try it now.\n&gt;\n&gt; Be a better friend, newshound, and know-it-all with Yahoo! Mobile.  \n&gt; Try it now.\n&gt;\n&gt; \n\n\nWilliam--I ha e go en some e y long sequences and ha e pos ed hem, as hey we e gi en o me. I do no clip any hing ou . My messages come h ough e y, e y quickly, so I do slow hem and o en ampli y he sequence. So, long sequences a e indeed possible and do happen. I jus wan you o know ha is he case.AnnOn Ap 18, 2008, a 10:41 AM, Wiliam Cla ke w o e:B uce, My only p oblem wi h his is when I did s a ed Box esea ch 2 1/2 - 3 Mon hs ago.  F om ghos box esea ch (no sound soap, o EVPmake ) I saw alo o messages/ iles pos ed  ha we e 4-10 wo ds long, and you and o he s we e b agging on how long o a message y'all had, and ha nobody else could ge messages ha long.  Tha is we e I eel ha I ha e been mislead.  I didn' know ha hose iles/messages had  he ga bage cu ou o i .  I ac ually hough y'all go messages ha long om he adio/F anks Box.  I was  ying o ge communica ion like ha ,  and wonde ed why I couldn' .  I do know now ha i is physically possible o ge ha ype o communica ion a e I los my session 22, bu i doesn' happen like ha e e y ime.  I mean no dis espec abou his si ua ion.  Also I don' see mysel as a \"Newbie\" anymo e.  I  you wan o go by anks, I would like o be e e ed as a \"ama eu box esea che \".  I you ha e any hing else o say, I hink i needs o be aken ca e o in p i a e emails.  You should ha e my wo k and pe sonal email add esses. Thanks William b uce halliday ing@ho mail.com> w o e:William, Wi h all do espec and I do mean ha .  You a e a newbie and you jus s a ed box esea ch.You a e pu suing his subjec qui e passiona ely. I you eel ha you ha e been misled in any ad ice o ep esen a ion he e.Go back and look a he pos s om when you i s s a ed asking ques ions. you will no e ha I ha e always said ha he \"CRAP\" was cu om my ilesand e en ha e ecommended audio p og ams o new esea che s o ha speci ic pu pouse. And you seem o be unde he misconcep ion ha because you ake ou he blips and blu bs ha he message o answe somehow changes, no i does no !  he message is he same only he bi s o noise c ap a e gone.I 's like you speaking a sen ence once and coughing in he middle, and hen epea ing he sen ence wi hou coughing.I 's he same sen ence wi h he same meaning, minus he cough. William, I like you and you dedica ion o lea ning his esea ch, bu you a e s ill lea ning and should ake in subjec s like his and diges hembe o e a guing he poin wi h much mo e expe ienced esea che s. Again no dis espec mean , jus some ad ice om a iend. B uceB uce Halliday To: EVP-ITC@yahoog oups.comF om: eescla ke_69@yahoo.comDa e: Thu, 17 Ap 2008 10:07:18 -0700Subjec : RE: [EVP-ITC] Edi ing EVPMy poin is le e e ybody know ha he clip is cu , because i jus migh mislead people (Newbies) in hinking ha you ge messages ha long wi hou all he bullshi .  They migh wande why hey can' ge a messages like ha .  I hink I been somewha mis lead mysel on his subjec when I i s s a ed box esea ch. Rees. Ron Lede e com> w o e:So y, don' ge   he poin   ees.  Ron LWiliam Cla ke yahoo.com> w o e:My hough s on cu ou he ga bage leads people o belie e ha he messages ha some people a e ge ing messages a e all in one sen ence. Example Ques ion: How a e you oday?  1s Answe :(Cu Up) I'm good, me and my spi s iends he e wan s o gi e you a long message o he eseache s o he e>  2nd Answe :(No Cu ) I'm blah blah blah blah blah blah blah blah blah blah blah good blah blah.Does anybody see my poin on cu up messages? Reesb uce halliday ing@ho mail.com> w o e:S e an, I do  emo e he \"ga bage\" om my iles. A his poin in my esea ch, he message is mo e impo an o me han he p oo o i .I hink mos o us he e will ag ee ha we a e ecei ing some so o pa ano mal communica ion.bu i de ini ely exis s. now we need o concen a e on he messages hey need us o hea and he answe s o he ques ionswe ask and in u n ou answe s o hei ques ions. Anyone ha cleans a ile in his way should no be ouching any bi o he ile ha has a semblance o speech, only he bi s ha a e odiously ga bage like he \"EH O EH AH O EH UR\" in be ween wo ds. Fo example \"Is he e anyone he e ha wishes o communica e_YES_AH ER EEH AR OOO AR_WE ARE_EH IH AHH EHH_HERE\"I is much easie o me as a esea che o be able o e u n o a ile ha I ecie ed wo weeks ago and  ha I belie e may hold some eli ence o a message I jus ecei ed and be able o cleanly lis en o i , wi hou he dis ac ion o he ga bage sounds. A his s age in eal ime communica ion he messages a e he op p io i y.I do howe e ag ee ha he un ouched e sion should be e ained and made a ailable o indi iduals  ha make a eques   o any in elligen  scep ical o au hen ici y challenge ha may be made, and god knows he e a e always ana ical scep ics lu king in he shadows awai ing an oppo uni y o a ack an unwa y o inju ed esea che . I do no hink ha  ou esea ch iles should be made a ailable on eques by e e y om dick and ha y ha is unknown o us and may po en iallydoc o he ile o sui hei own poin and pos i as such. I ha e had his happen o me in he pas so I belie e he esea che ha ecei es he eques o aw esea ch da a should sc u inize he eques ing sou ce and use hei bes judgmen be o e handing ou any esea ch da a. These a e my hough s on he subjec o cleaning a ile. B uceB uce Halliday To: EVP-ITC@yahoog oups.comF om: yahoog oups@s e anbion.deDa e: Thu, 17 Ap 2008 09:55:42 +0200Subjec : [EVP-ITC] Edi ing EVPHi all,jus a gene al commen on edi ing EVP: Fo scien i ic easons, I wouldsugges no o edi an EVP message pa ially, bu only as a whole, ino de o ule ou any possible suspicion o manipula ion. You can o ins ance inc ease he olume o dynamics o an en i e clip (including he expe imen e 's oice), il e o denoise i o make i clea e , bu no cu ou indi idual pieces (supposed \"ga bage\") o make an EVP ma chwi h wha i \"should be\". A leas , he unedi ed e sion should alwaysbe p o ided along wi h he edi ed e sion.Bu ha 's only my pe sonal opinion which I hough I had o exp ess, aswe should always be able o p esen ou esul s o a c i ical public.S e an-- > Belie e o no Ron, e y li le edi ing is in ol ed o hese iles.> A e my ques ion, i isola e he esponse sec ion and slow ha  > sec ion down abou 20%. Now i can ac ually s a o hea he message > a lo clea e , i also now see a couple sec ions o jus noise ha  > don' belong and elimina e hem om he mix. You can' piece hese > iles oge he o make some hing i 's no , so i keep hem in ue > o m p e y much o he o iginal.> -S e e> --- In EVP-ITC@yahoog oups.com, Ron Lede e > w o e:>>>> Hey S e e Fo go o ask...how much edi ing was needed o ge his > ile? Did you need o ake ou a lo o ga bage be ween wo ds > wi hing he message? Ron LMo e immedia e han e-mail? Ge ins an access wi h Windows Li e Messenge .Be a be e iend, newshound, and know-i -all wi h Yahoo! Mobile. T y i now.Be a be e iend, newshound, and know-i -all wi h Yahoo! Mobile. T y i now.Be a be e iend, newshound, and know-i -all wi h Yahoo! Mobile. T y i now.Going g een? See he op 12 oods o ea o ganic.Be a be e iend, newshound, and know-i -all wi h Yahoo! Mobile. T y i now.Be a be e iend, newshound, and know-i -all wi h Yahoo! Mobile. T y i now."}