{"id": "10087", "subject": "Re: [EVP-ITC] Undies in a Bundy!", "author": "Rhonda W", "timestamp": "2008-04-19T03:55:49Z", "full_text": "--0-2110185670-1208577349=:83440\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nI understand now what ya&#39;ll are saying...it never occurred to me to edit my stuff to make it sound good nor did it occur to me that others on here would either....but ur right there are people out there who are dishonest and would do that without blinkin an eye....which is sad and would make it hard on our parts to prove to skeptics that we arent BSing them.  Im gonna stop cuttin out the garbage in my files....I was doing it mainly to save us some space on the forum cuz I dont want us to run out and have to delete stuff. (would prolly help if everyone posted mp3s tho instead of wav files even if they are short they are still bigger than the mp3)\n   \n  Rhonda\n  \n\nJules &lt;ghostchasingfool@...&gt; wrote:\n          Holy Cow, I leave for my daughters school event at 3:30 and I have \ntoo much email on this subject!\n\nFirst and foremost I was directing those who are in fact are \nparanormal investigators, in field research. Many here are not! I \nwas in no way implying that Bruce, Steve, etc. were fabricating their \naudio clips in any way!!!! I HIGH RESPECT BRUCE, STEVE AND THE the \nother on this board! I am speaking from my experiences, and being in \nthe line of fire throughout the years regarding cutting and pasting \nclips together.\n\nI don&#39;t care what you do to be completely honest, I just know that \ngiven the drama and know how nasty people can be, I will not cut and \npaste which is my preference. Just because someone who does, given \ntheir reputation (such as Bruce&#39;s) I certainly would have no reason \nto question the authenticity of his work. However, there are those \nwho I do question, such as the post of Mr.Roundtrees photo&#39;s (posted \nthe previous day) and given the manufacturing of those so called \nghost photo&#39;s I would serious NEVER take any audio he produced as \ncreditable. This is the point I was trying to make. \n\nI will also tell you that a year ago upon listening to some of the \nfiles here, the first thing I noticed was that when I played certain \nfiles I could clearly see with the editing software that they were \nnot raw audio. I immediately formed an opinion that they in fact \ncould be bogus! That was my initial impression. It wasn&#39;t until I \nformed a personal friendship with some of them that I know THEY WOULD \nNEVER comprise their integrity and that this specific research was \nextremely important to them. I will be the first to admit that I was \nvery wrong, but I did base my judgment given what I saw. Other may \njust do the same.\n\nThe average person who happens upon this search who in fact has been \nsubject to those who do not stand behind their research will not know \nbetter. They too may just form the same opinion based on what they \nhave come across in this industry. \n\nMany I have had the pleasure of talking to outside this board, and I \nwill tell you that it is an honor to be among good honest creditable \npeople, who truly do care! I know NONE OF YOU whom I have spoken \nwith would EVER do this, but unfortunately there are those who will.\n\nI hope this clears things up, and people are not going to make a \nmountain out of a mole hill.\n\nJuli\n\n\n\n                           \n\n       \n---------------------------------\nBe a better friend, newshound, and know-it-all with Yahoo! Mobile.  Try it now.\r\n--0-2110185670-1208577349=:83440\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;div&gt;I understand now what ya&#39;ll are saying...it never occurred to me to edit my stuff to make it sound good nor did it occur to me that others on here would either....but ur right there are people out there who are dishonest and would do that without blinkin an eye....which is sad and&nbsp;would make it hard on our parts to prove to skeptics that we arent BSing them.&nbsp; Im gonna stop cuttin out the garbage in my files....I was doing it mainly to save us some space on the forum cuz I dont want us to run out and have to delete stuff. (would prolly help if everyone posted mp3s tho instead of wav files even if they are short they are still bigger than the mp3)&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Rhonda&lt;/div&gt;  &lt;div&gt;&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;Jules &lt;ghostchasingfool@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/div&gt;  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;div&gt;Holy Cow, I leave for my daughters school event at 3:30 and I have &lt;BR&gt;too much email on this subject!&lt;BR&gt;&lt;BR&gt;First and foremost I was directing those who are in fact are &lt;BR&gt;paranormal investigators, in field research. Many here are not! I &lt;BR&gt;was in no way implying that Bruce, Steve, etc. were fabricating their &lt;BR&gt;audio clips in any way!!!! I HIGH RESPECT BRUCE, STEVE AND THE the &lt;BR&gt;other on this board! I am speaking from my experiences, and being in &lt;BR&gt;the line of fire throughout the years regarding cutting and pasting &lt;BR&gt;clips together.&lt;BR&gt;&lt;BR&gt;I don&#39;t care what you do to be completely honest, I just know that &lt;BR&gt;given the drama and know how nasty people can be, I will not cut and &lt;BR&gt;paste which is my preference. Just because someone who\n does, given &lt;BR&gt;their reputation (such as Bruce&#39;s) I certainly would have no reason &lt;BR&gt;to question the authenticity of his work. However, there are those &lt;BR&gt;who I do question, such as the post of Mr.Roundtrees photo&#39;s (posted &lt;BR&gt;the previous day) and given the manufacturing of those so called &lt;BR&gt;ghost photo&#39;s I would serious NEVER take any audio he produced as &lt;BR&gt;creditable. This is the point I was trying to make. &lt;BR&gt;&lt;BR&gt;I will also tell you that a year ago upon listening to some of the &lt;BR&gt;files here, the first thing I noticed was that when I played certain &lt;BR&gt;files I could clearly see with the editing software that they were &lt;BR&gt;not raw audio. I immediately formed an opinion that they in fact &lt;BR&gt;could be bogus! That was my initial impression. It wasn&#39;t until I &lt;BR&gt;formed a personal friendship with some of them that I know THEY WOULD &lt;BR&gt;NEVER comprise their integrity and that this specific research was &lt;BR&gt;extremely important to them. I will be the first to admit\n that I was &lt;BR&gt;very wrong, but I did base my judgment given what I saw. Other may &lt;BR&gt;just do the same.&lt;BR&gt;&lt;BR&gt;The average person who happens upon this search who in fact has been &lt;BR&gt;subject to those who do not stand behind their research will not know &lt;BR&gt;better. They too may just form the same opinion based on what they &lt;BR&gt;have come across in this industry. &lt;BR&gt;&lt;BR&gt;Many I have had the pleasure of talking to outside this board, and I &lt;BR&gt;will tell you that it is an honor to be among good honest creditable &lt;BR&gt;people, who truly do care! I know NONE OF YOU whom I have spoken &lt;BR&gt;with would EVER do this, but unfortunately there are those who will.&lt;BR&gt;&lt;BR&gt;I hope this clears things up, and people are not going to make a &lt;BR&gt;mountain out of a mole hill.&lt;BR&gt;&lt;BR&gt;Juli&lt;BR&gt;&lt;BR&gt;&lt;/div&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;p&gt;&#32;\n\n\n\n      &lt;hr size=1&gt;Be a better friend, newshound, and \nknow-it-all with Yahoo! Mobile. &lt;a href=&quot;http://us.rd.yahoo.com/evt=51733/*http://mobile.yahoo.com/;_ylt=Ahu06i62sR8HDtDypao8Wcj9tAcJ &quot;&gt; Try it now.&lt;/a&gt;\r\n--0-2110185670-1208577349=:83440--"}