{"id": "1009", "subject": "Re: Intro", "author": "wgungfu", "timestamp": "2007-04-03T17:47:53Z", "full_text": "Hi Amy, the group is The Active Paranormal Investigation and Response\nTeam (APIRT).  A paranormal investigative team dedicated to the\ndocumentation and scientific analysis of paranormal activity.\n\nMarty\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;Amy Raiola&quot; &lt;SIParanormalSociety@...&gt;\nwrote:\n&gt;\n&gt; Hi Marty.  What group are you involved with?  I&#39;m from Staten Island\nParanormal Society in NY.  I agree about the drama!  We&#39;re having a\nmeeting tonight and I plan on talking about some EVP experimenting.\n&gt; \n&gt; Amy\n&gt; \n&gt;   ----- Original Message ----- \n&gt;   From: wgungfu&lt;mailto:wgungfu3@...&gt; \n&gt;   To: EVP-ITC@yahoogroups.com&lt;mailto:EVP-ITC@yahoogroups.com&gt; \n&gt;   Sent: Tuesday, April 03, 2007 1:07 AM\n&gt;   Subject: [EVP-ITC] Intro\n&gt; \n&gt; \n&gt;   Hey all, joined a few days ago and just getting around to doing an\nintro.\n&gt; \n&gt;   The name&#39;s Marty, I&#39;ve known Frank (via the internet) for a year and a\n&gt;   few months.\n&gt; \n&gt;   Paranormal investigator, but not interested in promoting &quot;negative and\n&gt;   scary&quot; as Frank calls it (or drama as I call it). Just interested in\n&gt;   research, documentation, etc. \n&gt; \n&gt;   My main interest right now in ITC (beyond as a tool for communication)\n&gt;   is in establishing guidelines/protocols/etc. for evaluation of\n&gt;   recieved communications. I.E. you recieve a valid message (a\n&gt;   confirmed ITC), now you have to go about validating its content. \n&gt;   Frank and I had a few discussions last year regarding context and\n&gt;   meaning of some of the material he was recieving last year around this\n&gt;   time (the changes that were to occur around May through July in 2006)\n&gt;   for example.\n&gt; \n&gt;   I&#39;m very interested in hearing other list member&#39;s experience in this\n&gt;   area and look forward to contributing to this discussion list.\n&gt; \n&gt;   Marty\n&gt;"}