{"id": "10092", "subject": "Re: [EVP-ITC] Re: New file uploaded to EVP-ITC", "author": "Lisby", "timestamp": "2008-04-19T12:28:48Z", "full_text": "The point is what you make it, Steve. For me, it&#39;s the pure  \nunadulterated joy is hearing them speak aloud instead of only  \nclairaudiently in my mind. I can use my other Buddhist and  \nmetaphysical practices for self improvement. As for advancing the  \nrest of the world, I&#39;m not savior material, clearly, but if I can  \nhelp at all, it will be in a small way that ripples--not a large and  \ndramatic one. We&#39;re not going to enlighten humanity in a terrific  \nburst of perfect EVP evidence, I don&#39;t think, no matter how many  \nstrictures we slap on box-derived evidence.\n\nAnn\n\nOn Apr 18, 2008, at 8:16 PM, Steve Hultay wrote:\n\n&gt;\n&gt; I&#39;m with Stefan on this one, i&#39;ll take robotic if i have the\n&gt; opportunity to get longer messages from them. The point is\n&gt; advancement right? Not how cool the voices sound, whether male or\n&gt; female.\n&gt;\n&gt; -Steve\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, Stefan Bion &lt;yahoogroups@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hi Steve & Mike,\n&gt; &gt;\n&gt; &gt; &gt; If we can get the allophone file with real human voices, than this\n&gt; &gt; &gt; would be the next step i think.\n&gt; &gt;\n&gt; &gt; This probably wouldn&#39;t work; the allophones must all have the same\n&gt; &gt; pitch to fit together when concatenated.\n&gt; &gt;\n&gt; &gt; &gt; In a box recording you can get an assemblance of male or female,\n&gt; and\n&gt; &gt; &gt; you can even get language accents. ie british, indian, spanish,\n&gt; etc...\n&gt; &gt; &gt; With the allophone/soap, you have one electroinic voice.\n&gt; &gt;\n&gt; &gt; Of course the robotic sound of the SpeechJet allophones is far from\n&gt; &gt; being natural speech, but it seems to allow longer messages than\n&gt; other\n&gt; &gt; raw audio with more variety of the sounds. So it seems we&#39;ll have to\n&gt; &gt; decide between information content and naturalness/individuality of\n&gt; the\n&gt; &gt; voices.\n&gt; &gt;\n&gt; &gt; Stefan\n&gt; &gt;\n&gt;\n&gt;\n&gt; \n\n\nThe poin is wha you make i , S e e. Fo me, i 's he pu e unadul e a ed joy is hea ing hem speak aloud ins ead o only clai audien ly in my mind. I can use my o he Buddhis and me aphysical p ac ices o sel imp o emen . As o ad ancing he es o he wo ld, I'm no sa io ma e ial, clea ly, bu i I can help a all, i will be in a small way ha ipples--no a la ge and d ama ic one. We' e no going o enligh en humani y in a e i ic bu s o pe ec EVP e idence, I don' hink, no ma e how many s ic u es we slap on box-de i ed e idence.AnnOn Ap 18, 2008, a 8:16 PM, S e e Hul ay w o e:I'm wi h S e an on his one, i'll ake obo ic i i ha e he oppo uni y o ge longe messages om hem. The poin is ad ancemen igh ? No how cool he oices sound, whe he male o   emale.-S e e--- In EVP-ITC@yahoog oups.com, S e an Bion ...> w o e:>> Hi S e e & Mike,> > > I we can ge he allophone ile wi h eal human oices, han his> > would be he nex s ep i hink. > > This p obably wouldn' wo k; he allophones mus all ha e he same> pi ch o i oge he when conca ena ed.> > > In a box eco ding you can ge an assemblance o male o emale, and> > you can e en ge language accen s. ie b i ish, indian, spanish, e c...> > Wi h he allophone/soap, you ha e one elec oinic oice.> > O cou se he obo ic sound o he SpeechJe allophones is a om> being na u al speech, bu i seems o allow longe messages han o he > aw audio wi h mo e a ie y o he sounds. So i seems we'll ha e o> decide be ween in o ma ion con en and na u alness/indi iduali y o   he> oices.> > S e an>"}