{"id": "10151", "subject": "RE: [EVP-ITC] Undies in a Bundy!-Bruce & NEone else I may have offended", "author": "Rhonda W", "timestamp": "2008-04-19T21:03:45Z", "full_text": "--0-1392204066-1208639025=:16612\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nBruce,\n  And anyone else who I may have offended with my email in response to Juli&#39;s.\n   \n  When I said that about dishonest people, I wasn&#39;t talking about you......Juli mentioned some guy who posted bogus pictures and how she would be leery listening to any of his recordings(and I agree, I would be leery too).   \n  Quote from Juli down below:\n   \n  &quot;However, there are those who I do question, such as the post of Mr.Roundtrees photo&#39;s (posted the previous day) and given the manufacturing of those so called \nghost photo&#39;s I would serious NEVER take any audio he produced as creditable. \n  This is the point I was trying to make.&quot;\n   \n  (That&#39;s what I was responding to in regards to dishonest people and frauds). \n   \n  I&#39;m sorry if it came across differently to you, that wasn&#39;t my intention....If editing(cutting out junk) makes you a &quot;fraud&quot; then I guess I am a fraud too cuz I&#39;ve been cutting junk(static) out of all my clips too!!  But if you read my email it also kinda directs that towards people who cut and paste answers from different parts of the session, to make it match the question they asked.....editing stuff to make it sound good, like ya just had a 5 min convo, or to get the perfect answer to a question you asked.(when I say &quot;you&quot; Im not talking aboutYOU Bruce)\n   \n  &quot;it never occurred to me to edit my stuff to make it sound good nor did it occur to me that others on here would either....but ur right there are people out there who are dishonest and would do that without blinkin an eye&quot;\n   \n  I do agree to the skeptics and debunkers be damned!  And ur right, we don&#39;t have to prove anything to them...only real way for them to believe is to be sitting right next to us.  \n   \n  I would, however, like to be taken seriously(not saying that people don&#39;t take you or anyone else seriously)...but since I&#39;m a newbie at this....I feel like i do have to prove myself.....I just don&#39;t want people thinking I&#39;m one of those dishonest types that are out there in the WORLD(not here in the forums) so I&#39;m gonna try to remember not to edit my sessions but Im sure I&#39;ll forget. (I do save my raw files too incase anyone questions my clips.)...the spirits usually answer any questions almost right away, within 10 to 20 seconds normally.  I just figured I&#39;d cut out the garbage(static in between) in order to make smaller files and save space. (Cuz someone said we had to start posting mp3&#39;s and making our files smaller...think Misty said that) \n   \n  Like I said it never crossed my mind to pull of some trickery like moving answers around to make it fit to my questions(and I know you would NEVER do that either...heck I didn&#39;t even have a single thought about anyone on the two forums doing such a thing...it never crossed my mind that people doing the box research would be dishonest like that until Juli posted that part about the guy with the bogus photos)...but there are all kinds of dishonest people in this world(NOT YOU BRUCE!!!) and I&#39;m sure they would do just that without batting an eyelash.(Maybe I just like to see the innocense in everyone til they screw it up)\n   \n  Oh and I had no idea Juli had sent out a 2nd emailing excluding you and Steve...never got that email...probably made its way into my bulk folder like some do.\n   \n  I&#39;m thinkin maybe you misread what I wrote...when you put part of my email into bold and underline you left out a part:\n  &quot;...it never occurred to me to edit my stuff to make it sound good nor did it occur to me that others on here would either....but ur right there are people out there who are dishonest and would do that without blinkin an eye.&quot;\n   (meaning it never crossed my mind that anyone on these forums would ever be dishonest like that and I still believe the people posting are honest and will stick by that..the only thing that would make me change my mind on that is IF someone got busted)\n   \n  Anyways wanted to clear that up with you...I wasn&#39;t directing my email towards you or anyone else on the forums and I wasn&#39;t calling anyone on here a fraud...cuz that would be like the pot calling the kettle black then (I edited my files by cutting out junk in between too!) and I&#39;m sorry if you felt it came off that way...I didn&#39;t mean for it to...sometimes I have a bit of a hard time trying to express myself via email...if we was talkin in real life, face to face that would be a whole `nother ball of wax.\n   \n   \n  Rhonda\n  \n\nbruce halliday &lt;paranormalinvestigating@...&gt; wrote:\n          Rhonda,\n \nI have explained why, and have even posted a comparison file to bolster my explanation.\nSceptics are closed minded individuals that will never concede to any kind of paranormal proof\nno matter how it is presented, in my original post I stated that I was beyond considering proving this communication.\nOne would only have to turn on a box in someones presence to do that. The important thing to me now\nIs the messages that are being received and understanding their meaning. If that takes me cutting out a few blips and blahs\nfrom a file in order to hear the message without interruption, so be it. Hard line sceptics in my book are the bottom feeders of \nthe paranormal world, because they are incompetenet when it comes to gathering valid data or they are frightened by the \nchance of proving something that they are afraid really does exist or for whatever reason. in my ten years of experience in dealing with them\nI have never run into one that&#39;s mind could be changed, even if it was a manifested spirit themselves trying to change it.\n \nSo to me Sceptics and debunkers be damned!\n \nI clip the garbage from my files and so do some of the other more experienced \nresearchers here. By your statement in this post you are saying that I am a dishonest researcher and the files I present are doctored or fraudulent.\n \n&quot;did it occur to me that others on here would either....\nbut ur right there are people out there who are dishonest \nand would do that without blinkin an eye....&quot;\n \n \n \nJuli was very hasty in writing that post and It was actually directed at a single individual, it should never have been written without forethought of the ramifications it would insinuate.\nShe has attempted to amend her position in a short post following the one she wrote mentioning my name and Steve&#39;s name, omitting us from her comments. But I guess that did not work evidently, Like I told her most readers of the post would take the wrong meaning.\n \nAt this point in my research I do not feel the need to prove anything to anyone, and like I said all raw versions of my files will be made available upon request by respected critics in this field.\n \nBruce\n \n\n\n \n  Bruce Halliday \n\n\n\n\n    \n---------------------------------\n  To: EVP-ITC@yahoogroups.com\nFrom: rhondak1973@...\nDate: Fri, 18 Apr 2008 20:55:49 -0700\nSubject: Re: [EVP-ITC] Undies in a Bundy!\n\n        I understand now what ya&#39;ll are saying...it never occurred to me to edit my stuff to make it sound good nor did it occur to me that others on here would either....but ur right there are people out there who are dishonest and would do that without blinkin an eye....which is sad and would make it hard on our parts to prove to skeptics that we arent BSing them.  Im gonna stop cuttin out the garbage in my files....I was doing it mainly to save us some space on the forum cuz I dont want us to run out and have to delete stuff. (would prolly help if everyone posted mp3s tho instead of wav files even if they are short they are still bigger than the mp3)\n   \n  Rhonda\n  \n\nJules &lt;ghostchasingfool@...&gt; wrote:\n      Holy Cow, I leave for my daughters school event at 3:30 and I have \ntoo much email on this subject!\n\nFirst and foremost I was directing those who are in fact are \nparanormal investigators, in field research. Many here are not! I \nwas in no way implying that Bruce, Steve, etc. were fabricating their \naudio clips in any way!!!! I HIGH RESPECT BRUCE, STEVE AND THE the \nother on this board! I am speaking from my experiences, and being in \nthe line of fire throughout the years regarding cutting and pasting \nclips together.\n\nI don&#39;t care what you do to be completely honest, I just know that \ngiven the drama and know how nasty people can be, I will not cut and \npaste which is my preference. Just because someone who does, given \ntheir reputation (such as Bruce&#39;s) I certainly would have no reason \nto question the authenticity of his work. However, there are those \nwho I do question, such as the post of Mr.Roundtrees photo&#39;s (posted \nthe previous day) and given the manufacturing of those so called \nghost photo&#39;s I would serious NEVER take any audio he produced as \ncreditable. This is the point I was trying to make. \n\nI will also tell you that a year ago upon listening to some of the \nfiles here, the first thing I noticed was that when I played certain \nfiles I could clearly see with the editing software that they were \nnot raw audio. I immediately formed an opinion that they in fact \ncould be bogus! That was my initial impression. It wasn&#39;t until I \nformed a personal friendship with some of them that I know THEY WOULD \nNEVER comprise their integrity and that this specific research was \nextremely important to them. I will be the first to admit that I was \nvery wrong, but I did base my judgment given what I saw. Other may \njust do the same.\n\nThe average person who happens upon this search who in fact has been \nsubject to those who do not stand behind their research will not know \nbetter. They too may just form the same opinion based on what they \nhave come across in this industry. \n\nMany I have had the pleasure of talking to outside this board, and I \nwill tell you that it is an honor to be among good honest creditable \npeople, who truly do care! I know NONE OF YOU whom I have spoken \nwith would EVER do this, but unfortunately there are those who will.\n\nI hope this clears things up, and people are not going to make a \nmountain out of a mole hill.\n\nJuli\n\n\n\n\n    \n---------------------------------\n  Be a better friend, newshound, and know-it-all with Yahoo! Mobile. Try it now.   \n\n\n\n\n\n\n  \n---------------------------------\n  More immediate than e-mail? Get instant access with Windows Live Messenger.   \n\n                           \n\n\n       \n---------------------------------\nBe a better friend, newshound, and know-it-all with Yahoo! Mobile.  Try it now.\r\n--0-1392204066-1208639025=:16612\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;DIV&gt;Bruce,&lt;/DIV&gt;  &lt;DIV&gt;And anyone else who I may have offended with my email in response to Juli&#39;s.&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;When I said that about dishonest people, I wasn&#39;t talking about you......Juli mentioned some guy who posted bogus pictures and how she would be leery listening to&nbsp;any of his recordings(and I agree, I would be leery too).&nbsp;&nbsp; &lt;/DIV&gt;  &lt;DIV&gt;Quote from Juli down below:&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;&lt;STRONG&gt;&lt;U&gt;&quot;However, there are those who I do question, such as the post of Mr.Roundtrees photo&#39;s (posted the previous day) and given the manufacturing of those so called &lt;BR&gt;ghost photo&#39;s I would serious NEVER take any audio he produced as creditable. &lt;/U&gt;&lt;/STRONG&gt;&lt;/DIV&gt;  &lt;DIV&gt;&lt;STRONG&gt;&lt;U&gt;This is the point I was trying to make.&quot;&lt;/U&gt;&lt;/STRONG&gt;&lt;/DIV&gt;  &lt;DIV&gt;&lt;STRONG&gt;&lt;U&gt;&lt;/U&gt;&lt;/STRONG&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;&lt;STRONG&gt;&lt;FONT color=#ff0000&gt;(That&#39;s what I was responding to in regards to dishonest people and frauds).&lt;/FONT&gt;&nbsp;&lt;/STRONG&gt;&lt;/DIV&gt; \n &lt;DIV&gt;&lt;STRONG&gt;&lt;/STRONG&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;I&#39;m sorry if it came across differently to you, that wasn&#39;t my intention....If editing(cutting out junk)&nbsp;makes you a &quot;fraud&quot; then I guess I am a fraud too cuz I&#39;ve been&nbsp;cutting junk(static) out of all my clips too!!&nbsp; But if you read my email it also kinda directs that towards people who cut and paste answers from different parts of the session, to make it match the question they asked.....editing stuff to make it sound good, like ya just had a 5 min convo, or to get the perfect answer to a question you asked.(when I say &quot;you&quot; Im not talking aboutYOU Bruce)&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;&quot;&lt;STRONG&gt;&lt;U&gt;&lt;FONT color=#ff0000&gt;it never occurred to me to edit my stuff to make it sound good&lt;/FONT&gt;&lt;/U&gt;&lt;/STRONG&gt; nor did it occur to me that others on here would either....&lt;STRONG&gt;&lt;U&gt;&lt;FONT color=#ff0000&gt;but ur right there are people out there who are dishonest and would do that without blinkin an eye&quot;&lt;/FONT&gt;&lt;/U&gt;&lt;/STRONG&gt;&lt;/DIV&gt; \n &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;I do agree to the skeptics and debunkers be damned!&nbsp; And ur right, we don&#39;t have to prove anything to them...only real way for them to believe is to be sitting right next to us.&nbsp; &lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;I would, however, like to be taken seriously(&lt;STRONG&gt;not saying that people don&#39;t take you or anyone else seriously)&lt;/STRONG&gt;...but since I&#39;m a newbie at this....I feel like i do have to prove myself.....I just don&#39;t want people thinking I&#39;m one&nbsp;of those dishonest types that are out there in the &lt;STRONG&gt;WORLD(not here in the forums)&lt;/STRONG&gt;&nbsp;so I&#39;m gonna try to remember not to edit my sessions but Im sure I&#39;ll forget. (I&nbsp;do&nbsp;save my raw files too incase anyone questions my clips.)...the spirits&nbsp;usually answer any questions almost right away, within 10 to 20 seconds normally.&nbsp; I just figured I&#39;d cut out the garbage(static in between)&nbsp;in order to make smaller files and save space.&nbsp;(Cuz someone\n said we had to start posting mp3&#39;s and making our files smaller...think Misty said that)&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;Like I said it never crossed my mind to pull of some trickery&nbsp;like moving answers around to make it fit to my questions(and I know you would &lt;STRONG&gt;NEVER&lt;/STRONG&gt; do that either...heck I didn&#39;t even have a single thought about anyone on the two forums doing such a thing...it never crossed my mind that people doing the box research would be dishonest like that&nbsp;until Juli posted that part about the guy with the bogus photos)...but there are all kinds of dishonest people in this world(&lt;STRONG&gt;NOT YOU BRUCE!!!&lt;/STRONG&gt;) and I&#39;m sure they would do just that without batting an eyelash.(Maybe I just like to see the innocense in everyone til they screw it up)&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;Oh and I had no idea Juli had sent out a 2nd emailing excluding you and Steve...never got that email...probably made its way into my bulk folder like some\n do.&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;I&#39;m thinkin maybe you misread what I wrote...when you put part of my email into bold and underline&nbsp;you left out a part:&lt;/DIV&gt;  &lt;DIV&gt;&lt;STRONG&gt;&quot;...&lt;FONT color=#ff0000&gt;&lt;FONT color=#000000&gt;it never occurred to me to edit my stuff to make it sound good&lt;/FONT&gt; &lt;U&gt;nor&lt;/U&gt;&lt;/FONT&gt; did it occur to me that others on here would either....but ur right there are people out there who are dishonest and would do that without blinkin an eye.&quot;&lt;/STRONG&gt;&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;(meaning it never crossed my mind that anyone on these forums would ever be dishonest like that and I still believe the people posting are honest and will stick by that..the only thing that would make me change my mind on that is &lt;STRONG&gt;IF&lt;/STRONG&gt; someone got busted)&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;Anyways wanted to clear that up with you...I wasn&#39;t directing my email towards you or anyone else on the forums and &lt;STRONG&gt;&lt;U&gt;I wasn&#39;t calling anyone on here a fraud&lt;/U&gt;&lt;/STRONG&gt;...cuz that\n would be like the pot calling the kettle black then (I edited my files by cutting out junk in between too!)&nbsp;and I&#39;m sorry if you felt it came off that way...I didn&#39;t mean for it to...sometimes I have a bit of a hard time trying to express myself via email...if we was talkin in real life, face to face that would be a whole `nother ball of wax.&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;Rhonda&lt;/DIV&gt;  &lt;DIV&gt;&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;bruce halliday &lt;paranormalinvestigating@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/DIV&gt;  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;DIV&gt;Rhonda,&lt;BR&gt;&nbsp;&lt;BR&gt;I have explained why, and have even\n posted a comparison file to bolster my explanation.&lt;BR&gt;Sceptics are closed minded individuals that will never concede to any kind of paranormal proof&lt;BR&gt;no matter how it is presented, in my original post I stated that I was beyond considering proving this communication.&lt;BR&gt;One would only have to turn on a box in someones presence to do that. The important thing to me now&lt;BR&gt;Is the messages that are being received and understanding their meaning. If that takes me cutting out a few blips and blahs&lt;BR&gt;from a file in order to hear the message without interruption, so be it. Hard line sceptics in my book are the bottom feeders of &lt;BR&gt;the paranormal world, because they are incompetenet when it comes to gathering valid data or they are frightened by the &lt;BR&gt;chance of proving something that they are afraid really does exist or for whatever reason. in my ten years of experience in dealing with them&lt;BR&gt;I have never run into one that&#39;s mind could be changed, even if it was a\n manifested spirit themselves trying to change it.&lt;BR&gt;&nbsp;&lt;BR&gt;So to me Sceptics and debunkers be damned!&lt;BR&gt;&nbsp;&lt;BR&gt;I clip the garbage from my files and so do some of the other more experienced &lt;BR&gt;researchers here. By your statement in this post you are saying that I am a dishonest researcher and the files I present are doctored or fraudulent.&lt;BR&gt;&nbsp;&lt;BR&gt;&lt;STRONG&gt;&lt;U&gt;&quot;did it occur to me that others on here would either....&lt;/U&gt;&lt;/STRONG&gt;&lt;BR&gt;&lt;STRONG&gt;&lt;U&gt;but ur right there are people out there who are dishonest &lt;/U&gt;&lt;/STRONG&gt;&lt;BR&gt;&lt;STRONG&gt;&lt;U&gt;and would do that without blinkin an eye....&quot;&lt;/U&gt;&lt;/STRONG&gt;&lt;BR&gt;&nbsp;&lt;BR&gt;&nbsp;&lt;BR&gt;&nbsp;&lt;BR&gt;Juli was very hasty in writing that post and It was actually directed at a single individual, it should never have been written without forethought of the ramifications it would insinuate.&lt;BR&gt;She has attempted to amend her position in a short post following the one she wrote mentioning my name and Steve&#39;s name, omitting us from her comments. But I\n guess that did not work evidently, Like I told her most readers of the post would take the wrong meaning.&lt;BR&gt;&nbsp;&lt;BR&gt;At this point in my research I do not feel the need to prove anything to anyone, and like I said all raw versions of my files will be made available upon request by respected critics in this field.&lt;BR&gt;&nbsp;&lt;BR&gt;Bruce&lt;BR&gt;&nbsp;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;&nbsp;&lt;BR&gt;  &lt;DIV align=center&gt;&lt;FONT size=4&gt;&lt;FONT color=#0033cc&gt;&lt;STRONG&gt;&lt;EM&gt;&lt;FONT color=#000000 size=5&gt;Bruce Halliday &lt;BR&gt;&lt;/FONT&gt;&lt;/EM&gt;&lt;/STRONG&gt;&lt;BR&gt;&lt;A href=&quot;http://free-paranormalinvestigating.com/%3C/div%3E%3C/div%3E%3Cp%20/%3E%3Cdiv%20class=&quot; target=_blank&gt;&lt;/DIV&gt;&lt;/A&gt;&lt;/FONT&gt;&lt;/FONT&gt;&lt;BR&gt;&lt;BR&gt;  &lt;BLOCKQUOTE&gt;  &lt;HR&gt;  To: EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;BR&gt;From: rhondak1973@&lt;WBR&gt;yahoo.com&lt;BR&gt;Date: Fri, 18 Apr 2008 20:55:49 -0700&lt;BR&gt;Subject: Re: [EVP-ITC] Undies in a Bundy!&lt;BR&gt;&lt;BR&gt;  &lt;DIV id=EC_ygrp-mlmsg&gt;  &lt;DIV id=EC_ygrp-msg&gt;  &lt;DIV id=EC_ygrp-text&gt;  &lt;DIV&gt;I understand now what ya&#39;ll are saying...it never occurred to me to edit my stuff\n to make it sound good nor did it occur to me that others on here would either....but ur right there are people out there who are dishonest and would do that without blinkin an eye....which is sad and&nbsp;would make it hard on our parts to prove to skeptics that we arent BSing them.&nbsp; Im gonna stop cuttin out the garbage in my files....I was doing it mainly to save us some space on the forum cuz I dont want us to run out and have to delete stuff. (would prolly help if everyone posted mp3s tho instead of wav files even if they are short they are still bigger than the mp3)&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;Rhonda&lt;/DIV&gt;  &lt;DIV&gt;&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;Jules &lt;ghostchasingfool@&lt;WBR&gt;yahoo.com&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/DIV&gt;  &lt;BLOCKQUOTE class=EC_replbq style=&quot;BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=EC_ygrp-text&gt;  &lt;DIV&gt;Holy Cow, I leave for my daughters school event at 3:30 and I have &lt;BR&gt;too much email on this subject!&lt;BR&gt;&lt;BR&gt;First and foremost I was directing those who are in fact are\n &lt;BR&gt;paranormal investigators, in field research. Many here are not! I &lt;BR&gt;was in no way implying that Bruce, Steve, etc. were fabricating their &lt;BR&gt;audio clips in any way!!!! I HIGH RESPECT BRUCE, STEVE AND THE the &lt;BR&gt;other on this board! I am speaking from my experiences, and being in &lt;BR&gt;the line of fire throughout the years regarding cutting and pasting &lt;BR&gt;clips together.&lt;BR&gt;&lt;BR&gt;I don&#39;t care what you do to be completely honest, I just know that &lt;BR&gt;given the drama and know how nasty people can be, I will not cut and &lt;BR&gt;paste which is my preference. Just because someone who does, given &lt;BR&gt;their reputation (such as Bruce&#39;s) I certainly would have no reason &lt;BR&gt;to question the authenticity of his work. However, there are those &lt;BR&gt;who I do question, such as the post of Mr.Roundtrees photo&#39;s (posted &lt;BR&gt;the previous day) and given the manufacturing of those so called &lt;BR&gt;ghost photo&#39;s I would serious NEVER take any audio he produced as &lt;BR&gt;creditable. This is the point\n I was trying to make. &lt;BR&gt;&lt;BR&gt;I will also tell you that a year ago upon listening to some of the &lt;BR&gt;files here, the first thing I noticed was that when I played certain &lt;BR&gt;files I could clearly see with the editing software that they were &lt;BR&gt;not raw audio. I immediately formed an opinion that they in fact &lt;BR&gt;could be bogus! That was my initial impression. It wasn&#39;t until I &lt;BR&gt;formed a personal friendship with some of them that I know THEY WOULD &lt;BR&gt;NEVER comprise their integrity and that this specific research was &lt;BR&gt;extremely important to them. I will be the first to admit that I was &lt;BR&gt;very wrong, but I did base my judgment given what I saw. Other may &lt;BR&gt;just do the same.&lt;BR&gt;&lt;BR&gt;The average person who happens upon this search who in fact has been &lt;BR&gt;subject to those who do not stand behind their research will not know &lt;BR&gt;better. They too may just form the same opinion based on what they &lt;BR&gt;have come across in this industry. &lt;BR&gt;&lt;BR&gt;Many I have had the pleasure\n of talking to outside this board, and I &lt;BR&gt;will tell you that it is an honor to be among good honest creditable &lt;BR&gt;people, who truly do care! I know NONE OF YOU whom I have spoken &lt;BR&gt;with would EVER do this, but unfortunately there are those who will.&lt;BR&gt;&lt;BR&gt;I hope this clears things up, and people are not going to make a &lt;BR&gt;mountain out of a mole hill.&lt;BR&gt;&lt;BR&gt;Juli&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;  &lt;DIV&gt;  &lt;HR SIZE=1&gt;  Be a better friend, newshound, and know-it-all with Yahoo! Mobile. &lt;A href=&quot;http://us.rd.yahoo.com/evt=51733/*http://mobile.yahoo.com/;_ylt=Ahu06i62sR8HDtDypao8Wcj9tAcJ&quot; target=_blank&gt;Try it now.&lt;/A&gt;   &lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;SPAN style=&quot;COLOR: white&quot;&gt;&lt;/SPAN&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;  &lt;HR&gt;  More immediate than e-mail? &lt;A href=&quot;http://www.windowslive.com/messenger/overview.html?ocid=TXT_TAGLM_WL_Refresh_instantaccess_042008&quot; target=_new&gt;Get instant access with Windows Live Messenger.&lt;/A&gt;  \n &lt;DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;p&gt;&#32;\n\n      &lt;hr size=1&gt;Be a better friend, newshound, and \nknow-it-all with Yahoo! Mobile. &lt;a href=&quot;http://us.rd.yahoo.com/evt=51733/*http://mobile.yahoo.com/;_ylt=Ahu06i62sR8HDtDypao8Wcj9tAcJ &quot;&gt; Try it now.&lt;/a&gt;\r\n--0-1392204066-1208639025=:16612--"}