{"id": "10155", "subject": "for Frank and Chuck Re: [EVP-ITC] Re: That&#39;s Why!", "author": "Ron Lederer", "timestamp": "2008-04-19T22:48:21Z", "full_text": "--0-1225004962-1208645301=:8045\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nAll good points chuck.=A0 I am wondering what your reaction is to the quest=\r\nioner who gets an immediate and appropriate response to his question as Mik=\r\ne just did regarding equipment.=A0 His question was well designed and the r=\r\nesponse was direct and immediate.=A0 He would then have time to &quot;just liste=\r\nn&quot; no?=A0 Can&#39;t we do both?=A0 Ask, as times, and listen at other times?=A0=\r\n Also, Frank, I know you discussed this in the past but what has the histor=\r\ny of SW radio usage and EVP results?=A0 Ron L\n\n\n----- Original Message ----=\r\n\nFrom: LC Duplatt &lt;lcdupla@...&gt;\nTo: EVP-ITC@yahoogroups.com\nSent: Sat=\r\nurday, April 19, 2008 4:23:41 PM\nSubject: [EVP-ITC] Re: That&#39;s Why!\n\n\nFrank=\r\n, I understand where you are coming from, as I often get \nfrustrated when I=\r\n hear myself or another asking a question and there \nis an answer within th=\r\ne same audio from the spirits. So I agree with \nthis. I only hear about 10%=\r\n of the answers live, and find re-\nlistening to the recording at least two =\r\ntimes is beneficial to catch \neverything.\n\nHowever, we were at a lighthouse=\r\n that was supposed to be haunted, and \na lady asked if there was a &quot;Captain=\r\n Babcock&quot; with us. About 8 \nseconds later, the reply, &quot;Spirit of Babcock&quot; c=\r\name through clearly. \nThe file is in my folder here. So I do see value as w=\r\nell in asking \nquestions. The downside is we have a tendency to talk over t=\r\nhem \nsometimes, yet, it is nice to provide the earthbounds direction to \nhe=\r\nlp them speak what we need to hear (to help them). If people think \nthey do=\r\n not need help, then they haven&#39;t been doing this enough in \nplaces where p=\r\neople in spirit are in trauma. Believe me, some of \nthem truly are and are =\r\nin need of help - period. \n\nPerhaps there are two ways to do this, dependin=\r\ng on what one is \ntrying to accomplish. At a haunted location, I seem to he=\r\nar \nenlightened spirits, as well as earthbounds coming through. This \ntype =\r\nof situation can be especially helpful to ask questions in my \nexperience, =\r\nas it helps to ferret out what&#39;s going on there and \nprovide &quot;evidence&quot; of =\r\nintelligent responses to the questions. This \nworked well to prove the spir=\r\nit box as legit to the group who \naccompanied me.\n\nWhen just trying to get =\r\n&quot;higher&quot; messages from spirits, etc at home \nor elsewhere, I do think just =\r\nletting it run and record is a great \nway to work with it, too. This way, t=\r\nhere are no expectations, just \ntaking the time to listen for direction, me=\r\nssages of truth, hellos, \netc. Sometimes this way will really surprise you,=\r\n especially when \nsomething comes through &quot;off the cuff&quot; and you are not ex=\r\npecting it. \n\nFrank, I hear your advice captain, but also want to throw in =\r\nsome of \nmy personal experiences into the discussion.\n\nLC\n\n\n--- In EVP-ITC@=\r\nyahoogroups .com, &quot;purplespacefriend&quot; \n&lt;purplealiengirl@ ...&gt; wrote:\n&gt;\n&gt; Hi=\r\n All;\n&gt; \n&gt; This is why I say don&#39;t get so tied up asking questions and tryi=\r\nng \nto \n&gt; get that one profound answer while missing all the real stuff. In=\r\n \nthe \n&gt; file I have in my folder of the 30 second test of #36, the very \nf=\r\nirst \n&gt; voice is &quot;Thomas Edison(sung) --I Never Visited Frank&quot;, I did not \n=\r\nhear \n&gt; this until the third time I listened to the entire session. I&#39;m not=\r\n \nso \n&gt; intent on runing session after session all friggin&#39; day that I \ndon=\r\n&#39;t \n&gt; have/take time to listen. If I was trying to hear this stuff \ndirect,=\r\n I \n&gt; would miss it, and simialr voices about 99% of the time. That&#39;s \nwhy,=\r\n \n&gt; forget the damn questions, and just listen--over and over till you \n&gt; t=\r\nhink you&#39;ve gotten it all. Even my dad, and son come through in \ntheir \n&gt; o=\r\nwn time, I don&#39;t costantly ask for them. I swear to God, they know \nwho \n&gt; =\r\nis listening, when you are listening/recording , and what you need \nto \n&gt; k=\r\nnow! Trust it!\n&gt; \n&gt; I know, the idiot scientist type will insist you have t=\r\no ask \n&gt; questions, and confirm the answers, but that is BS, and results \nl=\r\nittle \n&gt; useful information. Useful, as in has personal signifgance. \n&gt; \n&gt; =\r\nFrank-S\n&gt;\n\n \n\n\n      ______________________________________________________=\r\n______________________________\nBe a better friend, newshound, and \nknow-it-=\r\nall with Yahoo! Mobile.  Try it now.  http://mobile.yahoo.com/;_ylt=3DAhu06=\r\ni62sR8HDtDypao8Wcj9tAcJ\r\n--0-1225004962-1208645301=:8045\r\nContent-Type: text/html; charset=us-ascii\r\n\r\n&lt;html&gt;&lt;head&gt;&lt;style type=&quot;text/css&quot;&gt;&lt;!-- DIV {margin:0px;} --&gt;&lt;/style&gt;&lt;/head&gt;&lt;body&gt;&lt;div style=&quot;font-family:times new roman, new york, times, serif;font-size:12pt&quot;&gt;&lt;DIV style=&quot;FONT-SIZE: 12pt; FONT-FAMILY: times new roman, new york, times, serif&quot;&gt;All good points chuck.&nbsp; I am wondering what your reaction is to the questioner who gets an immediate and appropriate response to his question as Mike just did regarding equipment.&nbsp; His question was well designed and the response was direct and immediate.&nbsp; He would then have time to &quot;just listen&quot; no?&nbsp; Can&#39;t we do both?&nbsp; Ask, as times, and listen at other times?&nbsp; Also, Frank, I know you discussed this in the past but what has the history of SW radio usage and EVP results?&nbsp; Ron L&lt;BR&gt;&lt;BR&gt;\n&lt;DIV style=&quot;PADDING-LEFT: 5px; FONT-SIZE: 12pt; MARGIN: 5px 0px 5px 5px; BORDER-LEFT: #1010ff 2px solid; FONT-FAMILY: times new roman, new york, times, serif&quot;&gt;----- Original Message ----&lt;BR&gt;From: LC Duplatt &lt;lcdupla@...&gt;&lt;BR&gt;To: EVP-ITC@yahoogroups.com&lt;BR&gt;Sent: Saturday, April 19, 2008 4:23:41 PM&lt;BR&gt;Subject: [EVP-ITC] Re: That&#39;s Why!&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=ygrp-text&gt;\n&lt;P&gt;Frank, I understand where you are coming from, as I often get &lt;BR&gt;frustrated when I hear myself or another asking a question and there &lt;BR&gt;is an answer within the same audio from the spirits. So I agree with &lt;BR&gt;this. I only hear about 10% of the answers live, and find re-&lt;BR&gt;listening to the recording at least two times is beneficial to catch &lt;BR&gt;everything.&lt;BR&gt;&lt;BR&gt;However, we were at a lighthouse that was supposed to be haunted, and &lt;BR&gt;a lady asked if there was a &quot;Captain Babcock&quot; with us. About 8 &lt;BR&gt;seconds later, the reply, &quot;Spirit of Babcock&quot; came through clearly. &lt;BR&gt;The file is in my folder here. So I do see value as well in asking &lt;BR&gt;questions. The downside is we have a tendency to talk over them &lt;BR&gt;sometimes, yet, it is nice to provide the earthbounds direction to &lt;BR&gt;help them speak what we need to hear (to help them). If people think &lt;BR&gt;they do not need help, then they haven&#39;t been doing this enough in &lt;BR&gt;places where people in spirit\n are in trauma. Believe me, some of &lt;BR&gt;them truly are and are in need of help - period. &lt;BR&gt;&lt;BR&gt;Perhaps there are two ways to do this, depending on what one is &lt;BR&gt;trying to accomplish. At a haunted location, I seem to hear &lt;BR&gt;enlightened spirits, as well as earthbounds coming through. This &lt;BR&gt;type of situation can be especially helpful to ask questions in my &lt;BR&gt;experience, as it helps to ferret out what&#39;s going on there and &lt;BR&gt;provide &quot;evidence&quot; of intelligent responses to the questions. This &lt;BR&gt;worked well to prove the spirit box as legit to the group who &lt;BR&gt;accompanied me.&lt;BR&gt;&lt;BR&gt;When just trying to get &quot;higher&quot; messages from spirits, etc at home &lt;BR&gt;or elsewhere, I do think just letting it run and record is a great &lt;BR&gt;way to work with it, too. This way, there are no expectations, just &lt;BR&gt;taking the time to listen for direction, messages of truth, hellos, &lt;BR&gt;etc. Sometimes this way will really surprise you, especially when &lt;BR&gt;something\n comes through &quot;off the cuff&quot; and you are not expecting it. &lt;BR&gt;&lt;BR&gt;Frank, I hear your advice captain, but also want to throw in some of &lt;BR&gt;my personal experiences into the discussion.&lt;BR&gt;&lt;BR&gt;LC&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=&quot;mailto:EVP-ITC%40yahoogroups.com&quot; target=_blank rel=nofollow ymailto=&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups .com&lt;/A&gt;, &quot;purplespacefriend&quot; &lt;BR&gt;&lt;purplealiengirl@ ...&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; Hi All;&lt;BR&gt;&gt; &lt;BR&gt;&gt; This is why I say don&#39;t get so tied up asking questions and trying &lt;BR&gt;to &lt;BR&gt;&gt; get that one profound answer while missing all the real stuff. In &lt;BR&gt;the &lt;BR&gt;&gt; file I have in my folder of the 30 second test of #36, the very &lt;BR&gt;first &lt;BR&gt;&gt; voice is &quot;Thomas Edison(sung) --I Never Visited Frank&quot;, I did not &lt;BR&gt;hear &lt;BR&gt;&gt; this until the third time I listened to the entire session. I&#39;m not &lt;BR&gt;so &lt;BR&gt;&gt; intent on runing session after session all friggin&#39; day that I &lt;BR&gt;don&#39;t &lt;BR&gt;&gt; have/take\n time to listen. If I was trying to hear this stuff &lt;BR&gt;direct, I &lt;BR&gt;&gt; would miss it, and simialr voices about 99% of the time. That&#39;s &lt;BR&gt;why, &lt;BR&gt;&gt; forget the damn questions, and just listen--over and over till you &lt;BR&gt;&gt; think you&#39;ve gotten it all. Even my dad, and son come through in &lt;BR&gt;their &lt;BR&gt;&gt; own time, I don&#39;t costantly ask for them. I swear to God, they know &lt;BR&gt;who &lt;BR&gt;&gt; is listening, when you are listening/recording , and what you need &lt;BR&gt;to &lt;BR&gt;&gt; know! Trust it!&lt;BR&gt;&gt; &lt;BR&gt;&gt; I know, the idiot scientist type will insist you have to ask &lt;BR&gt;&gt; questions, and confirm the answers, but that is BS, and results &lt;BR&gt;little &lt;BR&gt;&gt; useful information. Useful, as in has personal signifgance. &lt;BR&gt;&gt; &lt;BR&gt;&gt; Frank-S&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/P&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/div&gt;&lt;br&gt;\n\n      &lt;hr size=1&gt;Be a better friend, newshound, and \nknow-it-all with Yahoo! Mobile. &lt;a href=&quot;http://us.rd.yahoo.com/evt=51733/*http://mobile.yahoo.com/;_ylt=Ahu06i62sR8HDtDypao8Wcj9tAcJ &quot;&gt; Try it now.&lt;/a&gt;&lt;/body&gt;&lt;/html&gt;\r\n--0-1225004962-1208645301=:8045--"}