{"id": "10166", "subject": "for Frank and Chuck Re: [EVP-ITC] Re: That&#39;s Why!", "author": "LC Duplatt", "timestamp": "2008-04-20T01:32:22Z", "full_text": "Ron, yes...I say do both.  \n\nI am for whatever works for people in their given situation.  As you \npointed out, there is value in an intelligent response to a \nquestion.  Sometimes we need to just let it run and listen, too. \n\nI try and follow my &quot;gut&quot; with it.  For example, I was at a haunted \npub, but was skeptical as to the claim of such.  As the night \nprogressed, I felt a presence touch me twice.  One place I was &quot;drawn \nto&quot; was the top of some stairs, so I ran a silent box session there - \njust me and whoever wanted to show up - no agenda.  I was able to \npull out a number of messages after listening to the recording a \ncouple times, and one word which I heard live was &quot;raped.&quot;  Later, I \nfound out that a woman was indeed raped there, and the door I was \nsitting in front of was the former entrance to a brothel.  The woman \nraped and murdered was a prostitute who lost her life up there.  \nFollow the gut...there&#39;s no rule or law that will work everywhere, \nevery time, IMHO.\n\nRegarding EVP, it seems to me that many EVP seem to come near or \naround people talking on the tape.  Do they use the human voices as a \ncarrier??  \n\nLC\n\n--- In EVP-ITC@yahoogroups.com, Ron Lederer &lt;ronriko@...&gt; wrote:\n&gt;\n&gt; All good points chuck. I am wondering what your reaction is to the \nquestioner who gets an immediate and appropriate response to his \nquestion as Mike just did regarding equipment. His question was well \ndesigned and the response was direct and immediate. He would then \nhave time to &quot;just listen&quot; no? Can&#39;t we do both? Ask, as times, and \nlisten at other times? Also, Frank, I know you discussed this in the \npast but what has the history of SW radio usage and EVP results? Ron \nL\n&gt; \n&gt; \n&gt; ----- Original Message ----\n&gt; From: LC Duplatt &lt;lcdupla@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Saturday, April 19, 2008 4:23:41 PM\n&gt; Subject: [EVP-ITC] Re: That&#39;s Why!\n&gt; \n&gt; \n&gt; Frank, I understand where you are coming from, as I often get \n&gt; frustrated when I hear myself or another asking a question and \nthere \n&gt; is an answer within the same audio from the spirits. So I agree \nwith \n&gt; this. I only hear about 10% of the answers live, and find re-\n&gt; listening to the recording at least two times is beneficial to \ncatch \n&gt; everything.\n&gt; \n&gt; However, we were at a lighthouse that was supposed to be haunted, \nand \n&gt; a lady asked if there was a &quot;Captain Babcock&quot; with us. About 8 \n&gt; seconds later, the reply, &quot;Spirit of Babcock&quot; came through clearly. \n&gt; The file is in my folder here. So I do see value as well in asking \n&gt; questions. The downside is we have a tendency to talk over them \n&gt; sometimes, yet, it is nice to provide the earthbounds direction to \n&gt; help them speak what we need to hear (to help them). If people \nthink \n&gt; they do not need help, then they haven&#39;t been doing this enough in \n&gt; places where people in spirit are in trauma. Believe me, some of \n&gt; them truly are and are in need of help - period. \n&gt; \n&gt; Perhaps there are two ways to do this, depending on what one is \n&gt; trying to accomplish. At a haunted location, I seem to hear \n&gt; enlightened spirits, as well as earthbounds coming through. This \n&gt; type of situation can be especially helpful to ask questions in my \n&gt; experience, as it helps to ferret out what&#39;s going on there and \n&gt; provide &quot;evidence&quot; of intelligent responses to the questions. This \n&gt; worked well to prove the spirit box as legit to the group who \n&gt; accompanied me.\n&gt; \n&gt; When just trying to get &quot;higher&quot; messages from spirits, etc at home \n&gt; or elsewhere, I do think just letting it run and record is a great \n&gt; way to work with it, too. This way, there are no expectations, just \n&gt; taking the time to listen for direction, messages of truth, hellos, \n&gt; etc. Sometimes this way will really surprise you, especially when \n&gt; something comes through &quot;off the cuff&quot; and you are not expecting \nit. \n&gt; \n&gt; Frank, I hear your advice captain, but also want to throw in some \nof \n&gt; my personal experiences into the discussion.\n&gt; \n&gt; LC\n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups .com, &quot;purplespacefriend&quot; \n&gt; &lt;purplealiengirl@ ...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hi All;\n&gt; &gt; \n&gt; &gt; This is why I say don&#39;t get so tied up asking questions and \ntrying \n&gt; to \n&gt; &gt; get that one profound answer while missing all the real stuff. In \n&gt; the \n&gt; &gt; file I have in my folder of the 30 second test of #36, the very \n&gt; first \n&gt; &gt; voice is &quot;Thomas Edison(sung) --I Never Visited Frank&quot;, I did not \n&gt; hear \n&gt; &gt; this until the third time I listened to the entire session. I&#39;m \nnot \n&gt; so \n&gt; &gt; intent on runing session after session all friggin&#39; day that I \n&gt; don&#39;t \n&gt; &gt; have/take time to listen. If I was trying to hear this stuff \n&gt; direct, I \n&gt; &gt; would miss it, and simialr voices about 99% of the time. That&#39;s \n&gt; why, \n&gt; &gt; forget the damn questions, and just listen--over and over till \nyou \n&gt; &gt; think you&#39;ve gotten it all. Even my dad, and son come through in \n&gt; their \n&gt; &gt; own time, I don&#39;t costantly ask for them. I swear to God, they \nknow \n&gt; who \n&gt; &gt; is listening, when you are listening/recording , and what you \nneed \n&gt; to \n&gt; &gt; know! Trust it!\n&gt; &gt; \n&gt; &gt; I know, the idiot scientist type will insist you have to ask \n&gt; &gt; questions, and confirm the answers, but that is BS, and results \n&gt; little \n&gt; &gt; useful information. Useful, as in has personal signifgance. \n&gt; &gt; \n&gt; &gt; Frank-S\n&gt; &gt;\n&gt; \n&gt;  \n&gt; \n&gt; \n&gt;       \n______________________________________________________________________\n______________\n&gt; Be a better friend, newshound, and \n&gt; know-it-all with Yahoo! Mobile.  Try it now.  \nhttp://mobile.yahoo.com/;_ylt=Ahu06i62sR8HDtDypao8Wcj9tAcJ\n&gt;"}