{"id": "10163", "subject": "RE: [EVP-ITC] Undies in a Bundy!-Bruce & NEone else I may have offended", "author": "bruce halliday", "timestamp": "2008-04-19T22:45:02Z", "full_text": "--_ee9ff31f-477b-4171-a705-5711707bd609_\r\nContent-Type: text/plain; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n\nRhonda,\n \nIn retrospect I have become a bit touchy over this subject the l=\r\nast few day&#39;s\nPlease accept my appologies for the hasty reply.\n \nBruce\nBruc=\r\ne Halliday \n\n\nTo: EVP-ITC@yahoogroups.comFrom: rhondak1973@...: S=\r\nat, 19 Apr 2008 14:03:45 -0700Subject: RE: [EVP-ITC] Undies in a Bundy!-Bru=\r\nce & NEone else I may have offended\n\n\n\n\n\nBruce,\nAnd anyone else who I may h=\r\nave offended with my email in response to Juli&#39;s.\n \nWhen I said that about =\r\ndishonest people, I wasn&#39;t talking about you......Juli mentioned some guy w=\r\nho posted bogus pictures and how she would be leery listening to any of his=\r\n recordings(and I agree, I would be leery too).   \nQuote from Juli down bel=\r\now:\n \n&quot;However, there are those who I do question, such as the post of Mr.R=\r\noundtrees photo&#39;s (posted the previous day) and given the manufacturing of =\r\nthose so called ghost photo&#39;s I would serious NEVER take any audio he produ=\r\nced as creditable. \nThis is the point I was trying to make.&quot;\n \n(That&#39;s what=\r\n I was responding to in regards to dishonest people and frauds). \n \nI&#39;m sor=\r\nry if it came across differently to you, that wasn&#39;t my intention....If edi=\r\nting(cutting out junk) makes you a &quot;fraud&quot; then I guess I am a fraud too cu=\r\nz I&#39;ve been cutting junk(static) out of all my clips too!!  But if you read=\r\n my email it also kinda directs that towards people who cut and paste answe=\r\nrs from different parts of the session, to make it match the question they =\r\nasked.....editing stuff to make it sound good, like ya just had a 5 min con=\r\nvo, or to get the perfect answer to a question you asked.(when I say &quot;you&quot; =\r\nIm not talking aboutYOU Bruce)\n \n&quot;it never occurred to me to edit my stuff =\r\nto make it sound good nor did it occur to me that others on here would eith=\r\ner....but ur right there are people out there who are dishonest and would d=\r\no that without blinkin an eye&quot;\n \nI do agree to the skeptics and debunkers b=\r\ne damned!  And ur right, we don&#39;t have to prove anything to them...only rea=\r\nl way for them to believe is to be sitting right next to us.  \n \nI would, h=\r\nowever, like to be taken seriously(not saying that people don&#39;t take you or=\r\n anyone else seriously)...but since I&#39;m a newbie at this....I feel like i d=\r\no have to prove myself.....I just don&#39;t want people thinking I&#39;m one of tho=\r\nse dishonest types that are out there in the WORLD(not here in the forums) =\r\nso I&#39;m gonna try to remember not to edit my sessions but Im sure I&#39;ll forge=\r\nt. (I do save my raw files too incase anyone questions my clips.)...the spi=\r\nrits usually answer any questions almost right away, within 10 to 20 second=\r\ns normally.  I just figured I&#39;d cut out the garbage(static in between) in o=\r\nrder to make smaller files and save space. (Cuz someone said we had to star=\r\nt posting mp3&#39;s and making our files smaller...think Misty said that) \n \nLi=\r\nke I said it never crossed my mind to pull of some trickery like moving ans=\r\nwers around to make it fit to my questions(and I know you would NEVER do th=\r\nat either...heck I didn&#39;t even have a single thought about anyone on the tw=\r\no forums doing such a thing...it never crossed my mind that people doing th=\r\ne box research would be dishonest like that until Juli posted that part abo=\r\nut the guy with the bogus photos)...but there are all kinds of dishonest pe=\r\nople in this world(NOT YOU BRUCE!!!) and I&#39;m sure they would do just that w=\r\nithout batting an eyelash.(Maybe I just like to see the innocense in everyo=\r\nne til they screw it up)\n \nOh and I had no idea Juli had sent out a 2nd ema=\r\niling excluding you and Steve...never got that email...probably made its wa=\r\ny into my bulk folder like some do.\n \nI&#39;m thinkin maybe you misread what I =\r\nwrote...when you put part of my email into bold and underline you left out =\r\na part:\n&quot;...it never occurred to me to edit my stuff to make it sound good =\r\nnor did it occur to me that others on here would either....but ur right the=\r\nre are people out there who are dishonest and would do that without blinkin=\r\n an eye.&quot;\n (meaning it never crossed my mind that anyone on these forums wo=\r\nuld ever be dishonest like that and I still believe the people posting are =\r\nhonest and will stick by that..the only thing that would make me change my =\r\nmind on that is IF someone got busted)\n \nAnyways wanted to clear that up wi=\r\nth you...I wasn&#39;t directing my email towards you or anyone else on the foru=\r\nms and I wasn&#39;t calling anyone on here a fraud...cuz that would be like the=\r\n pot calling the kettle black then (I edited my files by cutting out junk i=\r\nn between too!) and I&#39;m sorry if you felt it came off that way...I didn&#39;t m=\r\nean for it to...sometimes I have a bit of a hard time trying to express mys=\r\nelf via email...if we was talkin in real life, face to face that would be a=\r\n whole `nother ball of wax.\n \n \nRhonda\nbruce halliday &lt;paranormalinvestigat=\r\ning@...&gt; wrote:\n\n\nRhonda, I have explained why, and have even poste=\r\nd a comparison file to bolster my explanation.Sceptics are closed minded in=\r\ndividuals that will never concede to any kind of paranormal proofno matter =\r\nhow it is presented, in my original post I stated that I was beyond conside=\r\nring proving this communication.One would only have to turn on a box in som=\r\neones presence to do that. The important thing to me nowIs the messages tha=\r\nt are being received and understanding their meaning. If that takes me cutt=\r\ning out a few blips and blahsfrom a file in order to hear the message witho=\r\nut interruption, so be it. Hard line sceptics in my book are the bottom fee=\r\nders of the paranormal world, because they are incompetenet when it comes t=\r\no gathering valid data or they are frightened by the chance of proving some=\r\nthing that they are afraid really does exist or for whatever reason. in my =\r\nten years of experience in dealing with themI have never run into one that&#39;=\r\ns mind could be changed, even if it was a manifested spirit themselves tryi=\r\nng to change it. So to me Sceptics and debunkers be damned! I clip the garb=\r\nage from my files and so do some of the other more experienced researchers =\r\nhere. By your statement in this post you are saying that I am a dishonest r=\r\nesearcher and the files I present are doctored or fraudulent. &quot;did it occur=\r\n to me that others on here would either....but ur right there are people ou=\r\nt there who are dishonest and would do that without blinkin an eye....&quot;   J=\r\nuli was very hasty in writing that post and It was actually directed at a s=\r\ningle individual, it should never have been written without forethought of =\r\nthe ramifications it would insinuate.She has attempted to amend her positio=\r\nn in a short post following the one she wrote mentioning my name and Steve&#39;=\r\ns name, omitting us from her comments. But I guess that did not work eviden=\r\ntly, Like I told her most readers of the post would take the wrong meaning.=\r\n At this point in my research I do not feel the need to prove anything to a=\r\nnyone, and like I said all raw versions of my files will be made available =\r\nupon request by respected critics in this field. Bruce  \nBruce Halliday \n\n\n=\r\nTo: EVP-ITC@yahoogroups.comFrom: rhondak1973@...: Fri, 18 Apr 200=\r\n8 20:55:49 -0700Subject: Re: [EVP-ITC] Undies in a Bundy!\n\n\n\nI understand n=\r\now what ya&#39;ll are saying...it never occurred to me to edit my stuff to make=\r\n it sound good nor did it occur to me that others on here would either....b=\r\nut ur right there are people out there who are dishonest and would do that =\r\nwithout blinkin an eye....which is sad and would make it hard on our parts =\r\nto prove to skeptics that we arent BSing them.  Im gonna stop cuttin out th=\r\ne garbage in my files....I was doing it mainly to save us some space on the=\r\n forum cuz I dont want us to run out and have to delete stuff. (would proll=\r\ny help if everyone posted mp3s tho instead of wav files even if they are sh=\r\nort they are still bigger than the mp3)\n \nRhonda\nJules &lt;ghostchasingfool@ya=\r\nhoo.com&gt; wrote:\n\n\nHoly Cow, I leave for my daughters school event at 3:30 a=\r\nnd I have too much email on this subject!First and foremost I was directing=\r\n those who are in fact are paranormal investigators, in field research. Man=\r\ny here are not! I was in no way implying that Bruce, Steve, etc. were fabri=\r\ncating their audio clips in any way!!!! I HIGH RESPECT BRUCE, STEVE AND THE=\r\n the other on this board! I am speaking from my experiences, and being in t=\r\nhe line of fire throughout the years regarding cutting and pasting clips to=\r\ngether.I don&#39;t care what you do to be completely honest, I just know that g=\r\niven the drama and know how nasty people can be, I will not cut and paste w=\r\nhich is my preference. Just because someone who does, given their reputatio=\r\nn (such as Bruce&#39;s) I certainly would have no reason to question the authen=\r\nticity of his work. However, there are those who I do question, such as the=\r\n post of Mr.Roundtrees photo&#39;s (posted the previous day) and given the manu=\r\nfacturing of those so called ghost photo&#39;s I would serious NEVER take any a=\r\nudio he produced as creditable. This is the point I was trying to make. I w=\r\nill also tell you that a year ago upon listening to some of the files here,=\r\n the first thing I noticed was that when I played certain files I could cle=\r\narly see with the editing software that they were not raw audio. I immediat=\r\nely formed an opinion that they in fact could be bogus! That was my initial=\r\n impression. It wasn&#39;t until I formed a personal friendship with some of th=\r\nem that I know THEY WOULD NEVER comprise their integrity and that this spec=\r\nific research was extremely important to them. I will be the first to admit=\r\n that I was very wrong, but I did base my judgment given what I saw. Other =\r\nmay just do the same.The average person who happens upon this search who in=\r\n fact has been subject to those who do not stand behind their research will=\r\n not know better. They too may just form the same opinion based on what the=\r\ny have come across in this industry. Many I have had the pleasure of talkin=\r\ng to outside this board, and I will tell you that it is an honor to be amon=\r\ng good honest creditable people, who truly do care! I know NONE OF YOU whom=\r\n I have spoken with would EVER do this, but unfortunately there are those w=\r\nho will.I hope this clears things up, and people are not going to make a mo=\r\nuntain out of a mole hill.Juli\n\n\nBe a better friend, newshound, and know-it=\r\n-all with Yahoo! Mobile. Try it now. \n\n\nMore immediate than e-mail? Get ins=\r\ntant access with Windows Live Messenger. \n\n\n\nBe a better friend, newshound,=\r\n and know-it-all with Yahoo! Mobile. Try it now. \n \n\n\n\n\n\n\n_________________=\r\n________________________________________________\nGoing green? See the top 1=\r\n2 foods to eat organic.\nhttp://green.msn.com/galleries/photos/photos.aspx?g=\r\nid=3D164&ocid=3DT003MSN51N1653A\r\n--_ee9ff31f-477b-4171-a705-5711707bd609_\r\nContent-Type: text/html; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;\n&lt;head&gt;\n&lt;style&gt;\n.hmmessage P\n{\nmargin:0px;\npadding:0px\n}\nbody.hmmessa=\r\nge\n{\nFONT-SIZE: 10pt;\nFONT-FAMILY:Tahoma\n}\n&lt;/style&gt;\n&lt;/head&gt;\n&lt;body class=3D&#39;=\r\nhmmessage&#39;&gt;\nRhonda,&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nIn retrospect I have become a bit touchy=\r\n over this subject the last few day&#39;s&lt;BR&gt;\nPlease accept my appologies for t=\r\nhe hasty reply.&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nBruce&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;P align=3Dcenter&gt;&lt;FONT si=\r\nze=3D4&gt;&lt;FONT color=3D#0033cc&gt;&lt;STRONG&gt;&lt;EM&gt;&lt;FONT color=3D#000000 size=3D5&gt;Bru=\r\nce Halliday &lt;BR&gt;&lt;/FONT&gt;&lt;/EM&gt;&lt;/STRONG&gt;&lt;BR&gt;&lt;A href=3D&quot;http://free-paranormali=\r\nnvestigating.com/%3C/div%3E%3C/div%3E%3Cp%20/%3E%3Cdiv%20class=3D&quot; target=\r\n=3D_blank&gt;&lt;/P&gt;&lt;/A&gt;&lt;/FONT&gt;&lt;/FONT&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;BLOCKQUOTE&gt;\n&lt;HR&gt;\nTo: EVP-ITC@yaho=\r\nogroups.com&lt;BR&gt;From: rhondak1973@...&lt;BR&gt;Date: Sat, 19 Apr 2008 14:03:=\r\n45 -0700&lt;BR&gt;Subject: RE: [EVP-ITC] Undies in a Bundy!-Bruce &amp; NEone els=\r\ne I may have offended&lt;BR&gt;&lt;BR&gt;\n&lt;META content=3D&quot;Microsoft SafeHTML&quot; name=3DG=\r\nenerator&gt;\n&lt;DIV id=3DEC_ygrp-mlmsg style=3D&quot;WIDTH: 655px&quot;&gt;\n&lt;DIV id=3DEC_ygrp=\r\n-msg style=3D&quot;PADDING-RIGHT: 25px; PADDING-LEFT: 0px; Z-INDEX: 1; FLOAT: le=\r\nft; PADDING-BOTTOM: 0px; WIDTH: 470px; PADDING-TOP: 0px&quot;&gt;\n&lt;DIV id=3DEC_ygrp=\r\n-text&gt;\n\n&lt;DIV&gt;Bruce,&lt;/DIV&gt;\n&lt;DIV&gt;And anyone else who I may have offended with=\r\n my email in response to Juli&#39;s.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;When I said t=\r\nhat about dishonest people, I wasn&#39;t talking about you......Juli mentioned =\r\nsome guy who posted bogus pictures and how she would be leery listening to&=\r\nnbsp;any of his recordings(and I agree, I would be leery too).&nbsp;&nbsp; =\r\n&lt;/DIV&gt;\n&lt;DIV&gt;Quote from Juli down below:&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;STRON=\r\nG&gt;&lt;U&gt;&quot;However, there are those who I do question, such as the post of Mr.Ro=\r\nundtrees photo&#39;s (posted the previous day) and given the manufacturing of t=\r\nhose so called &lt;BR&gt;ghost photo&#39;s I would serious NEVER take any audio he pr=\r\noduced as creditable. &lt;/U&gt;&lt;/STRONG&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;STRONG&gt;&lt;U&gt;This is the point=\r\n I was trying to make.&quot;&lt;/U&gt;&lt;/STRONG&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;STRONG&gt;&lt;U&gt;&lt;/U&gt;&lt;/STRONG&gt;&nb=\r\nsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;STRONG&gt;&lt;FONT color=3D#ff0000&gt;(That&#39;s what I was responding =\r\nto in regards to dishonest people and frauds).&lt;/FONT&gt;&nbsp;&lt;/STRONG&gt;&lt;/DIV&gt;\n=\r\n&lt;DIV&gt;&lt;STRONG&gt;&lt;/STRONG&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I&#39;m sorry if it came across differe=\r\nntly to you, that wasn&#39;t my intention...&lt;WBR&gt;.If editing(cutting out junk)&=\r\nnbsp;makes you a &quot;fraud&quot; then I guess I am a fraud too cuz I&#39;ve been&nbsp;c=\r\nutting junk(static) out of all my clips too!!&nbsp; But if you read my emai=\r\nl it also kinda directs that towards people who cut and paste answers from =\r\ndifferent parts of the session, to make it match the question they asked...=\r\n..editing stuff to make it sound good, like ya just had a 5 min convo, or t=\r\no get the perfect answer to a question you asked.(when I say &quot;you&quot; Im not t=\r\nalking aboutYOU Bruce)&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&quot;&lt;STRONG&gt;&lt;U&gt;&lt;FONT color=\r\n=3D#ff0000&gt;it never occurred to me to edit my stuff to make it sound good&lt;/=\r\nFONT&gt;&lt;/U&gt;&lt;/STRONG&gt; nor did it occur to me that others on here would either.=\r\n...&lt;STRONG&gt;&lt;U&gt;&lt;FONT color=3D#ff0000&gt;but ur right there are people out there=\r\n who are dishonest and would do that without blinkin an eye&quot;&lt;/FONT&gt;&lt;/U&gt;&lt;/ST=\r\nRONG&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I do agree to the skeptics and debunkers=\r\n be damned!&nbsp; And ur right, we don&#39;t have to prove anything to them...o=\r\nnly real way for them to believe is to be sitting right next to us.&nbsp; &lt;=\r\n/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I would, however, like to be taken seriously(&lt;=\r\nSTRONG&gt;not saying that people don&#39;t take you or anyone else seriously)&lt;/STR=\r\nONG&gt;...but since I&#39;m a newbie at this....I feel like i do have to prove mys=\r\nelf.....I just don&#39;t want people thinking I&#39;m one&nbsp;of those dishonest t=\r\nypes that are out there in the &lt;STRONG&gt;WORLD(not here in the forums)&lt;/STRON=\r\nG&gt;&nbsp;so I&#39;m gonna try to remember not to edit my sessions but Im sure I&#39;=\r\nll forget. (I&nbsp;do&nbsp;save my raw files too incase anyone questions my=\r\n clips.)...the spirits&nbsp;usually answer any questions almost right away,=\r\n within 10 to 20 seconds normally.&nbsp; I just figured I&#39;d cut out the gar=\r\nbage(static in between)&nbsp;in order to make smaller files and save space.=\r\n&nbsp;(Cuz someone said we had to start posting mp3&#39;s and making our files =\r\nsmaller...think Misty said that)&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Like I =\r\nsaid it never crossed my mind to pull of some trickery&nbsp;like moving ans=\r\nwers around to make it fit to my questions(and I know you would &lt;STRONG&gt;NEV=\r\nER&lt;/STRONG&gt; do that either...heck I didn&#39;t even have a single thought about=\r\n anyone on the two forums doing such a thing...it never crossed my mind tha=\r\nt people doing the box research would be dishonest like that&nbsp;until Jul=\r\ni posted that part about the guy with the bogus photos)...but there are all=\r\n kinds of dishonest people in this world(&lt;STRONG&gt;NOT YOU BRUCE!!!&lt;/STRONG&gt;)=\r\n and I&#39;m sure they would do just that without batting an eyelash.(Maybe I j=\r\nust like to see the innocense in everyone til they screw it up)&lt;/DIV&gt;\n&lt;DIV&gt;=\r\n&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Oh and I had no idea Juli had sent out a 2nd emailing exc=\r\nluding you and Steve...never got that email...probably made its way into my=\r\n bulk folder like some do.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I&#39;m thinkin maybe y=\r\nou misread what I wrote...when you put part of my email into bold and under=\r\nline&nbsp;you left out a part:&lt;/DIV&gt;\n&lt;DIV&gt;&lt;STRONG&gt;&quot;...&lt;FONT color=3D#ff0000=\r\n&gt;&lt;FONT color=3D#000000&gt;it never occurred to me to edit my stuff to make it =\r\nsound good&lt;/FONT&gt; &lt;U&gt;nor&lt;/U&gt;&lt;/FONT&gt; did it occur to me that others on here =\r\nwould either....but ur right there are people out there who are dishonest a=\r\nnd would do that without blinkin an eye.&quot;&lt;/STRONG&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;(meanin=\r\ng it never crossed my mind that anyone on these forums would ever be dishon=\r\nest like that and I still believe the people posting are honest and will st=\r\nick by that..the only thing that would make me change my mind on that is &lt;S=\r\nTRONG&gt;IF&lt;/STRONG&gt; someone got busted)&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Anyways =\r\nwanted to clear that up with you...I wasn&#39;t directing my email towards you =\r\nor anyone else on the forums and &lt;STRONG&gt;&lt;U&gt;I wasn&#39;t calling anyone on here=\r\n a fraud&lt;/U&gt;&lt;/STRONG&gt;...cuz that would be like the pot calling the kettle b=\r\nlack then (I edited my files by cutting out junk in between too!)&nbsp;and =\r\nI&#39;m sorry if you felt it came off that way...I didn&#39;t mean for it to...some=\r\ntimes I have a bit of a hard time trying to express myself via email...if w=\r\ne was talkin in real life, face to face that would be a whole `nother ball =\r\nof wax.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Rhonda&lt;/DIV&gt;\n&lt;DIV&gt;&lt;B=\r\nR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;bruce halliday &lt;paranormalinvestiga&lt;WBR&gt;ting@hotmail.&lt;WBR&gt;co=\r\nm&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/DIV&gt;\n&lt;BLOCKQUOTE class=3DEC_replbq style=3D&quot;BORDER-LE=\r\nFT: #1010ff 2px solid&quot;&gt;\n&lt;DIV id=3DEC_ygrp-text&gt;\n&lt;DIV&gt;Rhonda,&lt;BR&gt;&nbsp;&lt;BR&gt;I=\r\n have explained why, and have even posted a comparison file to bolster my e=\r\nxplanation.&lt;BR&gt;Sceptics are closed minded individuals that will never conce=\r\nde to any kind of paranormal proof&lt;BR&gt;no matter how it is presented, in my =\r\noriginal post I stated that I was beyond considering proving this communica=\r\ntion.&lt;BR&gt;One would only have to turn on a box in someones presence to do th=\r\nat. The important thing to me now&lt;BR&gt;Is the messages that are being receive=\r\nd and understanding their meaning. If that takes me cutting out a few blips=\r\n and blahs&lt;BR&gt;from a file in order to hear the message without interruption=\r\n, so be it. Hard line sceptics in my book are the bottom feeders of &lt;BR&gt;the=\r\n paranormal world, because they are incompetenet when it comes to gathering=\r\n valid data or they are frightened by the &lt;BR&gt;chance of proving something t=\r\nhat they are afraid really does exist or for whatever reason. in my ten yea=\r\nrs of experience in dealing with them&lt;BR&gt;I have never run into one that&#39;s m=\r\nind could be changed, even if it was a manifested spirit themselves trying =\r\nto change it.&lt;BR&gt;&nbsp;&lt;BR&gt;So to me Sceptics and debunkers be damned!&lt;BR&gt;&n=\r\nbsp;&lt;BR&gt;I clip the garbage from my files and so do some of the other more e=\r\nxperienced &lt;BR&gt;researchers here. By your statement in this post you are say=\r\ning that I am a dishonest researcher and the files I present are doctored o=\r\nr fraudulent.&lt;BR&gt;&nbsp;&lt;BR&gt;&lt;STRONG&gt;&lt;U&gt;&quot;did it occur to me that others on he=\r\nre would either....&lt;/U&gt;&lt;/STRONG&gt;&lt;BR&gt;&lt;STRONG&gt;&lt;U&gt;but ur right there are peopl=\r\ne out there who are dishonest &lt;/U&gt;&lt;/STRONG&gt;&lt;BR&gt;&lt;STRONG&gt;&lt;U&gt;and would do that=\r\n without blinkin an eye....&quot;&lt;/U&gt;&lt;/STRONG&gt;&lt;BR&gt;&nbsp;&lt;BR&gt;&nbsp;&lt;BR&gt;&nbsp;&lt;BR&gt;=\r\nJuli was very hasty in writing that post and It was actually directed at a =\r\nsingle individual, it should never have been written without forethought of=\r\n the ramifications it would insinuate.&lt;BR&gt;She has attempted to amend her po=\r\nsition in a short post following the one she wrote mentioning my name and S=\r\nteve&#39;s name, omitting us from her comments. But I guess that did not work e=\r\nvidently, Like I told her most readers of the post would take the wrong mea=\r\nning.&lt;BR&gt;&nbsp;&lt;BR&gt;At this point in my research I do not feel the need to p=\r\nrove anything to anyone, and like I said all raw versions of my files will =\r\nbe made available upon request by respected critics in this field.&lt;BR&gt;&nbsp=\r\n;&lt;BR&gt;Bruce&lt;BR&gt;&nbsp;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;&nbsp;&lt;BR&gt;\n&lt;DIV align=3Dcenter&gt;&lt;FONT size=\r\n=3D4&gt;&lt;FONT color=3D#0033cc&gt;&lt;STRONG&gt;&lt;EM&gt;&lt;FONT color=3D#000000 size=3D5&gt;Bruce=\r\n Halliday &lt;BR&gt;&lt;/FONT&gt;&lt;/EM&gt;&lt;/STRONG&gt;&lt;BR&gt;&lt;A href=3D&quot;http://free-paranormalinv=\r\nestigating.com/%3C/div%3E%3C/div%3E%3Cp%20/%3E%3Cdiv%20class=3D&quot; target=3D_=\r\nblank&gt;&lt;/FONT&gt;&lt;/FONT&gt;&lt;/DIV&gt;&lt;/A&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;BLOCKQUOTE&gt;\n&lt;HR&gt;\nTo: EVP-ITC@yahoog=\r\nroups&lt;WBR&gt;.com&lt;BR&gt;From: rhondak1973@&lt;WBR&gt;yahoo.com&lt;BR&gt;Date: Fri, 18 Apr 200=\r\n8 20:55:49 -0700&lt;BR&gt;Subject: Re: [EVP-ITC] Undies in a Bundy!&lt;BR&gt;&lt;BR&gt;\n&lt;DIV =\r\nid=3DEC_EC_ygrp-mlmsg&gt;\n&lt;DIV id=3DEC_EC_ygrp-msg&gt;\n&lt;DIV id=3DEC_EC_ygrp-text&gt;=\r\n\n&lt;DIV&gt;I understand now what ya&#39;ll are saying...it never occurred to me to e=\r\ndit my stuff to make it sound good nor did it occur to me that others on he=\r\nre would either....but ur right there are people out there who are dishones=\r\nt and would do that without blinkin an eye....which is sad and&nbsp;would m=\r\nake it hard on our parts to prove to skeptics that we arent BSing them.&nbs=\r\np; Im gonna stop cuttin out the garbage in my files....I was doing it mainl=\r\ny to save us some space on the forum cuz I dont want us to run out and have=\r\n to delete stuff. (would prolly help if everyone posted mp3s tho instead of=\r\n wav files even if they are short they are still bigger than the mp3)&lt;/DIV&gt;=\r\n\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Rhonda&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;Jules &lt;ghostchas=\r\ningfool@&lt;WBR&gt;yahoo.com&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/DIV&gt;\n&lt;BLOCKQUOTE class=3DEC_EC_r=\r\neplbq style=3D&quot;BORDER-LEFT: #1010ff 2px solid&quot;&gt;\n&lt;DIV id=3DEC_EC_ygrp-text&gt;\n=\r\n&lt;DIV&gt;Holy Cow, I leave for my daughters school event at 3:30 and I have &lt;BR=\r\n&gt;too much email on this subject!&lt;BR&gt;&lt;BR&gt;First and foremost I was directing =\r\nthose who are in fact are &lt;BR&gt;paranormal investigators, in field research. =\r\nMany here are not! I &lt;BR&gt;was in no way implying that Bruce, Steve, etc. wer=\r\ne fabricating their &lt;BR&gt;audio clips in any way!!!! I HIGH RESPECT BRUCE, ST=\r\nEVE AND THE the &lt;BR&gt;other on this board! I am speaking from my experiences,=\r\n and being in &lt;BR&gt;the line of fire throughout the years regarding cutting a=\r\nnd pasting &lt;BR&gt;clips together.&lt;BR&gt;&lt;BR&gt;I don&#39;t care what you do to be comple=\r\ntely honest, I just know that &lt;BR&gt;given the drama and know how nasty people=\r\n can be, I will not cut and &lt;BR&gt;paste which is my preference. Just because =\r\nsomeone who does, given &lt;BR&gt;their reputation (such as Bruce&#39;s) I certainly =\r\nwould have no reason &lt;BR&gt;to question the authenticity of his work. However,=\r\n there are those &lt;BR&gt;who I do question, such as the post of Mr.Roundtrees p=\r\nhoto&#39;s (posted &lt;BR&gt;the previous day) and given the manufacturing of those s=\r\no called &lt;BR&gt;ghost photo&#39;s I would serious NEVER take any audio he produced=\r\n as &lt;BR&gt;creditable. This is the point I was trying to make. &lt;BR&gt;&lt;BR&gt;I will =\r\nalso tell you that a year ago upon listening to some of the &lt;BR&gt;files here,=\r\n the first thing I noticed was that when I played certain &lt;BR&gt;files I could=\r\n clearly see with the editing software that they were &lt;BR&gt;not raw audio. I =\r\nimmediately formed an opinion that they in fact &lt;BR&gt;could be bogus! That wa=\r\ns my initial impression. It wasn&#39;t until I &lt;BR&gt;formed a personal friendship=\r\n with some of them that I know THEY WOULD &lt;BR&gt;NEVER comprise their integrit=\r\ny and that this specific research was &lt;BR&gt;extremely important to them. I wi=\r\nll be the first to admit that I was &lt;BR&gt;very wrong, but I did base my judgm=\r\nent given what I saw. Other may &lt;BR&gt;just do the same.&lt;BR&gt;&lt;BR&gt;The average pe=\r\nrson who happens upon this search who in fact has been &lt;BR&gt;subject to those=\r\n who do not stand behind their research will not know &lt;BR&gt;better. They too =\r\nmay just form the same opinion based on what they &lt;BR&gt;have come across in t=\r\nhis industry. &lt;BR&gt;&lt;BR&gt;Many I have had the pleasure of talking to outside th=\r\nis board, and I &lt;BR&gt;will tell you that it is an honor to be among good hone=\r\nst creditable &lt;BR&gt;people, who truly do care! I know NONE OF YOU whom I have=\r\n spoken &lt;BR&gt;with would EVER do this, but unfortunately there are those who =\r\nwill.&lt;BR&gt;&lt;BR&gt;I hope this clears things up, and people are not going to make=\r\n a &lt;BR&gt;mountain out of a mole hill.&lt;BR&gt;&lt;BR&gt;Juli&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQ=\r\nUOTE&gt;&lt;BR&gt;\n&lt;DIV&gt;\n&lt;HR SIZE=3D1&gt;\nBe a better friend, newshound, and know-it-al=\r\nl with Yahoo! Mobile. &lt;A href=3D&quot;http://us.rd.yahoo.com/evt=3D51733/*http:/=\r\n/mobile.yahoo.com/;_ylt=3DAhu06i62sR8HDtDypao8Wcj9tAcJ&quot; target=3D_blank&gt;Try=\r\n it now.&lt;/A&gt; \n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;SPAN style=3D&quot;COLOR: white&quot;&gt;&lt;/SPAN&gt;&lt;/DI=\r\nV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;\n&lt;HR&gt;\nMore immediate than e-mail? &lt;A href=3D=\r\n&quot;http://www.windowslive.com/messenger/overview.html?ocid=3DTXT_TAGLM_WL_Ref=\r\nresh_instantaccess_042008&quot; target=3D_blank&gt;Get instant access with Windows =\r\nLive Messenger.&lt;/A&gt; \n&lt;DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;\n&lt;P&gt;\n&lt;HR SIZE=\r\n=3D1&gt;\nBe a better friend, newshound, and know-it-all with Yahoo! Mobile. &lt;A=\r\n href=3D&quot;http://us.rd.yahoo.com/evt=3D51733/*http://mobile.yahoo.com/;_ylt=\r\n=3DAhu06i62sR8HDtDypao8Wcj9tAcJ&quot; target=3D_blank&gt;Try it now.&lt;/A&gt; \n&lt;P&gt;&lt;BR&gt;&lt;/=\r\nDIV&gt;&lt;SPAN style=3D&quot;COLOR: white&quot;&gt;&lt;/SPAN&gt; \n&lt;STYLE&gt;\n.ExternalClass #EC_ygrp-m=\r\nkp\n{border:1px solid #d8d8d8;font-family:Arial;padding:0px 14px;}\n.External=\r\nClass #EC_ygrp-mkp hr\n{border:1px solid #d8d8d8;}\n.ExternalClass #EC_ygrp-m=\r\nkp #EC_hd\n{color:#628c2a;font-size:85%;font-weight:bold;line-height:122%;}\n=\r\n.ExternalClass #EC_ygrp-mkp #EC_ads\n{margin-bottom:10px;}\n.ExternalClass #E=\r\nC_ygrp-mkp .EC_ad\n{padding:0 0;}\n.ExternalClass #EC_ygrp-mkp .EC_ad a\n{colo=\r\nr:#0000ff;text-decoration:none;}\n\n&lt;/STYLE&gt;\n\n&lt;STYLE&gt;\n.ExternalClass #EC_ygrp=\r\n-sponsor #EC_ygrp-lc\n{font-family:Arial;}\n.ExternalClass #EC_ygrp-sponsor #=\r\nEC_ygrp-lc #EC_hd\n{font-weight:bold;font-size:78%;line-height:122%;}\n.Exter=\r\nnalClass #EC_ygrp-sponsor #EC_ygrp-lc .EC_ad\n{margin-bottom:10px;padding:0 =\r\n0;}\n\n&lt;/STYLE&gt;\n\n&lt;STYLE&gt;\n.ExternalClass #EC_ygrp-mlmsg\n{font-size:13px;font-f=\r\namily:arial,helvetica,clean,sans-serif;}\n.ExternalClass #EC_ygrp-mlmsg tabl=\r\ne\n{font-size:inherit;font:100%;}\n.ExternalClass #EC_ygrp-mlmsg select, .Ext=\r\nernalClass input, .ExternalClass textarea\n{font:99% arial,helvetica,clean,s=\r\nans-serif;}\n.ExternalClass #EC_ygrp-mlmsg pre, .ExternalClass code\n{font:11=\r\n5% monospace;}\n.ExternalClass #EC_ygrp-mlmsg EC_*\n{line-height:1.22em;}\n.Ex=\r\nternalClass #EC_ygrp-text\n{font-family:Georgia;}\n.ExternalClass #EC_ygrp-te=\r\nxt p\n{;}\n.ExternalClass #EC_ygrp-tpmsgs\n{font-family:Arial;clear:both;}\n.Ex=\r\nternalClass #EC_ygrp-vitnav\n{padding-top:10px;font-family:Verdana;font-size=\r\n:77%;}\n.ExternalClass #EC_ygrp-vitnav a\n{padding:0 1px;}\n.ExternalClass #EC=\r\n_ygrp-actbar\n{clear:both;white-space:nowrap;color:#666;text-align:right;}\n.=\r\nExternalClass #EC_ygrp-actbar .EC_left\n{float:left;white-space:nowrap;}\n.Ex=\r\nternalClass .EC_bld\n{font-weight:bold;}\n.ExternalClass #EC_ygrp-grft\n{font-=\r\nfamily:Verdana;font-size:77%;padding:15px 0;}\n.ExternalClass #EC_ygrp-ft\n{f=\r\nont-family:verdana;font-size:77%;border-top:1px solid #666;padding:5px 0;}\n=\r\n.ExternalClass #EC_ygrp-mlmsg #EC_logo\n{padding-bottom:10px;}\n.ExternalClas=\r\ns #EC_ygrp-reco\n{margin-bottom:20px;padding:0px;}\n.ExternalClass #EC_ygrp-r=\r\neco #EC_reco-head\n{font-weight:bold;color:#ff7900;}\n.ExternalClass #EC_reco=\r\n-grpname\n{font-weight:bold;}\n.ExternalClass #EC_reco-category\n{font-size:77=\r\n%;}\n.ExternalClass #EC_reco-desc\n{font-size:77%;}\n.ExternalClass #EC_ygrp-v=\r\nital\n{background-color:#e0ecee;margin-bottom:20px;padding:2px 0 8px 8px;}\n.=\r\nExternalClass #EC_ygrp-vital #EC_vithd\n{font-size:77%;font-family:Verdana;f=\r\nont-weight:bold;color:#333;text-transform:uppercase;}\n.ExternalClass #EC_yg=\r\nrp-vital ul\n{padding:0;}\n.ExternalClass #EC_ygrp-vital ul li\n{list-style-ty=\r\npe:none;clear:both;border:1px solid #e0ecee;}\n.ExternalClass #EC_ygrp-vital=\r\n ul li .EC_ct\n{font-weight:bold;color:#ff7900;float:right;width:2em;text-al=\r\nign:right;padding-right:.5em;}\n.ExternalClass #EC_ygrp-vital ul li .EC_cat\n=\r\n{font-weight:bold;}\n.ExternalClass #EC_ygrp-vital a\n{text-decoration:none;}=\r\n\n.ExternalClass #EC_ygrp-vital a:hover\n{text-decoration:underline;}\n.Extern=\r\nalClass #EC_ygrp-sponsor #EC_hd\n{color:#999;font-size:77%;}\n.ExternalClass =\r\n#EC_ygrp-sponsor #EC_ov\n{padding:6px 13px;background-color:#e0ecee;margin-b=\r\nottom:20px;}\n.ExternalClass #EC_ygrp-sponsor #EC_ov ul\n{padding:0 0 0 8px;}=\r\n\n.ExternalClass #EC_ygrp-sponsor #EC_ov li\n{list-style-type:square;padding:=\r\n6px 0;font-size:77%;}\n.ExternalClass #EC_ygrp-sponsor #EC_ov li a\n{text-dec=\r\noration:none;font-size:130%;}\n.ExternalClass #EC_ygrp-sponsor #EC_nc\n{backg=\r\nround-color:#eee;margin-bottom:20px;padding:0 8px;}\n.ExternalClass #EC_ygrp=\r\n-sponsor .EC_ad\n{padding:8px 0;}\n.ExternalClass #EC_ygrp-sponsor .EC_ad #EC=\r\n_hd1\n{font-family:Arial;font-weight:bold;color:#628c2a;font-size:100%;line-=\r\nheight:122%;}\n.ExternalClass #EC_ygrp-sponsor .EC_ad a\n{text-decoration:non=\r\ne;}\n.ExternalClass #EC_ygrp-sponsor .EC_ad a:hover\n{text-decoration:underli=\r\nne;}\n.ExternalClass #EC_ygrp-sponsor .EC_ad p\n{;}\n.ExternalClass EC_o\n{font=\r\n-size:0;}\n.ExternalClass .EC_MsoNormal\n{;}\n.ExternalClass #EC_ygrp-text tt\n=\r\n{font-size:120%;}\n.ExternalClass blockquote\n{;}\n.ExternalClass .EC_replbq\n{=\r\n;}\n\n&lt;/STYLE&gt;\n&lt;/BLOCKQUOTE&gt;&lt;br /&gt;&lt;hr /&gt;Going green? &lt;a href=3D&#39;http://green.=\r\nmsn.com/galleries/photos/photos.aspx?gid=3D164&ocid=3DT003MSN51N1653A&#39; targ=\r\net=3D&#39;_new&#39;&gt;See the top 12 foods to eat organic.&lt;/a&gt;&lt;/body&gt;\n&lt;/html&gt;\r\n--_ee9ff31f-477b-4171-a705-5711707bd609_--"}