{"id": "10160", "subject": "Re: CW Program for morse code", "author": "Steve Hultay", "timestamp": "2008-04-19T23:59:12Z", "full_text": "Thank you for doing that, i figured it was worth a shot at testing.  \nI didn&#39;t set out for morse code today, i was toying with the idea of \ndifferent sounding frequencies and through EvpMaker it sounded like \nmorse code to me.  That&#39;s when the light bulb went off for the idea.  \nI&#39;ve stopped evpmaker and for some reason that Cwget program is still \nspitting out letters.  I wonder if there is a delay if there is too \nmuch coming out of the speakers at one time and the program has to \nplay catch up.  \n\n-Steve\n\n\n\n--- In EVP-ITC@yahoogroups.com, Stefan Bion &lt;yahoogroups@...&gt; wrote:\n&gt;\n&gt; Hi Steve,\n&gt; \n&gt; the CW decoder gets mainly the letters E, I and T.\n&gt; I also noticed that the beeps are all the same length in your file.\n&gt; \n&gt; So I made a raw audio file for EVPmaker that contains three cues: \nThe\n&gt; &quot;dit&quot; and &quot;dah&quot; beeps, and an &quot;intra-character gap&quot;:\n&gt; \n&gt; http://groups.yahoo.com/group/EVP-ITC/files/Stefan/Morse%\n20code/morse.wav\n&gt; \n&gt; The &quot;Use Cue List&quot; option must be checked in EVPmaker to use this \nfile.\n&gt; \n&gt; Now it sounds a bit more like actual morse code, and CwGet is able \nto\n&gt; decode more letters. Perhaps some former ham operators &quot;over there&quot; \nare\n&gt; able to use it... :)\n&gt; \n&gt; Stefan\n&gt; \n&gt; -- \n&gt; \n&gt; \n&gt; &gt; Here&#39;s the program if anybody wants to play around with it.  It \nalso \n&gt; &gt; picks up stuff without playing the file through evpmaker and \nconverts \n&gt; &gt; it into letters just by using the microphone on the computer.  \nI&#39;m \n&gt; &gt; going to try and figure this out later, you can also cancel out \n&gt; &gt; certain frequencies too.  It&#39;s worth exploring into this a bit.  \nFor \n&gt; &gt; those who don&#39;t get what i&#39;m trying to do, i&#39;m running my \nfrequency \n&gt; &gt; file through evpmaker and it than sounds like morse code.  Than \ni&#39;m \n&gt; &gt; using a program to try and convert the jumbled morse code \nsounding \n&gt; &gt; file from evpmaker into coherent messages typed on the computer \n&gt; &gt; screen.\n&gt; \n&gt;   \n&gt; &gt; The program is called Cwget.  I grew up on Ham Radio, so this \ndoesn&#39;t \n&gt; &gt; sound so far fetched for me.  But sorry if i&#39;m losing some people \non \n&gt; &gt; this method.\n&gt; \n&gt; &gt; 73&#39;s\n&gt; &gt; -Steve H.\n&gt; \n&gt; &gt; p.s.  The program was too large for yahoo, so here&#39;s a link:\n&gt; \n&gt; &gt; http://www.dxsoft.com/micwget.htm\n&gt; \n&gt; \n&gt; \n&gt; &gt; ------------------------------------\n&gt; \n&gt; &gt; Yahoo! Groups Links\n&gt;"}