{"id": "1017", "subject": "Re: Intro", "author": "wgungfu", "timestamp": "2007-04-03T21:16:36Z", "full_text": "Yah, you really should keep some for your self.  I told you before,\nsome people tend to take advantage of your kindness.  Still haven&#39;t\ngotten around to building anything off your plans, have to get a\ndecent soldering iron (I have a few electronics projects in the queue\nactually, including a home pong kit I have).\n\nBy the way, I meant to these two questions a while ago:\n\n1) With your random station switching circuit, how long is the\ninterval between switches?\n\n2) What&#39;s the algorithm for the random switching?  Is there anything\nin the circuit that cuts out the possibility of it staying within\nclose proximity of the previous tuning interval?  For example software\nwise if I were generating a random number, unless I have a true random\nnumber generation sometimes the &quot;randomness&quot; follows predictable\npatterns, even recalling the same number over and over.  So for\nexample if your circuit is doing a change every millisecond but could\npossibly return to the same station several times during a 10\nmillisecond period, the result would be the possibility of a single\nstation being tuned for the majority of that 10 millisecond period\nrather than the truly random tunings you&#39;re looking for.\n\n\n\nMarty\n\n--- In EVP-ITC@yahoogroups.com, &quot;Frank Sumption&quot; &lt;franks-boxes@...&gt; wrote:\n&gt;\n&gt; Its&#39; the same, I haven&#39;t used it since. I tried to demonstrate it\nfor the \n&gt; film crew, but it wouldn&#39;t work Sunday. I&#39;ve been too busy just\nbuilding \n&gt; boards the past year.\n&gt; \n&gt; I gave away my last system sunday, so now hoping to get my own\nequipment \n&gt; together, and do more experimenting. I&#39;m still working on a printed\ncircuit \n&gt; board layout, but now have to change it again to add in the linear\nsweep \n&gt; mode.\n&gt; \n&gt; &gt;From: &quot;wgungfu&quot; &lt;wgungfu3@...&gt;\n&gt; &gt;Reply-To: EVP-ITC@yahoogroups.com\n&gt; &gt;To: EVP-ITC@yahoogroups.com\n&gt; &gt;Subject: [EVP-ITC] Re: Intro\n&gt; &gt;Date: Tue, 03 Apr 2007 20:20:19 -0000\n&gt; &gt;\n&gt; &gt;Heya Frank,\n&gt; &gt;\n&gt; &gt;Heh, I know how that is.  My work frowns down on personal use of email\n&gt; &gt;as well.\n&gt; &gt;\n&gt; &gt;By the way, how&#39;s it been going with your video ITC development?\n&gt; &gt;What&#39;s your setup look like since the last time I talked to you?\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;Marty\n&gt; &gt;\n&gt; &gt;--- In EVP-ITC@yahoogroups.com, &quot;Frank Sumption&quot; &lt;franks-boxes@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; Welcome Marty!  I tend to get tied up, and I still do most of my\n&gt; &gt;e-mail at\n&gt; &gt; &gt; work, despite almost getting fired for it.--DOH!\n&gt; &gt; &gt;\n&gt; &gt; &gt; Frank\n&gt; &gt; &gt;\n&gt; &gt; &gt; _________________________________________________________________\n&gt; &gt; &gt; Interest Rates Fall Again! $430,000 Mortgage for $1,399/mo -\n&gt; &gt;Calculate new\n&gt; &gt; &gt; payment\n&gt; &gt; &gt;\n&gt;\n&gt;http://www.lowermybills.com/lre/index.jsp?sourceid=lmb-9632-18679&moid=7581\n&gt; &gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; \n&gt; _________________________________________________________________\n&gt; Download Messenger. Join the i&#39;m Initiative. Help make a difference\ntoday. \n&gt; http://im.live.com/messenger/im/home/?source=TAGHM_APR07\n&gt;"}