{"id": "10229", "subject": "Re: The Research Must Move Forward (it&#39;s a long post but important please read)", "author": "LC Duplatt", "timestamp": "2008-04-21T15:37:23Z", "full_text": "Wow, some nice, deep thinking in those paragraphs, Bruce.  \n\nWhat do others think about Bruce&#39;s suggestion?  I want to see the \nreplies and weight it all... ;)\n\nLC\n\n--- In EVP-ITC@yahoogroups.com, &quot;bhali333&quot; \n&lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; \n&gt; Hi Everyone,\n&gt; \n&gt; I would like to make a serious suggestion.\n&gt; As a senior researcher in the live spirit communication field, \nMyself \n&gt; and a few other researchers here such as Steve hultay, Ann, LC\n&gt; Just to mention a couple have strived since the beginning to try \nand \n&gt; advance the technology, communication and relations with our spirit \n&gt; friends or whatever entities are participating in this \ncommunication \n&gt; research.\n&gt; \n&gt; In order to call this research it must continue to move forward.\n&gt; There are more than enough of the new people here, that do not \n&gt; qualify as new people anymore. But full fledged researchers. Of \n&gt; course they have much to learn, but so do we all.\n&gt; \n&gt; Which brings me to my suggestion.\n&gt; Steve and I have recently been discussing the point we have reached \n&gt; in the research, both in process and knowledge. We agreed on most \n&gt; points,\n&gt; the most important one being. It is time to move beyond the same \n&gt; mundane session content and the same rudimentary line of \nquestioning.\n&gt; \n&gt; This research is stagnating for lack of direction, any posted files \n&gt; or discussions revolve around the same stale subjects such as, \n&gt; &quot;Is there anyone there that wishes to communicate&quot;, \n&gt; &quot;What is your name&quot;\n&gt; &quot;who am I speaking with&quot;\n&gt; &quot;what is it like where you are&quot;\n&gt; \n&gt; I believe we have all received every combination of answer to those \n&gt; questions that we possibly can, yet we continue to ask them session \n&gt; after session. And still become amazed at a yes or no answer or the \n&gt; simplest of phrases.\n&gt; \n&gt; I am not saying this about any single level of researcher but all \nof \n&gt; us myself included have fallen into this rut. We are not learning \n&gt; anything, All our efforts are amounting to nothing.\n&gt; \n&gt; We already know that we are communicating with someone or \nsomething. \n&gt; I believe we have all come to believe that through our personal \n&gt; research and the evidence presented by all of us.\n&gt; \n&gt; Within the last year the technology and potential of this type of \n&gt; research has exceeded all expectations in it&#39;s quality and speed of \n&gt; development. We are actually letting it go to waste.\n&gt; \n&gt; I and a few other researchers believe that whoever is on the other \n&gt; side of the line has had a hand in some of us developing this new \n&gt; equipment and methods of research be it obvious or subtle.\n&gt; \n&gt; But our methods of research have not excelled, we are conducting \n&gt; research in the same manner as we did when there where only about 5 \n&gt; of us in the whole world actively doing this research.\n&gt; \n&gt; New individuals are joining our ranks and becoming interested in \nbox \n&gt; research every day. The protocol they are being instructed to use \nis \n&gt; antiquated and obsolete.\n&gt; \n&gt; It is fine to teach them these methods as a basic foundation of the \n&gt; research and to get their feet wet. But like any other education \n&gt; process it must evolve and develop with the accumulation of \nknowledge.\n&gt; \n&gt; If we approached academic education the way we approach box \nresearch, \n&gt; we would all still be in the first grade.\n&gt; \n&gt; I propose a committee to develop a method of research and protocol \n&gt; that can deal with the ever evolving technology and decide what and \n&gt; how we should approach the type of communication we seek and the \n&gt; subject matter that should be addressed, that will be continually \n&gt; changing.\n&gt; \n&gt; Only in this way will the wheels of research and learning move \n&gt; forward and we will gain the knowledge we seek and hopefully be \nable \n&gt; to share it with the world someday.\n&gt; \n&gt; But if we continue to ask &quot;Is anyone there willing to speak with me&quot;\n&gt; We are doomed.\n&gt; \n&gt; Anyone that wishes to discuss this and give opinions or suggestions\n&gt; please lets try and get started every minute we waste is a missed \n&gt; opportunity for learning.\n&gt; \n&gt; Bruce\n&gt;"}