{"id": "10234", "subject": "Re: Note to ALL: Convert your WAV files to MP3", "author": "Misty", "timestamp": "2008-04-21T16:45:21Z", "full_text": "Thanks Stefan. Yes for some things we obviously need/want to post as \nlarger formats thats why I suggested people try esnips or another \nfile sharing service. It&#39;s just gotten to the point of no choice but \ndo something different than how we previously have done it before. \nEvery little bit helps =)\n\nMisty\n\n--- In EVP-ITC@yahoogroups.com, &quot;Stefan Bion&quot; &lt;yahoogroups@...&gt; wrote:\n&gt;\n&gt; Hi Misty,\n&gt; \n&gt; if possible, I post all my audio files in the MP3 format. However, \nsome files that include cue lists must be stored in the WAV format \nfor technical reasons. If that&#39;s a problem, I can upload my files to \nmy own webspace rather than to the group&#39;s Files section, and only \npost the links.\n&gt; \n&gt; Stefan :)\n&gt; \n&gt; -- \n&gt; \n&gt; &gt; Hello all. It&#39;s that time again for me to remind you that the \ngroup \n&gt; &gt; is low on space (96% used) and actions will be taken. For now \nrather \n&gt; &gt; than delete everyones files I am asking that you convert your wav \n&gt; &gt; format into mp3 or smaller format before you post them to the \nfiles \n&gt; &gt; area.\n&gt; &gt; \n&gt; &gt; One member using 10+ megs out of our groups 100 total megs just \nisnt \n&gt; &gt; going to fly anymore. So starting in May all files that are not \n&gt; &gt; within size limits and arent in smallest formats will have to \nstart \n&gt; &gt; to get deleted.\n&gt; &gt; \n&gt; &gt; For those who cant convert your files I have programs that are \nfree \n&gt; &gt; to help you do that. For those that dont want to convert your \nfiles, \n&gt; &gt; you can use esnips to post your larger files and share them with \nthe \n&gt; &gt; group as links in posts. For those that ignore my posts and do \nwhat \n&gt; &gt; you want to anyway, your stuff will be deleted and your option to \n&gt; &gt; upload and share here in group will be disabled.\n&gt; &gt; \n&gt; &gt; As I said we have 100 (one hundred) megs total in file section \nfor \n&gt; &gt; sharing, please do not abuse your share of that space. As you can \nsee \n&gt; &gt; there are others who like to share too. Eventually we may just \nclean \n&gt; &gt; it out of everyones files but for now lets try and stick to \n&gt; &gt; compacting the things we upload and make use of places like \nesnips \n&gt; &gt; for sharing.\n&gt; &gt; \n&gt; &gt; Misty\n&gt;"}