{"id": "10245", "subject": "RE: [EVP-ITC] So many Posts _Files Getting Lost In the Shuffle", "author": "A H", "timestamp": "2008-04-21T19:35:55Z", "full_text": "-----Original Message-----\nFrom: &quot;Bryan Whatley&quot; &lt;bryan_whatley@...&gt;\nTo: EVP-ITC@yahoogroups.com\nSent: 4/21/08 2:48 PM\nSubject: Re: [EVP-ITC] So many Posts _Files Getting Lost In the Shuffle\n\nBruce, \n    My thoughts exactly.  Is there anyway we can move this group over to a better suited environment for categorizing?  I tend to think of being able to categorize these different emails in a place being much more managable in a bulletin board style forum.  Does anyone have access to one on their webhosted site that we could setup and and use?  \nAll the best,\nBryan\n\n\n----- Original Message ----\nFrom: bhali333 &lt;paranormalinvestigating@...&gt;\nTo: EVP-ITC@yahoogroups.com\nSent: Monday, April 21, 2008 11:29:44 AM\nSubject: [EVP-ITC] So many Posts _Files Getting Lost In the Shuffle\n\n\nhey guy&#39;s,\n\nI posted a number of files yesterday from my last EVP maker \nallophones session. and received not one response.\n\nI think this is due to the overwhelming amount of posts that are \nbeing written and files posted to this group.\n\nThe files that are posted, not just mine but all are important to the \nresearch and deserve to be heard and commented on by all.\n\nMy thoughts are that this group is not just a place to post research \nresults and posts pertaining to the technical and aspect and \nadvancement of this research, but has become a social forum in some \nways where small insignificant posts are tending to push other posts \nand file announcements to the back pages of the message area.\n\nAlso members personal e-mail is getting so cluttered with posts every \nday that most do not have the time, patience or strength to review \neach one and I know when I open a post be it here or in my e-mail and \nthe first couple of words have nothing or little to do with research \nor are repetitious of ten other posts. I simply hit the  delete \nbutton and the post goes unread.\n\nI know we all everyone, put a lot of time and work into our research \nand when it falls through the cracks without even being presented for \ncomment, it gets disheartening.\n\nMaybe we should start a group for social and casual discussion \namongst members and have this one for hard research posts.\nThat way one does not conflict with the other.\n\nI know I sound like sour grapes, but I&#39;m sure I&#39;m not the only one to \nfeel this way.\n\nAnd I know the comments will come that no one has time to read all \nthe posts or respond to all the files. I know all of this.\n\nThere is more to be said and more idea&#39;s on how to make the whole \nissue more amicable for everyone.\n\nI just want to get initial reaction first.\n\nBruce\n\n    \n\n\n      ____________________________________________________________________________________\nBe a better friend, newshound, and \nknow-it-all with Yahoo! Mobile.  Try it now.  http://mobile.yahoo.com/;_ylt=Ahu06i62sR8HDtDypao8Wcj9tAcJ"}