{"id": "10249", "subject": "Re: &gt;&gt;&gt;Note to ALL: Convert your WAV files to MP3&lt;&lt;", "author": "Frank", "timestamp": "2008-04-21T20:03:03Z", "full_text": "A thirty second .wav file costs about 5mb to 6mb, in .mp3 format it is\n@ 540kb. Most of my message files, which are about 3 to 5 seconds\n(contain 10 to 20 words) are 27kb to 40kb. A huge difference!\n\nI think thats a pretty good measure to go by. If you are posting a\nsingle message file and it is close to 1mb, then its probably too big. \n\nRegards, \n\nFrank R.\n\n--- In EVP-ITC@yahoogroups.com, &quot;LC Duplatt&quot; &lt;lcdupla@...&gt; wrote:\n&gt;\n&gt; Hi, Misty.  \n&gt; \n&gt; I am deleting some of my files, but is there a file size that is \n&gt; appropriate?  Though I posted audio in .wav files, they actually seem \n&gt; pretty small in file size.  I do not have time to convert these and \n&gt; wonder if they are OK the way they are?  \n&gt; \n&gt; Please advise...  :)\n&gt; \n&gt; LC\n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Misty&quot; &lt;bulletbabea@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hello all. It&#39;s that time again for me to remind you that the group \n&gt; &gt; is low on space (96% used) and actions will be taken. For now \n&gt; rather \n&gt; &gt; than delete everyones files I am asking that you convert your wav \n&gt; &gt; format into mp3 or smaller format before you post them to the files \n&gt; &gt; area.\n&gt; &gt; \n&gt; &gt; One member using 10+ megs out of our groups 100 total megs just \n&gt; isnt \n&gt; &gt; going to fly anymore. So starting in May all files that are not \n&gt; &gt; within size limits and arent in smallest formats will have to start \n&gt; &gt; to get deleted.\n&gt; &gt; \n&gt; &gt; For those who cant convert your files I have programs that are free \n&gt; &gt; to help you do that. For those that dont want to convert your \n&gt; files, \n&gt; &gt; you can use esnips to post your larger files and share them with \n&gt; the \n&gt; &gt; group as links in posts. For those that ignore my posts and do what \n&gt; &gt; you want to anyway, your stuff will be deleted and your option to \n&gt; &gt; upload and share here in group will be disabled.\n&gt; &gt; \n&gt; &gt; As I said we have 100 (one hundred) megs total in file section for \n&gt; &gt; sharing, please do not abuse your share of that space. As you can \n&gt; see \n&gt; &gt; there are others who like to share too. Eventually we may just \n&gt; clean \n&gt; &gt; it out of everyones files but for now lets try and stick to \n&gt; &gt; compacting the things we upload and make use of places like esnips \n&gt; &gt; for sharing.\n&gt; &gt; \n&gt; &gt; Misty\n&gt; &gt;\n&gt;"}