{"id": "10279", "subject": "Re: [EVP-ITC] what a surprise my last two response posts never made it to the group", "author": "juli velazquez", "timestamp": "2008-04-22T01:17:10Z", "full_text": "--0-904093450-1208827030=:89052\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nBruce,\n               Given the weekends discussions I can completely see why those have expressed their voices in frustration!  I myself was not able to post a reply given I was sick but you took it upon yourself to try an belittle me on this board.  I try not to make it a habit of speaking on behalf of other people, but you sure made it a point to address issues with many regarding what you believe I meant to say.  Last time I checked, I was able to speak and type and meant just what I said regarding editing of clips!   I believe you said and I quote ....\n   \n  &quot;Juli was very hasty in writing that post and It was actually directed at a single individual, it should never have been written without forethought of the ramifications it would insinuate.&quot;\n \nTrust me when I tell you that I was in NO WAY hasty regarding my initial post, and completely stand behind it!  You attacked Rhonda for voicing her opinion, in which she thought she offended me!  I had to send her a personal email today, correcting this!  If you want to act and look like an ass, be my guest, but quit bringing others into the mix.  You have been doing this with Steven as well, sending correspondence back and forth trying to eliminate him out of the mix by bad talking him to others.  You know for a fact that he terminated your working relationship because of these same issues, yet you continually refer to him as if you were still doing research together and had the some opinions of each subject which is not the case at all.  This is not who&#39;s got the Bigger Box, or who&#39;s got the best files, good God, grow up.  \n   \n  For the last couple of years of being apart of this board, I have NEVER addressed anyone like that or EVER asked Frank for a box.  However your kind deeds seem to come with a price tag!  For every time I disagree you want you hold #12 box over my head or threaten me so that I will return it.  \n   \n  I have discussed this very issue with you several months back that being HUMBLE will get you further in life, and instead of patting yourself on the back, allow others to do it for you.  I guess that went in one ear and out the other.  \n   \n  THERE ARE NO EXPERTS IN THIS FIELD, only those who have been building, and experimenting longer.  It does not give anyone the right for ANYONE to speak to ANYONE in a condescending manner, for EVERYONE has something to contribute whether they are NEW OR OLD.  We are NEVER going to all agree on every issue, but have respect, tone it down, and how about LISTEN for a change instead of trying to get the first word in and beating everyone to the punch!\n   \n  Juli\n   \n  \nbhali333 &lt;paranormalinvestigating@...&gt; wrote:\n          \nIsn&#39;t it great when only the moderators and a select few get to post \nvendictive responses that actually make it to the group and without \nfear of reprisal.\n\nFunny my responses to Frank S. and Frank Rat went unposted.\n\nwelcome to cold war moscow. betcha ten bucks this one don&#39;t make it \nthrough either.\n\nBruce\n\n\n\n                           \n\n\n  The contents of this eletronic correspondence is private & confidential and meant only for the party and/or parties it is addressed to.  \n   \n  No part of this email transmission may be publicly posted or forwarded to other parties without explicit written permission.\n\n\r\n--0-904093450-1208827030=:89052\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;DIV&gt;Bruce,&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Given the weekends discussions I can completely see why those have expressed their voices in frustration!&nbsp;&nbsp;I myself was not able to post a reply given I was sick&nbsp;but you took it upon yourself to try an belittle me on this board.&nbsp; I try not to make it a habit of speaking on behalf of other people, but you sure made it a point to address issues with many regarding what you believe I meant to say.&nbsp;&nbsp;Last time I checked, I&nbsp;was able to speak and type and meant&nbsp;just what I said regarding editing of clips!&nbsp; &nbsp;I believe you said and I quote&nbsp;....&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;&lt;FONT color=#ff0000&gt;&quot;Juli was very hasty in writing that post and It was actually directed at a single individual, it should never have been written without forethought of the ramifications it would insinuate.&quot;&lt;BR&gt;&nbsp;&lt;BR&gt;&lt;/FONT&gt;Trust me when I tell you that I\n was in &lt;FONT color=#ff0000&gt;NO WAY&lt;/FONT&gt; hasty regarding my initial post, and completely stand behind it!&nbsp; You attacked Rhonda for voicing her opinion, in which she thought she offended me!&nbsp; I had to send her a personal email today, correcting this!&nbsp; If you want to act and look like an ass, be my guest, but quit bringing others into the mix.&nbsp; You have been doing this with Steven as well, sending correspondence back and forth trying to eliminate him out of the mix by bad talking him to others.&nbsp; You know for a fact that he terminated your working relationship because of these same issues, yet you continually refer to him as if you were still doing research together and had the some opinions of each subject which is not the case at all.&nbsp; This is not who&#39;s got the Bigger Box, or who&#39;s got the best files, good God, grow up.&nbsp; &lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;For the last couple of years of being apart of this board, I have NEVER addressed anyone\n like that or EVER asked Frank for a box.&nbsp; However your kind deeds seem to come with a price tag!&nbsp; For every time I disagree you want you hold #12 box over my head or threaten me so that I will return it.&nbsp; &lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;I have discussed this very issue&nbsp;with you several months back that being &lt;FONT color=#0000ff&gt;HUMBLE&lt;/FONT&gt; will get you further in life, and instead of patting yourself on the back, allow others to do it for you.&nbsp; I guess that went in one ear and out the other.&nbsp; &lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;&lt;FONT color=#0000ff&gt;&lt;FONT color=#ff0000&gt;THERE ARE NO EXPERTS IN THIS FIELD&lt;/FONT&gt;,&lt;/FONT&gt; only those who have been building, and experimenting longer.&nbsp; It does not give anyone the right for &lt;FONT color=#ff0000&gt;ANYONE to&lt;/FONT&gt; speak to&lt;FONT color=#ff0000&gt; ANYONE&lt;/FONT&gt; in a condescending manner, for EVERYONE has something to contribute whether they are &lt;FONT color=#ff0000&gt;NEW OR OLD&lt;/FONT&gt;.&nbsp; We are &lt;FONT\n color=#ff0000&gt;NEVER&lt;/FONT&gt; going to all agree on every issue, but have respect, tone it down, and how about LISTEN for a change instead of trying to get the first word in and beating everyone to the punch!&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;Juli&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;bhali333 &lt;paranormalinvestigating@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/DIV&gt;  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;DIV&gt;&lt;BR&gt;Isn&#39;t it great when only the moderators and a select few get to post &lt;BR&gt;vendictive responses that actually make it to the group and without &lt;BR&gt;fear of reprisal.&lt;BR&gt;&lt;BR&gt;Funny my responses to Frank S. and Frank\n Rat went unposted.&lt;BR&gt;&lt;BR&gt;welcome to cold war moscow. betcha ten bucks this one don&#39;t make it &lt;BR&gt;through either.&lt;BR&gt;&lt;BR&gt;Bruce&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;&lt;DIV&gt;  &lt;div&gt;&lt;EM&gt;&lt;STRONG&gt;&lt;FONT color=#0000ff&gt;The contents of this eletronic correspondence is private\n &amp; confidential and meant only for the party and/or parties it is addressed to.&nbsp; &lt;/FONT&gt;&lt;/STRONG&gt;&lt;/EM&gt;&lt;/div&gt;  &lt;div&gt;&lt;EM&gt;&lt;STRONG&gt;&lt;FONT color=#0000ff&gt;&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/EM&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;&lt;EM&gt;&lt;STRONG&gt;&lt;FONT color=#0000ff&gt;No part of this email transmission may be publicly posted or forwarded to other parties without explicit written permission.&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/EM&gt;&lt;/div&gt;&lt;/DIV&gt;\r\n--0-904093450-1208827030=:89052--"}