{"id": "10277", "subject": "Re: The Research Must Move Forward (it&#39;s a long post but important please read)", "author": "Frank", "timestamp": "2008-04-22T00:57:44Z", "full_text": "Normally, I do not respond to such emails but a few things need to be\nset straight just so the newer members don&#39;t think the comments that\nhave been made by Frank S, myself or anyone else are out of line. \n\nBruce did leave on his own accord a couple months ago but only after\nhe was placed on probation and his posting rights taken away for being\nnasty, belittling and insulting to several members. After many\nwarnings! He was let back in the group only after he privately emailed\nthe group owner, who through the kindness of her heart gave him\nanother chance.\n\nBruce has by his own words named himself the expert and in this own\nwords, &quot;contributed more to box research than anyone else&quot;. He\nrepeatedly called himself the best in the world at it and so on. That\nis why Sumption could make the tongue-in-cheek remarks he made. He was\nonly repeating what Bruce had actually stated. If you don&#39;t believe\nme, do a search of the messages here and you will find it.\n\nApparently, Bruce also measures &quot;serious researchers&quot; by how much they\npost or spout their drivel so lesser experienced experimenters will\nlook up to them as some leader. There is a point where helping someone\nwith a technique becomes guiding someone through the research. Let me\ntell you, I have been in this research and other paranormal subject\nfor 15 years and I can promise you there are no experts despite what\nTV will tell you. I will give my opinion and views if directly asked\nbut I will not interject my view and change yours just for name\nrecognition. It is best for you to take a little knowledge of a\ntechnique and expand upon it in your own way. The method is not\nimportant as the bond.\n\nNow, you may hear from Bruce or a few people here will deliver this\nresponse to him. He will say he is being talked about without the\nopportunity to defend himself. I can&#39;t really help that because he\nalready unsubscribed. Well, those who would like to can paste his\nresponse anytime you want (as long as its not offensive). Nothing that\nI have said is untrue or libel. Anything described here can be looked\nup in our past messages and many can elaborate their own take on what\nhas been said.\n\nRegards,\n\nFrank R.\n\n--- In EVP-ITC@yahoogroups.com, bruce halliday\n&lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; \n&gt; Kay,\n&gt;  \n&gt; Everything Frank R. just said I have been preaching for a year.\n&gt; It is alway&#39;s about the harmony and positive energy.\n&gt;  \n&gt; And anyone knows that the technology is just a way of getting the\nmessage across.\n&gt; The whole meaning of my post was misconscrued it was only meant to\nspark some energy \n&gt; to move foward with all the research, technical and spiritual.\n&gt;  \n&gt; But sadly Kay my posts here are carefully scrutinised by some, and\nthe slightest miswording\n&gt; or lack of clarity in a post will present certain people with the\nopportunity to take a shot.\n&gt;  \n&gt; That is the reason I left this group a couple of months ago.\n&gt; I returned hoping to help people, but when I try to pass on any\nknowledge gained from experience\n&gt; Some feel threatened and a nedd to countermine anything I say.\n&gt;  \n&gt; When was the last time you read a post From Frank R.\n&gt;  \n&gt; This post and a couple of others will probably not make it to the board.\n&gt; If not you will all recieve private copies.\n&gt;  \n&gt; Bruce\n&gt; Bruce Halliday \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: psfponies@...: Mon, 21 Apr 2008 21:01:22\n+0000Subject: [EVP-ITC] Re: The Research Must Move Forward (it&#39;s a\nlong post but important please read)\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Thanks FrankKay--- In EVP-ITC@yahoogroups.com, &quot;Frank&quot;\n&lt;warrior18eii@&gt; wrote:&gt;&gt; Bingo Kay and William! The strength of your\nconnection and the clarity&gt; of your messages depends on the strength\nof the bond or bridge you&gt; develop with your friends on the otherside.\nThe equipment is only&gt; needed to materialize the message. This is why\nyou can use almost&gt; anything as a medium to bring them across.&gt; &gt; I\nlove to see people learn on their own through their own reasoning.&gt; &gt;\nRegards,&gt; &gt; Frank R.&gt; &gt; --- In EVP-ITC@yahoogroups.com, Wiliam Clarke\n&lt;reesclarke_69@&gt; wrote:&gt; &gt;&gt; &gt; I think your correct Kay!&gt; &gt; &gt; &gt;\npsfponies &lt;psfponies@&gt; wrote: Bruce &gt; &gt; &gt; &gt; I hate to say it but out\nof all the responses I have heard Mike &gt; &gt; Edwards seem to get the\nbest reponses to his questions on his &gt; &gt; clickity 12-469 shack hack\nbox. I think advancement isnt just about &gt; &gt; the equipment you use but\nthe relationship you develop with the &gt; &gt; spirits. &gt; &gt; &gt; &gt; Kay&gt; &gt; &gt; &gt;\n--- In EVP-ITC@yahoogroups.com, &quot;bhali333&quot; &gt; &gt;\n&lt;paranormalinvestigating@&gt; wrote:&gt; &gt; &gt;&gt; &gt; &gt; &gt; &gt; &gt; Hi Everyone,&gt; &gt; &gt; &gt;\n&gt; &gt; I would like to make a serious suggestion.&gt; &gt; &gt; As a senior\nresearcher in the live spirit communication field, &gt; &gt; Myself &gt; &gt; &gt;\nand a few other researchers here such as Steve hultay, Ann, LC&gt; &gt; &gt;\nJust to mention a couple have strived since the beginning to try &gt; &gt;\nand &gt; &gt; &gt; advance the technology, communication and relations with our\n&gt; &gt; spirit &gt; &gt; &gt; friends or whatever entities are participating in\nthis &gt; &gt; communication &gt; &gt; &gt; research.&gt; &gt; &gt; &gt; &gt; &gt; In order to call\nthis research it must continue to move forward.&gt; &gt; &gt; There are more\nthan enough of the new people here, that do not &gt; &gt; &gt; qualify as new\npeople anymore. But full fledged researchers. Of &gt; &gt; &gt; course they\nhave much to learn, but so do we all.&gt; &gt; &gt; &gt; &gt; &gt; Which brings me to my\nsuggestion.&gt; &gt; &gt; Steve and I have recently been discussing the point\nwe have &gt; &gt; reached &gt; &gt; &gt; in the research, both in process and\nknowledge. We agreed on most &gt; &gt; &gt; points,&gt; &gt; &gt; the most important one\nbeing. It is time to move beyond the same &gt; &gt; &gt; mundane session\ncontent and the same rudimentary line of &gt; &gt; questioning.&gt; &gt; &gt; &gt; &gt; &gt;\nThis research is stagnating for lack of direction, any posted &gt; &gt;\nfiles &gt; &gt; &gt; or discussions revolve around the same stale subjects such\nas, &gt; &gt; &gt; &quot;Is there anyone there that wishes to communicate&quot;, &gt; &gt; &gt;\n&quot;What is your name&quot;&gt; &gt; &gt; &quot;who am I speaking with&quot;&gt; &gt; &gt; &quot;what is it\nlike where you are&quot;&gt; &gt; &gt; &gt; &gt; &gt; I believe we have all received every\ncombination of answer to &gt; &gt; those &gt; &gt; &gt; questions that we possibly\ncan, yet we continue to ask them &gt; &gt; session &gt; &gt; &gt; after session. And\nstill become amazed at a yes or no answer or &gt; &gt; the &gt; &gt; &gt; simplest of\nphrases.&gt; &gt; &gt; &gt; &gt; &gt; I am not saying this about any single level of\nresearcher but all &gt; &gt; of &gt; &gt; &gt; us myself included have fallen into\nthis rut. We are not learning &gt; &gt; &gt; anything, All our efforts are\namounting to nothing.&gt; &gt; &gt; &gt; &gt; &gt; We already know that we are\ncommunicating with someone or &gt; &gt; something. &gt; &gt; &gt; I believe we have\nall come to believe that through our personal &gt; &gt; &gt; research and the\nevidence presented by all of us.&gt; &gt; &gt; &gt; &gt; &gt; Within the last year the\ntechnology and potential of this type of &gt; &gt; &gt; research has exceeded\nall expectations in it&#39;s quality and speed &gt; &gt; of &gt; &gt; &gt; development.\nWe are actually letting it go to waste.&gt; &gt; &gt; &gt; &gt; &gt; I and a few other\nresearchers believe that whoever is on the other &gt; &gt; &gt; side of the\nline has had a hand in some of us developing this new &gt; &gt; &gt; equipment\nand methods of research be it obvious or subtle.&gt; &gt; &gt; &gt; &gt; &gt; But our\nmethods of research have not excelled, we are conducting &gt; &gt; &gt;\nresearch in the same manner as we did when there where only about &gt; &gt;\n5 &gt; &gt; &gt; of us in the whole world actively doing this research.&gt; &gt; &gt; &gt;\n&gt; &gt; New individuals are joining our ranks and becoming interested in &gt;\n&gt; box &gt; &gt; &gt; research every day. The protocol they are being instructed\nto use &gt; &gt; is &gt; &gt; &gt; antiquated and obsolete.&gt; &gt; &gt; &gt; &gt; &gt; It is fine to\nteach them these methods as a basic foundation of &gt; &gt; the &gt; &gt; &gt;\nresearch and to get their feet wet. But like any other education &gt; &gt; &gt;\nprocess it must evolve and develop with the accumulation of &gt; &gt;\nknowledge.&gt; &gt; &gt; &gt; &gt; &gt; If we approached academic education the way we\napproach box &gt; &gt; research, &gt; &gt; &gt; we would all still be in the first\ngrade.&gt; &gt; &gt; &gt; &gt; &gt; I propose a committee to develop a method of\nresearch and protocol &gt; &gt; &gt; that can deal with the ever evolving\ntechnology and decide what &gt; &gt; and &gt; &gt; &gt; how we should approach the\ntype of communication we seek and the &gt; &gt; &gt; subject matter that should\nbe addressed, that will be continually &gt; &gt; &gt; changing.&gt; &gt; &gt; &gt; &gt; &gt; Only\nin this way will the wheels of research and learning move &gt; &gt; &gt;\nforward and we will gain the knowledge we seek and hopefully be &gt; &gt;\nable &gt; &gt; &gt; to share it with the world someday.&gt; &gt; &gt; &gt; &gt; &gt; But if we\ncontinue to ask &quot;Is anyone there willing to speak with &gt; &gt; me&quot;&gt; &gt; &gt; We\nare doomed.&gt; &gt; &gt; &gt; &gt; &gt; Anyone that wishes to discuss this and give\nopinions or suggestions&gt; &gt; &gt; please lets try and get started every\nminute we waste is a missed &gt; &gt; &gt; opportunity for learning.&gt; &gt; &gt; &gt; &gt; &gt;\nBruce&gt; &gt; &gt;&gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt;\n---------------------------------&gt; &gt; Be a better friend, newshound,\nand know-it-all with Yahoo! Mobile. &gt; Try it now.&gt; &gt;&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Pack up or back upuse SkyDrive to transfer files or keep extra\ncopies. Learn how.\n&gt;\nhttp://www.windowslive.com/skydrive/overview.html?ocid=TXT_TAGLM_WL_Refresh_skydrive_packup_042008\n&gt;"}