{"id": "10271", "subject": "Re: The Research Must Move Forward (it&#39;s a long post but important please read)", "author": "bhali333", "timestamp": "2008-04-21T23:33:53Z", "full_text": "Steve,\n\nFranks usual resentful remarks where not meant for you, but in \nresponse to a post I made that had nothing to do with frank or ratka.\n\nFor some reason they felt they needed to attack someone. They must \nreally feel inferior to always have to scrutinize and bash every post \ni write more than two words.\n\nAnd that is coming from two guys that put together have never done an \nhour of real box research.\n\nOh well, guess it&#39;s time for another vacation!\n\nbruce\n\n\n\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;Steve Hultay&quot; &lt;urkel23@...&gt; wrote:\n&gt;\n&gt; \n&gt; I didn&#39;t realize people thought of me that way frank, sometimes i \n&gt; believe my name is used in conjunction to a statement i&#39;m not aware \n&gt; of.  I don&#39;t know much about electronics and that&#39;s why if you read \n&gt; my post from yesterday i referred Kay to ask you about how the box \n&gt; works.  I never claimed to know anymore than the next person, i \ndon&#39;t \n&gt; believe i have an ego either.  I&#39;m still learning and always trying \n&gt; new things to stay refreshed in what i&#39;m doing here.  I know you no \n&gt; longer like me for whatever reasons you have, but i don&#39;t go \nbashing \n&gt; you on public forums.  Some call that cheap shots, i only speak \nabout \n&gt; you with respect and will continue to do so.  As a matter of fact, \n&gt; yesterday i called myself a dopey box researcher.  Does that sound \n&gt; like i&#39;m above the rest?\n&gt; \n&gt; -Steve H.\n&gt; \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; \n&gt; &lt;purplealiengirl@&gt; wrote:\n&gt; &gt;\n&gt; &gt;  Told ya! Let the friggin&#39; entities talk, and you might get \n&gt; &gt; something more meaningful, but then that wouldn&#39;t justify the ego \n&gt; &gt; crap, and the so called theories, and paranormal expertise.  So \n&gt; what \n&gt; &gt; good is it doing to ask all the &quot;right&quot; questions when you get \n&gt; vague \n&gt; &gt; junk back!? You have to let go the presumptions, and everything \nyou \n&gt; &gt; think you know. \n&gt; &gt; \n&gt; &gt;  What makes you two(Steve and Bruce) think you are so special \nthat \n&gt; &gt; you can get the answers to technology questions when they don&#39;t \n&gt; even \n&gt; &gt; tell me, Stefan, Bill, Ron, or any physical techs anything! At \n&gt; least \n&gt; &gt; we could implement any technical suggestions. Y&#39;all wouldn&#39;t know \n&gt; &gt; microfarad from a microbus(VW). \n&gt; &gt; \n&gt; &gt;  I think your guides quit talking cuz you&#39;re both are ego \ntripping \n&gt; &gt; into outter space. Yet you&#39;re pissed cuz I wouldn&#39;t allow myself \nto \n&gt; &gt; obligated to you for &quot;donations&quot;. \n&gt; &gt; \n&gt; &gt;  I been tryin&#39; to hold back, but this girl&#39;s still got hair \ntrigger!\n&gt; &gt; \n&gt; &gt;  So &#39;nuff public venting!\n&gt; &gt; \n&gt; &gt;  Frank-S\n&gt; &gt;\n&gt;"}