{"id": "10286", "subject": "Re: .....then why do I feel guilty?", "author": "Misty", "timestamp": "2008-04-22T07:38:18Z", "full_text": "Same ole same ole we&#39;ve seen it many many mannnny times. \n\nI dont know why people are always so conflictive in groups either. I \nhave watched you (and others)leave the group scene a few times over \nthe years because of disagreements or just tired of the BS. I think \nsooner or later we all feel like there is no hope for the group \natmosphere and we need a break from it. However I have also seen alot \nof productive ideas and some good things that do come with connecting \nwith others some of who think like we do.\n\nI still think its important ya stay active and speak up for yourself \nand your own work rather than let others put words in your mouth. \nIt&#39;s really the only reason I didnt just shut the thing down when you \nquit before.\n\nAt least while its open your opinions are available to the public \nrather than all of the false misinformation being sold to the world.\n\nAnd for those wondering, NO I wasn&#39;t involved in those old disputes \neither. And I dont blame ya for stepping away and taking the breaks \nya have. I probably told ya to once or twice myself before you \nstarted this group.\n\nIt gets to be overwhelming and I know why ya dont want to be owner.\n\nNobody runs this group. The group runs itself. Sometimes better than \nothers. Sometimes not.\n\nMisty\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@...&gt; \nwrote:\n&gt;\n&gt; \n&gt;  I didn&#39;t read any resulting posts from what I posted earlier, and \nI&#39;m not sure I want to. I&#39;ve been doing this for some years now, and \nit seems like ya can&#39;t go two weeks without someone that thinks they \nknow more, or their &quot;theories&quot; are more valid, or someone that \nbelieves for whatever reason they are the box/EVP/paranormal expert. \nI&#39;ve had enough, these groups are pointless, and I&#39;m tired of the BS. \nThere is always these incessant arguements with those that seem to \nthink they know better than anyone else. Maybe it&#39;s just me, and my \nover reactions, but at this point, I don&#39;t care, enough is enough. So \nya want the group? I don&#39;t actually own it due to one of these \nidiotic arguements, but have at it, cuz I ain&#39;t playing this game \nanymore. I&#39;ll continue my own work, in my own time, and in my own \nway. \n&gt;  \n&gt;  \n&gt;  \n&gt;  Frank-S\n&gt; _________________________________________________________________\n&gt; Going green? See the top 12 foods to eat organic.\n&gt; http://green.msn.com/galleries/photos/photos.aspx?\ngid=164&ocid=T003MSN51N1653A\n&gt;"}