{"id": "10283", "subject": "Re: what a surprise etc..", "author": "Misty", "timestamp": "2008-04-22T05:56:56Z", "full_text": "Hmm just walked in from long day at work to this blahh\n\nBruce, I see you have already unjoined. But ok, I checked it out, and \nI checked the mod log completely the past week. Bruce at no time were \nany of your messages deleted or rejected. You may have had a few \nmarked as spam that sat in the groups spam folder until one of those \nmods you are accusing of withholding, approved it and it was posted.\n\nWhen messages get denied or rejected or deleted...I see it... I see \neverything a mod does including myself. You guys have been allowed to \nspeak freely. Sorry that I have to work and cant be here every time \nthat you guys post and approve the message when yahoo marks it as \nspam. I cant help that. I have posted many many times on this subject \nand I am not going to defend yahoo&#39;s dorky determination of what is \nor isnt spam. Ya would think that a member marked as UNMODERATED \nwouldnt get messages marked as spam but it DOES happen. The more \nmembers this group gets the longer and more detailed the response \nchain becomes and most of Bruces posts get marked as spam as do some \nof the other members here. Sorry bout that.\n\nAs for the rest... I think others here have said the exact words I \nwould (and would not) say so repeating them would just be an &quot;echo&quot; =)\n\nAs for &quot;real box research&quot; being done for more than an hour ehhh ok \nLOL I hope you do realize it looked like you are talking about the \nFIRST box user. I know you are aware that this tool has been tested \nby Sumption in more detail than any one here will ever comprehend. \n\nAs for Ratka if I even try to explain half the things that man has \ntested just in the past year, my head may pop off and roll around \nfrom sheer lack of technical knowledge to explain in detail. out of \nbreath just typing that LOL.\n\nJust because people dont agree with each other it isnt an attack \nnecessarily. They are grown people and they can state thier opinions. \nSometimes they differ. I have no more control over what they say than \nI do you. You all state your minds pretty freely here and I dont \nalways agree with you all. But usually we agree that we disagree on \nthe subject and move on to the next. \n\nTheres alot more miscommunication and BS going on than gets posted on \nthis forum. And to be honest there just isnt enough time in my day to \nwaste going thru the psychodramas some of yall have got going on out \nthere LOL but dont think that I am not aware of some of it. I am more \naware than ya may think =)\n\nI choose to try and keep a positive focus for myself as well as all \nof you. Even if I dont agree with everything you guys say LOL\n\nIt would be nice if we all agreed all the time and who knows maybe \none day we will.  LOL hey it could happen!!! But until that day we \ncan at least be respectful to each other and work with those who are \nlike minded individuals rather than focusing on the negativity of \nwasting our time on those who aren&#39;t.\n\nMisty"}