{"id": "10295", "subject": "Re: .....then why do I feel guilty?", "author": "purplespacefriend", "timestamp": "2008-04-22T14:11:36Z", "full_text": "well, I&#39;m still here. I try to more patient these days, and instead \nof arguing, I&#39;d rather just go do my own thing, and the ones \nclaiming to be experts can have it. \n\n Even after making the boxes since 2002, I have no idea how or why \nit works, I only know if you do certain things, &quot;they&quot; talk. I don&#39;t \ndo investigations, and still think there is no haunting if no one \nliving is there to see/experience it. Spirit is pretty much \ninfinately more sophistcated than most imagine. As far as I can \ntell, all limitations are on this side of the veil. \n\n I get a little irritated when I make the boxes, yet someone else is \ngoing to tell me how it really works, especially when they \nthemselves have no technical knowledge on any level.\n\n For me, I enjoy the challenge of getting this stuff to work, and \nthe voices are a joy to hear, but almost secondary. I work alone, \nand don&#39;t need the group&#39;s approval, so when someone is claiming to \nbe the atuhority on this stuff, I don&#39;t care, I can just as easily \nquit the group and work by myself, which is pretty much what I \nprefer anyway. \n\n Mass production doesn&#39;t seem to come together, like I think it \nwould if it was supposed to be, so I don&#39;t think that&#39;s a direction \nI want to pursue. I try to just provide the informatiin on what I do \nso others can dupicate it when possible. \n\n Frank-S\n\n\n --- In EVP-ITC@yahoogroups.com, Zack Widup &lt;w9sz@...&gt; wrote:\n&gt;\n&gt; \n&gt; It&#39;s too bad one or two people ruin it for the rest of us.  Only \n20% of \n&gt; the population have antisocial tendencies and only a couple \npercent are \n&gt; truly antisocial.  Sometimes it gets to you, but keep in mind it&#39;s \nonly a \n&gt; couple people. Also keep in mind the old Yank Latin saying, &quot;Non \n&gt; carborundum illegitimatus!&quot;\n&gt; \n&gt; I joined this group ONLY because Frank S. was on it and I hoped to \nkeep up \n&gt; on his research. I don&#39;t know what I&#39;ll do now.\n&gt; \n&gt; Zack\n&gt; \n&gt; On Tue, 22 Apr 2008, Frank Sumption wrote:\n&gt; \n&gt; &gt;\n&gt; &gt; I didn&#39;t read any resulting posts from what I posted earlier, \nand I&#39;m not sure I want to. I&#39;ve been doing this for some years now, \nand it seems like ya can&#39;t go two weeks without someone that thinks \nthey know more, or their &quot;theories&quot; are more valid, or someone that \nbelieves for whatever reason they are the box/EVP/paranormal expert. \nI&#39;ve had enough, these groups are pointless, and I&#39;m tired of the \nBS. There is always these incessant arguements with those that seem \nto think they know better than anyone else. Maybe it&#39;s just me, and \nmy over reactions, but at this point, I don&#39;t care, enough is \nenough. So ya want the group? I don&#39;t actually own it due to one of \nthese idiotic arguements, but have at it, cuz I ain&#39;t playing this \ngame anymore. I&#39;ll continue my own work, in my own time, and in my \nown way.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Frank-S\n&gt;"}