{"id": "1030", "subject": "Re: [EVP-ITC] Re: fried green equipment", "author": "monki rei", "timestamp": "2007-04-04T12:11:25Z", "full_text": "--0-324097503-1175688685=:89080\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nThanks alot for the advice KEN! I am tech impaired so...Ill need to find my way through that....any experience with your own physical system problems around this stuff?\nlight,\nmonki\n\nkenneth b thomas &lt;kennnthomas2000@...&gt; wrote:                                  when you get tired of seeing impossibly pink smoke coming out of \n computer you can go to weirdstuff.com and get $79 dollar dual p3 \n server (you will have to get some USED ecc memoryfrom ebay--dont buy \n the new stuff)  i promise that tyan masterpiece will make your other \n electronics behave, too.  you will be dumdfounded at how FAST 1.2 ghz \n can be.  windows 2000 professional is only operating system that \n works.  you need a free reg cleaner &quot;advanced windows care&quot; (google \n it)\n \n you will have no more burns.\n \n alternatively,\n \n you can get fast , LOW VOLTAGE xeon cpus, dual server board like\n \n tyan i7501, (only use tyan and only server board) and \n UNDERCLOCK!!!!!!!  , yes thats right, for a 3 gig i underclock to 1.6 \n ghz.  hyperthreading must always be disabled ( unless you want to be \n a slave to cooked cpu or unless you have &quot;otto&quot; handy)\n \n my ultra low voltage dual xeon running at 1.6ghz beats the pants of 3 \n gig p4 in every test that matters\n \n --- In EVP-ITC@yahoogroups.com, monki rei &lt;monkiintherabbithole@...&gt; \n wrote:\n &gt;\n &gt; Thanks for the advice Misty! Ive learned my way around computers \n over the years, but this is too weird and it definnitly corresponds \n to how much Im progressing with the contacts I am trying to maintain. \n Asking it to stop seems to invite worse. This interference has (I \n suspect) an intent and Ive found that the best fix is ignoring this \n stuff...in any case..Its good to know Im not the only one whos gone \n through this....so gathering my dignity...anyone here know if theres \n any reason to be concerned about EMF levels? I sure am getting mild \n flu like symptoms fairly regularly...used to be &quot;not so mild&quot;\n &gt; Light,\n &gt; monki\n &gt; \n &gt; Misty Dawn &lt;bulletbabea@...&gt; \n wrote:                                  \n &gt; Not uncommon in this work Monki. If ya lived close enough I could \n fix it for ya but not sure where on the east coast you are residing \n (yes guys I can fix pc&#39;s LOL =P but no that doesnt make me the tech \n type...practice makes perfect). I went thru two computers in a months \n time, fried everything completely right down to the last chip. \n Appliances dont last long at my house (near me) and tv&#39;s, vcr&#39;s, \n backups units...u name it I have fried it. It finally stopped when I \n asked them to stop whatever they were doing that was putting so much \n pressure on my machinery. Now they say Otto is in charge of \n equipment, and havent had much problems on my end. \n &gt;    \n &gt;   Email weirdness is also common I have watched mine and others \n emails disappear, then sometimes show up later with changes made in \n the wording of the message. Retro Dave has bore the brunt of the \n email problems LOL I just had it happen once when I responded to his \n postings of having problems.  My post disappeared then came back \n changed/edited. Thats been a long time ago tho. \n &gt;    \n &gt;   After saying all that you should of course check the basics, make \n sure everything is plugged up properly, see if anything feels \n extremely hot (if it is shut it down immediately to cool) then ya may \n wanna pop the lid off the tower of the pc to check inside and remove \n the sound card, clean the contacts, then replace it to see if that \n helps. UNPLUG IT FROM ELECTRIC FIRST! If that doesnt help then you \n may need to replace the part. Keep an eye on temperatures if \n something is running hot sometimes it will cause the metal to \n swell/bend/melt/move.\n &gt;    \n &gt;   Misty\n &gt; \n &gt; monki rei &lt;monkiintherabbithole@...&gt; wrote:\n &gt;       Hey,\n &gt; I am having an unbelievable time with fried equipment. Now my sound \n is blown! No speakers or headphones work. I heard a pop and then\n (silence is not always golden for us evp types!) I have been through \n alot of hardware this month! Thats not mentioning screwed up \n software, digital recorders and sound files and emails that just seem \n to go missing! I hear from other researchers that this is not \n uncommon.Im losing stuff quickly. Ill be outta business before long! \n Is there a safeguard for this? Anyone had these things happen to them?\n &gt; Ive wondered if emf protection might be in order...I hope I dont \n sound completely madd!(besides, its the Madd Hatter thats got that \n covered. Im actually more like Alice...clueless! So...SOS!\n &gt; in other  words...\n &gt; HELP!\n &gt;     \n &gt; ---------------------------------\n &gt;   Expecting? Get great news right away with email Auto-Check.\n &gt; Try the Yahoo! Mail Beta.  \n &gt; \n &gt; \n &gt; \n &gt; \n &gt;    \n &gt; \n &gt; ---------------------------------\n &gt; It&#39;s here! Your new message!\n &gt; Get  new email alerts with the free Yahoo! Toolbar.\n &gt;      \n &gt;                        \n &gt; \n &gt;  \n &gt; ---------------------------------\n &gt; Never miss an email again!\n &gt; Yahoo! Toolbar alerts you the instant new Mail arrives. Check it \n out.\n &gt;\n \n \n     \n                       \n\n \n---------------------------------\nDon&#39;t pick lemons.\nSee all the new 2007 cars at Yahoo! Autos.\r\n--0-324097503-1175688685=:89080\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nThanks alot for the advice KEN! I am tech impaired so...Ill need to find my way through that....any experience with your own physical system problems around this stuff?&lt;br&gt;light,&lt;br&gt;monki&lt;br&gt;&lt;br&gt;&lt;b&gt;&lt;i&gt;kenneth b thomas &lt;kennnthomas2000@...&gt;&lt;/i&gt;&lt;/b&gt; wrote:&lt;blockquote class=&quot;replbq&quot; style=&quot;border-left: 2px solid rgb(16, 16, 255); margin-left: 5px; padding-left: 5px;&quot;&gt;     &lt;!-- Network content --&gt;           &lt;div id=&quot;ygrp-text&quot;&gt;             &lt;div&gt;when you get tired of seeing impossibly pink smoke coming out of &lt;br&gt; computer you can go to weirdstuff.com and get $79 dollar dual p3 &lt;br&gt; server (you will have to get some USED ecc memoryfrom ebay--dont buy &lt;br&gt; the new stuff)  i promise that tyan masterpiece will make your other &lt;br&gt; electronics\n behave, too.  you will be dumdfounded at how FAST 1.2 ghz &lt;br&gt; can be.  windows 2000 professional is only operating system that &lt;br&gt; works.  you need a free reg cleaner &quot;advanced windows care&quot; (google &lt;br&gt; it)&lt;br&gt; &lt;br&gt; you will have no more burns.&lt;br&gt; &lt;br&gt; alternatively,&lt;br&gt; &lt;br&gt; you can get fast , LOW VOLTAGE xeon cpus, dual server board like&lt;br&gt; &lt;br&gt; tyan i7501, (only use tyan and only server board) and &lt;br&gt; UNDERCLOCK!!&lt;wbr&gt;!!!!!  , yes thats right, for a 3 gig i underclock to 1.6 &lt;br&gt; ghz.  hyperthreading must always be disabled ( unless you want to be &lt;br&gt; a slave to cooked cpu or unless you have &quot;otto&quot; handy)&lt;br&gt; &lt;br&gt; my ultra low voltage dual xeon running at 1.6ghz beats the pants of 3 &lt;br&gt; gig p4 in every test that matters&lt;br&gt; &lt;br&gt; --- In &lt;a href=&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;wbr&gt;.com&lt;/a&gt;, monki rei &lt;monkiintherabbitho&lt;wbr&gt;le@...&gt; &lt;br&gt; wrote:&lt;br&gt; &gt;&lt;br&gt; &gt; Thanks for the advice Misty! Ive learned my way around computers &lt;br&gt; over\n the years, but this is too weird and it definnitly corresponds &lt;br&gt; to how much Im progressing with the contacts I am trying to maintain. &lt;br&gt; Asking it to stop seems to invite worse. This interference has (I &lt;br&gt; suspect) an intent and Ive found that the best fix is ignoring this &lt;br&gt; stuff...in any case..Its good to know Im not the only one whos gone &lt;br&gt; through this....so gathering my dignity...anyone here know if theres &lt;br&gt; any reason to be concerned about EMF levels? I sure am getting mild &lt;br&gt; flu like symptoms fairly regularly...&lt;wbr&gt;used to be &quot;not so mild&quot;&lt;br&gt; &gt; Light,&lt;br&gt; &gt; monki&lt;br&gt; &gt; &lt;br&gt; &gt; Misty Dawn &lt;bulletbabea@&lt;wbr&gt;...&gt; &lt;br&gt; wrote:                                  &lt;br&gt; &gt; Not uncommon in this work Monki. If ya lived close enough I could &lt;br&gt; fix it for ya but not sure where on the east coast you are residing &lt;br&gt; (yes guys I can fix pc&#39;s LOL =P but no that doesnt make me the tech &lt;br&gt; type...practice makes perfect). I went thru two\n computers in a months &lt;br&gt; time, fried everything completely right down to the last chip. &lt;br&gt; Appliances dont last long at my house (near me) and tv&#39;s, vcr&#39;s, &lt;br&gt; backups units...u name it I have fried it. It finally stopped when I &lt;br&gt; asked them to stop whatever they were doing that was putting so much &lt;br&gt; pressure on my machinery. Now they say Otto is in charge of &lt;br&gt; equipment, and havent had much problems on my end. &lt;br&gt; &gt;    &lt;br&gt; &gt;   Email weirdness is also common I have watched mine and others &lt;br&gt; emails disappear, then sometimes show up later with changes made in &lt;br&gt; the wording of the message. Retro Dave has bore the brunt of the &lt;br&gt; email problems LOL I just had it happen once when I responded to his &lt;br&gt; postings of having problems.  My post disappeared then came back &lt;br&gt; changed/edited. Thats been a long time ago tho. &lt;br&gt; &gt;    &lt;br&gt; &gt;   After saying all that you should of course check the basics, make &lt;br&gt; sure everything is plugged up\n properly, see if anything feels &lt;br&gt; extremely hot (if it is shut it down immediately to cool) then ya may &lt;br&gt; wanna pop the lid off the tower of the pc to check inside and remove &lt;br&gt; the sound card, clean the contacts, then replace it to see if that &lt;br&gt; helps. UNPLUG IT FROM ELECTRIC FIRST! If that doesnt help then you &lt;br&gt; may need to replace the part. Keep an eye on temperatures if &lt;br&gt; something is running hot sometimes it will cause the metal to &lt;br&gt; swell/bend/melt/&lt;wbr&gt;move.&lt;br&gt; &gt;    &lt;br&gt; &gt;   Misty&lt;br&gt; &gt; &lt;br&gt; &gt; monki rei &lt;monkiintherabbitho&lt;wbr&gt;le@...&gt; wrote:&lt;br&gt; &gt;       Hey,&lt;br&gt; &gt; I am having an unbelievable time with fried equipment. Now my sound &lt;br&gt; is blown! No speakers or headphones work. I heard a pop and then&lt;br&gt; (silence is not always golden for us evp types!) I have been through &lt;br&gt; alot of hardware this month! Thats not mentioning screwed up &lt;br&gt; software, digital recorders and sound files and emails that just seem &lt;br&gt; to go\n missing! I hear from other researchers that this is not &lt;br&gt; uncommon.Im losing stuff quickly. Ill be outta business before long! &lt;br&gt; Is there a safeguard for this? Anyone had these things happen to them?&lt;br&gt; &gt; Ive wondered if emf protection might be in order...I hope I dont &lt;br&gt; sound completely madd!(besides, its the Madd Hatter thats got that &lt;br&gt; covered. Im actually more like Alice...clueless! So...SOS!&lt;br&gt; &gt; in other  words...&lt;br&gt; &gt; HELP!&lt;br&gt; &gt;     &lt;br&gt; &gt; ------------&lt;wbr&gt;---------&lt;wbr&gt;---------&lt;wbr&gt;---&lt;br&gt; &gt;   Expecting? Get great news right away with email Auto-Check.&lt;br&gt; &gt; Try the Yahoo! Mail Beta.  &lt;br&gt; &gt; &lt;br&gt; &gt; &lt;br&gt; &gt; &lt;br&gt; &gt; &lt;br&gt; &gt;    &lt;br&gt; &gt; &lt;br&gt; &gt; ------------&lt;wbr&gt;---------&lt;wbr&gt;---------&lt;wbr&gt;---&lt;br&gt; &gt; It&#39;s here! Your new message!&lt;br&gt; &gt; Get  new email alerts with the free Yahoo! Toolbar.&lt;br&gt; &gt;      &lt;br&gt; &gt;                        &lt;br&gt; &gt; &lt;br&gt; &gt;  &lt;br&gt; &gt;\n ------------&lt;wbr&gt;---------&lt;wbr&gt;---------&lt;wbr&gt;---&lt;br&gt; &gt; Never miss an email again!&lt;br&gt; &gt; Yahoo! Toolbar alerts you the instant new Mail arrives. Check it &lt;br&gt; out.&lt;br&gt; &gt;&lt;br&gt; &lt;br&gt; &lt;/div&gt;     &lt;/div&gt;          &lt;!--End group email --&gt;  &lt;/blockquote&gt;&lt;br&gt;&lt;p&gt;&#32;\n\n&lt;hr size=1&gt;Don&#39;t pick lemons.&lt;br&gt;\nSee all the &lt;a href=&quot;http://autos.yahoo.com/new_cars.html;_ylc=X3oDMTE0OGRsc3F2BF9TAzk3MTA3MDc2BHNlYwNtYWlsdGFncwRzbGsDbmV3Y2Fycw--&quot;&gt;new 2007 cars&lt;/a&gt; at &lt;a href=&quot;http://autos.yahoo.com/new_cars.html;_ylc=X3oDMTE0OGRsc3F2BF9TAzk3MTA3MDc2BHNlYwNtYWlsdGFncwRzbGsDbmV3Y2Fycw--&quot;&gt;Yahoo! Autos.&lt;/a&gt;\r\n--0-324097503-1175688685=:89080--"}