{"id": "1031", "subject": "Re: fried green equipment", "author": "kenneth b thomas", "timestamp": "2007-04-04T12:23:52Z", "full_text": "there is nothing i cant fix-and ill cover all bets.\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, monki rei &lt;monkiintherabbithole@...&gt; \nwrote:\n&gt;\n&gt; Thanks alot for the advice KEN! I am tech impaired so...Ill need to \nfind my way through that....any experience with your own physical \nsystem problems around this stuff?\n&gt; light,\n&gt; monki\n&gt; \n&gt; kenneth b thomas &lt;kennnthomas2000@...&gt; \nwrote:                                  when you get tired of seeing \nimpossibly pink smoke coming out of \n&gt;  computer you can go to weirdstuff.com and get $79 dollar dual p3 \n&gt;  server (you will have to get some USED ecc memoryfrom ebay--dont \nbuy \n&gt;  the new stuff)  i promise that tyan masterpiece will make your \nother \n&gt;  electronics behave, too.  you will be dumdfounded at how FAST 1.2 \nghz \n&gt;  can be.  windows 2000 professional is only operating system that \n&gt;  works.  you need a free reg cleaner &quot;advanced windows care&quot; \n(google \n&gt;  it)\n&gt;  \n&gt;  you will have no more burns.\n&gt;  \n&gt;  alternatively,\n&gt;  \n&gt;  you can get fast , LOW VOLTAGE xeon cpus, dual server board like\n&gt;  \n&gt;  tyan i7501, (only use tyan and only server board) and \n&gt;  UNDERCLOCK!!!!!!!  , yes thats right, for a 3 gig i underclock to \n1.6 \n&gt;  ghz.  hyperthreading must always be disabled ( unless you want to \nbe \n&gt;  a slave to cooked cpu or unless you have &quot;otto&quot; handy)\n&gt;  \n&gt;  my ultra low voltage dual xeon running at 1.6ghz beats the pants \nof 3 \n&gt;  gig p4 in every test that matters\n&gt;  \n&gt;  --- In EVP-ITC@yahoogroups.com, monki rei &lt;monkiintherabbithole@&gt; \n&gt;  wrote:\n&gt;  &gt;\n&gt;  &gt; Thanks for the advice Misty! Ive learned my way around computers \n&gt;  over the years, but this is too weird and it definnitly \ncorresponds \n&gt;  to how much Im progressing with the contacts I am trying to \nmaintain. \n&gt;  Asking it to stop seems to invite worse. This interference has (I \n&gt;  suspect) an intent and Ive found that the best fix is ignoring \nthis \n&gt;  stuff...in any case..Its good to know Im not the only one whos \ngone \n&gt;  through this....so gathering my dignity...anyone here know if \ntheres \n&gt;  any reason to be concerned about EMF levels? I sure am getting \nmild \n&gt;  flu like symptoms fairly regularly...used to be &quot;not so mild&quot;\n&gt;  &gt; Light,\n&gt;  &gt; monki\n&gt;  &gt; \n&gt;  &gt; Misty Dawn &lt;bulletbabea@&gt; \n&gt;  wrote:                                  \n&gt;  &gt; Not uncommon in this work Monki. If ya lived close enough I \ncould \n&gt;  fix it for ya but not sure where on the east coast you are \nresiding \n&gt;  (yes guys I can fix pc&#39;s LOL =P but no that doesnt make me the \ntech \n&gt;  type...practice makes perfect). I went thru two computers in a \nmonths \n&gt;  time, fried everything completely right down to the last chip. \n&gt;  Appliances dont last long at my house (near me) and tv&#39;s, vcr&#39;s, \n&gt;  backups units...u name it I have fried it. It finally stopped when \nI \n&gt;  asked them to stop whatever they were doing that was putting so \nmuch \n&gt;  pressure on my machinery. Now they say Otto is in charge of \n&gt;  equipment, and havent had much problems on my end. \n&gt;  &gt;    \n&gt;  &gt;   Email weirdness is also common I have watched mine and others \n&gt;  emails disappear, then sometimes show up later with changes made \nin \n&gt;  the wording of the message. Retro Dave has bore the brunt of the \n&gt;  email problems LOL I just had it happen once when I responded to \nhis \n&gt;  postings of having problems.  My post disappeared then came back \n&gt;  changed/edited. Thats been a long time ago tho. \n&gt;  &gt;    \n&gt;  &gt;   After saying all that you should of course check the basics, \nmake \n&gt;  sure everything is plugged up properly, see if anything feels \n&gt;  extremely hot (if it is shut it down immediately to cool) then ya \nmay \n&gt;  wanna pop the lid off the tower of the pc to check inside and \nremove \n&gt;  the sound card, clean the contacts, then replace it to see if that \n&gt;  helps. UNPLUG IT FROM ELECTRIC FIRST! If that doesnt help then you \n&gt;  may need to replace the part. Keep an eye on temperatures if \n&gt;  something is running hot sometimes it will cause the metal to \n&gt;  swell/bend/melt/move.\n&gt;  &gt;    \n&gt;  &gt;   Misty\n&gt;  &gt; \n&gt;  &gt; monki rei &lt;monkiintherabbithole@&gt; wrote:\n&gt;  &gt;       Hey,\n&gt;  &gt; I am having an unbelievable time with fried equipment. Now my \nsound \n&gt;  is blown! No speakers or headphones work. I heard a pop and then\n&gt;  (silence is not always golden for us evp types!) I have been \nthrough \n&gt;  alot of hardware this month! Thats not mentioning screwed up \n&gt;  software, digital recorders and sound files and emails that just \nseem \n&gt;  to go missing! I hear from other researchers that this is not \n&gt;  uncommon.Im losing stuff quickly. Ill be outta business before \nlong! \n&gt;  Is there a safeguard for this? Anyone had these things happen to \nthem?\n&gt;  &gt; Ive wondered if emf protection might be in order...I hope I dont \n&gt;  sound completely madd!(besides, its the Madd Hatter thats got that \n&gt;  covered. Im actually more like Alice...clueless! So...SOS!\n&gt;  &gt; in other  words...\n&gt;  &gt; HELP!\n&gt;  &gt;     \n&gt;  &gt; ---------------------------------\n&gt;  &gt;   Expecting? Get great news right away with email Auto-Check.\n&gt;  &gt; Try the Yahoo! Mail Beta.  \n&gt;  &gt; \n&gt;  &gt; \n&gt;  &gt; \n&gt;  &gt; \n&gt;  &gt;    \n&gt;  &gt; \n&gt;  &gt; ---------------------------------\n&gt;  &gt; It&#39;s here! Your new message!\n&gt;  &gt; Get  new email alerts with the free Yahoo! Toolbar.\n&gt;  &gt;      \n&gt;  &gt;                        \n&gt;  &gt; \n&gt;  &gt;  \n&gt;  &gt; ---------------------------------\n&gt;  &gt; Never miss an email again!\n&gt;  &gt; Yahoo! Toolbar alerts you the instant new Mail arrives. Check it \n&gt;  out.\n&gt;  &gt;\n&gt;  \n&gt;  \n&gt;      \n&gt;                        \n&gt; \n&gt;  \n&gt; ---------------------------------\n&gt; Don&#39;t pick lemons.\n&gt; See all the new 2007 cars at Yahoo! Autos.\n&gt;"}