{"id": "10328", "subject": "Re: It can get pretty strange.", "author": "purplespacefriend", "timestamp": "2008-04-22T21:55:37Z", "full_text": "Huh!? I can only say, I don&#39;t have to do this group thing either, I \nstay cuz a few request it. The guys actually talk more if I don&#39;t \nshare. \n\n I can understand where Bruce was coming fom, to a point, but when \nyou start making threatening private e-mails to make sure everyone \nagrees with you, that&#39;s just demented and wrong. This shit ain&#39;t \nthat important!\n\n FS\n\n\n--- In EVP-ITC@yahoogroups.com, psfponies &lt;psfponies@...&gt; wrote:\n&gt;\n&gt; Interesting message Frank considering the events that have \nunfolded over the last couple of days. Kind of like shooting oneself \nin the foot!\n&gt;    \n&gt;   Kay\n&gt;   \n&gt; \n&gt; Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt;       .hmmessage P  {  margin:0px;  padding:0px  }  \nbody.hmmessage  {  FONT-SIZE: 10pt;  FONT-FAMILY:Tahoma  }    &quot;The \nfour archangels represent different fields of modern science. \nGabriel is the patron of computers and the Internet.&quot; From \nwww.pyracantha.com/religious.html\n&gt;  \n&gt;  Also &quot; \n&gt; The Archangel Gabriel  Archangel of the West and of Water, Gabriel \nis the Messenger of God. And is well known for his announcement of \nthe birth of Jesus.\n&gt; He is connected with our emotions, cleansing, loving and intuitive \nself. And can aid you with your spiritual insight, growth and \ntravels on the astral planes.\n&gt; Also connected with the Moon, and the sea and all life that is \nwithin.If you are working with dolphins, he is your contact.\n&gt; Present at our births he occasionally turns up at our final \ntransition to ease us through. &quot;\n&gt;  \n&gt;  From sanctuary-of-enlightenment.8m.com/photo4.html\n&gt; \n&gt; \n&gt;  \n&gt;  A weird Gabriel reference, and a Bruce comment. From a recording \ndone Sunday night. \n&gt;  \n&gt;  Frank-S\n&gt; \n&gt;   \n&gt; ---------------------------------\n&gt;   Make i&#39;m yours. Create a custom banner to support your cause.  \n&gt; \n&gt;        \n&gt; ---------------------------------\n&gt; Be a better friend, newshound, and know-it-all with Yahoo! \nMobile.  Try it now.\n&gt;"}