{"id": "10336", "subject": "Re: [EVP-ITC] Re: It can get pretty strange.", "author": "Zack Widup", "timestamp": "2008-04-22T22:47:03Z", "full_text": "There must be some awful perturbations in the Force these days.  We get \nthree earthquakes in as many days here, then a LOT of the Yahoogroups I&#39;m \non break out in discontent and arguing, fighting.  Even ones that bear no \nrelation to others at all. Be very aware of that.  IT ISN&#39;T JUST HAPPENING \nHERE.  What&#39;s going on in the world?  Is something really bad about to \nhappen? I&#39;m a little bit scared.\n\nZack\n\nOn Tue, 22 Apr 2008, Marlboro63@... wrote:\n\n&gt; Hi Frank,\n&gt;\n&gt; I know this is all stupid and some of us have really had enough of  it.\n&gt; Especially being called childish names and being swore at and  threatened.  But it\n&gt; hasn&#39;t stopped in private emails?\n&gt;\n&gt; This is such the case.  And now it has come down to physical threats  because\n&gt; well maybe that&#39;s all these neanderthals know or can understand.   ANd yes it\n&gt; has been reported to the proper authorities but what do you recommend  be\n&gt; done about iy.\n&gt;\n&gt; Your opinion would be greatly appreiated.\n&gt;\n&gt; Jeff\n&gt;\n&gt;\n&gt; In a message dated 4/22/2008 4:56:05 P.M. Central Daylight Time,\n&gt; purplealiengirl@... writes:\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Huh!? I can only say, I don&#39;t have to do this group thing either, I\n&gt; stay cuz a few request it. The guys actually talk more if I don&#39;t\n&gt; share.\n&gt;\n&gt; I can understand where Bruce was coming fom, to a point,  but when\n&gt; you start making threatening private e-mails to make sure  everyone\n&gt; agrees with you, that&#39;s just demented and wrong. This shit ain&#39;t\n&gt; that important!\n&gt;\n&gt; FS\n&gt;\n&gt; --- In _EVP-ITC@yahoogroupsEVP-_ (mailto:EVP-ITC@yahoogroups.com) ,\n&gt; psfponies &lt;psfponies@.ps&gt; wrote:\n&gt;&gt;\n&gt;&gt; Interesting  message Frank considering the events that have\n&gt; unfolded over the last  couple of days. Kind of like shooting oneself\n&gt; in the foot!\n&gt;&gt;\n&gt;&gt; Kay\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; Frank Sumption  &lt;purplealiengirl@pur&gt; wrote:\n&gt;&gt; .hmmessage P { margin:0px;  padding:0px }\n&gt; body.hmmessage { FONT-SIZE: 10pt; FONT-FAMILY:body.hmmessage { F\n&gt; four archangels represent different fields of modern science.\n&gt; Gabriel is the patron of computers and the Internet.&quot; From\n&gt; www.pyracantha.www.pyracanthawww.\n&gt;&gt;\n&gt;&gt; Also &quot;\n&gt;&gt; The Archangel Gabriel Archangel of the West and of Water, Gabriel\n&gt; is the Messenger of God. And is well known for his announcement of\n&gt; the  birth of Jesus.\n&gt;&gt; He is connected with our emotions, cleansing, loving  and intuitive\n&gt; self. And can aid you with your spiritual insight, growth  and\n&gt; travels on the astral planes.\n&gt;&gt; Also connected with the Moon,  and the sea and all life that is\n&gt; within.If you are working with dolphins,  he is your contact.\n&gt;&gt; Present at our births he occasionally turns up at  our final\n&gt; transition to ease us through. &quot;\n&gt;&gt;\n&gt;&gt; From  sanctuary-of- From  sanc From  sanc Fro\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; A weird Gabriel reference, and a Bruce comment. From a  recording\n&gt; done Sunday night.\n&gt;&gt;\n&gt;&gt; Frank-S\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; ------------ -------- -------- --\n&gt;&gt; Make i&#39;m  yours. Create a custom banner to support your cause.\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; ------------ -------- -------- --\n&gt;&gt; Be a better  friend, newshound, and know-it-all with Yahoo!\n&gt; Mobile. Try it  now.\n&gt;&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; **************Need a new ride? Check out the largest site for U.S. used car\n&gt; listings at AOL Autos.\n&gt; (http://autos.aol.com/used?NCID=aolcmp00300000002851)\n&gt;"}