{"id": "10365", "subject": "Re: FILE SIZE. MISTY", "author": "LC Duplatt", "timestamp": "2008-04-23T11:00:12Z", "full_text": "Hi, Misty.\n\nThanks for considering the ideas.  I try not to upload a whole lot, \nunless it is interesting.  It&#39;s not that I do not have recordings, \nit&#39;s just how many of these can a person store here, etc.  I would \nprefer just to maintain a small amount of them that are small file \nsize as examples of what I am doing. Just let me know of any changes \nI should make...glad to do it.  \n\nI understand moderating is a thankless job. So, thank you for doing \nit.  Not sure how anyone does it, to be honest.  It probably feels \nlike being Barney Fife in a Mike Tyson-Evander Holyfield brawl on \nsome of these message boards.  LOL ;)\n\nLC\n\n--- In EVP-ITC@yahoogroups.com, &quot;Misty&quot; &lt;bulletbabea@...&gt; wrote:\n&gt;\n&gt; Hiya LC\n&gt; \n&gt; Yeah sorry about that I was pretty tired after dealin with work and \n&gt; junk. That&#39;s definitely an idea to consider. Frank S. mentioned \n&gt; perhaps we can all just delete stuff after a set amount of time to \n&gt; keep it continuously clear like post stuff for couple weeks then it \n&gt; gets moved over to another server like esnips or elsewhere. All \ngood \n&gt; ideas. \n&gt; \n&gt; I already started my transition and have moved many things over as \n&gt; well as deleted. I am considering making a group account that only \n&gt; group members can upload to (esnips allows that type of file \nsharing \n&gt; between friends) I just havent had the time or focus to put into \n&gt; setting it up (thats alot of emails to type in to add as friends \n&gt; LOL). Plus they are in middle of massive changes/updates so waiting \n&gt; for the dust to settle. I also considered getting a private server \n&gt; sharing system set up so people could upload thier stuff but seems \n&gt; complicated for most who arent used to using ftp.\n&gt; \n&gt; Keep sharing ideas tho because eventually maybe we will make it \n&gt; better for everyone.\n&gt; \n&gt; I rather not set limits on sizes but when ya hit 96% full \nsomethings \n&gt; gotta go LOL so we start small and work our way to the resolution. \nI \n&gt; still attach most stuff to my posts for those that get individual \n&gt; emails it comes as a simple file attachment in email. So do many \n&gt; others here. That also helps.\n&gt; \n&gt; Misty\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;LC Duplatt&quot; &lt;lcdupla@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Misty,\n&gt; &gt; \n&gt; &gt; Can we just go to a file size limit?  Anything over 50 or 100kb \nhas \n&gt; &gt; to be linked to?  This way we will cut down on the file strain \n&gt; &gt; without having to convert to mp3.  Many of the mp3 files are \n&gt; massive \n&gt; &gt; here.  My wav files are smaller...plus the mp3s don&#39;t open up \n&gt; &gt; correctly for some of us.\n&gt; &gt; \n&gt; &gt; I requested this yesterday, but it surely got lost in the \n&gt; fireworks.  \n&gt; &gt; I have deleted some of my files, as well.  \n&gt; &gt; \n&gt; &gt; LC\n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@...m, &quot;lisbyfarrum&quot; &lt;lisby@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; Deleting my files took it down about 3 percent, I noticed.\n&gt; &gt; &gt; \n&gt; &gt; &gt; Yes, I have been sick and I&#39;m plain worn down to a nub with all \n&gt; this\n&gt; &gt; &gt; fighting.\n&gt; &gt; &gt; \n&gt; &gt; &gt; I do appreciate you asking after me, Misty. \n&gt; &gt; &gt; \n&gt; &gt; &gt; I&#39;ll be around.\n&gt; &gt; &gt; \n&gt; &gt; &gt; Ann\n&gt; &gt; &gt; \n&gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;Misty&quot; &lt;bulletbabea@&gt; wrote:\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Thanks Ann. I think going to more compacted files will help \nus \n&gt; &gt; all in \n&gt; &gt; &gt; &gt; the long run. We are already back to 72% rather than 96% tho \n&gt; most \n&gt; &gt; of \n&gt; &gt; &gt; &gt; the file space was being used by someone else besides you =)\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; I know it gets to be a bit testy around here and the other \n&gt; &gt; forums. I \n&gt; &gt; &gt; &gt; also know that some of the nastiness can tear apart good \n&gt; working \n&gt; &gt; &gt; &gt; relationships as well as friendships. I was just askin Frank \nif \n&gt; &gt; he \n&gt; &gt; &gt; &gt; knew if you were still sick or not because you had been very \n&gt; &gt; quiet \n&gt; &gt; &gt; &gt; lately.\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; I agree sometimes its good to take a step back rather than \nget \n&gt; &gt; &gt; &gt; yourself caught up in the drama fests going on around us all. \n&gt; &gt; Thats \n&gt; &gt; &gt; &gt; on and off the board as well. \n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; As I said I know some of what goes on off of this forum, and \nI \n&gt; am \n&gt; &gt; sad \n&gt; &gt; &gt; &gt; to see most of it happening. I just hope everyone can regain \n&gt; &gt; focus \n&gt; &gt; &gt; &gt; and like you said, remember why we are here.\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; I hope you feel better soon, and rejoin us when the stress \n&gt; level \n&gt; &gt; is \n&gt; &gt; &gt; &gt; passed. And I hope it passes soon so ya can run some test \n&gt; &gt; sessions \n&gt; &gt; &gt; &gt; with the new tool that arrived!\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; I keep telling people that all the negativity does take a \ntoll, \n&gt; &gt; on us \n&gt; &gt; &gt; &gt; personally and our working together. \n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; Misty\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com, Lisby &lt;lisby@&gt; wrote:\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; Get a grip--all of you.\n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; I&#39;m out of here until all this petty BS and hatred sorts \nout. \n&gt; &gt; The  \n&gt; &gt; &gt; &gt; &gt; amount of stress that I&#39;ve been through with all this \n&gt; fighting \n&gt; &gt; &gt; &gt; since  \n&gt; &gt; &gt; &gt; &gt; early this year has really taken a toll on me as a person \nand \n&gt; &gt; a  \n&gt; &gt; &gt; &gt; &gt; researcher. I&#39;m going off line for awhile. If anyone wants \nto \n&gt; &gt; talk \n&gt; &gt; &gt; &gt; to  \n&gt; &gt; &gt; &gt; &gt; me, send me a private e-mail because I&#39;m going to read \n&gt; only/no \n&gt; &gt; e-\n&gt; &gt; &gt; &gt; mail  \n&gt; &gt; &gt; &gt; &gt; until I remember again why I used to wake up every day and \n&gt; want \n&gt; &gt; to  \n&gt; &gt; &gt; &gt; &gt; run to my computer to see what would be posted.\n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; Misty--as per your request, I&#39;ve deleted my files.\n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; Ann\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}