{"id": "10363", "subject": "Re: [EVP-ITC] Re: Is this an EVP? (help-me.mp3 in RobE folder)", "author": "Zack Widup", "timestamp": "2008-04-23T06:26:14Z", "full_text": "There&#39;s a lot we don&#39;t know.  I get the idea sometimes from some EVP&#39;s \nI&#39;ve heard that the -whatever- which is producing them is using coherence \nin the noises and sounds already present to produce the EVP.  Possibly the \nsound of a brushing jacket can be manipulated electronically by the \n-whatever- to produce the EVP. If you are NOT able to recreate the sound \nby making the same noises, as in your mailbox example, then you might have \nsomething.\n\nThere are an awful lot of weird happenings and mysteries out there ... \nmaybe that&#39;s what draws some of us to this stuff ...\n\nZack\n\nOn Wed, 23 Apr 2008, itcdeadpeople wrote:\n\n&gt; Hi Rob.  What I&#39;ve noticed in some of my recordings is that sometimes mundane things,\n&gt; such as recorder movement, or brushing against a jacket, can sound like EVP.  Sometimes\n&gt; it is, and sometimes it isn&#39;t.  I do hear what sounds like the words &quot;help me&quot; in your clip,\n&gt; but given the circumstances, it&#39;s really hard to say for sure.  It sounds very similar to\n&gt; brushing against the fabric windbreakers are made from.\n&gt;\n&gt; Ordinarily I would say try to recreate it but that&#39;s pretty hard given you were on a plane.\n&gt; For example, one time I got what I thought was an EVP while opening my mailbox.  But\n&gt; then I thought, nope, it&#39;s just the mailbox sound.  In that case, I was able to go back out,\n&gt; open/close the door repeatedly in order to compare, and as it turned out, I think I really\n&gt; did have an EVP because all the tests sounded only like a mailbox, if that makes sense.\n&gt;\n&gt; As for someone in spirit being on a plane ... well ... my thought is this:  They go where we\n&gt; go.  If you are on a plane, and someone connected with you for whatever reason saw an\n&gt; opportunity to make contact, then they might take advantage of that opportunity, just\n&gt; because they could.\n&gt;\n&gt; I&#39;m not sure what could have been meant by the words &quot;help me&quot; because there is nothing\n&gt; to put them into context.  It seems like sometimes those in spirit we hear via EVP are\n&gt; talking directly to us, and sometimes they are talking to each other and we are in essence\n&gt; eavesdropping on them.\n&gt;\n&gt; In a airport, I imagine it would also be more possible than normal to pick up on RF.\n&gt; Though I admit, that doesn&#39;t have the sound of stray signal to me, but it&#39;s important to\n&gt; keep in mind that our recorders can and do pickup misc signals from the air.  This is one\n&gt; reason why I personally think that context, and apparent meaningful responses are\n&gt; important in ruling out what is referred to as &#39;false positives&#39; (mistaking something\n&gt; mundane for something paranormal).\n&gt;\n&gt; So, I guess given all my above ramblings, you might put this in the &quot;maybe&quot; file.  And\n&gt; move on to doing other sessions where you can determine, more definitively, if the results\n&gt; based on circumstances are strongly suggestive of the content being &#39;real&#39; EVP.\n&gt;\n&gt; Just my fifty cents on the subject.  ;-)\n&gt;\n&gt; Welcome to the wonderfully mysterious, sometimes whacky, but never boring world of\n&gt; EVP.\n&gt;\n&gt; Margaret\n&gt;"}