{"id": "10370", "subject": "Off the Subject - But Pretty Interesting", "author": "Jules", "timestamp": "2008-04-23T13:04:07Z", "full_text": "--4-9109642052-6072525853=:8\r\nContent-Type: text/plain; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n\nI subscribe to About.com and received this article.  I just thought I\nwoul=\r\nd share.  I am not into the photo end of the paranormal, but it is\nvery int=\r\neresting if in fact this has not been manufactured in anyway.\n  [Caf=E9 Pha=\r\nntom]  from Jodie McNamara Caf=E9 Phantom These are four\npictures I took in=\r\n quick succession at a caf=E9 near my house. I&#39;m a\nphotographer and was tak=\r\ning pictures for artistic purposes when I\ncaptured these. I remember taking=\r\n these photos, but do not remember\nanyone or anything walking or otherwise =\r\npassing past the lens. I was\nleft with the impression, in fact, that they w=\r\nould be unimpressive and\nthat they&#39;d be deleted (though I waited, as usual,=\r\n until later to assess\nmy work).\nThey were taken without a flash with a Can=\r\non Rebel XTi (fps 5), a\nshutter speed of =BC of a second, and without a tri=\r\npod (though I was\nsitting still in a chair). After consulting a couple of o=\r\nther\nphotographers about the photo, I have yet to come up with an\nexplanati=\r\non. It was noted that the motion blur on the figure suggests\nmovement to th=\r\ne right though the figure went left. There also appear to\nbe features sugge=\r\nsting a face in the third frame, though there are\nclearly no such markings =\r\nin the first or second. It&#39;s also noteworthy\nthat everything else in the ph=\r\noto (including the two girls behind the\nfigure, one of whom was talking and=\r\n =96 between the second and third\npictures =96 had moved her hand) is in pe=\r\nrfect focus.\n\nTaking all this into consideration, we concluded that the fig=\r\nure,\nwhatever it is, seems to be twisting =96 fast and continuously - in a\n=\r\ncounter-clockwise direction and that it covered about 8 or 9 feet of\nspace =\r\ndoing this in 1.8 seconds (given the shutter speed and fps speed\nof the cam=\r\nera). This without I, nor the two girls at the table, nor my\nfriend (whose =\r\nelbow is in the bottom left hand corner) noticing.\n\nI have all four of the =\r\noriginals. They were taken in RAW format on a\ndigital SLR and thus have sav=\r\ned the most information possible to have a\nrecord of for each of these four=\r\n photographs (including the color\ninformation).\n\nPlease let me know what yo=\r\nu think. It looks like a ghost, smells like a\nghost=85does it sound like a =\r\nghost to you?\n\n\r\n--4-9109642052-6072525853=:8\r\nContent-Type: text/html; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;P&gt;I subscribe to About.com and received this article.&nbsp; I just thought=\r\n I would share.&nbsp; I am not into the photo end of the paranormal, but it=\r\n is very interesting if in fact this has not been manufactured in anyway.&n=\r\nbsp; &lt;/P&gt;\n&lt;DIV id=3D&quot;igImg&quot;&gt;&lt;IMG alt=3D&quot;Caf=E9 Phantom&quot; src=3D&quot;http://z.abo=\r\nut.com/d/paranormal/1/0/c/b/1/cafe-phantom-anim.gif&quot;&gt;&lt;/DIV&gt;\n&lt;DIV id=3D&quot;igOw=\r\nn&quot;&gt;from Jodie McNamara&lt;/DIV&gt;\n&lt;DIV id=3D&quot;igCap&quot;&gt;Caf=E9 Phantom&lt;/DIV&gt;\n&lt;DIV id=\r\n=3D&quot;igDpn&quot;&gt;These are four pictures I took in quick succession at a caf=E9 n=\r\near my house. I&#39;m a photographer and was taking pictures for artistic purpo=\r\nses when I captured these. I remember taking these photos, but do not remem=\r\nber anyone or anything walking or otherwise passing past the lens. I was le=\r\nft with the impression, in fact, that they would be unimpressive and that t=\r\nhey&#39;d be deleted (though I waited, as usual, until later to assess my work)=\r\n. \n&lt;P&gt;They were taken without a flash with a Canon Rebel XTi (fps 5), a shu=\r\ntter speed of =BC of a second, and without a tripod (though I was sitting s=\r\ntill in a chair). After consulting a couple of other photographers about th=\r\ne photo, I have yet to come up with an explanation. It was noted that the m=\r\notion blur on the figure suggests movement to the right though the figure w=\r\nent left. There also appear to be features suggesting a face in the third f=\r\nrame, though there are clearly no such markings in the first or second. It&#39;=\r\ns also noteworthy that everything else in the photo (including the two girl=\r\ns behind the figure, one of whom was talking and =96 between the second and=\r\n third pictures =96 had moved her hand) is in perfect focus.&lt;/P&gt;\n&lt;P&gt;Taking =\r\nall this into consideration, we concluded that the figure, whatever it is, =\r\nseems to be twisting =96 fast and continuously - in a counter-clockwise dir=\r\nection and that it covered about 8 or 9 feet of space doing this in 1.8 sec=\r\nonds (given the shutter speed and fps speed of the camera). This without I,=\r\n nor the two girls at the table, nor my friend (whose elbow is in the botto=\r\nm left hand corner) noticing.&lt;/P&gt;\n&lt;P&gt;I have all four of the originals. They=\r\n were taken in RAW format on a digital SLR and thus have saved the most inf=\r\normation possible to have a record of for each of these four photographs (i=\r\nncluding the color information).&lt;/P&gt;\n&lt;P&gt;Please let me know what you think. =\r\nIt looks like a ghost, smells like a ghost=85does it sound like a ghost to =\r\nyou?&lt;/P&gt;&lt;/DIV&gt;\n\r\n--4-9109642052-6072525853=:8--"}