{"id": "10401", "subject": "Re: Death in the Family &quot;Experiment&quot;!", "author": "Misty", "timestamp": "2008-04-23T18:18:04Z", "full_text": "Sorry for your family&#39;s feeling of loss. I know the feeling all too \nwell. \n\nI tend to run my own experiments without thought of what someone else \nwill think about it so I will let ya know if they come by this way. I \nusually dont post newly crossed people out of respect to the family \ninvolved. I share it when the time seems right.\n\nAs for those who think it takes &quot;time&quot; for newly deceased to come \nthru, I tend to think it is us that needs time to heal because they \nhave continually said &quot;time does not exist&quot; for them. It is a manmade \nfunction we place on ourselves due to environment and daily function \nas well as measure of life span.\n\nI did get a Cathy coming thru repeatedly lately but not sure \nwhich/who she is for. Either way she just says she loves her dog \nand &quot;this is a proper hehe mom&quot; \n\nAnd a Tom-Son dunno who they are either. Toms son, thompson, no clue. \nall they said was &quot;whos an alligator Tom-Son&quot; I am bad when i dont \nrecognize it or understand it so I just go phonetically for those. So \nI may be a lil off on what they say/mean.\n\nAnd a Jason and a Jordan. Jasons statement sounded british he said &quot; \nwell sugar I love my mummys sunday&quot; something. Jordan&#39;s statement was \nabout someone (Chris) not killing themselves saying it was Bullsh*t. \n\nI dont know these spirits/people so all I can do is document and move \non. But if yours pop up I will forward them your way.\n\nMisty\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;reesclarke_69&quot; &lt;reesclarke_69@...&gt; \nwrote:\n&gt;\n&gt; \n&gt; Hello guys, & gals\n&gt; \n&gt; I hope everybody is having a great day, its a beatiful day in the \n&gt; Bluegrass State of Kentucky.  I just had a death in my Family, and \nI \n&gt; was wandering if anybody does a session today/or tonight if you \ncould \n&gt; try to get in contact with a Mr. Charlie Clarke,(my Great Uncle) or \n&gt; Mrs. Joann Clarke(his wife has past a couple of months ago)to see \nif \n&gt; you can contact them.  If you do contact him can you tell him that \n&gt; Rees will be asking to speak with them tonight around 7-8pm eastern \n&gt; time.  To see if they can contact me.  They lived a long and \n&gt; wonderful life together.  So all my family is sad to see him go, \nbut \n&gt; we know it was his time to leave, and life goes on.  He should be \n&gt; happy to be back with his wife.  (He was 83 years old)  I know \n&gt; probaly somebody here might think this is crazy, dumb or \n&gt; disrespectful, but that is my business. I think it should be easy \nto \n&gt; get in contact with him since he just crossed over.  Please let me \n&gt; know if you tried and any evidence you might get from him.\n&gt; \n&gt; Thanks\n&gt; \n&gt; William Rees\n&gt;"}