{"id": "10419", "subject": "Re: Death in the Family &quot;Experiment&quot;!", "author": "itcdeadpeople", "timestamp": "2008-04-23T22:13:27Z", "full_text": "OK Rees.  Didn&#39;t see this when I created my other post.  oops!\n\nIt&#39;s in my folder.  Files &gt; Margaret Downey &gt; Radio Sweep - manual.  File names:  &quot;Chuck \nClarke&quot; and &quot;Tell him I love him.&quot;  :-)\n\nMargaret\n\n--- In EVP-ITC@yahoogroups.com, Wiliam Clarke &lt;reesclarke_69@...&gt; wrote:\n&gt;\n&gt; Everybody that wants to help with my Death in the Family &quot;Experiment&quot;  please post any \nevidence you might get!  Thanks for the help.\n&gt;    \n&gt;   If you get in touch with anybody please tell them I said &quot;goodbye till I see ya again&quot;!\n&gt;    \n&gt;   Thanks\n&gt;   Rees\n&gt; \n&gt; psfponies &lt;psfponies@...&gt; wrote:\n&gt;           Hi Rees\n&gt; \n&gt; Sorry to hear of your loss. I will try for you.\n&gt; \n&gt; Kay\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;reesclarke_69&quot; &lt;reesclarke_69@&gt; \n&gt; wrote:\n&gt; &gt;\n&gt; &gt; \n&gt; &gt; Hello guys, & gals\n&gt; &gt; \n&gt; &gt; I hope everybody is having a great day, its a beatiful day in the \n&gt; &gt; Bluegrass State of Kentucky. I just had a death in my Family, and \n&gt; I \n&gt; &gt; was wandering if anybody does a session today/or tonight if you \n&gt; could \n&gt; &gt; try to get in contact with a Mr. Charlie Clarke,(my Great Uncle) \n&gt; or \n&gt; &gt; Mrs. Joann Clarke(his wife has past a couple of months ago)to see \n&gt; if \n&gt; &gt; you can contact them. If you do contact him can you tell him that \n&gt; &gt; Rees will be asking to speak with them tonight around 7-8pm \n&gt; eastern \n&gt; &gt; time. To see if they can contact me. They lived a long and \n&gt; &gt; wonderful life together. So all my family is sad to see him go, \n&gt; but \n&gt; &gt; we know it was his time to leave, and life goes on. He should be \n&gt; &gt; happy to be back with his wife. (He was 83 years old) I know \n&gt; &gt; probaly somebody here might think this is crazy, dumb or \n&gt; &gt; disrespectful, but that is my business. I think it should be easy \n&gt; to \n&gt; &gt; get in contact with him since he just crossed over. Please let me \n&gt; &gt; know if you tried and any evidence you might get from him.\n&gt; &gt; \n&gt; &gt; Thanks\n&gt; &gt; \n&gt; &gt; William Rees\n&gt; &gt;\n&gt; \n&gt; \n&gt; \n&gt;                            \n&gt; \n&gt;        \n&gt; ---------------------------------\n&gt; Be a better friend, newshound, and know-it-all with Yahoo! Mobile.  Try it now.\n&gt;"}