{"id": "10422", "subject": "Re: box use concerns.", "author": "Laura Kimberley", "timestamp": "2008-04-23T23:05:21Z", "full_text": "Frank,\nPersonally, I agree with the protection, but I do NOT BELIEVE there is\nanyone ONLY meant to do what you claim or anyone else that claims\ntheir the best for communicating with spirit this way! or any other way.\n\nI for one have been doing this stuff for 18 years and I have never\nsaid allot, but that got my goat, end of story. I know that this type\nof communication and use of radios has been going on since 1988 and\nyou stepped up to the plate and improved on the original process. \nBut, balanced people are strongly encouraged to always be aware of the\nemotional and mental issues that can possibly happen. Now for the UN\nBALANCED? Well, you have all experienced the results. So, lets drop\nthe issue and get on with our spirituality and growth and learn more,\nand have fun doing it at the same dern time.\n\nLK\n\n\n-- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt; \n&gt;  Hi All; We have been warned by others from time to time about\nunbridled box use, as it supposedly brings in negativity. I don&#39;t want\nto believe that, but there are a few cases of people using boxes made\nby me, as well as the hack radios, and going whacko big time. Its&#39;\neither all ego--I&#39;m the onlyest one that can use this, or like the\nmore recent example. I don&#39;t know if these people were like this to\nstart, or if it&#39;s an external influance, but it&#39;s discouraging. There\nseems to be a similar reaction with systems not made by me--so I&#39;ve\nbeen told.\n&gt;  \n&gt;  Soooo, maybe burn some white candles, and maybe get a Rosary. My\nguys talk about the Catholics, and the Purple Princess has a Catholic\nconnection on the etheric levels, although the church imposes too many\nlimits on her. I wouldn&#39;t want to go into a state of fear, but a\nlittle protection stuff couldn&#39;t hurt. \n&gt;  \n&gt;  Not only do I not have the time to mass produce boxes, I&#39;m\nbeginning to think it&#39;s not a good idea anyway. \n&gt;  \n&gt;  Frank-S\n&gt;  \n&gt;  \n&gt; _________________________________________________________________\n&gt; Express yourself wherever you are. Mobilize!\n&gt;\nhttp://www.gowindowslive.com/Mobile/Landing/Messenger/Default.aspx?Locale=en-US?ocid=TAG_APRIL\n&gt;"}