{"id": "10450", "subject": "Re: Hello everyone !!!", "author": "LC Duplatt", "timestamp": "2008-04-24T11:38:57Z", "full_text": "Hi, Ralph. Please let us know how the &quot;puck&quot; works for you.  :)\n\nLC\n\n--- In EVP-ITC@yahoogroups.com, &quot;Ralph Smith&quot; &lt;Ralphsmi@...&gt; wrote:\n&gt;\n&gt; Hi all,\n&gt; \n&gt;  Ralph here again. Seems every time I come back on to leave a \nmessage\n&gt; there&#39;s some bickering going on. I can&#39;t leave you people for a \nminute \n&gt; without some hoopla going on LOL (just Kidding). Well how ya&#39;ll \ndoing ?\n&gt; Fine I hope. I have been busy with my Paranormal Group and \n&gt; investigations and Gettysburg. I was in Gettysburg over this past \n&gt; weekend and got an EVP in the Triagular Field that said &quot; Never \ntrust \n&gt; Abe Lincoln &quot; LOL must have been a Rebel soldier. I thought that \nwas \n&gt; pretty cool. I also got a voice whispering &quot; Good Day &quot; while I was \n&gt; leaving the field. I haven&#39;t had any time to do any box research \nbut I \n&gt; just recieved a cool device created by Bill Chappel called the &quot; \n&gt; Paranormal Puck &quot; can&#39;t wait to use it. It does real time voice \n&gt; communication with phonetic speech and texting on the computer from \n&gt; taking the surrounding ambient energies to create speech from the \n&gt; atmosphere through the Paranormal puck that has eight sensors that \n&gt; gathers the data and converts it to speech. I think that is an \naccurate\n&gt; description of it. \n&gt; \n&gt; Hey does anyone know what happened to Mike Colleta ? I haven&#39;t \nheard \n&gt; anything from him for awhile. He hasn&#39;t updated his website and his \n&gt; Blogtalk radio show has not been on lately either. I haven&#39;t seen \nany \n&gt; posts on here either. So what&#39;s up with Mike I hope he&#39;s alright ? \nJust\n&gt; concerned I really liked his Blogtalk shows. \n&gt; \n&gt; Frank Sumption please don&#39;t let all of this bickering bother you. \nYour \n&gt; a better person than that. Keep up what your doing. I look forward \nto \n&gt; hearing what you have to say about your work and appreciate it \nalso. \n&gt; Ignor all the hoopla and just give us all your knowledge and \nthoughts \n&gt; on what you love to do best and that&#39;s good enough for me and all \n&gt; others on here that think your the best at what you do. We support \nyou.\n&gt; I wish I was as one tenth as smart as you, I would be making all \nkinds \n&gt; of gadgets believe me. I&#39;m just a high school drop out with a GD \nfrom \n&gt; the Military working in a Post office ( making some good money \nthough \n&gt; better than some College Grads) glad to say. I do have a ton of \nGhost \n&gt; Hunting gadgets also LOL. My group calls me &quot; Inspector Gadget &quot; \nLOL.\n&gt; So Frank your the reason alot of us have joined this group. So \ndon&#39;t \n&gt; be upset if some of the people get caught up in their own selves. \nMost \n&gt; of us want you here probably all of us do. It&#39;s your choice what \nyou \n&gt; do. I can&#39;t persuade you to stay. It won&#39;t be the same if you \nleave, \n&gt; your knowledge and you will be missed. I know I&#39;ll miss ya. Even \n&gt; though I am not here all the time I am in the background watching \nand \n&gt; reading all the posts. Enough of my meandering gibberish. You all \ntake \n&gt; care and I &#39;ll let you know how the &quot;Paranormal Puck&quot; works out. \n&gt; Thanks for putting up with my long post here. Take care all.\n&gt; \n&gt; Regards,\n&gt; \n&gt; Ralph the Ghost Hunter\n&gt; S.P.I.R.I.T Paranormal Investigation Team\n&gt; GhosttHostt\n&gt;"}