{"id": "10452", "subject": "Re: [EVP-ITC] Hello everyone !!!", "author": "juli velazquez", "timestamp": "2008-04-24T12:15:01Z", "full_text": "--0-2022842220-1209039301=:93493\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nRalph:\n              Welcome back!  You are going to love the puck!  Several of us have had an opportunity to beta test it, and I will tell you that it is very interesting!\n   \n               I have not heard from Mike in a while, knowing him he may just be working on something that will knock our socks off!\n   \n  Juli\n\nRalph Smith &lt;Ralphsmi@...&gt; wrote:\n          Hi all,\n\nRalph here again. Seems every time I come back on to leave a message\nthere&#39;s some bickering going on. I can&#39;t leave you people for a minute \nwithout some hoopla going on LOL (just Kidding). Well how ya&#39;ll doing ?\nFine I hope. I have been busy with my Paranormal Group and \ninvestigations and Gettysburg. I was in Gettysburg over this past \nweekend and got an EVP in the Triagular Field that said &quot; Never trust \nAbe Lincoln &quot; LOL must have been a Rebel soldier. I thought that was \npretty cool. I also got a voice whispering &quot; Good Day &quot; while I was \nleaving the field. I haven&#39;t had any time to do any box research but I \njust recieved a cool device created by Bill Chappel called the &quot; \nParanormal Puck &quot; can&#39;t wait to use it. It does real time voice \ncommunication with phonetic speech and texting on the computer from \ntaking the surrounding ambient energies to create speech from the \natmosphere through the Paranormal puck that has eight sensors that \ngathers the data and converts it to speech. I think that is an accurate\ndescription of it. \n\nHey does anyone know what happened to Mike Colleta ? I haven&#39;t heard \nanything from him for awhile. He hasn&#39;t updated his website and his \nBlogtalk radio show has not been on lately either. I haven&#39;t seen any \nposts on here either. So what&#39;s up with Mike I hope he&#39;s alright ? Just\nconcerned I really liked his Blogtalk shows. \n\nFrank Sumption please don&#39;t let all of this bickering bother you. Your \na better person than that. Keep up what your doing. I look forward to \nhearing what you have to say about your work and appreciate it also. \nIgnor all the hoopla and just give us all your knowledge and thoughts \non what you love to do best and that&#39;s good enough for me and all \nothers on here that think your the best at what you do. We support you.\nI wish I was as one tenth as smart as you, I would be making all kinds \nof gadgets believe me. I&#39;m just a high school drop out with a GD from \nthe Military working in a Post office ( making some good money though \nbetter than some College Grads) glad to say. I do have a ton of Ghost \nHunting gadgets also LOL. My group calls me &quot; Inspector Gadget &quot; LOL.\nSo Frank your the reason alot of us have joined this group. So don&#39;t \nbe upset if some of the people get caught up in their own selves. Most \nof us want you here probably all of us do. It&#39;s your choice what you \ndo. I can&#39;t persuade you to stay. It won&#39;t be the same if you leave, \nyour knowledge and you will be missed. I know I&#39;ll miss ya. Even \nthough I am not here all the time I am in the background watching and \nreading all the posts. Enough of my meandering gibberish. You all take \ncare and I &#39;ll let you know how the &quot;Paranormal Puck&quot; works out. \nThanks for putting up with my long post here. Take care all.\n\nRegards,\n\nRalph the Ghost Hunter\nS.P.I.R.I.T Paranormal Investigation Team\nGhosttHostt\n\n\n\n\n                           \n\n\n  The contents of this eletronic correspondence is private & confidential and meant only for the party and/or parties it is addressed to.  \n   \n  No part of this email transmission may be publicly posted or forwarded to other parties without explicit written permission.\n\n\r\n--0-2022842220-1209039301=:93493\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;div&gt;Ralph:&lt;/div&gt;  &lt;div&gt;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Welcome back!&nbsp; You are going to love the puck!&nbsp; Several of us have had an opportunity to beta test it, and I will tell you that it is very interesting!&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; I have not heard from Mike in a while, knowing him he may just be working on something that will knock our socks off!&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Juli&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;Ralph Smith &lt;Ralphsmi@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/div&gt;  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV\n id=ygrp-text&gt;  &lt;div&gt;Hi all,&lt;BR&gt;&lt;BR&gt;Ralph here again. Seems every time I come back on to leave a message&lt;BR&gt;there&#39;s some bickering going on. I can&#39;t leave you people for a minute &lt;BR&gt;without some hoopla going on LOL (just Kidding). Well how ya&#39;ll doing ?&lt;BR&gt;Fine I hope. I have been busy with my Paranormal Group and &lt;BR&gt;investigations and Gettysburg. I was in Gettysburg over this past &lt;BR&gt;weekend and got an EVP in the Triagular Field that said &quot; Never trust &lt;BR&gt;Abe Lincoln &quot; LOL must have been a Rebel soldier. I thought that was &lt;BR&gt;pretty cool. I also got a voice whispering &quot; Good Day &quot; while I was &lt;BR&gt;leaving the field. I haven&#39;t had any time to do any box research but I &lt;BR&gt;just recieved a cool device created by Bill Chappel called the &quot; &lt;BR&gt;Paranormal Puck &quot; can&#39;t wait to use it. It does real time voice &lt;BR&gt;communication with phonetic speech and texting on the computer from &lt;BR&gt;taking the surrounding ambient energies to create speech from the &lt;BR&gt;atmosphere through the\n Paranormal puck that has eight sensors that &lt;BR&gt;gathers the data and converts it to speech. I think that is an accurate&lt;BR&gt;description of it. &lt;BR&gt;&lt;BR&gt;Hey does anyone know what happened to Mike Colleta ? I haven&#39;t heard &lt;BR&gt;anything from him for awhile. He hasn&#39;t updated his website and his &lt;BR&gt;Blogtalk radio show has not been on lately either. I haven&#39;t seen any &lt;BR&gt;posts on here either. So what&#39;s up with Mike I hope he&#39;s alright ? Just&lt;BR&gt;concerned I really liked his Blogtalk shows. &lt;BR&gt;&lt;BR&gt;Frank Sumption please don&#39;t let all of this bickering bother you. Your &lt;BR&gt;a better person than that. Keep up what your doing. I look forward to &lt;BR&gt;hearing what you have to say about your work and appreciate it also. &lt;BR&gt;Ignor all the hoopla and just give us all your knowledge and thoughts &lt;BR&gt;on what you love to do best and that&#39;s good enough for me and all &lt;BR&gt;others on here that think your the best at what you do. We support you.&lt;BR&gt;I wish I was as one tenth as smart as you, I\n would be making all kinds &lt;BR&gt;of gadgets believe me. I&#39;m just a high school drop out with a GD from &lt;BR&gt;the Military working in a Post office ( making some good money though &lt;BR&gt;better than some College Grads) glad to say. I do have a ton of Ghost &lt;BR&gt;Hunting gadgets also LOL. My group calls me &quot; Inspector Gadget &quot; LOL.&lt;BR&gt;So Frank your the reason alot of us have joined this group. So don&#39;t &lt;BR&gt;be upset if some of the people get caught up in their own selves. Most &lt;BR&gt;of us want you here probably all of us do. It&#39;s your choice what you &lt;BR&gt;do. I can&#39;t persuade you to stay. It won&#39;t be the same if you leave, &lt;BR&gt;your knowledge and you will be missed. I know I&#39;ll miss ya. Even &lt;BR&gt;though I am not here all the time I am in the background watching and &lt;BR&gt;reading all the posts. Enough of my meandering gibberish. You all take &lt;BR&gt;care and I &#39;ll let you know how the &quot;Paranormal Puck&quot; works out. &lt;BR&gt;Thanks for putting up with my long post here. Take care\n all.&lt;BR&gt;&lt;BR&gt;Regards,&lt;BR&gt;&lt;BR&gt;Ralph the Ghost Hunter&lt;BR&gt;S.P.I.R.I.T Paranormal Investigation Team&lt;BR&gt;GhosttHostt&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;&lt;/div&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;&lt;DIV&gt;  &lt;div&gt;&lt;EM&gt;&lt;STRONG&gt;&lt;FONT color=#0000ff&gt;The contents of this eletronic correspondence is private\n &amp; confidential and meant only for the party and/or parties it is addressed to.&nbsp; &lt;/FONT&gt;&lt;/STRONG&gt;&lt;/EM&gt;&lt;/div&gt;  &lt;div&gt;&lt;EM&gt;&lt;STRONG&gt;&lt;FONT color=#0000ff&gt;&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/EM&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;&lt;EM&gt;&lt;STRONG&gt;&lt;FONT color=#0000ff&gt;No part of this email transmission may be publicly posted or forwarded to other parties without explicit written permission.&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/EM&gt;&lt;/div&gt;&lt;/DIV&gt;\r\n--0-2022842220-1209039301=:93493--"}