{"id": "10472", "subject": "Re: [EVP-ITC] Re: box use concerns.", "author": "psfponies", "timestamp": "2008-04-24T16:47:37Z", "full_text": "--0-2134022938-1209055657=:70695\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nVery well said....\n   \n  Kay\n  \n\nLC Duplatt &lt;lcdupla@...&gt; wrote:\n  FS: Oh, boy...I&#39;ll stick with &quot;no fear.&quot; :)\n\nThe following is not directed at anyone:\n\nWe could say this very same thing about anything that becomes \nobsessive, thus blaming it on negative entities. Ex: I recently \nheard about a 40 year old man becoming so obsessive with playing a \nvideo game that he lost his job, his wife and kids, and had to move \nin with his parents! Was it the devil? No, he was just a dumb-ss! \n\nI would rather suggest it possible that focusing all of one&#39;s time \nand attention to this (or anything) will bring negative behavior of \nsome sort...hell, watching too much TV, or living on the computer is \nnot healthy, I would suspect.\n\nIf people want protection, they should first seek having a healthy \nperspective on life in general, and attempt to have a balanced \nlifestyle. I for one think that would solve most all issues for many \nof us. \n\nI therefore wonder if the &quot;demons&quot; people fear are really creations \nfrom our own selfish, mis-thinking, obsessive-compulsive lifestyles - \nall self-created for personal gain and self-satisfaction. ;)\n\nLC\n\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption \n\nwrote:\n&gt;\n&gt; \n&gt; Hi All; We have been warned by others from time to time about \nunbridled box use, as it supposedly brings in negativity. I don&#39;t \nwant to believe that, but there are a few cases of people using boxes \nmade by me, as well as the hack radios, and going whacko big time. \nIts&#39; either all ego--I&#39;m the onlyest one that can use this, or like \nthe more recent example. I don&#39;t know if these people were like this \nto start, or if it&#39;s an external influance, but it&#39;s discouraging. \nThere seems to be a similar reaction with systems not made by me--so \nI&#39;ve been told.\n&gt; \n&gt; Soooo, maybe burn some white candles, and maybe get a Rosary. My \nguys talk about the Catholics, and the Purple Princess has a Catholic \nconnection on the etheric levels, although the church imposes too \nmany limits on her. I wouldn&#39;t want to go into a state of fear, but a \nlittle protection stuff couldn&#39;t hurt. \n&gt; \n&gt; Not only do I not have the time to mass produce boxes, I&#39;m \nbeginning to think it&#39;s not a good idea anyway. \n&gt; \n&gt; Frank-S\n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Express yourself wherever you are. Mobilize!\n&gt; http://www.gowindowslive.com/Mobile/Landing/Messenger/Default.aspx?\nLocale=en-US?ocid=TAG_APRIL\n&gt;\n\n\n\n------------------------------------\n\nYahoo! Groups Links\n\n\n\n\n\n       \n---------------------------------\nBe a better friend, newshound, and know-it-all with Yahoo! Mobile.  Try it now.\r\n--0-2134022938-1209055657=:70695\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;div&gt;Very well said....&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Kay&lt;/div&gt;  &lt;div&gt;&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;LC Duplatt &lt;lcdupla@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/div&gt;  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;FS: Oh, boy...I&#39;ll stick with &quot;no fear.&quot; :)&lt;BR&gt;&lt;BR&gt;The following is not directed at anyone:&lt;BR&gt;&lt;BR&gt;We could say this very same thing about anything that becomes &lt;BR&gt;obsessive, thus blaming it on negative entities. Ex: I recently &lt;BR&gt;heard about a 40 year old man becoming so obsessive with playing a &lt;BR&gt;video game that he lost his job, his wife and kids, and had to move &lt;BR&gt;in with his parents! Was it the devil? No, he was just a dumb-ss! &lt;BR&gt;&lt;BR&gt;I would rather suggest it possible that focusing all of one&#39;s time &lt;BR&gt;and attention to this (or anything) will bring negative behavior of &lt;BR&gt;some sort...hell, watching too much TV, or living on the computer is &lt;BR&gt;not healthy, I would suspect.&lt;BR&gt;&lt;BR&gt;If people want protection, they should\n first seek having a healthy &lt;BR&gt;perspective on life in general, and attempt to have a balanced &lt;BR&gt;lifestyle. I for one think that would solve most all issues for many &lt;BR&gt;of us. &lt;BR&gt;&lt;BR&gt;I therefore wonder if the &quot;demons&quot; people fear are really creations &lt;BR&gt;from our own selfish, mis-thinking, obsessive-compulsive lifestyles - &lt;BR&gt;all self-created for personal gain and self-satisfaction. ;)&lt;BR&gt;&lt;BR&gt;LC&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;PURPLEALIENGIRL@...&gt;&lt;BR&gt;wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; &lt;BR&gt;&gt; Hi All; We have been warned by others from time to time about &lt;BR&gt;unbridled box use, as it supposedly brings in negativity. I don&#39;t &lt;BR&gt;want to believe that, but there are a few cases of people using boxes &lt;BR&gt;made by me, as well as the hack radios, and going whacko big time. &lt;BR&gt;Its&#39; either all ego--I&#39;m the onlyest one that can use this, or like &lt;BR&gt;the more recent example. I don&#39;t know if these people were like this &lt;BR&gt;to start, or if it&#39;s an external\n influance, but it&#39;s discouraging. &lt;BR&gt;There seems to be a similar reaction with systems not made by me--so &lt;BR&gt;I&#39;ve been told.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Soooo, maybe burn some white candles, and maybe get a Rosary. My &lt;BR&gt;guys talk about the Catholics, and the Purple Princess has a Catholic &lt;BR&gt;connection on the etheric levels, although the church imposes too &lt;BR&gt;many limits on her. I wouldn&#39;t want to go into a state of fear, but a &lt;BR&gt;little protection stuff couldn&#39;t hurt. &lt;BR&gt;&gt; &lt;BR&gt;&gt; Not only do I not have the time to mass produce boxes, I&#39;m &lt;BR&gt;beginning to think it&#39;s not a good idea anyway. &lt;BR&gt;&gt; &lt;BR&gt;&gt; Frank-S&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; _________________________________________________________________&lt;BR&gt;&gt; Express yourself wherever you are. Mobilize!&lt;BR&gt;&gt; http://www.gowindowslive.com/Mobile/Landing/Messenger/Default.aspx?&lt;BR&gt;Locale=en-US?ocid=TAG_APRIL&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;------------------------------------&lt;BR&gt;&lt;BR&gt;Yahoo! Groups Links&lt;BR&gt;&lt;BR&gt;&lt;*&gt; To\n visit your group on the web, go to:&lt;BR&gt;http://groups.yahoo.com/group/EVP-ITC/&lt;BR&gt;&lt;BR&gt;&lt;*&gt; Your email settings:&lt;BR&gt;Individual Email | Traditional&lt;BR&gt;&lt;BR&gt;&lt;*&gt; To change settings online go to:&lt;BR&gt;http://groups.yahoo.com/group/EVP-ITC/join&lt;BR&gt;(Yahoo! ID required)&lt;BR&gt;&lt;BR&gt;&lt;*&gt; To change settings via email:&lt;BR&gt;mailto:EVP-ITC-digest@yahoogroups.com &lt;BR&gt;mailto:EVP-ITC-fullfeatured@yahoogroups.com&lt;BR&gt;&lt;BR&gt;&lt;*&gt; To unsubscribe from this group, send an email to:&lt;BR&gt;EVP-ITC-unsubscribe@yahoogroups.com&lt;BR&gt;&lt;BR&gt;&lt;*&gt; Your use of Yahoo! Groups is subject to:&lt;BR&gt;http://docs.yahoo.com/info/terms/&lt;BR&gt;&lt;BR&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;p&gt;&#32;\n\n      &lt;hr size=1&gt;Be a better friend, newshound, and \nknow-it-all with Yahoo! Mobile. &lt;a href=&quot;http://us.rd.yahoo.com/evt=51733/*http://mobile.yahoo.com/;_ylt=Ahu06i62sR8HDtDypao8Wcj9tAcJ &quot;&gt; Try it now.&lt;/a&gt;\r\n--0-2134022938-1209055657=:70695--"}