{"id": "10482", "subject": "Re: Protection", "author": "itcdeadpeople", "timestamp": "2008-04-24T18:46:11Z", "full_text": "Hi Leslie.  Nice to meet you.  :-)\n\nMargaret\n\n--- In EVP-ITC@...m, Aquarius &lt;laustin@...&gt; wrote:\n&gt;\n&gt; Hi, all.\n&gt; \n&gt; I&#39;m a happy lurker here, I read everything since I signed on a few months\n&gt; ago. I haven&#39;t yet had time to try using the hack setup, my life has been,\n&gt; shall we say, very intensive and busy of late.\n&gt; \n&gt; I have been involved with psychic work for most of my life, and have\n&gt; channeled one specific guide since 1971, so contact with &quot;the other side&quot; is\n&gt; a part of my normal, everyday life. I don&#39;t do this professionally, I am a\n&gt; corporate/business consultant, and do some TV stuff in that domain, but\n&gt; haven&#39;t been in the public eye for psychic-related things since the mid-1970&#39;s.\n&gt; \n&gt; To me, there has never been any doubt in my mind whatsoever that we live on\n&gt; beyond our physical bodies, it&#39;s been proven to me countless times in my own\n&gt; experience. The value of the boxes and hacks are to capture the actual\n&gt; voices as a record, which I think is VERY cool... but to me, it&#39;s not about\n&gt; proving the existence of the non-visible world; to me that&#39;s a given. \n&gt; \n&gt; My Mom passed away after a long illness this past January, and though I miss\n&gt; her terribly (I was her main caregiver for years) and am sorry she is not\n&gt; here, incarnate any longer, I know she was joyful to leave her badly ailing\n&gt; body, and to move on to a happier new life. I happened to be at a meeting\n&gt; with a really good medium a couple of weeks later, and my Mom came through\n&gt; right away, insistently (just like her in mortal life! &lt;g&gt;), and was just\n&gt; hilarious. She mentioned a couple of very specific details that only I would\n&gt; know, and I got great comfort that she came through someone else so I knew\n&gt; it wasn&#39;t my own wishful thinking that she&#39;d stay in a little contact.\n&gt; \n&gt; She has since moved on for now, I know she needs that and she is joyful to\n&gt; be in her new experience, so I am content not to bother her for now... but\n&gt; it would have been way cool to have had those messages, so clearly from her,\n&gt; in her own voice and not the voice of the medium. That&#39;s why I think all the\n&gt; research here is so important and vital, so please keep it up! &lt;g&gt;\n&gt; \n&gt; Here&#39;s my take on the issue of protection when contacting discarnate beings:\n&gt; \n&gt; Beings on the other side aren&#39;t much different from we folks who currently\n&gt; reside in physical bodies. We all, carnate and discarnate, have our\n&gt; personalities and quirks, some of us are more evolved, kinder beings, and\n&gt; some of us just aren&#39;t so nice, or are caught in our narrowly focused\n&gt; material-world oriented egos. Simply put: there are as many good and mean\n&gt; entities on the other side as there are people in our five-senses world, not\n&gt; much difference.\n&gt; \n&gt; We all need to use our simple common sense in this world and the other; if\n&gt; someone is treating you with respect, kindly, or at least dispassionately,\n&gt; why not keep the contact going? If they are trashing you, trying to scare\n&gt; you, manipulate you, etc... why bother continuing with them? If you got a\n&gt; crank call on your telephone, I&#39;d hope you&#39;d just hang up! \n&gt; \n&gt; Same with entities... I expect them to treat me well, and I will treat them\n&gt; well. If they get out of line, I&#39;m outta there, I&#39;m not going to put up with\n&gt; any nonsense just because they happen not to be in a physical body at the time.\n&gt; \n&gt; I don&#39;t believe any entity can harm me in any way; it is only my own fear or\n&gt; thrill of being in contact with the dark forces that can harm me, if I go\n&gt; there. Just as with other people, any harm done depends very much on how I\n&gt; react to them in addition to how they are treating me.\n&gt; \n&gt; So: I recommend having very good boundaries and not letting the fact that\n&gt; you are in contact with discarnate beings sway you into thinking you need to\n&gt; be any more deferential or afraid than you would be with a person standing\n&gt; right in front of you. Remember the golden rule, do unto others as you would\n&gt; have others do unto you, and don&#39;t go there with the crank calls... just\n&gt; tell them you&#39;re not interested, and not to contact you again because you\n&gt; will break the contact if they keep misbehaving. If they keep it up, you\n&gt; know where the &quot;off&quot; button is... use it!\n&gt; \n&gt; As an aside, I also don&#39;t think we&#39;re here to provide interdimensional\n&gt; psychotherapy to troubled spirits; of course offer help and comfort if you\n&gt; can if they ask for it or need it, but don&#39;t get hooked. &lt;ggg&gt;\n&gt; \n&gt; Ok, I&#39;ll get off my soapbox now, sorry if I was long-winded, but I wanted to\n&gt; contribute some support and comfort to those here who are so busily doing\n&gt; such great research.\n&gt; \n&gt; Many thanks,\n&gt; \n&gt; Leslie\n&gt; \n&gt; &quot;A friend hears the song in my heart and sings it to me when my memory fails.&quot;\n&gt; \n&gt; \t-- Unknown\n&gt; \n&gt; &quot;Remember always that you have not only the right to be an individual; you\n&gt; have an obligation to be one. You cannot make any useful contribution in\n&gt; life unless you do this.&quot;\n&gt; \n&gt; \t-- Eleanor Roosevelt, American First Lady\n&gt;"}