{"id": "10509", "subject": "Re: A rare tuner find!", "author": "purplespacefriend", "timestamp": "2008-04-24T20:30:20Z", "full_text": "The main connector on the back of the radio has a lable on the \nbottom (see pix), id-ing all pins. Then the main board is marked, \nfor all connectors, even the volume controls, and the the tuner he \ntuner module is also completely self contained, except where the FM \nIF comes out, goes through a .1uf cap, and back in the &quot;MPX input&quot;. \nI&#39;ll have to take some pix using the digital camera. \n\n BTW, it&#39;s not that boxes cause danger per se`. I have had \nexpereiences, that I guess were demonic, for lack of any real \nunderstanding. Last summer I had &quot;something&quot; in the mifddle of the \nnight that was like crawling uop the inside fo my body from my feet. \ni was seeing werid lights, and qausi out of body like visions. I \ncoulsdn&#39;t make it ti stop, till for some reason I started \nthing &quot;jesus&quot;, and the thing stopped, like lifed it head, and flew \nout, gone. Then I sat up, in astral body, thought about it for about \na second, then laid back down. Not much freaks me out, but this was \na wierd experience, and I&#39;m still not religious. The box connection \ncame the next day, as a deep, evil sounding voice possing as Jesus \nsaid if I asked he&#39;ll come in, I said bite me! I&#39;m not entrely dim! \n\n \n\n Frank-S\n\n\n--- In EVP-ITC@yahoogroups.com, Zack Widup &lt;w9sz@...&gt; wrote:\n&gt;\n&gt; On Thu, 24 Apr 2008, purplespacefriend wrote:\n&gt; \n&gt; &gt; Hi All;\n&gt; &gt;\n&gt; &gt; I found a Honda car stereo at the thrift store this afternoon, \nI&#39;m\n&gt; &gt; always on the look out for car radios! This one has a very \nusable AM/FM\n&gt; &gt; tuner that does use the analog tuning voltage, so I can use it \nin a\n&gt; &gt; box. All radio functions are in the module itself. This radio was\n&gt; &gt; unusual in that all the pins and connections were labeled. \nUsually I\n&gt; &gt; use a scope and voltmeter to id the pins of the module looking \nfor\n&gt; &gt; operation voltages, which is usually 8 volts, mode pins, such as \na pin\n&gt; &gt; that is for AM or FM, and goes to 8 volts, or sometimes 5 volts \nfor the\n&gt; &gt; given band. I also look for any other enable voltages, inputs, \nand\n&gt; &gt; audio outputs, and the anttena pin(s). Junk yards usually want \n$10 each\n&gt; &gt; for junk radios, and many times they just are not usable. This \none was\n&gt; &gt; $3!\n&gt; &gt;\n&gt; \n&gt; Wow, what a find!\n&gt; \n&gt; Were these pins and connections labeled on the outside of the \nradio?  When \n&gt; I worked in an electronics repair shop, I recall some models of \nSony and \n&gt; maybe Pioneer had everything labeled inside the radio on the pc \nboard.\n&gt; \n&gt; &gt; What I said about box concerns, maybe just suffice it to say, \nuse at\n&gt; &gt; your own risk, there probably isn&#39;t any danger, and personally I\n&gt; &gt; haven&#39;t encountered anything I would relate directly to the box.\n&gt; &gt; However, that&#39;s not to say I haven&#39;t had encounters of an \napparent\n&gt; &gt; demon kind. Just troublesom parasitic entities that once \ndiscovered\n&gt; &gt; quickly leave, not a big deal. I don&#39;[t want to get that serious \nwiht\n&gt; &gt; this. Now if everyone that uses the hack box goes bananas....\n&gt; &gt;\n&gt; &gt; Frank-S\n&gt; &gt;\n&gt; \n&gt; And maybe an occasional parasitic oscillation?\n&gt; :-)\n&gt; \n&gt; I still think the boxes are not causing any danger.\n&gt; \n&gt; Zack\n&gt;"}