{"id": "10519", "subject": "Re: [EVP-ITC] Re: box use concerns.", "author": "Wiliam Clarke", "timestamp": "2008-04-24T21:25:10Z", "full_text": "--0-2020994953-1209072310=:26825\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nWhy do you call 33 the Devils Box, everybody is scared of?\n\npurplespacefriend &lt;purplealiengirl@...&gt; wrote:          The lack of boxes actually spawned the hack, so everything for a \nreason. Just the parts for mine are more than $25 bucks, and the \nhack is almost as good, it does the job. \n\nMaybe, if I quit going off on tangents, and just get some boards \nprofessionally done....\n\nI did have a couple boards made last fall for the LA1816, but the \nradio turned out to be just c-r-a-p-p-eee, I just set them aside. \nOne all the wiring is done, and one is just the bare board. They are \nmostly SMT components. If there are some real techno-gurus out \nthere, I don&#39;t have a problem giving these boards away. The AM band \nworks, but it&#39;s kinda noisy, which could be just the wrong choice of \nIF cans, or maybe the RF amp. These are second gen boards for the \nLA1816, the first one I had the pin spacing too close for the radio \nchip. They have RVG, and linear, which also may contribute to noise. \nRandy Schnieder has one of these, that was 25, now I can&#39;t remember \nwhat I did with 26, the ones I have on hand would be 28, and as yet \nan unassigned number. Oh yeah, Randy went halfers with the cost, so \nhe has 26. \n\n1 sits on my shelf.\n2 uesd for parts\n3 parts\n4,5,6-larry in Arkansas-claims that none worked. \n7 Moon\n8-Moon\n9-Moon\n10-Moon\n11=Crappy-used for parts\n12 =Juli\n13 distroyed\n14 Moon These two wer the second PCB version using ExpressPCB&#39;s\nmini boards. hummm, there should be three of these.\n15-Randy&#39;s\n16--was there a 16?\n17 Don&#39;t remember\n18 not finished -these were the first home made tuenr boards, and\nnot so good.\n19 not finished\n20 now in Moon hands\n21 Murphy\n22 REG\n23 REG\n\n24=proto-type LA1816--mine\n25=PCB LA1816--Randy&#39;s\n26=&quot; &quot; don&#39;t rmemeber ---Randy\n27=Hand wired LA1816-Steve H. \n28-unfinished PCB-LA1816\n29== Hand wired LM3820=Bruce \n30=Hand wired protoype LM3820 with shortwave--mine.\n31--Hand wired using car AM tuner module--Ann&#39;s\n32-- &quot; &quot; &quot; &quot; &quot; &quot; Going out bill Murphy\n\n33 Hand wired LA1135, the devil box everyone is scared of. \n\n34=hand wired with car tuner==goni got Chip Coffey, if he ever\ne-mails back.\n35-hand wired ultra compact LA1135, not finished--mine\n36 hand wired using the RS &#39;469 as the tuner- almost finished\n37 &quot; &quot; &quot; &quot; &quot; &quot; &quot;--April Slaughter. \n\nTranslation; Uncounted thousands of hours of life spent sitting in \nthe basement. \n\nFrank-s\n\n--- In EVP-ITC@yahoogroups.com, Wiliam Clarke &lt;reesclarke_69@...&gt; \nwrote:\n&gt;\n&gt; I think it is all an alter ego problem, certain people think they \nare blessed to have one of your boxes. Hell I could only wish to \nhave one myself, but I know that their is not enough to go around, \nand also know that I probably will never be able to get one. So I&#39;m \ncontent to have my Radio Shack Hack, without the ego problem. \nThat&#39;s fine with me, I feel great about being a member of this \ngroup, and making some friends. Maybe some day I might be able to \nuse what I learn from y&#39;all to build something for myself. \n&gt; \n&gt; Later Guys, and have a great day\n&gt; \n&gt; William Rees \n&gt; \n&gt; \n&gt; Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt; Hi All; We have been warned by others from time to time \nabout unbridled box use, as it supposedly brings in negativity. I \ndon&#39;t want to believe that, but there are a few cases of people \nusing boxes made by me, as well as the hack radios, and going whacko \nbig time. Its&#39; either all ego--I&#39;m the onlyest one that can use \nthis, or like the more recent example. I don&#39;t know if these people \nwere like this to start, or if it&#39;s an external influance, but it&#39;s \ndiscouraging. There seems to be a similar reaction with systems not \nmade by me--so I&#39;ve been told.\n&gt; \n&gt; Soooo, maybe burn some white candles, and maybe get a Rosary. My \nguys talk about the Catholics, and the Purple Princess has a \nCatholic connection on the etheric levels, although the church \nimposes too many limits on her. I wouldn&#39;t want to go into a state \nof fear, but a little protection stuff couldn&#39;t hurt. \n&gt; \n&gt; Not only do I not have the time to mass produce boxes, I&#39;m \nbeginning to think it&#39;s not a good idea anyway. \n&gt; \n&gt; Frank-S\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; ---------------------------------\n&gt; Express yourself wherever you are. Mobilize! \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; ---------------------------------\n&gt; Be a better friend, newshound, and know-it-all with Yahoo! \nMobile. Try it now.\n&gt;\n\n\n\n                           \n\n       \n---------------------------------\nBe a better friend, newshound, and know-it-all with Yahoo! Mobile.  Try it now.\r\n--0-2020994953-1209072310=:26825\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nWhy do you call 33 the Devils Box, everybody is scared of?&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;purplespacefriend &lt;purplealiengirl@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;div&gt;The lack of boxes actually spawned the hack, so everything for a &lt;BR&gt;reason. Just the parts for mine are more than $25 bucks, and the &lt;BR&gt;hack is almost as good, it does the job. &lt;BR&gt;&lt;BR&gt;Maybe, if I quit going off on tangents, and just get some boards &lt;BR&gt;professionally done....&lt;BR&gt;&lt;BR&gt;I did have a couple boards made last fall for the LA1816, but the &lt;BR&gt;radio turned out to be just c-r-a-p-p-eee, I just set them aside. &lt;BR&gt;One all\n the wiring is done, and one is just the bare board. They are &lt;BR&gt;mostly SMT components. If there are some real techno-gurus out &lt;BR&gt;there, I don&#39;t have a problem giving these boards away. The AM band &lt;BR&gt;works, but it&#39;s kinda noisy, which could be just the wrong choice of &lt;BR&gt;IF cans, or maybe the RF amp. These are second gen boards for the &lt;BR&gt;LA1816, the first one I had the pin spacing too close for the radio &lt;BR&gt;chip. They have RVG, and linear, which also may contribute to noise. &lt;BR&gt;Randy Schnieder has one of these, that was 25, now I can&#39;t remember &lt;BR&gt;what I did with 26, the ones I have on hand would be 28, and as yet &lt;BR&gt;an unassigned number. Oh yeah, Randy went halfers with the cost, so &lt;BR&gt;he has 26. &lt;BR&gt;&lt;BR&gt;1 sits on my shelf.&lt;BR&gt;2 uesd for parts&lt;BR&gt;3 parts&lt;BR&gt;4,5,6-larry in Arkansas-claims that none worked. &lt;BR&gt;7 Moon&lt;BR&gt;8-Moon&lt;BR&gt;9-Moon&lt;BR&gt;10-Moon&lt;BR&gt;11=Crappy-used for parts&lt;BR&gt;12 =Juli&lt;BR&gt;13 distroyed&lt;BR&gt;14 Moon These two wer the second PCB version using\n ExpressPCB&#39;s&lt;BR&gt;mini boards. hummm, there should be three of these.&lt;BR&gt;15-Randy&#39;s&lt;BR&gt;16--was there a 16?&lt;BR&gt;17 Don&#39;t remember&lt;BR&gt;18 not finished -these were the first home made tuenr boards, and&lt;BR&gt;not so good.&lt;BR&gt;19 not finished&lt;BR&gt;20 now in Moon hands&lt;BR&gt;21 Murphy&lt;BR&gt;22 REG&lt;BR&gt;23 REG&lt;BR&gt;&lt;BR&gt;24=proto-type LA1816--mine&lt;BR&gt;25=PCB LA1816--Randy&#39;&lt;WBR&gt;s&lt;BR&gt;26=&quot; &quot; don&#39;t rmemeber ---Randy&lt;BR&gt;27=Hand wired LA1816-Steve H. &lt;BR&gt;28-unfinished PCB-LA1816&lt;BR&gt;29== Hand wired LM3820=Bruce &lt;BR&gt;30=Hand wired protoype LM3820 with shortwave--mine.&lt;BR&gt;31--Hand wired using car AM tuner module--Ann&#39;&lt;WBR&gt;s&lt;BR&gt;32-- &quot; &quot; &quot; &quot; &quot; &quot; Going out bill Murphy&lt;BR&gt;&lt;BR&gt;33 Hand wired LA1135, the devil box everyone is scared of. &lt;BR&gt;&lt;BR&gt;34=hand wired with car tuner==goni got Chip Coffey, if he ever&lt;BR&gt;e-mails back.&lt;BR&gt;35-hand wired ultra compact LA1135, not finished--mine&lt;BR&gt;36 hand wired using the RS &#39;469 as the tuner- almost finished&lt;BR&gt;37 &quot; &quot; &quot; &quot; &quot; &quot; &quot;--April Slaughter. &lt;BR&gt;&lt;BR&gt;Translation; Uncounted\n thousands of hours of life spent sitting in &lt;BR&gt;the basement. &lt;BR&gt;&lt;BR&gt;Frank-s&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;, Wiliam Clarke &lt;reesclarke_&lt;WBR&gt;69@...&gt; &lt;BR&gt;wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; I think it is all an alter ego problem, certain people think they &lt;BR&gt;are blessed to have one of your boxes. Hell I could only wish to &lt;BR&gt;have one myself, but I know that their is not enough to go around, &lt;BR&gt;and also know that I probably will never be able to get one. So I&#39;m &lt;BR&gt;content to have my Radio Shack Hack, without the ego problem. &lt;BR&gt;That&#39;s fine with me, I feel great about being a member of this &lt;BR&gt;group, and making some friends. Maybe some day I might be able to &lt;BR&gt;use what I learn from y&#39;all to build something for myself. &lt;BR&gt;&gt; &lt;BR&gt;&gt; Later Guys, and have a great day&lt;BR&gt;&gt; &lt;BR&gt;&gt; William Rees &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; Frank Sumption &lt;purplealiengirl@&lt;WBR&gt;...&gt; wrote:&lt;BR&gt;&gt; Hi All; We have been warned by\n others from time to time &lt;BR&gt;about unbridled box use, as it supposedly brings in negativity. I &lt;BR&gt;don&#39;t want to believe that, but there are a few cases of people &lt;BR&gt;using boxes made by me, as well as the hack radios, and going whacko &lt;BR&gt;big time. Its&#39; either all ego--I&#39;m the onlyest one that can use &lt;BR&gt;this, or like the more recent example. I don&#39;t know if these people &lt;BR&gt;were like this to start, or if it&#39;s an external influance, but it&#39;s &lt;BR&gt;discouraging. There seems to be a similar reaction with systems not &lt;BR&gt;made by me--so I&#39;ve been told.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Soooo, maybe burn some white candles, and maybe get a Rosary. My &lt;BR&gt;guys talk about the Catholics, and the Purple Princess has a &lt;BR&gt;Catholic connection on the etheric levels, although the church &lt;BR&gt;imposes too many limits on her. I wouldn&#39;t want to go into a state &lt;BR&gt;of fear, but a little protection stuff couldn&#39;t hurt. &lt;BR&gt;&gt; &lt;BR&gt;&gt; Not only do I not have the time to mass produce boxes, I&#39;m\n &lt;BR&gt;beginning to think it&#39;s not a good idea anyway. &lt;BR&gt;&gt; &lt;BR&gt;&gt; Frank-S&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; ------------&lt;WBR&gt;---------&lt;WBR&gt;---------&lt;WBR&gt;---&lt;BR&gt;&gt; Express yourself wherever you are. Mobilize! &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; ------------&lt;WBR&gt;---------&lt;WBR&gt;---------&lt;WBR&gt;---&lt;BR&gt;&gt; Be a better friend, newshound, and know-it-all with Yahoo! &lt;BR&gt;Mobile. Try it now.&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/div&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;p&gt;&#32;\n\n\n\n      &lt;hr size=1&gt;Be a better friend, newshound, and \nknow-it-all with Yahoo! Mobile. &lt;a href=&quot;http://us.rd.yahoo.com/evt=51733/*http://mobile.yahoo.com/;_ylt=Ahu06i62sR8HDtDypao8Wcj9tAcJ &quot;&gt; Try it now.&lt;/a&gt;\r\n--0-2020994953-1209072310=:26825--"}