{"id": "10521", "subject": "Re: [EVP-ITC] Re: Hello everyone !!!", "author": "Zack Widup", "timestamp": "2008-04-24T21:37:20Z", "full_text": "Things seem to be returning to normal now.  No arguing now to speak of on \nmost of the other 60 Yahoogroups I&#39;m on.  And no earthquakes for several \ndays!\n\nZack\n\nOn Thu, 24 Apr 2008, purplespacefriend wrote:\n\n&gt; Ann and I both made private comments to each other about\n&gt; the &quot;negative&quot; energy, for lack of knowing what it was. I think it&#39;s\n&gt; still hangin&#39; around, but not as strong. I&#39;ve had to bite the be-\n&gt; jeeeses out of my tongue lately.\n&gt;\n&gt; Frank-S\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, Zack Widup &lt;w9sz@...&gt; wrote:\n&gt;&gt;\n&gt;&gt; On Thu, 24 Apr 2008, Ralph Smith wrote:\n&gt;&gt;\n&gt;&gt;&gt; Hi all,\n&gt;&gt;&gt;\n&gt;&gt;&gt; Ralph here again. Seems every time I come back on to leave a\n&gt; message\n&gt;&gt;&gt; there&#39;s some bickering going on. I can&#39;t leave you people for a\n&gt; minute\n&gt;&gt;&gt; without some hoopla going on LOL (just Kidding). Well how ya&#39;ll\n&gt; doing ?\n&gt;&gt;\n&gt;&gt; There seemed to be something happening all around over the last\n&gt; few days\n&gt;&gt; or week.  It wasn&#39;t just here.  I am on 62 Yahoogroups and almost\n&gt; all of\n&gt;&gt; them broke out in arguing and bickering at the same time. I have\n&gt; NEVER\n&gt;&gt; seen that happen! And one of my favorite area bands had some\n&gt; really\n&gt;&gt; bizarre and unpleasant things happen at a show on Saturday night.\n&gt; And we\n&gt;&gt; had three earthquakes here. Some thought all of these events were\n&gt; caused\n&gt;&gt; by the full moon.  I dunno, it was still very odd but seems to\n&gt; have passed\n&gt;&gt; now. Lives are retue=rning to normal.\n&gt;&gt;\n&gt;&gt;&gt; Fine I hope. I have been busy with my Paranormal Group and\n&gt;&gt;&gt; investigations and Gettysburg. I was in Gettysburg over this past\n&gt;&gt;&gt; weekend and got an EVP in the Triagular Field that said &quot; Never\n&gt; trust\n&gt;&gt;&gt; Abe Lincoln &quot; LOL must have been a Rebel soldier. I thought that\n&gt; was\n&gt;&gt;&gt; pretty cool.\n&gt;&gt;\n&gt;&gt; It also could&#39;ve been a Union soldier who didn&#39;t like his outcome!\n&gt;&gt;\n&gt;&gt; I really want to get the chance to visit Gettysburg.  I am pretty\n&gt; sure\n&gt;&gt; Batleground, Indiana (the site of the Battle of Tippecanoe in\n&gt; 1811) is\n&gt;&gt; haunted by some of the former soldiers.  I&#39;ve been to that one\n&gt; many times\n&gt;&gt; but never tried to get any EVP there.\n&gt;&gt;\n&gt;&gt; Zack\n&gt;&gt;\n&gt;\n&gt;\n&gt;\n&gt; ------------------------------------\n&gt;\n&gt; Yahoo! Groups Links\n&gt;\n&gt;\n&gt;\n&gt;"}