{"id": "1056", "subject": "Re: [EVP-ITC] Optical mic info.", "author": "RetroCom", "timestamp": "2007-04-05T15:33:47Z", "full_text": "The lamp I use came from K-Mart ($8.00) and uses a liquid paraffin fuel for indoor use (low odor). It&#39;s real important to have the 3/4 to one inch wide wick version. The smaller half inch wicks and round (rope) wicks do not work for some reason. The Phototransisor sells at Radio Shack for about $1.59.  \n\n--- franks-boxes@... wrote:\n\nFrom: &quot;Frank Sumption&quot; &lt;franks-boxes@...&gt;\nTo: EVP-ITC@yahoogroups.com\nSubject: Re: [EVP-ITC] Optical mic info.\nDate: Thu, 05 Apr 2007 08:47:17 -0600\n\nOkay, thanks. I&#39;d like to try that method in the next week or so. I did try \nwith a solar panel once, and got a weak voice after your discritptin last \nyear. You mean like a Kerosene lamp?\n\n\n  Frank\n\n\n&gt;From: &quot; RetroCom&quot; &lt;vfp19968@...&gt;\n&gt;Reply-To: EVP-ITC@yahoogroups.com\n&gt;To: &lt;EVP-ITC@yahoogroups.com&gt;\n&gt;Subject: Re: [EVP-ITC] Optical mic info.\n&gt;Date: Thu, 5 Apr 2007 07:25:56 -0700\n&gt;\n&gt;The design I came up with is much simpler. A flame is used as the \n&gt;&#39;vibrating element&#39;. A phototransistor from Radio Shack is used in place of \n&gt;a microphone. Of all the tests I ran, a simple oil burning lamp has worked \n&gt;best. The lamp must have a flat, wide wick 3/4 to one inch across (very \n&gt;important). The phototransistor will function with the phantom voltage \n&gt;supplied from most digital recorders or sound cards. Very simple concept, \n&gt;most people who see it are amazed at the simplicity. You will not find \n&gt;plans on the internet except on AAEVP, I published an article almost two \n&gt;years ago for thier news letter. Since that time I have simplified the \n&gt;design to the two parts I have mentioned.\n&gt;\n&gt;Dave\n&gt;\n\n_________________________________________________________________\nMortgage rates near historic lows. Refinance $200,000 loan for as low as \n$771/month* \nhttps://www2.nextag.com/goto.jsp?product=100000035&url=%2fst.jsp&tm=y&search=mortgage_text_links_88_h27f8&disc=y&vers=689&s=4056&p=5117"}