{"id": "10608", "subject": "Re:Skype sessions", "author": "shadow71414", "timestamp": "2008-04-26T13:30:47Z", "full_text": "gee juli were was i during theaase sessions?  thought i was sitting \nright there nexct to you  . to be honset i think me and steven did  \none of the frist  but  i have to ask stevem if that true\n\n\n--- In EVP-ITC@yahoogroups.com, juli velazquez &lt;ghostchasingfool@...&gt; \nwrote:\n&gt;\n&gt; Regan:\n&gt;                We originally Steve, myself and Jeff started doing \nsessions via Skye.  At that time I was not in position of a Frank&#39;s \nor Joe&#39;s Box.  Therefore we were able to conduct sessions using every \nones boxes.  Upon receiving my #12 Franks Box, I want to afford the \nan opportunity to anyone that want to partake and experience all the \nboxes since they are not readily available.  This way everyone could \nlearn the different pitches and tones for the different devices.  I \nfigured I waited so long for mine and know how much it means to me, \ntherefore, several of us didn&#39;t want those who didn&#39;t own one not to \nlose either, thus the Skye sessions were born (so to speak).  Even \nthough you do not have the devices and/or boxes at your location, you \ncan still record the session.\n&gt;    \n&gt;                 I myself do 2 types of recordings and/or sessions.  \nOne I just let the recorder run, like Frank does and the other I do \nask questions.  What I am lead to believe either way, they already \nknow what your pretty much going to ask so, sometimes its just better \nto NOT ASK QUESTIONS AT ALL, but to let them do their thing so you do \nnot speak over them.\n&gt;    \n&gt;                 Hope this helps!\n&gt;   Juli\n&gt;    \n&gt;                 \n&gt; Regan V &lt;haunt.seeker@...&gt; wrote:\n&gt;             I am interested in the Skye sessions, will someone back \nup and refresh me?  I don&#39;t think I was privy for the first of the \nconversations. \n&gt;    \n&gt;   I have a team member working with a friend in Malta. They talk on \nSkye alot, and get ALOT OF EVPS. We figured it was from interferance, \nbut the voices seemed to correlate with what was conspiring with the \nfamily.\n&gt;    \n&gt;   Thanks alot guys\n&gt;   \n&gt; Regan\n&gt;     \n&gt; ---------------------------------\n&gt;   Be a better friend, newshound, and know-it-all with Yahoo! \nMobile. Try it now.   \n&gt; \n&gt;                            \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;   The contents of this eletronic correspondence is private & \nconfidential and meant only for the party and/or parties it is \naddressed to.  \n&gt;    \n&gt;   No part of this email transmission may be publicly posted or \nforwarded to other parties without explicit written permission.\n&gt;"}