{"id": "10649", "subject": "Re: My first YouTube video (yep!  ANOTHER one out there now)", "author": "itcdeadpeople", "timestamp": "2008-04-27T17:19:05Z", "full_text": "Hi Bryan.  Can you email it to me so I can see it too?  I only view the boards online, so I \ndon&#39;t get anything that is sent out as an attachment.  Thanks!\n\nThere&#39;s a UK based researcher of &quot;The Schreiber Method&quot; named Lance Reed who has been \ngetting good results with video loop.  Have you ever checked out his site?\n\nhttp://www.lanceitc.com/home.html\n\nMargaret\n\n--- In EVP-ITC@yahoogroups.com, Bryan Whatley &lt;bryan_whatley@...&gt; wrote:\n&gt;\n&gt; Ok, so since I love to try new things out and have been wanting to try this out for a \nwhile, I hooked up a loop last night with my web cam and got several images.  Via the way \nI hooked it up, I was actually able to broadcast this online to a friend of mine live via \nyahoo messenger.  While watching the video loop live with me, my friend started pointing \nout several immediately as the images appeared.  Here is one she saw, but I wanted to get \nyour guys opinionated too.  Please tell me what you see, if anything at all. \n&gt; \n&gt; Thanks,\n&gt; Bryan\n&gt; \n&gt; \n&gt; ----- Original Message ----\n&gt; From: Wiliam Clarke &lt;reesclarke_69@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Sunday, April 27, 2008 9:03:26 AM\n&gt; Subject: Re: [EVP-ITC] My first YouTube video (yep!  ANOTHER one out there now)\n&gt; \n&gt; \n&gt; I watch your video over and over, and I see something new everytime!\n&gt; \n&gt; Bryan Whatley &lt;bryan_whatley@ yahoo.com&gt; wrote:\n&gt; pretty cool.\n&gt; \n&gt; I might have to try that out.  Thanks  for posting it. :)\n&gt; \n&gt; \n&gt; ----- Original Message ----\n&gt; From: itcdeadpeople &lt;ITCdeadpeople@ aol.com&gt;\n&gt; To: EVP-ITC@yahoogroups .com\n&gt; Sent: Saturday, April 26, 2008 2:37:32 AM\n&gt; Subject: [EVP-ITC] My first YouTube video (yep! ANOTHER one out there now)\n&gt; \n&gt; \n&gt; OMGosh. It took me forever to figure out how to do everything to create my YouTube \nvideo, \n&gt; but I finally got it all together and posted. I&#39;ve never done anything of this nature before. \n&gt; LOL - sometimes I can be a wee bit on the technologically challenged side! ;-)\n&gt; \n&gt; http://www.youtube. com/watch? v=Dmlox_8H5lo\n&gt; \n&gt; Hope you enjoy it if you decide to watch. I figured another video promoting the POSITIVE \n&gt; side to spirit communication would help counterbalance some of the garbage out there. \n&gt; \n&gt; Margaret\n&gt; \n&gt; \n&gt; ________________________________\n&gt;  Be a better friend, newshound, and know-it-all with Yahoo! Mobile. Try it now. \n&gt; \n&gt; ________________________________\n&gt; Be a better friend, newshound, and \n&gt; know-it-all with Yahoo! Mobile. Try it now.    \n&gt; \n&gt; \n&gt;       \n____________________________________________________________________________________\n&gt; Be a better friend, newshound, and \n&gt; know-it-all with Yahoo! Mobile.  Try it now.  \nhttp://mobile.yahoo.com/;_ylt=Ahu06i62sR8HDtDypao8Wcj9tAcJ\n&gt;"}