{"id": "10704", "subject": "Re: skeptic", "author": "Guy", "timestamp": "2008-04-28T19:13:26Z", "full_text": "In the history of EVP/ITC, it has been acknowledged by some \nresearchers that the first people to have recorded &quot;voice phenomena&quot; \nvia magnetic means (i.e. a magnetophone) were the Catholic priests \nFathers Gemilli and Ernetti back in 1952. (Gemelli received a message \nfrom his departed father while he and Ernetti were working with \nGregorian chants). This communication bothered them so they had an \naudience with Pope Pius XII who was quoted as saying: &quot;Dear Father \nGemelli, you really need not worry about this. The existence of this \nvoice is strictly a scientific fact and has nothing whatsoever to do \nwith spiritism. The recorder is totally objective. It receives and \nrecords only sound waves from wherever they come. This experiment may \nperhaps become the cornerstone for a building for scientific studies \nwhich will strengthen people&#39;s faith in a hereafter.&quot;\n\nIn addition - Friedrich Jurgenson was a very well-known figure to \nboth Pope Pius XII (who commissioned Jurgenson to paint numerous \nportraits of him and allowed Jurgenson to do archeologic explorations \nof the ruins of Pompeii) and to Pope Paul VI (who also commissioned \nJurgenson to paint portraits of him and to produce a documentary for \nhim which resulted in Jurgenson receiving the Order of Commendatore \nGregorio Magno). It is alleged that Jurgenson discussed his &quot;voice \nphenomena&quot; recordings with Pope Paul and that the pope never spoke of \nreservations about the technique but I haven&#39;t found any definite \nproof of those conversations. You would think, though, that Pope Paul \nhad to have known about Jurgenson&#39;s &quot;voice phenomena&quot; work either \nfrom first-hand talks to Jurgenson or indirectly via Vatican staff \nmembers and would have spoken to Jurgenson about any reservations he \nhad. Note that Jurgenson&#39;s recording work occurred from late 1959 \nuntil his death in 1987.\n\n\n--- In EVP-ITC@yahoogroups.com, Frank Ratka &lt;warrior18eii@...&gt; wrote:\n&gt;\n&gt; Hey Mike, tell your Catholic friend that the Vatican, under John \nPaul approved experimentation with ITC. There are several Vatican \npriests who experiment with direct radio voice ITC.zammit\n&gt; \n&gt; \n&gt; Vatican Okays TransCommunication   \n&gt;     Vatican\n&gt; Okays TransCommunication\n&gt; (All quotes taken from the periodical&#39;Transdimension&#39; ,\n&gt; 1999 Volume 1, page 33 \n&gt; published by CONTINUING LIFE\n&gt; RESEARCH; Boulder USA)\n&gt;  \n&gt; Roman Catholics were\n&gt; given the Church&#39;s blessing yesterday to &quot;contact&quot; loved ones beyond\n&gt; the grave. Leading Vatican theologian Father\n&gt; Gino Concetti said it is no longer a sin, as long as mediums, \nfortune teller\n&gt; and palmists are not involved.\n&gt; The pronouncement\n&gt; came after Italian magazine claims that contact with the spiritual \nworld had\n&gt; produced miracles. Father Concetti dismissed that,  but added: &#39;We \ncan\n&gt; pray for our loved ones. They will respond in dreams and \ninspiration. In one\n&gt; example, a grandmother advised a girl about her marriage choice in \na dream. The\n&gt; girl did not heed counsel and a grave problem developed. If we pray \nseriously\n&gt; in a quiet place, with our hearts and our voices, the departed will \nexpress\n&gt; themselves and advise us.&#39;\n&gt; (Printed in the LondonDaily\n&gt; Mail, 29-Nov-96)\n&gt; ________________________________\n&gt;  \n&gt; Recently Father\n&gt; Concetti, one of the most competent theologians in the Vatican, \nsaid in an interview:\n&gt; &#39;According to the\n&gt; modern catechism, God allows our dear departed persons who live in \nan ultra -\n&gt; terrestrial dimension, to send messages to guide us in certain \ndifficult\n&gt; moments of our lives. The Church has decided not to forbid anymore \nthe dialogue\n&gt; with the deceased with the condition that these contacts are \ncarried out with a\n&gt; serious religious and scientific purpose.&#39;\n&gt; (Printed in the Vatican newspaper Osservatore Romano, date\n&gt; unspecified)\n&gt; ________________________________\n&gt;  \n&gt; The Pope explains to\n&gt; us &quot;What actually happens to us at the moment of death?&quot;\n&gt; This question has\n&gt; occupied mankind for centuries. Jesus promised that a final \njudgment will come,\n&gt; an all-last day. But what occurs to the souls of those who die \nbefore this\n&gt; point in time?\n&gt; Pope John Paul II\n&gt; explained it in Rome\n&gt; before pilgrims. He said:\n&gt; &#39;One should not\n&gt; think life begins after death only with the final judgment. Quite \nspecial\n&gt; conditions prevail after natural death. It concerns a transitional \nphase in\n&gt; which the body dissolves and where the life of a mirror-image \nentity (the soul)\n&gt; begins.&#39;\n&gt; &#39;This entity is\n&gt; equipped with its own consciousness and its own will, so that \nhumans exist,\n&gt; although they no longer possess a physical body.&#39;\n&gt; A member of the\n&gt; international papal theological advises: &#39;At the moment of death \nhumans make an\n&gt; enormous discovery. The soul does not only leave the body, but \nhumans discover\n&gt; the secret of time. Because it becomes timeless, steps into \neternity.&#39;\n&gt; (From the German\n&gt; journal Bild, 1998 October 30 in an article, &quot;The moment of death;\n&gt; what occurs to our soul?&#39;)  \n&gt; rodiehr Feb 26, 2005 \n&gt; \n&gt; \n&gt; \n&gt; Regards,\n&gt; \n&gt; \n&gt; Frank R.\n&gt; \n&gt; \n&gt; \n&lt;rest snipped&gt;"}