{"id": "10701", "subject": "Re: Copper Channels", "author": "purplespacefriend", "timestamp": "2008-04-28T19:07:34Z", "full_text": "I guess there is form of mechanical filtering going on. I think the \nterm echo box is probably incorrect to discribe it&#39;s function. These \nsystem do not need the sound chamber to work, like the Mini box, or \nhack radios, it seems the entites work mostly inside the \nelectronics. I even added direct mode to my boxes, an output that \ncomes out of the tuner, and just through a pre-amp to bring it up to \nabout one volt level for recording. You can record directly from the \nheadphone jack of any of these systems, where there is no air \nvibration, and you still get voices. The &quot;echo box&quot; seems to enhance \nthe voices, but I have no idea how. Size does not seem to be a major \nfactor. I have used boxes from almost as small as a pack of \ncigarettes, up to four feet long. The material seesms to matter, \nwith galvanized sheet metal scrap, I get mostly spirit voices, with \naluminum foil I get my ET guys, and with copper, it seems to be \nhigher spirits, but I&#39;ve only used it once so far. I have made boxes \nin the form of an orgone accumulator, that is layered cotten, and \nsteel screen. it seems like everything works, and there is one level \nor another that will use wiaht you&#39;re using at any particular \nmoment. That&#39;s why I say there are no absolutes, no rules. They use \nwhat we use. It&#39;ll make ya nutz if you try to nail it down. I don&#39;t \nhave the intellect, nor the education to figure this stuff out, so I \nrun entirely on intuition.  Cut and try is my favoite method.\n\n Peraonlly I prefer an echo box with 1 inch sqaure channels, two or \nthree channels running lengtwise in 4 X 6 (very approximate) inch \nbox. \n\n All the current boxes run in both modes, direct or with the echo \nbox/sound chamber.  \n\n Frank-S\n\n--- In EVP-ITC@yahoogroups.com, Bryan Whatley &lt;bryan_whatley@...&gt; \nwrote:\n&gt;\n&gt; Ok, another question if anyone will be so kind to answer.  This is \nfor resonance inside the box(hence the name echo chamber) correct?  \n&gt; \n&gt; So things I possibly need to take into consideration when building \nmine are:\n&gt; a.  Types of material provide better results, copper and aluminum \nversus materials that absorb/dampen such as egg crate foam or cloth \nlining.\n&gt; b.  Size of box (length, width, height) to produce the suspected \nresonance frequency.\n&gt; c.  Amount of chambers (I noticed 3 is the magical number )  \nHaving chambers increases the resonance effect more than just having \nan empty box without chambers.  \n&gt; d.  Outside influence such as air which is why Frank mentioned it \nneeding to be air-tight\n&gt; e.  The types of outside influence is from the spirits getting to \nthe inside.  So is it or is it not a good idea to wrap the box in \nabsorbing/dampening materials since they are manipulating the sound \ninside a box?  I wouldn&#39;t think that it would matter what&#39;s on the \noutside as long as noise from the outside isn&#39;t bombarding the \noutsides of the box causing internal problems and distorting \nanything.\n&gt; \n&gt; Pardon my thought process, but I&#39;m just trying to learn the \nconcepts here.  So if I am way of base, will someone please let me \nknow.  :)\n&gt; \n&gt; Thanks,\n&gt; Bryan\n&gt; \n&gt; \n&gt; ----- Original Message ----\n&gt; From: Bryan Whatley &lt;bryan_whatley@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Saturday, April 26, 2008 7:07:26 PM\n&gt; Subject: Re: [EVP-ITC] Copper Channels\n&gt; \n&gt; \n&gt; This is for the echo chambers right?  Can someone give me a link \nto more details about how it works?\n&gt; \n&gt; Is it that you put the mic on one end, the speaker on the other, \nand the sounds mix throughout the chamber to form words from the \nspeaker to the mic?\n&gt; \n&gt; Thanks for any and all help\n&gt; Bryan\n&gt; \n&gt; ----- Original Message ----\n&gt; From: Frank Sumption &lt;purplealiengirl@ live.com&gt;\n&gt; To: Group &lt;evp-itc@yahoogroups .com&gt;\n&gt; Sent: Saturday, April 26, 2008 1:18:36 AM\n&gt; Subject: [EVP-ITC] Copper Channels\n&gt; \n&gt; \n&gt;  I didn&#39;t have enough copper clad board, so used some copper \nsheet, and you can see where I spliced one of the channel dividers. \nJust have to be air tight. \n&gt;  \n&gt;  Frank-S\n&gt; \n&gt; \n&gt; ________________________________\n&gt; Back to work after baby how do you know when you&#39;re ready? \n&gt; ________________________________\n&gt; Be a better friend, newshound, and \n&gt; know-it-all with Yahoo! Mobile. Try it now.     \n&gt; \n&gt; \n&gt;       \n_____________________________________________________________________\n_______________\n&gt; Be a better friend, newshound, and \n&gt; know-it-all with Yahoo! Mobile.  Try it now.  \nhttp://mobile.yahoo.com/;_ylt=Ahu06i62sR8HDtDypao8Wcj9tAcJ\n&gt;"}