{"id": "10745", "subject": "Re: The copper vs steel box.", "author": "purplespacefriend", "timestamp": "2008-04-29T19:14:45Z", "full_text": "Ok, maybe just me perceptions--opr lack there of?\n Frank-S\n\n--- In EVP-ITC@yahoogroups.com, &quot;psfponies&quot; &lt;psfponies@...&gt; wrote:\n&gt;\n&gt; I am not sure how it sounded live to you Frank but from the mp3 in \n&gt; your file the copper box is much cleaner and clearer sounding than \n&gt; the steel box. \n&gt; \n&gt; As soon as you get to the steel box on the file it sounds like it \nwas \n&gt; covered with something which made it sound more muffled. I could \nalso \n&gt; hear some sort of wind sound from the steel box. \n&gt; \n&gt; Kay\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@&gt; \n&gt; wrote:\n&gt; &gt;\n&gt; &gt; \n&gt; &gt;  I wanted to compare the two boxes, I just finished a galvanized \n&gt; steel box, that scrap metal I get from work. I did the same as the \n&gt; copper box, try to select the best sounding speaker for it. The \nuse \n&gt; it with #33. I like the steel box better, I think last night, the \n&gt; clearer voices had more to do with conditions thant he equipment. \nOr--\n&gt; could it be the other way around, tonights conditions are poor for \n&gt; either box? It gets frustrating cuz ya can&#39;t nail the damn stuff \n&gt; down, it seems to defy any attempts at definition. \n&gt; &gt;  \n&gt; &gt;  I know, there was at least one person scrambling to make a \ncopper \n&gt; box, that&#39;s why I wanted more testing. I wish I could give some \n&gt; difinitive answers, but there just doens&#39;t seem to be any.\n&gt; &gt;  \n&gt; &gt;  Then, get a voice that seems to be Raudive, I would expect some \n&gt; signifgiant difference with the copper box, I&#39;m not hearing any \nthing \n&gt; any better. \n&gt; &gt;  \n&gt; &gt;  BTW, the mp3s are in my folder. \n&gt; &gt;  \n&gt; &gt;  Frank-S\n&gt; &gt;  \n&gt; &gt;  \n&gt; &gt; _________________________________________________________________\n&gt; &gt; Back to work after babyhow do you know when you&#39;re ready?\n&gt; &gt; http://lifestyle.msn.com/familyandparenting/articleNW.aspx?cp-\n&gt; documentid=5797498&ocid=T067MSN40A0701A\n&gt; &gt;\n&gt;"}