{"id": "10786", "subject": "Re: Not ordinary some old stuff voices.", "author": "purplespacefriend", "timestamp": "2008-04-30T21:33:08Z", "full_text": "I suppose, just don&#39;t think it&#39;s necessary to post every voice one \nreceives. That takes up alot of storage space after a while. \n\n F-S\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;LC Duplatt&quot; &lt;lcdupla@...&gt; wrote:\n&gt;\n&gt; Interesting post, FS.  \n&gt; \n&gt; I just like to think that everyone has their time and purpose.  \nYou \n&gt; receive what you are to receive for a purpose.  Others receive \nwhat \n&gt; they are to receive, for a purpose. \n&gt; \n&gt; It will all wash out in the end, Purple Princess of the Seven.  :)\n&gt; \n&gt; LC\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@&gt; \n&gt; wrote:\n&gt; &gt;\n&gt; &gt; \n&gt; &gt; From; http://en.wikipedia.org/wiki/Count_of_St_Germain &#39;Saint \n&gt; Germain is always associated with the color violet, the jewel \n&gt; amethyst, and the Maltese cross rendered in violet (usually the \niron \n&gt; cross style cross patee version); he is also regarded as \nthe &#39;Chohan \n&gt; of the Seventh Ray&#39;[13]  according to Theosophy, the Seven Rays \nare \n&gt; seven metaphysical principles that govern both individual souls \nand \n&gt; the unfolding of each 2,158 year long Astrological Age. Since \n&gt; according to Theosophy the next Astrological Age, the Age of \n&gt; Aquarius, will be governed by the Seventh (Violet) Ray (the Ray of \n&gt; Ceremonial Order), Saint Germain is sometimes called &#39;The Hierarch \nof \n&gt; the Age of Aquarius&#39;. According to the Ascended Master Teachings, \n&gt; Saint Germain is &#39;The God of Freedom for the Earth&#39;.&#39;\n&gt; &gt;  \n&gt; &gt;  Much to do with the Purple Princess, and the seven. I don&#39;t \nmean \n&gt; to sell others short, I just get a different level, and find \n&gt; regular &quot;this your auntie&quot; type EVPs kinda useless. Mostly I don&#39;t \n&gt; post every voice I get, just the ones that I thought was \noutstanding, \n&gt; but no one else hears.\n&gt; &gt;  \n&gt; &gt; Frank-S\n&gt; &gt; _________________________________________________________________\n&gt; &gt; Make i&#39;m yours. Create a custom banner to support your cause.\n&gt; &gt; http://im.live.com/Messenger/IM/Contribute/Default.aspx?\n&gt; source=TXT_TAGHM_MSN_Make_IM_Yours\n&gt; &gt;\n&gt;"}