{"id": "10808", "subject": "Re: skeptic: My response on Wiltshire Group site", "author": "purplespacefriend", "timestamp": "2008-05-02T04:24:23Z", "full_text": "Crap, I forgot, this is still Steve and Bruce&#39;s group, they are the \nreal EVP experts, just ask, they&#39;ll tell ya. I mean, geeze, Steve has \nwhat, six months experience?\n\n There is always these little clowns that want to show off to the \nworld, and claim they are to only experts.\n\n\n  I&#39;ve had enough!\n\n F-S\n\n--- In EVP-ITC@yahoogroups.com, &quot;Steve Hultay&quot; &lt;urkel23@...&gt; wrote:\n&gt;\n&gt; \n&gt; Sorry you found another reason to complain frank, but some people \nlike \n&gt; to hear others research and what they are getting.  I know that \nshot as \n&gt; well as many of your other e-mails are directed at me because your \nan \n&gt; angry bitter person, you may have noticed that i do not say \nanything \n&gt; bad about you. Why would 2 wrongs make a right? I seem to post some \n&gt; stuff from all different methods, maybe one will click and move us \nto a \n&gt; better level of communication.  There are other things than the \nfrank&#39;s \n&gt; box, is that why your mad?\n&gt; \n&gt; -Steve\n&gt; \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; \n&gt; &lt;purplealiengirl@&gt; wrote:\n&gt; &gt;\n&gt; &gt;  Hummmm, and yet you think this group is somhow more honest and \nopen? \n&gt; I \n&gt; &gt; was just wondering why yet another attempt at production was \n&gt; seemingly \n&gt; &gt; derailed, by get this--group members!? Or was it an outside \n&gt; influance? \n&gt; &gt; I wonder if any of these groups is worth the trouble. I already \nkeep \n&gt; &gt; the group e-mail off, cuz I don&#39;t care about someone&#39;s latest \nhundred \n&gt; &gt; recordings. It seems like just a bunch of showing off. &quot;I just \nposted \n&gt; &gt; the latest....blah-blah-blah-blah&quot; Who gives a crap? \n&gt; &gt; \n&gt; &gt;  Yeah, negative, maybe. \n&gt; &gt; \n&gt; &gt; \n&gt; &gt;  Frank-S\n&gt; &gt;\n&gt;"}