{"id": "1091", "subject": "Regenerative circuit - Wikipedia, the free encyclopedia", "author": "Ken Thomas", "timestamp": "2007-04-11T18:08:30Z", "full_text": "--0-29936515-1176314910=:22119\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nhttp://en.wikipedia.org/wiki/Regenerative_circuit\n   \n   \n  below is one-half of what im doing right now.  the other half is the puse position/pulse counting-forming to pulse width or ac ,power conversion\n   \n  the main point is that the voltage of two mixed signals is additive, not just the average power. and quantum noise is sequestered, squeezed and stays squoze.\n   \n  human &quot;cocktail party hearing&quot; does the same thing but has not been mechanically replicated till now.\n   \n   \n   \n   \n  &quot;...\n  However, recent experiments have shown that the self quenched super regenerative circuit may be operated at a level in between the regenerative and super-regenerative states. At these levels, something very interesting happens: A received narrow band FM (RF) signal can be set to heterodyne with the super regen detector&#39;s RF oscillations such that sum and difference frequencies are produced. The difference frequency, if close to the detector&#39;s quenching oscillation frequency, will lock onto and FM modulate the quench frequency. This produces a large variation in gain which exactly follows the FM modulation of the received signal. The gain variation creates a frequency to amplitude conversion (FM detection) of very high efficiency. To date, this effect has only been studied by electronics experimenters but could eventually lead to very high frequency, ultra low power FM receivers....&quot;\n\r\n--0-29936515-1176314910=:22119\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;div&gt;&lt;A href=&quot;http://en.wikipedia.org/wiki/Regenerative_circuit&quot;&gt;http://en.wikipedia.org/wiki/Regenerative_circuit&lt;/A&gt;&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;below is one-half of what im doing right now.&nbsp; the other half is the puse position/pulse counting-forming to pulse width or ac ,power conversion&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;the main point is that the voltage of two mixed signals is additive, not just the average power. and quantum noise is sequestered, squeezed and stays squoze.&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;human &quot;cocktail party hearing&quot; does the same thing but has not been mechanically replicated till now.&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;&quot;...&lt;/div&gt;  &lt;div&gt;However, recent experiments have shown that the self quenched super regenerative circuit may be operated at a level in between the regenerative and super-regenerative states. At these levels, something very interesting happens: A received\n narrow band FM (RF) signal can be set to heterodyne with the super regen detector&#39;s RF oscillations such that sum and difference frequencies are produced. The difference frequency, if close to the detector&#39;s quenching oscillation frequency, will lock onto and FM modulate the quench frequency. This produces a large variation in gain which exactly follows the FM modulation of the received signal. The gain variation creates a frequency to amplitude conversion (FM detection) of very high efficiency. To date, this effect has only been studied by electronics experimenters but could eventually lead to very high frequency, ultra low power FM receivers....&quot;&lt;/div&gt;\r\n--0-29936515-1176314910=:22119--"}