{"id": "10925", "subject": "Re: [EVP-ITC] Re: the junk- this is for everyone", "author": "Misty Dawn", "timestamp": "2008-05-17T02:59:34Z", "full_text": "--0-737757108-1210993174=:77223\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nhehehe just catching up now? Still busy in the basement building? It&#39;s ok you didnt miss much =) \n   \n  Misty\n   \n  \n\npurplespacefriend &lt;purplealiengirl@...&gt; wrote:\n          Oh, so that&#39;s why there wasn&#39;t any of the BS postings that I heard \nabout, so I mistakenly thought no big deal. Anyway, I don&#39;t like the \ncompition crap either, everyone wanting to be the onlyest expert, \nthat&#39;s how we end up with the Moons, Bruces, and who knows who else \nout there. I make the damn boxes and I&#39;m not even the expert on it! I \nthink 90% of the communication is for the person doing the recording, \nit&#39;s pretty much meaningless to anyone else. The entities already \nknow who you all are, they know everything about you, so y&#39;all might \nwant to put honor above above all else. \n\nF-S\n\n--- In EVP-ITC@yahoogroups.com, Misty Dawn &lt;bulletbabea@...&gt; wrote:\n&gt;\n&gt; This is pretty much directed to everyone.\n&gt; \n&gt; Hmm lets see I worked 2pm-11 last night then turn around and got \nup at 4 am to work 6-3 today so if we do the math we will see Misty \njust spent 18 of the last 24 hours on my feet and running around \nhaving to be in charge LOL. So please dont think I am going to spend \nmy few hours freetime playing babysitter here.\n&gt; \n&gt; Quite frankly all involved have been told I do not have time for \nthier online dramafests. They can go fight each other all they wish \nto somewhere else its stupid. I am not thier mother and tho it is \nMother&#39;s day I do not feel any motherly tendancies towards anyone and \nthat includes my friends. \n&gt; \n&gt; As for research, while everyone is so wrapped up in the feeding \nfrenzy against one another elsewhere, I still use my freetime to do \nresearch or spend time with those I actually get along with. I would \nsuggest they give it a try. If they enjoy fighting...good for them \nmore power to them and have fun...someplace else. \n&gt; \n&gt; People here seem to think I am the boss. I tell you all now YOU \nare the boss of YOURSELF. You speak for yourself, your own actions \nand everything you say and do will be a representation of who you \nreally are. Have a good look in the mirror to make sure that image \ndoesnt resemble some of the things you hate about others. Positive, \nnegative, good, evil, its up to you just like it is up to all spirits \nto choose how they treat others.\n&gt; \n&gt; I cant choose for you. But I will say I am here to learn more \nabout ITC and do research. What are you guys here for? If its not one \nof those things then you simply joined the wrong group. Keep going \nyou will find the right one they pretty much have one for everything \nthese days.\n&gt; \n&gt; As for the BS we have been subjected to enough of it so people \nwho post junk against each other simply will get it deleted and \nposting privledges moderated or removed. Find something better to do \nor someplace better to do it. \n&gt; \n&gt; I do not control you all. Nor do I wish to. And I do not have to \ntake a side in a fight I dont believe in.\n&gt; \n&gt; So my side is, at the end of the day I am tired. The fighting is \ndumb. And I am done wasting another minute discussing it. Those who \npost here should be posting about ITC or do not bother to post. If \nyou feel that you have to fight with each other, fine go fight...I \njust dont want to be forced to read it nor do the members of this \ngroup who are here for the RIGHT reasons.\n&gt; \n&gt; On that note I hope that you all have a great day. For all the \nmoms out there HAPPY MOTHERS DAY! I certainly hope it was a good one \n=)\n&gt; \n&gt; Misty\n&gt; \n&gt; \n&gt; \n&gt; ---------------------------------\n&gt; Be a better friend, newshound, and know-it-all with Yahoo! Mobile. \nTry it now.\n&gt;\n\n\n\n                           \n\n       \r\n--0-737757108-1210993174=:77223\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;div&gt;hehehe just catching up now? Still busy in the basement building? It&#39;s ok you didnt miss much =) &lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Misty&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;purplespacefriend &lt;purplealiengirl@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/div&gt;  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;div&gt;Oh, so that&#39;s why there wasn&#39;t any of the BS postings that I heard &lt;BR&gt;about, so I mistakenly thought no big deal. Anyway, I don&#39;t like the &lt;BR&gt;compition crap either, everyone wanting to be the onlyest expert, &lt;BR&gt;that&#39;s how we end up with the Moons, Bruces, and who knows who else &lt;BR&gt;out there. I make the damn\n boxes and I&#39;m not even the expert on it! I &lt;BR&gt;think 90% of the communication is for the person doing the recording, &lt;BR&gt;it&#39;s pretty much meaningless to anyone else. The entities already &lt;BR&gt;know who you all are, they know everything about you, so y&#39;all might &lt;BR&gt;want to put honor above above all else. &lt;BR&gt;&lt;BR&gt;F-S&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;, Misty Dawn &lt;bulletbabea@&lt;WBR&gt;...&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; This is pretty much directed to everyone.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Hmm lets see I worked 2pm-11 last night then turn around and got &lt;BR&gt;up at 4 am to work 6-3 today so if we do the math we will see Misty &lt;BR&gt;just spent 18 of the last 24 hours on my feet and running around &lt;BR&gt;having to be in charge LOL. So please dont think I am going to spend &lt;BR&gt;my few hours freetime playing babysitter here.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Quite frankly all involved have been told I do not have time for &lt;BR&gt;thier online dramafests. They can go fight\n each other all they wish &lt;BR&gt;to somewhere else its stupid. I am not thier mother and tho it is &lt;BR&gt;Mother&#39;s day I do not feel any motherly tendancies towards anyone and &lt;BR&gt;that includes my friends. &lt;BR&gt;&gt; &lt;BR&gt;&gt; As for research, while everyone is so wrapped up in the feeding &lt;BR&gt;frenzy against one another elsewhere, I still use my freetime to do &lt;BR&gt;research or spend time with those I actually get along with. I would &lt;BR&gt;suggest they give it a try. If they enjoy fighting...good for them &lt;BR&gt;more power to them and have fun...someplace else. &lt;BR&gt;&gt; &lt;BR&gt;&gt; People here seem to think I am the boss. I tell you all now YOU &lt;BR&gt;are the boss of YOURSELF. You speak for yourself, your own actions &lt;BR&gt;and everything you say and do will be a representation of who you &lt;BR&gt;really are. Have a good look in the mirror to make sure that image &lt;BR&gt;doesnt resemble some of the things you hate about others. Positive, &lt;BR&gt;negative, good, evil, its up to you just like it is up to all\n spirits &lt;BR&gt;to choose how they treat others.&lt;BR&gt;&gt; &lt;BR&gt;&gt; I cant choose for you. But I will say I am here to learn more &lt;BR&gt;about ITC and do research. What are you guys here for? If its not one &lt;BR&gt;of those things then you simply joined the wrong group. Keep going &lt;BR&gt;you will find the right one they pretty much have one for everything &lt;BR&gt;these days.&lt;BR&gt;&gt; &lt;BR&gt;&gt; As for the BS we have been subjected to enough of it so people &lt;BR&gt;who post junk against each other simply will get it deleted and &lt;BR&gt;posting privledges moderated or removed. Find something better to do &lt;BR&gt;or someplace better to do it. &lt;BR&gt;&gt; &lt;BR&gt;&gt; I do not control you all. Nor do I wish to. And I do not have to &lt;BR&gt;take a side in a fight I dont believe in.&lt;BR&gt;&gt; &lt;BR&gt;&gt; So my side is, at the end of the day I am tired. The fighting is &lt;BR&gt;dumb. And I am done wasting another minute discussing it. Those who &lt;BR&gt;post here should be posting about ITC or do not bother to post. If &lt;BR&gt;you feel that\n you have to fight with each other, fine go fight...I &lt;BR&gt;just dont want to be forced to read it nor do the members of this &lt;BR&gt;group who are here for the RIGHT reasons.&lt;BR&gt;&gt; &lt;BR&gt;&gt; On that note I hope that you all have a great day. For all the &lt;BR&gt;moms out there HAPPY MOTHERS DAY! I certainly hope it was a good one &lt;BR&gt;=)&lt;BR&gt;&gt; &lt;BR&gt;&gt; Misty&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; ------------&lt;WBR&gt;---------&lt;WBR&gt;---------&lt;WBR&gt;---&lt;BR&gt;&gt; Be a better friend, newshound, and know-it-all with Yahoo! Mobile. &lt;BR&gt;Try it now.&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/div&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;p&gt;&#32;\n\n      \r\n--0-737757108-1210993174=:77223--"}