{"id": "10938", "subject": "Re: [EVP-ITC] New to group", "author": "Rhonda W", "timestamp": "2008-05-19T17:32:20Z", "full_text": "--0-920186026-1211218340=:42305\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nWelcome to the group Tim =)\n   \n  Rhonda\n\nTimothy Wise &lt;TDWise357@...&gt; wrote:\n          Greetings everyone! My name is Tim Wise. I am a lead investigator\nfor the Bluegrass Ghost Chasers in Frankfort, KY. I recently found\nthe video instructions by UFO geek on the hack for the RS 12-469 radio\nand have built myself a small Ghost box. I&#39;ve become intrigued with\nthe prospect of taking this with the group on investigations and\nshould have a chance to take it with me to Waverly Hills Sanatorium\nlate next month. I also found this group through Mike&#39;s Blog site. \nAny and all tips and opinions will be greatly appreciated and if I\ncome up with anything I&#39;ll make sure and share with this group. \n\n\n\n                           \n\n       \r\n--0-920186026-1211218340=:42305\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;div&gt;Welcome to the group Tim =)&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Rhonda&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;Timothy Wise &lt;TDWise357@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/div&gt;  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;div&gt;Greetings everyone! My name is Tim Wise. I am a lead investigator&lt;BR&gt;for the Bluegrass Ghost Chasers in Frankfort, KY. I recently found&lt;BR&gt;the video instructions by UFO geek on the hack for the RS 12-469 radio&lt;BR&gt;and have built myself a small Ghost box. I&#39;ve become intrigued with&lt;BR&gt;the prospect of taking this with the group on investigations and&lt;BR&gt;should have a chance to take it with me to Waverly Hills\n Sanatorium&lt;BR&gt;late next month. I also found this group through Mike&#39;s Blog site. &lt;BR&gt;Any and all tips and opinions will be greatly appreciated and if I&lt;BR&gt;come up with anything I&#39;ll make sure and share with this group. &lt;BR&gt;&lt;BR&gt;&lt;/div&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;p&gt;&#32;\n\n      \r\n--0-920186026-1211218340=:42305--"}