{"id": "10954", "subject": "New here...", "author": "Isobael", "timestamp": "2008-05-20T15:57:25Z", "full_text": "Hello!  My name is Sandie.  I live in Renton, WA.\n\nI&#39;ve been fascinated with the paranormal since I was young.  My\nmother&#39;s side of the family is sensitive to the paranormal and I have\none aunt that is a medium, albeit a very reluctant one.  I should also\nmention that my mother&#39;s side of the family is from Taiwan and it the\nculture can be very superstitious, hence my aunt&#39;s reluctance.\n\nI think I&#39;ve always had some experience with the paranormal, from\nplaces I lived to places I&#39;ve visited, but it&#39;s very rare that I see\nthem.  Unfortunately, I didn&#39;t inherit that ability.  I&#39;ve only had\none experience with seeing a spirit/ghost when I was awake.\n\nI&#39;ve recently started to record EVPs, and it&#39;s been trying to say the\nleast.  If I&#39;m getting anything, I don&#39;t hear it on playback. \nHOWEVER, recently I visited a cemetery to show my daughter our\nrelatives&#39; headstones and we wandered the place with a recorder, as\nwell as took pictures.\n\nUpon playback, I notated 23 instances of possible EVPs, 5 or 6 were\nclear enough to actually hear specific words.  Whether or not they&#39;re\nwhat I think they are is another question.  The others I pulled from\nthe master are unknowns and questionables, but suspected EVPs.  I just\ncan&#39;t make it out.\n\nI use Audacity, which I really do not like.  I had Audition, a full\nversion, but lost it when my computer crashed, and I loved that one.  \n\nAnyway, I&#39;ll upload the EVPs.  If anyone can help in verifying what I\nthink is being said, I&#39;d appreciate it.\n\nI will note that these are direct copies from the master, so there&#39;s\nbeen no cleanup done to them.  Mostly because I need to learn to use\nAudacity&#39;s filtering and noise reduction without removing the voices.\n\nI have them in .wav files, so I&#39;ll convert them to .mp3 and upload\nthem, to save on space.\n\n=)\n\nSandie"}