{"id": "10988", "subject": "Re: Kill or be eaten  Re: [EVP-ITC] Re: Bugs!?", "author": "Wiliam Clarke", "timestamp": "2008-05-22T14:21:16Z", "full_text": "he oaches in a lo ida ho el messed my ip up, I le ha mo el hell on he same day we go he e.  I would a he sleep on he beach ins ead o ha ing a chance o b inging ha shi home.  Bu wa ch ou o sand leas, and ha s ano he s o y!\n \nWilliam--- On Thu, 5/22/08, Ca ol B. w o e:\nF om: Ca ol B. Subjec : Re: Kill o be ea en Re: [EVP-ITC] Re: Bugs!?To: EVP-ITC@yahoog oups.comDa e: Thu sday, May 22, 2008, 1:35 PM\n\n\nOMG...The size o he oaches in Cabo blew me away oo!! We couldn' belie e i !! Se iously a leas 3 inches in leng h...Ca ol B.> On Wed, 21 May 2008, ps ponies w o e:>>> OMG when I was in Cabo San Lucas he cock oachs we e he size o a s!>> and he e we e se e al spide /bug hings I ha e no idea wha hey we e.>> I made su e I checked be ween he shee s be o e I c awled in o bed>> e e ynigh .>>>> Kay>>>>>> Ron Lede e on iko@yahoo. com> w o e:>> Ah, a subjec I can commen on wi h au ho i y... killing an s and hings>> ha s ing is my special y he e in Mexico...you' ll lo e he simple>> answe ...laund y de e gen . I can ell you s o ies o iny c azy an s o>> an s as la ge as hal you humb... ied all kinds o \n hings like>> chlo ine...acid. ..bu a hand ull o cheap, cheap, blue laund y>> de e gen mixed in wa e will kill an s on he spo ...dead, done, gone,>> eady o an EVP session. Wha a blessing since I am highly alle gic o>> all pes icides. Ge ing an s ou o an elec ical sys em is ano he >> ma e . I ha e hem unning along by house elec ical lines and mus >> wai o hem o show hei ace be o e I soap em. Ron L>>>>>> --- On Tue, 5/20/08, LC Dupla lcdupla@yahoo. com> w o e:>> F om: LC Dupla lcdupla@yahoo. com>>> Subjec : [EVP-ITC] Re: Bugs!?>> To: EVP-ITC@yahoog oups .com>> Da e: Tuesday,\n May 20, 2008, 4:26 PM>>>> Awe, yes... he c azy aspbe y an s. How in he heck does one s op>> hem wi hou a na u al p eda o o ea he begeezus ou o 'em? They>> a e ungodly, like a plague sen igh om Moses! ;)>>>> LC>>>> --- In EVP-ITC@yahoog oups .com, \"pu plespace iend\">> w o e:>>>>>> Tha could be i oo, as I hea d a s o y abou iny an s in ading>> on>>> C2C he o e h nigh .>>>>>> FS>>>>>> --- In EVP-ITC@yahoog oups .com, ps ponies w o e:>>>>>>>> I hea he second pa as \"The An s In ade\">>>>>>>> Kay>>>>>>>> F ank Sump ion w o e:>>>> .hmmessage P { ma gin:0px;\n padding:0px }>>> body.hmmessage { FONT-SIZE: 10p ; FONT-FAMILY: Tahoma } Ne e >>> hough o insec s as a soul g oup be o e.>>>>>>>> F ank-S>>>>>>>>>>>> ------------ --------- --------- --->>>> Change he wo ld wi h e-mail. Join he i'm Ini ia i e om>>> Mic oso .>>>>>>>>>>>>>>>>>>>>>>>>>>>>> ------------ --------- --------- ---> Looking o he pe ec gi ? Gi e he gi o Flick !"}