{"id": "11011", "subject": "Re: Wood", "author": "purplespacefriend", "timestamp": "2008-05-23T06:33:15Z", "full_text": "Yeah, now they call just about anything that uses a swept radio a \nFrank&#39;s Box, but I guess I started it.\n\n Frank-S \n\n--- In EVP-ITC@yahoogroups.com, Mick &lt;micksghosts@...&gt; wrote:\n&gt;\n&gt; I started doing evp&#39;s about a year ago. I use an Olympus digital \n&gt; recorder. I have had some luck. I was given a copy of Gold Wave \nrecently \n&gt; and don&#39;t know the program yet. I saw that someone offered up a \nlink to \n&gt; a free tool but I could only find copies that cost.\n&gt; \n&gt; About three weeks ago I had a friend over. He has a pretty \nsuccessful \n&gt; investigative team in my area. One of his members brought \nthe &#39;Franks \n&gt; box&#39; to show me since he knows of my interest in ITC. We didn&#39;t use \nit \n&gt; however. They had among other instruments, a K-II emf meter. \nActually \n&gt; they had about 3 meters of different types. I asked if he could use \nthe \n&gt; box but he said he didn&#39;t know it well enough yet to label anything \n&gt; paranormal. He did turn it on and there was a lot of noise and \nchatter.  \n&gt; They did quit a few videos as well. The results were not that \nfavorable \n&gt; with the video but the emf showed allot of activity. We were able \nto \n&gt; &#39;communicate&#39; using the K-II and asking yes - no questions. I don&#39;t \nhave \n&gt; the evp&#39;s yet. I do have my own evp&#39;s from my apartment but not \nfrom \n&gt; that night. I also have some from a couple cemeteries that I did. I \nlike \n&gt; going out by myself which I guess is a big no no in the field of \n&gt; paranormal investigation but it hasn&#39;t bothered me much at all.\n&gt; \n&gt; I am trying to get his friend to bring the box back over. I became \n&gt; interested in ITC about 11 years ago but never really involved \nmyself \n&gt; into it. Someone took a picture of me in my kitchen. When the film \nwas \n&gt; developed, a face appeared in the window behind me. There was no \nway a \n&gt; person could have been outside my apartment window. I started doing \nsome \n&gt; research on line and that was how I found out about ITC and evp. A \nfew \n&gt; years later I saw White Noise and my interest was sparked all over \n&gt; again. I have read about the &#39;Brown box&#39; and was really excited \nwhen my \n&gt; buddies friend brought over &#39;Franks box&#39;. With the popularity of \nall the \n&gt; paranormal shows and groups I have decided to concentrate on evp. I \nam \n&gt; now considered an &#39;investigator in training&#39; but my interest are \npurely \n&gt; personal.\n&gt; \n&gt; I am assuming that you are the &#39;Frank&#39; of my friends &#39;Frank&#39;s box&#39;. \nI \n&gt; was really surprised at the coincident when I joined this evp group \nto \n&gt; find out that it is your group.\n&gt; \n&gt; I hope to learn allot from this group and thanks for having me as a \nmember.\n&gt; \n&gt; Mick\n&gt; \n&gt; PS - I was considering moving to Florida but after reading all \nthese \n&gt; &#39;bog&#39; post, I may move west.\n&gt; \n&gt; Frank Sumption wrote:\n&gt; \n&gt; &gt; This is one of the wood boxes.\n&gt; &gt;  \n&gt; &gt;  Frank-S\n&gt; &gt;\n&gt; &gt; ------------------------------------------------------------------\n------\n&gt; &gt; Keep your kids safer online with Windows Live Family Safety. Help \n&gt; &gt; protect your kids. \n&gt; &gt; &lt;http://www.windowslive.com/family_safety/overview.html?\nocid=TXT_TAGLM_WL_Refresh_family_safety_052008&gt; \n&gt; &gt;\n&gt; &gt; \n&gt; &gt; ------------------------------------------------------------------\n------\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; ------------------------------------------------------------------\n------\n&gt; &gt;\n&gt; \n&gt; -- \n&gt; If you have an interest in the paranormal then check out:\n&gt; http://www.myspace.com/micksghosts\n&gt;"}