{"id": "11033", "subject": "Re: [EVP-ITC] Re: Can&#39;t seem to capture any evp&#39;s........suggestions would be apprectiated....", "author": "Pridegrl Neverumind", "timestamp": "2008-05-25T15:29:40Z", "full_text": "--0-1901644067-1211729380=:25168\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nthats freaky-deaky Allen.....\n  the message was one thing when you heard it with your ears and another when you listend tot he recording....\n  the other day when i got the file about them being able to see me- when the one guy said &quot;spooky &#39;... i actually heard that with my ears VERY loud and clear- i thought that would be the first thing to jump out at me when i reviewed the recording.. however- the word &#39;spooky &#39;which was the loudest to my ears, was one of the quietest voices when heard on the tape.....\n  life ( and apparently death ) is strange \n  ;)\nCharm\n\nAllen &lt;amuck944@...&gt; wrote:\n          I use a couple different digital voice recorders, but have recorded\nmost of my good EVP&#39;s with a Sony ICD-P320 just using the internal\nmicrophone. Some feel you need to use an external microphone, but I\ntend to set the recorder down and let it do it&#39;s thing. I get more\nEVP&#39;s when it is just sitting there unattended or if we are talking\nabout random stuff than I do if asking questions. I cannot hold my\nrecorders still enough in my hands to not get noise. An external\nmicrophone would help that, but I would rather just set the recorder\ndown. Maybe some day I will get one and give it a try. \n\nThe last investigation we went on, I got 12 good EVP&#39;s. Most were\nshort single word recordings, but they required no processing other\nthan a volume adjustment on a couple of the quieter ones. Other\ninvestigations I get nothing. We would have activity, but nothing\nwould be recorded. Also, I have recorded stuff only to have it\ndisappear off the recorder or computer. Guess someone didn&#39;t want it\nto be shared.\n\nTopics to talk about that seem to draw out the spirits are food,\nalcohol, drugs and smoking. Guess some of the spirits miss them and\nif given a chance will join in and let you know their feelings. I\nhaven&#39;t tried talking about sex, but if the other topics work, it\nmight also. I don&#39;t think there is anything magic about getting\nEVP&#39;s. It is just a matter of being around someone with something to\nsay. Also, I don&#39;t think the location really has that much to do with\nit either. I can get recording from my house almost as easily as a\n&quot;haunted&quot; location. To me, the negative spirits tend to be more vocal\nbut will give false information just to mess with you. I believe\nlittle if anything I record, but simply use it as evidence of\nactivity. \n\nI prefer digital for the ease of distributing and archiving\nrecordings. The only editing I do is adjusting the gain and cutting\nout parts of the recording that catch my interest. As a personal\npreference, I throw out any EVP&#39;s that need any filtering or\nmanipulation to hear. If it can&#39;t be heard as it is (excluding volume\nadjustments), I don&#39;t use it. I promise I am not trying to start an\nargument. As I said, it is just a personal preference. \n\nOne of the best recordings I have was from my camcorder. We could\nalso hear the spirit talking with our ears and were able to briefly\nhave two-way interaction. The funny thing is, when asked a question,\nthe three of us present heard it say &quot;yes&quot;, but on the audio, it\nclearly said &quot;no&quot;. \n\nAllen\nwww.paranormalsource.com \n\n\n\n                           \n\n       \n---------------------------------\nLooking for the perfect gift? Give the gift of Flickr!\r\n--0-1901644067-1211729380=:25168\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;div&gt;&lt;STRONG&gt;&lt;FONT color=#7f007f&gt;thats freaky-deaky Allen.....&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/div&gt;  &lt;div&gt;&lt;STRONG&gt;&lt;FONT color=#7f007f&gt;the message was one thing when you heard it with your ears and another when you listend tot he recording....&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/div&gt;  &lt;div&gt;&lt;STRONG&gt;&lt;FONT color=#7f007f&gt;the other day when i got the file about them being able to see me- when the one guy said &quot;spooky &#39;... i actually heard that with my ears VERY loud and clear- i thought that would be the first thing to jump out at me when i reviewed the recording.. however- the word &#39;spooky &#39;which was the loudest to my ears, was one of the quietest voices when heard on the tape.....&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/div&gt;  &lt;div&gt;&lt;STRONG&gt;&lt;FONT color=#7f007f&gt;life ( and apparently death ) is strange &lt;/FONT&gt;&lt;/STRONG&gt;&lt;/div&gt;  &lt;div&gt;&lt;FONT color=#7f007f&gt;&lt;STRONG&gt;;)&lt;BR&gt;Charm&lt;/STRONG&gt;&lt;BR&gt;&lt;/FONT&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;Allen &lt;amuck944@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/div&gt;  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT:\n #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;div&gt;I use a couple different digital voice recorders, but have recorded&lt;BR&gt;most of my good EVP&#39;s with a Sony ICD-P320 just using the internal&lt;BR&gt;microphone. Some feel you need to use an external microphone, but I&lt;BR&gt;tend to set the recorder down and let it do it&#39;s thing. I get more&lt;BR&gt;EVP&#39;s when it is just sitting there unattended or if we are talking&lt;BR&gt;about random stuff than I do if asking questions. I cannot hold my&lt;BR&gt;recorders still enough in my hands to not get noise. An external&lt;BR&gt;microphone would help that, but I would rather just set the recorder&lt;BR&gt;down. Maybe some day I will get one and give it a try. &lt;BR&gt;&lt;BR&gt;The last investigation we\n went on, I got 12 good EVP&#39;s. Most were&lt;BR&gt;short single word recordings, but they required no processing other&lt;BR&gt;than a volume adjustment on a couple of the quieter ones. Other&lt;BR&gt;investigations I get nothing. We would have activity, but nothing&lt;BR&gt;would be recorded. Also, I have recorded stuff only to have it&lt;BR&gt;disappear off the recorder or computer. Guess someone didn&#39;t want it&lt;BR&gt;to be shared.&lt;BR&gt;&lt;BR&gt;Topics to talk about that seem to draw out the spirits are food,&lt;BR&gt;alcohol, drugs and smoking. Guess some of the spirits miss them and&lt;BR&gt;if given a chance will join in and let you know their feelings. I&lt;BR&gt;haven&#39;t tried talking about sex, but if the other topics work, it&lt;BR&gt;might also. I don&#39;t think there is anything magic about getting&lt;BR&gt;EVP&#39;s. It is just a matter of being around someone with something to&lt;BR&gt;say. Also, I don&#39;t think the location really has that much to do with&lt;BR&gt;it either. I can get recording from my house almost as easily as a&lt;BR&gt;&quot;haunted&quot; location.\n To me, the negative spirits tend to be more vocal&lt;BR&gt;but will give false information just to mess with you. I believe&lt;BR&gt;little if anything I record, but simply use it as evidence of&lt;BR&gt;activity. &lt;BR&gt;&lt;BR&gt;I prefer digital for the ease of distributing and archiving&lt;BR&gt;recordings. The only editing I do is adjusting the gain and cutting&lt;BR&gt;out parts of the recording that catch my interest. As a personal&lt;BR&gt;preference, I throw out any EVP&#39;s that need any filtering or&lt;BR&gt;manipulation to hear. If it can&#39;t be heard as it is (excluding volume&lt;BR&gt;adjustments)&lt;WBR&gt;, I don&#39;t use it. I promise I am not trying to start an&lt;BR&gt;argument. As I said, it is just a personal preference. &lt;BR&gt;&lt;BR&gt;One of the best recordings I have was from my camcorder. We could&lt;BR&gt;also hear the spirit talking with our ears and were able to briefly&lt;BR&gt;have two-way interaction. The funny thing is, when asked a question,&lt;BR&gt;the three of us present heard it say &quot;yes&quot;, but on the audio, it&lt;BR&gt;clearly said &quot;no&quot;.\n &lt;BR&gt;&lt;BR&gt;Allen&lt;BR&gt;www.paranormalsourc&lt;WBR&gt;e.com &lt;BR&gt;&lt;BR&gt;&lt;/div&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;p&gt;&#32;\n      &lt;hr size=1&gt;\nLooking for the perfect gift?&lt;a href=&quot;http://www.flickr.com/gift/&quot;&gt;&lt;b&gt; Give the gift of Flickr!&lt;/b&gt;&lt;/a&gt;\r\n--0-1901644067-1211729380=:25168--"}