{"id": "1105", "subject": "Re: [EVP-ITC] Re: Optical (flame) Microphone and FM Sweep", "author": "RetroCom", "timestamp": "2007-04-12T14:00:25Z", "full_text": "Interesting, it was written accounts of how old time gas lights responded to sounds/vibrations of orchestra&#39;s that got me researching the properties to start with. The flame is only microphonic in a limited range of flame height. This is easily controlled with the wick adjustment on a modern oil lamp. Thanks for the supporting history lesson Ken. \nDave\n\n--- kennnthomas2000@... wrote:\n\nFrom: Ken Thomas &lt;kennnthomas2000@...&gt;\nTo: EVP-ITC@yahoogroups.com\nSubject: Re: [EVP-ITC] Re: Optical (flame) Microphone and FM Sweep\nDate: Thu, 12 Apr 2007 06:15:02 -0700 (PDT)\n\nreal ghosts love flickering flames of all kinds.  400 years of  modern english literature, written by astute observers, attest to that.  when a candle is just on the verge of blinking out, it makes the most sensitive amplifier/modulator.  kelvin, faraday,davy,pupin did all kinds of experiments in their spare time with coal-shovel thermomagnetic microphones, corroded wire joints, flames and arcs of all kinds that they got from persistent accounts from the general public. later crookes and lodge went all around the same circuit with improved equipment. many references to the &quot;sensitive flame&quot;  &quot;sensitive arc&quot;  in the pop sci publishing of the gaslight era--often written by giants like mendeleev- which,not coincidentally is the setting of hg wells&#39; ,&quot;the time machine&quot;\n\nRetroCom &lt;vfp19968@...&gt; wrote:          Frank, I&#39;m not misleading anyone, the optical microphone using a flame in and of itself works very well in the capture of Spirit voices. I don&#39;t know exactly why, after almost two years I am still studying it although I can speculate it could because there is a lot going on during it&#39;s use. Change of state from liquid to vapor to heat and light, IR radiation, thermal noise and some processes I am missing or unaware of. The radio sweep is used as a source of sound samples, the microphone also works well using music or plain speech. The limited high frequency response also seems to act as a built-in bandpass filter. I&#39;m not using anything complicated or out of the reach of a Wal-Mart or K-Mart shopper. I&#39;m using an off the shelf oil lamp with a 3/4 inch wide flat wick, a phototransistor from Radio Shack and an FM radio. There is more to the flame microphone then modulated light, I can modulate the DC feeding a flashlight or and\n LED and not get the same results. Here is an exchange using the optical microphone and FM radio sweep, my voice is reduced by 10db.\nDave: (NOT EVP) &#39;How many of you are are testing today?&#39;\n\nResponse : &quot;Fourty Seven&quot;\n\nDave: &#39;Please state your name, thank you&#39;\n\nResponse : &quot;Ingrid&quot;\n\n\n\n\n\nMaybe it&#39;s dumb question, but..................\n\nIf the flame is being &quot;modulated&quot; by air movements caused by \natmosphereic sound pressure waves, so the flame varies at an audio \nrate, then those flame variations are picked up via the photo \ntransistor and converted to electrical signals...what&#39;s the difference \nbetween the optical mic, and an accoustic mic? And why would one want \nto introduce yet another seemingly exotic piece of hardware?\n\nI know it&#39;s interesting, but it really has nothing to do with how to \nget ghost voices, and maybe misleading to some that are searching for \nthat magic technology. \n\n\nFrank"}