{"id": "11101", "subject": "Hi all you EVP Buffs", "author": "Ralph Smith", "timestamp": "2008-05-30T04:21:27Z", "full_text": "Hi everyone New and Old ( meaning been here awhile LOL not age ),\n\n It&#39;s me Ralph the Ghost Hunter again. I see things have changed since \nI been away. Seems more civilized and that&#39;s a good thing. Well juat \nwanted to tell you all about some EVP&#39;s I got at my place of work. It \nseems we have a portal to Hell or something in our men&#39;s room LOL. I \nhave gotten quite a few EVP&#39;s(Tradional) in the men&#39;s room. This past \nfew days I got a couple of interesting ones. I was on break from work \nso I took my DR60 digital recorder and decided to check the room for \nany spirits. I was in the stall(lol) asking if there were any spirits \nthere with me, when I looked at my recorder and didn&#39;t see it pick up \nanything(have it on VOR activation)so I decided to go to the sink area.\nI start asking if there are any spirits here with me and I said Is \nanyone here? I saw that the recorder was picking up sound. So I played \nit back and I heard someone say ( mind you I was all alone )&quot; Here \ncomes Lucifer&quot; then after I asked &quot; Is anyone here ? &quot; A weird voice \nsays &quot; There are all kinds of Spirits ... here (here is kind of hard \nto hear).&quot; So I&#39;m thinking if the first voice said &quot; Here comes \nLucifer &quot; the second voice might have been &quot;Lucifer&quot; himself saying of \nall the Spirits there. It&#39;s a creepy EVP to say the least. So what do \nyou think could it have been Lucifer and could I be picking up a \nstraight line to Hell or what ? Just something to think about. I got \ngoose Bumps just thinking about it. Well anyways that&#39;s what went on. \nI hope you people are all doing okay. I also think I have taken a \npicture of a shadow person down in Gettysburg in the Triangular Field \nthis past Nov. I&#39;m still studying it. Hey it&#39;s nice to see everyone \ngetting along that&#39;s great. You all take care and I will let you know \nof what other things I get in my search for the Paranormal. Have a \ngreat day all.\n\nRegards,\n\nRalph the Ghost Hunter (aka..GhosttHostt)\nS.P.I.R.I.T. Paranormal Investigation Team\nOf Central PA."}