{"id": "11124", "subject": "Re: [EVP-ITC] S&#39;more(OMG REEEEES!!!) hehe", "author": "alofbama@netscape.com", "timestamp": "2008-05-31T23:58:58Z", "full_text": "Yah, I keep askin' abou ha olympic body bumpin' bu he c owd I go down he e in Ala. a e Me hodis s, I hink, and won' say ha dly a da m hing. They like o ea , oo. One mo ning I b ough in co ee and a cinnamon oll and hough hey we e going o ake i away om me. I asked i hey'd like a cup, and hey allowed as how hey jus like o smell mine. Now, I dunno abou you guys, bu I don' ecall ge ing sni ed by a spi i and I didn' app ecia e hei one ei he . One, named Annie, li s all he ime, oo. Go a p e y oice slung on he e. Uhooo, and ha 's abou all I know abou Annie, eally, 'cep she was bo n in 1840.Al--- hondak1973@yahoo.com w o e:F om: Rhonda W To: EVP-ITC@yahoog oups.comSubjec : Re: [EVP-ITC] S'mo e(OMG REEEEES!!!) heheDa e: Sa , 31 May 2008 13:25:02 -0700 (PDT)\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n \r\n LOL Peeping Rees!!!!....jus emind me when you do die( ia adio o wha e e de ice u choose o communica e h u) o \" ake i o ake i allllll o \" and o do i wi h some boo y bumpin unes hahahaha\r\n \r\n LOL  u oo unny\r\nRhonda\r\n \r\nPS:\r\nReeses peanu bu e cups a e my a e oo....I don ea chocola e bu once a week and i s ALWAYS hose and who he heck can e e ea jus 1? ahahaha  Im lucky Im no o e 250 pounds anymo e.... hose a e my only ice as a as ea ing habi s YUM! (134lbs now wooooooohooooo!)--- On F i, 5/30/08, Wiliam Cla ke w o e:\r\nF om: Wiliam Cla ke Subjec : Re: [EVP-ITC] S'mo eTo: EVP-ITC@yahoog oups.comDa e: F iday, May 30, 2008, 6:16 AM\r\n\r\n\r\n\r\n\r\n\r\n\r\nI knew ha hey check ou he women when he a e naked!  I I was a ghos I would oo.  Whoa! Some hing o look o wa d oo when I die!  (ladies I'm jus joking please don' ake i pe sonal)--- On F i, 5/30/08, F ank Sump ion w o e:\r\nF om: F ank Sump ion Subjec : [EVP-ITC] S'mo eTo: \"G oup\" Da e: F iday, May 30, 2008, 5:06 AM\r\n\r\n\r\nR= andom, L=Linea .  F ank-S\r\n\r\nChange he wo ld wi h e-mail. Join he i’m Ini ia i e om Mic oso . \r\n\r\n\r\n \r\n \r\n\r\n \r\n \r\n\t\r\n\t\r\n\t\r\n\t\r\n\r\n\r\n\t\r\n\r\n\r\n\t\r\n\t\r\n\t\r\n\t\r\n\t\r\n\r\n Ne scape.  Jus he Ne You Need."}