{"id": "11157", "subject": "Re: [EVP-ITC] question", "author": "alofbama@netscape.com", "timestamp": "2008-06-03T01:22:20Z", "full_text": "Lau a,Thanks. Yes, e en in ad e si y, I ha e much o be hank ul o . And I am hank ul. Go a beau i ul woman who lo es me, pu s up wi h me, and I should ocus on he wonde ul \"nows\" ins ead o he nega i e \"wha -i 's\" o he u u e. I onically, one o my a o i e no el cha ac e s is c iminalis Lincoln Rhyme, he quad aplegic, who can mo e only one inge . He has he use o ha one inge and his b ain o sol e c imes. I won' ha e all his echnology i hings so sou h o me, bu he poin is his cha ac e makes maximum use o wha he's go . I'm mo e dep essed han \"mean\" o mad a he wo ld -- I see li e passing me by as I ge slowe and slowe , bu I guess I need o look a ound and ind mo e o wha 's possible \"now\" and y o achie e i .....Al--- ghuny1@yahoo.com w o e:F om: Lau a Kimbe ley To: EVP-ITC@yahoog oups.comSubjec : Re: [EVP-ITC] ques ionDa e: Mon, 2 Jun 2008 15:50:43 -0500 (CDT)\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n \r\n Al,\r\n \r\nChallenges a e oad blocks o lea ning...... ha s all hey a e. Simply pu , you o nua e ha you only shake and ha e 2 inge o ype.\r\n \r\nThe e a e many ha wan o do e p and can' .why you ask? Because hey ha e no inge s o ype o no a ms o manipula e a adio o e en a eco de .\r\n \r\n hey ha e no one o help hem, o hey may no e en ha e a pc o he in e ne o suppo . Dep ession can make one ha e he  eeling o \"less han and apa om \" any hing ha is and can be a se ious melady o his ype o esea ch. You a e o una e ha you can do all he wonde ul hings you do. E en i i akes a li le longe , he ac is you will and ge o do hose wonde ul hings, so many a e unable o. So, smile, and hank you blessings and be g a e ul.....you a e blessed. Oh one mo e hough .....being happy is so close...i s only one hough away!! isn' ha awsome?\r\nBlessings,\r\nLK\r\n\r\n----- O iginal Message ----F om: \"alo bama@ne scape.com\" To: EVP-ITC@yahoog oups.comSen : Monday, June 2, 2008 1:58:00 PMSubjec : Re: [EVP-ITC] ques ion\r\n\r\n\r\nAmong all he o he challenges, I ha e uncon ollable hand- emo s/ spasms which make ope a ing a keyboa d and mouse pains akingly di icul & slow, which is why I go ho unde he colla when someone messed wi h my iles on ano he boa d. Wha may ake you a couple o minu es o edi in audaci y may ake me up o 30 minu es. Lookijg a hese p ac ical ma e s, do ya'll hink I ough o jus gi e his up? I'm in e es ed e y much in box esea cgh, bu jus kind o dep essed ha I can' enjoy li e as I could in he pas . I was a luen ypis back hen, and now i 's jus 2 inge s all he way./Al--- alo bama@ne scape. com w o e:F om: To: Subjec : Re: [EVP-ITC] GuysDa e: Mon, 2 Jun 2008 11:47:59 -0700\r\n\r\n\r\n\r\n\r\nLau a,Thanks. I was us a ed wi h he esul s and was abou o ash my whole collec ion o e ps. E en go kicked ou o a boa d on ano he plane . I go he no ion ha his s u doesn' wo k as easily o me as i does o he s. Then I blew my op when someone messed wi h my iles on he o he boa d a e i had aken hou s o p ocess hem. I collec s amps, d aw, do wood ca ing bu ha e ne e been so i i able abou hings going w ong as I' e been wi h e p ishing. Thanks o he encou agemen .Al--- ghuny1@yahoo. com w o e:F om: Lau a Kimbe ley To: EVP-ITC@yahoog oups .comSubjec : Re: [EVP-ITC] GuysDa e: Mon, 2 Jun 2008 11:33:10 -0700 (PDT)\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nHi Al,\r\nFi s and o emos ake cha ge o you eco ding sessions in a lo ing & pos i e way. \r\nAlso, s a e a p aye be o e s a ing he session o medi a e in a posi i e way.\r\nTell hem no abusi e language will be ole a ed o cu sing, you ha e he con ol.\r\n \r\nTha will s op alo o he nas ies and da kheads. Le me know.\r\nBlessings,\r\nLK\r\n \r\n\r\n----- O iginal Message ----F om: \"alo bama@ne scape. com\" To: EVP-ITC@yahoog oups .comSen : Monday, June 2, 2008 12:26:52 PMSubjec : Re: [EVP-ITC] Guys\r\n\r\n\r\nA adio his o y iend says hose old ube adios also ha e a much wa me , mellowe sound oo -- o music a leas . And o as long as he ubes emain in s ock. Hey, I' e un in o se ious p oblems wi h e ps. A couple o weeks ago he msgs. began o ge mildly h ea ening. Now hey' e absolu ely ho o i ic -- blood-cu dling sc eams (sounds like a woman being o u ed) and \"You' e gonna die and be ou s.\" AM band only, a as I can ell. Should I do some hing like h ow sal a ound he adio, we hands wi h holy wa e and g ip he box eal igh ?Al--- cha medbyu20032003@ yahoo.ca w o e:F om: P ideg l Ne e umind To: EVP-ITC@yahoog oups .comSubjec : Re: [EVP-ITC] GuysDa e: Mon, 2 Jun 2008 10:04:10 -0400 (EDT)\r\n\r\n\r\n\r\n\r\n\r\nsince he onslaugh o manual sweeps has e u ned! lol\r\nCha mS e e Hul ay w o e:\r\n\r\n\r\nHa en' pos ed he e in a while, bu i'm using a manual sweep adio i picked up a a lea ma ke o $3 and i'm ge ing some good esul s. I 's a GE adio om he 40's ha has a g ea uning dial, i 's all i' e been using la ely.-S e e H.\r\n\r\n\r\n\r\nAll new Yahoo! Mail - Ge a sneak peak a messages wi h a handy eading pane. \r\n \r\n\r\nNe scape.  Jus he Ne You Need.\r\n \r\n\r\nNe scape.  Jus he Ne You Need.\r\n \r\n\r\nNe scape.  Jus he Ne You Need.\r\n\r\n \r\n \r\n\r\n \r\n \r\n\t\r\n\t\r\n\t\r\n\t\r\n\r\n\r\n\t\r\n\r\n\r\n\t\r\n\t\r\n\t\r\n\t\r\n\t\r\n\r\n Ne scape.  Jus he Ne You Need."}