{"id": "11160", "subject": "Re: Guys", "author": "purplespacefriend", "timestamp": "2008-06-03T04:42:35Z", "full_text": "I was using manual mode to test out the last couple tuner moduals, \nand it seems to have advantages, maybe it&#39;s the human touch element. \nThey seem to be able to track it easier, same with linear mode. I was \nwondering if they can access the tube electronics easier as well. I \nshould be able to dig up a tube radio around here somewhere. \n\n Frank-S\n\n\n--- In EVP-ITC@yahoogroups.com, Pridegrl Neverumind \n&lt;charmedbyu20032003@...&gt; wrote:\n&gt;\n&gt; thats my point on the subject too.... i have comments that make up \na full sentances... of 5 words... and you can hear me scanning past 4 \nto 8 channels ( cant remember exactly how many) but i remember saying-\n how could i get the same voice across 5 stations or what not? theres \njust no way....\n&gt;   i do love manual sweeps but i gotta tell ya i sure lust after \nsome of the fancier ghost-boxes! lol\n&gt;   Charm\n&gt; \n&gt; Steve Hultay &lt;urkel23@...&gt; wrote:\n&gt;           Yeah, manually sweeping gives the user the opportunity of \nbeing a \n&gt; part of the whole EVP experience i feel. Same goes with using sound \n&gt; soap for evp&#39;s. The GE radio i use for the manual sweeps sounds \nlike \n&gt; the old Frank&#39;s boxes in random mode, with the treble turned up it \n&gt; even sounds like it has an echo box. It has a good sound and given \na \n&gt; bunch of clear answers to me as well, you can hear how fast i&#39;m \n&gt; sweeping the dial yet i get the same voice with a full \n&gt; sentence....weird. If you scan up and down the band that fast, how \n&gt; do you get the same voice?\n&gt; \n&gt; -Steve\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Pridegrl Neverumind \n&gt; &lt;charmedbyu20032003@&gt; wrote:\n&gt; &gt;\n&gt; &gt; since the onslaught of manual sweeps has returned! lol\n&gt; &gt; Charm\n&gt; &gt; \n&gt; &gt; Steve Hultay &lt;urkel23@&gt; wrote:\n&gt; &gt; \n&gt; &gt; Haven&#39;t posted here in a while, but i&#39;m using a manual sweep \nradio \n&gt; i \n&gt; &gt; picked up at a flea market for $3 and i&#39;m getting some good \n&gt; results. \n&gt; &gt; It&#39;s a GE radio from the 40&#39;s that has a great tuning dial, it&#39;s \n&gt; all \n&gt; &gt; i&#39;ve been using lately.\n&gt; &gt; \n&gt; &gt; -Steve H.\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; ---------------------------------\n&gt; &gt; All new Yahoo! Mail - Get a sneak peak at messages with a handy \n&gt; reading pane.\n&gt; &gt;\n&gt; \n&gt; \n&gt; \n&gt;                            \n&gt; \n&gt;        \n&gt; ---------------------------------\n&gt; Ask a question on any topic and get answers from real people. Go to \nYahoo! Answers.\n&gt;"}