{"id": "11164", "subject": "Re: [EVP-ITC] Hello...from a Newbie", "author": "Zack Widup", "timestamp": "2008-06-03T13:25:39Z", "full_text": "--297796611-1738034916-1212499539=:14659\r\nContent-Type: TEXT/PLAIN; charset=US-ASCII; format=flowed\r\nContent-Transfer-Encoding: 8BIT\r\n\r\n\nYou&#39;ll probably get a lot of different responses as to favorites but I&#39;ve \nbeen very happy with the Olympus VN-960PC I got a few years ago. It comes \nwith a USB cable that plugs into your computer.\n\nIt will record 6 hours in hi-quality mode.\n\nRadio Shack sells newer versions like the VN-4100PC which probably have \nmore recording time than you will ever need on a single investigation.\n\nSome other Olympus models actually allow you to use the flash memory built \nin for storing and transferring data via the USB port.  The VN-XXXPC \nseries only allow you to download the recordings you&#39;ve made to your PC. \nI might consider getting one of the fancier ones some day. Check out the \nRadio Shack website for further details. But I think they all use built-in \nflash and don&#39;t use separate CF or SD cards.\n\nZack\n\nOn Tue, 3 Jun 2008, threadsintyme@... wrote:\n\n&gt; Hi Al,\n&gt; Do you know if there is a digital voice recorder that has an SD card slot? That would be nice to switch SD cards from time to time. Especially if one had a great EVP.\n&gt; How does listening to EVP&#39;s make you feel about the dead? This is not meant to be a theological argument in any way. Just a question...I am a medium, and I approach the subject as a medium. But then I am involved with being a medium daily.\n&gt;\n&gt; Al, thank YOU for your honest and kind reply. I appreciate your taking the time out of your busy day to reply to me. The time and effort does not make typing easy for you.\n&gt; Blessings,\n&gt; (The Other...) Al\n&gt;\n&gt; Al, this is the other Al, heh. I like the Olympus and have three of them and one Sony. IMHO the Olympus beats Sony hands down. Model WS-300M is my favorite. I believe it runs 24-hours -- I use it for overnight evps in houses and have captured very clear sounds. It is stereo and snaps apart to convert into a memory stick complete with usb. You can store data/text files and music, and the tiny speaker is excellent. This thing is so light a good Cuban cigar weighs more. I believe these go for $150 or so, but I got this one new on ebay for $65. Another good one I use all the time is Olympus VN-960PC, which may not be in mfg. any more. It records about 16 hours and is slightly larger, but has a darn good mike and I like the clip for the shirt pocket. Also it has a lighted display (as does the ws-300m) thhat&#39;s larger than the other one, consequently with bigger figures for easier reading. You didn&#39;t ask for this, but the one I&#39;d avoid is the Sony icd-st25. The sound is nowhere near true and though it has most of the features of the Olympus models the sound quality is first in my book. I think all of these are available at wally world, costco, and circuit city, though you can usually save a lot at ebay if you&#39;re patient.\n&gt;\n&gt; Al\n&gt;\n&gt; --- Threadsintyme@... wrote:\n&gt;\n&gt; From: &quot;Al&quot; &lt;Threadsintyme@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Subject: [EVP-ITC] Hello...from a Newbie\n&gt; Date: Tue, 03 Jun 2008 00:27:44 -0000\n&gt;\n&gt; My name is Al and I am interested in purchasing some digital voice\n&gt; recorders...what do all of you believe is the best model number to use?\n&gt;\n&gt; Al\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Netscape.  Just the Net You Need.\n&gt;\n&gt; _____________________________________________________________\n&gt; Wasting money?  Stop, now.  Click here for top online coupon websites.\n&gt; http://thirdpartyoffers.juno.com/TGL2111/fc/Ioyw6iigj6AyKhv9VVgrMPmVrdqLHGHdzYNuJCVRMw5K02Cybki0aI/?count=1234567890\n&gt;\r\n--297796611-1738034916-1212499539=:14659--"}