{"id": "1116", "subject": "Re: [EVP-ITC] Re: Optical (flame) Microphone and FM Sweep", "author": "RetroCom", "timestamp": "2007-04-13T00:06:10Z", "full_text": "----__Part.20070412170610.E3E62109\r\nContent-Type: text/plain; charset=&quot;UTF-8&quot;\r\n\r\nIt&#39;s like combining the best of both methods. My gut feeling is that as simple as it is to replicate no one will bother and there will be plenty of critics and skeptics chattering in denial. Capture from today.\n\n&quot;How does David talk through this flame?&quot;\n\nDave\n\n--- franks-boxes@... wrote:\n\nFrom: &quot;Frank Sumption&quot; &lt;franks-boxes@...&gt;\nTo: EVP-ITC@yahoogroups.com\nSubject: [EVP-ITC] Re: Optical (flame) Microphone and FM Sweep\nDate: Thu, 12 Apr 2007 21:53:52 -0000\n\n I thought the point in the sweep method was to show it&#39;s not \ncomplicated, and no exotic technoglogy required!\n\n--- In EVP-ITC@yahoogroups.com, &quot; RetroCom&quot; &lt;vfp19968@...&gt; wrote:\n&gt;\n&gt; Frank, I&#39;m not misleading anyone, the optical microphone using a \nflame in and of itself works very well in the capture of Spirit \nvoices. I don&#39;t know exactly why, after almost two years I am still \nstudying it although I can speculate it could because there is a lot \ngoing on during it&#39;s use. Change of state from liquid to vapor to \nheat and light, IR radiation, thermal noise and some processes I am \nmissing or unaware of. The radio sweep is used as a source of sound \nsamples, the microphone also works well using music or plain speech. \nThe limited high frequency response also seems to act as a built-in \nbandpass filter. I&#39;m not using anything complicated or out of the \nreach of a Wal-Mart or K-Mart shopper. I&#39;m using an off the shelf \noil lamp with a 3/4 inch wide flat wick, a phototransistor from \nRadio Shack and an FM radio.  There is more to the flame microphone \nthen modulated light, I can modulate the DC feeding a flashlight or \nand LED and not get the same results. Here is an exchange using the \noptical microphone and FM radio sweep, my voice is reduced by 10db.\n&gt; Dave: (NOT EVP) &#39;How many of you are are testing today?&#39;\n&gt; \n&gt; Response : &quot;Fourty Seven&quot;\n&gt; \n&gt; Dave: &#39;Please state your name, thank you&#39;\n&gt; \n&gt; Response : &quot;Ingrid&quot;\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Maybe it&#39;s dumb question, but..................\n&gt; \n&gt;  If the flame is being &quot;modulated&quot; by air movements caused by \n&gt; atmosphereic sound pressure waves, so the flame varies at an audio \n&gt; rate, then those flame variations are picked up via the photo \n&gt; transistor and converted to electrical signals...what&#39;s the \ndifference \n&gt; between the optical mic, and an accoustic mic? And why would one \nwant \n&gt; to introduce yet another seemingly exotic piece of hardware?\n&gt; \n&gt;  I know it&#39;s interesting, but it really has nothing to do with how \nto \n&gt; get ghost voices, and maybe misleading to some that are searching \nfor \n&gt; that magic technology. \n&gt; \n&gt;  \n&gt;    Frank\n&gt;\n\n\n\n\n\r\n----__Part.20070412170610.E3E62109\r\nContent-Type: audio/mpeg\r\nContent-Type: AUDIO/MPEG; name=&quot;041207howdoesdavidtalkthroughthisflame.mp3&quot;\r\nContent-Disposition: attachment; filename=&quot;041207howdoesdavidtalkthroughthisflame.mp3&quot;\r\n\r\n[ Attachment content not displayed ]\r\n----__Part.20070412170610.E3E62109--"}