{"id": "11170", "subject": "the Other Al: recorders", "author": "alofbama@netscape.com", "timestamp": "2008-06-03T15:59:42Z", "full_text": "Hi Al,I o go o men ion he ca d op ion you asked zbou . I pe sonally don' know any ha ope a e wi h a lash ca d, bu I'm su e someone has one. Bu , eally, you don' need a ca d because mos o he eco de s come wi h hei own so wa e so ha when you plug in he eco de 's usb a dialogue box pops up asking i you wan he so wa e o download all you new iles o you HD olde o , say, Olympus o wha e e . And mos come wi h mo e buil in memo y han you can e e use, so swapping ou ca ds and keeping ack o wha 's on hem is elimina ed. I ha e ex e nal HDs o my bi d pho os and such, and o my sound iles ha a e un ouched. In o he wo ds, I do a \"sa e as\" o he o iginal and hen sa e a copy wi h a mo e desc ip i e name such as da e and subjec . I migh look like his: 060208--Con edCeme e y.wa . I lea e his as \" i gin,\" un ouched in case I ha e a HD c ash o some hing, and i li es on my ex e nal HD. The wo king copy ile is sa ed as an mpg, so i doesn' hog memo y. Now, ha ing said all ha , I use some high-end digi al came as o wildli e pho og aphy (when heal h allows me o si in a blind). I use 5 gb ca ds o e y high esolu ion. The down side o ca ds is ha soone o la e a ca d is going o go bad like he old loppy disks. And le 's say I jus ook a pic u e o he las emaining Alaskan snowy owl and ha sho is wo h a o une. Well, he e I am, 5-gbs o pix on a ied ca d. I would much a he wo k di ec ly on some kind o in e nal hd ha can be downloaded by, say, IR, han o isk losing s u on ca ds. I know ha sounds s ange because an in e nal hd can go bad oo -- bu he e's highe isk wi h ca ds; jus look a all he pin holes and how ca e ul you ha e o be no o ge a speck o some hing in he e, and on and on. Jus my opinion. Bu , back o he eco de s, eason I like he Olympus is ha is is essen ially a memo y s ick compa able wi h any usb. I you had wo iden ical eco de s and illed one up (no likely) in a day, you could snap hem apa and pop in he second eco de 's memo y s ick. I hope his makes help -- go pain meds on boa d, and a lo ge s d opped om my communica ion, lol.O he Al--- Th eadsin yme@Juno.com w o e:F om: \" h eadsin yme@juno.com\" To: EVP-ITC@yahoog oups.comSubjec : Re: [EVP-ITC] Hello... om a NewbieDa e: Tue, 3 Jun 2008 14:07:07 GMT\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n \r\n The Olympus 4100pc has some g ea e iews...and a ew ha we en' so ho . The uni does look good!  LOL\r\nThanks o you sugges ion, Zack...I hink ha  Iam ge ing close o a decision! A e all, Fa he 's day is soon app oaching! LOL\r\nNow, wha do I need he mos ? A new ha d d i e o my space s a ed PC? O a digi al oice eco de ? This one will ake a good hink as Gome Pyle used o say. \r\nAl\r\n-- Zack Widup w o e:\r\n\r\n\r\n\r\nYou'll p obably ge a lo o di e en esponses as o a o i es bu I' e been e y happy wi h he Olympus VN-960PC I go a ew yea s ago. I comes wi h a USB cable ha plugs in o you compu e .I will eco d 6 hou s in hi-quali y mode.Radio Shack sells newe e sions like he VN-4100PC which p obably ha e mo e eco ding ime han you will e e need on a single in es iga ion.Some o he Olympus models ac ually allow you o use he lash memo y buil in o s o ing and ans e ing da a ia he USB po . The VN-XXXPC se ies only allow you o download he eco dings you' e made o you PC. I migh conside ge ing one o he ancie ones some day. Check ou he Radio Shack websi e o u he de ails. Bu I hink hey all use buil -in lash and don' use sepa a e CF o SD ca ds.ZackOn Tue, 3 Jun 2008, h eadsin yme@juno.com w o e:> Hi Al,> Do you know i he e is a digi al oice eco de ha has an SD ca d slo ? Tha would be nice o swi ch SD ca ds om ime o ime. Especially i one had a g ea EVP.> How does lis ening o EVP's make you eel abou he dead? This is no mean o be a heological a gumen in any way. Jus a ques ion...I am a medium, and I app oach he subjec as a medium. Bu hen I am in ol ed wi h being a medium daily.>> Al, hank YOU o you hones and kind eply. I app ecia e you aking he ime ou o you busy day o eply o me. The ime and e o does no make yping easy o you.> Blessings,> (The O he ...) Al>> Al, his is he o he Al, heh. I like he Olympus and ha e h ee o hem and one Sony. IMHO he Olympus bea s Sony hands down. Model WS-300M is my a o i e. I belie e i uns 24-hou s -- I use i o o e nigh e ps in houses and ha e cap u ed e y clea sounds. I is s e eo and snaps apa o con e in o a memo y s ick comple e wi h usb. You can s o e da a/ ex iles and music, and he iny speake is excellen . This hing is so ligh a good Cuban ciga weighs mo e. I belie e hese go o $150 o so, bu I go his one new on ebay o $65. Ano he good one I use all he ime is Olympus VN-960PC, which may no be in m g. any mo e. I eco ds abou 16 hou s and is sligh ly la ge , bu has a da n good mike and I like he clip o he shi pocke . Also i has a ligh ed display (as does he ws-300m) hha 's la ge han he o he one, consequen ly wi h bigge igu es o easie eading. You didn' ask o his, bu he one I'd a oid is he Sony icd-s 25. The sound is nowhe e nea ue and hough i has mos o he ea u es o he Olympus models he sound quali y is i s in my book. I hink all o hese a e a ailable a wally wo ld, cos co, and ci cui ci y, hough you can usually sa e a lo a ebay i you' e pa ien .>> Al>> --- Th eadsin yme@Juno.com w o e:>> F om: \"Al\" Th eadsin yme@Juno.com>> To: EVP-ITC@yahoog oups.com> Subjec : [EVP-ITC] Hello... om a Newbie> Da e: Tue, 03 Jun 2008 00:27:44 -0000>> My name is Al and I am in e es ed in pu chasing some digi al oice> eco de s...wha do all o you belie e is he bes model numbe o use?>> Al>>>>> Ne scape. Jus he Ne You Need.>> __________________________________________________________> Was ing money? S op, now. Click he e o op online coupon websi es.> h p:// hi dpa yo e s.juno.com/TGL2111/ c/Ioyw6iigj6AyKh 9VVg MPmV dqLHGHdzYNuJCVRMw5K02Cybki0aI/?coun =1234567890>\r\n\r\n____________________________________________________________\r\nClick he e o choose om a huge selec ion o shipping supplies!\r\n \r\n\r\n \r\n \r\n\t\r\n\t\r\n\t\r\n\t\r\n\r\n\r\n\t\r\n\r\n\r\n\t\r\n\t\r\n\t\r\n\t\r\n\t\r\n\r\n Ne scape.  Jus he Ne You Need."}