{"id": "11185", "subject": "Re: [EVP-ITC] Re: Misty, water sounds", "author": "alofbama@netscape.com", "timestamp": "2008-06-03T18:10:43Z", "full_text": "Wow, g ea , smoo h sweep! Al (I o ge which one)--- bulle babea@yahoo.com w o e:F om: Mis y Dawn To: EVP-ITC@yahoog oups.comSubjec : Re: [EVP-ITC] Re: Mis y, wa e soundsDa e: Tue, 3 Jun 2008 09:59:16 -0700 (PDT)\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n \r\n I hink i s a bi o bo h ac ually. The e a e many me hods, many ools, and I would say he ghos box de ices a e a g ea ool o use.\r\n\r\nHe es one I eco ded ecen ly doing sweep uning on my m ca d. Kind o pe ains o his con e sa ion and I was jus sha ing i wi h a iend. A aching i o his pos i s oo long o a ilename wise o pos he e in ile sec ion. I migh upload i o my esnips o hose who don ge indi idual emails.\r\n\r\nMis y\r\n\r\n--- On Tue, 6/3/08, h eadsin yme@juno.com Th eadsin yme@Juno.com> w o e:\r\n\r\n> F om: h eadsin yme@juno.com Th eadsin yme@Juno.com>\r\n> Subjec : Re: [EVP-ITC] Re: Mis y, wa e sounds\r\n> To: EVP-ITC@yahoog oups.com\r\n> Da e: Tuesday, June 3, 2008, 12:48 PM\r\n> Hi Mis y,\r\n> Thank you o you sugges ions...I would ne e ha e hough \r\n> o ha on my own! Tha would educe all o he \"ghos \r\n> phones\" o simply being ools a he han de ices o\r\n> communica e wi h a spi i .\r\n> The e is a small g oup o us (pa ano mal in es iga o s) in\r\n> Muskegon, MI. We ha e had some in e es ing success wi h\r\n> pho og aphs. In a mon h I am aking hem in an en i ely new\r\n> di ec ion: using you body as a ool o ghos hun ing. And\r\n> no o p o ec ion, ei he ! LOL. \r\n> This would i igh in wi h his idea o using some so \r\n> o whi e noise...e en in he ield.O a leas , i will\r\n> gi e hem some hing o eally chew on! \r\n> (The O he ) Al\r\n> \r\n> -- alo bama@ne scape.com> w o e:\r\n> \r\n> Hi Mis y\r\n> \r\n> You' e he only pe son I' e hea d men ion his, and\r\n> i makes me eel be e knowing I'm no c azy (a keas \r\n> o ally). lol Long ago I no iced ha unning ap wa e \r\n> some imes seems o sound like ga bled speech. I ne e \r\n> es ed his wi h a eco de , bu I' e caugh some e ps\r\n> wi h e ige a o mo o s and o he de ices. Audaci y has\r\n> he \"add whi e noise\" op ion, which allows you o\r\n> eco d di ec ly o you compu e and allow he en i ies o\r\n> o ganize he gene ic whi e noise. I'm eage o y\r\n> ha . An excellen obse a ion you had, Mis y. I hink hey\r\n> mus g ab hold o any babbling o whi ing noise a ailable\r\n> o communica e, whe he we' e able o pick i up o \r\n> no . Tha 's why I ca y a ound one o he ligh weigh \r\n> Olympus eco de s -- no elling whe e you' e going o\r\n> ind a babbling-b ook o s eady mo o sound. Good ea !\r\n> \r\n> Al ( he o he )\r\n> \r\n> --- bulle babea@yahoo.com w o e:\r\n> \r\n> F om: \"Mis y\" bulle babea@yahoo.com>\r\n> To: EVP-ITC@yahoog oups.com\r\n> Subjec : [EVP-ITC] Re: Resea ch\r\n> Da e: Tue, 03 Jun 2008 15:51:39 -0000\r\n> \r\n> Al\r\n> \r\n> Sweep uning can be used on AM FM sho wa e e c. I ha e had\r\n> some \r\n> success wi hou uning jus allowing hem o use he s a ic\r\n> o wa e \r\n> noise ha s in backg ound. Bes ad ice one cold gi e is y\r\n> i \r\n> you sel o a while and see wha you come up wi h =)\r\n> \r\n> Mis y\r\n> \r\n> --- In EVP-ITC@yahoog oups.com,\r\n> \" h eadsin yme@...\" \r\n> w o e:\r\n> >\r\n> > Why do you need o \"sweep\" he AM spec um? \r\n> > Has anyone ied his bu wi hou sweeps on he\r\n> sho wa e band? Has \r\n> any esea ch been done? Could i be ha he AM band has\r\n> some so \r\n> o \"special p ope ies\" ha would allow such\r\n> communica ion? \r\n> > Why is i ha he AM band has o be used wi h a adio\r\n> s a ion \r\n> playing? The e a e pa s o he spec um ha is jus \r\n> ou side o ha \r\n> spec um ha migh p o ide a be e o m o communica ion.\r\n> \r\n> > Al\r\n> >\r\n> __________________________________________________________\r\n> > Click he e o g ea compu e ne wo king solu ions!\r\n> > \r\n> h p:// hi dpa yo e s.juno.com/TGL2131/ c/Ioyw6iighEHwMAbLKMUuYo359E\r\n> 28alDzNnXaMa5y qURXjmUoY4EK4/\r\n> >\r\n> \r\n> \r\n> \r\n> \r\n> Ne scape. Jus he Ne You Need.\r\n> \r\n> __________________________________________________________\r\n> Sa e up o 10% - 30% on Visual Basic. Click he e.\r\n> h p:// hi dpa yo e s.juno.com/TGL2131/ c/Ioyw6iieaQN5R Z1soKOCuuMixUgcZzY1xo1 b4JBN Lg7k YmcCNG/\r\n\r\n\r\n \r\n\r\n \r\n \r\n\t\r\n\t\r\n\t\r\n\t\r\n\r\n\r\n\t\r\n\r\n\r\n\t\r\n\t\r\n\t\r\n\t\r\n\t\r\n\r\n Ne scape.  Jus he Ne You Need."}