{"id": "11195", "subject": "Re: Al ==&gt; Roland Edirol r-09", "author": "alofbama@netscape.com", "timestamp": "2008-06-03T22:17:33Z", "full_text": "AlGo o h p://elec onics.sea ch.ebay.com/Roland-Edi ol- -09_Consume -Elec onics_W0QQ_ ksidZm37QQ omZR40QQsaca Z293QQsa i leZRolandQ20Edi olQ20 Q2d09Al o Bama--- Th eadsin yme@Juno.com w o e:F om: \" h eadsin yme@juno.com\" To: EVP-ITC@yahoog oups.comSubjec : Re: [EVP-ITC] Re: Hello... om a NewbieDa e: Tue, 3 Jun 2008 21:54:56 GMT\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n \r\n S e e,\r\nI knew ha some company had o make one... :)\r\nThanks o he in o...NOW...whe e do I ind such a c i e ??\r\nAl-- \"S e e Hul ay\" w o e:\r\n\r\n\r\n\r\nAl,I use he Roland Edi ol -09, i has a SD slo and wo ks eally well o me.-S e e--- In EVP-ITC@yahoog oups.com, \" h eadsin yme@...\" w o e:>> Hi Al,> Do you know i he e is a digi al oice eco de ha has an SD ca d slo ? Tha would be nice o swi ch SD ca ds om ime o ime. Especially i one had a g ea EVP. > How does lis ening o EVP's make you eel abou he dead? This is no mean o be a heological a gumen in any way. Jus a ques ion...I am a medium, and I app oach he subjec as a medium. Bu hen I am in ol ed wi h being a medium daily. > > Al, hank YOU o you hones and kind eply. I app ecia e you aking he ime ou o you busy day o eply o me. The ime and e o does no make yping easy o you. > Blessings,> (The O he ...) Al> > Al, his is he o he Al, heh. I like he Olympus and ha e h ee o hem and one Sony. IMHO he Olympus bea s Sony hands down. Model WS-300M is my a o i e. I belie e i uns 24-hou s -- I use i o o e nigh e ps in houses and ha e cap u ed e y clea sounds. I is s e eo and snaps apa o con e in o a memo y s ick comple e wi h usb. You can s o e da a/ ex iles and music, and he iny speake is excellen . This hing is so ligh a good Cuban ciga weighs mo e. I belie e hese go o $150 o so, bu I go his one new on ebay o $65. Ano he good one I use all he ime is Olympus VN-960PC, which may no be in m g. any mo e. I eco ds abou 16 hou s and is sligh ly la ge , bu has a da n good mike and I like he clip o he shi pocke . Also i has a ligh ed display (as does he ws-300m) hha 's la ge han he o he one, consequen ly wi h bigge igu es o easie eading. You didn' ask o his, bu he one I'd a oid is he Sony icd-s 25. The sound is nowhe e nea ue and hough i has mos o he ea u es o he Olympus models he sound quali y is i s in my book. I hink all o hese a e a ailable a wally wo ld, cos co, and ci cui ci y, hough you can usually sa e a lo a ebay i you' e pa ien .> > Al> > --- Th eadsin yme@... w o e:> > F om: \"Al\" > To: EVP-ITC@yahoog oups.com> Subjec : [EVP-ITC] Hello... om a Newbie> Da e: Tue, 03 Jun 2008 00:27:44 -0000> > My name is Al and I am in e es ed in pu chasing some digi al oice > eco de s...wha do all o you belie e is he bes model numbe o use?> > Al> > > > > Ne scape. Jus he Ne You Need.> > __________________________________________________________> Was ing money? S op, now. Click he e o op online coupon websi es.> h p:// hi dpa yo e s.juno.com/TGL2111/ c/Ioyw6iigj6AyKh 9VVg MPmV dqLHGHdzYNuJCVRMw5K02Cybki0aI/?coun =1234567890>\r\n\r\n____________________________________________________________\r\nClick he e o g ab coupons and discoun s. Many s o es, many deals.\r\n \r\n\r\n \r\n \r\n\t\r\n\t\r\n\t\r\n\t\r\n\r\n\r\n\t\r\n\r\n\r\n\t\r\n\t\r\n\t\r\n\t\r\n\t\r\n\r\n Ne scape.  Jus he Ne You Need."}