{"id": "11198", "subject": "Re: [EVP-ITC] Re: Research", "author": "RetroCom", "timestamp": "2008-06-04T00:14:44Z", "full_text": "I&#39;ll add my two cents here for what it&#39;s worth. The term I have heard in many of my own sessions is &#39;Heterodyne&#39;. They somehow combine/mix multiple sounds, frequencies and or energy to produce the voices. A good test of this is to have three people reading from different scripts (for control) at the same time, ask your questions while all three are speaking and listen for a loud response in the combined voices in the playback. http://en.wikipedia.org/wiki/Heterodyne\n\nDave\n\n--- Threadsintyme@... wrote:\n\nFrom: &quot;threadsintyme@...&quot; &lt;Threadsintyme@...&gt;\nTo: EVP-ITC@yahoogroups.com\nSubject: Re: [EVP-ITC] Re: Research\nDate: Tue, 3 Jun 2008 18:14:27 GMT\n\nZack,\nIs it possible that spirits use sound similar to our using a carrier wave on the AM radio spectrum? IE, we use turn an AM transmitter on, the transmitter automatically sends out a &quot;carrier wave.&quot; Sound is then piggy backed on the wave and sent from the transmitter (no matter what the sound is). \nI wonder if anyone has used a white noise generator in a cemetery with any results? \nAl (from Michigan).\n\n-- Zack Widup &lt;w9sz@...&gt; wrote:\n\n\nI have suspected that spirits use existing noises and sounds to change or \nmodulate them when they produce EVP. I have one EVP that occurred right \nafter someone asked &quot;Are you happy?&quot; and during the time a car passed by \noutside the building it was recorded in. When we were in the building all \nwe heard was the motor sound. On the recording, the motor sound plainly \nbecomes the words &quot;Course I&#39;m haapee.&quot;\n\nZack\n\nOn Tue, 3 Jun 2008, threadsintyme@... wrote:\n\n&gt; Heather,\n&gt; Please explain a bit more...this is really interesting to me...\n&gt; Al\n&gt;\n&gt; -- &quot;HKaczmarek&quot; &lt;hkaczmarek@...&gt; wrote:\n&gt;\n&gt; I am new here but I have had excellent success with using running water in the background. Heather\n&gt; Al\n&gt;\n&gt; Sweep tuning can be used on AM FM shortwave etc. I have had some\n&gt; success without tuning just allowing them to use the static or water\n&gt; noise thats in background. Best advice one cold give is try it\n&gt; yourself for a while and see what you come up with =)\n&gt;\n&gt; Misty\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, &quot;threadsintyme@...&quot;\n&gt; &lt;Threadsintyme@...&gt; wrote:\n&gt;&gt;\n&gt;&gt; Why do you need to &quot;sweep&quot; the AM spectrum?\n&gt;&gt; Has anyone tried this but without sweeps on the shortwave band? Has\n&gt; any research been done? Could it be that the AM band has some sort\n&gt; of &quot;special properties&quot; that would allow such communication?\n&gt;&gt; Why is it that the AM band has to be used with a radio station\n&gt; playing? There are parts of the spectrum that is just outside of that\n&gt; spectrum that might provide a better form of communication.\n&gt;&gt; Al\n&gt;&gt; __________________________________________________________\n&gt;&gt; Click here for great computer networking solutions!\n&gt;&gt;\n&gt; http://thirdpartyoffers.juno.com/TGL2131/fc/Ioyw6iighEHwMAbLKMUuYo359E\n&gt; 28alDzNnXaMa5yrqURXjmUoY4EK4/\n&gt;&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; __________________________________________________________\n&gt; Click here for financial aid options. Quick and Easy.\n&gt; http://thirdpartyoffers.juno.com/TGL2131/fc/Ioyw6iighof4n5VWBjay9V4r3dow3I6I2CiykhabvgkyFJh6LQjuE8/\n\n \n____________________________________________________________\nNeed cash? Click to get an emergency loan, bad credit ok\nhttp://thirdpartyoffers.juno.com/TGL2131/fc/Ioyw6iiekKtXhjUNvO7IhQ1UvB9GqkrjhLHbClthbG5drL96aAjMry/"}