{"id": "11202", "subject": "Re: Hello...from a Newbie", "author": "Steve Hultay", "timestamp": "2008-06-04T03:27:46Z", "full_text": "http://cgi.ebay.com/EDIROL-R-09-by-ROLAND-24bit-WAVE-MP3-RECORDER-\nMINT-\nCOND_W0QQitemZ170225250141QQihZ007QQcategoryZ48688QQssPageNameZWDVWQQr\ndZ1QQcmdZViewItem\n\nAl,\n\nThis is the only recorder i have ever used and the audio is above all \nthe rest.  A bit expensive, but worth it.  I originally bought it to \nrecord my jam sessions with my band and than this research came along \nand i already had it.  So that&#39;s what i used, i&#39;ve even caught some \nreal evp with it.\n\n-Steve\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;threadsintyme@...&quot; \n&lt;Threadsintyme@...&gt; wrote:\n&gt;\n&gt; Steve,\n&gt; I knew that some company had to make one... :)\n&gt; Thanks for the info...NOW...where do I find such a critter??\n&gt; Al\n&gt; \n&gt; -- &quot;Steve Hultay&quot; &lt;urkel23@...&gt; wrote:\n&gt; \n&gt; \n&gt; Al,\n&gt; \n&gt; I use the Roland Edirol r-09, it has a SD slot and works really \nwell \n&gt; for me.\n&gt; \n&gt; -Steve\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;threadsintyme@&quot; \n&gt; &lt;Threadsintyme@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hi Al,\n&gt; &gt; Do you know if there is a digital voice recorder that has an SD \n&gt; card slot? That would be nice to switch SD cards from time to time. \n&gt; Especially if one had a great EVP. \n&gt; &gt; How does listening to EVP&#39;s make you feel about the dead? This is \n&gt; not meant to be a theological argument in any way. Just a \n&gt; question...I am a medium, and I approach the subject as a medium. \nBut \n&gt; then I am involved with being a medium daily. \n&gt; &gt; \n&gt; &gt; Al, thank YOU for your honest and kind reply. I appreciate your \n&gt; taking the time out of your busy day to reply to me. The time and \n&gt; effort does not make typing easy for you. \n&gt; &gt; Blessings,\n&gt; &gt; (The Other...) Al\n&gt; &gt; \n&gt; &gt; Al, this is the other Al, heh. I like the Olympus and have three \nof \n&gt; them and one Sony. IMHO the Olympus beats Sony hands down. Model WS-\n&gt; 300M is my favorite. I believe it runs 24-hours -- I use it for \n&gt; overnight evps in houses and have captured very clear sounds. It is \n&gt; stereo and snaps apart to convert into a memory stick complete with \n&gt; usb. You can store data/text files and music, and the tiny speaker \nis \n&gt; excellent. This thing is so light a good Cuban cigar weighs more. I \n&gt; believe these go for $150 or so, but I got this one new on ebay for \n&gt; $65. Another good one I use all the time is Olympus VN-960PC, which \n&gt; may not be in mfg. any more. It records about 16 hours and is \n&gt; slightly larger, but has a darn good mike and I like the clip for \nthe \n&gt; shirt pocket. Also it has a lighted display (as does the ws-300m) \n&gt; thhat&#39;s larger than the other one, consequently with bigger figures \n&gt; for easier reading. You didn&#39;t ask for this, but the one I&#39;d avoid \nis \n&gt; the Sony icd-st25. The sound is nowhere near true and though it has \n&gt; most of the features of the Olympus models the sound quality is \nfirst \n&gt; in my book. I think all of these are available at wally world, \n&gt; costco, and circuit city, though you can usually save a lot at ebay \n&gt; if you&#39;re patient.\n&gt; &gt; \n&gt; &gt; Al\n&gt; &gt; \n&gt; &gt; --- Threadsintyme@ wrote:\n&gt; &gt; \n&gt; &gt; From: &quot;Al&quot; &lt;Threadsintyme@&gt;\n&gt; &gt; To: EVP-ITC@yahoogroups.com\n&gt; &gt; Subject: [EVP-ITC] Hello...from a Newbie\n&gt; &gt; Date: Tue, 03 Jun 2008 00:27:44 -0000\n&gt; &gt; \n&gt; &gt; My name is Al and I am interested in purchasing some digital \nvoice \n&gt; &gt; recorders...what do all of you believe is the best model number \nto \n&gt; use?\n&gt; &gt; \n&gt; &gt; Al\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; Netscape. Just the Net You Need.\n&gt; &gt; \n&gt; &gt; __________________________________________________________\n&gt; &gt; Wasting money? Stop, now. Click here for top online coupon \n&gt; websites.\n&gt; &gt; \n&gt; \nhttp://thirdpartyoffers.juno.com/TGL2111/fc/Ioyw6iigj6AyKhv9VVgrMPmVrd\n&gt; qLHGHdzYNuJCVRMw5K02Cybki0aI/?count=1234567890\n&gt; &gt;\n&gt; \n&gt; \n&gt;  \n&gt; ____________________________________________________________\n&gt; Click here to grab coupons and discounts.  Many stores, many deals.\n&gt; \nhttp://thirdpartyoffers.juno.com/TGL2131/fc/Ioyw6iigj6AkoBkCfoMoUGgzZH\nAIQ17jPBHYj2oSEy1oBrUHe9Y8ew/\n&gt;"}