{"id": "11206", "subject": "Re: [EVP-ITC] Re: Hello...from a Newbie", "author": "Zack Widup", "timestamp": "2008-06-04T19:51:09Z", "full_text": "You might be interested in the Olympus LS-10:\n\nhttp://www.olympusamerica.com/cpg_section/product.asp?product=1350\n\nZack\n\nOn Wed, 4 Jun 2008, Guy wrote:\n\n&gt; --- In EVP-ITC@yahoogroups.com, &quot;threadsintyme@...&quot;\n&gt; &lt;Threadsintyme@...&gt; wrote:\n&gt;&gt;\n&gt;&gt; Hi Al,\n&gt;&gt; Do you know if there is a digital voice recorder that has an SD\n&gt; card slot? That would be nice to switch SD cards from time to time.\n&gt; Especially if one had a great EVP.\n&gt; &lt;rest snipped&gt;\n&gt;\n&gt; Thought I&#39;d jump in here...\n&gt;\n&gt; First of all - I use mainly full spectrum sound recorders rather than\n&gt; the standard hand-held digital voice recorders. Two reasons: 1. There\n&gt; are paranormal NON-VOICE sounds out there that are not being picked\n&gt; up by the limited response of the voice-only recorders, 2. The higher\n&gt; frequencies in the 20-20 kHz human sound range contribute to the\n&gt; intelligibility of consonants. Using recorders with a higher\n&gt; frequency response makes for clearer understanding of voices -\n&gt; particularly those that are &quot;whispered&quot;.\n&gt;\n&gt; My first foray into using full spectrum recorders led me to buy the\n&gt; (now discontinued) Fostex MR-8.\n&gt;\n&gt; http://namm.harmony-central.com/WNAMM03/Content/Fostex/PR/MR-8.html\n&gt;\n&gt; While it is not extremely portable nor hand-held, it is &quot;luggable&quot;\n&gt; and is perfect for stationary recording. It is full spectrum, battery-\n&gt; powered, uses Compact Flash and has inputs for multiple external\n&gt; microphones. [The later models use hard drives for storage making\n&gt; them less rugged for field use, IMHO, and require AC power making\n&gt; them less flexible as to location.] You can find used units in good\n&gt; condition and relatively cheap on ebay. (Oh - and you can use either\n&gt; USB download or read directly off the CF for storage/analysis.) Plus\n&gt; the multiple inputs allow you to record infrsound and ultrasound on\n&gt; separate channels in synch with the human audible sound range.\n&gt;\n&gt; For over a year now - I&#39;ve used the Zoom H4.\n&gt;\n&gt; http://www.samsontech.com/products/productpage.cfm?\n&gt; prodID=1901&brandID=4\n&gt;\n&gt; http://www.zzounds.com/item--ZOMH4\n&gt;\n&gt; Again...full spectrum, battery-operated, hand-held, uses SD storage.\n&gt; USB interface. The built-in stereo mikes are amazingly sensitive but\n&gt; the unit also has inputs for external mikes along with phantom power.\n&gt; I use it with a pair of noise-cancelling headphones and have\n&gt; definitly heard EVPs in real-time.\n&gt;\n&gt; Zoom also has a newer model - the H2. Just as good.\n&gt;\n&gt; http://www.samsontech.com/products/productpage.cfm?\n&gt; prodID=1916&brandID=4\n&gt;\n&gt; http://www.zzounds.com/item--ZOMH2\n&gt;\n&gt; The only complaint I have about the H4 is that it doesn&#39;t have a\n&gt; lanyard (I&#39;d hate to drop it) nor does it come with a carrying case\n&gt; (I bought a new case for a Fluke multimeter at an electronics supply\n&gt; shop which does the trick).\n&gt;\n&gt; Hope this helps.\n&gt;\n&gt; Guy Jackson\n&gt; Huntington Beach, CA\n&gt;\n&gt; Member, AAEVP\n&gt; Member, Rhine Research Center\n&gt; Member, editorial board, Journal of Paranormal Research\n&gt;\n&gt;\n&gt; ------------------------------------\n&gt;\n&gt; Yahoo! Groups Links\n&gt;\n&gt;\n&gt;\n&gt;"}