{"id": "1129", "subject": "The mess!", "author": "Frank Sumption", "timestamp": "2007-04-13T15:15:00Z", "full_text": "------=_NextPart_000_7bd3_6f3a_925\r\nContent-Type: text/plain; format=flowed\r\n\r\nHi All;\n\nBeen on nights all week, now swithced back to days, but haven&#39;t had time to \nget much done. The volume control wasn&#39;t working, so thought I needed a \nbuffer, but that wasn&#39;t it, so took that out, and replaced the band switch, \nthat also switched a single voulme control between the AM and FM tuners, a \nfunction done by the radio processor, inside the radio, but I have to \naccomplish manually. I think I had the dual volume controls crossed somehow. \nIn the past I used a mixer the add the stereo outputs from the FM tuner \ntogether, and that also served as a way to use a single volume control on \nthe output of the mixer for the echo box speaker driver, since I used just \nanother mixer channel for AM. Now I want to preserve the stereo function, \nand use two seperate amps, for two echo box speakers. The new band switch \nwas an old power switch from a Kodak slide porjector. I needed a triple pole \ndouble throw switch.  The is Geekdom at it&#39;s best!\n\nThis also makes the EVP/ITC setup seem complicated, which I wanted to avoid. \nIt&#39;s really just a radio, and triangle wave generator. I tried just \nconverting a pocket radio, but I run into problems with the IF frequency, \nand was gettign birdies across the band.\n\nFrank\n\n_________________________________________________________________\nMortgage rates near historic lows. Refinance $200,000 loan for as low as \n$771/month* \nhttps://www2.nextag.com/goto.jsp?product=100000035&url=%2fst.jsp&tm=y&search=mortgage_text_links_88_h27f8&disc=y&vers=689&s=4056&p=5117\n\r\n------=_NextPart_000_7bd3_6f3a_925\r\nContent-Type: image/pjpeg; name=&quot;Number23-wired.jpg&quot;\r\nContent-Disposition: attachment; filename=&quot;Number23-wired.jpg&quot;\r\n\r\n[ Attachment content not displayed ]\r\n------=_NextPart_000_7bd3_6f3a_925--"}