{"id": "11308", "subject": "Re: Today with Frank Box 31", "author": "purplespacefriend", "timestamp": "2008-06-16T03:54:42Z", "full_text": "Thanks Ann! I know some were beginng to wonder why nothing on 31. \n\n\n\n Frank-S\n\n--- In EVP-ITC@yahoogroups.com, Lisby &lt;lisby@...&gt; wrote:\n&gt;\n&gt; Sorry to have been so out of the loop. I&#39;ve had loads of articles  \n&gt; due. Rosemary Guiley and I also almost died of heatstroke at a \nshow  \n&gt; we were both working last weekend. It was over 100 at 10 am. I \ntold  \n&gt; her I was sorry to meet her looking so disreputable, but  \n&gt; circumstances were what they were... Anyway, Rosemary, let&#39;s try \nto  \n&gt; meet up in more civilized circs soon. :)\n&gt; \n&gt; Anyway, Frank gifted me box 31 about a month and half ago, and it \nhas  \n&gt; only been this week that my son and I have been able to A.) Get \nall  \n&gt; 18 batteries in the right direction without any falling out ;) , \nB.)  \n&gt; Sit down and see if we could make the connection. Yesterday got it  \n&gt; rolling, but first he had to turn on his RS hack and tell them \nabout  \n&gt; box 31 and that he wanted them to try it. He says almost \nimmediately  \n&gt; he began hearing Frank&#39;s name and &quot;purple&quot; through 31.\n&gt; \n&gt; Frank, I don&#39;t know what you do, but I swear it&#39;s like a baby \ntaking  \n&gt; its first breath or something--the &quot;reflex&quot; of the box seems to be \nto  \n&gt; call for you. Even my mini did, remember?\n&gt; \n&gt; So, we just did a session today. We didn&#39;t record it, because we  \n&gt; didn&#39;t figure we&#39;d get much and would fooling about with where to  \n&gt; hang the antenna wire and all. But, sure enough, within minutes, \nwe  \n&gt; were getting responses to our simple questions, hearing the tech  \n&gt; words I have become used to, such as &quot;check,&quot; the technician Stu \nsaid  \n&gt; his name, someone called my name, and when I asked if we should \nsign  \n&gt; off, someone clearly said, &quot;Yes.&quot; I said &quot;Thank you,&quot; and the  \n&gt; immediate response was, &quot;You&#39;re welcome.&quot;\n&gt; \n&gt; 31 is very different to my mini--I can see that already. Nick and \nI  \n&gt; will keep you posted about our next round of contact.\n&gt; \n&gt; \n&gt; Ann\n&gt;"}