{"id": "11309", "subject": "Re: Thrift Store junk.", "author": "purplespacefriend", "timestamp": "2008-06-16T04:03:12Z", "full_text": "Thanks! Well, the Sony Arm Band radio is almost usable, FM being \npretty weird. AM works with the usual 8 volt tuning voltage, but FM \nis tuned from 8 volts to 13 volts, probably because FM is also used \nfor TV and weather. I&#39;ll probably use it as an AM only box. \n\n The Honda radio seems usable. It was new enough that it had the anti \ntheft feature, requiring an access code to even turn on the radio. \nFortunately, someone had written the code on the bottom of the radio. \nI was able to work on the pin out of the tuner modules, not only \nthat, I had one of these exact same radios back in 2004, but no code, \nso never could figure out the tuners. I did keep the tuner modules, \nso hopefully I&#39;ll have two sets.\n\n Producing this stuff always seems to cause problems, and I don&#39;t \nknow what the solution is.\n\n Frank-S \n\n\n--- In EVP-ITC@yahoogroups.com, Rhonda W &lt;rhondak1973@...&gt; wrote:\n&gt;\n&gt; Hey Frank!\n&gt; Dont ya just love thrift stores?!&nbsp; Its amazing what ya can \nfind in those places if you actually go in and look.&nbsp; I not to \nbig on the 469 but I thik thatsonly cuz of the clicking...it just \nannoys me and I end up focusing on that rather than voices.&nbsp; \nWish I had the&nbsp;ability to make a box...maybe if they approve me \nfor school in the fall I&#39;ll take a cpl classes that would help...its \nnot criminal justice but it could be an elective hmmm, I&#39;ll have to \ncheck into that.&nbsp; Hope ur havin a good weekend so far.&nbsp; Oh \nI heard from that guy finally, we didnt get the boxes of radio parts! \nI was hopin...but I&#39;ll keep my eye out for more, ya never know what \npeople are giving away on freecycle!\n&gt; Rhonda\n&gt; \n&gt; --- On Sat, 6/14/08, Frank Sumption purplealiengirl@... wrote:\n&gt; \n&gt; From: Frank Sumption purplealiengirl@...\n&gt; Subject: [EVP-ITC] Thrift Store junk.\n&gt; To: &quot;Group&quot; evp-itc@yahoogroups.com\n&gt; Date: Saturday, June 14, 2008, 1:25 PM\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Hi All;\n&gt; &nbsp;\n&gt; &nbsp;Busy-busy-busy! I found the RS arm band radio works the best, \nthe 469 is a POS, mess with it too much and it quits working. I have \none with bad AM, and another with&nbsp;F&#39;d-Up FM. I found this Sony \nat the thrift store of $6.99, don&#39;t know if it&#39;s usable yet, but it&#39;s \nbetter than $35 for the RS. Anoither Honda radio, this one is only a \nmaybe at this point. \n&gt; &nbsp;\n&gt; &nbsp;Techno question; I see people making banks of RS 12-469s, and \nI can only&nbsp;ask&nbsp;why!?&nbsp; Some seem to have the technical \nexpertise to build the sweep circuit, why not just make a simple box \nthat&#39;s proven to work? I wouldn&#39;t use that multi-radio set up, it&#39;d \nbe impossible to understand anything from it.&nbsp; It would seem \nmore cost effective to start wit something that works. \n&gt; &nbsp;\n&gt; &nbsp;The 12-470 can use an external sweep voltage, but you have to \nlocate the converter stage that turns the digital pulses into a \nvoltge the varactor can use. It takes the 8 volts (max) for AM, but \nFM is weird, it tunes form +4 to 8 volts. I have newer car tuners \nlike this as well. \n&gt; &nbsp;\n&gt; &nbsp;Frank\n&gt; &nbsp;\n&gt; &nbsp;\n&gt; \n&gt; \n&gt; \n&gt; Instantly invite friends from Facebook and other social networks to \njoin you on Windows Live Messenger. Invite friends now!\n&gt;"}