{"id": "11307", "subject": "Re: Well, this is nuts!", "author": "purplespacefriend", "timestamp": "2008-06-16T03:50:51Z", "full_text": "It&#39;s just my own experience, but there seems to almost infinite \nlevels of existence, probably not all spirit, some are called \netheric, or astral beings. I got into this because the voices are \nextrmemly intriguing to me, and I don&#39;t what they claim to be as long \nas they talk. \n\n The 820 looks very easy to hack, there is a flat wire bundle fromthe \nclock board(it has the clock display) to the radio board, on the \nboard the wires are marked, just cut the one that says &quot;mute&quot;. That&#39;s \nall there is to it. \n\n I&#39;m using the 820 as the tuner module in a box, instead of doing the \nhack on it. So far, I like this radio the best out of the Radio Shack \nradios. It gas the advantage of not needing the relays toi turn it on \nwhen the box power is turned on. \n\n Frank-S\n\n--- In EVP-ITC@yahoogroups.com, Alexander T. &lt;dommiel666@...&gt; wrote:\n&gt;\n&gt; \n&gt; hi there frank i have some questions.. can you help me out \nplease...im a newbie on this...\n&gt;  \n&gt; im gonna buy the radio from radio shack... the 12-820 , then im \ngonna &quot;hack&quot; the radio..i dont know how...but must be a way to find \nout...after that.. how i use the radio?...i just &quot;ask? and &quot;they&quot; are \ngonna answer? or i just listen?. can they &quot;hear what i say?...and, i \nleave the radio in one station or i move the dial around?.. sorry but \ni dont know anything about this...but i would like to know more...i \nknow must be &quot;something there&quot;...\n&gt; and another question....the radio is just to &quot;contact&quot; \nspirits?...cause you  told me before that you have contact people \nfrom a diferent planet?.. about the rockets, something about &quot;they \nstop the rockets?.....im so confused, cause i though the EVP was only \nto contact &quot;spirits&quot;..\n&gt; now did you ever ask...where we going after we die?... too \nmany &quot;dumb questions huh&quot; ...gee...im sorry...\n&gt; &quot;The Darkside Of The Mirror Always Threw Our Malice Back&quot; \n&gt; \n&gt; \n&gt; To: evp-itc@...: purplealiengirl@...: Thu, 12 Jun 2008 11:46:21 -\n0600Subject: [EVP-ITC] Well, this is nuts!\n&gt; \n&gt; \n&gt; \n&gt; \n&gt;  I was home at lunch time, and turned on the RS radio I&#39;d been \nmanually tuning and asked if the little black spots were \naliens. &quot;They&quot; responded by saying &quot;they&#39;re formo Mars&quot;, so I \nsaid &quot;Martians!?&quot;, and they imediately said &quot;Correct&quot;, all this while \nI was manually tuning the FM band. that&#39;s not the first time I&#39;ve \nheard from, or about Martians. Some may recall that one of the first \nvoices form an echo chamber was  &quot;we come from the sixth planet&quot;. \nAccording to some contactees, such as George Adamski, all the planets \nare populated, albieit not on this level, perhaps on the astral, or \netheric. Adamski was the first UFO books I read as a 13 year old--\neons ago it seems.   Frank-S\n&gt; \n&gt; Enjoy 5 GB of free, password-protected online storage. Get Windows \nLive SkyDrive. \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; It&#39;s easy to add contacts from Facebook and other social sites \nthrough Windows Live Messenger. Learn how.\n&gt; https://www.invite2messenger.net/im/?source=TXT_EML_WLH_LearnHow\n&gt;"}