{"id": "11319", "subject": "Re: I&#39;m new; How do I start?", "author": "itcdeadpeople", "timestamp": "2008-06-17T22:39:00Z", "full_text": "Hi Clara.  You might start with exploring the manual sweep method.  As Charm \nmentioned, just about any radio will do.  Here&#39;s some instructions I&#39;ve previously written \nout.  Keep in mind that researchers each have the own &quot;style&quot; and preferences, so what I&#39;m \nsharing is my way of going about things, but certainly should not be considered the \n&#39;only/best/right&#39; way... it&#39;s just ONE way.  ;-)  I&#39;ll just copy/paste them here:\n\n     Turn on your radio to AM or FM, depending on your reception. Some areas don&#39;t receive \nAM very well.  I&#39;ve had good results using either band.  Start your recorder.  I record into \nmy computer using Audacity (it&#39;s a free download) and the built-in mic. Quickly move the \ndial from one end to another so only fragments of each channel currently broadcasting are \nheard coming through the speaker(s). Be mindful of the volume.  You want it to be not too \nloud nor too soft. \n\n     I&#39;ve noticed this technique works best with radios which allow for quickly moving \nthrough the channels. My favorite handheld radio is the Duracell KP028.  The dial is small \nand easily moves  through all the stations. I think that&#39;s key, that there not be long gaps \nbetween the stations or that it takes so long to move from station to station that multiple \nwords can be heard from each broadcast (some more expensive stereo units seem to be \nlike this). Also, it seems to not work well when there is a lot of static between stations.  So \nif need be, switch from AM to FM. \n\n     While you are moving the dial back and forth, talk as you would if you were having a \nconversation with someone in the room with you, only speak a little more slowly.  Wait a \nshort time between each question or comment. Somewhere between 10-15 seconds \nseems to be good, but you could wait as long as 30 seconds. \n\n     When reviewing the session, you&#39;ll want to listen for a voice that stands out from the \nrest of the radio sweep, and also for the words/phrases to be relevant. Sometimes the \nvoice will be choppy, as if formed from the snippets of broadcasts. [Opportunistic EVP]  \nOther times, the voice will float above the sweep sound. [or even take over the sweep \nsound completely -Transform EVP]  Listen first to an entire segment, starting with your \nvoice and ending just before you speak again.  Then go back and listen to that segment a \nfew seconds at a time.  Less clear responses can easily be missed during the first pass.\n \n     I have a tendency to discard almost all single words because they could have been from \nan actual broadcast, but when I hear a phrase that is longer, I know it could not have come \nfrom a single broadcasting station because I&#39;m sweeping the channels too quickly for \nmore than one syllable to be picked up by the microphone.  \n\nPlease, have patience if you try this.  Even if you are an experienced researcher, it takes \npractice to learn to hear the responses, just as it does to become accustomed to listening \nfor and hearing EVP.  \n\n----- I hope this helps some.  After a while, you will probably notice you are able to hear \nmore responses &quot;real-time&quot; because your ears will become more attuned to any method \nthat you work with a lot.  \n\nMargaret\n\n--- In EVP-ITC@yahoogroups.com, &quot;ghostpi559&quot; &lt;cfebach@...&gt; wrote:\n&gt;\n&gt; Hello everyone,\n&gt; \n&gt; I am Clara and I live in Central California. I have been a paranormal\n&gt; investigator since 2006 and I have been very fortunate to record many\n&gt; messages with digital and analog voice recorders.\n&gt; \n&gt; Within my investigative groups, I have always been the EVP tech. I\n&gt; have discovered that there are many more angles to EVP than just\n&gt; straight recording.\n&gt; \n&gt; I joined your group to learn more and boy I have been so fascinated\n&gt; with all the talk among you all with your equipment.\n&gt; \n&gt; How should I start? Who can give me some good advice on what I should\n&gt; try next? I am not gifted to be able to build things, maybe unless\n&gt; they are very easy.\n&gt; \n&gt; I would travel (with time to plan it) if I was able to learn more\n&gt; about other methods for capturing evp.\n&gt; \n&gt; Thank you for your time to read my message and hopefully you can help me.\n&gt;"}