{"id": "11315", "subject": "Re: [EVP-ITC] Re: Today with Frank Box 31", "author": "Lisby", "timestamp": "2008-06-16T15:51:04Z", "full_text": "I&#39;ve just been so darned busy. :( I&#39;m trying to get all kinds of  \nstuff written so that I can take my annual camping vacation in July  \nand actually be away from the magazine for 2 whole weeks. But I was  \nreally intrigued by what happened the other day. I think Nick and I  \nare going to give a go again today, since he&#39;s now out of school. But  \nI can say that 31 seems to like us as adoptive family. ;)\n\nDon&#39;t think I&#39;ve forgotten about you, buddy. Not happening.\n\nAnn\n\nOn Jun 15, 2008, at 11:54 PM, purplespacefriend wrote:\n\n&gt; Thanks Ann! I know some were beginng to wonder why nothing on 31.\n&gt;\n&gt; Frank-S\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, Lisby &lt;lisby@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Sorry to have been so out of the loop. I&#39;ve had loads of articles\n&gt; &gt; due. Rosemary Guiley and I also almost died of heatstroke at a\n&gt; show\n&gt; &gt; we were both working last weekend. It was over 100 at 10 am. I\n&gt; told\n&gt; &gt; her I was sorry to meet her looking so disreputable, but\n&gt; &gt; circumstances were what they were... Anyway, Rosemary, let&#39;s try\n&gt; to\n&gt; &gt; meet up in more civilized circs soon. :)\n&gt; &gt;\n&gt; &gt; Anyway, Frank gifted me box 31 about a month and half ago, and it\n&gt; has\n&gt; &gt; only been this week that my son and I have been able to A.) Get\n&gt; all\n&gt; &gt; 18 batteries in the right direction without any falling out ;) ,\n&gt; B.)\n&gt; &gt; Sit down and see if we could make the connection. Yesterday got it\n&gt; &gt; rolling, but first he had to turn on his RS hack and tell them\n&gt; about\n&gt; &gt; box 31 and that he wanted them to try it. He says almost\n&gt; immediately\n&gt; &gt; he began hearing Frank&#39;s name and &quot;purple&quot; through 31.\n&gt; &gt;\n&gt; &gt; Frank, I don&#39;t know what you do, but I swear it&#39;s like a baby\n&gt; taking\n&gt; &gt; its first breath or something--the &quot;reflex&quot; of the box seems to be\n&gt; to\n&gt; &gt; call for you. Even my mini did, remember?\n&gt; &gt;\n&gt; &gt; So, we just did a session today. We didn&#39;t record it, because we\n&gt; &gt; didn&#39;t figure we&#39;d get much and would fooling about with where to\n&gt; &gt; hang the antenna wire and all. But, sure enough, within minutes,\n&gt; we\n&gt; &gt; were getting responses to our simple questions, hearing the tech\n&gt; &gt; words I have become used to, such as &quot;check,&quot; the technician Stu\n&gt; said\n&gt; &gt; his name, someone called my name, and when I asked if we should\n&gt; sign\n&gt; &gt; off, someone clearly said, &quot;Yes.&quot; I said &quot;Thank you,&quot; and the\n&gt; &gt; immediate response was, &quot;You&#39;re welcome.&quot;\n&gt; &gt;\n&gt; &gt; 31 is very different to my mini--I can see that already. Nick and\n&gt; I\n&gt; &gt; will keep you posted about our next round of contact.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Ann\n&gt; &gt;\n&gt;\n&gt;\n&gt; \n\n\nI' e jus been so da ned busy. :( I'm ying o ge all kinds o s u w i en so ha I can ake my annual camping aca ion in July and ac ually be away om he magazine o 2 whole weeks. Bu I was eally in igued by wha happened he o he day. I hink Nick and I a e going o gi e a go again oday, since he's now ou o school. Bu I can say ha 31 seems o like us as adop i e amily. ;)Don' hink I' e o go en abou you, buddy. No happening. AnnOn Jun 15, 2008, a 11:54 PM, pu plespace iend w o e:Thanks Ann! I know some we e beginng o wonde why no hing on 31. F ank-S--- In EVP-ITC@yahoog oups.com, Lisby w o e:>> So y o ha e been so ou o he loop. I' e had loads o a icles > due. Rosema y Guiley and I also almos died o hea s oke a a show > we we e bo h wo king las weekend. I was o e 100 a 10 am. I  old > he I was so y o mee he looking so dis epu able, bu  > ci cums ances we e wha hey we e... Anyway, Rosema y, le 's y  o > mee up in mo e ci ilized ci cs soon. :)> > Anyway, F ank gi ed me box 31 abou a mon h and hal ago, and i  has > only been his week ha my son and I ha e been able o A.) Ge  all > 18 ba e ies in he igh di ec ion wi hou any alling ou ;) , B.) > Si down and see i we could make he connec ion. Yes e day go i  > olling, bu i s he had o u n on his RS hack and ell hem abou  > box 31 and ha he wan ed hem o y i . He says almos  immedia ely > he began hea ing F ank's name and \"pu ple\" h ough 31.> > F ank, I don' know wha you do, bu I swea i 's like a baby  aking > i s i s b ea h o some hing-- he \" e lex\" o he box seems o be  o > call o you. E en my mini did, emembe ?> > So, we jus did a session oday. We didn' eco d i , because we > didn' igu e we'd ge much and would ooling abou wi h whe e o > hang he an enna wi e and all. Bu , su e enough, wi hin minu es, we > we e ge ing esponses o ou simple ques ions, hea ing he ech > wo ds I ha e become used o, such as \"check,\" he echnician S u said > his name, someone called my name, and when I asked i we should sign > o , someone clea ly said, \"Yes.\" I said \"Thank you,\" and he > immedia e esponse was, \"You' e welcome.\"> > 31 is e y di e en o my mini--I can see ha al eady. Nick and I > will keep you pos ed abou ou nex ound o con ac .> > > Ann>"}