{"id": "11320", "subject": "Re: I&#39;m new; How do I start?", "author": "itcdeadpeople", "timestamp": "2008-06-18T00:14:18Z", "full_text": "Hi Clara... I forgot to add about the Radio Shack units... if you decided to go with \nautomated sweep, you can pick up one of three current models at a RS retail outlet, or \norder online:  20-125, 12-820, or 12-469 (the 469 is my least favorite model as it makes \nan annoying click-click-clicking as it sweeps ... none of the other models do this).\n\nIf you should happen to see an old 12-469 (grey/white, not all white) that works well, as \ndoes the old 12-470 (grey/white, not all black).  The new all black 12-470 isn&#39;t hackable.  \nPlease don&#39;t pay crazy prices for either of these models, as the currently available ones \nwork perfectly well.\n\nThe hack is pretty much the same... open them up and snip the wire running to the &#39;mute.&#39;  \nOn the 12-469 you can snip, or bend, the mute pin.  And there&#39;s videos on YouTube that \ncan help you through the modification process.  Really, it&#39;s pretty simple.\n\nThis will make it so the units continuously sweep through the channels for you.  I find that \nmanual sweep (at least for me) produces longer, clearer responses often in a single tone \nof voice, but the shack hacks can produce some pretty amazing material as well.\n\nLet us know what you decide to try and how you do with it.  :-)\n\nMargaret\n\n--- In EVP-ITC@yahoogroups.com, &quot;ghostpi559&quot; &lt;cfebach@...&gt; wrote:\n&gt;\n&gt; Hello everyone,\n&gt; \n&gt; I am Clara and I live in Central California. I have been a paranormal\n&gt; investigator since 2006 and I have been very fortunate to record many\n&gt; messages with digital and analog voice recorders.\n&gt; \n&gt; Within my investigative groups, I have always been the EVP tech. I\n&gt; have discovered that there are many more angles to EVP than just\n&gt; straight recording.\n&gt; \n&gt; I joined your group to learn more and boy I have been so fascinated\n&gt; with all the talk among you all with your equipment.\n&gt; \n&gt; How should I start? Who can give me some good advice on what I should\n&gt; try next? I am not gifted to be able to build things, maybe unless\n&gt; they are very easy.\n&gt; \n&gt; I would travel (with time to plan it) if I was able to learn more\n&gt; about other methods for capturing evp.\n&gt; \n&gt; Thank you for your time to read my message and hopefully you can help me.\n&gt;"}