{"id": "11337", "subject": "Who says there&#39;s no box advancement!?", "author": "Frank Sumption", "timestamp": "2008-06-22T07:40:55Z", "full_text": "--_bd6e5089-0aa9-412d-812d-fe1e42f21276_\r\nContent-Type: multipart/alternative;\n\tboundary=&quot;_db9f6d1e-41d6-44da-9418-421969699f39_&quot;\r\n\r\n\r\n--_db9f6d1e-41d6-44da-9418-421969699f39_\r\nContent-Type: text/plain; charset=&quot;Windows-1252&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n\n I&#39;m pretty hesitant to show this stuff, it just creates demands. \n \n The =\r\ntop board is linear sweep with the audio amplifiers. The bottom board is th=\r\ne RVG, and can be left off if desired. A bare copper board between the two =\r\nacts like a shield to keep white noise out of the audio. It&#39;s designed to b=\r\ne used with most kinds of voltage tunable radios, and this set is used with=\r\n the Arm Band radio from RS.  I still can&#39;t mass produce these, it took all=\r\n week to put this together, and I can hand wire a board almost as fast. The=\r\nn there&#39;s the problem of suitable tuners, and other parts. \n \n There&#39;s some=\r\n surface mount components, adding to the assembly complexity, and difficult=\r\ny. \n \n The boards are from ExpressPCB using their mini board service, three=\r\n boards=3D$60, there&#39;s no solder mask, or silkscreen, but the components ar=\r\ne labeled on the layout. The board size is also limited, 2-1/2 X 3-11/16(3.=\r\n8 in.). \n \n I hate to stir up a hornets nest by presenting new stuff, but I=\r\n&#39;m kinda proud of this. I&#39;ll share the layouts with those capable of assemb=\r\nling the boards themselves. They would still have to come up with tuners, c=\r\nontrols, switches, and an enclosure, besides paying for the boards to be et=\r\nched. Most of the shielded wire I use is scavenged out of computer monitor =\r\nVGA cables, old VCRs, and tape decks. You need three conductor shielded for=\r\n the tone control, and two conductor shielded wire for the volume controls.=\r\n I do use shielded wire for the speaker outputs, mic input, and line output=\r\ns. Not all old VCRs have the shielded wire, and I haven&#39;t found anywhere to=\r\n buy what is needed. \n \n I&#39;m calling this one 40 cuz it was assembled, and =\r\nmade operational after #39. \n \n Frank-S\n___________________________________=\r\n______________________________\nThe i=92m Talkathon starts 6/24/08.=A0 For n=\r\now, give amongst yourselves.\nhttp://www.imtalkathon.com?source=3DTXT_EML_WL=\r\nH_LearnMore_GiveAmongst\r\n--_db9f6d1e-41d6-44da-9418-421969699f39_\r\nContent-Type: text/html; charset=&quot;Windows-1252&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;\n&lt;head&gt;\n&lt;style&gt;\n.hmmessage P\n{\nmargin:0px;\npadding:0px\n}\nbody.hmmessa=\r\nge\n{\nFONT-SIZE: 10pt;\nFONT-FAMILY:Tahoma\n}\n&lt;/style&gt;\n&lt;/head&gt;\n&lt;body class=3D&#39;=\r\nhmmessage&#39;&gt;\n&nbsp;I&#39;m pretty hesitant to show this stuff, it just creates d=\r\nemands. &lt;BR&gt;\n&nbsp;&lt;BR&gt;\n&nbsp;The top board is linear sweep with the audio =\r\namplifiers. The bottom board is the RVG, and can be left off if desired.&nb=\r\nsp;A bare copper board between the two acts like a shield to keep white noi=\r\nse out of the audio. It&#39;s designed to be used with most kinds of voltage tu=\r\nnable radios, and this set is used with the Arm Band radio from RS.&nbsp; I=\r\n still can&#39;t mass produce these, it took all week to put this together, and=\r\n I can hand wire a board almost as fast. Then there&#39;s the problem of suitab=\r\nle tuners, and other parts. &lt;BR&gt;\n&nbsp;&lt;BR&gt;\n&nbsp;There&#39;s some surface moun=\r\nt components, adding to the assembly complexity, and difficulty. &lt;BR&gt;\n&nbsp=\r\n;&lt;BR&gt;\n&nbsp;The boards are from ExpressPCB using their mini board service, =\r\nthree boards=3D$60, there&#39;s no solder mask, or silkscreen, but the componen=\r\nts are labeled on the layout. The board&nbsp;size is also limited, 2-1/2 X =\r\n3-11/16(3.8 in.).&nbsp;&lt;BR&gt;\n&nbsp;&lt;BR&gt;\n&nbsp;I hate to stir up a hornets ne=\r\nst by presenting new stuff, but I&#39;m kinda proud of this. I&#39;ll share the lay=\r\nouts with those capable of assembling the boards themselves. They would sti=\r\nll have to come up with tuners, controls, switches, and an enclosure, besid=\r\nes paying for the boards to be etched. Most of the shielded wire I use is s=\r\ncavenged out of computer monitor VGA cables, old VCRs, and tape decks. You =\r\nneed three conductor shielded for the tone control, and two conductor shiel=\r\nded wire for the volume controls. I do use shielded wire for the speaker ou=\r\ntputs, mic input, and line outputs. Not all old VCRs have the shielded wire=\r\n, and I haven&#39;t found anywhere to buy what is needed. &lt;BR&gt;\n&nbsp;&lt;BR&gt;\n&nbsp=\r\n;I&#39;m calling this one 40 cuz it was assembled, and made operational after #=\r\n39. &lt;BR&gt;\n&nbsp;&lt;BR&gt;\n&nbsp;Frank-S&lt;BR&gt;&lt;br /&gt;&lt;hr /&gt;The i=92m Talkathon starts=\r\n 6/24/08.=A0 For now, give amongst yourselves. &lt;a href=3D&#39;http://www.imtalk=\r\nathon.com?source=3DTXT_EML_WLH_LearnMore_GiveAmongst&#39; target=3D&#39;_new&#39;&gt;Learn=\r\n More&lt;/a&gt;&lt;/body&gt;\n&lt;/html&gt;\r\n--_db9f6d1e-41d6-44da-9418-421969699f39_--\r\n\n\r\n--_bd6e5089-0aa9-412d-812d-fe1e42f21276_\r\nContent-Type: video/3gpp2\r\nContent-Disposition: attachment; filename=&quot;062108-40-AM-Random.3g2&quot;\r\n\r\n[ Attachment content not displayed ]\r\n--_bd6e5089-0aa9-412d-812d-fe1e42f21276_\r\nContent-Type: image/pjpeg\r\nContent-Disposition: attachment; filename=&quot;062208-StackedBoards.jpg&quot;\r\n\r\n[ Attachment content not displayed ]\r\n--_bd6e5089-0aa9-412d-812d-fe1e42f21276_--"}