{"id": "11350", "subject": "[EVP-ITC] So I had a really weird dream last nite", "author": "Rhonda W", "timestamp": "2008-06-23T21:46:39Z", "full_text": "--0-851609447-1214257599=:40798\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nHopefully I can remember it all....I was walking with 3 friends of mine, 2 =\r\ngals and a guy and we were walking by this simple house and the guy said le=\r\nts check it out cuz he thought it looked abandoned...so we kinda checked it=\r\n out and I found a sign that said it was an Edgar Cayce research house.=A0 =\r\nSo after much protesting from me we went inside and looked around...it did =\r\nlook abandoned and for some reason we had tape recorders with us so we were=\r\n doing an evp session.=A0 Then all of a sudden I hear someone peeing in the=\r\n bathroom..sounds like a man and nobody believes me...then this HUGE guy co=\r\nmes out and he gets really pissed off and chases us off but he also sends s=\r\nome kinda paranormal punishment with us...one of the gals gets a spanking b=\r\ny a hand she cant see....but I dont remember what the rest of us got.=A0 Bu=\r\nt I had gone back later to say sorry and ended up driving a flatbed semi fo=\r\nr them, hauling stuff to different speaking events.=A0 The big guy had\n me =\r\nhook up a tv on the back f the truck, facing cars behind and had it playing=\r\n something about Edgar Cayce on it.\n=A0\nThen I woke up...thats about all I =\r\nremember.=A0 Weird huh? lol\nRhonda\n\n\n      \r\n--0-851609447-1214257599=:40798\r\nContent-Type: text/html; charset=us-ascii\r\n\r\n&lt;table cellspacing=&#39;0&#39; cellpadding=&#39;0&#39; border=&#39;0&#39; &gt;&lt;tr&gt;&lt;td valign=&#39;top&#39; style=&#39;font: inherit;&#39;&gt;&lt;P&gt;Hopefully I can remember it all....I was walking with 3 friends of mine, 2 gals and a guy and we were walking by this simple house and the guy said lets check it out cuz he thought it looked abandoned...so we kinda checked it out and I found a sign that said it was an Edgar Cayce research house.&nbsp; So after much protesting from me we went inside and looked around...it did look abandoned and for some reason we had tape recorders with us so we were doing an evp session.&nbsp; Then all of a sudden I hear someone peeing in the bathroom..sounds like a man and nobody believes me...then this HUGE guy comes out and he gets really pissed off and chases us off but he also sends some kinda paranormal punishment with us...one of the gals gets a spanking by a hand she cant see....but I dont remember what the rest of us got.&nbsp; But I had gone back later to say sorry\n and ended up driving a flatbed semi for them, hauling stuff to different speaking events.&nbsp; The big guy had me hook up a tv on the back f the truck, facing cars behind and had it playing something about Edgar Cayce on it.&lt;/P&gt;\n&lt;P&gt;&nbsp;&lt;/P&gt;\n&lt;P&gt;Then I woke up...thats about all I remember.&nbsp; Weird huh? lol&lt;/P&gt;\n&lt;P&gt;Rhonda&lt;/P&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n      \r\n--0-851609447-1214257599=:40798--"}