{"id": "11362", "subject": "Re: [EVP-ITC] Newbie Intro and Questions", "author": "Misty Dawn", "timestamp": "2008-06-25T20:13:54Z", "full_text": "Hi Angela\n\nWelcome to the group =) Sounds like you have everything you need to get started. My answer would be yes you pretty much have everything which is the recording device and the software on your pc to analyze your files. \n\nAs for why some files are fine and others are not I find that when a file doesnt play directly its easier to just download it and play it in audacity or whatever.\n\nGive it a try and see what ya get.\n\nMisty\n\n\n\n--- On Wed, 6/25/08, earthangel5998 &lt;harris5998@...&gt; wrote:\n\n&gt; From: earthangel5998 &lt;harris5998@...&gt;\n&gt; Subject: [EVP-ITC] Newbie Intro and Questions\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Wednesday, June 25, 2008, 2:59 PM\n&gt; Hi everyone, \n&gt; \n&gt; My name is Angela, I am 30 years old, married mother of\n&gt; two. Been \n&gt; interested in the paranormal for as long as I can remember.\n&gt; Was \n&gt; recently in an investigation group but the leader was a\n&gt; very pushy, \n&gt; obnoxious individual that basically scared everyone off.\n&gt; Anyway...\n&gt; \n&gt; I was listening to some of the files. Nice work! However\n&gt; some of them \n&gt; won&#39;t open, when I try to open some of them I get a\n&gt; message that \n&gt; says &quot;Windows Media Player cannot find the file&quot;\n&gt; or cannot open the \n&gt; file something like that...anyone know why some files play\n&gt; and others \n&gt; won&#39;t? \n&gt; \n&gt; Also...I am interested in capturing EVPs myself. However I\n&gt; don&#39;t have \n&gt; much equipment. \n&gt; \n&gt; I have a computer of course, and a pair of stereo quality\n&gt; headphones \n&gt; with microphone attached (like the kind a call center would\n&gt; use) My \n&gt; computer is right next to our air conditioner so that could\n&gt; provide \n&gt; the &quot;white noise&quot; \n&gt; \n&gt; Could I possibly record with nothing more than a headphone\n&gt; mouthpiece \n&gt; and a freeware program like Audacity? Or do I need\n&gt; something more \n&gt; extensive? \n&gt; \n&gt; Also are there any risks of doing EVP in one&#39;s home? I\n&gt; don&#39;t suspect \n&gt; paranormal activity here but I read Tom and Lisa\n&gt; Butler&#39;s book &quot;There \n&gt; is No Death and There are No Dead&quot; where they talk\n&gt; about making \n&gt; contact with &quot;The Other Side&quot; even in locations\n&gt; that are \n&gt; not &quot;haunted&quot; such as one&#39;s home. \n&gt; \n&gt; Any suggestions, tips, advice, input would be greatly\n&gt; appreciated!\n&gt; \n&gt; Thanks! \n&gt; Angela"}