{"id": "11417", "subject": "The Myth of Using Germanium Diodes (was Re: All In One Device)", "author": "purplespacefriend", "timestamp": "2008-06-27T21:51:12Z", "full_text": "It&#39;s been my expereince that you need to supply something for the \nentities to form voices out of, doesn&#39;t matter how you do it, they \nwill use what you use. I use radio a convinient source of this raw \naudio, that&#39;s the only reason I use radio tuners. It&#39;s possible some \nof the vocies come in on an RF carrier, but I can&#39;t tell. \n\n Frank-S\n\n--- In EVP-ITC@yahoogroups.com, &quot;seanjankowski1&quot; \n&lt;seanjankowski1@...&gt; wrote:\n&gt;\n&gt; Spelling corrections, information corrections... Thanks for the \nedit\n&gt; and for the information. I&#39;ll make sure before I post again that I\n&gt; have all the information straight. Not here to argue or anything \nas a\n&gt; matter of fact I want to thank you for giving me the facts as they\n&gt; should be. It&#39;s been a while since I actually read anything from \nWITC. \n&gt; \n&gt; As I said, I was searching out ways to bring all the devices and \ntheir\n&gt; uses into one unit. It might help prove that the phenomena is real \nif\n&gt; I could get multiple confirmations on one unit. Of course you can\n&gt; always just use many units at once and get the same effect. \n&gt; \n&gt; Thanks for the info. \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Guy&quot; &lt;yzzzguy@&gt; wrote:\n&gt; &gt;\n&gt; &gt; There is NO research anywhere which shows that germanium diodes \nare \n&gt; &gt; superior to silicon diodes as far as the &quot;diode method&quot; is \nconcerned.\n&gt; &gt; \n&gt; &gt; Konstantin Raudive didn&#39;t pioneer the &quot;diode method&quot; (sorry - \nexactly \n&gt; &gt; who did escapes me for the moment). I have a copy \nof &quot;Breakthrough&quot; \n&gt; &gt; which is the only English translation of any of Raudive&#39;s books \nand \n&gt; &gt; the &quot;diode method&quot; is described in an appendix. The diagram in \nthe \n&gt; &gt; appendix note shown there (and I can scan in the page in the \nbook and \n&gt; &gt; post here, if anyone likes) shows a typical 1N914 diode which \nuses \n&gt; &gt; silicon as the base semiconductor.\n&gt; &gt; \n&gt; &gt; The only &quot;transcommunication device&quot; I&#39;m aware of that \nspecifically \n&gt; &gt; called out for the use of germanium was the one diagrammed by \nthe \n&gt; &gt; spirits in one of the Scole Experiments (and even then - it was \na \n&gt; &gt; block of this material - not a component diode).\n&gt; &gt; \n&gt; &gt; By the way - it was &quot;Konstantin Raudive&quot; (with a &quot;k&quot;), &quot;Franz \nSeidl&quot; \n&gt; &gt; (not Seidle...See Jean de Muelder&#39;s website for original \ndiagrams of \n&gt; &gt; the Psychofon from Seidl&#39;s book \n&gt; &gt; http://jeandemeulder.transcommunicatie.nl/psychophone2.htm) \n&gt; &gt; and &quot;George Meek&quot; (no &quot;s&quot;). Additionally - George Meek&#39;s \nMetascience \n&gt; &gt; Foundation developed at least 5 different models of the Spiricom \n&gt; &gt; (most people are only familiar with Bill O&#39;Neil&#39;s Mark IV).\n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;seanjankowski1&quot; \n&lt;seanjankowski1@&gt; \n&gt; &gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; Sure RetroCom,\n&gt; &gt; &gt; \n&gt; &gt; &gt; According to WORLDITC there are many different devices using \n&gt; &gt; different\n&gt; &gt; &gt; aspects of the radio and white-noise spectrum. Constantine \nRaudive\n&gt; &gt; &gt; used germanium diodes to capture EVPs. Siedle built his \npsychophone,\n&gt; &gt; &gt; George Meeks had the Spiricom tone device. Now you have the \ndiode \n&gt; &gt; for\n&gt; &gt; &gt; white noise, radio wave HF static, and a tone device. I am \n&gt; &gt; attempting\n&gt; &gt; &gt; to build an all in one audio recording and communication \ndevice. I \n&gt; &gt; am\n&gt; &gt; &gt; doing this to see if by having a combined unit you can get \ncontact\n&gt; &gt; &gt; with either one or the other or perhaps multiple contacts at \none \n&gt; &gt; time.  \n&gt; &gt; &gt; \n&gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot; RetroCom&quot; &lt;vfp19968@&gt; wrote:\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Can you define with some detail &quot;all ways&quot; ?\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; --- seanjankowski1@ wrote:\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; From: &quot;seanjankowski1&quot; &lt;seanjankowski1@&gt;\n&gt; &gt; &gt; &gt; To: EVP-ITC@yahoogroups.com\n&gt; &gt; &gt; &gt; Subject: [EVP-ITC] All In One Device\n&gt; &gt; &gt; &gt; Date: Wed, 25 Jun 2008 15:10:33 -0000\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; This is my first post. I was wondering if anyone had created \nan \n&gt; &gt; all in\n&gt; &gt; &gt; &gt; one ITC EVP device. I know that researchers such as Seidle \nhad \n&gt; &gt; created\n&gt; &gt; &gt; &gt; the psychophone that seemed to cover many aspects of ITC but \nI \n&gt; &gt; have\n&gt; &gt; &gt; &gt; yet to see all ways of communication in one device.\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; I have created an all in one design that covers most of the \n&gt; &gt; devices\n&gt; &gt; &gt; &gt; used. If you wish I will share the design.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}