{"id": "11428", "subject": "Re: EVP and James Randi -- My Questions", "author": "Steve Hultay", "timestamp": "2008-06-28T11:07:51Z", "full_text": "Angela,\n\nIf you are looking to get started with a simple ghost box, i would \nsuggest a 20-125 model by radio shack.  It incorporates a speaker and \nis able to sweep AM, FM and shortwave.  The simple procedure is on my \nsite.\n\nhttp://www.keyportparanormal.com/simpleghostboxhack.html\n\nOther models that are available for the hack are as follows:\n\n12-469 (New Model White)---Pull the Mute pin off the board once \nopened.\n\n20-125 --- Cut wire on ribbon going to the &quot;Mute&quot; markings on the \nboard.\n\n12-820 --- Cut wire going to &quot;Mute&quot; on the board\n\n12-150 --- Cut Wire going to &quot;Mute&quot; on the board.  This is my latest \nfind and is a bit harder to get at the wiring, but can be done.  It \nalso incorporates a built in speaker.\n\n12-469 and 12-820 will need an external speaker, but they come with \nearbuds.  I use a 21-549 speaker from radio shack, it works well and \nis fairly inexpensive.\n\n-Steve H.\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;Misty&quot; &lt;bulletbabea@...&gt; wrote:\n&gt;\n&gt; Hi Angela\n&gt; \n&gt; LOL! Why dont they just give the winning lotto numbers that would \nbe \n&gt; easier to aquire =)\n&gt; \n&gt; Personally I never seek to prove this to anyone, they should \n&gt; prove/disprove it themselves. Even amongst those who arent \nskeptics, \n&gt; hearing varies. Sometimes everyones hears the same sometimes they \n&gt; dont. \n&gt; \n&gt; I also dont ask about lotto numbers LOL I dont play it.\n&gt; \n&gt; As for building one yourself, most are trying out the radio \n&gt; modifications like the 12-470 or the 12-469 (horrible clicking on \nthe \n&gt; 469 model but a few have gotten around it. Theres a few others \nFrank \n&gt; and Steve have messed with. I think ones the 12-125 but I am a bit \n&gt; tired so all the model numbers arent popping in my head at the \nmoment.\n&gt; \n&gt; A few &quot;how to&quot; videos have been posted on youtube. You can type in \n&gt; the model numbers to access a few of Mike Colletta&#39;s (ufogeek)\n&gt; available posts as well as several others who have made thier video \n&gt; instructions available online. \n&gt; \n&gt; I did try out a fan test session the other day. Tho they werent as \n&gt; loud as with water, I could still discern a few statements. They \nwere \n&gt; so &quot;bass&quot; in tone that its almost out of my hearing range on a few \nso \n&gt; I didnt post them all. As for the ones I did they can be found on \nmy \n&gt; esnips \n&gt; \n&gt; http://www.esnips.com/web/MiscellaneousMethodsofEVP\n&gt; \n&gt; That should take ya to the right folder\n&gt; \n&gt; Misty\n&gt; \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;earthangel5998&quot; &lt;harris5998@&gt; \n&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hi everyone, \n&gt; &gt; \n&gt; &gt; I&#39;m sure lots of you know who James Randi is, the skeptic who \n&gt; offers $1 \n&gt; &gt; million for proof of the paranormal. \n&gt; &gt; \n&gt; &gt; I am wondering why there hasn&#39;t been an EVP demonstration good \n&gt; enough \n&gt; &gt; to win the prize. I have never captured an EVP, but many people \n&gt; have \n&gt; &gt; including those in this group. I cannot say (like James Randi \n&gt; &gt; apparently and others like him) that I think every person who \n&gt; captured \n&gt; &gt; an EVP is a fraud or captured a fluke or something like that. I \n&gt; don&#39;t \n&gt; &gt; think that at all, it appears to me that many of them are the \nreal \n&gt; &gt; deal, of that I am almost 100% certain and will be 100% certain \nif \n&gt; I \n&gt; &gt; can ever capture my own. \n&gt; &gt; \n&gt; &gt; I don&#39;t know a lot about James Randi or EVP for that matter, but \nit \n&gt; is \n&gt; &gt; a question that came up. Can anyone enlighten me? \n&gt; &gt; \n&gt; &gt; I tried a few sessions last night but came up empty handed. I am \n&gt; &gt; starting to think my white noise isn&#39;t loud enough. I&#39;m going to \n&gt; keep \n&gt; &gt; trying. \n&gt; &gt; \n&gt; &gt; Also I hope to experiment with ITC images. And soon I want to \nbuild \n&gt; &gt; a &quot;box&quot; which I keep hearing so much about. I don&#39;t know the \nfirst \n&gt; &gt; thing about these ghost/spirit boxes as I&#39;ve heard them called, \nall \n&gt; I \n&gt; &gt; know is I want to learn to build one and use it as I&#39;ve heard \nsome \n&gt; &gt; interesting audio files here. But that&#39;s probably a good subject \n&gt; for a \n&gt; &gt; separate post unless anyone can give me an informative how-to \nlink \n&gt; or \n&gt; &gt; anything. \n&gt; &gt; \n&gt; &gt; Thanks!\n&gt; &gt; Angela\n&gt; &gt;\n&gt;"}