{"id": "11427", "subject": "Re: EVP and James Randi -- My Questions", "author": "Misty", "timestamp": "2008-06-28T05:22:08Z", "full_text": "Hi Angela\n\nLOL! Why dont they just give the winning lotto numbers that would be \neasier to aquire =)\n\nPersonally I never seek to prove this to anyone, they should \nprove/disprove it themselves. Even amongst those who arent skeptics, \nhearing varies. Sometimes everyones hears the same sometimes they \ndont. \n\nI also dont ask about lotto numbers LOL I dont play it.\n\nAs for building one yourself, most are trying out the radio \nmodifications like the 12-470 or the 12-469 (horrible clicking on the \n469 model but a few have gotten around it. Theres a few others Frank \nand Steve have messed with. I think ones the 12-125 but I am a bit \ntired so all the model numbers arent popping in my head at the moment.\n\nA few &quot;how to&quot; videos have been posted on youtube. You can type in \nthe model numbers to access a few of Mike Colletta&#39;s (ufogeek)\navailable posts as well as several others who have made thier video \ninstructions available online. \n\nI did try out a fan test session the other day. Tho they werent as \nloud as with water, I could still discern a few statements. They were \nso &quot;bass&quot; in tone that its almost out of my hearing range on a few so \nI didnt post them all. As for the ones I did they can be found on my \nesnips \n\nhttp://www.esnips.com/web/MiscellaneousMethodsofEVP\n\nThat should take ya to the right folder\n\nMisty\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;earthangel5998&quot; &lt;harris5998@...&gt; \nwrote:\n&gt;\n&gt; Hi everyone, \n&gt; \n&gt; I&#39;m sure lots of you know who James Randi is, the skeptic who \noffers $1 \n&gt; million for proof of the paranormal. \n&gt; \n&gt; I am wondering why there hasn&#39;t been an EVP demonstration good \nenough \n&gt; to win the prize. I have never captured an EVP, but many people \nhave \n&gt; including those in this group. I cannot say (like James Randi \n&gt; apparently and others like him) that I think every person who \ncaptured \n&gt; an EVP is a fraud or captured a fluke or something like that. I \ndon&#39;t \n&gt; think that at all, it appears to me that many of them are the real \n&gt; deal, of that I am almost 100% certain and will be 100% certain if \nI \n&gt; can ever capture my own. \n&gt; \n&gt; I don&#39;t know a lot about James Randi or EVP for that matter, but it \nis \n&gt; a question that came up. Can anyone enlighten me? \n&gt; \n&gt; I tried a few sessions last night but came up empty handed. I am \n&gt; starting to think my white noise isn&#39;t loud enough. I&#39;m going to \nkeep \n&gt; trying. \n&gt; \n&gt; Also I hope to experiment with ITC images. And soon I want to build \n&gt; a &quot;box&quot; which I keep hearing so much about. I don&#39;t know the first \n&gt; thing about these ghost/spirit boxes as I&#39;ve heard them called, all \nI \n&gt; know is I want to learn to build one and use it as I&#39;ve heard some \n&gt; interesting audio files here. But that&#39;s probably a good subject \nfor a \n&gt; separate post unless anyone can give me an informative how-to link \nor \n&gt; anything. \n&gt; \n&gt; Thanks!\n&gt; Angela\n&gt;"}