{"id": "11430", "subject": "Re: EVP and James Randi -- My Questions", "author": "earthangel5998", "timestamp": "2008-06-28T13:02:34Z", "full_text": "Thanks Misty...I know the whole James Randi thing is ridiculous. I \nwould just LOVE to see him knocked off his high horse. I am a natural \nskeptic yet I &quot;know&quot; something is out there and can&#39;t wait to find it \nfor myself. Thanks for the tips, I&#39;m still confused but I&#39;ll read up \non that link and check out the You Tube tutorials, I appreciate your \nguidance and look forward to learning and making progress in this \nfascinating field. Have a great day :) \n\nAngela \n\n--- In EVP-ITC@yahoogroups.com, &quot;Misty&quot; &lt;bulletbabea@...&gt; wrote:\n&gt;\n&gt; Hi Angela\n&gt; \n&gt; LOL! Why dont they just give the winning lotto numbers that would \nbe \n&gt; easier to aquire =)\n&gt; \n&gt; Personally I never seek to prove this to anyone, they should \n&gt; prove/disprove it themselves. Even amongst those who arent \nskeptics, \n&gt; hearing varies. Sometimes everyones hears the same sometimes they \n&gt; dont. \n&gt; \n&gt; I also dont ask about lotto numbers LOL I dont play it.\n&gt; \n&gt; As for building one yourself, most are trying out the radio \n&gt; modifications like the 12-470 or the 12-469 (horrible clicking on \nthe \n&gt; 469 model but a few have gotten around it. Theres a few others \nFrank \n&gt; and Steve have messed with. I think ones the 12-125 but I am a bit \n&gt; tired so all the model numbers arent popping in my head at the \nmoment.\n&gt; \n&gt; A few &quot;how to&quot; videos have been posted on youtube. You can type in \n&gt; the model numbers to access a few of Mike Colletta&#39;s (ufogeek)\n&gt; available posts as well as several others who have made thier video \n&gt; instructions available online. \n&gt; \n&gt; I did try out a fan test session the other day. Tho they werent as \n&gt; loud as with water, I could still discern a few statements. They \nwere \n&gt; so &quot;bass&quot; in tone that its almost out of my hearing range on a few \nso \n&gt; I didnt post them all. As for the ones I did they can be found on \nmy \n&gt; esnips \n&gt; \n&gt; http://www.esnips.com/web/MiscellaneousMethodsofEVP\n&gt; \n&gt; That should take ya to the right folder\n&gt; \n&gt; Misty"}