{"id": "11448", "subject": "Re: [EVP-ITC] Re: You Tube Video and Audio", "author": "Zack Widup", "timestamp": "2008-07-01T13:34:28Z", "full_text": "Hi Rosemary,\n\nWhere do you live?  I am in Champaign-Urbana, which is only an hour from \nDecatur.  One paranormal group I&#39;m in is trying to get permission to \ninvetigate the Lincoln Theater. I have never been in it but quite a few \npeople in this area have and there are lots of stories, pictures etc. of \nit around.\n\nAnother haunted place in Decatur is the Greenwood Cemetery.  Now, that one \nI HAVE been in. During our recent flooding, about 40% of that cemetery was \nunder water. Very sad. Since it&#39;s dried out a bit, I&#39;m guessing it&#39;s \nreceded by now.\n\nZack\n\nOn Tue, 1 Jul 2008, rosemary_guiley wrote:\n\n&gt; Zack,\n&gt;\n&gt; I was at the Lincoln Theater in October, and one of the Chicago\n&gt; researchers got an amazing photograph of a Shadow Person in the main\n&gt; seating area.  I took the Mini to the Mezzanine because I had seen an\n&gt; apparition of a man in a dark suit there -- he kept walking up to me\n&gt; and standing next to me, then vanishing.  But I did not hear anything\n&gt; obvious via the box there.  The basement was the best.  There is a lot\n&gt; going on in that theater.\n&gt;\n&gt; Rosemary\n&gt; --- In EVP-ITC@yahoogroups.com, Zack Widup &lt;w9sz@...&gt; wrote:\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; I know some people who got a VIDEO of One-Armed Red a few years ago\n&gt; in the\n&gt;&gt; basement. He walked across the room, plainly in view (well, you\n&gt; could see\n&gt;&gt; the shape but no features).\n&gt;&gt;\n&gt;&gt; Zack\n&gt;&gt;\n&gt;&gt; On Mon, 30 Jun 2008, rosemary_guiley wrote:\n&gt;&gt;\n&gt;&gt;&gt; Hi Folks,\n&gt;&gt;&gt;\n&gt;&gt;&gt; Recently I did an investigation at the Lincoln Theater in Decatur, IL\n&gt;&gt;&gt; with my Mini-Box, and got some interesting clips from the basement\n&gt;&gt;&gt; area.  The files are too large to be uploaded to the forum here, but a\n&gt;&gt;&gt; short video with the audio clips has been posted on You Tube by Joey\n&gt;&gt;&gt; Tito, a Chicago researcher who filmed the investigation.  The audio\n&gt;&gt;&gt; clips are at the end, and Joey matched them to a transcript of what I\n&gt;&gt;&gt; picked up.  I sent the clips to Frank, and he picked up even more.\n&gt;&gt;&gt;\n&gt;&gt;&gt; The You Tube link is www.youtube.com/xflexx1  Joey has a short version\n&gt;&gt;&gt; and a long version; pick the short one.\n&gt;&gt;&gt;\n&gt;&gt;&gt; I have a report on the investigation posted on my blog on MySpace at\n&gt;&gt;&gt; www.myspace.com/rosemaryellenguiley  and Joey&#39;s video is on my home\n&gt;&gt;&gt; page there as well.  The blog also has my report on a similar\n&gt;&gt;&gt; investigation at Ohio State Reformatory in Mansfield; the clips from\n&gt;&gt;&gt; that are posted on this forum in my folder.\n&gt;&gt;&gt;\n&gt;&gt;&gt; Regards,\n&gt;&gt;&gt; Rosemary\n&gt;&gt;&gt;"}