{"id": "11446", "subject": "Re: You Tube Video and Audio", "author": "rosemary_guiley", "timestamp": "2008-07-01T13:12:49Z", "full_text": "It&#39;s a fold-down antenna I got from Ron Ricketts, the creator of the\nMini, via April Slaughter, who arranged for me to get the first\ncommercially available box.  It&#39;s not part of the package that comes\nwith the Mini.  A wire antenna works too.  I don&#39;t always use it --\ndepends on the reception.\n\nRosemary\n--- In EVP-ITC@yahoogroups.com, psfponies &lt;psfponies@...&gt; wrote:\n&gt;\n&gt; Rosemary\n&gt;  \n&gt; What kind of antenna are you using with your mini box?\n&gt; Kay\n&gt;  \n&gt; \n&gt; \n&gt; --- On Mon, 6/30/08, rosemary_guiley &lt;reguiley@...&gt; wrote:\n&gt; \n&gt; From: rosemary_guiley &lt;reguiley@...&gt;\n&gt; Subject: [EVP-ITC] You Tube Video and Audio\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Monday, June 30, 2008, 11:03 PM\n&gt; \n&gt; Hi Folks,\n&gt; \n&gt; Recently I did an investigation at the Lincoln Theater in Decatur, IL\n&gt; with my Mini-Box, and got some interesting clips from the basement\n&gt; area.  The files are too large to be uploaded to the forum here, but a\n&gt; short video with the audio clips has been posted on You Tube by Joey\n&gt; Tito, a Chicago researcher who filmed the investigation.  The audio\n&gt; clips are at the end, and Joey matched them to a transcript of what I\n&gt; picked up.  I sent the clips to Frank, and he picked up even more.\n&gt; \n&gt; The You Tube link is www.youtube.com/xflexx1  Joey has a short version\n&gt; and a long version; pick the short one.\n&gt; \n&gt; I have a report on the investigation posted on my blog on MySpace at\n&gt; www.myspace.com/rosemaryellenguiley  and Joey&#39;s video is on my home\n&gt; page there as well.  The blog also has my report on a similar\n&gt; investigation at Ohio State Reformatory in Mansfield; the clips from\n&gt; that are posted on this forum in my folder.\n&gt; \n&gt; Regards,\n&gt; Rosemary\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; ------------------------------------\n&gt; \n&gt; Yahoo! Groups Links\n&gt;"}