{"id": "11451", "subject": "Re: [EVP-ITC] Re: You Tube Video and Audio", "author": "Zack Widup", "timestamp": "2008-07-02T15:30:19Z", "full_text": "Hi Rosemary,\n\nWe were hoping to do an investigation independently of Troy Taylor. Maybe \nthat would be possible and maybe not. If not, there are still many many \nplaces for our group to investigate.\n\nI know where Graveyard X is (been there many times), Old Union Cemetery, \nand other places he chooses not to reveal the locations of on his website. \nPlus about 40 other cemeteries that are supposedly haunted around here.\n\nNo shortage of things to do!\n\nZack\n\nOn Wed, 2 Jul 2008, rosemary_guiley wrote:\n\n&gt; Zack,\n&gt;\n&gt; I live in the Baltimore area.  I don&#39;t know who you would contact re\n&gt; the theater.  The investigations that I&#39;ve done there have been part\n&gt; of Troy Taylor&#39;s conferences.  If your group attends one of his\n&gt; conferences, they can investigate that way. I have been to Greenwood\n&gt; Cemetery but have not done an investigation there.\n&gt;\n&gt; You could inquire with Troy at www.prairieghosts.com re the situation\n&gt; with the theater.  Good luck!\n&gt;\n&gt; Rosemary\n&gt; --- In EVP-ITC@yahoogroups.com, Zack Widup &lt;w9sz@...&gt; wrote:\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; Hi Rosemary,\n&gt;&gt;\n&gt;&gt; Where do you live?  I am in Champaign-Urbana, which is only an hour\n&gt; from\n&gt;&gt; Decatur.  One paranormal group I&#39;m in is trying to get permission to\n&gt;&gt; invetigate the Lincoln Theater. I have never been in it but quite a few\n&gt;&gt; people in this area have and there are lots of stories, pictures\n&gt; etc. of\n&gt;&gt; it around.\n&gt;&gt;\n&gt;&gt; Another haunted place in Decatur is the Greenwood Cemetery.  Now,\n&gt; that one\n&gt;&gt; I HAVE been in. During our recent flooding, about 40% of that\n&gt; cemetery was\n&gt;&gt; under water. Very sad. Since it&#39;s dried out a bit, I&#39;m guessing it&#39;s\n&gt;&gt; receded by now.\n&gt;&gt;\n&gt;&gt; Zack\n&gt;&gt;\n&gt;&gt; On Tue, 1 Jul 2008, rosemary_guiley wrote:\n&gt;&gt;\n&gt;&gt;&gt; Zack,\n&gt;&gt;&gt;\n&gt;&gt;&gt; I was at the Lincoln Theater in October, and one of the Chicago\n&gt;&gt;&gt; researchers got an amazing photograph of a Shadow Person in the main\n&gt;&gt;&gt; seating area.  I took the Mini to the Mezzanine because I had seen an\n&gt;&gt;&gt; apparition of a man in a dark suit there -- he kept walking up to me\n&gt;&gt;&gt; and standing next to me, then vanishing.  But I did not hear anything\n&gt;&gt;&gt; obvious via the box there.  The basement was the best.  There is a lot\n&gt;&gt;&gt; going on in that theater.\n&gt;&gt;&gt;\n&gt;&gt;&gt; Rosemary\n&gt;&gt;&gt; --- In EVP-ITC@yahoogroups.com, Zack Widup &lt;w9sz@&gt; wrote:\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; I know some people who got a VIDEO of One-Armed Red a few years ago\n&gt;&gt;&gt; in the\n&gt;&gt;&gt;&gt; basement. He walked across the room, plainly in view (well, you\n&gt;&gt;&gt; could see\n&gt;&gt;&gt;&gt; the shape but no features).\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; Zack\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; On Mon, 30 Jun 2008, rosemary_guiley wrote:\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt; Hi Folks,\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt; Recently I did an investigation at the Lincoln Theater in\n&gt; Decatur, IL\n&gt;&gt;&gt;&gt;&gt; with my Mini-Box, and got some interesting clips from the basement\n&gt;&gt;&gt;&gt;&gt; area.  The files are too large to be uploaded to the forum here,\n&gt; but a\n&gt;&gt;&gt;&gt;&gt; short video with the audio clips has been posted on You Tube by Joey\n&gt;&gt;&gt;&gt;&gt; Tito, a Chicago researcher who filmed the investigation.  The audio\n&gt;&gt;&gt;&gt;&gt; clips are at the end, and Joey matched them to a transcript of\n&gt; what I\n&gt;&gt;&gt;&gt;&gt; picked up.  I sent the clips to Frank, and he picked up even more.\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt; The You Tube link is www.youtube.com/xflexx1  Joey has a short\n&gt; version\n&gt;&gt;&gt;&gt;&gt; and a long version; pick the short one.\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt; I have a report on the investigation posted on my blog on MySpace at\n&gt;&gt;&gt;&gt;&gt; www.myspace.com/rosemaryellenguiley  and Joey&#39;s video is on my home\n&gt;&gt;&gt;&gt;&gt; page there as well.  The blog also has my report on a similar\n&gt;&gt;&gt;&gt;&gt; investigation at Ohio State Reformatory in Mansfield; the clips from\n&gt;&gt;&gt;&gt;&gt; that are posted on this forum in my folder.\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt; Regards,\n&gt;&gt;&gt;&gt;&gt; Rosemary\n&gt;&gt;&gt;&gt;&gt;"}