{"id": "11542", "subject": "Re: [EVP-ITC] blue lighting", "author": "Carol B.", "timestamp": "2008-07-18T15:32:48Z", "full_text": "Andrea,\nI have experienced this before.  In my case it had to do with a spirit\nthat attached itself to us while at Waverly.  It became very strong, and I\nhad to have assistance to rid my home of him.  We also experienced very\ndense, black masses moving towards us.\n\nCarol B.\n\n\n\n\n\n\n\n\n\n\n\n&gt; Hi Andrea,\n&gt;\n&gt; Sounds like a vortex may have been opening up in your hallway.  Have  you\n&gt; had\n&gt; any paranormal ativity in your house before?\n&gt;\n&gt; Jeff\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; In a message dated 7/18/2008 2:27:28 A.M. Central Standard Time,\n&gt; fairlia@... writes:\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Hi All,\n&gt;\n&gt; I am Andrea Carr who is a 41 year old wife and  mom of 1 daughter. I am\n&gt; sorry\n&gt; I have not written before but I have a terrible  year and haven&#39;t had the\n&gt; time to concentrate on EVP like I had prior. I won&#39;t  get into the details\n&gt; but it\n&gt; has left me in the midst of OK just trying to pull  through all of this BS\n&gt; &\n&gt; I will get back to it when I  can.\n&gt;\n&gt; Unfortunatley I am leaving for the weekend  tomorrow morning and won&#39;t see\n&gt; my\n&gt; e-mails until Monday morning.\n&gt;\n&gt; I have a question for any one here. I believe in  aliens, spirit and ghost\n&gt; communications via evp but tonight I had an  experience I never had\n&gt; before.\n&gt;\n&gt; I woke up at exactly 2:22 by my stove&#39;s clock and  went and cleaned my\n&gt; sink\n&gt; of dishes while I heated up some cream chipped beef  (albiet not too\n&gt; exciting)\n&gt; but while I sat there after in the dark with my  family sleeping my\n&gt; hallway\n&gt; ilummating a light clored blue several times.  Anyone else ever seen this?\n&gt;\n&gt; I look forward to any responses.\n&gt;\n&gt; Thanks!\n&gt; Andrea\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; **************Get fantasy football with free live scoring. Sign up for\n&gt; FanHouse Fantasy Football today.\n&gt; (http://www.fanhouse.com/fantasyaffair?ncid=aolspr00050000000020)\n&gt;"}