{"id": "11545", "subject": "Re: blue lighting", "author": "eogd_fratercc", "timestamp": "2008-07-18T17:01:30Z", "full_text": "Hi Andrea,\n\nThis is my first post to the group as well.\n\nWithout knowing your house, could it be light reflection from outside\nsources through a window?\n\nThat said, I certainly believe that spiritual beings can radiate a\nlight we can see with our physical eyes.  In my own case I primarily\nwork with spiritual energies outside the scope of human.  Mostly\nangelic, sometimes not.  At one time, I was using Goetic magick to\nsummon a spiritual being.  I&#39;m someone who discounted orb photos for\nyears.  But then while I was doing a summoning of a specific spritual\nbeing, a golden light filled the room from above my head, moving from\nright to left. It was as though a candle being lit and moving around\nthe room. All I saw was the light on the walls... I didn&#39;t see the\nsource.  It blinked away after 5 seconds or so. I recall asking if\nthis was the being, and if so to repeat.  It occured again and on this\nsecond attempt i actually saw a golden ball of light - about the size\nof my fist, slowly move around the edge of my circle.  The room was\ndarkly lit with only one candle. there were no flashes or external\nlights.  So it was quite remarkable when it occurred, as the light was\nvery noticable in that moment.  I never believed in orbs before... as\nmost photos of them I thought I could explain due to camera Flash. But\nthis wasn&#39;t a picture imprint, it was real time with my eyes. \n\nThat all said, it was a spiritual being who was manifesting and by\ndoing so, radiated a light that I could see with my own eyes.  \n\nI&#39;m sure it&#39;s happened for many others.  I&#39;d first rule out any\npossible external light sources that might have caused this.  Then if\nall ruled out, work from there to understand what&#39;s trying to manifest.\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;Andrea Carr&quot; &lt;fairlia@...&gt; wrote:\n&gt;\n&gt; Hi All,\n&gt; \n&gt; I am Andrea Carr who is a 41 year old wife and mom of 1 daughter. I\nam sorry I have not written before but I have a terrible year and\nhaven&#39;t had the time to concentrate on EVP like I had prior. I won&#39;t\nget into the details but it has left me in the midst of OK just trying\nto pull through all of this BS & I will get back to it when I can.\n&gt; \n&gt; Unfortunatley I am leaving for the weekend tomorrow morning and\nwon&#39;t see my e-mails until Monday morning. \n&gt; \n&gt; I have a question for any one here. I believe in aliens, spirit and\nghost communications via evp but tonight I had an experience I never\nhad before.\n&gt; \n&gt; I woke up at exactly 2:22 by my stove&#39;s clock and went and cleaned\nmy sink of dishes while I heated up some cream chipped beef (albiet\nnot too exciting) but while I sat there after in the dark with my\nfamily sleeping my hallway ilummating a light clored blue several\ntimes. Anyone else ever seen this?\n&gt; \n&gt; I look forward to any responses.\n&gt; \n&gt; Thanks!\n&gt; Andrea\n&gt;"}