{"id": "11619", "subject": "Parallel Universes", "author": "black bear hollow", "timestamp": "2008-08-02T15:13:48Z", "full_text": "This isn&#39;t spam. For those interested, are videos and links on the  \nsubject of Parallel Universes. We could be simply recording beings  \ninhabiting other dimensions/universes.\n\nMisty, if this isn&#39;t acceptable to post here, please let me know, and  \nI&#39;ll just send posts such as these to The Grass Harp only.\nThanks!\n\nScientists now believe there may really be a parallel universe - in  \nfact, there may be an infinite number of parallel universes, and we  \njust happen to live in one of them. These other universes contain  \nspace, time and strange forms of exotic matter. Some of them may even  \ncontain you, in a slightly different form. Astonishingly, scientists  \nbelieve that these parallel universes exist less than one millimetre  \naway from us. In fact, our gravity is just a weak signal leaking out  \nof another universe into ours.\n\nM-Theory:\nhttp://en.wikipedia.org/wiki/M-theory\n\nBBC description of video:\nhttp://www.bbc.co.uk/science/horizon/...\n\nQunatum Computers - wiki\nhttp://en.wikipedia.org/wiki/Quantum_...\n\nParallel Universes:\n\nPart 1: http://au.youtube.com/watch?v=2_vpEyE6rug&feature=related\n\nPart 2: http://www.youtube.com/watch?v=tuT-fIPZITw\n\nw.\nThis isn' spam. Fo hose in e es ed, a e ideos and links on he subjec o Pa allel Uni e ses. We could be simply eco ding beings inhabi ing o he dimensions/uni e ses.Mis y, i his isn' accep able o pos he e, please le me know, and I'll jus send pos s such as hese o The G ass Ha p only. Thanks!Scien is s now belie e he e may eally be a pa allel uni e se - in ac , he e may be an in ini e numbe o pa allel uni e ses, and we jus happen o li e in one o hem. These o he uni e ses con ain space, ime and s ange o ms o exo ic ma e . Some o hem may e en con ain you, in a sligh ly di e en o m. As onishingly, scien is s belie e ha hese pa allel uni e ses exis less han one millime e away om us. In ac , ou g a i y is jus a weak signal leaking ou o ano he uni e se in o ou s.M-Theo y:h p://en.wikipedia.o g/wiki/M- heo yBBC desc ip ion o ideo:h p://www.bbc.co.uk/science/ho izon/...Quna um Compu e s - wikih p://en.wikipedia.o g/wiki/Quan um_...Pa allel Uni e ses:Pa 1: h p://au.you ube.com/wa ch? =2_ pEyE6 ug& ea u e= ela edPa 2: h p://www.you ube.com/wa ch? = uT- IPZITww."}