{"id": "11717", "subject": "Re: [EVP-ITC] THe Ovilus", "author": "Elabeth", "timestamp": "2008-08-12T16:43:00Z", "full_text": "I&#39;ll ask some local ghost hunters I know if they&#39;d be interested and\npass along your email addy. If you get great responses then why sell\nit? I know they&#39;re gonna ask. haha I&#39;d keep the toys that work well.\nI&#39;m sure the editing did cut out some waiting around etc., and I\nhaven&#39;t read Ryan&#39;s blog about the episode yet. He will usually say\nsomething about it there if the editing is done to make something seem\nmore than what it was and I&#39;ve seen him express concern about\nproduction things there before, so I think he&#39;ll mention it if the\nfootage was heavily edited.\n\n~Elabeth\n\n\nOn Tue, Aug 12, 2008 at 11:29 AM,  &lt;Marlboro63@...&gt; wrote:\n&gt; Hi Elabeth,\n&gt;\n&gt; You have to remember much of what the Ovilus 1 said probably ended up on the\n&gt; editing room floor.  But it does work.  I get great responses from mine.\n&gt; The (7) different modes on it work very well.  But if you know anyone who\n&gt; wants one please let me know.  I was informed I have to sell some of my toys\n&gt; to afford to buy new toys...LOLOL  I would sell it for $165.00 and it is in\n&gt; brand new condition and only used a few times.\n&gt;\n&gt; Jeff\n&gt;\n&gt; In a message dated 8/12/2008 11:24:20 A.M. Central Standard Time,\n&gt; elabeth@... writes:\n&gt;\n&gt; I thought it was pretty neat that it repeated the word &quot;worry&quot; when\n&gt; Ryan asked if it was worried they&#39;d bring in a priest.\n&gt; What are the odds of that just based on environmental readings? If I\n&gt; had an extra $200 laying around I&#39;d be buying myself one to play with.\n&gt; ~Elabeth\n&gt;\n&gt; On Tue, Aug 12, 2008 at 7:41 AM, Fransen, Debbie\n&gt; &lt;debbie.fransen@...&gt; wrote:\n&gt;&gt; I don&#39;t know how many of the members watch Paranormal State, but they used\n&gt;&gt; a new piece of equipment called The Ovilus. You guys have got to check\n&gt;&gt; this\n&gt;&gt; out. Go to www.digitaldowsing.com. I am not really sure who these guys\n&gt;&gt; are,\n&gt;&gt; and\n&gt;&gt; where they came up with this. To me, it sounds kind of like Frank&#39;s Box,\n&gt;&gt; but\n&gt;&gt; not the same.\n&gt;&gt; Frank, please take a look at this, and tell us what you think.\n&gt;&gt; I don&#39;t understand how it works......\n&gt;&gt; Deb\n&gt;\n&gt;\n&gt;\n&gt; ________________________________\n&gt; Looking for a car that&#39;s sporty, fun and fits in your budget? Read reviews\n&gt; on AOL Autos.\n&gt;"}