{"id": "11756", "subject": "Re: Speakers", "author": "kolrone", "timestamp": "2008-08-13T18:14:43Z", "full_text": "Chad, I went to Big Lots and got a cheap looking portable set of\nspeakers. It was about $7 but it was probably the most portable they\nhad. It is an all-in-one speaker set. The speaker is small, white, and\noval shaped. It has both the left and right speaker and plugs directly\ninto the radio and just sits on top of it. It has a little power-on\nswitch on top and is powered by two AAA batteries. The brand name of\nit is &quot;Kinyo,&quot; which I have never heard of. Even though it was a no\nname brand as far as I could tell, it gave me the results that I had\nin the cemetery and in my opinion it&#39;s the ultimate in portability\nthat I have seen.\n\n-Aaron\n\n--- In EVP-ITC@yahoogroups.com, Chad Wiggins &lt;cawiggins78@...&gt; wrote:\n&gt;\n&gt; I went over to BigLots and got a set of Audio Zone 2.0 amplified\nspeakers for about 6 bucks. They are 2W each with a 3&quot; full range\ndriver, pre-amplified and magnetically shielded. Frequency response is\n120Hz-20KHz. Are these just total crap, or are they comparable to what\nyou&#39;re talking about? Man, I just wish I could run the mic and the 469\ninto the recorder with the y-adapter.\n&gt; \n&gt; \n&gt; \n&gt; ----- Original Message ----\n&gt; From: &quot;Marlboro63@...&quot; &lt;Marlboro63@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Wednesday, August 13, 2008 1:08:32 PM\n&gt; Subject: Re: [EVP-ITC] Speakers\n&gt; \n&gt; \n&gt; The 469 uses a very low powered amplifier circuit on the headphone \n&gt; jack.  Stand computer speakers will not really work for it and you\nwill get \n&gt; a very low audio out of it if anything.  What you need is a small\nset of \n&gt; amplified speakers.  Radio Shack sells a few seats that fold up for\naround \n&gt; $20.00.  I got mine when they were on sale for $10.00.  Or any good \n&gt; amplified speakers will do the job for you.  But remember the\nclocking on \n&gt; am.  The clicking will be amplified too so try and ignore it if \n&gt; possible.\n&gt;  \n&gt; Jeff\n&gt;  \n&gt; In a message dated 8/13/2008 12:05:35 P.M. Central Daylight Time, \n&gt; cawiggins78@ yahoo.com writes:\n&gt; I hooked up these speakers and now I&#39;m not getting a thing. I guess\n&gt; I&#39;m  using poor quality speakers. any suggestions on which speakers\n&gt; work the  best with the 469?\n&gt; \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; ________________________________\n&gt; Looking for a car that&#39;s sporty, fun and fits in your budget? Read\nreviews on AOL Autos.\n&gt;"}