{"id": "11796", "subject": "Re: [EVP-ITC] Evp isnt just one or two words anymore!", "author": "Misty Dawn", "timestamp": "2008-08-17T04:18:23Z", "full_text": "Esnips is great. I just wish they didnt make it so ya have to make the folder private before you upload your mp3 files. But you can quickly make it public once you upload the new stuff so its no big deal. Wav files u can upload with no problems last I checked.\n\nAs for the evp sessions, unless I am trying to capture direct feedback I usually just state I am recording and ask my questions before I hit record. I think direct feedback is good for proof but again, I do not seek to prove much to anyone but myself and they took care of that quite a while back. I just record, document, share (sometimes) and move on. I dont have the free time for much else.\n\nEvery now and then I will record me asking a question and thier reply is usually immediate. I prefer to just give them an open forum to choose thier own topic of discussion. I expect nothing but recieve more than I ask for (if that makes any sense)\n\nHowever this time I did ask one question. I asked if they will send me Otto&#39;s likeness now that he has moved on surely he wont care to object. Before when I asked Otto to share his likeness/image with me his reply was &quot;tell her I am invisible, naturally&quot;. I figured now that hes progressed and moved forward, maybe the new guy or the others would share LOL. Sneaky yeah but when ya talk to someone over 2 years its nice to have a face to go with it even if its a made up face. \n\nThe replys on that subject I posted, one was forward and one was reverse.\n\n&quot;that was an affection - i miss him - i liked the wee fellow-liked living with Otto-no offense&quot; (no offense to Monty? LOL)\n\n&quot;said it&#39;s nice Miss, to live happy for the person who saw him&quot;\n\n&quot;can you see them Misty&quot; (not unless its one from a recent feedback loop session)\n\nand some chatter about the new guy Monty as well as a few friends and other stuff. The higher conciousness and higher grade level soul thing was unexpected I didnt ask anything pertaining to  the rest of what was said. Theres alot more in that session but too tired tonight to try and figure it all out or post it.\n\nMisty\n\n--- On Sat, 8/16/08, Ron Lederer &lt;ronriko@yahoo.com&gt; wrote:\n\n&gt; From: Ron Lederer &lt;ronriko@...&gt;\n&gt; Subject: Re: [EVP-ITC] Evp isnt just one or two words anymore!\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Saturday, August 16, 2008, 9:42 PM\n&gt; Listened to all on esnips.  Really good session.  I like\n&gt; how easy it is to access recordings and comment on\n&gt; esnips. Should use it more.  Were you or your group asking\n&gt; questions while recording and were the recorded answer in\n&gt; response to the questions?  ron l\n&gt; \n&gt; --- On Sat, 8/16/08, Misty &lt;bulletbabea@yahoo.com&gt;\n&gt; wrote:\n&gt; \n&gt; From: Misty &lt;bulletbabea@...&gt;\n&gt; Subject: [EVP-ITC] Evp isnt just one or two words anymore!\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Saturday, August 16, 2008, 9:07 AM\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Not sure it ever was. I had a good group session the other\n&gt; day so \n&gt; thought I would share some of what came thru with the\n&gt; online crowd. A \n&gt; few are too long sentence wise to post here so I stuck them\n&gt; in my \n&gt; esnips account. They were pretty well spoken (for my ears)\n&gt; and I was \n&gt; pleasantly surprised at the depth of the messages that came\n&gt; thru.\n&gt; \n&gt; http://www.esnips. com/web/SweepTun ingEVP\n&gt; \n&gt; Misty\n&gt; \n&gt; http://misty. xm.com"}