{"id": "11800", "subject": "Re: [EVP-ITC] Ahhh the infamous Fish!", "author": "Lisby", "timestamp": "2008-08-17T18:56:20Z", "full_text": "You&#39;re not going to find any, I fear. This seems to be an entity  \ncollective who enjoy teasing EVP researchers. They caused a lot of  \nannoyance to other researchers in the past, but nothing serious. Some  \nseemed to be afraid of them, but I never really heard of them doing  \nanymore than being annoying and prankish and sometimes, well,  \nactually pretty damned funny on occasion.\n\nAnn\n\nOn Aug 17, 2008, at 12:42 PM, Pridegrl Neverumind wrote:\n\n&gt;\n&gt; i have tried looking online for more info about these nefarious  \n&gt; fish-ppl.... anyone have a link to info?\n&gt; thanks\n&gt; Charm\n&gt;\n&gt; --- On Sun, 8/17/08, Lisby &lt;lisby@...&gt; wrote:\n&gt; From: Lisby &lt;lisby@...&gt;\n&gt; Subject: Re: [EVP-ITC] Ahhh the infamous Fish!\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Received: Sunday, August 17, 2008, 8:39 AM\n&gt;\n&gt; Shit, Frank--I got one the other day that I haven&#39;t even pulled as  \n&gt; a clip yet that says, &quot;Believe in the fish.&quot;\n&gt;\n&gt; Great. Don&#39;t they ever get bored???\n&gt;\n&gt;\n&gt; On Aug 16, 2008, at 7:05 PM, Frank Sumption wrote:\n&gt;\n&gt;&gt; The Fish Group--a group of entities that seem to get great  \n&gt;&gt; pleasure form screwing wiht EVPers. Just when you think you&#39;re  \n&gt;&gt; getting great evidiecne and proo, it turns out to be these tricky  \n&gt;&gt; jokers. Another reason not to take everything a gospel truth.  I  \n&gt;&gt; think it was thoise researchers in Luxemberg(?) that first got  \n&gt;&gt; these guys, but I don&#39;t remeber for sure. So if you hear any  \n&gt;&gt; reference to fish, that&#39;s a clue that they are there. I am  \n&gt;&gt; uncertain if they are bad guys, or just tricksters.\n&gt;&gt;\n&gt;&gt; Frank-S\n&gt;&gt;\n&gt;&gt; See what people are saying about Windows Live. Check out featured  \n&gt;&gt; posts.Check It Out!\n&gt;&gt;\n&gt;&gt; &lt;WeGotYa--it&#39; sTheFishGroupInI celand--- Yeah-ThatIstheCo  \n&gt;&gt; untry---- -GiveUsSomeIce. mp3&gt;\n&gt;\n&gt;\n&gt; Now with a new friend-happy design! Try the new Yahoo! Canada  \n&gt; Messenger\n&gt;\n&gt; \n\n\nYou' e no going o ind any, I ea . This seems o be an en i y collec i e who enjoy easing EVP esea che s. They caused a lo o annoyance o o he esea che s in he pas , bu no hing se ious. Some seemed o be a aid o hem, bu I ne e eally hea d o hem doing anymo e han being annoying and p ankish and some imes, well, ac ually p e y damned unny on occasion.AnnOn Aug 17, 2008, a 12:42 PM, P ideg l Ne e umind w o e:i ha e ied looking online o mo e in o abou hese ne a ious ish-ppl.... anyone ha e a link o in o? hanksCha m--- On Sun, 8/17/08, Lisby ne > w o e:F om: Lisby ne >Subjec : Re: [EVP-ITC] Ahhh he in amous Fish!To: EVP-ITC@yahoog oups.comRecei ed: Sunday, Augus 17, 2008, 8:39 AMShi , F ank--I go one he o he day ha I ha en' e en pulled as a clip ye ha says, \"Belie e in he ish.\"G ea . Don' hey e e ge bo ed???On Aug 16, 2008, a 7:05 PM, F ank Sump ion w o e:The Fish G oup--a g oup o en i ies ha seem o ge g ea pleasu e o m sc ewing wih EVPe s. Jus when you hink you' e ge ing g ea e idiecne and p oo, i u ns ou o be hese icky joke s. Ano he eason no o ake e e y hing a gospel u h.  I hink i was hoise esea che s in Luxembe g(?) ha i s go hese guys, bu I don' emebe o su e. So i you hea any e e ence o ish, ha 's a clue ha hey a e he e. I am unce ain i hey a e bad guys, o jus icks e s.  F ank-SSee wha people a e saying abou Windows Li e. Check ou ea u ed pos s.Check I Ou !Now wi h a new iend-happy design! T y he new Yahoo! Canada Messenge"}