{"id": "11813", "subject": "Re: [EVP-ITC] Ahhh the infamous Fish!", "author": "black bear hollow", "timestamp": "2008-08-17T20:42:11Z", "full_text": "Richard Smith is another who has dealt with The Fish Group. He&#39;s an  \nAAEVP member. Lisa also knows about them.\n\nw.\nOn Aug 17, 2008, at 4:29 PM, Lisby wrote:\n\n&gt; I don&#39;t think Erland was the one bothered with them. Bill  \n&gt; something...I can&#39;t remember his last name. And Charlie with the  \n&gt; ghost coffee pot. She got them, too.\n&gt;\n&gt;\n&gt; I heard a lot of what Bill got when he used to post it back on the  \n&gt; AA-EVP board. I remember none of it rising above the level of  \n&gt; swearing and threats that we get on occasion. The impression I got  \n&gt; at the time was that this was a group of deceased humans who had  \n&gt; formed a little after-death-prankster club. Yes, they could be quite  \n&gt; shitty. If I recall correctly, they called themselves the Fish Group  \n&gt; because they said they felt like fish looking out at us through  \n&gt; aquarium glass. I thought that was a really interesting comment on  \n&gt; the separation between our planes of reality.\n&gt;\n&gt; Ann\n\n\nRicha d Smi h is ano he who has deal wi h The Fish G oup. He's an AAEVP membe . Lisa also knows abou hem. w.On Aug 17, 2008, a 4:29 PM, Lisby w o e:I don' hink E land was he one bo he ed wi h hem. Bill some hing...I can' emembe his las name. And Cha lie wi h he ghos co ee po . She go hem, oo.I hea d a lo o wha Bill go when he used o pos i back on he AA-EVP boa d. I emembe none o i ising abo e he le el o swea ing and h ea s ha we ge on occasion. The imp ession I go a he ime was ha his was a g oup o deceased humans who had o med a li le a e -dea h-p anks e club. Yes, hey could be qui e shi y. I I ecall co ec ly, hey called hemsel es he Fish G oup because hey said hey el like ish looking ou a us h ough aqua ium glass. I hough ha was a eally in e es ing commen on he sepa a ion be ween ou planes o eali y.Ann"}