{"id": "11810", "subject": "Re: [EVP-ITC] Ahhh the infamous Fish!", "author": "Lisby", "timestamp": "2008-08-17T20:29:43Z", "full_text": "I don&#39;t think Erland was the one bothered with them. Bill  \nsomething...I can&#39;t remember his last name. And Charlie with the  \nghost coffee pot. She got them, too.\n\nI heard a lot of what Bill got when he used to post it back on the AA- \nEVP board. I remember none of it rising above the level of swearing  \nand threats that we get on occasion. The impression I got at the time  \nwas that this was a group of deceased humans who had formed a little  \nafter-death-prankster club. Yes, they could be quite shitty. If I  \nrecall correctly, they called themselves the Fish Group because they  \nsaid they felt like fish looking out at us through aquarium glass. I  \nthought that was a really interesting comment on the separation  \nbetween our planes of reality.\n\nAnn\n\nOn Aug 17, 2008, at 4:19 PM, Pridegrl Neverumind wrote:\n\n&gt;\n&gt; oh, ok\n&gt; thanks\n&gt; Charm\n&gt;\n&gt; --- On Sun, 8/17/08, black bear hollow  \n&gt; &lt;blackbearhollow@...&gt;wrote:\n&gt; From: black bear hollow &lt;blackbearhollow@...&gt;\n&gt; Subject: Re: [EVP-ITC] Ahhh the infamous Fish!\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Received: Sunday, August 17, 2008, 3:52 PM\n&gt;\n&gt; No, I&#39;ll post it here. It&#39;s the &quot;Fish Group&quot;. They aren&#39;t people.\n&gt;\n&gt; They have reeked havoc with a few researchers I know of.\n&gt; Everything from serious poltergeist activity to getting in your  \n&gt; head where you can hear them 24/7 - telepathically interfering with  \n&gt; your thoughts, and they think it&#39;s a riot. If I remember correctly,  \n&gt; I think the late great Erland had a run in with them. They have  \n&gt; been known to harass and be fairly nasty. I&#39;ve never heard anything  \n&gt; &quot;funny&quot; about them. They come through all things electrical and  \n&gt; love radios. Which is probably why Frank gets them every so often.\n&gt;\n&gt; They&#39;re the types to tell people to kill their family members and  \n&gt; all sorts of weird crap. They get a huge kick out of scaring  \n&gt; researchers, that&#39;s for sure.\n&gt;\n&gt; w.\n&gt; On Aug 17, 2008, at 3:01 PM, Pridegrl Neverumind wrote:\n&gt;\n&gt;&gt;\n&gt;&gt; can you elbaorate a bit?\n&gt;&gt; perhaps youd like to email me directly so as not to annoy others  \n&gt;&gt; who dont want to know about fish ppl?\n&gt;&gt; Charm\n&gt;&gt;\n&gt;&gt; --- On Sun, 8/17/08, black bear hollow &lt;blackbearhollow@  \n&gt;&gt; gmail.com&gt;wrote:\n&gt;&gt; From: black bear hollow &lt;blackbearhollow@ gmail.com&gt;\n&gt;&gt; Subject: Re: [EVP-ITC] Ahhh the infamous Fish!\n&gt;&gt; To: EVP-ITC@yahoogroups .com\n&gt;&gt; Received: Sunday, August 17, 2008, 2:59 PM\n&gt;&gt;\n&gt;&gt; They&#39;re awful. I had a run in a few years ago. They are more than  \n&gt;&gt; pranksters. Damn awful. Clever too.\n&gt;&gt;\n&gt;&gt; w.\n&gt;&gt; On Aug 17, 2008, at 2:56 PM, Lisby wrote:\n&gt;&gt;\n&gt;&gt;&gt; You&#39;re not going to find any, I fear. This seems to be an entity  \n&gt;&gt;&gt; collective who enjoy teasing EVP researchers. They caused a lot  \n&gt;&gt;&gt; of annoyance to other researchers in the past, but nothing  \n&gt;&gt;&gt; serious. Some seemed to be afraid of them, but I never really  \n&gt;&gt;&gt; heard of them doing anymore than being annoying and prankish and  \n&gt;&gt;&gt; sometimes, well, actually pretty damned funny on occasion.\n&gt;&gt;&gt;\n&gt;&gt;&gt; Ann\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; Ask a question on any topic and get answers from real people. Go  \n&gt;&gt; to Yahoo! Answers.\n&gt;&gt;\n&gt;\n&gt;\n&gt; Reclaim your name @... or @.... Get your new email  \n&gt; address now!\n&gt;\n&gt; \n\n\nI don' hink E land was he one bo he ed wi h hem. Bill some hing...I can' emembe his las name. And Cha lie wi h he ghos co ee po . She go hem, oo.I hea d a lo o wha Bill go when he used o pos i back on he AA-EVP boa d. I emembe none o i ising abo e he le el o swea ing and h ea s ha we ge on occasion. The imp ession I go a he ime was ha his was a g oup o deceased humans who had o med a li le a e -dea h-p anks e club. Yes, hey could be qui e shi y. I I ecall co ec ly, hey called hemsel es he Fish G oup because hey said hey el like ish looking ou a us h ough aqua ium glass. I hough ha was a eally in e es ing commen on he sepa a ion be ween ou planes o eali y.AnnOn Aug 17, 2008, a 4:19 PM, P ideg l Ne e umind w o e:oh, ok hanksCha m--- On Sun, 8/17/08, black bea hollow gmail.com>w o e:F om: black bea hollow gmail.com>Subjec : Re: [EVP-ITC] Ahhh he in amous Fish!To: EVP-ITC@yahoog oups.comRecei ed: Sunday, Augus 17, 2008, 3:52 PMNo, I'll pos i he e. I 's he \"Fish G oup\". They a en' people. They ha e eeked ha oc wi h a ew esea che s I know o . E e y hing om se ious pol e geis ac i i y o ge ing in you head whe e you can hea hem 24/7 - elepa hically in e e ing wi h you hough s, and hey hink i 's a io . I I emembe co ec ly, I hink he la e g ea E land had a un in wi h hem. They ha e been known o ha ass and be ai ly nas y. I' e ne e hea d any hing \" unny\" abou hem. They come h ough all hings elec ical and lo e adios. Which is p obably why F ank ge s hem e e y so o en. They' e he ypes o ell people o kill hei amily membe s and all so s o wei d c ap. They ge a huge kick ou o sca ing esea che s, ha 's o su e. w.On Aug 17, 2008, a 3:01 PM, P ideg l Ne e umind w o e:can you elbao a e a bi ?pe haps youd like o email me di ec ly so as no o annoy o he s who don wan o know abou ish ppl?Cha m--- On Sun, 8/17/08, black bea hollow w o e:F om: black bea hollow Subjec : Re: [EVP-ITC] Ahhh he in amous Fish!To: EVP-ITC@yahoog oups .comRecei ed: Sunday, Augus 17, 2008, 2:59 PMThey' e aw ul. I had a un in a ew yea s ago. They a e mo e han p anks e s. Damn aw ul. Cle e oo.w.On Aug 17, 2008, a 2:56 PM, Lisby w o e:You' e no going o ind any, I ea . This seems o be an en i y collec i e who enjoy easing EVP esea che s. They caused a lo o annoyance o o he esea che s in he pas , bu no hing se ious. Some seemed o be a aid o hem, bu I ne e eally hea d o hem doing anymo e han being annoying and p ankish and some imes, well, ac ually p e y damned unny on occasion.AnnAsk a ques ion on any opic and ge answe s om eal people. Go o Yahoo! Answe s.Reclaim you name @... o  @ ocke mail.com. Ge you new email add ess now!"}