{"id": "11825", "subject": "Re: [EVP-ITC] Ahhh the infamous Fish!", "author": "Lisby", "timestamp": "2008-08-18T00:16:57Z", "full_text": "I would reason that since the majority of people experience such  \npositive outcomes from an NDE--it is in the whole a positive  \nexperience for almost every person who has one--it would not provide  \nthe necessary negative energy for purportedly negative entities to  \nfeed off. In fact, the majority of NDEers are transformed in a very  \npositive way indeed. Rarified, even. Seems like an odd food choice  \nfor the Fishes.\n\nWe don&#39;t know why we see hauntings such as at Gettysburg. We may be  \nseeing/hearing an emotionless &quot;tape recording&quot; or we may be seeing/ \nhearing humans who died there who have not moved on. Only in the last  \ncase is there the possibility of negative emotions/energy. In either  \ncase, we cannot compare this to the Fish Group phenomenon.\n\nAnn\n\nOn Aug 18, 2008, at 12:08 AM, threadsintyme@... wrote:\n\n&gt;\n&gt; It could very well be because the NDE brings with it such deep  \n&gt; emotions. Whenever you come across deep emotions you are likely  \n&gt; (but not always) to find some sort of spirit attachment which can  \n&gt; bring additional problems. Spirits often attachment themselves to  \n&gt; locations or even people who have survived deep personal traumas.\n&gt;\n&gt; That is one reason why some people still see drill formations by  \n&gt; Union and Confederate soldiers in some of the Civil War battle fields.\n&gt;\n&gt; Al\n&gt; .\n&gt; -- Lisby &lt;lisby@...&gt; wrote:\n&gt;\n&gt; That&#39;s a very interesting detail. Any thoughts why they&#39;d key in on  \n&gt; NDEers?\n&gt;\n&gt;\n&gt; Ann\n&gt;\n&gt; On Aug 17, 2008, at 5:00 PM, black bear hollow wrote:\n&gt;\n&gt;&gt; From what I hear, they&#39;re fairly demonic. Nasty. But yes, I&#39;d  \n&gt;&gt; agree they&#39;d revel in any attention.\n&gt;&gt;\n&gt;&gt; R. Smith deemed them the Demons of Evp.\n&gt;&gt;\n&gt;&gt; Of course - unless you&#39;ve truly experienced what they are capable  \n&gt;&gt; of, it&#39;s hard to judge.\n&gt;&gt;\n&gt;&gt; One thing Erland and I noticed, they seemed to pick up on people  \n&gt;&gt; who had exprienced an NDE (near death or death experience). Both  \n&gt;&gt; Erland & I are NDE&#39;ers, though he&#39;s now officially on the other  \n&gt;&gt; side. :)\n&gt;&gt;\n&gt;&gt; w.\n&gt;&gt; On Aug 17, 2008, at 4:55 PM, Lisby wrote:\n&gt;&gt;\n&gt;&gt;&gt; Demons of EVP--I think that&#39;s granting them too much. And it&#39;s a  \n&gt;&gt;&gt; title they would revel in. Nasty clever little punks--yeah,  \n&gt;&gt;&gt; that&#39;s about right.\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt; Ann\n&gt;&gt;\n&gt;&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; ____________________________________________________________\n&gt; Free quote and debt consolidation information. Click Here.\n&gt;\n&gt; \n\n\nI would eason ha since he majo i y o people expe ience such posi i e ou comes om an NDE--i is in he whole a posi i e expe ience o almos e e y pe son who has one--i would no p o ide he necessa y nega i e ene gy o pu po edly nega i e en i ies o eed o . In ac , he majo i y o NDEe s a e ans o med in a e y posi i e way indeed. Ra i ied, e en. Seems like an odd ood choice o he Fishes.We don' know why we see haun ings such as a Ge ysbu g. We may be seeing/hea ing an emo ionless \" ape eco ding\" o we may be seeing/hea ing humans who died he e who ha e no mo ed on. Only in he las case is he e he possibili y o nega i e emo ions/ene gy. In ei he case, we canno compa e his o he Fish G oup phenomenon.AnnOn Aug 18, 2008, a 12:08 AM, h eadsin yme@... w o e:I could e y well be because he NDE b ings wi h i such deep emo ions. Whene e you come ac oss deep emo ions you a e likely (bu no always) o ind some so o spi i a achmen which can b ing addi ional p oblems. Spi i s o en a achmen hemsel es o loca ions o e en people who ha e su i ed deep pe sonal aumas.Tha is one eason why some people s ill see d ill o ma ions by Union and Con ede a e soldie s in some o he Ci il Wa ba le ields.  Al. -- Lisby ne > w o e:Tha 's a e y in e es ing de ail. Any hough s why hey'd key in on NDEe s?AnnOn Aug 17, 2008, a 5:00 PM, black bea hollow w o e:F om wha I hea , hey' e ai ly demonic. Nas y. Bu yes, I'd ag ee hey'd e el in any a en ion. R. Smi h deemed hem he Demons o E p.O cou se - unless you' e uly expe ienced wha hey a e capable o , i 's ha d o judge.One hing E land and I no iced, hey seemed o pick up on people who had exp ienced an NDE (nea dea h o dea h expe ience). Bo h E land & I a e NDE'e s, hough he's now o icially on he o he side. :)w.On Aug 17, 2008, a 4:55 PM, Lisby w o e:Demons o EVP--I hink ha 's g an ing hem oo much. And i 's a i le hey would e el in. Nas y cle e li le punks--yeah, ha 's abou igh .Ann____________________________________________________________ F ee quo e and deb consolida ion in o ma ion. Click He e."}