{"id": "11826", "subject": "Re: [EVP-ITC] Ahhh the infamous Fish!", "author": "black bear hollow", "timestamp": "2008-08-18T00:18:38Z", "full_text": "I can say that having experienced the death of the body twice, I came  \nback alone and it was a very positive experience.\n\nFor some reason, many focus on the negative, but aside from the Fish,  \nmy paranormal experiences have been extremely positive.\n\nI tend to see apparitions such as those in Gettysburg (and other  \nemotionally charged locations) as residual energy as opposed to  \ndealing with an actual or actual entities that are intelligent.\n\nI also feel that the spiritual realms are not too far off from the  \nillusion we experience here on this plane - you meet all kinds. Some  \nangelic, and some just awful.\n\nw.\nOn Aug 17, 2008, at 8:08 PM, threadsintyme@... wrote:\n\n&gt; It could very well be because the NDE brings with it such deep  \n&gt; emotions. Whenever you come across deep emotions you are likely (but  \n&gt; not always) to find some sort of spirit attachment which can bring  \n&gt; additional problems. Spirits often attachment themselves to  \n&gt; locations or even people who have survived deep personal traumas.\n&gt;\n&gt; That is one reason why some people still see drill formations by  \n&gt; Union and Confederate soldiers in some of the Civil War battle fields.\n&gt;\n&gt; Al\n&gt;\n\n\nI can say ha ha ing expe ienced he dea h o he body wice, I came back alone and i was a e y posi i e expe ience. Fo some eason, many ocus on he nega i e, bu aside om he Fish, my pa ano mal expe iences ha e been ex emely posi i e. I end o see appa i ions such as hose in Ge ysbu g (and o he emo ionally cha ged loca ions) as esidual ene gy as opposed o dealing wi h an ac ual o ac ual en i ies ha a e in elligen . I also eel ha he spi i ual ealms a e no oo a o om he illusion we expe ience he e on his plane - you mee all kinds. Some angelic, and some jus aw ul.w.On Aug 17, 2008, a 8:08 PM, h eadsin yme@... w o e:I could e y well be because he NDE b ings wi h i such deep emo ions. Whene e you come ac oss deep emo ions you a e likely (bu no always) o ind some so o spi i a achmen which can b ing addi ional p oblems. Spi i s o en a achmen hemsel es o loca ions o e en people who ha e su i ed deep pe sonal aumas.Tha is one eason why some people s ill see d ill o ma ions by Union and Con ede a e soldie s in some o he Ci il Wa ba le ields.  Al"}