{"id": "11827", "subject": "Re: [EVP-ITC] Ahhh the infamous Fish!", "author": "black bear hollow", "timestamp": "2008-08-18T00:30:02Z", "full_text": "Amen to that Ann. I&#39;ve met more angels than devils for sure. lol! I&#39;m  \nnot convinced that having had an NDE was what caused Erland&#39;s, my, and  \nothers sensitivity, but maybe. Some are just more sensitive than  \nothers.  What was really interesting was that I was told that I&#39;m  \n&quot;very protected&quot; and that&#39;s what stopped the events - which I can&#39;t  \nsay were all that negative, just unexpected and very super natural.  \nHaving a voice come through the air vents of you vehicle, lights  \nflashing, papers flying, and even having your mail man report  \n&quot;something&quot; said hello to him on our porch when we weren&#39;t home, was  \nvery unnerving, but I can&#39;t say it was all bad. Just incredibly weird.\n\nOne funny thing to note about my experience... I got annoyed - REALLY  \nannoyed at their behavior and refused to speak to them. I was doing  \nlaundry when the light above me began buzzing/flashing and suddenly a  \nvoice came through and apologized for the trouble.\n\nI think of these things now and hardly believe them myself. They just  \nseem a bit too &quot;Hollywood&quot; for my taste. I&#39;m glad I didn&#39;t experience  \nthem alone and people that know me still talk about things that  \nhappened today. It made very clear to me that this world we experience  \nin a body, isn&#39;t real. We&#39;re pretty limited in what our mortal senses  \ncan perceive. Outside of this fleshy avatar is so much more!\n\nw.\nOn Aug 17, 2008, at 8:16 PM, Lisby wrote:\n\n&gt; I would reason that since the majority of people experience such  \n&gt; positive outcomes from an NDE--it is in the whole a positive  \n&gt; experience for almost every person who has one--it would not provide  \n&gt; the necessary negative energy for purportedly negative entities to  \n&gt; feed off. In fact, the majority of NDEers are transformed in a very  \n&gt; positive way indeed. Rarified, even. Seems like an odd food choice  \n&gt; for the Fishes.\n\n\nAmen o ha Ann. I' e me mo e angels han de ils o su e. lol! I'm no con inced ha ha ing had an NDE was wha caused E land's, my, and o he s sensi i i y, bu maybe. Some a e jus mo e sensi i e han o he s.  Wha was eally in e es ing was ha I was old ha I'm \" e y p o ec ed\" and ha 's wha s opped he e en s - which I can' say we e all ha nega i e, jus unexpec ed and e y supe na u al. Ha ing a oice come h ough he ai en s o you ehicle, ligh s lashing, pape s lying, and e en ha ing you mail man epo \"some hing\" said hello o him on ou po ch when we we en' home, was e y unne ing, bu I can' say i was all bad. Jus inc edibly wei d. One unny hing o no e abou my expe ience... I go annoyed - REALLY annoyed a hei beha io and e used o speak o hem. I was doing laund y when he ligh abo e me began buzzing/ lashing and suddenly a oice came h ough and apologized o he ouble. I hink o hese hings now and ha dly belie e hem mysel . They jus seem a bi oo \"Hollywood\" o my as e. I'm glad I didn' expe ience hem alone and people ha know me s ill alk abou hings ha happened oday. I made e y clea o me ha his wo ld we expe ience in a body, isn' eal. We' e p e y limi ed in wha ou mo al senses can pe cei e. Ou side o his leshy a a a is so much mo e!w.On Aug 17, 2008, a 8:16 PM, Lisby w o e:I would eason ha since he majo i y o people expe ience such posi i e ou comes om an NDE--i is in he whole a posi i e expe ience o almos e e y pe son who has one--i would no p o ide he necessa y nega i e ene gy o pu po edly nega i e en i ies o eed o . In ac , he majo i y o NDEe s a e ans o med in a e y posi i e way indeed. Ra i ied, e en. Seems like an odd ood choice o he Fishes."}