{"id": "11831", "subject": "Re: [EVP-ITC] Ahhh the infamous Fish!", "author": "black bear hollow", "timestamp": "2008-08-18T00:57:40Z", "full_text": "I know this was addressed to Ann, but having had 2 NDE&#39;s and knowing  \nmany who have, I don&#39;t know a soul who has experienced anything  \nnegative, though I&#39;ve read biased religious reports of people  \nexperiencing &quot;hell&quot; - something I don&#39;t believe in, nor know anyone  \nwho has in the vast amount of NDE&#39;ers I&#39;ve talked to.\n\nI think it&#39;s important to focus on the majority of positive  \nexperiences. I&#39;m not sure why people seem to feed or insist on  \nnegative experiences.\n\nFirst off, the Fish Group aren&#39;t &quot;people&quot;. They are not and haven&#39;t  \never been human. I have no idea where you get this idea.\nThey are, in fact, a group. There is more than one.\nLastly, we can&#39;t know where or what they experience and to date, those  \nwho have had experiences with them have found that they appear quite  \nhappy doing exactly what they&#39;re doing. I wish you luck if you want to  \npursue &quot;helping&quot; them. You&#39;ll need it.\n\nNot all energies we record are human. This is an important fact.\n\nAs far as the Fish Group being mobile, they most certainly are. They  \nare highly intelligent and more than capable of going to &quot;the Light&quot;  \nor anywhere else they wish.\n\nWhat you state about Gettysburg is your opinion and many would beg to  \ndiffer with your opinion. It&#39;s important I have found to keep the mind  \nopen - very open in this line of research. After many years of  \nresearch, a few try to label and make claims, but there isn&#39;t much to  \nsupport their claims\n\nw.\nOn Aug 17, 2008, at 8:40 PM, threadsintyme@... wrote:\n\n&gt; While it is true that the NDE can be a positive experience, it is  \n&gt; not so for everyone. The trauma that induced the NDE is something  \n&gt; can attract entities.\n&gt;\n&gt; i am not saying that the &quot;fish people&quot; are a negative entity. Not at  \n&gt; all. They are most likely an entity who is isolated and alone. They  \n&gt; are an entity who very well may have a lower vibration that can  \n&gt; prevent them from moving towards the light. In fact, on their level,  \n&gt; there is no sense of light at all. Most of the earth bounds are  \n&gt; actually spirits who are in basically a mono-dimensional universe.  \n&gt; In a  singular dimension. Their own dimension. In fact, until  \n&gt; spiritual assistance is offered from both sides of the veil, they  \n&gt; will remain trapped. They know no dimension, nor depth, height,  \n&gt; width, breadth or even light. Some are trapped in either total  \n&gt; darkness or trapped in a form of mist or fog.\n&gt;\n&gt; You might be interested in listening to some tapes that have been  \n&gt; made of trance mediums who have assisted with their rescue.  If you  \n&gt; are, let me know and I will send you the URL.\n&gt;\n&gt; What you are referring to about Gettysburg are NOT psychic  \n&gt; impressions. Impressions is when a traumatic event took place and  \n&gt; the event will replay over and over again. in fact, in some cases,  \n&gt; the event can even be timed.\n&gt;\n\n\nI know his was add essed o Ann, bu ha ing had 2 NDE's and knowing many who ha e, I don' know a soul who has expe ienced any hing nega i e, hough I' e ead biased eligious epo s o people expe iencing \"hell\" - some hing I don' belie e in, no know anyone who has in he as amoun o NDE'e s I' e alked o. I hink i 's impo an o ocus on he majo i y o posi i e expe iences. I'm no su e why people seem o eed o insis on nega i e expe iences. Fi s o , he Fish G oup a en' \"people\". They a e no and ha en' e e been human. I ha e no idea whe e you ge his idea. They a e, in ac , a g oup. The e is mo e han one. Las ly, we can' know whe e o wha hey expe ience and o da e, hose who ha e had expe iences wi h hem ha e ound ha hey appea qui e happy doing exac ly wha hey' e doing. I wish you luck i you wan o pu sue \"helping\" hem. You'll need i .No all ene gies we eco d a e human. This is an impo an ac .As a as he Fish G oup being mobile, hey mos ce ainly a e. They a e highly in elligen and mo e han capable o going o \" he Ligh \" o anywhe e else hey wish.Wha you s a e abou Ge ysbu g is you opinion and many would beg o di e wi h you opinion. I 's impo an I ha e ound o keep he mind open - e y open in his line o esea ch. A e many yea s o esea ch, a ew y o label and make claims, bu he e isn' much o suppo hei claimsw.On Aug 17, 2008, a 8:40 PM, h eadsin yme@... w o e:While i is ue ha he NDE can be a posi i e expe ience, i is no so o e e yone. The auma ha induced he NDE is some hing can a ac en i ies.i am no saying ha he \" ish people\" a e a nega i e en i y. No a all. They a e mos likely an en i y who is isola ed and alone. They a e an en i y who e y well may ha e a lowe ib a ion ha can p e en hem om mo ing owa ds he ligh . In ac , on hei le el, he e is no sense o ligh a all. Mos o he ea h bounds a e ac ually spi i s who a e in basically a mono-dimensional uni e se. In a  singula dimension. Thei own dimension. In ac , un il spi i ual assis ance is o e ed om bo h sides o he eil, hey will emain apped. They know no dimension, no dep h, heigh , wid h, b ead h o e en ligh . Some a e apped in ei he o al da kness o apped in a o m o mis o og.You migh be in e es ed in lis ening o some apes ha ha e been made o ance mediums who ha e assis ed wi h hei escue.  I you a e, le me know and I will send you he URL.Wha you a e e e ing o abou Ge ysbu g a e NOT psychic imp essions. Imp essions is when a auma ic e en ook place and he e en will eplay o e and o e again. in ac , in some cases, he e en can e en be imed."}