{"id": "11849", "subject": "Re: [EVP-ITC] Ahhh the infamous Fish!", "author": "black bear hollow", "timestamp": "2008-08-18T02:33:12Z", "full_text": "I totally agree. I also like science to back up my experiences as much  \nas possible instead of assumptions as &quot;fact&quot;.\n\nI grow weary of the ego that I see in this field of research. People  \nfeeling their have some special gift to &quot;free trapped souls&quot; or assume  \nthey&#39;re even trapped. I asked my &quot;house spirits&quot; (their term not mine)  \nif they were &quot;trapped&quot; and they thought that was ridiculous. I have a  \nfeeling we&#39;re much more trapped than they are. ;) I was informed some  \nare around all the time and some just visit. Who am I to argue or  \nassume different? I&#39;m only an audio observer.I&#39;m in a fleshy avatar  \nthat needs glasses/contacts to even see across the room. Am I to  \nassume with my incredibly limited current situation of being in a body  \nthat I am equipped to help those who are free from such a limitation?  \nlol! I think not!\n\nDue to my past experiences, I have a very deep faith that all is taken  \ncare of. Both here and in other realms/dimensions by an Intelligence a  \nlot bigger than all of us. For me to assume that that power that some  \ncall &quot;God&quot;- &quot;Buddha&quot;- &quot;Allah&quot;- [Insert Higher Power here] isn&#39;t taking  \ncare of things, or that energies/souls stay stuck, for me, and in my  \nexperience is absurd. I not only heard, but spoke with an entity named  \n&quot;Lisa&quot; who said that there were people assigned to those coming over  \n(passing from our earthly realm). This is exactly what I&#39;ve  \nexperienced myself in my own passing. Our relatives, pets, and other  \nenergies come for us in my experience. I&#39;ve also sat with those who  \ncrossed over and know those gone before them came for them as they  \nsaid so before passing.\n\nMy NDE&#39;s were incredibly positive. I&#39;ll always be grateful for those  \nexperiences as they keep my mind open to anything/any experience.  \nBeautiful beyond words.\n\nw.\nOn Aug 17, 2008, at 9:36 PM, Lisby wrote:\n\n&gt; I know that 99.9 percent of all NDEs are positive experiences. You  \n&gt; have a few people who discuss hell-like situations but that is  \n&gt; almost nil percent.\n&gt;\n&gt;\n&gt; I&#39;m not really a big fan of mediums &quot;freeing&quot; trapped souls. I think  \n&gt; it says more about the medium than the soul. That&#39;s my opinion and  \n&gt; I&#39;ve had a lot of years in parapsychology to form it. I&#39;m not trying  \n&gt; to ruffle anyone&#39;s feathers. I haven&#39;t been posting here a lot for a  \n&gt; while, so you don&#39;t know me. Really, I am not ever disrespecting  \n&gt; anyone&#39;s opinion, just disgreeing with it. :)\n&gt;\n&gt;\n&gt; What you write about the Gettysburg hauntings is speculation that I  \n&gt; agree with, but I still don&#39;t see any connection to the Fish Group  \n&gt; and NDEs.\n&gt;\n&gt; Ann\n\n\nI o ally ag ee. I also like science o back up my expe iences as much as possible ins ead o assump ions as \" ac \". I g ow wea y o he ego ha I see in his ield o esea ch. People eeling hei ha e some special gi o \" ee apped souls\" o assume hey' e e en apped. I asked my \"house spi i s\" ( hei e m no mine) i hey we e \" apped\" and hey hough ha was idiculous. I ha e a eeling we' e much mo e apped han hey a e. ;) I was in o med some a e a ound all he ime and some jus isi . Who am I o a gue o assume di e en ? I'm only an audio obse e .I'm in a leshy a a a ha needs glasses/con ac s o e en see ac oss he oom. Am I o assume wi h my inc edibly limi ed cu en si ua ion o being in a body ha I am equipped o help hose who a e ee om such a limi a ion? lol! I hink no !Due o my pas expe iences, I ha e a e y deep ai h ha all is aken ca e o . Bo h he e and in o he ealms/dimensions by an In elligence a lo bigge han all o us. Fo me o assume ha ha powe ha some call \"God\"- \"Buddha\"- \"Allah\"- [Inse Highe Powe he e] isn' aking ca e o hings, o ha ene gies/souls s ay s uck, o me, and in my expe ience is absu d. I no only hea d, bu spoke wi h an en i y named \"Lisa\" who said ha he e we e people assigned o hose coming o e (passing om ou ea hly ealm). This is exac ly wha I' e expe ienced mysel in my own passing. Ou ela i es, pe s, and o he ene gies come o us in my expe ience. I' e also sa wi h hose who c ossed o e and know hose gone be o e hem came o hem as hey said so be o e passing.My NDE's we e inc edibly posi i e. I'll always be g a e ul o hose expe iences as hey keep my mind open o any hing/any expe ience. Beau i ul beyond wo ds.w.On Aug 17, 2008, a 9:36 PM, Lisby w o e:I know ha 99.9 pe cen o all NDEs a e posi i e expe iences. You ha e a ew people who discuss hell-like si ua ions bu ha is almos nil pe cen . I'm no eally a big an o mediums \" eeing\" apped souls. I hink i says mo e abou he medium han he soul. Tha 's my opinion and I' e had a lo o yea s in pa apsychology o o m i . I'm no ying o u le anyone's ea he s. I ha en' been pos ing he e a lo o a while, so you don' know me. Really, I am no e e dis espec ing anyone's opinion, jus disg eeing wi h i . :)Wha you w i e abou he Ge ysbu g haun ings is specula ion ha I ag ee wi h, bu I s ill don' see any connec ion o he Fish G oup and NDEs.Ann"}