{"id": "11842", "subject": "Re: [EVP-ITC] Ahhh the infamous Fish!", "author": "black bear hollow", "timestamp": "2008-08-18T01:46:13Z", "full_text": "On Aug 17, 2008, at 9:33 PM, threadsintyme@... wrote:\n\n&gt; W.,\n&gt;\n&gt; You can&#39;t speak for everyone who has had an NDE. Not everyone has  \n&gt; had a great experience. I am glad that you had a wonderful and  \n&gt; enlightening experience. People who have had a negative NDE remember  \n&gt; those experiences.\n&gt;\n\nW: Of course I can&#39;t - and I&#39;m not, nor have I ever.\n\n&gt; Now about the &quot;Fish people.&quot; I never said that they were people.  \n&gt; That was the term that has been bandied about and I was using the  \n&gt; same language.\n&gt;\n\n&gt; W: I&#39;ve never heard anyone prior to you use the term &quot;Fish People&quot;.  \n&gt; Who, besides you, uses the term?\n&gt;\n&gt; If they have never been human, then what are they?\n&gt;\nW: Who knows? I didn&#39;t ask. Does it matter? We aren&#39;t the only beings  \nin the great beyond Al.\n\n&gt; &lt;&lt;They are, in fact, a group. There is more than one. Lastly, we  \n&gt; can&#39;t know where or what they experience and to date, those who have  \n&gt; had experiences with them have found that they appear quite happy  \n&gt; doing exactly what they&#39;re doing.&gt;&gt;\n&gt;\n&gt; Right...LOL...and you know this how? Because you have listened to  \n&gt; them? You have the uncanny ability to KNOW when a spirit is or is  \n&gt; not happy?\n\nW: Not sure what&#39;s amusing, but I don&#39;t appreciate your sarcasm. I  \nknow this as I&#39;ve dealt with them personally. I guess you haven&#39;t read  \nmy prior posts.\n\n&gt;\n&gt; I am not interested in helping them, per se. What I am interested  \n&gt; in, is learning more about them and why they are the way that they  \n&gt; are. That is normal for me since I am a medium.\n&gt;\n&gt; &lt;&lt;Not all energies we record are human. This is an important fact.&gt;&gt;\n&gt;\n&gt; Oh? Really? What are they; or shall I ask, what WERE they? Unless  \n&gt; you buy into the theory that behind every tree lurks a demon! Which  \n&gt; is so full of balogney. Fallen angels maybe?\n\nW: Full of baloney? Who do you think you are making jest of my  \nexperience? Who made you the authority on the Fish Group? Me? I can  \nonly speak from experience. At least I&#39;ve interacted with them.\n\nI&#39;ve recorded many energies claiming to be elementals to extra  \nterrestrials. You tell me where they are. Does it matter? Who cares  \nreally? Why don&#39;t you try to contact them Al and &quot;save them&quot;. Let us  \nall know what happens.\n\n&gt;\n&gt; Where did you find out about this &quot;important fact&quot;? (That they were  \n&gt; never human?) I am really interested in your theory. I am being  \n&gt; honest...\n\nW: By talking to them. I spent weeks talking to them. Also via others  \nwho spoke with them.\n&gt;\n&gt; I know that some energies were never human...electricity is an  \n&gt; energy and has never been human. I don&#39;t know how something that can  \n&gt; interact with the our present dimension is NOT or has never been  \n&gt; alive at some point. Angels are a dynamic force and they have not  \n&gt; been alive either. They interact with us, but that is pretty much it.\n&gt; Al\n\n\n\nOn Aug 17, 2008, a 9:33 PM, h eadsin yme@... w o e:W.,You can' speak o e e yone who has had an NDE. No e e yone has had a g ea expe ience. I am glad ha you had a wonde ul and enligh ening expe ience. People who ha e had a nega i e NDE emembe hose expe iences.W: O cou se I can' - and I'm no , no ha e I e e . Now abou he \"Fish people.\" I ne e said ha hey we e people. Tha was he e m ha has been bandied abou and I was using he same language.W: I' e ne e hea d anyone p io o you use he e m \"Fish People\". Who, besides you, uses he e m?I hey ha e ne e been human, hen wha a e hey?  W: Who knows? I didn' ask. Does i ma e ? We a en' he only beings in he g ea beyond Al.> Righ ...LOL...and you know his how? Because you ha e lis ened o hem? You ha e he uncanny abili y o KNOW when a spi i is o is no happy?W: No su e wha 's amusing, bu I don' app ecia e you sa casm. I know his as I' e deal wi h hem pe sonally. I guess you ha en' ead my p io pos s.   I am no in e es ed in helping hem, pe se. Wha I am in e es ed in, is lea ning mo e abou hem and why hey a e he way ha hey a e. Tha is no mal o me since I am a medium. > Oh? Really? Wha  a e hey; o shall I ask, wha WERE hey? Unless you buy in o he heo y ha behind e e y ee lu ks a demon! Which is so ull o balogney. Fallen angels maybe?W: Full o baloney? Who do you hink you a e making jes o my expe ience? Who made you he au ho i y on he Fish G oup? Me? I can only speak om expe ience. A leas I' e in e ac ed wi h hem. I' e eco ded many ene gies claiming o be elemen als o ex a e es ials. You ell me whe e hey a e. Does i ma e ? Who ca es eally? Why don' you y o con ac hem Al and \"sa e hem\". Le us all know wha happens.  Whe e did you ind ou abou his \"impo an ac \"? (Tha hey we e ne e human?) I am eally in e es ed in you heo y. I am being hones ...W: By alking o hem. I spen weeks alking o hem. Also ia o he s who spoke wi h hem. I know ha some ene gies we e ne e human...elec ici y is an ene gy and has ne e been human. I don' know how some hing ha can in e ac wi h he ou p esen dimension is NOT o has ne e been ali e a some poin . Angels a e a dynamic o ce and hey ha e no been ali e ei he . They in e ac wi h us, bu ha is p e y much i .  Al"}