{"id": "11848", "subject": "Re: [EVP-ITC] Ahhh the infamous Fish!", "author": "black bear hollow", "timestamp": "2008-08-18T02:14:30Z", "full_text": "Al,\n\nI refrain from associating religious myth with paranormal research. I  \nrespect people&#39;s right to whatever beliefs they choose, but I also  \nrespect those who aren&#39;t religious, but spiritual or whatever.\n\nHaving experienced &quot;death&quot; twice, I feel fairly secure in my  \nexperiences and would say you&#39;re in for a big surprise. I wouldn&#39;t  \ncall or refer to these energies as &quot;souls&quot;. I&#39;m not sure where you get  \nthe idea or assume these energies are more than or &quot;above&quot; what you  \nterm a &quot;lowly entity&quot;. Making statements assuming everyone believes  \nthe same way or experienced the same things is not only without sense,  \nbut incredibly arrogant in my mind. We&#39;re all in the same boat here.  \nI&#39;d rather hear people speak about their experiences, not tag comments  \nwith religious like dogma in an attempt to explain.\n\nThere are no experts in this research as Misty stated not long ago.  \nWe&#39;re all learning, experiencing and floundering for answers. All I  \ncan share are my own experiences in the hope it will help others in  \ntheir own research. That&#39;s it.\n\nThe initial topic was the Fish Group. I&#39;ll stick with that. Other than  \nFrank, Erland, and a rare few others, I don&#39;t know anyone else who has  \nexperienced the Fish Group. I did hear that the author of &quot;Moth Man&quot;  \nrecorded evp and he ran into what he termed a malevolent group that  \ndisgusted him so that he quit recording. I have to wonder if it was  \nthem.\n\nw.\n\n\nOn Aug 17, 2008, at 9:58 PM, threadsintyme@... wrote:\n\n&gt; Wisteria,\n&gt;\n&gt; I forgot but you may be quite right! There are spirits who have  \n&gt; never been incarnated into human form. They tend not to be involved  \n&gt; in any way with lower forms of vibration.\n&gt;\n&gt; Edgar Cayce spoke of them. Their souls were created as the moment of  \n&gt; Creation. They chose not to have ever incarnated. Since their  \n&gt; vibration level is far more than a lowly entity, I highly doubt that  \n&gt; they would interact with lower entities. They are on a completely  \n&gt; different level of existence.\n&gt;\n&gt; Al\n&gt;\n\n\nAl, I e ain om associa ing eligious my h wi h pa ano mal esea ch. I espec people's igh o wha e e belie s hey choose, bu I also espec hose who a en' eligious, bu spi i ual o wha e e . Ha ing expe ienced \"dea h\" wice, I eel ai ly secu e in my expe iences and would say you' e in o a big su p ise. I wouldn' call o e e o hese ene gies as \"souls\". I'm no su e whe e you ge he idea o assume hese ene gies a e mo e han o \"abo e\" wha you e m a \"lowly en i y\". Making s a emen s assuming e e yone belie es he same way o expe ienced he same hings is no only wi hou sense, bu inc edibly a ogan in my mind. We' e all in he same boa he e. I'd a he hea people speak abou hei expe iences, no ag commen s wi h eligious like dogma in an a emp o explain.The e a e no expe s in his esea ch as Mis y s a ed no long ago. We' e all lea ning, expe iencing and lounde ing o answe s. All I can sha e a e my own expe iences in he hope i will help o he s in hei own esea ch. Tha 's i .The ini ial opic was he Fish G oup. I'll s ick wi h ha . O he han F ank, E land, and a a e ew o he s, I don' know anyone else who has expe ienced he Fish G oup. I did hea ha he au ho o \"Mo h Man\" eco ded e p and he an in o wha he e med a male olen g oup ha disgus ed him so ha he qui eco ding. I ha e o wonde i i was hem.w.On Aug 17, 2008, a 9:58 PM, h eadsin yme@... w o e:Wis e ia,I o go bu you may be qui e igh ! The e a e spi i s who ha e ne e been inca na ed in o human o m. They end no o be in ol ed in any way wi h lowe o ms o ib a ion.Edga Cayce spoke o hem. Thei souls we e c ea ed as he momen o C ea ion. They chose no o ha e e e inca na ed. Since hei ib a ion le el is a mo e han a lowly en i y, I highly doub ha hey would in e ac wi h lowe en i ies. They a e on a comple ely di e en le el o exis ence.Al"}