{"id": "11873", "subject": "Re: [EVP-ITC] Ahhh the infamous Fish!", "author": "black bear hollow", "timestamp": "2008-08-18T14:21:03Z", "full_text": "Ok, I can discuss most anything within the realms of respect. your  \ninsults show your true nature. Perhaps you should find a list that  \nwelcomes insults and sarcasm. Most of us here on this list are serious  \nresearchers that deserve respect... even if you don&#39;t agree that what  \nwe record is legitimate. That said, there&#39;s no point in continuing  \nconversation or attempted debate with you.\n\nWhat&#39;s ludicrous is arguing with someone who doesn&#39;t think much of  \nyour research to begin with and bases his own belief on the heresay of  \nothers, religious myths and fairy tales instead of concrete evidence  \nthat is worthy of further research.\n\nPerhaps this isn&#39;t the list for you?\n\nw.\nOn Aug 18, 2008, at 10:11 AM, threadsintyme@... wrote:\n\n&gt; I don&#39;t know from whence you get your ideas from, but they are  \n&gt; ludicrous. To believe in sitting over a radio listening to radio  \n&gt; fragments and then joyously clapping their hands when a &quot;researcher&quot;  \n&gt; believes (usually this is just the &quot;researcher&quot; placing their own  \n&gt; beliefs into whatever they think that they hear) over thousands of  \n&gt; hours and years of research by mediums and other legitimate  \n&gt; researchers is inconceivable.\n&gt;\n&gt; I have said this before and I will say it again, that listening for  \n&gt; radio fragments is NOT communication in any one&#39;s book. It is not  \n&gt; legitimate. For true communication to take place there has to be an  \n&gt; exchange of ideas, a communication has to be established.  \n&gt; Information has to be exchanged. Has there ever been a true exchange  \n&gt; of information given through ITC...yes, but those are far and few  \n&gt; between. Konstantin Raudive is one example...bloody few others. The  \n&gt; difference between Raudive and listening to radio fragments are a  \n&gt; world apart!\n&gt;\n&gt; I am afraid that being involved with ITC has more to do with  \n&gt; emotional and psychological needs than any form of reality, let  \n&gt; alone legitimate research!\n&gt;\n&gt; Al\n&gt;\n\n\nOk, I can discuss mos any hing wi hin he ealms o espec . you insul s show you ue na u e. Pe haps you should ind a lis ha welcomes insul s and sa casm. Mos o us he e on his lis a e se ious esea che s ha dese e espec ... e en i you don' ag ee ha wha we eco d is legi ima e. Tha said, he e's no poin in con inuing con e sa ion o a emp ed deba e wi h you. Wha 's ludic ous is a guing wi h someone who doesn' hink much o you esea ch o begin wi h and bases his own belie on he he esay o o he s, eligious my hs and ai y ales ins ead o conc e e e idence ha is wo hy o u he esea ch. Pe haps his isn' he lis o you?w.On Aug 18, 2008, a 10:11 AM, h eadsin yme@... w o e:I don' know om whence you ge you ideas om, bu hey a e ludic ous. To belie e in si ing o e a adio lis ening o adio agmen s and hen joyously clapping hei hands when a \" esea che \" belie es (usually his is jus he \" esea che \" placing hei own belie s in o wha e e hey hink ha hey hea ) o e housands o hou s and yea s o esea ch by mediums and o he legi ima e esea che s is inconcei able.   I ha e said his be o e and I will say i again, ha lis ening o adio agmen s is NOT communica ion in any one's book. I is no legi ima e. Fo ue communica ion o ake place he e has o be an exchange o ideas, a communica ion has o be es ablished. In o ma ion has o be exchanged. Has he e e e been a ue exchange o in o ma ion gi en h ough ITC...yes, bu hose a e a and ew be ween. Kons an in Raudi e is one example...bloody ew o he s. The di e ence be ween Raudi e and lis ening o adio agmen s a e a wo ld apa !I am a aid ha being in ol ed wi h ITC has mo e o do wi h emo ional and psychological needs han any o m o eali y, le alone legi ima e esea ch!Al"}