{"id": "11872", "subject": "Re: [EVP-ITC] Ahhh the infamous Fish!", "author": "black bear hollow", "timestamp": "2008-08-18T14:13:43Z", "full_text": "Just about everything.\n\nThey are individual energies or spirits. I spoke with them for about 6  \nweeks daily. I&#39;d talk to a male sounding energy, though they have no  \ngender. They said they had never been incarnated or had a physical  \nbody. They lied a lot. They seemed to get a huge kick out of pranks  \nand trying to control. Also trying to scare me, friends, and family  \nwith various paranormal phenomenon. A favorite was coming through  \nradios calling my name. This generally happened in my home or in the  \ncar. They especially loved shouting at me through the radio while  \npeople who have no idea about EVP/ITC research were around. Can you  \nimagine how difficult it is to explain why your name, which is unique  \nto begin with (Wisteria) is coming through a car radio? To top that  \noff, they&#39;d announce they had an extra terrestrial that had to talk to  \nme NOW. They tried to tell me what to eat and that I should remarry my  \nexhusband. lol! Basically they really tried to control me.\n\nI have a HUGE sense of humor. Much of it was funny, some of it was  \nterrible - they will say things like &quot;you need to kill so & so because  \nit will correct your karma - if you don&#39;t do this, you will be doomed  \n- blah blah...&quot; That&#39;s not funny. Some people of a different character  \nmight take them seriously.\n\nI&#39;m an independent person and I think for myself. This is a good thing  \nin this kind of research. They love fear. They&#39;d display amazing feats  \nof poltergeist activity and get a huge kick out of scaring me or  \nothers. I&#39;ve seen a lot of weird things mind you, but voices generated  \nout of thin air - literally and the manipulation of electrical  \nequipment is very bizarre when you aren&#39;t used to it.\n\nThe last straw was one of them telling me my mother would have a  \nstroke in my kitchen and it &quot;wouldn&#39;t be pretty&quot;. It never happened  \nand they were so obnoxious that I contacted Lisa (AAEVP) for help. She  \ntold me about Mr. Smith, Erland, and another man who had the same  \nexperiences and this group claiming to be The Fish Group. Erland  \nhelped the most. I can&#39;t remember why we came up with the NDE  \nconnection. I wonder now if Lisa came up with that, but I don&#39;t  \nremember. It seems that a common side effect of those who have crossed  \nover and come back, that they are very naturally clairaudient after. I  \nassume there is something different about our light or energy. Perhaps  \nwe&#39;re changed somehow.\n??? I just don&#39;t know - yet!\n\nLisa mentioned them as being the Fish Group and that was the first I&#39;d  \nheard of them. I have to wonder if they simply claim this as they not  \nonly lie (A LOT) but are egotistical beings and enjoy their illusion  \nof power and control. I have heard other researchers mention a Fish  \nGroup who are not of ill intent and are very nice - very scientific,  \nand trying just as hard as we are to make contact. So I have to wonder  \nif the Fish Group I, Erland, and a few others experienced are simply  \nclaiming to be the other group, but in fact, are nothing more than  \nsomething akin to a band of malevolent faeries making false claims.\n\nFrank, if you&#39;re reading this, maybe you could share your own Fish  \nexperiences to add clarity?\n\nWhat was interesting for me, is that in hind sight, though they were  \njust awful at times, at other times they seemed like children who  \nsimply act terribly to get attention.\n\nWhat stopped the crazy phenomenon I was experiencing? Not recording.  \nNot recording or talking to them at all and ignoring their antics  \nseemed to thicken the veil once again. I also prayed for them and sent  \nthem love. I still do.\n\nSo on one hand it was an awful experience, and on the other, I  \nexperienced things so incredible (with witnesses) that I&#39;ll be forever  \ngrateful. the good news is that no matter how hairy things get, we are  \nprotected and have free will and nothing can interfere with that  \nunless we allow it to. So if your lights start flashing, electrical  \nequipment starts acting possessed, and gusts of wind come out of your  \ncar vents clearly and papers, etc... start flying around, simply enjoy  \nit. lol! It can&#39;t hurt you as far as I know as long as you keep your  \nhead about you, stay grounded and remain with a loving heart.\n\nAh the wonders of the unknown becoming known! Aren&#39;t we lucky?\n\nw.\n\nw.\nOn Aug 17, 2008, at 11:45 PM, Zack Widup wrote:\n\n&gt; I&#39;d like to know. What kind of things do they do and say?\n&gt;\n&gt; Zack\n\n\nJus abou e e y hing. They a e indi idual ene gies o spi i s. I spoke wi h hem o abou 6 weeks daily. I'd alk o a male sounding ene gy, hough hey ha e no gende . They said hey had ne e been inca na ed o had a physical body. They lied a lo . They seemed o ge a huge kick ou o p anks and ying o con ol. Also ying o sca e me, iends, and amily wi h a ious pa ano mal phenomenon. A a o i e was coming h ough adios calling my name. This gene ally happened in my home o in he ca . They especially lo ed shou ing a me h ough he adio while people who ha e no idea abou EVP/ITC esea ch we e a ound. Can you imagine how di icul i is o explain why you name, which is unique o begin wi h (Wis e ia) is coming h ough a ca adio? To op ha o , hey'd announce hey had an ex a e es ial ha had o alk o me NOW. They ied o ell me wha o ea and ha I should ema y my exhusband. lol! Basically hey eally ied o con ol me. I ha e a HUGE sense o humo . Much o i was unny, some o i was e ible - hey will say hings like \"you need o kill so & so because i will co ec you ka ma - i you don' do his, you will be doomed - blah blah...\" Tha 's no unny. Some people o a di e en cha ac e migh ake hem se iously. I'm an independen pe son and I hink o mysel . This is a good hing in his kind o esea ch. They lo e ea . They'd display amazing ea s o pol e geis ac i i y and ge a huge kick ou o sca ing me o o he s. I' e seen a lo o wei d hings mind you, bu oices gene a ed ou o hin ai - li e ally and he manipula ion o elec ical equipmen is e y biza e when you a en' used o i . The las s aw was one o hem elling me my mo he would ha e a s oke in my ki chen and i \"wouldn' be p e y\". I ne e happened and hey we e so obnoxious ha I con ac ed Lisa (AAEVP) o help. She old me abou M . Smi h, E land, and ano he man who had he same expe iences and his g oup claiming o be The Fish G oup. E land helped he mos . I can' emembe why we came up wi h he NDE connec ion. I wonde now i Lisa came up wi h ha , bu I don' emembe . I seems ha a common side e ec o hose who ha e c ossed o e and come back, ha hey a e e y na u ally clai audien a e . I assume he e is some hing di e en abou ou ligh o ene gy. Pe haps we' e changed somehow. ??? I jus don' know - ye !Lisa men ioned hem as being he Fish G oup and ha was he i s I'd hea d o hem. I ha e o wonde i hey simply claim his as hey no only lie (A LOT) bu a e ego is ical beings and enjoy hei illusion o powe and con ol. I ha e hea d o he esea che s men ion a Fish G oup who a e no o ill in en and a e e y nice - e y scien i ic, and ying jus as ha d as we a e o make con ac . So I ha e o wonde i he Fish G oup I, E land, and a ew o he s expe ienced a e simply claiming o be he o he g oup, bu in ac , a e no hing mo e han some hing akin o a band o male olen ae ies making alse claims. F ank, i you' e eading his, maybe you could sha e you own Fish expe iences o add cla i y?Wha was in e es ing o me, is ha in hind sigh , hough hey we e jus aw ul a imes, a o he imes hey seemed like child en who simply ac e ibly o ge a en ion. Wha s opped he c azy phenomenon I was expe iencing? No eco ding. No eco ding o alking o hem a all and igno ing hei an ics seemed o hicken he eil once again. I also p ayed o hem and sen hem lo e. I s ill do.So on one hand i was an aw ul expe ience, and on he o he , I expe ienced hings so inc edible (wi h wi nesses) ha I'll be o e e g a e ul. he good news is ha no ma e how hai y hings ge , we a e p o ec ed and ha e ee will and no hing can in e e e wi h ha unless we allow i o. So i you ligh s s a lashing, elec ical equipmen s a s ac ing possessed, and gus s o wind come ou o you ca en s clea ly and pape s, e c... s a lying a ound, simply enjoy i . lol! I can' hu you as a as I know as long as you keep you head abou you, s ay g ounded and emain wi h a lo ing hea .Ah he wonde s o he unknown becoming known! A en' we lucky?w.w.    On Aug 17, 2008, a 11:45 PM, Zack Widup w o e:I'd like o know. Wha kind o hings do hey do and say?Zack"}