{"id": "11886", "subject": "Re: [EVP-ITC] Ahhh the infamous Fish!", "author": "Lisby", "timestamp": "2008-08-18T15:37:53Z", "full_text": "That&#39;s a logical assumption, but I don&#39;t think it can be accepted as  \nfact. We just don&#39;t know yet.\n\nAnn\n\nOn Aug 18, 2008, at 1:51 AM, threadsintyme@... wrote:\n\n&gt;\n&gt; Ann,\n&gt;\n&gt; Often times, gorups of lower level entities work as a group. They  \n&gt; will often have a central type of leader...and will stay with that  \n&gt; leader until they grow tired and move away to try to find new  \n&gt; experiences.\n&gt;\n&gt; Al\n&gt;\n&gt; -- Lisby &lt;lisby@...&gt; wrote:\n&gt;\n&gt;\n&gt;\n&gt; On Aug 17, 2008, at 8:57 PM, black bear hollow wrote:\n&gt;&gt;\n&gt;&gt; First off, the Fish Group aren&#39;t &quot;people&quot;. They are not and  \n&gt;&gt; haven&#39;t ever been human. I have no idea where you get this idea. &lt;&lt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; I said that because all of the examples I heard of EVP by the Fish  \n&gt; Group has sounded very human and they have never claimed to have  \n&gt; been other than human that I have heard. I have to base my  \n&gt; conclusions on the EVP files, not speculation, even from the  \n&gt; victims. Do you know of instances where they audibly claimed to be  \n&gt; nonhuman? I may have missed them--I heard a lot of EVPs from them,  \n&gt; but certainly not the sum total. (As I said--I even got one myself  \n&gt; the other day.)\n&gt;\n&gt; I think you&#39;re right that they are definitely mobile, and a  \n&gt; collective.\n&gt;\n&gt; Ann\n&gt;\n&gt;\n&gt;\n&gt; ____________________________________________________________\n&gt; Save hundreds on an Unsecured Loan - Click here.\n&gt;\n&gt; \n\n\nTha 's a logical assump ion, bu I don' hink i can be accep ed as ac . We jus don' know ye .AnnOn Aug 18, 2008, a 1:51 AM, h eadsin yme@... w o e:Ann,O en imes, go ups o lowe le el en i ies wo k as a g oup. They will o en ha e a cen al ype o leade ...and will s ay wi h ha leade un il hey g ow i ed and mo e away o y o ind new expe iences.Al-- Lisby ne > w o e:On Aug 17, 2008, a 8:57 PM, black bea hollow w o e:Fi s o , he Fish G oup a en' \"people\". They a e no and ha en' e e been human. I ha e no idea whe e you ge his idea. I said ha because all o he examples I hea d o EVP by he Fish G oup has sounded e y human and hey ha e ne e claimed o ha e been o he han human ha I ha e hea d. I ha e o base my conclusions on he EVP iles, no specula ion, e en om he ic ims. Do you know o ins ances whe e hey audibly claimed o be nonhuman? I may ha e missed hem--I hea d a lo o EVPs om hem, bu ce ainly no he sum o al. (As I said--I e en go one mysel he o he day.)I hink you' e igh ha hey a e de ini ely mobile, and a collec i e.Ann____________________________________________________________ Sa e hund eds on an Unsecu ed Loan - Click he e."}