{"id": "11906", "subject": "Re: [EVP-ITC] Ahhh the infamous Fish!", "author": "Lisby", "timestamp": "2008-08-18T17:23:51Z", "full_text": "It&#39;s called &quot;evidence.&quot; Heard of it? All this talk about the Fish  \nGroup is predicated on things that happened to other people. Ever  \nplayed Chinese Telephones? Without the original EVP files, then its  \nall a case of third-fourth-eight-hand testimony, slowly blowing out  \nof proportion and reaching legendary status before you can say &quot;Bob&#39;s  \nyour uncle.&quot; If there never was any EVP evidence we&#39;d not even be  \ncalling them the Fish Group. They gave that name to themselves,  \nthrough EVPs. If you don&#39;t accept EVP as good--if not the best-- \nevidence we have of paranormal communication, why are you here?\n\nSome of us here have trying to approach this research in a logical  \nand basically scientific way for many years. I, a least, will not  \nstart rolling in imaginative speculation on anyone&#39;s whim.\n\nAnn\n\nOn Aug 18, 2008, at 12:52 PM, black bear hollow wrote:\n\n&gt;\n&gt; What difference would a recording make? Especially\n&gt; Since in this research where we usually can&#39;t see who or what\n&gt; we&#39;re talking to. Any voice we hear or record could be anything.\n&gt;\n&gt; W\n&gt;\n&gt; On Aug 18, 2008, at 4:32 PM, &quot;threadsintyme@...&quot;  \n&gt; &lt;Threadsintyme@...&gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt; I wonder the same thing myself...does anyone have any recordings  \n&gt;&gt; of them that can be listened to?\n&gt;&gt;\n&gt;&gt; Al\n&gt;&gt;\n&gt;&gt; -- Lisby &lt;lisby@...&gt; wrote:\n&gt;&gt;\n&gt;&gt; I&#39;ve heard of this as well, but my question was, do we have any  \n&gt;&gt; EVP evidence that the *Fish Group* ever claimed to be other than  \n&gt;&gt; dead people?\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; Ann\n&gt;&gt;\n&gt;&gt; On Aug 18, 2008, at 1:58 AM, threadsintyme@... wrote:\n&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt; Wisteria,\n&gt;&gt;&gt;\n&gt;&gt;&gt; I forgot but you may be quite right! There are spirits who have  \n&gt;&gt;&gt; never been incarnated into human form. They tend not to be  \n&gt;&gt;&gt; involved in any way with lower forms of vibration.\n&gt;&gt;&gt;\n&gt;&gt;&gt; Edgar Cayce spoke of them. Their souls were created as the moment  \n&gt;&gt;&gt; of Creation. They chose not to have ever incarnated. Since their  \n&gt;&gt;&gt; vibration level is far more than a lowly entity, I highly doubt  \n&gt;&gt;&gt; that they would interact with lower entities. They are on a  \n&gt;&gt;&gt; completely different level of existence.\n&gt;&gt;&gt;\n&gt;&gt;&gt; Al\n&gt;&gt;&gt;\n&gt;&gt;&gt; -- black bear hollow &lt;blackbearhollow@...&gt; wrote:\n&gt;&gt;&gt;\n&gt;&gt;&gt; I just said that in reference to Al&#39;s comments. There are a  \n&gt;&gt;&gt; cluster of researchers who insist on tagging religious myth on  \n&gt;&gt;&gt; research... angels, devils, heaven, hell, assuming anything  \n&gt;&gt;&gt; visiting our plane is &quot;stuck&quot; and needs &quot;saving&quot; and ignoring  \n&gt;&gt;&gt; other energies assuming everything they hear is or was a human  \n&gt;&gt;&gt; mortal.\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt; Yes, I&#39;ve heard from many energies claiming to be many things and  \n&gt;&gt;&gt; some never having inhabited a body.\n&gt;&gt;&gt;\n&gt;&gt;&gt; Wisteria\n&gt;&gt;&gt; On Aug 17, 2008, at 9:45 PM, Lisby wrote:\n&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; I said that because all of the examples I heard of EVP by the  \n&gt;&gt;&gt;&gt; Fish Group has sounded very human and they have never claimed to  \n&gt;&gt;&gt;&gt; have been other than human that I have heard. I have to base my  \n&gt;&gt;&gt;&gt; conclusions on the EVP files, not speculation, even from the  \n&gt;&gt;&gt;&gt; victims. Do you know of instances where they audibly claimed to  \n&gt;&gt;&gt;&gt; be nonhuman? I may have missed them--I heard a lot of EVPs from  \n&gt;&gt;&gt;&gt; them, but certainly not the sum total. (As I said--I even got  \n&gt;&gt;&gt;&gt; one myself the other day.)\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; I think you&#39;re right that they are definitely mobile, and a  \n&gt;&gt;&gt;&gt; collective.\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; Ann\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt; ____________________________________________________________\n&gt;&gt;&gt; Learn about VA loan programs and benefits. Click now.\n&gt;&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; ____________________________________________________________\n&gt;&gt; Lower your debt by up to 50%. Click here to find out how.\n&gt;&gt;\n&gt;\n&gt; \n\n\nI 's called \"e idence.\" Hea d o i ? All his alk abou he Fish G oup is p edica ed on hings ha happened o o he people. E e played Chinese Telephones? Wi hou he o iginal EVP iles, hen i s all a case o hi d- ou h-eigh -hand es imony, slowly blowing ou o p opo ion and eaching legenda y s a us be o e you can say \"Bob's you uncle.\" I he e ne e was any EVP e idence we'd no e en be calling hem he Fish G oup. They ga e ha name o hemsel es, h ough EVPs. I you don' accep EVP as good--i no he bes --e idence we ha e o pa ano mal communica ion, why a e you he e?Some o us he e ha e ying o app oach his esea ch in a logical and basically scien i ic way o many yea s. I, a leas , will no s a olling in imagina i e specula ion on anyone's whim.AnnOn Aug 18, 2008, a 12:52 PM, black bea hollow w o e:Wha di e ence would a eco ding make? Especially Since in his esea ch whe e we usually can' see who o wha  we' e alking o. Any oice we hea o eco d could be any hing. W On Aug 18, 2008, a 4:32 PM, \" h eadsin yme@juno.com\" Th eadsin yme@Juno.com> w o e:I wonde he same hing mysel ...does anyone ha e any eco dings o hem ha can be lis ened o?Al-- Lisby ne > w o e:I' e hea d o his as well, bu my ques ion was, do we ha e any EVP e idence ha he *Fish G oup* e e claimed o be o he han dead people?AnnOn Aug 18, 2008, a 1:58 AM,  h eadsin yme@juno.com w o e:Wis e ia,I o go bu you may be qui e igh ! The e a e spi i s who ha e ne e been inca na ed in o human o m. They end no o be in ol ed in any way wi h lowe o ms o ib a ion.Edga Cayce spoke o hem. Thei souls we e c ea ed as he momen o C ea ion. They chose no o ha e e e inca na ed. Since hei ib a ion le el is a mo e han a lowly en i y, I highly doub ha hey would in e ac wi h lowe en i ies. They a e on a comple ely di e en le el o exis ence.Al-- black bea hollow gmail.com> w o e:I jus said ha in e e ence o Al's commen s. The e a e a clus e o esea che s who insis on agging eligious my h on esea ch... angels, de ils, hea en, hell, assuming any hing isi ing ou plane is \"s uck\" and needs \"sa ing\" and igno ing o he ene gies assuming e e y hing hey hea is o was a human mo al. Yes, I' e hea d om many ene gies claiming o be many hings and some ne e ha ing inhabi ed a body. Wis e iaOn Aug 17, 2008, a 9:45 PM, Lisby w o e:I said ha because all o he examples I hea d o EVP by he Fish G oup has sounded e y human and hey ha e ne e claimed o ha e been o he han human ha I ha e hea d. I ha e o base my conclusions on he EVP iles, no specula ion, e en om he ic ims. Do you know o ins ances whe e hey audibly claimed o be nonhuman? I may ha e missed hem--I hea d a lo o EVPs om hem, bu ce ainly no he sum o al. (As I said--I e en go one mysel he o he day.)I hink you' e igh ha hey a e de ini ely mobile, and a collec i e.Ann____________________________________________________________ Lea n abou VA loan p og ams and bene i s. Click now.____________________________________________________________ Lowe you deb by up o 50%. Click he e o ind ou how."}