{"id": "11904", "subject": "Re: [EVP-ITC] Ahhh the infamous Fish!", "author": "Zack Widup", "timestamp": "2008-08-18T17:14:49Z", "full_text": "Yeah that&#39;s true.  But it&#39;s sooo cool to go to a place out in the middle \nof nowhere, miles from even simple things like electric lines and radio \ntowers, and get EVP responses which actually give logical answers to your \nquestions. It &quot;could&quot; be anything but the probability is that it is only \ncertain things. It is most likely NOT someone with a radio or other \nelectronic device fooling with you.\n\nZack\n\nOn Mon, 18 Aug 2008, black bear hollow wrote:\n\n&gt; What difference would a recording make? Especially\n&gt; Since in this research where we usually can&#39;t see who or what\n&gt; we&#39;re talking to. Any voice we hear or record could be anything.\n&gt;\n&gt; W\n&gt;\n&gt; On Aug 18, 2008, at 4:32 PM, &quot;threadsintyme@...&quot; \n&gt; &lt;Threadsintyme@...&gt; wrote:\n&gt;\n&gt;&gt; I wonder the same thing myself...does anyone have any recordings of them \n&gt;&gt; that can be listened to?\n&gt;&gt; \n&gt;&gt; Al\n&gt;&gt; \n&gt;&gt; -- Lisby &lt;lisby@...&gt; wrote:\n&gt;&gt; \n&gt;&gt; I&#39;ve heard of this as well, but my question was, do we have any EVP \n&gt;&gt; evidence that the *Fish Group* ever claimed to be other than dead people?\n&gt;&gt; \n&gt;&gt; \n&gt;&gt; Ann\n&gt;&gt; \n&gt;&gt; On Aug 18, 2008, at 1:58 AM, threadsintyme@... wrote:\n&gt;&gt; \n&gt;&gt;&gt; \n&gt;&gt;&gt; Wisteria,\n&gt;&gt;&gt; \n&gt;&gt;&gt; I forgot but you may be quite right! There are spirits who have never been \n&gt;&gt;&gt; incarnated into human form. They tend not to be involved in any way with \n&gt;&gt;&gt; lower forms of vibration.\n&gt;&gt;&gt; \n&gt;&gt;&gt; Edgar Cayce spoke of them. Their souls were created as the moment of \n&gt;&gt;&gt; Creation. They chose not to have ever incarnated. Since their vibration \n&gt;&gt;&gt; level is far more than a lowly entity, I highly doubt that they would \n&gt;&gt;&gt; interact with lower entities. They are on a completely different level of \n&gt;&gt;&gt; existence.\n&gt;&gt;&gt; \n&gt;&gt;&gt; Al\n&gt;&gt;&gt; \n&gt;&gt;&gt; -- black bear hollow &lt;blackbearhollow@...&gt; wrote:\n&gt;&gt;&gt; \n&gt;&gt;&gt; I just said that in reference to Al&#39;s comments. There are a cluster of \n&gt;&gt;&gt; researchers who insist on tagging religious myth on research... angels, \n&gt;&gt;&gt; devils, heaven, hell, assuming anything visiting our plane is &quot;stuck&quot; and \n&gt;&gt;&gt; needs &quot;saving&quot; and ignoring other energies assuming everything they hear \n&gt;&gt;&gt; is or was a human mortal.\n&gt;&gt;&gt; \n&gt;&gt;&gt; \n&gt;&gt;&gt; Yes, I&#39;ve heard from many energies claiming to be many things and some \n&gt;&gt;&gt; never having inhabited a body.\n&gt;&gt;&gt; \n&gt;&gt;&gt; Wisteria\n&gt;&gt;&gt; On Aug 17, 2008, at 9:45 PM, Lisby wrote:\n&gt;&gt;&gt; \n&gt;&gt;&gt;&gt; I said that because all of the examples I heard of EVP by the Fish Group \n&gt;&gt;&gt;&gt; has sounded very human and they have never claimed to have been other \n&gt;&gt;&gt;&gt; than human that I have heard. I have to base my conclusions on the EVP \n&gt;&gt;&gt;&gt; files, not speculation, even from the victims. Do you know of instances \n&gt;&gt;&gt;&gt; where they audibly claimed to be nonhuman? I may have missed them--I \n&gt;&gt;&gt;&gt; heard a lot of EVPs from them, but certainly not the sum total. (As I \n&gt;&gt;&gt;&gt; said--I even got one myself the other day.)\n&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt; I think you&#39;re right that they are definitely mobile, and a collective.\n&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt; Ann\n&gt;&gt;&gt; \n&gt;&gt;&gt; \n&gt;&gt;&gt; \n&gt;&gt;&gt; \n&gt;&gt;&gt; ____________________________________________________________\n&gt;&gt;&gt; Learn about VA loan programs and benefits. Click now.\n&gt;&gt;&gt; \n&gt;&gt; \n&gt;&gt; \n&gt;&gt; \n&gt;&gt; ____________________________________________________________\n&gt;&gt; Lower your debt by up to 50%. Click here to find out how.\n&gt;"}