{"id": "11902", "subject": "Re: [EVP-ITC] Re: A good deed by:  Ahhh the infamous Fish!", "author": "Lisby", "timestamp": "2008-08-18T17:12:48Z", "full_text": "I remember when this was going on, I heard a lot of these EVP on the  \nJeff Rense Show. Sandra had been on the AA-EVP board before that, but  \nhad left. I wish she would put up all the EVPs because some of them  \nwere really, really impressive. The ones she&#39;s got on this site are  \nnot good examples of what she was getting, HMO.\n\nAs for the Fish Group mention--I&#39;m surprised about that, but they  \nwere plaguing people on the list at that time. Since I tend to see  \nthem more as 4Chaners (http://en.wikipedia.org/wiki/4chan) than  \ndemons, it would make a lot of sense that they would get involved  \nwith bringing Scott Peterson down.\n\nAnn\n\n\nOn Aug 18, 2008, at 12:46 PM, Ron Lederer wrote:\n\n&gt;\n&gt; w. I just finished a couple hour review of the web site you sent  \n&gt; for Sandra Belanger at http://www.heliumraven.com/home    Man did  \n&gt; that answer a lot of questions I had about how this technology can  \n&gt; work with mediumship/spiritualism.  Also renewed my hope in working  \n&gt; with evpmaker.  The case history that Sandra recounts on the site  \n&gt; should be a &quot;must read&quot; for anyone serious about evp.itc.  I would  \n&gt; like to understand more about the relationship between evp and  \n&gt; mediumship.  Does a &quot;good&quot; evper need to be a &quot;sensitive&quot; or medium  \n&gt; or does it just give someone with the sensitivity the edge over  \n&gt; someone else?  Even Sandra now says that she had a certain amount  \n&gt; of &quot;sensitivity&quot; before she started using evp technology and that  \n&gt; now she actually &quot;communicates directly&quot; with spirit.  To me that  \n&gt; means she is a medium....no?\n&gt;\n&gt; Also, regarding the Fish Group...I was taken back to read on her  \n&gt; website that The Fish Group was helpful in having her &quot;solve&quot; the  \n&gt; Lacy Peterson case.   Chalk a good deed up to The Fish Group.    \n&gt; Thanks for the web site.  Ron l\n&gt;\n&gt; --- On Mon, 8/18/08, black bear hollow &lt;blackbearhollow@...&gt;  \n&gt; wrote:\n&gt; From: black bear hollow &lt;blackbearhollow@...&gt;\n&gt; Subject: Re: [EVP-ITC] Ahhh the infamous Fish!\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Monday, August 18, 2008, 9:23 AM\n&gt;\n&gt; I&#39;d love to hear about it Zack. Love that stuff.\n&gt;\n&gt; w.\n&gt; On Aug 18, 2008, at 11:23 AM, Zack Widup wrote:\n&gt;\n&gt;&gt; I could go into that quite a bit, having studied quantum  \n&gt;&gt; electrodynamics\n&gt;&gt; extensively. But everything - matter, light, all forms of energy,  \n&gt;&gt; etc.\n&gt;&gt; all break down to ... motion. It just builds into more complicated  \n&gt;&gt; schemes\n&gt;&gt; and becomes light, sound, radio waves, coffee cups and coffee, etc.\n&gt;&gt; :-)\n&gt;&gt;\n&gt;&gt; Zack\n&gt;\n&gt;\n&gt;\n&gt; \n\n\nI emembe when his was going on, I hea d a lo o hese EVP on he Je Rense Show. Sand a had been on he AA-EVP boa d be o e ha , bu had le . I wish she would pu up all he EVPs because some o hem we e eally, eally imp essi e. The ones she's go on his si e a e no good examples o wha she was ge ing, HMO.As o he Fish G oup men ion--I'm su p ised abou ha , bu hey we e plaguing people on he lis a ha ime. Since I end o see hem mo e as 4Chane s (h p://en.wikipedia.o g/wiki/4chan) han demons, i would make a lo o sense ha hey would ge in ol ed wi h b inging Sco Pe e son down.AnnOn Aug 18, 2008, a 12:46 PM, Ron Lede e w o e:w. I jus inished a couple hou e iew o he web si e you sen o Sand a Belange a  h p://www.helium a en.com/home    Man did ha answe a lo o ques ions I had abou how his echnology can wo k wi h mediumship/spi i ualism.  Also enewed my hope in wo king wi h e pmake .  The case his o y ha Sand a ecoun s on he si e should be a \"mus ead\" o anyone se ious abou e p.i c.  I would like o unde s and mo e abou he ela ionship be ween e p and mediumship.  Does a \"good\" e pe need o be a \"sensi i e\" o medium o does i jus gi e someone wi h he sensi i i y he edge o e someone else?  E en Sand a now says ha she had a ce ain amoun o \"sensi i i y\" be o e she s a ed using e p echnology and ha now she ac ually \"communica es di ec ly\" wi h spi i .  To me ha means she is a medium....no? Also, ega ding he Fish G oup...I was aken back o ead on he websi e ha The Fish G oup was help ul in ha ing he \"sol e\" he Lacy Pe e son case.   Chalk a good deed up o The Fish G oup.   Thanks o he web si e.  Ron l--- On Mon, 8/18/08, black bea hollow gmail.com> w o e:F om: black bea hollow gmail.com>Subjec : Re: [EVP-ITC] Ahhh he in amous Fish!To: EVP-ITC@yahoog oups.comDa e: Monday, Augus 18, 2008, 9:23 AMI'd lo e o hea abou i Zack. Lo e ha s u . w.On Aug 18, 2008, a 11:23 AM, Zack Widup w o e:I could go in o ha qui e a bi , ha ing s udied quan um elec odynamics ex ensi ely. Bu e e y hing - ma e , ligh , all o ms o ene gy, e c. all b eak down o ... mo ion. I jus builds in o mo e complica ed schemes and becomes ligh , sound, adio wa es, co ee cups and co ee, e c.:-)Zack"}