{"id": "11916", "subject": "Re: [EVP-ITC] Re: A good deed by:  Ahhh the infamous Fish!", "author": "Lisby", "timestamp": "2008-08-18T18:22:11Z", "full_text": "Don&#39;t you think it&#39;s more likely that they&#39;re both? I always try to  \nfollow the crime investigation maxim that the simplest explanation is  \nthe most likely. Why should there be two groups? Why not just one  \nfull of anarchists, loyal neither to black or white? Most everything  \nin this world falls into the area of gray. I think it&#39;s therefore  \nlikely that this is true of the next.\n\nAnn\n\nOn Aug 18, 2008, at 2:06 PM, black bear hollow wrote:\n\n&gt; It&#39;s because of her work and some of Frank S.&#39;s stuff that I have  \n&gt; to wonder if there are 2 &quot;Fish Groups&quot;. One good and helpful and  \n&gt; the other not.\n&gt;\n&gt;\n&gt; Yeah, it&#39;s a good site. I think we&#39;re all mediums to a lesser and  \n&gt; greater extent. Some seem to have a natural knack at being  \n&gt; sensitive and some don&#39;t - some are in between. I tend to feel it&#39;s  \n&gt; a talent like being a natural musician, singer, or artist. Some  \n&gt; have it naturally, some don&#39;t, some can learn by being taught, but  \n&gt; aren&#39;t ever as good as the naturally gifted.\n&gt;\n&gt; w.\n&gt; On Aug 18, 2008, at 12:46 PM, Ron Lederer wrote:\n&gt;\n&gt;&gt; w. I just finished a couple hour review of the web site you sent  \n&gt;&gt; for Sandra Belanger at http://www.heliumraven.com/home    Man did  \n&gt;&gt; that answer a lot of questions I had about how this technology can  \n&gt;&gt; work with mediumship/spiritualism.  Also renewed my hope in  \n&gt;&gt; working with evpmaker.  The case history that Sandra recounts on  \n&gt;&gt; the site should be a &quot;must read&quot; for anyone serious about  \n&gt;&gt; evp.itc.  I would like to understand more about the relationship  \n&gt;&gt; between evp and mediumship.  Does a &quot;good&quot; evper need to be a  \n&gt;&gt; &quot;sensitive&quot; or medium or does it just give someone with the  \n&gt;&gt; sensitivity the edge over someone else?  Even Sandra now says that  \n&gt;&gt; she had a certain amount of &quot;sensitivity&quot; before she started using  \n&gt;&gt; evp technology and that now she actually &quot;communicates directly&quot;  \n&gt;&gt; with spirit.  To me that means she is a medium....no?\n&gt;&gt;\n&gt;&gt; Also, regarding the Fish Group...I was taken back to read on her  \n&gt;&gt; website that The Fish Group was helpful in having her &quot;solve&quot; the  \n&gt;&gt; Lacy Peterson case.   Chalk a good deed up to The Fish Group.    \n&gt;&gt; Thanks for the web site.  Ron l\n&gt;\n&gt;\n&gt; \n\n\nDon' you hink i 's mo e likely ha hey' e bo h? I always y o ollow he c ime in es iga ion maxim ha he simples explana ion is he mos likely. Why should he e be wo g oups? Why no jus one ull o ana chis s, loyal nei he o black o whi e? Mos e e y hing in his wo ld alls in o he a ea o g ay. I hink i 's he e o e likely ha his is ue o he nex .AnnOn Aug 18, 2008, a 2:06 PM, black bea hollow w o e:I 's because o he wo k and some o F ank S.'s s u ha I ha e o wonde i he e a e 2 \"Fish G oups\". One good and help ul and he o he no . Yeah, i 's a good si e. I hink we' e all mediums o a lesse and g ea e ex en . Some seem o ha e a na u al knack a being sensi i e and some don' - some a e in be ween. I end o eel i 's a alen like being a na u al musician, singe , o a is . Some ha e i na u ally, some don' , some can lea n by being augh , bu a en' e e as good as he na u ally gi ed. w. On Aug 18, 2008, a 12:46 PM, Ron Lede e w o e:w. I jus inished a couple hou e iew o he web si e you sen o Sand a Belange a  h p://www.helium a en.com/home    Man did ha answe a lo o ques ions I had abou how his echnology can wo k wi h mediumship/spi i ualism.  Also enewed my hope in wo king wi h e pmake .  The case his o y ha Sand a ecoun s on he si e should be a \"mus ead\" o anyone se ious abou e p.i c.  I would like o unde s and mo e abou he ela ionship be ween e p and mediumship.  Does a \"good\" e pe need o be a \"sensi i e\" o medium o does i jus gi e someone wi h he sensi i i y he edge o e someone else?  E en Sand a now says ha she had a ce ain amoun o \"sensi i i y\" be o e she s a ed using e p echnology and ha now she ac ually \"communica es di ec ly\" wi h spi i .  To me ha means she is a medium....no? Also, ega ding he Fish G oup...I was aken back o ead on he websi e ha The Fish G oup was help ul in ha ing he \"sol e\" he Lacy Pe e son case.   Chalk a good deed up o The Fish G oup.   Thanks o he web si e.  Ron l"}