{"id": "11914", "subject": "Re: [EVP-ITC] Ahhh the infamous Fish!", "author": "black bear hollow", "timestamp": "2008-08-18T18:10:52Z", "full_text": "Is this directed at Al or Wisteria (me)?\n\nw.\n\n\nOn Aug 18, 2008, at 1:23 PM, Lisby wrote:\n\n&gt; It&#39;s called &quot;evidence.&quot; Heard of it? All this talk about the Fish  \n&gt; Group is predicated on things that happened to other people. Ever  \n&gt; played Chinese Telephones? Without the original EVP files, then its  \n&gt; all a case of third-fourth-eight-hand testimony, slowly blowing out  \n&gt; of proportion and reaching legendary status before you can say  \n&gt; &quot;Bob&#39;s your uncle.&quot; If there never was any EVP evidence we&#39;d not  \n&gt; even be calling them the Fish Group. They gave that name to  \n&gt; themselves, through EVPs. If you don&#39;t accept EVP as good--if not  \n&gt; the best--evidence we have of paranormal communication, why are you  \n&gt; here?\n&gt;\n&gt;\n&gt; Some of us here have trying to approach this research in a logical  \n&gt; and basically scientific way for many years. I, a least, will not  \n&gt; start rolling in imaginative speculation on anyone&#39;s whim.\n&gt;\n&gt; Ann\n\n\nIs his di ec ed a Al o Wis e ia (me)?w.On Aug 18, 2008, a 1:23 PM, Lisby w o e:I 's called \"e idence.\" Hea d o i ? All his alk abou he Fish G oup is p edica ed on hings ha happened o o he people. E e played Chinese Telephones? Wi hou he o iginal EVP iles, hen i s all a case o hi d- ou h-eigh -hand es imony, slowly blowing ou o p opo ion and eaching legenda y s a us be o e you can say \"Bob's you uncle.\" I he e ne e was any EVP e idence we'd no e en be calling hem he Fish G oup. They ga e ha name o hemsel es, h ough EVPs. I you don' accep EVP as good--i no he bes --e idence we ha e o pa ano mal communica ion, why a e you he e?Some o us he e ha e ying o app oach his esea ch in a logical and basically scien i ic way o many yea s. I, a leas , will no s a olling in imagina i e specula ion on anyone's whim.Ann"}