{"id": "11919", "subject": "Re: [EVP-ITC] Ahhh the infamous Fish!", "author": "Lisby", "timestamp": "2008-08-18T18:30:04Z", "full_text": "I was responding to the comment that EVP is basically valueless as  \nevidence.\n\n\n &gt;&gt;What difference would a recording make? Especially\nSince in this research where we usually can&#39;t see who or what\nwe&#39;re talking to. Any voice we hear or record could be anything.\n\nW\n\nLooks like that was you. First up, I apologize for being too snippy,  \nbecause I was. But I still have to stand by my point: if EVP isn&#39;t  \ngood evidence in the vase of the Fish Group then all you have a  \nwitness testimony--also subject to being distorted over time and  \nthrough channels--like playing telephone as a kid.\n\nI think what is happening here is that I am trying to debate only  \nabout the Fish Group case (Are they dead people? Are they demons?),  \nbut its getting generalized.\n\nI meant no disrespect, W. Chock it up to too much caffeine, bitch  \nslap me, and hopefully we&#39;re good.\n\nAnn\n\n\nOn Aug 18, 2008, at 2:10 PM, black bear hollow wrote:\n\n&gt; Is this directed at Al or Wisteria (me)?\n&gt;\n&gt;\n&gt; w.\n&gt;\n&gt;\n&gt; On Aug 18, 2008, at 1:23 PM, Lisby wrote:\n&gt;\n&gt;&gt; It&#39;s called &quot;evidence.&quot; Heard of it? All this talk about the Fish  \n&gt;&gt; Group is predicated on things that happened to other people. Ever  \n&gt;&gt; played Chinese Telephones? Without the original EVP files, then  \n&gt;&gt; its all a case of third-fourth-eight-hand testimony, slowly  \n&gt;&gt; blowing out of proportion and reaching legendary status before you  \n&gt;&gt; can say &quot;Bob&#39;s your uncle.&quot; If there never was any EVP evidence  \n&gt;&gt; we&#39;d not even be calling them the Fish Group. They gave that name  \n&gt;&gt; to themselves, through EVPs. If you don&#39;t accept EVP as good--if  \n&gt;&gt; not the best--evidence we have of paranormal communication, why  \n&gt;&gt; are you here?\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; Some of us here have trying to approach this research in a logical  \n&gt;&gt; and basically scientific way for many years. I, a least, will not  \n&gt;&gt; start rolling in imaginative speculation on anyone&#39;s whim.\n&gt;&gt;\n&gt;&gt; Ann\n&gt;\n&gt;\n&gt; \n\n\nI was esponding o he commen ha EVP is basically alueless as e idence.>>Wha di e ence would a eco ding make? Especially Since in his esea ch whe e we usually can' see who o wha  we' e alking o. Any oice we hea o eco d could be any hing. W Looks like ha was you. Fi s up, I apologize o being oo snippy, because I was. Bu I s ill ha e o s and by my poin : i EVP isn' good e idence in he ase o he Fish G oup hen all you ha e a wi ness es imony--also subjec o being dis o ed o e ime and h ough channels--like playing elephone as a kid.I hink wha is happening he e is ha I am ying o deba e only abou he Fish G oup case (A e hey dead people? A e hey demons?), bu i s ge ing gene alized.I mean no dis espec , W. Chock i up o oo much ca eine, bi ch slap me, and hope ully we' e good.AnnOn Aug 18, 2008, a 2:10 PM, black bea hollow w o e:Is his di ec ed a Al o Wis e ia (me)?w.On Aug 18, 2008, a 1:23 PM, Lisby w o e:I 's called \"e idence.\" Hea d o i ? All his alk abou he Fish G oup is p edica ed on hings ha happened o o he people. E e played Chinese Telephones? Wi hou he o iginal EVP iles, hen i s all a case o hi d- ou h-eigh -hand es imony, slowly blowing ou o p opo ion and eaching legenda y s a us be o e you can say \"Bob's you uncle.\" I he e ne e was any EVP e idence we'd no e en be calling hem he Fish G oup. They ga e ha name o hemsel es, h ough EVPs. I you don' accep EVP as good--i no he bes --e idence we ha e o pa ano mal communica ion, why a e you he e?Some o us he e ha e ying o app oach his esea ch in a logical and basically scien i ic way o many yea s. I, a leas , will no s a olling in imagina i e specula ion on anyone's whim.Ann"}