{"id": "11924", "subject": "Re: [EVP-ITC] Ahhh the infamous Fish!", "author": "black bear hollow", "timestamp": "2008-08-18T18:40:14Z", "full_text": "That explains a lot. I&#39;m of the opinion that to truly &quot;judge&quot; this  \nresearch fairly, you have to actively record.\nThe experience is what helps determine what is what and even listening  \nto evp/itc is a learned talent and takes practice. Especially with  \nharder to hear samples. Spirit voices aren&#39;t always human, and thus,  \ndon&#39;t alway sound like humans.\n\nYou just answered many questions and made things very clear - thank you.\n\nPerhaps some day you&#39;ll join us in recording so you&#39;ll understand what  \nwe&#39;re talking about. Some things must be\nexperienced to be understood. I can describe to you riding a wild  \nhorse, but unless you&#39;ve done it, you&#39;ll remain clueless to my  \nexperience. You&#39;d probably understand a lot more if you simply make  \nthe effort to record.\n\nBelieve you me, if you sit quietly with nothing but a digital recorder  \nand you record a voice out of nowhere that clearly says your name and  \nmore, I doubt you&#39;ll have to worry about matrixing or stray radio  \nsignals.\n\nw.\nOn Aug 18, 2008, at 2:25 PM, threadsintyme@... wrote:\n\n&gt; Not as of yet...there is a lot more research that needs to be done  \n&gt; in this area.\n&gt;\n&gt; One friend believes that when you record EVP&#39;s you are opening  \n&gt; yourself to such things as what we have been discussing here. I am  \n&gt; not certain that he is right. I am not certain that he is wrong,  \n&gt; either. :)\n&gt;\n&gt; I think though that if we did get into EVP&#39;s, then we would do a lot  \n&gt; of experimentation using foreign language radio stations. Since we  \n&gt; live fairly close to Canada, we can occasionally pick up a French  \n&gt; broadcast. I think that it would be beneficial to record using a  \n&gt; foreign language broadcast. Least that would partially eliminate the  \n&gt; problem with matrixing.\n&gt;\n&gt; You see, w, there are a lot of questions that keep popping up in my  \n&gt; head. Such as, if the spirit (entity) uses the words of a radio  \n&gt; broadcast, why do you need to use an antenna? This is just one  \n&gt; question, I am sure that there are tons more.\n&gt;\n&gt; Al\n&gt;\n\n\nTha explains a lo . I'm o he opinion ha o uly \"judge\" his esea ch ai ly, you ha e o ac i ely eco d. The expe ience is wha helps de e mine wha is wha and e en lis ening o e p/i c is a lea ned alen and akes p ac ice. Especially wi h ha de o hea samples. Spi i oices a en' always human, and hus, don' alway sound like humans. You jus answe ed many ques ions and made hings e y clea - hank you.Pe haps some day you'll join us in eco ding so you'll unde s and wha we' e alking abou . Some hings mus be expe ienced o be unde s ood. I can desc ibe o you iding a wild ho se, bu unless you' e done i , you'll emain clueless o my expe ience. You'd p obably unde s and a lo mo e i you simply make he e o o eco d.Belie e you me, i you si quie ly wi h no hing bu a digi al eco de and you eco d a oice ou o nowhe e ha clea ly says you name and mo e, I doub you'll ha e o wo y abou ma ixing o s ay adio signals.w.On Aug 18, 2008, a 2:25 PM, h eadsin yme@... w o e:No as o ye ... he e is a lo mo e esea ch ha needs o be done in his a ea.One iend belie es ha when you eco d EVP's you a e opening you sel o such hings as wha we ha e been discussing he e. I am no ce ain ha he is igh . I am no ce ain ha he is w ong, ei he . :)I hink hough ha i we did ge in o EVP's, hen we would do a lo o expe imen a ion using o eign language adio s a ions. Since we li e ai ly close o Canada, we can occasionally pick up a F ench b oadcas . I hink ha i would be bene icial o eco d using a o eign language b oadcas . Leas ha would pa ially elimina e he p oblem wi h ma ixing.  You see, w, he e a e a lo o ques ions ha keep popping up in my head. Such as, i he spi i (en i y) uses he wo ds o a adio b oadcas , why do you need o use an an enna? This is jus one ques ion, I am su e ha he e a e ons mo e.Al"}