{"id": "11929", "subject": "Re: [EVP-ITC] Ahhh the infamous Fish!", "author": "Zack Widup", "timestamp": "2008-08-18T18:45:24Z", "full_text": "&quot;Matrixing&quot; occurs when a signal is right in the noise level (or below \nit). When the signal to noise ratio is greater, it&#39;s no longer matrixing \nand most people can hear/see the same thing without any hints.\n\nSometimes processing/filtering of signals buried in the noise (done \nsimply with various programs on pictures, audio recordings, RF etc. \nwithout significantly altering the content) will reveal there is nothing \nor something there.\n\nZack\n\nOn Mon, 18 Aug 2008, black bear hollow wrote:\n\n&gt; If 30 people listen to your EVP recording and they all (100%) hear exactly \n&gt; what you do, are they wrong? Matrixing perhaps? Are they coincidentally all \n&gt; &quot;interpreting&quot; what they hear? Does that make the recording real? Just a \n&gt; coincidence?\n&gt;\n&gt; If we all sit in a theater and watch the same movie, we might like it or not, \n&gt; form 100&#39;s of different opinions about the movie, but the movie is still \n&gt; real.\n&gt;\n&gt; No matter what we do as researchers, there will always be someone to attempt \n&gt; to say what we do isn&#39;t real.\n&gt;\n&gt; I&#39;ve seen people experience paranormal activity, objects move and 5 other \n&gt; people besides them witness the same thing, the exact same thing, only later \n&gt; to hear them later make excuses for what they saw. So no matter what proof we \n&gt; present, there&#39;s always someone around to poo poo it - usually a person who \n&gt; has never actually researched EVP/ITC themselves ever.\n&gt;\n&gt; w.\n&gt; On Aug 18, 2008, at 1:56 PM, threadsintyme@... wrote:\n&gt;\n&gt;&gt; BUT...this does not always rule out that the person making the recording is \n&gt;&gt; &quot;interpreting&quot; what they hear. IE, making sense out of nothing. Such as \n&gt;&gt; Matrxing and photography, etc.\n&gt;&gt; \n&gt;&gt; Al\n&gt;&gt; \n&gt;"}