{"id": "11923", "subject": "Re: [EVP-ITC] Ahhh the infamous Fish!", "author": "Lisby", "timestamp": "2008-08-18T18:39:29Z", "full_text": "I see what you&#39;re saying below. I may be waaay too caffinated today  \nto be allowed near a keyboard. Your last paragraph is very and  \nexplains your position nicely. Might have been nice if I had read it  \ncorrectly the first time. :(\n\nAnn\n\nOn Aug 18, 2008, at 2:23 PM, black bear hollow wrote:\n\n&gt; If 30 people listen to your EVP recording and they all (100%) hear  \n&gt; exactly what you do, are they wrong? Matrixing perhaps? Are they  \n&gt; coincidentally all &quot;interpreting&quot; what they hear? Does that make  \n&gt; the recording real? Just a coincidence?\n&gt;\n&gt;\n&gt; If we all sit in a theater and watch the same movie, we might like  \n&gt; it or not, form 100&#39;s of different opinions about the movie, but  \n&gt; the movie is still real.\n&gt;\n&gt; No matter what we do as researchers, there will always be someone  \n&gt; to attempt to say what we do isn&#39;t real.\n&gt;\n&gt; I&#39;ve seen people experience paranormal activity, objects move and 5  \n&gt; other people besides them witness the same thing, the exact same  \n&gt; thing, only later to hear them later make excuses for what they  \n&gt; saw. So no matter what proof we present, there&#39;s always someone  \n&gt; around to poo poo it - usually a person who has never actually  \n&gt; researched EVP/ITC themselves ever.\n&gt;\n&gt; w.\n&gt; On Aug 18, 2008, at 1:56 PM, threadsintyme@... wrote:\n&gt;\n&gt;&gt; BUT...this does not always rule out that the person making the  \n&gt;&gt; recording is &quot;interpreting&quot; what they hear. IE, making sense out  \n&gt;&gt; of nothing. Such as Matrxing and photography, etc.\n&gt;&gt;\n&gt;&gt; Al\n&gt;&gt;\n&gt;\n&gt;\n&gt; \n\n\nI see wha you' e saying below. I may be waaay oo ca ina ed oday o be allowed nea a keyboa d. You las pa ag aph is e y and explains you posi ion nicely. Migh ha e been nice i I had ead i co ec ly he i s ime. :(AnnOn Aug 18, 2008, a 2:23 PM, black bea hollow w o e:I 30 people lis en o you EVP eco ding and hey all (100%) hea exac ly wha you do, a e hey w ong? Ma ixing pe haps? A e hey coinciden ally all \"in e p e ing\" wha hey hea ? Does ha make he eco ding eal? Jus a coincidence?I we all si in a hea e and wa ch he same mo ie, we migh like i o no , o m 100's o di e en opinions abou he mo ie, bu he mo ie is s ill eal.No ma e wha we do as esea che s, he e will always be someone o a emp o say wha we do isn' eal. I' e seen people expe ience pa ano mal ac i i y, objec s mo e and 5 o he people besides hem wi ness he same hing, he exac same hing, only la e o hea hem la e make excuses o wha hey saw. So no ma e wha p oo we p esen , he e's always someone a ound o poo poo i - usually a pe son who has ne e ac ually esea ched EVP/ITC hemsel es e e . w.On Aug 18, 2008, a 1:56 PM,  h eadsin yme@juno.com w o e:BUT... his does no always ule ou ha he pe son making he eco ding is \"in e p e ing\" wha hey hea . IE, making sense ou o no hing. Such as Ma xing and pho og aphy, e c.Al"}