{"id": "11939", "subject": "Re: [EVP-ITC] Ahhh the infamous Fish!", "author": "black bear hollow", "timestamp": "2008-08-18T19:32:45Z", "full_text": "Fascinating Zack. We&#39;re just waves, eh? Waves of particles or streams?  \nWhat are the particles? Do we really exist? lol!\n\nw.\nOn Aug 18, 2008, at 12:49 PM, Zack Widup wrote:\n\n&gt; Yes it is. To greatly simplify things, motions within motions in and  \n&gt; of\n&gt; space (or spacetime, if you will) cohese to form larger patterns we  \n&gt; call\n&gt; energy. Energy coheses and condenses to form denser patterns we call\n&gt; matter or mass.\n&gt;\n&gt; Condensed space becomes energy. Dispersed matter becomes energy.  \n&gt; There are\n&gt; many ways of accomplishing this.\n&gt;\n&gt; All that article is describing is the patterns. It doesn&#39;t mention the\n&gt; content or structure of the patterns.\n&gt;\n&gt; Also, the last sentence of the article is not completely true. I&#39;m  \n&gt; sure\n&gt; Frank and a few others around who are radio amateurs or are familiar  \n&gt; with\n&gt; the phenomena of propagation know about things like sporadic-E  \n&gt; clouds and\n&gt; tropospheric ducting which enable signals in the FM spectrum (88 to  \n&gt; 108\n&gt; MHz) and even higher frequencies to propagate long distances. I made a\n&gt; microwave radio contact over a 470 mile path on the frequency of 10368\n&gt; MHz (microwave) with 2 watts and a small (20-inch) dish antenna a few\n&gt; weeks ago. Something called &quot;knife-edge diffraction&quot; is also fun to  \n&gt; play\n&gt; with, where the radio signals can be made to diffract over the tops of\n&gt; buildings and mountains for long-distance contacts. We&#39;ve had lots  \n&gt; of fun\n&gt; with this over the tops of Chicago skyscrapers in the past, too.\n&gt;\n&gt; Zack\n\n\nFascina ing Zack. We' e jus wa es, eh? Wa es o pa icles o s eams? Wha a e he pa icles? Do we eally exis ? lol!w.On Aug 18, 2008, a 12:49 PM, Zack Widup w o e:Yes i is. To g ea ly simpli y hings, mo ions wi hin mo ions in and o  space (o space ime, i you will) cohese o o m la ge pa e ns we call ene gy. Ene gy coheses and condenses o o m dense pa e ns we call ma e o mass.Condensed space becomes ene gy. Dispe sed ma e becomes ene gy. The e a e many ways o accomplishing his.All ha a icle is desc ibing is he pa e ns. I doesn' men ion he con en o s uc u e o he pa e ns.Also, he las sen ence o he a icle is no comple ely ue. I'm su e F ank and a ew o he s a ound who a e adio ama eu s o a e amilia wi h  he phenomena o p opaga ion know abou hings like spo adic-E clouds and  oposphe ic duc ing which enable signals in he FM spec um (88 o 108 MHz) and e en highe equencies o p opaga e long dis ances. I made a mic owa e adio con ac o e a 470 mile pa h on he equency o 10368 MHz (mic owa e) wi h 2 wa s and a small (20-inch) dish an enna a ew weeks ago. Some hing called \"kni e-edge di ac ion\" is also un o play wi h, whe e he adio signals can be made o di ac o e he ops o  buildings and moun ains o long-dis ance con ac s. We' e had lo s o un wi h his o e he ops o Chicago skysc ape s in he pas , oo.Zack"}