{"id": "11949", "subject": "Re: [EVP-ITC] Spiritualism", "author": "Ron Lederer", "timestamp": "2008-08-18T21:23:34Z", "full_text": "--0-810898818-1219094614=:27692\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nw.=A0 I&#39;m glad you came out with the subject as I have only recently begun =\r\nsearching whatever I could find on the subject of Spiritualist Churches etc=\r\n.=A0 Looking for something in Mexico near or in the Yucatan.=A0 If=A0you se=\r\nek=A0historic sites to visit, come to Campeche.=A0 \n=A0\nRegarding the mix o=\r\nf EVP ITC tech and spiritualism=A0beliefs, I must say=A0again that I was ve=\r\nry impressed when I read=A0ALL the information on the website=A0you provide=\r\n for Sandra Belanger.=A0=A0Her case history of the Peterson case was a wond=\r\nerful model of working with=A0her evp=A0skills and mediumship=A0sensitiviti=\r\nes.=A0 \n=A0\nAs for me?=A0 I&#39;m still taking piano lessons and can barely put=\r\n down=A0the rhythm.=A0 But I am very encouraged (again) by what I am learni=\r\nng from you and many=A0in this and other evp groups.=A0=A0=A0I plan to keep=\r\n working with evpmaker and the Ovilus.=A0 ron\n\n--- On Mon, 8/18/08, black b=\r\near hollow &lt;blackbearhollow@...&gt; wrote:\n\nFrom: black bear hollow &lt;bla=\r\nckbearhollow@...&gt;\nSubject: [EVP-ITC] Spiritualism\nTo: EVP-ITC@yahoogr=\r\noups.com\nDate: Monday, August 18, 2008, 1:27 PM\n\n\n\n\n\n\nThe topic of Spiritua=\r\nlism came up, and I think it&#39;s an important \ntopic. I&#39;m a Spiritualist. As =\r\na matter of fact, I will be in Lily \nDale, NY (The Village of Spirits) at t=\r\nhe end of Sept. for a workshop \non Mediumship. Anyone want to join me? Come=\r\n on Misty! Wouldn&#39;t we have \na blast? What a place to record.\n\nAnyway, I me=\r\nntion Spiritualism as it&#39;s practice has helped me in my \nresearch and due t=\r\no the non-dogmatic structure, leaves my mind open to \nponder without settin=\r\ng boundaries or labels on spirit. Spiritualism \noverseas is fabulous. Espec=\r\nially in the UK & Ireland. The talk of such \nthings is much more accepted a=\r\nnd how I love that. No silly \nsuperstitious tags and spirit is greatly resp=\r\nected and paid attention \nto.\n\nMy dealings with Findhorn (in Scotland) have=\r\n helped immensely in my \nunderstanding of the Elemental and Devic energies =\r\nI&#39;ve often been told \nI&#39;m recording. Am I positive I&#39;m recording these cert=\r\nain energies \ncalled Devas, Faeries, and Elementals? Nope. That&#39;s just what=\r\n they \ntell me. I&#39;m told all sorts of things and always take them in stride=\r\n.\n\nDo I combine my Spiritualism with my EVP/ITC research? Nope. Not \nalways=\r\n, but sometimes. I like solid evidence that can be analyzed and \nscientific=\r\n evidence. I like to be able to record something I can hand \nover on a bran=\r\nd new audio tape and have it analyzed or ask what the \nchances are that str=\r\nay radio signals are calling out my name and \nanswering my questions in rea=\r\nl time. Or simply answer them with no \nradio at all - just a faucet trickli=\r\nng or no sound whatsoever.\n\nWhat about others here? Do you combine your bel=\r\niefs with your \nrecording or stay completely scientific?\n\nWisteria\n \n\n\n\n\n\n\n=\r\n\n\n\n\n\n\n\n\n      \r\n--0-810898818-1219094614=:27692\r\nContent-Type: text/html; charset=us-ascii\r\n\r\n&lt;table cellspacing=&quot;0&quot; cellpadding=&quot;0&quot; border=&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=&quot;top&quot; style=&quot;font: inherit;&quot;&gt;&lt;DIV&gt;w.&nbsp; I&#39;m glad you came out with the subject as I have only recently begun searching whatever I could find on the subject of Spiritualist Churches etc.&nbsp; Looking for something in Mexico near or in the Yucatan.&nbsp; If&nbsp;you seek&nbsp;historic sites to visit, come to Campeche.&nbsp; &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Regarding the mix of EVP ITC tech and spiritualism&nbsp;beliefs, I must say&nbsp;again that I was very impressed when I read&nbsp;ALL the information on the website&nbsp;you provide for Sandra Belanger.&nbsp;&nbsp;Her case history of the Peterson case was a wonderful model of working with&nbsp;her evp&nbsp;skills and mediumship&nbsp;sensitivities.&nbsp; &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;As for me?&nbsp; I&#39;m still taking piano lessons and can barely put down&nbsp;the rhythm.&nbsp; But I am very encouraged (again) by what I am learning from you and many&nbsp;in this and other evp groups.&nbsp;&nbsp;&nbsp;I plan to keep working with evpmaker and the Ovilus.&nbsp; ron&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Mon, 8/18/08, black bear hollow &lt;I&gt;&lt;blackbearhollow@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;&lt;/DIV&gt;\n&lt;BLOCKQUOTE style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: rgb(16,16,255) 2px solid&quot;&gt;From: black bear hollow &lt;blackbearhollow@...&gt;&lt;BR&gt;Subject: [&lt;SPAN&gt;EVP&lt;/SPAN&gt;-ITC] Spiritualism&lt;BR&gt;To: EVP-ITC@yahoogroups.com&lt;BR&gt;Date: Monday, August 18, 2008, 1:27 PM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=yiv111388598&gt;\n&lt;DIV id=ygrp-text&gt;\n&lt;DIV&gt;The topic of Spiritualism came up, and I think it&#39;s an important &lt;BR&gt;topic. I&#39;m a Spiritualist. As a matter of fact, I will be in Lily &lt;BR&gt;Dale, NY (The Village of Spirits) at the end of Sept. for a workshop &lt;BR&gt;on Mediumship. Anyone want to join me? Come on Misty! Wouldn&#39;t we have &lt;BR&gt;a blast? What a place to record.&lt;BR&gt;&lt;BR&gt;Anyway, I mention Spiritualism as it&#39;s practice has helped me in my &lt;BR&gt;research and due to the non-dogmatic structure, leaves my mind open to &lt;BR&gt;ponder without setting boundaries or labels on spirit. Spiritualism &lt;BR&gt;overseas is fabulous. Especially in the UK &amp; Ireland. The talk of such &lt;BR&gt;things is much more accepted and how I love that. No silly &lt;BR&gt;superstitious tags and spirit is greatly respected and paid attention &lt;BR&gt;to.&lt;BR&gt;&lt;BR&gt;My dealings with Findhorn (in Scotland) have helped immensely in my &lt;BR&gt;understanding of the Elemental and Devic energies I&#39;ve often been told &lt;BR&gt;I&#39;m recording. Am I positive I&#39;m recording\n these certain energies &lt;BR&gt;called Devas, Faeries, and Elementals? Nope. That&#39;s just what they &lt;BR&gt;tell me. I&#39;m told all sorts of things and always take them in stride.&lt;BR&gt;&lt;BR&gt;Do I combine my Spiritualism with my EVP/ITC research? Nope. Not &lt;BR&gt;always, but sometimes. I like solid evidence that can be analyzed and &lt;BR&gt;scientific evidence. I like to be able to record something I can hand &lt;BR&gt;over on a brand new audio tape and have it analyzed or ask what the &lt;BR&gt;chances are that stray radio signals are calling out my name and &lt;BR&gt;answering my questions in real time. Or simply answer them with no &lt;BR&gt;radio at all - just a faucet trickling or no sound whatsoever.&lt;BR&gt;&lt;BR&gt;What about others here? Do you combine your beliefs with your &lt;BR&gt;recording or stay completely scientific?&lt;BR&gt;&lt;BR&gt;Wisteria&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n      \r\n--0-810898818-1219094614=:27692--"}