{"id": "1195", "subject": "Re: http://amasci.com/freenrg/fogal2.txt", "author": "kenneth b thomas", "timestamp": "2007-04-21T18:41:30Z", "full_text": "--- In EVP-ITC@yahoogroups.com, &quot;Frank Sumption&quot; &lt;franks-boxes@...&gt; \nwrote:\n&gt;\n&gt;  Well, I use mostly surface mount tantalums, but I prefer voltage \n&gt; ratingsI. of 20 volts or more when using them in 12 volt circuits. \n&gt; understand the tantalums are kinda sensitive to over voltages. I did \n&gt; use SMT 2N3904&#39;s in the mini board sysytems, made with almost all SMT \n&gt; components, and those were the most reliable boards so far----Gave \nthem \n&gt; all away, DOH! I even hand soldered all the parts using a jig I made \nto \n&gt; hold the parts in place.\n&gt; \n&gt; Frank\n\nfrank you are right-on about the voltage.  any component used for spook \ncome should have at least double the normal voltage rating; otherwise \neverything performs great first time out then quickly and steadily \ndegrades.\n\noddly enough, the fogal transistor was partly a result of my comments to \na mutual friend of myself and fogal in 1985\n\ni had filed down 2n904 and other transistors and oxidized the exposed \nsilicon with hydrogen peroxide, called it surface barrier-superior high \nvoltage high freq performance, behaved like it had a built-in emitter \nbypass of large C value.\n\nthe tantalum thing is legit in quieting noise and may relate to a pseudo \nform of &quot;antigravity&quot; where even living things can be levitated by \nlongitudinal pressure waves emanating from capacitabce made of material \nwith nuclei that will align in a prescribed way.  this is not the frog \nlevitating over the superconductor ---thats an unrelated phenom,.\n\ntantalum and thulium and bismuth are three candidate substances for \nvogel capacitor. so far the only dielectric that will work is oversize \nand over thick mica plates.  some metal oxide will probly be the answer\n\nthink of a room temperature, near-superconductor and optical sensor.  \nits along those lines.\n\nthe wavelength of the acoustic/electric wave has merely to match the \nlong axis of the living thing (like ,say 5 to 6 feet for humans) to \nlevitate it.  the chinese are amusing each other by buzzing small \nanimals around right now\n&gt;"}