{"id": "11952", "subject": "Re: [EVP-ITC] Spiritualism", "author": "black bear hollow", "timestamp": "2008-08-19T01:36:49Z", "full_text": "Sure. The best I can do is describe my experience, and that would be  \nthat since I was very very small, I always sensed that any living  \nthing in the plant & mineral kingdom had an energy to it. My mother  \ndivorced my father when I was a baby and remarried a European. His  \nmother was FABULOUS and often talked of spirits, talking to her  \n&quot;deceased&quot; mother and other relatives in her dreams, balls of light  \nshe&#39;d often see (orbs I assume) and I loved it. I love cultures like  \nthe Irish, and all Celts, Cornish, and Welsh who include the spirits  \nin their daily lives. I&#39;ve always had a real passion for all things  \nfaerie and of nature and found Findhorn at a very young age. My first  \nof 2 NDE&#39;s was at age 5 and with that experience bloomed an intense  \ninterest in all spirits, not just those that had been in human form.\n\nIf you enjoy reading about Cayce, you&#39;d love books by Dorthy MaClean  \n&quot;To Hear the Angels Sing&quot; and Eileen Caddy&#39;s books. You can find out  \nmore about them at www.findhorn.org In my early 20&#39;s I was big into  \nCaddy&#39;s & MaClean&#39;s work and reading about Theosophy. I loved the  \nworks of Rudolph Steiner who was a visionary and founded Waldorf  \nEducation & Anthroposophy. You&#39;d probably love reading his stuff too.  \nHe delves deep into the angelic, elemental, and devic kingdoms. Really  \nfascinating.\n\nI&#39;m so grateful for the chance to experience other cultures other than  \nthe US as they are much less &quot;puritanical&quot; and brainwashed by  \norganized religions. I don&#39;t mean to disrespect anyone by this  \nstatement, but people in the UK and other countries think we&#39;re quite  \ndaft when it comes to thinking for ourselves, and forming our own  \nopinions instead of being sheep to organized religions. I have to  \nagree. Which is why I&#39;m glad Spiritualism is growing in the US. Not  \nfast enough though!\n\nI continued my personal study of nature spirits or elementals over the  \nyears and to my amazement, one of my first recordings was of a being  \nthat said she was a faery. I do have a huge sense of humor, and though  \nI was delighted, I just wasn&#39;t sure I bought what she was telling me.  \nlol! I think she said she was a &quot;house faery&quot; and she said she loved  \nwhere she lived, etc... Some of those that claimed to be different  \ntypes of nature spirits had different degrees of consciousness and  \nintelligence. I found this really interesting. Some were quite wise  \nand could have fabulous conversations and some could utter a word or  \ntwo. Some could see and some could not. I had one spirit by my front  \ndoor that would audibly greet people right in their ear as they were  \ncoming in. I always got a kick out of this and could tell by the look  \nof shock, the wince, and looking around that they heard it, but were  \ntoo freaked out to say anything. lol! Right by your ear she&#39;d say &quot;Hi&quot;  \nor &quot;Hello&quot;. Nothing else and she was always by the door. Go figure.\n\nI type this out and then I think how silly it all sounds in type, but  \nanyway, you asked! Hehehe!\n\nI suggest reading the history of Findhorn on the website. It&#39;s really  \namazing and they were able to grow things (and still are) in the  \nScottish sand there on the coast that were just impossible by  \ncooperating with the nature spirits there. All sorts of scientists  \nhave come to study them and none could explain it. It simply shouldn&#39;t  \nhave been possible. Eileen Caddy & Dorthy McClean were the ones who  \nmade contact with the Elementals via meditation.\n\nOh it&#39;s great stuff to read about and I think you&#39;d enjoy it. What  \nI&#39;ve learned in my studies of these spirits is that all are equally  \nimportant. None are to be higher or lower. No ego exists in the realm  \nof God. All of them fill a task and should be respected. They love  \nattention and loving thoughts. They&#39;ve told me &quot;prayer is their  \nmedicine&quot;. Even spiders have personality... the tiniest flower can be  \nsuch a joy. I once had a clam in my marine tank that loved to be  \npetted. So much we ignore in our realm here in this country tossing it  \noff because this culture has lost it&#39;s ties to the old ways. So sad,  \nbut I digress... Another book you might like is &quot;The Secret Life of  \nPlants&quot; by Peter Tompkins & Christopher Bird.  The movie based on the  \nbook is here: http://video.google.com/videoplay?docid=4753736638977368381\n\nAnyway, I hope that&#39;s of help!\n\nw.\nOn Aug 18, 2008, at 8:15 PM, threadsintyme@... wrote:\n\n&gt; W.,\n&gt;\n&gt; I am interested in what you mentioned about the elementals and the  \n&gt; Devic information.\n&gt;\n&gt; Please share...\n&gt;\n&gt; Al\n&gt;\n\n\nSu e. The bes I can do is desc ibe my expe ience, and ha would be ha since I was e y e y small, I always sensed ha any li ing hing in he plan & mine al kingdom had an ene gy o i . My mo he di o ced my a he when I was a baby and ema ied a Eu opean. His mo he was FABULOUS and o en alked o spi i s, alking o he \"deceased\" mo he and o he ela i es in he d eams, balls o ligh she'd o en see (o bs I assume) and I lo ed i . I lo e cul u es like he I ish, and all Cel s, Co nish, and Welsh who include he spi i s in hei daily li es. I' e always had a eal passion o all hings ae ie and o na u e and ound Findho n a a e y young age. My i s o 2 NDE's was a age 5 and wi h ha expe ience bloomed an in ense in e es in all spi i s, no jus hose ha had been in human o m.I you enjoy eading abou Cayce, you'd lo e books by Do hy MaClean \"To Hea he Angels Sing\" and Eileen Caddy's books. You can ind ou mo e abou hem a www. indho n.o g In my ea ly 20's I was big in o Caddy's & MaClean's wo k and eading abou Theosophy. I lo ed he wo ks o Rudolph S eine who was a isiona y and ounded Waldo Educa ion & An h oposophy. You'd p obably lo e eading his s u oo. He del es deep in o he angelic, elemen al, and de ic kingdoms. Really ascina ing. I'm so g a e ul o he chance o expe ience o he cul u es o he han he US as hey a e much less \"pu i anical\" and b ainwashed by o ganized eligions. I don' mean o dis espec anyone by his s a emen , bu people in he UK and o he coun ies hink we' e qui e da when i comes o hinking o ou sel es, and o ming ou own opinions ins ead o being sheep o o ganized eligions. I ha e o ag ee. Which is why I'm glad Spi i ualism is g owing in he US. No as enough hough!I con inued my pe sonal s udy o na u e spi i s o elemen als o e he yea s and o my amazemen , one o my i s eco dings was o a being ha said she was a ae y. I do ha e a huge sense o humo , and hough I was deligh ed, I jus wasn' su e I bough wha she was elling me. lol! I hink she said she was a \"house ae y\" and she said she lo ed whe e she li ed, e c... Some o hose ha claimed o be di e en ypes o na u e spi i s had di e en deg ees o consciousness and in elligence. I ound his eally in e es ing. Some we e qui e wise and could ha e abulous con e sa ions and some could u e a wo d o wo. Some could see and some could no . I had one spi i by my on doo ha would audibly g ee people igh in hei ea as hey we e coming in. I always go a kick ou o his and could ell by he look o shock, he wince, and looking a ound ha hey hea d i , bu we e oo eaked ou o say any hing. lol! Righ by you ea she'd say \"Hi\" o \"Hello\". No hing else and she was always by he doo . Go igu e. I ype his ou and hen I hink how silly i all sounds in ype, bu anyway, you asked! Hehehe!I sugges eading he his o y o Findho n on he websi e. I 's eally amazing and hey we e able o g ow hings (and s ill a e) in he Sco ish sand he e on he coas ha we e jus impossible by coope a ing wi h he na u e spi i s he e. All so s o scien is s ha e come o s udy hem and none could explain i . I simply shouldn' ha e been possible. Eileen Caddy & Do hy McClean we e he ones who made con ac wi h he Elemen als ia medi a ion. Oh i 's g ea s u o ead abou and I hink you'd enjoy i . Wha I' e lea ned in my s udies o hese spi i s is ha all a e equally impo an . None a e o be highe o lowe . No ego exis s in he ealm o God. All o hem ill a ask and should be espec ed. They lo e a en ion and lo ing hough s. They' e old me \"p aye is hei medicine\". E en spide s ha e pe sonali y... he inies lowe can be such a joy. I once had a clam in my ma ine ank ha lo ed o be pe ed. So much we igno e in ou ealm he e in his coun y ossing i o because his cul u e has los i 's ies o he old ways. So sad, bu I dig ess... Ano he book you migh like is \"The Sec e Li e o Plan s\" by Pe e Tompkins & Ch is ophe Bi d.  The mo ie based on he book is he e: h p:// ideo.google.com/ ideoplay?docid=4753736638977368381Anyway, I hope ha 's o help! w.On Aug 18, 2008, a 8:15 PM, h eadsin yme@... w o e:W.,I am in e es ed in wha you men ioned abou he elemen als and he De ic in o ma ion.Please sha e...Al"}