{"id": "11964", "subject": "Re: [EVP-ITC] Second Life", "author": "black bear hollow", "timestamp": "2008-08-19T21:05:25Z", "full_text": "No charge at all unless you own land or rent. You can purchase  \ndifferent avatars, clothing, accessories, etc...\nfor your avatar. Second Life currency is called &quot;Lindens&quot;. You can by  \nquite a lot of lindens for a couple of bucks via Paypal.\nYou can also get many avatars and clothes, costumes, you name it, for  \nfree. There are a lot of &quot;freebie&quot; type places on SL.\n\nFor a long time, I got everything free and had a lot of fun playing  \nwith my avatar. You can get pretty creative. I once saw Jesus float by  \nand angels were singing around him - it was a riot - and later saw a  \nvery strange looking Elvis. You can be anything in SL.\n\nMany different spiritual & metaphysical groups meet in SL. They have  \nplaces to meditate, talk, you name it. It&#39;s a lot of fun to explore.\n\nFor a recording group, I was envisioning meeting once or twice a month  \n(or more) to discuss our research and perhaps even try to record as a  \ngroup... combine energies. Might be fun & interesting!\n\nw.\nOn Aug 19, 2008, at 3:12 PM, Ron Lederer wrote:\n\n&gt;\n&gt; w.  I checked out the site quickly.  Looks like a monthly charge is  \n&gt; involved or no?  I will get back to it again when I have more time.   \n&gt; What do you envision with a recording group...I might be  \n&gt; interested?  ron l\n&gt;\n&gt; \n\n\nNo cha ge a all unless you own land o en . You can pu chase di e en a a a s, clo hing, accesso ies, e c...  o you a a a . Second Li e cu ency is called \"Lindens\". You can by qui e a lo o lindens o a couple o bucks ia Paypal.You can also ge many a a a s and clo hes, cos umes, you name i , o ee. The e a e a lo o \" eebie\" ype places on SL.Fo a long ime, I go e e y hing ee and had a lo o un playing wi h my a a a . You can ge p e y c ea i e. I once saw Jesus loa by and angels we e singing a ound him - i was a io - and la e saw a e y s ange looking El is. You can be any hing in SL. Many di e en spi i ual & me aphysical g oups mee in SL. They ha e places o medi a e, alk, you name i . I 's a lo o un o explo e.Fo a eco ding g oup, I was en isioning mee ing once o wice a mon h (o mo e) o discuss ou esea ch and pe haps e en y o eco d as a g oup... combine ene gies. Migh be un & in e es ing! w.On Aug 19, 2008, a 3:12 PM, Ron Lede e w o e:w.  I checked ou he si e quickly.  Looks like a mon hly cha ge is in ol ed o no?  I will ge back o i again when I ha e mo e ime.  Wha do you en ision wi h a eco ding g oup...I migh be in e es ed?  on l"}