{"id": "11976", "subject": "Re: [EVP-ITC] Did ya miss me!?", "author": "Misty Dawn", "timestamp": "2008-08-21T16:56:17Z", "full_text": "Welcome back Rhonda!\n\nGlad ya found time to get some recording in while you were away.\n\nMisty\n\n\n--- On Thu, 8/21/08, Rhonda W &lt;rhondak1973@...&gt; wrote:\n\n&gt; From: Rhonda W &lt;rhondak1973@...&gt;\n&gt; Subject: [EVP-ITC] Did ya miss me!?\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Thursday, August 21, 2008, 12:38 PM\n&gt; Im bacccccccck!\n&gt;  \n&gt; Sorry had dead modem and had to wait for cable company to\n&gt; bring out a new one, took em 3 weeks!\n&gt;  \n&gt; So I did a some sessions while I waited, got some good\n&gt; responses and actually a few EVPs saying my name and that\n&gt; mom loves you....checked my mail when I got my net back and\n&gt; got an email from the lady(Pat) that lived next door to my\n&gt; mom and whom was a good friend of my mom.  Theres a new\n&gt; family living on my moms property now, new mobile home and\n&gt; all...well they have a 3 year old son who talked to my moms\n&gt; friend a week or so ago...the little boy was telling her\n&gt; about talking to a &quot;man with ugly eyes&quot; in his\n&gt; room and how he was nice, he wasnt mean, Pat thinks(and I\n&gt; tend to agree) that the boy was talking to my mom...my mom\n&gt; had realllllly short hair and didnt have pretty eyes, she\n&gt; had almost manly features as she got older and it would be\n&gt; easy for a 3 year old to think she was male, specially at\n&gt; night in a semi dark room.  The boy didnt say what they\n&gt; talked about, but they had a conversation and he wasnt\n&gt; scared...this happened on the day I got the EVPs in\n&gt;  my session.  I wanna get a digi recorder now and see if\n&gt; they would allow me to do a session at their place...would\n&gt; be very interesting to see what kind of responses Id get if\n&gt; I were on her property compared to sitting in my place which\n&gt; is 20 miles or so away.\n&gt;  \n&gt; Anyways, just wanted to share that with ya&#39;ll.  Hope\n&gt; everyone is having a good week so far!  \n&gt;  \n&gt; Rhonda"}