{"id": "12052", "subject": "RE: [EVP-ITC] DRV - Direct Radio Voice recordings", "author": "Misty Dawn", "timestamp": "2008-08-31T03:29:07Z", "full_text": "I never had alot of luck with it either. I tried it before with group many times but it was so distant and never clear or just nothing at all. But every now and then when I do a manual sweep I notice while I sit on dead air that sometimes thats where the best evp would come thru so I started to make it a habit that when I start and stop my sweep sessions its off station in the dead zone. I was doing a sweep the other night and they came thru real clear there with messages for my friend so I thought hmmm lets try just DRV and no sweeping and see if they can connect or if I can hear them. I heard nothing live just buzzing noise or what sounds like air/waves/whooshing now and then. So its not like some get where they hear it loud and clear and have conversations back and forth. At least not yet.\n\nMaybe a few adjustments could change that I dont know. I never know why some days they are clearer than others.\n\nMisty\n\n\n--- On Sat, 8/30/08, Kristin Morris &lt;ckmorris95@...&gt; wrote:\n\n&gt; From: Kristin Morris &lt;ckmorris95@...&gt;\n&gt; Subject: RE: [EVP-ITC] DRV - Direct Radio Voice recordings\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Saturday, August 30, 2008, 2:00 PM\n&gt; Misty - you have a wonderful connection with them.  I have\n&gt; tried DRV with no\n&gt; luck.  If you don&#39;t mind I want to pick your brains on\n&gt; how exactly you do\n&gt; this?  THX!  Great files.\n&gt; \n&gt; k\n&gt; \n&gt;  \n&gt; \n&gt;   _____  \n&gt; \n&gt; From: EVP-ITC@yahoogroups.com\n&gt; [mailto:EVP-ITC@yahoogroups.com] On Behalf Of\n&gt; Misty\n&gt; Sent: Saturday, August 30, 2008 12:24 PM\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Subject: [EVP-ITC] DRV - Direct Radio Voice recordings\n&gt; \n&gt;  \n&gt; \n&gt; I did a DRV session last night and I just wanted to share\n&gt; some of the \n&gt; results with the group. They came thru quite clearly even\n&gt; tho they had \n&gt; some difficulty making the link to where I was tuned off\n&gt; station in \n&gt; the &quot;dead&quot; zone. I usually start and end my sweep\n&gt; sessions off station \n&gt; but they had been coming thru quite clear there so last\n&gt; night I did the \n&gt; entire session that way. As always Tony was there to lend a\n&gt; hand.\n&gt; \n&gt; http://www.esnips.\n&gt; &lt;http://www.esnips.com/web/directradiovoice&gt;\n&gt; com/web/directradiovoice\n&gt; \n&gt; For those who have any difficulty playing the files try\n&gt; downloading \n&gt; then playing.\n&gt; \n&gt; Misty"}