{"id": "12092", "subject": "Re: [EVP-ITC] First run, 12-469 in my apartment", "author": "Misty Dawn", "timestamp": "2008-09-10T04:50:15Z", "full_text": "Thats great Andy =) Glad your first session went smoothly. \n\nPerhaps the cemetery spirit is as interested in you as you are in them. The more you notice them the more they will notice you. I dont see that as a negative thing, tho some may run to sage and bless every corner of the house they recorded a voice at LOL. Maybe someone is just trying to get attention.\n\nJust remember to focus on the positive rather than the negative. We tend to lead ourselves astray otherwise. It can be a very informative and educational experience if you refuse to engage in the negativity that sometimes surrounds you even in day to day life.\n\nFor those who have fear things can seem very &quot;scary&quot; because they give others the power to scare them. \n\nAs to your questions I prefer AM for sweep but I get results elsewhere. Time of day seems to matter little for me. Some days are good some days are not so clear. But thats true for all methods I use.\n\nLet us know how it goes! And Chad and Kristin are right get more batteries and sometimes they do answer if you ask how to improve your end.\n\nMisty\n\n \n\n--- On Tue, 9/9/08, ourobouros2k2 &lt;ourobouros2k2@...&gt; wrote:\n\n&gt; From: ourobouros2k2 &lt;ourobouros2k2@...&gt;\n&gt; Subject: [EVP-ITC] First run, 12-469 in my apartment\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Tuesday, September 9, 2008, 4:23 PM\n&gt; Thought I would let everyone know about my wife and I&#39;s\n&gt; first run with \n&gt; the modded 12-469 shack box today. As I stated, I was\n&gt; skeptical of the \n&gt; results, just by very method used would be hard to\n&gt; distinguish from \n&gt; coincidence.I was not prepeared, however,  for the results\n&gt; we got from \n&gt; my first use with this box.\n&gt; \n&gt; Activity in our place has been on the rise, so I figured,\n&gt; wth, I will \n&gt; try it first in our own place. When I asked if present\n&gt; entities knew \n&gt; the name of the person&#39;s room we were in, we received\n&gt; the answer \n&gt; twice: &quot;Kristen&quot; once loudly, and again several\n&gt; seconds later a softer \n&gt; voice came through and repeated. The box accurately told my\n&gt; wife her \n&gt; own name as a means of validation, and advised it followed\n&gt; me home from \n&gt; a cemetery investigation several weeks ago. I have been\n&gt; investigating \n&gt; since 1999, so this isn&#39;t my first attachment, but this\n&gt; is my first \n&gt; confirmation via ITC. The box even said the name of the\n&gt; small rural \n&gt; town where the cemetery was.\n&gt; \n&gt; I am not sure of the mechanism, and not sure if it\n&gt; isn&#39;t some PK \n&gt; element of the operators present or a legitimate external\n&gt; entity making \n&gt; contact, but...I must say I never expected the contextually\n&gt; accurate \n&gt; responses to immediate questioning. Goes without saying I\n&gt; will be \n&gt; conducting another session in the near future. One odd\n&gt; thing, the \n&gt; recorder I had running at the time inexplicably lost power\n&gt; (new batt) \n&gt; at 6:12 minutes in the middle of the session, so I missed\n&gt; recording the \n&gt; last half. I will upload the file as soon as I locate my\n&gt; now MIA patch \n&gt; cord.\n&gt; \n&gt; Thanks all,\n&gt; Andy"}