{"id": "12114", "subject": "Re: Favorite practice for evp maker / sj allophone method", "author": "ourobouros2k2", "timestamp": "2008-09-13T23:06:30Z", "full_text": "Margaret,\n\nThanks so much, I was starting to wonder if the exclusion of non \nrelevant data was handicapping me. I loaned out my shack hack for the \nnight, but tomorrow I am going to try a session with clear intent, \nperhaps a meditation beforehand might help. I will definately focus \nmore on specifics rather than a general q and a. Off to listen to more \nfiles...\n\nthanks again\nAndy\n\n\n\n\n\n\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;itcdeadpeople&quot; &lt;ITCdeadpeople@...&gt; \nwrote:\n&gt;\n&gt; Hi Andy.  I know everyone doesn&#39;t feel as I do, but I too disregard \neverything that isn&#39;t \n&gt; relevant when I&#39;m using any of the sweep methods.  As for any \nspecial practices, I find that \n&gt; the more clear I am with my intention for the session, usually the \nbetter results I get.  \n&gt; \n&gt; Some of the criteria I use when deciding whether or not to accept \ncontent in a session as \n&gt; intentional communication is:\n&gt; \n&gt; \tThe spoken phrase is directly relevant to my preceding \nquestion or comment.  In \n&gt; some cases it is immediate, just as it would be in normal \nconversation.\n&gt; \tThe duration of the response spans at least one full cycle of \nthe back/forth sweep, \n&gt; sometimes several.\n&gt; \tThe words are spoken in a single tone of voice.\n&gt; \tThe intonation and cadence are suggestive of that which is \nconsidered normal human \n&gt; speech pattern.\n&gt; \tThe validation by a loved one recognizing the voice and words.  \nThough subjective, I \n&gt; find it persuasive.\n&gt; \n&gt; \n&gt; I have examples of various methods I&#39;ve tried and explanations of \nthe clips posted in my \n&gt; folder (Margaret Downey) here on the boards if you&#39;d like to hear \nsome of my results.  I&#39;ve \n&gt; done a lot of work with the EVPM/allophones combo.\n&gt; \n&gt; Margaret\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;ourobouros2k2&quot; &lt;ourobouros2k2@&gt; \nwrote:\n&gt; &gt;\n&gt; &gt; I am very intrigued at this idea, it seems to me that when using \nevp \n&gt; &gt; maker in this way it would be easier to detect if the allophone \nfile \n&gt; &gt; has been manipulated to produce speech than with the shack box. \n&gt; &gt; Problem I am having (mental block)is that I discard any speech \nfrom \n&gt; &gt; the box that isn&#39;t directly related to my questions as just part \nof \n&gt; &gt; the sweep and not part of the communication. I should probably \nrelax \n&gt; &gt; and not try so hard, but...\n&gt; &gt; \n&gt; &gt; I am curious as to if any one has any special practices or tricks \nwith \n&gt; &gt; this method that produces great results for them I eventually want \nto \n&gt; &gt; make a speakjet box (or more accurately beg my more electronically \n&gt; &gt; astute friends to build me one).\n&gt; &gt; \n&gt; &gt; I have been really enjoying the 469 shack hack method, and of the \nonly \n&gt; &gt; two sessions I have done, one was uncannily accurate, while the \nother, \n&gt; &gt; well it was good experience :D\n&gt; &gt; \n&gt; &gt; Thanks in advance for the info...\n&gt; &gt; \n&gt; &gt; Andy\n&gt; &gt;\n&gt;"}