{"id": "12110", "subject": "Re: Hi, New Member from UK", "author": "ourobouros2k2", "timestamp": "2008-09-13T07:14:01Z", "full_text": "Indeed, I am new to the box type method of itc, but the results I \nhave been getting from the shack hack box cannot be denied. I will \nadmit there is the possibility of audio paradolia and coincidence, \nbut the results and the specific details and names I have been \ngetting in direct answers to my questions are far to personal and \naccurate to be totally coincidence. I too noticed from my very first \nsession that reviewing the recording brings out so much more detail. \nI was able to detect redundant answers to my questions in addition to \nthe answers I heard live. Good stuff and best of luck.\n\nthanks, \nAndy\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;Steve Hultay&quot; &lt;urkel23@...&gt; wrote:\n&gt;\n&gt; \n&gt; I find that i miss a lot in real-time when doing a session live.  \n&gt; That&#39;s why it&#39;s always good to record and review what you may have  \n&gt; missed.  I would love to hear your recordings and see what you&#39;ve \n&gt; been getting.  And you are using a mobile phone....that&#39;s \n&gt; interesting.  That continues to prove that they will use anything \nwe \n&gt; have to communicate.\n&gt; \n&gt; Good Job and continued success,\n&gt; -Steve H.\n&gt; \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;tonyandsue13&quot; &lt;tonyandsue13@&gt; \n&gt; wrote:\n&gt; &gt;\n&gt; &gt; Within the last week I came across the concept of the ghost box \n&gt; &gt; (Frank&#39;s box) and have had immediate results.\n&gt; &gt; \n&gt; &gt; This is actually using a mobile phone on radio mode with a manual \n&gt; scan, \n&gt; &gt; simply holding down the button and it scans through the FM bands \n&gt; either \n&gt; &gt; up or down. There was no white noise being played at the same \ntime \n&gt; nor \n&gt; &gt; on review.\n&gt; &gt; \n&gt; &gt; What surprised me was the clarity of the answers to direct \n&gt; questions \n&gt; &gt; which could then be checked on a reviewing the tape. But also \nthat \n&gt; on \n&gt; &gt; one ocassion the replies weren&#39;t audible until the replay of the \n&gt; taped \n&gt; &gt; session was heard.\n&gt; &gt; \n&gt; &gt; Is this typical?\n&gt; &gt; \n&gt; &gt; I can upload the sessions which are quite interesting due to the \n&gt; &gt; subject being discussed.\n&gt; &gt;\n&gt;"}