{"id": "12119", "subject": "Re: Excuse Me....", "author": "Misty", "timestamp": "2008-09-14T21:39:03Z", "full_text": "Hello Katherine\n\nEveryone is free to make up thier own minds as to whether spirits \nexist and whether they try to communicate using whatever means are \navailable. It&#39;s a case of you believe it can work or you dont. Franks \nbox is just one of many tools being used by researchers to gather \ndata. As to what or who you are talking to, I think again that \ndepends on which person you ask. \n\nTheres a wide cariety of people here who have had success using \ndifferent methods. And also quite a few who would be more than happy \nto listen to your files. File type and file sizes are limited on this \ngroup so many have made use of other methods of posting such as \nposting wav files or larger files on esnips.com to share with the \ngroup. Yahoo groups have limited space so we ask people to make use \nof whats available.\n\nMany here do not use franks box, or sweep tuning but for those who do \nI think they find it just as fascinating as recording regular EVP and \noften the information and the voices coming thru carry over into \nwhatever method of choice they use. \n\nThe best way to decide is always to try it for yourself. I think you \nmay find a few skeptics who did just that and have been surprised \nwith thier own results. You will also find a few who remain the \nskeptic. \n\nGood luck on your journey!\n\nMisty\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;maggotfurcoats&quot; &lt;katkat23@...&gt; wrote:\n&gt;\n&gt; But, are there any files on this group where any of you believe you\n&gt; are communicating with a spirit?  Frank&#39;s box seems to really force\n&gt; all kinds of &quot;voices&quot; out of the airwaves and I am not yet buying \nit.\n&gt; \n&gt; Does any one have anything constructive to say to us in regard to\n&gt; actual paranormal investigation via Frank&#39;s box, rather than mildly\n&gt; entertaining techno-tweaking? \n&gt; \n&gt; I was on a multi-group investigation at an old historical mission in\n&gt; Santa Barbara a week ago, for instance and watched the frank&#39;s box \nat\n&gt; work for the first time.\n&gt; \n&gt; Sure, I heard a few things that sounded obviously like radio, but we\n&gt; did hear a very eerie woman&#39;s voice screaming when we were in the \nmain\n&gt; chapel room, and THAT got my attention..  But everything else I have\n&gt; heard so far in the files here is not striking me as the voice of \nany\n&gt; apparition, due to the weakness of quality. \n&gt; \n&gt; If you&#39;re still reading this, I have to tell you I have had striking\n&gt; results in my own home, simply letting a recording device roll, and \nif\n&gt; you&#39;re not yet interested in hearing these samples, I guess you&#39;re\n&gt; more into the box than the afterlife and that&#39;s YOU, not me! :)\n&gt; \n&gt; LOVE,\n&gt; \n&gt; Katherine.\n&gt;"}