{"id": "12113", "subject": "Re: Favorite practice for evp maker / sj allophone method", "author": "itcdeadpeople", "timestamp": "2008-09-13T18:58:24Z", "full_text": "Hi Andy.  I know everyone doesn&#39;t feel as I do, but I too disregard everything that isn&#39;t \nrelevant when I&#39;m using any of the sweep methods.  As for any special practices, I find that \nthe more clear I am with my intention for the session, usually the better results I get.  \n\nSome of the criteria I use when deciding whether or not to accept content in a session as \nintentional communication is:\n\n\tThe spoken phrase is directly relevant to my preceding question or comment.  In \nsome cases it is immediate, just as it would be in normal conversation.\n\tThe duration of the response spans at least one full cycle of the back/forth sweep, \nsometimes several.\n\tThe words are spoken in a single tone of voice.\n\tThe intonation and cadence are suggestive of that which is considered normal human \nspeech pattern.\n\tThe validation by a loved one recognizing the voice and words.  Though subjective, I \nfind it persuasive.\n\n\nI have examples of various methods I&#39;ve tried and explanations of the clips posted in my \nfolder (Margaret Downey) here on the boards if you&#39;d like to hear some of my results.  I&#39;ve \ndone a lot of work with the EVPM/allophones combo.\n\nMargaret\n\n--- In EVP-ITC@yahoogroups.com, &quot;ourobouros2k2&quot; &lt;ourobouros2k2@...&gt; wrote:\n&gt;\n&gt; I am very intrigued at this idea, it seems to me that when using evp \n&gt; maker in this way it would be easier to detect if the allophone file \n&gt; has been manipulated to produce speech than with the shack box. \n&gt; Problem I am having (mental block)is that I discard any speech from \n&gt; the box that isn&#39;t directly related to my questions as just part of \n&gt; the sweep and not part of the communication. I should probably relax \n&gt; and not try so hard, but...\n&gt; \n&gt; I am curious as to if any one has any special practices or tricks with \n&gt; this method that produces great results for them I eventually want to \n&gt; make a speakjet box (or more accurately beg my more electronically \n&gt; astute friends to build me one).\n&gt; \n&gt; I have been really enjoying the 469 shack hack method, and of the only \n&gt; two sessions I have done, one was uncannily accurate, while the other, \n&gt; well it was good experience :D\n&gt; \n&gt; Thanks in advance for the info...\n&gt; \n&gt; Andy\n&gt;"}