{"id": "12123", "subject": "Re: [EVP-ITC] Excuse Me....", "author": "Lisby", "timestamp": "2008-09-15T11:40:10Z", "full_text": "I&#39;m still wondering how this list went from a group of highly  \nresearchers all using Frank&#39;s boxes, mini&#39;s etc., and getting amazing  \nresults, so people who don&#39;t even think it&#39;s real and have never used  \none.\n\nAnd it&#39;s Frank&#39;s original group on top of it all.\n\nSigh.\n\nAnn\n\nOn Sep 14, 2008, at 8:49 PM, Stephen wrote:\n\n&gt; I believe I have recorded spirits, however I have never used  \n&gt; Frank&#39;s box\n&gt; so I cannot comment on it.\n&gt; I will record anywhere, anytime and I have recorded some excellent  \n&gt; results.\n&gt;\n&gt; Stephen ..\n&gt; http://evpresearch.redirectme.net\n&gt;\n&gt; maggotfurcoats wrote:\n&gt; &gt;\n&gt; &gt; But, are there any files on this group where any of you believe you\n&gt; &gt; are communicating with a spirit? Frank&#39;s box seems to really force\n&gt; &gt; all kinds of &quot;voices&quot; out of the airwaves and I am not yet buying  \n&gt; it.\n&gt; &gt;\n&gt; &gt; Does any one have anything constructive to say to us in regard to\n&gt; &gt; actual paranormal investigation via Frank&#39;s box, rather than mildly\n&gt; &gt; entertaining techno-tweaking?\n&gt; &gt;\n&gt; &gt; I was on a multi-group investigation at an old historical mission in\n&gt; &gt; Santa Barbara a week ago, for instance and watched the frank&#39;s  \n&gt; box at\n&gt; &gt; work for the first time.\n&gt; &gt;\n&gt; &gt; Sure, I heard a few things that sounded obviously like radio, but we\n&gt; &gt; did hear a very eerie woman&#39;s voice screaming when we were in the  \n&gt; main\n&gt; &gt; chapel room, and THAT got my attention.. But everything else I have\n&gt; &gt; heard so far in the files here is not striking me as the voice of  \n&gt; any\n&gt; &gt; apparition, due to the weakness of quality.\n&gt; &gt;\n&gt; &gt; If you&#39;re still reading this, I have to tell you I have had striking\n&gt; &gt; results in my own home, simply letting a recording device roll,  \n&gt; and if\n&gt; &gt; you&#39;re not yet interested in hearing these samples, I guess you&#39;re\n&gt; &gt; more into the box than the afterlife and that&#39;s YOU, not me! :)\n&gt; &gt;\n&gt; &gt; LOVE,\n&gt; &gt;\n&gt; &gt; Katherine.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; ----------------------------------------------------------\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; No virus found in this incoming message.\n&gt; &gt; Checked by AVG - http://www.avg.com\n&gt; &gt; Version: 8.0.169 / Virus Database: 270.6.21/1671 - Release Date:  \n&gt; 9/14/2008 7:16 AM\n&gt; &gt;\n&gt; &gt;\n&gt;\n&gt; \n\n\nI'm s ill wonde ing how his lis wen om a g oup o highly esea che s all using F ank's boxes, mini's e c., and ge ing amazing esul s, so people who don' e en hink i 's eal and ha e ne e used one.And i 's F ank's o iginal g oup on op o i all.Sigh.AnnOn Sep 14, 2008, a 8:49 PM, S ephen w o e:I belie e I ha e eco ded spi i s, howe e I ha e ne e used F ank's box so I canno commen on i .I will eco d anywhe e, any ime and I ha e eco ded some excellen esul s.S ephen ..h p://e p esea ch. edi ec me.ne maggo u coa s w o e:>> Bu , a e he e any iles on his g oup whe e any o you belie e you> a e communica ing wi h a spi i ? F ank's box seems o eally o ce> all kinds o \" oices\" ou o he ai wa es and I am no ye buying i .>> Does any one ha e any hing cons uc i e o say o us in ega d o> ac ual pa ano mal in es iga ion ia F ank's box, a he han mildly> en e aining echno- weaking?>> I was on a mul i-g oup in es iga ion a an old his o ical mission in> San a Ba ba a a week ago, o ins ance and wa ched he ank's box a > wo k o he i s ime.>> Su e, I hea d a ew hings ha sounded ob iously like adio, bu we> did hea a e y ee ie woman's oice sc eaming when we we e in he main> chapel oom, and THAT go my a en ion.. Bu e e y hing else I ha e> hea d so a in he iles he e is no s iking me as he oice o any> appa i ion, due o he weakness o quali y.>> I you' e s ill eading his, I ha e o ell you I ha e had s iking> esul s in my own home, simply le ing a eco ding de ice oll, and i > you' e no ye in e es ed in hea ing hese samples, I guess you' e> mo e in o he box han he a e li e and ha 's YOU, no me! :)>> LOVE,>> Ka he ine.>>> > ---------------------------------------------------------->>> No i us ound in his incoming message.> Checked by AVG - h p://www.a g.com > Ve sion: 8.0.169 / Vi us Da abase: 270.6.21/1671 - Release Da e: 9/14/2008 7:16 AM>>"}