{"id": "12120", "subject": "Re: [EVP-ITC] Excuse Me....", "author": "Stephen", "timestamp": "2008-09-15T00:49:41Z", "full_text": "I believe I have recorded spirits, however I have never used Frank&#39;s box \nso I cannot comment on it.\nI will record anywhere, anytime and I have recorded some excellent results.\n\nStephen ..\nhttp://evpresearch.redirectme.net\n\nmaggotfurcoats wrote:\n&gt;\n&gt; But, are there any files on this group where any of you believe you\n&gt; are communicating with a spirit? Frank&#39;s box seems to really force\n&gt; all kinds of &quot;voices&quot; out of the airwaves and I am not yet buying it.\n&gt;\n&gt; Does any one have anything constructive to say to us in regard to\n&gt; actual paranormal investigation via Frank&#39;s box, rather than mildly\n&gt; entertaining techno-tweaking?\n&gt;\n&gt; I was on a multi-group investigation at an old historical mission in\n&gt; Santa Barbara a week ago, for instance and watched the frank&#39;s box at\n&gt; work for the first time.\n&gt;\n&gt; Sure, I heard a few things that sounded obviously like radio, but we\n&gt; did hear a very eerie woman&#39;s voice screaming when we were in the main\n&gt; chapel room, and THAT got my attention.. But everything else I have\n&gt; heard so far in the files here is not striking me as the voice of any\n&gt; apparition, due to the weakness of quality.\n&gt;\n&gt; If you&#39;re still reading this, I have to tell you I have had striking\n&gt; results in my own home, simply letting a recording device roll, and if\n&gt; you&#39;re not yet interested in hearing these samples, I guess you&#39;re\n&gt; more into the box than the afterlife and that&#39;s YOU, not me! :)\n&gt;\n&gt; LOVE,\n&gt;\n&gt; Katherine.\n&gt;\n&gt;\n&gt; \n&gt; ------------------------------------------------------------------------\n&gt;\n&gt;\n&gt; No virus found in this incoming message.\n&gt; Checked by AVG - http://www.avg.com \n&gt; Version: 8.0.169 / Virus Database: 270.6.21/1671 - Release Date: 9/14/2008 7:16 AM\n&gt;\n&gt;"}