{"id": "12136", "subject": "Re: [EVP-ITC] Re: Excuse Me....", "author": "Zack Widup", "timestamp": "2008-09-16T03:08:39Z", "full_text": "I got some EVP in a very haunted place that were spoken at approximately \ntwice the normal speed.  Slowing them down to half-speed wuth Audacity \nproduced what sounded like a normal rate of speech.\n\nTry to figure out how they did that!\n\nZack\n\nOn Mon, 15 Sep 2008, ourobouros2k2 wrote:\n\n&gt; I was highly skeptical, and highly critical of box-type communication.\n&gt; I began looking all over the internet, youtube, etc... wondering why\n&gt; people put so much stock into these specialized tuners or modified\n&gt; radios. It then occurred to me that I was being skeptical of something\n&gt; that I have never sat down and tried. Not having much money, I went\n&gt; with the shack hack method. My first session was phenomenal, and\n&gt; although I don&#39;t know how mystery voices can accurately and\n&gt; contextually answer my questions posed to what is, in effect, a\n&gt; malfunctioning radio, I am only left with the knowledge that it works.\n&gt; At least it worked for me. Believe me, it drives me insane trying to\n&gt; figure out the mechanism by which spirits would be able to communicate\n&gt; with a box spitting out chunks of broadcast fragments. That being\n&gt; said, though, it really isn&#39;t anymore of a leap of faith than the\n&gt; coil-induction theory of evp collection, I mean, how would a spirit\n&gt; know how to manipulate focused emf fields to produce corresponding\n&gt; frequency.\n&gt;\n&gt; As to what the voices might be, I have to say as far as I am\n&gt; concerned, the jury is still out. I am wondering if there isn&#39;t some\n&gt; sort of latent PK element in play by the operator, it would certainly\n&gt; explain why the information is so accurate and specific. I am working\n&gt; on a &quot;blind&quot; test to study that to my own satisfaction. The phenomenon\n&gt; may very well be external entities trying to make contact, and if so,\n&gt; that is just as cool. Either way, having thought the concept was\n&gt; absurd at one time, I simply gave it a shot and the results were\n&gt; undeniable. Honestly, subsequent attempts at ITC with the shack hack\n&gt; have produced mixed results, none with the in-your-face accuracy of\n&gt; the first time. Suffice it to say it is dissapointing I cannot have\n&gt; that kind of success every time, but I can certainly say that there is\n&gt; a force at work here and my curiosity is understandibly aroused.\n&gt;\n&gt; thanks\n&gt; Andy\n&gt;\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, &quot;maggotfurcoats&quot; &lt;katkat23@...&gt; wrote:\n&gt;&gt;\n&gt;&gt; But, are there any files on this group where any of you believe you\n&gt;&gt; are communicating with a spirit?  Frank&#39;s box seems to really force\n&gt;&gt; all kinds of &quot;voices&quot; out of the airwaves and I am not yet buying it.\n&gt;&gt;\n&gt;&gt; Does any one have anything constructive to say to us in regard to\n&gt;&gt; actual paranormal investigation via Frank&#39;s box, rather than mildly\n&gt;&gt; entertaining techno-tweaking?\n&gt;&gt;\n&gt;&gt; I was on a multi-group investigation at an old historical mission in\n&gt;&gt; Santa Barbara a week ago, for instance and watched the frank&#39;s box at\n&gt;&gt; work for the first time.\n&gt;&gt;\n&gt;&gt; Sure, I heard a few things that sounded obviously like radio, but we\n&gt;&gt; did hear a very eerie woman&#39;s voice screaming when we were in the main\n&gt;&gt; chapel room, and THAT got my attention..  But everything else I have\n&gt;&gt; heard so far in the files here is not striking me as the voice of any\n&gt;&gt; apparition, due to the weakness of quality.\n&gt;&gt;\n&gt;&gt; If you&#39;re still reading this, I have to tell you I have had striking\n&gt;&gt; results in my own home, simply letting a recording device roll, and if\n&gt;&gt; you&#39;re not yet interested in hearing these samples, I guess you&#39;re\n&gt;&gt; more into the box than the afterlife and that&#39;s YOU, not me! :)\n&gt;&gt;\n&gt;&gt; LOVE,\n&gt;&gt;\n&gt;&gt; Katherine.\n&gt;&gt;\n&gt;\n&gt;\n&gt;\n&gt; ------------------------------------\n&gt;\n&gt; Yahoo! Groups Links\n&gt;\n&gt;\n&gt;\n&gt;"}