{"id": "12148", "subject": "Re: [EVP-ITC] Ovilus question and feed back needed PLEASE", "author": "Zack Widup", "timestamp": "2008-09-16T16:00:15Z", "full_text": "Hi Jeff,\n\nInteresting. As I said, I haven&#39;t used one yet.\n\nI just have a lot of suspicion about devices that generate phonemes as \nopposed to actual sounds received. I&#39;m sure some spirits can make them \nproduce messages but they could also produce something out of random \nsounds. That&#39;s what I&#39;d be worried about. Might sort of come out like \nJames Joyce&#39;s Ulysses.\n:-)\n\nZack\n\nOn Tue, 16 Sep 2008, Marlboro63@... wrote:\n\n&gt; Zack,\n&gt;\n&gt; I can attest to the opposite regarding the Ovilus 1.  The last time I  used\n&gt; mine it gave me full statements.  It was referring to contact someone  and\n&gt; labelled them by name and told me why.  then why I did contact that  person I knew\n&gt; why I was suppose to contact them.  And that person was all  the way across\n&gt; the country.\n&gt; The unit does work when it is given sufficient time to set up.\n&gt;\n&gt; Jeff\n&gt;\n&gt;\n&gt;\n&gt; In a message dated 9/16/2008 7:59:50 A.M. Central Daylight Time,\n&gt; w9sz@... writes:\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; I haven&#39;t treid one of those things yet, but based on the theoy of it I\n&gt; suspect it is much morelikely to generate &quot;words&quot; from randomities and\n&gt; things that weren&#39;t in fact words. It wouldn&#39;t be considered reliable\n&gt; evidence by any serious researchers.\n&gt;\n&gt; Zack\n&gt;\n&gt; On Tue, 16 Sep  2008, juswitchy wrote:\n&gt;\n&gt;&gt; Was jus wondering what you all thought of  the Ovilus and the puck? I\n&gt;&gt; was really thinking of buying one and was  jus looking for feed back or\n&gt;&gt; a tip on something  better..\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; Blessed Be\n&gt;&gt;\n&gt;&gt;  Jus~Witchy\n&gt;&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; **************Psssst...Have you heard the news? There&#39;s a new fashion blog,\n&gt; plus the latest fall trends and hair styles at StyleList.com.\n&gt; (http://www.stylelist.com/trends?ncid=aolsty00050000000014)\n&gt;"}