{"id": "12145", "subject": "Re: [EVP-ITC] Re: Ovilus question and feed back needed PLEASE", "author": "Carol B.", "timestamp": "2008-09-16T15:42:30Z", "full_text": "I have a puck.....very interesting piece of equipment,  I must say.  Mine\nhas actually named itself...with proper capitalization and all!  It has\ncome up with words it was not stocked with...What&#39;s really cool is the set\nup you can program in so that if the emf, or temp, get to whatever\nthreshold you set..it will take a series of three pictures, or 30 seconds\nof video or audio.  I&#39;m still in the getting to know it stage...but it is\nan interesting tool for sure!\n\nCarol B.\n\n\n\n\n\n\n\n\n\n\n\n\n\n&gt; Uhhhm, I really want one, lol. All kidding aside, I do want a puck\n&gt; pretty bad. For ITC work, it has a much larger vocabulary, and you can\n&gt; have it save and write a log file for later review. And as always, you\n&gt; can use a prg. such as Audacity to capture the session in real time.\n&gt; Another huge plus about the puck is that there are I believe 9 sensors\n&gt; for emf and temperature, and it has datalogging ability. That makes it\n&gt; worth it right there, kindof a swiss-army knife of paranormal\n&gt; instrumentation. Also if I am looking at the device right, it looks\n&gt; like there is an expansion port for future upgradeability. I would\n&gt; love to be able to purchase one of Bill&#39;s &quot;research units&quot; which as I\n&gt; understand it, is a puck with more sensors and goodies.\n&gt;\n&gt; One benefit to the ovilus is that it is handheld, but the handicaps\n&gt; outweigh that benefit if you are looking for better vocabulary, emf\n&gt; readings, and logfile records. I hear the next version of the ovilus\n&gt; will have some of those features. I really cannot wait to get my hands\n&gt; on this technology, and even moreso now after reviewing the files of\n&gt; group members here who have used these devices.\n&gt;\n&gt; thanks,\n&gt; Andy\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, &quot;juswitchy&quot; &lt;Alwaysguess@...&gt; wrote:\n&gt;&gt;\n&gt;&gt; Was jus wondering what you all thought of the Ovilus and the puck? I\n&gt;&gt; was really thinking of buying one and was jus looking for feed back or\n&gt;&gt; a tip on something better..\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; Blessed Be\n&gt;&gt;\n&gt;&gt; Jus~Witchy\n&gt;&gt;\n&gt;\n&gt;\n&gt;"}