{"id": "12151", "subject": "Re: [EVP-ITC] Ovilus question and feed back needed PLEASE", "author": "Zack Widup", "timestamp": "2008-09-16T17:09:21Z", "full_text": "Wow, that is sooo cool!  Now you make me want to get one. Something else \nto save my pennies up for.\n:-)\n\nZack\n\nOn Tue, 16 Sep 2008, Marlboro63@... wrote:\n\n&gt; Hi Zack,\n&gt;\n&gt; Read my review of the Ovilus 1.  The common mistake is that everyone  turns\n&gt; it on and expects to get immediate results.  Well all that comes out  is random\n&gt; names and what some people may term &quot;garbage&quot; at that time.  You  have to let\n&gt; the spirits around you learn how to communicate thru the box  and this can\n&gt; take a good 30 to 60 minutes.  At that time all the randomness  will have died\n&gt; down and you can now start to communicate thru the Ovilus  1.  If this step is\n&gt; overlooked then you just sit there staring at this unit  thinking you just\n&gt; pissed away $200.00.  And that is not the case.  It  takes time for the spirits\n&gt; to learn how to communicate regardless of what device  is used.  Now if you use\n&gt; this device in the same location over and over  again you only have to do it\n&gt; once.  When I first got mine it was spewing  out all kind of random garbage\n&gt; that made sense.  But once I did this the  communication flowed fluently.  It\n&gt; even gave me the name of the little girl  who&#39;s spirit inhabits our house and\n&gt; when I called her name after hearing it this  little girl came and stood in the\n&gt; hallway looking at me in amazement.  The  best was when my cat jumped up by me\n&gt; and the Ovilus 1 and wanted attention the  Ovilus 1 said &quot;good cat&quot;.  Then\n&gt; when my dog ran into the room and wanted my  attention over the cat the unit\n&gt; said &quot;bad dog&quot;, LOL.  So it does work and  ask around to people who have them\n&gt; about their experiences.\n&gt;\n&gt; Jeff\n&gt;\n&gt;\n&gt; In a message dated 9/16/2008 11:01:21 A.M. Central Daylight Time,\n&gt; w9sz@... writes:\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Hi Jeff,\n&gt;\n&gt; Interesting. As I said, I haven&#39;t used one  yet.\n&gt;\n&gt; I just have a lot of suspicion about devices that generate  phonemes as\n&gt; opposed to actual sounds received. I&#39;m sure some spirits can  make them\n&gt; produce messages but they could also produce something out of  random\n&gt; sounds. That&#39;s what I&#39;d be worried about. Might sort of come out  like\n&gt; James Joyce&#39;s Ulysses.\n&gt; :-)\n&gt;\n&gt; Zack\n&gt;\n&gt; On Tue, 16 Sep 2008,  _Marlboro63@..._ (mailto:Marlboro63@...)\n&gt; wrote:\n&gt;\n&gt;&gt; Zack,\n&gt;&gt;\n&gt;&gt; I can attest to the opposite  regarding the Ovilus 1. The last time I used\n&gt;&gt; mine it gave me full  statements. It was referring to contact someone and\n&gt;&gt; labelled them by  name and told me why. then why I did contact that person\n&gt; I knew\n&gt;&gt; why I  was suppose to contact them. And that person was all the way across\n&gt;&gt;  the country.\n&gt;&gt; The unit does work when it is given sufficient time to  set up.\n&gt;&gt;\n&gt;&gt; Jeff\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; In a message  dated 9/16/2008 7:59:50 A.M. Central Daylight Time,\n&gt;&gt; _w9sz@prairienet.w9s_ (mailto:w9sz@...)   writes:\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; I haven&#39;t treid one of  those things yet, but based on the theoy of it I\n&gt;&gt; suspect it is much  morelikely to generate &quot;words&quot; from randomities and\n&gt;&gt; things that  weren&#39;t in fact words. It wouldn&#39;t be considered reliable\n&gt;&gt; evidence by  any serious researchers.\n&gt;&gt;\n&gt;&gt; Zack\n&gt;&gt;\n&gt;&gt; On Tue, 16 Sep  2008, juswitchy wrote:\n&gt;&gt;\n&gt;&gt;&gt; Was jus wondering what you all  thought of the Ovilus and the puck? I\n&gt;&gt;&gt; was really thinking of  buying one and was jus looking for feed back or\n&gt;&gt;&gt; a tip on something  better..\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt; Blessed  Be\n&gt;&gt;&gt;\n&gt;&gt;&gt;  Jus~Witchy\n&gt;&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;  ************  ****  ************&lt;WBR&gt;**Psssst.&lt;WBR&gt;..Have you heard the n\n&gt;&gt; plus the latest fall trends and hair styles at  StyleList.com.\n&gt;&gt; (_http://www.stylelishttp://www.sthttp://www.stylehttp://ww_\n&gt; (http://www.stylelist.com/trends?ncid=aolsty00050000000014) )\n&gt;&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; **************Psssst...Have you heard the news? There&#39;s a new fashion blog,\n&gt; plus the latest fall trends and hair styles at StyleList.com.\n&gt; (http://www.stylelist.com/trends?ncid=aolsty00050000000014)\n&gt;"}