{"id": "12154", "subject": "Re: [EVP-ITC] Ovilus question and feed back needed PLEASE", "author": "black bear hollow", "timestamp": "2008-09-16T17:21:43Z", "full_text": "AH! Got&#39;cha! Thanks! :)\n\nw\nॐ\n\nOn Sep 16, 2008, at 1:19 PM, Marlboro63@... wrote:\n\n&gt; First off.............\n&gt;\n&gt; Wherever you are at with the Ovilus 1 you have to let the spirits  \n&gt; there learn how to communicate thru the unit before you can  \n&gt; effectively communicate with them.  You do this by telling the  \n&gt; spirits that you have this device and that you want to communicate  \n&gt; to them thru it.   And that they have to learn how to communicate  \n&gt; thru it before you can begin.  So you let the unit run by itself for  \n&gt; 30 to 60 minutes.  After all the random ramblings coming from the  \n&gt; unit have slowed or calmed down then you will be able to communicate  \n&gt; and start to receive answers that will make sense to you.  Its as  \n&gt; simple as that.\n&gt;\n&gt; Jeff\n&gt;\n&gt; In a message dated 9/16/2008 12:14:31 P.M. Central Daylight Time, blackbearhollow@... \n&gt;  writes:\n&gt; Hi Jeff,\n&gt;\n&gt;\n&gt; What did you do? The below comments make no sense to me.  What do  \n&gt; you have to do &quot;once&quot;?\n&gt; Random garbage that made sense? lol!\n&gt; What did you do for communication to flow smoothly. Would you  \n&gt; elaborate?\n&gt;\n&gt; Thanks!\n&gt; w.\n&gt; ॐ\n&gt;\n&gt; On Sep 16, 2008, at 12:18 PM, Marlboro63@... wrote:\n&gt;\n&gt;&gt; Now if you use this device in the same location over and over again  \n&gt;&gt; you only have to do it once.  When I first got mine it was spewing  \n&gt;&gt; out all kind of random garbage that made sense.  But once I did  \n&gt;&gt; this the communication flowed fluently.\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Psssst...Have you heard the news? There&#39;s a new fashion blog, plus  \n&gt; the latest fall trends and hair styles at StyleList.com.\n&gt;\n&gt; \n\n\nAH! Go 'cha! Thanks! :)w ॐ  On Sep 16, 2008, a 1:19 PM, Ma lbo o63@... w o e:Fi s o ............. Whe e e you a e a wi h he O ilus 1 you ha e o le he spi i s he e lea n how o communica e h u he uni be o e you can e ec i ely communica e wi h hem.  You do his by elling he spi i s ha you ha e his de ice and ha you wan o communica e o hem h u i .   And ha hey ha e o lea n how o communica e h u i be o e you can begin.  So you le he uni un by i sel o 30 o 60 minu es.  A e all he andom amblings coming om he uni ha e slowed o calmed down hen you will be able o communica e and s a o ecei e answe s ha will make sense o you.  I s as simple as ha . Je  In a message da ed 9/16/2008 12:14:31 P.M. Cen al Dayligh Time, blackbea hollow@gmail.com w i es:Hi Je , Wha did you do? The below commen s make no sense o me.  Wha do you ha e o do \"once\"? Random ga bage ha made sense? lol! Wha did you do o communica ion o low smoo hly. Would you elabo a e? Thanks!w.ॐ On Sep 16, 2008, a 12:18 PM, Ma lbo o63@aol.com w o e:Now i you use his de ice in he same loca ion o e and o e again you only ha e o do i once.  When I i s go mine i was spewing ou all kind o andom ga bage ha made sense.  Bu once I did his he communica ion lowed luen ly. Pssss ...Ha e you hea d he news? The e's a new ashion blog, plus he la es all ends and hai s yles a S yleLis .com."}