{"id": "12161", "subject": "Re: Ovilus question and feed back needed PLEASE", "author": "ourobouros2k2", "timestamp": "2008-09-16T20:15:43Z", "full_text": "Sorry so late chiming in again, but just wanted to toss in that these\nA/D  speech boxes really seem to be an interesting new front to ITC.\nIn my opinion, it seems to take out some of the coincidence factor,\nand when using phoneme mode, you are basically guaranteed (it would\nseem) against false positive multi-syllable words. If you get one,\nseems more likely to be genuine. Also, with the puck&#39;s ability to log\na session, seems like it would eliminate the &quot;what was thay saying?&quot;\nfactor as well.\n\nI saw someone mentioned that these devices would not be taken\nseriously by researchers. I am dealing with that now with my\ncollagues, who are tripping over themselves to dissassociate from me\nsince I started experimenting with box-type ITC communications. If it\nis ITC and there is another piece of equipment involved for\ncommunication, a lot of people just won&#39;t have it. EVP recorded in\ntraditional fashion is the only type they will accept (even if the\nmechanism involved is as much a mystery as box type communication)and\nanyone dealing with a frank&#39;s box or derivative is just experimenting\nwith matrixing and coincidence. I used to think that until I decided\nto try one, but I cannot get my associates to be that open minded.\nShame really, because something is going on, even if we aren&#39;t sure\nwhat. Let&#39;s face it, box communication is a skeptic and debunker&#39;s\nplayground, and until we understand it, we have little to defend with\nwith exception of sometimes perfectly accurate and contextual data.\nUsually not good enough for them though, so this becomes a personal\nleap of faith to those who wish to study and experiment with it. Had I\nnot had a stellar first run with box type ITC, I would have likely poo\npooed the idea and shelved it for good.\n\nGuess the point I am trying to make above is that these devices, be it\nbox, or ovilus/puck may never be accepted by the hardcore research\nproponents and that is something we just have to accept. I thank God I\nfound Frank&#39;s forum here where people are not going to laugh at you\nfor mentioning ITC. Make no mistake, I am dealing with a lot of peer\nproblems with my research group over my interest in this, but I don&#39;t\ncare. It is funny that they conside psychic impressions as correlative\nevidence if it coincides with other forms of data that occurs\nsimultaneously with the impression. If that is enough to give\nvalidation, I don&#39;t see why this is any different, but hey, I can&#39;t\nconvince them, lol. I see I am straying off topic again, but another\nthing I wanted voice support for is the puck. Man I love this thing, I\nthink that it truly brings us closer to understanding the mechanism\ninvolved with this type of ITC. The environmental sensors coupled with\nthe logging ability should show patterns over long periods of use, and\nthe operator should start seeing when environmental conditions are\nmore favorable for good communication. And, if touted as an\nenvironmental array, it has great uses as such in the mainstream\ntraditional form of investigation. Who knows, a successful ITC session\nwith the puck would bring more people into experimentation.\n\nthanks, \nAndy\n\n\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;juswitchy&quot; &lt;Alwaysguess@...&gt; wrote:\n&gt;\n&gt; Was jus wondering what you all thought of the Ovilus and the puck? I \n&gt; was really thinking of buying one and was jus looking for feed back or \n&gt; a tip on something better..\n&gt; \n&gt; \n&gt; Blessed Be\n&gt; \n&gt; Jus~Witchy\n&gt;"}