{"id": "12168", "subject": "Re: Another opinion of the Ovilus", "author": "Chad", "timestamp": "2008-09-17T14:18:35Z", "full_text": "Hey Ron,\n\nI&#39;m really glad someone is working with the Ovilus and letting those\nof us who haven&#39;t purchased it know what you&#39;ve found out concerning\nthe pros and cons. I&#39;d appreciate it though if we could keep the forum\nfree of political statements and opinions, that is of course, unless\nyou&#39;re knocking Obama. lol\n\nThanks,\n\nChad\n\n\n--- In EVP-ITC@yahoogroups.com, Ron Lederer &lt;ronriko@...&gt; wrote:\n&gt;\n&gt; From one user, here are a few things I have issues with.  \n&gt; \n&gt; 1.  Unit only works off a 9 volt battery...no ac or other dc options\npossible.  My battery goes down fast and they are not cheap and I know\nof no way to recharge this type of battery.  Also, the battery seems\nto drain even when not used (I mentioned this to Bill).\n&gt; \n&gt; 2.  Mode selection at times does not change the mode when button is\npressed.  I often have to push the mode select many times to get it to\nmove to the next mode.\n&gt; \n&gt; 3.  Dictonary mode seems to not offer anything but repeat words. \nHave not checked this very closely yet but I hear repeating words and\nnames...especially... Larry...often.  I have no confidence in this mode.\n&gt; \n&gt; 4.  The phonemes and mix mode seem very limited in that I often do\nnot get any &quot;energy&quot; reading to allow sounds to be emitted. Although I\ntry to conduct my sessions in a calm mode myself, apparently I don&#39;t\nhave enough energy around me to get a consistant energy reading. \n&gt; \n&gt; 5.  Never tested other modes to determine value or usefulness except\nfor the yes/no and I found this to be totally out of touch.  Somethng\nlike McCain...sorry.\n&gt; \n&gt; I do intend to work with the concepts Jeff put forth...but first I\nneed to go buy more batteries.  Also, I will dig out a clip I have\nfrom one of my sessions and post it hear.  Maybe you can help me with\ntranslation.  Ron\n&gt;"}