{"id": "12179", "subject": "Hackable Radios for Newcomers and other Ghost Boxes", "author": "Steve Hultay", "timestamp": "2008-09-18T13:17:36Z", "full_text": "For those who are fairly new to box research and RTSC, i will provide\nbelow a list of hackable radios to be used for ghost box sweep\nfunctions.\n\nRadio Shack Radios:\n\n1. 12-469 (White-New Style). This the most popular one out there,\nit has AM and FM on it. It does not have a speaker built in, but can\nbe used with an external speaker or earbuds.\n\n2. 12-469 (Gray and White-Old Style Model). Same functions as the\nnewer one, but without the clicking during the sweep. This model is\noutdated and is harder to find.\n\n3. 12-470 (Gray and White-Old Style Model). Same as the 12-469, but\nwith a speaker built in. This is also hard to find, do not but the\nnewer model (Black) it will not work.\n\n4. 20-125 . This model has AM/FM and Shortwave, it also has a built\nin speaker. I feel the AM sweeps slowly in my area, but may work\ndifferently for others depending on the strength on the radio signal.\n\n5. 12-820 . This is an armband radio, which is AM and FM. This\nmodel works pretty well, but does not come with a speaker. Must be\nused with and external speaker or earbuds.\n\n6. 12-850 . This model is AM and FM and has a speaker built in.\n\n___________________\n\nNon-Radio Shack Radios:\n\n1. Sony Walkman (model #SRF-M37V). This is available at most stores\nlike Best Buy or Circuit City. No hack involved, just put batteries\nin it and hold down the sweep knob. The only problem is that you\nhave to manually hold the button down to sweep. It also needs an\nexternal speaker or earbuds.\n\n2. www.paranormalsystems.com --- They have many different ghost\nboxes available to purchase.\n\n3. Manual Sweeps . This is one of my favorite ways to to do a\nsession. Take any radio at all with a dial and manual sweep from one\nend of the band to the other while asking questions. Sometimes i ask\na question and than sweep to avoid a radio distraction during my\nquestions. This will work for anybody on any radio you may have,\nit&#39;s the best way to start out to see if RTSC is for you.\n\n4. EVP Maker w/allophone file\n\nhttp://www.keyportparanormal.com/evpsoftware.html\n\n5. www.digitaldowsing.com ---The ovilus, puck and other methods to\nbuy.\n\n\nWell, i think that should bring new people up to date on their\noptions. Any questions, just e-mail me for hack info on a particular\nmodel.\n\n-Steve H."}