{"id": "12171", "subject": "Re: Another opinion of the Ovilus and Puck", "author": "mllejade", "timestamp": "2008-09-17T20:39:24Z", "full_text": "Hi Everyone,\n\nI&#39;ve purchased both the Puck and the Ovilus earlier this year and \nwhile I&#39;m still experimenting with both, I thought I&#39;d weigh in with \nmy thoughts.\n\nConcerning Ron&#39;s issues, below, re the Ovilus:\n\n1.  I&#39;ve had no problem with the 9V battery draining quickly when \nusing the Ovilus.  I&#39;ve used it for over 12 hours already and the \nbattery still has about 50 percent charge left.\n\n2.  Ron, I noticed that if I pushed the mode selection button down \ntoo quickly, it does not change mode.  However, I discovered that if \nI pushed and released the button slowly, the mode selection worked \nfine.  Perhaps you&#39;re pushing the button too fast?\n\n3.  Dictionary mode only repeated words specific to the location; \ne.g., I had the Ovilus on the battlefields in Gettysburg and it kept \nrepeating &quot;crouch, hide, fierce, energy, remember, forgive&quot;; whereas \non a private investigation at an adult toy store in SF, it kept \nrepeating &quot;erotic&quot;.  \n\n4.  Both Phoneme and Mix modes worked fine off available energy.  \nAgain, the locale/environment is key in that both the Ovilus and the \nPuck take readings from the environment (EMF, temperature, etc.) and \ntranslate those readings into words.\n\n5.  I have not had a chance to do any significant experimentation \nwith the other modes (Yes/No, EMG, Level Mode and Dowsing Mode) so \ncan&#39;t remark on those.\n\nThe only issue I have with the Ovilus is that at times it&#39;s \ndifficult to make out what the robotic voice is saying as it \ndistorts a bit on certain words and/or speaks them drawn out \nlike &quot;Lis--ten&quot; for Listen.\n\nIn regards to the Paranormal Puck, I&#39;m totally in love with it in \nthat one can set alarms/thresholds that when reached, will either \nrecord a video or photo (with your webcam) or audio of whatever&#39;s in \nthe immediate environment.  Therefore, one doesn&#39;t even have to be \npresent when the EMF rises to say, over 2 MG, or the temperature \ndrops more than 10 degrees.  The webcam will document whatever&#39;s in \nthe environment at that time.  The Puck&#39;s Excel data sheet logs all \nchanges in the environmental -- excellent source of reference! \n\nSharon from San Francisco\n\n--- In EVP-ITC@yahoogroups.com, Ron Lederer &lt;ronriko@...&gt; wrote:\n&gt;\n&gt; From one user, here are a few things I have issues with.  \n&gt; \n&gt; 1.  Unit only works off a 9 volt battery...no ac or other dc \noptions possible.  My battery goes down fast and they are not cheap \nand I know of no way to recharge this type of battery.  Also, the \nbattery seems to drain even when not used (I mentioned this to Bill).\n&gt; \n&gt; 2.  Mode selection at times does not change the mode when button \nis pressed.  I often have to push the mode select many times to get \nit to move to the next mode.\n&gt; \n&gt; 3.  Dictonary mode seems to not offer anything but repeat words.  \nHave not checked this very closely yet but I hear repeating words \nand names...especially... Larry...often.  I have no confidence in \nthis mode.\n&gt; \n&gt; 4.  The phonemes and mix mode seem very limited in that I often do \nnot get any &quot;energy&quot; reading to allow sounds to be emitted. Although \nI try to conduct my sessions in a calm mode myself, apparently I \ndon&#39;t have enough energy around me to get a consistant energy \nreading. \n&gt; \n&gt; 5.  Never tested other modes to determine value or usefulness \nexcept for the yes/no and I found this to be totally out of touch.  \nSomethng like McCain...sorry.\n&gt; \n&gt; I do intend to work with the concepts Jeff put forth...but first I \nneed to go buy more batteries.  Also, I will dig out a clip I have \nfrom one of my sessions and post it hear.  Maybe you can help me \nwith translation.  Ron\n&gt;"}