{"id": "12175", "subject": "Re: [EVP-ITC] Darkheads, what are they?", "author": "Misty Dawn", "timestamp": "2008-09-18T03:41:51Z", "full_text": "Mostly negative in nature. Frank S was first one I heard use that term for it years ago. His meaning may differ from my own hehehe.\n\nTo me negs are everywhere. I pass them on the street every day. They also occasionaly come thru in spirit form tho they dont have much luck getting thru the barrier these days here. Many people have spoken of being affected by what was said so much they stopped doing the work completely. I tend to ignore them when/if they come thru and the group tends to deal with them on thier end by blocking them out. \n\nI use to see alot more of that nature when I was at the early stages. I also saw alot more of the &quot;help me&quot; types. I dont hear many of those anymore, but now and then I do hear someone being shown the way to the light or being ejected from communicating if the group thinks they shouldnt be part of the session taking place.\n\nMisty\n\n\n--- On Wed, 9/17/08, ourobouros2k2 &lt;ourobouros2k2@...&gt; wrote:\n\n&gt; From: ourobouros2k2 &lt;ourobouros2k2@...&gt;\n&gt; Subject: [EVP-ITC] Darkheads, what are they?\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Wednesday, September 17, 2008, 10:55 PM\n&gt; Since my limited experiences have always been neutral or\n&gt; positive in\n&gt; nature, I was wondering what exactly these darkhead\n&gt; entities were. The\n&gt; information I have been able to glean off the internet so\n&gt; far has been\n&gt; fragmented, and mentions of them have always seemed to be\n&gt; like an\n&gt; afterthought. I was just curious if they are negative\n&gt; entities that\n&gt; attach and make life miserable for the operator or if they\n&gt; are merely\n&gt; spectral bullies that keep other entities from properly\n&gt; communicating\n&gt; during a session. I have seen them mentioned in passing\n&gt; here and other\n&gt; boards dedicated to itc/evp. \n&gt; \n&gt; thanks in advance,\n&gt; Andy"}