{"id": "12185", "subject": "Re: Something interesting...", "author": "ourobouros2k2", "timestamp": "2008-09-18T23:44:25Z", "full_text": "I certainly agree that the religious or fundamentalists are the first\nto jump to fear and fear mongering. I have seen this over and over\nagain in standard paranormal research, and it can be frustrating when\nyou know there is legitimate phenomena going on and you simply want to\nrecord it, yet everyone associated with the location brands you a\nsatanist and even puts you on their prayer list for soul rescue. One\nof many factors that cause me to abandon religion altogether. \n\nI guess I am being ultra cautious with ITC, simply because it is\nsomething that is very mysterious to me. I was very critical at first,\nand as I have often said, if not for an amazing first session, I would\nlikely have given up early on. Guess until I understand more, I am\njust dealing with a mix of curiosity and cautiousness. \n\nthanks,\nAndy\n\n\n\n--- In EVP-ITC@yahoogroups.com, black bear hollow\n&lt;blackbearhollow@...&gt; wrote:\n&gt;\n&gt; Hi Andy,\n&gt; \n&gt; You know you bring up an interesting point. I was just speaking with  \n&gt; another researcher, and there are a few in the EVP/ITC research field  \n&gt; who insist on what I refer to as &quot;egotizing&quot; spirits. It&#39;s remarkably  \n&gt; important to these individuals, usually of a certain gender (reason  \n&gt; unknown to me), to demonize spirits and insist on there being intense  \n&gt; evil spirits and holding onto the idea of fear. Perhaps the excitement  \n&gt; and adrenaline or are they  simply a host to their egos? I don&#39;t know.\n&gt; \n&gt; This isn&#39;t a judgment, but something I, and others, have observed over  \n&gt; the years. I&#39;m not saying this is you Andy as of course, I don&#39;t know  \n&gt; you. But it&#39;s an interesting phenomenon. I have to wonder if it isn&#39;t  \n&gt; due to religious ideas conceived by these same types of fear mongering  \n&gt; individuals who came up with the ideas of a &quot;hell&quot; and a vengeful mean  \n&gt; God, etc... which don&#39;t exist in my mind. All interesting to ponder!\n&gt; \n&gt; It never occurred to me to be afraid. The idea never entered my mind  \n&gt; until you now mention it, and I guess it&#39;s a matter of perception. You  \n&gt; could choose to see me as being a host to light bearing elementals,  \n&gt; devas, and angels or a slave to controlling self serving beings. It&#39;s  \n&gt; all your choice!\n&gt; \n&gt; I guess the real test of my being a host (as I like to perceive it  \n&gt; that way) to the elementals, will be next year! lol! Bonzai are like  \n&gt; babies... so much attention.\n&gt; \n&gt; w\n&gt; ॐ\n&gt; \n&gt; On Sep 18, 2008, at 10:17 AM, ourobouros2k2 wrote:\n&gt; \n&gt; &gt; Very cool, but on this flip side, very frightening. I guess I am a\n&gt; &gt; control freak, but seem scary to be able to be influenced like that.\n&gt; &gt; Guess I will leave my deflector shields on ;)\n&gt; &gt;\n&gt; &gt; Btw congrats on the flowers, I tried bonsai once, lol didn&#39;t fair to\n&gt; &gt; well for myself or the poor tree...\n&gt; &gt;\n&gt; &gt; thanks,\n&gt; &gt; Andy\n&gt;"}