{"id": "12180", "subject": "Re: Darkheads, what are they?", "author": "ourobouros2k2", "timestamp": "2008-09-18T14:06:54Z", "full_text": "Indeed thanks for the great information. I don&#39;t know why the thought\nof a social system on the otherside is any new surprise to me, but it\nmakes sense. I would think that there are probably the same amount of\nentities that would want to speak to as as there are us wishing to\ncommunicate with them. I guess traditionally when one thinks of\nparanormal research, we are already preboxing our thoughts to deal\nwith either the individual or small number with regards to spirits at\na specific location. Since ITC really know no bounds with regard to\nlocation, it only makes sense, yet never occurred to me before your\nreply Misty.\n\nThanks again\nAndy\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;threadsintyme@...&quot;\n&lt;Threadsintyme@...&gt; wrote:\n&gt;\n&gt; Misty,\n&gt; Sounds like they could be a part of the lower realm entities that we\nhad discussed some weeks or a month or so ago. \n&gt; Thanks for you highly informative post!\n&gt; Al\n&gt; \n&gt; -- Misty Dawn &lt;bulletbabea@...&gt; wrote:\n&gt; \n&gt; Mostly negative in nature. Frank S was first one I heard use that\nterm for it years ago. His meaning may differ from my own hehehe.\n&gt; \n&gt; To me negs are everywhere. I pass them on the street every day. They\nalso occasionaly come thru in spirit form tho they dont have much luck\ngetting thru the barrier these days here. Many people have spoken of\nbeing affected by what was said so much they stopped doing the work\ncompletely. I tend to ignore them when/if they come thru and the group\ntends to deal with them on thier end by blocking them out. \n&gt; \n&gt; I use to see alot more of that nature when I was at the early\nstages. I also saw alot more of the &quot;help me&quot; types. I dont hear many\nof those anymore, but now and then I do hear someone being shown the\nway to the light or being ejected from communicating if the group\nthinks they shouldnt be part of the session taking place.\n&gt; \n&gt; Misty\n&gt; \n&gt; --- On Wed, 9/17/08, ourobouros2k2 &lt;ourobouros2k2@...&gt; wrote:\n&gt; \n&gt; &gt; From: ourobouros2k2 &lt;ourobouros2k2@...&gt;\n&gt; &gt; Subject: [EVP-ITC] Darkheads, what are they?\n&gt; &gt; To: EVP-ITC@yahoogroups.com\n&gt; &gt; Date: Wednesday, September 17, 2008, 10:55 PM\n&gt; &gt; Since my limited experiences have always been neutral or\n&gt; &gt; positive in\n&gt; &gt; nature, I was wondering what exactly these darkhead\n&gt; &gt; entities were. The\n&gt; &gt; information I have been able to glean off the internet so\n&gt; &gt; far has been\n&gt; &gt; fragmented, and mentions of them have always seemed to be\n&gt; &gt; like an\n&gt; &gt; afterthought. I was just curious if they are negative\n&gt; &gt; entities that\n&gt; &gt; attach and make life miserable for the operator or if they\n&gt; &gt; are merely\n&gt; &gt; spectral bullies that keep other entities from properly\n&gt; &gt; communicating\n&gt; &gt; during a session. I have seen them mentioned in passing\n&gt; &gt; here and other\n&gt; &gt; boards dedicated to itc/evp. \n&gt; &gt; \n&gt; &gt; thanks in advance,\n&gt; &gt; Andy\n&gt; \n&gt; \n&gt;  \n&gt; ____________________________________________________________\n&gt; Are you safe? Click for quotes on a home security system. \n&gt;\nhttp://thirdpartyoffers.juno.com/TGL2131/fc/Ioyw6iif8bYCywiQ13Hdl2YMzjwS5EZfNOmnBGDGtzc54aID4A7sUE/\n&gt;"}