{"id": "12181", "subject": "Re: Something interesting...", "author": "ourobouros2k2", "timestamp": "2008-09-18T14:17:07Z", "full_text": "Very cool, but on this flip side, very frightening. I guess I am a\ncontrol freak, but seem scary to be able to be influenced like that.\nGuess I will leave my deflector shields on ;)\n\nBtw congrats on the flowers, I tried bonsai once, lol didn&#39;t fair to\nwell for myself or the poor tree...\n\nthanks,\nAndy\n\n\n\n--- In EVP-ITC@yahoogroups.com, black bear hollow\n&lt;blackbearhollow@...&gt; wrote:\n&gt;\n&gt; Hi all,\n&gt; \n&gt; I was laying in bed the other night thinking,  after having spent the  \n&gt; evening reading about fall gardening, how odd it was that mysteriously  \n&gt; I had planted every single plant, of the numerous perennials I have  \n&gt; been planting, as if I&#39;d read how to do it from a text book. No prior  \n&gt; knowledge of these plants prior to hastily wanting to get them in the  \n&gt; ground before the first freeze. And then it dawned on me, since I get  \n&gt; many evp&#39;s from beings who refer to themselves as nature spirits, that  \n&gt; perhaps those we record can (and do) influence us in many ways. ???  \n&gt; Just a thought.\n&gt; \n&gt; I have to wonder if I was being led on a subconscious level to plant  \n&gt; each species correctly. This idea also made me wonder how we are  \n&gt; influenced by spirit on a daily basis...\n&gt; \n&gt; Anyhoo, I&#39;ve been quiet as I&#39;m in a flurry to repot orchids and plant  \n&gt; perennials before the cold hits next month and with looking up species  \n&gt; for shady areas, I was surprised to find it was as if I had been had  \n&gt; led in planting each species correctly. Even the watering, etc...! The  \n&gt; good people of Findhorn (Scotland) and Perelandra (US) rely on  \n&gt; intuition and contact with nature to tend to their gardens. Perhaps  \n&gt; those of us that record are guided more than we think! Food for  \n&gt; thought. :)\n&gt; \n&gt; w.\n&gt; ॐ\n&gt;"}