{"id": "12209", "subject": "Re: [EVP-ITC] hello everyone", "author": "Misty Dawn", "timestamp": "2008-09-20T19:29:17Z", "full_text": "Welcome to the group. \n\nPlease use mp3 format to post audio files. And definitely small clips here. If you wish to post wav files, entire sessions,  or larger files use http://www.esnips.com to post and share with the group. They give you 50 GB free so you can post as much as you wish and share the links. It even has a nifty counter to let you know how many visited your files and a place they can leave comments.\n\nFiles that are large will ultimately be removed to make room for the group. Any and all files posted (even small and correct formats) are subject to removal when/if space becomes an issue. If everyone works together on corrcting this then it wont be a problem =)\n\nOver 400 people in the group, only 100 megs of space... the math on that is pretty simple. So we use other avenues for posting files such as attaching it to an email post or putting it on esnips or putfile etcetera.\n\nFor those who need it you can use the free online file convertor at \n\nhttp://media-convert.com/\n\nMisty\n\n--- On Sat, 9/20/08, nightparanormalresearch &lt;nightparanormalresearch@...&gt; wrote:\n\n&gt; From: nightparanormalresearch &lt;nightparanormalresearch@...&gt;\n&gt; Subject: [EVP-ITC] hello everyone\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Saturday, September 20, 2008, 12:08 PM\n&gt; I have posted a couple of standard evp files and before i\n&gt; post any \n&gt; box sessions iam wondering do you prefer an edited down\n&gt; version or \n&gt; all of the file.\n&gt; I guess i should introduce myself to the groupmy name is\n&gt; mike I \n&gt; belong to a none profit organization called Northern IL\n&gt; Ghost \n&gt; Hunting Team aka N.I.G.H.T or Night paranormal research I\n&gt; live in \n&gt; grand detoure IL right near oregon and dixon about 45min\n&gt; outside of \n&gt; rockford IL Ive been doing para research for awhile iam 31\n&gt; started \n&gt; reading books when i was in junior high and after high\n&gt; school did a \n&gt; little investigating and it has grown since then and no iam\n&gt; not part \n&gt; of the paranormal band wagon but I do think that the\n&gt; explosion of \n&gt; researchers is great the more the world raises ther\n&gt; conciosness of \n&gt; the paranormal the easier i theink it is for us to get good\n&gt; \n&gt; comunication files i have from 5 and 10 years ago are crap\n&gt; compared \n&gt; to what i get today wether its the technoligy or the effort\n&gt; iam not \n&gt; sure but its much easier to see ten lights then it is to\n&gt; see one .\n&gt; anyway i startes with an rs hack 469 back in nov 07 and the\n&gt; first \n&gt; thing to come across was &quot;mike are you there mike mike\n&gt; were did he \n&gt; go mike mike are you still ther&quot; I  did not hear it at\n&gt; the time but \n&gt; i did  continue asking questions and right after that i\n&gt; asked are \n&gt; you alwas hear or just hear because of the box and clear as\n&gt; i speak \n&gt; every day i heard &quot;THE BOX&quot; now those statements\n&gt; nfloored me and i \n&gt; was hooked ever since there is so much in just those 2\n&gt; ststments \n&gt; when the voice says WERE DID HE GO well who is he asking\n&gt; and then \n&gt; THE BOX well if its not your normal close doors and hear\n&gt; footsteps \n&gt; kind of spirit then who is it . these questions have driven\n&gt; me ever \n&gt; since \n&gt; I beleve the only way to further our research is to be open\n&gt; and \n&gt; honest and to shrare everything that comes along and i am\n&gt; hoping \n&gt; that is what everyone is hear to do iam very excited to be\n&gt; a part of \n&gt; this group. and any evidence i have gatherd any one hear is\n&gt; more \n&gt; than welcome to it iam trying to put a website togather now\n&gt; and i \n&gt; will be puting alot up ther so when thats done i look\n&gt; forward to \n&gt; your input.enjoy the files i have posted and feel free to\n&gt; give me \n&gt; your feedback id love to hear what everyone thinks the file\n&gt; named \n&gt; head is saying . \n&gt;                         Mike Wagner\n&gt;               nightparanormalresearch@..."}