{"id": "12220", "subject": "RE: [EVP-ITC] New messages posted", "author": "Misty Dawn", "timestamp": "2008-09-21T17:33:08Z", "full_text": "They have made mentions of it over the years including a recent statement pertaining to the contact world which I just posted over on my esnips from last session. They said when the contact world first began it was very hard, and that access was terrible. Perhaps it is easier with some of the newer methods researchers are using to maintain contact. Franks box has opened up a new avenue for those who had a hard time hearing the traditional forms of evp. \n\nWhen I ask what the best method for contact is they always maintain its the method that no words are necessary. Or as one stated recently (also posted on esnips in water files) &quot;I can telepathic, you just can&#39;t hear good telepathic&quot; &quot;it will always be tenuous&quot;. This coming after a few restless nights of being woken up to loud voices speaking to me or saying my name. Also a few things going on when I was wide awake and fully alert. \n\nI have also had some info come thru on &quot;stations&quot; and even one recording where voices I know seemed to jump from one group to another as I switched methods they could be heard introducing themselves to those surrounding them stating why they were barging in there to communicate. I find it all of interest tho it tends to be alot to wrap ones mind around.\n\nMisty Dawn\n\n\n--- On Sun, 9/21/08, Ron Lederer &lt;ronriko@...&gt; wrote:\n\n&gt; From: Ron Lederer &lt;ronriko@...&gt;\n&gt; Subject: RE: [EVP-ITC] New messages posted\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Sunday, September 21, 2008, 1:13 PM\n&gt; for Misty   Not a surprise here about ETs being\n&gt; involved.  From day one I have been sort of tracking what\n&gt; is reportedly said about &quot;who is involved and who is in\n&gt; charge&quot; of communications on the others side.  I hope\n&gt; more researchers ask the question so we can all compare\n&gt; notes.   For example, one evper report there are 10,000\n&gt; &quot;communications stations&quot; staffed on the other\n&gt; side.  My question are; staffed by who or what, what is\n&gt; their purpose, do they have regulations for what can be\n&gt; said to this side, and many, many more questions.  Like it\n&gt; has been said, if we knew all the answers this would not be\n&gt; research.  Hope to hear more on this from you and others. \n&gt; Thanks for that....ron\n&gt; \n&gt; --- On Sun, 9/21/08, Misty Dawn\n&gt; &lt;bulletbabea@...&gt; wrote:\n&gt; \n&gt; From: Misty Dawn &lt;bulletbabea@...&gt;\n&gt; Subject: RE: [EVP-ITC] New messages posted\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Sunday, September 21, 2008, 9:21 AM\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Thanks K yes most of it is very clear for me. I will try\n&gt; and get the rest of the files up in the next few days or so.\n&gt; My schedules a little crazy with work and life but I will\n&gt; get a couple days off later in the week to post more.\n&gt; \n&gt; Misty Dawn\n&gt; \n&gt; --- On Sun, 9/21/08, Kristin Morris &lt;ckmorris95@sbcgloba\n&gt; l.net&gt; wrote:\n&gt; \n&gt; &gt; From: Kristin Morris &lt;ckmorris95@sbcgloba l.net&gt;\n&gt; &gt; Subject: RE: [EVP-ITC] New messages posted\n&gt; &gt; To: EVP-ITC@yahoogroups .com\n&gt; &gt; Date: Sunday, September 21, 2008, 11:34 AM\n&gt; &gt; Hi Misty! I listened to the sweep files on your ESnips\n&gt; and\n&gt; &gt; they were\n&gt; &gt; incredible. Very clear and easily understandable - at\n&gt; &gt; least to me! Very\n&gt; &gt; cool validation for Andy. Congrats!\n&gt; &gt; \n&gt; &gt; K\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; _____ \n&gt; &gt; \n&gt; &gt; From: EVP-ITC@yahoogroups .com\n&gt; &gt; [mailto:EVP-ITC@yahoogroups .com] On Behalf Of\n&gt; &gt; Misty\n&gt; &gt; Sent: Sunday, September 21, 2008 9:57 AM\n&gt; &gt; To: EVP-ITC@yahoogroups .com\n&gt; &gt; Subject: [EVP-ITC] New messages posted\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; Hello everyone. I posted a few files from my recent\n&gt; sweep\n&gt; &gt; tuning \n&gt; &gt; session. I will try and post more from it later when I\n&gt; get\n&gt; &gt; time. There \n&gt; &gt; was one very lengthy message that seemed to be a\n&gt; higher\n&gt; &gt; level &#39;poetic&#39; \n&gt; &gt; type voice. Also some messages involving a new member\n&gt; to\n&gt; &gt; our group. \n&gt; &gt; It&#39;s up to him if he wants to share his\n&gt; experiences.\n&gt; &gt; However I did post \n&gt; &gt; the one file with his name because it has some\n&gt; significant\n&gt; &gt; meaning to \n&gt; &gt; me that I explained on the file post there. It\n&gt; reminded me\n&gt; &gt; of something \n&gt; &gt; Frank Sumption sent me years ago when I was a newbie\n&gt; and\n&gt; &gt; had the same \n&gt; &gt; effect on me that it had on the new member.\n&gt; &gt; \n&gt; &gt; http://www.esnips.\n&gt; &gt; &lt;http://www.esnips. com/web/SweepTun ingEVP&gt;\n&gt; &gt; com/web/SweepTuning EVP\n&gt; &gt; \n&gt; &gt; Misty Dawn"}