{"id": "12234", "subject": "UPDATE: keep us in your thoughts", "author": "M.A. Coletta (Mike)", "timestamp": "2008-09-24T17:19:32Z", "full_text": "Here is an update:\n\nSearch for missing Moline woman &#39;too dangerous&#39; around dam\nBy Dustin Lemmon | Wednesday, September 24, 2008\n\nUPDATED: Capt. Greg Hunter of the Illinois Conservation Police said a \nMoline woman was about 25 yards upstream when she was sucked in to \nthe Rock River current and went over the Milan Steel Dam.\n\nHe said one conservation officer is searching the river today with \nlocal fire departments. They will probably search the water&#39;s surface \nfor Kristina Ornelis for three days before calling it off. She \ndisappeared into the stream about 3 p.m. Tuesday.\n\nHunter said it is too dangerous around the dam to continue to drag \nthe bottom or send in divers. He said two rescue workers had to be \nrescued from a boat yesterday after it was sucked into the flow.\n\n&quot;It&#39;s just too dangerous to do a recovery effort around that boil,&quot; \nhe said. &quot;You simply can&#39;t endanger the safety of the rescue workers.&quot;\n\nA hydraulic just below the dam spins the water in a circle, kicking \nobjects back toward the dam, Hunter said. He said even experienced \nrescue workers would be lucky to escape the hydraulic.\n\nA boil or rise in the water that forms just past the hydraulic is \nconsidered the point of no return, Hunter said. Once past that point, \na boat or person will be sucked under and trapped in the spin.\n\nMhisho Vuong of Davenport, said she was at the scene fishing with her \nboyfriend and his brother shortly before the incident happened. She \ndidn&#39;t know Ornelis or the two women she was with but said the women \nhad a little boy and were wading into the water. She said her \nboyfriend had to help one of them out after the current started to \npull the woman downstream.\n\n&quot;We left just because we didn&#39;t want to be there if something \nhappened,&quot; she said, noting her boyfriend warned the women to be \ncareful.\n\nHunter said Milan police are investigating to find out what happened \nbefore Ornelis was pulled downstream by the current. He noted that \nthe dam is dangerous and that people should not be swimming or wading \nin the water when it is as high as it is now.\n\n&quot;The public needs to realize how dangerous these are,&quot; he said. &quot;Low \nhead dams are structures that need tremendous respect.&quot;\n\nDustin Lemmon can be contacted at (563) 383-2493 or \ndlemmon@....\n\n--- In EVP-ITC@yahoogroups.com, &quot;M.A. Coletta (Mike)&quot; \n&lt;michaelcoletta@...&gt; wrote:\n&gt;\n&gt; For those wanting to know more for your investigative sessions, \nhere \n&gt; are some links to the missing daughter story.\n&gt; This information may assist you with your attempt at contact.\n&gt; \n&gt; \n&gt; \nhttp://www.qctimes.com/articles/2008/09/24/news/local/doc48d95b5972dae\n&gt; 009315224.txt?sPos=3\n&gt; \n&gt; http://www.qconline.com/archives/qco/display.php?id=405941\n&gt; \n&gt; http://www.wqad.com/global/story.asp?s=9062784\n&gt; \n&gt; http://www.kwqc.com/Global/story.asp?S=9060540\n&gt; \n&gt; http://www.whbf.com/\n&gt; \n&gt; - Mike\n&gt; --- In EVP-ITC@yahoogroups.com, &quot;M.A. Coletta (Mike)&quot; \n&gt; &lt;michaelcoletta@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hello Tammi,\n&gt; &gt; \n&gt; &gt; I am very sorry this has happened to you and your family.  I pray \n&gt; for \n&gt; &gt; the safe return of her, but if that is not possible I hope for a \n&gt; &gt; recovery so there is closure.\n&gt; &gt; I also hope someone in our group is able to help locate an area \nto \n&gt; &gt; search.  I&#39;m sure there are some in the group who are already \n&gt; working \n&gt; &gt; on your request.\n&gt; &gt; We have many here who have been very successful at contacting \nthose \n&gt; &gt; who may be able to help, using the numerous devices available.\n&gt; &gt; \n&gt; &gt; I&#39;m sure those involved will contact you if an answer is found.\n&gt; &gt; Again, I pray for things to work out, you are in all our prayers.\n&gt; &gt; \n&gt; &gt; - Mike Coletta\n&gt; &gt; UFOMagazine.net\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;mamahaugs&quot; &lt;mamahaugs@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; Hi I am newer to this sight I enjoy reading all your messages. \nMy \n&gt; &gt; step \n&gt; &gt; &gt; daughter Nina Ornelis disappered in the Rock River yesterday \n&gt; &gt; afternoon \n&gt; &gt; &gt; around 2:30 search starts again at daybreak. and if anyone can \n&gt; &gt; check \n&gt; &gt; &gt; the otherside if you happen to find out where we should be \n&gt; looking \n&gt; &gt; &gt; please call Tammi at 641 782-5914. My husband name is Rich. \n&gt; Thanks \n&gt; &gt; &gt; Tammi\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}