{"id": "12243", "subject": "Re: new type of Franks Box ?", "author": "M.A. Coletta (Mike)", "timestamp": "2008-09-26T19:12:04Z", "full_text": "I was with the understanding that these &#39;telephone pickup devices&#39;  \nworked on the principle of mutual induction or inductive transfer. \nTheir designed use is for being placed onto a telephone handset where \nthere is a magnetic induction field which radiates the audio signal \nfrom the telephone receiver.\nThat induction field is picked up by the coil inside the &#39;telephone \npickup devices&#39; and the energy (current changes, etc.) is transferred \ndown the wire and into a device that can record or play (audio) what \nis being picked up by the &#39;telephone pickup device&#39;.\n\nSo... it appears to me that this attempted association with Frank&#39;s \nBox in their ad is a complete false bit of advestising.\nThe &#39;Frank&#39;s Box&#39; as we all know does not work under this principle.\n\nWhat the advertised device appears to do, or attempts to do, is \nsearch for magnetic fields and produces some kind of sound when it \nfinds them...???  The association with Frank&#39;s Box is for advertising \npurposes only I&#39;m guessing...\nA way to sucker in those not knowing this.\n\n- Mike Coletta\nhttp://www.UFOMagazine.net\nUnidentified Frequency Oscillations Magazine on-line\n\n--- In EVP-ITC@yahoogroups.com, &quot;ourobouros2k2&quot; &lt;ourobouros2k2@...&gt; \nwrote:\n&gt;\n&gt; This is basically the &quot;buzz stick&quot; setup from lessemf.com Any \nsuction \n&gt; cup type mic pickup and amplified speaker can work in a similar \nfashion \n&gt; as it is basically a single axis emf probe. I suppose according to \nthe \n&gt; traditional evp coil induction theory that it could work, but about \n4 \n&gt; years ago I did extensive testing with this type of pickup on a \nyamaha \n&gt; 4 track recorder with diodes and microphones on other tracks. The \nonly \n&gt; success I had was with the tracks that had a regular microphone \n&gt; attached. As I understand it, this device transforms the em \nfrequency \n&gt; to it&#39;s corresponsing audible frequency, sortof a &quot;reverse mic&quot;.\n&gt; \n&gt; I have never had any success in it&#39;s use, but it certainly is a \ncheap \n&gt; way to experiment. I don&#39;t see a connection to a Frank&#39;s box by \n&gt; functionality, Frank&#39;s boxes and similar model ghost boxes are much \n&gt; more complex and sophisticated. You can think of the above as an \n&gt; audible emf sensor.\n&gt; \n&gt; Hope it helps,\n&gt; Andy\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;angels4lyn&quot; &lt;angels4lyn@&gt; wrote:\n&gt; &gt;\n&gt; &gt; \n&gt; &gt; what can ya&#39;ll tell me about this item ?\n&gt; &gt; \n&gt; &gt; REAL TIME EVP CONVERTER - HEAR EVP&#39;S AS THEY HAPPEN \n&gt; &gt; DESIGNED FROM THE FRANK BOX  \n&gt; &gt; (pic attached)\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; Lyn\n&gt; &gt;\n&gt;"}