{"id": "12257", "subject": "Re: My EVP & ITC experimentation systems tour", "author": "M.A. Coletta (Mike)", "timestamp": "2008-09-28T17:46:10Z", "full_text": "Hi Al,\n\nTo answer your first question I provide this link:\nhttp://www.youtube.com/watch?v=3S-4e-wxd6U\nIt&#39;s a video that better explains how I think it might work. (Just a \ncouple of possibilites).\n\nTo answer your second question... I have done three experimentation \nsessions so far, and the results differ.  In one I got no response, \nand in the other two I did get action but I&#39;m unsure on what caused \nit.  I&#39;m reviewing it further.\n\nMy use of the Ion lamp, which is away from the traditional &#39;video-\nloop&#39; method is based on things I&#39;ve read from those who were into \nthis EVP/ITC thing way before us.  Back in the 1960&#39;s there was much \nexperimentation going on that involved a varied range of frequencies, \nincluding light frequencies.  Even house plants were considered into \nthe EVP/ITC equation (Maybe I&#39;ll try that next).\n\nMy use of the Ion lamp goes along with a continued desire to further \nthe work of the dedicated group from the 1960&#39;s... and continue to \nsee if &#39;other&#39; ideas work.\n\nAfter all... sweeping radio signals, and snowy video pictures are \nonly a couple of snippets of the frequencies available for \nexperimentation.  Even my limited idea of what the Ion lamp might do \ncould be way off... but I have to try it.  I might be surprised what \nit might be capable of.  It might not only offer increased intensity \nand stimulation. Maybe it could even offer more than that.\n\nI&#39;ll keep trying new things... and I&#39;ll make sure to share them with \nthe group.\n\nThanks for asking...\n\n- Mike\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;threadsintyme@...&quot; \n&lt;Threadsintyme@...&gt; wrote:\n&gt;\n&gt; An interesting setup, Mike...\n&gt; I do have a question though.,..what is the ion lamp for? \n&gt; Have you had any success photographing any spirits?\n&gt; Al\n&gt; \n&gt; -- &quot;M.A. Coletta (Mike)&quot; &lt;michaelcoletta@...&gt; wrote:\n&gt; \n&gt; For those who care to see... I&#39;ve posted a quick 4 minute video \ntour of \n&gt; the EVP and ITC systems I use, with a quick explanation of their \nsetup.\n&gt; The video is at:\n&gt; http://www.youtube.com/watch?v=gyQKmBXY1ig\n&gt; \n&gt; Thanks...\n&gt; and have a super-natural paranormal day!\n&gt; - Mike Coletta\n&gt; http://www.ufomagazine.net\n&gt; \n&gt; \n&gt;  \n&gt; ____________________________________________________________\n&gt; Why not be a nutritionist? Get your degree fast. Click here!\n&gt; \nhttp://thirdpartyoffers.juno.com/TGL2131/fc/Ioyw6iigghw4QEfoKdRFTb6tZl\n7A9HxfE7oBo9puxsICje31N8YDBK/\n&gt;"}