{"id": "12289", "subject": "Re: My EVP & ITC experimentation systems tour", "author": "ourobouros2k2", "timestamp": "2008-09-30T00:24:14Z", "full_text": "Today was the first run of the brown noise session, I ran for about 10\nminutes, and upon review, there were some short contacts, one named\nMike interestingly advised &quot;empty&quot; when I asked what was in my left\nhand (he was correct, the item was in my right hand, I simply\nmisspoke). Today&#39;s session was abbreviated, I had poor reception for\nsome reason, the .469 was doing great, but the .120 was only receiving\nstrongly in FM. On the surface I would say it was a success, I will\nhave to correlate more sessions with white and pink noise loops to\ndetermine. \n\nOn a more personal note, I find brown/red noise a heckuva lot easier\non the ears since most of the amplitude of the signal is at lower\nfrequency. Reminds me of a large, fast river as heard from a bank.\n\nthanks,\nAndy\n\n--- In EVP-ITC@yahoogroups.com, &quot;M.A. Coletta (Mike)&quot;\n&lt;michaelcoletta@...&gt; wrote:\n&gt;\n&gt; Hi Andy,\n&gt; \n&gt; I have mostly worked with the white noise, when I insert any type \n&gt; noise.  Lately I&#39;ve been going &quot;noiseless&quot; and just letting the audio \n&gt; snippets come through... but when I do use it, I like the white.\n&gt; \n&gt; I guess because there is such a history with EVP and white noise.  \n&gt; They are like a team from way back.  So many EVP pioneers used it.\n&gt; \n&gt; Good idea you have with the DVD and looping track.  Any way you can \n&gt; insert the noise is helpful.\n&gt; I haven&#39;t used any brown or red... how is that working for you?\n&gt; \n&gt; And thanks for the kind words...\n&gt; - Mike\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;ourobouros2k2&quot; &lt;ourobouros2k2@&gt; \n&gt; wrote:\n&gt; &gt;\n&gt; &gt; Mike, quick question...I have been experimenting with a multichannel\n&gt; &gt; system inspired by your spiricomp system. Rather than adding the \n&gt; white\n&gt; &gt; noise at the computer recording stage, I have a standalone dvd \n&gt; player\n&gt; &gt; with a looping track. I have experimented with white and pink noise\n&gt; &gt; tracks, but was just curious which you have had the most success \n&gt; with.\n&gt; &gt; I also made a brown/red noise track, and wondered if you had\n&gt; &gt; experimented with that at all. \n&gt; &gt; \n&gt; &gt; Thanks in advance, you work has been very helpful in getting me\n&gt; &gt; started down this road.\n&gt; &gt; \n&gt; &gt; Thanks,\n&gt; &gt; Andy\n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;M.A. Coletta (Mike)&quot;\n&gt; &gt; &lt;michaelcoletta@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; For those who care to see... I&#39;ve posted a quick 4 minute video \n&gt; tour of \n&gt; &gt; &gt; the EVP and ITC systems I use, with a quick explanation of their \n&gt; setup.\n&gt; &gt; &gt; The video is at:\n&gt; &gt; &gt; http://www.youtube.com/watch?v=gyQKmBXY1ig\n&gt; &gt; &gt; \n&gt; &gt; &gt; Thanks...\n&gt; &gt; &gt; and have a super-natural paranormal day!\n&gt; &gt; &gt; - Mike Coletta\n&gt; &gt; &gt; http://www.ufomagazine.net\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}