{"id": "12328", "subject": "Re: The Ovilus", "author": "jimskinnard", "timestamp": "2008-10-03T01:34:12Z", "full_text": "--- In EVP-ITC@yahoogroups.com, &quot;jimskinnard&quot; &lt;joliet@...&gt; wrote:\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, &quot;John F&quot; &lt;jfrick45@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Well when my friend first started getting Seth she was also getting 08\n&gt; &gt; a lot, as well as hot and fell coming through a lot.\n&gt; &gt; \n&gt; &gt; Why would this being gravitate to various Ovilus&#39;? \n&gt; &gt; \n&gt; &gt; Has anyone got the word devil or the word graphines (whatever that\n&gt; &gt; is)? I&#39;ve had graphines come up many times, &quot;devil&quot; has come up once\n&gt; &gt; and it was clear as could be but it really didn&#39;t have any context.\n&gt; Weird.\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;Maritza&quot; &lt;skandunas@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; - Hi Carol,\n&gt; &gt; &gt; Hello Everyone,I am old to the site but new to posting messages. \n&gt; &gt; &gt; Things have been to busy around here \n&gt; &gt; &gt; \n&gt; &gt; &gt; I also have the Ovilus\n&gt; &gt; &gt; &gt; I heard the names Seth, Amuel,Larry(Demon),Merrick, Samuel, Mott, \n&gt; &gt; &gt; Mel. I have the full name to the Seth person. He mentions several \n&gt; &gt; &gt; things so detailed. He also said he was from 1508 he fell, pain,\nhot, \n&gt; &gt; &gt; Also his last name is Saxton or he is from the town of Saxton in \n&gt; &gt; &gt; England?? He also said he was in my house behind me behind the\ncouch. \n&gt; &gt; &gt; Have you been hearing the same words? I will try to post the\nsession \n&gt; &gt; &gt; this weekend.\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; Thank you  Maritza\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; -- In EVP-ITC@yahoogroups.com, &quot;Carol B.&quot; &lt;cbreck@&gt; wrote:\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; I have a puck, and I have been getting the name Seth too.  I also \n&gt; &gt; &gt; have had\n&gt; &gt; &gt; &gt; my puck give words that are not on the list.\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; Carol B.\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt;&gt; \n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; I&#39;m new here, but have been into paranormal research for 6\nyears \n&gt; &gt; &gt; now.\n&gt; &gt; &gt; &gt; &gt; I am the type of person that never gets EVP voices with a \n&gt; &gt; &gt; recorder so\n&gt; &gt; &gt; &gt; &gt; I thought I would experiment with things like the Frank&#39;s\nbox and\n&gt; &gt; &gt; &gt; &gt; Ovilus. I recently got the ovilus and brought it to a\ncemetery and\n&gt; &gt; &gt; &gt; &gt; field where a church burned down many years ago. I can not\nget too\n&gt; &gt; &gt; &gt; &gt; specific without having people thinking I am making stuff up\nbut \n&gt; &gt; &gt; it\n&gt; &gt; &gt; &gt; &gt; got fairly wild towards the end of the session. For most of the \n&gt; &gt; &gt; time\n&gt; &gt; &gt; &gt; &gt; we were there the Ovilus seemed to be spitting out a lot of\nrandom\n&gt; &gt; &gt; &gt; &gt; stuff but it kept mentioning the name Seth. After we moved over \n&gt; &gt; &gt; to the\n&gt; &gt; &gt; &gt; &gt; field where the church was, the ovilus got a lot more active and\n&gt; &gt; &gt; &gt; &gt; started saying relevant words like cross and priest. The Ovilus \n&gt; &gt; &gt; was\n&gt; &gt; &gt; &gt; &gt; MUCH more active when being used by our female member. Towards \n&gt; &gt; &gt; the end\n&gt; &gt; &gt; &gt; &gt; the Ovilus said I am Seth, and the woman that was with me told \n&gt; &gt; &gt; Seth\n&gt; &gt; &gt; &gt; &gt; that she did not want to talk to you I&#39;ve heard bad things\nabout \n&gt; &gt; &gt; you.\n&gt; &gt; &gt; &gt; &gt; After that the Ovilus said rather nasty things to her and she \n&gt; &gt; &gt; started\n&gt; &gt; &gt; &gt; &gt; feeling nauseous and she ripped the headphones off her head. \n&gt; &gt; &gt; Needless\n&gt; &gt; &gt; &gt; &gt; to say we ended the session and got out of there.\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; Over the course of our investigation we found that the\nOvilus was\n&gt; &gt; &gt; &gt; &gt; saying many words that are not on the 500 word list, so\nyesterday \n&gt; &gt; &gt; I\n&gt; &gt; &gt; &gt; &gt; did some test recordings to see what words would come up and\none \n&gt; &gt; &gt; of\n&gt; &gt; &gt; &gt; &gt; the first things that came up was: seth  blamed  rest   I am\n  not\n&gt; &gt; &gt; &gt; &gt; gare   demon (all in that order). Needless to say this has me\n&gt; &gt; &gt; &gt; &gt; concerned that whatever seth is is still with the box so I\nam not \n&gt; &gt; &gt; even\n&gt; &gt; &gt; &gt; &gt; storing this thing inside of my house. I have an MP3 of the\novilus\n&gt; &gt; &gt; &gt; &gt; saying this.\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; Also from my experience about 50% of the words it is saying \n&gt; &gt; &gt; aren&#39;t on\n&gt; &gt; &gt; &gt; &gt; the list. Chris Fleming has been getting words not on the list, \n&gt; &gt; &gt; and\n&gt; &gt; &gt; &gt; &gt; Barry FitzGerald has stated that just over 50% of the words\nhe is\n&gt; &gt; &gt; &gt; &gt; getting are not on the list. Is there really a much larger list \n&gt; &gt; &gt; than\n&gt; &gt; &gt; &gt; &gt; advertised or is this thing really magic? Highly doubtful IMO.\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; My most important question is is anyone else getting the name \n&gt; &gt; &gt; Seth out\n&gt; &gt; &gt; &gt; &gt; of the Ovilus? How many people use this device here?\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt; \n&gt; To Carol B.\n&gt; \n&gt; I would turn the the olivus on and then ask your spirit guide to tell\n&gt; seth to leave. Seth needs to go back to his side, sounds like he is\n&gt; trapped on your side with the olivus. If you haven&#39;t already always\n&gt; start a session with asking for protection. I am not sure what you\n&gt; would say if you do not have a spirit guide that you know of. Someone\n&gt; on this board or the other yahoo board recently posted a file that\n&gt; address the protection issue. As ALWAYS ask the spirits to go back to\n&gt; there side before you close a session. I always try to confirm with my\n&gt; spirit guide/tech before shutting down. I address my guide directly to\n&gt; send all the spirits back(she knows how to do it real good). Being\n&gt; skeptical will not help you if you have a undesirable spirit hanging\n&gt; around. Ask your guide to specifically never let seth in again. \n&gt; \n&gt; Jim S.\n&gt;\nTo Carol B:\nSorry to post again so soon on this subject, but there maybe another\nissue going on here. Seth may need to be released to go be with his\nloved ones. You as a human can do that, the spirits alone are not\ncapable of doing that(IMHO). Send seth to goto the light and be with\nhis loved ones. That should relieve you and &quot;free&quot; seth. If he does\nnot want to go it should not harm to do this(again IMO) But if you are\njust scared of him then probably protect yourself by having him\nbanned. I would not do this activity though if your afraid. If your\nthreatened(then you can be afraid) yes the spirit needs to never\ncontact you again.\nJust some obs.\n \nJim S."}