{"id": "12325", "subject": "Re: The Ovilus", "author": "John F", "timestamp": "2008-10-02T22:45:48Z", "full_text": "Well when my friend first started getting Seth she was also getting 08\na lot, as well as hot and fell coming through a lot.\n\nWhy would this being gravitate to various Ovilus&#39;? \n\nHas anyone got the word devil or the word graphines (whatever that\nis)? I&#39;ve had graphines come up many times, &quot;devil&quot; has come up once\nand it was clear as could be but it really didn&#39;t have any context. Weird.\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;Maritza&quot; &lt;skandunas@...&gt; wrote:\n&gt;\n&gt; - Hi Carol,\n&gt; Hello Everyone,I am old to the site but new to posting messages. \n&gt; Things have been to busy around here \n&gt; \n&gt; I also have the Ovilus\n&gt; &gt; I heard the names Seth, Amuel,Larry(Demon),Merrick, Samuel, Mott, \n&gt; Mel. I have the full name to the Seth person. He mentions several \n&gt; things so detailed. He also said he was from 1508 he fell, pain, hot, \n&gt; Also his last name is Saxton or he is from the town of Saxton in \n&gt; England?? He also said he was in my house behind me behind the couch. \n&gt; Have you been hearing the same words? I will try to post the session \n&gt; this weekend.\n&gt; &gt; \n&gt; &gt; Thank you  Maritza\n&gt; &gt; \n&gt; &gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; -- In EVP-ITC@yahoogroups.com, &quot;Carol B.&quot; &lt;cbreck@&gt; wrote:\n&gt; &gt;\n&gt; &gt; I have a puck, and I have been getting the name Seth too.  I also \n&gt; have had\n&gt; &gt; my puck give words that are not on the list.\n&gt; &gt; \n&gt; &gt; Carol B.\n&gt; &gt; \n&gt; &gt; \n&gt; &gt;&gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; I&#39;m new here, but have been into paranormal research for 6 years \n&gt; now.\n&gt; &gt; &gt; I am the type of person that never gets EVP voices with a \n&gt; recorder so\n&gt; &gt; &gt; I thought I would experiment with things like the Frank&#39;s box and\n&gt; &gt; &gt; Ovilus. I recently got the ovilus and brought it to a cemetery and\n&gt; &gt; &gt; field where a church burned down many years ago. I can not get too\n&gt; &gt; &gt; specific without having people thinking I am making stuff up but \n&gt; it\n&gt; &gt; &gt; got fairly wild towards the end of the session. For most of the \n&gt; time\n&gt; &gt; &gt; we were there the Ovilus seemed to be spitting out a lot of random\n&gt; &gt; &gt; stuff but it kept mentioning the name Seth. After we moved over \n&gt; to the\n&gt; &gt; &gt; field where the church was, the ovilus got a lot more active and\n&gt; &gt; &gt; started saying relevant words like cross and priest. The Ovilus \n&gt; was\n&gt; &gt; &gt; MUCH more active when being used by our female member. Towards \n&gt; the end\n&gt; &gt; &gt; the Ovilus said I am Seth, and the woman that was with me told \n&gt; Seth\n&gt; &gt; &gt; that she did not want to talk to you I&#39;ve heard bad things about \n&gt; you.\n&gt; &gt; &gt; After that the Ovilus said rather nasty things to her and she \n&gt; started\n&gt; &gt; &gt; feeling nauseous and she ripped the headphones off her head. \n&gt; Needless\n&gt; &gt; &gt; to say we ended the session and got out of there.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Over the course of our investigation we found that the Ovilus was\n&gt; &gt; &gt; saying many words that are not on the 500 word list, so yesterday \n&gt; I\n&gt; &gt; &gt; did some test recordings to see what words would come up and one \n&gt; of\n&gt; &gt; &gt; the first things that came up was: seth  blamed  rest   I am   not\n&gt; &gt; &gt; gare   demon (all in that order). Needless to say this has me\n&gt; &gt; &gt; concerned that whatever seth is is still with the box so I am not \n&gt; even\n&gt; &gt; &gt; storing this thing inside of my house. I have an MP3 of the ovilus\n&gt; &gt; &gt; saying this.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Also from my experience about 50% of the words it is saying \n&gt; aren&#39;t on\n&gt; &gt; &gt; the list. Chris Fleming has been getting words not on the list, \n&gt; and\n&gt; &gt; &gt; Barry FitzGerald has stated that just over 50% of the words he is\n&gt; &gt; &gt; getting are not on the list. Is there really a much larger list \n&gt; than\n&gt; &gt; &gt; advertised or is this thing really magic? Highly doubtful IMO.\n&gt; &gt; &gt;\n&gt; &gt; &gt; My most important question is is anyone else getting the name \n&gt; Seth out\n&gt; &gt; &gt; of the Ovilus? How many people use this device here?\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}