{"id": "12327", "subject": "Re: The Ovilus", "author": "John F", "timestamp": "2008-10-02T18:58:07Z", "full_text": "The software that came with my ovilus has a list on it. I can email\nyou the list if you&#39;d like to have it.\n\nHow much have you used your Ovilus? Have you used it enough to get\nanywhere near hearing all of the supposed 512 words?\n\n\n\n--- In EVP-ITC@yahoogroups.com, black bear hollow\n&lt;blackbearhollow@...&gt; wrote:\n&gt;\n&gt; I don&#39;t get the name Seth from my Ovilis. Where did\n&gt; You get a list of words the Ovilus use?\n&gt; \n&gt; W.\n&gt; \n&gt; On Oct 2, 2008, at 12:27 PM, &quot;John F&quot; &lt;jfrick45@...&gt; wrote:\n&gt; \n&gt; &gt; I&#39;m new here, but have been into paranormal research for 6 years now.\n&gt; &gt; I am the type of person that never gets EVP voices with a recorder so\n&gt; &gt; I thought I would experiment with things like the Frank&#39;s box and\n&gt; &gt; Ovilus. I recently got the ovilus and brought it to a cemetery and\n&gt; &gt; field where a church burned down many years ago. I can not get too\n&gt; &gt; specific without having people thinking I am making stuff up but it\n&gt; &gt; got fairly wild towards the end of the session. For most of the time\n&gt; &gt; we were there the Ovilus seemed to be spitting out a lot of random\n&gt; &gt; stuff but it kept mentioning the name Seth. After we moved over to the\n&gt; &gt; field where the church was, the ovilus got a lot more active and\n&gt; &gt; started saying relevant words like cross and priest. The Ovilus was\n&gt; &gt; MUCH more active when being used by our female member. Towards the end\n&gt; &gt; the Ovilus said I am Seth, and the woman that was with me told Seth\n&gt; &gt; that she did not want to talk to you I&#39;ve heard bad things about you.\n&gt; &gt; After that the Ovilus said rather nasty things to her and she started\n&gt; &gt; feeling nauseous and she ripped the headphones off her head. Needless\n&gt; &gt; to say we ended the session and got out of there.\n&gt; &gt;\n&gt; &gt; Over the course of our investigation we found that the Ovilus was\n&gt; &gt; saying many words that are not on the 500 word list, so yesterday I\n&gt; &gt; did some test recordings to see what words would come up and one of\n&gt; &gt; the first things that came up was: seth blamed rest I am not\n&gt; &gt; gare demon (all in that order). Needless to say this has me\n&gt; &gt; concerned that whatever seth is is still with the box so I am not even\n&gt; &gt; storing this thing inside of my house. I have an MP3 of the ovilus\n&gt; &gt; saying this.\n&gt; &gt;\n&gt; &gt; Also from my experience about 50% of the words it is saying aren&#39;t on\n&gt; &gt; the list. Chris Fleming has been getting words not on the list, and\n&gt; &gt; Barry FitzGerald has stated that just over 50% of the words he is\n&gt; &gt; getting are not on the list. Is there really a much larger list than\n&gt; &gt; advertised or is this thing really magic? Highly doubtful IMO.\n&gt; &gt;\n&gt; &gt; My most important question is is anyone else getting the name Seth out\n&gt; &gt; of the Ovilus? How many people use this device here?\n&gt; &gt;\n&gt; &gt;\n&gt;"}