{"id": "12334", "subject": "Re: The Ovilus list", "author": "ourobouros2k2", "timestamp": "2008-10-03T06:00:01Z", "full_text": "Hope not to stray too far off topic, but I was listening to an older \ninterview with Jeff Belanger and the host, Dave Schrader said that \nwhile on a ghost hunt (I don&#39;t remember where, Rolling Hills perhaps) \nmany members present were getting the name &quot;Seth&quot; across multiple \nshack hack boxes. After hearing that, I remembered this thread and \nthe references to Seth. It is amazing how these entities use \nrecurring names for many different researchers using many different \nmethods. Anways, sorry for the OT.\n\nThanks\nAndy\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;John F&quot; &lt;jfrick45@...&gt; wrote:\n&gt;\n&gt; I considered doing that but its a very long list and I don&#39;t know if\n&gt; the guy that built the Ovilus would approve of the list being posted\n&gt; without permission.\n&gt; \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;threadsintyme@&quot;\n&gt; &lt;Threadsintyme@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Why don&#39;t you just post the list for the whole group? \n&gt; &gt; Al\n&gt; &gt; \n&gt; &gt; -- &quot;John F&quot; &lt;jfrick45@&gt; wrote:\n&gt; &gt; \n&gt; &gt; The software that came with my ovilus has a list on it. I can \nemail\n&gt; &gt; you the list if you&#39;d like to have it.\n&gt; &gt; \n&gt; &gt; How much have you used your Ovilus? Have you used it enough to get\n&gt; &gt; anywhere near hearing all of the supposed 512 words?\n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, black bear hollow\n&gt; &gt; &lt;blackbearhollow@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; I don&#39;t get the name Seth from my Ovilis. Where did\n&gt; &gt; &gt; You get a list of words the Ovilus use?\n&gt; &gt; &gt; \n&gt; &gt; &gt; W.\n&gt; &gt; &gt; \n&gt; &gt; &gt; On Oct 2, 2008, at 12:27 PM, &quot;John F&quot; &lt;jfrick45@&gt; wrote:\n&gt; &gt; &gt; \n&gt; &gt; &gt; &gt; I&#39;m new here, but have been into paranormal research for 6 \nyears\n&gt; now.\n&gt; &gt; &gt; &gt; I am the type of person that never gets EVP voices with a\n&gt; recorder so\n&gt; &gt; &gt; &gt; I thought I would experiment with things like the Frank&#39;s box \nand\n&gt; &gt; &gt; &gt; Ovilus. I recently got the ovilus and brought it to a \ncemetery and\n&gt; &gt; &gt; &gt; field where a church burned down many years ago. I can not \nget too\n&gt; &gt; &gt; &gt; specific without having people thinking I am making stuff up \nbut it\n&gt; &gt; &gt; &gt; got fairly wild towards the end of the session. For most of \nthe time\n&gt; &gt; &gt; &gt; we were there the Ovilus seemed to be spitting out a lot of \nrandom\n&gt; &gt; &gt; &gt; stuff but it kept mentioning the name Seth. After we moved \nover\n&gt; to the\n&gt; &gt; &gt; &gt; field where the church was, the ovilus got a lot more active \nand\n&gt; &gt; &gt; &gt; started saying relevant words like cross and priest. The \nOvilus was\n&gt; &gt; &gt; &gt; MUCH more active when being used by our female member. Towards\n&gt; the end\n&gt; &gt; &gt; &gt; the Ovilus said I am Seth, and the woman that was with me \ntold Seth\n&gt; &gt; &gt; &gt; that she did not want to talk to you I&#39;ve heard bad things \nabout\n&gt; you.\n&gt; &gt; &gt; &gt; After that the Ovilus said rather nasty things to her and she\n&gt; started\n&gt; &gt; &gt; &gt; feeling nauseous and she ripped the headphones off her head.\n&gt; Needless\n&gt; &gt; &gt; &gt; to say we ended the session and got out of there.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Over the course of our investigation we found that the Ovilus \nwas\n&gt; &gt; &gt; &gt; saying many words that are not on the 500 word list, so \nyesterday I\n&gt; &gt; &gt; &gt; did some test recordings to see what words would come up and \none of\n&gt; &gt; &gt; &gt; the first things that came up was: seth blamed rest I am not\n&gt; &gt; &gt; &gt; gare demon (all in that order). Needless to say this has me\n&gt; &gt; &gt; &gt; concerned that whatever seth is is still with the box so I am\n&gt; not even\n&gt; &gt; &gt; &gt; storing this thing inside of my house. I have an MP3 of the \novilus\n&gt; &gt; &gt; &gt; saying this.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Also from my experience about 50% of the words it is saying\n&gt; aren&#39;t on\n&gt; &gt; &gt; &gt; the list. Chris Fleming has been getting words not on the \nlist, and\n&gt; &gt; &gt; &gt; Barry FitzGerald has stated that just over 50% of the words \nhe is\n&gt; &gt; &gt; &gt; getting are not on the list. Is there really a much larger \nlist than\n&gt; &gt; &gt; &gt; advertised or is this thing really magic? Highly doubtful IMO.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; My most important question is is anyone else getting the name\n&gt; Seth out\n&gt; &gt; &gt; &gt; of the Ovilus? How many people use this device here?\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; \n&gt; &gt; \n&gt; &gt;  \n&gt; &gt; ____________________________________________________________\n&gt; &gt; Click for free information on court reporter careers, $100 per \nhour\n&gt; potential.\n&gt; &gt;\n&gt; \nhttp://thirdpartyoffers.juno.com/TGL2131/fc/Ioyw6iieWBbTYtuKzU2eLFZGSh\nTiP5wqFONJXlsSUMOZ7BQjMxjAuY/\n&gt; &gt;\n&gt;"}