{"id": "12350", "subject": "Re: The Ovilus", "author": "psi_research", "timestamp": "2008-10-04T10:17:38Z", "full_text": "Mik,\nYour post is the correct in that although Frank&#39;s Box has been the \ninspiration for many of us, the difference in how the raw audio is \nobtained is different form the Ovilus and Puck. Frank&#39;s Box uses \nbroadcast fragements for the source audio. The Ovilus and other \ndevices by Bill use voice synthesis triggered by environmental \nfactors. The concept is not identical and the source of the audio is \ndiffent. Although Bill may get harder to debunk results, Franks \nsomehow have more emotion. I really like both approachs, Franks \nmeesages are more personal and Bills are very relevent and of us syr \nlocation. I have learned to be one with Frank.\n\nIn the case of both devices, the FB tends to bond with the user and \nBills provides strong resultes relevent to the location. Both of us \nsolid, are ready. However, I am ready to takr embay or possing team. \n\nPlease challeng me to Puck amd ovilus sessions, I will win, or \nrather, the device will if I&quot;m distraction.. I an linked to me \nharware, and i alsways wind. In know that sounds cockey but Im bonded \nto my gear, My pieces I move are me. You will lose. Laterz&gt; \n\n\n\n\n\n\n\n\n\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;M.A. Coletta (Mike)&quot; \n&lt;michaelcoletta@...&gt; wrote:\n&gt;\n&gt; Hi Suzanne,\n&gt; \n&gt; The Ovilus and Frank&#39;s Box are two completely different animals, so-\n&gt; to-speak.\n&gt; One is a series of circuits that cause a radio frequency to sweep \n&gt; using a method of &quot;white noise&quot; to stimulate that sweep pattern, \n&gt; while the other is a series of digital circuits using a number of \n&gt; sensors(I&#39;m guessing)to stimulate speech and cascading LEDs to \n&gt; perform based on what mode it&#39;s in.\n&gt; \n&gt; My box was thrown together as a vacation hobby, with more added as \nI \n&gt; found more room to add... and as I found interesting devices on \n&gt; paranormal websites.\n&gt; I did scribble some schematics down as I went, and I guess I should \n&gt; try to gather those up and put together some sort of diagram.\n&gt; \n&gt; Let me work on that... in my spare time. :-)\n&gt; When I&#39;m done, I&#39;ll make sure to put it on my website, and notify \n&gt; everyone here.\n&gt; \n&gt; Have a super-natural paranormal day!\n&gt; \n&gt; - Mike Coletta\n&gt; http://www.ufomagazine.net\n&gt; The other kind of UFO...\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, suzanne bibb &lt;suzyq6819@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Interesting . . . I have often wondered if the Ovilus creator \nuses \n&gt; a similar design comparible to Frank&#39;s Box. Are schematics \navailable \n&gt; for the box you&#39;ve created Mike? My team is very interested in not \n&gt; just obtaining an Ovilus but understand the technology behind it. \n&gt; &gt; \n&gt; &gt; Suzanne May\n&gt; &gt; Director MMPS\n&gt; &gt; \n&gt; &gt; --- On Fri, 10/3/08, M.A. Coletta (Mike) &lt;michaelcoletta@&gt; wrote:\n&gt; &gt; \n&gt; &gt; From: M.A. Coletta (Mike) &lt;michaelcoletta@&gt;\n&gt; &gt; Subject: [EVP-ITC] Re: The Ovilus\n&gt; &gt; To: EVP-ITC@yahoogroups.com\n&gt; &gt; Date: Friday, October 3, 2008, 11:58 AM\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; Interesting. .. so this device senses changing temperatures, etc \n&gt; and \n&gt; &gt; begins speaking differents words or phrases with these changes?\n&gt; &gt; \n&gt; &gt; Humm... that 8-in-one paranormal box I put together a while back \n&gt; &gt; senses many different things also, but I never thought about \n&gt; putting \n&gt; &gt; those sensor inputs into a chip that speaks. I now uses meters \nand \n&gt; &gt; lights, and alarms when the thing senses different things. But \nI&#39;m \n&gt; &gt; guessing I can tap into the circuits and pick a place where the \n&gt; &gt; different voltages (ever changing) are and put those into the \ninput \n&gt; &gt; of a speaking chip.\n&gt; &gt; \n&gt; &gt; Humm... I may just have to open it up again and see what I can \ndo...\n&gt; &gt; \n&gt; &gt; - Mike\n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups .com, &quot;John F&quot; &lt;jfrick45@ .&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; Below are responses to 2 different messages in this thread:\n&gt; &gt; &gt; \n&gt; &gt; &gt; --- In EVP-ITC@yahoogroups .com, &quot;Carol B.&quot; &lt;cbreck@&gt; wrote:\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; I have a puck, and I have been getting the name Seth too. I \nalso\n&gt; &gt; &gt; have had\n&gt; &gt; &gt; &gt; my puck give words that are not on the list.\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; Carol B.\n&gt; &gt; &gt; \n&gt; &gt; &gt; Thanks for letting me know. Am I right that the puck list is \nthe \n&gt; &gt; same\n&gt; &gt; &gt; as the Ovilus word list?\n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; --- In EVP-ITC@yahoogroups .com, suzanne bibb &lt;suzyq6819@&gt; \nwrote:\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; My team has not yet purchased the Ovilus but I have been told \n&gt; that\n&gt; &gt; &gt; it has the ability to form words that have not been programmed \n&gt; into\n&gt; &gt; &gt; it. Since I have never used one, I am wondering what are the\n&gt; &gt; &gt; similarities between the Ovilus and Frank&#39;s Box. Could it be \nat \n&gt; all\n&gt; &gt; &gt; possible that rather than just forming words or sounds based on\n&gt; &gt; &gt; atmospheric readings, spirits are speaking through the Ovilus \nas \n&gt; &gt; they\n&gt; &gt; &gt; do Frank&#39;s box? \n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; I don&#39;t mean to sound silly or presumptous, but I am very very\n&gt; &gt; &gt; curious!! I am looking forward to purchasing the Ovilus as \nwell \n&gt; as\n&gt; &gt; &gt; the puck in the near future! Thanks for any feedback onthe \n&gt; Ovilus!\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; The Ovilus has the ability to form words in the phonetic mode, \n&gt; &gt; which I\n&gt; &gt; &gt; was not using. Does it have the ability to form words in the\n&gt; &gt; &gt; dictionary mode? I do not know. It would seem unlikely. Can \n&gt; spirits\n&gt; &gt; &gt; speak through the Ovilus like they do Frank&#39;s box? Maybe. \nFrank&#39;s \n&gt; &gt; box\n&gt; &gt; &gt; has a lot of white noise that can possibly be manipulated by \n&gt; spirits\n&gt; &gt; &gt; into giving us messages, but the ovilus has words programmed \ninto \n&gt; &gt; it&#39;s\n&gt; &gt; &gt; memory, it would probably take a lot more for entities to \ninject a\n&gt; &gt; &gt; word into the computer&#39;s memory than to inject a word into white\n&gt; &gt; &gt; noise. A lot of the words that are coming through that are not \non \n&gt; &gt; the\n&gt; &gt; &gt; list is meaningless jibberish as the ovilus detects temperature\n&gt; &gt; &gt; changes and has nothing to do with the paranormal. I do not \n&gt; believe\n&gt; &gt; &gt; that the temperture changing could manipulate the components of \n&gt; this\n&gt; &gt; &gt; device to the degree that would be needed to actually create \nwords\n&gt; &gt; &gt; like it is doing. I am betting if enough people catalog words \n&gt; that \n&gt; &gt; it\n&gt; &gt; &gt; is saying we&#39;ll probably wind up with another 500 or so beyond \n&gt; what \n&gt; &gt; it\n&gt; &gt; &gt; was supposed to be capable of. \n&gt; &gt; &gt; \n&gt; &gt; &gt; I emailed the creator yesterday offering to send him sound \nfiles \n&gt; of\n&gt; &gt; &gt; the words I am getting so that he can properly identify which \nof \n&gt; the\n&gt; &gt; &gt; 512 words these are, but so far I have not heard back from him \nin\n&gt; &gt; &gt; regards to this. \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; --- On Thu, 10/2/08, Carol B. &lt;cbreck@&gt; wrote:\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; From: Carol B. &lt;cbreck@&gt;\n&gt; &gt; &gt; &gt; Subject: Re: [EVP-ITC] The Ovilus\n&gt; &gt; &gt; &gt; To: EVP-ITC@yahoogroups .com\n&gt; &gt; &gt; &gt; Date: Thursday, October 2, 2008, 1:12 PM\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; I have a puck, and I have been getting the name Seth too. I \nalso\n&gt; &gt; &gt; have had\n&gt; &gt; &gt; &gt; my puck give words that are not on the list.\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; Carol B.\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; I&#39;m new here, but have been into paranormal research for 6 \n&gt; &gt; years now.\n&gt; &gt; &gt; &gt; &gt; I am the type of person that never gets EVP voices with a \n&gt; &gt; recorder so\n&gt; &gt; &gt; &gt; &gt; I thought I would experiment with things like the Frank&#39;s \nbox \n&gt; &gt; and\n&gt; &gt; &gt; &gt; &gt; Ovilus. I recently got the ovilus and brought it to a \n&gt; cemetery \n&gt; &gt; and\n&gt; &gt; &gt; &gt; &gt; field where a church burned down many years ago. I can not \n&gt; get \n&gt; &gt; too\n&gt; &gt; &gt; &gt; &gt; specific without having people thinking I am making stuff \nup \n&gt; &gt; but it\n&gt; &gt; &gt; &gt; &gt; got fairly wild towards the end of the session. For most of \n&gt; the \n&gt; &gt; time\n&gt; &gt; &gt; &gt; &gt; we were there the Ovilus seemed to be spitting out a lot of \n&gt; &gt; random\n&gt; &gt; &gt; &gt; &gt; stuff but it kept mentioning the name Seth. After we moved \n&gt; over \n&gt; &gt; to the\n&gt; &gt; &gt; &gt; &gt; field where the church was, the ovilus got a lot more \nactive \n&gt; and\n&gt; &gt; &gt; &gt; &gt; started saying relevant words like cross and priest. The \n&gt; Ovilus \n&gt; &gt; was\n&gt; &gt; &gt; &gt; &gt; MUCH more active when being used by our female member. \n&gt; Towards \n&gt; &gt; the end\n&gt; &gt; &gt; &gt; &gt; the Ovilus said I am Seth, and the woman that was with me \n&gt; told \n&gt; &gt; Seth\n&gt; &gt; &gt; &gt; &gt; that she did not want to talk to you I&#39;ve heard bad things \n&gt; &gt; about you.\n&gt; &gt; &gt; &gt; &gt; After that the Ovilus said rather nasty things to her and \nshe \n&gt; &gt; started\n&gt; &gt; &gt; &gt; &gt; feeling nauseous and she ripped the headphones off her \nhead. \n&gt; &gt; Needless\n&gt; &gt; &gt; &gt; &gt; to say we ended the session and got out of there.\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; Over the course of our investigation we found that the \nOvilus \n&gt; &gt; was\n&gt; &gt; &gt; &gt; &gt; saying many words that are not on the 500 word list, so \n&gt; &gt; yesterday I\n&gt; &gt; &gt; &gt; &gt; did some test recordings to see what words would come up \nand \n&gt; &gt; one of\n&gt; &gt; &gt; &gt; &gt; the first things that came up was: seth blamed rest I am not\n&gt; &gt; &gt; &gt; &gt; gare demon (all in that order). Needless to say this has me\n&gt; &gt; &gt; &gt; &gt; concerned that whatever seth is is still with the box so I \nam \n&gt; &gt; not even\n&gt; &gt; &gt; &gt; &gt; storing this thing inside of my house. I have an MP3 of the \n&gt; &gt; ovilus\n&gt; &gt; &gt; &gt; &gt; saying this.\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; Also from my experience about 50% of the words it is saying \n&gt; &gt; aren&#39;t on\n&gt; &gt; &gt; &gt; &gt; the list. Chris Fleming has been getting words not on the \n&gt; list, \n&gt; &gt; and\n&gt; &gt; &gt; &gt; &gt; Barry FitzGerald has stated that just over 50% of the words \n&gt; he \n&gt; &gt; is\n&gt; &gt; &gt; &gt; &gt; getting are not on the list. Is there really a much larger \n&gt; list \n&gt; &gt; than\n&gt; &gt; &gt; &gt; &gt; advertised or is this thing really magic? Highly doubtful \nIMO.\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; My most important question is is anyone else getting the \nname \n&gt; &gt; Seth out\n&gt; &gt; &gt; &gt; &gt; of the Ovilus? How many people use this device here?\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}