{"id": "12397", "subject": "Re: [EVP-ITC] Re: The Ghost Box, is training required?", "author": "Zack Widup", "timestamp": "2008-10-09T13:56:10Z", "full_text": "I have noticed when doing any sort of paranormal research that it is \nalways best to do so when in a calm or happy state of mind and not when \nyou&#39;re upset or angry. Spirits pick up on this and it agitates them, from \nwhat I&#39;ve noticed.\n\nFrank gave out the boxes he made without any instructions for them, and as \nfar as I can tell most people who received them learned from using them \nhow to make them work. I think in this field that is the way to go about \nit. If someone has some tips, that&#39;s fine. I&#39;ve picked up some tips and \nother things from other paranormal researchers, such as some suggestions \non how to ask questions for EVP sessions and some recommended questions, \nand what not to do, but a lot of it boils down to common sense.\n\nZack\n\n\nOn Thu, 9 Oct 2008, ourobouros2k2 wrote:\n\n&gt; Ya know, after thinking about the comment, the one point I can agree\n&gt; on is that a person should be of a responsible, generally positive\n&gt; mindset. More of a common sense thing, I could agree that box research\n&gt; isn&#39;t meant for everyone nor is it everyone&#39;s cup of tea. Reckless use\n&gt; can bring negative results and that is a very real possibility, so\n&gt; definately not for the faint of heart.\n&gt;\n&gt; That being said, the training issue boils down to a user&#39;s intent and\n&gt; responsibility to learn and take precaution. And I didn&#39;t even need 30\n&gt; qualified operators to tell me that, lol. BTW, blind leading the\n&gt; greedy comment....epic :D\n&gt;\n&gt; thanks,\n&gt; Andy\n&gt;\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, &quot;M.A. Coletta (Mike)&quot;\n&gt; &lt;michaelcoletta@...&gt; wrote:\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; Last night on Haunted Times Magazine radio , guest Brian Harnois (Ghost\n&gt;&gt; Hunters International) told the radio listening audience that he didn&#39;t\n&gt;&gt; think anyone should use a Franks&#39; Box, (or a ghost box is what he was\n&gt;&gt; insinuating) unless they had training from Christopher Moon.\n&gt;&gt; So... that is the topic of my blog write-up this morning if you care to\n&gt;&gt; read it.\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt; http://ufomagazine.blogspot.com/2008/10/ghost-box-is-training-required.h&#92;\n&gt;&gt; tml\n&gt;&gt;\n&gt; &lt;http://ufomagazine.blogspot.com/2008/10/ghost-box-is-training-required.&#92;\n&gt;&gt; html&gt;\n&gt;&gt;\n&gt;&gt; http://ufomagazine.blogspot.com &lt;http://ufomagazine.blogspot.com/&gt;\n&gt;&gt;\n&gt;&gt; Thanks.... Mike Coletta\n&gt;&gt;\n&gt;&gt; http://www.ufomagazine.net &lt;http://www.ufomagazine.net/&gt;\n&gt;&gt;\n&gt;\n&gt;\n&gt;\n&gt; ------------------------------------\n&gt;\n&gt; Yahoo! Groups Links\n&gt;\n&gt;\n&gt;\n&gt;"}