{"id": "12395", "subject": "Re: Next 820/goldBox Installment", "author": "ourobouros2k2", "timestamp": "2008-10-09T13:33:01Z", "full_text": "I am loving this design. October hitting me pretty hard but will try\nto scare up the jack to implement this design soon. thanks for your\nhard work and posting easy-to-follow instructions.\n\nthanks again,\nAndy\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;wgungfu&quot; &lt;wgungfu3@...&gt; wrote:\n&gt;\n&gt; Just put in several more pictures of the construction process in my\n&gt; goldBox directory:\n&gt; \n&gt; http://tech.groups.yahoo.com/group/EVP-ITC/files/Marty%27s%20goldBox/\n&gt; \n&gt; Added a SPST power switch to the 820 pcb just like explained in the\n&gt; last method.\n&gt; \n&gt; Constructed an echo box with removable input (so other future devices\n&gt; can be plugged in and the box reused ), and attached amplifier with. \n&gt; Also used quartz plates for the divider walls in an attempt to\n&gt; experiment in aiding in communication.  As always, I&#39;m trying to use\n&gt; slightly modded off the shelf parts for ease of duplication.\n&gt; \n&gt; Parts needed: \n&gt; \n&gt; - Radio Shack 6&quot; x 3&quot; x 2&quot; project box\n&gt; http://www.radioshack.com/product/index.jsp?productId=2062282\n&gt; \n&gt; - Radio Shack Deluxe Pillow Speaker (these are no longer sold on the\n&gt; site, and on clearance at local Radio Shack Locations.  Of note is\n&gt; this will accept a stereo signal and combine them to mono, instead of\n&gt; just ignoring one of the channels as some mono speakers do.\n&gt; http://www.radioshack.com/product/index.jsp?productId=2103574\n&gt; \n&gt; - Radio Shack Stereo Amplified Listener (33-1096).  This is a small\n&gt; amplifier with built in sensitive directional mics that are normally\n&gt; used for helping hard of hearing people hear better.  You may have\n&gt; seen cheaper versions on late night infomercials with spouses using\n&gt; these to listen to the tv at lower levels while not waking their\n&gt; husband/wife.\n&gt; http://www.radioshack.com/product/index.jsp?productId=2104056\n&gt; \n&gt; - 3 Quartz Plates 2&quot; x 2&quot; 1/8&quot;, from Prism Research Glass, Inc.\n&gt; http://www.prismresearchglassglass.com\n&gt; \n&gt; - Hot glue gun.\n&gt; \n&gt; \n&gt; To mod the pillow speaker, pry open the case with a screw driver. \n&gt; You&#39;ll notice that the wires connecting the speaker to the volume dial\n&gt; pcb are very short.  You&#39;ll simply need to desolder the wires and\n&gt; replace them with longer length wires.\n&gt; \n&gt; To mod the amplified listener, you&#39;ll remove the single screw holding\n&gt; the case together and pry open the case.  You&#39;ll see a piece of\n&gt; cardboard with shiny &quot;silver&quot; coating over half the pcb.  Carefully\n&gt; pull this off (I say carefully because its attached by a single\n&gt; soldered staple and industrial hot glue, with wires hidden underneath\n&gt; the cardboard.  The glue can pull the wires with it as you lift up). \n&gt; You&#39;ll see it comes with dual mics inside, you&#39;ll want to be careful\n&gt; to keep the mic heads clean from any particles or accidental contact\n&gt; from your fingers (always handle them by the attached rubber guards).\n&gt;  The mics suffer from the same problem as the pillow speaker, short\n&gt; wires.  You&#39;ll simply want to desolder them and reattach them with\n&gt; longer length wires.  I then reattach the protective cardboard piece\n&gt; with electrical tape, which I also use to mount it to the echo box. \n&gt; Leave the back side off, as it won&#39;t fit anymore with the new wiring. \n&gt; \n&gt; Use a hot glue gun to mount the pillow speaker and quartz plates\n&gt; inside the project case.  Make sure the speaker is &quot;floating&quot; (by\n&gt; gluing the foam backing of the speaker) and that the cone is not\n&gt; touching any of the box edges.  Also with the quartz plates, be sure\n&gt; to make sure and seal off the two edges of each plate that come in\n&gt; contact with the box walls.  I put a coat of glue directly on the\n&gt; plate edges, and then once seated in the box I run along the edges (as\n&gt; you see in the pics) to improve stability.\n&gt; \n&gt; Use electrical tape (or whatever else you like) to mount the amplifier\n&gt; to the echo box on the side.   Make sure and mount it with the battery\n&gt; compartment extended well enough above the echo box so the batteries\n&gt; can be easily replaced when needed.  Bend the mic wires down so the\n&gt; mics are inside the echo box.  The wires are sturdy enough so that\n&gt; they&#39;ll &quot;float&quot;.  If you want more support, take the foam discs off\n&gt; the amplifier pcb (the mics were set in to these, and they are glued\n&gt; on and should simply peel off) and stick them on to the walls of the\n&gt; echo box.  Then glue the wires to them.\n&gt; \n&gt; The quartz plates and the speaker extend about an 1/8 of an inch above\n&gt; the project box edge, so the lid will no longer fit.  You&#39;ll want to\n&gt; get some sound proof foam, mount it to the lid, and then fasten it to\n&gt; the box.  Besides sound proofing and protecting the wires from the\n&gt; speaker and mics, it&#39;ll add a little more shock protection to the\n&gt; plates if traveling.  You can mount a Velcro faster or any other\n&gt; method you want so that its sealed tight yet still removable.\n&gt; \n&gt; \n&gt; Marty\n&gt;"}