{"id": "12419", "subject": "Re: Better check with these guys.", "author": "M.A. Coletta (Mike)", "timestamp": "2008-10-09T18:46:39Z", "full_text": "In my eyes we are all Ghost Boxologists, and all equal.\nThat is why I coined the phrases:\n\nGhost Box-ology (Ghost Boxology) - The study of Ghost Boxes including \nthe art/science of design, test, instruction, and performance.\n\nGhost Box-ologist (Ghost Boxologist) - One who practices the \nart/science of Ghost Boxology.\n\nThere is no right way, or wrong way... there are just ways.\nWho knows what the spirits or entities like best?  I&#39;m sure there are \na number of methods that work well for them, and us.. and we are \nalways attempting new ways. Some work and some don&#39;t... or not at \nfirst maybe.\n\nFrank&#39;s Box, the Radio Shack Hack(s), the Mini Box, Joe&#39;s Box, etc. \nare all methods that use sweeping audio.  And others are coming up \nwith new ideas all the time.\nThe Ovilus and Puck for example.  Even though Bill Chappell says \nthose methods are just for entertainment, I&#39;m sure there will be \ntimes when things happen when using those devices that make one \nwonder.\n(Note: I don&#39;t have a Frank&#39;s Box, Mini Box, or Joe&#39;s Box, but I hear \nthey all work well.)\n\nIt&#39;s really great to have people (Ghost Boxologists) that are willing \nto share their information and ideas.  Recently I&#39;ve read some posts \nabout another method using a chamber, switch, etc. for an audio type \ndevice.  That&#39;s awesome that there is still a desire to try new stuff.\n\nI too am working on something new, right now in the test phase, and \nI&#39;ll be sharing that in the near (or far) future.\nI&#39;m also going to attempt to &#39;crack&#39; that other radio again, even \nthough it might not be possible.\n\nThanks to all who keep this Ghost Boxology effort going!\n\n- Mike (UFO Geek)\nhttp://www.ufomagazine.net\n\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@...&gt; \nwrote:\n&gt;\n&gt; \n&gt;  &#39;The grays&#39; never said they can only speak to &#39;certified&#39; box \nusers. I find all that ego BS highly offensive, it&#39;s just so a few \ncan keep charging mega bucks for readings, instead of having anyone \ngo to Radio Shack and buy a cheap &quot;box&quot;. I don&#39;t fault anyione for \nmaking a living, as long as it&#39;s honest. There&#39;s a few out there \nclaiming to be Box masters, and all I can ask is where do they get \nthat shit!? Everyone hears different, and the damn messages change \nfor the listener, so how can anyone be an expert, or more qualified \nthan anyone else. I&#39;ve always said one has to be very careful when \nyou think you&#39;re getting the absolute truth, or &quot;know what questions \nto ask&quot;. I make the boxes, and I don&#39;t have anyone, or anything \ntelling me it has to be this, that, or the other thing. They never \nsay it has to be random, or only linear will work. I get pitifully \nlittle technical advice.\n&gt;  \n&gt;  Besides, the friggin&#39; box is one method of many that supplies a \nraw audio that spiritis and entities use to form voices. The box is \nconsistent, but I often get better, and clearer messages and voices \nwith other methods, such as DRV, the foreign language method and \nEVPmaker. \n&gt;  \n&gt;  Frank-S\n&gt; _________________________________________________________________\n&gt; See how Windows connects the people, information, and fun that are \npart of your life.\n&gt; http://clk.atdmt.com/MRT/go/msnnkwxp1020093175mrt/direct/01/\n&gt;"}