{"id": "12421", "subject": "al  Re: [EVP-ITC] Re: The Ghost Box, is training required?", "author": "wgungfu", "timestamp": "2008-10-09T18:50:23Z", "full_text": "I agree wholeheartedly.  With the group of people I&#39;m involved with\ninvestigation wise, we decided when helping someone to only take\n&quot;donations&quot; for gas, etc.\n\nAlthough, wouldn&#39;t you guys love to have a large entourage and reality\ntv show?  Ghost Boxers, starring Frank Sumption. ;)\n\n\nMarty\n\n--- In EVP-ITC@yahoogroups.com, Ron Lederer &lt;ronriko@...&gt; wrote:\n&gt;\n&gt; I for one would not have any interest in a &quot;certification&quot; program\nor any fee involved with one. I do believe a fee for direct expenses\nsuch as meeting room, coffee, equipment rental, gas expenses for the\ncoordinator etc. is not only appropirate but esential for a group\nmeeting. I also heartedly believe that a small fee for direct\nexpenses is important for demonstratingappreciation of value on the\npart of participants. If zero is paid, it&#39;s too easy to say &quot;yes, I&#39;m\nin&quot; and then never show.The money is a token. That&#39;s been my\nexperience.But that&#39;s just me. ron\n&gt; \n&gt; --- On Thu, 10/9/08, threadsintyme@... &lt;Threadsintyme@...&gt; wrote:\n&gt; \n&gt; From: threadsintyme@... &lt;Threadsintyme@...&gt;\n&gt; Subject: Re: [EVP-ITC] Re: The Ghost Box, is training required?\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Thursday, October 9, 2008, 10:49 AM\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Don&#39;t laugh at this idea! A lot of paranormal groups do just this\nand charge a good deal and then use the money to further their &quot;work.&quot; \n&gt; Al\n&gt; \n&gt; -- &quot;wgungfu&quot; &lt;wgungfu3@aol. com&gt; wrote:\n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups .com, &quot;M.A. Coletta (Mike)&quot;\n&gt; &lt;michaelcoletta@ ...&gt; wrote:\n&gt; &gt;\n&gt; &gt; \n&gt; &gt; Last night on Haunted Times Magazine radio , guest Brian Harnois\n(Ghost\n&gt; &gt; Hunters International) told the radio listening audience that he\ndidn&#39;t\n&gt; &gt; think anyone should use a Franks&#39; Box, (or a ghost box is what he was\n&gt; &gt; insinuating) unless they had training from Christopher Moon.\n&gt; \n&gt; *LOL*. Frank - you&#39;re not qualified to use your box, better go get\n&gt; training from Chris. Better yet, we should change the name of this\n&gt; group to Haunted Times EVP-ITC (tm).\n&gt; \n&gt; My question is, who certified the certifier? Maybe we should start\n&gt; our own certification club and state anyone who&#39;s not training from us\n&gt; is not certified. I&#39;m sure some of you could use the money a lot\n&gt; more? That way we can all be certified. Or would that makes us\n&gt; certifiable? ;)\n&gt; \n&gt; Marty\n&gt; \n&gt; \n&gt; \n&gt; ____________ _________ _________ _________ _________ _________ ___ \n&gt; Gain financial freedom! Click here for Financial Advice.\n&gt;"}