{"id": "12435", "subject": "Re: [EVP-ITC] Re: Better check with these guys.", "author": "Zack Widup", "timestamp": "2008-10-09T19:48:29Z", "full_text": "So we could call ourselves Ghost Boxers (not to be confused with Shadow \nBoxers).\n;-)\n\nZack\n\nOn Thu, 9 Oct 2008, M.A. Coletta (Mike) wrote:\n\n&gt; In my eyes we are all Ghost Boxologists, and all equal.\n&gt; That is why I coined the phrases:\n&gt;\n&gt; Ghost Box-ology (Ghost Boxology) - The study of Ghost Boxes including\n&gt; the art/science of design, test, instruction, and performance.\n&gt;\n&gt; Ghost Box-ologist (Ghost Boxologist) - One who practices the\n&gt; art/science of Ghost Boxology.\n&gt;\n&gt; There is no right way, or wrong way... there are just ways.\n&gt; Who knows what the spirits or entities like best?  I&#39;m sure there are\n&gt; a number of methods that work well for them, and us.. and we are\n&gt; always attempting new ways. Some work and some don&#39;t... or not at\n&gt; first maybe.\n&gt;\n&gt; Frank&#39;s Box, the Radio Shack Hack(s), the Mini Box, Joe&#39;s Box, etc.\n&gt; are all methods that use sweeping audio.  And others are coming up\n&gt; with new ideas all the time.\n&gt; The Ovilus and Puck for example.  Even though Bill Chappell says\n&gt; those methods are just for entertainment, I&#39;m sure there will be\n&gt; times when things happen when using those devices that make one\n&gt; wonder.\n&gt; (Note: I don&#39;t have a Frank&#39;s Box, Mini Box, or Joe&#39;s Box, but I hear\n&gt; they all work well.)\n&gt;\n&gt; It&#39;s really great to have people (Ghost Boxologists) that are willing\n&gt; to share their information and ideas.  Recently I&#39;ve read some posts\n&gt; about another method using a chamber, switch, etc. for an audio type\n&gt; device.  That&#39;s awesome that there is still a desire to try new stuff.\n&gt;\n&gt; I too am working on something new, right now in the test phase, and\n&gt; I&#39;ll be sharing that in the near (or far) future.\n&gt; I&#39;m also going to attempt to &#39;crack&#39; that other radio again, even\n&gt; though it might not be possible.\n&gt;\n&gt; Thanks to all who keep this Ghost Boxology effort going!\n&gt;\n&gt; - Mike (UFO Geek)"}