{"id": "12438", "subject": "Re: The Ghost Box, is training required?", "author": "ourobouros2k2", "timestamp": "2008-10-09T20:18:06Z", "full_text": "Perhaps I should qualify my statement a little more. In much the same\nway that Bill Chappelle has his anti-liability warnings on his\nproducts, I made the above statement because from the moment I started\nmy fledgeling attempts at communication, tertiary paranormal activity\nincreased in my apartment by a factor of 10. Thankfully, it didn&#39;t\nstay, and I now use a protection ritual, but these were lessons\nlearned the hard way. I have had a few negative entitied, and\nthankfully they were relegated to single curing phrases and were very\nshort lived. I am grateful I am of made of sterner stuff than the\nactivity that I am positive was a form of intimidation to attempt to\ndissuade me from using a box.\n\nMy &#39;not for the faint of heart&#39; comment was directed at those people\nwho aren&#39;t well balanced and dealing with these type of &#39;side effects&#39;\nof box communication might cause issues or rock belief systems. I\nfirmly believe that a person should be prepared for these types of\nthing, and even if it doesn&#39;t happen to everyone, it is always a\npossibility.\n\nI fully agree that some are drawn to box research and some are not. On\na personal level, ITC in general is my primary focus of communication\nattempts. I have definately been hooked, lol\n\nthanks,\nAndy\n\n\n--- In EVP-ITC@yahoogroups.com, black bear hollow\n&lt;blackbearhollow@...&gt; wrote:\n&gt;\n&gt; I wouldn&#39;t go so far as to say that. Not for the faint of heart?  \n&gt; That&#39;s a bit much.\n&gt; \n&gt; I have 2 of Frank&#39;s boxes. It&#39;s as simple as some are drawn to use  \n&gt; them and some aren&#39;t.\n&gt; I don&#39;t know many who bring neg. results. That can happen to even the  \n&gt; nicest people. What I can&#39;t stand\n&gt; is people tagging certain areas of research with unnecessary drama. I  \n&gt; wouldn&#39;t use the term &quot;faint of heart&quot;\n&gt; for certain. As for Moon&#39;s statements, if those are accurate, they are  \n&gt; illogical. Anyone can do this research, use Frank&#39;s\n&gt; boxes, or whatever and they wouldn&#39;t need his guidance.\n&gt; \n&gt; Anyone can use one of Frank&#39;s boxes. Results vary. No drama. Many  \n&gt; things can happen with this\n&gt; research, but outlandish results are rare and can easily be dealt with.\n&gt; \n&gt; w\n&gt; ॐ\n&gt; \n&gt; On Oct 9, 2008, at 9:56 AM, Zack Widup wrote:\n&gt; \n&gt; &gt; I could agree that box research\n&gt; &gt; &gt; isn&#39;t meant for everyone nor is it everyone&#39;s cup of tea. Reckless  \n&gt; &gt; use\n&gt; &gt; &gt; can bring negative results and that is a very real possibility, so\n&gt; &gt; &gt; definately not for the faint of heart.\n&gt;"}