{"id": "12447", "subject": "al  Re: [EVP-ITC] Re: The Ghost Box, is training required?", "author": "psi_research", "timestamp": "2008-10-09T21:51:54Z", "full_text": "I have found it is effective to let participants hear their own\nmessage even if it&#39;s a group setting. I wouldn&#39;t dream of interpreting\nBox communication for other people. However, we have had sessions\nwhere everyone quietly scribed what they heard and compared notes with\neach other after closing the session. We also agreed before hand what\nquestions would be asked and have had sessions where no questions are\nasked. -Bill\n\n--- In EVP-ITC@yahoogroups.com, &quot;threadsintyme@...&quot;\n&lt;Threadsintyme@...&gt; wrote:\n&gt;\n&gt; &lt;&lt;&quot;when three or more meet together...&quot;   ron &gt;&gt;\n&gt; That has to do with Jesus...and right now he is busy with keeping\nthe crap straight with the elections...let&#39;s NOT bring Jesus into\nthis...LOL... hehe hehe\n&gt; I agree with you, Ron l.\n&gt; Al \n&gt; \n&gt; \n&gt; -- Ron Lederer &lt;ronriko@...&gt; wrote:\n&gt; \n&gt; Al   I totally agree with you and Frank for that matter.  I will\nrepeat what I said in another message that there obviously is an\ninterest and need for people who wanting to learn about EVP to get\ntogether with others who have experience in the field.  Newbies are in\nfact doing just that with the folks mentioned here.  And certainly our\nyahoo groups are helping to get the word out about the ease of doing\nEVP research on own on.  But, you then have someone go on Coast 2\nCoast and capture 1,000 names of people who are interested in\nfollowing &quot;the expert.&quot;  And, wah-la, they&#39;re in business.   I hope\nothers in our groups will pursue the idea of getting together formally\nand informally.  I think there is value in doing so and I think some\nof the &quot;expert&quot; followers will also come over.  Not that that really\nmatters to me.    One last thought I have here is that I believe there\nis much to be discovered by having three or more meet for the same\npurpose.  I think it is more of a religious adage that says something\nabout &quot;when three or more meet together...&quot;   ron  \n&gt; \n&gt; --- On Thu, 10/9/08, black bear hollow &lt;blackbearhollow@...&gt; wrote:\n&gt; From: black bear hollow &lt;blackbearhollow@...&gt;\n&gt; Subject: Re: [EVP-ITC] Re: The Ghost Box, is training required?\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Thursday, October 9, 2008, 11:37 AM\n&gt; \n&gt; They ruin this field of research. It&#39;s too bad so many are willing\nto pay and follow such egomaniacs when, as Frank S. said, anyone can\nspend a few bucks at Radio Shack and record with no prior experience.  \n&gt; Perhaps people should start boycotting these self proclaimed\nexperts. If no one shows up or gives them money, they&#39;ll just\ndisappear eventually. They will eventually disappear anyway as once\npeople actually start researching on their own, they&#39;ll see right\nthrough these people. \n&gt; Anyone can record. It&#39;s easy. No training required. As for the\nboxes, Franks sent me maybe 2 emails of maybe 3 sentences of how to\nfiddle with the knobs. I figured the rest out and my goodness, NO CHARGE! \n&gt; wॐ \n&gt; On Oct 9, 2008, at 1:49 PM, threadsintyme@ juno.com wrote:Don&#39;t\nlaugh at this idea! A lot of paranormal groups do just this and charge\na good deal and then use the money to further their &quot;work.&quot;Al\n&gt; \n&gt; \n&gt;  \n&gt; ____________________________________________________________\n&gt; Get the shot you need with a discreet new spy camera. Click now!\n&gt;\nhttp://thirdpartyoffers.juno.com/TGL2131/fc/Ioyw6iifQmmb7s44SYd1i1sYmqHDrzdgEZiACuwFReBg3Lkm3LQKzi/\n&gt;"}