{"id": "12452", "subject": "Re: Next 820/goldBox Installment", "author": "Steve Hultay", "timestamp": "2008-10-09T22:20:45Z", "full_text": "Marty,\n\nI tried the IPOD thing a year ago and came to the conclusion that \nthey need a live feed for communicating.  Not for messages, but real-\ntime back and forth stuff.\n\n-Steve H.\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;wgungfu&quot; &lt;wgungfu3@...&gt; wrote:\n&gt;\n&gt; Andy, thanks for the compliments, much appreciated.  Main credit\n&gt; should of course go to Frank though, he provided the main roadwork \nand\n&gt; inspiration.  My main concern design wise for this was to have a\n&gt; version that was compartmentalized (&quot;plug and play&quot; if you will) so\n&gt; that components can be easily substituted for experimenting.  Plus\n&gt; something lower powered to make it more portable, hence the idea to\n&gt; use a low power speaker powered by the input device, and a\n&gt; corresponding hearing assistance device as the mic/amp to amp it \nup. \n&gt; Once the lid is on, this thing is *loud* but clear.  In fact, I have\n&gt; the amp set to min volume and its still a little to loud to listen \nto\n&gt; with headphones sometimes unless you play around with equalizing the\n&gt; volume settings on the 820 and the speaker.\n&gt; \n&gt; I&#39;m also going to be experimenting swapping out the 820 with an iPod\n&gt; shuffle containing a lengthy pre-recorded sound file of audio.  30\n&gt; second talk (maybe me reading the alphabet or something), chopped up\n&gt; with EVP-Maker, and then spliced out to repeat for 30 minutes or \nso. \n&gt; I realize, as Frank stated previously, that they can effect sound\n&gt; anywhere including in a control sound like this as its being \nrecorded\n&gt; or mixed.  But my concern is satisfying the &quot;skeptics&quot; out there \nwho,\n&gt; as you put it when you first joined the group, feel that using the\n&gt; radio input it &quot;would be hard to distinguish from coincidence&quot;.  A\n&gt; controlled input that can be referred back to for comparison would\n&gt; satisfy that qualification that keeps getting thrown up. \n&gt; \n&gt; Marty\n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;ourobouros2k2&quot; &lt;ourobouros2k2@&gt; \nwrote:\n&gt; &gt;\n&gt; &gt; I am loving this design. October hitting me pretty hard but will \ntry\n&gt; &gt; to scare up the jack to implement this design soon. thanks for \nyour\n&gt; &gt; hard work and posting easy-to-follow instructions.\n&gt; &gt; \n&gt; &gt; thanks again,\n&gt; &gt; Andy\n&gt; &gt; \n&gt; &gt;\n&gt;"}