{"id": "12458", "subject": "Re: [EVP-ITC] Re: The Ghost Box, is training required?", "author": "black bear hollow", "timestamp": "2008-10-10T00:05:11Z", "full_text": "Actually I don&#39;t know you and therefore can&#39;t\nsay if I like you or not. I will say that I&#39;ve heard\nwho first came up with the RS Hack and your\nname wasn&#39;t it.\n\nI have posted many of my recordings to this\nlist, but don&#39;t store them here. I&#39;ve also heard\nyour files. So? Nothing I haven&#39;t heard before,\nbut as always I enjoy listening to everyone&#39;s efforts.\n\nWhat I don&#39;t like is an attitude and egomania\nwhen it comes to this research.\n\nNext I guess you&#39;ll challenge me to a recording\nduel? LOL. Give that ego a rest.\n\nOn Oct 9, 2008, at 7:31 PM, &quot;Steve Hultay&quot; &lt;urkel23@...&gt; wrote:\n\n&gt;\n&gt; You&#39;re right and i&#39;m not here to argue with anyone. You obviously\n&gt; don&#39;t know me, but dislike me. That&#39;s ok, i like to get along with\n&gt; people; it helps the research move forward. I would love to hear some\n&gt; of your files from your frank&#39;s boxes and compare notes on what we&#39;ve\n&gt; been getting. My results are in the files section here.\n&gt;\n&gt; -Steve\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, black bear hollow  \n&gt; &lt;blackbearhollow@...&gt;\n&gt; wrote:\n&gt; &gt;\n&gt; &gt; So have I. So has Misty. So has Frank. Mike too. I could go on & on.\n&gt; &gt; There are many here and on other lists who have contributed years of\n&gt; &gt; free time way before you showed up on the recording scene.\n&gt; &gt; Does it matter? No.\n&gt; &gt;\n&gt; &gt; w\n&gt; &gt; à¥\n&gt; &gt;\n&gt; &gt; On Oct 9, 2008, at 6:42 PM, Steve Hultay wrote:\n&gt; &gt;\n&gt; &gt; &gt; I just have contibuted a lot of FREE time and efforts that&#39;s all.\n&gt; &gt; &gt;\n&gt; &gt; &gt; -Steve\n&gt; &gt;\n&gt;\n&gt; \n\nAc ually I don' know you and he e o e can'  say i I like you o no . I will say ha I' e hea d who i s came up wi h he RS Hack and you  name wasn' i . I ha e pos ed many o my eco dings o his lis , bu don' s o e hem he e. I' e also hea d you iles. So? No hing I ha en' hea d be o e, bu as always I enjoy lis ening o e e yone's e o s. Wha I don' like is an a i ude and egomania when i comes o his esea ch. Nex I guess you'll challenge me o a eco ding duel? LOL. Gi e ha ego a es . On Oc 9, 2008, a 7:31 PM, \"S e e Hul ay\" u kel23@...> w o e:\n\n\n\n\n\n \n \nYou' e igh and i'm no he e o a gue wi h anyone. You ob iously \ndon' know me, bu dislike me. Tha 's ok, i like o ge along wi h \npeople; i helps he esea ch mo e o wa d. I would lo e o hea some \no you iles om you ank's boxes and compa e no es on wha we' e \nbeen ge ing. My esul s a e in he iles sec ion he e.\n\n-S e e\n\n--- In EVP-ITC@yahoog oups.com, black bea hollow ...> \nw o e:\n>\n> So ha e I. So has Mis y. So has F ank. Mike oo. I could go on & on. \n> The e a e many he e and on o he lis s who ha e con ibu ed yea s o \n> ee ime way be o e you showed up on he eco ding scene.\n> Does i ma e ? No.\n> \n> w\n> à¥\n> \n> On Oc 9, 2008, a 6:42 PM, S e e Hul ay w o e:\n> \n> > I jus ha e con ibu ed a lo o FREE ime and e o s ha 's all.\n> >\n> > -S e e\n>"}