{"id": "12454", "subject": "Re: Next 820/goldBox Installment", "author": "Steve Hultay", "timestamp": "2008-10-09T22:41:13Z", "full_text": "Yeah, that&#39;s what i did too.  But it&#39;s recorded, EVP maker is a \nrecorded piece jumbled into a live situation.  I say try everything, \ni have.  Some stuff works better than others, but it can&#39;t hurt to \nexperiment with methods.\n\n-Steve\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;wgungfu&quot; &lt;wgungfu3@...&gt; wrote:\n&gt;\n&gt; Thanks for the input on your personal experience Steve.  I&#39;m still\n&gt; going to try that and several other methods though.  The iPod \nmethod I\n&gt; was talking about is no different than a standard EVPMaker attempt\n&gt; (which a lot of people mention great success with).  Just playing \nthe\n&gt; chopped up file from an iPod instead of on the computer.\n&gt; \n&gt; Marty\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Steve Hultay&quot; &lt;urkel23@&gt; wrote:\n&gt; &gt;\n&gt; &gt; \n&gt; &gt; Marty,\n&gt; &gt; \n&gt; &gt; I tried the IPOD thing a year ago and came to the conclusion that \n&gt; &gt; they need a live feed for communicating.  Not for messages, but \nreal-\n&gt; &gt; time back and forth stuff.\n&gt; &gt; \n&gt; &gt; -Steve H.\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;wgungfu&quot; &lt;wgungfu3@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; Andy, thanks for the compliments, much appreciated.  Main credit\n&gt; &gt; &gt; should of course go to Frank though, he provided the main \nroadwork \n&gt; &gt; and\n&gt; &gt; &gt; inspiration.  My main concern design wise for this was to have a\n&gt; &gt; &gt; version that was compartmentalized (&quot;plug and play&quot; if you \nwill) so\n&gt; &gt; &gt; that components can be easily substituted for experimenting.  \nPlus\n&gt; &gt; &gt; something lower powered to make it more portable, hence the \nidea to\n&gt; &gt; &gt; use a low power speaker powered by the input device, and a\n&gt; &gt; &gt; corresponding hearing assistance device as the mic/amp to amp \nit \n&gt; &gt; up. \n&gt; &gt; &gt; Once the lid is on, this thing is *loud* but clear.  In fact, I \nhave\n&gt; &gt; &gt; the amp set to min volume and its still a little to loud to \nlisten \n&gt; &gt; to\n&gt; &gt; &gt; with headphones sometimes unless you play around with \nequalizing the\n&gt; &gt; &gt; volume settings on the 820 and the speaker.\n&gt; &gt; &gt; \n&gt; &gt; &gt; I&#39;m also going to be experimenting swapping out the 820 with an \niPod\n&gt; &gt; &gt; shuffle containing a lengthy pre-recorded sound file of audio.  \n30\n&gt; &gt; &gt; second talk (maybe me reading the alphabet or something), \nchopped up\n&gt; &gt; &gt; with EVP-Maker, and then spliced out to repeat for 30 minutes \nor \n&gt; &gt; so. \n&gt; &gt; &gt; I realize, as Frank stated previously, that they can effect \nsound\n&gt; &gt; &gt; anywhere including in a control sound like this as its being \n&gt; &gt; recorded\n&gt; &gt; &gt; or mixed.  But my concern is satisfying the &quot;skeptics&quot; out \nthere \n&gt; &gt; who,\n&gt; &gt; &gt; as you put it when you first joined the group, feel that using \nthe\n&gt; &gt; &gt; radio input it &quot;would be hard to distinguish from \ncoincidence&quot;.  A\n&gt; &gt; &gt; controlled input that can be referred back to for comparison \nwould\n&gt; &gt; &gt; satisfy that qualification that keeps getting thrown up. \n&gt; &gt; &gt; \n&gt; &gt; &gt; Marty\n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;ourobouros2k2&quot; \n&lt;ourobouros2k2@&gt; \n&gt; &gt; wrote:\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; I am loving this design. October hitting me pretty hard but \nwill \n&gt; &gt; try\n&gt; &gt; &gt; &gt; to scare up the jack to implement this design soon. thanks \nfor \n&gt; &gt; your\n&gt; &gt; &gt; &gt; hard work and posting easy-to-follow instructions.\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; thanks again,\n&gt; &gt; &gt; &gt; Andy\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}