{"id": "12468", "subject": "Re: Sarah Estep&#39;s tapings with reel to reel?", "author": "itcdeadpeople", "timestamp": "2008-10-10T03:12:53Z", "full_text": "Hi Judy.  I think if that type of research interests you and you can afford the $160 (and \nanything else you might need to go along with it for EVP purposes), why not?  For myself, I \njust find it to be too time consuming and frustrating to go through so much recorded \nmaterial for so little in return, content wise, when we already have the ability (albeit in it&#39;s \ninfancy) to engage in real-time, or nearly real-time, two-way conversations.\n\nYes, Sarah got amazing results and bless her pioneering spirit which helped bring us to \nwhere we are today.  I&#39;m not sure how much of her success was her equipment and how \nmuch was her energy (I think we are all a component in our sessions).  In regard to \ntraditional EVP work, given how good many of today&#39;s inexpensive digital recorders are, \nthat is the route I&#39;ve gone for situations where sweep isn&#39;t an option.  I&#39;ve gotten good EVP \nwith my Panasonic RR-US360, the Sony B26, and a handful of others.  I know some are \nstill successfully using cassettes.  \n\nI guess it all boils down to a matter of preference and the type of EVP research that most \ninterests you.  As my dear hubby says, &quot;Whatever floats your boat!&quot; ;-)\n\nIf you do decide to try Sarah&#39;s method, let us know how you do.\n\nMargaret\n\n--- In EVP-ITC@yahoogroups.com, &quot;judy_in_hollywood&quot; &lt;Ticket_to_Heaven@...&gt; wrote:\n&gt;\n&gt; Hi All, Been awhile since I&#39;ve posted here, but was wondering about the \n&gt; methods Sarah used with her reel to reel tape recorder (Technics or \n&gt; Teac model - anyone know which???) as it seems she got MANY Spirit \n&gt; voices or EVP&#39;s this way. Not to knock, Frank&#39;s Boxes or other Ghost \n&gt; Boxes!  Just a though! I may have an opportunity to get a $160. \n&gt; refurbised Teac or Technics reel to reel tape recorder, but am \n&gt; wondering IF I should get it or not (it&#39;s a 1970&#39;s model appearently)! \n&gt; Comments/ideas?  Thanks!   =Judy=   8-D\n&gt;"}