{"id": "12475", "subject": "Re: [EVP-ITC] Sarah Estep&#39;s tapings with reel to reel?", "author": "Lisby", "timestamp": "2008-10-10T04:02:45Z", "full_text": "Yes--Sarah used reel-to-reel and occasionally cassette. I bought my  \nfirst reel-to-reel from her husband, back in the day. Sarah had a  \nbunch of them and her husband was always looking for them at yards  \nsales to pass onto AAEVP members. He&#39;d get them and fix them up. I  \nstill have the one he got for me. I used several back them myself and  \nhad three or four when I had to pause in taping for the birth of my  \nson. It took me many years to get back to it...\n\nAnn\n\nOn Oct 9, 2008, at 10:35 PM, judy_in_hollywood wrote:\n\n&gt; Hi All, Been awhile since I&#39;ve posted here, but was wondering about  \n&gt; the\n&gt; methods Sarah used with her reel to reel tape recorder (Technics or\n&gt; Teac model - anyone know which???) as it seems she got MANY Spirit\n&gt; voices or EVP&#39;s this way. Not to knock, Frank&#39;s Boxes or other Ghost\n&gt; Boxes! Just a though! I may have an opportunity to get a $160.\n&gt; refurbised Teac or Technics reel to reel tape recorder, but am\n&gt; wondering IF I should get it or not (it&#39;s a 1970&#39;s model appearently)!\n&gt; Comments/ideas? Thanks! =Judy= 8-D\n&gt;\n&gt;\n&gt; \n\n\nYes--Sa ah used eel- o- eel and occasionally casse e. I bough my i s eel- o- eel om he husband, back in he day. Sa ah had a bunch o hem and he husband was always looking o hem a ya ds sales o pass on o AAEVP membe s. He'd ge hem and ix hem up. I s ill ha e he one he go o me. I used se e al back hem mysel and had h ee o ou when I had o pause in aping o he bi h o my son. I ook me many yea s o ge back o i ...AnnOn Oc 9, 2008, a 10:35 PM, judy_in_hollywood w o e:Hi All, Been awhile since I' e pos ed he e, bu was wonde ing abou he me hods Sa ah used wi h he eel o eel ape eco de (Technics o  Teac model - anyone know which???) as i seems she go MANY Spi i   oices o EVP's his way. No o knock, F ank's Boxes o o he Ghos  Boxes! Jus a hough! I may ha e an oppo uni y o ge a $160.  e u bised Teac o Technics eel o eel ape eco de , bu am wonde ing IF I should ge i o no (i 's a 1970's model appea en ly)! Commen s/ideas? Thanks! =Judy= 8-D"}