{"id": "12486", "subject": "Re: Sarah Estep&#39;s tapings with reel to reel?", "author": "wgungfu", "timestamp": "2008-10-10T14:20:37Z", "full_text": "--- In EVP-ITC@yahoogroups.com, Rhonda W &lt;rhondak1973@...&gt; wrote:\n&gt;\n&gt; Ok bear with me(Im a gamer too)...I once found an old atari system\nwith like 20 games at a thrift store and remembered back when I was a\nkid and thought ohhhh yaaaa this was the GREATEST gaming system\nEVER!!! So I snagged it for a whopping 50 bucks...took that bad boy\nhome jimmy rigged it to my new tv system, prepared myself for the\nawesome graphics of Donkey Kong and Pac-Man....turned it on and went\nWTF!!!!? WHERES THE AWESOMENESS I REMEMBER, THE COOL GRAPHICS!?!?!?! \n&gt; \n\nTo each their own, there&#39;s a lot of people who still love playing that\nsystem and other game systems from the era. \n\nhttp://uk.youtube.com/watch?v=CiHNpWHCEgI\nhttp://uk.youtube.com/watch?v=phTmRjqr8gU\nhttp://uk.youtube.com/watch?v=xGfhKRSYI-Q\n\n&gt; I think it would be like that...ya it&#39;d cool to try it out and\nrelive its glory days for about a weekbut I&#39;d want my RS Hack back\nlol. But it would definately be cool to try and if you can afford it\nand have the paitence to try that method...go for it! I&#39;d love to\nhear the results. =)\n&gt; \n\nI do both with investigations and such, bring along analog and digital\nrecorders (and being a musician I still work with both technologies as\nwell).  There&#39;s certain tonal and depth qualities that get sampled out\nin digital as well as different types of artifacting that digital\nproduces, just as there&#39;s certain clarities not capable in analog with\nout a lot of extra work besides the ease of use of the medium.\n\n\nMarty\n\n&gt; --- On Thu, 10/9/08, itcdeadpeople &lt;ITCdeadpeople@...&gt; wrote:\n&gt; \n&gt; From: itcdeadpeople &lt;ITCdeadpeople@...&gt;\n&gt; Subject: [EVP-ITC] Re: Sarah Estep&#39;s tapings with reel to reel?\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Thursday, October 9, 2008, 8:12 PM\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Hi Judy. I think if that type of research interests you and you can\nafford the $160 (and \n&gt; anything else you might need to go along with it for EVP purposes),\nwhy not? For myself, I \n&gt; just find it to be too time consuming and frustrating to go through\nso much recorded \n&gt; material for so little in return, content wise, when we already have\nthe ability (albeit in it&#39;s \n&gt; infancy) to engage in real-time, or nearly real-time, two-way\nconversations.\n&gt; \n&gt; Yes, Sarah got amazing results and bless her pioneering spirit which\nhelped bring us to \n&gt; where we are today. I&#39;m not sure how much of her success was her\nequipment and how \n&gt; much was her energy (I think we are all a component in our\nsessions). In regard to \n&gt; traditional EVP work, given how good many of today&#39;s inexpensive\ndigital recorders are, \n&gt; that is the route I&#39;ve gone for situations where sweep isn&#39;t an\noption. I&#39;ve gotten good EVP \n&gt; with my Panasonic RR-US360, the Sony B26, and a handful of others. I\nknow some are \n&gt; still successfully using cassettes. \n&gt; \n&gt; I guess it all boils down to a matter of preference and the type of\nEVP research that most \n&gt; interests you. As my dear hubby says, &quot;Whatever floats your boat!&quot; ;-)\n&gt; \n&gt; If you do decide to try Sarah&#39;s method, let us know how you do.\n&gt; \n&gt; Margaret\n&gt; \n&gt; --- In EVP-ITC@yahoogroups .com, &quot;judy_in_hollywood&quot;\n&lt;Ticket_to_Heaven@ ...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hi All, Been awhile since I&#39;ve posted here, but was wondering\nabout the \n&gt; &gt; methods Sarah used with her reel to reel tape recorder (Technics or \n&gt; &gt; Teac model - anyone know which???) as it seems she got MANY Spirit \n&gt; &gt; voices or EVP&#39;s this way. Not to knock, Frank&#39;s Boxes or other Ghost \n&gt; &gt; Boxes! Just a though! I may have an opportunity to get a $160. \n&gt; &gt; refurbised Teac or Technics reel to reel tape recorder, but am \n&gt; &gt; wondering IF I should get it or not (it&#39;s a 1970&#39;s model\nappearently) ! \n&gt; &gt; Comments/ideas? Thanks! =Judy= 8-D\n&gt; &gt;\n&gt;"}