{"id": "12490", "subject": "Re: Sarah Estep&#39;s tapings with reel to reel?", "author": "itcdeadpeople", "timestamp": "2008-10-10T18:06:06Z", "full_text": "OMGosh, Rhonda.  Remember Pong?  We all thought that was the coolest thing EVER when \nthat came out.  My neighbor was the only one on the block to own one.  Then some years \nlater we were the first to get &quot;Select TV&quot; (one of the first cable/movie services in our area).\n\nAnd I still remember coming home with my Commodore Vic-20 and a bunch of text based \nadventure games, no graphics.  ROFLOL.  We&#39;ve come a looooong way!!\n\nAnyway, thanks for the flashback!  ;-)\n\nMargaret\n\n--- In EVP-ITC@yahoogroups.com, Rhonda W &lt;rhondak1973@...&gt; wrote:\n&gt;\n&gt; Ok bear with me(Im a gamer too)...I once found an old atari system with like 20 games \nat a thrift store and remembered back when I was a kid and thought ohhhh yaaaa this was \nthe GREATEST gaming system EVER!!! So I snagged it for a whopping 50 bucks...took that \nbad boy home jimmy rigged it to my new tv system, prepared myself for the awesome \ngraphics of Donkey Kong and Pac-Man....turned it on and went WTF!!!!? WHERES THE \nAWESOMENESS I REMEMBER, THE COOL GRAPHICS!?!?!?! \n&gt; \n&gt; I think it would be like that...ya it&#39;d cool to try it out and relive its glory days for about a \nweekbut I&#39;d want my RS Hack back lol. But it would definately be cool to try and if you can \nafford it and have the paitence to try that method...go for it! I&#39;d love to hear the results. \n=)\n&gt; \n&gt; --- On Thu, 10/9/08, itcdeadpeople &lt;ITCdeadpeople@...&gt; wrote:\n&gt; \n&gt; From: itcdeadpeople &lt;ITCdeadpeople@...&gt;\n&gt; Subject: [EVP-ITC] Re: Sarah Estep&#39;s tapings with reel to reel?\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Thursday, October 9, 2008, 8:12 PM\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Hi Judy. I think if that type of research interests you and you can afford the $160 (and \n&gt; anything else you might need to go along with it for EVP purposes), why not? For \nmyself, I \n&gt; just find it to be too time consuming and frustrating to go through so much recorded \n&gt; material for so little in return, content wise, when we already have the ability (albeit in \nit&#39;s \n&gt; infancy) to engage in real-time, or nearly real-time, two-way conversations.\n&gt; \n&gt; Yes, Sarah got amazing results and bless her pioneering spirit which helped bring us to \n&gt; where we are today. I&#39;m not sure how much of her success was her equipment and how \n&gt; much was her energy (I think we are all a component in our sessions). In regard to \n&gt; traditional EVP work, given how good many of today&#39;s inexpensive digital recorders are, \n&gt; that is the route I&#39;ve gone for situations where sweep isn&#39;t an option. I&#39;ve gotten good \nEVP \n&gt; with my Panasonic RR-US360, the Sony B26, and a handful of others. I know some are \n&gt; still successfully using cassettes. \n&gt; \n&gt; I guess it all boils down to a matter of preference and the type of EVP research that most \n&gt; interests you. As my dear hubby says, &quot;Whatever floats your boat!&quot; ;-)\n&gt; \n&gt; If you do decide to try Sarah&#39;s method, let us know how you do.\n&gt; \n&gt; Margaret\n&gt; \n&gt; --- In EVP-ITC@yahoogroups .com, &quot;judy_in_hollywood&quot; &lt;Ticket_to_Heaven@ ...&gt; \nwrote:\n&gt; &gt;\n&gt; &gt; Hi All, Been awhile since I&#39;ve posted here, but was wondering about the \n&gt; &gt; methods Sarah used with her reel to reel tape recorder (Technics or \n&gt; &gt; Teac model - anyone know which???) as it seems she got MANY Spirit \n&gt; &gt; voices or EVP&#39;s this way. Not to knock, Frank&#39;s Boxes or other Ghost \n&gt; &gt; Boxes! Just a though! I may have an opportunity to get a $160. \n&gt; &gt; refurbised Teac or Technics reel to reel tape recorder, but am \n&gt; &gt; wondering IF I should get it or not (it&#39;s a 1970&#39;s model appearently) ! \n&gt; &gt; Comments/ideas? Thanks! =Judy= 8-D\n&gt; &gt;\n&gt;"}