{"id": "12496", "subject": "Re: Sarah Estep&#39;s tapings with reel to reel?", "author": "wgungfu", "timestamp": "2008-10-10T19:43:58Z", "full_text": "Wow, didn&#39;t expect that kind of a response.  I was simply sharing my \nthoughts on analog vs. digital as well, and using your Atari example \nto show that there&#39;s actually a large contingent of people out there \nwho actively collect and use Pong&#39;s, Atari&#39;s, Intellivisions, etc.  \nThe recent topic came up about organizing events, and the video&#39;s I \ngave links to are for a show on that topic I&#39;ve been a co-organizer \nfor since 2001 (22,000 sq. ft, and 2,500 people over 2 days this past \nyear).  Wasn&#39;t trying to invalidate anyone&#39;s opinions, experiences, \netc., just share my own.\n\nMarty\n\n--- In EVP-ITC@yahoogroups.com, Rhonda W &lt;rhondak1973@...&gt; wrote:\n&gt;\n&gt; well so much for my attempt at having a sense of humor this \nmorning, not trying to say that one is better than the other..saying \nthat me personally, I think I&#39;dlike my rs hack better than I would \nsay a cassette recorder or reel to reel...mostly cuz I dont have the \npaitence and I am hooked on that real time(almost real time) comms I \nget with the hack...but it would be cool (for me)to be able to try \nout some of those older methods but Im sure(for me) that Id go back \nto my hack...just my opinion on something and not saying its right or \nwrong or one method is better than another. I&#39;ll shut up now and go \nback to bed..have a great day\n&gt; \n&gt; --- On Fri, 10/10/08, wgungfu &lt;wgungfu3@...&gt; wrote:\n&gt; \n&gt; From: wgungfu &lt;wgungfu3@...&gt;\n&gt; Subject: [EVP-ITC] Re: Sarah Estep&#39;s tapings with reel to reel?\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Friday, October 10, 2008, 7:20 AM\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups .com, Rhonda W &lt;rhondak1973@ ...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Ok bear with me(Im a gamer too)...I once found an old atari \nsystem\n&gt; with like 20 games at a thrift store and remembered back when I was \na\n&gt; kid and thought ohhhh yaaaa this was the GREATEST gaming system\n&gt; EVER!!! So I snagged it for a whopping 50 bucks...took that bad boy\n&gt; home jimmy rigged it to my new tv system, prepared myself for the\n&gt; awesome graphics of Donkey Kong and Pac-Man....turned it on and went\n&gt; WTF!!!!? WHERES THE AWESOMENESS I REMEMBER, THE COOL \nGRAPHICS!?!? !?! \n&gt; &gt; \n&gt; \n&gt; To each their own, there&#39;s a lot of people who still love playing \nthat\n&gt; system and other game systems from the era. \n&gt; \n&gt; http://uk.youtube. com/watch? v=CiHNpWHCEgI\n&gt; http://uk.youtube. com/watch? v=phTmRjqr8gU\n&gt; http://uk.youtube. com/watch? v=xGfhKRSYI- Q\n&gt; \n&gt; &gt; I think it would be like that...ya it&#39;d cool to try it out and\n&gt; relive its glory days for about a weekbut I&#39;d want my RS Hack back\n&gt; lol. But it would definately be cool to try and if you can afford it\n&gt; and have the paitence to try that method...go for it! I&#39;d love to\n&gt; hear the results. =)\n&gt; &gt; \n&gt; \n&gt; I do both with investigations and such, bring along analog and \ndigital\n&gt; recorders (and being a musician I still work with both technologies \nas\n&gt; well). There&#39;s certain tonal and depth qualities that get sampled \nout\n&gt; in digital as well as different types of artifacting that digital\n&gt; produces, just as there&#39;s certain clarities not capable in analog \nwith\n&gt; out a lot of extra work besides the ease of use of the medium.\n&gt; \n&gt; Marty\n&gt; \n&gt; &gt; --- On Thu, 10/9/08, itcdeadpeople &lt;ITCdeadpeople@ ...&gt; wrote:\n&gt; &gt; \n&gt; &gt; From: itcdeadpeople &lt;ITCdeadpeople@ ...&gt;\n&gt; &gt; Subject: [EVP-ITC] Re: Sarah Estep&#39;s tapings with reel to reel?\n&gt; &gt; To: EVP-ITC@yahoogroups .com\n&gt; &gt; Date: Thursday, October 9, 2008, 8:12 PM\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; Hi Judy. I think if that type of research interests you and you \ncan\n&gt; afford the $160 (and \n&gt; &gt; anything else you might need to go along with it for EVP \npurposes),\n&gt; why not? For myself, I \n&gt; &gt; just find it to be too time consuming and frustrating to go \nthrough\n&gt; so much recorded \n&gt; &gt; material for so little in return, content wise, when we already \nhave\n&gt; the ability (albeit in it&#39;s \n&gt; &gt; infancy) to engage in real-time, or nearly real-time, two-way\n&gt; conversations.\n&gt; &gt; \n&gt; &gt; Yes, Sarah got amazing results and bless her pioneering spirit \nwhich\n&gt; helped bring us to \n&gt; &gt; where we are today. I&#39;m not sure how much of her success was her\n&gt; equipment and how \n&gt; &gt; much was her energy (I think we are all a component in our\n&gt; sessions). In regard to \n&gt; &gt; traditional EVP work, given how good many of today&#39;s inexpensive\n&gt; digital recorders are, \n&gt; &gt; that is the route I&#39;ve gone for situations where sweep isn&#39;t an\n&gt; option. I&#39;ve gotten good EVP \n&gt; &gt; with my Panasonic RR-US360, the Sony B26, and a handful of \nothers. I\n&gt; know some are \n&gt; &gt; still successfully using cassettes. \n&gt; &gt; \n&gt; &gt; I guess it all boils down to a matter of preference and the type \nof\n&gt; EVP research that most \n&gt; &gt; interests you. As my dear hubby says, &quot;Whatever floats your \nboat!&quot; ;-)\n&gt; &gt; \n&gt; &gt; If you do decide to try Sarah&#39;s method, let us know how you do.\n&gt; &gt; \n&gt; &gt; Margaret\n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups .com, &quot;judy_in_hollywood&quot;\n&gt; &lt;Ticket_to_Heaven@ ...&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; Hi All, Been awhile since I&#39;ve posted here, but was wondering\n&gt; about the \n&gt; &gt; &gt; methods Sarah used with her reel to reel tape recorder \n(Technics or \n&gt; &gt; &gt; Teac model - anyone know which???) as it seems she got MANY \nSpirit \n&gt; &gt; &gt; voices or EVP&#39;s this way. Not to knock, Frank&#39;s Boxes or other \nGhost \n&gt; &gt; &gt; Boxes! Just a though! I may have an opportunity to get a $160. \n&gt; &gt; &gt; refurbised Teac or Technics reel to reel tape recorder, but am \n&gt; &gt; &gt; wondering IF I should get it or not (it&#39;s a 1970&#39;s model\n&gt; appearently) ! \n&gt; &gt; &gt; Comments/ideas? Thanks! =Judy= 8-D\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}