{"id": "12504", "subject": "Re: The Ghost Box, is training required?", "author": "wgungfu", "timestamp": "2008-10-10T21:45:29Z", "full_text": "Yes, we&#39;re on the same page regarding appropriation by the Catholic \nChurch.  Here&#39;s a bit regarding Satan that I recently contributed to \na conversation on another discussion group, interesting timing  (I&#39;d \nalso be willing to discuss this stuff further offlist, I know have \nFrank doesn&#39;t like a lot of religious discussion here):\n\n&quot;A perfect example (which I believe I mentioned before) is Satan, \nwhich was a Hebrew word appropriated by the Church under the context \nof &quot;the devil&quot; himself or &quot;lucifer&quot;. In Judaism it refers to \ngod&#39;s &quot;angel&quot; that&#39;s translated as the &quot;adversary&quot; - it stands \nfor &quot;choice&quot;. A &quot;prosecutor&quot; if you will, he gives you choice - to \nwhich there is an outcome - i.e. a consequence. Without something to \nchoose against, there&#39;d be no &quot;free will&quot;, hence &quot;Satan&quot; or &quot;ha-\nSatan&quot; was created. There&#39;s nothing inherently negative about that, \nother than the ominous notion to choose wisely.  All \nenergy, &quot;good&quot;, &quot;bad&quot;, all comes from the same source in \nJewish/Kabbalistic belief. &quot;Angels&quot;, &quot;demons&quot;, etc. are not\nconsidered to have free will (that&#39;s what we were created for), and\nare seen as simply direct extensions of the same &quot;one&quot; (hence the main\nangels have &quot;el&quot; - alpeh lamed - as part of their name). Its based\nvia the concept of a pure monotheism viewpoint. All are simply\nextensions and therefore parts of the whole.&quot;\n\n\nMarty\n\n--- In EVP-ITC@yahoogroups.com, black bear hollow \n&lt;blackbearhollow@...&gt; wrote:\n&gt;\n&gt; Since the early Christian church made up the idea of a &quot;devil&quot; \nfrom  \n&gt; the Kabbalistic term &quot;Satan&quot; which is a thing not a being, I like \nthe  \n&gt; Jewish definition which is much more interesting, though that&#39;s a  \n&gt; pretty radical idea. The orthodoxy tend to be much more radical  \n&gt; though. Even the kid in Maryland that The Exorcist story is based \non  \n&gt; wasn&#39;t possessed, but found to have Tourette&#39;s syndrome. I wouldn&#39;t \nbe  \n&gt; surprised if all cases of people claiming possession have a simple  \n&gt; scientific or medical explanation.\n&gt; \n&gt; w\n&gt; ॐ\n&gt; \n&gt; On Oct 10, 2008, at 3:55 PM, wgungfu wrote:\n&gt; \n&gt; &gt; Well, the concept of a Dybbuk is a bit different than the popular\n&gt; &gt; concept of &quot;posession&quot;. It usually involves a soul that has not\n&gt; &gt; accomplished something they were supposed to and cannot advance\n&gt; &gt; further, so they return and bind with the living to do it. Its\n&gt; &gt; considered a rare occurance and usually only acknowledged or dealt\n&gt; &gt; with by some of the orthodoxy.\n&gt; &gt;\n&gt; &gt; Marty\n&gt;"}