{"id": "12510", "subject": "Re: The Ghost Box, is training required?", "author": "wgungfu", "timestamp": "2008-10-10T23:14:22Z", "full_text": "Correct, and a lot of that appropriation happened during the several\ndifferent inquisitions (1100&#39;s through 1600&#39;s) where the Catholic\nChurch first sought to secure its dominance over other sects of\nChristianity and then moved on to others over time.  That&#39;s where you\nhave things like the King James Bible appear out of (during the later\npart of that period), which pretty much replaced everything with\n&quot;devil&quot; and &quot;demon&quot; (which one depends on which version of KJ you read).\n\nAnd to clarify what I was stating (which is not how Don was taking it)\n- in its Jewish origins it has nothing to do with temptation and\nmaking us stronger.  I was not stating anything along those lines. \nIts purely neutral, and an agent of simple choice - i.e. it presents\nboth good and bad choices equally, i.e. if you have something bad\nit&#39;ll present something good and vice versa.  The idea kabbalistically\nis that we were put here to develop and exercise free will.  You can&#39;t\nhave free will if you don&#39;t have choice, hence ha-satan.  I.E, you\ncan&#39;t choose between Coke and Pepsi if there&#39;s just Coke or there&#39;s\njust Pepsi.  The other has to be created and provide to provide\n&quot;choice&quot;, and therefore enable you to express &quot;free will&quot;.  Nothing\nnegative about that.  The context of negativity is one that was laid\non during appropriation.\n\n\nMarty\n\n--- In EVP-ITC@yahoogroups.com, black bear hollow\n&lt;blackbearhollow@...&gt; wrote:\n&gt;\n&gt; We already said that, but it was also stated that Satan is a made up  \n&gt; character of the early Church to instill fear and use that fear to  \n&gt; control the masses. It worked well for the Peruvians, so the early  \n&gt; Church copied the idea - like they copied a lot of things. :) But this  \n&gt; list  isn&#39;t the place to get further into this topic, though it&#39;s  \n&gt; interesting.\n&gt; \n&gt; w\n&gt; ॐ\n&gt; \n&gt; On Oct 10, 2008, at 6:00 PM, don powell wrote:\n&gt; \n&gt; &gt; This actually fits with Christian beliefs too.  Everywhere the word\n&gt; &gt;  Satan is used, they are talking about an agent of God who&#39;s purpose\n&gt; &gt; is to tempt us and therefore to temper our spirits and make us\n&gt; &gt; stronger.\n&gt; &gt;\n&gt; &gt; Don\n&gt;"}