{"id": "12519", "subject": "Re: [EVP-ITC] Re: Sarah Estep&#39;s tapings with reel to reel?", "author": "Lisby", "timestamp": "2008-10-11T04:03:07Z", "full_text": "The ghost boxes work better than anything I&#39;ve ever used. I have a  \nmini and one of Frank&#39;s originals and they both are fantastic. After  \nthat, I had the most success with reel-to-reel. But using the boxes  \nwith a digital recorder and proper audio software is worlds beyond  \nwhat we used to do in the 1980s.\n\nAnn\n\nOn Oct 10, 2008, at 8:02 PM, judy_in_hollywood wrote:\n\n&gt; --- In EVP-ITC@yahoogroups.com, Lisby &lt;lisby@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Yes--Sarah used reel-to-reel and occasionally cassette. I bought\n&gt; my\n&gt; &gt; first reel-to-reel from her husband, back in the day. Sarah had a\n&gt; &gt; bunch of them and her husband was always looking for them at yards\n&gt; &gt; sales to pass onto AAEVP members. He&#39;d get them and fix them up. I\n&gt; &gt; still have the one he got for me. I used several back them myself\n&gt; and\n&gt; &gt; had three or four when I had to pause in taping for the birth of\n&gt; my\n&gt; &gt; son. It took me many years to get back to it...\n&gt; &gt;\n&gt; &gt; Ann\n&gt; &gt;\n&gt; &gt; On Oct 9, 2008, at 10:35 PM, judy_in_hollywood wrote:\n&gt; &gt;\n&gt; &gt; &gt; Hi All, Been awhile since I&#39;ve posted here, but was wondering\n&gt; about\n&gt; &gt; &gt; the\n&gt; &gt; &gt; methods Sarah used with her reel to reel tape recorder (Technics\n&gt; or\n&gt; &gt; &gt; Teac model - anyone know which???) as it seems she got MANY Spirit\n&gt; &gt; &gt; voices or EVP&#39;s this way. Not to knock, Frank&#39;s Boxes or other\n&gt; Ghost\n&gt; &gt; &gt; Boxes! Just a though! I may have an opportunity to get a $160.\n&gt; &gt; &gt; refurbised Teac or Technics reel to reel tape recorder, but am\n&gt; &gt; &gt; wondering IF I should get it or not (it&#39;s a 1970&#39;s model\n&gt; appearently)!\n&gt; &gt; &gt; Comments/ideas? Thanks! =Judy= 8-D\n&gt; &gt; &gt; = = = = = = = = = = = = = = = = = = = = = = = = = = = = = =&gt;\n&gt; &gt; &gt; Hi, Lisby! Were you able to get some EVP&#39;s on any of those\n&gt; recorders? Was it too time consuming to even get one or two? Just\n&gt; wondering IF I should just stick to cassettes & Sony, and my digital\n&gt; recorder? =Judy=\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;\n&gt; \n\n\nThe ghos boxes wo k be e han any hing I' e e e used. I ha e a mini and one o F ank's o iginals and hey bo h a e an as ic. A e ha , I had he mos success wi h eel- o- eel. Bu using he boxes wi h a digi al eco de and p ope audio so wa e is wo lds beyond wha we used o do in he 1980s.AnnOn Oc 10, 2008, a 8:02 PM, judy_in_hollywood w o e:--- In EVP-ITC@yahoog oups.com, Lisby w o e:>> Yes--Sa ah used eel- o- eel and occasionally casse e. I bough  my > i s eel- o- eel om he husband, back in he day. Sa ah had a > bunch o hem and he husband was always looking o hem a ya ds > sales o pass on o AAEVP membe s. He'd ge hem and ix hem up. I > s ill ha e he one he go o me. I used se e al back hem mysel  and > had h ee o ou when I had o pause in aping o he bi h o  my > son. I ook me many yea s o ge back o i ...> > Ann> > On Oc 9, 2008, a 10:35 PM, judy_in_hollywood w o e:> > > Hi All, Been awhile since I' e pos ed he e, bu was wonde ing abou  > > he> > me hods Sa ah used wi h he eel o eel ape eco de (Technics o > > Teac model - anyone know which???) as i seems she go MANY Spi i > > oices o EVP's his way. No o knock, F ank's Boxes o o he  Ghos > > Boxes! Jus a hough! I may ha e an oppo uni y o ge a $160.> > e u bised Teac o Technics eel o eel ape eco de , bu am> > wonde ing IF I should ge i o no (i 's a 1970's model appea en ly)!> > Commen s/ideas? Thanks! =Judy= 8-D> > = = = = = = = = = = = = = = = = = = = = = = = = = = = = = =>> > Hi, Lisby! We e you able o ge some EVP's on any o hose  eco de s? Was i oo ime consuming o e en ge one o wo? Jus  wonde ing IF I should jus s ick o casse es & Sony, and my digi al  eco de ? =Judy=> >>"}