{"id": "12513", "subject": "Re: [EVP-ITC] Re: The Ghost Box, is training required?", "author": "black bear hollow", "timestamp": "2008-10-10T23:54:17Z", "full_text": "Yes. It&#39;s amazing how many who claim to be Christians are clueless  \nabout their own history. Of course the early church didn&#39;t allow such  \nknowledge and it was much easier to control people who didn&#39;t know  \nabout their dirty deeds. Only Priests were allowed to read for a good  \nlong time. Crazy. Keep people uneducated & afraid and you can do  \npretty much anything with them. This is rampant in the US today.  \nFrightening to me such insanity and ignorance still exists in 2008.  \nStunning!\n\nw\nॐ\n\nOn Oct 10, 2008, at 7:14 PM, wgungfu wrote:\n\n&gt; Correct, and a lot of that appropriation happened during the several\n&gt; different inquisitions (1100&#39;s through 1600&#39;s) where the Catholic\n&gt; Church first sought to secure its dominance over other sects of\n&gt; Christianity and then moved on to others over time. That&#39;s where you\n&gt; have things like the King James Bible appear out of (during the later\n&gt; part of that period), which pretty much replaced everything with\n&gt; &quot;devil&quot; and &quot;demon&quot; (which one depends on which version of KJ you  \n&gt; read).\n\n\nYes. I 's amazing how many who claim o be Ch is ians a e clueless abou hei own his o y. O cou se he ea ly chu ch didn' allow such knowledge and i was much easie o con ol people who didn' know abou hei di y deeds. Only P ies s we e allowed o ead o a good long ime. C azy. Keep people uneduca ed & a aid and you can do p e y much any hing wi h hem. This is ampan in he US oday. F igh ening o me such insani y and igno ance s ill exis s in 2008. S unning!w ॐ  On Oc 10, 2008, a 7:14 PM, wgung u w o e:Co ec , and a lo o ha app op ia ion happened du ing he se e aldi e en inquisi ions (1100's h ough 1600's) whe e he Ca holicChu ch i s sough o secu e i s dominance o e o he sec s o Ch is iani y and hen mo ed on o o he s o e ime. Tha 's whe e youha e hings like he King James Bible appea ou o (du ing he la e pa o ha pe iod), which p e y much eplaced e e y hing wi h\"de il\" and \"demon\" (which one depends on which e sion o KJ you ead)."}