{"id": "12534", "subject": "Re: The Ghost Box, is training required?", "author": "itcdeadpeople", "timestamp": "2008-10-11T18:01:01Z", "full_text": "Hi Don.  I started getting apparent intentional communication right away.  My first unit \nwas the new 12-469 (which I&#39;ve since stopped using because I can&#39;t stand the click-click-\nclicking).  I turned it on and the ears bud, which I was trying to place on my laptop near \nthe built-in mic slid across the area.  Someone immediately said, &quot;Hey, watch it!&quot;  \n\nI get a lot of sentences (I don&#39;t mean after being pieced together, I&#39;m getting multiple word \nresponses grouped together in a single unedited sentence) and that helps to know it is \nintentional communication.  I think one word responses can be just as easily intentional.  If \nyou ask for a name and get name, if you ask a yes/no question and get one of those \nwords I think that counts as communication.  \n\nThe other week, I asked which of two cats foods they recommended and got a single word \nresponse that was the first ingredient (duck) of one of the foods.  I know that might sound \nlike a silly question, but I&#39;ve gotten to think of my communicators as friends so sometimes \nI ask things like this.  \n\nI&#39;ve not done any work with any type of echo chambers.  I find that playing the sound from \nthe radio into the air, and recording via the built-in mic in my computer, keeps \neverything really simple (LOL - I like simple) and it allows me to catch some of what is \nbeing said real-time.\n\nI think others on here are successfully using echo chambers and/or multiple radios so \nhopefully they&#39;ll be able to give you more input.\n\nI hope you start getting more responses soon.  Sometimes, too, it takes a bit of time for \nhearing to become accustomed to the unique sound of sweep and the less clear responses \nare not always as apparent.  The more practiced a person gets at working with sweep, the \nmore that is caught while listening.  Just my thoughts on that.  Others may or may not \nagree.  :-)\n \nMargaret\n\n--- In EVP-ITC@yahoogroups.com, don powell &lt;dpowell7299@...&gt; wrote:\n&gt; \n&gt; I was wondering something,.  Actually 2 things.\n&gt; \n&gt; 1) I have been trying mine for a week or so.  How long does it\n&gt; take most of you before you get something?  I&#39;ve gotten one word\n&gt; things but they are subject to interpetation as to whether they were\n&gt; real answers.\n&gt; \n&gt; 2) Testing echo boxes seems to make it better but does anyone\n&gt; know the correct dimensions?  I could not find it anywhere.\n&gt;"}