{"id": "12598", "subject": "Re: Looking for Volunteers to ssist on missing person cases", "author": "itcdeadpeople", "timestamp": "2008-10-15T20:33:21Z", "full_text": "Hi Suzanne.  I had to copy/paste the entire link into a new browser window (there is a \nportion of the addy on the second line.)  Not sure if this will work for you too. Try this one \nand see if it will get you to the home page:\n\nhttp://tech.groups.yahoo.com/group/SDWR-SpeakingToTheDeadWithRadios/\n\nHope it works!\nMargaret\n\n--- In EVP-ITC@yahoogroups.com, suzanne bibb &lt;suzyq6819@...&gt; wrote:\n&gt;\n&gt; Hi Mike \n&gt; \n&gt; My name is Suzanne May and my team and I are very interested in helping in any way \npossible. I am having trouble with the link. Please advise or I can be reached at \nsuzyq6819@...\n&gt; \n&gt; Thanks\n&gt; \n&gt; Suzanne May\n&gt; Director, MMPS\n&gt; \n&gt; --- On Wed, 10/15/08, Michael E &lt;f1cracker75@...&gt; wrote:\n&gt; \n&gt; From: Michael E &lt;f1cracker75@...&gt;\n&gt; Subject: [EVP-ITC] Looking for Volunteers to ssist on missing person cases\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Wednesday, October 15, 2008, 2:58 PM\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Hello everyone. I am a member of your group, but also have my own\n&gt; group consisting of people that work to assist law\n&gt; enforcement/ missing person organizations using their radios or\n&gt; psychic/medium skills.\n&gt; \n&gt; I am looking for volunteers to record with deceased victims to try\n&gt; and help solve cases managed by Nancy Angelbound.\n&gt; \n&gt; These are cold case files.\n&gt; \n&gt; Anyone interested, please join my site and go to the links page to\n&gt; see the cases. http://tech. groups.yahoo. com/group/ SDWR-\n&gt; SpeakingToTheDeadWi thRadios/ ?yguid=338683728\n&gt; \n&gt; We ask you send your files to Nancy directly to ensure this\n&gt; information does not leak into public hands possibly causing harm to\n&gt; the family or police investigation.\n&gt; \n&gt; Nancy Angelbound will work with you directly and she will get the\n&gt; info you provide to proper authorities.\n&gt; \n&gt; For your personal reward, you help the victim find closure, the\n&gt; family find closure and law enforcement close the case.\n&gt; \n&gt; Please accept my invitation to help those in need, and thanks in\n&gt; advance.\n&gt; \n&gt; Mike Edwards\n&gt;"}