{"id": "12627", "subject": "Re: New member hello", "author": "mercifulrelease", "timestamp": "2008-10-28T07:06:13Z", "full_text": "Hi Misty,\n\nThanks for the luck :-)  I am familiar with ufogeek&#39;s YouTube videos\nand he does provide a lot of information.  I had not heard of Steve\nHultay and will look him up when I get a chance.  I am familiar with\nthe Radio Shack hack radios and manual tune methods.  I still want to\nbuild my own though :-)  I&#39;m an EE and it&#39;s kind of a pride thing. \nPlus, I can explain the data better if I&#39;m using a device I actually\nunderstand and can poke and prod as needed.  The dead zone is a good\nidea and not something I&#39;ve heard of before.  This might be a dumb\nquestion, but has anyone experimented with pure (white, pink, etc.)\nnoise as a source for collecting EVP?\n\nI look forward to hearing the samples you all have collected...\n\nAnna\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;Misty&quot; &lt;bulletbabea@...&gt; wrote:\n&gt;\n&gt; Hi Anna\n&gt; \n&gt; Welcome to the group. Good luck on building your box. I guess the \n&gt; first easiest place to direct you would be Mike Coletta&#39;s website. He \n&gt; has posted alot of DIY how-to videos for newbies on how to modify a \n&gt; radio yourself to work similar to Franks boxes. His youtube page has \n&gt; most of that stuff but his websites interesting to keep up with as \n&gt; well =) \n&gt; \n&gt; http://www.youtube.com/ufogeek\n&gt; http://www.ufomagazine.net/\n&gt; \n&gt; (Thanks for posting those again Mike)\n&gt; \n&gt; While your on youtube you may want to check out some other peoples \n&gt; videos on how to modify an existing radio. Franks modified a number \n&gt; of different types as have others like Steve Hultay. Steve posted a \n&gt; list of the ones he&#39;s been able to modify. Usually it requires \n&gt; nothing more than snipping  the mute wire. The archives on this group \n&gt; are a wealth of information just use the keyword search.\n&gt; \n&gt; You also may want to try out manual sweep Most people find that \n&gt; brings in very good results. For manual sweep you are just sweeping \n&gt; the band. I prefer to use a radio with a knob dial. Then just start \n&gt; turning it back and forth across the band quickly so it doesnt have \n&gt; quite enough time to tune in any one radio station.\n&gt; \n&gt; I also have had quite a bit of success using a dead zone spot in \n&gt; between any stations so that its set to off station and all I hear \n&gt; live is the radios static/whir. I have posted examples of some of \n&gt; these methods off my website.\n&gt; \n&gt; http://misty.xm.com\n&gt; \n&gt; Good luck on your quest!\n&gt; Misty\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;mercifulrelease&quot; \n&gt; &lt;mercifulrelease@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hi Everyone!\n&gt; &gt; \n&gt; &gt; I&#39;m new and I stumbled onto this group after doing some research\n&gt; &gt; online into EVP.  I consider myself to be a paranormal skeptic, but \n&gt; I\n&gt; &gt; have heard some very interesting EVP evidence and would like to look\n&gt; &gt; into it further.  I joined this group because I am interested in\n&gt; &gt; submitting EVP data to some rigorous scientific analysis.  I&#39;m an\n&gt; &gt; electrical engineer and mainly work in the areas of signal \n&gt; processing\n&gt; &gt; and communications so all of this is extremely interesting.  \n&gt; &gt; \n&gt; &gt; I am interested in collecting some of my own data (at some point) by\n&gt; &gt; building a ghost box based on Frank Sumption&#39;s designs.  I am \n&gt; working\n&gt; &gt; from the &quot;Ghost Box Notebook&quot; from 2007, but I am having a hard time\n&gt; &gt; getting started.  Has anyone built one of these and are there any\n&gt; &gt; parts lists or more complete schematics floating around? I would\n&gt; &gt; appreciate any build help or advice any of you might have.\n&gt; &gt; \n&gt; &gt; Regards,\n&gt; &gt; \n&gt; &gt; Anna\n&gt; &gt;\n&gt;"}