{"id": "12628", "subject": "Re: New member hello", "author": "mercifulrelease", "timestamp": "2008-10-28T07:15:19Z", "full_text": "Hi Ron,\n\nI appreciate the warm greeting and the links.  I am somewhat familiar\nwith all of those products but I would rather try and build one\nmyself.  I&#39;m an EE and it&#39;s kind of a pride thing.  Plus, I can\nexplain the data better if I&#39;m using a device I actually understand\nand can poke and prod as needed.  So, I&#39;d kind of like to have a\ndecent understanding of the equipment before I start to collect\nsamples.  I will look into the EVP software.  I was going to use\nAudacity and some MATLAB tools we use on a regular basis, but that\nmight be faster.  I&#39;ll try to answer any questions you might have\nregarding signal processing or electromagnetic communications phenomena.\n\nAnyway, thanks again for the introduction.  I look forward to seeing\nall of your work.  \n\nRegards,\n\nAnna\n\n\n\n--- In EVP-ITC@yahoogroups.com, Ron Lederer &lt;ronriko@...&gt; wrote:\n&gt;\n&gt; \n&gt; \n&gt; \n&gt; Hi Anna I am normally not a greater for the group but I see\neveryone is a bit slower than normal in responding to a new member.\nWelcome. I am certain others can answer your technical questions\nbetter than I so I will not attempt to here. Let me suggest that you\ntake a look at other alternatives that will allow you to begin doing\nevp recordings yourself in a blink of the eye and with less than $50\ninvested. You can also explore a couple sites where good equipment is\navailable to buy off the shelf that will give evp results. Hereis\nstuff you might find useful. You can always build your own as you\nmove along in the process. I am glad you are with us. I have some\ntechnical questions you might be able to help research...like learning\nabout the frequencies of &quot;their&quot; transmission etc. but I ll save\nthat. Ron l\n&gt; \n&gt; \n&gt; \n&gt;  \n&gt; http://paranormalsystems.comRon Rickettshas a Mini Box II that has\nall the bells a whistles you can want. Recommended even by Frank S. \n&gt;  \n&gt; www.UFOGeek.com definitely check this out because Mike Coletta (a\nmember) shows you how to hack all the radio shack radios so they can\nbe used for EVP. They work fine and can cost less that $25. \n&gt;  \n&gt; www.digitaldowsing. com ---Bill sells The ovilus, a portable\nhand-held unit andthe Pucka computer based unit.Uses speakjet\ncomputer generated sounds.\n&gt; buy.\n&gt; \n&gt; Then there isEVP Maker w/allophone file at\nhttp://www.keyportparanormal. com/evpsoftware. html This I believe\nis free to download to your computer and is a proven system for EVP. \n&gt; \n&gt; Hope this helps. Personally, I like the Radio Shack 125 as a\nstarter. Proven by many here. I have an Ovilus, Evpmaker and just\nordered the Mini Box II.Good luck. ron l\n&gt; \n&gt; \n&gt;  \n&gt;  \n&gt;  \n&gt;  \n&gt;  \n&gt;  \n&gt; \n&gt; \n&gt; --- On Sun, 10/26/08, mercifulrelease &lt;mercifulrelease@...&gt; wrote:\n&gt; \n&gt; From: mercifulrelease &lt;mercifulr release@...&gt;\n&gt; Subject: [EVP-ITC] New member hello\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Sunday, October 26, 2008, 6:52 PM\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Hi Everyone!\n&gt; \n&gt; I&#39;m new and I stumbled onto this group after doing some research\n&gt; online into EVP. I consider myself to be a paranormal skeptic, but I\n&gt; have heard some very interesting EVP evidence and would like to look\n&gt; into it further. I joined this group because I am interested in\n&gt; submitting EVP data to some rigorous scientific analysis. I&#39;m an\n&gt; electrical engineer and mainly work in the areas of signal processing\n&gt; and communications so all of this is extremely interesting. \n&gt; \n&gt; I am interested in collecting some of my own data (at some point) by\n&gt; building a ghost box based on Frank Sumption&#39;s designs. I am working\n&gt; from the &quot;Ghost Box Notebook&quot; from 2007, but I am having a hard time\n&gt; getting started. Has anyone built one of these and are there any\n&gt; parts lists or more complete schematics floating around? I would\n&gt; appreciate any build help or advice any of you might have.\n&gt; \n&gt; Regards,\n&gt; \n&gt; Anna\n&gt;"}