{"id": "12624", "subject": "Re: New member hello", "author": "ourobouros2k2", "timestamp": "2008-10-27T21:29:28Z", "full_text": "Welcome. I too started from an extremely skeptical perception of\nbox-related itc, however it didn&#39;t take long to change that. This is a\nfield where the results truly speak for themselves (no pun intended).I\nhope that you find what you are seeking with this avenue of\ncommunication, and there are many fine people here who are always\nwilling to help.\n\nthanks,\nAndy\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;ghuny1&quot; &lt;itcnap@...&gt; wrote:\n&gt;\n&gt; Hi Ron, \n&gt; For some reason it came up as spam, have no clue why, that&#39;s Yahoo for\n&gt; ya. I caught as soon as i got and moved it forward for ya!!\n&gt; LK\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Ron Lederer &lt;ronriko@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Sorry Anna, I sent a reply to this twice but my email has not yet\n&gt; been posted for the group. Not sure what&#39;s up. This is another test\n&gt; and I will wait to see if the previous message comes through before I\n&gt; resend. ron \n&gt; &gt; \n&gt; &gt; --- On Sun, 10/26/08, mercifulrelease &lt;mercifulrelease@&gt; wrote:\n&gt; &gt; \n&gt; &gt; From: mercifulrelease &lt;mercifulrelease@&gt;\n&gt; &gt; Subject: [EVP-ITC] New member hello\n&gt; &gt; To: EVP-ITC@yahoogroups.com\n&gt; &gt; Date: Sunday, October 26, 2008, 6:52 PM\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; Hi Everyone!\n&gt; &gt; \n&gt; &gt; I&#39;m new and I stumbled onto this group after doing some research\n&gt; &gt; online into EVP. I consider myself to be a paranormal skeptic, but I\n&gt; &gt; have heard some very interesting EVP evidence and would like to look\n&gt; &gt; into it further. I joined this group because I am interested in\n&gt; &gt; submitting EVP data to some rigorous scientific analysis. I&#39;m an\n&gt; &gt; electrical engineer and mainly work in the areas of signal processing\n&gt; &gt; and communications so all of this is extremely interesting. \n&gt; &gt; \n&gt; &gt; I am interested in collecting some of my own data (at some point) by\n&gt; &gt; building a ghost box based on Frank Sumption&#39;s designs. I am working\n&gt; &gt; from the &quot;Ghost Box Notebook&quot; from 2007, but I am having a hard time\n&gt; &gt; getting started. Has anyone built one of these and are there any\n&gt; &gt; parts lists or more complete schematics floating around? I would\n&gt; &gt; appreciate any build help or advice any of you might have.\n&gt; &gt; \n&gt; &gt; Regards,\n&gt; &gt; \n&gt; &gt; Anna\n&gt; &gt;\n&gt;"}