{"id": "12645", "subject": "Re: Curious!", "author": "M.A. Coletta (Mike)", "timestamp": "2008-10-31T00:12:52Z", "full_text": "Hi Frank,\n\nPlease excuse me if I appear confused... but I am. How am I shunning \ncontact with you?  Did I miss something?\nDid you send me something or call me and I did not receive it?\n\nThanks,\nMike\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@...&gt; \nwrote:\n&gt;\n&gt; \n&gt;  UFO Geek lives like an hour drive to the south of me, calls \nhimslef a &#39;Ghost Boxologist&#39;, yet seemingly shuns contact from \nthe &#39;Ghost Box master&#39;--wierd.   I know I can come across as a total \ndork on e-mail, but that&#39;s can be deceiving. Or-perhaps being a The \nPrincess, some fear gayness, which I ain&#39;t even though girliness is \ndifficult to completely mask. \n&gt;  \n&gt;  I&#39;m guessing there&#39;s some fear of repercussings for making boxes, \nbut I have often stated there are many ways to do this stuff, as well \nas different methods to use raw audio, such as white noise, DRV, \nrunning water, EVPmaker or foreign language--IT&#39;S ALL THE SAME! The \nconcept is the same, provide something for entities to form voices \nout of and they will speak. I am also not the only &quot;one from the \nstars&quot; here, many of us have these dual--or more--personalities.  Ya \nnever really know who you are talking to. I also don&#39;t jump on the \nusual paranormal BS everyone else repeats-endlessly. Most of that \nstuff is urban myth and legend passed off as facts. Now, I&#39;m felling \nreally far behind, since I don&#39;t even have a podcast!   Just a \nthought--of course, that&#39;s working without tools again. I mean I can \nbe brain dead, it never occured to me to use other digital radios \nuntil the hack boxes came out, and it was like DAH! Which lead to \nimprovements in sound quality. I have to use pre-made radios since my \nhome radios are C-R-A-P-P-Y! Another reason why I can&#39;t mass produce \nthis junk. \n&gt;  \n&gt;  I know it really pisses people off by the way I give some of the \nboxes out, but I can&#39;t make many--so I have to go on intuition-sorta \nkinda- as to who gets them. It seems the boxes just don&#39;t work for \neveryone, so deciding who gets it is difficult. \n&gt;  \n&gt;  The antenna shield is only maybe a half dozen turns of solid wire \nover the end of the AM rod antenna--loosly over the antenna coil,  \nthen the other end of the wire is grounded through a switch. The end \nof the extra wire on the antenna rod is left un-connected to \nanything. \n&gt;  \n&gt;  Frank-S\n&gt; _________________________________________________________________\n&gt; Store, manage and share up to 5GB with Windows Live SkyDrive.\n&gt; http://skydrive.live.com/welcome.aspx?provision=1?\nocid=TXT_TAGLM_WL_skydrive_102008\n&gt;"}