{"id": "12661", "subject": "Re: 12-150 alternate hack, little bit easier", "author": "ourobouros2k2", "timestamp": "2008-11-01T23:29:21Z", "full_text": "Yeah, my hands were just too big to get underneath to sneak a peek at\nthe screenprinted labels. I had to cut all the antenna leads (easy\nfix) and desolder the two wire bundles with the white and grey wires.\nAfter that I was able to lift the board enough to see under there. It\nwas a bear, no doubt. Honestly I just couldnt get my fingers far\nenough under the board with cutters to ensure I was cutting the right\nwire. \n\nthanks\nAndy\n\n--- In EVP-ITC@yahoogroups.com, &quot;Steve Hultay&quot; &lt;urkel23@...&gt; wrote:\n&gt;\n&gt; \n&gt; Andy, \n&gt; \n&gt; I&#39;ll try that with the next one, it seems much easier.  The way i \n&gt; originally did it only took 10 minutes though, but breaking a solder \n&gt; connection does seem better.\n&gt; \n&gt; Thanx,\n&gt; -Steve H.\n&gt; \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;ourobouros2k2&quot; &lt;ourobouros2k2@&gt; \n&gt; wrote:\n&gt; &gt;\n&gt; &gt; Full credit to Steve Hultay for discovering the hackability of this\n&gt; &gt; radio, and as he had mentioned in the past, it really wasn&#39;t the\n&gt; &gt; easiest. After tearing it apart, cutting, desoldering, etc...to \n&gt; locate\n&gt; &gt; the mute wire/pin/solder pad, I found out that it can be one of the\n&gt; &gt; easiest hacks out there. \n&gt; &gt; \n&gt; &gt; Rather than disassembling and such, simply cut the trace on each \n&gt; side\n&gt; &gt; of the mute pin solder pad. Takes about 30 seconds with a hobby \n&gt; knife.\n&gt; &gt; I felt really stupid after 4 hours taking everything apart and\n&gt; &gt; desoldering wires, etc...\n&gt; &gt; \n&gt; &gt; instructions with photos can be found on my blog if interested. \n&gt; &gt; \n&gt; &gt; http://blog.myspace.com/index.cfm?\n&gt; fuseaction=blog.view&friendID=405441717&blogID=445524854\n&gt; &gt; \n&gt; &gt; The sound quality of this thing really rocks, and I love the \n&gt; external\n&gt; &gt; antenna options...\n&gt; &gt; \n&gt; &gt; thanks \n&gt; &gt; Andy\n&gt; &gt;\n&gt;"}