{"id": "12670", "subject": "Re: INFO for ALL a show about ITC and live events!! NOT Spam!", "author": "ourobouros2k2", "timestamp": "2008-11-04T20:12:26Z", "full_text": "I have most of their shows archived on my ipod. They really put\ntogether an informative show, with regular live rtsc/itc sessions with\none of their 3 devices. Their devices, derivatives of Mike&#39;s\nspiricomp, are pretty cool, and their sessions are very cool to listen\nto. Gotta say I am a fan of this show, and if you haven&#39;t heard them\nyet, I think you will like them. Of course I love the fact that they\nare focused on itc/rtsc.\n\nthanks\nAndy\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;ghuny1&quot; &lt;itcnap@...&gt; wrote:\n&gt;\n&gt; Hi All,\n&gt; Found this fascinating for all the ITC-RSTC  researchers out there!\n&gt; \n&gt; On http:// Para-x.com &lt;http://para-x.com&gt;   radio!!! A station filled\n&gt; with a lot of guests and different shows including mine with\n&gt; International Paranormal!!\n&gt; \n&gt; SHOW: Voices Carry Paranormal Talk Radio\n&gt; \n&gt; TIME: Sundays at 6 PM Eastern\n&gt; \n&gt; THEME: ITC (Instrumental Trans Communication), EVP , Frank&#39;s Box,\n&gt; Ghost Box, ITC device, Ghost Hunters, Ghosts, Haunted, Haunting,\n&gt; Investigations, Paranormal, Spiritual, Research.\n&gt; \n&gt; HOST(s): Bob Meyers and Mark Sarro\n&gt; \n&gt; WEB: http://www.voicescarryradio.com\n&gt; \n&gt; EMAIL: voicescarryradio@...\n&gt; \n&gt; OTHER INFO:\n&gt; Our investigative group site www.chestercountyprs.com The Voices Carry\n&gt; Paranormal Talk Radio show in association with CCPRS (Chester County\n&gt; Paranormal Research Society) located in West Chester, PA, prides itself\n&gt; in conducting scientific research with the latest and most up- to- date\n&gt; ITC (Instrumental Trans Communication) devices in the paranormal field.\n&gt; Our ITC devices that we possess are handmade and exclusively developed\n&gt; for spirit communication as we attempt to communicate with beings from\n&gt; the other side. Our shows each week include interviews with big name\n&gt; guests in the field, research findings, conversations or call-ins with\n&gt; our listeners and best of all real &quot;Live&quot; interactive ITC\n&gt; sessions on air where our listeners can interact and be a part of the\n&gt; actual sessions! Yes folks.this is real time EVP where you get to\n&gt; hear responses immediately from our feedback picked up by our ITC\n&gt; prototypes. There is no other paranormal show around like it.be\n&gt; sure to listen in and be a part of The Voices Carry Paranormal Radio\n&gt; Talk show REVOLUTION!\n&gt;"}