{"id": "12686", "subject": "for David   Re: [EVP-ITC] Re: Chris Moon and his use of Franks Box gets slammed", "author": "SUZANNE", "timestamp": "2008-11-09T00:08:39Z", "full_text": "Hi Ron!\n\nI myself was very pleased to read your last posting!  My team and I \nhave been using the box for less than three weeks,  I will post the \nresults on esnips.  I have become increasingly aware that there is a \nlot more going on than simply speaking with the other side (what we \nonce considered those who have passed.)  It appears that there are \ncommunications coming in from various avenues that I am unfamiliar \nwith.  Some are pleasant, some are angry, and some seem to come from \na place or places that I have yet to grasp!  I am pleased to know \nthat you are out there seraching, researching with an open mind as we \nare here in MI!  The box is a whole different ball game.  I am so \npleased that I am not alone in this research.  Thank you Frank, Ron  \nand everyone in this group.\n\nSuzanne May\nDirector \nMI Metro Paranormal Society\n\n--- In EVP-ITC@yahoogroups.com, Ron Lederer &lt;ronriko@...&gt; wrote:\n&gt;\n&gt; Thanks David for coming out with info on Dr Rorke. I will tell you \nbriefly that some of the info he provided in the C2C show and on his \nweb site was a real eye opener for me. I have now completed about \none year of checking out EVP and I have learned an awful lot about \nmyself and the other side. One year ago when I began my \ninvestigation I would not have dared make such a claim to the public \nnor to myself. \n&gt; \n&gt; I do understand a bit about the scientific process. But, I would \nwelcome anyone from the scientificworld to do one simple thing: \njoin this or another EVP group, buy a radio shack hack, modify it for \nless than $50, and go talk to yourself somewhere with the hack turned \non. Now, that does not sound like a scientific approach, but what I \nam finding in my research is that supposedly serious scientific \nresearchers will not do this simple test. When I ask them to come \ncheck outour group and participate with their ownboxthey instead \nchoose to sit on the sidelines and wait for others to offer proof to \nthem.Maybe there is no research money in it for them...who would \ngive big bucks for EVP research? However, it seems to me that any \nserious investigator in this arena would jump at a chance test it out \nfor $50 and two months of their time...part time.\n&gt; \n&gt; My challenge would be for any &quot;scientific researcher&quot;, therefore, \nis to come join a group, buy a box, try to communicate,share results \nwith the group,share what others are experiencing,and truly \nparticipate with the group. In a month or two, the researcher can \nthen quit thegroup, if he or she wishes, and begin &quot;real&quot; research. \nI say this becauseIam confident that theirexperience with actually \ngetting involvedas anon-scientist will be transformational in two \nmonths or less.Oh yea,this serious researcher shouldknow that \nhe/she can join a group without anyone knowing who they really are. \nGet a new email address and go for it. \n&gt; \n&gt; If someone goes through this simple process and still wants to \napply the scientific method to this study, I for one, would volunteer \nto assist them in any way. That is, after they use a box for two \nmonths. \n&gt; \n&gt; Having said all that, I remain very interested inwhat Dr. Rorke \nsaid, particularly about &quot;other&quot;communicators whomay be coming \nthrough whowe takeas EVP phenomena. This is very troubling to me \nand I will continue to look into it.Thanks again for your \ninfo.  \n&gt; ron l\n&gt; \n&gt; --- On Sat, 11/8/08, David Rountree &lt;ghost_hunter_01@...&gt; wrote:\n&gt; \n&gt; From: David Rountree &lt;ghost_hunter_01@...&gt;\n&gt; Subject: [EVP-ITC] Re: Chris Moon and his use of Franks Box gets \nslammed\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Saturday, November 8, 2008, 12:21 PM\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Yes I have experience with Dr. Rorke. He is coming at it from a \nscientific POV. His stance is based on the lack of scientific \nevidence, controlled experiments and claims that can easily be \nduplicated. This is why ITC is scoffed by the scientific community. \nMaking extraordinary claims without scientific evidence to back it up \nmakes every EVP researcher look like a cool aid drinker. Mr. Moon \noriginally indicated that only a magic thirty people could make the \ndevice work, which would suggest selective physics. Physics works the \nsame for everyone, and any real proof must have scientific principles \nbacking it up.\n&gt; \n&gt; He is open to there being something to it. It just hasn&#39;t stood up \nyet to serious scientific scrutiny. So far it has failed at every \nturn. Spiricom was a fraud. The interesting part of the story is why \nit was a fraud. It reveals things about the individuals psychology \nthat gives a great deal of insight about perceptions and ego. We want \nto believe it works, and often times it makes us fall victim to \npareidolia. Case in point. Take a recording of a voice produced by \nany one of these devices. Play it in isolation to five people. Have \nthem write down what they hear. If they all hear the same thing \nalone, then there is something to it. If they all hear something \ndifferent, it is Gaussian noise and pareidolia, a well documented \neffect.\n&gt; \n&gt; This is why serious, disciplined research is tantamount to this \npart of the field ever being taken seriously.\n&gt; \n&gt; David M. Rountree, AES\n&gt; Scientific Paranormal Investigative\n&gt; Research Information and Technology\n&gt; \n&gt; www.spinvestigation s.org\n&gt; \n&gt;"}