{"id": "12685", "subject": "for David   Re: [EVP-ITC] Re: Chris Moon and his use of Franks Box gets slammed", "author": "Ron Lederer", "timestamp": "2008-11-08T23:55:48Z", "full_text": "--0-544925432-1226188548=:37188\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nThanks David for coming out with info on Dr Rorke.=A0 I will tell you brief=\r\nly that some of the info he provided in the C2C show and on his web site wa=\r\ns a real eye opener for me.=A0 I have now completed about one year of check=\r\ning out EVP and I have learned an awful lot about myself and the other side=\r\n.=A0 One year ago when I began my investigation I would not have dared make=\r\n such a claim to the public nor to myself.=A0 \n=A0\nI do understand a bit ab=\r\nout the scientific process.=A0 But, I would welcome anyone from the scienti=\r\nfic=A0world to do one simple thing:=A0 join this or another EVP group, buy =\r\na radio shack hack, modify it for less than $50, and go talk to yourself so=\r\nmewhere with the hack turned on.=A0 Now, that does not sound like a scienti=\r\nfic approach, but what I am finding in my research is that supposedly serio=\r\nus scientific researchers will not do this simple test.=A0 When I ask them =\r\nto come check out=A0our group and participate with their own=A0box=A0they i=\r\nnstead choose to sit on the sidelines and wait for others to offer proof to=\r\n them.=A0=A0=A0Maybe there is no research money in it for them...who would =\r\ngive big bucks for EVP research?=A0 However, it seems to me that any seriou=\r\ns investigator in this arena would jump at a chance test it out for $50 and=\r\n two months of their time...part time.\n=A0\nMy challenge would be for any &quot;s=\r\ncientific researcher&quot;, therefore, is to come join a group, buy a box, try t=\r\no communicate,=A0share results with the group,=A0share what others are expe=\r\nriencing,=A0and truly participate with the group.=A0 In a month or two, the=\r\n researcher can then quit the=A0group, if he or she wishes, and begin &quot;real=\r\n&quot; research.=A0 I say this because=A0I=A0am confident that their=A0experienc=\r\ne with actually getting involved=A0as a=A0non-scientist will be transformat=\r\nional in two months or less.=A0=A0Oh yea,=A0this serious researcher should=\r\n=A0know that he/she can join a group without anyone knowing who they really=\r\n are.=A0 Get a new email address and go for it.=A0 \n=A0\nIf someone goes thr=\r\nough this simple process and still wants to apply the scientific method to =\r\nthis study, I for one, would volunteer to assist them in any way.=A0 That i=\r\ns, after they use a box for two months.=A0 \n=A0\nHaving said all that, I rem=\r\nain very interested in=A0what Dr. Rorke said, particularly about=A0 &quot;other&quot;=\r\n=A0communicators who=A0may be coming through who=A0we take=A0as EVP phenome=\r\nna.=A0 This is very troubling to me and I will continue to look into it.=A0=\r\n=A0=A0Thanks again for your info.=A0 =A0=A0 \nron l\n\n--- On Sat, 11/8/08, Da=\r\nvid Rountree &lt;ghost_hunter_01@...&gt; wrote:\n\nFrom: David Rountree &lt;gh=\r\nost_hunter_01@...&gt;\nSubject: [EVP-ITC] Re: Chris Moon and his use of=\r\n Franks Box gets slammed\nTo: EVP-ITC@yahoogroups.com\nDate: Saturday, Novemb=\r\ner 8, 2008, 12:21 PM\n\n\n\n\n\n\n\nYes I have experience with Dr. Rorke. He is com=\r\ning at it from a scientific POV. His stance is based on the lack of scienti=\r\nfic evidence, controlled experiments and claims that can easily be duplicat=\r\ned. This is why ITC is scoffed by the scientific community. Making extraord=\r\ninary claims without scientific evidence to back it up makes every EVP rese=\r\narcher look like a cool aid drinker. Mr. Moon originally indicated that onl=\r\ny a magic thirty people could make the device work, which would suggest sel=\r\nective physics. Physics works the same for everyone, and any real proof mus=\r\nt have scientific principles backing it up.\n=A0\nHe is open to there being s=\r\nomething to it. It just hasn&#39;t stood up yet to serious scientific scrutiny.=\r\n So far it has failed at every turn. Spiricom was a fraud. The interesting =\r\npart of the story is why it was a fraud. It reveals things about the indivi=\r\nduals psychology that gives a great deal of insight about perceptions and e=\r\ngo. We want to believe it works, and often times it makes us fall victim to=\r\n pareidolia. Case in point. Take a recording of a voice produced by any one=\r\n of these devices. Play it in isolation to five people. Have them write dow=\r\nn what they hear. If they all hear the same thing alone, then there is some=\r\nthing to it. If they all hear something different, it is Gaussian noise and=\r\n pareidolia, a well documented effect.\n=A0\nThis is why serious, disciplined=\r\n research is tantamount to this part of the field ever being taken seriousl=\r\ny.\n=A0\nDavid M. Rountree, AES\nScientific Paranormal Investigative\nResearch =\r\nInformation and Technology\n=A0\nwww.spinvestigation s.org\n=A0 \n\n\n\n\n\n\n\n\n\n\n\n\n\n=\r\n\n      \r\n--0-544925432-1226188548=:37188\r\nContent-Type: text/html; charset=us-ascii\r\n\r\n&lt;table cellspacing=&quot;0&quot; cellpadding=&quot;0&quot; border=&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=&quot;top&quot; style=&quot;font: inherit;&quot;&gt;&lt;DIV&gt;Thanks David for coming out with info on Dr Rorke.&nbsp; I will tell you briefly that some of the info he provided in the C2C show and on his web site was a real eye opener for me.&nbsp; I have now completed about one year of checking out EVP and I have learned an awful lot about myself and the other side.&nbsp; One year ago when I began my investigation I would not have dared make such a claim to the public nor to myself.&nbsp; &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I do understand a bit about the scientific process.&nbsp; But, I would welcome anyone from the scientific&nbsp;world to do one simple thing:&nbsp; join this or another EVP group, buy a radio shack hack, modify it for less than $50, and go talk to yourself somewhere with the hack turned on.&nbsp; Now, that does not sound like a scientific approach, but what I am finding in my research is that supposedly serious scientific researchers will not do this simple test.&nbsp; When I ask them to come check out&nbsp;our group and participate with their own&nbsp;box&nbsp;they instead choose to sit on the sidelines and wait for others to offer proof to them.&nbsp;&nbsp;&nbsp;Maybe there is no research money in it for them...who would give big bucks for EVP research?&nbsp; However, it seems to me that any serious investigator in this arena would jump at a chance test it out for $50 and two months of their time...part time.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;My challenge would be for any &quot;scientific researcher&quot;, therefore, is to come join a group, buy a box, try to communicate,&nbsp;share results with the group,&nbsp;share what others are experiencing,&nbsp;and truly participate with the group.&nbsp; In a month or two, the researcher can then quit the&nbsp;group, if he or she wishes, and begin &quot;real&quot; research.&nbsp; I say this because&nbsp;I&nbsp;am confident that their&nbsp;experience with actually getting involved&nbsp;as a&nbsp;non-scientist will be transformational in two months or less.&nbsp;&nbsp;Oh yea,&nbsp;this serious researcher should&nbsp;know that he/she can join a group without anyone knowing who they really are.&nbsp; Get a new email address and go for it.&nbsp; &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;If someone goes through this simple process and still wants to apply the scientific method to this study, I for one, would volunteer to assist them in any way.&nbsp; That is, after they use a box for two months.&nbsp; &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Having said all that, I remain very interested in&nbsp;what Dr. Rorke said, particularly about&nbsp; &quot;other&quot;&nbsp;communicators who&nbsp;may be coming through who&nbsp;we take&nbsp;as EVP phenomena.&nbsp; This is very troubling to me and I will continue to look into it.&nbsp;&nbsp;&nbsp;Thanks again for your info.&nbsp; &nbsp;&nbsp; &lt;/DIV&gt;\n&lt;DIV&gt;ron l&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Sat, 11/8/08, David &lt;SPAN&gt;&lt;SPAN&gt;Rountree&lt;/SPAN&gt;&lt;/SPAN&gt; &lt;I&gt;&lt;ghost_hunter_01@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;&lt;/DIV&gt;\n&lt;BLOCKQUOTE style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: rgb(16,16,255) 2px solid&quot;&gt;From: David Rountree &lt;ghost_hunter_01@...&gt;&lt;BR&gt;Subject: [EVP-ITC] Re: Chris Moon and his use of Franks Box gets slammed&lt;BR&gt;To: EVP-ITC@yahoogroups.com&lt;BR&gt;Date: Saturday, November 8, 2008, 12:21 PM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=yiv1452247824&gt;\n&lt;DIV id=ygrp-text&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;SPAN class=842021320-08112008&gt;&lt;FONT face=Arial&gt;Yes I have experience with Dr. Rorke. He is coming at it from a scientific POV. His stance is based on the lack of scientific evidence, controlled experiments and claims that can easily be duplicated. This is why ITC is scoffed by the scientific community. Making extraordinary claims without scientific evidence to back it up makes every EVP researcher look like a cool aid drinker. Mr. Moon originally indicated that only a magic thirty people could make the device work, which would suggest selective physics. Physics works the same for everyone, and any real proof must have scientific principles backing it up.&lt;/FONT&gt;&lt;/SPAN&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;SPAN class=842021320-08112008&gt;&lt;FONT face=Arial&gt;&lt;/FONT&gt;&lt;/SPAN&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;SPAN class=842021320-08112008&gt;&lt;FONT face=Arial&gt;He is open to there being something to it. It just hasn&#39;t stood up yet to serious scientific scrutiny. So far it has failed at every turn. Spiricom was a fraud. The interesting part of the story is why it was a fraud. It reveals things about the individuals psychology that gives a great deal of insight about perceptions and ego. We want to believe it works, and often times it makes us fall victim to pareidolia. Case in point. Take a recording of a voice produced by any one of these devices. Play it in isolation to five people. Have them write down what they hear. If they all hear the same thing alone, then there is something to it. If they all hear something different, it is Gaussian noise and pareidolia, a well documented effect.&lt;/FONT&gt;&lt;/SPAN&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;SPAN class=842021320-08112008&gt;&lt;FONT face=Arial&gt;&lt;/FONT&gt;&lt;/SPAN&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;SPAN class=842021320-08112008&gt;&lt;FONT face=Arial&gt;This is why serious, disciplined research is tantamount to this part of the field ever being taken seriously.&lt;/FONT&gt;&lt;/SPAN&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV align=left&gt;&lt;STRONG&gt;&lt;FONT face=Arial&gt;David M. Rountree, AES&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/DIV&gt;\n&lt;DIV align=left&gt;&lt;FONT face=Arial size=2&gt;Scientific Paranormal Investigative&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV align=left&gt;&lt;FONT face=Arial size=2&gt;Research Information and Technology&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV align=left&gt;&lt;FONT face=Arial size=2&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV align=left&gt;&lt;FONT face=Arial size=2&gt;&lt;A href=&quot;http://www.spinvestigations.org/&quot; target=_blank rel=nofollow&gt;www.spinvestigation s.org&lt;/A&gt;&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n      \r\n--0-544925432-1226188548=:37188--"}