{"id": "12690", "subject": "Re:for David   Re: [EVP-ITC] Re: Chris Moon and his use of Franks Box g", "author": "David Rountree", "timestamp": "2008-11-09T18:49:06Z", "full_text": "------=_NextPart_000_003C_01C94271.EF2448C0\r\nContent-Type: text/plain;\n\tcharset=&quot;us-ascii&quot;\r\nContent-Transfer-Encoding: 7bit\r\n\r\nI have tested all of the devices out there, Ron. I could take reams of paper\nher to explain what I received. The issue is, with so many things normal\nthat it can be, the task is proving what it is. If you haven&#39;t used RF\nspectrum analyzers, signal tracers, and RF field strength meters to\neliminate the probable causes, then it doesn&#39;t matter what claim is made.\nYou can&#39;t prove it. With Spiricom, for example, the Ghost of 29 MHz could\njust have easily been a truck on a CB radio, as they cover the same\nbandwidth. Every RF band out there has activity, of the living human\nvariety. In fact, most of the bands are choked with traffic. Personally,\nsince EVP can be captured without any of this technology, I find it\ndifficult to buy into RF being a tool, since we require special electronics\nto create it and communicate with it. Having also analyzed EMF and EVP\nsimultaneously and found them to be related, I have a tougher time with it.\nWe don&#39;t speak using radio frequencies. It would be common sense to believe\nif we ream conscious after to death at a pure energy state, we wouldn&#39;t\nradiate at that frequency either. We would modulate in the audio spectrum of\nour voice, and that seems to be where all the viable evidence is leading.\nThus it makes more sense to me that a real ghost talking device would use\nthe same methodology, such as modulating EMF to the voice. It is simple to\ndo and everyone can afford it, as well as it takes no special proprietary\ninstrumentation to do it. All you need is a mic, an amp and a speaker. You\nare not only creating sound, but a matching EMF field at the same time.\n \nPeople have different motivations, and different beliefs. I have always\napproached it from a scientific aspect, and it has served me well. I don&#39;t\nexpect anything, instead I wait to be surprised. Objective research is the\nkey. Now if people need to believe in it, that is fine too, but beliefs are\ndifferent from this is what it does. The truth is it may be possible that\nthis can communicate with something, possibly aliens or inter-dimensional\ncreatures, but we have no way to prove it due to everything else it can be.\nThis is precisely why a handful of researchers and scientists have started\nlooking at this stuff seriously. It is also why I am here. I want to learn\nas much as I can from the methods, devices and how they are being used in\norder to duplicate the work in a controlled environment, with equipment\nmonitoring the equipment and the users. That my friend, reveals far more\nthan you would imagine.\n \nDavid M. Rountree, AES\nScientific Paranormal Investigative\nResearch Information and Technology\n \nwww.spinvestigations.org &lt;http://www.spinvestigations.org/&gt; \n \n\r\n------=_NextPart_000_003C_01C94271.EF2448C0\r\nContent-Type: text/html;\n\tcharset=&quot;us-ascii&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML 4.0 Transitional//EN&quot;&gt;\n&lt;HTML&gt;&lt;HEAD&gt;=\r\n\n&lt;META http-equiv=3DContent-Type content=3D&quot;text/html; charset=3Dus-ascii&quot;&gt;=\r\n\n&lt;META content=3D&quot;MSHTML 6.00.6000.16735&quot; name=3DGENERATOR&gt;&lt;/HEAD&gt;\n&lt;BODY&gt;\n&lt;=\r\nDIV&gt;&lt;SPAN class=3D186573518-09112008&gt;&lt;FONT face=3DArial&gt;I have tested all o=\r\nf the \ndevices out there, Ron. I could take reams of paper her to explain w=\r\nhat I \nreceived. The issue is, with so many things normal that it can be, t=\r\nhe task is \nproving what it is. If you haven&#39;t used RF spectrum analyzers, =\r\nsignal tracers, \nand RF field strength meters to eliminate the probable cau=\r\nses, then it doesn&#39;t \nmatter what claim is made. You can&#39;t prove it. With S=\r\npiricom, for example, the \nGhost of 29 MHz could just have easily been a tr=\r\nuck on a CB radio, as they cover \nthe same bandwidth. Every RF band out the=\r\nre has activity, of the living human \nvariety. In fact, most of the bands a=\r\nre choked with traffic. Personally, since \nEVP can be captured without any =\r\nof this technology, I find it difficult to buy \ninto RF being a tool, since=\r\n we require special electronics to create it and \ncommunicate with it. Havi=\r\nng also analyzed EMF and EVP simultaneously and found \nthem to be related, =\r\nI have a tougher time with it. We don&#39;t speak using radio \nfrequencies. It =\r\nwould be common sense to believe if we ream conscious after to \ndeath at a =\r\npure energy state, we wouldn&#39;t radiate at that frequency either. We \nwould =\r\nmodulate in the audio spectrum of our voice, and that seems to be where \nal=\r\nl the viable evidence is leading. Thus it makes more sense to me that a rea=\r\nl \nghost talking device would use the same methodology, such as modulating =\r\nEMF to \nthe voice. It is simple to do and everyone can afford it, as well a=\r\ns it takes no \nspecial proprietary instrumentation to do it. All you need i=\r\ns a mic, an amp and \na speaker. You are not only creating sound, but a matc=\r\nhing EMF field at the same \ntime.&lt;/FONT&gt;&lt;/SPAN&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;SPAN class=3D18=\r\n6573518-09112008&gt;&lt;FONT face=3DArial&gt;&lt;/FONT&gt;&lt;/SPAN&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;SPAN c=\r\nlass=3D186573518-09112008&gt;&lt;FONT face=3DArial&gt;People have different \nmotivat=\r\nions, and different beliefs. I have always approached it from a \nscientific=\r\n aspect, and it has served me well. I don&#39;t expect anything, instead I \nwai=\r\nt to be surprised. Objective research is the key. Now if people need to \nbe=\r\nlieve in it, that is fine too, but beliefs are different from this is what =\r\nit \ndoes. The truth is it may be possible that this can communicate with so=\r\nmething, \npossibly aliens or inter-dimensional creatures, but we have no wa=\r\ny to prove it \ndue to everything else it can be. This is precisely why a ha=\r\nndful of researchers \nand scientists have started looking at this stuff ser=\r\niously. It is also why I am \nhere. I want to learn as much as I can from th=\r\ne methods, devices and how they \nare being used in order to duplicate the w=\r\nork in a controlled environment, with \nequipment monitoring the equipment a=\r\nnd the users. That my friend, reveals far \nmore than you would imagine.&lt;/FO=\r\nNT&gt;&lt;/SPAN&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV align=3Dleft&gt;&lt;STRONG&gt;&lt;FONT face=3DA=\r\nrial&gt;David M. Rountree, \nAES&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/DIV&gt;\n&lt;DIV align=3Dleft&gt;&lt;FONT =\r\nface=3DArial size=3D2&gt;Scientific Paranormal \nInvestigative&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DI=\r\nV align=3Dleft&gt;&lt;FONT face=3DArial size=3D2&gt;Research Information and \nTechno=\r\nlogy&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV align=3Dleft&gt;&lt;FONT face=3DArial size=3D2&gt;&lt;/FONT&gt;&nbs=\r\np;&lt;/DIV&gt;\n&lt;DIV align=3Dleft&gt;&lt;FONT face=3DArial size=3D2&gt;&lt;A \nhref=3D&quot;http://w=\r\nww.spinvestigations.org/&quot;&gt;www.spinvestigations.org&lt;/A&gt;&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&n=\r\nbsp;&lt;/DIV&gt;&lt;/BODY&gt;&lt;/HTML&gt;\n\r\n------=_NextPart_000_003C_01C94271.EF2448C0--"}