{"id": "12692", "subject": "Re:for David   Re: [EVP-ITC] Re: Chris Moon and his use of Franks Box", "author": "Zack Widup", "timestamp": "2008-11-09T19:28:28Z", "full_text": "I am an RF (primarily microwave) engineer.  I built a device some time ago \ncalled the Scalar Electrostatic Gradiometer:\n\nhttp://amasci.com/freenrg/grado.html\n\nThis device definitely reacts to paranormal activity in many meanings of \nthe word. It detects fields which are not normal electromagnetic fields. \nI invite all to build one and see for yourselves. Note there is an RF \nsniffer part of the circuit to indicate whether normal RF fields are \npresent at the time. The indicated 1N914 is good up to the VHF range but \nI found that substituting a good microwave hot-carrier diode such as half \nof an HSMS8202 gives you a useful indication of the presence of RF fields \ninto the microwave range if you use good microwave construction \npractices.\n\nAs far as EVP go, there are terms which have come to be accepted by people \nregarding the quality of the EVP. These people are not engineers and the \nterms are merely guidelines. This seems to be a good summary:\n\nhttp://www.afterdarkghosthunters.com/id18.html\n\nI&#39;ve gotten some that were obviously in the Class 1 category.  One was \ntelling us the name of a person who we were watching across a building at \nthe former Manteno State Mental Hospital in Manteno, IL. Everyone who \nhears it hears the same thing. What&#39;s dramatic about it is the person \nnamed WAS a patient there who died in 1938 of typhoid fever.\n\nZack\n\nOn Sun, 9 Nov 2008, David Rountree wrote:\n\n&gt; I have tested all of the devices out there, Ron. I could take reams of paper\n&gt; her to explain what I received. The issue is, with so many things normal\n&gt; that it can be, the task is proving what it is. If you haven&#39;t used RF\n&gt; spectrum analyzers, signal tracers, and RF field strength meters to\n&gt; eliminate the probable causes, then it doesn&#39;t matter what claim is made.\n&gt; You can&#39;t prove it. With Spiricom, for example, the Ghost of 29 MHz could\n&gt; just have easily been a truck on a CB radio, as they cover the same\n&gt; bandwidth. Every RF band out there has activity, of the living human\n&gt; variety. In fact, most of the bands are choked with traffic. Personally,\n&gt; since EVP can be captured without any of this technology, I find it\n&gt; difficult to buy into RF being a tool, since we require special electronics\n&gt; to create it and communicate with it. Having also analyzed EMF and EVP\n&gt; simultaneously and found them to be related, I have a tougher time with it.\n&gt; We don&#39;t speak using radio frequencies. It would be common sense to believe\n&gt; if we ream conscious after to death at a pure energy state, we wouldn&#39;t\n&gt; radiate at that frequency either. We would modulate in the audio spectrum of\n&gt; our voice, and that seems to be where all the viable evidence is leading.\n&gt; Thus it makes more sense to me that a real ghost talking device would use\n&gt; the same methodology, such as modulating EMF to the voice. It is simple to\n&gt; do and everyone can afford it, as well as it takes no special proprietary\n&gt; instrumentation to do it. All you need is a mic, an amp and a speaker. You\n&gt; are not only creating sound, but a matching EMF field at the same time.\n&gt;\n&gt; People have different motivations, and different beliefs. I have always\n&gt; approached it from a scientific aspect, and it has served me well. I don&#39;t\n&gt; expect anything, instead I wait to be surprised. Objective research is the\n&gt; key. Now if people need to believe in it, that is fine too, but beliefs are\n&gt; different from this is what it does. The truth is it may be possible that\n&gt; this can communicate with something, possibly aliens or inter-dimensional\n&gt; creatures, but we have no way to prove it due to everything else it can be.\n&gt; This is precisely why a handful of researchers and scientists have started\n&gt; looking at this stuff seriously. It is also why I am here. I want to learn\n&gt; as much as I can from the methods, devices and how they are being used in\n&gt; order to duplicate the work in a controlled environment, with equipment\n&gt; monitoring the equipment and the users. That my friend, reveals far more\n&gt; than you would imagine.\n&gt;\n&gt; David M. Rountree, AES\n&gt; Scientific Paranormal Investigative\n&gt; Research Information and Technology\n&gt;\n&gt; www.spinvestigations.org &lt;http://www.spinvestigations.org/&gt;\n&gt;\n&gt;"}