{"id": "12699", "subject": "Re:for David   Re: [EVP-ITC] Re: Chris Moon and his use of Franks Box g", "author": "ourobouros2k2", "timestamp": "2008-11-09T20:44:01Z", "full_text": "This is an interesting topic seeing as how most people that\nparticipate here don&#39;t have the need to &quot;prove&quot; anything to anyone.\nThis forum (and correct me if I am wrong) is a safe haven for folks to\nshare their experiences, ideas, and methodology. Most folks here have\nalready wrestled with trying to make sense of the mechanism involved\nwith evp or itc communication, and eventually decided the mechanism is\nnot as important as the message. For the moment, I shall concentrate\non my personal interest, box-based ITC. I will move onto traditional\nevp in a moment.\n\nI fully realize that it seems foolish to people like you that folks\nsuch as ourselves would be willing to spend countless hours listening\nto broken radios in hope of finding snippets relevant to our\nquestions. Believe it or not, I have a very analytical mind, and it\nbothered me very badly that such a contaminated medium could produce\nsuch good results. My ability to leap beyond logic came when time\nafter time I received very personal and contextual responses that I\ncan no longer ignore and deem coincidental. I am sure you will as so\nmany others have before you brush that off and embark on your personal\nquest to educate us &quot;koolaid drinkers&quot; on the concepts of coincidence\nand pariedolia (as if no one here had acutally considered the concept\nor how it would relate to what we do). I understand that from the\noutside looking in, it can almost seem silly, and you probably scoff\nat the idea as I used to. I don&#39;t have a very malleable thought\nprocess, but I can tell you that I received very personal and repeated\nmessages in the beginning and that the odds of coincidence (while I\nmust always concede is possible) are very low. I tend to try to apply\nas much control to the sessions as possible, asking for my name, what\nI am holding, whose room we are in, etc... but in the end,\ncommunication is usually at the mercy of this mysterious phenomenon.\n\nAs far as traditional evp goes, I have always thought that the coil\ninduction idea really is the one that makes the most sense. I don&#39;t\nbelieve that it is vibrational soundwaves. My ideology there (and I am\nnot as &quot;educated&quot; as others, so it makes sense to me) is that if an\nevp was captured with a center frequency below that of human hearing,\nhow would it be heard on the recording? If I understand correctly then\nthe process of recording didn&#39;t shift the frequency of the sound, then\nit should be just as silent on playback as it was during the event.\nThat for me rules out vibrational soundwaves, so I believe that it is\nas you said connected to emf. What makes me wonder with your posting\nis why you would think that would invalidate evp? Is it automatically\ninvalidated because anyone with the electronic knowledge could fake it\nwith the right equipment? That would automatically call into question\nthe character of anyone who ever collected an evp, and sounds like a\nRandi-esque blanket statement. Well it could be faked so they all are?\nTrust me, I am not defending my belief system here, but it would take\nirrefutable proof of a natural explanation to steer my view, and\nstatements like that aren&#39;t even close.\n\nThe problem with proof for a skeptic is almost as bad as the problem\nof proof for a believer. We are dealing with a phenomena that resists\nevery form of scientific study. To some that automatically means that\nit is BS. There is often just enough, however, to make most folks\nrecognize that something is going on, and thus makes disproving it as\nfrustrating as proving it. Sure you can tell everyone what you think\nit isn&#39;t but in the end it isn&#39;t anymore relevant as a theory than a\nbelief.\n\nThere is something going on here, and I am quite sure that it has less\nto do with the methodology as the intent of the seeker. I realize that\nexplanation doesn&#39;t fit the science of a skeptic, but be that as it\nmay, it is just the way it is. I am fully aware of the contamination\nfactors you listed in your post, yet I continue to have sessions. I\nmust always concede that at any time, those factors may be present\nduring a session. It also drives me nuts that I can&#39;t figure out the\nmechanism involved here. I try to implement as much limited control as\nI can when doing a session, but ultimately, these sessions will never\nbe enough to convince any non-believer. Therefore the sessions are as\npersonal as the motives of the participant. You will find that most\npeople have accepted that the mechanism is a mystery, and wish only to\nshare their results and methods with like-minded people. \n\nI personally view your posts as attempts to stir the bee&#39;s nest here,\nand even a cursory search of this board will show that most\nparticipants here have the same or very similar ideologies as my own.\nComing here to educate us with posts laced with cynicism make me\nquestion your intentions.\n\nrespectfully\nAndy\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;David Rountree&quot; &lt;ghost_hunter_01@...&gt;\nwrote:\n&gt;\n&gt; I have tested all of the devices out there, Ron. I could take reams\nof paper\n&gt; her to explain what I received. The issue is, with so many things normal\n&gt; that it can be, the task is proving what it is. If you haven&#39;t used RF\n&gt; spectrum analyzers, signal tracers, and RF field strength meters to\n&gt; eliminate the probable causes, then it doesn&#39;t matter what claim is\nmade.\n&gt; You can&#39;t prove it. With Spiricom, for example, the Ghost of 29 MHz\ncould\n&gt; just have easily been a truck on a CB radio, as they cover the same\n&gt; bandwidth. Every RF band out there has activity, of the living human\n&gt; variety. In fact, most of the bands are choked with traffic. Personally,\n&gt; since EVP can be captured without any of this technology, I find it\n&gt; difficult to buy into RF being a tool, since we require special\nelectronics\n&gt; to create it and communicate with it. Having also analyzed EMF and EVP\n&gt; simultaneously and found them to be related, I have a tougher time\nwith it.\n&gt; We don&#39;t speak using radio frequencies. It would be common sense to\nbelieve\n&gt; if we ream conscious after to death at a pure energy state, we wouldn&#39;t\n&gt; radiate at that frequency either. We would modulate in the audio\nspectrum of\n&gt; our voice, and that seems to be where all the viable evidence is\nleading.\n&gt; Thus it makes more sense to me that a real ghost talking device\nwould use\n&gt; the same methodology, such as modulating EMF to the voice. It is\nsimple to\n&gt; do and everyone can afford it, as well as it takes no special\nproprietary\n&gt; instrumentation to do it. All you need is a mic, an amp and a\nspeaker. You\n&gt; are not only creating sound, but a matching EMF field at the same time.\n&gt;  \n&gt; People have different motivations, and different beliefs. I have always\n&gt; approached it from a scientific aspect, and it has served me well. I\ndon&#39;t\n&gt; expect anything, instead I wait to be surprised. Objective research\nis the\n&gt; key. Now if people need to believe in it, that is fine too, but\nbeliefs are\n&gt; different from this is what it does. The truth is it may be possible\nthat\n&gt; this can communicate with something, possibly aliens or\ninter-dimensional\n&gt; creatures, but we have no way to prove it due to everything else it\ncan be.\n&gt; This is precisely why a handful of researchers and scientists have\nstarted\n&gt; looking at this stuff seriously. It is also why I am here. I want to\nlearn\n&gt; as much as I can from the methods, devices and how they are being\nused in\n&gt; order to duplicate the work in a controlled environment, with equipment\n&gt; monitoring the equipment and the users. That my friend, reveals far more\n&gt; than you would imagine.\n&gt;  \n&gt; David M. Rountree, AES\n&gt; Scientific Paranormal Investigative\n&gt; Research Information and Technology\n&gt;  \n&gt; www.spinvestigations.org &lt;http://www.spinvestigations.org/&gt;\n&gt;"}