{"id": "12702", "subject": "Re: [EVP-ITC] Re: Ghost Box in a Faraday Cage type enclosure", "author": "Zack Widup", "timestamp": "2008-11-09T21:00:47Z", "full_text": "A Faraday cage is supposed to stop all electromagnetic fields from \nentering it. They are useful in aligning equipment when you don&#39;t want \nany external RF present.\n\nYou&#39;re right; in a Faraday cage you would not be able to hear any radio \nstations. Frank&#39;s box probably wouldn&#39;t work as expected in a Faraday \ncage.\n\nZack\n\nOn Sun, 9 Nov 2008, threadsintyme@... wrote:\n\n&gt; Mike didn&#39;t cover the reasoning behind the Faraday Box in his YOUTUBE \n&gt; video...is it to prevent unwanted signals to come through? Seems like \n&gt; the Faraday Box could be self defeating...IE, if you are expecting \n&gt; radios signals to &quot;come through&quot;, how can they?\n&gt; Again, this leads back to the questioning whether it is the signals or \n&gt; the noise and the effects that spirits use to communicate with? IF \n&gt; spirits are using EVP&#39;s to communicate! I am still open to the \n&gt; possibility that spirits are. Doesn&#39;t mean the spirits ARE...LOL.\n&gt; Al\n&gt;\n&gt; -- &quot;ourobouros2k2&quot; &lt;ourobouros2k2@...&gt; wrote:\n&gt;\n&gt; This would seem to illustrate the divergence between schools of\n&gt; thought with traditional evp and itc/rtsc. While using a faraday cage\n&gt; to to prevent spurious and unwanted RF signals from contaminating a\n&gt; microphone would be helpful for traditional evp, would it not be\n&gt; counterproductive for box type ITC/RTSC? I am not trying to be\n&gt; sarcastic or anything, I am just wondering if the idea here is to\n&gt; ensure that if anything did make it through that it would most likely\n&gt; be genuine? I would be afraid that the RF shielding would be too\n&gt; effective thus blocking communication with a linear sweep box. If you\n&gt; did get communication from a box in a faraday cage, it would certainly\n&gt; make the skeptics and cynics be forced to present new arguments.\n&gt;\n&gt; thanks,\n&gt; Andy\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, &quot;M.A. Coletta (Mike)&quot;\n&gt; &lt;michaelcoletta@...&gt; wrote:\n&gt;&gt;\n&gt;&gt; While reading a book about spirit communication, there was a chapter\n&gt;&gt; which referenced the Faraday Cage. So... after reading it I decided to\n&gt;&gt; try out what the book suggested and placed my Radio Shack Hack 12-470\n&gt;&gt; Ghost Box into my microwave oven (in the OFF position) and ran a sweep\n&gt;&gt; in the AM and FM mode.\n&gt;&gt; The AM mode did receive much less but a few audio snippets did make\n&gt;&gt; their way through. The FM mode was a different story. No frequencies\n&gt;&gt; at all made it through... just white noise as each FM frequency was\n&gt;&gt; reached during the sweep.\n&gt;&gt; As I always do... I made a short video of both modes being sweeped.\n&gt;&gt; You can see it, here:\n&gt;&gt; http://www.youtube.com/watch?v=KQwYmi70-qw\n&gt;&gt;\n&gt;&gt; Thanks,\n&gt;&gt; - Mike (UFO Geek)\n&gt;&gt;\n&gt;\n&gt;\n&gt;\n&gt; _____________________________________________________________\n&gt; Click here to find the rental car that fits your needs.\n&gt; http://thirdpartyoffers.juno.com/TGL2111/fc/Ioyw6iifl2jjFSWAPRh2ZuN3EgUoXWCuNwoeIW1vVPcQkuECIcak3i/?count=1234567890\n&gt;"}