{"id": "1270", "subject": "Re: beneath the noise floor&lt;&lt;", "author": "psi_research", "timestamp": "2007-05-10T21:11:46Z", "full_text": "Just a quick note to state I&#39;m reading this thread with great \ninterest. It&#39;s just this type of innovative thinking that can result \nin breakthroughs. I wonder if Tesla is watching?\n\n--- In EVP-ITC@yahoogroups.com, Ken Thomas &lt;kennnthomas2000@...&gt; \nwrote:\n&gt;\n&gt; when i coined the term superresonance i didnt know about \nsuperresonant black holes.  its not related to that.  the main thing \nis, its repeatable\n&gt;    \n&gt;   theres no doubt about mechanism.  its squeezing a mixture of \nquantum noise, thermal noise and signal so it stays &quot;squoze&quot; and \nemerges into the real world where it doesnt really belong.  \nalternatively, it is mathematically the equivilant of welding scalars \ninto vectors -although that is not a good description of actual \nprocess; alternative 2: precision virtual state engineering.\n&gt;    \n&gt;   as transistors get smaller and faster, pure quantum oddities and \nbreakovers are going to be a big problem.  state of the art is almost \nthere right now;  if you can suck the quantum zoo-animals into the \nreal world, you can also force them out of your quantum well \ncomputer. you can be a real bully :)\n&gt;    \n&gt;   the significance is that it is no longer haphazard, relying on \nluck and a stiff tail wind and planet jupiter being in the right \nplace.  it can be repeated at will, though with difficulty; i have \ntwo black eyes right now from concentrating too hard for too many \nhours .  \n&gt; \n&gt;   thats why people are reluctant to try .  the reason the nearly \nobsolete mrf 571 works where better transistors dont is that it \ncannot handle much power, which is why it heats and cools quicker \nthan the latest ones.  the whole process of getting it to work would \ntake weeks instead of hours with any comparable microwave transistor\n&gt;   \n&gt; Ion wrote:\n&gt;   \n&gt; --- Ken Thomas wrote:\n&gt; \n&gt; &gt; \n&gt; &gt; when the mrf571 transistor is biased BEYOND its\n&gt; &gt; maximum sensitivity, white noise starts spilling\n&gt; &gt; across the PN junction. careful adjustment for\n&gt; &gt; resonance- which is ulcer producing and takes\n&gt; &gt; several hours- causes the noise to abruptly\n&gt; &gt; disappear as it becomes incorporated into a signal. \n&gt; &gt; it is possible to wash inert objects , chemicals\n&gt; &gt; -even a photograph- with the noise from the\n&gt; &gt; exploring wire and retrieve or broadcast the\n&gt; &gt; reemitted , ultraweak microwave signature- besides\n&gt; &gt; getting voice which is so-far too weak to be\n&gt; &gt; intelligible or amplifiable. the noise generators\n&gt; &gt; and hissing tape recorders are a clumsy, indirect\n&gt; &gt; wayof doing this same thing. by superresonance it\n&gt; &gt; will probably be possible, eventually, to transmit\n&gt; &gt; electrical power from place to place AROUND\n&gt; &gt; space-time.\n&gt; \n&gt; what do you imagine that mechanism is?\n&gt; quantum wormholes or some such?\n&gt; I like this superresonance concept but only find it\n&gt; associated with black holes in the lit, but am anxious\n&gt; to see how you&#39;ve been continuing to develop this\n&gt; thread. I think it has reader appeal once we can give\n&gt; it more context. Anyway, it appeals to me.\n&gt; \n&gt; \n&gt; \n&gt; &gt; \n&gt; &gt; kthomas\n&gt; &gt;\n&gt;"}