{"id": "12707", "subject": "Re: For David", "author": "LuckiestDuck", "timestamp": "2008-11-10T18:34:32Z", "full_text": "Oh, this is so interesting! Email is such a difficult medium through\nwhich to communicate, never mind EVP or ITC!! (No pun intended on the\n&quot;medium&quot; part... oh, ok, if it works, let it go!) &lt;ggg&gt; \n\nI find David&#39;s posts interesting and helpful in terms of things to\nthink about regarding what &quot;validation&quot; might be useful in analyzing\nthe &quot;how&quot; of these phenomena. Ok, so I don&#39;t always like what I\ninterpret as his tone of voice, but that&#39;s the difficulty about\nemail... we can&#39;t hear his tone of voice, nor do we have any sense of\nhow he is speaking when he writes his emails. I know in my business\nconsulting, I have to be meticulous to NOT write anything that can be\nmisinterpreted due to lack of tone of voice. People write things that\nthey think are not inflammatory, and others read them as totally\nhostile... we all know this happens!\n\nPersonally, I have experienced coherent voices coming through a simple\nrecorder (a cassette tape at that, years ago), but I have not been\nexperimenting myself lately, though I would like to make the time to\ndo so. I have concerns about the stray signals that a device that\nsweeps the am and/or fm and/or cb bands might generate, and so if I\nwere doing my experiments now, I&#39;d likely NOT use a box or a hacked radio.\n\nBut: that does not mean I intend to invalidate anyone else&#39;s work. I\nlove knowing what others here are reporting, and listening to the\noccasional voice file (I get the digest so I don&#39;t get the files\nattached). I am delighted when &quot;messages&quot; come through. The sheer\nnumber of coherent hits with this suggests to me that at least some of\nthese phenomena are genuine, if not many of them.\n\nI for one appreciate David&#39;s thinking and analyses, and am inclined to\nthink similarly to him, and I for one hope he continues to contribute\nhere, though I do suggest to you, David, that you maybe try to\nmoderate your email tone of voice &lt;g&gt;. The more opinions and\nconversations we have here on this list about ALL the possibilities in\nthis fascinating area of research, the better... and that&#39;s my two\ncents! &lt;G&gt;\n\nCheers,\n\nLeslie\n\n--- In EVP-ITC@yahoogroups.com, &quot;ourobouros2k2&quot; &lt;ourobouros2k2@...&gt; wrote:\n&gt;\n\n&gt; There is something going on here, and I am quite sure that it has less\n&gt; to do with the methodology as the intent of the seeker. I realize that\n&gt; explanation doesn&#39;t fit the science of a skeptic, but be that as it\n&gt; may, it is just the way it is.  \n\n&lt;snip&gt;\n&gt; \n&gt; I personally view your posts as attempts to stir the bee&#39;s nest here,\n&gt; and even a cursory search of this board will show that most\n&gt; participants here have the same or very similar ideologies as my own."}