{"id": "12719", "subject": "Re: Stanley Hotel event", "author": "M.A. Coletta (Mike)", "timestamp": "2008-11-11T02:11:26Z", "full_text": "Hi Frank,\n\nThat&#39;s great you were able to make it there on Sunday.  Here is the \nagenda they posted on the event website. It lists you and I along \nwith Bill Murphy with the group on Monday and Tuesday night from 10pm-\n2am.:\n\n----\n10pm - 2am\nWe will assemble into two groups: Group 1 Investigates with the \ncelebrities. Everyone will have a chance to work with the \ncelebrities. Group 2 will meet in the Pinion Billiards room. Mike \nColetta, Bill Murphy and Frank Sumption will present new looks at \nupcoming paranormal technology. Live experimentation with new \ndevices. This presentation will be followed up with a preview of The \nStanley Effect Documentary and Q&A. \n----\n\n- Mike\n\n--- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; \n&lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  I&#39;m usually not on any agenda, I just show up. I was there sunday \n&gt; night, but that&#39;s al lthe time I could spend there. \n&gt; \n&gt; Frank-S\n&gt; \n&gt;  --- In EVP-ITC@yahoogroups.com, &quot;M.A. Coletta (Mike)&quot; \n&gt; &lt;michaelcoletta@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hi Allen,\n&gt; &gt; \n&gt; &gt; Looks like plans have changed and I won&#39;t be at the Stanley Hotel \n&gt; &gt; paranormal event after all.  There was some sort of disconnect \nand \n&gt; my \n&gt; &gt; name didn&#39;t show up on the guest list, so they couldn&#39;t give me a \n&gt; &gt; room there. That&#39;s what the hotel supervisor said last night \n&gt; &gt; anyway... and it&#39;s too late in the game to follow this up.\n&gt; &gt; He did say about 245 people will be in attendance, so you should \n&gt; have \n&gt; &gt; a good time.\n&gt; &gt; Frank Sumption and I were both on their speaking agenda to talk \n&gt; and \n&gt; &gt; use some new devices for half the group at a time, but I heard \n&gt; Frank \n&gt; &gt; might not be able to make it either.\n&gt; &gt; \n&gt; &gt; I hope to meet you and April at a future event sometime...\n&gt; &gt; \n&gt; &gt; - Mike (UFO Geek)\n&gt; &gt; http://www.ufogeek.com"}