{"id": "12725", "subject": "Re: For David", "author": "David Rountree", "timestamp": "2008-11-11T19:15:47Z", "full_text": "Unfortunately most of my writing is white papers and technical \nreports, so I tend to write dryly. I also write several hundred e-\nmails a day, as I field a lot of questions about the research we are \ndoing at the SPIRIT lab. So If I have a perceived tone, it is \nunintentional.\n\nMy approach to the whole EVP/ITC issue is strictly common \nsense/scientific. I well know that most people are not doing what I \nam doing, and I don&#39;t expect them to. What I do is post what we do, \nand let other people duplicate it if they wish. By following strict \ntesting protocols, we are able to seperate the wheat from the chauff \nso to speak. The thing is, people are entitled to their beliefs, at \nleast so far. I am not so much interested in beliefs, but in finding \nanswers. So I admit my approach is somewhat different. But the by \nproduct of my approach is one day I may be able to say you can \ncommunicate with the dead, and this is why, and produce the viable \nevidence. While many of you don&#39;t understand my motivations, what \nthat may lead to is a branch of science, grants for research, and new \ndiscoveries that apply to many aspects of science.\n\nOr not.\n\nThe important thing is to study the validity, probability, and \nsource. I mean, what if ITC doesn&#39;t work, and the effects you are \nexperienceing are due to something completely different? Proof is \nrequired to answer questions, and that is all I try to do. A healthy \napplication of Occam&#39;s Razor and objectivity keeps me focused on the \nquestions and the search for the answers to them.\n\n--- In EVP-ITC@yahoogroups.com, &quot;LuckiestDuck&quot; &lt;laustin@...&gt; wrote:\n&gt;\n&gt; Oh, this is so interesting! Email is such a difficult medium through\n&gt; which to communicate, never mind EVP or ITC!! (No pun intended on \nthe\n&gt; &quot;medium&quot; part... oh, ok, if it works, let it go!) &lt;ggg&gt; \n&gt; \n&gt; I find David&#39;s posts interesting and helpful in terms of things to\n&gt; think about regarding what &quot;validation&quot; might be useful in analyzing\n&gt; the &quot;how&quot; of these phenomena. Ok, so I don&#39;t always like what I\n&gt; interpret as his tone of voice, but that&#39;s the difficulty about\n&gt; email... we can&#39;t hear his tone of voice, nor do we have any sense \nof\n&gt; how he is speaking when he writes his emails. I know in my business\n&gt; consulting, I have to be meticulous to NOT write anything that can \nbe\n&gt; misinterpreted due to lack of tone of voice. People write things \nthat\n&gt; they think are not inflammatory, and others read them as totally\n&gt; hostile... we all know this happens!\n&gt; \n&gt; Personally, I have experienced coherent voices coming through a \nsimple\n&gt; recorder (a cassette tape at that, years ago), but I have not been\n&gt; experimenting myself lately, though I would like to make the time to\n&gt; do so. I have concerns about the stray signals that a device that\n&gt; sweeps the am and/or fm and/or cb bands might generate, and so if I\n&gt; were doing my experiments now, I&#39;d likely NOT use a box or a hacked \nradio.\n&gt; \n&gt; But: that does not mean I intend to invalidate anyone else&#39;s work. I\n&gt; love knowing what others here are reporting, and listening to the\n&gt; occasional voice file (I get the digest so I don&#39;t get the files\n&gt; attached). I am delighted when &quot;messages&quot; come through. The sheer\n&gt; number of coherent hits with this suggests to me that at least some \nof\n&gt; these phenomena are genuine, if not many of them.\n&gt; \n&gt; I for one appreciate David&#39;s thinking and analyses, and am inclined \nto\n&gt; think similarly to him, and I for one hope he continues to \ncontribute\n&gt; here, though I do suggest to you, David, that you maybe try to\n&gt; moderate your email tone of voice &lt;g&gt;. The more opinions and\n&gt; conversations we have here on this list about ALL the possibilities \nin\n&gt; this fascinating area of research, the better... and that&#39;s my two\n&gt; cents! &lt;G&gt;\n&gt; \n&gt; Cheers,\n&gt; \n&gt; Leslie\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;ourobouros2k2&quot; &lt;ourobouros2k2@&gt; \nwrote:\n&gt; &gt;\n&gt; \n&gt; &gt; There is something going on here, and I am quite sure that it has \nless\n&gt; &gt; to do with the methodology as the intent of the seeker. I realize \nthat\n&gt; &gt; explanation doesn&#39;t fit the science of a skeptic, but be that as \nit\n&gt; &gt; may, it is just the way it is.  \n&gt; \n&gt; &lt;snip&gt;\n&gt; &gt; \n&gt; &gt; I personally view your posts as attempts to stir the bee&#39;s nest \nhere,\n&gt; &gt; and even a cursory search of this board will show that most\n&gt; &gt; participants here have the same or very similar ideologies as my \nown.\n&gt;"}