{"id": "12730", "subject": "Re: Chris Moon and his use of Franks Box gets slammed", "author": "David Rountree", "timestamp": "2008-11-11T19:40:35Z", "full_text": "And making a bomb from an atom was ludicrous.\n\nThe &quot;idiot&quot; with the degree is a physicist who has a wealth of work \nthat has nothing to do with ITC or the paranormal. Statements like \nthis appear to others as based on ignorance and reflects poorly only \non the person who says it, indicating a lack of undersdtanding and \ntolerance for anything counter to their agenda.\n\nIf you make outstanding claims to the world, and can not back them up \nwith data to demonstrate your claims, you will get scrutinized.\n\nIt will also feed your critics.\n\nLets add in common sense. IF you really are communicating with the \ndead, (and this would be huge) why isn&#39;t on the front page of every \nnews paper in the world?\n\nBecause it lacks what some of you don&#39;t understand what I do. Build a \ncase to confirm or debunk these claims.\n\nI guess me question boils down to this; is this a group for objective \ndiscussion of ITC-EVP potential, or a fan club for Frank Sumption?\n\nDr. Rorke is a friend of mine. I haven&#39;t attacked anyone in here \nbecause of their opinions, I have offered things I have learned over \nthe years (since 1976). I am also one of those &quot;idiots&quot; with a \ndegree, and it has made me quite a good living designing large scale \naudio systems and information distributions systems. There is no \nmystery in any of the electronic circuits used in ITC technology to \nme.\n\nI don&#39;t understand why if someone finds evidence that a duck is a \nduck, why people insist on calling it a bull. Research is about \ndiscovering the answer, even if it isn&#39;t the answer you expect or are \nlooking for. Granted, I totally understand if eople dissagree with \nsomeone&#39;s findings, and to discredit it would require supporting \ndata, not opinion. Too much of this field is filled with opinions \ninstead of data.\n\nI wish you all well and good luck with your experiments. I believed I \nhave joined the wrong discussion group. To those who have e-mailed be \nI have enjoyed our conversations.\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;Jon Maronge&quot; &lt;jmaronge2002@...&gt; \nwrote:\n&gt;\n&gt; yes. i agree frank. I know that he is not coming from a totally\n&gt; skeptical place with what he was saying, however, even if everything\n&gt; could be totally repeatable in a lab, no evidence will ever be good\n&gt; enough. Everyone called Marconi &quot;crazy&quot; when he was down in marconi\n&gt; meadows, a part of city park in New Orleans, but radio was still \nborn.\n&gt; \n&gt; I say let them call us crazy and say what they want to. They will do\n&gt; it anyways. We know the results that we are getting. If the world\n&gt; doesn&#39;t want to recognize it yet, its their problem. We will just be\n&gt; laughing at them through one of your boxes that someone digs out of \nan\n&gt; attic in 100 years from now...lol\n&gt; \n&gt; jon\n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, suzanne bibb &lt;suzyq6819@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Everyone in favor say &quot;Frank&quot;!\n&gt; &gt; \n&gt; &gt; --- On Mon, 11/10/08, purplespacefriend &lt;purplealiengirl@&gt; wrote:\n&gt; &gt; \n&gt; &gt; From: purplespacefriend &lt;purplealiengirl@&gt;\n&gt; &gt; Subject: [EVP-ITC] Re: Chris Moon and his use of Franks Box gets \nslammed\n&gt; &gt; To: EVP-ITC@yahoogroups.com\n&gt; &gt; Date: Monday, November 10, 2008, 8:45 PM\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; A moron with title and degree--like that&#39;s any differnt! \n&gt; &gt; \n&gt; &gt; F-S\n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups .com, &quot;M.A. Coletta (Mike)&quot; \n&gt; &gt; &lt;michaelcoletta@ ...&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; \n&gt; &gt; &gt; Chris Moon and his use of Franks Box gets slammed\n&gt; &gt; &gt; \n&gt; &gt; &gt; Last night on Coast to Coast AM George Noory had Dr. Stephen \nRorke\n&gt; &gt; &gt; on-air. He discussed the field of instrumental \ntranscommunication\n&gt; &gt; &gt; (ITC), his study of the Spiricom case, Frank&#39;s Box, and EVP \n&gt; &gt; capture.\n&gt; &gt; &gt; It was during his discussion of Frank&#39;s Box where he brought up \n&gt; &gt; the name\n&gt; &gt; &gt; Chris Moon. He also brought up exactly what he thought of Chris \n&gt; &gt; Moon&#39;s\n&gt; &gt; &gt; use of the Franks Box he calls his telephone to the dead.\n&gt; &gt; &gt; Better than writng about it, I&#39;ve placed a link to the audio \nfrom \n&gt; &gt; last\n&gt; &gt; &gt; night, at my post below.\n&gt; &gt; &gt; \n&gt; &gt; &gt; http://ufomagazine. blogspot. com/2008/ 11/chris- moon-and-\n&gt; his-use-of-\n&gt; &gt; franks&#92;\n&gt; &gt; &gt; -box.html\n&gt; &gt; &gt; &lt;http://ufomagazine. blogspot. com/2008/ 11/chris- moon-and-\n&gt; his-use-of-\n&gt; &gt; frank&#92;\n&gt; &gt; &gt; s-box.html&gt;\n&gt; &gt; &gt; \n&gt; &gt; &gt; - Mike (UFO Geek)\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}