{"id": "12737", "subject": "Re: [EVP-ITC] For David, David  Roundtree Re: Chris Moon and more David", "author": "Ron Lederer", "timestamp": "2008-11-11T22:43:07Z", "full_text": "--0-226941576-1226443387=:50025\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n\nHey David, Don&#39;t give up, yet.=A0 I just got back to read all the posts, m=\r\nostly dedicated to you.=A0 I actually had written a few responses after my =\r\nfirst one to you but was not a able to complete my thoughts so it went onto=\r\n &quot;draft.&quot;=A0 \n=A0\nI did take time to look at you web site and I am impresse=\r\nd.=A0 You obviously have excellent scientific/engineering credentials to wa=\r\nrrant saying &quot;I want you on my side.&quot;=A0 If some of the messages we are rec=\r\neiving are from other than traditional EVP sources, I want to know about th=\r\nem.=A0 Alien, hoaxer, CIA, MIB,=A0Anunnaki, or whatever.=A0=A0As well, it w=\r\nould be great to know about=A0frequencies, QM,=A0electromagnetic readings, =\r\neverything and anything that=A0you=A0could add to the data would be terrifi=\r\nc...at some point in time.=A0=A0But, using Remote viewing as an example, wh=\r\nich you investigated and discussed on your web sit, don&#39;t you think the &quot;ap=\r\nplication&quot; of this phenomena (I won&#39;t yet elevate it to the term &quot;technolog=\r\ny&quot;) is worth=A0serious investigation.=A0=A0Remote viewing was developed=A0d=\r\nue to the results it got.=A0 It never was, and still has not been investiga=\r\nted and accepted by the &quot;scientific community.&quot;=A0 In other words it has no=\r\nt been subjected=A0standards\n of proof.=A0 Yet it works.=A0 I know this bec=\r\nause I have proved it to myself.=A0 I know EVP works=A0because I have prove=\r\nd it to myself.\n=A0\nSo, my question is from, let&#39;s call it, a &quot;marketing ap=\r\nproach.&quot;=A0 That is my back group, when I was in the world of making money =\r\nfor a living.=A0=A0=A0My questioning process went something like this:=A0=\r\n=A01) what=A0does it do=A0=A0 2) what benefit does=A0it have to me and othe=\r\nrs=A0=A0=A03) what can I do with it.=A0=A0=A0With this approach we develope=\r\nd cable TV and satellite services....I was selling cable tv and 24 hour new=\r\ns channels when people were asking &quot;why in the world would you need more th=\r\nan=A0three channels ---=A0 abc, nbc and cbs?=A0=A0=A0And,=A0who in the worl=\r\nd would want a 24 hour news channel?=A0 Then I was involved in selling=A0ca=\r\nr navigation systems in the 80&#39;s=A0and=A0portable cell phones that weighed =\r\nand were shaped like a brick and sold for $5,000.=A0 What&#39;s that got to do =\r\nwith EVP-ITC?=A0 It has to do with the people involved EVP-ITC...we are at =\r\nthe forefront.=A0=A0 Some of us have touched the other side and know what i=\r\ns there.=A0 We do not need to prove it exists\n to anyone else...although ac=\r\nknowledgment from others at times would be nice and certainly appreciated.=\r\n=A0\n=A0\nIn my first email to you I suggested that you get a radio shack hac=\r\nk and go talk to it.=A0 Maybe you have=A0already=A0done a zillion hours wit=\r\nh one, but I am not aware of any posts you have done.=A0 =A0If possible can=\r\n you direct me to where I can listen to your actual=A0recordings?=A0 I did =\r\nnot find them here or on your web site.=A0 Also, I have a few=A0EVP message=\r\ns of my own that I would=A0really like you to hear and analyze in any way y=\r\nou can and I will send them to you.=A0 Let&#39;s do this in private emails, if =\r\nyou will.=A0 \n=A0\nAnd finally, let me=A0just add to the application aspect =\r\nof this work.=A0 I=A0know of a number of EVPers who have been working with =\r\nlaw=A0enforcement to help with missing persons and murder cases.=A0 If you =\r\nhave not visited Sandra=A0Belanger&#39;s web site at=A0www.heliumraven.com I wo=\r\nuld encourage you to do so and let me know your thoughts.=A0=A0 I would als=\r\no like to learn how we=A0can get information from the other side to help wi=\r\nth medical problems like autism in children and to help solve our energy is=\r\nsues.=A0 If we get answers that are usable from the other side in law enfor=\r\ncement, to learn about relatives who have passed on, or to solve medical or=\r\n=A0other real world problems, does it really=A0matter where=A0or how the me=\r\nssages got here?=A0=A0 I is where the value is in this and other groups who=\r\n do not use the scientific method.=A0 I can&#39;t speak for everyone here but I=\r\n think we should welcome someone like you to work with us.=A0 keep=A0up the=\r\n good work=A0=A0 ron l=A0=A0=A0\n\n--- On Tue, 11/11/08, David Rountree &lt;ghos=\r\nt_hunter_01@...&gt; wrote:\n\nFrom: David Rountree &lt;ghost_hunter_01@comc=\r\nast.net&gt;\nSubject: [EVP-ITC] Re: Chris Moon and his use of Franks Box gets s=\r\nlammed\nTo: EVP-ITC@yahoogroups.com\nDate: Tuesday, November 11, 2008, 11:40 =\r\nAM\n\n\n\n\n\n\nAnd making a bomb from an atom was ludicrous.\n\nThe &quot;idiot&quot; with th=\r\ne degree is a physicist who has a wealth of work \nthat has nothing to do wi=\r\nth ITC or the paranormal. Statements like \nthis appear to others as based o=\r\nn ignorance and reflects poorly only \non the person who says it, indicating=\r\n a lack of undersdtanding and \ntolerance for anything counter to their agen=\r\nda.\n\nIf you make outstanding claims to the world, and can not back them up =\r\n\nwith data to demonstrate your claims, you will get scrutinized.\n\nIt will a=\r\nlso feed your critics.\n\nLets add in common sense. IF you really are communi=\r\ncating with the \ndead, (and this would be huge) why isn&#39;t on the front page=\r\n of every \nnews paper in the world?\n\nBecause it lacks what some of you don&#39;=\r\nt understand what I do. Build a \ncase to confirm or debunk these claims.\n\nI=\r\n guess me question boils down to this; is this a group for objective \ndiscu=\r\nssion of ITC-EVP potential, or a fan club for Frank Sumption?\n\nDr. Rorke is=\r\n a friend of mine. I haven&#39;t attacked anyone in here \nbecause of their opin=\r\nions, I have offered things I have learned over \nthe years (since 1976). I =\r\nam also one of those &quot;idiots&quot; with a \ndegree, and it has made me quite a go=\r\nod living designing large scale \naudio systems and information distribution=\r\ns systems. There is no \nmystery in any of the electronic circuits used in I=\r\nTC technology to \nme.\n\nI don&#39;t understand why if someone finds evidence tha=\r\nt a duck is a \nduck, why people insist on calling it a bull. Research is ab=\r\nout \ndiscovering the answer, even if it isn&#39;t the answer you expect or are =\r\n\nlooking for. Granted, I totally understand if eople dissagree with \nsomeon=\r\ne&#39;s findings, and to discredit it would require supporting \ndata, not opini=\r\non. Too much of this field is filled with opinions \ninstead of data.\n\nI wis=\r\nh you all well and good luck with your experiments. I believed I \nhave join=\r\ned the wrong discussion group. To those who have e-mailed be \nI have enjoye=\r\nd our conversations.\n\n--- In EVP-ITC@yahoogroups .com, &quot;Jon Maronge&quot; &lt;jmaro=\r\nnge2002@ ...&gt; \nwrote:\n&gt;\n&gt; yes. i agree frank. I know that he is not coming =\r\nfrom a totally\n&gt; skeptical place with what he was saying, however, even if =\r\neverything\n&gt; could be totally repeatable in a lab, no evidence will ever be=\r\n good\n&gt; enough. Everyone called Marconi &quot;crazy&quot; when he was down in marconi=\r\n\n&gt; meadows, a part of city park in New Orleans, but radio was still \nborn.\n=\r\n&gt; \n&gt; I say let them call us crazy and say what they want to. They will do\n&gt;=\r\n it anyways. We know the results that we are getting. If the world\n&gt; doesn&#39;=\r\nt want to recognize it yet, its their problem. We will just be\n&gt; laughing a=\r\nt them through one of your boxes that someone digs out of \nan\n&gt; attic in 10=\r\n0 years from now...lol\n&gt; \n&gt; jon\n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups .com, su=\r\nzanne bibb &lt;suzyq6819@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Everyone in favor say &quot;Frank&quot;!\n&gt; &gt; \n=\r\n&gt; &gt; --- On Mon, 11/10/08, purplespacefriend &lt;purplealiengirl@ &gt; wrote:\n&gt; &gt; =\r\n\n&gt; &gt; From: purplespacefriend &lt;purplealiengirl@ &gt;\n&gt; &gt; Subject: [EVP-ITC] Re:=\r\n Chris Moon and his use of Franks Box gets \nslammed\n&gt; &gt; To: EVP-ITC@yahoogr=\r\noups .com\n&gt; &gt; Date: Monday, November 10, 2008, 8:45 PM\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n=\r\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; A moron with title and degree--like that&#39;s any diff=\r\nernt! \n&gt; &gt; \n&gt; &gt; F-S\n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups .com, &quot;M.A. Coletta=\r\n (Mike)&quot; \n&gt; &gt; &lt;michaelcoletta@ ...&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; \n&gt; &gt; &gt; Chris Moon an=\r\nd his use of Franks Box gets slammed\n&gt; &gt; &gt; \n&gt; &gt; &gt; Last night on Coast to Co=\r\nast AM George Noory had Dr. Stephen \nRorke\n&gt; &gt; &gt; on-air. He discussed the f=\r\nield of instrumental \ntranscommunication\n&gt; &gt; &gt; (ITC), his study of the Spir=\r\nicom case, Frank&#39;s Box, and EVP \n&gt; &gt; capture.\n&gt; &gt; &gt; It was during his discu=\r\nssion of Frank&#39;s Box where he brought up \n&gt; &gt; the name\n&gt; &gt; &gt; Chris Moon. He=\r\n also brought up exactly what he thought of Chris \n&gt; &gt; Moon&#39;s\n&gt; &gt; &gt; use of =\r\nthe Franks Box he calls his telephone to the dead.\n&gt; &gt; &gt; Better than writng=\r\n about it, I&#39;ve placed a link to the audio \nfrom \n&gt; &gt; last\n&gt; &gt; &gt; night, at =\r\nmy post below.\n&gt; &gt; &gt; \n&gt; &gt; &gt; http://ufomagazine. blogspot. com/2008/ 11/chri=\r\ns- moon-and-\n&gt; his-use-of-\n&gt; &gt; franks&#92;\n&gt; &gt; &gt; -box.html\n&gt; &gt; &gt; &lt;http://ufomag=\r\nazine. blogspot. com/2008/ 11/chris- moon-and-\n&gt; his-use-of-\n&gt; &gt; frank&#92;\n&gt; &gt;=\r\n &gt; s-box.html&gt;\n&gt; &gt; &gt; \n&gt; &gt; &gt; - Mike (UFO Geek)\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n=\r\n      \r\n--0-226941576-1226443387=:50025\r\nContent-Type: text/html; charset=us-ascii\r\n\r\n&lt;table cellspacing=&quot;0&quot; cellpadding=&quot;0&quot; border=&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=&quot;top&quot; style=&quot;font: inherit;&quot;&gt;&lt;DIV id=yiv1855538974&gt;\n&lt;DIV&gt;Hey David, Don&#39;t give up, yet.&nbsp; I just got back to read all the posts, mostly dedicated to you.&nbsp; I actually had written a few responses after my first one to you but was not a able to complete my thoughts so it went onto &quot;draft.&quot;&nbsp; &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I did take time to look at you web site and I am impressed.&nbsp; You obviously have excellent scientific/engineering credentials to warrant saying &quot;I want you on my side.&quot;&nbsp; If some of the messages we are receiving are from other than traditional EVP sources, I want to know about them.&nbsp; Alien, hoaxer, CIA, MIB,&nbsp;Anunnaki, or whatever.&nbsp;&nbsp;As well, it would be great to know about&nbsp;frequencies, QM,&nbsp;electromagnetic readings, everything and anything that&nbsp;you&nbsp;could add to the data would be terrific...at some point in time.&nbsp;&nbsp;But, using Remote viewing as an example, which you investigated and discussed on your web sit, don&#39;t you think the &quot;application&quot; of this phenomena (I won&#39;t yet elevate it to the term &quot;technology&quot;) is worth&nbsp;serious investigation.&nbsp;&nbsp;Remote viewing was developed&nbsp;due to the results it got.&nbsp; It never was, and still has not been investigated and accepted by the\n &quot;scientific community.&quot;&nbsp; In other words it has not been subjected&nbsp;standards of proof.&nbsp; Yet it works.&nbsp; I know this because I have proved it to myself.&nbsp; I know EVP works&nbsp;because I have proved it to myself.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;So, my question is from, let&#39;s call it, a &quot;marketing approach.&quot;&nbsp; That is my back group, when I was in the world of making money for a living.&nbsp;&nbsp;&nbsp;My questioning process went something like this:&nbsp;&nbsp;1) what&nbsp;does it do&nbsp;&nbsp; 2) what benefit does&nbsp;it have to me and others&nbsp;&nbsp;&nbsp;3) what can I do with it.&nbsp;&nbsp;&nbsp;With this approach we developed cable TV and satellite services....I was selling cable tv and 24 hour news channels when people were asking &quot;why in the world would you need more than&nbsp;three channels ---&nbsp; abc, nbc and cbs?&nbsp;&nbsp;&nbsp;And,&nbsp;who in the world would want a 24 hour news channel?&nbsp; Then I was involved in selling&nbsp;car navigation systems in the 80&#39;s&nbsp;and&nbsp;portable cell phones that weighed and were shaped like a brick and sold for $5,000.&nbsp; What&#39;s that got to do with EVP-ITC?&nbsp; It has to do with the people involved EVP-ITC...we are at\n the forefront.&nbsp;&nbsp; Some of us have touched the other side and know what is there.&nbsp; We do not need to prove it exists to anyone else...although acknowledgment from others at times would be nice and certainly appreciated.&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;In my first email to you I suggested that you get a radio shack hack and go talk to it.&nbsp; Maybe you have&nbsp;already&nbsp;done a zillion hours with one, but I am not aware of any posts you have done.&nbsp; &nbsp;If possible can you direct me to where I can listen to your actual&nbsp;recordings?&nbsp; I did not find them here or on your web site.&nbsp; Also, I have a few&nbsp;EVP messages of my own that I would&nbsp;really like you to hear and analyze in any way you can and I will send them to you.&nbsp; Let&#39;s do this in private emails, if you will.&nbsp; &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;And finally, let me&nbsp;just add to the application aspect of this work.&nbsp; I&nbsp;know of a number of EVPers who have been working with law&nbsp;enforcement to help with missing persons and murder cases.&nbsp; If you have not visited Sandra&nbsp;Belanger&#39;s web site at&nbsp;&lt;A href=&quot;http://www.heliumraven.com&quot;&gt;www.heliumraven.com&lt;/A&gt; I would encourage you to do so and let me know your thoughts.&nbsp;&nbsp; I would also like to learn how we&nbsp;can get information from the other side to help with medical problems like autism in children and to help solve our energy issues.&nbsp; If we get answers that are usable from the other side in law enforcement, to learn about relatives who have passed on, or to solve medical or&nbsp;other real world problems, does it really&nbsp;matter where&nbsp;or how the messages got here?&nbsp;&nbsp; I is where the value is in this and other groups who do not use the scientific method.&nbsp; I can&#39;t speak for everyone\n here but I think we should welcome someone like you to work with us.&nbsp; keep&nbsp;up the good work&nbsp;&nbsp; ron l&nbsp;&nbsp;&nbsp;&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Tue, 11/11/08, David &lt;SPAN&gt;Rountree&lt;/SPAN&gt; &lt;I&gt;&lt;ghost_hunter_01@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;&lt;/DIV&gt;\n&lt;BLOCKQUOTE style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: rgb(16,16,255) 2px solid&quot;&gt;From: David Rountree &lt;ghost_hunter_01@...&gt;&lt;BR&gt;Subject: [EVP-ITC] Re: Chris Moon and his use of Franks Box gets slammed&lt;BR&gt;To: EVP-ITC@yahoogroups.com&lt;BR&gt;Date: Tuesday, November 11, 2008, 11:40 AM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=yiv1706113044&gt;\n&lt;DIV id=ygrp-text&gt;\n&lt;DIV&gt;And making a bomb from an atom was ludicrous.&lt;BR&gt;&lt;BR&gt;The &quot;idiot&quot; with the degree is a physicist who has a wealth of work &lt;BR&gt;that has nothing to do with ITC or the paranormal. Statements like &lt;BR&gt;this appear to others as based on ignorance and reflects poorly only &lt;BR&gt;on the person who says it, indicating a lack of undersdtanding and &lt;BR&gt;tolerance for anything counter to their agenda.&lt;BR&gt;&lt;BR&gt;If you make outstanding claims to the world, and can not back them up &lt;BR&gt;with data to demonstrate your claims, you will get scrutinized.&lt;BR&gt;&lt;BR&gt;It will also feed your critics.&lt;BR&gt;&lt;BR&gt;Lets add in common sense. IF you really are communicating with the &lt;BR&gt;dead, (and this would be huge) why isn&#39;t on the front page of every &lt;BR&gt;news paper in the world?&lt;BR&gt;&lt;BR&gt;Because it lacks what some of you don&#39;t understand what I do. Build a &lt;BR&gt;case to confirm or debunk these claims.&lt;BR&gt;&lt;BR&gt;I guess me question boils down to this; is this a group for objective &lt;BR&gt;discussion of\n ITC-EVP potential, or a fan club for Frank Sumption?&lt;BR&gt;&lt;BR&gt;Dr. Rorke is a friend of mine. I haven&#39;t attacked anyone in here &lt;BR&gt;because of their opinions, I have offered things I have learned over &lt;BR&gt;the years (since 1976). I am also one of those &quot;idiots&quot; with a &lt;BR&gt;degree, and it has made me quite a good living designing large scale &lt;BR&gt;audio systems and information distributions systems. There is no &lt;BR&gt;mystery in any of the electronic circuits used in ITC technology to &lt;BR&gt;me.&lt;BR&gt;&lt;BR&gt;I don&#39;t understand why if someone finds evidence that a duck is a &lt;BR&gt;duck, why people insist on calling it a bull. Research is about &lt;BR&gt;discovering the answer, even if it isn&#39;t the answer you expect or are &lt;BR&gt;looking for. Granted, I totally understand if eople dissagree with &lt;BR&gt;someone&#39;s findings, and to discredit it would require supporting &lt;BR&gt;data, not opinion. Too much of this field is filled with opinions &lt;BR&gt;instead of data.&lt;BR&gt;&lt;BR&gt;I wish you all well and\n good luck with your experiments. I believed I &lt;BR&gt;have joined the wrong discussion group. To those who have e-mailed be &lt;BR&gt;I have enjoyed our conversations.&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=&quot;mailto:EVP-ITC%40yahoogroups.com&quot; target=_blank rel=nofollow&gt;EVP-ITC@yahoogroups .com&lt;/A&gt;, &quot;Jon Maronge&quot; &lt;jmaronge2002@ ...&gt; &lt;BR&gt;wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; yes. i agree frank. I know that he is not coming from a totally&lt;BR&gt;&gt; skeptical place with what he was saying, however, even if everything&lt;BR&gt;&gt; could be totally repeatable in a lab, no evidence will ever be good&lt;BR&gt;&gt; enough. Everyone called Marconi &quot;crazy&quot; when he was down in marconi&lt;BR&gt;&gt; meadows, a part of city park in New Orleans, but radio was still &lt;BR&gt;born.&lt;BR&gt;&gt; &lt;BR&gt;&gt; I say let them call us crazy and say what they want to. They will do&lt;BR&gt;&gt; it anyways. We know the results that we are getting. If the world&lt;BR&gt;&gt; doesn&#39;t want to recognize it yet, its their problem. We will just be&lt;BR&gt;&gt;\n laughing at them through one of your boxes that someone digs out of &lt;BR&gt;an&lt;BR&gt;&gt; attic in 100 years from now...lol&lt;BR&gt;&gt; &lt;BR&gt;&gt; jon&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; --- In &lt;A href=&quot;mailto:EVP-ITC%40yahoogroups.com&quot; target=_blank rel=nofollow&gt;EVP-ITC@yahoogroups .com&lt;/A&gt;, suzanne bibb &lt;suzyq6819@&gt; wrote:&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt; Everyone in favor say &quot;Frank&quot;!&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; --- On Mon, 11/10/08, purplespacefriend &lt;purplealiengirl@ &gt; wrote:&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; From: purplespacefriend &lt;purplealiengirl@ &gt;&lt;BR&gt;&gt; &gt; Subject: [EVP-ITC] Re: Chris Moon and his use of Franks Box gets &lt;BR&gt;slammed&lt;BR&gt;&gt; &gt; To: &lt;A href=&quot;mailto:EVP-ITC%40yahoogroups.com&quot; target=_blank rel=nofollow&gt;EVP-ITC@yahoogroups .com&lt;/A&gt;&lt;BR&gt;&gt; &gt; Date: Monday, November 10, 2008, 8:45 PM&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; A moron with title and degree--like\n that&#39;s any differnt! &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; F-S&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; --- In EVP-ITC@yahoogroups .com, &quot;M.A. Coletta (Mike)&quot; &lt;BR&gt;&gt; &gt; &lt;michaelcoletta@ ...&gt; wrote:&lt;BR&gt;&gt; &gt; &gt;&lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; Chris Moon and his use of Franks Box gets slammed&lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; Last night on Coast to Coast AM George Noory had Dr. Stephen &lt;BR&gt;Rorke&lt;BR&gt;&gt; &gt; &gt; on-air. He discussed the field of instrumental &lt;BR&gt;transcommunication&lt;BR&gt;&gt; &gt; &gt; (ITC), his study of the Spiricom case, Frank&#39;s Box, and EVP &lt;BR&gt;&gt; &gt; capture.&lt;BR&gt;&gt; &gt; &gt; It was during his discussion of Frank&#39;s Box where he brought up &lt;BR&gt;&gt; &gt; the name&lt;BR&gt;&gt; &gt; &gt; Chris Moon. He also brought up exactly what he thought of Chris &lt;BR&gt;&gt; &gt; Moon&#39;s&lt;BR&gt;&gt; &gt; &gt; use of the Franks Box he calls his telephone to the dead.&lt;BR&gt;&gt; &gt; &gt; Better than writng about it, I&#39;ve placed a link to the audio &lt;BR&gt;from &lt;BR&gt;&gt;\n &gt; last&lt;BR&gt;&gt; &gt; &gt; night, at my post below.&lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &lt;A href=&quot;http://ufomagazine./&quot; target=_blank rel=nofollow&gt;http://ufomagazine.&lt;/A&gt; blogspot. com/2008/ 11/chris- moon-and-&lt;BR&gt;&gt; his-use-of-&lt;BR&gt;&gt; &gt; franks&#92;&lt;BR&gt;&gt; &gt; &gt; -box.html&lt;BR&gt;&gt; &gt; &gt; &lt;&lt;A href=&quot;http://ufomagazine./&quot; target=_blank rel=nofollow&gt;http://ufomagazine.&lt;/A&gt; blogspot. com/2008/ 11/chris- moon-and-&lt;BR&gt;&gt; his-use-of-&lt;BR&gt;&gt; &gt; frank&#92;&lt;BR&gt;&gt; &gt; &gt; s-box.html&gt;&lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; - Mike (UFO Geek)&lt;BR&gt;&gt; &gt; &gt;&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n      \r\n--0-226941576-1226443387=:50025--"}