{"id": "12757", "subject": "Re: [EVP-ITC] Re: Ghost Box in a Faraday Cage type enclosure", "author": "Zack Widup", "timestamp": "2008-11-12T23:51:46Z", "full_text": "As I said, we really don&#39;t know a lot about this field (no pun intended - \nor was it?)  Who has actually tried receiving some sort of radio/audio in \na Faraday cage?  If it has been tried to any great extent without any \nsuccess, I wouldn&#39;t bother. But if no one has tried it yet, theories \npro or con don&#39;t mean much.\n\nIf someone tries it and doesn&#39;t get anything, al that means is that \n&quot;whoever&quot; didn&#39;t want to bother with that particular experiment.  And \nif some tries it and does get results, it means &quot;whoever&quot; did want to play \nalong. I wouldn&#39;t say lack of results proves or disproves the existence of \nspirits any more than absence of apparitions in my living room does.\n\nYou&#39;ll still get white noise from the electronics itself in a Faraday \ncage.\n\nThe photographer and educator Fresd Picker used to have a big rubber \nstamp.  Someone would send him a letter asking if this or that would work. \nHe would just use his big rubber stamp &quot;TRY IT!&quot; and then sign &quot;Sincerely, \nFred Picker&quot; and mail it back to you. So that&#39;s my advice too, if you&#39;re \nso inclined.\n\nZack\n\n\nOn Wed, 12 Nov 2008, purplespacefriend wrote:\n\n&gt; The key to spirit communcation is to provide a raw audio, which\n&gt; started out as white noise, now is bits of speech, music and noise\n&gt; from a radio--a convinient source of raw audio. Go ahead, use a farady\n&gt; cage, block all raw audio out, and when you get no voices/evp, you can\n&gt; proclaim there is no evidence for spirit! Same old &quot;scientific&quot; crap.\n&gt; Whatever you do, don&#39;t ask anyone that&#39;s been doing this work for\n&gt; close to ten years, in my case, and close to 30 years for the inventor\n&gt; of EVPmaker, god forbid you should ask any real experts. Oh, yeah,\n&gt; titles and degrees mean y&#39;all already know everything knowable!\n&gt;\n&gt; Frank-S\n&gt;"}