{"id": "12750", "subject": "Re: [EVP-ITC] The latest.", "author": "suzanne bibb", "timestamp": "2008-11-12T19:44:49Z", "full_text": "--0-1913847291-1226519089=:96487\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nWe have been using the box for several weeks now and have had some startlin=\r\ng results.=A0 Our result=A0do=A0in fact=A0seem to be in direct correlation =\r\nwith the case we&#39;re working on.=A0 I have also experienced words coming fro=\r\nm the box, that seem to be repeating people in the room.=A0 The first time =\r\nI used the box my eleven year old son burst into the room to asked what we =\r\nwere having for dinner.=A0 I replied &quot;There&#39;s roast beef in the oven&quot;, the =\r\nbox said &quot;beef&quot;, very clear and distinct.=A0 On another level, while record=\r\ning the sessions, we were able to pick up full sentences with many voices a=\r\nll speaking at once.=A0 These were captured the same way you would capture =\r\nvoices during EVP sessions using a digital recorder.=A0 If anyone would lik=\r\ne to hear samples of these I will be more than happy to send a few to you.=\r\n=A0 I prefer not to post them on esnips at this time as they are from a cas=\r\ne I am currently working on.\n=A0\nSuzanne May\nDirector\nMI Metro Paranormal S=\r\nociety\n\n--- On Wed, 11/12/08, John Frick &lt;jfrick45@...&gt; wrote:\n\n=\r\nFrom: John Frick &lt;jfrick45@...&gt;\nSubject: Re: [EVP-ITC] The lates=\r\nt.\nTo: EVP-ITC@yahoogroups.com\nDate: Wednesday, November 12, 2008, 2:32 PM\n=\r\n\n\n\n\n\n\n\nFrank, what you are doing with the boxes is interesting. I think the=\r\n draw to the box for ghost hunters is that it &quot;appears&quot; to be a communicati=\r\non device with the dead. I&#39;ve been experimenting a lot with the radio shack=\r\n hack box and I have been getting a lot. For the most part I am using it to=\r\n get answers to questions I or others have in areas that have had strange e=\r\nvents or just a paranormal nature to them. There is definitely communicatio=\r\nn at a rudimentary level although I doubt that all of it is=A0honest commun=\r\nication. I definitely see a lot of the trickster influence with these boxes=\r\n. It can and does tell people what they want to hear, and it seems to be re=\r\nading the minds of the participants. Like someone will crack a joke and the=\r\n box will respond 2 seconds later saying simply &quot;joke&quot;. I was using the box=\r\n in one area with a recently married woman and the word pregnant came=A0out=\r\n of the box=A03 times during the 2 sessions. I think the box was picking up=\r\n on\n her conscious or subconscious thoughts. I have not gotten the word pre=\r\ngnant since then. \n=A0\nSo far both radio shack types I have are working spe=\r\nctacularly for me. One of the more interesting responses I&#39;ve gotten out of=\r\n the box is that it has said &quot;ovulous&quot; backwards (it said &quot;75&quot; forwards), a=\r\nnd that was just 10 minutes or so after I was playing around with the Ovilu=\r\ns. I don&#39;t know exactly how The Ovilus is supposed to be pronounced but the=\r\n box pronounced it like I spelled it above.\n=A0\nSo what is going on with th=\r\nese boxes is extremely interesting and not readily explainable by science, =\r\nbut I lean away from thinking the communications are coming from ghosts or =\r\ndemons, I am thinking it is just transferring thought into messages or it i=\r\ns higher beings answering our questions (although not always truthfully). I=\r\n have to say I was highly skeptical that I would get anything with these ty=\r\npe of boxes but I have been fascinated by the results. I&#39;ve played what I a=\r\nm hearing for others and have done sessions with others, and these people h=\r\nave all been impressed too. Thanks for bringing this technology to the fore=\r\nfront like you have.\n=A0\n=A0\n=A0\n=A0\n\n----- Original Message ----- \nFrom: F=\r\nrank Sumption \nTo: Group \nSent: Wednesday, November 12, 2008 1:17 PM\nSubjec=\r\nt: [EVP-ITC] The latest.\n\n\n\n=A0I know, doesn&#39;t fit the latest ghost hunting=\r\n theories, and it has been poor at attracking the lime lights, but here it =\r\nis. \n=A0\n=A0I have played with the idea of adding in a tone to act as a fou=\r\nndation for the ghost voices in the boxes, it seems to works.the first exam=\r\nple is on my site, http://purplealieng irl.tripod. com/=A0, noted which one=\r\n it it there. The second attempt was wiht box 24, but the tuner was som noi=\r\nsy I kinda gave up on that box. \n=A0\n=A0In this test I used two tones, gues=\r\nsing, about 800hz, and around 1khz. The tones are mixed with the radio audi=\r\no. The exact frequency is not all the important, as these are square waves,=\r\n which contain all harmonics. This=A0is manual sweep only, the sweep circui=\r\nt is not build yet. \n=A0\n=A0My approach is testing and developing, I don&#39;t =\r\ntry to sell this stuff at this point, and=A0I can&#39;t make boxes for very man=\r\ny requesters, I just don&#39;t have the time. I&#39;ve said it a thousand times, th=\r\ne box is not the only method, there are many related methods of using raw a=\r\nudio.=A0This group has turned into more of a ghost hunters group, something=\r\n I don&#39;t agree with. \n=A0\n=A0Frank-S\n\n\n\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n      \r\n--0-1913847291-1226519089=:96487\r\nContent-Type: text/html; charset=us-ascii\r\n\r\n&lt;table cellspacing=&quot;0&quot; cellpadding=&quot;0&quot; border=&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=&quot;top&quot; style=&quot;font: inherit;&quot;&gt;&lt;DIV&gt;We have been using the box for several weeks now and have had some startling results.&nbsp; Our result&nbsp;do&nbsp;in fact&nbsp;seem to be in direct correlation with the case we&#39;re working on.&nbsp; I have also experienced words coming from the box, that seem to be repeating people in the room.&nbsp; The first time I used the box my eleven year old son burst into the room to asked what we were having for dinner.&nbsp; I replied &quot;There&#39;s roast beef in the oven&quot;, the box said &quot;beef&quot;, very clear and distinct.&nbsp; On another level, while recording the sessions, we were able to pick up full sentences with many voices all speaking at once.&nbsp; These were captured the same way you would capture voices during EVP sessions using a digital recorder.&nbsp; If anyone would like to hear samples of these I will be more than happy to send a few to you.&nbsp; I\n prefer not to post them on esnips at this time as they are from a case I am currently working on.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Suzanne May&lt;/DIV&gt;\n&lt;DIV&gt;Director&lt;/DIV&gt;\n&lt;DIV&gt;MI Metro Paranormal Society&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Wed, 11/12/08, John Frick &lt;I&gt;&lt;jfrick45@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;&lt;/DIV&gt;\n&lt;BLOCKQUOTE style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: rgb(16,16,255) 2px solid&quot;&gt;From: John Frick &lt;jfrick45@...&gt;&lt;BR&gt;Subject: Re: [EVP-ITC] The latest.&lt;BR&gt;To: EVP-ITC@yahoogroups.com&lt;BR&gt;Date: Wednesday, November 12, 2008, 2:32 PM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=yiv2051485009&gt;\n&lt;DIV id=ygrp-text&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;FONT face=Arial size=2&gt;Frank, what you are doing with the boxes is interesting. I think the draw to the box for ghost hunters is that it &quot;appears&quot; to be a communication device with the dead. I&#39;ve been experimenting a lot with the radio shack hack box and I have been getting a lot. For the most part I am using it to get answers to questions I or others have in areas that have had strange events or just a paranormal nature to them. There is definitely communication at a rudimentary level although I doubt that all of it is&nbsp;honest communication. I definitely see a lot of the trickster influence with these boxes. It can and does tell people what they want to hear, and it seems to be reading the minds of the participants. Like someone will crack a joke and the box will respond 2 seconds later saying simply &quot;joke&quot;. I was using the box in one area with a recently married woman and the word pregnant came&nbsp;out of the box&nbsp;3 times during the 2\n sessions. I think the box was picking up on her conscious or subconscious thoughts. I have not gotten the word pregnant since then. &lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=Arial size=2&gt;&lt;/FONT&gt;&lt;FONT face=Arial size=2&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=Arial size=2&gt;So far both radio shack types I have are working spectacularly for me. &lt;/FONT&gt;&lt;FONT face=Arial size=2&gt;One of the more interesting responses I&#39;ve gotten out of the box is that it has said &quot;ovulous&quot; backwards (it said &quot;75&quot; forwards), and that was just 10 minutes or so after I was playing around with the Ovilus. I don&#39;t know exactly how The Ovilus is supposed to be pronounced but the box pronounced it like I spelled it above.&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=Arial size=2&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=Arial size=2&gt;So what is going on with these boxes is extremely interesting and not readily explainable by science, but I lean away from thinking the communications are coming from ghosts or demons, I am thinking it is just transferring thought into messages or it is higher beings answering our questions (although not always truthfully). I have to say I was highly skeptical that I would get anything with these type of boxes but I have been fascinated by the results. I&#39;ve played what I am hearing for others and have done sessions with others, and these people have all been impressed too. Thanks for bringing this technology to the forefront like you have.&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=Arial size=2&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=Arial size=2&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=Arial size=2&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=Arial size=2&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;BLOCKQUOTE style=&quot;BORDER-LEFT: #000000 2px solid&quot;&gt;\n&lt;DIV style=&quot;FONT: 10pt arial&quot;&gt;----- Original Message ----- &lt;/DIV&gt;\n&lt;DIV style=&quot;BACKGROUND: #e4e4e4; FONT: 10pt arial&quot;&gt;&lt;B&gt;From:&lt;/B&gt; &lt;A title=purplealiengirl@... href=&quot;mailto:purplealiengirl@...&quot; target=_blank rel=nofollow&gt;Frank Sumption&lt;/A&gt; &lt;/DIV&gt;\n&lt;DIV style=&quot;FONT: 10pt arial&quot;&gt;&lt;B&gt;To:&lt;/B&gt; &lt;A title=evp-itc@yahoogroups.com href=&quot;mailto:evp-itc@yahoogroups.com&quot; target=_blank rel=nofollow&gt;Group&lt;/A&gt; &lt;/DIV&gt;\n&lt;DIV style=&quot;FONT: 10pt arial&quot;&gt;&lt;B&gt;Sent:&lt;/B&gt; Wednesday, November 12, 2008 1:17 PM&lt;/DIV&gt;\n&lt;DIV style=&quot;FONT: 10pt arial&quot;&gt;&lt;B&gt;Subject:&lt;/B&gt; [EVP-ITC] The latest.&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV id=ygrp-text&gt;\n&lt;DIV&gt;&nbsp;I know, doesn&#39;t fit the latest ghost hunting theories, and it has been poor at attracking the lime lights, but here it is. &lt;BR&gt;&nbsp;&lt;BR&gt;&nbsp;I have played with the idea of adding in a tone to act as a foundation for the ghost voices in the boxes, it seems to works.the first example is on my site, &lt;A href=&quot;http://purplealiengirl.tripod.com/&quot; target=_blank rel=nofollow&gt;http://purplealieng irl.tripod. com/&lt;/A&gt;&nbsp;, noted which one it it there. The second attempt was wiht box 24, but the tuner was som noisy I kinda gave up on that box. &lt;BR&gt;&nbsp;&lt;BR&gt;&nbsp;In this test I used two tones, guessing, about 800hz, and around 1khz. The tones are mixed with the radio audio. The exact frequency is not all the important, as these are square waves, which contain all harmonics. This&nbsp;is manual sweep only, the sweep circuit is not build yet. &lt;BR&gt;&nbsp;&lt;BR&gt;&nbsp;My approach is testing and developing, I don&#39;t try to sell this stuff at this point,\n and&nbsp;I can&#39;t make boxes for very many requesters, I just don&#39;t have the time. I&#39;ve said it a thousand times, the box is not the only method, there are many related methods of using raw audio.&nbsp;This group has turned into more of a ghost hunters group, something I don&#39;t agree with. &lt;BR&gt;&nbsp;&lt;BR&gt;&nbsp;Frank-S&lt;BR&gt;&lt;BR&gt;\n&lt;HR&gt;\n&lt;/DIV&gt;&lt;IMG height=1 src=&quot;http://geo.yahoo.com/serv?s=97359714/grpId=18063865/grpspId=1705082731/msgId=12747/stime=1226513875/nc1=5202317/nc2=5541752/nc3=5170420&quot; width=1&gt; &lt;BR&gt;&lt;SPAN style=&quot;COLOR: white&quot;&gt;&lt;/SPAN&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n\n\n      \r\n--0-1913847291-1226519089=:96487--"}