{"id": "12760", "subject": "Re: Ghost Box in a Faraday Cage type enclosure", "author": "itcdeadpeople", "timestamp": "2008-11-13T00:41:40Z", "full_text": "Hi Zack.  I know of researchers who&#39;ve successfully recorded EVP in a shielded \nenvironment.  It was not done with the assistance of a radio.  Just a simple digital recorder \nin silence.  Well, of course, the recorder makes it own noise.  \n\nI&#39;m *super* non-technical, so I haven&#39;t a clue about how any of our EVP gizmos work \ninternally.  I just know that I get results from various methods based my own \nexperimentation.  ;-)  I did have a friend modify one of my digital recorders.  He replaced \nthe microphone with a phototransistor and I have gotten many EVP using this recorder in a \ndarkened room with a battery operated plasma globe as the light source.  I first tried one \nthat plugs into the wall but every recording was overwhelmed by the 60hz buzz (I think \nthat&#39;s what it&#39;s called?)\n\nBecause the modified unit doesn&#39;t record what I&#39;m saying, I can&#39;t show relevance, but I \nknow based on my intention of the session that what I received was appropriate.  My \nfavorite being when I asked if what I was visualizing with my own energy field was of any \nhelp, and I got the reply, &quot;You&#39;re developing strength&quot; in an absolutely clear and \nunderstandable voice.  A lot of what comes through via this method is kinda buried in the \nnoise and hard to make out, but this was really easy to make out.  \n\nTom Butler uses the terms Opportunistic EVP and Transform EVP to describe the \ndifferences in the theories about various EVP formation.  Transform, among other things, \nbeing the type that can be received in a completely shielded environment.  Opportunistic \nmostly relating to something like radio sweep or EVPMaker where fragments of speech \nhave been selected in order to communicate.  \n\nHave you checked out the web page relating to this?  Here&#39;s the link.  It&#39;s really long so \nyou&#39;ll have to copy and paste into your browser:\n\nhttp://etheric-studies.aaevp.com/best_practices_development/index.php?\ntitle=Locating_EVP_formation_and_detecting_false_positives\n\nI&#39;m a huge fan of radio sweep, simply because my own exploration of the technique has \nproduced so many compelling examples of relevant communication that I am absolutely \nconvinced of it&#39;s validity.  Can&#39;t explain it.  Can&#39;t prove who it is or how it works.  I think it \nwould be great if someday we could understand the principles behind, if for nothing else, \nto build a better box, so to speak.  But I&#39;m satisfied (and utterly fascinated!) at this point by \nthe results I get and I&#39;m OK with it involving a little mystery.  \n\nMargaret\n\n--- In EVP-ITC@yahoogroups.com, Zack Widup &lt;w9sz@...&gt; wrote:\n&gt;\n&gt; \n&gt; As I said, we really don&#39;t know a lot about this field (no pun intended - \n&gt; or was it?)  Who has actually tried receiving some sort of radio/audio in \n&gt; a Faraday cage?  If it has been tried to any great extent without any \n&gt; success, I wouldn&#39;t bother. But if no one has tried it yet, theories \n&gt; pro or con don&#39;t mean much.\n&gt; \n&gt; If someone tries it and doesn&#39;t get anything, al that means is that \n&gt; &quot;whoever&quot; didn&#39;t want to bother with that particular experiment.  And \n&gt; if some tries it and does get results, it means &quot;whoever&quot; did want to play \n&gt; along. I wouldn&#39;t say lack of results proves or disproves the existence of \n&gt; spirits any more than absence of apparitions in my living room does.\n&gt; \n&gt; You&#39;ll still get white noise from the electronics itself in a Faraday \n&gt; cage.\n&gt; \n&gt; The photographer and educator Fresd Picker used to have a big rubber \n&gt; stamp.  Someone would send him a letter asking if this or that would work. \n&gt; He would just use his big rubber stamp &quot;TRY IT!&quot; and then sign &quot;Sincerely, \n&gt; Fred Picker&quot; and mail it back to you. So that&#39;s my advice too, if you&#39;re \n&gt; so inclined.\n&gt; \n&gt; Zack\n&gt; \n&gt; \n&gt; On Wed, 12 Nov 2008, purplespacefriend wrote:\n&gt; \n&gt; &gt; The key to spirit communcation is to provide a raw audio, which\n&gt; &gt; started out as white noise, now is bits of speech, music and noise\n&gt; &gt; from a radio--a convinient source of raw audio. Go ahead, use a farady\n&gt; &gt; cage, block all raw audio out, and when you get no voices/evp, you can\n&gt; &gt; proclaim there is no evidence for spirit! Same old &quot;scientific&quot; crap.\n&gt; &gt; Whatever you do, don&#39;t ask anyone that&#39;s been doing this work for\n&gt; &gt; close to ten years, in my case, and close to 30 years for the inventor\n&gt; &gt; of EVPmaker, god forbid you should ask any real experts. Oh, yeah,\n&gt; &gt; titles and degrees mean y&#39;all already know everything knowable!\n&gt; &gt;\n&gt; &gt; Frank-S\n&gt; &gt;\n&gt;"}