{"id": "12770", "subject": "Re: [EVP-ITC] A suggestion!", "author": "Ron Lederer", "timestamp": "2008-11-13T13:58:31Z", "full_text": "--0-22025742-1226584711=:89165\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nWow, Frank,=A0that&#39;s the most eloquent thing I&#39;ve heard said here of late.=\r\n=A0 Nice.=A0 ron\n\n--- On Wed, 11/12/08, Frank Sumption &lt;purplealiengirl@gma=\r\nil.com&gt; wrote:\n\nFrom: Frank Sumption &lt;purplealiengirl@...&gt;\nSubject: [=\r\nEVP-ITC] A suggestion!\nTo: evp-itc@yahoogroups.com\nDate: Wednesday, Novembe=\r\nr 12, 2008, 8:02 PM\n\n\n\n\n\n\n=A0For those &quot;experts&quot; out there that would tell =\r\nthe rest of us what EVP is, and how to do it, a suggestion. Try getting som=\r\ne education first, start with dong some EVP recording open air, then try th=\r\ne various forms of white noise, and other background noises that the entiti=\r\nes seemingly use to build voices out of. Then move to EVPmaker-following th=\r\ne instructions by using human speech as the &quot;raw&quot; audio. Then proceed to te=\r\nll what EVP and spirit voices are. or are not. It is rare that spirit respe=\r\ncts titles and degrees, and this usually inhibits serious &quot;scientific&quot;=A0re=\r\nsearch. \n\n=A0\n\n=A0BTW, EVPmaker is a program that runs on Windows machines.=\r\n It takes a wave (.wav)=A0file of human speech, breaks it up in small chunk=\r\ns, and plays this &quot;raw&quot; audio back through the speakers--randomly, while re=\r\ncording the result. The entities manipulate the data inside the computer. F=\r\nor some &quot;reseacher&quot; to claim there is no evidence that the program=A0works =\r\nonly means the researhcer has no idea what he&#39;she is talking about, and com=\r\nes from a position of complete ignorance. I&#39;m sure that you could place a c=\r\npmputer in a faraday cage, and EVPmaker would perform it&#39;s function. \n\n=A0\n=\r\n\n=A0I&#39;ve heard these &quot;researchers&quot; for years all claiming to be &quot;scientific=\r\n&quot; while in fact they seek only to debunk, accpeting no evidence, as if they=\r\n got their degrees after everything knowable has already been discovered. \n=\r\n\n=A0\n\n=A0Bottom line, get the voices first, then tell all us unwashed masse=\r\ns what it really is. In the mean time I&#39;ll keep working on=A0my=A0do nothin=\r\ng boxes. \n\n=A0\n\n=A0Frank-S\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n      \r\n--0-22025742-1226584711=:89165\r\nContent-Type: text/html; charset=us-ascii\r\n\r\n&lt;table cellspacing=&quot;0&quot; cellpadding=&quot;0&quot; border=&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=&quot;top&quot; style=&quot;font: inherit;&quot;&gt;Wow, Frank,&nbsp;that&#39;s the most eloquent thing I&#39;ve heard said here of late.&nbsp; Nice.&nbsp; &lt;SPAN&gt;&lt;SPAN&gt;ron&lt;/SPAN&gt;&lt;/SPAN&gt;&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Wed, 11/12/08, Frank &lt;SPAN&gt;Sumption&lt;/SPAN&gt; &lt;I&gt;&lt;purplealiengirl@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: rgb(16,16,255) 2px solid&quot;&gt;From: Frank Sumption &lt;purplealiengirl@...&gt;&lt;BR&gt;Subject: [EVP-ITC] A suggestion!&lt;BR&gt;To: evp-itc@yahoogroups.com&lt;BR&gt;Date: Wednesday, November 12, 2008, 8:02 PM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=yiv1226339684&gt;\n&lt;DIV id=ygrp-text&gt;\n&lt;DIV&gt;&nbsp;For those &quot;experts&quot; out there that would tell the rest of us what EVP is, and how to do it, a suggestion. Try getting some education first, start with dong some EVP recording open air, then try the various forms of white noise, and other background noises that the entities seemingly use to build voices out of. Then move to EVPmaker-&lt;U&gt;following the instructions&lt;/U&gt; by using human speech as the &quot;raw&quot; audio. Then proceed to tell what EVP and spirit voices are. or are not. It is rare that spirit respects titles and degrees, and this usually inhibits serious &quot;scientific&quot;&nbsp;research. &lt;BR&gt;&lt;BR&gt;&nbsp;&lt;BR&gt;&lt;BR&gt;&nbsp;BTW, EVPmaker is a program that runs on Windows machines. It takes a wave (.wav)&nbsp;file of human speech, breaks it up in small chunks, and plays this &quot;raw&quot; audio back through the speakers--randomly, while recording the result. The entities manipulate the data &lt;U&gt;inside&lt;/U&gt; the computer. For some &quot;reseacher&quot; to claim there is no\n evidence that the program&nbsp;works only means the researhcer has no idea what he&#39;she is talking about, and comes from a position of complete ignorance. I&#39;m sure that you could place a cpmputer in a faraday cage, and EVPmaker would perform it&#39;s function. &lt;BR&gt;&lt;BR&gt;&nbsp;&lt;BR&gt;&lt;BR&gt;&nbsp;I&#39;ve heard these &quot;researchers&quot; for years all claiming to be &quot;scientific&quot; while in fact they seek only to debunk, accpeting no evidence, as if they got their degrees after everything knowable has already been discovered. &lt;BR&gt;&lt;BR&gt;&nbsp;&lt;BR&gt;&lt;BR&gt;&nbsp;Bottom line, get the voices first, then tell all us unwashed masses what it really is. In the mean time I&#39;ll keep working on&nbsp;my&nbsp;do nothing boxes. &lt;BR&gt;&lt;BR&gt;&nbsp;&lt;BR&gt;&lt;BR&gt;&nbsp;Frank-S&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n      \r\n--0-22025742-1226584711=:89165--"}