{"id": "12789", "subject": "Re: The latest.", "author": "ghostpi559", "timestamp": "2008-11-13T19:04:49Z", "full_text": "Hi Frank,\n\nWell I agree on most of your postings. I&#39;m a big fan of yours, by the \nway. I am impressed with your ability to adapt your surroundings in \norder to communicate with other energies. I am also very glad to have \nfound this Yahoo group.\n\nThe only thing I&#39;m curious about is the term &#39;ghost hunters group&#39; \nand why you don&#39;t agree with it.\n\nI 100% agree that I don&#39;t need to go anywhere special to do evp. I \nget it walking my dog, going up my stairs, sitting at my table, \netc... but there is an occasion when someone is upset and scared in \ntheir own home or business and wants to have someone try to find out \nthe nature of what is co-existing with them in that space.\n\nI will respectfully go (with other like minded individuals) to an \narea that I feel has some paranormal activity or to an area I have \nbeen asked to visit because the occupants feel there is paranormal \nactivity. I do not solicit my help and I do not advertise. These \npeople seek me out.\n\nWhen traveling to another location away from my home and entering \nsomeone else&#39;s turf, anything can happen and it is always better to \nhave a buddy along when you go to locations that are unfamiliar to \nyou and you don&#39;t know the people there. Hence my buddy, or more, \ncome with me to observe and/or assist in helping to determine the \nnature of the situation surrounding paranormal events. For free, \nwithout a tv crew or radio station.\n\nWhile I am of the opinion that these things aren&#39;t harmful (nor are \nthey all of the same origin), I always attempt to show the person and \ntalk calmly with them about some of the possible reasons for the \nactivity and why they should not be afraid. It helps if I get evp \nthat I can share with them and they can relax and be at peace co-\nexisting with the energy there. I talk with other curious people who \nhave questions also and I share with them your discoveries as well as \nSarah Estep and her work with EVP. \n\nI also believe that it is very important to share these experiences \nin person with the masses (as much as one five foot woman) can do.  \nNot by becoming a tv personality or anything of that sort but I do my \nbest in my local area to bring others to a better understanding of \nthe complex and wonderful world we live in.  If they are thrilled by \nthe discovery that we are definitely not alone I have no problem with \nbeing a part of that. I consider it an honor. It is my gift to them.\n\nI have seen people become more spiritual as a result of what I have \nshared with them and I am full of joy over that. They become more \naware of their effect on others and if they alter their behavior to \nthe good of themselves and the others around them then I feel I have \ndone a good thing.\n\nI do not believe that the knowledge of spirit communication should \nonly belong to one particular sect of individuals. Who am I to hold \nback on sharing with any individual or any group of people who are \nseeking this experience? Or the technical aspects. It&#39;s denies them \nthe &#39;possibilities&#39; of observing an afterlife. This defeats the \npurpose for wanting to study EVP. \n\nIf we use your box, or any other piece of equipment we are not bad \npeople because there are many of us together instead of just a single \nindividual operating it.  \n\nMy group spent Sunday October 26th cleaning, praying (in each our own \nway) and showing respects to all the John, Jane and Baby Does in our \ncity&#39;s potter&#39;s field. As well as paying respects in an old Chinese \nSam Yup Cemetery next door. It does not matter each person&#39;s race, \ngender or that some of us are Christian, some Wiccan, some Mormon, \nsome Buddist, etc...  As imperfect people we all try to give back, in \nthe only ways we have available to us at this time, to those energies \nthat help us better understand our world. On that day and every day.\n\nPlease don&#39;t put us all down as bad Frank. We are good people too. I \ncan only speak for myself and my group. We wholeheartedly agree we \nare not experts--- we are in this with you and all of EVP-ITC in \nunderstanding and hopefully enhancing the development spirit \ncommunication. You won&#39;t see any of us on a soap box. But we \nare &#39;labeled&#39; and it troubles me that we are criticized for being a \ngroup instead of for individual trespasses.\n\nWe admire and respect you much. Hope you maybe change your idea about \nall &#39;ghost hunters groups&#39;.\n\nThank you,\nClara \n\n\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@...&gt; \nwrote:\n&gt;\n&gt; \n&gt;  I know, doesn&#39;t fit the latest ghost hunting theories, and it has \nbeen poor at attracking the lime lights, but here it is. \n&gt;  \n&gt;  I have played with the idea of adding in a tone to act as a \nfoundation for the ghost voices in the boxes, it seems to works.the \nfirst example is on my site, http://purplealiengirl.tripod.com/ , \nnoted which one it it there. The second attempt was wiht box 24, but \nthe tuner was som noisy I kinda gave up on that box. \n&gt;  \n&gt;  In this test I used two tones, guessing, about 800hz, and around \n1khz. The tones are mixed with the radio audio. The exact frequency \nis not all the important, as these are square waves, which contain \nall harmonics. This is manual sweep only, the sweep circuit is not \nbuild yet. \n&gt;  \n&gt;  My approach is testing and developing, I don&#39;t try to sell this \nstuff at this point, and I can&#39;t make boxes for very many requesters, \nI just don&#39;t have the time. I&#39;ve said it a thousand times, the box is \nnot the only method, there are many related methods of using raw \naudio. This group has turned into more of a ghost hunters group, \nsomething I don&#39;t agree with. \n&gt;  \n&gt;  Frank-S\n&gt; _________________________________________________________________\n&gt; Get 5 GB of storage with Windows Live Hotmail.\n&gt; http://windowslive.com/Explore/Hotmail?\nocid=TXT_TAGLM_WL_hotmail_acq_5gb_112008\n&gt;"}