{"id": "12796", "subject": "Re: Re : [EVP-ITC] Proofs for spirit world?", "author": "purplespacefriend", "timestamp": "2008-11-14T03:48:23Z", "full_text": "hummmm -and yet somehow I seem to be the only friggihn&#39; duffus out \nhere that can understand spirit communication  enough to make the \nshit that works! And, that no one seems able to duplicate, depite \nthat fact that the concepts and circuits are simple. \n\n Frank\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;threadsintyme@...&quot; \n&lt;Threadsintyme@...&gt; wrote:\n&gt;\n&gt; I am a bit taken back, Frank...spiritualism teaches pretty much \nthe same thing (about setting your own self imposed laws and rules, \netc). \n&gt; Natural Law in the spiritualist movement is about not only Natural \nLaws (such as gravity) and combining with spirit philosophy. One of \ntheir main teachings is that Natural Law can&#39;t be broken. Gravity as \nsuch, can&#39;t instantly become anti-gravity. Gives some constancy to \nour lives. \n&gt; Al\n&gt; \n&gt; -- Frank Ratka &lt;warrior18eii@...&gt; wrote:\n&gt; \n&gt; No hostility meant! Al, why do you think we are limited to this \ntime/space universe? Even Hawking refers to the cosmos as a \nmultiverse. When consciousness is involved, the only limits are the \nones you press upon yourself. The only boundaries are the ones you \nbuild. We are so quick to give things meaning and definition but \nwhat do we truly know about existence. At one time philosophy and \nscience were one until it was deemed we needed a more structured and \ndisciplined approach to &quot;figuring things out&quot;, hence the birth of \nthe scientific method.  Natural law is what we all agree it is!\n&gt; From: &quot;threadsintyme@...&quot; &lt;Threadsintyme@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Thursday, November 13, 2008 3:29:01 PM\n&gt; Subject: Re: Re : [EVP-ITC] Proofs for spirit world?\n&gt; \n&gt; I have a question that everyone might disagree with...perhaps not. \nWhere does this leave Natural Law? \n&gt; You are right, Zack...because we are limited to this time/space \nuniverse. On the other hand, spirits (however you wish to refer to \nthe deceased) are definetly not limited to this single universe as \nthe living are. They become (I believe) non-localized entities. The \nliving are localized... to the here and now. \n&gt; These are just some thoughts to share...not meant to cause any \nhostility, etc. \n&gt; Kimberly,\n&gt; What do you think abhout non-localized entities?\n&gt; Al\n&gt; \n&gt; -- Zack Widup &lt;w9sz@prairienet. org&gt; wrote:\n&gt; \n&gt; &lt;&lt;But we are definitely dealing with the non-physical here, so any \nideas \n&gt; that try to correlate a spirit to something physical can be thrown \nout the \n&gt; window. While it is true that they appear to be coexisting in the \nphysical \n&gt; universe, there&#39;s no reason to assume they are limited by it.&gt;&gt;\n&gt; \n&gt; I have dozens of EVP I&#39;ve gotten in the former Manteno State \nMental \n&gt; Hospital in Illinois. And you know what? Whatever made those EVP&#39;s \nstill \n&gt; seems to be crazy. And these were apparently made by spirits who \nno longer have physical bodies. So much for the idea of &quot;chemical \nimbalances in the brain&quot; being the root of insanity! A ghost doesn&#39;t \nhave a brain.\n&gt; \n&gt; I think Hamlet summed it up the best:\n&gt; \n&gt; &quot;There are more things in heaven and earth, Horatio, than are \ndreamt of in \n&gt; your philosophy.&quot;\n&gt; \n&gt; I constantly remind myself of that.\n&gt; \n&gt; Zack\n&gt; \n&gt; On Thu, 13 Nov 2008, Frank Ratka wrote:\n&gt; \n&gt; &gt; I have no idea what you are talking about, angels? pins?! \nAnyway, applying earth&#39;s physical sciences to attempt to explain a \nphenomenon that has shown no evidence of roots in the physical is an \nexercise in futility and pointless.\n&gt; &gt;\n&gt; &gt; Regards,\n&gt; &gt;\n&gt; &gt; Frank R.\n&gt; &gt;\n&gt; \n&gt; \n&gt; ____________ _________ _________ _________ _________ _________ ___ \n&gt; Find success and happiness with drug and alcohol rehabilitation. \nClick now.\n&gt; \n&gt; \n&gt;  \n&gt; ____________________________________________________________\n&gt; Get the shot you need with a discreet new spy camera. Click now!\n&gt; \nhttp://thirdpartyoffers.juno.com/TGL2131/fc/Ioyw6iifQmmQrc27s4zuDInUF\nHRt2aCHPjJa4bGVVqDi0P1Wh1buzK/\n&gt;"}