{"id": "12826", "subject": "Re: Hello there everyone", "author": "marie32711", "timestamp": "2008-11-18T12:05:03Z", "full_text": "--- In EVP-ITC@yahoogroups.com, Misty Dawn &lt;bulletbabea@...&gt; wrote:\n&gt;\n&gt; Hi Marie. Welcome to the group. I enjoy manual sweep tuning and \nhave had some great results including direct responses using that \nmethod. I think when they use my name (first middle and last) \nconstantly that kind of throws out the randomness idea most skeptics \nhave. But usually it takes people hearing thier own names and info to \nwonder if there is more to it.\n&gt; \n&gt; Misty\n&gt; \n&gt; \n&gt; --- On Mon, 11/17/08, marie32711 &lt;m.mickley@...&gt; wrote:\n&gt; \n&gt; &gt; From: marie32711 &lt;m.mickley@...&gt;\n&gt; &gt; Subject: [EVP-ITC] Hello there everyone\n&gt; &gt; To: EVP-ITC@yahoogroups.com\n&gt; &gt; Date: Monday, November 17, 2008, 12:56 PM\n&gt; &gt; Hi i am really interested in evp/itc and have been recording\n&gt; &gt; for \n&gt; &gt; aproximately 5/6 months i currently do both normal evp work\n&gt; &gt; and also \n&gt; &gt; radio scanning(not franks box or radio shack hacks) but\n&gt; &gt; manually \n&gt; &gt; scanning through the channels..i have been quite surprised\n&gt; &gt; by the \n&gt; &gt; results that i have got.\n&gt; &gt; I have video posted on youtube(screen name mazblondie) and\n&gt; &gt; it would be \n&gt; &gt; excellent if anyone could give there opinions.\n&gt; &gt; I have had many different theory presented to me, from\n&gt; &gt; imaginationto \n&gt; &gt; plain faking it, but i can believe that it is all down to\n&gt; &gt; chance!!\n&gt; &gt; Hope to hear from you soon.\n&gt; &gt; Marie\n&gt;\n\n\nHi Misty,\nThanks for the reply, i too enjoy the manual method of getting itc/evp\nthen again i cannot afford to get anything other than that!! But i do \nthink that if i am gettting such great results using this method, \nthen why change? I have such specific results...getting the wonderful \nspirits that visit me to repeat words...and they have said things to \nme that wewe to specific to just be radio chatter...including both \nmine and my fiance&#39;s nicknames as children. (both VERY strange \nnames!!!)I have had accusations that i fake it, but to be honest \nother than the fact i wouldnt know how to fake it, i have no desire \nto do so, being slightly sceptical when i started doing this, i have \nbeen blown away by the results i have acheived!!\nAs i mentioned before i have some videos on youtube(mazblondie) and \nit would be FANTASTIC if you could take a look and see what you think.\nHave you been recording long?\nDo you have any video;s recordings to listen to??\nMarie"}