{"id": "12821", "subject": "Re: [EVP-ITC] Hi everyone !", "author": "Misty Dawn", "timestamp": "2008-11-17T20:29:36Z", "full_text": "Hi Neli. Welcome to the group. I think you will find most people are also trying to find out either who is speaking or how its possible. Thats a journey and a conclusion we each have to do on our own. Theres alot of nice people here who are willing to help when they can.\n\nAs for if they are alien spirits, I can only say personally not all claim to have been human. Some claim they were never born here or even have names like we do. While others are people I knew in life who have crossed over and still send validation that they are around.\n\nGood luck on your journey it will be an interesting one!\n\nMisty\n\n\n--- On Mon, 11/17/08, neli_nelis &lt;neli_nelis@...&gt; wrote:\n\n&gt; From: neli_nelis &lt;neli_nelis@...&gt;\n&gt; Subject: [EVP-ITC] Hi everyone !\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Monday, November 17, 2008, 4:18 AM\n&gt; Hello\n&gt; \n&gt; I&#39;m a newbie at this place and would like to know the\n&gt; meaning of some \n&gt; of my EVPs, as I have many of them, one of the last ones\n&gt; says: &quot;COME \n&gt; WITH US, RECALL&quot; then I asked who were they, and they\n&gt; told me &quot;Ummitta \n&gt; people&quot;, I have seen ufos, but I don&#39;t know if\n&gt; they can give messages \n&gt; as the ones of EVP, the very last one, says: CAN YOU HEAR\n&gt; ME ? Wow ! I \n&gt; want to know who is trying to communicate with me, as the\n&gt; voice is so \n&gt; human that it doesn&#39;t seems to be a spirit, although\n&gt; they speak with \n&gt; low voice. But I am very astonished with the one of\n&gt; &quot;come with us&quot; \n&gt; and &quot;Recall&quot; I don&#39;t know what do I have to\n&gt; recall, I do my EVPs with \n&gt; my cell phone, I have time with this practice but lately\n&gt; the \n&gt; communications are so clear that I doubt that they can be\n&gt; of the spirit \n&gt; world, can some of you help me to understand the message\n&gt; please ???\n&gt; \n&gt; Kind regards\n&gt; Neli"}