{"id": "12853", "subject": "Bruce Halliday makes his claim", "author": "M.A. Coletta (Mike)", "timestamp": "2008-11-21T02:22:13Z", "full_text": "(Misty... you may remove this post if it is against the forum rules)\n\nGreetings fellow researchers,\n\nI normally don&#39;t get into petty matters such as the following, but an \nindividual (Bruce Halliday) who was banned from this forum is asking \nme to stop my claim of being the originator of the hack of the 12-470.\nHe wants me to remove that claim from my website, etc.\nBruce&#39;s e-mail to me was one of surprise.\nWhy... it was on this very forum that Bruce admitted that his \nattempted hack of the 12-470 did not work, after I had shared my \nsuccess with all of you.\nI&#39;ve included the forum messages from last year with their date and \ntime stamps. The messages are still right here on this forum.\nBruce says he hacked the radio first and then posted his hack on his \nwebsite.\nBut, as you can see in the following messages, Bruce told me his \nattempt did not work, posting this after my hack.\n\nI would not even mention this if Bruce&#39;s e-mail to me wasn&#39;t so \nthreatening...  I just wanted to get the record straight.\n\n- Mike (UFO Geek)\n\n========================\nRe: Mini AM/FM Hack Site \nSun Nov 25, 2007 9:09 pm\n\nOkay... I spent the money :-) and yes, it (the 12-470) can be\nmodified to sweep the AM, FM, TV, and Wx bands. I just completed the\nmod on the 12-470. Unlike the 12-469, the 12-470 has a built in\nspeaker too!\nI&#39;ll post a video of me doing both the 12-469 mod and the 12-470 mod.\n\nThanks..\n-Mike\n---\nRE: [EVP-ITC] Re: Mini AM/FM Hack Site \nSun Nov 25, 2007 9:14 pm\n\nmike,\n \nI just modified the 12-470 myself and do not have fm signal\nmy model has the tape wires sotered to the board and not the pins.\nthe am works fine but no fm just static. does your fm work?\n \nbruce\n\nBruce Halliday \nParanormal Investigating Team \n\n---\nRe: [EVP-ITC] Re: Mini AM/FM Hack Site \nSun Nov 25, 2007 9:37 pm \n\nMike \n \nShoot me a link so I can add it to the hack site!\n \n- Sum\n\n---\nRe: Mini AM/FM Hack Site \nSun Nov 25, 2007 11:10 pm\n\nHi Bruce,\n\nYes, I have sweeping AM, FM, TV, and Wx. I just uploaded the video\nshowing how I did the 12-470 mod. The link is at:\nhttp://www.ufogeek.com/12-470mod.wmv\n\n- Mike\n\n---\nRe: Mini AM/FM Hack Site \nSun Nov 25, 2007 11:12 pm\n\nHi Sum,\n\nThe video links of me doing the mods are at:\n\nhttp://www.ufogeek.com/12-470mod.wmv\n\nand\n\nhttp://www.ufogeek.com/12-469mod.wmv\n\n-Mike\n\n---\nRe: [EVP-ITC] Re: Mini AM/FM Hack Site \nSun Nov 25, 2007 11:32 pm\n\nMike,\n \nI&#39;ll post the link.... I think you got an older version of the 12-470 \nMine is a all black case. No ribbon wire No markings. \nmfg date 7 of 07 by the case markings. \n \nAnyway No joy with this version But I&#39;ll post your hack on the site \nthanks!\n \n-Sum\n\n-----------------------------"}