{"id": "12858", "subject": "Re: [EVP-ITC] Bruce Halliday makes his claim", "author": "Misty Dawn", "timestamp": "2008-11-21T04:39:04Z", "full_text": "Hi Mike\n\nSighhhhh normally I wouldnt reply to BS but it seems I always end up having to comment on his conflicts with members of this group.\n\nNo.. I wont remove it. It&#39;s been sent out to everyone long before I got home from work so removing it would be pointless. You are all adults. You are correct and the posts on this forum support the fact that you were the first one to post the idea to hack the 12-470 and others were just following your theoretical idea. Anyone can do a simple search for 12-470 and find the truth for themselves. I find it very sad that someone who is a great researcher can develop such personality conflicts that they feel the need to attack other members in the community rather than work with them to move forward and learn more together. That goes for all members who get involved in these war of words.\n\nJust to clear things up so there are no misconceptions... For the record Bruce was NEVER banned here by me or anyone else. Some felt he may have deserved it a few times, but he chose to leave on his own accord. That was his choice not mine. \n\nI know alot of people including Bruce now think I personally dislike him but in fact thats not true. I just wish people would learn from their mistakes. I find him to be a great asset to the research when hes thinking clearly and acting in a positive manner.\n\nHe left this group twice after causing some blowups and members were emailing me his personal attacks that were sent via email and asking me to ban him but some were just as guilty. When he decided to make his comeback the third time I denied him. That was my choice, I didnt ask anyones permission for the decision I made. From what I understand he continues to do that on the other groups he is in. Again it is very sad for me. I tried to help him when he first got started and I enjoyed watching the progress he made.\n\nEgo is a nasty double edged sword. \n\nBruce, I know you read this (our group is publically available to the world) and I would just like to say that I dont hate you tho the feeling may not be mutual. I dont wish bad things to happen to you and I hope that people learn to accept the fact they are not an expert, never will be an expert, but thats ok because NO ONE is including me! And let the ego go man. Your work will speak for itself and the nastiness gets in the way of progress. I enjoyed working WITH you. And I am sure others do too. \n\nI like both sides of the conflict (as usual) so all I can say is there are better things to do with your time than fight with each other people!\n\nLove and Light!\n\nMisty\n\n\n--- On Thu, 11/20/08, M.A. Coletta (Mike) &lt;michaelcoletta@...&gt; wrote:\n\n&gt; From: M.A. Coletta (Mike) &lt;michaelcoletta@...&gt;\n&gt; Subject: [EVP-ITC] Bruce Halliday makes his claim\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Thursday, November 20, 2008, 9:22 PM\n&gt; (Misty... you may remove this post if it is against the\n&gt; forum rules)\n&gt; \n&gt; Greetings fellow researchers,\n&gt; \n&gt; I normally don&#39;t get into petty matters such as the\n&gt; following, but an \n&gt; individual (Bruce Halliday) who was banned from this forum\n&gt; is asking \n&gt; me to stop my claim of being the originator of the hack of\n&gt; the 12-470.\n&gt; He wants me to remove that claim from my website, etc.\n&gt; Bruce&#39;s e-mail to me was one of surprise.\n&gt; Why... it was on this very forum that Bruce admitted that\n&gt; his \n&gt; attempted hack of the 12-470 did not work, after I had\n&gt; shared my \n&gt; success with all of you.\n&gt; I&#39;ve included the forum messages from last year with\n&gt; their date and \n&gt; time stamps. The messages are still right here on this\n&gt; forum.\n&gt; Bruce says he hacked the radio first and then posted his\n&gt; hack on his \n&gt; website.\n&gt; But, as you can see in the following messages, Bruce told\n&gt; me his \n&gt; attempt did not work, posting this after my hack.\n&gt; \n&gt; I would not even mention this if Bruce&#39;s e-mail to me\n&gt; wasn&#39;t so \n&gt; threatening...  I just wanted to get the record straight.\n&gt; \n&gt; - Mike (UFO Geek)\n&gt; \n&gt; ========================\n&gt; Re: Mini AM/FM Hack Site \n&gt; Sun Nov 25, 2007 9:09 pm\n&gt; \n&gt; Okay... I spent the money :-) and yes, it (the 12-470) can\n&gt; be\n&gt; modified to sweep the AM, FM, TV, and Wx bands. I just\n&gt; completed the\n&gt; mod on the 12-470. Unlike the 12-469, the 12-470 has a\n&gt; built in\n&gt; speaker too!\n&gt; I&#39;ll post a video of me doing both the 12-469 mod and\n&gt; the 12-470 mod.\n&gt; \n&gt; Thanks..\n&gt; -Mike\n&gt; ---\n&gt; RE: [EVP-ITC] Re: Mini AM/FM Hack Site \n&gt; Sun Nov 25, 2007 9:14 pm\n&gt; \n&gt; mike,\n&gt;  \n&gt; I just modified the 12-470 myself and do not have fm signal\n&gt; my model has the tape wires sotered to the board and not\n&gt; the pins.\n&gt; the am works fine but no fm just static. does your fm work?\n&gt;  \n&gt; bruce\n&gt; \n&gt; Bruce Halliday \n&gt; Paranormal Investigating Team \n&gt; \n&gt; ---\n&gt; Re: [EVP-ITC] Re: Mini AM/FM Hack Site \n&gt; Sun Nov 25, 2007 9:37 pm \n&gt; \n&gt; Mike \n&gt;  \n&gt; Shoot me a link so I can add it to the hack site!\n&gt;  \n&gt; - Sum\n&gt; \n&gt; ---\n&gt; Re: Mini AM/FM Hack Site \n&gt; Sun Nov 25, 2007 11:10 pm\n&gt; \n&gt; Hi Bruce,\n&gt; \n&gt; Yes, I have sweeping AM, FM, TV, and Wx. I just uploaded\n&gt; the video\n&gt; showing how I did the 12-470 mod. The link is at:\n&gt; http://www.ufogeek.com/12-470mod.wmv\n&gt; \n&gt; - Mike\n&gt; \n&gt; ---\n&gt; Re: Mini AM/FM Hack Site \n&gt; Sun Nov 25, 2007 11:12 pm\n&gt; \n&gt; Hi Sum,\n&gt; \n&gt; The video links of me doing the mods are at:\n&gt; \n&gt; http://www.ufogeek.com/12-470mod.wmv\n&gt; \n&gt; and\n&gt; \n&gt; http://www.ufogeek.com/12-469mod.wmv\n&gt; \n&gt; -Mike\n&gt; \n&gt; ---\n&gt; Re: [EVP-ITC] Re: Mini AM/FM Hack Site \n&gt; Sun Nov 25, 2007 11:32 pm\n&gt; \n&gt; Mike,\n&gt;  \n&gt; I&#39;ll post the link.... I think you got an older version\n&gt; of the 12-470 \n&gt; Mine is a all black case. No ribbon wire No markings. \n&gt; mfg date 7 of 07 by the case markings. \n&gt;  \n&gt; Anyway No joy with this version But I&#39;ll post your hack\n&gt; on the site \n&gt; thanks!\n&gt;  \n&gt; -Sum\n&gt; \n&gt; -----------------------------"}