{"id": "12851", "subject": "Re: [EVP-ITC] Re: 1485 kHz", "author": "Zack Widup", "timestamp": "2008-11-20T06:29:09Z", "full_text": "When I got my Novice license in 1967 I mainly hung out on 40 and 15 \nmeters.  Didn&#39;t have an antenna that worked on 80 meters (or so I \nthought). I&#39;ve since learned that any piece of wire can be tuned to 80 \nmeters and some of them actually radiate!\n:-)\n\nI&#39;m curious about this 1485 kHz frequency.  And I was surprised the FCC \nwebsite I listed would come up with so many foreign stations on 1480 and \n1490. Lots of interesting data from that website.  Trans World Radio in \nBonaire on 800 kHz runs 500 kW - that&#39;s half a million watts!\n\nZack (W9SZ)\n\n\nOn Thu, 20 Nov 2008, threadsintyme@... wrote:\n\n&gt; Zack,\n&gt; You&#39;re quite right...I was thinking of 15 meters. Hung out on 20 and 40 meters respectively.\n&gt; Al\n&gt;\n&gt; -- Zack Widup &lt;w9sz@...&gt; wrote:\n&gt;\n&gt;\n&gt; Hi Al,\n&gt;\n&gt; Do you mean the 14 MHz (20 meter) band or 21 MHz (15 meter) band? 14\n&gt; meters was never allocated to radio amateurs. :-)\n&gt;\n&gt; Until we get some more sunspots, 15 meters and above has been fairly dead\n&gt; for over a year. 20 meters has quite a bit of activity and 40 and 80\n&gt; meters get most of the activity these days.\n&gt;\n&gt; 1485 kHz is in the AM broadcast band but isn&#39;t a standard channel in the\n&gt; USA, which goes in 10 kHz steps. There would be stations on 1480 and 1490\n&gt; in the USA, not necesssarily in your area, though. If you go to this page:\n&gt;\n&gt; http://www.fcc.gov/mb/audio/amq.html\n&gt;\n&gt; Enter 1480 as the lower frequency and 1490 as the upper frequency and\n&gt; you&#39;ll get a page listing all the stations on those two frequencies.\n&gt;\n&gt; Zack\n&gt;\n&gt; On Wed, 19 Nov 2008, threadsintyme@... wrote:\n&gt;\n&gt;&gt; LOL...Same here! I *thought* that this sounded as if it were in the AM band.\n&gt;&gt; Glad I didn&#39;t ask if it was AM or FM or SSB! LOL hehe\n&gt;&gt; Man, I remember when I was a kid and would work DX on the 14 meter band. CW was my choice and really loved it. &lt;sigh, heavy, heart broken sigh&gt;\n&gt;&gt; That was back in the good ole daze of 1968...had more sick days at school that they kept up with!\n&gt;&gt; Al\n&gt;&gt;\n&gt;&gt; -- don powell &lt;dpowell7299@...&gt; wrote:\n&gt;&gt;\n&gt;&gt; According to Wikipedia, 1485 Khz is in the AM band region. I had thought so but had to look it up.... really long time since my radio/antenna design days :)\n&gt;&gt;\n&gt;&gt; Don\n&gt;&gt;\n&gt;&gt; --- On Wed, 11/19/08, threadsintyme@... &lt;Threadsintyme@...&gt; wrote:\n&gt;&gt; From: threadsintyme@... &lt;Threadsintyme@...&gt;\n&gt;&gt; Subject: Re: [EVP-ITC] Re: 1485 kHz\n&gt;&gt; To: EVP-ITC@yahoogroups.com\n&gt;&gt; Date: Wednesday, November 19, 2008, 2:36 PM\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; Jeff,\n&gt;&gt; I wonder what is on that frequency in the US?\n&gt;&gt; Al\n&gt;&gt;\n&gt;&gt; -- &quot;Jeff&quot; &lt;vortex6066@yahoo. com.au&gt; wrote:\n&gt;&gt;\n&gt;&gt; Hi Mike,\n&gt;&gt; My viewpoint on this is that 1485kHz was a frequency that provided\n&gt;&gt; Jurgenson with one (of probably many) correct combinations of\n&gt;&gt; frequency spectra and dynamics necessary for the formation of EVP -\n&gt;&gt; at that period in time, and at that location.\n&gt;&gt; In chapter 24 of &quot;Sprechfunk mit Verstorbenen&quot; , Jurgenson mentions\n&gt;&gt; that &quot;Lena&quot; used a special sound frequency that she fashioned from\n&gt;&gt; the overlapping of certain sounds and which would have sounded in\n&gt;&gt; most cases like a toneless, meaningless hissing.\n&gt;&gt; Also he mentions that the &quot;friends&quot; were able to shape the sound\n&gt;&gt; frequencies of the radio waves by instantly modulating the existing\n&gt;&gt; sounds.\n&gt;&gt; But most importantly, in chapter 43 he mentions being able to turn\n&gt;&gt; the radio dial carefully and hear Lena&#39;s voice on almost every\n&gt;&gt; frequency.\n&gt;&gt;\n&gt;&gt; I tend to conclude therefore that 1485khz was one of many useful\n&gt;&gt; frequencies he used that time, but probably holds no specific\n&gt;&gt; relevance today, excepting if it is able to provide the correct\n&gt;&gt; spectral dynamics (more than any other frequency).\n&gt;&gt; regards,\n&gt;&gt; JEFF\n&gt;&gt;\n&gt;&gt; --- In EVP-ITC@yahoogroups .com, &quot;M.A. Coletta (Mike)&quot;\n&gt;&gt; &lt;michaelcoletta@ ...&gt; wrote:\n&gt;&gt;&gt;\n&gt;&gt;&gt; So, what&#39;s up with the frequency 1485 kHz?\n&gt;&gt;&gt;\n&gt;&gt;&gt; - Mike (UFO Geek)\n&gt;&gt;&gt; http://www.ufogeek. com\n&gt;&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; ____________ _________ _________ _________ _________ _________ _________ ______\n&gt;&gt; A New Way to Get Free Discounted Offers -- FreeInternet. com!\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; __________________________________________________________\n&gt;&gt; Improve your home. Click for products, services, and project ideas.\n&gt;&gt; http://thirdpartyoffers.juno.com/TGL2131/fc/PnY6rbu3zDj0t0XJLlQSZ5peEV4XYyb40oTDoE6Fh2N0ZtZK07Oy4/\n&gt;\n&gt;"}