{"id": "12868", "subject": "Re: Bruce Halliday makes his claim", "author": "M.A. Coletta (Mike)", "timestamp": "2008-11-21T15:42:17Z", "full_text": "Hi,\n\nThank you for your kind words and support... A huge smile is upon my \nface.. :-)\n\nHave a great day!\n- Mike (UFOGeek)\n\n--- In EVP-ITC@yahoogroups.com, black bear hollow \n&lt;blackbearhollow@...&gt; wrote:\n&gt;\n&gt; Mike,\n&gt; \n&gt; Everyone here and in the Grass Harp knows your work. Bruce has \neither  \n&gt; been banned, left, or caused trouble with his raging ego in \nvirtually  \n&gt; every group he has belonged to, claims of discoveries, being an  \n&gt; &quot;expert&quot;, and well, you name it. He&#39;s new to EVP research, edits \nhis  \n&gt; recordings, and us old timers who have recorded for years know he  \n&gt; hasn&#39;t been round that long.\n&gt; \n&gt; He&#39;s made a terrible reputation for himself in this line of \nresearch.  \n&gt; He&#39;s his biggest fan. We all know your work and what you&#39;ve done. \nNo  \n&gt; worries.\n&gt; \n&gt; Ignoring Bruce is the best avenue, and be sure to continue to take  \n&gt; credit for your work. I&#39;d make sure to keep  copies of those posts \nof  \n&gt; Bruce&#39;s for your own records and in case Bruce tries anything \nunusual.  \n&gt; Also save his emails. It&#39;s all evidence, not that you&#39;d need it, \nbut  \n&gt; as proof.\n&gt; \n&gt; Wisteria\n&gt; On Nov 21, 2008, at 9:29 AM, threadsintyme@... wrote:\n&gt; \n&gt; &gt; Greetings fellow researchers,\n&gt; &gt;\n&gt; &gt; I normally don&#39;t get into petty matters such as the following, \nbut an\n&gt; &gt; individual (Bruce Halliday) who was banned from this forum is \nasking\n&gt; &gt; me to stop my claim of being the originator of the hack of the 12-\n470.\n&gt; &gt; He wants me to remove that claim from my website, etc.\n&gt; &gt; Bruce&#39;s e-mail to me was one of surprise.\n&gt; &gt; Why... it was on this very forum that Bruce admitted that his\n&gt; &gt; attempted hack of the 12-470 did not work, after I had shared my\n&gt; &gt; success with all of you.\n&gt; &gt; I&#39;ve included the forum messages from last year with their date \nand\n&gt; &gt; time stamps. The messages are still right here on this forum.\n&gt; &gt; Bruce says he hacked the radio first and then posted his hack on \nhis\n&gt; &gt; website.\n&gt; &gt; But, as you can see in the following messages, Bruce told me his\n&gt; &gt; attempt did not work, posting this after my hack.\n&gt; &gt;\n&gt; &gt; I would not even mention this if Bruce&#39;s e-mail to me wasn&#39;t so\n&gt; &gt; threatening... I just wanted to get the record straight.\n&gt; &gt;\n&gt; &gt; - Mike (UFO Geek)\n&gt;"}