{"id": "12860", "subject": "Re: Book for sale on how to modify the 12-469, why?", "author": "ourobouros2k2", "timestamp": "2008-11-21T13:32:51Z", "full_text": "Ole&#39; &quot;Dr&quot; Dave, lol hadn&#39;t heard from him in a long while. He does\nhave longevity in the field, but his tendency to boast about his\nsupposed accolades and merits regarding the authenticity of his orb\nphotos, coupled with his self-glorifying tendency to proclaim himself\nthe king of all paranormal investigation has pretty much relegated him\nto eventual obscurity. Back in the early days (1999 I think) I\nsubmitted my flegling group&#39;s website to IGHS associate member\nprogram, yet Mr. Oester declined saying that my website containing a\nblack background was too hard on his eyes and no one would take my\nsite seriously for the same reason. \n\nEnter the popularity of TAPS and the highly visible &quot;war of blogs&quot;\nthat followed regarding their credibility in his eyes and folks were\nwitness to Oester&#39;s online self-destruction. He still pops up from\ntime to time and despite my efforts still sends me his newsletter\ntelling me where and when IGHS RV is going to be et cetera. I hate to\nsee that he is charging for the information regarding the freely\navailable shack hack, no doubt an attempt on his part to reinvent\nhimself and seek legitimacy in the field. This doesn&#39;t surprise me,\nhowever, seeing as how in the past he would charge for special\nmembership to areas of his website where he showcased FREELY submitted\nphotos and evp from folks across the country. \n\nAndy\n\n--- In EVP-ITC@yahoogroups.com, &quot;M.A. Coletta (Mike)&quot;\n&lt;michaelcoletta@...&gt; wrote:\n&gt;\n&gt; It was brought to my attention that a guy named Dave Oester is selling \n&gt; an ebook on how to modify the Radio Shack 12-469, something he calls \n&gt; the &#39;Digcom&#39;. (Isn&#39;t it just the Radio Shack Hack?)\n&gt; Has anyone purchased this book? Has anyone had dealings with this Dave \n&gt; Oester?  I guess he produces other types of ebooks too.\n&gt; \n&gt; There is so much FREE information out there on how to modify the 12-\n&gt; 469, I wonder if his book is actually selling...\n&gt; \n&gt; Thanks,\n&gt; - Mike C. (UFO Geek)\n&gt;"}