{"id": "12871", "subject": "Bruce H. and Mike C. and everyone else", "author": "Misty", "timestamp": "2008-11-21T17:55:26Z", "full_text": "&gt;&gt;The following person would like to join the EVP-ITC group:\nEmail address: balllan94 &lt;balllan94@...&gt;\n\nMisty,\nI would like to be allowed to respond to mike colletta in a professional\nand civil manner\nI promise a well worded and truthful rebuttal.\nBruce &lt;&lt;\n\nBruce,\n\nI almost decided to let you do that but then I thought about it. I also \nremembered past issues. It&#39;s fine if you want to respond. In fact I \nthink I have no right to deny you to do that. However I do have a right \nto keep you guys from duking it out HERE in this forum. It has been \ndisrupted enough with the petty arguments. So find another place to \nhave your word wars because most of the members here are NOT involved \nand should not be subjected to such displays of ego.\n\nI&#39;m sorry but I have to deny your request for membership again. \nNormally I would email this to you personally but I want everyone here \nto know that this type of behavior is no longer tolerated. I just do \nnot have time to be referee to peoples personal squabbles. So if you \nare here to research and learn then no problem. That is what this forum \nis for. If you are here just to be a negative influence then please \ntake it somewhere else. This forum is not a battle ground. \n________________\nMike, \n\nI understand why the conflict made you want to post here but again this \nis not the place for it. As I stated before most of the members here \nare not involved in this conflict and shouldnt have to be subjected to \ntwo grown men duking it out over something that they had no part in or \neven knew about. Most are here to learn and share and move forward. \n________________\nEveryone Else,\nUp til now this has been a free posting forum and nobody has been \nmoderated. However that could change so please rethink your actions \nbefore posting here. \n\nSo post it on your websites, start your own forums with your own rules \nthat allow someone to be &quot;victorious&quot;. I see no victory in this for \neither side and having said that I wish you all well in your research. \n\nMisty"}