{"id": "12875", "subject": "Re: [EVP-ITC] Bruce H. and Mike C. and everyone else", "author": "Ron Lederer", "timestamp": "2008-11-22T02:45:37Z", "full_text": "--0-508010183-1227321937=:97921\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nYou got it right Misty.=A0 I respect both men for the positive stuff they b=\r\nring to=A0EVP ITC-RTSC technology.=A0 I would not miss it a second if this =\r\ntype of issue between them were handled privately and I were to never know =\r\nabout it.=A0 Let&#39;s keep the focus on the future and what can be done.=A0 Mi=\r\nke&#39;s got that part right.=A0 Ron l\n\n--- On Fri, 11/21/08, Misty &lt;bulletbabe=\r\na@...&gt; wrote:\n\nFrom: Misty &lt;bulletbabea@...&gt;\nSubject: [EVP-ITC]=\r\n Bruce H. and Mike C. and everyone else\nTo: EVP-ITC@yahoogroups.com\nDate: F=\r\nriday, November 21, 2008, 9:55 AM\n\n\n\n\n\n\n&gt;&gt;The following person would like t=\r\no join the EVP-ITC group:\nEmail address: balllan94 &lt;balllan94@yahoo. com&gt;\n\n=\r\nMisty,\nI would like to be allowed to respond to mike colletta in a professi=\r\nonal\nand civil manner\nI promise a well worded and truthful rebuttal.\nBruce =\r\n&lt;&lt;\n\nBruce,\n\nI almost decided to let you do that but then I thought about it=\r\n. I also \nremembered past issues. It&#39;s fine if you want to respond. In fact=\r\n I \nthink I have no right to deny you to do that. However I do have a right=\r\n \nto keep you guys from duking it out HERE in this forum. It has been \ndisr=\r\nupted enough with the petty arguments. So find another place to \nhave your =\r\nword wars because most of the members here are NOT involved \nand should not=\r\n be subjected to such displays of ego.\n\nI&#39;m sorry but I have to deny your r=\r\nequest for membership again. \nNormally I would email this to you personally=\r\n but I want everyone here \nto know that this type of behavior is no longer =\r\ntolerated. I just do \nnot have time to be referee to peoples personal squab=\r\nbles. So if you \nare here to research and learn then no problem. That is wh=\r\nat this forum \nis for. If you are here just to be a negative influence then=\r\n please \ntake it somewhere else. This forum is not a battle ground. \n______=\r\n______ ____\nMike, \n\nI understand why the conflict made you want to post her=\r\ne but again this \nis not the place for it. As I stated before most of the m=\r\nembers here \nare not involved in this conflict and shouldnt have to be subj=\r\nected to \ntwo grown men duking it out over something that they had no part =\r\nin or \neven knew about. Most are here to learn and share and move forward. =\r\n\n____________ ____\nEveryone Else,\nUp til now this has been a free posting f=\r\norum and nobody has been \nmoderated. However that could change so please re=\r\nthink your actions \nbefore posting here. \n\nSo post it on your websites, sta=\r\nrt your own forums with your own rules \nthat allow someone to be &quot;victoriou=\r\ns&quot; . I see no victory in this for \neither side and having said that I wish =\r\nyou all well in your research. \n\nMisty\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n      \r\n--0-508010183-1227321937=:97921\r\nContent-Type: text/html; charset=us-ascii\r\n\r\n&lt;table cellspacing=&quot;0&quot; cellpadding=&quot;0&quot; border=&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=&quot;top&quot; style=&quot;font: inherit;&quot;&gt;You got it right Misty.&nbsp; I respect both men for the positive stuff they bring to&nbsp;EVP ITC-RTSC technology.&nbsp; I would not miss it a second if this type of issue between them were handled privately and I were to never know about it.&nbsp; Let&#39;s keep the focus on the future and what can be done.&nbsp; Mike&#39;s got that part right.&nbsp; Ron l&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Fri, 11/21/08, Misty &lt;I&gt;&lt;bulletbabea@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: rgb(16,16,255) 2px solid&quot;&gt;From: Misty &lt;bulletbabea@...&gt;&lt;BR&gt;Subject: [EVP-ITC] Bruce H. and Mike C. and everyone else&lt;BR&gt;To: EVP-ITC@yahoogroups.com&lt;BR&gt;Date: Friday, November 21, 2008, 9:55 AM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=yiv1720525804&gt;\n&lt;DIV id=ygrp-text&gt;\n&lt;DIV&gt;&gt;&gt;The following person would like to join the EVP-ITC group:&lt;BR&gt;Email address: balllan94 &lt;&lt;A href=&quot;mailto:balllan94%40yahoo.com&quot; target=_blank rel=nofollow&gt;balllan94@yahoo. com&lt;/A&gt;&gt;&lt;BR&gt;&lt;BR&gt;Misty,&lt;BR&gt;I would like to be allowed to respond to mike colletta in a professional&lt;BR&gt;and civil manner&lt;BR&gt;I promise a well worded and truthful rebuttal.&lt;BR&gt;Bruce &lt;&lt;&lt;BR&gt;&lt;BR&gt;Bruce,&lt;BR&gt;&lt;BR&gt;I almost decided to let you do that but then I thought about it. I also &lt;BR&gt;remembered past issues. It&#39;s fine if you want to respond. In fact I &lt;BR&gt;think I have no right to deny you to do that. However I do have a right &lt;BR&gt;to keep you guys from duking it out HERE in this forum. It has been &lt;BR&gt;disrupted enough with the petty arguments. So find another place to &lt;BR&gt;have your word wars because most of the members here are NOT involved &lt;BR&gt;and should not be subjected to such displays of ego.&lt;BR&gt;&lt;BR&gt;I&#39;m sorry but I have to deny your request for membership again.\n &lt;BR&gt;Normally I would email this to you personally but I want everyone here &lt;BR&gt;to know that this type of behavior is no longer tolerated. I just do &lt;BR&gt;not have time to be referee to peoples personal squabbles. So if you &lt;BR&gt;are here to research and learn then no problem. That is what this forum &lt;BR&gt;is for. If you are here just to be a negative influence then please &lt;BR&gt;take it somewhere else. This forum is not a battle ground. &lt;BR&gt;____________ ____&lt;BR&gt;Mike, &lt;BR&gt;&lt;BR&gt;I understand why the conflict made you want to post here but again this &lt;BR&gt;is not the place for it. As I stated before most of the members here &lt;BR&gt;are not involved in this conflict and shouldnt have to be subjected to &lt;BR&gt;two grown men duking it out over something that they had no part in or &lt;BR&gt;even knew about. Most are here to learn and share and move forward. &lt;BR&gt;____________ ____&lt;BR&gt;Everyone Else,&lt;BR&gt;Up til now this has been a free posting forum and nobody has been &lt;BR&gt;moderated.\n However that could change so please rethink your actions &lt;BR&gt;before posting here. &lt;BR&gt;&lt;BR&gt;So post it on your websites, start your own forums with your own rules &lt;BR&gt;that allow someone to be &quot;victorious&quot; . I see no victory in this for &lt;BR&gt;either side and having said that I wish you all well in your research. &lt;BR&gt;&lt;BR&gt;Misty&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n      \r\n--0-508010183-1227321937=:97921--"}