{"id": "12873", "subject": "Re: Bruce H. and Mike C. and everyone else", "author": "M.A. Coletta (Mike)", "timestamp": "2008-11-21T20:13:55Z", "full_text": "Thanks, Misty.  I hear you loud and clear...\n\nI&#39;m just finishing up on another little research device I&#39;ll be \nsharing with the group before the day&#39;s out.\nIt&#39;s similar to my last diode thing, just a slight bit different.\nI hope it works...\n\n- Mike C. (UFO Geek)\n\n--- In EVP-ITC@yahoogroups.com, &quot;Misty&quot; &lt;bulletbabea@...&gt; wrote:\n&gt;\n&gt; &gt;&gt;The following person would like to join the EVP-ITC group:\n&gt; Email address: balllan94 &lt;balllan94@...&gt;\n&gt; \n&gt; Misty,\n&gt; I would like to be allowed to respond to mike colletta in a \nprofessional\n&gt; and civil manner\n&gt; I promise a well worded and truthful rebuttal.\n&gt; Bruce &lt;&lt;\n&gt; \n&gt; Bruce,\n&gt; \n&gt; I almost decided to let you do that but then I thought about it. I \nalso \n&gt; remembered past issues. It&#39;s fine if you want to respond. In fact I \n&gt; think I have no right to deny you to do that. However I do have a \nright \n&gt; to keep you guys from duking it out HERE in this forum. It has been \n&gt; disrupted enough with the petty arguments. So find another place to \n&gt; have your word wars because most of the members here are NOT \ninvolved \n&gt; and should not be subjected to such displays of ego.\n&gt; \n&gt; I&#39;m sorry but I have to deny your request for membership again. \n&gt; Normally I would email this to you personally but I want everyone \nhere \n&gt; to know that this type of behavior is no longer tolerated. I just \ndo \n&gt; not have time to be referee to peoples personal squabbles. So if \nyou \n&gt; are here to research and learn then no problem. That is what this \nforum \n&gt; is for. If you are here just to be a negative influence then please \n&gt; take it somewhere else. This forum is not a battle ground. \n&gt; ________________\n&gt; Mike, \n&gt; \n&gt; I understand why the conflict made you want to post here but again \nthis \n&gt; is not the place for it. As I stated before most of the members \nhere \n&gt; are not involved in this conflict and shouldnt have to be subjected \nto \n&gt; two grown men duking it out over something that they had no part in \nor \n&gt; even knew about. Most are here to learn and share and move forward. \n&gt; ________________\n&gt; Everyone Else,\n&gt; Up til now this has been a free posting forum and nobody has been \n&gt; moderated. However that could change so please rethink your actions \n&gt; before posting here. \n&gt; \n&gt; So post it on your websites, start your own forums with your own \nrules \n&gt; that allow someone to be &quot;victorious&quot;. I see no victory in this for \n&gt; either side and having said that I wish you all well in your \nresearch. \n&gt; \n&gt; Misty\n&gt;"}