{"id": "12878", "subject": "Do I live only 3 minutes from where EVPs were first discovered?", "author": "M.A. Coletta (Mike)", "timestamp": "2008-11-22T14:52:44Z", "full_text": "--9-3477467361-9967252728=:9\r\nContent-Type: text/plain; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n\nGreetings fellow researchers,\n\nWhile listening to the Coast to Coast AM ra=\r\ndio show last night I heard\nsomething that was very interesting and surpris=\r\ning. The guest during the\nhours I listened was Tim Swartz, and he was talki=\r\nng about the &#39;lost\njournals&#39; of Nikola Tesla.\nDuring the conversation Swart=\r\nz mentioned that Tesla, while living in\nColorado Springs, had radio recepti=\r\non equipment on which he received\nsignals he did not believe were terrestri=\r\nal. Some of those signals even\ncontained speech, in english. Tim Swartz mad=\r\ne a comment during the show\nthat associated Nikola Tesla with EVPs. Awesome=\r\n!\n\nNow... we all have heard that that Thomas Edison was the guy who was\ntho=\r\nught to have been the one with an association with what may have been\nEVPs =\r\nand an actual device for contacting them, but could it be that\nNikola Tesla=\r\n is the guy who really should be given the credit for that?\nDo these &#39;lost =\r\njournals&#39;, now found, have details or data which provide\ndocumented proof t=\r\nhat Tesla may have been communicating... or at least\nlistening to communica=\r\ntion from beyond.\n\nIf it wasn&#39;t terrestrial in his opinion, I would imagine=\r\n he considered\nthem to be extra terrestrial or possibly inner terrestrial.\n=\r\n\nWhat is really cool from my vantage point... I live only three minutes\nfro=\r\nm where Nikola Tesla would have done those experiments and made that\ncommun=\r\nication contact. His lab was located on a hill within a 3 minute\ndrive; a p=\r\nlace I have visited numerous times and attempted to capture\nEVP at.\n\nIt was=\r\n when I first started my interest/investigation in EVP that I went\nto where=\r\n the Tesla lab was, and using a simple device I constructed,\ntried my luck =\r\nat EVP capture.\nNow that I have a number of other devices to use, and now t=\r\nhat I know\nthat Tesla may have been the pioneer in EVP discovery, I will pr=\r\nobably\ngo back there with my devices and make some additional attempts.   C=\r\nool\nstuff...!!!\nHere&#39;s a short excerpt from the Swartz book regarding Tesla=\r\n and the\nEVPs:\n\nChapter 5 - Tesla and Electronic Voice Phenomena\n\nNo one ca=\r\nn deny that computers and electronics have forever changed our\nway of life.=\r\n There are electronic controls and computer chips in\neverything from the sm=\r\nall appliances that toast our bread to the cars we\ndrive, and make possible=\r\n myriad forms of new entertainment, from VCRs\nand DVDs to video games and t=\r\nalking stuffed toys.\n\nFor a number of years some people have claimed that e=\r\nlectronics can be\nuseful in a quite unexpected way: to contact the dead, or=\r\n at least allow\nthe dead to contact us. Obviously, these claims are highly\n=\r\ncontroversial. They make many assumptions: that there is life after\ndeath, =\r\nthat the dead are interested in contacting us, and that they have\nthe means=\r\n by which to do so.\n\nThe mysterious signals that Tesla received could be li=\r\nnked to what is\nnow known as Electronic Voice Phenomena (EVP). Tesla was on=\r\ne of the\nfirst men to experiment with the necessary electronic receiving\neq=\r\nuipment. The very same equipment, albeit more sophisticated than Tesla\nhad =\r\naccess to, is being used today to receive EVP.\n\nMany people experimenting w=\r\nith Electronic Voice Phenomena (EVP) and\nInstrumental Transcommunication (I=\r\nTC) say they have received messages\nfrom &quot;the other side&quot; through radios, t=\r\nape recorders, VCRs, televisions,\ntelephones, and even computers.\n\nThese ph=\r\nenomena have manifest themselves since the appearance of the\ninstruments th=\r\nemselves. EVP, for example, has been reported for well\nover 50 years or mor=\r\ne: Strange voices being picked up with primitive\nradios during WWI and hear=\r\nd faintly on magnetic recording tape.\n\nTesla may have been the first to rec=\r\neive these electronic voices from\nanother plane of reality. As with other m=\r\nodes of communications with\nalleged discarnate entities, care must be taken=\r\n not to be swayed by the\nstories often told by beings from the other side. =\r\nTesla may have been\nduped, so-to-speak, by voices that only pretended to be=\r\n creatures from\nother planets.\n\nThis is nothing new to those who are famili=\r\nar with the tall tales told\nto them by spirits who claim to be ascended mas=\r\nters, Abraham Lincoln or\nAshtar of the Interplanetary Space Command. Spirit=\r\ns love to tell lies to\nanyone who will listen.\n\nThose such as Tesla and Mar=\r\nconi who experimented with radio early on\nwere the first to report anomalou=\r\ns sounds and voices emanating from\ntheir radio receivers. These early repor=\r\nts were looked upon as mildly\ninteresting curiosities and quickly forgotten=\r\n.\n\nTheosophist Alice Bailey in 1936, transcribed these words of her great\nt=\r\neacher, the Tibetan Master DK:\n\n&quot;Within the next few years the fact of the =\r\neternity of existence will\nhave advanced from the realm of questioning into=\r\n the realm of certainty.\nThrough the use of the radio by those who have pas=\r\nsed over, will\ncommunication be set up and reduced to a true science.&quot;\n\nIt =\r\nhas been widely written that Edison and his assistant, Dr. Miller\nHutchinso=\r\nn, were seriously at work building a machine to achieve spirit\ncommunicatio=\r\nn. Tesla wrote in his journals that Thomas Edison had heard\nfrom other engi=\r\nneers that Tesla had been receiving mysterious voices and\nsounds over radio=\r\n frequencies that were not conducive for the\nbroadcasting of the human voic=\r\ne.\n\nEdison, who publicly mocked Tesla and his experiments, privately\nbeliev=\r\ned that Tesla had managed to find the correct frequency to enable\ncommunica=\r\ntion with spirits of the dead. Edison was determined to\ndiscover Tesla&#39;s se=\r\ncret, and be the first to get the &quot;Spirit Phone&quot; on\nthe market.\n\n- Mike (UF=\r\nO Geek)  UFOGEEK.COM &lt;http://www.ufogeek.com/&gt;\n\n\r\n--9-3477467361-9967252728=:9\r\nContent-Type: text/html; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;P&gt;Greetings fellow researchers,&lt;/P&gt;\n&lt;P&gt;While listening to the Coast to Coa=\r\nst AM radio show last night I heard something that was very interesting and=\r\n surprising. The guest during the hours I listened was Tim Swartz, and he w=\r\nas talking about the &#39;lost journals&#39; of Nikola Tesla. &lt;BR&gt;During the conver=\r\nsation Swartz mentioned that Tesla, while living in Colorado Springs, had r=\r\nadio reception equipment on which he received signals he did not believe we=\r\nre terrestrial. Some of those signals even contained speech, in english. Ti=\r\nm Swartz made a comment during the show that associated Nikola Tesla with E=\r\nVPs. Awesome! &lt;/P&gt;\n&lt;P&gt;Now... we all have heard that that Thomas Edison was =\r\nthe guy who was thought to have been the one with an association with what =\r\nmay have been EVPs and an actual device for contacting them, but could it b=\r\ne that Nikola Tesla is the guy who really should be given the credit for th=\r\nat? &lt;BR&gt;Do these &#39;lost journals&#39;, now found, have details or data which pro=\r\nvide documented proof that Tesla may have been communicating... or at least=\r\n listening to communication from beyond. &lt;/P&gt;\n&lt;P&gt;If it wasn&#39;t terrestrial i=\r\nn his opinion, I would imagine he considered them to be extra terrestrial o=\r\nr possibly inner terrestrial. &lt;/P&gt;\n&lt;P&gt;What is really cool from my vantage p=\r\noint... I live only three minutes from where Nikola Tesla would have done t=\r\nhose experiments and made that communication contact. His lab was located o=\r\nn a hill within a 3 minute drive; a place I have visited numerous times and=\r\n attempted to capture EVP at. &lt;/P&gt;\n&lt;P&gt;It was when I first started my intere=\r\nst/investigation in EVP that I went to where the Tesla lab was, and using a=\r\n simple device I constructed, tried my luck at EVP capture. &lt;BR&gt;Now that I =\r\nhave a number of other devices to use, and now that I know that Tesla may h=\r\nave been the pioneer in EVP discovery, I will probably go back there with m=\r\ny devices and make some additional attempts.&nbsp;&nbsp; Cool stuff...!!! &lt;=\r\nBR&gt;Here&#39;s a short excerpt from the Swartz book regarding Tesla and the EVPs=\r\n: &lt;/P&gt;\n&lt;P&gt;&lt;EM&gt;Chapter 5 - Tesla and Electronic Voice Phenomena &lt;/EM&gt;&lt;/P&gt;\n&lt;P=\r\n&gt;&lt;EM&gt;No one can deny that computers and electronics have forever changed ou=\r\nr way of life. There are electronic controls and computer chips in everythi=\r\nng from the small appliances that toast our bread to the cars we drive, and=\r\n make possible myriad forms of new entertainment, from VCRs and DVDs to vid=\r\neo games and talking stuffed toys. &lt;/EM&gt;&lt;/P&gt;\n&lt;P&gt;&lt;EM&gt;For a number of years s=\r\nome people have claimed that electronics can be useful in a quite unexpecte=\r\nd way: to contact the dead, or at least allow the dead to contact us. Obvio=\r\nusly, these claims are highly controversial. They make many assumptions: th=\r\nat there is life after death, that the dead are interested in contacting us=\r\n, and that they have the means by which to do so. &lt;/EM&gt;&lt;/P&gt;\n&lt;P&gt;&lt;EM&gt;The myst=\r\nerious signals that Tesla received could be linked to what is now known as =\r\nElectronic Voice Phenomena (EVP). Tesla was one of the first men to experim=\r\nent with the necessary electronic receiving equipment. The very same equipm=\r\nent, albeit more sophisticated than Tesla had access to, is being used toda=\r\ny to receive EVP. &lt;/EM&gt;&lt;/P&gt;\n&lt;P&gt;&lt;EM&gt;Many people experimenting with Electroni=\r\nc Voice Phenomena (EVP) and Instrumental Transcommunication (ITC) say they =\r\nhave received messages from &quot;the other side&quot; through radios, tape recorders=\r\n, VCRs, televisions, telephones, and even computers. &lt;/EM&gt;&lt;/P&gt;\n&lt;P&gt;&lt;EM&gt;These=\r\n phenomena have manifest themselves since the appearance of the instruments=\r\n themselves. EVP, for example, has been reported for well over 50 years or =\r\nmore: Strange voices being picked up with primitive radios during WWI and h=\r\neard faintly on magnetic recording tape. &lt;/EM&gt;&lt;/P&gt;\n&lt;P&gt;&lt;EM&gt;Tesla may have be=\r\nen the first to receive these electronic voices from another plane of reali=\r\nty. As with other modes of communications with alleged discarnate entities,=\r\n care must be taken not to be swayed by the stories often told by beings fr=\r\nom the other side. Tesla may have been duped, so-to-speak, by voices that o=\r\nnly pretended to be creatures from other planets. &lt;/EM&gt;&lt;/P&gt;\n&lt;P&gt;&lt;EM&gt;This is =\r\nnothing new to those who are familiar with the tall tales told to them by s=\r\npirits who claim to be ascended masters, Abraham Lincoln or Ashtar of the I=\r\nnterplanetary Space Command. Spirits love to tell lies to anyone who will l=\r\nisten. &lt;/EM&gt;&lt;/P&gt;\n&lt;P&gt;&lt;EM&gt;Those such as Tesla and Marconi who experimented wi=\r\nth radio early on were the first to report anomalous sounds and voices eman=\r\nating from their radio receivers. These early reports were looked upon as m=\r\nildly interesting curiosities and quickly forgotten. &lt;/EM&gt;&lt;/P&gt;\n&lt;P&gt;&lt;EM&gt;Theos=\r\nophist Alice Bailey in 1936, transcribed these words of her great teacher, =\r\nthe Tibetan Master DK: &lt;/EM&gt;&lt;/P&gt;\n&lt;P&gt;&lt;EM&gt;&quot;Within the next few years the fact=\r\n of the eternity of existence will have advanced from the realm of question=\r\ning into the realm of certainty. Through the use of the radio by those who =\r\nhave passed over, will communication be set up and reduced to a true scienc=\r\ne.&quot; &lt;/EM&gt;&lt;/P&gt;\n&lt;P&gt;&lt;EM&gt;It has been widely written that Edison and his assista=\r\nnt, Dr. Miller Hutchinson, were seriously at work building a machine to ach=\r\nieve spirit communication. Tesla wrote in his journals that Thomas Edison h=\r\nad heard from other engineers that Tesla had been receiving mysterious voic=\r\nes and sounds over radio frequencies that were not conducive for the broadc=\r\nasting of the human voice. &lt;/EM&gt;&lt;/P&gt;\n&lt;P&gt;&lt;EM&gt;Edison, who publicly mocked Tes=\r\nla and his experiments, privately believed that Tesla had managed to find t=\r\nhe correct frequency to enable communication with spirits of the dead. Edis=\r\non was determined to discover Tesla&#39;s secret, and be the first to get the &quot;=\r\nSpirit Phone&quot; on the market. &lt;/EM&gt;&lt;/P&gt;\n&lt;P&gt;- Mike (UFO Geek)&nbsp; &lt;A href=\r\n=3D&quot;http://www.ufogeek.com/&quot;&gt;UFOGEEK.COM&lt;/A&gt;&nbsp;&lt;/P&gt;\n\r\n--9-3477467361-9967252728=:9--"}