{"id": "12883", "subject": "Re: [EVP-ITC] Do I live only 3 minutes from where EVPs were first discovered?", "author": "Misty Dawn", "timestamp": "2008-11-22T18:29:52Z", "full_text": "Good post I like the theory that both men had some involvement with the spirit world. I had heard some time back that Edisons comments were meant as a joke to a reporter, mocking Tesla for statements he had made about disincarnate voices. So many rumors floating around about those two its sad that they didnt get along better. I can only imagine what they would have accomplished as a team rather than bitter rivals.\n\nYou should definitely return and try again, perhaps some of the old energy still lingers there. \n\nMisty\n\n\n--- On Sat, 11/22/08, M.A. Coletta (Mike) &lt;michaelcoletta@...&gt; wrote:\n\n&gt; From: M.A. Coletta (Mike) &lt;michaelcoletta@...&gt;\n&gt; Subject: [EVP-ITC] Do I live only 3 minutes from where EVPs were first discovered?\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Saturday, November 22, 2008, 9:52 AM\n&gt; Greetings fellow researchers,\n&gt; \n&gt; While listening to the Coast to Coast AM radio show last\n&gt; night I heard\n&gt; something that was very interesting and surprising. The\n&gt; guest during the\n&gt; hours I listened was Tim Swartz, and he was talking about\n&gt; the &#39;lost\n&gt; journals&#39; of Nikola Tesla.\n&gt; During the conversation Swartz mentioned that Tesla, while\n&gt; living in\n&gt; Colorado Springs, had radio reception equipment on which he\n&gt; received\n&gt; signals he did not believe were terrestrial. Some of those\n&gt; signals even\n&gt; contained speech, in english. Tim Swartz made a comment\n&gt; during the show\n&gt; that associated Nikola Tesla with EVPs. Awesome!\n&gt; \n&gt; Now... we all have heard that that Thomas Edison was the\n&gt; guy who was\n&gt; thought to have been the one with an association with what\n&gt; may have been\n&gt; EVPs and an actual device for contacting them, but could it\n&gt; be that\n&gt; Nikola Tesla is the guy who really should be given the\n&gt; credit for that?\n&gt; Do these &#39;lost journals&#39;, now found, have details\n&gt; or data which provide\n&gt; documented proof that Tesla may have been communicating...\n&gt; or at least\n&gt; listening to communication from beyond.\n&gt; \n&gt; If it wasn&#39;t terrestrial in his opinion, I would\n&gt; imagine he considered\n&gt; them to be extra terrestrial or possibly inner terrestrial.\n&gt; \n&gt; What is really cool from my vantage point... I live only\n&gt; three minutes\n&gt; from where Nikola Tesla would have done those experiments\n&gt; and made that\n&gt; communication contact. His lab was located on a hill within\n&gt; a 3 minute\n&gt; drive; a place I have visited numerous times and attempted\n&gt; to capture\n&gt; EVP at.\n&gt; \n&gt; It was when I first started my interest/investigation in\n&gt; EVP that I went\n&gt; to where the Tesla lab was, and using a simple device I\n&gt; constructed,\n&gt; tried my luck at EVP capture.\n&gt; Now that I have a number of other devices to use, and now\n&gt; that I know\n&gt; that Tesla may have been the pioneer in EVP discovery, I\n&gt; will probably\n&gt; go back there with my devices and make some additional\n&gt; attempts.   Cool\n&gt; stuff...!!!\n&gt; Here&#39;s a short excerpt from the Swartz book regarding\n&gt; Tesla and the\n&gt; EVPs:\n&gt; \n&gt; Chapter 5 - Tesla and Electronic Voice Phenomena\n&gt; \n&gt; No one can deny that computers and electronics have forever\n&gt; changed our\n&gt; way of life. There are electronic controls and computer\n&gt; chips in\n&gt; everything from the small appliances that toast our bread\n&gt; to the cars we\n&gt; drive, and make possible myriad forms of new entertainment,\n&gt; from VCRs\n&gt; and DVDs to video games and talking stuffed toys.\n&gt; \n&gt; For a number of years some people have claimed that\n&gt; electronics can be\n&gt; useful in a quite unexpected way: to contact the dead, or\n&gt; at least allow\n&gt; the dead to contact us. Obviously, these claims are highly\n&gt; controversial. They make many assumptions: that there is\n&gt; life after\n&gt; death, that the dead are interested in contacting us, and\n&gt; that they have\n&gt; the means by which to do so.\n&gt; \n&gt; The mysterious signals that Tesla received could be linked\n&gt; to what is\n&gt; now known as Electronic Voice Phenomena (EVP). Tesla was\n&gt; one of the\n&gt; first men to experiment with the necessary electronic\n&gt; receiving\n&gt; equipment. The very same equipment, albeit more\n&gt; sophisticated than Tesla\n&gt; had access to, is being used today to receive EVP.\n&gt; \n&gt; Many people experimenting with Electronic Voice Phenomena\n&gt; (EVP) and\n&gt; Instrumental Transcommunication (ITC) say they have\n&gt; received messages\n&gt; from &quot;the other side&quot; through radios, tape\n&gt; recorders, VCRs, televisions,\n&gt; telephones, and even computers.\n&gt; \n&gt; These phenomena have manifest themselves since the\n&gt; appearance of the\n&gt; instruments themselves. EVP, for example, has been reported\n&gt; for well\n&gt; over 50 years or more: Strange voices being picked up with\n&gt; primitive\n&gt; radios during WWI and heard faintly on magnetic recording\n&gt; tape.\n&gt; \n&gt; Tesla may have been the first to receive these electronic\n&gt; voices from\n&gt; another plane of reality. As with other modes of\n&gt; communications with\n&gt; alleged discarnate entities, care must be taken not to be\n&gt; swayed by the\n&gt; stories often told by beings from the other side. Tesla may\n&gt; have been\n&gt; duped, so-to-speak, by voices that only pretended to be\n&gt; creatures from\n&gt; other planets.\n&gt; \n&gt; This is nothing new to those who are familiar with the tall\n&gt; tales told\n&gt; to them by spirits who claim to be ascended masters,\n&gt; Abraham Lincoln or\n&gt; Ashtar of the Interplanetary Space Command. Spirits love to\n&gt; tell lies to\n&gt; anyone who will listen.\n&gt; \n&gt; Those such as Tesla and Marconi who experimented with radio\n&gt; early on\n&gt; were the first to report anomalous sounds and voices\n&gt; emanating from\n&gt; their radio receivers. These early reports were looked upon\n&gt; as mildly\n&gt; interesting curiosities and quickly forgotten.\n&gt; \n&gt; Theosophist Alice Bailey in 1936, transcribed these words\n&gt; of her great\n&gt; teacher, the Tibetan Master DK:\n&gt; \n&gt; &quot;Within the next few years the fact of the eternity of\n&gt; existence will\n&gt; have advanced from the realm of questioning into the realm\n&gt; of certainty.\n&gt; Through the use of the radio by those who have passed over,\n&gt; will\n&gt; communication be set up and reduced to a true\n&gt; science.&quot;\n&gt; \n&gt; It has been widely written that Edison and his assistant,\n&gt; Dr. Miller\n&gt; Hutchinson, were seriously at work building a machine to\n&gt; achieve spirit\n&gt; communication. Tesla wrote in his journals that Thomas\n&gt; Edison had heard\n&gt; from other engineers that Tesla had been receiving\n&gt; mysterious voices and\n&gt; sounds over radio frequencies that were not conducive for\n&gt; the\n&gt; broadcasting of the human voice.\n&gt; \n&gt; Edison, who publicly mocked Tesla and his experiments,\n&gt; privately\n&gt; believed that Tesla had managed to find the correct\n&gt; frequency to enable\n&gt; communication with spirits of the dead. Edison was\n&gt; determined to\n&gt; discover Tesla&#39;s secret, and be the first to get the\n&gt; &quot;Spirit Phone&quot; on\n&gt; the market.\n&gt; \n&gt; - Mike (UFO Geek)  UFOGEEK.COM\n&gt; &lt;http://www.ufogeek.com/&gt;"}