{"id": "12913", "subject": "Re: Raudive Diode Device #3", "author": "M.A. Coletta (Mike)", "timestamp": "2008-11-25T23:04:55Z", "full_text": "Hi Ron,\n\nFrom the book, &quot;Voices from the Tapes&quot;:\n&#39; May it suffice to say that the experiments made with a diode were \nprobably the best. Dr. Raudive&#39;s diode which we had carefully \nexamined and then had a replica built for the actual experiments, is \nbasically a piece of germanium with some metal on it. It will conduct \nelecetricity one way and not the other. It is no more thatn what was \nknown as the &quot;cat&#39;s whisker&quot; in the crystal sets of early radio days. \nIt acts in a similar way to a radio, but is not as sensative.&#39;\n\nIt appears he received some good audio type signals using his Raudive \nDiode and his tape recorders, as the book illustrated throughout.\n\n- Mike\n\n--- In EVP-ITC@yahoogroups.com, Ron Lederer &lt;ronriko@...&gt; wrote:\n&gt;\n&gt; Hey Mike, I&#39;m getting lost in your geekiness here. lol Can you \ntell me what I can do with this Raudive diode stuff. And, does this \nhave anything to do with the light show. Ron\n&gt; \n&gt; --- On Mon, 11/24/08, M.A. Coletta (Mike) &lt;michaelcoletta@...&gt; \nwrote:\n&gt; \n&gt; From: M.A. Coletta (Mike) &lt;michaelcoletta@...&gt;\n&gt; Subject: [EVP-ITC] Raudive Diode Device #3\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Monday, November 24, 2008, 7:51 PM\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Greetings fellow researchers,\n&gt; I built another Raudive Diode Device ( #3) this evening. This one \ncan be used in two configurations.\n&gt; 1) With the plug connected directly into the diode device and then \ninto the recording device.\n&gt; 2) The plug connected to a cable and that cable connected to the \ndiode device. The cable provides some isolation between the diode \ndevice and the recording device.\n&gt; I haven&#39;t tested it yet... that will be done tomorrow or the next \nday.\n&gt; You can see pictures and a schematic, here:\n&gt; http://ufomagazine. blogspot. com/2008/ 11/raudive- diode-device- \n3.html\n&gt; - Mike C. (UFO Geek)\n&gt;"}