{"id": "12927", "subject": "About: Re: [EVP-ITC]Re: insulted by the spirits", "author": "M.A. Coletta (Mike)", "timestamp": "2008-11-27T17:00:28Z", "full_text": "Bravo... Very well put, w.\nAn open mind will always lead to new discoveries...\n\nHappy Thanksgiving to all!\n\n- Mike C.\n(UFO Geek)\nMike&#39;s Little Book of Paranormal Prototypes\nhttp://www.ufogeek.com/prototypes/\n\n--- In EVP-ITC@yahoogroups.com, black bear hollow \n&lt;blackbearhollow@...&gt; wrote:\n&gt;\n&gt; Well, if we think scientifically according to physics, all \nwe &quot;see&quot;  \n&gt; with our body&#39;s eyes is a illusion... waves of light and there are \nan  \n&gt; unknown amount of dimensions coexisting with us all the time, our  \n&gt; experience - or what we perceive as &quot;experience&quot; becomes a \npowerful  \n&gt; illusion.\n&gt; \n&gt; I&#39;d probably use the term &quot;active&quot; area if forced, but are there  \n&gt; really areas and some energies are residual and not intelligent at \nall  \n&gt; - just a glitch of what we perceive as time and not intelligent.\n&gt; \n&gt; I think it&#39;s important to really keep an open mind in this \nresearch.  \n&gt; We are so confined and limited by our own energy&#39;s perception via \nour  \n&gt; experiences encased in this form of a body that we simply can&#39;t  \n&gt; stereotype our research with terms based on common Hollywood/TV \nshows  \n&gt; like Ghost Hunters or religious ideas.\n&gt; \n&gt; We know so little! We &quot;record&quot; and &quot;listen&quot;, some try to \nstereotype   \n&gt; or label energies with other&#39;s ideas of what they are hearing or  \n&gt; talking with. That&#39;s impossible at this point to prove. So I beg \nall  \n&gt; of you to keep an open mind ALWAYS.\n&gt; \n&gt; What may sound like your Aunt, Grandmother, or child, may not be \nand  \n&gt; probably isn&#39;t. It could literally be anything or anyone from \nanywhere  \n&gt; and any space in time. We simply have no clue... yet!\n&gt; \n&gt; w."}