{"id": "12950", "subject": "Re: insulted by the spirits & a qyestion regarding loved ones that h", "author": "neli neilim", "timestamp": "2008-11-30T11:14:13Z", "full_text": "--0-1478474282-1228043653=:88840\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nWisteria,\n=A0\nYears ago while in meditation I heard that voice for the firs=\r\nt time, and she yelled at me, and I could heard her foot steps very out lou=\r\nd. In that time I didn&#39;t use my cell, I have using my cell just 2 months, t=\r\no record voices or do EVP.\nI can&#39;t hear them without my cell, just in that =\r\noccasion (4 years ago) I heard that woman, that I know perfectly that was a=\r\n spirit, or at least it seemed that. (maybe I&#39;m wrong)\n=A0\nAnd about my cel=\r\nl voice insutling me, I think it was my subconscious mind that projected my=\r\n past thoughts and were caught by my cell. But just in that occasion. \n=A0\n=\r\nNormally they call my name, or I know that the message is for me, we have t=\r\no use the intuition sometimes.\n=A0\nI always prove the info that they give, =\r\nand its very accurate.\n=A0\nNeli\n\n\n      \r\n--0-1478474282-1228043653=:88840\r\nContent-Type: text/html; charset=us-ascii\r\n\r\n&lt;table cellspacing=&quot;0&quot; cellpadding=&quot;0&quot; border=&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=&quot;top&quot; style=&quot;font: inherit;&quot;&gt;&lt;DIV&gt;Wisteria,&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Years ago while in meditation I heard that voice for the first time, and she yelled at me, and I could heard her foot steps very out loud. In that time I didn&#39;t use my cell, I have using my cell just 2 months, to record voices or do EVP.&lt;/DIV&gt;\n&lt;DIV&gt;I can&#39;t hear them without my cell, just in that occasion (4 years ago) I heard that woman, that I know perfectly that was a spirit, or at least it seemed that. (maybe I&#39;m wrong)&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;And about my cell voice insutling me, I think it was my subconscious mind that projected my past thoughts and were caught by my cell. But just in that occasion. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Normally they call my name, or I know that the message is for me, we have to use the intuition sometimes.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I always prove the info that they give, and its very accurate.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Neli&lt;/DIV&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n      \r\n--0-1478474282-1228043653=:88840--"}