{"id": "12976", "subject": "Re: [EVP-ITC] Re: Share your stories for the press...?", "author": "Zack Widup", "timestamp": "2008-12-03T04:19:00Z", "full_text": "All the EVP I&#39;ve gotten seem to be from spirits who were human at one \ntime. What Frank and others have been getting on Frank&#39;s boxes or the RS \nhacks could be anybody&#39;s guess, but they appear to be communicating ideas \nwe can understand.\n\nThe most threatening thing I&#39;ve ever heard was in a site where there were \npossibly many ghosts.  Many people had died there.  One voice simply said \n&quot;Leave this building!&quot; in a stern voice.\n\nYet, at the same location, someone asked if they wanted us to leave and a \ndifferent voice said &quot;You just got here.&quot;\n\nGo figure.\n\nZack\n\n\nOn Tue, 2 Dec 2008, black bear hollow wrote:\n\n&gt; Ditto to all you said Margaret, and I&#39;ll further add that many times people\n&gt; record all sorts of voices that we would consider &quot;non-human&quot;. I&#39;m not sure \n&gt; why people\n&gt; insist on stereotyping voices. Probably the ridiculous shows on the Travel & \n&gt; Sci Fi Channels and superstitious religious\n&gt; dogma.\n&gt;\n&gt; There are many dimensions and Multiverses around us. No one can judge a voice \n&gt; based on it&#39;s sound,\n&gt; tone, or anything else. It&#39;s too bad the media can&#39;t simply report on the \n&gt; incredibly fascinating\n&gt; research we are doing without wanting creepy drama.\n&gt;\n&gt; w.\n&gt; On Dec 2, 2008, at 6:38 PM, itcdeadpeople wrote:\n&gt;\n&gt;&gt; For whom do you write? Where can we read some of your previously\n&gt;&gt; published material?? Based on your question, I&#39;m assuming you aren&#39;t\n&gt;&gt; looking to do the field of EVP/ITC or other paranormal research any\n&gt;&gt; favors. What is your intention???\n&gt;&gt; \n&gt;&gt; How about focusing on something positive? That would be a nice change\n&gt;&gt; of pace from the media. I don&#39;t think you&#39;ll find anyone here that is\n&gt;&gt; willing to help perpetuate the negative stereotypical views on our\n&gt;&gt; research or other nonsense that is a distraction from the fact that\n&gt;&gt; there are valuable EVP/ITC advances taking place.\n&gt;&gt; \n&gt;&gt; Margaret\n&gt;&gt; \n&gt;&gt; --- In EVP-ITC@yahoogroups.com, &quot;dmikolay&quot; &lt;dmikolay@...&gt; wrote:\n&gt;&gt;&gt; \n&gt;&gt;&gt; Anyone ever get an elemental, demon, or otherwise &quot;inhuman&quot; voice?\n&gt;&gt; Anyone hear from\n&gt;&gt;&gt; someone with a dire warning? Anything else otherwise weird? I am a\n&gt;&gt; journalist and would\n&gt;&gt;&gt; LOVE to interview you about it!\n&gt;&gt;&gt; \n&gt;&gt; \n&gt;&gt; \n&gt;&gt; \n&gt;"}