{"id": "12971", "subject": "Re: Share your stories for the press...?", "author": "itcdeadpeople", "timestamp": "2008-12-03T00:01:09Z", "full_text": "I agree, W!  I asked one of my communicators the other night what kind\nof being he considered himself to be.  The answer was, &quot;Ex-human.&quot;  I\ntook that to mean a person who was formally in a physical body but is\nno longer. But who knows!?! \n\nI do believe that our loved ones and other person&#39;s no longer residing\nin the physical world can come through.  I&#39;m also fascinated with the\nidea of, as you mention, multiverses (reminds me of Drake&#39;s Equation)\nand I&#39;m open to the possibility that other physical beings are somehow\ncommunicating with us.  \n\nThere&#39;s just so much that we simply do not know or understand.  What&#39;s\nthe old saying, &quot;You don&#39;t know what you don&#39;t know.&quot;  LOL.\n\nMargaret\n\n--- In EVP-ITC@yahoogroups.com, black bear hollow\n&lt;blackbearhollow@...&gt; wrote:\n&gt;\n&gt; Ditto to all you said Margaret, and I&#39;ll further add that many times  \n&gt; people\n&gt; record all sorts of voices that we would consider &quot;non-human&quot;. I&#39;m not  \n&gt; sure why people\n&gt; insist on stereotyping voices. Probably the ridiculous shows on the  \n&gt; Travel & Sci Fi Channels and superstitious religious\n&gt; dogma.\n&gt; \n&gt; There are many dimensions and Multiverses around us. No one can judge  \n&gt; a voice based on it&#39;s sound,\n&gt; tone, or anything else. It&#39;s too bad the media can&#39;t simply report on  \n&gt; the incredibly fascinating\n&gt; research we are doing without wanting creepy drama.\n&gt; \n&gt; w.\n&gt; On Dec 2, 2008, at 6:38 PM, itcdeadpeople wrote:\n&gt; \n&gt; &gt; For whom do you write? Where can we read some of your previously\n&gt; &gt; published material?? Based on your question, I&#39;m assuming you aren&#39;t\n&gt; &gt; looking to do the field of EVP/ITC or other paranormal research any\n&gt; &gt; favors. What is your intention???\n&gt; &gt;\n&gt; &gt; How about focusing on something positive? That would be a nice change\n&gt; &gt; of pace from the media. I don&#39;t think you&#39;ll find anyone here that is\n&gt; &gt; willing to help perpetuate the negative stereotypical views on our\n&gt; &gt; research or other nonsense that is a distraction from the fact that\n&gt; &gt; there are valuable EVP/ITC advances taking place.\n&gt; &gt;\n&gt; &gt; Margaret\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;dmikolay&quot; &lt;dmikolay@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; Anyone ever get an elemental, demon, or otherwise &quot;inhuman&quot; voice?\n&gt; &gt; Anyone hear from\n&gt; &gt; &gt; someone with a dire warning? Anything else otherwise weird? I am a\n&gt; &gt; journalist and would\n&gt; &gt; &gt; LOVE to interview you about it!\n&gt; &gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt;"}