{"id": "12980", "subject": "Re: [EVP-ITC] Re: Share your stories for the press...?", "author": "Zack Widup", "timestamp": "2008-12-03T15:03:16Z", "full_text": "We have ALL been around forever (or maybe even longer - time didn&#39;t always \nexist) and we have been many things besides human in that forever and \nlonger. And we have at least the other half of forever to look forward to. \nWe will be many things besides human along the way.  I want one of those \nmetal bodies again! They don&#39;t die when you put them in sub-zero \ntemperatures. You don&#39;t have to feed them animals and plants every day. \nThey last a lot longer time than these pieces of meat. Etc.\n\nMaybe some day someone will develop those metal bodies of sufficient \nability and agility here on earth so we don&#39;t keep having to pick up \nanother piece of meat once we lose one.\n\n:-)\n\nSO the question would be, has this thing producing the EVP been RECENTLY \nhuman (i.e. occupied a human form)? Like within the last few lifetimes \ntime period? Perhaps it hasn&#39;t ever occupied a human physical form, but \nhere on earth that&#39;s highly unlikely. (I didn&#39;t say impossible.) A spirit \nunleashed of physical form is not human. Only a body can be human. But \nthere are many other types of physical forms than human meat bodies.\n\nZack\n\n\nOn Wed, 3 Dec 2008, black bear hollow wrote:\n\n&gt; Energies have said they have known me in past lives and forever. They have \n&gt; given details of my life, and names that no one would know. Not all of these \n&gt; energies claim to be human, so their knowledge or the fact they are \n&gt; intelligent is no proof they were human in this dimension. And it remains \n&gt; there is no proof of who or what you are talking to, hearing, or recording. \n&gt; We simply don&#39;t know.\n&gt;\n&gt; Free your mind Zack! There are millions upon millions of beings you might be \n&gt; recording. Many of which aren&#39;t honest, and see nothing wrong with telling \n&gt; you what you want to hear just to get you to talk to them. Many are just \n&gt; amazed as we are that we can hear them. :)\n&gt;\n&gt; w.\n&gt; On Dec 3, 2008, at 12:04 AM, Zack Widup wrote:\n&gt;\n&gt;&gt; This was in the former Manteno State Mental Hospital in Illinois. A few\n&gt;&gt; of them gave names. Someone who had access to the records looked up the\n&gt;&gt; names later on and they were the names of former patients who died there.\n&gt;&gt; The records gave the date and cause of death. They were NOT common names\n&gt;&gt; like &quot;John Smith&quot;.\n&gt;&gt; \n&gt;&gt; How would anyone on an EVP know the names of people long forgotten for\n&gt;&gt; over 60 years? None of us present did. It is all so fascinating ...\n&gt;&gt; \n&gt;&gt; Zack\n&gt;"}