{"id": "12996", "subject": "Re: Any insight on my life changing EVP experience?", "author": "chuck255", "timestamp": "2008-12-04T01:21:32Z", "full_text": "Thank you for the response \n\nI dont think I will ever record anything again to be honest with you \nand for the most part I havent heard much of anything since I found \nout what the real cause of things were.\n\nToo late on that, but thank you. :) We both had issues. For the most \npart you are right about mine and I won&#39;t get into hers. I openly \nadmit I have trust issues but the control ones only came into play \nhere when I felt that I couldnt control or stop what was going on at \nmy place even after I questioned them and got nothing.\n\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, black bear hollow \n&lt;blackbearhollow@...&gt; wrote:\n&gt;\n&gt; I&#39;ll add that sometimes, those who record evp, get clairaudience. \nThis  \n&gt; happened to me. What has happened to you is that you&#39;ve sensitized  \n&gt; yourself to the voices. It will take 2-6 weeks for the effects to  \n&gt; lessen, but it&#39;s VERY important for your own mental health to not  \n&gt; record anymore ever or at least for a long time.\n&gt; \n&gt; The reality is that you&#39;ve linked up with some negative energies \nthat  \n&gt; are probably really enjoying you running around and doing \neverything  \n&gt; they tell you. They&#39;re full of poo. There is no mob and they can&#39;t  \n&gt; harm you or your family unless you allow it.\n&gt; \n&gt; It sounds like the insanity of the horribly unhealthy relationship  \n&gt; with B might have attracted them, but who knows.\n&gt; \n&gt; For now, it would be best for you to walk away from recording  \n&gt; altogether, and get some professional help for those crazy trust \nand  \n&gt; control issues in the near future BEFORE you get involved in any  \n&gt; relationship again.\n&gt; \n&gt; You may hear the energies in fans, water, etc... for a few weeks \nas  \n&gt; they&#39;ll be pretty disappointed you&#39;ve disappeared. Ignore them at \nall  \n&gt; costs, and eventually this phenomenon will dissipate. Be patient.\n&gt; \n&gt; w\n&gt; On Dec 3, 2008, at 2:46 PM, chuck255 wrote:\n&gt; \n&gt; &gt; I am new to this\n&gt; &gt; stuff and will just stay away from it now, but some kind of \ninsight\n&gt; &gt; would be great.\n&gt;"}