{"id": "12994", "subject": "Re: Any insight on my life changing EVP experience?", "author": "SUZANNE", "timestamp": "2008-12-04T00:37:46Z", "full_text": "Wow!  Pretty interesting story!  First off, I am happy that you found \nthis forum.  There are a few things you should know right away that \nmight help you.  There are many different views and analogies as to \nwhat we hear during EVP sessions.  It can be frightening at first to \nhear the deep groveling voices that come across your recoder or voice \nmail.  The first thing that you should understand is that just \nbecause a voice is frightening it is not neccesarily demonic or \nnegative.  Different realms or &#39;dimensions&#39; operate at varied \nvibrations.  What the human ear can discern is not neccesarily what \nis being said.  Next, you will come to understand that there is a lot \nout there we are not able to view with the human eye.  The world of \nEVP is full of tricksters and pranksters which will eventually lead \nyou to be quite discerning when listening to EVP.\n\nMy suggestion is that you empower yourself and take a stand the next \ntime you encounter whatever it is that is making contact with you.  \nProtect yourself with meditation or prayer or with the light of \nwhatever it is you believe in.  Know . . . for certain that the \nuniverse will protect you if you believe it will, if you allow it to.\n\nBets of luck to you my friend.\n\nRemember . . . Many will go back and forth and knowledge will \ncontinue . . . The book of Daniel . . .\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;chuck255&quot; &lt;chuck255@...&gt; wrote:\n&gt;\n&gt; My name is Chuck and I stumbled upon this site and its information \n&gt; while trying to figure out what&#39;s going on in my crazy life. Before \nI \n&gt; get into that let me explain a bit about myself. I am a  male in \nhis \n&gt; 30&#39;s, who has Bachelors in Regional Development, with a minor in \n&gt; Computer Science. I work at a respective power plant company within \n&gt; Arizona doing GIS Tech Work. I get drug tested at it on random \n&gt; occasion and I really only drink socially, or on some holiday \n&gt; occasions. I have always been a logical kind of thinker my whole \nlife \n&gt; and never really had any &quot;belief&quot; in the paranormal, even though my \n&gt; mom and brother strongly do. \n&gt; \n&gt; I feel so weird even trying to explain this story because about a \n&gt; week ago I would have thought of it as silly. About a year ago I \nmet \n&gt; someone else, who for now ill call B. I fell madly in love with her \n&gt; and after a short time I was more than happy to have her come and \n&gt; live with me at my new place. In some strange way I always felt as \nif \n&gt; there was something about B I could never quite understand. After \n&gt; about 3-4 months of living with her I started to get the \ninclination \n&gt; that B was cheating on me. Her stories never added up, her job was \n&gt; secretive and she started stumbling on her words a lot. \n&gt; \n&gt; I then started getting spy gadgets, because she was staying with me \n&gt; and I was concerned about my place along with her activities there. \nI \n&gt; at first just got a digital recorder, but then after time I started \n&gt; to get aggravated and felt that the digital recordings were just \n&gt; being used to play and taunt me. So then I went to the extent of \n&gt; getting Cameras and even Camcorders. Whenever I would ask about \n&gt; something peculiar, I got tears and a really heartfelt reaction \nthat \n&gt; really made me believe her. I felt like we really loved one another \n&gt; and I could really see some care in her eyes, so most of the time I \n&gt; just gave in to what she said as true, but didnt have enough to \nstop \n&gt; looking. I felt like I had been in enough relationships to know the \n&gt; difference here. I have seen the act before and it really didn&#39;t \nlook \n&gt; that way here, unless she was just really that good at fooling \n&gt; people. \n&gt; \n&gt; During the course of our stay there she would pitch a huge fit if I \n&gt; had to leave her at the apartment alone and would stop at nothing \nto \n&gt; try and be in my company instead. But I started to get aggravated \nas \n&gt; time progressed and knew something was up, because of the odd \nvoices \n&gt; I would hear within the recordings. I made her stay there will \ntrying \n&gt; to sneak back and see who was messing with her around my place. I \n&gt; lost it because I couldn&#39;t pinpoint it at all and last July and got \n&gt; into a fight right outside of my place with three other people. She \n&gt; always told me she talked to her self when I qestioned other voices \n&gt; and I never could see anyone else there when she did, even with the \n&gt; cameras, so I had no choice but to continue on believeing her \nstill\n&gt; even though my feelings wouldn&#39;t agree to her words. \n&gt; \n&gt; For some odd reason it just seemed as if she knew where the cameras \n&gt; and recorders were every time, just by the way she would exit and \n&gt; enter the apartment. So then I started putting them outside and \nabout \n&gt; a month ago something crazy happened. I started listening to a \n&gt; digital recording and at the beginning of it I flat out heard B \n&gt; cheating on me with someone. I was upset and happy at the same time \n&gt; that I finally had caught it and as a result I sent her away. She \n&gt; left town because all her family was in another city. She couldn&#39;t \n&gt; stop crying and was hysterical, especially when she saw I was \n&gt; devastated too. I thought that I had finally gotten my answers and \n&gt; she was just the best actress I had ever known, end of story. She \n&gt; tried to kill herself a couple of times while this was going on a \n&gt; couple months back. If it was as an act or not, I really just don&#39;t \n&gt; know. But when she left last she left a note telling me not to let \n&gt; her die and she hopes that I find her soon before her heart \nstopped. \n&gt; Me..I said more BS and threw the note in the garbage. \n&gt; \n&gt; A couple of day&#39;s later curiosity got the best of me and I started \n&gt; listening to the rest of the recording. I then started to hear what \n&gt; sounded like people monitoring ME and calling me a &quot;Threat&quot;. I \n&gt; immediately start acting alarmed. Then in the recording I hear B \nexit \n&gt; the apartment in disgust after I stormed off that night, as we were \n&gt; fighting about something weird yet again.  After I had left she \n&gt; started talking about setting up a &quot;Private Meeting&quot; with some \nother \n&gt; people and something about boating. Well during the beginning of \nthis \n&gt; meeting I heard a reference to a crazy accusation that I had made \nat \n&gt; B awhile ago, which to me at the time confirmed she was in the \nMafia. \n&gt; That explained all the weirdness to me and during this meeting the \n&gt; voices changed a bunch as if they sounded &quot;Masked&quot; or &quot;Disguised&quot;, \nso \n&gt; I really had to amp up the volume. \n&gt; \n&gt; The next day and every day after from this point on I amped up the \n&gt; volume in the recording. I also had to distinguish the masked voice \n&gt; by breaking the large file into smaller segments of two to four \n&gt; second intervals, in order to piece the entire recordings meaning \n&gt; together. Over time I started to interpret the masked voices better \n&gt; because I thought I was tuning my ears better to them. The voices \nin \n&gt; these recordings were two different males, B and some other female. \nI \n&gt; later on saw in the recording that they had actually seen the \n&gt; recording but weren&#39;t taking it, which was EXTREMELY odd to me \n&gt; considering they had been caught. Why not destroy the evidence? \n&gt; \n&gt; Then I heard one of the males say that he was the &quot;Boss of the \n&gt; Southwest Mafia&quot; and that I was going to pay for hurting B like \nthis. \n&gt; He also said that my being a nuisance in the apartment had messed \nup \n&gt; his business within the area and all my spy stuff had really pissed \n&gt; him off. He told me I was dead, my daughter along with me and more \n&gt; than likely my whole family as well. \n&gt; \n&gt; He knew where my mom and dad lived and some information I didn&#39;t \neven \n&gt; tell B. I freak out and figure the damn mob is after me. I keep \n&gt; listening and he says &quot;If I don&#39;t move away and discontinue my \n&gt; interactions with my daughter by December 5th, that he would know \n&gt; that I was just playing with B and then my whole family is dead&quot;. \n&gt; This was exactly one month from when I had used the recording \ndevice \n&gt; too by the way. I moved out and away from my daughter breaking the \n&gt; tie and in tears the whole time too because I couldnt explain why. \nI \n&gt; really did it because I feared for their lives of my family and \nfelt \n&gt; that we would all die if f I didnt. \n&gt; \n&gt; Meanwhile B and met someone else that ill name J for now. After \n&gt; knowing him for two days she decided to bring him back with her to \n&gt; pick up her things out of the apartment. I was kicking her out of \nit \n&gt; by the way. I thought it was just to piss me off and I forgot about \n&gt; it. Then I heard as I progressed in the recording J&#39;s name brought \n&gt; up. Supposedly they knew him and he was in their mob and I needed \nto \n&gt; go attack him to prove myself, or else B will never be seen from me \n&gt; again. I also hear that I can&#39;t go to certain places at certain \ntimes \n&gt; where B might be and furthermore think that they didnt take the \n&gt; recorder because the damn thing has to be planned down to the times \nI \n&gt; would hear it. \n&gt; \n&gt; At this time I am in fear for my life and my families, lost my love \n&gt; and I am not understanding how the recording is so damn well time \n&gt; planned, figured im going crazy. Then something ill never forget \n&gt; happens. I am spoken directly too and I figure its me going of the \n&gt; deep end now. I try and test my sanity and go to different parts of \n&gt; the recording only to get the same thing kind of direct question. I \n&gt; am in disarray at this point! I stand up and walk around, trying to \n&gt; figure out just what the hell is going on with me. I get back on \nand \n&gt; further see that my verbal questions are now being answered \ninstantly \n&gt; by this recording (Which is merely a sound file on the pc). *I was \n&gt; using Sound Forge by the way if anyone wanted to know what sound \n&gt; software I was using was*.\n&gt; \n&gt; I have so little sleep at this point and I am told that I need to \ndo \n&gt; all this crazy stuff and drive out to the middle of some hotel \nright \n&gt; then and there, to further see them, as I have passed all their \ntests \n&gt; to get into their mafia now. As a reward B would be there waiting \nfor \n&gt; me too. I hurry to do it and rush there but no one is even their to \n&gt; answer the door. I go back and get a yelling voice at me that I had \n&gt; left to early and immediatly go back. Me not wanting to piss the \nmob \n&gt; boss anymore, I take the 45 minute trip again and go back. But when \nI \n&gt; get there it just didn&#39;t feel right to me and I never exited the \ncar, \n&gt; especially when I saw the numbers in vehicles hadnt changed in the \n&gt; parking lot. I had plenty reason to be paranoid at this point and \n&gt; truly felt in danger.I left and thought I was done for when I got \n&gt; back. Instead, he tells me that he was impressed by my decision \nwhen \n&gt; and literally puts me in tears when he said that because of my \n&gt; intelligence,  I had won my families lives back, but not my own \nyet. \n&gt; \n&gt; All this is done by him also telling me that he can physically see \nme \n&gt; through his advanced mafia technology on the computer monitor. He \n&gt; also tells me to to move things around on my compter desk that were \n&gt; between the sight of me and the computer monitor, while demanding I \n&gt; correct my posture when speaking to him. He also states that he is \n&gt; watching my every move and if I tell anyone anything they die along \n&gt; with me. \n&gt; \n&gt; I make no sense of this and I was completely baffled on how I was \n&gt; being communicated with. I had just moved and there was no internet \n&gt; connection even. Me just being happy my family is safe, I decide to \n&gt; go to sleep. Feeling as though I am now sleep deprived and going \n&gt; crazy from the stress, I go to sleep for two days consistently, as \n&gt; this was during the Thanksgiving holiday time. I would purposely \nmake \n&gt; myself sleep longer when I woke to ensure I didn&#39;t belong in the \n&gt; loony bin. \n&gt; \n&gt; When I finally woke up I was determined to find an explanation to \nhow \n&gt; they were talking to me, I go to the library and look into \nBluetooth \n&gt; technology, telephony, and remoting into a computer..anything. \nThen \n&gt; I realize..that I can find out just how crazy I really am by \nmoving \n&gt; the recording and listening to it elsewhere. I then decide to take \n&gt; the same recording into my work to test my saneness, along with the \n&gt; file itself. If its was on my home CPU.then it&#39;s going to now be \nat \n&gt; my work one too right? I do and get the same damn thing, not to \n&gt; mention that the &quot;Mob Boss&quot; now has company two others when I speak \n&gt; to him. All of them yelling at me for moving their sensive \n&gt; information. \n&gt; \n&gt; During this time I invest in GPS, GSM, 3G and several signal \nblocking \n&gt; devices, in order to prohibit myself from being tracked any \nfurther. \n&gt; They never worked or even phased the &quot;Mob Boss&quot;. But I would still \n&gt; check the recording in the evening just to hear what I needed to do \n&gt; in order to be making them happy and get the possibility to see B \n&gt; again. The &quot;Mob Boss&quot; had told me that it was all just a test for \nme \n&gt; to see if I loved her and she never really did do anything. They \n&gt; continue to tell me over and over that I have to beat up J in order \n&gt; to prove myself to B. That this is what everyone is really waiting \non \n&gt; and if I would just go up to the other town and get it over with, \n&gt; then I can bring her back with me. I won&#39;t do it and say that I \nwon&#39;t \n&gt; fight for anything that doesn&#39;t want to be fought for. Basically \n&gt; saying that B can call me about it if she really wants it. Then as \na \n&gt; result they start threatening my family again. At this point, I \n&gt; really can&#39;t even express to you how much of a wreck I am. But I \nfelt \n&gt; like I needed to be strong for my family and get on the mob&#39;s good \n&gt; side so I can fix the mess I created.\n&gt; \n&gt; Well it never really happened and this torment went on for a good \n&gt; week, while I was moving everything I could as fast as I could in \n&gt; order to make their deadline and save everyone. Everyday I would do \n&gt; what I thought was expected of me and hope it wouldnt make them mad \n&gt; in one breath, while in the other breath win back my complete \n&gt; freedom, away from their bad side. No matter where I was or what I \n&gt; did during the day they usually seemed to know about it when I \ntalked \n&gt; to them in the evening. It really bothered me that I couldnt find \nout \n&gt; where they were putting the &quot;bugs&quot;, or even better how they were \n&gt; doing all of it. My inability to &quot;believe&quot; in the paranormal really \n&gt; hurt me here.\n&gt; \n&gt; Since the apartment that B and I had used was empty at this time \nand \n&gt; a friend of mine was down on his luck, I gave him the apartment for \n&gt; free until the lease was completely up. After about a week of me \n&gt; doing this, I walked in and found guns and ammo everywhere and \n&gt; freaked the hell out. That&#39;s the last thing I needed when I thought \n&gt; the mob was just down the street! I made everyone there except my \n&gt; friend leave, with quite a fuss I might add. Then I headed back to \nmy \n&gt; home to see how the mob felt about what I did, assure they would be \n&gt; impressed that I had looked out for them. Instead the regular \nfemale \n&gt; that was always with the &quot;Mob Boss&quot; now asked me why I didn&#39;t \nfinish \n&gt; the job, stating that there was still someone there and it made \nthem \n&gt; all angry. They demanded that I go back especially to see just \nhow &quot;I \n&gt; finished it&quot;. \n&gt; \n&gt; So like the puppet I was at that time, I went back. I didn&#39;t have \nthe \n&gt; heart to put him on the street, even though he had put me at a \nmajor \n&gt; risk and instead I just found another place for him to stay. On the \n&gt; way there I bought him some water and some smokes. When we got \nthere \n&gt; I even helped him move in and explained that it wasn&#39;t me that did \n&gt; it, but the leasing office had saw all the guns. As a result they \nhad \n&gt; made me do it. I thought he made a poor decision and I knew he saw \n&gt; the same, not to mention I kind of felt bad that I had to do all of \n&gt; this to him at 11:30PM. I truly didnt want to make his life a \n&gt; complete hell any more than it already was and he felt better that \nI \n&gt; had talked to him, so as a result I did as well. I then left and \nonce \n&gt; again headed back home. \n&gt; \n&gt; Certain that I was going to get good praises; I sat at the PC again \n&gt; only to immediately get yelled at. They asked me why I was &quot;so \ngood&quot; \n&gt; and that they had absolutely no respect for me. I tell them I just \n&gt; did all of that for them and they say that I always do things &quot;the \n&gt; right way&quot; and they hate me for it. This is where I think I hit the \n&gt; loony bin and just didnt see how I was going to fix this problem. \n&gt; Then it got worse and saw that my thoughts were now being \n&gt; communicated back to me. Then I knew it and was convinced I was \ngoing \n&gt; skitzo and that i was just truly arguing with myself in reality, \n&gt; especially when I saw I wasn&#39;t even speaking. I used the restroom, \n&gt; splash water on my face and faintly start to hear the same mob \npeople \n&gt; in my fan motor in the bathroom.  I haven&#39;t drank, done any drugs \n&gt; (even prescription) and have a pretty complex job which I can still \n&gt; handle, but yet I feel like I am going crazy. \n&gt; \n&gt; I can&#39;t talk to anyone about it so I sit back at the CPU, only to \n&gt; hear that I need to open up the front door. Screw that!I just look \n&gt; out the window and see nothing and say no way. They ask why not and \n&gt; that I should trust them and I say hell no and I continue to \n&gt; hear &quot;God Damnit&quot; from them when they get mad. They continue to ask \n&gt; me to open the door and I continue to check the window to see \n&gt; nothing. I say to knock then and they get mad and say they have no \n&gt; hands. They don&#39;t sound like they are joking and get mad when I \nlaugh \n&gt; even, so I continue to think I am just crazy at this point. I asked \n&gt; why they wanted to come in and they said they wanted to fix me. I \nsay \n&gt; there is nothing wrong with me and they say they hate me and want \nto \n&gt; eat me.\n&gt; \n&gt; I start to really think about this and say ill open the door if I \nget \n&gt; the answers to all this. They start saying things and its if as \n&gt; though they see my thought process develop and say things \nlike&quot;watch \n&gt; him go&quot;. Then I hear out of my computer monitor something I couldnt \n&gt; even fathom. I hear my ex-wife&#39;s ex-best friends voice. His name \nwas \n&gt; Daniel and he had committed suicide over 5 years ago. I did know \nhim, \n&gt; but not as well as she had. It WAS his voice and he said &quot;Charles \nits \n&gt; Daniel&quot; and then I heard their voice again say we are &quot;down here \nwith \n&gt; him&quot;. At this point I didnt know really what to think, but this \npart \n&gt; in our conversation was the turning point on my beliefs and \nthoughts \n&gt; on what was really going on.  \n&gt; \n&gt; I say nothing yet they somehow can seem to hear my thoughts and \nstart \n&gt; saying little things to make me think even more. It was the most \n&gt; fluent conversation I had ever had. It was truly telepathic and was \n&gt; on a level I could never really explain even to myself. Then it \n&gt; really hit me and I said &quot;Demons&quot;. I tried to play something and \ngot \n&gt; no response for the first time ever on the sound file. I then \nstarted \n&gt; piecing it all together from there and even though I wasn&#39;t a \n&gt; believer this makes more sense then I could ever write down here \nand \n&gt; as a result I forever will be one now. \n&gt; \n&gt; They ask for me to now open the door and I open the small glass \ndoor \n&gt; on my CPU desk and they get really pissed off, saying I tricked \nthem. \n&gt; Then their voice changed to the most demonic, vile and disturbing \n&gt; voice I could ever put into words. I never really thought of doing \n&gt; that until that moment and I think it was seen from them reaction, \n&gt; but it worked out quite nicely. I start saying the our father \nprayer \n&gt; and I can hear the displeasure in them even more and heard &quot;that&#39;s \nit \n&gt; we are going in&quot;. I immediately took off my headphones and ran to \nget \n&gt; a bible they never did as far as I can tell, but I sat there all \n&gt; night with the bible in my hand praying. \n&gt; \n&gt; I started calling people and my phone started cutting out, the bulb \n&gt; on the porch blew and my good friend&#39;s girlfriend called me to ask \nme \n&gt; for help because my friend was drunk and passed out. It sounded \nlike \n&gt; she was trying to flirt with me and I asked her how &quot;A&quot; nightclub \nwas \n&gt; and she said good and then I said didn&#39;t you actually go to &quot;B&quot; \n&gt; nightclub actually and she switches her story. I hang up and call \n&gt; back with no answer. The time was only 1:10am and they never leave \n&gt; until the clubs close so this was even odder. \n&gt; \n&gt; I sat there terrified most of the night praying, until I called my \n&gt; brother who told me that I have to stand up to them or I am feeding \n&gt; into their fear. He like my mom has been involved in similar things \n&gt; like this but after talking to both of them, neither have on this \n&gt; level. But in a refreshing breath after talking to them about this, \n&gt; they did seem to believe me. But it wasnt unil I researched this \n&gt; issue and found out about EVP and how it works, did I truly know \nthat \n&gt; I wasnt becoming a lunatic.\n&gt; \n&gt; That brings me to today and me being at my wits end. I swear on \n&gt; everything this is all 100% true and I feel like I am crazy even \n&gt; still. Even though I hear it from no one else and have a pretty \ngood \n&gt; circle of friends, not to mention that I still seem to do my job \njust \n&gt; fine as well. I havent put on my headphones or heard any voices \nsince \n&gt; I tried to last listen to the recording, which was now 3 days ago. \n&gt; Does anyone have any help and guidance here, as this all has really \n&gt; destroyed my life. I deleted all the copies of the recording, \nexcept \n&gt; for one hardcopy. I still have the original recorder with the file \n&gt; on, but I haven&#39;t tried to use the recording or recorder any \nfurther, \n&gt; as I refuse to continue it without any guidance. I figure its best \nto \n&gt; avoid them, like my brother said. Maybe someone can help me \n&gt; understand all of this.  Even if I have gotten rid of these things \n&gt; what does that say of B? I really spent a bunch of time making this \n&gt; really need some genuine help from someone in the know. I know it \n&gt; sounds crazy but please regard this all as true. I am new to this \n&gt; stuff and will just stay away from it now, but some kind of insight \n&gt; would be great.\n&gt;"}