{"id": "12999", "subject": "Re: [EVP-ITC] Re: Any insight on my life changing EVP experience?", "author": "suzanne bibb", "timestamp": "2008-12-04T04:20:08Z", "full_text": "--0-1835474487-1228364408=:6791\r\nContent-Type: text/plain; charset=windows-1252\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nWonderful!=A0=A0I try to keep in mind, which is sometimes difficult in this=\r\n line of work, that this is my realm, my home . . . It is up to me, or you,=\r\n to decide what=A0we let in or keep out.=A0 I think it is really that simpl=\r\ne.=A0 It has worked for me in this lifetime . . . best to you in your futur=\r\ne endeavors . . . you will do good things . . .\n\n--- On Wed, 12/3/08, chuck=\r\n255 &lt;chuck255@...&gt; wrote:\n\nFrom: chuck255 &lt;chuck255@...&gt;\nSubjec=\r\nt: [EVP-ITC] Re: Any insight on my life changing EVP experience?\nTo: EVP-IT=\r\nC@yahoogroups.com\nDate: Wednesday, December 3, 2008, 8:29 PM\n\n\n\n\n\n\nThank yo=\r\nu for the reply, as I found it helpfull. Pranksters is \ndefinately an under=\r\nstatement at best when I think about how I was had \nhere for so long, but i=\r\nt strengthened my faith and taught me a ton. \nDo you think if I would have =\r\nreally opened the door there would have \nbeen no repercussions? Thats reall=\r\ny the only thing I question when it \ncomes to the legitimacy of what they s=\r\naid. \n\nExtremely interesting citing I might add on the book of Daniel.\n\nTha=\r\nnks again!\n\n--- In EVP-ITC@yahoogroups .com, &quot;SUZANNE&quot; &lt;suzyq6819@. ..&gt; wro=\r\nte:\n&gt;\n&gt; Wow! Pretty interesting story! First off, I am happy that you \nfoun=\r\nd \n&gt; this forum. There are a few things you should know right away that \n&gt; =\r\nmight help you. There are many different views and analogies as to \n&gt; what =\r\nwe hear during EVP sessions. It can be frightening at first \nto \n&gt; hear the=\r\n deep groveling voices that come across your recoder or \nvoice \n&gt; mail. The=\r\n first thing that you should understand is that just \n&gt; because a voice is =\r\nfrightening it is not neccesarily demonic or \n&gt; negative. Different realms =\r\nor &#39;dimensions&#39; operate at varied \n&gt; vibrations. What the human ear can dis=\r\ncern is not neccesarily what \n&gt; is being said. Next, you will come to under=\r\nstand that there is a \nlot \n&gt; out there we are not able to view with the hu=\r\nman eye. The world of \n&gt; EVP is full of tricksters and pranksters which wil=\r\nl eventually lead \n&gt; you to be quite discerning when listening to EVP.\n&gt; \n&gt;=\r\n My suggestion is that you empower yourself and take a stand the \nnext \n&gt; t=\r\nime you encounter whatever it is that is making contact with you. \n&gt; Protec=\r\nt yourself with meditation or prayer or with the light of \n&gt; whatever it is=\r\n you believe in. Know . . . for certain that the \n&gt; universe will protect y=\r\nou if you believe it will, if you allow it \nto.\n&gt; \n&gt; Bets of luck to you my=\r\n friend.\n&gt; \n&gt; Remember . . . Many will go back and forth and knowledge will=\r\n \n&gt; continue . . . The book of Daniel . . .\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; --- In EVP-ITC@ya=\r\nhoogroups .com, &quot;chuck255&quot; &lt;chuck255@&gt; wrote:\n&gt; &gt;\n&gt; &gt; My name is Chuck and =\r\nI stumbled upon this site and its \ninformation \n&gt; &gt; while trying to figure =\r\nout what&#39;s going on in my crazy life. \nBefore \n&gt; I \n&gt; &gt; get into that let m=\r\ne explain a bit about myself. I am a male in \n&gt; his \n&gt; &gt; 30&#39;s, who has Bach=\r\nelors in Regional Development, with a minor in \n&gt; &gt; Computer Science. I wor=\r\nk at a respective power plant company \nwithin \n&gt; &gt; Arizona doing GIS Tech W=\r\nork. I get drug tested at it on random \n&gt; &gt; occasion and I really only drin=\r\nk socially, or on some holiday \n&gt; &gt; occasions. I have always been a logical=\r\n kind of thinker my whole \n&gt; life \n&gt; &gt; and never really had any &quot;belief&quot; in=\r\n the paranormal, even though \nmy \n&gt; &gt; mom and brother strongly do. \n&gt; &gt; \n&gt; =\r\n&gt; I feel so weird even trying to explain this story because about a \n&gt; &gt; we=\r\nek ago I would have thought of it as silly. About a year ago I \n&gt; met \n&gt; &gt; =\r\nsomeone else, who for now ill call B. I fell madly in love with \nher \n&gt; &gt; a=\r\nnd after a short time I was more than happy to have her come and \n&gt; &gt; live =\r\nwith me at my new place. In some strange way I always felt \nas \n&gt; if \n&gt; &gt; t=\r\nhere was something about B I could never quite understand. After \n&gt; &gt; about=\r\n 3-4 months of living with her I started to get the \n&gt; inclination \n&gt; &gt; tha=\r\nt B was cheating on me. Her stories never added up, her job \nwas \n&gt; &gt; secre=\r\ntive and she started stumbling on her words a lot. \n&gt; &gt; \n&gt; &gt; I then started=\r\n getting spy gadgets, because she was staying with \nme \n&gt; &gt; and I was conce=\r\nrned about my place along with her activities \nthere. \n&gt; I \n&gt; &gt; at first ju=\r\nst got a digital recorder, but then after time I \nstarted \n&gt; &gt; to get aggra=\r\nvated and felt that the digital recordings were just \n&gt; &gt; being used to pla=\r\ny and taunt me. So then I went to the extent of \n&gt; &gt; getting Cameras and ev=\r\nen Camcorders. Whenever I would ask about \n&gt; &gt; something peculiar, I got te=\r\nars and a really heartfelt reaction \n&gt; that \n&gt; &gt; really made me believe her=\r\n. I felt like we really loved one \nanother \n&gt; &gt; and I could really see some=\r\n care in her eyes, so most of the time \nI \n&gt; &gt; just gave in to what she sai=\r\nd as true, but didnt have enough to \n&gt; stop \n&gt; &gt; looking. I felt like I had=\r\n been in enough relationships to know \nthe \n&gt; &gt; difference here. I have see=\r\nn the act before and it really didn&#39;t \n&gt; look \n&gt; &gt; that way here, unless sh=\r\ne was just really that good at fooling \n&gt; &gt; people. \n&gt; &gt; \n&gt; &gt; During the co=\r\nurse of our stay there she would pitch a huge fit if \nI \n&gt; &gt; had to leave h=\r\ner at the apartment alone and would stop at nothing \n&gt; to \n&gt; &gt; try and be i=\r\nn my company instead. But I started to get aggravated \n&gt; as \n&gt; &gt; time progr=\r\nessed and knew something was up, because of the odd \n&gt; voices \n&gt; &gt; I would =\r\nhear within the recordings. I made her stay there will \n&gt; trying \n&gt; &gt; to sn=\r\neak back and see who was messing with her around my place. I \n&gt; &gt; lost it b=\r\necause I couldn&#39;t pinpoint it at all and last July and \ngot \n&gt; &gt; into a fig=\r\nht right outside of my place with three other people. \nShe \n&gt; &gt; always told=\r\n me she talked to her self when I qestioned other \nvoices \n&gt; &gt; and I never =\r\ncould see anyone else there when she did, even with \nthe \n&gt; &gt; cameras, so I=\r\n had no choice but to continue on believeing her \n&gt; still=85=85\n&gt; &gt; even th=\r\nough my feelings wouldn&#39;t agree to her words. \n&gt; &gt; \n&gt; &gt; For some odd reason=\r\n it just seemed as if she knew where the \ncameras \n&gt; &gt; and recorders were e=\r\nvery time, just by the way she would exit and \n&gt; &gt; enter the apartment. So =\r\nthen I started putting them outside and \n&gt; about \n&gt; &gt; a month ago something=\r\n crazy happened. I started listening to a \n&gt; &gt; digital recording and at the=\r\n beginning of it I flat out heard B \n&gt; &gt; cheating on me with someone. I was=\r\n upset and happy at the same \ntime \n&gt; &gt; that I finally had caught it and as=\r\n a result I sent her away. She \n&gt; &gt; left town because all her family was in=\r\n another city. She \ncouldn&#39;t \n&gt; &gt; stop crying and was hysterical, especiall=\r\ny when she saw I was \n&gt; &gt; devastated too. I thought that I had finally gott=\r\nen my answers \nand \n&gt; &gt; she was just the best actress I had ever known, end=\r\n of story. She \n&gt; &gt; tried to kill herself a couple of times while this was =\r\ngoing on a \n&gt; &gt; couple months back. If it was as an act or not, I really ju=\r\nst \ndon&#39;t \n&gt; &gt; know. But when she left last she left a note telling me not =\r\nto \nlet \n&gt; &gt; her die and she hopes that I find her soon before her heart \n&gt;=\r\n stopped. \n&gt; &gt; Me=85..I said more BS and threw the note in the garbage. \n&gt; =\r\n&gt; \n&gt; &gt; A couple of day&#39;s later curiosity got the best of me and I \nstarted =\r\n\n&gt; &gt; listening to the rest of the recording. I then started to hear \nwhat \n=\r\n&gt; &gt; sounded like people monitoring ME and calling me a &quot;Threat&quot;. I \n&gt; &gt; imm=\r\nediately start acting alarmed. Then in the recording I hear B \n&gt; exit \n&gt; &gt; =\r\nthe apartment in disgust after I stormed off that night, as we \nwere \n&gt; &gt; f=\r\nighting about something weird yet again. After I had left she \n&gt; &gt; started =\r\ntalking about setting up a &quot;Private Meeting&quot; with some \n&gt; other \n&gt; &gt; people=\r\n and something about boating. Well during the beginning of \n&gt; this \n&gt; &gt; mee=\r\nting I heard a reference to a crazy accusation that I had made \n&gt; at \n&gt; &gt; B=\r\n awhile ago, which to me at the time confirmed she was in the \n&gt; Mafia. \n&gt; =\r\n&gt; That explained all the weirdness to me and during this meeting \nthe \n&gt; &gt; =\r\nvoices changed a bunch as if they sounded &quot;Masked&quot; \nor &quot;Disguised&quot;, \n&gt; so \n=\r\n&gt; &gt; I really had to amp up the volume. \n&gt; &gt; \n&gt; &gt; The next day and every day=\r\n after from this point on I amped up \nthe \n&gt; &gt; volume in the recording. I a=\r\nlso had to distinguish the masked \nvoice \n&gt; &gt; by breaking the large file in=\r\nto smaller segments of two to four \n&gt; &gt; second intervals, in order to piece=\r\n the entire recordings meaning \n&gt; &gt; together. Over time I started to interp=\r\nret the masked voices \nbetter \n&gt; &gt; because I thought I was tuning my ears b=\r\netter to them. The voices \n&gt; in \n&gt; &gt; these recordings were two different ma=\r\nles, B and some other \nfemale. \n&gt; I \n&gt; &gt; later on saw in the recording that=\r\n they had actually seen the \n&gt; &gt; recording but weren&#39;t taking it, which was=\r\n EXTREMELY odd to me \n&gt; &gt; considering they had been caught. Why not destroy=\r\n the evidence? \n&gt; &gt; \n&gt; &gt; Then I heard one of the males say that he was the =\r\n&quot;Boss of the \n&gt; &gt; Southwest Mafia&quot; and that I was going to pay for hurting =\r\nB like \n&gt; this. \n&gt; &gt; He also said that my being a nuisance in the apartment=\r\n had messed \n&gt; up \n&gt; &gt; his business within the area and all my spy stuff ha=\r\nd really \npissed \n&gt; &gt; him off. He told me I was dead, my daughter along wit=\r\nh me and \nmore \n&gt; &gt; than likely my whole family as well. \n&gt; &gt; \n&gt; &gt; He knew =\r\nwhere my mom and dad lived and some information I didn&#39;t \n&gt; even \n&gt; &gt; tell =\r\nB. I freak out and figure the damn mob is after me. I keep \n&gt; &gt; listening a=\r\nnd he says &quot;If I don&#39;t move away and discontinue my \n&gt; &gt; interactions with =\r\nmy daughter by December 5th, that he would know \n&gt; &gt; that I was just playin=\r\ng with B and then my whole family is dead&quot;. \n&gt; &gt; This was exactly one month=\r\n from when I had used the recording \n&gt; device \n&gt; &gt; too by the way. I moved =\r\nout and away from my daughter breaking \nthe \n&gt; &gt; tie and in tears the whole=\r\n time too because I couldnt explain \nwhy. \n&gt; I \n&gt; &gt; really did it because I=\r\n feared for their lives of my family and \n&gt; felt \n&gt; &gt; that we would all die=\r\n if f I didnt. \n&gt; &gt; \n&gt; &gt; Meanwhile B and met someone else that ill name J f=\r\nor now. After \n&gt; &gt; knowing him for two days she decided to bring him back w=\r\nith her \nto \n&gt; &gt; pick up her things out of the apartment. I was kicking her=\r\n out of \n&gt; it \n&gt; &gt; by the way. I thought it was just to piss me off and I f=\r\norgot \nabout \n&gt; &gt; it. Then I heard as I progressed in the recording J&#39;s nam=\r\ne \nbrought \n&gt; &gt; up. Supposedly they knew him and he was in their mob and I =\r\nneeded \n&gt; to \n&gt; &gt; go attack him to prove myself, or else B will never be se=\r\nen from \nme \n&gt; &gt; again. I also hear that I can&#39;t go to certain places at ce=\r\nrtain \n&gt; times \n&gt; &gt; where B might be and furthermore think that they didnt =\r\ntake the \n&gt; &gt; recorder because the damn thing has to be planned down to the=\r\n \ntimes \n&gt; I \n&gt; &gt; would hear it. \n&gt; &gt; \n&gt; &gt; At this time I am in fear for my=\r\n life and my families, lost my \nlove \n&gt; &gt; and I am not understanding how th=\r\ne recording is so damn well time \n&gt; &gt; planned, figured im going crazy. Then=\r\n something ill never forget \n&gt; &gt; happens. I am spoken directly too and I fi=\r\ngure its me going of \nthe \n&gt; &gt; deep end now. I try and test my sanity and g=\r\no to different parts \nof \n&gt; &gt; the recording only to get the same thing kind=\r\n of direct question. \nI \n&gt; &gt; am in disarray at this point! I stand up and w=\r\nalk around, trying \nto \n&gt; &gt; figure out just what the hell is going on with =\r\nme. I get back on \n&gt; and \n&gt; &gt; further see that my verbal questions are now =\r\nbeing answered \n&gt; instantly \n&gt; &gt; by this recording (Which is merely a sound=\r\n file on the pc). *I \nwas \n&gt; &gt; using Sound Forge by the way if anyone wante=\r\nd to know what sound \n&gt; &gt; software I was using was*.\n&gt; &gt; \n&gt; &gt; I have so lit=\r\ntle sleep at this point and I am told that I need to \n&gt; do \n&gt; &gt; all this cr=\r\nazy stuff and drive out to the middle of some hotel \n&gt; right \n&gt; &gt; then and =\r\nthere, to further see them, as I have passed all their \n&gt; tests \n&gt; &gt; to get=\r\n into their mafia now. As a reward B would be there waiting \n&gt; for \n&gt; &gt; me =\r\ntoo. I hurry to do it and rush there but no one is even their \nto \n&gt; &gt; answ=\r\ner the door. I go back and get a yelling voice at me that I \nhad \n&gt; &gt; left =\r\nto early and immediatly go back. Me not wanting to piss the \n&gt; mob \n&gt; &gt; bos=\r\ns anymore, I take the 45 minute trip again and go back. But \nwhen \n&gt; I \n&gt; &gt;=\r\n get there it just didn&#39;t feel right to me and I never exited the \n&gt; car, \n=\r\n&gt; &gt; especially when I saw the numbers in vehicles hadnt changed in \nthe \n&gt; =\r\n&gt; parking lot. I had plenty reason to be paranoid at this point and \n&gt; &gt; tr=\r\nuly felt in danger.I left and thought I was done for when I got \n&gt; &gt; back. =\r\nInstead, he tells me that he was impressed by my decision \n&gt; when \n&gt; &gt; and =\r\nliterally puts me in tears when he said that because of my \n&gt; &gt; intelligenc=\r\ne, I had won my families lives back, but not my own \n&gt; yet. \n&gt; &gt; \n&gt; &gt; All t=\r\nhis is done by him also telling me that he can physically \nsee \n&gt; me \n&gt; &gt; t=\r\nhrough his advanced mafia technology on the computer monitor. He \n&gt; &gt; also =\r\ntells me to to move things around on my compter desk that \nwere \n&gt; &gt; betwee=\r\nn the sight of me and the computer monitor, while demanding \nI \n&gt; &gt; correct=\r\n my posture when speaking to him. He also states that he \nis \n&gt; &gt; watching =\r\nmy every move and if I tell anyone anything they die \nalong \n&gt; &gt; with me. \n=\r\n&gt; &gt; \n&gt; &gt; I make no sense of this and I was completely baffled on how I was =\r\n\n&gt; &gt; being communicated with. I had just moved and there was no \ninternet \n=\r\n&gt; &gt; connection even. Me just being happy my family is safe, I decide \nto \n&gt;=\r\n &gt; go to sleep. Feeling as though I am now sleep deprived and going \n&gt; &gt; cr=\r\nazy from the stress, I go to sleep for two days consistently, \nas \n&gt; &gt; this=\r\n was during the Thanksgiving holiday time. I would purposely \n&gt; make \n&gt; &gt; m=\r\nyself sleep longer when I woke to ensure I didn&#39;t belong in the \n&gt; &gt; loony =\r\nbin. \n&gt; &gt; \n&gt; &gt; When I finally woke up I was determined to find an explanati=\r\non to \n&gt; how \n&gt; &gt; they were talking to me, I go to the library and look int=\r\no \n&gt; Bluetooth \n&gt; &gt; technology, telephony, and remoting into a computer=85.=\r\n.anything. \n&gt; Then \n&gt; &gt; I realize=85=85..that I can find out just how crazy=\r\n I really am by \n&gt; moving \n&gt; &gt; the recording and listening to it elsewhere.=\r\n I then decide to \ntake \n&gt; &gt; the same recording into my work to test my san=\r\neness, along with \nthe \n&gt; &gt; file itself. If its was on my home CPU=85.then =\r\nit&#39;s going to now be \n&gt; at \n&gt; &gt; my work one too right? I do and get the sam=\r\ne damn thing, not to \n&gt; &gt; mention that the &quot;Mob Boss&quot; now has company two o=\r\nthers when I \nspeak \n&gt; &gt; to him. All of them yelling at me for moving their=\r\n sensive \n&gt; &gt; information. \n&gt; &gt; \n&gt; &gt; During this time I invest in GPS, GSM,=\r\n 3G and several signal \n&gt; blocking \n&gt; &gt; devices, in order to prohibit mysel=\r\nf from being tracked any \n&gt; further. \n&gt; &gt; They never worked or even phased =\r\nthe &quot;Mob Boss&quot;. But I would \nstill \n&gt; &gt; check the recording in the evening =\r\njust to hear what I needed to \ndo \n&gt; &gt; in order to be making them happy and=\r\n get the possibility to see B \n&gt; &gt; again. The &quot;Mob Boss&quot; had told me that i=\r\nt was all just a test for \n&gt; me \n&gt; &gt; to see if I loved her and she never re=\r\nally did do anything. They \n&gt; &gt; continue to tell me over and over that I ha=\r\nve to beat up J in \norder \n&gt; &gt; to prove myself to B. That this is what ever=\r\nyone is really \nwaiting \n&gt; on \n&gt; &gt; and if I would just go up to the other t=\r\nown and get it over with, \n&gt; &gt; then I can bring her back with me. I won&#39;t d=\r\no it and say that I \n&gt; won&#39;t \n&gt; &gt; fight for anything that doesn&#39;t want to b=\r\ne fought for. Basically \n&gt; &gt; saying that B can call me about it if she real=\r\nly wants it. Then \nas \n&gt; a \n&gt; &gt; result they start threatening my family aga=\r\nin. At this point, I \n&gt; &gt; really can&#39;t even express to you how much of a wr=\r\neck I am. But I \n&gt; felt \n&gt; &gt; like I needed to be strong for my family and g=\r\net on the mob&#39;s \ngood \n&gt; &gt; side so I can fix the mess I created.\n&gt; &gt; \n&gt; &gt; W=\r\nell it never really happened and this torment went on for a good \n&gt; &gt; week,=\r\n while I was moving everything I could as fast as I could in \n&gt; &gt; order to =\r\nmake their deadline and save everyone. Everyday I would \ndo \n&gt; &gt; what I tho=\r\nught was expected of me and hope it wouldnt make them \nmad \n&gt; &gt; in one brea=\r\nth, while in the other breath win back my complete \n&gt; &gt; freedom, away from =\r\ntheir bad side. No matter where I was or what \nI \n&gt; &gt; did during the day th=\r\ney usually seemed to know about it when I \n&gt; talked \n&gt; &gt; to them in the eve=\r\nning. It really bothered me that I couldnt find \n&gt; out \n&gt; &gt; where they were=\r\n putting the &quot;bugs&quot;, or even better how they were \n&gt; &gt; doing all of it. My =\r\ninability to &quot;believe&quot; in the paranormal \nreally \n&gt; &gt; hurt me here.\n&gt; &gt; \n&gt; =\r\n&gt; Since the apartment that B and I had used was empty at this time \n&gt; and \n=\r\n&gt; &gt; a friend of mine was down on his luck, I gave him the apartment \nfor \n&gt;=\r\n &gt; free until the lease was completely up. After about a week of me \n&gt; &gt; do=\r\ning this, I walked in and found guns and ammo everywhere and \n&gt; &gt; freaked t=\r\nhe hell out. That&#39;s the last thing I needed when I \nthought \n&gt; &gt; the mob wa=\r\ns just down the street! I made everyone there except my \n&gt; &gt; friend leave, =\r\nwith quite a fuss I might add. Then I headed back \nto \n&gt; my \n&gt; &gt; home to se=\r\ne how the mob felt about what I did, assure they would \nbe \n&gt; &gt; impressed t=\r\nhat I had looked out for them. Instead the regular \n&gt; female \n&gt; &gt; that was =\r\nalways with the &quot;Mob Boss&quot; now asked me why I didn&#39;t \n&gt; finish \n&gt; &gt; the job=\r\n, stating that there was still someone there and it made \n&gt; them \n&gt; &gt; all a=\r\nngry. They demanded that I go back especially to see just \n&gt; how &quot;I \n&gt; &gt; fi=\r\nnished it&quot;. \n&gt; &gt; \n&gt; &gt; So like the puppet I was at that time, I went back. I=\r\n didn&#39;t have \n&gt; the \n&gt; &gt; heart to put him on the street, even though he had=\r\n put me at a \n&gt; major \n&gt; &gt; risk and instead I just found another place for =\r\nhim to stay. On \nthe \n&gt; &gt; way there I bought him some water and some smokes=\r\n. When we got \n&gt; there \n&gt; &gt; I even helped him move in and explained that it=\r\n wasn&#39;t me that \ndid \n&gt; &gt; it, but the leasing office had saw all the guns. =\r\nAs a result they \n&gt; had \n&gt; &gt; made me do it. I thought he made a poor decisi=\r\non and I knew he \nsaw \n&gt; &gt; the same, not to mention I kind of felt bad that=\r\n I had to do all \nof \n&gt; &gt; this to him at 11:30PM. I truly didnt want to mak=\r\ne his life a \n&gt; &gt; complete hell any more than it already was and he felt be=\r\ntter \nthat \n&gt; I \n&gt; &gt; had talked to him, so as a result I did as well. I the=\r\nn left and \n&gt; once \n&gt; &gt; again headed back home. \n&gt; &gt; \n&gt; &gt; Certain that I wa=\r\ns going to get good praises; I sat at the PC \nagain \n&gt; &gt; only to immediatel=\r\ny get yelled at. They asked me why I was &quot;so \n&gt; good&quot; \n&gt; &gt; and that they ha=\r\nd absolutely no respect for me. I tell them I \njust \n&gt; &gt; did all of that fo=\r\nr them and they say that I always do \nthings &quot;the \n&gt; &gt; right way&quot; and they =\r\nhate me for it. This is where I think I hit \nthe \n&gt; &gt; loony bin and just di=\r\ndnt see how I was going to fix this problem. \n&gt; &gt; Then it got worse and saw=\r\n that my thoughts were now being \n&gt; &gt; communicated back to me. Then I knew =\r\nit and was convinced I was \n&gt; going \n&gt; &gt; skitzo and that i was just truly a=\r\nrguing with myself in reality, \n&gt; &gt; especially when I saw I wasn&#39;t even spe=\r\naking. I used the \nrestroom, \n&gt; &gt; splash water on my face and faintly start=\r\n to hear the same mob \n&gt; people \n&gt; &gt; in my fan motor in the bathroom. I hav=\r\nen&#39;t drank, done any drugs \n&gt; &gt; (even prescription) and have a pretty compl=\r\nex job which I can \nstill \n&gt; &gt; handle, but yet I feel like I am going crazy=\r\n. \n&gt; &gt; \n&gt; &gt; I can&#39;t talk to anyone about it so I sit back at the CPU, only =\r\nto \n&gt; &gt; hear that I need to open up the front door. Screw that!=85I just \nl=\r\nook \n&gt; &gt; out the window and see nothing and say no way. They ask why not \na=\r\nnd \n&gt; &gt; that I should trust them and I say hell no and I continue to \n&gt; &gt; h=\r\near &quot;God Damnit&quot; from them when they get mad. They continue to \nask \n&gt; &gt; me=\r\n to open the door and I continue to check the window to see \n&gt; &gt; nothing. I=\r\n say to knock then and they get mad and say they have \nno \n&gt; &gt; hands. They =\r\ndon&#39;t sound like they are joking and get mad when I \n&gt; laugh \n&gt; &gt; even, so =\r\nI continue to think I am just crazy at this point. I \nasked \n&gt; &gt; why they w=\r\nanted to come in and they said they wanted to fix me. I \n&gt; say \n&gt; &gt; there i=\r\ns nothing wrong with me and they say they hate me and want \n&gt; to \n&gt; &gt; eat m=\r\ne.\n&gt; &gt; \n&gt; &gt; I start to really think about this and say ill open the door if=\r\n I \n&gt; get \n&gt; &gt; the answers to all this. They start saying things and its if=\r\n as \n&gt; &gt; though they see my thought process develop and say things \n&gt; like=\r\n=85&quot;watch \n&gt; &gt; him go&quot;. Then I hear out of my computer monitor something I =\r\n\ncouldnt \n&gt; &gt; even fathom. I hear my ex-wife&#39;s ex-best friends voice. His n=\r\name \n&gt; was \n&gt; &gt; Daniel and he had committed suicide over 5 years ago. I did=\r\n know \n&gt; him, \n&gt; &gt; but not as well as she had. It WAS his voice and he said=\r\n &quot;Charles \n&gt; its \n&gt; &gt; Daniel&quot; and then I heard their voice again say we are=\r\n &quot;down here \n&gt; with \n&gt; &gt; him&quot;. At this point I didnt know really what to th=\r\nink, but this \n&gt; part \n&gt; &gt; in our conversation was the turning point on my =\r\nbeliefs and \n&gt; thoughts \n&gt; &gt; on what was really going on. \n&gt; &gt; \n&gt; &gt; I say n=\r\nothing yet they somehow can seem to hear my thoughts and \n&gt; start \n&gt; &gt; sayi=\r\nng little things to make me think even more. It was the most \n&gt; &gt; fluent co=\r\nnversation I had ever had. It was truly telepathic and \nwas \n&gt; &gt; on a level=\r\n I could never really explain even to myself. Then it \n&gt; &gt; really hit me an=\r\nd I said &quot;Demons&quot;. I tried to play something and \n&gt; got \n&gt; &gt; no response fo=\r\nr the first time ever on the sound file. I then \n&gt; started \n&gt; &gt; piecing it =\r\nall together from there and even though I wasn&#39;t a \n&gt; &gt; believer this makes=\r\n more sense then I could ever write down here \n&gt; and \n&gt; &gt; as a result I for=\r\never will be one now. \n&gt; &gt; \n&gt; &gt; They ask for me to now open the door and I =\r\nopen the small glass \n&gt; door \n&gt; &gt; on my CPU desk and they get really pissed=\r\n off, saying I tricked \n&gt; them. \n&gt; &gt; Then their voice changed to the most d=\r\nemonic, vile and disturbing \n&gt; &gt; voice I could ever put into words. I never=\r\n really thought of \ndoing \n&gt; &gt; that until that moment and I think it was se=\r\nen from them \nreaction, \n&gt; &gt; but it worked out quite nicely. I start saying=\r\n the our father \n&gt; prayer \n&gt; &gt; and I can hear the displeasure in them even =\r\nmore and \nheard &quot;that&#39;s \n&gt; it \n&gt; &gt; we are going in&quot;. I immediately took off=\r\n my headphones and ran to \n&gt; get \n&gt; &gt; a bible they never did as far as I ca=\r\nn tell, but I sat there all \n&gt; &gt; night with the bible in my hand praying. \n=\r\n&gt; &gt; \n&gt; &gt; I started calling people and my phone started cutting out, the \nbu=\r\nlb \n&gt; &gt; on the porch blew and my good friend&#39;s girlfriend called me to \nask=\r\n \n&gt; me \n&gt; &gt; for help because my friend was drunk and passed out. It sounded=\r\n \n&gt; like \n&gt; &gt; she was trying to flirt with me and I asked her how &quot;A&quot; night=\r\nclub \n&gt; was \n&gt; &gt; and she said good and then I said didn&#39;t you actually go t=\r\no &quot;B&quot; \n&gt; &gt; nightclub actually and she switches her story. I hang up and cal=\r\nl \n&gt; &gt; back with no answer. The time was only 1:10am and they never \nleave =\r\n\n&gt; &gt; until the clubs close so this was even odder. \n&gt; &gt; \n&gt; &gt; I sat there te=\r\nrrified most of the night praying, until I called \nmy \n&gt; &gt; brother who told=\r\n me that I have to stand up to them or I am \nfeeding \n&gt; &gt; into their fear. =\r\nHe like my mom has been involved in similar \nthings \n&gt; &gt; like this but afte=\r\nr talking to both of them, neither have on this \n&gt; &gt; level. But in a refres=\r\nhing breath after talking to them about \nthis, \n&gt; &gt; they did seem to believ=\r\ne me. But it wasnt unil I researched this \n&gt; &gt; issue and found out about EV=\r\nP and how it works, did I truly know \n&gt; that \n&gt; &gt; I wasnt becoming a lunati=\r\nc.\n&gt; &gt; \n&gt; &gt; That brings me to today and me being at my wits end. I swear on=\r\n \n&gt; &gt; everything this is all 100% true and I feel like I am crazy even \n&gt; &gt;=\r\n still. Even though I hear it from no one else and have a pretty \n&gt; good \n&gt;=\r\n &gt; circle of friends, not to mention that I still seem to do my job \n&gt; just=\r\n \n&gt; &gt; fine as well. I havent put on my headphones or heard any voices \n&gt; si=\r\nnce \n&gt; &gt; I tried to last listen to the recording, which was now 3 days \nago=\r\n. \n&gt; &gt; Does anyone have any help and guidance here, as this all has \nreally=\r\n \n&gt; &gt; destroyed my life. I deleted all the copies of the recording, \n&gt; exce=\r\npt \n&gt; &gt; for one hardcopy. I still have the original recorder with the \nfile=\r\n \n&gt; &gt; on, but I haven&#39;t tried to use the recording or recorder any \n&gt; furth=\r\ner, \n&gt; &gt; as I refuse to continue it without any guidance. I figure its \nbes=\r\nt \n&gt; to \n&gt; &gt; avoid them, like my brother said. Maybe someone can help me \n&gt;=\r\n &gt; understand all of this. Even if I have gotten rid of these \nthings \n&gt; &gt; =\r\nwhat does that say of B? I really spent a bunch of time making \nthis \n&gt; &gt; r=\r\neally need some genuine help from someone in the know. I know it \n&gt; &gt; sound=\r\ns crazy but please regard this all as true. I am new to this \n&gt; &gt; stuff and=\r\n will just stay away from it now, but some kind of \ninsight \n&gt; &gt; would be g=\r\nreat.\n&gt; &gt;\n&gt;\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n      \r\n--0-1835474487-1228364408=:6791\r\nContent-Type: text/html; charset=windows-1252\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;Wonderful!&nbsp;&nbsp;I try to keep in mind, =\r\nwhich is sometimes difficult in this line of work, that this is my realm, m=\r\ny home . . . It is up to me, or you, to decide what&nbsp;we let in or keep =\r\nout.&nbsp; I think it is really that simple.&nbsp; It has worked for me in =\r\nthis lifetime . . . best to you in your future endeavors . . . you will do =\r\ngood things . . .&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Wed, 12/3/08, chuck255 &lt;I&gt;&lt;chuck255@y=\r\nahoo.com&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D&quot;PADDING-LEFT: 5px; MAR=\r\nGIN-LEFT: 5px; BORDER-LEFT: rgb(16,16,255) 2px solid&quot;&gt;From: chuck255 &lt;ch=\r\nuck255@...&gt;&lt;BR&gt;Subject: [EVP-ITC] Re: Any insight on my life chang=\r\ning EVP experience?&lt;BR&gt;To: EVP-ITC@yahoogroups.com&lt;BR&gt;Date: Wednesday, Dece=\r\nmber 3, 2008, 8:29 PM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3Dyiv1783809314&gt;\n&lt;DIV id=3Dygrp-text&gt;=\r\n\n&lt;DIV&gt;Thank you for the reply, as I found it helpfull. Pranksters is &lt;BR&gt;de=\r\nfinately an understatement at best when I think about how I was had &lt;BR&gt;her=\r\ne for so long, but it strengthened my faith and taught me a ton. &lt;BR&gt;Do you=\r\n think if I would have really opened the door there would have &lt;BR&gt;been no =\r\nrepercussions? Thats really the only thing I question when it &lt;BR&gt;comes to =\r\nthe legitimacy of what they said. &lt;BR&gt;&lt;BR&gt;Extremely interesting citing I mi=\r\nght add on the book of Daniel.&lt;BR&gt;&lt;BR&gt;Thanks again!&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=\r\n=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot; target=3D_blank rel=3Dnofollow&gt;EVP-IT=\r\nC@yahoogroups .com&lt;/A&gt;, &quot;SUZANNE&quot; &lt;suzyq6819@. ..&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;=\r\n&gt; Wow! Pretty interesting story! First off, I am happy that you &lt;BR&gt;foun=\r\nd &lt;BR&gt;&gt; this forum. There are a few things you should know right away th=\r\nat &lt;BR&gt;&gt; might help you. There are many different views and analogies as=\r\n to &lt;BR&gt;&gt; what we hear during EVP sessions. It can be frightening at fir=\r\nst\n &lt;BR&gt;to &lt;BR&gt;&gt; hear the deep groveling voices that come across your re=\r\ncoder or &lt;BR&gt;voice &lt;BR&gt;&gt; mail. The first thing that you should understan=\r\nd is that just &lt;BR&gt;&gt; because a voice is frightening it is not neccesaril=\r\ny demonic or &lt;BR&gt;&gt; negative. Different realms or &#39;dimensions&#39; operate at=\r\n varied &lt;BR&gt;&gt; vibrations. What the human ear can discern is not neccesar=\r\nily what &lt;BR&gt;&gt; is being said. Next, you will come to understand that the=\r\nre is a &lt;BR&gt;lot &lt;BR&gt;&gt; out there we are not able to view with the human e=\r\nye. The world of &lt;BR&gt;&gt; EVP is full of tricksters and pranksters which wi=\r\nll eventually lead &lt;BR&gt;&gt; you to be quite discerning when listening to EV=\r\nP.&lt;BR&gt;&gt; &lt;BR&gt;&gt; My suggestion is that you empower yourself and take a s=\r\ntand the &lt;BR&gt;next &lt;BR&gt;&gt; time you encounter whatever it is that is making=\r\n contact with you. &lt;BR&gt;&gt; Protect yourself with meditation or prayer or w=\r\nith the light of &lt;BR&gt;&gt; whatever it is you believe in. Know . . . for\n ce=\r\nrtain that the &lt;BR&gt;&gt; universe will protect you if you believe it will, i=\r\nf you allow it &lt;BR&gt;to.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Bets of luck to you my friend.&lt;BR&gt;&=\r\ngt; &lt;BR&gt;&gt; Remember . . . Many will go back and forth and knowledge will =\r\n&lt;BR&gt;&gt; continue . . . The book of Daniel . . .&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; =\r\n&lt;BR&gt;&gt; &lt;BR&gt;&gt; --- In &lt;A href=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot; targe=\r\nt=3D_blank rel=3Dnofollow&gt;EVP-ITC@yahoogroups .com&lt;/A&gt;, &quot;chuck255&quot; &lt;chuc=\r\nk255@&gt; wrote:&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt; My name is Chuck and I stumbled =\r\nupon this site and its &lt;BR&gt;information &lt;BR&gt;&gt; &gt; while trying to figure=\r\n out what&#39;s going on in my crazy life. &lt;BR&gt;Before &lt;BR&gt;&gt; I &lt;BR&gt;&gt; &gt; =\r\nget into that let me explain a bit about myself. I am a male in &lt;BR&gt;&gt; hi=\r\ns &lt;BR&gt;&gt; &gt; 30&#39;s, who has Bachelors in Regional Development, with a min=\r\nor in &lt;BR&gt;&gt; &gt; Computer Science. I work at a respective power plant co=\r\nmpany &lt;BR&gt;within &lt;BR&gt;&gt; &gt; Arizona doing GIS Tech Work. I get drug\n tes=\r\nted at it on random &lt;BR&gt;&gt; &gt; occasion and I really only drink socially=\r\n, or on some holiday &lt;BR&gt;&gt; &gt; occasions. I have always been a logical =\r\nkind of thinker my whole &lt;BR&gt;&gt; life &lt;BR&gt;&gt; &gt; and never really had a=\r\nny &quot;belief&quot; in the paranormal, even though &lt;BR&gt;my &lt;BR&gt;&gt; &gt; mom and bro=\r\nther strongly do. &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; I feel so weird even trying t=\r\no explain this story because about a &lt;BR&gt;&gt; &gt; week ago I would have th=\r\nought of it as silly. About a year ago I &lt;BR&gt;&gt; met &lt;BR&gt;&gt; &gt; someone=\r\n else, who for now ill call B. I fell madly in love with &lt;BR&gt;her &lt;BR&gt;&gt; &=\r\ngt; and after a short time I was more than happy to have her come and &lt;BR&gt;&=\r\ngt; &gt; live with me at my new place. In some strange way I always felt &lt;B=\r\nR&gt;as &lt;BR&gt;&gt; if &lt;BR&gt;&gt; &gt; there was something about B I could never qu=\r\nite understand. After &lt;BR&gt;&gt; &gt; about 3-4 months of living with her I s=\r\ntarted to get the &lt;BR&gt;&gt; inclination &lt;BR&gt;&gt; &gt; that B was\n cheating o=\r\nn me. Her stories never added up, her job &lt;BR&gt;was &lt;BR&gt;&gt; &gt; secretive a=\r\nnd she started stumbling on her words a lot. &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; I =\r\nthen started getting spy gadgets, because she was staying with &lt;BR&gt;me &lt;BR&gt;&=\r\ngt; &gt; and I was concerned about my place along with her activities &lt;BR&gt;t=\r\nhere. &lt;BR&gt;&gt; I &lt;BR&gt;&gt; &gt; at first just got a digital recorder, but th=\r\nen after time I &lt;BR&gt;started &lt;BR&gt;&gt; &gt; to get aggravated and felt that t=\r\nhe digital recordings were just &lt;BR&gt;&gt; &gt; being used to play and taunt =\r\nme. So then I went to the extent of &lt;BR&gt;&gt; &gt; getting Cameras and even =\r\nCamcorders. Whenever I would ask about &lt;BR&gt;&gt; &gt; something peculiar, I =\r\ngot tears and a really heartfelt reaction &lt;BR&gt;&gt; that &lt;BR&gt;&gt; &gt; reall=\r\ny made me believe her. I felt like we really loved one &lt;BR&gt;another &lt;BR&gt;&gt;=\r\n &gt; and I could really see some care in her eyes, so most of the time &lt;BR=\r\n&gt;I &lt;BR&gt;&gt; &gt; just gave in to what she said as true,\n but didnt have eno=\r\nugh to &lt;BR&gt;&gt; stop &lt;BR&gt;&gt; &gt; looking. I felt like I had been in enoug=\r\nh relationships to know &lt;BR&gt;the &lt;BR&gt;&gt; &gt; difference here. I have seen =\r\nthe act before and it really didn&#39;t &lt;BR&gt;&gt; look &lt;BR&gt;&gt; &gt; that way he=\r\nre, unless she was just really that good at fooling &lt;BR&gt;&gt; &gt; people. &lt;=\r\nBR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; During the course of our stay there she would pi=\r\ntch a huge fit if &lt;BR&gt;I &lt;BR&gt;&gt; &gt; had to leave her at the apartment alo=\r\nne and would stop at nothing &lt;BR&gt;&gt; to &lt;BR&gt;&gt; &gt; try and be in my com=\r\npany instead. But I started to get aggravated &lt;BR&gt;&gt; as &lt;BR&gt;&gt; &gt; tim=\r\ne progressed and knew something was up, because of the odd &lt;BR&gt;&gt; voices =\r\n&lt;BR&gt;&gt; &gt; I would hear within the recordings. I made her stay there wil=\r\nl &lt;BR&gt;&gt; trying &lt;BR&gt;&gt; &gt; to sneak back and see who was messing with =\r\nher around my place. I &lt;BR&gt;&gt; &gt; lost it because I couldn&#39;t pinpoint it=\r\n at all and last July and &lt;BR&gt;got &lt;BR&gt;&gt; &gt;\n into a fight right outside=\r\n of my place with three other people. &lt;BR&gt;She &lt;BR&gt;&gt; &gt; always told me =\r\nshe talked to her self when I qestioned other &lt;BR&gt;voices &lt;BR&gt;&gt; &gt; and =\r\nI never could see anyone else there when she did, even with &lt;BR&gt;the &lt;BR&gt;&gt=\r\n; &gt; cameras, so I had no choice but to continue on believeing her &lt;BR&gt;&g=\r\nt; still=85=85&lt;BR&gt;&gt; &gt; even though my feelings wouldn&#39;t agree to her w=\r\nords. &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; For some odd reason it just seemed as if =\r\nshe knew where the &lt;BR&gt;cameras &lt;BR&gt;&gt; &gt; and recorders were every time,=\r\n just by the way she would exit and &lt;BR&gt;&gt; &gt; enter the apartment. So t=\r\nhen I started putting them outside and &lt;BR&gt;&gt; about &lt;BR&gt;&gt; &gt; a month=\r\n ago something crazy happened. I started listening to a &lt;BR&gt;&gt; &gt; digit=\r\nal recording and at the beginning of it I flat out heard B &lt;BR&gt;&gt; &gt; ch=\r\neating on me with someone. I was upset and happy at the same &lt;BR&gt;time &lt;BR&gt;&=\r\ngt; &gt; that I finally had caught it and\n as a result I sent her away. She=\r\n &lt;BR&gt;&gt; &gt; left town because all her family was in another city. She &lt;B=\r\nR&gt;couldn&#39;t &lt;BR&gt;&gt; &gt; stop crying and was hysterical, especially when sh=\r\ne saw I was &lt;BR&gt;&gt; &gt; devastated too. I thought that I had finally gott=\r\nen my answers &lt;BR&gt;and &lt;BR&gt;&gt; &gt; she was just the best actress I had eve=\r\nr known, end of story. She &lt;BR&gt;&gt; &gt; tried to kill herself a couple of =\r\ntimes while this was going on a &lt;BR&gt;&gt; &gt; couple months back. If it was=\r\n as an act or not, I really just &lt;BR&gt;don&#39;t &lt;BR&gt;&gt; &gt; know. But when she=\r\n left last she left a note telling me not to &lt;BR&gt;let &lt;BR&gt;&gt; &gt; her die =\r\nand she hopes that I find her soon before her heart &lt;BR&gt;&gt; stopped. &lt;BR&gt;&=\r\ngt; &gt; Me=85..I said more BS and threw the note in the garbage. &lt;BR&gt;&gt; =\r\n&gt; &lt;BR&gt;&gt; &gt; A couple of day&#39;s later curiosity got the best of me and=\r\n I &lt;BR&gt;started &lt;BR&gt;&gt; &gt; listening to the rest of the recording. I then=\r\n started to hear &lt;BR&gt;what &lt;BR&gt;&gt;\n &gt; sounded like people monitoring ME =\r\nand calling me a &quot;Threat&quot;. I &lt;BR&gt;&gt; &gt; immediately start acting alarmed=\r\n. Then in the recording I hear B &lt;BR&gt;&gt; exit &lt;BR&gt;&gt; &gt; the apartment =\r\nin disgust after I stormed off that night, as we &lt;BR&gt;were &lt;BR&gt;&gt; &gt; fig=\r\nhting about something weird yet again. After I had left she &lt;BR&gt;&gt; &gt; s=\r\ntarted talking about setting up a &quot;Private Meeting&quot; with some &lt;BR&gt;&gt; othe=\r\nr &lt;BR&gt;&gt; &gt; people and something about boating. Well during the beginni=\r\nng of &lt;BR&gt;&gt; this &lt;BR&gt;&gt; &gt; meeting I heard a reference to a crazy ac=\r\ncusation that I had made &lt;BR&gt;&gt; at &lt;BR&gt;&gt; &gt; B awhile ago, which to m=\r\ne at the time confirmed she was in the &lt;BR&gt;&gt; Mafia. &lt;BR&gt;&gt; &gt; That e=\r\nxplained all the weirdness to me and during this meeting &lt;BR&gt;the &lt;BR&gt;&gt; &=\r\ngt; voices changed a bunch as if they sounded &quot;Masked&quot; &lt;BR&gt;or &quot;Disguised&quot;, =\r\n&lt;BR&gt;&gt; so &lt;BR&gt;&gt; &gt; I really had to amp up the volume. &lt;BR&gt;&gt; &gt; =\r\n&lt;BR&gt;&gt; &gt; The next day\n and every day after from this point on I amped =\r\nup &lt;BR&gt;the &lt;BR&gt;&gt; &gt; volume in the recording. I also had to distinguish=\r\n the masked &lt;BR&gt;voice &lt;BR&gt;&gt; &gt; by breaking the large file into smaller=\r\n segments of two to four &lt;BR&gt;&gt; &gt; second intervals, in order to piece =\r\nthe entire recordings meaning &lt;BR&gt;&gt; &gt; together. Over time I started t=\r\no interpret the masked voices &lt;BR&gt;better &lt;BR&gt;&gt; &gt; because I thought I =\r\nwas tuning my ears better to them. The voices &lt;BR&gt;&gt; in &lt;BR&gt;&gt; &gt; the=\r\nse recordings were two different males, B and some other &lt;BR&gt;female. &lt;BR&gt;&g=\r\nt; I &lt;BR&gt;&gt; &gt; later on saw in the recording that they had actually see=\r\nn the &lt;BR&gt;&gt; &gt; recording but weren&#39;t taking it, which was EXTREMELY od=\r\nd to me &lt;BR&gt;&gt; &gt; considering they had been caught. Why not destroy the=\r\n evidence? &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; Then I heard one of the males say th=\r\nat he was the &quot;Boss of the &lt;BR&gt;&gt; &gt; Southwest Mafia&quot; and that I was go=\r\ning to pay for\n hurting B like &lt;BR&gt;&gt; this. &lt;BR&gt;&gt; &gt; He also said th=\r\nat my being a nuisance in the apartment had messed &lt;BR&gt;&gt; up &lt;BR&gt;&gt; &gt=\r\n; his business within the area and all my spy stuff had really &lt;BR&gt;pissed &lt;=\r\nBR&gt;&gt; &gt; him off. He told me I was dead, my daughter along with me and =\r\n&lt;BR&gt;more &lt;BR&gt;&gt; &gt; than likely my whole family as well. &lt;BR&gt;&gt; &gt; &lt;=\r\nBR&gt;&gt; &gt; He knew where my mom and dad lived and some information I didn=\r\n&#39;t &lt;BR&gt;&gt; even &lt;BR&gt;&gt; &gt; tell B. I freak out and figure the damn mob =\r\nis after me. I keep &lt;BR&gt;&gt; &gt; listening and he says &quot;If I don&#39;t move aw=\r\nay and discontinue my &lt;BR&gt;&gt; &gt; interactions with my daughter by Decemb=\r\ner 5th, that he would know &lt;BR&gt;&gt; &gt; that I was just playing with B and=\r\n then my whole family is dead&quot;. &lt;BR&gt;&gt; &gt; This was exactly one month fr=\r\nom when I had used the recording &lt;BR&gt;&gt; device &lt;BR&gt;&gt; &gt; too by the w=\r\nay. I moved out and away from my daughter breaking &lt;BR&gt;the &lt;BR&gt;&gt; &gt; ti=\r\ne and in\n tears the whole time too because I couldnt explain &lt;BR&gt;why. &lt;BR&gt;&=\r\ngt; I &lt;BR&gt;&gt; &gt; really did it because I feared for their lives of my fa=\r\nmily and &lt;BR&gt;&gt; felt &lt;BR&gt;&gt; &gt; that we would all die if f I didnt. &lt;B=\r\nR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; Meanwhile B and met someone else that ill name J =\r\nfor now. After &lt;BR&gt;&gt; &gt; knowing him for two days she decided to bring =\r\nhim back with her &lt;BR&gt;to &lt;BR&gt;&gt; &gt; pick up her things out of the apartm=\r\nent. I was kicking her out of &lt;BR&gt;&gt; it &lt;BR&gt;&gt; &gt; by the way. I thoug=\r\nht it was just to piss me off and I forgot &lt;BR&gt;about &lt;BR&gt;&gt; &gt; it. Then=\r\n I heard as I progressed in the recording J&#39;s name &lt;BR&gt;brought &lt;BR&gt;&gt; &gt=\r\n; up. Supposedly they knew him and he was in their mob and I needed &lt;BR&gt;&gt=\r\n; to &lt;BR&gt;&gt; &gt; go attack him to prove myself, or else B will never be s=\r\neen from &lt;BR&gt;me &lt;BR&gt;&gt; &gt; again. I also hear that I can&#39;t go to certain=\r\n places at certain &lt;BR&gt;&gt; times &lt;BR&gt;&gt; &gt; where B might be and\n furth=\r\nermore think that they didnt take the &lt;BR&gt;&gt; &gt; recorder because the da=\r\nmn thing has to be planned down to the &lt;BR&gt;times &lt;BR&gt;&gt; I &lt;BR&gt;&gt; &gt; w=\r\nould hear it. &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; At this time I am in fear for my =\r\nlife and my families, lost my &lt;BR&gt;love &lt;BR&gt;&gt; &gt; and I am not understan=\r\nding how the recording is so damn well time &lt;BR&gt;&gt; &gt; planned, figured =\r\nim going crazy. Then something ill never forget &lt;BR&gt;&gt; &gt; happens. I am=\r\n spoken directly too and I figure its me going of &lt;BR&gt;the &lt;BR&gt;&gt; &gt; dee=\r\np end now. I try and test my sanity and go to different parts &lt;BR&gt;of &lt;BR&gt;&g=\r\nt; &gt; the recording only to get the same thing kind of direct question. &lt;=\r\nBR&gt;I &lt;BR&gt;&gt; &gt; am in disarray at this point! I stand up and walk around=\r\n, trying &lt;BR&gt;to &lt;BR&gt;&gt; &gt; figure out just what the hell is going on wit=\r\nh me. I get back on &lt;BR&gt;&gt; and &lt;BR&gt;&gt; &gt; further see that my verbal q=\r\nuestions are now being answered &lt;BR&gt;&gt; instantly &lt;BR&gt;&gt;\n &gt; by this r=\r\necording (Which is merely a sound file on the pc). *I &lt;BR&gt;was &lt;BR&gt;&gt; &gt;=\r\n using Sound Forge by the way if anyone wanted to know what sound &lt;BR&gt;&gt; =\r\n&gt; software I was using was*.&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; I have so little=\r\n sleep at this point and I am told that I need to &lt;BR&gt;&gt; do &lt;BR&gt;&gt; &gt;=\r\n all this crazy stuff and drive out to the middle of some hotel &lt;BR&gt;&gt; ri=\r\nght &lt;BR&gt;&gt; &gt; then and there, to further see them, as I have passed all=\r\n their &lt;BR&gt;&gt; tests &lt;BR&gt;&gt; &gt; to get into their mafia now. As a rewar=\r\nd B would be there waiting &lt;BR&gt;&gt; for &lt;BR&gt;&gt; &gt; me too. I hurry to do=\r\n it and rush there but no one is even their &lt;BR&gt;to &lt;BR&gt;&gt; &gt; answer the=\r\n door. I go back and get a yelling voice at me that I &lt;BR&gt;had &lt;BR&gt;&gt; &gt;=\r\n left to early and immediatly go back. Me not wanting to piss the &lt;BR&gt;&gt; =\r\nmob &lt;BR&gt;&gt; &gt; boss anymore, I take the 45 minute trip again and go back=\r\n. But &lt;BR&gt;when &lt;BR&gt;&gt; I &lt;BR&gt;&gt; &gt; get there it\n just didn&#39;t feel righ=\r\nt to me and I never exited the &lt;BR&gt;&gt; car, &lt;BR&gt;&gt; &gt; especially when =\r\nI saw the numbers in vehicles hadnt changed in &lt;BR&gt;the &lt;BR&gt;&gt; &gt; parkin=\r\ng lot. I had plenty reason to be paranoid at this point and &lt;BR&gt;&gt; &gt; t=\r\nruly felt in danger.I left and thought I was done for when I got &lt;BR&gt;&gt; &=\r\ngt; back. Instead, he tells me that he was impressed by my decision &lt;BR&gt;&gt=\r\n; when &lt;BR&gt;&gt; &gt; and literally puts me in tears when he said that becau=\r\nse of my &lt;BR&gt;&gt; &gt; intelligence, I had won my families lives back, but =\r\nnot my own &lt;BR&gt;&gt; yet. &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; All this is done by hi=\r\nm also telling me that he can physically &lt;BR&gt;see &lt;BR&gt;&gt; me &lt;BR&gt;&gt; &gt; =\r\nthrough his advanced mafia technology on the computer monitor. He &lt;BR&gt;&gt; =\r\n&gt; also tells me to to move things around on my compter desk that &lt;BR&gt;wer=\r\ne &lt;BR&gt;&gt; &gt; between the sight of me and the computer monitor, while dem=\r\nanding &lt;BR&gt;I &lt;BR&gt;&gt; &gt; correct my posture\n when speaking to him. He als=\r\no states that he &lt;BR&gt;is &lt;BR&gt;&gt; &gt; watching my every move and if I tell =\r\nanyone anything they die &lt;BR&gt;along &lt;BR&gt;&gt; &gt; with me. &lt;BR&gt;&gt; &gt; &lt;BR=\r\n&gt;&gt; &gt; I make no sense of this and I was completely baffled on how I wa=\r\ns &lt;BR&gt;&gt; &gt; being communicated with. I had just moved and there was no =\r\n&lt;BR&gt;internet &lt;BR&gt;&gt; &gt; connection even. Me just being happy my family i=\r\ns safe, I decide &lt;BR&gt;to &lt;BR&gt;&gt; &gt; go to sleep. Feeling as though I am n=\r\now sleep deprived and going &lt;BR&gt;&gt; &gt; crazy from the stress, I go to sl=\r\neep for two days consistently, &lt;BR&gt;as &lt;BR&gt;&gt; &gt; this was during the Tha=\r\nnksgiving holiday time. I would purposely &lt;BR&gt;&gt; make &lt;BR&gt;&gt; &gt; mysel=\r\nf sleep longer when I woke to ensure I didn&#39;t belong in the &lt;BR&gt;&gt; &gt; l=\r\noony bin. &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; When I finally woke up I was determin=\r\ned to find an explanation to &lt;BR&gt;&gt; how &lt;BR&gt;&gt; &gt; they were talking t=\r\no me, I go to the library and look into\n &lt;BR&gt;&gt; Bluetooth &lt;BR&gt;&gt; &gt; t=\r\nechnology, telephony, and remoting into a computer=85..anything. &lt;BR&gt;&gt; T=\r\nhen &lt;BR&gt;&gt; &gt; I realize=85=85..that I can find out just how crazy I rea=\r\nlly am by &lt;BR&gt;&gt; moving &lt;BR&gt;&gt; &gt; the recording and listening to it e=\r\nlsewhere. I then decide to &lt;BR&gt;take &lt;BR&gt;&gt; &gt; the same recording into m=\r\ny work to test my saneness, along with &lt;BR&gt;the &lt;BR&gt;&gt; &gt; file itself. I=\r\nf its was on my home CPU=85.then it&#39;s going to now be &lt;BR&gt;&gt; at &lt;BR&gt;&gt; =\r\n&gt; my work one too right? I do and get the same damn thing, not to &lt;BR&gt;&g=\r\nt; &gt; mention that the &quot;Mob Boss&quot; now has company two others when I &lt;BR&gt;s=\r\npeak &lt;BR&gt;&gt; &gt; to him. All of them yelling at me for moving their sensi=\r\nve &lt;BR&gt;&gt; &gt; information. &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; During this time =\r\nI invest in GPS, GSM, 3G and several signal &lt;BR&gt;&gt; blocking &lt;BR&gt;&gt; &gt;=\r\n devices, in order to prohibit myself from being tracked any &lt;BR&gt;&gt; furth=\r\ner. &lt;BR&gt;&gt; &gt; They never\n worked or even phased the &quot;Mob Boss&quot;. But I w=\r\nould &lt;BR&gt;still &lt;BR&gt;&gt; &gt; check the recording in the evening just to hea=\r\nr what I needed to &lt;BR&gt;do &lt;BR&gt;&gt; &gt; in order to be making them happy an=\r\nd get the possibility to see B &lt;BR&gt;&gt; &gt; again. The &quot;Mob Boss&quot; had told=\r\n me that it was all just a test for &lt;BR&gt;&gt; me &lt;BR&gt;&gt; &gt; to see if I l=\r\noved her and she never really did do anything. They &lt;BR&gt;&gt; &gt; continue =\r\nto tell me over and over that I have to beat up J in &lt;BR&gt;order &lt;BR&gt;&gt; &gt=\r\n; to prove myself to B. That this is what everyone is really &lt;BR&gt;waiting &lt;B=\r\nR&gt;&gt; on &lt;BR&gt;&gt; &gt; and if I would just go up to the other town and get=\r\n it over with, &lt;BR&gt;&gt; &gt; then I can bring her back with me. I won&#39;t do =\r\nit and say that I &lt;BR&gt;&gt; won&#39;t &lt;BR&gt;&gt; &gt; fight for anything that does=\r\nn&#39;t want to be fought for. Basically &lt;BR&gt;&gt; &gt; saying that B can call m=\r\ne about it if she really wants it. Then &lt;BR&gt;as &lt;BR&gt;&gt; a &lt;BR&gt;&gt; &gt; res=\r\nult they start\n threatening my family again. At this point, I &lt;BR&gt;&gt; &gt;=\r\n really can&#39;t even express to you how much of a wreck I am. But I &lt;BR&gt;&gt; =\r\nfelt &lt;BR&gt;&gt; &gt; like I needed to be strong for my family and get on the =\r\nmob&#39;s &lt;BR&gt;good &lt;BR&gt;&gt; &gt; side so I can fix the mess I created.&lt;BR&gt;&gt; =\r\n&gt; &lt;BR&gt;&gt; &gt; Well it never really happened and this torment went on f=\r\nor a good &lt;BR&gt;&gt; &gt; week, while I was moving everything I could as fast=\r\n as I could in &lt;BR&gt;&gt; &gt; order to make their deadline and save everyone=\r\n. Everyday I would &lt;BR&gt;do &lt;BR&gt;&gt; &gt; what I thought was expected of me a=\r\nnd hope it wouldnt make them &lt;BR&gt;mad &lt;BR&gt;&gt; &gt; in one breath, while in =\r\nthe other breath win back my complete &lt;BR&gt;&gt; &gt; freedom, away from thei=\r\nr bad side. No matter where I was or what &lt;BR&gt;I &lt;BR&gt;&gt; &gt; did during th=\r\ne day they usually seemed to know about it when I &lt;BR&gt;&gt; talked &lt;BR&gt;&gt; =\r\n&gt; to them in the evening. It really bothered me that I couldnt find &lt;BR&gt;=\r\n&gt; out\n &lt;BR&gt;&gt; &gt; where they were putting the &quot;bugs&quot;, or even better =\r\nhow they were &lt;BR&gt;&gt; &gt; doing all of it. My inability to &quot;believe&quot; in t=\r\nhe paranormal &lt;BR&gt;really &lt;BR&gt;&gt; &gt; hurt me here.&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; =\r\n&gt; Since the apartment that B and I had used was empty at this time &lt;BR&gt;&=\r\ngt; and &lt;BR&gt;&gt; &gt; a friend of mine was down on his luck, I gave him the=\r\n apartment &lt;BR&gt;for &lt;BR&gt;&gt; &gt; free until the lease was completely up. Af=\r\nter about a week of me &lt;BR&gt;&gt; &gt; doing this, I walked in and found guns=\r\n and ammo everywhere and &lt;BR&gt;&gt; &gt; freaked the hell out. That&#39;s the las=\r\nt thing I needed when I &lt;BR&gt;thought &lt;BR&gt;&gt; &gt; the mob was just down the=\r\n street! I made everyone there except my &lt;BR&gt;&gt; &gt; friend leave, with q=\r\nuite a fuss I might add. Then I headed back &lt;BR&gt;to &lt;BR&gt;&gt; my &lt;BR&gt;&gt; &gt=\r\n; home to see how the mob felt about what I did, assure they would &lt;BR&gt;be &lt;=\r\nBR&gt;&gt; &gt; impressed that I had looked out for them. Instead the regular\n=\r\n &lt;BR&gt;&gt; female &lt;BR&gt;&gt; &gt; that was always with the &quot;Mob Boss&quot; now aske=\r\nd me why I didn&#39;t &lt;BR&gt;&gt; finish &lt;BR&gt;&gt; &gt; the job, stating that there=\r\n was still someone there and it made &lt;BR&gt;&gt; them &lt;BR&gt;&gt; &gt; all angry.=\r\n They demanded that I go back especially to see just &lt;BR&gt;&gt; how &quot;I &lt;BR&gt;&g=\r\nt; &gt; finished it&quot;. &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; So like the puppet I was =\r\nat that time, I went back. I didn&#39;t have &lt;BR&gt;&gt; the &lt;BR&gt;&gt; &gt; heart t=\r\no put him on the street, even though he had put me at a &lt;BR&gt;&gt; major &lt;BR&gt;=\r\n&gt; &gt; risk and instead I just found another place for him to stay. On &lt;=\r\nBR&gt;the &lt;BR&gt;&gt; &gt; way there I bought him some water and some smokes. Whe=\r\nn we got &lt;BR&gt;&gt; there &lt;BR&gt;&gt; &gt; I even helped him move in and explain=\r\ned that it wasn&#39;t me that &lt;BR&gt;did &lt;BR&gt;&gt; &gt; it, but the leasing office =\r\nhad saw all the guns. As a result they &lt;BR&gt;&gt; had &lt;BR&gt;&gt; &gt; made me d=\r\no it. I thought he made a poor decision and I knew he &lt;BR&gt;saw\n &lt;BR&gt;&gt; &gt=\r\n; the same, not to mention I kind of felt bad that I had to do all &lt;BR&gt;of &lt;=\r\nBR&gt;&gt; &gt; this to him at 11:30PM. I truly didnt want to make his life a =\r\n&lt;BR&gt;&gt; &gt; complete hell any more than it already was and he felt better=\r\n &lt;BR&gt;that &lt;BR&gt;&gt; I &lt;BR&gt;&gt; &gt; had talked to him, so as a result I did =\r\nas well. I then left and &lt;BR&gt;&gt; once &lt;BR&gt;&gt; &gt; again headed back home=\r\n. &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; Certain that I was going to get good praises;=\r\n I sat at the PC &lt;BR&gt;again &lt;BR&gt;&gt; &gt; only to immediately get yelled at.=\r\n They asked me why I was &quot;so &lt;BR&gt;&gt; good&quot; &lt;BR&gt;&gt; &gt; and that they had=\r\n absolutely no respect for me. I tell them I &lt;BR&gt;just &lt;BR&gt;&gt; &gt; did all=\r\n of that for them and they say that I always do &lt;BR&gt;things &quot;the &lt;BR&gt;&gt; &g=\r\nt; right way&quot; and they hate me for it. This is where I think I hit &lt;BR&gt;the =\r\n&lt;BR&gt;&gt; &gt; loony bin and just didnt see how I was going to fix this prob=\r\nlem. &lt;BR&gt;&gt; &gt; Then it got worse and saw that my\n thoughts were now bei=\r\nng &lt;BR&gt;&gt; &gt; communicated back to me. Then I knew it and was convinced =\r\nI was &lt;BR&gt;&gt; going &lt;BR&gt;&gt; &gt; skitzo and that i was just truly arguing=\r\n with myself in reality, &lt;BR&gt;&gt; &gt; especially when I saw I wasn&#39;t even =\r\nspeaking. I used the &lt;BR&gt;restroom, &lt;BR&gt;&gt; &gt; splash water on my face an=\r\nd faintly start to hear the same mob &lt;BR&gt;&gt; people &lt;BR&gt;&gt; &gt; in my fa=\r\nn motor in the bathroom. I haven&#39;t drank, done any drugs &lt;BR&gt;&gt; &gt; (eve=\r\nn prescription) and have a pretty complex job which I can &lt;BR&gt;still &lt;BR&gt;&gt=\r\n; &gt; handle, but yet I feel like I am going crazy. &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt;=\r\n &gt; I can&#39;t talk to anyone about it so I sit back at the CPU, only to &lt;BR=\r\n&gt;&gt; &gt; hear that I need to open up the front door. Screw that!=85I just=\r\n &lt;BR&gt;look &lt;BR&gt;&gt; &gt; out the window and see nothing and say no way. They=\r\n ask why not &lt;BR&gt;and &lt;BR&gt;&gt; &gt; that I should trust them and I say hell =\r\nno and I continue to &lt;BR&gt;&gt; &gt; hear &quot;God\n Damnit&quot; from them when they g=\r\net mad. They continue to &lt;BR&gt;ask &lt;BR&gt;&gt; &gt; me to open the door and I co=\r\nntinue to check the window to see &lt;BR&gt;&gt; &gt; nothing. I say to knock the=\r\nn and they get mad and say they have &lt;BR&gt;no &lt;BR&gt;&gt; &gt; hands. They don&#39;t=\r\n sound like they are joking and get mad when I &lt;BR&gt;&gt; laugh &lt;BR&gt;&gt; &gt;=\r\n even, so I continue to think I am just crazy at this point. I &lt;BR&gt;asked &lt;B=\r\nR&gt;&gt; &gt; why they wanted to come in and they said they wanted to fix me.=\r\n I &lt;BR&gt;&gt; say &lt;BR&gt;&gt; &gt; there is nothing wrong with me and they say t=\r\nhey hate me and want &lt;BR&gt;&gt; to &lt;BR&gt;&gt; &gt; eat me.&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt=\r\n; &gt; I start to really think about this and say ill open the door if I &lt;B=\r\nR&gt;&gt; get &lt;BR&gt;&gt; &gt; the answers to all this. They start saying things =\r\nand its if as &lt;BR&gt;&gt; &gt; though they see my thought process develop and =\r\nsay things &lt;BR&gt;&gt; like=85&quot;watch &lt;BR&gt;&gt; &gt; him go&quot;. Then I hear out of=\r\n my computer monitor something I\n &lt;BR&gt;couldnt &lt;BR&gt;&gt; &gt; even fathom. I =\r\nhear my ex-wife&#39;s ex-best friends voice. His name &lt;BR&gt;&gt; was &lt;BR&gt;&gt; &gt=\r\n; Daniel and he had committed suicide over 5 years ago. I did know &lt;BR&gt;&gt;=\r\n him, &lt;BR&gt;&gt; &gt; but not as well as she had. It WAS his voice and he sai=\r\nd &quot;Charles &lt;BR&gt;&gt; its &lt;BR&gt;&gt; &gt; Daniel&quot; and then I heard their voice =\r\nagain say we are &quot;down here &lt;BR&gt;&gt; with &lt;BR&gt;&gt; &gt; him&quot;. At this point=\r\n I didnt know really what to think, but this &lt;BR&gt;&gt; part &lt;BR&gt;&gt; &gt; in=\r\n our conversation was the turning point on my beliefs and &lt;BR&gt;&gt; thoughts=\r\n &lt;BR&gt;&gt; &gt; on what was really going on. &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; I s=\r\nay nothing yet they somehow can seem to hear my thoughts and &lt;BR&gt;&gt; start=\r\n &lt;BR&gt;&gt; &gt; saying little things to make me think even more. It was the =\r\nmost &lt;BR&gt;&gt; &gt; fluent conversation I had ever had. It was truly telepat=\r\nhic and &lt;BR&gt;was &lt;BR&gt;&gt; &gt; on a level I could never really explain even =\r\nto myself. Then it\n &lt;BR&gt;&gt; &gt; really hit me and I said &quot;Demons&quot;. I trie=\r\nd to play something and &lt;BR&gt;&gt; got &lt;BR&gt;&gt; &gt; no response for the firs=\r\nt time ever on the sound file. I then &lt;BR&gt;&gt; started &lt;BR&gt;&gt; &gt; piecin=\r\ng it all together from there and even though I wasn&#39;t a &lt;BR&gt;&gt; &gt; belie=\r\nver this makes more sense then I could ever write down here &lt;BR&gt;&gt; and &lt;B=\r\nR&gt;&gt; &gt; as a result I forever will be one now. &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &=\r\ngt; They ask for me to now open the door and I open the small glass &lt;BR&gt;&gt=\r\n; door &lt;BR&gt;&gt; &gt; on my CPU desk and they get really pissed off, saying =\r\nI tricked &lt;BR&gt;&gt; them. &lt;BR&gt;&gt; &gt; Then their voice changed to the most=\r\n demonic, vile and disturbing &lt;BR&gt;&gt; &gt; voice I could ever put into wor=\r\nds. I never really thought of &lt;BR&gt;doing &lt;BR&gt;&gt; &gt; that until that momen=\r\nt and I think it was seen from them &lt;BR&gt;reaction, &lt;BR&gt;&gt; &gt; but it work=\r\ned out quite nicely. I start saying the our father &lt;BR&gt;&gt; prayer &lt;BR&gt;&gt;=\r\n &gt; and I\n can hear the displeasure in them even more and &lt;BR&gt;heard &quot;that=\r\n&#39;s &lt;BR&gt;&gt; it &lt;BR&gt;&gt; &gt; we are going in&quot;. I immediately took off my he=\r\nadphones and ran to &lt;BR&gt;&gt; get &lt;BR&gt;&gt; &gt; a bible they never did as fa=\r\nr as I can tell, but I sat there all &lt;BR&gt;&gt; &gt; night with the bible in =\r\nmy hand praying. &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; I started calling people and m=\r\ny phone started cutting out, the &lt;BR&gt;bulb &lt;BR&gt;&gt; &gt; on the porch blew a=\r\nnd my good friend&#39;s girlfriend called me to &lt;BR&gt;ask &lt;BR&gt;&gt; me &lt;BR&gt;&gt; &g=\r\nt; for help because my friend was drunk and passed out. It sounded &lt;BR&gt;&gt;=\r\n like &lt;BR&gt;&gt; &gt; she was trying to flirt with me and I asked her how &quot;A&quot;=\r\n nightclub &lt;BR&gt;&gt; was &lt;BR&gt;&gt; &gt; and she said good and then I said did=\r\nn&#39;t you actually go to &quot;B&quot; &lt;BR&gt;&gt; &gt; nightclub actually and she switche=\r\ns her story. I hang up and call &lt;BR&gt;&gt; &gt; back with no answer. The time=\r\n was only 1:10am and they never &lt;BR&gt;leave &lt;BR&gt;&gt; &gt; until the clubs clo=\r\nse so\n this was even odder. &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; I sat there terrifi=\r\ned most of the night praying, until I called &lt;BR&gt;my &lt;BR&gt;&gt; &gt; brother w=\r\nho told me that I have to stand up to them or I am &lt;BR&gt;feeding &lt;BR&gt;&gt; &gt=\r\n; into their fear. He like my mom has been involved in similar &lt;BR&gt;things &lt;=\r\nBR&gt;&gt; &gt; like this but after talking to both of them, neither have on t=\r\nhis &lt;BR&gt;&gt; &gt; level. But in a refreshing breath after talking to them a=\r\nbout &lt;BR&gt;this, &lt;BR&gt;&gt; &gt; they did seem to believe me. But it wasnt unil=\r\n I researched this &lt;BR&gt;&gt; &gt; issue and found out about EVP and how it w=\r\norks, did I truly know &lt;BR&gt;&gt; that &lt;BR&gt;&gt; &gt; I wasnt becoming a lunat=\r\nic.&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; That brings me to today and me being at my w=\r\nits end. I swear on &lt;BR&gt;&gt; &gt; everything this is all 100% true and I fe=\r\nel like I am crazy even &lt;BR&gt;&gt; &gt; still. Even though I hear it from no =\r\none else and have a pretty &lt;BR&gt;&gt; good &lt;BR&gt;&gt; &gt; circle of friends,\n =\r\nnot to mention that I still seem to do my job &lt;BR&gt;&gt; just &lt;BR&gt;&gt; &gt; f=\r\nine as well. I havent put on my headphones or heard any voices &lt;BR&gt;&gt; sin=\r\nce &lt;BR&gt;&gt; &gt; I tried to last listen to the recording, which was now 3 d=\r\nays &lt;BR&gt;ago. &lt;BR&gt;&gt; &gt; Does anyone have any help and guidance here, as =\r\nthis all has &lt;BR&gt;really &lt;BR&gt;&gt; &gt; destroyed my life. I deleted all the =\r\ncopies of the recording, &lt;BR&gt;&gt; except &lt;BR&gt;&gt; &gt; for one hardcopy. I =\r\nstill have the original recorder with the &lt;BR&gt;file &lt;BR&gt;&gt; &gt; on, but I =\r\nhaven&#39;t tried to use the recording or recorder any &lt;BR&gt;&gt; further, &lt;BR&gt;&g=\r\nt; &gt; as I refuse to continue it without any guidance. I figure its &lt;BR&gt;b=\r\nest &lt;BR&gt;&gt; to &lt;BR&gt;&gt; &gt; avoid them, like my brother said. Maybe someo=\r\nne can help me &lt;BR&gt;&gt; &gt; understand all of this. Even if I have gotten =\r\nrid of these &lt;BR&gt;things &lt;BR&gt;&gt; &gt; what does that say of B? I really spe=\r\nnt a bunch of time making &lt;BR&gt;this &lt;BR&gt;&gt; &gt; really need some\n genuine =\r\nhelp from someone in the know. I know it &lt;BR&gt;&gt; &gt; sounds crazy but ple=\r\nase regard this all as true. I am new to this &lt;BR&gt;&gt; &gt; stuff and will =\r\njust stay away from it now, but some kind of &lt;BR&gt;insight &lt;BR&gt;&gt; &gt; woul=\r\nd be great.&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/td=\r\n&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n\n\n      \r\n--0-1835474487-1228364408=:6791--"}