{"id": "13009", "subject": "Re: Any insight on my life changing EVP experience?", "author": "chuck255", "timestamp": "2008-12-04T20:07:10Z", "full_text": "Thank you for proving my point in that you simply just jump the gun \ntoo quickly. You didnt even see the first paragraph of my last \nresponse and just quoted other ones instead.Do you really read all of \nwhat people say before you respond or am I just special? \n\nI said &quot;Well, I sat down with her several times and showed her what \nwas gathered and why I was drawing these conclusions&quot; That means she \nknew about them and still continued to stay. They werent a secret and \nshe knew I was using them and chose to stay and live with me anyways. \nI dont refuse to accept what you say, so dont refuse to accept what I \nwrite. I wont go into this anymore with you.\n\nI never said I was going to continue this &quot;research&quot; at all. You \nobviously are just in a tunnel vision right now because of one thing \nand I really dont see how your closed mind can even be in this field. \nSo I guess I would offer the same advice to you because of what you \nhave also shared.   \n\n--- In EVP-ITC@yahoogroups.com, black bear hollow \n&lt;blackbearhollow@...&gt; wrote:\n&gt;\n&gt; Anyone who goes to the insane effort to put up spy equipment to \nwatch  \n&gt; a girlfriend unbeknownst to her, and makes excuses for it, has \nsome  \n&gt; serious issues - that&#39;s a fact even if you refuse to accept it.\n&gt; \n&gt; But that has no place topic wise here. I wasn&#39;t being sarcastic, I \nwas  \n&gt; being honest. Others have ignored your obvious &quot;problems&quot; and how \njust  \n&gt; plain creepy it is that you&#39;d spy on someone you claim to &quot;love&quot;.  \n&gt; Whatever.\n&gt; \n&gt; The issue that does actually belong in this forum is that of \nspirits  \n&gt; yanking your chain. I hope I&#39;ve been helpful in suggestions. The \nbest  \n&gt; avenue is to know that NOTHING they tell you is the truth and if I  \n&gt; were you, I&#39;d probably refrain from this research based on your  \n&gt; experience and what you&#39;ve shared about yourself.\n&gt; \n&gt; \n&gt; On Dec 4, 2008, at 2:01 PM, chuck255 wrote:\n&gt; \n&gt; &gt; I asked for help and suggestions your right, negativity I have \nenough\n&gt; &gt; of right now. If thats your form of help and suggestion then I am\n&gt; &gt; letting you know its not needed from me, so carry on.\n&gt; &gt;\n&gt; &gt; However, I respect your mindset in thinking that honesty is what I\n&gt; &gt; need, because it is usually all I ask for and thats what I am here\n&gt; &gt; for. I simply think you just jump the gun too quick and I thank\n&gt; &gt; Suzanne for pointing out that I was merely just trying to be \nhonest\n&gt; &gt; and paint the whole picture of the feelings and energies \nassociated\n&gt; &gt; with this situation.\n&gt;"}