{"id": "13004", "subject": "Re: Any insight on my life changing EVP experience?", "author": "chuck255", "timestamp": "2008-12-04T19:01:37Z", "full_text": "I wasn&#39;t as obsessed with B as I was in finding the truth out about \nthings. Think about it.... after she left I still continued right? I \nhavent looked for her and have moved on with another too, but the \nquestions still haunted me. The spystuff was the only way to prove to \nher and myself even, that someone(now I see its something)was there. \nThat stuff really seems to bother you doesn&#39;t it? Well, I sat down \nwith her several times and showed her what was gathered and why I was \ndrawing these conclusions. Still she couldnt understand or explain \nthem and that fed my mission to continue. After she heard the same \nthings as me and still couldn&#39;t explain how they got there, I was \nconvinced she was lying and acting.  \n\nI think your right about that, but I havent fed into the way they \nwere trying to communicate with me anymore, especially after I found \nout the truth. \n\nI asked for help and suggestions your right, negativity I have enough \nof right now. If thats your form of help and suggestion then I am \nletting you know its not needed from me, so carry on. \n\nHowever, I respect your mindset in thinking that honesty is what I \nneed, because it is usually all I ask for and thats what I am here \nfor. I simply think you just jump the gun too quick and I thank \nSuzanne for pointing out that I was merely just trying to be honest \nand paint the whole picture of the feelings and energies associated \nwith this situation. \n\n--- In EVP-ITC@yahoogroups.com, black bear hollow \n&lt;blackbearhollow@...&gt; wrote:\n&gt;\n&gt; It sounds like you&#39;re way to obsessed with B - meaning you spend \nway  \n&gt; too much time trying to control & thinking about her.\n&gt; \n&gt; You can deny your issues all you want. The point is you asked for  \n&gt; opinions and then get miffed at a serious reply. Anyone who would \ngo  \n&gt; to the lengths you have to spy on someone has some serious issues. \nGet  \n&gt; some help.\n&gt; \n&gt; As for recording, they really had you going and feed off your fear. \nI  \n&gt; wouldn&#39;t be surprised if the next thing they tell you is to kill \nor  \n&gt; some other crazy antic.\n&gt; \n&gt; You asked for help and suggestions. Can&#39;t take it? Don&#39;t ask.\n&gt; Seems like a good dose of honesty might be just what you need.\n&gt; \n&gt; On Dec 3, 2008, at 8:10 PM, chuck255 wrote:\n&gt; \n&gt; &gt; Maybe your right :) Who is craziest though...the crazy person or \nthe\n&gt; &gt; person that stays with the crazy person?\n&gt; &gt;\n&gt; &gt; I will add that she knew about them and I told her about them \nbefore I\n&gt; &gt; asked her to leave. Besides the gadgets weren&#39;t strictly for her, \nthey\n&gt; &gt; were for the weirdness at the new apartment. But thanks for the  \n&gt; &gt; shallow\n&gt; &gt; help.\n&gt;"}