{"id": "13025", "subject": "Re: Intent", "author": "Steve Hultay", "timestamp": "2008-12-07T05:10:23Z", "full_text": "I would also like to thank the many people that e-mailed me in the \npast few months about the same problem.  Most have joined my board in \nlew of this situation, the board where we actually post files and \nthrow ideas around.  If that dig was toward me, which it was.  My \nboard has exactly 9 times the amount of posts as here and they are \nvalid to teach others.  This board used to be a safe haven for ideas \nand collaboration, but even frank sumption left again because of the \nlack of research here.  He say&#39;s it&#39;s a disgrace and i agree.  He \ngives his boxes out and people are excited to have a piece of history \nand on the shelf it goes, never to be used at all.  There are only 2 \npeople that i know of that actually have frank&#39;s boxes and posted the \nresults.  I think he is up to 40-something now, it&#39;s just sad that \nhis boxes go unused.  If people don&#39;t know how to go over files, i am \nalways here to help.  And for new researchers who are intrigued by \nthis box communication, i am sorry that none is done here and you \nhave no way to learn.  But there are many venues out there that still \nteach about how these devices work and what to listen to.  I would \npost the link to my group, but i won&#39;t out of respect for Misty.\n\n-Steve\n\n\n\n--- In EVP-ITC@yahoogroups.com, black bear hollow \n&lt;blackbearhollow@...&gt; wrote:\n&gt;\n&gt; My only intent on this list is to help. If you don&#39;t like what I \npost.  \n&gt; you find it offensive, or it doesn&#39;t fit your &quot;in the box&quot; belief  \n&gt; system, simply hit DELETE.\n&gt; \n&gt; People who have nothing to share and have a chip on their shoulder  \n&gt; because their own lists aren&#39;t surviving may be able to scare off \nmany  \n&gt; from posting here, but people like that won&#39;t scare me off.  Their  \n&gt; reputation proceed them.  I get a lot of off list emails from fine  \n&gt; folks who enjoy reading my posts and sharing about my research.\n&gt; \n&gt; It&#39;s a shame, instead of thinking about what part we play in our \nown  \n&gt; experiences, that we choose to blame others or act in strange ways \nof  \n&gt; desperation, refusing to take our own inventories. So be it. Don&#39;t  \n&gt; like my suggestions? Simply hit delete. It was never my intention \nto  \n&gt; be nasty or attack as has been mentioned by a couple of people, \nbut  \n&gt; make deeply honest suggestions. You can bend and twist those into  \n&gt; being negative, but that seriously makes me wonder why they would  \n&gt; trigger such a negative reaction in those who chose to take it in \nsuch  \n&gt; a way. Weird.\n&gt; \n&gt; Don&#39;t agree? Fine. No need to attack, we can agree to disagree. \nSimple.\n&gt; \n&gt; Many many thanks to the many who have written me off list the last  \n&gt; couple of days. I&#39;m trying to catch up on email, but it&#39;s taking \nawhile.\n&gt; \n&gt; w.\n&gt;"}