{"id": "13029", "subject": "Re: Any insight on my life changing EVP experience?", "author": "Michael E", "timestamp": "2008-12-07T14:39:58Z", "full_text": "Actually I dont think this guy is crazy at all.\n\nThis is an amazing story and believable at best.\n\nFirst, there are many our there both men and women who have suspected \ntheir lovers/wives were cheating on them, and did just what this guy \ndid. \n\nWhat happened to this guy is believable as first he got caught up in \nthe technology in that he could spy and not be seen, and second he was \nbeing spied on himself but what sounds like deceased spirits who took \nadvantage of the situation and scared the bajesus out of him.\n\nBlack Bear, look at this from a different perspective. This guy did \nnot go looking to make contact with the spirit world like what we do, \nthe spirit world contacted him and he did not know what it was nor how \nto handle it.\n\nI could be wrong, but to me he came to this group for guidance on what \nhe is dealing with and what should he do.\n\nThis is a story right off the press of a Steven King novel. \n\nMy comment would be that some mischievious spirits took advantage of \nyou, and you have nothing to worry about.  But now you have come in \ncontact with a world you knew existed but one that you never knew you \ncould make contact with.\n\nIf you have any deceased relatives, and you wish to contact them, do \nso, and say a prayer before you turn your device on asking your \nguardian angel to keep only positive spirits around you while you \nrecord.\n\nThanks for sharing your story, and again do not worry. \n\nMike\n\n--- In EVP-ITC@yahoogroups.com, black bear hollow \n&lt;blackbearhollow@...&gt; wrote:\n&gt;\n&gt; It sounds like you seriously need some professional help. Anyone \nwho  \n&gt; would not only stay with someone like you describe, but go to the  \n&gt; length you have with spying has some serious issues that no one on  \n&gt; this list can advise you with. My suggestion, and I&#39;m extremely  \n&gt; serious, is that you get some professional psychological help and \nquick.\n&gt; \n&gt; w.\n&gt; On Dec 3, 2008, at 2:46 PM, chuck255 wrote:\n&gt; \n&gt; &gt;  I am new to this\n&gt; &gt; stuff and will just stay away from it now, but some kind of insight\n&gt; &gt; would be great.\n&gt;"}