{"id": "13026", "subject": "Re: [EVP-ITC] Re: Intent", "author": "Misty Dawn", "timestamp": "2008-12-07T07:08:00Z", "full_text": "--0-172628081-1228633680=:33884\r\nContent-Type: text/plain; charset=us-ascii\r\n\r\nI see it a bit like Sumption, its a here there and everywhere situation with the drama fests going on in the community. The egos and the pointless bickering only hinder the research. I have watched countless times when Frank would post files and rather than people take a moment to listen to it they would much rather spend hours blasting off on someone else. Every now and then one needs to step away from it all. \n\nAs for this group it runs itself, you are all adults and I just expect that you act as such. Im not the boss here or elsewhere, but I would like to work together.\n\nAs for the other groups, its mostly all the same people no matter where ya go. And the ones who dont get along in one setting dont get along in another. Most of the people in your group are or were members of this group? Thats great! It makes no difference to me what group one chooses to post in or work with as long as you are working towards something thats positive rather than keeping this negative thought pattern. \n\nRather than spend another minute getting the last word in how about being constructive, record some, post some, research some, or well anything would be better than this wouldnt it?\n\nAgree to disagree and move on. On that note heres one attached I recorded using h2o for those that get the daily emails.\n\nMisty\n\n\n\n\n\n\n--- On Sun, 12/7/08, Steve Hultay &lt;urkel23@...&gt; wrote:\n\n&gt; From: Steve Hultay &lt;urkel23@...&gt;\n&gt; Subject: [EVP-ITC] Re: Intent\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Sunday, December 7, 2008, 12:10 AM\n&gt; I would also like to thank the many people that e-mailed me\n&gt; in the \n&gt; past few months about the same problem.  Most have joined\n&gt; my board in \n&gt; lew of this situation, the board where we actually post\n&gt; files and \n&gt; throw ideas around.  If that dig was toward me, which it\n&gt; was.  My \n&gt; board has exactly 9 times the amount of posts as here and\n&gt; they are \n&gt; valid to teach others.  This board used to be a safe haven\n&gt; for ideas \n&gt; and collaboration, but even frank sumption left again\n&gt; because of the \n&gt; lack of research here.  He say&#39;s it&#39;s a disgrace\n&gt; and i agree.  He \n&gt; gives his boxes out and people are excited to have a piece\n&gt; of history \n&gt; and on the shelf it goes, never to be used at all.  There\n&gt; are only 2 \n&gt; people that i know of that actually have frank&#39;s boxes\n&gt; and posted the \n&gt; results.  I think he is up to 40-something now, it&#39;s\n&gt; just sad that \n&gt; his boxes go unused.  If people don&#39;t know how to go\n&gt; over files, i am \n&gt; always here to help.  And for new researchers who are\n&gt; intrigued by \n&gt; this box communication, i am sorry that none is done here\n&gt; and you \n&gt; have no way to learn.  But there are many venues out there\n&gt; that still \n&gt; teach about how these devices work and what to listen to. \n&gt; I would \n&gt; post the link to my group, but i won&#39;t out of respect\n&gt; for Misty.\n&gt; \n&gt; -Steve\n&gt; \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, black bear hollow \n&gt; &lt;blackbearhollow@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; My only intent on this list is to help. If you\n&gt; don&#39;t like what I \n&gt; post.  \n&gt; &gt; you find it offensive, or it doesn&#39;t fit your\n&gt; &quot;in the box&quot; belief  \n&gt; &gt; system, simply hit DELETE.\n&gt; &gt; \n&gt; &gt; People who have nothing to share and have a chip on\n&gt; their shoulder  \n&gt; &gt; because their own lists aren&#39;t surviving may be\n&gt; able to scare off \n&gt; many  \n&gt; &gt; from posting here, but people like that won&#39;t\n&gt; scare me off.  Their  \n&gt; &gt; reputation proceed them.  I get a lot of off list\n&gt; emails from fine  \n&gt; &gt; folks who enjoy reading my posts and sharing about my\n&gt; research.\n&gt; &gt; \n&gt; &gt; It&#39;s a shame, instead of thinking about what part\n&gt; we play in our \n&gt; own  \n&gt; &gt; experiences, that we choose to blame others or act in\n&gt; strange ways \n&gt; of  \n&gt; &gt; desperation, refusing to take our own inventories. So\n&gt; be it. Don&#39;t  \n&gt; &gt; like my suggestions? Simply hit delete. It was never\n&gt; my intention \n&gt; to  \n&gt; &gt; be nasty or attack as has been mentioned by a couple\n&gt; of people, \n&gt; but  \n&gt; &gt; make deeply honest suggestions. You can bend and twist\n&gt; those into  \n&gt; &gt; being negative, but that seriously makes me wonder why\n&gt; they would  \n&gt; &gt; trigger such a negative reaction in those who chose to\n&gt; take it in \n&gt; such  \n&gt; &gt; a way. Weird.\n&gt; &gt; \n&gt; &gt; Don&#39;t agree? Fine. No need to attack, we can agree\n&gt; to disagree. \n&gt; Simple.\n&gt; &gt; \n&gt; &gt; Many many thanks to the many who have written me off\n&gt; list the last  \n&gt; &gt; couple of days. I&#39;m trying to catch up on email,\n&gt; but it&#39;s taking \n&gt; awhile.\n&gt; &gt; \n&gt; &gt; w.\n&gt; &gt;\n\n\n      \r\n--0-172628081-1228633680=:33884\r\nContent-Type: audio/mpeg; name=&quot;120508h2o_CLR-steadybondthatlinkus.mp3&quot;\r\nContent-Disposition: attachment; filename=&quot;120508h2o_CLR-steadybondthatlinkus.mp3&quot;\r\n\r\n[ Attachment content not displayed ]\r\n--0-172628081-1228633680=:33884--"}