{"id": "13038", "subject": "Re: [EVP-ITC] Plane crash object key to victim contact?", "author": "Misty Dawn", "timestamp": "2008-12-07T20:10:01Z", "full_text": "Yes I agree. Quite possibly the energy of the individual character association one had in life can linger or attach to the things we touch, the places we go, and the people we meet. We each have an effect/impact on the people and environment around us whether we fully realize it or not. \n\nPsychometry is a very interesting subject. I find it all fascinating especially combining it with other research and ideas.\n\nMisty\n\n\n--- On Sun, 12/7/08, Early Cuyler &lt;ecuyler@...&gt; wrote:\n\n&gt; From: Early Cuyler &lt;ecuyler@...&gt;\n&gt; Subject: Re: [EVP-ITC] Plane crash object key to victim contact?\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Sunday, December 7, 2008, 2:31 PM\n&gt; Very interesting, Mike. I&#39;m not sure if you know about\n&gt; Psychometry or not, but it would be worth a few minutes of\n&gt; your time to research. Just google it. \n&gt; \n&gt; I think spirits tend to be around, maybe not everywhere at\n&gt; any given time, but when trying to contact a particular\n&gt; spirit, it could be important to have an object that had any\n&gt; sort of physical involvement with that spirit. I can&#39;t\n&gt; think of the right word at the moment, but it&#39;s sort of\n&gt; like a beacon. Their energy is attached to it and when you\n&gt; try to communicate, they can go to where their energy is. It\n&gt; possibly provides a better medium for them to communicate?\n&gt; \n&gt; That&#39;s just kind of my thought process on it. No hard\n&gt; facts, just my understanding. Any input on these thoughts\n&gt; would be great. Must...break...now...brain...hurts...\n&gt; \n&gt; Jeremy\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; ________________________________\n&gt; From: M.A. Coletta (Mike) &lt;michaelcoletta@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Sunday, December 7, 2008 12:27:52 PM\n&gt; Subject: [EVP-ITC] Plane crash object key to victim\n&gt; contact?\n&gt; \n&gt; \n&gt; \n&gt; Greetings fellow researchers,\n&gt; \n&gt; I&#39;ve been out-of-pocket for the last week, visiting the\n&gt; Washington DC\n&gt; area and attending a 4 day conference where many high\n&gt; powered people in\n&gt; that kind of business who gave some interesting briefings.\n&gt; Lucky for\n&gt; me... I was in attendance and got to meet and listen to\n&gt; those who wear\n&gt; lots of stars or are appointed to positions of our\n&gt; Nation&#39;s power base.\n&gt; Unfortunately, the conference wasn&#39;t about EVP, ITC, or\n&gt; spirit\n&gt; communication. But, who knows... maybe someday they (at the\n&gt; top) will\n&gt; hold a conference like that.\n&gt; \n&gt; Anyway... I wanted to give an update on my latest direction\n&gt; for those\n&gt; who e-mailed me or messaged me while I was on the east\n&gt; coast last week.\n&gt; First... I&#39;d like to thank that documentary production\n&gt; company for\n&gt; contacting me, asking about the use of my prototypes, but I\n&gt; have to\n&gt; respectfully decline your offer as I only do this for my\n&gt; own research,\n&gt; providing the information FREE to all who desire to built\n&gt; there own\n&gt; devices. And after having been led astray by a\n&gt; not-to-be-named\n&gt; paranormal radio show venue about a certain Stanley Hotel\n&gt; conference,\n&gt; I&#39;m a bit gun-shy at getting involved with such\n&gt; ventures.  Also, for\n&gt; those who wrote and asked about me selling products,  I\n&gt; don&#39;t build and\n&gt; sell anything. I just provide FREE information for my\n&gt; fellow\n&gt; researchers.\n&gt; \n&gt; Okay... on with my story.\n&gt; While sitting in my hotel room last week I continued to\n&gt; read one of\n&gt; Sarah Estep&#39;s books. In one of the chapters she writes\n&gt; about the plane\n&gt; crash into the Potomac River, which happened a number of\n&gt; years ago. Many\n&gt; people died when the airplane went into that frozen river,\n&gt; and she\n&gt; explains how she and others began receiving messages from\n&gt; the crash\n&gt; victims at almost the exact time time crash occurred, even\n&gt; though she\n&gt; didn&#39;t know about the crash at the time.\n&gt; \n&gt; She then writes about the crash of two jumbo jets, where\n&gt; hundreds lost\n&gt; their lives instantly, or soon after the accident. And how\n&gt; the spirit\n&gt; world was filled with communication because of this large\n&gt; disaster.\n&gt; \n&gt; That got me thinking...\n&gt; \n&gt; I too have always been super sensitive about deadly plane\n&gt; crashes,\n&gt; feeling for the families of the victims, as well as, and\n&gt; especially for\n&gt; the victims themselves.\n&gt; \n&gt; One crash in particular put me into the extensive research\n&gt; mode about\n&gt; the crash and the victims. So-much-so that I contacted the\n&gt; wife of the\n&gt; plane&#39;s pilot, where I was able to help put some\n&gt; closure into her world\n&gt; after a number of contacts. (Not wanting to discuss too\n&gt; much, let me\n&gt; just say I was able to view things she was not allowed to\n&gt; view. And\n&gt; after doing so I was able to describe things to her that\n&gt; she always\n&gt; wondered about.)\n&gt; \n&gt; The commercial aircraft in question crashed so violently\n&gt; that remains of\n&gt; the passengers were never all recovered. And after years of\n&gt; legal\n&gt; battling, the settlements were made and the entire aircraft\n&gt; wreckage was\n&gt; released to a salvage company.\n&gt; I was there, at the warehouse, when the many trucks left\n&gt; with the many\n&gt; pieces of plane, enroute to their salvage yard.  And while\n&gt; there I\n&gt; talked with the attorney and investigative lead, who were\n&gt; both on-scene\n&gt; to over-see the finalization of this effort.\n&gt; \n&gt; To get off topic for a bit, I for one am of the opinion\n&gt; that in the\n&gt; spirit communication world, an object is key if\n&gt; communication with a\n&gt; specific entity is desired. I know many do not agree, and\n&gt; think that\n&gt; open communication is possible anytime, anywhere... but\n&gt; I&#39;m not one of\n&gt; those people.\n&gt; \n&gt; I may be wrong or I may be right, but I think an object or\n&gt; location are\n&gt; a must when specific communication is desired. hence, the\n&gt; reason I stand\n&gt; next to a certain grave site, or location where a death\n&gt; actually\n&gt; happened, or have a related object in hand or near where a\n&gt; session is\n&gt; being done.\n&gt; \n&gt; Okay... having said that, while I was observing the\n&gt; movement of the\n&gt; plane crash debris, I was offered a small piece or two by\n&gt; those who now\n&gt; owned the salvage material. (No longer in litigation and no\n&gt; longer owned\n&gt; by the airline company).  I refused acceptance of anything\n&gt; at the time,\n&gt; but asked if the salvage company had, by chance, forgotten\n&gt; something in\n&gt; the warehouse or on the grounds, was it okay for a person\n&gt; to possess it.\n&gt; They told me, yes.\n&gt; \n&gt; Later that evening, when all the material had been moved\n&gt; out of the\n&gt; warehouse, I once again visited the scene. Looking around I\n&gt; found they\n&gt; had done a very good job at clean-up, only leaving a few\n&gt; pieces of small\n&gt; metal, wire, paper, and fabric near the large doors.\n&gt; \n&gt; I picked up the few items that were still there and headed\n&gt; toward the\n&gt; large trash container that was on the property, my\n&gt; intensions to drop\n&gt; those items into the trash. But, while holding them I\n&gt; received a very\n&gt; strong feeling, a very emotional sensation that would not\n&gt; allow me to\n&gt; put them in the trash. It was so strong in-fact, that I\n&gt; began crying. \n&gt; It just flowed through me, consuming me as it went.\n&gt; \n&gt; My emotional feeling was just like it had been earlier in\n&gt; the day when I\n&gt; placed one hand on one of the engines that were mangled and\n&gt; filled with\n&gt; impacted dirt that was once the ground in the place that\n&gt; became the\n&gt; final resting place.\n&gt; \n&gt; Once I arrived home, I carefully placed the small amount of\n&gt; debris\n&gt; material (metal, wire, carpet fabric, paper, etc.) into a\n&gt; sealed glass\n&gt; canister, where it remains to this day.\n&gt; \n&gt; Where am I going with this story...???\n&gt; \n&gt; Two weeks from now, I have a two week vacation coming...\n&gt; which will be\n&gt; spent at home.\n&gt; \n&gt; After reading Sarah Estep&#39;s book, especially the\n&gt; chapter about the plane\n&gt; crash victims, I&#39;ve decided to use those objects I\n&gt; acquired from the\n&gt; warehouse grounds, as the objects that may help me make\n&gt; some specific\n&gt; spirit contacts.\n&gt; I have already researched that crash, and I have all the\n&gt; victims names,\n&gt; along with some information of there life&#39;s. Maybe I\n&gt; will be able to\n&gt; gain information and answer some questions... so I can\n&gt; contact others,\n&gt; besides the original contact with the pilot&#39;s wife, as\n&gt; I told you about\n&gt; earlier in my writing.\n&gt; \n&gt; All I can do is try... and see what happens.\n&gt; - Mike C. (UFO Geek)"}