{"id": "13030", "subject": "Re: [EVP-ITC] EVP-Radio Crime Recording Video", "author": "Michael Edwards", "timestamp": "2008-12-07T15:44:27Z", "full_text": "--0-1356286255-1228664667=:27433\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nThanks Suzanne...\n=A0\nInteresting your comment about the sentences, and you=\r\n are correct they do occur.\n=A0\nWith my process each question is one .wav f=\r\nile, but I am finding that I still at times need to break up a .wav file in=\r\nto three or more files, just so I can hear the messages more clearly. it ap=\r\npears at times the messages are compressed as in a zip file into one .wav f=\r\nile.\n=A0\nI am very happy that you are using EVP to help find the missing.\n=\r\n=A0\nEach of us in this field of study have two barriers that hinder the suc=\r\ncess of our work.\n1. getting law enforcement to listen to us and take us se=\r\nriously\n2. keeping other spirits in our recording space quiet whil we talk =\r\nto our victim. When they have side conversations, their messages get picked=\r\n up thus corrupting the data.\n=A0\nFor number 1, I think we and perhaps even=\r\n some mediums having the same issue, keep trying to get law enforcement to =\r\nlook at our leads, but I think we need to think backwards. Meaning, lets ge=\r\nt law enforcement to start using the device themselves, and once they see t=\r\nhe value in it, then they may be more willing to accept our evp as leads le=\r\ntting us help them.\n=A0\nFor those of us, like you, me and others that volun=\r\nteer our time recoridng EVP to help find the missing, we should try and fin=\r\nd a willing police detective to do a pilot with us in that we record some o=\r\nf their cold case files, and they agree to try and follow up on the leads.\n=\r\n=A0\nRight now I am actually working with an investigator on a child case, a=\r\nnd this investigator believes in what we do,=A0is very knowlegeable of EVP,=\r\n but has not told her peers where the leads are coming from.=A0 We need to =\r\nget past this fear. \n=A0\nThanks for sharing.\n=A0\nMike Edwards\n\n\n=A0\n\n--- On=\r\n Sun, 12/7/08, suzanne bibb &lt;suzyq6819@...&gt; wrote:\n\nFrom: suzanne bib=\r\nb &lt;suzyq6819@...&gt;\nSubject: Re: [EVP-ITC] EVP-Radio Crime Recording Vi=\r\ndeo\nTo: EVP-ITC@yahoogroups.com\nDate: Sunday, December 7, 2008, 8:16 AM\n\n\n\n=\r\n\n\n\n\n\n\n\n\nThank you for putting that out there (you tube).=A0 This is the sam=\r\ne method we are using in a current case and it is provingto be effective.=\r\n=A0 I am finding that I am getting a combination of radio sentence fragment=\r\ns that form sentences as well as traditional EVP while using this method.=\r\n=A0 There are moments when I am utterly amazed at the information I am rece=\r\niving.=A0 We then take this information and attempt to locate the vitims re=\r\nmains.\nIn my current case we are attempting to locate deceased murder victi=\r\nms from the late eighties and early nineties.=A0 This is at the request of =\r\nthe &#39;offenders&#39; family in order to give the victims family peace and allow =\r\nthem to lay their loved ones to rest.=A0 I will share some of my files on e=\r\nsnips.=A0 I will include a link after I upload them for anyone who is inter=\r\nested!=A0 \n=A0\nSuzanne\n\n--- On Sat, 12/6/08, Michael E &lt;f1cracker75@ yahoo.=\r\ncom&gt; wrote:\n\nFrom: Michael E &lt;f1cracker75@ yahoo.com&gt;\nSubject: [EVP-ITC] EV=\r\nP-Radio Crime Recording Video\nTo: EVP-ITC@yahoogroups .com\nDate: Saturday, =\r\nDecember 6, 2008, 6:52 PM\n\n\n\n\nHi everyone, I have recorded a video of my EV=\r\nP-Radio Crime recording \nprocess, where I get leads from deceased victims a=\r\nnd hand over to law \nenforcement or missing person advocates to run the lea=\r\nds.\n\nhttp://uk.youtube. com/watch? v=3DWhGKXBp6Lg0\n\nI went out to Mike Coll=\r\netta&#39;s site to see if there was any guidance, \nbut none on how to sync up m=\r\ny voice in the video.\n\nI used a web cam to do the recording.\n\nDoes anyone k=\r\nnow how to do this?\n\nMike Edwards\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n      \r\n--0-1356286255-1228664667=:27433\r\nContent-Type: text/html; charset=us-ascii\r\n\r\n&lt;table cellspacing=&quot;0&quot; cellpadding=&quot;0&quot; border=&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=&quot;top&quot; style=&quot;font: inherit;&quot;&gt;&lt;DIV&gt;Thanks Suzanne...&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Interesting your comment about the sentences, and you are correct they do occur.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;With my process each question is one .wav file, but I am finding that I still at times need to break up a .wav file into three or more files, just so I can hear the messages more clearly. it appears at times the messages are compressed as in a zip file into one .wav file.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I am very happy that you are using EVP to help find the missing.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Each of us in this field of study have two barriers that hinder the success of our work.&lt;/DIV&gt;\n&lt;DIV&gt;1. getting law enforcement to listen to us and take us seriously&lt;/DIV&gt;\n&lt;DIV&gt;2. keeping other spirits in our recording space quiet whil we talk to our victim. When they have side conversations, their messages get picked up thus corrupting the data.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;For number 1, I think we and perhaps even some mediums having the same issue, keep trying to get law enforcement to look at our leads, but I think we need to think backwards. Meaning, lets get law enforcement to start using the device themselves, and once they see the value in it, then they may be more willing to accept our evp as leads letting us help them.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;For those of us, like you, me and others that volunteer our time recoridng EVP to help find the missing, we should try and find a willing police detective to do a pilot with us in that we record some of their cold case files, and they agree to try and follow up on the leads.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Right now I am actually working with an investigator on a child case, and this investigator believes in what we do,&nbsp;is very knowlegeable of EVP, but has not told her peers where the leads are coming from.&nbsp; We need to get past this fear. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Thanks for sharing.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Mike Edwards&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Sun, 12/7/08, suzanne bibb &lt;I&gt;&lt;suzyq6819@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: rgb(16,16,255) 2px solid&quot;&gt;From: suzanne bibb &lt;suzyq6819@...&gt;&lt;BR&gt;Subject: Re: [EVP-ITC] EVP-Radio Crime Recording Video&lt;BR&gt;To: EVP-ITC@yahoogroups.com&lt;BR&gt;Date: Sunday, December 7, 2008, 8:16 AM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=yiv1639487989&gt;\n&lt;DIV id=ygrp-text&gt;\n&lt;DIV&gt;\n&lt;TABLE cellSpacing=0 cellPadding=0 border=0&gt;\n&lt;TBODY&gt;\n&lt;TR&gt;\n&lt;TD vAlign=top&gt;\n&lt;DIV&gt;Thank you for putting that out there (you tube).&nbsp; This is the same method we are using in a current case and it is provingto be effective.&nbsp; I am finding that I am getting a combination of radio sentence fragments that form sentences as well as traditional EVP while using this method.&nbsp; There are moments when I am utterly amazed at the information I am receiving.&nbsp; We then take this information and attempt to locate the vitims remains.&lt;/DIV&gt;\n&lt;DIV&gt;In my current case we are attempting to locate deceased murder victims from the late eighties and early nineties.&nbsp; This is at the request of the &#39;offenders&#39; family in order to give the victims family peace and allow them to lay their loved ones to rest.&nbsp; I will share some of my files on esnips.&nbsp; I will include a link after I upload them for anyone who is interested!&nbsp; &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Suzanne&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Sat, 12/6/08, Michael E &lt;I&gt;&lt;f1cracker75@ yahoo.com&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;&lt;/DIV&gt;\n&lt;BLOCKQUOTE style=&quot;BORDER-LEFT: rgb(16,16,255) 2px solid&quot;&gt;From: Michael E &lt;f1cracker75@ yahoo.com&gt;&lt;BR&gt;Subject: [EVP-ITC] EVP-Radio Crime Recording Video&lt;BR&gt;To: EVP-ITC@yahoogroups .com&lt;BR&gt;Date: Saturday, December 6, 2008, 6:52 PM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=yiv843712198&gt;\n&lt;DIV id=ygrp-text&gt;\n&lt;DIV&gt;Hi everyone, I have recorded a video of my EVP-Radio Crime recording &lt;BR&gt;process, where I get leads from deceased victims and hand over to law &lt;BR&gt;enforcement or missing person advocates to run the leads.&lt;BR&gt;&lt;BR&gt;&lt;A href=&quot;http://uk.youtube.com/watch?v=WhGKXBp6Lg0&quot; target=_blank rel=nofollow&gt;http://uk.youtube. com/watch? v=WhGKXBp6Lg0&lt;/A&gt;&lt;BR&gt;&lt;BR&gt;I went out to Mike Colletta&#39;s site to see if there was any guidance, &lt;BR&gt;but none on how to sync up my voice in the video.&lt;BR&gt;&lt;BR&gt;I used a web cam to do the recording.&lt;BR&gt;&lt;BR&gt;Does anyone know how to do this?&lt;BR&gt;&lt;BR&gt;Mike Edwards&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/TD&gt;&lt;/TR&gt;&lt;/TBODY&gt;&lt;/TABLE&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n      \r\n--0-1356286255-1228664667=:27433--"}