{"id": "13032", "subject": "Re: [EVP-ITC] Plane crash object key to victim contact?", "author": "Michael Edwards", "timestamp": "2008-12-07T17:37:02Z", "full_text": "--0-800031669-1228671422=:8228\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nMike please share your results!!\n=A0\nId love to hear about what you get!\n=\r\n=A0\nMike Edwards. \n\n=A0\n\n--- On Sun, 12/7/08, M.A. Coletta (Mike) &lt;michaelc=\r\noletta@...&gt; wrote:\n\nFrom: M.A. Coletta (Mike) &lt;michaelcoletta@yahoo.c=\r\nom&gt;\nSubject: [EVP-ITC] Plane crash object key to victim contact?\nTo: EVP-IT=\r\nC@yahoogroups.com\nDate: Sunday, December 7, 2008, 12:27 PM\n\n\n\n\n\n\n\nGreetings=\r\n fellow researchers,\n\nI&#39;ve been out-of-pocket for the last week, visiting t=\r\nhe Washington DC\narea and attending a 4 day conference where many high powe=\r\nred people in\nthat kind of business who gave some interesting briefings. Lu=\r\ncky for\nme... I was in attendance and got to meet and listen to those who w=\r\near\nlots of stars or are appointed to positions of our Nation&#39;s power base.=\r\n\nUnfortunately, the conference wasn&#39;t about EVP, ITC, or spirit\ncommunicati=\r\non. But, who knows... maybe someday they (at the top) will\nhold a conferenc=\r\ne like that.\n\nAnyway... I wanted to give an update on my latest direction f=\r\nor those\nwho e-mailed me or messaged me while I was on the east coast last =\r\nweek.\nFirst... I&#39;d like to thank that documentary production company for\nco=\r\nntacting me, asking about the use of my prototypes, but I have to\nrespectfu=\r\nlly decline your offer as I only do this for my own research,\nproviding the=\r\n information FREE to all who desire to built there own\ndevices. And after h=\r\naving been led astray by a not-to-be-named\nparanormal radio show venue abou=\r\nt a certain Stanley Hotel conference,\nI&#39;m a bit gun-shy at getting involved=\r\n with such ventures. Also, for\nthose who wrote and asked about me selling p=\r\nroducts, I don&#39;t build and\nsell anything. I just provide FREE information f=\r\nor my fellow\nresearchers.\n\nOkay... on with my story.\nWhile sitting in my ho=\r\ntel room last week I continued to read one of\nSarah Estep&#39;s books. In one o=\r\nf the chapters she writes about the plane\ncrash into the Potomac River, whi=\r\nch happened a number of years ago. Many\npeople died when the airplane went =\r\ninto that frozen river, and she\nexplains how she and others began receiving=\r\n messages from the crash\nvictims at almost the exact time time crash occurr=\r\ned, even though she\ndidn&#39;t know about the crash at the time.\n\nShe then writ=\r\nes about the crash of two jumbo jets, where hundreds lost\ntheir lives insta=\r\nntly, or soon after the accident. And how the spirit\nworld was filled with =\r\ncommunication because of this large disaster.\n\nThat got me thinking...\n\nI t=\r\noo have always been super sensitive about deadly plane crashes,\nfeeling for=\r\n the families of the victims, as well as, and especially for\nthe victims th=\r\nemselves.\n\nOne crash in particular put me into the extensive research mode =\r\nabout\nthe crash and the victims. So-much-so that I contacted the wife of th=\r\ne\nplane&#39;s pilot, where I was able to help put some closure into her world\na=\r\nfter a number of contacts. (Not wanting to discuss too much, let me\njust sa=\r\ny I was able to view things she was not allowed to view. And\nafter doing so=\r\n I was able to describe things to her that she always\nwondered about.)\n\nThe=\r\n commercial aircraft in question crashed so violently that remains of\nthe p=\r\nassengers were never all recovered. And after years of legal\nbattling, the =\r\nsettlements were made and the entire aircraft wreckage was\nreleased to a sa=\r\nlvage company.\nI was there, at the warehouse, when the many trucks left wit=\r\nh the many\npieces of plane, enroute to their salvage yard. And while there =\r\nI\ntalked with the attorney and investigative lead, who were both on-scene\nt=\r\no over-see the finalization of this effort.\n\nTo get off topic for a bit, I =\r\nfor one am of the opinion that in the\nspirit communication world, an object=\r\n is key if communication with a\nspecific entity is desired. I know many do =\r\nnot agree, and think that\nopen communication is possible anytime, anywhere.=\r\n.. but I&#39;m not one of\nthose people.\n\nI may be wrong or I may be right, but =\r\nI think an object or location are\na must when specific communication is des=\r\nired. hence, the reason I stand\nnext to a certain grave site, or location w=\r\nhere a death actually\nhappened, or have a related object in hand or near wh=\r\nere a session is\nbeing done.\n\nOkay... having said that, while I was observi=\r\nng the movement of the\nplane crash debris, I was offered a small piece or t=\r\nwo by those who now\nowned the salvage material. (No longer in litigation an=\r\nd no longer owned\nby the airline company). I refused acceptance of anything=\r\n at the time,\nbut asked if the salvage company had, by chance, forgotten so=\r\nmething in\nthe warehouse or on the grounds, was it okay for a person to pos=\r\nsess it.\nThey told me, yes.\n\nLater that evening, when all the material had =\r\nbeen moved out of the\nwarehouse, I once again visited the scene. Looking ar=\r\nound I found they\nhad done a very good job at clean-up, only leaving a few =\r\npieces of small\nmetal, wire, paper, and fabric near the large doors.\n\nI pic=\r\nked up the few items that were still there and headed toward the\nlarge tras=\r\nh container that was on the property, my intensions to drop\nthose items int=\r\no the trash. But, while holding them I received a very\nstrong feeling, a ve=\r\nry emotional sensation that would not allow me to\nput them in the trash. It=\r\n was so strong in-fact, that I began crying. \nIt just flowed through me, co=\r\nnsuming me as it went.\n\nMy emotional feeling was just like it had been earl=\r\nier in the day when I\nplaced one hand on one of the engines that were mangl=\r\ned and filled with\nimpacted dirt that was once the ground in the place that=\r\n became the\nfinal resting place.\n\nOnce I arrived home, I carefully placed t=\r\nhe small amount of debris\nmaterial (metal, wire, carpet fabric, paper, etc.=\r\n) into a sealed glass\ncanister, where it remains to this day.\n\nWhere am I g=\r\noing with this story...???\n\nTwo weeks from now, I have a two week vacation =\r\ncoming... which will be\nspent at home.\n\nAfter reading Sarah Estep&#39;s book, e=\r\nspecially the chapter about the plane\ncrash victims, I&#39;ve decided to use th=\r\nose objects I acquired from the\nwarehouse grounds, as the objects that may =\r\nhelp me make some specific\nspirit contacts.\nI have already researched that =\r\ncrash, and I have all the victims names,\nalong with some information of the=\r\nre life&#39;s. Maybe I will be able to\ngain information and answer some questio=\r\nns... so I can contact others,\nbesides the original contact with the pilot&#39;=\r\ns wife, as I told you about\nearlier in my writing.\n\nAll I can do is try... =\r\nand see what happens.\n- Mike C. (UFO Geek)\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n      \r\n--0-800031669-1228671422=:8228\r\nContent-Type: text/html; charset=us-ascii\r\n\r\n&lt;table cellspacing=&quot;0&quot; cellpadding=&quot;0&quot; border=&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=&quot;top&quot; style=&quot;font: inherit;&quot;&gt;&lt;DIV&gt;Mike please share your results!!&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Id love to hear about what you get!&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Mike Edwards. &lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Sun, 12/7/08, M.A. Coletta (Mike) &lt;I&gt;&lt;michaelcoletta@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: rgb(16,16,255) 2px solid&quot;&gt;From: M.A. Coletta (Mike) &lt;michaelcoletta@...&gt;&lt;BR&gt;Subject: [EVP-ITC] Plane crash object key to victim contact?&lt;BR&gt;To: EVP-ITC@yahoogroups.com&lt;BR&gt;Date: Sunday, December 7, 2008, 12:27 PM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=yiv690720085&gt;\n&lt;DIV id=ygrp-text&gt;\n&lt;DIV&gt;&lt;BR&gt;Greetings fellow researchers,&lt;BR&gt;&lt;BR&gt;I&#39;ve been out-of-pocket for the last week, visiting the Washington DC&lt;BR&gt;area and attending a 4 day conference where many high powered people in&lt;BR&gt;that kind of business who gave some interesting briefings. Lucky for&lt;BR&gt;me... I was in attendance and got to meet and listen to those who wear&lt;BR&gt;lots of stars or are appointed to positions of our Nation&#39;s power base.&lt;BR&gt;Unfortunately, the conference wasn&#39;t about EVP, ITC, or spirit&lt;BR&gt;communication. But, who knows... maybe someday they (at the top) will&lt;BR&gt;hold a conference like that.&lt;BR&gt;&lt;BR&gt;Anyway... I wanted to give an update on my latest direction for those&lt;BR&gt;who e-mailed me or messaged me while I was on the east coast last week.&lt;BR&gt;First... I&#39;d like to thank that documentary production company for&lt;BR&gt;contacting me, asking about the use of my prototypes, but I have to&lt;BR&gt;respectfully decline your offer as I only do this for my own research,&lt;BR&gt;providing the\n information FREE to all who desire to built there own&lt;BR&gt;devices. And after having been led astray by a not-to-be-named&lt;BR&gt;paranormal radio show venue about a certain Stanley Hotel conference,&lt;BR&gt;I&#39;m a bit gun-shy at getting involved with such ventures. Also, for&lt;BR&gt;those who wrote and asked about me selling products, I don&#39;t build and&lt;BR&gt;sell anything. I just provide FREE information for my fellow&lt;BR&gt;researchers.&lt;BR&gt;&lt;BR&gt;Okay... on with my story.&lt;BR&gt;While sitting in my hotel room last week I continued to read one of&lt;BR&gt;Sarah Estep&#39;s books. In one of the chapters she writes about the plane&lt;BR&gt;crash into the Potomac River, which happened a number of years ago. Many&lt;BR&gt;people died when the airplane went into that frozen river, and she&lt;BR&gt;explains how she and others began receiving messages from the crash&lt;BR&gt;victims at almost the exact time time crash occurred, even though she&lt;BR&gt;didn&#39;t know about the crash at the time.&lt;BR&gt;&lt;BR&gt;She then writes about the\n crash of two jumbo jets, where hundreds lost&lt;BR&gt;their lives instantly, or soon after the accident. And how the spirit&lt;BR&gt;world was filled with communication because of this large disaster.&lt;BR&gt;&lt;BR&gt;That got me thinking...&lt;BR&gt;&lt;BR&gt;I too have always been super sensitive about deadly plane crashes,&lt;BR&gt;feeling for the families of the victims, as well as, and especially for&lt;BR&gt;the victims themselves.&lt;BR&gt;&lt;BR&gt;One crash in particular put me into the extensive research mode about&lt;BR&gt;the crash and the victims. So-much-so that I contacted the wife of the&lt;BR&gt;plane&#39;s pilot, where I was able to help put some closure into her world&lt;BR&gt;after a number of contacts. (Not wanting to discuss too much, let me&lt;BR&gt;just say I was able to view things she was not allowed to view. And&lt;BR&gt;after doing so I was able to describe things to her that she always&lt;BR&gt;wondered about.)&lt;BR&gt;&lt;BR&gt;The commercial aircraft in question crashed so violently that remains of&lt;BR&gt;the passengers were never\n all recovered. And after years of legal&lt;BR&gt;battling, the settlements were made and the entire aircraft wreckage was&lt;BR&gt;released to a salvage company.&lt;BR&gt;I was there, at the warehouse, when the many trucks left with the many&lt;BR&gt;pieces of plane, enroute to their salvage yard. And while there I&lt;BR&gt;talked with the attorney and investigative lead, who were both on-scene&lt;BR&gt;to over-see the finalization of this effort.&lt;BR&gt;&lt;BR&gt;To get off topic for a bit, I for one am of the opinion that in the&lt;BR&gt;spirit communication world, an object is key if communication with a&lt;BR&gt;specific entity is desired. I know many do not agree, and think that&lt;BR&gt;open communication is possible anytime, anywhere... but I&#39;m not one of&lt;BR&gt;those people.&lt;BR&gt;&lt;BR&gt;I may be wrong or I may be right, but I think an object or location are&lt;BR&gt;a must when specific communication is desired. hence, the reason I stand&lt;BR&gt;next to a certain grave site, or location where a death actually&lt;BR&gt;happened, or\n have a related object in hand or near where a session is&lt;BR&gt;being done.&lt;BR&gt;&lt;BR&gt;Okay... having said that, while I was observing the movement of the&lt;BR&gt;plane crash debris, I was offered a small piece or two by those who now&lt;BR&gt;owned the salvage material. (No longer in litigation and no longer owned&lt;BR&gt;by the airline company). I refused acceptance of anything at the time,&lt;BR&gt;but asked if the salvage company had, by chance, forgotten something in&lt;BR&gt;the warehouse or on the grounds, was it okay for a person to possess it.&lt;BR&gt;They told me, yes.&lt;BR&gt;&lt;BR&gt;Later that evening, when all the material had been moved out of the&lt;BR&gt;warehouse, I once again visited the scene. Looking around I found they&lt;BR&gt;had done a very good job at clean-up, only leaving a few pieces of small&lt;BR&gt;metal, wire, paper, and fabric near the large doors.&lt;BR&gt;&lt;BR&gt;I picked up the few items that were still there and headed toward the&lt;BR&gt;large trash container that was on the property, my intensions\n to drop&lt;BR&gt;those items into the trash. But, while holding them I received a very&lt;BR&gt;strong feeling, a very emotional sensation that would not allow me to&lt;BR&gt;put them in the trash. It was so strong in-fact, that I began crying. &lt;BR&gt;It just flowed through me, consuming me as it went.&lt;BR&gt;&lt;BR&gt;My emotional feeling was just like it had been earlier in the day when I&lt;BR&gt;placed one hand on one of the engines that were mangled and filled with&lt;BR&gt;impacted dirt that was once the ground in the place that became the&lt;BR&gt;final resting place.&lt;BR&gt;&lt;BR&gt;Once I arrived home, I carefully placed the small amount of debris&lt;BR&gt;material (metal, wire, carpet fabric, paper, etc.) into a sealed glass&lt;BR&gt;canister, where it remains to this day.&lt;BR&gt;&lt;BR&gt;Where am I going with this story...???&lt;BR&gt;&lt;BR&gt;Two weeks from now, I have a two week vacation coming... which will be&lt;BR&gt;spent at home.&lt;BR&gt;&lt;BR&gt;After reading Sarah Estep&#39;s book, especially the chapter about the plane&lt;BR&gt;crash victims,\n I&#39;ve decided to use those objects I acquired from the&lt;BR&gt;warehouse grounds, as the objects that may help me make some specific&lt;BR&gt;spirit contacts.&lt;BR&gt;I have already researched that crash, and I have all the victims names,&lt;BR&gt;along with some information of there life&#39;s. Maybe I will be able to&lt;BR&gt;gain information and answer some questions... so I can contact others,&lt;BR&gt;besides the original contact with the pilot&#39;s wife, as I told you about&lt;BR&gt;earlier in my writing.&lt;BR&gt;&lt;BR&gt;All I can do is try... and see what happens.&lt;BR&gt;- Mike C. (UFO Geek)&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n      \r\n--0-800031669-1228671422=:8228--"}