{"id": "1303", "subject": "Re: Is there any way to get a franks box ???", "author": "psi_research", "timestamp": "2007-05-19T03:54:27Z", "full_text": "To expand upon Guy&#39;s post, the echo chamber size can vary. Some of his\nboxes have an internal chamber that&#39;s about 2&quot; x 3.5&quot;. Some of his\nboxes have chambers which are external and are a bit larger. An\nexternal one I saw was made with a light wood frame which was wrapped\nin heavy aluminum foil.\n\nIf someone is considering constructing their own FB then I suggest\nconsidering the sweep tuning method also as the recordings I&#39;ve heard\nare impressive. We are experimenting with a RVG equipped box and are\ngetting good results but I am also interested in the sweep tuning\napproach.\n\nBy the way, Guy and myself both be speaking at the upcoming South\nCoast Paranormal Convention July 20 and 21 in Santa Paula, CA. see\nlink: http://www.woodwardpsychic.com/ \n\n--- In EVP-ITC@yahoogroups.com, &quot;Guy&quot; &lt;yzzzguy@...&gt; wrote:\n&gt;\n&gt; Frank has provided a paper with a block diagram, MOST (but not all) \n&gt; of the schematics, brief description of operation and a few color \n&gt; pics of the internal wiring. Look in the Files section of the group \n&gt; on the Yahoo groups website for &quot;theghostbox.pdf&quot;. Unfortunately, he \n&gt; has left out some details (like size/composition of the &quot;echo \n&gt; chamber&quot;, etc.) and most of the schematics are hard to read due to \n&gt; digitizing (resolution) problems.\n&gt; \n&gt; The key component that can be difficult to find is the Sanyo LA1135 \n&gt; AM Tuner IC that&#39;s at the heart of the system. Frank has apparently \n&gt; scrounged this chip from old car radios.\n&gt; \n&gt; Here&#39;s how it operates:\n&gt; \n&gt; The RVG (Random Voltage Generator) output is fed to the &quot;tuning&quot; \n&gt; input of the LA1135 AM radio receiver. What this basically does is \n&gt; similar to a human being rapidly and randomly hitting the tuning \n&gt; station buttons in a car radio or varying the tuning dial of a \n&gt; stationary or portable radio. The output of this randomly-tuned AM \n&gt; radio is then fed to a small speaker into an internal &quot;echo chamber&quot; \n&gt; (although his box also provides an output jack for an external \n&gt; speaker to use an external &quot;echo chamber&quot; or even just the room) \n&gt; which also contains a small electret microphone (these are the types \n&gt; that a very tiny and can be clipped to your lapel, tie, etc.). The \n&gt; output of this mike is then fed to another speaker (or optionally to \n&gt; headphones) for the output. Where the &quot;entities&quot; interact with the \n&gt; box is in this &quot;echo chamber&quot; (probably just a small, soundproof \n&gt; plastic box) using the speech snippets from the randomly-tuned AM \n&gt; radio stations as a carrier for any EVP.\n&gt; \n&gt; Hope this helps everyone!\n&gt; \n&gt; Guy\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;bhali333&quot; \n&gt; &lt;paranormalinvestigating@&gt; wrote:\n&gt; &gt;\n&gt; &gt; I have been doing evp research for a number of years now and have \n&gt; &gt; exhausted all venues so when something like this comes along of \n&gt; course \n&gt; &gt; it is a m7ust have for the serious researcher. I have been \n&gt; &gt; experimenting with the sweep method only for a few days but to me \n&gt; it is \n&gt; &gt; just another evp recording method and still needs to be edited and \n&gt; you \n&gt; &gt; don&#39;t have that real time communication.\n&gt; &gt; I was disabled at 911 and have all the time in the world to \n&gt; experiment \n&gt; &gt; so I believe the box would be put to good use. can anyone steer me \n&gt; in \n&gt; &gt; the right direction as far as who to contact or how to have a box \n&gt; built?\n&gt; &gt; \n&gt; &gt; all help is greatly appreciated.\n&gt; &gt; \n&gt; &gt; bruce\n&gt; &gt;\n&gt;"}