{"id": "13044", "subject": "Re: Plane crash object key to victim contact?", "author": "M.A. Coletta (Mike)", "timestamp": "2008-12-08T01:30:54Z", "full_text": "Hi Mike,\n\nI&#39;m still in the planning stages, and will place your suggestions in \nmy plan. Thanks...\nGoing to the actual impact point will be a must too.  It&#39;s now a park \nwith memorial.\n\n- Mike\n\n--- In EVP-ITC@yahoogroups.com, Michael Edwards &lt;f1cracker75@...&gt; \nwrote:\n&gt;\n&gt; Mike how do you plan to do the experiment?\n&gt; \n&gt; I have some thoughts on this.\n&gt; \n&gt; You said you have some items.\n&gt; \n&gt; Find a location out in the middle of nowhere, and just bring your \nrecording equipment. Try for 15 minutes to see if you can get any \nspirits.\n&gt; \n&gt; Then go to that same location, lets say the next day and bring the \nitems you have, and then try and record again for about 15 minutes.\n&gt; \n&gt; It will be interesting if you then pick up a spirit by just having \nthe items with you.\n&gt; \n&gt; With my radio I can not hear realtime, but if you have a device \nwhere you can hear real time, on the day you go back to that remote \nlocation but with the items, if you do get spirits, try to inquire if \nthey are tied to the item you have.\n&gt; \n&gt; Mike Edwards\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; --- On Sun, 12/7/08, M.A. Coletta (Mike) &lt;michaelcoletta@...&gt; wrote:\n&gt; \n&gt; From: M.A. Coletta (Mike) &lt;michaelcoletta@...&gt;\n&gt; Subject: [EVP-ITC] Re: Plane crash object key to victim contact?\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Sunday, December 7, 2008, 5:27 PM\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Hi Jeremy,\n&gt; \n&gt; Thanks... I&#39;ll check it out.\n&gt; \n&gt; As an afterthought, to share this information I decided to probably \nput\n&gt; together a video production of this entire event.\n&gt; \n&gt; From UFO Geek Paradoc Productions. .. the paranormal \ndocumentary, &quot;Final\n&gt; communication from a fatal flight&quot;, or something like that. I \ndecided\n&gt; to start this during my vacation break later this month.\n&gt; I&#39;ll even travel to the plane crash site point of impact, as well as\n&gt; performing sessions with the debris in my lab.\n&gt; \n&gt; I&#39;ve heard that wires sometime retain imprinted information or\n&gt; communication (like those old wire recorders).\n&gt; Some of the wire bundle I have may have contained communication or\n&gt; electrical pulses just before the crash.\n&gt; \n&gt; This video will be the perfect time to test some of the paranormal\n&gt; prototypes, as well as a new one I designed, but haven&#39;t shared yet.\n&gt; It&#39;s an ITC System design that uses bright light, mirrors, lenses, \nalong\n&gt; with an optical coupler and a few other surprises.\n&gt; \n&gt; I have enough researched information and items to work with to put\n&gt; together an hour long or more documentary.\n&gt; I&#39;ll have to see if Youtube will let me put more than 10 minutes at \na\n&gt; time on their servers, otherwise I&#39;ll have to break it up into \nparts.\n&gt; \n&gt; This will all be new to me, but it&#39;s worth the attempt.\n&gt; \n&gt; - Mike C. (UFO Geek)\n&gt; \n&gt; --- In EVP-ITC@yahoogroups .com, Early Cuyler &lt;ecuyler@ &gt; wrote:\n&gt; &gt;\n&gt; &gt; Very interesting, Mike. I&#39;m not sure if you know about \nPsychometry or\n&gt; not, but it would be worth a few minutes of your time to research. \nJust\n&gt; google it.\n&gt; &gt;...\n&gt; &gt; Jeremy\n&gt; &gt; ____________ _________ _________ __\n&gt; &gt; From: M.A. Coletta (Mike) michaelcoletta@ ...&gt;\n&gt; &gt; Greetings fellow researchers,\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Okay... on with my story.\n&gt; &gt; While sitting in my hotel room last week I continued to read one \nof\n&gt; &gt; Sarah Estep&#39;s books. In one of the chapters she writes about the \nplane\n&gt; &gt; crash into the Potomac River, which happened a number of years \nago.\n&gt; Many\n&gt; &gt; people died when the airplane went into that frozen river, and she\n&gt; &gt; explains how she and others began receiving messages from the \ncrash\n&gt; &gt; victims at almost the exact time time crash occurred, even though \nshe\n&gt; &gt; didn&#39;t know about the crash at the time.\n&gt; &gt;\n&gt; &gt; She then writes about the crash of two jumbo jets, where hundreds \nlost\n&gt; &gt; their lives instantly, or soon after the accident. And how the \nspirit\n&gt; &gt; world was filled with communication because of this large \ndisaster.\n&gt; &gt;\n&gt; &gt; That got me thinking...\n&gt; &gt;\n&gt; &gt; I too have always been super sensitive about deadly plane crashes,\n&gt; &gt; feeling for the families of the victims, as well as, and \nespecially\n&gt; for\n&gt; &gt; the victims themselves.\n&gt; &gt;\n&gt; &gt; One crash in particular put me into the extensive research mode \nabout\n&gt; &gt; the crash and the victims. So-much-so that I contacted the wife \nof the\n&gt; &gt; plane&#39;s pilot, where I was able to help put some closure into her\n&gt; world\n&gt; &gt; after a number of contacts. (Not wanting to discuss too much, let \nme\n&gt; &gt; just say I was able to view things she was not allowed to view. \nAnd\n&gt; &gt; after doing so I was able to describe things to her that she \nalways\n&gt; &gt; wondered about.)\n&gt; &gt;\n&gt; &gt; The commercial aircraft in question crashed so violently that \nremains\n&gt; of\n&gt; &gt; the passengers were never all recovered. And after years of legal\n&gt; &gt; battling, the settlements were made and the entire aircraft \nwreckage\n&gt; was\n&gt; &gt; released to a salvage company.\n&gt; &gt; I was there, at the warehouse, when the many trucks left with the \nmany\n&gt; &gt; pieces of plane, enroute to their salvage yard. And while there I\n&gt; &gt; talked with the attorney and investigative lead, who were both\n&gt; on-scene\n&gt; &gt; to over-see the finalization of this effort.\n&gt; &gt;\n&gt; &gt; To get off topic for a bit, I for one am of the opinion that in \nthe\n&gt; &gt; spirit communication world, an object is key if communication \nwith a\n&gt; &gt; specific entity is desired. I know many do not agree, and think \nthat\n&gt; &gt; open communication is possible anytime, anywhere... but I&#39;m not \none of\n&gt; &gt; those people.\n&gt; &gt;\n&gt; &gt; I may be wrong or I may be right, but I think an object or \nlocation\n&gt; are\n&gt; &gt; a must when specific communication is desired. hence, the reason I\n&gt; stand\n&gt; &gt; next to a certain grave site, or location where a death actually\n&gt; &gt; happened, or have a related object in hand or near where a \nsession is\n&gt; &gt; being done.\n&gt; &gt;\n&gt; &gt; Okay... having said that, while I was observing the movement of \nthe\n&gt; &gt; plane crash debris, I was offered a small piece or two by those \nwho\n&gt; now\n&gt; &gt; owned the salvage material. (No longer in litigation and no longer\n&gt; owned\n&gt; &gt; by the airline company). I refused acceptance of anything at the \ntime,\n&gt; &gt; but asked if the salvage company had, by chance, forgotten \nsomething\n&gt; in\n&gt; &gt; the warehouse or on the grounds, was it okay for a person to \npossess\n&gt; it.\n&gt; &gt; They told me, yes.\n&gt; &gt;\n&gt; &gt; Later that evening, when all the material had been moved out of \nthe\n&gt; &gt; warehouse, I once again visited the scene. Looking around I found \nthey\n&gt; &gt; had done a very good job at clean-up, only leaving a few pieces of\n&gt; small\n&gt; &gt; metal, wire, paper, and fabric near the large doors.\n&gt; &gt;\n&gt; &gt; I picked up the few items that were still there and headed toward \nthe\n&gt; &gt; large trash container that was on the property, my intensions to \ndrop\n&gt; &gt; those items into the trash. But, while holding them I received a \nvery\n&gt; &gt; strong feeling, a very emotional sensation that would not allow \nme to\n&gt; &gt; put them in the trash. It was so strong in-fact, that I began \ncrying.\n&gt; &gt; It just flowed through me, consuming me as it went.\n&gt; &gt;\n&gt; &gt; My emotional feeling was just like it had been earlier in the day \nwhen\n&gt; I\n&gt; &gt; placed one hand on one of the engines that were mangled and filled\n&gt; with\n&gt; &gt; impacted dirt that was once the ground in the place that became \nthe\n&gt; &gt; final resting place.\n&gt; &gt;\n&gt; &gt; Once I arrived home, I carefully placed the small amount of debris\n&gt; &gt; material (metal, wire, carpet fabric, paper, etc.) into a sealed \nglass\n&gt; &gt; canister, where it remains to this day.\n&gt; &gt;\n&gt; &gt; Where am I going with this story...???\n&gt; &gt;\n&gt; &gt; Two weeks from now, I have a two week vacation coming... which \nwill be\n&gt; &gt; spent at home.\n&gt; &gt;\n&gt; &gt; After reading Sarah Estep&#39;s book, especially the chapter about the\n&gt; plane\n&gt; &gt; crash victims, I&#39;ve decided to use those objects I acquired from \nthe\n&gt; &gt; warehouse grounds, as the objects that may help me make some \nspecific\n&gt; &gt; spirit contacts.\n&gt; &gt; I have already researched that crash, and I have all the victims\n&gt; names,\n&gt; &gt; along with some information of there life&#39;s. Maybe I will be able \nto\n&gt; &gt; gain information and answer some questions... so I can contact \nothers,\n&gt; &gt; besides the original contact with the pilot&#39;s wife, as I told you\n&gt; about\n&gt; &gt; earlier in my writing.\n&gt; &gt;\n&gt; &gt; All I can do is try... and see what happens.\n&gt; &gt; - Mike C. (UFO Geek)\n&gt; &gt;\n&gt;"}