{"id": "1304", "subject": "Re: Is there any way to get a franks box ???", "author": "Guy", "timestamp": "2007-05-20T01:01:55Z", "full_text": "Thanks, Bill! (Pssst...check is in the mail...he he)\n\nI want to make it clear that I was NOT criticizing Frank about his \nbox or the document! It&#39;s just that I read it over thoroughly \nyesterday and found some things that were missing or unreadable. \nOtherwise - it&#39;s the only &quot;one-stop shopping&quot; for details on Frank&#39;s \nbox. The setup is not rocket science...anyone versed in electronics \ncould build one and even improve on the design (I have several \nthoughts on that).\n\nI haven&#39;t had a chance to check out Misty&#39;s &quot;sweep tuning&quot; method \nbut just that name seems to indicate something close to the &quot;manual&quot; \nway of creating Frank&#39;s box as I previously mentioned (i.e. randomly \npushing radio buttons).\n\nLastly - as Bill said - he and I will be presenters at the \nconference in July. My particular presentation (which I&#39;m still \npiecing together) will be on Paranormal Sound Phenomena. Rather than \nrehash techniques for recording/analyzing EVP - I plan on going into \nmore depth on present/past research in paranormal sounds (such as \nplaying the first spirit voices ever recorded, ultrasonic pulses \ndetected at stone circles, etc.) and make a plea to participants to \nstretch beyond present emphasis on just recording said sounds but \nget into broader research projects. I&#39;m not one to &quot;toot my own \nhorn&quot; but I&#39;m also slated to appear on the June 3 show of Ghostly \nTalk (http://www.ghostlytalk.com) to go into more depth on the \nfamous (or infamous) Spiricom Mark IV story.\n\nGuy\n\n--- In EVP-ITC@yahoogroups.com, &quot;psi_research&quot; &lt;vilhellm@...&gt; wrote:\n&gt;\n&gt; To expand upon Guy&#39;s post, the echo chamber size can vary. Some of \nhis\n&gt; boxes have an internal chamber that&#39;s about 2&quot; x 3.5&quot;. Some of his\n&gt; boxes have chambers which are external and are a bit larger. An\n&gt; external one I saw was made with a light wood frame which was \nwrapped\n&gt; in heavy aluminum foil.\n&gt; \n&gt; If someone is considering constructing their own FB then I suggest\n&gt; considering the sweep tuning method also as the recordings I&#39;ve \nheard\n&gt; are impressive. We are experimenting with a RVG equipped box and \nare\n&gt; getting good results but I am also interested in the sweep tuning\n&gt; approach.\n&gt; \n&gt; By the way, Guy and myself both be speaking at the upcoming South\n&gt; Coast Paranormal Convention July 20 and 21 in Santa Paula, CA. see\n&gt; link: http://www.woodwardpsychic.com/ \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Guy&quot; &lt;yzzzguy@&gt; wrote:"}