{"id": "13041", "subject": "Re: [EVP-ITC] Plane crash object key to victim contact?", "author": "Zack Widup", "timestamp": "2008-12-07T23:07:04Z", "full_text": "I think that&#39;s very likely to be the case.  Also, people become attached \nto their possessions and places they like. Maybe after dying, someone \nwants to hang around his old house or follow his favorite meerschaum pipe \nas it goes to someone else.\n\nAs for me, I&#39;d like to keep an eye on all the ham radio equipment I&#39;ve \nbuilt myself.\n:-)\n\nZack\n\n\nOn Sun, 7 Dec 2008, Misty Dawn wrote:\n\n&gt; Yes I agree. Quite possibly the energy of the individual character association one had in life can linger or attach to the things we touch, the places we go, and the people we meet. We each have an effect/impact on the people and environment around us whether we fully realize it or not.\n&gt;\n&gt; Psychometry is a very interesting subject. I find it all fascinating especially combining it with other research and ideas.\n&gt;\n&gt; Misty\n&gt;\n&gt;\n&gt; --- On Sun, 12/7/08, Early Cuyler &lt;ecuyler@...&gt; wrote:\n&gt;\n&gt;&gt; From: Early Cuyler &lt;ecuyler@...&gt;\n&gt;&gt; Subject: Re: [EVP-ITC] Plane crash object key to victim contact?\n&gt;&gt; To: EVP-ITC@yahoogroups.com\n&gt;&gt; Date: Sunday, December 7, 2008, 2:31 PM\n&gt;&gt; Very interesting, Mike. I&#39;m not sure if you know about\n&gt;&gt; Psychometry or not, but it would be worth a few minutes of\n&gt;&gt; your time to research. Just google it.\n&gt;&gt;\n&gt;&gt; I think spirits tend to be around, maybe not everywhere at\n&gt;&gt; any given time, but when trying to contact a particular\n&gt;&gt; spirit, it could be important to have an object that had any\n&gt;&gt; sort of physical involvement with that spirit. I can&#39;t\n&gt;&gt; think of the right word at the moment, but it&#39;s sort of\n&gt;&gt; like a beacon. Their energy is attached to it and when you\n&gt;&gt; try to communicate, they can go to where their energy is. It\n&gt;&gt; possibly provides a better medium for them to communicate?\n&gt;&gt;\n&gt;&gt; That&#39;s just kind of my thought process on it. No hard\n&gt;&gt; facts, just my understanding. Any input on these thoughts\n&gt;&gt; would be great. Must...break...now...brain...hurts...\n&gt;&gt;\n&gt;&gt; Jeremy\n&gt;&gt;"}