{"id": "13042", "subject": "Re: [EVP-ITC] Re: Plane crash object key to victim contact?", "author": "Michael Edwards", "timestamp": "2008-12-08T00:24:00Z", "full_text": "--0-1648201946-1228695840=:23100\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nMike how do you plan to do the experiment?\n=A0\nI have some thoughts on this=\r\n.\n=A0\nYou said you have some items.\n=A0\nFind a location out in the middle o=\r\nf nowhere, and just bring your recording equipment. Try for 15 minutes to s=\r\nee if you can get any spirits.\n=A0\nThen go to that same location, lets say =\r\nthe next day and bring the items you have, and then try and record again fo=\r\nr about 15 minutes.\n=A0\nIt will be interesting if you then pick up a spirit=\r\n by just having the items with you.\n=A0\nWith my radio I can not hear realti=\r\nme, but if you have a device where you can hear real time, on the day you g=\r\no back to that remote location but with the items, if you do get spirits, t=\r\nry to inquire if they are tied to the item you have.\n=A0\nMike Edwards\n\n\n=A0=\r\n\n\n--- On Sun, 12/7/08, M.A. Coletta (Mike) &lt;michaelcoletta@...&gt; wrote=\r\n:\n\nFrom: M.A. Coletta (Mike) &lt;michaelcoletta@...&gt;\nSubject: [EVP-ITC] =\r\nRe: Plane crash object key to victim contact?\nTo: EVP-ITC@yahoogroups.com\nD=\r\nate: Sunday, December 7, 2008, 5:27 PM\n\n\n\n\n\n\n\nHi Jeremy,\n\nThanks... I&#39;ll ch=\r\neck it out.\n\nAs an afterthought, to share this information I decided to pro=\r\nbably put\ntogether a video production of this entire event.\n\nFrom UFO Geek =\r\nParadoc Productions. .. the paranormal documentary, &quot;Final\ncommunication fr=\r\nom a fatal flight&quot;, or something like that. I decided\nto start this during =\r\nmy vacation break later this month.\nI&#39;ll even travel to the plane crash sit=\r\ne point of impact, as well as\nperforming sessions with the debris in my lab=\r\n.\n\nI&#39;ve heard that wires sometime retain imprinted information or\ncommunica=\r\ntion (like those old wire recorders).\nSome of the wire bundle I have may ha=\r\nve contained communication or\nelectrical pulses just before the crash.\n\nThi=\r\ns video will be the perfect time to test some of the paranormal\nprototypes,=\r\n as well as a new one I designed, but haven&#39;t shared yet.\nIt&#39;s an ITC Syste=\r\nm design that uses bright light, mirrors, lenses, along\nwith an optical cou=\r\npler and a few other surprises.\n\nI have enough researched information and i=\r\ntems to work with to put\ntogether an hour long or more documentary.\nI&#39;ll ha=\r\nve to see if Youtube will let me put more than 10 minutes at a\ntime on thei=\r\nr servers, otherwise I&#39;ll have to break it up into parts.\n\nThis will all be=\r\n new to me, but it&#39;s worth the attempt.\n\n- Mike C. (UFO Geek)\n\n--- In EVP-I=\r\nTC@yahoogroups .com, Early Cuyler &lt;ecuyler@... &gt; wrote:\n&gt;\n&gt; Very interestin=\r\ng, Mike. I&#39;m not sure if you know about Psychometry or\nnot, but it would be=\r\n worth a few minutes of your time to research. Just\ngoogle it.\n&gt;...\n&gt; Jerem=\r\ny\n&gt; ____________ _________ _________ __\n&gt; From: M.A. Coletta (Mike) michael=\r\ncoletta@ ...&gt;\n&gt; Greetings fellow researchers,\n&gt;\n&gt;\n&gt; Okay... on with my stor=\r\ny.\n&gt; While sitting in my hotel room last week I continued to read one of\n&gt; =\r\nSarah Estep&#39;s books. In one of the chapters she writes about the plane\n&gt; cr=\r\nash into the Potomac River, which happened a number of years ago.\nMany\n&gt; pe=\r\nople died when the airplane went into that frozen river, and she\n&gt; explains=\r\n how she and others began receiving messages from the crash\n&gt; victims at al=\r\nmost the exact time time crash occurred, even though she\n&gt; didn&#39;t know abou=\r\nt the crash at the time.\n&gt;\n&gt; She then writes about the crash of two jumbo j=\r\nets, where hundreds lost\n&gt; their lives instantly, or soon after the acciden=\r\nt. And how the spirit\n&gt; world was filled with communication because of this=\r\n large disaster.\n&gt;\n&gt; That got me thinking...\n&gt;\n&gt; I too have always been sup=\r\ner sensitive about deadly plane crashes,\n&gt; feeling for the families of the =\r\nvictims, as well as, and especially\nfor\n&gt; the victims themselves.\n&gt;\n&gt; One c=\r\nrash in particular put me into the extensive research mode about\n&gt; the cras=\r\nh and the victims. So-much-so that I contacted the wife of the\n&gt; plane&#39;s pi=\r\nlot, where I was able to help put some closure into her\nworld\n&gt; after a num=\r\nber of contacts. (Not wanting to discuss too much, let me\n&gt; just say I was =\r\nable to view things she was not allowed to view. And\n&gt; after doing so I was=\r\n able to describe things to her that she always\n&gt; wondered about.)\n&gt;\n&gt; The =\r\ncommercial aircraft in question crashed so violently that remains\nof\n&gt; the =\r\npassengers were never all recovered. And after years of legal\n&gt; battling, t=\r\nhe settlements were made and the entire aircraft wreckage\nwas\n&gt; released to=\r\n a salvage company.\n&gt; I was there, at the warehouse, when the many trucks l=\r\neft with the many\n&gt; pieces of plane, enroute to their salvage yard. And whi=\r\nle there I\n&gt; talked with the attorney and investigative lead, who were both=\r\n\non-scene\n&gt; to over-see the finalization of this effort.\n&gt;\n&gt; To get off top=\r\nic for a bit, I for one am of the opinion that in the\n&gt; spirit communicatio=\r\nn world, an object is key if communication with a\n&gt; specific entity is desi=\r\nred. I know many do not agree, and think that\n&gt; open communication is possi=\r\nble anytime, anywhere... but I&#39;m not one of\n&gt; those people.\n&gt;\n&gt; I may be wr=\r\nong or I may be right, but I think an object or location\nare\n&gt; a must when =\r\nspecific communication is desired. hence, the reason I\nstand\n&gt; next to a ce=\r\nrtain grave site, or location where a death actually\n&gt; happened, or have a =\r\nrelated object in hand or near where a session is\n&gt; being done.\n&gt;\n&gt; Okay...=\r\n having said that, while I was observing the movement of the\n&gt; plane crash =\r\ndebris, I was offered a small piece or two by those who\nnow\n&gt; owned the sal=\r\nvage material. (No longer in litigation and no longer\nowned\n&gt; by the airlin=\r\ne company). I refused acceptance of anything at the time,\n&gt; but asked if th=\r\ne salvage company had, by chance, forgotten something\nin\n&gt; the warehouse or=\r\n on the grounds, was it okay for a person to possess\nit.\n&gt; They told me, ye=\r\ns.\n&gt;\n&gt; Later that evening, when all the material had been moved out of the\n=\r\n&gt; warehouse, I once again visited the scene. Looking around I found they\n&gt; =\r\nhad done a very good job at clean-up, only leaving a few pieces of\nsmall\n&gt; =\r\nmetal, wire, paper, and fabric near the large doors.\n&gt;\n&gt; I picked up the fe=\r\nw items that were still there and headed toward the\n&gt; large trash container=\r\n that was on the property, my intensions to drop\n&gt; those items into the tra=\r\nsh. But, while holding them I received a very\n&gt; strong feeling, a very emot=\r\nional sensation that would not allow me to\n&gt; put them in the trash. It was =\r\nso strong in-fact, that I began crying.\n&gt; It just flowed through me, consum=\r\ning me as it went.\n&gt;\n&gt; My emotional feeling was just like it had been earli=\r\ner in the day when\nI\n&gt; placed one hand on one of the engines that were mang=\r\nled and filled\nwith\n&gt; impacted dirt that was once the ground in the place t=\r\nhat became the\n&gt; final resting place.\n&gt;\n&gt; Once I arrived home, I carefully =\r\nplaced the small amount of debris\n&gt; material (metal, wire, carpet fabric, p=\r\naper, etc.) into a sealed glass\n&gt; canister, where it remains to this day.\n&gt;=\r\n\n&gt; Where am I going with this story...???\n&gt;\n&gt; Two weeks from now, I have a =\r\ntwo week vacation coming... which will be\n&gt; spent at home.\n&gt;\n&gt; After readin=\r\ng Sarah Estep&#39;s book, especially the chapter about the\nplane\n&gt; crash victim=\r\ns, I&#39;ve decided to use those objects I acquired from the\n&gt; warehouse ground=\r\ns, as the objects that may help me make some specific\n&gt; spirit contacts.\n&gt; =\r\nI have already researched that crash, and I have all the victims\nnames,\n&gt; a=\r\nlong with some information of there life&#39;s. Maybe I will be able to\n&gt; gain =\r\ninformation and answer some questions... so I can contact others,\n&gt; besides=\r\n the original contact with the pilot&#39;s wife, as I told you\nabout\n&gt; earlier =\r\nin my writing.\n&gt;\n&gt; All I can do is try... and see what happens.\n&gt; - Mike C.=\r\n (UFO Geek)\n&gt;\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n      \r\n--0-1648201946-1228695840=:23100\r\nContent-Type: text/html; charset=us-ascii\r\n\r\n&lt;table cellspacing=&quot;0&quot; cellpadding=&quot;0&quot; border=&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=&quot;top&quot; style=&quot;font: inherit;&quot;&gt;&lt;DIV&gt;Mike how do you plan to do the experiment?&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I have some thoughts on this.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;You said you have some items.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Find a location out in the middle of nowhere, and just bring your recording equipment. Try for 15 minutes to see if you can get any spirits.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Then go to that same location, lets say the next day and bring the items you have, and then try and record again for about 15 minutes.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;It will be interesting if you then pick up a spirit by just having the items with you.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;With my radio I can not hear realtime, but if you have a device where you can hear real time, on the day you go back to that remote location but with the items, if you do get spirits, try to inquire if they are tied to the item you have.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Mike Edwards&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Sun, 12/7/08, M.A. Coletta (Mike) &lt;I&gt;&lt;michaelcoletta@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: rgb(16,16,255) 2px solid&quot;&gt;From: M.A. Coletta (Mike) &lt;michaelcoletta@...&gt;&lt;BR&gt;Subject: [EVP-ITC] Re: Plane crash object key to victim contact?&lt;BR&gt;To: EVP-ITC@yahoogroups.com&lt;BR&gt;Date: Sunday, December 7, 2008, 5:27 PM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=yiv1278684975&gt;\n&lt;DIV id=ygrp-text&gt;\n&lt;DIV&gt;&lt;BR&gt;Hi Jeremy,&lt;BR&gt;&lt;BR&gt;Thanks... I&#39;ll check it out.&lt;BR&gt;&lt;BR&gt;As an afterthought, to share this information I decided to probably put&lt;BR&gt;together a video production of this entire event.&lt;BR&gt;&lt;BR&gt;From UFO Geek Paradoc Productions. .. the paranormal documentary, &quot;Final&lt;BR&gt;communication from a fatal flight&quot;, or something like that. I decided&lt;BR&gt;to start this during my vacation break later this month.&lt;BR&gt;I&#39;ll even travel to the plane crash site point of impact, as well as&lt;BR&gt;performing sessions with the debris in my lab.&lt;BR&gt;&lt;BR&gt;I&#39;ve heard that wires sometime retain imprinted information or&lt;BR&gt;communication (like those old wire recorders).&lt;BR&gt;Some of the wire bundle I have may have contained communication or&lt;BR&gt;electrical pulses just before the crash.&lt;BR&gt;&lt;BR&gt;This video will be the perfect time to test some of the paranormal&lt;BR&gt;prototypes, as well as a new one I designed, but haven&#39;t shared yet.&lt;BR&gt;It&#39;s an ITC System design that uses bright light, mirrors,\n lenses, along&lt;BR&gt;with an optical coupler and a few other surprises.&lt;BR&gt;&lt;BR&gt;I have enough researched information and items to work with to put&lt;BR&gt;together an hour long or more documentary.&lt;BR&gt;I&#39;ll have to see if Youtube will let me put more than 10 minutes at a&lt;BR&gt;time on their servers, otherwise I&#39;ll have to break it up into parts.&lt;BR&gt;&lt;BR&gt;This will all be new to me, but it&#39;s worth the attempt.&lt;BR&gt;&lt;BR&gt;- Mike C. (UFO Geek)&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=&quot;mailto:EVP-ITC%40yahoogroups.com&quot; target=_blank rel=nofollow&gt;EVP-ITC@yahoogroups .com&lt;/A&gt;, Early Cuyler &lt;ecuyler@... &gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; Very interesting, Mike. I&#39;m not sure if you know about Psychometry or&lt;BR&gt;not, but it would be worth a few minutes of your time to research. Just&lt;BR&gt;google it.&lt;BR&gt;&gt;...&lt;BR&gt;&gt; Jeremy&lt;BR&gt;&gt; ____________ _________ _________ __&lt;BR&gt;&gt; From: M.A. Coletta (Mike) michaelcoletta@ ...&gt;&lt;BR&gt;&gt; Greetings fellow researchers,&lt;BR&gt;&gt;&lt;BR&gt;&gt;&lt;BR&gt;&gt; Okay... on with my\n story.&lt;BR&gt;&gt; While sitting in my hotel room last week I continued to read one of&lt;BR&gt;&gt; Sarah Estep&#39;s books. In one of the chapters she writes about the plane&lt;BR&gt;&gt; crash into the Potomac River, which happened a number of years ago.&lt;BR&gt;Many&lt;BR&gt;&gt; people died when the airplane went into that frozen river, and she&lt;BR&gt;&gt; explains how she and others began receiving messages from the crash&lt;BR&gt;&gt; victims at almost the exact time time crash occurred, even though she&lt;BR&gt;&gt; didn&#39;t know about the crash at the time.&lt;BR&gt;&gt;&lt;BR&gt;&gt; She then writes about the crash of two jumbo jets, where hundreds lost&lt;BR&gt;&gt; their lives instantly, or soon after the accident. And how the spirit&lt;BR&gt;&gt; world was filled with communication because of this large disaster.&lt;BR&gt;&gt;&lt;BR&gt;&gt; That got me thinking...&lt;BR&gt;&gt;&lt;BR&gt;&gt; I too have always been super sensitive about deadly plane crashes,&lt;BR&gt;&gt; feeling for the families of the victims, as well as, and\n especially&lt;BR&gt;for&lt;BR&gt;&gt; the victims themselves.&lt;BR&gt;&gt;&lt;BR&gt;&gt; One crash in particular put me into the extensive research mode about&lt;BR&gt;&gt; the crash and the victims. So-much-so that I contacted the wife of the&lt;BR&gt;&gt; plane&#39;s pilot, where I was able to help put some closure into her&lt;BR&gt;world&lt;BR&gt;&gt; after a number of contacts. (Not wanting to discuss too much, let me&lt;BR&gt;&gt; just say I was able to view things she was not allowed to view. And&lt;BR&gt;&gt; after doing so I was able to describe things to her that she always&lt;BR&gt;&gt; wondered about.)&lt;BR&gt;&gt;&lt;BR&gt;&gt; The commercial aircraft in question crashed so violently that remains&lt;BR&gt;of&lt;BR&gt;&gt; the passengers were never all recovered. And after years of legal&lt;BR&gt;&gt; battling, the settlements were made and the entire aircraft wreckage&lt;BR&gt;was&lt;BR&gt;&gt; released to a salvage company.&lt;BR&gt;&gt; I was there, at the warehouse, when the many trucks left with the many&lt;BR&gt;&gt; pieces of plane, enroute to their\n salvage yard. And while there I&lt;BR&gt;&gt; talked with the attorney and investigative lead, who were both&lt;BR&gt;on-scene&lt;BR&gt;&gt; to over-see the finalization of this effort.&lt;BR&gt;&gt;&lt;BR&gt;&gt; To get off topic for a bit, I for one am of the opinion that in the&lt;BR&gt;&gt; spirit communication world, an object is key if communication with a&lt;BR&gt;&gt; specific entity is desired. I know many do not agree, and think that&lt;BR&gt;&gt; open communication is possible anytime, anywhere... but I&#39;m not one of&lt;BR&gt;&gt; those people.&lt;BR&gt;&gt;&lt;BR&gt;&gt; I may be wrong or I may be right, but I think an object or location&lt;BR&gt;are&lt;BR&gt;&gt; a must when specific communication is desired. hence, the reason I&lt;BR&gt;stand&lt;BR&gt;&gt; next to a certain grave site, or location where a death actually&lt;BR&gt;&gt; happened, or have a related object in hand or near where a session is&lt;BR&gt;&gt; being done.&lt;BR&gt;&gt;&lt;BR&gt;&gt; Okay... having said that, while I was observing the movement of the&lt;BR&gt;&gt; plane crash debris, I\n was offered a small piece or two by those who&lt;BR&gt;now&lt;BR&gt;&gt; owned the salvage material. (No longer in litigation and no longer&lt;BR&gt;owned&lt;BR&gt;&gt; by the airline company). I refused acceptance of anything at the time,&lt;BR&gt;&gt; but asked if the salvage company had, by chance, forgotten something&lt;BR&gt;in&lt;BR&gt;&gt; the warehouse or on the grounds, was it okay for a person to possess&lt;BR&gt;it.&lt;BR&gt;&gt; They told me, yes.&lt;BR&gt;&gt;&lt;BR&gt;&gt; Later that evening, when all the material had been moved out of the&lt;BR&gt;&gt; warehouse, I once again visited the scene. Looking around I found they&lt;BR&gt;&gt; had done a very good job at clean-up, only leaving a few pieces of&lt;BR&gt;small&lt;BR&gt;&gt; metal, wire, paper, and fabric near the large doors.&lt;BR&gt;&gt;&lt;BR&gt;&gt; I picked up the few items that were still there and headed toward the&lt;BR&gt;&gt; large trash container that was on the property, my intensions to drop&lt;BR&gt;&gt; those items into the trash. But, while holding them I received a very&lt;BR&gt;&gt;\n strong feeling, a very emotional sensation that would not allow me to&lt;BR&gt;&gt; put them in the trash. It was so strong in-fact, that I began crying.&lt;BR&gt;&gt; It just flowed through me, consuming me as it went.&lt;BR&gt;&gt;&lt;BR&gt;&gt; My emotional feeling was just like it had been earlier in the day when&lt;BR&gt;I&lt;BR&gt;&gt; placed one hand on one of the engines that were mangled and filled&lt;BR&gt;with&lt;BR&gt;&gt; impacted dirt that was once the ground in the place that became the&lt;BR&gt;&gt; final resting place.&lt;BR&gt;&gt;&lt;BR&gt;&gt; Once I arrived home, I carefully placed the small amount of debris&lt;BR&gt;&gt; material (metal, wire, carpet fabric, paper, etc.) into a sealed glass&lt;BR&gt;&gt; canister, where it remains to this day.&lt;BR&gt;&gt;&lt;BR&gt;&gt; Where am I going with this story...???&lt;BR&gt;&gt;&lt;BR&gt;&gt; Two weeks from now, I have a two week vacation coming... which will be&lt;BR&gt;&gt; spent at home.&lt;BR&gt;&gt;&lt;BR&gt;&gt; After reading Sarah Estep&#39;s book, especially the chapter about the&lt;BR&gt;plane&lt;BR&gt;&gt;\n crash victims, I&#39;ve decided to use those objects I acquired from the&lt;BR&gt;&gt; warehouse grounds, as the objects that may help me make some specific&lt;BR&gt;&gt; spirit contacts.&lt;BR&gt;&gt; I have already researched that crash, and I have all the victims&lt;BR&gt;names,&lt;BR&gt;&gt; along with some information of there life&#39;s. Maybe I will be able to&lt;BR&gt;&gt; gain information and answer some questions... so I can contact others,&lt;BR&gt;&gt; besides the original contact with the pilot&#39;s wife, as I told you&lt;BR&gt;about&lt;BR&gt;&gt; earlier in my writing.&lt;BR&gt;&gt;&lt;BR&gt;&gt; All I can do is try... and see what happens.&lt;BR&gt;&gt; - Mike C. (UFO Geek)&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n      \r\n--0-1648201946-1228695840=:23100--"}