{"id": "13045", "subject": "Re: Plane crash object key to victim contact?", "author": "M.A. Coletta (Mike)", "timestamp": "2008-12-08T01:35:31Z", "full_text": "Hi Andy,\n\nThanks for sharing your story.\n\nYes, I hope the objects and my plan to visit the location where the \ncrash happened make the session productive.\n\n- Mike\n\n--- In EVP-ITC@yahoogroups.com, &quot;ourobouros2k2&quot; &lt;ourobouros2k2@...&gt; \nwrote:\n&gt;\n&gt; Reading your post Mike reminded me of when a sheriff&#39;s deputy on \nscene\n&gt; at the Murrah building site gave me a small chunk of the marble\n&gt; building facing and told me to get it to a psychic. At the time I\n&gt; scoffed at the idea, and thought it was an interesting keepsake. \nThis\n&gt; was well before I had my awakening interest in the paranormal or\n&gt; spirit communication. As a child, basically, just out of high \nschool I\n&gt; tucked the piece away until after moving countless times, I lost \nit. A\n&gt; shame, as the majority of the rubble lies under a hundred feet of \nsoil\n&gt; at the bottom of the eastern oklahoma county landfill now and a\n&gt; special opportunity was lost to youthful ignorance.\n&gt; \n&gt; I don&#39;t know if unfettered communication is possible anywhere at\n&gt; anytime, but it would certainly make sense that an object or \nlocation\n&gt; could act as a &quot;long distance calling card&quot; or similar and \nfacilitate\n&gt; communication a lot easier. Just my thoughts, not backed up with any\n&gt; conclusive date for or against, but I always found session\n&gt; communications seem easier (as far as results) at location of the\n&gt; event. Then again the voices I received did not correlate with the\n&gt; event. I am very interested in hearing what happens after your\n&gt; sessions, please keep us updated.\n&gt; \n&gt; Thanks\n&gt; Andy\n&gt; \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;M.A. Coletta (Mike)&quot;\n&gt; &lt;michaelcoletta@&gt; wrote:\n&gt; &gt;\n&gt; &gt; \n&gt; &gt; Greetings fellow researchers,\n&gt; &gt; \n&gt; &gt; I&#39;ve been out-of-pocket for the last week, visiting the \nWashington DC\n&gt; &gt; area and attending a 4 day conference where many high powered \npeople in\n&gt; &gt; that kind of business who gave some interesting briefings. Lucky \nfor\n&gt; &gt; me... I was in attendance and got to meet and listen to those who \nwear\n&gt; &gt; lots of stars or are appointed to positions of our Nation&#39;s power \nbase.\n&gt; &gt; Unfortunately, the conference wasn&#39;t about EVP, ITC, or spirit\n&gt; &gt; communication. But, who knows... maybe someday they (at the top) \nwill\n&gt; &gt; hold a conference like that.\n&gt; &gt; \n&gt; &gt; Anyway... I wanted to give an update on my latest direction for \nthose\n&gt; &gt; who e-mailed me or messaged me while I was on the east coast last \nweek.\n&gt; &gt; First... I&#39;d like to thank that documentary production company for\n&gt; &gt; contacting me, asking about the use of my prototypes, but I have \nto\n&gt; &gt; respectfully decline your offer as I only do this for my own \nresearch,\n&gt; &gt; providing the information FREE to all who desire to built there \nown\n&gt; &gt; devices. And after having been led astray by a not-to-be-named\n&gt; &gt; paranormal radio show venue about a certain Stanley Hotel \nconference,\n&gt; &gt; I&#39;m a bit gun-shy at getting involved with such ventures.  Also, \nfor\n&gt; &gt; those who wrote and asked about me selling products,  I don&#39;t \nbuild and\n&gt; &gt; sell anything. I just provide FREE information for my fellow\n&gt; &gt; researchers.\n&gt; &gt; \n&gt; &gt; Okay... on with my story.\n&gt; &gt; While sitting in my hotel room last week I continued to read one \nof\n&gt; &gt; Sarah Estep&#39;s books. In one of the chapters she writes about the \nplane\n&gt; &gt; crash into the Potomac River, which happened a number of years \nago. Many\n&gt; &gt; people died when the airplane went into that frozen river, and she\n&gt; &gt; explains how she and others began receiving messages from the \ncrash\n&gt; &gt; victims at almost the exact time time crash occurred, even though \nshe\n&gt; &gt; didn&#39;t know about the crash at the time.\n&gt; &gt; \n&gt; &gt; She then writes about the crash of two jumbo jets, where hundreds \nlost\n&gt; &gt; their lives instantly, or soon after the accident. And how the \nspirit\n&gt; &gt; world was filled with communication because of this large \ndisaster.\n&gt; &gt; \n&gt; &gt; That got me thinking...\n&gt; &gt; \n&gt; &gt; I too have always been super sensitive about deadly plane crashes,\n&gt; &gt; feeling for the families of the victims, as well as, and \nespecially for\n&gt; &gt; the victims themselves.\n&gt; &gt; \n&gt; &gt; One crash in particular put me into the extensive research mode \nabout\n&gt; &gt; the crash and the victims. So-much-so that I contacted the wife \nof the\n&gt; &gt; plane&#39;s pilot, where I was able to help put some closure into her \nworld\n&gt; &gt; after a number of contacts. (Not wanting to discuss too much, let \nme\n&gt; &gt; just say I was able to view things she was not allowed to view. \nAnd\n&gt; &gt; after doing so I was able to describe things to her that she \nalways\n&gt; &gt; wondered about.)\n&gt; &gt; \n&gt; &gt; The commercial aircraft in question crashed so violently that \nremains of\n&gt; &gt; the passengers were never all recovered. And after years of legal\n&gt; &gt; battling, the settlements were made and the entire aircraft \nwreckage was\n&gt; &gt; released to a salvage company.\n&gt; &gt; I was there, at the warehouse, when the many trucks left with the \nmany\n&gt; &gt; pieces of plane, enroute to their salvage yard.  And while there I\n&gt; &gt; talked with the attorney and investigative lead, who were both on-\nscene\n&gt; &gt; to over-see the finalization of this effort.\n&gt; &gt; \n&gt; &gt; To get off topic for a bit, I for one am of the opinion that in \nthe\n&gt; &gt; spirit communication world, an object is key if communication \nwith a\n&gt; &gt; specific entity is desired. I know many do not agree, and think \nthat\n&gt; &gt; open communication is possible anytime, anywhere... but I&#39;m not \none of\n&gt; &gt; those people.\n&gt; &gt; \n&gt; &gt; I may be wrong or I may be right, but I think an object or \nlocation are\n&gt; &gt; a must when specific communication is desired. hence, the reason \nI stand\n&gt; &gt; next to a certain grave site, or location where a death actually\n&gt; &gt; happened, or have a related object in hand or near where a \nsession is\n&gt; &gt; being done.\n&gt; &gt; \n&gt; &gt; Okay... having said that, while I was observing the movement of \nthe\n&gt; &gt; plane crash debris, I was offered a small piece or two by those \nwho now\n&gt; &gt; owned the salvage material. (No longer in litigation and no \nlonger owned\n&gt; &gt; by the airline company).  I refused acceptance of anything at the \ntime,\n&gt; &gt; but asked if the salvage company had, by chance, forgotten \nsomething in\n&gt; &gt; the warehouse or on the grounds, was it okay for a person to \npossess it.\n&gt; &gt; They told me, yes.\n&gt; &gt; \n&gt; &gt; Later that evening, when all the material had been moved out of \nthe\n&gt; &gt; warehouse, I once again visited the scene. Looking around I found \nthey\n&gt; &gt; had done a very good job at clean-up, only leaving a few pieces \nof small\n&gt; &gt; metal, wire, paper, and fabric near the large doors.\n&gt; &gt; \n&gt; &gt; I picked up the few items that were still there and headed toward \nthe\n&gt; &gt; large trash container that was on the property, my intensions to \ndrop\n&gt; &gt; those items into the trash. But, while holding them I received a \nvery\n&gt; &gt; strong feeling, a very emotional sensation that would not allow \nme to\n&gt; &gt; put them in the trash. It was so strong in-fact, that I began \ncrying. \n&gt; &gt; It just flowed through me, consuming me as it went.\n&gt; &gt; \n&gt; &gt; My emotional feeling was just like it had been earlier in the day \nwhen I\n&gt; &gt; placed one hand on one of the engines that were mangled and \nfilled with\n&gt; &gt; impacted dirt that was once the ground in the place that became \nthe\n&gt; &gt; final resting place.\n&gt; &gt; \n&gt; &gt; Once I arrived home, I carefully placed the small amount of debris\n&gt; &gt; material (metal, wire, carpet fabric, paper, etc.) into a sealed \nglass\n&gt; &gt; canister, where it remains to this day.\n&gt; &gt; \n&gt; &gt; Where am I going with this story...???\n&gt; &gt; \n&gt; &gt; Two weeks from now, I have a two week vacation coming... which \nwill be\n&gt; &gt; spent at home.\n&gt; &gt; \n&gt; &gt; After reading Sarah Estep&#39;s book, especially the chapter about \nthe plane\n&gt; &gt; crash victims, I&#39;ve decided to use those objects I acquired from \nthe\n&gt; &gt; warehouse grounds, as the objects that may help me make some \nspecific\n&gt; &gt; spirit contacts.\n&gt; &gt; I have already researched that crash, and I have all the victims \nnames,\n&gt; &gt; along with some information of there life&#39;s. Maybe I will be able \nto\n&gt; &gt; gain information and answer some questions... so I can contact \nothers,\n&gt; &gt; besides the original contact with the pilot&#39;s wife, as I told you \nabout\n&gt; &gt; earlier in my writing.\n&gt; &gt; \n&gt; &gt; All I can do is try... and see what happens.\n&gt; &gt; - Mike C. (UFO Geek)\n&gt; &gt;\n&gt;"}