{"id": "13048", "subject": "Request for volunteer researcher assistance", "author": "M.A. Coletta (Mike)", "timestamp": "2008-12-10T23:35:56Z", "full_text": "--8-0889197837-9525573000=:6\r\nContent-Type: text/plain; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n\nI am looking for 5 - 10 researchers to voluntarily participate in an\neffor=\r\nt that will become a part of the mini-documentary I am planning to\nbegin fi=\r\nlming later this month.  When completed early in 2009 I will be\nplacing thi=\r\ns video on my Youtube site for all to view. Freely sharing\nour research is =\r\nthe key!  If you are one that participates, I&#39;d like to\nbe able to mention =\r\nyou and display your work in the video.\n\nThe subject of the research is:\nAt=\r\ntempted spirit contact using an object associated with a disaster as a\ncata=\r\nlysis for a specific contact... away from the scene of the disaster.\n\nIf se=\r\nlected, the volunteer researcher will be mailed a small amount of\nmaterial =\r\nassociated with the aircraft crash in question.  This crash\ndebris was obta=\r\nined after all litigation was complete and a salvage\ncompany had purchased =\r\nall debris from the airline company.\nNote: There are no health hazards asso=\r\nciated with the debris.\nNote: The detailed information about the crash is n=\r\not being giving at\nthis time in order to make it a controlled ITC experimen=\r\nt.  This way the\naudio files I receive from participants may or may not con=\r\ntain\ninformation about those who perished or information about their life. =\r\n I\nalone know that information at this time.\n\nIt won&#39;t take much of your ti=\r\nme.  All I ask from the selected\nresearchers are five, 30 second audio file=\r\ns of attempted spirit contact,\nusing a method of the researcher&#39;s choice.  =\r\nThe crash debris you will be\nprovided must be used in association with the =\r\nattempted contacts. (Close\nproximity to the recording device is encouraged.=\r\n)\nYou can e-mail me the audio files, along with a text explanation of how\nt=\r\nhe files were captured when you complete you research. (Method used,\nhow de=\r\nbris was used, etc.)\n\nIf you are interested in volunteering, please send me=\r\n a private e-mail\nthrough this forum and tell me a bit about yourself and w=\r\nhat method you\ncurrently use.  If you are one of those selected I will repl=\r\ny to your\ne-mail, asking for a mailing address to send the object debris (w=\r\nhich\nwill arrive in a small padded envelope.)  I don&#39;t need the debris back=\r\n,\nso keep it if you wish...\n\nThanks!\n- Mike C. (UFO Geek) www.ufogeek.com &lt;=\r\nhttp://www.ufogeek.com&gt;\n\n\nBelow is some information about the video.\nA new =\r\ndocumentary coming in early 2009\n&quot;Voices From The Scorched Earth&quot;... A para=\r\nnormal documentary (&quot;Paradoc&quot;)\nabout contact with those who perished in a c=\r\nommercial jetliner crash\nwhich claimed all on-board.\nThe 4g+ crash impact b=\r\neing so violent, all passengers and crew died\ninstantly.  They had only a m=\r\natter of seconds prior to their terrifying\nvertical plunge. Witnesses descr=\r\nibed the aftermath scene as more\ngruesome than they had ever experienced.\nS=\r\nome say spirit communication is more likely to occur if a person had\nsuffer=\r\ned a quick, tragic death, with minimal time to prepare but enough\ntime for =\r\nemotional thought and feelings to run high, such as what\nhappened in this t=\r\nragic accident.\nThe incident took only seconds, but according to the offici=\r\nal report\nthere was enough time for very high emotion to have been felt by =\r\nthe\npassengers and crew.\nWith this theory in mind,  Mike will perform ITC s=\r\nessions at the scene\nof the crash (exact impact point), and will be using o=\r\nbjects from the\ncrash as part of some ITC sessions.\nDuring ITC sessions a n=\r\number of paranormal devices will be used, some\ndesigned by Mike and current=\r\nly in the prototype stage.\nMike will begin filming &quot;Voices From The Scorche=\r\nd Earth&quot; in late\nDecember 2008.  Watch for this Paradoc on his Youtube webs=\r\nite\n(Youtube.com/ufogeek), early in 2009.\n\n\r\n--8-0889197837-9525573000=:6\r\nContent-Type: text/html; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;P&gt;I am looking for 5 - 10 researchers to voluntarily participate in an eff=\r\nort that will become a part of the mini-documentary I am planning to begin =\r\nfilming later this month.&nbsp; When completed early in 2009 I will be plac=\r\ning this video on my Youtube site for all to view. Freely sharing our resea=\r\nrch is the key!&nbsp; If you are one that participates, I&#39;d like to be able=\r\n to mention you and display your work in the video.&lt;/P&gt;\n&lt;P&gt;&lt;STRONG&gt;The subj=\r\nect of the research is:&lt;/STRONG&gt;&lt;BR&gt;Attempted spirit contact using an objec=\r\nt associated with a disaster as a catalysis for a specific contact... away =\r\nfrom the scene of the disaster.&lt;/P&gt;\n&lt;P&gt;If selected, the volunteer researche=\r\nr will be mailed a small amount of material associated with the aircraft cr=\r\nash in question.&nbsp; This crash debris was obtained after all litigation =\r\nwas complete and a salvage company had purchased all debris from the airlin=\r\ne company.&lt;BR&gt;Note: There are no health hazards associated with the debris.=\r\n&lt;BR&gt;Note: The detailed information about the crash is not being giving at t=\r\nhis time in order to make it a controlled ITC experiment.&nbsp; This way th=\r\ne audio files I receive from participants may or may not contain informatio=\r\nn about those who perished or information about their life.&nbsp; I alone k=\r\nnow that information at this time.&lt;/P&gt;\n&lt;P&gt;It won&#39;t take much of your time.&=\r\nnbsp; All I ask from the selected researchers are five, 30 second audio fil=\r\nes of attempted spirit contact, using a method of the researcher&#39;s choice.&=\r\nnbsp; The crash debris you will be provided must be used in association wit=\r\nh the attempted contacts. (Close proximity to the recording device is encou=\r\nraged.)&lt;BR&gt;You can e-mail me the audio files, along with a text explanation=\r\n of how the files were captured when you complete you research. (Method use=\r\nd, how debris was used, etc.)&lt;/P&gt;\n&lt;P&gt;If you are interested in volunteering,=\r\n please send me a private e-mail through this forum and tell me a bit about=\r\n yourself and what method you currently use.&nbsp; If you are one of those =\r\nselected I will reply to your e-mail, asking for a mailing address to send =\r\nthe object debris (which will arrive in a small padded envelope.)&nbsp; I d=\r\non&#39;t need the debris back, so keep it if you wish...&lt;/P&gt;\n&lt;P&gt;Thanks!&lt;BR&gt;- Mi=\r\nke C. (UFO Geek) &lt;A href=3D&quot;http://www.ufogeek.com&quot;&gt;www.ufogeek.com&lt;/A&gt;&lt;/P&gt;=\r\n\n&lt;P&gt;&lt;BR&gt;Below is some information about the video.&lt;BR&gt;&lt;FONT size=3D&quot;1&quot;&gt;A ne=\r\nw documentary coming in early 2009&lt;BR&gt;&quot;Voices From The Scorched Earth&quot;... A=\r\n paranormal documentary (&quot;Paradoc&quot;) about contact with those who perished i=\r\nn a commercial jetliner crash which claimed all on-board.&lt;BR&gt;The 4g+ crash =\r\nimpact being so violent, all passengers and crew died instantly.&nbsp; They=\r\n had only a matter of seconds prior to their terrifying vertical plunge. Wi=\r\ntnesses described the aftermath scene as more gruesome than they had ever e=\r\nxperienced.&lt;BR&gt;Some say spirit communication is more likely to occur if a p=\r\nerson had suffered a quick, tragic death, with minimal time to prepare but =\r\nenough time for emotional thought and feelings to run high, such as what ha=\r\nppened in this tragic accident.&lt;BR&gt;The incident took only seconds, but acco=\r\nrding to the official report there was enough time for very high emotion to=\r\n have been felt by the passengers and crew.&lt;BR&gt;With this theory in mind,&nb=\r\nsp; Mike will perform ITC sessions at the scene of the crash (exact impact =\r\npoint), and will be using objects from the crash as part of some ITC sessio=\r\nns.&lt;BR&gt;During ITC sessions a number of paranormal devices will be used, som=\r\ne designed by Mike and currently in the prototype stage. &lt;BR&gt;Mike will begi=\r\nn filming &quot;Voices From The Scorched Earth&quot; in late December 2008.&nbsp; Wat=\r\nch for this Paradoc on his Youtube website (Youtube.com/ufogeek), early in =\r\n2009.&lt;/FONT&gt;&lt;/P&gt;\n\r\n--8-0889197837-9525573000=:6--"}