{"id": "13043", "subject": "Re: Plane crash object key to victim contact?", "author": "ourobouros2k2", "timestamp": "2008-12-08T01:00:36Z", "full_text": "Reading your post Mike reminded me of when a sheriff&#39;s deputy on scene\nat the Murrah building site gave me a small chunk of the marble\nbuilding facing and told me to get it to a psychic. At the time I\nscoffed at the idea, and thought it was an interesting keepsake. This\nwas well before I had my awakening interest in the paranormal or\nspirit communication. As a child, basically, just out of high school I\ntucked the piece away until after moving countless times, I lost it. A\nshame, as the majority of the rubble lies under a hundred feet of soil\nat the bottom of the eastern oklahoma county landfill now and a\nspecial opportunity was lost to youthful ignorance.\n\nI don&#39;t know if unfettered communication is possible anywhere at\nanytime, but it would certainly make sense that an object or location\ncould act as a &quot;long distance calling card&quot; or similar and facilitate\ncommunication a lot easier. Just my thoughts, not backed up with any\nconclusive date for or against, but I always found session\ncommunications seem easier (as far as results) at location of the\nevent. Then again the voices I received did not correlate with the\nevent. I am very interested in hearing what happens after your\nsessions, please keep us updated.\n\nThanks\nAndy\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;M.A. Coletta (Mike)&quot;\n&lt;michaelcoletta@...&gt; wrote:\n&gt;\n&gt; \n&gt; Greetings fellow researchers,\n&gt; \n&gt; I&#39;ve been out-of-pocket for the last week, visiting the Washington DC\n&gt; area and attending a 4 day conference where many high powered people in\n&gt; that kind of business who gave some interesting briefings. Lucky for\n&gt; me... I was in attendance and got to meet and listen to those who wear\n&gt; lots of stars or are appointed to positions of our Nation&#39;s power base.\n&gt; Unfortunately, the conference wasn&#39;t about EVP, ITC, or spirit\n&gt; communication. But, who knows... maybe someday they (at the top) will\n&gt; hold a conference like that.\n&gt; \n&gt; Anyway... I wanted to give an update on my latest direction for those\n&gt; who e-mailed me or messaged me while I was on the east coast last week.\n&gt; First... I&#39;d like to thank that documentary production company for\n&gt; contacting me, asking about the use of my prototypes, but I have to\n&gt; respectfully decline your offer as I only do this for my own research,\n&gt; providing the information FREE to all who desire to built there own\n&gt; devices. And after having been led astray by a not-to-be-named\n&gt; paranormal radio show venue about a certain Stanley Hotel conference,\n&gt; I&#39;m a bit gun-shy at getting involved with such ventures.  Also, for\n&gt; those who wrote and asked about me selling products,  I don&#39;t build and\n&gt; sell anything. I just provide FREE information for my fellow\n&gt; researchers.\n&gt; \n&gt; Okay... on with my story.\n&gt; While sitting in my hotel room last week I continued to read one of\n&gt; Sarah Estep&#39;s books. In one of the chapters she writes about the plane\n&gt; crash into the Potomac River, which happened a number of years ago. Many\n&gt; people died when the airplane went into that frozen river, and she\n&gt; explains how she and others began receiving messages from the crash\n&gt; victims at almost the exact time time crash occurred, even though she\n&gt; didn&#39;t know about the crash at the time.\n&gt; \n&gt; She then writes about the crash of two jumbo jets, where hundreds lost\n&gt; their lives instantly, or soon after the accident. And how the spirit\n&gt; world was filled with communication because of this large disaster.\n&gt; \n&gt; That got me thinking...\n&gt; \n&gt; I too have always been super sensitive about deadly plane crashes,\n&gt; feeling for the families of the victims, as well as, and especially for\n&gt; the victims themselves.\n&gt; \n&gt; One crash in particular put me into the extensive research mode about\n&gt; the crash and the victims. So-much-so that I contacted the wife of the\n&gt; plane&#39;s pilot, where I was able to help put some closure into her world\n&gt; after a number of contacts. (Not wanting to discuss too much, let me\n&gt; just say I was able to view things she was not allowed to view. And\n&gt; after doing so I was able to describe things to her that she always\n&gt; wondered about.)\n&gt; \n&gt; The commercial aircraft in question crashed so violently that remains of\n&gt; the passengers were never all recovered. And after years of legal\n&gt; battling, the settlements were made and the entire aircraft wreckage was\n&gt; released to a salvage company.\n&gt; I was there, at the warehouse, when the many trucks left with the many\n&gt; pieces of plane, enroute to their salvage yard.  And while there I\n&gt; talked with the attorney and investigative lead, who were both on-scene\n&gt; to over-see the finalization of this effort.\n&gt; \n&gt; To get off topic for a bit, I for one am of the opinion that in the\n&gt; spirit communication world, an object is key if communication with a\n&gt; specific entity is desired. I know many do not agree, and think that\n&gt; open communication is possible anytime, anywhere... but I&#39;m not one of\n&gt; those people.\n&gt; \n&gt; I may be wrong or I may be right, but I think an object or location are\n&gt; a must when specific communication is desired. hence, the reason I stand\n&gt; next to a certain grave site, or location where a death actually\n&gt; happened, or have a related object in hand or near where a session is\n&gt; being done.\n&gt; \n&gt; Okay... having said that, while I was observing the movement of the\n&gt; plane crash debris, I was offered a small piece or two by those who now\n&gt; owned the salvage material. (No longer in litigation and no longer owned\n&gt; by the airline company).  I refused acceptance of anything at the time,\n&gt; but asked if the salvage company had, by chance, forgotten something in\n&gt; the warehouse or on the grounds, was it okay for a person to possess it.\n&gt; They told me, yes.\n&gt; \n&gt; Later that evening, when all the material had been moved out of the\n&gt; warehouse, I once again visited the scene. Looking around I found they\n&gt; had done a very good job at clean-up, only leaving a few pieces of small\n&gt; metal, wire, paper, and fabric near the large doors.\n&gt; \n&gt; I picked up the few items that were still there and headed toward the\n&gt; large trash container that was on the property, my intensions to drop\n&gt; those items into the trash. But, while holding them I received a very\n&gt; strong feeling, a very emotional sensation that would not allow me to\n&gt; put them in the trash. It was so strong in-fact, that I began crying. \n&gt; It just flowed through me, consuming me as it went.\n&gt; \n&gt; My emotional feeling was just like it had been earlier in the day when I\n&gt; placed one hand on one of the engines that were mangled and filled with\n&gt; impacted dirt that was once the ground in the place that became the\n&gt; final resting place.\n&gt; \n&gt; Once I arrived home, I carefully placed the small amount of debris\n&gt; material (metal, wire, carpet fabric, paper, etc.) into a sealed glass\n&gt; canister, where it remains to this day.\n&gt; \n&gt; Where am I going with this story...???\n&gt; \n&gt; Two weeks from now, I have a two week vacation coming... which will be\n&gt; spent at home.\n&gt; \n&gt; After reading Sarah Estep&#39;s book, especially the chapter about the plane\n&gt; crash victims, I&#39;ve decided to use those objects I acquired from the\n&gt; warehouse grounds, as the objects that may help me make some specific\n&gt; spirit contacts.\n&gt; I have already researched that crash, and I have all the victims names,\n&gt; along with some information of there life&#39;s. Maybe I will be able to\n&gt; gain information and answer some questions... so I can contact others,\n&gt; besides the original contact with the pilot&#39;s wife, as I told you about\n&gt; earlier in my writing.\n&gt; \n&gt; All I can do is try... and see what happens.\n&gt; - Mike C. (UFO Geek)\n&gt;"}