{"id": "13050", "subject": "Re: [EVP-ITC] Request for volunteer researcher assistance", "author": "Tom Arnold", "timestamp": "2008-12-11T09:05:54Z", "full_text": "--0-1297996127-1228986354=:94878\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nMike,\n=A0=A0 My wife mother-inlaw and my self will help you do reserch.If y=\r\nou would like I have a digital recorder that I upload to the computer with =\r\nno problem.\nTom Millet (Northeast Ct Paranormal Society Founder)\n\n--- On We=\r\nd, 12/10/08, M.A. Coletta (Mike) &lt;michaelcoletta@...&gt; wrote:\n\nFrom: M=\r\n.A. Coletta (Mike) &lt;michaelcoletta@...&gt;\nSubject: [EVP-ITC] Request fo=\r\nr volunteer researcher assistance\nTo: EVP-ITC@yahoogroups.com\nDate: Wednesd=\r\nay, December 10, 2008, 6:35 PM\n\n\n\n\n\n\n\nI am looking for 5 - 10 researchers t=\r\no voluntarily participate in an effort that will become a part of the mini-=\r\ndocumentary I am planning to begin filming later this month.=A0 When comple=\r\nted early in 2009 I will be placing this video on my Youtube site for all t=\r\no view. Freely sharing our research is the key!=A0 If you are one that part=\r\nicipates, I&#39;d like to be able to mention you and display your work in the v=\r\nideo.\nThe subject of the research is:\nAttempted spirit contact using an obj=\r\nect associated with a disaster as a catalysis for a specific contact... awa=\r\ny from the scene of the disaster.\nIf selected, the volunteer researcher wil=\r\nl be mailed a small amount of material associated with the aircraft crash i=\r\nn question.=A0 This crash debris was obtained after all litigation was comp=\r\nlete and a salvage company had purchased all debris from the airline compan=\r\ny.\nNote: There are no health hazards associated with the debris.\nNote: The =\r\ndetailed information about the crash is not being giving at this time in or=\r\nder to make it a controlled ITC experiment.=A0 This way the audio files I r=\r\neceive from participants may or may not contain information about those who=\r\n perished or information about their life.=A0 I alone know that information=\r\n at this time.\nIt won&#39;t take much of your time.=A0 All I ask from the selec=\r\nted researchers are five, 30 second audio files of attempted spirit contact=\r\n, using a method of the researcher&#39;s choice.=A0 The crash debris you will b=\r\ne provided must be used in association with the attempted contacts. (Close =\r\nproximity to the recording device is encouraged.)\nYou can e-mail me the aud=\r\nio files, along with a text explanation of how the files were captured when=\r\n you complete you research. (Method used, how debris was used, etc.)\nIf you=\r\n are interested in volunteering, please send me a private e-mail through th=\r\nis forum and tell me a bit about yourself and what method you currently use=\r\n.=A0 If you are one of those selected I will reply to your e-mail, asking f=\r\nor a mailing address to send the object debris (which will arrive in a smal=\r\nl padded envelope.)=A0 I don&#39;t need the debris back, so keep it if you wish=\r\n...\nThanks!\n- Mike C. (UFO Geek) www.ufogeek. com\n\nBelow is some informatio=\r\nn about the video.\nA new documentary coming in early 2009\n&quot;Voices From The =\r\nScorched Earth&quot;... A paranormal documentary (&quot;Paradoc&quot;) about contact with =\r\nthose who perished in a commercial jetliner crash which claimed all on-boar=\r\nd.\nThe 4g+ crash impact being so violent, all passengers and crew died inst=\r\nantly.=A0 They had only a matter of seconds prior to their terrifying verti=\r\ncal plunge. Witnesses described the aftermath scene as more gruesome than t=\r\nhey had ever experienced.\nSome say spirit communication is more likely to o=\r\nccur if a person had suffered a quick, tragic death, with minimal time to p=\r\nrepare but enough time for emotional thought and feelings to run high, such=\r\n as what happened in this tragic accident.\nThe incident took only seconds, =\r\nbut according to the official report there was enough time for very high em=\r\notion to have been felt by the passengers and crew.\nWith this theory in min=\r\nd,=A0 Mike will perform ITC sessions at the scene of the crash (exact impac=\r\nt point), and will be using objects from the crash as part of some ITC sess=\r\nions.\nDuring ITC sessions a number of paranormal devices will be used, some=\r\n designed by Mike and currently in the prototype stage. \nMike will begin fi=\r\nlming &quot;Voices From The Scorched Earth&quot; in late December 2008.=A0 Watch for =\r\nthis Paradoc on his Youtube website (Youtube.com/ ufogeek), early in 2009. =\r\n\n\n\n\n\n\n\n\n\n\n\n\n\r\n--0-1297996127-1228986354=:94878\r\nContent-Type: text/html; charset=us-ascii\r\n\r\n&lt;table cellspacing=&quot;0&quot; cellpadding=&quot;0&quot; border=&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=&quot;top&quot; style=&quot;font: inherit;&quot;&gt;&lt;DIV&gt;Mike,&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&nbsp; My wife mother-inlaw and my self will help you do reserch.If you would like I have a digital recorder that I upload to the computer with no problem.&lt;/DIV&gt;\n&lt;DIV&gt;Tom Millet (Northeast Ct Paranormal Society Founder)&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Wed, 12/10/08, M.A. Coletta (Mike) &lt;I&gt;&lt;michaelcoletta@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;&lt;/DIV&gt;\n&lt;BLOCKQUOTE style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: rgb(16,16,255) 2px solid&quot;&gt;From: M.A. Coletta (Mike) &lt;michaelcoletta@...&gt;&lt;BR&gt;Subject: [EVP-ITC] Request for volunteer researcher assistance&lt;BR&gt;To: EVP-ITC@yahoogroups.com&lt;BR&gt;Date: Wednesday, December 10, 2008, 6:35 PM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=yiv1817656411&gt;\n&lt;DIV id=ygrp-text&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;I am looking for 5 - 10 researchers to voluntarily participate in an effort that will become a part of the mini-documentary I am planning to begin filming later this month.&nbsp; When completed early in 2009 I will be placing this video on my Youtube site for all to view. Freely sharing our research is the key!&nbsp; If you are one that participates, I&#39;d like to be able to mention you and display your work in the video.&lt;/DIV&gt;\n&lt;DIV&gt;&lt;STRONG&gt;The subject of the research is:&lt;/STRONG&gt;&lt;BR&gt;Attempted spirit contact using an object associated with a disaster as a catalysis for a specific contact... away from the scene of the disaster.&lt;/DIV&gt;\n&lt;DIV&gt;If selected, the volunteer researcher will be mailed a small amount of material associated with the aircraft crash in question.&nbsp; This crash debris was obtained after all litigation was complete and a salvage company had purchased all debris from the airline company.&lt;BR&gt;Note: There are no health hazards associated with the debris.&lt;BR&gt;Note: The detailed information about the crash is not being giving at this time in order to make it a controlled ITC experiment.&nbsp; This way the audio files I receive from participants may or may not contain information about those who perished or information about their life.&nbsp; I alone know that information at this time.&lt;/DIV&gt;\n&lt;DIV&gt;It won&#39;t take much of your time.&nbsp; All I ask from the selected researchers are five, 30 second audio files of attempted spirit contact, using a method of the researcher&#39;s choice.&nbsp; The crash debris you will be provided must be used in association with the attempted contacts. (Close proximity to the recording device is encouraged.)&lt;BR&gt;You can e-mail me the audio files, along with a text explanation of how the files were captured when you complete you research. (Method used, how debris was used, etc.)&lt;/DIV&gt;\n&lt;DIV&gt;If you are interested in volunteering, please send me a private e-mail through this forum and tell me a bit about yourself and what method you currently use.&nbsp; If you are one of those selected I will reply to your e-mail, asking for a mailing address to send the object debris (which will arrive in a small padded envelope.)&nbsp; I don&#39;t need the debris back, so keep it if you wish...&lt;/DIV&gt;\n&lt;DIV&gt;Thanks!&lt;BR&gt;- Mike C. (UFO Geek) &lt;A href=&quot;http://www.ufogeek.com/&quot; target=_blank rel=nofollow&gt;www.ufogeek. com&lt;/A&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;Below is some information about the video.&lt;BR&gt;&lt;FONT size=1&gt;A new documentary coming in early 2009&lt;BR&gt;&quot;Voices From The Scorched Earth&quot;... A paranormal documentary (&quot;Paradoc&quot;) about contact with those who perished in a commercial jetliner crash which claimed all on-board.&lt;BR&gt;The 4g+ crash impact being so violent, all passengers and crew died instantly.&nbsp; They had only a matter of seconds prior to their terrifying vertical plunge. Witnesses described the aftermath scene as more gruesome than they had ever experienced.&lt;BR&gt;Some say spirit communication is more likely to occur if a person had suffered a quick, tragic death, with minimal time to prepare but enough time for emotional thought and feelings to run high, such as what happened in this tragic accident.&lt;BR&gt;The incident took only seconds, but according to the official report there was enough time for very high emotion to have been felt by the passengers and crew.&lt;BR&gt;With this theory in\n mind,&nbsp; Mike will perform ITC sessions at the scene of the crash (exact impact point), and will be using objects from the crash as part of some ITC sessions.&lt;BR&gt;During ITC sessions a number of paranormal devices will be used, some designed by Mike and currently in the prototype stage. &lt;BR&gt;Mike will begin filming &quot;Voices From The Scorched Earth&quot; in late December 2008.&nbsp; Watch for this Paradoc on his Youtube website (Youtube.com/ ufogeek), early in 2009.&lt;/FONT&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;\r\n--0-1297996127-1228986354=:94878--"}