{"id": "13058", "subject": "Re: [EVP-ITC] Re: Request for volunteer researcher assistance", "author": "Cheri Esperon", "timestamp": "2008-12-11T22:37:23Z", "full_text": "I have to agree with Rick, the less information in a situation like \nthis- the better.  When we do investigations, I supply very little \ninformation to my team, as a matter of fact, I prefer to be kept in the \ndark (no pun intended) as much as possible myself.    This type of \nphenomenon is common in many fields, it is simply the power of \nsuggestion, there are hundreds of document cases where a well meaning \nwitness who truly wants to provide accurate & honest information, can be \nled by innocent suggestions.\n\nA really really good example of this is Derren Brown.   Watch this \nvideo...    http://www.youtube.com/watch?v=ZyQjr1YL0zg     Of course, I \ndon&#39;t think Rick nor anyone was suggesting you would intentionally lead \nanyone, but it is sooo easy to do so.\n\n\n\nDavid Koenig wrote:\n&gt;\n&gt; You seem to be assuming a built in prejudice amongst the experimenters \n&gt; here.\n&gt;\n&gt; On Thu, Dec 11, 2008 at 1:32 PM, Rick &lt;rasterer@... \n&gt; &lt;mailto:rasterer@...&gt;&gt; wrote:\n&gt;\n&gt;     Prejudice refers to prejudgment. So, in this case, prejudice meant to\n&gt;     already be ready to hear what someone already described, rather than\n&gt;     listening before you have that information, and so can maximize your\n&gt;     objectivity.\n&gt;\n&gt;     Maybe you could clarify what you meant by my viewpoint? I didn&#39;t\n&gt;     understand the comment.\n&gt;\n&gt;     --- In EVP-ITC@yahoogroups.com &lt;mailto:EVP-ITC%40yahoogroups.com&gt;,\n&gt;     &quot;David Koenig&quot; &lt;floridajakeblues@...&gt;\n&gt;     wrote:\n&gt;\n&gt;\n&gt;     &gt;\n&gt;     &gt; Funny you use the word prejudice. Says a bit about your viewpoint.\n&gt;     &gt;\n&gt;     &gt; On Thu, Dec 11, 2008 at 11:16 AM, Rick &lt;rasterer@...&gt; wrote:\n&gt;     &gt;\n&gt;     &gt; &gt;\n&gt;     &gt; &gt; To insure this testing is objective, wouldn&#39;t it have been\n&gt;     best not\n&gt;     &gt; &gt; to inform everyone what kind of disaster these items were\n&gt;     from? Now\n&gt;     &gt; &gt; that everyone knows they are from a plane crash, that will set\n&gt;     up the\n&gt;     &gt; &gt; prejudice of hearing plane/travel related words in the evp noises.\n&gt;     &gt; &gt; And as you probably know, once that prejudice is active, once\n&gt;     I say\n&gt;     &gt; &gt; &quot;Doesn&#39;t that sound like someone saying\n&gt;     &quot;Sssssstewardesssss...&quot;, then\n&gt;     &gt; &gt; everyone hears THAT word, rather than just noise, or, for example\n&gt;     &gt; &gt; &quot;Stewed ass&quot;.\n&gt;     &gt; &gt;\n&gt;     &gt; &gt; And, if something does sound like a plane/travel related word, it\n&gt;     &gt; &gt; will now be highlighted as an example of why this was a successful\n&gt;     &gt; &gt; test, and the other less-relevant words ignored. This is a form of\n&gt;     &gt; &gt; confirmation bias, which again, hurts the value of the test.\n&gt;     &gt; &gt;\n&gt;     &gt; &gt; A more objective way would have been to send out both crash\n&gt;     related\n&gt;     &gt; &gt; items, and completely innocuous items, with no explanation of\n&gt;     where\n&gt;     &gt; &gt; each was from, and see what kind of EVPs were returned on each.\n&gt;     &gt; &gt; Further, the returned EVPs should then be returned to someone to\n&gt;     &gt; &gt; evaluate who ALSO doesn&#39;t know the origin of the objects, so that\n&gt;     &gt; &gt; they do not torture the interpretations into the forms you\n&gt;     hope and\n&gt;     &gt; &gt; expect them to be (again, plane/travel related). While this\n&gt;     test of\n&gt;     &gt; &gt; course lacks all kinds of controls, this would at least be a\n&gt;     start to\n&gt;     &gt; &gt; defining a double-blind test, which is the gold standard for good\n&gt;     &gt; &gt; research in this kind of research.\n&gt;     &gt; &gt;\n&gt;     &gt; &gt; Even though you have tried to keep some of the information quiet,\n&gt;     &gt; &gt; there is still quite a large opportunity for guessing and\n&gt;     &gt; &gt; coincidence. For example, one person might assume this was from an\n&gt;     &gt; &gt; airshow (since, as you said, the event was very fast, and many\n&gt;     people\n&gt;     &gt; &gt; saw it), and so only send in EVPs that would be relevant to that\n&gt;     &gt; &gt; situation (I.e. Not sending in child-like sounds, or sending in\n&gt;     &gt; &gt; sounds that sound like scratchy tower or inter-plane\n&gt;     &gt; &gt; communication). If the crash was a commercial airline, then dozens\n&gt;     &gt; &gt; of different people could have been killed, which means you could\n&gt;     &gt; &gt; find SOME relevancy no matter what noises are returned to you:\n&gt;     &gt; &gt; practical any word, name, or sound will support some\n&gt;     speculation that\n&gt;     &gt; &gt; it could have been relevant to one of those people.\n&gt;     &gt; &gt;\n&gt;     &gt; &gt; I do think it is a good idea to test your theories. But my purpose\n&gt;     &gt; &gt; here is to suggest ways to help these tests be as objective as\n&gt;     &gt; &gt; possible, and for your efforts and testing to be as worth while as\n&gt;     &gt; &gt; possible, and for the youtube video results you make to be as\n&gt;     &gt; &gt; valuable and bulletproof as possible. But I am concerned that the\n&gt;     &gt; &gt; above scenario is full of opportunity for subjectivity and\n&gt;     &gt; &gt; misinterpretation.\n&gt;     &gt; &gt;\n&gt;     &gt; &gt;\n&gt;     &gt; &gt;\n&gt;     &gt;\n&gt;\n&gt;\n&gt;"}