{"id": "13057", "subject": "Re: Request for volunteer researcher assistance", "author": "Rick", "timestamp": "2008-12-11T22:19:29Z", "full_text": "My purpose was to discuss the testing protocol, to make it as\nobjective as possible, and to minimize possible prejudice.  The\nproblem, is that there could be a predisposition to hear what someone\nhas already described: it is only a possibility, not a certainty. \nBut, since it is possible to minimize this issue with a change in the\ntest, I recommended that.  \n\nMaybe I would better understand your issue if you told me where my\nsuggestions would not add value and objectivity to the test.  I am\nhappy to learn from the group and work out even better testing\nprotocols by discussion and feedback.\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;David Koenig&quot; &lt;floridajakeblues@...&gt;\nwrote:\n&gt;\n&gt; You seem to be assuming a built in prejudice amongst the\nexperimenters here.\n&gt; \n&gt; On Thu, Dec 11, 2008 at 1:32 PM, Rick &lt;rasterer@...&gt; wrote:\n&gt; \n&gt; &gt;   Prejudice refers to prejudgment. So, in this case, prejudice\nmeant to\n&gt; &gt; already be ready to hear what someone already described, rather than\n&gt; &gt; listening before you have that information, and so can maximize your\n&gt; &gt; objectivity.\n&gt; &gt;\n&gt; &gt; Maybe you could clarify what you meant by my viewpoint? I didn&#39;t\n&gt; &gt; understand the comment.\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, &quot;David\nKoenig&quot;\n&gt; &gt; &lt;floridajakeblues@&gt;\n&gt; &gt; wrote:\n&gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; Funny you use the word prejudice. Says a bit about your viewpoint.\n&gt; &gt; &gt;\n&gt; &gt; &gt; On Thu, Dec 11, 2008 at 11:16 AM, Rick &lt;rasterer@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; To insure this testing is objective, wouldn&#39;t it have been\nbest not\n&gt; &gt; &gt; &gt; to inform everyone what kind of disaster these items were\nfrom? Now\n&gt; &gt; &gt; &gt; that everyone knows they are from a plane crash, that will set\nup the\n&gt; &gt; &gt; &gt; prejudice of hearing plane/travel related words in the evp noises.\n&gt; &gt; &gt; &gt; And as you probably know, once that prejudice is active, once\nI say\n&gt; &gt; &gt; &gt; &quot;Doesn&#39;t that sound like someone saying\n&quot;Sssssstewardesssss...&quot;, then\n&gt; &gt; &gt; &gt; everyone hears THAT word, rather than just noise, or, for example\n&gt; &gt; &gt; &gt; &quot;Stewed ass&quot;.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; And, if something does sound like a plane/travel related word, it\n&gt; &gt; &gt; &gt; will now be highlighted as an example of why this was a successful\n&gt; &gt; &gt; &gt; test, and the other less-relevant words ignored. This is a form of\n&gt; &gt; &gt; &gt; confirmation bias, which again, hurts the value of the test.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; A more objective way would have been to send out both crash\nrelated\n&gt; &gt; &gt; &gt; items, and completely innocuous items, with no explanation of\nwhere\n&gt; &gt; &gt; &gt; each was from, and see what kind of EVPs were returned on each.\n&gt; &gt; &gt; &gt; Further, the returned EVPs should then be returned to someone to\n&gt; &gt; &gt; &gt; evaluate who ALSO doesn&#39;t know the origin of the objects, so that\n&gt; &gt; &gt; &gt; they do not torture the interpretations into the forms you\nhope and\n&gt; &gt; &gt; &gt; expect them to be (again, plane/travel related). While this\ntest of\n&gt; &gt; &gt; &gt; course lacks all kinds of controls, this would at least be a\nstart to\n&gt; &gt; &gt; &gt; defining a double-blind test, which is the gold standard for good\n&gt; &gt; &gt; &gt; research in this kind of research.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Even though you have tried to keep some of the information quiet,\n&gt; &gt; &gt; &gt; there is still quite a large opportunity for guessing and\n&gt; &gt; &gt; &gt; coincidence. For example, one person might assume this was from an\n&gt; &gt; &gt; &gt; airshow (since, as you said, the event was very fast, and many\npeople\n&gt; &gt; &gt; &gt; saw it), and so only send in EVPs that would be relevant to that\n&gt; &gt; &gt; &gt; situation (I.e. Not sending in child-like sounds, or sending in\n&gt; &gt; &gt; &gt; sounds that sound like scratchy tower or inter-plane\n&gt; &gt; &gt; &gt; communication). If the crash was a commercial airline, then dozens\n&gt; &gt; &gt; &gt; of different people could have been killed, which means you could\n&gt; &gt; &gt; &gt; find SOME relevancy no matter what noises are returned to you:\n&gt; &gt; &gt; &gt; practical any word, name, or sound will support some\nspeculation that\n&gt; &gt; &gt; &gt; it could have been relevant to one of those people.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; I do think it is a good idea to test your theories. But my purpose\n&gt; &gt; &gt; &gt; here is to suggest ways to help these tests be as objective as\n&gt; &gt; &gt; &gt; possible, and for your efforts and testing to be as worth while as\n&gt; &gt; &gt; &gt; possible, and for the youtube video results you make to be as\n&gt; &gt; &gt; &gt; valuable and bulletproof as possible. But I am concerned that the\n&gt; &gt; &gt; &gt; above scenario is full of opportunity for subjectivity and\n&gt; &gt; &gt; &gt; misinterpretation.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt; &gt;  \n&gt; &gt;\n&gt;"}