{"id": "1306", "subject": "Re: [EVP-ITC] Re: Is there any way to get a franks box ???", "author": "Misty Dawn", "timestamp": "2007-05-20T03:43:44Z", "full_text": "--0-2139313532-1179632624=:77683\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nYeah Frank knows he left a few details out, he mentioned that a while back its why he keeps updating schematics. The ST method is something him and Dave termed, and I just took the idea, ran with it and put it to the test...still testing. So far it works as well for me as any other method tho its sound frequencies can be heard easily by more people.\n   \n  Congrats to you both on your upcoming engagements I wish it wasnt on the other side of the states i&#39;d drop in. I am not much of a &quot;speaker&quot; but I try and get my typing in as much as I can hehehe. Im a big goof when ya stick me in front of a room of people. \n   \n  You should give it a try I think you may be surprised. But again, I am getting great results with all methods as far as my own hearing goes...but I do see others can hear these easier for the most part. It has to do with the frequency levels it hits. Spirit says 5 to 1 people do not have perfect hearing and that is why we all hear so differently and why some agree while others cant hear a thing but static. Think of it as a dog vs human scenario...dog whistles hit that frequency many people cant hear...I hear them but for some its silence....for the dog its very loud and clear. I think they match each recording mediums vibrations and in effect tune into speaking in a way so you can hear them...even if you are the only one that can hear them.\n   \n  Very interesting about the stone circles, I was just thinking of this not too long ago and also researching &quot;singing&quot; stones after I saw a headline about them on the news. They do exist. Some also have electromagnetic functions which come into play. I love rocks, always have, and I have collected them since I was small long before I knew as much as I know now. They also play a big part in some of my ITC images that have come thru. They still shock me with the clarity sometimes. \n   \n  It is all very very humbling for me. I am nobody special, not someone who wants to be famous, nor one who would have ever thought I would/could be involved doing research on something such as this for so long and remain so dedicated (or is that addicted LOL) but one small voice sent me on a sharp turn and now I am on this path. \n   \n  Paranormal has always been just normal...now moreso than ever. I think perhaps they have always been watching me and they are the voices that kept me awake at night, the invisible person sitting on my bedside so I couldnt fall asleep and would scream for my mama to come stay with me until I fell asleep. I could probably name 1000 things that I have witnessed and others have witnessed over my lifetime but too tired to start that list tonight LOL\n\n  I never realized how closed my eyes were until they opened wider. I always knew what was there I just never realized it in detail.\n   \n  Misty\nGuy &lt;yzzzguy@...&gt; wrote:\n          Thanks, Bill! (Pssst...check is in the mail...he he)\n\nI want to make it clear that I was NOT criticizing Frank about his \nbox or the document! It&#39;s just that I read it over thoroughly \nyesterday and found some things that were missing or unreadable. \nOtherwise - it&#39;s the only &quot;one-stop shopping&quot; for details on Frank&#39;s \nbox. The setup is not rocket science...anyone versed in electronics \ncould build one and even improve on the design (I have several \nthoughts on that).\n\nI haven&#39;t had a chance to check out Misty&#39;s &quot;sweep tuning&quot; method \nbut just that name seems to indicate something close to the &quot;manual&quot; \nway of creating Frank&#39;s box as I previously mentioned (i.e. randomly \npushing radio buttons).\n\nLastly - as Bill said - he and I will be presenters at the \nconference in July. My particular presentation (which I&#39;m still \npiecing together) will be on Paranormal Sound Phenomena. Rather than \nrehash techniques for recording/analyzing EVP - I plan on going into \nmore depth on present/past research in paranormal sounds (such as \nplaying the first spirit voices ever recorded, ultrasonic pulses \ndetected at stone circles, etc.) and make a plea to participants to \nstretch beyond present emphasis on just recording said sounds but \nget into broader research projects. I&#39;m not one to &quot;toot my own \nhorn&quot; but I&#39;m also slated to appear on the June 3 show of Ghostly \nTalk (http://www.ghostlytalk.com) to go into more depth on the \nfamous (or infamous) Spiricom Mark IV story.\n\nGuy\n\n--- In EVP-ITC@yahoogroups.com, &quot;psi_research&quot; &lt;vilhellm@...&gt; wrote:\n&gt;\n&gt; To expand upon Guy&#39;s post, the echo chamber size can vary. Some of \nhis\n&gt; boxes have an internal chamber that&#39;s about 2&quot; x 3.5&quot;. Some of his\n&gt; boxes have chambers which are external and are a bit larger. An\n&gt; external one I saw was made with a light wood frame which was \nwrapped\n&gt; in heavy aluminum foil.\n&gt; \n&gt; If someone is considering constructing their own FB then I suggest\n&gt; considering the sweep tuning method also as the recordings I&#39;ve \nheard\n&gt; are impressive. We are experimenting with a RVG equipped box and \nare\n&gt; getting good results but I am also interested in the sweep tuning\n&gt; approach.\n&gt; \n&gt; By the way, Guy and myself both be speaking at the upcoming South\n&gt; Coast Paranormal Convention July 20 and 21 in Santa Paula, CA. see\n&gt; link: http://www.woodwardpsychic.com/ \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Guy&quot; &lt;yzzzguy@&gt; wrote:\n\n\n\n         \n\n       \n---------------------------------\nGive spam the boot. Take control with tough spam protection\nin the all-new Yahoo! Mail Beta.\r\n--0-2139313532-1179632624=:77683\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;div&gt;Yeah Frank knows he left a few details out, he mentioned that a while back its why he keeps updating schematics. The ST method is something him and Dave termed, and I just took the idea, ran with it&nbsp;and put it to the test...still testing. So far it works as well for me as any other method tho its sound frequencies can be heard easily by more people.&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Congrats to you both on your upcoming engagements I wish it wasnt on the other side of the states i&#39;d drop in. I am not much of a &quot;speaker&quot; but I try and get my typing in as much as I can hehehe. Im a big goof when ya stick me in front of a room of people. &lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;You should give it a try I think you may be surprised. But again, I am getting great results with all methods as far as my own hearing goes...but I do see others can hear these easier for the most part. It has to do with the frequency levels it hits. Spirit says 5 to 1 people do not have perfect hearing\n and that is why we all hear so differently and why some agree while others cant hear a thing but static. Think of it as a dog vs human scenario...dog whistles hit that frequency many people cant hear...I hear them but for some its silence....for the dog its very loud and clear. I think they match each recording mediums vibrations and in effect tune into speaking in a way so you can hear them...even if you are the only one that can hear them.&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Very interesting about the stone circles, I was just thinking of this not too long ago and also researching &quot;singing&quot; stones after I saw a headline about them on the news. They do exist. Some also have electromagnetic functions which come into play. I love rocks, always have, and I have collected them since I was small long before I knew as much as I know now. They also play a big part in some of my&nbsp;ITC images that have come thru. They still shock me with the clarity sometimes. &lt;/div&gt; \n &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;It is all very very&nbsp;humbling for me. I am nobody special, not someone who wants to be famous, nor one who would have ever thought I would/could be involved doing research on something such as this for so long and remain so dedicated (or is that addicted LOL) but one small voice sent me on a sharp turn and now I am on this path. &lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Paranormal has always been just normal...now moreso than ever. I think perhaps they have always been watching me and they are the voices that kept me awake at night, the invisible person sitting on my bedside so I couldnt fall asleep and would scream for my mama to come stay with me until I fell asleep. I could probably name 1000 things that I have witnessed and others have witnessed over my lifetime but too tired to start that list tonight LOL&lt;BR&gt;&lt;/div&gt;  &lt;div&gt;I never realized how closed my eyes were until they opened wider. I always knew what was there I just never realized it in\n detail.&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Misty&lt;BR&gt;&lt;B&gt;&lt;I&gt;Guy &lt;yzzzguy@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/div&gt;  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;&lt;!-- Network content --&gt;  &lt;DIV id=ygrp-text&gt;  &lt;div&gt;Thanks, Bill! (Pssst...check is in the mail...he he)&lt;BR&gt;&lt;BR&gt;I want to make it clear that I was NOT criticizing Frank about his &lt;BR&gt;box or the document! It&#39;s just that I read it over thoroughly &lt;BR&gt;yesterday and found some things that were missing or unreadable. &lt;BR&gt;Otherwise - it&#39;s the only &quot;one-stop shopping&quot; for details on Frank&#39;s &lt;BR&gt;box. The setup is not rocket science...anyone versed in electronics &lt;BR&gt;could build one and even improve on the\n design (I have several &lt;BR&gt;thoughts on that).&lt;BR&gt;&lt;BR&gt;I haven&#39;t had a chance to check out Misty&#39;s &quot;sweep tuning&quot; method &lt;BR&gt;but just that name seems to indicate something close to the &quot;manual&quot; &lt;BR&gt;way of creating Frank&#39;s box as I previously mentioned (i.e. randomly &lt;BR&gt;pushing radio buttons).&lt;BR&gt;&lt;BR&gt;Lastly - as Bill said - he and I will be presenters at the &lt;BR&gt;conference in July. My particular presentation (which I&#39;m still &lt;BR&gt;piecing together) will be on Paranormal Sound Phenomena. Rather than &lt;BR&gt;rehash techniques for recording/analyzing EVP - I plan on going into &lt;BR&gt;more depth on present/past research in paranormal sounds (such as &lt;BR&gt;playing the first spirit voices ever recorded, ultrasonic pulses &lt;BR&gt;detected at stone circles, etc.) and make a plea to participants to &lt;BR&gt;stretch beyond present emphasis on just recording said sounds but &lt;BR&gt;get into broader research projects. I&#39;m not one to &quot;toot my own &lt;BR&gt;horn&quot; but I&#39;m also slated to appear on the June 3 show of\n Ghostly &lt;BR&gt;Talk (&lt;A href=&quot;http://www.ghostlytalk.com/&quot;&gt;http://www.ghostlyt&lt;WBR&gt;alk.com&lt;/A&gt;) to go into more depth on the &lt;BR&gt;famous (or infamous) Spiricom Mark IV story.&lt;BR&gt;&lt;BR&gt;Guy&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;, &quot;psi_research&quot; &lt;vilhellm@..&lt;WBR&gt;.&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; To expand upon Guy&#39;s post, the echo chamber size can vary. Some of &lt;BR&gt;his&lt;BR&gt;&gt; boxes have an internal chamber that&#39;s about 2&quot; x 3.5&quot;. Some of his&lt;BR&gt;&gt; boxes have chambers which are external and are a bit larger. An&lt;BR&gt;&gt; external one I saw was made with a light wood frame which was &lt;BR&gt;wrapped&lt;BR&gt;&gt; in heavy aluminum foil.&lt;BR&gt;&gt; &lt;BR&gt;&gt; If someone is considering constructing their own FB then I suggest&lt;BR&gt;&gt; considering the sweep tuning method also as the recordings I&#39;ve &lt;BR&gt;heard&lt;BR&gt;&gt; are impressive. We are experimenting with a RVG equipped box and &lt;BR&gt;are&lt;BR&gt;&gt; getting good results but I am also interested in the sweep\n tuning&lt;BR&gt;&gt; approach.&lt;BR&gt;&gt; &lt;BR&gt;&gt; By the way, Guy and myself both be speaking at the upcoming South&lt;BR&gt;&gt; Coast Paranormal Convention July 20 and 21 in Santa Paula, CA. see&lt;BR&gt;&gt; link: &lt;A href=&quot;http://www.woodwardpsychic.com/&quot;&gt;http://www.woodward&lt;WBR&gt;psychic.com/&lt;/A&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; --- In &lt;A href=&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;, &quot;Guy&quot; &lt;yzzzguy@&gt; wrote:&lt;BR&gt;&lt;BR&gt;&lt;/div&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;p&gt;&#32;\n      &lt;hr size=1&gt;Give spam the boot. Take control with &lt;a href=&quot;http://us.rd.yahoo.com/evt=47960/*http://advision.webevents.yahoo.com/mailbeta/newmail_html.html&quot;&gt;tough spam protection&lt;/a&gt;&lt;br&gt;in the all-new Yahoo! Mail Beta.\n\r\n--0-2139313532-1179632624=:77683--"}