{"id": "13063", "subject": "Re: [EVP-ITC] Request for volunteer researcher assistance", "author": "Ron Lederer", "timestamp": "2008-12-12T04:17:35Z", "full_text": "--0-921542504-1229055455=:49139\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nHi Mike=A0=A0 When would you want to begin and then complete the recordings=\r\n?=A0 Also, I wouldn&#39;t worry too much about the parameters of this test.=A0=\r\n=A0You know your objectives.=A0 You might want to ask others who are not pa=\r\nrticipating in the material aspect of the test to=A0do a session for you wi=\r\nthout the materials and post what they get.=A0 Accept comments about the te=\r\nst AFTER=A0they post something.=A0 Let any=A0debate start after there is so=\r\nmething on file to listen to from the others.=A0=A0My thoughts.=A0=A0 ron l=\r\n=A0=A0=A0\n\n--- On Wed, 12/10/08, M.A. Coletta (Mike) &lt;michaelcoletta@yahoo.=\r\ncom&gt; wrote:\n\nFrom: M.A. Coletta (Mike) &lt;michaelcoletta@...&gt;\nSubject: =\r\n[EVP-ITC] Request for volunteer researcher assistance\nTo: EVP-ITC@yahoogrou=\r\nps.com\nDate: Wednesday, December 10, 2008, 3:35 PM\n\n\n\n\n\n\n\nI am looking for =\r\n5 - 10 researchers to voluntarily participate in an effort that will become=\r\n a part of the mini-documentary I am planning to begin filming later this m=\r\nonth.=A0 When completed early in 2009 I will be placing this video on my Yo=\r\nutube site for all to view. Freely sharing our research is the key!=A0 If y=\r\nou are one that participates, I&#39;d like to be able to mention you and displa=\r\ny your work in the video.\nThe subject of the research is:\nAttempted spirit =\r\ncontact using an object associated with a disaster as a catalysis for a spe=\r\ncific contact... away from the scene of the disaster.\nIf selected, the volu=\r\nnteer researcher will be mailed a small amount of material associated with =\r\nthe aircraft crash in question.=A0 This crash debris was obtained after all=\r\n litigation was complete and a salvage company had purchased all debris fro=\r\nm the airline company.\nNote: There are no health hazards associated with th=\r\ne debris.\nNote: The detailed information about the crash is not being givin=\r\ng at this time in order to make it a controlled ITC experiment.=A0 This way=\r\n the audio files I receive from participants may or may not contain informa=\r\ntion about those who perished or information about their life.=A0 I alone k=\r\nnow that information at this time.\nIt won&#39;t take much of your time.=A0 All =\r\nI ask from the selected researchers are five, 30 second audio files of atte=\r\nmpted spirit contact, using a method of the researcher&#39;s choice.=A0 The cra=\r\nsh debris you will be provided must be used in association with the attempt=\r\ned contacts. (Close proximity to the recording device is encouraged.)\nYou c=\r\nan e-mail me the audio files, along with a text explanation of how the file=\r\ns were captured when you complete you research. (Method used, how debris wa=\r\ns used, etc.)\nIf you are interested in volunteering, please send me a priva=\r\nte e-mail through this forum and tell me a bit about yourself and what meth=\r\nod you currently use.=A0 If you are one of those selected I will reply to y=\r\nour e-mail, asking for a mailing address to send the object debris (which w=\r\nill arrive in a small padded envelope.)=A0 I don&#39;t need the debris back, so=\r\n keep it if you wish...\nThanks!\n- Mike C. (UFO Geek) www.ufogeek. com\n\nBelo=\r\nw is some information about the video.\nA new documentary coming in early 20=\r\n09\n&quot;Voices From The Scorched Earth&quot;... A paranormal documentary (&quot;Paradoc&quot;)=\r\n about contact with those who perished in a commercial jetliner crash which=\r\n claimed all on-board.\nThe 4g+ crash impact being so violent, all passenger=\r\ns and crew died instantly.=A0 They had only a matter of seconds prior to th=\r\neir terrifying vertical plunge. Witnesses described the aftermath scene as =\r\nmore gruesome than they had ever experienced.\nSome say spirit communication=\r\n is more likely to occur if a person had suffered a quick, tragic death, wi=\r\nth minimal time to prepare but enough time for emotional thought and feelin=\r\ngs to run high, such as what happened in this tragic accident.\nThe incident=\r\n took only seconds, but according to the official report there was enough t=\r\nime for very high emotion to have been felt by the passengers and crew.\nWit=\r\nh this theory in mind,=A0 Mike will perform ITC sessions at the scene of th=\r\ne crash (exact impact point), and will be using objects from the crash as p=\r\nart of some ITC sessions.\nDuring ITC sessions a number of paranormal device=\r\ns will be used, some designed by Mike and currently in the prototype stage.=\r\n \nMike will begin filming &quot;Voices From The Scorched Earth&quot; in late December=\r\n 2008.=A0 Watch for this Paradoc on his Youtube website (Youtube.com/ ufoge=\r\nek), early in 2009. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n      \r\n--0-921542504-1229055455=:49139\r\nContent-Type: text/html; charset=us-ascii\r\n\r\n&lt;table cellspacing=&quot;0&quot; cellpadding=&quot;0&quot; border=&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=&quot;top&quot; style=&quot;font: inherit;&quot;&gt;Hi Mike&nbsp;&nbsp; When would you want to begin and then complete the recordings?&nbsp; Also, I wouldn&#39;t worry too much about the parameters of this test.&nbsp;&nbsp;You know your objectives.&nbsp; You might want to ask others who are not participating in the material aspect of the test to&nbsp;do a session for you without the materials and post what they get.&nbsp; Accept comments about the test AFTER&nbsp;they post something.&nbsp; Let any&nbsp;debate start after there is something on file to listen to from the others.&nbsp;&nbsp;My thoughts.&nbsp;&nbsp; ron l&nbsp;&nbsp;&nbsp;&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Wed, 12/10/08, M.A. Coletta (Mike) &lt;I&gt;&lt;michaelcoletta@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: rgb(16,16,255) 2px solid&quot;&gt;From: M.A. Coletta (Mike) &lt;michaelcoletta@...&gt;&lt;BR&gt;Subject: [EVP-ITC] Request for volunteer researcher assistance&lt;BR&gt;To: EVP-ITC@yahoogroups.com&lt;BR&gt;Date: Wednesday, December 10, 2008, 3:35 PM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=yiv717355033&gt;\n&lt;DIV id=ygrp-text&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;I am looking for 5 - 10 researchers to voluntarily participate in an effort that will become a part of the mini-documentary I am planning to begin filming later this month.&nbsp; When completed early in 2009 I will be placing this video on my Youtube site for all to view. Freely sharing our research is the key!&nbsp; If you are one that participates, I&#39;d like to be able to mention you and display your work in the video.&lt;/DIV&gt;\n&lt;DIV&gt;&lt;STRONG&gt;The subject of the research is:&lt;/STRONG&gt;&lt;BR&gt;Attempted spirit contact using an object associated with a disaster as a catalysis for a specific contact... away from the scene of the disaster.&lt;/DIV&gt;\n&lt;DIV&gt;If selected, the volunteer researcher will be mailed a small amount of material associated with the aircraft crash in question.&nbsp; This crash debris was obtained after all litigation was complete and a salvage company had purchased all debris from the airline company.&lt;BR&gt;Note: There are no health hazards associated with the debris.&lt;BR&gt;Note: The detailed information about the crash is not being giving at this time in order to make it a controlled ITC experiment.&nbsp; This way the audio files I receive from participants may or may not contain information about those who perished or information about their life.&nbsp; I alone know that information at this time.&lt;/DIV&gt;\n&lt;DIV&gt;It won&#39;t take much of your time.&nbsp; All I ask from the selected researchers are five, 30 second audio files of attempted spirit contact, using a method of the researcher&#39;s choice.&nbsp; The crash debris you will be provided must be used in association with the attempted contacts. (Close proximity to the recording device is encouraged.)&lt;BR&gt;You can e-mail me the audio files, along with a text explanation of how the files were captured when you complete you research. (Method used, how debris was used, etc.)&lt;/DIV&gt;\n&lt;DIV&gt;If you are interested in volunteering, please send me a private e-mail through this forum and tell me a bit about yourself and what method you currently use.&nbsp; If you are one of those selected I will reply to your e-mail, asking for a mailing address to send the object debris (which will arrive in a small padded envelope.)&nbsp; I don&#39;t need the debris back, so keep it if you wish...&lt;/DIV&gt;\n&lt;DIV&gt;Thanks!&lt;BR&gt;- Mike C. (UFO Geek) &lt;A href=&quot;http://www.ufogeek.com/&quot; target=_blank rel=nofollow&gt;www.ufogeek. com&lt;/A&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;Below is some information about the video.&lt;BR&gt;&lt;FONT size=1&gt;A new documentary coming in early 2009&lt;BR&gt;&quot;Voices From The Scorched Earth&quot;... A paranormal documentary (&quot;Paradoc&quot;) about contact with those who perished in a commercial jetliner crash which claimed all on-board.&lt;BR&gt;The 4g+ crash impact being so violent, all passengers and crew died instantly.&nbsp; They had only a matter of seconds prior to their terrifying vertical plunge. Witnesses described the aftermath scene as more gruesome than they had ever experienced.&lt;BR&gt;Some say spirit communication is more likely to occur if a person had suffered a quick, tragic death, with minimal time to prepare but enough time for emotional thought and feelings to run high, such as what happened in this tragic accident.&lt;BR&gt;The incident took only seconds, but according to the official report there was enough time for very high emotion to have been felt by the passengers and crew.&lt;BR&gt;With this theory in\n mind,&nbsp; Mike will perform ITC sessions at the scene of the crash (exact impact point), and will be using objects from the crash as part of some ITC sessions.&lt;BR&gt;During ITC sessions a number of paranormal devices will be used, some designed by Mike and currently in the prototype stage. &lt;BR&gt;Mike will begin filming &quot;Voices From The Scorched Earth&quot; in late December 2008.&nbsp; Watch for this Paradoc on his Youtube website (Youtube.com/ ufogeek), early in 2009.&lt;/FONT&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n      \r\n--0-921542504-1229055455=:49139--"}