{"id": "13065", "subject": "Re: Request for volunteer researcher assistance", "author": "Rick", "timestamp": "2008-12-12T15:33:10Z", "full_text": "Thanks for the clarification Mike.  I would still warn that, even in \nyour experiment here, you yourself could become your own weak link in\nobjectivity.  As Cheri pointed out, even someone with the best \nintentions, who truly wants to provide accurate & honest information,\nis only human and subject to error.  This is especially true if they\nhave already decided which parts of their theories are right or wrong,\nwithout, again, objective testing.  This is not a phenomenon that only\neffects the home experimenter, but experts in all fields, and they\nhave learned of methods over time (such as the double blind testing I\nmentioned) to help weed out weak processes and develop and explore\ntheir theories on the firmest foundations possible.\n\nBut I understand you are not trying to prove or test anything in this\ncase, or use them to claim any kind of proof: you&#39;re just trying an\nexperiment.  So, good luck with it.\n\n \n\n\n--- In EVP-ITC@yahoogroups.com, &quot;M.A. Coletta (Mike)&quot;\n&lt;michaelcoletta@...&gt; wrote:\n&gt;\n&gt; I understand where Rick is coming from, BUT his suggestion is a good \n&gt; example of how to conduct the test IF I were testing those I asked to \n&gt; help, which I&#39;m not.  This is not a test, just a means of gathering \n&gt; audio with the use of material associated with a plane crash, at a \n&gt; location other than where the crash happened.\n&gt; \n&gt; All I asked them to do is provide five, 30 second audio files which \n&gt; they record while using the pieces of debris I will be sending them.\n&gt; I have faith in the researchers on this forum who have volunteered \n&gt; (six people so far have been selected).  \n&gt; \n&gt; Whatever is found on the audio files will be studied, and since I \n&gt; will be the one listening to the recordings, and since I already know \n&gt; all the details of the incident, I have not set my mind to \n&gt; predetermine anything.\n&gt; \n&gt; Yes, a different type of test could have been done, and I could have \n&gt; hidden all information, but that would not have mattered for this \n&gt; effort, since the outcome is to only get the audio files, what ever \n&gt; may be found on them.\n&gt; \n&gt; Thanks to those who have volunteered, I cound still use four more \n&gt; people too.\n&gt; \n&gt; - Mike C.\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Cheri Esperon &lt;cesperon@&gt; wrote:\n&gt; &gt;\n&gt; &gt; I have to agree with Rick, the less information in a situation like \n&gt; &gt; this- the better.  When we do investigations, I supply very little \n&gt; &gt; information to my team, as a matter of fact, I prefer to be kept in \n&gt; the \n&gt; &gt; dark (no pun intended) as much as possible myself.    This type of \n&gt; &gt; phenomenon is common in many fields, it is simply the power of \n&gt; &gt; suggestion, there are hundreds of document cases where a well \n&gt; meaning \n&gt; &gt; witness who truly wants to provide accurate & honest information, \n&gt; can be \n&gt; &gt; led by innocent suggestions.\n&gt; &gt; \n&gt; &gt; A really really good example of this is Derren Brown.   Watch this \n&gt; &gt; video...    http://www.youtube.com/watch?v=ZyQjr1YL0zg     Of \n&gt; course, I \n&gt; &gt; don&#39;t think Rick nor anyone was suggesting you would intentionally \n&gt; lead \n&gt; &gt; anyone, but it is sooo easy to do so.\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; David Koenig wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; You seem to be assuming a built in prejudice amongst the \n&gt; experimenters \n&gt; &gt; &gt; here.\n&gt; &gt; &gt;\n&gt; &gt; &gt; On Thu, Dec 11, 2008 at 1:32 PM, Rick &lt;rasterer@ \n&gt; &gt; &gt; &lt;mailto:rasterer@&gt;&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt;     Prejudice refers to prejudgment. So, in this case, prejudice \n&gt; meant to\n&gt; &gt; &gt;     already be ready to hear what someone already described, \n&gt; rather than\n&gt; &gt; &gt;     listening before you have that information, and so can \n&gt; maximize your\n&gt; &gt; &gt;     objectivity.\n&gt; &gt; &gt;\n&gt; &gt; &gt;     Maybe you could clarify what you meant by my viewpoint? I \n&gt; didn&#39;t\n&gt; &gt; &gt;     understand the comment.\n&gt; &gt; &gt;\n&gt; &gt; &gt;     --- In EVP-ITC@yahoogroups.com &lt;mailto:EVP-ITC%\n&gt; 40yahoogroups.com&gt;,\n&gt; &gt; &gt;     &quot;David Koenig&quot; &lt;floridajakeblues@&gt;\n&gt; &gt; &gt;     wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;     &gt;\n&gt; &gt; &gt;     &gt; Funny you use the word prejudice. Says a bit about your \n&gt; viewpoint.\n&gt; &gt; &gt;     &gt;\n&gt; &gt; &gt;     &gt; On Thu, Dec 11, 2008 at 11:16 AM, Rick &lt;rasterer@&gt; wrote:\n&gt; &gt; &gt;     &gt;\n&gt; &gt; &gt;     &gt; &gt;\n&gt; &gt; &gt;     &gt; &gt; To insure this testing is objective, wouldn&#39;t it have been\n&gt; &gt; &gt;     best not\n&gt; &gt; &gt;     &gt; &gt; to inform everyone what kind of disaster these items were\n&gt; &gt; &gt;     from? Now\n&gt; &gt; &gt;     &gt; &gt; that everyone knows they are from a plane crash, that \n&gt; will set\n&gt; &gt; &gt;     up the\n&gt; &gt; &gt;     &gt; &gt; prejudice of hearing plane/travel related words in the \n&gt; evp noises.\n&gt; &gt; &gt;     &gt; &gt; And as you probably know, once that prejudice is active, \n&gt; once\n&gt; &gt; &gt;     I say\n&gt; &gt; &gt;     &gt; &gt; &quot;Doesn&#39;t that sound like someone saying\n&gt; &gt; &gt;     &quot;Sssssstewardesssss...&quot;, then\n&gt; &gt; &gt;     &gt; &gt; everyone hears THAT word, rather than just noise, or, for \n&gt; example\n&gt; &gt; &gt;     &gt; &gt; &quot;Stewed ass&quot;.\n&gt; &gt; &gt;     &gt; &gt;\n&gt; &gt; &gt;     &gt; &gt; And, if something does sound like a plane/travel related \n&gt; word, it\n&gt; &gt; &gt;     &gt; &gt; will now be highlighted as an example of why this was a \n&gt; successful\n&gt; &gt; &gt;     &gt; &gt; test, and the other less-relevant words ignored. This is \n&gt; a form of\n&gt; &gt; &gt;     &gt; &gt; confirmation bias, which again, hurts the value of the \n&gt; test.\n&gt; &gt; &gt;     &gt; &gt;\n&gt; &gt; &gt;     &gt; &gt; A more objective way would have been to send out both \n&gt; crash\n&gt; &gt; &gt;     related\n&gt; &gt; &gt;     &gt; &gt; items, and completely innocuous items, with no \n&gt; explanation of\n&gt; &gt; &gt;     where\n&gt; &gt; &gt;     &gt; &gt; each was from, and see what kind of EVPs were returned on \n&gt; each.\n&gt; &gt; &gt;     &gt; &gt; Further, the returned EVPs should then be returned to \n&gt; someone to\n&gt; &gt; &gt;     &gt; &gt; evaluate who ALSO doesn&#39;t know the origin of the objects, \n&gt; so that\n&gt; &gt; &gt;     &gt; &gt; they do not torture the interpretations into the forms you\n&gt; &gt; &gt;     hope and\n&gt; &gt; &gt;     &gt; &gt; expect them to be (again, plane/travel related). While \n&gt; this\n&gt; &gt; &gt;     test of\n&gt; &gt; &gt;     &gt; &gt; course lacks all kinds of controls, this would at least \n&gt; be a\n&gt; &gt; &gt;     start to\n&gt; &gt; &gt;     &gt; &gt; defining a double-blind test, which is the gold standard \n&gt; for good\n&gt; &gt; &gt;     &gt; &gt; research in this kind of research.\n&gt; &gt; &gt;     &gt; &gt;\n&gt; &gt; &gt;     &gt; &gt; Even though you have tried to keep some of the \n&gt; information quiet,\n&gt; &gt; &gt;     &gt; &gt; there is still quite a large opportunity for guessing and\n&gt; &gt; &gt;     &gt; &gt; coincidence. For example, one person might assume this \n&gt; was from an\n&gt; &gt; &gt;     &gt; &gt; airshow (since, as you said, the event was very fast, and \n&gt; many\n&gt; &gt; &gt;     people\n&gt; &gt; &gt;     &gt; &gt; saw it), and so only send in EVPs that would be relevant \n&gt; to that\n&gt; &gt; &gt;     &gt; &gt; situation (I.e. Not sending in child-like sounds, or \n&gt; sending in\n&gt; &gt; &gt;     &gt; &gt; sounds that sound like scratchy tower or inter-plane\n&gt; &gt; &gt;     &gt; &gt; communication). If the crash was a commercial airline, \n&gt; then dozens\n&gt; &gt; &gt;     &gt; &gt; of different people could have been killed, which means \n&gt; you could\n&gt; &gt; &gt;     &gt; &gt; find SOME relevancy no matter what noises are returned to \n&gt; you:\n&gt; &gt; &gt;     &gt; &gt; practical any word, name, or sound will support some\n&gt; &gt; &gt;     speculation that\n&gt; &gt; &gt;     &gt; &gt; it could have been relevant to one of those people.\n&gt; &gt; &gt;     &gt; &gt;\n&gt; &gt; &gt;     &gt; &gt; I do think it is a good idea to test your theories. But \n&gt; my purpose\n&gt; &gt; &gt;     &gt; &gt; here is to suggest ways to help these tests be as \n&gt; objective as\n&gt; &gt; &gt;     &gt; &gt; possible, and for your efforts and testing to be as worth \n&gt; while as\n&gt; &gt; &gt;     &gt; &gt; possible, and for the youtube video results you make to \n&gt; be as\n&gt; &gt; &gt;     &gt; &gt; valuable and bulletproof as possible. But I am concerned \n&gt; that the\n&gt; &gt; &gt;     &gt; &gt; above scenario is full of opportunity for subjectivity and\n&gt; &gt; &gt;     &gt; &gt; misinterpretation.\n&gt; &gt; &gt;     &gt; &gt;\n&gt; &gt; &gt;     &gt; &gt;\n&gt; &gt; &gt;     &gt; &gt;\n&gt; &gt; &gt;     &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}