{"id": "13074", "subject": "Re: [EVP-ITC]cpl question for team investigators", "author": "M.A. Coletta (Mike)", "timestamp": "2008-12-13T13:43:12Z", "full_text": "Hi Rhonda,\n\nMy opinion follows:\nWhat you are seeing is for entertainment purposes.  The production \ncompanies know that they can not capture and keep an audience with \nslow or no action, and a theme that drags on.\nThey need that high energy spark to keep the viewers coming back, \nespecially viewers who are not able to get out and do investigations \nas much as they&#39;d like or for those that have never done an \ninvestgation, but like ghost hunting stuff.\n\nTheir show ratings depend on viewer numbers which equate to \nadvertising dollars.  That is the bottom line for any show and \nentertainment venue on TV or radio.\n\nSo... what you are seeing with all that over-drama stuff is for \nentertainment and shouldn&#39;t be taken as serious investigation.\n\nThat&#39;s how I see it at least, and that&#39;s why I don&#39;t usually watch \nthose type shows, although I will check them out once-in-awhile to \nsee if they are using any type of new tool or paranormal device.\n\nShows like &quot;Haunting Evidence&#39; that don&#39;t have screamng, running, and \nconstant yapping when none should be happening, don&#39;t last.\n&#39;Haunting Evidence&#39; was just dropped from the TruTV lineup. They \ntried to be a more serious documentary type show, whether they really \nwere or not? But it didn&#39;t work for the rating numbers.\n\nI think you&#39;ll be seeing more and more of the &#39;entertainment&#39; type \ninvestigation shows being put on a number of different networks, \nbecause that&#39;s what&#39;s selling right now.\n\nRhonda, the type of good manners investigation you are describing \ndoes happen I&#39;m guessing in many groups around the world, when a \nproduction company is not involved.  Get that production company \ninvolved... and the entertainment factor takes over.\n\n- Mike C. (UFO Geek)\nwww.ufogeek.com\n\n\n--- In EVP-ITC@yahoogroups.com, Rhonda W &lt;rhondak1973@...&gt; wrote:\n&gt;\n&gt; Im sitting here watching Ghost Hunters...and I know alot of it is \ndone for drama purposes...but Im curious...when ya&#39;ll are out on an \ninvestigation do you talk as much as they do? I can hardly hear \nanything over them chatting. Also I notice a cpl of their people \nfreak out when they get knocks or other responses...nobody ever says \nhey thanks for the effort you put into responding or great job or \nanything like that..its always wtf was that, what the hell is going \non in here, etc...do ya&#39;ll say thanks and compliment the efforts of \nthe responding spirits? Ive never been on an investigation with a \nteam so Im kinda curious how different groups work and run things.\n(wish I knew people in arizona I could go on an investigation with) \nI know when I do my research here with my radio shack hack I always \nsay thanks and am polite and have never freaked out or cussed in \nresponse to one of the responses Ive gotten. Anyways just curious. \nHope everyone has a\n&gt;  great weekend!\n&gt; \n&gt; Rhonda\n&gt;"}