{"id": "13076", "subject": "Re: [EVP-ITC]cpl question for team investigators", "author": "Cheri Esperon", "timestamp": "2008-12-13T16:17:08Z", "full_text": "It depends on what is going on.  Since the focus on the investigation is \nmore than just gathering EVPs  sometimes there needs to be more \nchatter.   Actual investigations can take hours and sometimes several \nvisits, so what you see on a show is maybe 8-10 hours compressed into 45 \nminutes.     As far as thanking the spirits, again it depends on what is \nneeded and the personality of the investigator.\n\nResearching at home is a lot different- at home you are in your comfort \nzone,  I have a residual energy that walks down my hallway, I have seen \nit a hundred times, and it never freaks me out.  But if I see something \nout on an investigation- in a strange location where I am out of my \ncomfort zone, it will freak me out a little-- get the heart racing.  And \nI have been known to ask what the H-E double hockey sticks was that?  \nNow I will run towards something- others instinctively  start to run \naway- again it depends the personality and experience of the \ninvestigator, lol and the vocabulary.\n\nIn a team envvironment usually and in my opinion, hopefully, you have a \nvariety of styles and personalities.  I personally think that works \nbetter since you never know who might attract a response.\n\nRhonda W wrote:\n&gt;\n&gt; Im sitting here watching Ghost Hunters...and I know alot of it is done \n&gt; for drama purposes...but Im curious...when ya&#39;ll are out on an \n&gt; investigation do you talk as much as they do?  I can hardly hear \n&gt; anything over them chatting.  Also I notice a cpl of their people \n&gt; freak out when they get knocks or other responses...nobody ever says \n&gt; hey thanks for the effort you put into responding or great job or \n&gt; anything like that..its always wtf was that, what the hell is going on \n&gt; in here, etc...do ya&#39;ll say thanks and compliment the efforts of the \n&gt; responding spirits?  Ive never been on an investigation with a team so \n&gt; Im kinda curious how different groups work and run things.(wish I knew \n&gt; people in arizona I could go on an investigation with)  I know when I \n&gt; do my research here with my radio shack hack I always say thanks and \n&gt; am polite and have never freaked out or cussed in response to one of \n&gt; the responses Ive gotten.  Anyways just curious.  Hope everyone has a \n&gt; great weekend!\n&gt; Rhonda\n&gt;\n&gt;\n&gt;"}