{"id": "13088", "subject": "Re: radio shack box", "author": "northernilghosthuntingteam", "timestamp": "2008-12-14T03:29:21Z", "full_text": "Thanks for your input Suzane. Im gald people are trying to help me \nwith different options. I have tried esnips and after a week I wanted \nto throw esnips out the window....it took me almost 10 tries just to \nget an account without errors and tyring to make a folder was the \nsame. Then uploading into the folder had various errors. Reading \nforums in esnips it states that they changed &quot;management&quot; and that \nsome things weren&#39;t running best but to be patient. I tried but I \nwansnt even able to post in the forums to ask for help. I emailed \nsupport 4 times without a response. I was told that esnips is good by \nsome people and that they have never had trobles. As far as this \nparticular clip its the first time I have saved an audio file as mp3. \nIt dose play on my computer and it plays for me online but Im \nwondering if changing the format has anything to do with why it wont \nplay for anyone esle. \n\n--- In EVP-ITC@yahoogroups.com, suzanne bibb &lt;suzyq6819@...&gt; wrote:\n&gt;\n&gt; Hi Sarah!\n&gt; \n&gt; have you tried up loading your file to esnips?? \nhttp://www.esnips.com\n&gt; \n&gt; Suzanne\n&gt; \n&gt; --- On Fri, 12/12/08, northernilghosthuntingteam \n&lt;northernilghosthuntingteam@...&gt; wrote:\n&gt; \n&gt; From: northernilghosthuntingteam &lt;northernilghosthuntingteam@...&gt;\n&gt; Subject: [EVP-ITC] Re: radio shack box\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Friday, December 12, 2008, 4:21 PM\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; I went into my file and checked out the clip and it shows its there \n&gt; and it dose play. the one thing i realized is it dose not show a \ntime \n&gt; stamp so as far as the time i wrote down i dont know if you can see \n&gt; what i am talking about. is it possible that the file would show \nfor \n&gt; me and noone else? I am new at this and its the first time i have \n&gt; uploaded a file. i will try and figure it out and maybe post it a \n&gt; second time. there are 2 accounts under norther il ghost hunting \n&gt; team. the other one was my husbands he was trying out.(N.I.G.H. T) \nand \n&gt; he still dose use sometimes. it is empty. the one with the file is \n&gt; northern il ghost hunting team. well now im rambling on and on \nagain. \n&gt; anyway if its still not there please let me know and i will try it \n&gt; again.\n&gt; \n&gt; http://tech. groups.yahoo. com/group/ EVP-ITC/files/ Norhtern% 20IL%\n&gt; 20Ghost%20Hunting% 20Team/\n&gt; \n&gt; sarah\n&gt; \n&gt; -- In EVP-ITC@yahoogroups .com, &quot;ektope&quot; &lt;ektope@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Sarah, I would like to hear what you present, but all the files \n&gt; appear \n&gt; &gt; empty to me.\n&gt; &gt; \n&gt; &gt; Kay\n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups .com, &quot;northernilghosthun tingteam&quot; \n&gt; &gt; &lt;northernilghosthun tingteam@ &gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; weve been doing some work with the radio shack box and this one \n&gt; in \n&gt; &gt; &gt; particular is important. my husbands father died when he was \n&gt; young \n&gt; &gt; and \n&gt; &gt; &gt; his uncle was murdered a few years ago. in many box sessions he \n&gt; has \n&gt; &gt; &gt; heard the two of them saying certain key things. in this \nsession \n&gt; he \n&gt; &gt; &gt; asks for comfirmation that it is him. and askes how he died. at \n&gt; 0:22 \n&gt; &gt; &gt; and 0:30 you hear something. i was wondering if anyone else \nheard \n&gt; the \n&gt; &gt; &gt; same thing. like i said in a previous post him and i sometimes \n&gt; hear \n&gt; &gt; &gt; different words.like at 0:22. it may be a gender thing or not \nbut \n&gt; at \n&gt; &gt; &gt; 0:30 we deffinately hear the same thing. i have put the file in \n&gt; &gt; &gt; my &quot;folder&quot; for anyone to hear. it is under norther il ghost \n&gt; hunting \n&gt; &gt; &gt; team. thanks everone for your time.\n&gt; &gt; &gt; \n&gt; &gt; &gt; sarah\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}