{"id": "13087", "subject": "OMG Mike the UFO Geek on You Tube? YOU TOTALLY ROCK!!!", "author": "Luis Gonzalez", "timestamp": "2008-12-14T04:22:56Z", "full_text": "--0-675767251-1229228576=:19506\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nTook me a couple of emails but I realized on your signature at the bottom o=\r\nf one of your recent posts that it was you... Can I just shake your hand du=\r\nde? Your post about Radio Shack boxes and the uses... I like how you record=\r\n in real time by the way using multiple radio shack boxes... (must be a pai=\r\nn in the butt to review)... \n=A0\nP.S. I find the Radio Shack and Franks Box=\r\n sessions in general to be really chaotic and I find that I can only do the=\r\n sessions in increments of 5=A0minutes...=A0It drives my team batty hehe...=\r\n but I really like some of the results... Also, I tend to stay on AM band a=\r\ns FM generally is music and I mostly record the group Coldplay hehe...\n\n---=\r\n On Sat, 12/13/08, M.A. Coletta (Mike) &lt;michaelcoletta@...&gt; wrote:\n\nF=\r\nrom: M.A. Coletta (Mike) &lt;michaelcoletta@...&gt;\nSubject: Re: [EVP-ITC]c=\r\npl question for team investigators\nTo: EVP-ITC@yahoogroups.com\nDate: Saturd=\r\nay, December 13, 2008, 5:43 AM\n\n\n\n\n\n\nHi Rhonda,\n\nMy opinion follows:\nWhat y=\r\nou are seeing is for entertainment purposes. The production \ncompanies know=\r\n that they can not capture and keep an audience with \nslow or no action, an=\r\nd a theme that drags on.\nThey need that high energy spark to keep the viewe=\r\nrs coming back, \nespecially viewers who are not able to get out and do inve=\r\nstigations \nas much as they&#39;d like or for those that have never done an \nin=\r\nvestgation, but like ghost hunting stuff.\n\nTheir show ratings depend on vie=\r\nwer numbers which equate to \nadvertising dollars. That is the bottom line f=\r\nor any show and \nentertainment venue on TV or radio.\n\nSo... what you are se=\r\neing with all that over-drama stuff is for \nentertainment and shouldn&#39;t be =\r\ntaken as serious investigation.\n\nThat&#39;s how I see it at least, and that&#39;s w=\r\nhy I don&#39;t usually watch \nthose type shows, although I will check them out =\r\nonce-in-awhile to \nsee if they are using any type of new tool or paranormal=\r\n device.\n\nShows like &quot;Haunting Evidence&#39; that don&#39;t have screamng, running,=\r\n and \nconstant yapping when none should be happening, don&#39;t last.\n&#39;Haunting=\r\n Evidence&#39; was just dropped from the TruTV lineup. They \ntried to be a more=\r\n serious documentary type show, whether they really \nwere or not? But it di=\r\ndn&#39;t work for the rating numbers.\n\nI think you&#39;ll be seeing more and more o=\r\nf the &#39;entertainment&#39; type \ninvestigation shows being put on a number of di=\r\nfferent networks, \nbecause that&#39;s what&#39;s selling right now.\n\nRhonda, the ty=\r\npe of good manners investigation you are describing \ndoes happen I&#39;m guessi=\r\nng in many groups around the world, when a \nproduction company is not invol=\r\nved. Get that production company \ninvolved... and the entertainment factor =\r\ntakes over.\n\n- Mike C. (UFO Geek)\nwww.ufogeek. com\n\n--- In EVP-ITC@yahoogro=\r\nups .com, Rhonda W &lt;rhondak1973@ ...&gt; wrote:\n&gt;\n&gt; Im sitting here watching G=\r\nhost Hunters...and I know alot of it is \ndone for drama purposes...but Im c=\r\nurious...when ya&#39;ll are out on an \ninvestigation do you talk as much as the=\r\ny do?=A0 I can hardly hear \nanything over them chatting.=A0 Also I notice a=\r\n cpl of their people \nfreak out when they get knocks or other responses... =\r\nnobody ever says \nhey thanks for the effort you put into responding or grea=\r\nt job or \nanything like that..its always wtf was that, what the hell is goi=\r\nng \non in here, etc...do ya&#39;ll say thanks and compliment the efforts of \nth=\r\ne responding spirits?=A0 Ive never been on an investigation with a \nteam so=\r\n Im kinda curious how different groups work and run things.\n(wish I knew pe=\r\nople in arizona I could go on an investigation with)=A0 \nI know when I do m=\r\ny research here with my radio shack hack I always \nsay thanks and am polite=\r\n and have never freaked out or cussed in \nresponse to one of the responses =\r\nIve gotten.=A0 Anyways just curious.=A0 \nHope everyone has a\n&gt; great weeken=\r\nd!\n&gt; =A0\n&gt; Rhonda\n&gt;\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n      \r\n--0-675767251-1229228576=:19506\r\nContent-Type: text/html; charset=us-ascii\r\n\r\n&lt;table cellspacing=&quot;0&quot; cellpadding=&quot;0&quot; border=&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=&quot;top&quot; style=&quot;font: inherit;&quot;&gt;&lt;DIV&gt;Took me a couple of emails but I realized on your signature at the bottom of one of your recent posts that it was you... Can I just shake your hand dude? Your post about Radio Shack boxes and the uses... I like how you record in real time by the way using multiple radio shack boxes... (must be a pain in the butt to review)... &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;P.S. I find the Radio Shack and Franks Box sessions in general to be really chaotic and I find that I can only do the sessions in increments of 5&nbsp;minutes...&nbsp;It drives my team batty hehe... but I really like some of the results... Also, I tend to stay on AM band as FM generally is music and I mostly record the group Coldplay hehe...&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Sat, 12/13/08, M.A. Coletta (Mike) &lt;I&gt;&lt;michaelcoletta@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;&lt;/DIV&gt;\n&lt;BLOCKQUOTE style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: rgb(16,16,255) 2px solid&quot;&gt;From: M.A. Coletta (Mike) &lt;michaelcoletta@...&gt;&lt;BR&gt;Subject: Re: [EVP-ITC]cpl question for team investigators&lt;BR&gt;To: EVP-ITC@yahoogroups.com&lt;BR&gt;Date: Saturday, December 13, 2008, 5:43 AM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=yiv1941156658&gt;\n&lt;DIV id=ygrp-text&gt;\n&lt;DIV&gt;Hi Rhonda,&lt;BR&gt;&lt;BR&gt;My opinion follows:&lt;BR&gt;What you are seeing is for entertainment purposes. The production &lt;BR&gt;companies know that they can not capture and keep an audience with &lt;BR&gt;slow or no action, and a theme that drags on.&lt;BR&gt;They need that high energy spark to keep the viewers coming back, &lt;BR&gt;especially viewers who are not able to get out and do investigations &lt;BR&gt;as much as they&#39;d like or for those that have never done an &lt;BR&gt;investgation, but like ghost hunting stuff.&lt;BR&gt;&lt;BR&gt;Their show ratings depend on viewer numbers which equate to &lt;BR&gt;advertising dollars. That is the bottom line for any show and &lt;BR&gt;entertainment venue on TV or radio.&lt;BR&gt;&lt;BR&gt;So... what you are seeing with all that over-drama stuff is for &lt;BR&gt;entertainment and shouldn&#39;t be taken as serious investigation.&lt;BR&gt;&lt;BR&gt;That&#39;s how I see it at least, and that&#39;s why I don&#39;t usually watch &lt;BR&gt;those type shows, although I will check them out once-in-awhile to &lt;BR&gt;see if they are using\n any type of new tool or paranormal device.&lt;BR&gt;&lt;BR&gt;Shows like &quot;Haunting Evidence&#39; that don&#39;t have screamng, running, and &lt;BR&gt;constant yapping when none should be happening, don&#39;t last.&lt;BR&gt;&#39;Haunting Evidence&#39; was just dropped from the TruTV lineup. They &lt;BR&gt;tried to be a more serious documentary type show, whether they really &lt;BR&gt;were or not? But it didn&#39;t work for the rating numbers.&lt;BR&gt;&lt;BR&gt;I think you&#39;ll be seeing more and more of the &#39;entertainment&#39; type &lt;BR&gt;investigation shows being put on a number of different networks, &lt;BR&gt;because that&#39;s what&#39;s selling right now.&lt;BR&gt;&lt;BR&gt;Rhonda, the type of good manners investigation you are describing &lt;BR&gt;does happen I&#39;m guessing in many groups around the world, when a &lt;BR&gt;production company is not involved. Get that production company &lt;BR&gt;involved... and the entertainment factor takes over.&lt;BR&gt;&lt;BR&gt;- Mike C. (UFO Geek)&lt;BR&gt;www.ufogeek. com&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=&quot;mailto:EVP-ITC%40yahoogroups.com&quot; target=_blank\n rel=nofollow&gt;EVP-ITC@yahoogroups .com&lt;/A&gt;, Rhonda W &lt;rhondak1973@ ...&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; Im sitting here watching Ghost Hunters...and I know alot of it is &lt;BR&gt;done for drama purposes...but Im curious...when ya&#39;ll are out on an &lt;BR&gt;investigation do you talk as much as they do?&nbsp; I can hardly hear &lt;BR&gt;anything over them chatting.&nbsp; Also I notice a cpl of their people &lt;BR&gt;freak out when they get knocks or other responses... nobody ever says &lt;BR&gt;hey thanks for the effort you put into responding or great job or &lt;BR&gt;anything like that..its always wtf was that, what the hell is going &lt;BR&gt;on in here, etc...do ya&#39;ll say thanks and compliment the efforts of &lt;BR&gt;the responding spirits?&nbsp; Ive never been on an investigation with a &lt;BR&gt;team so Im kinda curious how different groups work and run things.&lt;BR&gt;(wish I knew people in arizona I could go on an investigation with)&nbsp; &lt;BR&gt;I know when I do my research here with my radio shack hack I\n always &lt;BR&gt;say thanks and am polite and have never freaked out or cussed in &lt;BR&gt;response to one of the responses Ive gotten.&nbsp; Anyways just curious.&nbsp; &lt;BR&gt;Hope everyone has a&lt;BR&gt;&gt; great weekend!&lt;BR&gt;&gt; &nbsp;&lt;BR&gt;&gt; Rhonda&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n      \r\n--0-675767251-1229228576=:19506--"}