{"id": "13116", "subject": "Re: [EVP-ITC] Re: Of Radio Interference and equipment...", "author": "Zack Widup", "timestamp": "2008-12-15T17:02:37Z", "full_text": "Yes, that&#39;s right.  Most commercial FM and TV antennas are collinear \narrays which have quite a bit of gain.  AM antennas usually use phased \nverticals at particular spacings to produce a pattern, but the Fresnel \nzone is very large for such frequencies, so if you&#39;re close to them, the \nFraunhofer zone pattern isn&#39;t valid.\n\nZack\n\n\nOn Mon, 15 Dec 2008, threadsintyme@... wrote:\n\n&gt; It also doesn&#39;t take into account the &quot;gain factor.&quot;\n&gt; Al\n&gt;\n&gt; -- Zack Widup &lt;w9sz@...&gt; wrote:\n&gt;\n&gt;\n&gt; That&#39;s only true of a simple dipole. Antennas can be engineered to get\n&gt; practically any pattern you want. In fact, many FM and TV antennas have a\n&gt; pattern which peaks from directly below the antenna to the horizon and\n&gt; sends very little signal straight up.\n&gt;\n&gt; Also, close-in you might still be in the Fresnel zone of the field.\n&gt;\n&gt; Zack\n&gt;\n&gt; On Mon, 15 Dec 2008, don powell wrote:\n&gt;\n&gt;&gt;\n&gt;&gt; Just an engineering point.  Radio radiates out kind of like a donut turned on it&#39;s side.  So directly under, up to a dozen or so feet from a tower has zero transmission.\n&gt;&gt;\n&gt;&gt; It kind of looks like this:\n&gt;&gt;\n&gt;&gt;   |\n&gt;&gt;  (|)\n&gt;&gt; ------\n&gt;&gt;\n&gt;&gt; Where the parenthesis are the radio waves.  Except they do not really get that close to the tower base.\n&gt;&gt;\n&gt;&gt; The point of the strongest signal is a little past the height of the tower.  So if the tower is 100&#39; then if you move away from the tower to about 110&#39; or so that is the most powerful signal.\n&gt;&gt;\n&gt;&gt; Don\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; . I also tried the local police and some microwave towers,\n&gt;&gt;\n&gt;&gt; right under the towers, and heard nothing from those sources. But they\n&gt;&gt;\n&gt;&gt; are on much higher frequencies than AM or FM radio and are not known to\n&gt;&gt;\n&gt;&gt; get into any electronics around here.\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; Zack\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; _,___\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;\n&gt; ____________________________________________________________\n&gt; Click here to find the perfect picture with our powerful photo search features.\n&gt; http://thirdpartyoffers.juno.com/TGL2131/fc/PnY6rbtzjiWffNuTxQRTveAh47dKKQV83087sMFqGnREaJLm2RDpi/"}