{"id": "1313", "subject": "Re: [EVP-ITC] Re: Is there any way to get a franks box ???", "author": "Lisby", "timestamp": "2007-05-21T12:42:04Z", "full_text": "Misty--where are you located?\n\nAnn\n\nOn May 19, 2007, at 11:43 PM, Misty Dawn wrote:\n\n&gt; Yeah Frank knows he left a few details out, he mentioned that a  \n&gt; while back its why he keeps updating schematics. The ST method is  \n&gt; something him and Dave termed, and I just took the idea, ran with  \n&gt; it and put it to the test...still testing. So far it works as well  \n&gt; for me as any other method tho its sound frequencies can be heard  \n&gt; easily by more people.\n&gt;\n&gt; Congrats to you both on your upcoming engagements I wish it wasnt  \n&gt; on the other side of the states i&#39;d drop in. I am not much of a  \n&gt; &quot;speaker&quot; but I try and get my typing in as much as I can hehehe.  \n&gt; Im a big goof when ya stick me in front of a room of people.\n&gt;\n&gt; You should give it a try I think you may be surprised. But again, I  \n&gt; am getting great results with all methods as far as my own hearing  \n&gt; goes...but I do see others can hear these easier for the most part.  \n&gt; It has to do with the frequency levels it hits. Spirit says 5 to 1  \n&gt; people do not have perfect hearing and that is why we all hear so  \n&gt; differently and why some agree while others cant hear a thing but  \n&gt; static. Think of it as a dog vs human scenario...dog whistles hit  \n&gt; that frequency many people cant hear...I hear them but for some its  \n&gt; silence....for the dog its very loud and clear. I think they match  \n&gt; each recording mediums vibrations and in effect tune into speaking  \n&gt; in a way so you can hear them...even if you are the only one that  \n&gt; can hear them.\n&gt;\n&gt; Very interesting about the stone circles, I was just thinking of  \n&gt; this not too long ago and also researching &quot;singing&quot; stones after I  \n&gt; saw a headline about them on the news. They do exist. Some also  \n&gt; have electromagnetic functions which come into play. I love rocks,  \n&gt; always have, and I have collected them since I was small long  \n&gt; before I knew as much as I know now. They also play a big part in  \n&gt; some of my ITC images that have come thru. They still shock me with  \n&gt; the clarity sometimes.\n&gt;\n&gt; It is all very very humbling for me. I am nobody special, not  \n&gt; someone who wants to be famous, nor one who would have ever thought  \n&gt; I would/could be involved doing research on something such as this  \n&gt; for so long and remain so dedicated (or is that addicted LOL) but  \n&gt; one small voice sent me on a sharp turn and now I am on this path.\n&gt;\n&gt; Paranormal has always been just normal...now moreso than ever. I  \n&gt; think perhaps they have always been watching me and they are the  \n&gt; voices that kept me awake at night, the invisible person sitting on  \n&gt; my bedside so I couldnt fall asleep and would scream for my mama to  \n&gt; come stay with me until I fell asleep. I could probably name 1000  \n&gt; things that I have witnessed and others have witnessed over my  \n&gt; lifetime but too tired to start that list tonight LOL\n&gt; I never realized how closed my eyes were until they opened wider. I  \n&gt; always knew what was there I just never realized it in detail.\n&gt;\n&gt; Misty\n&gt; Guy &lt;yzzzguy@...&gt; wrote:\n&gt; Thanks, Bill! (Pssst...check is in the mail...he he)\n&gt;\n&gt; I want to make it clear that I was NOT criticizing Frank about his\n&gt; box or the document! It&#39;s just that I read it over thoroughly\n&gt; yesterday and found some things that were missing or unreadable.\n&gt; Otherwise - it&#39;s the only &quot;one-stop shopping&quot; for details on Frank&#39;s\n&gt; box. The setup is not rocket science...anyone versed in electronics\n&gt; could build one and even improve on the design (I have several\n&gt; thoughts on that).\n&gt;\n&gt; I haven&#39;t had a chance to check out Misty&#39;s &quot;sweep tuning&quot; method\n&gt; but just that name seems to indicate something close to the &quot;manual&quot;\n&gt; way of creating Frank&#39;s box as I previously mentioned (i.e. randomly\n&gt; pushing radio buttons).\n&gt;\n&gt; Lastly - as Bill said - he and I will be presenters at the\n&gt; conference in July. My particular presentation (which I&#39;m still\n&gt; piecing together) will be on Paranormal Sound Phenomena. Rather than\n&gt; rehash techniques for recording/analyzing EVP - I plan on going into\n&gt; more depth on present/past research in paranormal sounds (such as\n&gt; playing the first spirit voices ever recorded, ultrasonic pulses\n&gt; detected at stone circles, etc.) and make a plea to participants to\n&gt; stretch beyond present emphasis on just recording said sounds but\n&gt; get into broader research projects. I&#39;m not one to &quot;toot my own\n&gt; horn&quot; but I&#39;m also slated to appear on the June 3 show of Ghostly\n&gt; Talk (http://www.ghostlytalk.com) to go into more depth on the\n&gt; famous (or infamous) Spiricom Mark IV story.\n&gt;\n&gt; Guy\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, &quot;psi_research&quot; &lt;vilhellm@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; To expand upon Guy&#39;s post, the echo chamber size can vary. Some of\n&gt; his\n&gt; &gt; boxes have an internal chamber that&#39;s about 2&quot; x 3.5&quot;. Some of his\n&gt; &gt; boxes have chambers which are external and are a bit larger. An\n&gt; &gt; external one I saw was made with a light wood frame which was\n&gt; wrapped\n&gt; &gt; in heavy aluminum foil.\n&gt; &gt;\n&gt; &gt; If someone is considering constructing their own FB then I suggest\n&gt; &gt; considering the sweep tuning method also as the recordings I&#39;ve\n&gt; heard\n&gt; &gt; are impressive. We are experimenting with a RVG equipped box and\n&gt; are\n&gt; &gt; getting good results but I am also interested in the sweep tuning\n&gt; &gt; approach.\n&gt; &gt;\n&gt; &gt; By the way, Guy and myself both be speaking at the upcoming South\n&gt; &gt; Coast Paranormal Convention July 20 and 21 in Santa Paula, CA. see\n&gt; &gt; link: http://www.woodwardpsychic.com/\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;Guy&quot; &lt;yzzzguy@&gt; wrote:\n&gt;\n&gt;\n&gt;\n&gt; Give spam the boot. Take control with tough spam protection\n&gt; in the all-new Yahoo! Mail Beta. \n\n\nMis y--whe e a e you loca ed?AnnOn May 19, 2007, a 11:43 PM, Mis y Dawn w o e: Yeah F ank knows he le a ew de ails ou , he men ioned ha a while back i s why he keeps upda ing schema ics. The ST me hod is some hing him and Da e e med, and I jus ook he idea, an wi h i  and pu i o he es ...s ill es ing. So a i wo ks as well o me as any o he me hod ho i s sound equencies can be hea d easily by mo e people.   Cong a s o you bo h on you upcoming engagemen s I wish i wasn on he o he side o he s a es i'd d op in. I am no much o a \"speake \" bu I y and ge my yping in as much as I can hehehe. Im a big goo when ya s ick me in on o a oom o people.   You should gi e i a y I hink you may be su p ised. Bu again, I am ge ing g ea esul s wi h all me hods as a as my own hea ing goes...bu I do see o he s can hea hese easie o he mos pa . I has o do wi h he equency le els i hi s. Spi i says 5 o 1 people do no ha e pe ec hea ing and ha is why we all hea so di e en ly and why some ag ee while o he s can hea a hing bu s a ic. Think o i as a dog s human scena io...dog whis les hi ha equency many people can hea ...I hea hem bu o some i s silence.... o he dog i s e y loud and clea . I hink hey ma ch each eco ding mediums ib a ions and in e ec une in o speaking in a way so you can hea hem...e en i you a e he only one ha can hea hem.   Ve y in e es ing abou he s one ci cles, I was jus hinking o his no oo long ago and also esea ching \"singing\" s ones a e I saw a headline abou hem on he news. They do exis . Some also ha e elec omagne ic unc ions which come in o play. I lo e ocks, always ha e, and I ha e collec ed hem since I was small long be o e I knew as much as I know now. They also play a big pa in some o my ITC images ha ha e come h u. They s ill shock me wi h he cla i y some imes.   I is all e y e y humbling o me. I am nobody special, no someone who wan s o be amous, no one who would ha e e e hough I would/could be in ol ed doing esea ch on some hing such as his o so long and emain so dedica ed (o is ha addic ed LOL) bu one small oice sen me on a sha p u n and now I am on his pa h.   Pa ano mal has always been jus no mal...now mo eso han e e . I hink pe haps hey ha e always been wa ching me and hey a e he oices ha kep me awake a nigh , he in isible pe son si ing on my bedside so I couldn all asleep and would sc eam o my mama o come s ay wi h me un il I ell asleep. I could p obably name 1000 hings ha I ha e wi nessed and o he s ha e wi nessed o e my li e ime bu oo i ed o s a ha lis onigh LOL I ne e ealized how closed my eyes we e un il hey opened wide . I always knew wha was he e I jus ne e ealized i in de ail.   Mis yGuy yzzzguy@...> w o e: Thanks, Bill! (Psss ...check is in he mail...he he)I wan o make i clea ha I was NOT c i icizing F ank abou his box o he documen ! I 's jus ha I ead i o e ho oughly yes e day and ound some hings ha we e missing o un eadable. O he wise - i 's he only \"one-s op shopping\" o de ails on F ank's box. The se up is no ocke science...anyone e sed in elec onics could build one and e en imp o e on he design (I ha e se e al hough s on ha ).I ha en' had a chance o check ou Mis y's \"sweep uning\" me hod bu jus ha name seems o indica e some hing close o he \"manual\" way o c ea ing F ank's box as I p e iously men ioned (i.e. andomly pushing adio bu ons).Las ly - as Bill said - he and I will be p esen e s a he con e ence in July. My pa icula p esen a ion (which I'm s ill piecing oge he ) will be on Pa ano mal Sound Phenomena. Ra he han ehash echniques o eco ding/analyzing EVP - I plan on going in o mo e dep h on p esen /pas esea ch in pa ano mal sounds (such as playing he i s spi i oices e e eco ded, ul asonic pulses de ec ed a s one ci cles, e c.) and make a plea o pa icipan s o s e ch beyond p esen emphasis on jus eco ding said sounds bu ge in o b oade esea ch p ojec s. I'm no one o \" oo my own ho n\" bu I'm also sla ed o appea on he June 3 show o Ghos ly Talk (h p://www.ghos ly alk.com) o go in o mo e dep h on he amous (o in amous) Spi icom Ma k IV s o y.Guy--- In EVP-ITC@yahoog oups.com, \"psi_ esea ch\" .> w o e:>> To expand upon Guy's pos , he echo chambe size can a y. Some o his> boxes ha e an in e nal chambe ha 's abou 2\" x 3.5\". Some o his> boxes ha e chambe s which a e ex e nal and a e a bi la ge . An> ex e nal one I saw was made wi h a ligh wood ame which was w apped> in hea y aluminum oil.> > I someone is conside ing cons uc ing hei own FB hen I sugges > conside ing he sweep uning me hod also as he eco dings I' e hea d> a e imp essi e. We a e expe imen ing wi h a RVG equipped box and a e> ge ing good esul s bu I am also in e es ed in he sweep uning> app oach.> > By he way, Guy and mysel bo h be speaking a he upcoming Sou h> Coas Pa ano mal Con en ion July 20 and 21 in San a Paula, CA. see> link: h p://www.woodwa dpsychic.com/ > > --- In EVP-ITC@yahoog oups.com, \"Guy\" w o e: Gi e spam he boo . Take con ol wi h ough spam p o ec ionin he all-new Yahoo! Mail Be a."}