{"id": "13147", "subject": "Re: new to group, questions", "author": "shortbuff", "timestamp": "2008-12-23T05:59:45Z", "full_text": "Hi Mike, Is this going to be something you sell or something that can\nbe seen on youtube or some other place?\n\nWhat Youtube videos of yours can i see now? \n\nThanks,\n\nRichard\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;M.A. Coletta (Mike)&quot;\n&lt;michaelcoletta@...&gt; wrote:\n&gt;\n&gt; Richard, Misty, and all other fellow researchers,\n&gt; \n&gt; This is a fasinating topic, one that I am currently most interested \n&gt; with as my latest experiment/research project is all about.\n&gt; The crash debris that was sent to 8 researchers, I believe, does hold \n&gt; imprints from a violent past.\n&gt; As does the area where the original crash happened, since there are \n&gt; still amounts of debris scattered around the immediate area, as well \n&gt; as beneath the surface where now stands a memorial.  Not to mention \n&gt; it is the last place where living humans were quickly lost.  Just \n&gt; imagine the amount of energy that must be imprinted on that exact \n&gt; spot.\n&gt; \n&gt; That is where I hoped to gain a better understanding of that energy \n&gt; which is imprinted... and I must say, I think I have done just that.\n&gt; \n&gt; Today I processed a number of the files I captured from the impact \n&gt; point using numerous devices of the non-microphone type.  After I put \n&gt; each of these files through a four step process (which I&#39;ll explain \n&gt; in great detail in my video), I was able to listen to some amazing, \n&gt; and very relivent sounds.\n&gt; My wife was so upset after I told her what I had heard, she refused \n&gt; to listen to the audio.\n&gt; \n&gt; Let me just say... the combination I used was able to capture a very \n&gt; chilling scene.  One I just have to believe were the last moments of \n&gt; those who perished.\n&gt; \n&gt; Once I publish the final results, I hope others will be able to \n&gt; verify what I am hearing...\n&gt; \n&gt; I&#39;m figuring to put a multi-part video on my Youtube page.  One part \n&gt; explaining what will be seen an heard, as well as describing the \n&gt; events of that day.  Another part with my sessions at the various \n&gt; locations, using various methods.  And a final part with the audio of \n&gt; the researchers who assisted with this experiment using the debris I \n&gt; sent each of them.\n&gt; \n&gt; Bottom line... I really do believe that energy is imprinted in \n&gt; objects, and at locations where energy was strong at a time of \n&gt; imprint.\n&gt; \n&gt; Happy Holidays to all.... have a safe and fun Holiday Season!\n&gt; \n&gt; - Mike C. (UFO Geek)\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Misty&quot; &lt;bulletbabea@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Richard,\n&gt; &gt; \n&gt; &gt; Thats a great example and a good way to look at things. the old \n&gt; idea \n&gt; &gt; that energy doesnt die its just transformed holds true with that \n&gt; too. \n&gt; &gt; I have seen the same thing done with missing appendages, tho a \n&gt; finger \n&gt; &gt; may have been removed it still registers under kirlian photography \n&gt; as \n&gt; &gt; its energy being present.\n&gt; &gt; \n&gt; &gt; Just because we dont see something or hear a thing doesnt mean it \n&gt; is \n&gt; &gt; nonexistant =) Perhaps it just means we are deaf and blind to its \n&gt; &gt; existence.\n&gt; &gt; \n&gt; &gt; Misty\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;shortbuff&quot; &lt;rdmc512@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; Thanks for replying to my message.\n&gt; &gt; &gt; \n&gt; &gt; &gt; Years ago I watched a slide show featuring several photo&#39;s taken \n&gt; via\n&gt; &gt; &gt; kirlian photography. It seems kirlian photography captures certain\n&gt; &gt; &gt; types of energy on film. In the demonstration a picture of a \n&gt; house \n&gt; &gt; was\n&gt; &gt; &gt; shown. Later that same house had a fire and part of the house had \n&gt; &gt; been\n&gt; &gt; &gt; burned to the ground but the photo taken with kirlian photography\n&gt; &gt; &gt; later showed that part of the house still there.\n&gt; &gt; &gt; \n&gt; &gt; &gt; I&#39;m no expert but maybe energy we can&#39;t see leaves an imprint in \n&gt; the\n&gt; &gt; &gt; non physical universe and can be viewed or demonstrated using the\n&gt; &gt; &gt; right instruments and technique. Of course I really have no clue \n&gt; and\n&gt; &gt; &gt; am fascinated by the evp and itc phenomena.\n&gt; &gt; &gt; \n&gt; &gt; &gt; Enjoyed visiting your site, thanks for the link.\n&gt; &gt; &gt; \n&gt; &gt; &gt; Richard\n&gt;"}