{"id": "13141", "subject": "Re: new to group, questions", "author": "Misty", "timestamp": "2008-12-21T20:21:09Z", "full_text": "Richard,\n\nThats a great example and a good way to look at things. the old idea \nthat energy doesnt die its just transformed holds true with that too. \nI have seen the same thing done with missing appendages, tho a finger \nmay have been removed it still registers under kirlian photography as \nits energy being present.\n\nJust because we dont see something or hear a thing doesnt mean it is \nnonexistant =) Perhaps it just means we are deaf and blind to its \nexistence.\n\nMisty\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;shortbuff&quot; &lt;rdmc512@...&gt; wrote:\n&gt;\n&gt; Thanks for replying to my message.\n&gt; \n&gt; Years ago I watched a slide show featuring several photo&#39;s taken via\n&gt; kirlian photography. It seems kirlian photography captures certain\n&gt; types of energy on film. In the demonstration a picture of a house \nwas\n&gt; shown. Later that same house had a fire and part of the house had \nbeen\n&gt; burned to the ground but the photo taken with kirlian photography\n&gt; later showed that part of the house still there.\n&gt; \n&gt; I&#39;m no expert but maybe energy we can&#39;t see leaves an imprint in the\n&gt; non physical universe and can be viewed or demonstrated using the\n&gt; right instruments and technique. Of course I really have no clue and\n&gt; am fascinated by the evp and itc phenomena.\n&gt; \n&gt; Enjoyed visiting your site, thanks for the link.\n&gt; \n&gt; Richard\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Chad&quot; &lt;cawiggins78@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hi Richard, and welcome to the group. I am not on here much as I\n&gt; &gt; usually just read the posts and contribute when I can. I am very \nbusy\n&gt; &gt; with my group so balancing my time isn&#39;t easy.\n&gt; &gt; \n&gt; &gt; I guess as of now it is hard to say whether or not an EVP is from \na\n&gt; &gt; &quot;living&quot; entity or just a sound bit floating in time. All we can \ndo is\n&gt; &gt; speculate on such matters, really. I think that time may lead to\n&gt; &gt; finite answers to our questions, but as it stands with our limited\n&gt; &gt; equipment and devices we use to measure phenomenon, we cannot say \n100%\n&gt; &gt; for certain. I have my theories, as does everyone.\n&gt; &gt; \n&gt; &gt; That being said, my personal belief is that EVP and ITC can be \nboth.\n&gt; &gt; Though my research has been much more focused on EVP and \nrecently, on\n&gt; &gt; the Radio Shack hack box, I have seen what I believe to be \nevidence of\n&gt; &gt; both. I have many EVPs recorded that seem to suggest both &quot;living&quot;\n&gt; &gt; entities and those that suggest residual phenomenon, or &quot;residue&quot; \nof\n&gt; &gt; things in the past.\n&gt; &gt; \n&gt; &gt; One example is the EVP I captured at the Camp Creek Trustle in\n&gt; &gt; McDonough, GA. In the EVP, the voice picked up seems to suggest \nthat\n&gt; &gt; he is not dead. Tou can check this file out in my folder here. \nAlso,\n&gt; &gt; at the investigation of the trustle, EVPs were picked up seeming \nto\n&gt; &gt; answer questions. For example, when I asked what kind of music was\n&gt; &gt; enjoyed by the entity, I received &quot;orcha&quot; as an response. I took \nthis\n&gt; &gt; to be an attempt to say &quot;orchestra,&quot; a popular music choice from \nthe\n&gt; &gt; early 1900&#39;s when so many lives were lost at this spot. As for the\n&gt; &gt; Radio Shack hack, just last night I was again at the trustle\n&gt; &gt; conducting a hack box session. When we asked about which of us \nwere in\n&gt; &gt; attendance, the answer came back very clearly with two of our \nnames,\n&gt; &gt; &quot;Nate&quot; and &quot;Chad.&quot; These were very clear and in an area where \nradio\n&gt; &gt; reception is not that great.\n&gt; &gt; \n&gt; &gt; Perhaps one of our more compelling EVPs as they relate to whether \nor\n&gt; &gt; not these are &quot;living&quot; entities we are communicating with is one \nthat\n&gt; &gt; we recorded in the White House located in McDonough, GA. A team \nmember\n&gt; &gt; was talking about someone and how poorly they kept up their yard \nwhen\n&gt; &gt; we picked up a very clear voice saying &quot;You are so mean.&quot; On the \nsame\n&gt; &gt; investigation we captured a voice talking about Kurt, another\n&gt; &gt; investigator and how he was stupid.\n&gt; &gt; \n&gt; &gt; Now to the other side of the coin. We have picked up &quot;EVPs&quot; of \nthings\n&gt; &gt; such as gunshots and cannon fire at civil war battlefields we have\n&gt; &gt; visited. These appear at first to be residual sounds, yet other\n&gt; &gt; aspects of the investigation seem to provide proof of intelligent\n&gt; &gt; entities. Perhaps the soldiers who died in that battle are still\n&gt; &gt; fighting. We cannot really say based on only the EVPs taken during\n&gt; &gt; those investigations. We do have other evidence, but I will not go\n&gt; &gt; into that here as this is an EVP/ITC group.\n&gt; &gt; \n&gt; &gt; Feel free to take a look at our group&#39;s site.\n&gt; &gt; www.georgiastateparanormal.com\n&gt; &gt; \n&gt; &gt; I am happy to send our files to anyone for research purposes if\n&gt; requested.\n&gt; &gt; \n&gt; &gt; I am sure that many of the members of the group will give you \ntheir\n&gt; &gt; theories as well on this matter, and I&#39;m sure that as you begin to\n&gt; &gt; experiment on your own that many fascinating and unexplained \nevents\n&gt; &gt; will present themselves to you. Good luck, and again, welcome to \nthe\n&gt; &gt; group.\n&gt; &gt; \n&gt; &gt; Chad\n&gt; &gt;\n&gt;"}