{"id": "13152", "subject": "Re: new to group, questions", "author": "M.A. Coletta (Mike)", "timestamp": "2008-12-24T18:26:39Z", "full_text": "Hi Richard,\n\nI see Misty already informed you were my Youtube videos can be \nlocated (Thanks, Misty).  That&#39;s where I have all my videos showing \nthe different projects and research I&#39;m involved with.  \nhttp://www.youtube.com/ufogeek\n\nThe video I&#39;m working on now will also be placed on my Youtube page.\nI am saving those video files into HD format too (fuller screen).\n\nI don&#39;t sell items, or books, or movies.  I&#39;m not into the theatrics \nof the paranormal as some are who produce those &quot;hear a sound then \nrun away and scream&quot; type videos and TV shows.\nI&#39;m more into the research side, wondering what works and why.  \nThat&#39;s why I come up with some crazy looking devices sometimes.  You \nnever know what might just be the right combination.  You have to try \nall you can.\n\nI like to take what is captured in the environment and let it speak \nfor itself, so to speak.  The energy imprinted objects I&#39;m \nresearching now (subject of the new video) uses a capture file / \nprocess file system that takes environmental energy (captured with \nnumerous non-microphone devices and attempts to get audio from the \nfiles captured using frequencies to be stimulated by the energy \ncaptured.\nIt&#39;s a four step process that I&#39;ll explain in detail in part 2 of the \nvideo.\n\nHappy Holidays\n- Mike C. (UFO Geek)\nhttp://www.ufogeek.com\n\n--- In EVP-ITC@...m, &quot;shortbuff&quot; &lt;rdmc512@...&gt; wrote:\n&gt;\n&gt; Hi Mike, Is this going to be something you sell or something that \ncan\n&gt; be seen on youtube or some other place?\n&gt; \n&gt; What Youtube videos of yours can i see now? \n&gt; \n&gt; Thanks,\n&gt; \n&gt; Richard\n&gt; \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;M.A. Coletta (Mike)&quot;\n&gt; &lt;michaelcoletta@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Richard, Misty, and all other fellow researchers,\n&gt; &gt; \n&gt; &gt; This is a fasinating topic, one that I am currently most \ninterested \n&gt; &gt; with as my latest experiment/research project is all about.\n&gt; &gt; The crash debris that was sent to 8 researchers, I believe, does \nhold \n&gt; &gt; imprints from a violent past.\n&gt; &gt; As does the area where the original crash happened, since there \nare \n&gt; &gt; still amounts of debris scattered around the immediate area, as \nwell \n&gt; &gt; as beneath the surface where now stands a memorial.  Not to \nmention \n&gt; &gt; it is the last place where living humans were quickly lost.  Just \n&gt; &gt; imagine the amount of energy that must be imprinted on that exact \n&gt; &gt; spot.\n&gt; &gt; \n&gt; &gt; That is where I hoped to gain a better understanding of that \nenergy \n&gt; &gt; which is imprinted... and I must say, I think I have done just \nthat.\n&gt; &gt; \n&gt; &gt; Today I processed a number of the files I captured from the \nimpact \n&gt; &gt; point using numerous devices of the non-microphone type.  After I \nput \n&gt; &gt; each of these files through a four step process (which I&#39;ll \nexplain \n&gt; &gt; in great detail in my video), I was able to listen to some \namazing, \n&gt; &gt; and very relivent sounds.\n&gt; &gt; My wife was so upset after I told her what I had heard, she \nrefused \n&gt; &gt; to listen to the audio.\n&gt; &gt; \n&gt; &gt; Let me just say... the combination I used was able to capture a \nvery \n&gt; &gt; chilling scene.  One I just have to believe were the last moments \nof \n&gt; &gt; those who perished.\n&gt; &gt; \n&gt; &gt; Once I publish the final results, I hope others will be able to \n&gt; &gt; verify what I am hearing...\n&gt; &gt; \n&gt; &gt; I&#39;m figuring to put a multi-part video on my Youtube page.  One \npart \n&gt; &gt; explaining what will be seen an heard, as well as describing the \n&gt; &gt; events of that day.  Another part with my sessions at the various \n&gt; &gt; locations, using various methods.  And a final part with the \naudio of \n&gt; &gt; the researchers who assisted with this experiment using the \ndebris I \n&gt; &gt; sent each of them.\n&gt; &gt; \n&gt; &gt; Bottom line... I really do believe that energy is imprinted in \n&gt; &gt; objects, and at locations where energy was strong at a time of \n&gt; &gt; imprint.\n&gt; &gt; \n&gt; &gt; Happy Holidays to all.... have a safe and fun Holiday Season!\n&gt; &gt; \n&gt; &gt; - Mike C. (UFO Geek)\n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;Misty&quot; &lt;bulletbabea@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; Richard,\n&gt; &gt; &gt; \n&gt; &gt; &gt; Thats a great example and a good way to look at things. the old \n&gt; &gt; idea \n&gt; &gt; &gt; that energy doesnt die its just transformed holds true with \nthat \n&gt; &gt; too. \n&gt; &gt; &gt; I have seen the same thing done with missing appendages, tho a \n&gt; &gt; finger \n&gt; &gt; &gt; may have been removed it still registers under kirlian \nphotography \n&gt; &gt; as \n&gt; &gt; &gt; its energy being present.\n&gt; &gt; &gt; \n&gt; &gt; &gt; Just because we dont see something or hear a thing doesnt mean \nit \n&gt; &gt; is \n&gt; &gt; &gt; nonexistant =) Perhaps it just means we are deaf and blind to \nits \n&gt; &gt; &gt; existence.\n&gt; &gt; &gt; \n&gt; &gt; &gt; Misty\n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;shortbuff&quot; &lt;rdmc512@&gt; wrote:\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Thanks for replying to my message.\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; Years ago I watched a slide show featuring several photo&#39;s \ntaken \n&gt; &gt; via\n&gt; &gt; &gt; &gt; kirlian photography. It seems kirlian photography captures \ncertain\n&gt; &gt; &gt; &gt; types of energy on film. In the demonstration a picture of a \n&gt; &gt; house \n&gt; &gt; &gt; was\n&gt; &gt; &gt; &gt; shown. Later that same house had a fire and part of the house \nhad \n&gt; &gt; &gt; been\n&gt; &gt; &gt; &gt; burned to the ground but the photo taken with kirlian \nphotography\n&gt; &gt; &gt; &gt; later showed that part of the house still there.\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; I&#39;m no expert but maybe energy we can&#39;t see leaves an imprint \nin \n&gt; &gt; the\n&gt; &gt; &gt; &gt; non physical universe and can be viewed or demonstrated using \nthe\n&gt; &gt; &gt; &gt; right instruments and technique. Of course I really have no \nclue \n&gt; &gt; and\n&gt; &gt; &gt; &gt; am fascinated by the evp and itc phenomena.\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; Enjoyed visiting your site, thanks for the link.\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; Richard\n&gt; &gt;\n&gt;"}