{"id": "13170", "subject": "Re: Am i crazy?", "author": "shortbuff", "timestamp": "2008-12-29T10:43:05Z", "full_text": "I guess when i&#39;ve looked at itc video i study the images intently to\ntry to see what is there, its not always easy. So being in that sort\nof mode I&#39;ve gone into my game just perusing things out of habit like\ni do an itc image and bang i see all these itc type images. They are\nthere all right. I asked a friend of mine to take a look and see if he\ncould see them and he could.\n\nMight just be something due to the nature of the graphics or\noverwriting graphics with graphics as most of the images look\ncartoonish or like drawings.. but not all.\n\nAnyway just one more thing for me to explore, makes my game more\ninteresting:)\n\n\n\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;David Koenig&quot; &lt;floridajakeblues@...&gt;\nwrote:\n&gt;\n&gt; Yes, and that&#39;s why those that try to communicate with us use these\ntalents\n&gt; of our minds.It is the easiest method.\n&gt; \n&gt; On Sun, Dec 28, 2008 at 1:14 PM, don powell &lt;dpowell7299@...&gt; wrote:\n&gt; \n&gt; &gt;   Nope, not crazy.  You have to remember that the human mind excels at\n&gt; &gt; pattern recognition.  It is what we do better than any other animal or\n&gt; &gt; machine.  When we see or hear something that almost looks or\nsounds like\n&gt; &gt; something else, then our mind attempts to match it to known patterns.\n&gt; &gt;\n&gt; &gt; This is why EVPs and ITCs are so difficult, because we have to be\n&gt; &gt; constantly on guard against our own minds and it&#39;s love of pattern\nmatching\n&gt; &gt; )\n&gt; &gt;\n&gt; &gt; Don\n&gt; &gt;\n&gt; &gt; --- On *Sun, 12/28/08, shortbuff &lt;rdmc512@...&gt;* wrote:\n&gt; &gt;\n&gt; &gt; From: shortbuff &lt;rdmc512@...&gt;\n&gt; &gt; Subject: [EVP-ITC] Am i crazy?\n&gt; &gt; To: EVP-ITC@yahoogroups.com\n&gt; &gt; Date: Sunday, December 28, 2008, 12:31 AM\n&gt; &gt;\n&gt; &gt;  Years ago I noticed that some formations on walls and the like looked\n&gt; &gt; a lot like faces in the wood, concrete or paint or whatever. Now i&#39;ve\n&gt; &gt; been looking around in my house at the walls and the like and I see\n&gt; &gt; hundreds of faces like you see in ITC. In the on-line game I play I\n&gt; &gt; stopped to observe some of the walls and the like in the game and\n&gt; &gt; there they are mixed in with the wall, almost like they make up\nthe wall.\n&gt; &gt;\n&gt; &gt; In the wall paper of my win xp desktop landscape I see them as well.\n&gt; &gt;\n&gt; &gt; I&#39;m wondering if anyone else notices this sort of thing or if im just\n&gt; &gt; out of my mind:)\n&gt; &gt;\n&gt; &gt; Richard\n&gt; &gt;\n&gt; &gt;   \n&gt; &gt;\n&gt;"}