{"id": "1319", "subject": "Re: [EVP-ITC] cool edison cont....", "author": "Lisby", "timestamp": "2007-05-21T21:50:50Z", "full_text": "What you got is absolutely astounding. Can I ask you to do me a huge  \nfavor? Would you try it with the Harry Houdini wax recording? If you  \ncould, I would deeply grateful.\n\nAnn\n\nOn May 21, 2007, at 11:20 AM, Misty Dawn wrote:\n\n&gt; I used his message to the people of New Zealand. Ive gotten alot of  \n&gt; clear voices using various raw audio with that program I just never  \n&gt; tried to associate the audio file with the relevance of the words  \n&gt; that came thru.\n&gt;\n&gt; Misty\n&gt;\n&gt; Lisby &lt;lisby@...&gt; wrote:\n&gt; Misty--OMG. This is amazing. What live recordings did you feed into  \n&gt; EVPMaker?\n&gt;\n&gt; I wonder if working with their own voice in EVPmaker makes it  \n&gt; easier for them to construct an EVP? These are some of the clearest  \n&gt; EVP through EVPmaker that I have ever heard. I am really astounded.\n&gt;\n&gt; Ann\n&gt;\n&gt; On May 18, 2007, at 12:58 PM, Misty Dawn wrote:\n&gt;\n&gt;&gt; These are from a few days ago (attached to this post for new  \n&gt;&gt; members you need to set status to &quot;individual email&quot; setting for  \n&gt;&gt; the group to get attachments). I decided since I downloaded some  \n&gt;&gt; of Edison&#39;s historical speech to compare to my evp voice that I  \n&gt;&gt; wondered what I would get if I threw one of those into evpmaker. I  \n&gt;&gt; got a little more than I thought I would. It even made me have to  \n&gt;&gt; google to look up the meaning of one of the technical words LOL\n&gt;&gt;\n&gt;&gt; I also included the evp vs life speech side by side comparison  \n&gt;&gt; with the evp I got from ST method. Since thats how this started  \n&gt;&gt; and for those who just joined group and have no idea what I am  \n&gt;&gt; talkin about.\n&gt;&gt;\n&gt;&gt; Misty\n&gt;&gt;\n&gt;&gt; Ready for the edge of your seat? Check out tonight&#39;s top picks on  \n&gt;&gt; Yahoo! TV.\n&gt;&gt; &lt;edisonevpmaker-ivealwaysbeeninphysics.mp3&gt;\n&gt;&gt; &lt;edisonevpmaker-itmightworkformaryhadalittlelamx.mp3&gt;\n&gt;&gt; &lt;edisonevpmaker-ithinkhebrokethethermoisotope.mp3&gt;\n&gt;&gt; &lt;edisonevpmaker-icouldntididnttellanyoneiwasworkingfromthisside.mp3&gt;\n&gt;&gt; &lt;EDISON-LIFEvsEVP.mp3&gt;\n&gt;\n&gt;\n&gt;\n&gt; Park yourself in front of a world of choices in alternative vehicles.\n&gt; Visit the Yahoo! Auto Green Center. \n\n\nWha you go is absolu ely as ounding. Can I ask you o do me a huge a o ? Would you y i wi h he Ha y Houdini wax eco ding? I you could, I would deeply g a e ul.AnnOn May 21, 2007, a 11:20 AM, Mis y Dawn w o e: I used his message o he people o New Zealand. I e go en alo o clea oices using a ious aw audio wi h ha p og am I jus ne e ied o associa e he audio ile wi h he ele ance o he wo ds ha came h u.   Mis yLisby lisby@...> w o e: Mis y--OMG. This is amazing. Wha li e eco dings did you eed in o EVPMake ?  I wonde i wo king wi h hei own oice in EVPmake makes i easie o hem o cons uc an EVP? These a e some o he clea es EVP h ough EVPmake ha I ha e e e hea d. I am eally as ounded. Ann On May 18, 2007, a 12:58 PM, Mis y Dawn w o e: These a e om a ew days ago (a ached o his pos o new membe s you need o se s a us o \"indi idual email\" se ing o he g oup o ge a achmen s). I decided since I downloaded some o Edison's his o ical speech o compa e o my e p oice ha I wonde ed wha I would ge i I h ew one o hose in o e pmake . I go a li le mo e han I hough I would. I e en made me ha e o google o look up he meaning o one o he echnical wo ds LOL   I also included he e p s li e speech side by side compa ison wi h he e p I go om ST me hod. Since ha s how his s a ed and o hose who jus joined g oup and ha e no idea wha I am alkin abou .   Mis y Ready o he edge o you sea ? Check ou onigh 's op picks on Yahoo! TV. i ealwaysbeeninphysics.mp3> i migh wo k o ma yhadali lelamx.mp3> i hinkheb oke he he moiso ope.mp3> icouldn ididn ellanyoneiwaswo king om hisside.mp3> mp3> Pa k you sel in on o a wo ld o choices in al e na i e ehicles.Visi he Yahoo! Au o G een Cen e ."}