{"id": "1325", "subject": "Re: our methods are not to popular", "author": "bhali333", "timestamp": "2007-05-22T13:34:48Z", "full_text": "--- In EVP-ITC@yahoogroups.com, Misty Dawn &lt;bulletbabea@...&gt; wrote:\n&gt;\n&gt; Bruce\n&gt;    \n&gt;   I am sorry that you have to experience that but it goes hand in \nhand with what we do. I agree totally with Frank Ratka on this. I \nlearned along time ago that I am not doing this for recognition, \nfame, fortune, popularity, or to prove to anyone. Instead I approach \nit as I am the researcher, I am the student, I am learning. \n&gt;    \n&gt;   I no longer waste my time talking to people who interfere or have \na negative approach to the results we all get. I would much rather \nspend my few hours of free time talking to you guys or conducting \nmore experiments.\n&gt;    \n&gt;   I know it can be hard to ignore negativity but if you do not \nignore it then you yourself can become part of that negativity or be \nconsumed by it entirely. So share, but do not react to negative \nfeedback...enlighten but do not seek to impress.\n&gt;    \n&gt;   You are doing fine I see you uploaded a bunch of files I see some \nhave personal details...is this proof for Y O U...thats what is \nimportant. Did they prove to you without a doubt that something \nextraordinary went on during that session. If the answer was yes then \nyou know that you are on the right track. Dont let anyone pull you \noff that path or obstruct your moving forward.\n&gt;    \n&gt;   Misty\n&gt;    \n&gt;    \n&gt;    \n&gt;   \n&gt; Frank &lt;warrior18eii@...&gt; wrote:\n&gt;           Bruce,\n&gt; \n&gt; The best way to deal with the naysayers is to ignore them. We will\n&gt; always have people saying such things and fighting with them only\n&gt; negatively effects your own contact field. In the end you will not\n&gt; convince them of anything.\n&gt; \n&gt; In my case I answer what I think are legitimate questions from \nsincere\n&gt; people. Some of those turn out to be the naysayers who want to \nargue,\n&gt; I drop the conversation and move on. \n&gt; \n&gt; I look at it this way. If they have to ask how it works then they\n&gt; don&#39;t know and feel enough to understand anything I would have to \ntell\n&gt; them. They think it is a completely &quot;technical&quot; process, when the \nmost\n&gt; important components are the links between the two communicators.\n&gt; \n&gt; As Misty and I have talked about in the past I was one who use to \njump\n&gt; at any opportunity to &quot;fight the skeptics&quot;. I have since learned \nthat\n&gt; it is a pointless waste of energy and it does do damage to your\n&gt; contact field or bridge if you have established one. The turmoil and\n&gt; negative emotions controversy spawns are not conducive to the types \nof\n&gt; communications we have been experimenting with.\n&gt; \n&gt; Some of those skeptics genuinely want to learn what we know but just\n&gt; can&#39;t grasp the basics needed to perpetuate this reality. Others \njust\n&gt; want to get you worked up and off balance. By ignoring negative\n&gt; contacts you are protecting your connection to your higher self. \nDon&#39;t\n&gt; fall for their traps!\n&gt; \n&gt; Best Regards,\n&gt; \n&gt; Frank Ratka\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;bhali333&quot;\n&gt; &lt;paranormalinvestigating@&gt; wrote:\n&gt; &gt;\n&gt; &gt; hi guy&#39;s\n&gt; &gt; It seems that franks box and the sweep method are not to poular \nwith \n&gt; &gt; a few closed minded and self appointed paranormal truth seekers \nin \n&gt; &gt; other words individuals who can not accomplish anything on thier \nown \n&gt; &gt; as far as paranormal research is concerned so they feel they must \n&gt; &gt; lash out at others who open mindedly try new and mostly \nunexplored \n&gt; &gt; methods od spirit communication and investigation. they have no \nbasis \n&gt; &gt; for thier attacks but to say I work in the electronics field and \n&gt; &gt; franks box is impossible it can not work and the am sweep is just \n&gt; &gt; catching bits of words that your mind is naturaly putting \ntogether as \n&gt; &gt; phrases. What I would like them to explain is how the messages \n&gt; &gt; recieved in this manner pertain to my individual life , family \nand \n&gt; &gt; name and how can anyone explain what is so far to my knowledge \n&gt; &gt; unexplainable. Anyway enough venting. This began as a good \nhearted \n&gt; &gt; post on another paranormal forum in hopes of spurring some \n&gt; &gt; researchers like myself that were unaware of these methods to \nmaybe \n&gt; &gt; give them a try. I was immediatly attacked like by a pack of \nwolves \n&gt; &gt; claiming to be so called electronic experts and self appointed \n&gt; &gt; debunkers of fraud when all I did was to explain my experience \nwith \n&gt; &gt; the method and not to give a fact based report on it&#39;s validity \nbut \n&gt; &gt; to give my personal experience with it. WHY CAN&#39;T WE ALL JUST GET \n&gt; &gt; ALONG !!!\n&gt; &gt; \n&gt; &gt; bruce\n&gt; &gt;\n&gt; \n&gt; \n&gt; \n&gt;          \n&gt; \n&gt;  \n&gt; ---------------------------------\n&gt; Need Mail bonding?\n&gt; Go to the Yahoo! Mail Q&A for great tips from Yahoo! Answers users.\n\n\n\nfrank and misty,\nVery sound advice and it&#39;s always the same couple of people that jump \non any piece of evidence presented. I will heed your advice thank you.\nI have endured every assault you could think of about my vpi images \neven being called an outright lier and fake.\nIf you guy,s would like to check out my vpi images my website \nexplains all about them http://free-paranormalinvestigating.com/\n\nthanks again\nbruce"}