{"id": "13270", "subject": "Re: Need volenters  for validation experiment", "author": "Rick", "timestamp": "2009-01-17T20:09:58Z", "full_text": "This might be helpful when creating your test, or perhaps in the future:\n\nA little while back, I sent out a link to someone&#39;s evp that they\nthought was very clear (I think it was one of Coletta&#39;s).  It wasn&#39;t a\nvery well controlled test I was doing, since there were comments\nassociated with the youtube sound that I asked for people not to\nread,but of course, couldn&#39;t be sure they didn&#39;t.)\n\nAnyway, the results I got back were:\n2 people from this yahoo group thought they heard what Mike heard\n(though both posted their results to the group, so influence there\nfrom one to the other should be considered).\n\n4 other people heard variously &quot;Who are you?&quot;, &quot;Whoosh whoosh whoosh&quot;,\n&quot;the green grass&quot;, and nothing.\n\nThe problem I found also is that 3 people said they really didn&#39;t\nthink there were any words, but if they kept listening, they could\ntell me what it sounded most like.\n\nI have a door at home that squeaks when I open it.  It sounds like\n&quot;Eeagle&quot;.  I&#39;m pretty sure it&#39;s not a spirit inhabiting the door, and\nthat my 10W40 oil is not performing an exorcism.  The point is, when\nlistening to EVPs, some people in my test said they thought they heard\nwords.  And some said they didn&#39;t think so, but if they had to pick\nsomething it sounded most like, it was these words.  The latter is the\n&quot;Squeaky door&quot; effect I described.\n\nSo I think it would be a good idea to include the collection of that\nin the results.  People could be asked on a scale of 1-5, how certain\nwere you that you heard words in that sound (1=no words, 2=fairly\ndoubtful, 3=not sure either way, 4=fairly sure, 5=very certain) What\nwords if any?\n\nThat might help to not only get people&#39;s assessment of the sound, but\nalso allow them to express the strength of their conviction, which\nseemed an important component of several of the comments I was getting.\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;nightparanormalresearch&quot;\n&lt;nightparanormalresearch@...&gt; wrote:\n&gt;\n&gt; Reading the posts from the last week as I do every sat morning it is my \n&gt; opinion that some of them have a very polite condescending tone to \n&gt; them.This group and the people in it have always been very helpful and \n&gt; a joy to do research with I hope it stays that way I would hate to see \n&gt; it become one of &quot;those&quot; boards if you know what I mean (my 1 cent had \n&gt; to do it).  so anyway\n&gt; One productive idea that I saw from one of this weeks posts was to send \n&gt; the same file privitly to a few people and see what they hear in it. \n&gt; Unpromtide by file names or other posts about it. I have a couple files \n&gt; that I feel are pretty clear. So if you would like to volunteer just \n&gt; send me an email with your email adress and I will send you a file not \n&gt; too long but it will be unedited and in its original form.\n&gt; I will not amplify it or edit or change it in anyway from its original. \n&gt; Those who recive the files do the same NO editing untill you render \n&gt; your opinion to me about it after that you can do what u like with it.\n&gt;  Remember after listening email me DO NOT post what you hear on the \n&gt; board I will do that later when I have everyones opinion.\n&gt;                                 Mike W\n&gt;                          nightparanormalresearch@...\n&gt;"}