{"id": "13281", "subject": "Re: Video Part 3 uploaded (5 researchers ITC audio files)", "author": "M.A. Coletta (Mike)", "timestamp": "2009-01-21T23:47:45Z", "full_text": "Hi Chad,\n\nThanks again for participating and for sending your files.\nNo, I didn&#39;t get everyone who I mailed debris to participate.  If \nthey did do sessions, a couple didn&#39;t send any files to me.  One \nperson is still planning to send some just so I can hear them.\n\nI sent out 9 debris packages and got 5 sets of files in return... a \ngood investment.\n\nI need to listen to the files a few more times to see if there are \nthings I may have missed.  When dealing with the Radio Shack hacks or \nFranks Box, there is so much information being put out of the \nspeaker.  It&#39;s easy to miss something if you aren&#39;t really focused.\nI heard your &quot;the 20&quot; reply very clear and I knew about the passenger \ncount, so it was easy to relate the items quickly.\n\nYes, I got what I expected from all the files.  It was a good mixture \nof methods and the data is there for further review.\nThe instructions were followed pretty much, with a few files a bit \nlonger than 30 seconds, so I used the shorter ones, but still have \nsome of the longer ones for review too.\n\nWould I do this again..??  Yes.. I think I would.  I really \nappreciated all the willingness of those who were interested.\n\nAgain... thanks for your help and thanks for your kind words!\n\n- Mike C.\n\n--- In EVP-ITC@yahoogroups.com, &quot;Chad&quot; &lt;cawiggins78@...&gt; wrote:\n&gt;\n&gt; I am glad you finished the video Mike! I enjoyed getting to hear \nwhat\n&gt; everyone else sent in, as well as what your results were. I am \ncurious\n&gt; as to whether or not you got full participation once you sent out \nthe\n&gt; debris. Did everyone follow your instructions? Did you get files \nfrom\n&gt; everyone you send debris to? Did you get better or worse results \nthan\n&gt; you expected? Would you attempt something like this again?\n&gt; \n&gt; I was very excited to participate in the research and am planning on\n&gt; doing more with the debris in the future. Just wanted to \nsay &quot;thanks&quot;\n&gt; and keep up the great work. I think your experiments and willingness\n&gt; to share your work are a shining example to all in the paranormal \nfield.\n&gt; \n&gt; I hope everyone enjoyed this as much as I did. I plan on doing a \nwrite\n&gt; up on our website about the experiment in the near future. I&#39;d like \nto\n&gt; hear from the other researchers on their experience with this \nproject...\n&gt;"}