{"id": "13288", "subject": "Re: [EVP-ITC] Sociological question", "author": "Misty Dawn", "timestamp": "2009-01-22T18:12:42Z", "full_text": "RJ\nI think the answers will vary from individual to individual based on thier beliefs. As for me personally I grew up surrounded by unexplained events and my parents tried to ignore the things that they couldnt see because if you ignore it then it doesnt exist right? But there comes a time when the child grows up and forms thier own ideas and beliefs. Personally speaking once I reached adulthood there were many other people who experienced the same things I did in that house so I began to see that there was more to it than just a childs imagination.\n\nMost religions are based upon the idea that there is a higher power, that we all have spirits, and that there is something beyond this life. To say that someone is wrong for belief in ghosts I would have to say that billions of others are wrong for having belief at all. I dont think bad of a parent who takes their kids off to church every sunday nor do I think badly about a parent who spends some time doing ITC. Telling a child that there is more than what the eye can see, more than what the ears can hear, is giving them the basics for growing up with a mind thats open to possibility. What they do with that is up to them individually.\n\nI worry more about the kids who grow up with parents who are alchoholics, drug addicts, liars, thieves, abusers, etcetera.. than anyone.  \n\nAs for if the effect is positive or negative, I think that has to do with the intent or the approach taken by each individual whether it be ITC, religion, or life in general.\n\nMisty\n\n\n\n--- On Thu, 1/22/09, Rick &lt;rasterer@...&gt; wrote:\n\n&gt; From: Rick &lt;rasterer@...&gt;\n&gt; Subject: [EVP-ITC] Sociological question\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Thursday, January 22, 2009, 10:57 AM\n&gt; I was wondering if anyone had an opinion on the impact of\n&gt; performing\n&gt; ITC experiments or sessions, when there are young children\n&gt; around.  Do\n&gt; you think the children seeing their parents or others (in\n&gt; person, not\n&gt; on TV) engaging in this activity would have an effect on\n&gt; the children,\n&gt; and if so, do you think the effect would be positive, or\n&gt; negative?"}