{"id": "13297", "subject": "Re: [EVP-ITC] Sociological question", "author": "Rj", "timestamp": "2009-01-23T15:55:55Z", "full_text": "--0-441976706-1232726155=:98823\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nI think Misty makes some good points, and I agree that the issue is similar=\r\n to how one exposes a child to a belief system, such as a religion.=A0 I ag=\r\nree, too, that it will depend on the individual situation, as some will do =\r\nthis in a healthy way, and some may not: for example, we could all probably=\r\n name some religious cults that have been more harmful than good.=A0 In the=\r\n ITC world, I suppose a bad situation would be one where a poor ITC researc=\r\nher (one who thinks they are getting results, but isn&#39;t) insists to the chi=\r\nld that they can hear spirits. And I suppose a good situation would be as M=\r\nisty suggested: where an open mind is presented to them.=A0 \n\nAnd as Frank =\r\nnoted, this likely also depends on the child. And Frank also mentioned some=\r\nthing I thought was interesting: mental health.=A0 What is normal for menta=\r\nl health is often defined as what the majority believes.=A0 Since ITC is st=\r\nill not as big a belief system as other religions or belief systems, it cou=\r\nld be seen as abnormal by the uninitiated.=A0 And if Social Services were t=\r\no get involved (depending on how open minded the worker was) it could resul=\r\nt in a messy situation for someone who was insisting they could hear voices=\r\n talking to them over the radio or other devices.=A0 \n\nOr do you think this=\r\n is an overreation on my part to what Frank meant there?\n\n\n--- On Thu, 1/22=\r\n/09, Misty Dawn &lt;bulletbabea@...&gt; wrote:\n\nFrom: Misty Dawn &lt;bulletbab=\r\nea@...&gt;\nSubject: Re: [EVP-ITC] Sociological question\nTo: EVP-ITC@yaho=\r\nogroups.com\nDate: Thursday, January 22, 2009, 10:12 AM\n\n\n\n\n\n\n\n\n\n\n    \n     =\r\n       RJ\n\nI think the answers will vary from individual to individual base=\r\nd on thier beliefs. As for me personally I grew up surrounded by unexplaine=\r\nd events and my parents tried to ignore the things that they couldnt see be=\r\ncause if you ignore it then it doesnt exist right? But there comes a time w=\r\nhen the child grows up and forms thier own ideas and beliefs. Personally sp=\r\neaking once I reached adulthood there were many other people who experience=\r\nd the same things I did in that house so I began to see that there was more=\r\n to it than just a childs imagination.\n\n\n\nMost religions are based upon the=\r\n idea that there is a higher power, that we all have spirits, and that ther=\r\ne is something beyond this life. To say that someone is wrong for belief in=\r\n ghosts I would have to say that billions of others are wrong for having be=\r\nlief at all. I dont think bad of a parent who takes their kids off to churc=\r\nh every sunday nor do I think badly about a parent who spends some time doi=\r\nng ITC. Telling a child that there is more than what the eye can see, more =\r\nthan what the ears can hear, is giving them the basics for growing up with =\r\na mind thats open to possibility. What they do with that is up to them indi=\r\nvidually.\n\n\n\nI worry more about the kids who grow up with parents who are a=\r\nlchoholics, drug addicts, liars, thieves, abusers, etcetera.. than anyone. =\r\n \n\n\n\nAs for if the effect is positive or negative, I think that has to do w=\r\nith the intent or the approach taken by each individual whether it be ITC, =\r\nreligion, or life in general.\n\n\n\nMisty\n\n\n\n--- On Thu, 1/22/09, Rick &lt;raster=\r\ner@yahoo. com&gt; wrote:\n\n\n\n&gt; From: Rick &lt;rasterer@yahoo. com&gt;\n\n&gt; Subject: [EV=\r\nP-ITC] Sociological question\n\n&gt; To: EVP-ITC@yahoogroups .com\n\n&gt; Date: Thurs=\r\nday, January 22, 2009, 10:57 AM\n\n&gt; I was wondering if anyone had an opinion=\r\n on the impact of\n\n&gt; performing\n\n&gt; ITC experiments or sessions, when there =\r\nare young children\n\n&gt; around.  Do\n\n&gt; you think the children seeing their pa=\r\nrents or others (in\n\n&gt; person, not\n\n&gt; on TV) engaging in this activity woul=\r\nd have an effect on\n\n&gt; the children,\n\n&gt; and if so, do you think the effect =\r\nwould be positive, or\n\n&gt; negative?\n\n\n\n\n      \n\n    \n    \n\t\n\t \n\t\n\t\n\n\n\n\n\n\n\n\n\t=\r\n\n\n\n\t\n\t\n\n\n      \r\n--0-441976706-1232726155=:98823\r\nContent-Type: text/html; charset=us-ascii\r\n\r\n&lt;table cellspacing=&quot;0&quot; cellpadding=&quot;0&quot; border=&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=&quot;top&quot; style=&quot;font: inherit;&quot;&gt;I think Misty makes some good points, and I agree that the issue is similar to how one exposes a child to a belief system, such as a religion.&nbsp; I agree, too, that it will depend on the individual situation, as some will do this in a healthy way, and some may not: for example, we could all probably name some religious cults that have been more harmful than good.&nbsp; In the ITC world, I suppose a bad situation would be one where a poor ITC researcher (one who thinks they are getting results, but isn&#39;t) insists to the child that they can hear spirits. And I suppose a good situation would be as Misty suggested: where an open mind is presented to them.&nbsp; &lt;br&gt;&lt;br&gt;And as Frank noted, this likely also depends on the child. And Frank also mentioned something I thought was interesting: mental health.&nbsp; What is normal for mental health is often defined as\n what the majority believes.&nbsp; Since ITC is still not as big a belief system as other religions or belief systems, it could be seen as abnormal by the uninitiated.&nbsp; And if Social Services were to get involved (depending on how open minded the worker was) it could result in a messy situation for someone who was insisting they could hear voices talking to them over the radio or other devices.&nbsp; &lt;br&gt;&lt;br&gt;Or do you think this is an overreation on my part to what Frank meant there?&lt;br&gt;&lt;br&gt;&lt;br&gt;--- On &lt;b&gt;Thu, 1/22/09, Misty Dawn &lt;i&gt;&lt;bulletbabea@...&gt;&lt;/i&gt;&lt;/b&gt; wrote:&lt;br&gt;&lt;blockquote style=&quot;border-left: 2px solid rgb(16, 16, 255); margin-left: 5px; padding-left: 5px;&quot;&gt;&lt;br&gt;From: Misty Dawn &lt;bulletbabea@...&gt;&lt;br&gt;Subject: Re: [EVP-ITC] Sociological question&lt;br&gt;To: EVP-ITC@yahoogroups.com&lt;br&gt;Date: Thursday, January 22, 2009, 10:12 AM&lt;br&gt;&lt;br&gt;&lt;div id=&quot;yiv2128523423&quot;&gt;\n\n\n\n\n\n    &lt;div id=&quot;ygrp-text&quot;&gt;\n            &lt;p&gt;RJ&lt;br&gt;\nI think the answers will vary from individual to individual based on thier beliefs. As for me personally I grew up surrounded by unexplained events and my parents tried to ignore the things that they couldnt see because if you ignore it then it doesnt exist right? But there comes a time when the child grows up and forms thier own ideas and beliefs. Personally speaking once I reached adulthood there were many other people who experienced the same things I did in that house so I began to see that there was more to it than just a childs imagination.&lt;br&gt;\n&lt;br&gt;\nMost religions are based upon the idea that there is a higher power, that we all have spirits, and that there is something beyond this life. To say that someone is wrong for belief in ghosts I would have to say that billions of others are wrong for having belief at all. I dont think bad of a parent who takes their kids off to church every sunday nor do I think badly about a parent who spends some time doing ITC. Telling a child that there is more than what the eye can see, more than what the ears can hear, is giving them the basics for growing up with a mind thats open to possibility. What they do with that is up to them individually.&lt;br&gt;\n&lt;br&gt;\nI worry more about the kids who grow up with parents who are alchoholics, drug addicts, liars, thieves, abusers, etcetera.. than anyone.  &lt;br&gt;\n&lt;br&gt;\nAs for if the effect is positive or negative, I think that has to do with the intent or the approach taken by each individual whether it be ITC, religion, or life in general.&lt;br&gt;\n&lt;br&gt;\nMisty&lt;br&gt;\n&lt;br&gt;\n--- On Thu, 1/22/09, Rick &lt;&lt;a rel=&quot;nofollow&quot; ymailto=&quot;mailto:rasterer%40yahoo.com&quot; target=&quot;_blank&quot; href=&quot;/mc/compose?to=rasterer%40yahoo.com&quot;&gt;rasterer@yahoo. com&lt;/a&gt;&gt; wrote:&lt;br&gt;\n&lt;br&gt;\n&gt; From: Rick &lt;&lt;a rel=&quot;nofollow&quot; ymailto=&quot;mailto:rasterer%40yahoo.com&quot; target=&quot;_blank&quot; href=&quot;/mc/compose?to=rasterer%40yahoo.com&quot;&gt;rasterer@yahoo. com&lt;/a&gt;&gt;&lt;br&gt;\n&gt; Subject: [EVP-ITC] Sociological question&lt;br&gt;\n&gt; To: &lt;a rel=&quot;nofollow&quot; ymailto=&quot;mailto:EVP-ITC%40yahoogroups.com&quot; target=&quot;_blank&quot; href=&quot;/mc/compose?to=EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups .com&lt;/a&gt;&lt;br&gt;\n&gt; Date: Thursday, January 22, 2009, 10:57 AM&lt;br&gt;\n&gt; I was wondering if anyone had an opinion on the impact of&lt;br&gt;\n&gt; performing&lt;br&gt;\n&gt; ITC experiments or sessions, when there are young children&lt;br&gt;\n&gt; around.  Do&lt;br&gt;\n&gt; you think the children seeing their parents or others (in&lt;br&gt;\n&gt; person, not&lt;br&gt;\n&gt; on TV) engaging in this activity would have an effect on&lt;br&gt;\n&gt; the children,&lt;br&gt;\n&gt; and if so, do you think the effect would be positive, or&lt;br&gt;\n&gt; negative?&lt;br&gt;\n&lt;br&gt;\n&lt;/p&gt;\n    &lt;/div&gt;  \n\n\n\t \n\t\n\t&lt;/div&gt;&lt;/blockquote&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n      \r\n--0-441976706-1232726155=:98823--"}