{"id": "13301", "subject": "Re: [EVP-ITC] Need Volenters Test 2 and Info about ME", "author": "Zack Widup", "timestamp": "2009-01-23T17:33:11Z", "full_text": "I have been insanely busy for the last week or so.  I&#39;ll listen to both\nof them this evening and respond directly to you, Mike.\n\nZack\n\nOn Fri, Jan 23, 2009 at 8:56 AM, Rj &lt;rasterer@...&gt; wrote:\n\n&gt;\n&gt; It&#39;s too bad you didn&#39;t get more participation.  I&#39;d be happy to be part of\n&gt; the second test too.\n&gt;\n&gt; One thing I&#39;d suggest: remove any question(s) that you are asking, from the\n&gt; audio file.  Since you&#39;re trying to study how different people will\n&gt; interpret the same file, and are trying not to give any hints as to what\n&gt; other people hear in the file, leaving the question in could be a factor\n&gt; there.  For example, if you are asking a yes/no question in the audio, then\n&gt; the people listening might be inclined to restrict their answers to having\n&gt; heard a &quot;yes&quot; or a &quot;no&quot; (because the question implies that is what may\n&gt; follow).  But by leaving the question out, you remove any hints as to what\n&gt; they should expect.\n&gt;\n&gt;\n&gt; --- On *Fri, 1/23/09, nightparanormalresearch &lt;\n&gt; nightparanormalresearch@...&gt;* wrote:\n&gt;\n&gt;\n&gt; From: nightparanormalresearch &lt;nightparanormalresearch@...&gt;\n&gt; Subject: [EVP-ITC] Need Volenters Test 2 and Info about ME\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Friday, January 23, 2009, 6:11 AM\n&gt;\n&gt;   The first test did not go so well participation levels were not so\n&gt; good and that may be partaly my fault so I would like to try this\n&gt; again .\n&gt; I have a different file I would like to privatly email to anyone\n&gt; willing to listen to it. All you have to do is send me what you hear\n&gt; and how clear it was to you.\n&gt;\n&gt; I dont know if I have ever made mention of this before but my time\n&gt; is extremly limited I work Mon-Thurs 6am till 5pm then go to school\n&gt; those days 630 till 930pm so fri sat and sun are the only days I have\n&gt; to answer emails or read the board. also igo by the screan name\n&gt; nightparanormalrese arch (obviosly).The name Northern IL Ghost Hunting\n&gt; Team is my wife Sarah we are both part of the same nonprofit\n&gt; organization here in our home town (N.I.G.H.T). So if iam a little\n&gt; busy I may have her answer somthing or post somthing if Iam unable\n&gt; otherwise youll always get me first thing friday and sat so if\n&gt; someone has a question on a post for me depending on what day it is\n&gt; you may have to wait till fri or sat.\n&gt; I just wanted to put that out ther so noone thinks Iam ignoring\n&gt; them or not answering emails.\n&gt; Now back to the test I will send out the new file to all those who\n&gt; participated in the last one and any one who would also like to\n&gt; participate let me know via email nightparanormalrese arch@yahoo. com&lt;http://mc/compose?to=nightparanormalresearch%40yahoo.com&gt;\n&gt; and i will gladly send it to you.If you participated on the last one\n&gt; but dont want to on this one just ignore the email ill be sending.\n&gt; Thank you to all those who have taken the time to listen to the\n&gt; first one and I truly apoligize that it was a bust but I think this\n&gt; one will be alot better as I have mor time to spend and i wont be\n&gt; rushing.\n&gt;\n&gt;\n&gt; \n&gt;\n\nI ha e been insanely busy o he las week o so.  I'll lis en o bo h o   hem his e ening and espond di ec ly  o you, Mike.\n \nZack\nOn F i, Jan 23, 2009 a 8:56 AM, Rj as e e @...> w o e:\n\n\n\n\n\n\n\n\n\nI 's oo bad you didn' ge mo e pa icipa ion.  I'd be happy o be pa o he second es oo.One hing I'd sugges : emo e any ques ion(s) ha you a e asking, om he audio ile.  Since you' e ying o s udy how di e en people will in e p e he same ile, and a e ying no o gi e any hin s as o wha o he people hea in he ile, lea ing he ques ion in could be a ac o he e.  Fo example, i you a e asking a yes/no ques ion in he audio, hen he people lis ening migh be inclined o es ic hei answe s o ha ing hea d a \"yes\" o a \"no\" (because he ques ion implies ha is wha may ollow).  Bu by lea ing he ques ion ou , you emo e any hin s as o wha hey should expec .\n--- On F i, 1/23/09, nigh pa ano mal esea ch nigh pa ano mal esea ch@...> w o e:\nF om: nigh pa ano mal esea ch nigh pa ano mal esea ch@...>Subjec : [EVP-ITC] Need Volen e s Tes 2 and In o abou ME\nTo: EVP-ITC@yahoog oups.comDa e: F iday, Janua y 23, 2009, 6:11 AM\n\n\n\nThe i s es did no go so well pa icipa ion le els we e no so good and ha may be pa aly my aul so I would like o y his again .I ha e a di e en ile I would like o p i a ly email o anyone \nwilling o lis en o i . All you ha e o do is send me wha you hea and how clea i was o you.I don know i I ha e e e made men ion o his be o e bu my ime is ex emly limi ed I wo k Mon-Thu s 6am ill 5pm hen go o school \n hose days 630 ill 930pm so i sa and sun a e he only days I ha e o answe emails o ead he boa d. also igo by he sc ean name nigh pa ano mal ese a ch (ob iosly).The name No he n IL Ghos Hun ing \n\nTeam is my wi e Sa ah we a e bo h pa o he same nonp o i o ganiza ion he e in ou home own (N.I.G.H.T). So i iam a li le busy I may ha e he answe som hing o pos som hing i Iam unable \no he wise youll always ge me i s hing iday and sa so i someone has a ques ion on a pos o me depending on wha day i is you may ha e o wai ill i o sa . I jus wan ed o pu ha ou he so noone hinks Iam igno ing \n hem o no answe ing emails. Now back o he es I will send ou he new ile o all hose who pa icipa ed in he las one and any one who would also like o pa icipa e le me know ia email nigh pa ano mal ese a ch@yahoo. com \nand i will gladly send i o you.I you pa icipa ed on he las one bu don wan o on his one jus igno e he email ill be sending.Thank you o all hose who ha e aken he ime o lis en o he \n i s one and I uly apoligize ha i was a bus bu I hink his one will be alo be e as I ha e mo ime o spend and i won be ushing."}