{"id": "1334", "subject": "Re: New Member", "author": "Guy", "timestamp": "2007-05-26T00:08:04Z", "full_text": "Yes, welcome from me, too!\n\nI would add that a top Web site to check out is the American \nAssociation for Electronic Voice Phenomena...http://www.aaevp.com/.\n\nAt the miniumum - click on the &quot;Techniques&quot; button and read through \nthem.\n\nBill and I are both members so we get BIG kickbacks for everyone who \nsigns up! LOL... Naw...we WISH!!!\n\nGuy\n\n--- In EVP-ITC@yahoogroups.com, &quot;psi_research&quot; &lt;vilhellm@...&gt; wrote:\n&gt;\n&gt; Hey Jessie, welcome to the forum. There are lot&#39;s of web based \n&gt; resources with different suggestions on recording evp&#39;s but the #1 \nbit \n&gt; of advice is to make certain other people nearby are speaking. The \nmic \n&gt; can be more sensitive than your ears and the recording is \namplified so \n&gt; contaminated evidence is always a concern. If you&#39;re recording \nwith \n&gt; other folks make sure no one whispers, if they do announce out \nloud \n&gt; ythe name of the person and announce that they whispered. EVP&#39;s \noften \n&gt; sound like a whisper and usually have a different accoustic \nquality, \n&gt; ex: the room noise or echo sounds different.\n&gt; \n&gt; If you don&#39;t have audio editing software check out &quot;Audacity&quot;. \nJust \n&gt; Google it, it&#39;s a free download. You&#39;ll want to transfer your \nfiles to \n&gt; a computer and sometimes filter out hum but be careful not to over \n&gt; filter. You can also cut down long recordings into reasonable \nsizes. \n&gt; \n&gt; Although, people have recorded EVP&#39;s in many different places, try \n&gt; locations that you can connect with emotionally. This facilitates \na \n&gt; possible psychic connection which some people theorize helps get \n&gt; successful recordings.\n&gt; \n&gt; We&#39;ll be listening , Bill\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Jessie&quot; &lt;sweetpea1278@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hello,\n&gt; &gt; \n&gt; &gt; I am from Northern Michigan, and am interested in capturing \nEVPS. I\n&gt; &gt; have a digital recorder in which I have gotten a few my first \ntry. But\n&gt; &gt; I would like to see what others say as far as ways to get the \nbest\n&gt; &gt; results. So I am pretty new to this, but excited to try some\n&gt; &gt; experiments. Thanks, Jessie\n&gt; &gt;\n&gt;"}