{"id": "13386", "subject": "Re: Digest Number 1408", "author": "Rick", "timestamp": "2009-02-09T15:34:29Z", "full_text": "Thanks for the anecdote Leslie.  Looks like we&#39;re tracking down the\nactual citations for what Edison claimed in that area, so I am hopeful\nwe&#39;ll be able to definately clear it all up!\n\nRick\n\n--- In EVP-ITC@yahoogroups.com, Aquarius &lt;laustin@...&gt; wrote:\n&gt;\n&gt; Hi, Rick.\n&gt; \n&gt; Back in the day when I was working on my Ph.D. thesis, which\ninvolved some technical stuff about the history of the development of\nmultitrack recording, and the effects of electronic mediation on vocal\nmusic performance, I came across a reference to Edison. I apologize,\nbut I have long since lost the original citation, so I can&#39;t offer it\nto you.\n&gt; \n&gt; What I remember from my research at the time was that Edison did\nindeed believe that the voices of spirits could be recorded, and in\nfact his work on what turned out to be the phonograph (capturing\nvoices on wax cylinders, later on flat platters, later on what we call\nrecords) was intended to eventually lead to being able to record\nspirit voices. Apparently he got as far as figuring out how to record\nincarnate human voices &lt;g&gt;, but stopped before he got any spirit\nvoices. I seem to dimly remember some comment that he thought his\ntechnology needed to be further developed, but he didn&#39;t pursue it, at\nleast not in any way that has ever been publicly disclosed.\n&gt; \n&gt; Hope this helps, though the citation is lacking!\n&gt; \n&gt; Best,\n&gt; \n&gt; Leslie\n&gt; \n&gt; &gt;From: Rick &lt;rasterer@yahoo. com&gt;\n&gt; &gt;Subject: [EVP-ITC] Re: TruTV with the Box\n&gt; &gt;To: EVP-ITC@yahoogroups .com\n&gt; &gt;Date: Friday, February 6, 2009, 9:24 AM&gt;\n&gt; &gt;    \n&gt; &gt; I suppose ultimately, it doesn&#39;t really matter if Edison made a\ntelephone to the dead or not.  &gt;Modern researchers in this field will\nhave to stand on their own results anyway, and if they&#39;ve &gt;managed to\ndiscover something that Edison never achieved, good for them!\n&gt; &gt;\n&gt; &gt;I have also heard varied claims: that Edison did make this box;\nthat Edison was working on it but &gt;never finished it; that Edison was\njoking when he mentioned working on it.  So for my own sake, I&#39;d &gt;like\nto know the real story.\n&gt;"}