{"id": "13384", "subject": "Re: [EVP-ITC] Re: Digest Number 1408", "author": "David Koenig", "timestamp": "2009-02-09T12:39:25Z", "full_text": "Sounds fair!Looks like the entire show is a SET-UP!\n\nOn Mon, Feb 9, 2009 at 4:01 AM, psi_research &lt;vilhellm@...&gt; wrote:\n\n&gt;   I see TruTV also removed where it was stated Mr. Moon is the &quot;sole&quot;\n&gt; possesor of the Box. But still, it disses the person who brought this\n&gt; technology to the public, and that is Mr. Sumption. Thanks to thoses\n&gt; that contacted the network to set the record straight but the Edison\n&gt; connection is wishful thinking, and a distortion of statements made\n&gt; in the 1920&#39;s in Forbes followed by American Scientific magazine led\n&gt; to the assumption such a device was being worked on. He is the single\n&gt; quote by Edison that has resulted in a bit of history being\n&gt; twisted: &quot;if we can evolve an instrument so delicate as to be\n&gt; affected by our personality as it survives in the next life, such an\n&gt; instrument, when made available, ought to record something.&quot;\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Aquarius\n&gt; &lt;laustin@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hi, Rick.\n&gt; &gt;\n&gt; &gt; Back in the day when I was working on my Ph.D. thesis, which\n&gt; involved some technical stuff about the history of the development of\n&gt; multitrack recording, and the effects of electronic mediation on\n&gt; vocal music performance, I came across a reference to Edison. I\n&gt; apologize, but I have long since lost the original citation, so I\n&gt; can&#39;t offer it to you.\n&gt; &gt;\n&gt; &gt; What I remember from my research at the time was that Edison did\n&gt; indeed believe that the voices of spirits could be recorded, and in\n&gt; fact his work on what turned out to be the phonograph (capturing\n&gt; voices on wax cylinders, later on flat platters, later on what we\n&gt; call records) was intended to eventually lead to being able to record\n&gt; spirit voices. Apparently he got as far as figuring out how to record\n&gt; incarnate human voices &lt;g&gt;, but stopped before he got any spirit\n&gt; voices. I seem to dimly remember some comment that he thought his\n&gt; technology needed to be further developed, but he didn&#39;t pursue it,\n&gt; at least not in any way that has ever been publicly disclosed.\n&gt; &gt;\n&gt; &gt; Hope this helps, though the citation is lacking!\n&gt; &gt;\n&gt; &gt; Best,\n&gt; &gt;\n&gt; &gt; Leslie\n&gt; &gt;\n&gt; &gt; &gt;From: Rick &lt;rasterer@yahoo. com&gt;\n&gt; &gt; &gt;Subject: [EVP-ITC] Re: TruTV with the Box\n&gt; &gt; &gt;To: EVP-ITC@yahoogroups .com\n&gt; &gt; &gt;Date: Friday, February 6, 2009, 9:24 AM&gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; I suppose ultimately, it doesn&#39;t really matter if Edison made a\n&gt; telephone to the dead or not. &gt;Modern researchers in this field will\n&gt; have to stand on their own results anyway, and if they&#39;ve &gt;managed to\n&gt; discover something that Edison never achieved, good for them!\n&gt; &gt; &gt;\n&gt; &gt; &gt;I have also heard varied claims: that Edison did make this box;\n&gt; that Edison was working on it but &gt;never finished it; that Edison was\n&gt; joking when he mentioned working on it. So for my own sake, I&#39;d\n&gt; &gt;like to know the real story.\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nSounds ai !Looks like he en i e show is a SET-UP!On Mon, Feb 9, 2009 a 4:01 AM, psi_ esea ch ilhellm@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n I see T uTV also emo ed whe e i was s a ed M . Moon is he \"sole\" \nposseso o he Box. Bu s ill, i disses he pe son who b ough his \n echnology o he public, and ha is M . Sump ion. Thanks o hoses \n ha con ac ed he ne wo k o se he eco d s aigh bu he Edison \nconnec ion is wish ul hinking, and a dis o ion o s a emen s made \nin he 1920's in Fo bes ollowed by Ame ican Scien i ic magazine led \n o he assump ion such a de ice was being wo ked on. He is he single \nquo e by Edison ha has esul ed in a bi o his o y being \n wis ed: \"i we can e ol e an ins umen so delica e as o be \na ec ed by ou pe sonali y as i su i es in he nex li e, such an \nins umen , when made a ailable, ough o eco d some hing.\"\n\n--- In EVP-ITC@yahoog oups.com, Aqua ius w o e:\n>\n> Hi, Rick.\n> \n> Back in he day when I was wo king on my Ph.D. hesis, which \nin ol ed some echnical s u abou he his o y o he de elopmen o \nmul i ack eco ding, and he e ec s o elec onic media ion on \n ocal music pe o mance, I came ac oss a e e ence o Edison. I \napologize, bu I ha e long since los he o iginal ci a ion, so I \ncan' o e i o you.\n> \n> Wha I emembe om my esea ch a he ime was ha Edison did \nindeed belie e ha he oices o spi i s could be eco ded, and in \n ac his wo k on wha u ned ou o be he phonog aph (cap u ing \n oices on wax cylinde s, la e on la pla e s, la e on wha we \ncall eco ds) was in ended o e en ually lead o being able o eco d \nspi i oices. Appa en ly he go as a as igu ing ou how o eco d \ninca na e human oices , bu s opped be o e he go any spi i \n oices. I seem o dimly emembe some commen ha he hough his \n echnology needed o be u he de eloped, bu he didn' pu sue i , \na leas no in any way ha has e e been publicly disclosed.\n> \n> Hope his helps, hough he ci a ion is lacking!\n> \n> Bes ,\n> \n> Leslie\n> \n> >F om: Rick \n> >Subjec : [EVP-ITC] Re: T uTV wi h he Box\n> >To: EVP-ITC@yahoog oups .com\n> >Da e: F iday, Feb ua y 6, 2009, 9:24 AM>\n> > \n> > I suppose ul ima ely, i doesn' eally ma e i Edison made a \n elephone o he dead o no . >Mode n esea che s in his ield will \nha e o s and on hei own esul s anyway, and i hey' e >managed o \ndisco e some hing ha Edison ne e achie ed, good o hem!\n> >\n> >I ha e also hea d a ied claims: ha Edison did make his box; \n ha Edison was wo king on i bu >ne e inished i ; ha Edison was \njoking when he men ioned wo king on i . So o my own sake, I'd \n>like o know he eal s o y.\n>"}