{"id": "13428", "subject": "Hey Golden Phoenix", "author": "Jon", "timestamp": "2009-02-15T17:52:10Z", "full_text": "GP, I am glad to see you are here, a friendly face from close by. I am\nalso glad to see that this site is not all negative.  I had just\njoined last week, and made the post about the Door to the Dead; and\nwith all the negative post was thinking about leaving this forum. In\nfact I had e-mailed Larry privately expressing that thought.\n\nI have seen a rash of e-mails more up beat so I have gone back to\nindividual e-mails from the digest.  I think I will hang around a\nlittle longer.\n\nFor other members in Texas, I&#39;m in Houston, just across the channel\nfrom the Golden Phoenix.  I see we are well represented as a state. I\nam glad to meet all of you.\n\n\nRegards,\nJon in Texas\n\n\n--- In EVP-ITC@yahoogroups.com, Golden Phoenix &lt;golden_phoenix42@...&gt;\nwrote:\n&gt;\n&gt; not to bad for an old man here. not much happening around here but\nhome repairs.\n&gt; \n&gt; http://www.myspace.com/ghost_hunter50 see my site links\n&gt; \n&gt; --- On Sat, 2/14/09, Larry Weinreich &lt;LWEINREICH@...&gt; wrote:\n&gt; \n&gt; \n&gt; From: Larry Weinreich &lt;LWEINREICH@...&gt;\n&gt; Subject: Re: [EVP-ITC] Door To The Dead\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Saturday, February 14, 2009, 2:10 PM\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Hey Jeff!!!!\n&gt;  Nice to see ya again :) Hows it going down there? Elly and the\nothers from across the pond send their wish&#39;s :) You me...I always say\nwhat I feel.\n&gt;  Larry\n&gt; \n&gt; \n&gt; ----- Original Message ----- \n&gt; From: Golden Phoenix \n&gt; To: EVP-ITC@yahoogroups .com \n&gt; Sent: Saturday, February 14, 2009 1:53 PM\n&gt; Subject: Re: [EVP-ITC] Door To The Dead\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Dang Larry tell us how Ya really feel old buddy LOL.\n&gt; \n&gt; http://www.myspace. com/ghost_ hunter50 see my site links\n&gt; \n&gt; --- On Sat, 2/14/09, laurie@steuber. com &lt;laurie@steuber. com&gt; wrote:\n&gt; \n&gt; \n&gt; From: laurie@steuber. com &lt;laurie@steuber. com&gt;\n&gt; Subject: Re: [EVP-ITC] Door To The Dead\n&gt; To: EVP-ITC@yahoogroups .com\n&gt; Date: Saturday, February 14, 2009, 12:42 PM\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; I agree, Larry! (and I am a psychic, lol)\n&gt; I did not watch the show because my group and I were actually out\ninvestigating something last night. As it is we are very busy with\ncases, box research and other research and projects. We do not,\ntherefore, have time to watch other people,often pathetic wanna-be\nfamous para-celebs,pretend to be what we really are.\n&gt; \n&gt; I wrote a blog about this whole thing - in this field, thos that can\ndo..those that can&#39;t sit and watch others pretend to do ti on TV.\n&gt; \n&gt; Laurie\n&gt; -----Original Message-----\n&gt; From: &quot;Larry Weinreich&quot; &lt;LWEINREICH@satx. rr.com&gt;\n&gt; Sent: Saturday, February 14, 2009 1:35pm\n&gt; To: EVP-ITC@yahoogroups .com\n&gt; Subject: Re: [EVP-ITC] Door To The Dead\n&gt; \n&gt; \n&gt; I find most paranormal showshave become BS and I don&#39;t watch any.\nIts all the same &quot;dogand pony&quot; act. Since &quot;Ghost Hunters&quot; has become\na hit &quot;everyone&quot; wants their own tv show or radio show. Its all &quot;look\nat me&quot;.\n&gt;  Sorry I&#39;m very jaded on tv paranormal\ninvestigators, mediums and evangelists on Sunday mornings. In my book\nthey all rank just a bit above lawyers but still below pro wrestling.\n&gt;  (Hows that for an introduction? :) )\n&gt;  Larry\n&gt; \n&gt; \n&gt; ----- Original Message ----- \n&gt; From: John S \n&gt; To: EVP-ITC@yahoogroups .com \n&gt; Sent: Saturday, February 14, 2009 9:44 AM\n&gt; Subject: [EVP-ITC] Door To The Dead\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; I have to admit that I thought I had seen the worst &#39;paranormal&#39;\nshow on television already. I was wrong. Door to the Dead has exceeded\nmy worst expectations.\n&gt; \n&gt; Generally, I respect John Oliver&#39;s work as a medium. While I have no\npersonal experience with him, in the past he has looked and acted more\ngenuine than not, the rolling of the eyes put aside for the moment.\n&gt; \n&gt; I do take exception to the characterization of the talking box as an\nEdison device. I have documented the history of Edison, ITC and\nEVPelsewhere. This is however the smallest concern I have with this\nshow.\n&gt; \n&gt; Prior to wathcing I had just had a conversation with a respected\ncolleague on the West coast regarding interesting phenomena he and\nothers are constantly observing in sites with phenomena similar to\nthat on Door to the Dead. None of those measurements were made by this\nteam. The use of thermal in this situation is not indicated as well.\n&gt; \n&gt; The real concern is that no attempt was made to help this family in\na broader context. The skeptic did and said nothing skeptical as far\nas I could tell. Key questions were not asked (at least on-camera)\nthat would reveal the psycho-dynamics of this family. We know fairly\nwell at this time that PK phenomena is often centered on a focal\nperson who can exhibit specific characteristics. That the team seems\nunaware of this is quite disturbing to a person like myself.\n&gt; \n&gt; A real research opportunity was lost in this case, as was an\nopportunity to educate the public on the right way to approach such\nsituations. Continually sending the messages that phenomena is based\non &#39;demons&#39; and &#39;spirits&#39; exclusively does nothing to further the\nposition of serious investigators, which is perhaps most troubling of all.\n&gt;"}