{"id": "13421", "subject": "Re: Door To The Dead", "author": "Steve Hultay", "timestamp": "2009-02-14T22:02:48Z", "full_text": "Laurie,\n\nI didn&#39;t know you were so close, keep me in mind for your next \ninvestigation.  I&#39;m only in NJ.\n\n-Steve H.\n\n\n\n--- In EVP-ITC@yahoogroups.com, laurie@... wrote:\n&gt;\n&gt; \n&gt; We are in  southeastern PA, right outside Philadelphia.\n&gt; \n&gt; I have sensed - seen and heard things all my life. My first clear \nmemory of seeing a spirit was when I was four years old.\n&gt; \n&gt;  \n&gt; \n&gt; I use various combinations of hacked radios to enhance our spirit \ncommunication sessions. When we get all three psychics together we \nreally get some activity. \n&gt; \n&gt;  \n&gt; \n&gt; We will be at Fort Mifflin tomorrow night - there is a live \nbroadcast from 6-7 on para-x..you should check it out, Mark (the \nhost) from CCPRS uses itc and the puck.\n&gt; \n&gt;  \n&gt; \n&gt; Laurie\n&gt; \n&gt; -----Original Message-----\n&gt; From: &quot;Larry Weinreich&quot; &lt;LWEINREICH@...&gt;\n&gt; Sent: Saturday, February 14, 2009 1:52pm\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Subject: Re: [EVP-ITC] Door To The Dead\n&gt; \n&gt; \n&gt; \n&gt; ﻿ \n&gt; \n&gt; \n&gt; LOL  Laurie  :)\n&gt; \n&gt;    Our group (6th Sense Paranormal) had a meeting last night and 2 \ninvestigations also. Nice to meet ya. From where do you hail? When \ndid you first learn you could sense things others could not? BTW I&#39;m \nnot anti mediums...just those on TV. We have been using a Ovilus in a \nfew of our cases....mixed results.\n&gt; \n&gt;            Larry\n&gt; \n&gt;  \n&gt; \n&gt; \n&gt; ----- Original Message ----- \n&gt; \n&gt; From: [mailto:laurie@...] laurie@... \n&gt; \n&gt; To: [mailto:EVP-ITC@yahoogroups.com] EVP-ITC@yahoogroups.com \n&gt; \n&gt; Sent: Saturday, February 14, 2009 12:42 PM\n&gt; \n&gt; Subject: Re: [EVP-ITC] Door To The Dead\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; I agree, Larry! (and I am a psychic, lol)\n&gt; \n&gt; I did not watch the show because my group and I were actually out \ninvestigating  something last night. As it is we are very busy with \ncases, box research and other research and projects. We do not, \ntherefore, have time to watch other people,often pathetic wanna-be \nfamous para-celebs, pretend to be what we really are.\n&gt; \n&gt;  \n&gt; \n&gt; I wrote a blog about this whole thing - in this field, thos that \ncan do..those that can&#39;t sit and watch others pretend to do ti on TV.\n&gt; \n&gt;  \n&gt; \n&gt; Laurie\n&gt; -----Original Message-----\n&gt; From: &quot;Larry Weinreich&quot; &lt;LWEINREICH@...&gt;\n&gt; Sent: Saturday, February 14, 2009 1:35pm\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Subject: Re: [EVP-ITC] Door To The Dead\n&gt; \n&gt; \n&gt; \n&gt; I find most paranormal shows have become BS and I don&#39;t watch any. \nIts all the same &quot;dog and pony&quot; act. Since &quot;Ghost Hunters&quot; has become \na hit &quot;everyone&quot; wants their own tv show or radio show. Its all &quot;look \nat me&quot;.\n&gt; \n&gt;                  Sorry I&#39;m very jaded on tv paranormal \ninvestigators,mediums and evangelists on Sunday mornings. In my book \nthey all rank just a bit above lawyers but still below pro wrestling.\n&gt; \n&gt;   (Hows that for an introduction?  :)  )\n&gt; \n&gt;                   Larry\n&gt; \n&gt;  \n&gt; \n&gt; \n&gt; ----- Original Message ----- \n&gt; \n&gt; From: [mailto:phenom_investigator@...] John S \n&gt; \n&gt; To: [mailto:EVP-ITC@yahoogroups.com] EVP-ITC@yahoogroups.com \n&gt; \n&gt; Sent: Saturday, February 14, 2009 9:44 AM\n&gt; \n&gt; Subject: [EVP-ITC] Door To The Dead\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; I have to admit that I thought I had seen the worst &#39;paranormal&#39; \nshow on television already. I was wrong. Door to the Dead has \nexceeded my worst expectations.\n&gt; \n&gt;  \n&gt; \n&gt; Generally, I respect John Oliver&#39;s work as a medium. While I have \nno personal experience with him, in the past he has looked and acted \nmore genuine than not, the rolling of the eyes put aside for the \nmoment.\n&gt; \n&gt;  \n&gt; \n&gt; I do take exception to the characterization of the talking box as \nan Edison device. I have documented the history of Edison, ITC and \nEVP  [http://www.sdparanormal.com/EdisonWhitePaper.html] elsewhere. \nThis is however the smallest concern I have with this show.\n&gt; \n&gt;  \n&gt; \n&gt; Prior to wathcing I had just had a conversation with a respected \ncolleague on the West coast regarding interesting phenomena he and \nothers are constantly observing in sites with phenomena similar to \nthat on Door to the Dead. None of those measurements were made by \nthis team. The use of thermal in this situation is not indicated as \nwell.\n&gt; \n&gt;  \n&gt; \n&gt; The real concern is that no attempt was made to help this family in \na broader context. The skeptic did and said nothing skeptical as far \nas I could tell. Key questions were not asked (at least on-camera) \nthat would reveal the psycho-dynamics of this family. We know fairly \nwell at this time that PK phenomena is often centered on a focal \nperson who can exhibit specific characteristics. That the team seems \nunaware of this is quite disturbing to a person like myself.\n&gt; \n&gt;  \n&gt; \n&gt; A real research opportunity was lost in this case, as was an \nopportunity to educate the public on the right way to approach such \nsituations. Continually sending the messages that phenomena is based \non &#39;demons&#39; and &#39;spirits&#39; exclusively does nothing to further the \nposition of serious investigators, which is perhaps most troubling of \nall.\n&gt;"}