{"id": "13438", "subject": "Re: Door to the Dead", "author": "eastern_paranormal", "timestamp": "2009-02-17T00:59:31Z", "full_text": "Well stated Mike!\n\nGabreael\n\nwww.easternparanormal.com \n\n\n--- In EVP-ITC@yahoogroups.com, &quot;M.A. Coletta (Mike)&quot; \n&lt;michaelcoletta@...&gt; wrote:\n&gt;\n&gt; Opinion follows:\n&gt; I think what most people forget when they view the reality TV shows \n&gt; such as Door to the Dead, Ghost Hunters, Paranormal State, etc., \nare \n&gt; that these ARE Reality TV shows and nothing more.  I watch them as \n&gt; entertainment, and nothing more.\n&gt; Yes, there are some real investigations going on concerning the \n&gt; paranormal, EVP, ITC spirit communication, entity dicovery, etc., \nbut \n&gt; 99.9% of the time you will not be witnessing a real investigation \n&gt; going on in a reality TV show. (G.H. DttD, P.S., etc.)\n&gt; These type venues are about making money in the form of advertising \n&gt; dollars.\n&gt; Your REAL investigations are being done by &#39;unknowns&#39; and people, \nand \n&gt; groups with nothing more than a few tools and a cheap video camera; \n&gt; not TruTV, Discovery Channel, or History Channel.\n&gt; You usually don&#39;t see REAL investigations on TV.\n&gt; \n&gt; Yes, Ghost Hunters is the self proclaimed number one paranormal \nvenue \n&gt; on the tube, but do you really think they are following REAL \n&gt; investigative techniques?\n&gt; If you&#39;ve seen the show... you should have that answer.\n&gt; \n&gt; G.H. is scheduled to come to a local Inn near me; an Inn that has \n&gt; very very few incidents of paranormal activity in its past history.\n&gt; BUT, I bet when I see that episode on G.H., there will be more \n&gt; activity in the first hour of the show than has gone on in the \nentire \n&gt; history of the INN.  WHY???  Becasue it&#39;s reality TV and to make \n&gt; money they have to induce activity and action... otherwise no one \n&gt; will watch.\n&gt; \n&gt; So... bottom line.  Don&#39;t view shows like G.H., Door to the Dead, \n&gt; Paranormal State, and the others as the definition of an \n&gt; investigative series... watch them for the entertainment value, and \n&gt; you won&#39;t be dissapointed.....\n&gt; \n&gt; Okay... stepping off the paranormal soapbox now.\n&gt; Thanks for listening!\n&gt; - Mike C.  (UFO Geek) http://www.ufogeek.com\n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, John S &lt;phenom_investigator@&gt; \n&gt; wrote:\n&gt; &gt;\n&gt; &gt; I am pleased that the outcome for the family was positive. And I \nam \n&gt; not surprised. The key I think is that a belief system was \n&gt; successfully altered. This in turn likely impacted the focal \nperson, \n&gt; who based on the limited information presented could have been the \n&gt; young man. \n&gt; .........to achieve them most likely. \n&gt; &gt; \n&gt; &gt; Thank you for your interest as this is an important topic of \n&gt; discussion.\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; ________________________________\n&gt; &gt;\n&gt;"}