{"id": "13436", "subject": "Re: Door to the Dead", "author": "John S", "timestamp": "2009-02-16T14:04:11Z", "full_text": "--0-52601602-1234793051=:19628\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nI am pleased that the outcome for the family was positive. And I am not sur=\r\nprised. The key I think is that a belief system was successfully altered. T=\r\nhis in turn likely impacted the focal person, who based on the limited info=\r\nrmation presented could have been the young man. \nI am not saying the effor=\r\nts were ineffectual, just that the presentation sends the wrong message to =\r\nthe public and that there was lack of opportunity to gather information abo=\r\nut what to all=A0appearances may have been a legitimate example of PK pheno=\r\nmena.\n\nThis phenomena occurs often enough that it has been extensively stud=\r\nied by some parapsychologists. It has been noted that there is often an abu=\r\nndance of magnetic field disturbances in such cases, both electromagnetic a=\r\nnd geomagnetic disturbances have been noted, ranging from a few milligauss =\r\nto several guass. These levels are quite high and are detected in the absen=\r\nce of any obvious natural sources. The investigators are trained in physics=\r\n and psychophysiology and so are expert in understanding=A0these conditions=\r\n and detecting natural sources for such fields.\n\nIt has been found that foc=\r\nal persons (called PK agents) are often at the center of PK disturbances. N=\r\not only does this result in object movement but it also results in seeing l=\r\numinous objects and smelling unexplained noxious odors among other phenomen=\r\na. Many of these were indicated in this specific case.\n\nI would have done t=\r\nwo things differently based on what I was able to discern about the case fr=\r\nom the edited footage. First, I would have taken more extensive magnetic fi=\r\neld measurements the moment I realized that PK phenomena was being reported=\r\n. I would want to determine the likelihood that such phenomena might in fac=\r\nt be at the center of the reported outbreaks. If this appeared to be the ca=\r\nse, I would focus on finding that focal person (or persons) and explain wha=\r\nt is known about PK to the family. This would have included determining the=\r\nir health status looking for indications of physical disorders that might h=\r\nave environmental causation. These findings would add to the existing body =\r\nof knowledge in this field and thereby help the family and the research.\n\nS=\r\necond, I would have tried to learn more about the family&#39;s personal dynamic=\r\ns. This requires the skills of a trained psychologist. Generally the family=\r\n is interviewed one by one and in some way their beliefs and the family rel=\r\nationship is carefully explored. This is important because such groups exhi=\r\nbit interesting interpersonal relationships which often are reflected in th=\r\neir behaviors. It is important to understand that phenomena such as this is=\r\n far more complex than potential spirit interactions or voices from the dea=\r\nd. PK specifically often appear to be a group-mediated event. That is, thos=\r\ne things that happen reflect the interpersonal realtionships in the group. =\r\nUnfortunately this is not well understood in general.\n\nAdditionally, I woul=\r\nd have focused less on a metaphysical interpretation because as far as one =\r\ncan tell, it seems unjustified by the presented evidence. Let me be clear. =\r\nI am not saying there is no reason to believe any form of spirit influence =\r\nor communication could occur. Rather,=A0 I am saying that before one goes d=\r\nown that road, one should rule out to the greatest degree possible, all nat=\r\nural causations. It appears=A0this was =A0not done in this specific case. \n=\r\n\nWhile the outcomes would have been quite similar, the family would not hav=\r\ne to have been scared to achieve them most likely. \n\nThank you for your int=\r\nerest as this is an important topic of discussion.\n\n\n______________________=\r\n__________\n\n\n\n      \r\n--0-52601602-1234793051=:19628\r\nContent-Type: text/html; charset=us-ascii\r\n\r\n&lt;html&gt;&lt;head&gt;&lt;style type=&quot;text/css&quot;&gt;&lt;!-- DIV {margin:0px;} --&gt;&lt;/style&gt;&lt;/head&gt;&lt;body&gt;&lt;div style=&quot;font-family:times new roman, new york, times, serif;font-size:12pt&quot;&gt;&lt;DIV&gt;I am pleased that the outcome for the family was positive. And I am not surprised. The key I think is that a belief system was successfully altered. This in turn likely impacted the focal person, who based on the limited information presented could have been the young man. &lt;/DIV&gt;\n&lt;DIV&gt;I am not saying the efforts were ineffectual, just that the presentation sends the wrong message to the public and that there was lack of opportunity to gather information about what to all&nbsp;appearances may have been a legitimate example of PK phenomena.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;This phenomena occurs often enough that it has been extensively studied by some parapsychologists. It has been noted that there is often an abundance of magnetic field disturbances in such cases, both electromagnetic and geomagnetic disturbances have been noted, ranging from a few milligauss to several guass. These levels are quite high and are detected in the absence of any obvious natural sources. The investigators are trained in physics and psychophysiology and so are expert in understanding&nbsp;these conditions and detecting natural sources for such fields.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;It has been found that focal persons (called PK agents) are often at the center of PK disturbances. Not only does this result in object movement but it also results in seeing luminous objects and smelling unexplained noxious odors among other phenomena. Many of these were indicated in this specific case.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I would have done two things differently based on what I was able to discern about the case from the edited footage. First, I would have taken more extensive magnetic field measurements the moment I realized that PK phenomena was being reported. I would want to determine the likelihood that such phenomena might in fact be at the center of the reported outbreaks. If this appeared to be the case, I would focus on finding that focal person (or persons) and explain what is known about PK to the family. This would have included determining their health status looking for indications of physical disorders that might have environmental causation. These findings would add to the existing body of knowledge in this field and thereby help the family and the research.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Second, I would have tried to learn more about the family&#39;s personal dynamics. This requires the skills of a trained psychologist. Generally the family is interviewed one by one and in some way their beliefs and the family relationship is carefully explored. This is important because such groups exhibit interesting interpersonal relationships which often are reflected in their behaviors. It is important to understand that phenomena such as this is far more complex than potential spirit interactions or voices from the dead. PK specifically often appear to be a group-mediated event. That is, those things that happen reflect the interpersonal realtionships in the group. Unfortunately this is not well understood in general.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Additionally, I would have focused less on a metaphysical interpretation because as far as one can tell, it seems unjustified by the presented evidence. Let me be clear. I am not saying there is no reason to believe any form of spirit influence or communication could occur. Rather,&nbsp; I am saying that before one goes down that road, one should rule out to the greatest degree possible, all natural causations. It appears&nbsp;this was &nbsp;not done in this specific case. &lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;While the outcomes would have been quite similar, the family would not have to have been scared to achieve them most likely. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Thank you for your interest as this is an important topic of discussion.&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV style=&quot;FONT-SIZE: 10pt; FONT-FAMILY: arial, helvetica, sans-serif&quot;&gt;&lt;FONT face=Tahoma size=2&gt;\n&lt;HR SIZE=1&gt;\n&lt;/FONT&gt;&lt;/DIV&gt;&lt;/div&gt;&lt;br&gt;\n\n      &lt;/body&gt;&lt;/html&gt;\r\n--0-52601602-1234793051=:19628--"}