{"id": "13440", "subject": "Re: [EVP-ITC] Re: Door to the Dead", "author": "David Koenig", "timestamp": "2009-02-17T05:59:07Z", "full_text": "Can this bee seen on the net anywhere?Thanks\nDave\n\nOn Mon, Feb 16, 2009 at 7:59 PM, eastern_paranormal &lt;eparanormal@...&gt;wrote:\n\n&gt;   Well stated Mike!\n&gt;\n&gt; Gabreael\n&gt;\n&gt; www.easternparanormal.com\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, &quot;M.A. Coletta\n&gt; (Mike)&quot;\n&gt; &lt;michaelcoletta@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Opinion follows:\n&gt; &gt; I think what most people forget when they view the reality TV shows\n&gt; &gt; such as Door to the Dead, Ghost Hunters, Paranormal State, etc.,\n&gt; are\n&gt; &gt; that these ARE Reality TV shows and nothing more. I watch them as\n&gt; &gt; entertainment, and nothing more.\n&gt; &gt; Yes, there are some real investigations going on concerning the\n&gt; &gt; paranormal, EVP, ITC spirit communication, entity dicovery, etc.,\n&gt; but\n&gt; &gt; 99.9% of the time you will not be witnessing a real investigation\n&gt; &gt; going on in a reality TV show. (G.H. DttD, P.S., etc.)\n&gt; &gt; These type venues are about making money in the form of advertising\n&gt; &gt; dollars.\n&gt; &gt; Your REAL investigations are being done by &#39;unknowns&#39; and people,\n&gt; and\n&gt; &gt; groups with nothing more than a few tools and a cheap video camera;\n&gt; &gt; not TruTV, Discovery Channel, or History Channel.\n&gt; &gt; You usually don&#39;t see REAL investigations on TV.\n&gt; &gt;\n&gt; &gt; Yes, Ghost Hunters is the self proclaimed number one paranormal\n&gt; venue\n&gt; &gt; on the tube, but do you really think they are following REAL\n&gt; &gt; investigative techniques?\n&gt; &gt; If you&#39;ve seen the show... you should have that answer.\n&gt; &gt;\n&gt; &gt; G.H. is scheduled to come to a local Inn near me; an Inn that has\n&gt; &gt; very very few incidents of paranormal activity in its past history.\n&gt; &gt; BUT, I bet when I see that episode on G.H., there will be more\n&gt; &gt; activity in the first hour of the show than has gone on in the\n&gt; entire\n&gt; &gt; history of the INN. WHY??? Becasue it&#39;s reality TV and to make\n&gt; &gt; money they have to induce activity and action... otherwise no one\n&gt; &gt; will watch.\n&gt; &gt;\n&gt; &gt; So... bottom line. Don&#39;t view shows like G.H., Door to the Dead,\n&gt; &gt; Paranormal State, and the others as the definition of an\n&gt; &gt; investigative series... watch them for the entertainment value, and\n&gt; &gt; you won&#39;t be dissapointed.....\n&gt; &gt;\n&gt; &gt; Okay... stepping off the paranormal soapbox now.\n&gt; &gt; Thanks for listening!\n&gt; &gt; - Mike C. (UFO Geek) http://www.ufogeek.com\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, John S\n&gt; &lt;phenom_investigator@&gt;\n&gt; &gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; I am pleased that the outcome for the family was positive. And I\n&gt; am\n&gt; &gt; not surprised. The key I think is that a belief system was\n&gt; &gt; successfully altered. This in turn likely impacted the focal\n&gt; person,\n&gt; &gt; who based on the limited information presented could have been the\n&gt; &gt; young man.\n&gt; &gt; .........to achieve them most likely.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Thank you for your interest as this is an important topic of\n&gt; &gt; discussion.\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; ________________________________\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nCan his bee seen on he ne anywhe e?ThanksDa eOn Mon, Feb 16, 2009 a 7:59 PM, eas e n_pa ano mal epa ano mal@aol.com> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n Well s a ed Mike!\n\nGab eael\n\nwww.eas e npa ano mal.com \n\n--- In EVP-ITC@yahoog oups.com, \"M.A. Cole a (Mike)\" \n w o e:\n>\n> Opinion ollows:\n> I hink wha mos people o ge when hey iew he eali y TV shows \n> such as Doo o he Dead, Ghos Hun e s, Pa ano mal S a e, e c., \na e \n> ha hese ARE Reali y TV shows and no hing mo e. I wa ch hem as \n> en e ainmen , and no hing mo e.\n> Yes, he e a e some eal in es iga ions going on conce ning he \n> pa ano mal, EVP, ITC spi i communica ion, en i y dico e y, e c., \nbu \n> 99.9% o he ime you will no be wi nessing a eal in es iga ion \n> going on in a eali y TV show. (G.H. D D, P.S., e c.)\n> These ype enues a e abou making money in he o m o ad e ising \n> dolla s.\n> You REAL in es iga ions a e being done by 'unknowns' and people, \nand \n> g oups wi h no hing mo e han a ew ools and a cheap ideo came a; \n> no T uTV, Disco e y Channel, o His o y Channel.\n> You usually don' see REAL in es iga ions on TV.\n> \n> Yes, Ghos Hun e s is he sel p oclaimed numbe one pa ano mal \n enue \n> on he ube, bu do you eally hink hey a e ollowing REAL \n> in es iga i e echniques?\n> I you' e seen he show... you should ha e ha answe .\n> \n> G.H. is scheduled o come o a local Inn nea me; an Inn ha has \n> e y e y ew inciden s o pa ano mal ac i i y in i s pas his o y.\n> BUT, I be when I see ha episode on G.H., he e will be mo e \n> ac i i y in he i s hou o he show han has gone on in he \nen i e \n> his o y o he INN. WHY??? Becasue i 's eali y TV and o make \n> money hey ha e o induce ac i i y and ac ion... o he wise no one \n> will wa ch.\n> \n> So... bo om line. Don' iew shows like G.H., Doo o he Dead, \n> Pa ano mal S a e, and he o he s as he de ini ion o an \n> in es iga i e se ies... wa ch hem o he en e ainmen alue, and \n> you won' be dissapoin ed.....\n> \n> Okay... s epping o he pa ano mal soapbox now.\n> Thanks o lis ening!\n> - Mike C. (UFO Geek) h p://www.u ogeek.com\n> \n> \n> --- In EVP-ITC@yahoog oups.com, John S \n> w o e:\n> >\n> > I am pleased ha he ou come o he amily was posi i e. And I \nam \n> no su p ised. The key I hink is ha a belie sys em was \n> success ully al e ed. This in u n likely impac ed he ocal \npe son, \n> who based on he limi ed in o ma ion p esen ed could ha e been he \n> young man. \n> ......... o achie e hem mos likely. \n> > \n> > Thank you o you in e es as his is an impo an opic o \n> discussion.\n> > \n> > \n> > ________________________________\n> >\n>"}