{"id": "13463", "subject": "Re: Frequencies for Inducing Ascension and Manifestation", "author": "itcdeadpeople", "timestamp": "2009-02-23T00:42:44Z", "full_text": "Focus 15 is one of my favorites, RJ.  My only complaint is this:  I\nlike to listen to the areas where there is no talking louder than what\nis comfortable where there is talking.  So, I normally turn the volume\nup after the intro, get deeply into the CD, then I get startled when\nthe talking begins again!  :shock:\n\nI have the Monroe single CD called The Visit, which is a nice guided\nvisualization to a cave where you can visit with those on the other\nside.  The first time I used it, I met my grandmother and thought it\nwas a wonderful experience.\n\nGosh, they have so many titles to choose from!\n\nMargaret\n\n--- In EVP-ITC@yahoogroups.com, Rj &lt;rasterer@...&gt; wrote:\n&gt;\n&gt; Wow - I never met anyone who knew about Monroe&#39;s hemisync stuff.\n&gt; I still have the Gateway experience on cassette tapes from years ago.\n&gt; I hear they&#39;ve gone to CDs (which I don&#39;t think had been invented\nback then...)\n&gt; \n&gt; \n&gt; --- On Sun, 2/22/09, itcdeadpeople &lt;ITCdeadpeople@...&gt; wrote:\n&gt; \n&gt; From: itcdeadpeople &lt;ITCdeadpeople@...&gt;\n&gt; Subject: [EVP-ITC] Re: Frequencies for Inducing Ascension and\nManifestation\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Sunday, February 22, 2009, 2:22 PM\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;     \n&gt;             I&#39;ve been looking around the website:  \n&gt; \n&gt; http://69.89. 31.222/~thesoun6 /?page_id= 26\n&gt; \n&gt; \n&gt; \n&gt; And I&#39;ve joined the group.  The sounds are really different from what\n&gt; \n&gt; I&#39;m used to.  I *really* like Monroe&#39;s Gateway hemisync CD&#39;s.  It\n&gt; \n&gt; seems the main difference is most of the sounds Donald Adams developed\n&gt; \n&gt; are more for the body, rather than the brain.\n&gt; \n&gt; \n&gt; \n&gt; There are some samples for download.  I haven&#39;t had a chance to work\n&gt; \n&gt; with them yet, but I&#39;m really fascinated by the concept.  It makes\n&gt; \n&gt; perfect sense to me.  \n&gt; \n&gt; \n&gt; \n&gt; I&#39;m a little familiar with Reiki.  My main training is in a form of\n&gt; \n&gt; energy work called Quantum Touch. And I took a weekend Pranic Healing\n&gt; \n&gt; workshop which I enjoyed.  \n&gt; \n&gt; \n&gt; \n&gt; Recently there was a study done to see if one of Monroe&#39;s cd&#39;s\n&gt; \n&gt; (created only for the study, not for market) would improve the\n&gt; \n&gt; reception of EVP.  To clarify, the sounds where played through\n&gt; \n&gt; headphones into the receiver&#39;s ear while conducting an EVP session. \n&gt; \n&gt; They were not used as background ... though come to think of it, that\n&gt; \n&gt; might be an interest experiment in itself.  As I recall, there was not\n&gt; \n&gt; a significant change, one way or the other, when the sounds where\n&gt; \n&gt; listened to during recording.  But I was glad to see such research\n&gt; \n&gt; taking place.  All data is helpful, in my opinion.  \n&gt; \n&gt; \n&gt; \n&gt; Margaret\n&gt; \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups .com, &quot;gamedazed&quot; &lt;gamedazed@ ..&gt; wrote:\n&gt; \n&gt; &gt;\n&gt; \n&gt; &gt; I&#39;d be more than willing to participate. i&#39;ve been using binaurals for\n&gt; \n&gt; &gt; years (sounds similar if not the same technology). Ironically enough I\n&gt; \n&gt; &gt; also dabbled in Reiki :p I&#39;d still be considered lvl1 though. I have\n&gt; \n&gt; &gt; seen the images which are supposed to enhance abilities and while I\n&gt; \n&gt; &gt; notice power, I can&#39;t utilize it. Anyways, I&#39;d be very happy to join\n&gt; \n&gt; &gt; you in this, especially if its frequency is this beneficial.\n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups .com, &quot;itcdeadpeople&quot; &lt;ITCdeadpeople@ &gt;\nwrote:\n&gt; \n&gt; &gt; &gt;\n&gt; \n&gt; &gt; &gt; Very cool YouTube video. \n&gt; \n&gt; &gt; &gt; http://www.youtube. com/watch? v=6sonpvUxGL8 \n&gt; \n&gt; &gt; &gt; \n&gt; \n&gt; &gt; &gt; The patterns reminded me of Emoto&#39;s work with water, but this is\n&gt; \n&gt; &gt; &gt; sound.  Really interesting.  \n&gt; \n&gt; &gt; &gt; \n&gt; \n&gt; &gt; &gt; My hearing is very sensitive, so I don&#39;t know how much of, or\nfor how\n&gt; \n&gt; &gt; &gt; long, the sounds I heard that I would be able to tolerate.  But I&#39;m\n&gt; \n&gt; &gt; &gt; going to go browse a little more or your web site.  \n&gt; \n&gt; &gt; &gt; \n&gt; \n&gt; &gt; &gt; Margaret  \n&gt; \n&gt; &gt; &gt; \n&gt; \n&gt; &gt; &gt; --- In EVP-ITC@yahoogroups .com, Doc Stars &lt;docstarsrx008@ &gt; wrote:\n&gt; \n&gt; &gt; &gt; &gt;\n&gt; \n&gt; &gt; &gt; &gt; \n&gt; \n&gt; &gt; &gt; &gt; \n&gt; \n&gt; &gt; &gt; &gt; I&#39;d like to introduce myself.. and share this information with the\n&gt; \n&gt; &gt; &gt; group here in the hopes that some members may have an interest in\n&gt; \n&gt; &gt; &gt; participating in an experimental research project.\n&gt; \n&gt; &gt; &gt; &gt; \n&gt; \n&gt; &gt; &gt; &gt; Im looking for people who are willing to participate in our online\n&gt; \n&gt; &gt; &gt; experiment and can provide input, feedback and comparison on some of\n&gt; \n&gt; &gt; &gt; the various digital frequency files we are using.\n&gt; \n&gt; &gt; &gt; &gt; \n&gt; \n&gt; &gt; &gt; &gt; After many years of researching, on going development and testing\n&gt; \n&gt; &gt; &gt; our current experimental group of approximately 2000 volunteers have\n&gt; \n&gt; &gt; &gt; been witness to some really unusual and intense phenomena playing\n&gt; \n&gt; &gt; &gt; out... bordering on the supra-normal. We&#39;re seeing rapid, profound\n&gt; \n&gt; &gt; &gt; effects on the body and mind occuring via this new acoustic\nfrequency\n&gt; \n&gt; &gt; &gt; tool.\n&gt; \n&gt; &gt; &gt; &gt; \n&gt; \n&gt; &gt; &gt; &gt; Specifically, one of the areas we are focusing on now and are\nhoping\n&gt; \n&gt; &gt; &gt; to collect more data on are the effects on the mind and body\nfrom the\n&gt; \n&gt; &gt; &gt; use of\n&gt; \n&gt; &gt; &gt; &gt; frequencies designed to entrain the body and mind towards those\n&gt; \n&gt; &gt; &gt; states conducive to the experience of ascension and the\nmanifestation\n&gt; \n&gt; &gt; &gt; of desired positive change.\n&gt; \n&gt; &gt; &gt; &gt; \n&gt; \n&gt; &gt; &gt; &gt; I recently released new &#39;frequency&#39; protoypes that our group has\n&gt; \n&gt; &gt; &gt; been testing and their reports of the results they have been\n&gt; \n&gt; &gt; &gt; experiencing have been staggering.\n&gt; \n&gt; &gt; &gt; &gt; \n&gt; \n&gt; &gt; &gt; &gt; Implications currently, are for enormous  potential\nimprovements for\n&gt; \n&gt; &gt; &gt; health and wellness as well as rapid change from challenging\nmind and\n&gt; \n&gt; &gt; &gt; emotional states to ones of increased vitality, increased\nperformance\n&gt; \n&gt; &gt; &gt; and increased well being and balance.\n&gt; \n&gt; &gt; &gt; &gt; \n&gt; \n&gt; &gt; &gt; &gt; One possible and very real application of this may be to address\n&gt; \n&gt; &gt; &gt; both general and specific aspects of health issues.  For example one\n&gt; \n&gt; &gt; &gt; of our members experimented with effects on the blood , had an\n&gt; \n&gt; &gt; &gt; independent lab analyze his blood sample and it seems like there\nwas a\n&gt; \n&gt; &gt; &gt; dramatic change in the bloods terrain!\n&gt; \n&gt; &gt; &gt; &gt; \n&gt; \n&gt; &gt; &gt; &gt; Data collected to date on reaction responses have been over\nthe top\n&gt; \n&gt; &gt; &gt; &gt; favourable.. ...\n&gt; \n&gt; &gt; &gt; &gt; \n&gt; \n&gt; &gt; &gt; &gt; We are finding that actual &#39;things&#39; are happening, when these\n&gt; \n&gt; &gt; &gt; frequencies are simply played. Very noticeable and dramatic effects\n&gt; \n&gt; &gt; &gt; and changes in the body, mind and environment - unlike anything\n&gt; \n&gt; &gt; &gt; induced by any other sound (that we know of).  many people who\n&gt; \n&gt; &gt; &gt; experimented on these frequencies report that they are unlike other\n&gt; \n&gt; &gt; &gt; existing technologies such as binaural beats.\n&gt; \n&gt; &gt; &gt; &gt; \n&gt; \n&gt; &gt; &gt; &gt; What we need right now however, are more volunteers who are\nwilling\n&gt; \n&gt; &gt; &gt; to test out our other frequencies and keep a log of their\nfindings and\n&gt; \n&gt; &gt; &gt; report their observations to our group. There is no cost\nrequired for\n&gt; \n&gt; &gt; &gt; testing frequencies, the primary benefit to my group and I is the\n&gt; \n&gt; &gt; &gt; collection of data.... the benefit to you, well... once you see what\n&gt; \n&gt; &gt; &gt; we are engaged in, I think you will be more than satisfied with the\n&gt; \n&gt; &gt; &gt; experience.. ...\n&gt; \n&gt; &gt; &gt; &gt; \n&gt; \n&gt; &gt; &gt; &gt; Two things important here, one is to share with you the\nobservations\n&gt; \n&gt; &gt; &gt; of our\n&gt; \n&gt; &gt; &gt; &gt; group in their process of discovery in relation to the health\n&gt; \n&gt; &gt; &gt; related frequency track - the thought being, that you are likely to\n&gt; \n&gt; &gt; &gt; not only find this intrinsically interesting and newsworthy but also\n&gt; \n&gt; &gt; &gt; inspiring. The second is to provide you with a means of facilitating\n&gt; \n&gt; &gt; &gt; your own journey through this phenomena in the hopes you can share\n&gt; \n&gt; &gt; &gt; your own unique findings with us.\n&gt; \n&gt; &gt; &gt; &gt; \n&gt; \n&gt; &gt; &gt; &gt; Feel free to view a recent post on our research forum that details\n&gt; \n&gt; &gt; &gt; how to access this information and also various frequency tracks you\n&gt; \n&gt; &gt; &gt; can download.\n&gt; \n&gt; &gt; &gt; &gt; \n&gt; \n&gt; &gt; &gt; &gt; http://health. groups.yahoo. com/group/ the_sound_ of_stars/\nmessage/8216\n&gt; \n&gt; &gt; &gt; &gt; \n&gt; \n&gt; &gt; &gt; &gt; Examples of recent reports by users ;\n&gt; \n&gt; &gt; &gt; &gt; \n&gt; \n&gt; &gt; &gt; &gt; “I am struck with the effects that sound has on the physical\n&gt; \n&gt; &gt; &gt; structure. That is, especially in the subtle tissues like\nneurons and\n&gt; \n&gt; &gt; &gt; synapses. Case in point, I don&#39;t hesitate in expressing myself just\n&gt; \n&gt; &gt; &gt; the way it comes out. No coloring, no bravado, no bullshit.... the\n&gt; \n&gt; &gt; &gt; endorphine level in the body went way up. I have noted from my\ninitial\n&gt; \n&gt; &gt; &gt; listening of this freq. is that it appears to synchronize the 2\n&gt; \n&gt; &gt; &gt; hemispheres of the brain and thought became markedly coherent. ..\n&gt; \n&gt; &gt; &gt; perhaps the feeling of increased endorphine flow could be an actual\n&gt; \n&gt; &gt; &gt; increase in neuro- transmitter presence, particularly\nseratonin... . As\n&gt; \n&gt; &gt; &gt; things ended I was left with this feeling of balance and well\nbeing. I\n&gt; \n&gt; &gt; &gt; definitely want to work with this sequence more. It seems to be the\n&gt; \n&gt; &gt; &gt; right one for me currently. I probably want to post this explanation\n&gt; \n&gt; &gt; &gt; on the Yahoo site. I&#39;ll be sending my initial impressions in another\n&gt; \n&gt; &gt; &gt; email to you shortly. Thanks again for this amazing opportunity.”\n&gt; \n&gt; &gt; &gt; &gt; \n&gt; \n&gt; &gt; &gt; &gt; “This morning I listened to kindle mind set, I have had\nfamily in\n&gt; \n&gt; &gt; &gt; and had not used the fequencies for a week. The first sensations\nwere\n&gt; \n&gt; &gt; &gt; an extreme energy from my hands I am a Reiki Master but the\nenergy and\n&gt; \n&gt; &gt; &gt; heat I felt was more than I had experienced before.There was a\n&gt; \n&gt; &gt; &gt; bubbling feeling inside my chest their was intense tingling of my\n&gt; \n&gt; &gt; &gt; chest and torso, a sensual, sexual feel.My arms legs and feet were\n&gt; \n&gt; &gt; &gt; extremely warm, I am usually cold. It felt like my blood was\n&gt; \n&gt; &gt; &gt; bubbling.I had an effervesce feeling in my mouth. My feet\ntingled and\n&gt; \n&gt; &gt; &gt; as I nwas laying on the chaise listening, I closed my eyes and was\n&gt; \n&gt; &gt; &gt; enjoying a full color animated video like p roduction without sound.\n&gt; \n&gt; &gt; &gt; This is first time I have seen anything other than a magenta colored\n&gt; \n&gt; &gt; &gt; flower.I listened to kindle set for about 3 hours. I have Bose\n&gt; \n&gt; &gt; &gt; speakers on the computer I used this morning.”\n&gt; \n&gt; &gt; &gt; &gt;\n&gt; \n&gt; &gt; &gt;\n&gt; \n&gt; &gt;\n&gt;"}