{"id": "1347", "subject": "Re: Radio Interview Yesterday on Ghostly Talk...", "author": "psi_research", "timestamp": "2007-06-05T04:47:16Z", "full_text": "Hey Guy, thanks for helping to preserve this important chapter in ITC \nhistory. I&#39;m of the opinion that this early research can help to \ninspire new developments. -Bill\n  \n--- In EVP-ITC@yahoogroups.com, &quot;Frank Sumption&quot; &lt;franks-boxes@...&gt; \nwrote:\n&gt;\n&gt; There seems to be a problem wiht other techs getting my circuits to \nwork as \n&gt; well, although they are getting closer. I think it takes a \ntech/engineer \n&gt; first with an interest in the paranormal to be be even interested \nin \n&gt; building the circuits, then it seems to take a certain amount of \nintuition \n&gt; to get thsi stuff to work. Then, there&#39;s a ever present problem of \nthe \n&gt; researcher actually being able to hear any contacts.\n&gt; \n&gt; Frank\n&gt; \n&gt; \n&gt; &gt;From: &quot;Guy&quot; &lt;yzzzguy@...&gt;\n&gt; &gt;Reply-To: EVP-ITC@yahoogroups.com\n&gt; &gt;To: EVP-ITC@yahoogroups.com\n&gt; &gt;Subject: [EVP-ITC] Radio Interview Yesterday on Ghostly Talk...\n&gt; &gt;Date: Mon, 04 Jun 2007 19:48:35 -0000\n&gt; &gt;\n&gt; &gt;Sorry, all...really late notice by me here. I was interviewed by\n&gt; &gt;Scott and Doug for about an hour yesterday on Ghostly Talk (\n&gt; &gt;http://www.ghostlytalk.com ). The topic? New research I&#39;ve done on\n&gt; &gt;the infamous &quot;Spiricom Mark IV&quot;.\n&gt; &gt;\n&gt; &gt;If you&#39;re familiar with the story - basically I believe I&#39;ve helped\n&gt; &gt;dispel the goofy thought that Dr. George JEFFRIES Mueller did NOT\n&gt; &gt;work for NASA (people have confused him with Dr. George EDWIN\n&gt; &gt;Mueller who DID work for NASA and is considered the &quot;father of\n&gt; &gt;Skylab&quot;, etc.). Plus I was able to disseminate 2 previously unknown\n&gt; &gt;audio recordings (by Dr. David Rivers and the late author Harold\n&gt; &gt;Sherman) which showed inconsistencies in the Spiricom recordings \nand\n&gt; &gt;how O&#39;Neil &quot;could&quot; have used an artificial larynx to fake the\n&gt; &gt;conversations. On the other hand - I tracked down a lot of\n&gt; &gt;documentation which definitely shows that Dr. George J. Mueller was\n&gt; &gt;a real person and nearly everything written about him (in the\n&gt; &gt;Spiricom manual, &quot;The Ghost of 29 Megacycles&quot;) is verifiable so...\n&gt; &gt;\n&gt; &gt;The big questions are:\n&gt; &gt;\n&gt; &gt;1. If this was a hoax - how DID Bill O&#39;Neil get so much detailed\n&gt; &gt;information on Mueller (he actually claimed that Mueller told him\n&gt; &gt;all this via clairaudience)? Was he really an extremely good \npsychic?\n&gt; &gt;\n&gt; &gt;2. If the Spiricom Mark IV really DID work, why were other users\n&gt; &gt;(such as Sarah Estep from the AAEVP) unable to get it operate?\n&gt; &gt;\n&gt; &gt;I still have more things to look into so maybe some more answers\n&gt; &gt;will be forthcoming (or muddy the waters even more). And I want to\n&gt; &gt;thank member Jaime (i.e. xtal32768@...) for finding the\n&gt; &gt;Cornell Alumni News with photo of Mueller at Picatinny Arsenal.\n&gt; &gt;\n&gt; &gt;Guy\n&gt; &gt;\n&gt; \n&gt; _________________________________________________________________\n&gt; Get a preview of Live Earth, the hottest event this summer - only \non MSN \n&gt; http://liveearth.msn.com?source=msntaglineliveearthhm\n&gt;"}