{"id": "13488", "subject": "Re: [EVP-ITC] A solution to no radio stations", "author": "Rj", "timestamp": "2009-03-08T15:05:49Z", "full_text": "--0-624688474-1236524749=:48909\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nThats intriguing Frank.=C2=A0 This sets up several other interesting opport=\r\nunities:\n\n1) Since the input source can be repeated, you can develop repeat=\r\nable tests.=C2=A0 So if you have a 30 minute tape, you can arrange to ask a=\r\n set group of questions.=C2=A0 You can then repeat this test multiple times=\r\n.=C2=A0 Theoretically, if the selections coming through are being influence=\r\nd by the same entity, the results should be statistically similar over seve=\r\nral runs.=C2=A0 If there is no statistical similarity, that would suggest t=\r\nhe selections are random, and not being influenced by any entities.=C2=A0 T=\r\nhis would be a great addition to the test space for these technologies,\n\n2)=\r\n Using this method, perhaps more testing and experiments can now be done in=\r\nside a controlled environment,=C2=A0 like a Faraday cage.=C2=A0 This would =\r\nallow the creation of controlled, repeatable tests, without going out into =\r\nthe sticks.\n\n3) On the downside, this also sets up a potential for abuse, w=\r\nherein a person could seed a tape with the names of people, dates, and othe=\r\nr words thought to be relevant to a given the location of an evp session.=\r\n=C2=A0 The more often these words occur on the tape, even using random sele=\r\nction, the more likely they will be played in response to questions.=C2=A0 =\r\nEven a person who does not intend for this to happen, could still create so=\r\nme stastical issues unless the tape is very carefully controlled to be rand=\r\nom.\n\nIn fact, if you find that this tape approach seems to have utility, th=\r\ne whole idea of selection from radio broadcasts could be replaced by using =\r\nseveral standardized tapes, and a new focus of the evp community would be o=\r\nn this standardization.\n\nRj\n\n=C2=A0cause the most =E2=80=9Cexciting=E2=80=\r\n=9D ones to be selected and played during the EVP session.\n\n--- On Sat, 3/7=\r\n/09, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n\nFrom: Frank Sumption=\r\n &lt;purplealiengirl@...&gt;\nSubject: [EVP-ITC] A solution to no radio stati=\r\nons\nTo: &quot;group&quot; &lt;evp-itc@yahoogroups.com&gt;\nDate: Saturday, March 7, 2009, 8:=\r\n24 PM\n\n\n\n\n\n\n\n\n\n\n\n    \n            \n\n\n=C2=A0I recently ran into the problem =\r\nhere in Colorado where I got kinda roped into ghost hunting. No radio stati=\r\nons so the box function was poor.=C2=A0 So when=C2=A0I got back home this a=\r\nfternoon and added an &quot;aux input&quot; jack, and raw source switch to the box. N=\r\now I can use a pre-recorded raw tape in locations where there&#39;s no radio st=\r\nations to use as the raw audio. &quot;Theoretically&quot; , each use of the raw tape =\r\nshould produce different EVP voices the same as using the same raw audio fi=\r\nle in different sessions of EVPmaker. \n\n=C2=A0\n\n=C2=A0There&#39;s a new device =\r\nI just saw used yesterday, a &quot;geophone&quot;. It&#39;s used like the K-2 metter, but=\r\n seems much more sensitive, and consistent. B.G. Micro supposedly has kits.=\r\n You can&#39;t hand hold the geophone, as it&#39;s extrememly sesnitive to vibratio=\r\nn, so it sits on a stable surface, and yes-no questions are asked of the sp=\r\nirits--after a brief expalnantion of how to manipulate it--same as the K-2.=\r\n \n\n=C2=A0\n\n=C2=A0Frank-S\n\nWindows Live=E2=84=A2 Groups: Create an online sp=\r\not for your favorite groups to meet. Check it out.\n\n \n\n      \n\n    \n    \n\t\n=\r\n\t \n\t\n\t\n\n\n\n\n\n\n\n\n\t\n\n\n\t\n\t\n\n\n      \r\n--0-624688474-1236524749=:48909\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;Thats intriguing Frank.&nbsp; This sets up se=\r\nveral other interesting opportunities:&lt;br&gt;&lt;br&gt;1) Since the input source can=\r\n be repeated, you can develop repeatable tests.&nbsp; So if you have a 30 m=\r\ninute tape, you can arrange to ask a set group of questions.&nbsp; You can =\r\nthen repeat this test multiple times.&nbsp; Theoretically, if the selection=\r\ns coming through are being influenced by the same entity, the results shoul=\r\nd be statistically similar over several runs.&nbsp; If there is no statisti=\r\ncal similarity, that would suggest the selections are random, and not being=\r\n influenced by any entities.&nbsp; This would be a great addition to the te=\r\nst space for these technologies,&lt;br&gt;&lt;br&gt;2) Using this method, perhaps more =\r\ntesting and experiments can now be done inside a controlled environment,&nb=\r\nsp; like a Faraday cage.&nbsp; This would allow the creation of controlled,=\r\n\n repeatable tests, without going out into the sticks.&lt;br&gt;&lt;br&gt;3) On the dow=\r\nnside, this also sets up a potential for abuse, wherein a person could seed=\r\n a tape with the names of people, dates, and other words thought to be rele=\r\nvant to a given the location of an evp session.&nbsp; The more often these =\r\nwords occur on the tape, even using random selection, the more likely they =\r\nwill be played in response to questions.&nbsp; Even a person who does not i=\r\nntend for this to happen, could still create some stastical issues unless t=\r\nhe tape is very carefully controlled to be random.&lt;br&gt;&lt;br&gt;In fact, if you f=\r\nind that this tape approach seems to have utility, the whole idea of select=\r\nion from radio broadcasts could be replaced by using several standardized t=\r\napes, and a new focus of the evp community would be on this standardization=\r\n.&lt;br&gt;&lt;br&gt;Rj&lt;br&gt;&lt;br&gt;&nbsp;cause the most =E2=80=9Cexciting=E2=80=9D ones to =\r\nbe selected and played during the EVP session.&lt;br&gt;&lt;br&gt;--- On &lt;b&gt;Sat, 3/7/09=\r\n,\n Frank Sumption &lt;i&gt;&lt;purplealiengirl@...&gt;&lt;/i&gt;&lt;/b&gt; wrote:&lt;br&gt;&lt;bl=\r\nockquote style=3D&quot;border-left: 2px solid rgb(16, 16, 255); margin-left: 5px=\r\n; padding-left: 5px;&quot;&gt;&lt;br&gt;From: Frank Sumption &lt;purplealiengirl@...=\r\n&gt;&lt;br&gt;Subject: [EVP-ITC] A solution to no radio stations&lt;br&gt;To: &quot;group&quot; &=\r\nlt;evp-itc@yahoogroups.com&gt;&lt;br&gt;Date: Saturday, March 7, 2009, 8:24 PM&lt;br=\r\n&gt;&lt;br&gt;&lt;div id=3D&quot;yiv1135399799&quot;&gt;\n\n\n\n\n\n\n    &lt;div id=3D&quot;ygrp-text&quot;&gt;\n          =\r\n  &lt;p&gt;\n\n\n&nbsp;I recently ran into the problem here in Colorado where I got =\r\nkinda roped into ghost hunting. No radio stations so the box function was p=\r\noor.&nbsp; So when&nbsp;I got back home this afternoon and added an &quot;aux in=\r\nput&quot; jack, and raw source switch to the box. Now I can use a pre-recorded r=\r\naw tape in locations where there&#39;s no radio stations to use as the raw audi=\r\no. &quot;Theoretically&quot; , each use of the raw tape should produce different EVP =\r\nvoices the same as using the same raw audio file in different sessions of E=\r\nVPmaker. &lt;br&gt;\n&nbsp;&lt;br&gt;\n&nbsp;There&#39;s a new device I just saw used yesterd=\r\nay, a &quot;geophone&quot;. It&#39;s used like the K-2 metter, but seems much more sensit=\r\nive, and consistent. B.G. Micro supposedly has kits. You can&#39;t hand hold th=\r\ne geophone, as it&#39;s extrememly sesnitive to vibration, so it sits on a stab=\r\nle surface, and yes-no questions are asked of the spirits--after a brief ex=\r\npalnantion of how to manipulate it--same as the K-2. &lt;br&gt;\n&nbsp;&lt;br&gt;\n&nbsp;=\r\nFrank-S&lt;br&gt;&lt;br&gt;&lt;/p&gt;&lt;hr&gt;Windows Live=E2=84=A2 Groups: Create an online spot =\r\nfor your favorite groups to meet. &lt;a rel=3D&quot;nofollow&quot; target=3D&quot;_blank&quot; hre=\r\nf=3D&quot;http://windowslive.com/online/groups?ocid=3DTXT_TAGLM_WL_groups_032009=\r\n&quot;&gt;Check it out.&lt;/a&gt;\n&lt;p&gt;&lt;/p&gt;\n \n\n    &lt;/div&gt;  \n\n\n\t \n\t\n\t&lt;/div&gt;&lt;/blockquote&gt;&lt;/td=\r\n&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n      \r\n--0-624688474-1236524749=:48909--"}