{"id": "13493", "subject": "Re: Recently modified Radioshack Model 12-469", "author": "itcdeadpeople", "timestamp": "2009-03-13T21:44:09Z", "full_text": "Everybody has their own style of doing a session.  Some like to just turn it on and see what comes through.  Others like to ask general questions.  Some like to see if they can contact someone specific.  \n\nThere&#39;s really no right or wrong way to go about it.  Just approach it in whatever way interests you.  Heck, you can try it all.  Just be sure to record your session so you can go back through and listen to it again.  \n\nI like to record directly into my computer because it saves the step of having to transfer it from a separate recorder into the computer for review.  But if you are away from home, using a handheld recorder is very convenient. Either way works well. \n\nYou should have audio editing software for listening back to the session.  If you don&#39;t have any, you can download something like Audacity.  It&#39;s free.  I&#39;m sure there are other good freeware programs out there too.\n\nIt does take some practice to be able to catch content real-time, and it also takes some practice to be able to hear content during review.  Like most things, it seems the more you work with it, the easier it gets.  It&#39;s a little bit like learning a new language.  It has it&#39;s own unique sound.\n\nThe 469 has a constant click-click-clicking that can be be hard for some to tune out (like myself, so I&#39;ve gone on to other models), but I think it generally produces pretty good results.  \n\nLOL - the first communication that came from my 469 was, &quot;Hey, watch it!&quot;  It was said right after I dropped the little earbuds into the microphone area of my laptop.  I was trying to position them gently and got a little clumsy.  It never ceases to amaze me how much &#39;they&#39; seem to be aware of.\n\nHave fun!\n\nMargaret\n\n--- In EVP-ITC@yahoogroups.com, &quot;soul_reaper111&quot; &lt;soul_reaper111@...&gt; wrote:\n&gt;\n&gt; I recently purchesed a radio and bent the mute clip(without much difficulty). I was wondering if there is any tips for the forst session?\n&gt;"}