{"id": "13524", "subject": "Re: OVILUS", "author": "southgeorgiaparanormal", "timestamp": "2009-03-19T14:35:18Z", "full_text": "i copied this from a site I found: \n\n\nWhen I had first heard of the Ovilus device and what it purported to do, I could not help \nbut laugh out of complete skepticism. I have always doubted claims that such paranormal \ncommunication devices actually work. At best, I thought them to be products of wishful \nthinking and at worst, pure hokum. When I was finally able to test out the Ovilus, I was \nstunned at how well it worked and performed in the field.\n\nThe Ovilus is one of many paranormal field experimental devices created by Bill \nChappell, a retired electronics engineer and the founder of the digitaldowsing.com \nwebsite. He states the device works by measuring changes in the &quot;environmental&quot; \nenergy fields around it. It modulates the energy changes into audible speech using a \nsynthesizer chip, an extensive English word dictionary, and a function that phonetically \nsounds out words. Mr. Chappell calls this process ECM or &quot;Environmental \nCommunications Mode&quot; and states his devices do not employ any arbitrary techniques to \nproduce results such as random generation, sweep functioning, or programmed \nalgorithms.\n\nThe Ovilus is a small, lightweight device that is portable enough to be taken anywhere \nduring an investigation. It is powered by a 9-volt battery and has two audio-out jacks so \nheadphones, external speakers, or audio recorders can be used simultaneously with the \ndevice. The Ovilus also features a bright array of LED lights to graphically display various \nreadings, a feature useful for low light use.\n\nThe device has seven modes of operation. It includes a dictionary mode containing 512 \nstored words, phonetic mode (sounds out words by syllable), a combination mode (both \ndictionary words and phonetics) and a &quot;yes&quot; or &quot;no&quot; mode. It also features an \nelectromagnetic field (EMF) mode that verbally outputs EMF levels in milligauss, a level \nmode that only graphically displays EMF levels, and a dowsing mode that simulates \nvirtual dowsing rods.\n\nI assume at this point, the reader is still fairly skeptical about the effectiveness of such a \ndevice. I was initially doubtful too. However, after working on an investigation with Keith \nAge of the Louisville Ghost Hunters Society (LGHS) who had brought an Ovilus along with \nhim, my skepticism began to wane. I must admit, it took some time to adapt to the \ndevice&#39;s primitive &quot;speak-n-spell&quot; like voice and I found myself initially unimpressed. \nHowever, when it began repeating words relevant to the history and events specific to \nthe location we were investigating, I was shocked! On another floor of the investigation \narea, it performed just as brilliantly stating unique location appropriate words.\n\nAfter that experience, I began to warm up to the device and decided it might be a good fit \nfor our team. We ordered the Ovilus through Bill&#39;s website and gave it a trial run on our \nown investigations. We found the Ovilus very easy to use and it performed so well, we \nadded it to our arsenal of critical research equipment used on every investigation.\n\nFrom our use in the field, we have noted some tips and precautions with these devices. \nThe Ovilus and other communication devices from Bill Chappell and Digital Dowsing may \nattract a range of paranormal activity attempting to communicate. As such, we have \nwitnessed that the devices are capable of generating unexpected and sometimes \ndisturbing speech or text. With this in mind, they should not be used around or by \nchildren, anyone suffering from mental illness or emotional trauma, or around those who \nare easily offended. One must definitely give careful consideration to the use this device \naround clients who may not want or need to know the information being imparted. \nFurthermore, it should be considered that paranormal realms are not always the safest \nand involvement can bring hidden psychological and physical dangers. I always \nrecommend that those who attempt any type of spirit communication should first protect \nthemselves with their own faith or spiritual beliefs.  \n\nUse of this device requires rationalism and common sense. With only 512 dictionary \nwords and 71 phonetic syllables programmed in the Ovilus, some results from the device \ncan be attributed to coincidence and the odds of it saying something contextually correct \nare statistically probable. A good investigator should always collect multiple sources of \nevidence in an investigation that, when combined, may determine if the output of the \ndevice is coincidental or not. Furthermore, researching the history and past events of \nthe locations where the device is being used also aids in validation.\n\nWe feel the Ovilus is a &quot;must have&quot; device of value to any paranormal investigator \ndesiring to gain an edge in researching the paranormal and it appears we may not alone \nin our assessment. Having been featured in several prominent magazines, radio shows \nand movies, Bill Chappell&#39;s devices are gaining the attention of the entire paranormal \ncommunity.\n\nWe have certainly been converted by Mr. Chappell&#39;s visionary inventions. As we gain \nmore experience with the device, we plan on writing a more in-depth review of results \nwe get in the field.  If interested in learning about the Ovilus and his other devices, visit \nBill&#39;s website at www.digitaldowsing.com\n\n 2008 - Gregory Myers, Paranormal Task Force, Inc.\nwww.catchmyghost.com\n\n \n\n\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;William Horton&quot; &lt;bill@...&gt; wrote:\n&gt;\n&gt; Hi\n&gt; \n&gt;  \n&gt; \n&gt; When I looked it up I thought, hmmmm reminds me of the puck \n&gt; \n&gt;  \n&gt; \n&gt; http://www.digitaldowsing.com/Ovilus1.htm \n&gt; \n&gt;  \n&gt; \n&gt; well me and Laurie have talked about something like this, I would like to\n&gt; see a test of it, I guess it is fairly new?\n&gt; \n&gt;  \n&gt; \n&gt;  \n&gt; \n&gt; Thanks!\n&gt; \n&gt;  \n&gt; \n&gt; Bill Horton\n&gt; \n&gt;  &lt;http://www.willyoubelieve.com/&gt; http://www.PFVM.com \n&gt; \n&gt;  &lt;http://www.willyoubelieve.com/&gt; http://www.willyoubelieve.com \n&gt; \n&gt;  &lt;http://www.willyoubelieve.com/&gt; http://www.HauntedTube.com  \n&gt; \n&gt;  \n&gt; \n&gt;  \n&gt; \n&gt;  \n&gt; \n&gt; From: EVP-ITC@yahoogroups.com [mailto:EVP-ITC@yahoogroups.com] On Behalf Of\n&gt; southgeorgiaparanormal\n&gt; Sent: Thursday, March 19, 2009 1:27 AM\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Subject: [EVP-ITC] OVILUS\n&gt; \n&gt;  \n&gt; \n&gt; hey guys, i&#39;ve been thinking about investing in an &quot;OVILUS&quot;. Have any of you\n&gt; used one? can you give me your take on the pros and the cons of this device?\n&gt; thx! \n&gt; SGPI\n&gt;"}