{"id": "13533", "subject": "Re: OVILUS", "author": "southgeorgiaparanormal", "timestamp": "2009-03-19T20:38:07Z", "full_text": "are they hard to hack?\nI am an electrical idiot!  I almost killed myself trying to replace element in hot water heater LOL !quit laughing! LOL\nSGPI\n\n\n\n--- In EVP-ITC@yahoogroups.com, laurie@... wrote:\n&gt;\n&gt; \n&gt; I have the two radio shack models: good old 12-469 and\n&gt; \n&gt; the 20-125 ...\n&gt; \n&gt;  \n&gt; \n&gt; I just hacked the sangean (Thanks Steve!!) and am now going to be working with that as well\n&gt; \n&gt; \n&gt; Laurie\n&gt; -----Original Message-----\n&gt; From: s69e29@...\n&gt; Sent: Thursday, March 19, 2009 1:37pm\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Subject: Re: [EVP-ITC] OVILUS\n&gt; \n&gt; \n&gt; \n&gt; May I ask what kinda radios\n&gt; \n&gt; \n&gt; Sent from my Verizon Wireless BlackBerry\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; From: laurie@...\n&gt; Date: Thu, 19 Mar 2009 12:37:24 -0400 (EDT)\n&gt; To: &lt;EVP-ITC@yahoogroups.com&gt;\n&gt; Subject: Re: [EVP-ITC] OVILUS\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; I do not have an ovilus or a puck - I was going to get one, but I participated in many sessions alternating puck, ovilus, and radio devices.\n&gt; \n&gt;  \n&gt; \n&gt; Although at times we would get relevant responses on the puck and ovilus, more often than not it would be confusing, irrelevant, and disjointed.\n&gt; \n&gt; \n&gt; We would invariably return to the the radios and have much better results, so at this time I have decided to concentrate my efforts on radios and a couple of other methods and areas I am still researching.\n&gt; \n&gt;  \n&gt; \n&gt; I always encourage people to do t heir own research, though. If you want to, go for it!\n&gt; \n&gt; Just let us know what happens.\n&gt; The results I talked about were not meant to discourage you, just to tell you what we experienced. Maybe some people do better with the puck and ovilus. Not everyone is meant to do everything.\n&gt; \n&gt;  \n&gt; \n&gt; Laurie\n&gt; \n&gt; -----Original Message-----\n&gt; From: &quot;Steve Hill&quot; &lt;foreverhaunted57@...&gt;\n&gt; Sent: Thursday, March 19, 2009 11:24am\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Subject: Re: [EVP-ITC] OVILUS\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; I personally have not used this device, but a close friend and fellow investigator just purchased one. She has used it only a few times but the results were encourageing. On her first recorded session, when asking &quot;why are you here&quot;, the reply that she recieved certainly seemed relevant. The Ovilus stated &quot; fell running down stairs, broken neck&quot;. Ano ther interesting response from the recording was in reply to the question &quot;who are you?&quot; The response from the Ovilus was &quot;ghost&quot;. However, she also recieved responses that did not seem relevant to the questions she was asking at the time. She sends me all of her recordings for review so I will keep you posted on the results. Personally, I can&#39;t wait to get my hands on one to try it out for myself.\n&gt; \n&gt;  \n&gt; \n&gt; Steve\n&gt; \n&gt; [http://piedmontparanormalresearch.com/] http://piedmontparanormalresearch.com/\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; From: southgeorgiaparanormal &lt;southgeorgiaparanormal@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Thursday, March 19, 2009 1:27:03 AM\n&gt; Subject: [EVP-ITC] OVILUS\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; hey guys, i&#39;ve been thinking about investing in an &quot;OVILUS&quot;. Have any of you used one? can you give me your take on the pros and the cons of this device? thx! \n&gt; SGPI\n&gt;"}