{"id": "13545", "subject": "Re: Radio Shack&#39;s discontinuing the radios!", "author": "Steve Hultay", "timestamp": "2009-03-22T11:12:06Z", "full_text": "If it helps, i recently modified a Sangean radio that works pretty well with no clicking.  It&#39;s $50 at amazon and has a built in speaker.\n\nHere&#39;s a youtube video of it that i made:\n\nhttp://www.youtube.com/watch?v=TIyF4Iq0sEU&feature=channel_page\n\nHere is a link to the simple hack for the radio, scroll to the bottom:\n\nhttp://www.keyportparanormal.com/simpleghostboxhack.html\n\nHere are some samples of what i&#39;ve been getting with it:\n\nhttp://www.keyportparanormal.com/evps/sangeandt200vxradio.html\n\n\nHope this helps,\n-Steve H.\n\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;itcdeadpeople&quot; &lt;ITCdeadpeople@...&gt; wrote:\n&gt;\n&gt; Hi Earl.  The new version of the 12-469 is the worst of the lot in terms of the clicking which is a bummer because it actually produces some pretty good results.  I think among the Shack units, my favorite is probably the 20-125, but it&#39;s the largest of the group.  Small and easy to use, but requiring a separate speaker like the 469 is the 12-820. (doing these numbers off the top of my head, so I hope I have the prefixes correct) \n&gt; \n&gt; To date, my longest, clearest, most impressive radio sweep results have come from doing a manual sweep using the Duracell KP028 crank flashlight.  The little knob is perfect and it never needs batteries.  :-)  The drawback is you can&#39;t do a long session uninterrupted, but I never do more than a couple minutes at a time anyway, so that doesn&#39;t bother me.  I like to record, review, record, review, etc. rather than doing one long run then going back over it all later because I want to be sure that I am hearing what is being said as I go along.\n&gt; \n&gt; You can google &quot;Duracell Cranklight 3 in 1&quot; and look for the least expensive deal out there if something like this might interest you.  It used to be a bargain on Amazon, but there pricing seems to have doubled since I bought mine.  They come in a twin-pack.  \n&gt; \n&gt; Margaret\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, ParanormalEarl &lt;paranormalearl@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Having a back ground in electronics i&#39;m very interested in finding out \n&gt; &gt; if there is a mod to help get rid of the clicking sound in the 12-469 units.\n&gt; &gt; I have heard what the clicking sounds like and not interested in buying \n&gt; &gt; this unit unless there is a fix for that problem.\n&gt; &gt; so thats why i asked about if there was any fix for the clicking.\n&gt; &gt; \n&gt; &gt; Earl..\n&gt; &gt;\n&gt;"}