{"id": "13549", "subject": "RE: OVILUS", "author": "John S", "timestamp": "2009-03-23T17:06:19Z", "full_text": "--0-741568970-1237827979=:63933\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nI have not personally tested the Ovulus, (sp?) but I do believe that more s=\r\ntatistical analysis is called for. \n\nWhile using an REG as a control device=\r\n initially seems to have merit, in that it is supposedly truly random and c=\r\nould be designed to have statistically the same number of outcomes as the c=\r\nonstrained Ovulus device, we must also recall that research parapsychology =\r\nhas demonstrated in the Global Consciousness Project (GCP) highly suggestiv=\r\ne indications that consciousness can indeed affect REGs. \n\nAt minimum, the =\r\ntotal number of outcomes should be computed=A0to determine the actual degre=\r\ne to which the actual outcomes depart from random chance. This possible dep=\r\narture would be a good first indication that the device is in fact performi=\r\nng in what might appear to be an ordinated way. \n\nOnce that had been establ=\r\nished without consideration to=A0context, it might then be useful to see if=\r\n these departures from randomness could be associated with the context in w=\r\nhich the device is used. Simply focusing on context does not provide, unfor=\r\ntunately, a robust-enough experiment to allow us the luxuory of declaring m=\r\nore than a correlation with the historical context of the site. \n\nFrom a co=\r\nrrelation point of view I would also suggest that=A0one look for extremely =\r\nspecific information and not be prepared to accept as sole evidence very va=\r\ngue statements. Work has been done in this area by Dr. Ian Stevenson late o=\r\nf the University of Virginia in relation to cases suggestive of reincarnati=\r\non. For analysis purposes, Stevenson developed a ten-point scale that rates=\r\n anecdotal statements from general to specific free of context. This scale =\r\nwould be quite useful in this context as well and would segregate informati=\r\non that is truly non-specific, information that is truly specific and most =\r\nimportantly information that seems specific but is in fact general in scope=\r\n. Mentalists and fraudulent psychics use this last class of information fre=\r\nquently to give their audiences the impression they are providing unique in=\r\nformation when in fact that information is far more general than most reali=\r\nze and therefore the probability of a &#39;hit&#39; in strengthened.. \n\nThe same er=\r\nror can find its way into casual interpretation of otherwise probable rando=\r\nm data, such as interpretations of EVP and general anecdotal statements.\n\nJ=\r\nS\n\n\n      \r\n--0-741568970-1237827979=:63933\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;&lt;head&gt;&lt;style type=3D&quot;text/css&quot;&gt;&lt;!-- DIV {margin:0px;} --&gt;&lt;/style&gt;&lt;/he=\r\nad&gt;&lt;body&gt;&lt;div style=3D&quot;font-family:times new roman, new york, times, serif;=\r\nfont-size:12pt&quot;&gt;&lt;DIV&gt;I have not personally tested the Ovulus, (sp?) but I d=\r\no believe that more statistical analysis is called for. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;=\r\n/DIV&gt;\n&lt;DIV&gt;While using an REG as a control device initially seems to have m=\r\nerit, in that it is supposedly truly random and could be designed to have s=\r\ntatistically the same number of outcomes as the constrained Ovulus device, =\r\nwe must also recall that research parapsychology has demonstrated in the Gl=\r\nobal Consciousness Project (GCP) highly suggestive indications that conscio=\r\nusness can indeed affect REGs. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;At minimum, th=\r\ne total number of outcomes should be computed&nbsp;to determine the actual =\r\ndegree to which the actual outcomes depart from random chance. This possibl=\r\ne departure would be a good first indication that the device is in fact per=\r\nforming in what might appear to be an ordinated way. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DI=\r\nV&gt;\n&lt;DIV&gt;Once that had been established without consideration to&nbsp;contex=\r\nt, it might then be useful to see if these departures from randomness could=\r\n be associated with the context in which the device is used. Simply focusin=\r\ng on context does not provide, unfortunately, a robust-enough experiment to=\r\n allow us the luxuory of declaring more than a correlation with the histori=\r\ncal context of the site. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;From a correlation p=\r\noint of view I would also suggest that&nbsp;one look for extremely specific=\r\n information and not be prepared to accept as sole evidence very vague stat=\r\nements. Work has been done in this area by Dr. Ian Stevenson late of the Un=\r\niversity of Virginia in relation to cases suggestive of reincarnation. For =\r\nanalysis purposes, Stevenson developed a ten-point scale that rates anecdot=\r\nal statements from general to specific free of context. This scale would be=\r\n quite useful in this context as well and would segregate information that =\r\nis truly non-specific, information that is truly specific and most importan=\r\ntly information that seems specific but is in fact general in scope. Mental=\r\nists and fraudulent psychics use this last class of information frequently =\r\nto give their audiences the impression they are providing unique informatio=\r\nn when in fact that information is far more general than most realize and t=\r\nherefore the probability of a &#39;hit&#39; in\n strengthened. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/D=\r\nIV&gt;\n&lt;DIV&gt;The same error can find its way into casual interpretation of othe=\r\nrwise probable random data, such as interpretations of EVP and general anec=\r\ndotal statements.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;JS&lt;/DIV&gt;&lt;/div&gt;&lt;br&gt;\n\n      &lt;/=\r\nbody&gt;&lt;/html&gt;\r\n--0-741568970-1237827979=:63933--"}