{"id": "13614", "subject": "Re: Another Newbie", "author": "Barbara Huyser", "timestamp": "2009-04-03T00:24:14Z", "full_text": "Hi Jon,\n\nApril and I have only ever met through the AGS group, so I&#39;ve lacked the opportunity to get led into too much trouble.  I&#39;m up in western Illinois, very near Iowa.  If anyone in the group is going to the AGS conference in Decatur Illinois in June, I&#39;ll be there with a bunch of investigating buddies from Mercer County Paranormal Investigations.\n\nIt&#39;s good to meet you!\n\nBarb\n\n\n--- In EVP-ITC@yahoogroups.com, Jon &lt;jms480@...&gt; wrote:\n&gt;\n&gt; Hi Barbara,\n&gt; \n&gt; Welcome to the group.  I take it you are a friend of April&#39;s.  I hope you have not let her lead you astray...LOL  just kiddin.  I like April a lot.\n&gt; \n&gt;  \n&gt; Regards,\n&gt; Jon in Texas\n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; ________________________________\n&gt; From: Barbara Huyser &lt;barb@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Thursday, April 2, 2009 6:10:10 PM\n&gt; Subject: [EVP-ITC] Another Newbie\n&gt; \n&gt; \n&gt; Hi Frank, Jon, and Everybody Else\n&gt; \n&gt; Thanks for letting me join.  I&#39;m really looking forward to learning more about this approach to capturing EVPs. \n&gt; \n&gt; My visit here started with a discussion over at the American Ghost Society investigators&#39; group with a question about the Ovilus (sp?), which I hadn&#39;t heard of before.  A Yahoo search later and following assorted links, and here I am.\n&gt; \n&gt; I learned about the Frank&#39;s box last year at the AGS conference when Rosemary Ellen Guiley did a presentation about it.  I have the Radio Shack hack as described in Strange Frequencies.  My team has used it on a few occasions, including one where we feel we were getting valid responses through it.  We&#39;ve still got a lot more experimenting to do.\n&gt; \n&gt; One of the things that Rosemary emphasized was that repeated use of a Frank&#39;s box in the same location can result in drawing in shadow people.  Frank, you have indicated that you use yours at home.  Does that mean that this hasn&#39;t been your experience?\n&gt; \n&gt; By the way, I don&#39;t know how you feel about being a celebrity in our little universe, but it is a pleasure to meet you.\n&gt; \n&gt; Hypnobarb\n&gt;"}