{"id": "13639", "subject": "Re: [EVP-ITC] Re: Is pride so wrong!?", "author": "Rj", "timestamp": "2009-04-06T15:39:49Z", "full_text": "--0-1189068870-1239032389=:83326\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nWhoops - couple edits...\n\n\n--- On Mon, 4/6/09, Rj &lt;rasterer@...&gt; wrot=\r\ne:\n\nFrom: Rj &lt;rasterer@...&gt;\nSubject: Re: [EVP-ITC] Re: Is pride so wr=\r\nong!?\nTo: EVP-ITC@yahoogroups.com\nDate: Monday, April 6, 2009, 8:28 AM\n\n\n\n\n=\r\n\n\n\n\n\n\n\n    \n            Frank, I think you are right in that the reason for=\r\n the negativity and sensationalism in these shows is that it sells better.=\r\n=A0 Most people watch these shows for the escape and entertainment value, l=\r\nike the rest of tv.=A0=A0 And these shows learn over time what loses audien=\r\nce (same old claims, boring results, etc), and what draws them back (wild c=\r\nlaims, overall freak value, and &quot;we must protect the children!&quot;).=A0 This i=\r\ns all completely orthodox for tv entertainment, but does NOT lend itself to=\r\n any kind of true research, or any kind of actual edification.\n\nSo I think =\r\nwe can expect these shows will continue to ramp these sorts of elements up =\r\nin order to compete, and we can expect them to dwell less on mundane and ac=\r\ntivity-free situations, and present more claims of evil entities, mysteriou=\r\ns injuries, and unexplainable foul odors, accompanied by\n more frightened i=\r\nnvestigators, trembling sensitives, and humorously gullible associates and =\r\ncustomers, and all wrapped in fancier technology, scarier settings, and sta=\r\nte-o-the- art editing.\n\nAlso: a little humor of the day:=A0=A0 http://comic=\r\ns.com/get_fuzzy/2009-04-06/\n\n\n--- On Sat, 4/4/09, Frank Sumption &lt;purpleali=\r\nengirl@ gmail.com&gt; wrote:\n\nFrom: Frank Sumption &lt;purplealiengirl@ gmail.com=\r\n&gt;\nSubject: Re: [EVP-ITC] Re: Is pride so wrong!?\nTo: EVP-ITC@yahoogroups .c=\r\nom\nDate: Saturday, April 4, 2009, 2:08 PM\n\n\n\n\n\n\n\n\n    \n            Thanks R=\r\nick! You seem to have put alot of thought and time into that. \n=A0\n=A0What =\r\nreally bothers me is the self proclaimed experts out there that take all ev=\r\nidence and experience=A0and try to make it negative, and evil. Maybe many g=\r\net tired, or even affraid of seeking paranormal experience for that reason.=\r\n\n\n=A0\n=A0I don&#39;t do ghost hunts or invesitgations, but the hauntings I&#39;ve h=\r\neard of seem to be nothing more than something trying to get someone&#39;s atte=\r\nntion. It&#39;s these experts that turn it into something that must be negative=\r\n.=A0 There&#39;s Hollywood, such as the &quot;Haunting In CT&quot;, these same experts wi=\r\nll proclaim is based on fact, when the facts are probably nothing more than=\r\n your creaking floors, just=A0to make the whole paranoramal field dark and =\r\ndemon filled. In my case, fear does not sell, I won&#39; watch those movies. \n\n=\r\n=A0\n=A0I think there is good EVP evidence, and I&#39;ve heard many from various=\r\n researchers.=A0 Trouble is, it&#39;s like talking on a phone or radio, how=A0d=\r\no you know who it is other by what they say?\n=A0\n=A0Frank-S\n\nOn Sat, Apr 4,=\r\n 2009 at 2:47 PM, Rick &lt;rasterer@yahoo. com&gt; wrote:\n\n\n\n\n\n\n--- In EVP-ITC@ya=\r\nhoogroups .com, &quot;purplespacefriend&quot; &lt;purplealiengirl@ ...&gt; wrote:\n\n&gt; Just w=\r\nondering, seemed like interest in EVP/ITC was dropping off. Too bad the int=\r\nerest in EVP doesn&#39;t pick up while that ghost hunting mentality drops off. =\r\nI keep saying, you&#39;ll get better, more consistent, and more meaningful mess=\r\nages if you record at home. The ghosts, spirits and entities can and do tra=\r\nvel. You also have to listen to the recordings more than once. \n\n&gt; \n&gt; Frank=\r\n\n\nThat is an interesting observation. I think the core of the issue is that=\r\n there seems to be a `sweet spot&#39; in paranormal beliefs where there is just=\r\n enough science, just enough technical backing, just enough paranormal clai=\r\nms, and just enough indefinite evidence that keeps people interested in the=\r\n ghost hunting mentality\n\n\nEvidence which becomes too indefinite turns off =\r\nmost people. As they become more aware of sensitives who simply make claims=\r\n (&quot;I feel there is a GHOST here!&quot;), but provide no evidence other than stat=\r\nements, people eventually get bored. Similarly, people eventually grow tire=\r\nd of the anthropomorphism of every little occurrence in a house: a creak im=\r\nplies a footstep, which implies a person, which, if not seen, implies a gho=\r\nst. But a creak does not equal a footstep.\n\n\nAnd while this kind of indefin=\r\nite evidence can lose an audience, so can evidence that is claimed to be &quot;o=\r\nbviously&quot; evident by technology. Here, the investigator is no longer making=\r\n vague claims, but waving science around, like FLIR cameras, or EMF meters,=\r\n and then making proclamations of the results. But again, people eventually=\r\n see these are just lights and sounds from electronics, and investigators m=\r\naking more claims. It&#39;s like the psychics again, but with visual aids.\n\n\nI =\r\nthink the reason EVP studies are not securing more interest, as you noted, =\r\nare a little of both effects. First is the anthropomorphism problem: I noti=\r\nce many EVP experimenters proclaim what their results sound like, or name t=\r\nhe sound file by what they&#39;ve heard. But like the creaks, &quot;sounds like&quot; doe=\r\ns not equal &quot;is&quot;. This is then compounded by the technology backing: regard=\r\nless of how valid the EVP researcher&#39;s results are, the technology can seem=\r\n intimidating, but the researchers often proclaim the obviousness of their =\r\nresults. People again become turned off by it because it is not obvious to =\r\nthem, and in the end it is just another piece of technology presenting soun=\r\nds, with no obvious connection to the paranormal, except by the claims and =\r\ninterpretations of the presenters.\n\n\nI believe, taking these issues into ac=\r\ncount, there is a way for EVP studies to garner more interest. For now, the=\r\n analysis coming from the researchers usually seems like a claim, and it is=\r\n these claims, imho, that is being classified by the public with the rest o=\r\nf the paranormal claims, and so, it also becomes less of an interest. A new=\r\n approach could be one without the claims and interpretations of the invest=\r\nigators, one where the sounds are simply played and not labeled. The interp=\r\nretation of the data could be left to the listeners. Web sites which presen=\r\nt EVPs could be developed where people could not see others interpretations=\r\n until they entered their own. I think this would be such a novel approach,=\r\n that it would give the public a better feeling of true involvement in the =\r\nresearch, and feel less like they are simply being exposed to the claims of=\r\n others. And I think that feeling of involvement is what is needed to reign=\r\nited the public interest\n here.\n\n\n\n\n\n\n \n\n      \n\n\n\t \n\t\n\t\n\n\n\n\n      \n \n\n    =\r\n  \n\n    \n    \n\t\n\t \n\t\n\t\n\n\n\n\n\n\n\n\n\t\n\n\n\t\n\t\n\n\n      \r\n--0-1189068870-1239032389=:83326\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;Whoops - couple edits...&lt;br&gt;&lt;br&gt;&lt;br&gt;--- On &lt;b=\r\n&gt;Mon, 4/6/09, Rj &lt;i&gt;&lt;rasterer@...&gt;&lt;/i&gt;&lt;/b&gt; wrote:&lt;br&gt;&lt;blockquot=\r\ne style=3D&quot;border-left: 2px solid rgb(16, 16, 255); margin-left: 5px; paddi=\r\nng-left: 5px;&quot;&gt;&lt;br&gt;From: Rj &lt;rasterer@...&gt;&lt;br&gt;Subject: Re: [EVP=\r\n-ITC] Re: Is pride so wrong!?&lt;br&gt;To: EVP-ITC@yahoogroups.com&lt;br&gt;Date: Monda=\r\ny, April 6, 2009, 8:28 AM&lt;br&gt;&lt;br&gt;&lt;div id=3D&quot;yiv1018755437&quot;&gt;\n\n\n\n\n\n\n    &lt;div =\r\nid=3D&quot;ygrp-text&quot;&gt;\n            &lt;p&gt;&lt;table border=3D&quot;0&quot; cellpadding=3D&quot;0&quot; cell=\r\nspacing=3D&quot;0&quot;&gt;&lt;tbody&gt;&lt;tr&gt;&lt;td style=3D&quot;font-family: inherit; font-style: inh=\r\nerit; font-variant: inherit; font-weight: inherit; font-size: inherit; line=\r\n-height: inherit; font-size-adjust: inherit; font-stretch: ; -x-system-font=\r\n: none;&quot; valign=3D&quot;top&quot;&gt;Frank, I think you are right in that the reason for=\r\n the negativity and sensationalism in these shows is that it sells better.&=\r\nnbsp; Most people watch these shows for the escape and entertainment value,=\r\n like the rest of tv.&nbsp;&nbsp; And these shows learn over time what lose=\r\ns audience (same old claims, boring results, etc), and what draws them back=\r\n (wild claims, overall freak value, and &quot;we must protect the children!&quot;).&n=\r\nbsp; This is all completely orthodox for tv entertainment, but does &lt;span s=\r\ntyle=3D&quot;font-weight: bold;&quot;&gt;NOT&lt;/span&gt; lend itself to any kind of true rese=\r\narch, or any kind of actual edification.&lt;br&gt;&lt;br&gt;So I think we can expect th=\r\nese shows will continue\n to ramp these sorts of elements up in order to com=\r\npete, and we can expect them to dwell less on mundane and activity-free sit=\r\nuations, and present more claims of evil entities, mysterious injuries, and=\r\n unexplainable foul odors, accompanied by\n more frightened investigators, t=\r\nrembling sensitives, and humorously gullible associates and customers, and =\r\nall wrapped in fancier technology, scarier settings, and state-o-the- art e=\r\nditing.&lt;br&gt;&lt;br&gt;Also: a little humor of the day:&nbsp;&nbsp; &lt;span style=3D&quot;=\r\nfont-weight: bold;&quot;&gt;&lt;/span&gt;&lt;a href=3D&quot;http://comics.com/get_fuzzy/2009-04-0=\r\n6/&quot;&gt;http://comics.com/get_fuzzy/2009-04-06/&lt;/a&gt;&lt;br&gt;&lt;br&gt;&lt;br&gt;--- On &lt;b&gt;Sat, 4=\r\n/4/09, Frank Sumption &lt;i&gt;&lt;purplealiengirl@ gmail.com&gt;&lt;/i&gt;&lt;/b&gt; wrote:&lt;=\r\nbr&gt;&lt;blockquote style=3D&quot;border-left: 2px solid rgb(16, 16, 255);&quot;&gt;&lt;br&gt;From:=\r\n Frank Sumption &lt;purplealiengirl@ gmail.com&gt;&lt;br&gt;Subject: Re: [EVP-ITC=\r\n] Re: Is pride so wrong!?&lt;br&gt;To: EVP-ITC@yahoogroups .com&lt;br&gt;Date: Saturday=\r\n, April 4, 2009, 2:08 PM&lt;br&gt;&lt;br&gt;&lt;div id=3D&quot;yiv1389806274&quot;&gt;\n\n\n\n\n\n\n    &lt;div i=\r\nd=3D&quot;ygrp-text&quot;&gt;\n            &lt;p&gt;&lt;/p&gt;&lt;div&gt;Thanks Rick! You seem to have put =\r\nalot of thought and time into that. &lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;Wha=\r\nt really bothers me is the self proclaimed experts out there that take all =\r\nevidence and experience&nbsp;and try to make it negative, and evil. Maybe m=\r\nany get tired, or even affraid of seeking paranormal experience for that re=\r\nason.&lt;/div&gt;\n\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;I don&#39;t do ghost hunts or invesit=\r\ngations, but the hauntings I&#39;ve heard of seem to be nothing more than somet=\r\nhing trying to get someone&#39;s attention. It&#39;s these experts that turn it int=\r\no something that must be negative.&nbsp; There&#39;s Hollywood, such as the &quot;Ha=\r\nunting In CT&quot;, these same experts will proclaim is based on fact, when the =\r\nfacts are probably nothing more than your creaking floors, just&nbsp;to mak=\r\ne the whole paranoramal field dark and demon filled. In my case, fear does =\r\nnot sell, I won&#39; watch those movies. &lt;/div&gt;\n\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;I=\r\n think there is good EVP evidence, and I&#39;ve heard many from various researc=\r\nhers.&nbsp; Trouble is, it&#39;s like talking on a phone or radio, how&nbsp;do =\r\nyou know who it is other by what they say?&lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nb=\r\nsp;Frank-S&lt;br&gt;&lt;/div&gt;\n&lt;div class=3D&quot;gmail_quote&quot;&gt;On Sat, Apr 4, 2009 at 2:47=\r\n PM, Rick &lt;span dir=3D&quot;ltr&quot;&gt;&lt;&lt;a rel=3D&quot;nofollow&quot;&gt;rasterer@yahoo. com&lt;/a&gt;=\r\n&gt;&lt;/span&gt; wrote:&lt;br&gt;\n&lt;blockquote class=3D&quot;gmail_quote&quot; style=3D&quot;border-le=\r\nft: 1px solid rgb(204, 204, 204);&quot;&gt;\n&lt;div style=3D&quot;background-color: rgb(255=\r\n, 255, 255);&quot;&gt;\n&lt;div&gt;\n&lt;div&gt;\n&lt;div&gt;\n&lt;p&gt;--- In &lt;a rel=3D&quot;nofollow&quot;&gt;EVP-ITC@yaho=\r\nogroups .com&lt;/a&gt;, &quot;purplespacefriend&quot; &lt;purplealiengirl@ ...&gt; wrote:&lt;b=\r\nr&gt;&lt;br&gt;&gt; Just wondering, seemed like interest in EVP/ITC was dropping off=\r\n. Too bad the interest in EVP doesn&#39;t pick up while that ghost hunting ment=\r\nality drops off. I keep saying, you&#39;ll get better, more consistent, and mor=\r\ne meaningful messages if you record at home. The ghosts, spirits and entiti=\r\nes can and do travel. You also have to listen to the recordings more than o=\r\nnce. &lt;br&gt;\n&gt; &lt;br&gt;&gt; Frank&lt;br&gt;&lt;br&gt;That is an interesting observation. I =\r\nthink the core of the issue is that there seems to be a `sweet spot&#39; in par=\r\nanormal beliefs where there is just enough science, just enough technical b=\r\nacking, just enough paranormal claims, and just enough indefinite evidence =\r\nthat keeps people interested in the ghost hunting mentality&lt;br&gt;\n&lt;br&gt;Evidenc=\r\ne which becomes too indefinite turns off most people. As they become more a=\r\nware of sensitives who simply make claims (&quot;I feel there is a GHOST here!&quot;)=\r\n, but provide no evidence other than statements, people eventually get bore=\r\nd. Similarly, people eventually grow tired of the anthropomorphism of every=\r\n little occurrence in a house: a creak implies a footstep, which implies a =\r\nperson, which, if not seen, implies a ghost. But a creak does not equal a f=\r\nootstep.&lt;br&gt;\n&lt;br&gt;And while this kind of indefinite evidence can lose an aud=\r\nience, so can evidence that is claimed to be &quot;obviously&quot; evident by technol=\r\nogy. Here, the investigator is no longer making vague claims, but waving sc=\r\nience around, like FLIR cameras, or EMF meters, and then making proclamatio=\r\nns of the results. But again, people eventually see these are just lights a=\r\nnd sounds from electronics, and investigators making more claims. It&#39;s like=\r\n the psychics again, but with visual aids.&lt;br&gt;\n&lt;br&gt;I think the reason EVP s=\r\ntudies are not securing more interest, as you noted, are a little of both e=\r\nffects. First is the anthropomorphism problem: I notice many EVP experiment=\r\ners proclaim what their results sound like, or name the sound file by what =\r\nthey&#39;ve heard. But like the creaks, &quot;sounds like&quot; does not equal &quot;is&quot;. This=\r\n is then compounded by the technology backing: regardless of how valid the =\r\nEVP researcher&#39;s results are, the technology can seem intimidating, but the=\r\n researchers often proclaim the obviousness of their results. People again =\r\nbecome turned off by it because it is not obvious to them, and in the end i=\r\nt is just another piece of technology presenting sounds, with no obvious co=\r\nnnection to the paranormal, except by the claims and interpretations of the=\r\n presenters.&lt;br&gt;\n&lt;br&gt;I believe, taking these issues into account, there is =\r\na way for EVP studies to garner more interest. For now, the analysis coming=\r\n from the researchers usually seems like a claim, and it is these claims, i=\r\nmho, that is being classified by the public with the rest of the paranormal=\r\n claims, and so, it also becomes less of an interest. A new approach could =\r\nbe one without the claims and interpretations of the investigators, one whe=\r\nre the sounds are simply played and not labeled. The interpretation of the =\r\ndata could be left to the listeners. Web sites which present EVPs could be =\r\ndeveloped where people could not see others interpretations until they ente=\r\nred their own. I think this would be such a novel approach, that it would g=\r\nive the public a better feeling of true involvement in the research, and fe=\r\nel less like they are simply being exposed to the claims of others. And I t=\r\nhink that feeling of involvement is what is needed to reignited the public =\r\ninterest\n here.&lt;br&gt;\n&lt;br&gt;&lt;/p&gt;&lt;/div&gt;\n&lt;div style=3D&quot;color: white;&quot;&gt;&lt;/div&gt;&lt;/div=\r\n&gt;&lt;/div&gt;&lt;/div&gt;&lt;/blockquote&gt;&lt;/div&gt;&lt;br&gt;\n\n \n\n    &lt;/div&gt;  \n\n\n\t \n\t\n\t&lt;/div&gt;&lt;/block=\r\nquote&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/tbody&gt;&lt;/table&gt;&lt;br&gt;\n\n\n\n      &lt;/p&gt;\n \n\n    &lt;/div&gt;  \n\n\n\t \n\t\n\t=\r\n&lt;/div&gt;&lt;/blockquote&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n      \r\n--0-1189068870-1239032389=:83326--"}