{"id": "13648", "subject": "Re: [EVP-ITC] Re: Is pride so wrong!?", "author": "Rj", "timestamp": "2009-04-07T17:37:58Z", "full_text": "--0-2081357163-1239125878=:3531\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nIt sounds like a tricky situation, and I&#39;m not sure what to suggest. I supp=\r\nose one route is to, as you suggest, just walk away from all this.=A0 I gue=\r\nss you have to look at the big picture and decide if it&#39;s worth the frustra=\r\ntion, the stress, and the angst, especially what it does to your health.=A0=\r\n Nothing is worth throwing your health away over.=A0 \n\nEven dropping all th=\r\nis, just for a while, might also tell you if any health problems you are ex=\r\nperiencing might be being aggravated by all the drama.=A0 And it might have=\r\n the side effect of letting all the negativity and egos out there burn them=\r\nselves out, so if you do look back into things a while down the road, it co=\r\nuld be a prettier picture then.\n\nOther than a full retreat, I don&#39;t think a=\r\nnything else would make a difference other than a full attack: creating, fo=\r\nr=A0 instance, good objective standards for evaluation and test of the tech=\r\nnology and results, which the shows and &#39;experts&#39; seem to find anathema.=A0=\r\n Then, if their claims were to be confronted by such standards, they&#39;d find=\r\n themselves unable to stand up to them, and eventually, hopefully, be embar=\r\nrassed back into obscurity.\n\n\n\n\n--- On Mon, 4/6/09, Frank Sumption &lt;purplea=\r\nliengirl@...&gt; wrote:\n\nFrom: Frank Sumption &lt;purplealiengirl@...=\r\n&gt;\nSubject: Re: [EVP-ITC] Re: Is pride so wrong!?\nTo: EVP-ITC@...=\r\nm\nDate: Monday, April 6, 2009, 2:40 PM\n\n\n\n\n\n\n\n\n\n\n\n    \n            =A0Yeah,=\r\n it&#39;s for that reason that it&#39;s very tempting to walk away from all things =\r\nparanormal. After dealing with some of these wanna be experts, self proclai=\r\nmed gurus and authors, I&#39;m affraid to even check my e-mail most days. If ya=\r\n disagree with some of these people it quickly degrades into threats of law=\r\nsuits.=A0 I&#39;m at a point if being very reluctant to provides boxes to anyon=\r\ne, especially the experts and profesional type &quot;researchers&quot;--the one&#39;s doi=\r\nng all these stupid shows and readings using my stuff, or similar systems.\n=\r\n\n=A0\n=A0When these dorks makes claims for fear sake such as demons, or shad=\r\now people come through the box, or are attracked by the boxes,=A0 I tend to=\r\n get a bit upset, and yet these people can&#39;t hear a word I&#39;m saying,=A0 \n\nt=\r\nheir huge egos block everything, as if I make this stuff that works but can=\r\n&#39;t possibley know anything about he so called paranormal. \n\n=A0\n=A0Frank-S\n=\r\n\nOn Mon, Apr 6, 2009 at 9:28 AM, Rj &lt;rasterer@yahoo. com&gt; wrote:\n\n\n\n\n\n\n\n\n\n\n=\r\nFrank, I think you are right in that the reason for the negativity and sens=\r\nationalism in these shows is that it sells better.=A0 Most people watch the=\r\nse shows for the escape and entertainment value, like the rest of tv.=A0=A0=\r\n And these shows learn over time what loses audience (same old claims, bori=\r\nng results, etc), and what draws them back (wild claims, overall freak valu=\r\ne, and &quot;we must protect the children!&quot;).=A0 This is all completely orthodox=\r\n for tv entertainment, but does lend itself to any kind of true research, o=\r\nr any kind of actual edification.\n\n\nSo I think we can expect these shows wi=\r\nll continue to ramp these sorts of elements up in order to compete, and we =\r\ncan expect them to dwell less on mundane and activity-free situations, and =\r\npresent more claims of evil entities, mysterious injuries, and unexplainabl=\r\ne foul odors, accompanied by more frightened investigators, trembling sensi=\r\ntives, and humorously gullible associates and customers, and all wrapped in=\r\n fancier technology, scarier settings, and state-o-the- art editing.\n\n\nAlso=\r\n: a little humor of the day:=A0=A0 http://comics. com/get_fuzzy/ 2009-04-06=\r\n/\n\n\n\n--- On Sat, 4/4/09, Frank Sumption &lt;purplealiengirl@ gmail.com&gt; wrote:=\r\n\n\n\n\nFrom: Frank Sumption &lt;purplealiengirl@ gmail.com&gt;\nSubject: Re: [EVP-ITC=\r\n] Re: Is pride so wrong!?\n\nTo: EVP-ITC@yahoogroups .com\nDate: Saturday, Apr=\r\nil 4, 2009, 2:08 PM\n\n\n\n\n\n\nThanks Rick! You seem to have put alot of thought=\r\n and time into that. \n=A0\n=A0What really bothers me is the self proclaimed =\r\nexperts out there that take all evidence and experience=A0and try to make i=\r\nt negative, and evil. Maybe many get tired, or even affraid of seeking para=\r\nnormal experience for that reason.\n\n=A0\n=A0I don&#39;t do ghost hunts or invesi=\r\ntgations, but the hauntings I&#39;ve heard of seem to be nothing more than some=\r\nthing trying to get someone&#39;s attention. It&#39;s these experts that turn it in=\r\nto something that must be negative.=A0 There&#39;s Hollywood, such as the &quot;Haun=\r\nting In CT&quot;, these same experts will proclaim is based on fact, when the fa=\r\ncts are probably nothing more than your creaking floors, just=A0to make the=\r\n whole paranoramal field dark and demon filled. In my case, fear does not s=\r\nell, I won&#39; watch those movies. \n\n=A0\n=A0I think there is good EVP evidence=\r\n, and I&#39;ve heard many from various researchers.=A0 Trouble is, it&#39;s like ta=\r\nlking on a phone or radio, how=A0do you know who it is other by what they s=\r\nay?\n=A0\n=A0Frank-S\n\n\nOn Sat, Apr 4, 2009 at 2:47 PM, Rick &lt;rasterer@yahoo. =\r\ncom&gt; wrote:\n\n\n\n\n\n\n--- In EVP-ITC@yahoogroups .com, &quot;purplespacefriend&quot; &lt;pur=\r\nplealiengirl@ ...&gt; wrote:\n\n&gt; Just wondering, seemed like interest in EVP/IT=\r\nC was dropping off. Too bad the interest in EVP doesn&#39;t pick up while that =\r\nghost hunting mentality drops off. I keep saying, you&#39;ll get better, more c=\r\nonsistent, and more meaningful messages if you record at home. The ghosts, =\r\nspirits and entities can and do travel. You also have to listen to the reco=\r\nrdings more than once. \n\n&gt; \n&gt; Frank\n\nThat is an interesting observation. I =\r\nthink the core of the issue is that there seems to be a `sweet spot&#39; in par=\r\nanormal beliefs where there is just enough science, just enough technical b=\r\nacking, just enough paranormal claims, and just enough indefinite evidence =\r\nthat keeps people interested in the ghost hunting mentality\n\n\nEvidence whic=\r\nh becomes too indefinite turns off most people. As they become more aware o=\r\nf sensitives who simply make claims (&quot;I feel there is a GHOST here!&quot;), but =\r\nprovide no evidence other than statements, people eventually get bored. Sim=\r\nilarly, people eventually grow tired of the anthropomorphism of every littl=\r\ne occurrence in a house: a creak implies a footstep, which implies a person=\r\n, which, if not seen, implies a ghost. But a creak does not equal a footste=\r\np.\n\n\nAnd while this kind of indefinite evidence can lose an audience, so ca=\r\nn evidence that is claimed to be &quot;obviously&quot; evident by technology. Here, t=\r\nhe investigator is no longer making vague claims, but waving science around=\r\n, like FLIR cameras, or EMF meters, and then making proclamations of the re=\r\nsults. But again, people eventually see these are just lights and sounds fr=\r\nom electronics, and investigators making more claims. It&#39;s like the psychic=\r\ns again, but with visual aids.\n\n\nI think the reason EVP studies are not sec=\r\nuring more interest, as you noted, are a little of both effects. First is t=\r\nhe anthropomorphism problem: I notice many EVP experimenters proclaim what =\r\ntheir results sound like, or name the sound file by what they&#39;ve heard. But=\r\n like the creaks, &quot;sounds like&quot; does not equal &quot;is&quot;. This is then compounde=\r\nd by the technology backing: regardless of how valid the EVP researcher&#39;s r=\r\nesults are, the technology can seem intimidating, but the researchers often=\r\n proclaim the obviousness of their results. People again become turned off =\r\nby it because it is not obvious to them, and in the end it is just another =\r\npiece of technology presenting sounds, with no obvious connection to the pa=\r\nranormal, except by the claims and interpretations of the presenters.\n\n\nI b=\r\nelieve, taking these issues into account, there is a way for EVP studies to=\r\n garner more interest. For now, the analysis coming from the researchers us=\r\nually seems like a claim, and it is these claims, imho, that is being class=\r\nified by the public with the rest of the paranormal claims, and so, it also=\r\n becomes less of an interest. A new approach could be one without the claim=\r\ns and interpretations of the investigators, one where the sounds are simply=\r\n played and not labeled. The interpretation of the data could be left to th=\r\ne listeners. Web sites which present EVPs could be developed where people c=\r\nould not see others interpretations until they entered their own. I think t=\r\nhis would be such a novel approach, that it would give the public a better =\r\nfeeling of true involvement in the research, and feel less like they are si=\r\nmply being exposed to the claims of others. And I think that feeling of inv=\r\nolvement is what is needed to reignited the public interest here.\n\n\n\n\n\n\n\n\n\n=\r\n \n\n      \n\n    \n    \n\t\n\t \n\t\n\t\n\n\n\n\n\n\n\n\n\t\n\n\n\t\n\t\n\n\n      \r\n--0-2081357163-1239125878=:3531\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;It sounds like a tricky situation, and I&#39;m no=\r\nt sure what to suggest. I suppose one route is to, as you suggest, just wal=\r\nk away from all this.&nbsp; I guess you have to look at the big picture and=\r\n decide if it&#39;s worth the frustration, the stress, and the angst, especiall=\r\ny what it does to your health.&nbsp; Nothing is worth throwing your health =\r\naway over.&nbsp; &lt;br&gt;&lt;br&gt;Even dropping all this, just for a while, might al=\r\nso tell you if any health problems you are experiencing might be being aggr=\r\navated by all the drama.&nbsp; And it might have the side effect of letting=\r\n all the negativity and egos out there burn themselves out, so if you do lo=\r\nok back into things a while down the road, it could be a prettier picture t=\r\nhen.&lt;br&gt;&lt;br&gt;Other than a full retreat, I don&#39;t think anything else would ma=\r\nke a difference other than a full attack: creating, for&nbsp; instance, goo=\r\nd\n objective standards for evaluation and test of the technology and result=\r\ns, which the shows and &#39;experts&#39; seem to find anathema.&nbsp; Then, if thei=\r\nr claims were to be confronted by such standards, they&#39;d find themselves un=\r\nable to stand up to them, and eventually, hopefully, be embarrassed back in=\r\nto obscurity.&lt;br&gt;&lt;br&gt;&lt;br&gt;&lt;br&gt;&lt;br&gt;--- On &lt;b&gt;Mon, 4/6/09, Frank Sumption &lt;i&gt;&=\r\nlt;purplealiengirl@...&gt;&lt;/i&gt;&lt;/b&gt; wrote:&lt;br&gt;&lt;blockquote style=3D&quot;bor=\r\nder-left: 2px solid rgb(16, 16, 255); margin-left: 5px; padding-left: 5px;&quot;=\r\n&gt;&lt;br&gt;From: Frank Sumption &lt;purplealiengirl@...&gt;&lt;br&gt;Subject: Re:=\r\n [EVP-ITC] Re: Is pride so wrong!?&lt;br&gt;To: EVP-ITC@yahoogroups.com&lt;br&gt;Date: =\r\nMonday, April 6, 2009, 2:40 PM&lt;br&gt;&lt;br&gt;&lt;div id=3D&quot;yiv1739498024&quot;&gt;\n\n\n\n\n\n\n    =\r\n&lt;div id=3D&quot;ygrp-text&quot;&gt;\n            &lt;p&gt;&lt;/p&gt;&lt;div&gt;&nbsp;Yeah, it&#39;s for that re=\r\nason that it&#39;s very tempting to walk away from all things paranormal. After=\r\n dealing with some of these wanna be experts, self proclaimed gurus and aut=\r\nhors, I&#39;m affraid to even check my e-mail most days. If ya disagree with so=\r\nme of these people it quickly degrades into threats of lawsuits.&nbsp; I&#39;m =\r\nat a point if being very reluctant to provides boxes to anyone, especially =\r\nthe experts and profesional type &quot;researchers&quot;--the one&#39;s doing all these s=\r\ntupid shows and readings using my stuff, or similar systems.&lt;/div&gt;\n\n&lt;div&gt;&n=\r\nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;When these dorks makes claims for fear sake such as d=\r\nemons, or shadow people come through the box, or are attracked by the boxes=\r\n,&nbsp; I tend to get a bit upset, and yet these people can&#39;t hear a word I=\r\n&#39;m saying,&nbsp; &lt;br&gt;\ntheir huge egos block everything, as if I make this s=\r\ntuff that works but can&#39;t possibley know anything about he so called parano=\r\nrmal. &lt;br&gt;&lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;Frank-S&lt;br&gt;&lt;/div&gt;\n&lt;div class=\r\n=3D&quot;gmail_quote&quot;&gt;On Mon, Apr 6, 2009 at 9:28 AM, Rj &lt;span dir=3D&quot;ltr&quot;&gt;&lt;&lt;=\r\na rel=3D&quot;nofollow&quot; ymailto=3D&quot;mailto:rasterer@...&quot; target=3D&quot;_blank&quot; =\r\nhref=3D&quot;/mc/compose?to=3Drasterer@...&quot;&gt;rasterer@yahoo. com&lt;/a&gt;&gt;&lt;/s=\r\npan&gt; wrote:&lt;br&gt;\n&lt;blockquote class=3D&quot;gmail_quote&quot; style=3D&quot;border-left: 1px=\r\n solid rgb(204, 204, 204);&quot;&gt;\n&lt;div style=3D&quot;background-color: rgb(255, 255, =\r\n255);&quot;&gt;\n&lt;div&gt;\n&lt;div&gt;\n&lt;div&gt;\n&lt;p&gt;\n&lt;table border=3D&quot;0&quot; cellpadding=3D&quot;0&quot; cellspa=\r\ncing=3D&quot;0&quot;&gt;\n&lt;tbody&gt;\n&lt;tr&gt;\n&lt;td valign=3D&quot;top&quot;&gt;Frank, I think you are right in=\r\n that the reason for the negativity and sensationalism in these shows is th=\r\nat it sells better.&nbsp; Most people watch these shows for the escape and =\r\nentertainment value, like the rest of tv.&nbsp;&nbsp; And these shows learn=\r\n over time what loses audience (same old claims, boring results, etc), and =\r\nwhat draws them back (wild claims, overall freak value, and &quot;we must protec=\r\nt the children!&quot;).&nbsp; This is all completely orthodox for tv entertainme=\r\nnt, but does lend itself to any kind of true research, or any kind of actua=\r\nl edification.&lt;br&gt;\n&lt;br&gt;So I think we can expect these shows will continue t=\r\no ramp these sorts of elements up in order to compete, and we can expect th=\r\nem to dwell less on mundane and activity-free situations, and present more =\r\nclaims of evil entities, mysterious injuries, and unexplainable foul odors,=\r\n accompanied by more frightened investigators, trembling sensitives, and hu=\r\nmorously gullible associates and customers, and all wrapped in fancier tech=\r\nnology, scarier settings, and state-o-the- art editing.&lt;br&gt;\n&lt;br&gt;Also: a lit=\r\ntle humor of the day:&nbsp;&nbsp; &lt;a rel=3D&quot;nofollow&quot; target=3D&quot;_blank&quot; hre=\r\nf=3D&quot;http://comics.com/get_fuzzy/2009-04-06/&quot;&gt;http://comics. com/get_fuzzy/=\r\n 2009-04-06/&lt;/a&gt;&lt;br&gt;&lt;br&gt;&lt;br&gt;&lt;br&gt;--- On &lt;b&gt;Sat, 4/4/09, Frank Sumption &lt;i&gt;&l=\r\nt;&lt;a rel=3D&quot;nofollow&quot; ymailto=3D&quot;mailto:purplealiengirl@...&quot; target=\r\n=3D&quot;_blank&quot; href=3D&quot;/mc/compose?to=3Dpurplealiengirl@...&quot;&gt;purplealien=\r\ngirl@ gmail.com&lt;/a&gt;&gt;&lt;/i&gt;&lt;/b&gt; wrote:&lt;br&gt;\n\n&lt;blockquote style=3D&quot;border-lef=\r\nt: 2px solid rgb(16, 16, 255);&quot;&gt;&lt;br&gt;From: Frank Sumption &lt;&lt;a rel=3D&quot;nofo=\r\nllow&quot; ymailto=3D&quot;mailto:purplealiengirl@...&quot; target=3D&quot;_blank&quot; href=\r\n=3D&quot;/mc/compose?to=3Dpurplealiengirl@...&quot;&gt;purplealiengirl@ gmail.com&lt;=\r\n/a&gt;&gt;&lt;br&gt;Subject: Re: [EVP-ITC] Re: Is pride so wrong!?&lt;br&gt;\nTo: &lt;a rel=3D=\r\n&quot;nofollow&quot; ymailto=3D&quot;mailto:EVP-ITC@yahoogroups.com&quot; target=3D&quot;_blank&quot; hre=\r\nf=3D&quot;/mc/compose?to=3DEVP-ITC@yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups .com&lt;/a&gt;=\r\n&lt;br&gt;Date: Saturday, April 4, 2009, 2:08 PM&lt;br&gt;&lt;br&gt;\n&lt;div&gt;\n&lt;div&gt;\n&lt;div class=\r\n=3D&quot;im&quot;&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;div&gt;Thanks Rick! You seem to have put alot of thought and=\r\n time into that. &lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;What really bothers me=\r\n is the self proclaimed experts out there that take all evidence and experi=\r\nence&nbsp;and try to make it negative, and evil. Maybe many get tired, or e=\r\nven affraid of seeking paranormal experience for that reason.&lt;/div&gt;\n\n&lt;div&gt;&=\r\nnbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;I don&#39;t do ghost hunts or invesitgations, but the ha=\r\nuntings I&#39;ve heard of seem to be nothing more than something trying to get =\r\nsomeone&#39;s attention. It&#39;s these experts that turn it into something that mu=\r\nst be negative.&nbsp; There&#39;s Hollywood, such as the &quot;Haunting In CT&quot;, thes=\r\ne same experts will proclaim is based on fact, when the facts are probably =\r\nnothing more than your creaking floors, just&nbsp;to make the whole paranor=\r\namal field dark and demon filled. In my case, fear does not sell, I won&#39; wa=\r\ntch those movies. &lt;/div&gt;\n\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;I think there is goo=\r\nd EVP evidence, and I&#39;ve heard many from various researchers.&nbsp; Trouble=\r\n is, it&#39;s like talking on a phone or radio, how&nbsp;do you know who it is =\r\nother by what they say?&lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;&lt;/div&gt;\n&lt;div&gt;&nbsp;Frank-S&lt;br=\r\n&gt;&lt;/div&gt;\n&lt;div class=3D&quot;im&quot;&gt;\n&lt;div class=3D&quot;gmail_quote&quot;&gt;On Sat, Apr 4, 2009 a=\r\nt 2:47 PM, Rick &lt;span dir=3D&quot;ltr&quot;&gt;&lt;&lt;a rel=3D&quot;nofollow&quot; target=3D&quot;_blank&quot;=\r\n href=3D&quot;http://mc/compose?to=3Drasterer@...&quot;&gt;rasterer@yahoo. com&lt;/a&gt;=\r\n&gt;&lt;/span&gt; wrote:&lt;br&gt;\n&lt;blockquote class=3D&quot;gmail_quote&quot; style=3D&quot;border-le=\r\nft: 1px solid rgb(204, 204, 204);&quot;&gt;\n&lt;div style=3D&quot;background-color: rgb(255=\r\n, 255, 255);&quot;&gt;\n&lt;div&gt;\n&lt;div&gt;\n&lt;div&gt;\n&lt;p&gt;--- In &lt;a rel=3D&quot;nofollow&quot; target=3D&quot;_b=\r\nlank&quot; href=3D&quot;http://mc/compose?to=3DEVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yah=\r\noogroups .com&lt;/a&gt;, &quot;purplespacefriend&quot; &lt;purplealiengirl@ ...&gt; wrote:&lt;=\r\nbr&gt;&lt;br&gt;&gt; Just wondering, seemed like interest in EVP/ITC was dropping of=\r\nf. Too bad the interest in EVP doesn&#39;t pick up while that ghost hunting men=\r\ntality drops off. I keep saying, you&#39;ll get better, more consistent, and mo=\r\nre meaningful messages if you record at home. The ghosts, spirits and entit=\r\nies can and do travel. You also have to listen to the recordings more than =\r\nonce. &lt;br&gt;\n&gt; &lt;br&gt;&gt; Frank&lt;br&gt;&lt;br&gt;That is an interesting observation. I=\r\n think the core of the issue is that there seems to be a `sweet spot&#39; in pa=\r\nranormal beliefs where there is just enough science, just enough technical =\r\nbacking, just enough paranormal claims, and just enough indefinite evidence=\r\n that keeps people interested in the ghost hunting mentality&lt;br&gt;\n&lt;br&gt;Eviden=\r\nce which becomes too indefinite turns off most people. As they become more =\r\naware of sensitives who simply make claims (&quot;I feel there is a GHOST here!&quot;=\r\n), but provide no evidence other than statements, people eventually get bor=\r\ned. Similarly, people eventually grow tired of the anthropomorphism of ever=\r\ny little occurrence in a house: a creak implies a footstep, which implies a=\r\n person, which, if not seen, implies a ghost. But a creak does not equal a =\r\nfootstep.&lt;br&gt;\n&lt;br&gt;And while this kind of indefinite evidence can lose an au=\r\ndience, so can evidence that is claimed to be &quot;obviously&quot; evident by techno=\r\nlogy. Here, the investigator is no longer making vague claims, but waving s=\r\ncience around, like FLIR cameras, or EMF meters, and then making proclamati=\r\nons of the results. But again, people eventually see these are just lights =\r\nand sounds from electronics, and investigators making more claims. It&#39;s lik=\r\ne the psychics again, but with visual aids.&lt;br&gt;\n&lt;br&gt;I think the reason EVP =\r\nstudies are not securing more interest, as you noted, are a little of both =\r\neffects. First is the anthropomorphism problem: I notice many EVP experimen=\r\nters proclaim what their results sound like, or name the sound file by what=\r\n they&#39;ve heard. But like the creaks, &quot;sounds like&quot; does not equal &quot;is&quot;. Thi=\r\ns is then compounded by the technology backing: regardless of how valid the=\r\n EVP researcher&#39;s results are, the technology can seem intimidating, but th=\r\ne researchers often proclaim the obviousness of their results. People again=\r\n become turned off by it because it is not obvious to them, and in the end =\r\nit is just another piece of technology presenting sounds, with no obvious c=\r\nonnection to the paranormal, except by the claims and interpretations of th=\r\ne presenters.&lt;br&gt;\n&lt;br&gt;I believe, taking these issues into account, there is=\r\n a way for EVP studies to garner more interest. For now, the analysis comin=\r\ng from the researchers usually seems like a claim, and it is these claims, =\r\nimho, that is being classified by the public with the rest of the paranorma=\r\nl claims, and so, it also becomes less of an interest. A new approach could=\r\n be one without the claims and interpretations of the investigators, one wh=\r\nere the sounds are simply played and not labeled. The interpretation of the=\r\n data could be left to the listeners. Web sites which present EVPs could be=\r\n developed where people could not see others interpretations until they ent=\r\nered their own. I think this would be such a novel approach, that it would =\r\ngive the public a better feeling of true involvement in the research, and f=\r\neel less like they are simply being exposed to the claims of others. And I =\r\nthink that feeling of involvement is what is needed to reignited the public=\r\n interest\n here.&lt;br&gt;\n&lt;br&gt;&lt;/p&gt;&lt;/div&gt;\n&lt;div style=3D&quot;color: white;&quot;&gt;&lt;/div&gt;&lt;/di=\r\nv&gt;&lt;/div&gt;&lt;/div&gt;&lt;/blockquote&gt;&lt;/div&gt;&lt;br&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/blockquote&gt;&lt;/td&gt;&lt;/=\r\ntr&gt;&lt;/tbody&gt;&lt;/table&gt;&lt;br&gt;&lt;/p&gt;&lt;/div&gt;\n&lt;div style=3D&quot;color: white;&quot;&gt;&lt;/div&gt;&lt;/div&gt;=\r\n&lt;/div&gt;&lt;/div&gt;&lt;/blockquote&gt;&lt;/div&gt;&lt;br&gt;\n\n \n\n    &lt;/div&gt;  \n\n\n\t \n\t\n\t&lt;/div&gt;&lt;/blockq=\r\nuote&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n      \r\n--0-2081357163-1239125878=:3531--"}