{"id": "13650", "subject": "Re: [EVP-ITC] Re: Is pride so wrong!?", "author": "April Abercrombie", "timestamp": "2009-04-07T18:18:43Z", "full_text": "------=_NextPart_000_00FD_01C9B77A.FDFC6700\r\nContent-Type: text/plain;\n\tcharset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nMy thing is I am in it for my self only. I care not what other people think=\r\n about me or my methods. I stay out of all the back stabbing gossip and do =\r\nmy thing. I don&#39;t trash talk other teams, and I don&#39;t listen to them trash =\r\ntalk anyone else.\n\nFrank should just do his thing and ignore the bull. He s=\r\nhouldn&#39;t let it bother him so much. In this field, nothing has been proven,=\r\n so therefore there is no right or wrong. He should do it to please himself=\r\n only.\n\nApril\n\n  ----- Original Message ----- \n  From: Rj \n  To: EVP-ITC@ya=\r\nhoogroups.com \n  Sent: Tuesday, April 07, 2009 11:37 AM\n  Subject: Re: [EVP=\r\n-ITC] Re: Is pride so wrong!?\n\n\n        It sounds like a tricky situation, =\r\nand I&#39;m not sure what to suggest. I suppose one route is to, as you suggest=\r\n, just walk away from all this.  I guess you have to look at the big pictur=\r\ne and decide if it&#39;s worth the frustration, the stress, and the angst, espe=\r\ncially what it does to your health.  Nothing is worth throwing your health =\r\naway over.  \n\n        Even dropping all this, just for a while, might also =\r\ntell you if any health problems you are experiencing might be being aggrava=\r\nted by all the drama.  And it might have the side effect of letting all the=\r\n negativity and egos out there burn themselves out, so if you do look back =\r\ninto things a while down the road, it could be a prettier picture then.\n\n  =\r\n      Other than a full retreat, I don&#39;t think anything else would make a d=\r\nifference other than a full attack: creating, for  instance, good objective=\r\n standards for evaluation and test of the technology and results, which the=\r\n shows and &#39;experts&#39; seem to find anathema.  Then, if their claims were to =\r\nbe confronted by such standards, they&#39;d find themselves unable to stand up =\r\nto them, and eventually, hopefully, be embarrassed back into obscurity.\n\n\n\n=\r\n\n        --- On Mon, 4/6/09, Frank Sumption &lt;purplealiengirl@...&gt; wro=\r\nte:\n\n\n          From: Frank Sumption &lt;purplealiengirl@...&gt;\n          =\r\nSubject: Re: [EVP-ITC] Re: Is pride so wrong!?\n          To: EVP-ITC@yahoog=\r\nroups.com\n          Date: Monday, April 6, 2009, 2:40 PM\n\n\n\n           Yeah=\r\n, it&#39;s for that reason that it&#39;s very tempting to walk away from all things=\r\n paranormal. After dealing with some of these wanna be experts, self procla=\r\nimed gurus and authors, I&#39;m affraid to even check my e-mail most days. If y=\r\na disagree with some of these people it quickly degrades into threats of la=\r\nwsuits.  I&#39;m at a point if being very reluctant to provides boxes to anyone=\r\n, especially the experts and profesional type &quot;researchers&quot;--the one&#39;s doin=\r\ng all these stupid shows and readings using my stuff, or similar systems.\n\n=\r\n           When these dorks makes claims for fear sake such as demons, or s=\r\nhadow people come through the box, or are attracked by the boxes,  I tend t=\r\no get a bit upset, and yet these people can&#39;t hear a word I&#39;m saying,  \n   =\r\n       their huge egos block everything, as if I make this stuff that works=\r\n but can&#39;t possibley know anything about he so called paranormal. \n\n\n      =\r\n     Frank-S\n\n          On Mon, Apr 6, 2009 at 9:28 AM, Rj &lt;rasterer@yahoo.=\r\n com&gt; wrote:\n\n                  Frank, I think you are right in that the re=\r\nason for the negativity and sensationalism in these shows is that it sells =\r\nbetter.  Most people watch these shows for the escape and entertainment val=\r\nue, like the rest of tv.   And these shows learn over time what loses audie=\r\nnce (same old claims, boring results, etc), and what draws them back (wild =\r\nclaims, overall freak value, and &quot;we must protect the children!&quot;).  This is=\r\n all completely orthodox for tv entertainment, but does lend itself to any =\r\nkind of true research, or any kind of actual edification.\n\n                =\r\n  So I think we can expect these shows will continue to ramp these sorts of=\r\n elements up in order to compete, and we can expect them to dwell less on m=\r\nundane and activity-free situations, and present more claims of evil entiti=\r\nes, mysterious injuries, and unexplainable foul odors, accompanied by more =\r\nfrightened investigators, trembling sensitives, and humorously gullible ass=\r\nociates and customers, and all wrapped in fancier technology, scarier setti=\r\nngs, and state-o-the- art editing.\n\n                  Also: a little humor =\r\nof the day:   http://comics. com/get_fuzzy/ 2009-04-06/\n\n\n\n                =\r\n  --- On Sat, 4/4/09, Frank Sumption &lt;purplealiengirl@ gmail.com&gt; wrote:\n\n\n=\r\n                    From: Frank Sumption &lt;purplealiengirl@ gmail.com&gt;\n     =\r\n               Subject: Re: [EVP-ITC] Re: Is pride so wrong!?\n             =\r\n       To: EVP-ITC@yahoogroups .com\n                    Date: Saturday, Apr=\r\nil 4, 2009, 2:08 PM\n\n\n\n                    Thanks Rick! You seem to have pu=\r\nt alot of thought and time into that. \n\n                     What really bo=\r\nthers me is the self proclaimed experts out there that take all evidence an=\r\nd experience and try to make it negative, and evil. Maybe many get tired, o=\r\nr even affraid of seeking paranormal experience for that reason.\n\n         =\r\n            I don&#39;t do ghost hunts or invesitgations, but the hauntings I&#39;v=\r\ne heard of seem to be nothing more than something trying to get someone&#39;s a=\r\nttention. It&#39;s these experts that turn it into something that must be negat=\r\nive.  There&#39;s Hollywood, such as the &quot;Haunting In CT&quot;, these same experts w=\r\nill proclaim is based on fact, when the facts are probably nothing more tha=\r\nn your creaking floors, just to make the whole paranoramal field dark and d=\r\nemon filled. In my case, fear does not sell, I won&#39; watch those movies. \n\n =\r\n                    I think there is good EVP evidence, and I&#39;ve heard many=\r\n from various researchers.  Trouble is, it&#39;s like talking on a phone or rad=\r\nio, how do you know who it is other by what they say?\n\n                    =\r\n Frank-S\n\n                    On Sat, Apr 4, 2009 at 2:47 PM, Rick &lt;rastere=\r\nr@yahoo. com&gt; wrote:\n\n                      --- In EVP-ITC@yahoogroups .com=\r\n, &quot;purplespacefriend&quot; &lt;purplealiengirl@ ...&gt; wrote:\n\n                      =\r\n&gt; Just wondering, seemed like interest in EVP/ITC was dropping off. Too bad=\r\n the interest in EVP doesn&#39;t pick up while that ghost hunting mentality dro=\r\nps off. I keep saying, you&#39;ll get better, more consistent, and more meaning=\r\nful messages if you record at home. The ghosts, spirits and entities can an=\r\nd do travel. You also have to listen to the recordings more than once. \n   =\r\n                   &gt; \n                      &gt; Frank\n\n                      =\r\nThat is an interesting observation. I think the core of the issue is that t=\r\nhere seems to be a `sweet spot&#39; in paranormal beliefs where there is just e=\r\nnough science, just enough technical backing, just enough paranormal claims=\r\n, and just enough indefinite evidence that keeps people interested in the g=\r\nhost hunting mentality\n\n                      Evidence which becomes too in=\r\ndefinite turns off most people. As they become more aware of sensitives who=\r\n simply make claims (&quot;I feel there is a GHOST here!&quot;), but provide no evide=\r\nnce other than statements, people eventually get bored. Similarly, people e=\r\nventually grow tired of the anthropomorphism of every little occurrence in =\r\na house: a creak implies a footstep, which implies a person, which, if not =\r\nseen, implies a ghost. But a creak does not equal a footstep.\n\n            =\r\n          And while this kind of indefinite evidence can lose an audience, =\r\nso can evidence that is claimed to be &quot;obviously&quot; evident by technology. He=\r\nre, the investigator is no longer making vague claims, but waving science a=\r\nround, like FLIR cameras, or EMF meters, and then making proclamations of t=\r\nhe results. But again, people eventually see these are just lights and soun=\r\nds from electronics, and investigators making more claims. It&#39;s like the ps=\r\nychics again, but with visual aids.\n\n                      I think the reas=\r\non EVP studies are not securing more interest, as you noted, are a little o=\r\nf both effects. First is the anthropomorphism problem: I notice many EVP ex=\r\nperimenters proclaim what their results sound like, or name the sound file =\r\nby what they&#39;ve heard. But like the creaks, &quot;sounds like&quot; does not equal &quot;i=\r\ns&quot;. This is then compounded by the technology backing: regardless of how va=\r\nlid the EVP researcher&#39;s results are, the technology can seem intimidating,=\r\n but the researchers often proclaim the obviousness of their results. Peopl=\r\ne again become turned off by it because it is not obvious to them, and in t=\r\nhe end it is just another piece of technology presenting sounds, with no ob=\r\nvious connection to the paranormal, except by the claims and interpretation=\r\ns of the presenters.\n\n                      I believe, taking these issues =\r\ninto account, there is a way for EVP studies to garner more interest. For n=\r\now, the analysis coming from the researchers usually seems like a claim, an=\r\nd it is these claims, imho, that is being classified by the public with the=\r\n rest of the paranormal claims, and so, it also becomes less of an interest=\r\n. A new approach could be one without the claims and interpretations of the=\r\n investigators, one where the sounds are simply played and not labeled. The=\r\n interpretation of the data could be left to the listeners. Web sites which=\r\n present EVPs could be developed where people could not see others interpre=\r\ntations until they entered their own. I think this would be such a novel ap=\r\nproach, that it would give the public a better feeling of true involvement =\r\nin the research, and feel less like they are simply being exposed to the cl=\r\naims of others. And I think that feeling of involvement is what is needed t=\r\no reignited the public interest here.\n\n\n\n                 \n\n\n\n       \n\n\n  \r\n------=_NextPart_000_00FD_01C9B77A.FDFC6700\r\nContent-Type: text/html;\n\tcharset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML 4.0 Transitional//EN&quot;&gt;\n&lt;HTML&gt;&lt;HEAD&gt;=\r\n\n&lt;META content=3D&quot;text/html; charset=3Diso-8859-1&quot; http-equiv=3DContent-Typ=\r\ne&gt;\n&lt;META name=3DGENERATOR content=3D&quot;MSHTML 8.00.6001.18702&quot;&gt;&lt;/HEAD&gt;\n&lt;BODY =\r\nstyle=3D&quot;BACKGROUND-COLOR: #ffffff&quot; bgColor=3D#ffffff&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 =\r\nface=3D&quot;Myriad Pro&quot;&gt;My thing is I am in it for my self only. I \ncare not wh=\r\nat other people think about me or my methods. I stay out of all the \nback s=\r\ntabbing gossip and do my thing. I don&#39;t trash talk other teams, and I \ndon&#39;=\r\nt listen to them trash talk anyone else.&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 f=\r\nace=3D&quot;Myriad Pro&quot;&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 face=3D&quot;Myriad P=\r\nro&quot;&gt;Frank should just do his thing and ignore \nthe bull. He shouldn&#39;t let i=\r\nt bother him so much. In this field, nothing has \nbeen proven, so therefore=\r\n there is no right or wrong. He should do it to please \nhimself only.&lt;/FONT=\r\n&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 face=3D&quot;Myriad Pro&quot;&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;F=\r\nONT size=3D2 face=3D&quot;Myriad Pro&quot;&gt;April&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 fac=\r\ne=3D&quot;Myriad Pro&quot;&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;BLOCKQUOTE \nstyle=3D&quot;BORDER-LEFT: #00=\r\n0000 2px solid; PADDING-LEFT: 5px; PADDING-RIGHT: 0px; MARGIN-LEFT: 5px; MA=\r\nRGIN-RIGHT: 0px&quot; \ndir=3Dltr&gt;\n  &lt;DIV style=3D&quot;FONT: 10pt arial&quot;&gt;----- Origin=\r\nal Message ----- &lt;/DIV&gt;\n  &lt;DIV \n  style=3D&quot;FONT: 10pt arial; BACKGROUND: #e=\r\n4e4e4; font-color: black&quot;&gt;&lt;B&gt;From:&lt;/B&gt; \n  &lt;A title=3Drasterer@... hre=\r\nf=3D&quot;mailto:rasterer@...&quot;&gt;Rj&lt;/A&gt; &lt;/DIV&gt;\n  &lt;DIV style=3D&quot;FONT: 10pt ar=\r\nial&quot;&gt;&lt;B&gt;To:&lt;/B&gt; &lt;A title=3DEVP-ITC@yahoogroups.com \n  href=3D&quot;mailto:EVP-IT=\r\nC@yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups.com&lt;/A&gt; &lt;/DIV&gt;\n  &lt;DIV style=3D&quot;FONT:=\r\n 10pt arial&quot;&gt;&lt;B&gt;Sent:&lt;/B&gt; Tuesday, April 07, 2009 11:37 \n  AM&lt;/DIV&gt;\n  &lt;DIV =\r\nstyle=3D&quot;FONT: 10pt arial&quot;&gt;&lt;B&gt;Subject:&lt;/B&gt; Re: [EVP-ITC] Re: Is pride so \n =\r\n wrong!?&lt;/DIV&gt;\n  &lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n  &lt;DIV id=3Dygrp-text&gt;\n  &lt;P&gt;\n  &lt;TABLE bord=\r\ner=3D0 cellSpacing=3D0 cellPadding=3D0&gt;\n    &lt;TBODY&gt;\n    &lt;TR&gt;\n      &lt;TD vAli=\r\ngn=3Dtop&gt;It sounds like a tricky situation, and I&#39;m not sure what \n        =\r\nto suggest. I suppose one route is to, as you suggest, just walk away \n    =\r\n    from all this.&nbsp; I guess you have to look at the big picture and \n =\r\n       decide if it&#39;s worth the frustration, the stress, and the angst, \n  =\r\n      especially what it does to your health.&nbsp; Nothing is worth throwi=\r\nng \n        your health away over.&nbsp; &lt;BR&gt;&lt;BR&gt;Even dropping all this, ju=\r\nst for a \n        while, might also tell you if any health problems you are=\r\n experiencing \n        might be being aggravated by all the drama.&nbsp; An=\r\nd it might have the \n        side effect of letting all the negativity and =\r\negos out there burn \n        themselves out, so if you do look back into th=\r\nings a while down the \n        road, it could be a prettier picture then.&lt;B=\r\nR&gt;&lt;BR&gt;Other than a full \n        retreat, I don&#39;t think anything else would=\r\n make a difference other than \n        a full attack: creating, for&nbsp; i=\r\nnstance, good objective standards \n        for evaluation and test of the t=\r\nechnology and results, which the shows \n        and &#39;experts&#39; seem to find =\r\nanathema.&nbsp; Then, if their claims were to \n        be confronted by suc=\r\nh standards, they&#39;d find themselves unable to stand \n        up to them, an=\r\nd eventually, hopefully, be embarrassed back into \n        obscurity.&lt;BR&gt;&lt;B=\r\nR&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Mon, 4/6/09, Frank Sumption \n        &lt;I&gt;&lt;purplea=\r\nliengirl@&lt;WBR&gt;gmail.com&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;\n        &lt;BLOCKQUOTE style=3D=\r\n&quot;BORDER-LEFT: rgb(16,16,255) 2px solid&quot;&gt;&lt;BR&gt;From: \n          Frank Sumption=\r\n &lt;purplealiengirl@&lt;WBR&gt;gmail.com&gt;&lt;BR&gt;Subject: Re: \n          [EVP-ITC=\r\n] Re: Is pride so wrong!?&lt;BR&gt;To: \n          EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;BR=\r\n&gt;Date: Monday, April 6, 2009, 2:40 \n          PM&lt;BR&gt;&lt;BR&gt;\n          &lt;DIV id=\r\n=3Dyiv1739498024&gt;\n          &lt;DIV id=3Dygrp-text&gt;\n          &lt;P&gt;&lt;/P&gt;\n        =\r\n  &lt;DIV&gt;&nbsp;Yeah, it&#39;s for that reason that it&#39;s very tempting to walk \n  =\r\n        away from all things paranormal. After dealing with some of these \n=\r\n          wanna be experts, self proclaimed gurus and authors, I&#39;m affraid =\r\nto \n          even check my e-mail most days. If ya disagree with some of t=\r\nhese \n          people it quickly degrades into threats of lawsuits.&nbsp; =\r\nI&#39;m at a \n          point if being very reluctant to provides boxes to anyo=\r\nne, especially \n          the experts and profesional type &quot;researchers&quot;&lt;WB=\r\nR&gt;--the one&#39;s doing \n          all these stupid shows and readings using my=\r\n stuff, or similar \n          systems.&lt;/DIV&gt;\n          &lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n  =\r\n        &lt;DIV&gt;&nbsp;When these dorks makes claims for fear sake such as demo=\r\nns, \n          or shadow people come through the box, or are attracked by t=\r\nhe \n          boxes,&nbsp; I tend to get a bit upset, and yet these people =\r\ncan&#39;t \n          hear a word I&#39;m saying,&nbsp; &lt;BR&gt;their huge egos block ev=\r\nerything, as \n          if I make this stuff that works but can&#39;t possibley=\r\n know anything \n          about he so called paranormal. &lt;BR&gt;&lt;/DIV&gt;\n       =\r\n   &lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n          &lt;DIV&gt;&nbsp;Frank-S&lt;BR&gt;&lt;/DIV&gt;\n          &lt;DIV =\r\nclass=3Dgmail_quote&gt;On Mon, Apr 6, 2009 at 9:28 AM, Rj &lt;SPAN \n          dir=\r\n=3Dltr&gt;&lt;&lt;A href=3D&quot;/mc/compose?to=3Drasterer@...&quot; rel=3Dnofollow \n=\r\n          target=3D_blank ymailto=3D&quot;mailto:rasterer@...&quot;&gt;rasterer@ya=\r\nhoo. \n          com&lt;/A&gt;&gt;&lt;/SPAN&gt; wrote:&lt;BR&gt;\n          &lt;BLOCKQUOTE style=\r\n=3D&quot;BORDER-LEFT: rgb(204,204,204) 1px solid&quot; \n          class=3Dgmail_quote=\r\n&gt;\n            &lt;DIV style=3D&quot;BACKGROUND-COLOR: rgb(255,255,255)&quot;&gt;\n          =\r\n  &lt;DIV&gt;\n            &lt;DIV&gt;\n            &lt;DIV&gt;\n            &lt;P&gt;\n            &lt;TA=\r\nBLE border=3D0 cellSpacing=3D0 cellPadding=3D0&gt;\n              &lt;TBODY&gt;\n     =\r\n         &lt;TR&gt;\n                &lt;TD vAlign=3Dtop&gt;Frank, I think you are right=\r\n in that the reason \n                  for the negativity and sensationalis=\r\nm in these shows is that \n                  it sells better.&nbsp; Most peo=\r\nple watch these shows for the \n                  escape and entertainment v=\r\nalue, like the rest of \n                  tv.&nbsp;&nbsp; And these shows l=\r\nearn over time what loses \n                  audience (same old claims, bor=\r\ning results, etc), and what \n                  draws them back (wild claims=\r\n, overall freak value, and &quot;we \n                  must protect the children=\r\n!&quot;).&nbsp; This is all completely \n                  orthodox for tv entert=\r\nainment, but does lend itself to any \n                  kind of true resear=\r\nch, or any kind of actual \n                  edification.&lt;BR&gt;&lt;BR&gt;So I think=\r\n we can expect these shows will \n                  continue to ramp these s=\r\norts of elements up in order to \n                  compete, and we can expe=\r\nct them to dwell less on mundane and \n                  activity-free situa=\r\ntions, and present more claims of evil \n                  entities, mysteri=\r\nous injuries, and unexplainable foul odors, \n                  accompanied =\r\nby more frightened investigators, trembling \n                  sensitives, =\r\nand humorously gullible associates and customers, \n                  and al=\r\nl wrapped in fancier technology, scarier settings, and \n                  s=\r\ntate-o-the- art editing.&lt;BR&gt;&lt;BR&gt;Also: a little humor of the \n              =\r\n    day:&nbsp;&nbsp; &lt;A \n                  href=3D&quot;http://comics.com/get_fu=\r\nzzy/2009-04-06/&quot; rel=3Dnofollow \n                  target=3D_blank&gt;http://c=\r\nomics. com/get_fuzzy/ \n                  2009-04-06/&lt;/A&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;---=\r\n On &lt;B&gt;Sat, 4/4/09, Frank \n                  Sumption &lt;I&gt;&lt;&lt;A \n          =\r\n        href=3D&quot;/mc/compose?to=3Dpurplealiengirl@...&quot; rel=3Dnofollow =\r\n\n                  target=3D_blank \n                  ymailto=3D&quot;mailto:pur=\r\nplealiengirl@...&quot;&gt;purplealiengirl@ \n                  gmail.com&lt;/A&gt;&g=\r\nt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;\n                  &lt;BLOCKQUOTE \n                    st=\r\nyle=3D&quot;BORDER-LEFT: rgb(16,16,255) 2px solid&quot;&gt;&lt;BR&gt;From: \n                  =\r\n  Frank Sumption &lt;&lt;A \n                    href=3D&quot;/mc/compose?to=3Dpurpl=\r\nealiengirl@...&quot; rel=3Dnofollow \n                    target=3D_blank \n=\r\n                    ymailto=3D&quot;mailto:purplealiengirl@...&quot;&gt;purplealie=\r\nngirl@ \n                    gmail.com&lt;/A&gt;&gt;&lt;BR&gt;Subject: Re: [EVP-ITC] Re:=\r\n Is pride so \n                    wrong!?&lt;BR&gt;To: &lt;A \n                    hr=\r\nef=3D&quot;/mc/compose?to=3DEVP-ITC@yahoogroups.com&quot; rel=3Dnofollow \n           =\r\n         target=3D_blank \n                    ymailto=3D&quot;mailto:EVP-ITC@yah=\r\noogroups.com&quot;&gt;EVP-ITC@yahoogroups \n                    .com&lt;/A&gt;&lt;BR&gt;Date: Sa=\r\nturday, April 4, 2009, 2:08 PM&lt;BR&gt;&lt;BR&gt;\n                    &lt;DIV&gt;\n          =\r\n          &lt;DIV&gt;\n                    &lt;DIV class=3Dim&gt;\n                    &lt;P=\r\n&gt;&lt;/P&gt;\n                    &lt;DIV&gt;Thanks Rick! You seem to have put alot of th=\r\nought and \n                    time into that. &lt;/DIV&gt;\n                    &lt;=\r\nDIV&gt;&nbsp;&lt;/DIV&gt;\n                    &lt;DIV&gt;&nbsp;What really bothers me is t=\r\nhe self proclaimed \n                    experts out there that take all evi=\r\ndence and \n                    experience&nbsp;and try to make it negative,=\r\n and evil. Maybe \n                    many get tired, or even affraid of se=\r\neking paranormal \n                    experience for that reason.&lt;/DIV&gt;\n   =\r\n                 &lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n                    &lt;DIV&gt;&nbsp;I don&#39;t d=\r\no ghost hunts or invesitgations, but the \n                    hauntings I&#39;v=\r\ne heard of seem to be nothing more than \n                    something tryi=\r\nng to get someone&#39;s attention. It&#39;s these \n                    experts that=\r\n turn it into something that must be \n                    negative.&nbsp; T=\r\nhere&#39;s Hollywood, such as the &quot;Haunting In \n                    CT&quot;, these =\r\nsame experts will proclaim is based on fact, when \n                    the =\r\nfacts are probably nothing more than your creaking \n                    flo=\r\nors, just&nbsp;to make the whole paranoramal field dark \n                  =\r\n  and demon filled. In my case, fear does not sell, I won&#39; \n               =\r\n     watch those movies. &lt;/DIV&gt;\n                    &lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n     =\r\n               &lt;DIV&gt;&nbsp;I think there is good EVP evidence, and I&#39;ve \n   =\r\n                 heard many from various researchers.&nbsp; Trouble is, it&#39;=\r\ns \n                    like talking on a phone or radio, how&nbsp;do you kn=\r\now who \n                    it is other by what they say?&lt;/DIV&gt;\n           =\r\n         &lt;DIV&gt;&nbsp;&lt;/DIV&gt;&lt;/DIV&gt;\n                    &lt;DIV&gt;&nbsp;Frank-S&lt;BR&gt;=\r\n&lt;/DIV&gt;\n                    &lt;DIV class=3Dim&gt;\n                    &lt;DIV class=\r\n=3Dgmail_quote&gt;On Sat, Apr 4, 2009 at 2:47 PM, Rick \n                    &lt;S=\r\nPAN dir=3Dltr&gt;&lt;&lt;A \n                    href=3D&quot;http://mc/compose?to=3Dra=\r\nsterer@...&quot; rel=3Dnofollow \n                    target=3D_blank&gt;raste=\r\nrer@yahoo. com&lt;/A&gt;&gt;&lt;/SPAN&gt; wrote:&lt;BR&gt;\n                    &lt;BLOCKQUOTE st=\r\nyle=3D&quot;BORDER-LEFT: rgb(204,204,204) 1px solid&quot; \n                    class=\r\n=3Dgmail_quote&gt;\n                      &lt;DIV style=3D&quot;BACKGROUND-COLOR: rgb(2=\r\n55,255,255)&quot;&gt;\n                      &lt;DIV&gt;\n                      &lt;DIV&gt;\n     =\r\n                 &lt;DIV&gt;\n                      &lt;P&gt;--- In &lt;A \n                =\r\n      href=3D&quot;http://mc/compose?to=3DEVP-ITC%40yahoogroups.com&quot; \n          =\r\n            rel=3Dnofollow target=3D_blank&gt;EVP-ITC@yahoogroups .com&lt;/A&gt;, \n =\r\n                     &quot;purplespacefriend&quot; &lt;purplealiengirl@ ...&gt; \n    =\r\n                  wrote:&lt;BR&gt;&lt;BR&gt;&gt; Just wondering, seemed like interest i=\r\nn \n                      EVP/ITC was dropping off. Too bad the interest in =\r\nEVP \n                      doesn&#39;t pick up while that ghost hunting mentali=\r\nty drops \n                      off. I keep saying, you&#39;ll get better, more=\r\n consistent, \n                      and more meaningful messages if you rec=\r\nord at home. The \n                      ghosts, spirits and entities can an=\r\nd do travel. You also \n                      have to listen to the recordin=\r\ngs more than once. &lt;BR&gt;&gt; \n                      &lt;BR&gt;&gt; Frank&lt;BR&gt;&lt;BR&gt;Th=\r\nat is an interesting observation. \n                      I think the core o=\r\nf the issue is that there seems to be a \n                      `sweet spot&#39;=\r\n in paranormal beliefs where there is just \n                      enough sc=\r\nience, just enough technical backing, just enough \n                      pa=\r\nranormal claims, and just enough indefinite evidence \n                     =\r\n that keeps people interested in the ghost hunting \n                      m=\r\nentality&lt;BR&gt;&lt;BR&gt;Evidence which becomes too indefinite \n                    =\r\n  turns off most people. As they become more aware of \n                    =\r\n  sensitives who simply make claims (&quot;I feel there is a \n                  =\r\n    GHOST here!&quot;), but provide no evidence other than \n                    =\r\n  statements, people eventually get bored. Similarly, people \n             =\r\n         eventually grow tired of the anthropomorphism of every \n          =\r\n            little occurrence in a house: a creak implies a footstep, \n    =\r\n                  which implies a person, which, if not seen, implies a \n  =\r\n                    ghost. But a creak does not equal a footstep.&lt;BR&gt;&lt;BR&gt;An=\r\nd \n                      while this kind of indefinite evidence can lose an=\r\n \n                      audience, so can evidence that is claimed to be \n  =\r\n                    &quot;obviously&quot; evident by technology. Here, the investigat=\r\nor \n                      is no longer making vague claims, but waving scie=\r\nnce \n                      around, like FLIR cameras, or EMF meters, and th=\r\nen making \n                      proclamations of the results. But again, p=\r\neople eventually \n                      see these are just lights and sound=\r\ns from electronics, and \n                      investigators making more cl=\r\naims. It&#39;s like the psychics \n                      again, but with visual =\r\naids.&lt;BR&gt;&lt;BR&gt;I think the reason EVP \n                      studies are not =\r\nsecuring more interest, as you noted, are \n                      a little o=\r\nf both effects. First is the anthropomorphism \n                      proble=\r\nm: I notice many EVP experimenters proclaim what \n                      the=\r\nir results sound like, or name the sound file by what \n                    =\r\n  they&#39;ve heard. But like the creaks, &quot;sounds like&quot; does not \n             =\r\n         equal &quot;is&quot;. This is then compounded by the technology \n           =\r\n           backing: regardless of how valid the EVP researcher&#39;s \n         =\r\n             results are, the technology can seem intimidating, but the \n  =\r\n                    researchers often proclaim the obviousness of their \n  =\r\n                    results. People again become turned off by it because i=\r\nt \n                      is not obvious to them, and in the end it is just =\r\nanother \n                      piece of technology presenting sounds, with =\r\nno obvious \n                      connection to the paranormal, except by t=\r\nhe claims and \n                      interpretations of the presenters.&lt;BR&gt;=\r\n&lt;BR&gt;I believe, \n                      taking these issues into account, the=\r\nre is a way for EVP \n                      studies to garner more interest.=\r\n For now, the analysis \n                      coming from the researchers u=\r\nsually seems like a claim, \n                      and it is these claims, i=\r\nmho, that is being classified by \n                      the public with the=\r\n rest of the paranormal claims, and so, \n                      it also beco=\r\nmes less of an interest. A new approach could \n                      be one=\r\n without the claims and interpretations of the \n                      inves=\r\ntigators, one where the sounds are simply played and \n                     =\r\n not labeled. The interpretation of the data could be left \n               =\r\n       to the listeners. Web sites which present EVPs could be \n           =\r\n           developed where people could not see others \n                   =\r\n   interpretations until they entered their own. I think this \n            =\r\n          would be such a novel approach, that it would give the \n         =\r\n             public a better feeling of true involvement in the \n          =\r\n            research, and feel less like they are simply being exposed \n   =\r\n                   to the claims of others. And I think that feeling of \n  =\r\n                    involvement is what is needed to reignited the public \n=\r\n                      interest here.&lt;BR&gt;&lt;BR&gt;&lt;/P&gt;&lt;/DIV&gt;\n                    =\r\n  &lt;DIV \n                    style=3D&quot;COLOR: white&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;=\r\n&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/TD&gt;&lt;/TR&gt;&lt;/TBODY&gt;&lt;/T=\r\nABLE&gt;&lt;BR&gt;&lt;/P&gt;&lt;/DIV&gt;\n            &lt;DIV \n          style=3D&quot;COLOR: white&quot;&gt;&lt;/DI=\r\nV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/TD&gt;&lt;/=\r\nTR&gt;&lt;/TBODY&gt;&lt;/TABLE&gt;&lt;BR&gt;&lt;/P&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BODY&gt;&lt;/HTML&gt;\n\r\n------=_NextPart_000_00FD_01C9B77A.FDFC6700--"}