{"id": "13659", "subject": "Re: [EVP-ITC] Re: Is pride so wrong!?", "author": "Zack Widup", "timestamp": "2009-04-07T18:49:32Z", "full_text": "Heehee! I&#39;ve been here for a couple years now.\n:-)\n\n\nOn Tue, Apr 7, 2009 at 1:31 PM, April Abercrombie &lt;\napril@...&gt; wrote:\n\n&gt;    OMG Zack!! Are you following me???\n&gt;\n&gt; Or is it that I am following you???\n&gt;\n&gt; LOL!!!!\n&gt;\n&gt;\n&gt;  ----- Original Message -----\n&gt; *From:* Zack Widup &lt;w9sz.zack@...&gt;\n&gt; *To:* EVP-ITC@yahoogroups.com\n&gt;   *Sent:* Tuesday, April 07, 2009 12:24 PM\n&gt; *Subject:* Re: [EVP-ITC] Re: Is pride so wrong!?\n&gt;\n&gt;  I&#39;m the same way and I agree.\n&gt;\n&gt; BTW nice to see you on this group too, April!\n&gt;\n&gt; Zack\n&gt;\n&gt; On Tue, Apr 7, 2009 at 1:18 PM, April Abercrombie &lt;\n&gt; april@...&gt; wrote:\n&gt;\n&gt;&gt;    My thing is I am in it for my self only. I care not what other people\n&gt;&gt; think about me or my methods. I stay out of all the back stabbing gossip and\n&gt;&gt; do my thing. I don&#39;t trash talk other teams, and I don&#39;t listen to them\n&gt;&gt; trash talk anyone else.\n&gt;&gt;\n&gt;&gt; Frank should just do his thing and ignore the bull. He shouldn&#39;t let it\n&gt;&gt; bother him so much. In this field, nothing has been proven, so therefore\n&gt;&gt; there is no right or wrong. He should do it to please himself only.\n&gt;&gt;\n&gt;&gt; April\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;  ----- Original Message -----\n&gt;&gt; *From:* Rj &lt;rasterer@...&gt;\n&gt;&gt; *To:* EVP-ITC@yahoogroups.com\n&gt;&gt;   *Sent:* Tuesday, April 07, 2009 11:37 AM\n&gt;&gt; *Subject:* Re: [EVP-ITC] Re: Is pride so wrong!?\n&gt;&gt;\n&gt;&gt;    It sounds like a tricky situation, and I&#39;m not sure what to suggest. I\n&gt;&gt; suppose one route is to, as you suggest, just walk away from all this.  I\n&gt;&gt; guess you have to look at the big picture and decide if it&#39;s worth the\n&gt;&gt; frustration, the stress, and the angst, especially what it does to your\n&gt;&gt; health.  Nothing is worth throwing your health away over.\n&gt;&gt;\n&gt;&gt; Even dropping all this, just for a while, might also tell you if any\n&gt;&gt; health problems you are experiencing might be being aggravated by all the\n&gt;&gt; drama.  And it might have the side effect of letting all the negativity and\n&gt;&gt; egos out there burn themselves out, so if you do look back into things a\n&gt;&gt; while down the road, it could be a prettier picture then.\n&gt;&gt;\n&gt;&gt; Other than a full retreat, I don&#39;t think anything else would make a\n&gt;&gt; difference other than a full attack: creating, for  instance, good objective\n&gt;&gt; standards for evaluation and test of the technology and results, which the\n&gt;&gt; shows and &#39;experts&#39; seem to find anathema.  Then, if their claims were to be\n&gt;&gt; confronted by such standards, they&#39;d find themselves unable to stand up to\n&gt;&gt; them, and eventually, hopefully, be embarrassed back into obscurity.\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; --- On *Mon, 4/6/09, Frank Sumption &lt;purplealiengirl@...&gt;* wrote:\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt;&gt; Subject: Re: [EVP-ITC] Re: Is pride so wrong!?\n&gt;&gt; To: EVP-ITC@yahoogroups.com\n&gt;&gt; Date: Monday, April 6, 2009, 2:40 PM\n&gt;&gt;\n&gt;&gt;    Yeah, it&#39;s for that reason that it&#39;s very tempting to walk away from\n&gt;&gt; all things paranormal. After dealing with some of these wanna be experts,\n&gt;&gt; self proclaimed gurus and authors, I&#39;m affraid to even check my e-mail most\n&gt;&gt; days. If ya disagree with some of these people it quickly degrades into\n&gt;&gt; threats of lawsuits.  I&#39;m at a point if being very reluctant to provides\n&gt;&gt; boxes to anyone, especially the experts and profesional type\n&gt;&gt; &quot;researchers&quot;--the one&#39;s doing all these stupid shows and readings using my\n&gt;&gt; stuff, or similar systems.\n&gt;&gt;\n&gt;&gt;  When these dorks makes claims for fear sake such as demons, or shadow\n&gt;&gt; people come through the box, or are attracked by the boxes,  I tend to get a\n&gt;&gt; bit upset, and yet these people can&#39;t hear a word I&#39;m saying,\n&gt;&gt; their huge egos block everything, as if I make this stuff that works but\n&gt;&gt; can&#39;t possibley know anything about he so called paranormal.\n&gt;&gt;\n&gt;&gt;  Frank-S\n&gt;&gt; On Mon, Apr 6, 2009 at 9:28 AM, Rj &lt;rasterer@yahoo. com&lt;http://mc/compose?to=rasterer@...&gt;\n&gt;&gt; &gt; wrote:\n&gt;&gt;\n&gt;&gt;&gt;     Frank, I think you are right in that the reason for the negativity\n&gt;&gt;&gt; and sensationalism in these shows is that it sells better.  Most people\n&gt;&gt;&gt; watch these shows for the escape and entertainment value, like the rest of\n&gt;&gt;&gt; tv.   And these shows learn over time what loses audience (same old claims,\n&gt;&gt;&gt; boring results, etc), and what draws them back (wild claims, overall freak\n&gt;&gt;&gt; value, and &quot;we must protect the children!&quot;).  This is all completely\n&gt;&gt;&gt; orthodox for tv entertainment, but does lend itself to any kind of true\n&gt;&gt;&gt; research, or any kind of actual edification.\n&gt;&gt;&gt;\n&gt;&gt;&gt; So I think we can expect these shows will continue to ramp these sorts of\n&gt;&gt;&gt; elements up in order to compete, and we can expect them to dwell less on\n&gt;&gt;&gt; mundane and activity-free situations, and present more claims of evil\n&gt;&gt;&gt; entities, mysterious injuries, and unexplainable foul odors, accompanied by\n&gt;&gt;&gt; more frightened investigators, trembling sensitives, and humorously gullible\n&gt;&gt;&gt; associates and customers, and all wrapped in fancier technology, scarier\n&gt;&gt;&gt; settings, and state-o-the- art editing.\n&gt;&gt;&gt;\n&gt;&gt;&gt; Also: a little humor of the day:   http://comics. com/get_fuzzy/\n&gt;&gt;&gt; 2009-04-06/ &lt;http://comics.com/get_fuzzy/2009-04-06/&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt; --- On *Sat, 4/4/09, Frank Sumption &lt;purplealiengirl@ gmail.com&lt;http://mc/compose?to=purplealiengirl@...&gt;\n&gt;&gt;&gt; &gt;* wrote:\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt; From: Frank Sumption &lt;purplealiengirl@ gmail.com&lt;http://mc/compose?to=purplealiengirl@...&gt;\n&gt;&gt;&gt; &gt;\n&gt;&gt;&gt; Subject: Re: [EVP-ITC] Re: Is pride so wrong!?\n&gt;&gt;&gt; To: EVP-ITC@yahoogroups .com&lt;http://mc/compose?to=EVP-ITC@yahoogroups.com&gt;\n&gt;&gt;&gt; Date: Saturday, April 4, 2009, 2:08 PM\n&gt;&gt;&gt;\n&gt;&gt;&gt;   Thanks Rick! You seem to have put alot of thought and time into that.\n&gt;&gt;&gt;\n&gt;&gt;&gt;  What really bothers me is the self proclaimed experts out there that\n&gt;&gt;&gt; take all evidence and experience and try to make it negative, and evil.\n&gt;&gt;&gt; Maybe many get tired, or even affraid of seeking paranormal experience for\n&gt;&gt;&gt; that reason.\n&gt;&gt;&gt;\n&gt;&gt;&gt;  I don&#39;t do ghost hunts or invesitgations, but the hauntings I&#39;ve heard\n&gt;&gt;&gt; of seem to be nothing more than something trying to get someone&#39;s attention.\n&gt;&gt;&gt; It&#39;s these experts that turn it into something that must be negative.\n&gt;&gt;&gt; There&#39;s Hollywood, such as the &quot;Haunting In CT&quot;, these same experts will\n&gt;&gt;&gt; proclaim is based on fact, when the facts are probably nothing more than\n&gt;&gt;&gt; your creaking floors, just to make the whole paranoramal field dark and\n&gt;&gt;&gt; demon filled. In my case, fear does not sell, I won&#39; watch those movies.\n&gt;&gt;&gt;\n&gt;&gt;&gt;  I think there is good EVP evidence, and I&#39;ve heard many from various\n&gt;&gt;&gt; researchers.  Trouble is, it&#39;s like talking on a phone or radio, how do you\n&gt;&gt;&gt; know who it is other by what they say?\n&gt;&gt;&gt;\n&gt;&gt;&gt;  Frank-S\n&gt;&gt;&gt;  On Sat, Apr 4, 2009 at 2:47 PM, Rick &lt;rasterer@yahoo. com&lt;http://mc/compose?to=rasterer@...&gt;\n&gt;&gt;&gt; &gt; wrote:\n&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;   --- In EVP-ITC@yahoogroups .com&lt;http://mc/compose?to=EVP-ITC%40yahoogroups.com&gt;,\n&gt;&gt;&gt;&gt; &quot;purplespacefriend&quot; &lt;purplealiengirl@ ...&gt; wrote:\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; &gt; Just wondering, seemed like interest in EVP/ITC was dropping off. Too\n&gt;&gt;&gt;&gt; bad the interest in EVP doesn&#39;t pick up while that ghost hunting mentality\n&gt;&gt;&gt;&gt; drops off. I keep saying, you&#39;ll get better, more consistent, and more\n&gt;&gt;&gt;&gt; meaningful messages if you record at home. The ghosts, spirits and entities\n&gt;&gt;&gt;&gt; can and do travel. You also have to listen to the recordings more than once.\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt; &gt; Frank\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; That is an interesting observation. I think the core of the issue is\n&gt;&gt;&gt;&gt; that there seems to be a `sweet spot&#39; in paranormal beliefs where there is\n&gt;&gt;&gt;&gt; just enough science, just enough technical backing, just enough paranormal\n&gt;&gt;&gt;&gt; claims, and just enough indefinite evidence that keeps people interested in\n&gt;&gt;&gt;&gt; the ghost hunting mentality\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; Evidence which becomes too indefinite turns off most people. As they\n&gt;&gt;&gt;&gt; become more aware of sensitives who simply make claims (&quot;I feel there is a\n&gt;&gt;&gt;&gt; GHOST here!&quot;), but provide no evidence other than statements, people\n&gt;&gt;&gt;&gt; eventually get bored. Similarly, people eventually grow tired of the\n&gt;&gt;&gt;&gt; anthropomorphism of every little occurrence in a house: a creak implies a\n&gt;&gt;&gt;&gt; footstep, which implies a person, which, if not seen, implies a ghost. But a\n&gt;&gt;&gt;&gt; creak does not equal a footstep.\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; And while this kind of indefinite evidence can lose an audience, so can\n&gt;&gt;&gt;&gt; evidence that is claimed to be &quot;obviously&quot; evident by technology. Here, the\n&gt;&gt;&gt;&gt; investigator is no longer making vague claims, but waving science around,\n&gt;&gt;&gt;&gt; like FLIR cameras, or EMF meters, and then making proclamations of the\n&gt;&gt;&gt;&gt; results. But again, people eventually see these are just lights and sounds\n&gt;&gt;&gt;&gt; from electronics, and investigators making more claims. It&#39;s like the\n&gt;&gt;&gt;&gt; psychics again, but with visual aids.\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; I think the reason EVP studies are not securing more interest, as you\n&gt;&gt;&gt;&gt; noted, are a little of both effects. First is the anthropomorphism problem:\n&gt;&gt;&gt;&gt; I notice many EVP experimenters proclaim what their results sound like, or\n&gt;&gt;&gt;&gt; name the sound file by what they&#39;ve heard. But like the creaks, &quot;sounds\n&gt;&gt;&gt;&gt; like&quot; does not equal &quot;is&quot;. This is then compounded by the technology\n&gt;&gt;&gt;&gt; backing: regardless of how valid the EVP researcher&#39;s results are, the\n&gt;&gt;&gt;&gt; technology can seem intimidating, but the researchers often proclaim the\n&gt;&gt;&gt;&gt; obviousness of their results. People again become turned off by it because\n&gt;&gt;&gt;&gt; it is not obvious to them, and in the end it is just another piece of\n&gt;&gt;&gt;&gt; technology presenting sounds, with no obvious connection to the paranormal,\n&gt;&gt;&gt;&gt; except by the claims and interpretations of the presenters.\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; I believe, taking these issues into account, there is a way for EVP\n&gt;&gt;&gt;&gt; studies to garner more interest. For now, the analysis coming from the\n&gt;&gt;&gt;&gt; researchers usually seems like a claim, and it is these claims, imho, that\n&gt;&gt;&gt;&gt; is being classified by the public with the rest of the paranormal claims,\n&gt;&gt;&gt;&gt; and so, it also becomes less of an interest. A new approach could be one\n&gt;&gt;&gt;&gt; without the claims and interpretations of the investigators, one where the\n&gt;&gt;&gt;&gt; sounds are simply played and not labeled. The interpretation of the data\n&gt;&gt;&gt;&gt; could be left to the listeners. Web sites which present EVPs could be\n&gt;&gt;&gt;&gt; developed where people could not see others interpretations until they\n&gt;&gt;&gt;&gt; entered their own. I think this would be such a novel approach, that it\n&gt;&gt;&gt;&gt; would give the public a better feeling of true involvement in the research,\n&gt;&gt;&gt;&gt; and feel less like they are simply being exposed to the claims of others.\n&gt;&gt;&gt;&gt; And I think that feeling of involvement is what is needed to reignited the\n&gt;&gt;&gt;&gt; public interest here.\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;   \n&gt;\n\nHeehee! I' e been he e o a couple yea s now.\n:-)\n \nOn Tue, Ap 7, 2009 a 1:31 PM, Ap il Abe c ombie ap il@...> w o e:\n\n\n\n\n\n\nOMG Zack!! A e you ollowing me???\n \nO is i ha I am ollowing you???\n \nLOL!!!!\n \n\n\n----- O iginal Message ----- \nF om: Zack Widup \nTo: EVP-ITC@yahoog oups.com \n\n\n\nSen : Tuesday, Ap il 07, 2009 12:24 PM\nSubjec : Re: [EVP-ITC] Re: Is p ide so w ong!?\n\n\n\nI'm he same way and I ag ee.\n \nBTW nice o see you on his g oup oo, Ap il!\n \nZack\nOn Tue, Ap 7, 2009 a 1:18 PM, Ap il Abe c ombie ap il@...> w o e:\n\n\n\n\n\n\n\nMy hing is I am in i o my sel only. I ca e no wha o he people hink abou me o my me hods. I s ay ou o all he back s abbing gossip and do my hing. I don' ash alk o he eams, and I don' lis en o hem ash alk anyone else.\n\n \nF ank should jus do his hing and igno e he bull. He shouldn' le i bo he him so much. In his ield, no hing has been p o en, so he e o e he e is no igh o w ong. He should do i o please himsel only.\n\n \nAp il\n \n\n\n----- O iginal Message ----- \nF om: Rj \nTo: EVP-ITC@yahoog oups.com \n\n\n\nSen : Tuesday, Ap il 07, 2009 11:37 AM\nSubjec : Re: [EVP-ITC] Re: Is p ide so w ong!?\n\n\n\n\n\n\nI sounds like a icky si ua ion, and I'm no su e wha o sugges . I suppose one ou e is o, as you sugges , jus walk away om all his.  I guess you ha e o look a he big pic u e and decide i i 's wo h he us a ion, he s ess, and he angs , especially wha i does o you heal h.  No hing is wo h h owing you heal h away o e .  \nE en d opping all his, jus o a while, migh also ell you i any heal h p oblems you a e expe iencing migh be being agg a a ed by all he d ama.  And i migh ha e he side e ec o le ing all he nega i i y and egos ou he e bu n hemsel es ou , so i you do look back in o hings a while down he oad, i could be a p e ie pic u e hen.\nO he han a ull e ea , I don' hink any hing else would make a di e ence o he han a ull a ack: c ea ing, o   ins ance, good objec i e s anda ds o e alua ion and es o he echnology and esul s, which he shows and 'expe s' seem o ind ana hema.  Then, i hei claims we e o be con on ed by such s anda ds, hey'd ind hemsel es unable o s and up o hem, and e en ually, hope ully, be emba assed back in o obscu i y.\n--- On Mon, 4/6/09, F ank Sump ion pu plealiengi l@...> w o e:\nF om: F ank Sump ion pu plealiengi l@...>Subjec : Re: [EVP-ITC] Re: Is p ide so w ong!?\nTo: EVP-ITC@yahoog oups.comDa e: Monday, Ap il 6, 2009, 2:40 PM\n\n\n\n Yeah, i 's o ha eason ha i 's e y emp ing o walk away om all hings pa ano mal. A e dealing wi h some o hese wanna be expe s, sel p oclaimed gu us and au ho s, I'm a aid o e en check my e-mail mos days. I ya disag ee wi h some o hese people i quickly deg ades in o h ea s o lawsui s.  I'm a a poin i being e y eluc an o p o ides boxes o anyone, especially he expe s and p o esional ype \" esea che s\"-- he one's doing all hese s upid shows and eadings using my s u , o simila sys ems.\n\n \n When hese do ks makes claims o ea sake such as demons, o shadow people come h ough he box, o a e a acked by he boxes,  I end o ge a bi upse , and ye hese people can' hea a wo d I'm saying,  \n hei huge egos block e e y hing, as i I make his s u ha wo ks bu can' possibley know any hing abou he so called pa ano mal. \n \n F ank-S\nOn Mon, Ap 6, 2009 a 9:28 AM, Rj as e e @yahoo. com> w o e:\n\n\n\n\n\n\n\n\n\nF ank, I hink you a e igh in ha he eason o he nega i i y and sensa ionalism in hese shows is ha i sells be e .  Mos people wa ch hese shows o he escape and en e ainmen alue, like he es o .   And hese shows lea n o e ime wha loses audience (same old claims, bo ing esul s, e c), and wha d aws hem back (wild claims, o e all eak alue, and \"we mus p o ec he child en!\").  This is all comple ely o hodox o en e ainmen , bu does lend i sel o any kind o ue esea ch, o any kind o ac ual edi ica ion.\nSo I hink we can expec hese shows will con inue o amp hese so s o elemen s up in o de o compe e, and we can expec hem o dwell less on mundane and ac i i y- ee si ua ions, and p esen mo e claims o e il en i ies, mys e ious inju ies, and unexplainable oul odo s, accompanied by mo e igh ened in es iga o s, embling sensi i es, and humo ously gullible associa es and cus ome s, and all w apped in ancie echnology, sca ie se ings, and s a e-o- he- a edi ing.\nAlso: a li le humo o he day:   h p://comics. com/ge _ uzzy/ 2009-04-06/--- On Sa , 4/4/09, F ank Sump ion pu plealiengi l@ gmail.com> w o e:\n\nF om: F ank Sump ion pu plealiengi l@ gmail.com>Subjec : Re: [EVP-ITC] Re: Is p ide so w ong!?\nTo: EVP-ITC@yahoog oups .comDa e: Sa u day, Ap il 4, 2009, 2:08 PM\n\n\n\n\nThanks Rick! You seem o ha e pu alo o hough and ime in o ha . \n \n Wha eally bo he s me is he sel p oclaimed expe s ou he e ha ake all e idence and expe ience and y o make i nega i e, and e il. Maybe many ge i ed, o e en a aid o seeking pa ano mal expe ience o ha eason.\n\n \n I don' do ghos hun s o in esi ga ions, bu he haun ings I' e hea d o seem o be no hing mo e han some hing ying o ge someone's a en ion. I 's hese expe s ha u n i in o some hing ha mus be nega i e.  The e's Hollywood, such as he \"Haun ing In CT\", hese same expe s will p oclaim is based on ac , when he ac s a e p obably no hing mo e han you c eaking loo s, jus   o make he whole pa ano amal ield da k and demon illed. In my case, ea does no sell, I won' wa ch hose mo ies. \n\n \n I hink he e is good EVP e idence, and I' e hea d many om a ious esea che s.  T ouble is, i 's like alking on a phone o adio, how do you know who i is o he by wha hey say?\n \n F ank-S\n\nOn Sa , Ap 4, 2009 a 2:47 PM, Rick as e e @yahoo. com> w o e:\n\n\n\n\n\n--- In EVP-ITC@yahoog oups .com, \"pu plespace iend\" w o e:> Jus wonde ing, seemed like in e es in EVP/ITC was d opping o . Too bad he in e es in EVP doesn' pick up while ha ghos hun ing men ali y d ops o . I keep saying, you'll ge be e , mo e consis en , and mo e meaning ul messages i you eco d a home. The ghos s, spi i s and en i ies can and do a el. You also ha e o lis en o he eco dings mo e han once. \n> > F ankTha is an in e es ing obse a ion. I hink he co e o he issue is ha he e seems o be a `swee spo ' in pa ano mal belie s whe e he e is jus enough science, jus enough echnical backing, jus enough pa ano mal claims, and jus enough inde ini e e idence ha keeps people in e es ed in he ghos hun ing men ali y\nE idence which becomes oo inde ini e u ns o mos people. As hey become mo e awa e o sensi i es who simply make claims (\"I eel he e is a GHOST he e!\"), bu p o ide no e idence o he han s a emen s, people e en ually ge bo ed. Simila ly, people e en ually g ow i ed o he an h opomo phism o e e y li le occu ence in a house: a c eak implies a oo s ep, which implies a pe son, which, i no seen, implies a ghos . Bu a c eak does no equal a oo s ep.\nAnd while his kind o inde ini e e idence can lose an audience, so can e idence ha is claimed o be \"ob iously\" e iden by echnology. He e, he in es iga o is no longe making ague claims, bu wa ing science a ound, like FLIR came as, o EMF me e s, and hen making p oclama ions o he esul s. Bu again, people e en ually see hese a e jus ligh s and sounds om elec onics, and in es iga o s making mo e claims. I 's like he psychics again, bu wi h isual aids.\nI hink he eason EVP s udies a e no secu ing mo e in e es , as you no ed, a e a li le o bo h e ec s. Fi s is he an h opomo phism p oblem: I no ice many EVP expe imen e s p oclaim wha hei esul s sound like, o name he sound ile by wha hey' e hea d. Bu like he c eaks, \"sounds like\" does no equal \"is\". This is hen compounded by he echnology backing: ega dless o how alid he EVP esea che 's esul s a e, he echnology can seem in imida ing, bu he esea che s o en p oclaim he ob iousness o hei esul s. People again become u ned o by i because i is no ob ious o hem, and in he end i is jus ano he piece o echnology p esen ing sounds, wi h no ob ious connec ion o he pa ano mal, excep by he claims and in e p e a ions o he p esen e s.\nI belie e, aking hese issues in o accoun , he e is a way o EVP s udies o ga ne mo e in e es . Fo now, he analysis coming om he esea che s usually seems like a claim, and i is hese claims, imho, ha is being classi ied by he public wi h he es o he pa ano mal claims, and so, i also becomes less o an in e es . A new app oach could be one wi hou he claims and in e p e a ions o he in es iga o s, one whe e he sounds a e simply played and no labeled. The in e p e a ion o he da a could be le o he lis ene s. Web si es which p esen EVPs could be de eloped whe e people could no see o he s in e p e a ions un il hey en e ed hei own. I hink his would be such a no el app oach, ha i would gi e he public a be e eeling o ue in ol emen in he esea ch, and eel less like hey a e simply being exposed o he claims o o he s. And I hink ha eeling o in ol emen is wha is needed o eigni ed he public in e es he e."}