{"id": "13658", "subject": "Re: [EVP-ITC] Re: Is pride so wrong!?", "author": "April Abercrombie", "timestamp": "2009-04-07T18:44:46Z", "full_text": "------=_NextPart_000_0152_01C9B77E.A1FAA490\r\nContent-Type: text/plain;\n\tcharset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nI am happy that you do share your technology with the rest of us. That is w=\r\nhat everyone in this field should be doing. However, there seems to be this=\r\n covetousness going on instead, along with everyone trying to discredit eve=\r\nryone else. For the life of me, I can&#39;t understand why this is, unless ever=\r\nyone just wants the spotlight for themselves. They can have the spotlight, =\r\nI don&#39;t care, that is not what I am after.\n\nAt any rate, you have to just l=\r\net it roll right off. I don&#39;t understand why people are doing this to you. =\r\nIf they don&#39;t get the results they expected or want, then they don&#39;t have t=\r\no use the machine. No need for them to trash talk or to be asses about it. =\r\nIf they are really that disgusted with it, they should do the right and pro=\r\nfessional thing and just give it back to you. Then you could forward it on =\r\nto someone else who may really want to study it. \n\nApril\n\n  ----- Original =\r\nMessage ----- \n  From: Frank Sumption \n  To: EVP-ITC@yahoogroups.com \n  Sen=\r\nt: Tuesday, April 07, 2009 12:30 PM\n  Subject: Re: [EVP-ITC] Re: Is pride s=\r\no wrong!?\n\n\n\n   I get these people that swear they are my best friend ever,=\r\n they seem to get the boxes they want, and then it&#39;s like Satan takes them =\r\nover. I too do this mostlyu for my own curiosity, but I feel a certain obli=\r\ngation to share it, as it seem ot work like nothing else. \n\n   The only hea=\r\nlth problem I have is a frikkin&#39; hernia, and try to see a doctor without ju=\r\nmping through all their hoops to control your life. \n\n   F-S\n\n\n  On Tue, Ap=\r\nr 7, 2009 at 12:18 PM, April Abercrombie &lt;april@...=\r\nm&gt; wrote:\n\n\n    My thing is I am in it for my self only. I care not what ot=\r\nher people think about me or my methods. I stay out of all the back stabbin=\r\ng gossip and do my thing. I don&#39;t trash talk other teams, and I don&#39;t liste=\r\nn to them trash talk anyone else.\n\n    Frank should just do his thing and i=\r\ngnore the bull. He shouldn&#39;t let it bother him so much. In this field, noth=\r\ning has been proven, so therefore there is no right or wrong. He should do =\r\nit to please himself only.\n\n    April\n\n      ----- Original Message ----- \n=\r\n      From: Rj \n      To: EVP-ITC@yahoogroups.com \n      Sent: Tuesday, Apr=\r\nil 07, 2009 11:37 AM\n      Subject: Re: [EVP-ITC] Re: Is pride so wrong!?\n\n=\r\n\n            It sounds like a tricky situation, and I&#39;m not sure what to su=\r\nggest. I suppose one route is to, as you suggest, just walk away from all t=\r\nhis.  I guess you have to look at the big picture and decide if it&#39;s worth =\r\nthe frustration, the stress, and the angst, especially what it does to your=\r\n health.  Nothing is worth throwing your health away over.  \n\n            E=\r\nven dropping all this, just for a while, might also tell you if any health =\r\nproblems you are experiencing might be being aggravated by all the drama.  =\r\nAnd it might have the side effect of letting all the negativity and egos ou=\r\nt there burn themselves out, so if you do look back into things a while dow=\r\nn the road, it could be a prettier picture then.\n\n            Other than a =\r\nfull retreat, I don&#39;t think anything else would make a difference other tha=\r\nn a full attack: creating, for  instance, good objective standards for eval=\r\nuation and test of the technology and results, which the shows and &#39;experts=\r\n&#39; seem to find anathema.  Then, if their claims were to be confronted by su=\r\nch standards, they&#39;d find themselves unable to stand up to them, and eventu=\r\nally, hopefully, be embarrassed back into obscurity.\n\n\n\n\n            --- On=\r\n Mon, 4/6/09, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n\n\n         =\r\n     From: Frank Sumption &lt;purplealiengirl@...&gt;\n              Subject=\r\n: Re: [EVP-ITC] Re: Is pride so wrong!?\n              To: EVP-ITC@yahoogrou=\r\nps.com\n              Date: Monday, April 6, 2009, 2:40 PM\n\n\n\n              =\r\n Yeah, it&#39;s for that reason that it&#39;s very tempting to walk away from all t=\r\nhings paranormal. After dealing with some of these wanna be experts, self p=\r\nroclaimed gurus and authors, I&#39;m affraid to even check my e-mail most days.=\r\n If ya disagree with some of these people it quickly degrades into threats =\r\nof lawsuits.  I&#39;m at a point if being very reluctant to provides boxes to a=\r\nnyone, especially the experts and profesional type &quot;researchers&quot;--the one&#39;s=\r\n doing all these stupid shows and readings using my stuff, or similar syste=\r\nms.\n\n               When these dorks makes claims for fear sake such as dem=\r\nons, or shadow people come through the box, or are attracked by the boxes, =\r\n I tend to get a bit upset, and yet these people can&#39;t hear a word I&#39;m sayi=\r\nng,  \n              their huge egos block everything, as if I make this stu=\r\nff that works but can&#39;t possibley know anything about he so called paranorm=\r\nal. \n\n\n               Frank-S\n\n              On Mon, Apr 6, 2009 at 9:28 AM=\r\n, Rj &lt;rasterer@yahoo. com&gt; wrote:\n\n                      Frank, I think you=\r\n are right in that the reason for the negativity and sensationalism in thes=\r\ne shows is that it sells better.  Most people watch these shows for the esc=\r\nape and entertainment value, like the rest of tv.   And these shows learn o=\r\nver time what loses audience (same old claims, boring results, etc), and wh=\r\nat draws them back (wild claims, overall freak value, and &quot;we must protect =\r\nthe children!&quot;).  This is all completely orthodox for tv entertainment, but=\r\n does lend itself to any kind of true research, or any kind of actual edifi=\r\ncation.\n\n                      So I think we can expect these shows will co=\r\nntinue to ramp these sorts of elements up in order to compete, and we can e=\r\nxpect them to dwell less on mundane and activity-free situations, and prese=\r\nnt more claims of evil entities, mysterious injuries, and unexplainable fou=\r\nl odors, accompanied by more frightened investigators, trembling sensitives=\r\n, and humorously gullible associates and customers, and all wrapped in fanc=\r\nier technology, scarier settings, and state-o-the- art editing.\n\n          =\r\n            Also: a little humor of the day:   http://comics. com/get_fuzzy=\r\n/ 2009-04-06/\n\n\n\n                      --- On Sat, 4/4/09, Frank Sumption &lt;=\r\npurplealiengirl@ gmail.com&gt; wrote:\n\n\n                        From: Frank Su=\r\nmption &lt;purplealiengirl@ gmail.com&gt;\n                        Subject: Re: [E=\r\nVP-ITC] Re: Is pride so wrong!?\n                        To: EVP-ITC@yahoogr=\r\noups .com\n                        Date: Saturday, April 4, 2009, 2:08 PM\n\n\n=\r\n\n                        Thanks Rick! You seem to have put alot of thought =\r\nand time into that. \n\n                         What really bothers me is th=\r\ne self proclaimed experts out there that take all evidence and experience a=\r\nnd try to make it negative, and evil. Maybe many get tired, or even affraid=\r\n of seeking paranormal experience for that reason.\n\n                       =\r\n  I don&#39;t do ghost hunts or invesitgations, but the hauntings I&#39;ve heard of=\r\n seem to be nothing more than something trying to get someone&#39;s attention. =\r\nIt&#39;s these experts that turn it into something that must be negative.  Ther=\r\ne&#39;s Hollywood, such as the &quot;Haunting In CT&quot;, these same experts will procla=\r\nim is based on fact, when the facts are probably nothing more than your cre=\r\naking floors, just to make the whole paranoramal field dark and demon fille=\r\nd. In my case, fear does not sell, I won&#39; watch those movies. \n\n           =\r\n              I think there is good EVP evidence, and I&#39;ve heard many from =\r\nvarious researchers.  Trouble is, it&#39;s like talking on a phone or radio, ho=\r\nw do you know who it is other by what they say?\n\n                         F=\r\nrank-S\n\n                        On Sat, Apr 4, 2009 at 2:47 PM, Rick &lt;raste=\r\nrer@yahoo. com&gt; wrote:\n\n                          --- In EVP-ITC@yahoogroup=\r\ns .com, &quot;purplespacefriend&quot; &lt;purplealiengirl@ ...&gt; wrote:\n\n                =\r\n          &gt; Just wondering, seemed like interest in EVP/ITC was dropping of=\r\nf. Too bad the interest in EVP doesn&#39;t pick up while that ghost hunting men=\r\ntality drops off. I keep saying, you&#39;ll get better, more consistent, and mo=\r\nre meaningful messages if you record at home. The ghosts, spirits and entit=\r\nies can and do travel. You also have to listen to the recordings more than =\r\nonce. \n                          &gt; \n                          &gt; Frank\n\n    =\r\n                      That is an interesting observation. I think the core =\r\nof the issue is that there seems to be a `sweet spot&#39; in paranormal beliefs=\r\n where there is just enough science, just enough technical backing, just en=\r\nough paranormal claims, and just enough indefinite evidence that keeps peop=\r\nle interested in the ghost hunting mentality\n\n                          Evi=\r\ndence which becomes too indefinite turns off most people. As they become mo=\r\nre aware of sensitives who simply make claims (&quot;I feel there is a GHOST her=\r\ne!&quot;), but provide no evidence other than statements, people eventually get =\r\nbored. Similarly, people eventually grow tired of the anthropomorphism of e=\r\nvery little occurrence in a house: a creak implies a footstep, which implie=\r\ns a person, which, if not seen, implies a ghost. But a creak does not equal=\r\n a footstep.\n\n                          And while this kind of indefinite e=\r\nvidence can lose an audience, so can evidence that is claimed to be &quot;obviou=\r\nsly&quot; evident by technology. Here, the investigator is no longer making vagu=\r\ne claims, but waving science around, like FLIR cameras, or EMF meters, and =\r\nthen making proclamations of the results. But again, people eventually see =\r\nthese are just lights and sounds from electronics, and investigators making=\r\n more claims. It&#39;s like the psychics again, but with visual aids.\n\n        =\r\n                  I think the reason EVP studies are not securing more inte=\r\nrest, as you noted, are a little of both effects. First is the anthropomorp=\r\nhism problem: I notice many EVP experimenters proclaim what their results s=\r\nound like, or name the sound file by what they&#39;ve heard. But like the creak=\r\ns, &quot;sounds like&quot; does not equal &quot;is&quot;. This is then compounded by the techno=\r\nlogy backing: regardless of how valid the EVP researcher&#39;s results are, the=\r\n technology can seem intimidating, but the researchers often proclaim the o=\r\nbviousness of their results. People again become turned off by it because i=\r\nt is not obvious to them, and in the end it is just another piece of techno=\r\nlogy presenting sounds, with no obvious connection to the paranormal, excep=\r\nt by the claims and interpretations of the presenters.\n\n                   =\r\n       I believe, taking these issues into account, there is a way for EVP =\r\nstudies to garner more interest. For now, the analysis coming from the rese=\r\narchers usually seems like a claim, and it is these claims, imho, that is b=\r\neing classified by the public with the rest of the paranormal claims, and s=\r\no, it also becomes less of an interest. A new approach could be one without=\r\n the claims and interpretations of the investigators, one where the sounds =\r\nare simply played and not labeled. The interpretation of the data could be =\r\nleft to the listeners. Web sites which present EVPs could be developed wher=\r\ne people could not see others interpretations until they entered their own.=\r\n I think this would be such a novel approach, that it would give the public=\r\n a better feeling of true involvement in the research, and feel less like t=\r\nhey are simply being exposed to the claims of others. And I think that feel=\r\ning of involvement is what is needed to reignited the public interest here.=\r\n\n\n\n\n                     \n\n\n\n           \n\n\n\n\n\n\n  \r\n------=_NextPart_000_0152_01C9B77E.A1FAA490\r\nContent-Type: text/html;\n\tcharset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML 4.0 Transitional//EN&quot;&gt;\n&lt;HTML&gt;&lt;HEAD&gt;=\r\n\n&lt;META content=3D&quot;text/html; charset=3Diso-8859-1&quot; http-equiv=3DContent-Typ=\r\ne&gt;\n&lt;META name=3DGENERATOR content=3D&quot;MSHTML 8.00.6001.18702&quot;&gt;&lt;/HEAD&gt;\n&lt;BODY =\r\nstyle=3D&quot;BACKGROUND-COLOR: #ffffff&quot; bgColor=3D#ffffff&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 =\r\nface=3D&quot;Myriad Pro&quot;&gt;I am happy that you do share your technology \nwith the =\r\nrest of us. That is what everyone in this field should be doing. \nHowever, =\r\nthere seems to be this covetousness going on instead, along with \neveryone =\r\ntrying to discredit everyone else. For the life of me, I can&#39;t \nunderstand =\r\nwhy this is, unless everyone just wants the spotlight for themselves. \nThey=\r\n can have the spotlight, I don&#39;t care, that is not what I am \nafter.&lt;/FONT&gt;=\r\n&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 face=3D&quot;Myriad Pro&quot;&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FO=\r\nNT size=3D2 face=3D&quot;Myriad Pro&quot;&gt;At any rate, you have to just let it roll \n=\r\nright off. I don&#39;t understand why people are doing this to you. If they don=\r\n&#39;t \nget the results they expected or want, then they don&#39;t have to use the =\r\nmachine. \nNo need for them to trash talk or to be asses about it. If they a=\r\nre really that \ndisgusted with it, they should do the right and professiona=\r\nl&nbsp;thing and just \ngive it back to you. Then you could forward it on to=\r\n someone else who may really \nwant to study it. &lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT si=\r\nze=3D2 face=3D&quot;Myriad Pro&quot;&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 face=3D&quot;=\r\nMyriad Pro&quot;&gt;April&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 face=3D&quot;Myriad Pro&quot;&gt;&lt;/FO=\r\nNT&gt;&nbsp;&lt;/DIV&gt;\n&lt;BLOCKQUOTE \nstyle=3D&quot;BORDER-LEFT: #000000 2px solid; PADDI=\r\nNG-LEFT: 5px; PADDING-RIGHT: 0px; MARGIN-LEFT: 5px; MARGIN-RIGHT: 0px&quot; \ndir=\r\n=3Dltr&gt;\n  &lt;DIV style=3D&quot;FONT: 10pt arial&quot;&gt;----- Original Message ----- &lt;/DI=\r\nV&gt;\n  &lt;DIV \n  style=3D&quot;FONT: 10pt arial; BACKGROUND: #e4e4e4; font-color: bl=\r\nack&quot;&gt;&lt;B&gt;From:&lt;/B&gt; \n  &lt;A title=3Dpurplealiengirl@... \n  href=3D&quot;mailto=\r\n:purplealiengirl@...&quot;&gt;Frank Sumption&lt;/A&gt; &lt;/DIV&gt;\n  &lt;DIV style=3D&quot;FONT:=\r\n 10pt arial&quot;&gt;&lt;B&gt;To:&lt;/B&gt; &lt;A title=3DEVP-ITC@yahoogroups.com \n  href=3D&quot;mailt=\r\no:EVP-ITC@yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups.com&lt;/A&gt; &lt;/DIV&gt;\n  &lt;DIV style=\r\n=3D&quot;FONT: 10pt arial&quot;&gt;&lt;B&gt;Sent:&lt;/B&gt; Tuesday, April 07, 2009 12:30 \n  PM&lt;/DIV=\r\n&gt;\n  &lt;DIV style=3D&quot;FONT: 10pt arial&quot;&gt;&lt;B&gt;Subject:&lt;/B&gt; Re: [EVP-ITC] Re: Is pr=\r\nide so \n  wrong!?&lt;/DIV&gt;\n  &lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n  &lt;DIV id=3Dygrp-text&gt;\n  &lt;P&gt;\n  &lt;D=\r\nIV&gt;&nbsp;I get these people that swear they are my best friend ever, they \n=\r\n  seem to get the boxes they want, and then it&#39;s like Satan takes them over=\r\n. I \n  too do this mostlyu for my own curiosity, but I feel a certain oblig=\r\nation to \n  share it, as it seem ot work like nothing else. &lt;/DIV&gt;\n  &lt;DIV&gt;&=\r\nnbsp;&lt;/DIV&gt;\n  &lt;DIV&gt;&nbsp;The only health problem I have is a frikkin&#39; herni=\r\na, and try to see \n  a doctor without jumping through all their hoops to co=\r\nntrol your life. &lt;/DIV&gt;\n  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n  &lt;DIV&gt;&nbsp;F-S&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;\n=\r\n  &lt;DIV class=3Dgmail_quote&gt;On Tue, Apr 7, 2009 at 12:18 PM, April Abercromb=\r\nie \n  &lt;SPAN dir=3Dltr&gt;&lt;&lt;A \n  href=3D&quot;mailto:april@abercrombieghostresear=\r\nch.com&quot;&gt;april@abercrombiegh&lt;WBR&gt;ostresearch.&lt;WBR&gt;com&lt;/A&gt;&gt;&lt;/SPAN&gt; \n  wrot=\r\ne:&lt;BR&gt;\n  &lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: #ccc 1px solid&quot; class=3Dgmail_qu=\r\note&gt;\n    &lt;DIV style=3D&quot;BACKGROUND-COLOR: #ffffff&quot;&gt;\n    &lt;DIV&gt;\n    &lt;DIV&gt;\n    =\r\n&lt;DIV&gt;\n    &lt;P&gt;\n    &lt;DIV&gt;&lt;FONT size=3D2 face=3D&quot;Myriad Pro&quot;&gt;My thing is I am =\r\nin it for my self only. \n    I care not what other people think about me or=\r\n my methods. I stay out of all \n    the back stabbing gossip and do my thin=\r\ng. I don&#39;t trash talk other teams, \n    and I don&#39;t listen to them trash ta=\r\nlk anyone else.&lt;/FONT&gt;&lt;/DIV&gt;\n    &lt;DIV&gt;&lt;FONT size=3D2 face=3D&quot;Myriad Pro&quot;&gt;&lt;/=\r\nFONT&gt;&nbsp;&lt;/DIV&gt;\n    &lt;DIV&gt;&lt;FONT size=3D2 face=3D&quot;Myriad Pro&quot;&gt;Frank should =\r\njust do his thing and \n    ignore the bull. He shouldn&#39;t let it bother him =\r\nso much. In this field, \n    nothing has been proven, so therefore there is=\r\n no right or wrong. He should \n    do it to please himself only.&lt;/FONT&gt;&lt;/DI=\r\nV&gt;\n    &lt;DIV&gt;&lt;FONT size=3D2 face=3D&quot;Myriad Pro&quot;&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n    &lt;DIV=\r\n&gt;&lt;FONT size=3D2 face=3D&quot;Myriad Pro&quot;&gt;April&lt;/FONT&gt;&lt;/DIV&gt;\n    &lt;DIV&gt;&lt;FONT size=\r\n=3D2 face=3D&quot;Myriad Pro&quot;&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n    &lt;BLOCKQUOTE style=3D&quot;BORDE=\r\nR-LEFT: #000000 2px solid&quot; dir=3Dltr&gt;\n      &lt;DIV class=3Dim&gt;\n      &lt;DIV sty=\r\nle=3D&quot;FONT: 10pt arial&quot;&gt;----- Original Message ----- &lt;/DIV&gt;\n      &lt;DIV styl=\r\ne=3D&quot;FONT: 10pt arial; BACKGROUND: #e4e4e4&quot;&gt;&lt;B&gt;From:&lt;/B&gt; &lt;A \n      title=3D=\r\nrasterer@... href=3D&quot;mailto:rasterer@...&quot; \n      target=3D_blan=\r\nk&gt;Rj&lt;/A&gt; &lt;/DIV&gt;\n      &lt;DIV style=3D&quot;FONT: 10pt arial&quot;&gt;&lt;B&gt;To:&lt;/B&gt; &lt;A title=\r\n=3DEVP-ITC@yahoogroups.com \n      href=3D&quot;mailto:EVP-ITC@yahoogroups.com&quot; \n=\r\n      target=3D_blank&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt; &lt;/DIV&gt;&lt;/DIV&gt;\n      &lt;=\r\nDIV&gt;\n      &lt;DIV&gt;&lt;/DIV&gt;\n      &lt;DIV class=3Dh5&gt;\n      &lt;DIV style=3D&quot;FONT: 10p=\r\nt arial&quot;&gt;&lt;B&gt;Sent:&lt;/B&gt; Tuesday, April 07, 2009 11:37 \n      AM&lt;/DIV&gt;\n      &lt;=\r\nDIV style=3D&quot;FONT: 10pt arial&quot;&gt;&lt;B&gt;Subject:&lt;/B&gt; Re: [EVP-ITC] Re: Is pride \n=\r\n      so wrong!?&lt;/DIV&gt;\n      &lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n      &lt;DIV&gt;\n      &lt;P&gt;\n      &lt;T=\r\nABLE border=3D0 cellSpacing=3D0 cellPadding=3D0&gt;\n        &lt;TBODY&gt;\n        &lt;T=\r\nR&gt;\n          &lt;TD vAlign=3Dtop&gt;It sounds like a tricky situation, and I&#39;m no=\r\nt sure \n            what to suggest. I suppose one route is to, as you sugg=\r\nest, just \n            walk away from all this.&nbsp; I guess you have to l=\r\nook at the big \n            picture and decide if it&#39;s worth the frustratio=\r\nn, the stress, and \n            the angst, especially what it does to your =\r\nhealth.&nbsp; Nothing is \n            worth throwing your health away over.=\r\n&nbsp; &lt;BR&gt;&lt;BR&gt;Even dropping \n            all this, just for a while, might=\r\n also tell you if any health \n            problems you are experiencing mig=\r\nht be being aggravated by all the \n            drama.&nbsp; And it might ha=\r\nve the side effect of letting all the \n            negativity and egos out =\r\nthere burn themselves out, so if you do look \n            back into things =\r\na while down the road, it could be a prettier \n            picture then.&lt;BR=\r\n&gt;&lt;BR&gt;Other than a full retreat, I don&#39;t think \n            anything else wo=\r\nuld make a difference other than a full attack: \n            creating, for&=\r\nnbsp; instance, good objective standards for \n            evaluation and te=\r\nst of the technology and results, which the shows \n            and &#39;experts=\r\n&#39; seem to find anathema.&nbsp; Then, if their claims \n            were to b=\r\ne confronted by such standards, they&#39;d find themselves \n            unable =\r\nto stand up to them, and eventually, hopefully, be \n            embarrassed=\r\n back into obscurity.&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Mon, \n            4/6/09=\r\n, Frank Sumption &lt;I&gt;&lt;&lt;A \n            href=3D&quot;mailto:purplealiengirl@gmai=\r\nl.com&quot; \n            target=3D_blank&gt;purplealiengirl@&lt;WBR&gt;gmail.com&lt;/A&gt;&gt;&lt;=\r\n/I&gt;&lt;/B&gt; \n            wrote:&lt;BR&gt;\n            &lt;BLOCKQUOTE \n              styl=\r\ne=3D&quot;BORDER-LEFT: rgb(16,16,255) 2px solid&quot;&gt;&lt;BR&gt;From: Frank \n              =\r\nSumption &lt;&lt;A href=3D&quot;mailto:purplealiengirl@...&quot; \n              ta=\r\nrget=3D_blank&gt;purplealiengirl@&lt;WBR&gt;gmail.com&lt;/A&gt;&gt;&lt;BR&gt;Subject: \n         =\r\n     Re: [EVP-ITC] Re: Is pride so wrong!?&lt;BR&gt;To: &lt;A \n              href=3D=\r\n&quot;mailto:EVP-ITC@yahoogroups.com&quot; \n              target=3D_blank&gt;EVP-ITC@yah=\r\noogroups&lt;WBR&gt;.com&lt;/A&gt;&lt;BR&gt;Date: Monday, \n              April 6, 2009, 2:40 P=\r\nM&lt;BR&gt;&lt;BR&gt;\n              &lt;DIV&gt;\n              &lt;DIV&gt;\n              &lt;P&gt;&lt;/P&gt;\n   =\r\n           &lt;DIV&gt;&nbsp;Yeah, it&#39;s for that reason that it&#39;s very tempting to=\r\n \n              walk away from all things paranormal. After dealing with so=\r\nme of \n              these wanna be experts, self proclaimed gurus and auth=\r\nors, I&#39;m \n              affraid to even check my e-mail most days. If ya di=\r\nsagree with \n              some of these people it quickly degrades into th=\r\nreats of \n              lawsuits.&nbsp; I&#39;m at a point if being very reluct=\r\nant to provides \n              boxes to anyone, especially the experts and =\r\nprofesional type \n              &quot;researchers&quot;--the one&#39;s doing all these st=\r\nupid shows and readings \n              using my stuff, or similar systems.&lt;=\r\n/DIV&gt;\n              &lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n              &lt;DIV&gt;&nbsp;When these d=\r\norks makes claims for fear sake such as \n              demons, or shadow pe=\r\nople come through the box, or are attracked by \n              the boxes,&nb=\r\nsp; I tend to get a bit upset, and yet these people \n              can&#39;t he=\r\nar a word I&#39;m saying,&nbsp; &lt;BR&gt;their huge egos block \n              everyt=\r\nhing, as if I make this stuff that works but can&#39;t possibley \n             =\r\n know anything about he so called paranormal. &lt;BR&gt;&lt;/DIV&gt;\n              &lt;DIV=\r\n&gt;&nbsp;&lt;/DIV&gt;\n              &lt;DIV&gt;&nbsp;Frank-S&lt;BR&gt;&lt;/DIV&gt;\n              &lt;DIV=\r\n class=3Dgmail_quote&gt;On Mon, Apr 6, 2009 at 9:28 AM, Rj &lt;SPAN \n            =\r\n  dir=3Dltr&gt;&lt;&lt;A href=3D&quot;http://mc/compose?to=3Drasterer@...&quot; \n    =\r\n          rel=3Dnofollow target=3D_blank&gt;rasterer@yahoo. com&lt;/A&gt;&gt;&lt;/SPAN&gt;=\r\n \n              wrote:&lt;BR&gt;\n              &lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: =\r\nrgb(204,204,204) 1px solid&quot; \n              class=3Dgmail_quote&gt;\n           =\r\n     &lt;DIV style=3D&quot;BACKGROUND-COLOR: rgb(255,255,255)&quot;&gt;\n                &lt;DI=\r\nV&gt;\n                &lt;DIV&gt;\n                &lt;DIV&gt;\n                &lt;P&gt;\n        =\r\n        &lt;TABLE border=3D0 cellSpacing=3D0 cellPadding=3D0&gt;\n                =\r\n  &lt;TBODY&gt;\n                  &lt;TR&gt;\n                    &lt;TD vAlign=3Dtop&gt;Frank=\r\n, I think you are right in that the \n                      reason for the n=\r\negativity and sensationalism in these \n                      shows is that =\r\nit sells better.&nbsp; Most people watch \n                      these shows=\r\n for the escape and entertainment value, like \n                      the re=\r\nst of tv.&nbsp;&nbsp; And these shows learn over \n                      tim=\r\ne what loses audience (same old claims, boring results, \n                  =\r\n    etc), and what draws them back (wild claims, overall freak \n           =\r\n           value, and &quot;we must protect the children!&quot;).&nbsp; This is \n    =\r\n                  all completely orthodox for tv entertainment, but does \n =\r\n                     lend itself to any kind of true research, or any kind =\r\nof \n                      actual edification.&lt;BR&gt;&lt;BR&gt;So I think we can expe=\r\nct these \n                      shows will continue to ramp these sorts of =\r\nelements up in \n                      order to compete, and we can expect t=\r\nhem to dwell less on \n                      mundane and activity-free situa=\r\ntions, and present more \n                      claims of evil entities, mys=\r\nterious injuries, and \n                      unexplainable foul odors, acco=\r\nmpanied by more frightened \n                      investigators, trembling =\r\nsensitives, and humorously \n                      gullible associates and c=\r\nustomers, and all wrapped in \n                      fancier technology, sca=\r\nrier settings, and state-o-the- art \n                      editing.&lt;BR&gt;&lt;BR&gt;=\r\nAlso: a little humor of the \n                      day:&nbsp;&nbsp; &lt;A \n   =\r\n                   href=3D&quot;http://comics.com/get_fuzzy/2009-04-06/&quot; \n      =\r\n                rel=3Dnofollow target=3D_blank&gt;http://comics. com/get_fuzzy=\r\n/ \n                      2009-04-06/&lt;/A&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Sat, 4/4/=\r\n09, \n                      Frank Sumption &lt;I&gt;&lt;&lt;A \n                      =\r\nhref=3D&quot;http://mc/compose?to=3Dpurplealiengirl@...&quot; \n                =\r\n      rel=3Dnofollow target=3D_blank&gt;purplealiengirl@ \n                    =\r\n  gmail.com&lt;/A&gt;&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;\n                      &lt;BLOCKQUOTE \n =\r\n                       style=3D&quot;BORDER-LEFT: rgb(16,16,255) 2px solid&quot;&gt;&lt;BR&gt;=\r\nFrom: \n                        Frank Sumption &lt;&lt;A \n                     =\r\n   href=3D&quot;http://mc/compose?to=3Dpurplealiengirl@...&quot; \n             =\r\n           rel=3Dnofollow target=3D_blank&gt;purplealiengirl@ \n               =\r\n         gmail.com&lt;/A&gt;&gt;&lt;BR&gt;Subject: Re: [EVP-ITC] Re: Is pride \n        =\r\n                so wrong!?&lt;BR&gt;To: &lt;A \n                        href=3D&quot;http:=\r\n//mc/compose?to=3DEVP-ITC@yahoogroups.com&quot; \n                        rel=3Dn=\r\nofollow target=3D_blank&gt;EVP-ITC@yahoogroups \n                        .com&lt;/=\r\nA&gt;&lt;BR&gt;Date: Saturday, April 4, 2009, 2:08 \n                        PM&lt;BR&gt;&lt;B=\r\nR&gt;\n                        &lt;DIV&gt;\n                        &lt;DIV&gt;\n            =\r\n            &lt;DIV&gt;\n                        &lt;P&gt;&lt;/P&gt;\n                        &lt;=\r\nDIV&gt;Thanks Rick! You seem to have put alot of thought \n                    =\r\n    and time into that. &lt;/DIV&gt;\n                        &lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n  =\r\n                      &lt;DIV&gt;&nbsp;What really bothers me is the self proclai=\r\nmed \n                        experts out there that take all evidence and \n=\r\n                        experience&nbsp;and try to make it negative, and ev=\r\nil. \n                        Maybe many get tired, or even affraid of seeki=\r\nng \n                        paranormal experience for that reason.&lt;/DIV&gt;\n  =\r\n                      &lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n                        &lt;DIV&gt;&nbsp;=\r\nI don&#39;t do ghost hunts or invesitgations, but \n                        the =\r\nhauntings I&#39;ve heard of seem to be nothing more than \n                     =\r\n   something trying to get someone&#39;s attention. It&#39;s these \n               =\r\n         experts that turn it into something that must be \n                =\r\n        negative.&nbsp; There&#39;s Hollywood, such as the &quot;Haunting \n         =\r\n               In CT&quot;, these same experts will proclaim is based on \n      =\r\n                  fact, when the facts are probably nothing more than your =\r\n\n                        creaking floors, just&nbsp;to make the whole paran=\r\noramal \n                        field dark and demon filled. In my case, fe=\r\nar does not \n                        sell, I won&#39; watch those movies. &lt;/DIV=\r\n&gt;\n                        &lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n                        &lt;DIV&gt;&n=\r\nbsp;I think there is good EVP evidence, and I&#39;ve \n                        h=\r\neard many from various researchers.&nbsp; Trouble is, \n                    =\r\n    it&#39;s like talking on a phone or radio, how&nbsp;do you \n               =\r\n         know who it is other by what they say?&lt;/DIV&gt;\n                     =\r\n   &lt;DIV&gt;&nbsp;&lt;/DIV&gt;&lt;/DIV&gt;\n                        &lt;DIV&gt;&nbsp;Frank-S&lt;BR&gt;&lt;/=\r\nDIV&gt;\n                        &lt;DIV&gt;\n                        &lt;DIV class=3Dgma=\r\nil_quote&gt;On Sat, Apr 4, 2009 at 2:47 PM, \n                        Rick &lt;SPA=\r\nN dir=3Dltr&gt;&lt;&lt;A \n                        href=3D&quot;http://mc/compose?to=3D=\r\nrasterer@...&quot; \n                        rel=3Dnofollow target=3D_blank=\r\n&gt;rasterer@yahoo. \n                        com&lt;/A&gt;&gt;&lt;/SPAN&gt; wrote:&lt;BR&gt;\n   =\r\n                     &lt;BLOCKQUOTE \n                        style=3D&quot;BORDER-L=\r\nEFT: rgb(204,204,204) 1px solid&quot; \n                        class=3Dgmail_quo=\r\nte&gt;\n                          &lt;DIV style=3D&quot;BACKGROUND-COLOR: rgb(255,255,2=\r\n55)&quot;&gt;\n                          &lt;DIV&gt;\n                          &lt;DIV&gt;\n     =\r\n                     &lt;DIV&gt;\n                          &lt;P&gt;--- In &lt;A \n        =\r\n                  href=3D&quot;http://mc/compose?to=3DEVP-ITC%40yahoogroups.com&quot;=\r\n \n                          rel=3Dnofollow target=3D_blank&gt;EVP-ITC@yahoogro=\r\nups \n                          .com&lt;/A&gt;, &quot;purplespacefriend&quot; &lt;purplealie=\r\nngirl@ \n                          ...&gt; wrote:&lt;BR&gt;&lt;BR&gt;&gt; Just wondering=\r\n, seemed like \n                          interest in EVP/ITC was dropping o=\r\nff. Too bad the \n                          interest in EVP doesn&#39;t pick up =\r\nwhile that ghost \n                          hunting mentality drops off. I =\r\nkeep saying, you&#39;ll get \n                          better, more consistent,=\r\n and more meaningful messages \n                          if you record at h=\r\nome. The ghosts, spirits and \n                          entities can and do=\r\n travel. You also have to listen to \n                          the recordin=\r\ngs more than once. &lt;BR&gt;&gt; &lt;BR&gt;&gt; \n                          Frank&lt;BR&gt;&lt;B=\r\nR&gt;That is an interesting observation. I \n                          think th=\r\ne core of the issue is that there seems to be \n                          a =\r\n`sweet spot&#39; in paranormal beliefs where there is \n                        =\r\n  just enough science, just enough technical backing, \n                    =\r\n      just enough paranormal claims, and just enough \n                     =\r\n     indefinite evidence that keeps people interested in \n                 =\r\n         the ghost hunting mentality&lt;BR&gt;&lt;BR&gt;Evidence which \n               =\r\n           becomes too indefinite turns off most people. As they \n         =\r\n                 become more aware of sensitives who simply make claims \n  =\r\n                        (&quot;I feel there is a GHOST here!&quot;), but provide no \n=\r\n                          evidence other than statements, people eventually=\r\n get \n                          bored. Similarly, people eventually grow ti=\r\nred of the \n                          anthropomorphism of every little occu=\r\nrrence in a \n                          house: a creak implies a footstep, w=\r\nhich implies a \n                          person, which, if not seen, impli=\r\nes a ghost. But a \n                          creak does not equal a footste=\r\np.&lt;BR&gt;&lt;BR&gt;And while this \n                          kind of indefinite evid=\r\nence can lose an audience, so \n                          can evidence that =\r\nis claimed to be &quot;obviously&quot; evident \n                          by technolo=\r\ngy. Here, the investigator is no longer \n                          making v=\r\nague claims, but waving science around, like \n                          FLI=\r\nR cameras, or EMF meters, and then making \n                          procla=\r\nmations of the results. But again, people \n                          eventu=\r\nally see these are just lights and sounds from \n                          e=\r\nlectronics, and investigators making more claims. \n                        =\r\n  It&#39;s like the psychics again, but with visual \n                          =\r\naids.&lt;BR&gt;&lt;BR&gt;I think the reason EVP studies are not \n                      =\r\n    securing more interest, as you noted, are a little of \n                =\r\n          both effects. First is the anthropomorphism problem: I \n         =\r\n                 notice many EVP experimenters proclaim what their \n       =\r\n                   results sound like, or name the sound file by what \n    =\r\n                      they&#39;ve heard. But like the creaks, &quot;sounds like&quot; doe=\r\ns \n                          not equal &quot;is&quot;. This is then compounded by the=\r\n \n                          technology backing: regardless of how valid the=\r\n EVP \n                          researcher&#39;s results are, the technology ca=\r\nn seem \n                          intimidating, but the researchers often p=\r\nroclaim the \n                          obviousness of their results. People=\r\n again become \n                          turned off by it because it is not=\r\n obvious to them, \n                          and in the end it is just anot=\r\nher piece of technology \n                          presenting sounds, with =\r\nno obvious connection to the \n                          paranormal, except =\r\nby the claims and interpretations \n                          of the present=\r\ners.&lt;BR&gt;&lt;BR&gt;I believe, taking these \n                          issues into =\r\naccount, there is a way for EVP studies to \n                          garne=\r\nr more interest. For now, the analysis coming \n                          fr=\r\nom the researchers usually seems like a claim, and \n                       =\r\n   it is these claims, imho, that is being classified by \n                 =\r\n         the public with the rest of the paranormal claims, and \n          =\r\n                so, it also becomes less of an interest. A new \n           =\r\n               approach could be one without the claims and \n              =\r\n            interpretations of the investigators, one where the \n          =\r\n                sounds are simply played and not labeled. The \n            =\r\n              interpretation of the data could be left to the \n            =\r\n              listeners. Web sites which present EVPs could be \n           =\r\n               developed where people could not see others \n               =\r\n           interpretations until they entered their own. I think \n         =\r\n                 this would be such a novel approach, that it would \n      =\r\n                    give the public a better feeling of true involvement \n =\r\n                         in the research, and feel less like they are simpl=\r\ny \n                          being exposed to the claims of others. And I t=\r\nhink \n                          that feeling of involvement is what is need=\r\ned to \n                          reignited the public interest here.&lt;BR&gt;&lt;BR=\r\n&gt;&lt;/P&gt;&lt;/DIV&gt;\n                          &lt;DIV \n                        style=\r\n=3D&quot;COLOR: white&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DI=\r\nV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/TD&gt;&lt;/TR&gt;&lt;/TBODY&gt;&lt;/TABLE&gt;&lt;BR&gt;&lt;/P&gt;&lt;/DIV&gt;\n             =\r\n   &lt;DIV \n              style=3D&quot;COLOR: white&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLO=\r\nCKQUOTE&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/TD&gt;&lt;/TR&gt;&lt;/TBODY&gt;&lt;/TABLE&gt;&lt;BR&gt;&lt;/=\r\nP&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;\n    &lt;P&gt;&lt;/P&gt;\n    &lt;P&gt;&lt;/P&gt;&lt;/DIV&gt;\n    &lt;DIV st=\r\nyle=3D&quot;COLOR: white&quot; \n  width=3D&quot;1&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/=\r\nDIV&gt;&lt;BR&gt;\n  &lt;P&gt;&lt;/P&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BODY&gt;&lt;/HTML&gt;\n\r\n------=_NextPart_000_0152_01C9B77E.A1FAA490--"}