{"id": "13664", "subject": "Re: [EVP-ITC] Some more from last month.", "author": "Frank Sumption", "timestamp": "2009-04-07T21:37:48Z", "full_text": "Well, there&#39;s other cultures that have that exact same date, according to\nthe History Channel, like the Iching, the Jews(?), the Egyptians, and\nvarious european prhophets.  I think I&#39;m the only one currently getting the\ndoomsville stuff.\n\n F-S\n\nOn Tue, Apr 7, 2009 at 12:36 PM, April Abercrombie &lt;\napril@...&gt; wrote:\n\n&gt;    I agree that 2012 probably the end of some earth cycle. However I do\n&gt; have my doubts that it is the end of the world completely.\n&gt;\n&gt; You know the date 2012 comes from the end of the Mayan calendar. They\n&gt; probably did align their calendar with the natural cycles of the earth. I\n&gt; think they probably just left off at 2012 and didn&#39;t bother to extend it for\n&gt; the next cycle, whatever that would be.\n&gt;\n&gt; That&#39;s my hunch anyway and that what I am going with it LOL!\n&gt;\n&gt; April\n&gt;\n&gt;\n&gt;  ----- Original Message -----\n&gt; *From:* Frank Sumption &lt;purplealiengirl@...&gt;\n&gt; *To:* EVP-ITC@yahoogroups.com\n&gt;   *Sent:* Tuesday, April 07, 2009 12:26 PM\n&gt; *Subject:* Re: [EVP-ITC] Some more from last month.\n&gt;\n&gt;  The reverse is often more distorted, I think I&#39;m just used to listening\n&gt; to them.\n&gt;\n&gt;  This is the stuff I&#39;ve been getting since the first box &quot;earth goes boom&quot;,\n&gt; and I think it&#39;s 2012. which is at least pretty much accepted by all that\n&gt; it&#39;s the end of come current earth cycle.\n&gt;\n&gt;  F-S\n&gt;\n&gt; On Tue, Apr 7, 2009 at 12:20 PM, April Abercrombie &lt;\n&gt; april@abercrombieghostresearch.com&gt; wrote:\n&gt;\n&gt;&gt;    I received them just fine, with text and all. But it doesn&#39;t surprise\n&gt;&gt; me. Yahoo has been having alot of problems lately.\n&gt;&gt;\n&gt;&gt; Thanks for the clarification on that. That maybe why I didn&#39;t get all the\n&gt;&gt; stuff out of it that you did.\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;  ----- Original Message -----\n&gt;&gt; *From:* Frank Sumption &lt;purplealiengirl@...&gt;\n&gt;&gt;  *To:* EVP-ITC@yahoogroups.com\n&gt;&gt; *Sent:* Tuesday, April 07, 2009 12:13 PM\n&gt;&gt; *Subject:* Re: [EVP-ITC] Some more from last month.\n&gt;&gt;\n&gt;&gt;  That means what comes after is the reverse speech component. So di dthe\n&gt;&gt; voices come through, but no text? I got a message form yahoo that it\n&gt;&gt; couldn&#39;t deliver the message, I put too many in.\n&gt;&gt;\n&gt;&gt;  F-S\n&gt;&gt;\n&gt;&gt; On Tue, Apr 7, 2009 at 11:13 AM, April Abercrombie &lt;\n&gt;&gt; april@...&gt; wrote:\n&gt;&gt;\n&gt;&gt;&gt;    What does the (R) signify?\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;  ----- Original Message -----\n&gt;&gt;&gt; *From:* Frank Sumption &lt;purplealiengirl@...&gt;\n&gt;&gt;&gt; *To:* grassharp@yahoogroups.com ; evp-itc@yahoogroups.com\n&gt;&gt;&gt; *Sent:* Tuesday, April 07, 2009 8:44 AM\n&gt;&gt;&gt; *Subject:* [EVP-ITC] Some more from last month.\n&gt;&gt;&gt;\n&gt;&gt;&gt;     I rarely know if anyone hears this stuff, as few comment. The one\n&gt;&gt;&gt; about sausage is kinda iffy.&quot;Princess, I never Liked that box...&quot; is the\n&gt;&gt;&gt; same on as &quot;Princess I love that box...&quot;, I just hear it different this\n&gt;&gt;&gt; morning. That&#39;s the only one I hear different from last night. I included\n&gt;&gt;&gt; the forward, and reverse components.\n&gt;&gt;&gt;\n&gt;&gt;&gt;  These are from the test I did to see if I could use a pre-recorded RAW\n&gt;&gt;&gt; audio tape in areas wherer there&#39;s no radio stations, sincve many insist on\n&gt;&gt;&gt; going to &quot;haunted locations&quot; that have few, if any radio stations to use for\n&gt;&gt;&gt; the raw audio. #48 has an aux input so other raw audio can be used.\n&gt;&gt;&gt;\n&gt;&gt;&gt;  Frank-S\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;\n&gt;   \n&gt;\n\nWell, he e's o he cul u es ha ha e ha exac same da e, acco ding o he His o y Channel, like he Iching, he Jews(?), he Egyp ians, and a ious eu opean p hophe s.  I hink I'm he only one cu en ly ge ing he dooms ille s u . \n\n \n F-S\nOn Tue, Ap 7, 2009 a 12:36 PM, Ap il Abe c ombie ap il@...> w o e:\n\n\n\n\n\n\nI ag ee ha 2012 p obably he end o some ea h cycle. Howe e I do ha e my doub s ha i is he end o he wo ld comple ely.\n \nYou know he da e 2012 comes om he end o he Mayan calenda . They p obably did align hei calenda wi h he na u al cycles o he ea h. I hink hey p obably jus le o a 2012 and didn' bo he o ex end i o he nex cycle, wha e e ha would be.\n\n \nTha 's my hunch anyway and ha wha I am going wi h i LOL!\n \nAp il\n \n\n\n----- O iginal Message ----- \nF om: F ank Sump ion \nTo: EVP-ITC@yahoog oups.com \n\n\n\nSen : Tuesday, Ap il 07, 2009 12:26 PM\nSubjec : Re: [EVP-ITC] Some mo e om las mon h.\n\n\n\nThe e e se is o en mo e dis o ed, I hink I'm jus used o lis ening o hem. \n \n This is he s u I' e been ge ing since he i s box \"ea h goes boom\", and I hink i 's 2012. which is a leas p e y much accep ed by all ha i 's he end o come cu en ea h cycle. \n\n \n F-S\nOn Tue, Ap 7, 2009 a 12:20 PM, Ap il Abe c ombie ap il@...> w o e:\n\n\n\n\n\n\n\nI ecei ed  hem jus ine, wi h ex and all. Bu i doesn' su p ise me. Yahoo has been ha ing alo o p oblems la ely.\n \nThanks o he cla i ica ion on ha . Tha maybe why I didn' ge all he s u ou o i ha you did.\n \n\n\n----- O iginal Message ----- \nF om: F ank Sump ion \n\nTo: EVP-ITC@yahoog oups.com \nSen : Tuesday, Ap il 07, 2009 12:13 PM\nSubjec : Re: [EVP-ITC] Some mo e om las mon h.\n\n\n\nTha means wha comes a e is he e e se speech componen . So di d he oices come h ough, bu no ex ? I go a message o m yahoo ha i couldn' deli e he message, I pu oo many in.\n \n F-S\nOn Tue, Ap 7, 2009 a 11:13 AM, Ap il Abe c ombie ap il@...> w o e:\n\n\n\n\n\n\n\nWha does he (R) signi y?\n \n\n\n----- O iginal Message ----- \nF om: F ank Sump ion \nTo: g assha p@yahoog oups.com ; e p-i c@yahoog oups.com \n\nSen : Tuesday, Ap il 07, 2009 8:44 AM\nSubjec : [EVP-ITC] Some mo e om las mon h.\n\n\n\n\n\n\n I a ely know i anyone hea s his s u , as ew commen . The one abou sausage is kinda i y.\"P incess, I ne e Liked ha box...\" is he same on as \"P incess I lo e ha box...\", I jus hea i di e en his mo ning. Tha 's he only one I hea di e en om las nigh . I included he o wa d, and e e se componen s. \n\n \n These a e om he es I did o see i I could use a p e- eco ded RAW audio ape in a eas whe e he e's no adio s a ions, sinc e many insis on going o \"haun ed loca ions\" ha ha e ew, i any adio s a ions o use o he aw audio. #48 has an aux inpu so o he aw audio can be used.\n\n \n F ank-S"}