{"id": "13692", "subject": "A approach to presentation", "author": "John S", "timestamp": "2009-04-08T15:25:00Z", "full_text": "--0-251156046-1239204300=:41229\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n=A0=A0=A0I must admit I don&#39;t understand the thread/response numbering syst=\r\nem here, so I&#39;m going to post at the top level so as not to get in the way.=\r\n\n\nA question was asked regarding how to post and more specifically label, E=\r\nVPs. I would suggest that they be labeled in a numeric fashion. That way th=\r\nere are no external cues. Rather than exposing what they say initially, hav=\r\ne a voting period where anyone can listen and enter what they think they he=\r\nar. Don&#39;t reveal any of the answers for a period of time, perhaps two weeks=\r\n. Caution people not to talk about what they hear on this site in other for=\r\nums including of course forums on the EVP posting site. Once a period of ti=\r\nme has elapsed, continue to enforce the guess-required rule in order to see=\r\n the other results, but go ahead and make the guesses public. Do not assume=\r\n that anyone necessarily has the &#39;right&#39; answer, since at some level it&#39;s a=\r\nll subjective perception anyway. It is possible that the original poster, e=\r\nven if highly experienced, may have actually heard it wrong. Also, it would=\r\n be quite useful if EVPs could be easily downloaded as some may have\n acces=\r\ns to more sophisticated software which they could use to clean various EVPs=\r\n up and repost so as to have a higher quality or enhanced version. A versio=\r\nn tracking system should be implemented if you decide to do this so that yo=\r\nu known that=A0 EVP # 12345 is the original for example, while EVP #12354-1=\r\n is the first variation of that same original EVP. Some ideas for you..\n\n=\r\n=A0 JS\n\n\n      \r\n--0-251156046-1239204300=:41229\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;&lt;head&gt;&lt;style type=3D&quot;text/css&quot;&gt;&lt;!-- DIV {margin:0px;} --&gt;&lt;/style&gt;&lt;/he=\r\nad&gt;&lt;body&gt;&lt;div style=3D&quot;font-family:times new roman, new york, times, serif;=\r\nfont-size:12pt&quot;&gt;&lt;DIV&gt;&nbsp;&nbsp;&nbsp;I must admit I don&#39;t understand the =\r\nthread/response numbering system here, so I&#39;m going to post at the top leve=\r\nl so as not to get in the way.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;A question was =\r\nasked regarding how to post and more specifically label, EVPs. I would sugg=\r\nest that they be labeled in a numeric fashion. That way there are no extern=\r\nal cues. Rather than exposing what they say initially, have a voting period=\r\n where anyone can listen and enter what they think they hear. Don&#39;t reveal =\r\nany of the answers for a period of time, perhaps two weeks. Caution people =\r\nnot to talk about what they hear on this site in other forums including of =\r\ncourse forums on the EVP posting site. Once a period of time has elapsed, c=\r\nontinue to enforce the guess-required rule in order to see the other result=\r\ns, but go ahead and make the guesses public. Do not assume that anyone nece=\r\nssarily has the &#39;right&#39; answer, since at some level it&#39;s all subjective per=\r\nception anyway. It is possible that the original poster, even if highly exp=\r\nerienced, may have actually heard it wrong. Also, it would be quite useful =\r\nif EVPs could be easily downloaded as some may\n have access to more sophist=\r\nicated software which they could use to clean various EVPs up and repost so=\r\n as to have a higher quality or enhanced version. A version tracking system=\r\n should be implemented if you decide to do this so that you known that&nbsp=\r\n; EVP # 12345 is the original for example, while EVP #12354-1 is the first =\r\nvariation of that same original EVP. Some ideas for you.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;=\r\n/DIV&gt;\n&lt;DIV&gt;&nbsp; JS&lt;/DIV&gt;\n&lt;DIV style=3D&quot;FONT-SIZE: 12pt; FONT-FAMILY: time=\r\ns new roman, new york, times, serif&quot;&gt;&lt;BR&gt;\n&lt;DIV style=3D&quot;FONT-SIZE: 10pt; FO=\r\nNT-FAMILY: arial, helvetica, sans-serif&quot;&gt;&nbsp;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/div&gt;&lt;br&gt;\n\n    =\r\n  &lt;/body&gt;&lt;/html&gt;\r\n--0-251156046-1239204300=:41229--"}