{"id": "1370", "subject": "RE: [EVP-ITC] Articles on Frank&#39;s Box", "author": "Frank Sumption", "timestamp": "2007-06-15T18:00:57Z", "full_text": "Thanks Rosemary!\n\nFrank\n\n\n&gt;From: &quot;rosemary_guiley&quot; &lt;reguiley@...&gt;\n&gt;Reply-To: EVP-ITC@yahoogroups.com\n&gt;To: EVP-ITC@yahoogroups.com\n&gt;Subject: [EVP-ITC] Articles on Frank&#39;s Box\n&gt;Date: Fri, 15 Jun 2007 14:09:23 -0000\n&gt;\n&gt;(Cross posted on itcbridge.com forum)\n&gt;\n&gt;Mark Macy has posted two articles I wrote about Frank&#39;s Box,\n&gt;concerning the controversy the box has caused in the paranormal\n&gt;investigation community.  The articles are published this month in\n&gt;TAPS Paramagazine.  The pdf can be viewed at\n&gt;http://spiritfaces.com/x200706ParamagArticl.pdf.  For those not in\n&gt;ghost work, TAPS is The Paranormal Atlantic Society, members of whom\n&gt;star in The SciFiChannel&#39;s  popular Ghost Hunters reality show.\n&gt;\n&gt;Briefly, at a Ghost Hunters haunted week at The Stanley Hotel in\n&gt;Colorado in March, the 200+ attendees were given demonstrations of\n&gt;the box by Chris Moon.  There were two open mike nights in which lots\n&gt;were drawn for people to come up and ask questions via the box.\n&gt;Chris interpreted answers, and was assisted by medium Chip Coffey.\n&gt;Many of the attendees had never heard of the box, and most of them\n&gt;had never seen it in operation, and it caused quite a stir.   Chris\n&gt;also took the box into one of the hotel&#39;s more active haunted rooms,\n&gt;as part of the featured ghost investigations.\n&gt;\n&gt;There were two other boxes present on site for part of the time,\n&gt;owned by Randy Schneider and Bill Murphy.  Fortunately, these boxes\n&gt;were not pressed into service for paranormal tap dancing.  I was\n&gt;especially happy to be able to participate in small group private\n&gt;sessions with both Randy and Bill (and one of which included Mark),\n&gt;which I found far more illuminating.\n&gt;\n&gt;One article concerns the controversy over the box (for example,\n&gt;should it be used in haunted places to provoke ghosts; can it dial up\n&gt;the dead on demand), and the other is a Q&A interview I did with\n&gt;Frank.\n&gt;\n&gt;Personally, I agree with Frank&#39;s vision for the box as an ITC tool.\n&gt;\n&gt;Rosemary Ellen Guiley\n&gt;\n&gt;\n\n_________________________________________________________________\nHotmail to go? Get your Hotmail, news, sports and much more! \nhttp://mobile.msn.com"}