{"id": "13712", "subject": "Re: [EVP-ITC] Just imagination!", "author": "Frank Sumption", "timestamp": "2009-04-08T21:59:21Z", "full_text": "And...sometimes it&#39;s just fun to look at clouds to see what&#39;s there.\n\nOn Wed, Apr 8, 2009 at 2:21 PM, Rj &lt;rasterer@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;   I think it is always ok to propose a theory that some instance like this\n&gt; might be a real giant head, floating in thje sky.  But then, you have to ask\n&gt; stuff like, ok, are there better or easier or more realistic explanations of\n&gt; what this could be?  In this case, since we know clouds can form shapes that\n&gt; look like other things, and since we know we can see shapes in clouds that\n&gt; aren&#39;t there, and since as far as we know there are very few giant floating\n&gt; heads in the sky, then in this case, I agree, that the most intelligent\n&gt; course is to overide the giant head theory and replace it with an &quot;I&#39;m\n&gt; experiencing pareidolia &lt;http://en.wikipedia.org/wiki/Pareidolia&gt;&quot;\n&gt; theory.  And let that one hold, until some more compelling evidence proposes\n&gt; perhaps a different theory.\n&gt;\n&gt; &lt;http://en.wikipedia.org/wiki/Pareidolia&gt;\n&gt; --- On *Wed, 4/8/09, Frank Sumption &lt;purplealiengirl@...&gt;* wrote:\n&gt;\n&gt;\n&gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt; Subject: [EVP-ITC] Just imagination!\n&gt; To: grassharp@yahoogroups.com, evp-itc@yahoogroups.com\n&gt; Date: Wednesday, April 8, 2009, 12:33 PM\n&gt;\n&gt;   Or is it!? (cloud faces) I think in this case it&#39;s mostly imagination.\n&gt;\n&gt;  F-S\n&gt;\n&gt;\n&gt; \n&gt;\n\nAnd...some imes i 's jus un o look a clouds o see wha 's he e.\nOn Wed, Ap 8, 2009 a 2:21 PM, Rj as e e @...> w o e:\n\n\n\n\n\n\n\n\n\nI hink i is always ok o p opose a heo y ha some ins ance like his migh be a eal gian head, loa ing in hje sky.  Bu hen, you ha e o ask s u like, ok, a e he e be e o easie o mo e ealis ic explana ions o wha his could be?  In his case, since we know clouds can o m shapes ha look like o he hings, and since we know we can see shapes in clouds ha a en' he e, and since as a as we know he e a e e y ew gian loa ing heads in he sky, hen in his case, I ag ee, ha he mos in elligen cou se is o o e ide he gian head heo y and eplace i wi h an \"I'm expe iencing pa eidolia\" heo y.  And le ha one hold, un il some mo e compelling e idence p oposes pe haps a di e en heo y.\n\n--- On Wed, 4/8/09, F ank Sump ion pu plealiengi l@...> w o e:\n\nF om: F ank Sump ion pu plealiengi l@gmail.com>Subjec : [EVP-ITC] Jus imagina ion!\nTo: g assha p@...m, e p-i c@yahoog oups.comDa e: Wednesday, Ap il 8, 2009, 12:33 PM \n\n\n\n\nO is i !? (cloud aces) I hink in his case i 's mos ly imagina ion. \n \n F-S"}