{"id": "13747", "subject": "Re: [EVP-ITC] An alternative to the usual ghost hunter stuff.", "author": "Zack Widup", "timestamp": "2009-04-11T07:10:27Z", "full_text": "I tried an Ouija board once. My brother and I were given one by my\ngrandmother, who found it in her attic. After asking many questions and\ngetting all sorts of answers that ranged from gibberish to the totally\nabsurd, I think we decided there was something in our joint subconsciouses\nthat was making the planchette give the answers it did.\n\nThat may not always be the case, though. I think if answers of some sort\nwere given involving something that no one present would have the faintest\nidea about, and they turned out to be true or valid, then it might\ndemonstrate spirit communication.\n\nZack\n\nOn Fri, Apr 10, 2009 at 11:37 PM, April Abercrombie &lt;\napril@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;  Well, if my husband would let me actually experiment with one, that would\n&gt; be the first step LOL!\n&gt;\n&gt; But what I would try and do is get some kind of verifiable information\n&gt; from the &quot;entity&quot; that I contact with the board to prove that it is\n&gt; communication from an actual, intelligent being and not just my own motor\n&gt; responses making he planchette move. It would have to be information that I\n&gt; have no knowledge of.\n&gt;\n&gt; If I could do that, and consistently, then I would be comfortable saying\n&gt; that I am actually talking to a spirit.\n&gt;\n&gt; The reason I have my doubts is that you have to be touching the planchette\n&gt; to get it to move. If it were an actual spirit, I would think that shouldn&#39;t\n&gt; be necessary. We all know ghosts can a do move objects.\n&gt;\n&gt; But this brings up another mystery - if the Ouija board is actual spirit\n&gt; communication, maybe there is a difference between the entities you can\n&gt; contact with it and your common ghost.\n&gt;\n&gt; April\n&gt;\n&gt;\n&gt;  ----- Original Message -----\n&gt; *From:* lori bogren &lt;loribogren@...&gt;\n&gt; *To:* evp-itc@yahoogroups.com\n&gt;   *Sent:* Friday, April 10, 2009 9:50 PM\n&gt; *Subject:* RE: [EVP-ITC] An alternative to the usual ghost hunter stuff.\n&gt;\n&gt;  April~\n&gt;\n&gt; Hm, finally I&#39;m intrigued again.\n&gt;\n&gt; How do you about the process?\n&gt;\n&gt; ~Lori\n&gt;\n&gt;\n&gt; *&quot;My life is boring, my fantasies are a theme park.&quot;* --Anne Rice  *Responding\n&gt; to an interviewer who just did not get it.*\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; ------------------------------\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; From: april@...\n&gt; Date: Fri, 10 Apr 2009 18:36:30 -0600\n&gt; Subject: Re: [EVP-ITC] An alternative to the usual ghost hunter stuff.\n&gt;\n&gt;  .\n&gt;\n&gt; When it comes to the Ouija, I just want to study it to find out if it is\n&gt; really spirit communication, or just kinetic energy or your subconscious\n&gt; mind moving the planchette.\n&gt;\n&gt; I agree that we all have the ability for extra sensory perception, just\n&gt; some are better at it than others. Like running, for instance. We all can\n&gt; run, but some are naturally better at it. Still, with practice we can get\n&gt; better.\n&gt;\n&gt;  But that is not my aim with the Ouija.\n&gt;\n&gt;\n&gt;\n&gt; ----- Original Message -----\n&gt; *From:* lori bogren &lt;loribogren@...&gt;\n&gt; *To:* evp-itc@yahoogroups.com\n&gt; *Sent:* Friday, April 10, 2009 6:11 PM\n&gt; *Subject:* RE: [EVP-ITC] An alternative to the usual ghost hunter stuff.\n&gt;\n&gt;  April~\n&gt;\n&gt; You forgot yawn from boredom, that&#39;s what I do.\n&gt;\n&gt; Use it, don&#39;t use it.  I don&#39;t care.  But why bother.  When people ask me I\n&gt; usually suggest that if they want to communicate with ... whatever why not\n&gt; develop the ability yourself.  - ya, I&#39;m one of those who believe anyone\n&gt; can.\n&gt;\n&gt; There&#39;s always the question in the back of your mind whether your partner&#39;s\n&gt; moving it.  The intentions of &quot;what&quot; you are talking to.  Not to mention\n&gt; it&#39;s too slow and limited.\n&gt;\n&gt; Besides if you take the time to develop the ability you can get more\n&gt; texture in the information.  Asking the board &quot;where you married?&quot; may get\n&gt; you a &quot;yes&quot; but a psychic might get the sense of a religious or civil\n&gt; ceremonhy, the garment(s) worn, other&#39;s in the party, or whether that Being\n&gt; approved/disapproved of their spouse (ie was it a reluctant union).\n&gt;\n&gt; ~Lori\n&gt;\n&gt;\n&gt; ------------------------------\n&gt; Quick access to your favorite MSN content and Windows Live with Internet\n&gt; Explorer 8. Download FREE now!&lt;http://ie8.msn.com/microsoft/internet-explorer-8/en-us/ie8.aspx?ocid=B037MSN55C0701A&gt;\n&gt;\n&gt;   \n&gt;\n\nI ied an Ouija boa d once. My b o he and I we e gi en one by my g andmo he , who ound i in he a ic. A e asking many ques ions and ge ing all so s o answe s ha anged om gibbe ish o he o ally absu d, I hink we decided he e was some hing in ou join  subconsciouses ha was making he planche e gi e he answe s i did.\n\n \nTha may no always be he case, hough. I hink i answe s o some so we e gi en in ol ing some hing ha no one p esen would ha e he ain es idea abou , and hey u ned ou o be ue o alid, hen i migh demons a e spi i communica ion.\n\n \nZack\nOn F i, Ap 10, 2009 a 11:37 PM, Ap il Abe c ombie ap il@...> w o e:\n\n\n\n\n\n\nWell, i my husband would le me ac ually expe imen wi h one, ha would be he i s s ep LOL!\n \nBu wha I would y and do is ge some kind o e i iable in o ma ion om  he \"en i y\" ha  I con ac wi h he boa d o p o e ha i is communica ion om an ac ual, in elligen being and no jus my own mo o esponses making he planche e mo e. I would ha e o be in o ma ion ha I ha e no knowledge o .\n\n \nI I could do ha , and consis en ly, hen I would be com o able saying ha I am ac ually alking  o a spi i .\n \nThe eason I ha e my doub s is ha you ha e o be ouching he planche e o ge i o mo e. I i we e an ac ual spi i , I would hink ha shouldn' be necessa y. We all know ghos s can a do mo e objec s.\n\n \nBu his b ings up ano he mys e y - i he Ouija boa d is ac ual spi i communica ion, maybe he e is a di e ence be ween he en i ies you can con ac wi h i and you common ghos .\n\n \nAp il\n \n\n\n----- O iginal Message ----- \nF om: lo i bog en \nTo: e p-i c@yahoog oups.com \n\n\n\nSen : F iday, Ap il 10, 2009 9:50 PM\nSubjec : RE: [EVP-ITC] An al e na i e o he usual ghos hun e s u .\n\n\nAp il~ Hm, inally I'm in igued again. How do you abou he p ocess? ~Lo i\n\"My li e is bo ing, my an asies a e a heme pa k.\" \n--Anne Rice  Responding o an in e iewe who jus did no ge i .   \n\n\nTo: EVP-ITC@yahoog oups.comF om: ap il@abe c ombieghos esea ch.comDa e: F i, 10 Ap 2009 18:36:30 -0600\nSubjec : Re: [EVP-ITC] An al e na i e o he usual ghos hun e s u .\n\n.\nWhen i comes o he Ouija, I jus wan o s udy i o ind ou i i is eally spi i communica ion, o jus kine ic ene gy o you subconscious mind mo ing he planche e.\n\n \nI ag ee ha we all ha e he abili y o ex a senso y pe cep ion, jus some a e be e a i han o he s. Like unning, o ins ance. We all can un, bu some a e na u ally be e a i . S ill, wi h p ac ice we can ge be e .\n\n \n\nBu ha is no my aim wi h he Ouija.\n \n \n\n----- O iginal Message ----- \nF om: lo i bog en \nTo: e p-i c@yahoog oups.com \nSen : F iday, Ap il 10, 2009 6:11 PM\nSubjec : RE: [EVP-ITC] An al e na i e o he usual ghos hun e s u .\n\n\nAp il~ You o go yawn om bo edom, ha 's wha I do. Use i , don' use i .  I don' ca e.  Bu why bo he .  When people ask me I usually sugges ha i hey wan o communica e wi h ... wha e e why no de elop he abili y you sel .  - ya, I'm one o hose who belie e anyone can.\n The e's always he ques ion in he back o you mind whe he you pa ne 's mo ing i .  The in en ions o \"wha \" you a e alking o.  No o men ion i 's oo slow and limi ed. Besides i you ake he ime o de elop he abili y you can ge mo e ex u e in he in o ma ion.  Asking he boa d \"whe e you ma ied?\" may ge you a \"yes\" bu a psychic migh ge he sense o a eligious o ci il ce emonhy, he ga men (s) wo n, o he 's in he pa y, o whe he ha Being app o ed/disapp o ed o hei spouse (ie was i a eluc an union).\n ~Lo i \n\n\nQuick access o you a o i e MSN con en and Windows Li e wi h In e ne Explo e 8. Download FREE now!"}