{"id": "13752", "subject": "Re: An alternative to the usual ghost hunter stuff.", "author": "senecaripple90", "timestamp": "2009-04-11T19:26:46Z", "full_text": "and no evil spirits or poltegeist visited you as george noory suggested or warned us about when playing with the ouija board?\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;April Abercrombie&quot; &lt;april@...&gt; wrote:\n&gt;\n&gt; Exactly. And it may even be that it&#39;s both-sometimes it is us, but once in a while and actual entity comes through. But until I can really study it over a period time, I am just not convinced either way.\n&gt; \n&gt;   ----- Original Message ----- \n&gt;   From: Zack Widup \n&gt;   To: EVP-ITC@yahoogroups.com \n&gt;   Sent: Saturday, April 11, 2009 1:10 AM\n&gt;   Subject: Re: [EVP-ITC] An alternative to the usual ghost hunter stuff.\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;   I tried an Ouija board once. My brother and I were given one by my grandmother, who found it in her attic. After asking many questions and getting all sorts of answers that ranged from gibberish to the totally absurd, I think we decided there was something in our joint subconsciouses that was making the planchette give the answers it did.\n&gt; \n&gt;   That may not always be the case, though. I think if answers of some sort were given involving something that no one present would have the faintest idea about, and they turned out to be true or valid, then it might demonstrate spirit communication.\n&gt; \n&gt;   Zack\n&gt; \n&gt; \n&gt;   On Fri, Apr 10, 2009 at 11:37 PM, April Abercrombie &lt;april@...&gt; wrote:\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;     Well, if my husband would let me actually experiment with one, that would be the first step LOL!\n&gt; \n&gt;     But what I would try and do is get some kind of verifiable information from the &quot;entity&quot; that I contact with the board to prove that it is communication from an actual, intelligent being and not just my own motor responses making he planchette move. It would have to be information that I have no knowledge of.\n&gt; \n&gt;     If I could do that, and consistently, then I would be comfortable saying that I am actually talking to a spirit.\n&gt; \n&gt;     The reason I have my doubts is that you have to be touching the planchette to get it to move. If it were an actual spirit, I would think that shouldn&#39;t be necessary. We all know ghosts can a do move objects.\n&gt; \n&gt;     But this brings up another mystery - if the Ouija board is actual spirit communication, maybe there is a difference between the entities you can contact with it and your common ghost.\n&gt; \n&gt;     April\n&gt; \n&gt;       ----- Original Message ----- \n&gt;       From: lori bogren \n&gt;       To: evp-itc@yahoogroups.com \n&gt;       Sent: Friday, April 10, 2009 9:50 PM\n&gt;       Subject: RE: [EVP-ITC] An alternative to the usual ghost hunter stuff.\n&gt; \n&gt; \n&gt;       April~\n&gt;        \n&gt;       Hm, finally I&#39;m intrigued again.\n&gt;        \n&gt;       How do you about the process?\n&gt;        \n&gt;       ~Lori\n&gt; \n&gt; \n&gt; \n&gt; \n&gt;       &quot;My life is boring, my fantasies are a theme park.&quot; \n&gt;       --Anne Rice  Responding to an interviewer who just did not get it. \n&gt; \n&gt; \n&gt; \n&gt;         \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; --------------------------------------------------------------------------\n&gt;       To: EVP-ITC@yahoogroups.com\n&gt;       From: april@...\n&gt;       Date: Fri, 10 Apr 2009 18:36:30 -0600\n&gt;       Subject: Re: [EVP-ITC] An alternative to the usual ghost hunter stuff.\n&gt; \n&gt; \n&gt;       .\n&gt; \n&gt; \n&gt;       When it comes to the Ouija, I just want to study it to find out if it is really spirit communication, or just kinetic energy or your subconscious mind moving the planchette.\n&gt; \n&gt;       I agree that we all have the ability for extra sensory perception, just some are better at it than others. Like running, for instance. We all can run, but some are naturally better at it. Still, with practice we can get better.\n&gt; \n&gt;       But that is not my aim with the Ouija.\n&gt; \n&gt; \n&gt;         ----- Original Message ----- \n&gt;         From: lori bogren \n&gt;         To: evp-itc@yahoogroups.com \n&gt;         Sent: Friday, April 10, 2009 6:11 PM\n&gt;         Subject: RE: [EVP-ITC] An alternative to the usual ghost hunter stuff.\n&gt; \n&gt; \n&gt;         April~\n&gt;          \n&gt;         You forgot yawn from boredom, that&#39;s what I do.\n&gt;          \n&gt;         Use it, don&#39;t use it.  I don&#39;t care.  But why bother.  When people ask me I usually suggest that if they want to communicate with ... whatever why not develop the ability yourself.  - ya, I&#39;m one of those who believe anyone can.\n&gt;          \n&gt;         There&#39;s always the question in the back of your mind whether your partner&#39;s moving it.  The intentions of &quot;what&quot; you are talking to.  Not to mention it&#39;s too slow and limited.\n&gt;          \n&gt;         Besides if you take the time to develop the ability you can get more texture in the information.  Asking the board &quot;where you married?&quot; may get you a &quot;yes&quot; but a psychic might get the sense of a religious or civil ceremonhy, the garment(s) worn, other&#39;s in the party, or whether that Being approved/disapproved of their spouse (ie was it a reluctant union).\n&gt;          \n&gt;         ~Lori \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; --------------------------------------------------------------------------\n&gt;       Quick access to your favorite MSN content and Windows Live with Internet Explorer 8. Download FREE now!\n&gt;"}