{"id": "13776", "subject": "Re: An alternative to the usual ghost hunter stuff.", "author": "John S", "timestamp": "2009-04-12T17:00:51Z", "full_text": "--0-420124537-1239555651=:21579\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nThis is an interesting topic thread. I have a few suggestions that might be=\r\n of interest.\n=A0\nFirst let&#39;s think about what it is you propose. You want =\r\nto know if movement on a Ouija board is evidence of spirit communication or=\r\n something else, presumably your own abilities. In order to determine if a =\r\nspirit is involved, you will need a test for a spirit communicator. This im=\r\nplies you know what spirit communicators do. And therein lies the problem. =\r\nWe don&#39;t know this unfortunately.=A0 Now, we might frame the question diffe=\r\nrently: can we demonstrate if the acitivity is likely the result of motor r=\r\nesponse and if so how? This won&#39;t make it possible to say that the results =\r\ncome from spirits, but it might be possible at least to rule out most known=\r\n methods that are attributable to living persons, which would be a start.\n=\r\n=A0\nWe&#39;ll begin by putting aside mechanical explanations. To do this we nee=\r\nd to be sure ideomotor response cannot be a possibility. Since ideomotor re=\r\nquires opposing forces in order to work, this means only one operator with =\r\na single finger of one hand on the planchette. \nWhat we would really like t=\r\no see is planchette motion with no contact. This would=A0remove any normal =\r\nphysical explanation of the planchette movement. Now we are down to one of =\r\ntwo possibilities aside from kinetic energy, which can be disestablished by=\r\n simply waiting. \n=A0\nFirst, the planchette is being moved by some unknown =\r\npsychic force by an individual present in the room, perhaps the operator. S=\r\necond, the planchette is being moved by some unseen thing (which could incl=\r\nude a &quot;spirit&quot;) that may or may not be using a person in the room or elsewh=\r\nere as an intermediary. We seek to establish which of these two is more pro=\r\nbable. We do that by seeing if there is any indication that a physical pers=\r\non in the room is producing anything unexpected.\n=A0\nHere is where things b=\r\necome a bit dicey and for some, problematic. There has been reputable resea=\r\nrch in the field of Parapscyhology that indicates that there are focal peop=\r\nle who participate in psychokinesis (PK), the apparent heart of what is cal=\r\nled &#39;poltergeist&#39; activity. There is every reason to believe that, if any a=\r\nnomalous planchette movement is occuring, that it too is most likely caused=\r\n by PK. These focal people have several characteristics, one of which is a =\r\nhistory of psychophysiological disorders. Unfortunately not everyone who ha=\r\ns these disorders is aware of it. Many also have a belief system that in so=\r\nme way allows them to experience PK activity. Lastly they appear most often=\r\n to be successful in environments where strong magnetic fields exist.\n=A0\nT=\r\nhis would suggest that the best way to detect a potentil living PK agent as=\r\n the cause of this activity would be to monitor two types of magnetic field=\r\ns. In the environment it would make sense to test for strong geomagnetic fi=\r\nelds with portable geomagnetometers. These are not inexpensive; the type re=\r\nquired cost about $800 U.S. You can monitor body fields reasonably well usi=\r\nng a Trifield Natural EM meter. Psychophysiologists have used these relativ=\r\nely inexpensive meters to find high biofields in humans, often those who ap=\r\npear to be PK focal people. The key is that a DC meter must be used. Levels=\r\n have been observed in the 1 to 3 Gauss range. Yes, if you know much about =\r\nhuman physiology you will know that should be impossible. The physiologists=\r\n who have reliably made these measurements are as stumped as anyone as to w=\r\nhy they would be that high and cannot explain them either. They simply know=\r\n that these are replicable and stable readings over decades of\n measurement=\r\ns.\n=A0\nIf you find this type of environment and you find a moving planchett=\r\ne with no one present touching it, you can infer at least beyond a wild gue=\r\nss, that there may be some evidence for participation by a local individual=\r\n as opposed to an external entity. You cannot say with complete certainty t=\r\nhat no external entity is involved, but you can say there is a strong indic=\r\nation that someone locally is probably involved and likely responsible. To =\r\ntest this, remove individuals from the area and see if the activity stops. =\r\nClearly this should be replicated if possible. While replication provides m=\r\nore certainty of the assumption it will never provide 100% proof, unfortuna=\r\ntely.\n=A0\nI hope readers find this information useful. I monitor the digest=\r\ns occasionally and will try to answer any inquiries you may have here.\n=A0\n=\r\n=A0 JS\n\n\n      \r\n--0-420124537-1239555651=:21579\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;&lt;head&gt;&lt;style type=3D&quot;text/css&quot;&gt;&lt;!-- DIV {margin:0px;} --&gt;&lt;/style&gt;&lt;/he=\r\nad&gt;&lt;body&gt;&lt;div style=3D&quot;font-family:times new roman, new york, times, serif;=\r\nfont-size:12pt&quot;&gt;&lt;P&gt;This is an interesting topic thread. I have a few sugges=\r\ntions that might be of interest.&lt;/P&gt;\n&lt;P&gt;&nbsp;&lt;/P&gt;\n&lt;P&gt;First let&#39;s think abo=\r\nut what it is you propose. You want to know if movement on a Ouija board is=\r\n evidence of spirit communication or something else, presumably your own ab=\r\nilities. In order to determine if a spirit is involved, you will need a tes=\r\nt for a spirit communicator. This implies you know what spirit communicator=\r\ns do. And therein lies the problem. We don&#39;t know this unfortunately.&nbsp;=\r\n Now, we might frame the question differently: can we demonstrate if the ac=\r\nitivity is likely the result of motor response and if so how? This won&#39;t ma=\r\nke it possible to say that the results come from spirits, but it might be p=\r\nossible at least to rule out most known methods that are attributable to li=\r\nving persons, which would be a start.&lt;/P&gt;\n&lt;P&gt;&nbsp;&lt;/P&gt;\n&lt;P&gt;We&#39;ll begin by p=\r\nutting aside mechanical explanations. To do this we need to be sure ideomot=\r\nor response cannot be a possibility. Since ideomotor requires opposing forc=\r\nes in order to work, this means only one operator with a single finger of o=\r\nne hand on the planchette. &lt;/P&gt;\n&lt;P&gt;What we would really like to see is plan=\r\nchette motion with no contact. This would&nbsp;remove any normal physical e=\r\nxplanation of the planchette movement. Now we are down to one of two possib=\r\nilities aside from kinetic energy, which can be disestablished by simply wa=\r\niting. &lt;/P&gt;\n&lt;P&gt;&nbsp;&lt;/P&gt;\n&lt;P&gt;First, the planchette is being moved by some u=\r\nnknown psychic force by an individual present in the room, perhaps the oper=\r\nator. Second, the planchette is being moved by some unseen thing (which cou=\r\nld include a &quot;spirit&quot;) that may or may not be using a person in the room or=\r\n elsewhere as an intermediary. We seek to establish which of these two is m=\r\nore probable. We do that by seeing if there is any indication that a physic=\r\nal person in the room is producing anything unexpected.&lt;/P&gt;\n&lt;P&gt;&nbsp;&lt;/P&gt;\n&lt;=\r\nP&gt;Here is where things become a bit dicey and for some, problematic. There =\r\nhas been reputable research in the field of Parapscyhology that indicates t=\r\nhat there are focal people who participate in psychokinesis (PK), the appar=\r\nent heart of what is called &#39;poltergeist&#39; activity. There is every reason t=\r\no believe that, if any anomalous planchette movement is occuring, that it t=\r\noo is most likely caused by PK. These focal people have several characteris=\r\ntics, one of which is a history of psychophysiological disorders. Unfortuna=\r\ntely not everyone who has these disorders is aware of it. Many also have a =\r\nbelief system that in some way allows them to experience PK activity. Lastl=\r\ny they appear most often to be successful in environments where strong magn=\r\netic fields exist.&lt;/P&gt;\n&lt;P&gt;&nbsp;&lt;/P&gt;\n&lt;P&gt;This would suggest that the best wa=\r\ny to detect a potentil living PK agent as the cause of this activity would =\r\nbe to monitor two types of magnetic fields. In the environment it would mak=\r\ne sense to test for strong geomagnetic fields with portable geomagnetometer=\r\ns. These are not inexpensive; the type required cost about $800 U.S. You ca=\r\nn monitor body fields reasonably well using a Trifield Natural EM meter. Ps=\r\nychophysiologists have used these relatively inexpensive meters to find hig=\r\nh biofields in humans, often those who appear to be PK focal people. The ke=\r\ny is that a DC meter must be used. Levels have been observed in the 1 to 3 =\r\nGauss range. Yes, if you know much about human physiology you will know tha=\r\nt should be impossible. The physiologists who have reliably made these meas=\r\nurements are as stumped as anyone as to why they would be that high and can=\r\nnot explain them either. They simply know that these are replicable and sta=\r\nble readings over decades of\n measurements.&lt;/P&gt;\n&lt;P&gt;&nbsp;&lt;/P&gt;\n&lt;P&gt;If you fin=\r\nd this type of environment and you find a moving planchette with no one pre=\r\nsent touching it, you can infer at least beyond a wild guess, that there ma=\r\ny be some evidence for participation by a local individual as opposed to an=\r\n external entity. You cannot say with complete certainty that no external e=\r\nntity is involved, but you can say there is a strong indication that someon=\r\ne locally is probably involved and likely responsible. To test this, remove=\r\n individuals from the area and see if the activity stops. Clearly this shou=\r\nld be replicated if possible. While replication provides more certainty of =\r\nthe assumption it will never provide 100% proof, unfortunately.&lt;/P&gt;\n&lt;P&gt;&nbs=\r\np;&lt;/P&gt;\n&lt;P&gt;I hope readers find this information useful. I monitor the digest=\r\ns occasionally and will try to answer any inquiries you may have here.&lt;/P&gt;\n=\r\n&lt;P&gt;&nbsp;&lt;/P&gt;\n&lt;P&gt;&nbsp; JS&lt;/P&gt;&lt;/div&gt;&lt;br&gt;\n\n\n\n      &lt;/body&gt;&lt;/html&gt;\r\n--0-420124537-1239555651=:21579--"}