{"id": "13779", "subject": "Re: [EVP-ITC] Re: Oujia Board Testing", "author": "April Abercrombie", "timestamp": "2009-04-12T17:42:21Z", "full_text": "------=_NextPart_000_0063_01C9BB63.BDAA97C0\r\nContent-Type: text/plain;\n\tcharset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&quot;There are other issues with proofs. One is that it appears that informatio=\r\nn does not come through well when tests are too &quot;factual&quot; or there is no re=\r\nal need. In other words, experiments motivated solely by a &quot;prove it&quot; attit=\r\nude, tend to fail. We think this is because of a form of experimenter effec=\r\nt. It has been observed that the attitudes of experimenters, especially in =\r\npsychological research, can actually influence outcomes. A famous of experi=\r\nments performed by Dr. Richard Wiseman and Dr. Marilyn Schlitz demonstrated=\r\n this conclusively.&quot;\n\nIf the experimenter keeps an open mind, not counting =\r\nor discounting any results right away, then there is no problem. It&#39;s the d=\r\nifference between a &quot;debunker&quot; and a &quot;skeptic&quot;. A skeptic keeps an open min=\r\nd to any possibility, but tests all results. The debunker disbelieves every=\r\nthing, no matter what evidence is shown, which is just as bad as believing =\r\neverything without testing it.\n\nApril\n\n  ----- Original Message ----- \n  Fr=\r\nom: John S \n  To: EVP-ITC@yahoogroups.com \n  Sent: Sunday, April 12, 2009 1=\r\n1:20 AM\n  Subject: [EVP-ITC] Re: Oujia Board Testing\n\n\n\n\n\n\n  I have been te=\r\nsting claimants of mediumship for many years. One of the central issues we =\r\nconstantly deal with is identifying the source of the anomalous information=\r\n. First let&#39;s establish that &quot;proof-oriented&quot; research simply will not answ=\r\ner this question. Proof-oriented research (such as does the supposed discar=\r\nnate know specifici information) has been used in the past to establish tha=\r\nt anomalous information transfer can occur.. &quot;Anomalous information transfe=\r\nr&quot; is a fancy way of saying that something is known somehow to someone in a=\r\n way that seems impossible. Mediums giving legitimate reading for sitters i=\r\ns one example, psychics having validated impressions is another.\n\n\n\n  There=\r\n are other issues with proofs. One is that it appears that information does=\r\n not come through well when tests are too &quot;factual&quot; or there is no real nee=\r\nd. In other words, experiments motivated solely by a &quot;prove it&quot; attitude, t=\r\nend to fail. We think this is because of a form of experimenter effect. It =\r\nhas been observed that the attitudes of experimenters, especially in psycho=\r\nlogical research, can actually influence outcomes. A famous of experiments =\r\nperformed by Dr. Richard Wiseman and Dr. Marilyn Schlitz demonstrated this =\r\nconclusively.\n\n\n\n  Given these points, how to proceed? The answer lies in &quot;=\r\nprocess-oriented&quot; research. Instead of worrying about proving things, espec=\r\nially since we already know that we can get proof of anomalous information =\r\ntransfer, we focus on how the process seems to work and not work. This give=\r\ns us clues as to what might be going on and ultimately go give us greater c=\r\nonfidence as to the source of the information. Note that I said, &quot;could&quot; as=\r\n in the future, as in we don&#39;t really know now. That is the state of the ar=\r\nt at this time. So we don&#39;t have a way today to determine this yet. \n\n\n\n  T=\r\nhere are some other things you should know. There are three known ways that=\r\n apparent discarnate communications might be explained. These have been tou=\r\nched on in this and other threads, but it might be useful to review.\n\n\n\n  T=\r\nhe first is known as &quot;telepathy&quot; or &quot;thought transference&quot;. It involves two=\r\n living people sharing thoughts. Most ESP tests are contrived with the expe=\r\nctation of demonstrating telepathy. But there is a little problem. They can=\r\n as easily demonstrate &quot;clarivoyance&quot; which is the second know way of commu=\r\nnicating. Clairvoyance (which literally means &quot;clear seeing&quot;) is a supposed=\r\n ability that some have to see things that either are, were or will be. Som=\r\ne people hear things instead of seeing them, this known as clairaudience. I=\r\nn fact any sense can be appealed to in this way. The point is that an actua=\r\nl event is being sensed and reported. So in the clairvoyant example, you ar=\r\ne simply showing that someone might have known of an event in the past (whe=\r\nn you recorded something for example), in the present (what&#39;s on a paper yo=\r\nu placed in a location without looking yourself) or in the future (when the=\r\n contents of the paper were discovered).\n\n  This problem was solved nicely =\r\nin 1936 by Dr. Elizabeth McMann at Duke University when she developed the &quot;=\r\ntrue telepathy test.&quot; Simply put, the test requires that no target ever be =\r\nrecorded per se. Instead aliases for target are kept in memory and the alia=\r\nses compared post hoc.. This way there is never a physcial record of the ac=\r\ntual targets - the only place the target object information exists is in th=\r\ne minds of the subjects. So telepathy must be in play if successes are foun=\r\nd and clairvoyance is effectively ruled out. One small detail though, subje=\r\ncts can NEVER discuss the actual test objects throughout their lifetimes or=\r\n the test will be invalidated as precognitive clairvoyance could then becom=\r\ne an explanation.\n\n\n\n  Even if you didn&#39;t fully understand the preceding pa=\r\nragraphy, I hope you can see that tests of this sort are not trivial, and i=\r\nmposing proper controls is sort of an art form.\n\n\n\n  Of course the third ex=\r\nplanation for anomalous information transfer is based on After-Death Commun=\r\nication or ADC which is the unique provenance of the medium (as opposed to =\r\na psychic). \n\n\n\n  I hope this is of some interest.\n\n\n\n    JS\n\n\n\n\n\n\n  \r\n------=_NextPart_000_0063_01C9BB63.BDAA97C0\r\nContent-Type: text/html;\n\tcharset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML 4.0 Transitional//EN&quot;&gt;\n&lt;HTML&gt;&lt;HEAD&gt;=\r\n\n&lt;META content=3D&quot;text/html; charset=3Diso-8859-1&quot; http-equiv=3DContent-Typ=\r\ne&gt;\n&lt;META name=3DGENERATOR content=3D&quot;MSHTML 8.00.6001.18702&quot;&gt;&lt;/HEAD&gt;\n&lt;BODY =\r\nstyle=3D&quot;BACKGROUND-COLOR: #ffffff&quot; bgColor=3D#ffffff&gt;\n&lt;DIV&gt;&quot;There&nbsp;are=\r\n other issues with proofs. One is that it appears that \ninformation does no=\r\nt come through well when tests are too &quot;factual&quot; or there is \nno real need.=\r\n In other words, experiments motivated solely by a &quot;prove it&quot; \nattitude, te=\r\nnd to fail. We think this is because of a form of experimenter \neffect. It =\r\nhas been observed that the attitudes of experimenters, especially in \npsych=\r\nological research, can actually influence outcomes. A famous of experiments=\r\n \nperformed by Dr. Richard Wiseman and Dr. Marilyn Schlitz demonstrated thi=\r\ns \nconclusively.&quot;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 face=3D&quot;Myriad Pro&quot;&gt;&lt;/FONT&gt;&nbs=\r\np;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 face=3D&quot;Myriad Pro&quot;&gt;If the experimenter keeps =\r\nan open mind, not \ncounting or discounting any results right away, then&nbs=\r\np;there is no problem. \nIt&#39;s the difference between a &quot;debunker&quot; and a &quot;ske=\r\nptic&quot;. A skeptic keeps an \nopen mind to any possibility, but tests all resu=\r\nlts. The debunker disbelieves \neverything, no matter what evidence is shown=\r\n, which is just as bad as believing \neverything without testing it.&lt;/FONT&gt;&lt;=\r\n/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 face=3D&quot;Myriad Pro&quot;&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FON=\r\nT size=3D2 face=3D&quot;Myriad Pro&quot;&gt;April&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 face=\r\n=3D&quot;Myriad Pro&quot;&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;BLOCKQUOTE \nstyle=3D&quot;BORDER-LEFT: #000=\r\n000 2px solid; PADDING-LEFT: 5px; PADDING-RIGHT: 0px; MARGIN-LEFT: 5px; MAR=\r\nGIN-RIGHT: 0px&quot; \ndir=3Dltr&gt;\n  &lt;DIV style=3D&quot;FONT: 10pt arial&quot;&gt;----- Origina=\r\nl Message ----- &lt;/DIV&gt;\n  &lt;DIV \n  style=3D&quot;FONT: 10pt arial; BACKGROUND: #e4=\r\ne4e4; font-color: black&quot;&gt;&lt;B&gt;From:&lt;/B&gt; \n  &lt;A title=3Dphenom_investigator@yah=\r\noo.com \n  href=3D&quot;mailto:phenom_investigator@...&quot;&gt;John S&lt;/A&gt; &lt;/DIV&gt;\n =\r\n &lt;DIV style=3D&quot;FONT: 10pt arial&quot;&gt;&lt;B&gt;To:&lt;/B&gt; &lt;A title=3DEVP-ITC@yahoogroups.=\r\ncom \n  href=3D&quot;mailto:EVP-ITC@yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups.com&lt;/A&gt; =\r\n&lt;/DIV&gt;\n  &lt;DIV style=3D&quot;FONT: 10pt arial&quot;&gt;&lt;B&gt;Sent:&lt;/B&gt; Sunday, April 12, 200=\r\n9 11:20 \n  AM&lt;/DIV&gt;\n  &lt;DIV style=3D&quot;FONT: 10pt arial&quot;&gt;&lt;B&gt;Subject:&lt;/B&gt; [EVP-=\r\nITC] Re: Oujia Board \n  Testing&lt;/DIV&gt;\n  &lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n  &lt;DIV id=3Dygrp-te=\r\nxt&gt;\n  &lt;P&gt;\n  &lt;DIV \n  style=3D&quot;FONT-FAMILY: times new roman, new york, times,=\r\n serif; FONT-SIZE: 12pt&quot;&gt;\n  &lt;P&gt;I have been testing claimants of mediumship =\r\nfor many years. One of the \n  central issues we constantly deal with is ide=\r\nntifying the source of the \n  anomalous information. First let&#39;s establish =\r\nthat &quot;proof-oriented&quot; research \n  simply will not answer this question. Pro=\r\nof-oriented research (such as does \n  the supposed discarnate know specific=\r\ni information) has been used in the past \n  to establish that anomalous inf=\r\normation transfer can occur.. &quot;Anomalous \n  information transfer&quot; is a fanc=\r\ny way of saying that something is known somehow \n  to someone in a way that=\r\n seems impossible. Mediums giving legitimate reading \n  for sitters is one =\r\nexample, psychics having validated impressions is \n  another.&lt;/P&gt;\n  &lt;P&gt;&nbs=\r\np;&lt;/P&gt;\n  &lt;P&gt;There&nbsp;are other issues with proofs. One is that it appears=\r\n that \n  information does not come through well when tests are too &quot;factual=\r\n&quot; or there \n  is no real need. In other words, experiments motivated solely=\r\n by a &quot;prove it&quot; \n  attitude, tend to fail. We think this is because of a f=\r\norm of experimenter \n  effect. It has been observed that the attitudes of e=\r\nxperimenters, especially \n  in psychological research, can actually influen=\r\nce outcomes. A famous of \n  experiments performed by Dr. Richard Wiseman an=\r\nd Dr. Marilyn Schlitz \n  demonstrated this conclusively.&lt;/P&gt;\n  &lt;P&gt;&nbsp;&lt;/P=\r\n&gt;\n  &lt;P&gt;Given these points, how to proceed? The answer lies in &quot;process-orie=\r\nnted&quot; \n  research. Instead of worrying about proving things, especially sin=\r\nce we \n  already know that we can get proof of anomalous information transf=\r\ner, we focus \n  on how the process seems to work and not work. This gives u=\r\ns clues as to what \n  might be going on and ultimately go give us greater c=\r\nonfidence as to the \n  source of the information. Note that I said, &quot;could&quot;=\r\n as in the future, as in \n  we don&#39;t really know now. That is the state of =\r\nthe art at this time. So we \n  don&#39;t have&nbsp;a way today to determine thi=\r\ns yet. &lt;/P&gt;\n  &lt;P&gt;&nbsp;&lt;/P&gt;\n  &lt;P&gt;There are some other things you should kno=\r\nw. There are three known ways \n  that apparent discarnate communications mi=\r\nght be explained. These have been \n  touched on in this and other threads, =\r\nbut it might be useful to review.&lt;/P&gt;\n  &lt;P&gt;&nbsp;&lt;/P&gt;\n  &lt;P&gt;The first is kno=\r\nwn as &quot;telepathy&quot; or &quot;thought transference&quot;&lt;WBR&gt;. It \n  involves two living=\r\n people sharing thoughts. Most ESP tests are contrived with \n  the expectat=\r\nion of demonstrating telepathy. But there is a little problem. \n  They can =\r\nas easily demonstrate &quot;clarivoyance&quot; which is the second know way of \n  com=\r\nmunicating. Clairvoyance (which literally means &quot;clear seeing&quot;) is a \n  sup=\r\nposed ability that some have to see things that either are, were or will \n =\r\n be. Some people hear things instead of seeing them, this known as \n  clair=\r\naudience. In fact any sense can be appealed to in this way. The point is \n =\r\n that an actual event is being sensed and reported. So in the clairvoyant \n=\r\n  example, you are simply showing that someone might have known of an event=\r\n in \n  the past (when you recorded something for example), in the present (=\r\nwhat&#39;s on \n  a paper you placed in a location without looking yourself) or =\r\nin the future \n  (when the contents of the paper were discovered).&lt;/P&gt;\n  &lt;P=\r\n&gt;This problem was solved nicely in 1936 by Dr. Elizabeth McMann at Duke \n  =\r\nUniversity when she developed the &quot;true telepathy test.&quot; Simply put, the te=\r\nst \n  requires that no target ever be recorded per se. Instead aliases for =\r\ntarget \n  are kept in memory and the aliases compared post hoc.. This way t=\r\nhere is \n  never&nbsp;a physcial record of the actual targets - the only pl=\r\nace the target \n  object information exists is in the minds of the subjects=\r\n. So telepathy must \n  be in play if successes are found and clairvoyance i=\r\ns effectively ruled out. \n  One small detail though, subjects can NEVER dis=\r\ncuss the actual test objects \n  throughout their lifetimes or the test will=\r\n be invalidated as precognitive \n  clairvoyance could then become an explan=\r\nation.&lt;/P&gt;\n  &lt;P&gt;&nbsp;&lt;/P&gt;\n  &lt;P&gt;Even if you didn&#39;t fully understand the pre=\r\nceding paragraphy, I hope you \n  can see that tests of this sort are not tr=\r\nivial, and imposing proper controls \n  is sort of an art form.&lt;/P&gt;\n  &lt;P&gt;&nb=\r\nsp;&lt;/P&gt;\n  &lt;P&gt;Of course the third explanation for anomalous information tran=\r\nsfer is based \n  on After-Death Communication or ADC which is the unique pr=\r\novenance of the \n  medium (as opposed to a psychic). &lt;/P&gt;\n  &lt;P&gt;&nbsp;&lt;/P&gt;\n =\r\n &lt;P&gt;I hope this is of some interest.&lt;/P&gt;\n  &lt;P&gt;&nbsp;&lt;/P&gt;\n  &lt;P&gt;&nbsp; JS&lt;/P&gt;=\r\n\n  &lt;P&gt;&nbsp;&lt;/P&gt;&lt;/DIV&gt;&lt;BR&gt;\n  &lt;P&gt;&lt;/P&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BODY&gt;&lt;/H=\r\nTML&gt;\n\r\n------=_NextPart_000_0063_01C9BB63.BDAA97C0--"}