{"id": "13777", "subject": "Re: Oujia Board Testing", "author": "John S", "timestamp": "2009-04-12T17:20:15Z", "full_text": "--0-1679393363-1239556815=:89848\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nI have been testing claimants of mediumship for many years. One of the cent=\r\nral issues we constantly deal with is identifying the source of the anomalo=\r\nus information. First let&#39;s establish that &quot;proof-oriented&quot; research simply=\r\n will not answer this question. Proof-oriented research (such as does the s=\r\nupposed discarnate know specifici information) has been used in the past to=\r\n establish that anomalous information transfer can occur. &quot;Anomalous inform=\r\nation transfer&quot; is a fancy way of saying that something is known somehow to=\r\n someone in a way that seems impossible. Mediums giving legitimate reading =\r\nfor sitters is one example, psychics having validated impressions is anothe=\r\nr.\n=A0\nThere=A0are other issues with proofs. One is that it appears that in=\r\nformation does not come through well when tests are too &quot;factual&quot; or there =\r\nis no real need. In other words, experiments motivated solely by a &quot;prove i=\r\nt&quot; attitude, tend to fail. We think this is because of a form of experiment=\r\ner effect. It has been observed that the attitudes of experimenters, especi=\r\nally in psychological research, can actually influence outcomes. A famous o=\r\nf experiments performed by Dr. Richard Wiseman and Dr. Marilyn Schlitz demo=\r\nnstrated this conclusively.\n=A0\nGiven these points, how to proceed? The ans=\r\nwer lies in &quot;process-oriented&quot; research. Instead of worrying about proving =\r\nthings, especially since we already know that we can get proof of anomalous=\r\n information transfer, we focus on how the process seems to work and not wo=\r\nrk. This gives us clues as to what might be going on and ultimately go give=\r\n us greater confidence as to the source of the information. Note that I sai=\r\nd, &quot;could&quot; as in the future, as in we don&#39;t really know now. That is the st=\r\nate of the art at this time. So we don&#39;t have=A0a way today to determine th=\r\nis yet. \n=A0\nThere are some other things you should know. There are three k=\r\nnown ways that apparent discarnate communications might be explained. These=\r\n have been touched on in this and other threads, but it might be useful to =\r\nreview.\n=A0\nThe first is known as &quot;telepathy&quot; or &quot;thought transference&quot;. It=\r\n involves two living people sharing thoughts. Most ESP tests are contrived =\r\nwith the expectation of demonstrating telepathy. But there is a little prob=\r\nlem. They can as easily demonstrate &quot;clarivoyance&quot; which is the second know=\r\n way of communicating. Clairvoyance (which literally means &quot;clear seeing&quot;) =\r\nis a supposed ability that some have to see things that either are, were or=\r\n will be. Some people hear things instead of seeing them, this known as cla=\r\niraudience. In fact any sense can be appealed to in this way. The point is =\r\nthat an actual event is being sensed and reported. So in the clairvoyant ex=\r\nample, you are simply showing that someone might have known of an event in =\r\nthe past (when you recorded something for example), in the present (what&#39;s =\r\non a paper you placed in a location without looking yourself) or in the fut=\r\nure (when the contents of the paper were discovered).\nThis problem was solv=\r\ned nicely in 1936 by Dr. Elizabeth McMann at Duke University when she devel=\r\noped the &quot;true telepathy test.&quot; Simply put, the test requires that no targe=\r\nt ever be recorded per se. Instead aliases for target are kept in memory an=\r\nd the aliases compared post hoc. This way there is never=A0a physcial recor=\r\nd of the actual targets - the only place the target object information exis=\r\nts is in the minds of the subjects. So telepathy must be in play if success=\r\nes are found and clairvoyance is effectively ruled out. One small detail th=\r\nough, subjects can NEVER discuss the actual test objects throughout their l=\r\nifetimes or the test will be invalidated as precognitive clairvoyance could=\r\n then become an explanation.\n=A0\nEven if you didn&#39;t fully understand the pr=\r\neceding paragraphy, I hope you can see that tests of this sort are not triv=\r\nial, and imposing proper controls is sort of an art form.\n=A0\nOf course the=\r\n third explanation for anomalous information transfer is based on After-Dea=\r\nth Communication or ADC which is the unique provenance of the medium (as op=\r\nposed to a psychic). \n=A0\nI hope this is of some interest.\n=A0\n=A0 JS\n\n\n   =\r\n   \r\n--0-1679393363-1239556815=:89848\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;&lt;head&gt;&lt;style type=3D&quot;text/css&quot;&gt;&lt;!-- DIV {margin:0px;} --&gt;&lt;/style&gt;&lt;/he=\r\nad&gt;&lt;body&gt;&lt;div style=3D&quot;font-family:times new roman, new york, times, serif;=\r\nfont-size:12pt&quot;&gt;&lt;P&gt;I have been testing claimants of mediumship for many yea=\r\nrs. One of the central issues we constantly deal with is identifying the so=\r\nurce of the anomalous information. First let&#39;s establish that &quot;proof-orient=\r\ned&quot; research simply will not answer this question. Proof-oriented research =\r\n(such as does the supposed discarnate know specifici information) has been =\r\nused in the past to establish that anomalous information transfer can occur=\r\n.. &quot;Anomalous information transfer&quot; is a fancy way of saying that something=\r\n is known somehow to someone in a way that seems impossible. Mediums giving=\r\n legitimate reading for sitters is one example, psychics having validated i=\r\nmpressions is another.&lt;/P&gt;\n&lt;P&gt;&nbsp;&lt;/P&gt;\n&lt;P&gt;There&nbsp;are other issues wit=\r\nh proofs. One is that it appears that information does not come through wel=\r\nl when tests are too &quot;factual&quot; or there is no real need. In other words, ex=\r\nperiments motivated solely by a &quot;prove it&quot; attitude, tend to fail. We think=\r\n this is because of a form of experimenter effect. It has been observed tha=\r\nt the attitudes of experimenters, especially in psychological research, can=\r\n actually influence outcomes. A famous of experiments performed by Dr. Rich=\r\nard Wiseman and Dr. Marilyn Schlitz demonstrated this conclusively.&lt;/P&gt;\n&lt;P&gt;=\r\n&nbsp;&lt;/P&gt;\n&lt;P&gt;Given these points, how to proceed? The answer lies in &quot;proce=\r\nss-oriented&quot; research. Instead of worrying about proving things, especially=\r\n since we already know that we can get proof of anomalous information trans=\r\nfer, we focus on how the process seems to work and not work. This gives us =\r\nclues as to what might be going on and ultimately go give us greater confid=\r\nence as to the source of the information. Note that I said, &quot;could&quot; as in t=\r\nhe future, as in we don&#39;t really know now. That is the state of the art at =\r\nthis time. So we don&#39;t have&nbsp;a way today to determine this yet. &lt;/P&gt;\n&lt;P=\r\n&gt;&nbsp;&lt;/P&gt;\n&lt;P&gt;There are some other things you should know. There are three=\r\n known ways that apparent discarnate communications might be explained. The=\r\nse have been touched on in this and other threads, but it might be useful t=\r\no review.&lt;/P&gt;\n&lt;P&gt;&nbsp;&lt;/P&gt;\n&lt;P&gt;The first is known as &quot;telepathy&quot; or &quot;though=\r\nt transference&quot;. It involves two living people sharing thoughts. Most ESP t=\r\nests are contrived with the expectation of demonstrating telepathy. But the=\r\nre is a little problem. They can as easily demonstrate &quot;clarivoyance&quot; which=\r\n is the second know way of communicating. Clairvoyance (which literally mea=\r\nns &quot;clear seeing&quot;) is a supposed ability that some have to see things that =\r\neither are, were or will be. Some people hear things instead of seeing them=\r\n, this known as clairaudience. In fact any sense can be appealed to in this=\r\n way. The point is that an actual event is being sensed and reported. So in=\r\n the clairvoyant example, you are simply showing that someone might have kn=\r\nown of an event in the past (when you recorded something for example), in t=\r\nhe present (what&#39;s on a paper you placed in a location without looking your=\r\nself) or in the future (when the contents of the paper were discovered).&lt;/P=\r\n&gt;\n&lt;P&gt;This problem was solved nicely in 1936 by Dr. Elizabeth McMann at Duke=\r\n University when she developed the &quot;true telepathy test.&quot; Simply put, the t=\r\nest requires that no target ever be recorded per se. Instead aliases for ta=\r\nrget are kept in memory and the aliases compared post hoc.. This way there =\r\nis never&nbsp;a physcial record of the actual targets - the only place the =\r\ntarget object information exists is in the minds of the subjects. So telepa=\r\nthy must be in play if successes are found and clairvoyance is effectively =\r\nruled out. One small detail though, subjects can NEVER discuss the actual t=\r\nest objects throughout their lifetimes or the test will be invalidated as p=\r\nrecognitive clairvoyance could then become an explanation.&lt;/P&gt;\n&lt;P&gt;&nbsp;&lt;/P=\r\n&gt;\n&lt;P&gt;Even if you didn&#39;t fully understand the preceding paragraphy, I hope y=\r\nou can see that tests of this sort are not trivial, and imposing proper con=\r\ntrols is sort of an art form.&lt;/P&gt;\n&lt;P&gt;&nbsp;&lt;/P&gt;\n&lt;P&gt;Of course the third expl=\r\nanation for anomalous information transfer is based on After-Death Communic=\r\nation or ADC which is the unique provenance of the medium (as opposed to a =\r\npsychic). &lt;/P&gt;\n&lt;P&gt;&nbsp;&lt;/P&gt;\n&lt;P&gt;I hope this is of some interest.&lt;/P&gt;\n&lt;P&gt;&nb=\r\nsp;&lt;/P&gt;\n&lt;P&gt;&nbsp; JS&lt;/P&gt;\n&lt;P&gt;&nbsp;&lt;/P&gt;&lt;/div&gt;&lt;br&gt;\n\n\n\n      &lt;/body&gt;&lt;/html&gt;\r\n--0-1679393363-1239556815=:89848--"}