{"id": "13785", "subject": "Re: An alternative to the usual ghost hunter stuff.", "author": "John S", "timestamp": "2009-04-13T17:44:15Z", "full_text": "--0-500306273-1239644655=:61558\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nThe problem we run into is what actually constitutes evidence of spirit com=\r\nmunication? This is the heart of the matter. As I said in the other thread,=\r\n one cannot simply assume that unexplained information defacto proves spiri=\r\nt communication or even external sources. \nThe reason is simple. It is quit=\r\ne possible for internal and/or external influences to be exerted in=A0an ex=\r\nperiment. Let us say you are doing an experiment and you are the only parti=\r\ncipant. We&#39;ll set aside the obvious challenge of reporting credibility for =\r\nthe moment. How do you truly know it&#39;s not you and even worse, how do you k=\r\nnow who in fact the external communicator is? Simply knowing facts is not s=\r\nufficient. Especially in cases where PK may be in play (such as the Ouija e=\r\nxample) a remote PK agent could be influencing the planchette. Before rulin=\r\ng this out, consider that the very notion that anyone is moving anything is=\r\n problematic for many people. And spirit communication pushes the edge of t=\r\nhe belief envelope for others. In the end, all of this is some form of anom=\r\nalous phenomena. You could know things of which you are unaware. Consider t=\r\nhat you might be clairvoyant and not even realize it. If you were to extern=\r\nalize this through a latent PK\n mechanism, bingo, you are the agent and the=\r\n source of information. Yet to all appearances the information came from el=\r\nsewhere and you therefore presume it must be external to yourself, which in=\r\n this example would not be true..\n=A0\nI was taking advantage of the physica=\r\nl nature of the experiment I proposed. Unfortunately this is what is requir=\r\ned=A0if one wishes to remove=A0reliance on belief systems alone. This is wh=\r\nat many in the field=A0are looking for. From my own work with mediums and o=\r\nther sensitives, I have learned the perils and the potential pitfalls with =\r\nour own perceptual systems, memories and recall. All of this works against =\r\nus in even the most trivial experimental set up, which is unfortunate but t=\r\nrue. This is yet one more reason to exercise caution with solely anecdotal =\r\nexperimental outcomes. You will find that independent historical validation=\r\n is actualy pretty tricky, as I have said before, because it often is not s=\r\nimply factual in nature. It tends to be more about emotions and feelings an=\r\nd that&#39;s where specifically identifying an individual gets dicey.\n=A0\nI wis=\r\nh you all the best in your efforts, whatever path you may chose.\n=A0\n=A0 JS=\r\n\n\n\n      \r\n--0-500306273-1239644655=:61558\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;&lt;head&gt;&lt;style type=3D&quot;text/css&quot;&gt;&lt;!-- DIV {margin:0px;} --&gt;&lt;/style&gt;&lt;/he=\r\nad&gt;&lt;body&gt;&lt;div style=3D&quot;font-family:times new roman, new york, times, serif;=\r\nfont-size:12pt&quot;&gt;&lt;P&gt;The problem we run into is what actually constitutes evi=\r\ndence of spirit communication? This is the heart of the matter. As I said i=\r\nn the other thread, one cannot simply assume that unexplained information d=\r\nefacto proves spirit communication or even external sources. &lt;/P&gt;\n&lt;P&gt;The re=\r\nason is simple. It is quite possible for internal and/or external influence=\r\ns to be exerted in&nbsp;an experiment. Let us say you are doing an experime=\r\nnt and you are the only participant. We&#39;ll set aside the obvious challenge =\r\nof reporting credibility for the moment. How do you truly know it&#39;s not you=\r\n and even worse, how do you know who in fact the external communicator is? =\r\nSimply knowing facts is not sufficient. Especially in cases where PK may be=\r\n in play (such as the Ouija example) a remote PK agent could be influencing=\r\n the planchette. Before ruling this out, consider that the very notion that=\r\n anyone is moving anything is problematic for many people. And spirit commu=\r\nnication pushes the edge of the belief envelope for others. In the end, all=\r\n of this is some form of anomalous phenomena. You could know things of whic=\r\nh you are unaware. Consider that you might be clairvoyant and not even real=\r\nize it. If you were to externalize this through a latent PK\n mechanism, bin=\r\ngo, you are the agent and the source of information. Yet to all appearances=\r\n the information came from elsewhere and you therefore presume it must be e=\r\nxternal to yourself, which in this example would not be true..&lt;/P&gt;\n&lt;P&gt;&nbsp=\r\n;&lt;/P&gt;\n&lt;P&gt;I was taking advantage of the physical nature of the experiment I =\r\nproposed. Unfortunately this is what is required&nbsp;if one wishes to remo=\r\nve&nbsp;reliance on belief systems alone. This is what many in the field&nb=\r\nsp;are looking for. From my own work with mediums and other sensitives, I h=\r\nave learned the perils and the potential pitfalls with our own perceptual s=\r\nystems, memories and recall. All of this works against us in even the most =\r\ntrivial experimental set up, which is unfortunate but true. This is yet one=\r\n more reason to exercise caution with solely anecdotal experimental outcome=\r\ns. You will find that independent historical validation is actualy pretty t=\r\nricky, as I have said before, because it often is not simply factual in nat=\r\nure. It tends to be more about emotions and feelings and that&#39;s where speci=\r\nfically identifying an individual gets dicey.&lt;/P&gt;\n&lt;P&gt;&nbsp;&lt;/P&gt;\n&lt;P&gt;I wish y=\r\nou all the best in your efforts, whatever path you may chose.&lt;/P&gt;\n&lt;P&gt;&nbsp;=\r\n&lt;/P&gt;\n&lt;P&gt;&nbsp; JS&lt;/P&gt;&lt;/div&gt;&lt;br&gt;\n\n      &lt;/body&gt;&lt;/html&gt;\r\n--0-500306273-1239644655=:61558--"}