{"id": "13787", "subject": "Re: [EVP-ITC] Re: An alternative to the usual ghost hunter stuff.", "author": "April Abercrombie", "timestamp": "2009-04-13T18:25:57Z", "full_text": "------=_NextPart_000_0159_01C9BC32.FF1D0B50\r\nContent-Type: text/plain;\n\tcharset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n\n\n\n&quot;The problem we run into is what actually constitutes evidence of spirit=\r\n communication? This is the heart of the matter. As I said in the other thr=\r\nead, one cannot simply assume that unexplained information defacto proves s=\r\npirit communication or even external sources.&quot;\n\nBy employing the techniques=\r\n I posted earlier we can rule out human interference. It would take several=\r\n small steps. Testing all results along the way, including testing myself f=\r\nor prominent psychic abilities, and any witnesses as well. I have been test=\r\ned long ago in school, and my score was no greater then chance.\n\nI believe =\r\nwe all have physic abilities latent within us. Just some are better. But th=\r\nrough careful controls and consistent testing of results, I believe we can =\r\ncome as close as humanly possible to ruling out interference from a living,=\r\n human influence.\n\nAnother test that I would be interesting in performing i=\r\ns the use of a reputable psychic who has consistently provided credible inf=\r\normation, and has been tested positive for psychic abilities.\n\nFirst you wo=\r\nuld use the Ouija without this person&#39;s presence to get your control. Then =\r\nrun experiments where this person actively tries to influence the board, an=\r\nd also experiments where this person is present, but does not actively try =\r\nto influence the board. By observing the results obtained in each scenario,=\r\n you will be able to pinpoint more effectively what effect, if any, psychic=\r\n abilities have on the board.\n\n\n  ----- Original Message ----- \n  From: Joh=\r\nn S \n  To: EVP-ITC@yahoogroups.com \n  Sent: Monday, April 13, 2009 11:44 AM=\r\n\n  Subject: [EVP-ITC] Re: An alternative to the usual ghost hunter stuff.\n\n=\r\n\n\n\n\n\n  The problem we run into is what actually constitutes evidence of spi=\r\nrit communication? This is the heart of the matter. As I said in the other =\r\nthread, one cannot simply assume that unexplained information defacto prove=\r\ns spirit communication or even external sources. \n\n  The reason is simple. =\r\nIt is quite possible for internal and/or external influences to be exerted =\r\nin an experiment. Let us say you are doing an experiment and you are the on=\r\nly participant. We&#39;ll set aside the obvious challenge of reporting credibil=\r\nity for the moment. How do you truly know it&#39;s not you and even worse, how =\r\ndo you know who in fact the external communicator is? Simply knowing facts =\r\nis not sufficient. Especially in cases where PK may be in play (such as the=\r\n Ouija example) a remote PK agent could be influencing the planchette. Befo=\r\nre ruling this out, consider that the very notion that anyone is moving any=\r\nthing is problematic for many people. And spirit communication pushes the e=\r\ndge of the belief envelope for others. In the end, all of this is some form=\r\n of anomalous phenomena. You could know things of which you are unaware. Co=\r\nnsider that you might be clairvoyant and not even realize it. If you were t=\r\no externalize this through a latent PK mechanism, bingo, you are the agent =\r\nand the source of information. Yet to all appearances the information came =\r\nfrom elsewhere and you therefore presume it must be external to yourself, w=\r\nhich in this example would not be true..\n\n\n\n  I was taking advantage of the=\r\n physical nature of the experiment I proposed. Unfortunately this is what i=\r\ns required if one wishes to remove reliance on belief systems alone. This i=\r\ns what many in the field are looking for. From my own work with mediums and=\r\n other sensitives, I have learned the perils and the potential pitfalls wit=\r\nh our own perceptual systems, memories and recall. All of this works agains=\r\nt us in even the most trivial experimental set up, which is unfortunate but=\r\n true. This is yet one more reason to exercise caution with solely anecdota=\r\nl experimental outcomes. You will find that independent historical validati=\r\non is actualy pretty tricky, as I have said before, because it often is not=\r\n simply factual in nature. It tends to be more about emotions and feelings =\r\nand that&#39;s where specifically identifying an individual gets dicey.\n\n\n\n  I =\r\nwish you all the best in your efforts, whatever path you may chose.\n\n\n\n    =\r\nJS\n\n\n\n\n  \r\n------=_NextPart_000_0159_01C9BC32.FF1D0B50\r\nContent-Type: text/html;\n\tcharset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML 4.0 Transitional//EN&quot;&gt;\n&lt;HTML&gt;&lt;HEAD&gt;=\r\n\n&lt;META content=3D&quot;text/html; charset=3Diso-8859-1&quot; http-equiv=3DContent-Typ=\r\ne&gt;\n&lt;META name=3DGENERATOR content=3D&quot;MSHTML 8.00.6001.18702&quot;&gt;&lt;/HEAD&gt;\n&lt;BODY =\r\nstyle=3D&quot;BACKGROUND-COLOR: #ffffff&quot; bgColor=3D#ffffff&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 =\r\nface=3D&quot;Myriad Pro&quot;&gt;&lt;BR&gt;\n&lt;P&gt;\n&lt;DIV \nstyle=3D&quot;FONT-FAMILY: times new roman, n=\r\new york, times, serif; FONT-SIZE: 12pt&quot;&gt;\n&lt;P&gt;&quot;The problem we run into is wha=\r\nt actually constitutes evidence of spirit \ncommunication? This is the heart=\r\n of the matter. As I said in the other thread, \none cannot simply assume th=\r\nat unexplained information defacto proves spirit \ncommunication or even ext=\r\nernal sources.&quot;&lt;/P&gt;&lt;/DIV&gt;&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 face=3D&quot;Myriad P=\r\nro&quot;&gt;By employing the techniques I posted earlier \nwe can&nbsp;rule out huma=\r\nn interference. It would take several small steps. \nTesting all results alo=\r\nng the way, including testing myself for prominent \npsychic abilities, and =\r\nany witnesses as well. I have been tested long ago in \nschool, and my score=\r\n was no greater then chance.&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 face=3D&quot;Myria=\r\nd Pro&quot;&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 face=3D&quot;Myriad Pro&quot;&gt;I believ=\r\ne we all have physic abilities \nlatent within us. Just some are better. But=\r\n through careful controls \nand&nbsp;consistent testing of results, I believ=\r\ne we can&nbsp;come&nbsp;as close \nas humanly possible to ruling out interfe=\r\nrence from a living, human \ninfluence.&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 fac=\r\ne=3D&quot;Myriad Pro&quot;&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 face=3D&quot;Myriad Pro=\r\n&quot;&gt;Another test that I would be interesting in \nperforming is the&nbsp;use o=\r\nf&nbsp;a reputable psychic who has consistently \nprovided credible informat=\r\nion, and has been tested positive for psychic \nabilities.&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV=\r\n&gt;&lt;FONT size=3D2 face=3D&quot;Myriad Pro&quot;&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2=\r\n face=3D&quot;Myriad Pro&quot;&gt;First you would use the Ouija without this \nperson&#39;s p=\r\nresence to get your control. Then run experiments where this person \nactive=\r\nly tries to influence the board, and also experiments where this person is =\r\n\npresent, but does not actively try to influence the board. By observing th=\r\ne \nresults obtained in each&nbsp;scenario,&nbsp;you will be able to pinpoin=\r\nt more \neffectively&nbsp;what effect, if any,&nbsp;psychic abilities&nbsp;h=\r\nave on \nthe&nbsp;board.&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 face=3D&quot;Myriad Pro=\r\n&quot;&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 face=3D&quot;Myriad Pro&quot;&gt;&lt;/FONT&gt;&nbsp;=\r\n&lt;/DIV&gt;\n&lt;BLOCKQUOTE \nstyle=3D&quot;BORDER-LEFT: #000000 2px solid; PADDING-LEFT: =\r\n5px; PADDING-RIGHT: 0px; MARGIN-LEFT: 5px; MARGIN-RIGHT: 0px&quot; \ndir=3Dltr&gt;\n =\r\n &lt;DIV style=3D&quot;FONT: 10pt arial&quot;&gt;----- Original Message ----- &lt;/DIV&gt;\n  &lt;DIV=\r\n \n  style=3D&quot;FONT: 10pt arial; BACKGROUND: #e4e4e4; font-color: black&quot;&gt;&lt;B&gt;F=\r\nrom:&lt;/B&gt; \n  &lt;A title=3Dphenom_investigator@... \n  href=3D&quot;mailto:phen=\r\nom_investigator@...&quot;&gt;John S&lt;/A&gt; &lt;/DIV&gt;\n  &lt;DIV style=3D&quot;FONT: 10pt ari=\r\nal&quot;&gt;&lt;B&gt;To:&lt;/B&gt; &lt;A title=3DEVP-ITC@yahoogroups.com \n  href=3D&quot;mailto:EVP-ITC=\r\n@yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups.com&lt;/A&gt; &lt;/DIV&gt;\n  &lt;DIV style=3D&quot;FONT: =\r\n10pt arial&quot;&gt;&lt;B&gt;Sent:&lt;/B&gt; Monday, April 13, 2009 11:44 \n  AM&lt;/DIV&gt;\n  &lt;DIV st=\r\nyle=3D&quot;FONT: 10pt arial&quot;&gt;&lt;B&gt;Subject:&lt;/B&gt; [EVP-ITC] Re: An alternative to \n =\r\n the usual ghost hunter stuff.&lt;/DIV&gt;\n  &lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n  &lt;DIV id=3Dygrp-tex=\r\nt&gt;\n  &lt;P&gt;\n  &lt;DIV \n  style=3D&quot;FONT-FAMILY: times new roman, new york, times, =\r\nserif; FONT-SIZE: 12pt&quot;&gt;\n  &lt;P&gt;The problem we run into is what actually cons=\r\ntitutes evidence of spirit \n  communication? This is the heart of the matte=\r\nr. As I said in the other thread, \n  one cannot simply assume that unexplai=\r\nned information defacto proves spirit \n  communication or even external sou=\r\nrces. &lt;/P&gt;\n  &lt;P&gt;The reason is simple. It is quite possible for internal and=\r\n/or external \n  influences to be exerted in&nbsp;an experiment. Let us say =\r\nyou are doing an \n  experiment and you are the only participant. We&#39;ll set =\r\naside the obvious \n  challenge of reporting credibility for the moment. How=\r\n do you truly know it&#39;s \n  not you and even worse, how do you know who in f=\r\nact the external communicator \n  is? Simply knowing facts is not sufficient=\r\n. Especially in cases where PK may \n  be in play (such as the Ouija example=\r\n) a remote PK agent could be influencing \n  the planchette. Before ruling t=\r\nhis out, consider that the very notion that \n  anyone is moving anything is=\r\n problematic for many people. And spirit \n  communication pushes the edge o=\r\nf the belief envelope for others. In the end, \n  all of this is some form o=\r\nf anomalous phenomena. You could know things of \n  which you are unaware. C=\r\nonsider that you might be clairvoyant and not even \n  realize it. If you we=\r\nre to externalize this through a latent PK mechanism, \n  bingo, you are the=\r\n agent and the source of information. Yet to all appearances \n  the informa=\r\ntion came from elsewhere and you therefore presume it must be \n  external t=\r\no yourself, which in this example would not be true..&lt;/P&gt;\n  &lt;P&gt;&nbsp;&lt;/P&gt;\n =\r\n &lt;P&gt;I was taking advantage of the physical nature of the experiment I propo=\r\nsed. \n  Unfortunately this is what is required&nbsp;if one wishes to \n  rem=\r\nove&nbsp;reliance on belief systems alone. This is what many in the \n  fiel=\r\nd&nbsp;are looking for. From my own work with mediums and other \n  sensitiv=\r\nes, I have learned the perils and the potential pitfalls with our own \n  pe=\r\nrceptual systems, memories and recall. All of this works against us in even=\r\n \n  the most trivial experimental set up, which is unfortunate but true. Th=\r\nis is \n  yet one more reason to exercise caution with solely anecdotal expe=\r\nrimental \n  outcomes. You will find that independent historical validation =\r\nis actualy \n  pretty tricky, as I have said before, because it often is not=\r\n simply factual \n  in nature. It tends to be more about emotions and feelin=\r\ngs and that&#39;s where \n  specifically identifying an individual gets dicey.&lt;/=\r\nP&gt;\n  &lt;P&gt;&nbsp;&lt;/P&gt;\n  &lt;P&gt;I wish you all the best in your efforts, whatever p=\r\nath you may chose.&lt;/P&gt;\n  &lt;P&gt;&nbsp;&lt;/P&gt;\n  &lt;P&gt;&nbsp; JS&lt;/P&gt;&lt;/DIV&gt;&lt;BR&gt;\n  &lt;P&gt;&lt;/=\r\nP&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BODY&gt;&lt;/HTML&gt;\n\r\n------=_NextPart_000_0159_01C9BC32.FF1D0B50--"}