{"id": "13784", "subject": "Re: [EVP-ITC] How I spend every weekend! [2 Attachments]", "author": "Zack Widup", "timestamp": "2009-04-13T15:40:53Z", "full_text": "I have had great luck with the Datak chemicals up to about 4 months ago. The\nER-71 photoresist and ER-8 developer did a fine job for boards I made\nincluding some millimeter-wave circuits on 5 mil thick Duroid that required\ntolerances to a couple thousandths of an inch.\n\nHowever, either the quality control of Datak photoresist has gone to hell or\nthey changed it, because I&#39;ve had a lot of trouble getting even coats of it\non the boards with the newer ER-71. I asked them about it with no replies.\n\nI&#39;ve gotten lots of G-10/FR-4 board material of all sizes and thicknesses at\nhamfests. It&#39;s usually pretty cheap there. A couple years ago I got some\n2-ft square pieces of .062 inch thick G-10, double-sided copper, for $3\napiece.\n\nYou can cut grooves in the copper with an X-Acto knife, making individual\npads on the board that work quite well. I&#39;ve done that too.\n\nZack\n\n\nOn Mon, Apr 13, 2009 at 9:43 AM, Frank Sumption\n&lt;purplealiengirl@...&gt;wrote:\n\n&gt;   [Attachment(s) &lt;#1209fefe65dd6616_TopText&gt; from Frank Sumption included\n&gt; below]\n&gt;\n&gt;  I really need to get a life! I never did have much luck trying to etch\n&gt; boards, probably due to lack of a proper etching tank, but I just use a home\n&gt; made wood chissle made out of a ground down saber saw blade to cut the\n&gt; traces, or pads. This is actually faster than hand wiring a perf board--and\n&gt; more reliable! I do use a drill press, and little micro drills, and if I\n&gt; have enough area around a pad I use a dremel tool. This time I&#39;ve leaving\n&gt; out IC sockets, except for the function generator chip. My mother always\n&gt; said I had the patience of a saint!\n&gt;\n&gt;  BTW, the copper board is from Radio Shack, seems like RS is the number one\n&gt; supplier of EVP supplies.\n&gt;\n&gt;  F-S\n&gt;  \n&gt;\n\nI ha e had g ea luck wi h he Da ak chemicals up o abou 4 mon hs ago. The ER-71 pho o esis and ER-8 de elope did a ine job o boa ds I made including some millime e -wa e ci cui s on 5 mil hick Du oid ha equi ed ole ances o a couple housand hs o an inch.\nHowe e , ei he he quali y con ol o Da ak pho o esis has gone o hell o hey changed i , because I' e had a lo o ouble ge ing e en coa s o i on he boa ds wi h he newe ER-71. I asked hem abou i wi h no eplies.\nI' e go en lo s o G-10/FR-4 boa d ma e ial o all sizes and hicknesses a ham es s. I 's usually p e y cheap he e. A couple yea s ago I go some 2- squa e pieces o .062 inch hick G-10, double-sided coppe , o $3 apiece.\nYou can cu g oo es in he coppe wi h an X-Ac o kni e, making indi idual pads on he boa d ha wo k qui e well. I' e done ha oo. ZackOn Mon, Ap 13, 2009 a 9:43 AM, F ank Sump ion pu plealiengi l@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n \n [A achmen (s) om F ank Sump ion included below]\n \n \n  I eally need o ge a li e! I ne e did ha e much luck ying o e ch boa ds, p obably due o lack o a p ope e ching ank, bu I jus use a home made wood chissle made ou o a g ound down sabe saw blade o cu he aces, o pads. This is ac ually as e han hand wi ing a pe boa d--and mo e eliable! I do use a d ill p ess, and li le mic o d ills, and i I ha e enough a ea a ound a pad I use a d emel ool. This ime I' e lea ing ou IC socke s, excep o he unc ion gene a o chip. My mo he always said I had he pa ience o a sain !\n\n\n \n BTW, he coppe boa d is om Radio Shack, seems like RS is he numbe one supplie o EVP supplies. \n \n F-S"}