{"id": "13816", "subject": "Re: An alternative to the usual ghost hunter stuff.", "author": "Rick", "timestamp": "2009-04-15T20:24:29Z", "full_text": "Anyone have any luck with this calibration experiment?\n\n(Note this experiment isn&#39;t for anyone who just likes to play around with their board, and doesn&#39;t really care to know its accuracy. This is for those interested in determining how well their board approach works).\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;Rick&quot; &lt;rasterer@...&gt; wrote:\n&gt;\n&gt; If anyone feels like calibrating their board, or wants to know if they can get accurate information from it, I have written down a number between 1 and a billion (1,000,000,000)\n&gt; \n&gt; Let me know what your board thinks it is. \n&gt; If it gets it correct, sounds like you&#39;ve got something important going on there!\n&gt; \n&gt; If it can&#39;t get it correct, I suppose that brings into suspect all its other answers.\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;threadsintyme@&quot; &lt;Threadsintyme@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hi Lori,\n&gt; &gt; Glad that you brought this up! A true medium can give you a lot of the details that Ouija boards can&#39;t. They can also give you complete names, dates, info that is totally unknown to others (except for those directly involved). \n&gt; &gt; There are some excellent readings on YouTube and I don&#39;t mean the crappy ones...I forgot what this one guy&#39;s name was (he is in spirit now) but he could tel you details!! I almost my skin chill...\n&gt; &gt; I will see if I can locate some of those highly respected members of Spiritualism and will post those here for all of you to watch.\n&gt; &gt; Blessings,\n&gt; &gt; Al\n&gt; &gt; \n&gt; &gt; ---------- Original Message ----------\n&gt; &gt; From: lori bogren &lt;loribogren@&gt;\n&gt; &gt; To: &lt;evp-itc@yahoogroups.com&gt;\n&gt; &gt; Subject: RE: [EVP-ITC] An alternative to the usual ghost hunter stuff.\n&gt; &gt; Date: Fri, 10 Apr 2009 19:11:33 -0500\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; April~\n&gt; &gt;  \n&gt; &gt; You forgot yawn from boredom, that&#39;s what I do.\n&gt; &gt;  \n&gt; &gt; Use it, don&#39;t use it.  I don&#39;t care.  But why bother.  When people ask me I usually suggest that if they want to communicate with ... whatever why not develop the ability yourself.  - ya, I&#39;m one of those who believe anyone can.\n&gt; &gt;  \n&gt; &gt; There&#39;s always the question in the back of your mind whether your partner&#39;s moving it.  The intentions of &quot;what&quot; you are talking to.  Not to mention it&#39;s too slow and limited.\n&gt; &gt;  \n&gt; &gt; Besides if you take the time to develop the ability you can get more texture in the information.  Asking the board &quot;where you married?&quot; may get you a &quot;yes&quot; but a psychic might get the sense of a religious or civil ceremonhy, the garment(s) worn, other&#39;s in the party, or whether that Being approved/disapproved of their spouse (ie was it a reluctant union).\n&gt; &gt;  \n&gt; &gt; ~Lori\n&gt; &gt; \n&gt; &gt; &quot;My life is boring, my fantasies are a theme park.&quot; --Anne Rice  Responding to an interviewer who just did not get it. \n&gt; &gt;   \n&gt; &gt; To: EVP-ITC@yahoogroups.com\n&gt; &gt; From: april@\n&gt; &gt; Date: Fri, 10 Apr 2009 08:32:45 -0600\n&gt; &gt; Subject: Re: [EVP-ITC] An alternative to the usual ghost hunter stuff.\n&gt; &gt; \n&gt; &gt; .Yeah-that&#39;s the problem with it I have found too. Most people, when you mention Ouija, either run screaming, or bring up religion. ----- Original Message ----- From: Frank Sumption To: EVP-ITC@yahoogroups.com Sent: Friday, April 10, 2009 8:26 AMSubject: Re: [EVP-ITC] An alternative to the usual ghost hunter stuff.\n&gt; &gt; Yeah, it&#39;s a boards --board--hehe. Naw just checking out different stuff, but mostly it&#39;s alot of newagy stuff.   F-S \n&gt; &gt; \n&gt; &gt; Rediscover Hotmail: Get e-mail storage that grows with you. Check it out. \n&gt; &gt; \n&gt; &gt; ____________________________________________________________\n&gt; &gt; Prices, software, charts & analysis.  Click here to open your online FX trading account.\n&gt; &gt; http://thirdpartyoffers.juno.com/TGL2131/fc/BLSrjnsHQoL2gherkvSXjocnYs0nHbAbkFFspiUgrnj4x9diywtpSxe5Xjy/\n&gt; &gt;\n&gt;"}