{"id": "1385", "subject": "Re: [EVP-ITC] Reason for my Interest in the Box", "author": "Misty Dawn", "timestamp": "2007-06-18T03:57:42Z", "full_text": "--0-832136874-1182139062=:36105\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nHi Steve\n   \n  Yeah just look around theres been some great discussion on some topics here. I too grew up in a house that seemed paranormally active. The surprise for me was after moving noticing a few tagged along for the ride.In the old house I could hear the &quot;voices&quot; usually when I went to bed and everything was quiet. So I got loud fans etc to try and blast me to sleep...still heard the voices of course only a bit louder...now I see why. Certain places hold memories a bit like the tapes some people record on...those are echos of spirits you cant quite seem to interact with. They liked to take/hide things. Peoples keys, hairbrush, small things that were right in front of you one minute and no where to be found the next. Later it would be returned usually to that place you looked a dozen times because you know thats where you put it, but every now and then someplace new or once even someplace I hadnt been to at all. After moving the game changed a bit, I would get things &quot;returned&quot;\n including a ring I lost on numerous occasions because I needed to get it resized. Once I went out to dinner and I realized once I got home I had lost my ring. I knew I did it when I wiped my hands with the napkin and so we called the restaurant... Lets just say I didnt have the heart to make them dig thru them all and tho a little sad I had finally lost it for good...I knew it was gone. A week later my boyfriends mother found it in her storage room at her house...a place I hadnt been in at all. She said it was weird she opened the foor and there it was laying right there. \n   \n  Thats the last time I wore that ring I put it away until I get it resized LOL which I am in no hurry to do.\n   \n  They are there around us...always were always will be. It is the way you notice them and the connection you make...or dont make...that will shape the experience you have and the lessons you learn. If you have fear they can make you very afraid, if you have no fear then theres no button for them to press.\n   \n  Good luck with the box! You are right it is something you have to adjust to. Your hearing will adjust and your dedication will pay off. No matter what method is used, I still get the same voices/entities. Tho with each new method there are new additions to the &quot;circle&quot;. The voices I grew up hearing in the old house are not always mumbles anymore. I always thought maybe it used to be an old indian burial ground or something close by because I had found very old artifacts as a kid. But turns out the house just made it easier for them to communicate. \n   \n  So even tho I no longer live there, I now make that connection using other methods. I had no idea until I started this work they have always been watching, talking, waiting. I thought it was the house but turns out it was just a &#39;method&#39; and I was the subject. I just wasnt ready and had no idea how to connect, or was too scared to LOL. They used to freak me out a bit when I was very small. When things you cant see talk or sit on your bed or poke you or move things well your poor mom may have to sit at your bedside for a few ahemmm years until you get over your fear. LOL\n   \n  Not saying all haunted houses arent really haunted just saying in my case it was just a sort of gateway/window. \n   \n  So just remember when the gate opens its not always who you expect coming thru. Franks guys may give a hello.\n   \n  Misty\n   \n   \n  Steve Hultay &lt;urkel23@...&gt; wrote:\n          \nJust a little background, i grew up and now own the house i grew up \nin. It has been paranormally active all my life and am very curious \nabout who is here and why. This box idea has shed new light on this \narea in my life, because now i can possibly piece this puzzle \ntogether. My house was an old farm house built back in 1845 and i \nknow of 1 death in the home at least. The attic used to house \norphans and was used as a foster home in the early 1900&#39;s. I \ncurrently live alone and the more i learn about this field the more \ninterested i get about new items and ideas. I have been using my FM \nsweep version of the box for about 3 weeks and the sessions get \nbetter everyday. I started only hearing 1 word fragments, but now i \nam getting partial sentences. I tell them on the other side to keep \ntrying at this and to try to come across the whole band to form \ncomplete sentences and not just between random fm bits. I can hear \nthe difference, the static is actually coming across the whole band \nbut i am unable to make out the vocals yet. But they are trying. \nIf people are not getting the boxes to work, they just don&#39;t have \nthe patience. I could have stopped after day 1 or day 2 after \ngetting nothing, but i didn&#39;t. They need to get to know you and \nthey also need to learn how to speak through this device, so \npatience and practice is a key element. It will happen, just stick \nwith it people.\n\nGreat message board by the way. I learn more evrytime i go on \nhere. Please check out my Mp3&#39;s on the FILES section and tell me \nwhat you think. I haven&#39;t received a lot of feedback yet. At least \nmaybe someone can tell me about the FM radio i&#39;m using and if i&#39;m \nheading in the right direction.\n\nThanx,\n-Steve H.\n\n\n\n         \n\n       \n---------------------------------\nBuilding a website is a piece of cake. \nYahoo! Small Business gives you all the tools to get online.\r\n--0-832136874-1182139062=:36105\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;div&gt;Hi Steve&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Yeah just look around theres been some great discussion on some topics here. I too grew up in a house that seemed paranormally active. The surprise for me was after moving noticing a few tagged along for the ride.In the old house I could hear the &quot;voices&quot; usually when I went to bed and everything was quiet. So I got loud fans etc to try and blast me to sleep...still heard the voices of course only a bit louder...now I see why. Certain places hold memories a bit like the tapes some people record on...those are echos of spirits you cant quite seem to interact with.&nbsp;They&nbsp;liked to take/hide things. Peoples keys, hairbrush, small things that were right in front of you one minute and no where to be found the next. Later it would be returned usually to that place you looked a dozen times because you know thats where you put it,&nbsp;but every now and then someplace new or once even someplace I hadnt been to at all. After\n moving the game changed a bit, I would get things &quot;returned&quot; including a ring I lost on numerous occasions because I needed to get it resized. Once I went out to dinner and&nbsp;I realized once I got home I had lost my ring. I knew I did it when I wiped my hands with the napkin and so we called the restaurant... Lets just say I didnt have the heart to make them dig thru them all and tho a little sad I had finally lost it for good...I knew it was gone. A week later my boyfriends mother found it in her storage room at her house...a place I hadnt been in at all. She said it was weird she opened the foor and there it was laying right there. &lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Thats the last time I wore that ring I put it away until I get it resized LOL which I am in no hurry to do.&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;They are there around us...always were always will be. It is the way you notice them and the connection you make...or dont make...that will shape the experience you have\n and the lessons you learn. If you have fear they can make you very afraid, if you have no fear then theres no button for them to press.&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Good luck with the box! You are right it is something you have to adjust to. Your hearing will adjust and your dedication will pay off. No matter what method is used, I still get the same voices/entities. Tho with each new method there are new additions to the &quot;circle&quot;. The voices I grew up hearing in the old house are not always mumbles anymore. I always thought maybe it used to be an old indian burial ground or something close by because I had found very old artifacts as a kid. But turns out the house just made it easier for them to communicate. &lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;So even tho I no longer live there, I now make that connection using other methods. I had no idea until I started this work they have always been watching, talking, waiting. I thought it was the house&nbsp;but turns out it was just\n a&nbsp;&#39;method&#39; and I was the subject.&nbsp;I just wasnt ready and had no idea how to connect, or was too scared to LOL. They used to freak me out a bit when I was very small. When things you cant see talk or sit on your bed or poke you or move things well your poor mom may have to sit at your bedside for a few ahemmm years until you get over your fear. LOL&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Not saying all haunted houses arent really haunted just saying in my case it was just a sort of gateway/window. &lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;So just remember when the gate opens its not always who you expect coming thru.&nbsp;Franks guys may give a hello.&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Misty&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;&lt;B&gt;&lt;I&gt;Steve Hultay &lt;urkel23@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/div&gt;  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;&lt;!-- Network content --&gt;  &lt;DIV id=ygrp-text&gt;  &lt;div&gt;&lt;BR&gt;Just a little background, i grew up and now own the house i grew up &lt;BR&gt;in. It has been paranormally active all my life and am very curious &lt;BR&gt;about who is here and why. This box idea has shed new light on this &lt;BR&gt;area in my life, because now i can possibly piece this puzzle &lt;BR&gt;together. My house was an old farm house built back in 1845 and i &lt;BR&gt;know of 1 death in the home at least. The attic used to house &lt;BR&gt;orphans and was used as a foster home in the early 1900&#39;s. I &lt;BR&gt;currently live alone and the more i learn about this field the more &lt;BR&gt;interested i get about new items and ideas. I have been using my FM &lt;BR&gt;sweep version of the box for about 3 weeks and the sessions get &lt;BR&gt;better everyday. I started only hearing 1\n word fragments, but now i &lt;BR&gt;am getting partial sentences. I tell them on the other side to keep &lt;BR&gt;trying at this and to try to come across the whole band to form &lt;BR&gt;complete sentences and not just between random fm bits. I can hear &lt;BR&gt;the difference, the static is actually coming across the whole band &lt;BR&gt;but i am unable to make out the vocals yet. But they are trying. &lt;BR&gt;If people are not getting the boxes to work, they just don&#39;t have &lt;BR&gt;the patience. I could have stopped after day 1 or day 2 after &lt;BR&gt;getting nothing, but i didn&#39;t. They need to get to know you and &lt;BR&gt;they also need to learn how to speak through this device, so &lt;BR&gt;patience and practice is a key element. It will happen, just stick &lt;BR&gt;with it people.&lt;BR&gt;&lt;BR&gt;Great message board by the way. I learn more evrytime i go on &lt;BR&gt;here. Please check out my Mp3&#39;s on the FILES section and tell me &lt;BR&gt;what you think. I haven&#39;t received a lot of feedback yet. At least &lt;BR&gt;maybe someone can tell me about the\n FM radio i&#39;m using and if i&#39;m &lt;BR&gt;heading in the right direction.&lt;BR&gt;&lt;BR&gt;Thanx,&lt;BR&gt;-Steve H.&lt;BR&gt;&lt;BR&gt;&lt;/div&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;p&gt;&#32;\n      &lt;hr size=1&gt;Building a website is a piece of cake. &lt;br&gt;Yahoo! Small Business gives you &lt;a href=&quot;http://us.rd.yahoo.com/evt=48251/*http://smallbusiness.yahoo.com/webhosting/?p=PASSPORTPLUS&quot;&gt;all the tools to get online.&lt;/a&gt;\r\n--0-832136874-1182139062=:36105--"}