{"id": "13901", "subject": "Re: [EVP-ITC] Once again!", "author": "Zack Widup", "timestamp": "2009-04-24T15:08:44Z", "full_text": "Nothing surprises me anymore but I really get dismayed at all the so-called\nexperts out there, as you describe. Also, do any of these people have a\nsense of humor? Posting the duck voice is hilarious!\n\nI certainly ain&#39;t no expert. I&#39;ve gotten quite a few recordings that seem to\nbe real EVP and hundreds of hours of recording with no EVP in them at all.\n\nYou&#39;d think with the availability of the inexpensive RS radios that are\neasily hacked even by people with minimal electronics experience, people\nwould go that route instead of wanting boxes from you.\nI for one really have no interest in being in the limelight. I just do what\nI do and share it with a few friends.\n\nZack\nOn Fri, Apr 24, 2009 at 9:53 AM, Frank Sumption\n&lt;purplealiengirl@...&gt;wrote:\n\n&gt;\n&gt;\n&gt;   I was on the group My Para, supposedly a social network for paranormal\n&gt; researchers, even cut and paste Haliday is on there telling everyone he has\n&gt; the longest history in EVP. So I post that duck voice under most amusing\n&gt; EVPs, and apparently got banned from the group for that. I have had enough\n&gt; of every friggin&#39; idiot with a computer trying to be the worlds only\n&gt; EVP/Paranormnal expert, thinking they can judge what&#39;s real evidence. I\n&gt; absolutely refuse to make anymore boxes so some egomanic dweeb can set\n&gt; themselves up as the big expert.\n&gt;\n&gt;\n&gt;\n&gt;  This mostly falls on deaf ears, cuz everyone out there is too busy trying\n&gt; to be TAPS, and chasing limelights, not ghosts, and certainly not any\n&gt; knowledge!\n&gt;\n&gt; \n&gt;\n\nNo hing su p ises me anymo e bu I eally ge dismayed a all he so-called expe s ou he e, as you desc ibe. Also, do any o hese people ha e a sense o humo ? Pos ing he duck oice is hila ious!\n \nI ce ainly ain' no expe . I' e go en qui e a ew eco dings ha seem o be eal EVP and hund eds o hou s o eco ding wi h no EVP in hem a all.\n \nYou'd hink wi h he a ailabili y o he inexpensi e RS adios ha a e easily hacked e en by people wi h minimal elec onics expe ience, people would go ha ou e ins ead o wan ing boxes om you.\nI o one eally ha e no in e es in being in he limeligh . I jus do wha I do and sha e i wi h a  ew iends.\n \nZack\nOn F i, Ap 24, 2009 a 9:53 AM, F ank Sump ion pu plealiengi l@...> w o e:\n\n\n\n\n\n\n I was on he g oup My Pa a, supposedly a social ne wo k o pa ano mal esea che s, e en cu and pas e Haliday is on he e elling e e yone he has he longes his o y in EVP. So I pos ha duck oice unde mos amusing EVPs, and appa en ly go banned om he g oup o ha . I ha e had enough o e e y iggin' idio wi h a compu e ying o be he wo lds only EVP/Pa ano mnal expe , hinking hey can judge wha 's eal e idence. I absolu ely e use o make anymo e boxes so some egomanic dweeb can se hemsel es up as he big expe .  \n\n \n \n \n This mos ly alls on dea ea s, cuz e e yone ou he e is oo busy ying o be TAPS, and chasing limeligh s, no ghos s, and ce ainly no any knowledge!"}