{"id": "13907", "subject": "Re: Once again!", "author": "Angie", "timestamp": "2009-04-24T16:02:12Z", "full_text": "My long standing motto has been &quot;Eff &#39;em if they can&#39;t take a joke&quot;.  There are so many people faking evidence and no one calls them out for it.  EVP is electronic voice PHENOMENA.  It&#39;s up to the listener to decide what is, where it comes from and what it means.  Ultimately, there&#39;s no way to know where the messages are coming from or what is being conveyed.  It&#39;s just there.  \n\nI also agree that who says ghosts, spirits, aliens, whatever can&#39;t have a sense of humor?  I know that if I were out there &quot;haunting&quot; someplace and had any say about it, I&#39;d be doing silly things.  I&#39;ve often said to my husband that if he outlives me and weird stuff starts happening, it&#39;s me messing with him.  \n\nI understand your anger, though.  Why is it that in certain fields and areas of interst that everyone is an &quot;expert&quot;.  I&#39;m the first one to admit I&#39;m a newbie.  I&#39;m skeptical, but find paranormal research fascinating.\n\nAs for the people who want your inventions, I say... &quot;Make your own&quot;!  It&#39;s one thing for someone to recreate something that&#39;s already been created, but quite another to want something for nothing (and then use it for personal gain as well).\n\nAngie\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  I was on the group My Para, supposedly a social network for paranormal\n&gt; researchers, even cut and paste Haliday is on there telling everyone he has\n&gt; the longest history in EVP. So I post that duck voice under most amusing\n&gt; EVPs, and apparently got banned from the group for that. I have had enough\n&gt; of every friggin&#39; idiot with a computer trying to be the worlds only\n&gt; EVP/Paranormnal expert, thinking they can judge what&#39;s real evidence. I\n&gt; absolutely refuse to make anymore boxes so some egomanic dweeb can set\n&gt; themselves up as the big expert.\n&gt; \n&gt; \n&gt; \n&gt;  This mostly falls on deaf ears, cuz everyone out there is too busy trying\n&gt; to be TAPS, and chasing limelights, not ghosts, and certainly not any\n&gt; knowledge!\n&gt;"}