{"id": "13916", "subject": "Pandemic of 2009?", "author": "April Abercrombie", "timestamp": "2009-04-25T14:58:30Z", "full_text": "------=_NextPart_000_007F_01C9C584.017639D0\r\nContent-Type: text/plain;\n\tcharset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n\n\n\n\n\nWHO: Mexico swine flu has &#39;pandemic potential&#39;\n\nAssociated Press, Apri=\r\nl 25, 2009\n\nGENEVA - The head of the World Health Organization says the swi=\r\nne flu outbreak in Mexico and the United States could develop into a pandem=\r\nic.\n\nWHO Director-General Margaret Chan says the outbreak involves &quot;an anim=\r\nal strain of the H1N1 virus, and it has pandemic potential.&quot;\n\nChan says it =\r\nis too early to say whether a pandemic will actually occur.\n\nThe global hea=\r\nlth body has advised countries around the world to look out for similar out=\r\nbreaks following the discovery of related strains on both sides of the Mexi=\r\nco-U.S. border.\n\nAt least 62 people in Mexico have died from pneumonia afte=\r\nr contracting a flu-like virus. WHO says some tested positive for a strain =\r\nthat sickened at least seven in the southwestern U.S. No deaths have been r=\r\neported in the U.S.\n\nWHO Calls Emergency Meeting\n\nAssociated Press, April 2=\r\n4, 2009\n\nGENEVA - The World Health Organization has called an emergency mee=\r\nting of experts Saturday to consider declaring an international public heal=\r\nth emergency over the swine flu outbreak believed to have killed dozens of =\r\npeople in Mexico and sickened at least seven in the U.S.\n\nIt is the first t=\r\nime the WHO&#39;s Director-General Margaret Chan has convened such a crisis pan=\r\nel since the procedure was created almost two years ago, spokesman Gregory =\r\nHartl said.\n\nThe committee may decide Saturday that the outbreak constitute=\r\ns a public health emergency, and if so, whether WHO should consider measure=\r\ns including travel advisories, trade restrictions and border closures.\n\nThe=\r\n global body&#39;s flu pandemic alert level is now set to phase three - meaning=\r\n there is no or very limited risk of a new virus spreading from human to hu=\r\nman.\n\nThe committee &quot;will be asked, &#39;should we raise the alert level to pha=\r\nse four or phase five,&#39; depending on their appreciation of how far the viru=\r\ns has spread,&quot; Hartl said.\n\nAn increased alert level was considered likely,=\r\n as initial evidence from the outbreak in Mexico indicates the virus has sp=\r\nread between people. Hartl said, however, that a decision would not be made=\r\n Saturday.\n\nAt least 62 people have died from severe pneumonia caused by a =\r\nflu-like illness in Mexico, according to WHO. Some of those who died are co=\r\nnfirmed to have contracted a type of swine flu known as A/H1N1. That partic=\r\nular flu variant has not previously been seen in pigs or humans, though oth=\r\ner types of H1N1 have.\n\n&quot;This is a very high concern for us as the world&#39;s =\r\nglobal health organization,&quot; Hartl said.\n\nThe current seasonal flu vaccine =\r\nis not believed to offer any protection against this new swine flu. But ant=\r\ni-viral drug Tamiflu appears to be fully effective against the H1N1 virus, =\r\nand &quot;Mexico and the United States already have large stocks of Tamiflu,&quot; Ha=\r\nrtl said.\n\nThe virus has caused alarm in Mexico, where more than 1,000 peop=\r\nle have been sickened. Authorities there have closed schools, museums, libr=\r\naries and theaters in a bid to contain the outbreak.\n\nWHO, which has been m=\r\nonitoring the situation since Thursday, said 12 of the Mexican cases have b=\r\neen confirmed as genetically identical to a swine flu virus detected in Cal=\r\nifornia.\n\nU.S. authorities said seven people were infected with swine flu i=\r\nn California and Texas, and all recovered.\n\n&quot;We do seem to have found incid=\r\nents of the same illness, which is swine influenza A/H1N1, on both sides of=\r\n the border in various locations,&quot; Hartl said.\n\nWHO has sent experts to Mex=\r\nico to monitor the situation there, and asked countries to report any unusu=\r\nal flu outbreaks.\n\n&quot;We are at the beginning of the outbreak here, and there=\r\n are a lot of things that we still don&#39;t know,&quot; Hartl said.\n\n&quot;We&#39;re not sur=\r\ne exactly of the transmission routes, where the initial infection came from=\r\n, how efficient it is in transmitting,&quot; he said. WHO is also questioning &quot;w=\r\nhy no one has died in the United States so far whereas there have been conf=\r\nirmed deaths in Mexico.&quot;\n\nWHO chief Chan broke off a visit to Washington, w=\r\nhere she was to meet with U.S. officials, to oversee WHO&#39;s response to the =\r\ncrisis from its Strategic Health Operation Center in Switzerland.\n\nThe viru=\r\ns appears to cause flu-like symptoms that can develop into severe pneumonia=\r\n, Hartl said, urging anyone to visit a doctor if they had been to affected =\r\nareas and were feeling symptoms.\n\n&quot;You would want to take the same kind of =\r\nprecautions that you would do with pneumonia and an influenza-like illness,=\r\n&quot; he said.\n\n\n\n1918 influenza pandemic\n\n\n\r\n------=_NextPart_000_007F_01C9C584.017639D0\r\nContent-Type: text/html;\n\tcharset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML 4.0 Transitional//EN&quot;&gt;\n&lt;HTML&gt;&lt;HEAD&gt;=\r\n\n&lt;META content=3D&quot;text/html; charset=3Diso-8859-1&quot; http-equiv=3DContent-Typ=\r\ne&gt;\n&lt;META name=3DGENERATOR content=3D&quot;MSHTML 8.00.6001.18702&quot;&gt;&lt;/HEAD&gt;\n&lt;BODY =\r\nstyle=3D&quot;BACKGROUND-COLOR: #ffffff&quot; bgColor=3D#ffffff&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 =\r\nface=3D&quot;Myriad Pro&quot;&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV id=3Dygrp-text&gt;\n&lt;P&gt;\n&lt;P&gt;&lt;STRONG=\r\n&gt;&lt;FONT size=3D5 face=3Dverdana&gt;WHO: Mexico swine flu has &#39;pandemic \npotenti=\r\nal&#39;&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/P&gt;\n&lt;P&gt;&lt;FONT size=3D1&gt;Associated Press, April 25, 2009&lt;=\r\n/FONT&gt;&lt;/P&gt;\n&lt;P&gt;GENEVA =97 The head of the World Health Organization says the=\r\n swine flu \noutbreak in Mexico and the United States could develop into a p=\r\nandemic.&lt;/P&gt;\n&lt;P&gt;WHO Director-General Margaret Chan says the outbreak involv=\r\nes &quot;an animal \nstrain of the H1N1 virus, and it has pandemic potential.&quot;&lt;/P=\r\n&gt;\n&lt;P&gt;Chan says it is too early to say whether a pandemic will actually occu=\r\nr.&lt;/P&gt;\n&lt;P&gt;The global health body has advised countries around the world to =\r\nlook out for \nsimilar outbreaks following the discovery of related strains =\r\non both sides of \nthe Mexico-U.S. border.&lt;/P&gt;\n&lt;P&gt;At least 62 people in Mexi=\r\nco have died from pneumonia after contracting a \nflu-like virus. WHO says s=\r\nome tested positive for a strain that sickened at \nleast seven in the south=\r\nwestern U.S. No deaths have been reported in the \nU.S.&lt;/P&gt;\n&lt;P&gt;&lt;FONT size=3D=\r\n4 face=3Dverdana&gt;&lt;STRONG&gt;WHO Calls Emergency \nMeeting&lt;/STRONG&gt;&lt;/FONT&gt;&lt;/P&gt;\n&lt;=\r\nP&gt;&lt;FONT size=3D1&gt;Associated Press, April 24, 2009&lt;/FONT&gt;&lt;/P&gt;\n&lt;P&gt;GENEVA =97 =\r\nThe World Health Organization has called an emergency meeting of \nexperts S=\r\naturday to consider declaring an international public health emergency \nove=\r\nr the swine flu outbreak believed to have killed dozens of people in Mexico=\r\n \nand sickened at least seven in the U.S.&lt;/P&gt;\n&lt;P&gt;It is the first time the W=\r\nHO&#39;s Director-General Margaret Chan has convened \nsuch a crisis panel since=\r\n the procedure was created almost two years ago, \nspokesman Gregory Hartl s=\r\naid.&lt;/P&gt;\n&lt;P&gt;The committee may decide Saturday that the outbreak constitutes=\r\n a public \nhealth emergency, and if so, whether WHO should consider measure=\r\ns including \ntravel advisories, trade restrictions and border closures.&lt;/P&gt;=\r\n\n&lt;P&gt;The global body&#39;s flu pandemic alert level is now set to phase three =\r\n=97 \nmeaning there is no or very limited risk of a new virus spreading from=\r\n human to \nhuman.&lt;/P&gt;\n&lt;P&gt;The committee &quot;will be asked, &#39;should we raise the=\r\n alert level to phase four \nor phase five,&#39; depending on their appreciation=\r\n of how far the virus has \nspread,&quot; Hartl said.&lt;/P&gt;\n&lt;P&gt;An increased alert l=\r\nevel was considered likely, as initial evidence from the \noutbreak in Mexic=\r\no indicates the virus has spread between people. Hartl said, \nhowever, that=\r\n a decision would not be made Saturday.&lt;/P&gt;\n&lt;P&gt;At least 62 people have died=\r\n from severe pneumonia caused by a flu-like \nillness in Mexico, according t=\r\no WHO. Some of those who died are confirmed to \nhave contracted a type of s=\r\nwine flu known as A/H1N1. That particular flu variant \nhas not previously b=\r\neen seen in pigs or humans, though other types of H1N1 \nhave.&lt;/P&gt;\n&lt;P&gt;&quot;This =\r\nis a very high concern for us as the world&#39;s global health \norganization,&lt;W=\r\nBR&gt;&quot; Hartl said.&lt;/P&gt;\n&lt;P&gt;The current seasonal flu vaccine is not believed to=\r\n offer any protection \nagainst this new swine flu. But anti-viral drug Tami=\r\nflu appears to be fully \neffective against the H1N1 virus, and &quot;Mexico and =\r\nthe United States already have \nlarge stocks of Tamiflu,&quot; Hartl said.&lt;/P&gt;\n&lt;=\r\nP&gt;The virus has caused alarm in Mexico, where more than 1,000 people have b=\r\neen \nsickened. Authorities there have closed schools, museums, libraries an=\r\nd theaters \nin a bid to contain the outbreak.&lt;/P&gt;\n&lt;P&gt;WHO, which has been mo=\r\nnitoring the situation since Thursday, said 12 of the \nMexican cases have b=\r\neen confirmed as genetically identical to a swine flu virus \ndetected in Ca=\r\nlifornia.&lt;/P&gt;\n&lt;P&gt;U.S. authorities said seven people were infected with swin=\r\ne flu in California \nand Texas, and all recovered.&lt;/P&gt;\n&lt;P&gt;&quot;We do seem to ha=\r\nve found incidents of the same illness, which is swine \ninfluenza A/H1N1, o=\r\nn both sides of the border in various locations,&quot; Hartl \nsaid.&lt;/P&gt;\n&lt;P&gt;WHO h=\r\nas sent experts to Mexico to monitor the situation there, and asked \ncountr=\r\nies to report any unusual flu outbreaks.&lt;/P&gt;\n&lt;P&gt;&quot;We are at the beginning of=\r\n the outbreak here, and there are a lot of things \nthat we still don&#39;t know=\r\n,&quot; Hartl said.&lt;/P&gt;\n&lt;P&gt;&quot;We&#39;re not sure exactly of the transmission routes, w=\r\nhere the initial \ninfection came from, how efficient it is in transmitting,=\r\n&lt;WBR&gt;&quot; he said. WHO is \nalso questioning &quot;why no one has died in the United=\r\n States so far whereas there \nhave been confirmed deaths in Mexico.&quot;&lt;/P&gt;\n&lt;P=\r\n&gt;WHO chief Chan broke off a visit to Washington, where she was to meet with=\r\n \nU.S. officials, to oversee WHO&#39;s response to the crisis from its Strategi=\r\nc \nHealth Operation Center in Switzerland.&lt;/P&gt;\n&lt;P&gt;The virus appears to caus=\r\ne flu-like symptoms that can develop into severe \npneumonia, Hartl said, ur=\r\nging anyone to visit a doctor if they had been to \naffected areas and were =\r\nfeeling symptoms.&lt;/P&gt;\n&lt;P&gt;&quot;You would want to take the same kind of precautio=\r\nns that you would do with \npneumonia and an influenza-like illness,&quot; he sai=\r\nd.&lt;/P&gt;\n&lt;P align=3Dcenter&gt;&lt;IMG \nsrc=3D&quot;http://2.bp.blogspot.com/_vgqb9zN9UCs=\r\n/ScyPB0dQoEI/AAAAAAAAANY/sgeeNxclkwE/s400/1918.jpg&quot;&gt;&lt;/P&gt;\n&lt;P align=3Dcenter&gt;=\r\n&lt;FONT size=3D1 face=3Darial&gt;1918 influenza pandemic&lt;/FONT&gt;&lt;/P&gt;\n&lt;P&gt;&lt;/P&gt;&lt;/DIV=\r\n&gt;&lt;!--End group email --&gt;&lt;/BODY&gt;&lt;/HTML&gt;\n\r\n------=_NextPart_000_007F_01C9C584.017639D0--"}