{"id": "13931", "subject": "Re: [EVP-ITC] That skeptic", "author": "Frank Ratka", "timestamp": "2009-04-27T20:39:57Z", "full_text": "--0-245362486-1240864797=:63434\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nThe great thing about statistical hypothesis testing is that you can have a=\r\nn opinion or even a biased and it doesn&#39;t matter because the data will tell=\r\n the tale. If your going to do this study correctly then you need to setup =\r\nyou study correctly. What is your hypothesis? You need at least two indepen=\r\ndent variables to make the test viable. Is this going to parametric or non-=\r\nparametric (are there certain assumptions being made and adhered to)? How a=\r\nre you going to test the data (ANOVA, Z-test, t-test, etc)? What is your sa=\r\nmple size going to be like? How will you set up a control? Is the compariso=\r\nn distribution going to resemble the classic bell curve?\n=C2=A0\nMy point in=\r\n writing all this is to demonstrate that there is a lot more information an=\r\nd &quot;procedure&quot; that goes into testing samples and setting up a study to be t=\r\nruly objective. The tests are designed to be objective because people by na=\r\nture are not capable of objectivity. That is why I say you can have a biase=\r\nd and it doesn&#39;t matter, the data will tell the tale. If your going to pres=\r\nent evidence or do a half-assed survey to convince yourself or others, don&#39;=\r\nt! You are doinbg yourself and the people you are trying to convince a diss=\r\nervice and that is misleading.\n=C2=A0\nAs you said, the fact that they didn&#39;=\r\nt hear the correct words is not the big deal. It is that they heard somethi=\r\nng! That is a start! These communications are very subjective and in my opi=\r\nnion meant for the person who records them. The message heard and understoo=\r\nd is for that person.\n=C2=A0\nThanx,\n=C2=A0\nFrank R.\n\n--- On Mon, 4/27/09, F=\r\nrank Sumption &lt;purplealiengirl@...&gt; wrote:\n\n\nFrom: Frank Sumption &lt;pu=\r\nrplealiengirl@...&gt;\nSubject: [EVP-ITC] That skeptic\nTo: evp-itc@yahoog=\r\nroups.com, grassharp@yahoogroups.com\nDate: Monday, April 27, 2009, 1:22 PM\n=\r\n\n\n\n\n\n\n\n\n\n=C2=A0He claims him and his friends can&#39;t hear any meaningful ghos=\r\nt voices, so that&#39;s means there&#39;s nothing to it. Like I would take this duf=\r\nfus as anykind of authority on anything. \n=C2=A0\n=C2=A0F-S\n=C2=A0\n=C2=A0\n\n&quot;=\r\nHi Frank, I finally heard back from all the people I sent that recording to=\r\n. This was the one that we thought said &quot;ghost boxes&quot;. I thought I heard th=\r\nis very clearly myself, but after all, you had told me these words=C2=A0in=\r\n=C2=A0your email before I listened to the attached=C2=A0audio, so I knew I =\r\ncouldn&#39;t be totally objective about it. I sent the audio=C2=A0part of=C2=A0=\r\nyour video=C2=A0clip to 6 other people I know who are interested in this st=\r\nuff. I did not tell them in advance what it was supposed to say or anything=\r\n about how it was recorded. \nHere&#39;s what I heard back from them:\n=C2=A0\n\nJD=\r\n - This sounds like it&#39;s from a sweep device such as the mini box or Frank&#39;=\r\ns box. I hear something like: &quot;Mi=C2=A0 Mi -Chael Fine&quot;=C2=A0 Then somethin=\r\ng at the end.=C2=A0\n=C2=A0\nSR - The first word, &quot;up&quot;, perhaps?=C2=A0 And th=\r\ne second word either &quot;goes&quot; or &quot;comes&quot;.=C2=A0 I think the third word was &quot;m=\r\narket&quot;.=C2=A0 Someone using a spirit broker to predict the stock market?=C2=\r\n=A0\n=C2=A0\nVM - It just sounds like radio static to me... like a frequency =\r\ngoing in and out....=C2=A0\nJL & ME said basically the same thing =E2=80=93 =\r\nJust sounds like twirling the knobs on a radio.=C2=A0\n=C2=A0\nDC - I hear on=\r\ne voice saying &quot;Ghosts&quot; ... Not sure what the rest says .. sounds funky .. =\r\nnot the usual EVP rhythm ...\n=C2=A0\nSo 3 out of 6 people couldn&#39;t make out =\r\nany words at all. One heard &quot;up goes market&quot; instead of &quot;ghost boxes&quot; and o=\r\nne heard something completely different. One person did come up with the wo=\r\nrd &quot;ghost&quot;, that was Debbie Caruso and she&#39;s the one of these 6 people with=\r\n the most experience EVP experience, in fact she has a version of a radio s=\r\nweep box she calls a mini-box and has several recordings made with this dev=\r\nice posted to her website. (www.1800heaven. com)\n=C2=A0\nSo I sent debbie th=\r\nose other audio clips=C2=A0you sent more recently, the ones with=C2=A0the &quot;=\r\nNibiru&quot; stuff,=C2=A0thinking that =C2=A0maybe she had &quot;the best ear&quot; for he=\r\naring the same things you hear. I renamed the audio file so she wouldn&#39;t ha=\r\nve any advance clues as to what it was supposed to be saying. Here&#39;s her re=\r\nsponse:\n=C2=A0\nThe second recording (the shorter one) is a part of the firs=\r\nt one.=C2=A0 It&#39;s the same voice throughout that part of the recording but =\r\nI can&#39;t understand what is being said.=C2=A0 &quot;Kind of&quot; heard the word &quot;stre=\r\nssed&quot;=C2=A0 but the phrase doesn&#39;t make any sense to me....=C2=A0 \n=C2=A0\nO=\r\nf course to really be scientific about this we&#39;d need to use more samples a=\r\nnd survey a lot more people, but so far the evidence seems to confirm the p=\r\nredictable results that some people are better than others at finding patte=\r\nrns and meaning and secret messages=C2=A0within a set of random data. The s=\r\name thing is true for EVP in general as well, people seldom agree on what t=\r\nhe &quot;words&quot; they hear actually say, but to me the significance of EVP is npt=\r\n the &quot;content&quot; of the message anyway, it is the fact (alleged fact?) that s=\r\nomething showed up on the recording that can&#39;t be explained by any ordinary=\r\n methods or processes. \n=C2=A0\nWell Frank, I know you&#39;re not gonna like=C2=\r\n=A0this analysis and will probably find arguments against it, I&#39;m just tryi=\r\nng to be honest, objective, and realistic. Hope you understand.&quot;\n=C2=A0\n\n\n\n=\r\n\n\n\n\n\n\n\n\n\n\n\n\n      \r\n--0-245362486-1240864797=:63434\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;DIV&gt;The great thing about statistical hypoth=\r\nesis testing is that you can have an opinion or even a biased and it doesn&#39;=\r\nt matter because the data will tell the tale. If your going to do this stud=\r\ny correctly then you need to setup you study correctly. What is your hypoth=\r\nesis? You need at least two independent variables to make the test viable. =\r\nIs this going to parametric or non-parametric (are there certain assumption=\r\ns being made and adhered to)? How are you going to test the data (ANOVA, Z-=\r\ntest, t-test, etc)? What is your sample size going to be like? How will you=\r\n set up a control? Is the comparison distribution going to resemble the cla=\r\nssic bell curve?&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;My point in writing all this =\r\nis to demonstrate that there is a lot more information and &quot;procedure&quot; that=\r\n goes into testing samples and setting up a study to be truly objective. Th=\r\ne tests are designed to be objective because people by nature are not capab=\r\nle of objectivity. That is why I say you can have a biased and it doesn&#39;t m=\r\natter, the data will tell the tale. If your going to present evidence or do=\r\n a half-assed survey to convince yourself or others, don&#39;t! You are doinbg =\r\nyourself and the people you are trying to convince a disservice and that is=\r\n misleading.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;As you said, the fact that they d=\r\nidn&#39;t hear the correct words is not the big deal. It is that they heard som=\r\nething! That is a start! These communications are very subjective and in my=\r\n opinion meant for the person who records them. The message heard and under=\r\nstood is for that person.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Thanx,&lt;/DIV&gt;\n&lt;DIV&gt;&n=\r\nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Frank R.&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Mon, 4/27/09, Frank Sumption &lt;I&gt;&=\r\nlt;purplealiengirl@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;&lt;/DIV&gt;\n&lt;BLOCKQUOTE style=\r\n=3D&quot;BORDER-LEFT: rgb(16,16,255) 2px solid; PADDING-LEFT: 5px; MARGIN-LEFT: =\r\n5px&quot;&gt;&lt;BR&gt;From: Frank Sumption &lt;purplealiengirl@...&gt;&lt;BR&gt;Subject:=\r\n [EVP-ITC] That skeptic&lt;BR&gt;To: evp-itc@yahoogroups.com, grassharp@yahoogrou=\r\nps.com&lt;BR&gt;Date: Monday, April 27, 2009, 1:22 PM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3Dyiv188052=\r\n3113&gt;\n&lt;DIV id=3Dygrp-text&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&nbsp;He claims him and his friends c=\r\nan&#39;t hear any meaningful ghost voices, so that&#39;s means there&#39;s nothing to i=\r\nt. Like I would take this duffus as anykind of authority on anything. &lt;/DIV=\r\n&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;F-S&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV=\r\n&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&quot;Hi Frank, I finally heard back from all the people I sent tha=\r\nt recording to. This was the one that we thought said &quot;ghost boxes&quot;. I thou=\r\nght I heard this very clearly myself, but after all, you had told me these =\r\nwords&nbsp;in&nbsp;your email before I listened to the attached&nbsp;audio,=\r\n so I knew I couldn&#39;t be totally objective about it. I sent the audio&nbsp;=\r\npart of&nbsp;your video&nbsp;clip to 6 other people I know who are interest=\r\ned in this stuff. I did not tell them in advance what it was supposed to sa=\r\ny or anything about how it was recorded. &lt;/DIV&gt;\n&lt;DIV&gt;Here&#39;s what I heard ba=\r\nck from them:&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D3 face=3D&quot;Tim=\r\nes New Roman&quot;&gt;JD - This sounds like it&#39;s from a sweep device such as the mi=\r\nni box or Frank&#39;s box. I hear something like: &quot;Mi&lt;SPAN&gt;&nbsp; &lt;/SPAN&gt;Mi -Ch=\r\nael Fine&quot;&lt;SPAN&gt;&nbsp; &lt;/SPAN&gt;Then something at the end.&lt;/FONT&gt;&lt;FONT size=3D=\r\n3 face=3D&quot;Times New Roman&quot;&gt;&nbsp;&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D3 face=3D&quot;=\r\nTimes New Roman&quot;&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D3 face=3D&quot;Times New =\r\nRoman&quot;&gt;SR - The first word, &quot;up&quot;, perhaps?&lt;SPAN&gt;&nbsp; &lt;/SPAN&gt;And the secon=\r\nd word either &quot;goes&quot; or &quot;comes&quot;.&lt;SPAN&gt;&nbsp; &lt;/SPAN&gt;I think the third word =\r\nwas &quot;market&quot;.&lt;SPAN&gt;&nbsp; &lt;/SPAN&gt;Someone using a spirit broker to predict t=\r\nhe stock market?&lt;/FONT&gt;&lt;FONT size=3D3 face=3D&quot;Times New Roman&quot;&gt;&nbsp;&lt;/FONT=\r\n&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D3 face=3D&quot;Times New Roman&quot;&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;D=\r\nIV&gt;&lt;FONT size=3D3 face=3D&quot;Times New Roman&quot;&gt;VM - It just sounds like radio s=\r\ntatic to me... like a frequency going in and out....&lt;/FONT&gt;&lt;FONT size=3D3 f=\r\nace=3D&quot;Times New Roman&quot;&gt;&nbsp;&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D3 face=3D&quot;Tim=\r\nes New Roman&quot;&gt;JL &amp; ME said basically the same thing =E2=80=93 Just soun=\r\nds like twirling the knobs on a radio.&lt;/FONT&gt;&lt;FONT size=3D3 face=3D&quot;Times N=\r\new Roman&quot;&gt;&nbsp;&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D3 face=3D&quot;Times New Roman&quot;&gt;=\r\n&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D3 face=3D&quot;Times New Roman&quot;&gt;DC - I hea=\r\nr one voice saying &quot;Ghosts&quot; ... Not sure what the rest says .. sounds funky=\r\n .. not the usual EVP rhythm ...&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D3 face=3D&quot;T=\r\nimes New Roman&quot;&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D3 face=3D&quot;Times New R=\r\noman&quot;&gt;So 3 out of 6 people couldn&#39;t make out any words at all. One heard &quot;u=\r\np goes market&quot; instead of &quot;ghost boxes&quot; and one heard something completely =\r\ndifferent. One person did come up with the word &quot;ghost&quot;, that was Debbie Ca=\r\nruso and she&#39;s the one of these 6 people with the most experience EVP exper=\r\nience, in fact she has a version of a radio sweep box she calls a mini-box =\r\nand has several recordings made with this device posted to her website. (&lt;A=\r\n href=3D&quot;http://www.1800heaven.com/&quot; rel=3Dnofollow target=3D_blank&gt;www.180=\r\n0heaven. com&lt;/A&gt;)&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D3 face=3D&quot;Times New Roman&quot;=\r\n&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D3 face=3D&quot;Times New Roman&quot;&gt;So I sent=\r\n debbie those other audio clips&nbsp;you sent more recently, the ones with&=\r\nnbsp;the &quot;Nibiru&quot; stuff,&nbsp;thinking that &nbsp;maybe she had &quot;the best e=\r\nar&quot; for hearing the same things you hear. I renamed the audio file so she w=\r\nouldn&#39;t have any advance clues as to what it was supposed to be saying. Her=\r\ne&#39;s her response:&lt;/FONT&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;The second reco=\r\nrding (the shorter one) is a part of the first one.&nbsp; It&#39;s the same voi=\r\nce throughout that part of the recording but I can&#39;t understand what is bei=\r\nng said.&nbsp; &quot;Kind of&quot; heard the word &lt;EM&gt;&quot;stressed&quot;&nbsp; &lt;/EM&gt;but the p=\r\nhrase doesn&#39;t make any sense to me....&nbsp; &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;=\r\n&lt;FONT face=3D&quot;courier new,monospace&quot;&gt;Of course to really be scientific abou=\r\nt this we&#39;d need to use more samples and survey a lot more people, but so f=\r\nar the evidence seems to confirm the predictable results that some people a=\r\nre better than others at finding patterns and meaning and secret messages&n=\r\nbsp;within a set of random data. The same thing is true for EVP in general =\r\nas well, people seldom agree on what the &quot;words&quot; they hear actually say, bu=\r\nt to me the significance of EVP is npt the &quot;content&quot; of the message anyway,=\r\n it is the fact (alleged fact?) that something showed up on the recording t=\r\nhat can&#39;t be explained by any ordinary methods or processes. &lt;/FONT&gt;&lt;/DIV&gt;\n=\r\n&lt;DIV&gt;&lt;FONT face=3D&quot;Courier New&quot;&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3D&quot;Cour=\r\nier New&quot;&gt;Well Frank, I know you&#39;re not gonna like&nbsp;this analysis and wi=\r\nll probably find arguments against it, I&#39;m just trying to be honest, object=\r\nive, and realistic. Hope you understand.&quot;&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3D&quot;C=\r\nourier New&quot;&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/t=\r\nable&gt;&lt;br&gt;\n\n\n\n      \r\n--0-245362486-1240864797=:63434--"}