{"id": "13976", "subject": "Re: From April 23rd.", "author": "itcdeadpeople", "timestamp": "2009-04-28T22:28:09Z", "full_text": "Hi Susan.  I don&#39;t know what kind of box you&#39;ll end up with, but in the meantime, you can always do &quot;manual radio sweep.&quot;  I get some of my best results that way.  When I started doing sweep for EVP, commercially available boxes were not available.  My favorite unit so far is the Duracell KP028 crank flashlight/radio.  It might be listed as the &quot;3 in 1&quot; or something like that.  The knob is just the right size and tightness to make it easy to sweep from one end to the other.  Of course, it&#39;s a little obnoxious to have to stop and crank it up every few minutes, but I think the results make it well worth the effort.  I&#39;ve seen others have good success with all kinds of different radios though.  So many makes/models can work well.\n\nI own the Paranormal Systems units and many of the Radio Shack hacks, and by comparison, this little $20 model really holds it&#39;s own.  PLUS it would be handy in case of power outage.  I think it&#39;s always great to have items around the house that can fulfill more than one purpose.  And so budget friendly too.  ;-)\n\nJust a thought.....\n\nMargaret\n\n--- In EVP-ITC@yahoogroups.com, &quot;kytten&quot; &lt;kytten_karmicheal@...&gt; wrote:\n&gt;\n&gt; Hi frank, I am new to your ground and I was curious where if you have a site where you sell the boxes that you make personally.. I know that I can I buy one of the standard boxes in various places or I could make one my self... if only I was suave enough to be able to fallow the directions.. unfortunately I have never really been a direction type of person.\n&gt; I have always been extra sensitive and very interested in EVP and the paranormal every since I was very little and when I heard of your boxes recently I became very excited and would love to buy one, can you point me in the right direction..\n&gt; Thank you, Susan\n&gt;"}