{"id": "13983", "subject": "Re: [EVP-ITC] A skeptic blog/article.", "author": "Eric VanDuzer", "timestamp": "2009-04-29T13:28:08Z", "full_text": "There we go I think that is a word we all were searching for.\n\nOn Wed, Apr 29, 2009 at 9:25 AM, April Abercrombie &lt;\napril@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;  That&#39;s a much better term - Cynic.\n&gt;\n&gt; Thanks!\n&gt;\n&gt;\n&gt; ----- Original Message -----\n&gt; *From:* L echevarria &lt;lechevar@...&gt;\n&gt; *To:* EVP-ITC@yahoogroups.com\n&gt; *Sent:* Tuesday, April 28, 2009 5:13 PM\n&gt; *Subject:* RE: [EVP-ITC] A skeptic blog/article.\n&gt;\n&gt;  Well said April! There is a huge difference between a cynic and a\n&gt; skeptic.\n&gt;\n&gt; -----Original Message-----\n&gt; From: April Abercrombie &lt;april@...&gt;\n&gt; Sent: Tuesday, April 28, 2009 5:25 PM\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Subject: Re: [EVP-ITC] A skeptic blog/article.\n&gt;\n&gt; Healthy debate is one thing. Yes, it can be a good thing. I am not saying\n&gt; don&#39;t exchange viewpoints with people. But it is only healthy debate if both\n&gt; parties are willing to consider the other&#39;s opinion. I bet you no matter\n&gt; what Frank were to say, these people would never consider a word he says.\n&gt;\n&gt; Just as you say, there has to be a mutual respect between parties in order\n&gt; to carry on and intelligent debate, like we are doing with this discussion.\n&gt;\n&gt; Frank can stand up all he wants if that is want he wants to do, but for all\n&gt; that, he won&#39;t change these people&#39;s opinions, and in the end he will only\n&gt; invite more hassle from them.\n&gt;\n&gt; He should see that these people and their opinions don&#39;t mean anything to\n&gt; his own personal growth, research and knowledge.\n&gt;\n&gt; Engaging these types in petty argument just drains you of your energy.\n&gt; There is no winner. It is a waste of time and energy. Energy that could have\n&gt; been put to a much worthier task. It is much better to take the high road\n&gt; and leave the haters to themselves.\n&gt;\n&gt; April\n&gt;\n&gt; [The entire original message is not included]\n&gt;\n&gt;  \n&gt;\n\nThe e we go I hink ha is a wo d we all we e sea ching o .  On Wed, Ap 29, 2009 a 9:25 AM, Ap il Abe c ombie ap il@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n \n \n \n \n\n\nTha 's a much be e e m - \nCynic.\n \nThanks!\n \n\n ----- O iginal Message ----- \n \nF om: \n L \n eche a ia \n To: EVP-ITC@yahoog oups.com \n\n Sen : Tuesday, Ap il 28, 2009 5:13 \n PM\n Subjec : RE: [EVP-ITC] A skep ic \n blog/a icle.\n \n \n Well said Ap il! The e is a huge di e ence be ween a cynic and a skep ic. \n -----O iginal Message-----F om: Ap il Abe c ombie ap il@abe c ombieghos esea ch.com>Sen : \n Tuesday, Ap il 28, 2009 5:25 PMTo: EVP-ITC@yahoog oups.comSubjec : \n Re: [EVP-ITC] A skep ic blog/a icle.Heal hy deba e is one hing. Yes, \n i can be a good hing. I am no saying don' exchange iewpoin s wi h people. \n Bu i is only heal hy deba e i bo h pa ies a e willing o conside he \n o he 's opinion. I be you no ma e wha F ank we e o say, hese people \n would ne e conside a wo d he says.Jus as you say, he e has o be a \n mu ual espec be ween pa ies in o de o ca y on and in elligen deba e, \n like we a e doing wi h his discussion.F ank can s and up all he wan s \n i ha is wan he wan s o do, bu o all ha , he won' change hese \n people's opinions, and in he end he will only in i e mo e hassle om \n hem.He should see ha hese people and hei opinions don' mean \n any hing o his own pe sonal g ow h, esea ch and knowledge.Engaging \n hese ypes in pe y a gumen jus d ains you o you ene gy. The e is no \n winne . I is a was e o ime and ene gy. Ene gy ha could ha e been pu o a \n much wo hie ask. I is much be e o ake he high oad and lea e he \n ha e s o hemsel es.Ap il[The en i e o iginal message is no \n included]"}