{"id": "13980", "subject": "Re: From April 23rd.", "author": "itcdeadpeople", "timestamp": "2009-04-29T06:56:45Z", "full_text": "I have to second what Frank mentioned.  The EVP Maker/allophones combo is excellent, in my opinion.  I know a lot of folks do not like it, but I find it utterly fascinating.  It is an animal all it&#39;s own so I can&#39;t really compare it to radio sweep, however, I do recommend people trying it to see if it might be a good match for them.  I&#39;ve been working with it since Stefan created the allophones file and have been consistently amazed at the results.  \n\nOf all methods I&#39;ve tried, I have the most success with &quot;real-time, two-way&quot; communication via this combination.  It took some getting used to, hearing the relevant parts while ignoring the rest, but once I got the hang of that it become more and more easy as I worked with it.\n\nFrank, it&#39;s great to read there&#39;s a possibility of some inexpensive FB&#39;s coming along.  Very cool.\n\nMargaret  \n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  There should be cheap FBs available soon, if the rumors I hear are\n&gt; correct.  I have printed circuit boards made, but the troubel is---no tuner!\n&gt; I don&#39;t want to have to rely on the Radio Shack models--that they\n&gt; discontinued, and so far home made tuners are just too noisy(staticy).\n&gt; \n&gt;  In the mean time, like Margaret said, many of the oterh method work as\n&gt; well, and sometimes better. There&#39;s also EVPmaker.\n&gt; \n&gt;  Frank-S\n&gt; \n&gt; On Tue, Apr 28, 2009 at 4:28 PM, itcdeadpeople &lt;ITCdeadpeople@...&gt;wrote:\n&gt; \n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Hi Susan. I don&#39;t know what kind of box you&#39;ll end up with, but in the\n&gt; &gt; meantime, you can always do &quot;manual radio sweep.&quot; I get some of my best\n&gt; &gt; results that way. When I started doing sweep for EVP, commercially available\n&gt; &gt; boxes were not available. My favorite unit so far is the Duracell KP028\n&gt; &gt; crank flashlight/radio. It might be listed as the &quot;3 in 1&quot; or something like\n&gt; &gt; that. The knob is just the right size and tightness to make it easy to sweep\n&gt; &gt; from one end to the other. Of course, it&#39;s a little obnoxious to have to\n&gt; &gt; stop and crank it up every few minutes, but I think the results make it well\n&gt; &gt; worth the effort. I&#39;ve seen others have good success with all kinds of\n&gt; &gt; different radios though. So many makes/models can work well.\n&gt; &gt;\n&gt; &gt; I own the Paranormal Systems units and many of the Radio Shack hacks, and\n&gt; &gt; by comparison, this little $20 model really holds it&#39;s own. PLUS it would be\n&gt; &gt; handy in case of power outage. I think it&#39;s always great to have items\n&gt; &gt; around the house that can fulfill more than one purpose. And so budget\n&gt; &gt; friendly too. ;-)\n&gt; &gt;\n&gt; &gt; Just a thought.....\n&gt; &gt;\n&gt; &gt; Margaret\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, &quot;kytten&quot;\n&gt; &gt; &lt;kytten_karmicheal@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; Hi frank, I am new to your ground and I was curious where if you have a\n&gt; &gt; site where you sell the boxes that you make personally.. I know that I can I\n&gt; &gt; buy one of the standard boxes in various places or I could make one my\n&gt; &gt; self... if only I was suave enough to be able to fallow the directions..\n&gt; &gt; unfortunately I have never really been a direction type of person.\n&gt; &gt; &gt; I have always been extra sensitive and very interested in EVP and the\n&gt; &gt; paranormal every since I was very little and when I heard of your boxes\n&gt; &gt; recently I became very excited and would love to buy one, can you point me\n&gt; &gt; in the right direction..\n&gt; &gt; &gt; Thank you, Susan\n&gt; &gt; &gt;\n&gt; &gt;\n&gt; &gt;  \n&gt; &gt;\n&gt;"}