{"id": "14047", "subject": "Re: People given a grant to do what you all are doing,", "author": "itcdeadpeople", "timestamp": "2009-05-04T01:56:32Z", "full_text": "Frank, I think you misunderstood or misread something somewhere.  The AAEVP/Sarah Estep Research Fund is not for AAEVP to do the research, it&#39;s for them to fund OUTSIDE organizations for THEIR scientific research on the study of EVP.  The Windbridge Institute received some of this sponsor money for what they called &quot;Real-time EVP Conversations: A Pilot Study.&quot;  The method for this communication was *not* based on radio sweep, nor traditional methods, so it&#39;s not based on what I assume many people here are doing.  And in fact, it *was* based on the creations of someone outside of the USA, so I&#39;m a little confused as to why all the hostility toward AAEVP for putting up the money.\n\nSadly, radio sweep methods don&#39;t, and may not for a long time, get the respect of the scientific community that it deserves (then again, seems no form of EVP does), but at least this current research is a step in the right direction.  I hope, when Windbridge concludes their study, that it will support the notion that there is apparent communication formed in ways that cannot be explained by currently known and understood laws of nature.  THAT alone, in my opinion, would be a big plus for all ITC communities, regardless of the method from which that communication was received.  What&#39;s the old saying?  &quot;It takes but one white crow to prove all crows are not black.&quot;  Any proof, derived from any EVP method, would be greatly welcomed as far as I&#39;m concerned.\n\nMargaret\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  It&#39;s the same old stuff, everyone wants to completely ignore absolutely all\n&gt; work that has been in this field since the caveman and act like they just\n&gt; discovered spirit and EVP.  Completely ignore all the work in this country\n&gt; and in Europe, and if anyone says anything, oh well, you&#39;re just being\n&gt; negative! Why everyone knows there no EVP/ITC research outside AAEVP!\n&gt; \n&gt; Frank-S\n&gt; \n&gt; On Sun, May 3, 2009 at 4:41 PM, Frank Sumption &lt;purplealiengirl@...&gt;wrote:\n&gt; \n&gt; &gt; Yeah, it&#39;s not what you know....\n&gt; &gt;\n&gt; &gt; F-S\n&gt; &gt;\n&gt; &gt;   On Sun, May 3, 2009 at 8:35 AM, &lt;SnowfireL@...&gt; wrote:\n&gt; &gt;\n&gt; &gt;&gt;\n&gt; &gt;&gt;\n&gt; &gt;&gt;  They were given a grant to do what you all are doing,\n&gt; &gt;&gt;\n&gt; &gt;&gt;\n&gt; &gt;&gt; http://www.aaevp.com/research.htm\n&gt; &gt;&gt;\n&gt; &gt;&gt; ------------------------------\n&gt; &gt;&gt; *The Average US Credit Score is 692. See Yours in Just 2 Easy Steps!&lt;http://pr.atwola.com/promoclk/100126575x1222376998x1201454298/aol?redir=http://www.freecreditreport.com/pm/default.aspx?sc=668072&hmpgID=62&bcd=May5309AvgfooterNO62&gt;\n&gt; &gt;&gt; *\n&gt; &gt;&gt;\n&gt; &gt;&gt;  \n&gt; &gt;&gt;\n&gt; &gt;\n&gt; &gt;\n&gt;"}