{"id": "14053", "subject": "Re: [EVP-ITC] Re: People given a grant to do what you all are doing,", "author": "Frank Sumption", "timestamp": "2009-05-04T15:07:59Z", "full_text": "I was just sayin&#39;!  So why would anyone in this field completely ignore\nmethods that work, irregardless of whether science accpts it? That&#39;s the\nthing, say anything and I&#39;m the one being negative. Question these other\nexperts and I&#39;m being negative--on and on.\n\n Same old story--don&#39;t accept the evidence, don&#39;t accept that that\nsomeone-like me-does in fact at least understand what conditions to create\nto make these communications possible. Yet y&#39;all wonder why I have a case of\nthe ass all the time. All the pompus self proclaimed egotisical little\ndweebs out there chasing the damn fame and fortune--not facts.\n\n I have gotten so much friggn&#39; voices that can&#39;t be explained as anything\nbut spirits/entity communication--not good enough!\n\n You hear that crap(any proof...) from every scientist/debunker--well if the\nevidence was there we&#39;d be the first to celibrate it-yeah right, rihgt after\nthey burned, burried, and debunked it. There is more than enough\nevidence--all of it is ignored.\n\n The stuff is simple-provide something for the enitities to make their\nvoices out of and they will speak, no friggin&#39; mystery, no magic, no secret\ntecnology, no high priest(ess) needed.\n\n Frank-S\n\n\nOn Sun, May 3, 2009 at 7:56 PM, itcdeadpeople &lt;ITCdeadpeople@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Frank, I think you misunderstood or misread something somewhere. The\n&gt; AAEVP/Sarah Estep Research Fund is not for AAEVP to do the research, it&#39;s\n&gt; for them to fund OUTSIDE organizations for THEIR scientific research on the\n&gt; study of EVP. The Windbridge Institute received some of this sponsor money\n&gt; for what they called &quot;Real-time EVP Conversations: A Pilot Study.&quot; The\n&gt; method for this communication was *not* based on radio sweep, nor\n&gt; traditional methods, so it&#39;s not based on what I assume many people here are\n&gt; doing. And in fact, it *was* based on the creations of someone outside of\n&gt; the USA, so I&#39;m a little confused as to why all the hostility toward AAEVP\n&gt; for putting up the money.\n&gt;\n&gt; Sadly, radio sweep methods don&#39;t, and may not for a long time, get the\n&gt; respect of the scientific community that it deserves (then again, seems no\n&gt; form of EVP does), but at least this current research is a step in the right\n&gt; direction. I hope, when Windbridge concludes their study, that it will\n&gt; support the notion that there is apparent communication formed in ways that\n&gt; cannot be explained by currently known and understood laws of nature. THAT\n&gt; alone, in my opinion, would be a big plus for all ITC communities,\n&gt; regardless of the method from which that communication was received. What&#39;s\n&gt; the old saying? &quot;It takes but one white crow to prove all crows are not\n&gt; black.&quot; Any proof, derived from any EVP method, would be greatly welcomed as\n&gt; far as I&#39;m concerned.\n&gt;\n&gt; Margaret\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Frank Sumption\n&gt; &lt;purplealiengirl@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; It&#39;s the same old stuff, everyone wants to completely ignore absolutely\n&gt; all\n&gt; &gt; work that has been in this field since the caveman and act like they just\n&gt; &gt; discovered spirit and EVP. Completely ignore all the work in this country\n&gt; &gt; and in Europe, and if anyone says anything, oh well, you&#39;re just being\n&gt; &gt; negative! Why everyone knows there no EVP/ITC research outside AAEVP!\n&gt; &gt;\n&gt; &gt; Frank-S\n&gt; &gt;\n&gt; &gt; On Sun, May 3, 2009 at 4:41 PM, Frank Sumption &lt;purplealiengirl@...&gt;wrote:\n&gt;\n&gt; &gt;\n&gt; &gt; &gt; Yeah, it&#39;s not what you know....\n&gt; &gt; &gt;\n&gt; &gt; &gt; F-S\n&gt; &gt; &gt;\n&gt; &gt; &gt; On Sun, May 3, 2009 at 8:35 AM, &lt;SnowfireL@...&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt; They were given a grant to do what you all are doing,\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt; http://www.aaevp.com/research.htm\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt; ------------------------------\n&gt; &gt; &gt;&gt; *The Average US Credit Score is 692. See Yours in Just 2 Easy Steps!&lt;\n&gt; http://pr.atwola.com/promoclk/100126575x1222376998x1201454298/aol?redir=http://www.freecreditreport.com/pm/default.aspx?sc=668072&hmpgID=62&bcd=May5309AvgfooterNO62\n&gt; &gt;\n&gt; &gt; &gt;&gt; *\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nI was jus sayin'!  So why would anyone in his ield comple ely igno e me hods ha wo k, i ega dless o whe he science accp s i ? Tha 's he hing, say any hing and I'm he one being nega i e. Ques ion hese o he expe s and I'm being nega i e--on and on. \n\n \n Same old s o y--don' accep he e idence, don' accep ha ha someone-like me-does in ac a leas unde s and wha condi ions o c ea e o make hese communica ions possible. Ye y'all wonde why I ha e a case o he ass all he ime. All he pompus sel p oclaimed ego isical li le dweebs ou he e chasing he damn ame and o une--no ac s.\n\n \n I ha e go en so much iggn'  oices ha can' be explained as any hing bu spi i s/en i y communica ion--no good enough! \n \n You hea ha c ap(any p oo ...)  om e e y scien is /debunke --well i he e idence was he e we'd be he i s o celib a e i -yeah igh , ihg a e hey bu ned, bu ied, and debunked i . The e is mo e han enough e idence--all o i is igno ed.  \n\n \n The s u is simple-p o ide some hing o he eni i ies o make hei oices ou o and hey will speak, no iggin' mys e y, no magic, no sec e ecnology, no high p ies (ess) needed. \n \n F ank-S\n \nOn Sun, May 3, 2009 a 7:56 PM, i cdeadpeople ITCdeadpeople@...> w o e:\n\n\n\n\n\nF ank, I hink you misunde s ood o mis ead some hing somewhe e. The AAEVP/Sa ah Es ep Resea ch Fund is no o AAEVP o do he esea ch, i 's o hem o und OUTSIDE o ganiza ions o THEIR scien i ic esea ch on he s udy o EVP. The Windb idge Ins i u e ecei ed some o his sponso money o wha hey called \"Real- ime EVP Con e sa ions: A Pilo S udy.\" The me hod o his communica ion was *no * based on adio sweep, no adi ional me hods, so i 's no based on wha I assume many people he e a e doing. And in ac , i *was* based on he c ea ions o someone ou side o he USA, so I'm a li le con used as o why all he hos ili y owa d AAEVP o pu ing up he money.\nSadly, adio sweep me hods don' , and may no o a long ime, ge he espec o he scien i ic communi y ha i dese es ( hen again, seems no o m o EVP does), bu a leas his cu en esea ch is a s ep in he igh di ec ion. I hope, when Windb idge concludes hei s udy, ha i will suppo he no ion ha he e is appa en communica ion o med in ways ha canno be explained by cu en ly known and unde s ood laws o na u e. THAT alone, in my opinion, would be a big plus o all ITC communi ies, ega dless o he me hod om which ha communica ion was ecei ed. Wha 's he old saying? \"I akes bu one whi e c ow o p o e all c ows a e no black.\" Any p oo , de i ed om any EVP me hod, would be g ea ly welcomed as a as I'm conce ned.\nMa ga e \n--- In EVP-ITC@yahoog oups.com, F ank Sump ion w o e:>> I 's he same old s u , e e yone wan s o comple ely igno e absolu ely all\n> wo k ha has been in his ield since he ca eman and ac like hey jus > disco e ed spi i and EVP. Comple ely igno e all he wo k in his coun y> and in Eu ope, and i anyone says any hing, oh well, you' e jus being\n> nega i e! Why e e yone knows he e no EVP/ITC esea ch ou side AAEVP!> > F ank-S> > On Sun, May 3, 2009 a 4:41 PM, F ank Sump ion w o e: \n> > > Yeah, i 's no wha you know....> >> > F-S> >\n> > On Sun, May 3, 2009 a 8:35 AM, w o e:> >> >>> >>> >> They we e gi en a g an o do wha you all a e doing,> >>> >>\n> >> h p://www.aae p.com/ esea ch.h m> >>> >> ------------------------------> >> *The A e age US C edi Sco e is 692. See You s in Jus 2 Easy S eps!h p://p .a wola.com/p omoclk/100126575x1222376998x1201454298/aol? edi =h p://www. eec edi epo .com/pm/de aul .aspx?sc=668072&hmpgID=62&bcd=May5309A g oo e NO62>\n> >> *> >>> >> > >>> >> >>"}