{"id": "14057", "subject": "Re: [EVP-ITC] Re: People given a grant to do what you all are doing,", "author": "Rj", "timestamp": "2009-05-04T17:13:46Z", "full_text": "--0-123234573-1241457226=:12302\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nFrank =E2=80=93 I think I disagree with you here.=C2=A0 Science is not just=\r\n about the evidence, it=E2=80=99s about the entire process, including how t=\r\nhe evidence is collected and how (and by whom) it is interpreted.=C2=A0 Thi=\r\ns is why a valuable tool in the scientific arsenal is the double (and tripl=\r\ne) blind study.=C2=A0 It attempts to remove the often uncontrollable subjec=\r\ntivity inherent in all people, even scientists!=C2=A0 Science uses this tec=\r\nhnique to help keep even itself as honest as possible.=C2=A0 So if you are =\r\nfinding that the evidence is being ignored, the reason may not be the evide=\r\nnce itself (no matter how compelling). It may very well be the manner in wh=\r\nich it is collected, and interpreted: all at least as important as the audi=\r\no itself.\n\nEVP=E2=80=99s are perfectly allowed to throw monkey wrenches, an=\r\nd even kitchen sinks into scientific theories and accepted dogmas: but only=\r\n if they follow science=E2=80=99s rules.=C2=A0 It=E2=80=99s like trying to =\r\nput a new medicine on the market with claims that it destroys accepted dogm=\r\nas: but, if the testing has not been rigorous and up to accepted medical st=\r\nandards, its hard to blame consumers for being doubtful of its claims.\n\nSci=\r\nence is not magic: it is a simple process really, but it forces a claim to =\r\nreally be solidly confirmed. It seems to me that, while EVP research has it=\r\ns toe in the water of scientific methodology (it is making observations, co=\r\nllecting evidence, and making theories), it seems to be obsessed on that ph=\r\nase of science, and not on the hard part: designing and conducting objectiv=\r\ne tests to conform or dismiss the theories.=C2=A0 It seems that so many peo=\r\nple are having so much fun with their audio devices and results, that they =\r\nare maybe afraid of taking it to the next step of serious testing, maybe be=\r\ncause of the risk this testing could destroy their fun.\n\nBut they should ma=\r\nybe consider it might NOT destroy their fun, but instead that next phase of=\r\n testing may be just what the doctors ordered to bring EVP into mainline sc=\r\nience: real, science-based testing.=C2=A0 I fear the people accepted as the=\r\n real experts and pioneers in this field (like you Frank) will never get an=\r\ny acknowledgement of their achievements unless they have are able to move i=\r\nnto this next phase.\n\nScience wants you to piss on its fire, Frank.=C2=A0 B=\r\nut you have to go where the fire is.=C2=A0=C2=A0 And the way there is throu=\r\ngh the entire scientific method, not just the early fun parts, but the hard=\r\n testing parts.=C2=A0 But I understand how difficult that prospect can be, =\r\nand that it would take your focus off the part you seem to like best (exper=\r\nimenting with the equipment).=C2=A0 If you are unable to bring yourself to =\r\nthe testing phase, it might be worth looking at partnering up with others w=\r\nho would focus on that part for you?=C2=A0 I think a very dynamic team of p=\r\neople could be formed with you focused on the technology creation, and they=\r\n focused on the more mundane aspects of rigorous blind study testing.=C2=A0=\r\n Do you think that would be valuable to you, and to the field of EVP studie=\r\ns?\n=C2=A0\n\n\n--- On Mon, 5/4/09, Frank Sumption &lt;purplealiengirl@...&gt; =\r\nwrote:\n\nFrom: Frank Sumption &lt;purplealiengirl@...&gt;\nSubject: Re: [EVP-=\r\nITC] Re: People given a grant to do what you all are doing,\nTo: EVP-ITC@yah=\r\noogroups.com\nDate: Monday, May 4, 2009, 9:28 AM\n\n\n\n\n\n\n\n\n\n\n\n    \n           =\r\n \n            \n\n\n      \n      =C2=A0It&#39;s not that it can&#39;t be proven, it&#39;s =\r\nthat all evidence is deemed unacceptable- -a convinient way to make uncompf=\r\nortable facts go away.=C2=A0 The fact is=C2=A0 most of the EVP evidence pre=\r\ntty much contradicts, or at least throws a monkey wrench in many so called =\r\nscientific theories, and accepted dogma. Even spiritualists don&#39;t accept th=\r\nat there&#39;s a technology=C2=A0for spirit communication, who needs a medium w=\r\nhen you&#39;ve got box?\n\n=C2=A0\n=C2=A0To me, it seems science has done little o=\r\nver the last 500 years except proclaim themsles the worlds only experts and=\r\n source of all knowledge. All technological advancement is made by people t=\r\nrying an idea to see what works, and running with it, not waiting for peer =\r\nreview BS to tell her it doesn&#39;t work. Science is a bunch of fat old men si=\r\ntting around a fire place in over stuffed chairs telling each other how sma=\r\nrt they are! They don&#39;t want anyone pissing on the fire!\n\n=C2=A0\n=C2=A0Fran=\r\nk-S\n\n\nOn Mon, May 4, 2009 at 9:20 AM, April Abercrombie &lt;april@abercrombieg=\r\nh ostresearch. com&gt; wrote:\n\n\n\n\n\n\n\n\n\nYou will never be able to prove your me=\r\nthods scientifically, so why even try to argue with them? Even if you were =\r\nable to, they probably still wouldn&#39;t believe it.\n=C2=A0\nIMO, who cares? Al=\r\nl that matters is that you are getting something out of it. Besides, maybe =\r\nit isn&#39;t meant to be understood by certain people. I have always held the o=\r\npinion that we will never scientifically prove anything we do in the parano=\r\nrmal field, and I think that is no accident. I think some people will never=\r\n get anything out of it, while others will excel in their knowledge, but it=\r\n will be all very personal.\n\n=C2=A0\nIt&#39;s all about what constitutes enough=\r\n=C2=A0proof for you personally. You have to go with your gut on what is tru=\r\ne spirit communication, and what isn&#39;t. If no one ever agrees with you, so =\r\nwhat?\n\n=C2=A0\nApril\n\n\n\n=C2=A0\n----- Original Message ----- \n\nFrom: Frank Su=\r\nmption \nTo: EVP-ITC@yahoogroups .com \nSent: Monday, May 04, 2009 9:07 AM\nSu=\r\nbject: Re: [EVP-ITC] Re: People given a grant to do what you all are doing,=\r\n\n\n\n\n\n=C2=A0I was just sayin&#39;!=C2=A0 So why would anyone in this field compl=\r\netely ignore methods that work, irregardless of whether science accpts it? =\r\nThat&#39;s the thing, say anything and I&#39;m the one being negative. Question the=\r\nse other experts and I&#39;m being negative--on and on. \n\n=C2=A0\n=C2=A0Same old=\r\n story--don&#39;t accept the evidence, don&#39;t accept that that someone-like me-d=\r\noes in fact at least understand what conditions to create to make these com=\r\nmunications possible. Yet y&#39;all wonder why I have a case of the ass all the=\r\n time. All the pompus self proclaimed egotisical little dweebs out there ch=\r\nasing the damn fame and fortune--not facts.\n\n=C2=A0\n=C2=A0I have gotten so =\r\nmuch friggn&#39;=C2=A0voices that can&#39;t be explained as anything but spirits/en=\r\ntity communication- -not good enough! \n=C2=A0\n=C2=A0You hear that crap(any =\r\nproof...)=C2=A0from every scientist/debunker- -well if the evidence was the=\r\nre we&#39;d be the first to celibrate it-yeah right, rihgt after they burned, b=\r\nurried, and debunked it. There is more than enough evidence--all of it is i=\r\ngnored.=C2=A0=C2=A0\n\n=C2=A0\n=C2=A0The stuff is simple-provide something for=\r\n the enitities to make their voices out of and they will speak, no friggin&#39;=\r\n mystery, no magic, no secret tecnology, no high priest(ess) needed. \n=C2=\r\n=A0\n=C2=A0Frank-S\n\n=C2=A0\nOn Sun, May 3, 2009 at 7:56 PM, itcdeadpeople &lt;IT=\r\nCdeadpeople@ aol.com&gt; wrote:\n\n\n\n\n\n\n\n\nFrank, I think you misunderstood or mi=\r\nsread something somewhere. The AAEVP/Sarah Estep Research Fund is not for A=\r\nAEVP to do the research, it&#39;s for them to fund OUTSIDE organizations for TH=\r\nEIR scientific research on the study of EVP. The Windbridge Institute recei=\r\nved some of this sponsor money for what they called &quot;Real-time EVP Conversa=\r\ntions: A Pilot Study.&quot; The method for this communication was *not* based on=\r\n radio sweep, nor traditional methods, so it&#39;s not based on what I assume m=\r\nany people here are doing. And in fact, it *was* based on the creations of =\r\nsomeone outside of the USA, so I&#39;m a little confused as to why all the host=\r\nility toward AAEVP for putting up the money.\n\n\nSadly, radio sweep methods d=\r\non&#39;t, and may not for a long time, get the respect of the scientific commun=\r\nity that it deserves (then again, seems no form of EVP does), but at least =\r\nthis current research is a step in the right direction. I hope, when Windbr=\r\nidge concludes their study, that it will support the notion that there is a=\r\npparent communication formed in ways that cannot be explained by currently =\r\nknown and understood laws of nature. THAT alone, in my opinion, would be a =\r\nbig plus for all ITC communities, regardless of the method from which that =\r\ncommunication was received. What&#39;s the old saying? &quot;It takes but one white =\r\ncrow to prove all crows are not black.&quot; Any proof, derived from any EVP met=\r\nhod, would be greatly welcomed as far as I&#39;m concerned.\n\n\nMargaret \n\n\n--- I=\r\nn EVP-ITC@yahoogroups .com, Frank Sumption &lt;purplealiengirl@ ...&gt; wrote:\n&gt;\n=\r\n&gt; It&#39;s the same old stuff, everyone wants to completely ignore absolutely a=\r\nll\n\n&gt; work that has been in this field since the caveman and act like they =\r\njust\n&gt; discovered spirit and EVP. Completely ignore all the work in this co=\r\nuntry\n&gt; and in Europe, and if anyone says anything, oh well, you&#39;re just be=\r\ning\n\n&gt; negative! Why everyone knows there no EVP/ITC research outside AAEVP=\r\n!\n&gt; \n&gt; Frank-S\n&gt; \n&gt; On Sun, May 3, 2009 at 4:41 PM, Frank Sumption &lt;purplea=\r\nliengirl@ ...&gt;wrote: \n\n&gt; \n&gt; &gt; Yeah, it&#39;s not what you know....\n&gt; &gt;\n&gt; &gt; F-S\n=\r\n&gt; &gt;\n\n&gt; &gt; On Sun, May 3, 2009 at 8:35 AM, &lt;SnowfireL@.. .&gt; wrote:\n&gt; &gt;\n&gt; &gt;&gt;\n&gt;=\r\n &gt;&gt;\n&gt; &gt;&gt; They were given a grant to do what you all are doing,\n&gt; &gt;&gt;\n&gt; &gt;&gt;\n\n&gt;=\r\n &gt;&gt; http://www.aaevp. com/research. htm\n&gt; &gt;&gt;\n&gt; &gt;&gt; ------------ --------- --=\r\n-------\n&gt; &gt;&gt; *The Average US Credit Score is 692. See Yours in Just 2 Easy =\r\nSteps!&lt;http://pr.atwola. com/promoclk/ 100126575x122237 6998x1201454298/ ao=\r\nl?redir=3D http://www. freecreditreport .com/pm/default. aspx?sc=3D668072&h=\r\nmpgID=3D62&bcd=3DMay5309Avgfoote rNO62&gt;\n\n&gt; &gt;&gt; *\n&gt; &gt;&gt;\n&gt; &gt;&gt; \n&gt; &gt;&gt;\n&gt; &gt;\n&gt; &gt;\n&gt;\n\n=\r\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n      \n\n    \n    \n\t\n\t \n\t\n\t\n\n\n\n\n\n\n\n\n\t\n\n\n\t\n\t\n\n\n      \r\n--0-123234573-1241457226=:12302\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;Frank =E2=80=93 I think I disagree with you h=\r\nere.&nbsp; Science is not just about the evidence, it=E2=80=99s about the e=\r\nntire process, including how the evidence is collected and how (and by whom=\r\n) it is interpreted.&nbsp; This is why a valuable tool in the scientific ar=\r\nsenal is the double (and triple) blind study.&nbsp; It attempts to remove t=\r\nhe often uncontrollable subjectivity inherent in all people, even scientist=\r\ns!&nbsp; Science uses this technique to help keep even itself as honest as =\r\npossible.&nbsp; So if you are finding that the evidence is being ignored, t=\r\nhe reason may not be the evidence itself (no matter how compelling). It may=\r\n very well be the manner in which it is collected, and interpreted: all at =\r\nleast as important as the audio itself.&lt;br&gt;&lt;br&gt;EVP=E2=80=99s are perfectly =\r\nallowed to throw monkey wrenches, and even kitchen sinks into scientific th=\r\neories and accepted\n dogmas: but only if they follow science=E2=80=99s rule=\r\ns.&nbsp; It=E2=80=99s like trying to put a new medicine on the market with =\r\nclaims that it destroys accepted dogmas: but, if the testing has not been r=\r\nigorous and up to accepted medical standards, its hard to blame consumers f=\r\nor being doubtful of its claims.&lt;br&gt;&lt;br&gt;Science is not magic: it is a simpl=\r\ne process really, but it forces a claim to really be solidly confirmed. It =\r\nseems to me that, while EVP research has its toe in the water of scientific=\r\n methodology (it is making observations, collecting evidence, and making th=\r\neories), it seems to be obsessed on that phase of science, and not on the h=\r\nard part: designing and conducting objective tests to conform or dismiss th=\r\ne theories.&nbsp; It seems that so many people are having so much fun with =\r\ntheir audio devices and results, that they are maybe afraid of taking it to=\r\n the next step of serious testing, maybe because of the risk this testing c=\r\nould destroy their\n fun.&lt;br&gt;&lt;br&gt;But they should maybe consider it might NOT=\r\n destroy their fun, but instead that next phase of testing may be just what=\r\n the doctors ordered to bring EVP into mainline science: real, science-base=\r\nd testing.&nbsp; I fear the people accepted as the real experts and pioneer=\r\ns in this field (like you Frank) will never get any acknowledgement of thei=\r\nr achievements unless they have are able to move into this next phase.&lt;br&gt;&lt;=\r\nbr&gt;Science wants you to piss on its fire, Frank.&nbsp; But you have to go w=\r\nhere the fire is.&nbsp;&nbsp; And the way there is through the entire scien=\r\ntific method, not just the early fun parts, but the hard testing parts.&nbs=\r\np; But I understand how difficult that prospect can be, and that it would t=\r\nake your focus off the part you seem to like best (experimenting with the e=\r\nquipment).&nbsp; If you are unable to bring yourself to the testing phase, =\r\nit might be worth looking at partnering up with others who would focus on t=\r\nhat part for\n you?&nbsp; I think a very dynamic team of people could be for=\r\nmed with you focused on the technology creation, and they focused on the mo=\r\nre mundane aspects of rigorous blind study testing.&nbsp; Do you think that=\r\n would be valuable to you, and to the field of EVP studies?&lt;br&gt;&nbsp;&lt;br&gt;&lt;b=\r\nr&gt;&lt;br&gt;--- On &lt;b&gt;Mon, 5/4/09, Frank Sumption &lt;i&gt;&lt;purplealiengirl@...=\r\nm&gt;&lt;/i&gt;&lt;/b&gt; wrote:&lt;br&gt;&lt;blockquote style=3D&quot;border-left: 2px solid rgb(16,=\r\n 16, 255); margin-left: 5px; padding-left: 5px;&quot;&gt;&lt;br&gt;From: Frank Sumption &=\r\nlt;purplealiengirl@...&gt;&lt;br&gt;Subject: Re: [EVP-ITC] Re: People given=\r\n a grant to do what you all are doing,&lt;br&gt;To: EVP-ITC@yahoogroups.com&lt;br&gt;Da=\r\nte: Monday, May 4, 2009, 9:28 AM&lt;br&gt;&lt;br&gt;&lt;div id=3D&quot;yiv220452750&quot;&gt;\n\n\n\n\n\n\n   =\r\n &lt;div id=3D&quot;ygrp-text&quot;&gt;\n      \n      &lt;p&gt;&lt;/p&gt;&lt;div&gt;&nbsp;It&#39;s not that it can=\r\n&#39;t be proven, it&#39;s that all evidence is deemed unacceptable- -a convinient =\r\nway to make uncompfortable facts go away.&nbsp; The fact is&nbsp; most of t=\r\nhe EVP evidence pretty much contradicts, or at least throws a monkey wrench=\r\n in many so called scientific theories, and accepted dogma. Even spirituali=\r\nsts don&#39;t accept that there&#39;s a technology&nbsp;for spirit communication, w=\r\nho needs a medium when you&#39;ve got box?&lt;/div&gt;\n\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;=\r\nTo me, it seems science has done little over the last 500 years except proc=\r\nlaim themsles the worlds only experts and source of all knowledge. All tech=\r\nnological advancement is made by people trying an idea to see what works, a=\r\nnd running with it, not waiting for peer review BS to tell her it doesn&#39;t w=\r\nork. Science is a bunch of fat old men sitting around a fire place in over =\r\nstuffed chairs telling each other how smart they are! They don&#39;t want anyon=\r\ne pissing on the fire!&lt;/div&gt;\n\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;Frank-S&lt;br&gt;&lt;br&gt;&lt;=\r\n/div&gt;\n&lt;div class=3D&quot;gmail_quote&quot;&gt;On Mon, May 4, 2009 at 9:20 AM, April Aber=\r\ncrombie &lt;span dir=3D&quot;ltr&quot;&gt;&lt;&lt;a rel=3D&quot;nofollow&quot; ymailto=3D&quot;mailto:april@a=\r\nbercrombieghostresearch.com&quot; target=3D&quot;_blank&quot; href=3D&quot;/mc/compose?to=3Dapr=\r\nil@...&quot;&gt;april@abercrombiegh ostresearch. com&lt;/a&gt;&g=\r\nt;&lt;/span&gt; wrote:&lt;br&gt;\n&lt;blockquote class=3D&quot;gmail_quote&quot; style=3D&quot;border-left=\r\n: 1px solid rgb(204, 204, 204);&quot;&gt;\n&lt;div style=3D&quot;background-color: rgb(255, =\r\n255, 255);&quot;&gt;\n&lt;div&gt;\n&lt;div&gt;\n&lt;div&gt;&lt;br&gt;&lt;br&gt;\n&lt;p&gt;\n&lt;/p&gt;&lt;div&gt;&lt;font face=3D&quot;Myriad Pr=\r\no&quot; size=3D&quot;2&quot;&gt;You will never be able to prove your methods scientifically, =\r\nso why even try to argue with them? Even if you were able to, they probably=\r\n still wouldn&#39;t believe it.&lt;/font&gt;&lt;/div&gt;\n&lt;div&gt;&lt;font face=3D&quot;Myriad Pro&quot; siz=\r\ne=3D&quot;2&quot;&gt;&lt;/font&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&lt;font face=3D&quot;Myriad Pro&quot; size=3D&quot;2&quot;&gt;IMO, =\r\nwho cares? All that matters is that you are getting something out of it. Be=\r\nsides, maybe it isn&#39;t meant to be understood by certain people. I have alwa=\r\nys held the opinion that we will never scientifically prove anything we do =\r\nin the paranormal field, and I think that is no accident. I think some peop=\r\nle will never get anything out of it, while others will excel in their know=\r\nledge, but it will be all very personal.&lt;/font&gt;&lt;/div&gt;\n\n&lt;div&gt;&lt;font face=3D&quot;M=\r\nyriad Pro&quot; size=3D&quot;2&quot;&gt;&lt;/font&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&lt;font face=3D&quot;Myriad Pro&quot; si=\r\nze=3D&quot;2&quot;&gt;It&#39;s all about what constitutes enough&nbsp;proof for you personal=\r\nly. You have to go with your gut on what is true spirit communication, and =\r\nwhat isn&#39;t. If no one ever agrees with you, so what?&lt;/font&gt;&lt;/div&gt;\n\n&lt;div&gt;&lt;fo=\r\nnt face=3D&quot;Myriad Pro&quot; size=3D&quot;2&quot;&gt;&lt;/font&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&lt;font face=3D&quot;My=\r\nriad Pro&quot; size=3D&quot;2&quot;&gt;April&lt;/font&gt;&lt;/div&gt;\n&lt;div&gt;\n&lt;div&gt;&lt;/div&gt;\n&lt;div class=3D&quot;h5&quot;=\r\n&gt;\n&lt;div&gt;&lt;font face=3D&quot;Myriad Pro&quot; size=3D&quot;2&quot;&gt;&lt;/font&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;----- =\r\nOriginal Message ----- &lt;/div&gt;\n&lt;blockquote dir=3D&quot;ltr&quot; style=3D&quot;border-left:=\r\n 2px solid rgb(0, 0, 0);&quot;&gt;\n&lt;div style=3D&quot;background: rgb(228, 228, 228) non=\r\ne repeat scroll 0% 0%; -moz-background-clip: -moz-initial; -moz-background-=\r\norigin: -moz-initial; -moz-background-inline-policy: -moz-initial; font-fam=\r\nily: arial; font-style: normal; font-variant: normal; font-weight: normal; =\r\nfont-size: 10pt; line-height: normal; font-size-adjust: none; font-stretch:=\r\n ; -x-system-font: none;&quot;&gt;&lt;b&gt;From:&lt;/b&gt; &lt;a rel=3D&quot;nofollow&quot; title=3D&quot;purplea=\r\nliengirl@...&quot; ymailto=3D&quot;mailto:purplealiengirl@...&quot; target=3D&quot;=\r\n_blank&quot; href=3D&quot;/mc/compose?to=3Dpurplealiengirl@...&quot;&gt;Frank Sumption&lt;=\r\n/a&gt; &lt;/div&gt;\n&lt;div style=3D&quot;font-family: arial; font-style: normal; font-varia=\r\nnt: normal; font-weight: normal; font-size: 10pt; line-height: normal; font=\r\n-size-adjust: none; font-stretch: ; -x-system-font: none;&quot;&gt;&lt;b&gt;To:&lt;/b&gt; &lt;a re=\r\nl=3D&quot;nofollow&quot; title=3D&quot;EVP-ITC@yahoogroups.com&quot; ymailto=3D&quot;mailto:EVP-ITC@=\r\nyahoogroups.com&quot; target=3D&quot;_blank&quot; href=3D&quot;/mc/compose?to=3DEVP-ITC@yahoogr=\r\noups.com&quot;&gt;EVP-ITC@yahoogroups .com&lt;/a&gt; &lt;/div&gt;\n&lt;div style=3D&quot;font-family: ar=\r\nial; font-style: normal; font-variant: normal; font-weight: normal; font-si=\r\nze: 10pt; line-height: normal; font-size-adjust: none; font-stretch: ; -x-s=\r\nystem-font: none;&quot;&gt;&lt;b&gt;Sent:&lt;/b&gt; Monday, May 04, 2009 9:07 AM&lt;/div&gt;\n&lt;div sty=\r\nle=3D&quot;font-family: arial; font-style: normal; font-variant: normal; font-we=\r\night: normal; font-size: 10pt; line-height: normal; font-size-adjust: none;=\r\n font-stretch: ; -x-system-font: none;&quot;&gt;&lt;b&gt;Subject:&lt;/b&gt; Re: [EVP-ITC] Re: P=\r\neople given a grant to do what you all are doing,&lt;/div&gt;\n&lt;div&gt;&lt;br&gt;&lt;/div&gt;\n&lt;di=\r\nv&gt;\n&lt;p&gt;\n&lt;/p&gt;&lt;div&gt;&nbsp;I was just sayin&#39;!&nbsp; So why would anyone in this =\r\nfield completely ignore methods that work, irregardless of whether science =\r\naccpts it? That&#39;s the thing, say anything and I&#39;m the one being negative. Q=\r\nuestion these other experts and I&#39;m being negative--on and on. &lt;/div&gt;\n\n&lt;div=\r\n&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;Same old story--don&#39;t accept the evidence, don&#39;t a=\r\nccept that that someone-like me-does in fact at least understand what condi=\r\ntions to create to make these communications possible. Yet y&#39;all wonder why=\r\n I have a case of the ass all the time. All the pompus self proclaimed egot=\r\nisical little dweebs out there chasing the damn fame and fortune--not facts=\r\n.&lt;/div&gt;\n\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;I have gotten so much friggn&#39;&nbsp;vo=\r\nices that can&#39;t be explained as anything but spirits/entity communication- =\r\n-not good enough! &lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;You hear that crap(an=\r\ny proof...)&nbsp;from every scientist/debunker- -well if the evidence was t=\r\nhere we&#39;d be the first to celibrate it-yeah right, rihgt after they burned,=\r\n burried, and debunked it. There is more than enough evidence--all of it is=\r\n ignored.&nbsp;&nbsp;&lt;/div&gt;\n\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;The stuff is simp=\r\nle-provide something for the enitities to make their voices out of and they=\r\n will speak, no friggin&#39; mystery, no magic, no secret tecnology, no high pr=\r\niest(ess) needed. &lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;Frank-S&lt;/div&gt;\n&lt;div&gt;&lt;b=\r\nr&gt;&nbsp;&lt;/div&gt;\n&lt;div class=3D&quot;gmail_quote&quot;&gt;On Sun, May 3, 2009 at 7:56 PM, i=\r\ntcdeadpeople &lt;span dir=3D&quot;ltr&quot;&gt;&lt;&lt;a rel=3D&quot;nofollow&quot; ymailto=3D&quot;mailto:IT=\r\nCdeadpeople@...&quot; target=3D&quot;_blank&quot; href=3D&quot;/mc/compose?to=3DITCdeadpeop=\r\nle@...&quot;&gt;ITCdeadpeople@ aol.com&lt;/a&gt;&gt;&lt;/span&gt; wrote:&lt;br&gt;\n&lt;blockquote cl=\r\nass=3D&quot;gmail_quote&quot; style=3D&quot;border-left: 1px solid rgb(204, 204, 204);&quot;&gt;\n&lt;=\r\ndiv style=3D&quot;background-color: rgb(255, 255, 255);&quot;&gt;\n&lt;div&gt;\n&lt;div&gt;\n&lt;div&gt;&lt;br&gt;&lt;=\r\nbr&gt;\n&lt;p&gt;Frank, I think you misunderstood or misread something somewhere. The=\r\n AAEVP/Sarah Estep Research Fund is not for AAEVP to do the research, it&#39;s =\r\nfor them to fund OUTSIDE organizations for THEIR scientific research on the=\r\n study of EVP. The Windbridge Institute received some of this sponsor money=\r\n for what they called &quot;Real-time EVP Conversations: A Pilot Study.&quot; The met=\r\nhod for this communication was *not* based on radio sweep, nor traditional =\r\nmethods, so it&#39;s not based on what I assume many people here are doing. And=\r\n in fact, it *was* based on the creations of someone outside of the USA, so=\r\n I&#39;m a little confused as to why all the hostility toward AAEVP for putting=\r\n up the money.&lt;br&gt;\n&lt;br&gt;Sadly, radio sweep methods don&#39;t, and may not for a =\r\nlong time, get the respect of the scientific community that it deserves (th=\r\nen again, seems no form of EVP does), but at least this current research is=\r\n a step in the right direction. I hope, when Windbridge concludes their stu=\r\ndy, that it will support the notion that there is apparent communication fo=\r\nrmed in ways that cannot be explained by currently known and understood law=\r\ns of nature. THAT alone, in my opinion, would be a big plus for all ITC com=\r\nmunities, regardless of the method from which that communication was receiv=\r\ned. What&#39;s the old saying? &quot;It takes but one white crow to prove all crows =\r\nare not black.&quot; Any proof, derived from any EVP method, would be greatly we=\r\nlcomed as far as I&#39;m concerned.&lt;br&gt;\n&lt;br&gt;Margaret \n&lt;/p&gt;&lt;div&gt;&lt;br&gt;&lt;br&gt;--- In &lt;=\r\na rel=3D&quot;nofollow&quot; ymailto=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot; target=3D&quot;_=\r\nblank&quot; href=3D&quot;/mc/compose?to=3DEVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogro=\r\nups .com&lt;/a&gt;, Frank Sumption &lt;purplealiengirl@ ...&gt; wrote:&lt;br&gt;&gt;&lt;br=\r\n&gt;&gt; It&#39;s the same old stuff, everyone wants to completely ignore absolute=\r\nly all&lt;br&gt;\n&gt; work that has been in this field since the caveman and act =\r\nlike they just&lt;br&gt;&gt; discovered spirit and EVP. Completely ignore all the=\r\n work in this country&lt;br&gt;&gt; and in Europe, and if anyone says anything, o=\r\nh well, you&#39;re just being&lt;br&gt;\n&gt; negative! Why everyone knows there no EV=\r\nP/ITC research outside AAEVP!&lt;br&gt;&gt; &lt;br&gt;&gt; Frank-S&lt;br&gt;&gt; &lt;br&gt;&lt;/div&gt;&g=\r\nt; On Sun, May 3, 2009 at 4:41 PM, Frank Sumption &lt;purplealiengirl@ ...&=\r\ngt;wrote: \n&lt;div&gt;&lt;br&gt;&gt; &lt;br&gt;&gt; &gt; Yeah, it&#39;s not what you know....&lt;br&gt;=\r\n&gt; &gt;&lt;br&gt;&gt; &gt; F-S&lt;br&gt;&gt; &gt;&lt;br&gt;&lt;/div&gt;\n&lt;div&gt;&gt; &gt; On Sun, Ma=\r\ny 3, 2009 at 8:35 AM, &lt;SnowfireL@.. .&gt; wrote:&lt;br&gt;&gt; &gt;&lt;br&gt;&gt; &g=\r\nt;&gt;&lt;br&gt;&gt; &gt;&gt;&lt;br&gt;&gt; &gt;&gt; They were given a grant to do what=\r\n you all are doing,&lt;br&gt;&gt; &gt;&gt;&lt;br&gt;&gt; &gt;&gt;&lt;br&gt;\n&gt; &gt;&gt; &lt;a =\r\nrel=3D&quot;nofollow&quot; target=3D&quot;_blank&quot; href=3D&quot;http://www.aaevp.com/research.ht=\r\nm&quot;&gt;http://www.aaevp. com/research. htm&lt;/a&gt;&lt;br&gt;&gt; &gt;&gt;&lt;br&gt;&gt; &gt;&gt=\r\n; ------------ --------- ---------&lt;br&gt;&lt;/div&gt;&gt; &gt;&gt; *The Average US C=\r\nredit Score is 692. See Yours in Just 2 Easy Steps!&lt;&lt;a rel=3D&quot;nofollow&quot; =\r\ntarget=3D&quot;_blank&quot; href=3D&quot;http://pr.atwola.com/promoclk/100126575x122237699=\r\n8x1201454298/aol?redir=3Dhttp://www.freecreditreport.com/pm/default.aspx?sc=\r\n=3D668072&amp;hmpgID=3D62&amp;bcd=3DMay5309AvgfooterNO62&quot;&gt;http://pr.atwola.=\r\n com/promoclk/ 100126575x122237 6998x1201454298/ aol?redir=3D http://www. f=\r\nreecreditreport .com/pm/default. aspx?sc=3D668072&amp;hmpgID=3D62&amp;bcd=\r\n=3DMay5309Avgfoote rNO62&lt;/a&gt;&gt;&lt;br&gt;\n&gt; &gt;&gt; *&lt;br&gt;&gt; &gt;&gt;&lt;br&gt;&g=\r\nt; &gt;&gt; &lt;br&gt;&gt; &gt;&gt;&lt;br&gt;&gt; &gt;&lt;br&gt;&gt; &gt;&lt;br&gt;&gt;&lt;br&gt;&lt;br&gt;\n&lt;p&gt;=\r\n&lt;/p&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;p&gt;&lt;/p&gt;&lt;/div&gt;\n&lt;div style=3D&quot;color: white;&quot;&gt;&lt;/div&gt;&lt;/div=\r\n&gt;&lt;/div&gt;&lt;/div&gt;&lt;/blockquote&gt;&lt;/div&gt;&lt;br&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;p&gt;&lt;/p&gt;&lt;/div&gt;&lt;/blockquote&gt;&lt;/di=\r\nv&gt;&lt;/div&gt;\n&lt;p&gt;&lt;/p&gt;&lt;/div&gt;\n&lt;div style=3D&quot;color: white;&quot;&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div=\r\n&gt;&lt;/blockquote&gt;&lt;/div&gt;&lt;br&gt;\n\n \n\n    &lt;/div&gt;  \n\n\n\t \n\t\n\t&lt;/div&gt;&lt;/blockquote&gt;&lt;/td&gt;&lt;=\r\n/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n      \r\n--0-123234573-1241457226=:12302--"}