{"id": "14051", "subject": "Re: Hopefull,", "author": "itcdeadpeople", "timestamp": "2009-05-04T05:31:21Z", "full_text": "Indeed, it was at Dave&#39;s suggestion to try this method that I became of fan of manual radio sweep (though I think it had been around for ages prior to that, I&#39;d never heard of it.) I find Dave&#39;s experiments to be endlessly fascinating.  Surely seems he got a double-dose, or more, of innate smartness and creativity.  ;-)  \n\n--- In EVP-ITC@yahoogroups.com, Misty Dawn &lt;bulletbabea@...&gt; wrote:\n&gt;\n&gt; Yep ever since Frank Sumption and Retro Dave mentioned trying it and I did, I find it fascinating and very useful as a tool. I waited a long time for them to &quot;work together&quot; as spirit said they would and that conversation is here in the archives. Works great and allows for adjustments easily.\n&gt; \n&gt; Thanks again to those guys for chit chatting here that day! I agree everyone should try it! No box needed for sweep tuning method.\n&gt; \n&gt; Misty\n&gt; \n&gt; --- On Sun, 5/3/09, itcdeadpeople &lt;ITCdeadpeople@...&gt; wrote:\n&gt; \n&gt; \n&gt; From: itcdeadpeople &lt;ITCdeadpeople@...&gt;\n&gt; Subject: [EVP-ITC] Re: Hopefull,\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Sunday, May 3, 2009, 5:52 PM\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; I hope you&#39;ll give manual sweep a try. As I&#39;ve mentioned in other posts, I have a number of the automated sweep devices, and the manual sweep results can give any of them a run for their money. You can try just about any radio that has a tight enough dial to rapidly move back and forth across the band. \n&gt; \n&gt; There is also one known unit out there (probably more yet undiscovered) that all you have to do is hold down the tuner button (and keep holding) and it sweeps automatically without being hacked. See if you can pick up a Sony #SRF-M37V. I know other researchers who&#39;ve gotten good results with that. Just add batteries and you&#39;re good to go. Oh, and an external speaker too. \n&gt; \n&gt; Margaret\n&gt; \n&gt; --- In EVP-ITC@yahoogroups .com, SnowfireL@ . wrote:\n&gt; &gt;\n&gt; &gt; If someone out there could/would make me a radio or box that doesn&#39;t tick, \n&gt; &gt; and has a fast speed, I would pay them up front for it and the work they \n&gt; &gt; do, I am not sure with ebay, because I want to know that I am getting the \n&gt; &gt; right kind. Thank you, SF\n&gt; &gt; p.s. let me know, I will be more than glad to pay for it up front with a \n&gt; &gt; good electronic&#39;s person.\n&gt; &gt; ************ **The Average US Credit Score is 692. See Yours in Just 2 Easy \n&gt; &gt; Steps! \n&gt; &gt; (http://pr.atwola. com/promoclk/ 100126575x122237 6998x1201454298/ aol?redir= http://www. freecreditreport .com/pm/default. aspx?sc=668072& hmpgID=62& bcd=M\n&gt; &gt; ay5309AvgfooterNO62 )\n&gt; &gt;\n&gt;"}