{"id": "14061", "subject": "Re: [EVP-ITC] Re: People given a grant to do what you all are doing,", "author": "Rj", "timestamp": "2009-05-04T19:56:27Z", "full_text": "--0-1036554853-1241466987=:47464\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nI think I understand what you and April are saying Frank - I think I was ju=\r\nst confused because words like &#39;proof&#39; are used in so many ways.=C2=A0 Ther=\r\ne is scientific proof (which basically means that collected data, observati=\r\nons, and experimental results conform to given theories) and personal proof=\r\n (which is whatever it takes for a person, personally, to believe something=\r\n, regardless of what anyone else says, sort of like with religion).=C2=A0 I=\r\n thought you all were talking about the former, but I see that you both mea=\r\nnt the latter.=C2=A0 I can offer advice to improve EVP testing as far as sc=\r\nientific proof, but as I think you&#39;ve shown, there is no need for me to sug=\r\ngest anything for helping along personal proof.\n\nBut my offer still stands =\r\nif you&#39;d ever be interested in exposing your experiences to a more formal p=\r\nrocess, and trying to create a team, with you as the tech expert, to bring =\r\nthese studies to the next phase.\n\n\n\n--- On Mon, 5/4/09, Frank Sumption &lt;pur=\r\nplealiengirl@...&gt; wrote:\n\nFrom: Frank Sumption &lt;purplealiengirl@gmail=\r\n.com&gt;\nSubject: Re: [EVP-ITC] Re: People given a grant to do what you all ar=\r\ne doing,\nTo: EVP-ITC@yahoogroups.com\nDate: Monday, May 4, 2009, 12:34 PM\n\n\n=\r\n\n\n\n\n\n\n\n\n\n    \n            \n            \n\n\n      \n      =C2=A0Medical Scienc=\r\ne!? Really!? Are you FN kidding me!? A &quot;science&quot; that is directly responsib=\r\nle for the deaths and suffering of hundreds of thousands every year by the =\r\nuse of drugs and practices that suppsedly underwent these bogus studies for=\r\n safety and effectiveness. That&#39;s your example of science? Where&#39;s the &quot;sci=\r\nence&quot; when you can make these studies show whatever you want, or whatever s=\r\nomeone paid for?=C2=A0 Science is a big fat lie! \n\n=C2=A0\n=C2=A0I do what I=\r\n do for my own curiosity, I know it works and I can show it works for spiri=\r\nt communication, but I ain&#39;t jumpin&#39; through anyone&#39;s hoops! Not for scienc=\r\ne, or any other religion!\n=C2=A0\n=C2=A0Frank-S\n\n\nOn Mon, May 4, 2009 at 11:=\r\n13 AM, Rj &lt;rasterer@yahoo. com&gt; wrote:\n\n\n\n\n\n\n\n\n\n\n\n\nFrank =E2=80=93 I think =\r\nI disagree with you here.=C2=A0 Science is not just about the evidence, it=\r\n=E2=80=99s about the entire process, including how the evidence is collecte=\r\nd and how (and by whom) it is interpreted.=C2=A0 This is why a valuable too=\r\nl in the scientific arsenal is the double (and triple) blind study.=C2=A0 I=\r\nt attempts to remove the often uncontrollable subjectivity inherent in all =\r\npeople, even scientists!=C2=A0 Science uses this technique to help keep eve=\r\nn itself as honest as possible.=C2=A0 So if you are finding that the eviden=\r\nce is being ignored, the reason may not be the evidence itself (no matter h=\r\now compelling). It may very well be the manner in which it is collected, an=\r\nd interpreted: all at least as important as the audio itself.\n\n\nEVP=E2=80=\r\n=99s are perfectly allowed to throw monkey wrenches, and even kitchen sinks=\r\n into scientific theories and accepted dogmas: but only if they follow scie=\r\nnce=E2=80=99s rules.=C2=A0 It=E2=80=99s like trying to put a new medicine o=\r\nn the market with claims that it destroys accepted dogmas: but, if the test=\r\ning has not been rigorous and up to accepted medical standards, its hard to=\r\n blame consumers for being doubtful of its claims.\n\n\nScience is not magic: =\r\nit is a simple process really, but it forces a claim to really be solidly c=\r\nonfirmed. It seems to me that, while EVP research has its toe in the water =\r\nof scientific methodology (it is making observations, collecting evidence, =\r\nand making theories), it seems to be obsessed on that phase of science, and=\r\n not on the hard part: designing and conducting objective tests to conform =\r\nor dismiss the theories.=C2=A0 It seems that so many people are having so m=\r\nuch fun with their audio devices and results, that they are maybe afraid of=\r\n taking it to the next step of serious testing, maybe because of the risk t=\r\nhis testing could destroy their fun.\n\n\nBut they should maybe consider it mi=\r\nght NOT destroy their fun, but instead that next phase of testing may be ju=\r\nst what the doctors ordered to bring EVP into mainline science: real, scien=\r\nce-based testing.=C2=A0 I fear the people accepted as the real experts and =\r\npioneers in this field (like you Frank) will never get any acknowledgement =\r\nof their achievements unless they have are able to move into this next phas=\r\ne.\n\n\nScience wants you to piss on its fire, Frank.=C2=A0 But you have to go=\r\n where the fire is.=C2=A0=C2=A0 And the way there is through the entire sci=\r\nentific method, not just the early fun parts, but the hard testing parts.=\r\n=C2=A0 But I understand how difficult that prospect can be, and that it wou=\r\nld take your focus off the part you seem to like best (experimenting with t=\r\nhe equipment).=C2=A0 If you are unable to bring yourself to the testing pha=\r\nse, it might be worth looking at partnering up with others who would focus =\r\non that part for you?=C2=A0 I think a very dynamic team of people could be =\r\nformed with you focused on the technology creation, and they focused on the=\r\n more mundane aspects of rigorous blind study testing.=C2=A0 Do you think t=\r\nhat would be valuable to you, and to the field of EVP studies? \n\n=C2=A0\n\n\n-=\r\n-- On Mon, 5/4/09, Frank Sumption &lt;purplealiengirl@ gmail.com&gt; wrote:\n\n\n\nFr=\r\nom: Frank Sumption &lt;purplealiengirl@ gmail.com&gt;\n\nSubject: Re: [EVP-ITC] Re:=\r\n People given a grant to do what you all are doing,\n\nTo: EVP-ITC@yahoogroup=\r\ns .com\nDate: Monday, May 4, 2009, 9:28 AM\n\n\n\n\n\n\n=C2=A0It&#39;s not that it can&#39;=\r\nt be proven, it&#39;s that all evidence is deemed unacceptable- -a convinient w=\r\nay to make uncompfortable facts go away.=C2=A0 The fact is=C2=A0 most of th=\r\ne EVP evidence pretty much contradicts, or at least throws a monkey wrench =\r\nin many so called scientific theories, and accepted dogma. Even spiritualis=\r\nts don&#39;t accept that there&#39;s a technology=C2=A0for spirit communication, wh=\r\no needs a medium when you&#39;ve got box?\n\n=C2=A0\n=C2=A0To me, it seems science=\r\n has done little over the last 500 years except proclaim themsles the world=\r\ns only experts and source of all knowledge. All technological advancement i=\r\ns made by people trying an idea to see what works, and running with it, not=\r\n waiting for peer review BS to tell her it doesn&#39;t work. Science is a bunch=\r\n of fat old men sitting around a fire place in over stuffed chairs telling =\r\neach other how smart they are! They don&#39;t want anyone pissing on the fire!\n=\r\n\n=C2=A0\n=C2=A0Frank-S\n\n\n\n\n\nOn Mon, May 4, 2009 at 9:20 AM, April Abercrombi=\r\ne &lt;april@abercrombiegh ostresearch. com&gt; wrote:\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou will never=\r\n be able to prove your methods scientifically, so why even try to argue wit=\r\nh them? Even if you were able to, they probably still wouldn&#39;t believe it.\n=\r\n=C2=A0\nIMO, who cares? All that matters is that you are getting something o=\r\nut of it. Besides, maybe it isn&#39;t meant to be understood by certain people.=\r\n I have always held the opinion that we will never scientifically prove any=\r\nthing we do in the paranormal field, and I think that is no accident. I thi=\r\nnk some people will never get anything out of it, while others will excel i=\r\nn their knowledge, but it will be all very personal.\n\n=C2=A0\nIt&#39;s all about=\r\n what constitutes enough=C2=A0proof for you personally. You have to go with=\r\n your gut on what is true spirit communication, and what isn&#39;t. If no one e=\r\nver agrees with you, so what?\n\n=C2=A0\nApril\n\n\n\n=C2=A0\n----- Original Messag=\r\ne ----- \n\n\n\n\nFrom: Frank Sumption \n\nTo: EVP-ITC@yahoogroups .com \n\nSent: Mo=\r\nnday, May 04, 2009 9:07 AM\nSubject: Re: [EVP-ITC] Re: People given a grant =\r\nto do what you all are doing,\n\n\n\n\n\n\n\n\n=C2=A0I was just sayin&#39;!=C2=A0 So why=\r\n would anyone in this field completely ignore methods that work, irregardle=\r\nss of whether science accpts it? That&#39;s the thing, say anything and I&#39;m the=\r\n one being negative. Question these other experts and I&#39;m being negative--o=\r\nn and on. \n\n=C2=A0\n=C2=A0Same old story--don&#39;t accept the evidence, don&#39;t a=\r\nccept that that someone-like me-does in fact at least understand what condi=\r\ntions to create to make these communications possible. Yet y&#39;all wonder why=\r\n I have a case of the ass all the time. All the pompus self proclaimed egot=\r\nisical little dweebs out there chasing the damn fame and fortune--not facts=\r\n.\n\n=C2=A0\n=C2=A0I have gotten so much friggn&#39;=C2=A0voices that can&#39;t be exp=\r\nlained as anything but spirits/entity communication- -not good enough! \n=C2=\r\n=A0\n=C2=A0You hear that crap(any proof...)=C2=A0from every scientist/debunk=\r\ner- -well if the evidence was there we&#39;d be the first to celibrate it-yeah =\r\nright, rihgt after they burned, burried, and debunked it. There is more tha=\r\nn enough evidence--all of it is ignored.=C2=A0=C2=A0\n\n=C2=A0\n=C2=A0The stuf=\r\nf is simple-provide something for the enitities to make their voices out of=\r\n and they will speak, no friggin&#39; mystery, no magic, no secret tecnology, n=\r\no high priest(ess) needed. \n=C2=A0\n=C2=A0Frank-S\n\n=C2=A0\n\n\n\nOn Sun, May 3, =\r\n2009 at 7:56 PM, itcdeadpeople &lt;ITCdeadpeople@ aol.com&gt; wrote:\n\n\n\n\n\n\n\n\n\n\n\n\n=\r\nFrank, I think you misunderstood or misread something somewhere. The AAEVP/=\r\nSarah Estep Research Fund is not for AAEVP to do the research, it&#39;s for the=\r\nm to fund OUTSIDE organizations for THEIR scientific research on the study =\r\nof EVP. The Windbridge Institute received some of this sponsor money for wh=\r\nat they called &quot;Real-time EVP Conversations: A Pilot Study.&quot; The method for=\r\n this communication was *not* based on radio sweep, nor traditional methods=\r\n, so it&#39;s not based on what I assume many people here are doing. And in fac=\r\nt, it *was* based on the creations of someone outside of the USA, so I&#39;m a =\r\nlittle confused as to why all the hostility toward AAEVP for putting up the=\r\n money.\n\n\nSadly, radio sweep methods don&#39;t, and may not for a long time, ge=\r\nt the respect of the scientific community that it deserves (then again, see=\r\nms no form of EVP does), but at least this current research is a step in th=\r\ne right direction. I hope, when Windbridge concludes their study, that it w=\r\nill support the notion that there is apparent communication formed in ways =\r\nthat cannot be explained by currently known and understood laws of nature. =\r\nTHAT alone, in my opinion, would be a big plus for all ITC communities, reg=\r\nardless of the method from which that communication was received. What&#39;s th=\r\ne old saying? &quot;It takes but one white crow to prove all crows are not black=\r\n.&quot; Any proof, derived from any EVP method, would be greatly welcomed as far=\r\n as I&#39;m concerned.\n\n\nMargaret \n\n\n--- In EVP-ITC@yahoogroups .com, Frank Sum=\r\nption &lt;purplealiengirl@ ...&gt; wrote:\n&gt;\n&gt; It&#39;s the same old stuff, everyone w=\r\nants to completely ignore absolutely all\n\n&gt; work that has been in this fiel=\r\nd since the caveman and act like they just\n&gt; discovered spirit and EVP. Com=\r\npletely ignore all the work in this country\n&gt; and in Europe, and if anyone =\r\nsays anything, oh well, you&#39;re just being\n\n&gt; negative! Why everyone knows t=\r\nhere no EVP/ITC research outside AAEVP!\n&gt; \n&gt; Frank-S\n&gt; \n&gt; On Sun, May 3, 20=\r\n09 at 4:41 PM, Frank Sumption &lt;purplealiengirl@ ...&gt;wrote: \n\n&gt; \n&gt; &gt; Yeah, i=\r\nt&#39;s not what you know....\n&gt; &gt;\n&gt; &gt; F-S\n&gt; &gt;\n\n&gt; &gt; On Sun, May 3, 2009 at 8:35 =\r\nAM, &lt;SnowfireL@.. .&gt; wrote:\n&gt; &gt;\n&gt; &gt;&gt;\n&gt; &gt;&gt;\n&gt; &gt;&gt; They were given a grant to d=\r\no what you all are doing,\n&gt; &gt;&gt;\n&gt; &gt;&gt;\n\n&gt; &gt;&gt; http://www.aaevp. com/research. h=\r\ntm\n&gt; &gt;&gt;\n&gt; &gt;&gt; ------------ --------- ---------\n\n&gt; &gt;&gt; *The Average US Credit =\r\nScore is 692. See Yours in Just 2 Easy Steps!&lt;http://pr.atwola. com/promocl=\r\nk/ 100126575x122237 6998x1201454298/ aol?redir=3D http://www. freecreditrep=\r\nort .com/pm/default. aspx?sc=3D668072&hmpgID=3D62&bcd=3DMay5309Avgfoote rNO=\r\n62&gt;\n\n&gt; &gt;&gt; *\n&gt; &gt;&gt;\n&gt; &gt;&gt; \n&gt; &gt;&gt;\n&gt; &gt;\n&gt; &gt;\n&gt;\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n      \n\n    \n    =\r\n\n\t\n\t \n\t\n\t\n\n\n\n\n\n\n\n\n\t\n\n\n\t\n\t\n\n\n      \r\n--0-1036554853-1241466987=:47464\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;I think I understand what you and April are s=\r\naying Frank - I think I was just confused because words like &#39;proof&#39; are us=\r\ned in so many ways.&nbsp; There is scientific proof (which basically means =\r\nthat collected data, observations, and experimental results conform to give=\r\nn theories) and personal proof (which is whatever it takes for a person, pe=\r\nrsonally, to believe something, regardless of what anyone else says, sort o=\r\nf like with religion).&nbsp; I thought you all were talking about the forme=\r\nr, but I see that you both meant the latter.&nbsp; I can offer advice to im=\r\nprove EVP testing as far as scientific proof, but as I think you&#39;ve shown, =\r\nthere is no need for me to suggest anything for helping along personal proo=\r\nf.&lt;br&gt;&lt;br&gt;But my offer still stands if you&#39;d ever be interested in exposing=\r\n your experiences to a more formal process, and trying to create a team, wi=\r\nth\n you as the tech expert, to bring these studies to the next phase.&lt;br&gt;&lt;b=\r\nr&gt;&lt;br&gt;&lt;br&gt;--- On &lt;b&gt;Mon, 5/4/09, Frank Sumption &lt;i&gt;&lt;purplealiengirl@gmai=\r\nl.com&gt;&lt;/i&gt;&lt;/b&gt; wrote:&lt;br&gt;&lt;blockquote style=3D&quot;border-left: 2px solid rgb=\r\n(16, 16, 255); margin-left: 5px; padding-left: 5px;&quot;&gt;&lt;br&gt;From: Frank Sumpti=\r\non &lt;purplealiengirl@...&gt;&lt;br&gt;Subject: Re: [EVP-ITC] Re: People g=\r\niven a grant to do what you all are doing,&lt;br&gt;To: EVP-ITC@yahoogroups.com&lt;b=\r\nr&gt;Date: Monday, May 4, 2009, 12:34 PM&lt;br&gt;&lt;br&gt;&lt;div id=3D&quot;yiv1722457487&quot;&gt;\n\n\n\n=\r\n\n\n\n    &lt;div id=3D&quot;ygrp-text&quot;&gt;\n      \n      &lt;p&gt;&lt;/p&gt;&lt;div&gt;&nbsp;Medical Scienc=\r\ne!? Really!? Are you FN kidding me!? A &quot;science&quot; that is directly responsib=\r\nle for the deaths and suffering of hundreds of thousands every year by the =\r\nuse of drugs and practices that suppsedly underwent these bogus studies for=\r\n safety and effectiveness. That&#39;s your example of science? Where&#39;s the &quot;sci=\r\nence&quot; when you can make these studies show whatever you want, or whatever s=\r\nomeone paid for?&nbsp; Science is a big fat lie! &lt;/div&gt;\n\n&lt;div&gt;&nbsp;&lt;/div&gt;\n=\r\n&lt;div&gt;&nbsp;I do what I do for my own curiosity, I know it works and I can s=\r\nhow it works for spirit communication, but I ain&#39;t jumpin&#39; through anyone&#39;s=\r\n hoops! Not for science, or any other religion!&lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;di=\r\nv&gt;&nbsp;Frank-S&lt;br&gt;&lt;br&gt;&lt;/div&gt;\n&lt;div class=3D&quot;gmail_quote&quot;&gt;On Mon, May 4, 200=\r\n9 at 11:13 AM, Rj &lt;span dir=3D&quot;ltr&quot;&gt;&lt;&lt;a rel=3D&quot;nofollow&quot; ymailto=3D&quot;mail=\r\nto:rasterer@...&quot; target=3D&quot;_blank&quot; href=3D&quot;/mc/compose?to=3Drasterer@=\r\nyahoo.com&quot;&gt;rasterer@yahoo. com&lt;/a&gt;&gt;&lt;/span&gt; wrote:&lt;br&gt;\n&lt;blockquote class=\r\n=3D&quot;gmail_quote&quot; style=3D&quot;border-left: 1px solid rgb(204, 204, 204);&quot;&gt;\n&lt;div=\r\n style=3D&quot;background-color: rgb(255, 255, 255);&quot;&gt;\n&lt;div&gt;\n&lt;div&gt;\n&lt;div&gt;&lt;br&gt;&lt;br&gt;=\r\n\n&lt;p&gt;\n&lt;table border=3D&quot;0&quot; cellpadding=3D&quot;0&quot; cellspacing=3D&quot;0&quot;&gt;\n&lt;tbody&gt;\n&lt;tr&gt;\n=\r\n&lt;td valign=3D&quot;top&quot;&gt;Frank =E2=80=93 I think I disagree with you here.&nbsp; =\r\nScience is not just about the evidence, it=E2=80=99s about the entire proce=\r\nss, including how the evidence is collected and how (and by whom) it is int=\r\nerpreted.&nbsp; This is why a valuable tool in the scientific arsenal is th=\r\ne double (and triple) blind study.&nbsp; It attempts to remove the often un=\r\ncontrollable subjectivity inherent in all people, even scientists!&nbsp; Sc=\r\nience uses this technique to help keep even itself as honest as possible.&n=\r\nbsp; So if you are finding that the evidence is being ignored, the reason m=\r\nay not be the evidence itself (no matter how compelling). It may very well =\r\nbe the manner in which it is collected, and interpreted: all at least as im=\r\nportant as the audio itself.&lt;br&gt;\n&lt;br&gt;EVP=E2=80=99s are perfectly allowed to=\r\n throw monkey wrenches, and even kitchen sinks into scientific theories and=\r\n accepted dogmas: but only if they follow science=E2=80=99s rules.&nbsp; It=\r\n=E2=80=99s like trying to put a new medicine on the market with claims that=\r\n it destroys accepted dogmas: but, if the testing has not been rigorous and=\r\n up to accepted medical standards, its hard to blame consumers for being do=\r\nubtful of its claims.&lt;br&gt;\n&lt;br&gt;Science is not magic: it is a simple process =\r\nreally, but it forces a claim to really be solidly confirmed. It seems to m=\r\ne that, while EVP research has its toe in the water of scientific methodolo=\r\ngy (it is making observations, collecting evidence, and making theories), i=\r\nt seems to be obsessed on that phase of science, and not on the hard part: =\r\ndesigning and conducting objective tests to conform or dismiss the theories=\r\n.&nbsp; It seems that so many people are having so much fun with their audi=\r\no devices and results, that they are maybe afraid of taking it to the next =\r\nstep of serious testing, maybe because of the risk this testing could destr=\r\noy their fun.&lt;br&gt;\n&lt;br&gt;But they should maybe consider it might NOT destroy t=\r\nheir fun, but instead that next phase of testing may be just what the docto=\r\nrs ordered to bring EVP into mainline science: real, science-based testing.=\r\n&nbsp; I fear the people accepted as the real experts and pioneers in this =\r\nfield (like you Frank) will never get any acknowledgement of their achievem=\r\nents unless they have are able to move into this next phase.&lt;br&gt;\n&lt;br&gt;Scienc=\r\ne wants you to piss on its fire, Frank.&nbsp; But you have to go where the =\r\nfire is.&nbsp;&nbsp; And the way there is through the entire scientific met=\r\nhod, not just the early fun parts, but the hard testing parts.&nbsp; But I =\r\nunderstand how difficult that prospect can be, and that it would take your =\r\nfocus off the part you seem to like best (experimenting with the equipment)=\r\n.&nbsp; If you are unable to bring yourself to the testing phase, it might =\r\nbe worth looking at partnering up with others who would focus on that part =\r\nfor you?&nbsp; I think a very dynamic team of people could be formed with y=\r\nou focused on the technology creation, and they focused on the more mundane=\r\n aspects of rigorous blind study testing.&nbsp; Do you think that would be =\r\nvaluable to you, and to the field of EVP studies? \n&lt;div class=3D&quot;im&quot;&gt;&lt;br&gt;&n=\r\nbsp;&lt;br&gt;&lt;br&gt;&lt;br&gt;--- On &lt;b&gt;Mon, 5/4/09, Frank Sumption &lt;i&gt;&lt;&lt;a rel=3D&quot;nofo=\r\nllow&quot; ymailto=3D&quot;mailto:purplealiengirl@...&quot; target=3D&quot;_blank&quot; href=\r\n=3D&quot;/mc/compose?to=3Dpurplealiengirl@...&quot;&gt;purplealiengirl@ gmail.com&lt;=\r\n/a&gt;&gt;&lt;/i&gt;&lt;/b&gt; wrote:&lt;br&gt;&lt;/div&gt;\n&lt;blockquote style=3D&quot;border-left: 2px soli=\r\nd rgb(16, 16, 255);&quot;&gt;\n&lt;div class=3D&quot;im&quot;&gt;&lt;br&gt;From: Frank Sumption &lt;&lt;a rel=\r\n=3D&quot;nofollow&quot; ymailto=3D&quot;mailto:purplealiengirl@...&quot; target=3D&quot;_blank=\r\n&quot; href=3D&quot;/mc/compose?to=3Dpurplealiengirl@...&quot;&gt;purplealiengirl@ gmai=\r\nl.com&lt;/a&gt;&gt;&lt;br&gt;&lt;/div&gt;\n&lt;div class=3D&quot;im&quot;&gt;Subject: Re: [EVP-ITC] Re: People=\r\n given a grant to do what you all are doing,&lt;br&gt;&lt;/div&gt;\n&lt;div class=3D&quot;im&quot;&gt;To=\r\n: &lt;a rel=3D&quot;nofollow&quot; ymailto=3D&quot;mailto:EVP-ITC@yahoogroups.com&quot; target=3D&quot;=\r\n_blank&quot; href=3D&quot;/mc/compose?to=3DEVP-ITC@yahoogroups.com&quot;&gt;EVP-ITC@yahoogrou=\r\nps .com&lt;/a&gt;&lt;br&gt;&lt;/div&gt;Date: Monday, May 4, 2009, 9:28 AM&lt;br&gt;&lt;br&gt;\n&lt;div&gt;\n&lt;div&gt;=\r\n\n&lt;div class=3D&quot;im&quot;&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;div&gt;&nbsp;It&#39;s not that it can&#39;t be proven, it=\r\n&#39;s that all evidence is deemed unacceptable- -a convinient way to make unco=\r\nmpfortable facts go away.&nbsp; The fact is&nbsp; most of the EVP evidence =\r\npretty much contradicts, or at least throws a monkey wrench in many so call=\r\ned scientific theories, and accepted dogma. Even spiritualists don&#39;t accept=\r\n that there&#39;s a technology&nbsp;for spirit communication, who needs a mediu=\r\nm when you&#39;ve got box?&lt;/div&gt;\n\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;To me, it seems =\r\nscience has done little over the last 500 years except proclaim themsles th=\r\ne worlds only experts and source of all knowledge. All technological advanc=\r\nement is made by people trying an idea to see what works, and running with =\r\nit, not waiting for peer review BS to tell her it doesn&#39;t work. Science is =\r\na bunch of fat old men sitting around a fire place in over stuffed chairs t=\r\nelling each other how smart they are! They don&#39;t want anyone pissing on the=\r\n fire!&lt;/div&gt;\n\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;Frank-S&lt;br&gt;&lt;br&gt;&lt;/div&gt;&lt;/div&gt;\n&lt;div=\r\n class=3D&quot;gmail_quote&quot;&gt;\n&lt;div&gt;\n&lt;div&gt;&lt;/div&gt;\n&lt;div class=3D&quot;h5&quot;&gt;On Mon, May 4, =\r\n2009 at 9:20 AM, April Abercrombie &lt;span dir=3D&quot;ltr&quot;&gt;&lt;&lt;a rel=3D&quot;nofollow=\r\n&quot; target=3D&quot;_blank&quot; href=3D&quot;http://mc/compose?to=3Dapril@abercrombieghostre=\r\nsearch.com&quot;&gt;april@abercrombiegh ostresearch. com&lt;/a&gt;&gt;&lt;/span&gt; wrote:&lt;br&gt;\n=\r\n&lt;/div&gt;&lt;/div&gt;\n&lt;blockquote class=3D&quot;gmail_quote&quot; style=3D&quot;border-left: 1px so=\r\nlid rgb(204, 204, 204);&quot;&gt;\n&lt;div style=3D&quot;background-color: rgb(255, 255, 255=\r\n);&quot;&gt;\n&lt;div&gt;\n&lt;div&gt;\n&lt;div&gt;\n&lt;div&gt;\n&lt;div&gt;&lt;/div&gt;\n&lt;div class=3D&quot;h5&quot;&gt;&lt;br&gt;&lt;br&gt;\n&lt;p&gt;&lt;/p&gt;=\r\n\n&lt;div&gt;&lt;font face=3D&quot;Myriad Pro&quot; size=3D&quot;2&quot;&gt;You will never be able to prove =\r\nyour methods scientifically, so why even try to argue with them? Even if yo=\r\nu were able to, they probably still wouldn&#39;t believe it.&lt;/font&gt;&lt;/div&gt;\n&lt;div&gt;=\r\n&lt;font face=3D&quot;Myriad Pro&quot; size=3D&quot;2&quot;&gt;&lt;/font&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&lt;font face=3D=\r\n&quot;Myriad Pro&quot; size=3D&quot;2&quot;&gt;IMO, who cares? All that matters is that you are ge=\r\ntting something out of it. Besides, maybe it isn&#39;t meant to be understood b=\r\ny certain people. I have always held the opinion that we will never scienti=\r\nfically prove anything we do in the paranormal field, and I think that is n=\r\no accident. I think some people will never get anything out of it, while ot=\r\nhers will excel in their knowledge, but it will be all very personal.&lt;/font=\r\n&gt;&lt;/div&gt;\n\n&lt;div&gt;&lt;font face=3D&quot;Myriad Pro&quot; size=3D&quot;2&quot;&gt;&lt;/font&gt;&nbsp;&lt;/div&gt;\n&lt;div=\r\n&gt;&lt;font face=3D&quot;Myriad Pro&quot; size=3D&quot;2&quot;&gt;It&#39;s all about what constitutes enoug=\r\nh&nbsp;proof for you personally. You have to go with your gut on what is tr=\r\nue spirit communication, and what isn&#39;t. If no one ever agrees with you, so=\r\n what?&lt;/font&gt;&lt;/div&gt;\n\n&lt;div&gt;&lt;font face=3D&quot;Myriad Pro&quot; size=3D&quot;2&quot;&gt;&lt;/font&gt;&nbsp=\r\n;&lt;/div&gt;\n&lt;div&gt;&lt;font face=3D&quot;Myriad Pro&quot; size=3D&quot;2&quot;&gt;April&lt;/font&gt;&lt;/div&gt;&lt;/div&gt;&lt;=\r\n/div&gt;\n&lt;div&gt;\n&lt;div&gt;&lt;/div&gt;\n&lt;div&gt;\n&lt;div&gt;&lt;font face=3D&quot;Myriad Pro&quot; size=3D&quot;2&quot;&gt;&lt;/f=\r\nont&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;----- Original Message ----- &lt;/div&gt;\n&lt;blockquote dir=\r\n=3D&quot;ltr&quot; style=3D&quot;border-left: 2px solid rgb(0, 0, 0);&quot;&gt;\n&lt;div&gt;\n&lt;div&gt;&lt;/div&gt;\n=\r\n&lt;div class=3D&quot;h5&quot;&gt;\n&lt;div style=3D&quot;font-weight: normal; font-size: 10pt; font=\r\n-style: normal; font-family: arial; font-variant: normal; font-size-adjust:=\r\n none;&quot;&gt;&lt;b&gt;From:&lt;/b&gt; &lt;a rel=3D&quot;nofollow&quot; title=3D&quot;purplealiengirl@...=\r\n&quot; target=3D&quot;_blank&quot; href=3D&quot;http://mc/compose?to=3Dpurplealiengirl@...=\r\nm&quot;&gt;Frank Sumption&lt;/a&gt; &lt;/div&gt;\n\n&lt;div style=3D&quot;font-weight: normal; font-size:=\r\n 10pt; font-style: normal; font-family: arial; font-variant: normal; font-s=\r\nize-adjust: none;&quot;&gt;&lt;b&gt;To:&lt;/b&gt; &lt;a rel=3D&quot;nofollow&quot; title=3D&quot;EVP-ITC@yahoogro=\r\nups.com&quot; target=3D&quot;_blank&quot; href=3D&quot;http://mc/compose?to=3DEVP-ITC@yahoogrou=\r\nps.com&quot;&gt;EVP-ITC@yahoogroups .com&lt;/a&gt; &lt;/div&gt;\n\n&lt;div style=3D&quot;font-weight: nor=\r\nmal; font-size: 10pt; font-style: normal; font-family: arial; font-variant:=\r\n normal; font-size-adjust: none;&quot;&gt;&lt;b&gt;Sent:&lt;/b&gt; Monday, May 04, 2009 9:07 AM=\r\n&lt;/div&gt;\n&lt;div style=3D&quot;font-weight: normal; font-size: 10pt; font-style: norm=\r\nal; font-family: arial; font-variant: normal; font-size-adjust: none;&quot;&gt;&lt;b&gt;S=\r\nubject:&lt;/b&gt; Re: [EVP-ITC] Re: People given a grant to do what you all are d=\r\noing,&lt;/div&gt;\n\n&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;\n&lt;div&gt;\n&lt;div&gt;\n&lt;div&gt;&lt;/div&gt;\n&lt;div class=\r\n=3D&quot;h5&quot;&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;div&gt;&nbsp;I was just sayin&#39;!&nbsp; So why would anyone in=\r\n this field completely ignore methods that work, irregardless of whether sc=\r\nience accpts it? That&#39;s the thing, say anything and I&#39;m the one being negat=\r\nive. Question these other experts and I&#39;m being negative--on and on. &lt;/div&gt;=\r\n\n\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;Same old story--don&#39;t accept the evidence, d=\r\non&#39;t accept that that someone-like me-does in fact at least understand what=\r\n conditions to create to make these communications possible. Yet y&#39;all wond=\r\ner why I have a case of the ass all the time. All the pompus self proclaime=\r\nd egotisical little dweebs out there chasing the damn fame and fortune--not=\r\n facts.&lt;/div&gt;\n\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;I have gotten so much friggn&#39;&n=\r\nbsp;voices that can&#39;t be explained as anything but spirits/entity communica=\r\ntion- -not good enough! &lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;You hear that c=\r\nrap(any proof...)&nbsp;from every scientist/debunker- -well if the evidence=\r\n was there we&#39;d be the first to celibrate it-yeah right, rihgt after they b=\r\nurned, burried, and debunked it. There is more than enough evidence--all of=\r\n it is ignored.&nbsp;&nbsp;&lt;/div&gt;\n\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;The stuff i=\r\ns simple-provide something for the enitities to make their voices out of an=\r\nd they will speak, no friggin&#39; mystery, no magic, no secret tecnology, no h=\r\nigh priest(ess) needed. &lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;Frank-S&lt;/div&gt;\n&lt;=\r\ndiv&gt;&lt;br&gt;&nbsp;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;\n&lt;div class=3D&quot;gmail_quote&quot;&gt;\n&lt;div&gt;\n&lt;div&gt;&lt;/d=\r\niv&gt;\n&lt;div class=3D&quot;h5&quot;&gt;On Sun, May 3, 2009 at 7:56 PM, itcdeadpeople &lt;span d=\r\nir=3D&quot;ltr&quot;&gt;&lt;&lt;a rel=3D&quot;nofollow&quot; target=3D&quot;_blank&quot; href=3D&quot;http://mc/comp=\r\nose?to=3DITCdeadpeople@...&quot;&gt;ITCdeadpeople@ aol.com&lt;/a&gt;&gt;&lt;/span&gt; wrote=\r\n:&lt;br&gt;&lt;/div&gt;\n&lt;/div&gt;\n&lt;blockquote class=3D&quot;gmail_quote&quot; style=3D&quot;border-left: =\r\n1px solid rgb(204, 204, 204);&quot;&gt;\n&lt;div style=3D&quot;background-color: rgb(255, 25=\r\n5, 255);&quot;&gt;\n&lt;div&gt;\n&lt;div&gt;\n&lt;div&gt;\n&lt;div&gt;\n&lt;div&gt;&lt;/div&gt;\n&lt;div class=3D&quot;h5&quot;&gt;&lt;br&gt;&lt;br&gt;\n&lt;=\r\np&gt;Frank, I think you misunderstood or misread something somewhere. The AAEV=\r\nP/Sarah Estep Research Fund is not for AAEVP to do the research, it&#39;s for t=\r\nhem to fund OUTSIDE organizations for THEIR scientific research on the stud=\r\ny of EVP. The Windbridge Institute received some of this sponsor money for =\r\nwhat they called &quot;Real-time EVP Conversations: A Pilot Study.&quot; The method f=\r\nor this communication was *not* based on radio sweep, nor traditional metho=\r\nds, so it&#39;s not based on what I assume many people here are doing. And in f=\r\nact, it *was* based on the creations of someone outside of the USA, so I&#39;m =\r\na little confused as to why all the hostility toward AAEVP for putting up t=\r\nhe money.&lt;br&gt;\n&lt;br&gt;Sadly, radio sweep methods don&#39;t, and may not for a long =\r\ntime, get the respect of the scientific community that it deserves (then ag=\r\nain, seems no form of EVP does), but at least this current research is a st=\r\nep in the right direction. I hope, when Windbridge concludes their study, t=\r\nhat it will support the notion that there is apparent communication formed =\r\nin ways that cannot be explained by currently known and understood laws of =\r\nnature. THAT alone, in my opinion, would be a big plus for all ITC communit=\r\nies, regardless of the method from which that communication was received. W=\r\nhat&#39;s the old saying? &quot;It takes but one white crow to prove all crows are n=\r\not black.&quot; Any proof, derived from any EVP method, would be greatly welcome=\r\nd as far as I&#39;m concerned.&lt;br&gt;\n&lt;br&gt;Margaret &lt;/p&gt;\n&lt;div&gt;&lt;br&gt;&lt;br&gt;--- In &lt;a rel=\r\n=3D&quot;nofollow&quot; target=3D&quot;_blank&quot; href=3D&quot;http://mc/compose?to=3DEVP-ITC%40ya=\r\nhoogroups.com&quot;&gt;EVP-ITC@yahoogroups .com&lt;/a&gt;, Frank Sumption &lt;purplealien=\r\ngirl@ ...&gt; wrote:&lt;br&gt;&gt;&lt;br&gt;&gt; It&#39;s the same old stuff, everyone want=\r\ns to completely ignore absolutely all&lt;br&gt;\n&gt; work that has been in this f=\r\nield since the caveman and act like they just&lt;br&gt;&gt; discovered spirit and=\r\n EVP. Completely ignore all the work in this country&lt;br&gt;&gt; and in Europe,=\r\n and if anyone says anything, oh well, you&#39;re just being&lt;br&gt;\n&gt; negative!=\r\n Why everyone knows there no EVP/ITC research outside AAEVP!&lt;br&gt;&gt; &lt;br&gt;&g=\r\nt; Frank-S&lt;br&gt;&gt; &lt;br&gt;&lt;/div&gt;&gt; On Sun, May 3, 2009 at 4:41 PM, Frank Sum=\r\nption &lt;purplealiengirl@ ...&gt;wrote: \n&lt;div&gt;&lt;br&gt;&gt; &lt;br&gt;&gt; &gt; Yeah,=\r\n it&#39;s not what you know....&lt;br&gt;&gt; &gt;&lt;br&gt;&gt; &gt; F-S&lt;br&gt;&gt; &gt;&lt;br&gt;&lt;=\r\n/div&gt;\n&lt;div&gt;&gt; &gt; On Sun, May 3, 2009 at 8:35 AM, &lt;SnowfireL@.. .&gt;=\r\n wrote:&lt;br&gt;&gt; &gt;&lt;br&gt;&gt; &gt;&gt;&lt;br&gt;&gt; &gt;&gt;&lt;br&gt;&gt; &gt;&gt; The=\r\ny were given a grant to do what you all are doing,&lt;br&gt;&gt; &gt;&gt;&lt;br&gt;&gt;=\r\n &gt;&gt;&lt;br&gt;\n&gt; &gt;&gt; &lt;a rel=3D&quot;nofollow&quot; target=3D&quot;_blank&quot; href=3D&quot;h=\r\nttp://www.aaevp.com/research.htm&quot;&gt;http://www.aaevp. com/research. htm&lt;/a&gt;&lt;b=\r\nr&gt;&gt; &gt;&gt;&lt;br&gt;&gt; &gt;&gt; ------------ --------- ---------&lt;br&gt;&lt;/div&gt;=\r\n&lt;/div&gt;&lt;/div&gt;\n&lt;div class=3D&quot;im&quot;&gt;&gt; &gt;&gt; *The Average US Credit Score i=\r\ns 692. See Yours in Just 2 Easy Steps!&lt;&lt;a rel=3D&quot;nofollow&quot; target=3D&quot;_bl=\r\nank&quot; href=3D&quot;http://pr.atwola.com/promoclk/100126575x1222376998x1201454298/=\r\naol?redir=3Dhttp://www.freecreditreport.com/pm/default.aspx?sc=3D668072&amp=\r\n;hmpgID=3D62&amp;bcd=3DMay5309AvgfooterNO62&quot;&gt;http://pr.atwola. com/promoclk=\r\n/ 100126575x122237 6998x1201454298/ aol?redir=3D http://www. freecreditrepo=\r\nrt .com/pm/default. aspx?sc=3D668072&amp;hmpgID=3D62&amp;bcd=3DMay5309Avgfo=\r\note rNO62&lt;/a&gt;&gt;&lt;br&gt;\n&gt; &gt;&gt; *&lt;br&gt;&gt; &gt;&gt;&lt;br&gt;&gt; &gt;&gt; &lt;br=\r\n&gt;&gt; &gt;&gt;&lt;br&gt;&gt; &gt;&lt;br&gt;&gt; &gt;&lt;br&gt;&gt;&lt;br&gt;&lt;br&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;p=\r\n&gt;&lt;/p&gt;\n&lt;p&gt;&lt;/p&gt;&lt;/div&gt;&lt;/div&gt;\n&lt;div style=3D&quot;color: white;&quot;&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/=\r\ndiv&gt;&lt;/blockquote&gt;&lt;/div&gt;&lt;br&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;p&gt;&lt;/p&gt;&lt;/div&gt;&lt;/blockquote&gt;&lt;/div&gt;&lt;/div&gt;\n=\r\n&lt;p&gt;&lt;/p&gt;&lt;/div&gt;\n&lt;div style=3D&quot;color: white;&quot;&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/blockq=\r\nuote&gt;&lt;/div&gt;&lt;br&gt;&lt;/div&gt;&lt;/div&gt;&lt;/blockquote&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/tbody&gt;&lt;/table&gt;&lt;br&gt;&lt;/p&gt;&lt;=\r\n/div&gt;\n&lt;div style=3D&quot;color: white;&quot;&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/blockquote&gt;&lt;/d=\r\niv&gt;&lt;br&gt;\n\n \n\n    &lt;/div&gt;  \n\n\n\t \n\t\n\t&lt;/div&gt;&lt;/blockquote&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n=\r\n\n\n\n      \r\n--0-1036554853-1241466987=:47464--"}