{"id": "14070", "subject": "Re: [EVP-ITC] Re: People given a grant to do what you all are doing,", "author": "SnowfireL@aol.com", "timestamp": "2009-05-05T00:44:58Z", "full_text": "-------------------------------1241484298\r\nContent-Type: text/plain; charset=&quot;US-ASCII&quot;\r\nContent-Transfer-Encoding: 7bit\r\n\r\nYeah, but they are not &quot;dead&quot; it&#39;s so called death, that is why it is said  \nto &quot;test the spirit&#39;s&quot; one doesn&#39;t just go, and believe them to be who they \nsay  they are, they could be from lower planes, but maybe I was wrong, \nmaybe I have  the wrong person, I don&#39;t know how I came to believe you as the \ninventor of &quot;the  boxes&quot;, sorry Frank, I will not bother you with this again.  \nMaybe  Edison was helping someone else, some how I thought it was you. sf\n \n \nIn a message dated 5/4/2009 7:18:30 P.M. Eastern Daylight Time,  \npurplealiengirl@... writes:\n\n \n \n\n\nActually--- I do make the boxes, but I think it would be very  unwise to go \naround with micro box plugged into one&#39;s ear so you can talk  to dead \nrealtives all the time. The purpose of E VP is mostly to show  life goes on, but \nyou also have to live this life! Besides, I don&#39;t know  of any way to filter \nout what comes through, you could get anyone/anything  pretending to be a \nrelative and lead you down a dark path. \n \n Not only that, you are not this body, you are not this ego, you are  not \nthis personality-Not only that, you are not this body, you are not this ego, \nyou are  not this personality-&lt;WBR&gt;-in reality. Everyone of is \nsomeone/something\n \n I already had someone send me a bunch of CDs claiming all this was  \npredicted years ago. I sent the stuff back. I don&#39;t care what was  predicted, cuz \nmost of that stuff comes from someplace that usually  doesn&#39;t have your best \ninterests in mind. What a victory for Satan  if he can trick many into \nabandoning their life&#39;s path/lesson in favor of  listening to the dearly \ndeparted! I&#39;m not religous, but there is that  level out there. \n \n and no, I never had Edison, or anyone else from the otherside show  me how \nto make anything! That&#39;s someone else&#39;s claim--not mine!\n \n Frank-S\n\n\nOn Mon, May 4, 2009 at 4:15 PM, Frank Sumption &lt;_purplealiengirl@purpleali_ \n(mailto:purplealiengirl@...) &gt;  wrote:\n\n\n \n \n[_Attachment(s)_ \n(http://mail.google.com/mail/?ui=2&view=js&name=js&ver=Xz0jXTrYL5Y.en.&am=b7EopeS3cCELDX3i1_Q2QtsRAJsRTGs#1210db29152e2ecd_TopText)   \nfrom Frank Sumption included below] \n\nHmmmm, must not be me, I never worked with an Edison--dead or  alive. I \ndon&#39;t believe in patents either.  It&#39;s a radio, already been  invented--by \nTesla! All I do is sweep the tuning.  Tesla got ETs  too!\n \n Frank-S\n\n\nOn Mon, May 4, 2009 at 3:37 PM, &lt;_SnowfireL@..._ \n(mailto:SnowfireL@...) &gt; wrote:\n\n\n \n \n\n\nHi Frank,\nIt was spirit that told us in 68 that you would build us a  &quot;box,&quot; a watch \nlike thing in order to talk with our loved ones.&quot;   &lt;g&gt;  I will pay you for \none if you want, I would love to speak  with my loved ones over there if you \ndon&#39;t mind.  Are you not the  inventor of the &quot;Frank&#39;s Box&quot;?  If so, You \nneed to get a paten going  ASAP, I am not sure who has done what around this \nstuff but, they told us  it would be a Frank working with Mr  T. A. Edison \nthat would be the  inventor, is this not you?  If not, I apologize, since I am \nnew here,  I know there is one other man who has since crossed over, he \nworked  closely with Mr Edison as well.  What you folks might do is to get  \ntogether, create a group sharing paten on your inventions, with all the  people \nthat are doing the testing&#39;s. you would all need to see a lawyer  probably \nto have one drawn up.  This way someone cannot come and  steal your hard \nwork, because when this is perfected, it going to be a big  deal.  It will have \nsomething to do with a &quot;cell.&quot;  I am a  Christian Spiritualist, and I look \nforward to having one of these,  everyone will be once you guys do the work, \ndon&#39;t allow some other group  to steal your hard work away. Just a thought, \nsf\n \n \n \nIn a message dated 5/4/2009 12:29:44 P.M. Eastern Daylight Time, \n_purplealiengirl@purpleali_ (mailto:purplealiengirl@...)  writes:\n\n\n \n \n\n\n\nIt&#39;s not that it can&#39;t be proven, it&#39;s that all evidence is  deemed \nunacceptable-It&#39;s not that it can&#39;t be proven, it&#39;s that all evidence is  The fact \nis  most of the EVP evidence pretty much  contradicts, or at least throws a \nmonkey wrench in many so called  scientific theories, and accepted dogma. \nEven spiritualists don&#39;t accept  that there&#39;s a technology for spirit \ncommunication, who needs a  medium when you&#39;ve got box?\n \n To me, it seems science has done little over the last 500  years except \nproclaim themsles the worlds only experts and source of all  knowledge. All \ntechnological advancement is made by people trying an  idea to see what works, \nand running with it, not waiting for peer review  BS to tell her it doesn&#39;t \nwork. Science is a bunch of fat old men  sitting around a fire place in \nover stuffed chairs telling each other  how smart they are! They don&#39;t want \nanyone pissing on the fire!\n \n Frank-S\n\n\n\n\n \n\nOn Mon, May 4, 2009 at 9:20 AM, April Abercrombie \n&lt;_april@abercrombieghapril@abercrapr_ (mailto:april@...) &gt;  wrote:\n\n\n\n\n \n \n\n\n\n\n \nYou will never be able to prove  your methods scientifically, so why even \ntry to argue with them? Even  if you were able to, they probably still \nwouldn&#39;t believe  it.\n \nIMO, who cares? All that matters  is that you are getting something out of \nit. Besides, maybe it isn&#39;t  meant to be understood by certain people. I \nhave always held the  opinion that we will never scientifically prove anything \nwe do in the  paranormal field, and I think that is no accident. I think \nsome people  will never get anything out of it, while others will excel in \ntheir  knowledge, but it will be all very personal.\n \nIt&#39;s all about what constitutes  enough proof for you personally. You have \nto go with your gut on  what is true spirit communication, and what isn&#39;t. \nIf no one ever  agrees with you, so what?\n \nApril\n\n\n \n\n \n\n----- Original Message ----- \n\n \n\n \nFrom: _Frank  Sumption_ (mailto:purplealiengirl@...)  \nTo: _EVP-ITC@yahoogroupsEVP-_ (mailto:EVP-ITC@yahoogroups.com)  \nSent: Monday, May 04, 2009 9:07  AM\nSubject: Re: [EVP-ITC] Re:  People given a grant to do what you all are \ndoing,\n\n\n\n\n\n \n\n \nI was just sayin&#39;!  So why would anyone in this  field completely ignore \nmethods that work, irregardless of whether  science accpts it? That&#39;s the \nthing, say anything and I&#39;m the one  being negative. Question these other \nexperts and I&#39;m being  negative--on and on. \n \n Same old story--don&#39;t accept the evidence, don&#39;t accept  that that \nsomeone-like me-does in fact at least understand what  conditions to create to make \nthese communications possible. Yet  y&#39;all wonder why I have a case of the \nass all the time. All the  pompus self proclaimed egotisical little dweebs \nout there chasing  the damn fame and fortune--not facts.\n \n I have gotten so much friggn&#39; voices that can&#39;t be  explained as anything \nbut spirits/entity communication-voices that can&#39;t be  \n\nYou hear that crap(any proof...) from every  scientist/debunker-from every  \nscientist/debunker-&lt;WBR&gt;-well if the evidence was there we&#39;d be the  first \nto celibrate it-yeah right, rihgt after they burned, burried,  and debunked \nit. There is more than eno  \n \n The stuff is simple-provide something for the enitities  to make their \nvoices out of and they will speak, no friggin&#39;  mystery, no magic, no secret \ntecnology, no high priest(ess) needed.  \n\nFrank-S\n\n\n\n\n\n \n\nOn Sun, May 3, 2009 at 7:56 PM, itcdeadpeople &lt;_ITCdeadpeople@ITCdead_ \n(mailto:ITCdeadpeople@...) &gt;  wrote:\n\n\n\n\n \n \n\n\n\n\nFrank, I think you misunderstood or misread something  somewhere. The \nAAEVP/Sarah Estep Research Fund is not for AAEVP to  do the research, it&#39;s for \nthem to fund OUTSIDE organizations for  THEIR scientific research on the study \nof EVP. The Windbridge  Institute received some of this sponsor money for \nwhat they called  &quot;Real-time EVP Conversations: A Pilot Study.&quot; The method \nfor this  communication was *not* based on radio sweep, nor traditional  \nmethods, so it&#39;s not based on what I assume many people here are  doing. And in \nfact, it *was* based on the creations of someone  outside of the USA, so I&#39;m \na little confused as to why all the  hostility toward AAEVP for putting up \nthe money.\n\nSadly,  radio sweep methods don&#39;t, and may not for a long time, get the  \nrespect of the scientific community that it deserves (then again,  seems no \nform of EVP does), but at least this current research is  a step in the right \ndirection. I hope, when Windbridge concludes  their study, that it will \nsupport the notion that there is  apparent communication formed in ways that \ncannot be explained by  currently known and understood laws of nature. THAT \nalone, in my  opinion, would be a big plus for all ITC communities, regardless  \nof the method from which that communication was received. What&#39;s  the old \nsaying? &quot;It takes but one white crow to prove all crows  are not black.&quot; Any \nproof, derived from any EVP method, would be  greatly welcomed as far as I&#39;m \nconcerned.\n\nMargaret  \n\n\n--- In _EVP-ITC@yahoogroupsEVP-_ (mailto:EVP-ITC@yahoogroups.com) , Frank \nSumption  &lt;purplealiengirl@pur&gt; wrote:\n&gt;\n&gt; It&#39;s the  same old stuff, everyone wants to completely ignore absolutely  \nall\n&gt; work that has been in this field since the caveman and  act like they just\n&gt; discovered spirit and EVP. Completely  ignore all the work in this country\n&gt; and in Europe, and if  anyone says anything, oh well, you&#39;re just being\n&gt; negative!  Why everyone knows there no EVP/ITC research outside  AAEVP!\n&gt; \n&gt; Frank-S\n&gt; \n\n&gt; On Sun, May  3, 2009 at 4:41 PM, Frank Sumption  \n&lt;purplealiengirl@pur&gt;wrote:  \n\n&gt; \n&gt; &gt; Yeah, it&#39;s not what you  know....\n&gt; &gt;\n&gt; &gt; F-S\n&gt; &gt;\n\n&gt; &gt; On Sun, May 3, 2009 at 8:35 AM,  &lt;SnowfireL@..S&gt; wrote:\n&gt; &gt;\n&gt;  &gt;&gt;\n&gt; &gt;&gt;\n&gt; &gt;&gt; They were given a grant  to do what you all are doing,\n&gt; &gt;&gt;\n&gt;  &gt;&gt;\n&gt; &gt;&gt; _http://www.aaevp.http://www.aahtt_ \n(http://www.aaevp.com/research.htm) \n&gt;  &gt;&gt;\n&gt; &gt;&gt;  ------------   \n\n\n\n&gt;  &gt;&gt; *The Average US Credit Score is 692. See Yours in Just 2  Easy \nSteps!&lt;_http://pr.atwola.http://pr.atwhttp://pr.atwolahttp://pr.atwolahttp://pr.htt\np://pr.ahttp://pr.atwolahttp://pr.atwolahttp://pr.atwo&hmpgID=62&bcd=May5309\nAvgfootebcd=M_ \n(http://pr.atwola.com/promoclk/100126575x1222376998x1201454298/aol?redir=http://www.freecreditreport.com/pm/default.aspx?sc=668072&hmpgID\n=62&bcd=May5309AvgfooterNO62) &gt;\n&gt;  &gt;&gt; *\n&gt; &gt;&gt;\n&gt; &gt;&gt; \n&gt;  &gt;&gt;\n&gt; &gt;\n&gt; &gt;\n&gt;\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n____________________________________\n2009 3 Free CREDIT SCORES: _See Your 3 Credit Scores from All 3 Bureaus  \nFREE!_ \n(http://pr.atwola.com/promoclk/100126575x1221797372x1201397989/aol?redir=https://www.freescore.com/Offers/Start/FreeCreditReportAndScore.aspx?ID=918\n31F371F138345B53A153F49D4D872&siteid=e927580bf7)   \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n**************2009 3 Free CREDIT SCORES: See Your 3 Credit Scores from All \n3 Bureaus FREE! \n(http://pr.atwola.com/promoclk/100126575x1221797372x1201397989/aol?redir=https:%2F%2Fwww.freescore.com%2FOffers%2FStart%2FFreeCreditRepor\ntAndScore.aspx%3FID%3D91831F371F138345B53A153F49D4D872%26siteid%3De927580bf7\n)\n\r\n-------------------------------1241484298\r\nContent-Type: text/html; charset=&quot;US-ASCII&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML 4.0 Transitional//EN&quot;&gt;\n&lt;HTML&gt;&lt;HEAD&gt;=\r\n\n&lt;META http-equiv=3DContent-Type content=3D&quot;text/html; charset=3DUS-ASCII&quot;&gt;=\r\n\n&lt;META content=3D&quot;MSHTML 6.00.6000.16825&quot; name=3DGENERATOR&gt;&lt;/HEAD&gt;\n&lt;BODY id=\r\n=3Drole_body style=3D&quot;FONT-SIZE: 10pt; COLOR: #000000; FONT-FAMILY: Arial&quot; =\r\n\nbottomMargin=3D7 leftMargin=3D7 topMargin=3D7 rightMargin=3D7&gt;&lt;FONT id=3Dr=\r\nole_document \nface=3DArial color=3D#000000 size=3D2&gt;\n&lt;DIV&gt;Yeah, but they ar=\r\ne not &quot;dead&quot; it&#39;s so called death, that is why it is said \nto &quot;test the spi=\r\nrit&#39;s&quot; one doesn&#39;t just go, and believe them to be who they say \nthey are, =\r\nthey could be from lower planes, but maybe I was wrong, maybe I have \nthe w=\r\nrong person, I don&#39;t know how I came to believe you as the inventor of &quot;the=\r\n \nboxes&quot;, sorry Frank, I will not bother you with this&nbsp;again.&nbsp; Ma=\r\nybe \nEdison was helping someone else, some how I thought it was you.&nbsp;s=\r\nf&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;In a message dated 5/4/2009 7:18:30 P.=\r\nM. Eastern Daylight Time, \npurplealiengirl@... writes:&lt;/DIV&gt;\n&lt;BLOCKQU=\r\nOTE \nstyle=3D&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: blue 2px so=\r\nlid&quot;&gt;&lt;FONT \n  style=3D&quot;BACKGROUND-COLOR: transparent&quot; face=3DArial color=3D=\r\n#000000 size=3D2&gt;\n  &lt;DIV id=3Dygrp-mlmsg style=3D&quot;WIDTH: 655px; POSITION: r=\r\nelative&quot;&gt;\n  &lt;DIV id=3Dygrp-msg \n  style=3D&quot;PADDING-RIGHT: 25px; PADDING-LEF=\r\nT: 0px; Z-INDEX: 1; FLOAT: left; PADDING-BOTTOM: 0px; MARGIN: 0px; WIDTH: 4=\r\n70px; PADDING-TOP: 0px&quot;&gt;\n  &lt;DIV id=3Dygrp-text&gt;&lt;BR&gt;&lt;BR&gt;\n  &lt;P&gt;\n  &lt;DIV&gt;&nbsp;=\r\nActually--- I do make the boxes, but I think it would be very \n  unwise to =\r\ngo around with micro&nbsp;box plugged into one&#39;s ear so you can talk \n  to =\r\ndead realtives all the time.&nbsp;The purpose of E VP is mostly to show \n  =\r\nlife goes on, but you also have to live this life! Besides,&nbsp;I don&#39;t kn=\r\now \n  of any way to filter out what comes through, you could get anyone/any=\r\nthing \n  pretending to be a relative and lead you down a dark path. &lt;/DIV&gt;\n=\r\n  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n  &lt;DIV&gt;&nbsp;Not only that, you are not this body, you =\r\nare not this ego, you are \n  not this personality-&lt;WBR&gt;-in reality. Everyon=\r\ne of is someone/something else, \n  and I wouldn&#39;t want anyone making me sta=\r\ny in this form for their own \n  insecurities. &lt;/DIV&gt;\n  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n  =\r\n&lt;DIV&gt;&nbsp;I already had someone send me a bunch of CDs claiming all this w=\r\nas \n  predicted years ago.&nbsp;I sent the stuff back.&nbsp;I don&#39;t care wh=\r\nat was \n  predicted,&nbsp;cuz most of that stuff comes from someplace that =\r\nusually \n  doesn&#39;t have your best interests in mind.&nbsp;What a victory fo=\r\nr Satan \n  if&nbsp;he can trick many into abandoning their life&#39;s path/less=\r\non in favor of \n  listening to the dearly departed!&nbsp;I&#39;m not religous, =\r\nbut there is that \n  level out there. &lt;/DIV&gt;\n  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n  &lt;DIV&gt;&nb=\r\nsp;and no, I never had Edison, or anyone else from the otherside show \n  me=\r\n how to make anything! That&#39;s someone else&#39;s claim--not mine!&lt;/DIV&gt;\n  &lt;DIV&gt;=\r\n&nbsp;&lt;/DIV&gt;\n  &lt;DIV&gt;&nbsp;Frank-S&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;\n  &lt;DIV class=3Dgmail_quote&gt;=\r\nOn Mon, May 4, 2009 at 4:15 PM, Frank Sumption &lt;SPAN \n  dir=3Dltr&gt;&lt;&lt;A ti=\r\ntle=3Dmailto:purplealiengirl@... \n  href=3D&quot;mailto:purplealiengirl@gm=\r\nail.com&quot;&gt;purplealiengirl@&lt;WBR&gt;gmail.com&lt;/A&gt;&gt;&lt;/SPAN&gt; \n  wrote:&lt;BR&gt;\n  &lt;BLO=\r\nCKQUOTE class=3Dgmail_quote style=3D&quot;BORDER-LEFT: #ccc 1px solid&quot;&gt;\n    &lt;DIV=\r\n style=3D&quot;BACKGROUND-COLOR: #ffffff&quot;&gt;\n    &lt;DIV&gt;\n    &lt;DIV&gt;\n    &lt;DIV&gt;&lt;SPAN st=\r\nyle=3D&quot;FONT-WEIGHT: bold; FONT-SIZE: 12px&quot;&gt;[&lt;A \n    title=3Dhttp://mail.goo=\r\ngle.com/mail/?ui=3D2&amp;view=3Djs&amp;name=3Djs&amp;ver=3DXz0jXTrYL5Y.en.&=\r\namp;am=3Db7EopeS3cCELDX3i1_Q2QtsRAJsRTGs#1210db29152e2ecd_TopText \n    styl=\r\ne=3D&quot;TEXT-DECORATION: none&quot; \n    href=3D&quot;http://mail.google.com/mail/?ui=3D=\r\n2&amp;view=3Djs&amp;name=3Djs&amp;ver=3DXz0jXTrYL5Y.en.&amp;am=3Db7EopeS3cC=\r\nELDX3i1_Q2QtsRAJsRTGs#1210db29152e2ecd_TopText&quot;&gt;Attachment(s)&lt;/A&gt; \n    from=\r\n Frank Sumption included below]&lt;/SPAN&gt; &lt;BR&gt;&lt;BR&gt;\n    &lt;P&gt;\n    &lt;DIV&gt;&nbsp;Hmmm=\r\nm, must not be me, I never worked with an Edison--dead or \n    alive. I don=\r\n&#39;t believe in patents either.&nbsp; It&#39;s a radio, already been \n    invente=\r\nd--by Tesla! All I do is sweep the tuning.&nbsp; Tesla got ETs \n    too!&lt;/D=\r\nIV&gt;\n    &lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n    &lt;DIV&gt;&nbsp;Frank-S&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;\n    &lt;DIV cla=\r\nss=3Dgmail_quote&gt;On Mon, May 4, 2009 at 3:37 PM, &lt;SPAN dir=3Dltr&gt;&lt;&lt;A \n  =\r\n  title=3Dmailto:SnowfireL@... href=3D&quot;mailto:SnowfireL@...&quot; \n    t=\r\narget=3D_blank&gt;SnowfireL@aol.&lt;WBR&gt;com&lt;/A&gt;&gt;&lt;/SPAN&gt; wrote:&lt;BR&gt;\n    &lt;BLOCKQ=\r\nUOTE class=3Dgmail_quote style=3D&quot;BORDER-LEFT: #ccc 1px solid&quot;&gt;\n      &lt;DIV =\r\nstyle=3D&quot;BACKGROUND-COLOR: #ffffff&quot;&gt;\n      &lt;DIV&gt;\n      &lt;DIV&gt;\n      &lt;DIV&gt;&lt;BR=\r\n&gt;&lt;BR&gt;\n      &lt;P&gt;&lt;FONT face=3DArial color=3D#000000 size=3D2&gt;\n      &lt;DIV&gt;&lt;STR=\r\nONG&gt;Hi Frank,&lt;/STRONG&gt;&lt;/DIV&gt;\n      &lt;DIV&gt;&lt;STRONG&gt;It was spirit that told us =\r\nin 68 that you would build us a \n      &quot;box,&quot; a watch like thing in order t=\r\no talk with our loved ones.&quot;&nbsp; \n      &lt;g&gt;&nbsp; I will pay you fo=\r\nr one if you want, I would love to speak \n      with my loved ones over the=\r\nre if you don&#39;t mind.&nbsp; Are you not the \n      inventor of the &quot;Frank&#39;s=\r\n Box&quot;?&nbsp; If so, You need to get a paten going \n      ASAP, I am not sur=\r\ne who has done what around this stuff but, they told us \n      it would be =\r\na Frank working with Mr&nbsp; T. A. Edison that would be the \n      invento=\r\nr, is this not you?&nbsp; If not, I apologize, since I am new here, \n      =\r\nI know there is one other man who has since crossed over, he worked \n      =\r\nclosely with Mr Edison as well.&nbsp; What you folks might do is to get \n  =\r\n    together, create a group sharing paten on your inventions, with all the=\r\n \n      people that are doing the testing&#39;s. you would all need to see a la=\r\nwyer \n      probably to have one drawn up.&nbsp; This way someone cannot co=\r\nme and \n      steal your hard work, because when this is perfected, it goin=\r\ng to be a big \n      deal.&nbsp; It will&nbsp;have something to do with a &quot;=\r\ncell.&quot;&nbsp; I am a \n      Christian Spiritualist, and I look forward to ha=\r\nving one of these, \n      everyone will be once you guys do the work, don&#39;t=\r\n allow some other group \n      to steal your hard work away. Just a thought=\r\n, sf&lt;/STRONG&gt;&lt;/DIV&gt;\n      &lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n      &lt;DIV&gt;\n      &lt;DIV&gt;\n      &lt;=\r\nDIV&gt;In a message dated 5/4/2009 12:29:44 P.M. Eastern Daylight Time, &lt;A \n  =\r\n    title=3Dmailto:purplealiengirl@... \n      href=3D&quot;mailto:purpleal=\r\niengirl@...&quot; \n      target=3D_blank&gt;purplealiengirl@&lt;WBR&gt;gmail.com&lt;/A=\r\n&gt; writes:&lt;/DIV&gt;&lt;/DIV&gt;\n      &lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: blue 2px soli=\r\nd&quot;&gt;&lt;FONT \n        style=3D&quot;BACKGROUND-COLOR: transparent&quot; face=3DArial colo=\r\nr=3D#000000 size=3D2&gt;\n        &lt;DIV&gt;\n        &lt;DIV&gt;\n        &lt;DIV&gt;&lt;BR&gt;&lt;BR&gt;\n   =\r\n     &lt;P&gt;\n        &lt;DIV&gt;\n        &lt;DIV&gt;&nbsp;It&#39;s not that it can&#39;t be proven,=\r\n it&#39;s that all evidence is \n        deemed unacceptable-&lt;WBR&gt;-a convinient =\r\nway to make uncompfortable facts \n        go away.&nbsp; The fact is&nbsp; =\r\nmost of the EVP evidence pretty much \n        contradicts, or at least thro=\r\nws a monkey wrench in many so called \n        scientific theories, and acce=\r\npted dogma. Even spiritualists don&#39;t accept \n        that there&#39;s a technol=\r\nogy&nbsp;for spirit communication, who needs a \n        medium when you&#39;ve =\r\ngot box?&lt;/DIV&gt;\n        &lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n        &lt;DIV&gt;&nbsp;To me, it seems=\r\n science has done little over the last 500 \n        years except proclaim t=\r\nhemsles the worlds only experts and source of all \n        knowledge. All t=\r\nechnological advancement is made by people trying an \n        idea to see w=\r\nhat works, and running with it, not waiting for peer review \n        BS to =\r\ntell her it doesn&#39;t work. Science is a bunch of fat old men \n        sittin=\r\ng around a fire place in over stuffed chairs telling each other \n        ho=\r\nw smart they are! They don&#39;t want anyone pissing on the fire!&lt;/DIV&gt;\n       =\r\n &lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n        &lt;DIV&gt;&nbsp;Frank-S&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n        &lt;=\r\nDIV class=3Dgmail_quote&gt;\n        &lt;DIV&gt;\n        &lt;DIV&gt;&lt;/DIV&gt;\n        &lt;DIV&gt;On =\r\nMon, May 4, 2009 at 9:20 AM, April Abercrombie &lt;SPAN \n        dir=3Dltr&gt;&lt=\r\n;&lt;A title=3Dmailto:april@... \n        href=3D&quot;mail=\r\nto:april@...&quot; \n        target=3D_blank&gt;april@aberc=\r\nrombiegh&lt;WBR&gt;ostresearch.&lt;WBR&gt;com&lt;/A&gt;&gt;&lt;/SPAN&gt; \n        wrote:&lt;BR&gt;&lt;/DIV&gt;&lt;=\r\n/DIV&gt;\n        &lt;BLOCKQUOTE class=3Dgmail_quote style=3D&quot;BORDER-LEFT: #ccc 1p=\r\nx solid&quot;&gt;\n          &lt;DIV style=3D&quot;BACKGROUND-COLOR: #ffffff&quot;&gt;\n          &lt;DI=\r\nV&gt;\n          &lt;DIV&gt;\n          &lt;DIV&gt;&lt;BR&gt;&lt;BR&gt;\n          &lt;P&gt;\n          &lt;DIV&gt;\n  =\r\n        &lt;DIV&gt;&lt;/DIV&gt;\n          &lt;DIV&gt;\n          &lt;DIV&gt;&lt;FONT face=3D&quot;Myriad Pro=\r\n&quot; size=3D2&gt;You will never be able to prove \n          your methods scientif=\r\nically, so why even try to argue with them? Even \n          if you were abl=\r\ne to, they probably still wouldn&#39;t believe \n          it.&lt;/FONT&gt;&lt;/DIV&gt;\n    =\r\n      &lt;DIV&gt;&lt;FONT face=3D&quot;Myriad Pro&quot; size=3D2&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n         =\r\n &lt;DIV&gt;&lt;FONT face=3D&quot;Myriad Pro&quot; size=3D2&gt;IMO, who cares? All that matters \n=\r\n          is that you are getting something out of it. Besides, maybe it is=\r\nn&#39;t \n          meant to be understood by certain people. I have always held=\r\n the \n          opinion that we will never scientifically prove anything we=\r\n do in the \n          paranormal field, and I think that is no accident. I =\r\nthink some people \n          will never get anything out of it, while other=\r\ns will excel in their \n          knowledge, but it will be all very persona=\r\nl.&lt;/FONT&gt;&lt;/DIV&gt;\n          &lt;DIV&gt;&lt;FONT face=3D&quot;Myriad Pro&quot; size=3D2&gt;&lt;/FONT&gt;&n=\r\nbsp;&lt;/DIV&gt;\n          &lt;DIV&gt;&lt;FONT face=3D&quot;Myriad Pro&quot; size=3D2&gt;It&#39;s all about=\r\n what constitutes \n          enough&nbsp;proof for you personally. You have=\r\n to go with your gut on \n          what is true spirit communication, and w=\r\nhat isn&#39;t. If no one ever \n          agrees with you, so what?&lt;/FONT&gt;&lt;/DIV&gt;=\r\n\n          &lt;DIV&gt;&lt;FONT face=3D&quot;Myriad Pro&quot; size=3D2&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n    =\r\n      &lt;DIV&gt;&lt;FONT face=3D&quot;Myriad Pro&quot; size=3D2&gt;April&lt;/FONT&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV=\r\n&gt;\n          &lt;DIV&gt;\n          &lt;DIV&gt;&lt;/DIV&gt;\n          &lt;DIV&gt;\n          &lt;DIV&gt;&lt;FON=\r\nT face=3D&quot;Myriad Pro&quot; size=3D2&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n          &lt;DIV&gt;----- Ori=\r\nginal Message ----- &lt;/DIV&gt;\n          &lt;BLOCKQUOTE dir=3Dltr style=3D&quot;BORDER-=\r\nLEFT: #000000 2px solid&quot;&gt;\n            &lt;DIV&gt;\n            &lt;DIV&gt;&lt;/DIV&gt;\n       =\r\n     &lt;DIV&gt;\n            &lt;DIV style=3D&quot;BACKGROUND: #e4e4e4; FONT: 10pt arial&quot;=\r\n&gt;&lt;B&gt;From:&lt;/B&gt; &lt;A \n            title=3Dmailto:purplealiengirl@... \n   =\r\n         href=3D&quot;mailto:purplealiengirl@...&quot; target=3D_blank&gt;Frank \n =\r\n           Sumption&lt;/A&gt; &lt;/DIV&gt;\n            &lt;DIV style=3D&quot;FONT: 10pt arial&quot;&gt;=\r\n&lt;B&gt;To:&lt;/B&gt; &lt;A \n            title=3Dmailto:EVP-ITC@yahoogroups.com \n        =\r\n    href=3D&quot;mailto:EVP-ITC@yahoogroups.com&quot; \n            target=3D_blank&gt;EV=\r\nP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt; &lt;/DIV&gt;\n            &lt;DIV style=3D&quot;FONT: 10pt =\r\narial&quot;&gt;&lt;B&gt;Sent:&lt;/B&gt; Monday, May 04, 2009 9:07 \n            AM&lt;/DIV&gt;\n       =\r\n     &lt;DIV style=3D&quot;FONT: 10pt arial&quot;&gt;&lt;B&gt;Subject:&lt;/B&gt; Re: [EVP-ITC] Re: \n   =\r\n         People given a grant to do what you all are doing,&lt;/DIV&gt;\n         =\r\n   &lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n            &lt;DIV&gt;\n            &lt;P&gt;\n          =\r\n  &lt;DIV&gt;\n            &lt;DIV&gt;&lt;/DIV&gt;\n            &lt;DIV&gt;\n            &lt;DIV&gt;&nbsp;I =\r\nwas just sayin&#39;!&nbsp; So why would anyone in this \n            field compl=\r\netely ignore methods that work, irregardless of whether \n            scienc=\r\ne accpts it? That&#39;s the thing, say anything and I&#39;m the one \n            be=\r\ning negative. Question these other experts and I&#39;m being \n            negat=\r\nive--on and on. &lt;/DIV&gt;\n            &lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n            &lt;DIV&gt;&nbsp=\r\n;Same old story--don&#39;t accept the evidence, don&#39;t accept \n            that =\r\nthat someone-like me-does in fact at least understand what \n            con=\r\nditions to create to make these communications possible. Yet \n            y=\r\n&#39;all wonder why I have a case of the ass all the time. All the \n           =\r\n pompus self proclaimed egotisical little dweebs out there chasing \n       =\r\n     the damn fame and fortune--not facts.&lt;/DIV&gt;\n            &lt;DIV&gt;&nbsp;&lt;/D=\r\nIV&gt;\n            &lt;DIV&gt;&nbsp;I have gotten so much friggn&#39;&nbsp;voices that c=\r\nan&#39;t be \n            explained as anything but spirits/entity communication=\r\n-&lt;WBR&gt;-not \n            good enough! &lt;/DIV&gt;\n            &lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n =\r\n           &lt;DIV&gt;&nbsp;You hear that crap(any proof...)&nbsp;from every \n   =\r\n         scientist/debunker-&lt;WBR&gt;-well if the evidence was there we&#39;d be th=\r\ne \n            first to celibrate it-yeah right, rihgt after they burned, b=\r\nurried, \n            and debunked it. There is more than enough evidence--a=\r\nll of it is \n            ignored.&nbsp;&nbsp;&lt;/DIV&gt;\n            &lt;DIV&gt;&nbsp;=\r\n&lt;/DIV&gt;\n            &lt;DIV&gt;&nbsp;The stuff is simple-provide something for the=\r\n enitities \n            to make their voices out of and they will speak, no=\r\n friggin&#39; \n            mystery, no magic, no secret tecnology, no high prie=\r\nst(ess) needed. \n            &lt;/DIV&gt;\n            &lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n         =\r\n   &lt;DIV&gt;&nbsp;Frank-S&lt;/DIV&gt;\n            &lt;DIV&gt;&lt;BR&gt;&nbsp;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n =\r\n           &lt;DIV class=3Dgmail_quote&gt;\n            &lt;DIV&gt;\n            &lt;DIV&gt;&lt;/D=\r\nIV&gt;\n            &lt;DIV&gt;On Sun, May 3, 2009 at 7:56 PM, itcdeadpeople &lt;SPAN \n =\r\n           dir=3Dltr&gt;&lt;&lt;A title=3Dmailto:ITCdeadpeople@... \n         =\r\n   href=3D&quot;mailto:ITCdeadpeople@...&quot; \n            target=3D_blank&gt;ITCde=\r\nadpeople@&lt;WBR&gt;aol.com&lt;/A&gt;&gt;&lt;/SPAN&gt; \n            wrote:&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n  =\r\n          &lt;BLOCKQUOTE class=3Dgmail_quote style=3D&quot;BORDER-LEFT: #ccc 1px so=\r\nlid&quot;&gt;\n              &lt;DIV style=3D&quot;BACKGROUND-COLOR: #ffffff&quot;&gt;\n             =\r\n &lt;DIV&gt;\n              &lt;DIV&gt;\n              &lt;DIV&gt;&lt;BR&gt;&lt;BR&gt;\n              &lt;P&gt;\n  =\r\n            &lt;DIV&gt;\n              &lt;DIV&gt;&lt;/DIV&gt;\n              &lt;DIV&gt;Frank, I thi=\r\nnk you misunderstood or misread something \n              somewhere. The AAE=\r\nVP/Sarah Estep Research Fund is not for AAEVP to \n              do the rese=\r\narch, it&#39;s for them to fund OUTSIDE organizations for \n              THEIR =\r\nscientific research on the study of EVP. The Windbridge \n              Inst=\r\nitute received some of this sponsor money for what they called \n           =\r\n   &quot;Real-time EVP Conversations: A Pilot Study.&quot; The method for this \n     =\r\n         communication was *not* based on radio sweep, nor traditional \n   =\r\n           methods, so it&#39;s not based on what I assume many people here are=\r\n \n              doing. And in fact, it *was* based on the creations of some=\r\none \n              outside of the USA, so I&#39;m a little confused as to why a=\r\nll the \n              hostility toward AAEVP for putting up the money.&lt;BR&gt;&lt;=\r\nBR&gt;Sadly, \n              radio sweep methods don&#39;t, and may not for a long =\r\ntime, get the \n              respect of the scientific community that it de=\r\nserves (then again, \n              seems no form of EVP does), but at least=\r\n this current research is \n              a step in the right direction. I h=\r\nope, when Windbridge concludes \n              their study, that it will sup=\r\nport the notion that there is \n              apparent communication formed =\r\nin ways that cannot be explained by \n              currently known and unde=\r\nrstood laws of nature. THAT alone, in my \n              opinion, would be a=\r\n big plus for all ITC communities, regardless \n              of the method =\r\nfrom which that communication was received. What&#39;s \n              the old s=\r\naying? &quot;It takes but one white crow to prove all crows \n              are n=\r\not black.&quot; Any proof, derived from any EVP method, would be \n              =\r\ngreatly welcomed as far as I&#39;m concerned.&lt;BR&gt;&lt;BR&gt;Margaret \n              &lt;D=\r\nIV&gt;&lt;BR&gt;&lt;BR&gt;--- In &lt;A title=3Dmailto:EVP-ITC@yahoogroups.com \n              =\r\nhref=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot; \n              target=3D_blank&gt;EV=\r\nP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;, Frank Sumption \n              &lt;purpleali=\r\nengirl@&lt;WBR&gt;...&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; It&#39;s the \n              same old=\r\n stuff, everyone wants to completely ignore absolutely \n              all&lt;B=\r\nR&gt;&gt; work that has been in this field since the caveman and \n            =\r\n  act like they just&lt;BR&gt;&gt; discovered spirit and EVP. Completely \n       =\r\n       ignore all the work in this country&lt;BR&gt;&gt; and in Europe, and if \n =\r\n             anyone says anything, oh well, you&#39;re just being&lt;BR&gt;&gt; negat=\r\nive! \n              Why everyone knows there no EVP/ITC research outside \n =\r\n             AAEVP!&lt;BR&gt;&gt; &lt;BR&gt;&gt; Frank-S&lt;BR&gt;&gt; &lt;BR&gt;&lt;/DIV&gt;&gt; On Sun,=\r\n May \n              3, 2009 at 4:41 PM, Frank Sumption \n              &lt;p=\r\nurplealiengirl@&lt;WBR&gt;...&gt;wrote: \n              &lt;DIV&gt;&lt;BR&gt;&gt; &lt;BR&gt;&gt; &gt=\r\n; Yeah, it&#39;s not what you \n              know....&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt;=\r\n F-S&lt;BR&gt;&gt; &gt;&lt;BR&gt;&lt;/DIV&gt;\n              &lt;DIV&gt;&gt; &gt; On Sun, May 3, 200=\r\n9 at 8:35 AM, \n              &lt;SnowfireL@..&lt;WBR&gt;.&gt; wrote:&lt;BR&gt;&gt; &gt;=\r\n&lt;BR&gt;&gt; \n              &gt;&gt;&lt;BR&gt;&gt; &gt;&gt;&lt;BR&gt;&gt; &gt;&gt; They wer=\r\ne given a grant \n              to do what you all are doing,&lt;BR&gt;&gt; &gt;&g=\r\nt;&lt;BR&gt;&gt; \n              &gt;&gt;&lt;BR&gt;&gt; &gt;&gt; &lt;A \n              title=\r\n=3Dhttp://www.aaevp.com/research.htm \n              href=3D&quot;http://www.aaev=\r\np.com/research.htm&quot; \n              target=3D_blank&gt;http://www.aaevp.&lt;WBR&gt;co=\r\nm/research.&lt;WBR&gt;htm&lt;/A&gt;&lt;BR&gt;&gt; \n              &gt;&gt;&lt;BR&gt;&gt; &gt;&gt; \n =\r\n             ------------&lt;WBR&gt;---------&lt;WBR&gt;---------&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;=\r\n&gt; \n              &gt;&gt; *The Average US Credit Score is 692. See Yours=\r\n in Just 2 \n              Easy Steps!&lt;&lt;A \n              title=3Dhttp://p=\r\nr.atwola.com/promoclk/100126575x1222376998x1201454298/aol?redir=3Dhttp://ww=\r\nw.freecreditreport.com/pm/default.aspx?sc=3D668072&amp;hmpgID=3D62&amp;bcd=\r\n=3DMay5309AvgfooterNO62 \n              href=3D&quot;http://pr.atwola.com/promocl=\r\nk/100126575x1222376998x1201454298/aol?redir=3Dhttp://www.freecreditreport.c=\r\nom/pm/default.aspx?sc=3D668072&amp;hmpgID=3D62&amp;bcd=3DMay5309AvgfooterNO=\r\n62&quot; \n              target=3D_blank&gt;http://pr.atwola.&lt;WBR&gt;com/promoclk/&lt;WBR&gt;=\r\n100126575x122237&lt;WBR&gt;6998x1201454298/&lt;WBR&gt;aol?redir=3D&lt;WBR&gt;http://www.&lt;WBR&gt;=\r\nfreecreditreport&lt;WBR&gt;.com/pm/default.&lt;WBR&gt;aspx?sc=3D668072&amp;hmpgID=3D62&=\r\namp;bcd=3DMay5309Avgfoote&lt;WBR&gt;rNO62&lt;/A&gt;&gt;&lt;BR&gt;&gt; \n              &gt;&gt;=\r\n *&lt;BR&gt;&gt; &gt;&gt;&lt;BR&gt;&gt; &gt;&gt; &lt;BR&gt;&gt; \n              &gt;&gt;&lt;BR&gt;&g=\r\nt; &gt;&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;\n              &lt;P&gt;&lt;/P&gt;\n              &lt;P=\r\n&gt;&lt;/P&gt;\n              &lt;P&gt;&lt;/P&gt;\n              &lt;P&gt;&lt;/P&gt;\n              &lt;P&gt;&lt;/P&gt;\n   =\r\n           &lt;P&gt;&lt;/P&gt;\n              &lt;P&gt;&lt;/P&gt;\n              &lt;P&gt;&lt;/P&gt;&lt;/DIV&gt;\n      =\r\n        &lt;DIV style=3D&quot;COLOR: white&quot; \n            width=3D&quot;1&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/=\r\nDIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;BR&gt;\n            &lt;P&gt;&lt;/P&gt;\n            &lt;P&gt;&lt;/P&gt;\n =\r\n           &lt;P&gt;&lt;/P&gt;\n            &lt;P&gt;&lt;/P&gt;\n            &lt;P&gt;&lt;/P&gt;\n            &lt;P&gt;&lt;=\r\n/P&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n          &lt;P&gt;&lt;/P&gt;\n          &lt;P&gt;&lt;/P&gt;\n    =\r\n      &lt;P&gt;&lt;/P&gt;\n          &lt;P&gt;&lt;/P&gt;\n          &lt;P&gt;&lt;/P&gt;&lt;/DIV&gt;\n          &lt;DIV styl=\r\ne=3D&quot;COLOR: white&quot; \n        width=3D&quot;1&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOT=\r\nE&gt;&lt;/DIV&gt;&lt;BR&gt;\n        &lt;P&gt;&lt;/P&gt;\n        &lt;P&gt;&lt;/P&gt;\n        &lt;P&gt;&lt;/P&gt;\n        &lt;P&gt;&lt;/P=\r\n&gt;&lt;/DIV&gt;\n        &lt;DIV style=3D&quot;COLOR: white&quot; \n      width=3D&quot;1&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;=\r\n&lt;/DIV&gt;&lt;/FONT&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;/FONT&gt;&lt;BR&gt;&lt;FONT \n      style=3D&quot;FONT: 10pt=\r\n arial,san-serif; COLOR: black&quot;&gt;\n      &lt;HR&gt;\n      &lt;B&gt;2009 3 Free CREDIT SCO=\r\nRES: &lt;A \n      title=3Dhttp://pr.atwola.com/promoclk/100126575x1221797372x1=\r\n201397989/aol?redir=3Dhttps://www.freescore.com/Offers/Start/FreeCreditRepo=\r\nrtAndScore.aspx?ID=3D91831F371F138345B53A153F49D4D872&amp;siteid=3De927580b=\r\nf7 \n      href=3D&quot;http://pr.atwola.com/promoclk/100126575x1221797372x120139=\r\n7989/aol?redir=3Dhttps:%2F%2Fwww.freescore.com%2FOffers%2FStart%2FFreeCredi=\r\ntReportAndScore.aspx%3FID%3D91831F371F138345B53A153F49D4D872%26siteid%3De92=\r\n7580bf7&quot; \n      target=3D_blank&gt;See Your 3 Credit Scores from All 3 Bureaus=\r\n \n      FREE!&lt;/A&gt;&lt;/B&gt;&lt;/FONT&gt; \n      &lt;P&gt;&lt;/P&gt;\n      &lt;P&gt;&lt;/P&gt;\n      &lt;P&gt;&lt;/P&gt;&lt;/DI=\r\nV&gt;\n      &lt;DIV style=3D&quot;COLOR: white&quot; \n    width=3D&quot;1&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/D=\r\nIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;BR&gt;\n    &lt;P&gt;&lt;/P&gt;\n    &lt;P&gt;&lt;/P&gt;&lt;/DIV&gt;\n    &lt;DIV style=3D&quot;=\r\nCOLOR: white&quot; \n  width=3D&quot;1&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;BR=\r\n&gt;\n  &lt;P&gt;&lt;/P&gt;&lt;/DIV&gt;\n  &lt;DIV style=3D&quot;CLEAR: both; COLOR: white&quot; width=3D&quot;1&quot;&gt;&lt;/=\r\nDIV&gt;&lt;/FONT&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;/FONT&gt;&lt;br/&gt;&lt;font style=3D&quot;color:black;font:n=\r\normal 10pt arial,san-serif;&quot;&gt; &lt;hr style=3D&quot;margin-top:10px&quot;/&gt;&lt;B&gt;2009 3 Free=\r\n CREDIT SCORES: &lt;A HREF=3Dhttp://pr.atwola.com/promoclk/100126575x122179737=\r\n2x1201397989/aol?redir=3Dhttps:%2F%2Fwww.freescore.com%2FOffers%2FStart%2FF=\r\nreeCreditReportAndScore.aspx%3FID%3D91831F371F138345B53A153F49D4D872%26site=\r\nid%3De927580bf7&gt;See Your 3 Credit Scores from All 3 Bureaus FREE!&lt;/B&gt;&lt;/A&gt;&lt;/=\r\nfont&gt;&lt;/DIV&gt;&lt;/BODY&gt;&lt;/HTML&gt;\n\r\n-------------------------------1241484298--"}