{"id": "14086", "subject": "Re: [EVP-ITC] of EVP &quot;experiments&quot; and Grants", "author": "Zack Widup", "timestamp": "2009-05-06T03:22:02Z", "full_text": "I think the thing is that there are some of us here (well, at least one and\nmaybe two) who could care less what the rest of the world thinks. We aren&#39;t\nout to prove anything to the world. We&#39;re not intertestid in &quot;studies&quot; or\n&quot;grants.&quot; We know what we can get and we just do it for the enjoyment of\nhearing the EVP/ITC communication ourselves\n\nI am in this category and I have a feeling Frank is to some extent, too.\n\nZack.\n\nOn Tue, May 5, 2009 at 5:03 PM, almovadar &lt;almovadar@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Any serious student and researcher of EVP knows that VERY VERY controlled\n&gt; studies of the EVP phenomenon go back at least 30 years to the first Pye\n&gt; Recording Studio Tests that where originally set up and paid for by and\n&gt; Editor of a newspaper covering the phenomenon. The editor was NOT in any way\n&gt; convinced that EVP was real... Independent sound engineers from Pye were\n&gt; brought in... the result? Voices... hundreds of them... Ultimately result?\n&gt; The paper didn&#39;t release the result anyway...\n&gt;\n&gt; There was also a very controlled experiment done in a Faraday Cage... and\n&gt; if memory serves was mentioned in the Journal for the American Psychical\n&gt; Society.\n&gt;\n&gt; The point I&#39;m trying to make here is that VERY controlled experiments are\n&gt; not new in this arena...\n&gt;\n&gt; I&#39;ve been involved in the area of EVP for well over a decade now... I don&#39;t\n&gt; wish to convinced anyone of anything thats tantamount to a damned religious\n&gt; conversion...\n&gt;\n&gt; Hans Holzer summed it up well... &quot;The will to disbelieve is greater than\n&gt; the will to believe.&quot;\n&gt;\n&gt; As researchers, many of us have moved well beyond the question of: Do they\n&gt; (the voices) exist?&quot;... Many of us are now asking: &quot;What does it all mean?&quot;\n&gt; in a more spiritual context...\n&gt;\n&gt; The group that recieved the grant I suspect are themselves members of the\n&gt; AA-EVP group at large. I recognize at LEAST 3 members from the consciousness\n&gt; studies dept (the former) at the University of Arizona as well who have now\n&gt; formed this (in my opinion) new agey group studying human potential... Very\n&gt; 70&#39;s at first glance...\n&gt;\n&gt; Louis\n&gt;\n&gt; \n&gt;\n\nI hink he hing is ha he e a e some o us he e (well, a leas one and maybe wo) who could ca e less wha he es o he wo ld hinks. We a en' ou o p o e any hing o he wo ld. We' e no in e es id in \"s udies\" o \"g an s.\" We know wha we can ge and we jus do i o he enjoymen o hea ing he EVP/ITC communica ion ou sel es\n\n \nI am in his ca ego y and I ha e a eeling F ank is o some ex en , oo.\n \nZack.\nOn Tue, May 5, 2009 a 5:03 PM, almo ada almo ada @...> w o e:\n\n\n\n\n\nAny se ious s uden and esea che o EVP knows ha VERY VERY con olled s udies o he EVP phenomenon go back a leas 30 yea s o he i s Pye Reco ding S udio Tes s ha whe e o iginally se up and paid o by and Edi o o a newspape co e ing he phenomenon. The edi o was NOT in any way con inced ha EVP was eal... Independen sound enginee s om Pye we e b ough in... he esul ? Voices... hund eds o hem... Ul ima ely esul ? The pape didn' elease he esul anyway...\nThe e was also a e y con olled expe imen done in a Fa aday Cage... and i memo y se es was men ioned in he Jou nal o he Ame ican Psychical Socie y.The poin I'm ying o make he e is ha VERY con olled expe imen s a e no new in his a ena... \nI' e been in ol ed in he a ea o EVP o well o e a decade now... I don' wish o con inced anyone o any hing ha s an amoun o a damned eligious con e sion...Hans Holze summed i up well... \"The will o disbelie e is g ea e han he will o belie e.\"\nAs esea che s, many o us ha e mo ed well beyond he ques ion o : Do hey ( he oices) exis ?\"... Many o us a e now asking: \"Wha does i all mean?\" in a mo e spi i ual con ex ...The g oup ha ecie ed he g an I suspec a e hemsel es membe s o he AA-EVP g oup a la ge. I ecognize a LEAST 3 membe s om he consciousness s udies dep ( he o me ) a he Uni e si y o A izona as well who ha e now o med his (in my opinion) new agey g oup s udying human po en ial... Ve y 70's a i s glance...\nLouis"}