{"id": "14106", "subject": "Re: voice recogntion software", "author": "Derek", "timestamp": "2009-05-07T03:14:59Z", "full_text": "My question is more on a technique for separating out the word &quot;sounds&quot; from the\ngeneric background white noise, as used to provide audio raw material for an\nEVP session e.g. perhaps the spirit/entity/ET/ etc could help by prefixing their\nword response with a &quot;number&quot; sound e.g.\noperator : &quot;is anybody there ?&quot;\nspirit/entity/ET/...: &quot;1,(one)yes&quot;\nin this way a response is tagged to a number sound, (which could be programmed\ninto the voice recognition software i.e 0-9 ?)\nso helping to distinguish it from the inherent background noise generated as the\nghost box cycles through the radio bands...anyway its just a thought.\nPersonally it seems to me from listening to the ghost box sessions via audio\nclips and you tube videos that Spiricom like transmissions are still a long way\noff.\n\nNow is it just me,\nI read Mark Macys account concerning the work ITC groups on the &quot;other side&quot;\nsupposedly involved with the worlds greatest minds in electronics, advocates for the technology when earth side - now passed on- to build a communication bridge between the worlds, The Spiricom\nbeing something of a watershed device and a technological marker of better\nthings to come back in the day, well by 2009 I  was expecting something\nstupendous I mean Arena Prog rock concert scale here \nwell hmmm do they have trade unions on the other side, cause they must be on a\nwork to rule or 3 day working week with extended liquid lunch breaks or maybe\nthis delay is down to a mix up with relative time lines within the multiverse\nas aside from some interesting accounts seeming to demonstrate adeptness with\nutilizing most if not all electronic devices of that time (80&#39;s) where nothing\nwas really safe from ghostly tampering e.g. washing machines, TV, and you gran\nmama (recently deceased) is on the telephone wanting a word etc,  only very recently with advent of the &quot;Ghost box&quot;, has progress been made and that is down to the endeavors of talented radio hobbyists looking for a new technical challenge.\nSo Mr Macy what has happened to the technical progress when the knowledge base of the 7 Ethereal gatekeepers together with the growing band of (deceased in a sense) geniuses cannot move on the design as demonstrated by the spiricom device?\n\nand on that point, why isn&#39;t there a spiricom like email gateway service,\nseriously, we are in the Internet age and spirit people- circa 20 years ago\nwere already  sending  rubbish emails and dodgy fax montages (like us all,back then) and that was using crappy dial up over a PSTN line!, so ITC sprit world, hey common\nit&#39;s all digital now!!, Broadband is here already (even in the UK)  Robot voice synthesizers over PSTN lines where de-rigur in spooking the life out of some unsuspecting ITC believers way back in the 70&#39;s but now that we have computers on our phones for voice mail, it seems no ones calling home anymore?\n(but should I receive a reply over either email or phone to the above by what I\nthink is the &quot;other side&quot; I will post it on this forum ;) \nall the best, D\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, Rj &lt;rasterer@...&gt; wrote:\n&gt;\n&gt; Generally, voice recognition software requires the user to go through several training phases with it before using it, so the software is able to recognize that particular users words (unless it is a VERY limited set of words). So with this kind of software, it would be hard to create an objective training session to pull a voice sequence out of noise from a voice that it has never heard. The software would make a lot of mistakes, and perhaps even be subject to paradolia, just like people.\n&gt; \n&gt; --- On Wed, 5/6/09, Derek &lt;centroderek@...&gt; wrote:\n&gt; \n&gt; From: Derek &lt;centroderek@...&gt;\n&gt; Subject: [EVP-ITC] voice recogntion software\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Wednesday, May 6, 2009, 5:28 PM\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;     \n&gt;             \n&gt;             \n&gt; \n&gt; \n&gt;       \n&gt;       hello,\n&gt; \n&gt; does anyone know of a system which can fix a voice wave form out of the background noise e.g a ghost box combined with voice recogntion software so that EVP responses are automatically registered (on the screen) so that even if consiously the operator may miss audio responses due to the background noise the machine/PC audio sensitivity will not ?\n&gt; \n&gt; \n&gt; \n&gt; all the best,\n&gt; \n&gt; \n&gt; \n&gt; Derek\n&gt;"}