{"id": "14125", "subject": "Re: Foget that!", "author": "Rick", "timestamp": "2009-05-07T19:54:21Z", "full_text": "If the steel was the only issue, there is a way around that. \n\nThe Queen Mary is not a submarine: it has upper decks, windows, and areas open to the air.  So if it&#39;s radio transmissions you need, you&#39;d just have to make the requirement that you did your thing in an area that wasn&#39;t too insulated from outside EM.  The ship does have wireless internet installed in all areas from what I hear, but I don&#39;t know if that helps you.\n\nBut I can understand how you would not want to put yourself into a situation where someone might try to perform unplanned testing of the EVP claims.  That would probably be pretty embarrassing for you, and why would you want to go through that?\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  He&#39;s listed on the Darkness Radio event site. I didn&#39;t want to name names\n&gt; becuase i don&#39;t trust these dweebs.\n&gt; The event was starting to smell already. Then, how is one supposed to get a\n&gt; radio signal inside a stewl ship? The debunkers would just say see, it\n&gt; doesn&#39;t work!\n&gt; \n&gt;  Frank-S\n&gt; \n&gt; On Thu, May 7, 2009 at 10:33 AM, Fransen, Debbie\n&gt; &lt;debbie.fransen@...&gt;wrote:\n&gt; \n&gt; &gt;\n&gt; &gt;\n&gt; &gt;  I hear ya Frank.... that&#39;s what makes you so different and interesting.\n&gt; &gt; You don&#39;t want all of this publicity and crap that most NAMES IN THE\n&gt; &gt; PARANORMAL field do.\n&gt; &gt; And the email I received about the Queen Mary event doesn&#39;t say who is on\n&gt; &gt; the engineer panel\n&gt; &gt; that picks the inventions.\n&gt; &gt; Who is this debunker on Discovery?  Got a first or last name?\n&gt; &gt; Can&#39;t think of who you are talking about...\n&gt; &gt;\n&gt; &gt; deb\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;  ------------------------------\n&gt; &gt; *From:* EVP-ITC@yahoogroups.com [mailto:EVP-ITC@yahoogroups.com] *On\n&gt; &gt; Behalf Of *Frank Sumption\n&gt; &gt; *Sent:* Thursday, May 07, 2009 12:24 PM\n&gt; &gt; *To:* evp-itc@yahoogroups.com; grassharp@yahoogroups.com\n&gt; &gt; *Subject:* [EVP-ITC] Foget that!\n&gt; &gt;\n&gt; &gt;    I&#39;m not doing the QM thing, not if they are sneaking in that infamous\n&gt; &gt; debunker that Discovery usaully as on.  I don&#39;t have a vested interest in\n&gt; &gt; this paranormnal crap, and I don&#39;t have to take that darkside sneaky shit!\n&gt; &gt;\n&gt; &gt;  Frank-S\n&gt; &gt;\n&gt; &gt;  \n&gt; &gt;\n&gt;"}