{"id": "14122", "subject": "Re: [EVP-ITC] The Script", "author": "Eric VanDuzer", "timestamp": "2009-05-07T19:28:57Z", "full_text": "Sorry I just had to write it LMAO\n\n\nOn Thu, May 7, 2009 at 3:26 PM, Frank Sumption &lt;purplealiengirl@...&gt;wrote:\n\n&gt;\n&gt;\n&gt; Makes me wanna turn my e-mail off agin.\n&gt;\n&gt;  Frank-S\n&gt;\n&gt; On Thu, May 7, 2009 at 1:16 PM, Eric VanDuzer &lt;evanduzer@...&gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; here is the script I said I would write.  Now please no hate mail this is\n&gt;&gt; just a satire\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; WILLY:     WILLY HAYS HERE WONDERING IF YOU HAVE LOST SOMEONE RECENTLY??\n&gt;&gt; WHERE THEY RICH AND YOU WANT TO FIND THERE HIDDEN STASH?  DID THEY HAVE\n&gt;&gt; SOMETHING THEY WANTED TO TELL YOU AND NEVER GOT THE CHANCE OR DID YOU HAVE\n&gt;&gt; SOMETHING YOU WANTED TO TELL THEM??  WELL NOW YOU CAN WITH THE ONE AND ONLY\n&gt;&gt; &quot;FRANKS BOX&quot;!!!!  JUST PLUG IT IN AND AWAY YOU GO!!\n&gt;&gt;\n&gt;&gt; BOX USER:     &quot;FRANKS BOX&quot; IS GREAT!!  ALL I DID WAS PLUG IT ON AND\n&gt;&gt; LISTENED TO THE DIAL SWEEP THE RADIO BANDS.  I ASKED IF MY DEAD UNCLE WAS\n&gt;&gt; THERE AND IF HE REALLY DID MOLEST ME AS A CHILD??  AND THE BOX SAID YES I\n&gt;&gt; DID!!  FINALLY SOME CLOSURE!!\n&gt;&gt;\n&gt;&gt; WILLY:     SKEPTICS BEWARE!!!  THIS IS THE REALLY REAL THING!!! BELIEVERS\n&gt;&gt; BEWARE!!!! THE RESULTS MAY SHOCK YOU!!!!  ARE YOU SPEAKING WITH THE DEAD,\n&gt;&gt; BEINGS FROM AN INTER-DIMENSIONAL REALM, ET&#39;S!! WHO KNOWS, YOU ARE TALKING TO\n&gt;&gt; SOMEONE!!!!\n&gt;&gt;\n&gt;&gt; BOX USER:  THE BOX IS AMAZING!!! I ASKED IT IF MY GREAT GREAT COUSINS\n&gt;&gt; BROTHER WAS MURDERED, AND IT SAID YES AND IT EVEN TOLD ME WHERE IN THE WALL\n&gt;&gt; HE WAS BURIED\n&gt;&gt;\n&gt;&gt; CHRIS MOON:  I CAN&#39;T SEE WHY I CANT GET THIS DAMN THING TO WORK!!!! I AM\n&gt;&gt; GOING TO GO BACK TO MY BOX WHICH ONLY I CAN UNDERSTAND IF YOU WANNA WATCH ME\n&gt;&gt; PLAY WITH MY BOX, MAIL $6000 DOLLARS TO ME AND THEN WAIT FOR ME AT EASTERN\n&gt;&gt; STATE PENN ON SATURDAY AND I MIGHT SHOW UP.\n&gt;&gt;\n&gt;&gt; JOHN EDWARDS:  WHY DO I NEED A BOX I CAN DO IT WITHOUT.....\n&gt;&gt;\n&gt;&gt; WILLY:     WHAT WOULD YOU EXPECT TO PAY FOR SOMETHING LIKE THIS $1000.00,\n&gt;&gt; 1500, 2000......NO!!!!!!! NOT EVEN CLOSE CALL NOW AND PAY JUST 15 EASY\n&gt;&gt; PAYMENT OF 89.99.......BUT WAIT I AM STILL NOT DONE..... BE ONE OF THE NEXT\n&gt;&gt; 50 CALLERS AND I WILL KNOCK 14 PAYMENTS OFF AND EVEN GIVE YOU FREE\n&gt;&gt; SHIPPING.  YOU JUST PAY HANDLING...........BUT WAIT I AM STILL NOT DONE BE\n&gt;&gt; ONE OF THE NEXT 20 CALLERS AND YOU GET A &quot;BEEP IF YOU HATE CHRIS MOON BUMPER\n&gt;&gt; STICKER&quot;  THANKS FOR WATCHING FOLKS!!!!!!!\n&gt;&gt;\n&gt;\n&gt;  \n&gt;\n\nSo y I jus had o w i e i LMAO On Thu, May 7, 2009 a 3:26 PM, F ank Sump ion pu plealiengi l@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n \n \n \n Makes me wanna u n my e-mail o agin.\n \n F ank-S\nOn Thu, May 7, 2009 a 1:16 PM, E ic VanDuze e anduze @...> w o e:\n\n\n\n\n\nhe e is he sc ip I said I would w i e.  Now please no ha e mail his is jus a sa i eWILLY:     WILLY HAYS HERE WONDERING IF YOU HAVE LOST SOMEONE RECENTLY??  WHERE THEY RICH AND YOU WANT TO FIND THERE HIDDEN STASH?  DID THEY HAVE SOMETHING THEY WANTED TO TELL YOU AND NEVER GOT THE CHANCE OR DID YOU HAVE SOMETHING YOU WANTED TO TELL THEM??  WELL NOW YOU CAN WITH THE ONE AND ONLY \"FRANKS BOX\"!!!!  JUST PLUG IT IN AND AWAY YOU GO!!\n\nBOX USER:     \"FRANKS BOX\" IS GREAT!!  ALL I DID WAS PLUG IT ON AND LISTENED TO THE DIAL SWEEP THE RADIO BANDS.  I ASKED IF MY DEAD UNCLE WAS THERE AND IF HE REALLY DID MOLEST ME AS A CHILD??  AND THE BOX SAID YES I DID!!  FINALLY SOME CLOSURE!!\n\nWILLY:     SKEPTICS BEWARE!!!  THIS IS THE REALLY REAL THING!!! BELIEVERS BEWARE!!!! THE RESULTS MAY SHOCK YOU!!!!  ARE YOU SPEAKING WITH THE DEAD, BEINGS FROM AN INTER-DIMENSIONAL REALM, ET'S!! WHO KNOWS, YOU ARE TALKING TO SOMEONE!!!!\n\nBOX USER:  THE BOX IS AMAZING!!! I ASKED IT IF MY GREAT GREAT COUSINS BROTHER WAS MURDERED, AND IT SAID YES AND IT EVEN TOLD ME WHERE IN THE WALL HE WAS BURIEDCHRIS MOON:  I CAN'T SEE WHY I CANT GET THIS DAMN THING TO WORK!!!! I AM GOING TO GO BACK TO MY BOX WHICH ONLY I CAN UNDERSTAND IF YOU WANNA WATCH ME PLAY WITH MY BOX, MAIL $6000 DOLLARS TO ME AND THEN WAIT FOR ME AT EASTERN STATE PENN ON SATURDAY AND I MIGHT SHOW UP.\n\nJOHN EDWARDS:  WHY DO I NEED A BOX I CAN DO IT WITHOUT.....WILLY:     WHAT WOULD YOU EXPECT TO PAY FOR SOMETHING LIKE THIS $1000.00, 1500, 2000......NO!!!!!!! NOT EVEN CLOSE CALL NOW AND PAY JUST 15 EASY PAYMENT OF 89.99.......BUT WAIT I AM STILL NOT DONE..... BE ONE OF THE NEXT 50 CALLERS AND I WILL KNOCK 14 PAYMENTS OFF AND EVEN GIVE YOU FREE SHIPPING.  YOU JUST PAY HANDLING...........BUT WAIT I AM STILL NOT DONE BE ONE OF THE NEXT 20 CALLERS AND YOU GET A \"BEEP IF YOU HATE CHRIS MOON BUMPER STICKER\"  THANKS FOR WATCHING FOLKS!!!!!!!"}