{"id": "14135", "subject": "Re: voice recognition software", "author": "Derek", "timestamp": "2009-05-08T01:34:45Z", "full_text": "Hello Frank \nhobbyists like yourself using readily available technology  to support a form of 2 way radio communication - with the &quot;spirit&quot; realm, is a major acheivement, and the only shortfall in my opinion (and it is not a technical flaw) is the need to filter out the noise aspect.\n\nI would surrgest the output from these &quot;stage one devices&quot; needs to become the input for another device which will filter/capture those wave forms - &quot;tagged&quot; in some manner as being actual responses, and this I feel can (will) be acheived through some clever computer software development so that communications will eventualy flow through a four stage process (4th stage = filtering) \n1. human operator\n2.spirit entity\n3.Ghost box\n4.filtering software.\n\nI am convinced products such as voice recognition programs, can be &quot;tweaked&quot;  to provide these filtering capabilitys.so is anyone up for the challenge or knows anyone who could work their magic re: a software guru with a paranormal interest ?;)\nall the best, \nD\n\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt; There is software sold by reversespeech.com for locating speech reversals,\n&gt; but I don&#39;t know if it would work for EVP.\n&gt; \n&gt;  F-S\n&gt; \n&gt; On Wed, May 6, 2009 at 6:28 PM, Derek &lt;centroderek@...&gt; wrote:\n&gt; \n&gt; &gt;\n&gt; &gt;\n&gt; &gt; hello,\n&gt; &gt; does anyone know of a system which can fix a voice wave form out of the\n&gt; &gt; background noise e.g a ghost box combined with voice recogntion software so\n&gt; &gt; that EVP responses are automatically registered (on the screen) so that even\n&gt; &gt; if consiously the operator may miss audio responses due to the background\n&gt; &gt; noise the machine/PC audio sensitivity will not ?\n&gt; &gt;\n&gt; &gt; all the best,\n&gt; &gt;\n&gt; &gt; Derek\n&gt; &gt;\n&gt; &gt; \n&gt; &gt;\n&gt;"}