{"id": "14203", "subject": "Re: [EVP-ITC] The Seven - interesting tidbit of info", "author": "Zack Widup", "timestamp": "2009-05-11T06:04:34Z", "full_text": "I guess police still use those codes. Emergency agencies such as ESDA now\nfollow the FEMA Incident Command System/National Incident Management\nSystem which requires all communications to be in plain English (no codes).\nZack\n\n\nOn Sun, May 10, 2009 at 11:31 PM, Misty Dawn &lt;bulletbabea@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;    Tonight at work I was talking to a state trooper, there had been an\n&gt; accident. I asked him if there were any deaths (it was very very bad) and he\n&gt; said he didnt know so he got on his radio and called in and asked them if it\n&gt; was a 7 at the site. They told him negative, and he told me the little boy\n&gt; who was the worst off was still alive. I asked him why did you ask them if\n&gt; it was a 7. He said code 7, I was asking them if they were dead. So if you\n&gt; ever hear anyone call 7 over the radio that means someones dead.\n&gt;\n&gt; Just thought I would pass that on. I find it interesting since I know alot\n&gt; of us have heard this before when used to describe who is speaking rather\n&gt; than a name they say seven.\n&gt;\n&gt; Misty\n&gt;\n&gt; \n&gt;\n\nI guess police s ill use hose codes. Eme gency agencies such as ESDA now ollow he FEMA Inciden Command Sys em/Na ional Inciden Managemen Sys em which equi es all communica ions o be in plain English (no codes).\n\nZack\n \nOn Sun, May 10, 2009 a 11:31 PM, Mis y Dawn bulle babea@...> w o e:\n\n\n\n\n\n\n\n\n\n\nTonigh a wo k I was alking o a s a e oope , he e had been an acciden . I asked him i he e we e any dea hs (i was e y e y bad) and he said he didn know so he go on his adio and called in and asked hem i i was a 7 a he si e. They old him nega i e, and he old me he li le boy who was he wo s o was s ill ali e. I asked him why did you ask hem i i was a 7. He said code 7, I was asking hem i hey we e dead. So i you e e hea anyone call 7 o e he adio ha means someones dead.\n\n \nJus hough I would pass ha on. I ind i in e es ing since I know alo o us ha e hea d his be o e when used o desc ibe who is speaking a he han a name hey say se en.\n \nMis y"}