{"id": "14234", "subject": "Re: File uploading rules DO NOT UPLOAD WAV FILES", "author": "Misty", "timestamp": "2009-05-13T06:58:36Z", "full_text": "LOL Snowfire! Nope it was not you this time. Others should read before they post because we just addressed this subject. Esnips is very easy to use it has two uploading options in case you cant use the java application use the single file uploader. Works alot like email upload attachments.\n\nIf you need more help just holler and I am sure one of us will be more than willing to help you figure it out. Posting from email as an attachment also  works just not so well for the very large file sizes. There are many other file sharing storage places besides esnips. We just like the layout there and the ability to share with friends including sharing storage space.\n\nMisty\n\n\n\n--- In EVP-ITC@yahoogroups.com, SnowfireL@... wrote:\n&gt;\n&gt; Well, it is not me, I took out the folder, and I removed the files, I can&#39;t \n&gt;  figure out esnips, it says it will take lots of files at once but, it \n&gt; never  sends a connection, to upload anything.\n&gt;  \n&gt;  \n&gt; In a message dated 5/13/2009 2:45:10 A.M. Eastern Daylight Time,  \n&gt; bulletbabea@... writes:\n&gt; \n&gt;  \n&gt;  \n&gt; \n&gt; \n&gt; Ok I am getting tired of having to say this especially twice in a  couple \n&gt; days. Do not upload wav format files if you feel you must share  it in wav \n&gt; format then use esnips or another file sharing source. If  newbies cant follow \n&gt; the groups rules then you will not be allowed to  upload files period. \n&gt;  \n&gt; Everything will be deleted and you may reupload in proper formats  and \n&gt; remember to respect the fact that this group of over 500 people has  a limited \n&gt; amoyunt of file sharing space on yahoo. Only 100 megs split  between \n&gt; everyone. that is why we work to get around our limitations by  attaching files to \n&gt; posts via email attachment or using _http://www.esnips.htt_ \n&gt; (http://www.esnips.com/)   etcetera.\n&gt;  \n&gt; Misty\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; **************Dell Mini Netbooks: Great deals starting at $299 after \n&gt; instant savings! \n&gt; (http://pr.atwola.com/promoclk/100126575x1221972443x1201442012/aol?redir=http:%2F%2Fad.doubleclick.net%2Fclk%3B214819441%3B36680237%3Bi)\n&gt;"}