{"id": "14230", "subject": "Re: [EVP-ITC] Cussing EVP", "author": "Zack Widup", "timestamp": "2009-05-13T03:17:10Z", "full_text": "I don&#39;t think there are any rules against that. What you got is what you\ngot!\n\nI for one am not offended and would like to hear them.\n\nZack\n\nOn Tue, May 12, 2009 at 9:34 PM, James W. Hyslope &lt;clockdryve@...&gt;wrote:\n\n&gt;\n&gt;\n&gt; Hi guys :) I am new to EVP, but I was able to purchase a NEW sealed in\n&gt; package Panasonic RR-DR60 from eBay for $130 shipped (I included an extra\n&gt; $10 to get priority shipping WITH insurance) This DR60 has been truly\n&gt; AMAZING!! I have a question. I have 2 EVP&#39;s that have cursing words in them.\n&gt; The &quot;F&quot; word. One is from a female saying &quot; I hit it.....Fu$k&quot; and another\n&gt; Male (?) sorta mechanical (original mechanical voice without editing) that\n&gt; says &quot;HEY....we don&#39;t give a fu$k&quot; CAN I UPLOAD these (are very clear)\n&gt; female is lower audio, but the male is easier to hear (although his vowles\n&gt; are not as clear) Or would this be PROHIBITED. I don&#39;t want to offend\n&gt; anyone, just would like to give the true results as they are....we DO get\n&gt; some &quot;negative&quot; results sometimes. Please advise. Thanks. Jim H\n&gt;\n&gt; \n&gt;\n\nI don' hink he e a e any ules agains ha . Wha you go is wha you go !\n \nI o one am no o ended and would like o hea hem.\n \nZack\nOn Tue, May 12, 2009 a 9:34 PM, James W. Hyslope clockd y e@...> w o e:\n\n\n\n\n\nHi guys :) I am new o EVP, bu I was able o pu chase a NEW sealed in package Panasonic RR-DR60 om eBay o $130 shipped (I included an ex a $10 o ge p io i y shipping WITH insu ance) This DR60 has been uly AMAZING!! I ha e a ques ion. I ha e 2 EVP's ha ha e cu sing wo ds in hem. The \"F\" wo d. One is om a emale saying \" I hi i .....Fu$k\" and ano he Male (?) so a mechanical (o iginal mechanical oice wi hou edi ing) ha says \"HEY....we don' gi e a u$k\" CAN I UPLOAD hese (a e e y clea ) emale is lowe audio, bu he male is easie o hea (al hough his owles a e no as clea ) O would his be PROHIBITED. I don' wan o o end anyone, jus would like o gi e he ue esul s as hey a e....we DO ge some \"nega i e\" esul s some imes. Please ad ise. Thanks. Jim H"}