{"id": "14231", "subject": "Re: Cussing EVP", "author": "James W. Hyslope", "timestamp": "2009-05-13T03:30:07Z", "full_text": "--- In EVP-ITC@yahoogroups.com, Zack Widup &lt;w9sz.zack@...&gt; wrote:\n&gt;\n&gt; I don&#39;t think there are any rules against that. What you got is what you\n&gt; got!\n&gt; \n&gt; I for one am not offended and would like to hear them.\n&gt; \n&gt; Zack\n&gt; \n&gt; On Tue, May 12, 2009 at 9:34 PM, James W. Hyslope &lt;clockdryve@...&gt;wrote:\n&gt; \n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Hi guys :) I am new to EVP, but I was able to purchase a NEW sealed in\n&gt; &gt; package Panasonic RR-DR60 from eBay for $130 shipped (I included an extra\n&gt; &gt; $10 to get priority shipping WITH insurance) This DR60 has been truly\n&gt; &gt; AMAZING!! I have a question. I have 2 EVP&#39;s that have cursing words in them.\n&gt; &gt; The &quot;F&quot; word. One is from a female saying &quot; I hit it.....Fu$k&quot; and another\n&gt; &gt; Male (?) sorta mechanical (original mechanical voice without editing) that\n&gt; &gt; says &quot;HEY....we don&#39;t give a fu$k&quot; CAN I UPLOAD these (are very clear)\n&gt; &gt; female is lower audio, but the male is easier to hear (although his vowles\n&gt; &gt; are not as clear) Or would this be PROHIBITED. I don&#39;t want to offend\n&gt; &gt; anyone, just would like to give the true results as they are....we DO get\n&gt; &gt; some &quot;negative&quot; results sometimes. Please advise. Thanks. Jim H\n&gt; &gt;\n&gt; &gt; \n&gt; &gt;THANKS, I will upload the &quot;F&quot; word EVP&#39;s in a day or two. In the meantime look in the FILES section....I have uploaded my first EVP&#39;s. You will find them in Folder &quot;Jim&#39;s RR-DR60 EVP&#39;s&quot; ENJOY :) Almost ALL are as I found them (no enhacements) a few were enhanced &gt;&gt;&gt;&gt;the little girl saying &quot;call us in the morning&quot; (first is original)*the 2nd upload was enhanced....because I had noticed that some cannot hear the original voice (I enhanced here voice in 7 different ways...in other files I have on pc) and there were a few enhanced because I would not have HEARD them otherwise. I was only able to hear them after using Audacity in areas where I was only able to hear a THUMP or CLICK. So that would be a good rule.....CHECK your bump,clicks,and thumps (look in before and after).....slow them down-change the pitch, amplify (a little) maybe add some BASS. That has worked for me."}