{"id": "14243", "subject": "Re: [EVP-ITC] Re: File uploading rules DO NOT UPLOAD WAV FILES", "author": "Zack Widup", "timestamp": "2009-05-13T14:44:35Z", "full_text": "Another one is http://www.box.com. You get a pretty good amount of storage\nspace with the free account.\n\nZack\n\nOn Wed, May 13, 2009 at 9:07 AM, April Abercrombie &lt;\napril@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;  This type of file sharing is new to me. I have a photo album site for\n&gt; sharing and uploading photos, but you can&#39;t upload files. I didn&#39;t know\n&gt; there were file sharing sites until joined this group, but I had always\n&gt; thought there should be.\n&gt;\n&gt;\n&gt;  ----- Original Message -----\n&gt; *From:* Misty &lt;bulletbabea@...&gt;\n&gt; *To:* EVP-ITC@yahoogroups.com\n&gt;   *Sent:* Wednesday, May 13, 2009 12:58 AM\n&gt; *Subject:* [EVP-ITC] Re: File uploading rules DO NOT UPLOAD WAV FILES\n&gt;\n&gt;  LOL Snowfire! Nope it was not you this time. Others should read before\n&gt; they post because we just addressed this subject. Esnips is very easy to use\n&gt; it has two uploading options in case you cant use the java application use\n&gt; the single file uploader. Works alot like email upload attachments.\n&gt;\n&gt; If you need more help just holler and I am sure one of us will be more than\n&gt; willing to help you figure it out. Posting from email as an attachment also\n&gt; works just not so well for the very large file sizes. There are many other\n&gt; file sharing storage places besides esnips. We just like the layout there\n&gt; and the ability to share with friends including sharing storage space.\n&gt;\n&gt; Misty\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, SnowfireL@...\n&gt; wrote:\n&gt; &gt;\n&gt; &gt; Well, it is not me, I took out the folder, and I removed the files, I\n&gt; can&#39;t\n&gt; &gt; figure out esnips, it says it will take lots of files at once but, it\n&gt; &gt; never sends a connection, to upload anything.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; In a message dated 5/13/2009 2:45:10 A.M. Eastern Daylight Time,\n&gt; &gt; bulletbabea@... writes:\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Ok I am getting tired of having to say this especially twice in a couple\n&gt; &gt; days. Do not upload wav format files if you feel you must share it in wav\n&gt;\n&gt; &gt; format then use esnips or another file sharing source. If newbies cant\n&gt; follow\n&gt; &gt; the groups rules then you will not be allowed to upload files period.\n&gt; &gt;\n&gt; &gt; Everything will be deleted and you may reupload in proper formats and\n&gt; &gt; remember to respect the fact that this group of over 500 people has a\n&gt; limited\n&gt; &gt; amoyunt of file sharing space on yahoo. Only 100 megs split between\n&gt; &gt; everyone. that is why we work to get around our limitations by attaching\n&gt; files to\n&gt; &gt; posts via email attachment or using _http://www.esnips.htt_\n&gt; &gt; (http://www.esnips.com/) etcetera.\n&gt; &gt;\n&gt; &gt; Misty\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; **************Dell Mini Netbooks: Great deals starting at $299 after\n&gt; &gt; instant savings!\n&gt; &gt; (\n&gt; http://pr.atwola.com/promoclk/100126575x1221972443x1201442012/aol?redir=http:%2F%2Fad.doubleclick.net%2Fclk%3B214819441%3B36680237%3Bi\n&gt; )\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nAno he one is h p://www.box.com. You ge a p e y good amoun o s o age space wi h he ee accoun .\n \nZack\nOn Wed, May 13, 2009 a 9:07 AM, Ap il Abe c ombie ap il@abe c ombieghos esea ch.com> w o e:\n\n\n\n\n\n\nThis ype o ile sha ing is new o me. I ha e a pho o album si e o sha ing and uploading pho os, bu you can' upload iles. I didn' know he e we e ile sha ing si es un il joined his g oup, bu I had always hough he e should be.\n\n \n\n\n----- O iginal Message ----- \nF om: Mis y \nTo: EVP-ITC@yahoog oups.com \n\n\n\nSen : Wednesday, May 13, 2009 12:58 AM\nSubjec : [EVP-ITC] Re: File uploading ules DO NOT UPLOAD WAV FILES\n\n\nLOL Snow i e! Nope i was no you his ime. O he s should ead be o e hey pos because we jus add essed his subjec . Esnips is e y easy o use i has wo uploading op ions in case you can use he ja a applica ion use he single ile uploade . Wo ks alo like email upload a achmen s.\nI you need mo e help jus holle and I am su e one o us will be mo e han willing o help you igu e i ou . Pos ing om email as an a achmen also wo ks jus no so well o he e y la ge ile sizes. The e a e many o he ile sha ing s o age places besides esnips. We jus like he layou he e and he abili y o sha e wi h iends including sha ing s o age space.\nMis y--- In EVP-ITC@yahoog oups.com, Snow i eL@... w o e:>> Well, i is no me, I ook ou he olde , and I emo ed he iles, I can' \n> igu e ou esnips, i says i will ake lo s o iles a once bu , i > ne e sends a connec ion, o upload any hing.> > > In a message da ed 5/13/2009 2:45:10 A.M. Eas e n Dayligh Time, \n> bulle babea@... w i es:> > > > > > Ok I am ge ing i ed o ha ing o say his especially wice in a couple > days. Do no upload wa o ma iles i you eel you mus sha e i in wa \n> o ma hen use esnips o ano he ile sha ing sou ce. I newbies can ollow > he g oups ules hen you will no be allowed o upload iles pe iod. > > E e y hing will be dele ed and you may eupload in p ope o ma s and \n> emembe o espec he ac ha his g oup o o e 500 people has a limi ed > amoyun o ile sha ing space on yahoo. Only 100 megs spli be ween > e e yone. ha is why we wo k o ge a ound ou limi a ions by a aching iles o \n> pos s ia email a achmen o using _h p://www.esnips.h _ > (h p://www.esnips.com/) e ce e a.> \n> Mis y> > > > > > **************Dell Mini Ne books: G ea deals s a ing a $299 a e > ins an sa ings! > (h p://p .a wola.com/p omoclk/100126575x1221972443x1201442012/aol? edi =h p:%2F%2Fad.doubleclick.ne %2Fclk%3B214819441%3B36680237%3Bi)\n>"}