{"id": "14267", "subject": "Re: File uploading rules DO NOT UPLOAD WAV FILES", "author": "James W. Hyslope", "timestamp": "2009-05-14T00:05:51Z", "full_text": "Sorry, My bad. I uploaded many large wav files last night.\nI am new to this and I DIDN&#39;T read the STICKY. I did notice the 100mb\nlimit was near exceeded, but silly me thought that was MY personal limit (and I was scratching my head wondering how I already had 56%. Haha. Please try to contact me if I need to take down some of the files I uploaded. --- In EVP-ITC@yahoogroups.com, &quot;April Abercrombie&quot; &lt;april@...&gt; wrote:\n&gt;\n&gt; I haven&#39;t checked out how you have the group files set up, so maybe this suggestion won&#39;t help anything.\n&gt; \n&gt; Maybe you could set up and Member&#39;s EVP folder for people to upload their clips to with the understanding that their clips will only be stored temporarily. Then maybe monthly you could delete the old clips.\n&gt; \n&gt; The keepers like Stephan&#39;s could be stored in a different folder, maybe labeled &quot;Reference&quot;, or whatever.\n&gt; \n&gt; I think it is nice to have them handy on the group site for a while because links in posts get buried so quickly.\n&gt; \n&gt; April\n&gt; \n&gt; ----- Original Message ----- \n&gt;   From: Misty Dawn \n&gt;   To: EVP-ITC@yahoogroups.com \n&gt;   Sent: Wednesday, May 13, 2009 1:32 AM\n&gt;   Subject: Re: [EVP-ITC] Re: File uploading rules DO NOT UPLOAD WAV FILES\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;         If using esnips it has buddy list availability to add other members and you can post your link here when you update and upload new files.  The same goes for storing it on any other file share site. Just post a link and let us know when you upload new files. \n&gt; \n&gt;         I don&#39;t mean to seem anal but I just went thru and cleaned out all the wav files and that alone took up more than 40% of our groups total space. For instance one member has posted about 10 files in mp3 format which didnt even equal 1/4 of the space taken up by another members single wav format file. When it comes down to being 98% full you realize some changes have to be made and this is just one of the many changes this group has had to make to allow more members to join us and have fair access.\n&gt; \n&gt;         For those who are posting many files I suggest you do the same because eventually it will come down to one of the mods asking you to do so in order to clear some room. I like the idea of post now then remove after a time period but the truth is that some peoples files need to remain without restraint such as Stefans who has been more than generous to post some files which may come in very handy for some of you to experiment with using his EVPmaker software. These files are for the group as a whole to make use of and they will not be deleted. \n&gt; \n&gt;         That being said, ask for help when you need it and feel free to share with people using the best possible approach for the group as a whole rather than as an individual. When there were only 5 of us here it wasnt a big deal, but once you get past 500 it starts to take a toll and sacrifices must be made. Ive deleted alot of things I didnt wish to and had to ask alot of members who have been around a very long time to help clear some space and they did so willingly for the betterment of the group. They had some really great files too. Most now share them other ways including Sumption who started this group himself. \n&gt; \n&gt;         Misty\n&gt; \n&gt; \n&gt; \n&gt;         --- On Wed, 5/13/09, SnowfireL@... &lt;SnowfireL@...&gt; wrote:\n&gt; \n&gt; \n&gt;           From: SnowfireL@... &lt;SnowfireL@...&gt;\n&gt;           Subject: Re: [EVP-ITC] Re: File uploading rules DO NOT UPLOAD WAV FILES\n&gt;           To: EVP-ITC@yahoogroups.com\n&gt;           Date: Wednesday, May 13, 2009, 3:12 AM\n&gt; \n&gt; \n&gt;           I have a question, how does anyone know where to fine someone&#39;s files to hear them in esnips?  I can just keep them on my pc, or put them on the extra drive, or post then take them down each time, I&#39;ve been getting some really cool stuff, now, there was a really funny one, this lady&#39;s voice came on and says, &quot;are you ghost hunting.&quot; lol I told her yes, I need them volunteers to help me clean up this house. My ghosts so far are very nice, even one said &quot;i love you.&quot; that was sweet.  Love them too. &lt;s&gt;\n&gt; \n&gt;           In a message dated 5/13/2009 3:00:05 A.M. Eastern Daylight Time, bulletbabea@ yahoo.com writes:\n&gt; \n&gt; \n&gt; \n&gt;             LOL Snowfire! Nope it was not you this time. Others should read before they post because we just addressed this subject. Esnips is very easy to use it has two uploading options in case you cant use the java application use the single file uploader. Works a lot like email upload attachments.\n&gt; \n&gt;             If you need more help just holler and I am sure one of us will be more than willing to help you figure it out. Posting from email as an attachment also works just not so well for the very large file sizes. There are many other file sharing storage places besides esnips. We just like the layout there and the ability to share with friends including sharing storage space.\n&gt; \n&gt;             Misty\n&gt; \n&gt;             --- In EVP-ITC@yahoogroups .com, SnowfireL@ . wrote:\n&gt;             &gt;\n&gt;             &gt; Well, it is not me, I took out the folder, and I removed the files, I can&#39;t \n&gt;             &gt; figure out esnips, it says it will take lots of files at once but, it \n&gt;             &gt; never sends a connection, to upload anything.\n&gt;             &gt; \n&gt;             &gt; \n&gt;             &gt; In a message dated 5/13/2009 2:45:10 A.M. Eastern Daylight Time, \n&gt;             &gt; bulletbabea@ ... writes:\n&gt;             &gt; \n&gt;             &gt; \n&gt;             &gt; \n&gt;             &gt; \n&gt;             &gt; \n&gt;             &gt; Ok I am getting tired of having to say this especially twice in a couple \n&gt;             &gt; days. Do not upload wav format files if you feel you must share it in wav \n&gt;             &gt; format then use esnips or another file sharing source. If newbies cant follow \n&gt;             &gt; the groups rules then you will not be allowed to upload files period. \n&gt;             &gt; \n&gt;             &gt; Everything will be deleted and you may reupload in proper formats and \n&gt;             &gt; remember to respect the fact that this group of over 500 people has a limited \n&gt;             &gt; amoyunt of file sharing space on yahoo. Only 100 megs split between \n&gt;             &gt; everyone. that is why we work to get around our limitations by attaching files to \n&gt;             &gt; posts via email attachment or using _http://www.esnips. htt_ \n&gt;             &gt; (http://www.esnips. com/) etcetera.\n&gt;             &gt; \n&gt;             &gt; Misty\n&gt;             &gt; \n&gt;             &gt; \n&gt;             &gt; \n&gt;             &gt; \n&gt;             &gt; \n&gt;             &gt; ************ **Dell Mini Netbooks: Great deals starting at $299 after \n&gt;             &gt; instant savings! \n&gt;             &gt; (http://pr.atwola. com/promoclk/ 100126575x122197 2443x1201442012/ aol?redir= http:%2F% 2Fad.doubleclick .net%2Fclk% 3B214819441% 3B36680237% 3Bi)\n&gt;             &gt;\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; ----------------------------------------------------------------------\n&gt;           Dell Mini Netbooks: Great deals starting at $299 after instant savings!\n&gt;"}