{"id": "14275", "subject": "Re: Just wondering,", "author": "James W. Hyslope", "timestamp": "2009-05-14T18:04:17Z", "full_text": "I for one am new at this...but doesn&#39;t mean I take this field very lightly. I have recorded once (so far) in a Cemetery...and I took the whole idea &quot;seriously&quot;, and with RESPECT. I can say for a FACT--that the voices I receive are &quot;genuine&quot; and not audible before playback...that to me is more desirable (and credible) than some that take &quot;bits and pieces&quot; of a radio program to try and place the information into a &quot;question&quot; or &quot;answer&quot; then try and sell (my unique) way of reaching the unseen. And for the 2 weeks that I have been doing this...I seem to have gotten some amazing results with my &quot;recorder&quot; type technique.  I am getting playful spirits, sadness, needy voices, anger, laughter, my first name spoken, possibly contacted my mother twice (unless is a trickster spirit)...so to say &quot;someone&quot; does this in a form (that others don&#39;t approve)?? None of us are experts yet...so we will look for ANYTHING to try and find the correct &quot;angle&quot; that works for us :) Even if it includes an old Cemetery or working off the &quot;Broadcast Band Radio Waves&quot; to shack up some type of sentence. I don&#39;t know...who has more &quot;throw away&quot; audio?? I know ALL of my EVP is &quot;unique&quot;.....I for one have tried the &quot;radio&quot; type of EVP. I tried 2 Shack Mods...no joy here people. For me &quot;I saw it at face value&quot; after just a few minutes. I don&#39;t mean to offend. But I didn&#39;t step &quot;first&quot;. Now who can say (for certain) WHO has the better form? What ever gets us closer to ourselves, and our lost FRIEND&#39;S. That&#39;s ALL that matters man :) PS...I am a 46 year old male from Iowa. I have died and went to the tunnel (when I was 18)...was told &quot;not my time to go&quot; by a male voice that echoed (in the darkness). I have seen 3 UFO&#39;s in V formation (during Heavens Gate) *2nd comet of that year (here in Iowa) I have seen 1 &quot;shadow&quot; person (take 1 step and vanish) touched a ghost (snuck up on it)...got a burn on tip of my finger where I reached out to touch top of it&#39;s head (entity was small like child). I have developed 1 xray plate with my finger tips to make multiple white spots in the film-over 20 spots (naval medical officer was angry when he saw them) hahaha...he didn&#39;t know I did it when his back was turned :) Lot&#39;s of fun out here Guy&#39;s (and GALS) let&#39;s try and not point fingers now.....Knowbody should feel like they are singled out here...like I said &quot;none of us &quot;here&quot; have ALL the answers&quot;. So I&#39;m not a total &quot;Newbie&quot;...but I will try a grace yard again someday. And I would hope that people will respect me as well as I...of those IN that Grave Yard. --- In EVP-ITC@yahoogroups.com, &quot;April Abercrombie&quot; &lt;april@...&gt; wrote:\n&gt;\n&gt; Maybe some ghost hunters assume this, but not us ghost hunters who take our field very seriously.\n&gt; \n&gt;   ----- Original Message ----- \n&gt;   From: Frank Sumption \n&gt;   To: EVP-ITC@yahoogroups.com \n&gt;   Sent: Wednesday, May 13, 2009 7:15 PM\n&gt;   Subject: Re: [EVP-ITC] Just wondering,\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;    It&#39;s just an assumtption on most &quot;ghost hunters&quot; part that the dead would be where they died, or were burried, a Hollywoodism I think. I record in my basement. \n&gt; \n&gt;    F-S\n&gt; \n&gt; \n&gt;   On Wed, May 13, 2009 at 7:07 PM, &lt;SnowfireL@...&gt; wrote:\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;     I have a question, why is it that people are always going to grave yards, why would any spirit or ghost want to hang around in a place of so much sadness, when they&#39;ve got the whole universe to explore.  Why don&#39;t they go to some fun places?\n&gt; \n&gt;     In a message dated 5/13/2009 8:05:16 P.M. Eastern Daylight Time, EVP-ITC@yahoogroups.com writes:\n&gt; \n&gt; \n&gt; \n&gt; \n&gt;       Hello,\n&gt; \n&gt;       This email message is a notification to let you know that\n&gt;       a file has been uploaded to the Files area of the EVP-ITC \n&gt;       group.\n&gt; \n&gt;       File : /Jim&#39;s RR-DR60 EVP&#39;s/Something-Baby_evp.wav \n&gt;       Uploaded by : clockdryve &lt;clockdryve@...&gt; \n&gt;       Description : From a local grave yard. All I can understand is the word &quot;baby&quot; that is said 3 times. \n&gt; \n&gt;       You can access this file at the URL:\n&gt;       http://groups.yahoo.com/group/EVP-ITC/files/Jim%27s%20RR-DR60%20EVP%27s/Something-Baby_evp.wav \n&gt; \n&gt;       To learn more about file sharing for your group, please visit:\n&gt;       http://help.yahoo.com/l/us/yahoo/groups/original/members/web/index.htmlfiles\n&gt; \n&gt;       Regards,\n&gt; \n&gt;       clockdryve &lt;clockdryve@...&gt;\n&gt;"}