{"id": "14290", "subject": "Re: My EVP sessions", "author": "James W. Hyslope", "timestamp": "2009-05-15T04:36:09Z", "full_text": "Sorry, I see that I had a typo. I ment to say Sony B7 for the 2nd recorder that requires patch cable to upload to PC. I also FORGOT to mention. Everytime you plug this cable into your pc....you will get a popup, you want to click &quot;LINE IN&quot; as your choice. This must be done each time. Nothing is wrong with the way we are running this. It&#39;s just that that same area on PC can also be used as a microphone input (requires amplification) and by choosing LINE-IN your computer will set it&#39;s self up to attenuate (hope I spelled it correctly) this means it set&#39;s it&#39;s self to decrease the input slightly so you don&#39;t overdrive the soundcard. I use maximum volume control on my EVP recorder to the computer. Good Luck. Jim H--- In EVP-ITC@yahoogroups.com, &quot;James W. Hyslope&quot; &lt;clockdryve@...&gt; wrote:\n&gt;\n&gt; Hello, to help you with your uploading problems.....does your mini cassette recorder have a headphone connector plug? If so...go to radio shack and get the proper &quot;patch cable&quot; It more than likely will have 2 1/8 inch plugs, one on each end (take recorder with you to radio shack) depends if recorder outputs stereo to the actual specifications needed for your setup. But you will have a stereo plug at pc end.....connect the patch cable from cassette player (headphone out) to MICROPHONE input to PC. Then run any recorder type software you have on your computer (start pc recorder first) then push play on the micro cassette player. It takes awhile...but it will record in real time to PC&gt; That is what I have to do with my Panasonic RR-DR60 (digital) recorder and my Sony B& digital recorders....because they came out before USB was possible or popular. The old patch cable method still works with great audio :) Glad you have success with with high output EVP :) I have one that whistles very loud.....his second whistle isn&#39;t as noticable though. Have fun. {Post as soon as you can. Thanks. Jim H--- In EVP-ITC@yahoogroups.com, &quot;iankerry@&quot; &lt;ian.kerry3@&gt; wrote:\n&gt; &gt;\n&gt; &gt;  I have been experimenting with EVP for about a year now (in my home) and i have captured some brilliant evidence for survival.The first voice i captured was that of a little boy saying &#39;&#39;hello&#39;&#39;at 1.30 am.It was so clear that others could agree on and the voice could be still heard some fifteen feet away from the recorder.I have captured other voices too, just as impressive.Unfortunately i can&#39;t upload because my recorder is a micro cassette type.\n&gt; &gt;\n&gt;"}