{"id": "14298", "subject": "Re: [EVP-ITC] My EVP sessions", "author": "Zack Widup", "timestamp": "2009-05-15T15:43:50Z", "full_text": "One of the most fascinating ones I ever got was recorded in the ruins of a\nformer mental hospital. The building is shaped like an &quot;H&quot; and our group of\nabout 10 people was standing in one arm of the &quot;H&quot; looking through the\nwindows to the opposite arm. We saw a shadow moving around inside the\nbuilding in the other arm. We were just discussing this when a hoarse voice\ncame in THREE times on the recording and said &quot;It&#39;s Harold Wing.&quot; This voice\nwas not audible to our ears at the time of the investigation.\nLater on, one of the members of our group was able to access old records for\nthe mental hospital and found there was indeed a patient named Harold Wing\nwho died there of typhoid fever in 1936. There is no way any of us could&#39;ve\nknown that at the time and it&#39;s doubtful anyone living would&#39;ve known about\nit at the time, either.\n\nZack\n\n\nOn Fri, May 15, 2009 at 9:56 AM, Frank Sumption\n&lt;purplealiengirl@...&gt;wrote:\n\n&gt;\n&gt;\n&gt;  Playing acrh skeptic, what value is a voice for survival evidence if you\n&gt; don&#39;t know who it is? How do you know where it came from? Or can say beyond\n&gt; doubt that it&#39;s even &quot;paranormal&quot;? People have millions of these voices by\n&gt; now.\n&gt;\n&gt;  F-S\n&gt;\n&gt;  On Thu, May 14, 2009 at 10:12 PM, iankerry@... &lt;\n&gt; ian.kerry3@...&gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; I have been experimenting with EVP for about a year now (in my home) and i\n&gt;&gt; have captured some brilliant evidence for survival.The first voice i\n&gt;&gt; captured was that of a little boy saying &#39;&#39;hello&#39;&#39;at 1.30 am.It was so clear\n&gt;&gt; that others could agree on and the voice could be still heard some fifteen\n&gt;&gt; feet away from the recorder.I have captured other voices too, just as\n&gt;&gt; impressive.Unfortunately i can&#39;t upload because my recorder is a micro\n&gt;&gt; cassette type.\n&gt;&gt;\n&gt;&gt;\n&gt;  \n&gt;\n\nOne o he mos ascina ing ones I e e go was eco ded in he uins o  a o me  men al hospi al. The building is shaped like an \"H\" and ou g oup o abou 10 people was s anding in one a m o he \"H\" looking h ough he windows o he opposi e a m. We saw a shadow mo ing a ound inside he building in he o he a m. We we e jus discussing his when a hoa se oice came in THREE imes on he eco ding and said \"I 's Ha old Wing.\" This oice was no audible o ou ea s a he ime o he in es iga ion.\n\nLa e on, one o he membe s o ou g oup was able o access old eco ds o he men al hospi al and ound he e was indeed a pa ien named Ha old Wing who died he e o yphoid e e in 1936. The e is no way any o us could' e known ha a he ime and i 's doub ul anyone li ing would' e known abou i a he ime, ei he .\n\n \nZack\n \nOn F i, May 15, 2009 a 9:56 AM, F ank Sump ion pu plealiengi l@...> w o e:\n\n\n\n\n\n\nPlaying ac h skep ic, wha alue is a oice o su i al e idence i you don' know who i is? How do you know whe e i came om? O can say beyond doub ha i 's e en \"pa ano mal\"? People ha e millions o hese oices by now. \n\n \n F-S\n\nOn Thu, May 14, 2009 a 10:12 PM, ianke y@... ian.ke y3@...> w o e:\n\n\n\n\n\n\nI ha e been expe imen ing wi h EVP o abou a yea now (in my home) and i ha e cap u ed some b illian e idence o su i al.The i s oice i cap u ed was ha o a li le boy saying ''hello''a 1.30 am.I was so clea ha o he s could ag ee on and he oice could be s ill hea d some i een ee away om he eco de .I ha e cap u ed o he oices oo, jus as imp essi e.Un o una ely i can' upload because my eco de is a mic o casse e ype."}