{"id": "1429", "subject": "Re: New Files Uploaded to file section", "author": "Steve Hultay", "timestamp": "2007-06-21T22:34:23Z", "full_text": "Thanx Frank, it is a simple radio built with a FM chip.  My friend \nJoe built it for me.  The box doesn&#39;t have an echo box, but seems to \nwork.  I have 2 FM radios which are identical and a 3rd being built  \nbased off your schematics for comparison.  The guy building them is \na retired engineer who is loving these projects and i&#39;m loving using \nthem.  I just sit at home and get results.  It does take a little \ntime to acquire an ear for it, but once you stick with it you get \npositive results.  Joe Cioppi is the man behind the curtain of these \nsimple FM boxes, he&#39;s a member on here and i believe you e-mail him \non occasion.  He&#39;s a great guy and he&#39;s has good ideas.  I would \nlike to hear one of your boxes in action to compare the audio if you \nhave any audio clips i can hear.  My main e-mail is ( \nUrkel23@...m )  I&#39;ll keep posting more audio as i get it and \nthanx for the feedback, this is what i&#39;ve been waiting for and i \nappreciate it.\n\n-Steve Hultay\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;Frank Sumption&quot; &lt;franks-boxes@...&gt; \nwrote:\n&gt;\n&gt; This is great! I think it shows that it&#39;s the raw audio that \nmatters. To me \n&gt; there seems to be many that think my boxes are like somekind of \noracle or \n&gt; something, and they miss the fact that it&#39;s only supplying the raw \naudio for \n&gt; spirits to form their voices with. I don&#39;t want to cheapen the \nexperience, \n&gt; but I want to show that it is more of a science now, it&#39;s \nrepeatable, and \n&gt; other systems can be made that do the same thing. This FM scan \nmethod has \n&gt; the advantage of fewer parts, smaller boards, and seemingly easier \nto use. I \n&gt; think this system would be marketable.\n&gt; \n&gt; Thanks Steve for posting your voices!\n&gt; \n&gt; Frank\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; &gt;From: &quot;Steve Hultay&quot; &lt;urkel23@...&gt;\n&gt; &gt;Reply-To: EVP-ITC@yahoogroups.com\n&gt; &gt;To: EVP-ITC@yahoogroups.com\n&gt; &gt;Subject: [EVP-ITC] New Files Uploaded to file section\n&gt; &gt;Date: Thu, 21 Jun 2007 03:54:06 -0000\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;This was just sitting at home asking simple questions.\n&gt; &gt;\n&gt; \n&gt; _________________________________________________________________\n&gt; PC Magazine&#39;s 2007 editors&#39; choice for best Web mailaward-winning \nWindows \n&gt; Live Hotmail. \n&gt; http://imagine-windowslive.com/hotmail/?locale=en-\nus&ocid=TXT_TAGHM_migration_HM_mini_pcmag_0507\n&gt;"}