{"id": "14300", "subject": "Re: what you hear is what you get", "author": "Rick", "timestamp": "2009-05-15T16:04:26Z", "full_text": "I opened your folder and examined all your files.\n\nHere are my opinions (I have truncated the file names due to laziness):\n\nahh_mmm\tnoises, no speech\ncall_us\tnoises, no speech\ncal_us (enhanced)\tseveral listenings: pixelated, no speech\ncompare_panasonic\tnoises, no speech\ncompare_sony\tnoises, no speech\nfirst_epv\tnoises, no speech\ngood_whistle\tnoises, no speech (maybe feedback)\nhey_can\tnoises, no speech\nhey_whats\tnoises, no speech\nI_hit\tnoises, no speech\nimportant_date\tnoises, no speech\nkeep_moving\tseveral listenings: Hellalal see woobeh \nlaugh_evp\tnoises, no speech\nlets_wait\tseveral listenings: noises, no speech\nmaybe_gun\tnoises, no speech\nmiss_you\tnoises, no speech\nmy_question\tseveral listenings: no da lee\noh_\tnoises, no speech\nsomething\tseveral listenings: noises, no speech\nthat_mans\tnoises, no speech\nthat&#39;s_jim\tnoises, no speech\nthis_one\tseveral listenings: noises, no speech\ntomorrow\tnoises, no speech\n\n\nThe ones that took several listenings I thought I might hear words in, so I examined those several times.  Sometimes I could sort of hear something that sort of sounded like what you suggested, but I could also hear it in other ways, or not at all.\n\nSo my suggestion to you, if you want to get less subjective conjuctures or simply less affirmations of your own interpretations, is to post the future ones without labels.  The labels you give can influence the listeners: when you have a sound that could be several things, and you note that it sounded like &quot;keep it moving&quot;, the listener can find it nearly impossible to try NOT to hear what you heard, and so not be able to give a fresh perspecive to help your research methods.\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;James W. Hyslope&quot; &lt;clockdryve@...&gt; wrote:\n&gt;\n&gt; Go to my Folder in the files section &quot;Jim&#39;s RR-DR60 EVP&#39;s&quot; and see if anyone (needs to) decide &quot;FOR ME&quot; and let me know if I am of the serious type. In my short time I have gathered enough &quot;proof&quot; for myself that this method works for ME. And from what I have seen from others that I have let &quot;listen&quot; to my files (friends) I am blessed with the &quot;ability&quot; to HEAR very low audio artifacts....so this will help me in my RESEARCH. And I am OPEN to any help to reach my goals (or help others) with their goals. Have fun people. On a HAPPIER NOTE :) I was lucky enough to catch the RR-DR60 taking a nap yesterday....it missed a few evp&#39;s real close together (in a 5 second clip) the Sony ICD-B7 heard a male use a different number than what I used. I said 16 (my earlier age I was saying in recorder) and the male evp said 13....then a female laughs. All this was missed by the DR60 (except my 16 was recorded in both recorders) BUT then the DR60 &quot;caught&quot; the B7 &quot;napping&quot; at near the end of the 5 second clip....the DR60 heard &quot;let me out&quot; in a clear (quite) males voice. So this is very promising piece of evidence for me. **those 2 recordings have been uploaded to my folder. I will include an Olympus W-10 (soon as arrives), Panasonic RR-US360 (when I think to grab it) and my RR-QR80 to go with my RR-QR100, and one more (can&#39;t remember what brand-model of this last---due to arrive) LOL. I need to build a multiple mounting devise to aid in putting these into tandem service. Then I think I will use my Olympus DS-50 as my &quot;Control&quot; recorder....by using it on the HQ settings. I am looking to build a &quot;subsonic&quot; microphone also (something to do with those low &quot;booms&quot; that I have noticed lead or follow many evp&#39;s). So I look forward to any ideas. Falure is NOT an option. Haha.....\n&gt;"}