{"id": "14307", "subject": "Re: [EVP-ITC] Re: what you hear is what you get", "author": "Zack Widup", "timestamp": "2009-05-15T16:58:04Z", "full_text": "Yeah, what you hear is what you hear. What I hear is what I hear. If they&#39;re\ndifferent, no biggie to me.\n\nHaving spent hundreds of hours in a darkroom making fine-art prints, I see\nthings in photos that most people don&#39;t. That doesn&#39;t mean they aren&#39;t\nthere. And I never could figure out how those judges see all of that stuff\nin figure skaters&#39; performances that I don&#39;t see. But it doesn&#39;t upset me.\n:-)\n\nZack\n\nOn Fri, May 15, 2009 at 11:43 AM, Frank Sumption\n&lt;purplealiengirl@...&gt;wrote:\n\n&gt;\n&gt;\n&gt;   Soooo, everyone hears different, and personally I find it offensive when\n&gt; someone presumes to tell everyone what another researhcer&#39;s voices really\n&gt; say. I think EVP messages are for the one that recorded thmm, to everyone\n&gt; else it&#39;s non-sense, except there&#39;s enough to show that there is a\n&gt; phenomenon.\n&gt;\n&gt;  I get really tired of these self proclaimed experts trying to dicate\n&gt; what&#39;s acceptable.\n&gt;\n&gt;  Frank-S\n&gt;\n&gt;   On Fri, May 15, 2009 at 10:04 AM, Rick &lt;rasterer@...&gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; I opened your folder and examined all your files.\n&gt;&gt;\n&gt;&gt; Here are my opinions (I have truncated the file names due to laziness):\n&gt;&gt;\n&gt;&gt; ahh_mmm noises, no speech\n&gt;&gt; call_us noises, no speech\n&gt;&gt; cal_us (enhanced) several listenings: pixelated, no speech\n&gt;&gt; compare_panasonic noises, no speech\n&gt;&gt; compare_sony noises, no speech\n&gt;&gt; first_epv noises, no speech\n&gt;&gt; good_whistle noises, no speech (maybe feedback)\n&gt;&gt; hey_can noises, no speech\n&gt;&gt; hey_whats noises, no speech\n&gt;&gt; I_hit noises, no speech\n&gt;&gt; important_date noises, no speech\n&gt;&gt; keep_moving several listenings: Hellalal see woobeh\n&gt;&gt; laugh_evp noises, no speech\n&gt;&gt; lets_wait several listenings: noises, no speech\n&gt;&gt; maybe_gun noises, no speech\n&gt;&gt; miss_you noises, no speech\n&gt;&gt; my_question several listenings: no da lee\n&gt;&gt; oh_ noises, no speech\n&gt;&gt; something several listenings: noises, no speech\n&gt;&gt; that_mans noises, no speech\n&gt;&gt; that&#39;s_jim noises, no speech\n&gt;&gt; this_one several listenings: noises, no speech\n&gt;&gt; tomorrow noises, no speech\n&gt;&gt;\n&gt;&gt; The ones that took several listenings I thought I might hear words in, so\n&gt;&gt; I examined those several times. Sometimes I could sort of hear something\n&gt;&gt; that sort of sounded like what you suggested, but I could also hear it in\n&gt;&gt; other ways, or not at all.\n&gt;&gt;\n&gt;&gt; So my suggestion to you, if you want to get less subjective conjuctures or\n&gt;&gt; simply less affirmations of your own interpretations, is to post the future\n&gt;&gt; ones without labels. The labels you give can influence the listeners: when\n&gt;&gt; you have a sound that could be several things, and you note that it sounded\n&gt;&gt; like &quot;keep it moving&quot;, the listener can find it nearly impossible to try NOT\n&gt;&gt; to hear what you heard, and so not be able to give a fresh perspecive to\n&gt;&gt; help your research methods.\n&gt;&gt;\n&gt;&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, &quot;James W.\n&gt;&gt; Hyslope&quot; &lt;clockdryve@...&gt; wrote:\n&gt;&gt; &gt;\n&gt;&gt; &gt; Go to my Folder in the files section &quot;Jim&#39;s RR-DR60 EVP&#39;s&quot; and see if\n&gt;&gt; anyone (needs to) decide &quot;FOR ME&quot; and let me know if I am of the serious\n&gt;&gt; type. In my short time I have gathered enough &quot;proof&quot; for myself that this\n&gt;&gt; method works for ME. And from what I have seen from others that I have let\n&gt;&gt; &quot;listen&quot; to my files (friends) I am blessed with the &quot;ability&quot; to HEAR very\n&gt;&gt; low audio artifacts....so this will help me in my RESEARCH. And I am OPEN to\n&gt;&gt; any help to reach my goals (or help others) with their goals. Have fun\n&gt;&gt; people. On a HAPPIER NOTE :) I was lucky enough to catch the RR-DR60 taking\n&gt;&gt; a nap yesterday....it missed a few evp&#39;s real close together (in a 5 second\n&gt;&gt; clip) the Sony ICD-B7 heard a male use a different number than what I used.\n&gt;&gt; I said 16 (my earlier age I was saying in recorder) and the male evp said\n&gt;&gt; 13....then a female laughs. All this was missed by the DR60 (except my 16\n&gt;&gt; was recorded in both recorders) BUT then the DR60 &quot;caught&quot; the B7 &quot;napping&quot;\n&gt;&gt; at near the end of the 5 second clip....the DR60 heard &quot;let me out&quot; in a\n&gt;&gt; clear (quite) males voice. So this is very promising piece of evidence for\n&gt;&gt; me. **those 2 recordings have been uploaded to my folder. I will include an\n&gt;&gt; Olympus W-10 (soon as arrives), Panasonic RR-US360 (when I think to grab it)\n&gt;&gt; and my RR-QR80 to go with my RR-QR100, and one more (can&#39;t remember what\n&gt;&gt; brand-model of this last---due to arrive) LOL. I need to build a multiple\n&gt;&gt; mounting devise to aid in putting these into tandem service. Then I think I\n&gt;&gt; will use my Olympus DS-50 as my &quot;Control&quot; recorder....by using it on the HQ\n&gt;&gt; settings. I am looking to build a &quot;subsonic&quot; microphone also (something to\n&gt;&gt; do with those low &quot;booms&quot; that I have noticed lead or follow many evp&#39;s). So\n&gt;&gt; I look forward to any ideas. Falure is NOT an option. Haha.....\n&gt;&gt; &gt;\n&gt;&gt;\n&gt;&gt;\n&gt;  \n&gt;\n\nYeah, wha you hea is wha you hea . Wha I hea is wha I hea . I hey' e di e en , no biggie o me.\n \nHa ing spen hund eds o hou s in a da k oom making ine-a p in s, I see hings in pho os ha mos people don' . Tha doesn' mean hey a en' he e. And I ne e could igu e ou how hose judges see all o ha s u in igu e ska e s' pe o mances ha I don' see. Bu i doesn' upse me.\n\n:-)\n \nZack\nOn F i, May 15, 2009 a 11:43 AM, F ank Sump ion pu plealiengi l@...> w o e:\n\n\n\n\n\n\n Soooo, e e yone hea s di e en , and pe sonally I ind i o ensi e when someone p esumes o ell e e yone wha ano he esea hce 's oices eally say. I hink EVP messages a e o he one ha eco ded hmm, o e e yone else i 's non-sense, excep he e's enough o show ha he e is a phenomenon. \n\n \n I ge eally i ed o hese sel p oclaimed expe s ying o dica e wha 's accep able.\n \n F ank-S\n\n\n\nOn F i, May 15, 2009 a 10:04 AM, Rick as e e @...> w o e:\n\n\n\n\n\nI opened you olde and examined all you iles.He e a e my opinions (I ha e unca ed he ile names due o laziness):ahh_mmm noises, no speechcall_us noises, no speechcal_us (enhanced) se e al lis enings: pixela ed, no speech\ncompa e_panasonic noises, no speechcompa e_sony noises, no speech i s _ep noises, no speechgood_whis le noises, no speech (maybe eedback)hey_can noises, no speechhey_wha s noises, no speechI_hi noises, no speech\nimpo an _da e noises, no speechkeep_mo ing se e al lis enings: Hellalal see woobeh laugh_e p noises, no speechle s_wai se e al lis enings: noises, no speechmaybe_gun noises, no speechmiss_you noises, no speech\nmy_ques ion se e al lis enings: no da leeoh_ noises, no speechsome hing se e al lis enings: noises, no speech ha _mans noises, no speech ha 's_jim noises, no speech his_one se e al lis enings: noises, no speech\n omo ow noises, no speechThe ones ha ook se e al lis enings I hough I migh hea wo ds in, so I examined hose se e al imes. Some imes I could so o hea some hing ha so o sounded like wha you sugges ed, bu I could also hea i in o he ways, o no a all.\nSo my sugges ion o you, i you wan o ge less subjec i e conjuc u es o simply less a i ma ions o you own in e p e a ions, is o pos he u u e ones wi hou labels. The labels you gi e can in luence he lis ene s: when you ha e a sound ha could be se e al hings, and you no e ha i sounded like \"keep i mo ing\", he lis ene can ind i nea ly impossible o y NOT o hea wha you hea d, and so no be able o gi e a esh pe speci e o help you esea ch me hods. \n--- In EVP-ITC@yahoog oups.com, \"James W. Hyslope\" w o e:>> Go o my Folde in he iles sec ion \"Jim's RR-DR60 EVP's\" and see i anyone (needs o) decide \"FOR ME\" and le me know i I am o he se ious ype. In my sho ime I ha e ga he ed enough \"p oo \" o mysel ha his me hod wo ks o ME. And om wha I ha e seen om o he s ha I ha e le \"lis en\" o my iles ( iends) I am blessed wi h he \"abili y\" o HEAR e y low audio a i ac s....so his will help me in my RESEARCH. And I am OPEN o any help o each my goals (o help o he s) wi h hei goals. Ha e un people. On a HAPPIER NOTE :) I was lucky enough o ca ch he RR-DR60 aking a nap yes e day....i missed a ew e p's eal close oge he (in a 5 second clip) he Sony ICD-B7 hea d a male use a di e en numbe han wha I used. I said 16 (my ea lie age I was saying in eco de ) and he male e p said 13.... hen a emale laughs. All his was missed by he DR60 (excep my 16 was eco ded in bo h eco de s) BUT hen he DR60 \"caugh \" he B7 \"napping\" a nea he end o he 5 second clip.... he DR60 hea d \"le me ou \" in a clea (qui e) males oice. So his is e y p omising piece o e idence o me. ** hose 2 eco dings ha e been uploaded o my olde . I will include an Olympus W-10 (soon as a i es), Panasonic RR-US360 (when I hink o g ab i ) and my RR-QR80 o go wi h my RR-QR100, and one mo e (can' emembe wha b and-model o his las ---due o a i e) LOL. I need o build a mul iple moun ing de ise o aid in pu ing hese in o andem se ice. Then I hink I will use my Olympus DS-50 as my \"Con ol\" eco de ....by using i on he HQ se ings. I am looking o build a \"subsonic\" mic ophone also (some hing o do wi h hose low \"booms\" ha I ha e no iced lead o ollow many e p's). So I look o wa d o any ideas. Falu e is NOT an op ion. Haha.....\n>"}