{"id": "14312", "subject": "Re: what you hear is what you get", "author": "James W. Hyslope", "timestamp": "2009-05-15T18:17:06Z", "full_text": "K, the one with 1927 in it is truly way down in with the static. I tried to let guys here at work listen to it. But they couldn&#39;t hear it either. I also was having trouble hearing it this morning. I have a different &quot;clean&quot; version (by it&#39;s self) without my talking to verify it&#39;s reason....but didn&#39;t upload it for that reason. Sometimes it is a good idea to download these files and use a program to &quot;loop&quot; the audio. I have a simple free download from somewhere that I am able to adjust the start and stop of the continual looping on the recording. The program is called VLC MEDIA PLAYER. Be careful, it wants to set itself to be defaults in may areas. But is great for adjusting the loop pattern to exactly where you need. I am not at my laptop right now, or I would try to send the filtered 1927. In EVP-ITC@yahoogroups.com, SnowfireL@... wrote:\n&gt;\n&gt; Maybe something&#39;s wrong with the recordings or for some reason they just  \n&gt; aren&#39;t picking up what that person is hearing, because I was not able to hear \n&gt;  anything either, that why I asked about the one with the 1927 year it in, \n&gt; but I  didn&#39;t hear anything. sf\n&gt;  \n&gt;  \n&gt; In a message dated 5/15/2009 12:16:21 P.M. Eastern Daylight Time,  \n&gt; april@... writes:\n&gt; \n&gt;  \n&gt;  \n&gt; \n&gt; \n&gt; James, Unfortunately I didn&#39;t hear what  you are hearing in these either. \n&gt; My results are pretty much the same as Ricks.  In a few instances, I could \n&gt; hear something, but not sure what it was, not even  sure if it was a voice or \n&gt; just a noise or artifact from too much  &quot;enhancing&quot;.\n&gt;  \n&gt; I am not going to say that you definitely  don&#39;t have anything in your \n&gt; recordings, but I can&#39;t say you have anything  either.\n&gt;  \n&gt; \n&gt; ----- Original Message ----- \n&gt; From: _Rick_ (mailto:rasterer@...)   \n&gt; To: _EVP-ITC@yahoogroupsEVP-_ (mailto:EVP-ITC@yahoogroups.com)  \n&gt; Sent: Friday, May 15, 2009 10:04  AM\n&gt; Subject: [EVP-ITC] Re: what you hear is  what you get\n&gt; \n&gt; \n&gt; \n&gt; I opened your folder and examined all your files.\n&gt; \n&gt; Here are my  opinions (I have truncated the file names due to laziness):\n&gt; \n&gt; ahh_mmm  noises, no speech\n&gt; call_us noises, no speech\n&gt; cal_us (enhanced) several  listenings: pixelated, no speech\n&gt; compare_panasonic noises, no  speech\n&gt; compare_sony noises, no speech\n&gt; first_epv noises, no  speech\n&gt; good_whistle noises, no speech (maybe feedback)\n&gt; hey_can noises,  no speech\n&gt; hey_whats noises, no speech\n&gt; I_hit noises, no  speech\n&gt; important_date noises, no speech\n&gt; keep_moving several  listenings: Hellalal see woobeh \n&gt; laugh_evp noises, no speech\n&gt; lets_wait  several listenings: noises, no speech\n&gt; maybe_gun noises, no  speech\n&gt; miss_you noises, no speech\n&gt; my_question several listenings: no  da lee\n&gt; oh_ noises, no speech\n&gt; something several listenings: noises, no  speech\n&gt; that_mans noises, no speech\n&gt; that&#39;s_jim noises, no  speech\n&gt; this_one several listenings: noises, no speech\n&gt; tomorrow noises,  no speech\n&gt; \n&gt; The ones that took several listenings I thought I might  hear words in, so \n&gt; I examined those several times. Sometimes I could sort of  hear something \n&gt; that sort of sounded like what you suggested, but I could  also hear it in \n&gt; other ways, or not at all.\n&gt; \n&gt; So my suggestion to you,  if you want to get less subjective conjuctures or \n&gt; simply less affirmations  of your own interpretations, is to post the \n&gt; future ones without labels. The  labels you give can influence the listeners: \n&gt; when you have a sound that  could be several things, and you note that it \n&gt; sounded like &quot;keep it moving&quot;,  the listener can find it nearly impossible to try \n&gt; NOT to hear what you  heard, and so not be able to give a fresh perspecive \n&gt; to help your research  methods.\n&gt; \n&gt; --- In _EVP-ITC@yahoogroupsEVP-_ (mailto:EVP-ITC@yahoogroups.com) ,  &quot;James \n&gt; W. Hyslope&quot; &lt;clockdryve@clo&gt; wrote:\n&gt; &gt;\n&gt; &gt; Go to  my Folder in the files section &quot;Jim&#39;s RR-DR60 EVP&#39;s&quot; and see if \n&gt; anyone  (needs to) decide &quot;FOR ME&quot; and let me know if I am of the serious \n&gt; type. In  my short time I have gathered enough &quot;proof&quot; for myself that this \n&gt; method  works for ME. And from what I have seen from others that I have let \n&gt; &quot;listen&quot;  to my files (friends) I am blessed with the &quot;ability&quot; to HEAR very low \n&gt; audio  artifacts... Go to  my Folder in the files section &quot;Jim&#39;s RR-DR60 \n&gt; EVP&#39;s&quot; and see if anyone  (needs to) decide &quot;FOR ME&quot; and let me know if I am \n&gt; of the serious type. In  my short time I have gathered enough &quot;proof&quot; for \n&gt; myself that this m Go to  my Folder in the files section &quot;Jim&#39;s RR-DR60 EVP&#39;s&quot; \n&gt; and see if anyone  (needs to) decide &quot;FOR ME&quot; and let me know if I am of the \n&gt; serious type. In  my short time I have gathered enough &quot;proof&quot; for myself \n&gt; that this method  works for ME. And from what I have seen from others that I \n&gt; have let &quot;listen&quot;  to my files (friends) I am blessed with the &quot;ability&quot; to \n&gt; HEAR very low audio  artifacts...&lt;WBR&gt;.so this will help me in my RESEARCH. \n&gt; And I am OPEN to any  help to reach my goals (or help others) with their \n&gt; goals. Have fun people.  On a HAPPIER NOTE :) I was lucky enough to catch the \n&gt; RR-DR60 taking a nap  yesterday...&lt;WBR&gt;.it missed a few evp&#39;s real close \n&gt; together (in a 5 second  clip) the Sony ICD-B7 heard a male use a different \n&gt; number than what I used.  I said 16 (my earlier age I was saying in recorder) \n&gt; and the male evp said  13....then a female laughs. All this was missed by the \n&gt; DR60 (except my 16  was recorded in both recor Go to  my Folder in the files \n&gt; section &quot;Jim&#39;s RR-DR60 EVP&#39;s&quot; and see if anyone  (needs to) decide &quot;FOR ME&quot; \n&gt; and let me know if I am of the serious type. In  my short time I have \n&gt; gathered enough &quot;proof&quot; for myself that this method  works for M\n&gt; &gt;\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; **************An Excellent Credit Score is 750. See Yours in Just 2 Easy \n&gt; Steps! \n&gt; (http://pr.atwola.com/promoclk/100126575x1221823239x1201398650/aol?redir=http://www.freecreditreport.com/pm/default.aspx?sc=668072&hmpgID=62&bcd=May\n&gt; Excfooter51509NO62)\n&gt;"}