{"id": "14317", "subject": "Re: Chris Moon and Frank together?", "author": "Rick", "timestamp": "2009-05-15T18:56:39Z", "full_text": "I&#39;m sorry if I hit some kind of nerve, but it was really just a simple question, and I&#39;m sure you can understand why the rumor would arouse curiosity.  There&#39;s no need to head anything off on my account, and as you said, he can speak for himself if he likes.  Though, because of the tone of your response, I hope he does address it now, to clear up any ideas which your reaction might have engendered.\n\n\n--- In EVP-ITC@yahoogroups.com, Frank Ratka &lt;warrior18eii@...&gt; wrote:\n&gt;\n&gt; Look guys don&#39;t read anything into it. Frank and Chris have had a &quot;on again, off again&quot; relationship as long as they have known each other. I normally don&#39;t speak up for Sumption, he is quite capable of speaking for himself but I thought I would head this off before imaginations got away from you all. \n&gt; \n&gt; If he wants you to know his business he will let you know. I feel you overstep your bounds to expect an explanation.\n&gt; \n&gt; Regards,\n&gt; \n&gt; Frank R.\n&gt; \n&gt; --- On Fri, 5/15/09, Fransen, Debbie &lt;debbie.fransen@...&gt; wrote:\n&gt; \n&gt; \n&gt; From: Fransen, Debbie &lt;debbie.fransen@...&gt;\n&gt; Subject: RE: [EVP-ITC] Chris Moon and Frank together?\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Friday, May 15, 2009, 1:33 PM\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Oh, now I get it Frank !!!!! This is why you were sticking up for him......\n&gt; Hope this means that you are going to hop on the money train with him.\n&gt; AT least you deserve it...\n&gt; \n&gt; \n&gt; \n&gt; From: EVP-ITC@yahoogroups .com [mailto:EVP- ITC@yahoogroups. com] On Behalf Of Rick\n&gt; Sent: Friday, May 15, 2009 2:28 PM\n&gt; To: EVP-ITC@yahoogroups .com\n&gt; Subject: [EVP-ITC] Chris Moon and Frank together?\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; I noticed on Chris Moon&#39;s Myspace blog he posted:\n&gt; \n&gt; &quot;People also have a misconception that Mr. Sumption and I are at war which is not true. As a matter of fact we have tentative plans for a joint research project this fall.&quot;\n&gt; \n&gt; Maybe Frank could shed some more light on this partnership?\n&gt;"}