{"id": "14334", "subject": "Re: what you hear is what you get", "author": "James W. Hyslope", "timestamp": "2009-05-16T04:12:36Z", "full_text": "These  answers today (strong) are they from recorder or Box? It has been raining off and on here in Des Moines, Iowa today. Might slip outside in a few minutes to check em out. -- In EVP-ITC@yahoogroups.com, SnowfireL@... wrote:\n&gt;\n&gt; Well, in that last 5.5 minute tape I made, i asked What&#39;s this animal  \n&gt; called, they someone answered, then I asked what color is my shirt, they  \n&gt; answered, they are very strong today\n&gt;  \n&gt;  \n&gt; In a message dated 5/15/2009 5:41:03 P.M. Eastern Daylight Time,  \n&gt; Threadsintyme@... writes:\n&gt; \n&gt;  \n&gt;  \n&gt; \n&gt; \n&gt; It might just make a difference if we knew what shape dem ears of yurns&#39;  \n&gt; are! LOL\n&gt; Al\n&gt; ---------- Original Message ----------\n&gt; From: &quot;April  Abercrombie&quot; &lt;april@abercrombieghapril@abercrapr&gt;\n&gt; To:  &lt;EVP-ITC@yahoogroupsEVP-&gt;\n&gt; Subject: Re: [EVP-ITC] Re: what you  hear is what you get\n&gt; Date: Fri, 15 May 2009 14:20:30 -0600\n&gt; \n&gt; \n&gt; LOL!\n&gt;  \n&gt; \n&gt; ----- Original Message ----- \n&gt; From: _Frank Sumption_ (mailto:purplealiengirl@...)  \n&gt; To: _EVP-ITC@yahoogroupsEVP-_ (mailto:EVP-ITC@yahoogroups.com)  \n&gt; Sent: Friday, May 15, 2009 2:14  PM\n&gt; Subject: Re: [EVP-ITC] Re: what you  hear is what you get\n&gt; \n&gt; \n&gt; \n&gt; I always listen to EVP wiht my ears!--I know--alien humor.\n&gt; \n&gt; On Fri, May 15, 2009 at 1:24 PM, April Abercrombie  \n&gt; &lt;_april@abercrombieghapril@abercrapr_ (mailto:april@...) &gt;  wrote:\n&gt; \n&gt; \n&gt;  \n&gt;  \n&gt; \n&gt; \n&gt; I always listen to EVP&#39;s with high  quality headphones.\n&gt;  \n&gt; In the &quot;tomorrow let you know&quot;  EVP, I do hear something...know&quot; can&#39;t be \n&gt; sure that it is a  voice. I does have a cadence similar to someone speaking, \n&gt; but it  could just as easily be something present in the environment-it  \n&gt; could just as easily be something present in the environment-&lt;WBR&gt;a  na it is \n&gt; just too feint. I can&#39;t make out any clear words. Sure-I  could probably \n&gt; matrix some in, but that is all it would be.\n&gt;  \n&gt; For an EVP to be considered proof  positive of spirit communication by the \n&gt; community at large, it has to be  clear enough that many people hear the \n&gt; same thing, without hints or  coaxing. If you have to have high quality devices \n&gt; to make it  out, it just isn&#39;t good enough. That does not mean it isn&#39;t a \n&gt; true EVP,  just that it isn&#39;t good enough to stand as evidence.\n&gt;  \n&gt; As for the whistle, it sounded like  feedback to me as well, but I will \n&gt; have to take you word for it that you  were no where near any other electronics \n&gt; or EMF&#39;s that could contribute to  feedback. Even so, if I am trying to \n&gt; remain unbiased and  objective, there is no way for me to say this is a spirit, \n&gt; without  personally being with you when you caught it. The only thing I can \n&gt; still  say about it is could be, but for me it is non conclusive.\n&gt;  \n&gt; If someone does not hear what you are  hearing, try to remain objective and \n&gt; just understand that it isn&#39;t  personal. You have to understand that with \n&gt; just these recordings alone,  there is no way to scientifically prove what \n&gt; you have recorded is  spirit communication. If you could get consistent, \n&gt; intelligent  question and answer recordings, then you would be alot  closer.\n&gt;  \n&gt; Here again, we are back to the &quot;So  what?&quot; thing. You don&#39;t HAVE to prove \n&gt; anything scientifically, unless you  want others to completely believe in \n&gt; your evidence.\n&gt;  \n&gt; The theory that is being kicked around  is that some EVP&#39;s are personal, \n&gt; and only meant for the person  recording them to hear. If this is the case, no \n&gt; matter how clear  something is to you, others may not hear it.\n&gt;  \n&gt; April\n&gt;  \n&gt;  \n&gt; \n&gt;  \n&gt; ----- Original Message ----- \n&gt; From: _James W. Hyslope_ (mailto:clockdryve@...)  \n&gt; To: _EVP-ITC@yahoogroupsEVP-_ (mailto:EVP-ITC@yahoogroups.com)  \n&gt; \n&gt;  \n&gt; \n&gt;  \n&gt; Sent: Friday, May 15, 2009 12:02  PM\n&gt; Subject: [EVP-ITC] Re: what you  hear is what you get\n&gt; \n&gt; \n&gt; \n&gt; Okay, I can respect that. If you can&#39;t hear them then it must be  either \n&gt; mechanical (sound card or headphones)or maybe your hearing has  loss in those \n&gt; frequencies.Okay, I can respect that. If you can&#39;t hear them then it must be \n&gt;  either mechanical (sound card or headpho&  your headphones. I have let an \n&gt; older man listen (in his late 60&#39;s) and  he has heard most all of the audio. \n&gt; Same with a few guys at work. Some  hear them right away, and others can&#39;t \n&gt; until I loop the actually EVP for  a few tries. I personally use a Dell \n&gt; Latitude D430 to hear these. I can  hear some on my cell phone. Headphones are a \n&gt; must....or you won&#39;t hear  anything either way. *But some can be heard on \n&gt; cell phone without  headphones. The conversion to MP3 has also caused some \n&gt; loss, but I am  still able to hear them when I review from this site (but I \n&gt; have the  repetive hearing syndrome in this area no doubt). Although I do have \n&gt;  some disbelief (shock) that a few of these are not discernable. Go back  \n&gt; and listen to &quot;tomorrow let you know&quot; is in a gruffy-robotic melodic  tone at \n&gt; the very end but with higher natural volume. And if you couldn&#39;t  hear the \n&gt; whistle...I would suggest the need to remove the cotton from  the ear :) As \n&gt; for feedback....      repetive hearing syndrome in this area no doubt). \n&gt; Although I do have  some disbelief (shock) that a few of these are not \n&gt; discernable. Go back  and listen to &quot;tomorrow let you know&quot; is in a gruffy-robotic \n&gt; melodic  tone at the very end but with higher natural volume. And if you \n&gt; couldn&#39;t  hear the whistle...I would suggest the need to remove the cotton from  \n&gt; the ear :) As for feedback....&lt;WBR&gt;.feedb_EVP-ITC@yahoogroupsEVP-_ \n&gt; (mailto:EVP-ITC@yahoogroups.com) , &quot;April Abercrombie&quot;  &lt;april@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Here&#39;s the thing though - if  you put something out there, and ask people \n&gt; to listen to it, your  inviting opinions. Some will be in agreement, and \n&gt; some won&#39;t, no matter  what.\n&gt; &gt; \n&gt; &gt; If EVP messages are for the one that recorded  them, then it shouldn&#39;t \n&gt; surprise you , or offend you, if someone doesn&#39;t  hear the same thing you do. \n&gt; If you don&#39;t want contrary opinions on  something, then you should not give \n&gt; people the chance to  critique.\n&gt; &gt; \n&gt; &gt; Now I could see if someone flat out said your  recordings were all trash, \n&gt; period. You would have every right to be  angry, but no one is saying that, \n&gt; at least I am not saying that.\n&gt; &gt;  \n&gt; &gt; I just stated that I did not hear what James heard, and though  I wasn&#39;t \n&gt; going to say he doesn&#39;t have anything, I can&#39;t say that he does  either.\n&gt; &gt; \n&gt; &gt; ----- Original Message ----- \n&gt; &gt; From:  Frank Sumption \n&gt; &gt; To: _EVP-ITC@yahoogroupsEVP-_ (mailto:EVP-ITC@yahoogroups.com)  \n&gt; &gt; Sent: Friday,  May 15, 2009 11:00 AM\n&gt; &gt; Subject: Re: [EVP-ITC] Re: what you hear  is what you get\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt;  \n&gt; &gt; Yeah, and we&#39;ve all heard the thing about opinions.\n&gt; &gt;  \n&gt; &gt; F-s\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; On Fri, May 15, 2009 at 10:53 AM,  April Abercrombie &lt;april@&gt; wrote:\n&gt; &gt; \n&gt; &gt; \n&gt; &gt;  \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; Noone is saying what they hear is law, just  their opinion.\n&gt; &gt; \n&gt; &gt; ----- Original Message ----- \n&gt; &gt;  From: Frank Sumption \n&gt; &gt; To: _EVP-ITC@yahoogroupsEVP-_ (mailto:EVP-ITC@yahoogroups.com)  \n&gt; &gt; Sent: Friday,  May 15, 2009 10:43 AM\n&gt; &gt; Subject: Re: [EVP-ITC] Re: what you hear  is what you get\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; Soooo, everyone hears  different, and personally I find it offensive when \n&gt; someone presumes to  tell everyone what another researhcer&#39;s voices really \n&gt; say. I think EVP  messages are for the one that recorded thmm, to everyone \n&gt; else it&#39;s  non-sense, except there&#39;s enough to show that there is a \n&gt; phenomenon.  \n&gt; &gt; \n&gt; &gt; I get really tired of these self proclaimed experts  trying to dicate \n&gt; what&#39;s acceptable.\n&gt; &gt; \n&gt; &gt; Frank-S\n&gt; &gt;  \n&gt; &gt; \n&gt; &gt; On Fri, May 15, 2009 at 10:04 AM, Rick  &lt;rasterer@&gt; wrote:\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt;  I opened your folder and examined all your files.\n&gt; &gt; \n&gt; &gt; Here  are my opinions (I have truncated the file names due to  laziness):\n&gt; &gt; \n&gt; &gt; ahh_mmm noises, no speech\n&gt; &gt; call_us  noises, no speech\n&gt; &gt; cal_us (enhanced) several listenings:  pixelated, no speech\n&gt; &gt; compare_panasonic noises, no speech\n&gt; &gt;  compare_sony noises, no speech\n&gt; &gt; first_epv noises, no  speech\n&gt; &gt; good_whistle noises, no speech (maybe feedback)\n&gt; &gt;  hey_can noises, no speech\n&gt; &gt; hey_whats noises, no speech\n&gt; &gt;  I_hit noises, no speech\n&gt; &gt; important_date noises, no speech\n&gt; &gt;  keep_moving several listenings: Hellalal see woobeh \n&gt; &gt; laugh_evp  noises, no speech\n&gt; &gt; lets_wait several listenings: noises, no  speech\n&gt; &gt; maybe_gun noises, no speech\n&gt; &gt; miss_you noises, no  speech\n&gt; &gt; my_question several listenings: no da lee\n&gt; &gt; oh_  noises, no speech\n&gt; &gt; something several listenings: noises, no  speech\n&gt; &gt; that_mans noises, no speech\n&gt; &gt; that&#39;s_jim noises, no  speech\n&gt; &gt; this_one several listenings: noises, no speech\n&gt; &gt;  tomorrow noises, no speech\n&gt; &gt; \n&gt; &gt; The ones that took several  listenings I thought I might hear words in, \n&gt; so I examined those several  times. Sometimes I could sort of hear something \n&gt; that sort of sounded  like what you suggested, but I could also hear it in \n&gt; other ways, or not  at all.\n&gt; &gt; \n&gt; &gt; So my suggestion to you, if you want to get  less subjective conjuctures \n&gt; or simply less affirmations of your own  interpretations, is to post the \n&gt; future ones without labels. The labels  you give can influence the listeners: \n&gt; when you have a sound that could  be several things, and you note that it \n&gt; sounded like &quot;keep it moving&quot;,  the listener can find it nearly impossible to \n&gt; try NOT to hear what you  heard, and so not be able to give a fresh \n&gt; perspecive to help your  research methods. \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; --- In _EVP-ITC@yahoogroupsEVP-_ (mailto:EVP-ITC@yahoogroups.com) , \n&gt; &quot;James W. Hyslope&quot;  &lt;clockdryve@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; Go to my Folder in  the files section &quot;Jim&#39;s RR-DR60 EVP&#39;s&quot; and see if \n&gt; anyone (needs to)  decide &quot;FOR ME&quot; and let me know if I am of the serious \n&gt; type. In my short  time I have gathered enough &quot;proof&quot; for myself that this \n&gt; method works  for ME. And from what I have seen from others that I have let \n&gt; &quot;listen&quot;  to my files (friends) I am blessed with the &quot;ability&quot; to HEAR very \n&gt; low  audio artifacts... Go to my Folder in  the files section &quot;Jim&#39;s RR-DR60 \n&gt; EVP&#39;s&quot; and see if anyone (needs to)  decide &quot;FOR ME&quot; and let me know if I am \n&gt; of the serious type. In my short  time I have gathered enough &quot;proof&quot; for \n&gt; myself that this m Go to my Folder in  the files section &quot;Jim&#39;s RR-DR60 \n&gt; EVP&#39;s&quot; and see if anyone (needs to)  decide &quot;FOR ME&quot; and let me know if I am of \n&gt; the serious type. In my short  time I have gathered enough &quot;proof&quot; for myself \n&gt; that this method works  for ME. And from what I have seen from others that \n&gt; I have let &quot;listen&quot;  to my files (friends) I am blessed with the &quot;ability&quot; \n&gt; to HEAR very low  audio artifacts...&lt;WBR&gt;.so this will help me in my \n&gt; RESEARCH. And I am  OPEN to any help to reach my goals (or help others) with their \n&gt; goals.  Have fun people. On a HAPPIER NOTE :) I was lucky enough to catch the \n&gt;  RR-DR60 taking a nap yesterday...&lt;WBR&gt;.it missed a few evp&#39;s real close  \n&gt; together (in a 5 second clip) the Sony ICD-B7 heard a male use a  different \n&gt; number than what I used. I said 16 (my earlier age I was  saying in recorder) \n&gt; and the male evp said 13....then a female laughs.  All this was missed by \n&gt; the DR60 (except my 16 was recorded in both  recorders)  Go to my Folder in  \n&gt; the files section &quot;Jim&#39;s RR-DR60 EVP&#39;s&quot; andic&quot; microphone also (something to \n&gt; do with those low &quot;booms&quot; that  I have noticed lead or follow many evp&#39;s). \n&gt; So I look forward to any  ideas. Falure is NOT an option. Haha.....\n&gt; &gt;  &gt;\n&gt; &gt;\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; _Get a life insurance quote online. Click to compare rates and  save._ \n&gt; (http://thirdpartyoffers.juno.com/TGL2132/fc/BLSrjnsO5FvcQEXNXgk4uOkJeADoCsfrcSrv\n&gt; gCffVDCom2b66SZm6pozw5q/) \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; **************An Excellent Credit Score is 750. See Yours in Just 2 Easy \n&gt; Steps! \n&gt; (http://pr.atwola.com/promoclk/100126575x1221823239x1201398650/aol?redir=http://www.freecreditreport.com/pm/default.aspx?sc=668072&hmpgID=62&bcd=May\n&gt; Excfooter51509NO62)\n&gt;"}