{"id": "14343", "subject": "Re: what you hear is what you get", "author": "James W. Hyslope", "timestamp": "2009-05-16T13:54:37Z", "full_text": "April, you seem like such a nice person:) If I had your address I would SEND you a pair of the Numark 125 headphones. Just because ypu do listen and are not &quot;set&quot; in your ways. Good luck always. Jim H--- In EVP-ITC@yahoogroups.com, &quot;April Abercrombie&quot; &lt;april@...&gt; wrote:\n&gt;\n&gt; I am always happy to listen, whether I can hear it or not. :)\n&gt; \n&gt;   ----- Original Message ----- \n&gt;   From: James W. Hyslope \n&gt;   To: EVP-ITC@yahoogroups.com \n&gt;   Sent: Friday, May 15, 2009 9:35 PM\n&gt;   Subject: [EVP-ITC] Re: what you hear is what you get\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;   Yes April, I have the same belief as you.....if EVP&#39;s are of the personal nature, no matter if they yell into the microphone....if you are not the intended receiver you will NEVER hear or understand it. I do know my EVP&#39;s are very LOW audio. I need to work with that and AMP them I guess. In some recordings (1927 is one of them) I can&#39;t hear the voice sometimes, that is how low it is. But tonight I finished my comparison recorder evaluations (ran 3 recorders that night) my Sony ICD B7 also heard the date. The Panasonic RR-US360 could not hear it. I will upload a GET-OUT evp that the RR-DR60 only heard too. Was recorded same time as the asking of date.As for &quot;what kind of ears I have&quot; :) I do have pretty good hearing (but have some loss in certain areas) maybe my losses are closer to the static&#39;s level and I am helped there....I don&#39;t know yet. I have seen enough people (half) that I personally let hear these....they can&#39;t hear them either (some of them) so I understand why others can&#39;t hear them. Just to &quot;loop&quot; (continual repeat) of only the evp is helpful sometimes. --- In EVP-ITC@yahoogroups.com, &quot;threadsintyme@&quot; &lt;Threadsintyme@&gt; wrote:\n&gt;   &gt;\n&gt;   &gt; It might just make a difference if we knew what shape dem ears of yurns&#39; are! LOL\n&gt;   &gt; Al\n&gt;   &gt; ---------- Original Message ----------\n&gt;   &gt; From: &quot;April Abercrombie&quot; &lt;april@&gt;\n&gt;   &gt; To: &lt;EVP-ITC@yahoogroups.com&gt;\n&gt;   &gt; Subject: Re: [EVP-ITC] Re: what you hear is what you get\n&gt;   &gt; Date: Fri, 15 May 2009 14:20:30 -0600\n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; LOL! ----- Original Message ----- From: Frank Sumption To: EVP-ITC@yahoogroups.com Sent: Friday, May 15, 2009 2:14 PMSubject: Re: [EVP-ITC] Re: what you hear is what you get\n&gt;   &gt; I always listen to EVP wiht my ears!--I know--alien humor.\n&gt;   &gt; \n&gt;   &gt; On Fri, May 15, 2009 at 1:24 PM, April Abercrombie &lt;april@&gt; wrote:\n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; I always listen to EVP&#39;s with high quality headphones. In the &quot;tomorrow let you know&quot; EVP, I do hear something....just can&#39;t be sure that it is a voice. I does have a cadence similar to someone speaking, but it could just as easily be something present in the environment-a natural background noise. There is no way for me to tell for certain as it is just too feint. I can&#39;t make out any clear words. Sure-I could probably matrix some in, but that is all it would be. For an EVP to be considered proof positive of spirit communication by the community at large, it has to be clear enough that many people hear the same thing, without hints or coaxing. If you have to have high quality devices to make it out, it just isn&#39;t good enough. That does not mean it isn&#39;t a true EVP, just that it isn&#39;t good enough to stand as evidence. As for the whistle, it sounded like feedback to me as well, but I will have to take you word for it that you were no where near any other electronics or EMF&#39;s that could contribute to feedback. Even so, if I am trying to remain unbiased and objective, there is no way for me to say this is a spirit, without personally being with you when you caught it. The only thing I can still say about it is could be, but for me it is non conclusive. If someone does not hear what you are hearing, try to remain objective and just understand that it isn&#39;t personal. You have to understand that with just these recordings alone, there is no way to scientifically prove what you have recorded is spirit communication. If you could get consistent, intelligent question and answer recordings, then you would be alot closer. Here again, we are back to the &quot;So what?&quot; thing. You don&#39;t HAVE to prove anything scientifically, unless you want others to completely believe in your evidence. The theory that is being kicked around is that some EVP&#39;s are personal, and only meant for the person recording them to hear. If this is the case, no matter how clear something is to you, others may not hear it. April ----- Original Message ----- From: James W. Hyslope To: EVP-ITC@...m Sent: Friday, May 15, 2009 12:02 PMSubject: [EVP-ITC] Re: what you hear is what you get\n&gt;   &gt; Okay, I can respect that. If you can&#39;t hear them then it must be either mechanical (sound card or headphones)or maybe your hearing has loss in those frequencies....Some of these are not very clear or loud enough too. But many will depend on your computer sound card & your headphones. I have let an older man listen (in his late 60&#39;s) and he has heard most all of the audio. Same with a few guys at work. Some hear them right away, and others can&#39;t until I loop the actually EVP for a few tries. I personally use a Dell Latitude D430 to hear these. I can hear some on my cell phone. Headphones are a must....or you won&#39;t hear anything either way. *But some can be heard on cell phone without headphones. The conversion to MP3 has also caused some loss, but I am still able to hear them when I review from this site (but I have the repetive hearing syndrome in this area no doubt). Although I do have some disbelief (shock) that a few of these are not discernable. Go back and listen to &quot;tomorrow let you know&quot; is in a gruffy-robotic melodic tone at the very end but with higher natural volume. And if you couldn&#39;t hear the whistle...I would suggest the need to remove the cotton from the ear :) As for feedback.....feedback from what? I only had one recorder working here. I would rather hear someone say &quot;I&quot; made the whistle....that would be more understandable. And is very true....if someone &quot;tells&quot; the group that THIS is supposed to be what WAS said, then is very difficult to clear the mind to hear it any other way. Kinda like trying to hum another song while a different one is playing :) --- In EVP-ITC@yahoogroups.com, &quot;April Abercrombie&quot; &lt;april@&gt; wrote:\n&gt;   &gt; &gt;\n&gt;   &gt; &gt; Here&#39;s the thing though - if you put something out there, and ask people to listen to it, your inviting opinions. Some will be in agreement, and some won&#39;t, no matter what.\n&gt;   &gt; &gt; \n&gt;   &gt; &gt; If EVP messages are for the one that recorded them, then it shouldn&#39;t surprise you, or offend you, if someone doesn&#39;t hear the same thing you do. If you don&#39;t want contrary opinions on something, then you should not give people the chance to critique.\n&gt;   &gt; &gt; \n&gt;   &gt; &gt; Now I could see if someone flat out said your recordings were all trash, period. You would have every right to be angry, but no one is saying that, at least I am not saying that.\n&gt;   &gt; &gt; \n&gt;   &gt; &gt; I just stated that I did not hear what James heard, and though I wasn&#39;t going to say he doesn&#39;t have anything, I can&#39;t say that he does either.\n&gt;   &gt; &gt; \n&gt;   &gt; &gt; ----- Original Message ----- \n&gt;   &gt; &gt; From: Frank Sumption \n&gt;   &gt; &gt; To: EVP-ITC@yahoogroups.com \n&gt;   &gt; &gt; Sent: Friday, May 15, 2009 11:00 AM\n&gt;   &gt; &gt; Subject: Re: [EVP-ITC] Re: what you hear is what you get\n&gt;   &gt; &gt; \n&gt;   &gt; &gt; \n&gt;   &gt; &gt; \n&gt;   &gt; &gt; \n&gt;   &gt; &gt; \n&gt;   &gt; &gt; \n&gt;   &gt; &gt; Yeah, and we&#39;ve all heard the thing about opinions.\n&gt;   &gt; &gt; \n&gt;   &gt; &gt; F-s\n&gt;   &gt; &gt; \n&gt;   &gt; &gt; \n&gt;   &gt; &gt; On Fri, May 15, 2009 at 10:53 AM, April Abercrombie &lt;april@&gt; wrote:\n&gt;   &gt; &gt; \n&gt;   &gt; &gt; \n&gt;   &gt; &gt; \n&gt;   &gt; &gt; \n&gt;   &gt; &gt; \n&gt;   &gt; &gt; Noone is saying what they hear is law, just their opinion.\n&gt;   &gt; &gt; \n&gt;   &gt; &gt; ----- Original Message ----- \n&gt;   &gt; &gt; From: Frank Sumption \n&gt;   &gt; &gt; To: EVP-ITC@yahoogroups.com \n&gt;   &gt; &gt; Sent: Friday, May 15, 2009 10:43 AM\n&gt;   &gt; &gt; Subject: Re: [EVP-ITC] Re: what you hear is what you get\n&gt;   &gt; &gt; \n&gt;   &gt; &gt; \n&gt;   &gt; &gt; \n&gt;   &gt; &gt; Soooo, everyone hears different, and personally I find it offensive when someone presumes to tell everyone what another researhcer&#39;s voices really say. I think EVP messages are for the one that recorded thmm, to everyone else it&#39;s non-sense, except there&#39;s enough to show that there is a phenomenon. \n&gt;   &gt; &gt; \n&gt;   &gt; &gt; I get really tired of these self proclaimed experts trying to dicate what&#39;s acceptable.\n&gt;   &gt; &gt; \n&gt;   &gt; &gt; Frank-S\n&gt;   &gt; &gt; \n&gt;   &gt; &gt; \n&gt;   &gt; &gt; On Fri, May 15, 2009 at 10:04 AM, Rick &lt;rasterer@&gt; wrote:\n&gt;   &gt; &gt; \n&gt;   &gt; &gt; \n&gt;   &gt; &gt; \n&gt;   &gt; &gt; \n&gt;   &gt; &gt; I opened your folder and examined all your files.\n&gt;   &gt; &gt; \n&gt;   &gt; &gt; Here are my opinions (I have truncated the file names due to laziness):\n&gt;   &gt; &gt; \n&gt;   &gt; &gt; ahh_mmm noises, no speech\n&gt;   &gt; &gt; call_us noises, no speech\n&gt;   &gt; &gt; cal_us (enhanced) several listenings: pixelated, no speech\n&gt;   &gt; &gt; compare_panasonic noises, no speech\n&gt;   &gt; &gt; compare_sony noises, no speech\n&gt;   &gt; &gt; first_epv noises, no speech\n&gt;   &gt; &gt; good_whistle noises, no speech (maybe feedback)\n&gt;   &gt; &gt; hey_can noises, no speech\n&gt;   &gt; &gt; hey_whats noises, no speech\n&gt;   &gt; &gt; I_hit noises, no speech\n&gt;   &gt; &gt; important_date noises, no speech\n&gt;   &gt; &gt; keep_moving several listenings: Hellalal see woobeh \n&gt;   &gt; &gt; laugh_evp noises, no speech\n&gt;   &gt; &gt; lets_wait several listenings: noises, no speech\n&gt;   &gt; &gt; maybe_gun noises, no speech\n&gt;   &gt; &gt; miss_you noises, no speech\n&gt;   &gt; &gt; my_question several listenings: no da lee\n&gt;   &gt; &gt; oh_ noises, no speech\n&gt;   &gt; &gt; something several listenings: noises, no speech\n&gt;   &gt; &gt; that_mans noises, no speech\n&gt;   &gt; &gt; that&#39;s_jim noises, no speech\n&gt;   &gt; &gt; this_one several listenings: noises, no speech\n&gt;   &gt; &gt; tomorrow noises, no speech\n&gt;   &gt; &gt; \n&gt;   &gt; &gt; The ones that took several listenings I thought I might hear words in, so I examined those several times. Sometimes I could sort of hear something that sort of sounded like what you suggested, but I could also hear it in other ways, or not at all.\n&gt;   &gt; &gt; \n&gt;   &gt; &gt; So my suggestion to you, if you want to get less subjective conjuctures or simply less affirmations of your own interpretations, is to post the future ones without labels. The labels you give can influence the listeners: when you have a sound that could be several things, and you note that it sounded like &quot;keep it moving&quot;, the listener can find it nearly impossible to try NOT to hear what you heard, and so not be able to give a fresh perspecive to help your research methods. \n&gt;   &gt; &gt; \n&gt;   &gt; &gt; \n&gt;   &gt; &gt; \n&gt;   &gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;James W. Hyslope&quot; &lt;clockdryve@&gt; wrote:\n&gt;   &gt; &gt; &gt;\n&gt;   &gt; &gt; &gt; Go to my Folder in the files section &quot;Jim&#39;s RR-DR60 EVP&#39;s&quot; and see if anyone (needs to) decide &quot;FOR ME&quot; and let me know if I am of the serious type. In my short time I have gathered enough &quot;proof&quot; for myself that this method works for ME. And from what I have seen from others that I have let &quot;listen&quot; to my files (friends) I am blessed with the &quot;ability&quot; to HEAR very low audio artifacts....so this will help me in my RESEARCH. And I am OPEN to any help to reach my goals (or help others) with their goals. Have fun people. On a HAPPIER NOTE :) I was lucky enough to catch the RR-DR60 taking a nap yesterday....it missed a few evp&#39;s real close together (in a 5 second clip) the Sony ICD-B7 heard a male use a different number than what I used. I said 16 (my earlier age I was saying in recorder) and the male evp said 13....then a female laughs. All this was missed by the DR60 (except my 16 was recorded in both recorders) BUT then the DR60 &quot;caught&quot; the B7 &quot;napping&quot; at near the end of the 5 second clip....the DR60 heard &quot;let me out&quot; in a clear (quite) males voice. So this is very promising piece of evidence for me. **those 2 recordings have been uploaded to my folder. I will include an Olympus W-10 (soon as arrives), Panasonic RR-US360 (when I think to grab it) and my RR-QR80 to go with my RR-QR100, and one more (can&#39;t remember what brand-model of this last---due to arrive) LOL. I need to build a multiple mounting devise to aid in putting these into tandem service. Then I think I will use my Olympus DS-50 as my &quot;Control&quot; recorder....by using it on the HQ settings. I am looking to build a &quot;subsonic&quot; microphone also (something to do with those low &quot;booms&quot; that I have noticed lead or follow many evp&#39;s). So I look forward to any ideas. Falure is NOT an option. Haha.....\n&gt;   &gt; &gt; &gt;\n&gt;   &gt; &gt;\n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; __________________________________________________________\n&gt;   &gt; Get a life insurance quote online. Click to compare rates and save.\n&gt;   &gt; http://thirdpartyoffers.juno.com/TGL2131/fc/BLSrjnsO5FvcQEXNXgk4uOkJeADoCsfrcSrvgCffVDCom2b66SZm6pozw5q/\n&gt;   &gt;\n&gt;"}