{"id": "1436", "subject": "Re: Why is it so Quiet here?", "author": "rosemary_guiley", "timestamp": "2007-06-27T21:45:33Z", "full_text": "Thanks so much, Frank.  I&#39;ve been getting a lot of good feedback \nabout the articles from a variety of places.  The issue they are in \nwas very well received last weekend at a TAPS haunted weekend event \nat Eastern State Penitentiary in Philly.\n\nI am happy to say that I am now the owner of a Frank&#39;s box myself, \nno. 22, which has random, linear and manual sweep.  I have thanked \nFrank profusely!  I took it to Eastern State -- not to use in the \nhaunting investigation -- but because Bill Murphy and Randy Schneider \nwere there, too, and I wanted them to &quot;imprint&quot; the box with me \nbefore I initiate it into use. We meditated and set intention for the \nresearch to be of the highest purpose, and to be assisted by helpful \nentities who desire to establish the transdimensional bridges.\n\nI have been conditioning environment and consciousness with Jonathan \nGoldman&#39;s &quot;Holy Harmony&quot; CD, a wonderful 72 min. of continuous chant \n& sound with the ancient 9-note scale.  His work is at \nhttp://www.healingsounds.com.  I have always liked Goldman.\n\nRosemary\n--- In EVP-ITC@yahoogroups.com, &quot;Frank&quot; &lt;warrior18eii@...&gt; wrote:\n&gt;\n&gt; Yeah Steve, I&#39;m not real vocal to begin with but it has been\n&gt; abnormally slow. I think everyone is real busy getting their ducks \nin\n&gt; a row for the upcoming holiday.  Who knows? LOL \n&gt; \n&gt; Yeah, Rosemary wrote the articles for TAPS mag and its probably one \nof\n&gt; the best portrayals of the Frank&#39;s box there is. At least Rosemary\n&gt; actually spoke with, witnessed and interviewed people who know a\n&gt; little about this machine, to include Frank himself. Its nice to \nread\n&gt; a positive, informed account rather than the guessing and stabbing \nin\n&gt; the dark I have heard and written by ignorant naysayers.\n&gt; \n&gt; Kudos Rosemary!\n&gt; \n&gt; Frank R.\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Steve Hultay&quot; &lt;urkel23@&gt; wrote:\n&gt; &gt;\n&gt; &gt; \n&gt; &gt; This is an incredible field and nobody has posted in days.  Just \n&gt; &gt; thought i&#39;d throw it out there and maybe get somebody&#39;s \nattention.  \n&gt; &gt; I&#39;ll have to post more files i guess to keep this going.  The box \nwas \n&gt; &gt; in TAPS paramag, anybody read that?\n&gt; &gt;\n&gt;"}