{"id": "1437", "subject": "Re: [EVP-ITC] Re: Why is it so Quiet here?", "author": "Frank Sumption", "timestamp": "2007-06-27T21:45:42Z", "full_text": "No I don&#39;t, I would guess Chris is doing that because he was in area with \nfew AM stations, but it would better to add more wire to the antenna, or \nmaybe use a commercailly available amplified antenna. C.Crane sells the \nselect-a-tenna that would probably produce spectacular results.\n\nFrank-S\n\n\n\n\n&gt;From: &quot; RetroCom&quot; &lt;vfp19968@...&gt;\n&gt;Reply-To: EVP-ITC@yahoogroups.com\n&gt;To: &lt;EVP-ITC@yahoogroups.com&gt;\n&gt;Subject: Re: [EVP-ITC] Re: Why is it so Quiet here?\n&gt;Date: Wed, 27 Jun 2007 09:51:13 -0700\n&gt;\n&gt;I see in this YouTube video  http://www.youtube.com/watch?v=T-wQZ7FU2Vc  \n&gt;Where Chris Moon is holding on to the antenna for enhanced effect. Does \n&gt;anyone know if Frank uses this same method when he records?\n&gt;Thanks,\n&gt;Dave\n&gt;\n&gt;--- warrior18eii@... wrote:\n&gt;\n&gt;From: &quot;Frank&quot; &lt;warrior18eii@...&gt;\n&gt;To: EVP-ITC@yahoogroups.com\n&gt;Subject: [EVP-ITC] Re: Why is it so Quiet here?\n&gt;Date: Tue, 26 Jun 2007 23:58:44 -0000\n&gt;\n&gt;Yeah Steve, I&#39;m not real vocal to begin with but it has been\n&gt;abnormally slow. I think everyone is real busy getting their ducks in\n&gt;a row for the upcoming holiday.  Who knows? LOL\n&gt;\n&gt;Yeah, Rosemary wrote the articles for TAPS mag and its probably one of\n&gt;the best portrayals of the Frank&#39;s box there is. At least Rosemary\n&gt;actually spoke with, witnessed and interviewed people who know a\n&gt;little about this machine, to include Frank himself. Its nice to read\n&gt;a positive, informed account rather than the guessing and stabbing in\n&gt;the dark I have heard and written by ignorant naysayers.\n&gt;\n&gt;Kudos Rosemary!\n&gt;\n&gt;Frank R.\n&gt;\n&gt;--- In EVP-ITC@yahoogroups.com, &quot;Steve Hultay&quot; &lt;urkel23@...&gt; wrote:\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; This is an incredible field and nobody has posted in days.  Just\n&gt; &gt; thought i&#39;d throw it out there and maybe get somebody&#39;s attention.\n&gt; &gt; I&#39;ll have to post more files i guess to keep this going.  The box was\n&gt; &gt; in TAPS paramag, anybody read that?\n&gt; &gt;\n&gt;\n&gt;\n&gt;\n&gt;\n\n_________________________________________________________________\nGet a preview of Live Earth, the hottest event this summer - only on MSN \nhttp://liveearth.msn.com?source=msntaglineliveearthhm"}