{"id": "14372", "subject": "Re: those &quot;pops&quot; &quot;rolling thunder&quot; &quot;snaps&quot;  and &quot;boom&quot;", "author": "Derek", "timestamp": "2009-05-17T13:16:01Z", "full_text": "I&#39;ve noticed this type of message is a constant theme within EVP transmissions.\n\nI am intrigued by the &quot;robotic&quot; voice, this could support the holographic universe theory:\n\nwww.youtube.com/watch?v=vnvM_YAwX4I\n\n\n\nI think it&#39;s worth approaching this field with a mind to helping those requesting assitance. \n\n\nBut what does helping mean ? \nPerhaps  prayer or for those of an agnostic nature postive thoughts focused on the recipent do have a tangeble effect,  our &quot;materialistic&quot; nature may give a form of heavy duty thought energy which for those on the other side can effect &quot;real world&quot; benefit.\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, SnowfireL@... wrote:\n&gt;\n&gt; Not to get all religious but do you folks have a prayer to say for some of  \n&gt; these people?  It must be that The Man Upstairs has given us all a job to  \n&gt; do here, that&#39;s probably the reason He has allowed these groups to hear the  \n&gt; other side.  :&gt;/ or something. sf\n&gt;  \n&gt;  \n&gt; In a message dated 5/17/2009 7:28:44 A.M. Eastern Daylight Time,  \n&gt; Threadsintyme@... writes:\n&gt; \n&gt;  \n&gt;  \n&gt; \n&gt; \n&gt; You could pray for that female spirit. Sometimes just knowing that  they \n&gt; are not be alone helps.\n&gt; Al\n&gt; ---------- Original Message  ----------\n&gt; From: &quot;James W. Hyslope&quot;  &lt;clockdryve@...&gt;\n&gt; To:  EVP-ITC@yahoogroupsTo: \n&gt; Subject: [EVP-ITC] those &quot;pops&quot; &quot;rolling  thunder&quot; &quot;snaps&quot;  and &quot;boom&quot;\n&gt; Date: Sun, 17 May 2009 06:27:07  -0000\n&gt; \n&gt; \n&gt; One last question before I got to bed after 1am :) What are those noises  \n&gt; often heard before or after an EVP? I have found quite a few voices that I  \n&gt; wouldn&#39;t have noticed hadn&#39;t I first heard a &quot;pop&quot; sound. Actually had to do  \n&gt; some MAJOR enhancing on 2 of them to even hear them at all. I mean one was  \n&gt; impossibly buried in the noise. But after slowing it down I got a &quot;wiff&quot; of \n&gt;  it, and through more passes of the Audacity effects I was rewarded with a  \n&gt; female voice. It was sad though...she said in a mechanical pattern &quot;can - \n&gt; you  - help- me.........please - help. Still, the audio is so painfully low.  \n&gt; Hearing her plea will forever effect me. Hopefully I can find someoneone \n&gt; here  that can hear them as well as I. That can verify this for me :) I hear  \n&gt; it...but is nice to know someone else is there with you :) I went back to \n&gt; that  location little over an hour later (after found the voice) Is under 1 \n&gt; mile  from me. It&#39;s a real sad thing to hear and not knowing what to do.Jim H  \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; _Compete with the big boys. Click here to find products to  benefit your \n&gt; business._ \n&gt; (http://thirdpartyoffers.juno.com/TGL2132/fc/BLSrjnsHcQYQQpRKVx39Zie91UoQ9dcrDgiQdWWQapXovTG899y12Fpndw0/) \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; **************A strong credit score is 700 or above.  See Yours in Just 2 \n&gt; Easy Steps! \n&gt; (http://pr.atwola.com/promoclk/100126575x1222585011x1201462751/aol?redir=http://www.freecreditreport.com/pm/default.aspx?sc=668072&hmpgID=115&\n&gt; bcd=Maystrongfooter51709NO115)\n&gt;"}