{"id": "14375", "subject": "Re: [EVP-ITC] those &quot;pops&quot; &quot;rolling thunder&quot; &quot;snaps&quot; and &quot;boom&quot;", "author": "Zack Widup", "timestamp": "2009-05-17T15:05:32Z", "full_text": "I have noticed that, especially in very active areas. I have heard a\n&quot;presence&quot; of some sort throughout a recording made in a very EVP-active\narea that goes on throughout the recording - pops, clicks, hisses, sounds\nlike sighing, etc. Perhaps the spirits in the area do this without knowing\nit when they have enough energy available to produce EVP.\nJust my guess!\n\nZack\n\n\nOn Sun, May 17, 2009 at 6:27 AM, threadsintyme@... &lt;\nThreadsintyme@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; You could pray for that female spirit. Sometimes just knowing that they are\n&gt; not be alone helps.\n&gt; Al\n&gt; ---------- Original Message ----------\n&gt; From: &quot;James W. Hyslope&quot; &lt;clockdryve@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Subject: [EVP-ITC] those &quot;pops&quot; &quot;rolling thunder&quot; &quot;snaps&quot;  and &quot;boom&quot;\n&gt; Date: Sun, 17 May 2009 06:27:07 -0000\n&gt;\n&gt;  One last question before I got to bed after 1am :) What are those noises\n&gt; often heard before or after an EVP? I have found quite a few voices that I\n&gt; wouldn&#39;t have noticed hadn&#39;t I first heard a &quot;pop&quot; sound. Actually had to do\n&gt; some MAJOR enhancing on 2 of them to even hear them at all. I mean one was\n&gt; impossibly buried in the noise. But after slowing it down I got a &quot;wiff&quot; of\n&gt; it, and through more passes of the Audacity effects I was rewarded with a\n&gt; female voice. It was sad though...she said in a mechanical pattern &quot;can -\n&gt; you - help- me.........please - help. Still, the audio is so painfully low.\n&gt; Hearing her plea will forever effect me. Hopefully I can find someoneone\n&gt; here that can hear them as well as I. That can verify this for me :) I hear\n&gt; it...but is nice to know someone else is there with you :) I went back to\n&gt; that location little over an hour later (after found the voice) Is under 1\n&gt; mile from me. It&#39;s a real sad thing to hear and not knowing what to do.Jim H\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; ____________________________________________________________\n&gt; Compete with the big boys. Click here to find products to benefit your\n&gt; business.&lt;http://thirdpartyoffers.juno.com/TGL2132/fc/BLSrjnsHcQYQQpRKVx39Zie91UoQ9dcrDgiQdWWQapXovTG899y12Fpndw0/&gt;\n&gt;\n&gt; \n&gt;\n\nI ha e no iced ha , especially in e y ac i e a eas. I ha e hea d a \"p esence\" o some so h oughou a eco ding made in a e y EVP-ac i e a ea ha goes on h oughou he eco ding - pops, clicks, hisses, sounds like sighing, e c. Pe haps he spi i s in he a ea do his wi hou knowing i  when hey ha e enough ene gy a ailable  o p oduce EVP.\n\nJus my guess!\n \nZack\n \nOn Sun, May 17, 2009 a 6:27 AM, h eadsin yme@... Th eadsin yme@...> w o e:\n\n\n\n\n\n\nYou could p ay o ha emale spi i . Some imes jus knowing ha hey a e no be alone helps.Al \n---------- O iginal Message ----------F om: \"James W. Hyslope\" clockd y e@...>To: EVP-ITC@yahoog oups.com\nSubjec : [EVP-ITC] hose \"pops\" \" olling hunde \" \"snaps\"  and \"boom\"Da e: Sun, 17 May 2009 06:27:07 -0000\n\nOne las ques ion be o e I go o bed a e 1am :) Wha a e hose noises o en hea d be o e o a e an EVP? I ha e ound qui e a ew oices ha I wouldn' ha e no iced hadn' I i s hea d a \"pop\" sound. Ac ually had o do some MAJOR enhancing on 2 o hem o e en hea hem a all. I mean one was impossibly bu ied in he noise. Bu a e slowing i down I go a \"wi \" o i , and h ough mo e passes o he Audaci y e ec s I was ewa ded wi h a emale oice. I was sad hough...she said in a mechanical pa e n \"can - you - help- me.........please - help. S ill, he audio is so pain ully low. Hea ing he plea will o e e e ec me. Hope ully I can ind someoneone he e ha can hea hem as well as I. Tha can e i y his o me :) I hea i ...bu is nice o know someone else is he e wi h you :) I wen back o ha loca ion li le o e an hou la e (a e ound he oice) Is unde 1 mile om me. I 's a eal sad hing o hea and no knowing wha o do.Jim H \n____________________________________________________________ Compe e wi h he big boys. Click he e o ind p oduc s o bene i you business."}