{"id": "14389", "subject": "Re: New file uploaded to EVP-ITC", "author": "James W. Hyslope", "timestamp": "2009-05-17T21:15:13Z", "full_text": "Thanks for clearing that up for me. By now it may seem I am stuck in my beliefs (what I hear in my low audio recordings) and the statement of lower life forms...but I am first to say that I really have NO answers. But is true how people are taught to believe from an early age that white is pure and black is evil. But luckly I was not raised that way :) I have also read that EVP&#39;s are Reptile Aliens. Now I do know we are visited by ufo craft&#39;s (and they read minds) *I say this as fact by my personal account around 8 years ago. I also saw fingers curled around a partly open door (there were scales instead of skin, and long fingernails with black verticle lines going down fingernails.(Was months before the UFO, no connection I think. I saw a shadow &quot;person&quot; take 1 step and vanish. A few other &quot;odd&quot; things also happened in my life. The tunnell is REAL. I know for a fact :)&quot;Been there Done that&quot;  But I think I have metioned these before. I am looking for a poltergeist now :) I have been in a dark room (holdimg hands and chanting) I had sink cabinet doors (two doors) bang open and shut very rapidly (was in a bathroom) They were hitting me in the back of the legs. I know was not a set up because I was the one that suggested...HEY, let&#39;s try THIS. LOL  --- In EVP-ITC@yahoogroups.com, &quot;April Abercrombie&quot; &lt;april@...&gt; wrote:\n&gt;\n&gt; I&#39;m not saying it is you, but it is deep and gravelly like your voice.\n&gt; \n&gt; Be careful of assigning any type of class to different voice types. Just because a voice might sound low and growly does not mean it is a lower life form. If we hear a spirit voice that sounds week and feint, we think the spirit is in pain or trouble. But that isn&#39;t necessarily the case. It could be that is all it could do at the moment due to any number of inhibiting factors.. Breaking the dimensional barrier is probably not easy.\n&gt; \n&gt; Just like for us living. You have a deep and resonant voice. That doesn&#39;t say much for your class or personality, it is just the way your body was made. It wouldn&#39;t be right for me to think you were of a lower or higher stature than me because of the sound of your voice.\n&gt; \n&gt; Also, a voice may take on a different tone depending on how it is being transmitted.\n&gt; \n&gt; People also like to make statements about the color a spirit may appear in. Those assessment though are made in human ignorance. For instance, if a ghost appears black, out of the baggage we humans have attached to that color, we automatically assign and evil label to it. But that isn&#39;t a proper assumption. It is our own inability to remain objective. We see a color and we get an instant motor response. Those responses are human in nature and imposed upon us by other&#39;s beliefs or other environmental factors.\n&gt; \n&gt; Bottom line is when it comes to this stuff, you cannot assess anything based on beliefs. &quot;Just the facts maam...&quot;\n&gt; \n&gt; You have to got by the spirits actions to tell what their demeanor is. Even then, a spirit&#39;s action can be misunderstood. Say a spirit has just thrown an object in your direction. We may automatically think of that as an aggressive attack. But the spirit is probably just trying to get your attention in the most obvious way possible. It didn&#39;t throw the thing at you to hurt you.\n&gt; \n&gt; See what I&#39;m saying? The only way you can really tell a spirits demeanor is by studying that same entity for a period of time to see what the nature of its actions are.\n&gt; \n&gt;   ----- Original Message ----- \n&gt;   From: James W. Hyslope \n&gt;   To: EVP-ITC@yahoogroups.com \n&gt;   Sent: Sunday, May 17, 2009 10:49 AM\n&gt;   Subject: [EVP-ITC] Re: New file uploaded to EVP-ITC\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;   Shame on you April :) (sounds like me) LOL. I&#39;ll give you a hint. I believe it says &quot;let&#39;s wait and bury him&quot; This was from inside the house where I stay. There is one EVP that DOES sound simular to my voice. It is the one &quot;keep moving it&quot;. I&#39;m thinking (because is what I have read) that the growling type evp (as in keep moving it) are of the lower life form types. And the EVP was having a difficult time speaking (seems like I can hear breathing too) Then real words began to form. And to me it is very close to some of my voice traits. Maybe in &quot;keep moving it&quot; he was like a foreigner using the &quot;accent&quot; of his teacher?? But this upload (that I didn&#39;t say what was said) has e &quot;robotic-mechanical&quot; cadence.Well...it too was simular to the &quot;keep moving it&quot; as well. There sure was a lot of echo in my home recording. I have read recently that need to do checks (record in differnt locations) in the same room. Because furniture, walls, curtains and air currents can all affect your evp results or success. --- In EVP-ITC@yahoogroups.com, &quot;April Abercrombie&quot; &lt;april@&gt; wrote:\n&gt;   &gt;\n&gt;   &gt; I can&#39;t make out any words, but it sounds like alot like your voice.\n&gt;   &gt; \n&gt;   &gt; ----- Original Message ----- \n&gt;   &gt; From: EVP-ITC@yahoogroups.com \n&gt;   &gt; To: EVP-ITC@yahoogroups.com \n&gt;   &gt; Sent: Saturday, May 16, 2009 9:19 PM\n&gt;   &gt; Subject: [EVP-ITC] New file uploaded to EVP-ITC\n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; Hello,\n&gt;   &gt; \n&gt;   &gt; This email message is a notification to let you know that\n&gt;   &gt; a file has been uploaded to the Files area of the EVP-ITC \n&gt;   &gt; group.\n&gt;   &gt; \n&gt;   &gt; File : /Jim&#39;s RR-DR60 EVP&#39;s/3) Audacity-Goldwave-evp.mp3 \n&gt;   &gt; Uploaded by : clockdryve &lt;clockdryve@&gt; \n&gt;   &gt; Description : Here is another that is SUPER enhanced....I won&#39;t tell you what it says. See if you can figure out what it says. Everybody is having problems hearing my EVP&#39;s. I agree.....they are VERY difficult to hear. I am luck with my headphones I guess. \n&gt;   &gt; \n&gt;   &gt; You can access this file at the URL:\n&gt;   &gt; http://groups.yahoo.com/group/EVP-ITC/files/Jim%27s%20RR-DR60%20EVP%27s/3%29%20Audacity-Goldwave-evp.mp3 \n&gt;   &gt; \n&gt;   &gt; To learn more about file sharing for your group, please visit:\n&gt;   &gt; http://help.yahoo.com/l/us/yahoo/groups/original/members/web/index.htmlfiles\n&gt;   &gt; \n&gt;   &gt; Regards,\n&gt;   &gt; \n&gt;   &gt; clockdryve &lt;clockdryve@&gt;\n&gt;   &gt;\n&gt;"}