{"id": "14396", "subject": "Re: [EVP-ITC] I have a question.", "author": "Eric VanDuzer", "timestamp": "2009-05-18T13:41:41Z", "full_text": "Thats the word I was looking for was on the Tip of my tongue and could\nremember it for the life of me. pareidolia, or matrixing  all I could think\nof it Pixelating LOL\n\n\nOn Mon, May 18, 2009 at 9:33 AM, April Abercrombie &lt;\napril@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;  You are right-if you have to do too much enhancing to hear something,\n&gt; then you just can&#39;t call it EVP.\n&gt;\n&gt; But that really doesn&#39;t mean that there isn&#39;t anything there, because there\n&gt; could be, but it isn&#39;t good enough to be considered.\n&gt;\n&gt; You can tweak and play with a recording as long as you want, so long as you\n&gt; always keep the original in pristine condition for comparison. When I go to\n&gt; process my audio, upon opening the track, I immediately save it to another\n&gt; name so that I am sure not to accidentally save over the original.\n&gt;\n&gt; If you have tweaked the audio to the point that it is completely\n&gt; unrecognizable from the original, I would say that may be too far.\n&gt;\n&gt; &quot;Are we just making ourselves believe there is something there??&quot;\n&gt;\n&gt; Unfortunately I think alot of the times we are. It is called pareidolia, or\n&gt; matrixing. It is a natural functioning of our brains to pick out familiar\n&gt; patterns out of randomness. Like faces in the clouds and sounds in white\n&gt; noise. This make our job of deciphering what is authentic EVP and what is\n&gt; just matrixing very difficult. You can&#39;t even trust yourself entirely.\n&gt;\n&gt; Now before Frank kicks my butt on that, I need to state the disclaimer that\n&gt; this is only if we wish our evidence to stand up to scientific scrutiny. I\n&gt; do know that there is some value to gut feelings, but gut feelings won&#39;t get\n&gt; you anywhere in the scientific world.\n&gt;\n&gt; April\n&gt;\n&gt;\n&gt;\n&gt; ----- Original Message -----\n&gt; *From:* Eric VanDuzer &lt;evanduzer@...&gt;\n&gt; *To:* EVP-ITC@yahoogroups.com\n&gt; *Sent:* Monday, May 18, 2009 7:11 AM\n&gt; *Subject:* [EVP-ITC] I have a question.\n&gt;\n&gt;  Now I may be biased to the &quot;investigation&quot; way of doing things.  I do\n&gt; clean up evps if I hear something and can&#39;t make it out do to ambient\n&gt; noise.  So hear is my question.  When do you stop cleaning up?  Wouldn&#39;t to\n&gt; much enhancing &quot;taint&quot; the results?  To me the more enhancing you do the\n&gt; less convincing it becomes.  I hope noone finds this offensive, it is not\n&gt; meant to be I am just really curious.  The way I look at it is that if you\n&gt; have to do so much enhancing to find anything, was there really something\n&gt; there to begin with.  Are we just making ourselves believe there is\n&gt; something there??\n&gt;\n&gt; Eric\n&gt;\n&gt;  \n&gt;\n\nTha s he wo d I was looking o was on he Tip o my ongue and could emembe i o he li e o me. pa eidolia, o ma ixing  all I could hink o i Pixela ing LOL \nOn Mon, May 18, 2009 a 9:33 AM, Ap il Abe c ombie ap il@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n \n \n \n \n\n\nYou a e igh -i you ha e o do oo much \nenhancing o hea some hing, hen you jus can' call i EVP.\n \nBu ha eally doesn' mean ha he e \nisn' any hing he e, because he e could be, bu i isn' good enough o be \nconside ed.\n \nYou can weak and play wi h a eco ding as \nlong as you wan , so long as you always keep he o iginal in p is ine condi ion \n o compa ison. When I go o p ocess my audio, upon opening he ack, I \nimmedia ely sa e i o ano he name so ha I am su e no o acciden ally sa e \no e he o iginal.\n \nI you ha e weaked he audio o he poin \n ha i is comple ely un ecognizable om he o iginal, I would say ha may be \n oo a .\n \n\"A e we jus making ou sel es belie e he e is some hing he e??\"\n \nUn o una ely I hink alo o he \n imes we a e. I is called pa eidolia, o ma ixing. I is a \nna u al  unc ioning o  ou b ains o pick ou amilia pa e ns ou o \n andomness. Like aces in he clouds and sounds in whi e noise. This make \nou job o deciphe ing wha is au hen ic EVP and wha is jus ma ixing e y \ndi icul . You can' e en us you sel en i ely.\n \nNow be o e F ank kicks my bu on ha , I \nneed o s a e he disclaime ha his is only i we wish ou e idence o s and \nup o scien i ic sc u iny. I do know ha \n he e is some alue o gu eelings, bu gu eelings won' ge you anywhe e in \n he scien i ic wo ld.\n \nAp il\n \n \n\n ----- O iginal Message ----- \n \nF om: \n E ic \n VanDuze \n To: EVP-ITC@yahoog oups.com \n\n Sen : Monday, May 18, 2009 7:11 AM\n\n Subjec : [EVP-ITC] I ha e a \n ques ion.\n \n \n Now I may be biased o he \"in es iga ion\" way o doing hings.  I do \n clean up e ps i I hea some hing and can' make i ou do o ambien \n noise.  So hea is my ques ion.  When do you s op cleaning up?  \n Wouldn' o much enhancing \" ain \" he esul s?  To me he mo e enhancing \n you do he less con incing i becomes.  I hope noone inds his \n o ensi e, i is no mean o be I am jus eally cu ious.  The way I \n look a i is ha i you ha e o do so much enhancing o ind any hing, was \n he e eally some hing he e o begin wi h.  A e we jus making ou sel es \n belie e he e is some hing he e??E ic"}