{"id": "14407", "subject": "Re: [EVP-ITC] I have a question.", "author": "Zack Widup", "timestamp": "2009-05-18T17:38:10Z", "full_text": "I&#39;ll have to ask the people if it&#39;s OK to do that.\n\nZack\n\nOn Mon, May 18, 2009 at 12:28 PM, threadsintyme@... &lt;\nThreadsintyme@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;  Zack,\n&gt;\n&gt; Would it be possible for you to post those recordings? Might be interesting\n&gt; to see what some can actually find!\n&gt; Al\n&gt; ---------- Original Message ----------\n&gt; From: Zack Widup &lt;w9sz.zack@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Subject: Re: [EVP-ITC] I have a question.\n&gt; Date: Mon, 18 May 2009 12:15:38 -0500\n&gt;\n&gt;   I have a recording provided to me by some people whose house is\n&gt; supposedly haunted. The recording is of a couple messages left on their\n&gt; landline phone answering machine. The messages are mostly garbled and\n&gt; unintelligible. I&#39;ve tried every method of processing them to try to bring\n&gt; out the words in the messages, mostly with no luck (that&#39;s how distorted\n&gt; they are.) I was able to hear &quot;This is your father ...&quot; in one message and\n&gt; &quot;I love you very much very much&quot; in another.\n&gt;\n&gt; The people suspect the house is haunted by their father and mother, who\n&gt; both passed away within 6 months of these messages. It could very well be.\n&gt;\n&gt; Zack\n&gt;\n&gt; On Mon, May 18, 2009 at 12:07 PM, David Koenig &lt;floridajakeblues@...\n&gt; &gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; I agree. You need to try every way possible to find the best one.\n&gt;&gt;\n&gt;&gt; On Mon, May 18, 2009 at 12:45 PM, April Abercrombie &lt;\n&gt;&gt; april@...&gt; wrote:\n&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;  You just have to play around with it. There is no &quot;right way&quot;.\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;  ----- Original Message -----\n&gt;&gt;&gt; *From:* SnowfireL@...\n&gt;&gt;&gt; *To:* EVP-ITC@yahoogroups.com\n&gt;&gt;&gt;  *Sent:* Monday, May 18, 2009 8:51 AM\n&gt;&gt;&gt; *Subject:* Re: [EVP-ITC] I have a question.\n&gt;&gt;&gt;\n&gt;&gt;&gt;   *Wish I knew how to &quot;enhance&quot; the correct way, because they sure have\n&gt;&gt;&gt; a lot to say over there, and I all ready had my mom come through loud and\n&gt;&gt;&gt; clear last night again, even a little boy and dad maybe from this\n&gt;&gt;&gt; neighborhood talked directly to me, although for me it sounded like they\n&gt;&gt;&gt; were in a tin can.   There is plenty of other stuff coming through as well,\n&gt;&gt;&gt; what do I care if people don&#39;t believe this, I do because, I know this is\n&gt;&gt;&gt; meant to be, and I am sure of it it&#39;s going to be something for other&#39;s like\n&gt;&gt;&gt; seeing is believing and there is nothing we can do for them, it&#39;s like the\n&gt;&gt;&gt; Wright Brother&#39;s flying for the first time here people, they said how in the\n&gt;&gt;&gt; world will that big heavy thing get off the ground?  I say lets go for it, a\n&gt;&gt;&gt; machine will be found to make them come in loud and clear one day.  sf*\n&gt;&gt;&gt;\n&gt;&gt;&gt;  In a message dated 5/18/2009 9:13:25 A.M. Eastern Daylight Time,\n&gt;&gt;&gt; evanduzer@... writes:\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt; Now I may be biased to the &quot;investigation&quot; way of doing things.  I do\n&gt;&gt;&gt; clean up evps if I hear something and can&#39;t make it out do to ambient\n&gt;&gt;&gt; noise.  So hear is my question.  When do you stop cleaning up?  Wouldn&#39;t to\n&gt;&gt;&gt; much enhancing &quot;taint&quot; the results?  To me the more enhancing you do the\n&gt;&gt;&gt; less convincing it becomes.  I hope no one finds this offensive, it is not\n&gt;&gt;&gt; meant to be I am just really curious.  The way I look at it is that if you\n&gt;&gt;&gt; have to do so much enhancing to find anything, was there really something\n&gt;&gt;&gt; there to begin with.  Are we just making ourselves believe there is\n&gt;&gt;&gt; something there??\n&gt;&gt;&gt;\n&gt;&gt;&gt; Eric\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt; ------------------------------\n&gt;&gt;&gt; *A Good Credit Score is 700 or Above. See Yours in Just 2 Easy Steps!&lt;http://pr.atwola.com/promoclk/100126575x1221322941x1201367178/aol?redir=http://www.freecreditreport.com/pm/default.aspx?sc=668072%26hmpgID=115%26bcd=Mayfooter51809NO115&gt;\n&gt;&gt;&gt; *\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;\n&gt;\n&gt;\n&gt; ____________________________________________________________\n&gt; Click now for low quotes on great group health insurance plans!&lt;http://thirdpartyoffers.juno.com/TGL2132/fc/BLSrjnsO4K5Y2K41IfIWH2G8A2NXdKeeg4Aamf8R5phLG2NJDccuGILrlrq/&gt;\n&gt;\n&gt; \n&gt;\n\nI'll ha e o ask he people i i 's OK o do ha .\n \nZack\nOn Mon, May 18, 2009 a 12:28 PM, h eadsin yme@... Th eadsin yme@...> w o e:\n\n\n\n\n\n\n\nZack,\nWould i be possible o you o pos hose eco dings? Migh be in e es ing o see wha some can ac ually ind!Al \n---------- O iginal Message ----------F om: Zack Widup w9sz.zack@...>To: EVP-ITC@yahoog oups.com\n\nSubjec : Re: [EVP-ITC] I ha e a ques ion.\nDa e: Mon, 18 May 2009 12:15:38 -0500\n\n\n\n\nI ha e a eco ding p o ided o me by some people whose house is supposedly haun ed. The eco ding is o a couple messages le on hei landline phone answe ing machine. The messages a e mos ly ga bled and unin elligible. I' e ied e e y me hod o p ocessing hem o y o b ing ou he wo ds in he messages, mos ly wi h no luck ( ha 's how dis o ed hey a e.) I was able o hea \"This is you a he ...\" in one message and \"I lo e you e y much e y much\" in ano he .\n\n \nThe people suspec he house is haun ed by hei a he and mo he , who bo h passed away wi hin 6 mon hs o hese messages. I could e y well be.\n \nZack\nOn Mon, May 18, 2009 a 12:07 PM, Da id Koenig lo idajakeblues@...> w o e:\n\n\n\n\n\nI ag ee. You need o y e e y way possible o ind he bes one. \n\nOn Mon, May 18, 2009 a 12:45 PM, Ap il Abe c ombie ap il@...> w o e:\n\n\n\n\n\n\n\nYou jus ha e o play a ound wi h i . The e is no \" igh way\".\n \n\n\n----- O iginal Message ----- \nF om: Snow i eL@... \nTo: EVP-ITC@yahoog oups.com \n\nSen : Monday, May 18, 2009 8:51 AM\nSubjec : Re: [EVP-ITC] I ha e a ques ion.\n\n\n\n\nWish I knew how o \"enhance\" he co ec way, because hey su e ha e a lo o say o e he e, and I all eady had my mom come h ough loud and clea las nigh again, e en a li le boy and dad maybe om his neighbo hood alked di ec ly o me, al hough o me i sounded like hey we e in a in can.   The e is plen y o o he s u coming h ough as well, wha do I ca e i people don' belie e his, I do because, I know his is mean o be, and I am su e o i i 's going o be some hing o o he 's like seeing is belie ing and he e is no hing we can do o hem, i 's like he W igh B o he 's lying o he i s ime he e people, hey said how in he wo ld will ha big hea y hing ge o he g ound?  I say le s go o i , a machine will be ound o make hem come in loud and clea one day.  s \n\n \n\nIn a message da ed 5/18/2009 9:13:25 A.M. Eas e n Dayligh Time, e anduze @... w i es:\n\n\n\n\nNow I may be biased o he \"in es iga ion\" way o doing hings.  I do clean up e ps i I hea some hing and can' make i ou do o ambien noise.  So hea is my ques ion.  When do you s op cleaning up?  Wouldn' o much enhancing \" ain \" he esul s?  To me he mo e enhancing you do he less con incing i becomes.  I hope no one inds his o ensi e, i is no mean o be I am jus eally cu ious.  The way I look a i is ha i you ha e o do so much enhancing o ind any hing, was he e eally some hing he e o begin wi h.  A e we jus making ou sel es belie e he e is some hing he e??\nE ic\n\n\n\n\nA Good C edi Sco e is 700 o Abo e. See You s in Jus 2 Easy S eps!\n\n\n\n\n\n\n\n\n\n\n\n\n____________________________________________________________ Click now o low quo es on g ea g oup heal h insu ance plans!"}