{"id": "14423", "subject": "Re: I have a question.", "author": "James W. Hyslope", "timestamp": "2009-05-20T01:11:09Z", "full_text": "Well, for myself...I don&#39;t &quot;clean&quot; them up to much because I really don&#39;t know HOW :) (well a little bit)Since I&#39;ve only been at it for a couple weeks. BUT if you can clean up something to where you can FIND what was there to begin with &quot;you have done no harm&quot; I hear alot more than others I guess, and I haven&#39;t enhanced many of my evp&#39;s.*If anyone is able to clean them up...I DO promise you will hear what I say is correct)Pretty BOLD statement, but if you are able to clean it up with better software (please do for others too) I will be more than happy to &quot;listen&quot; where I made a mistake...I can only LEARN from it :) I have done some DEEP enhancements to a few of my evp&#39;s...from the begining I could only hear clicks and thumps.....but after messing with that area, eventually I would hear the true voices (and can tell if male or female...approximate age) and understand the mood also....these where extreamly modified, and I feel that I could NOT have added enough &quot;simple&quot; enhancements that would ADD a voice....full of emotion and distinct syllables :) And some just can&#39;t hear them for what ever reason be it equipment that is used to hear (pc-headphones-speakers-ears) know one has the perfect match of all these things. Check out &quot;Jim&#39;s RR-DR60 EVP&#39;s&quot; in the files section....work them over till you hear them. I really can&#39;t do much more :)--- In EVP-ITC@yahoogroups.com, Eric VanDuzer &lt;evanduzer@...&gt; wrote:\n&gt;\n&gt; Now I may be biased to the &quot;investigation&quot; way of doing things.  I do clean\n&gt; up evps if I hear something and can&#39;t make it out do to ambient noise.  So\n&gt; hear is my question.  When do you stop cleaning up?  Wouldn&#39;t to much\n&gt; enhancing &quot;taint&quot; the results?  To me the more enhancing you do the less\n&gt; convincing it becomes.  I hope noone finds this offensive, it is not meant\n&gt; to be I am just really curious.  The way I look at it is that if you have to\n&gt; do so much enhancing to find anything, was there really something there to\n&gt; begin with.  Are we just making ourselves believe there is something there??\n&gt; \n&gt; Eric\n&gt;"}