{"id": "14430", "subject": "Re: [EVP-ITC] Re: I have a question.", "author": "Carol B.", "timestamp": "2009-05-20T14:09:32Z", "full_text": "I use Adobe Audition...99 per cent of the time the procedure I use to\n&quot;clean up&quot; evp&#39;s is this...I amplify...then I will use the graphic\nequalizer preset on vocal presence....occasionally I use the slow down...\n\nThis works really well for me....I&#39;m just saying,\nCarol B.\n\n\n\n\n\n\n\n\n\n&gt; The problem with it Jim is that there is no way to &quot;clean&quot; the audio\n&gt; without effecting the stuff you want to keep as well. At least not with\n&gt; the cheapy softwares. I head the Adobe Audition is much better at it, but\n&gt; still not perfect.\n&gt;\n&gt; But again, enhance all you want, just make sure you keep the original\n&gt; unaltered.\n&gt;\n&gt;   ----- Original Message -----\n&gt;   From: James W. Hyslope\n&gt;   To: EVP-ITC@yahoogroups.com\n&gt;   Sent: Tuesday, May 19, 2009 7:11 PM\n&gt;   Subject: [EVP-ITC] Re: I have a question.\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;   Well, for myself...I don&#39;t &quot;clean&quot; them up to much because I really\n&gt; don&#39;t know HOW :) (well a little bit)Since I&#39;ve only been at it for a\n&gt; couple weeks. BUT if you can clean up something to where you can FIND\n&gt; what was there to begin with &quot;you have done no harm&quot; I hear alot more\n&gt; than others I guess, and I haven&#39;t enhanced many of my evp&#39;s.*If anyone\n&gt; is able to clean them up...I DO promise you will hear what I say is\n&gt; correct)Pretty BOLD statement, but if you are able to clean it up with\n&gt; better software (please do for others too) I will be more than happy to\n&gt; &quot;listen&quot; where I made a mistake...I can only LEARN from it :) I have\n&gt; done some DEEP enhancements to a few of my evp&#39;s...from the begining I\n&gt; could only hear clicks and thumps.....but after messing with that area,\n&gt; eventually I would hear the true voices (and can tell if male or\n&gt; female...approximate age) and understand the mood also....these where\n&gt; extreamly modified, and I feel that I could NOT have added enough\n&gt; &quot;simple&quot; enhancements that would ADD a voice....full of emotion and\n&gt; distinct syllables :) And some just can&#39;t hear them for what ever reason\n&gt; be it equipment that is used to hear (pc-headphones-speakers-ears) know\n&gt; one has the perfect match of all these things. Check out &quot;Jim&#39;s RR-DR60\n&gt; EVP&#39;s&quot; in the files section....work them over till you hear them. I\n&gt; really can&#39;t do much more :)--- In EVP-ITC@yahoogroups.com, Eric\n&gt; VanDuzer &lt;evanduzer@...&gt; wrote:\n&gt;   &gt;\n&gt;   &gt; Now I may be biased to the &quot;investigation&quot; way of doing things. I do\n&gt; clean\n&gt;   &gt; up evps if I hear something and can&#39;t make it out do to ambient noise.\n&gt; So\n&gt;   &gt; hear is my question. When do you stop cleaning up? Wouldn&#39;t to much\n&gt;   &gt; enhancing &quot;taint&quot; the results? To me the more enhancing you do the\n&gt; less\n&gt;   &gt; convincing it becomes. I hope noone finds this offensive, it is not\n&gt; meant\n&gt;   &gt; to be I am just really curious. The way I look at it is that if you\n&gt; have to\n&gt;   &gt; do so much enhancing to find anything, was there really something\n&gt; there to\n&gt;   &gt; begin with. Are we just making ourselves believe there is something\n&gt; there??\n&gt;   &gt;\n&gt;   &gt; Eric\n&gt;   &gt;\n&gt;\n&gt;\n&gt;\n&gt;"}