{"id": "14436", "subject": "Re: [EVP-ITC] Re: Question,", "author": "Frank Sumption", "timestamp": "2009-05-20T14:32:35Z", "full_text": "I prefer systems that work right off the bat, the box works, something\ntalks, and how do I make it better. Just in that attempt there&#39;s lots of\ntail chasing, I don&#39;t like to get sidetracked on other systems--unless\nthere&#39;s already something to suggest it works better. It&#39;s been my\nexpereince that all that is needed is something that has human speech\nfrequencies which can be rearranged in to &quot;thier&quot; voices. Various methods of\nproviding the raw audio has been proven to work, that&#39;s why I focus on that\nappraoch.  White noise, radio between stations, running water, foreign\nlanguage, EVPmaker, and the box, all the same concept.\n\n Yeah, the thing about all the fake mediums is right, and there&#39;s no\nshortage of people that throw money desperately seeking that shread of proof\nthat they personally go on. I think that is the bottom line, people are so\nabsolutely scared of death thay want *any* reassurance. Money is no object.\n\n Frank-S\n\nOn Tue, May 19, 2009 at 7:20 PM, James W. Hyslope &lt;clockdryve@...&gt;wrote:\n\n&gt;\n&gt;\n&gt;  Hellooooo :) Have we all forgotten how &quot;mediums&quot; were popping up\n&gt; everywhere back then ;) It was big money. There were always FAKES to be\n&gt; found :) Why waste your energy (spirit)on blowing a silly trumpet if you\n&gt; could just use your ecto-vocal cords :) to tell ALL. I&#39;m sure they would\n&gt; want to &quot;tell&quot; us where they were, and how they reach us instead of doing\n&gt; the AMAZING trumpet playing :) Voicing back then would be expected to have\n&gt; these answers...it was easier to draw paying customers with just &quot;tricks&quot;.\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, SnowfireL@...\n&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hey there, stop that April, hehe, way back spirit use to materialize\n&gt; vocal\n&gt; &gt; cords, if given enough ectoplasm and they could speak out in mid air, or\n&gt; &gt; use a metal trumpet like thing, I have an old banged up one, im going to\n&gt; use\n&gt; &gt; it today with the RS 125, and see what happens, put it inside the lower\n&gt; end\n&gt; &gt; of the trumpet, with the mic, near the PC and let them talk away, the PC\n&gt; &gt; does the recording, it might help them, who knows until it&#39;s tried. they\n&gt; &gt; use to form cords inside the trumpet out of this substance called\n&gt; ectoplasm\n&gt; &gt; and talk independently like that one time.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; In a message dated 5/19/2009 2:50:36 P.M. Eastern Daylight Time,\n&gt; &gt; april@... writes:\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; LOL!! :)\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; ----- Original Message -----\n&gt; &gt; From: _SnowfireL@..._ (mailto:SnowfireL@...)\n&gt; &gt; To: _EVP-ITC@yahoogroupsEVP-_ (mailto:EVP-ITC@yahoogroups.com&lt;EVP-ITC%40yahoogroups.com&gt;)\n&gt;\n&gt; &gt; Sent: Tuesday, May 19, 2009 12:33 PM\n&gt; &gt; Subject: Re: [EVP-ITC] Question,\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; try to combine them some how, and see what happens, maybe put some light\n&gt; &gt; wires inside the box near where the vibration comes out? Don&#39;t see how a\n&gt; &gt; crystal helps, it&#39;s just glass, and there is no where for them to create\n&gt; &gt; ectoplasm like threads on glass, try two tiny wires, (I see u, stop\n&gt; laughing).\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; In a message dated 5/19/2009 2:20:31 P.M. Eastern Daylight Time,\n&gt; &gt; purplealiengirl@In a message date\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; There was speaking machines back in the 1800s that had mechanical vocal\n&gt; &gt; cords. It still seems easiest for them to manipulate the electrical\n&gt; signals\n&gt; &gt; though.\n&gt; &gt;\n&gt; &gt; F-S\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; On Tue, May 19, 2009 at 10:02 AM, &lt;_SnowfireL@..._\n&gt; &gt; (mailto:SnowfireL@...) &gt; wrote:\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Frank do you think it&#39;s similar to what was used in 20&#39;s and 30&#39;s by\n&gt; &gt; mediums, where a trumpet (long piece of aluminum metal cone light weight\n&gt; shaped\n&gt; &gt; device) was used, it was a form spirit to form their own vocal cords in\n&gt; mid\n&gt; &gt; air. Perhaps, you should set up a test, try asking something of the\n&gt; &gt; spirit that you do not know, where it could be verified later, that way\n&gt; it won&#39;t\n&gt; &gt; have any physical influence. I remember voices easily, it&#39;s the work I\n&gt; &gt; do, so I do recognize my mother&#39;s voice, I do think you are all onto some\n&gt;\n&gt; &gt; thing here, which should one day be as the air plane, who every thought\n&gt; humans\n&gt; &gt; would one day fly? Try some light weight metal object in the box, maybe\n&gt; &gt; it would help, maybe shaped like a pair of vocal cords, with folds see it\n&gt;\n&gt; &gt; that helps. sf\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; In a message dated 5/19/2009 10:39:32 A.M. Eastern Daylight Time,\n&gt; &gt; _purplealiengirl@purpleali_ (mailto:purplealiengirl@...) writes:\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; I make the boxes and I don&#39;t know, it seems to be a natural ability that\n&gt; &gt; most spirits have. Thoughts can interact with the electronics, and even\n&gt; &gt; &quot;voices&quot; of the living can come through, in that way I think we can\n&gt; create what\n&gt; &gt; we are expecting to hear.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; When I first started making this stuff, I gort my wifes &quot;voice&quot; as she\n&gt; was\n&gt; &gt; stepping in the shower, upstairs, &quot;I&#39;ll be out in two minutes&quot;, in her\n&gt; &gt; voces, throught he box. It&#39;s seems to be more difficult to conciously\n&gt; form\n&gt; &gt; voices, kinda like doing PK, it&#39;s more of a subconcious function. Of\n&gt; course\n&gt; &gt; that was with the radnom sweep, linear sweep seems to work a little\n&gt; &gt; differently, and seems to take more ability, or effort.\n&gt; &gt;\n&gt; &gt; The voices seem to made inside the electronics, you can record with no\n&gt; &gt; sound output, and still get the same kind of results. Even that could\n&gt; support\n&gt; &gt; that suggestion that it&#39;s imagination, in that we&#39;d still hear the same\n&gt; &gt; stuff in the chopped up audio, not that I believe that.\n&gt; &gt;\n&gt; &gt; Someone needs to study this stuff that hasn&#39;t already made up their minds\n&gt;\n&gt; &gt; what it is.\n&gt; &gt;\n&gt; &gt; Frank-S\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; On Mon, May 18, 2009 at 3:27 PM, &lt;_SnowfireL@..._\n&gt; &gt; (mailto:SnowfireL@...) &gt; wrote:\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Hi, I have a question for those who use a box instead of radio, where do\n&gt; &gt; spirit get the ability to talk with a box? Are there certain channels\n&gt; going\n&gt; &gt; by with the box as is like a radio? sf\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; ____________________________________\n&gt; &gt; A Good Credit Score is 700 or Above. _See Yours in Just 2 Easy Steps!_\n&gt; &gt; (\n&gt; http://pr.atwola.com/promoclk/100126575x1221322941x1201367178/aol?redir=http://w\n&gt; &gt;\n&gt; ww.freecreditreport.com/pm/default.aspx?sc=668072&hmpgID=115&bcd=Mayfooter51\n&gt; &gt; 809NO115)\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; ____________________________________\n&gt; &gt; An Excellent Credit Score is 750. _See Yours in Just 2 Easy Steps!_\n&gt; &gt; (\n&gt; http://pr.atwola.com/promoclk/100126575x1221823248x1201398651/aol?redir=http://www.\n&gt; &gt;\n&gt; freecreditreport.com/pm/default.aspx?sc=668072&hmpgID=62&bcd=MayExcfooter516\n&gt; &gt; 09NO62)\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; ____________________________________\n&gt; &gt; An Excellent Credit Score is 750. _See Yours in Just 2 Easy Steps!_\n&gt; &gt; (\n&gt; http://pr.atwola.com/promoclk/100126575x1221823248x1201398651/aol?redir=http://www\n&gt; &gt; .\n&gt; freecreditreport.com/pm/default.aspx?sc=668072&hmpgID=62&bcd=MayExcfooter51\n&gt; &gt; 609NO62)\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; **************An Excellent Credit Score is 750. See Yours in Just 2 Easy\n&gt; &gt; Steps!\n&gt; &gt; (\n&gt; http://pr.atwola.com/promoclk/100126575x1221823248x1201398651/aol?redir=http://www.freecreditreport.com/pm/default.aspx?sc=668072&hmpgID=62&bcd=May\n&gt; &gt; Excfooter51609NO62)\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nI p e e sys ems ha wo k igh o he ba , he box wo ks, some hing alks, and how do I make i be e . Jus in ha a emp he e's lo s o ail chasing, I don' like o ge side acked on o he sys ems--unless he e's al eady some hing o sugges i wo ks be e . I 's been my expe eince ha all ha is needed is some hing ha has human speech equencies which can be ea anged in o \" hie \" oices. Va ious me hods o p o iding he aw audio has been p o en o wo k, ha 's why I ocus on ha app aoch.  Whi e noise, adio be ween s a ions, unning wa e , o eign language, EVPmake , and he box, all he same concep . \n\n \n Yeah, he hing abou all he ake mediums is igh , and he e's no sho age o people ha h ow money despe a ely seeking ha sh ead o p oo ha hey pe sonally go on. I hink ha is he bo om line, people a e so absolu ely sca ed o dea h hay wan any eassu ance. Money is no objec . \n\n \n F ank-S\nOn Tue, May 19, 2009 a 7:20 PM, James W. Hyslope clockd y e@...> w o e:\n\n\n\n\n\n\nHellooooo :) Ha e we all o go en how \"mediums\" we e popping up e e ywhe e back hen ;) I was big money. The e we e always FAKES o be ound :) Why was e you ene gy (spi i )on blowing a silly umpe i you could jus use you ec o- ocal co ds :) o ell ALL. I'm su e hey would wan o \" ell\" us whe e hey we e, and how hey each us ins ead o doing he AMAZING umpe playing :) Voicing back hen would be expec ed o ha e hese answe s...i was easie o d aw paying cus ome s wi h jus \" icks\". --- In EVP-ITC@yahoog oups.com, Snow i eL@... w o e:\n>> Hey he e, s op ha Ap il, hehe, way back spi i use o ma e ialize ocal > co ds, i gi en enough ec oplasm and hey could speak ou in mid ai , o > use a me al umpe like hing, I ha e an old banged up one, im going o use \n> i oday wi h he RS 125, and see wha happens, pu i inside he lowe end > o he umpe , wi h he mic, nea he PC and le hem alk away, he PC > does he eco ding, i migh help hem, who knows un il i 's ied. hey \n> use o o m co ds inside he umpe ou o his subs ance called ec oplasm > and alk independen ly like ha one ime.> > > In a message da ed 5/19/2009 2:50:36 P.M. Eas e n Dayligh Time, \n\n> ap il@... w i es:> > > > > > LOL!! :)> > > ----- O iginal Message ----- \n> F om: _Snow i eL@..._ (mail o:Snow i eL@...) > To: _EVP-ITC@yahoog oupsEVP-_ (mail o:EVP-ITC@yahoog oups.com) \n> Sen : Tuesday, May 19, 2009 12:33 PM> Subjec : Re: [EVP-ITC] Ques ion,> > > > y o combine hem some how, and see wha happens, maybe pu some ligh > wi es inside he box nea whe e he ib a ion comes ou ? Don' see how a \n> c ys al helps, i 's jus glass, and he e is no whe e o hem o c ea e > ec oplasm like h eads on glass, y wo iny wi es, (I see u, s op laughing).> > > In a message da ed 5/19/2009 2:20:31 P.M. Eas e n Dayligh Time, \n> pu plealiengi l@In a message da e \n> > > > > > The e was speaking machines back in he 1800s ha had mechanical ocal > co ds. I s ill seems easies o hem o manipula e he elec ical signals \n> hough. > > F-S> > \n> On Tue, May 19, 2009 a 10:02 AM, > (mail o:Snow i eL@...) > w o e:> > > > > > \n> F ank do you hink i 's simila o wha was used in 20's and 30's by > mediums, whe e a umpe (long piece o aluminum me al cone ligh weigh shaped > de ice) was used, i was a o m spi i o o m hei own ocal co ds in mid \n> ai . Pe haps, you should se up a es , y asking some hing o he > spi i ha you do no know, whe e i could be e i ied la e , ha way i won' > ha e any physical in luence. I emembe oices easily, i 's he wo k I \n> do, so I do ecognize my mo he 's oice, I do hink you a e all on o some > hing he e, which should one day be as he ai plane, who e e y hough humans > would one day ly? T y some ligh weigh me al objec in he box, maybe \n> i would help, maybe shaped like a pai o ocal co ds, wi h olds see i > ha helps. s > > > In a message da ed 5/19/2009 10:39:32 A.M. Eas e n Dayligh Time, \n> _pu plealiengi l@pu pleali_ (mail o:pu plealiengi l@...) w i es:> > > > > > I make he boxes and I don' know, i seems o be a na u al abili y ha \n> mos spi i s ha e. Though s can in e ac wi h he elec onics, and e en > \" oices\" o he li ing can come h ough, in ha way I hink we can c ea e wha > we a e expec ing o hea . > \n> > When I i s s a ed making his s u , I go my wi es \" oice\" as she was > s epping in he showe , ups ai s, \"I'll be ou in wo minu es\", in he > oces, h ough he box. I 's seems o be mo e di icul o conciously o m \n> oices, kinda like doing PK, i 's mo e o a subconcious unc ion. O cou se > ha was wi h he adnom sweep, linea sweep seems o wo k a li le > di e en ly, and seems o ake mo e abili y, o e o . \n> > The oices seem o made inside he elec onics, you can eco d wi h no > sound ou pu , and s ill ge he same kind o esul s. E en ha could suppo > ha sugges ion ha i 's imagina ion, in ha we'd s ill hea he same \n> s u in he chopped up audio, no ha I belie e ha . > > Someone needs o s udy his s u ha hasn' al eady made up hei minds > wha i is.> > F ank-S > > \n\n> On Mon, May 18, 2009 a 3:27 PM, > (mail o:Snow i eL@...) > w o e:> > > > > > \n> Hi, I ha e a ques ion o hose who use a box ins ead o adio, whe e do > spi i ge he abili y o alk wi h a box? A e he e ce ain channels going > by wi h he box as is like a adio? s > \n> > ____________________________________> A Good C edi Sco e is 700 o Abo e. _See You s in Jus 2 Easy S eps!_ > (h p://p .a wola.com/p omoclk/100126575x1221322941x1201367178/aol? edi =h p://w\n> ww. eec edi epo .com/pm/de aul .aspx?sc=668072&hmpgID=115&bcd=May oo e 51> 809NO115) \n> > > > > > > > > > > > > > > > > > ____________________________________ \n> An Excellen C edi Sco e is 750. _See You s in Jus 2 Easy S eps!_ > (h p://p .a wola.com/p omoclk/100126575x1221823248x1201398651/aol? edi =h p://www.\n> eec edi epo .com/pm/de aul .aspx?sc=668072&hmpgID=62&bcd=MayExc oo e 516> 09NO62) \n> > > > > > > > > > > > > > > > > ____________________________________ \n> An Excellen C edi Sco e is 750. _See You s in Jus 2 Easy S eps!_ > (h p://p .a wola.com/p omoclk/100126575x1221823248x1201398651/aol? edi =h p://www\n> . eec edi epo .com/pm/de aul .aspx?sc=668072&hmpgID=62&bcd=MayExc oo e 51> 609NO62) \n> > > > > > > **************An Excellen C edi Sco e is 750. See You s in Jus 2 Easy > S eps! > (h p://p .a wola.com/p omoclk/100126575x1221823248x1201398651/aol? edi =h p://www. eec edi epo .com/pm/de aul .aspx?sc=668072&hmpgID=62&bcd=May\n> Exc oo e 51609NO62)>"}