{"id": "14455", "subject": "Re: [EVP-ITC] Re: I have a question.", "author": "Eric VanDuzer", "timestamp": "2009-05-20T16:09:47Z", "full_text": "I think that is the problem I am having though Jim.  When you say &quot;work them\nover till you hear them&quot;  to me I should not have to work them over till I\nhear them.  Yes taking out the ambient and background noise is one thing.\nBut if you just keep on listening to them with different enhancements you\nare bound to hear something (matrixing).  If one person is not meant to hear\nit they won&#39;t hear it (I guess I am not quite ready to believe that one\nright yet).  I think you all know what I am getting at.\n\nOn Tue, May 19, 2009 at 9:11 PM, James W. Hyslope &lt;clockdryve@...&gt;wrote:\n\n&gt;\n&gt;\n&gt; Well, for myself...I don&#39;t &quot;clean&quot; them up to much because I really don&#39;t\n&gt; know HOW :) (well a little bit)Since I&#39;ve only been at it for a couple\n&gt; weeks. BUT if you can clean up something to where you can FIND what was\n&gt; there to begin with &quot;you have done no harm&quot; I hear alot more than others I\n&gt; guess, and I haven&#39;t enhanced many of my evp&#39;s.*If anyone is able to clean\n&gt; them up...I DO promise you will hear what I say is correct)Pretty BOLD\n&gt; statement, but if you are able to clean it up with better software (please\n&gt; do for others too) I will be more than happy to &quot;listen&quot; where I made a\n&gt; mistake...I can only LEARN from it :) I have done some DEEP enhancements to\n&gt; a few of my evp&#39;s...from the begining I could only hear clicks and\n&gt; thumps.....but after messing with that area, eventually I would hear the\n&gt; true voices (and can tell if male or female...approximate age) and\n&gt; understand the mood also....these where extreamly modified, and I feel that\n&gt; I could NOT have added enough &quot;simple&quot; enhancements that would ADD a\n&gt; voice....full of emotion and distinct syllables :) And some just can&#39;t hear\n&gt; them for what ever reason be it equipment that is used to hear\n&gt; (pc-headphones-speakers-ears) know one has the perfect match of all these\n&gt; things. Check out &quot;Jim&#39;s RR-DR60 EVP&#39;s&quot; in the files section....work them\n&gt; over till you hear them. I really can&#39;t do much more :)--- In\n&gt; EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Eric VanDuzer\n&gt; &lt;evanduzer@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Now I may be biased to the &quot;investigation&quot; way of doing things. I do\n&gt; clean\n&gt; &gt; up evps if I hear something and can&#39;t make it out do to ambient noise. So\n&gt; &gt; hear is my question. When do you stop cleaning up? Wouldn&#39;t to much\n&gt; &gt; enhancing &quot;taint&quot; the results? To me the more enhancing you do the less\n&gt; &gt; convincing it becomes. I hope noone finds this offensive, it is not meant\n&gt; &gt; to be I am just really curious. The way I look at it is that if you have\n&gt; to\n&gt; &gt; do so much enhancing to find anything, was there really something there\n&gt; to\n&gt; &gt; begin with. Are we just making ourselves believe there is something\n&gt; there??\n&gt; &gt;\n&gt; &gt; Eric\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nI hink ha is he p oblem I am ha ing hough Jim.  When you say \"wo k hem o e ill you hea hem\"  o me I should no ha e o wo k hem o e ill I hea hem.  Yes aking ou he ambien and backg ound noise is one hing.  Bu i you jus keep on lis ening o hem wi h di e en enhancemen s you a e bound o hea some hing (ma ixing).  I one pe son is no mean o hea i hey won' hea i (I guess I am no qui e eady o belie e ha one igh ye ).  I hink you all know wha I am ge ing a .  \nOn Tue, May 19, 2009 a 9:11 PM, James W. Hyslope clockd y e@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n \n \n \n Well, o mysel ...I don' \"clean\" hem up o much because I eally don' know HOW :) (well a li le bi )Since I' e only been a i o a couple weeks. BUT i you can clean up some hing o whe e you can FIND wha was he e o begin wi h \"you ha e done no ha m\" I hea alo mo e han o he s I guess, and I ha en' enhanced many o my e p's.*I anyone is able o clean hem up...I DO p omise you will hea wha I say is co ec )P e y BOLD s a emen , bu i you a e able o clean i up wi h be e so wa e (please do o o he s oo) I will be mo e han happy o \"lis en\" whe e I made a mis ake...I can only LEARN om i :) I ha e done some DEEP enhancemen s o a ew o my e p's... om he begining I could only hea clicks and humps.....bu a e messing wi h ha a ea, e en ually I would hea he ue oices (and can ell i male o emale...app oxima e age) and unde s and he mood also.... hese whe e ex eamly modi ied, and I eel ha I could NOT ha e added enough \"simple\" enhancemen s ha would ADD a oice.... ull o emo ion and dis inc syllables :) And some jus can' hea hem o wha e e eason be i equipmen ha is used o hea (pc-headphones-speake s-ea s) know one has he pe ec ma ch o all hese hings. Check ou \"Jim's RR-DR60 EVP's\" in he iles sec ion....wo k hem o e ill you hea hem. I eally can' do much mo e :)--- In EVP-ITC@yahoog oups.com, E ic VanDuze w o e:\n\n>\n> Now I may be biased o he \"in es iga ion\" way o doing hings. I do clean\n> up e ps i I hea some hing and can' make i ou do o ambien noise. So\n> hea is my ques ion. When do you s op cleaning up? Wouldn' o much\n> enhancing \" ain \" he esul s? To me he mo e enhancing you do he less\n> con incing i becomes. I hope noone inds his o ensi e, i is no mean \n> o be I am jus eally cu ious. The way I look a i is ha i you ha e o\n> do so much enhancing o ind any hing, was he e eally some hing he e o\n> begin wi h. A e we jus making ou sel es belie e he e is some hing he e??\n> \n> E ic\n>"}