{"id": "14459", "subject": "Re: [EVP-ITC] Re: I have a question.", "author": "Eric VanDuzer", "timestamp": "2009-05-20T16:40:17Z", "full_text": "Nice explanation I like it probably the best I have heard thank you\n\n\nOn Wed, May 20, 2009 at 12:35 PM, April Abercrombie &lt;\napril@abercrombieghostresearch.com&gt; wrote:\n\n&gt;\n&gt;\n&gt;  2 different things happening-that&#39;s why. When you get EVP that everyone\n&gt; understands, it is outward, in the environment. Not a communication through\n&gt; subconscious means.\n&gt;\n&gt; EVP that people swear they hear, but noone else can make sense, may be a\n&gt; message to them via subconscious means. That isn&#39;t to say that ALL EVP&#39;s\n&gt; like this are true messages, I am sure alot are just matrixing.\n&gt;\n&gt; But then that is how the art of scrying starts-matrixing. Like the\n&gt; Rorschach tests. The images you matrix with those gives the psychologist an\n&gt; insight into your mind.\n&gt;\n&gt; By gazing into a dark, reflective surface, you start to see cloudy images.\n&gt; At first, you will just be matrixing faces in the clouds and not getting\n&gt; much substance. Try it, you will see what I am saying. With practice, you\n&gt; start to see clear, concise images.\n&gt;\n&gt; I think that is what happening with audio as well.\n&gt;\n&gt; We already know for a fact pareidolia can occur in audio as well as visual\n&gt; stimulus.\n&gt;\n&gt;\n&gt; ----- Original Message -----\n&gt; *From:* Eric VanDuzer &lt;evanduzer@...&gt;\n&gt; *To:* EVP-ITC@yahoogroups.com\n&gt; *Sent:* Wednesday, May 20, 2009 10:19 AM\n&gt; *Subject:* Re: [EVP-ITC] Re: I have a question.\n&gt;\n&gt;  yes I understand its personal to that particular individual but why can&#39;t\n&gt; I hear it.  I have gotten some very personal EVPs through the traditional\n&gt; investigation way (not through a box or anything of that matter) that all\n&gt; others have heard.\n&gt;\n&gt; On Wed, May 20, 2009 at 12:15 PM, April Abercrombie &lt;\n&gt; april@...&gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;  &quot;If one person is not meant to hear it they won&#39;t hear it (I guess I am\n&gt;&gt; not quite ready to believe that one right yet).&quot;\n&gt;&gt;\n&gt;&gt; I don&#39;t know for sure about that one either, but I am not ready to\n&gt;&gt; discount it either, especially since I stumbled across the possibility of\n&gt;&gt; audible scrying. But I am sure alot of people don&#39;t believe in scrying at\n&gt;&gt; all either.\n&gt;&gt;\n&gt;&gt; What makes it a possibility to me is that so many people are hearing\n&gt;&gt; things that are very personal, but stuff they would not have come up with on\n&gt;&gt; their own.\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;  ----- Original Message -----\n&gt;&gt; *From:* Eric VanDuzer &lt;evanduzer@...&gt;\n&gt;&gt;  *To:* EVP-ITC@yahoogroups.com\n&gt;&gt;  *Sent:* Wednesday, May 20, 2009 10:09 AM\n&gt;&gt; *Subject:* Re: [EVP-ITC] Re: I have a question.\n&gt;&gt;\n&gt;&gt;  I think that is the problem I am having though Jim.  When you say &quot;work\n&gt;&gt; them over till you hear them&quot;  to me I should not have to work them over\n&gt;&gt; till I hear them.  Yes taking out the ambient and background noise is one\n&gt;&gt; thing.  But if you just keep on listening to them with different\n&gt;&gt; enhancements you are bound to hear something (matrixing).  If one person is\n&gt;&gt; not meant to hear it they won&#39;t hear it (I guess I am not quite ready to\n&gt;&gt; believe that one right yet).  I think you all know what I am getting at.\n&gt;&gt;\n&gt;&gt; On Tue, May 19, 2009 at 9:11 PM, James W. Hyslope &lt;clockdryve@...&gt;wrote:\n&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt; Well, for myself...I don&#39;t &quot;clean&quot; them up to much because I really don&#39;t\n&gt;&gt;&gt; know HOW :) (well a little bit)Since I&#39;ve only been at it for a couple\n&gt;&gt;&gt; weeks. BUT if you can clean up something to where you can FIND what was\n&gt;&gt;&gt; there to begin with &quot;you have done no harm&quot; I hear alot more than others I\n&gt;&gt;&gt; guess, and I haven&#39;t enhanced many of my evp&#39;s.*If anyone is able to clean\n&gt;&gt;&gt; them up...I DO promise you will hear what I say is correct)Pretty BOLD\n&gt;&gt;&gt; statement, but if you are able to clean it up with better software (please\n&gt;&gt;&gt; do for others too) I will be more than happy to &quot;listen&quot; where I made a\n&gt;&gt;&gt; mistake...I can only LEARN from it :) I have done some DEEP enhancements to\n&gt;&gt;&gt; a few of my evp&#39;s...from the begining I could only hear clicks and\n&gt;&gt;&gt; thumps.....but after messing with that area, eventually I would hear the\n&gt;&gt;&gt; true voices (and can tell if male or female...approximate age) and\n&gt;&gt;&gt; understand the mood also....these where extreamly modified, and I feel that\n&gt;&gt;&gt; I could NOT have added enough &quot;simple&quot; enhancements that would ADD a\n&gt;&gt;&gt; voice....full of emotion and distinct syllables :) And some just can&#39;t hear\n&gt;&gt;&gt; them for what ever reason be it equipment that is used to hear\n&gt;&gt;&gt; (pc-headphones-speakers-ears) know one has the perfect match of all these\n&gt;&gt;&gt; things. Check out &quot;Jim&#39;s RR-DR60 EVP&#39;s&quot; in the files section....work them\n&gt;&gt;&gt; over till you hear them. I really can&#39;t do much more :)--- In\n&gt;&gt;&gt; EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Eric VanDuzer\n&gt;&gt;&gt; &lt;evanduzer@...&gt; wrote:\n&gt;&gt;&gt; &gt;\n&gt;&gt;&gt; &gt; Now I may be biased to the &quot;investigation&quot; way of doing things. I do\n&gt;&gt;&gt; clean\n&gt;&gt;&gt; &gt; up evps if I hear something and can&#39;t make it out do to ambient noise.\n&gt;&gt;&gt; So\n&gt;&gt;&gt; &gt; hear is my question. When do you stop cleaning up? Wouldn&#39;t to much\n&gt;&gt;&gt; &gt; enhancing &quot;taint&quot; the results? To me the more enhancing you do the less\n&gt;&gt;&gt; &gt; convincing it becomes. I hope noone finds this offensive, it is not\n&gt;&gt;&gt; meant\n&gt;&gt;&gt; &gt; to be I am just really curious. The way I look at it is that if you\n&gt;&gt;&gt; have to\n&gt;&gt;&gt; &gt; do so much enhancing to find anything, was there really something there\n&gt;&gt;&gt; to\n&gt;&gt;&gt; &gt; begin with. Are we just making ourselves believe there is something\n&gt;&gt;&gt; there??\n&gt;&gt;&gt; &gt;\n&gt;&gt;&gt; &gt; Eric\n&gt;&gt;&gt; &gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;\n&gt;   \n&gt;\n\nNice explana ion I like i p obably he bes I ha e hea d hank youOn Wed, May 20, 2009 a 12:35 PM, Ap il Abe c ombie ap il@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n \n \n \n \n\n\n2 di e en hings happening- ha 's why. \nWhen you ge EVP ha e e yone unde s ands, i is ou wa d, in he \nen i onmen . No a communica ion h ough subconscious means.\n \nEVP ha people swea hey hea , bu noone \nelse can make sense, may be a message o hem ia subconscious means. Tha \nisn' o say ha ALL EVP's like his a e ue messages, I am su e alo a e jus \nma ixing.\n \nBu hen ha is how he a o sc ying \ns a s-ma ixing. Like he Ro schach es s. The images you ma ix wi h hose \ngi es he psychologis an insigh in o you mind.\n \nBy gazing in o a da k, e lec i e su ace, \nyou s a o see cloudy images. A i s , you will jus be ma ixing aces in \n he clouds and no ge ing much subs ance. T y i , you will see wha I am \nsaying. Wi h p ac ice, you s a o see \nclea , concise images.\n \nI hink  ha is wha  happening \nwi h audio as well.\n \nWe al eady know o a ac pa eidolia can \noccu in audio as well as isual s imulus.\n \n\n ----- O iginal Message ----- \n \nF om: \n E ic \n VanDuze \n To: EVP-ITC@yahoog oups.com \n\n \nSen : Wednesday, May 20, 2009 10:19 \n AM\n Subjec : Re: [EVP-ITC] Re: I ha e a \n ques ion.\n \n \n yes I unde s and i s pe sonal o ha pa icula indi idual bu why can' I \n hea i .  I ha e go en some e y pe sonal EVPs h ough he adi ional \n in es iga ion way (no h ough a box o any hing o ha ma e ) ha all \n o he s ha e hea d.\n On Wed, May 20, 2009 a 12:15 PM, Ap il Abe c ombie \n ap il@...> \n w o e:\n \n \n \n \n \n \n \"I one pe son is no mean o hea i hey won' hea i (I guess I am \n no qui e eady o belie e ha one igh ye ).\" \n  \n I don' know o su e abou ha one \n ei he , bu I am no eady o discoun i ei he , especially since I \n s umbled ac oss he possibili y o audible sc ying. Bu I am su e alo o \n people don' belie e in sc ying a all ei he .\n  \n Wha makes i a possibili y o me is \n ha so many people a e hea ing hings ha a e e y pe sonal, bu s u \n hey would no ha e come up wi h on hei own.\n  \n  \n \n \n ----- \n O iginal Message ----- \n F om: \n E ic VanDuze \n \n To: \n EVP-ITC@yahoog oups.com \n \n Sen : \n Wednesday, May 20, 2009 10:09 AM\n Subjec : \n Re: [EVP-ITC] Re: I ha e a ques ion.\n \n \n \n I hink ha is he p oblem I am ha ing hough Jim.  When you say \n \"wo k hem o e ill you hea hem\"  o me I should no ha e o wo k \n hem o e ill I hea hem.  Yes aking ou he ambien and \n backg ound noise is one hing.  Bu i you jus keep on lis ening o \n hem wi h di e en enhancemen s you a e bound o hea some hing \n (ma ixing).  I one pe son is no mean o hea i hey won' hea \n i (I guess I am no qui e eady o belie e ha one igh ye ).  I \n hink you all know wha I am ge ing a .  \n On Tue, May 19, 2009 a 9:11 PM, James W. Hyslope \n clockd y e@...> w o e:\n \n \n \n \n \n \n \n \n Well, o mysel ...I don' \"clean\" hem up o much because I eally \n don' know HOW :) (well a li le bi )Since I' e only been a i o a \n couple weeks. BUT i you can clean up some hing o whe e you can FIND \n wha was he e o begin wi h \"you ha e done no ha m\" I hea alo mo e \n han o he s I guess, and I ha en' enhanced many o my e p's.*I anyone \n is able o clean hem up...I DO p omise you will hea wha I say is \n co ec )P e y BOLD s a emen , bu i you a e able o clean i up wi h \n be e so wa e (please do o o he s oo) I will be mo e han happy o \n \"lis en\" whe e I made a mis ake...I can only LEARN om i :) I ha e \n done some DEEP enhancemen s o a ew o my e p's... om he begining I \n could only hea clicks and humps.....bu a e messing wi h ha a ea, \n e en ually I would hea he ue oices (and can ell i male o \n emale...app oxima e age) and unde s and he mood also.... hese \n whe e ex eamly modi ied, and I eel ha I could NOT ha e added enough \n \"simple\" enhancemen s ha would ADD a oice.... ull o emo ion and \n dis inc syllables :) And some jus can' hea hem o wha e e eason \n be i equipmen ha is used o hea \n (pc-headphones-speake s-ea s) know one has he pe ec ma ch \n o all hese hings. Check ou \"Jim's RR-DR60 EVP's\" in he iles \n sec ion....wo k hem o e ill you hea hem. I eally can' do much \n mo e :)--- In EVP-ITC@yahoog oups.com, E ic VanDuze \n w o e:>> Now I may be biased o \n he \"in es iga ion\" way o doing hings. I do clean> up e ps i I \n hea some hing and can' make i ou do o ambien noise. So> \n hea is my ques ion. When do you s op cleaning up? Wouldn' o \n much> enhancing \" ain \" he esul s? To me he mo e enhancing you \n do he less> con incing i becomes. I hope noone inds his \n o ensi e, i is no mean > o be I am jus eally cu ious. The \n way I look a i is ha i you ha e o> do so much enhancing o \n ind any hing, was he e eally some hing he e o> begin wi h. \n A e we jus making ou sel es belie e he e is some hing he e??> \n > E ic>"}