{"id": "14457", "subject": "Re: [EVP-ITC] Re: I have a question.", "author": "Eric VanDuzer", "timestamp": "2009-05-20T16:19:41Z", "full_text": "yes I understand its personal to that particular individual but why can&#39;t I\nhear it.  I have gotten some very personal EVPs through the traditional\ninvestigation way (not through a box or anything of that matter) that all\nothers have heard.\n\nOn Wed, May 20, 2009 at 12:15 PM, April Abercrombie &lt;\napril@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;  &quot;If one person is not meant to hear it they won&#39;t hear it (I guess I am\n&gt; not quite ready to believe that one right yet).&quot;\n&gt;\n&gt; I don&#39;t know for sure about that one either, but I am not ready to discount\n&gt; it either, especially since I stumbled across the possibility of audible\n&gt; scrying. But I am sure alot of people don&#39;t believe in scrying at all\n&gt; either.\n&gt;\n&gt; What makes it a possibility to me is that so many people are hearing things\n&gt; that are very personal, but stuff they would not have come up with on their\n&gt; own.\n&gt;\n&gt;\n&gt;\n&gt; ----- Original Message -----\n&gt; *From:* Eric VanDuzer &lt;evanduzer@...&gt;\n&gt; *To:* EVP-ITC@yahoogroups.com\n&gt; *Sent:* Wednesday, May 20, 2009 10:09 AM\n&gt; *Subject:* Re: [EVP-ITC] Re: I have a question.\n&gt;\n&gt;  I think that is the problem I am having though Jim.  When you say &quot;work\n&gt; them over till you hear them&quot;  to me I should not have to work them over\n&gt; till I hear them.  Yes taking out the ambient and background noise is one\n&gt; thing.  But if you just keep on listening to them with different\n&gt; enhancements you are bound to hear something (matrixing).  If one person is\n&gt; not meant to hear it they won&#39;t hear it (I guess I am not quite ready to\n&gt; believe that one right yet).  I think you all know what I am getting at.\n&gt;\n&gt; On Tue, May 19, 2009 at 9:11 PM, James W. Hyslope &lt;clockdryve@...&gt;wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; Well, for myself...I don&#39;t &quot;clean&quot; them up to much because I really don&#39;t\n&gt;&gt; know HOW :) (well a little bit)Since I&#39;ve only been at it for a couple\n&gt;&gt; weeks. BUT if you can clean up something to where you can FIND what was\n&gt;&gt; there to begin with &quot;you have done no harm&quot; I hear alot more than others I\n&gt;&gt; guess, and I haven&#39;t enhanced many of my evp&#39;s.*If anyone is able to clean\n&gt;&gt; them up...I DO promise you will hear what I say is correct)Pretty BOLD\n&gt;&gt; statement, but if you are able to clean it up with better software (please\n&gt;&gt; do for others too) I will be more than happy to &quot;listen&quot; where I made a\n&gt;&gt; mistake...I can only LEARN from it :) I have done some DEEP enhancements to\n&gt;&gt; a few of my evp&#39;s...from the begining I could only hear clicks and\n&gt;&gt; thumps.....but after messing with that area, eventually I would hear the\n&gt;&gt; true voices (and can tell if male or female...approximate age) and\n&gt;&gt; understand the mood also....these where extreamly modified, and I feel that\n&gt;&gt; I could NOT have added enough &quot;simple&quot; enhancements that would ADD a\n&gt;&gt; voice....full of emotion and distinct syllables :) And some just can&#39;t hear\n&gt;&gt; them for what ever reason be it equipment that is used to hear\n&gt;&gt; (pc-headphones-speakers-ears) know one has the perfect match of all these\n&gt;&gt; things. Check out &quot;Jim&#39;s RR-DR60 EVP&#39;s&quot; in the files section....work them\n&gt;&gt; over till you hear them. I really can&#39;t do much more :)--- In\n&gt;&gt; EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Eric VanDuzer\n&gt;&gt; &lt;evanduzer@...&gt; wrote:\n&gt;&gt; &gt;\n&gt;&gt; &gt; Now I may be biased to the &quot;investigation&quot; way of doing things. I do\n&gt;&gt; clean\n&gt;&gt; &gt; up evps if I hear something and can&#39;t make it out do to ambient noise.\n&gt;&gt; So\n&gt;&gt; &gt; hear is my question. When do you stop cleaning up? Wouldn&#39;t to much\n&gt;&gt; &gt; enhancing &quot;taint&quot; the results? To me the more enhancing you do the less\n&gt;&gt; &gt; convincing it becomes. I hope noone finds this offensive, it is not\n&gt;&gt; meant\n&gt;&gt; &gt; to be I am just really curious. The way I look at it is that if you have\n&gt;&gt; to\n&gt;&gt; &gt; do so much enhancing to find anything, was there really something there\n&gt;&gt; to\n&gt;&gt; &gt; begin with. Are we just making ourselves believe there is something\n&gt;&gt; there??\n&gt;&gt; &gt;\n&gt;&gt; &gt; Eric\n&gt;&gt; &gt;\n&gt;&gt;\n&gt;&gt;\n&gt;   \n&gt;\n\nyes I unde s and i s pe sonal o ha pa icula indi idual bu why can' I hea i .  I ha e go en some e y pe sonal EVPs h ough he adi ional in es iga ion way (no h ough a box o any hing o ha ma e ) ha all o he s ha e hea d.\nOn Wed, May 20, 2009 a 12:15 PM, Ap il Abe c ombie ap il@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n \n \n \n \n\n\n\"I one pe son is no mean o hea i hey won' hea i (I guess I am no \nqui e eady o belie e ha one igh ye ).\" \n \nI don' know o su e abou ha one ei he , \nbu I am no eady o discoun i ei he , especially since I s umbled \nac oss he possibili y o audible sc ying. Bu I am su e alo o people don' \nbelie e in sc ying a all ei he .\n \nWha makes i a possibili y o me is ha so \nmany people a e hea ing hings ha a e e y pe sonal, bu s u hey would no \nha e come up wi h on hei own.\n \n \n\n ----- O iginal Message ----- \n \nF om: \n E ic \n VanDuze \n To: EVP-ITC@yahoog oups.com \n\n Sen : Wednesday, May 20, 2009 10:09 \n AM\n Subjec : Re: [EVP-ITC] Re: I ha e a \n ques ion.\n \n \n I hink ha is he p oblem I am ha ing hough Jim.  When you say \n \"wo k hem o e ill you hea hem\"  o me I should no ha e o wo k hem \n o e ill I hea hem.  Yes aking ou he ambien and backg ound noise \n is one hing.  Bu i you jus keep on lis ening o hem wi h di e en \n enhancemen s you a e bound o hea some hing (ma ixing).  I one pe son \n is no mean o hea i hey won' hea i (I guess I am no qui e eady o \n belie e ha one igh ye ).  I hink you all know wha I am ge ing \n a .  \n On Tue, May 19, 2009 a 9:11 PM, James W. Hyslope clockd y e@...> \n w o e:\n \n \n \n \n \n \n \n Well, o mysel ...I don' \"clean\" hem up o much because I eally don' \n know HOW :) (well a li le bi )Since I' e only been a i o a couple \n weeks. BUT i you can clean up some hing o whe e you can FIND wha was \n he e o begin wi h \"you ha e done no ha m\" I hea alo mo e han o he s I \n guess, and I ha en' enhanced many o my e p's.*I anyone is able o clean \n hem up...I DO p omise you will hea wha I say is co ec )P e y BOLD \n s a emen , bu i you a e able o clean i up wi h be e so wa e (please \n do o o he s oo) I will be mo e han happy o \"lis en\" whe e I made a \n mis ake...I can only LEARN om i :) I ha e done some DEEP enhancemen s o \n a ew o my e p's... om he begining I could only hea clicks and \n humps.....bu a e messing wi h ha a ea, e en ually I would hea he \n ue oices (and can ell i male o emale...app oxima e age) and \n unde s and he mood also.... hese whe e ex eamly modi ied, and I eel ha \n I could NOT ha e added enough \"simple\" enhancemen s ha would ADD a \n oice.... ull o emo ion and dis inc syllables :) And some jus can' hea \n hem o wha e e eason be i equipmen ha is used o hea \n (pc-headphones-speake s-ea s) know one has he pe ec ma ch o \n all hese hings. Check ou \"Jim's RR-DR60 EVP's\" in he iles \n sec ion....wo k hem o e ill you hea hem. I eally can' do much mo e \n :)--- In EVP-ITC@yahoog oups.com, E ic VanDuze \n w o e:>> Now I may be biased o he \n \"in es iga ion\" way o doing hings. I do clean> up e ps i I hea \n some hing and can' make i ou do o ambien noise. So> hea is my \n ques ion. When do you s op cleaning up? Wouldn' o much> enhancing \n \" ain \" he esul s? To me he mo e enhancing you do he less> \n con incing i becomes. I hope noone inds his o ensi e, i is no \n mean > o be I am jus eally cu ious. The way I look a i is ha \n i you ha e o> do so much enhancing o ind any hing, was he e \n eally some hing he e o> begin wi h. A e we jus making ou sel es \n belie e he e is some hing he e??> > \n E ic>"}