{"id": "14462", "subject": "Re: [EVP-ITC] Re: I have a question.", "author": "Eric VanDuzer", "timestamp": "2009-05-20T17:16:04Z", "full_text": "Actually that I would buy into  But the question I have when you say &quot;tape&quot;\nare you talking old analog tape or digi recording.  Here is the reason I\nbelieve it can be do &quot;real-time&quot;.  As you all know we use electromagnetic\nField detectors in field investigations.  If a spirit can manipulate that\nwith to show that they are there by giving off a EM field whose to say they\ncan&#39;t manipulate a magnetic strip of a tape or even the electronics in a\nDigi recorder to speak in &quot;real-time&quot;.\n\nOn Wed, May 20, 2009 at 1:01 PM, Kristin Morris &lt;ckmorris95@...&gt;wrote:\n\n&gt;\n&gt;\n&gt;  Okay I have another one for you to think about.. I tape a session and\n&gt; review it later..  even a day later.  Upon review the message that comes\n&gt; over is about something that ‘just happened’ while I was reviewing or\n&gt; happened after taping?  Is it possible that spirit can manipulate the\n&gt; recording AFTER recording has stopped or even manipulate the audio while\n&gt; reviewing?\n&gt;\n&gt;\n&gt;\n&gt; An give you an example of this I was recording one day and I reviewed the\n&gt; audio the next day.  While reviewing – about half way through – the message\n&gt; “Your mother is calling” was found.  I saved it and moved on and within two\n&gt; seconds my mom called.  You say it is a coincidence except that I hadn’t\n&gt; spoken to my mother in over a year.  During this same conversation with her\n&gt; – we sorta made amends and I told her the story of the ‘secret’ I had found\n&gt; out about a family member having a child out of wedlock in the late 1920s.\n&gt; Quick backstory.. I found out about this out-of-wedlock birth through my\n&gt; genealogy research and contacted spirit through the box and I was promptly\n&gt; told to keep it secret and which I promised to do…\n&gt;\n&gt;\n&gt;\n&gt; Well in this conversation with my mom after not speaking for a year I told\n&gt; her what I had found out.  When the telephone conversation ended with my\n&gt; mom… I was amazed that the recording had told me she would call right be\n&gt; fore she did – even though the audio was recorded the previous day.  I\n&gt; proceeded to go back to reviewing the audio and the very first thing I heard\n&gt; was:  THAT WAS SUPPOSED TO BE A SECRET – YOU LIED.\n&gt;\n&gt;\n&gt;\n&gt; Maybe they can manipulate ‘real-time’ literally????\n&gt;\n&gt;\n&gt;\n&gt; k\n&gt;\n&gt;\n&gt;  ------------------------------\n&gt;\n&gt; *From:* EVP-ITC@yahoogroups.com [mailto:EVP-ITC@yahoogroups.com] *On\n&gt; Behalf Of *April Abercrombie\n&gt; *Sent:* Wednesday, May 20, 2009 11:36 AM\n&gt; *To:* EVP-ITC@yahoogroups.com\n&gt; *Subject:* Re: [EVP-ITC] Re: I have a question.\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;   2 different things happening-that&#39;s why. When you get EVP that everyone\n&gt; understands, it is outward, in the environment. Not a communication through\n&gt; subconscious means.\n&gt;\n&gt;\n&gt;\n&gt; EVP that people swear they hear, but noone else can make sense, may be a\n&gt; message to them via subconscious means. That isn&#39;t to say that ALL EVP&#39;s\n&gt; like this are true messages, I am sure alot are just matrixing.\n&gt;\n&gt;\n&gt;\n&gt; But then that is how the art of scrying starts-matrixing. Like the\n&gt; Rorschach tests. The images you matrix with those gives the psychologist an\n&gt; insight into your mind.\n&gt;\n&gt;\n&gt;\n&gt; By gazing into a dark, reflective surface, you start to see cloudy images.\n&gt; At first, you will just be matrixing faces in the clouds and not getting\n&gt; much substance. Try it, you will see what I am saying. With practice, you\n&gt; start to see clear, concise images.\n&gt;\n&gt;\n&gt;\n&gt; I think that is what happening with audio as well.\n&gt;\n&gt;\n&gt;\n&gt; We already know for a fact pareidolia can occur in audio as well as visual\n&gt; stimulus.\n&gt;\n&gt;\n&gt;\n&gt;  ----- Original Message -----\n&gt;\n&gt; *From:* Eric VanDuzer &lt;evanduzer@...&gt;\n&gt;\n&gt; *To:* EVP-ITC@yahoogroups.com\n&gt;\n&gt; *Sent:* Wednesday, May 20, 2009 10:19 AM\n&gt;\n&gt; *Subject:* Re: [EVP-ITC] Re: I have a question.\n&gt;\n&gt;\n&gt;\n&gt; yes I understand its personal to that particular individual but why can&#39;t I\n&gt; hear it.  I have gotten some very personal EVPs through the traditional\n&gt; investigation way (not through a box or anything of that matter) that all\n&gt; others have heard.\n&gt;\n&gt; On Wed, May 20, 2009 at 12:15 PM, April Abercrombie &lt;\n&gt; april@...&gt; wrote:\n&gt;\n&gt;\n&gt;\n&gt; &quot;If one person is not meant to hear it they won&#39;t hear it (I guess I am not\n&gt; quite ready to believe that one right yet).&quot;\n&gt;\n&gt;\n&gt;\n&gt; I don&#39;t know for sure about that one either, but I am not ready to discount\n&gt; it either, especially since I stumbled across the possibility of audible\n&gt; scrying. But I am sure alot of people don&#39;t believe in scrying at all\n&gt; either.\n&gt;\n&gt;\n&gt;\n&gt; What makes it a possibility to me is that so many people are hearing things\n&gt; that are very personal, but stuff they would not have come up with on their\n&gt; own.\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;  ----- Original Message -----\n&gt;\n&gt; *From:* Eric VanDuzer &lt;evanduzer@gmail.com&gt;\n&gt;\n&gt; *To:* EVP-ITC@yahoogroups.com\n&gt;\n&gt; *Sent:* Wednesday, May 20, 2009 10:09 AM\n&gt;\n&gt; *Subject:* Re: [EVP-ITC] Re: I have a question.\n&gt;\n&gt;\n&gt;\n&gt; I think that is the problem I am having though Jim.  When you say &quot;work\n&gt; them over till you hear them&quot;  to me I should not have to work them over\n&gt; till I hear them.  Yes taking out the ambient and background noise is one\n&gt; thing.  But if you just keep on listening to them with different\n&gt; enhancements you are bound to hear something (matrixing).  If one person is\n&gt; not meant to hear it they won&#39;t hear it (I guess I am not quite ready to\n&gt; believe that one right yet).  I think you all know what I am getting at.\n&gt;\n&gt; On Tue, May 19, 2009 at 9:11 PM, James W. Hyslope &lt;clockdryve@...&gt;\n&gt; wrote:\n&gt;\n&gt;\n&gt;\n&gt; Well, for myself...I don&#39;t &quot;clean&quot; them up to much because I really don&#39;t\n&gt; know HOW :) (well a little bit)Since I&#39;ve only been at it for a couple\n&gt; weeks. BUT if you can clean up something to where you can FIND what was\n&gt; there to begin with &quot;you have done no harm&quot; I hear alot more than others I\n&gt; guess, and I haven&#39;t enhanced many of my evp&#39;s.*If anyone is able to clean\n&gt; them up...I DO promise you will hear what I say is correct)Pretty BOLD\n&gt; statement, but if you are able to clean it up with better software (please\n&gt; do for others too) I will be more than happy to &quot;listen&quot; where I made a\n&gt; mistake...I can only LEARN from it :) I have done some DEEP enhancements to\n&gt; a few of my evp&#39;s...from the begining I could only hear clicks and\n&gt; thumps.....but after messing with that area, eventually I would hear the\n&gt; true voices (and can tell if male or female...approximate age) and\n&gt; understand the mood also....these where extreamly modified, and I feel that\n&gt; I could NOT have added enough &quot;simple&quot; enhancements that would ADD a\n&gt; voice....full of emotion and distinct syllables :) And some just can&#39;t hear\n&gt; them for what ever reason be it equipment that is used to hear\n&gt; (pc-headphones-speakers-ears) know one has the perfect match of all these\n&gt; things. Check out &quot;Jim&#39;s RR-DR60 EVP&#39;s&quot; in the files section....work them\n&gt; over till you hear them. I really can&#39;t do much more :)--- In\n&gt; EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Eric VanDuzer\n&gt; &lt;evanduzer@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Now I may be biased to the &quot;investigation&quot; way of doing things. I do\n&gt; clean\n&gt; &gt; up evps if I hear something and can&#39;t make it out do to ambient noise. So\n&gt; &gt; hear is my question. When do you stop cleaning up? Wouldn&#39;t to much\n&gt; &gt; enhancing &quot;taint&quot; the results? To me the more enhancing you do the less\n&gt; &gt; convincing it becomes. I hope noone finds this offensive, it is not meant\n&gt; &gt; to be I am just really curious. The way I look at it is that if you have\n&gt; to\n&gt; &gt; do so much enhancing to find anything, was there really something there\n&gt; to\n&gt; &gt; begin with. Are we just making ourselves believe there is something\n&gt; there??\n&gt; &gt;\n&gt; &gt; Eric\n&gt; &gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;   \n&gt;\n\nAc ually ha I would buy in o  Bu he ques ion I ha e when you say \" ape\" a e you alking old analog ape o digi eco ding.  He e is he eason I belie e i can be do \" eal- ime\".  As you all know we use elec omagne ic Field de ec o s in ield in es iga ions.  I a spi i can manipula e ha wi h o show ha hey a e he e by gi ing o a EM ield whose o say hey can' manipula e a magne ic s ip o a ape o e en he elec onics in a Digi eco de o speak in \" eal- ime\".\nOn Wed, May 20, 2009 a 1:01 PM, K is in Mo is ckmo is95@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n \n \n \n \n\n\n\n\n\n\n\nOkay I ha e ano he one o you o hink\nabou .. I ape a session and e iew i la e ..  e en a day la e . \nUpon e iew he message ha comes o e is abou some hing ha ‘jus \nhappened’ while I was e iewing o happened a e aping?  Is i \npossible ha spi i can manipula e he eco ding AFTER eco ding has s opped\no e en manipula e he audio while e iewing?\n\n \n\nAn gi e you an example o his I was eco ding\none day and I e iewed he audio he nex day.  While e iewing –\nabou hal way h ough – he message “You mo he is calling”\nwas ound.  I sa ed i and mo ed on and wi hin wo seconds my mom\ncalled.  You say i is a coincidence excep ha I hadn’ spoken o\nmy mo he in o e a yea .  Du ing his same con e sa ion wi h he –\nwe so a made amends and I old he he s o y o he ‘sec e ’ I had\n ound ou abou a amily membe ha ing a child ou o wedlock in he la e 1920s. \nQuick backs o y.. I ound ou abou his ou -o -wedlock bi h h ough my genealogy\n esea ch and con ac ed spi i h ough he box and I was p omp ly old o keep\ni sec e and which I p omised o do…\n\n \n\nWell in his con e sa ion wi h my mom\na e no speaking o a yea I old he wha I had ound ou .  When he elephone\ncon e sa ion ended wi h my mom… I was amazed ha he eco ding had old\nme she would call igh be o e she did – e en hough he audio was\n eco ded he p e ious day.  I p oceeded o go back o e iewing he audio\nand he e y i s hing I hea d was:  THAT WAS SUPPOSED TO BE A SECRET –\nYOU LIED.\n\n \n\nMaybe hey can manipula e ‘ eal- ime’\nli e ally????\n\n \n\nk\n\n \n\n\n\n\n\n\n\n\n\nF om: EVP-ITC@yahoog oups.com [mail o:EVP-ITC@yahoog oups.com] On Behal O Ap il Abe c ombie\n\nSen : Wednesday, May 20, 2009\n11:36 AM\nTo: EVP-ITC@yahoog oups.com\nSubjec : Re: [EVP-ITC] Re: I ha e\na ques ion.\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n2\ndi e en hings happening- ha 's why. When you ge EVP ha e e yone\nunde s ands, i is ou wa d, in he en i onmen . No a communica ion\n h ough subconscious means.\n\n\n\n\n\n \n\n\n\n\n\nEVP ha people swea hey hea , bu noone else can\nmake sense, may be a message o hem ia subconscious means. Tha isn' o\nsay ha ALL EVP's like his a e ue messages, I am su e alo a e jus \nma ixing.\n\n\n\n\n\n \n\n\n\n\n\nBu hen ha is how he a o sc ying\ns a s-ma ixing. Like he Ro schach es s. The images you ma ix wi h hose\ngi es he psychologis an insigh in o you mind.\n\n\n\n\n\n \n\n\n\n\n\nBy gazing in o a da k, e lec i e su ace, you s a \n o see cloudy images. A i s , you will jus be ma ixing aces in he clouds\nand no ge ing much subs ance. T y i , you will see wha I am saying. Wi h\np ac ice, you s a o see clea , concise images.\n\n\n\n\n\n \n\n\n\n\n\nI hink  ha is wha  happening wi h audio\nas well.\n\n\n\n\n\n \n\n\n\n\n\nWe al eady know o a ac pa eidolia can occu in\naudio as well as isual s imulus.\n\n\n\n\n\n \n\n\n\n\n\n\n\n----- O iginal Message ----- \n\n\n\n\n\nF om: E ic VanDuze \n\n\n\n\n\n\nTo: EVP-ITC@yahoog oups.com\n\n\n\n\n\n\nSen : Wednesday, May 20,\n2009 10:19 AM\n\n\n\n\n\nSubjec : Re: [EVP-ITC] Re:\nI ha e a ques ion.\n\n\n\n\n\n \n\n\n\n\n\nyes I unde s and i s pe sonal o ha pa icula \nindi idual bu why can' I hea i .  I ha e go en some e y pe sonal EVPs\n h ough he adi ional in es iga ion way (no h ough a box o any hing o \n ha ma e ) ha all o he s ha e hea d.\n\n\n\nOn Wed, May 20, 2009 a 12:15 PM, Ap il Abe c ombie ap il@...>\nw o e:\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\"I one pe son is no mean o hea i hey won' \nhea i (I guess I am no qui e eady o belie e ha one igh \nye ).\" \n\n\n\n\n\n \n\n\n\n\n\n\n\n\nI don' know o su e abou \n ha one ei he , bu I am no eady o discoun i ei he , especially since I\ns umbled ac oss he possibili y o audible sc ying. Bu I am su e alo o \npeople don' belie e in sc ying a all ei he .\n\n\n\n\n\n \n\n\n\n\n\n\nWha makes i a possibili y\n o me is ha so many people a e hea ing hings ha a e e y pe sonal, bu \ns u hey would no ha e come up wi h on hei own.\n\n\n\n\n\n \n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n----- O iginal Message ----- \n\n\n\n\n\n\nF om: E ic\nVanDuze \n\n\n\n\n\n\n\n\n\nTo: EVP-ITC@yahoog oups.com \n\n\n\n\n\n\n\n\n\n\nSen : Wednesday,\nMay 20, 2009 10:09 AM\n\n\n\n\n\nSubjec : Re:\n[EVP-ITC] Re: I ha e a ques ion.\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\nI hink ha is he\np oblem I am ha ing hough Jim.  When you say \"wo k hem o e ill\nyou hea hem\"  o me I should no ha e o wo k hem o e ill I hea \n hem.  Yes aking ou he ambien and backg ound noise is one hing. \nBu i you jus keep on lis ening o hem wi h di e en enhancemen s you a e\nbound o hea some hing (ma ixing).  I one pe son is no mean o hea \ni hey won' hea i (I guess I am no qui e eady o belie e ha one igh \nye ).  I hink you all know wha I am ge ing a .  \n\n\n\nOn Tue, May 19, 2009 a 9:11 PM, James W. Hyslope clockd y e@...>\nw o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nWell, o mysel ...I\ndon' \"clean\" hem up o much because I eally don' know HOW :)\n(well a li le bi )Since I' e only been a i o a couple weeks. BUT i you\ncan clean up some hing o whe e you can FIND wha was he e o begin wi h\n\"you ha e done no ha m\" I hea alo mo e han o he s I guess, and I\nha en' enhanced many o my e p's.*I anyone is able o clean hem up...I DO\np omise you will hea wha I say is co ec )P e y BOLD s a emen , bu i you\na e able o clean i up wi h be e so wa e (please do o o he s oo) I will\nbe mo e han happy o \"lis en\" whe e I made a mis ake...I can only\nLEARN om i :) I ha e done some DEEP enhancemen s o a ew o my e p's... om\n he begining I could only hea clicks and humps.....bu a e messing wi h\n ha a ea, e en ually I would hea he ue oices (and can ell i male o \n emale...app oxima e age) and unde s and he mood also.... hese whe e\nex eamly modi ied, and I eel ha I could NOT ha e added enough\n\"simple\" enhancemen s ha would ADD a oice.... ull o emo ion and\ndis inc syllables :) And some jus can' hea hem o wha e e eason be i \nequipmen ha is used o hea (pc-headphones-speake s-ea s) know one\nhas he pe ec ma ch o all hese hings. Check ou \"Jim's RR-DR60\nEVP's\" in he iles sec ion....wo k hem o e ill you hea hem. I eally\ncan' do much mo e :)--- In EVP-ITC@yahoog oups.com, E ic VanDuze \nw o e:\n>\n> Now I may be biased o he \"in es iga ion\" way o doing hings.\nI do clean\n> up e ps i I hea some hing and can' make i ou do o ambien noise. So\n> hea is my ques ion. When do you s op cleaning up? Wouldn' o much\n> enhancing \" ain \" he esul s? To me he mo e enhancing you do\n he less\n> con incing i becomes. I hope noone inds his o ensi e, i is no mean \n> o be I am jus eally cu ious. The way I look a i is ha i you ha e\n o\n> do so much enhancing o ind any hing, was he e eally some hing he e o\n> begin wi h. A e we jus making ou sel es belie e he e is some hing\n he e??\n> \n> E ic\n>"}