{"id": "14559", "subject": "Re: [EVP-ITC] Perception is Probabilistic", "author": "Frank Ratka", "timestamp": "2009-05-21T15:36:01Z", "full_text": "--0-68652002-1242920161=:39351\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nInteresting find, though not completely surprising. This very well could be=\r\n an explanation for why two people in close proximity perceive different th=\r\nings. It can also be explained by simply not focusing ones attention or hav=\r\ning a persons expectations manifest via personal perception.\n=A0\nI did a li=\r\nttle research a while ago on using an=A0ultrasounic, non-linear acoustic si=\r\ngnal as a carrier wave for audible sound. What happens with this phenomena =\r\nis an audible signal is embedded and transmitted through the air and is cal=\r\nculated to demodulate at certain points in three dimensional space. In othe=\r\nr words we could transmit sound that is inaudible to anyone else around and=\r\n have it manifest in a 3D bubble where ever we wanted. A person standing on=\r\nly 2 feet away could not hear the music or speech that the person in the be=\r\nam could.\n=A0\nIf for some reason you believe it impossible take a look at t=\r\nhe work of=A0Dr. Joseph Pompeii. He use to work for Bose and=A0since receiv=\r\ned his PhD from MIT in aucoustics. He invented and owns exclusive rights to=\r\n what he calls the audio spotlight (google it). \n=A0\nNow, I said all that t=\r\no say this...if it is possible to do this with sound of a low vibration rid=\r\ning energy of a higher vibration then could it also be possbile for a entit=\r\ny of a higher vibration demodulating to a lower vibration=A0and manifesting=\r\n physically. All things in the universe consist of energic vibrations oscil=\r\nlating at different rates and at different vectors, even what we perceive a=\r\ns solid! Is this possible, if not why?\n=A0\nRegards,\n=A0\nFrank R.\n\n--- On Th=\r\nu, 5/21/09, phenom_investigator &lt;phenom_investigator@...&gt; wrote:\n\n\nFr=\r\nom: phenom_investigator &lt;phenom_investigator@...&gt;\nSubject: [EVP-ITC] =\r\nPerception is Probabilistic\nTo: EVP-ITC@yahoogroups.com\nDate: Thursday, May=\r\n 21, 2009, 9:52 AM\n\n\n\n\n\n\n\n\nThought these comments might be interesting in l=\r\night of recent\nthreads. Dr. Sam El-Khazen recently published an article in =\r\nthe\nJournal of Neuroquantology (study of brain function at the quantum\nmech=\r\nanical level). In this paper entitled &quot;DNA The Gateway to\nTime&quot;, El-Khazen =\r\ntalks about the relationship between the structure\nof DNA, time, conscious =\r\nperception and gravity. There is credible\nevidence that these are intimatel=\r\ny correlated. \n\nAn important finding for this group has to do with how we m=\r\nay in\nfact detect external influences in the physical world. If El-Khazen\nh=\r\nas it right, two EM waves must align in order for the preception\nprocess to=\r\n even begin. If this does not happen, there is nothing to\nperceive, even th=\r\nough we may be impacted by an external potentially\ninfluencing EM wave. The=\r\n second wave is generated from borrowed\nenergy within our brain cells and i=\r\ns modelled upon the structure of\nDNA strands. So yes we are impacted by bil=\r\nlions of EM signals per\nsecond but we actually detect only a small portion =\r\nof these that we\nlater process in the late-stage perceptual processes. \n\nTh=\r\nis would nicely explain why two people would perceive events\ndifferently de=\r\nspite the fact that they were literally side by side\nwitnessing the same ev=\r\nent. Again this is strictly a matter of\nrandom probability, it seems to hav=\r\ne nothing whatsoever to do with\nvolition or intention. That is more the foc=\r\nus of the later\nperceptual processing which is in turn dependent upon this\n=\r\nprobabilistic process.\n\nThis could also explain why it is that EVP and ITC =\r\nsignals are\nperceived differently by different people even when no physical=\r\n\nalteration to the media has occurred and why different things are\nheard mo=\r\nre easily at different times by the same person.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n      \r\n--0-68652002-1242920161=:39351\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;DIV&gt;Interesting find, though not completely =\r\nsurprising. This very well could be an explanation for why two people in cl=\r\nose proximity perceive different things. It can also be explained by simply=\r\n not focusing ones attention or having a persons expectations manifest via =\r\npersonal perception.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I did a little research a=\r\n while ago on using an&nbsp;ultrasounic, non-linear acoustic signal as a ca=\r\nrrier wave for audible sound. What happens with this phenomena is an audibl=\r\ne signal is embedded and transmitted through the air and is calculated to d=\r\nemodulate at certain points in three dimensional space. In other words we c=\r\nould transmit sound that is inaudible to anyone else around and have it man=\r\nifest in a 3D bubble where ever we wanted. A person standing only 2 feet aw=\r\nay could not hear the music or speech that the person in the beam could.&lt;/D=\r\nIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;If for some reason you believe it impossible tak=\r\ne a look at the work of&nbsp;Dr. Joseph Pompeii. He use to work for Bose an=\r\nd&nbsp;since received his PhD from MIT in aucoustics. He invented and owns =\r\nexclusive rights to what he calls the audio spotlight (google it). &lt;/DIV&gt;\n&lt;=\r\nDIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Now, I said all that to say this...if it is possible =\r\nto do this with sound of a low vibration riding energy of a higher vibratio=\r\nn then could it also be possbile for a entity of a higher vibration demodul=\r\nating to a lower vibration&nbsp;and manifesting physically. All things in t=\r\nhe universe consist of energic vibrations oscillating at different rates an=\r\nd at different vectors, even what we perceive as solid! Is this possible, i=\r\nf not why?&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Regards,&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;D=\r\nIV&gt;Frank R.&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Thu, 5/21/09, phenom_investigator &lt;I&gt;&lt;pheno=\r\nm_investigator@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;&lt;/DIV&gt;\n&lt;BLOCKQUOTE style=3D&quot;=\r\nBORDER-LEFT: rgb(16,16,255) 2px solid; PADDING-LEFT: 5px; MARGIN-LEFT: 5px&quot;=\r\n&gt;&lt;BR&gt;From: phenom_investigator &lt;phenom_investigator@...&gt;&lt;BR&gt;Sub=\r\nject: [EVP-ITC] Perception is Probabilistic&lt;BR&gt;To: EVP-ITC@yahoogroups.com&lt;=\r\nBR&gt;Date: Thursday, May 21, 2009, 9:52 AM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3Dyiv990798172&gt;\n&lt;D=\r\nIV id=3Dygrp-text&gt;\n&lt;DIV&gt;Thought these comments might be interesting in ligh=\r\nt of recent&lt;BR&gt;threads. Dr. Sam El-Khazen recently published an article in =\r\nthe&lt;BR&gt;Journal of Neuroquantology (study of brain function at the quantum&lt;B=\r\nR&gt;mechanical level). In this paper entitled &quot;DNA The Gateway to&lt;BR&gt;Time&quot;, E=\r\nl-Khazen talks about the relationship between the structure&lt;BR&gt;of DNA, time=\r\n, conscious perception and gravity. There is credible&lt;BR&gt;evidence that thes=\r\ne are intimately correlated. &lt;BR&gt;&lt;BR&gt;An important finding for this group ha=\r\ns to do with how we may in&lt;BR&gt;fact detect external influences in the physic=\r\nal world. If El-Khazen&lt;BR&gt;has it right, two EM waves must align in order fo=\r\nr the preception&lt;BR&gt;process to even begin. If this does not happen, there i=\r\ns nothing to&lt;BR&gt;perceive, even though we may be impacted by an external pot=\r\nentially&lt;BR&gt;influencing EM wave. The second wave is generated from borrowed=\r\n&lt;BR&gt;energy within our brain cells and is modelled upon the structure of&lt;BR&gt;=\r\nDNA strands.\n So yes we are impacted by billions of EM signals per&lt;BR&gt;secon=\r\nd but we actually detect only a small portion of these that we&lt;BR&gt;later pro=\r\ncess in the late-stage perceptual processes. &lt;BR&gt;&lt;BR&gt;This would nicely expl=\r\nain why two people would perceive events&lt;BR&gt;differently despite the fact th=\r\nat they were literally side by side&lt;BR&gt;witnessing the same event. Again thi=\r\ns is strictly a matter of&lt;BR&gt;random probability, it seems to have nothing w=\r\nhatsoever to do with&lt;BR&gt;volition or intention. That is more the focus of th=\r\ne later&lt;BR&gt;perceptual processing which is in turn dependent upon this&lt;BR&gt;pr=\r\nobabilistic process.&lt;BR&gt;&lt;BR&gt;This could also explain why it is that EVP and =\r\nITC signals are&lt;BR&gt;perceived differently by different people even when no p=\r\nhysical&lt;BR&gt;alteration to the media has occurred and why different things ar=\r\ne&lt;BR&gt;heard more easily at different times by the same person.&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;=\r\n&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n      \r\n--0-68652002-1242920161=:39351--"}