{"id": "14556", "subject": "Re: Ebay auction for sorta Frank&#39;s Box?", "author": "Kristin", "timestamp": "2009-05-21T15:28:45Z", "full_text": "This is the third time I have tried to send this message... errr .. I must be getting caught in the spam filter.  ANyway..\n\nReally if you think about it the guy isn&#39;t doing anything wrong per se..  He makes claims and offers a disclaimer.  His biggest mistake is what feel is the ethical decision to sell a Radio Shack radio without disclosing that this could be done on their own.  But add in the software and the price then doesn&#39;t seem so unrealistic.  But that IJMHO.  Of course his misinformed info about Frank and his boxes is ridiculous but he might actually believe this all to be true.   So in the end again I say Caveat emptor..  \n\nAlso - the software is an OEM version which means he has authorization to &#39;bundle&#39; the software with products from the makers of Adobe.  I worked for 12 years in the computer industry and to sell/bundle unopened OEM product you must be an manufacturer approved OEM vendor.  He is probably not breaking any laws there either..\n\nSo really it&#39;s just his inaccurate info about Frank and his boxes which unfortunately happens all the time.  If people want to speak in public about stuff they have no knowledge they open themselves up to all kinds of things.. but with this guy - unfortunately it will just be our ridicule.\nk\n\n--- In EVP-ITC@yahoogroups.com, don powell &lt;dpowell7299@...&gt; wrote:\n&gt;\n&gt; Actually, I&#39;d report them to eBay for giving away pirated software! :)  He says he will give you a copy of Adobe Audition free.  I&#39;d think adobe might have something to say about that... \n&gt; \n&gt; Don\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; ________________________________\n&gt; From: April Abercrombie &lt;april@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Thursday, May 21, 2009 10:12:23 AM\n&gt; Subject: Re: [EVP-ITC] Re: Ebay auction for sorta Frank&#39;s Box?\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; The Fraud part is what he is saying about \n&gt; you Frank, that you charge thousands of dollars for your boxes.\n&gt;  \n&gt; ----- Original Message ----- \n&gt; From: Frank Sumption \n&gt; To: EVP-ITC@yahoogroups .com \n&gt; Sent: Thursday, May 21, 2009 9:10 \n&gt; AM\n&gt; Subject: Re: [EVP-ITC] Re: Ebay auction  for sorta Frank&#39;s Box?\n&gt; \n&gt;  It&#39;s not fraud, these hack boxes work, it&#39;s just the guy has no  clue how it works, and trends mis-represent it&#39;s function.  RS is in fact  discontiuing the radios, although there appears the other--more expensive  radios that would work as boxes. \n&gt;  \n&gt;  I know, I get kinda harsh, but if someone to set themselves up as  experts, at least understand the damn concepts  involved. Don&#39;t keep  regurgitating the same urban myth crap that everyone else throws out there as  facts.\n&gt;  \n&gt;  Frank-S\n&gt;"}