{"id": "14602", "subject": "Re: Hi and a couple of questions", "author": "Not given", "timestamp": "2009-05-22T17:34:18Z", "full_text": "Thanks a bunch kristin!\n\nSigned up for the esnips account as well. Guess I&#39;ll stick with the 12-469 for the time being or at least until I become more proficient in making out or hearing the evps and discussions more clearly.\n\n\nI&#39;m pretty sure I have about Zero medium ship or sensitivity to spirits and it seems to be somewhat of a recurring theme that it helps out greatly if you do on many sites.\n\nIf that&#39;s the case lol well I may never hear much of anything. As I&#39;ve never seen a ghost apparition, shadow, heard any footsteps voices or strange noises.\n\nAnyhow hope that&#39;s not the case.\n\n\nAgain thanks for the info.\n\n\nShane\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;Kristin Morris&quot; &lt;ckmorris95@...&gt; wrote:\n&gt;\n&gt; Hi Shane.  The 12-469 comes with clicking.  Many people actually get so used\n&gt; to it that they end up preferring it.  There are other radios that have been\n&gt; hacked.. 12-820 Radio Shack armband which I believe is being discontinued,\n&gt; the RS 20-125, and I believe a Sangean..  Go to my friend Steve Hultay&#39;s\n&gt; website www.keyportparanormal.com &lt;http://www.keyportparanormal.com/&gt;  for a\n&gt; complete list and instructions on how to hack these different models.  He\n&gt; also has some You Tube videos of each radio scanning.\n&gt; \n&gt;  \n&gt; \n&gt; You can step up and purchase a Minibox which offers an adjustable sweep rate\n&gt; from Paranormal Systems.  They are on the expensive side but they are\n&gt; awesome boxes and Rick offers lay-away plans.  There is also a FM box by Joe\n&gt; Cioppi that I personally love called of course Joe&#39;s Box.  Like Frank Joe\n&gt; makes them by himself so these aren&#39;t out there to purchase like a\n&gt; storefront. Don&#39;t forget that an older Knob style radio works great for a\n&gt; manual sweep which many swear by it.  You probably already have a knob dial\n&gt; radio in your house right now!  Just sweep up and down the dial at a pace\n&gt; that just hits each station.  Don&#39;t linger but don&#39;t go so fast that no\n&gt; sound is heard.  Frank makes wonderful boxes - the original &quot;Franks Box&quot; -\n&gt; but he does not sell them.  \n&gt; \n&gt;  \n&gt; \n&gt; As for hosting audio I use www.ESNIPS.com &lt;http://www.esnips.com/&gt;  .  It\n&gt; allows 5GB of free space to upload your files. \n&gt; \n&gt;  \n&gt; \n&gt; I hope this helps.\n&gt; \n&gt; k\n&gt; \n&gt;  \n&gt; \n&gt;   _____  \n&gt; \n&gt; From: EVP-ITC@yahoogroups.com [mailto:EVP-ITC@yahoogroups.com] On Behalf Of\n&gt; Not given\n&gt; Sent: Thursday, May 21, 2009 9:45 PM\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Subject: [EVP-ITC] Hi and a couple of questions\n&gt; \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; First off my name is Shane. I just recently (past few weeks) heard about\n&gt; ghost boxes. \n&gt; \n&gt; I watched a few videos and read some stuff on building several different\n&gt; types (modifying existing devices).\n&gt; \n&gt; I started with the 12-469 the completely white one. My first go around not\n&gt; much happened but the second go around I got the same name twice and a hello\n&gt; and a response of good after I asked how they were doing. \n&gt; \n&gt; I haven&#39;t had much time to really dig into it good, but one thing is\n&gt; glaringly obvious is the annoying and constant ticking sound it makes is\n&gt; there anyway to disable this or should I just move to a different radio?\n&gt; \n&gt; I chose this one because of the cost and 2 because of the various footage I\n&gt; saw and their results. I just didn&#39;t notice the horrific ticking as it\n&gt; scanned through the AM band. ( I haven&#39;t had any luck with FM and haven&#39;t\n&gt; tried much since it seems to find so many stations and doesn&#39;t sweep through\n&gt; fast enough kinda invalidating anything I might have caught.)\n&gt; \n&gt; Second is there a sight you recommend for hosting files that a good\n&gt; contingent of people see as reputable?\n&gt; \n&gt; Thanks in advance.\n&gt; \n&gt; Shane\n&gt;"}