{"id": "14614", "subject": "Re: Perception is Probabilistic", "author": "phenom_investigator", "timestamp": "2009-05-22T18:59:23Z", "full_text": "What you are describing is known in audio engineering as \n beam-directed ultrasonic demodulation. The principle has been well\n described over the years and was in fact mentioned at a recent\n conference in Finland in 2008. The technology is most commonly \n applied to parametric loudspeaker arrays typical of Audio Spotlight.\n\n Audio signals are modulated selectively onto an ultrasonic carrier \n which tends to be in the 10 to 20 KHz region. This is explained by  \n simple physics and seems to have to do with the way in which bone  \n conductance occurs in humans.\n\n So it is possible for humans to hear in the range well above 20\n KHz. Studies of brains of animals well-known for their ultrasonic\n abilities confirm the neurotopology involved.\n\n Now as to the possibility that this same thinking can be applied to\n some form of vibrational transformation. As I say often &quot;anything\n is possible, it&#39;s just a matter of probability&quot;. So how probable is\n what is proposed? It seems that such things could indeed happen.\n But is this necessary? \n\n Many people including myself have suggested for many years that a\n probable source of disembodied voices may be psychokinesis. \n In other words the phenomena is actually self-produced and often  \n self-directed. \n\n Just a little while ago I got off the phone with a colleague on the\n West coast who is well known in the parapsychology community. He\n was telling me of a case over 20 years ago where a man&#39;s voice was\n heard on an audio recording made when the man and my colleague were\n standing not a few feet apart. Even though the man was not\n physically speaking, his speech was clearly heard on the tape. \n Even the speech style was clearly audible and consistent with his\n penchant for swearing. This was not in the noise; this would be\n classified as a Class A EVP. And it was not heard at the time of\n the recording, so it is an EVP as defined by this group.\n\n Given this, I think the more probable explanation is that what is\n occurring at least some of the time is PK in fact and likely not\n discarnate communications. I am not saying it never happens, just\n positing an interesting alternative explanation which has a basis\n in factual observation of very high quality in a site that has been\n well-documented even on recent television programs in Los Angeles\n as having paranormal disturbances which go back many decades.\n\n\n--- In EVP-ITC@yahoogroups.com, Frank Ratka &lt;warrior18eii@...&gt; wrote:\n&gt;\n&gt; Interesting find, though not completely surprising. This very well could be an explanation for why two people in close proximity perceive different things. It can also be explained by simply not focusing ones attention or having a persons expectations manifest via personal perception.\n&gt;  \n&gt; I did a little research a while ago on using an ultrasounic, non-linear acoustic signal as a carrier wave for audible sound. What happens with this phenomena is an audible signal is embedded and transmitted through the air and is calculated to demodulate at certain points in three dimensional space. In other words we could transmit sound that is inaudible to anyone else around and have it manifest in a 3D bubble where ever we wanted. A person standing only 2 feet away could not hear the music or speech that the person in the beam could.\n&gt;  \n&gt; If for some reason you believe it impossible take a look at the work of Dr. Joseph Pompeii. He use to work for Bose and since received his PhD from MIT in aucoustics. He invented and owns exclusive rights to what he calls the audio spotlight (google it). \n&gt;  \n&gt; Now, I said all that to say this...if it is possible to do this with sound of a low vibration riding energy of a higher vibration then could it also be possbile for a entity of a higher vibration demodulating to a lower vibration and manifesting physically. All things in the universe consist of energic vibrations oscillating at different rates and at different vectors, even what we perceive as solid! Is this possible, if not why?\n&gt;  \n&gt; Regards,\n&gt;  \n&gt; Frank R.\n&gt; \n&gt; --- On Thu, 5/21/09, phenom_investigator &lt;phenom_investigator@...&gt; wrote:\n&gt; \n&gt; \n&gt; From: phenom_investigator &lt;phenom_investigator@...&gt;\n&gt; Subject: [EVP-ITC] Perception is Probabilistic\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Thursday, May 21, 2009, 9:52 AM\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Thought these comments might be interesting in light of recent\n&gt; threads. Dr. Sam El-Khazen recently published an article in the\n&gt; Journal of Neuroquantology (study of brain function at the quantum\n&gt; mechanical level). In this paper entitled &quot;DNA The Gateway to\n&gt; Time&quot;, El-Khazen talks about the relationship between the structure\n&gt; of DNA, time, conscious perception and gravity. There is credible\n&gt; evidence that these are intimately correlated. \n&gt; \n&gt; An important finding for this group has to do with how we may in\n&gt; fact detect external influences in the physical world. If El-Khazen\n&gt; has it right, two EM waves must align in order for the preception\n&gt; process to even begin. If this does not happen, there is nothing to\n&gt; perceive, even though we may be impacted by an external potentially\n&gt; influencing EM wave. The second wave is generated from borrowed\n&gt; energy within our brain cells and is modelled upon the structure of\n&gt; DNA strands. So yes we are impacted by billions of EM signals per\n&gt; second but we actually detect only a small portion of these that we\n&gt; later process in the late-stage perceptual processes. \n&gt; \n&gt; This would nicely explain why two people would perceive events\n&gt; differently despite the fact that they were literally side by side\n&gt; witnessing the same event. Again this is strictly a matter of\n&gt; random probability, it seems to have nothing whatsoever to do with\n&gt; volition or intention. That is more the focus of the later\n&gt; perceptual processing which is in turn dependent upon this\n&gt; probabilistic process.\n&gt; \n&gt; This could also explain why it is that EVP and ITC signals are\n&gt; perceived differently by different people even when no physical\n&gt; alteration to the media has occurred and why different things are\n&gt; heard more easily at different times by the same person.\n&gt;\n\n--- In EVP-ITC@yahoogroups.com, Frank Ratka &lt;warrior18eii@...&gt; wrote:\n&gt;\n&gt; Interesting find, though not completely surprising. This very well could be an explanation for why two people in close proximity perceive different things. It can also be explained by simply not focusing ones attention or having a persons expectations manifest via personal perception.\n&gt; \n&gt; I did a little research a while ago on using anultrasounic, non-linear acoustic signal as a carrier wave for audible sound. What happens with this phenomena is an audible signal is embedded and transmitted through the air and is calculated to demodulate at certain points in three dimensional space. In other words we could transmit sound that is inaudible to anyone else around and have it manifest in a 3D bubble where ever we wanted. A person standing only 2 feet away could not hear the music or speech that the person in the beam could.\n&gt; \n&gt; If for some reason you believe it impossible take a look at the work ofDr. Joseph Pompeii. He use to work for Bose andsince received his PhD from MIT in aucoustics. He invented and owns exclusive rights to what he calls the audio spotlight (google it). \n&gt; \n&gt; Now, I said all that to say this...if it is possible to do this with sound of a low vibration riding energy of a higher vibration then could it also be possbile for a entity of a higher vibration demodulating to a lower vibrationand manifesting physically. All things in the universe consist of energic vibrations oscillating at different rates and at different vectors, even what we perceive as solid! Is this possible, if not why?\n&gt; \n&gt; Regards,\n&gt; \n&gt; Frank R.\n&gt; \n&gt; --- On Thu, 5/21/09, phenom_investigator &lt;phenom_investigator@...&gt; wrote:\n&gt; \n&gt; \n&gt; From: phenom_investigator &lt;phenom_investigator@...&gt;\n&gt; Subject: [EVP-ITC] Perception is Probabilistic\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Thursday, May 21, 2009, 9:52 AM\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Thought these comments might be interesting in light of recent\n&gt; threads. Dr. Sam El-Khazen recently published an article in the\n&gt; Journal of Neuroquantology (study of brain function at the quantum\n&gt; mechanical level). In this paper entitled &quot;DNA The Gateway to\n&gt; Time&quot;, El-Khazen talks about the relationship between the structure\n&gt; of DNA, time, conscious perception and gravity. There is credible\n&gt; evidence that these are intimately correlated. \n&gt; \n&gt; An important finding for this group has to do with how we may in\n&gt; fact detect external influences in the physical world. If El-Khazen\n&gt; has it right, two EM waves must align in order for the preception\n&gt; process to even begin. If this does not happen, there is nothing to\n&gt; perceive, even though we may be impacted by an external potentially\n&gt; influencing EM wave. The second wave is generated from borrowed\n&gt; energy within our brain cells and is modelled upon the structure of\n&gt; DNA strands. So yes we are impacted by billions of EM signals per\n&gt; second but we actually detect only a small portion of these that we\n&gt; later process in the late-stage perceptual processes. \n&gt; \n&gt; This would nicely explain why two people would perceive events\n&gt; differently despite the fact that they were literally side by side\n&gt; witnessing the same event. Again this is strictly a matter of\n&gt; random probability, it seems to have nothing whatsoever to do with\n&gt; volition or intention. That is more the focus of the later\n&gt; perceptual processing which is in turn dependent upon this\n&gt; probabilistic process.\n&gt; \n&gt; This could also explain why it is that EVP and ITC signals are\n&gt; perceived differently by different people even when no physical\n&gt; alteration to the media has occurred and why different things are\n&gt; heard more easily at different times by the same person.\n&gt;"}