{"id": "14659", "subject": "Re: [EVP-ITC] This is what I&#39;m talking about!", "author": "David Koenig", "timestamp": "2009-05-26T03:48:02Z", "full_text": "WOW ... Pretty classy stuff :-)\n\nOn Mon, May 25, 2009 at 11:31 PM, Frank Sumption\n&lt;purplealiengirl@...&gt;wrote:\n\n&gt;\n&gt;\n&gt;  Why I&#39;ve had enough of these insane idiots in the so called paranormal.\n&gt; God forbid anyone should question their little pearls of wisdom flowing from\n&gt; their sacred keyboards.\n&gt;\n&gt;  I&#39;&#39;ve said it before, and I&#39;ll say it again, I do this work for my own\n&gt; curiosity, I don&#39;t seek fame and fortune like these others do, and I have no\n&gt; ego to puff up to the world. I do not care if anyone uses my boxes, I don&#39;t\n&gt; even sell the crap. It ain&#39;t gonna matter---the comet is on it&#39;s way! Y&#39;all\n&gt; have three years, I&#39;d use the time wisely.\n&gt;\n&gt;  I left the name off this, but anyone can probably figure out who sent it,\n&gt; the same person that attacks many researchers in this field.\n&gt;\n&gt; &quot;Frank,\n&gt;\n&gt; You have a big mouth on that piece of shit group evp-itc come over to\n&gt; the---- group where I can respond to your fuckin retarded rants. You call me\n&gt; a crack head, you senile old idiot, don&#39;t hate people for being your\n&gt; superior in the field just because your boxes are crap now and nobody uses\n&gt; them for anything other than dust collecters. If I were you I would go back\n&gt; into the bathroom sit on the bowl and think about what an obscure hasbeen\n&gt; asshole you have become.\n&gt;\n&gt; Come to my group and open your mouth and I&#39;ll take the wind right out of\n&gt; your fuckin sails.\n&gt;\n&gt; All is possible, nothing is probable&quot;\n&gt;\n&gt;  \n&gt;\n\nWOW ... P e y classy s u :-)On Mon, May 25, 2009 a 11:31 PM, F ank Sump ion pu plealiengi l@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n \n \n \n  Why I' e had enough o hese insane idio s in he so called pa ano mal. God o bid anyone should ques ion hei li le pea ls o wisdom lowing om hei sac ed keyboa ds.\n \n I'' e said i be o e, and I'll say i again, I do his wo k o my own cu iosi y, I don' seek ame and o une like hese o he s do, and I ha e no ego o pu up o he wo ld. I do no ca e i anyone uses my boxes, I don' e en sell he c ap. I ain' gonna ma e --- he come is on i 's way! Y'all ha e h ee yea s, I'd use he ime wisely.\n\n\n \n I le he name o his, bu anyone can p obably igu e ou who sen i , he same pe son ha a acks many esea che s in his ield. \n \n\"F ank, You ha e a big mou h on ha piece o shi g oup e p-i c come o e o he---- g oup whe e I can espond o you uckin e a ded an s. You call me a c ack head, you senile old idio , don' ha e people o being you supe io in he ield jus because you boxes a e c ap now and nobody uses hem o any hing o he han dus collec e s. I I we e you I would go back in o he ba h oom si on he bowl and hink abou wha an obscu e hasbeen asshole you ha e become. \n\n Come o my g oup and open you mou h and I'll ake he wind igh ou o you uckin sails. All is possible, no hing is p obable\""}