{"id": "14651", "subject": "Re: [EVP-ITC] Board talk", "author": "David Koenig", "timestamp": "2009-05-25T12:32:08Z", "full_text": "It would be difficult to respect anyone who&#39;s worked with Alison Smith.\n\nOn Sun, May 24, 2009 at 8:42 PM, Rj &lt;rasterer@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Yeah, I think a lot of pretenders do try to find ways to promote themselves\n&gt; into more credibility.  In fact, I wonder about that project you are going\n&gt; to be doing with Mr Moon.  It&#39;s my guess he is the one who suggested it\n&gt; (maybe even dropped some profitability hints?).  Realize, his method of\n&gt; performing medium with the box, and charging the vulnerable large amounts of\n&gt; money, is under attack from many quarters, and he has begun to go on the\n&gt; defensive.  One thing that is hard for him to defend, is how he can be so\n&gt; expert with the box when he had nothing to do with its construction.\n&gt;\n&gt; Now consider, if he can get the box&#39;s maker to participate in a project\n&gt; together, even just once, he can add to his list of credentials things such\n&gt; as &quot;Worked together with the original box&#39;s designer, Frank Sumption, on new\n&gt; designs.&quot; Or even &quot;Co-creater of the new Box&quot;, whatever it is.\n&gt;\n&gt; You will be giving him that very credibility, that those &quot;do my shows&quot; are\n&gt; looking for.  Maybe even getting him new customers.  Just by associating\n&gt; with him on one project.\n&gt;\n&gt; My advice is, be careful that you aren&#39;t just being used for your\n&gt; credentials Frank.\n&gt;\n&gt;\n&gt;\n&gt; --- On *Sun, 5/24/09, Frank Sumption &lt;purplealiengirl@...&gt;* wrote:\n&gt;\n&gt;\n&gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt; Subject: Re: [EVP-ITC] Board talk\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Sunday, May 24, 2009, 4:56 PM\n&gt;\n&gt;   Yeah, real interesting, if ya know something about these various\n&gt; &quot;players&quot; in the field. Yet they wonder why I don&#39;t play those &quot;do my show&quot;\n&gt; games. A certain amount here left unsaid, so not too many will get it.\n&gt;\n&gt;  F-S\n&gt;\n&gt; On Sun, May 24, 2009 at 7:12 AM, Rj &lt;rasterer@yahoo. com&lt;http://mc/compose?to=rasterer@...&gt;\n&gt; &gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;   This looks interested (from another board):\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; Posted by: &quot;balllan94&quot; balllan94@yahoo. com\n&gt;&gt; &lt;http://us.mc01g.mail.yahoo.com/mc/compose?to=balllan94@...&Subject=%20Re%3ADon%27t%20miss%20this%20weeks%20%22Inside%20the%20box%20talk%20Radio%22%20special%20guest%20Bill&gt;\n&gt;&gt; balllan94 &lt;http://profiles.yahoo.com/balllan94&gt; Sat May 23, 2009 10:20 am\n&gt;&gt; (PDT)\n&gt;&gt;\n&gt;&gt; Don&#39;t miss this weeks Inside The Box RTSC Talk Radio show.\n&gt;&gt;\n&gt;&gt; My guest will be Mr. Bill Chappell of Digital Dowsing.com\n&gt;&gt; Bill is the inventor of the Radio Shack Hack ghost box along with the\n&gt;&gt; Paranormal Puck and Ovilus to name a few.\n&gt;&gt;\n&gt;&gt; Bill will be announcing and discussing some of the new projects he is\n&gt;&gt; working on and new equipment he will be debuting in the near future.\n&gt;&gt;\n&gt;&gt; Bill has stated that some of the new technology that is on the horizon\n&gt;&gt; will change the face of paranormal research and investigation as we know it.\n&gt;&gt;\n&gt;&gt; So don&#39;t miss it, Sunday 5/24 from 3:00 PM to 4:30 PM est. you can listen\n&gt;&gt; and chat live either at\n&gt;&gt;\n&gt;&gt; my website: http://www.insideth eboxrtscghostbox .com/listenchat. html&lt;http://www.insidetheboxrtscghostbox.com/listenchat.html&gt;\n&gt;&gt;\n&gt;&gt; Or http://www.para- x.com/live. html &lt;http://www.para-x.com/live.html&gt;\n&gt;&gt;\n&gt;&gt; Either way don&#39;t miss it or you will be left out of the loop!!!\n&gt;&gt;\n&gt;&gt; Bruce Halliday\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;\n&gt;  \n&gt;\n\nI would be di icul o espec anyone who's wo ked wi h Alison Smi h.On Sun, May 24, 2009 a 8:42 PM, Rj as e e @...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n \n \n \n Yeah, I hink a lo o p e ende s do y o ind ways o p omo e hemsel es in o mo e c edibili y.  In ac , I wonde abou ha p ojec you a e going o be doing wi h M Moon.  I 's my guess he is he one who sugges ed i (maybe e en d opped some p o i abili y hin s?).  Realize, his me hod o pe o ming medium wi h he box, and cha ging he ulne able la ge amoun s o money, is unde a ack om many qua e s, and he has begun o go on he de ensi e.  One hing ha is ha d o him o de end, is how he can be so expe wi h he box when he had no hing o do wi h i s cons uc ion.\nNow conside , i he can ge he box's make o pa icipa e in a p ojec oge he , e en jus once, he can add o his lis o c eden ials hings such as \"Wo ked oge he wi h he o iginal box's designe , F ank Sump ion, on new designs.\" O e en \"Co-c ea e o \n he new Box\", wha e e i is.You will be gi ing him ha e y c edibili y, ha hose \"do my shows\" a e looking o .  Maybe e en ge ing him new cus ome s.  Jus by associa ing wi h him on one p ojec .\nMy ad ice is, be ca e ul ha you a en' jus being used o you c eden ials F ank.--- On Sun, 5/24/09, F ank Sump ion pu plealiengi l@...> w o e:\nF om: F ank Sump ion pu plealiengi l@gmail.com>Subjec : Re: [EVP-ITC] Boa d alk\nTo: EVP-ITC@yahoog oups.comDa e: Sunday, May 24, 2009, 4:56 PM\n\n\n\n\n\n\n \n \n  Yeah, eal in e es ing, i ya know some hing abou hese a ious \"playe s\" in he ield. Ye hey wonde why I don' play hose \"do my show\" games. A ce ain amoun he e le unsaid, so no oo many will ge i . \n\n\n \n F-S\nOn Sun, May 24, 2009 a 7:12 AM, Rj as e e @yahoo. com> w o e:\n\n\n\n\n\n\n\n\n\nThis looks in e es ed ( om ano he boa d):\nPos ed by: \"balllan94\" balllan94@yahoo. com   balllan94 \n\n\nSa May 23, 2009 10:20 am (PDT) Don' miss his weeks Inside The Box RTSC Talk Radio show.\n\nMy gues will be M . Bill Chappell o Digi al Dowsing.comBill is he in en o o he Radio Shack Hack ghos box along wi h he Pa ano mal Puck and O ilus o name a ew.Bill will be announcing and discussing some o he new p ojec s he is wo king on and new equipmen he will be debu ing in he nea u u e.\n\nBill has s a ed ha some o he new echnology ha is on he ho izon will change he ace o pa ano mal esea ch and in es iga ion as we know i .So don' miss i , Sunday 5/24 om 3:00 PM o 4:30 PM es . you can lis en and cha li e ei he a \n\nmy websi e: h p://www.inside h ebox scghos box .com/lis encha . h mlO h p://www.pa a- x.com/li e. h ml\n\nEi he way don' miss i o you will be le ou o he loop!!!B uce Halliday"}