{"id": "14657", "subject": "Re: [EVP-ITC] Board talk", "author": "David Koenig", "timestamp": "2009-05-26T03:46:01Z", "full_text": "So who are the very best at this right now?\n\nOn Mon, May 25, 2009 at 9:26 AM, &lt;SnowfireL@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;  Well, if this leads to fighting, I&#39;m sure Spirit will stop talking to us\n&gt; altogether, I tried to call Bill&#39;s machine, but I couldn&#39;t hear much of\n&gt; anything, maybe sound was too low, or maybe someone was hearing what I\n&gt; should have been hearing, I&#39;m sure they heard me, but someone on the other\n&gt; end was reaping the rewards of my one sided conversation, I&#39;m sure.  Left me\n&gt; very unhappy, (p...is..ed o..f). , I sure wish people could make this work\n&gt; for all of us though, and give credit where credit is due, Edison told me,\n&gt; he was working with a certain couple of people, poor guy, he&#39;s running all\n&gt; over the place, when people keep asking for his help, he has to stop what\n&gt; he&#39;s doing to inspire one person, then has to run over to see what all the\n&gt; hollering is all about with someone else.  Don&#39;t forget, none of this would\n&gt; be possible were it not given to us by the Man upstairs, and no one gives\n&gt; Him any credit, it&#39;s not &quot;religion.&quot;  It&#39;s called life.\n&gt; sf\n&gt;\n&gt; In a message dated 5/25/2009 8:33:40 A.M. Eastern Daylight Time,\n&gt; floridajakeblues@... writes:\n&gt;\n&gt;\n&gt;\n&gt; It would be difficult to respect anyone who&#39;s worked with Alison Smith.\n&gt;\n&gt; On Sun, May 24, 2009 at 8:42 PM, Rj &lt;rasterer@...&gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;   Yeah, I think a lot of pretenders do try to find ways to promote\n&gt;&gt; themselves into more credibility.  In fact, I wonder about that project you\n&gt;&gt; are going to be doing with Mr Moon.  It&#39;s my guess he is the one who\n&gt;&gt; suggested it (maybe even dropped some profitability hints?).  Realize, his\n&gt;&gt; method of performing medium with the box, and charging the vulnerable large\n&gt;&gt; amounts of money, is under attack from many quarters, and he has begun to go\n&gt;&gt; on the defensive.  One thing that is hard for him to defend, is how he can\n&gt;&gt; be so expert with the box when he had nothing to do with its construction.\n&gt;&gt;\n&gt;&gt; Now consider, if he can get the box&#39;s maker to participate in a project\n&gt;&gt; together, even just once, he can add to his list of credentials things such\n&gt;&gt; as &quot;Worked together with the original box&#39;s designer, Frank Sumption, on new\n&gt;&gt; designs.&quot; Or even &quot;Co-creater of the new Box&quot;, whatever it is.\n&gt;&gt;\n&gt;&gt; You will be giving him that very credibility, that those &quot;do my shows&quot; are\n&gt;&gt; looking for.  Maybe even getting him new customers.  Just by associating\n&gt;&gt; with him on one project.\n&gt;&gt;\n&gt;&gt; My advice is, be careful that you aren&#39;t just being used for your\n&gt;&gt; credentials Frank.\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; --- On *Sun, 5/24/09, Frank Sumption &lt;purplealiengirl@...&gt;* wrote:\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt;&gt; Subject: Re: [EVP-ITC] Board talk\n&gt;&gt; To: EVP-ITC@yahoogroups.com\n&gt;&gt; Date: Sunday, May 24, 2009, 4:56 PM\n&gt;&gt;\n&gt;&gt;    Yeah, real interesting, if ya know something about these various\n&gt;&gt; &quot;players&quot; in the field. Yet they wonder why I don&#39;t play those &quot;do my show&quot;\n&gt;&gt; games. A certain amount here left unsaid, so not too many will get it.\n&gt;&gt;\n&gt;&gt;  F-S\n&gt;&gt;\n&gt;&gt; On Sun, May 24, 2009 at 7:12 AM, Rj &lt;rasterer@yahoo. com&lt;http://mc/compose?to=rasterer@...&gt;\n&gt;&gt; &gt; wrote:\n&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;   This looks interested (from another board):\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt; Posted by: &quot;balllan94&quot; balllan94@yahoo. com\n&gt;&gt;&gt; &lt;http://us.mc01g.mail.yahoo.com/mc/compose?to=balllan94@...&Subject=%20Re%3ADon%27t%20miss%20this%20weeks%20%22Inside%20the%20box%20talk%20Radio%22%20special%20guest%20Bill&gt;\n&gt;&gt;&gt; balllan94 &lt;http://profiles.yahoo.com/balllan94&gt; Sat May 23, 2009\n&gt;&gt;&gt; 10:20 am (PDT)\n&gt;&gt;&gt;\n&gt;&gt;&gt; Don&#39;t miss this weeks Inside The Box RTSC Talk Radio show.\n&gt;&gt;&gt;\n&gt;&gt;&gt; My guest will be Mr. Bill Chappell of Digital Dowsing.com\n&gt;&gt;&gt; Bill is the inventor of the Radio Shack Hack ghost box along with the\n&gt;&gt;&gt; Paranormal Puck and Ovilus to name a few.\n&gt;&gt;&gt;\n&gt;&gt;&gt; Bill will be announcing and discussing some of the new projects he is\n&gt;&gt;&gt; working on and new equipment he will be debuting in the near future.\n&gt;&gt;&gt;\n&gt;&gt;&gt; Bill has stated that some of the new technology that is on the horizon\n&gt;&gt;&gt; will change the face of paranormal research and investigation as we know it.\n&gt;&gt;&gt;\n&gt;&gt;&gt; So don&#39;t miss it, Sunday 5/24 from 3:00 PM to 4:30 PM est. you can listen\n&gt;&gt;&gt; and chat live either at\n&gt;&gt;&gt;\n&gt;&gt;&gt; my website: http://www.insideth eboxrtscghostbox .com/listenchat. html&lt;http://www.insidetheboxrtscghostbox.com/listenchat.html&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt; Or http://www.para- x.com/live. html &lt;http://www.para-x.com/live.html&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt; Either way don&#39;t miss it or you will be left out of the loop!!!\n&gt;&gt;&gt;\n&gt;&gt;&gt; Bruce Halliday\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;\n&gt; ------------------------------\n&gt; *An Excellent Credit Score is 750. See Yours in Just 2 Easy Steps!&lt;http://pr.atwola.com/promoclk/100126575x1221823249x1201398664/aol?redir=http://www.freecreditreport.com/pm/default.aspx?sc=668072%26hmpgID=62%26bcd=MayExcfooterNO62&gt;\n&gt; *\n&gt;\n&gt;  \n&gt;\n\nSo who a e he e y bes a his igh now?On Mon, May 25, 2009 a 9:26 AM, Snow i eL@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n \n \n \n \n\n\nWell, i his leads o igh ing, I'm su e Spi i will s op alking o us \nal oge he , I ied o call Bill's machine, bu I couldn' hea much o \nany hing, maybe sound was oo low, o maybe someone was hea ing wha I should \nha e been hea ing, I'm su e hey hea d me, bu someone on he o he end was \n eaping he ewa ds o my one sided con e sa ion, I'm su e.  Le me e y \nunhappy, (p...is..ed o.. ). , I su e wish people could make his wo k o all o \nus hough, and gi e c edi whe e c edi is due, Edison old me, he was wo king \nwi h a ce ain couple o people, poo guy, he's unning all o e he place, when \npeople keep asking o his help, he has o s op wha he's doing o inspi e one \npe son, hen has o un o e o see wha all he holle ing is all abou wi h \nsomeone else.  Don' o ge , none o his would be possible we e i no \ngi en o us by he Man ups ai s, and no one gi es Him any c edi , i 's no \n\" eligion.\"  I 's called li e.\ns \n\n \nIn a message da ed 5/25/2009 8:33:40 A.M. Eas e n Dayligh Time, \n lo idajakeblues@... w i es:\n\n \n \n \n I would be di icul o espec anyone who's wo ked wi h Alison \n Smi h.\n On Sun, May 24, 2009 a 8:42 PM, Rj as e e @...> \n w o e:\n \n \n \n \n \n \n \n \n \n Yeah, I hink a lo o p e ende s do y o ind ways \n o p omo e hemsel es in o mo e c edibili y.  In ac , I wonde \n abou ha p ojec you a e going o be doing wi h M Moon.  I 's \n my guess he is he one who sugges ed i (maybe e en d opped some \n p o i abili y hin s?).  Realize, his me hod o pe o ming medium \n wi h he box, and cha ging he ulne able la ge amoun s o money, is \n unde a ack om many qua e s, and he has begun o go on he \n de ensi e.  One hing ha is ha d o him o de end, is how he \n can be so expe wi h he box when he had no hing o do wi h i s \n cons uc ion.Now conside , i he can ge he box's make o \n pa icipa e in a p ojec oge he , e en jus once, he can add o his \n lis o c eden ials hings such as \"Wo ked oge he wi h he o iginal \n box's designe , F ank Sump ion, on new designs.\" O e en \"Co-c ea e \n o he new Box\", wha e e i is.You will be gi ing him ha \n e y c edibili y, ha hose \"do my shows\" a e looking o .  \n Maybe e en ge ing him new cus ome s.  Jus by associa ing wi h \n him on one p ojec .My ad ice is, be ca e ul ha you a en' \n jus being used o you c eden ials F ank.--- On \n Sun, 5/24/09, F ank Sump ion pu plealiengi l@...> \nw o e:\n F om: \n F ank Sump ion pu plealiengi l@...>Subjec : Re: \n [EVP-ITC] Boa d alkTo: EVP-ITC@yahoog oups.comDa e: Sunday, May \n 24, 2009, 4:56 PM \n \n \n \n \n  Yeah, eal in e es ing, i ya know some hing abou hese \n a ious \"playe s\" in he ield. Ye hey wonde why I don' play \n hose \"do my show\" games. A ce ain amoun he e le unsaid, so no \n oo many will ge i . \n  \n  F-S\n On Sun, May 24, 2009 a 7:12 AM, Rj as e e @yahoo. com> w o e:\n\n \n \n \n \n \n \n \n \n \n This looks in e es ed ( om ano he \n boa d):\n Pos ed \n by: \"balllan94\" balllan94@yahoo. com   \n balllan94 \n Sa \n May 23, 2009 10:20 am (PDT) \n Don' miss his weeks Inside The Box RTSC Talk \n Radio show.My gues will be M . Bill Chappell o \n Digi al Dowsing.comBill is he in en o o he Radio \n Shack Hack ghos box along wi h he Pa ano mal Puck and \n O ilus o name a ew.Bill will be announcing and \n discussing some o he new p ojec s he is wo king on and new \n equipmen he will be debu ing in he nea \n u u e.Bill has s a ed ha some o he new \n echnology ha is on he ho izon will change he ace o \n pa ano mal esea ch and in es iga ion as we know \n i .So don' miss i , Sunday 5/24 om 3:00 PM o \n 4:30 PM es . you can lis en and cha li e ei he a \n my websi e: h p://www.inside h \n ebox scghos box .com/lis encha . h mlO h p://www.pa a- x.com/li e. \n h mlEi he way don' miss i o you will be le \n ou o he loop!!!B uce Halliday \n \n \n \n \n \n \n \n An Excellen C edi Sco e is 750. See You s in Jus 2 Easy S eps!"}