{"id": "14661", "subject": "Re: This is what I&#39;m talking about!", "author": "ourobouros2k2", "timestamp": "2009-05-26T06:35:40Z", "full_text": "I am just speechless. I tend to lurk in the background on all evp and itc related groups, unless I have a question or something. I do read and I do watch.  This rant is the type of gratitude shown for your gifting him a box all that time ago? I just...damn. I don&#39;t know what to say. His sig line identifies him. Sometimes I second guess myself thinking I judge to harshly, but that, well it confirms my instinct.\n\n\nJust makes me sick, and Frank, I am sorry you have to deal with that kind of b.s. \n\nSome grattitude\n\nAndy\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  Why I&#39;ve had enough of these insane idiots in the so called paranormal. God\n&gt; forbid anyone should question their little pearls of wisdom flowing from\n&gt; their sacred keyboards.\n&gt; \n&gt;  I&#39;&#39;ve said it before, and I&#39;ll say it again, I do this work for my own\n&gt; curiosity, I don&#39;t seek fame and fortune like these others do, and I have no\n&gt; ego to puff up to the world. I do not care if anyone uses my boxes, I don&#39;t\n&gt; even sell the crap. It ain&#39;t gonna matter---the comet is on it&#39;s way! Y&#39;all\n&gt; have three years, I&#39;d use the time wisely.\n&gt; \n&gt;  I left the name off this, but anyone can probably figure out who sent it,\n&gt; the same person that attacks many researchers in this field.\n&gt; \n&gt; &quot;Frank,\n&gt; \n&gt; You have a big mouth on that piece of shit group evp-itc come over to\n&gt; the---- group where I can respond to your fuckin retarded rants. You call me\n&gt; a crack head, you senile old idiot, don&#39;t hate people for being your\n&gt; superior in the field just because your boxes are crap now and nobody uses\n&gt; them for anything other than dust collecters. If I were you I would go back\n&gt; into the bathroom sit on the bowl and think about what an obscure hasbeen\n&gt; asshole you have become.\n&gt; \n&gt; Come to my group and open your mouth and I&#39;ll take the wind right out of\n&gt; your fuckin sails.\n&gt; \n&gt; All is possible, nothing is probable&quot;\n&gt;"}