{"id": "14679", "subject": "Re: [EVP-ITC] Electrical Question", "author": "Zack Widup", "timestamp": "2009-05-27T13:37:17Z", "full_text": "Yes, I&#39;d guess that some electrical circuit or device failure could cause\nthe tapping and EMF spikes, including a bad power meter. Usually these\nthings occur when something is drawing power. Bad wiring or a bad power\nmeter will not show up if everything in the house is turned off or\nunplugged. Note some equipment like stereos, some microwave ovens, etc. have\nan active part of the circuit even when when they seem to be off. A bad\ntransformer in a stereo could cause the problem too. When I worked in an\nelectronics repair shop, we had a lot of those come in for repair.\n\nWhen a group I&#39;m in does home investigations, we try to spend part of the\ntime with the power completely shut off. That way we can be reasonably sure\nthat any EMF spikes on the meter or strange popping sounds etc. aren&#39;t\ncoming from the house wiring or equipment. It would probably be useless if\nnot impossible to try this in an apartment if it is surrounded by other\napartments.\nIf the problem is persistent you can try to track it down by unplugging\neverything in the house one at a time and see if it goes away when a\nparticular thing is unplugged.\n\nZack\n\nOn Tue, May 26, 2009 at 5:22 PM, April Abercrombie &lt;\napril@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;  Thanks Zack-Huge help.\n&gt;\n&gt; Do you think this sounds like a possible cause of the taps/EMF spikes?\n&gt; Would a bad power meter cause the tapping sound?\n&gt;\n&gt;\n&gt; ----- Original Message -----\n&gt; *From:* Zack Widup &lt;w9sz.zack@...&gt;\n&gt; *To:* EVP-ITC@yahoogroups.com\n&gt; *Sent:* Tuesday, May 26, 2009 4:02 PM\n&gt; *Subject:* Re: [EVP-ITC] Electrical Question\n&gt;\n&gt;  Not likely a faulty breaker but it could be. In the winter electrical\n&gt; devices that heat, such as heat tape and heaters, can do that. It could\n&gt; also be some other faulty electrical device. It could be a bad wiring\n&gt; connection or even a bad power meter (I had that happen last winter).\n&gt;\n&gt; Those touch lamps usually use some sort of CMOS IC or MOSFET device that is\n&gt; sensitive to capacitance. Touching the base adds capacitance that they sense\n&gt; and switch as a result. Those devices have a lifetime of maybe 5 to 10 years\n&gt; from my experience and start switching on their own at random.\n&gt;\n&gt; Zack\n&gt;\n&gt; On Tue, May 26, 2009 at 4:52 PM, April Abercrombie &lt;\n&gt; april@...&gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;  Hi All,\n&gt;&gt;\n&gt;&gt; Is there someone here that can answer and electrical question for me?\n&gt;&gt;\n&gt;&gt; During the case that I recorded those possible EVP&#39;s-there was a loud\n&gt;&gt; tapping noise that seemed to come from the 2nd bedroom. Upon checking my\n&gt;&gt; logs, every time one of  these clicks were heard, there would be an EMF\n&gt;&gt; spike in the livingroom. The 2nd bedroom is upstairs, the livingroom\n&gt;&gt; downstairs. The home owners have also reported that they have a touch lamp\n&gt;&gt; that comes on all the time by itself and the lights in the Kitchen will dim\n&gt;&gt; occasionally.\n&gt;&gt;\n&gt;&gt; Now these taps are not consistent in timing, loudness or rhythm. Could\n&gt;&gt; this be the work of faulty breakers?\n&gt;&gt;\n&gt;&gt; Thanks!\n&gt;&gt; April\n&gt;&gt;\n&gt;&gt;\n&gt;   \n&gt;\n\nYes, I'd guess ha some elec ical ci cui o de ice ailu e could cause he apping and EMF spikes, including a bad powe  me e . Usually hese hings occu when some hing is d awing powe . Bad wi ing o a bad powe me e will no show up i e e y hing in he house is u ned o o unplugged. No e some equipmen like s e eos, some mic owa e o ens, e c. ha e an ac i e pa o he ci cui e en when when hey seem o be o . A bad ans o me in a s e eo could cause he p oblem oo. When I wo ked in an elec onics epai shop, we had a lo o hose come in o epai .\n\n \nWhen a g oup I'm in does home in es iga ions, we y o spend pa o he ime wi h he powe comple ely shu o . Tha way we can be easonably su e ha any EMF spikes on he me e o s ange popping sounds e c. a en' coming om he house wi ing o equipmen . I would p obably be useless i no impossible  o y his in an apa men i i is su ounded by o he apa men s.\n\nI he p oblem is pe sis en you can y o ack i down by unplugging e e y hing in he house one a a ime and see i i goes away when a pa icula hing is unplugged.\n \nZack\n \nOn Tue, May 26, 2009 a 5:22 PM, Ap il Abe c ombie ap il@abe c ombieghos esea ch.com> w o e:\n\n\n\n\n\n\nThanks Zack-Huge help.\n \nDo you hink his sounds like a possible cause o he aps/EMF spikes? Would a bad powe me e cause he apping sound?\n\n \n\n----- O iginal Message ----- \nF om: Zack Widup \nTo: EVP-ITC@yahoog oups.com \nSen : Tuesday, May 26, 2009 4:02 PM\nSubjec : Re: [EVP-ITC] Elec ical Ques ion\n\n\n\nNo likely a aul y b eake bu i could be. In he win e elec ical de ices ha hea , such as hea ape and hea e s, can do ha . I could also be some o he aul y elec ical de ice. I could be a bad wi ing connec ion o e en a bad powe me e (I had ha happen las win e ).\n\n \nThose ouch lamps usually use some so o CMOS IC o MOSFET de ice ha is sensi i e o capaci ance. Touching he base adds capaci ance ha hey sense and swi ch as a esul . Those de ices ha e a li e ime o maybe 5 o 10 yea s om my expe ience and s a swi ching on hei own a andom.\n\n \nZack\nOn Tue, May 26, 2009 a 4:52 PM, Ap il Abe c ombie ap il@...> w o e:\n\n\n\n\n\n\n\nHi All,\n \nIs he e someone he e ha can answe and elec ical ques ion o me?\n \nDu ing he case ha I eco ded hose possible EVP's- he e was a loud apping noise ha seemed o come om he 2nd bed oom. Upon checking my logs, e e y ime one o   hese clicks we e hea d, he e would be an EMF spike in he li ing oom. The 2nd bed oom is ups ai s, he li ing oom downs ai s. The home owne s ha e also epo ed ha hey ha e a ouch lamp ha comes on all he ime by i sel and he ligh s in he Ki chen will dim occasionally.\n\n \nNow hese aps a e no consis en in iming, loudness o hy hm. Could his be he wo k o aul y b eake s?\n \nThanks!\nAp il"}