{"id": "14672", "subject": "Re: [EVP-ITC] Electrical Question", "author": "Zack Widup", "timestamp": "2009-05-26T22:02:53Z", "full_text": "Not likely a faulty breaker but it could be. In the winter electrical\ndevices that heat, such as heat tape and heaters, can do that. It could\nalso be some other faulty electrical device. It could be a bad wiring\nconnection or even a bad power meter (I had that happen last winter).\n\nThose touch lamps usually use some sort of CMOS IC or MOSFET device that is\nsensitive to capacitance. Touching the base adds capacitance that they sense\nand switch as a result. Those devices have a lifetime of maybe 5 to 10 years\nfrom my experience and start switching on their own at random.\n\nZack\n\nOn Tue, May 26, 2009 at 4:52 PM, April Abercrombie &lt;\napril@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;  Hi All,\n&gt;\n&gt; Is there someone here that can answer and electrical question for me?\n&gt;\n&gt; During the case that I recorded those possible EVP&#39;s-there was a loud\n&gt; tapping noise that seemed to come from the 2nd bedroom. Upon checking my\n&gt; logs, every time one of  these clicks were heard, there would be an EMF\n&gt; spike in the livingroom. The 2nd bedroom is upstairs, the livingroom\n&gt; downstairs. The home owners have also reported that they have a touch lamp\n&gt; that comes on all the time by itself and the lights in the Kitchen will dim\n&gt; occasionally.\n&gt;\n&gt; Now these taps are not consistent in timing, loudness or rhythm. Could this\n&gt; be the work of faulty breakers?\n&gt;\n&gt; Thanks!\n&gt; April\n&gt;\n&gt; \n&gt;\n\nNo likely a aul y b eake bu i could be. In he win e elec ical de ices ha hea , such as hea ape and hea e s, can do ha . I could also be some o he aul y elec ical de ice. I could be a bad wi ing connec ion o e en a bad powe me e (I had ha happen las win e ).\n\n \nThose ouch lamps usually use some so o CMOS IC o MOSFET de ice ha is sensi i e o capaci ance. Touching he base adds capaci ance ha hey sense and swi ch as a esul . Those de ices ha e a li e ime o maybe 5 o 10 yea s om my expe ience and s a swi ching on hei own a andom.\n\n \nZack\nOn Tue, May 26, 2009 a 4:52 PM, Ap il Abe c ombie ap il@abe c ombieghos esea ch.com> w o e:\n\n\n\n\n\n\nHi All,\n \nIs he e someone he e ha can answe and elec ical ques ion o me?\n \nDu ing he case ha I eco ded hose possible EVP's- he e was a loud apping noise ha seemed o come om he 2nd bed oom. Upon checking my logs, e e y ime one o   hese clicks we e hea d, he e would be an EMF spike in he li ing oom. The 2nd bed oom is ups ai s, he li ing oom downs ai s. The home owne s ha e also epo ed ha hey ha e a ouch lamp ha comes on all he ime by i sel and he ligh s in he Ki chen will dim occasionally.\n\n \nNow hese aps a e no consis en in iming, loudness o hy hm. Could his be he wo k o aul y b eake s?\n \nThanks!\nAp il"}