{"id": "14680", "subject": "Re: [EVP-ITC] Electrical Question", "author": "Zack Widup", "timestamp": "2009-05-27T13:42:25Z", "full_text": "Aluminum wire is a nightmare! The stuff tends to overheat, oxidizes where\ninterconnections are made and will spark, etc.\n\nI bought a transformer at Gateway Electronics in St. Louis some years ago\nthat looked like a great transformer for a high-current 12 volt supply. The\nsecondary appeared to be wound with #8 enameled wire. I found out the\nsecondary was wound with aluminum wire. After I built the power supply and\ntried to get 20 amps from it but couldn&#39;t, I gave up on it and got another\ntransformer wound with copper wire.\nZack\n\n\nOn Wed, May 27, 2009 at 8:16 AM, Frank Sumption\n&lt;purplealiengirl@...&gt;wrote:\n\n&gt;\n&gt;\n&gt;   We have a touch lamp that comes on by itself, and we have electric\n&gt; matress heaters that make a clicking noise in the radio when the controller\n&gt; is on. When the furnace comes on, it affects the boxes, and--when I first\n&gt; started doign EVP recordings with white noise, if the furnace happened to\n&gt; come on when I was recording a voice would report &quot;it&#39;s on fire!&quot;.\n&gt;\n&gt;  What if that house has aluminum wire?\n&gt;\n&gt;  Frank-S\n&gt;\n&gt;  On Tue, May 26, 2009 at 5:15 PM, April Abercrombie &lt;\n&gt; april@...&gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;  Thanks! Would that account for the tapping noise?\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;  ----- Original Message -----\n&gt;&gt; *From:* Rj &lt;rasterer@...&gt;\n&gt;&gt; *To:* EVP-ITC@yahoogroups.com\n&gt;&gt;  *Sent:* Tuesday, May 26, 2009 4:07 PM\n&gt;&gt; *Subject:* Re: [EVP-ITC] Electrical Question\n&gt;&gt;\n&gt;&gt;    Yes.  Also faulty wiring, which is even more dangerous.\n&gt;&gt; Also with flakey transformers or other power distribution in the area, or\n&gt;&gt; power lines.\n&gt;&gt; Perhaps you can check with some neighbors, and see how their power is\n&gt;&gt; doing.\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; --- On *Tue, 5/26/09, April Abercrombie &lt;\n&gt;&gt; april@...&gt;* wrote:\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; From: April Abercrombie &lt;april@...&gt;\n&gt;&gt; Subject: [EVP-ITC] Electrical Question\n&gt;&gt; To: &quot;EVP-ITC Group&quot; &lt;EVP-ITC@yahoogroups.com&gt;\n&gt;&gt; Date: Tuesday, May 26, 2009, 2:52 PM\n&gt;&gt;\n&gt;&gt;   Hi All,\n&gt;&gt;\n&gt;&gt; Is there someone here that can answer and electrical question for me?\n&gt;&gt;\n&gt;&gt; During the case that I recorded those possible EVP&#39;s-there was a loud\n&gt;&gt; tapping noise that seemed to come from the 2nd bedroom. Upon checking my\n&gt;&gt; logs, every time one of  these clicks were heard, there would be an EMF\n&gt;&gt; spike in the livingroom. The 2nd bedroom is upstairs, the livingroom\n&gt;&gt; downstairs. The home owners have also reported that they have a touch lamp\n&gt;&gt; that comes on all the time by itself and the lights in the Kitchen will dim\n&gt;&gt; occasionally.\n&gt;&gt;\n&gt;&gt; Now these taps are not consistent in timing, loudness or rhythm. Could\n&gt;&gt; this be the work of faulty breakers?\n&gt;&gt;\n&gt;&gt; Thanks!\n&gt;&gt; April\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;  \n&gt;\n\nAluminum wi e is a nigh ma e! The s u ends o o e hea , oxidizes whe e in e connec ions a e made and will spa k, e c. \n \nI bough a ans o me a Ga eway Elec onics in S . Louis some yea s ago ha looked like a g ea ans o me o a high-cu en 12 ol supply. The seconda y appea ed o be wound wi h #8 enameled wi e. I ound ou he seconda y was wound wi h aluminum wi e. A e I buil he powe supply and ied o ge 20 amps om i bu couldn' , I ga e up on i and go ano he ans o me wound wi h coppe wi e.\n\nZack\n \nOn Wed, May 27, 2009 a 8:16 AM, F ank Sump ion pu plealiengi l@...> w o e:\n\n\n\n\n\n\n We ha e a ouch lamp ha comes on by i sel , and we ha e elec ic ma ess hea e s ha make a clicking noise in he adio when he con olle is on. When he u nace comes on, i a ec s he boxes, and--when I i s s a ed doign EVP eco dings wi h whi e noise, i he  u nace happened o come on when I was eco ding a oice would epo \"i 's on i e!\".\n\n \n Wha i ha house has aluminum wi e?\n \n F ank-S\n\nOn Tue, May 26, 2009 a 5:15 PM, Ap il Abe c ombie ap il@abe c ombieghos esea ch.com> w o e:\n\n\n\n\n\n\n\nThanks! Would ha accoun o he apping noise?\n \n\n\n----- O iginal Message ----- \nF om: Rj \nTo: EVP-ITC@yahoog oups.com \n\nSen : Tuesday, May 26, 2009 4:07 PM\nSubjec : Re: [EVP-ITC] Elec ical Ques ion\n\n\n\n\n\n\n\nYes.  Also aul y wi ing, which is e en mo e dange ous.Also wi h lakey ans o me s o o he powe dis ibu ion in he a ea, o powe lines.Pe haps you can check wi h some neighbo s, and see how hei powe is doing.\n--- On Tue, 5/26/09, Ap il Abe c ombie ap il@...> w o e:\nF om: Ap il Abe c ombie ap il@...>Subjec : [EVP-ITC] Elec ical Ques ion\nTo: \"EVP-ITC G oup\" EVP-ITC@yahoog oups.com>Da e: Tuesday, May 26, 2009, 2:52 PM\n\n\n\nHi All,\n \nIs he e someone he e ha can answe and elec ical ques ion o me?\n \nDu ing he case ha I eco ded hose possible EVP's- he e was a loud apping noise ha seemed o come om he 2nd bed oom. Upon checking my logs, e e y ime one o   hese clicks we e hea d, he e would be an EMF spike in he li ing oom. The 2nd bed oom is ups ai s, he li ing oom downs ai s. The home owne s ha e also epo ed ha hey ha e a ouch lamp ha comes on all he ime by i sel and he ligh s in he Ki chen will dim occasionally.\n\n \nNow hese aps a e no consis en in iming, loudness o hy hm. Could his be he wo k o aul y b eake s?\n \nThanks!\nAp il"}