{"id": "1471", "subject": "RE: [EVP-ITC] Haunted Times Magazine: The Telephone to the Dead issue", "author": "Frank Sumption", "timestamp": "2007-07-09T03:52:18Z", "full_text": "Interesting, someone just lurking on the site, whose only purpose is to sell \nmagazines, and contribute nothing to the discussions, perhaps affraid facts \nmight interfere with profits? No doubt other lurkers reporting all that&#39;s \nsaid back to various magazines, and &quot;researchers&quot;!.\n\nWe don&#39;t do commercail ads, good bye!\n\nFrank\n\n\n&gt;From: &quot;Christopher Moon&quot; &lt;cold12_99@...&gt;\n&gt;Reply-To: EVP-ITC@yahoogroups.com\n&gt;To: EVP-ITC@yahoogroups.com\n&gt;Subject: [EVP-ITC] Haunted Times Magazine: The Telephone to the Dead issue\n&gt;Date: Sun, 08 Jul 2007 17:18:36 -0000\n&gt;\n&gt;I just wanted to let everyone know that our summer print issue is now\n&gt;available! This issue goes into detail regarding the most\n&gt;controversial topic in the paranormal community in years; The\n&gt;Telephone to the Dead. My article goes in depth into my experiences\n&gt;with the device as well as my ongoing research. You don&#39;t want to\n&gt;miss this one! Our free online edition is also available so stop by\n&gt;http://www.hauntedtimes.com to subscribe!\n&gt;In other news: Haunted Times Magazine is seeking paranormal research\n&gt;groups and individuals to join our new organization, Haunted Times\n&gt;Paranormal Investigations (H.T.P.I.). For details please contact me\n&gt;at: hauntedtimes@...\n&gt;\n&gt;We are excited to announce that we are starting our very own radio\n&gt;show on the E.B.S.P. Network! The show will be hosted by me and Dina\n&gt;Everling and will air Saturdays from 6:00 pm to 8:00 pm (EST). We\n&gt;will cover all of the topics covered in the magazine and have some\n&gt;great guests! Tune into the show starting this Saturday July 14th\n&gt;where we will be discussing the Telephone to the Dead. Make sure to\n&gt;tune in at: http://www.ebspn.com\n&gt;\n&gt;There is a full list of new Ghost Hunter University events on our web\n&gt;site at: http://www.hauntedtimes.com\n&gt;\n&gt;Once again, thank you to everyone in the community for making us the\n&gt;premiere magazine in the paranormal market!\n&gt;\n&gt;\n\n_________________________________________________________________\nhttp://liveearth.msn.com"}