{"id": "1476", "subject": "Re: Question for all &quot;Frank&#39;s ghostbox&quot; owners", "author": "Steve Hultay", "timestamp": "2007-07-09T11:04:22Z", "full_text": "I too would like to hear some audio files from other boxes.  I&#39;m \ncurrently without a box for the time being.  The antenna broke off \nthe board and i wasn&#39;t paying attention where it came off.  Just \nneeds some soldering i&#39;m sure, i just have to figure out where the \nwire goes on the board.  Hey wish me luck and hopefully i&#39;ll be up \nagain soon with some new clips.  The box does call me Steve as soon \nas i turn it on, but they have also asked for frank or &quot;purple&quot;.  \nWhat a weird road we are traveling down.  My mom was using the box \none day and stated her name, but my feeling is that they already \nknow who is using the box and you don&#39;t need to clarify who you \nare.  It basically works off of energy and besides, the spirit realm \nis all around us and can see what we are doing.  We just can&#39;t see \nthem.  Well wish me luck, i&#39;m going to try and work on the box.\n\n-Steve H.\n\n\n--- In EVP-ITC@yahoogroups.com, Misty Dawn &lt;bulletbabea@...&gt; wrote:\n&gt;\n&gt; Yeah Steve has gotten some good results. I would like to hear some \nof yours and Rosemary&#39;s as well as the others. I think that the more \npeople share the more others can learn and try things out for \nthemselves. \n&gt;    \n&gt;   They have always called me by my complete name no matter what \nmethod I use. Music, Sweep Tuning, Water, Evpmaker, Radio, \netcetera... there are some voices which remain consistent enough to \nmodulate any source.\n&gt;    \n&gt;   Misty\n&gt; \n&gt; psi_research &lt;vilhellm@...&gt; wrote:\n&gt;           Hi Misty, thank you for your post. I will upload some \nfiles. There \n&gt; have been interesting sessions with how the Boxes address people \nby \n&gt; name. And now that it&#39;s happening to Steve it seems like this is \npart \n&gt; of the phenomena of the Box that is repeatable and observed by \n&gt; others. -Bill\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Misty Dawn &lt;bulletbabea@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Bill said something that had me thinking. He mentioned that when \nhe \n&gt; first got his box it called Franks name repeatedly. That isnt the \n&gt; first time I saw someone say that. I know quite a few of you now \nhave \n&gt; been given a box or even constructed your own versions like Steve \n&gt; based on the work Frank did. \n&gt; &gt; \n&gt; &gt; I have heard a couple of peoples results here but I would like \nto \n&gt; hear more so I am going to ask if you have one you comment on your \n&gt; use of it and how you think the results went as well as maybe post \na \n&gt; few sound files that I can hear. I have spent years listening to \nthe \n&gt; box voices but its refreshing to hear others results and see the \n&gt; variations as with any other evp method, it differs by \nuser/location. \n&gt; LOL you know who you are and I wont name you all but I do hope you \n&gt; will share with us.\n&gt; &gt; \n&gt; &gt; Thanks!\n&gt; &gt; Misty\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; ---------------------------------\n&gt; &gt; Be a better Heartthrob. Get better relationship answers from \n&gt; someone who knows.\n&gt; &gt; Yahoo! Answers - Check it out.\n&gt; &gt;\n&gt; \n&gt; \n&gt; \n&gt;          \n&gt; \n&gt;        \n&gt; ---------------------------------\n&gt; Fussy? Opinionated? Impossible to please? Perfect.  Join Yahoo!&#39;s \nuser panel and lay it on us.\n&gt;"}