{"id": "14781", "subject": "Re: Tap sound", "author": "phenom_investigator", "timestamp": "2009-05-30T13:15:06Z", "full_text": "It is not commonly understood that PK events do not require a local PK agent. While this is the far more common phenomenon, it is by no means the only way in which these events can manifest. I personally have conducted rigorous remote PK experiments many times over the years. This remote intention as it has come to be called is quiet real and remarkably replicable with the right people. This validated phenomena actually explains quite a few cases that are generally attributed to other, sometimes far more bizarre causes.\n\nOf course it makes sense to look for natural causes. However it is appropriate to consider alternatives if you have fail to locate plausible physical causations.\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;April Abercrombie&quot; &lt;april@...&gt; wrote:\n&gt;\n&gt; There is absolutely no evidence pointing towards PK phenomena. The homeowners were not present during the investigation. These surges can easily be explained as mundane and therefore we must assume it is. If we can&#39;t rule out all mundane sources, then we have to assume it is not paranormal.\n&gt; \n&gt; These were electrical surges. The only time we had EMF spikes was when these taps would be heard. The meter would spike, and then immediately return to 0.\n&gt; \n&gt; &quot;Do your readings in your notes? Were you reading electrical or magnetic\n&gt; fields? What type of EMF meter were you using?&quot;\n&gt; \n&gt; Yes we logged all readings. We were reading EMF, so a bit of both. We had several types of meters present. At one point, we had 2 KII meters a few feet apart in the living room. On some taps, one would go off, and others, the other one would go off. Most spikes fell in the 2.5 mg range, but a couple went off the scale.\n&gt; \n&gt; It also explains some of the other activity the homeowners complained about-the touch lamp, kitchen lights dimming, etc.\n&gt; \n&gt; Again, these surges were constant, though not uniform.\n&gt; \n&gt; April\n&gt; \n&gt;   ----- Original Message ----- \n&gt;   From: phenom_investigator \n&gt;   To: EVP-ITC@yahoogroups.com \n&gt;   Sent: Thursday, May 28, 2009 10:04 AM\n&gt;   Subject: [EVP-ITC] Re: Tap sound\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;   What I have been hearing on this since the first posting is a single\n&gt;   tap that sounds like wood on wood. Since the tapping was continual\n&gt;   and you noticed an EM spike there is another possibility.\n&gt; \n&gt;   You could have detected a PK event. In poltergeist cases we have come\n&gt;   to realize that living PK agents often are responsible. These agents\n&gt;   function in environments with specific characteristics and themselves\n&gt;   exhibit specific traits. One of the environmental characteristics is\n&gt;   an elevated magnetic field. Often this is a geomagnetic field as seems\n&gt;   to be the case in extreme poltergeist cases. Less extremem cases, \n&gt;   such as this may be, we often see elevated EM field levels. Do your\n&gt;   readings in your notes? Were you reading electrical or magnetic\n&gt;   fields? What type of EMF meter were you using? This might help\n&gt;   determine if the info you noticed was potentially related to PK\n&gt;   effects.\n&gt; \n&gt;   --- In EVP-ITC@yahoogroups.com, &quot;April Abercrombie&quot; &lt;april@&gt; wrote:\n&gt;   &gt;\n&gt;   &gt; Let&#39;s try it again.\n&gt;   &gt;\n&gt;"}