{"id": "14790", "subject": "Spirit Pictures,", "author": "SnowfireL@aol.com", "timestamp": "2009-05-30T17:09:56Z", "full_text": "--part1_c16.63099f01.3752c264_boundary\r\nContent-Type: multipart/related;\n\tboundary=&quot;part1_c16.63099f01.3752c264_rel_boundary&quot;\r\n\r\n\r\n--part1_c16.63099f01.3752c264_rel_boundary\r\nContent-Type: multipart/alternative; boundary=&quot;c16.63099f01_alt_bound&quot;\r\n\r\n\r\n--c16.63099f01_alt_bound\r\nContent-Type: text/plain; charset=&quot;US-ASCII&quot;\r\nContent-Transfer-Encoding: 7bit\r\n\r\nHi, List Members,\n \nI&#39;ve had these two photo&#39;s for a very long  time, and thought you all would \nlike to see them as they are really great,  and they are both real.   I \nknew when these were taken, and I  have the originals put safely away.\n \nThis first one was taken in 1984 it belonged to  a Church lady friend, Lio \nWendell  she was on a tour group to Carlo, Egypt,  at the time there were 22 \npeople standing in the door way of this little Coptic  Chapel, there were \nno statues nor mirrors in the room, just a tiny small window  in the back of \nthe room, and a small Prayer area in the center of the tiny  room.  The man \nin the white shirt was a retired State Dept Emp. it was his  camera used to \ntake this shot, the man in black just seen on the other side was  a Coptic \nPriest, what&#39;s ironic is this small Chapel is surrounded by Muslim  Temples, \nsome people see her, Mary, other&#39;s cannot.  She seem&#39;s to be  visiting this \narea of the world for several years on and off now,  you are  all welcome to \ntake a copy of her picture,  I&#39;m sure she would want that,  so enjoy.\n \nThe next photo, a black and white Kodak   moment it was taken back in 1938 \nby two little elderly lady&#39;s, they lived in  Pontiac MI, next door to my \ngrandma, they were afraid after developing this  because when they did, they \nsaw the Big JC in the photo, again some can&#39;t see  him, other&#39;s can right \naway.  They were outside taking a picture of the  garden, there were no statues \nin the yard, just them along with grandma,  and the real of photo&#39;s were \ndeveloped some time later, but it  got pushed around a bit.   I guess everyone \nwas afraid of JC or  something, one of the lady&#39;s grand daughter&#39;s was \nattending CMU at the time, and  she loaned it to her friend for of all things, a \nwitch craft  class!   It then it some how just disappeared ending up at  \nanother&#39;s person&#39;s home, a place where the friend never visited, it was on  \nloan to her friend as the story goes, guess He didn&#39;t want any part of the \nwitch  craft class. &lt;g&gt;\n \nAfter years it was thought to have been lost in  a fire, but some how \nsomeone managed to safe it, anyway, in 1962 Dave  Burton at CMU  a wedding \nphotographer managed to duplicate the very old  original, from 1938 up until that \ntime everyone thought it could not be  duplicated, but he did, and it was \nput in several local Newspaper&#39;s in the  60&#39;s, David B. from MT Pleasant, MI,  \ndied in an accident not far from his  home, a few years ago,  but his widow \nis still living.   I spoke with her not long ago, just to ask how many \nphotos he managed to  duplicate,  and she told me he made about 4 or 5 and just \npast them  out a couple of people.   This was back in the late  60&#39;s though, \nso she vaguely  recalled the whole  incident .\n \nWell, now once and awhile these photos will  come up on Ebay from people in \nChina, lol where they claim they took the  picture there of the clouds, lol \n another time, I found someone  selling a paper copy on Ebay  for several \nthousand dollars!  And they  claim to say it was taken in snow by a friend or \nwhatever, once I saw an ad  running from some lady in IA, in the Midwest, \nshe was trying to sell it too,  and claiming to have her friend take it of \nsnow in a bush or something or  other, until I called and told her where it \nreally came from, and to please take  it down, because she only had a copy on \na piece of paper she was trying to sell  for 3 Grand, I told her that it \nbelonged to my family, and that it was not to be  sold.  But, if she wished she \ncould give paper copy&#39;s away to  people,  \n \nIt seems that once they find out the truth  of how it really came to be, \nthey take them down pronto.  I have  the original, here put away, and I have a \nduplicate dated from 62,  they  are very old.   And are turning yellow now, \n I have them put in  glass, inside a suit case, near a Bible, both \npicture&#39;s are stored, but I  also have them on my PC  to send out to anyone that \nwants one...I  don&#39;t trust to take them any where for fear of it getting them \ndamaged or  stolen.  These picture&#39;s are a real blessing, how good to have \nthis  wonderful knowledge, knowing He, Jesus is Real!  So, I give these to all \nof  you, may they be a blessing to your endeavors to create this better \nthis  communication for the future of us all.  God Bless you all,  sf\n \nMother Mary &lt;s&gt;\n \n \nJC Super Star!  &lt;s&gt;\n**************A Good Credit Score is 700 or Above. See yours in just 2 easy \nsteps! \n(http://pr.atwola.com/promoclk/100126575x1221322950x1201367186/aol?redir=http://www.freecreditreport.com/pm/default.aspx?sc=668072&hmpgID=62&bcd=\nMaystepsfooterNO62)\n\r\n--c16.63099f01_alt_bound\r\nContent-Type: text/html; charset=&quot;US-ASCII&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML 4.0 Transitional//EN&quot;&gt;\n&lt;HTML&gt;&lt;HEAD&gt;=\r\n&lt;META content=3D&quot;text/html; charset=3DUS-ASCII&quot; http-equiv=3DContent-Type&gt;&lt;=\r\n/HEAD&gt;\n&lt;BODY style=3D&quot;FONT-FAMILY: Arial; COLOR: #000000; FONT-SIZE: 10pt&quot; =\r\nid=3Drole_body   bottomMargin=3D7 leftMargin=3D7 rightMargin=3D7 topMargin=\r\n=3D7&gt;&lt;FONT id=3Drole_document   color=3D#000000 size=3D2 face=3DArial&gt;\n&lt;DIV=\r\n&gt;&lt;STRONG&gt;&lt;FONT color=3D#0000ff&gt;Hi, List Members,&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/DIV&gt;\n&lt;DIV=\r\n&gt;&lt;STRONG&gt;&lt;FONT color=3D#0000ff&gt;&lt;/FONT&gt;&lt;/STRONG&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;STRONG&gt;&lt;F=\r\nONT color=3D#0000ff&gt;I&#39;ve had these two photo&#39;s for a very long \ntime, and t=\r\nhought you all would like to see them as&nbsp;they are really great, \nand&n=\r\nbsp;they are both real.&nbsp; &nbsp;I knew when these were taken, and I \nha=\r\nve the originals put safely away.&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;STRONG&gt;&lt;FONT =\r\ncolor=3D#0000ff&gt;&lt;/FONT&gt;&lt;/STRONG&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;STRONG&gt;&lt;FONT color=3D#00=\r\n00ff&gt;This first one was taken in 1984 it belonged to \na Church lady friend,=\r\n Lio Wendell&nbsp; she was on a tour group to Carlo, Egypt, \nat the time th=\r\nere were 22 people standing in the door way of this little Coptic \nChapel, =\r\nthere were no statues nor mirrors in the room, just a tiny small window \nin=\r\n the back of the room, and a small Prayer area in the center of the tiny \nr=\r\noom.&nbsp; The man in the white shirt was a retired State Dept Emp. it was =\r\nhis \ncamera used to take this shot, the man in black just seen on the other=\r\n side was \na Coptic Priest, what&#39;s ironic is this small Chapel is surrounde=\r\nd by Muslim \nTemples, some people see her, Mary, other&#39;s cannot.&nbsp; She =\r\nseem&#39;s to be \nvisiting this area of the world for several years on and off =\r\nnow,&nbsp; you are \nall welcome to take a copy of her picture, &nbsp;I&#39;m su=\r\nre she would want that, \nso enjoy.&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;STRONG&gt;&lt;FONT=\r\n color=3D#0000ff&gt;&lt;/FONT&gt;&lt;/STRONG&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;STRONG&gt;&lt;FONT color=3D#0=\r\n000ff&gt;The next photo, a black and white Kodak&nbsp; \nmoment it was taken ba=\r\nck in 1938 by two little elderly lady&#39;s, they lived in \nPontiac MI, next do=\r\nor to my grandma, they were afraid after developing this \nbecause when they=\r\n did, they saw the Big JC in the photo, again some can&#39;t see \nhim, other&#39;s =\r\ncan right away.&nbsp; They were outside taking a picture of the \ngarden, th=\r\nere were no statues in the yard, just them along with grandma, \nand&nbsp;th=\r\ne real of photo&#39;s were&nbsp;developed some time later, but&nbsp;it \ngot pus=\r\nhed around a bit.&nbsp; &nbsp;I guess everyone was afraid of JC or \nsomethi=\r\nng, one of the lady&#39;s grand daughter&#39;s was attending CMU at the time, and \n=\r\nshe loaned it to her friend for of all things, a&nbsp;witch craft \nclass!&n=\r\nbsp;&nbsp; It&nbsp;then it some how just disappeared ending up at \nanother&#39;=\r\ns person&#39;s home, a&nbsp;place where the friend never visited, it was on \nlo=\r\nan to her friend as the story goes, guess He didn&#39;t want any part of the wi=\r\ntch \ncraft class. &lt;g&gt;&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;STRONG&gt;&lt;FONT color=\r\n=3D#0000ff&gt;&lt;/FONT&gt;&lt;/STRONG&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;STRONG&gt;&lt;FONT color=3D#0000ff&gt;=\r\nAfter years it was thought to have been lost in \na fire, but some how someo=\r\nne&nbsp;managed to safe it, anyway, in 1962 Dave \nBurton at CMU&nbsp; a wed=\r\nding photographer managed to duplicate the very old \noriginal, from 1938 up=\r\n until that time everyone&nbsp;thought it could not be \nduplicated, but he =\r\ndid,&nbsp;and it was put in several local Newspaper&#39;s in the \n60&#39;s, David B=\r\n. from MT Pleasant, MI, &nbsp;died in an accident not far from his \nhome, a=\r\n few years ago, &nbsp;but&nbsp;his widow is&nbsp;still&nbsp;living.&nbsp; \n=\r\nI spoke&nbsp;with her not long ago, just to ask how many photos he managed =\r\nto \nduplicate,&nbsp; and she told me&nbsp;he made about 4 or 5 and just pas=\r\nt them \nout&nbsp;a couple of people.&nbsp;&nbsp; This was&nbsp;back in the =\r\nlate \n60&#39;s&nbsp;though, so she vaguely&nbsp; recalled the whole \nincident&n=\r\nbsp;.&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;STRONG&gt;&lt;FONT color=3D#0000ff&gt;&lt;/FONT&gt;&lt;/STR=\r\nONG&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;STRONG&gt;&lt;FONT color=3D#0000ff&gt;Well, now once and awhi=\r\nle these photos will \ncome up on Ebay from people in China, lol&nbsp;where =\r\nthey claim they took the \npicture there of the clouds, lol&nbsp;&nbsp;anoth=\r\ner time, I found someone \nselling a paper copy on Ebay &nbsp;for several th=\r\nousand dollars!&nbsp; And they \nclaim to say it was taken in snow by a frie=\r\nnd or whatever, once I saw an ad \nrunning from some lady in IA, in the Midw=\r\nest, she was trying to sell it too, \nand&nbsp;claiming to have her friend t=\r\nake it of snow in a bush or something or \nother, until I called and told he=\r\nr where it really came from, and to please take \nit down, because she only =\r\nhad a copy on a piece of paper she was trying to sell \nfor 3 Grand, I told =\r\nher that it belonged to my family, and that it was not to be \nsold.&nbsp; B=\r\nut, if she wished she could give paper copy&#39;s&nbsp;away to \npeople,&nbsp; &lt;=\r\n/FONT&gt;&lt;/STRONG&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;STRONG&gt;&lt;FONT color=3D#0000ff&gt;&lt;/FONT&gt;&lt;/STRONG&gt;&n=\r\nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;STRONG&gt;&lt;FONT color=3D#0000ff&gt;It seems that once they find =\r\nout the truth \nof&nbsp;how it really came to be,&nbsp;they take them down p=\r\nronto.&nbsp; I have \nthe original, here put away, and I have a duplicate da=\r\nted from 62,&nbsp; they \nare very old.&nbsp;&nbsp; And are turning yellow n=\r\now,&nbsp; I have them put in \nglass, inside a suit case, near a Bible, both=\r\n picture&#39;s are stored, but I \nalso&nbsp;have them&nbsp;on my PC&nbsp; to se=\r\nnd out to anyone that wants one...I \ndon&#39;t trust to take them&nbsp;any wher=\r\ne for fear of it getting them damaged or \nstolen.&nbsp; These picture&#39;s are=\r\n a real blessing, how good to have this \nwonderful knowledge, knowing He, J=\r\nesus is Real!&nbsp; So, I give these to all of \nyou, may they be a blessing=\r\n to your endeavors to create this better this \ncommunication for the future=\r\n of us all.&nbsp; God Bless you all, \nsf&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;STRONG=\r\n&gt;&lt;FONT color=3D#0000ff&gt;&lt;/FONT&gt;&lt;/STRONG&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;IMG SRC=3D&quot;cid:X.=\r\nMA1.1243703379@...&quot;  style=3D&quot;WIDTH: 362px; HEIGHT: 492px&quot; vspace=3D5 w=\r\nidth=3D362 height=3D492   comp_state=3D&quot;speed&quot; DATASIZE=3D&quot;62857&quot; ID=3D&quot;MA1=\r\n.1243703379&quot; &gt;&lt;STRONG&gt;&lt;FONT   color=3D#0000ff&gt;Mother Mary &lt;s&gt;&lt;/FONT&gt;&lt;=\r\n/STRONG&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;STRONG&gt;&lt;FONT color=3D#0000ff&gt;&lt;/FONT&gt;&lt;/STRONG&gt;&nbsp;&lt;/D=\r\nIV&gt;\n&lt;DIV&gt;&lt;STRONG&gt;&lt;FONT color=3D#0000ff&gt;&lt;/FONT&gt;&lt;/STRONG&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;I=\r\nMG SRC=3D&quot;cid:X.MA2.1243703379@...&quot;  style=3D&quot;WIDTH: 480px; HEIGHT: 229=\r\npx&quot; vspace=3D5 width=3D480 height=3D229   comp_state=3D&quot;speed&quot; DATASIZE=3D&quot;=\r\n58809&quot; ID=3D&quot;MA2.1243703379&quot; &gt;&lt;FONT   color=3D#ff0000&gt;&lt;STRONG&gt;JC Super Star=\r\n! \n&lt;s&gt;&lt;/STRONG&gt;&lt;/FONT&gt;&lt;/DIV&gt;&lt;/FONT&gt;&lt;DIV CLASS=3D&quot;aol_ad_footer&quot; ID=3D=\r\n&quot;770afa097304a4b5494e2f8bfe298323&quot;&gt;&lt;br/&gt;&lt;font style=3D&quot;color:black;font:nor=\r\nmal 10pt arial,san-serif;&quot;&gt; &lt;hr style=3D&quot;margin-top:10px&quot;/&gt;&lt;B&gt;A Good Credit=\r\n Score is 700 or Above. &lt;A HREF=3Dhttp://pr.atwola.com/promoclk/100126575x1=\r\n221322950x1201367186/aol?redir=3Dhttp://www.freecreditreport.com/pm/default=\r\n.aspx?sc=3D668072%26hmpgID=3D62%26bcd=3DMaystepsfooterNO62&gt;See yours in jus=\r\nt 2 easy steps!&lt;/A&gt;&lt;/B&gt;&lt;/font&gt;&lt;/DIV&gt;&lt;/BODY&gt;&lt;/HTML&gt;\n\r\n--c16.63099f01_alt_bound--\r\n\n\r\n--part1_c16.63099f01.3752c264_rel_boundary\r\nContent-ID: &lt;X.MA1.1243703379@...&gt;\r\nContent-Type: image/jpeg; name=&quot;MARY.JPG&quot;\r\nContent-Disposition: inline\r\n\r\n[ Attachment content not displayed ]\r\n--part1_c16.63099f01.3752c264_rel_boundary\r\nContent-ID: &lt;X.MA2.1243703379@...&gt;\r\nContent-Type: image/jpeg; name=&quot;JC.jpg&quot;\r\nContent-Disposition: inline\r\n\r\n[ Attachment content not displayed ]\r\n--part1_c16.63099f01.3752c264_rel_boundary--\r\n\n\r\n--part1_c16.63099f01.3752c264_boundary--"}