{"id": "1479", "subject": "RE: [EVP-ITC] Re: Question for all &quot;Frank&#39;s ghostbox&quot; owners", "author": "Frank Sumption", "timestamp": "2007-07-09T13:27:14Z", "full_text": "I&#39;d be very interested, as I seem to be the only one that has this alternate \nID with some on the other side.\n\nFrank-s\n\n\n&gt;From: &quot;psi_research&quot; &lt;vilhellm@...&gt;\n&gt;Reply-To: EVP-ITC@yahoogroups.com\n&gt;To: EVP-ITC@yahoogroups.com\n&gt;Subject: [EVP-ITC] Re: Question for all &quot;Frank&#39;s ghostbox&quot; owners\n&gt;Date: Mon, 09 Jul 2007 04:01:43 -0000\n&gt;\n&gt;Hi Misty, thank you for your post. I will upload some files. There\n&gt;have been interesting sessions with how the Boxes address people by\n&gt;name. And now that it&#39;s happening to Steve it seems like this is part\n&gt;of the phenomena of the Box that is repeatable and observed by\n&gt;others. -Bill\n&gt;\n&gt;--- In EVP-ITC@yahoogroups.com, Misty Dawn &lt;bulletbabea@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Bill said something that had me thinking. He mentioned that when he\n&gt;first got his box it called Franks name repeatedly. That isnt the\n&gt;first time I saw someone say that. I know quite a few of you now have\n&gt;been given a box or even constructed your own versions like Steve\n&gt;based on the work Frank did.\n&gt; &gt;\n&gt; &gt;   I have heard a couple of peoples results here but I would like to\n&gt;hear more so I am going to ask if you have one you comment on your\n&gt;use of it and how you think the results went as well as maybe post a\n&gt;few sound files that I can hear. I have spent years listening to the\n&gt;box voices but its refreshing to hear others results and see the\n&gt;variations as with any other evp method, it differs by user/location.\n&gt;LOL you know who you are and I wont name you all but I do hope you\n&gt;will share with us.\n&gt; &gt;\n&gt; &gt;   Thanks!\n&gt; &gt;   Misty\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; ---------------------------------\n&gt; &gt; Be a better Heartthrob. Get better relationship answers from\n&gt;someone who knows.\n&gt; &gt; Yahoo! Answers - Check it out.\n&gt; &gt;\n&gt;\n&gt;\n\n_________________________________________________________________\nLocal listings, incredible imagery, and driving directions - all in one \nplace! http://maps.live.com/?wip=69&FORM=MGAC01"}