{"id": "14811", "subject": "Re: [EVP-ITC] Re: 1st night with Radio Shack-hack at Fort Mifflin", "author": "Zack Widup", "timestamp": "2009-06-01T21:13:21Z", "full_text": "The problem here is that these are NOT EVP. That&#39;s why we call it ITC. If\nyou&#39;re used to listening to and for EVP, you are going to hear something\ncompletely different.\n\nTook me a while to get used to at first but I did.\n\nZack\n\n\nOn Mon, Jun 1, 2009 at 2:55 PM, ejspinn &lt;ejspinn@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; here was some replys from my team member who considers himself our\n&gt; de-bunker:\n&gt;\n&gt; The one pertaining to &quot;He wouldn&#39;t kill&quot; here was his reply:\n&gt;\n&gt; &quot;doesnt sound like &quot;he wouldn&#39;t kill&quot; sounds like &quot; he wont show ?(her) it\n&gt; was cut off.\n&gt; anyway why would we call this an evp?&quot;\n&gt;\n&gt; This was his response to the one where we asked what happened when they\n&gt; tried to escape and got the response &quot;da pit&quot;\n&gt;\n&gt; He says:&quot;this one sound like a sports radio frequency &quot;the Pitt&quot; sburgh\n&gt; Penquins. I hear do &quot;back off&quot;.\n&gt; example of just radio chatter scanning, to me. would you submit as\n&gt; evidence?&quot;\n&gt;\n&gt; The one where we asked about how to get thru the steel bars and wood and we\n&gt; get the &quot;Take ur file&quot; as a response, my team member who isn&#39;t buying any of\n&gt; this replys:\n&gt; &quot;I slowed end down sounds like &quot;take your final&quot; or &quot;findings could be\n&gt; talking college radio, who knows, its radio frequencies&quot;\n&gt;\n&gt; by the way after i slowed the same file down i noticed it comes thru\n&gt; between 6-8 different clicks on 12-469 radio on the am channel. AS we all\n&gt; know that would equal about 6-8 different channels. what is the chances of\n&gt; getting an understandable phrase in the same tone of voice across that many\n&gt; channels... i should pose that response back to him and see what his\n&gt; de-bunking result would be?\n&gt;\n&gt; I guess he&#39;s intitled to his own opinion, i am just gonna ignore his\n&gt; responses and keep doing what i am doing. Thanks for the support and\n&gt; knowledge!\n&gt;\n&gt; Keep the comments coming\n&gt;\n&gt; \n&gt;\n\nThe p oblem he e is ha hese a e NOT EVP. Tha 's why we call i ITC. I you' e used o lis ening o and o EVP, you a e going o hea some hing comple ely di e en . \n \nTook me a while o ge used o a i s bu I did.\n \nZack\n \nOn Mon, Jun 1, 2009 a 2:55 PM, ejspinn ejspinn@yahoo.com> w o e:\n\n\n\n\n\nhe e was some eplys om my eam membe who conside s himsel ou de-bunke :The one pe aining o \"He wouldn' kill\" he e was his eply:\"doesn sound like \"he wouldn' kill\" sounds like \" he won show ?(he ) i was cu o .\nanyway why would we call his an e p?\"This was his esponse o he one whe e we asked wha happened when hey ied o escape and go he esponse \"da pi \"He says:\" his one sound like a spo s adio equency \" he Pi \" sbu gh Penquins. I hea do \"back o \".\nexample o jus adio cha e scanning, o me. would you submi as e idence?\"The one whe e we asked abou how o ge h u he s eel ba s and wood and we ge he \"Take u ile\" as a esponse, my eam membe who isn' buying any o his eplys:\n\"I slowed end down sounds like \" ake you inal\" o \" indings could be alking college adio, who knows, i s adio equencies\"by he way a e i slowed he same ile down i no iced i comes h u be ween 6-8 di e en clicks on 12-469 adio on he am channel. AS we all know ha would equal abou 6-8 di e en channels. wha is he chances o ge ing an unde s andable ph ase in he same one o oice ac oss ha many channels... i should pose ha esponse back o him and see wha his de-bunking esul would be?\nI guess he's in i led o his own opinion, i am jus gonna igno e his esponses and keep doing wha i am doing. Thanks o he suppo and knowledge!Keep he commen s coming"}