{"id": "14818", "subject": "Re: For the Skeptics", "author": "Jeff", "timestamp": "2009-06-02T20:49:51Z", "full_text": "Thanks for posting the info, Frank. \nIve had a play with the MK484 a while ago. It seems very quiet compared to superhet chips, but havent connected a sweep waveform to it.\nJEFF \n\n\n--- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  It&#39;s in my folder here, I just uploaded it. It worked as a radio, and the audio was really clean. Don&#39;t foget you have to tweak the antenna turns, and positon on the ferrite core to get optimimum results. If you do a google on the MK484, there&#39;s some source of kits for this radio.\n&gt; \n&gt;  Joe--I foget his last name--that make&#39;s Joe&#39;s Box, had a version with this chip for AM reception. \n&gt; \n&gt;  Frank-S\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Jeff&quot; &lt;vortex6066@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hi Frank,\n&gt; &gt; Have you posted the schematic of the TRF circuit? I may have missed this if so. Would be interested to see it. Presume you used the MK484 TRF chip?\n&gt; &gt; Incidentally, I heard comment a while ago that the Minibox uses the MK484 chip.\n&gt; &gt; JEFF\n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt;  If all this EVP stuff is imagination, how come I don&#39;t hear squat for ghost\n&gt; &gt; &gt; voices in the audio from the TRF radios? The audio is loud and clear, and\n&gt; &gt; &gt; broadcast fragments easily decernable, but few, if any ghost voices. I\n&gt; &gt; &gt; thought I got some with a single tuner, but with the double tuner--nothin&#39;!\n&gt; &gt; &gt; \n&gt; &gt; &gt;  I have to wonder if the down conversion process in the standard radio\n&gt; &gt; &gt; design is part of the box EVP. In super hetrodyne radios, the original RF\n&gt; &gt; &gt; signal is converted to a lower fixed frequency, usually 455khz. So just\n&gt; &gt; &gt; providing the raw audio seems to be only part of the box functions, the\n&gt; &gt; &gt; other tuned circuits must play a parts--the IF transformers being tuned\n&gt; &gt; &gt; circuits, plus the antenna, and the oscillator. Somethin&#39; th think about!\n&gt; &gt; &gt; \n&gt; &gt; &gt;  I tried an LA1135 chip this morning, same as the car tuners use, and it\n&gt; &gt; &gt; sounds like a car tuner--so it&#39;s back to the LM3820.\n&gt; &gt; &gt; \n&gt; &gt; &gt; F-S\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}