{"id": "14843", "subject": "snowfirel", "author": "Misty Dawn", "timestamp": "2009-06-04T20:05:37Z", "full_text": "--0-1906627820-1244145937=:4435\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nSnowfirel,\nI was responding to your message and got disconnected (storming =\r\ndown here LOL) so not sure if any of it made it thru so I will repeat what =\r\nI can of my original response.\n=A0\nBruce is no longer a member of the EVP-I=\r\nTC group. When responding to his messages please post ONLY in his group or =\r\nwherever you are responding to. I know that you like to cross post to all g=\r\nroups at once. \n=A0\nHe is no longer allowed to post here because of his vic=\r\nious attacks on members and we definitely do not tolerate attacks on our fo=\r\nunding member Frank S who started this group in the first place. Bruce lost=\r\n his posting abilities a long time ago because quite frankly we had seen en=\r\nough of the attacks. He would attack someone, unjoin then rejoin and apolog=\r\nize, it would be calm a while then the cycle would repeat itself. I think y=\r\nou will see the same if you check the archives of any group he has been a m=\r\nember of. \n=A0\nFrank likes to vent too. He often gets tired of these attack=\r\ns in his inbox or things people say upset him. I personally have no problem=\r\n with people who vent its when they email members privately and threaten th=\r\nem that it becomes a problem. Unfortunately this is why I can not let=A0bru=\r\nce rejoin our group even tho he has tried to many times. It makes me very s=\r\nad.\n=A0\nI understand your wishes for everyone to work together. We all have=\r\n a common goal when it comes to the research, but sometimes people are not =\r\nfocused on the research they have other things on their minds.\n=A0\nThat bei=\r\nng said Bruce is no longer allowed to post here and members of this group w=\r\nho post for him risk the same consequences. As you notice if frank copies w=\r\nhat crap bruce is emailing he is at least nice enough to leave the guys nam=\r\ne out. Those who know Bruce know who it came from. Those who dont he has a =\r\nchance for a fresh start with and I hope he uses it wisely. I wish him luck=\r\n and hope the best for him but theres no more I can do to help. I tried man=\r\ny times to stop the fighting between everyone and it may end for a short wh=\r\nile but then things like this start to happen.\n=A0\nPlease refrain from post=\r\ning responses to bruce in our forum. I dont say this to upset you any furth=\r\ner... instead I say it because the research we do is far more important tha=\r\nn anyones ego or being the right one in an argument. I think you agree with=\r\n me there since you wish they would all kiss and make up. I&#39;d like nothing =\r\nbetter but at this point I dont see them doing that. \n=A0\nI cant change peo=\r\nple from being who they are, all I can do is change myself. I am sorry for =\r\nany distress this causes you. Believe me I understand. I am not telling you=\r\n to stop being friends with anyone either, if anything they could use such =\r\na postive spirit in their lives. Lead by example, dont follow blindly.\n=A0\n=\r\nLove and Light!!\n=A0\nMisty\n\n--- On Thu, 6/4/09, SnowfireL@... &lt;Snowfire=\r\nL@...&gt; wrote:\n\n\nFrom: SnowfireL@... &lt;SnowfireL@...&gt;\nSubject: [E=\r\nVP-ITC] Re: [RTSC] a copy of my final e-mail to Frank sumption I will go no=\r\n further!\nTo: RTSC@yahoogroups.com, inside_the_box_rtsc_talk_radio@yahoogro=\r\nups.com, EVP-ITC@yahoogroups.com\nDate: Thursday, June 4, 2009, 3:25 PM\n\n\n\n\n=\r\n\n\n\n\n\nSorry to hear this Bruce, I=A0sure hope things get better, =A0I had no=\r\n idea there were so many problems when I joined all these lists, =A0I think=\r\n you are all great people, you folks together are making history don&#39;t you =\r\nall realize this?=A0 There are so many people out there that have never hea=\r\nrd of this type of communication, thousands out there!=A0 My friend just lo=\r\nst her mother a couple of weeks ago, when I told her about the work you all=\r\n are doing, tears were replaced with a smile, she is looking forward to hea=\r\nring from her mom now too.=A0 Stop trying to hurt each other, it&#39;s not wort=\r\nh it, life is too short for this stuff.=A0 You are all great people, May Go=\r\nd Bless You All=A0~ And He Already Has,\nsf\n=A0\n\nIn a message dated 6/4/2009=\r\n 2:27:06 P.M. Eastern Daylight Time, balllan94@yahoo. com writes:\n\n\n\n\n\n\nguy=\r\ns,\n\nSorry to burden you with this nonsense but this group and the RTSC grou=\r\np are my only venues to respond to posts on other groups and have my accoun=\r\nt heard, I hope you do not mind to much.\n\nHere is a copy of my final person=\r\nal e-mail to Frank Sumption which by the way is meant for him but he see&#39;s =\r\nfit to post them publicly in an attempt to discredit me.\n\nI want you to rea=\r\nd it first hand so there are no chance of it being altered before it is pos=\r\nted else where.\n\nI will not address Frank again\n------------ --------- ----=\r\n----- --------- --------- --------- -\n\nFrank,\n\nThis is getting ridiculous n=\r\now, you should stop writing these posts, all you are doing is making yourse=\r\nlf look ridiculous.\n\nI have offered many times to make my raw recordings av=\r\nailable for review by anyone who wants them. I have made the same challenge=\r\n to your friend moon who we all know is behind this tirade he has time and =\r\nagain refused or ignored the request for any type of audio file\nto be publi=\r\ncly posted for revue and continues to take advantage of innocent unsuspecti=\r\nng people with his con game and charging large amounts of money for session=\r\ns where he fabricates and makes up content as he goes along.\n\nI was the onl=\r\ny one to confront him in public and expose him for the fake he is and this =\r\nis his feeble attempt at retaliation. I and other researchers like me have =\r\nbrought this research light years from where it was when you and I first me=\r\nt, moon just continues to use it to rip people off and has not contributed =\r\na thing to the research of ghost box communication beside lining his own po=\r\nckets. \n\nJust the fact that he has you doing his dirty work shows the type =\r\nof guy he is. I can remember a time when you publicly came out against any =\r\ntype of money making using your boxes and even refused moon when he wanted =\r\nto manufacture and sell them for large profits yet now you condone his robb=\r\nery of innocent unaware people and actually act foolish on his behest.\n\nFra=\r\nnk you are better than this, just concentrate on developing a better box an=\r\nd forget about moon and his tricks and lies, he is finished in the paranorm=\r\nal and he knows it, everyone is wise to his game and he is practically an o=\r\nutcast.\n\nFrank you are hitching you wagon to a dead horse. Get away from th=\r\nese bad influences before they ruin your reputation as well.\n\nWe have had t=\r\nhis moon discussion in the past and once he has exhausted his need for you =\r\nhe will screw you again like he has done so many times before.\n\nFrank, I li=\r\nke and respect you and I hope you will consider what I have said in this e-=\r\nmail and I sincerely hope you post this one on the evp-itc group. I will be=\r\n posting it on my group and others I belong to.\n\nYour former friend\nBruce\n\n=\r\n\n\n\n\n\nLimited Time Offers: Save big on popular laptops at Dell\n\n\n\n\n\n\n\n\n\n\n\n\n\n=\r\n\n\n      \r\n--0-1906627820-1244145937=:4435\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;DIV&gt;Snowfirel,&lt;/DIV&gt;\n&lt;DIV&gt;I was responding t=\r\no your message and got disconnected (storming down here LOL) so not sure if=\r\n any of it made it thru so I will repeat what I can of my original response=\r\n.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Bruce is no longer a member of the EVP-ITC g=\r\nroup. When responding to his messages please post ONLY in his group or wher=\r\never you are responding to. I know that you like to cross post to all group=\r\ns at once. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;He is no longer allowed to post he=\r\nre because of his vicious attacks on members and we definitely do not toler=\r\nate attacks on our founding member Frank S who started this group in the fi=\r\nrst place. Bruce lost his posting abilities a long time ago because quite f=\r\nrankly we had seen enough of the attacks. He would attack someone, unjoin t=\r\nhen rejoin and apologize, it would be calm a while then the cycle would rep=\r\neat itself. I think you will see the same if you check the archives of any =\r\ngroup he has been a member of. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Frank likes to=\r\n vent too. He often gets tired of these attacks in his inbox or things peop=\r\nle say upset him. I personally have no problem with people who vent its whe=\r\nn they email members privately and threaten them that it becomes a problem.=\r\n Unfortunately this is why I can not let&nbsp;bruce rejoin our group even t=\r\nho he has tried to many times. It makes me very sad.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV=\r\n&gt;\n&lt;DIV&gt;I understand your wishes for everyone to work together. We all have =\r\na common goal when it comes to the research, but sometimes people are not f=\r\nocused on the research they have other things on their minds.&lt;/DIV&gt;\n&lt;DIV&gt;&n=\r\nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;That being said Bruce is no longer allowed to post here and=\r\n members of this group who post for him risk the same consequences. As you =\r\nnotice if frank copies what crap bruce is emailing he is at least nice enou=\r\ngh to leave the guys name out. Those who know Bruce know who it came from. =\r\nThose who dont he has a chance for a fresh start with and I hope he uses it=\r\n wisely. I wish him luck and hope the best for him but theres no more I can=\r\n do to help. I tried many times to stop the fighting between everyone and i=\r\nt may end for a short while but then things like this start to happen.&lt;/DIV=\r\n&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Please refrain from posting responses to bruce in =\r\nour forum. I dont say this to upset you any further... instead I say it bec=\r\nause the research we do is far more important than anyones ego or being the=\r\n right one in an argument. I think you agree with me there since you wish t=\r\nhey would all kiss and make up. I&#39;d like nothing better but at this point I=\r\n dont see them doing that. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I cant change peop=\r\nle from being who they are, all I can do is change myself. I am sorry for a=\r\nny distress this causes you. Believe me I understand. I am not telling you =\r\nto stop being friends with anyone either, if anything they could use such a=\r\n postive spirit in their lives. Lead by example, dont follow blindly.&lt;/DIV&gt;=\r\n\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Love and Light!!&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Misty=\r\n&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Thu, 6/4/09, SnowfireL@... &lt;I&gt;&lt;SnowfireL@...&g=\r\nt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;&lt;/DIV&gt;\n&lt;BLOCKQUOTE style=3D&quot;PADDING-LEFT: 5px; MARGIN-=\r\nLEFT: 5px; BORDER-LEFT: rgb(16,16,255) 2px solid&quot;&gt;&lt;BR&gt;From: SnowfireL@aol.c=\r\nom &lt;SnowfireL@...&gt;&lt;BR&gt;Subject: [EVP-ITC] Re: [RTSC] a copy of my =\r\nfinal e-mail to Frank sumption I will go no further!&lt;BR&gt;To: RTSC@yahoogroup=\r\ns.com, inside_the_box_rtsc_talk_radio@yahoogroups.com, EVP-ITC@yahoogroups.=\r\ncom&lt;BR&gt;Date: Thursday, June 4, 2009, 3:25 PM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3Dyiv106204612=\r\n2&gt;\n&lt;DIV id=3Dygrp-text&gt;\n&lt;DIV&gt;&lt;FONT id=3Drole_document face=3DArial color=3D=\r\n#000000 size=3D2&gt;\n&lt;DIV&gt;&lt;STRONG&gt;&lt;FONT color=3D#0000ff&gt;Sorry to hear this Bru=\r\nce, I&nbsp;sure hope things get better, &nbsp;I had no idea there were so m=\r\nany problems when I joined all these lists, &nbsp;I think you are all great=\r\n people, you folks together are making history don&#39;t you all realize this?&=\r\nnbsp; There are so many people out there that have never heard of this type=\r\n of communication, thousands out there!&nbsp; My friend just lost her mothe=\r\nr a couple of weeks ago, when I told her about the work you all are doing, =\r\ntears were replaced with a smile, she is looking forward to hearing from he=\r\nr mom now too.&nbsp; Stop trying to hurt each other, it&#39;s not worth it, lif=\r\ne is too short for this stuff.&nbsp; You are all great people, May God Bles=\r\ns You All&nbsp;~ And He Already Has,&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;STRONG&gt;&lt;FO=\r\nNT color=3D#0000ff&gt;sf&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;In=\r\n a message dated 6/4/2009 2:27:06 P.M. Eastern Daylight Time, balllan94@yah=\r\noo. com writes:&lt;/DIV&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: blue 2px solid&quot;&gt;&lt;FO=\r\nNT style=3D&quot;BACKGROUND-COLOR: transparent&quot; face=3DArial color=3D#000000 siz=\r\ne=3D2&gt;\n&lt;DIV id=3Dygrp-mlmsg&gt;\n&lt;DIV id=3Dygrp-msg&gt;\n&lt;DIV id=3Dygrp-text&gt;&lt;BR&gt;&lt;B=\r\nR&gt;\n&lt;DIV&gt;guys,&lt;BR&gt;&lt;BR&gt;Sorry to burden you with this nonsense but this group =\r\nand the RTSC group are my only venues to respond to posts on other groups a=\r\nnd have my account heard, I hope you do not mind to much.&lt;BR&gt;&lt;BR&gt;Here is a =\r\ncopy of my final personal e-mail to Frank Sumption which by the way is mean=\r\nt for him but he see&#39;s fit to post them publicly in an attempt to discredit=\r\n me.&lt;BR&gt;&lt;BR&gt;I want you to read it first hand so there are no chance of it b=\r\neing altered before it is posted else where.&lt;BR&gt;&lt;BR&gt;I will not address Fran=\r\nk again&lt;BR&gt;------------ --------- --------- --------- --------- --------- -=\r\n&lt;BR&gt;&lt;BR&gt;Frank,&lt;BR&gt;&lt;BR&gt;This is getting ridiculous now, you should stop writi=\r\nng these posts, all you are doing is making yourself look ridiculous.&lt;BR&gt;&lt;B=\r\nR&gt;I have offered many times to make my raw recordings available for review =\r\nby anyone who wants them. I have made the same challenge to your friend moo=\r\nn who we all know is behind this tirade he has time and again refused\n or i=\r\ngnored the request for any type of audio file&lt;BR&gt;to be publicly posted for =\r\nrevue and continues to take advantage of innocent unsuspecting people with =\r\nhis con game and charging large amounts of money for sessions where he fabr=\r\nicates and makes up content as he goes along.&lt;BR&gt;&lt;BR&gt;I was the only one to =\r\nconfront him in public and expose him for the fake he is and this is his fe=\r\neble attempt at retaliation. I and other researchers like me have brought t=\r\nhis research light years from where it was when you and I first met, moon j=\r\nust continues to use it to rip people off and has not contributed a thing t=\r\no the research of ghost box communication beside lining his own pockets. &lt;B=\r\nR&gt;&lt;BR&gt;Just the fact that he has you doing his dirty work shows the type of =\r\nguy he is. I can remember a time when you publicly came out against any typ=\r\ne of money making using your boxes and even refused moon when he wanted to =\r\nmanufacture and sell them for large profits yet now you condone\n his robber=\r\ny of innocent unaware people and actually act foolish on his behest.&lt;BR&gt;&lt;BR=\r\n&gt;Frank you are better than this, just concentrate on developing a better bo=\r\nx and forget about moon and his tricks and lies, he is finished in the para=\r\nnormal and he knows it, everyone is wise to his game and he is practically =\r\nan outcast.&lt;BR&gt;&lt;BR&gt;Frank you are hitching you wagon to a dead horse. Get aw=\r\nay from these bad influences before they ruin your reputation as well.&lt;BR&gt;&lt;=\r\nBR&gt;We have had this moon discussion in the past and once he has exhausted h=\r\nis need for you he will screw you again like he has done so many times befo=\r\nre.&lt;BR&gt;&lt;BR&gt;Frank, I like and respect you and I hope you will consider what =\r\nI have said in this e-mail and I sincerely hope you post this one on the ev=\r\np-itc group. I will be posting it on my group and others I belong to.&lt;BR&gt;&lt;B=\r\nR&gt;Your former friend&lt;BR&gt;Bruce&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV style=3D&quot;COLOR: whit=\r\ne&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/FONT&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;/FONT&gt;\n&lt;DIV class=3Daol_ad_=\r\nfooter id=3Dfdbdfb0212a0cb1d2fbbd13ae8750157&gt;&lt;BR&gt;&lt;FONT style=3D&quot;FONT: 10pt =\r\narial, san-serif; COLOR: black&quot;&gt;\n&lt;HR&gt;\n&lt;A href=3D&quot;http://pr.atwola.com/promo=\r\nclk/100126575x1221354145x1201369495/aol?redir=3Dhttp:%2F%2Fad.doubleclick.n=\r\net%2Fclk%3B215221161%3B37268813%3By&quot; target=3D_blank rel=3Dnofollow&gt;Limited=\r\n Time Offers: Save big on popular laptops at Dell&lt;/A&gt;&lt;/FONT&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/D=\r\nIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n      \r\n--0-1906627820-1244145937=:4435--"}