{"id": "14845", "subject": "Re: Friggin&#39; spies", "author": "Misty", "timestamp": "2009-06-04T20:13:53Z", "full_text": "LOL my recommendation is delete delete delete. You both have better ways to spend your time than fighting.\n\nMisty\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  And yet, he wonders why he&#39;s banned from this group. Duffus just does not\n&gt; get it!\n&gt; \n&gt;  Yeah, I forgot, guys like that have nothing to do all day but scan the\n&gt; other groups to see who&#39;s talking about them.\n&gt; \n&gt;  Should I forward his response?\n&gt; \n&gt;  F-S\n&gt; \n&gt; On Thu, Jun 4, 2009 at 11:54 AM, Misty Dawn &lt;bulletbabea@...&gt; wrote:\n&gt; \n&gt; &gt;\n&gt; &gt;\n&gt; &gt;    There is no need for spies on this board, when you made it you made it\n&gt; &gt; viewable to the world. Dont have to be a member to  read whats posted here\n&gt; &gt; in archives (which is packed full of all sorts of information including this\n&gt; &gt; subject), only have to be a member to add to the discussions. Nobody has to\n&gt; &gt; forward him anything he can take the time to read for himself.\n&gt; &gt;\n&gt; &gt; Misty\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; --- On *Thu, 6/4/09, Frank Sumption &lt;purplealiengirl@...&gt;* wrote:\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt; &gt; Subject: [EVP-ITC] Friggin&#39; spies\n&gt; &gt; To: evp-itc@yahoogroups.com\n&gt; &gt; Date: Thursday, June 4, 2009, 1:01 PM\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;   Frank,\n&gt; &gt;\n&gt; &gt;  Someone, and I think I know who, is forwarding posts. If I find out for\n&gt; &gt; sure who it is, I&#39;ll recommend you get banned.  Obviously this idiot knows\n&gt; &gt; what he&#39;s guilty of, and assumes I meant him. Maybe this person should just\n&gt; &gt; be banned anyway.\n&gt; &gt;\n&gt; &gt;  Frank-S\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; &quot;Do me a favor, stop letting Chris Moon put his words into your mouth. The\n&gt; &gt; things you accused who we all know is me in your post #14829 and #14832 are\n&gt; &gt; the same pathetic things moon said when I exposed him on his own radio show\n&gt; &gt; a while back.\n&gt; &gt;\n&gt; &gt; Frank don&#39;t lower yourself to his level and don&#39;t let him manipulate you.\n&gt; &gt;\n&gt; &gt; Stop letting him talk you into slandering other people with unsubstantiated\n&gt; &gt; claims. Frank I am not saying this out of anger but he is pushing you to do\n&gt; &gt; things because he is not man enough to do them himself!\n&gt; &gt;\n&gt; &gt; Tell him that I will produce the coinciding raw file for any posted file I\n&gt; &gt; have, see if he can do the same. Let this be the last time I have to write\n&gt; &gt; you I am asking politely..\n&gt; &gt;\n&gt; &gt; *All is possible, nothing is probable&quot;*\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; \n&gt; &gt;\n&gt;"}