{"id": "14865", "subject": "Re: [EVP-ITC] Re: [RTSC] a copy of my final e-mail to Frank sumption  I will go no further!", "author": "eamonn mgherbi", "timestamp": "2009-06-05T15:52:56Z", "full_text": "--0-1429035386-1244217176=:74847\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nWow first of all dont swear on here and wind your neck in!\n\nNow I have to a=\r\ndmit I didnt mean you I was talking about Chris moon but hell im at work an=\r\nd im trying to do 2 things at once.\n\nI have been following this group for a=\r\n year and from the message i wrote this is the first time I got a reply. No=\r\nw Frank I think you work is quality and I definately want to learn more abo=\r\nut your work and what you do. and if you could advise me of where I can see=\r\n a profile of yourself that would be great. but dont start with the abusive=\r\n crap towards me.\n\nLets keep it clean. Again I was talking about Moon. not =\r\nyou Frank, iv read my message over and i definately worded it wrong. Im jus=\r\nt not a big fan of Chris Moon.\n\nAnd the religious crap thing also wind your=\r\n neck in about that, that was a pretty crappy thing first of all im not rel=\r\nigious it just causes war. second of all I want to know more about your wor=\r\nk.\n\n\n\n________________________________\nFrom: Frank Sumption &lt;purplealiengir=\r\nl@...&gt;\nTo: EVP-ITC@yahoogroups.com\nSent: Friday, 5 June, 2009 16:25:2=\r\n8\nSubject: Re: [EVP-ITC] Re: [RTSC] a copy of my final e-mail to Frank sump=\r\ntion I will go no further!\n\n\n\n\n\n=A0Arrogant!? Lets see,=A0I don&#39;t do shows,=\r\n I&#39;m not on podcast every friggin&#39; day proclaiming my expertness, I don&#39;t c=\r\nharge money-for anything, I share all information and schematics, and I do =\r\nnot kiss anyone&#39;s ass, guess that must be so egotistical of me.=A0 Arrogant=\r\n!?, who is=A0the f--- is the duffus out there with the high priest mentalit=\r\ny?=A0 The really sad part is trhe brain dead dorks that follow these clowns=\r\n. Haliday proclaimed himself box expert extraordinaire, and there&#39;s those s=\r\norry twits that eat up everyword. There are no box/paranormal experts, no o=\r\nne knows how this shit works. Go to church if you want a religious experien=\r\nce!\n\n=A0Anyway, there is one advantage to using tape, the entities seem cap=\r\nable of changing the messages as needed. I can use the same recording over =\r\nan over, and I swear, I get meaningful, having to do with the moment on eve=\r\nry listening. Brain matrixing--perhaps- -or does it really change? I can&#39;t =\r\ntell. \n\n=A0Frank-S\n\n\n\n=A0\nOn Fri, Jun 5, 2009 at 3:58 AM, eamonn mgherbi &lt;e=\r\namonnmgherbi@ yahoo.co. uk&gt; wrote:\n\n\n\n\nHi All\n\nI have to admit that I share=\r\n the same opinion as Bruce. I dont what everyones take is on this but I fel=\r\nt that some of moon and even Franks attitude was slightly arrogant. I am a =\r\nresearcher in the UK using old reel to reel methods and obtaining excellent=\r\n results. I lost some family and some close friends=A05 yeara ago=A0and sud=\r\ndenly it dawned on me...what is life all about. I went on to research every=\r\n evp pioneer i could, listen to hours/days of recordings and it changed my =\r\noutlook on life. tears were turned to smiles and then I realised what all t=\r\nhis research is for. it was a big step for me spiritually. \n\nI dont know if=\r\n there is anyone else on here using old fashioned methods but if anybody wo=\r\nuld like to hear recordings please ask. I am using a reel to reel sony &quot;Hi =\r\nfrequency&quot; recorder and trying various types of tones, backgrounds e.t.c.\n\n=\r\nGood luck to everyone with their research, you are right we are changing hi=\r\nstory we are discovering new things. if it wasnt for individuals such as ra=\r\nudive, jurghenson to name a few, maybe we wouldnt have discovered this. it =\r\ntakes a brave individual to tackle an arrogant human race blunted with scie=\r\nnce.\n\nKind Regards\n\nThe quiet one :-)\n\n\n\n\n________________________________\n=\r\nFrom: &quot;SnowfireL@aol. com&quot; &lt;SnowfireL@aol. com&gt;\nTo: RTSC@yahoogroups. com; =\r\ninside_the_box_ rtsc_talk_ radio@yahoogroup s.com; EVP-ITC@yahoogroups .com=\r\n\nSent: Thursday, 4 June, 2009 20:25:26\nSubject: [EVP-ITC] Re: [RTSC] a copy=\r\n of my final e-mail to Frank sumption I will go no further!\n\n\n\n\n\n__________=\r\n______________________\nLimited Time Offers: Save big on popular laptops at =\r\nDell\nSorry to hear this Bruce, I=A0sure hope things get better, =A0I had no=\r\n idea there were so many problems when I joined all these lists, =A0I think=\r\n you are all great people, you folks together are making history don&#39;t you =\r\nall realize this?=A0 There are so many people out there that have never hea=\r\nrd of this type of communication, thousands out there!=A0 My friend just lo=\r\nst her mother a couple of weeks ago, when I told her about the work you all=\r\n are doing, tears were replaced with a smile, she is looking forward to hea=\r\nring from her mom now too.=A0 Stop trying to hurt each other, it&#39;s not wort=\r\nh it, life is too short for this stuff.=A0 You are all great people, May Go=\r\nd Bless You All=A0~ And He Already Has,\nsf\n\nIn a message dated 6/4/2009 2:2=\r\n7:06 P.M. Eastern Daylight Time, balllan94@yahoo. com writes:\n\n\n\nguys,\n\nSor=\r\nry to burden you with this nonsense but this group and the RTSC group are m=\r\ny only venues to respond to posts on other groups and have my account heard=\r\n, I hope you do not mind to much.\n\nHere is a copy of my final personal e-ma=\r\nil to Frank Sumption which by the way is meant for him but he see&#39;s fit to =\r\npost them publicly in an attempt to discredit me.\n\nI want you to read it fi=\r\nrst hand so there are no chance of it being altered before it is posted els=\r\ne where.\n\nI will not address Frank again\n------------ --------- --------- -=\r\n-------- --------- --------- -\n\nFrank,\n\nThis is getting ridiculous now, you=\r\n should stop writing these posts, all you are doing is making yourself look=\r\n ridiculous.\n\nI have offered many times to make my raw recordings available=\r\n for review by anyone who wants them. I have made the same challenge to you=\r\nr friend moon who we all know is behind this tirade he has time and again r=\r\nefused or ignored the request for any type of audio file\nto be publicly pos=\r\nted for revue and continues to take advantage of innocent unsuspecting peop=\r\nle with his con game and charging large amounts of money for sessions where=\r\n he fabricates and makes up content as he goes along.\n\nI was the only one t=\r\no confront him in public and expose him for the fake he is and this is his =\r\nfeeble attempt at retaliation. I and other researchers like me have brought=\r\n this research light years from where it was when you and I first met, moon=\r\n just continues to use it to rip people off and has not contributed a thing=\r\n to the research of ghost box communication beside lining his own pockets. =\r\n\n\nJust the fact that he has you doing his dirty work shows the type of guy =\r\nhe is. I can remember a time when you publicly came out against any type of=\r\n money making using your boxes and even refused moon when he wanted to manu=\r\nfacture and sell them for large profits yet now you condone his robbery of =\r\ninnocent unaware people and actually act foolish on his behest.\n\nFrank you =\r\nare better than this, just concentrate on developing a better box and forge=\r\nt about moon and his tricks and lies, he is finished in the paranormal and =\r\nhe knows it, everyone is wise to his game and he is practically an outcast.=\r\n\n\nFrank you are hitching you wagon to a dead horse. Get away from these bad=\r\n influences before they ruin your reputation as well.\n\nWe have had this moo=\r\nn discussion in the past and once he has exhausted his need for you he will=\r\n screw you again like he has done so many times before.\n\nFrank, I like and =\r\nrespect you and I hope you will consider what I have said in this e-mail an=\r\nd I sincerely hope you post this one on the evp-itc group. I will be postin=\r\ng it on my group and others I belong to.\n\nYour former friend\nBruce\n\n\n\n\n\n\n\n =\r\n     \r\n--0-1429035386-1244217176=:74847\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;&lt;head&gt;&lt;style type=3D&quot;text/css&quot;&gt;&lt;!-- DIV {margin:0px;} --&gt;&lt;/style&gt;&lt;/he=\r\nad&gt;&lt;body&gt;&lt;div style=3D&quot;font-family:times new roman, new york, times, serif;=\r\nfont-size:12pt&quot;&gt;&lt;DIV&gt;\n&lt;DIV&gt;Wow first of all dont swear on here and wind you=\r\nr neck in!&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Now I have to admit I didnt mean yo=\r\nu I was talking about Chris moon but hell im at work and im trying to do 2 =\r\nthings at once.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I have been following this gro=\r\nup for a year and from the message i wrote this is the first time I got a r=\r\neply. Now Frank I think you work is quality and I definately want to learn =\r\nmore about your work and what you do. and if you could advise me of where I=\r\n can see a profile of yourself that would be great. but dont start with the=\r\n abusive crap towards me.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Lets keep it clean. =\r\nAgain I was talking about Moon. not you Frank, iv read my message over and =\r\ni definately worded it wrong. Im just not a big fan of Chris Moon.&lt;/DIV&gt;\n&lt;D=\r\nIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;And the religious crap thing also wind your neck in ab=\r\nout that, that was a pretty crappy thing first of all im not religious it j=\r\nust causes war. second of all I want to know more about your work.&lt;/DIV&gt;&lt;/D=\r\nIV&gt;\n&lt;DIV style=3D&quot;FONT-SIZE: 12pt; FONT-FAMILY: times new roman, new york, =\r\ntimes, serif&quot;&gt;&lt;BR&gt;\n&lt;DIV style=3D&quot;PADDING-LEFT: 5px; FONT-SIZE: 12pt; MARGIN=\r\n: 5px 0px 5px 5px; BORDER-LEFT: #1010ff 2px solid; FONT-FAMILY: times new r=\r\noman, new york, times, serif&quot;&gt;&lt;FONT face=3DTahoma size=3D2&gt;\n&lt;HR SIZE=3D1&gt;\n&lt;=\r\nB&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: bold&quot;&gt;From:&lt;/SPAN&gt;&lt;/B&gt; Frank Sumption &lt;pur=\r\nplealiengirl@...&gt;&lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: bold&quot;&gt;To:&lt;/SPA=\r\nN&gt;&lt;/B&gt; EVP-ITC@yahoogroups.com&lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: bold&quot;&gt;Sent=\r\n:&lt;/SPAN&gt;&lt;/B&gt; Friday, 5 June, 2009 16:25:28&lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT=\r\n: bold&quot;&gt;Subject:&lt;/SPAN&gt;&lt;/B&gt; Re: [EVP-ITC] Re: [RTSC] a copy of my final e-m=\r\nail to Frank sumption I will go no further!&lt;BR&gt;&lt;/FONT&gt;&lt;BR&gt;\n&lt;DIV id=3Dygrp-t=\r\next&gt;\n&lt;P&gt;\n&lt;DIV&gt;&nbsp;Arrogant!? Lets see,&nbsp;I don&#39;t do shows, I&#39;m not on =\r\npodcast every friggin&#39; day proclaiming my expertness, I don&#39;t charge money-=\r\nfor anything, I share all information and schematics, and I do not kiss any=\r\none&#39;s ass, guess that must be so egotistical of me.&nbsp; Arrogant!?, who i=\r\ns&nbsp;the f--- is the duffus out there with the high priest mentality?&nbs=\r\np; The really sad part is trhe brain dead dorks that follow these clowns. H=\r\naliday proclaimed himself box expert extraordinaire, and there&#39;s those sorr=\r\ny twits that eat up everyword. There are no box/paranormal experts, no one =\r\nknows how this shit works. Go to church if you want a religious experience!=\r\n&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;Anyway, there is one advantage to using=\r\n tape, the entities seem capable of changing the messages as needed. I can =\r\nuse the same recording over an over, and I swear, I get meaningful, having =\r\nto do with the moment on every listening. Brain matrixing--perhaps- -or doe=\r\ns it really change? I can&#39;t tell. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;Frank=\r\n-S&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;BR&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV class=3Dgmail_quo=\r\nte&gt;On Fri, Jun 5, 2009 at 3:58 AM, eamonn mgherbi &lt;SPAN dir=3Dltr&gt;&lt;&lt;A hr=\r\nef=3D&quot;mailto:eamonnmgherbi@...&quot; target=3D_blank rel=3Dnofollow ymai=\r\nlto=3D&quot;mailto:eamonnmgherbi@...&quot;&gt;eamonnmgherbi@ yahoo.co. uk&lt;/A&gt;&gt=\r\n;&lt;/SPAN&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE class=3Dgmail_quote style=3D&quot;BORDER-LEFT: #=\r\nccc 1px solid&quot;&gt;\n&lt;DIV style=3D&quot;BACKGROUND-COLOR: #ffffff&quot;&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;=\r\n&lt;BR&gt;&lt;BR&gt;\n&lt;P&gt;\n&lt;DIV style=3D&quot;FONT-SIZE: 12pt; FONT-FAMILY: times new roman, n=\r\new york, times, serif&quot;&gt;\n&lt;DIV&gt;Hi All&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I have to =\r\nadmit that I share the same opinion as Bruce. I dont what everyones take is=\r\n on this but I felt that some of moon and even Franks attitude was slightly=\r\n arrogant. I am a researcher in the UK using old reel to reel methods and o=\r\nbtaining excellent results. I lost some family and some close friends&nbsp;=\r\n5 yeara ago&nbsp;and suddenly it dawned on me...what is life all about. I w=\r\nent on to research every evp pioneer i could, listen to hours/days of recor=\r\ndings and it changed my outlook on life. tears were turned to smiles and th=\r\nen I realised what all this research is for. it was a big step for me spiri=\r\ntually. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I dont know if there is anyone else o=\r\nn here using old fashioned methods but if anybody would like to hear record=\r\nings please ask. I am using a reel to reel sony &quot;Hi frequency&quot; recorder and=\r\n trying various types of tones, backgrounds e.t.c.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n=\r\n&lt;DIV&gt;Good luck to everyone with their research, you are right we are changi=\r\nng history we are discovering new things. if it wasnt for individuals such =\r\nas raudive, jurghenson to name a few, maybe we wouldnt have discovered this=\r\n. it takes a brave individual to tackle an arrogant human race blunted with=\r\n science.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Kind Regards&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;=\r\n\n&lt;DIV&gt;The quiet one :-)&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV style=3D&quot;FONT-SIZE: 12pt; FONT-FAMIL=\r\nY: times new roman, new york, times, serif&quot;&gt;&lt;BR&gt;\n&lt;DIV style=3D&quot;FONT-SIZE: 1=\r\n2pt; BORDER-LEFT: #1010ff 2px solid; FONT-FAMILY: times new roman, new york=\r\n, times, serif&quot;&gt;&lt;FONT face=3DTahoma size=3D2&gt;\n&lt;HR SIZE=3D1&gt;\n&lt;B&gt;&lt;SPAN style=\r\n=3D&quot;FONT-WEIGHT: bold&quot;&gt;From:&lt;/SPAN&gt;&lt;/B&gt; &quot;&lt;A href=3D&quot;mailto:SnowfireL@...=\r\nm&quot; target=3D_blank rel=3Dnofollow ymailto=3D&quot;mailto:SnowfireL@...&quot;&gt;Snow=\r\nfireL@aol. com&lt;/A&gt;&quot; &lt;&lt;A href=3D&quot;mailto:SnowfireL@...&quot; target=3D_blan=\r\nk rel=3Dnofollow ymailto=3D&quot;mailto:SnowfireL@...&quot;&gt;SnowfireL@aol. com&lt;/A=\r\n&gt;&gt;&lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: bold&quot;&gt;To:&lt;/SPAN&gt;&lt;/B&gt; &lt;A href=3D&quot;mai=\r\nlto:RTSC@yahoogroups.com&quot; target=3D_blank rel=3Dnofollow ymailto=3D&quot;mailto:=\r\nRTSC@yahoogroups.com&quot;&gt;RTSC@yahoogroups. com&lt;/A&gt;; &lt;A href=3D&quot;mailto:inside_t=\r\nhe_box_rtsc_talk_radio@yahoogroups.com&quot; target=3D_blank rel=3Dnofollow ymai=\r\nlto=3D&quot;mailto:inside_the_box_rtsc_talk_radio@yahoogroups.com&quot;&gt;inside_the_bo=\r\nx_ rtsc_talk_ radio@yahoogroup s.com&lt;/A&gt;; &lt;A href=3D&quot;mailto:EVP-ITC@yahoogr=\r\noups.com&quot; target=3D_blank rel=3Dnofollow ymailto=3D&quot;mailto:EVP-ITC@yahoogro=\r\nups.com&quot;&gt;EVP-ITC@yahoogroups .com&lt;/A&gt;&lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: bol=\r\nd&quot;&gt;Sent:&lt;/SPAN&gt;&lt;/B&gt; Thursday, 4 June, 2009 20:25:26&lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FO=\r\nNT-WEIGHT:\n bold&quot;&gt;Subject:&lt;/SPAN&gt;&lt;/B&gt; [EVP-ITC] Re: [RTSC] a copy of my fin=\r\nal e-mail to Frank sumption I will go no further!&lt;BR&gt;&lt;/FONT&gt;\n&lt;DIV&gt;&lt;BR&gt;\n&lt;DIV=\r\n&gt;\n&lt;P&gt;&lt;FONT face=3DArial color=3D#000000 size=3D2&gt;\n&lt;DIV&gt;&lt;STRONG&gt;&lt;FONT color=\r\n=3D#0000ff&gt;Sorry to hear this Bruce, I&nbsp;sure hope things get better, &n=\r\nbsp;I had no idea there were so many problems when I joined all these lists=\r\n, &nbsp;I think you are all great people, you folks together are making his=\r\ntory don&#39;t you all realize this?&nbsp; There are so many people out there t=\r\nhat have never heard of this type of communication, thousands out there!&nb=\r\nsp; My friend just lost her mother a couple of weeks ago, when I told her a=\r\nbout the work you all are doing, tears were replaced with a smile, she is l=\r\nooking forward to hearing from her mom now too.&nbsp; Stop trying to hurt e=\r\nach other, it&#39;s not worth it, life is too short for this stuff.&nbsp; You a=\r\nre all great people, May God Bless You All&nbsp;~ And He Already Has,&lt;/FONT=\r\n&gt;&lt;/STRONG&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;STRONG&gt;&lt;FONT color=3D#0000ff&gt;sf&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/DIV=\r\n&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;In a message dated 6/4/2009 2:27:06 P.M. Eas=\r\ntern Daylight Time, balllan94@yahoo. com writes:&lt;/DIV&gt;\n&lt;BLOCKQUOTE style=3D=\r\n&quot;BORDER-LEFT: blue 2px solid&quot;&gt;&lt;FONT style=3D&quot;BACKGROUND-COLOR: transparent&quot;=\r\n face=3DArial color=3D#000000 size=3D2&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;P&gt;guys,&lt;=\r\nBR&gt;&lt;BR&gt;Sorry to burden you with this nonsense but this group and the RTSC g=\r\nroup are my only venues to respond to posts on other groups and have my acc=\r\nount heard, I hope you do not mind to much.&lt;BR&gt;&lt;BR&gt;Here is a copy of my fin=\r\nal personal e-mail to Frank Sumption which by the way is meant for him but =\r\nhe see&#39;s fit to post them publicly in an attempt to discredit me.&lt;BR&gt;&lt;BR&gt;I =\r\nwant you to read it first hand so there are no chance of it being altered b=\r\nefore it is posted else where.&lt;BR&gt;&lt;BR&gt;I will not address Frank again&lt;BR&gt;---=\r\n--------- --------- --------- --------- --------- --------- -&lt;BR&gt;&lt;BR&gt;Frank,=\r\n&lt;BR&gt;&lt;BR&gt;This is getting ridiculous now, you should stop writing these posts=\r\n, all you are doing is making yourself look ridiculous.&lt;BR&gt;&lt;BR&gt;I have offer=\r\ned many times to make my raw recordings available for review by anyone who =\r\nwants them. I have made the same challenge to your friend moon who we all k=\r\nnow is behind this tirade he has time and again refused or\n ignored the req=\r\nuest for any type of audio file&lt;BR&gt;to be publicly posted for revue and cont=\r\ninues to take advantage of innocent unsuspecting people with his con game a=\r\nnd charging large amounts of money for sessions where he fabricates and mak=\r\nes up content as he goes along.&lt;BR&gt;&lt;BR&gt;I was the only one to confront him i=\r\nn public and expose him for the fake he is and this is his feeble attempt a=\r\nt retaliation. I and other researchers like me have brought this research l=\r\night years from where it was when you and I first met, moon just continues =\r\nto use it to rip people off and has not contributed a thing to the research=\r\n of ghost box communication beside lining his own pockets. &lt;BR&gt;&lt;BR&gt;Just the=\r\n fact that he has you doing his dirty work shows the type of guy he is. I c=\r\nan remember a time when you publicly came out against any type of money mak=\r\ning using your boxes and even refused moon when he wanted to manufacture an=\r\nd sell them for large profits yet now you condone\n his robbery of innocent =\r\nunaware people and actually act foolish on his behest.&lt;BR&gt;&lt;BR&gt;Frank you are=\r\n better than this, just concentrate on developing a better box and forget a=\r\nbout moon and his tricks and lies, he is finished in the paranormal and he =\r\nknows it, everyone is wise to his game and he is practically an outcast.&lt;BR=\r\n&gt;&lt;BR&gt;Frank you are hitching you wagon to a dead horse. Get away from these =\r\nbad influences before they ruin your reputation as well.&lt;BR&gt;&lt;BR&gt;We have had=\r\n this moon discussion in the past and once he has exhausted his need for yo=\r\nu he will screw you again like he has done so many times before.&lt;BR&gt;&lt;BR&gt;Fra=\r\nnk, I like and respect you and I hope you will consider what I have said in=\r\n this e-mail and I sincerely hope you post this one on the evp-itc group. I=\r\n will be posting it on my group and others I belong to.&lt;BR&gt;&lt;BR&gt;Your former =\r\nfriend&lt;BR&gt;Bruce&lt;BR&gt;&lt;BR&gt;&lt;/P&gt;&lt;/DIV&gt;\n&lt;DIV style=3D&quot;COLOR: white&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;=\r\n/DIV&gt;&lt;/FONT&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;/FONT&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;FONT style=3D&quot;FONT: 10pt a=\r\nrial, san-serif; COLOR: black&quot;&gt;\n&lt;HR&gt;\n&lt;A href=3D&quot;http://pr.atwola.com/promoc=\r\nlk/100126575x1221354145x1201369495/aol?redir=3Dhttp:%2F%2Fad.doubleclick.ne=\r\nt%2Fclk%3B215221161%3B37268813%3By&quot; target=3D_blank rel=3Dnofollow&gt;Limited =\r\nTime Offers: Save big on popular laptops at Dell&lt;/A&gt;&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;P&gt;&lt;/P&gt;\n&lt;=\r\nP&gt;&lt;/P&gt;\n&lt;P&gt;&lt;/P&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;BR&gt;\n&lt;P&gt;&lt;/P&gt;\n&lt;P&gt;&lt;/P&gt;\n&lt;P&gt;&lt;/P&gt;&lt;/D=\r\nIV&gt;\n&lt;DIV style=3D&quot;COLOR: white&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;=\r\n&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/div&gt;&lt;br&gt;\n\n\n\n      &lt;/body&gt;&lt;/html&gt;\r\n--0-1429035386-1244217176=:74847--"}