{"id": "14860", "subject": "Re: [EVP-ITC] Re: [RTSC] a copy of my final e-mail to Frank sumption I will go no further!", "author": "eamonn mgherbi", "timestamp": "2009-06-05T09:58:05Z", "full_text": "--0-1038683214-1244195885=:38234\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nHi All\n\nI have to admit that I share the same opinion as Bruce. I dont what=\r\n everyones take is on this but I felt that some of moon and even Franks att=\r\nitude was slightly arrogant. I am a researcher in the UK using old reel to =\r\nreel methods and obtaining excellent results. I lost some family and some c=\r\nlose friends=A05 yeara ago=A0and suddenly it dawned on me...what is life al=\r\nl about. I went on to research every evp pioneer i could, listen to hours/d=\r\nays of recordings and it changed my outlook on life. tears were turned to s=\r\nmiles and then I realised what all this research is for. it was a big step =\r\nfor me spiritually. \n\nI dont know if there is anyone else on here using old=\r\n fashioned methods but if anybody would like to hear recordings please ask.=\r\n I am using a reel to reel sony &quot;Hi frequency&quot; recorder and trying various =\r\ntypes of tones, backgrounds e.t.c.\n\nGood luck to everyone with their resear=\r\nch, you are right we are changing history we are discovering new things. if=\r\n it wasnt for individuals such as raudive, jurghenson to name a few, maybe =\r\nwe wouldnt have discovered this. it takes a brave individual to tackle an a=\r\nrrogant human race blunted with science.\n\nKind Regards\n\nThe quiet one :-)\n\n=\r\n\n\n\n________________________________\nFrom: &quot;SnowfireL@...&quot; &lt;SnowfireL@ao=\r\nl.com&gt;\nTo: RTSC@yahoogroups.com; inside_the_box_rtsc_talk_radio@yahoogroups=\r\n.com; EVP-ITC@yahoogroups.com\nSent: Thursday, 4 June, 2009 20:25:26\nSubject=\r\n: [EVP-ITC] Re: [RTSC] a copy of my final e-mail to Frank sumption I will g=\r\no no further!\n\n\n\n\n\n\n\n________________________________\nLimited Time Offers: =\r\nSave big on popular laptops at Dell\nSorry to hear this Bruce, I=A0sure hope=\r\n things get better, =A0I had no idea there were so many problems when I joi=\r\nned all these lists, =A0I think you are all great people, you folks togethe=\r\nr are making history don&#39;t you all realize this?=A0 There are so many peopl=\r\ne out there that have never heard of this type of communication, thousands =\r\nout there!=A0 My friend just lost her mother a couple of weeks ago, when I =\r\ntold her about the work you all are doing, tears were replaced with a smile=\r\n, she is looking forward to hearing from her mom now too.=A0 Stop trying to=\r\n hurt each other, it&#39;s not worth it, life is too short for this stuff.=A0 Y=\r\nou are all great people, May God Bless You All=A0~ And He Already Has,\nsf\n\n=\r\nIn a message dated 6/4/2009 2:27:06 P.M. Eastern Daylight Time, balllan94@y=\r\nahoo. com writes:\n\n\n\nguys,\n\nSorry to burden you with this nonsense but this=\r\n group and the RTSC group are my only venues to respond to posts on other g=\r\nroups and have my account heard, I hope you do not mind to much.\n\nHere is a=\r\n copy of my final personal e-mail to Frank Sumption which by the way is mea=\r\nnt for him but he see&#39;s fit to post them publicly in an attempt to discredi=\r\nt me.\n\nI want you to read it first hand so there are no chance of it being =\r\naltered before it is posted else where.\n\nI will not address Frank again\n---=\r\n--------- --------- --------- --------- --------- --------- -\n\nFrank,\n\nThis=\r\n is getting ridiculous now, you should stop writing these posts, all you ar=\r\ne doing is making yourself look ridiculous.\n\nI have offered many times to m=\r\nake my raw recordings available for review by anyone who wants them. I have=\r\n made the same challenge to your friend moon who we all know is behind this=\r\n tirade he has time and again refused or ignored the request for any type o=\r\nf audio file\nto be publicly posted for revue and continues to take advantag=\r\ne of innocent unsuspecting people with his con game and charging large amou=\r\nnts of money for sessions where he fabricates and makes up content as he go=\r\nes along.\n\nI was the only one to confront him in public and expose him for =\r\nthe fake he is and this is his feeble attempt at retaliation. I and other r=\r\nesearchers like me have brought this research light years from where it was=\r\n when you and I first met, moon just continues to use it to rip people off =\r\nand has not contributed a thing to the research of ghost box communication =\r\nbeside lining his own pockets. \n\nJust the fact that he has you doing his di=\r\nrty work shows the type of guy he is. I can remember a time when you public=\r\nly came out against any type of money making using your boxes and even refu=\r\nsed moon when he wanted to manufacture and sell them for large profits yet =\r\nnow you condone his robbery of innocent unaware people and actually act foo=\r\nlish on his behest.\n\nFrank you are better than this, just concentrate on de=\r\nveloping a better box and forget about moon and his tricks and lies, he is =\r\nfinished in the paranormal and he knows it, everyone is wise to his game an=\r\nd he is practically an outcast.\n\nFrank you are hitching you wagon to a dead=\r\n horse. Get away from these bad influences before they ruin your reputation=\r\n as well.\n\nWe have had this moon discussion in the past and once he has exh=\r\nausted his need for you he will screw you again like he has done so many ti=\r\nmes before.\n\nFrank, I like and respect you and I hope you will consider wha=\r\nt I have said in this e-mail and I sincerely hope you post this one on the =\r\nevp-itc group. I will be posting it on my group and others I belong to.\n\nYo=\r\nur former friend\nBruce\n\n\n\n\n\n      \r\n--0-1038683214-1244195885=:38234\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;&lt;head&gt;&lt;style type=3D&quot;text/css&quot;&gt;&lt;!-- DIV {margin:0px;} --&gt;&lt;/style&gt;&lt;/he=\r\nad&gt;&lt;body&gt;&lt;div style=3D&quot;font-family:times new roman, new york, times, serif;=\r\nfont-size:12pt&quot;&gt;&lt;DIV&gt;Hi All&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I have to admit th=\r\nat I share the same opinion as Bruce. I dont what everyones take is on this=\r\n but I felt that some of moon and even Franks attitude was slightly arrogan=\r\nt. I am a researcher in the UK using old reel to reel methods and obtaining=\r\n excellent results. I lost some family and some close friends&nbsp;5 yeara =\r\nago&nbsp;and suddenly it dawned on me...what is life all about. I went on t=\r\no research every evp pioneer i could, listen to hours/days of recordings an=\r\nd it changed my outlook on life. tears were turned to smiles and then I rea=\r\nlised what all this research is for. it was a big step for me spiritually. =\r\n&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I dont know if there is anyone else on here u=\r\nsing old fashioned methods but if anybody would like to hear recordings ple=\r\nase ask. I am using a reel to reel sony &quot;Hi frequency&quot; recorder and trying =\r\nvarious types of tones, backgrounds e.t.c.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Goo=\r\nd luck to everyone with their research, you are right we are changing histo=\r\nry we are discovering new things. if it wasnt for individuals such as raudi=\r\nve, jurghenson to name a few, maybe we wouldnt have discovered this. it tak=\r\nes a brave individual to tackle an arrogant human race blunted with science=\r\n.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Kind Regards&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Th=\r\ne quiet one :-)&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV style=3D&quot;FONT-SIZE: 12pt; FONT-FAMILY: times=\r\n new roman, new york, times, serif&quot;&gt;&lt;BR&gt;\n&lt;DIV style=3D&quot;PADDING-LEFT: 5px; F=\r\nONT-SIZE: 12pt; MARGIN: 5px 0px 5px 5px; BORDER-LEFT: #1010ff 2px solid; FO=\r\nNT-FAMILY: times new roman, new york, times, serif&quot;&gt;&lt;FONT face=3DTahoma siz=\r\ne=3D2&gt;\n&lt;HR SIZE=3D1&gt;\n&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: bold&quot;&gt;From:&lt;/SPAN&gt;&lt;/B&gt; =\r\n&quot;SnowfireL@...&quot; &lt;SnowfireL@...&gt;&lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEI=\r\nGHT: bold&quot;&gt;To:&lt;/SPAN&gt;&lt;/B&gt; RTSC@yahoogroups.com; inside_the_box_rtsc_talk_ra=\r\ndio@yahoogroups.com; EVP-ITC@yahoogroups.com&lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIG=\r\nHT: bold&quot;&gt;Sent:&lt;/SPAN&gt;&lt;/B&gt; Thursday, 4 June, 2009 20:25:26&lt;BR&gt;&lt;B&gt;&lt;SPAN styl=\r\ne=3D&quot;FONT-WEIGHT: bold&quot;&gt;Subject:&lt;/SPAN&gt;&lt;/B&gt; [EVP-ITC] Re: [RTSC] a copy of =\r\nmy final e-mail to Frank sumption I will go no further!&lt;BR&gt;&lt;/FONT&gt;&lt;BR&gt;\n&lt;DIV=\r\n id=3Dygrp-text&gt;\n&lt;P&gt;&lt;FONT id=3Drole_document face=3DArial color=3D#000000 s=\r\nize=3D2&gt;\n&lt;DIV&gt;&lt;STRONG&gt;&lt;FONT color=3D#0000ff&gt;Sorry to hear this Bruce, I&nbs=\r\np;sure hope things get better, &nbsp;I had no idea there were so many probl=\r\nems when I joined all these lists, &nbsp;I think you are all great people, =\r\nyou folks together are making history don&#39;t you all realize this?&nbsp; The=\r\nre are so many people out there that have never heard of this type of commu=\r\nnication, thousands out there!&nbsp; My friend just lost her mother a coupl=\r\ne of weeks ago, when I told her about the work you all are doing, tears wer=\r\ne replaced with a smile, she is looking forward to hearing from her mom now=\r\n too.&nbsp; Stop trying to hurt each other, it&#39;s not worth it, life is too =\r\nshort for this stuff.&nbsp; You are all great people, May God Bless You All=\r\n&nbsp;~ And He Already Has,&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;STRONG&gt;&lt;FONT color=\r\n=3D#0000ff&gt;sf&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;In a messa=\r\nge dated 6/4/2009 2:27:06 P.M. Eastern Daylight Time, balllan94@yahoo. com =\r\nwrites:&lt;/DIV&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: blue 2px solid&quot;&gt;&lt;FONT style=\r\n=3D&quot;BACKGROUND-COLOR: transparent&quot; face=3DArial color=3D#000000 size=3D2&gt;\n&lt;=\r\nDIV id=3Dygrp-mlmsg&gt;\n&lt;DIV id=3Dygrp-msg&gt;\n&lt;DIV id=3Dygrp-text&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;P&gt;gu=\r\nys,&lt;BR&gt;&lt;BR&gt;Sorry to burden you with this nonsense but this group and the RT=\r\nSC group are my only venues to respond to posts on other groups and have my=\r\n account heard, I hope you do not mind to much.&lt;BR&gt;&lt;BR&gt;Here is a copy of my=\r\n final personal e-mail to Frank Sumption which by the way is meant for him =\r\nbut he see&#39;s fit to post them publicly in an attempt to discredit me.&lt;BR&gt;&lt;B=\r\nR&gt;I want you to read it first hand so there are no chance of it being alter=\r\ned before it is posted else where.&lt;BR&gt;&lt;BR&gt;I will not address Frank again&lt;BR=\r\n&gt;------------ --------- --------- --------- --------- --------- -&lt;BR&gt;&lt;BR&gt;Fr=\r\nank,&lt;BR&gt;&lt;BR&gt;This is getting ridiculous now, you should stop writing these p=\r\nosts, all you are doing is making yourself look ridiculous.&lt;BR&gt;&lt;BR&gt;I have o=\r\nffered many times to make my raw recordings available for review by anyone =\r\nwho wants them. I have made the same challenge to your friend moon who we a=\r\nll know is behind this tirade he has time and again refused or\n ignored the=\r\n request for any type of audio file&lt;BR&gt;to be publicly posted for revue and =\r\ncontinues to take advantage of innocent unsuspecting people with his con ga=\r\nme and charging large amounts of money for sessions where he fabricates and=\r\n makes up content as he goes along.&lt;BR&gt;&lt;BR&gt;I was the only one to confront h=\r\nim in public and expose him for the fake he is and this is his feeble attem=\r\npt at retaliation. I and other researchers like me have brought this resear=\r\nch light years from where it was when you and I first met, moon just contin=\r\nues to use it to rip people off and has not contributed a thing to the rese=\r\narch of ghost box communication beside lining his own pockets. &lt;BR&gt;&lt;BR&gt;Just=\r\n the fact that he has you doing his dirty work shows the type of guy he is.=\r\n I can remember a time when you publicly came out against any type of money=\r\n making using your boxes and even refused moon when he wanted to manufactur=\r\ne and sell them for large profits yet now you condone\n his robbery of innoc=\r\nent unaware people and actually act foolish on his behest.&lt;BR&gt;&lt;BR&gt;Frank you=\r\n are better than this, just concentrate on developing a better box and forg=\r\net about moon and his tricks and lies, he is finished in the paranormal and=\r\n he knows it, everyone is wise to his game and he is practically an outcast=\r\n.&lt;BR&gt;&lt;BR&gt;Frank you are hitching you wagon to a dead horse. Get away from th=\r\nese bad influences before they ruin your reputation as well.&lt;BR&gt;&lt;BR&gt;We have=\r\n had this moon discussion in the past and once he has exhausted his need fo=\r\nr you he will screw you again like he has done so many times before.&lt;BR&gt;&lt;BR=\r\n&gt;Frank, I like and respect you and I hope you will consider what I have sai=\r\nd in this e-mail and I sincerely hope you post this one on the evp-itc grou=\r\np. I will be posting it on my group and others I belong to.&lt;BR&gt;&lt;BR&gt;Your for=\r\nmer friend&lt;BR&gt;Bruce&lt;BR&gt;&lt;BR&gt;&lt;/P&gt;&lt;/DIV&gt;\n&lt;DIV style=3D&quot;COLOR: white&quot;&gt;&lt;/DIV&gt;&lt;/D=\r\nIV&gt;&lt;/DIV&gt;&lt;/FONT&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;/FONT&gt;\n&lt;DIV class=3Daol_ad_footer id=3D=\r\nfdbdfb0212a0cb1d2fbbd13ae8750157&gt;&lt;BR&gt;&lt;FONT style=3D&quot;FONT: 10pt arial, san-s=\r\nerif; COLOR: black&quot;&gt;\n&lt;HR&gt;\n&lt;A href=3D&quot;http://pr.atwola.com/promoclk/10012657=\r\n5x1221354145x1201369495/aol?redir=3Dhttp:%2F%2Fad.doubleclick.net%2Fclk%3B2=\r\n15221161%3B37268813%3By&quot; target=3D_blank rel=3Dnofollow&gt;Limited Time Offers=\r\n: Save big on popular laptops at Dell&lt;/A&gt;&lt;/FONT&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/d=\r\niv&gt;&lt;br&gt;\n\n\n\n      &lt;/body&gt;&lt;/html&gt;\r\n--0-1038683214-1244195885=:38234--"}