{"id": "14864", "subject": "Re: [EVP-ITC] Re: [RTSC] a copy of my final e-mail to Frank sumption I will go no further!", "author": "Frank Ratka", "timestamp": "2009-06-05T15:42:54Z", "full_text": "--0-306904110-1244216574=:23263\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nArrogant!? Sumption? You have a warped view of Sumption if you see arroganc=\r\ne. He is in your face and speaks his mind but he has never claimed to be an=\r\nything other than &quot;the box&quot; creator. Does he talk shit about people who cla=\r\nim to be experts? Hell yeah! That&#39;s one of the reason we like him. \n=A0\nReg=\r\nards,\n=A0\nFrank R.\n=A0\n=A0\n\n--- On Fri, 6/5/09, eamonn mgherbi &lt;eamonnmgher=\r\nbi@...&gt; wrote:\n\n\nFrom: eamonn mgherbi &lt;eamonnmgherbi@...&gt;\nS=\r\nubject: Re: [EVP-ITC] Re: [RTSC] a copy of my final e-mail to Frank sumptio=\r\nn I will go no further!\nTo: EVP-ITC@yahoogroups.com\nDate: Friday, June 5, 2=\r\n009, 4:58 AM\n\n\n\n\n\n\n\n\n\n\nHi All\n=A0\nI have to admit that I share the same opi=\r\nnion as Bruce. I dont what everyones take is on this but I felt that some o=\r\nf moon and even Franks attitude was slightly arrogant. I am a researcher in=\r\n the UK using old reel to reel methods and obtaining excellent results. I l=\r\nost some family and some close friends=A05 yeara ago=A0and suddenly it dawn=\r\ned on me...what is life all about. I went on to research every evp pioneer =\r\ni could, listen to hours/days of recordings and it changed my outlook on li=\r\nfe. tears were turned to smiles and then I realised what all this research =\r\nis for. it was a big step for me spiritually. \n=A0\nI dont know if there is =\r\nanyone else on here using old fashioned methods but if anybody would like t=\r\no hear recordings please ask. I am using a reel to reel sony &quot;Hi frequency&quot;=\r\n recorder and trying various types of tones, backgrounds e.t.c.\n=A0\nGood lu=\r\nck to everyone with their research, you are right we are changing history w=\r\ne are discovering new things. if it wasnt for individuals such as raudive, =\r\njurghenson to name a few, maybe we wouldnt have discovered this. it takes a=\r\n brave individual to tackle an arrogant human race blunted with science.\n=\r\n=A0\nKind Regards\n=A0\nThe quiet one :-)\n\n\n\n\n\nFrom: &quot;SnowfireL@aol. com&quot; &lt;Sno=\r\nwfireL@aol. com&gt;\nTo: RTSC@yahoogroups. com; inside_the_box_ rtsc_talk_ radi=\r\no@yahoogroup s.com; EVP-ITC@yahoogroups .com\nSent: Thursday, 4 June, 2009 2=\r\n0:25:26\nSubject: [EVP-ITC] Re: [RTSC] a copy of my final e-mail to Frank su=\r\nmption I will go no further!\n\n\n\n\nSorry to hear this Bruce, I=A0sure hope th=\r\nings get better, =A0I had no idea there were so many problems when I joined=\r\n all these lists, =A0I think you are all great people, you folks together a=\r\nre making history don&#39;t you all realize this?=A0 There are so many people o=\r\nut there that have never heard of this type of communication, thousands out=\r\n there!=A0 My friend just lost her mother a couple of weeks ago, when I tol=\r\nd her about the work you all are doing, tears were replaced with a smile, s=\r\nhe is looking forward to hearing from her mom now too.=A0 Stop trying to hu=\r\nrt each other, it&#39;s not worth it, life is too short for this stuff.=A0 You =\r\nare all great people, May God Bless You All=A0~ And He Already Has,\nsf\n=A0\n=\r\n\nIn a message dated 6/4/2009 2:27:06 P.M. Eastern Daylight Time, balllan94@=\r\nyahoo. com writes:\n\n\n\n\n\n\nguys,\n\nSorry to burden you with this nonsense but =\r\nthis group and the RTSC group are my only venues to respond to posts on oth=\r\ner groups and have my account heard, I hope you do not mind to much.\n\nHere =\r\nis a copy of my final personal e-mail to Frank Sumption which by the way is=\r\n meant for him but he see&#39;s fit to post them publicly in an attempt to disc=\r\nredit me.\n\nI want you to read it first hand so there are no chance of it be=\r\ning altered before it is posted else where.\n\nI will not address Frank again=\r\n\n------------ --------- --------- --------- --------- --------- -\n\nFrank,\n\n=\r\nThis is getting ridiculous now, you should stop writing these posts, all yo=\r\nu are doing is making yourself look ridiculous.\n\nI have offered many times =\r\nto make my raw recordings available for review by anyone who wants them. I =\r\nhave made the same challenge to your friend moon who we all know is behind =\r\nthis tirade he has time and again refused or ignored the request for any ty=\r\npe of audio file\nto be publicly posted for revue and continues to take adva=\r\nntage of innocent unsuspecting people with his con game and charging large =\r\namounts of money for sessions where he fabricates and makes up content as h=\r\ne goes along.\n\nI was the only one to confront him in public and expose him =\r\nfor the fake he is and this is his feeble attempt at retaliation. I and oth=\r\ner researchers like me have brought this research light years from where it=\r\n was when you and I first met, moon just continues to use it to rip people =\r\noff and has not contributed a thing to the research of ghost box communicat=\r\nion beside lining his own pockets. \n\nJust the fact that he has you doing hi=\r\ns dirty work shows the type of guy he is. I can remember a time when you pu=\r\nblicly came out against any type of money making using your boxes and even =\r\nrefused moon when he wanted to manufacture and sell them for large profits =\r\nyet now you condone his robbery of innocent unaware people and actually act=\r\n foolish on his behest.\n\nFrank you are better than this, just concentrate o=\r\nn developing a better box and forget about moon and his tricks and lies, he=\r\n is finished in the paranormal and he knows it, everyone is wise to his gam=\r\ne and he is practically an outcast.\n\nFrank you are hitching you wagon to a =\r\ndead horse. Get away from these bad influences before they ruin your reputa=\r\ntion as well.\n\nWe have had this moon discussion in the past and once he has=\r\n exhausted his need for you he will screw you again like he has done so man=\r\ny times before.\n\nFrank, I like and respect you and I hope you will consider=\r\n what I have said in this e-mail and I sincerely hope you post this one on =\r\nthe evp-itc group. I will be posting it on my group and others I belong to.=\r\n\n\nYour former friend\nBruce\n\n\n\n\n\n\nLimited Time Offers: Save big on popular l=\r\naptops at Dell\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n      \r\n--0-306904110-1244216574=:23263\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;DIV&gt;Arrogant!? Sumption? You have a warped v=\r\niew of Sumption if you see arrogance. He is in your face and speaks his min=\r\nd but he has never claimed to be anything other than &quot;the box&quot; creator. Doe=\r\ns he talk shit about people who claim to be experts? Hell yeah! That&#39;s one =\r\nof the reason we like him. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Regards,&lt;/DIV&gt;\n&lt;DI=\r\nV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Frank R.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV=\r\n&gt;&lt;BR&gt;--- On &lt;B&gt;Fri, 6/5/09, eamonn mgherbi &lt;I&gt;&lt;eamonnmgherbi@...=\r\n&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;&lt;/DIV&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: rgb(16,16,2=\r\n55) 2px solid; PADDING-LEFT: 5px; MARGIN-LEFT: 5px&quot;&gt;&lt;BR&gt;From: eamonn mgherb=\r\ni &lt;eamonnmgherbi@...&gt;&lt;BR&gt;Subject: Re: [EVP-ITC] Re: [RTSC] a =\r\ncopy of my final e-mail to Frank sumption I will go no further!&lt;BR&gt;To: EVP-=\r\nITC@yahoogroups.com&lt;BR&gt;Date: Friday, June 5, 2009, 4:58 AM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=\r\n=3Dyiv1950023176&gt;\n&lt;DIV id=3Dygrp-text&gt;\n&lt;DIV&gt;\n&lt;DIV style=3D&quot;FONT-FAMILY: tim=\r\nes new roman, new york, times, serif; FONT-SIZE: 12pt&quot;&gt;\n&lt;DIV&gt;Hi All&lt;/DIV&gt;\n&lt;=\r\nDIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I have to admit that I share the same opinion as Bruc=\r\ne. I dont what everyones take is on this but I felt that some of moon and e=\r\nven Franks attitude was slightly arrogant. I am a researcher in the UK usin=\r\ng old reel to reel methods and obtaining excellent results. I lost some fam=\r\nily and some close friends&nbsp;5 yeara ago&nbsp;and suddenly it dawned on =\r\nme...what is life all about. I went on to research every evp pioneer i coul=\r\nd, listen to hours/days of recordings and it changed my outlook on life. te=\r\nars were turned to smiles and then I realised what all this research is for=\r\n. it was a big step for me spiritually. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I don=\r\nt know if there is anyone else on here using old fashioned methods but if a=\r\nnybody would like to hear recordings please ask. I am using a reel to reel =\r\nsony &quot;Hi frequency&quot; recorder and trying various types of tones, backgrounds=\r\n e.t.c.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Good luck to everyone with their resea=\r\nrch, you are right we are changing history we are discovering new things. i=\r\nf it wasnt for individuals such as raudive, jurghenson to name a few, maybe=\r\n we wouldnt have discovered this. it takes a brave individual to tackle an =\r\narrogant human race blunted with science.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Kind=\r\n Regards&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;The quiet one :-)&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV styl=\r\ne=3D&quot;FONT-FAMILY: times new roman, new york, times, serif; FONT-SIZE: 12pt&quot;=\r\n&gt;&lt;BR&gt;\n&lt;DIV style=3D&quot;BORDER-LEFT: #1010ff 2px solid; FONT-FAMILY: times new =\r\nroman, new york, times, serif; FONT-SIZE: 12pt&quot;&gt;&lt;FONT size=3D2 face=3DTahom=\r\na&gt;\n&lt;HR SIZE=3D1&gt;\n&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: bold&quot;&gt;From:&lt;/SPAN&gt;&lt;/B&gt; &quot;Sno=\r\nwfireL@aol. com&quot; &lt;SnowfireL@aol. com&gt;&lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIGH=\r\nT: bold&quot;&gt;To:&lt;/SPAN&gt;&lt;/B&gt; RTSC@yahoogroups. com; inside_the_box_ rtsc_talk_ r=\r\nadio@yahoogroup s.com; EVP-ITC@yahoogroups .com&lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FONT-W=\r\nEIGHT: bold&quot;&gt;Sent:&lt;/SPAN&gt;&lt;/B&gt; Thursday, 4 June, 2009 20:25:26&lt;BR&gt;&lt;B&gt;&lt;SPAN s=\r\ntyle=3D&quot;FONT-WEIGHT: bold&quot;&gt;Subject:&lt;/SPAN&gt;&lt;/B&gt; [EVP-ITC] Re: [RTSC] a copy =\r\nof my final e-mail to Frank sumption I will go no further!&lt;BR&gt;&lt;/FONT&gt;&lt;BR&gt;\n&lt;=\r\nDIV id=3Dygrp-text&gt;\n&lt;DIV&gt;&lt;FONT id=3Drole_document color=3D#000000 size=3D2 =\r\nface=3DArial&gt;\n&lt;DIV&gt;&lt;STRONG&gt;&lt;FONT color=3D#0000ff&gt;Sorry to hear this Bruce, =\r\nI&nbsp;sure hope things get better, &nbsp;I had no idea there were so many =\r\nproblems when I joined all these lists, &nbsp;I think you are all great peo=\r\nple, you folks together are making history don&#39;t you all realize this?&nbsp=\r\n; There are so many people out there that have never heard of this type of =\r\ncommunication, thousands out there!&nbsp; My friend just lost her mother a =\r\ncouple of weeks ago, when I told her about the work you all are doing, tear=\r\ns were replaced with a smile, she is looking forward to hearing from her mo=\r\nm now too.&nbsp; Stop trying to hurt each other, it&#39;s not worth it, life is=\r\n too short for this stuff.&nbsp; You are all great people, May God Bless Yo=\r\nu All&nbsp;~ And He Already Has,&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;STRONG&gt;&lt;FONT c=\r\nolor=3D#0000ff&gt;sf&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;In a m=\r\nessage dated 6/4/2009 2:27:06 P.M. Eastern Daylight Time, balllan94@yahoo. =\r\ncom writes:&lt;/DIV&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: blue 2px solid&quot;&gt;&lt;FONT s=\r\ntyle=3D&quot;BACKGROUND-COLOR: transparent&quot; color=3D#000000 size=3D2 face=3DAria=\r\nl&gt;\n&lt;DIV id=3Dygrp-mlmsg&gt;\n&lt;DIV id=3Dygrp-msg&gt;\n&lt;DIV id=3Dygrp-text&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;=\r\nDIV&gt;guys,&lt;BR&gt;&lt;BR&gt;Sorry to burden you with this nonsense but this group and =\r\nthe RTSC group are my only venues to respond to posts on other groups and h=\r\nave my account heard, I hope you do not mind to much.&lt;BR&gt;&lt;BR&gt;Here is a copy=\r\n of my final personal e-mail to Frank Sumption which by the way is meant fo=\r\nr him but he see&#39;s fit to post them publicly in an attempt to discredit me.=\r\n&lt;BR&gt;&lt;BR&gt;I want you to read it first hand so there are no chance of it being=\r\n altered before it is posted else where.&lt;BR&gt;&lt;BR&gt;I will not address Frank ag=\r\nain&lt;BR&gt;------------ --------- --------- --------- --------- --------- -&lt;BR&gt;=\r\n&lt;BR&gt;Frank,&lt;BR&gt;&lt;BR&gt;This is getting ridiculous now, you should stop writing t=\r\nhese posts, all you are doing is making yourself look ridiculous.&lt;BR&gt;&lt;BR&gt;I =\r\nhave offered many times to make my raw recordings available for review by a=\r\nnyone who wants them. I have made the same challenge to your friend moon wh=\r\no we all know is behind this tirade he has time and again refused\n or ignor=\r\ned the request for any type of audio file&lt;BR&gt;to be publicly posted for revu=\r\ne and continues to take advantage of innocent unsuspecting people with his =\r\ncon game and charging large amounts of money for sessions where he fabricat=\r\nes and makes up content as he goes along.&lt;BR&gt;&lt;BR&gt;I was the only one to conf=\r\nront him in public and expose him for the fake he is and this is his feeble=\r\n attempt at retaliation. I and other researchers like me have brought this =\r\nresearch light years from where it was when you and I first met, moon just =\r\ncontinues to use it to rip people off and has not contributed a thing to th=\r\ne research of ghost box communication beside lining his own pockets. &lt;BR&gt;&lt;B=\r\nR&gt;Just the fact that he has you doing his dirty work shows the type of guy =\r\nhe is. I can remember a time when you publicly came out against any type of=\r\n money making using your boxes and even refused moon when he wanted to manu=\r\nfacture and sell them for large profits yet now you condone\n his robbery of=\r\n innocent unaware people and actually act foolish on his behest.&lt;BR&gt;&lt;BR&gt;Fra=\r\nnk you are better than this, just concentrate on developing a better box an=\r\nd forget about moon and his tricks and lies, he is finished in the paranorm=\r\nal and he knows it, everyone is wise to his game and he is practically an o=\r\nutcast.&lt;BR&gt;&lt;BR&gt;Frank you are hitching you wagon to a dead horse. Get away f=\r\nrom these bad influences before they ruin your reputation as well.&lt;BR&gt;&lt;BR&gt;W=\r\ne have had this moon discussion in the past and once he has exhausted his n=\r\need for you he will screw you again like he has done so many times before.&lt;=\r\nBR&gt;&lt;BR&gt;Frank, I like and respect you and I hope you will consider what I ha=\r\nve said in this e-mail and I sincerely hope you post this one on the evp-it=\r\nc group. I will be posting it on my group and others I belong to.&lt;BR&gt;&lt;BR&gt;Yo=\r\nur former friend&lt;BR&gt;Bruce&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV style=3D&quot;COLOR: white&quot;&gt;&lt;=\r\n/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/FONT&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;/FONT&gt;\n&lt;DIV id=3Dfdbdfb0212a0cb=\r\n1d2fbbd13ae8750157 class=3Daol_ad_footer&gt;&lt;BR&gt;&lt;FONT style=3D&quot;FONT: 10pt aria=\r\nl, san-serif; COLOR: black&quot;&gt;\n&lt;HR&gt;\n&lt;A href=3D&quot;http://pr.atwola.com/promoclk/=\r\n100126575x1221354145x1201369495/aol?redir=3Dhttp:%2F%2Fad.doubleclick.net%2=\r\nFclk%3B215221161%3B37268813%3By&quot; rel=3Dnofollow target=3D_blank&gt;Limited Tim=\r\ne Offers: Save big on popular laptops at Dell&lt;/A&gt;&lt;/FONT&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;=\r\n/DIV&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n\n\n      \r\n--0-306904110-1244216574=:23263--"}