{"id": "14874", "subject": "Re: [EVP-ITC] Re: [RTSC] a copy of my final e-mail to Frank sumption \tI will go no further!", "author": "Eric VanDuzer", "timestamp": "2009-06-05T16:16:24Z", "full_text": "DAMN ZACK all I can say is ouch.  You weren&#39;t making a box where you\n\n\nOn Fri, Jun 5, 2009 at 12:13 PM, Zack Widup &lt;w9sz.zack@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Cool. Thanks! We all make mistakes. I&#39;ve made some recently although not\n&gt; bad enough to kill me or lose my job. I did drill a hole in my finger.\n&gt; ;-)\n&gt;\n&gt; Zack\n&gt;\n&gt; On Fri, Jun 5, 2009 at 11:06 AM, eamonn mgherbi &lt;eamonnmgherbi@...\n&gt; &gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;  Zack\n&gt;&gt;\n&gt;&gt; Just to clarify\n&gt;&gt;\n&gt;&gt; I have cleared up my first message. Basically I was agreeing with the fact\n&gt;&gt; that Im not a fan of Chris Moon. I didnt mean to say anything about Frank\n&gt;&gt; and reading back on the email I should have reworded.anyway this is my 3rd\n&gt;&gt; post about it :-)\n&gt;&gt;\n&gt;&gt; so just to clear up frank you give good advice and share ideas. I messed\n&gt;&gt; my first message up..hell im human it was an accident\n&gt;&gt;\n&gt;&gt; Kind Regards\n&gt;&gt;\n&gt;&gt; Eamonn\n&gt;&gt;\n&gt;&gt; P.s. keep up the good work ;-)\n&gt;&gt;\n&gt;&gt;  ------------------------------\n&gt;&gt; *From:* Zack Widup &lt;w9sz.zack@gmail.com&gt;\n&gt;&gt; *To:* EVP-ITC@yahoogroups.com\n&gt;&gt; *Sent:* Friday, 5 June, 2009 17:01:17\n&gt;&gt;\n&gt;&gt; *Subject:* [EVP-ITC] Re: [RTSC] a copy of my final e-mail to Frank\n&gt;&gt; sumption I will go no further!\n&gt;&gt;\n&gt;&gt;  I&#39;d agree to that. He shares his research, never charges for anything,\n&gt;&gt; freely admits there are no &quot;experts&quot; in this field (he does not even\n&gt;&gt; consider himself an expert).\n&gt;&gt; I grow more and more concerned about the hatred and viciousness I see from\n&gt;&gt; and among some &quot;paranormal researchers.&quot; It is not everybody by any means,\n&gt;&gt; but it seems to exceed the average amount of this I see in other fields. I\n&gt;&gt; wonder why this is? Is it perhaps in fact because everyone deep down inside\n&gt;&gt; knows there are no experts in this field and those who try to present\n&gt;&gt; themselves as such know deep down inside they are presenting a false image?\n&gt;&gt;\n&gt;&gt; Zack\n&gt;&gt; On Fri, Jun 5, 2009 at 10:42 AM, Frank Ratka &lt;warrior18eii@ yahoo.com&lt;warrior18eii@...&gt;\n&gt;&gt; &gt; wrote:\n&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;    Arrogant!? Sumption? You have a warped view of Sumption if you see\n&gt;&gt;&gt; arrogance. He is in your face and speaks his mind but he has never claimed\n&gt;&gt;&gt; to be anything other than &quot;the box&quot; creator. Does he talk shit about people\n&gt;&gt;&gt; who claim to be experts? Hell yeah! That&#39;s one of the reason we like him.\n&gt;&gt;&gt;\n&gt;&gt;&gt; Regards,\n&gt;&gt;&gt;\n&gt;&gt;&gt; Frank R.\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt; --- On *Fri, 6/5/09, eamonn mgherbi &lt;eamonnmgherbi@ yahoo.co. uk&lt;eamonnmgherbi@...&gt;\n&gt;&gt;&gt; &gt;* wrote:\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt; From: eamonn mgherbi &lt;eamonnmgherbi@ yahoo.co. uk&lt;eamonnmgherbi@...&gt;\n&gt;&gt;&gt; &gt;\n&gt;&gt;&gt; Subject: Re: [EVP-ITC] Re: [RTSC] a copy of my final e-mail to Frank\n&gt;&gt;&gt; sumption I will go no further!\n&gt;&gt;&gt; To: EVP-ITC@yahoogroups .com &lt;EVP-ITC@yahoogroups.com&gt;\n&gt;&gt;&gt; Date: Friday, June 5, 2009, 4:58 AM\n&gt;&gt;&gt;\n&gt;&gt;&gt;    Hi All\n&gt;&gt;&gt;\n&gt;&gt;&gt; I have to admit that I share the same opinion as Bruce. I dont what\n&gt;&gt;&gt; everyones take is on this but I felt that some of moon and even Franks\n&gt;&gt;&gt; attitude was slightly arrogant. I am a researcher in the UK using old reel\n&gt;&gt;&gt; to reel methods and obtaining excellent results. I lost some family and some\n&gt;&gt;&gt; close friends 5 yeara ago and suddenly it dawned on me...what is life all\n&gt;&gt;&gt; about. I went on to research every evp pioneer i could, listen to hours/days\n&gt;&gt;&gt; of recordings and it changed my outlook on life. tears were turned to smiles\n&gt;&gt;&gt; and then I realised what all this research is for. it was a big step for me\n&gt;&gt;&gt; spiritually.\n&gt;&gt;&gt;\n&gt;&gt;&gt; I dont know if there is anyone else on here using old fashioned methods\n&gt;&gt;&gt; but if anybody would like to hear recordings please ask. I am using a reel\n&gt;&gt;&gt; to reel sony &quot;Hi frequency&quot; recorder and trying various types of tones,\n&gt;&gt;&gt; backgrounds e.t.c.\n&gt;&gt;&gt;\n&gt;&gt;&gt; Good luck to everyone with their research, you are right we are changing\n&gt;&gt;&gt; history we are discovering new things. if it wasnt for individuals such as\n&gt;&gt;&gt; raudive, jurghenson to name a few, maybe we wouldnt have discovered this. it\n&gt;&gt;&gt; takes a brave individual to tackle an arrogant human race blunted with\n&gt;&gt;&gt; science.\n&gt;&gt;&gt;\n&gt;&gt;&gt; Kind Regards\n&gt;&gt;&gt;\n&gt;&gt;&gt; The quiet one :-)\n&gt;&gt;&gt;\n&gt;&gt;&gt;  ------------------------------\n&gt;&gt;&gt; *From:* &quot;SnowfireL@aol. com&quot; &lt;SnowfireL@aol. com&gt;\n&gt;&gt;&gt; *To:* RTSC@yahoogroups. com; inside_the_box_ rtsc_talk_ radio@yahoogroup\n&gt;&gt;&gt; s.com; EVP-ITC@yahoogroups .com\n&gt;&gt;&gt;\n&gt;&gt;&gt; *Sent:* Thursday, 4 June, 2009 20:25:26\n&gt;&gt;&gt; *Subject:* [EVP-ITC] Re: [RTSC] a copy of my final e-mail to Frank\n&gt;&gt;&gt; sumption I will go no further!\n&gt;&gt;&gt;\n&gt;&gt;&gt;  *Sorry to hear this Bruce, I sure hope things get better,  I had no\n&gt;&gt;&gt; idea there were so many problems when I joined all these lists,  I think you\n&gt;&gt;&gt; are all great people, you folks together are making history don&#39;t you all\n&gt;&gt;&gt; realize this?  There are so many people out there that have never heard of\n&gt;&gt;&gt; this type of communication, thousands out there!  My friend just lost her\n&gt;&gt;&gt; mother a couple of weeks ago, when I told her about the work you all are\n&gt;&gt;&gt; doing, tears were replaced with a smile, she is looking forward to hearing\n&gt;&gt;&gt; from her mom now too.  Stop trying to hurt each other, it&#39;s not worth it,\n&gt;&gt;&gt; life is too short for this stuff.  You are all great people, May God Bless\n&gt;&gt;&gt; You All ~ And He Already Has,*\n&gt;&gt;&gt; *sf*\n&gt;&gt;&gt;\n&gt;&gt;&gt;  In a message dated 6/4/2009 2:27:06 P.M. Eastern Daylight Time,\n&gt;&gt;&gt; balllan94@yahoo. com writes:\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt; guys,\n&gt;&gt;&gt;\n&gt;&gt;&gt; Sorry to burden you with this nonsense but this group and the RTSC group\n&gt;&gt;&gt; are my only venues to respond to posts on other groups and have my account\n&gt;&gt;&gt; heard, I hope you do not mind to much.\n&gt;&gt;&gt;\n&gt;&gt;&gt; Here is a copy of my final personal e-mail to Frank Sumption which by the\n&gt;&gt;&gt; way is meant for him but he see&#39;s fit to post them publicly in an attempt to\n&gt;&gt;&gt; discredit me.\n&gt;&gt;&gt;\n&gt;&gt;&gt; I want you to read it first hand so there are no chance of it being\n&gt;&gt;&gt; altered before it is posted else where.\n&gt;&gt;&gt;\n&gt;&gt;&gt; I will not address Frank again\n&gt;&gt;&gt; ------------ --------- --------- --------- --------- --------- -\n&gt;&gt;&gt;\n&gt;&gt;&gt; Frank,\n&gt;&gt;&gt;\n&gt;&gt;&gt; This is getting ridiculous now, you should stop writing these posts, all\n&gt;&gt;&gt; you are doing is making yourself look ridiculous.\n&gt;&gt;&gt;\n&gt;&gt;&gt; I have offered many times to make my raw recordings available for review\n&gt;&gt;&gt; by anyone who wants them. I have made the same challenge to your friend moon\n&gt;&gt;&gt; who we all know is behind this tirade he has time and again refused or\n&gt;&gt;&gt; ignored the request for any type of audio file\n&gt;&gt;&gt; to be publicly posted for revue and continues to take advantage of\n&gt;&gt;&gt; innocent unsuspecting people with his con game and charging large amounts of\n&gt;&gt;&gt; money for sessions where he fabricates and makes up content as he goes\n&gt;&gt;&gt; along.\n&gt;&gt;&gt;\n&gt;&gt;&gt; I was the only one to confront him in public and expose him for the fake\n&gt;&gt;&gt; he is and this is his feeble attempt at retaliation. I and other researchers\n&gt;&gt;&gt; like me have brought this research light years from where it was when you\n&gt;&gt;&gt; and I first met, moon just continues to use it to rip people off and has not\n&gt;&gt;&gt; contributed a thing to the research of ghost box communication beside lining\n&gt;&gt;&gt; his own pockets.\n&gt;&gt;&gt;\n&gt;&gt;&gt; Just the fact that he has you doing his dirty work shows the type of guy\n&gt;&gt;&gt; he is. I can remember a time when you publicly came out against any type of\n&gt;&gt;&gt; money making using your boxes and even refused moon when he wanted to\n&gt;&gt;&gt; manufacture and sell them for large profits yet now you condone his robbery\n&gt;&gt;&gt; of innocent unaware people and actually act foolish on his behest.\n&gt;&gt;&gt;\n&gt;&gt;&gt; Frank you are better than this, just concentrate on developing a better\n&gt;&gt;&gt; box and forget about moon and his tricks and lies, he is finished in the\n&gt;&gt;&gt; paranormal and he knows it, everyone is wise to his game and he is\n&gt;&gt;&gt; practically an outcast.\n&gt;&gt;&gt;\n&gt;&gt;&gt; Frank you are hitching you wagon to a dead horse. Get away from these bad\n&gt;&gt;&gt; influences before they ruin your reputation as well.\n&gt;&gt;&gt;\n&gt;&gt;&gt; We have had this moon discussion in the past and once he has exhausted\n&gt;&gt;&gt; his need for you he will screw you again like he has done so many times\n&gt;&gt;&gt; before.\n&gt;&gt;&gt;\n&gt;&gt;&gt; Frank, I like and respect you and I hope you will consider what I have\n&gt;&gt;&gt; said in this e-mail and I sincerely hope you post this one on the evp-itc\n&gt;&gt;&gt; group. I will be posting it on my group and others I belong to.\n&gt;&gt;&gt;\n&gt;&gt;&gt; Your former friend\n&gt;&gt;&gt; Bruce\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt; ------------------------------\n&gt;&gt;&gt; Limited Time Offers: Save big on popular laptops at Dell&lt;http://pr.atwola.com/promoclk/100126575x1221354145x1201369495/aol?redir=http:%2F%2Fad.doubleclick.net%2Fclk%3B215221161%3B37268813%3By&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;  \n&gt;\n\nDAMN ZACK all I can say is ouch.  You we en' making a box whe e you On F i, Jun 5, 2009 a 12:13 PM, Zack Widup w9sz.zack@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n \n \n \n Cool. Thanks! We all make mis akes. I' e made some ecen ly al hough no bad enough o kill me o lose my job. I did d ill a hole in my inge .\n;-)\n \nZack\nOn F i, Jun 5, 2009 a 11:06 AM, eamonn mghe bi eamonnmghe bi@...> w o e:\n\n\n\n\n\n\n\nZack\n \nJus o cla i y\n \nI ha e clea ed up my i s message. Basically I was ag eeing wi h he ac ha Im no a an o Ch is Moon. I didn mean o say any hing abou F ank and eading back on he email I should ha e ewo ded.anyway his is my 3 d pos abou i :-)\n\n\n \nso jus o clea up ank you gi e good ad ice and sha e ideas. I messed my i s message up..hell im human i was an acciden \n \nKind Rega ds\n \nEamonn\n \nP.s. keep up he good wo k ;-)\n\n\n\n\nF om: Zack Widup w9sz.zack@...>\nTo: EVP-ITC@yahoog oups.comSen : F iday, 5 June, 2009 17:01:17 \n\n\nSubjec : [EVP-ITC] Re: [RTSC] a copy o my inal e-mail o F ank sump ion I will go no u he !\n\n\n\n\n\nI'd ag ee o ha . He sha es his esea ch, ne e cha ges o any hing, eely admi s he e a e no \"expe s\" in his ield (he does no e en conside  himsel an expe ).\nI g ow mo e and mo e conce ned abou he ha ed and iciousness I see om and among some \"pa ano mal esea che s.\" I is no e e ybody by any means, bu i  seems o exceed he a e age amoun o his I see in o he ields. I wonde why his is? Is i pe haps in ac because e e yone deep down inside knows he e a e no expe s in his ield and hose who y o p esen hemsel es as such know deep down inside hey a e p esen ing a alse image?\n\n\n \nZack\nOn F i, Jun 5, 2009 a 10:42 AM, F ank Ra ka wa io 18eii@ yahoo.com> w o e:\n\n\n\n\n\n\n\n\n\n\nA ogan !? Sump ion? You ha e a wa ped iew o Sump ion i you see a ogance. He is in you ace and speaks his mind bu he has ne e claimed o be any hing o he han \" he box\" c ea o . Does he alk shi abou people who claim o be expe s? Hell yeah! Tha 's one o he eason we like him. \n\n\n \nRega ds,\n \nF ank R.\n \n \n--- On F i, 6/5/09, eamonn mghe bi eamonnmghe bi@ yahoo.co. uk> w o e:\nF om: eamonn mghe bi eamonnmghe bi@ yahoo.co. uk>Subjec : Re: [EVP-ITC] Re: [RTSC] a copy o my inal e-mail o F ank sump ion I will go no u he !\n\nTo: EVP-ITC@yahoog oups .comDa e: F iday, June 5, 2009, 4:58 AM\n\n\n\n\n\nHi All\n \nI ha e o admi ha I sha e he same opinion as B uce. I don wha e e yones ake is on his bu I el ha some o moon and e en F anks a i ude was sligh ly a ogan . I am a esea che in he UK using old eel o eel me hods and ob aining excellen esul s. I los some amily and some close iends 5 yea a ago and suddenly i dawned on me...wha is li e all abou . I wen on o esea ch e e y e p pionee i could, lis en o hou s/days o eco dings and i changed my ou look on li e. ea s we e u ned o smiles and hen I ealised wha all his esea ch is o . i was a big s ep o me spi i ually. \n\n\n \nI don know i he e is anyone else on he e using old ashioned me hods bu i anybody would like o hea eco dings please ask. I am using a eel o eel sony \"Hi equency\" eco de and ying a ious ypes o ones, backg ounds e. .c.\n\n\n \nGood luck o e e yone wi h hei esea ch, you a e igh we a e changing his o y we a e disco e ing new hings. i i wasn o indi iduals such as audi e, ju ghenson o name a ew, maybe we wouldn ha e disco e ed his. i akes a b a e indi idual o ackle an a ogan human ace blun ed wi h science.\n\n\n \nKind Rega ds\n \nThe quie one :-)\n\n\n\n\nF om: \"Snow i eL@aol. com\" To: RTSC@yahoog oups. com; inside_ he_box_ sc_ alk_ adio@yahoog oup s.com; EVP-ITC@yahoog oups .com \n\n\nSen : Thu sday, 4 June, 2009 20:25:26Subjec : [EVP-ITC] Re: [RTSC] a copy o my inal e-mail o F ank sump ion I will go no u he !\n\n\n\n\n\n\n\nSo y o hea his B uce, I su e hope hings ge be e ,  I had no idea he e we e so many p oblems when I joined all hese lis s,  I hink you a e all g ea people, you olks oge he a e making his o y don' you all ealize his?  The e a e so many people ou he e ha ha e ne e hea d o his ype o communica ion, housands ou he e!  My iend jus los he mo he a couple o weeks ago, when I old he abou he wo k you all a e doing, ea s we e eplaced wi h a smile, she is looking o wa d o hea ing om he mom now oo.  S op ying o hu each o he , i 's no wo h i , li e is oo sho o his s u .  You a e all g ea people, May God Bless You All ~ And He Al eady Has,\n\n\ns \n \n\nIn a message da ed 6/4/2009 2:27:06 P.M. Eas e n Dayligh Time, balllan94@yahoo. com w i es:\n\n\n\n\nguys,So y o bu den you wi h his nonsense bu his g oup and he RTSC g oup a e my only enues o espond o pos s on o he g oups and ha e my accoun hea d, I hope you do no mind o much.He e is a copy o my inal pe sonal e-mail o F ank Sump ion which by he way is mean o him bu he see's i o pos hem publicly in an a emp o disc edi me.\n\nI wan you o ead i i s hand so he e a e no chance o i being al e ed be o e i is pos ed else whe e.I will no add ess F ank again------------ --------- --------- --------- --------- --------- -\n\nF ank,This is ge ing idiculous now, you should s op w i ing hese pos s, all you a e doing is making you sel look idiculous.I ha e o e ed many imes o make my aw eco dings a ailable o e iew by anyone who wan s hem. I ha e made he same challenge o you iend moon who we all know is behind his i ade he has ime and again e used o igno ed he eques o any ype o audio ile\n\n o be publicly pos ed o e ue and con inues o ake ad an age o innocen unsuspec ing people wi h his con game and cha ging la ge amoun s o money o sessions whe e he ab ica es and makes up con en as he goes along.\n\nI was he only one o con on him in public and expose him o he ake he is and his is his eeble a emp a e alia ion. I and o he esea che s like me ha e b ough his esea ch ligh yea s om whe e i was when you and I i s me , moon jus con inues o use i o ip people o and has no con ibu ed a hing o he esea ch o ghos box communica ion beside lining his own pocke s. \n\nJus he ac ha he has you doing his di y wo k shows he ype o guy he is. I can emembe a ime when you publicly came ou agains any ype o money making using you boxes and e en e used moon when he wan ed o manu ac u e and sell hem o la ge p o i s ye now you condone his obbe y o innocen unawa e people and ac ually ac oolish on his behes .\n\nF ank you a e be e han his, jus concen a e on de eloping a be e box and o ge abou moon and his icks and lies, he is inished in he pa ano mal and he knows i , e e yone is wise o his game and he is p ac ically an ou cas .\n\nF ank you a e hi ching you wagon o a dead ho se. Ge away om hese bad in luences be o e hey uin you epu a ion as well.We ha e had his moon discussion in he pas and once he has exhaus ed his need o you he will sc ew you again like he has done so many imes be o e.\n\nF ank, I like and espec you and I hope you will conside wha I ha e said in his e-mail and I since ely hope you pos his one on he e p-i c g oup. I will be pos ing i on my g oup and o he s I belong o.\nYou o me iend\nB uce\n\n\n\nLimi ed Time O e s: Sa e big on popula lap ops a Dell"}