{"id": "14872", "subject": "Re: [EVP-ITC] Re: [RTSC] a copy of my final e-mail to Frank sumption \tI will go no further!", "author": "Zack Widup", "timestamp": "2009-06-05T16:08:57Z", "full_text": "Once you get to know Frank S, his comments don&#39;t bother you.\n;-)\n\nA lot of us don&#39;t care for Moon.\n\nZack\n\nOn Fri, Jun 5, 2009 at 10:52 AM, eamonn mgherbi\n&lt;eamonnmgherbi@...&gt;wrote:\n\n&gt;\n&gt;\n&gt;   Wow first of all dont swear on here and wind your neck in!\n&gt;\n&gt; Now I have to admit I didnt mean you I was talking about Chris moon but\n&gt; hell im at work and im trying to do 2 things at once.\n&gt;\n&gt; I have been following this group for a year and from the message i wrote\n&gt; this is the first time I got a reply. Now Frank I think you work is quality\n&gt; and I definately want to learn more about your work and what you do. and if\n&gt; you could advise me of where I can see a profile of yourself that would be\n&gt; great. but dont start with the abusive crap towards me.\n&gt;\n&gt; Lets keep it clean. Again I was talking about Moon. not you Frank, iv read\n&gt; my message over and i definately worded it wrong. Im just not a big fan of\n&gt; Chris Moon.\n&gt;\n&gt; And the religious crap thing also wind your neck in about that, that was a\n&gt; pretty crappy thing first of all im not religious it just causes war. second\n&gt; of all I want to know more about your work.\n&gt;\n&gt;  ------------------------------\n&gt; *From:* Frank Sumption &lt;purplealiengirl@...&gt;\n&gt; *To:* EVP-ITC@yahoogroups.com\n&gt; *Sent:* Friday, 5 June, 2009 16:25:28\n&gt; *Subject:* Re: [EVP-ITC] Re: [RTSC] a copy of my final e-mail to Frank\n&gt; sumption I will go no further!\n&gt;\n&gt;    Arrogant!? Lets see, I don&#39;t do shows, I&#39;m not on podcast every\n&gt; friggin&#39; day proclaiming my expertness, I don&#39;t charge money-for anything, I\n&gt; share all information and schematics, and I do not kiss anyone&#39;s ass, guess\n&gt; that must be so egotistical of me.  Arrogant!?, who is the f--- is the\n&gt; duffus out there with the high priest mentality?  The really sad part is\n&gt; trhe brain dead dorks that follow these clowns. Haliday proclaimed himself\n&gt; box expert extraordinaire, and there&#39;s those sorry twits that eat up\n&gt; everyword. There are no box/paranormal experts, no one knows how this shit\n&gt; works. Go to church if you want a religious experience!\n&gt;\n&gt;  Anyway, there is one advantage to using tape, the entities seem capable of\n&gt; changing the messages as needed. I can use the same recording over an over,\n&gt; and I swear, I get meaningful, having to do with the moment on every\n&gt; listening. Brain matrixing--perhaps- -or does it really change? I can&#39;t\n&gt; tell.\n&gt;\n&gt;  Frank-S\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;  On Fri, Jun 5, 2009 at 3:58 AM, eamonn mgherbi &lt;eamonnmgherbi@ yahoo.co.\n&gt; uk &lt;eamonnmgherbi@...&gt;&gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;   Hi All\n&gt;&gt;\n&gt;&gt; I have to admit that I share the same opinion as Bruce. I dont what\n&gt;&gt; everyones take is on this but I felt that some of moon and even Franks\n&gt;&gt; attitude was slightly arrogant. I am a researcher in the UK using old reel\n&gt;&gt; to reel methods and obtaining excellent results. I lost some family and some\n&gt;&gt; close friends 5 yeara ago and suddenly it dawned on me...what is life all\n&gt;&gt; about. I went on to research every evp pioneer i could, listen to hours/days\n&gt;&gt; of recordings and it changed my outlook on life. tears were turned to smiles\n&gt;&gt; and then I realised what all this research is for. it was a big step for me\n&gt;&gt; spiritually.\n&gt;&gt;\n&gt;&gt; I dont know if there is anyone else on here using old fashioned methods\n&gt;&gt; but if anybody would like to hear recordings please ask. I am using a reel\n&gt;&gt; to reel sony &quot;Hi frequency&quot; recorder and trying various types of tones,\n&gt;&gt; backgrounds e.t.c.\n&gt;&gt;\n&gt;&gt; Good luck to everyone with their research, you are right we are changing\n&gt;&gt; history we are discovering new things. if it wasnt for individuals such as\n&gt;&gt; raudive, jurghenson to name a few, maybe we wouldnt have discovered this. it\n&gt;&gt; takes a brave individual to tackle an arrogant human race blunted with\n&gt;&gt; science.\n&gt;&gt;\n&gt;&gt; Kind Regards\n&gt;&gt;\n&gt;&gt; The quiet one :-)\n&gt;&gt;\n&gt;&gt;  ------------------------------\n&gt;&gt; *From:* &quot;SnowfireL@aol. com &lt;SnowfireL@...&gt;&quot; &lt;SnowfireL@aol. com&lt;SnowfireL@...&gt;\n&gt;&gt; &gt;\n&gt;&gt; *To:* RTSC@yahoogroups. com &lt;RTSC@yahoogroups.com&gt;; inside_the_box_\n&gt;&gt; rtsc_talk_ radio@yahoogroup s.com&lt;inside_the_box_rtsc_talk_radio@yahoogroups.com&gt;;\n&gt;&gt; EVP-ITC@yahoogroups .com &lt;EVP-ITC@yahoogroups.com&gt;\n&gt;&gt;\n&gt;&gt; *Sent:* Thursday, 4 June, 2009 20:25:26\n&gt;&gt; *Subject:* [EVP-ITC] Re: [RTSC] a copy of my final e-mail to Frank\n&gt;&gt; sumption I will go no further!\n&gt;&gt;\n&gt;&gt;  *Sorry to hear this Bruce, I sure hope things get better,  I had no idea\n&gt;&gt; there were so many problems when I joined all these lists,  I think you are\n&gt;&gt; all great people, you folks together are making history don&#39;t you all\n&gt;&gt; realize this?  There are so many people out there that have never heard of\n&gt;&gt; this type of communication, thousands out there!  My friend just lost her\n&gt;&gt; mother a couple of weeks ago, when I told her about the work you all are\n&gt;&gt; doing, tears were replaced with a smile, she is looking forward to hearing\n&gt;&gt; from her mom now too.  Stop trying to hurt each other, it&#39;s not worth it,\n&gt;&gt; life is too short for this stuff.  You are all great people, May God Bless\n&gt;&gt; You All ~ And He Already Has,*\n&gt;&gt; *sf*\n&gt;&gt;\n&gt;&gt;  In a message dated 6/4/2009 2:27:06 P.M. Eastern Daylight Time,\n&gt;&gt; balllan94@yahoo. com writes:\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; guys,\n&gt;&gt;\n&gt;&gt; Sorry to burden you with this nonsense but this group and the RTSC group\n&gt;&gt; are my only venues to respond to posts on other groups and have my account\n&gt;&gt; heard, I hope you do not mind to much.\n&gt;&gt;\n&gt;&gt; Here is a copy of my final personal e-mail to Frank Sumption which by the\n&gt;&gt; way is meant for him but he see&#39;s fit to post them publicly in an attempt to\n&gt;&gt; discredit me.\n&gt;&gt;\n&gt;&gt; I want you to read it first hand so there are no chance of it being\n&gt;&gt; altered before it is posted else where.\n&gt;&gt;\n&gt;&gt; I will not address Frank again\n&gt;&gt; ------------ --------- --------- --------- --------- --------- -\n&gt;&gt;\n&gt;&gt; Frank,\n&gt;&gt;\n&gt;&gt; This is getting ridiculous now, you should stop writing these posts, all\n&gt;&gt; you are doing is making yourself look ridiculous.\n&gt;&gt;\n&gt;&gt; I have offered many times to make my raw recordings available for review\n&gt;&gt; by anyone who wants them. I have made the same challenge to your friend moon\n&gt;&gt; who we all know is behind this tirade he has time and again refused or\n&gt;&gt; ignored the request for any type of audio file\n&gt;&gt; to be publicly posted for revue and continues to take advantage of\n&gt;&gt; innocent unsuspecting people with his con game and charging large amounts of\n&gt;&gt; money for sessions where he fabricates and makes up content as he goes\n&gt;&gt; along.\n&gt;&gt;\n&gt;&gt; I was the only one to confront him in public and expose him for the fake\n&gt;&gt; he is and this is his feeble attempt at retaliation. I and other researchers\n&gt;&gt; like me have brought this research light years from where it was when you\n&gt;&gt; and I first met, moon just continues to use it to rip people off and has not\n&gt;&gt; contributed a thing to the research of ghost box communication beside lining\n&gt;&gt; his own pockets.\n&gt;&gt;\n&gt;&gt; Just the fact that he has you doing his dirty work shows the type of guy\n&gt;&gt; he is. I can remember a time when you publicly came out against any type of\n&gt;&gt; money making using your boxes and even refused moon when he wanted to\n&gt;&gt; manufacture and sell them for large profits yet now you condone his robbery\n&gt;&gt; of innocent unaware people and actually act foolish on his behest.\n&gt;&gt;\n&gt;&gt; Frank you are better than this, just concentrate on developing a better\n&gt;&gt; box and forget about moon and his tricks and lies, he is finished in the\n&gt;&gt; paranormal and he knows it, everyone is wise to his game and he is\n&gt;&gt; practically an outcast.\n&gt;&gt;\n&gt;&gt; Frank you are hitching you wagon to a dead horse. Get away from these bad\n&gt;&gt; influences before they ruin your reputation as well.\n&gt;&gt;\n&gt;&gt; We have had this moon discussion in the past and once he has exhausted his\n&gt;&gt; need for you he will screw you again like he has done so many times before.\n&gt;&gt;\n&gt;&gt; Frank, I like and respect you and I hope you will consider what I have\n&gt;&gt; said in this e-mail and I sincerely hope you post this one on the evp-itc\n&gt;&gt; group. I will be posting it on my group and others I belong to.\n&gt;&gt;\n&gt;&gt; Your former friend\n&gt;&gt; Bruce\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; ------------------------------\n&gt;&gt; Limited Time Offers: Save big on popular laptops at Dell&lt;http://pr.atwola.com/promoclk/100126575x1221354145x1201369495/aol?redir=http:%2F%2Fad.doubleclick.net%2Fclk%3B215221161%3B37268813%3By&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;\n&gt;   \n&gt;\n\nOnce you ge o know F ank S, his commen s don' bo he you.\n;-)\n \nA lo o us don' ca e o Moon.\n \nZack\nOn F i, Jun 5, 2009 a 10:52 AM, eamonn mghe bi eamonnmghe bi@...> w o e:\n\n\n\n\n\n\n\n\nWow i s o all don swea on he e and wind you neck in!\n \nNow I ha e o admi I didn mean you I was alking abou Ch is moon bu hell im a wo k and im ying o do 2 hings a once.\n \nI ha e been ollowing his g oup o a yea and om he message i w o e his is he i s ime I go a eply. Now F ank I hink you wo k is quali y and I de ina ely wan o lea n mo e abou you wo k and wha you do. and i you could ad ise me o whe e I can see a p o ile o you sel ha would be g ea . bu don s a wi h he abusi e c ap owa ds me.\n\n \nLe s keep i clean. Again I was alking abou Moon. no you F ank, i ead my message o e and i de ina ely wo ded i w ong. Im jus no a big an o Ch is Moon.\n \nAnd he eligious c ap hing also wind you neck in abou ha , ha was a p e y c appy hing i s o all im no eligious i jus causes wa . second o all I wan o know mo e abou you wo k.\n\n\n\nF om: F ank Sump ion pu plealiengi l@...>To: EVP-ITC@yahoog oups.com\nSen : F iday, 5 June, 2009 16:25:28Subjec : Re: [EVP-ITC] Re: [RTSC] a copy o my inal e-mail o F ank sump ion I will go no u he !\n\n\n\n\n A ogan !? Le s see, I don' do shows, I'm no on podcas e e y iggin' day p oclaiming my expe ness, I don' cha ge money- o any hing, I sha e all in o ma ion and schema ics, and I do no kiss anyone's ass, guess ha mus be so ego is ical o me.  A ogan !?, who is  he --- is he du us ou he e wi h he high p ies men ali y?  The eally sad pa is he b ain dead do ks ha ollow hese clowns. Haliday p oclaimed himsel box expe ex ao dinai e, and he e's hose so y wi s ha ea up e e ywo d. The e a e no box/pa ano mal expe s, no one knows how his shi wo ks. Go o chu ch i you wan a eligious expe ience!\n\n \n Anyway, he e is one ad an age o using ape, he en i ies seem capable o changing he messages as needed. I can use he same eco ding o e an o e , and I swea , I ge meaning ul, ha ing o do wi h he momen on e e y lis ening. B ain ma ixing--pe haps- -o does i eally change? I can' ell. \n\n \n F ank-S\n \n \n\nOn F i, Jun 5, 2009 a 3:58 AM, eamonn mghe bi eamonnmghe bi@ yahoo.co. uk> w o e:\n\n\n\n\n\n\n\n\nHi All\n \nI ha e o admi ha I sha e he same opinion as B uce. I don wha e e yones ake is on his bu I el ha some o moon and e en F anks a i ude was sligh ly a ogan . I am a esea che in he UK using old eel o eel me hods and ob aining excellen esul s. I los some amily and some close iends 5 yea a ago and suddenly i dawned on me...wha is li e all abou . I wen on o esea ch e e y e p pionee i could, lis en o hou s/days o eco dings and i changed my ou look on li e. ea s we e u ned o smiles and hen I ealised wha all his esea ch is o . i was a big s ep o me spi i ually. \n\n \nI don know i he e is anyone else on he e using old ashioned me hods bu i anybody would like o hea eco dings please ask. I am using a eel o eel sony \"Hi equency\" eco de and ying a ious ypes o ones, backg ounds e. .c.\n\n \nGood luck o e e yone wi h hei esea ch, you a e igh we a e changing his o y we a e disco e ing new hings. i i wasn o indi iduals such as audi e, ju ghenson o name a ew, maybe we wouldn ha e disco e ed his. i akes a b a e indi idual o ackle an a ogan human ace blun ed wi h science.\n\n \nKind Rega ds\n \nThe quie one :-)\n\n\n\n\nF om: \"Snow i eL@aol. com\" Snow i eL@aol. com>\nTo: RTSC@yahoog oups. com; inside_ he_box_ sc_ alk_ adio@yahoog oup s.com; EVP-ITC@yahoog oups .com \n\n\nSen : Thu sday, 4 June, 2009 20:25:26Subjec : [EVP-ITC] Re: [RTSC] a copy o my inal e-mail o F ank sump ion I will go no u he !\n\n\n\n\n\n\n\nSo y o hea his B uce, I su e hope hings ge be e ,  I had no idea he e we e so many p oblems when I joined all hese lis s,  I hink you a e all g ea people, you olks oge he a e making his o y don' you all ealize his?  The e a e so many people ou he e ha ha e ne e hea d o his ype o communica ion, housands ou he e!  My iend jus los he mo he a couple o weeks ago, when I old he abou he wo k you all a e doing, ea s we e eplaced wi h a smile, she is looking o wa d o hea ing om he mom now oo.  S op ying o hu each o he , i 's no wo h i , li e is oo sho o his s u .  You a e all g ea people, May God Bless You All ~ And He Al eady Has,\n\ns \n \n\nIn a message da ed 6/4/2009 2:27:06 P.M. Eas e n Dayligh Time, balllan94@yahoo. com w i es:\n\n\n\n\nguys,So y o bu den you wi h his nonsense bu his g oup and he RTSC g oup a e my only enues o espond o pos s on o he g oups and ha e my accoun hea d, I hope you do no mind o much.He e is a copy o my inal pe sonal e-mail o F ank Sump ion which by he way is mean o him bu he see's i o pos hem publicly in an a emp o disc edi me.\nI wan you o ead i i s hand so he e a e no chance o i being al e ed be o e i is pos ed else whe e.I will no add ess F ank again------------ --------- --------- --------- --------- --------- -\nF ank,This is ge ing idiculous now, you should s op w i ing hese pos s, all you a e doing is making you sel look idiculous.I ha e o e ed many imes o make my aw eco dings a ailable o e iew by anyone who wan s hem. I ha e made he same challenge o you iend moon who we all know is behind his i ade he has ime and again e used o igno ed he eques o any ype o audio ile\n o be publicly pos ed o e ue and con inues o ake ad an age o innocen unsuspec ing people wi h his con game and cha ging la ge amoun s o money o sessions whe e he ab ica es and makes up con en as he goes along.\nI was he only one o con on him in public and expose him o he ake he is and his is his eeble a emp a e alia ion. I and o he esea che s like me ha e b ough his esea ch ligh yea s om whe e i was when you and I i s me , moon jus con inues o use i o ip people o and has no con ibu ed a hing o he esea ch o ghos box communica ion beside lining his own pocke s. \nJus he ac ha he has you doing his di y wo k shows he ype o guy he is. I can emembe a ime when you publicly came ou agains any ype o money making using you boxes and e en e used moon when he wan ed o manu ac u e and sell hem o la ge p o i s ye now you condone his obbe y o innocen unawa e people and ac ually ac oolish on his behes .\nF ank you a e be e han his, jus concen a e on de eloping a be e box and o ge abou moon and his icks and lies, he is inished in he pa ano mal and he knows i , e e yone is wise o his game and he is p ac ically an ou cas .\nF ank you a e hi ching you wagon o a dead ho se. Ge away om hese bad in luences be o e hey uin you epu a ion as well.We ha e had his moon discussion in he pas and once he has exhaus ed his need o you he will sc ew you again like he has done so many imes be o e.\nF ank, I like and espec you and I hope you will conside wha I ha e said in his e-mail and I since ely hope you pos his one on he e p-i c g oup. I will be pos ing i on my g oup and o he s I belong o.You o me iend\nB uce\n\n\n\nLimi ed Time O e s: Sa e big on popula lap ops a Dell"}