{"id": "1487", "subject": "RE: [EVP-ITC] Re: Another &quot;boring&quot; weekend.", "author": "Frank Sumption", "timestamp": "2007-07-09T18:34:24Z", "full_text": "Thanks. I use ExpressPCB, they are fairly low cost. The next boards will be \npretty complex, with lots of through holes, and at least two layer, and I \nmay have to use a mix of SMT, and standard components so I can use both \nsides to get the board size down, sq. inches=$$. The layout I was working on \nlast winter was close to $500 for 10 boards, and that was before adding \nlinear sweep, the tone generator, and it was an AM only tuner. Perf board is \nmuch cheaper, but it&#39;s time consumming to build one at a time. \nhttp://www.expresspcb.com/\n\nI had one set of three boards made that were all SMT last year, but they \ndidn&#39;t include the tuner. They were ExpressPCB&#39;s &quot;mini boards&quot;, at $60 for \nthe three boards.  Before that I had two proto type boards made that cost \n$162, of course I gave all those away! Yeah, my wife went nuts long ago cuz \nof my non-comprehension of money.\n\nI&#39;m dragging my feet getting the boards made because I&#39;ve run into a curious \nproblem with this stuff, the circuit conditions seem to change. With some \nboards I have  DC offeset problem that I have to use pull down reisistors on \nevery op amp stage to compensate for. I just made a board, and had to remove \nall the pull downs, or it wouldn&#39;t work at all, the offset problem missing, \nand I don&#39;t know what changed, as I&#39;m getting the same parts from the same \ndistributor. The boards in various systems seem to stop working sometimes, \nand I think it has something to do with this problem. I was thinking about \nadding a dip swtich, and pull downs, so they can be added when, or if \nneeded. If the DC offset is too large in the random sweep section, it swamps \nout the signal, so nothing comes through. I prefer analog, but perhaps a \ndigital solution is called for, as in a an RNG to generate the random pulses \nI derive from white noise, and that&#39;s another reason why I&#39;m not jumping at \nthe PCB&#39;s yet, I don&#39;t have a final design------yet.\n\nFrank-S\n\n\n&gt;From: Zack Widup &lt;w9sz@...&gt;\n&gt;Reply-To: EVP-ITC@yahoogroups.com\n&gt;To: EVP-ITC@yahoogroups.com\n&gt;Subject: RE: [EVP-ITC] Re: Another &quot;boring&quot; weekend.\n&gt;Date: Mon, 9 Jul 2007 12:54:32 -0500 (CDT)\n&gt;\n&gt;\n&gt;If you need help making printed circuit boards, I can help. I have been\n&gt;making them for years using the Datak chemicals and get pretty good\n&gt;looking boards. All I need are the patterns.  I cannot make\n&gt;plated-through holes on double-sided boards, however, and have to use &quot;C&quot;\n&gt;wires when I need through-board connections.\n&gt;\n&gt;Zack\n&gt;\n&gt;On Mon, 9 Jul 2007, Frank Sumption wrote:\n&gt;\n&gt; &gt; Thanks. It&#39;s not so much evolution, it&#39;s using what I have, like the \n&gt;scrap\n&gt; &gt; piece of aluminum for the panel. The next &quot;evolution&quot; will be the \n&gt;printed\n&gt; &gt; circuit board. Of course I keep adding functions, which means more board\n&gt; &gt; real estate, which raises costs. I really want the linear sweep, and \n&gt;tone\n&gt; &gt; injection to be standard functions. It would be interesting to use all\n&gt; &gt; stereo speakers, and mics in the echo boxes, but that almost doubles the\n&gt; &gt; components again. I&#39;ve thought about a stripped down version, like just \n&gt;the\n&gt; &gt; tuner and sweep generator, then use something like a boom box for the \n&gt;all\n&gt; &gt; the audio and recording functions. If it was only linear sweep, the \n&gt;system\n&gt; &gt; could be made on a small board===cheap.\n&gt; &gt;\n&gt; &gt; Frank-S\n&gt; &gt;\n\n_________________________________________________________________\nhttp://liveearth.msn.com"}