{"id": "14888", "subject": "Re: I am a Dummy", "author": "Frank", "timestamp": "2009-06-05T19:27:58Z", "full_text": "The running theory is this: The entity only needs some complex noise source (whatever that may be) in or to modulate or demodulate (change) the signal to form communication. A lot of the radios are used (Frank&#39;s box, shack hacks, minibox or whatever) because they put out a complex noise signal with a lot of human voice tones in them. It is thought that it would be easier for them to manipulate the voice tones than to try to manipulate random noise.\n\nI personally use silence to record, which really isn&#39;t silence at all but just ambient room noise. The signal is run through certain filters and I get pretty good solid speech. I have worked with different setups such as the hacks and the like but prefer the more basic forms that, to me are more reliable and less questionable.\n\nNo matter what you decide to use to record they will all work to some extent in the end. All you need to communicate is the will, desire and an interested entity around you.\n\nRegards,\n\nFrank R.\n--- In EVP-ITC@yahoogroups.com, Rj &lt;rasterer@...&gt; wrote:\n&gt;\n&gt; This is where I tend to get confused.\n&gt; \n&gt; Misty said the ghost modulates? But I&#39;ve also heard it said it is not the noise, but the words, that the ghosts select from the broadcasts? And some people say that it is something more ephrmeral, that every hears differently because it has t to be meant for each individual.\n&gt; \n&gt; Could someone set me straight here? Maybe Frank S? \n&gt; \n&gt; --- On Fri, 6/5/09, April Abercrombie &lt;april@...&gt; wrote:\n&gt; \n&gt; From: April Abercrombie &lt;april@...&gt;\n&gt; Subject: Re: [EVP-ITC] I am a Dummy\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Friday, June 5, 2009, 12:01 PM\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;     \n&gt;             \n&gt;             \n&gt; \n&gt; \n&gt;       \n&gt;       \n&gt; \n&gt; \n&gt; I think that the only positive I could see \n&gt; out of manual sweep is that you will have a naturalirregularness to the \n&gt; speed at which you sweep.\n&gt; \n&gt; Correct me if I am wrong, but I don&#39;t think \n&gt; that manual sweeping means yousearch for words necessarily. I mean the aim \n&gt; should be the same as automatic sweepin that you just turn the knob back \n&gt; and forth without reason.\n&gt; \n&gt; April\n&gt; \n&gt; \n&gt;   ----- Original Message ----- \n&gt;   From: \n&gt;   Rj \n&gt;   To: EVP-ITC@yahoogroups .com \n&gt;   Sent: Friday, June 05, 2009 12:41 \n&gt; PM\n&gt;   Subject: Re: [EVP-ITC] I am a Dummy\n&gt;   \n&gt; \n&gt;   \n&gt;   \n&gt;   \n&gt;     \n&gt;     \n&gt;       I&#39;m not sure I understand the theory behind the manual \n&gt;         sweeps - maybe you can help?\n&gt; \n&gt; I thought the idea behind the \n&gt;         electronic (franks box) sweeps is that the entities are the ones \n&gt;         selecting the proper frequencies at the proper time containing the \n&gt;         relevant words they want to express. Is that true?\n&gt; \n&gt; If so, \n&gt;         then doesn&#39;t the manual sweep completely override that process, since it \n&gt;         is you that is turning the knob, and just looking for words you \n&gt;         personally think are relevant?\n&gt; \n&gt; \n&gt; --- On Fri, 6/5/09, Misty \n&gt;         Dawn &lt;bulletbabea@ yahoo.com&gt; wrote:\n&gt; \n&gt;         \n&gt; From: \n&gt;           Misty Dawn &lt;bulletbabea@ yahoo.com&gt;\n&gt; Subject: Re: \n&gt;           [EVP-ITC] I am a Dummy\n&gt; To: EVP-ITC@yahoogroups .com\n&gt; Date: \n&gt;           Friday, June 5, 2009, 10:49 AM\n&gt; \n&gt; \n&gt;           \n&gt;           \n&gt;           \n&gt;           \n&gt;             \n&gt;             \n&gt;               \n&gt;                 With the RS hacks they are basically just opening the case \n&gt;                 carefully and cutting the mute wire or pulling out the mute pin \n&gt;                 depending whichradio it is. Check the archives for \n&gt;                 descriptions for each model. RS updated some versions of the \n&gt;                 radios so they were no longer able to be modified. Steve Hultay \n&gt;                 went on to try it on a few other radios and got some good \n&gt;                 results. \n&gt;                 \n&gt;                 You can also do a manual sweep with a radio that has a \n&gt;                 knob/dial or a scan function that doesnt jump the stations too \n&gt;                 quickly by simply scanning across the band. This method works \n&gt;                 great.\n&gt;                 \n&gt;                 Misty\n&gt; \n&gt; --- On Fri, 6/5/09, Eric VanDuzer \n&gt;                 &lt;evanduzer@gmail. com&gt; wrote:\n&gt; \n&gt;                 \n&gt; From: Eric \n&gt;                   VanDuzer &lt;evanduzer@gmail. com&gt;\n&gt; Subject: [EVP-ITC] I \n&gt;                   am a Dummy\n&gt; To: EVP-ITC@yahoogroups .com\n&gt; Date: Friday, \n&gt;                   June 5, 2009, 12:07 PM\n&gt; \n&gt; \n&gt;                   \n&gt;                   \n&gt;                   Question for Anyone\n&gt; \n&gt; I wanna build A RS Hack Box \n&gt;                   but I am completely ignorant when it come to Electronic \n&gt;                   schematics and I am having trouble with my computer at home so \n&gt;                   I can&#39;t get any video or download anything. Is there \n&gt;                   somewhere out there that explains the step by step in \n&gt;                   &quot;Layman&#39;s Terms&quot; on how to build on. I know I am asking \n&gt;                   alot. Frank maybe you should right a &quot;FRANKS BOX for \n&gt;                   DUMMIES&quot; Book LOL. Thanks for the help in \n&gt;                   advance\n&gt; \n&gt; \n&gt; \n&gt; The Paranormal \n&gt;                   Preacher\n&gt; \n&gt; Eric\n&gt;"}