{"id": "14881", "subject": "Re: I am a Dummy", "author": "Misty", "timestamp": "2009-06-05T19:00:40Z", "full_text": "In theory spirit modulates sound to speak no matter the method. The boxes sweep tuning does the same thing as a manual sweep tuning its all just scanning across the band. Some find it easier to have it done automatically for them. Depends on personal preference =)\n\nBest I can say to anyone is try whats available to you.\n\nMisty\n\n\n\n--- In EVP-ITC@yahoogroups.com, Rj &lt;rasterer@...&gt; wrote:\n&gt;\n&gt; I&#39;m not sure I understand the theory behind the manual sweeps - maybe you can help?\n&gt; \n&gt; I thought the idea behind the electronic (franks box) sweeps is that the entities are the ones selecting the proper frequencies at the proper time containing the relevant words they want to express. Is that true?\n&gt; \n&gt; If so, then doesn&#39;t the manual sweep completely override that process, since it is you that is turning the knob, and just looking for words you personally think are relevant?\n&gt; \n&gt; \n&gt; --- On Fri, 6/5/09, Misty Dawn &lt;bulletbabea@...&gt; wrote:\n&gt; \n&gt; From: Misty Dawn &lt;bulletbabea@...&gt;\n&gt; Subject: Re: [EVP-ITC] I am a Dummy\n&gt; To: EVP-ITC@...m\n&gt; Date: Friday, June 5, 2009, 10:49 AM\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;     \n&gt;             \n&gt;             \n&gt; \n&gt; \n&gt;       \n&gt;       With the RS hacks they are basically just opening the case carefully and cutting the mute wire or pulling out the mute pin depending whichradio it is. Check the archives for descriptions for each model. RS updated some versions of the radios so they were no longer able to be modified. Steve Hultay went on to try it on a few other radios and got some good results. \n&gt; \n&gt; You can also do a manual sweep with a radio that has a knob/dial or a scan function that doesnt jump the stations too quickly by simply scanning across the band. This method works great.\n&gt; \n&gt; Misty\n&gt; \n&gt; --- On Fri, 6/5/09, Eric VanDuzer &lt;evanduzer@gmail. com&gt; wrote:\n&gt; \n&gt; \n&gt; From: Eric VanDuzer &lt;evanduzer@gmail. com&gt;\n&gt; Subject: [EVP-ITC] I am a Dummy\n&gt; To: EVP-ITC@yahoogroups .com\n&gt; Date: Friday, June 5, 2009, 12:07 PM\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Question for Anyone\n&gt; \n&gt; I wanna build A RS Hack Box but I am completely ignorant when it come to Electronic schematics and I am having trouble with my computer at home so I can&#39;t get any video or download anything. Is there somewhere out there that explains the step by step in &quot;Layman&#39;s Terms&quot; on how to build on. I know I am asking alot. Frank maybe you should right a &quot;FRANKS BOX for DUMMIES&quot; Book LOL. Thanks for the help in advance\n&gt; \n&gt; \n&gt; \n&gt; The Paranormal Preacher\n&gt; \n&gt; Eric\n&gt;"}