{"id": "14906", "subject": "Re: [EVP-ITC] Digest Number 1537", "author": "Aquarius", "timestamp": "2009-06-05T23:57:15Z", "full_text": "Hi, gang!\n\nWell, aren&#39;t we the animated group! &lt;G&gt;\n\nPlease, please, PLEASE! Do NOT just hit reply and type a brief answer,\nleaving the copies upon copies upon copies of previous emails in your reply\nbelow your new comment!\n\nFor those of us who get the posts in digest form (a group of posts grouped\ninto a long list in one email), it becomes impossible to follow the\ndiscussions and posts when some of the entire threads (posts and numerous\nreplies) get repeated multiple times with every reply!\n\nPlease snip the texts and leave only the parts to which you are replying.\n\nI would be extremely appreciative and grateful for everyone&#39;s attention to\nthis little detail of internet/groups etiquette.\n\nAnd on another note, my own experience with channeling and doing mediumship\nwork (without recorders) is that the more relaxed you are, and the more\nclear about your inter-dimensional boundaries, the better the communications\nwill be. If you wouldn&#39;t put up with threats or harassment in the ordinary\nfive-senses world, why on earth should we put up with it from discarnate\nbeings? I think they need to respect us for being willing to be the vehicles\nthrough which they communicate, just as we need to be respectful of them for\n*wanting* and *trying* to communicate.\n\nAnd I don&#39;t think the entities are snatching words from the radio scans, I\nthink the generation of white-noise soundwaves creates a conducive\nelectromagnetic environment with which (maybe) they can vibrate more easily.\nThe theory is (and who really knows, after all?), that they are themselves\nelectromagnetic energy, not third-dimension physical beings, and so vibrate\nat the higher frequencies that sound does...\n\nI don&#39;t know if that explanation makes sense the way I wrote it, but that&#39;s\nwhat I&#39;ve heard discussed by other, way more expert mediums than I (I mostly\ndo channeling and other psychic work, only occasionally mediumship).\n\nBest,\n\nLeslie\n\n&quot;I&#39;m not happy, I&#39;m cheerful. There&#39;s a difference. A happy woman has no\ncares at all. A cheerful woman has cares but has learned how to deal with them.&quot;\n\n    -- Beverly Sills (1929-) American Opera Singer"}