{"id": "14997", "subject": "Re: [EVP-ITC] New ideas", "author": "Zack Widup", "timestamp": "2009-06-08T18:50:34Z", "full_text": "Heehee - there was a mockingbird nest somewhere in the vicinity.\nMockingbirds, when nesting, sing 24 hours a day. This one was going all\nnight in true mockingbird fashion.\n\nThere wouldn&#39;t have been any heating or cooling fans, night watchmen, sump\nor plumbing system sounds as there were none where I was the other night.\nEverything else plus the coyotes and car traffic came through on pocket\naudio recorders. Plus the speedway a couple miles down the road between\nabout 7:30 and 10:30 pm. THAT was the worst! VRROOOM!  VRROOOM!\n\nZack\n\nOn Mon, Jun 8, 2009 at 1:39 PM, Rj &lt;rasterer@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;   You potentially could have heard lots of things.\n&gt;\n&gt; Some that come to mind are cats, mice, structural shifts, weather, birds\n&gt; outside, heating or cooling fans, curious insects, a night watchman, sump or\n&gt; plumbing systems ... the possibilities are endless.\n&gt;\n&gt; --- On *Mon, 6/8/09, Zack Widup &lt;w9sz.zack@...&gt;* wrote:\n&gt;\n&gt;\n&gt; From: Zack Widup &lt;w9sz.zack@...&gt;\n&gt; Subject: Re: [EVP-ITC] New ideas\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Monday, June 8, 2009, 10:40 AM\n&gt;\n&gt;   I am curious if anyone with a microphone wired to a remote site has ever\n&gt; gotten any EVP in real time.\n&gt;\n&gt; I took part in an investigation of Ashmore Estates, near Ashmore IL, on\n&gt; Saturday night. We had six video cameras set up in the three halls of the\n&gt; building. The video for all was being monitored and recorded at a central\n&gt; location. Alas, we did not have microphones at the camera sites conected to\n&gt; the central location. I wonder what we might have heard if we did?\n&gt;\n&gt; Zack\n&gt;\n&gt;\n&gt; On Mon, Jun 8, 2009 at 12:05 PM, threadsintyme@ juno.com&lt;http://mc/compose?to=threadsintyme@...&gt;\n&gt; &lt;Threadsintyme@ juno.com &lt;http://mc/compose?to=Threadsintyme@...&gt;&gt;wrote:\n&gt;\n&gt; Let&#39;s just agree to end this discussion about her...\n&gt; Why don&#39;t we discuss something on a lighter note? Anyone have any new ideas\n&gt; about either evp or ITC?\n&gt; Al\n&gt;\n&gt;\n&gt; \n&gt;\n\nHeehee - he e was a mockingbi d nes somewhe e in he icini y. Mockingbi ds, when nes ing, sing 24 hou s a day. This one was going all nigh in ue mockingbi d ashion.\n \nThe e wouldn' ha e been any hea ing o cooling ans, nigh wa chmen, sump o plumbing sys em sounds as he e we e none whe e I was he o he nigh . E e y hing else plus he coyo es and ca a ic came h ough on pocke audio eco de s. Plus he speedway a couple miles down he oad be ween abou 7:30 and 10:30 pm. THAT was he wo s ! VRROOOM!  VRROOOM!\n\n \nZack\nOn Mon, Jun 8, 2009 a 1:39 PM, Rj as e e @yahoo.com> w o e:\n\n\n\n\n\n\n\n\n\nYou po en ially could ha e hea d lo s o hings.Some ha come o mind a e ca s, mice, s uc u al shi s, wea he , bi ds ou side, hea ing o cooling ans, cu ious insec s, a nigh wa chman, sump o plumbing sys ems ... he possibili ies a e endless. \n--- On Mon, 6/8/09, Zack Widup w9sz.zack@...> w o e:\n\nF om: Zack Widup w9sz.zack@...>\nSubjec : Re: [EVP-ITC] New ideas\nTo: EVP-ITC@yahoog oups.comDa e: Monday, June 8, 2009, 10:40 AM \n\n\n\n\nI am cu ious i anyone wi h a mic ophone wi ed o a emo e si e has e e go en any EVP in eal ime.\n \nI  ook pa in an in es iga ion o Ashmo e Es a es, nea Ashmo e IL, on Sa u day nigh . We had six ideo came as se up in he h ee halls o he building. The ideo o all was being moni o ed and eco ded a a cen al loca ion. Alas, we did no ha e mic ophones a he came a si es conec ed o he cen al loca ion. I wonde wha we migh ha e hea d i we did?\n\n \nZack\n \nOn Mon, Jun 8, 2009 a 12:05 PM, h eadsin yme@ juno.com Th eadsin yme@ juno.com> w o e:\n\n \nLe 's jus ag ee o end his discussion abou he ... Why don' we discuss some hing on a ligh e no e? Anyone ha e any new ideas abou ei he e p o ITC? Al"}