{"id": "15045", "subject": "Re: [EVP-ITC] New ideas", "author": "Zack Widup", "timestamp": "2009-06-08T20:43:47Z", "full_text": "You can create a wave in anything. You can create a wave in a rope by having\na person hold each end and then having one person wiggle the rope. You can\ncreate a wave in a lake by dropping a rock into it. The thing that carries\nthe wave is the propagating medium. In these examples it&#39;s the rope and\nwater respectively.\n\nIn the case of sound, the propagating medium is the air. It is a\nlongitudinal pressure wave. It cannot be picked up on a receiver that is\ncapable of receiving the same frequencies as electromagnetic waves.\n\nThere are receivers and antennas that can pick up electromagnetic waves of\nthe same frequencies as sound waves. But in this case, the propagating\nmedium is the aether. They are transverse electromagnetic waves and you\ncan&#39;t hear them.\nThe electromagnetic spectrum extends from sub-audible frequencies all the\nway up to the frequencies of X-rays and cosmic rays. Different methods exist\nto detect or receive different parts of this spectrum. I&#39;m involved in a ULF\ngroup that specializes in receiving electromagnetic waves of the Schumann\nresonances which are around 6 Hz, plus or minus.\n\nZack\n\n\n\nOn Mon, Jun 8, 2009 at 2:38 PM, Frank Ratka &lt;warrior18eii@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;    It sounds like she&#39;s saying &quot;one, two, .....&quot;\n&gt;\n&gt; A mistake that a lot of people make is thinking that there are two\n&gt; different types of energy at work when it comes to sound waves and\n&gt; electromagnetic waves. The only thing that seperates them is frequency and\n&gt; power. Radio waves are radio waves because they occupy a certain block of\n&gt; the electromagnietic spectrum. Sound waves exist on that same spectrum just\n&gt; farther down with much longer waves. Soundwaves and subsonic waves can\n&gt; penetrate almost anything because of their wavelengths. The shorter the\n&gt; wavelength the more ways we can shield against them.\n&gt;\n&gt; Think of microwaves. These are also a type of radio and telemetry\n&gt; transmitting wave but the waves also have a physical effect on our\n&gt; environment by causing molecules to speed up, which creates heat. A little\n&gt; lower than this is IR or infrared it too can cause physical objects to heat\n&gt; up but usually it just causes molecules to rotate in place. All physical\n&gt; things give off IR light. Its a way the total system conserves energy by\n&gt; spontaneously emitting IR radiation.\n&gt;\n&gt; Frank R.\n&gt;\n&gt; --- On *Mon, 6/8/09, April Abercrombie &lt;april@...\n&gt; &gt;* wrote:\n&gt;\n&gt;\n&gt; From: April Abercrombie &lt;april@...&gt;\n&gt; Subject: Re: [EVP-ITC] New ideas [3 Attachments]\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Monday, June 8, 2009, 2:27 PM\n&gt;\n&gt;   Here is some food for thought. I am currently reviewing my audio from\n&gt; our May 30th investigation.\n&gt;\n&gt; It was me and another girl teammate present in the room. I picked up a 3rd\n&gt; female voice on my digital voice recorder that I carry with me. We were\n&gt; standing right next to another digital video recorder that I leave beside my\n&gt; night vision camera. That recorder did not pick up this 3rd voice. I have\n&gt; asked the girl that was with me to check her recording to see if she picked\n&gt; it up.\n&gt;\n&gt; I have long felt the true EVP does not come from sound waves in the\n&gt; environment, or then it wouldn&#39;t be EVP, but a disembodied voice. Somehow\n&gt; EVP&#39;s are appearing directly on the recordings.\n&gt;\n&gt; This instance with the recorders may back that theory up. That other\n&gt; recorder should have picked that voice up if it were sound waves in the\n&gt; environment.\n&gt;\n&gt; I am attaching the clip of this 3rd voice. The file that is named &quot;01-02-17\n&gt; Clip&quot; is the full clip. You will hear my voice as I say &quot;Yeah&quot;, and then\n&gt; another comes in right after that. I think I know what it says.\n&gt;\n&gt; Again, I was live monitoring my audio, but still did not hear this until\n&gt; playback. It isn&#39;t clear, so I am not as excited about it as my one&#39;s from\n&gt; the last investigation.\n&gt;\n&gt;\n&gt;\n&gt;  ----- Original Message -----\n&gt; *From:* Frank Ratka&lt;http://us.mc01g.mail.yahoo.com/mc/compose?to=warrior18eii@...&gt;\n&gt; *To:* EVP-ITC@yahoogroups .com&lt;http://us.mc01g.mail.yahoo.com/mc/compose?to=EVP-ITC@yahoogroups.com&gt;\n&gt;  *Sent:* Monday, June 08, 2009 1:09 PM\n&gt; *Subject:* Re: [EVP-ITC] New ideas\n&gt;\n&gt;     I have a running theory that EVP is carried on an untrasonic wave and\n&gt; demodulated exactly where they want it to manifest. It works off the\n&gt; heterodyne principle. If you mix two ultrasonic waves that differ one\n&gt; another in frequency then if you add or subtract them together you get a\n&gt; beat frequency or alternate frequency. For example, if a ghost is sending a\n&gt; signal at 54KHz and you have an electric fan in a room creating an\n&gt; untrasonic frequency at 45KHz then you will have a intermediate\n&gt; difference frequency at 9KHz, well within human hearing range (20Hz to\n&gt; 20KHz). This was just an example, but all electronic equipment generates\n&gt; ultrasonic signals just by turning them on. From this theory I always felt\n&gt; that EVP were generated within a few inches of the recorder.\n&gt;\n&gt; We are able to reproduce this affect in not only radio with superheterodyne\n&gt; systems but also with acoustics and audio as in some passive sonars and a\n&gt; commercial produce called the &quot;audio spotlight&quot; by Dr. Joseph Pompeii.\n&gt;\n&gt;  Frank R.\n&gt;\n&gt; --- On *Mon, 6/8/09, Zack Widup &lt;w9sz.zack@gmail. com&gt;* wrote:\n&gt;\n&gt;\n&gt; From: Zack Widup &lt;w9sz.zack@gmail. com&gt;\n&gt; Subject: Re: [EVP-ITC] New ideas\n&gt; To: EVP-ITC@yahoogroups .com\n&gt; Date: Monday, June 8, 2009, 1:56 PM\n&gt;\n&gt;   Fascinating! I&#39;ve had this idea that the EVP are often not recorded by\n&gt; the microphone but somehow make their way in at the actual point where the\n&gt; storage is made, whether it be analog (tape) or digital.\n&gt; So much we don&#39;t know ...\n&gt;\n&gt; Zack\n&gt;\n&gt;\n&gt;  On Mon, Jun 8, 2009 at 1:39 PM, April Abercrombie &lt;april@abercrombiegh\n&gt; ostresearch. com&lt;http://us.mc01g.mail.yahoo.com/mc/compose?to=april@...&gt;\n&gt; &gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;  I monitor my audio live. The funny thing is that even so, those last\n&gt;&gt; EVP&#39;s I captured I did not hear either in the environment, or on my\n&gt;&gt; recording as it happened. I only heard them upon playback.\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;  ----- Original Message -----\n&gt;&gt; *From:* Zack Widup&lt;http://us.mc01g.mail.yahoo.com/mc/compose?to=w9sz.zack@...&gt;\n&gt;&gt;  *To:* EVP-ITC@yahoogroups .com&lt;http://us.mc01g.mail.yahoo.com/mc/compose?to=EVP-ITC@yahoogroups.com&gt;\n&gt;&gt;   *Sent:* Monday, June 08, 2009 11:40 AM\n&gt;&gt; *Subject:* Re: [EVP-ITC] New ideas\n&gt;&gt;\n&gt;&gt;   I am curious if anyone with a microphone wired to a remote site has\n&gt;&gt; ever gotten any EVP in real time.\n&gt;&gt;\n&gt;&gt; I took part in an investigation of Ashmore Estates, near Ashmore IL, on\n&gt;&gt; Saturday night. We had six video cameras set up in the three halls of the\n&gt;&gt; building. The video for all was being monitored and recorded at a central\n&gt;&gt; location. Alas, we did not have microphones at the camera sites conected to\n&gt;&gt; the central location. I wonder what we might have heard if we did?\n&gt;&gt;\n&gt;&gt; Zack\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; On Mon, Jun 8, 2009 at 12:05 PM, threadsintyme@ juno.com&lt;http://us.mc01g.mail.yahoo.com/mc/compose?to=threadsintyme@...&gt;\n&gt;&gt; &lt;Threadsintyme@ juno.com&lt;http://us.mc01g.mail.yahoo.com/mc/compose?to=Threadsintyme@...&gt;\n&gt;&gt; &gt; wrote:\n&gt;&gt;\n&gt;&gt; Let&#39;s just agree to end this discussion about her...\n&gt;&gt; Why don&#39;t we discuss something on a lighter note? Anyone have any new\n&gt;&gt; ideas about either evp or ITC?\n&gt;&gt; Al\n&gt;&gt;\n&gt;&gt;\n&gt;\n&gt;\n&gt; \n&gt;\n\nYou can c ea e a wa e in any hing. You can c ea e a wa e in a ope by ha ing a pe son hold each end and hen ha ing one pe son wiggle he ope. You can c ea e a wa e in a lake by d opping a ock in o i . The hing ha ca ies he wa e is he p opaga ing medium. In hese examples i 's he ope and wa e espec i ely.\n\n \nIn he case o sound, he p opaga ing medium is he ai . I is a longi udinal p essu e wa e. I canno be picked up on a ecei e ha is capable o ecei ing he same equencies as elec omagne ic wa es.\n \nThe e a e ecei e s and an ennas ha can pick up elec omagne ic wa es o he same equencies as sound wa es. Bu in his case, he p opaga ing medium is he ae he . They a e ans e se elec omagne ic wa es and you can' hea hem.\n\nThe elec omagne ic spec um ex ends om sub-audible equencies all he way up o he equencies o X- ays and cosmic ays. Di e en me hods exis o de ec o ecei e di e en pa s o his spec um. I'm in ol ed in a ULF g oup ha specializes in ecei ing elec omagne ic wa es o he Schumann esonances which a e a ound 6 Hz, plus o minus.\n\n \nZack\n \n \nOn Mon, Jun 8, 2009 a 2:38 PM, F ank Ra ka wa io 18eii@yahoo.com> w o e:\n\n\n\n\n\n\n\n\n\n\nI sounds like she's saying \"one, wo, .....\"\n \nA mis ake ha a lo o people make is hinking ha he e a e wo di e en ypes o ene gy a wo k when i comes o sound wa es and elec omagne ic wa es. The only hing ha sepe a es hem is equency and powe . Radio wa es a e adio wa es because hey occupy a ce ain block o he elec omagnie ic spec um. Sound wa es exis on ha same spec um jus a he down wi h much longe wa es. Soundwa es and subsonic wa es can pene a e almos any hing because o hei wa eleng hs. The sho e he wa eleng h he mo e ways we can shield agains hem.\n\n \nThink o mic owa es. These a e also a ype o adio and eleme y ansmi ing wa e bu he wa es also ha e a physical e ec on ou en i onmen by causing molecules o speed up, which c ea es hea . A li le lowe han his is IR o in a ed i oo can cause physical objec s o hea up bu usually i jus causes molecules o o a e in place. All physical hings gi e o IR ligh . I s a way he o al sys em conse es ene gy by spon aneously emi ing IR adia ion.\n\n \nF ank R. \n--- On Mon, 6/8/09, Ap il Abe c ombie ap il@abe c ombieghos esea ch.com> w o e:\n\nF om: Ap il Abe c ombie ap il@...>Subjec : Re: [EVP-ITC] New ideas [3 A achmen s] \nTo: EVP-ITC@yahoog oups.comDa e: Monday, June 8, 2009, 2:27 PM\n\n\n\nHe e is some ood o hough . I am cu en ly e iewing my audio om ou May 30 h in es iga ion.\n \nI was me and ano he gi l eamma e p esen in he oom. I picked up a 3 d emale oice on my digi al oice eco de ha I ca y wi h me. We we e s anding igh nex o ano he digi al ideo eco de ha I lea e beside my nigh ision came a. Tha eco de did no pick up his 3 d oice. I ha e asked he gi l ha was wi h me o check he eco ding o see i she picked i up.\n\n \nI ha e long el he ue EVP does no come om sound wa es in he en i onmen , o hen i wouldn' be EVP, bu a disembodied oice. Somehow EVP's a e appea ing di ec ly on he eco dings.\n\n \nThis ins ance wi h he eco de s may back ha heo y up. Tha o he eco de should ha e picked ha oice up i i we e sound wa es in he en i onmen .\n \nI am a aching he clip o his 3 d oice. The  ile ha is named \"01-02-17 Clip\" is he ull clip. You will hea my oice as I say \"Yeah\", and hen ano he comes in igh a e ha . I hink I know wha i says.\n\n \nAgain, I was li e moni o ing my audio, bu s ill did no hea his un il playback. I isn' clea , so I am no as exci ed abou i as my one's om he las in es iga ion.\n\n \n \n\n\n----- O iginal Message ----- \nF om: F ank Ra ka \n\nTo: EVP-ITC@yahoog oups .com \n\n\nSen : Monday, June 08, 2009 1:09 PM\nSubjec : Re: [EVP-ITC] New ideas\n\n\n\n\n\n\n\n\nI ha e a unning heo y ha EVP is ca ied on an un asonic wa e and demodula ed exac ly whe e hey wan i o mani es . I wo ks o he he e odyne p inciple. I you mix wo ul asonic wa es ha di e one ano he in equency hen i you add o sub ac hem oge he you ge a bea equency o al e na e equency. Fo example, i a ghos is sending a signal a 54KHz and you ha e an elec ic an in a oom c ea ing an un asonic equency a 45KHz hen you will ha e a in e media e di e ence  equency a 9KHz, well wi hin human hea ing ange (20Hz o 20KHz). This was jus an example, bu all elec onic equipmen gene a es ul asonic signals jus by u ning hem on. F om his heo y I always el ha EVP we e gene a ed wi hin a ew inches o he eco de .\n\n \nWe a e able o ep oduce his a ec in no only adio wi h supe he e odyne sys ems bu also wi h acous ics and audio as in some passi e sona s and a comme cial p oduce called he \"audio spo ligh \" by D . Joseph Pompeii.\n\n \n\nF ank R.--- On Mon, 6/8/09, Zack Widup w o e:\n\nF om: Zack Widup Subjec : Re: [EVP-ITC] New ideasTo: EVP-ITC@yahoog oups .comDa e: Monday, June 8, 2009, 1:56 PM\n\n\n\n\nFascina ing! I' e had his idea ha he EVP a e o en no eco ded by he mic ophone bu somehow make hei way in a he ac ual poin whe e he s o age is made, whe he i be analog ( ape) o digi al. \n\nSo much we don' know ...\n \nZack\n \n\nOn Mon, Jun 8, 2009 a 1:39 PM, Ap il Abe c ombie ap il@abe c ombiegh os esea ch. com> w o e:\n\n\n\n\n\n\n\n\nI moni o my audio li e. The unny hing is ha e en so, hose las EVP's I cap u ed I did no hea ei he in he en i onmen , o on my eco ding as i happened. I only hea d hem upon playback.\n\n \n\n\n\n----- O iginal Message ----- \nF om: Zack Widup \n\n\n\nTo: EVP-ITC@yahoog oups .com \n\n\n\n\n\nSen : Monday, June 08, 2009 11:40 AM\nSubjec : Re: [EVP-ITC] New ideas\n\n\n\n\nI am cu ious i anyone wi h a mic ophone wi ed o a emo e si e has e e go en any EVP in eal ime.\n \nI  ook pa in an in es iga ion o Ashmo e Es a es, nea Ashmo e IL, on Sa u day nigh . We had six ideo came as se up in he h ee halls o he building. The ideo o all was being moni o ed and eco ded a a cen al loca ion. Alas, we did no ha e mic ophones a he came a si es conec ed o he cen al loca ion. I wonde wha we migh ha e hea d i we did?\n\n \nZack\n \nOn Mon, Jun 8, 2009 a 12:05 PM, h eadsin yme@ juno.com Th eadsin yme@ juno.com> w o e:\n\n \nLe 's jus ag ee o end his discussion abou he ... Why don' we discuss some hing on a ligh e no e? Anyone ha e any new ideas abou ei he e p o ITC? Al"}