{"id": "15069", "subject": "Re: [EVP-ITC] New ideas", "author": "Frank Ratka", "timestamp": "2009-06-09T13:05:42Z", "full_text": "--0-702625118-1244552742=:52269\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nThe name aether is sometimes still used but now it is called cosmic backgro=\r\nund radiation, primordial energy gradient=A0or more recently the zero-point=\r\n field. The only way it can be proven to exist is in reference to accelerat=\r\nion. The zero-point field is theories to penetrate all things accept for a =\r\ncharged medium, which instead gives you a distortion field in the zero-poin=\r\nt field we call a magnetic field. The zero-point field is the &quot;canvas&quot; that=\r\n the universe and all matter is painted on. It is the only thing that still=\r\n oscillates at absolute zero when all other systems cease to move. This osc=\r\nillation is called a funny word called &quot;zitterbewegung&quot; motion.\n=A0\nOf cour=\r\nse all this is theorized but it seems to fit the math and is being used by =\r\nmany physicists in research today in the field of quantum electrodynamics. =\r\nSome of the researchers studying this are Dr. Harold Puthoff, Dr. Michael I=\r\nbison, Dr. Bernard Haisch and many others who also have differing opinion o=\r\nn howit works but not whether it exists or not. This seems to have been dee=\r\nmed, accepted theory.\n=A0\nFrank R.\n\n--- On Mon, 6/8/09, Rj &lt;rasterer@yahoo.=\r\ncom&gt; wrote:\n\n\nFrom: Rj &lt;rasterer@...&gt;\nSubject: Re: [EVP-ITC] New idea=\r\ns\nTo: EVP-ITC@yahoogroups.com\nDate: Monday, June 8, 2009, 4:17 PM\n\n\n\n\n\n\n\n\n\n=\r\n\n\n\nI&#39;m not sure what you mean by &quot;Aether&quot;.=A0 EM can propagate through a va=\r\ncuum: it needs no medium like your other examples.=A0 It, in a sense, creat=\r\nes its own medium as electric and magnetic forces interact with each other,=\r\n causing a wave in that interaction that is moving outward from the source.=\r\n=A0 Early physics theories of something called the aether have, as far as I=\r\n can tell, been abandoned (it seems Einstein had a lot to do with that).\n\n\n=\r\n\n\n\n\n\n\n\n\n\n\nFrom: Zack Widup &lt;w9sz.zack@gmail. com&gt;\nTo: EVP-ITC@yahoogroups .=\r\ncom\nSent: Monday, June 8, 2009 3:43:47 PM\nSubject: Re: [EVP-ITC] New ideas\n=\r\n\n\n\n\nYou can create a wave in anything. You can create a wave in a rope by h=\r\naving a person hold each end and then having one person wiggle the rope. Yo=\r\nu can create a wave in a lake by dropping a rock into it. The thing that ca=\r\nrries the wave is the propagating medium. In these examples it&#39;s the rope a=\r\nnd water respectively.\n=A0\nIn the case of sound, the propagating medium is =\r\nthe air. It is a longitudinal pressure wave. It cannot be picked up on a re=\r\nceiver that is capable of receiving the same frequencies as electromagnetic=\r\n waves.\n=A0\nThere are receivers and antennas that can pick up electromagnet=\r\nic waves of the same frequencies as sound waves. But in this case, the prop=\r\nagating medium is the aether. They are transverse electromagnetic waves and=\r\n you can&#39;t hear them.\n\nThe electromagnetic spectrum extends from sub-audibl=\r\ne frequencies all the way up to the frequencies of X-rays and cosmic rays. =\r\nDifferent methods exist to detect or receive different parts of this spectr=\r\num. I&#39;m involved in a ULF group that specializes in receiving electromagnet=\r\nic waves of the Schumann resonances which are around 6 Hz, plus or minus.\n=\r\n=A0\nZack\n=A0\n\n=A0\nOn Mon, Jun 8, 2009 at 2:38 PM, Frank Ratka &lt;warrior18eii=\r\n@ yahoo.com&gt; wrote:\n\n\n\n\n\n\n\n\n\n\n\n\n\nIt sounds like she&#39;s saying &quot;one, two, ...=\r\n..&quot;\n=A0\nA mistake that a lot of people make is thinking that there are two =\r\ndifferent types of energy at work when it comes to sound waves and electrom=\r\nagnetic waves. The only thing that seperates them is frequency and power. R=\r\nadio waves are radio waves because they occupy a certain block of the elect=\r\nromagnietic spectrum. Sound waves exist on that same spectrum just farther =\r\ndown with much longer waves. Soundwaves and subsonic waves can penetrate al=\r\nmost anything because of their wavelengths. The shorter the wavelength the =\r\nmore ways we can shield against them.\n=A0\nThink of microwaves. These are al=\r\nso a type of radio and telemetry transmitting wave but the waves also have =\r\na physical effect on our environment by causing molecules to speed up, whic=\r\nh creates heat. A little lower than this is IR or infrared it too can cause=\r\n physical objects to heat up but usually it just causes molecules to rotate=\r\n in place. All physical things give off IR light. Its a way the total syste=\r\nm conserves energy by spontaneously emitting IR radiation.\n=A0\nFrank R. \n\n\n=\r\n--- On Mon, 6/8/09, April Abercrombie &lt;april@abercrombiegh ostresearch. com=\r\n&gt; wrote:\n\n\n\nFrom: April Abercrombie &lt;april@abercrombiegh ostresearch. com&gt;\n=\r\nSubject: Re: [EVP-ITC] New ideas [3 Attachments] \n\nTo: EVP-ITC@yahoogroups =\r\n.com\nDate: Monday, June 8, 2009, 2:27 PM\n\n\n\n\n\nHere is some food for thought=\r\n. I am currently reviewing my audio from our May 30th investigation.\n=A0\nIt=\r\n was me and another girl teammate=A0present in the room. I picked up a 3rd =\r\nfemale voice on my digital voice recorder that I carry with me. We were sta=\r\nnding right next to another digital video recorder that I leave beside my n=\r\night vision camera. That recorder did not pick up this 3rd voice. I have as=\r\nked the girl that was with me to check her recording to see if she picked i=\r\nt up.\n=A0\nI have long felt the true EVP does not come from sound waves in t=\r\nhe environment, or then it wouldn&#39;t be EVP, but a disembodied voice. Someho=\r\nw EVP&#39;s are appearing directly on the recordings.\n=A0\nThis instance with th=\r\ne recorders may back that theory up. That other recorder should have picked=\r\n that voice up if it were sound waves in the environment.\n=A0\nI am attachin=\r\ng the clip of this 3rd voice. The=A0file that is named=A0&quot;01-02-17 Clip&quot; is=\r\n the full clip.=A0You will hear my voice as I say &quot;Yeah&quot;, and then another =\r\ncomes in right after that. I think I know what it says.\n=A0\nAgain, I was li=\r\nve monitoring my audio, but still did not hear this until playback. It isn&#39;=\r\nt clear, so I am not as excited about it as my one&#39;s from the last investig=\r\nation.\n=A0\n=A0\n\n\n----- Original Message ----- \nFrom: Frank Ratka \nTo: EVP-I=\r\nTC@yahoogroups .com \n\nSent: Monday, June 08, 2009 1:09 PM\nSubject: Re: [EVP=\r\n-ITC] New ideas\n\n\n\n\n\n\n\n\n\nI have a running theory that EVP is carried on an =\r\nuntrasonic wave and demodulated exactly where they want it to manifest. It =\r\nworks off the heterodyne principle. If you mix two ultrasonic waves that di=\r\nffer one another in frequency then if you add or subtract them together you=\r\n get a beat frequency or alternate frequency. For example, if a ghost is se=\r\nnding a signal at 54KHz and you have an electric fan in a room creating an =\r\nuntrasonic frequency at 45KHz then you will have a intermediate difference=\r\n=A0frequency at 9KHz, well within human hearing range (20Hz to 20KHz). This=\r\n was just an example, but all electronic equipment generates ultrasonic sig=\r\nnals just by turning them on. From this theory I always felt that EVP were =\r\ngenerated within a few inches of the recorder.\n=A0\nWe are able to reproduce=\r\n this affect in not only radio with superheterodyne systems but also with a=\r\ncoustics and audio as in some passive sonars and a commercial produce calle=\r\nd the &quot;audio spotlight&quot; by Dr. Joseph Pompeii.\n=A0\n\nFrank R.\n\n--- On Mon, 6=\r\n/8/09, Zack Widup &lt;w9sz.zack@gmail. com&gt; wrote:\n\n\n\nFrom: Zack Widup &lt;w9sz.z=\r\nack@gmail. com&gt;\nSubject: Re: [EVP-ITC] New ideas\nTo: EVP-ITC@yahoogroups .c=\r\nom\nDate: Monday, June 8, 2009, 1:56 PM\n\n\n\n\n\n\nFascinating! I&#39;ve had this ide=\r\na that the EVP are often=A0not recorded by the microphone but somehow make =\r\ntheir way in at the actual=A0point where the storage is made, whether it be=\r\n analog (tape) or digital.=A0\n\nSo much we don&#39;t know ...\n=A0\nZack\n\n=A0\n\nOn =\r\nMon, Jun 8, 2009 at 1:39 PM, April Abercrombie &lt;april@abercrombiegh ostrese=\r\narch. com&gt; wrote:\n\n\n\n\n\n\n\n\n\n\nI monitor my audio live. The funny thing is tha=\r\nt even so, those last EVP&#39;s I captured I did not hear either in the environ=\r\nment, or on my recording as it happened. I only heard them upon playback.\n=\r\n=A0\n\n\n\n----- Original Message ----- \nFrom: Zack Widup \n\n\nTo: EVP-ITC@yahoog=\r\nroups .com \n\n\n\n\nSent: Monday, June 08, 2009 11:40 AM\nSubject: Re: [EVP-ITC]=\r\n New ideas\n\n\n\n\n\nI am curious if anyone with a microphone wired to a remote =\r\nsite has ever gotten any EVP in real time.\n=A0\nI=A0took part in=A0an invest=\r\nigation of Ashmore Estates, near Ashmore IL, on Saturday night. We had six =\r\nvideo cameras set up in the three halls of the building. The video for all=\r\n=A0was being monitored and recorded=A0at a central location. Alas, we did n=\r\not have microphones at the camera sites conected to the central location. I=\r\n wonder what we might have heard if we did?\n=A0\nZack\n\n=A0\nOn Mon, Jun 8, 20=\r\n09 at 12:05 PM, threadsintyme@ juno.com &lt;Threadsintyme@ juno.com&gt; wrote:\n\n=\r\n=A0\nLet&#39;s just agree to end this discussion about her... \nWhy don&#39;t we disc=\r\nuss something on a lighter note? Anyone have any new ideas about either evp=\r\n or ITC? \nAl\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n      \r\n--0-702625118-1244552742=:52269\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;DIV&gt;The name aether is sometimes still used =\r\nbut now it is called cosmic background radiation, primordial energy gradien=\r\nt&nbsp;or more recently the zero-point field. The only way it can be proven=\r\n to exist is in reference to acceleration. The zero-point field is theories=\r\n to penetrate all things accept for a charged medium, which instead gives y=\r\nou a distortion field in the zero-point field we call a magnetic field. The=\r\n zero-point field is the &quot;canvas&quot; that the universe and all matter is paint=\r\ned on. It is the only thing that still oscillates at absolute zero when all=\r\n other systems cease to move. This oscillation is called a funny word calle=\r\nd &quot;zitterbewegung&quot; motion.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Of course all this =\r\nis theorized but it seems to fit the math and is being used by many physici=\r\nsts in research today in the field of quantum electrodynamics. Some of the =\r\nresearchers studying this are Dr. Harold Puthoff, Dr. Michael Ibison, Dr. B=\r\nernard Haisch and many others who also have differing opinion on howit work=\r\ns but not whether it exists or not. This seems to have been deemed, accepte=\r\nd theory.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Frank R.&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Mon, 6/8/0=\r\n9, Rj &lt;I&gt;&lt;rasterer@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;&lt;/DIV&gt;\n&lt;BLOCKQUOTE st=\r\nyle=3D&quot;BORDER-LEFT: rgb(16,16,255) 2px solid; PADDING-LEFT: 5px; MARGIN-LEF=\r\nT: 5px&quot;&gt;&lt;BR&gt;From: Rj &lt;rasterer@...&gt;&lt;BR&gt;Subject: Re: [EVP-ITC] N=\r\new ideas&lt;BR&gt;To: EVP-ITC@yahoogroups.com&lt;BR&gt;Date: Monday, June 8, 2009, 4:17=\r\n PM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3Dyiv1551901971&gt;\n&lt;DIV id=3Dygrp-text&gt;\n&lt;DIV&gt;\n&lt;TABLE bord=\r\ner=3D0 cellSpacing=3D0 cellPadding=3D0&gt;\n&lt;TBODY&gt;\n&lt;TR&gt;\n&lt;TD vAlign=3Dtop&gt;I&#39;m n=\r\not sure what you mean by &quot;Aether&quot;.&nbsp; EM can propagate through a vacuum:=\r\n it needs no medium like your other examples.&nbsp; It, in a sense, creates=\r\n its own medium as electric and magnetic forces interact with each other, c=\r\nausing a wave in that interaction that is moving outward from the source.&n=\r\nbsp; Early physics theories of something called the aether have, as far as =\r\nI can tell, been abandoned (it seems Einstein had a lot to do with that).&lt;B=\r\nR&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: rgb(16,16,255) 2px solid&quot;&gt;\n&lt;DIV id=3Dy=\r\niv1317654747&gt;\n&lt;DIV id=3Dygrp-mlmsg&gt;\n&lt;DIV id=3Dygrp-msg&gt;\n&lt;DIV id=3Dygrp-text=\r\n&gt;\n&lt;DIV style=3D&quot;FONT-FAMILY: arial, helvetica, sans-serif; FONT-SIZE: 12pt&quot;=\r\n&gt;\n&lt;DIV&gt;\n&lt;DIV style=3D&quot;FONT-FAMILY: arial, helvetica, sans-serif; FONT-SIZE:=\r\n 12pt&quot;&gt;&lt;BR&gt;\n&lt;DIV style=3D&quot;BORDER-LEFT: rgb(16,16,255) 2px solid; FONT-FAMIL=\r\nY: times new roman, new york, times, serif; FONT-SIZE: 12pt&quot;&gt;&lt;FONT size=3D2=\r\n face=3DTahoma&gt;\n&lt;HR SIZE=3D1&gt;\n&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: bold&quot;&gt;From:&lt;/S=\r\nPAN&gt;&lt;/B&gt; Zack Widup &lt;w9sz.zack@gmail. com&gt;&lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FONT-=\r\nWEIGHT: bold&quot;&gt;To:&lt;/SPAN&gt;&lt;/B&gt; EVP-ITC@yahoogroups .com&lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;=\r\nFONT-WEIGHT: bold&quot;&gt;Sent:&lt;/SPAN&gt;&lt;/B&gt; Monday, June 8, 2009 3:43:47 PM&lt;BR&gt;&lt;B&gt;&lt;=\r\nSPAN style=3D&quot;FONT-WEIGHT: bold&quot;&gt;Subject:&lt;/SPAN&gt;&lt;/B&gt; Re: [EVP-ITC] New idea=\r\ns&lt;BR&gt;&lt;/FONT&gt;&lt;BR&gt;\n&lt;DIV id=3Dygrp-text&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;You can create a wav=\r\ne in anything. You can create a wave in a rope by having a person hold each=\r\n end and then having one person wiggle the rope. You can create a wave in a=\r\n lake by dropping a rock into it. The thing that carries the wave is the pr=\r\nopagating medium. In these examples it&#39;s the rope and water respectively.&lt;/=\r\nDIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;In the case of sound, the propagating medium is=\r\n the air. It is a longitudinal pressure wave. It cannot be picked up on a r=\r\neceiver that is capable of receiving the same frequencies as electromagneti=\r\nc waves.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;There are receivers and antennas that=\r\n can pick up electromagnetic waves of the same frequencies as sound waves. =\r\nBut in this case, the propagating medium is the aether. They are transverse=\r\n electromagnetic waves and you can&#39;t hear them.&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;The electrom=\r\nagnetic spectrum extends from sub-audible frequencies all the way up to the=\r\n frequencies of X-rays and cosmic rays. Different methods exist to detect o=\r\nr receive different parts of this spectrum. I&#39;m involved in a ULF group tha=\r\nt specializes in receiving electromagnetic waves of the Schumann resonances=\r\n which are around 6 Hz, plus or minus.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Zack&lt;/D=\r\nIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV class=3Dgmail_quote&gt;On Mon=\r\n, Jun 8, 2009 at 2:38 PM, Frank Ratka &lt;SPAN dir=3Dltr&gt;&lt;&lt;A rel=3Dnofollow=\r\n&gt;warrior18eii@ yahoo.com&lt;/A&gt;&gt;&lt;/SPAN&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D&quot;BOR=\r\nDER-LEFT: rgb(204,204,204) 1px solid&quot; class=3Dgmail_quote&gt;\n&lt;DIV style=3D&quot;BA=\r\nCKGROUND-COLOR: rgb(255,255,255)&quot;&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;DIV&gt;\n&lt;TABLE b=\r\norder=3D0 cellSpacing=3D0 cellPadding=3D0&gt;\n&lt;TBODY&gt;\n&lt;TR&gt;\n&lt;TD vAlign=3Dtop&gt;\n&lt;=\r\nDIV&gt;It sounds like she&#39;s saying &quot;one, two, .....&quot;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;=\r\nDIV&gt;A mistake that a lot of people make is thinking that there are two diff=\r\nerent types of energy at work when it comes to sound waves and electromagne=\r\ntic waves. The only thing that seperates them is frequency and power. Radio=\r\n waves are radio waves because they occupy a certain block of the electroma=\r\ngnietic spectrum. Sound waves exist on that same spectrum just farther down=\r\n with much longer waves. Soundwaves and subsonic waves can penetrate almost=\r\n anything because of their wavelengths. The shorter the wavelength the more=\r\n ways we can shield against them.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Think of mic=\r\nrowaves. These are also a type of radio and telemetry transmitting wave but=\r\n the waves also have a physical effect on our environment by causing molecu=\r\nles to speed up, which creates heat. A little lower than this is IR or infr=\r\nared it too can cause physical objects to heat up but usually it just cause=\r\ns molecules to rotate in place. All physical things give off IR light. Its =\r\na way the total system conserves energy by spontaneously emitting IR radiat=\r\nion.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Frank R. \n&lt;DIV class=3Dim&gt;&lt;BR&gt;&lt;BR&gt;--- On =\r\n&lt;B&gt;Mon, 6/8/09, April Abercrombie &lt;I&gt;&lt;&lt;A rel=3Dnofollow&gt;april@abercrombi=\r\negh ostresearch. com&lt;/A&gt;&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;BLOCKQUOTE sty=\r\nle=3D&quot;BORDER-LEFT: rgb(16,16,255) 2px solid&quot;&gt;\n&lt;DIV class=3Dim&gt;&lt;BR&gt;From: Apr=\r\nil Abercrombie &lt;&lt;A rel=3Dnofollow&gt;april@abercrombiegh ostresearch. com&lt;/=\r\nA&gt;&gt;&lt;BR&gt;&lt;/DIV&gt;Subject: Re: [EVP-ITC] New ideas [3 Attachments] \n&lt;DIV clas=\r\ns=3Dim&gt;&lt;BR&gt;To: &lt;A rel=3Dnofollow&gt;EVP-ITC@yahoogroups .com&lt;/A&gt;&lt;BR&gt;&lt;/DIV&gt;Date=\r\n: Monday, June 8, 2009, 2:27 PM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;FONT size=\r\n=3D2 face=3D&quot;Myriad Pro&quot;&gt;Here is some food for thought. I am currently revi=\r\newing my audio from our May 30th investigation.&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT siz=\r\ne=3D2 face=3D&quot;Myriad Pro&quot;&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 face=3D&quot;M=\r\nyriad Pro&quot;&gt;It was me and another girl teammate&nbsp;present in the room. I =\r\npicked up a 3rd female voice on my digital voice recorder that I carry with=\r\n me. We were standing right next to another digital video recorder that I l=\r\neave beside my night vision camera. That recorder did not pick up this 3rd =\r\nvoice. I have asked the girl that was with me to check her recording to see=\r\n if she picked it up.&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 face=3D&quot;Myriad Pro&quot;&gt;=\r\n&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 face=3D&quot;Myriad Pro&quot;&gt;I have long fel=\r\nt the true EVP does not come from sound waves in the environment, or then i=\r\nt wouldn&#39;t be EVP, but a disembodied voice. Somehow EVP&#39;s are appearing dir=\r\nectly on the recordings.&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 face=3D&quot;Myriad Pr=\r\no&quot;&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 face=3D&quot;Myriad Pro&quot;&gt;This instanc=\r\ne with the recorders may back that theory up. That other recorder should ha=\r\nve picked that voice up if it were sound waves in the environment.&lt;/FONT&gt;&lt;/=\r\nDIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 face=3D&quot;Myriad Pro&quot;&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT=\r\n size=3D2 face=3D&quot;Myriad Pro&quot;&gt;I am attaching the clip of this 3rd voice. Th=\r\ne&nbsp;file that is named&nbsp;&quot;01-02-17 Clip&quot; is the full clip.&nbsp;You w=\r\nill hear my voice as I say &quot;Yeah&quot;, and then another comes in right after th=\r\nat. I think I know what it says.&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 face=3D&quot;M=\r\nyriad Pro&quot;&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 face=3D&quot;Myriad Pro&quot;&gt;Agai=\r\nn, I was live monitoring my audio, but still did not hear this until playba=\r\nck. It isn&#39;t clear, so I am not as excited about it as my one&#39;s from the la=\r\nst investigation.&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 face=3D&quot;Myriad Pro&quot;&gt;&lt;/FO=\r\nNT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 face=3D&quot;Myriad Pro&quot;&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;=\r\n\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: rgb(0,0,0) 2px solid&quot; dir=3Dltr&gt;\n&lt;DIV cl=\r\nass=3Dim&gt;\n&lt;DIV style=3D&quot;FONT-VARIANT: normal; FONT-STYLE: normal; FONT-FAMI=\r\nLY: arial; FONT-SIZE: 10pt; FONT-WEIGHT: normal; font-size-adjust: none&quot;&gt;--=\r\n--- Original Message ----- &lt;/DIV&gt;\n&lt;DIV style=3D&quot;FONT-VARIANT: normal; FONT-=\r\nSTYLE: normal; FONT-FAMILY: arial; FONT-SIZE: 10pt; FONT-WEIGHT: normal; fo=\r\nnt-size-adjust: none&quot;&gt;&lt;B&gt;From:&lt;/B&gt; &lt;A title=3Dwarrior18eii@... href=\r\n=3D&quot;http://us.mc01g.mail.yahoo.com/mc/compose?to=3Dwarrior18eii@...&quot; =\r\nrel=3Dnofollow target=3D_blank&gt;Frank Ratka&lt;/A&gt; &lt;/DIV&gt;\n&lt;DIV style=3D&quot;FONT-VA=\r\nRIANT: normal; FONT-STYLE: normal; FONT-FAMILY: arial; FONT-SIZE: 10pt; FON=\r\nT-WEIGHT: normal; font-size-adjust: none&quot;&gt;&lt;B&gt;To:&lt;/B&gt; &lt;A title=3DEVP-ITC@yah=\r\noogroups.com href=3D&quot;http://us.mc01g.mail.yahoo.com/mc/compose?to=3DEVP-ITC=\r\n@yahoogroups.com&quot; rel=3Dnofollow target=3D_blank&gt;EVP-ITC@yahoogroups .com&lt;/=\r\nA&gt; &lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV class=3Dim&gt;\n&lt;DIV style=3D&quot;FONT-VARIANT: normal; FONT-S=\r\nTYLE: normal; FONT-FAMILY: arial; FONT-SIZE: 10pt; FONT-WEIGHT: normal; fon=\r\nt-size-adjust: none&quot;&gt;&lt;B&gt;Sent:&lt;/B&gt; Monday, June 08, 2009 1:09 PM&lt;/DIV&gt;\n&lt;DIV =\r\nstyle=3D&quot;FONT-VARIANT: normal; FONT-STYLE: normal; FONT-FAMILY: arial; FONT=\r\n-SIZE: 10pt; FONT-WEIGHT: normal; font-size-adjust: none&quot;&gt;&lt;B&gt;Subject:&lt;/B&gt; R=\r\ne: [EVP-ITC] New ideas&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;TABLE borde=\r\nr=3D0 cellSpacing=3D0 cellPadding=3D0&gt;\n&lt;TBODY&gt;\n&lt;TR&gt;\n&lt;TD vAlign=3Dtop&gt;\n&lt;DIV =\r\nclass=3Dim&gt;\n&lt;DIV&gt;I have a running theory that EVP is carried on an untrason=\r\nic wave and demodulated exactly where they want it to manifest. It works of=\r\nf the heterodyne principle. If you mix two ultrasonic waves that differ one=\r\n another in frequency then if you add or subtract them together you get a b=\r\neat frequency or alternate frequency. For example, if a ghost is sending a =\r\nsignal at 54KHz and you have an electric fan in a room creating an untrason=\r\nic frequency at 45KHz then you will have a intermediate difference&nbsp;fre=\r\nquency at 9KHz, well within human hearing range (20Hz to 20KHz). This was j=\r\nust an example, but all electronic equipment generates ultrasonic signals j=\r\nust by turning them on. From this theory I always felt that EVP were genera=\r\nted within a few inches of the recorder.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;We ar=\r\ne able to reproduce this affect in not only radio with superheterodyne syst=\r\nems but also with acoustics and audio as in some passive sonars and a comme=\r\nrcial produce called the &quot;audio spotlight&quot; by Dr. Joseph Pompeii.&lt;/DIV&gt;\n&lt;DI=\r\nV&gt;&nbsp;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV class=3Dim&gt;\n&lt;DIV&gt;Frank R.&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Mon, 6=\r\n/8/09, Zack Widup &lt;I&gt;&lt;w9sz.zack@gmail. com&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;&lt;/DIV&gt;&lt;=\r\n/DIV&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: rgb(16,16,255) 2px solid&quot;&gt;\n&lt;DIV cla=\r\nss=3Dim&gt;&lt;BR&gt;From: Zack Widup &lt;w9sz.zack@gmail. com&gt;&lt;BR&gt;Subject: Re: [=\r\nEVP-ITC] New ideas&lt;BR&gt;To: EVP-ITC@yahoogroups .com&lt;BR&gt;&lt;/DIV&gt;Date: Monday, J=\r\nune 8, 2009, 1:56 PM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV class=3Dim&gt;\n&lt;DIV&gt;Fascin=\r\nating! I&#39;ve had this idea that the EVP are often&nbsp;not recorded by the m=\r\nicrophone but somehow make their way in at the actual&nbsp;point where the =\r\nstorage is made, whether it be analog (tape) or digital.&nbsp;&lt;BR&gt;&lt;/DIV&gt;\n&lt;D=\r\nIV&gt;So much we don&#39;t know ...&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;Zack&lt;/DIV&gt;\n=\r\n&lt;DIV&gt;&lt;BR&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV class=3Dgmail_quote&gt;\n&lt;DIV class=3Dim&gt;On Mon, Jun=\r\n 8, 2009 at 1:39 PM, April Abercrombie &lt;SPAN dir=3Dltr&gt;&lt;&lt;A href=3D&quot;http:=\r\n//us.mc01g.mail.yahoo.com/mc/compose?to=3Dapril@...=\r\nm&quot; rel=3Dnofollow target=3D_blank&gt;april@abercrombiegh ostresearch. com&lt;/A&gt;&=\r\ngt;&lt;/SPAN&gt; wrote:&lt;BR&gt;&lt;/DIV&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: rgb(204,204,2=\r\n04) 1px solid&quot; class=3Dgmail_quote&gt;\n&lt;DIV style=3D&quot;BACKGROUND-COLOR: rgb(255=\r\n,255,255)&quot;&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;DIV&gt;\n&lt;DIV class=3Dim&gt;\n&lt;DIV&gt;&lt;FONT siz=\r\ne=3D2 face=3D&quot;Myriad Pro&quot;&gt;I monitor my audio live. The funny thing is that =\r\neven so, those last EVP&#39;s I captured I did not hear either in the environme=\r\nnt, or on my recording as it happened. I only heard them upon playback.&lt;/FO=\r\nNT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 face=3D&quot;Myriad Pro&quot;&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;&lt;/DIV&gt;=\r\n\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: rgb(0,0,0) 2px solid&quot; dir=3Dltr&gt;\n&lt;DIV cl=\r\nass=3Dim&gt;\n&lt;DIV&gt;\n&lt;DIV style=3D&quot;FONT-VARIANT: normal; FONT-STYLE: normal; FON=\r\nT-FAMILY: arial; FONT-SIZE: 10pt; FONT-WEIGHT: normal; font-size-adjust: no=\r\nne&quot;&gt;----- Original Message ----- &lt;/DIV&gt;\n&lt;DIV style=3D&quot;FONT-VARIANT: normal;=\r\n FONT-STYLE: normal; FONT-FAMILY: arial; FONT-SIZE: 10pt; FONT-WEIGHT: norm=\r\nal; font-size-adjust: none&quot;&gt;&lt;B&gt;From:&lt;/B&gt; &lt;A title=3Dw9sz.zack@... hre=\r\nf=3D&quot;http://us.mc01g.mail.yahoo.com/mc/compose?to=3Dw9sz.zack@...&quot; re=\r\nl=3Dnofollow target=3D_blank&gt;Zack Widup&lt;/A&gt; &lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV class=\r\n=3Dim&gt;\n&lt;DIV&gt;\n&lt;DIV style=3D&quot;FONT-VARIANT: normal; FONT-STYLE: normal; FONT-F=\r\nAMILY: arial; FONT-SIZE: 10pt; FONT-WEIGHT: normal; font-size-adjust: none&quot;=\r\n&gt;&lt;B&gt;To:&lt;/B&gt; &lt;A title=3DEVP-ITC@yahoogroups.com href=3D&quot;http://us.mc01g.mail=\r\n.yahoo.com/mc/compose?to=3DEVP-ITC@yahoogroups.com&quot; rel=3Dnofollow target=\r\n=3D_blank&gt;EVP-ITC@yahoogroups .com&lt;/A&gt; &lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;=\r\n\n&lt;DIV&gt;\n&lt;DIV class=3Dim&gt;\n&lt;DIV style=3D&quot;FONT-VARIANT: normal; FONT-STYLE: nor=\r\nmal; FONT-FAMILY: arial; FONT-SIZE: 10pt; FONT-WEIGHT: normal; font-size-ad=\r\njust: none&quot;&gt;&lt;B&gt;Sent:&lt;/B&gt; Monday, June 08, 2009 11:40 AM&lt;/DIV&gt;\n&lt;DIV style=3D=\r\n&quot;FONT-VARIANT: normal; FONT-STYLE: normal; FONT-FAMILY: arial; FONT-SIZE: 1=\r\n0pt; FONT-WEIGHT: normal; font-size-adjust: none&quot;&gt;&lt;B&gt;Subject:&lt;/B&gt; Re: [EVP-=\r\nITC] New ideas&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV class=3Dim&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DI=\r\nV&gt;I am curious if anyone with a microphone wired to a remote site has ever =\r\ngotten any EVP in real time.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I&nbsp;took part =\r\nin&nbsp;an investigation of Ashmore Estates, near Ashmore IL, on Saturday n=\r\night. We had six video cameras set up in the three halls of the building. T=\r\nhe video for all&nbsp;was being monitored and recorded&nbsp;at a central lo=\r\ncation. Alas, we did not have microphones at the camera sites conected to t=\r\nhe central location. I wonder what we might have heard if we did?&lt;/DIV&gt;\n&lt;DI=\r\nV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Zack&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV class=3Dgmail_quo=\r\nte&gt;On Mon, Jun 8, 2009 at 12:05 PM, &lt;A href=3D&quot;http://us.mc01g.mail.yahoo.c=\r\nom/mc/compose?to=3Dthreadsintyme@...&quot; rel=3Dnofollow target=3D_blank&gt;t=\r\nhreadsintyme@ juno.com&lt;/A&gt; &lt;SPAN dir=3Dltr&gt;&lt;&lt;A href=3D&quot;http://us.mc01g.m=\r\nail.yahoo.com/mc/compose?to=3DThreadsintyme@...&quot; rel=3Dnofollow target=\r\n=3D_blank&gt;Threadsintyme@ juno.com&lt;/A&gt;&gt;&lt;/SPAN&gt; wrote:&lt;BR&gt;\n&lt;DIV&gt;&nbsp;&lt;/DI=\r\nV&gt;\n&lt;DIV&gt;Let&#39;s just agree to end this discussion about her... &lt;BR&gt;Why don&#39;t =\r\nwe discuss something on a lighter note? Anyone have any new ideas about eit=\r\nher evp or ITC? &lt;BR&gt;Al&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV=\r\n&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;\n&lt;DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV style=3D&quot;COLOR: white&quot;&gt;&lt;/=\r\nDIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOC=\r\nKQUOTE&gt;&lt;/TD&gt;&lt;/TR&gt;&lt;/TBODY&gt;&lt;/TABLE&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;=\r\n/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/TD&gt;&lt;/TR&gt;&lt;/TBODY&gt;&lt;/TABLE&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV style=3D&quot;=\r\nCOLOR: white&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/=\r\nDIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/TD&gt;&lt;/TR&gt;&lt;/TBODY&gt;=\r\n&lt;/TABLE&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n      \r\n--0-702625118-1244552742=:52269--"}