{"id": "15083", "subject": "Re: [EVP-ITC] New ideas", "author": "Rj", "timestamp": "2009-06-09T19:32:28Z", "full_text": "--0-2080146048-1244575948=:50167\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n\nI have never heard of the aether and the cosmic background radiation being=\r\n called the same thing.=C2=A0 In discussing aether, we were speaking of the=\r\n medium through which EM travels.=C2=A0 Cosmic Background Radiation is EM i=\r\ntself, not the aether medium.=C2=A0 For example, a large part of this radia=\r\ntion is microwave frequencies.=C2=A0 Microwave frequencies are not the aeth=\r\ner.=C2=A0 An old theory was that it traveled through the aether.=C2=A0 But =\r\nmainline science does not put much credence in this theory anymore.\n\nIf you=\r\n have a link where you see the cosmic background radiation and the aether b=\r\neing called the same thing, I=E2=80=99d be happy to look at it.=C2=A0 \n\nI h=\r\nave never heard of the =E2=80=9Cprimordial energy gradient=E2=80=9D. Again,=\r\n if you have a link to a definition of this term, please provide.\n\nThe jury=\r\n is still out on 1) If aether is necessary for EM propagation, and 2) if ZP=\r\nE is analogous to it.=C2=A0 From what I read, mainline science does not cur=\r\nrently accept the concept of Aether, and does not equate ZPE to it.=C2=A0 T=\r\nhere are some efforts to redefine what aether is (which has happened severa=\r\nl times over at least the last 100 years).=C2=A0 It could finally land on a=\r\n definition that is generally accepted.=C2=A0 But so far, it=E2=80=99s not =\r\nquite there.\n\nBut again, if you have links supporting your other statements=\r\n (the aether is cosmic background radiation, or what a =E2=80=9Cprimordial =\r\nenergy gradient=E2=80=9D is), please post.=C2=A0 Thanks.\n\n\n--- On Tue, 6/9/=\r\n09, Frank Ratka &lt;warrior18eii@...&gt; wrote:\n\nFrom: Frank Ratka &lt;warrior=\r\n18eii@...&gt;\nSubject: Re: [EVP-ITC] New ideas\nTo: EVP-ITC@yahoogroups.c=\r\nom\nDate: Tuesday, June 9, 2009, 6:05 AM\n\n\n\n\n\n\n\n\n\n\n\n    \n            \n      =\r\n      \n\n\n      \n      The name aether is sometimes still used but now it is=\r\n called cosmic background radiation, primordial energy gradient=C2=A0or mor=\r\ne recently the zero-point field. The only way it can be proven to exist is =\r\nin reference to acceleration. The zero-point field is theories to penetrate=\r\n all things accept for a charged medium, which instead gives you a distorti=\r\non field in the zero-point field we call a magnetic field. The zero-point f=\r\nield is the &quot;canvas&quot; that the universe and all matter is painted on. It is =\r\nthe only thing that still oscillates at absolute zero when all other system=\r\ns cease to move. This oscillation is called a funny word called &quot;zitterbewe=\r\ngung&quot; motion.\n=C2=A0\nOf course all this is theorized but it seems to fit th=\r\ne math and is being used by many physicists in research today in the field =\r\nof quantum electrodynamics. Some of the researchers studying this are Dr. H=\r\narold Puthoff, Dr. Michael Ibison, Dr. Bernard Haisch and many others who a=\r\nlso have differing opinion on howit works but not whether it exists or not.=\r\n This seems to have been deemed, accepted theory.\n=C2=A0\nFrank R.\n\n--- On M=\r\non, 6/8/09, Rj &lt;rasterer@yahoo. com&gt; wrote:\n\n\nFrom: Rj &lt;rasterer@yahoo. com=\r\n&gt;\nSubject: Re: [EVP-ITC] New ideas\nTo: EVP-ITC@yahoogroups .com\nDate: Monda=\r\ny, June 8, 2009, 4:17 PM\n\n\n\n\n\n\n\n\nI&#39;m not sure what you mean by &quot;Aether&quot;.=C2=\r\n=A0 EM can propagate through a vacuum: it needs no medium like your other e=\r\nxamples.=C2=A0 It, in a sense, creates its own medium as electric and magne=\r\ntic forces interact with each other, causing a wave in that interaction tha=\r\nt is moving outward from the source.=C2=A0 Early physics theories of someth=\r\ning called the aether have, as far as I can tell, been abandoned (it seems =\r\nEinstein had a lot to do with that).\n\n\n\n\n\n\n\n\n\n\n\n\nFrom: Zack Widup &lt;w9sz.zac=\r\nk@gmail. com&gt;\nTo: EVP-ITC@yahoogroups .com\nSent: Monday, June 8, 2009 3:43:=\r\n47 PM\nSubject: Re: [EVP-ITC] New ideas\n\n\n\n\nYou can create a wave in anythin=\r\ng. You can create a wave in a rope by having a person hold each end and the=\r\nn having one person wiggle the rope. You can create a wave in a lake by dro=\r\npping a rock into it. The thing that carries the wave is the propagating me=\r\ndium. In these examples it&#39;s the rope and water respectively.\n=C2=A0\nIn the=\r\n case of sound, the propagating medium is the air. It is a longitudinal pre=\r\nssure wave. It cannot be picked up on a receiver that is capable of receivi=\r\nng the same frequencies as electromagnetic waves.\n=C2=A0\nThere are receiver=\r\ns and antennas that can pick up electromagnetic waves of the same frequenci=\r\nes as sound waves. But in this case, the propagating medium is the aether. =\r\nThey are transverse electromagnetic waves and you can&#39;t hear them.\n\nThe ele=\r\nctromagnetic spectrum extends from sub-audible frequencies all the way up t=\r\no the frequencies of X-rays and cosmic rays. Different methods exist to det=\r\nect or receive different parts of this spectrum. I&#39;m involved in a ULF grou=\r\np that specializes in receiving electromagnetic waves of the Schumann reson=\r\nances which are around 6 Hz, plus or minus.\n=C2=A0\nZack\n=C2=A0\n\n=C2=A0\nOn M=\r\non, Jun 8, 2009 at 2:38 PM, Frank Ratka &lt;warrior18eii@ yahoo.com&gt; wrote:\n\n\n=\r\n\n\n\n\n\n\n\n\n\n\n\nIt sounds like she&#39;s saying &quot;one, two, .....&quot;\n=C2=A0\nA mistake t=\r\nhat a lot of people make is thinking that there are two different types of =\r\nenergy at work when it comes to sound waves and electromagnetic waves. The =\r\nonly thing that seperates them is frequency and power. Radio waves are radi=\r\no waves because they occupy a certain block of the electromagnietic spectru=\r\nm. Sound waves exist on that same spectrum just farther down with much long=\r\ner waves. Soundwaves and subsonic waves can penetrate almost anything becau=\r\nse of their wavelengths. The shorter the wavelength the more ways we can sh=\r\nield against them.\n=C2=A0\nThink of microwaves. These are also a type of rad=\r\nio and telemetry transmitting wave but the waves also have a physical effec=\r\nt on our environment by causing molecules to speed up, which creates heat. =\r\nA little lower than this is IR or infrared it too can cause physical object=\r\ns to heat up but usually it just causes molecules to rotate in place. All p=\r\nhysical things give off IR light. Its a way the total system conserves ener=\r\ngy by spontaneously emitting IR radiation.\n=C2=A0\nFrank R. \n\n\n--- On Mon, 6=\r\n/8/09, April Abercrombie &lt;april@abercrombiegh ostresearch. com&gt; wrote:\n\n\n\nF=\r\nrom: April Abercrombie &lt;april@abercrombiegh ostresearch. com&gt;\nSubject: Re: =\r\n[EVP-ITC] New ideas [3 Attachments] \n\nTo: EVP-ITC@yahoogroups .com\nDate: Mo=\r\nnday, June 8, 2009, 2:27 PM\n\n\n\n\n\nHere is some food for thought. I am curren=\r\ntly reviewing my audio from our May 30th investigation.\n=C2=A0\nIt was me an=\r\nd another girl teammate=C2=A0present in the room. I picked up a 3rd female =\r\nvoice on my digital voice recorder that I carry with me. We were standing r=\r\night next to another digital video recorder that I leave beside my night vi=\r\nsion camera. That recorder did not pick up this 3rd voice. I have asked the=\r\n girl that was with me to check her recording to see if she picked it up.\n=\r\n=C2=A0\nI have long felt the true EVP does not come from sound waves in the =\r\nenvironment, or then it wouldn&#39;t be EVP, but a disembodied voice. Somehow E=\r\nVP&#39;s are appearing directly on the recordings.\n=C2=A0\nThis instance with th=\r\ne recorders may back that theory up. That other recorder should have picked=\r\n that voice up if it were sound waves in the environment.\n=C2=A0\nI am attac=\r\nhing the clip of this 3rd voice. The=C2=A0file that is named=C2=A0&quot;01-02-17=\r\n Clip&quot; is the full clip.=C2=A0You will hear my voice as I say &quot;Yeah&quot;, and t=\r\nhen another comes in right after that. I think I know what it says.\n=C2=A0\n=\r\nAgain, I was live monitoring my audio, but still did not hear this until pl=\r\nayback. It isn&#39;t clear, so I am not as excited about it as my one&#39;s from th=\r\ne last investigation.\n=C2=A0\n=C2=A0\n\n\n----- Original Message ----- \nFrom: F=\r\nrank Ratka \nTo: EVP-ITC@yahoogroups .com \n\nSent: Monday, June 08, 2009 1:09=\r\n PM\nSubject: Re: [EVP-ITC] New ideas\n\n\n\n\n\n\n\n\n\nI have a running theory that =\r\nEVP is carried on an untrasonic wave and demodulated exactly where they wan=\r\nt it to manifest. It works off the heterodyne principle. If you mix two ult=\r\nrasonic waves that differ one another in frequency then if you add or subtr=\r\nact them together you get a beat frequency or alternate frequency. For exam=\r\nple, if a ghost is sending a signal at 54KHz and you have an electric fan i=\r\nn a room creating an untrasonic frequency at 45KHz then you will have a int=\r\nermediate difference=C2=A0frequency at 9KHz, well within human hearing rang=\r\ne (20Hz to 20KHz). This was just an example, but all electronic equipment g=\r\nenerates ultrasonic signals just by turning them on. From this theory I alw=\r\nays felt that EVP were generated within a few inches of the recorder.\n=C2=\r\n=A0\nWe are able to reproduce this affect in not only radio with superhetero=\r\ndyne systems but also with acoustics and audio as in some passive sonars an=\r\nd a commercial produce called the &quot;audio spotlight&quot; by Dr. Joseph Pompeii.\n=\r\n=C2=A0\n\nFrank R.\n\n--- On Mon, 6/8/09, Zack Widup &lt;w9sz.zack@gmail. com&gt; wro=\r\nte:\n\n\n\nFrom: Zack Widup &lt;w9sz.zack@gmail. com&gt;\nSubject: Re: [EVP-ITC] New i=\r\ndeas\nTo: EVP-ITC@yahoogroups .com\nDate: Monday, June 8, 2009, 1:56 PM\n\n\n\n\n\n=\r\n\nFascinating! I&#39;ve had this idea that the EVP are often=C2=A0not recorded b=\r\ny the microphone but somehow make their way in at the actual=C2=A0point whe=\r\nre the storage is made, whether it be analog (tape) or digital.=C2=A0\n\nSo m=\r\nuch we don&#39;t know ...\n=C2=A0\nZack\n\n=C2=A0\n\nOn Mon, Jun 8, 2009 at 1:39 PM, =\r\nApril Abercrombie &lt;april@abercrombiegh ostresearch. com&gt; wrote:\n\n\n\n\n\n\n\n\n\n\nI=\r\n monitor my audio live. The funny thing is that even so, those last EVP&#39;s I=\r\n captured I did not hear either in the environment, or on my recording as i=\r\nt happened. I only heard them upon playback.\n=C2=A0\n\n\n\n----- Original Messa=\r\nge ----- \nFrom: Zack Widup \n\n\nTo: EVP-ITC@yahoogroups .com \n\n\n\n\nSent: Monda=\r\ny, June 08, 2009 11:40 AM\nSubject: Re: [EVP-ITC] New ideas\n\n\n\n\n\nI am curiou=\r\ns if anyone with a microphone wired to a remote site has ever gotten any EV=\r\nP in real time.\n=C2=A0\nI=C2=A0took part in=C2=A0an investigation of Ashmore=\r\n Estates, near Ashmore IL, on Saturday night. We had six video cameras set =\r\nup in the three halls of the building. The video for all=C2=A0was being mon=\r\nitored and recorded=C2=A0at a central location. Alas, we did not have micro=\r\nphones at the camera sites conected to the central location. I wonder what =\r\nwe might have heard if we did?\n=C2=A0\nZack\n\n=C2=A0\nOn Mon, Jun 8, 2009 at 1=\r\n2:05 PM, threadsintyme@ juno.com &lt;Threadsintyme@ juno.com&gt; wrote:\n\n=C2=A0\nL=\r\net&#39;s just agree to end this discussion about her... \nWhy don&#39;t we discuss s=\r\nomething on a lighter note? Anyone have any new ideas about either evp or I=\r\nTC? \nAl\n\n\n\n\n\n\n\n\n\n\n\n\n\n      \n \n\n      \n\n    \n    \n\t\n\t \n\t\n\t\n\n\n\n\n\n\n\n\n\t\n\n\n\t\n\t\n\n=\r\n\n      \r\n--0-2080146048-1244575948=:50167\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;br&gt;I have never heard of the aether and the =\r\ncosmic background radiation being called the same thing.&nbsp; In discussin=\r\ng aether, we were speaking of the medium through which EM travels.&nbsp; Co=\r\nsmic Background Radiation is EM itself, not the aether medium.&nbsp; For ex=\r\nample, a large part of this radiation is microwave frequencies.&nbsp; Micro=\r\nwave frequencies are not the aether.&nbsp; An old theory was that it travel=\r\ned through the aether.&nbsp; But mainline science does not put much credenc=\r\ne in this theory anymore.&lt;br&gt;&lt;br&gt;If you have a link where you see the cosmi=\r\nc background radiation and the aether being called the same thing, I=E2=80=\r\n=99d be happy to look at it.&nbsp; &lt;br&gt;&lt;br&gt;I have never heard of the =E2=80=\r\n=9Cprimordial energy gradient=E2=80=9D. Again, if you have a link to a defi=\r\nnition of this term, please provide.&lt;br&gt;&lt;br&gt;The jury is still out on 1) If =\r\naether is necessary\n for EM propagation, and 2) if ZPE is analogous to it.&=\r\nnbsp; From what I read, mainline science does not currently accept the conc=\r\nept of Aether, and does not equate ZPE to it.&nbsp; There are some efforts =\r\nto redefine what aether is (which has happened several times over at least =\r\nthe last 100 years).&nbsp; It could finally land on a definition that is ge=\r\nnerally accepted.&nbsp; But so far, it=E2=80=99s not quite there.&lt;br&gt;&lt;br&gt;Bu=\r\nt again, if you have links supporting your other statements (the aether is =\r\ncosmic background radiation, or what a =E2=80=9Cprimordial energy gradient=\r\n=E2=80=9D is), please post.&nbsp; Thanks.&lt;br&gt;&lt;br&gt;&lt;br&gt;--- On &lt;b&gt;Tue, 6/9/09,=\r\n Frank Ratka &lt;i&gt;&lt;warrior18eii@...&gt;&lt;/i&gt;&lt;/b&gt; wrote:&lt;br&gt;&lt;blockquot=\r\ne style=3D&quot;border-left: 2px solid rgb(16, 16, 255); margin-left: 5px; paddi=\r\nng-left: 5px;&quot;&gt;&lt;br&gt;From: Frank Ratka &lt;warrior18eii@...&gt;&lt;br&gt;Subj=\r\nect: Re: [EVP-ITC] New ideas&lt;br&gt;To: EVP-ITC@yahoogroups.com&lt;br&gt;Date: Tuesda=\r\ny, June 9, 2009, 6:05\n AM&lt;br&gt;&lt;br&gt;&lt;div id=3D&quot;yiv1496214697&quot;&gt;\n\n\n\n\n\n\n    &lt;div =\r\nid=3D&quot;ygrp-text&quot;&gt;\n      \n      &lt;p&gt;&lt;table border=3D&quot;0&quot; cellpadding=3D&quot;0&quot; cel=\r\nlspacing=3D&quot;0&quot;&gt;&lt;tbody&gt;&lt;tr&gt;&lt;td style=3D&quot;font-family: inherit; font-style: in=\r\nherit; font-variant: inherit; font-weight: inherit; font-size: inherit; lin=\r\ne-height: inherit; font-size-adjust: inherit; font-stretch: ; -x-system-fon=\r\nt: none;&quot; valign=3D&quot;top&quot;&gt;&lt;div&gt;The name aether is sometimes still used but n=\r\now it is called cosmic background radiation, primordial energy gradient&nbs=\r\np;or more recently the zero-point field. The only way it can be proven to e=\r\nxist is in reference to acceleration. The zero-point field is theories to p=\r\nenetrate all things accept for a charged medium, which instead gives you a =\r\ndistortion field in the zero-point field we call a magnetic field. The zero=\r\n-point field is the &quot;canvas&quot; that the universe and all matter is painted on=\r\n. It is the only thing that still oscillates at absolute zero when all othe=\r\nr systems cease to move. This oscillation is called a funny word called &quot;zi=\r\ntterbewegung&quot; motion.&lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;Of course all this is th=\r\neorized but it seems to fit the math and is being used by many physicists i=\r\nn research today in the field of quantum electrodynamics. Some of the resea=\r\nrchers studying this are Dr. Harold Puthoff, Dr. Michael Ibison, Dr. Bernar=\r\nd Haisch and many others who also have differing opinion on howit works but=\r\n not whether it exists or not. This seems to have been deemed, accepted the=\r\nory.&lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;Frank R.&lt;br&gt;&lt;br&gt;--- On &lt;b&gt;Mon, 6/8/09, Rj=\r\n &lt;i&gt;&lt;rasterer@yahoo. com&gt;&lt;/i&gt;&lt;/b&gt; wrote:&lt;br&gt;&lt;/div&gt;\n&lt;blockquote style=\r\n=3D&quot;border-left: 2px solid rgb(16, 16, 255);&quot;&gt;&lt;br&gt;From: Rj &lt;rasterer@yah=\r\noo. com&gt;&lt;br&gt;Subject: Re: [EVP-ITC] New ideas&lt;br&gt;To: EVP-ITC@yahoogroups =\r\n.com&lt;br&gt;Date: Monday, June 8, 2009, 4:17 PM&lt;br&gt;&lt;br&gt;\n&lt;div id=3D&quot;yiv155190197=\r\n1&quot;&gt;\n&lt;div id=3D&quot;ygrp-text&quot;&gt;\n&lt;div&gt;\n&lt;table border=3D&quot;0&quot; cellpadding=3D&quot;0&quot; cell=\r\nspacing=3D&quot;0&quot;&gt;\n&lt;tbody&gt;\n&lt;tr&gt;\n&lt;td valign=3D&quot;top&quot;&gt;I&#39;m not sure what you mean b=\r\ny &quot;Aether&quot;.&nbsp; EM can propagate through a vacuum: it needs no medium lik=\r\ne your other examples.&nbsp; It, in a sense, creates its own medium as elec=\r\ntric and magnetic forces interact with each other, causing a wave in that i=\r\nnteraction that is moving outward from the source.&nbsp; Early physics theo=\r\nries of something called the aether have, as far as I can tell, been abando=\r\nned (it seems Einstein had a lot to do with that).&lt;br&gt;\n&lt;blockquote style=3D=\r\n&quot;border-left: 2px solid rgb(16, 16, 255);&quot;&gt;\n&lt;div id=3D&quot;yiv1317654747&quot;&gt;\n&lt;div=\r\n id=3D&quot;ygrp-mlmsg&quot;&gt;\n&lt;div id=3D&quot;ygrp-msg&quot;&gt;\n&lt;div id=3D&quot;ygrp-text&quot;&gt;\n&lt;div style=\r\n=3D&quot;font-family: arial,helvetica,sans-serif; font-size: 12pt;&quot;&gt;\n&lt;div&gt;\n&lt;div =\r\nstyle=3D&quot;font-family: arial,helvetica,sans-serif; font-size: 12pt;&quot;&gt;&lt;br&gt;\n&lt;d=\r\niv style=3D&quot;border-left: 2px solid rgb(16, 16, 255); font-family: times new=\r\n roman,new york,times,serif; font-size: 12pt;&quot;&gt;&lt;font face=3D&quot;Tahoma&quot; size=\r\n=3D&quot;2&quot;&gt;\n&lt;hr size=3D&quot;1&quot;&gt;\n&lt;b&gt;&lt;span style=3D&quot;font-weight: bold;&quot;&gt;From:&lt;/span&gt;&lt;=\r\n/b&gt; Zack Widup &lt;w9sz.zack@gmail. com&gt;&lt;br&gt;&lt;b&gt;&lt;span style=3D&quot;font-weigh=\r\nt: bold;&quot;&gt;To:&lt;/span&gt;&lt;/b&gt; EVP-ITC@yahoogroups .com&lt;br&gt;&lt;b&gt;&lt;span style=3D&quot;font=\r\n-weight: bold;&quot;&gt;Sent:&lt;/span&gt;&lt;/b&gt; Monday, June 8, 2009 3:43:47 PM&lt;br&gt;&lt;b&gt;&lt;spa=\r\nn style=3D&quot;font-weight: bold;&quot;&gt;Subject:&lt;/span&gt;&lt;/b&gt; Re: [EVP-ITC] New ideas&lt;=\r\nbr&gt;&lt;/font&gt;&lt;br&gt;\n&lt;div id=3D&quot;ygrp-text&quot;&gt;\n&lt;div&gt;&lt;/div&gt;\n&lt;div&gt;You can create a wav=\r\ne in anything. You can create a wave in a rope by having a person hold each=\r\n end and then having one person wiggle the rope. You can create a wave in a=\r\n lake by dropping a rock into it. The thing that carries the wave is the pr=\r\nopagating medium. In these examples it&#39;s the rope and water respectively.&lt;/=\r\ndiv&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;In the case of sound, the propagating medium is=\r\n the air. It is a longitudinal pressure wave. It cannot be picked up on a r=\r\neceiver that is capable of receiving the same frequencies as electromagneti=\r\nc waves.&lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;There are receivers and antennas that=\r\n can pick up electromagnetic waves of the same frequencies as sound waves. =\r\nBut in this case, the propagating medium is the aether. They are transverse=\r\n electromagnetic waves and you can&#39;t hear them.&lt;br&gt;&lt;/div&gt;\n&lt;div&gt;The electrom=\r\nagnetic spectrum extends from sub-audible frequencies all the way up to the=\r\n frequencies of X-rays and cosmic rays. Different methods exist to detect o=\r\nr receive different parts of this spectrum. I&#39;m involved in a ULF group tha=\r\nt specializes in receiving electromagnetic waves of the Schumann resonances=\r\n which are around 6 Hz, plus or minus.&lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;Zack&lt;/d=\r\niv&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&lt;br&gt;&nbsp;&lt;/div&gt;\n&lt;div class=3D&quot;gmail_quote&quot;&gt;On M=\r\non, Jun 8, 2009 at 2:38 PM, Frank Ratka &lt;span dir=3D&quot;ltr&quot;&gt;&lt;&lt;a rel=3D&quot;nof=\r\nollow&quot;&gt;warrior18eii@ yahoo.com&lt;/a&gt;&gt;&lt;/span&gt; wrote:&lt;br&gt;\n&lt;blockquote style=\r\n=3D&quot;border-left: 1px solid rgb(204, 204, 204);&quot; class=3D&quot;gmail_quote&quot;&gt;\n&lt;div=\r\n style=3D&quot;background-color: rgb(255, 255, 255);&quot;&gt;\n&lt;div&gt;\n&lt;div&gt;\n&lt;div&gt;&lt;br&gt;&lt;br&gt;=\r\n\n&lt;div&gt;\n&lt;table border=3D&quot;0&quot; cellpadding=3D&quot;0&quot; cellspacing=3D&quot;0&quot;&gt;\n&lt;tbody&gt;\n&lt;tr=\r\n&gt;\n&lt;td valign=3D&quot;top&quot;&gt;\n&lt;div&gt;It sounds like she&#39;s saying &quot;one, two, .....&quot;&lt;/d=\r\niv&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;A mistake that a lot of people make is thinking =\r\nthat there are two different types of energy at work when it comes to sound=\r\n waves and electromagnetic waves. The only thing that seperates them is fre=\r\nquency and power. Radio waves are radio waves because they occupy a certain=\r\n block of the electromagnietic spectrum. Sound waves exist on that same spe=\r\nctrum just farther down with much longer waves. Soundwaves and subsonic wav=\r\nes can penetrate almost anything because of their wavelengths. The shorter =\r\nthe wavelength the more ways we can shield against them.&lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;=\r\n/div&gt;\n&lt;div&gt;Think of microwaves. These are also a type of radio and telemetr=\r\ny transmitting wave but the waves also have a physical effect on our enviro=\r\nnment by causing molecules to speed up, which creates heat. A little lower =\r\nthan this is IR or infrared it too can cause physical objects to heat up bu=\r\nt usually it just causes molecules to rotate in place. All physical things =\r\ngive off IR light. Its a way the total system conserves energy by spontaneo=\r\nusly emitting IR radiation.&lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;Frank R. \n&lt;div cla=\r\nss=3D&quot;im&quot;&gt;&lt;br&gt;&lt;br&gt;--- On &lt;b&gt;Mon, 6/8/09, April Abercrombie &lt;i&gt;&lt;&lt;a rel=3D=\r\n&quot;nofollow&quot;&gt;april@abercrombiegh ostresearch. com&lt;/a&gt;&gt;&lt;/i&gt;&lt;/b&gt; wrote:&lt;br&gt;&lt;=\r\n/div&gt;&lt;/div&gt;\n&lt;blockquote style=3D&quot;border-left: 2px solid rgb(16, 16, 255);&quot;&gt;=\r\n\n&lt;div class=3D&quot;im&quot;&gt;&lt;br&gt;From: April Abercrombie &lt;&lt;a rel=3D&quot;nofollow&quot;&gt;apri=\r\nl@abercrombiegh ostresearch. com&lt;/a&gt;&gt;&lt;br&gt;&lt;/div&gt;Subject: Re: [EVP-ITC] Ne=\r\nw ideas [3 Attachments] \n&lt;div class=3D&quot;im&quot;&gt;&lt;br&gt;To: &lt;a rel=3D&quot;nofollow&quot;&gt;EVP-=\r\nITC@yahoogroups .com&lt;/a&gt;&lt;br&gt;&lt;/div&gt;Date: Monday, June 8, 2009, 2:27 PM&lt;br&gt;&lt;b=\r\nr&gt;\n&lt;div&gt;\n&lt;div&gt;\n&lt;div&gt;\n&lt;div&gt;&lt;font face=3D&quot;Myriad Pro&quot; size=3D&quot;2&quot;&gt;Here is some=\r\n food for thought. I am currently reviewing my audio from our May 30th inve=\r\nstigation.&lt;/font&gt;&lt;/div&gt;\n&lt;div&gt;&lt;font face=3D&quot;Myriad Pro&quot; size=3D&quot;2&quot;&gt;&lt;/font&gt;&n=\r\nbsp;&lt;/div&gt;\n&lt;div&gt;&lt;font face=3D&quot;Myriad Pro&quot; size=3D&quot;2&quot;&gt;It was me and another =\r\ngirl teammate&nbsp;present in the room. I picked up a 3rd female voice on m=\r\ny digital voice recorder that I carry with me. We were standing right next =\r\nto another digital video recorder that I leave beside my night vision camer=\r\na. That recorder did not pick up this 3rd voice. I have asked the girl that=\r\n was with me to check her recording to see if she picked it up.&lt;/font&gt;&lt;/div=\r\n&gt;\n&lt;div&gt;&lt;font face=3D&quot;Myriad Pro&quot; size=3D&quot;2&quot;&gt;&lt;/font&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&lt;font =\r\nface=3D&quot;Myriad Pro&quot; size=3D&quot;2&quot;&gt;I have long felt the true EVP does not come =\r\nfrom sound waves in the environment, or then it wouldn&#39;t be EVP, but a dise=\r\nmbodied voice. Somehow EVP&#39;s are appearing directly on the recordings.&lt;/fon=\r\nt&gt;&lt;/div&gt;\n&lt;div&gt;&lt;font face=3D&quot;Myriad Pro&quot; size=3D&quot;2&quot;&gt;&lt;/font&gt;&nbsp;&lt;/div&gt;\n&lt;div=\r\n&gt;&lt;font face=3D&quot;Myriad Pro&quot; size=3D&quot;2&quot;&gt;This instance with the recorders may =\r\nback that theory up. That other recorder should have picked that voice up i=\r\nf it were sound waves in the environment.&lt;/font&gt;&lt;/div&gt;\n&lt;div&gt;&lt;font face=3D&quot;M=\r\nyriad Pro&quot; size=3D&quot;2&quot;&gt;&lt;/font&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&lt;font face=3D&quot;Myriad Pro&quot; si=\r\nze=3D&quot;2&quot;&gt;I am attaching the clip of this 3rd voice. The&nbsp;file that is n=\r\named&nbsp;&quot;01-02-17 Clip&quot; is the full clip.&nbsp;You will hear my voice as =\r\nI say &quot;Yeah&quot;, and then another comes in right after that. I think I know wh=\r\nat it says.&lt;/font&gt;&lt;/div&gt;\n&lt;div&gt;&lt;font face=3D&quot;Myriad Pro&quot; size=3D&quot;2&quot;&gt;&lt;/font&gt;&=\r\nnbsp;&lt;/div&gt;\n&lt;div&gt;&lt;font face=3D&quot;Myriad Pro&quot; size=3D&quot;2&quot;&gt;Again, I was live mon=\r\nitoring my audio, but still did not hear this until playback. It isn&#39;t clea=\r\nr, so I am not as excited about it as my one&#39;s from the last investigation.=\r\n&lt;/font&gt;&lt;/div&gt;\n&lt;div&gt;&lt;font face=3D&quot;Myriad Pro&quot; size=3D&quot;2&quot;&gt;&lt;/font&gt;&nbsp;&lt;/div&gt;=\r\n\n&lt;div&gt;&lt;font face=3D&quot;Myriad Pro&quot; size=3D&quot;2&quot;&gt;&lt;/font&gt;&nbsp;&lt;/div&gt;\n&lt;blockquote =\r\nstyle=3D&quot;border-left: 2px solid rgb(0, 0, 0);&quot; dir=3D&quot;ltr&quot;&gt;\n&lt;div class=3D&quot;i=\r\nm&quot;&gt;\n&lt;div style=3D&quot;font-variant: normal; font-style: normal; font-family: ar=\r\nial; font-size: 10pt; font-weight: normal; font-size-adjust: none;&quot;&gt;----- O=\r\nriginal Message ----- &lt;/div&gt;\n&lt;div style=3D&quot;font-variant: normal; font-style=\r\n: normal; font-family: arial; font-size: 10pt; font-weight: normal; font-si=\r\nze-adjust: none;&quot;&gt;&lt;b&gt;From:&lt;/b&gt; &lt;a rel=3D&quot;nofollow&quot; title=3D&quot;warrior18eii@ya=\r\nhoo.com&quot; target=3D&quot;_blank&quot; href=3D&quot;http://us.mc01g.mail.yahoo.com/mc/compos=\r\ne?to=3Dwarrior18eii@...&quot;&gt;Frank Ratka&lt;/a&gt; &lt;/div&gt;\n&lt;div style=3D&quot;font-va=\r\nriant: normal; font-style: normal; font-family: arial; font-size: 10pt; fon=\r\nt-weight: normal; font-size-adjust: none;&quot;&gt;&lt;b&gt;To:&lt;/b&gt; &lt;a rel=3D&quot;nofollow&quot; t=\r\nitle=3D&quot;EVP-ITC@yahoogroups.com&quot; target=3D&quot;_blank&quot; href=3D&quot;http://us.mc01g.=\r\nmail.yahoo.com/mc/compose?to=3DEVP-ITC@yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups=\r\n .com&lt;/a&gt; &lt;/div&gt;&lt;/div&gt;\n&lt;div class=3D&quot;im&quot;&gt;\n&lt;div style=3D&quot;font-variant: norma=\r\nl; font-style: normal; font-family: arial; font-size: 10pt; font-weight: no=\r\nrmal; font-size-adjust: none;&quot;&gt;&lt;b&gt;Sent:&lt;/b&gt; Monday, June 08, 2009 1:09 PM&lt;/=\r\ndiv&gt;\n&lt;div style=3D&quot;font-variant: normal; font-style: normal; font-family: a=\r\nrial; font-size: 10pt; font-weight: normal; font-size-adjust: none;&quot;&gt;&lt;b&gt;Sub=\r\nject:&lt;/b&gt; Re: [EVP-ITC] New ideas&lt;/div&gt;\n&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;/div&gt;\n&lt;div&gt;\n&lt;div&gt;\n&lt;=\r\ntable border=3D&quot;0&quot; cellpadding=3D&quot;0&quot; cellspacing=3D&quot;0&quot;&gt;\n&lt;tbody&gt;\n&lt;tr&gt;\n&lt;td va=\r\nlign=3D&quot;top&quot;&gt;\n&lt;div class=3D&quot;im&quot;&gt;\n&lt;div&gt;I have a running theory that EVP is c=\r\narried on an untrasonic wave and demodulated exactly where they want it to =\r\nmanifest. It works off the heterodyne principle. If you mix two ultrasonic =\r\nwaves that differ one another in frequency then if you add or subtract them=\r\n together you get a beat frequency or alternate frequency. For example, if =\r\na ghost is sending a signal at 54KHz and you have an electric fan in a room=\r\n creating an untrasonic frequency at 45KHz then you will have a intermediat=\r\ne difference&nbsp;frequency at 9KHz, well within human hearing range (20Hz =\r\nto 20KHz). This was just an example, but all electronic equipment generates=\r\n ultrasonic signals just by turning them on. From this theory I always felt=\r\n that EVP were generated within a few inches of the recorder.&lt;/div&gt;\n&lt;div&gt;&n=\r\nbsp;&lt;/div&gt;\n&lt;div&gt;We are able to reproduce this affect in not only radio with=\r\n superheterodyne systems but also with acoustics and audio as in some passi=\r\nve sonars and a commercial produce called the &quot;audio spotlight&quot; by Dr. Jose=\r\nph Pompeii.&lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;&lt;/div&gt;\n&lt;div class=3D&quot;im&quot;&gt;\n&lt;div&gt;Frank R.&lt;=\r\nbr&gt;&lt;br&gt;--- On &lt;b&gt;Mon, 6/8/09, Zack Widup &lt;i&gt;&lt;w9sz.zack@gmail. com&gt;&lt;/i=\r\n&gt;&lt;/b&gt; wrote:&lt;br&gt;&lt;/div&gt;&lt;/div&gt;\n&lt;blockquote style=3D&quot;border-left: 2px solid rg=\r\nb(16, 16, 255);&quot;&gt;\n&lt;div class=3D&quot;im&quot;&gt;&lt;br&gt;From: Zack Widup &lt;w9sz.zack@gmai=\r\nl. com&gt;&lt;br&gt;Subject: Re: [EVP-ITC] New ideas&lt;br&gt;To: EVP-ITC@yahoogroups .=\r\ncom&lt;br&gt;&lt;/div&gt;Date: Monday, June 8, 2009, 1:56 PM&lt;br&gt;&lt;br&gt;\n&lt;div&gt;\n&lt;div&gt;\n&lt;div&gt;\n=\r\n&lt;div class=3D&quot;im&quot;&gt;\n&lt;div&gt;Fascinating! I&#39;ve had this idea that the EVP are of=\r\nten&nbsp;not recorded by the microphone but somehow make their way in at th=\r\ne actual&nbsp;point where the storage is made, whether it be analog (tape) =\r\nor digital.&nbsp;&lt;br&gt;&lt;/div&gt;\n&lt;div&gt;So much we don&#39;t know ...&lt;/div&gt;\n&lt;div&gt;&nbsp=\r\n;&lt;/div&gt;&lt;/div&gt;\n&lt;div&gt;Zack&lt;/div&gt;\n&lt;div&gt;&lt;br&gt;&nbsp;&lt;/div&gt;\n&lt;div class=3D&quot;gmail_quo=\r\nte&quot;&gt;\n&lt;div class=3D&quot;im&quot;&gt;On Mon, Jun 8, 2009 at 1:39 PM, April Abercrombie &lt;s=\r\npan dir=3D&quot;ltr&quot;&gt;&lt;&lt;a rel=3D&quot;nofollow&quot; target=3D&quot;_blank&quot; href=3D&quot;http://us=\r\n.mc01g.mail.yahoo.com/mc/compose?to=3Dapril@...&quot;&gt;a=\r\npril@abercrombiegh ostresearch. com&lt;/a&gt;&gt;&lt;/span&gt; wrote:&lt;br&gt;&lt;/div&gt;\n&lt;blockq=\r\nuote style=3D&quot;border-left: 1px solid rgb(204, 204, 204);&quot; class=3D&quot;gmail_qu=\r\note&quot;&gt;\n&lt;div style=3D&quot;background-color: rgb(255, 255, 255);&quot;&gt;\n&lt;div&gt;\n&lt;div&gt;\n&lt;di=\r\nv&gt;&lt;br&gt;&lt;br&gt;\n&lt;div&gt;\n&lt;div class=3D&quot;im&quot;&gt;\n&lt;div&gt;&lt;font face=3D&quot;Myriad Pro&quot; size=3D&quot;=\r\n2&quot;&gt;I monitor my audio live. The funny thing is that even so, those last EVP=\r\n&#39;s I captured I did not hear either in the environment, or on my recording =\r\nas it happened. I only heard them upon playback.&lt;/font&gt;&lt;/div&gt;\n&lt;div&gt;&lt;font fa=\r\nce=3D&quot;Myriad Pro&quot; size=3D&quot;2&quot;&gt;&lt;/font&gt;&nbsp;&lt;/div&gt;&lt;/div&gt;\n&lt;blockquote style=3D=\r\n&quot;border-left: 2px solid rgb(0, 0, 0);&quot; dir=3D&quot;ltr&quot;&gt;\n&lt;div class=3D&quot;im&quot;&gt;\n&lt;div=\r\n&gt;\n&lt;div style=3D&quot;font-variant: normal; font-style: normal; font-family: aria=\r\nl; font-size: 10pt; font-weight: normal; font-size-adjust: none;&quot;&gt;----- Ori=\r\nginal Message ----- &lt;/div&gt;\n&lt;div style=3D&quot;font-variant: normal; font-style: =\r\nnormal; font-family: arial; font-size: 10pt; font-weight: normal; font-size=\r\n-adjust: none;&quot;&gt;&lt;b&gt;From:&lt;/b&gt; &lt;a rel=3D&quot;nofollow&quot; title=3D&quot;w9sz.zack@gmail.c=\r\nom&quot; target=3D&quot;_blank&quot; href=3D&quot;http://us.mc01g.mail.yahoo.com/mc/compose?to=\r\n=3Dw9sz.zack@...&quot;&gt;Zack Widup&lt;/a&gt; &lt;/div&gt;&lt;/div&gt;&lt;/div&gt;\n&lt;div class=3D&quot;im&quot;=\r\n&gt;\n&lt;div&gt;\n&lt;div style=3D&quot;font-variant: normal; font-style: normal; font-family=\r\n: arial; font-size: 10pt; font-weight: normal; font-size-adjust: none;&quot;&gt;&lt;b&gt;=\r\nTo:&lt;/b&gt; &lt;a rel=3D&quot;nofollow&quot; title=3D&quot;EVP-ITC@yahoogroups.com&quot; target=3D&quot;_bl=\r\nank&quot; href=3D&quot;http://us.mc01g.mail.yahoo.com/mc/compose?to=3DEVP-ITC@yahoogr=\r\noups.com&quot;&gt;EVP-ITC@yahoogroups .com&lt;/a&gt; &lt;/div&gt;&lt;/div&gt;&lt;/div&gt;\n&lt;div&gt;\n&lt;div&gt;&lt;/div&gt;=\r\n\n&lt;div&gt;\n&lt;div class=3D&quot;im&quot;&gt;\n&lt;div style=3D&quot;font-variant: normal; font-style: n=\r\normal; font-family: arial; font-size: 10pt; font-weight: normal; font-size-=\r\nadjust: none;&quot;&gt;&lt;b&gt;Sent:&lt;/b&gt; Monday, June 08, 2009 11:40 AM&lt;/div&gt;\n&lt;div style=\r\n=3D&quot;font-variant: normal; font-style: normal; font-family: arial; font-size=\r\n: 10pt; font-weight: normal; font-size-adjust: none;&quot;&gt;&lt;b&gt;Subject:&lt;/b&gt; Re: [=\r\nEVP-ITC] New ideas&lt;/div&gt;\n&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;/div&gt;\n&lt;div class=3D&quot;im&quot;&gt;\n&lt;div&gt;\n&lt;di=\r\nv&gt;\n&lt;div&gt;I am curious if anyone with a microphone wired to a remote site has=\r\n ever gotten any EVP in real time.&lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;I&nbsp;took=\r\n part in&nbsp;an investigation of Ashmore Estates, near Ashmore IL, on Satu=\r\nrday night. We had six video cameras set up in the three halls of the build=\r\ning. The video for all&nbsp;was being monitored and recorded&nbsp;at a cent=\r\nral location. Alas, we did not have microphones at the camera sites conecte=\r\nd to the central location. I wonder what we might have heard if we did?&lt;/di=\r\nv&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;Zack&lt;/div&gt;\n&lt;div&gt;&lt;br&gt;&nbsp;&lt;/div&gt;\n&lt;div class=3D&quot;gm=\r\nail_quote&quot;&gt;On Mon, Jun 8, 2009 at 12:05 PM, &lt;a rel=3D&quot;nofollow&quot; target=3D&quot;_=\r\nblank&quot; href=3D&quot;http://us.mc01g.mail.yahoo.com/mc/compose?to=3Dthreadsintyme=\r\n@...&quot;&gt;threadsintyme@ juno.com&lt;/a&gt; &lt;span dir=3D&quot;ltr&quot;&gt;&lt;&lt;a rel=3D&quot;nofo=\r\nllow&quot; target=3D&quot;_blank&quot; href=3D&quot;http://us.mc01g.mail.yahoo.com/mc/compose?t=\r\no=3DThreadsintyme@...&quot;&gt;Threadsintyme@ juno.com&lt;/a&gt;&gt;&lt;/span&gt; wrote:&lt;b=\r\nr&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;Let&#39;s just agree to end this discussion about her=\r\n... &lt;br&gt;Why don&#39;t we discuss something on a lighter note? Anyone have any n=\r\new ideas about either evp or ITC? &lt;br&gt;Al&lt;/div&gt;&lt;/div&gt;\n&lt;div&gt;&lt;/div&gt;\n&lt;div&gt;&lt;/div=\r\n&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/blockquote&gt;\n&lt;div&gt;&lt;/div&gt;&lt;/div&gt;\n&lt;div style=\r\n=3D&quot;color: white;&quot;&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/blockquote&gt;&lt;/div&gt;&lt;br&gt;&lt;/d=\r\niv&gt;&lt;/div&gt;&lt;/div&gt;&lt;/blockquote&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/tbody&gt;&lt;/table&gt;&lt;br&gt;&lt;/div&gt;&lt;/div&gt;&lt;/blo=\r\nckquote&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/blockquote&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/tbody&gt;&lt;/table&gt;&lt;br&gt;&lt;/div&gt;=\r\n&lt;/div&gt;\n&lt;div style=3D&quot;color: white;&quot;&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/blockquote&gt;&lt;/=\r\ndiv&gt;&lt;br&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;br&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/blockqu=\r\note&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/tbody&gt;&lt;/table&gt;&lt;br&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/blockquote&gt;&lt;/td&gt;&lt;/tr&gt;=\r\n&lt;/tbody&gt;&lt;/table&gt;&lt;br&gt;\n\n      &lt;/p&gt;\n \n\n    &lt;/div&gt;  \n\n\n\t \n\t\n\t&lt;/div&gt;&lt;/blockquote=\r\n&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n\n\n      \r\n--0-2080146048-1244575948=:50167--"}