{"id": "15092", "subject": "Scientific Research into EVP", "author": "phenom_investigator", "timestamp": "2009-06-10T13:07:08Z", "full_text": "The question often arises in this group as to what scientific work is actually going on in this field. Rhine Research (founded by J.B. Rhine) at Duke University is one of preeminent research centers in the field of parapsychology. The lab sponsors programs in many areas of interest throughout the year. This presentation is one such example.\n\nThe Scientific Study of Electronic Voice Phenomena (EVP)  \nWhat Can Science Reveal About Anomalous Voices?\nA Panel with Mark Leary, John Palmer, Graham Watkins, George Mathis and Jim Hall\n \n \nJuly 12th 4-5:30pm on Sunday July 12th at the Alex Tanous Research Library\n \nOf all of the data that paranormal investigators collect, Electronic Voice Phenomena (EVP) -- audio recordings of voices that were not heard at the time that they were recorded -- provide perhaps the most provocative and controversial evidence of activity in supposedly haunted locations. \n\nAlthough some investigators claim that EVP are the voices of unseen entities, critics say that they result from mundane sources such as radio transmissions or the tendency of the brain to create patterns from random sounds. \n\nA panel of three research scientists (Mark Leary, John Palmer, and Graham Watkins) and two highly experienced paranormal investigators (George Mathis and Jim Hall) will discuss what we presently know about EVP and the degree to which scientific research can address questions regarding the source and nature of Electronic Voice Phenomena.\n\nParticipants:\n\nMark Leary, Ph.D., is a social and personality psychologist who has held faculty positions at Denison University, the University of Texas, Wake Forest University, and Duke University. He is the author of 11 books and nearly 200 scientific articles and chapters on topics related to social behavior and emotions. He also has interests in philosophy of science, research design, and quantitative analysis and is involved in efforts to promote critical and scientific thinking among the public. \n\nDr. John Palmer, Ph.D., was on the staff of the Rhine Research Center (formerly Foundation of Research on the Nature of Man) from 1984 to 2004, serving as both the Director of Education and Director of Research. He has been Editor of the Journal of Parapsychology since 1994 and was President of the Parapsychological Association in 1979 and 1992. His research has focused primarily on psychological factors associated with ESP performance in the laboratory. He has published numerous research articles and is co-author of the book Foundations of Parapsychology.\n\nGraham Watkins attended the University of Kentucky and did graduate studies at Duke University, majoring in Zoology. In the early 1970s, he was a research associate at the Foundation for Research on the Nature of Man at the time that J. B. Rhine was the director. He is best known for the mouse-ether studies, which demonstrated the ability of &quot;talented&quot; subjects to cause mice to recover from ether anesthesia faster than they normally would. He has also worked in the fields of toxicology and electronics and is a published writer \nof both fiction and non-fiction.\n\nGeorge Matthis is president of the National Society for Paranormal Investigation and Research (NSPIR), a non-profit organization dedicated to paranormal investigation, research, and education. \nAs part of its mission to educate the public about the paranormal and to promote ethical, science-based investigations, NSPIR sponsors the Carolina Hauntings, Apparitions, and Poltergeists Society (CHAPS) to educate the public regarding paranormal investigations. \nGeorge is also president of the Paranormal Resource Alliance, which is dedicated to promoting adherence to a code of ethics and standards among paranormal investigators and providing resources \nfor paranormal groups.\n\nJim Hall is a science teacher and director of Haunted North Carolina, which has investigated hundreds of cases of paranormal activity since it was founded (as Seven Paranormal Research) in 1992. Jim has over 20 years of experience in paranormal investigations, which he approaches with a critical mindset, insisting that rational explanations be thoroughly considered before turning to paranormal ones. Jim is vice-president of the Paranormal Research Alliance and is regularly sought by the media for \nhis expertise regarding the paranormal."}