{"id": "15128", "subject": "Re: Beginner Going to attempt to make his first box.", "author": "afterdarkdigital", "timestamp": "2009-06-15T17:22:28Z", "full_text": "There was a smaller Schematic Frank posted about using the tuner from a radioshack 469.  It was a smaller diagram just showing where to plug your signal into the vt, and to provide the 3v into the tuner. Sorry im not more specific, im a newbie to circuits.\n\nFrank emailed me back and said for a random sweep he no longer likes using the white noise generator, and instead prefers to use a dual supply op amp.  Im not entirely sure what a op amp is or how to use it.  Im assuming it produces a random signal that can be used for the VT.  BUt I need to do alot more research to learn what it really does.\n\n\n\n--- In EVP-ITC@yahoogroups.com, Elaine Coates &lt;cozykat2003@...&gt; wrote:\n&gt;\n&gt; Which schematic are you using?\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; ________________________________\n&gt; From: afterdarkdigital &lt;afterdarkdigital@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Saturday, June 13, 2009 7:42:13 PM\n&gt; Subject: [EVP-ITC] Beginner Going to attempt to make his first box.\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Hello all,\n&gt; \n&gt; Thanks for having me apart of your yahoo group. Ive been researching this a lot and was overly excited to find a group that actually has frank posting in it.\n&gt; \n&gt; I&#39;m about to attempt to make my first box ( well i have made the ufogeek radio shack hack, but that was too easy). I plan to try and make the one with a random voltage generator that&#39;s plugged into the Radio Shack 499, and if I can do that successfully, out to an echo-box before heading out.\n&gt; \n&gt; My question to you all is if you could point me in the right direction to get up to speed enough on circuits and electronics via a website or book. I have no experience doing this kind of stuff. But im a quick learner and really want to make this happen.\n&gt; \n&gt; Thanks for the help everyone,\n&gt; \n&gt; God Bless and Good Results to you all.\n&gt; \n&gt; David\n&gt;"}