{"id": "15139", "subject": "Re: [EVP-ITC] What&#39;s up with that!?", "author": "Frank Ratka", "timestamp": "2009-06-22T12:14:02Z", "full_text": "--0-599278566-1245672842=:75345\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nThat&#39;s funny! They never say what I expect them to say. LOL As a matter of =\r\nfact they are really good about saying shit that don&#39;t make sense until it =\r\nhappens later. Or, I would get messages for Misty or Laura and even Sumptio=\r\nn that made no sense to me what-so-ever because those were the other folks =\r\nwithin our circle.\n=A0\nI look at the &quot;help me&#39;s&quot;, the &quot;nasty ones&quot; and othe=\r\nrs as levels of our own=A0contact=A0evolution or levels we work past to get=\r\n to the ones who can speak coherantly. Those voices fade as you concentrate=\r\n on positive messages instead of YOU getting stuck listening to the &quot;scared=\r\n and lost&quot; folks.\n=A0\nAs for making your own realities after you die, I fol=\r\nlow a Bruce Moen style viewpoint where there are what is called Hollow heav=\r\nens and hells. You go where you feel you deserve or see what you expect to =\r\nsee, but only for a while. You slowly are brought out of those realities by=\r\n helpers whose job it is to do so. Anyways, just a thought! One of many!\n=\r\n=A0\nFrank R.\n\n--- On Sun, 6/21/09, purplespacefriend &lt;purplealiengirl@gmail=\r\n.com&gt; wrote:\n\n\nFrom: purplespacefriend &lt;purplealiengirl@...&gt;\nSubject:=\r\n [EVP-ITC] What&#39;s up with that!?\nTo: EVP-ITC@yahoogroups.com\nDate: Sunday, =\r\nJune 21, 2009, 5:05 PM\n\n\n\n\n\n\n\n\nThis crap I hear about people supposedly cro=\r\nssing over stuck souls with a box? \n\nDoes not anyone get the concept that y=\r\nou create what you expect in the paranormal? If you think there&#39;s hauntings=\r\n, you create the evidence to support that. If you think there&#39;s stuck souls=\r\n you&#39;ll have no shortage of ghosts screaming for your superhuman help. Of c=\r\nourse, you also create the illusion of being the big expert as well-which i=\r\ns what I think many want most.\n\nJust a suggestion-- but grow up people!\n\nF-=\r\nS\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n      \r\n--0-599278566-1245672842=:75345\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;DIV&gt;That&#39;s funny! They never say what I expe=\r\nct them to say. LOL As a matter of fact they are really good about saying s=\r\nhit that don&#39;t make sense until it happens later. Or, I would get messages =\r\nfor Misty or Laura and even Sumption that made no sense to me what-so-ever =\r\nbecause those were the other folks within our circle.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DI=\r\nV&gt;\n&lt;DIV&gt;I look at the &quot;help me&#39;s&quot;, the &quot;nasty ones&quot; and others as levels of=\r\n our own&nbsp;contact&nbsp;evolution or levels we work past to get to the o=\r\nnes who can speak coherantly. Those voices fade as you concentrate on posit=\r\nive messages instead of YOU getting stuck listening to the &quot;scared and lost=\r\n&quot; folks.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;As for making your own realities afte=\r\nr you die, I follow a Bruce Moen style viewpoint where there are what is ca=\r\nlled Hollow heavens and hells. You go where you feel you deserve or see wha=\r\nt you expect to see, but only for a while. You slowly are brought out of th=\r\nose realities by helpers whose job it is to do so. Anyways, just a thought!=\r\n One of many!&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Frank R.&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Sun, 6=\r\n/21/09, purplespacefriend &lt;I&gt;&lt;purplealiengirl@...&gt;&lt;/I&gt;&lt;/B&gt; wrot=\r\ne:&lt;BR&gt;&lt;/DIV&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: rgb(16,16,255) 2px solid; PA=\r\nDDING-LEFT: 5px; MARGIN-LEFT: 5px&quot;&gt;&lt;BR&gt;From: purplespacefriend &lt;purpleal=\r\niengirl@...&gt;&lt;BR&gt;Subject: [EVP-ITC] What&#39;s up with that!?&lt;BR&gt;To: EV=\r\nP-ITC@yahoogroups.com&lt;BR&gt;Date: Sunday, June 21, 2009, 5:05 PM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV =\r\nid=3Dyiv2045429861&gt;\n&lt;DIV id=3Dygrp-text&gt;\n&lt;DIV&gt;This crap I hear about people=\r\n supposedly crossing over stuck souls with a box? &lt;BR&gt;&lt;BR&gt;Does not anyone g=\r\net the concept that you create what you expect in the paranormal? If you th=\r\nink there&#39;s hauntings, you create the evidence to support that. If you thin=\r\nk there&#39;s stuck souls you&#39;ll have no shortage of ghosts screaming for your =\r\nsuperhuman help. Of course, you also create the illusion of being the big e=\r\nxpert as well-which is what I think many want most.&lt;BR&gt;&lt;BR&gt;Just a suggestio=\r\nn-- but grow up people!&lt;BR&gt;&lt;BR&gt;F-S&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/=\r\ntd&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n\n\n      \r\n--0-599278566-1245672842=:75345--"}