{"id": "15149", "subject": "Re: [EVP-ITC] Why does 1 digital recorder capture EVP over another", "author": "Zack Widup", "timestamp": "2009-06-24T13:19:17Z", "full_text": "There&#39;s another possibility: possibly the spirits involved only wish to\nimpart sounds to a particular unit or units.\n\nI was surprised on one investigation I was on to get mostly all the same EVP\non my DVR, which was hanging from my belt, and my camcorder, which was in\nfront of my face. Other people on the investigation didn&#39;t get them at all.\nGo figure!\n:-)\n\nZack\n\nOn Tue, Jun 23, 2009 at 3:26 PM, Rj &lt;rasterer@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;   There could be several reasons, and it&#39;s only conjecture without\n&gt; comparing the two specific units in questions.  But some ideas:\n&gt;\n&gt; 1) The battery level on one is different than the other, and causing one to\n&gt; function less optimally and introduce noise or artifacts into the stream.\n&gt; 2) They were not actually &#39;sitting&#39; side by side, but being swung around.\n&gt; 3) They are pointed at different areas\n&gt; 4) One may be older than the other or have been dropped a few times.\n&gt; 5) One may have been recently exposed to extreme humidity or temperatures,\n&gt; while the other remained in a comfortable environment, before doing this\n&gt; recording\n&gt; 6) One may be sitting in a position more subject by airflow or vibrations\n&gt; 7) They may use different memory cards. that have different error or\n&gt; accuracy profiles\n&gt; 8) The final sound files may have been processed differently in various\n&gt; software programs\n&gt; 9) People in the room may be nearer and moving closer to one than the other\n&gt; 10) They may simply be two different models with different recording\n&gt; sensitives and limitations\n&gt;\n&gt;\n&gt;\n&gt; --- On *Tue, 6/23/09, lechevar2000 &lt;lechevar@...&gt;* wrote:\n&gt;\n&gt;\n&gt; From: lechevar2000 &lt;lechevar@...&gt;\n&gt; Subject: [EVP-ITC] Why does 1 digital recorder capture EVP over another\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Tuesday, June 23, 2009, 5:57 AM\n&gt;\n&gt;  Hi,\n&gt; I believe I saw an explaination on this list about why if you have 2\n&gt; recorders sitting side by side, why may one capture an EVP on one and not\n&gt; the other? Someone was explaining about an energy field like a bubble.\n&gt; I&#39;m trying to explain this theory to a friend. Can someone help me?\n&gt; Thanks Laura\n&gt;\n&gt;\n&gt; \n&gt;\n\nThe e's ano he possibili y: possibly he spi i s in ol ed only wish o impa sounds o a pa icula uni o uni s.\n \nI was su p ised on one in es iga ion I was on o ge mos ly all he same EVP on my DVR, which was hanging om my bel , and my camco de , which was in on o my ace. O he people on he in es iga ion didn' ge hem a all. Go igu e! \n\n:-)\n \nZack\nOn Tue, Jun 23, 2009 a 3:26 PM, Rj as e e @...m> w o e:\n\n\n\n\n\n\n\n\n\nThe e could be se e al easons, and i 's only conjec u e wi hou compa ing he wo speci ic uni s in ques ions.  Bu some ideas:1) The ba e y le el on one is di e en han he o he , and causing one o unc ion less op imally and in oduce noise o a i ac s in o he s eam.\n2) They we e no ac ually 'si ing' side by side, bu being swung a ound.3) They a e poin ed a di e en a eas4) One may be olde han he o he o ha e been d opped a ew imes.5) One may ha e been ecen ly exposed o ex eme humidi y o empe a u es, while he o he emained in a com o able en i onmen , be o e doing his eco ding\n6) One may be si ing in a posi ion mo e subjec by ai low o ib a ions7) They may use di e en memo y ca ds. ha ha e di e en e o o accu acy p o iles8) The inal sound iles may ha e been p ocessed di e en ly in a ious so wa e p og ams\n9) People in he oom may be nea e and mo ing close o one han he o he 10) They may simply be wo di e en models wi h di e en eco ding sensi i es and limi a ions--- On Tue, 6/23/09, leche a 2000 leche a @...> w o e:\n\nF om: leche a 2000 leche a @ e izon.ne >Subjec : [EVP-ITC] Why does 1 digi al eco de cap u e EVP o e ano he \nTo: EVP-ITC@yahoog oups.comDa e: Tuesday, June 23, 2009, 5:57 AM \n\n\n\nHi, I belie e I saw an explaina ion on his lis abou why i you ha e 2 eco de s si ing side by side, why may one cap u e an EVP on one and no he o he ? Someone was explaining abou an ene gy ield like a bubble. \nI'm ying o explain his heo y o a iend. Can someone help me? Thanks Lau a"}