{"id": "15146", "subject": "Re: [EVP-ITC] Re: Beginner Going to attempt to make his first box.", "author": "Zack Widup", "timestamp": "2009-06-23T14:44:26Z", "full_text": "Looks good to me!  Op amps are cheap ways of getting function generation.\nAnd the p-n junction of a transistor or a diode is a great way to generate\nnoise. Just gotta amplify it.\n\nThose old 1N21 bullet diodes would generate nose up into the microwave\nspectrum.\n\nZack\n\nOn Tue, Jun 23, 2009 at 12:47 AM, purplespacefriend &lt;\npurplealiengirl@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; That&#39;s why I use the op amps--SIMPLE!. I can&#39;t do math, so there&#39;s no way\n&gt; to use discrete components. I use a simple op amp function generator to\n&gt; creat the triangle wave used for linear sweep. I use the op amps as an\n&gt; anmplifier in the random system to amplify the white noise from a\n&gt; transistor, and then as a filter to get rid of all but the lowest frequency\n&gt; components of the white noise to get a smooth, randomly varying DC voltage\n&gt; used to tune the radios.\n&gt;\n&gt; The radios are voltage tunable, so you have three sections to the box--a\n&gt; radio, the sweep, and the audio amplifiers. Sweep is amother name for he\n&gt; tuning voltage, also abreviated VT.\n&gt;\n&gt; So far the MK484 chip used as the tuner, combined with linear sweep is a\n&gt; simple and compact system. Most store bought radios, including the radio\n&gt; shack models are inconsistent in quality, and are often very noisy(staticy)\n&gt; when swept across their tuning range. I got tired of spending 40 bucks for a\n&gt; tuner only to have it sound like crap when the box is assembled, that&#39;s why\n&gt; I&#39;m spending alot of time on making radios. Car tuners were the worst for\n&gt; being noisy.\n&gt;\n&gt; Brief history-I started out using tuner modules form car stereos for the\n&gt; box radio. These were swept wiht a random voltage. The result was often so\n&gt; noisy that the voices could barely be heard. It did not occur to me to use\n&gt; other tuners until Bill Chapple came out with the Radio Shack hack, and I\n&gt; was like DAHHHHH! I can use other radios. So at first I sued the whole\n&gt; radio, develpoing switching to turn them on a sweep them with an external\n&gt; voltage, then finding out how to use the tuner alone, removing the control\n&gt; board. Even then the boxes were a crap shoot, as the radios were often very\n&gt; poor sounding when swept. So now I&#39;m working on various home made tuners.\n&gt;\n&gt; F-S\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Zack Widup\n&gt; &lt;w9sz.zack@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; An op amp is an &quot;operational amplifier&quot; which is essentially treated as a\n&gt; &gt; little box that amplifies linearly whatever is put into it. By using\n&gt; &gt; different resistors in a circuit you can adjust the gain of the op amp\n&gt; &gt; circuit.\n&gt; &gt;\n&gt; &gt; I&#39;m not sure exactly how Frank is using one for the tuning. It&#39;s not very\n&gt; &gt; common to use an op amp as a noise source but I think it&#39;s been done.\n&gt; There\n&gt; &gt; are better noise sources out there.\n&gt; &gt;\n&gt; &gt; Zack\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; On Mon, Jun 22, 2009 at 7:49 AM, Elaine Coates &lt;cozykat2003@...&gt;wrote:\n&gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; Thanks for this info.\n&gt; &gt; &gt;\n&gt; &gt; &gt; ------------------------------\n&gt; &gt; &gt; *From:* afterdarkdigital &lt;afterdarkdigital@...&gt;\n&gt; &gt; &gt; *To:* EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;\n&gt; &gt; &gt; *Sent:* Monday, June 15, 2009 1:22:28 PM\n&gt; &gt; &gt; *Subject:* [EVP-ITC] Re: Beginner Going to attempt to make his first\n&gt; box.\n&gt; &gt; &gt;\n&gt; &gt; &gt; There was a smaller Schematic Frank posted about using the tuner from a\n&gt; &gt; &gt; radioshack 469. It was a smaller diagram just showing where to plug\n&gt; your\n&gt; &gt; &gt; signal into the vt, and to provide the 3v into the tuner. Sorry im not\n&gt; more\n&gt; &gt; &gt; specific, im a newbie to circuits.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Frank emailed me back and said for a random sweep he no longer likes\n&gt; using\n&gt; &gt; &gt; the white noise generator, and instead prefers to use a dual supply op\n&gt; amp.\n&gt; &gt; &gt; Im not entirely sure what a op amp is or how to use it. Im assuming it\n&gt; &gt; &gt; produces a random signal that can be used for the VT. BUt I need to do\n&gt; alot\n&gt; &gt; &gt; more research to learn what it really does.\n&gt; &gt; &gt;\n&gt; &gt; &gt; --- In EVP-ITC@yahoogroups .com &lt;EVP-ITC%40yahoogroups.com&gt;, Elaine\n&gt; Coates\n&gt; &gt; &gt; &lt;cozykat2003@ ...&gt; wrote:\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Which schematic are you using?\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; ____________ _________ _________ __\n&gt; &gt; &gt; &gt; From: afterdarkdigital &lt;afterdarkdigital@ ...&gt;\n&gt; &gt; &gt; &gt; To: EVP-ITC@yahoogroups .com &lt;EVP-ITC%40yahoogroups.com&gt;\n&gt; &gt; &gt; &gt; Sent: Saturday, June 13, 2009 7:42:13 PM\n&gt; &gt; &gt; &gt; Subject: [EVP-ITC] Beginner Going to attempt to make his first box.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Hello all,\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Thanks for having me apart of your yahoo group. Ive been researching\n&gt; this\n&gt; &gt; &gt; a lot and was overly excited to find a group that actually has frank\n&gt; posting\n&gt; &gt; &gt; in it.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; I&#39;m about to attempt to make my first box ( well i have made the\n&gt; ufogeek\n&gt; &gt; &gt; radio shack hack, but that was too easy). I plan to try and make the\n&gt; one\n&gt; &gt; &gt; with a random voltage generator that&#39;s plugged into the Radio Shack\n&gt; 499, and\n&gt; &gt; &gt; if I can do that successfully, out to an echo-box before heading out.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; My question to you all is if you could point me in the right\n&gt; direction to\n&gt; &gt; &gt; get up to speed enough on circuits and electronics via a website or\n&gt; book. I\n&gt; &gt; &gt; have no experience doing this kind of stuff. But im a quick learner and\n&gt; &gt; &gt; really want to make this happen.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Thanks for the help everyone,\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; God Bless and Good Results to you all.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; David\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nLooks good o me!  Op amps a e cheap ways o ge ing unc ion gene a ion. And he p-n junc ion o a ansis o o a diode is a g ea way o gene a e noise. Jus go a ampli y i .\n \nThose old 1N21 bulle diodes would gene a e nose up in o he mic owa e spec um.\n \nZack\nOn Tue, Jun 23, 2009 a 12:47 AM, pu plespace iend pu plealiengi l@...> w o e:\n\n\n\n\n\nTha 's why I use he op amps--SIMPLE!. I can' do ma h, so he e's no way o use disc e e componen s. I use a simple op amp unc ion gene a o o c ea he iangle wa e used o linea sweep. I use he op amps as an anmpli ie in he andom sys em o ampli y he whi e noise om a ansis o , and hen as a il e o ge id o all bu he lowes equency componen s o he whi e noise o ge a smoo h, andomly a ying DC ol age used o une he adios. \nThe adios a e ol age unable, so you ha e h ee sec ions o he box--a adio, he sweep, and he audio ampli ie s. Sweep is amo he name o he uning ol age, also ab e ia ed VT. So a he MK484 chip used as he une , combined wi h linea sweep is a simple and compac sys em. Mos s o e bough adios, including he adio shack models a e inconsis en in quali y, and a e o en e y noisy(s a icy) when swep ac oss hei uning ange. I go i ed o spending 40 bucks o a une only o ha e i sound like c ap when he box is assembled, ha 's why I'm spending alo o ime on making adios. Ca une s we e he wo s o being noisy. \nB ie his o y-I s a ed ou using une modules o m ca s e eos o he box adio. These we e swep wih a andom ol age. The esul was o en so noisy ha he oices could ba ely be hea d. I did no occu o me o use o he une s un il Bill Chapple came ou wi h he Radio Shack hack, and I was like DAHHHHH! I can use o he adios. So a i s I sued he whole adio, de elpoing swi ching o u n hem on a sweep hem wi h an ex e nal ol age, hen inding ou how o use he une alone, emo ing he con ol boa d. E en hen he boxes we e a c ap shoo , as he adios we e o en e y poo sounding when swep . So now I'm wo king on a ious home made une s. \nF-S \n--- In EVP-ITC@yahoog oups.com, Zack Widup w o e:>> An op amp is an \"ope a ional ampli ie \" which is essen ially ea ed as a\n> li le box ha ampli ies linea ly wha e e is pu in o i . By using> di e en esis o s in a ci cui you can adjus he gain o he op amp> ci cui .> > I'm no su e exac ly how F ank is using one o he uning. I 's no e y\n> common o use an op amp as a noise sou ce bu I hink i 's been done. The e> a e be e noise sou ces ou he e.> > Zack> > > On Mon, Jun 22, 2009 a 7:49 AM, Elaine Coa es w o e:\n> > >> >> > Thanks o his in o.> >> > ------------------------------> > *F om:* a e da kdigi al > > *To:* EVP-ITC@yahoog oups.com \n> > *Sen :* Monday, June 15, 2009 1:22:28 PM> > *Subjec :* [EVP-ITC] Re: Beginne Going o a emp o make his i s box.> >> > The e was a smalle Schema ic F ank pos ed abou using he une om a\n> > adioshack 469. I was a smalle diag am jus showing whe e o plug you > > signal in o he , and o p o ide he 3 in o he une . So y im no mo e> > speci ic, im a newbie o ci cui s.\n> >> > F ank emailed me back and said o a andom sweep he no longe likes using> > he whi e noise gene a o , and ins ead p e e s o use a dual supply op amp.> > Im no en i ely su e wha a op amp is o how o use i . Im assuming i \n> > p oduces a andom signal ha can be used o he VT. BU I need o do alo > > mo e esea ch o lea n wha i eally does.> >> > --- In EVP-ITC@yahoog oups .com 40yahoog oups.com>, Elaine Coa es \n> > w o e:> > >> > > Which schema ic a e you using?> > >> > >> > >> > >> > > ____________ _________ _________ __\n> > > F om: a e da kdigi al > > > To: EVP-ITC@yahoog oups .com 40yahoog oups.com> \n> > > Sen : Sa u day, June 13, 2009 7:42:13 PM> > > Subjec : [EVP-ITC] Beginne Going o a emp o make his i s box.> > >> > >> > >> > >\n> > >> > > Hello all,> > >> > > Thanks o ha ing me apa o you yahoo g oup. I e been esea ching his> > a lo and was o e ly exci ed o ind a g oup ha ac ually has ank pos ing\n> > in i .> > >> > > I'm abou o a emp o make my i s box ( well i ha e made he u ogeek> > adio shack hack, bu ha was oo easy). I plan o y and make he one> > wi h a andom ol age gene a o ha 's plugged in o he Radio Shack 499, and\n> > i I can do ha success ully, ou o an echo-box be o e heading ou .> > >> > > My ques ion o you all is i you could poin me in he igh di ec ion o> > ge up o speed enough on ci cui s and elec onics ia a websi e o book. I\n> > ha e no expe ience doing his kind o s u . Bu im a quick lea ne and> > eally wan o make his happen.> > >> > > Thanks o he help e e yone,> > >> > > God Bless and Good Resul s o you all.\n> > >> > > Da id> > >> >> > > >>"}