{"id": "15141", "subject": "Re: [EVP-ITC] Re: Beginner Going to attempt to make his first box.", "author": "Zack Widup", "timestamp": "2009-06-22T13:00:54Z", "full_text": "An op amp is an &quot;operational amplifier&quot; which is essentially treated as a\nlittle box that amplifies linearly whatever is put into it. By using\ndifferent resistors in a circuit you can adjust the gain of the op amp\ncircuit.\n\nI&#39;m not sure exactly how Frank is using one for the tuning. It&#39;s not very\ncommon to use an op amp as a noise source but I think it&#39;s been done. There\nare better noise sources out there.\n\nZack\n\n\nOn Mon, Jun 22, 2009 at 7:49 AM, Elaine Coates &lt;cozykat2003@...&gt;wrote:\n\n&gt;\n&gt;\n&gt;  Thanks for this info.\n&gt;\n&gt;  ------------------------------\n&gt; *From:* afterdarkdigital &lt;afterdarkdigital@...&gt;\n&gt; *To:* EVP-ITC@yahoogroups.com\n&gt; *Sent:* Monday, June 15, 2009 1:22:28 PM\n&gt; *Subject:* [EVP-ITC] Re: Beginner Going to attempt to make his first box.\n&gt;\n&gt;  There was a smaller Schematic Frank posted about using the tuner from a\n&gt; radioshack 469. It was a smaller diagram just showing where to plug your\n&gt; signal into the vt, and to provide the 3v into the tuner. Sorry im not more\n&gt; specific, im a newbie to circuits.\n&gt;\n&gt; Frank emailed me back and said for a random sweep he no longer likes using\n&gt; the white noise generator, and instead prefers to use a dual supply op amp.\n&gt; Im not entirely sure what a op amp is or how to use it. Im assuming it\n&gt; produces a random signal that can be used for the VT. BUt I need to do alot\n&gt; more research to learn what it really does.\n&gt;\n&gt; --- In EVP-ITC@yahoogroups .com &lt;EVP-ITC%40yahoogroups.com&gt;, Elaine Coates\n&gt; &lt;cozykat2003@ ...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Which schematic are you using?\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; ____________ _________ _________ __\n&gt; &gt; From: afterdarkdigital &lt;afterdarkdigital@ ...&gt;\n&gt; &gt; To: EVP-ITC@yahoogroups .com &lt;EVP-ITC%40yahoogroups.com&gt;\n&gt; &gt; Sent: Saturday, June 13, 2009 7:42:13 PM\n&gt; &gt; Subject: [EVP-ITC] Beginner Going to attempt to make his first box.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Hello all,\n&gt; &gt;\n&gt; &gt; Thanks for having me apart of your yahoo group. Ive been researching this\n&gt; a lot and was overly excited to find a group that actually has frank posting\n&gt; in it.\n&gt; &gt;\n&gt; &gt; I&#39;m about to attempt to make my first box ( well i have made the ufogeek\n&gt; radio shack hack, but that was too easy). I plan to try and make the one\n&gt; with a random voltage generator that&#39;s plugged into the Radio Shack 499, and\n&gt; if I can do that successfully, out to an echo-box before heading out.\n&gt; &gt;\n&gt; &gt; My question to you all is if you could point me in the right direction to\n&gt; get up to speed enough on circuits and electronics via a website or book. I\n&gt; have no experience doing this kind of stuff. But im a quick learner and\n&gt; really want to make this happen.\n&gt; &gt;\n&gt; &gt; Thanks for the help everyone,\n&gt; &gt;\n&gt; &gt; God Bless and Good Results to you all.\n&gt; &gt;\n&gt; &gt; David\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nAn op amp is an \"ope a ional ampli ie \" which is essen ially ea ed as a li le box ha ampli ies linea ly wha e e is pu in o i . By using di e en esis o s in a ci cui you can adjus he gain o he op amp ci cui .\n\n \nI'm no su e exac ly how F ank is using one o he uning. I 's no e y common o use an op amp as a noise sou ce bu I hink i 's been done. The e a e be e noise sou ces ou he e.\n \nZack\n \nOn Mon, Jun 22, 2009 a 7:49 AM, Elaine Coa es cozyka 2003@yahoo.com> w o e:\n\n\n\n\n\n\n\nThanks o his in o.\n\n\n\n\nF om: a e da kdigi al a e da kdigi al@...>\nTo: EVP-ITC@yahoog oups.comSen : Monday, June 15, 2009 1:22:28 PM\nSubjec : [EVP-ITC] Re: Beginne Going o a emp o make his i s box.\n\n\nThe e was a smalle Schema ic F ank pos ed abou using he une om a adioshack 469. I was a smalle diag am jus showing whe e o plug you signal in o he , and o p o ide he 3 in o he une . So y im no mo e speci ic, im a newbie o ci cui s.\nF ank emailed me back and said o a andom sweep he no longe likes using he whi e noise gene a o , and ins ead p e e s o use a dual supply op amp. Im no en i ely su e wha a op amp is o how o use i . Im assuming i p oduces a andom signal ha can be used o he VT. BU I need o do alo mo e esea ch o lea n wha i eally does.\n--- In EVP-ITC@yahoog oups .com, Elaine Coa es w o e:>> Which schema ic a e you using?> > \n> > > ____________ _________ _________ __> F om: a e da kdigi al > To: EVP-ITC@yahoog oups .com\n> Sen : Sa u day, June 13, 2009 7:42:13 PM> Subjec : [EVP-ITC] Beginne Going o a emp o make his i s box.> > > > > > Hello all,> > Thanks o ha ing me apa o you yahoo g oup. I e been esea ching his a lo and was o e ly exci ed o ind a g oup ha ac ually has ank pos ing in i .\n> > I'm abou o a emp o make my i s box ( well i ha e made he u ogeek adio shack hack, bu ha was oo easy). I plan o y and make he one wi h a andom ol age gene a o ha 's plugged in o he Radio Shack 499, and i I can do ha success ully, ou o an echo-box be o e heading ou .\n> > My ques ion o you all is i you could poin me in he igh di ec ion o ge up o speed enough on ci cui s and elec onics ia a websi e o book. I ha e no expe ience doing his kind o s u . Bu im a quick lea ne and eally wan o make his happen.\n> > Thanks o he help e e yone,> > God Bless and Good Resul s o you all.> > Da id>"}