{"id": "15151", "subject": "Re: [EVP-ITC] Why does 1 digital recorder capture EVP over another", "author": "Zack Widup", "timestamp": "2009-06-24T13:46:42Z", "full_text": "Interesting topic!\n\nBTW that investigation was at the former Manteno State Mental Hospital. It\nincluded the amazing &quot;It&#39;s Harold Wing&quot; EVP I got. None of the people doing\nthe investigation there had ever heard of Harold Wing. Upon later\nexamination of old records, it was found that Harold Wing was actually a\npatient who died there of typhoid fever in 1938. But we didn&#39;t find that out\nuntil weeks later.\nHow do you explain that conventionally?\n:-)\n\nZack\n\n\nOn Wed, Jun 24, 2009 at 8:36 AM, April Abercrombie &lt;\napril@abercrombieghostresearch.com&gt; wrote:\n\n&gt;\n&gt;\n&gt;  A similar thing happened to me on our last investigation too.\n&gt;\n&gt;\n&gt;  ----- Original Message -----\n&gt; *From:* Zack Widup &lt;w9sz.zack@...&gt;\n&gt; *To:* EVP-ITC@yahoogroups.com\n&gt;   *Sent:* Wednesday, June 24, 2009 7:19 AM\n&gt; *Subject:* Re: [EVP-ITC] Why does 1 digital recorder capture EVP over\n&gt; another\n&gt;\n&gt;  There&#39;s another possibility: possibly the spirits involved only wish to\n&gt; impart sounds to a particular unit or units.\n&gt;\n&gt; I was surprised on one investigation I was on to get mostly all the same\n&gt; EVP on my DVR, which was hanging from my belt, and my camcorder, which was\n&gt; in front of my face. Other people on the investigation didn&#39;t get them at\n&gt; all. Go figure!\n&gt; :-)\n&gt;\n&gt; Zack\n&gt;\n&gt; On Tue, Jun 23, 2009 at 3:26 PM, Rj &lt;rasterer@...&gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;   There could be several reasons, and it&#39;s only conjecture without\n&gt;&gt; comparing the two specific units in questions.  But some ideas:\n&gt;&gt;\n&gt;&gt; 1) The battery level on one is different than the other, and causing one\n&gt;&gt; to function less optimally and introduce noise or artifacts into the stream.\n&gt;&gt; 2) They were not actually &#39;sitting&#39; side by side, but being swung around.\n&gt;&gt; 3) They are pointed at different areas\n&gt;&gt; 4) One may be older than the other or have been dropped a few times.\n&gt;&gt; 5) One may have been recently exposed to extreme humidity or temperatures,\n&gt;&gt; while the other remained in a comfortable environment, before doing this\n&gt;&gt; recording\n&gt;&gt; 6) One may be sitting in a position more subject by airflow or vibrations\n&gt;&gt; 7) They may use different memory cards. that have different error or\n&gt;&gt; accuracy profiles\n&gt;&gt; 8) The final sound files may have been processed differently in various\n&gt;&gt; software programs\n&gt;&gt; 9) People in the room may be nearer and moving closer to one than the\n&gt;&gt; other\n&gt;&gt; 10) They may simply be two different models with different recording\n&gt;&gt; sensitives and limitations\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; --- On *Tue, 6/23/09, lechevar2000 &lt;lechevar@...&gt;* wrote:\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; From: lechevar2000 &lt;lechevar@verizon.net&gt;\n&gt;&gt; Subject: [EVP-ITC] Why does 1 digital recorder capture EVP over another\n&gt;&gt; To: EVP-ITC@yahoogroups.com\n&gt;&gt; Date: Tuesday, June 23, 2009, 5:57 AM\n&gt;&gt;\n&gt;&gt;  Hi,\n&gt;&gt; I believe I saw an explaination on this list about why if you have 2\n&gt;&gt; recorders sitting side by side, why may one capture an EVP on one and not\n&gt;&gt; the other? Someone was explaining about an energy field like a bubble.\n&gt;&gt; I&#39;m trying to explain this theory to a friend. Can someone help me?\n&gt;&gt; Thanks Laura\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;   \n&gt;\n\nIn e es ing opic!\n \nBTW ha in es iga ion was a he o me  Man eno S a e Men al Hospi al. I included he amazing \"I 's Ha old Wing\" EVP I go . None o he people doing he in es iga ion  he e had e e hea d o Ha old Wing. Upon la e examina ion o old eco ds, i was ound ha Ha old Wing was ac ually a pa ien who died he e o yphoid e e in 1938. Bu we didn' ind ha ou un il weeks la e .\n\nHow do you explain ha con en ionally?\n:-)\n \nZack\n \nOn Wed, Jun 24, 2009 a 8:36 AM, Ap il Abe c ombie ap il@abe c ombieghos esea ch.com> w o e:\n\n\n\n\n\n\nA simila hing happened o me on ou las in es iga ion oo.\n \n\n\n----- O iginal Message ----- \nF om: Zack Widup \nTo: EVP-ITC@yahoog oups.com \n\n\n\nSen : Wednesday, June 24, 2009 7:19 AM\nSubjec : Re: [EVP-ITC] Why does 1 digi al eco de cap u e EVP o e ano he \n\n\n\nThe e's ano he possibili y: possibly he spi i s in ol ed only wish o impa sounds o a pa icula uni o uni s.\n \nI was su p ised on one in es iga ion I was on o ge mos ly all he same EVP on my DVR, which was hanging om my bel , and my camco de , which was in on o my ace. O he people on he in es iga ion didn' ge hem a all. Go igu e! \n\n:-)\n \nZack\nOn Tue, Jun 23, 2009 a 3:26 PM, Rj as e e @...> w o e:\n\n\n\n\n\n\n\n\n\nThe e could be se e al easons, and i 's only conjec u e wi hou compa ing he wo speci ic uni s in ques ions.  Bu some ideas:1) The ba e y le el on one is di e en han he o he , and causing one o unc ion less op imally and in oduce noise o a i ac s in o he s eam.\n2) They we e no ac ually 'si ing' side by side, bu being swung a ound.3) They a e poin ed a di e en a eas4) One may be olde han he o he o ha e been d opped a ew imes.5) One may ha e been ecen ly exposed o ex eme humidi y o empe a u es, while he o he emained in a com o able en i onmen , be o e doing his eco ding\n6) One may be si ing in a posi ion mo e subjec by ai low o ib a ions7) They may use di e en memo y ca ds. ha ha e di e en e o o accu acy p o iles8) The inal sound iles may ha e been p ocessed di e en ly in a ious so wa e p og ams\n9) People in he oom may be nea e and mo ing close o one han he o he 10) They may simply be wo di e en models wi h di e en eco ding sensi i es and limi a ions--- On Tue, 6/23/09, leche a 2000 leche a @...> w o e:\n\nF om: leche a 2000 leche a @ e izon.ne >Subjec : [EVP-ITC] Why does 1 digi al eco de cap u e EVP o e ano he \nTo: EVP-ITC@yahoog oups.comDa e: Tuesday, June 23, 2009, 5:57 AM \n\n\n\nHi, I belie e I saw an explaina ion on his lis abou why i you ha e 2 eco de s si ing side by side, why may one cap u e an EVP on one and no he o he ? Someone was explaining abou an ene gy ield like a bubble. \nI'm ying o explain his heo y o a iend. Can someone help me? Thanks Lau a"}