{"id": "15175", "subject": "recorder is fine", "author": "James W. Hyslope", "timestamp": "2009-06-26T02:58:22Z", "full_text": "After telling it to leave I haven&#39;t noticed any problems. I ran an unusually long recording today (17 minutes) without a problem. Got a few EVP&#39;s but not enough voice to understand anything. But I am sure all is well. Not having much luck during this heat :) I am uploading the file called &quot;recorder malfunction&quot; it is rather large 902kb so will erase real soon. BEWARE: at 10 second mark it gets very LOUD!! When he starts messing with it I guess. Then he has some noise spikes later in the recording that are not as loud. As for his VOICE....it is in the file called &quot;get out of my face&quot; in &quot;Jim&#39;s RR-DR60 EVP&#39;s&quot; at the files location. The voice was found in the 3rd recording attempt out in the country....it was at the begining around the 5 second mark. --- In EVP-ITC@yahoogroups.com, eamonn mgherbi &lt;eamonnmgherbi@...&gt; wrote:\n&gt;\n&gt; wow, cant wait to hear that, has anything happened since you asked the man to leave, any problems with the recorder?\n&gt; \n&gt; \n&gt; \n&gt; ________________________________\n&gt; From: April Abercrombie &lt;april@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Thursday, 25 June, 2009 14:33:22\n&gt; Subject: Re: [EVP-ITC] sometimes they get you while your coming AND going :)\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Bummer!\n&gt; \n&gt; ----- Original Message ----- \n&gt; &gt;From: James W. Hyslope \n&gt; &gt;To: EVP-ITC@yahoogroups .com \n&gt; &gt;Sent: Wednesday, June 24, 2009 8:46 PM\n&gt; &gt;Subject: [EVP-ITC] sometimes they get you while your coming AND going :)\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;I went out to record today out in country. Was about 3 miles out-have recorded here before (Vandelia). This time my recorder was acting up (DR60). The REC led indicator would flash sometimes (supposed to remain steady) and I would notice that the timer would stay in place for sometimes 5 seconds before it would change up one number....I though I had broken it somehow. I did hear lots of LOUD splatter noises on playback while in the field. My battery indicator showed 2 of 3 bars, but I went in to town and got fresh AAA&#39;s anyway. I then went to water trough and the flashing still happened for 2 recordings here. I then said for the &quot;bad guy&quot; to leave and stop messing with my recorder. Well then on my 3rd attempt....recorder started working fine. After I finished the 3rd recording I packed up and went to the fairgrounds (just a spur of the moment) *I thought..... so at fairgrounds I recorded for a little over 10 minutes (I stopped at an old -church/school/\n&gt;  courthouse- (single room log cabin-multiple uses back then) that was used in Debuke Iowa during 1823 (think was date). And I also asked questions around 2 other reconstructed buildings from long ago. Well I got home....when my recorder was acting up in country I find a Male evp say &quot;Get Out Of My Face&quot;. I think he was guy messing with my recorder.... ....Then while at the water trough (recorder still acting up even with 2 new batteries) I finally get it to work (after telling what I think followed me &quot;to leave&quot;). At the end of my last recording (the good one) from this water trough, I hear a little girl say &quot;come to the fair....someone said&quot; ***So I didn&#39;t go to the fairgrounds uninvited*** I just decided to go for know reason I had guessed. Well what I am so &quot;disturbed&quot; about now......... is that while I was playing these other recordings I ACCIDENTALLY- ERASED my 10 plus minutes of recording from fairgrounds BEFORE I even got a chance to listen or\n&gt;  download it. OOOoooowwww! !! :) Makes me mad. No telling what could have been on there. I was INVITED&gt;&gt;&gt;&gt;shucks! ! I will upload the &quot;get out of my face&quot; as the little girl is way to quite to hear. The guy is not so quite-but is still LOW audio. I don&#39;t want him playing with my recorder anymore :/\n&gt; &gt;\n&gt; &gt;\n&gt;"}