{"id": "15177", "subject": "Re: [EVP-ITC] recorder is fine", "author": "eamonn mgherbi", "timestamp": "2009-06-26T08:48:54Z", "full_text": "--0-1114148367-1246006134=:24888\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nCool, Ill have a listen to that. Im based in the UK and I go to various poi=\r\nnts where there may be a long history of something happening and still ener=\r\ngy around. Edinburgh Castle was a success but had plenty of sad and angry v=\r\noices coming through. and even the tower of london. each time I go to a tou=\r\nr of some sort I tend to take my recorder and see if I can pick up anything=\r\n.. sometimes I dont, Sometimes they can be friendly.\n\nKeep up the good work=\r\n :-) \n\n\n\n\n________________________________\nFrom: James W. Hyslope &lt;clockdry=\r\nve@...&gt;\nTo: EVP-ITC@yahoogroups.com\nSent: Friday, 26 June, 2009 3:58:=\r\n22\nSubject: [EVP-ITC] recorder is fine\n\n\n\n\n\nAfter telling it to leave I hav=\r\nen&#39;t noticed any problems. I ran an unusually long recording today (17 minu=\r\ntes) without a problem. Got a few EVP&#39;s but not enough voice to understand =\r\nanything. But I am sure all is well. Not having much luck during this heat =\r\n:) I am uploading the file called &quot;recorder malfunction&quot; it is rather large=\r\n 902kb so will erase real soon. BEWARE: at 10 second mark it gets very LOUD=\r\n!! When he starts messing with it I guess.. Then he has some noise spikes l=\r\nater in the recording that are not as loud.. As for his VOICE....it is in t=\r\nhe file called &quot;get out of my face&quot; in &quot;Jim&#39;s RR-DR60 EVP&#39;s&quot; at the files l=\r\nocation. The voice was found in the 3rd recording attempt out in the countr=\r\ny....it was at the begining around the 5 second mark. --- In EVP-ITC@yahoog=\r\nroups .com, eamonn mgherbi &lt;eamonnmgherbi@ ....&gt; wrote:\n&gt;\n&gt; wow, cant wait =\r\nto hear that, has anything happened since you asked the man to leave, any p=\r\nroblems with the recorder?\n&gt; \n&gt; \n&gt; \n&gt; ____________ _________ _________ __\n&gt;=\r\n From: April Abercrombie &lt;april@...&gt;\n&gt; To: EVP-ITC@yahoogroups .com\n&gt; Sent:=\r\n Thursday, 25 June, 2009 14:33:22\n&gt; Subject: Re: [EVP-ITC] sometimes they g=\r\net you while your coming AND going :)\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Bummer!\n&gt; \n&gt; ----- O=\r\nriginal Message ----- \n&gt; &gt;From: James W. Hyslope \n&gt; &gt;To: EVP-ITC@yahoogroup=\r\ns .com \n&gt; &gt;Sent: Wednesday, June 24, 2009 8:46 PM\n&gt; &gt;Subject: [EVP-ITC] som=\r\netimes they get you while your coming AND going :)\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;I went out to=\r\n record today out in country. Was about 3 miles out-have recorded here befo=\r\nre (Vandelia). This time my recorder was acting up (DR60). The REC led indi=\r\ncator would flash sometimes (supposed to remain steady) and I would notice =\r\nthat the timer would stay in place for sometimes 5 seconds before it would =\r\nchange up one number....I though I had broken it somehow. I did hear lots o=\r\nf LOUD splatter noises on playback while in the field. My battery indicator=\r\n showed 2 of 3 bars, but I went in to town and got fresh AAA&#39;s anyway.. I t=\r\nhen went to water trough and the flashing still happened for 2 recordings h=\r\nere. I then said for the &quot;bad guy&quot; to leave and stop messing with my record=\r\ner. Well then on my 3rd attempt....recorder started working fine. After I f=\r\ninished the 3rd recording I packed up and went to the fairgrounds (just a s=\r\npur of the moment) *I thought..... so at fairgrounds I recorded for a littl=\r\ne over 10 minutes (I stopped at an old -church/school/\n&gt; courthouse- (singl=\r\ne room log cabin-multiple uses back then) that was used in Debuke Iowa duri=\r\nng 1823 (think was date). And I also asked questions around 2 other reconst=\r\nructed buildings from long ago. Well I got home....when my recorder was act=\r\ning up in country I find a Male evp say &quot;Get Out Of My Face&quot;. I think he wa=\r\ns guy messing with my recorder.... ....Then while at the water trough (reco=\r\nrder still acting up even with 2 new batteries) I finally get it to work (a=\r\nfter telling what I think followed me &quot;to leave&quot;). At the end of my last re=\r\ncording (the good one) from this water trough, I hear a little girl say &quot;co=\r\nme to the fair....someone said&quot; ***So I didn&#39;t go to the fairgrounds uninvi=\r\nted*** I just decided to go for know reason I had guessed. Well what I am s=\r\no &quot;disturbed&quot; about now......... is that while I was playing these other re=\r\ncordings I ACCIDENTALLY- ERASED my 10 plus minutes of recording from fairgr=\r\nounds BEFORE I even got a chance to listen or\n&gt; download it. OOOoooowwww! !=\r\n! :) Makes me mad. No telling what could have been on there. I was INVITED&gt;=\r\n&gt;&gt;&gt;shucks! ! I will upload the &quot;get out of my face&quot; as the little girl is w=\r\nay to quite to hear. The guy is not so quite-but is still LOW audio. I don&#39;=\r\nt want him playing with my recorder anymore :/\n&gt; &gt;\n&gt; &gt;\n&gt;\n\n\n\n\n\n      \r\n--0-1114148367-1246006134=:24888\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;&lt;head&gt;&lt;style type=3D&quot;text/css&quot;&gt;&lt;!-- DIV {margin:0px;} --&gt;&lt;/style&gt;&lt;/he=\r\nad&gt;&lt;body&gt;&lt;div style=3D&quot;font-family:times new roman, new york, times, serif;=\r\nfont-size:12pt&quot;&gt;&lt;DIV&gt;Cool, Ill have a listen to that. Im based in the UK an=\r\nd I go to various points where there may be a long history of something hap=\r\npening and still energy around. Edinburgh Castle was a success but had plen=\r\nty of sad and angry voices coming through. and even the tower of london. ea=\r\nch time I go to a tour of some sort I tend to take my recorder and see if I=\r\n can pick up anything. sometimes I dont, Sometimes they can be friendly.&lt;/D=\r\nIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Keep up the good work :-) &lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV style=\r\n=3D&quot;FONT-FAMILY: times new roman, new york, times, serif; FONT-SIZE: 12pt&quot;&gt;=\r\n&lt;BR&gt;\n&lt;DIV style=3D&quot;BORDER-LEFT: #1010ff 2px solid; MARGIN: 5px 0px 5px 5px;=\r\n PADDING-LEFT: 5px; FONT-FAMILY: times new roman, new york, times, serif; F=\r\nONT-SIZE: 12pt&quot;&gt;&lt;FONT size=3D2 face=3DTahoma&gt;\n&lt;HR SIZE=3D1&gt;\n&lt;B&gt;&lt;SPAN style=\r\n=3D&quot;FONT-WEIGHT: bold&quot;&gt;From:&lt;/SPAN&gt;&lt;/B&gt; James W. Hyslope &lt;clockdryve@yah=\r\noo.com&gt;&lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: bold&quot;&gt;To:&lt;/SPAN&gt;&lt;/B&gt; EVP-ITC@y=\r\nahoogroups.com&lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: bold&quot;&gt;Sent:&lt;/SPAN&gt;&lt;/B&gt; Fri=\r\nday, 26 June, 2009 3:58:22&lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: bold&quot;&gt;Subject:=\r\n&lt;/SPAN&gt;&lt;/B&gt; [EVP-ITC] recorder is fine&lt;BR&gt;&lt;/FONT&gt;&lt;BR&gt;\n&lt;DIV id=3Dygrp-text&gt;\n=\r\n&lt;P&gt;After telling it to leave I haven&#39;t noticed any problems. I ran an unusu=\r\nally long recording today (17 minutes) without a problem. Got a few EVP&#39;s b=\r\nut not enough voice to understand anything. But I am sure all is well. Not =\r\nhaving much luck during this heat :) I am uploading the file called &quot;record=\r\ner malfunction&quot; it is rather large 902kb so will erase real soon. BEWARE: a=\r\nt 10 second mark it gets very LOUD!! When he starts messing with it I guess=\r\n. Then he has some noise spikes later in the recording that are not as loud=\r\n. As for his VOICE....it is in the file called &quot;get out of my face&quot; in &quot;Jim=\r\n&#39;s RR-DR60 EVP&#39;s&quot; at the files location. The voice was found in the 3rd rec=\r\nording attempt out in the country....it was at the begining around the 5 se=\r\ncond mark. --- In &lt;A href=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot; rel=3Dnofoll=\r\now target=3D_blank ymailto=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yah=\r\noogroups .com&lt;/A&gt;, eamonn mgherbi &lt;eamonnmgherbi@ ...&gt;\n wrote:&lt;BR&gt;&gt=\r\n;&lt;BR&gt;&gt; wow, cant wait to hear that, has anything happened since you aske=\r\nd the man to leave, any problems with the recorder?&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&g=\r\nt; &lt;BR&gt;&gt; ____________ _________ _________ __&lt;BR&gt;&gt; From: April Abercro=\r\nmbie &lt;april@...&gt;&lt;BR&gt;&gt; To: &lt;A href=3D&quot;mailto:EVP-ITC%40yahoogroups.=\r\ncom&quot; rel=3Dnofollow target=3D_blank ymailto=3D&quot;mailto:EVP-ITC%40yahoogroups=\r\n.com&quot;&gt;EVP-ITC@yahoogroups .com&lt;/A&gt;&lt;BR&gt;&gt; Sent: Thursday, 25 June, 2009 14=\r\n:33:22&lt;BR&gt;&gt; Subject: Re: [EVP-ITC] sometimes they get you while your com=\r\ning AND going :)&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; Bumme=\r\nr!&lt;BR&gt;&gt; &lt;BR&gt;&gt; ----- Original Message ----- &lt;BR&gt;&gt; &gt;From: James W=\r\n. Hyslope &lt;BR&gt;&gt; &gt;To: EVP-ITC@yahoogroups .com &lt;BR&gt;&gt; &gt;Sent: Wedn=\r\nesday, June 24, 2009 8:46 PM&lt;BR&gt;&gt; &gt;Subject: [EVP-ITC] sometimes they =\r\nget you while your coming AND going :)&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &g=\r\nt;I went out to record today out in country. Was about 3 miles\n out-have re=\r\ncorded here before (Vandelia). This time my recorder was acting up (DR60). =\r\nThe REC led indicator would flash sometimes (supposed to remain steady) and=\r\n I would notice that the timer would stay in place for sometimes 5 seconds =\r\nbefore it would change up one number....I though I had broken it somehow. I=\r\n did hear lots of LOUD splatter noises on playback while in the field. My b=\r\nattery indicator showed 2 of 3 bars, but I went in to town and got fresh AA=\r\nA&#39;s anyway. I then went to water trough and the flashing still happened for=\r\n 2 recordings here. I then said for the &quot;bad guy&quot; to leave and stop messing=\r\n with my recorder. Well then on my 3rd attempt....recorder started working =\r\nfine. After I finished the 3rd recording I packed up and went to the fairgr=\r\nounds (just a spur of the moment) *I thought..... so at fairgrounds I recor=\r\nded for a little over 10 minutes (I stopped at an old -church/school/&lt;BR&gt;&g=\r\nt; courthouse- (single room log cabin-multiple uses back\n then) that was us=\r\ned in Debuke Iowa during 1823 (think was date). And I also asked questions =\r\naround 2 other reconstructed buildings from long ago. Well I got home....wh=\r\nen my recorder was acting up in country I find a Male evp say &quot;Get Out Of M=\r\ny Face&quot;. I think he was guy messing with my recorder.... .....Then while at=\r\n the water trough (recorder still acting up even with 2 new batteries) I fi=\r\nnally get it to work (after telling what I think followed me &quot;to leave&quot;). A=\r\nt the end of my last recording (the good one) from this water trough, I hea=\r\nr a little girl say &quot;come to the fair....someone said&quot; ***So I didn&#39;t go to=\r\n the fairgrounds uninvited*** I just decided to go for know reason I had gu=\r\nessed. Well what I am so &quot;disturbed&quot; about now......... is that while I was=\r\n playing these other recordings I ACCIDENTALLY- ERASED my 10 plus minutes o=\r\nf recording from fairgrounds BEFORE I even got a chance to listen or&lt;BR&gt;&gt=\r\n; download it. OOOoooowwww! !! :) Makes me mad. No\n telling what could have=\r\n been on there. I was INVITED&gt;&gt;&gt;&gt;shucks! ! I will upload the &quot;g=\r\net out of my face&quot; as the little girl is way to quite to hear. The guy is n=\r\not so quite-but is still LOW audio. I don&#39;t want him playing with my record=\r\ner anymore :/&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/P&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DI=\r\nV&gt;&lt;/div&gt;&lt;br&gt;\n\n\n\n      &lt;/body&gt;&lt;/html&gt;\r\n--0-1114148367-1246006134=:24888--"}