{"id": "15200", "subject": "Re: Simple FM receiver", "author": "purplespacefriend", "timestamp": "2009-06-28T16:58:52Z", "full_text": "Sweep is making the radio tune across the band, the modes are random, linear or manual. Random jumps arounds around the band-randomly, the idea being that the entities would comtrol the sweep by affecting the white noise transistor, and they did say they do that. Linear is a smooth sweep up, then back down the band, the entities seem to have an easier time tracking the linear sweep. Manual is done by hand on a cheapy radio with a tuning knob, it&#39;s easier wiht a radio that has a tuning knob that does the half turn from one end of the band to the other. \n\n When I first started using linear mode, I couldn&#39;t hear any of the usual voices, then all the sudden, I could hear it. So I&#39;m uncertain if it&#39;s the brain that has to adjust, of what if you have to create/allow the possiblity? I used to use radnom exclusivley, and that worked well, now I get litte with random mode. \n\n I use linear now becuase it&#39;s much easier to get the circuit to work. Random can be finicky, as you&#39;re trying to get random pulses to be amplified, and passed through the circuit.\n\n Frank-S\n\n--- In EVP-ITC@yahoogroups.com, Elaine Coates &lt;cozykat2003@...&gt; wrote:\n&gt;\n&gt; How does one know how to pick a certain sweep mode? Is that just a range of stations the chip sweeps through? If so, how does one incorporate any certain sweep?\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; ________________________________\n&gt; From: purplespacefriend &lt;purplealiengirl@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Sunday, June 28, 2009 1:21:20 AM\n&gt; Subject: [EVP-ITC] Re: Simple FM receiver\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; There&#39;s alot of steps invloved, like first you need a tuner--a voltage tunable radio. Then you have to decide what sweep modes you wants, Then whether or not you&#39;ll use an echo chamber, or need line outputs to record from. Then, what kind of board it&#39;ll be on, and last build a cabinet. \n&gt; \n&gt; Frank\n&gt; \n&gt; --- In EVP-ITC@yahoogroups .com, Elaine Coates &lt;cozykat2003@ ...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Frank, Would you please send me the circuitry schematic for building your box? My son said he would build one for me but since I am totally clueless as to what he needs to accomplish this I need your input. I have seen the ideas and info bantered about in this discussion group but I don&#39;t know what to send my sonbecause you are always tweaking the design and sending new information to the group. If you would send me exactly what me needs and the schematic I would be so grateful. -Elaine\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; ____________ _________ _________ __\n&gt; &gt; From: Frank Sumption &lt;purplealiengirl@ ...&gt;\n&gt; &gt; To: evp-itc@yahoogroups .com\n&gt; &gt; Sent: Saturday, June 27, 2009 1:54:59 AM\n&gt; &gt; Subject: [EVP-ITC] Simple FM receiver\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; http://braincambre5 00.freeservers. com/rss(1) (1)(1).htm\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; F-S\n&gt; &gt;\n&gt;"}