{"id": "15240", "subject": "Re: [EVP-ITC] Michael Jackson", "author": "Zack Widup", "timestamp": "2009-07-01T03:20:29Z", "full_text": "The only thing is, we don&#39;t know WHO&#39;s really saying all this stuff. Just\nbecause someone says he or she is person &quot;X&quot; doesn&#39;t prove it unless you get\nsomething only that person and a few others may know. If someone were able\nto spell my mother&#39;s maiden name you&#39;d have something!\n\nI get all sorts of e-mails from wealthy people in far away places wanting to\ngive it away to me.\n:-)\n\nZack\n\nOn Tue, Jun 30, 2009 at 5:43 PM, James W. Hyslope &lt;clockdryve@...&gt;wrote:\n\n&gt;\n&gt;\n&gt; Well would you guys think I&#39;m nuts if I told you I have a short EVP from\n&gt; Michael Jackson? I was at a park here in Des Moines, Iowa on June 28th. The\n&gt; name of the location is Prospect Park. In the original file I ask if MJ can\n&gt; hear me.....and I get a &quot;yes I can&quot;. Well then I run this through a denoise\n&gt; program and I hear &quot;yes I can&quot; then a second later I hear a young boy with a\n&gt; mockish tone say &quot;your talking in the last mike&quot; (also think I hear a young\n&gt; girl later but can&#39;t make it out)*I MIGHT understand the girl, but won&#39;t\n&gt; make a statement at this time. The boy is easier to hear in the denoised\n&gt; program (better than Michael). BUT both voices are hard to hear. Maybe you\n&gt; can amplify for yourself.....that way I won&#39;t SPLATTER the audio to much and\n&gt; you might be able to adjust for yourself. If someone wants the unedited WAV\n&gt; file that&#39;s 1.16MB I can send to email address. That way you might be able\n&gt; to -denoise- or enhance MUCH better than I am able to. I can just make out\n&gt; what is said........but I assure you&gt;&gt;&gt;&gt;it is in there!!! I am sending the\n&gt; MP3 to my files folder, it is the denoised version. I&#39;m not to familiar with\n&gt; the denoise program so I think I used the default settings. Jim H\n&gt;\n&gt; \n&gt;\n\nThe only hing is, we don' know WHO's eally saying all his s u . Jus because someone says he o she is pe son \"X\" doesn' p o e i unless you ge some hing only ha pe son and a ew o he s may know. I someone we e able o spell my mo he 's maiden name you'd ha e some hing!\n\n \nI ge all so s o e-mails om weal hy people in a away places wan ing o gi e i away o me.\n:-)\n \nZack\nOn Tue, Jun 30, 2009 a 5:43 PM, James W. Hyslope clockd y e@...> w o e:\n\n\n\n\n\nWell would you guys hink I'm nu s i I old you I ha e a sho EVP om Michael Jackson? I was a a pa k he e in Des Moines, Iowa on June 28 h. The name o he loca ion is P ospec Pa k. In he o iginal ile I ask i MJ can hea me.....and I ge a \"yes I can\". Well hen I un his h ough a denoise p og am and I hea \"yes I can\" hen a second la e I hea a young boy wi h a mockish one say \"you alking in he las mike\" (also hink I hea a young gi l la e bu can' make i ou )*I MIGHT unde s and he gi l, bu won' make a s a emen a his ime. The boy is easie o hea in he denoised p og am (be e han Michael). BUT bo h oices a e ha d o hea . Maybe you can ampli y o you sel ..... ha way I won' SPLATTER he audio o much and you migh be able o adjus o you sel . I someone wan s he unedi ed WAV ile ha 's 1.16MB I can send o email add ess. Tha way you migh be able o -denoise- o enhance MUCH be e han I am able o. I can jus make ou wha is said........bu I assu e you>>>>i is in he e!!! I am sending he MP3 o my iles olde , i is he denoised e sion. I'm no o amilia wi h he denoise p og am so I hink I used he de aul se ings. Jim H"}