{"id": "15250", "subject": "Re: [EVP-ITC] Re: Michael Jackson", "author": "Misty Dawn", "timestamp": "2009-07-01T21:01:02Z", "full_text": "--0-881214833-1246482062=:82447\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nI imagine that with mediumship as well as evp its all just &quot;interesting&quot; bi=\r\nts of info until someone can confirm the information coming thru as concret=\r\ne evidence. I also imagine theres a long line of people attempting contact =\r\nwith MJ at this very moment and attempting confimation thru other avenues l=\r\nike you are. Maybe wait a bit then try again and perhaps they will respond =\r\nto your messages. Keep us informed Bonnie!\n=A0\nI think Jim is more excited =\r\nhe got a response to his question than anything. (Yayyy Jim!) It is very ex=\r\nciting work! I also know that often information is given for family in grie=\r\nf that has little to do with us. I dont always understand the information o=\r\nr weird nicknames are given that seem irrelevant to me but to the family me=\r\nmber its means everything and makes perfect sense. They never cease to amaz=\r\ne me with the confirmations that there is more to life after the body passe=\r\ns.\n=A0\nSpirit has ways of making sure the messages get thru to the right pe=\r\nrson at the right time. The method they choose to use is up to them and isn=\r\n&#39;t always what=A0I expect.\n=A0\nMisty\n\n\n      \r\n--0-881214833-1246482062=:82447\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;DIV&gt;I imagine that with mediumship as well a=\r\ns evp its all just &quot;interesting&quot; bits of info until someone can confirm the=\r\n information coming thru as concrete evidence. I also imagine theres a long=\r\n line of people attempting contact with MJ at this very moment and attempti=\r\nng confimation thru other avenues like you are. Maybe wait a bit then try a=\r\ngain and perhaps they will respond to your messages. Keep us informed Bonni=\r\ne!&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I think Jim is more excited he got a respon=\r\nse to his question than anything. (Yayyy Jim!) It is very exciting work! I =\r\nalso know that often information is given for family in grief that has litt=\r\nle to do with us. I dont always understand the information or weird nicknam=\r\nes are given that seem irrelevant to me but to the family member its means =\r\neverything and makes perfect sense. They never cease to amaze me with the c=\r\nonfirmations that there is more to life after the body passes.&lt;/DIV&gt;\n&lt;DIV&gt;&=\r\nnbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Spirit has ways of making sure the messages get thru to th=\r\ne right person at the right time. The method they choose to use is up to th=\r\nem and isn&#39;t always what&nbsp;I expect.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Misty&lt;=\r\n/DIV&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n      \r\n--0-881214833-1246482062=:82447--"}