{"id": "15317", "subject": "Re: Serious need of tech help!", "author": "reignstorm", "timestamp": "2009-07-08T21:58:28Z", "full_text": "Dan- Did you receive my email? Robb\n\n--- In EVP-ITC@yahoogroups.com, Daniel Conners &lt;mycincyghost@...&gt; wrote:\n&gt;\n&gt; send me a email with the ones you have in mind.\n&gt; \n&gt; \n&gt; Daniel Conners\n&gt; Founder/Lead Paranormal Investigator\n&gt; www.mycincyghost.com\n&gt; http://www.myspace.com/mycincyghost\n&gt; \n&gt; Team UPI Staff\n&gt; www.teamupi.com\n&gt; MCG Email: cowboy@...\n&gt; TEAM UPI Email: dan@...\n&gt; Phone: 513-478-5790\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Disclaimer &quot; 7/6/09\n&gt; This email and any files transmitted with it are confidential and intended solely for Dan Conners. If you are not the named addressee (or responsible for delivery of the message to such person), you should not disseminate, distribute, copy or alter this email. In such case, you should destroy this message, and notify us immediately. If you or your employer does not consent to Internet email messages of this kind, please advise us immediately.. Opinions, conclusions and other information expressed in this message are not given or endorsed by My Cincy Ghost unless otherwise indicated by an authorized representative independent of this message. Warning: My Cincy Ghost has taken reasonable precautions to ensure no viruses are present in this email, the company cannot accept responsibility for any loss or damage arising from the use of this email or attachments.\n&gt;  \n&gt; \n&gt; --- On Tue, 7/7/09, reignstorm &lt;robbghi@...&gt; wrote:\n&gt; \n&gt; \n&gt; From: reignstorm &lt;robbghi@...&gt;\n&gt; Subject: [EVP-ITC] Re: Serious need of tech help!\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Tuesday, July 7, 2009, 10:27 PM\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; I would be interested in having some of the items created by Mike Coletta (www.ufogeek. com) built. He gives full permission for anyone to re-create his prototypes and I would I be happy to if I was not so tech-backwards. Thanks. Robb\n&gt; \n&gt; --- In EVP-ITC@yahoogroups .com, &quot;mycincyghost&quot; &lt;mycincyghost@ ...&gt; wrote:\n&gt; &gt;\n&gt; &gt; what are you looking to have done Mr. Demarest?\n&gt; &gt; Daniel Conners\n&gt; &gt; Founder/Lead Paranormal Investigator\n&gt; &gt; www.mycincyghost. com\n&gt; &gt; http://www.myspace. com/mycincyghost\n&gt; &gt; \n&gt; &gt; Team UPI Staff\n&gt; &gt; www.teamupi. com\n&gt; &gt; MCG Email: cowboy@\n&gt; &gt; TEAM UPI Email: dan@\n&gt; &gt; Phone: 513-478-5790\n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups .com, &quot;reignstorm&quot; &lt;robbghi@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; Hello all! I just wanted to say hello to everyone in the group, and introduce myself. I have been active in paranormal investigation for some time.. I was hoping to find someone to help me with building existing products (labor and cost paid by me) for paranormal investigation. I was sent in this direction by Mike Coletta who spoke highly of the skills and kindness of the members of this group. I look forward to hearing from some of those tech-savvy individuals that I envy! =) Thanks in advance, Robb Demarest\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}