{"id": "15328", "subject": "Re: Some great EVP", "author": "Misty", "timestamp": "2009-07-10T00:34:35Z", "full_text": "Yeah I never really used it much before the past month. It was given to me a long tme ago to record some classes for work and used it once or twice for evp but liked the results from my pc mic better. Dug it out again when I went to meet my friends for the group session and had great results so figured I would keep using it off and on.\n\nMisty\n\n--- In EVP-ITC@...m, &quot;April Abercrombie&quot; &lt;april@...&gt; wrote:\n&gt;\n&gt; Holy cow!! Yeah..pretty cool is an understatement!!! LOL!! Pretty fricken awesome!!!\n&gt; \n&gt;   ----- Original Message ----- \n&gt;   From: Misty \n&gt;   To: EVP-ITC@yahoogroups.com \n&gt;   Sent: Thursday, July 09, 2009 6:05 PM\n&gt;   Subject: [EVP-ITC] Re: Some great EVP\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;   Nope nobody around but there were people a few blocks away joining in the city fireworks celebration display. Couldnt hear any of them just their fireworks popping noises. Sounds like they are right outside in my yard with me but there was nobody around. And no loud voices until I spoke just the one that seems to modify the fireworks sounds. Once I spoke they were everywhere all around my voice and overlaying. Pretty cool. \n&gt; \n&gt;   Misty\n&gt;   --- In EVP-ITC@yahoogroups.com, &quot;April Abercrombie&quot; &lt;april@&gt; wrote:\n&gt;   &gt;\n&gt;   &gt; There was no one else in the yard with you?? Not even in adjacent yards or something??\n&gt;   &gt; \n&gt;   &gt; I clearly hear a female speaking.\n&gt;   &gt; \n&gt;   &gt; ----- Original Message ----- \n&gt;   &gt; From: Misty Dawn \n&gt;   &gt; To: EVP-ITC@yahoogroups.com \n&gt;   &gt; Sent: Thursday, July 09, 2009 5:24 PM\n&gt;   &gt; Subject: [EVP-ITC] Some great EVP\n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; I have uploaded a few of my recent evp recorded on my olympus handheld from my circle group meeting we held when Keith Clark came down to visit us. It was great to meet him and Deborah Preece after knowing them both for so long online! They are both as passionate about this subject as I am.\n&gt;   &gt; \n&gt;   &gt; I also uploaded some fantastic evp I recorded on the 4th of July out in my yard alone (if one is ever really alone LOL I think the voices contradict that statement). Almost all voices were quite loud and clear for my ears and required no filter or enhancement. You can listen to them here:\n&gt;   &gt; \n&gt;   &gt; http://www.esnips.com/web/NewEVPVoices\n&gt;   &gt; \n&gt;   &gt; Enjoy!\n&gt;   &gt; Misty\n&gt;   &gt;\n&gt;"}