{"id": "15358", "subject": "Nostradamus & 2012", "author": "April Abercrombie", "timestamp": "2009-07-17T00:59:34Z", "full_text": "------=_NextPart_000_0259_01CA0647.8EF97C00\r\nContent-Type: text/plain;\n\tcharset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nDoes Nostradamus agree with the Mayan calendar about a coming change?\n\nBy S=\r\ntephen Wagner, July 13, 2009\n\nOn July 10, 2009, The History Channel aired a=\r\n two-hour documentary on the prophecies of Nostradamus and how they might r=\r\nelate to 2012. It was the latest in a growing heap of information, theories=\r\n, fears, warnings, enlightenment and anxiety about the year 2012, so perhap=\r\ns it&#39;s time I throw in my two cents. \n\nI have never put much stock in the s=\r\nupposed Mayan prophecy that 2012 will mark the end of the world, the end of=\r\n an era or however you want to view it. I mean, haven&#39;t we been through thi=\r\ns countless times? Some predicted May 5, 2000, as doomsday because the plan=\r\nets were in rough alignment. Then there was the hysteria over the millenniu=\r\nm and Y2K. And of course various religious cults have named date after date=\r\n when the world would surely end, all of which came and went without so muc=\r\nh as a hiccup. \n\nThe year 2012 will be no different. Yes, the subject is se=\r\nlling a lot of books, drawing large audiences for talk radio and counting u=\r\np lots of hits on websites, but I think that&#39;s the most drama we&#39;ll get out=\r\n of 2012. It, too, will come and go without a major shift on the planet. Do=\r\nn&#39;t we all really know that? \n\nThose promoting the 2012 changes have thrown=\r\n out a wide range of possibilities for what might happen - everything from =\r\na literal end of the world, to dramatic social, economic, political and cli=\r\nmatic upheaval, to a &quot;spiritual awakening,&quot; which, of course, could mean al=\r\nmost anything.\n\nWhy 2012?\n\nAnd what is it based on? Primarily, it&#39;s based o=\r\nn an ancient Mayan &quot;long count&quot; calendar, carved on stone, which according =\r\nto calculations ends on December 21, 2012 and marks the end of a 5,126-year=\r\n era. Without a doubt, the ancient Mayans were remarkable mathematicians an=\r\nd astronomers, but can we really take this &quot;prophecy&quot; seriously? First of a=\r\nll, it&#39;s not even a prophecy. It happens to be when their long count calend=\r\nar ends. Why should that hold any significance for us? \n\nThe second reason =\r\nproponents of this coming apocalypse say it is on its way is that in 2012 t=\r\nhere will be an alignment of sorts with the center of our galaxy. Because t=\r\nhe Earth wobbles slowly as it rotates (once about every 26,000 years) the s=\r\nun will appear to rise in alignment with the center of the Milky Way. Inter=\r\nesting, yes, but there seems to be no cosmological evidence of any kind tha=\r\nt this should have an effect on our planet, physically, socially or even sp=\r\niritually. \n\nThe third reason touted is that the sun is scheduled to be at =\r\na &quot;solar maximum&quot; in that year, a time when sun spots and solar flares are =\r\nvery active. This kind of activity really can cause problems. Such activity=\r\n can disable and damage satellites and can have a dramatic effect on the Ea=\r\nrth&#39;s weather. The schedule is based on past patterns of such activity, but=\r\n we have no way of knowing whether it will happen in 2012, and if it does h=\r\now severe it might be. \n\nStrained Interpretations\n\nBack to the Nostradamus =\r\ndocumentary for a moment. As usual, the Nostradamus experts quoted a select=\r\nion of his quatrains - those that feature famine, pestilence, war, etc. - a=\r\nnd strained to tie them into 2012. Not successfully, in my opinion. The wor=\r\nld has always been plagued with famine, pestilence, war and the rest of it,=\r\n and I saw no quatrain that even remotely indicated that what Nostradamus w=\r\nas talking about was the year 2012.\n\nAside from the quatrains, the document=\r\nary focused mainly on the so-called &quot;Lost Book of Nostradamus,&quot; which was d=\r\niscovered in a modern library in Rome in 1994. Dating to 1629, the manuscri=\r\npt, filled the bright watercolor drawings, is titled Nostradamus Vatinicia =\r\nCode and has on the inside the name Michel de Notredame as the author. Firs=\r\nt of all, although this &quot;lost book&quot; is thought by some to be the work of No=\r\nstradamus, there is no definitive proof or scholarly consensus that he was =\r\nactually the author; some experts have serious doubts. So to make this book=\r\n the platform for this documentary puts it on very shaky ground. \n\nAnd then=\r\n the lengths to which the talking heads on the show reached and strained to=\r\n connect the drawings to 2012 was positively ludicrous. For example, the dr=\r\nawing of a sword, held pointing up and around which is looped a banner or s=\r\ncroll (see illustration above) - this was interpreted as the sun&#39;s alignmen=\r\nt with the galactic center in 2012. Really? The other drawings were likewis=\r\ne twisted and mangled to fit the interpretations needed for the argument. W=\r\ne all know that we can take such enigmatic drawings - and quatrains - and i=\r\nnterpret them to fit virtually any scenario that we want. \n\nSo What Will Ha=\r\nppen?\n\nWhy are some people obsessed with 2012 (apart from its marketing asp=\r\nects)? Why are they obsessed with apocalypse and the end of the world? Why =\r\nis it always seen as right around the corner? \n\nI think the answer is that =\r\nwe both fear and want great change. As wonderful as the world can be, it is=\r\n, as noted earlier, continually plagued by war, economic difficulties, fami=\r\nne and climate shifts. This stuff is not new. They are continuing problems =\r\nthat ebb and flow on the planet. While we fear that it&#39;s going to get worse=\r\n (and it certainly can get worse), at the same time we have the hope that i=\r\nt&#39;s going to get better. We fear the catastrophes of an apocalypse, yet we =\r\nhope for that spiritual awakening that will save us from our own human natu=\r\nre. \n\nI&#39;m no Nostradamus, but here&#39;s my prediction for 2012: the world will=\r\n continue on pretty much as it has in the past. There will be dire problems=\r\n and there will be great joys. Perhaps some problems will get a bit worse t=\r\nhan they are right now, but there will be no earth-shattering catastrophe. =\r\nIf there is a spiritual awakening, it won&#39;t be on a planetary or mass scale=\r\n through some unspecified miracle, as some hope, it will be as individuals.=\r\n (But that has nothing to do with 2012.) The best we can shoot for is that =\r\nas individuals we do our best to make our own small fragments of the Earth =\r\nbetter places. This has always been the case and ever shall be.\n\r\n------=_NextPart_000_0259_01CA0647.8EF97C00\r\nContent-Type: text/html;\n\tcharset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML 4.0 Transitional//EN&quot;&gt;\n&lt;HTML&gt;&lt;HEAD&gt;=\r\n\n&lt;META content=3D&quot;text/html; charset=3Diso-8859-1&quot; http-equiv=3DContent-Typ=\r\ne&gt;\n&lt;META name=3DGENERATOR content=3D&quot;MSHTML 8.00.6001.18783&quot;&gt;\n&lt;STYLE&gt;&lt;/STYL=\r\nE&gt;\n&lt;/HEAD&gt;\n&lt;BODY bgColor=3D#ffffff&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 face=3D&quot;Myriad Pro&quot;=\r\n&gt;\n&lt;P&gt;&lt;B&gt;&lt;FONT size=3D4 face=3Dverdana&gt;&lt;FONT color=3D#800000&gt;Does Nostradamu=\r\ns agree with \nthe Mayan calendar about a coming change?&lt;/FONT&gt;&lt;BR&gt;&lt;/FONT&gt;&lt;B=\r\nR&gt;&lt;/B&gt;&lt;FONT \nsize=3D1&gt;By Stephen Wagner, July 13, 2009&lt;/FONT&gt;&lt;B&gt;&lt;BR&gt;&lt;BR&gt;&lt;/B=\r\n&gt;On July 10, 2009, \nThe History Channel aired a two-hour documentary on the=\r\n prophecies of \nNostradamus and how they might relate to 2012. It was the l=\r\natest in a growing \nheap of information, theories, fears, warnings, enlight=\r\nenment and anxiety about \nthe year 2012, so perhaps it&#39;s time I throw in my=\r\n two cents. &lt;BR&gt;&lt;BR&gt;I have \nnever put much stock in the supposed Mayan prop=\r\nhecy that 2012 will mark the end \nof the world, the end of an era or howeve=\r\nr you want to view it. I mean, haven&#39;t \nwe been through this countless time=\r\ns? Some predicted May 5, 2000, as doomsday \nbecause the planets were in rou=\r\ngh alignment. Then there was the hysteria over \nthe millennium and Y2K. And=\r\n of course various religious cults have named date \nafter date when the wor=\r\nld would surely end, all of which came and went without \nso much as a hiccu=\r\np. &lt;BR&gt;&lt;BR&gt;The year 2012 will be no different. Yes, the \nsubject is selling=\r\n a lot of books, drawing large audiences for talk radio and \ncounting up lo=\r\nts of hits on websites, but I think that&#39;s the most drama we&#39;ll \nget out of=\r\n 2012. It, too, will come and go without a major shift on the planet. \nDon&#39;=\r\nt we all really know that? &lt;BR&gt;&lt;BR&gt;Those promoting the 2012 changes have \nt=\r\nhrown out a wide range of possibilities for what might happen =96 everythin=\r\ng from \na literal end of the world, to dramatic social, economic, political=\r\n and climatic \nupheaval, to a &quot;spiritual awakening,&quot; which, of course, coul=\r\nd mean almost \nanything.&lt;/P&gt;\n&lt;P&gt;&lt;B&gt;&lt;FONT color=3D#800000 face=3Dverdana&gt;Why=\r\n 2012?&lt;/FONT&gt;&lt;FONT \nsize=3D2&gt;&lt;BR&gt;&lt;BR&gt;&lt;/B&gt;&lt;/FONT&gt;And what is it based on? Pr=\r\nimarily, it&#39;s based on an \nancient Mayan &quot;long count&quot; calendar, carved on s=\r\ntone, which according to \ncalculations ends on December 21, 2012 and marks =\r\nthe end of a 5,126-year era. \nWithout a doubt, the ancient Mayans were rema=\r\nrkable mathematicians and \nastronomers, but can we really take this &quot;prophe=\r\ncy&quot; seriously? First of all, \nit&#39;s not even a prophecy. It happens to be wh=\r\nen their long count calendar ends. \nWhy should that hold any significance f=\r\nor us? &lt;BR&gt;&lt;BR&gt;The second reason \nproponents of this coming apocalypse say =\r\nit is on its way is that in 2012 there \nwill be an alignment of sorts with =\r\nthe center of our galaxy. Because the Earth \nwobbles slowly as it rotates (=\r\nonce about every 26,000 years) the sun will appear \nto rise in alignment wi=\r\nth the center of the Milky Way. Interesting, yes, but \nthere seems to be no=\r\n cosmological evidence of any kind that this should have an \neffect on our =\r\nplanet, physically, socially or even spiritually. &lt;BR&gt;&lt;BR&gt;The \nthird reason=\r\n touted is that the sun is scheduled to be at a &quot;solar maximum&quot; in \nthat ye=\r\nar, a time when sun spots and solar flares are very active. This kind of \na=\r\nctivity really can cause problems. Such activity can disable and damage \nsa=\r\ntellites and can have a dramatic effect on the Earth&#39;s weather. The schedul=\r\ne \nis based on past patterns of such activity, but we have no way of knowin=\r\ng \nwhether it will happen in 2012, and if it does how severe it might be. \n=\r\n&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;FONT color=3D#800000 face=3Dverdana&gt;Strained Interpretations&lt;/F=\r\nONT&gt;&lt;FONT \nsize=3D2&gt;&lt;BR&gt;&lt;BR&gt;&lt;/B&gt;&lt;/FONT&gt;Back to the Nostradamus documentary =\r\nfor a moment. As \nusual, the Nostradamus experts quoted a selection of his =\r\nquatrains =96 those that \nfeature famine, pestilence, war, etc. =96 and str=\r\nained to tie them into 2012. Not \nsuccessfully, in my opinion. The world ha=\r\ns always been plagued with famine, \npestilence, war and the rest of it, and=\r\n I saw no quatrain that even remotely \nindicated that what Nostradamus was =\r\ntalking about was the year \n2012.&lt;BR&gt;&lt;BR&gt;Aside from the quatrains, the docu=\r\nmentary focused mainly on the \nso-called &quot;Lost Book of Nostradamus,&lt;WBR&gt;&quot; w=\r\nhich was discovered in a modern \nlibrary in Rome in 1994. Dating to 1629, t=\r\nhe manuscript, filled the bright \nwatercolor drawings, is titled &lt;I&gt;Nostrad=\r\namus Vatinicia Code&lt;/I&gt; and has on the \ninside the name Michel de Notredame=\r\n as the author. First of all, although this \n&quot;lost book&quot; is thought by some=\r\n to be the work of Nostradamus, there is no \ndefinitive proof or scholarly =\r\nconsensus that he was actually the author; some \nexperts have serious doubt=\r\ns. So to make this book the platform for this \ndocumentary puts it on very =\r\nshaky ground. &lt;BR&gt;&lt;BR&gt;And then the lengths to which \nthe talking heads on t=\r\nhe show reached and strained to connect the drawings to \n2012 was positivel=\r\ny ludicrous. For example, the drawing of a sword, held \npointing up and aro=\r\nund which is looped a banner or scroll (see illustration \nabove) =96 this w=\r\nas interpreted as the sun&#39;s alignment with the galactic center in \n2012. Re=\r\nally? The other drawings were likewise twisted and mangled to fit the \ninte=\r\nrpretations needed for the argument. We all know that we can take such \neni=\r\ngmatic drawings =96 and quatrains =96 and interpret them to fit virtually a=\r\nny \nscenario that we want. &lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;FONT color=3D#800000 face=3Dverdana&gt;=\r\nSo What Will \nHappen?&lt;/FONT&gt;&lt;FONT size=3D2&gt;&lt;BR&gt;&lt;BR&gt;&lt;/B&gt;&lt;/FONT&gt;Why are some =\r\npeople obsessed with \n2012 (apart from its marketing aspects)? Why are they=\r\n obsessed with apocalypse \nand the end of the world? Why is it always seen =\r\nas right around the corner? \n&lt;BR&gt;&lt;BR&gt;I think the answer is that we both fea=\r\nr and want great change. As \nwonderful as the world can be, it is, as noted=\r\n earlier, continually plagued by \nwar, economic difficulties, famine and cl=\r\nimate shifts. This stuff is not new. \nThey are continuing problems that ebb=\r\n and flow on the planet. While we fear that \nit&#39;s going to get worse (and i=\r\nt certainly &lt;I&gt;can&lt;/I&gt; get worse), at the same \ntime we have the hope that =\r\nit&#39;s going to get better. We fear the catastrophes of \nan apocalypse, yet w=\r\ne hope for that spiritual awakening that will save us from \nour own human n=\r\nature. &lt;BR&gt;&lt;BR&gt;I&#39;m no Nostradamus, but here&#39;s my prediction for \n2012: the =\r\nworld will continue on pretty much as it has in the past. There will \nbe di=\r\nre problems and there will be great joys. Perhaps some problems will get a =\r\n\nbit worse than they are right now, but there will be no earth-shattering \n=\r\ncatastrophe. If there is a spiritual awakening, it won&#39;t be on a planetary =\r\nor \nmass scale through some unspecified miracle, as some hope, it will be a=\r\ns \nindividuals. (But that has nothing to do with 2012.) The best we can sho=\r\not for \nis that as individuals we do our best to make our own small fragmen=\r\nts of the \nEarth better places. This has always been the case and ever shal=\r\nl \nbe.&lt;/P&gt;&lt;/FONT&gt;&lt;/DIV&gt;&lt;/BODY&gt;&lt;/HTML&gt;\n\r\n------=_NextPart_000_0259_01CA0647.8EF97C00--"}