{"id": "15385", "subject": "Re: [EVP-ITC] Re: So--maybe Edison did...", "author": "Zack Widup", "timestamp": "2009-07-20T04:57:40Z", "full_text": "Tuned Radio Frequency radios are what the very earliest tube radios were.\nThey use a series of amplifiers tuned to the exact frequency you want to\nhear, followed by some sort of a detector to convert the final signal into\naudio. The advantage is that you only get the signal you want to receive.\nThe disadvantage is needing tuning circuits that all have to line up and\ntrack each other for each amplifier stage.\n\nEventually superheterodyne radios were developed, which mix the radio\nfrequency you want to receive with another frequency signal (the &quot;local\noscillator&quot;) to get either the sum or difference frequency. This is\namplified in a series of amplifiers called the &quot;IF,&quot; or Intermediate\nFrequency chain. The advantage is that you amplify only one frequency, the\nIF frequency, so you don&#39;t need all those separate tuned stages. You can\nalso use expensive filters such as crystal filters that only filter one\nfrequency. The disadvantage is getting mixing products from harmonics of the\nvarious signals that can cause you to receive more than one signal at once,\nas well as get &quot;birdies&quot; and other undesirable things.\nZack\n\n\nOn Sun, Jul 19, 2009 at 11:24 PM, purplespacefriend &lt;\npurplealiengirl@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; It&#39;s techno-bable, stands for Tuned Radio Frequency, a type of radio\n&gt; receiver in use since day one of radio.\n&gt;\n&gt; Frank-S\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Elaine Coates\n&gt; &lt;cozykat2003@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Dearest Frank, I wish you would not use acronyms because I am so new to\n&gt; this forum I cannot follow what the heck you are talking about...&quot;TRF&quot; -\n&gt; LOL, Elaine\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; ________________________________\n&gt; &gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt; &gt; To: evp-itc@yahoogroups.com &lt;evp-itc%40yahoogroups.com&gt;\n&gt; &gt; Sent: Saturday, July 18, 2009 11:02:37 PM\n&gt; &gt; Subject: [EVP-ITC] So--maybe Edison did... [3 Attachments]\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; [Attachment(s) from Frank Sumption included below]\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; He would have had access to radios that are capable of being swept, at\n&gt; least manually.  Pergaps the only limitation was few stations.\n&gt; &gt;\n&gt; &gt;  F-S\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nTuned Radio F equency adios a e wha he e y ea lies ube adios we e. They use a se ies o ampli ie s uned o he exac equency you wan o hea , ollowed by some so o a de ec o o con e he inal signal in o audio. The ad an age is ha you only ge he signal you wan o ecei e. The disad an age is needing uning ci cui s ha all ha e o line up and ack each o he o each ampli ie s age.\n\n \nE en ually supe he e odyne adios we e de eloped, which mix he adio equency you wan o ecei e wi h ano he equency signal ( he \"local oscilla o \")  o ge ei he he sum o di e ence equency. This is ampli ied in a se ies o ampli ie s called he \"IF,\" o In e media e F equency chain. The ad an age is ha you ampli y only one equency, he IF equency, so you don' need all hose sepa a e  uned s ages. You can also use expensi e il e s such as c ys al il e s ha only il e one equency. The disad an age is ge ing mixing p oduc s om ha monics o he a ious signals ha can cause you o ecei e mo e han one signal a once, as well as ge \"bi dies\" and o he undesi able hings.\n\nZack\n \nOn Sun, Jul 19, 2009 a 11:24 PM, pu plespace iend pu plealiengi l@...> w o e:\n\n  \n\n\n\nI 's echno-bable, s ands o Tuned Radio F equency, a ype o adio ecei e in use since day one o adio. F ank-S \n--- In EVP-ITC@yahoog oups.com, Elaine Coa es w o e:>> Dea es F ank, I wish you would no use ac onyms because I am so new o his o um I canno ollow wha he heck you a e alking abou ...\"TRF\" - LOL, Elaine\n> > > > > ________________________________> F om: F ank Sump ion \n> To: e p-i c@yahoog oups.com> Sen : Sa u day, July 18, 2009 11:02:37 PM> Subjec : [EVP-ITC] So--maybe Edison did... [3 A achmen s]\n> >   > [A achmen (s) om F ank Sump ion included below] \n> > > He would ha e had access o adios ha a e capable o being swep , a leas manually.  Pe gaps he only limi a ion was  ew s a ions.> >  F-S>"}