{"id": "15394", "subject": "Re: [EVP-ITC] Here&#39;s a weird EVP site", "author": "Zack Widup", "timestamp": "2009-07-21T14:38:14Z", "full_text": "Weird and wild!\n\nI was contacted by some people in a nearby city who had inherited the house\ntheir mother and father left behind. Their father had died about a year\nearlier and their mother died 3 months after him. They had three very\nstrange messages left on their answering machine. The first one freaked them\nout so much they erased it but they kept the other two. I copied the\nrecordings onto a pocket digital voice recorder and tried to do some\nprocessing on the audio, which is very garbled and distorted. But I did get\nthat it was their father trying to leave them messages.\n\nThey haven&#39;t had any strange happenings since, so I guess their father went\nsomewhere else eventually.\n\nZack\n\nOn Tue, Jul 21, 2009 at 8:36 AM, Frank Sumption\n&lt;purplealiengirl@...&gt;wrote:\n\n&gt;\n&gt;\n&gt;\n&gt; http://www.evpreversespeaking.com/2009/07/20/a-phone-message-from-spirits-evp/\n&gt;\n&gt;\n&gt;  I AC powered TRF-3 but it was picking up some static, so I added a three\n&gt; wire power cord so the box can be grounded, that got rid of the noise. I\n&gt; ground the circuit ground buss to the AC ground wire.\n&gt;\n&gt;  Frank-S\n&gt;\n&gt; \n&gt;\n\nWei d and wild!\n \nI was con ac ed by some people in a nea by ci y who had inhe i ed he house hei mo he and a he le behind. Thei a he had died abou a yea ea lie and hei mo he died 3 mon hs a e him. They had h ee e y s ange messages le on hei answe ing machine. The i s one eaked hem ou so much hey e ased i bu hey kep he o he wo. I copied he eco dings on o a pocke digi al oice eco de and ied o do some p ocessing on he audio, which is e y ga bled and dis o ed. Bu I did ge ha i was hei a he ying o lea e hem messages.\n\n \nThey ha en' had any s ange happenings since, so I guess hei a he wen somewhe e else e en ually.\n \nZack\nOn Tue, Jul 21, 2009 a 8:36 AM, F ank Sump ion pu plealiengi l@...> w o e:\n\n  \n\n\n\n\nh p://www.e p e e sespeaking.com/2009/07/20/a-phone-message- om-spi i s-e p/\n \n \n I AC powe ed TRF-3 bu i was picking up some s a ic, so I added a h ee wi e powe co d so he box can be g ounded, ha go id o he noise. I g ound he ci cui g ound buss o he AC g ound wi e. \n \n F ank-S"}