{"id": "15440", "subject": "Re: [EVP-ITC] Re: I got your certificate", "author": "David Koenig", "timestamp": "2009-07-25T01:46:07Z", "full_text": "That&#39;s a good deal on Coffee then :-)\n\nOn Fri, Jul 24, 2009 at 9:39 PM, Steve Hultay &lt;urkel23@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;\n&gt; How about Chris Moon&#39;s Ghost Hunter University, i have a few of those\n&gt; diplomas. That and a buck can get me a half a cup of coffee.\n&gt;\n&gt; -Steve\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, &quot;Not given&quot;\n&gt; &lt;csdien@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; if you really want a Degree there are a few Universities that will\n&gt; accommodate you.\n&gt; &gt;\n&gt; &gt; here&#39;s a short list.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Universities with courses in paranormal studies and parapsychology\n&gt; degrees\n&gt; &gt;\n&gt; &gt; UK\n&gt; &gt;\n&gt; &gt; * Edinburgh - The University of Edinburgh is among the most highly\n&gt; respected in the field of parapsychology, and has awarded parapsychology\n&gt; degrees. Their Koestler Parapsychology Unit hosts considerable psi-related\n&gt; research.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; * Hertfordshire - Professor Richard Weisman researches luck and\n&gt; paranormal-related phenomena at the University of Hertfordshire.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; USA\n&gt; &gt;\n&gt; &gt; * Arizona - The Center for Consciousness Studies at the University of\n&gt; Arizona offers many courses that focus on issues related to alternative and\n&gt; paranormal studies. These include web-based courses as well as on-campus\n&gt; resources.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; * New Jersey - Princeton University takes a slightly different approach\n&gt; with Princeton Engineering Anomalies Research (PEAR), with a focus on the\n&gt; &quot;Scientific Study of Consciousness-Related Physical Phenomena&quot; including\n&gt; paranormal studies and remote perception.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; * North Carolina - Duke University&#39;s Rhine Research Center is &quot;an\n&gt; Institute for the Study of Consciousness,&quot; and offers many psi-related\n&gt; courses, workshops, and seminars.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; JAPAN\n&gt; &gt;\n&gt; &gt; * The International Society of Life Information Science (ISLIS) offers\n&gt; academic symposia and parapsychology research opportunities.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; NETHERLANDS\n&gt; &gt;\n&gt; &gt; * Amsterdam - The Psychology department at the University of Amsterdam\n&gt; has offered courses in paranormal studies. In July 2006, parapsychology\n&gt; courses were not featured at their website, which is in Dutch. With further\n&gt; research, you may find their courses, or they may feature them later. (Also\n&gt; see the nearby University of Utrecht courses, below.)\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; * Utrecht - Professor Dick J. Bierman at the University of Utrecht (UU)\n&gt; offers an Internet-based introduction to parapsychology. The University\n&gt; (on-campus) also offers courses in related fields.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Frank\n&gt; Sumption &lt;purplealiengirl@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; http://www.hollowhill.com/courses/courses.htm\n&gt; &gt; &gt;\n&gt; &gt; &gt; $14.99 for beginning. CD comes *with* the diploma! Maybe they have a\n&gt; ph.d\n&gt; &gt; &gt; course.\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nTha 's a good deal on Co ee hen :-)On F i, Jul 24, 2009 a 9:39 PM, S e e Hul ay u kel23@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n \n \nHow abou Ch is Moon's Ghos Hun e Uni e si y, i ha e a ew o hose diplomas. Tha and a buck can ge me a hal a cup o co ee.\n\n-S e e\n\n--- In EVP-ITC@yahoog oups.com, \"No gi en\" w o e:\n>\n> i you eally wan a Deg ee he e a e a ew Uni e si ies ha will accommoda e you.\n> \n> he e's a sho lis .\n> \n> \n> Uni e si ies wi h cou ses in pa ano mal s udies and pa apsychology deg ees\n> \n> UK\n> \n> * Edinbu gh - The Uni e si y o Edinbu gh is among he mos highly espec ed in he ield o pa apsychology, and has awa ded pa apsychology deg ees. Thei Koes le Pa apsychology Uni hos s conside able psi- ela ed esea ch.\n\n> \n> \n> * He o dshi e - P o esso Richa d Weisman esea ches luck and pa ano mal- ela ed phenomena a he Uni e si y o He o dshi e.\n> \n> \n> USA\n> \n> * A izona - The Cen e o Consciousness S udies a he Uni e si y o A izona o e s many cou ses ha ocus on issues ela ed o al e na i e and pa ano mal s udies. These include web-based cou ses as well as on-campus esou ces.\n\n> \n> \n> * New Je sey - P ince on Uni e si y akes a sligh ly di e en app oach wi h P ince on Enginee ing Anomalies Resea ch (PEAR), wi h a ocus on he \"Scien i ic S udy o Consciousness-Rela ed Physical Phenomena\" including pa ano mal s udies and emo e pe cep ion.\n\n> \n> \n> * No h Ca olina - Duke Uni e si y's Rhine Resea ch Cen e is \"an Ins i u e o he S udy o Consciousness,\" and o e s many psi- ela ed cou ses, wo kshops, and semina s.\n> \n> \n> JAPAN\n> \n> * The In e na ional Socie y o Li e In o ma ion Science (ISLIS) o e s academic symposia and pa apsychology esea ch oppo uni ies.\n> \n> \n> NETHERLANDS\n> \n> * Ams e dam - The Psychology depa men a he Uni e si y o Ams e dam has o e ed cou ses in pa ano mal s udies. In July 2006, pa apsychology cou ses we e no ea u ed a hei websi e, which is in Du ch. Wi h u he esea ch, you may ind hei cou ses, o hey may ea u e hem la e . (Also see he nea by Uni e si y o U ech cou ses, below.)\n\n> \n> \n> * U ech - P o esso Dick J. Bie man a he Uni e si y o U ech (UU) o e s an In e ne -based in oduc ion o pa apsychology. The Uni e si y (on-campus) also o e s cou ses in ela ed ields.\n> \n> \n> \n> --- In EVP-ITC@yahoog oups.com, F ank Sump ion w o e:\n> >\n> > h p://www.hollowhill.com/cou ses/cou ses.h m\n> > \n> > $14.99 o beginning. CD comes *wi h* he diploma! Maybe hey ha e a ph.d\n> > cou se.\n> >\n>"}