{"id": "15472", "subject": "Re: [EVP-ITC] Re: Here&#39;s a question...", "author": "Zack Widup", "timestamp": "2009-07-27T17:09:07Z", "full_text": "Chris Moon aside, I don&#39;t think there&#39;s any way you have of knowing.\nEspecially when predicting something to happen in the future. All you can do\nis wait and see if it happens or not.\n\nIt&#39;s even more difficult than telling if one of your friends is lying, which\ncan be difficult enough sometimes.\n\nZack\n\nOn Mon, Jul 27, 2009 at 9:31 AM, Rick &lt;rasterer@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Doesn&#39;t Chris Moon say there are only so many people who can operate these\n&gt; devices (30?), that that&#39;ve been chosen to do so?\n&gt;\n&gt; If so, and you are one of them, then you shouldn&#39;t have to ask that\n&gt; question. And if not, then I guess asking doesn&#39;t help.\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Frank Sumption\n&gt; &lt;purplealiengirl@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; What EVP statements does one choose to be false, and which is true? This\n&gt; is\n&gt; &gt; from that cell phone video, as noted, at the end &quot;earth is doomed&quot;. Do I\n&gt; &gt; just assume this must be negative, so disregard it? Who&#39;s in charge of of\n&gt; &gt; determining what is valid, and what is not?\n&gt; &gt;\n&gt; &gt; Frank-S\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nCh is Moon aside, I don' hink he e's any way you ha e o knowing. Especially when p edic ing some hing o happen in he u u e. All you can do is wai and see i i happens o no .\n \nI 's e en mo e di icul han elling i one o you iends is lying, which can be di icul enough some imes.\n \nZack\nOn Mon, Jul 27, 2009 a 9:31 AM, Rick as e e @yahoo.com> w o e:\n\n  \n\n\n\nDoesn' Ch is Moon say he e a e only so many people who can ope a e hese de ices (30?), ha ha ' e been chosen o do so?I so, and you a e one o hem, hen you shouldn' ha e o ask ha ques ion. And i no , hen I guess asking doesn' help. \n--- In EVP-ITC@yahoog oups.com, F ank Sump ion w o e:>> Wha EVP s a emen s does one choose o be alse, and which is ue? This is\n> om ha cell phone ideo, as no ed, a he end \"ea h is doomed\". Do I> jus assume his mus be nega i e, so dis ega d i ? Who's in cha ge o o > de e mining wha is alid, and wha is no ?\n> > F ank-S>"}