{"id": "15493", "subject": "Re: Rachel", "author": "Misty", "timestamp": "2009-07-28T17:51:07Z", "full_text": "Very interesting Frank. \n\nTheres a voice I have heard since I was a child. In the old house there was a man and a woman who carried on a neverending conversation and I never could understand what all was being said. I grew up hearing them. It used to drive me nuts because nobody else admitted they could hear them and I was too small to understand. \n\nWhen I reached adulthood and went to move back in the old house, it had been empty for over a year, and at the door my friend heard their voices. She asked me why the tv was on she thought the power was off. I was amazed because that was the first time someone else could hear them besides me. I said wow you hear them? The powers been off for over a year and there is no tv or radios in the house. Freaked her out a bit. I always just thought the place was haunted.\n\nYears later after moving to a different house I was thrown into this research after recording my mothers voice over 10 years after her death. Since then I have recorded many voices including the voice of the man and the woman I grew up hearing in that old house. One day I asked her what her name was and she replied with Rachel.\n\nI&#39;ve recorded the voice of Rachel many times over the years. Its much better when I can turn the sound up and play it back!! =)\n\nThe others talk about her too, they slap many labels on some call her Grandmother, others say she&#39;s an angel. I often wonder if she is one who used to sit on my bed at night when things were starting to freak me out. Her voice is very soothing and her messages are always peaceful in nature.\n\nShes been around for as long as I can remember but no one I knew in this lifetime physically.\n\nMisty\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  there seems to be a group of what I call the sisters. I&#39;m always gettign new names, Rachel is a recent addition.\n&gt;"}