{"id": "1550", "subject": "Re: Box 12", "author": "psi_research", "timestamp": "2007-07-13T16:42:41Z", "full_text": "I don&#39;t really have any experience in ritual magic at all. Like Frank \nR, I really was trying to introduce who the operator is and the \nintention behind Box sessions, especially since Box 21 was calling \nfor Frank S so much.\n\n Mark Macy did a calling for the ethereals to provide protection, and \nthat was something that I generally haven&#39;t been a participant to \nbefore as I come from more of an objective evidence gathering \nperspective. But experience with the Box has made me realize that the \nBoxes are more than just an assemblage of components, there is a \nparanormal phenomena going on when answers to questions are heard. \nYou can&#39;t always say it&#39;s just by chance certain words are heard that \nspecifically address the concerns of those that are present during a \nsession.\n\nThe term &quot;imprint&quot; I believe was first stated by Rosemary during that \ninitial session with Box 21 at the Stanley Hotel. When we imprinted \nher Box in Philidelphia, it was more of a focused event that \nsuggested ritual but that may be overstating it. She is experienced \nin these matters and an atmosphere was created by her that felt on \ntarget. I have a lot of respect for her and she brought in the right \namount of energy. I hope all this helps. -Bill  \n\n--- In EVP-ITC@yahoogroups.com, &quot;Frank Sumption&quot; &lt;franks-boxes@...&gt; \nwrote:\n&gt;\n&gt; DOH! That&#39;s what I thought too. Although there&#39;s alot to said for \nritual \n&gt; magic. I used to do some, but it involved tobacco rituals, as in \nNative \n&gt; American type,  and I&#39;m not allowed to touch the stuff now, but the \nresults \n&gt; were profound, even for me.\n&gt; \n&gt; Frank-S\n&gt; \n&gt; \n&gt; &gt;From: Frank Ratka &lt;warrior18eii@...&gt;\n&gt; &gt;Reply-To: EVP-ITC@yahoogroups.com\n&gt; &gt;To: EVP-ITC@yahoogroups.com\n&gt; &gt;Subject: Re: [EVP-ITC] Re: Box 12\n&gt; &gt;Date: Fri, 13 Jul 2007 04:57:03 -0700 (PDT)\n&gt; &gt;\n&gt; &gt;Oh, that&#39;s what you mean by imprinting. I had this vision in my \nhead that \n&gt; &gt;you were doing some new age, melodramatic ritual over the box to \ninfuse it \n&gt; &gt;with some kind of magical energy. All you were doing is making our \nspirit \n&gt; &gt;colleagues aware of your presence and intentions to use the box.\n&gt; &gt;\n&gt; &gt;We did the same sort of thing with a statement of intent and \nintroduction.\n&gt; &gt;\n&gt; &gt;Thanx for the feedback,\n&gt; &gt;\n&gt; &gt;Frank R.\n&gt; \n&gt; _________________________________________________________________\n&gt; http://newlivehotmail.com\n&gt;"}