{"id": "15547", "subject": "Re: Someone sent this to me---From Bruce&#39;s Yahoo group---HE&#39;S AN IDIOT !!!!", "author": "ourobouros2k2", "timestamp": "2009-07-31T17:32:52Z", "full_text": "This is exactly why I left that group. This email and the last big one he sent you were so laced with hate and ignorant statements that it opened my eyes to his truest colors. Couple points this &quot;researcher&quot; never took the time to learn. Correct me if I am wrong, but doesn&#39;t white noise as applied to your boxes mean the electronic noise coming off of junction/diode section of the RVG and not an actual sound? And as for using a 469 tuner as the tuning module of the box, who the hell thinks that is using a &quot;shack hack&quot; in the box? When you apply voltage tuning using either RVG or linear sweep, you are bypassing the internal tuning of the radio, hence completely bypassing the circuitry that makes it a &quot;shack hack&quot;. And since you aren&#39;t using the controller board of the 469, how the hell does shack hack become relevant? Just because it shares the same model number as the shack hack, when it is used as a tuning module in a box, then whether it is hacked or not is completely irrelevant. \n\nI am no expert, but I was able to build a linear &quot;box&quot; according to your plans. I found a simple triangle generator and used it to VT the headless 469. It never left the breadboard, as I was basically doing it for challenge, and I could never stabilize the sweep voltage. This wasn&#39;t a reflection on your design, but my inexperience with electronics.If I was better at it, I could probably get the thing stabilized, but just getting one sweep out of it made my head hurt. I guess what I am saying, is your help during my building process was irreplaceable and I couldn&#39;t have done it without it. People appreciate what you do.\n\nI am not an expert, just a lay researcher, and the busy pace of other life has relegated me to &quot;enthusiast&quot; here lately. I do keep up though, and I have been real encouraged to see that you have been open to doing radio shows and going to events like the QM. Building these boxes is your passion, and it is appreciated. Don&#39;t let the ramblings of other folks keep you from doing that which you love. Anyone can tell you are passionate about your work, and you just keep refining your designs. Good things are coming in that regard.\n\nSorry I will get off my soapbox now.\n\n\nAndy\n\n\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  Just FYI--I&#39;m not like these other clowns, proclaiming how great I am! I&#39;ve\n&gt; said over and over I know the older boxes are just shit, and should be\n&gt; thrown away. I also stated I&#39;m no engineer, and it takes me a long time to\n&gt; figure this stuff out, and it seems, few if anyone else can get this stuff\n&gt; to work at all. I don&#39;t sell the stuff, no one is out money, except for\n&gt; postage. I made no claims about how great my boxes are.\n&gt; \n&gt;  Haliday cuts and pastes words together to form impressive sounding\n&gt; messages, then proclaims how great he is, and that&#39;s all this crap is,\n&gt; cutting someone else down for his own benifit. The guy produces nothing on\n&gt; his own, and can&#39;t even spell radio, let alone make one! How dare you\n&gt; (hiliday) cut me down!? Talk about friggin&#39; slander!\n&gt; \n&gt;  The world is full is these scumbags all proclaiming how righteous, how\n&gt; conservative, how--whatever, the darkside is everywhere! But what really\n&gt; makes it bad is the morons that hang on every word from these show clowns!\n&gt; That &#39;s why I say I can&#39;t really take offense, like they say, consider the\n&gt; source.\n&gt; \n&gt;  So where&#39;s my incentive to continue this work? Think I&#39;ve spend enough\n&gt; endless night in the basement!\n&gt; \n&gt; \n&gt; \n&gt;  Frank-S\n&gt; \n&gt; Forwarded conversation\n&gt; Subject: Someone sent this to me---From Bruce&#39;s Yahoo group---HE&#39;S AN IDIOT\n&gt; !!!!\n&gt; ------------------------\n&gt; \n&gt; \n&gt; \n&gt; \n&gt;  Bonnie,\n&gt; \n&gt; The small 20-125 you have is light years ahead of the Frank&#39;s box in the\n&gt; quality of communication it allows you to receive. I have had two Frank&#39;s\n&gt; boxes #&#39;s 12 and 29. #12 was stolen from me by a low life that took\n&gt; advantage of my generosity. That is another story.\n&gt; I still have Frank&#39;s box #29, the reason you never hear files from me using\n&gt; that box is because it literally &quot;Sucks!&quot;\n&gt; \n&gt; Most if not all Frank&#39;s boxes are inherently filled with static white noise\n&gt; and that combined with a metal echo box and noise generator make it very\n&gt; difficult to hear anything let alone communication which is difficult enough\n&gt; to hear from a quiet box like the 125.\n&gt; \n&gt; Frank&#39;s box has seen it&#39;s day and served it&#39;s purpose in my opinion it is\n&gt; antiquated and is no where near the quality of even a small cheap RS 12-469\n&gt; as far as clarity of communication.\n&gt; \n&gt; Frank is actually using the guts from RS hacks to build his boxes now so why\n&gt; have a &quot;FRANKENBOX&quot; that is essentially an RS hack with noise added instead\n&gt; of just buying an RS box and getting better communication??\n&gt; \n&gt; Mind you this is only my opinion but it is based on years of experience with\n&gt; every box that is or has been used. I currently have 14 different boxes not\n&gt; to mention EVP maker and I have done extensive sessions and research with\n&gt; each and for my money you can give me a 20-125 every time, the Frank&#39;s box\n&gt; should be retired to the box museum where it belongs.\n&gt; \n&gt; I am the only person in this research that will come out and speak the truth\n&gt; about the Frank&#39;s box, there are many people now that have them and the only\n&gt; person you will ever hear a file from is Steve Hultay and sometimes Frank\n&gt; himself, and Frank&#39;s files are so rough you may hear 1 out of a hundred\n&gt; files the way he does due to the fact that he does not even take the time to\n&gt; do a proper session he just turns the box on and records a couple of minute\n&gt; using his CELL PHONE !\n&gt; \n&gt; Frank has his place in RTSC history due to his ALLEGED invention off the\n&gt; first ghost box and he deserves the respect for his &quot;POSSIBLE&quot;\n&gt; accomplishment but to be revered as a god in the box field NO not by me\n&gt; anyway.\n&gt; \n&gt; I use the words &quot;ALLEGED&quot; and &quot;POSSIBLE&quot; in terms of his being the first to\n&gt; create the ghost box due to some recent information that has been brought to\n&gt; my attention that concerns an individual that created, built and used A\n&gt; Radio Sweeping Ghost Box in 1969.\n&gt; \n&gt; I am gathering information and documentation now and will hopefully be able\n&gt; to dispel the myth of Frank sumption being the father of the ghost Box soon.\n&gt; \n&gt; That is to be continued!\n&gt; \n&gt; \n&gt; \n&gt; All is possible, nothing is probable\n&gt; \n&gt; Bruce\n&gt; \n&gt; ------------------------------\n&gt;"}