{"id": "1556", "subject": "RE: [EVP-ITC] Re: Box 12", "author": "Frank Sumption", "timestamp": "2007-07-13T21:39:42Z", "full_text": "Thanks Bill! After five years of buiding these things it seems it&#39;s just now \nreaching the point of actually getting a knowledge base started with other \nreseachers using the equipment. I really get very little use of the boxes \nmyself, and alot of the the operation is kind of....unexpected.\n\nMy number one focus at this point is a realiable box, so I still don&#39;t get \nmuch &quot;stick time&quot;.\n\nThe operation of the box is a curiousity, there was a couple researchers \nusing it early on, but for one it wouldn&#39;t at all, and the other, I&#39;m not \nsure what to make of his results. I don&#39;t want to say he&#39;s all wet. Not \nusing names so as to avoid those idiotic threats.\n\nThere&#39;s people here at work that can not hear the voices, no matter how \nclear it sounds to me, that always bothers me. My wife can hear them \nsometimes, like the other night when I played &quot;the ghosts love Winston (our \nsecond Yorkie)&quot; for her from the radio recording, others, she doesn&#39;t often \nhear.\n\n\nFrank-S\n\n\n&gt;From: &quot;psi_research&quot; &lt;vilhellm@...&gt;\n&gt;Reply-To: EVP-ITC@yahoogroups.com\n&gt;To: EVP-ITC@yahoogroups.com\n&gt;Subject: [EVP-ITC] Re: Box 12\n&gt;Date: Fri, 13 Jul 2007 04:39:11 -0000\n&gt;\n&gt;The idea of imprinting the Box came after a session with Box 21 that\n&gt;had myself, Rosemary, Mark Macy, and Randy Schneider all present. The\n&gt;first messages we heard were of the name &quot;Frank&quot; being called out\n&gt;repeatedly. (BTW, I just uploaded a photo of the session in a folder\n&gt;called Bill Murphy ITC. That&#39;s me standing, and from left to right\n&gt;it&#39;s Mark Macy, Randy Schneider, and Rosemary Ellen Guiley) Then we\n&gt;heard &quot;Frank Sumption&quot;.\n&gt;\n&gt;  At that point I announced that I was a friend of Frank and he gave\n&gt;me Box 21. I added that I am the operator for Box 21 from this point\n&gt;on. During the next session I did the same thing. Now I always\n&gt;announce the myself and the Box # during a session and then continue\n&gt;to work with the Box.\n&gt;\n&gt;I will copy the audio next and start posting the sound files after I\n&gt;cut them down a bit as most are about 10 to 15 minutes long.\n&gt;-Bill Murphy\n&gt;\n\n_________________________________________________________________\nhttp://newlivehotmail.com"}