{"id": "15587", "subject": "Re: [EVP-ITC] Re: Frank Sumption and Bill Murphy on Darkness Radio- links for download", "author": "Misty Dawn", "timestamp": "2009-08-04T02:08:53Z", "full_text": "--0-1190535880-1249351733=:70791\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nI think you all did a great job and the samples you used were good examples=\r\n whether ya said what they were or not. Radio hosts tend to want their show=\r\n to run their way and for their guests to follow their planned itinerary. I=\r\nf people dont like that go start your own show, do it your own way. It wasn=\r\nt a science experiment it was a talk show. With any evp method it comes dow=\r\nn to one simple idea, that is to try it yourself and get your own results a=\r\nnd prove it or disprove it for ones own self.=A0Everyone may not agree with=\r\n what you hear but its not an ego contest (for most) for who can get the be=\r\nst evp its about learning theres more out there than what is visible to the=\r\n naked eye and sharing your experience with others so that they too can try=\r\n it for themselves. There are many methods and tools for communication and =\r\nanyone who wishes to learn more can do so on their own. \n=A0\nLike Debbie sa=\r\nid you either believe it or you dont. You either want to try for yourself o=\r\nr you dont. It isnt up to us to prove or disprove the validity of it, it&#39;s =\r\nup to you the individual to come to your own conclusions for your own tests=\r\n and your own experiements.=A0There are people who=A0run around all day yel=\r\nling I saw a UFO but until you see one for yourself you=A0may just think th=\r\ney are nutcases. Even=A0if you see one you still may not believe it. That i=\r\ns your decision to make. We cant make it for you.\n=A0\nMisty\n\n--- On Mon, 8/=\r\n3/09, psi_research &lt;vilhellm@...&gt; wrote:\n\n\nFrom: psi_research &lt;vi=\r\nlhellm@...&gt;\nSubject: [EVP-ITC] Re: Frank Sumption and Bill Murphy=\r\n on Darkness Radio- links for download\nTo: EVP-ITC@yahoogroups.com\nDate: Mo=\r\nnday, August 3, 2009, 5:22 PM\n\n\n=A0 \n\n\n\nHey thanks to Steve Hultay and the =\r\nrest of the team for providing many of the files. In response to Rick, it w=\r\nas the desire of Frank and myself to play the audio samples WITHOUT providi=\r\nng the name of the file to allow the listener to make up their own mind. In=\r\n fact, I specifically made a written request to the radio show which was co=\r\npied to Frank on this and the reasons why. Their response was this wasn&#39;t a=\r\n blind evaluation of communication but rather a radio show meant to introdu=\r\nce Frank and his pioneering work in a personal way to the audience and allo=\r\nw listeners to hear swept tuned device files. It wasn&#39;t the proper forum fo=\r\nr an indepth study, it was meant to be a virtual meet and greet between Fra=\r\nnk and the Darkness Radio listeners. -Bill Murphy\n\n--- In EVP-ITC@yahoogrou=\r\nps .com, &quot;Rick&quot; &lt;rasterer@.. .&gt; wrote:\n&gt;\n&gt; Unfortunately, the examples used=\r\n were problematic.\n&gt; \n&gt; You might notice they either played the EVP, then t=\r\nold the audience what the they were supposed to hear, and then played it ag=\r\nain. Or told the audience what they were supposed to hear first. They never=\r\n just played the sound (without the leading questions), and gave the audien=\r\nce some time to decide what it was saying on their own.\n&gt; \n&gt; So while the h=\r\nistory at the start was interesting, all the examples were, sadly, more exa=\r\nmples of how people can fool themselves with pareidolia, than examples of s=\r\npirit communications.\n&gt; \n&gt; \n&gt; Note also, this also explains why prerecordin=\r\ng noises, and using them later for the source of a Q/A session, still works=\r\n. It&#39;s a tricky explanation when trying to explain how spirits are &#39;changin=\r\ng&#39; the sounds at session time. But it is an easy explanation that it wouldn=\r\n&#39;t matter whether the sounds were live or recorded, if it was just people h=\r\nearing what they wanted to hear.\n&gt; \n&gt; I realize that many people aren&#39;t out=\r\n to prove anything, and that&#39;s fine: but in this case, it seemed a point of=\r\n the interview was to demonstrate the efficacy of the box. In this case it =\r\nwould be better to either state they do not expect their examples to be pro=\r\nve anything, or if they expect to convince an audience, to use better testi=\r\nng of their results, and less leading of the audience.\n&gt; \n&gt; imho\n&gt; \n&gt; \n&gt; \n&gt;=\r\n \n&gt; --- In EVP-ITC@yahoogroups .com, Misty Dawn &lt;bulletbabea@ &gt; wrote:\n&gt; &gt;\n=\r\n&gt; &gt; I agree with Shane. That was a great talk Frank S and Bill M.! I&#39;d also=\r\n like to thank Steve and Kristin for sharing some of your EVP results with =\r\nthem to use on the show. Those were some=A0good examples of=A0Frank&#39;s box=\r\n=A0and the sweep tuning method. \n&gt; &gt; =A0\n&gt; &gt; I love it when people in this =\r\ngroup work together towards our common goal. It&#39;s a wonderful example of te=\r\namwork and treating this research (and each other) with honesty and dignity=\r\n, instead of some of the egotistical lies and deciet thats=A0being spread=\r\n=A0around out there. It helps=A0maintain focus and a better perspective on =\r\nthis subject. Great job everyone!\n&gt; &gt; =A0\n&gt; &gt; For those of you who missed t=\r\nhe show you can download and listen here:\n&gt; &gt; =A0\n&gt; &gt; MP3 Direct download l=\r\nink:\n&gt; &gt; =A0\n&gt; &gt; Darkness Radio 8-02-09 Hr 1\n&gt; &gt; Frank Sumption the creator=\r\n of the Franks&#39; Box joins us for the first time tonight. Joining Frank is D=\r\narknessRadio&#39; s Tech Talk Specialist Bill Murphy.In this hour we discuss on=\r\ne of the most popular and controversial paranormal investigative tools on t=\r\nhe market, The Franks box; a spirit communication tool. \n&gt; &gt; =A0\n&gt; &gt; http:/=\r\n/a1135. g.akamai. net/f/1135/ 18227/1h/ cchannel. download. akamai.com/ 182=\r\n27/podcast/ MINNEAPOLIS- MN/KTLK-FM/ DarknessRadio080 209_Hr1.mp3? CPROG=3D=\r\nPCAST& MARKET=3DMINNEAPOL IS-MN&NG_ FORMAT=3Dtalk& SITE_ID=3D3359& STATION_=\r\nID=3D KTLK-FM&PCAST_ AUTHOR=3D100. 3_KTLK-FM& PCAST_CAT=3D talk&PCAST_ TITL=\r\nE=3DDarkness_ Radio_on_ 100.3_KTLK- FM\n&gt; &gt; =A0\n&gt; &gt; In case thats not workin=\r\ng for you, website page with August 2 2009 Darkness Radio podcast links\n&gt; &gt;=\r\n =A0\n&gt; &gt; http://www.ktlkfm. com/cc-common/ podcast/single_ podcast.html? po=\r\ndcast=3Ddarkness radio.xml\n&gt; &gt; =A0\n&gt; &gt; Frank I&#39;m laughing at your little bu=\r\nddy barking in the background he just had to put his two barks in hehehe. W=\r\nhat a=A0cute lil mascott! \n&gt; &gt; =A0\n&gt; &gt; Misty\n&gt; &gt;\n&gt;\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n      \r\n--0-1190535880-1249351733=:70791\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;DIV&gt;I think you all did a great job and the =\r\nsamples you used were good examples whether ya said what they were or not. =\r\nRadio hosts tend to want their show to run their way and for their guests t=\r\no follow their planned itinerary. If people dont like that go start your ow=\r\nn show, do it your own way. It wasnt a science experiment it was a talk sho=\r\nw. With any evp method it comes down to one simple idea, that is to try it =\r\nyourself and get your own results and prove it or disprove it for ones own =\r\nself.&nbsp;Everyone may not agree with what you hear but its not an ego con=\r\ntest (for most) for who can get the best evp its about learning theres more=\r\n out there than what is visible to the naked eye and sharing your experienc=\r\ne with others so that they too can try it for themselves. There are many me=\r\nthods and tools for communication and anyone who wishes to learn more can d=\r\no\n so on their own. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Like Debbie said you eith=\r\ner believe it or you dont. You either want to try for yourself or you dont.=\r\n It isnt up to us to prove or disprove the validity of it, it&#39;s up to you t=\r\nhe individual to come to your own conclusions for your own tests and your o=\r\nwn experiements.&nbsp;There are people who&nbsp;run around all day yelling =\r\nI saw a UFO but until you see one for yourself you&nbsp;may just think they=\r\n are nutcases. Even&nbsp;if you see one you still may not believe it. That =\r\nis your decision to make. We cant make it for you.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n=\r\n&lt;DIV&gt;Misty&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;--- On &lt;B&gt;Mon, 8/3/09, psi_research &lt;I&gt;&lt;vilhel=\r\nlm@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;&lt;/DIV&gt;\n&lt;BLOCKQUOTE style=3D&quot;PADDING-=\r\nLEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: rgb(16,16,255) 2px solid&quot;&gt;&lt;BR&gt;Fro=\r\nm: psi_research &lt;vilhellm@...&gt;&lt;BR&gt;Subject: [EVP-ITC] Re: Fr=\r\nank Sumption and Bill Murphy on Darkness Radio- links for download&lt;BR&gt;To: E=\r\nVP-ITC@yahoogroups.com&lt;BR&gt;Date: Monday, August 3, 2009, 5:22 PM&lt;BR&gt;&lt;BR&gt;\n&lt;DI=\r\nV id=3Dyiv1311592316&gt;&lt;SPAN style=3D&quot;DISPLAY: none&quot;&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV id=\r\n=3Dygrp-text&gt;\n&lt;DIV&gt;Hey thanks to Steve Hultay and the rest of the team for =\r\nproviding many of the files. In response to Rick, it was the desire of Fran=\r\nk and myself to play the audio samples WITHOUT providing the name of the fi=\r\nle to allow the listener to make up their own mind. In fact, I specifically=\r\n made a written request to the radio show which was copied to Frank on this=\r\n and the reasons why. Their response was this wasn&#39;t a blind evaluation of =\r\ncommunication but rather a radio show meant to introduce Frank and his pion=\r\neering work in a personal way to the audience and allow listeners to hear s=\r\nwept tuned device files. It wasn&#39;t the proper forum for an indepth study, i=\r\nt was meant to be a virtual meet and greet between Frank and the Darkness R=\r\nadio listeners. -Bill Murphy&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=3D&quot;http://us.mc329.mail.=\r\nyahoo.com/mc/compose?to=3DEVP-ITC%40yahoogroups.com&quot; target=3D_blank rel=3D=\r\nnofollow ymailto=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups .=\r\ncom&lt;/A&gt;, &quot;Rick&quot;\n &lt;rasterer@.. .&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; Unfortunately=\r\n, the examples used were problematic.&lt;BR&gt;&gt; &lt;BR&gt;&gt; You might notice the=\r\ny either played the EVP, then told the audience what the they were supposed=\r\n to hear, and then played it again. Or told the audience what they were sup=\r\nposed to hear first. They never just played the sound (without the leading =\r\nquestions), and gave the audience some time to decide what it was saying on=\r\n their own.&lt;BR&gt;&gt; &lt;BR&gt;&gt; So while the history at the start was interest=\r\ning, all the examples were, sadly, more examples of how people can fool the=\r\nmselves with pareidolia, than examples of spirit communications.&lt;BR&gt;&gt; &lt;B=\r\nR&gt;&gt; &lt;BR&gt;&gt; Note also, this also explains why prerecording noises, and =\r\nusing them later for the source of a Q/A session, still works. It&#39;s a trick=\r\ny explanation when trying to explain how spirits are &#39;changing&#39; the sounds =\r\nat session time. But it is an easy explanation that it wouldn&#39;t matter whet=\r\nher the\n sounds were live or recorded, if it was just people hearing what t=\r\nhey wanted to hear.&lt;BR&gt;&gt; &lt;BR&gt;&gt; I realize that many people aren&#39;t out =\r\nto prove anything, and that&#39;s fine: but in this case, it seemed a point of =\r\nthe interview was to demonstrate the efficacy of the box. In this case it w=\r\nould be better to either state they do not expect their examples to be prov=\r\ne anything, or if they expect to convince an audience, to use better testin=\r\ng of their results, and less leading of the audience.&lt;BR&gt;&gt; &lt;BR&gt;&gt; imho=\r\n&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; --- In &lt;A href=3D&quot;http://us.mc=\r\n329.mail.yahoo.com/mc/compose?to=3DEVP-ITC%40yahoogroups.com&quot; target=3D_bla=\r\nnk rel=3Dnofollow ymailto=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yaho=\r\nogroups .com&lt;/A&gt;, Misty Dawn &lt;bulletbabea@ &gt; wrote:&lt;BR&gt;&gt; &gt;&lt;BR&gt;&=\r\ngt; &gt; I agree with Shane. That was a great talk Frank S and Bill M.! I&#39;d=\r\n also like to thank Steve and Kristin for sharing some of your EVP results =\r\nwith them\n to use on the show. Those were some&nbsp;good examples of&nbsp;F=\r\nrank&#39;s box&nbsp;and the sweep tuning method. &lt;BR&gt;&gt; &gt; &nbsp;&lt;BR&gt;&gt; &=\r\ngt; I love it when people in this group work together towards our common go=\r\nal. It&#39;s a wonderful example of teamwork and treating this research (and ea=\r\nch other) with honesty and dignity, instead of some of the egotistical lies=\r\n and deciet thats&nbsp;being spread&nbsp;around out there. It helps&nbsp;ma=\r\nintain focus and a better perspective on this subject. Great job everyone!&lt;=\r\nBR&gt;&gt; &gt; &nbsp;&lt;BR&gt;&gt; &gt; For those of you who missed the show you c=\r\nan download and listen here:&lt;BR&gt;&gt; &gt; &nbsp;&lt;BR&gt;&gt; &gt; MP3 Direct do=\r\nwnload link:&lt;BR&gt;&gt; &gt; &nbsp;&lt;BR&gt;&gt; &gt; Darkness Radio 8-02-09 Hr 1&lt;B=\r\nR&gt;&gt; &gt; Frank Sumption the creator of the Franks&#39; Box joins us for the =\r\nfirst time tonight. Joining Frank is DarknessRadio&#39; s Tech Talk Specialist =\r\nBill Murphy.In this hour we discuss one of the most popular and controversi=\r\nal\n paranormal investigative tools on the market, The Franks box; a spirit =\r\ncommunication tool. &lt;BR&gt;&gt; &gt; &nbsp;&lt;BR&gt;&gt; &gt; &lt;A href=3D&quot;http://a11=\r\n35.g.akamai.net/f/1135/18227/1h/cchannel.download.akamai.com/18227/podcast/=\r\nMINNEAPOLIS-MN/KTLK-FM/DarknessRadio080209_Hr1.mp3?CPROG=3DPCAST&amp;MARKET=\r\n=3DMINNEAPOLIS-MN&amp;NG_FORMAT=3Dtalk&amp;SITE_ID=3D3359&amp;STATION_ID=3D=\r\nKTLK-FM&amp;PCAST_AUTHOR=3D100.3_KTLK-FM&amp;PCAST_CAT=3Dtalk&amp;PCAST_TIT=\r\nLE=3DDarkness_Radio_on_100.3_KTLK-FM&quot; target=3D_blank rel=3Dnofollow&gt;http:/=\r\n/a1135. g.akamai. net/f/1135/ 18227/1h/ cchannel. download. akamai.com/ 182=\r\n27/podcast/ MINNEAPOLIS- MN/KTLK-FM/ DarknessRadio080 209_Hr1.mp3? CPROG=3D=\r\nPCAST&amp; MARKET=3DMINNEAPOL IS-MN&amp;NG_ FORMAT=3Dtalk&amp; SITE_ID=3D33=\r\n59&amp; STATION_ID=3D KTLK-FM&amp;PCAST_ AUTHOR=3D100. 3_KTLK-FM&amp; PCAST=\r\n_CAT=3D talk&amp;PCAST_ TITLE=3DDarkness_ Radio_on_ 100.3_KTLK- FM&lt;/A&gt;&lt;BR&gt;&=\r\ngt; &gt; &nbsp;&lt;BR&gt;&gt; &gt; In case thats not working for you, website pag=\r\ne with August 2 2009 Darkness\n Radio podcast links&lt;BR&gt;&gt; &gt; &nbsp;&lt;BR&gt;&=\r\ngt; &gt; &lt;A href=3D&quot;http://www.ktlkfm.com/cc-common/podcast/single_podcast.=\r\nhtml?podcast=3Ddarknessradio.xml&quot; target=3D_blank rel=3Dnofollow&gt;http://www=\r\n.ktlkfm. com/cc-common/ podcast/single_ podcast.html? podcast=3Ddarkness ra=\r\ndio.xml&lt;/A&gt;&lt;BR&gt;&gt; &gt; &nbsp;&lt;BR&gt;&gt; &gt; Frank I&#39;m laughing at your lit=\r\ntle buddy barking in the background he just had to put his two barks in heh=\r\nehe. What a&nbsp;cute lil mascott! &lt;BR&gt;&gt; &gt; &nbsp;&lt;BR&gt;&gt; &gt; Misty&lt;=\r\nBR&gt;&gt; &gt;&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/tabl=\r\ne&gt;&lt;br&gt;\n\n      \r\n--0-1190535880-1249351733=:70791--"}