{"id": "15589", "subject": "Re: [EVP-ITC] Re: Frank Sumption and Bill Murphy on Darkness Radio- \tlinks for download", "author": "David Koenig", "timestamp": "2009-08-04T02:19:55Z", "full_text": "That&#39;s what I&#39;m talking about!I thought the show was almost Perfect!Great\nrecordings .. Are these on your site?(If you have one)\nOr just here?\nThanks\nDave\n\nOn Mon, Aug 3, 2009 at 10:08 PM, Misty Dawn &lt;bulletbabea@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; I think you all did a great job and the samples you used were good examples\n&gt; whether ya said what they were or not. Radio hosts tend to want their show\n&gt; to run their way and for their guests to follow their planned itinerary. If\n&gt; people dont like that go start your own show, do it your own way. It wasnt a\n&gt; science experiment it was a talk show. With any evp method it comes down to\n&gt; one simple idea, that is to try it yourself and get your own results and\n&gt; prove it or disprove it for ones own self. Everyone may not agree with what\n&gt; you hear but its not an ego contest (for most) for who can get the best evp\n&gt; its about learning theres more out there than what is visible to the naked\n&gt; eye and sharing your experience with others so that they too can try it for\n&gt; themselves. There are many methods and tools for communication and anyone\n&gt; who wishes to learn more can do so on their own.\n&gt;\n&gt; Like Debbie said you either believe it or you dont. You either want to try\n&gt; for yourself or you dont. It isnt up to us to prove or disprove the validity\n&gt; of it, it&#39;s up to you the individual to come to your own conclusions for\n&gt; your own tests and your own experiements. There are people who run around\n&gt; all day yelling I saw a UFO but until you see one for yourself you may just\n&gt; think they are nutcases. Even if you see one you still may not believe it.\n&gt; That is your decision to make. We cant make it for you.\n&gt;\n&gt; Misty\n&gt;\n&gt; --- On *Mon, 8/3/09, psi_research &lt;vilhellm@sbcglobal.net&gt;* wrote:\n&gt;\n&gt;\n&gt; From: psi_research &lt;vilhellm@...&gt;\n&gt; Subject: [EVP-ITC] Re: Frank Sumption and Bill Murphy on Darkness Radio-\n&gt; links for download\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Monday, August 3, 2009, 5:22 PM\n&gt;\n&gt;   Hey thanks to Steve Hultay and the rest of the team for providing many\n&gt; of the files. In response to Rick, it was the desire of Frank and myself to\n&gt; play the audio samples WITHOUT providing the name of the file to allow the\n&gt; listener to make up their own mind. In fact, I specifically made a written\n&gt; request to the radio show which was copied to Frank on this and the reasons\n&gt; why. Their response was this wasn&#39;t a blind evaluation of communication but\n&gt; rather a radio show meant to introduce Frank and his pioneering work in a\n&gt; personal way to the audience and allow listeners to hear swept tuned device\n&gt; files. It wasn&#39;t the proper forum for an indepth study, it was meant to be a\n&gt; virtual meet and greet between Frank and the Darkness Radio listeners. -Bill\n&gt; Murphy\n&gt;\n&gt; --- In EVP-ITC@yahoogroups .com&lt;http://us.mc329.mail.yahoo.com/mc/compose?to=EVP-ITC%40yahoogroups.com&gt;,\n&gt; &quot;Rick&quot; &lt;rasterer@.. .&gt; wrote:\n&gt; &gt;\n&gt; &gt; Unfortunately, the examples used were problematic.\n&gt; &gt;\n&gt; &gt; You might notice they either played the EVP, then told the audience what\n&gt; the they were supposed to hear, and then played it again. Or told the\n&gt; audience what they were supposed to hear first. They never just played the\n&gt; sound (without the leading questions), and gave the audience some time to\n&gt; decide what it was saying on their own.\n&gt; &gt;\n&gt; &gt; So while the history at the start was interesting, all the examples were,\n&gt; sadly, more examples of how people can fool themselves with pareidolia, than\n&gt; examples of spirit communications.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Note also, this also explains why prerecording noises, and using them\n&gt; later for the source of a Q/A session, still works. It&#39;s a tricky\n&gt; explanation when trying to explain how spirits are &#39;changing&#39; the sounds at\n&gt; session time. But it is an easy explanation that it wouldn&#39;t matter whether\n&gt; the sounds were live or recorded, if it was just people hearing what they\n&gt; wanted to hear.\n&gt; &gt;\n&gt; &gt; I realize that many people aren&#39;t out to prove anything, and that&#39;s fine:\n&gt; but in this case, it seemed a point of the interview was to demonstrate the\n&gt; efficacy of the box. In this case it would be better to either state they do\n&gt; not expect their examples to be prove anything, or if they expect to\n&gt; convince an audience, to use better testing of their results, and less\n&gt; leading of the audience.\n&gt; &gt;\n&gt; &gt; imho\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups .com&lt;http://us.mc329.mail.yahoo.com/mc/compose?to=EVP-ITC%40yahoogroups.com&gt;,\n&gt; Misty Dawn &lt;bulletbabea@ &gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; I agree with Shane. That was a great talk Frank S and Bill M.! I&#39;d also\n&gt; like to thank Steve and Kristin for sharing some of your EVP results with\n&gt; them to use on the show. Those were some good examples of Frank&#39;s box and\n&gt; the sweep tuning method.\n&gt; &gt; &gt;\n&gt; &gt; &gt; I love it when people in this group work together towards our common\n&gt; goal. It&#39;s a wonderful example of teamwork and treating this research (and\n&gt; each other) with honesty and dignity, instead of some of the egotistical\n&gt; lies and deciet thats being spread around out there. It helps maintain focus\n&gt; and a better perspective on this subject. Great job everyone!\n&gt; &gt; &gt;\n&gt; &gt; &gt; For those of you who missed the show you can download and listen here:\n&gt; &gt; &gt;\n&gt; &gt; &gt; MP3 Direct download link:\n&gt; &gt; &gt;\n&gt; &gt; &gt; Darkness Radio 8-02-09 Hr 1\n&gt; &gt; &gt; Frank Sumption the creator of the Franks&#39; Box joins us for the first\n&gt; time tonight. Joining Frank is DarknessRadio&#39; s Tech Talk Specialist Bill\n&gt; Murphy.In this hour we discuss one of the most popular and controversial\n&gt; paranormal investigative tools on the market, The Franks box; a spirit\n&gt; communication tool.\n&gt; &gt; &gt;\n&gt; &gt; &gt; http://a1135. g.akamai. net/f/1135/ 18227/1h/ cchannel. download.\n&gt; akamai.com/ 18227/podcast/ MINNEAPOLIS- MN/KTLK-FM/ DarknessRadio080\n&gt; 209_Hr1.mp3? CPROG=PCAST& MARKET=MINNEAPOL IS-MN&NG_ FORMAT=talk&\n&gt; SITE_ID=3359& STATION_ID= KTLK-FM&PCAST_ AUTHOR=100. 3_KTLK-FM& PCAST_CAT=\n&gt; talk&PCAST_ TITLE=Darkness_ Radio_on_ 100.3_KTLK- FM&lt;http://a1135.g.akamai.net/f/1135/18227/1h/cchannel.download.akamai.com/18227/podcast/MINNEAPOLIS-MN/KTLK-FM/DarknessRadio080209_Hr1.mp3?CPROG=PCAST&MARKET=MINNEAPOLIS-MN&NG_FORMAT=talk&SITE_ID=3359&STATION_ID=KTLK-FM&PCAST_AUTHOR=100.3_KTLK-FM&PCAST_CAT=talk&PCAST_TITLE=Darkness_Radio_on_100.3_KTLK-FM&gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; In case thats not working for you, website page with August 2 2009\n&gt; Darkness Radio podcast links\n&gt; &gt; &gt;\n&gt; &gt; &gt; http://www.ktlkfm. com/cc-common/ podcast/single_ podcast.html?\n&gt; podcast=darkness radio.xml&lt;http://www.ktlkfm.com/cc-common/podcast/single_podcast.html?podcast=darknessradio.xml&gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; Frank I&#39;m laughing at your little buddy barking in the background he\n&gt; just had to put his two barks in hehehe. What a cute lil mascott!\n&gt; &gt; &gt;\n&gt; &gt; &gt; Misty\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;\n&gt;  \n&gt;\n\nTha 's wha I'm alking abou !I hough he show was almos Pe ec !G ea eco dings .. A e hese on you si e?(I you ha e one)O jus he e?ThanksDa e\nOn Mon, Aug 3, 2009 a 10:08 PM, Mis y Dawn bulle babea@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n \n I hink you all did a g ea job and he samples you used we e good examples whe he ya said wha hey we e o no . Radio hos s end o wan hei show o un hei way and o hei gues s o ollow hei planned i ine a y. I people don like ha go s a you own show, do i you own way. I wasn a science expe imen i was a alk show. Wi h any e p me hod i comes down o one simple idea, ha is o y i you sel and ge you own esul s and p o e i o disp o e i o ones own sel . E e yone may no ag ee wi h wha you hea bu i s no an ego con es ( o mos ) o who can ge he bes e p i s abou lea ning he es mo e ou he e han wha is isible o he naked eye and sha ing you expe ience wi h o he s so ha hey oo can y i o hemsel es. The e a e many me hods and ools o communica ion and anyone who wishes o lea n mo e can do\n so on hei own. \n \nLike Debbie said you ei he belie e i o you don . You ei he wan o y o you sel o you don . I isn up o us o p o e o disp o e he alidi y o i , i 's up o you he indi idual o come o you own conclusions o you own es s and you own expe iemen s. The e a e people who  un a ound all day yelling I saw a UFO bu un il you see one o you sel you may jus hink hey a e nu cases. E en i you see one you s ill may no belie e i . Tha is you decision o make. We can make i o you.\n\n \nMis y\n--- On Mon, 8/3/09, psi_ esea ch ilhellm@...> w o e:\nF om: psi_ esea ch ilhellm@...>Subjec : [EVP-ITC] Re: F ank Sump ion and Bill Mu phy on Da kness Radio- links o download\nTo: EVP-ITC@yahoog oups.comDa e: Monday, Augus 3, 2009, 5:22 PM\n  \n\nHey hanks o S e e Hul ay and he es o he eam o p o iding many o he iles. In esponse o Rick, i was he desi e o F ank and mysel o play he audio samples WITHOUT p o iding he name o he ile o allow he lis ene o make up hei own mind. In ac , I speci ically made a w i en eques o he adio show which was copied o F ank on his and he easons why. Thei esponse was his wasn' a blind e alua ion o communica ion bu a he a adio show mean o in oduce F ank and his pionee ing wo k in a pe sonal way o he audience and allow lis ene s o hea swep uned de ice iles. I wasn' he p ope o um o an indep h s udy, i was mean o be a i ual mee and g ee be ween F ank and he Da kness Radio lis ene s. -Bill Mu phy\n--- In EVP-ITC@yahoog oups .com, \"Rick\"\n w o e:>> Un o una ely, he examples used we e p oblema ic.> > You migh no ice hey ei he played he EVP, hen old he audience wha he hey we e supposed o hea , and hen played i again. O old he audience wha hey we e supposed o hea i s . They ne e jus played he sound (wi hou he leading ques ions), and ga e he audience some ime o decide wha i was saying on hei own.\n> > So while he his o y a he s a was in e es ing, all he examples we e, sadly, mo e examples o how people can ool hemsel es wi h pa eidolia, han examples o spi i communica ions.> > \n> No e also, his also explains why p e eco ding noises, and using hem la e o he sou ce o a Q/A session, s ill wo ks. I 's a icky explana ion when ying o explain how spi i s a e 'changing' he sounds a session ime. Bu i is an easy explana ion ha i wouldn' ma e whe he he\n sounds we e li e o eco ded, i i was jus people hea ing wha hey wan ed o hea .> > I ealize ha many people a en' ou o p o e any hing, and ha 's ine: bu in his case, i seemed a poin o he in e iew was o demons a e he e icacy o he box. In his case i would be be e o ei he s a e hey do no expec hei examples o be p o e any hing, o i hey expec o con ince an audience, o use be e es ing o hei esul s, and less leading o he audience.\n> > imho> > > > > --- In EVP-ITC@yahoog oups .com, Mis y Dawn w o e:\n> >> > I ag ee wi h Shane. Tha was a g ea alk F ank S and Bill M.! I'd also like o hank S e e and K is in o sha ing some o you EVP esul s wi h hem\n o use on he show. Those we e some good examples o  F ank's box and he sweep uning me hod. > >  > > I lo e i when people in his g oup wo k oge he owa ds ou common goal. I 's a wonde ul example o eamwo k and ea ing his esea ch (and each o he ) wi h hones y and digni y, ins ead o some o he ego is ical lies and decie ha s being sp ead a ound ou he e. I helps main ain ocus and a be e pe spec i e on his subjec . G ea job e e yone!\n> >  > > Fo hose o you who missed he show you can download and lis en he e:> >  > > MP3 Di ec download link:> >  > > Da kness Radio 8-02-09 H 1> > F ank Sump ion he c ea o o he F anks' Box joins us o he i s ime onigh . Joining F ank is Da knessRadio' s Tech Talk Specialis Bill Mu phy.In his hou we discuss one o he mos popula and con o e sial\n pa ano mal in es iga i e ools on he ma ke , The F anks box; a spi i communica ion ool. > >  > > h p://a1135. g.akamai. ne / /1135/ 18227/1h/ cchannel. download. akamai.com/ 18227/podcas / MINNEAPOLIS- MN/KTLK-FM/ Da knessRadio080 209_H 1.mp3? CPROG=PCAST& MARKET=MINNEAPOL IS-MN&NG_ FORMAT= alk& SITE_ID=3359& STATION_ID= KTLK-FM&PCAST_ AUTHOR=100. 3_KTLK-FM& PCAST_CAT= alk&PCAST_ TITLE=Da kness_ Radio_on_ 100.3_KTLK- FM\n> >  > > In case ha s no wo king o you, websi e page wi h Augus 2 2009 Da kness\n Radio podcas links> >  > > h p://www.k lk m. com/cc-common/ podcas /single_ podcas .h ml? podcas =da kness adio.xml\n> >  > > F ank I'm laughing a you li le buddy ba king in he backg ound he jus had o pu his wo ba ks in hehehe. Wha a cu e lil masco ! > >  > > Mis y> >>"}