{"id": "15583", "subject": "Re: Frank Sumption and Bill Murphy on Darkness Radio- links for download", "author": "psi_research", "timestamp": "2009-08-03T21:22:36Z", "full_text": "Hey thanks to Steve Hultay and the rest of the team for providing many of the files. In response to Rick, it was the desire of Frank and myself to play the audio samples WITHOUT providing the name of the file to allow the listener to make up their own mind. In fact, I specifically made a written request to the radio show which was copied to Frank on this and the reasons why. Their response was this wasn&#39;t a blind evaluation of communication but rather a radio show meant to introduce Frank and his pioneering work in a personal way to the audience and allow listeners to hear swept tuned device files. It wasn&#39;t the proper forum for an indepth study, it was meant to be a virtual meet and greet between Frank and the Darkness Radio listeners. -Bill Murphy\n\n--- In EVP-ITC@yahoogroups.com, &quot;Rick&quot; &lt;rasterer@...&gt; wrote:\n&gt;\n&gt; Unfortunately, the examples used were problematic.\n&gt; \n&gt; You might notice they either played the EVP, then told the audience what the they were supposed to hear, and then played it again.  Or told the audience what they were supposed to hear first.  They never just played the sound (without the leading questions), and gave the audience some time to decide what it was saying on their own.\n&gt; \n&gt; So while the history at the start was interesting, all the examples were, sadly, more examples of how people can fool themselves with  pareidolia, than examples of spirit communications.\n&gt; \n&gt; \n&gt; Note also, this also explains why prerecording noises, and using them later for the source of a Q/A session, still works.  It&#39;s a tricky explanation when trying to explain how spirits are &#39;changing&#39; the sounds at session time.  But it is an easy explanation that it wouldn&#39;t matter whether the sounds were live or recorded, if it was just people hearing what they wanted to hear.\n&gt; \n&gt; I realize that many people aren&#39;t out to prove anything, and that&#39;s fine: but in this case, it seemed a point of the interview was to demonstrate the efficacy of the box.  In this case it would be better to either state they do not expect their examples to be prove anything, or if they expect to convince an audience, to use better testing of their results, and less leading of the audience.\n&gt; \n&gt; imho\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Misty Dawn &lt;bulletbabea@&gt; wrote:\n&gt; &gt;\n&gt; &gt; I agree with Shane. That was a great talk Frank S and Bill M.! I&#39;d also like to thank Steve and Kristin for sharing some of your EVP results with them to use on the show. Those were somegood examples ofFrank&#39;s boxand the sweep tuning method. \n&gt; &gt; \n&gt; &gt; I love it when people in this group work together towards our common goal. It&#39;s a wonderful example of teamwork and treating this research (and each other) with honesty and dignity, instead of some of the egotistical lies and deciet thatsbeing spreadaround out there. It helpsmaintain focus and a better perspective on this subject. Great job everyone!\n&gt; &gt; \n&gt; &gt; For those of you who missed the show you can download and listen here:\n&gt; &gt; \n&gt; &gt; MP3 Direct download link:\n&gt; &gt; \n&gt; &gt; Darkness Radio 8-02-09 Hr 1\n&gt; &gt; Frank Sumption the creator of the Franks&#39; Box joins us for the first time tonight. Joining Frank is DarknessRadio&#39;s Tech Talk Specialist Bill Murphy.In this hour we discuss one of the most popular and controversial paranormal investigative tools on the market, The Franks box; a spirit communication tool. \n&gt; &gt; \n&gt; &gt; http://a1135.g.akamai.net/f/1135/18227/1h/cchannel.download.akamai.com/18227/podcast/MINNEAPOLIS-MN/KTLK-FM/DarknessRadio080209_Hr1.mp3?CPROG=PCAST&MARKET=MINNEAPOLIS-MN&NG_FORMAT=talk&SITE_ID=3359&STATION_ID=KTLK-FM&PCAST_AUTHOR=100.3_KTLK-FM&PCAST_CAT=talk&PCAST_TITLE=Darkness_Radio_on_100.3_KTLK-FM\n&gt; &gt; \n&gt; &gt; In case thats not working for you, website page with August 2 2009 Darkness Radio podcast links\n&gt; &gt; \n&gt; &gt; http://www.ktlkfm.com/cc-common/podcast/single_podcast.html?podcast=darknessradio.xml\n&gt; &gt; \n&gt; &gt; Frank I&#39;m laughing at your little buddy barking in the background he just had to put his two barks in hehehe. What acute lil mascott! \n&gt; &gt; \n&gt; &gt; Misty\n&gt; &gt;\n&gt;"}