{"id": "15609", "subject": "Re: Frank Sumption and Bill Murphy on Darkness Radio- links for download", "author": "James W. Hyslope", "timestamp": "2009-08-06T03:38:15Z", "full_text": "CORRECT...!!! Facto-Mundo... I have always had my opinion that &quot;no matter&quot; what anyone else states that they &quot;hear&quot; in there EVP&#39;s....this will NOT influence me as to what I hear. It is either there or it is not.To &quot;matric&quot; is not an option :)  --- In EVP-ITC@yahoogroups.com, &quot;Fransen, Debbie&quot; &lt;debbie.fransen@...&gt; wrote:\n&gt;\n&gt; I am sorry but I have to put my two cents in here.\n&gt; The more you listen to EVP&#39;s the more sensitive you become to what\n&gt; spirit is saying, so it \n&gt; doesn&#39;t matter if someone tells you or not, you know what you heard\n&gt; whether it&#39;s the same or not.\n&gt; And the people who listen to Darkness radio surely know what EVP is, and\n&gt; about the paranormal.\n&gt; Most are not first time listeners, so how about we not make a big issue\n&gt; this time about how\n&gt; the audience could be manipulated because they said what the EVP&#39;s were\n&gt; supposed to be saying.\n&gt; I don&#39;t know why somebody always has to be critic. It is what it\n&gt; is........\n&gt; You either believe it or you don&#39;t.........\n&gt;  \n&gt; Great interview Frank,,, It&#39;s about time you came out of the\n&gt; basement.... LOL\n&gt;  \n&gt;  \n&gt;  \n&gt; \n&gt; ________________________________\n&gt; \n&gt; From: EVP-ITC@yahoogroups.com [mailto:EVP-ITC@yahoogroups.com] On Behalf\n&gt; Of Rick\n&gt; Sent: Monday, August 03, 2009 2:53 PM\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Subject: [EVP-ITC] Re: Frank Sumption and Bill Murphy on Darkness Radio-\n&gt; links for download\n&gt; \n&gt; \n&gt;   \n&gt; \n&gt; Unfortunately, the examples used were problematic.\n&gt; \n&gt; You might notice they either played the EVP, then told the audience what\n&gt; the they were supposed to hear, and then played it again. Or told the\n&gt; audience what they were supposed to hear first. They never just played\n&gt; the sound (without the leading questions), and gave the audience some\n&gt; time to decide what it was saying on their own.\n&gt; \n&gt; So while the history at the start was interesting, all the examples\n&gt; were, sadly, more examples of how people can fool themselves with\n&gt; pareidolia, than examples of spirit communications.\n&gt; \n&gt; Note also, this also explains why prerecording noises, and using them\n&gt; later for the source of a Q/A session, still works. It&#39;s a tricky\n&gt; explanation when trying to explain how spirits are &#39;changing&#39; the sounds\n&gt; at session time. But it is an easy explanation that it wouldn&#39;t matter\n&gt; whether the sounds were live or recorded, if it was just people hearing\n&gt; what they wanted to hear.\n&gt; \n&gt; I realize that many people aren&#39;t out to prove anything, and that&#39;s\n&gt; fine: but in this case, it seemed a point of the interview was to\n&gt; demonstrate the efficacy of the box. In this case it would be better to\n&gt; either state they do not expect their examples to be prove anything, or\n&gt; if they expect to convince an audience, to use better testing of their\n&gt; results, and less leading of the audience.\n&gt; \n&gt; imho\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com &lt;mailto:EVP-ITC%40yahoogroups.com&gt; ,\n&gt; Misty Dawn &lt;bulletbabea@&gt; wrote:\n&gt; &gt;\n&gt; &gt; I agree with Shane. That was a great talk Frank S and Bill M.! Ib&#39;d\n&gt; also like to thank Steve and Kristin for sharing some of your EVP\n&gt; results with them to use on the show. Those were some good examples of\n&gt; Frank&#39;s box and the sweep tuning method. \n&gt; &gt;  \n&gt; &gt; I love it when people in this group work together towards our common\n&gt; goal. It&#39;s a wonderful example of teamwork and treating this research\n&gt; (and each other) with honesty and dignity, instead of some of the\n&gt; egotistical lies and deciet thats being spread around out there. It\n&gt; helps maintain focus and a better perspective on this subject. Great job\n&gt; everyone!\n&gt; &gt;  \n&gt; &gt; For those of you who missed the show you can download and listen here:\n&gt; &gt;  \n&gt; &gt; MP3 Direct download link:\n&gt; &gt;  \n&gt; &gt; Darkness Radio 8-02-09 Hr 1\n&gt; &gt; Frank Sumption the creator of the Franks&#39; Box joins us for the first\n&gt; time tonight. Joining Frank is DarknessRadio&#39;s Tech Talk Specialist Bill\n&gt; Murphy.In this hour we discuss one of the most popular and controversial\n&gt; paranormal investigative tools on the market, The Franks box; a spirit\n&gt; communication tool. \n&gt; &gt;  \n&gt; &gt;\n&gt; http://a1135.g.akamai.net/f/1135/18227/1h/cchannel.download.akamai.com/1\n&gt; 8227/podcast/MINNEAPOLIS-MN/KTLK-FM/DarknessRadio080209_Hr1.mp3?CPROG=PC\n&gt; AST&MARKET=MINNEAPOLIS-MN&NG_FORMAT=talk&SITE_ID=3359&STATION_ID=KTLK-FM\n&gt; &PCAST_AUTHOR=100.3_KTLK-FM&PCAST_CAT=talk&PCAST_TITLE=Darkness_Radio_on\n&gt; _100.3_KTLK-FM\n&gt; &lt;http://a1135.g.akamai.net/f/1135/18227/1h/cchannel.download.akamai.com/\n&gt; 18227/podcast/MINNEAPOLIS-MN/KTLK-FM/DarknessRadio080209_Hr1.mp3?CPROG=P\n&gt; CAST&MARKET=MINNEAPOLIS-MN&NG_FORMAT=talk&SITE_ID=3359&STATION_ID=KTLK-F\n&gt; M&PCAST_AUTHOR=100.3_KTLK-FM&PCAST_CAT=talk&PCAST_TITLE=Darkness_Radio_o\n&gt; n_100.3_KTLK-FM&gt; \n&gt; &gt;  \n&gt; &gt; In case thats not working for you, website page with August 2 2009\n&gt; Darkness Radio podcast links\n&gt; &gt;  \n&gt; &gt;\n&gt; http://www.ktlkfm.com/cc-common/podcast/single_podcast.html?podcast=dark\n&gt; nessradio.xml\n&gt; &lt;http://www.ktlkfm.com/cc-common/podcast/single_podcast.html?podcast=dar\n&gt; knessradio.xml&gt; \n&gt; &gt;  \n&gt; &gt; Frank I&#39;m laughing at your little buddy barking in the background he\n&gt; just had to put his two barks in hehehe. What a cute lil mascott! \n&gt; &gt;  \n&gt; &gt; Misty\n&gt; &gt;\n&gt;\nT"}