{"id": "15679", "subject": "I&#39;m a newbie -- Hi!", "author": "mrscaptainjack2", "timestamp": "2009-08-13T08:01:35Z", "full_text": "Just wanted to introduce myself.  My name is Jill, and I&#39;ve been experimenting with a Radio Shack Hack for a little less than two weeks.  I started out with this because I saw a box used on one of those ghost shows on TV, the ones where they only investigate in the dark, and antagonize the entities and just generally act like twelve-year-olds -- you know the shows I&#39;m talking about.  But I watch these shows because I&#39;ve recently suffered the sudden death of my brother from a brain aneurysm, and I&#39;m looking for any kind of proof that he still exists.  Before he&#39;d died, we&#39;d both suffered the loss of our dad, so we&#39;d talked a lot about contacting him.  So I can&#39;t understand why I haven&#39;t received any kind of signal from my brother since he died before last Christmas.  Hence the interest in the ghost box.\n\nI did a bunch of googling and learned about Frank&#39;s work, and about EVPs in general.  Now that I&#39;m actually getting contact with what appears to be deceased people, I&#39;m having all kinds of questions (and some observations), many of which can&#39;t be answered by traditional EVP background research.  Forgive me for asking so many (because I realize you guys don&#39;t know me from Adam), but I thought I&#39;d throw my questions and observations out there, just in case it resonates with anyone else and their experiences (and also because I&#39;m hoping to get answers!):\n\n1) They (the entities) say my name constantly in the background, mostly my last name -- is this normal?  \n\n2) They asked me to do the sessions at night -- is this because it works better at night because radio waves travel further then, and have you found this to be so?  \n\n3) They say things repeatedly, over and over again, as if to make a pattern I can pick out of the radio noise -- do you guys find this is the case?  \n\n4) Often there seems to be a delay between asking the question and getting the answer, or I get the wrong answer, almost as if they can&#39;t hear me properly.  The answer can come before the question is asked, or after the second question; or I can ask them to say THEIR name, and they say MY name instead.  Do you guys have these communication problems?  Is there any way to improve things?\n\n5) I find it interesting that the quality of what&#39;s said sounds robotic instead of like the other radio snippets.  When there is more than one part to what&#39;s said, the first part goes up, as if to signify I&#39;m to wait for the second part, which is often after some radio noise, and usually in the same tone and voice as the first part.  Rarely do I get two syllables together.  Will this improve with time?\n\n6)  Is it normal for entities to leave halfway through your conversation?  My dad&#39;s friend greeted me tonight, halfway through made a comment about &quot;people just don&#39;t care, Jill,&quot; then left (I believe my grandmother, or someone claiming to be her, told me he left).  Where do they go?  And when I ask about my brother, I&#39;m repeatedly told &quot;Brother&#39;s in bed&quot; and &quot;Can&#39;t come.&quot;  Has anyone been told stuff like this? \n\n7)  Nearly all of the answers to my questions can&#39;t be heard in real time, but only when I play the tape back.  I&#39;d say only about 5% of the answers are loud and clear enough I can make them out and respond appropriately during the session -- most of the answers are soft, and come on or just above the quieter stations that are tuned.  Will this improve with time?     \n\nOK, sorry for the extremely long post, but I&#39;m very frustrated and excited at the same time.  I also wanted to say a great big Thank You to Frank for inventing this thing:  If it wasn&#39;t for you, I wouldn&#39;t have spoken to what I think was my grandmother today.  Thanks for that, and for being a &quot;real&quot; and genuine person who selflessly shares your research with others.  I for one am very grateful!\n\nJill"}