{"id": "15685", "subject": "Re: [EVP-ITC] Training?", "author": "Elaine Coates", "timestamp": "2009-08-14T12:53:13Z", "full_text": "--0-2064734416-1250254393=:59269\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nI have had a couple sessions now and still have not heard anything.=A0 I am=\r\n wondering too if the spirits are still listening to me and letting me get =\r\nmy &quot;feet wet&quot; before they will speak to me.=A0 I have been polite and have =\r\nused both AM and FM bands.=A0 I tell them who I am, the day, time and locat=\r\nion.=A0 I let them know my purpose for communicating and I ask for their he=\r\nlp.=A0 I am being patient with the process.\n\n\n\n\n___________________________=\r\n_____\nFrom: mrscaptainjack2 &lt;jjkamp@...&gt;\nTo: EVP-ITC@...=\r\nm\nSent: Friday, August 14, 2009 1:38:17 AM\nSubject: [EVP-ITC] Training?\n\n=\r\n=A0 \nThanks so much, Misty. I will see if I can ask them to speak as one, b=\r\necause I think you hit the nail right on the head -- I do hear them speakin=\r\ng over each other, half in male, half in female, so maybe things would impr=\r\nove like you said if they organized into one collective voice. Can they sti=\r\nll answer questions about individuals this way, or are you limited to gener=\r\nalized queries?\n\nRegarding your statement: &quot;Quite often when a new speaker\n=\r\ncomes forth a bit of a training session can be heard for how they can\nspeak=\r\n so that my physical self can hear what is said.&quot; So by this, do you mean i=\r\nt&#39;s possible it takes a couple of sessions for the entity to master this ne=\r\nw method of communication? For instance, I got my grandmother&#39; s name (amon=\r\ng others) during Tuesday&#39;s session, but she said nothing, wouldn&#39;t answer o=\r\nur questions; Wednesday, she suddenly started talking and was the primary p=\r\nerson we communicated with, even correctly answered my mother&#39;s questions a=\r\nbout her childhood pets. Could this be because there&#39;s a learning curve inv=\r\nolved with talking through the radio? Does it take a session or two before =\r\nthey &quot;get the hang of it&quot;? Or is it all dependent on my skills?\n\nOh, and wa=\r\nnted to say I&#39;m going out tomorrow to buy all the canned goods at the groce=\r\nry store in anticipation of the nuclear winter we are about to endure... Ju=\r\nst kidding. Hearing about all that stuff they are predicting, it does make =\r\nme wonder, though, why they would go to such trouble to tell you all that a=\r\ngain and again -- what&#39;s to gain from it? It&#39;s not stirring anybody up. \n\n\n\r\n--0-2064734416-1250254393=:59269\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;&lt;head&gt;&lt;style type=3D&quot;text/css&quot;&gt;&lt;!-- DIV {margin:0px;} --&gt;&lt;/style&gt;&lt;/he=\r\nad&gt;&lt;body&gt;&lt;div style=3D&quot;font-family:arial, helvetica, sans-serif;font-size:1=\r\n4pt&quot;&gt;&lt;DIV&gt;I have had a couple sessions now and still have not heard anythin=\r\ng.&nbsp; I am wondering too if the spirits are still listening to me and le=\r\ntting me get my &quot;feet wet&quot; before they will speak to me.&nbsp; I have been =\r\npolite and have used both AM and FM bands.&nbsp; I tell them who I am, the =\r\nday, time and location.&nbsp; I let them know my purpose for communicating =\r\nand I ask for their help.&nbsp; I am being patient with the process.&lt;BR&gt;&lt;/D=\r\nIV&gt;\n&lt;DIV style=3D&quot;FONT-FAMILY: arial, helvetica, sans-serif; FONT-SIZE: 14p=\r\nt&quot;&gt;&lt;BR&gt;\n&lt;DIV style=3D&quot;BORDER-LEFT: #1010ff 2px solid; MARGIN: 5px 0px 5px 5=\r\npx; PADDING-LEFT: 5px; FONT-FAMILY: times new roman, new york, times, serif=\r\n; FONT-SIZE: 12pt&quot;&gt;&lt;FONT size=3D2 face=3DTahoma&gt;\n&lt;HR SIZE=3D1&gt;\n&lt;B&gt;&lt;SPAN sty=\r\nle=3D&quot;FONT-WEIGHT: bold&quot;&gt;From:&lt;/SPAN&gt;&lt;/B&gt; mrscaptainjack2 &lt;jjkamp@netzer=\r\no.com&gt;&lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: bold&quot;&gt;To:&lt;/SPAN&gt;&lt;/B&gt; EVP-ITC@ya=\r\nhoogroups.com&lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: bold&quot;&gt;Sent:&lt;/SPAN&gt;&lt;/B&gt; Frid=\r\nay, August 14, 2009 1:38:17 AM&lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: bold&quot;&gt;Subj=\r\nect:&lt;/SPAN&gt;&lt;/B&gt; [EVP-ITC] Training?&lt;BR&gt;&lt;/FONT&gt;&lt;BR&gt;&lt;SPAN style=3D&quot;DISPLAY: n=\r\none&quot;&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV id=3Dygrp-text&gt;\n&lt;P&gt;Thanks so much, Misty. I will s=\r\nee if I can ask them to speak as one, because I think you hit the nail righ=\r\nt on the head -- I do hear them speaking over each other, half in male, hal=\r\nf in female, so maybe things would improve like you said if they organized =\r\ninto one collective voice. Can they still answer questions about individual=\r\ns this way, or are you limited to generalized queries?&lt;BR&gt;&lt;BR&gt;Regarding you=\r\nr statement: &quot;Quite often when a new speaker&lt;BR&gt;comes forth a bit of a trai=\r\nning session can be heard for how they can&lt;BR&gt;speak so that my physical sel=\r\nf can hear what is said.&quot; So by this, do you mean it&#39;s possible it takes a =\r\ncouple of sessions for the entity to master this new method of communicatio=\r\nn? For instance, I got my grandmother&#39; s name (among others) during Tuesday=\r\n&#39;s session, but she said nothing, wouldn&#39;t answer our questions; Wednesday,=\r\n she suddenly started talking and was the primary person we communicated wi=\r\nth, even correctly answered my\n mother&#39;s questions about her childhood pets=\r\n. Could this be because there&#39;s a learning curve involved with talking thro=\r\nugh the radio? Does it take a session or two before they &quot;get the hang of i=\r\nt&quot;? Or is it all dependent on my skills?&lt;BR&gt;&lt;BR&gt;Oh, and wanted to say I&#39;m g=\r\noing out tomorrow to buy all the canned goods at the grocery store in antic=\r\nipation of the nuclear winter we are about to endure... Just kidding. Heari=\r\nng about all that stuff they are predicting, it does make me wonder, though=\r\n, why they would go to such trouble to tell you all that again and again --=\r\n what&#39;s to gain from it? It&#39;s not stirring anybody up. &lt;BR&gt;&lt;BR&gt;&lt;/P&gt;&lt;/DIV&gt;&lt;/=\r\nDIV&gt;&lt;/DIV&gt;&lt;/div&gt;&lt;/body&gt;&lt;/html&gt;\r\n--0-2064734416-1250254393=:59269--"}