{"id": "15680", "subject": "Re: I&#39;m a newbie -- Hi!", "author": "Misty", "timestamp": "2009-08-13T13:53:48Z", "full_text": "--5-3568985732-3294919263=:7\r\nContent-Type: text/plain; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n\nHi Jill\n\nWelcome to the group. You have alot of questions and many will no=\r\n doubt\ntry to answer them, I will say that eventually you will find your ow=\r\nn\nanswers to your questions. Recording evp is a personal experience and so\n=\r\nI will try to answer based on MY own personal experiences. Other peoples\nan=\r\nswers may vary based upon what they experience.  Take it all with a\ngrain o=\r\nf salt and develop your own viewpont.\n--- In EVP-ITC@yahoogroups.com, &quot;mrsc=\r\naptainjack2&quot; &lt;jjkamp@...&gt; wrote:\n\n&gt; 1) They (the entities) say my name cons=\r\ntantly in the background,\nmostly my last name -- is this normal?\n1- Yes as =\r\nI said its a personal experience and most often our names are\nused as well =\r\nas names of others. First names middle names last names,\nnicknames. When we=\r\n physically speak to one another use of names is\nusually to get that person=\r\ns attentions and focus them on what is said.\n\n\n&gt; 2) They asked me to do the=\r\n sessions at night -- is this because it\nworks better at night because radi=\r\no waves travel further then, and have\nyou found this to be so?\n2- I think t=\r\nhat day to night radio frequencies do differ in strength\nbased on factors s=\r\nuch as humidity or the earths atmosphere. Others will\nchime in on their the=\r\nories about that. However I use several different\nmethods besides radio and=\r\n I still find that the strength of the\ncommunication has more to do with th=\r\ne person doing the session. Day to\nday (or night) that can change. Some day=\r\ns/nights are better and clearer\nthan others. I only record when I am well f=\r\nocused, not sick, tired\netcetera. Sometimes when I record during the daytim=\r\ne they may ask I\nreturn and try again at night and the improvements are not=\r\niced by my\nears.\n\n\n&gt; 3) They say things repeatedly, over and over again, as=\r\n if to make a\npattern I can pick out of the radio noise -- do you guys find=\r\n this is\nthe case?\n3- The more you do this you will notice you develop an e=\r\nar for hearing\nbetter as well as the amount of information and the clarity =\r\nincreases.\nAs we learn. we change our vibration and once a persons eyes are=\r\n open\nthey can see much more clearly.\n\n\n&gt; 4) Often there seems to be a dela=\r\ny between asking the question and\ngetting the answer, or I get the wrong an=\r\nswer, almost as if they can&#39;t\nhear me properly. The answer can come before =\r\nthe question is asked, or\nafter the second question; or I can ask them to s=\r\nay THEIR name, and they\nsay MY name instead. Do you guys have these communi=\r\ncation problems? Is\nthere any way to improve things?\n4- They have stated th=\r\nat they hear quite well. They do not need me to\nspeak the words to hear the=\r\n question. I on the other hand am the one who\ndoes not &quot;hear&quot; them complete=\r\nly. They also said that the perfect speech\nis the one without words but tha=\r\nt I am not telepathic enough to always\nhear them clearly. There are also so=\r\nme statements in regards to my being\n&quot;there&quot; as well as &quot;here&quot; simultaneous=\r\nly. Time does not exist for energy\naside from what we set upon our physical=\r\n existence as markers of birth,\ndeath, sunrise, sunset, etcetera. Take away=\r\n the physics and what is\ntime? Again feel free to develop your own ideas on=\r\n that.\n\n\n&gt; 5) I find it interesting that the quality of what&#39;s said sounds\n=\r\nrobotic instead of like the other radio snippets. When there is more\nthan o=\r\nne part to what&#39;s said, the first part goes up, as if to signify\nI&#39;m to wai=\r\nt for the second part, which is often after some radio noise,\nand usually i=\r\nn the same tone and voice as the first part. Rarely do I\nget two syllables =\r\ntogether. Will this improve with time?\n5- The more you put into it the more=\r\n you will get out of it. Over time\nYOU will improve. You have alot of quest=\r\nions and your mind is filled\nwith a bit of chaos as we all are. We often th=\r\nink in fragmented forms of\nspeech. A group of ideas/thoughts then becomes a=\r\n physical form of speech\nbased on our use of physical body. The tongue, the=\r\n lips, the voicebox\netcetera. Imagine if you had to speak without your phys=\r\nical apparatus\nand make use of what methods you can to be heard whether tho=\r\nughts,\ndreams, sound waves, or even Frank&#39;s box. Quite often when a new spe=\r\naker\ncomes forth a bit of a training session can be heard for how they can\n=\r\nspeak so that my physical self can hear what is said.\n\n\n&gt; 6) Is it normal f=\r\nor entities to leave halfway through your\nconversation? My dad&#39;s friend gre=\r\neted me tonight, halfway through made a\ncomment about &quot;people just don&#39;t ca=\r\nre, Jill,&quot; then left (I believe my\ngrandmother, or someone claiming to be h=\r\ner, told me he left). Where do\nthey go? And when I ask about my brother, I&#39;=\r\nm repeatedly told &quot;Brother&#39;s\nin bed&quot; and &quot;Can&#39;t come.&quot; Has anyone been told=\r\n stuff like this?\n6- At the beginning it was many voices, all speaking at o=\r\nnce.\nMultilayers of voices and it was very hard for me to hear without\nfocu=\r\nsing on each individually. Now I ask they speak with one voice.\nOften one p=\r\nersons voice tones begins a sentence and others end the train\nof thought. I=\r\n find when they speak as one it is much clearer and longer\nstatements. I fo=\r\ncus less on tone of voice and more on what is being\nsaid.\n\nJust because the=\r\n body dies doesn&#39;t mean the souls learning is complete\nand perhaps your bro=\r\nther is in a state of rest, or exploration. Perhaps\nhe has already come thr=\r\nu but you just did not recognize him without his\nbody&#39;s &quot;tone of voice&quot;. I =\r\ncan&#39;t answer that question it will take more\nexploration on your part.\n\n&gt; 7=\r\n) Nearly all of the answers to my questions can&#39;t be heard in real\ntime, bu=\r\nt only when I play the tape back. I&#39;d say only about 5% of the\nanswers are =\r\nloud and clear enough I can make them out and respond\nappropriately during =\r\nthe session -- most of the answers are soft, and\ncome on or just above the =\r\nquieter stations that are tuned. Will this\nimprove with time?\n7- As I said =\r\nthe more you do this the more you develop an ear for the\ncommunication bein=\r\ng sent to your ears. In time you will notice your own\nimprovements on recor=\r\ndings as well as off.\n\n\n&gt; OK, sorry for the extremely long post, but I&#39;m ve=\r\nry frustrated and\nexcited at the same time. I also wanted to say a great bi=\r\ng Thank You to\nFrank for inventing this thing: If it wasn&#39;t for you, I woul=\r\ndn&#39;t have\nspoken to what I think was my grandmother today. Thanks for that,=\r\n and\nfor being a &quot;real&quot; and genuine person who selflessly shares your\nresea=\r\nrch with others. I for one am very grateful!\nFrank S. is a very generous pe=\r\nrson. He shares because he wants to and\nmost people respect him for his con=\r\ntributions to this feild of research.\nAs for me I like him for his blunt ho=\r\nnesty.  [:D]\n\nMisty\n\n\n\n\r\n--5-3568985732-3294919263=:7\r\nContent-Type: text/html; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;P&gt;&lt;STRONG&gt;&lt;FONT color=3D&quot;#0000ff&quot;&gt;Hi Jill&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/P&gt;\n&lt;P&gt;&lt;STRONG&gt;&lt;=\r\nFONT color=3D&quot;#0000ff&quot;&gt;Welcome to the group. You have alot of questions and=\r\n&nbsp;many will no doubt try to answer them, I will say that eventually you=\r\n will find your own answers to your questions. Recording evp is a personal =\r\nexperience and so I will try to answer based on&nbsp;MY own personal experi=\r\nences. Other peoples answers may vary based upon what they experience.&lt;/FON=\r\nT&gt;&lt;/STRONG&gt;&nbsp;&nbsp;&lt;STRONG&gt;&lt;FONT color=3D&quot;#0000ff&quot;&gt;Take it all with a g=\r\nrain of salt and develop your own viewpont.&lt;BR&gt;&lt;/FONT&gt;&lt;/STRONG&gt;--- In EVP-I=\r\nTC@yahoogroups.com, &quot;mrscaptainjack2&quot; &lt;jjkamp@...&gt; wrote:&lt;BR&gt;&lt;BR&gt;&gt;=\r\n 1) They (the entities) say my name constantly in the background, mostly my=\r\n last name -- is this normal? &lt;BR&gt;&lt;STRONG&gt;&lt;FONT color=3D&quot;#0000ff&quot;&gt;1- Yes as=\r\n I said its a personal experience and most often our names are used as well=\r\n as names of others. First names middle names last names, nicknames. When w=\r\ne physically speak to one another use of names is usually to get that perso=\r\nns attentions and focus them on what is said.&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/P&gt;&lt;STRONG&gt;&lt;F=\r\nONT color=3D&quot;#0000ff&quot;&gt;&lt;/FONT&gt;&lt;/STRONG&gt;\n&lt;P&gt;&lt;BR&gt;&gt; 2) They asked me to do t=\r\nhe sessions at night -- is this because it works better at night because ra=\r\ndio waves travel further then, and have you found this to be so?&nbsp;&lt;BR&gt;&lt;=\r\nSTRONG&gt;&lt;FONT color=3D&quot;#0000ff&quot;&gt;2-&lt;/FONT&gt;&lt;/STRONG&gt; &lt;STRONG&gt;&lt;FONT color=3D&quot;#0=\r\n000ff&quot;&gt;I think that day to night radio frequencies do differ in strength ba=\r\nsed on factors such as humidity or the earths atmosphere. Others will chime=\r\n in on their theories about that. However I use several different methods b=\r\nesides radio and I still find that the strength of the communication has mo=\r\nre to do with the person doing the session. Day to day (or night) that can =\r\nchange. Some days/nights are better and clearer than others. I only record =\r\nwhen I am well focused, not sick, tired etcetera. Sometimes when I record d=\r\nuring the daytime they may ask I return and try again at night and the impr=\r\novements are noticed by my ears.&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/P&gt;&lt;STRONG&gt;&lt;FONT color=3D&quot;=\r\n#0000ff&quot;&gt;&lt;/FONT&gt;&lt;/STRONG&gt;\n&lt;P&gt;&lt;BR&gt;&gt; 3) They say things repeatedly, over a=\r\nnd over again, as if to make a pattern I can pick out of the radio noise --=\r\n do you guys find this is the case?&nbsp;&lt;BR&gt;&lt;STRONG&gt;&lt;FONT color=3D&quot;#0000ff=\r\n&quot;&gt;3- The more you do this&nbsp;you will notice you develop an ear for heari=\r\nng better as well as the amount of information and the clarity increases. A=\r\ns we learn. we change our vibration and once a persons eyes are open they c=\r\nan see much more clearly&lt;/FONT&gt;&lt;/STRONG&gt;&lt;STRONG&gt;&lt;FONT color=3D&quot;#0000ff&quot;&gt;.&lt;/=\r\nFONT&gt;&lt;/STRONG&gt;&nbsp;&lt;/P&gt;\n&lt;P&gt;&lt;BR&gt;&gt; 4) Often there seems to be a delay bet=\r\nween asking the question and getting the answer, or I get the wrong answer,=\r\n almost as if they can&#39;t hear me properly. The answer can come before the q=\r\nuestion is asked, or after the second question; or I can ask them to say TH=\r\nEIR name, and they say MY name instead. Do you guys have these communicatio=\r\nn problems? Is there any way to improve things?&lt;BR&gt;&lt;STRONG&gt;&lt;FONT color=3D&quot;#=\r\n0000ff&quot;&gt;4- They have stated that they hear quite well. They do not need me =\r\nto speak the words to hear the question. I on the other hand am the one who=\r\n does not &quot;hear&quot; them completely. They also said that the perfect speech is=\r\n the one without words but that I am not telepathic enough to always hear t=\r\nhem clearly. There are also some statements in regards to my being &quot;there&quot; =\r\nas well as &quot;here&quot; simultaneously. Time does not exist for energy aside from=\r\n what we set upon our physical existence as markers of birth, death, sunris=\r\ne, sunset, etcetera. Take away the physics and what is time? Again feel fre=\r\ne to develop your own ideas on that.&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/P&gt;\n&lt;P&gt;&lt;STRONG&gt;&lt;FONT c=\r\nolor=3D&quot;#0000ff&quot;&gt;&nbsp;&lt;/FONT&gt;&lt;/STRONG&gt;&lt;BR&gt;&gt; 5) I find it interesting th=\r\nat the quality of what&#39;s said sounds robotic instead of like the other radi=\r\no snippets. When there is more than one part to what&#39;s said, the first part=\r\n goes up, as if to signify I&#39;m to wait for the second part, which is often =\r\nafter some radio noise, and usually in the same tone and voice as the first=\r\n part. Rarely do I get two syllables together. Will this improve with time?=\r\n&lt;BR&gt;&lt;FONT color=3D&quot;#0000ff&quot;&gt;&lt;STRONG&gt;5- The more you put into it the more yo=\r\nu will get out of it. Over time&nbsp;YOU will improve. You have alot of que=\r\nstions and your mind is filled with a bit of chaos as we all are. We often =\r\nthink in fragmented forms of speech. A group of ideas/thoughts then becomes=\r\n a physical form of speech based on our use of physical body. The tongue, t=\r\nhe lips, the voicebox etcetera. Imagine if you had to speak without your ph=\r\nysical apparatus and make use of what methods you can to be heard whether t=\r\nhoughts, dreams, sound waves, or even Frank&#39;s box. Quite often when a new s=\r\npeaker comes forth a bit of a training session can be heard for how they ca=\r\nn speak so that my physical self can hear what is said. &lt;/STRONG&gt;&lt;/FONT&gt;&lt;/P=\r\n&gt;&lt;FONT color=3D&quot;#0000ff&quot;&gt;&lt;STRONG&gt;&lt;/STRONG&gt;\n&lt;P&gt;&lt;BR&gt;&lt;/FONT&gt;&gt; 6) Is it norm=\r\nal for entities to leave halfway through your conversation? My dad&#39;s friend=\r\n greeted me tonight, halfway through made a comment about &quot;people just don&#39;=\r\nt care, Jill,&quot; then left (I believe my grandmother, or someone claiming to =\r\nbe her, told me he left). Where do they go? And when I ask about my brother=\r\n, I&#39;m repeatedly told &quot;Brother&#39;s in bed&quot; and &quot;Can&#39;t come.&quot; Has anyone been =\r\ntold stuff like this? &lt;BR&gt;&lt;STRONG&gt;&lt;FONT color=3D&quot;#0000ff&quot;&gt;6-&nbsp;At the be=\r\nginning it was many voices, all speaking at once. Multilayers of voices and=\r\n it was very hard for me to hear without focusing on each individually. Now=\r\n I ask they speak with one voice. Often one persons voice tones begins a se=\r\nntence and others end the train of thought. I find when they speak as one i=\r\nt is much clearer and longer statements. I focus less on tone of voice and =\r\nmore on what is being said. &lt;/FONT&gt;&lt;/STRONG&gt;&lt;/P&gt;\n&lt;P&gt;&lt;STRONG&gt;&lt;FONT color=3D&quot;=\r\n#0000ff&quot;&gt;Just because the body dies doesn&#39;t mean the souls learning is comp=\r\nlete and perhaps your brother is in a state of rest, or exploration. Perhap=\r\ns he has already come thru but you just did not recognize him without his b=\r\nody&#39;s &quot;tone of voice&quot;. I can&#39;t answer that question it will take more explo=\r\nration on your part.&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/P&gt;\n&lt;P&gt;&gt; 7) Nearly all of the answe=\r\nrs to my questions can&#39;t be heard in real time, but only when I play the ta=\r\npe back. I&#39;d say only about 5% of the answers are loud and clear enough I c=\r\nan make them out and respond appropriately during the session -- most of th=\r\ne answers are soft, and come on or just above the quieter stations that are=\r\n tuned. Will this improve with time? &lt;BR&gt;&lt;STRONG&gt;&lt;FONT color=3D&quot;#0000ff&quot;&gt;7-=\r\n As I said the more you do this the more you develop an ear for the communi=\r\ncation being sent to your ears. In time you will notice your own improvemen=\r\nts on recordings as well as off.&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/P&gt;&lt;STRONG&gt;&lt;FONT color=3D&quot;=\r\n#0000ff&quot;&gt;&lt;/FONT&gt;&lt;/STRONG&gt;\n&lt;P&gt;&lt;BR&gt;&gt; OK, sorry for the extremely long post=\r\n, but I&#39;m very frustrated and excited at the same time. I also wanted to sa=\r\ny a great big Thank You to Frank for inventing this thing: If it wasn&#39;t for=\r\n you, I wouldn&#39;t have spoken to what I think was my grandmother today. Than=\r\nks for that, and for being a &quot;real&quot; and genuine person who selflessly share=\r\ns your research with others. I for one am very grateful!&lt;BR&gt;&lt;STRONG&gt;&lt;FONT c=\r\nolor=3D&quot;#0000ff&quot;&gt;Frank S. is a very generous person. He shares because he w=\r\nants to and most people respect him for his contributions to this feild of =\r\nresearch. As for me I&nbsp;like him for his blunt honesty. &lt;IMG height=3D&quot;1=\r\n8&quot; alt=3D&quot;:D&quot; src=3D&quot;http://us.i1.yimg.com/us.yimg.com/i/mesg/tsmileys2/04.=\r\ngif&quot; width=3D&quot;18&quot;&gt;&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/P&gt;\n&lt;P&gt;&lt;STRONG&gt;&lt;FONT color=3D&quot;#0000ff&quot;&gt;M=\r\nisty&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/P&gt;\n&lt;P&gt;&nbsp;&lt;/P&gt;\n\r\n--5-3568985732-3294919263=:7--"}