{"id": "15709", "subject": "Re: [EVP-ITC] This train has run out of track!", "author": "Zack Widup", "timestamp": "2009-08-15T23:22:25Z", "full_text": "I think predicting the future is something no one can do with certainty,\nwhether they be mediums, ghosts or spirit technicians. Maybe specific\ndetails about things in the past are more what we&#39;d be looking for, not\npredictions of the future.\n\nMaybe whoever sent those messages are just as subject to rumors about the\nfuture as we are.\n\nZack\n\nOn Sat, Aug 15, 2009 at 5:18 PM, Frank Sumption\n&lt;purplealiengirl@...&gt;wrote:\n\n&gt;\n&gt;\n&gt;  I have gotten these bogus predicitons over and over, and couple that with\n&gt; the fact I ask questions, and get lies--that&#39;s enough! I can&#39;t make this\n&gt; crap, and I can&#39;t provide something to people that I know that 90% of what\n&gt; comes though is lies. You can&#39;t prove the afterlife if none of the\n&gt; information coming through any of these methods is reliable. Yes there is\n&gt; something that talks that shouldn&#39;t be there, and you can prove it&#39;s not\n&gt; radio fragments, or anything else earthly--but it still lies! It&#39;s not\n&gt; information, it&#39;s useless garbage. I don&#39;t care who you think you are, or\n&gt; how smart you think you are, or how many &quot;right&quot; questions you know.  These\n&gt; entites will lead you around by the nose till you wise up.\n&gt;\n&gt;  I have serious doubts about the Queen Mary thing, I think I&#39;d have to side\n&gt; with the debunkers on this BS. I don&#39;t know what talks, but it ain&#39;t your\n&gt; Auntie Edna.\n&gt;\n&gt;  Went to RS and got enough supplies to finish the present projects and I&#39;m\n&gt; not making anymore, nor can I give any away knowing what I know about this\n&gt; stuff.\n&gt;\n&gt; Frank-S\n&gt;\n&gt; \n&gt;\n\nI hink p edic ing he u u e is some hing no one can do wi h ce ain y, whe he hey be mediums, ghos s o spi i echnicians. Maybe speci ic de ails abou hings in he pas a e mo e wha we'd be looking o , no p edic ions o he u u e.\n\n \nMaybe whoe e sen hose messages a e jus as subjec o umo s abou he u u e as we a e. \n \nZack\nOn Sa , Aug 15, 2009 a 5:18 PM, F ank Sump ion pu plealiengi l@...> w o e:\n\n  \n\n\n\n\n I ha e go en hese bogus p edici ons o e and o e , and couple ha wi h he ac I ask ques ions, and ge lies-- ha 's enough! I can' make his c ap, and I can' p o ide some hing o people ha I know ha 90% o wha comes hough is lies. You can' p o e he a e li e i none o he in o ma ion coming h ough any o hese me hods is eliable. Yes he e is some hing ha alks ha shouldn' be he e, and you can p o e i 's no adio agmen s, o any hing else ea hly--bu i s ill lies! I 's no in o ma ion, i 's useless ga bage. I don' ca e who you hink you a e, o how sma you hink you a e, o how many \" igh \" ques ions you know.  These en i es will lead you a ound by he nose ill you wise up. \n\n \n I ha e se ious doub s abou he Queen Ma y hing, I hink I'd ha e o side wi h  he debunke s on his BS. I don' know wha alks, bu i ain' you Aun ie Edna.\n \n Wen o RS and go enough supplies o inish he p esen p ojec s and I'm no making anymo e, no can I gi e any away knowing wha I know abou his s u . \n \nF ank-S"}