{"id": "15711", "subject": "Re: This train has run out of track!", "author": "ourobouros2k2", "timestamp": "2009-08-16T02:03:12Z", "full_text": "Hard to know why the voices seem to play with people. I have had files that validated objects that I was holding in my hand, so I do believe that it is possible for earthbound spirits to communicate with us, as well as other beings from other realms. Can never know their intentions though, and it can be discouraging when these entities choose to toy with us or trick us. Guess there is not anything we really can do about it, however I do believe that there is something very important going on with box communication, and even though it isn&#39;t fully understood, can be a very powerful source of communitation. I hope that if a break from building and researching is necessary, then have a good one. It is my hope though that you do not just abandon this line of communication no matter how frustrating it can be from time to time.\n\nthanks\nAndy\n\n\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  I have gotten these bogus predicitons over and over, and couple that with\n&gt; the fact I ask questions, and get lies--that&#39;s enough! I can&#39;t make this\n&gt; crap, and I can&#39;t provide something to people that I know that 90% of what\n&gt; comes though is lies. You can&#39;t prove the afterlife if none of the\n&gt; information coming through any of these methods is reliable. Yes there is\n&gt; something that talks that shouldn&#39;t be there, and you can prove it&#39;s not\n&gt; radio fragments, or anything else earthly--but it still lies! It&#39;s not\n&gt; information, it&#39;s useless garbage. I don&#39;t care who you think you are, or\n&gt; how smart you think you are, or how many &quot;right&quot; questions you know.  These\n&gt; entites will lead you around by the nose till you wise up.\n&gt; \n&gt;  I have serious doubts about the Queen Mary thing, I think I&#39;d have to side\n&gt; with the debunkers on this BS. I don&#39;t know what talks, but it ain&#39;t your\n&gt; Auntie Edna.\n&gt; \n&gt;  Went to RS and got enough supplies to finish the present projects and I&#39;m\n&gt; not making anymore, nor can I give any away knowing what I know about this\n&gt; stuff.\n&gt; \n&gt; Frank-S\n&gt;"}