{"id": "15715", "subject": "My weird experiences", "author": "mrscaptainjack2", "timestamp": "2009-08-16T06:18:26Z", "full_text": "Well, I wasn&#39;t going to share this story, because it sounds too weird, and it really doesn&#39;t have anything to do with the box, but I&#39;m going to tell it anyway because it does sort of support the idea that we might be talking to &quot;Aunt Edna&quot; at least some of the time.\n\nWhen I started experimenting at the end of July, I immediately started getting an entity named Steve.  As I had no family named Steve, I wondered who I was talking to, and started worrying a lot about it (because that&#39;s always been my fear with the box, as anyone could be impersonated, and could read my mind and say anything I wanted to hear, just like Frank says).  I started worrying that this Steve was a guy I used to know whose favorite thing was to visit my property, high on meth, at 2am to use our shop phone to make sex calls; he died several years ago.  My whole point of getting into the ghost box was to speak to my father and brother, not to speak to someone who had hassled me in life.\n\nSo I was worrying about this Steve, worrying that all the &quot;I love you&quot; messages were coming from him, when one morning after my second session I woke up with a picture in my head. It was an image of my grandmother at the age of about 40, complete with clothes from that era, from long before I was born.  I saw her first from the back, and then gradually from the front -- so it was no memory of a photograph from an album.  And the love in her eyes made it seem like a &quot;visitation,&quot; if you will.  &quot;It&#39;s probably my subconscious,&quot; I thought, because I&#39;d been focusing on my family and wanted so badly to speak to them.  My ghost box session that day featured Steve, but no grandma.  I also heard what I thought sounded like &quot;40&quot; three times.  More on that later.\n\nNext morning.  Same thing happens, only this time it&#39;s images:  my dad at one year old, huge ears and dirty baby clothes; my grandfather up close with his eyes closed and his arms up over his head in a strange pose, looking just as I knew him before his death; my father again, this time about 20 years old, and again, in a pose that could&#39;ve never happened in a photo album -- I saw him from below, looking up at him.  OK, so I&#39;m starting to think this is more than my subconscious at work.  During the box session, I don&#39;t get my father or grandfather, but Steve again, who says his full name:  What sounds like Steve Bars.  But that&#39;s not a name!  No one is named Bars??!  I wrack my brain trying to figure out who this Steve is, and get nowhere.\n\nNext morning:  Same thing, only this times it&#39;s my other grandmother, in her twenties.  I see a pattern here.  All my &quot;visitations&quot; -- which I have never had before by the way -- seem to be images of these people when I wasn&#39;t alive (with the exception of my grandfather).  During that day&#39;s session, Steve is waiting for me, shouts &quot;Steve!&quot; when I turn on the radio.  I ask if he lived in the town near us (because I know he didn&#39;t live in our town, as it&#39;s small), and he says &quot;special&quot; three times.  \n\nNext morning:  This time the &quot;visitation&quot; is from someone I don&#39;t know.  Yet immediately I know it&#39;s Steve.  I see an image of a man in his eighties, hands in his pockets, looking like an old stick in the mud, standing in front of a work truck with high-sided compartments and Washington plates, which is parked inside of a shop.  OK, now I REALLY want to know who this Steve is, since he can penetrate my dream state! So I go back and relisten, very carefully, to Steve &quot;Bars&quot;, and now I hear Steve Barnes.  I run a search in the Seattle Times Obituary index, and lo and behold, I find this:\n\nhttp://www.westfordfuneralhome.com/obituary_info.asp?obituaryID=1020\n\nThis is the man I saw.  This is the truck I saw.  This town where he died is about ten miles away from where my grandparents, uncle, and several other of my family are buried (200 miles from me), so I don&#39;t know if that&#39;s how he&#39;s connected to me, but it&#39;s a strange coincidence nonetheless.  And of course Bellingham would seem awfully hard to get across on the ghost box when I can barely get Steve, hence maybe his answer &quot;special.&quot;\n\nDuring the two sessions that day, my mother participated for the first time, and I finally realized that while we&#39;re hearing &quot;40&quot; again, over and over, it&#39;s actually saying &quot;Gordy,&quot; and then &quot;Gordon.&quot;  This was a friend of my father&#39;s whom I&#39;d lost touch with in the last few years.  My mom also picked out &quot;Greg&quot; more than once, who was also my dad&#39;s friend.  So I got online, googled, and yes, both had died without us knowing it.  Now if the entities or aliens tell us what we want and expect to hear, why would they tell us the names of two people who we did not know were dead?  Then there&#39;s the fact that, besides answering questions correctly, Gordy also said something very characteristic of him.  I asked if he were still there, and he replied (in one of those rare full sentences), &quot;People.  Don&#39;t.  Care.  Jill.&quot;  Needless to say, we found his grave the next day and put flowers on it.  I think I heard from him on the session today, but I haven&#39;t had a chance to go back and pour over the tape to hear what he had to say.\n\nI know these stories are strange, and have nothing whatsoever to do with EVP or the box, but to me, it&#39;s a tiny bit of supporting evidence that it&#39;s actually the dead I&#39;m talking to.  Because I&#39;m definitely looking for evidence, as I don&#39;t wish to discourse with living people who lie, let alone disembodied entities that lie; I have no interest in being led around by the nose, so I&#39;m trying to keep a level head.  And if they tell me to do something (e.g. use the box at night) I don&#39;t do it just for the mere fact they told me to. \n\nAnyways, Frank, I wouldn&#39;t blame you for quitting for a while, what with the awful entities/aliens/whathaveyou you&#39;ve been getting lately.  It certainly doesn&#39;t sound like a positive experience, and who would want to continue with that?  You&#39;ve got my support whatever you decide to do, and I thank you for all you&#39;ve done so far."}