{"id": "15714", "subject": "A Noobs questions", "author": "Debra Yeung", "timestamp": "2009-08-15T23:13:46Z", "full_text": "Hi everyone,\n\nWhat I do want to ask, and maybe someone could explain for me, what *is* \nthe benefit of asking the Box a question. \n\nAlso - and please don&#39;t anyone yell at me, when I see the video&#39;s, I see \npeople on occasion grasping at what they think they might hear. \n\nExtrapolate if you will, , when you use the Box, am I correct in \nunderstanding that you record the raw data, clean it up, and then listen \nto it.\nIf that is the case, do you find that you get clear words. Do they tend \nto develop after a little clearing up of background sounds.\n\nTo the group in general, do you receive clarity more so than gibberish? \nDoes the group find that trends will develop. I think I heard Mr. Murphy \nsay, that quite a few people were receiving a lot of the same information.\n\nDoes anyone get clear &#39;predictions&#39;. Is there any need to &#39;translate&#39; \nthe messages?\n\nFrank, when you say bogus prediction, what do you mean by that?\n\nWhat is a good prediction?\n\nOK, lets ask the obvious question, what &#39;is&#39; considered a prediction \nfrom the Box?\n\nThe one thing I am missing here is when one, (anyone) uses the \napparatus, why are they using it, do they have a pre-set result they are \nseeking.\n\nDo you use it to prove or disprove spirit in a particular location?\n\nWhat other questions should I be asking?\n\nDoes one hear more &#39;male&#39; or &#39;female&#39; sounding voices, can on determine \nthe gender of the voice?\n\nIs it always a &#39;voice&#39; that is coming through?\n\nAnother question, does Franks box speak in different languages and has \nanyone been able dig deeper into that, and has anyone recorded a voice \nin what they thought was gibberish only to find it was a different language.\n\nHas any &#39;new&#39; languages been heard/recorded.\n\nWhat about speech patterns through history, does the group find that the \nvoices use older language styles or is it syntax/language we understand.\n\nSorry, I have so many questions, I hope nobody will think them dumb or \nnot worthy of an answer, I do want to know.\n\nHas anyone had a box that just never worked for a certain person, but \nwould for others?\n\n\nDeb\n\nPS another really dumb question, how does one *know* the response comes \nfrom a spirit, can it be another type of entity, can it be a ET, can it \nbe echo&#39;s through time or future, other dimensions, I guess even a \nreligious possibility arises too."}