{"id": "15716", "subject": "Re: A Noobs questions", "author": "mrscaptainjack2", "timestamp": "2009-08-16T06:39:57Z", "full_text": "I&#39;m completely new to this, but I&#39;ve had some really good success, so I&#39;ll answer a couple of your questions per my own experiences so far -- see below:\n\n\n&gt; What I do want to ask, and maybe someone could explain for me, what *is* the benefit of asking the Box a question.\n \nFor me, I have an agenda:  I want to speak to my dead father and brother.  Since I haven&#39;t had success with that so far, I&#39;m speaking to anyone I get, which so far claims to be a guy named Steve, a guy named Frank, someone named Chris, two dead friends of my father&#39;s whom I didn&#39;t know where dead (Gordy and Greg), my grandmother (Margaret), and possibly two people named Ed.  I ask questions of these entities in an effort to find out what&#39;s become of my father and brother, who both died suddenly, and just generally to try to prove life after death.\n\n&gt; Also - and please don&#39;t anyone yell at me, when I see the video&#39;s, &gt; I see people on occasion grasping at what they think they might hear.\n \nWhen I started, I expected crisp, clean words, or I wouldn&#39;t accept them as words; I wasn&#39;t going to bend noise into what I wanted to hear.  Then I started to realize that &quot;they&quot; couldn&#39;t make the right words crisp and clear every time; I realized this because I was hearing patterns, the same or nearly the same things over and over, but each set slightly different.  So yes, I do accept slightly garbled versions of words, and don&#39;t expect to hear a perfect sentence -- but usually the answer is repeated two or three times in a row.  For instance, I recorded them saying different versions of &quot;I love you,&quot; -- all with the clear word love -- twelve different times in a row.  Even though only a few were crisp, clear &quot;I love you&#39;s&quot; or &quot;love you&#39;s&quot;, you could tell that all twelve were trying to say the same thing.\n\n&gt; Extrapolate if you will, , when you use the Box, am I correct in \n&gt; understanding that you record the raw data, clean it up, and then listen to it.\n\nI do not clean anything.  I tape onto regular, old-fashioned tape with a four-track machine meant for music.\n \n&gt; Do you use it to prove or disprove spirit in a particular location?\n\nI use it on my dining room table.\n\n&gt; Does one hear more &#39;male&#39; or &#39;female&#39; sounding voices, can on determine the gender of the voice?\n\nI have heard both male and female, which seems to be independent of the radio clips -- these are robotic-sounding voices that are distinctly different and have a quality of their own.  The voices seemed sex-appropriate.\n\nThat&#39;s my two cents."}