{"id": "15721", "subject": "Re: [EVP-ITC] Calm thyself-again and again and again.....", "author": "Rj", "timestamp": "2009-08-16T22:37:48Z", "full_text": "--0-414376114-1250462268=:4415\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nTwisting a prediction after the fact to fit circumstances is one of the big=\r\ngest mistakes (or biggest cop-outs, or biggest lies) a would-be future-tell=\r\ner makes.=A0 The predictions you were touting were for August 15, and inclu=\r\nded end-of-the-world warning..=A0 Trying to say these were correct, but not=\r\n REALLY for August 15, and not REALLY end-of-the-world stuff, seems like a =\r\nway to save face, or keep hoping the messages are real, when in fact, this =\r\nis another example that they are not.\n\nSo from now on, you will no longer h=\r\near clear dates and predictions.=A0 You may hear vague dates and vague pred=\r\nictions if you like, but you will not hear anything that can be confirmed.=\r\n=A0 Doing so would put you in a position of having to question the verity o=\r\nf the EVP data you collect.=A0 And that might lead to abandoning this while=\r\n area of study.=A0 And we know you cannot do that.\n\n\n\n--- On Sun, 8/16/09, =\r\nFrank Sumption &lt;purplealiengirl@...&gt; wrote:\n\nFrom: Frank Sumption &lt;pu=\r\nrplealiengirl@...&gt;\nSubject: [EVP-ITC] Calm thyself-again and again an=\r\nd again.....\nTo: evp-itc@yahoogroups.com\nDate: Sunday, August 16, 2009, 3:0=\r\n8 PM\n\n\n\n\n\n\n=A0\n\n\n\n\n    \n                  =A0Well, it seems the original pr=\r\nediction of the east coast getting clobbered is probably correct. Where=A0I=\r\n fell down was trying to ask questions and getting BS doomsville junk. I kn=\r\new it&#39;s a mistake=A0to ask questions, that like opens the door for the dark=\r\n dorks. I&#39;m going back to just announcing I&#39;m doing an EVP recording, and j=\r\nust record. They know what I&#39;m thinking and what I need to know and who I w=\r\nould like to hear from. Asking questions, at least for me, has always lead =\r\nto problems. I&#39;m not like others, presumming I&#39;m so smart and know what is=\r\n=A0talking, and if it&#39;s honest, like most of=A0the box experts out there on=\r\n the web. You know, the ones doing pod casts, radio shows=A0and proclaiming=\r\n this that and the other thing. \n\n=A0\n=A0\n=A0\n=A0Frank-S\n\n \n\n      \n\n    \n =\r\n   \n\t\n\t \n\t\n\t\n\n\n\n\n\n\n\n\n\t\n\n\n\t\n\t\n\n\n      \r\n--0-414376114-1250462268=:4415\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;Twisting a prediction after the fact to fit c=\r\nircumstances is one of the biggest mistakes (or biggest cop-outs, or bigges=\r\nt lies) a would-be future-teller makes.&nbsp; The predictions you were tout=\r\ning were for August 15, and included end-of-the-world warning..&nbsp; Tryin=\r\ng to say these were correct, but not REALLY for August 15, and not REALLY e=\r\nnd-of-the-world stuff, seems like a way to save face, or keep hoping the me=\r\nssages are real, when in fact, this is another example that they are not.&lt;b=\r\nr&gt;&lt;br&gt;So from now on, you will no longer hear clear dates and predictions.&=\r\nnbsp; You may hear vague dates and vague predictions if you like, but you w=\r\nill not hear anything that can be confirmed.&nbsp; Doing so would put you i=\r\nn a position of having to question the verity of the EVP data you collect.&=\r\nnbsp; And that might lead to abandoning this while area of study.&nbsp; And=\r\n we\n know you cannot do that.&lt;br&gt;&lt;br&gt;&lt;br&gt;&lt;br&gt;--- On &lt;b&gt;Sun, 8/16/09, Frank =\r\nSumption &lt;i&gt;&lt;purplealiengirl@...&gt;&lt;/i&gt;&lt;/b&gt; wrote:&lt;br&gt;&lt;blockquote=\r\n style=3D&quot;border-left: 2px solid rgb(16, 16, 255); margin-left: 5px; paddin=\r\ng-left: 5px;&quot;&gt;&lt;br&gt;From: Frank Sumption &lt;purplealiengirl@...&gt;&lt;br=\r\n&gt;Subject: [EVP-ITC] Calm thyself-again and again and again.....&lt;br&gt;To: evp-=\r\nitc@yahoogroups.com&lt;br&gt;Date: Sunday, August 16, 2009, 3:08 PM&lt;br&gt;&lt;br&gt;&lt;div i=\r\nd=3D&quot;yiv1551293402&quot;&gt;\n\n\n\n\n&lt;span style=3D&quot;display: none;&quot;&gt;&nbsp;&lt;/span&gt;\n\n    =\r\n&lt;div id=3D&quot;ygrp-text&quot;&gt;\n                  &lt;p&gt;&lt;/p&gt;&lt;div&gt;&nbsp;Well, it seems t=\r\nhe original prediction of the east coast getting clobbered is probably corr=\r\nect. Where&nbsp;I fell down was trying to ask questions and getting BS doom=\r\nsville junk. I knew it&#39;s a mistake&nbsp;to ask questions, that like opens t=\r\nhe door for the dark dorks. I&#39;m going back to just announcing I&#39;m doing an =\r\nEVP recording, and just record. They know what I&#39;m thinking and what I need=\r\n to know and who I would like to hear from. Asking questions, at least for =\r\nme, has always lead to problems. I&#39;m not like others, presumming I&#39;m so sma=\r\nrt and know what is&nbsp;talking, and if it&#39;s honest, like most of&nbsp;the=\r\n box experts out there on the web. You know, the ones doing pod casts, radi=\r\no shows&nbsp;and proclaiming this that and the other thing. &lt;/div&gt;\n\n&lt;div&gt;&n=\r\nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;Frank-S&lt;/div&gt;\n\n \n=\r\n\n    &lt;/div&gt;  \n\n\n\t \n\t\n\t&lt;/div&gt;&lt;/blockquote&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n      \r\n--0-414376114-1250462268=:4415--"}