{"id": "15727", "subject": "Re: [EVP-ITC] Re: This train has run out of track!", "author": "Frank Ratka", "timestamp": "2009-08-17T14:16:59Z", "full_text": "--0-841448465-1250518619=:59598\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nHonestly, I think it is impossible to understand the perspective in which t=\r\nhese &quot;beings&quot; are relaying their information. They may not even be speaking=\r\n of this reality but of something else. They may not even be completely con=\r\nscious when connecting to you for communication. A lot of you assume this i=\r\ns some type of telephone call were you are dealing with a completely cohera=\r\nnt person on the other end of the line. This is a connection between you an=\r\nd whatever is out there that shares your attitude and emotional disposition=\r\n, the radio, box or whatever has very little to do with it. The stronger yo=\r\nur psi connection or &quot;bridge&quot; is with the other entity the better or more c=\r\nlear your connection will be.\n\nI don&#39;t think I have ever received predictio=\r\nns of future events. Everything I get has dealt with the present! Sumption =\r\nis right, if you have expectations then you have made a lot of assumptions,=\r\n which means on some level you think you know what is going on or how this =\r\ncommunication is coming about and who it is with. If you want this very rea=\r\nl communication to work then you have to approach it with now expectations,=\r\n assume nothing and have a positive outlook.\n\nFrank R.\n\n\n\n\n________________=\r\n________________\nFrom: ourobouros2k2 &lt;ourobouros2k2@...&gt;\nTo: EVP-ITC@=\r\nyahoogroups.com\nSent: Saturday, August 15, 2009 9:03:12 PM\nSubject: [EVP-IT=\r\nC] Re: This train has run out of track!\n\n=A0 \n\nHard to know why the voices =\r\nseem to play with people. I have had files that validated objects that I wa=\r\ns holding in my hand, so I do believe that it is possible for earthbound sp=\r\nirits to communicate with us, as well as other beings from other realms. Ca=\r\nn never know their intentions though, and it can be discouraging when these=\r\n entities choose to toy with us or trick us. Guess there is not anything we=\r\n really can do about it, however I do believe that there is something very =\r\nimportant going on with box communication, and even though it isn&#39;t fully u=\r\nnderstood, can be a very powerful source of communitation. I hope that if a=\r\n break from building and researching is necessary, then have a good one. It=\r\n is my hope though that you do not just abandon this line of communication =\r\nno matter how frustrating it can be from time to time.\n\nthanks\nAndy\n\n--- In=\r\n EVP-ITC@yahoogroups .com, Frank Sumption &lt;purplealiengirl@ ...&gt; wrote:\n&gt;\n&gt;=\r\n I have gotten these bogus predicitons over and over, and couple that with\n=\r\n&gt; the fact I ask questions, and get lies--that&#39;s enough! I can&#39;t make this\n=\r\n&gt; crap, and I can&#39;t provide something to people that I know that 90% of wha=\r\nt\n&gt; comes though is lies. You can&#39;t prove the afterlife if none of the\n&gt; in=\r\nformation coming through any of these methods is reliable. Yes there is\n&gt; s=\r\nomething that talks that shouldn&#39;t be there, and you can prove it&#39;s not\n&gt; r=\r\nadio fragments, or anything else earthly--but it still lies! It&#39;s not\n&gt; inf=\r\normation, it&#39;s useless garbage. I don&#39;t care who you think you are, or\n&gt; ho=\r\nw smart you think you are, or how many &quot;right&quot; questions you know. These\n&gt; =\r\nentites will lead you around by the nose till you wise up.\n&gt; \n&gt; I have seri=\r\nous doubts about the Queen Mary thing, I think I&#39;d have to side\n&gt; with the =\r\ndebunkers on this BS. I don&#39;t know what talks, but it ain&#39;t your\n&gt; Auntie E=\r\ndna.\n&gt; \n&gt; Went to RS and got enough supplies to finish the present projects=\r\n and I&#39;m\n&gt; not making anymore, nor can I give any away knowing what I know =\r\nabout this\n&gt; stuff.\n&gt; \n&gt; Frank-S\n&gt;\n\n\n\n\n\n      \r\n--0-841448465-1250518619=:59598\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;&lt;head&gt;&lt;style type=3D&quot;text/css&quot;&gt;&lt;!-- DIV {margin:0px;} --&gt;&lt;/style&gt;&lt;/he=\r\nad&gt;&lt;body&gt;&lt;div style=3D&quot;font-family:times new roman, new york, times, serif;=\r\nfont-size:12pt&quot;&gt;&lt;DIV&gt;Honestly, I think it is impossible to understand the p=\r\nerspective in which these &quot;beings&quot; are relaying their information. They may=\r\n not even be speaking of this reality but of something else. They may not e=\r\nven be completely conscious when connecting to you for communication. A lot=\r\n of you assume this is some type of telephone call were you are dealing wit=\r\nh a completely coherant person on the other end of the line. This is a conn=\r\nection between you and whatever is out there that shares your attitude and =\r\nemotional disposition, the radio, box or whatever has very little to do wit=\r\nh it. The stronger your psi connection or &quot;bridge&quot; is with the other entity=\r\n the better or more clear your connection will be.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n=\r\n&lt;DIV&gt;I don&#39;t think I have ever received predictions of future events. Every=\r\nthing I get has dealt with the present! Sumption is right, if you have expe=\r\nctations then you have made a lot of assumptions, which means on some level=\r\n you think you know what is going on or how this communication is coming ab=\r\nout and who it is with. If you want this very real communication to work th=\r\nen you have to approach it with now expectations, assume nothing and have a=\r\n positive outlook.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Frank R.&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV sty=\r\nle=3D&quot;FONT-FAMILY: times new roman, new york, times, serif; FONT-SIZE: 12pt=\r\n&quot;&gt;&lt;BR&gt;\n&lt;DIV style=3D&quot;BORDER-LEFT: #1010ff 2px solid; MARGIN: 5px 0px 5px 5p=\r\nx; PADDING-LEFT: 5px; FONT-FAMILY: times new roman, new york, times, serif;=\r\n FONT-SIZE: 12pt&quot;&gt;&lt;FONT size=3D2 face=3DTahoma&gt;\n&lt;HR SIZE=3D1&gt;\n&lt;B&gt;&lt;SPAN styl=\r\ne=3D&quot;FONT-WEIGHT: bold&quot;&gt;From:&lt;/SPAN&gt;&lt;/B&gt; ourobouros2k2 &lt;ourobouros2k2@ya=\r\nhoo.com&gt;&lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: bold&quot;&gt;To:&lt;/SPAN&gt;&lt;/B&gt; EVP-ITC@=\r\nyahoogroups.com&lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: bold&quot;&gt;Sent:&lt;/SPAN&gt;&lt;/B&gt; Sa=\r\nturday, August 15, 2009 9:03:12 PM&lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: bold&quot;&gt;=\r\nSubject:&lt;/SPAN&gt;&lt;/B&gt; [EVP-ITC] Re: This train has run out of track!&lt;BR&gt;&lt;/FON=\r\nT&gt;&lt;BR&gt;&lt;SPAN style=3D&quot;DISPLAY: none&quot;&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV id=3Dygrp-text&gt;\n&lt;P&gt;=\r\n&lt;BR&gt;Hard to know why the voices seem to play with people. I have had files =\r\nthat validated objects that I was holding in my hand, so I do believe that =\r\nit is possible for earthbound spirits to communicate with us, as well as ot=\r\nher beings from other realms. Can never know their intentions though, and i=\r\nt can be discouraging when these entities choose to toy with us or trick us=\r\n. Guess there is not anything we really can do about it, however I do belie=\r\nve that there is something very important going on with box communication, =\r\nand even though it isn&#39;t fully understood, can be a very powerful source of=\r\n communitation. I hope that if a break from building and researching is nec=\r\nessary, then have a good one. It is my hope though that you do not just aba=\r\nndon this line of communication no matter how frustrating it can be from ti=\r\nme to time.&lt;BR&gt;&lt;BR&gt;thanks&lt;BR&gt;Andy&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=3D&quot;mailto:EVP-ITC%4=\r\n0yahoogroups.com&quot; rel=3Dnofollow target=3D_blank\n ymailto=3D&quot;mailto:EVP-ITC=\r\n%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups .com&lt;/A&gt;, Frank Sumption &lt;purple=\r\naliengirl@ ...&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; I have gotten these bogus predici=\r\ntons over and over, and couple that with&lt;BR&gt;&gt; the fact I ask questions, =\r\nand get lies--that&#39;s enough! I can&#39;t make this&lt;BR&gt;&gt; crap, and I can&#39;t pr=\r\novide something to people that I know that 90% of what&lt;BR&gt;&gt; comes though=\r\n is lies. You can&#39;t prove the afterlife if none of the&lt;BR&gt;&gt; information =\r\ncoming through any of these methods is reliable. Yes there is&lt;BR&gt;&gt; somet=\r\nhing that talks that shouldn&#39;t be there, and you can prove it&#39;s not&lt;BR&gt;&gt;=\r\n radio fragments, or anything else earthly--but it still lies! It&#39;s not&lt;BR&gt;=\r\n&gt; information, it&#39;s useless garbage. I don&#39;t care who you think you are,=\r\n or&lt;BR&gt;&gt; how smart you think you are, or how many &quot;right&quot; questions you =\r\nknow. These&lt;BR&gt;&gt; entites will lead you around by the nose till you wise =\r\nup.&lt;BR&gt;&gt; &lt;BR&gt;&gt; I have serious doubts\n about the Queen Mary thing, I t=\r\nhink I&#39;d have to side&lt;BR&gt;&gt; with the debunkers on this BS. I don&#39;t know w=\r\nhat talks, but it ain&#39;t your&lt;BR&gt;&gt; Auntie Edna.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Went to =\r\nRS and got enough supplies to finish the present projects and I&#39;m&lt;BR&gt;&gt; n=\r\not making anymore, nor can I give any away knowing what I know about this&lt;B=\r\nR&gt;&gt; stuff.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Frank-S&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/P&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV=\r\n&gt;&lt;/div&gt;&lt;br&gt;\n\n      &lt;/body&gt;&lt;/html&gt;\r\n--0-841448465-1250518619=:59598--"}