{"id": "15736", "subject": "Re: [EVP-ITC] Re: Calm thyself-again and again and again.....", "author": "David Koenig", "timestamp": "2009-08-18T00:15:02Z", "full_text": "I&#39;ll LEAVE IT !!!!!!\nNuff said :-)\n\nBelieve what you want. I won&#39;t waste my time on him. Hope you don&#39;t waste\nyours.\n\nI read and listen to just about everything on this group. I rarely comment.\n\nThere&#39;s a reason. But if you can vouch for RJ and know who he really is,\nthen more power to you.\n\nHowever, if you don&#39;t ..... Please don&#39;t be naive.\n\nThat&#39;s all I&#39;ve got to say on the subject.\n\nOn Mon, Aug 17, 2009 at 7:37 PM, April Abercrombie &lt;\napril@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Hey now. If I may, RJ was not being  a troll, IMO. He was just stating his\n&gt; observation. He should be allowed. You can take it or leave it.\n&gt;\n&gt;\n&gt; ----- Original Message -----\n&gt; *From:* David Koenig &lt;floridajakeblues@...&gt;\n&gt; *To:* EVP-ITC@yahoogroups.com\n&gt; *Sent:* Monday, August 17, 2009 5:34 PM\n&gt; *Subject:* Re: [EVP-ITC] Re: Calm thyself-again and again and again.....\n&gt;\n&gt;\n&gt;\n&gt; RJ ... I&#39;m not throwing a fit at all. I&#39;m just pointing out a Troll when I\n&gt; see one and you my friend are a TROLL.\n&gt;\n&gt; No problem at all.  I mean it in the nicest way possible. I hope they will\n&gt; throw you out ASAP as all the other forums have.\n&gt;\n&gt; Have a great day. I can&#39;t let you get away with implying Frank is a liar\n&gt; and he must do as you say! It&#39;s just hilarious!!!!\n&gt;\n&gt; On Mon, Aug 17, 2009 at 5:58 PM, purplespacefriend &lt;\n&gt; purplealiengirl@...&gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; I didn&#39;t twist dick! I said that&#39;s what happens when I ask the box stupid\n&gt;&gt; questions--I get stupid answers.\n&gt;&gt;\n&gt;&gt; And who the hell here is so perfect and so knowlegdable that they know\n&gt;&gt; what questions to ask and what answers are valid?\n&gt;&gt;\n&gt;&gt; This communcation mode is extremely experimental, nothing is known about\n&gt;&gt; it, or who uses it on the oter side. All there is is abunch of wanna be and\n&gt;&gt; self proclaimed experts that base everything they know on Ghost Busters and\n&gt;&gt; Night of the Living dead! So bite me!\n&gt;&gt;\n&gt;&gt; F-S\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Rj &lt;rasterer@...&gt;\n&gt;&gt; wrote:\n&gt;&gt; &gt;\n&gt;&gt; &gt; If you like to post some (future) predictions for this year with clear\n&gt;&gt; dates and events, feel free.  If you have advice to Frank and others on how\n&gt;&gt; to better interact with their voices and acquire clearer more understandable\n&gt;&gt; messages, that would be useful.  And if you&#39;d like to explain further how I\n&gt;&gt; am &quot;wrong&quot; that the world did not end on August 15 as was predicted, please\n&gt;&gt; do so. But throwing a little tantrum with no constructive criticism doesn&#39;t\n&gt;&gt; really allow much productive conversation, if I may say so.\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt; --- On Sun, 8/16/09, David Koenig &lt;floridajakeblues@...&gt; wrote:\n&gt;&gt; &gt;\n&gt;&gt; &gt; From: David Koenig &lt;floridajakeblues@...&gt;\n&gt;&gt; &gt; Subject: Re: [EVP-ITC] Calm thyself-again and again and again.....\n&gt;&gt; &gt; To: EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;\n&gt;&gt; &gt; Date: Sunday, August 16, 2009, 8:58 PM\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt; RJ .. Please excuse me ... you are obviously WRONG ... How&#39;s that?\n&gt;&gt; &gt;\n&gt;&gt; &gt; On Sun, Aug 16, 2009 at 11:56 PM, David Koenig &lt;floridajakeblues@\n&gt;&gt; gmail.com&gt; wrote:\n&gt;&gt; &gt;\n&gt;&gt; &gt; JR... Wake up !!!!!\n&gt;&gt; &gt;\n&gt;&gt; &gt; On Sun, Aug 16, 2009 at 6:37 PM, Rj &lt;rasterer@yahoo. com&gt; wrote:\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt; Twisting a prediction after the fact to fit circumstances is one of the\n&gt;&gt; biggest mistakes (or biggest cop-outs, or biggest lies) a would-be\n&gt;&gt; future-teller makes.  The predictions you were touting were for August 15,\n&gt;&gt; and included end-of-the-world warning..  Trying to say these were correct,\n&gt;&gt; but not REALLY for August 15, and not REALLY end-of-the-world stuff, seems\n&gt;&gt; like a way to save face, or keep hoping the messages are real, when in fact,\n&gt;&gt; this is another example that they are not.\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt; So from now on, you will no longer hear clear dates and predictions.\n&gt;&gt; You may hear vague dates and vague predictions if you like, but you will not\n&gt;&gt; hear anything that can be confirmed.  Doing so would put you in a position\n&gt;&gt; of having to question the verity of the EVP data you collect.  And that\n&gt;&gt; might lead to abandoning this while area of study.  And we\n&gt;&gt; &gt; know you cannot do that.\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt; --- On Sun, 8/16/09, Frank Sumption &lt;purplealiengirl@ gmail.com&gt; wrote:\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt; From: Frank Sumption &lt;purplealiengirl@ gmail.com&gt;\n&gt;&gt; &gt; Subject: [EVP-ITC] Calm thyself-again and again and again.....\n&gt;&gt; &gt; To: evp-itc@yahoogroups .com\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt; Date: Sunday, August 16, 2009, 3:08 PM\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;  Well, it seems the original prediction of the east coast getting\n&gt;&gt; clobbered is probably correct. Where I fell down was trying to ask questions\n&gt;&gt; and getting BS doomsville junk. I knew it&#39;s a mistake to ask questions, that\n&gt;&gt; like opens the door for the dark dorks. I&#39;m going back to just announcing\n&gt;&gt; I&#39;m doing an EVP recording, and just record. They know what I&#39;m thinking and\n&gt;&gt; what I need to know and who I would like to hear from. Asking questions, at\n&gt;&gt; least for me, has always lead to problems. I&#39;m not like others, presumming\n&gt;&gt; I&#39;m so smart and know what is talking, and if it&#39;s honest, like most of the\n&gt;&gt; box experts out there on the web. You know, the ones doing pod casts, radio\n&gt;&gt; shows and proclaiming this that and the other thing.\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;  Frank-S\n&gt;&gt; &gt;\n&gt;&gt;\n&gt;&gt;\n&gt;   \n&gt;\n\nI'll LEAVE IT !!!!!!Nu said :-)Belie e wha you wan . I won' was e my ime on him. Hope you don' was e you s.I ead and lis en o jus abou e e y hing on his g oup. I a ely commen .\nThe e's a eason. Bu i you can ouch o RJ and know who he eally is, hen mo e powe o you.Howe e , i you don' ..... Please don' be nai e.\nTha 's all I' e go o say on he subjec .On Mon, Aug 17, 2009 a 7:37 PM, Ap il Abe c ombie ap il@abe c ombieghos esea ch.com> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n \n \n\n\nHey now. I I may, RJ was no \nbeing  a oll, IMO. He was jus s a ing his obse a ion. He should be \nallowed. You can ake i o lea e i .\n \n\n ----- O iginal Message ----- \n F om: \n Da id Koenig \n To: EVP-ITC@yahoog oups.com \n Sen : Monday, Augus 17, 2009 5:34 \n PM\n Subjec : Re: [EVP-ITC] Re: Calm \n hysel -again and again and again.....\n   \n \n RJ ... I'm no h owing a i a all. I'm jus poin ing ou a T oll when I \n see one and you my iend a e a TROLL.\n \n No p oblem a all.  I mean i in he nices way possible. I hope \n hey will h ow you ou ASAP as all he o he o ums ha e.\n \n Ha e a g ea day. I can' le you ge away wi h implying F ank is a lia \n and he mus do as you say! I 's jus hila ious!!!!\n On Mon, Aug 17, 2009 a 5:58 PM, pu plespace iend \n pu plealiengi l@...> \n w o e:\n \n   \n \n \n \n I didn' wis dick! I said ha 's wha happens when I ask he box s upid \n ques ions--I ge s upid answe s. And who he hell he e is so pe ec \n and so knowlegdable ha hey know wha ques ions o ask and wha answe s \n a e alid?This communca ion mode is ex emely expe imen al, no hing \n is known abou i , o who uses i on he o e side. All he e is is abunch \n o wanna be and sel p oclaimed expe s ha base e e y hing hey know on \n Ghos Bus e s and Nigh o he Li ing dead! So bi e me!F-S\n --- In EVP-ITC@yahoog oups.com, Rj \n w o e:>> I you like o pos some ( u u e) p edic ions o \n his yea wi h clea da es and e en s, eel ee.  I you ha e ad ice \n o F ank and o he s on how o be e in e ac wi h hei oices and acqui e \n clea e mo e unde s andable messages, ha would be use ul.  And i \n you'd like o explain u he how I am \"w ong\" ha he wo ld did no end on \n Augus 15 as was p edic ed, please do so. Bu h owing a li le an um wi h \n no cons uc i e c i icism doesn' eally allow much p oduc i e con e sa ion, \n i I may say so.> > > > --- On Sun, \n 8/16/09, Da id Koenig w o e:> \n > F om: Da id Koenig \n > Subjec : Re: [EVP-ITC] Calm hysel -again and again \n and again.....> To: EVP-ITC@yahoog oups.com> Da e: Sunday, Augus \n 16, 2009, 8:58 PM> > > > > > \n >  > > > > > > RJ .. \n Please excuse me ... you a e ob iously WRONG ... How's ha ?> \n > On Sun, Aug 16, 2009 a 11:56 PM, Da id Koenig \n gmail.com> w o e:> > JR... Wake up \n !!!!!> > On Sun, Aug 16, 2009 a 6:37 PM, Rj \n w o e:> > > > \n > > > > > > > > \n > > >  > > > > \n > > Twis ing a p edic ion a e he ac o i ci cums ances \n is one o he bigges mis akes (o bigges cop-ou s, o bigges lies) a \n would-be u u e- elle makes.  The p edic ions you we e ou ing we e \n o Augus 15, and included end-o - he-wo ld wa ning..  T ying o say \n hese we e co ec , bu no REALLY o Augus 15, and no REALLY \n end-o - he-wo ld s u , seems like a way o sa e ace, o keep hoping he \n messages a e eal, when in ac , his is ano he example ha hey a e \n no .> > > > So om now on, you will no longe \n hea clea da es and p edic ions.  You may hea ague da es and ague \n p edic ions i you like, bu you will no hea any hing ha can be \n con i med.  Doing so would pu you in a posi ion o ha ing o ques ion \n he e i y o he EVP da a you collec .  And ha migh lead o \n abandoning his while a ea o s udy.  And we> know you canno do \n ha .> > > > --- On Sun, 8/16/09, F ank Sump ion \n gmail.com> w o e:> > > > \n F om: F ank Sump ion gmail.com>> Subjec : [EVP-ITC] Calm \n hysel -again and again and again.....> To: e p-i c@yahoog oups \n .com> > > Da e: Sunday, Augus 16, 2009, 3:08 \n PM> > > > > > > \n  > > >  Well, i seems he o iginal \n p edic ion o he eas coas ge ing clobbe ed is p obably co ec . \n Whe e I ell down was ying o ask ques ions and ge ing BS dooms ille \n junk. I knew i 's a mis ake  o ask ques ions, ha like opens he doo \n o he da k do ks. I'm going back o jus announcing I'm doing an EVP \n eco ding, and jus eco d. They know wha I'm hinking and wha I need o \n know and who I would like o hea om. Asking ques ions, a leas o me, \n has always lead o p oblems. I'm no like o he s, p esumming I'm so sma \n and know wha is  alking, and i i 's hones , like mos o   he box \n expe s ou he e on he web. You know, he ones doing pod cas s, adio \n shows and p oclaiming his ha and he o he hing. > > \n > >  >  >  > \n  F ank-S>"}