{"id": "15740", "subject": "Re: Calm thyself-again and again and again.....", "author": "Rick", "timestamp": "2009-08-18T00:19:08Z", "full_text": "I am happy to have a civil conversation with you (and I don&#39;t know what all these other forums are you are talking about) but you need to do it in a civil and constructive way.  The forum rules say that if you are offending people or being obnoxious - and I think calling me a troll, and making up things about other forums, and hoping I will be banned, and telling me to WAKE UP, matches that pretty well - you will be banned.\n\nSo again, if you have something constructive to say in a civil way, we&#39;re all ears.\n\n\n\n--- In EVP-ITC@yahoogroups.com, David Koenig &lt;floridajakeblues@...&gt; wrote:\n&gt;\n&gt; RJ ... I&#39;m not throwing a fit at all. I&#39;m just pointing out a Troll when I\n&gt; see one and you my friend are a TROLL.\n&gt; No problem at all.  I mean it in the nicest way possible. I hope they will\n&gt; throw you out ASAP as all the other forums have.\n&gt; \n&gt; Have a great day. I can&#39;t let you get away with implying Frank is a liar and\n&gt; he must do as you say! It&#39;s just hilarious!!!!\n&gt; \n&gt; On Mon, Aug 17, 2009 at 5:58 PM, purplespacefriend &lt;\n&gt; purplealiengirl@...&gt; wrote:\n&gt; \n&gt; &gt;\n&gt; &gt;\n&gt; &gt; I didn&#39;t twist dick! I said that&#39;s what happens when I ask the box stupid\n&gt; &gt; questions--I get stupid answers.\n&gt; &gt;\n&gt; &gt; And who the hell here is so perfect and so knowlegdable that they know what\n&gt; &gt; questions to ask and what answers are valid?\n&gt; &gt;\n&gt; &gt; This communcation mode is extremely experimental, nothing is known about\n&gt; &gt; it, or who uses it on the oter side. All there is is abunch of wanna be and\n&gt; &gt; self proclaimed experts that base everything they know on Ghost Busters and\n&gt; &gt; Night of the Living dead! So bite me!\n&gt; &gt;\n&gt; &gt; F-S\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Rj &lt;rasterer@&gt;\n&gt; &gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; If you like to post some (future) predictions for this year with clear\n&gt; &gt; dates and events, feel free.  If you have advice to Frank and others on how\n&gt; &gt; to better interact with their voices and acquire clearer more understandable\n&gt; &gt; messages, that would be useful.  And if you&#39;d like to explain further how I\n&gt; &gt; am &quot;wrong&quot; that the world did not end on August 15 as was predicted, please\n&gt; &gt; do so. But throwing a little tantrum with no constructive criticism doesn&#39;t\n&gt; &gt; really allow much productive conversation, if I may say so.\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; --- On Sun, 8/16/09, David Koenig &lt;floridajakeblues@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; From: David Koenig &lt;floridajakeblues@&gt;\n&gt; &gt; &gt; Subject: Re: [EVP-ITC] Calm thyself-again and again and again.....\n&gt; &gt; &gt; To: EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;\n&gt; &gt; &gt; Date: Sunday, August 16, 2009, 8:58 PM\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; RJ .. Please excuse me ... you are obviously WRONG ... How&#39;s that?\n&gt; &gt; &gt;\n&gt; &gt; &gt; On Sun, Aug 16, 2009 at 11:56 PM, David Koenig &lt;floridajakeblues@\n&gt; &gt; gmail.com&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; JR... Wake up !!!!!\n&gt; &gt; &gt;\n&gt; &gt; &gt; On Sun, Aug 16, 2009 at 6:37 PM, Rj &lt;rasterer@yahoo. com&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; Twisting a prediction after the fact to fit circumstances is one of the\n&gt; &gt; biggest mistakes (or biggest cop-outs, or biggest lies) a would-be\n&gt; &gt; future-teller makes.  The predictions you were touting were for August 15,\n&gt; &gt; and included end-of-the-world warning..  Trying to say these were correct,\n&gt; &gt; but not REALLY for August 15, and not REALLY end-of-the-world stuff, seems\n&gt; &gt; like a way to save face, or keep hoping the messages are real, when in fact,\n&gt; &gt; this is another example that they are not.\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; So from now on, you will no longer hear clear dates and predictions.  You\n&gt; &gt; may hear vague dates and vague predictions if you like, but you will not\n&gt; &gt; hear anything that can be confirmed.  Doing so would put you in a position\n&gt; &gt; of having to question the verity of the EVP data you collect.  And that\n&gt; &gt; might lead to abandoning this while area of study.  And we\n&gt; &gt; &gt; know you cannot do that.\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; --- On Sun, 8/16/09, Frank Sumption &lt;purplealiengirl@ gmail.com&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; From: Frank Sumption &lt;purplealiengirl@ gmail.com&gt;\n&gt; &gt; &gt; Subject: [EVP-ITC] Calm thyself-again and again and again.....\n&gt; &gt; &gt; To: evp-itc@yahoogroups .com\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; Date: Sunday, August 16, 2009, 3:08 PM\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;  Well, it seems the original prediction of the east coast getting\n&gt; &gt; clobbered is probably correct. Where I fell down was trying to ask questions\n&gt; &gt; and getting BS doomsville junk. I knew it&#39;s a mistake to ask questions, that\n&gt; &gt; like opens the door for the dark dorks. I&#39;m going back to just announcing\n&gt; &gt; I&#39;m doing an EVP recording, and just record. They know what I&#39;m thinking and\n&gt; &gt; what I need to know and who I would like to hear from. Asking questions, at\n&gt; &gt; least for me, has always lead to problems. I&#39;m not like others, presumming\n&gt; &gt; I&#39;m so smart and know what is talking, and if it&#39;s honest, like most of the\n&gt; &gt; box experts out there on the web. You know, the ones doing pod casts, radio\n&gt; &gt; shows and proclaiming this that and the other thing.\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;  Frank-S\n&gt; &gt; &gt;\n&gt; &gt;\n&gt; &gt;  \n&gt; &gt;\n&gt;"}