{"id": "15742", "subject": "Re: Calm thyself-again and again and again.....", "author": "Rick", "timestamp": "2009-08-18T00:50:48Z", "full_text": "Frank  I am not addressing your abilities or you specifically, just this prediction, and how people are now seeing it after August 15th has passed.  I know you are the first people to admit this stuff can&#39;t be proved, and often, you can&#39;t even trust what you hear.\n\nOut of all the predictions that seemed associated with August 15 over the past month or two, and hints about comets, and meteors, and big rocks or other things hitting the ocean, and the earth being doomed, and the end of time: out of all these and more, to pull out &quot;the coasts are clobbered  the eastern one&quot;, during hurricane season, and say that one was accurate, I see as problematic.  As I said, in the case of people who try to predict the future, to ignore all the rest and imply that they were successful on one unremarkable element in a very large prediction, doesn&#39;t really serve them well.   \n\nI think the best way to show that EVPs are provable would be with a prediction.  But, that is also the best way to discredit them.  So if anyone does decide to take the path of proving these things, I would recommend gathering and publishing the predictions they hear (before the event happens, of course).  If someone does not want to take the path of trying to prove these things, they I suggest they stay away from publishing predictions (or trying to pick and choose their pieces), as that seems to only cause stress, confusion, or worse, when the events do not occur.\n\nJust my opinion.  \n\nAnd please don&#39;t reply with &quot;Bite Me&quot; again Frank.  I&#39;d hate for you to have to ban yourself from your own group. :-)\n\n\n  \n\n\n--- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  I didn&#39;t twist dick! I said that&#39;s what happens when I ask the box stupid questions--I get stupid answers. \n&gt; \n&gt;  And who the hell here is so perfect and so knowlegdable that they know what questions to ask and what answers are valid?\n&gt; \n&gt;  This communcation mode is extremely experimental, nothing is known about it, or who uses it on the oter side. All there is is abunch of wanna be and self proclaimed experts that base everything they know on Ghost Busters and Night of the Living dead! So bite me!\n&gt; \n&gt;  F-S\n&gt; \n&gt;  \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Rj &lt;rasterer@&gt; wrote:\n&gt; &gt;\n&gt; &gt; If you like to post some (future) predictions for this year with clear dates and events, feel free. If you have advice to Frank and others on how to better interact with their voices and acquire clearer more understandable messages, that would be useful. And if you&#39;d like to explain further how I am &quot;wrong&quot; that the world did not end on August 15 as was predicted, please do so. But throwing a little tantrum with no constructive criticism doesn&#39;t really allow much productive conversation, if I may say so.\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; --- On Sun, 8/16/09, David Koenig &lt;floridajakeblues@&gt; wrote:\n&gt; &gt; \n&gt; &gt; From: David Koenig &lt;floridajakeblues@&gt;\n&gt; &gt; Subject: Re: [EVP-ITC] Calm thyself-again and again and again.....\n&gt; &gt; To: EVP-ITC@yahoogroups.com\n&gt; &gt; Date: Sunday, August 16, 2009, 8:58 PM\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt;     \n&gt; &gt;                   RJ .. Please excuse me ... you are obviously WRONG ... How&#39;s that?\n&gt; &gt; \n&gt; &gt; On Sun, Aug 16, 2009 at 11:56 PM, David Koenig &lt;floridajakeblues@ gmail.com&gt; wrote:\n&gt; &gt; \n&gt; &gt; JR... Wake up !!!!!\n&gt; &gt; \n&gt; &gt; On Sun, Aug 16, 2009 at 6:37 PM, Rj &lt;rasterer@yahoo. com&gt; wrote:\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt;     \n&gt; &gt;                   Twisting a prediction after the fact to fit circumstances is one of the biggest mistakes (or biggest cop-outs, or biggest lies) a would-be future-teller makes. The predictions you were touting were for August 15, and included end-of-the-world warning.. Trying to say these were correct, but not REALLY for August 15, and not REALLY end-of-the-world stuff, seems like a way to save face, or keep hoping the messages are real, when in fact, this is another example that they are not.\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; So from now on, you will no longer hear clear dates and predictions. You may hear vague dates and vague predictions if you like, but you will not hear anything that can be confirmed. Doing so would put you in a position of having to question the verity of the EVP data you collect. And that might lead to abandoning this while area of study. And we\n&gt; &gt;  know you cannot do that.\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; --- On Sun, 8/16/09, Frank Sumption &lt;purplealiengirl@ gmail.com&gt; wrote:\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; From: Frank Sumption &lt;purplealiengirl@ gmail.com&gt;\n&gt; &gt; Subject: [EVP-ITC] Calm thyself-again and again and again.....\n&gt; &gt; To: evp-itc@yahoogroups .com\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; Date: Sunday, August 16, 2009, 3:08 PM\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt;     \n&gt; &gt;                   Well, it seems the original prediction of the east coast getting clobbered is probably correct. WhereI fell down was trying to ask questions and getting BS doomsville junk. I knew it&#39;s a mistaketo ask questions, that like opens the door for the dark dorks. I&#39;m going back to just announcing I&#39;m doing an EVP recording, and just record. They know what I&#39;m thinking and what I need to know and who I would like to hear from. Asking questions, at least for me, has always lead to problems. I&#39;m not like others, presumming I&#39;m so smart and know what istalking, and if it&#39;s honest, like most ofthe box experts out there on the web. You know, the ones doing pod casts, radio showsand proclaiming this that and the other thing. \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; Frank-S\n&gt; &gt;\n&gt;"}