{"id": "15752", "subject": "Re: [EVP-ITC] Re: I dont think name calling is aceptible", "author": "Zack Widup", "timestamp": "2009-08-18T21:12:38Z", "full_text": "Still, you gotta admit it&#39;s fascinating that you&#39;re getting anything at all,\neven if it&#39;s BS.\n\nZack\n\nOn Tue, Aug 18, 2009 at 3:35 PM, purplespacefriend &lt;\npurplealiengirl@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;\n&gt; Same old stuff, one&#39;s opinion is absolute gospel, and if I, or anyone\n&gt; points out the facts we are just the worst bastards that ever lived!\n&gt;\n&gt; I&#39;ve told everyone for years that asking questions results in unreliable\n&gt; informatrion, and when I asked questions to try to get more information I\n&gt; got pure BS. But since that contradicts all the real box experts out there,\n&gt; who insist that they alone know how to ask the right qquestions, and I must\n&gt; be somkind of idiot moron. I just invented this crap, how could I possibly\n&gt; understand how it works!? No, leave that to some duffus that assembles\n&gt; messages to be the real expert.\n&gt;\n&gt; At least I&#39;m honest enough to tell people I tried the &quot;asccepted&quot; method of\n&gt; box use and it&#39;s crap.\n&gt;\n&gt; frank-S\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, John Brill\n&gt; &lt;jba5656@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Zack,\n&gt; &gt;\n&gt; &gt; I do not meen to offend anyone but I do not think just because you are a\n&gt; person who started this forum that you have the rite to insult and offend\n&gt; people for speaking there opinion.\n&gt; &gt;\n&gt; &gt; Is that not what this and other groups are about. someone else said the\n&gt; rules here are if you are insulting or mean then you will be baned does that\n&gt; not go for every one or is it just a few people can say what they want and\n&gt; others will be baned ?\n&gt; &gt;\n&gt; &gt; I said I did not meen to insult anyone but I feel there is an injustuce\n&gt; here and favoratsm wich is wrong in any group.\n&gt; &gt;\n&gt; &gt; why is it do as i say not as i do. the rules should be for everyone no\n&gt; matter what. if you aply this thinking to every thing we would be living in\n&gt; a world were people were in prison for doing a crime and the people in\n&gt; goverment could do as they please to sell drugs or kill or whatever and get\n&gt; away with it.\n&gt; &gt;\n&gt; &gt; we should not have to be USED TO someone who can akt and insult who ever\n&gt; he wants too when ever he wants too.\n&gt; &gt;\n&gt; &gt; that is my opinion.\n&gt; &gt; pleese forgive my english.\n&gt; &gt;\n&gt; &gt; John\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; ________________________________\n&gt; &gt; From: Zack Widup &lt;w9sz.zack@...&gt;\n&gt; &gt; To: EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;\n&gt; &gt; Sent: Tuesday, August 18, 2009 9:08:34 AM\n&gt; &gt; Subject: Re: [EVP-ITC] I dont think name calling is aceptible\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Well, it&#39;s his group (he doesn&#39;t own it now but he started it) and he&#39;s\n&gt; the one who invented the box and builds them and supplies us with all the\n&gt; info on them. His name is Frank Sumption.\n&gt; &gt;\n&gt; &gt; Those of us who have been around here half of forever are used to him and\n&gt; aren&#39;t offended.\n&gt; &gt;\n&gt; &gt; Zack\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; On Mon, Aug 17, 2009 at 6:48 PM, jba5656 &lt;jba5656@yahoo. com&gt; wrote:\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; &gt;I am sorry but I do not think it is aceptible for this FS to call\n&gt; someone a DICK for expessing an opinion or to say BITE ME to that person.\n&gt; &gt; &gt;\n&gt; &gt; &gt;on another group this would not be tolerated the person would be warned\n&gt; on the group and then asked to leave. I have seen this with a few people\n&gt; here and since I spoke up before I hope I will not be insulted.\n&gt; &gt; &gt;\n&gt; &gt; &gt;I am sorry for my earlier post I do not wish to make enimies just learn.\n&gt; &gt; &gt;\n&gt; &gt; &gt;John\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nS ill, you go a admi i 's ascina ing ha you' e ge ing any hing a all, e en i i 's BS.\n \nZack\nOn Tue, Aug 18, 2009 a 3:35 PM, pu plespace iend pu plealiengi l@...> w o e:\n\n  \n\n\n\nSame old s u , one's opinion is absolu e gospel, and i I, o anyone poin s ou he ac s we a e jus he wo s bas a ds ha e e li ed!I' e old e e yone o yea s ha asking ques ions esul s in un eliable in o ma ion, and when I asked ques ions o y o ge mo e in o ma ion I go pu e BS. Bu since ha con adic s all he eal box expe s ou he e, who insis ha hey alone know how o ask he igh qques ions, and I mus be somkind o idio mo on. I jus in en ed his c ap, how could I possibly unde s and how i wo ks!? No, lea e ha o some du us ha assembles messages o be he eal expe . \nA leas I'm hones enough o ell people I ied he \"asccep ed\" me hod o box use and i 's c ap. ank-S \n--- In EVP-ITC@yahoog oups.com, John B ill w o e:>> Zack,> > I do no meen o o end anyone bu I do no hink jus because you a e a pe son who s a ed his o um ha you ha e he i e o insul and o end people o speaking he e opinion.\n> > Is ha no wha his and o he g oups a e abou . someone else said he ules he e a e i you a e insul ing o mean hen you will be baned does ha no go o e e y one o is i jus a ew people can say wha hey wan and o he s will be baned ?\n> > I said I did no meen o insul anyone bu I eel he e is an injus uce he e and a o a sm wich is w ong in any g oup.> > why is i do as i say no as i do. he ules should be o e e yone no ma e wha . i you aply his hinking o e e y hing we would be li ing in a wo ld we e people we e in p ison o doing a c ime and he people in go e men could do as hey please o sell d ugs o kill o wha e e and ge away wi h i .\n> > we should no ha e o be USED TO someone who can ak and insul who e e he wan s oo when e e he wan s oo.> > ha is my opinion.> pleese o gi e my english.> > John\n> > > > > ________________________________> F om: Zack Widup \n> To: EVP-ITC@yahoog oups.com> Sen : Tuesday, Augus 18, 2009 9:08:34 AM> Subjec : Re: [EVP-ITC] I don hink name calling is acep ible\n> >   > Well, i 's his g oup (he doesn' own i now bu he s a ed i ) and he's he one who in en ed he box and builds hem and supplies us wi h all he in o on hem. His name is F ank Sump ion.\n> > Those o us who ha e been a ound he e hal o o e e a e used o him and a en' o ended.> > Zack> > > On Mon, Aug 17, 2009 a 6:48 PM, jba5656 w o e:\n> >   > >I am so y bu I do no hink i is acep ible o his FS o call someone a DICK o expessing an opinion o o say BITE ME o ha pe son.> >> >on ano he g oup his would no be ole a ed he pe son would be wa ned on he g oup and hen asked o lea e. I ha e seen his wi h a ew people he e and since I spoke up be o e I hope I will no be insul ed.\n> >> >I am so y o my ea lie pos I do no wish o make enimies jus lea n.> >> >John> >> >>"}