{"id": "15753", "subject": "Re: NOTICE TO ALL : Enough already!", "author": "Lisa", "timestamp": "2009-08-18T18:43:07Z", "full_text": "--- In EVP-ITC@yahoogroups.com, &quot;Misty&quot; &lt;bulletbabea@...&gt; wrote:\n&gt;\n&gt; I am getting pretty tired of a few whos sole purpose in this group is to provoke Frank and other members into negativity. If it continues you and your fake nicknames will be removed. Your attempts to promote your &quot;other group&quot; will be viewed as spam and deleted as such. They may go unnoticed by the group but they dont go unnoticed by me. Funny how its always just that one person/group that you promote while every post you make is not about your research or anyone elses but rather a  play on words meant to provoke someone. You should run a quick background check on your friend the owner of that &quot;other group&quot; you may find you know less than you thought you did. You know who you are. And so do I.\n&gt; \n&gt; As for Frank, he knows I dont always agree with what he says. He knows I definitely dont agree with the namecalling or public venting. Having said that. Frank is the founder of this group. As such he will ALWAYS have a voice here. Those who dont like that or dont agree are free to move on.\n&gt; \n&gt; If you are here to learn about EVP-ITC, Frank&#39;s Box, or share your research, by all means do so. If you are here for another purpose then dont be surprised when you go to sign in and find you are no longer a member here.\n&gt; \n&gt; Misty\n&gt;\n\n\nHi Misty,\n\nI joined this group a long time ago...pretty much a silent observer. I don&#39;t even read all of the emails I get on updates. I thought when I saw the whole name calling thing it was some sensitive person whining about a spirit saying colorful things to them...then I read a few. ARE THEY SERIOUS. Please know there are many people who agree with you and Frank and agree whole heartedly you should delete the faint of heart...LOL. Can you imagine how they would react to a simple BOO from a voice from beyond? LOL...what fools."}