{"id": "15764", "subject": "Re: I dont think name calling is aceptible", "author": "Not given", "timestamp": "2009-08-19T03:02:59Z", "full_text": "Everything out of the box no matter what you use is unreliable information at best. Didn&#39;t you start getting these warnings before you even started asking questions Frank?\n\nOn average how often do you all get predictions ? \n\nI&#39;ve gotten a couple I suppose one about a bomb and an airport I forget the other something about planet x.\n\nEnd of the world stuff doesn&#39;t concern me in the least nothing I can do about or anyone else for that matter and predictions don&#39;t mean diddly squat either their fun to talk about but no one in their right mind would take you serious if you told them of an impending action was going to take place because you heard it on your radio, ghost box , evp recording.\n\nAs their is no method to the madness no set science for this people know what works best for them so they do it their way and that&#39;s just the way it is. Now creating a file out of nothing is totally different story.\n\nBTW they still haven&#39;t buried Micheal Jackson wth!!\n\n\nShane\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt; \n&gt;  Same old stuff, one&#39;s opinion is absolute gospel, and if I, or anyone points out the facts we are just the worst bastards that ever lived!\n&gt; \n&gt;  I&#39;ve told everyone for years that asking questions results in unreliable informatrion, and when I asked questions to try to get more information I got pure BS. But since that contradicts all the real box experts out there, who insist that they alone know how to ask the right qquestions, and I must be somkind of idiot moron. I just invented this crap, how could I possibly understand how it works!? No, leave that to some duffus that assembles messages to be the real expert. \n&gt; \n&gt;  At least I&#39;m honest enough to tell people I tried the &quot;asccepted&quot; method of box use and it&#39;s crap. \n&gt; \n&gt;  frank-S\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, John Brill &lt;jba5656@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Zack,\n&gt; &gt; \n&gt; &gt; I do not meen to offend anyone but I do not think just because you are a person who started this forum that you have the rite to insult and offend people for speaking there opinion.\n&gt; &gt; \n&gt; &gt; Is that not what this and other groups are about. someone else said the rules here are if you are insulting or mean then you will be baned does that not go for every one or is it just a few people can say what they want and others will be baned ?\n&gt; &gt; \n&gt; &gt; I said I did not meen to insult anyone but I feel there is an injustuce here and favoratsm wich is wrong in any group.\n&gt; &gt; \n&gt; &gt; why is it do as i say not as i do. the rules should be for everyone no matter what. if you aply this thinking to every thing we would be living in a world were people were in prison for doing a crime and the people in goverment could do as they please to sell drugs or kill or whatever and get away with it.\n&gt; &gt; \n&gt; &gt; we should not have to be USED TO someone who can akt and insult who ever he wants too when ever he wants too.\n&gt; &gt; \n&gt; &gt; that is my opinion.\n&gt; &gt; pleese forgive my english.\n&gt; &gt; \n&gt; &gt; John\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; ________________________________\n&gt; &gt; From: Zack Widup &lt;w9sz.zack@&gt;\n&gt; &gt; To: EVP-ITC@yahoogroups.com\n&gt; &gt; Sent: Tuesday, August 18, 2009 9:08:34 AM\n&gt; &gt; Subject: Re: [EVP-ITC] I dont think name calling is aceptible\n&gt; &gt; \n&gt; &gt;  \n&gt; &gt; Well, it&#39;s his group (he doesn&#39;t own it now but he started it) and he&#39;s the one who invented the box and builds them and supplies us with all the info on them. His name is Frank Sumption.\n&gt; &gt; \n&gt; &gt; Those of us who have been around here half of forever are used to him and aren&#39;t offended.\n&gt; &gt; \n&gt; &gt; Zack\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; On Mon, Aug 17, 2009 at 6:48 PM, jba5656 &lt;jba5656@yahoo. com&gt; wrote:\n&gt; &gt; \n&gt; &gt;  \n&gt; &gt; &gt;I am sorry but I do not think it is aceptible for this FS to call someone a DICK for expessing an opinion or to say BITE ME to that person.\n&gt; &gt; &gt;\n&gt; &gt; &gt;on another group this would not be tolerated the person would be warned on the group and then asked to leave. I have seen this with a few people here and since I spoke up before I hope I will not be insulted.\n&gt; &gt; &gt;\n&gt; &gt; &gt;I am sorry for my earlier post I do not wish to make enimies just learn.\n&gt; &gt; &gt;\n&gt; &gt; &gt;John\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}