{"id": "15761", "subject": "Re: NOTICE TO ALL : Enough already!", "author": "Misty", "timestamp": "2009-08-18T23:25:07Z", "full_text": "Great idea! I agree =)\n\nMisty\n\n--- In EVP-ITC@yahoogroups.com, wyatt talley &lt;onyxreddragon@...&gt; wrote:\n&gt;\n&gt; Why are people getting so wrapped up about comments and even EVP stuff,  Remember you need to take EVP&#39;s with a grain of salt for they often lie to get our attention and cause havoc.  The only EVP&#39;s that might be somewhat truthful is ones that pertain to actual hunts and are more residual than anything. I&#39;m not here to start anything or provoke anyone much less Frank or Misty but we need to get on with things and get back to research and the ability to find out what they are saying/meaning!\n&gt; \n&gt; -Onyx\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; ________________________________\n&gt; From: Misty &lt;bulletbabea@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Tuesday, August 18, 2009 4:49:26 PM\n&gt; Subject: [EVP-ITC] Re: NOTICE TO ALL : Enough already!\n&gt; \n&gt;   \n&gt; Why did you take such offense to a &quot;harmless&quot; comment if you have no idea what it means. Actually David Koenigs been in this group longer than you have =)\n&gt; \n&gt; You have all been given the chance to change your tune. And provoking people into petty bickering is not one of the ways to do that. Find something better to discuss and better ways to spend your time. As for warnings consider this the last one.\n&gt; \n&gt; Misty\n&gt; \n&gt; --- In EVP-ITC@yahoogroups .com, Rj &lt;rasterer@ .&gt; wrote:\n&gt; &gt;\n&gt; &gt; Misty, I agree we really need to drop this and get on with the purpose of the group, but this Koenig guy below continues to make accusations and keep this angst going. I personally have no idea what this Magic Cafe thing is he is now accusing people of.  Maybe he&#39;s a newbie or something and doesn&#39;t understand forum decorum, so maybe another warning would be sufficient? I&#39;d hate to see a newbie get banned because he got his emotions up.\n&gt; &gt; \n&gt; &gt; --- On Tue, 8/18/09, David Koenig &lt;floridajakeblues@ ...&gt; wrote:\n&gt; &gt; \n&gt; &gt; From: David Koenig &lt;floridajakeblues@ ...&gt;\n&gt; &gt; Subject: Re: [EVP-ITC] Re: NOTICE TO ALL : Enough already!\n&gt; &gt; To: EVP-ITC@yahoogroups .com\n&gt; &gt; Date: Tuesday, August 18, 2009, 2:59 PM\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt;  \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt;                   The same group attacked the Magic Cafe.They were all booted out!\n&gt; &gt; \n&gt; &gt; On Tue, Aug 18, 2009 at 2:43 PM, Lisa &lt;lawlis1969@ yahoo. com&gt; wrote:\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt;  \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt;                   --- In EVP-ITC@yahoogroups .com, &quot;Misty&quot; &lt;bulletbabea@ ...&gt; wrote:\n&gt; &gt; \n&gt; &gt; &gt;\n&gt; &gt; \n&gt; &gt; &gt; I am getting pretty tired of a few whos sole purpose in this group is to provoke Frank and other members into negativity. If it continues you and your fake nicknames will be removed. Your attempts to promote your &quot;other group&quot; will be viewed as spam and deleted as such. They may go unnoticed by the group but they dont go unnoticed by me. Funny how its always just that one person/group that you promote while every post you make is not about your research or anyone elses but rather a  play on words meant to provoke someone. You should run a quick background check on your friend the owner of that &quot;other group&quot; you may find you know less than you thought you did. You know who you are. And so do I.\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; As for Frank, he knows I dont always agree with what he says. He knows I definitely dont agree with the namecalling or public venting. Having said that. Frank is the founder of this group. As such he will ALWAYS have a voice here. Those who dont like that or dont agree are free to move on.\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; If you are here to learn about EVP-ITC, Frank&#39;s Box, or share your research, by all means do so. If you are here for another purpose then dont be surprised when you go to sign in and find you are no longer a member here.\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; Misty\n&gt; &gt; \n&gt; &gt; &gt;\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; Hi Misty,\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; I joined this group a long time ago...pretty much a silent observer. I don&#39;t even read all of the emails I get on updates. I thought when I saw the whole name calling thing it was some sensitive person whining about a spirit saying colorful things to them...then I read a few. ARE THEY SERIOUS. Please know there are many people who agree with you and Frank and agree whole heartedly you should delete the faint of heart...LOL. Can you imagine how they would react to a simple BOO from a voice from beyond? LOL...what fools.\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; ____________ _________ _________ _________ _________ __\n&gt; &gt; Do You Yahoo!?\n&gt; &gt; Tired of spam?  Yahoo! Mail has the best spam protection around \n&gt; &gt; http://mail. yahoo.com\n&gt; &gt;\n&gt;"}