{"id": "15771", "subject": "Re: [EVP-ITC] The nature of things!", "author": "SnowfireL@aol.com", "timestamp": "2009-08-19T13:19:49Z", "full_text": "-------------------------------1250687989\r\nContent-Type: text/plain; charset=&quot;US-ASCII&quot;\r\nContent-Transfer-Encoding: 7bit\r\n\r\nMost of us do not have &quot;all the equipment&quot;  \nwe are using RS radio&#39;s, most people don&#39;t have a &quot;Frank&#39;s Box,&quot; so we have \n no other choice anyway. \n&quot;Point is you have plenty of questions to ask the human&#39;s who have built \nthe  equipment you are using before you can even begin to ask questions of the \n entities you are communicating with.&quot;\n \n \nIn a message dated 8/19/2009 9:08:27 A.M. Eastern Daylight Time,  \nwarrior18eii@... writes:\n\n \n \n \n \nAssumptions and expectations!Assumptions and expectations!&lt;WBR&gt;? I hear a \nlot of both of these concepts  in your words and when mentioning your \nresearch. Cognitive functioning or  processing sensory information in order to come \nto a conclusion or judgement  is how we function in this world. In order \nfor your mind to understand this  physical world you live in it automatically \nmakes certain assumptions about  sensory information it takes in. Your eyes \nexpect to see objects oriented  correctly, with the correct color, lighting, \nreflectivity and shading, and you  expect there size and shape to be within \nscale compared to other objects. My  point is your senses have a range, \nwhich implies limitations. Since this is  correct for your senses it is also \ncorrect for your ability to understand  perspectives with any wide ranging \ndiversity. You are able to see and process  the information of our physical \nworld just as any other human being does. That  is great for a human but why \nwould you think for a second, you co of a mind and  voice that speaks through  \na radio from some unknown location. \nThe information you receive from the other side of your radios or even from \n thin air through EVP&#39;s could be completely correct and true no matter what \nthe  context because you don&#39;t know what perspective it is coming from. You \nare  making a lot of unfounded assumptions about the (dare I say) beings or \nworlds  they exist in and have a lot of expectations about the information \nyou  receive. You are looking for answers to the wrong questions! Quit \nassuming  that these entities know you or the people around you. Quit assuming \nthey are  here for your entertainment as a personal fortune teller. Quit \nexpecting them  to know answers to question they may have themselves (just \nbecause they aren&#39;t  physical doesn&#39;t mean they know everything). Don&#39;t assume you \nwill be speaking  to a dead relative or someone you once knew. Go to a \nfortune teller if you  want information about the furture. If you are serious \nabout researching these  voices and the equipment used to record them then ask \nthe right questions.  \nIf you have a box made by Frank then ask Frank how the different circuits  \nwork, what is the puropose of some of the options, why is the RVG better or  \nworse than a circuit without it? You have a unique situation here where the \n inventor of an important piece of equipment is willing to share the most  \nminute details of how it works without a price tag attached. Some of the \nother  box variations are sold by one person but created by someone else and \nusually  based on some loose design similar to Frank&#39;s. The other equipment \nmade by  Bill Chapp and others will probably stay a mystery because they are \nsold for  profit. Most people who use the different &quot;hacks&quot; know how to make \nthem but  don&#39;t know much about electronic theory or the behavior of radio \nwaves to  understand how they work. \nPoint is you have plenty of questions to ask the human&#39;s who have built the \n equipment you are using before you can even begin to ask questions of the  \nentities you are communicating with. \nRegards, \nFrank R.\n\n\n\n\n\n\r\n-------------------------------1250687989\r\nContent-Type: text/html; charset=&quot;US-ASCII&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML 4.0 Transitional//EN&quot;&gt;\n&lt;HTML&gt;&lt;HEAD&gt;=\r\n\n&lt;META content=3D&quot;text/html; charset=3DUS-ASCII&quot; http-equiv=3DContent-Type&gt;=\r\n\n&lt;META name=3DGENERATOR content=3D&quot;MSHTML 8.00.6001.18812&quot;&gt;&lt;/HEAD&gt;\n&lt;BODY st=\r\nyle=3D&quot;FONT-FAMILY: Arial; COLOR: #000000; FONT-SIZE: 10pt&quot; id=3Drole_body =\r\n\nbottomMargin=3D7 leftMargin=3D7 rightMargin=3D7 topMargin=3D7&gt;&lt;FONT id=3Dr=\r\nole_document \ncolor=3D#000000 size=3D2 face=3DArial&gt;\n&lt;DIV&gt;Most of us do not=\r\n have &quot;all the equipment&quot; \n&lt;P&gt;we are using RS radio&#39;s, most people don&#39;t ha=\r\nve a &quot;Frank&#39;s Box,&quot; so we have \nno other choice anyway.&lt;/P&gt;\n&lt;P&gt;&quot;Point is yo=\r\nu have plenty of questions to ask the human&#39;s who have built the \nequipment=\r\n you are using before you can even begin to ask questions of the \nentities =\r\nyou are communicating with.&quot;&lt;/P&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;In a me=\r\nssage dated 8/19/2009 9:08:27 A.M. Eastern Daylight Time, \nwarrior18eii@yah=\r\noo.com writes:&lt;/DIV&gt;\n&lt;BLOCKQUOTE \nstyle=3D&quot;BORDER-LEFT: blue 2px solid; PAD=\r\nDING-LEFT: 5px; MARGIN-LEFT: 5px&quot;&gt;&lt;FONT \n  style=3D&quot;BACKGROUND-COLOR: trans=\r\nparent&quot; color=3D#000000 size=3D2 face=3DArial&gt;&lt;SPAN \n  style=3D&quot;DISPLAY: no=\r\nne&quot;&gt;&nbsp;&lt;/SPAN&gt; \n  &lt;DIV id=3Dygrp-text&gt;\n  &lt;P&gt;\n  &lt;DIV \n  style=3D&quot;FONT-FAM=\r\nILY: times new roman, new york, times, serif; FONT-SIZE: 12pt&quot;&gt;\n  &lt;P&gt;Assump=\r\ntions and expectations!&lt;WBR&gt;? I hear a lot of both of these concepts \n  in =\r\nyour words and when mentioning your research. Cognitive functioning or \n  p=\r\nrocessing sensory information in order to come to a conclusion or judgement=\r\n \n  is how we function in this world. In order for your mind to understand =\r\nthis \n  physical world you live in it automatically makes certain assumptio=\r\nns about \n  sensory information it takes in. Your eyes expect to see object=\r\ns oriented \n  correctly, with the correct color, lighting, reflectivity and=\r\n shading, and you \n  expect there size and shape to be within scale compare=\r\nd to other objects. My \n  point is your senses have a range, which implies =\r\nlimitations. Since this is \n  correct for your senses it is also correct fo=\r\nr your ability to understand \n  perspectives with any wide ranging diversit=\r\ny. You are able to see and process \n  the information of our physical world=\r\n just as any other human being does. That \n  is great for a human but why w=\r\nould you think for a second, you could \n  understand the perspective&nbsp;o=\r\nf a mind and&nbsp; voice that speaks through \n  a radio from some unknown l=\r\nocation.&lt;/P&gt;\n  &lt;P&gt;&nbsp;&lt;/P&gt;\n  &lt;P&gt;The information you receive from the othe=\r\nr side of your radios or even from \n  thin air through EVP&#39;s could be compl=\r\netely correct and true no matter what the \n  context because you don&#39;t know=\r\n what perspective it is coming from. You are \n  making a lot of unfounded a=\r\nssumptions about the (dare I say) beings or worlds \n  they exist in and hav=\r\ne a lot of expectations about the information you \n  receive. You are looki=\r\nng for answers to the wrong questions! Quit assuming \n  that these entities=\r\n know you or the people around you. Quit assuming they are \n  here for your=\r\n entertainment as a personal fortune teller. Quit expecting them \n  to know=\r\n answers to question they may have themselves (just because they aren&#39;t \n  =\r\nphysical doesn&#39;t mean they know everything). Don&#39;t assume you will be speak=\r\ning \n  to a dead relative or someone you once knew. Go to a fortune teller =\r\nif you \n  want information about the furture. If you are serious about rese=\r\narching these \n  voices and the equipment used to record them then ask the =\r\nright questions. \n&lt;/P&gt;\n  &lt;P&gt;&nbsp;&lt;/P&gt;\n  &lt;P&gt;If you have a box made by Frank=\r\n then ask Frank how the different circuits \n  work, what is the puropose of=\r\n some of the options, why is the RVG better or \n  worse than a circuit with=\r\nout it? You have a unique situation here where the \n  inventor of an import=\r\nant piece of equipment is willing to share the most \n  minute details of ho=\r\nw it works without a price tag attached. Some of the other \n  box variation=\r\ns are sold by one person but created by someone else and usually \n  based o=\r\nn some loose design similar to Frank&#39;s. The other equipment made by \n  Bill=\r\n Chapp and others will probably stay a mystery because they are sold for \n =\r\n profit. Most people who use the different &quot;hacks&quot; know how to make them bu=\r\nt \n  don&#39;t know much about electronic theory or the behavior of radio waves=\r\n to \n  understand how they work.&lt;/P&gt;\n  &lt;P&gt;&nbsp;&lt;/P&gt;\n  &lt;P&gt;Point is you have=\r\n plenty of questions to ask the human&#39;s who have built the \n  equipment you=\r\n are using before you can even begin to ask questions of the \n  entities yo=\r\nu are communicating with.&lt;/P&gt;\n  &lt;P&gt;&nbsp;&lt;/P&gt;\n  &lt;P&gt;Regards,&lt;/P&gt;\n  &lt;P&gt;&nbsp;=\r\n&lt;/P&gt;\n  &lt;P&gt;Frank R.&lt;/P&gt;&lt;/DIV&gt;&lt;BR&gt;\n  &lt;P&gt;&lt;/P&gt;&lt;/DIV&gt;\n  &lt;DIV style=3D&quot;COLOR: whi=\r\nte; CLEAR: both&quot; width=3D&quot;1&quot;&gt;&lt;/DIV&gt;&lt;/FONT&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;/FONT&gt;&lt;DIV CL=\r\nASS=3D&quot;aol_ad_footer&quot; ID=3D&quot;b0d474b3cee83b381d29dd67ce9f87e8&quot;&gt;&lt;br/&gt;&lt;font st=\r\nyle=3D&quot;color:black;font:normal 10pt arial,san-serif;&quot;&gt; &lt;hr style=3D&quot;margin-=\r\ntop:10px&quot;/&gt;&lt;/font&gt;&lt;/DIV&gt;&lt;/BODY&gt;&lt;/HTML&gt;\n\r\n-------------------------------1250687989--"}