{"id": "15782", "subject": "Re: I just want to say...", "author": "bulletbabea", "timestamp": "2009-08-20T02:32:32Z", "full_text": "I think it varies depending on who you ask as well as what they have personally experienced. As an example, some people believe in angels and demons others do not. Therefor some may get messages that correspond to their own beliefs as well as the beliefs of those who are speaking.\n\nAlmost every person who does this eventually develops a theory that may change over time based on what they experience and what their beliefs are. Then there are those who remain undecided or have doubts.\n\nAs for me I look at it as purely educational, a learning experience. Ive met many people I never knew existed. Ive researched topics I&#39;d never even considered. Ive gotten messages and images that are awe inspiring and many interesting concepts to ponder and explore.\n\nThere are many glimpses of truth, as well as momentary proof along the way that lead me to develop my own theory and eventually you will develop your own too. This research is fascinating and can be quite mind blowing.\n\nI dont worry what anyone else thinks. I have no need to prove anything to anyone else. They can do that for themselves. I always say honesty is the best policy and if you are honest with yourself and others the only ones who object are those who&#39;s lies arent tolerated. So just look for the truth yourself and dont let me or anyone else tell you what that is. \n\nIt&#39;s a great journey and your path is your own!\n\nMisty\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;mrscaptainjack2&quot; &lt;jjkamp@...&gt; wrote:\n&gt;\n&gt; Thank you, guys, but I just wanted to make sure -- really sure.  Sometimes it&#39;s hard on here to figure out which post is replying to which!\n&gt; \n&gt; So I&#39;ve been thinking about this over and over -- I&#39;ve been able to think of little else in the last few days -- trying to figure this out and make some sort of reasonable theory I can live with.  I know we will never have a true answer, at least not any time soon, but surely those who have been doing this for years and years must have a working theory on what these entities are?  Based on their behavior rather than what they say?  Based on consistencies from researcher to researcher?  Based on things these entities know and don&#39;t know (e.g. knew my dad&#39;s friend Gordy was dead, while I did not)?\n&gt;"}