{"id": "15802", "subject": "Re: [EVP-ITC] Re: The nature of things!", "author": "April Abercrombie", "timestamp": "2009-08-20T14:17:11Z", "full_text": "------=_NextPart_000_0231_01CA216E.9DCA9920\r\nContent-Type: text/plain;\n\tcharset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&quot;Just because speech is all perception does not make invalid--that even nor=\r\nmal speech is highly subjective. If you used the rules of these scienctists=\r\n, you couldn&#39;t even trust what the guy sitting next to you was saying. You =\r\ncouldn&#39;t trust what you were hearing!&quot;\n\nYou&#39;re right....and I don&#39;t LOL! Al=\r\nl I hope to be able to do is find proof of actual spirit communication. I d=\r\non&#39;t care so much about what is being communicated, only that it is.\n\n-----=\r\n---------------------------------------------------------------------------=\r\n\n\n\n&quot;Even it was all imagination, that does not make it invalid or useless. =\r\nIt&#39;s still serves as personal insight. &quot;\n\nI absolutely agree.\n\n  ----- Orig=\r\ninal Message ----- \n  From: purplespacefriend \n  To: EVP-ITC@...=\r\nm \n  Sent: Thursday, August 20, 2009 7:55 AM\n  Subject: [EVP-ITC] Re: The n=\r\nature of things!\n\n\n    I think the mind is not physical, and it&#39;s only thes=\r\ne paranoid scientist types that try to bully everyone into that extrememly =\r\nnarrow thinking that everything experienced is physical phenomenon only, an=\r\nd must be made to fit into that context. \n\n  Just because speech is all per=\r\nception does not make invalid--that even normal speech is highly subjective=\r\n. If you used the rules of these scienctists, you couldn&#39;t even trust what =\r\nthe guy sitting next to you was saying. You couldn&#39;t trust what you were he=\r\naring!\n\n  Perception is everything. How is it that just before some mass de=\r\nath thing, like a plane crash or some disaster I see the shadows shift, it =\r\nshould not be possible, but never the less, I&#39;ve seen it happen over and ov=\r\ner. These scientific types brain wash everyone into not looking at clouds a=\r\ns you might imagine you see something--well a day or two before tornados in=\r\n other states I see circles in the clouds here-hundreds of miles away. Peop=\r\nle see me looking up and look at me like I&#39;m insane because of these bully =\r\nskeptics. You&#39;re not allowed to perceive anything unless they tell you it&#39;s=\r\n ok. You can&#39;t look at clouds, and you can&#39;t listen to voices fragments, cu=\r\nz they can&#39;t explain away the perceptions. These scientist types are too br=\r\nain dead to realize they too create thier reality-all those supposed new pa=\r\nrticals did not exist before someone theorized about them, then they are cr=\r\neated and &quot;discovered&quot;. \n\n  Even it was all imagination, that does not make=\r\n it invalid or useless. It&#39;s still serves as personal insight. \n\n  frank-S\n=\r\n\n  --- In EVP-ITC@yahoogroups.com, Frank Ratka &lt;warrior18eii@...&gt; wrote:\n  =\r\n&gt;\n  &gt; Assumptions and expectations!? I hear a lot of both of these concepts=\r\n in your words and when mentioning your research. Cognitive functioning or =\r\nprocessing sensory information in order to come to a conclusion or judgemen=\r\nt is how we function in this world. In order for your mind to understand th=\r\nis physical world you live in it automatically makes certain assumptions ab=\r\nout sensory information it takes in. Your eyes expect to see objects orient=\r\ned correctly, with the correct color, lighting, reflectivity and shading, a=\r\nnd you expect there size and shape to be within scale compared to other obj=\r\nects. My point is your senses have a range, which implies limitations. Sinc=\r\ne this is correct for your senses it is also correct for your ability to un=\r\nderstand perspectives with any wide ranging diversity. You are able to see =\r\nand process the information of our physical world just as any other human b=\r\neing does. That is great for a human but why would you think for a second,\n=\r\n  &gt; you could understand the perspective of a mind and  voice that speaks t=\r\nhrough a radio from some unknown location.\n  &gt;  \n  &gt; The information you re=\r\nceive from the other side of your radios or even from thin air through EVP&#39;=\r\ns could be completely correct and true no matter what the context because y=\r\nou don&#39;t know what perspective it is coming from. You are making a lot of u=\r\nnfounded assumptions about the (dare I say) beings or worlds they exist in =\r\nand have a lot of expectations about the information you receive. You are l=\r\nooking for answers to the wrong questions! Quit assuming that these entitie=\r\ns know you or the people around you. Quit assuming they are here for your e=\r\nntertainment as a personal fortune teller. Quit expecting them to know answ=\r\ners to question they may have themselves (just because they aren&#39;t physical=\r\n doesn&#39;t mean they know everything). Don&#39;t assume you will be speaking to a=\r\n dead relative or someone you once knew. Go to a fortune teller if you want=\r\n information about the furture. If you are serious about researching these =\r\nvoices and the equipment used to record them\n  &gt; then ask the right questio=\r\nns. \n  &gt;  \n  &gt; If you have a box made by Frank then ask Frank how the diffe=\r\nrent circuits work, what is the puropose of some of the options, why is the=\r\n RVG better or worse than a circuit without it? You have a unique situation=\r\n here where the inventor of an important piece of equipment is willing to s=\r\nhare the most minute details of how it works without a price tag attached. =\r\nSome of the other box variations are sold by one person but created by some=\r\none else and usually based on some loose design similar to Frank&#39;s. The oth=\r\ner equipment made by Bill Chapp and others will probably stay a mystery bec=\r\nause they are sold for profit. Most people who use the different &quot;hacks&quot; kn=\r\now how to make them but don&#39;t know much about electronic theory or the beha=\r\nvior of radio waves to understand how they work.\n  &gt;  \n  &gt; Point is you hav=\r\ne plenty of questions to ask the human&#39;s who have built the equipment you a=\r\nre using before you can even begin to ask questions of the entities you are=\r\n communicating with.\n  &gt;  \n  &gt; Regards,\n  &gt;  \n  &gt; Frank R.\n  &gt;\n\n\n\n  \r\n------=_NextPart_000_0231_01CA216E.9DCA9920\r\nContent-Type: text/html;\n\tcharset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML 4.0 Transitional//EN&quot;&gt;\n&lt;HTML&gt;&lt;HEAD&gt;=\r\n\n&lt;META content=3D&quot;text/html; charset=3Diso-8859-1&quot; http-equiv=3DContent-Typ=\r\ne&gt;\n&lt;META name=3DGENERATOR content=3D&quot;MSHTML 8.00.6001.18812&quot;&gt;&lt;/HEAD&gt;\n&lt;BODY =\r\nstyle=3D&quot;BACKGROUND-COLOR: #ffffff&quot; bgColor=3D#ffffff&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 =\r\nface=3D&quot;Myriad Pro&quot;&gt;&lt;FONT size=3D3 face=3D&quot;Times New Roman&quot;&gt;&quot;Just \nbecause =\r\nspeech is all perception does not make invalid--that even normal speech \nis=\r\n highly subjective. If you used the rules of these scienctists, you couldn&#39;=\r\nt \neven trust what the guy sitting next to you was saying. You couldn&#39;t tru=\r\nst what \nyou were hearing!&quot;&lt;/FONT&gt;&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 face=3D=\r\n&quot;Myriad Pro&quot;&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 face=3D&quot;Myriad Pro&quot;&gt;Yo=\r\nu&#39;re right....and I don&#39;t LOL! All I hope \nto be able to do is find proof o=\r\nf actual spirit communication. I don&#39;t care so \nmuch about what is being co=\r\nmmunicated, only that it is.&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;\n&lt;HR&gt;\n&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=\r\n=3D2 face=3D&quot;Myriad Pro&quot;&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 face=3D&quot;My=\r\nriad Pro&quot;&gt;&lt;FONT size=3D3 face=3D&quot;Times New Roman&quot;&gt;&quot;Even it \nwas all imagina=\r\ntion, that does not make it invalid or useless. It&#39;s still serves \nas perso=\r\nnal insight. &quot;&lt;/FONT&gt;&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 face=3D&quot;Myriad Pro&quot;&gt;=\r\n&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 face=3D&quot;Myriad Pro&quot;&gt;I absolutely ag=\r\nree.&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 face=3D&quot;Myriad Pro&quot;&gt;&lt;/FONT&gt;&nbsp;&lt;/DI=\r\nV&gt;\n&lt;BLOCKQUOTE \nstyle=3D&quot;BORDER-LEFT: #000000 2px solid; PADDING-LEFT: 5px;=\r\n PADDING-RIGHT: 0px; MARGIN-LEFT: 5px; MARGIN-RIGHT: 0px&quot; \ndir=3Dltr&gt;\n  &lt;DI=\r\nV style=3D&quot;FONT: 10pt arial&quot;&gt;----- Original Message ----- &lt;/DIV&gt;\n  &lt;DIV \n  =\r\nstyle=3D&quot;FONT: 10pt arial; BACKGROUND: #e4e4e4; font-color: black&quot;&gt;&lt;B&gt;From:=\r\n&lt;/B&gt; \n  &lt;A title=3Dpurplealiengirl@... \n  href=3D&quot;mailto:purplealieng=\r\nirl@...&quot;&gt;purplespacefriend&lt;/A&gt; &lt;/DIV&gt;\n  &lt;DIV style=3D&quot;FONT: 10pt aria=\r\nl&quot;&gt;&lt;B&gt;To:&lt;/B&gt; &lt;A title=3DEVP-ITC@yahoogroups.com \n  href=3D&quot;mailto:EVP-ITC@=\r\nyahoogroups.com&quot;&gt;EVP-ITC@yahoogroups.com&lt;/A&gt; &lt;/DIV&gt;\n  &lt;DIV style=3D&quot;FONT: 1=\r\n0pt arial&quot;&gt;&lt;B&gt;Sent:&lt;/B&gt; Thursday, August 20, 2009 7:55 \n  AM&lt;/DIV&gt;\n  &lt;DIV s=\r\ntyle=3D&quot;FONT: 10pt arial&quot;&gt;&lt;B&gt;Subject:&lt;/B&gt; [EVP-ITC] Re: The nature of \n  th=\r\nings!&lt;/DIV&gt;\n  &lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;SPAN style=3D&quot;DISPLAY: none&quot;&gt;&nbsp;&lt;/SPAN&gt; \n =\r\n &lt;DIV id=3Dygrp-text&gt;\n  &lt;P&gt;I think the mind is not physical, and it&#39;s only =\r\nthese paranoid scientist \n  types that try to bully everyone into that extr=\r\nememly narrow thinking that \n  everything experienced is physical phenomeno=\r\nn only, and must be made to fit \n  into that context. &lt;BR&gt;&lt;BR&gt;Just because =\r\nspeech is all perception does not make \n  invalid--that even normal speech =\r\nis highly subjective. If you used the rules \n  of these scienctists, you co=\r\nuldn&#39;t even trust what the guy sitting next to you \n  was saying. You could=\r\nn&#39;t trust what you were hearing!&lt;BR&gt;&lt;BR&gt;Perception is \n  everything. How is=\r\n it that just before some mass death thing, like a plane \n  crash or some d=\r\nisaster I see the shadows shift, it should not be possible, but \n  never th=\r\ne less, I&#39;ve seen it happen over and over. These scientific types \n  brain =\r\nwash everyone into not looking at clouds as you might imagine you see \n  so=\r\nmething--well a day or two before tornados in other states I see circles in=\r\n \n  the clouds here-hundreds of miles away. People see me looking up and lo=\r\nok at \n  me like I&#39;m insane because of these bully skeptics. You&#39;re not all=\r\nowed to \n  perceive anything unless they tell you it&#39;s ok. You can&#39;t look a=\r\nt clouds, and \n  you can&#39;t listen to voices fragments, cuz they can&#39;t expla=\r\nin away the \n  perceptions. These scientist types are too brain dead to rea=\r\nlize they too \n  create thier reality-all those supposed new particals did =\r\nnot exist before \n  someone theorized about them, then they are created and=\r\n &quot;discovered&quot;&lt;WBR&gt;. \n  &lt;BR&gt;&lt;BR&gt;Even it was all imagination, that does not m=\r\nake it invalid or useless. \n  It&#39;s still serves as personal insight. &lt;BR&gt;&lt;B=\r\nR&gt;frank-S&lt;BR&gt;&lt;BR&gt;--- In &lt;A \n  href=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP=\r\n-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;, \n  Frank Ratka &lt;warrior18eii@&lt;WBR&gt;...&gt;=\r\n wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; Assumptions \n  and expectations!&lt;WBR&gt;? I hear a lot=\r\n of both of these concepts in your words \n  and when mentioning your resear=\r\nch. Cognitive functioning or processing sensory \n  information in order to =\r\ncome to a conclusion or judgement is how we function \n  in this world. In o=\r\nrder for your mind to understand this physical world you \n  live in it auto=\r\nmatically makes certain assumptions about sensory information \n  it takes i=\r\nn. Your eyes expect to see objects oriented correctly, with the \n  correct =\r\ncolor, lighting, reflectivity and shading, and you expect there size \n  and=\r\n shape to be within scale compared to other objects. My point is your \n  se=\r\nnses have a range, which implies limitations. Since this is correct for you=\r\nr \n  senses it is also correct for your ability to understand perspectives =\r\nwith any \n  wide ranging diversity. You are able to see and process the inf=\r\normation of our \n  physical world just as any other human being does. That =\r\nis great for a human \n  but why would you think for a second,&lt;BR&gt;&gt; you c=\r\nould understand the \n  perspective&nbsp;of a mind and&nbsp; voice that spea=\r\nks through a radio from \n  some unknown location.&lt;BR&gt;&gt; &nbsp;&lt;BR&gt;&gt; Th=\r\ne information you receive from \n  the other side of your radios or even fro=\r\nm thin air through EVP&#39;s could be \n  completely correct and true no matter =\r\nwhat the context because you don&#39;t know \n  what perspective it is coming fr=\r\nom. You are making a lot of unfounded \n  assumptions about the (dare I say)=\r\n beings or worlds they exist in and have a \n  lot of expectations about the=\r\n information you receive. You are looking for \n  answers to the wrong quest=\r\nions! Quit assuming that these entities know you or \n  the people around yo=\r\nu. Quit assuming they are here for your entertainment as a \n  personal fort=\r\nune teller. Quit expecting them to know answers to question they \n  may hav=\r\ne themselves (just because they aren&#39;t physical doesn&#39;t mean they know \n  e=\r\nverything). Don&#39;t assume you will be speaking to a dead relative or someone=\r\n \n  you once knew. Go to a fortune teller if you want information about the=\r\n \n  furture. If you are serious about researching these voices and the equi=\r\npment \n  used to record them&lt;BR&gt;&gt; then ask the right questions. &lt;BR&gt;&gt;=\r\n \n  &nbsp;&lt;BR&gt;&gt; If you have a box made by Frank then ask Frank how the \n=\r\n  different circuits work, what is the puropose of some of the options, why=\r\n is \n  the RVG better or worse than a circuit without it? You have a unique=\r\n situation \n  here where the inventor of an important piece of equipment is=\r\n willing to share \n  the most minute details of how it works without a pric=\r\ne tag attached. Some of \n  the other box variations are sold by one person =\r\nbut created by someone else \n  and usually based on some loose design simil=\r\nar to Frank&#39;s. The other equipment \n  made by Bill Chapp and others will pr=\r\nobably stay a mystery because they are \n  sold for profit. Most people who =\r\nuse the different &quot;hacks&quot; know how to make \n  them but don&#39;t know much abou=\r\nt electronic theory or the behavior of radio \n  waves to understand how the=\r\ny work.&lt;BR&gt;&gt; &nbsp;&lt;BR&gt;&gt; Point is you have \n  plenty of questions to =\r\nask the human&#39;s who have built the equipment you are \n  using before you ca=\r\nn even begin to ask questions of the entities you are \n  communicating with=\r\n.&lt;BR&gt;&gt; &nbsp;&lt;BR&gt;&gt; Regards,&lt;BR&gt;&gt; &nbsp;&lt;BR&gt;&gt; \n  Frank R.&lt;BR&gt;&gt=\r\n;&lt;BR&gt;&lt;BR&gt;&lt;/P&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BODY&gt;&lt;/HTML&gt;\n\r\n------=_NextPart_000_0231_01CA216E.9DCA9920--"}