{"id": "15803", "subject": "Re: [EVP-ITC] Re: The nature of things!", "author": "Frank Ratka", "timestamp": "2009-08-20T14:25:03Z", "full_text": "--0-798058464-1250778303=:89783\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nYour very right Frank, there are those science types out there that think &quot;=\r\nIf its not measurable then its not tangible&quot;. There are many more out there=\r\n that are not! When I write of cognitive abilities I try to show the differ=\r\nence between perceiving physical things of this level of reality and the pe=\r\nrception of non-physical things. Most psychologists today do not see the mi=\r\nnd as a purely physical thing but more or less the brain as an instrument t=\r\no experience the world in which=A0we presently live. The mind and conscious=\r\nness is still very much a mystery. I have been an advocate of the &quot;paranorm=\r\nal&quot; for a very long time and I am studying to finish up my master in psycho=\r\nlogy. When I say psychologists aren&#39;t the hardcore, &quot;only believe in whats =\r\nphysical types&quot; it comes from a position of experience. There are whole fie=\r\nlds of psychology dedicated to how the mind interacts with the non-physical=\r\n (dreams, visions, psi-phenomena, etc). Perceived reality is reality\n Frank=\r\n!\n\nThe rules of these scientists depend on the scientist and how the resear=\r\nch is structured. Scienctific method is a very flexible thing and most psyc=\r\nhological research is based on statistical data. If people want to change h=\r\now this research is approached then people from our perspective need to get=\r\n involved! Correct?\n\nI&#39;m with you on your perception statements. I have exp=\r\nerienced altered states that involved astral sight, OBE&#39;s and other things.=\r\n I have had experiences where I would be writing with a pencil on a piece o=\r\nf paper only to &quot;snap out of it&quot; and realize it is really a mouse in my han=\r\nd and I never noticed the transition to the pencil in the first place. \n\nDo=\r\nn&#39;t feel like we are all still considered crack-pots, flakes or some other =\r\nbullshit label because we experience the things we do. We are no longer vie=\r\nwed like that, well at least not in the psychological field. Two of my frie=\r\nnds and people who helped me a lot with my early research are well-known an=\r\nd respected physicists and their histories include one heading up and runni=\r\nng the US governments remote viewing program that ended in the 90&#39;s and the=\r\n other was a senior researcher with PEAR at Princeton. They now research fa=\r\nster than light travel, warp drives, and wormholes for the US governement a=\r\nnd NASA though they have their own institute. Point is we have friends in a=\r\nll fields of science!\n\nRegards,\n\nFrank R.\n\n\n\n\n_____________________________=\r\n___\nFrom: purplespacefriend &lt;purplealiengirl@...&gt;\nTo: EVP-ITC@yahoogr=\r\noups.com\nSent: Thursday, August 20, 2009 8:55:55 AM\nSubject: [EVP-ITC] Re: =\r\nThe nature of things!\n\n=A0 \nI think the mind is not physical, and it&#39;s only=\r\n these paranoid scientist types that try to bully everyone into that extrem=\r\nemly narrow thinking that everything experienced is physical phenomenon onl=\r\ny, and must be made to fit into that context. \n\nJust because speech is all =\r\nperception does not make invalid--that even normal speech is highly subject=\r\nive. If you used the rules of these scienctists, you couldn&#39;t even trust wh=\r\nat the guy sitting next to you was saying. You couldn&#39;t trust what you were=\r\n hearing!\n\nPerception is everything. How is it that just before some mass d=\r\neath thing, like a plane crash or some disaster I see the shadows shift, it=\r\n should not be possible, but never the less, I&#39;ve seen it happen over and o=\r\nver. These scientific types brain wash everyone into not looking at clouds =\r\nas you might imagine you see something--well a day or two before tornados i=\r\nn other states I see circles in the clouds here-hundreds of miles away. Peo=\r\nple see me looking up and look at me like I&#39;m insane because of these bully=\r\n skeptics. You&#39;re not allowed to perceive anything unless they tell you it&#39;=\r\ns ok. You can&#39;t look at clouds, and you can&#39;t listen to voices fragments, c=\r\nuz they can&#39;t explain away the perceptions. These scientist types are too b=\r\nrain dead to realize they too create thier reality-all those supposed new p=\r\narticals did not exist before someone theorized about them, then they are c=\r\nreated and &quot;discovered&quot; . \n\nEven it was all imagination, that does not make=\r\n it invalid or useless. It&#39;s still serves as personal insight. \n\nfrank-S\n\n-=\r\n-- In EVP-ITC@yahoogroups .com, Frank Ratka &lt;warrior18eii@ ...&gt; wrote:\n&gt;\n&gt; =\r\nAssumptions and expectations! ? I hear a lot of both of these concepts in y=\r\nour words and when mentioning your research. Cognitive functioning or proce=\r\nssing sensory information in order to come to a conclusion or judgement is =\r\nhow we function in this world. In order for your mind to understand this ph=\r\nysical world you live in it automatically makes certain assumptions about s=\r\nensory information it takes in. Your eyes expect to see objects oriented co=\r\nrrectly, with the correct color, lighting, reflectivity and shading, and yo=\r\nu expect there size and shape to be within scale compared to other objects.=\r\n My point is your senses have a range, which implies limitations. Since thi=\r\ns is correct for your senses it is also correct for your ability to underst=\r\nand perspectives with any wide ranging diversity. You are able to see and p=\r\nrocess the information of our physical world just as any other human being =\r\ndoes. That is great for a human but why would you think for a\n second,\n&gt; yo=\r\nu could understand the perspective=A0of a mind and=A0 voice that speaks thr=\r\nough a radio from some unknown location.\n&gt; =A0\n&gt; The information you receiv=\r\ne from the other side of your radios or even from thin air through EVP&#39;s co=\r\nuld be completely correct and true no matter what the context because you d=\r\non&#39;t know what perspective it is coming from. You are making a lot of unfou=\r\nnded assumptions about the (dare I say) beings or worlds they exist in and =\r\nhave a lot of expectations about the information you receive. You are looki=\r\nng for answers to the wrong questions! Quit assuming that these entities kn=\r\now you or the people around you. Quit assuming they are here for your enter=\r\ntainment as a personal fortune teller. Quit expecting them to know answers =\r\nto question they may have themselves (just because they aren&#39;t physical doe=\r\nsn&#39;t mean they know everything). Don&#39;t assume you will be speaking to a dea=\r\nd relative or someone you once knew. Go to a fortune teller if you want inf=\r\normation about the furture. If you are serious about researching these voic=\r\nes and the equipment used to record them\n&gt; then ask the right questions. \n&gt;=\r\n =A0\n&gt; If you have a box made by Frank then ask Frank how the different cir=\r\ncuits work, what is the puropose of some of the options, why is the RVG bet=\r\nter or worse than a circuit without it? You have a unique situation here wh=\r\nere the inventor of an important piece of equipment is willing to share the=\r\n most minute details of how it works without a price tag attached. Some of =\r\nthe other box variations are sold by one person but created by someone else=\r\n and usually based on some loose design similar to Frank&#39;s. The other equip=\r\nment made by Bill Chapp and others will probably stay a mystery because the=\r\ny are sold for profit. Most people who use the different &quot;hacks&quot; know how t=\r\no make them but don&#39;t know much about electronic theory or the behavior of =\r\nradio waves to understand how they work.\n&gt; =A0\n&gt; Point is you have plenty o=\r\nf questions to ask the human&#39;s who have built the equipment you are using b=\r\nefore you can even begin to ask questions of the entities you are communica=\r\nting with.\n&gt; =A0\n&gt; Regards,\n&gt; =A0\n&gt; Frank R.\n&gt;\n\n\n\n\n\n      \r\n--0-798058464-1250778303=:89783\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;&lt;head&gt;&lt;style type=3D&quot;text/css&quot;&gt;&lt;!-- DIV {margin:0px;} --&gt;&lt;/style&gt;&lt;/he=\r\nad&gt;&lt;body&gt;&lt;div style=3D&quot;font-family:times new roman, new york, times, serif;=\r\nfont-size:12pt&quot;&gt;&lt;DIV&gt;Your very right Frank, there are those science types o=\r\nut there that think &quot;If its not measurable then its not tangible&quot;. There ar=\r\ne many more out there that are not! When I write of cognitive abilities I t=\r\nry to show the difference between perceiving physical things of this level =\r\nof reality and the perception of non-physical things. Most psychologists to=\r\nday do not see the mind as a purely physical thing but more or less the bra=\r\nin as an instrument to experience the world in which&nbsp;we presently live=\r\n. The mind and consciousness is still very much a mystery. I have been an a=\r\ndvocate of the &quot;paranormal&quot; for a very long time and I am studying to finis=\r\nh up my master in psychology. When I say psychologists aren&#39;t the hardcore,=\r\n &quot;only believe in whats physical types&quot; it comes from a position of\n experi=\r\nence. There are whole fields of psychology dedicated to how the mind intera=\r\ncts with the non-physical (dreams, visions, psi-phenomena, etc). Perceived =\r\nreality is reality Frank!&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;The rules of these s=\r\ncientists depend on the scientist and how the research is structured. Scien=\r\nctific method is a very flexible thing and most psychological research is b=\r\nased on statistical data. If people want to change how this research is app=\r\nroached then people from our perspective need to get involved! Correct?&lt;/DI=\r\nV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I&#39;m with you on your perception statements. I hav=\r\ne experienced altered states that involved astral sight, OBE&#39;s and other th=\r\nings. I have had experiences where I would be writing with a pencil on a pi=\r\nece of paper only to &quot;snap out of it&quot; and realize it is really a mouse in m=\r\ny hand and I never noticed the transition to the pencil in the first place.=\r\n &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Don&#39;t feel like we are all still considered =\r\ncrack-pots, flakes or some other bullshit label because we experience the t=\r\nhings we do. We are no longer viewed like that, well at least not in the ps=\r\nychological field. Two of my friends and people who helped me a lot with my=\r\n early research are well-known and respected physicists and their histories=\r\n include one heading up and running the US governments remote viewing progr=\r\nam that ended in the 90&#39;s and the other was a senior researcher with PEAR a=\r\nt Princeton. They now research faster than light travel, warp drives, and w=\r\normholes for the US governement and NASA though they have their own institu=\r\nte. Point is we have friends in all fields of science!&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/D=\r\nIV&gt;\n&lt;DIV&gt;Regards,&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Frank R.&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV styl=\r\ne=3D&quot;FONT-FAMILY: times new roman, new york, times, serif; FONT-SIZE: 12pt&quot;=\r\n&gt;&lt;BR&gt;\n&lt;DIV style=3D&quot;BORDER-LEFT: #1010ff 2px solid; MARGIN: 5px 0px 5px 5px=\r\n; PADDING-LEFT: 5px; FONT-FAMILY: times new roman, new york, times, serif; =\r\nFONT-SIZE: 12pt&quot;&gt;&lt;FONT size=3D2 face=3DTahoma&gt;\n&lt;HR SIZE=3D1&gt;\n&lt;B&gt;&lt;SPAN style=\r\n=3D&quot;FONT-WEIGHT: bold&quot;&gt;From:&lt;/SPAN&gt;&lt;/B&gt; purplespacefriend &lt;purplealiengi=\r\nrl@...&gt;&lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: bold&quot;&gt;To:&lt;/SPAN&gt;&lt;/B&gt; EVP=\r\n-ITC@yahoogroups.com&lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: bold&quot;&gt;Sent:&lt;/SPAN&gt;&lt;/=\r\nB&gt; Thursday, August 20, 2009 8:55:55 AM&lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: b=\r\nold&quot;&gt;Subject:&lt;/SPAN&gt;&lt;/B&gt; [EVP-ITC] Re: The nature of things!&lt;BR&gt;&lt;/FONT&gt;&lt;BR&gt;=\r\n&lt;SPAN style=3D&quot;DISPLAY: none&quot;&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV id=3Dygrp-text&gt;\n&lt;P&gt;I thin=\r\nk the mind is not physical, and it&#39;s only these paranoid scientist types th=\r\nat try to bully everyone into that extrememly narrow thinking that everythi=\r\nng experienced is physical phenomenon only, and must be made to fit into th=\r\nat context. &lt;BR&gt;&lt;BR&gt;Just because speech is all perception does not make inv=\r\nalid--that even normal speech is highly subjective. If you used the rules o=\r\nf these scienctists, you couldn&#39;t even trust what the guy sitting next to y=\r\nou was saying. You couldn&#39;t trust what you were hearing!&lt;BR&gt;&lt;BR&gt;Perception =\r\nis everything. How is it that just before some mass death thing, like a pla=\r\nne crash or some disaster I see the shadows shift, it should not be possibl=\r\ne, but never the less, I&#39;ve seen it happen over and over. These scientific =\r\ntypes brain wash everyone into not looking at clouds as you might imagine y=\r\nou see something--well a day or two before tornados in other states I see c=\r\nircles in the clouds here-hundreds of miles away. People\n see me looking up=\r\n and look at me like I&#39;m insane because of these bully skeptics. You&#39;re not=\r\n allowed to perceive anything unless they tell you it&#39;s ok. You can&#39;t look =\r\nat clouds, and you can&#39;t listen to voices fragments, cuz they can&#39;t explain=\r\n away the perceptions. These scientist types are too brain dead to realize =\r\nthey too create thier reality-all those supposed new particals did not exis=\r\nt before someone theorized about them, then they are created and &quot;discovere=\r\nd&quot; . &lt;BR&gt;&lt;BR&gt;Even it was all imagination, that does not make it invalid or =\r\nuseless. It&#39;s still serves as personal insight. &lt;BR&gt;&lt;BR&gt;frank-S&lt;BR&gt;&lt;BR&gt;--- =\r\nIn &lt;A href=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot; rel=3Dnofollow target=3D_bl=\r\nank ymailto=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups .com&lt;/=\r\nA&gt;, Frank Ratka &lt;warrior18eii@ ...&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; Assumption=\r\ns and expectations! ? I hear a lot of both of these concepts in your words =\r\nand when mentioning your research. Cognitive functioning\n or processing sen=\r\nsory information in order to come to a conclusion or judgement is how we fu=\r\nnction in this world. In order for your mind to understand this physical wo=\r\nrld you live in it automatically makes certain assumptions about sensory in=\r\nformation it takes in. Your eyes expect to see objects oriented correctly, =\r\nwith the correct color, lighting, reflectivity and shading, and you expect =\r\nthere size and shape to be within scale compared to other objects. My point=\r\n is your senses have a range, which implies limitations. Since this is corr=\r\nect for your senses it is also correct for your ability to understand persp=\r\nectives with any wide ranging diversity. You are able to see and process th=\r\ne information of our physical world just as any other human being does. Tha=\r\nt is great for a human but why would you think for a second,&lt;BR&gt;&gt; you co=\r\nuld understand the perspective&nbsp;of a mind and&nbsp; voice that speaks t=\r\nhrough a radio from some unknown location.&lt;BR&gt;&gt;\n &nbsp;&lt;BR&gt;&gt; The info=\r\nrmation you receive from the other side of your radios or even from thin ai=\r\nr through EVP&#39;s could be completely correct and true no matter what the con=\r\ntext because you don&#39;t know what perspective it is coming from. You are mak=\r\ning a lot of unfounded assumptions about the (dare I say) beings or worlds =\r\nthey exist in and have a lot of expectations about the information you rece=\r\nive. You are looking for answers to the wrong questions! Quit assuming that=\r\n these entities know you or the people around you. Quit assuming they are h=\r\nere for your entertainment as a personal fortune teller. Quit expecting the=\r\nm to know answers to question they may have themselves (just because they a=\r\nren&#39;t physical doesn&#39;t mean they know everything). Don&#39;t assume you will be=\r\n speaking to a dead relative or someone you once knew. Go to a fortune tell=\r\ner if you want information about the furture. If you are serious about rese=\r\narching these voices and the equipment used\n to record them&lt;BR&gt;&gt; then as=\r\nk the right questions. &lt;BR&gt;&gt; &nbsp;&lt;BR&gt;&gt; If you have a box made by Fr=\r\nank then ask Frank how the different circuits work, what is the puropose of=\r\n some of the options, why is the RVG better or worse than a circuit without=\r\n it? You have a unique situation here where the inventor of an important pi=\r\nece of equipment is willing to share the most minute details of how it work=\r\ns without a price tag attached. Some of the other box variations are sold b=\r\ny one person but created by someone else and usually based on some loose de=\r\nsign similar to Frank&#39;s. The other equipment made by Bill Chapp and others =\r\nwill probably stay a mystery because they are sold for profit. Most people =\r\nwho use the different &quot;hacks&quot; know how to make them but don&#39;t know much abo=\r\nut electronic theory or the behavior of radio waves to understand how they =\r\nwork.&lt;BR&gt;&gt; &nbsp;&lt;BR&gt;&gt; Point is you have plenty of questions to ask t=\r\nhe human&#39;s who have built the\n equipment you are using before you can even =\r\nbegin to ask questions of the entities you are communicating with.&lt;BR&gt;&gt; =\r\n&nbsp;&lt;BR&gt;&gt; Regards,&lt;BR&gt;&gt; &nbsp;&lt;BR&gt;&gt; Frank R.&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/P&gt;=\r\n&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/div&gt;&lt;br&gt;\n\n      &lt;/body&gt;&lt;/html&gt;\r\n--0-798058464-1250778303=:89783--"}