{"id": "15813", "subject": "Re: I wish I never...", "author": "mrscaptainjack2", "timestamp": "2009-08-20T19:23:20Z", "full_text": "What is it the kids say now?  ROFLMAO?  You make me laugh, Frank!!!!\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  Takes like four -five days for this PMS shit to pass. Then I realize I&#39;ve been being a real bitch. Misty&#39;s been around long enough to have seen this many times. \n&gt; \n&gt;  If anyone has seem MIB the first  movie, it&#39;s like the little guy in the dudes head, we are all something else like that. My inner guy just happens to be female!\n&gt; \n&gt;  F-S\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, eamonn mgherbi &lt;eamonnmgherbi@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Frank dont let it get to you, You have balls to create technology which answers are curisosity, all because people dont get told the stuff they want to hear they cant hold you responsible. i think the boxes are great technology, not many people have the &quot;can do&quot; to go and investigate andbuild something that captures the unexplained. keep up the good work and ignore negativity! Im sure you have the backing of people who frequently post on here. I think their has been a massive overeaction in the recent posts and I hope we can move on from it. dont be discourages...you have the majority backing, seems like EVP frustrates people. I took your advice over the emails we exchanged and just take this as a scientific experiment...not a source of faith or answers. they are just personalities like us. im still shocked we get voices!!!!\n&gt; &gt; \n&gt; &gt; keep up the good work!\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; ________________________________\n&gt; &gt; From: Frank Sumption &lt;purplealiengirl@&gt;\n&gt; &gt; To: evp-itc@yahoogroups.com\n&gt; &gt; Sent: Wednesday, 19 August, 2009 14:26:10\n&gt; &gt; Subject: [EVP-ITC] I wish I never...\n&gt; &gt; \n&gt; &gt;  \n&gt; &gt; Even after it being shown that asking questions creates crap voices, I haven&#39;t heard form anyone that will give that mode up,no peopel are so friggin&#39; stuck on their egos and control that they don&#39;t care what&#39;s coming through as long it&#39;s telling them how great they are! I give up!\n&gt; &gt; \n&gt; &gt; At this point I regret creating this technological abortion! Big mistake!\n&gt; &gt; \n&gt; &gt; Frank-S\n&gt; &gt;\n&gt;"}