{"id": "15824", "subject": "Re: [EVP-ITC] Re: The nature of things!", "author": "April Abercrombie", "timestamp": "2009-08-20T21:48:10Z", "full_text": "------=_NextPart_000_02F7_01CA21AD.9E9F4FA0\r\nContent-Type: text/plain;\n\tcharset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nOh-to answer your first question-Solid proof for me would be an intelligent=\r\n, back and forth conversation. It would also have to be VERY clear and many=\r\n people would have to say they hear the same thing.\n\n  ----- Original Messa=\r\nge ----- \n  From: purplespacefriend \n  To: EVP-ITC@yahoogroups.com \n  Sent:=\r\n Thursday, August 20, 2009 3:35 PM\n  Subject: [EVP-ITC] Re: The nature of t=\r\nhings!\n\n\n    So what constitutes proof? All I know for certain is that some=\r\nthing talks by using the bits of audio from radio stations as the tunign is=\r\n swept. However, it can not be proven what it is that&#39;s talking, so I guess=\r\n that makes the whole thing invalid of little use. \n\n  Frank-S\n\n  --- In EV=\r\nP-ITC@yahoogroups.com, &quot;April Abercrombie&quot; &lt;april@...&gt; wrote:\n  &gt;\n  &gt; &quot;Just=\r\n because speech is all perception does not make invalid--that even normal s=\r\npeech is highly subjective. If you used the rules of these scienctists, you=\r\n couldn&#39;t even trust what the guy sitting next to you was saying. You could=\r\nn&#39;t trust what you were hearing!&quot;\n  &gt; \n  &gt; You&#39;re right....and I don&#39;t LOL!=\r\n All I hope to be able to do is find proof of actual spirit communication. =\r\nI don&#39;t care so much about what is being communicated, only that it is.\n  &gt;=\r\n \n  &gt; ----------------------------------------------------------\n  &gt; \n  &gt; \n=\r\n  &gt; &quot;Even it was all imagination, that does not make it invalid or useless.=\r\n It&#39;s still serves as personal insight. &quot;\n  &gt; \n  &gt; I absolutely agree.\n  &gt; =\r\n\n  &gt; ----- Original Message ----- \n  &gt; From: purplespacefriend \n  &gt; To: EVP=\r\n-ITC@yahoogroups.com \n  &gt; Sent: Thursday, August 20, 2009 7:55 AM\n  &gt; Subje=\r\nct: [EVP-ITC] Re: The nature of things!\n  &gt; \n  &gt; \n  &gt; I think the mind is n=\r\not physical, and it&#39;s only these paranoid scientist types that try to bully=\r\n everyone into that extrememly narrow thinking that everything experienced =\r\nis physical phenomenon only, and must be made to fit into that context. \n  =\r\n&gt; \n  &gt; Just because speech is all perception does not make invalid--that ev=\r\nen normal speech is highly subjective. If you used the rules of these scien=\r\nctists, you couldn&#39;t even trust what the guy sitting next to you was saying=\r\n. You couldn&#39;t trust what you were hearing!\n  &gt; \n  &gt; Perception is everythi=\r\nng. How is it that just before some mass death thing, like a plane crash or=\r\n some disaster I see the shadows shift, it should not be possible, but neve=\r\nr the less, I&#39;ve seen it happen over and over. These scientific types brain=\r\n wash everyone into not looking at clouds as you might imagine you see some=\r\nthing--well a day or two before tornados in other states I see circles in t=\r\nhe clouds here-hundreds of miles away. People see me looking up and look at=\r\n me like I&#39;m insane because of these bully skeptics. You&#39;re not allowed to =\r\nperceive anything unless they tell you it&#39;s ok. You can&#39;t look at clouds, a=\r\nnd you can&#39;t listen to voices fragments, cuz they can&#39;t explain away the pe=\r\nrceptions. These scientist types are too brain dead to realize they too cre=\r\nate thier reality-all those supposed new particals did not exist before som=\r\neone theorized about them, then they are created and &quot;discovered&quot;. \n  &gt; \n  =\r\n&gt; Even it was all imagination, that does not make it invalid or useless. It=\r\n&#39;s still serves as personal insight. \n  &gt; \n  &gt; frank-S\n  &gt; \n  &gt; --- In EVP-=\r\nITC@yahoogroups.com, Frank Ratka &lt;warrior18eii@&gt; wrote:\n  &gt; &gt;\n  &gt; &gt; Assumpt=\r\nions and expectations!? I hear a lot of both of these concepts in your word=\r\ns and when mentioning your research. Cognitive functioning or processing se=\r\nnsory information in order to come to a conclusion or judgement is how we f=\r\nunction in this world. In order for your mind to understand this physical w=\r\norld you live in it automatically makes certain assumptions about sensory i=\r\nnformation it takes in. Your eyes expect to see objects oriented correctly,=\r\n with the correct color, lighting, reflectivity and shading, and you expect=\r\n there size and shape to be within scale compared to other objects. My poin=\r\nt is your senses have a range, which implies limitations. Since this is cor=\r\nrect for your senses it is also correct for your ability to understand pers=\r\npectives with any wide ranging diversity. You are able to see and process t=\r\nhe information of our physical world just as any other human being does. Th=\r\nat is great for a human but why would you think for a second,\n  &gt; &gt; you cou=\r\nld understand the perspective of a mind and voice that speaks through a rad=\r\nio from some unknown location.\n  &gt; &gt; \n  &gt; &gt; The information you receive fro=\r\nm the other side of your radios or even from thin air through EVP&#39;s could b=\r\ne completely correct and true no matter what the context because you don&#39;t =\r\nknow what perspective it is coming from. You are making a lot of unfounded =\r\nassumptions about the (dare I say) beings or worlds they exist in and have =\r\na lot of expectations about the information you receive. You are looking fo=\r\nr answers to the wrong questions! Quit assuming that these entities know yo=\r\nu or the people around you. Quit assuming they are here for your entertainm=\r\nent as a personal fortune teller. Quit expecting them to know answers to qu=\r\nestion they may have themselves (just because they aren&#39;t physical doesn&#39;t =\r\nmean they know everything). Don&#39;t assume you will be speaking to a dead rel=\r\native or someone you once knew. Go to a fortune teller if you want informat=\r\nion about the furture. If you are serious about researching these voices an=\r\nd the equipment used to record them\n  &gt; &gt; then ask the right questions. \n  =\r\n&gt; &gt; \n  &gt; &gt; If you have a box made by Frank then ask Frank how the different=\r\n circuits work, what is the puropose of some of the options, why is the RVG=\r\n better or worse than a circuit without it? You have a unique situation her=\r\ne where the inventor of an important piece of equipment is willing to share=\r\n the most minute details of how it works without a price tag attached. Some=\r\n of the other box variations are sold by one person but created by someone =\r\nelse and usually based on some loose design similar to Frank&#39;s. The other e=\r\nquipment made by Bill Chapp and others will probably stay a mystery because=\r\n they are sold for profit. Most people who use the different &quot;hacks&quot; know h=\r\now to make them but don&#39;t know much about electronic theory or the behavior=\r\n of radio waves to understand how they work.\n  &gt; &gt; \n  &gt; &gt; Point is you have=\r\n plenty of questions to ask the human&#39;s who have built the equipment you ar=\r\ne using before you can even begin to ask questions of the entities you are =\r\ncommunicating with.\n  &gt; &gt; \n  &gt; &gt; Regards,\n  &gt; &gt; \n  &gt; &gt; Frank R.\n  &gt; &gt;\n  &gt;\n\n=\r\n\n\n  \r\n------=_NextPart_000_02F7_01CA21AD.9E9F4FA0\r\nContent-Type: text/html;\n\tcharset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML 4.0 Transitional//EN&quot;&gt;\n&lt;HTML&gt;&lt;HEAD&gt;=\r\n\n&lt;META content=3D&quot;text/html; charset=3Diso-8859-1&quot; http-equiv=3DContent-Typ=\r\ne&gt;\n&lt;META name=3DGENERATOR content=3D&quot;MSHTML 8.00.6001.18812&quot;&gt;&lt;/HEAD&gt;\n&lt;BODY =\r\nstyle=3D&quot;BACKGROUND-COLOR: #ffffff&quot; bgColor=3D#ffffff&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 =\r\nface=3D&quot;Myriad Pro&quot;&gt;Oh-to answer your first question-Solid proof \nfor me wo=\r\nuld be an intelligent, back and forth conversation. It would also have \nto =\r\nbe VERY clear and many people would have to say they hear the same \nthing.&lt;=\r\n/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 face=3D&quot;Myriad Pro&quot;&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;B=\r\nLOCKQUOTE \nstyle=3D&quot;BORDER-LEFT: #000000 2px solid; PADDING-LEFT: 5px; PADD=\r\nING-RIGHT: 0px; MARGIN-LEFT: 5px; MARGIN-RIGHT: 0px&quot; \ndir=3Dltr&gt;\n  &lt;DIV sty=\r\nle=3D&quot;FONT: 10pt arial&quot;&gt;----- Original Message ----- &lt;/DIV&gt;\n  &lt;DIV \n  style=\r\n=3D&quot;FONT: 10pt arial; BACKGROUND: #e4e4e4; font-color: black&quot;&gt;&lt;B&gt;From:&lt;/B&gt; =\r\n\n  &lt;A title=3Dpurplealiengirl@... \n  href=3D&quot;mailto:purplealiengirl@g=\r\nmail.com&quot;&gt;purplespacefriend&lt;/A&gt; &lt;/DIV&gt;\n  &lt;DIV style=3D&quot;FONT: 10pt arial&quot;&gt;&lt;B=\r\n&gt;To:&lt;/B&gt; &lt;A title=3DEVP-ITC@yahoogroups.com \n  href=3D&quot;mailto:EVP-ITC@yahoo=\r\ngroups.com&quot;&gt;EVP-ITC@yahoogroups.com&lt;/A&gt; &lt;/DIV&gt;\n  &lt;DIV style=3D&quot;FONT: 10pt a=\r\nrial&quot;&gt;&lt;B&gt;Sent:&lt;/B&gt; Thursday, August 20, 2009 3:35 \n  PM&lt;/DIV&gt;\n  &lt;DIV style=\r\n=3D&quot;FONT: 10pt arial&quot;&gt;&lt;B&gt;Subject:&lt;/B&gt; [EVP-ITC] Re: The nature of \n  things=\r\n!&lt;/DIV&gt;\n  &lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;SPAN style=3D&quot;DISPLAY: none&quot;&gt;&nbsp;&lt;/SPAN&gt; \n  &lt;DI=\r\nV id=3Dygrp-text&gt;\n  &lt;P&gt;So what constitutes proof? All I know for certain is=\r\n that something talks \n  by using the bits of audio from radio stations as =\r\nthe tunign is swept. \n  However, it can not be proven what it is that&#39;s tal=\r\nking, so I guess that makes \n  the whole thing invalid of little use. &lt;BR&gt;&lt;=\r\nBR&gt;Frank-S&lt;BR&gt;&lt;BR&gt;--- In &lt;A \n  href=3D&quot;mailto:EVP-ITC@yahoogroups.com&quot;&gt;EVP-=\r\nITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;, &quot;April \n  Abercrombie&quot; &lt;april@...&gt; wrot=\r\ne:&lt;BR&gt;&gt;&lt;BR&gt;&gt; &quot;Just because speech is \n  all perception does not make =\r\ninvalid--that even normal speech is highly \n  subjective. If you used the r=\r\nules of these scienctists, you couldn&#39;t even \n  trust what the guy sitting =\r\nnext to you was saying. You couldn&#39;t trust what you \n  were hearing!&quot;&lt;BR&gt;&g=\r\nt; &lt;BR&gt;&gt; You&#39;re right....and I don&#39;t LOL! All I hope to \n  be able to do=\r\n is find proof of actual spirit communication. I don&#39;t care so \n  much abou=\r\nt what is being communicated, only that it is.&lt;BR&gt;&gt; &lt;BR&gt;&gt; \n  --------=\r\n----&lt;WBR&gt;---------&lt;WBR&gt;---------&lt;WBR&gt;---------&lt;WBR&gt;---------&lt;WBR&gt;---------&lt;=\r\nWBR&gt;-&lt;BR&gt;&gt; \n  &lt;BR&gt;&gt; &lt;BR&gt;&gt; &quot;Even it was all imagination, that does =\r\nnot make it invalid \n  or useless. It&#39;s still serves as personal insight. &quot;=\r\n&lt;BR&gt;&gt; &lt;BR&gt;&gt; I \n  absolutely agree.&lt;BR&gt;&gt; &lt;BR&gt;&gt; ----- Original Me=\r\nssage ----- &lt;BR&gt;&gt; From: \n  purplespacefriend &lt;BR&gt;&gt; To: &lt;A \n  href=3D&quot;=\r\nmailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt; \n  &lt;BR&gt;&=\r\ngt; Sent: Thursday, August 20, 2009 7:55 AM&lt;BR&gt;&gt; Subject: [EVP-ITC] \n  R=\r\ne: The nature of things!&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; I think the mind is not =\r\n\n  physical, and it&#39;s only these paranoid scientist types that try to bully=\r\n \n  everyone into that extrememly narrow thinking that everything experienc=\r\ned is \n  physical phenomenon only, and must be made to fit into that contex=\r\nt. &lt;BR&gt;&gt; \n  &lt;BR&gt;&gt; Just because speech is all perception does not make=\r\n invalid--that \n  even normal speech is highly subjective. If you used the =\r\nrules of these \n  scienctists, you couldn&#39;t even trust what the guy sitting=\r\n next to you was \n  saying. You couldn&#39;t trust what you were hearing!&lt;BR&gt;&g=\r\nt; &lt;BR&gt;&gt; Perception \n  is everything. How is it that just before some ma=\r\nss death thing, like a plane \n  crash or some disaster I see the shadows sh=\r\nift, it should not be possible, but \n  never the less, I&#39;ve seen it happen =\r\nover and over. These scientific types \n  brain wash everyone into not looki=\r\nng at clouds as you might imagine you see \n  something--well a day or two b=\r\nefore tornados in other states I see circles in \n  the clouds here-hundreds=\r\n of miles away. People see me looking up and look at \n  me like I&#39;m insane =\r\nbecause of these bully skeptics. You&#39;re not allowed to \n  perceive anything=\r\n unless they tell you it&#39;s ok. You can&#39;t look at clouds, and \n  you can&#39;t l=\r\nisten to voices fragments, cuz they can&#39;t explain away the \n  perceptions. =\r\nThese scientist types are too brain dead to realize they too \n  create thie=\r\nr reality-all those supposed new particals did not exist before \n  someone =\r\ntheorized about them, then they are created and &quot;discovered&quot;&lt;WBR&gt;. \n  &lt;BR&gt;&=\r\ngt; &lt;BR&gt;&gt; Even it was all imagination, that does not make it invalid \n  =\r\nor useless. It&#39;s still serves as personal insight. &lt;BR&gt;&gt; &lt;BR&gt;&gt; \n  fra=\r\nnk-S&lt;BR&gt;&gt; &lt;BR&gt;&gt; --- In &lt;A \n  href=3D&quot;mailto:EVP-ITC%40yahoogroups.com=\r\n&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;, \n  Frank Ratka &lt;warrior18eii@&lt;WBR&gt;&g=\r\nt; wrote:&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt; \n  Assumptions and expectations!&lt;WBR&gt;? =\r\nI hear a lot of both of these concepts in \n  your words and when mentioning=\r\n your research. Cognitive functioning or \n  processing sensory information =\r\nin order to come to a conclusion or judgement \n  is how we function in this=\r\n world. In order for your mind to understand this \n  physical world you liv=\r\ne in it automatically makes certain assumptions about \n  sensory informatio=\r\nn it takes in. Your eyes expect to see objects oriented \n  correctly, with =\r\nthe correct color, lighting, reflectivity and shading, and you \n  expect th=\r\nere size and shape to be within scale compared to other objects. My \n  poin=\r\nt is your senses have a range, which implies limitations. Since this is \n  =\r\ncorrect for your senses it is also correct for your ability to understand \n=\r\n  perspectives with any wide ranging diversity. You are able to see and pro=\r\ncess \n  the information of our physical world just as any other human being=\r\n does. That \n  is great for a human but why would you think for a second,&lt;B=\r\nR&gt;&gt; &gt; you \n  could understand the perspective of a mind and voice tha=\r\nt speaks through a \n  radio from some unknown location.&lt;BR&gt;&gt; &gt; &lt;BR&gt;&g=\r\nt; &gt; The information \n  you receive from the other side of your radios o=\r\nr even from thin air through \n  EVP&#39;s could be completely correct and true =\r\nno matter what the context because \n  you don&#39;t know what perspective it is=\r\n coming from. You are making a lot of \n  unfounded assumptions about the (d=\r\nare I say) beings or worlds they exist in \n  and have a lot of expectations=\r\n about the information you receive. You are \n  looking for answers to the w=\r\nrong questions! Quit assuming that these entities \n  know you or the people=\r\n around you. Quit assuming they are here for your \n  entertainment as a per=\r\nsonal fortune teller. Quit expecting them to know \n  answers to question th=\r\ney may have themselves (just because they aren&#39;t \n  physical doesn&#39;t mean t=\r\nhey know everything). Don&#39;t assume you will be speaking \n  to a dead relati=\r\nve or someone you once knew. Go to a fortune teller if you \n  want informat=\r\nion about the furture. If you are serious about researching these \n  voices=\r\n and the equipment used to record them&lt;BR&gt;&gt; &gt; then ask the right \n  q=\r\nuestions. &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; If you have a box made by Frank then =\r\n\n  ask Frank how the different circuits work, what is the puropose of some =\r\nof the \n  options, why is the RVG better or worse than a circuit without it=\r\n? You have a \n  unique situation here where the inventor of an important pi=\r\nece of equipment is \n  willing to share the most minute details of how it w=\r\norks without a price tag \n  attached. Some of the other box variations are =\r\nsold by one person but created \n  by someone else and usually based on some=\r\n loose design similar to Frank&#39;s. The \n  other equipment made by Bill Chapp=\r\n and others will probably stay a mystery \n  because they are sold for profi=\r\nt. Most people who use the different &quot;hacks&quot; \n  know how to make them but d=\r\non&#39;t know much about electronic theory or the \n  behavior of radio waves to=\r\n understand how they work.&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; \n  &gt; Point is you have =\r\nplenty of questions to ask the human&#39;s who have built \n  the equipment you =\r\nare using before you can even begin to ask questions of the \n  entities you=\r\n are communicating with.&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; \n  Regards,&lt;BR&gt;&gt; &gt=\r\n; &lt;BR&gt;&gt; &gt; Frank R.&lt;BR&gt;&gt; \n  &gt;&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/P&gt;&lt;/DIV&gt;&lt;!--End g=\r\nroup email --&gt;&lt;/BODY&gt;&lt;/HTML&gt;\n\r\n------=_NextPart_000_02F7_01CA21AD.9E9F4FA0--"}