{"id": "15829", "subject": "Re: The nature of things!", "author": "bulletbabea", "timestamp": "2009-08-20T23:03:06Z", "full_text": "April you might be interested in researching some others who are/were involved in EVP-ITC communication. Marcello Bacci, Hans Otto Koenig, George Meek, Ernst Senkowski, Adolph Holmes, Sonia Rinaldi, just to name a few. Researchers across the world explore this in great detail.\n\nMany experiments are done with that idea in mind such as the spiricom experiemnts past and present, direct voice communications, Frank&#39;s box, and various other methods.\n\nFrank R just pointed out a great video that was posted interviewing Dr. Ernst Senkowski in which he gives an interesting viewpoint and some what he says mirrors my own point of view as well as info being given via EVP on many topics. He also speaks about some of the various researchers he knew.\n\nhttp://vimeo.com/5637666\n\nThere is so much going on in the world that most people in the USA have very little knowledge of simply because they do not speak the language that the info is being presented in. There are some videos of other researchers on the web as well and if you can get past the language differences you may find some of their work to be very fascinating.\n\nMisty\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;April Abercrombie&quot; &lt;april@...&gt; wrote:\n&gt;\n&gt; Oh-to answer your first question-Solid proof for me would be an intelligent, back and forth conversation. It would also have to be VERY clear and many people would have to say they hear the same thing.\n&gt; \n&gt;   ----- Original Message ----- \n&gt;   From: purplespacefriend \n&gt;   To: EVP-ITC@yahoogroups.com \n&gt;   Sent: Thursday, August 20, 2009 3:35 PM\n&gt;   Subject: [EVP-ITC] Re: The nature of things!\n&gt; \n&gt; \n&gt;     So what constitutes proof? All I know for certain is that something talks by using the bits of audio from radio stations as the tunign is swept. However, it can not be proven what it is that&#39;s talking, so I guess that makes the whole thing invalid of little use. \n&gt; \n&gt;   Frank-S\n&gt; \n&gt;   --- In EVP-ITC@yahoogroups.com, &quot;April Abercrombie&quot; &lt;april@&gt; wrote:\n&gt;   &gt;\n&gt;   &gt; &quot;Just because speech is all perception does not make invalid--that even normal speech is highly subjective. If you used the rules of these scienctists, you couldn&#39;t even trust what the guy sitting next to you was saying. You couldn&#39;t trust what you were hearing!&quot;\n&gt;   &gt; \n&gt;   &gt; You&#39;re right....and I don&#39;t LOL! All I hope to be able to do is find proof of actual spirit communication. I don&#39;t care so much about what is being communicated, only that it is.\n&gt;   &gt; \n&gt;   &gt; ----------------------------------------------------------\n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; &quot;Even it was all imagination, that does not make it invalid or useless. It&#39;s still serves as personal insight. &quot;\n&gt;   &gt; \n&gt;   &gt; I absolutely agree.\n&gt;   &gt; \n&gt;   &gt; ----- Original Message ----- \n&gt;   &gt; From: purplespacefriend \n&gt;   &gt; To: EVP-ITC@...m \n&gt;   &gt; Sent: Thursday, August 20, 2009 7:55 AM\n&gt;   &gt; Subject: [EVP-ITC] Re: The nature of things!\n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; I think the mind is not physical, and it&#39;s only these paranoid scientist types that try to bully everyone into that extrememly narrow thinking that everything experienced is physical phenomenon only, and must be made to fit into that context. \n&gt;   &gt; \n&gt;   &gt; Just because speech is all perception does not make invalid--that even normal speech is highly subjective. If you used the rules of these scienctists, you couldn&#39;t even trust what the guy sitting next to you was saying. You couldn&#39;t trust what you were hearing!\n&gt;   &gt; \n&gt;   &gt; Perception is everything. How is it that just before some mass death thing, like a plane crash or some disaster I see the shadows shift, it should not be possible, but never the less, I&#39;ve seen it happen over and over. These scientific types brain wash everyone into not looking at clouds as you might imagine you see something--well a day or two before tornados in other states I see circles in the clouds here-hundreds of miles away. People see me looking up and look at me like I&#39;m insane because of these bully skeptics. You&#39;re not allowed to perceive anything unless they tell you it&#39;s ok. You can&#39;t look at clouds, and you can&#39;t listen to voices fragments, cuz they can&#39;t explain away the perceptions. These scientist types are too brain dead to realize they too create thier reality-all those supposed new particals did not exist before someone theorized about them, then they are created and &quot;discovered&quot;. \n&gt;   &gt; \n&gt;   &gt; Even it was all imagination, that does not make it invalid or useless. It&#39;s still serves as personal insight. \n&gt;   &gt; \n&gt;   &gt; frank-S\n&gt;   &gt; \n&gt;   &gt; --- In EVP-ITC@yahoogroups.com, Frank Ratka &lt;warrior18eii@&gt; wrote:\n&gt;   &gt; &gt;\n&gt;   &gt; &gt; Assumptions and expectations!? I hear a lot of both of these concepts in your words and when mentioning your research. Cognitive functioning or processing sensory information in order to come to a conclusion or judgement is how we function in this world. In order for your mind to understand this physical world you live in it automatically makes certain assumptions about sensory information it takes in. Your eyes expect to see objects oriented correctly, with the correct color, lighting, reflectivity and shading, and you expect there size and shape to be within scale compared to other objects. My point is your senses have a range, which implies limitations. Since this is correct for your senses it is also correct for your ability to understand perspectives with any wide ranging diversity. You are able to see and process the information of our physical world just as any other human being does. That is great for a human but why would you think for a second,\n&gt;   &gt; &gt; you could understand the perspective of a mind and voice that speaks through a radio from some unknown location.\n&gt;   &gt; &gt; \n&gt;   &gt; &gt; The information you receive from the other side of your radios or even from thin air through EVP&#39;s could be completely correct and true no matter what the context because you don&#39;t know what perspective it is coming from. You are making a lot of unfounded assumptions about the (dare I say) beings or worlds they exist in and have a lot of expectations about the information you receive. You are looking for answers to the wrong questions! Quit assuming that these entities know you or the people around you. Quit assuming they are here for your entertainment as a personal fortune teller. Quit expecting them to know answers to question they may have themselves (just because they aren&#39;t physical doesn&#39;t mean they know everything). Don&#39;t assume you will be speaking to a dead relative or someone you once knew. Go to a fortune teller if you want information about the furture. If you are serious about researching these voices and the equipment used to record them\n&gt;   &gt; &gt; then ask the right questions. \n&gt;   &gt; &gt; \n&gt;   &gt; &gt; If you have a box made by Frank then ask Frank how the different circuits work, what is the puropose of some of the options, why is the RVG better or worse than a circuit without it? You have a unique situation here where the inventor of an important piece of equipment is willing to share the most minute details of how it works without a price tag attached. Some of the other box variations are sold by one person but created by someone else and usually based on some loose design similar to Frank&#39;s. The other equipment made by Bill Chapp and others will probably stay a mystery because they are sold for profit. Most people who use the different &quot;hacks&quot; know how to make them but don&#39;t know much about electronic theory or the behavior of radio waves to understand how they work.\n&gt;   &gt; &gt; \n&gt;   &gt; &gt; Point is you have plenty of questions to ask the human&#39;s who have built the equipment you are using before you can even begin to ask questions of the entities you are communicating with.\n&gt;   &gt; &gt; \n&gt;   &gt; &gt; Regards,\n&gt;   &gt; &gt; \n&gt;   &gt; &gt; Frank R.\n&gt;   &gt; &gt;\n&gt;   &gt;\n&gt;"}