{"id": "15831", "subject": "Re: [EVP-ITC] Re: The nature of things!", "author": "April Abercrombie", "timestamp": "2009-08-20T23:42:38Z", "full_text": "------=_NextPart_000_035D_01CA21BD.9C559370\r\nContent-Type: text/plain;\n\tcharset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nThanks Misty! I will look into that.\n\n  ----- Original Message ----- \n  Fro=\r\nm: bulletbabea \n  To: EVP-ITC@yahoogroups.com \n  Sent: Thursday, August 20,=\r\n 2009 5:03 PM\n  Subject: [EVP-ITC] Re: The nature of things!\n\n\n    April yo=\r\nu might be interested in researching some others who are/were involved in E=\r\nVP-ITC communication. Marcello Bacci, Hans Otto Koenig, George Meek, Ernst =\r\nSenkowski, Adolph Holmes, Sonia Rinaldi, just to name a few. Researchers ac=\r\nross the world explore this in great detail.\n\n  Many experiments are done w=\r\nith that idea in mind such as the spiricom experiemnts past and present, di=\r\nrect voice communications, Frank&#39;s box, and various other methods.\n\n  Frank=\r\n R just pointed out a great video that was posted interviewing Dr. Ernst Se=\r\nnkowski in which he gives an interesting viewpoint and some what he says mi=\r\nrrors my own point of view as well as info being given via EVP on many topi=\r\ncs. He also speaks about some of the various researchers he knew.\n\n  http:/=\r\n/vimeo.com/5637666\n\n  There is so much going on in the world that most peop=\r\nle in the USA have very little knowledge of simply because they do not spea=\r\nk the language that the info is being presented in. There are some videos o=\r\nf other researchers on the web as well and if you can get past the language=\r\n differences you may find some of their work to be very fascinating.\n\n  Mis=\r\nty\n\n  --- In EVP-ITC@yahoogroups.com, &quot;April Abercrombie&quot; &lt;april@...&gt; wrote=\r\n:\n  &gt;\n  &gt; Oh-to answer your first question-Solid proof for me would be an i=\r\nntelligent, back and forth conversation. It would also have to be VERY clea=\r\nr and many people would have to say they hear the same thing.\n  &gt; \n  &gt; ----=\r\n- Original Message ----- \n  &gt; From: purplespacefriend \n  &gt; To: EVP-ITC@yaho=\r\nogroups.com \n  &gt; Sent: Thursday, August 20, 2009 3:35 PM\n  &gt; Subject: [EVP-=\r\nITC] Re: The nature of things!\n  &gt; \n  &gt; \n  &gt; So what constitutes proof? All=\r\n I know for certain is that something talks by using the bits of audio from=\r\n radio stations as the tunign is swept. However, it can not be proven what =\r\nit is that&#39;s talking, so I guess that makes the whole thing invalid of litt=\r\nle use. \n  &gt; \n  &gt; Frank-S\n  &gt; \n  &gt; --- In EVP-ITC@yahoogroups.com, &quot;April A=\r\nbercrombie&quot; &lt;april@&gt; wrote:\n  &gt; &gt;\n  &gt; &gt; &quot;Just because speech is all percept=\r\nion does not make invalid--that even normal speech is highly subjective. If=\r\n you used the rules of these scienctists, you couldn&#39;t even trust what the =\r\nguy sitting next to you was saying. You couldn&#39;t trust what you were hearin=\r\ng!&quot;\n  &gt; &gt; \n  &gt; &gt; You&#39;re right....and I don&#39;t LOL! All I hope to be able to =\r\ndo is find proof of actual spirit communication. I don&#39;t care so much about=\r\n what is being communicated, only that it is.\n  &gt; &gt; \n  &gt; &gt; ----------------=\r\n------------------------------------------\n  &gt; &gt; \n  &gt; &gt; \n  &gt; &gt; &quot;Even it was=\r\n all imagination, that does not make it invalid or useless. It&#39;s still serv=\r\nes as personal insight. &quot;\n  &gt; &gt; \n  &gt; &gt; I absolutely agree.\n  &gt; &gt; \n  &gt; &gt; ---=\r\n-- Original Message ----- \n  &gt; &gt; From: purplespacefriend \n  &gt; &gt; To: EVP-ITC=\r\n@yahoogroups.com \n  &gt; &gt; Sent: Thursday, August 20, 2009 7:55 AM\n  &gt; &gt; Subje=\r\nct: [EVP-ITC] Re: The nature of things!\n  &gt; &gt; \n  &gt; &gt; \n  &gt; &gt; I think the min=\r\nd is not physical, and it&#39;s only these paranoid scientist types that try to=\r\n bully everyone into that extrememly narrow thinking that everything experi=\r\nenced is physical phenomenon only, and must be made to fit into that contex=\r\nt. \n  &gt; &gt; \n  &gt; &gt; Just because speech is all perception does not make invali=\r\nd--that even normal speech is highly subjective. If you used the rules of t=\r\nhese scienctists, you couldn&#39;t even trust what the guy sitting next to you =\r\nwas saying. You couldn&#39;t trust what you were hearing!\n  &gt; &gt; \n  &gt; &gt; Percepti=\r\non is everything. How is it that just before some mass death thing, like a =\r\nplane crash or some disaster I see the shadows shift, it should not be poss=\r\nible, but never the less, I&#39;ve seen it happen over and over. These scientif=\r\nic types brain wash everyone into not looking at clouds as you might imagin=\r\ne you see something--well a day or two before tornados in other states I se=\r\ne circles in the clouds here-hundreds of miles away. People see me looking =\r\nup and look at me like I&#39;m insane because of these bully skeptics. You&#39;re n=\r\not allowed to perceive anything unless they tell you it&#39;s ok. You can&#39;t loo=\r\nk at clouds, and you can&#39;t listen to voices fragments, cuz they can&#39;t expla=\r\nin away the perceptions. These scientist types are too brain dead to realiz=\r\ne they too create thier reality-all those supposed new particals did not ex=\r\nist before someone theorized about them, then they are created and &quot;discove=\r\nred&quot;. \n  &gt; &gt; \n  &gt; &gt; Even it was all imagination, that does not make it inva=\r\nlid or useless. It&#39;s still serves as personal insight. \n  &gt; &gt; \n  &gt; &gt; frank-=\r\nS\n  &gt; &gt; \n  &gt; &gt; --- In EVP-ITC@yahoogroups.com, Frank Ratka &lt;warrior18eii@&gt; =\r\nwrote:\n  &gt; &gt; &gt;\n  &gt; &gt; &gt; Assumptions and expectations!? I hear a lot of both =\r\nof these concepts in your words and when mentioning your research. Cognitiv=\r\ne functioning or processing sensory information in order to come to a concl=\r\nusion or judgement is how we function in this world. In order for your mind=\r\n to understand this physical world you live in it automatically makes certa=\r\nin assumptions about sensory information it takes in. Your eyes expect to s=\r\nee objects oriented correctly, with the correct color, lighting, reflectivi=\r\nty and shading, and you expect there size and shape to be within scale comp=\r\nared to other objects. My point is your senses have a range, which implies =\r\nlimitations. Since this is correct for your senses it is also correct for y=\r\nour ability to understand perspectives with any wide ranging diversity. You=\r\n are able to see and process the information of our physical world just as =\r\nany other human being does. That is great for a human but why would you thi=\r\nnk for a second,\n  &gt; &gt; &gt; you could understand the perspective of a mind and=\r\n voice that speaks through a radio from some unknown location.\n  &gt; &gt; &gt; \n  &gt;=\r\n &gt; &gt; The information you receive from the other side of your radios or even=\r\n from thin air through EVP&#39;s could be completely correct and true no matter=\r\n what the context because you don&#39;t know what perspective it is coming from=\r\n. You are making a lot of unfounded assumptions about the (dare I say) bein=\r\ngs or worlds they exist in and have a lot of expectations about the informa=\r\ntion you receive. You are looking for answers to the wrong questions! Quit =\r\nassuming that these entities know you or the people around you. Quit assumi=\r\nng they are here for your entertainment as a personal fortune teller. Quit =\r\nexpecting them to know answers to question they may have themselves (just b=\r\necause they aren&#39;t physical doesn&#39;t mean they know everything). Don&#39;t assum=\r\ne you will be speaking to a dead relative or someone you once knew. Go to a=\r\n fortune teller if you want information about the furture. If you are serio=\r\nus about researching these voices and the equipment used to record them\n  &gt;=\r\n &gt; &gt; then ask the right questions. \n  &gt; &gt; &gt; \n  &gt; &gt; &gt; If you have a box made=\r\n by Frank then ask Frank how the different circuits work, what is the purop=\r\nose of some of the options, why is the RVG better or worse than a circuit w=\r\nithout it? You have a unique situation here where the inventor of an import=\r\nant piece of equipment is willing to share the most minute details of how i=\r\nt works without a price tag attached. Some of the other box variations are =\r\nsold by one person but created by someone else and usually based on some lo=\r\nose design similar to Frank&#39;s. The other equipment made by Bill Chapp and o=\r\nthers will probably stay a mystery because they are sold for profit. Most p=\r\neople who use the different &quot;hacks&quot; know how to make them but don&#39;t know mu=\r\nch about electronic theory or the behavior of radio waves to understand how=\r\n they work.\n  &gt; &gt; &gt; \n  &gt; &gt; &gt; Point is you have plenty of questions to ask t=\r\nhe human&#39;s who have built the equipment you are using before you can even b=\r\negin to ask questions of the entities you are communicating with.\n  &gt; &gt; &gt; \n=\r\n  &gt; &gt; &gt; Regards,\n  &gt; &gt; &gt; \n  &gt; &gt; &gt; Frank R.\n  &gt; &gt; &gt;\n  &gt; &gt;\n  &gt;\n\n\n\n  \r\n------=_NextPart_000_035D_01CA21BD.9C559370\r\nContent-Type: text/html;\n\tcharset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML 4.0 Transitional//EN&quot;&gt;\n&lt;HTML&gt;&lt;HEAD&gt;=\r\n\n&lt;META content=3D&quot;text/html; charset=3Diso-8859-1&quot; http-equiv=3DContent-Typ=\r\ne&gt;\n&lt;META name=3DGENERATOR content=3D&quot;MSHTML 8.00.6001.18812&quot;&gt;&lt;/HEAD&gt;\n&lt;BODY =\r\nstyle=3D&quot;BACKGROUND-COLOR: #ffffff&quot; bgColor=3D#ffffff&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 =\r\nface=3D&quot;Myriad Pro&quot;&gt;Thanks Misty! I will look into \nthat.&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV=\r\n&gt;&lt;FONT size=3D2 face=3D&quot;Myriad Pro&quot;&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;BLOCKQUOTE \nstyle=\r\n=3D&quot;BORDER-LEFT: #000000 2px solid; PADDING-LEFT: 5px; PADDING-RIGHT: 0px; =\r\nMARGIN-LEFT: 5px; MARGIN-RIGHT: 0px&quot; \ndir=3Dltr&gt;\n  &lt;DIV style=3D&quot;FONT: 10pt=\r\n arial&quot;&gt;----- Original Message ----- &lt;/DIV&gt;\n  &lt;DIV \n  style=3D&quot;FONT: 10pt a=\r\nrial; BACKGROUND: #e4e4e4; font-color: black&quot;&gt;&lt;B&gt;From:&lt;/B&gt; \n  &lt;A title=3Dbu=\r\nlletbabea@... \n  href=3D&quot;mailto:bulletbabea@...&quot;&gt;bulletbabea&lt;/A=\r\n&gt; &lt;/DIV&gt;\n  &lt;DIV style=3D&quot;FONT: 10pt arial&quot;&gt;&lt;B&gt;To:&lt;/B&gt; &lt;A title=3DEVP-ITC@ya=\r\nhoogroups.com \n  href=3D&quot;mailto:EVP-ITC@yahoogroups.com&quot;&gt;EVP-ITC@yahoogroup=\r\ns.com&lt;/A&gt; &lt;/DIV&gt;\n  &lt;DIV style=3D&quot;FONT: 10pt arial&quot;&gt;&lt;B&gt;Sent:&lt;/B&gt; Thursday, A=\r\nugust 20, 2009 5:03 \n  PM&lt;/DIV&gt;\n  &lt;DIV style=3D&quot;FONT: 10pt arial&quot;&gt;&lt;B&gt;Subjec=\r\nt:&lt;/B&gt; [EVP-ITC] Re: The nature of \n  things!&lt;/DIV&gt;\n  &lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;SPAN =\r\nstyle=3D&quot;DISPLAY: none&quot;&gt;&nbsp;&lt;/SPAN&gt; \n  &lt;DIV id=3Dygrp-text&gt;\n  &lt;P&gt;April yo=\r\nu might be interested in researching some others who are/were \n  involved i=\r\nn EVP-ITC communication. Marcello Bacci, Hans Otto Koenig, George \n  Meek, =\r\nErnst Senkowski, Adolph Holmes, Sonia Rinaldi, just to name a few. \n  Resea=\r\nrchers across the world explore this in great detail.&lt;BR&gt;&lt;BR&gt;Many \n  experi=\r\nments are done with that idea in mind such as the spiricom experiemnts \n  p=\r\nast and present, direct voice communications, Frank&#39;s box, and various othe=\r\nr \n  methods.&lt;BR&gt;&lt;BR&gt;Frank R just pointed out a great video that was posted=\r\n \n  interviewing Dr. Ernst Senkowski in which he gives an interesting viewp=\r\noint \n  and some what he says mirrors my own point of view as well as info =\r\nbeing given \n  via EVP on many topics. He also speaks about some of the var=\r\nious researchers \n  he knew.&lt;BR&gt;&lt;BR&gt;&lt;A \n  href=3D&quot;http://vimeo.com/5637666&quot;=\r\n&gt;http://vimeo.&lt;WBR&gt;com/5637666&lt;/A&gt;&lt;BR&gt;&lt;BR&gt;There \n  is so much going on in t=\r\nhe world that most people in the USA have very little \n  knowledge of simpl=\r\ny because they do not speak the language that the info is \n  being presente=\r\nd in. There are some videos of other researchers on the web as \n  well and =\r\nif you can get past the language differences you may find some of \n  their =\r\nwork to be very fascinating.&lt;BR&gt;&lt;BR&gt;Misty&lt;BR&gt;&lt;BR&gt;--- In &lt;A \n  href=3D&quot;mailt=\r\no:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;, \n  &quot;April Ab=\r\nercrombie&quot; &lt;april@...&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; Oh-to answer your \n  fi=\r\nrst question-Solid proof for me would be an intelligent, back and forth \n  =\r\nconversation. It would also have to be VERY clear and many people would hav=\r\ne \n  to say they hear the same thing.&lt;BR&gt;&gt; &lt;BR&gt;&gt; ----- Original Messa=\r\nge ----- \n  &lt;BR&gt;&gt; From: purplespacefriend &lt;BR&gt;&gt; To: &lt;A \n  href=3D&quot;mai=\r\nlto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt; \n  &lt;BR&gt;&gt;=\r\n Sent: Thursday, August 20, 2009 3:35 PM&lt;BR&gt;&gt; Subject: [EVP-ITC] \n  Re: =\r\nThe nature of things!&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; So what constitutes proof? =\r\n\n  All I know for certain is that something talks by using the bits of audi=\r\no from \n  radio stations as the tunign is swept. However, it can not be pro=\r\nven what it \n  is that&#39;s talking, so I guess that makes the whole thing inv=\r\nalid of little \n  use. &lt;BR&gt;&gt; &lt;BR&gt;&gt; Frank-S&lt;BR&gt;&gt; &lt;BR&gt;&gt; --- In &lt;A=\r\n \n  href=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;=\r\n/A&gt;, \n  &quot;April Abercrombie&quot; &lt;april@&gt; wrote:&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt;=\r\n &quot;Just \n  because speech is all perception does not make invalid--that even=\r\n normal \n  speech is highly subjective. If you used the rules of these scie=\r\nnctists, you \n  couldn&#39;t even trust what the guy sitting next to you was sa=\r\nying. You couldn&#39;t \n  trust what you were hearing!&quot;&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &=\r\ngt; You&#39;re right....and I \n  don&#39;t LOL! All I hope to be able to do is find=\r\n proof of actual spirit \n  communication. I don&#39;t care so much about what i=\r\ns being communicated, only \n  that it is.&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; \n  ---=\r\n---------&lt;WBR&gt;---------&lt;WBR&gt;---------&lt;WBR&gt;---------&lt;WBR&gt;---------&lt;WBR&gt;-----=\r\n----&lt;WBR&gt;-&lt;BR&gt;&gt; \n  &gt; &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; &quot;Even it was all ima=\r\ngination, that does not \n  make it invalid or useless. It&#39;s still serves as=\r\n personal insight. &quot;&lt;BR&gt;&gt; \n  &gt; &lt;BR&gt;&gt; &gt; I absolutely agree.&lt;BR&gt;&=\r\ngt; &gt; &lt;BR&gt;&gt; &gt; ----- \n  Original Message ----- &lt;BR&gt;&gt; &gt; From: =\r\npurplespacefriend &lt;BR&gt;&gt; &gt; To: \n  &lt;A href=3D&quot;mailto:EVP-ITC%40yahoogro=\r\nups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt; \n  &lt;BR&gt;&gt; &gt; Sent: Thursday, =\r\nAugust 20, 2009 7:55 AM&lt;BR&gt;&gt; &gt; Subject: \n  [EVP-ITC] Re: The nature o=\r\nf things!&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; I \n  think the mind is n=\r\not physical, and it&#39;s only these paranoid scientist types \n  that try to bu=\r\nlly everyone into that extrememly narrow thinking that \n  everything experi=\r\nenced is physical phenomenon only, and must be made to fit \n  into that con=\r\ntext. &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; Just because speech is all \n  perception =\r\ndoes not make invalid--that even normal speech is highly \n  subjective. If =\r\nyou used the rules of these scienctists, you couldn&#39;t even \n  trust what th=\r\ne guy sitting next to you was saying. You couldn&#39;t trust what you \n  were h=\r\nearing!&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; Perception is everything. How is it \n  t=\r\nhat just before some mass death thing, like a plane crash or some disaster =\r\nI \n  see the shadows shift, it should not be possible, but never the less, =\r\nI&#39;ve \n  seen it happen over and over. These scientific types brain wash eve=\r\nryone into \n  not looking at clouds as you might imagine you see something-=\r\n-well a day or \n  two before tornados in other states I see circles in the =\r\nclouds here-hundreds \n  of miles away. People see me looking up and look at=\r\n me like I&#39;m insane because \n  of these bully skeptics. You&#39;re not allowed =\r\nto perceive anything unless they \n  tell you it&#39;s ok. You can&#39;t look at clo=\r\nuds, and you can&#39;t listen to voices \n  fragments, cuz they can&#39;t explain aw=\r\nay the perceptions. These scientist types \n  are too brain dead to realize =\r\nthey too create thier reality-all those supposed \n  new particals did not e=\r\nxist before someone theorized about them, then they are \n  created and &quot;dis=\r\ncovered&quot;&lt;WBR&gt;. &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; Even it was all \n  imagination, =\r\nthat does not make it invalid or useless. It&#39;s still serves as \n  personal =\r\ninsight. &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; frank-S&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; \n  &gt; =\r\n--- In &lt;A \n  href=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;=\r\nWBR&gt;.com&lt;/A&gt;, \n  Frank Ratka &lt;warrior18eii@&lt;WBR&gt;&gt; wrote:&lt;BR&gt;&gt; &gt;=\r\n &gt;&lt;BR&gt;&gt; &gt; \n  &gt; Assumptions and expectations!&lt;WBR&gt;? I hear a lot=\r\n of both of these \n  concepts in your words and when mentioning your resear=\r\nch. Cognitive \n  functioning or processing sensory information in order to =\r\ncome to a conclusion \n  or judgement is how we function in this world. In o=\r\nrder for your mind to \n  understand this physical world you live in it auto=\r\nmatically makes certain \n  assumptions about sensory information it takes i=\r\nn. Your eyes expect to see \n  objects oriented correctly, with the correct =\r\ncolor, lighting, reflectivity and \n  shading, and you expect there size and=\r\n shape to be within scale compared to \n  other objects. My point is your se=\r\nnses have a range, which implies \n  limitations. Since this is correct for =\r\nyour senses it is also correct for your \n  ability to understand perspectiv=\r\nes with any wide ranging diversity. You are \n  able to see and process the =\r\ninformation of our physical world just as any \n  other human being does. Th=\r\nat is great for a human but why would you think for \n  a second,&lt;BR&gt;&gt; &g=\r\nt; &gt; you could understand the perspective of a mind and \n  voice that sp=\r\neaks through a radio from some unknown location.&lt;BR&gt;&gt; &gt; \n  &gt; &lt;BR&gt;&=\r\ngt; &gt; &gt; The information you receive from the other side of \n  your ra=\r\ndios or even from thin air through EVP&#39;s could be completely correct \n  and=\r\n true no matter what the context because you don&#39;t know what perspective it=\r\n \n  is coming from. You are making a lot of unfounded assumptions about the=\r\n (dare \n  I say) beings or worlds they exist in and have a lot of expectati=\r\nons about the \n  information you receive. You are looking for answers to th=\r\ne wrong questions! \n  Quit assuming that these entities know you or the peo=\r\nple around you. Quit \n  assuming they are here for your entertainment as a =\r\npersonal fortune teller. \n  Quit expecting them to know answers to question=\r\n they may have themselves (just \n  because they aren&#39;t physical doesn&#39;t mea=\r\nn they know everything). Don&#39;t assume \n  you will be speaking to a dead rel=\r\native or someone you once knew. Go to a \n  fortune teller if you want infor=\r\nmation about the furture. If you are serious \n  about researching these voi=\r\nces and the equipment used to record them&lt;BR&gt;&gt; \n  &gt; &gt; then ask the=\r\n right questions. &lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; \n  If you have a bo=\r\nx made by Frank then ask Frank how the different circuits \n  work, what is =\r\nthe puropose of some of the options, why is the RVG better or \n  worse than=\r\n a circuit without it? You have a unique situation here where the \n  invent=\r\nor of an important piece of equipment is willing to share the most \n  minut=\r\ne details of how it works without a price tag attached. Some of the other \n=\r\n  box variations are sold by one person but created by someone else and usu=\r\nally \n  based on some loose design similar to Frank&#39;s. The other equipment =\r\nmade by \n  Bill Chapp and others will probably stay a mystery because they =\r\nare sold for \n  profit. Most people who use the different &quot;hacks&quot; know how =\r\nto make them but \n  don&#39;t know much about electronic theory or the behavior=\r\n of radio waves to \n  understand how they work.&lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; =\r\n&gt; &gt; Point is you \n  have plenty of questions to ask the human&#39;s who h=\r\nave built the equipment you \n  are using before you can even begin to ask q=\r\nuestions of the entities you are \n  communicating with.&lt;BR&gt;&gt; &gt; &gt; &lt;=\r\nBR&gt;&gt; &gt; &gt; Regards,&lt;BR&gt;&gt; &gt; \n  &gt; &lt;BR&gt;&gt; &gt; &gt; Frank R.=\r\n&lt;BR&gt;&gt; &gt; &gt;&lt;BR&gt;&gt; \n  &gt;&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/P&gt;&lt;/DIV&gt;&lt;!--End group e=\r\nmail --&gt;&lt;/BODY&gt;&lt;/HTML&gt;\n\r\n------=_NextPart_000_035D_01CA21BD.9C559370--"}