{"id": "15849", "subject": "Re: [EVP-ITC] I am new here", "author": "Zack Widup", "timestamp": "2009-08-22T18:06:26Z", "full_text": "Will do. Then person actually speaking never gave his name (it was\ndefinitely a male voice). He should be told too!\n\nZack\n\nOn Sat, Aug 22, 2009 at 9:00 AM, &lt;SnowfireL@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; If you ever get back over there Zack, encourage him to cross over into the\n&gt; light, and/or send him a prayer if not though to get him to cross over into\n&gt; the light, let him know he has loved ones there waiting for him.  By giving\n&gt; us all this wonderful gift is probably, God&#39; hoping we will all be like an\n&gt; emissary to redirect these souls back to Him, sending  them all back to the\n&gt; true spiritual home.\n&gt; bonnie\n&gt;\n&gt;  In a message dated 8/22/2009 9:32:35 A.M. Eastern Daylight Time,\n&gt; w9sz.zack@... writes:\n&gt;\n&gt;\n&gt;\n&gt; Hi,\n&gt;\n&gt; I don&#39;t know how you would &quot;test&quot; the entities. One of the best I&#39;ve ever\n&gt; goten though was at the former Manteno State Mental Hospital in Illinois.\n&gt;\n&gt; I was there with a group of about 8 people and the place was very active\n&gt; that night. The building we were in is shaped like an &quot;H&quot;. We were in one\n&gt; arm of the H looking across at the other and saw a shadow figure moving\n&gt; around. We were just commenting on the figure when a voice came up in my\n&gt; recording saying &quot;It&#39;s Harold Wing.&quot;  It repeated this once and then said\n&gt; &quot;It&#39;s Harold.&quot;\n&gt;\n&gt; Now, none of us heard any of this while we were standing there and none of\n&gt; us knew or ever heard of Harold Wing. One of the people there later managed\n&gt; to get into the old records for the hospital and found Harold Wing was a\n&gt; patient there who died of typhoid fever there in 1938.\n&gt;\n&gt; Zack\n&gt;\n&gt; On Fri, Aug 21, 2009 at 4:08 PM, alan.story &lt;alan.story@...&gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; I am new to the group, I am a practicing Spiritualist but have never done\n&gt;&gt; any EVP work. How reliable is the info you are getting, have any of you\n&gt;&gt; tested the entities/voices? What are some of the best messages received?\n&gt;&gt;\n&gt;&gt;\n&gt;\n&gt; ------------------------------\n&gt;\n&gt; \n&gt;\n\nWill do. Then pe son ac ually speaking ne e ga e his name (i was de ini ely a male oice). He should be old oo!\n \nZack\nOn Sa , Aug 22, 2009 a 9:00 AM, Snow i eL@aol.com> w o e:\n\n  \n\n\n\n\nI you e e ge back o e he e Zack, encou age him o c oss o e in o he ligh , and/o send him a p aye i no hough o ge him o c oss o e in o he ligh , le him know he has lo ed ones he e wai ing o him.  By gi ing us all his wonde ul gi is p obably, God' hoping we will all be like an emissa y o edi ec hese souls back o Him, sending   hem all back o he ue spi i ual home.\n\nbonnie\n\n \n\nIn a message da ed 8/22/2009 9:32:35 A.M. Eas e n Dayligh Time, w9sz.zack@gmail.com w i es:\n  \n\n\nHi,\n \nI don' know how you would \" es \" he en i ies. One o he bes I' e e e go en hough was a he o me Man eno S a e Men al Hospi al in Illinois.\n \nI was he e wi h a g oup o abou 8 people and he place was e y ac i e ha nigh . The building we we e in is shaped like an \"H\". We we e in one a m o he H looking ac oss a he o he and saw a shadow igu e mo ing a ound. We we e jus commen ing on he igu e when a oice came up in my eco ding saying \"I 's Ha old Wing.\"  I epea ed his once and hen said \"I 's Ha old.\"\n\n \nNow, none o us hea d any o his while we we e s anding he e and none o us knew o e e hea d o Ha old Wing. One o he people he e la e managed o ge in o he old eco ds o he hospi al and  ound Ha old Wing was a pa ien he e who died o yphoid e e he e in 1938.\n\n \nZack \nOn F i, Aug 21, 2009 a 4:08 PM, alan.s o y alan.s o y@...> w o e:\n\n\n  \n\n\n\nI am new o he g oup, I am a p ac icing Spi i ualis bu ha e ne e done any EVP wo k. How eliable is he in o you a e ge ing, ha e any o you es ed he en i ies/ oices? Wha a e some o he bes messages ecei ed?"}