{"id": "1584", "subject": "Re: thanks for the reply frank", "author": "Steve Hultay", "timestamp": "2007-07-15T05:50:07Z", "full_text": "I personally think begging for a box from Frank is probably just \npissing him off.  He will give a box to whom he feels is doing \nresearch on their own and deserves one being they already have a \nclientel on the other side without his help.  This is just my \nopinion and i really don&#39;t mean to offend people, but everybody can \ntry to say the right thing to persuade Frank, but he is looking for \ntrue researchers in ITC and not someone who just wants to have what \nnobody can make themself.  It&#39;s just annoying seeing people everyday \nsaying where&#39;s my box?  There is plenty of research to do without it \nand capable people to build them too.  Find them and stop begging on \nthis board, this is not what it is for and i&#39;m not speaking for \nFrank in any way.  But i&#39;d rather hear someone&#39;s Manual sweeps or \nsomething through EVP maker rather than groveling with no attempt to \ndo anything for themselves.  Just my take on it and i&#39;m sorry if i \npissed anybody off.\n\n-Steve H.\n\n\n\n--- In EVP-ITC@yahoogroups.com, Lisby &lt;lisby@...&gt; wrote:\n&gt;\n&gt; Give one to Bruce before me, Frank. He&#39;s a great guy and he \ndeserves  \n&gt; it a lot more; he&#39;s got more time for research and a lot of \nfriends  \n&gt; on the others side he wants and needs to talk to.\n&gt; \n&gt; Ann\n&gt; \n&gt; On Jul 14, 2007, at 6:10 PM, bhali333 wrote:\n&gt; \n&gt; &gt; hey Frank,\n&gt; &gt; thanks for the reply to my post. I am disabled from toxins I \nbreathed\n&gt; &gt; at ground zero during rescue and recovery efforts, I was a first\n&gt; &gt; responder so we got the worst of it and it has left me with a \nlung\n&gt; &gt; disease and two heart attacks but I&#39;m not handicaped I have total\n&gt; &gt; mobility I just have to take it easy. So as you may see I have \nalot of\n&gt; &gt; time for experimenting and have been doing evp research as well \nas itc\n&gt; &gt; for some time now and your box has touched a special cord with \nme it\n&gt; &gt; just feels like I should have and be using one. Don&#39;t ask me to  \n&gt; &gt; explain\n&gt; &gt; it&#39;s just this wierd feeling like something is telling me you \nare  \n&gt; &gt; meant\n&gt; &gt; to use this tool. If you can ever see your way clear as to \nbuilding  \n&gt; &gt; one\n&gt; &gt; for me I would be more than glad to pay for your time labor and\n&gt; &gt; materials and would be forever appreciative.\n&gt; &gt;\n&gt; &gt; your friend\n&gt; &gt; Bruce Halliday\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Yahoo! Groups Links\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt;"}