{"id": "15851", "subject": "Re: I am new here", "author": "rasterer", "timestamp": "2009-08-22T18:26:39Z", "full_text": "Hello Alan. I guess &#39;testing&#39; starts with what you believe is beyond question or cannot be tested, and what you believe should be questioned and can be tested.  Different people believe EVPs fall in different places on that spectrum of possibilities, and there are different opinions on what the voices heard are (afterlife? aliens? angels? pareidolia? radio programs? something else?)\n\nIf you wanted to go back to first principles, you could first examine where you fall on that list, and then determine what tests you could perform to confirm or dispute that belief.  For example, if you believe the voices are from aliens, it might first be good to determine how you know aliens exist, since if you can&#39;t do even that, the value of the belief the voices are from aliens, seems to drop alot.\n\nOr, if you are already convinced aliens exist and the voices are from aliens, you could always try testing their accuracy.  For example, getting dates and very clear predictions, or answers to questions you can confirm, and go from there.  I would avoid yes/no questions, and multiple choice questions, since that can predispose you to hearing certain answers.\n\nAnother tricky thing, is that these often are not clear voices.  I have seen instances where what one person hears is not what another person hears, which can make it hard to be sure if you are interpreting the sound correctly.  Further, I have seen where a person will listen to a recording, not know what it is, then be told what it is, and only then can they hear it.  So if you are trying to determine what a voice is saying, and you get someone else to listen but you first tell them what it says, they might then hear it when otherwise they would not.  So again, for the most objective testing there, listen to sounds (or have others listen to them) without first being told what it is supposed to be saying.  And using a second person like this can also help to lessen the possibility you are hearing what you want to hear.\n\nOf course, if you are not interested in testing, that is also your decision.  Many people do not do any testing: they just make recordings, label them what they think they say, and upload them to show others. \n\nGood luck with it.\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;alan.story&quot; &lt;alan.story@...&gt; wrote:\n&gt;\n&gt; I am new to the group, I am a practicing Spiritualist but have never done any EVP work. How reliable is the info you are getting, have any of you tested the entities/voices? What are some of the best messages received?\n&gt;"}