{"id": "15854", "subject": "Re: [EVP-ITC] Re: I am new here", "author": "Zack Widup", "timestamp": "2009-08-22T23:20:18Z", "full_text": "I&#39;m convinced all the responses we got on EVP were by patients who died at\nthe hospital. And some of the rsponses led me to believe they are as crazy\nnow as they were back then. So much for brain theories! They don&#39;t have\nbrains now.\n:-)\n\nZack\n\nOn Sat, Aug 22, 2009 at 6:12 PM, mrscaptainjack2 &lt;jjkamp@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Now, see, this is what I wonder: if that&#39;s not a dead person, what would do\n&gt; that and why? An entity (who had never been alive) would have to pull that\n&gt; bit of information about the former patient out of history somehow (or the\n&gt; Akashic records or whatever) and then hope you followed up on it. Seems like\n&gt; a lot of trouble to go through.\n&gt;\n&gt; Jill\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Zack Widup\n&gt; &lt;w9sz.zack@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hi,\n&gt; &gt;\n&gt; &gt; I don&#39;t know how you would &quot;test&quot; the entities. One of the best I&#39;ve ever\n&gt; &gt; goten though was at the former Manteno State Mental Hospital in Illinois.\n&gt; &gt;\n&gt; &gt; I was there with a group of about 8 people and the place was very active\n&gt; &gt; that night. The building we were in is shaped like an &quot;H&quot;. We were in one\n&gt; &gt; arm of the H looking across at the other and saw a shadow figure moving\n&gt; &gt; around. We were just commenting on the figure when a voice came up in my\n&gt; &gt; recording saying &quot;It&#39;s Harold Wing.&quot; It repeated this once and then said\n&gt; &gt; &quot;It&#39;s Harold.&quot;\n&gt; &gt;\n&gt; &gt; Now, none of us heard any of this while we were standing there and none\n&gt; of\n&gt; &gt; us knew or ever heard of Harold Wing. One of the people there later\n&gt; managed\n&gt; &gt; to get into the old records for the hospital and found Harold Wing was a\n&gt; &gt; patient there who died of typhoid fever there in 1938.\n&gt; &gt;\n&gt; &gt; Zack\n&gt; &gt;\n&gt; &gt; On Fri, Aug 21, 2009 at 4:08 PM, alan.story &lt;alan.story@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; I am new to the group, I am a practicing Spiritualist but have never\n&gt; done\n&gt; &gt; &gt; any EVP work. How reliable is the info you are getting, have any of you\n&gt; &gt; &gt; tested the entities/voices? What are some of the best messages\n&gt; received?\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nI'm con inced all he esponses we go on EVP we e by pa ien s who died a he hospi al. And some o he sponses led me o belie e hey a e as c azy now as hey we e back hen. So much o b ain heo ies! They don' ha e b ains now.\n\n:-)\n \nZack\nOn Sa , Aug 22, 2009 a 6:12 PM, m scap ainjack2 jjkamp@...> w o e:\n\n  \n\n\n\nNow, see, his is wha I wonde : i ha 's no a dead pe son, wha would do ha and why? An en i y (who had ne e been ali e) would ha e o pull ha bi o in o ma ion abou he o me pa ien ou o his o y somehow (o he Akashic eco ds o wha e e ) and hen hope you ollowed up on i . Seems like a lo o ouble o go h ough.\nJill \n--- In EVP-ITC@yahoog oups.com, Zack Widup w o e:>> Hi,> > I don' know how you would \" es \" he en i ies. One o he bes I' e e e \n> go en hough was a he o me Man eno S a e Men al Hospi al in Illinois.> > I was he e wi h a g oup o abou 8 people and he place was e y ac i e> ha nigh . The building we we e in is shaped like an \"H\". We we e in one\n> a m o he H looking ac oss a he o he and saw a shadow igu e mo ing> a ound. We we e jus commen ing on he igu e when a oice came up in my> eco ding saying \"I 's Ha old Wing.\" I epea ed his once and hen said\n> \"I 's Ha old.\"> > Now, none o us hea d any o his while we we e s anding he e and none o > us knew o e e hea d o Ha old Wing. One o he people he e la e managed> o ge in o he old eco ds o he hospi al and ound Ha old Wing was a\n> pa ien he e who died o yphoid e e he e in 1938.> > Zack> \n> On F i, Aug 21, 2009 a 4:08 PM, alan.s o y w o e:> > >> >> > I am new o he g oup, I am a p ac icing Spi i ualis bu ha e ne e done\n> > any EVP wo k. How eliable is he in o you a e ge ing, ha e any o you> > es ed he en i ies/ oices? Wha a e some o he bes messages ecei ed?> >> > > >>"}