{"id": "15869", "subject": "Re: The radio", "author": "vortex6066", "timestamp": "2009-08-25T02:22:04Z", "full_text": "Frank, do you think the lack of inter-station noise makes for more solid voice formation from the fragment material, or just that it makes the voices easier to hear (and doesnt make a difference to the formation depth / quality) ?\nIm asking as I was pondering what makes the voices actually &quot;form&quot; better from the fragments.\nJEFF\n\n--- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  Yeah, the TRF radio has none of the in between station noise, but there&#39;s still a draw back, the broadcast fragments tend to be longer.\n&gt; \n&gt;  Where I&#39;m at even the 469 has lots of noise.  \n&gt; \n&gt;  F-S\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;vortex6066&quot; &lt;vortex6066@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Thanks Frank for the clarification.\n&gt; &gt; I havent played with TRF chips for years, but I remember they were dead silent in between stations, which has to be good. I seem to remember the selectivity wasnt too good, but I may have had too much gain happening.\n&gt; &gt; Presently been playing with a head-less 12-469, which seems quite good and also quiet in between stations. I guess you rate the MK484 better due to it having no mixer noise?\n&gt; &gt; I found an article on the ZN414, and thought I should share it, as its got a new slant on RF Gain control, by tapping down the AGC feedback via a pot. It should allow much greater control of the chips response to strong signals. The cct in question is shown down the page here ....\n&gt; &gt; http://cool386.tripod.com/zn414/zn414.html\n&gt; &gt; regards from &quot;down under&quot; in NZ,\n&gt; &gt; JEFF\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt;  I used a different op amp, the LM358, but everything else is the same.  You\n&gt; &gt; &gt; could use a LM324 from Radio Shack as well.\n&gt; &gt; &gt; \n&gt; &gt; &gt;  F-S\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}