{"id": "1587", "subject": "RE: [EVP-ITC] Re: thanks for the reply frank", "author": "Frank Sumption", "timestamp": "2007-07-15T06:49:04Z", "full_text": "It doesn&#39;t piss me off, and I don&#39;t mind giving away the proto types, it&#39;s \nannoying to me only in that I have not yet gotten any production going, (I \nkeep getting sidetracked). Some of these hand wire boxes don&#39;t seem to hold \nup, especially if they are shipped, and moved all over the place. The hand \nwired boxes are quite inferior to ones I could make with printed circuit \nboards, I just haven&#39;t had the time to do the board layout yet. There&#39;s also \nthe problem that I keep finding better ways to improve the boxes, like the \ntiny echo box. I hate to provide stuff that seems less than completed, in \nthat way.\n\nFrank-S\n\n\n\n&gt;From: &quot;Steve Hultay&quot; &lt;urkel23@...&gt;\n&gt;Reply-To: EVP-ITC@yahoogroups.com\n&gt;To: EVP-ITC@yahoogroups.com\n&gt;Subject: [EVP-ITC] Re: thanks for the reply frank\n&gt;Date: Sun, 15 Jul 2007 05:50:07 -0000\n&gt;\n&gt;I personally think begging for a box from Frank is probably just\n&gt;pissing him off.  He will give a box to whom he feels is doing\n&gt;research on their own and deserves one being they already have a\n&gt;clientel on the other side without his help.  This is just my\n&gt;opinion and i really don&#39;t mean to offend people, but everybody can\n&gt;try to say the right thing to persuade Frank, but he is looking for\n&gt;true researchers in ITC and not someone who just wants to have what\n&gt;nobody can make themself.  It&#39;s just annoying seeing people everyday\n&gt;saying where&#39;s my box?  There is plenty of research to do without it\n&gt;and capable people to build them too.  Find them and stop begging on\n&gt;this board, this is not what it is for and i&#39;m not speaking for\n&gt;Frank in any way.  But i&#39;d rather hear someone&#39;s Manual sweeps or\n&gt;something through EVP maker rather than groveling with no attempt to\n&gt;do anything for themselves.  Just my take on it and i&#39;m sorry if i\n&gt;pissed anybody off.\n&gt;\n&gt;-Steve H.\n&gt;\n\n_________________________________________________________________\nhttp://newlivehotmail.com"}