{"id": "15877", "subject": "Re: The sound of one hand sweeping!", "author": "vortex6066", "timestamp": "2009-08-27T03:31:37Z", "full_text": "Whoops, sorry for the blank previous post.\n\nYes, maybe its as simple as ...\nListening = input\nfinger tuning = output\nTherefore Automatic frequency (fragment selection) control created (with subconscious influence by entities).\n\nJEFF\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  There&#39;s different possibilities, I have one box with a crystal glued over the antenna that seems to work better in a kind of subjective way. Some hold the antenna to their chin (moon). Maybe just listening puts the person in the box? \n&gt; \n&gt; \n&gt;  F-S\n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;vortex6066&quot; &lt;vortex6066@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Frank,\n&gt; &gt; I was thinking about your comments..\n&gt; &gt; Manual sweep does seem to add more of the operator into the process. Perhaps thats a good thing, as the tuning likely becomes under the control of the person&#39;s subconscious much like a Ouija board and possibly allows entities to better manipulate the tuning of required fragments? \n&gt; &gt; Linear or random electronic tuning doesnt have that direct human interaction .... but can it be tied in somehow? \n&gt; &gt; JEFF\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; &lt;purplealiengirl@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt;  See, not a box, or even a hack radio, just a cheap little FM radio. No magic, no mystery, but mucho fun! You can ask questions, and get all the box function--no box! I just can&#39;t in all honesty sell something that&#39;s just a damn radio with automated sweep. I mean i could probably sell it for what it is, but not for mega bucks, or try to over glorify it like all the wanna be box experts out there. It&#39;s just one method of many of supplying raw audio. \n&gt; &gt; &gt; \n&gt; &gt; &gt;  BTW, Misty pretty much discovered manual sweep here, on this group! \n&gt; &gt; &gt; \n&gt; &gt; &gt;  F-S\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}