{"id": "1590", "subject": "my theory of evp", "author": "bhali333", "timestamp": "2007-07-15T15:21:07Z", "full_text": "Theory of evp\n\n\nThese are my thoughts on why we get class A or class B or lower, why \nsome evps stand on their own and some have to be edited by an audio \nediting program to be heard. I am sure that all serious evp \nresearchers do recording sessions in their homes more than anywhere \nelse such as on a field investigation. If your like me you do a \nrecording just about everyday. In my experience there are many \ndifferent types of evp researchers you have your die hard white noise \nusers, your silent no question no background noise individuals your \nonly on investigations or in ascertain room of the house people and \nthe radicals that reach out for new methods and ideas and are always \nexperimenting with different ways to record evp and dedicating a lot \nof brain power to try and come up with a way to make the break \nthrough to real time communication as apposed to recording a question \nand answer session to be analyzed later.\nThen you have the researchers like me that embrace with an open mind \nall forms of evp as well as itc and any other form of paranormal \nresearch and investigation, see I am the type of PI that will try new \nmethods and post them to a forum or on my website so that others may \nsee what I am working on and maybe give it a try themselves and \nhopefully further the method and the knowledge of it. Only to come \nunder fire from the so called sceptics that believe they must at any \ncost negatively view any presented outcome to give themselves \ncredibility. \nAnyway this is turning into a rant and getting away from the subject. \nMany evp researchers if not all that I see and read and have contact \nwith are under the assumption that, and don&#39;t get me wrong they may \nbe 100% correct that all evp are formed the same way with the spirit \nusing whatever form of ambient energy is available to form a message \nwhether it be artificially supplied by the researcher or natural such \nas emf energy.\nI do subscribe to this theory that spirits do need some sort of \nenergy to form words and place them onto our recording medium, that \nis not my dispute.\nI also believe that the majority of researchers believe an evp is an \nevp and the only valid evp is the one that can be heard loudly and \nclearly from the raw recording, I do not believe in this ideology. I \nbelieve there are two distinct and different ways we receive evp one \nfrom the physical plane and one from the spiritual plane. I believe \nthat the only way to receive what has been classified as a class A \nevp is from an earthbound or grounded spirit that is actually \nhaunting a location and is capable of utilizing the energy in the \nlocation much more efficiently for the reason that the spirit is \namong the investigator and can take advantage of the close proximity \nto the recording device and feed off of the physical and ambient \nenergy supplied by the individual or individuals in the recording \narea. I also suspect that at times if we are lucky enough to be doing \na recording at the right time we can record a class A evp from a \nspirit that is not grounded but in visitation at that time.\nBut the class A & B++ evps must be obtained from a spirit that is \noccupying the same area as the recording device.\nthe second type of evp is the spiritual plane evp, messages recorded \nfrom spirits that have crossed over and are in the spiritual world, I \nbelieve they are still capable of sending evp messages from the \nspirit world only they must also use the ambient energy surrounding \nthe recorder or compile it and place it onto the recorder. In other \nwords a much harder and less effective method for the spirit leaving \nthe message. Therefore the messages we receive in this manner are \noften weak quiet and a bit distorted but they are there.\nIf we take the time to look for them and clean them up most of them \nare understandable also the majority of these messages tend to be of \na personal nature most likely from friends or loved ones that have \ncrossed. The only thing that stops these messages from being \ndiscovered is that almost all the paranormal community subscribes to \nthe idea that the only valid evp is the class A evp that does not \nneed to be cleaned or enhanced in any way.\nThere are many evp researchers out there I&#39;m sure that have started \nand adhered to the method of evp capture that they first learned \nabout in a book or on the Internet and have not for lack of \ninformation or the opportunity to learn how to edit a recording using \nan audio editing program stuck to the strict set of recording \ntechniques that are mostly explained on the net in one form or \nanother. And I also believe that they witness the systematic \nslaughter of anyone who dares to post or mention any new or radical \nidea or form of evp capture so they shy away from taking the leap and \ntrying some new or seldom recognized method and stick to the &quot;OLD&quot; \nand most widely accepted method out of fear of being ostracised \namo9ng their paranormal peers and I do mean peers , No one in this \nfield is any better than the next person there are only PI&#39;s with \nmore experience and ones with less but some with the more experience \ngo through the motions of investigation with blinders on following an \nantiquated set of investigatory and research rules and not opening \ntheir minds to anything else.\nMy theory of the two different types of evp is formed from my \npersonal experience with different methods of recording and capture \nand I have evps that are very personal in nature mentioning my name \nas well as subject matter unique to me and my family that would have \nbeen totally over looked if not for a good editing session.\nNO one can make me believe especially the so called seasoned veterans \nthat an evp that mentions my name and that of friends and or loved \nones can be randomly put together from editing filters being used on \nraw static.\nWell those are my thought on evp please do not hesitate to let me \nknow what you think of this theory.\nBruce halliday"}