{"id": "15910", "subject": "LIVE INTERACTIVE PARANORMAL EVENT- Saturday September 5th with John Zaffis", "author": "bulletbabea", "timestamp": "2009-09-04T06:41:11Z", "full_text": "--1-8297860245-6403632356=:0\r\nContent-Type: text/plain; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nWHO:\nCome join John Zaffis, Dave and Tom Jones from KAPS Paranormal Radio,\n=\r\nPara-x Radio, CBS Psychic Radio, PARA - the Paranormal Association of\nResea=\r\nrch & Assistance, Shannon and Jeff Sylvia, Beth Brown, Strange\nFrequencies =\r\nRadio, Photographer Paul Michael Kane, LeeAnn Ball and\nAngela Ghataora of S=\r\npirited History Radio, Aaron Sagers and many others\nfor an all night event =\r\nunlike anything they&#39;ve ever done before.\n\nWHAT:\nLIVE interactive ghosthunt=\r\ns, investigations and fund raising events\nbeing held this weekend and broad=\r\ncast online for your viewing pleasure.\nCome be part of the event with a fro=\r\nnt row seat!\n\nWHEN:\nSaturday September 5th starting at 4pm EST\n\nWHERE:\nhttp=\r\n://www.paranormaltvnetwork.com\n\nWHY:\nThe paranormal community is banding to=\r\ngether this weekend to host a live\nevent at Fort Mifflin to raise funds for=\r\n its restoration and upkeep.\nKnown as the &quot;Fort That Saved America&quot; as well=\r\n as one of America&#39;s most\nhaunted historical locations, Fort Mifflin is und=\r\ner attack from it&#39;s\nbattle against an enemy unlike any other its faced befo=\r\nre... TIME. The\nparanormal community is hosting this event to raise funds t=\r\nhere on\nlocation and help preserve this historical landmark for our country=\r\n as\nwell as all future paranormal investigators who wish to walk in its\nhal=\r\nls.\n\nHOW:\nThey will be hosting and broadcasting an all day event into the n=\r\night\nwith a live interactive paranormal investigation. They will be showing=\r\n\ntheir live auction, broadcasting radio shows, a telethon, an interactive\nh=\r\nistory at each of the buildings at the location, there will an EVP lab\nand =\r\na photography lab, as well as many other surprises.\n\nCOST TO YOU:\nFREE!!!!!=\r\n\nIts free to come hang out, watch, chat, join in the interactive\ninvestigat=\r\nions, and show your support for what these folks are doing.\nIt&#39;s going to b=\r\ne a blast. Feel free to pass this info on.\n\nOk I think I covered almost eve=\r\nrything. I told you guys I would let you\nknow when the next one was and I g=\r\not as many details about it as I could\nfor you. Hope to see ya there on PTN=\r\n Paranormal Television Network. I\nlove it when folks join together and make=\r\n a difference!!! My thanks to\neveryone at PTN for hosting such interesting =\r\nevents and supporting our\nparanormal community. I never get bored there is =\r\nalways something new\ngoing on over there and ya meet lots of interesting pe=\r\nople!\n\nMisty\n\n\n\n\r\n--1-8297860245-6403632356=:0\r\nContent-Type: text/html; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;b&gt;&lt;font color=3D&quot;#0000ff&quot;&gt;&lt;u&gt;WHO:&lt;/u&gt;&lt;/font&gt;&lt;br&gt;&lt;/b&gt;Come join John Zaffis,=\r\n Dave and Tom Jones from KAPS Paranormal Radio,\nPara-x Radio, CBS Psychic R=\r\nadio, PARA - the Paranormal Association of\nResearch &amp; Assistance, Shann=\r\non and Jeff Sylvia, Beth Brown, Strange\nFrequencies Radio, Photographer Pau=\r\nl Michael Kane, LeeAnn Ball and\nAngela Ghataora of Spirited History Radio, =\r\nAaron Sagers and many others for an all night event unlike anything they&#39;ve=\r\n ever done before.&lt;br&gt;&lt;br&gt;&lt;font color=3D&quot;#0000ff&quot;&gt;&lt;u&gt;&lt;b&gt;WHAT:&lt;/b&gt;&lt;/u&gt;&lt;/font=\r\n&gt;&lt;br&gt;LIVE interactive ghosthunts, investigations and fund raising events be=\r\ning held this weekend and broadcast online for your viewing pleasure. Come =\r\nbe part of the event with a front row seat!&lt;br&gt;&lt;br&gt;&lt;font color=3D&quot;#0000ff&quot;&gt;=\r\n&lt;u&gt;&lt;b&gt;WHEN:&lt;/b&gt;&lt;/u&gt;&lt;/font&gt;&lt;br&gt;Saturday September 5th starting at 4pm EST&lt;br=\r\n&gt;&lt;br&gt;&lt;font color=3D&quot;#0000ff&quot;&gt;&lt;u&gt;&lt;b&gt;WHERE:&lt;/b&gt;&lt;/u&gt;&lt;/font&gt;&lt;br&gt;http://www.para=\r\nnormaltvnetwork.com&lt;br&gt;&lt;br&gt;&lt;font color=3D&quot;#0000ff&quot;&gt;&lt;b&gt;&lt;u&gt;WHY:&lt;/u&gt;&lt;/b&gt;&lt;/font=\r\n&gt;&lt;br&gt;The paranormal community is banding together this weekend to host a li=\r\nve event at Fort Mifflin to raise funds for its restoration and upkeep. Kno=\r\nwn as the &quot;Fort That Saved America&quot; as well as one of America&#39;s most haunte=\r\nd historical locations, Fort Mifflin is under attack from it&#39;s battle again=\r\nst an enemy unlike any other its faced before... TIME. The paranormal commu=\r\nnity is hosting this event to raise funds there on location and help preser=\r\nve this historical landmark for our country as well as all future paranorma=\r\nl investigators who wish to walk in its halls. &lt;br&gt;&lt;br&gt;&lt;font color=3D&quot;#0000=\r\nff&quot;&gt;&lt;b&gt;&lt;u&gt;HOW:&lt;/u&gt;&lt;/b&gt;&lt;/font&gt;&lt;br&gt;They will be hosting and broadcasting an a=\r\nll day event into the night with a live interactive paranormal investigatio=\r\nn. They will be showing their live auction, broadcasting radio shows, a tel=\r\nethon, an interactive history at each of the buildings at the location, the=\r\nre will an EVP lab and a photography lab, as well as many other surprises.&lt;=\r\nbr&gt;&lt;br&gt;&lt;font color=3D&quot;#0000ff&quot;&gt;&lt;u&gt;&lt;b&gt;COST TO YOU:&lt;/b&gt;&lt;/u&gt;&lt;/font&gt;&lt;br&gt;FREE!!!=\r\n!!&lt;br&gt;Its free to come hang out, watch, chat, join in the interactive inves=\r\ntigations, and show your support for what these folks are doing. It&#39;s going=\r\n to be a blast. Feel free to pass this info on.&lt;br&gt;&lt;br&gt;Ok I think I covered=\r\n almost everything. I told you guys I would let you know when the next one =\r\nwas and I got as many details about it as I could for you. Hope to see ya t=\r\nhere on PTN Paranormal Television Network. I love it when folks join togeth=\r\ner and make a difference!!! My thanks to everyone at PTN for hosting such i=\r\nnteresting events and supporting our paranormal community. I never get bore=\r\nd there is always something new going on over there and ya meet lots of int=\r\neresting people!&lt;br&gt;&lt;br&gt;Misty&lt;br&gt;&lt;br&gt;&lt;br&gt;\n\r\n--1-8297860245-6403632356=:0--"}