{"id": "1592", "subject": "Re: [EVP-ITC] Re: thanks for the reply frank", "author": "Lisby", "timestamp": "2007-07-15T18:53:51Z", "full_text": "Steve, I&#39;ve known Frank for about 4 years and I consider him a  \nfriend. He knows I stand behind him. I did before there were boxes  \nand I will after there are boxes. I did EVP research for years--I got  \nmy first reel-to-reel from Sarah Estep&#39;s late husband if that dates  \nme at all. So please don&#39;t mistake my good natured teasing of Frank  \nfor making demands on him. I know perfectly well that whatever  \nhappens will happen--or not--and I am perfectly at peace with that.\n\nAnn\n\nOn Jul 15, 2007, at 1:50 AM, Steve Hultay wrote:\n\n&gt; I personally think begging for a box from Frank is probably just\n&gt; pissing him off. He will give a box to whom he feels is doing\n&gt; research on their own and deserves one being they already have a\n&gt; clientel on the other side without his help. This is just my\n&gt; opinion and i really don&#39;t mean to offend people, but everybody can\n&gt; try to say the right thing to persuade Frank, but he is looking for\n&gt; true researchers in ITC and not someone who just wants to have what\n&gt; nobody can make themself. It&#39;s just annoying seeing people everyday\n&gt; saying where&#39;s my box? There is plenty of research to do without it\n&gt; and capable people to build them too. Find them and stop begging on\n&gt; this board, this is not what it is for and i&#39;m not speaking for\n&gt; Frank in any way. But i&#39;d rather hear someone&#39;s Manual sweeps or\n&gt; something through EVP maker rather than groveling with no attempt to\n&gt; do anything for themselves. Just my take on it and i&#39;m sorry if i\n&gt; pissed anybody off.\n&gt;\n&gt; -Steve H.\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, Lisby &lt;lisby@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Give one to Bruce before me, Frank. He&#39;s a great guy and he\n&gt; deserves\n&gt; &gt; it a lot more; he&#39;s got more time for research and a lot of\n&gt; friends\n&gt; &gt; on the others side he wants and needs to talk to.\n&gt; &gt;\n&gt; &gt; Ann\n&gt; &gt;\n&gt; &gt; On Jul 14, 2007, at 6:10 PM, bhali333 wrote:\n&gt; &gt;\n&gt; &gt; &gt; hey Frank,\n&gt; &gt; &gt; thanks for the reply to my post. I am disabled from toxins I\n&gt; breathed\n&gt; &gt; &gt; at ground zero during rescue and recovery efforts, I was a first\n&gt; &gt; &gt; responder so we got the worst of it and it has left me with a\n&gt; lung\n&gt; &gt; &gt; disease and two heart attacks but I&#39;m not handicaped I have total\n&gt; &gt; &gt; mobility I just have to take it easy. So as you may see I have\n&gt; alot of\n&gt; &gt; &gt; time for experimenting and have been doing evp research as well\n&gt; as itc\n&gt; &gt; &gt; for some time now and your box has touched a special cord with\n&gt; me it\n&gt; &gt; &gt; just feels like I should have and be using one. Don&#39;t ask me to\n&gt; &gt; &gt; explain\n&gt; &gt; &gt; it&#39;s just this wierd feeling like something is telling me you\n&gt; are\n&gt; &gt; &gt; meant\n&gt; &gt; &gt; to use this tool. If you can ever see your way clear as to\n&gt; building\n&gt; &gt; &gt; one\n&gt; &gt; &gt; for me I would be more than glad to pay for your time labor and\n&gt; &gt; &gt; materials and would be forever appreciative.\n&gt; &gt; &gt;\n&gt; &gt; &gt; your friend\n&gt; &gt; &gt; Bruce Halliday\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; Yahoo! Groups Links\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;\n&gt; \n\n\nS e e, I' e known F ank o abou 4 yea s and I conside him a iend. He knows I s and behind him. I did be o e he e we e boxes and I will a e he e a e boxes. I did EVP esea ch o yea s--I go my i s eel- o- eel om Sa ah Es ep's la e husband i ha da es me a all. So please don' mis ake my good na u ed easing o F ank o making demands on him. I know pe ec ly well ha wha e e happens will happen--o no --and I am pe ec ly a peace wi h ha .AnnOn Jul 15, 2007, a 1:50 AM, S e e Hul ay w o e:I pe sonally hink begging o a box om F ank is p obably jus pissing him o . He will gi e a box o whom he eels is doing esea ch on hei own and dese es one being hey al eady ha e a clien el on he o he side wi hou his help. This is jus my opinion and i eally don' mean o o end people, bu e e ybody can y o say he igh hing o pe suade F ank, bu he is looking o ue esea che s in ITC and no someone who jus wan s o ha e wha nobody can make hemsel . I 's jus annoying seeing people e e yday saying whe e's my box? The e is plen y o esea ch o do wi hou i and capable people o build hem oo. Find hem and s op begging on his boa d, his is no wha i is o and i'm no speaking o F ank in any way. Bu i'd a he hea someone's Manual sweeps o some hing h ough EVP make a he han g o eling wi h no a emp o do any hing o hemsel es. Jus my ake on i and i'm so y i i pissed anybody o .-S e e H.--- In EVP-ITC@yahoog oups.com, Lisby w o e:>> Gi e one o B uce be o e me, F ank. He's a g ea guy and he dese es > i a lo mo e; he's go mo e ime o esea ch and a lo o iends > on he o he s side he wan s and needs o alk o.> > Ann> > On Jul 14, 2007, a 6:10 PM, bhali333 w o e:> > > hey F ank,> > hanks o he eply o my pos . I am disabled om oxins I b ea hed> > a g ound ze o du ing escue and eco e y e o s, I was a i s > > esponde so we go he wo s o i and i has le me wi h a lung> > disease and wo hea a acks bu I'm no handicaped I ha e o al> > mobili y I jus ha e o ake i easy. So as you may see I ha e alo o > > ime o expe imen ing and ha e been doing e p esea ch as well as i c> > o some ime now and you box has ouched a special co d wi h me i > > jus eels like I should ha e and be using one. Don' ask me o > > explain> > i 's jus his wie d eeling like some hing is elling me you a e > > mean > > o use his ool. I you can e e see you way clea as o building > > one> > o me I would be mo e han glad o pay o you ime labo and> > ma e ials and would be o e e app ecia i e.> >> > you iend> > B uce Halliday> >> >> >> >> > Yahoo! G oups Links> >> >> >>"}