{"id": "15946", "subject": "Re: Better comunications,", "author": "mrscaptainjack2", "timestamp": "2009-09-11T01:10:39Z", "full_text": "I have a question:  I&#39;ve read on one website that it&#39;s better to limit your sessions to ten minutes (because it&#39;s supposedly exhausting to the entities to communicate), and I&#39;ve read in the manual for the minibox (I think) that it takes a couple of hours for the entities to really get going.  Which would you guys say is more correct?  I know it would wear me out to listen back to more than ten or fifteen minutes, as it&#39;s such an exhausting process to go over the tape!\n\nAlso, I&#39;ve been putting off doing another session for weeks and weeks.  First I was sick with the flu, then I was tired every day...and I know it&#39;s better to be well rested, in a good mood, etc. when doing a session.  Now I&#39;m about ready to try again, and I am wondering if I&#39;ve maybe lost my &quot;Steve&quot; guy (the entity whom I don&#39;t know and wasn&#39;t related to).  The last time I did a session, he was rather flippant, giving me a bunch of bullshit answers, so I think I&#39;d like to lose him and give some other entities (or hopefully my relatives) a chance to speak.  Has anyone here had one entity who monopolized things?  Did it go away when you quit for a while?  I&#39;ve read some posts in other places where people refer to a &quot;tech&quot;.  Could Steve be my &quot;tech?&quot;  What&#39;s a tech?  A helper on the other side?  I wouldn&#39;t want to get rid of my &quot;tech&quot; inadvertently, but right now I&#39;m thinking Steve is more of a nuisance than a helper!  I&#39;d love to hear you guys&#39; opinion about this!\n\nP.S. -- Frank, have a safe trip!\n\n\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, SnowfireL@... wrote:\n&gt;\n&gt; One of the list member notes that we all seem to be getting better  \n&gt; communications, &quot;communication is starting to move  away from the basic one and two \n&gt; word messages and answers and becoming more  detailed in it&#39;s content.I \n&gt; suggest that we all try to  dedicate one certain topic per session and attempt \n&gt; to gather as much information  as we can on that specific topic.&quot;\n&gt;  \n&gt; This seems to be a great idea,  I  wonder if me leaving them to watch TV \n&gt; sometimes, and letting them watch the  baseball games of their choice helps, \n&gt; it allows them  to practice using the  radio for an extended period of time, \n&gt; and talk amongst themselves when I am not  in the same room, once and awhile \n&gt; I will hear them saying something about me, or  one is asking another &quot;what \n&gt; is she doing&quot; someone will say, &quot;she&#39;s in her room,  on the phone,&quot; \n&gt; sometimes they ask what or when I&#39;m going to fix dinner, or what  I am cooking.  \n&gt; It&#39;s kind of cool, they can also shut it down when they are  pestered by \n&gt; negative people or abusive&#39;s, some of which say they are &quot;in jail&quot;  over there.  \n&gt; Sometimes. they want to know, &quot;when will you record&quot; I  guess, they kind of \n&gt; like lining up to say names and such, or they say, as the  recording is \n&gt; ending, &quot;it&#39;s over all ready&quot; :( in a sad tone of voice.)   It&#39;s nice hearing so \n&gt; many people, saying &quot;I love you&quot; never knew I had so many  friends, it&#39;s \n&gt; nice!  sf\n&gt;"}