{"id": "1595", "subject": "Re: responce to comment by steve h.", "author": "Steve Hultay", "timestamp": "2007-07-15T19:05:44Z", "full_text": "Ok, it wasn&#39;t directed at you personally as you are not the only one \nasking for a box.  I offered you my version of the box even though i \ndon&#39;t know you and i paid to have it built, but you wouldn&#39;t drive \n15-20 minutes away to come get it.  Let me post a bit of your e-mail \nfrom back in march about the box.\nYou Wrote:\n\nI took a look at the schematics for the box you mentioned and all it \nis is a white noise transever. it collects a signal and emmits white \nnoise in actuality it is an am radio tuned to an off station. a \nradio shack hand held transister radio will do exactly the same \nthing. I do extensive evp research and you will never hear a spirit \nvoice just because you are listening to white noise or any other \ncolor noise for that matter if you can hear a spirit voice without \nthe aid of a voice recorder then the spirit is capable of forming \nthe voice in the first place and you would hear it without any \nassistance. most spirit voices are captured as evp on recorders and \neven then need some editing help most of the time to decifer them, I \nhave heard voices of spirits at investigation locations with my \nnaked ear and caught it on the recorder as well. so if your gonna \nhear them your gonna hear them !\n__________________________\n\nDoes that sound familiar?  I guess i was more interested than you \nhuh?  Shot it right down and made fun of the idea, so i guess a \nperson who doesn&#39;t believe in the box should get one...your right.  \nI was interested in doing investigations and needed a team to join \nto gain experience and that&#39;s why i contacted you.  As far as \nripping off Frank&#39;s design, i don&#39;t even know his design to begin \nwith.  I&#39;m not an engineer, i was just looking for help just like \neveryone else and happened to find it.  And i even gave you my \ncontact for my box.  Different box and different results, not a rip \noff it&#39;s just another persons idea and that&#39;s what this about.  I&#39;m \nsorry i don&#39;t have all your experience, i&#39;m only 33 and just have \nrecently started documenting stuff.  And my web site i built myself \nand am pretty proud of it.  All the EVP&#39;s on there are from the past \nmonth and a half of research.  I&#39;m sorry you don&#39;t get results like \nthat, that&#39;s not my fault.\n\nI&#39;m sorry Misty, but i had to defend myself.  I was trying to get \nthe board back to what it was meant to be, peoples research and \ndifferent ideas and not how many times we can ask Frank for a box.\n\n-Steve\n\n\n\n\n\n\n\n\n--- In EVP-ITC@...m, &quot;bhali333&quot; \n&lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; Steve,\n&gt; I know that your post about &quot;begging for a box&quot; was directed at \nme. \n&gt; Frankly I am insulted, I thought we had developed a somewhat off \nthe \n&gt; group friendship. Your response to my post to frank for a box was \nnot \n&gt; begging but I believe that your obvious attempt at ass kissing is \n&gt; more insulting to frank than my asking for a box. it seems to me \nthat \n&gt; you are afraid that I may get a box before you do and that for \nsome \n&gt; reason you deserve one more than anyone else. I don&#39;t understand \nthat \n&gt; being you already ripped off franks design and had some one build \nyou \n&gt; a number of boxes on your own. As far as serious evp research goes \nI \n&gt; have dedicated many many hours, much more than you have I&#39;m sure \nto \n&gt; evp research and other forms of itc. matter of fact if anyone \ntakes a \n&gt; look at your site the couple of dust orb pictures you have and the \n&gt; only evps I have heard are recent ones gleaned from the boxes you \nhad \n&gt; made do not make you a dedicated seasoned pro at PI. I also \nremember \n&gt; not long ago you contacting me for advice and asking to join my \nteam \n&gt; so in some way you must have recognised my professionalism. I will \n&gt; end by saying, If you want a box from frank be honest and ask like \nI \n&gt; did instead of trying to cuddle up next to him with your own \nversion \n&gt; of his box and make it like you care about his feelings or \nprotecting \n&gt; him from any annoyances. who made you the frank police anyway. \nsteve \n&gt; just be real lets all work together and help each other do not try \nto \n&gt; sabotage anyone else hoping to further your own ambitions, you \nwork \n&gt; with auto parts all day while I am doing evp research so you tell \nme \n&gt; who is more qualified to work with the box me or you?\n&gt; \n&gt; I hope I didn&#39;t piss anybody off this is just my opinion!\n&gt; \n&gt; bruce\n&gt;"}