{"id": "15959", "subject": "Re: Is there anybody out there?", "author": "bulletbabea", "timestamp": "2009-09-15T10:50:09Z", "full_text": "Hiya Jill. yep everyone had a busy weekend. Many out of town at the various events or dealing with family and work. Some are recovering from having too much fun.\n\nA tech in reference to evp usually represents what some others call a guide. A helper of sorts whether its just to get information or to help resolve an issue. They often appear over and over and act as a &quot;lead&quot; for the group of speakers.\n\nAs for how long you record personally I have to say short is better. I find that spirits speak in bursts of energy and if I record for long periods of time I get very little but if I record for a short period of time they make much better use of that time. Also it is much easier to analyze short recordings in depth.\n\nThe only time Ive recorded long sessions is if I am in a group or circle and want to record whats being said by us as well as spirit. Being out on investigations one might choose to record there longer as you document your investigation but for straight evp work i usually do between 30 seconds and 3 minutes and no longer. They use the time wisely. And the voices are much louder. When doing the group or circle such as with a medium they also have been loud as we were but again its much more energy in the room when doing those things.\n\nAgain its just my viewpoint and others may think differently or have different experiences. Hope that helps!\n\nMisty\n\n--- In EVP-ITC@yahoogroups.com, &quot;mrscaptainjack2&quot; &lt;jjkamp@...&gt; wrote:\n&gt;\n&gt; Hi guys!  I didn&#39;t receive any response to my last question, and maybe that&#39;s because everyone is busy with real life and whatnot.  I know some of you were out of town, so I thought I&#39;d post my question again, hoping someone will be kind enough to offer his or her infinite wisdom and opinions.\n&gt; \n&gt; What is a &quot;tech,&quot; and is it desirable to have one?  Is this like a helper on the other side? I&#39;ve tried googling this, but haven&#39;t found anything about this anywhere. \n&gt; \n&gt; Do you guys find that it&#39;s better to do short sessions (15 minutes) or long ones (two hours)?  Do the entities get exhausted quickly, or do they have to get going and need time to do it?\n&gt; \n&gt; Thanks in advance for you answers!\n&gt; \n&gt; Jill\n&gt;"}