{"id": "15965", "subject": "Re: Is there anybody out there?", "author": "mrscaptainjack2", "timestamp": "2009-09-15T20:06:53Z", "full_text": "Thanks, Misty!\n\nI had a guy named Steve come through almost every session, so maybe he was my &quot;tech.&quot;  The last session I had before the dry spell (when I quit for a while due to sickness), Steve was sort of flippant and gave a bunch of stupid answers, so now I&#39;m kind of hoping he&#39;s gone on vacation.  But I did two sessions yesterday, and very little came through except for being told that a family friend has died (I&#39;m waiting to see if that bit of prediction has come true).  So maybe, like you said, Steve &quot;led&quot; everyone and made things come through clearer.  I guess time will tell.  If he&#39;d behave himself, I&#39;d welcome him back.\n\nSo I&#39;m wondering, what&#39;s the rationale behind this comment:\n\nFirst, the MiniBox works best with time.  If you do not have two hours to devote to a session, you might be disappointed.  You should have the device running in the place you will be using it for at least 15 minutes; during this time you can fine tune settings and volume. Never expect the Box to &quot;Hit the ground running,&quot; so to speak; it happens occasionally, that an operator can turn on the box and get an immediate message, but it hasn&#39;t happened often in the ASUP&#39;s tests.\n\nhttp://www.asup-inc.org/interimminiboxreport.htm\n\nI can&#39;t imagine the above quote is good advice.  The very first moment I turned on my little hacked box, I got a clear, loud message:  I see you.  It freaked me out so bad, I turned it off immediately and it took three days to work up the nerve to try again!  So I don&#39;t know what these people are talking about, that you can&#39;t hit the ground running.  I&#39;ve read about lots of folks doing just that.\n\nI was kind of thinking that shorter was better, too, but I wanted to make sure, because if I was wrong, maybe letting it run a long time might get even better responses...but yeah, I think they get tired, as it probably takes a lot of effort to form those words.\n\nI was also thinking all those skeptics who say the boxes don&#39;t work are probably not treating their sessions like EVP -- I can never hear much of anything during the session, only afterward when I listen back and at very high volume.  At least for me, most of the bulk of the communication is very, very quiet and located in between the louder snippets of strong-signaled radio announcer voices.  I imagine it might be louder and clearer if I took my set-up to a haunted location (or some place lots of human emotions were felt), but since my set-up isn&#39;t really geared for that, I haven&#39;t done it yet.   \n\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;bulletbabea&quot; &lt;bulletbabea@...&gt; wrote:\n&gt;\n&gt; Hiya Jill. yep everyone had a busy weekend. Many out of town at the various events or dealing with family and work. Some are recovering from having too much fun.\n&gt; \n&gt; A tech in reference to evp usually represents what some others call a guide. A helper of sorts whether its just to get information or to help resolve an issue. They often appear over and over and act as a &quot;lead&quot; for the group of speakers.\n&gt; \n&gt; As for how long you record personally I have to say short is better. I find that spirits speak in bursts of energy and if I record for long periods of time I get very little but if I record for a short period of time they make much better use of that time. Also it is much easier to analyze short recordings in depth.\n&gt; \n&gt; The only time Ive recorded long sessions is if I am in a group or circle and want to record whats being said by us as well as spirit. Being out on investigations one might choose to record there longer as you document your investigation but for straight evp work i usually do between 30 seconds and 3 minutes and no longer. They use the time wisely. And the voices are much louder. When doing the group or circle such as with a medium they also have been loud as we were but again its much more energy in the room when doing those things.\n&gt; \n&gt; Again its just my viewpoint and others may think differently or have different experiences. Hope that helps!\n&gt; \n&gt; Misty\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;mrscaptainjack2&quot; &lt;jjkamp@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hi guys!  I didn&#39;t receive any response to my last question, and maybe that&#39;s because everyone is busy with real life and whatnot.  I know some of you were out of town, so I thought I&#39;d post my question again, hoping someone will be kind enough to offer his or her infinite wisdom and opinions.\n&gt; &gt; \n&gt; &gt; What is a &quot;tech,&quot; and is it desirable to have one?  Is this like a helper on the other side? I&#39;ve tried googling this, but haven&#39;t found anything about this anywhere. \n&gt; &gt; \n&gt; &gt; Do you guys find that it&#39;s better to do short sessions (15 minutes) or long ones (two hours)?  Do the entities get exhausted quickly, or do they have to get going and need time to do it?\n&gt; &gt; \n&gt; &gt; Thanks in advance for you answers!\n&gt; &gt; \n&gt; &gt; Jill\n&gt; &gt;\n&gt;"}