{"id": "15960", "subject": "Re: [EVP-ITC] Re: Is there anybody out there?", "author": "Frank Ratka", "timestamp": "2009-09-15T12:48:43Z", "full_text": "--0-2063914664-1253018923=:18269\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nI was wondering if anyone alive was still on this site. LOL All I have hear=\r\nd was crickets for the past couple days.\n\nFrank R.\n\n\n\n\n____________________=\r\n____________\nFrom: bulletbabea &lt;bulletbabea@...&gt;\nTo: EVP-ITC@yahoogro=\r\nups.com\nSent: Tuesday, September 15, 2009 5:50:09 AM\nSubject: [EVP-ITC] Re:=\r\n Is there anybody out there?\n\n=A0 \nHiya Jill. yep everyone had a busy weeke=\r\nnd. Many out of town at the various events or dealing with family and work.=\r\n Some are recovering from having too much fun.\n\nA tech in reference to evp =\r\nusually represents what some others call a guide. A helper of sorts whether=\r\n its just to get information or to help resolve an issue. They often appear=\r\n over and over and act as a &quot;lead&quot; for the group of speakers.\n\nAs for how l=\r\nong you record personally I have to say short is better. I find that spirit=\r\ns speak in bursts of energy and if I record for long periods of time I get =\r\nvery little but if I record for a short period of time they make much bette=\r\nr use of that time. Also it is much easier to analyze short recordings in d=\r\nepth.\n\nThe only time Ive recorded long sessions is if I am in a group or ci=\r\nrcle and want to record whats being said by us as well as spirit. Being out=\r\n on investigations one might choose to record there longer as you document =\r\nyour investigation but for straight evp work i usually do between 30 second=\r\ns and 3 minutes and no longer. They use the time wisely. And the voices are=\r\n much louder. When doing the group or circle such as with a medium they als=\r\no have been loud as we were but again its much more energy in the room when=\r\n doing those things.\n\nAgain its just my viewpoint and others may think diff=\r\nerently or have different experiences. Hope that helps!\n\nMisty\n\n--- In EVP-=\r\nITC@yahoogroups .com, &quot;mrscaptainjack2&quot; &lt;jjkamp@...&gt; wrote:\n&gt;\n&gt; Hi guys! I =\r\ndidn&#39;t receive any response to my last question, and maybe that&#39;s because e=\r\nveryone is busy with real life and whatnot. I know some of you were out of =\r\ntown, so I thought I&#39;d post my question again, hoping someone will be kind =\r\nenough to offer his or her infinite wisdom and opinions.\n&gt; \n&gt; What is a &quot;te=\r\nch,&quot; and is it desirable to have one? Is this like a helper on the other si=\r\nde? I&#39;ve tried googling this, but haven&#39;t found anything about this anywher=\r\ne. \n&gt; \n&gt; Do you guys find that it&#39;s better to do short sessions (15 minutes=\r\n) or long ones (two hours)? Do the entities get exhausted quickly, or do th=\r\ney have to get going and need time to do it?\n&gt; \n&gt; Thanks in advance for you=\r\n answers!\n&gt; \n&gt; Jill\n&gt;\n\n\n\n\n\n      \r\n--0-2063914664-1253018923=:18269\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;&lt;head&gt;&lt;style type=3D&quot;text/css&quot;&gt;&lt;!-- DIV {margin:0px;} --&gt;&lt;/style&gt;&lt;/he=\r\nad&gt;&lt;body&gt;&lt;div style=3D&quot;font-family:times new roman, new york, times, serif;=\r\nfont-size:12pt&quot;&gt;&lt;DIV&gt;I was wondering if anyone alive was still on this site=\r\n. LOL All I have heard was crickets for the past couple days.&lt;/DIV&gt;\n&lt;DIV&gt;&n=\r\nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Frank R.&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV style=3D&quot;FONT-FAMILY: times new rom=\r\nan, new york, times, serif; FONT-SIZE: 12pt&quot;&gt;&lt;BR&gt;\n&lt;DIV style=3D&quot;BORDER-LEFT=\r\n: #1010ff 2px solid; MARGIN: 5px 0px 5px 5px; PADDING-LEFT: 5px; FONT-FAMIL=\r\nY: times new roman, new york, times, serif; FONT-SIZE: 12pt&quot;&gt;&lt;FONT size=3D2=\r\n face=3DTahoma&gt;\n&lt;HR SIZE=3D1&gt;\n&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: bold&quot;&gt;From:&lt;/S=\r\nPAN&gt;&lt;/B&gt; bulletbabea &lt;bulletbabea@...&gt;&lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FON=\r\nT-WEIGHT: bold&quot;&gt;To:&lt;/SPAN&gt;&lt;/B&gt; EVP-ITC@yahoogroups.com&lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D=\r\n&quot;FONT-WEIGHT: bold&quot;&gt;Sent:&lt;/SPAN&gt;&lt;/B&gt; Tuesday, September 15, 2009 5:50:09 AM=\r\n&lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: bold&quot;&gt;Subject:&lt;/SPAN&gt;&lt;/B&gt; [EVP-ITC] Re: =\r\nIs there anybody out there?&lt;BR&gt;&lt;/FONT&gt;&lt;BR&gt;&lt;SPAN style=3D&quot;DISPLAY: none&quot;&gt;&nb=\r\nsp;&lt;/SPAN&gt; \n&lt;DIV id=3Dygrp-text&gt;\n&lt;P&gt;Hiya Jill. yep everyone had a busy week=\r\nend. Many out of town at the various events or dealing with family and work=\r\n. Some are recovering from having too much fun.&lt;BR&gt;&lt;BR&gt;A tech in reference =\r\nto evp usually represents what some others call a guide. A helper of sorts =\r\nwhether its just to get information or to help resolve an issue. They often=\r\n appear over and over and act as a &quot;lead&quot; for the group of speakers.&lt;BR&gt;&lt;BR=\r\n&gt;As for how long you record personally I have to say short is better. I fin=\r\nd that spirits speak in bursts of energy and if I record for long periods o=\r\nf time I get very little but if I record for a short period of time they ma=\r\nke much better use of that time. Also it is much easier to analyze short re=\r\ncordings in depth.&lt;BR&gt;&lt;BR&gt;The only time Ive recorded long sessions is if I =\r\nam in a group or circle and want to record whats being said by us as well a=\r\ns spirit. Being out on investigations one might choose to record there long=\r\ner as you document your\n investigation but for straight evp work i usually =\r\ndo between 30 seconds and 3 minutes and no longer. They use the time wisely=\r\n. And the voices are much louder. When doing the group or circle such as wi=\r\nth a medium they also have been loud as we were but again its much more ene=\r\nrgy in the room when doing those things.&lt;BR&gt;&lt;BR&gt;Again its just my viewpoint=\r\n and others may think differently or have different experiences. Hope that =\r\nhelps!&lt;BR&gt;&lt;BR&gt;Misty&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=3D&quot;mailto:EVP-ITC%40yahoogroups.c=\r\nom&quot; rel=3Dnofollow target=3D_blank ymailto=3D&quot;mailto:EVP-ITC%40yahoogroups.=\r\ncom&quot;&gt;EVP-ITC@yahoogroups .com&lt;/A&gt;, &quot;mrscaptainjack2&quot; &lt;jjkamp@...&gt; wro=\r\nte:&lt;BR&gt;&gt;&lt;BR&gt;&gt; Hi guys! I didn&#39;t receive any response to my last quest=\r\nion, and maybe that&#39;s because everyone is busy with real life and whatnot. =\r\nI know some of you were out of town, so I thought I&#39;d post my question agai=\r\nn, hoping someone will be kind enough to offer his or her infinite wisdom a=\r\nnd opinions.&lt;BR&gt;&gt;\n &lt;BR&gt;&gt; What is a &quot;tech,&quot; and is it desirable to hav=\r\ne one? Is this like a helper on the other side? I&#39;ve tried googling this, b=\r\nut haven&#39;t found anything about this anywhere. &lt;BR&gt;&gt; &lt;BR&gt;&gt; Do you guy=\r\ns find that it&#39;s better to do short sessions (15 minutes) or long ones (two=\r\n hours)? Do the entities get exhausted quickly, or do they have to get goin=\r\ng and need time to do it?&lt;BR&gt;&gt; &lt;BR&gt;&gt; Thanks in advance for you answer=\r\ns!&lt;BR&gt;&gt; &lt;BR&gt;&gt; Jill&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/P&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/div&gt;&lt;br&gt;\n\n =\r\n     &lt;/body&gt;&lt;/html&gt;\r\n--0-2063914664-1253018923=:18269--"}