{"id": "15966", "subject": "Re: Is there anybody out there?", "author": "kolrone", "timestamp": "2009-09-15T20:29:14Z", "full_text": "--7-7618271308-9381929734=:6\r\nContent-Type: text/plain; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n\nI was listening to Steve Hultay&#39;s RTSC radio show on that they did on\nsept=\r\nember 6th and they were talking about the mini box. They said that\nfor some=\r\n reason they have to let it run for a while before they get any\nmessages. T=\r\nhis then brought up a point on whether or not the spirits\nhave to get used =\r\nto the radios before they are able to speak. So it may\nbe easier to announc=\r\ne that you are doing a session and which radio you\nare using. I think exper=\r\nimenting is key and you just have to figure out\nwhat works for you and your=\r\n box.\n\nIf you&#39;re interested in Steve&#39;s show, you can find it here\n&lt;http://w=\r\nww.keyportparanormal.com/rtsctalkradio.html&gt;\n\n-Aaron\n\n\n--- In EVP-ITC@yahoo=\r\ngroups.com, &quot;mrscaptainjack2&quot; &lt;jjkamp@...&gt; wrote:\n&gt;\n&gt; Thanks, Misty!\n&gt;\n&gt; I =\r\nhad a guy named Steve come through almost every session, so maybe he\nwas my=\r\n &quot;tech.&quot;  The last session I had before the dry spell (when I quit\nfor a wh=\r\nile due to sickness), Steve was sort of flippant and gave a\nbunch of stupid=\r\n answers, so now I&#39;m kind of hoping he&#39;s gone on\nvacation.  But I did two s=\r\nessions yesterday, and very little came\nthrough except for being told that =\r\na family friend has died (I&#39;m waiting\nto see if that bit of prediction has =\r\ncome true).  So maybe, like you\nsaid, Steve &quot;led&quot; everyone and made things =\r\ncome through clearer.  I\nguess time will tell.  If he&#39;d behave himself, I&#39;d=\r\n welcome him back.\n&gt;\n&gt; So I&#39;m wondering, what&#39;s the rationale behind this c=\r\nomment:\n&gt;\n&gt; First, the MiniBox works best with time.  If you do not have tw=\r\no hours\nto devote to a session, you might be disappointed.  You should have=\r\n the\ndevice running in the place you will be using it for at least 15\nminut=\r\nes; during this time you can fine tune settings and volume. Never\nexpect th=\r\ne Box to &quot;Hit the ground running,&quot; so to speak; it happens\noccasionally, th=\r\nat an operator can turn on the box and get an immediate\nmessage, but it has=\r\nn&#39;t happened often in the ASUP&#39;s tests.\n&gt;\n&gt; http://www.asup-inc.org/interim=\r\nminiboxreport.htm\n&gt;\n&gt; I can&#39;t imagine the above quote is good advice.  The =\r\nvery first moment\nI turned on my little hacked box, I got a clear, loud mes=\r\nsage:  I see\nyou.  It freaked me out so bad, I turned it off immediately an=\r\nd it took\nthree days to work up the nerve to try again!  So I don&#39;t know wh=\r\nat\nthese people are talking about, that you can&#39;t hit the ground running. \n=\r\nI&#39;ve read about lots of folks doing just that.\n&gt;\n&gt; I was kind of thinking t=\r\nhat shorter was better, too, but I wanted to\nmake sure, because if I was wr=\r\nong, maybe letting it run a long time\nmight get even better responses...but=\r\n yeah, I think they get tired, as\nit probably takes a lot of effort to form=\r\n those words.\n&gt;\n&gt; I was also thinking all those skeptics who say the boxes =\r\ndon&#39;t work\nare probably not treating their sessions like EVP -- I can never=\r\n hear\nmuch of anything during the session, only afterward when I listen bac=\r\nk\nand at very high volume.  At least for me, most of the bulk of the\ncommun=\r\nication is very, very quiet and located in between the louder\nsnippets of s=\r\ntrong-signaled radio announcer voices.  I imagine it might\nbe louder and cl=\r\nearer if I took my set-up to a haunted location (or some\nplace lots of huma=\r\nn emotions were felt), but since my set-up isn&#39;t\nreally geared for that, I =\r\nhaven&#39;t done it yet.\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, &quot;bulletbab=\r\nea&quot; bulletbabea@ wrote:\n&gt; &gt;\n&gt; &gt; Hiya Jill. yep everyone had a busy weekend.=\r\n Many out of town at the\nvarious events or dealing with family and work. So=\r\nme are recovering from\nhaving too much fun.\n&gt; &gt;\n&gt; &gt; A tech in reference to =\r\nevp usually represents what some others call\na guide. A helper of sorts whe=\r\nther its just to get information or to\nhelp resolve an issue. They often ap=\r\npear over and over and act as a\n&quot;lead&quot; for the group of speakers.\n&gt; &gt;\n&gt; &gt; A=\r\ns for how long you record personally I have to say short is better.\nI find =\r\nthat spirits speak in bursts of energy and if I record for long\nperiods of =\r\ntime I get very little but if I record for a short period of\ntime they make=\r\n much better use of that time. Also it is much easier to\nanalyze short reco=\r\nrdings in depth.\n&gt; &gt;\n&gt; &gt; The only time Ive recorded long sessions is if I a=\r\nm in a group or\ncircle and want to record whats being said by us as well as=\r\n spirit.\nBeing out on investigations one might choose to record there longe=\r\nr as\nyou document your investigation but for straight evp work i usually do=\r\n\nbetween 30 seconds and 3 minutes and no longer. They use the time\nwisely. =\r\nAnd the voices are much louder. When doing the group or circle\nsuch as with=\r\n a medium they also have been loud as we were but again its\nmuch more energ=\r\ny in the room when doing those things.\n&gt; &gt;\n&gt; &gt; Again its just my viewpoint =\r\nand others may think differently or have\ndifferent experiences. Hope that h=\r\nelps!\n&gt; &gt;\n&gt; &gt; Misty\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;mrscaptainjack=\r\n2&quot; &lt;jjkamp@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; Hi guys!  I didn&#39;t receive any response to =\r\nmy last question, and\nmaybe that&#39;s because everyone is busy with real life =\r\nand whatnot.  I\nknow some of you were out of town, so I thought I&#39;d post my=\r\n question\nagain, hoping someone will be kind enough to offer his or her inf=\r\ninite\nwisdom and opinions.\n&gt; &gt; &gt;\n&gt; &gt; &gt; What is a &quot;tech,&quot; and is it desirabl=\r\ne to have one?  Is this like a\nhelper on the other side? I&#39;ve tried googlin=\r\ng this, but haven&#39;t found\nanything about this anywhere.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Do you =\r\nguys find that it&#39;s better to do short sessions (15\nminutes) or long ones (=\r\ntwo hours)?  Do the entities get exhausted\nquickly, or do they have to get =\r\ngoing and need time to do it?\n&gt; &gt; &gt;\n&gt; &gt; &gt; Thanks in advance for you answers=\r\n!\n&gt; &gt; &gt;\n&gt; &gt; &gt; Jill\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n\n\r\n--7-7618271308-9381929734=:6\r\nContent-Type: text/html; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;div&gt;&lt;p&gt;I was listening to Steve Hultay&#39;s RTSC radio show on that they did =\r\non september 6th and they were talking about the mini box. They said that f=\r\nor some reason they have to let it run for a while before they get any mess=\r\nages. This then brought up a point on whether or not the spirits have to ge=\r\nt used to the radios before they are able to speak. So it may be easier to =\r\nannounce that you are doing a session and which radio you are using. I thin=\r\nk experimenting is key and you just have to figure out what works for you a=\r\nnd your box.&lt;/p&gt;&lt;p&gt;If you&#39;re interested in Steve&#39;s show, you can find it&nb=\r\nsp;&lt;a href=3D&quot;http://www.keyportparanormal.com/rtsctalkradio.html&quot;&gt;here&lt;/a&gt;=\r\n&nbsp;&lt;/p&gt;&lt;p&gt;-Aaron&lt;/p&gt;&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;br&gt;--- In EVP-ITC@yahoogroups.=\r\ncom, &quot;mrscaptainjack2&quot; &lt;jjkamp@...&gt; wrote:&lt;br&gt;&gt;&lt;br&gt;&gt; Thanks, Mi=\r\nsty!&lt;br&gt;&gt; &lt;br&gt;&gt; I had a guy named Steve come through almost every ses=\r\nsion, so maybe he was my &quot;tech.&quot;  The last session I had before the dry spe=\r\nll (when I quit for a while due to sickness), Steve was sort of flippant an=\r\nd gave a bunch of stupid answers, so now I&#39;m kind of hoping he&#39;s gone on va=\r\ncation.  But I did two sessions yesterday, and very little came through exc=\r\nept for being told that a family friend has died (I&#39;m waiting to see if tha=\r\nt bit of prediction has come true).  So maybe, like you said, Steve &quot;led&quot; e=\r\nveryone and made things come through clearer.  I guess time will tell.  If =\r\nhe&#39;d behave himself, I&#39;d welcome him back.&lt;br&gt;&gt; &lt;br&gt;&gt; So I&#39;m wonderin=\r\ng, what&#39;s the rationale behind this comment:&lt;br&gt;&gt; &lt;br&gt;&gt; First, the Mi=\r\nniBox works best with time.  If you do not have two hours to devote to a se=\r\nssion, you might be disappointed.  You should have the device running in th=\r\ne place you will be using it for at least 15 minutes; during this time you =\r\ncan fine tune settings and volume. Never expect the Box to &quot;Hit the ground =\r\nrunning,&quot; so to speak; it happens occasionally, that an operator can turn o=\r\nn the box and get an immediate message, but it hasn&#39;t happened often in the=\r\n ASUP&#39;s tests.&lt;br&gt;&gt; &lt;br&gt;&gt; http://www.asup-inc.org/interimminiboxrepor=\r\nt.htm&lt;br&gt;&gt; &lt;br&gt;&gt; I can&#39;t imagine the above quote is good advice.  The=\r\n very first moment I turned on my little hacked box, I got a clear, loud me=\r\nssage:  I see you.  It freaked me out so bad, I turned it off immediately a=\r\nnd it took three days to work up the nerve to try again!  So I don&#39;t know w=\r\nhat these people are talking about, that you can&#39;t hit the ground running. =\r\n I&#39;ve read about lots of folks doing just that.&lt;br&gt;&gt; &lt;br&gt;&gt; I was kind=\r\n of thinking that shorter was better, too, but I wanted to make sure, becau=\r\nse if I was wrong, maybe letting it run a long time might get even better r=\r\nesponses...but yeah, I think they get tired, as it probably takes a lot of =\r\neffort to form those words.&lt;br&gt;&gt; &lt;br&gt;&gt; I was also thinking all those =\r\nskeptics who say the boxes don&#39;t work are probably not treating their sessi=\r\nons like EVP -- I can never hear much of anything during the session, only =\r\nafterward when I listen back and at very high volume.  At least for me, mos=\r\nt of the bulk of the communication is very, very quiet and located in betwe=\r\nen the louder snippets of strong-signaled radio announcer voices.  I imagin=\r\ne it might be louder and clearer if I took my set-up to a haunted location =\r\n(or some place lots of human emotions were felt), but since my set-up isn&#39;t=\r\n really geared for that, I haven&#39;t done it yet.   &lt;br&gt;&gt; &lt;br&gt;&gt; &lt;br&gt;&gt=\r\n; &lt;br&gt;&gt; &lt;br&gt;&gt; &lt;br&gt;&gt; --- In EVP-ITC@yahoogroups.com, &quot;bulletbabea&quot; =\r\nbulletbabea@ wrote:&lt;br&gt;&gt; &gt;&lt;br&gt;&gt; &gt; Hiya Jill. yep everyone had a=\r\n busy weekend. Many out of town at the various events or dealing with famil=\r\ny and work. Some are recovering from having too much fun.&lt;br&gt;&gt; &gt; &lt;br&gt;=\r\n&gt; &gt; A tech in reference to evp usually represents what some others ca=\r\nll a guide. A helper of sorts whether its just to get information or to hel=\r\np resolve an issue. They often appear over and over and act as a &quot;lead&quot; for=\r\n the group of speakers.&lt;br&gt;&gt; &gt; &lt;br&gt;&gt; &gt; As for how long you reco=\r\nrd personally I have to say short is better. I find that spirits speak in b=\r\nursts of energy and if I record for long periods of time I get very little =\r\nbut if I record for a short period of time they make much better use of tha=\r\nt time. Also it is much easier to analyze short recordings in depth.&lt;br&gt;&gt=\r\n; &gt; &lt;br&gt;&gt; &gt; The only time Ive recorded long sessions is if I am in=\r\n a group or circle and want to record whats being said by us as well as spi=\r\nrit. Being out on investigations one might choose to record there longer as=\r\n you document your investigation but for straight evp work i usually do bet=\r\nween 30 seconds and 3 minutes and no longer. They use the time wisely. And =\r\nthe voices are much louder. When doing the group or circle such as with a m=\r\nedium they also have been loud as we were but again its much more energy in=\r\n the room when doing those things.&lt;br&gt;&gt; &gt; &lt;br&gt;&gt; &gt; Again its jus=\r\nt my viewpoint and others may think differently or have different experienc=\r\nes. Hope that helps!&lt;br&gt;&gt; &gt; &lt;br&gt;&gt; &gt; Misty&lt;br&gt;&gt; &gt; &lt;br&gt;&gt;=\r\n &gt; --- In EVP-ITC@yahoogroups.com, &quot;mrscaptainjack2&quot; &lt;jjkamp@&gt; wro=\r\nte:&lt;br&gt;&gt; &gt; &gt;&lt;br&gt;&gt; &gt; &gt; Hi guys!  I didn&#39;t receive any resp=\r\nonse to my last question, and maybe that&#39;s because everyone is busy with re=\r\nal life and whatnot.  I know some of you were out of town, so I thought I&#39;d=\r\n post my question again, hoping someone will be kind enough to offer his or=\r\n her infinite wisdom and opinions.&lt;br&gt;&gt; &gt; &gt; &lt;br&gt;&gt; &gt; &gt; Wha=\r\nt is a &quot;tech,&quot; and is it desirable to have one?  Is this like a helper on t=\r\nhe other side? I&#39;ve tried googling this, but haven&#39;t found anything about t=\r\nhis anywhere. &lt;br&gt;&gt; &gt; &gt; &lt;br&gt;&gt; &gt; &gt; Do you guys find that i=\r\nt&#39;s better to do short sessions (15 minutes) or long ones (two hours)?  Do =\r\nthe entities get exhausted quickly, or do they have to get going and need t=\r\nime to do it?&lt;br&gt;&gt; &gt; &gt; &lt;br&gt;&gt; &gt; &gt; Thanks in advance for yo=\r\nu answers!&lt;br&gt;&gt; &gt; &gt; &lt;br&gt;&gt; &gt; &gt; Jill&lt;br&gt;&gt; &gt; &gt;&lt;br&gt;&=\r\ngt; &gt;&lt;br&gt;&gt;&lt;br&gt;\n\n\r\n--7-7618271308-9381929734=:6--"}