{"id": "15970", "subject": "Re: [EVP-ITC] Re: Is there anybody out there?", "author": "Misty Dawn", "timestamp": "2009-09-15T23:51:32Z", "full_text": "--0-933669517-1253058692=:61265\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nYes Jill. Again thats just their opinion and experience. Perhaps for them t=\r\nhey think they need to run if two hours before it gets anything. For others=\r\n its immediate. this is why I always tell people to run experiments, try di=\r\nfferent things out and eventually you too will form your own opinion about =\r\nwhat works best for you. \n=A0\nThere are NO experts in this feild of researc=\r\nh just those who know more, those who know less, and those who think they k=\r\nnow everything =3D)\n=A0\nWhat works for me may not work for you and vice ver=\r\nsa. So just try things out for yourselves and see where it takes you. Its a=\r\n fun journey.\n=A0\nGood luck!\nMisty\n\n--- On Tue, 9/15/09, mrscaptainjack2 &lt;j=\r\njkamp@...&gt; wrote:\n\n\nFrom: mrscaptainjack2 &lt;jjkamp@...&gt;\nSubj=\r\nect: [EVP-ITC] Re: Is there anybody out there?\nTo: EVP-ITC@yahoogroups.com\n=\r\nDate: Tuesday, September 15, 2009, 4:06 PM\n\n\n=A0 \n\n\n\nThanks, Misty!\n\nI had =\r\na guy named Steve come through almost every session, so maybe he was my &quot;te=\r\nch.&quot; The last session I had before the dry spell (when I quit for a while d=\r\nue to sickness), Steve was sort of flippant and gave a bunch of stupid answ=\r\ners, so now I&#39;m kind of hoping he&#39;s gone on vacation. But I did two session=\r\ns yesterday, and very little came through except for being told that a fami=\r\nly friend has died (I&#39;m waiting to see if that bit of prediction has come t=\r\nrue). So maybe, like you said, Steve &quot;led&quot; everyone and made things come th=\r\nrough clearer. I guess time will tell. If he&#39;d behave himself, I&#39;d welcome =\r\nhim back.\n\nSo I&#39;m wondering, what&#39;s the rationale behind this comment:\n\nFir=\r\nst, the MiniBox works best with time. If you do not have two hours to devot=\r\ne to a session, you might be disappointed. You should have the device runni=\r\nng in the place you will be using it for at least 15 minutes; during this t=\r\nime you can fine tune settings and volume. Never expect the Box to &quot;Hit the=\r\n ground running,&quot; so to speak; it happens occasionally, that an operator ca=\r\nn turn on the box and get an immediate message, but it hasn&#39;t happened ofte=\r\nn in the ASUP&#39;s tests.\n\nhttp://www.asup- inc.org/interimm iniboxreport. htm=\r\n\n\nI can&#39;t imagine the above quote is good advice. The very first moment I t=\r\nurned on my little hacked box, I got a clear, loud message: I see you. It f=\r\nreaked me out so bad, I turned it off immediately and it took three days to=\r\n work up the nerve to try again! So I don&#39;t know what these people are talk=\r\ning about, that you can&#39;t hit the ground running. I&#39;ve read about lots of f=\r\nolks doing just that.\n\nI was kind of thinking that shorter was better, too,=\r\n but I wanted to make sure, because if I was wrong, maybe letting it run a =\r\nlong time might get even better responses... but yeah, I think they get tir=\r\ned, as it probably takes a lot of effort to form those words.\n\nI was also t=\r\nhinking all those skeptics who say the boxes don&#39;t work are probably not tr=\r\neating their sessions like EVP -- I can never hear much of anything during =\r\nthe session, only afterward when I listen back and at very high volume. At =\r\nleast for me, most of the bulk of the communication is very, very quiet and=\r\n located in between the louder snippets of strong-signaled radio announcer =\r\nvoices. I imagine it might be louder and clearer if I took my set-up to a h=\r\naunted location (or some place lots of human emotions were felt), but since=\r\n my set-up isn&#39;t really geared for that, I haven&#39;t done it yet. \n\n--- In EV=\r\nP-ITC@yahoogroups .com, &quot;bulletbabea&quot; &lt;bulletbabea@ ...&gt; wrote:\n&gt;\n&gt; Hiya Ji=\r\nll. yep everyone had a busy weekend. Many out of town at the various events=\r\n or dealing with family and work. Some are recovering from having too much =\r\nfun.\n&gt; \n&gt; A tech in reference to evp usually represents what some others ca=\r\nll a guide. A helper of sorts whether its just to get information or to hel=\r\np resolve an issue. They often appear over and over and act as a &quot;lead&quot; for=\r\n the group of speakers.\n&gt; \n&gt; As for how long you record personally I have t=\r\no say short is better. I find that spirits speak in bursts of energy and if=\r\n I record for long periods of time I get very little but if I record for a =\r\nshort period of time they make much better use of that time. Also it is muc=\r\nh easier to analyze short recordings in depth.\n&gt; \n&gt; The only time Ive recor=\r\nded long sessions is if I am in a group or circle and want to record whats =\r\nbeing said by us as well as spirit. Being out on investigations one might c=\r\nhoose to record there longer as you document your investigation but for str=\r\naight evp work i usually do between 30 seconds and 3 minutes and no longer.=\r\n They use the time wisely. And the voices are much louder. When doing the g=\r\nroup or circle such as with a medium they also have been loud as we were bu=\r\nt again its much more energy in the room when doing those things.\n&gt; \n&gt; Agai=\r\nn its just my viewpoint and others may think differently or have different =\r\nexperiences. Hope that helps!\n&gt; \n&gt; Misty\n&gt; \n&gt; --- In EVP-ITC@yahoogroups .c=\r\nom, &quot;mrscaptainjack2&quot; &lt;jjkamp@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hi guys! I didn&#39;t receive an=\r\ny response to my last question, and maybe that&#39;s because everyone is busy w=\r\nith real life and whatnot. I know some of you were out of town, so I though=\r\nt I&#39;d post my question again, hoping someone will be kind enough to offer h=\r\nis or her infinite wisdom and opinions.\n&gt; &gt; \n&gt; &gt; What is a &quot;tech,&quot; and is i=\r\nt desirable to have one? Is this like a helper on the other side? I&#39;ve trie=\r\nd googling this, but haven&#39;t found anything about this anywhere. \n&gt; &gt; \n&gt; &gt; =\r\nDo you guys find that it&#39;s better to do short sessions (15 minutes) or long=\r\n ones (two hours)? Do the entities get exhausted quickly, or do they have t=\r\no get going and need time to do it?\n&gt; &gt; \n&gt; &gt; Thanks in advance for you answ=\r\ners!\n&gt; &gt; \n&gt; &gt; Jill\n&gt; &gt;\n&gt;\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n      \r\n--0-933669517-1253058692=:61265\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;DIV&gt;Yes Jill. Again thats just their opinion=\r\n and experience. Perhaps for them they think they need to run if two hours =\r\nbefore it gets anything. For others its immediate. this is why I always tel=\r\nl people to run experiments, try different things out and eventually you to=\r\no will form your own opinion about what works best for you. &lt;/DIV&gt;\n&lt;DIV&gt;&nb=\r\nsp;&lt;/DIV&gt;\n&lt;DIV&gt;There are NO experts in this feild of research just those wh=\r\no know more, those who know less, and those who think they know everything =\r\n=3D)&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;What works for me may not work for you an=\r\nd vice versa. So just try things out for yourselves and see where it takes =\r\nyou. Its a fun journey.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Good luck!&lt;/DIV&gt;\n&lt;DIV&gt;=\r\nMisty&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Tue, 9/15/09, mrscaptainjack2 &lt;I&gt;&lt;jjkamp@netzero.=\r\ncom&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;&lt;/DIV&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: rgb(16,1=\r\n6,255) 2px solid; PADDING-LEFT: 5px; MARGIN-LEFT: 5px&quot;&gt;&lt;BR&gt;From: mrscaptain=\r\njack2 &lt;jjkamp@...&gt;&lt;BR&gt;Subject: [EVP-ITC] Re: Is there anybody=\r\n out there?&lt;BR&gt;To: EVP-ITC@yahoogroups.com&lt;BR&gt;Date: Tuesday, September 15, =\r\n2009, 4:06 PM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3Dyiv168224781&gt;&lt;SPAN style=3D&quot;DISPLAY: none&quot;&gt;=\r\n&nbsp;&lt;/SPAN&gt; \n&lt;DIV id=3Dygrp-text&gt;\n&lt;DIV&gt;Thanks, Misty!&lt;BR&gt;&lt;BR&gt;I had a guy =\r\nnamed Steve come through almost every session, so maybe he was my &quot;tech.&quot; T=\r\nhe last session I had before the dry spell (when I quit for a while due to =\r\nsickness), Steve was sort of flippant and gave a bunch of stupid answers, s=\r\no now I&#39;m kind of hoping he&#39;s gone on vacation. But I did two sessions yest=\r\nerday, and very little came through except for being told that a family fri=\r\nend has died (I&#39;m waiting to see if that bit of prediction has come true). =\r\nSo maybe, like you said, Steve &quot;led&quot; everyone and made things come through =\r\nclearer. I guess time will tell. If he&#39;d behave himself, I&#39;d welcome him ba=\r\nck.&lt;BR&gt;&lt;BR&gt;So I&#39;m wondering, what&#39;s the rationale behind this comment:&lt;BR&gt;&lt;=\r\nBR&gt;First, the MiniBox works best with time. If you do not have two hours to=\r\n devote to a session, you might be disappointed. You should have the device=\r\n running in the place you will be using it for at least 15 minutes; during =\r\nthis time you can fine tune\n settings and volume. Never expect the Box to &quot;=\r\nHit the ground running,&quot; so to speak; it happens occasionally, that an oper=\r\nator can turn on the box and get an immediate message, but it hasn&#39;t happen=\r\ned often in the ASUP&#39;s tests.&lt;BR&gt;&lt;BR&gt;&lt;A href=3D&quot;http://www.asup-inc.org/int=\r\nerimminiboxreport.htm&quot; rel=3Dnofollow target=3D_blank&gt;http://www.asup- inc.=\r\norg/interimm iniboxreport. htm&lt;/A&gt;&lt;BR&gt;&lt;BR&gt;I can&#39;t imagine the above quote i=\r\ns good advice. The very first moment I turned on my little hacked box, I go=\r\nt a clear, loud message: I see you. It freaked me out so bad, I turned it o=\r\nff immediately and it took three days to work up the nerve to try again! So=\r\n I don&#39;t know what these people are talking about, that you can&#39;t hit the g=\r\nround running. I&#39;ve read about lots of folks doing just that.&lt;BR&gt;&lt;BR&gt;I was =\r\nkind of thinking that shorter was better, too, but I wanted to make sure, b=\r\necause if I was wrong, maybe letting it run a long time might get even bett=\r\ner responses... but yeah, I\n think they get tired, as it probably takes a l=\r\not of effort to form those words.&lt;BR&gt;&lt;BR&gt;I was also thinking all those skep=\r\ntics who say the boxes don&#39;t work are probably not treating their sessions =\r\nlike EVP -- I can never hear much of anything during the session, only afte=\r\nrward when I listen back and at very high volume. At least for me, most of =\r\nthe bulk of the communication is very, very quiet and located in between th=\r\ne louder snippets of strong-signaled radio announcer voices. I imagine it m=\r\night be louder and clearer if I took my set-up to a haunted location (or so=\r\nme place lots of human emotions were felt), but since my set-up isn&#39;t reall=\r\ny geared for that, I haven&#39;t done it yet. &lt;BR&gt;&lt;BR&gt;--- In &lt;A href=3D&quot;http://=\r\nus.mc329.mail.yahoo.com/mc/compose?to=3DEVP-ITC%40yahoogroups.com&quot; rel=3Dno=\r\nfollow target=3D_blank ymailto=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC=\r\n@yahoogroups .com&lt;/A&gt;, &quot;bulletbabea&quot; &lt;bulletbabea@ ...&gt; wrote:&lt;BR&gt;&gt=\r\n;&lt;BR&gt;&gt; Hiya Jill. yep\n everyone had a busy weekend. Many out of town at =\r\nthe various events or dealing with family and work. Some are recovering fro=\r\nm having too much fun.&lt;BR&gt;&gt; &lt;BR&gt;&gt; A tech in reference to evp usually =\r\nrepresents what some others call a guide. A helper of sorts whether its jus=\r\nt to get information or to help resolve an issue. They often appear over an=\r\nd over and act as a &quot;lead&quot; for the group of speakers.&lt;BR&gt;&gt; &lt;BR&gt;&gt; As f=\r\nor how long you record personally I have to say short is better. I find tha=\r\nt spirits speak in bursts of energy and if I record for long periods of tim=\r\ne I get very little but if I record for a short period of time they make mu=\r\nch better use of that time. Also it is much easier to analyze short recordi=\r\nngs in depth.&lt;BR&gt;&gt; &lt;BR&gt;&gt; The only time Ive recorded long sessions is =\r\nif I am in a group or circle and want to record whats being said by us as w=\r\nell as spirit. Being out on investigations one might choose to record there=\r\n longer as you\n document your investigation but for straight evp work i usu=\r\nally do between 30 seconds and 3 minutes and no longer. They use the time w=\r\nisely. And the voices are much louder. When doing the group or circle such =\r\nas with a medium they also have been loud as we were but again its much mor=\r\ne energy in the room when doing those things.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Again its ju=\r\nst my viewpoint and others may think differently or have different experien=\r\nces. Hope that helps!&lt;BR&gt;&gt; &lt;BR&gt;&gt; Misty&lt;BR&gt;&gt; &lt;BR&gt;&gt; --- In &lt;A hre=\r\nf=3D&quot;http://us.mc329.mail.yahoo.com/mc/compose?to=3DEVP-ITC%40yahoogroups.c=\r\nom&quot; rel=3Dnofollow target=3D_blank ymailto=3D&quot;mailto:EVP-ITC%40yahoogroups.=\r\ncom&quot;&gt;EVP-ITC@yahoogroups .com&lt;/A&gt;, &quot;mrscaptainjack2&quot; &lt;jjkamp@&gt; wrote:=\r\n&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt; Hi guys! I didn&#39;t receive any response to my las=\r\nt question, and maybe that&#39;s because everyone is busy with real life and wh=\r\natnot. I know some of you were out of town, so I thought I&#39;d post my questi=\r\non again, hoping\n someone will be kind enough to offer his or her infinite =\r\nwisdom and opinions.&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; What is a &quot;tech,&quot; and is it=\r\n desirable to have one? Is this like a helper on the other side? I&#39;ve tried=\r\n googling this, but haven&#39;t found anything about this anywhere. &lt;BR&gt;&gt; &g=\r\nt; &lt;BR&gt;&gt; &gt; Do you guys find that it&#39;s better to do short sessions (15=\r\n minutes) or long ones (two hours)? Do the entities get exhausted quickly, =\r\nor do they have to get going and need time to do it?&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; =\r\n&gt; Thanks in advance for you answers!&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; Jill&lt;BR&gt;=\r\n&gt; &gt;&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;=\r\nbr&gt;\n\n      \r\n--0-933669517-1253058692=:61265--"}