{"id": "15974", "subject": "Re: Is there anybody out there?", "author": "mrscaptainjack2", "timestamp": "2009-09-16T01:06:27Z", "full_text": "I remember in that video clip Misty posted a few weeks ago, there was a (German?) ghost box researcher guy who said that he was in contact with his dead wife; she had told him that she didn&#39;t know exactly how she communicated with him, just that she thought about him and it happened.  So I&#39;m betting there isn&#39;t a conscious process to make the box work.\n\n\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;kolrone&quot; &lt;a.cronk@...&gt; wrote:\n&gt;\n&gt; \n&gt; I was listening to Steve Hultay&#39;s RTSC radio show on that they did on\n&gt; september 6th and they were talking about the mini box. They said that\n&gt; for some reason they have to let it run for a while before they get any\n&gt; messages. This then brought up a point on whether or not the spirits\n&gt; have to get used to the radios before they are able to speak. So it may\n&gt; be easier to announce that you are doing a session and which radio you\n&gt; are using. I think experimenting is key and you just have to figure out\n&gt; what works for you and your box.\n&gt; \n&gt; If you&#39;re interested in Steve&#39;s show, you can find it here\n&gt; &lt;http://www.keyportparanormal.com/rtsctalkradio.html&gt;\n&gt; \n&gt; -Aaron\n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;mrscaptainjack2&quot; &lt;jjkamp@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Thanks, Misty!\n&gt; &gt;\n&gt; &gt; I had a guy named Steve come through almost every session, so maybe he\n&gt; was my &quot;tech.&quot;  The last session I had before the dry spell (when I quit\n&gt; for a while due to sickness), Steve was sort of flippant and gave a\n&gt; bunch of stupid answers, so now I&#39;m kind of hoping he&#39;s gone on\n&gt; vacation.  But I did two sessions yesterday, and very little came\n&gt; through except for being told that a family friend has died (I&#39;m waiting\n&gt; to see if that bit of prediction has come true).  So maybe, like you\n&gt; said, Steve &quot;led&quot; everyone and made things come through clearer.  I\n&gt; guess time will tell.  If he&#39;d behave himself, I&#39;d welcome him back.\n&gt; &gt;\n&gt; &gt; So I&#39;m wondering, what&#39;s the rationale behind this comment:\n&gt; &gt;\n&gt; &gt; First, the MiniBox works best with time.  If you do not have two hours\n&gt; to devote to a session, you might be disappointed.  You should have the\n&gt; device running in the place you will be using it for at least 15\n&gt; minutes; during this time you can fine tune settings and volume. Never\n&gt; expect the Box to &quot;Hit the ground running,&quot; so to speak; it happens\n&gt; occasionally, that an operator can turn on the box and get an immediate\n&gt; message, but it hasn&#39;t happened often in the ASUP&#39;s tests.\n&gt; &gt;\n&gt; &gt; http://www.asup-inc.org/interimminiboxreport.htm\n&gt; &gt;\n&gt; &gt; I can&#39;t imagine the above quote is good advice.  The very first moment\n&gt; I turned on my little hacked box, I got a clear, loud message:  I see\n&gt; you.  It freaked me out so bad, I turned it off immediately and it took\n&gt; three days to work up the nerve to try again!  So I don&#39;t know what\n&gt; these people are talking about, that you can&#39;t hit the ground running. \n&gt; I&#39;ve read about lots of folks doing just that.\n&gt; &gt;\n&gt; &gt; I was kind of thinking that shorter was better, too, but I wanted to\n&gt; make sure, because if I was wrong, maybe letting it run a long time\n&gt; might get even better responses...but yeah, I think they get tired, as\n&gt; it probably takes a lot of effort to form those words.\n&gt; &gt;\n&gt; &gt; I was also thinking all those skeptics who say the boxes don&#39;t work\n&gt; are probably not treating their sessions like EVP -- I can never hear\n&gt; much of anything during the session, only afterward when I listen back\n&gt; and at very high volume.  At least for me, most of the bulk of the\n&gt; communication is very, very quiet and located in between the louder\n&gt; snippets of strong-signaled radio announcer voices.  I imagine it might\n&gt; be louder and clearer if I took my set-up to a haunted location (or some\n&gt; place lots of human emotions were felt), but since my set-up isn&#39;t\n&gt; really geared for that, I haven&#39;t done it yet.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;bulletbabea&quot; bulletbabea@ wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; Hiya Jill. yep everyone had a busy weekend. Many out of town at the\n&gt; various events or dealing with family and work. Some are recovering from\n&gt; having too much fun.\n&gt; &gt; &gt;\n&gt; &gt; &gt; A tech in reference to evp usually represents what some others call\n&gt; a guide. A helper of sorts whether its just to get information or to\n&gt; help resolve an issue. They often appear over and over and act as a\n&gt; &quot;lead&quot; for the group of speakers.\n&gt; &gt; &gt;\n&gt; &gt; &gt; As for how long you record personally I have to say short is better.\n&gt; I find that spirits speak in bursts of energy and if I record for long\n&gt; periods of time I get very little but if I record for a short period of\n&gt; time they make much better use of that time. Also it is much easier to\n&gt; analyze short recordings in depth.\n&gt; &gt; &gt;\n&gt; &gt; &gt; The only time Ive recorded long sessions is if I am in a group or\n&gt; circle and want to record whats being said by us as well as spirit.\n&gt; Being out on investigations one might choose to record there longer as\n&gt; you document your investigation but for straight evp work i usually do\n&gt; between 30 seconds and 3 minutes and no longer. They use the time\n&gt; wisely. And the voices are much louder. When doing the group or circle\n&gt; such as with a medium they also have been loud as we were but again its\n&gt; much more energy in the room when doing those things.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Again its just my viewpoint and others may think differently or have\n&gt; different experiences. Hope that helps!\n&gt; &gt; &gt;\n&gt; &gt; &gt; Misty\n&gt; &gt; &gt;\n&gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;mrscaptainjack2&quot; &lt;jjkamp@&gt; wrote:\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Hi guys!  I didn&#39;t receive any response to my last question, and\n&gt; maybe that&#39;s because everyone is busy with real life and whatnot.  I\n&gt; know some of you were out of town, so I thought I&#39;d post my question\n&gt; again, hoping someone will be kind enough to offer his or her infinite\n&gt; wisdom and opinions.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; What is a &quot;tech,&quot; and is it desirable to have one?  Is this like a\n&gt; helper on the other side? I&#39;ve tried googling this, but haven&#39;t found\n&gt; anything about this anywhere.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Do you guys find that it&#39;s better to do short sessions (15\n&gt; minutes) or long ones (two hours)?  Do the entities get exhausted\n&gt; quickly, or do they have to get going and need time to do it?\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Thanks in advance for you answers!\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Jill\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}