{"id": "15978", "subject": "Re: [EVP-ITC] Voice inflections?", "author": "Misty Dawn", "timestamp": "2009-09-16T09:41:42Z", "full_text": "--0-992413861-1253094102=:48304\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nI have gotten many life like voices over the years. My first evp was my mot=\r\nhers voice and no boxes were involved. The box is=A0a tool/method and there=\r\n are many ways to get their voices heard. So in the different methods I hav=\r\ne used, yes I have heard voices that resemble their lifetime charachteristi=\r\ncs and tones. Is it always that way? No. \n=A0\nMost often the group will=A0s=\r\npeak as one voice because I have requested they do so.=A0One voice tone wil=\r\nl begin a sentence and another will end it. So I may hear my female friends=\r\n voice start off a thought and an unknown male voice finish the sentence. A=\r\nnd vice versa often they speak in tones which do not even come close to wha=\r\nt they sounded like in life. Quite often they are spirits I didnt know in l=\r\nife. I may get someone saying This is edison, and then find an old recordin=\r\ng he did where he starts it off saying This is edison, but for me I do not =\r\nknow the man so there is no recognition for me. I document it and file it a=\r\nway as a curiousity.\n=A0\nI always laugh when people say thats not your moth=\r\ner or friend=A0thats something trying to fool you and mess with your head. =\r\nI knew my mother longer than anyone and its interesting that it is easier f=\r\nor those people to believe that its possible that something/someone else is=\r\n speaking pretending to be my mother but its much harder for them to believ=\r\ne that quite possibly that really is my mother keeping her promise to stay =\r\nin touch after death. If one is possible then so is the other. I tend to be=\r\n=A0stubborn in some respects in that I dont instantly believe what anyone t=\r\nells me whether living or not. If they give me a message I think is dumb I =\r\nam very reluctant to pass it on and usually those are the ones that get the=\r\n biggest confirmations tho it means nothing to me at the time. So yes quite=\r\n possibly evp work can be used the same as mediumship in missing persons ca=\r\nses.\n=A0\nFor me tone of voice has grown to mean nothing. It is a treat when=\r\n they manage to come across sounding as they did when in physical form here=\r\n but I look beyond the tone of voice. Often people get a childs voice and t=\r\nhey become saddened by the thought that a child is earthbound. But I see it=\r\n just as a representation of voice and whether it comes across as male fema=\r\nle child or robot matters little=A0to me.\n=A0\nI do find they often resume t=\r\nhe &quot;character&quot; they played because after all that is sort of what we are, c=\r\nharacters in some giant play. Whether it is the beliefs they had which were=\r\n their trademark, the tone of voice, their image, or use of some nickname e=\r\nven I dont know about I look at it all as just a pixel in a larger portrait=\r\n that some part survives once the body has ceased to function. And the mess=\r\nage is simply, our energy continues on.\n=A0\nQuote by Einstein: &#39;Energy cann=\r\not be created or destroyed, it can only be changed from one form to another=\r\n.&#39;\n=A0\nMisty (the insomniac is up way tooooo late=A0and rambling on LOL)\n\n-=\r\n-- On Tue, 9/15/09, mrscaptainjack2 &lt;jjkamp@...&gt; wrote:\n\n\nFrom: mrs=\r\ncaptainjack2 &lt;jjkamp@...&gt;\nSubject: [EVP-ITC] Voice inflections?\nTo:=\r\n EVP-ITC@yahoogroups.com\nDate: Tuesday, September 15, 2009, 9:56 PM\n\n\n=A0 \n=\r\n\n\n\nI was googling about AM radio reception, and I came across the below exc=\r\nhange on a forum. It talks about using the box to find missing persons (whi=\r\nch I didn&#39;t know was possible), and the conversation mentions hearing speci=\r\nfic voice inflections and recognizing a dead person&#39;s specific voice on the=\r\n box. My question is, do any of you get a recognizable voice? The voices I =\r\nget always sound robotic, although I do get clearly male or female voices. =\r\n\n\nhttp://www.itcbridg e.com/forum/ view_topic. php?id=3D515& forum_id=3D 31=\r\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n      \r\n--0-992413861-1253094102=:48304\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;DIV&gt;I have gotten many life like voices over=\r\n the years. My first evp was my mothers voice and no boxes were involved. T=\r\nhe box is&nbsp;a tool/method and there are many ways to get their voices he=\r\nard. So in the different methods I have used, yes I have heard voices that =\r\nresemble their lifetime charachteristics and tones. Is it always that way? =\r\nNo. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Most often the group will&nbsp;speak as o=\r\nne voice because I have requested they do so.&nbsp;One voice tone will begi=\r\nn a sentence and another will end it. So I may hear my female friends voice=\r\n start off a thought and an unknown male voice finish the sentence. And vic=\r\ne versa often they speak in tones which do not even come close to what they=\r\n sounded like in life. Quite often they are spirits I didnt know in life. I=\r\n may get someone saying This is edison, and then find an old recording he d=\r\nid where he starts it off saying This is edison, but for me I do not know t=\r\nhe man so there is no recognition for me. I document it and file it away as=\r\n a curiousity.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I always laugh when people say =\r\nthats not your mother or friend&nbsp;thats something trying to fool you and=\r\n mess with your head. I knew my mother longer than anyone and its interesti=\r\nng that it is easier for those people to believe that its possible that som=\r\nething/someone else is speaking pretending to be my mother but its much har=\r\nder for them to believe that quite possibly that really is my mother keepin=\r\ng her promise to stay in touch after death. If one is possible then so is t=\r\nhe other. I tend to be&nbsp;stubborn in some respects in that I dont instan=\r\ntly believe what anyone tells me whether living or not. If they give me a m=\r\nessage I think is dumb I am very reluctant to pass it on and usually those =\r\nare the ones that get the biggest confirmations tho it means nothing to me =\r\nat the time. So yes quite possibly evp work can be used the same as mediums=\r\nhip in missing persons cases.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;For me tone of v=\r\noice has grown to mean nothing. It is a treat when they manage to come acro=\r\nss sounding as they did when in physical form here but I look beyond the to=\r\nne of voice. Often people get a childs voice and they become saddened by th=\r\ne thought that a child is earthbound. But I see it just as a representation=\r\n of voice and whether it comes across as male female child or robot matters=\r\n little&nbsp;to me.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I do find they often resum=\r\ne the &quot;character&quot; they played because after all that is sort of what we are=\r\n, characters in some giant play. Whether it is the beliefs they had which w=\r\nere their trademark, the tone of voice, their image, or use of some nicknam=\r\ne even I dont know about I look at it all as just a pixel in a larger portr=\r\nait that some part survives once the body has ceased to function. And the m=\r\nessage is simply, our energy continues on.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;EM=\r\n&gt;Quote&lt;/EM&gt; by Einstein: &#39;&lt;EM&gt;Energy&lt;/EM&gt; cannot be &lt;EM&gt;created&lt;/EM&gt; or &lt;EM=\r\n&gt;destroyed&lt;/EM&gt;, it can only be changed from one form to another.&#39;&lt;/DIV&gt;\n&lt;D=\r\nIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Misty (the insomniac is up way tooooo late&nbsp;and ra=\r\nmbling on LOL)&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Tue, 9/15/09, mrscaptainjack2 &lt;I&gt;&lt;jjkamp=\r\n@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;&lt;/DIV&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT:=\r\n rgb(16,16,255) 2px solid; PADDING-LEFT: 5px; MARGIN-LEFT: 5px&quot;&gt;&lt;BR&gt;From: m=\r\nrscaptainjack2 &lt;jjkamp@...&gt;&lt;BR&gt;Subject: [EVP-ITC] Voice infle=\r\nctions?&lt;BR&gt;To: EVP-ITC@yahoogroups.com&lt;BR&gt;Date: Tuesday, September 15, 2009=\r\n, 9:56 PM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3Dyiv602211464&gt;&lt;SPAN style=3D&quot;DISPLAY: none&quot;&gt;&nbs=\r\np;&lt;/SPAN&gt; \n&lt;DIV id=3Dygrp-text&gt;\n&lt;DIV&gt;I was googling about AM radio receptio=\r\nn, and I came across the below exchange on a forum. It talks about using th=\r\ne box to find missing persons (which I didn&#39;t know was possible), and the c=\r\nonversation mentions hearing specific voice inflections and recognizing a d=\r\nead person&#39;s specific voice on the box. My question is, do any of you get a=\r\n recognizable voice? The voices I get always sound robotic, although I do g=\r\net clearly male or female voices. &lt;BR&gt;&lt;BR&gt;&lt;A href=3D&quot;http://www.itcbridge.c=\r\nom/forum/view_topic.php?id=3D515&amp;forum_id=3D31&quot; rel=3Dnofollow target=\r\n=3D_blank&gt;http://www.itcbridg e.com/forum/ view_topic. php?id=3D515&amp; fo=\r\nrum_id=3D 31&lt;/A&gt;&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;b=\r\nr&gt;\n\n\n\n      \r\n--0-992413861-1253094102=:48304--"}