{"id": "15971", "subject": "Re: [EVP-ITC] Re: &quot;box&quot; toss!", "author": "Aileen Garoutte", "timestamp": "2009-09-15T22:19:15Z", "full_text": "Hello, I am wondering about &quot;purples&quot; since I am purpleurial@....  I\nwould love to have a Frank&#39;s box.  Is there anyway to get one?\n\nI see that space is part of purple&#39;s e-mail name.  I am interested in UFOs\nand always have been.  I was director of the UFO Contact Center\nInternational for 20 years.  Now I just do my blog on UFOs.  If your\ninterested let me know.\n\nAileen\n\nOn Tue, Sep 15, 2009 at 4:07 PM, purplespacefriend &lt;\npurplealiengirl@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; &quot;I don&#39;t need to woryy about mind tricks&quot; ;-)\n&gt;\n&gt; F-S\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, &quot;bulletbabea&quot;\n&gt; &lt;bulletbabea@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; LOL jedi power mindtrick! Ya know in a way thats kinda scary! LOL\n&gt; &gt;\n&gt; &gt; Misty\n&gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Frank\n&gt; Sumption &lt;purplealiengirl@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; This was coming back to Denver, Security never even looked inside the\n&gt; boxes\n&gt; &gt; &gt; on the way, even with all the electronics and echo chambers made out of\n&gt; &gt; &gt; pipe. &quot;We don&#39;t need to look at these boxes&quot;-- waving the hand using\n&gt; the\n&gt; &gt; &gt; force.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Frank-S\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nHello, I am wonde ing abou \"pu ples\" since I am pu pleu ial@....  I would lo e o ha e a F ank's box.  Is he e anyway o ge one?I see ha space is pa o pu ple's e-mail name.  I am in e es ed in UFOs and always ha e been.  I was di ec o o he UFO Con ac Cen e In e na ional o 20 yea s.  Now I jus do my blog on UFOs.  I you in e es ed le me know.\nAileenOn Tue, Sep 15, 2009 a 4:07 PM, pu plespace iend pu plealiengi l@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n \n \"I don' need o wo yy abou mind icks\" ;-)\n\nF-S\n\n--- In EVP-ITC@yahoog oups.com, \"bulle babea\" w o e:\n>\n> LOL jedi powe mind ick! Ya know in a way ha s kinda sca y! LOL\n> \n> Mis y\n> \n> \n> --- In EVP-ITC@yahoog oups.com, F ank Sump ion w o e:\n> >\n> > This was coming back o Den e , Secu i y ne e e en looked inside he boxes\n> > on he way, e en wi h all he elec onics and echo chambe s made ou o \n> > pipe. \"We don' need o look a hese boxes\"-- wa ing he hand using he\n> > o ce.\n> > \n> > F ank-S\n> >\n>"}