{"id": "15973", "subject": "Re: [EVP-ITC] Re: Is there anybody out there?", "author": "Jon", "timestamp": "2009-09-16T00:37:13Z", "full_text": "--0-1983414974-1253061433=:5021\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nHi Misty,\n\nI like what you said. You are right also in the fact that some k=\r\nnow more, some know less and some think they know it all.=A0 \n\nRegards,\nJon=\r\n in Texas=A0\n\n--- On Tue, 9/15/09, Misty Dawn &lt;bulletbabea@...&gt; wrote=\r\n:\n\nFrom: Misty Dawn &lt;bulletbabea@...&gt;\nSubject: Re: [EVP-ITC] Re: Is t=\r\nhere anybody out there?\nTo: EVP-ITC@yahoogroups.com\nDate: Tuesday, Septembe=\r\nr 15, 2009, 6:51 PM\n\n\n\n\n\n\n=A0\n\n\n\n\n    \n                  Yes Jill. Again th=\r\nats just their opinion and experience. Perhaps for them they think they nee=\r\nd to run if two hours before it gets anything. For others its immediate. th=\r\nis is why I always tell people to run experiments, try different things out=\r\n and eventually you too will form your own opinion about what works best fo=\r\nr you. \n=A0\nThere are NO experts in this feild of research just those who k=\r\nnow more, those who know less, and those who think they know everything =3D=\r\n)\n=A0\nWhat works for me may not work for you and vice versa. So just try th=\r\nings out for yourselves and see where it takes you. Its a fun journey.\n=A0\n=\r\nGood luck!\nMisty\n\n--- On Tue, 9/15/09, mrscaptainjack2 &lt;jjkamp@netzero. com=\r\n&gt; wrote:\n\n\nFrom: mrscaptainjack2 &lt;jjkamp@netzero. com&gt;\nSubject: [EVP-ITC] R=\r\ne: Is there anybody out there?\nTo: EVP-ITC@yahoogroups .com\nDate: Tuesday, =\r\nSeptember 15, 2009, 4:06 PM\n\n\n=A0 \n\nThanks, Misty!\n\nI had a guy named Steve=\r\n come through almost every session, so maybe he was my &quot;tech.&quot; The last ses=\r\nsion I had before the dry spell (when I quit for a while due to sickness), =\r\nSteve was sort of flippant and gave a bunch of stupid answers, so now I&#39;m k=\r\nind of hoping he&#39;s gone on vacation. But I did two sessions yesterday, and =\r\nvery little came through except for being told that a family friend has die=\r\nd (I&#39;m waiting to see if that bit of prediction has come true). So maybe, l=\r\nike you said, Steve &quot;led&quot; everyone and made things come through clearer. I =\r\nguess time will tell. If he&#39;d behave himself, I&#39;d welcome him back.\n\nSo I&#39;m=\r\n wondering, what&#39;s the rationale behind this comment:\n\nFirst, the MiniBox w=\r\norks best with time. If you do not have two hours to devote to a session, y=\r\nou might be disappointed. You should have the device running in the place y=\r\nou will be using it for at least 15 minutes; during this time you can fine =\r\ntune\n settings and volume. Never expect the Box to &quot;Hit the ground running,=\r\n&quot; so to speak; it happens occasionally, that an operator can turn on the bo=\r\nx and get an immediate message, but it hasn&#39;t happened often in the ASUP&#39;s =\r\ntests.\n\nhttp://www.asup- inc.org/interimm iniboxreport. htm\n\nI can&#39;t imagin=\r\ne the above quote is good advice. The very first moment I turned on my litt=\r\nle hacked box, I got a clear, loud message: I see you. It freaked me out so=\r\n bad, I turned it off immediately and it took three days to work up the ner=\r\nve to try again! So I don&#39;t know what these people are talking about, that =\r\nyou can&#39;t hit the ground running. I&#39;ve read about lots of folks doing just =\r\nthat.\n\nI was kind of thinking that shorter was better, too, but I wanted to=\r\n make sure, because if I was wrong, maybe letting it run a long time might =\r\nget even better responses... but yeah, I\n think they get tired, as it proba=\r\nbly takes a lot of effort to form those words.\n\nI was also thinking all tho=\r\nse skeptics who say the boxes don&#39;t work are probably not treating their se=\r\nssions like EVP -- I can never hear much of anything during the session, on=\r\nly afterward when I listen back and at very high volume. At least for me, m=\r\nost of the bulk of the communication is very, very quiet and located in bet=\r\nween the louder snippets of strong-signaled radio announcer voices. I imagi=\r\nne it might be louder and clearer if I took my set-up to a haunted location=\r\n (or some place lots of human emotions were felt), but since my set-up isn&#39;=\r\nt really geared for that, I haven&#39;t done it yet. \n\n--- In EVP-ITC@yahoogrou=\r\nps .com, &quot;bulletbabea&quot; &lt;bulletbabea@ ...&gt; wrote:\n&gt;\n&gt; Hiya Jill. yep\n everyo=\r\nne had a busy weekend. Many out of town at the various events or dealing wi=\r\nth family and work. Some are recovering from having too much fun.\n&gt; \n&gt; A te=\r\nch in reference to evp usually represents what some others call a guide. A =\r\nhelper of sorts whether its just to get information or to help resolve an i=\r\nssue. They often appear over and over and act as a &quot;lead&quot; for the group of =\r\nspeakers.\n&gt; \n&gt; As for how long you record personally I have to say short is=\r\n better. I find that spirits speak in bursts of energy and if I record for =\r\nlong periods of time I get very little but if I record for a short period o=\r\nf time they make much better use of that time. Also it is much easier to an=\r\nalyze short recordings in depth.\n&gt; \n&gt; The only time Ive recorded long sessi=\r\nons is if I am in a group or circle and want to record whats being said by =\r\nus as well as spirit. Being out on investigations one might choose to recor=\r\nd there longer as you\n document your investigation but for straight evp wor=\r\nk i usually do between 30 seconds and 3 minutes and no longer. They use the=\r\n time wisely. And the voices are much louder. When doing the group or circl=\r\ne such as with a medium they also have been loud as we were but again its m=\r\nuch more energy in the room when doing those things.\n&gt; \n&gt; Again its just my=\r\n viewpoint and others may think differently or have different experiences. =\r\nHope that helps!\n&gt; \n&gt; Misty\n&gt; \n&gt; --- In EVP-ITC@yahoogroups .com, &quot;mrscapta=\r\ninjack2&quot; &lt;jjkamp@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hi guys! I didn&#39;t receive any response to=\r\n my last question, and maybe that&#39;s because everyone is busy with real life=\r\n and whatnot. I know some of you were out of town, so I thought I&#39;d post my=\r\n question again, hoping\n someone will be kind enough to offer his or her in=\r\nfinite wisdom and opinions.\n&gt; &gt; \n&gt; &gt; What is a &quot;tech,&quot; and is it desirable =\r\nto have one? Is this like a helper on the other side? I&#39;ve tried googling t=\r\nhis, but haven&#39;t found anything about this anywhere. \n&gt; &gt; \n&gt; &gt; Do you guys =\r\nfind that it&#39;s better to do short sessions (15 minutes) or long ones (two h=\r\nours)? Do the entities get exhausted quickly, or do they have to get going =\r\nand need time to do it?\n&gt; &gt; \n&gt; &gt; Thanks in advance for you answers!\n&gt; &gt; \n&gt; =\r\n&gt; Jill\n&gt; &gt;\n&gt;\n\n\n\n\n      \n \n\n      \n\n    \n    \n\t\n\t \n\t\n\t\n\n\n\n\n\n\n\n\n\t\n\n\n\t\n\t\n\n\n   =\r\n   \r\n--0-1983414974-1253061433=:5021\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;Hi Misty,&lt;br&gt;&lt;br&gt;I like what you said. You ar=\r\ne right also in the fact that some know more, some know less and some think=\r\n they know it all.&nbsp; &lt;img src=3D&quot;http://mail.yimg.com/us.yimg.com/i/mes=\r\ng/tsmileys2/01.gif&quot;&gt;&lt;br&gt;&lt;br&gt;&lt;p&gt;Regards,&lt;br&gt;Jon in Texas&lt;/p&gt;&lt;p&gt;&nbsp;&lt;/p&gt;&lt;br=\r\n&gt;&lt;br&gt;--- On &lt;b&gt;Tue, 9/15/09, Misty Dawn &lt;i&gt;&lt;bulletbabea@...&gt;&lt;/i=\r\n&gt;&lt;/b&gt; wrote:&lt;br&gt;&lt;blockquote style=3D&quot;border-left: 2px solid rgb(16, 16, 255=\r\n); margin-left: 5px; padding-left: 5px;&quot;&gt;&lt;br&gt;From: Misty Dawn &lt;bulletbab=\r\nea@...&gt;&lt;br&gt;Subject: Re: [EVP-ITC] Re: Is there anybody out there?&lt;=\r\nbr&gt;To: EVP-ITC@yahoogroups.com&lt;br&gt;Date: Tuesday, September 15, 2009, 6:51 P=\r\nM&lt;br&gt;&lt;br&gt;&lt;div id=3D&quot;yiv551530788&quot;&gt;\n\n\n\n\n&lt;span style=3D&quot;display: none;&quot;&gt;&nbsp=\r\n;&lt;/span&gt;\n\n    &lt;div id=3D&quot;ygrp-text&quot;&gt;\n                  &lt;p&gt;&lt;table border=3D&quot;=\r\n0&quot; cellpadding=3D&quot;0&quot; cellspacing=3D&quot;0&quot;&gt;&lt;tbody&gt;&lt;tr&gt;&lt;td style=3D&quot;font-family:=\r\n inherit; font-style: inherit; font-variant: inherit; font-weight: inherit;=\r\n font-size: inherit; line-height: inherit; font-size-adjust: inherit; font-=\r\nstretch: inherit; -x-system-font: none;&quot; valign=3D&quot;top&quot;&gt;&lt;div&gt;Yes Jill. Agai=\r\nn thats just their opinion and experience. Perhaps for them they think they=\r\n need to run if two hours before it gets anything. For others its immediate=\r\n. this is why I always tell people to run experiments, try different things=\r\n out and eventually you too will form your own opinion about what works bes=\r\nt for you. &lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;There are NO experts in this feild=\r\n of research just those who know more, those who know less, and those who t=\r\nhink they know everything =3D)&lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;What works for =\r\nme may not work for you and vice versa. So just try things out for yourselv=\r\nes and see where it takes you. Its a fun journey.&lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;=\r\ndiv&gt;Good luck!&lt;/div&gt;\n&lt;div&gt;Misty&lt;br&gt;&lt;br&gt;--- On &lt;b&gt;Tue, 9/15/09, mrscaptainja=\r\nck2 &lt;i&gt;&lt;jjkamp@netzero. com&gt;&lt;/i&gt;&lt;/b&gt; wrote:&lt;br&gt;&lt;/div&gt;\n&lt;blockquote sty=\r\nle=3D&quot;border-left: 2px solid rgb(16, 16, 255);&quot;&gt;&lt;br&gt;From: mrscaptainjack2 &=\r\nlt;jjkamp@netzero. com&gt;&lt;br&gt;Subject: [EVP-ITC] Re: Is there anybody out t=\r\nhere?&lt;br&gt;To: EVP-ITC@yahoogroups .com&lt;br&gt;Date: Tuesday, September 15, 2009,=\r\n 4:06 PM&lt;br&gt;&lt;br&gt;\n&lt;div id=3D&quot;yiv168224781&quot;&gt;&lt;span&gt;&nbsp;&lt;/span&gt; \n&lt;div id=3D&quot;y=\r\ngrp-text&quot;&gt;\n&lt;div&gt;Thanks, Misty!&lt;br&gt;&lt;br&gt;I had a guy named Steve come through =\r\nalmost every session, so maybe he was my &quot;tech.&quot; The last session I had bef=\r\nore the dry spell (when I quit for a while due to sickness), Steve was sort=\r\n of flippant and gave a bunch of stupid answers, so now I&#39;m kind of hoping =\r\nhe&#39;s gone on vacation. But I did two sessions yesterday, and very little ca=\r\nme through except for being told that a family friend has died (I&#39;m waiting=\r\n to see if that bit of prediction has come true). So maybe, like you said, =\r\nSteve &quot;led&quot; everyone and made things come through clearer. I guess time wil=\r\nl tell. If he&#39;d behave himself, I&#39;d welcome him back.&lt;br&gt;&lt;br&gt;So I&#39;m wonderi=\r\nng, what&#39;s the rationale behind this comment:&lt;br&gt;&lt;br&gt;First, the MiniBox wor=\r\nks best with time. If you do not have two hours to devote to a session, you=\r\n might be disappointed. You should have the device running in the place you=\r\n will be using it for at least 15 minutes; during this time you can fine tu=\r\nne\n settings and volume. Never expect the Box to &quot;Hit the ground running,&quot; =\r\nso to speak; it happens occasionally, that an operator can turn on the box =\r\nand get an immediate message, but it hasn&#39;t happened often in the ASUP&#39;s te=\r\nsts.&lt;br&gt;&lt;br&gt;&lt;a rel=3D&quot;nofollow&quot; target=3D&quot;_blank&quot; href=3D&quot;http://www.asup-i=\r\nnc.org/interimminiboxreport.htm&quot;&gt;http://www.asup- inc.org/interimm iniboxre=\r\nport. htm&lt;/a&gt;&lt;br&gt;&lt;br&gt;I can&#39;t imagine the above quote is good advice. The ve=\r\nry first moment I turned on my little hacked box, I got a clear, loud messa=\r\nge: I see you. It freaked me out so bad, I turned it off immediately and it=\r\n took three days to work up the nerve to try again! So I don&#39;t know what th=\r\nese people are talking about, that you can&#39;t hit the ground running. I&#39;ve r=\r\nead about lots of folks doing just that.&lt;br&gt;&lt;br&gt;I was kind of thinking that=\r\n shorter was better, too, but I wanted to make sure, because if I was wrong=\r\n, maybe letting it run a long time might get even better responses... but\n =\r\nyeah, I\n think they get tired, as it probably takes a lot of effort to form=\r\n those words.&lt;br&gt;&lt;br&gt;I was also thinking all those skeptics who say the box=\r\nes don&#39;t work are probably not treating their sessions like EVP -- I can ne=\r\nver hear much of anything during the session, only afterward when I listen =\r\nback and at very high volume. At least for me, most of the bulk of the comm=\r\nunication is very, very quiet and located in between the louder snippets of=\r\n strong-signaled radio announcer voices. I imagine it might be louder and c=\r\nlearer if I took my set-up to a haunted location (or some place lots of hum=\r\nan emotions were felt), but since my set-up isn&#39;t really geared for that, I=\r\n haven&#39;t done it yet. &lt;br&gt;&lt;br&gt;--- In &lt;a rel=3D&quot;nofollow&quot; target=3D&quot;_blank&quot; =\r\nhref=3D&quot;http://us.mc329.mail.yahoo.com/mc/compose?to=3DEVP-ITC%40yahoogroup=\r\ns.com&quot;&gt;EVP-ITC@yahoogroups .com&lt;/a&gt;, &quot;bulletbabea&quot; &lt;bulletbabea@ ...&gt;=\r\n wrote:&lt;br&gt;&gt;&lt;br&gt;&gt; Hiya Jill. yep\n everyone had a busy weekend. Many o=\r\nut of town at the various events or dealing with family and work. Some are =\r\nrecovering from having too much fun.&lt;br&gt;&gt; &lt;br&gt;&gt; A tech in reference t=\r\no evp usually represents what some others call a guide. A helper of sorts w=\r\nhether its just to get information or to help resolve an issue. They often =\r\nappear over and over and act as a &quot;lead&quot; for the group of speakers.&lt;br&gt;&gt;=\r\n &lt;br&gt;&gt; As for how long you record personally I have to say short is bett=\r\ner. I find that spirits speak in bursts of energy and if I record for long =\r\nperiods of time I get very little but if I record for a short period of tim=\r\ne they make much better use of that time. Also it is much easier to analyze=\r\n short recordings in depth.&lt;br&gt;&gt; &lt;br&gt;&gt; The only time Ive recorded lon=\r\ng sessions is if I am in a group or circle and want to record whats being s=\r\naid by us as well as spirit. Being out on investigations one might choose t=\r\no record there longer as you\n document your investigation but for straight =\r\nevp work i usually do between 30 seconds and 3 minutes and no longer. They =\r\nuse the time wisely. And the voices are much louder. When doing the group o=\r\nr circle such as with a medium they also have been loud as we were but agai=\r\nn its much more energy in the room when doing those things.&lt;br&gt;&gt; &lt;br&gt;&gt=\r\n; Again its just my viewpoint and others may think differently or have diff=\r\nerent experiences. Hope that helps!&lt;br&gt;&gt; &lt;br&gt;&gt; Misty&lt;br&gt;&gt; &lt;br&gt;&gt;=\r\n --- In &lt;a rel=3D&quot;nofollow&quot; target=3D&quot;_blank&quot; href=3D&quot;http://us.mc329.mail.=\r\nyahoo.com/mc/compose?to=3DEVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups .c=\r\nom&lt;/a&gt;, &quot;mrscaptainjack2&quot; &lt;jjkamp@&gt; wrote:&lt;br&gt;&gt; &gt;&lt;br&gt;&gt; &gt; =\r\nHi guys! I didn&#39;t receive any response to my last question, and maybe that&#39;=\r\ns because everyone is busy with real life and whatnot. I know some of you w=\r\nere out of town, so I thought I&#39;d post my question again, hoping\n someone w=\r\nill be kind enough to offer his or her infinite wisdom and opinions.&lt;br&gt;&gt=\r\n; &gt; &lt;br&gt;&gt; &gt; What is a &quot;tech,&quot; and is it desirable to have one? Is =\r\nthis like a helper on the other side? I&#39;ve tried googling this, but haven&#39;t=\r\n found anything about this anywhere. &lt;br&gt;&gt; &gt; &lt;br&gt;&gt; &gt; Do you guy=\r\ns find that it&#39;s better to do short sessions (15 minutes) or long ones (two=\r\n hours)? Do the entities get exhausted quickly, or do they have to get goin=\r\ng and need time to do it?&lt;br&gt;&gt; &gt; &lt;br&gt;&gt; &gt; Thanks in advance for =\r\nyou answers!&lt;br&gt;&gt; &gt; &lt;br&gt;&gt; &gt; Jill&lt;br&gt;&gt; &gt;&lt;br&gt;&gt;&lt;br&gt;&lt;br&gt;&lt;/=\r\ndiv&gt;&lt;/div&gt;&lt;/div&gt;&lt;/blockquote&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/tbody&gt;&lt;/table&gt;&lt;br&gt;\n\n      &lt;/p&gt;\n \n\n=\r\n    &lt;/div&gt;  \n\n\n\t \n\t\n\t&lt;/div&gt;&lt;/blockquote&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n      \r\n--0-1983414974-1253061433=:5021--"}