{"id": "1597", "subject": "Re: Please take your negative remarks off this group to private emails", "author": "Steve Hultay", "timestamp": "2007-07-15T21:40:45Z", "full_text": "I agree and i&#39;m sorry to all involved.  This was very inappropriate \nhere on my part and i apologize.  Let&#39;s continue with our findings.  \nNo more dumb bickering, just evidence of our of different ideas. \nThis board is important to me and i&#39;ll continue only business from \nhere on out.\n\n-Steve\n\n\n--- In EVP-ITC@yahoogroups.com, Tinamarie bianchino \n&lt;gypsyharlot1111@...&gt; wrote:\n&gt;\n&gt; Nicely said. I am new to this group as well as to this type \nresearch so I have been just sitting back and reading so that I \nmight better understand the whole area of EVP. Quite \ntruthfully......the squabbling is juvenile and worthless and a big \nturn off. Those who are arguing and power playing.... shut up (AT \nLEAST ON THIS SITE) or get out because your personal attitudes \ntowards each other can carry on some where else on your own time. \nPlease evaluate your your true motives for being involved in a feild \nwe are barely touching the surface of. Time can be spent much \nbetter...dont you think.\n&gt; \n&gt; \n&gt; \n&gt; ----- Original Message ----\n&gt; From: Misty Dawn &lt;bulletbabea@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Sunday, July 15, 2007 9:08:42 AM\n&gt; Subject: Re: [EVP-ITC] Please take your negative remarks off this \ngroup to private emails\n&gt; \n&gt; Just a note to remind everyone we arent here to argue we are here \nto research together. So if you have negative remarks to make to \neach other or discussions which should be done in private take them \noff this group to private emails. We dont need the negativity here \nit interferes with the work we are trying to do and wont be \ntolerated.\n&gt; \n&gt; Nobody is better than anyone else or less worthy for contact than \nanyone else. \n&gt;  \n&gt; Misty\n&gt;  \n&gt;  \n&gt; \n&gt; \n&gt; Sucker-punch spam with award-winning protection.\n&gt; Try the free Yahoo! Mail Beta.\n&gt; \n&gt; \n&gt; \n&gt;        \n&gt; \n_____________________________________________________________________\n_______________Ready for the edge of your seat? \n&gt; Check out tonight&#39;s top picks on Yahoo! TV. \n&gt; http://tv.yahoo.com/\n&gt;"}