{"id": "15983", "subject": "Re: Introduction and a question", "author": "bulletbabea", "timestamp": "2009-09-16T20:33:11Z", "full_text": "Hiya Phil nice to see you here. All of Frank&#39;s boxes are made by Frank himself. If you want to make something quick you can make yourself can try one of the hacks or manual sweep. Heres a couple links for you on how to modify some radios. Mike C. and Steve H. have been kind enough to demonstrate it for you guys in some how to videos. \n\nMike&#39;s website\nhttp://www.ufogeek.com\n\nSteve&#39;s website\nhttp://www.keyportparanormal.com\n\nThere are many how-to videos posted on youtube.\n\nMisty\n\n--- In EVP-ITC@yahoogroups.com, &quot;pollux41101&quot; &lt;kentuckyghosthunter@...&gt; wrote:\n&gt;\n&gt; Just wanted to say hello to the group and that I am very happy to be a part of this community.\n&gt; \n&gt; My name is Phil and I&#39;ve been doing research (in and out of the field) into the paranormal for several years.  \n&gt; \n&gt; As it stands I&#39;m looking to expand my knowledge and technical base in EVP research.\n&gt; \n&gt; I&#39;ve done some searching through the board and files here and I have found myself somewhat perplexed by the variety of different boxes and hacks available.\n&gt; \n&gt; I would much appreciate it if someone could point me in the direction of a good box schematic to build that&#39;s relatively reliable (doesn&#39;t have to be bleeding edge or anything) and somewhat current.  \n&gt; \n&gt; Is it best to grab one of the box schematics floating around or is a RS Hack the way to begin?  And which schematic/hack would be best to start with?\n&gt; \n&gt; I apologize for the completely bland question, but it&#39;s difficult to decipher what&#39;s current and what is not and what&#39;s best to start with through the posts I&#39;ve found up to this point.\n&gt; \n&gt; I appreciate any and all help anyone could offer and I look forward to getting to you all and working with the community.\n&gt; \n&gt; Thanks,\n&gt; -Phil\n&gt;"}