{"id": "15984", "subject": "Re: Voice inflections?", "author": "bulletbabea", "timestamp": "2009-09-16T20:46:20Z", "full_text": "I think quite often when the message isn&#39;t for me and it&#39;s for someone outside of this research it matters very much that the message is something I myself would never know. It hits home so much more for the recipient. To me it may seem dumb or meaningless but to the person who the message is for it can have a deeper impact because they know theres no way possible I could know the info. And vice versa when the message is for me sometimes the info doesnt become clear til much later down the road when I learn that bit of info or watch that predictive message become reality. It&#39;s all very interesting and educational =)\n\nMisty\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;April Abercrombie&quot; &lt;april@...&gt; wrote:\n&gt;\n&gt; The only way to prove 100% that something you receive through the box is authentic communication, is if they say something that you can verify, something you yourself did not know.\n&gt; \n&gt;   ----- Original Message ----- \n&gt;   From: Misty Dawn \n&gt;   To: EVP-ITC@yahoogroups.com \n&gt;   Sent: Wednesday, September 16, 2009 3:41 AM\n&gt;   Subject: Re: [EVP-ITC] Voice inflections?\n&gt; \n&gt; \n&gt;     I have gotten many life like voices over the years. My first evp was my mothers voice and no boxes were involved. The box is a tool/method and there are many ways to get their voices heard. So in the different methods I have used, yes I have heard voices that resemble their lifetime charachteristics and tones. Is it always that way? No. \n&gt; \n&gt;         Most often the group will speak as one voice because I have requested they do so. One voice tone will begin a sentence and another will end it. So I may hear my female friends voice start off a thought and an unknown male voice finish the sentence. And vice versa often they speak in tones which do not even come close to what they sounded like in life. Quite often they are spirits I didnt know in life. I may get someone saying This is edison, and then find an old recording he did where he starts it off saying This is edison, but for me I do not know the man so there is no recognition for me. I document it and file it away as a curiousity.\n&gt; \n&gt;         I always laugh when people say thats not your mother or friend thats something trying to fool you and mess with your head. I knew my mother longer than anyone and its interesting that it is easier for those people to believe that its possible that something/someone else is speaking pretending to be my mother but its much harder for them to believe that quite possibly that really is my mother keeping her promise to stay in touch after death. If one is possible then so is the other. I tend to be stubborn in some respects in that I dont instantly believe what anyone tells me whether living or not. If they give me a message I think is dumb I am very reluctant to pass it on and usually those are the ones that get the biggest confirmations tho it means nothing to me at the time. So yes quite possibly evp work can be used the same as mediumship in missing persons cases.\n&gt; \n&gt;         For me tone of voice has grown to mean nothing. It is a treat when they manage to come across sounding as they did when in physical form here but I look beyond the tone of voice. Often people get a childs voice and they become saddened by the thought that a child is earthbound. But I see it just as a representation of voice and whether it comes across as male female child or robot matters little to me.\n&gt; \n&gt;         I do find they often resume the &quot;character&quot; they played because after all that is sort of what we are, characters in some giant play. Whether it is the beliefs they had which were their trademark, the tone of voice, their image, or use of some nickname even I dont know about I look at it all as just a pixel in a larger portrait that some part survives once the body has ceased to function. And the message is simply, our energy continues on.\n&gt; \n&gt;         Quote by Einstein: &#39;Energy cannot be created or destroyed, it can only be changed from one form to another.&#39;\n&gt; \n&gt;         Misty (the insomniac is up way tooooo late and rambling on LOL)\n&gt; \n&gt;         --- On Tue, 9/15/09, mrscaptainjack2 &lt;jjkamp@...&gt; wrote:\n&gt; \n&gt; \n&gt;           From: mrscaptainjack2 &lt;jjkamp@...&gt;\n&gt;           Subject: [EVP-ITC] Voice inflections?\n&gt;           To: EVP-ITC@yahoogroups.com\n&gt;           Date: Tuesday, September 15, 2009, 9:56 PM\n&gt; \n&gt; \n&gt;             \n&gt;           I was googling about AM radio reception, and I came across the below exchange on a forum. It talks about using the box to find missing persons (which I didn&#39;t know was possible), and the conversation mentions hearing specific voice inflections and recognizing a dead person&#39;s specific voice on the box. My question is, do any of you get a recognizable voice? The voices I get always sound robotic, although I do get clearly male or female voices. \n&gt; \n&gt;           http://www.itcbridg e.com/forum/ view_topic. php?id=515& forum_id= 31\n&gt;"}