{"id": "15986", "subject": "Re: [EVP-ITC] Re: Voice inflections?", "author": "Misty Dawn", "timestamp": "2009-09-16T21:30:33Z", "full_text": "--0-621900345-1253136633=:45603\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nThere is no doubt in my mind about that. You are right April =3D) In the be=\r\nginning I did seek some proof for my own sanity. But time and time again I =\r\nhave learned much more than I ever expected to. For me its=A0become more th=\r\nan about contact with my dead loved ones, its more about learning and growi=\r\nng from the experiences. That definitely has been the end result. \n=A0\nMist=\r\ny\n\n--- On Wed, 9/16/09, April Abercrombie &lt;april@abercrombieghostresearch.c=\r\nom&gt; wrote:\n\n\nFrom: April Abercrombie &lt;april@...&gt;\nS=\r\nubject: Re: [EVP-ITC] Re: Voice inflections?\nTo: EVP-ITC@yahoogroups.com\nDa=\r\nte: Wednesday, September 16, 2009, 5:14 PM\n\n\n=A0 \n\n\n\n\nI would definitely ca=\r\nll that proof. The strength of the proof is in the part that you knew nothi=\r\nng about what the message would mean to the person, or if it a message for =\r\nyou, it was some fact that you had not known prior.\n=A0\nIMO, in this case t=\r\nhere is no way it would be a case matrixing or hearing what you wanted or e=\r\nxpected to hear, that it was real information conveyed through an intellige=\r\nnt source.\n=A0\n\n----- Original Message ----- \nFrom: bulletbabea \nTo: EVP-IT=\r\nC@yahoogroups .com \nSent: Wednesday, September 16, 2009 2:46 PM\nSubject: [E=\r\nVP-ITC] Re: Voice inflections?\n\n=A0 \n\nI think quite often when the message =\r\nisn&#39;t for me and it&#39;s for someone outside of this research it matters very =\r\nmuch that the message is something I myself would never know. It hits home =\r\nso much more for the recipient. To me it may seem dumb or meaningless but t=\r\no the person who the message is for it can have a deeper impact because the=\r\ny know theres no way possible I could know the info. And vice versa when th=\r\ne message is for me sometimes the info doesnt become clear til much later d=\r\nown the road when I learn that bit of info or watch that predictive message=\r\n become reality. It&#39;s all very interesting and educational =3D)\n\nMisty\n\n---=\r\n In EVP-ITC@yahoogroups .com, &quot;April Abercrombie&quot; &lt;april@...&gt; wrote:\n&gt;\n&gt; Th=\r\ne only way to prove 100% that something you receive through the box is auth=\r\nentic communication, is if they say something that you can verify, somethin=\r\ng you yourself did not know.\n&gt; \n&gt; ----- Original Message ----- \n&gt; From: Mis=\r\nty Dawn \n&gt; To: EVP-ITC@yahoogroups .com \n&gt; Sent: Wednesday, September 16, 2=\r\n009 3:41 AM\n&gt; Subject: Re: [EVP-ITC] Voice inflections?\n&gt; \n&gt; \n&gt; I have gott=\r\nen many life like voices over the years. My first evp was my mothers voice =\r\nand no boxes were involved. The box is a tool/method and there are many way=\r\ns to get their voices heard. So in the different methods I have used, yes I=\r\n have heard voices that resemble their lifetime charachteristics and tones.=\r\n Is it always that way? No. \n&gt; \n&gt; Most often the group will speak as one vo=\r\nice because I have requested they do so. One voice tone will begin a senten=\r\nce and another will end it. So I may hear my female friends voice start off=\r\n a thought and an unknown male voice finish the sentence. And vice versa of=\r\nten they speak in tones which do not even come close to what they sounded l=\r\nike in life. Quite often they are spirits I didnt know in life. I may get s=\r\nomeone saying This is edison, and then find an old recording he did where h=\r\ne starts it off saying This is edison, but for me I do not know the man so =\r\nthere is no recognition for me. I document it and file it away as a curious=\r\nity.\n&gt; \n&gt; I always laugh when people say thats not your mother or friend th=\r\nats something trying to fool you and mess with your head. I knew my mother =\r\nlonger than anyone and its interesting that it is easier for those people t=\r\no believe that its possible that something/someone else is speaking pretend=\r\ning to be my mother but its much harder for them to believe that quite poss=\r\nibly that really is my mother keeping her promise to stay in touch after de=\r\nath. If one is possible then so is the other. I tend to be stubborn in some=\r\n respects in that I dont instantly believe what anyone tells me whether liv=\r\ning or not. If they give me a message I think is dumb I am very reluctant t=\r\no pass it on and usually those are the ones that get the biggest confirmati=\r\nons tho it means nothing to me at the time. So yes quite possibly evp work =\r\ncan be used the same as mediumship in missing persons cases.\n&gt; \n&gt; For me to=\r\nne of voice has grown to mean nothing. It is a treat when they manage to co=\r\nme across sounding as they did when in physical form here but I look beyond=\r\n the tone of voice. Often people get a childs voice and they become saddene=\r\nd by the thought that a child is earthbound. But I see it just as a represe=\r\nntation of voice and whether it comes across as male female child or robot =\r\nmatters little to me.\n&gt; \n&gt; I do find they often resume the &quot;character&quot; they=\r\n played because after all that is sort of what we are, characters in some g=\r\niant play. Whether it is the beliefs they had which were their trademark, t=\r\nhe tone of voice, their image, or use of some nickname even I dont know abo=\r\nut I look at it all as just a pixel in a larger portrait that some part sur=\r\nvives once the body has ceased to function. And the message is simply, our =\r\nenergy continues on.\n&gt; \n&gt; Quote by Einstein: &#39;Energy cannot be created or d=\r\nestroyed, it can only be changed from one form to another.&#39;\n&gt; \n&gt; Misty (the=\r\n insomniac is up way tooooo late and rambling on LOL)\n&gt; \n&gt; --- On Tue, 9/15=\r\n/09, mrscaptainjack2 &lt;jjkamp@...&gt; wrote:\n&gt; \n&gt; \n&gt; From: mrscaptainjack2 &lt;jjk=\r\namp@...&gt;\n&gt; Subject: [EVP-ITC] Voice inflections?\n&gt; To: EVP-ITC@yahoogroups =\r\n.com\n&gt; Date: Tuesday, September 15, 2009, 9:56 PM\n&gt; \n&gt; \n&gt; \n&gt; I was googling=\r\n about AM radio reception, and I came across the below exchange on a forum.=\r\n It talks about using the box to find missing persons (which I didn&#39;t know =\r\nwas possible), and the conversation mentions hearing specific voice inflect=\r\nions and recognizing a dead person&#39;s specific voice on the box. My question=\r\n is, do any of you get a recognizable voice? The voices I get always sound =\r\nrobotic, although I do get clearly male or female voices. \n&gt; \n&gt; http://www.=\r\nitcbridg e.com/forum/ view_topic. php?id=3D515& forum_id=3D 31\n&gt;\n\n\n\n\n\n\n\n\n\n\n=\r\n\n\n\n\n\n\n\n      \r\n--0-621900345-1253136633=:45603\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;DIV&gt;There is no doubt in my mind about that.=\r\n You are right April =3D) In the beginning I did seek some proof for my own=\r\n sanity. But time and time again I have learned much more than I ever expec=\r\nted to. For me its&nbsp;become more than about contact with my dead loved o=\r\nnes, its more about learning and growing from the experiences. That definit=\r\nely has been the end result. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Misty&lt;BR&gt;&lt;BR&gt;---=\r\n On &lt;B&gt;Wed, 9/16/09, April Abercrombie &lt;I&gt;&lt;april@abercrombieghostresearc=\r\nh.com&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;&lt;/DIV&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: rgb(16=\r\n,16,255) 2px solid; PADDING-LEFT: 5px; MARGIN-LEFT: 5px&quot;&gt;&lt;BR&gt;From: April Ab=\r\nercrombie &lt;april@...&gt;&lt;BR&gt;Subject: Re: [EVP-I=\r\nTC] Re: Voice inflections?&lt;BR&gt;To: EVP-ITC@yahoogroups.com&lt;BR&gt;Date: Wednesda=\r\ny, September 16, 2009, 5:14 PM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3Dyiv1610108539&gt;&lt;SPAN style=\r\n=3D&quot;DISPLAY: none&quot;&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV id=3Dygrp-text&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;FONT siz=\r\ne=3D2 face=3D&quot;Myriad Pro&quot;&gt;I would definitely call that proof. The strength =\r\nof the proof is in the part that you knew nothing about what the message wo=\r\nuld mean to the person, or if it a message for you, it was some fact that y=\r\nou had not known prior.&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 face=3D&quot;Myriad Pro=\r\n&quot;&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 face=3D&quot;Myriad Pro&quot;&gt;IMO, in this =\r\ncase there is no way it would be a case matrixing or hearing what you wante=\r\nd or expected to hear, that it was real information conveyed through an int=\r\nelligent source.&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 face=3D&quot;Myriad Pro&quot;&gt;&lt;/FON=\r\nT&gt;&nbsp;&lt;/DIV&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: #000000 2px solid&quot; dir=3Dl=\r\ntr&gt;\n&lt;DIV style=3D&quot;FONT: 10pt arial&quot;&gt;----- Original Message ----- &lt;/DIV&gt;\n&lt;DI=\r\nV style=3D&quot;FONT: 10pt arial; BACKGROUND: #e4e4e4&quot;&gt;&lt;B&gt;From:&lt;/B&gt; &lt;A title=3Db=\r\nulletbabea@... href=3D&quot;http://us.mc329.mail.yahoo.com/mc/compose?to=\r\n=3Dbulletbabea@...&quot; rel=3Dnofollow target=3D_blank ymailto=3D&quot;mailto:=\r\nbulletbabea@...&quot;&gt;bulletbabea&lt;/A&gt; &lt;/DIV&gt;\n&lt;DIV style=3D&quot;FONT: 10pt aria=\r\nl&quot;&gt;&lt;B&gt;To:&lt;/B&gt; &lt;A title=3DEVP-ITC@yahoogroups.com href=3D&quot;http://us.mc329.ma=\r\nil.yahoo.com/mc/compose?to=3DEVP-ITC@yahoogroups.com&quot; rel=3Dnofollow target=\r\n=3D_blank ymailto=3D&quot;mailto:EVP-ITC@yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups .c=\r\nom&lt;/A&gt; &lt;/DIV&gt;\n&lt;DIV style=3D&quot;FONT: 10pt arial&quot;&gt;&lt;B&gt;Sent:&lt;/B&gt; Wednesday, Septe=\r\nmber 16, 2009 2:46 PM&lt;/DIV&gt;\n&lt;DIV style=3D&quot;FONT: 10pt arial&quot;&gt;&lt;B&gt;Subject:&lt;/B&gt;=\r\n [EVP-ITC] Re: Voice inflections?&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; =\r\n\n&lt;DIV id=3Dygrp-text&gt;\n&lt;DIV&gt;I think quite often when the message isn&#39;t for m=\r\ne and it&#39;s for someone outside of this research it matters very much that t=\r\nhe message is something I myself would never know. It hits home so much mor=\r\ne for the recipient. To me it may seem dumb or meaningless but to the perso=\r\nn who the message is for it can have a deeper impact because they know ther=\r\nes no way possible I could know the info. And vice versa when the message i=\r\ns for me sometimes the info doesnt become clear til much later down the roa=\r\nd when I learn that bit of info or watch that predictive message become rea=\r\nlity. It&#39;s all very interesting and educational =3D)&lt;BR&gt;&lt;BR&gt;Misty&lt;BR&gt;&lt;BR&gt;--=\r\n- In &lt;A href=3D&quot;http://us.mc329.mail.yahoo.com/mc/compose?to=3DEVP-ITC%40ya=\r\nhoogroups.com&quot; rel=3Dnofollow target=3D_blank ymailto=3D&quot;mailto:EVP-ITC%40y=\r\nahoogroups.com&quot;&gt;EVP-ITC@yahoogroups .com&lt;/A&gt;, &quot;April Abercrombie&quot; &lt;april=\r\n@...&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; The only way to prove 100% that something y=\r\nou receive through the box\n is authentic communication, is if they say some=\r\nthing that you can verify, something you yourself did not know.&lt;BR&gt;&gt; &lt;BR=\r\n&gt;&gt; ----- Original Message ----- &lt;BR&gt;&gt; From: Misty Dawn &lt;BR&gt;&gt; To: &lt;=\r\nA href=3D&quot;http://us.mc329.mail.yahoo.com/mc/compose?to=3DEVP-ITC%40yahoogro=\r\nups.com&quot; rel=3Dnofollow target=3D_blank ymailto=3D&quot;mailto:EVP-ITC%40yahoogr=\r\noups.com&quot;&gt;EVP-ITC@yahoogroups .com&lt;/A&gt; &lt;BR&gt;&gt; Sent: Wednesday, September =\r\n16, 2009 3:41 AM&lt;BR&gt;&gt; Subject: Re: [EVP-ITC] Voice inflections?&lt;BR&gt;&gt; =\r\n&lt;BR&gt;&gt; &lt;BR&gt;&gt; I have gotten many life like voices over the years. My fi=\r\nrst evp was my mothers voice and no boxes were involved. The box is a tool/=\r\nmethod and there are many ways to get their voices heard. So in the differe=\r\nnt methods I have used, yes I have heard voices that resemble their lifetim=\r\ne charachteristics and tones. Is it always that way? No. &lt;BR&gt;&gt; &lt;BR&gt;&gt; =\r\nMost often the group will speak as one voice because I have requested they =\r\ndo so. One voice tone will\n begin a sentence and another will end it. So I =\r\nmay hear my female friends voice start off a thought and an unknown male vo=\r\nice finish the sentence. And vice versa often they speak in tones which do =\r\nnot even come close to what they sounded like in life. Quite often they are=\r\n spirits I didnt know in life. I may get someone saying This is edison, and=\r\n then find an old recording he did where he starts it off saying This is ed=\r\nison, but for me I do not know the man so there is no recognition for me. I=\r\n document it and file it away as a curiousity.&lt;BR&gt;&gt; &lt;BR&gt;&gt; I always la=\r\nugh when people say thats not your mother or friend thats something trying =\r\nto fool you and mess with your head. I knew my mother longer than anyone an=\r\nd its interesting that it is easier for those people to believe that its po=\r\nssible that something/someone else is speaking pretending to be my mother b=\r\nut its much harder for them to believe that quite possibly that really is m=\r\ny mother keeping her\n promise to stay in touch after death. If one is possi=\r\nble then so is the other. I tend to be stubborn in some respects in that I =\r\ndont instantly believe what anyone tells me whether living or not. If they =\r\ngive me a message I think is dumb I am very reluctant to pass it on and usu=\r\nally those are the ones that get the biggest confirmations tho it means not=\r\nhing to me at the time. So yes quite possibly evp work can be used the same=\r\n as mediumship in missing persons cases.&lt;BR&gt;&gt; &lt;BR&gt;&gt; For me tone of vo=\r\nice has grown to mean nothing. It is a treat when they manage to come acros=\r\ns sounding as they did when in physical form here but I look beyond the ton=\r\ne of voice. Often people get a childs voice and they become saddened by the=\r\n thought that a child is earthbound. But I see it just as a representation =\r\nof voice and whether it comes across as male female child or robot matters =\r\nlittle to me.&lt;BR&gt;&gt; &lt;BR&gt;&gt; I do find they often resume the &quot;character&quot; =\r\nthey played\n because after all that is sort of what we are, characters in s=\r\nome giant play. Whether it is the beliefs they had which were their tradema=\r\nrk, the tone of voice, their image, or use of some nickname even I dont kno=\r\nw about I look at it all as just a pixel in a larger portrait that some par=\r\nt survives once the body has ceased to function. And the message is simply,=\r\n our energy continues on.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Quote by Einstein: &#39;Energy canno=\r\nt be created or destroyed, it can only be changed from one form to another.=\r\n&#39;&lt;BR&gt;&gt; &lt;BR&gt;&gt; Misty (the insomniac is up way tooooo late and rambling =\r\non LOL)&lt;BR&gt;&gt; &lt;BR&gt;&gt; --- On Tue, 9/15/09, mrscaptainjack2 &lt;jjkamp@..=\r\n.&gt; wrote:&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; From: mrscaptainjack2 &lt;jjkamp@...=\r\n&gt;&lt;BR&gt;&gt; Subject: [EVP-ITC] Voice inflections?&lt;BR&gt;&gt; To: &lt;A href=3D&quot;h=\r\nttp://us.mc329.mail.yahoo.com/mc/compose?to=3DEVP-ITC%40yahoogroups.com&quot; re=\r\nl=3Dnofollow target=3D_blank\n ymailto=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;=\r\nEVP-ITC@yahoogroups .com&lt;/A&gt;&lt;BR&gt;&gt; Date: Tuesday, September 15, 2009, 9:5=\r\n6 PM&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; I was googling about AM radio recep=\r\ntion, and I came across the below exchange on a forum. It talks about using=\r\n the box to find missing persons (which I didn&#39;t know was possible), and th=\r\ne conversation mentions hearing specific voice inflections and recognizing =\r\na dead person&#39;s specific voice on the box. My question is, do any of you ge=\r\nt a recognizable voice? The voices I get always sound robotic, although I d=\r\no get clearly male or female voices. &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;A href=3D&quot;http://ww=\r\nw.itcbridg/&quot; rel=3Dnofollow target=3D_blank&gt;http://www.itcbridg&lt;/A&gt; e.com/f=\r\norum/ view_topic. php?id=3D515&amp; forum_id=3D 31&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/D=\r\nIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n      \r\n--0-621900345-1253136633=:45603--"}