{"id": "15996", "subject": "Re: The usual stuff", "author": "mrscaptainjack2", "timestamp": "2009-09-17T04:52:16Z", "full_text": "I think you are much too generous with these entities.  If you had a real live person in your life who was causing you this much grief, you&#39;d certainly give him the boot, wouldn&#39;t you?  It&#39;s one thing to welcome all comers, but another to suffer from doing so -- and from hearing the messages you get, I can&#39;t see how it wouldn&#39;t have a negative effect on you.  I&#39;d tell them to go toward the light; you might be doing them a favor.  (Again, just my opinion, so feel free to tell me to take a flying leap!)\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  I always welcome everything. It&#39;s not always the same voices, and it doesn&#39;t matter waht I&#39;m using. But--I did do an EVP session last night and they said it was an unethical spirit doing that-then they talked about end of cycles stuff-so what&#39;s the difference?\n&gt; \n&gt;  F-S\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;mrscaptainjack2&quot; &lt;jjkamp@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Frank, have you tried asking this entity who tells you this doomsday stuff to go toward the light?  Or otherwise leave you alone?  I&#39;m wondering if he/she/it is hogging the spotlight and not letting anyone else through.  That time I was getting bullshit answers from &quot;Steve,&quot; and my Uncle Red came through, I swear I heard someone say, &quot;Get away from me&quot; -- as if Red was trying to talk, and Steve was getting in the way somehow.  Just a thought:  maybe your guys are keeping more desirable contact with benevolent entities at bay.  (Like I know anything, I&#39;m a newbie! Feel free to ignore my posts!  But I just feel so bad for you, that you keep getting all this doomsday stuff.)\n&gt; &gt; \n&gt; &gt; Jill\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt;  Went on one of the ghost hunts on the Queen may, but I don&#39;t get anything\n&gt; &gt; &gt; related to tat stuff, I get this stuff--everywhere.  I have my doubts about\n&gt; &gt; &gt; it beng true, maybe just fear junk from some level. I was using the 12-470\n&gt; &gt; &gt; hackie shack, and wouyld get littel burst of FM when I went by a window or\n&gt; &gt; &gt; outside door.\n&gt; &gt; &gt; \n&gt; &gt; &gt;  Frank-S\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}