{"id": "16", "subject": "evp", "author": "Amy Swanson", "timestamp": "2006-06-13T19:35:42Z", "full_text": "--0-882297517-1150227342=:53181\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nwell if yall are very expiereinced in this, i just started doing evp&#39;s a few weeks ago!\n  I know that these folks have been around me and some are where i live. the first time i did an evp i got nothing till the 3rd time. Then its seems that it opened a door for them, they are conversing amongst themselves saying hello to each other, that they can see, they can see the computer, one of them said he was beseiged. I didnt record again till yesterday, and i kinda wonder if they are mad? i kept getting vibes to record but have been to tired with moving. Can they get mad with you? i assume they can. When i recorded, i have been using microsoft word and typing my questions, and a little bit of talking too, if they can see the computer &lt;so they said&gt; why not?! I also used this thing from EVP maker that shows pictures and makes clicks and tones. The only thing they had to say was &quot;watch&quot; watch&quot;, wether they ment to not say anything and just watch me or refering to some of the questions i had, i dont know, cant assume anything lol. What can i do to get them to talk to\n me more? Answer questions? like no one has indentified themselves and i would really like to know who they are. I have a few people i would like to talk to that have passed over. However anyone is nice lol. I just would like to open this door MORE now, that i have closed off. I think that I opened a doorway for them but i want to interact more! People have been refering to me as a &quot;sensitive&quot;? I assume meaning that i am able to tell if they are here etc. Which i usually can. Is it possible that because in the past for the most part i have kept this part of me closed off, except those entities that refuse to be silenced come through, that they are skeptical of talking to me? That i cant handle it?\n   \n  Anyway, justthought id talk with somemore people who have &quot;been there done that&quot;\n  I would like to have someone over who has alot of history and do an evp in my home and talk to them for me. &lt;sigs&gt;\n   \n  Amy\n   \n\n\nhttp://groups.yahoo.com/group/EVP-ITC/\n   \n  LON3_S7AR  YAHOO MESENGER ID\n\n __________________________________________________\nDo You Yahoo!?\nTired of spam?  Yahoo! Mail has the best spam protection around \nhttp://mail.yahoo.com \r\n--0-882297517-1150227342=:53181\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;div&gt;well if yall are very expiereinced in this, i just started doing evp&#39;s a few weeks ago!&lt;/div&gt;  &lt;div&gt;I know that these folks have been around me and some are where i live. the first time i did an evp i got nothing till the 3rd time. Then its seems that it opened a door for them, they are conversing amongst themselves saying hello to each other, that they can see, they can see the computer, one of them said he was beseiged. I didnt record again till yesterday, and i kinda wonder if they are mad? i kept getting vibes to record but have been to tired with moving. Can they get mad with you? i assume they can. When i recorded, i have been using microsoft word and typing my questions, and a little bit of talking too, if they can see the computer &lt;so they said&gt; why not?! I also used this thing from EVP maker that shows pictures and makes clicks and tones. The only thing they had to say was &quot;watch&quot; watch&quot;, wether they ment to not say anything and just watch me or refering\n to some of the questions i had, i dont know, cant assume anything lol. What can i do to get them to talk to me more? Answer questions? like no one has indentified themselves and i would really like to know who they are. I have a few people i would like to talk to that have passed over. However anyone is nice lol. I just would like to open this door MORE now, that i have closed off. I think that I opened a doorway for them but i want to interact more! People have been refering to me as a &quot;sensitive&quot;? I assume meaning that i am able to tell if they are here etc. Which i usually can. Is it possible that because in the past for the most part i have kept this part of me closed off, except those entities that refuse to be silenced come through, that they are skeptical of talking to me? That i cant handle it?&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Anyway, justthought id talk with somemore people who have &quot;been there done that&quot;&lt;/div&gt;  &lt;div&gt;I would like to have someone over who has alot of\n history and do an evp in my home and talk to them for me. &lt;sigs&gt;&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Amy&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;&lt;BR&gt;&lt;BR&gt;&lt;div&gt;&lt;A href=&quot;http://groups.yahoo.com/group/EVP-ITC/&quot;&gt;&lt;FONT face=verdana color=#8000ff&gt;&lt;STRONG&gt;http://groups.yahoo.com/group/EVP-ITC/&lt;/STRONG&gt;&lt;/FONT&gt;&lt;/A&gt;&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;LON3_S7AR&nbsp; YAHOO MESENGER ID&lt;/div&gt;&lt;p&gt;&#32;__________________________________________________&lt;br&gt;Do You Yahoo!?&lt;br&gt;Tired of spam?  Yahoo! Mail has the best spam protection around &lt;br&gt;http://mail.yahoo.com \r\n--0-882297517-1150227342=:53181--"}