{"id": "16003", "subject": "Re: [EVP-ITC] 3 DAY LIVE EVENT - starts today Sept 18th Keith Age, \tDave and Tom Jones and many more", "author": "David Koenig", "timestamp": "2009-09-18T14:57:48Z", "full_text": "Yes!!! thanks for the heads up!I like the channel.\nDave\n\nOn Fri, Sep 18, 2009 at 10:37 AM, Fransen, Debbie\n&lt;debbie.fransen@...&gt;wrote:\n\n&gt;\n&gt;\n&gt; thx Misty for the heads up\n&gt; See ya in the chat !!!!!!\n&gt; deb\n&gt;\n&gt;  ------------------------------\n&gt; *From:* EVP-ITC@yahoogroups.com [mailto:EVP-ITC@yahoogroups.com] *On\n&gt; Behalf Of *Misty Dawn\n&gt; *Sent:* Friday, September 18, 2009 7:40 AM\n&gt; *To:* EVP-ITC@yahoogroups.com\n&gt; *Subject:* [EVP-ITC] 3 DAY LIVE EVENT - starts today Sept 18th Keith Age,\n&gt; Dave and Tom Jones and many more\n&gt;\n&gt;\n&gt;\n&gt;   *Ok guys I said I would try and give you guys a heads up since many of\n&gt; you enjoyed the past live events on PTN so here ya go. Paranormal Television\n&gt; Network is broadcasting another live event this weekend September 18th -\n&gt; 20th. *\n&gt; **\n&gt;  www.paranormaltvnetwork.com\n&gt; or\n&gt; www.paranormaltelevisionnetwork.com\n&gt; **\n&gt; *It will be free to watch and participate in the interactive chat. For\n&gt; more info you can check out www.octagonhall.com. Afternoon\n&gt; activities include many guest speakers on a variety of subjects,\n&gt; re-enactors, living history demo&#39;s, live cannon fire, raffles, contests, and\n&gt; music along with other activities. And yes they will be having a ghosthunt\n&gt; at night there as well for those who are interested in the paranormal side\n&gt; of the location. *\n&gt; **\n&gt; *Guest speakers at the Octagon Hall commemoration will include Bryan Bush,\n&gt; Dr. Ron Hatcher, Dr. Michael Trapasso, Paul Browning, Keith Age, Chris\n&gt; Dedman, and Rhiannon Waits. Paul Browning has written a book entitled\n&gt; Hauntings at Octagon Hall. Dave and Tom Jones Para-X Radio\n&gt; CBS Psychiconair Clarksville Ghost Hunters and a few surprise guests.*\n&gt; ****\n&gt; *GHOST HUNTERS WILL ENCOUNTER\n&gt; CIVIL WAR RE-ENACTORS SEPT. 18-20\n&gt; AS OCTAGON HALL MARKS 150 YEARS**\n&gt; *Franklin, Ky. -- Octagon Hall, an eight-sided brick antebellum home in\n&gt; Franklin, Ky., is observing the 150th anniversary of its completion. A\n&gt; three-day celebration Sept. 18, 19, and 20 will feature Civil War\n&gt; re-enactors and historians alongside paranormal investigators and ghost\n&gt; hunters.\n&gt; [image: Octagon Hall]\n&gt;\n&gt; Looks like another fun weekend event fundraiser to help with restoration of\n&gt; a historic landmark. If you cant make it out to the location then come join\n&gt; in watching it LIVE for free.\n&gt;\n&gt; Have a great day!\n&gt; Misty\n&gt;\n&gt;  \n&gt;\n\nYes!!! hanks o he heads up!I like he channel. Da eOn F i, Sep 18, 2009 a 10:37 AM, F ansen, Debbie debbie. ansen@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n \n \n\n\n hx Mis y o he heads up\nSee ya in he cha !!!!!!\ndeb\n\n\nF om: EVP-ITC@yahoog oups.com \n[mail o:EVP-ITC@yahoog oups.com] On Behal O Mis y DawnSen : \nF iday, Sep embe 18, 2009 7:40 AMTo: \nEVP-ITC@yahoog oups.comSubjec : [EVP-ITC] 3 DAY LIVE EVENT - s a s \n oday Sep 18 h Kei h Age, Da e and Tom Jones and many mo e\n  \n\n\n\n \n \n \n Ok guys I said I would y and gi e \n you guys a heads up since many o you enjoyed he pas li e e en s on PTN \n so he e ya go. Pa ano mal Tele ision Ne wo k is b oadcas ing ano he li e \n e en his weekend Sep embe 18 h - 20 h. \n  \n \n www.pa ano mal ne wo k.com\n o \n www.pa ano mal ele isionne wo k.com\n  \n I will be ee o wa ch and \n pa icipa e in he in e ac i e cha . Fo mo e in o you can check ou www.oc agonhall.com. A e noon \n ac i i ies include many gues speake s on a a ie y o subjec s, \n e-enac o s, li ing his o y demo's, li e cannon i e, a les, con es s, \n and music along wi h o he ac i i ies. And yes hey will be ha ing a \n ghos hun a nigh he e as well o hose who a e in e es ed in he \n pa ano mal side o he loca ion. \n  \n Gues speake s a he Oc agon Hall commemo a ion \n will include B yan Bush, D . Ron Ha che , D . Michael T apasso, Paul \n B owning, Kei h Age, Ch is Dedman, and Rhiannon Wai s. Paul B owning \n has w i en a book en i led Haun ings a Oc agon Hall. Da e and Tom Jones \n Pa a-X Radio CBS Psychiconai  Cla ks ille Ghos Hun e s and a \n ew su p ise gues s.\n  \n GHOST HUNTERS WILL ENCOUNTERCIVIL WAR \n RE-ENACTORS SEPT. 18-20AS OCTAGON HALL MARKS 150 \n YEARS\n F anklin, \n Ky. -- Oc agon Hall, an eigh -sided b ick an ebellum home in F anklin, \n Ky., is obse ing he 150 h anni e sa y o i s comple ion. A h ee-day \n celeb a ion Sep . 18, 19, and 20 will ea u e Ci il Wa e-enac o s and \n his o ians alongside pa ano mal in es iga o s and ghos hun e s. \n  \n \n  \n Looks like ano he un weekend e en und aise o help wi h \n es o a ion o a his o ic landma k. I you can make i ou o he \n loca ion hen come join in wa ching i LIVE o ee.\n  \n Ha e a g ea day!\n Mis y"}