{"id": "16015", "subject": "Re: Heard from Dad!", "author": "mrscaptainjack2", "timestamp": "2009-09-20T01:41:15Z", "full_text": "I use a 12-469, although I just bought a 12-587 because I&#39;m so tired of the clicking; I&#39;m not sure if it&#39;s going to work as good or not, as I just modified it last night and haven&#39;t had a chance to use it yet.  Currently I have the 12-469 plugged into a Tascam Porta05 ministudio 4-track tape recorder, along with a Sure microphone.  So far I&#39;ve found doing sessions during the daylight hours on clear days seems to work the best; an entity once told me to do the sessions at night, but it doesn&#39;t seem to work very well then -- at least, if they talk then, I can&#39;t hear it for all the noise.  Although I&#39;m a newbie, my one piece of advice for you would be to listen back to the tape or digital recorder files VERY closely, because for me, 90% of the messages can only be heard upon review, not during the actual session itself (maybe because some of it is true EVP?).\n\nI would say, if you can get your hands on a small radio to hack, you will have no problem getting something to happen.  \n\nJill\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;judy_in_hollywood&quot; &lt;Ticket_to_Heaven@...&gt; wrote:\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, &quot;mrscaptainjack2&quot; &lt;jjkamp@&gt; wrote:\n&gt; &gt;\n&gt; &gt; I heard from my dad today finally!  I knew it was him, because when I asked how many people we were talking to today, the answer was, &quot;Just just talk to me!&quot;  My dad was always impatient, always interrupting people, so this was exactly what he would say.  Then he answered with his name to confirm.  When I asked if my dad&#39;s friend Gordy was there, the minute I mentioned his name, I swear I heard &quot;asshole.&quot;  It&#39;s possible my dad wasn&#39;t getting along with Gordy, because Gordy had a tendency in life to grate on my dad&#39;s nerves, so this might be something he&#39;d say.  \n&gt; &gt; \n&gt; &gt; Then I asked for him to say my mom&#39;s name, and he responded by saying her name in a way that was exactly how he used to say it when he was teasing her.  It wasn&#39;t his voice, it was radio voice, but it was the same inflection he used.  When I asked what relationship he had to us, there was a long sentence I couldn&#39;t make out, something about me growing up, and then, &quot;We know Jeffrey,&quot; which is my dead brother&#39;s name -- followed by &quot;daughter.&quot; \n&gt; &gt;      = = = = = = = = = = = = = = = = = = = = = = = = = = = = =      Hi there! How did you do this? What kind of recorder are you using or do you have a Frank&#39;s Box???  I&#39;d like to be able to do the same thing!!  Thanks!  =Judy=  Please tell us how & when (eve.?) you do this? It might help me!\n&gt; &gt; I asked if it was my dad, and a clear answer:  Yes, followed by two very loud, clear, &quot;I love yous.&quot;  \n&gt; &gt; \n&gt; &gt; But the best part was this:  I asked if he had a message for my mom (who was sitting there, too), and he said, &quot;Love you.  Don&#39;t wait for.  Me.  You will be.  Much.  Older.  I love you.  Love.  You.&quot;  How awesome is that?!!!!  \n&gt; &gt; \n&gt; &gt; If this wasn&#39;t my dad, it was certainly a kind, loving entity, that&#39;s for sure.  Just wanted to share with you all.  (Now I really need to figure out how to get these tapes into my computer!!!)\n&gt; &gt;\n&gt;"}