{"id": "16049", "subject": "Re: Anyone else offended by C2C?", "author": "mrscaptainjack2", "timestamp": "2009-09-27T21:30:23Z", "full_text": "That&#39;s why I wish someone would mass-produce these boxes.  If we got enough of them out there being used, it would eventually become obvious the voices are not fake. \n\nOf all my friends and family I&#39;ve told about this thing, only two believe me -- one is my best friend who is very open to paranormal stuff, and the other is my mother, who didn&#39;t believe any of it until she had her mother come through and answer questions about her childhood dog.  Then, even though she didn&#39;t want to, she was forced to believe. She still doesn&#39;t like to talk about it.\n\nI dare anyone to turn this thing on, give it an honest open-minded try, and not have anything happen.  Hell, I turned on my new little 12-587 at the vet&#39;s office Friday while I was waiting, just to see what would happen, and it said my name.  Then the vet came in.  It makes me wonder if there&#39;s a lot of residual emotional energy in a vet&#39;s office, what with animals dying and making owners cry and whatnot.\n\nJill  \n\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  Art Bell was filling in, and he had a guest that supposedly worked with Spiricom. The bottom line was the guy thought Spiricom was faked and he used that as a way of implying all EVP was faked, at least that&#39;s the way I took it, and he connected the boxes to Spiricom, implying they also did not work. Not only that, it was implied that if one speaks to the dead, one goes insane! I was out raged! As usual though Art Bell, and C2C never answer e-mails, and continue to act like they are the last word on anything paranormal, turning into more of debunking agency than anything informative. The thinking of the listeners, I think, is being carefully guided and manipulated. Radio remains only good for a source of raw audio, and not any meaningful information or dialog. \n&gt; \n&gt;  These &quot;researchers&quot;/debunkers never check any facts, never check with anyone that makes or uses the equipment, they just pass their opinions off as facts. If they actuyally honelstly tested this technology they would be singing a different tune, but I supposed they are not paid to be honest. \n&gt; \n&gt;  Frank-S\n&gt;"}