{"id": "16046", "subject": "Re: [EVP-ITC] Anyone else offended by C2C?", "author": "Misty Dawn", "timestamp": "2009-09-27T02:26:38Z", "full_text": "--0-545293967-1254018398=:73059\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nLOL April no kidding. I think maybe what he means is HE will go crazy if HE=\r\n tries. LOL that statement says alot. You might go crazy with or without do=\r\ning spirit communication. You might do alot of things. You might jump off a=\r\n tall building some day. You might die tomorrow. Might and will are words b=\r\nased on=A0ones own theories of what &quot;could&quot; happen.\n=A0\nI think if you take=\r\n a look around you will find a number of respectable people, scholars, inve=\r\nntors, teachers, policemen, firemen, military, clergy, and prominent figure=\r\ns in our society have had personal experiences which force them to disagree=\r\n with that statement. In fact the bible is full of them (for those who take=\r\n them at their word) as are most histories and cultures worldwide. So milli=\r\nons of people are crazy or one guy is wrong....hmm tough decision but again=\r\n try it for yourself before you form YOUR opinion people =3D) I did and I h=\r\nave my own experiences to rely on.\n=A0\nMisty\n\n--- On Sat, 9/26/09, April Ab=\r\nercrombie &lt;april@...&gt; wrote:\n\n\nFrom: April Abercro=\r\nmbie &lt;april@...&gt;\nSubject: Re: [EVP-ITC] Anyone els=\r\ne offended by C2C?\nTo: EVP-ITC@yahoogroups.com\nDate: Saturday, September 26=\r\n, 2009, 9:49 PM\n\n\n=A0 \n\n\n\n\nMy problem is as you said...the BS, like &quot;you&#39;ll=\r\n go crazy if you try to speak with the dead.&quot; He has no real evidence to ba=\r\nck that statement up. It is purely just his belief.\n=A0\nIf he said, &quot;In my =\r\nopinion....&quot; or &quot; I believe...&quot;=A0then I would still disagree, but it would=\r\nn&#39;t put a burr under my blanket LOL!\n=A0\n\n----- Original Message ----- \nFro=\r\nm: Misty Dawn \nTo: EVP-ITC@yahoogroups .com \nSent: Saturday, September 26, =\r\n2009 7:41 PM\nSubject: Re: [EVP-ITC] Anyone else offended by C2C?\n\n=A0 \n\n\n\n\n=\r\n\n\nThis is why I tell everyone don&#39;t take my word for it try it for yourself=\r\n. Communication with something beyond yourself is a personal endeavor. Step=\r\nhen Rorke makes his living on hoax news and to him this is news. I can&#39;t bl=\r\name anyone for questioning the reality around them. But I can take a look a=\r\nt what else a person has had to contribute to the world and the feild of st=\r\nudy they claim to be in.=A0 I suggest you all do the same before you take s=\r\nomeones ideas and make them your own. He has a right to form his own opinio=\r\nn, experiment and get his own results, and believe whatever he wishes. But =\r\nso do I.\n=A0\nBased on my own experiments, my own results, my own experience=\r\ns, I form=A0MY own opinions and beliefs. As for the spiricom communication =\r\ndevice all I can say is its interesting but I was not there, I did not expe=\r\nriement with it, I have no results with which to base an opinion on. All we=\r\n have left is some recorded data, and heresay.\n=A0\nAs for=A0Frank&#39;s box and=\r\n Sweep Tuning I can say I have seen the results, I have experimented with S=\r\nT myself and I have received some astounding results which are message comm=\r\nunications that are outside of my own knowledge and my own ability to contr=\r\nol or create. I have used many methods for EVP and ITC and have had many in=\r\nteresting results that have been confirmed, recognized, and proved beyond a=\r\n shadow of=A0MY own doubt. This is=A0MY personal experience and I invite an=\r\nyone who wishes to know more to try it for themselves and get their own res=\r\nults rather than waste time trying to pick apart others ideas, theories or =\r\nresults. I never try and prove anything to anyone else because for each of =\r\nus it takes that one very personal experience to have that eye opening mome=\r\nnt and realize that there is more around us than what is apparent.\n=A0\nSo n=\r\no I am not offended by anything anyone has to say as long as they base thie=\r\nr statements on truth rather than BS. And we all know there are alot of peo=\r\nple who make their life revolve around the BS as well as try to profit from=\r\n it.\n=A0\nMy best advice would be to try it in depth before you form an opin=\r\nion. Your results may differ from others, your personal experience may not =\r\nbe the same but that is YOUR experience, not mine, to explore further.\n=A0\n=\r\nMy journey has been quite fascinating, educational, and enlightening. I cou=\r\nld only hope that everyone else has a similar path, but we each have our ow=\r\nn roads to travel.\n=A0\nMisty\n\n\n--- On Sat, 9/26/09, purplespacefriend &lt;purp=\r\nlealiengirl@ gmail.com&gt; wrote:\n\n\nFrom: purplespacefriend &lt;purplealiengirl@ =\r\ngmail.com&gt;\nSubject: [EVP-ITC] Anyone else offended by C2C?\nTo: EVP-ITC@yaho=\r\nogroups .com\nDate: Saturday, September 26, 2009, 8:29 PM\n\n\n=A0 \n\nArt Bell w=\r\nas filling in, and he had a guest that supposedly worked with Spiricom. The=\r\n bottom line was the guy thought Spiricom was faked and he used that as a w=\r\nay of implying all EVP was faked, at least that&#39;s the way I took it, and he=\r\n connected the boxes to Spiricom, implying they also did not work. Not only=\r\n that, it was implied that if one speaks to the dead, one goes insane! I wa=\r\ns out raged! As usual though Art Bell, and C2C never answer e-mails, and co=\r\nntinue to act like they are the last word on anything paranormal, turning i=\r\nnto more of debunking agency than anything informative. The thinking of the=\r\n listeners, I think, is being carefully guided and manipulated. Radio remai=\r\nns only good for a source of raw audio, and not any meaningful information =\r\nor dialog. \n\nThese &quot;researchers&quot; /debunkers never check any facts, never ch=\r\neck with anyone that makes or uses the equipment, they just pass their opin=\r\nions off as facts. If they actuyally honelstly tested this technology they =\r\nwould be singing a different tune, but I supposed they are not paid to be h=\r\nonest. \n\nFrank-S\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n      \r\n--0-545293967-1254018398=:73059\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;DIV&gt;LOL April no kidding. I think maybe what=\r\n he means is HE will go crazy if HE tries. LOL that statement says alot. Yo=\r\nu might go crazy with or without doing spirit communication. You might do a=\r\nlot of things. You might jump off a tall building some day. You might die t=\r\nomorrow. Might and will are words based on&nbsp;ones own theories of what &quot;=\r\ncould&quot; happen.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I think if you take a look arou=\r\nnd you will find a number of respectable people, scholars, inventors, teach=\r\ners, policemen, firemen, military, clergy, and prominent figures in our soc=\r\niety have had personal experiences which force them to disagree with that s=\r\ntatement. In fact the bible is full of them (for those who take them at the=\r\nir word) as are most histories and cultures worldwide. So millions of peopl=\r\ne are crazy or one guy is wrong....hmm tough decision but again try it for =\r\nyourself before you form YOUR opinion people =3D) I did and I have my own e=\r\nxperiences to rely on.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Misty&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;=\r\nSat, 9/26/09, April Abercrombie &lt;I&gt;&lt;april@...&g=\r\nt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;&lt;/DIV&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: rgb(16,16,255=\r\n) 2px solid; PADDING-LEFT: 5px; MARGIN-LEFT: 5px&quot;&gt;&lt;BR&gt;From: April Abercromb=\r\nie &lt;april@...&gt;&lt;BR&gt;Subject: Re: [EVP-ITC] Any=\r\none else offended by C2C?&lt;BR&gt;To: EVP-ITC@yahoogroups.com&lt;BR&gt;Date: Saturday,=\r\n September 26, 2009, 9:49 PM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3Dyiv1374127211&gt;&lt;SPAN style=3D=\r\n&quot;DISPLAY: none&quot;&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV id=3Dygrp-text&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;FONT size=\r\n=3D2 face=3D&quot;Myriad Pro&quot;&gt;My problem is as you said...the BS, like &quot;you&#39;ll g=\r\no crazy if you try to speak with the dead.&quot; He has no real evidence to back=\r\n that statement up. It is purely just his belief.&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT s=\r\nize=3D2 face=3D&quot;Myriad Pro&quot;&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 face=3D=\r\n&quot;Myriad Pro&quot;&gt;If he said, &quot;In my opinion....&quot; or &quot; I believe...&quot;&nbsp;then I=\r\n would still disagree, but it wouldn&#39;t put a burr under my blanket LOL!&lt;/FO=\r\nNT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 face=3D&quot;Myriad Pro&quot;&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;BLOC=\r\nKQUOTE style=3D&quot;BORDER-LEFT: #000000 2px solid&quot; dir=3Dltr&gt;\n&lt;DIV style=3D&quot;FO=\r\nNT: 10pt arial&quot;&gt;----- Original Message ----- &lt;/DIV&gt;\n&lt;DIV style=3D&quot;FONT: 10p=\r\nt arial; BACKGROUND: #e4e4e4&quot;&gt;&lt;B&gt;From:&lt;/B&gt; &lt;A title=3Dbulletbabea@...=\r\n href=3D&quot;http://us.mc329.mail.yahoo.com/mc/compose?to=3Dbulletbabea@yahoo.c=\r\nom&quot; rel=3Dnofollow target=3D_blank ymailto=3D&quot;mailto:bulletbabea@...&quot;=\r\n&gt;Misty Dawn&lt;/A&gt; &lt;/DIV&gt;\n&lt;DIV style=3D&quot;FONT: 10pt arial&quot;&gt;&lt;B&gt;To:&lt;/B&gt; &lt;A title=\r\n=3DEVP-ITC@yahoogroups.com href=3D&quot;http://us.mc329.mail.yahoo.com/mc/compos=\r\ne?to=3DEVP-ITC@yahoogroups.com&quot; rel=3Dnofollow target=3D_blank ymailto=3D&quot;m=\r\nailto:EVP-ITC@yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups .com&lt;/A&gt; &lt;/DIV&gt;\n&lt;DIV sty=\r\nle=3D&quot;FONT: 10pt arial&quot;&gt;&lt;B&gt;Sent:&lt;/B&gt; Saturday, September 26, 2009 7:41 PM&lt;/=\r\nDIV&gt;\n&lt;DIV style=3D&quot;FONT: 10pt arial&quot;&gt;&lt;B&gt;Subject:&lt;/B&gt; Re: [EVP-ITC] Anyone e=\r\nlse offended by C2C?&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV id=3Dyg=\r\nrp-text&gt;\n&lt;DIV&gt;\n&lt;TABLE border=3D0 cellSpacing=3D0 cellPadding=3D0&gt;\n&lt;TBODY&gt;\n&lt;=\r\nTR&gt;\n&lt;TD vAlign=3Dtop&gt;\n&lt;DIV&gt;This is why I tell everyone don&#39;t take my word f=\r\nor it try it for yourself. Communication with something beyond yourself is =\r\na personal endeavor. Stephen Rorke makes his living on hoax news and to him=\r\n this is news. I can&#39;t blame anyone for questioning the reality around them=\r\n. But I can take a look at what else a person has had to contribute to the =\r\nworld and the feild of study they claim to be in.&nbsp; I suggest you all d=\r\no the same before you take someones ideas and make them your own. He has a =\r\nright to form his own opinion, experiment and get his own results, and beli=\r\neve whatever he wishes. But so do I.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Based on =\r\nmy own experiments, my own results, my own experiences, I form&nbsp;MY own =\r\nopinions and beliefs. As for the spiricom communication device all I can sa=\r\ny is its interesting but I was not there, I did not experiement with it, I =\r\nhave no results with which to base an opinion on. All we have left is some =\r\nrecorded data, and heresay.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;As for&nbsp;Frank&#39;=\r\ns box and Sweep Tuning I can say I have seen the results, I have experiment=\r\ned with ST myself and I have received some astounding results which are mes=\r\nsage communications that are outside of my own knowledge and my own ability=\r\n to control or create. I have used many methods for EVP and ITC and have ha=\r\nd many interesting results that have been confirmed, recognized, and proved=\r\n beyond a shadow of&nbsp;MY own doubt. This is&nbsp;MY personal experience =\r\nand I invite anyone who wishes to know more to try it for themselves and ge=\r\nt their own results rather than waste time trying to pick apart others idea=\r\ns, theories or results. I never try and prove anything to anyone else becau=\r\nse for each of us it takes that one very personal experience to have that e=\r\nye opening moment and realize that there is more around us than what is app=\r\narent.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;So no I am not offended by anything any=\r\none has to say as long as they base thier statements on truth rather than B=\r\nS. And we all know there are alot of people who make their life revolve aro=\r\nund the BS as well as try to profit from it.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;M=\r\ny best advice would be to try it in depth before you form an opinion. Your =\r\nresults may differ from others, your personal experience may not be the sam=\r\ne but that is YOUR experience, not mine, to explore further.&lt;/DIV&gt;\n&lt;DIV&gt;&nb=\r\nsp;&lt;/DIV&gt;\n&lt;DIV&gt;My journey has been quite fascinating, educational, and enli=\r\nghtening. I could only hope that everyone else has a similar path, but we e=\r\nach have our own roads to travel.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Misty&lt;/DIV&gt;\n=\r\n&lt;DIV&gt;&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Sat, 9/26/09, purplespacefriend &lt;I&gt;&lt;purplealiengi=\r\nrl@ gmail.com&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;&lt;/DIV&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT=\r\n: rgb(16,16,255) 2px solid&quot;&gt;&lt;BR&gt;From: purplespacefriend &lt;purplealiengirl=\r\n@ gmail.com&gt;&lt;BR&gt;Subject: [EVP-ITC] Anyone else offended by C2C?&lt;BR&gt;To: E=\r\nVP-ITC@yahoogroups .com&lt;BR&gt;Date: Saturday, September 26, 2009, 8:29 PM&lt;BR&gt;&lt;=\r\nBR&gt;\n&lt;DIV id=3Dyiv567112638&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV id=3Dygrp-text&gt;\n&lt;DIV&gt;A=\r\nrt Bell was filling in, and he had a guest that supposedly worked with Spir=\r\nicom. The bottom line was the guy thought Spiricom was faked and he used th=\r\nat as a way of implying all EVP was faked, at least that&#39;s the way I took i=\r\nt, and he connected the boxes to Spiricom, implying they also did not work.=\r\n Not only that, it was implied that if one speaks to the dead, one goes ins=\r\nane! I was out raged! As usual though Art Bell, and C2C never answer e-mail=\r\ns, and continue to act like they are the last word on anything paranormal, =\r\nturning into more of debunking agency than anything informative. The thinki=\r\nng of the listeners, I think, is being carefully guided and manipulated. Ra=\r\ndio remains only good for a source of raw audio, and not any meaningful inf=\r\normation or dialog. &lt;BR&gt;&lt;BR&gt;These &quot;researchers&quot; /debunkers never check any =\r\nfacts, never check with anyone that makes or uses the equipment, they just =\r\npass their opinions off as facts. If they actuyally honelstly\n tested this =\r\ntechnology they would be singing a different tune, but I supposed they are =\r\nnot paid to be honest. &lt;BR&gt;&lt;BR&gt;Frank-S&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOT=\r\nE&gt;&lt;/TD&gt;&lt;/TR&gt;&lt;/TBODY&gt;&lt;/TABLE&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOC=\r\nKQUOTE&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n      \r\n--0-545293967-1254018398=:73059--"}