{"id": "16044", "subject": "Re: [EVP-ITC] Anyone else offended by C2C?", "author": "Misty Dawn", "timestamp": "2009-09-27T01:41:51Z", "full_text": "--0-400651051-1254015711=:45875\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nThis is why I tell everyone don&#39;t take my word for it try it for yourself. =\r\nCommunication with something beyond yourself is a personal endeavor. Stephe=\r\nn Rorke makes his living on hoax news and to him this is news. I can&#39;t blam=\r\ne anyone for questioning the reality around them. But I can take a look at =\r\nwhat else a person has had to contribute to the world and the feild of stud=\r\ny they claim to be in.=A0 I suggest you all do the same before you take som=\r\neones ideas and make them your own. He has a right to form his own opinion,=\r\n experiment and get his own results, and believe whatever he wishes. But so=\r\n do I.\n=A0\nBased on my own experiments, my own results, my own experiences,=\r\n I form=A0MY own opinions and beliefs. As for the spiricom communication de=\r\nvice all I can say is its interesting but I was not there, I did not experi=\r\nement with it, I have no results with which to base an opinion on. All we h=\r\nave left is some recorded data, and heresay.\n=A0\nAs for=A0Frank&#39;s box and S=\r\nweep Tuning I can say I have seen the results, I have experimented with ST =\r\nmyself and I have received some astounding results which are message commun=\r\nications that are outside of my own knowledge and my own ability to control=\r\n or create. I have used many methods for EVP and ITC and have had many inte=\r\nresting results that have been confirmed, recognized, and proved beyond a s=\r\nhadow of=A0MY own doubt. This is=A0MY personal experience and I invite anyo=\r\nne who wishes to know more to try it for themselves and get their own resul=\r\nts rather than waste time trying to pick apart others ideas, theories or re=\r\nsults. I never try and prove anything to anyone else because for each of us=\r\n it takes that one very personal experience to have that eye opening moment=\r\n and realize that there is more around us than what is apparent.\n=A0\nSo no =\r\nI am not offended by anything anyone has to say as long as they base thier =\r\nstatements on truth rather than BS. And we all know there are alot of peopl=\r\ne who make their life revolve around the BS as well as try to profit from i=\r\nt.\n=A0\nMy best advice would be to try it in depth before you form an opinio=\r\nn. Your results may differ from others, your personal experience may not be=\r\n the same but that is YOUR experience, not mine, to explore further.\n=A0\nMy=\r\n journey has been quite fascinating, educational, and enlightening. I could=\r\n only hope that everyone else has a similar path, but we each have our own =\r\nroads to travel.\n=A0\nMisty\n\n\n--- On Sat, 9/26/09, purplespacefriend &lt;purple=\r\naliengirl@...&gt; wrote:\n\n\nFrom: purplespacefriend &lt;purplealiengirl@gmai=\r\nl.com&gt;\nSubject: [EVP-ITC] Anyone else offended by C2C?\nTo: EVP-ITC@yahoogro=\r\nups.com\nDate: Saturday, September 26, 2009, 8:29 PM\n\n\n=A0 \n\n\n\nArt Bell was =\r\nfilling in, and he had a guest that supposedly worked with Spiricom. The bo=\r\nttom line was the guy thought Spiricom was faked and he used that as a way =\r\nof implying all EVP was faked, at least that&#39;s the way I took it, and he co=\r\nnnected the boxes to Spiricom, implying they also did not work. Not only th=\r\nat, it was implied that if one speaks to the dead, one goes insane! I was o=\r\nut raged! As usual though Art Bell, and C2C never answer e-mails, and conti=\r\nnue to act like they are the last word on anything paranormal, turning into=\r\n more of debunking agency than anything informative. The thinking of the li=\r\nsteners, I think, is being carefully guided and manipulated. Radio remains =\r\nonly good for a source of raw audio, and not any meaningful information or =\r\ndialog. \n\nThese &quot;researchers&quot; /debunkers never check any facts, never check=\r\n with anyone that makes or uses the equipment, they just pass their opinion=\r\ns off as facts. If they actuyally honelstly tested this technology they wou=\r\nld be singing a different tune, but I supposed they are not paid to be hone=\r\nst. \n\nFrank-S\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n      \r\n--0-400651051-1254015711=:45875\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;DIV&gt;This is why I tell everyone don&#39;t take m=\r\ny word for it try it for yourself. Communication with something beyond your=\r\nself is a personal endeavor. Stephen Rorke makes his living on hoax news an=\r\nd to him this is news. I can&#39;t blame anyone for questioning the reality aro=\r\nund them. But I can take a look at what else a person has had to contribute=\r\n to the world and the feild of study they claim to be in.&nbsp; I suggest y=\r\nou all do the same before you take someones ideas and make them your own. H=\r\ne has a right to form his own opinion, experiment and get his own results, =\r\nand believe whatever he wishes. But so do I.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;B=\r\nased on my own experiments, my own results, my own experiences, I form&nbsp=\r\n;MY own opinions and beliefs. As for the spiricom communication device all =\r\nI can say is its interesting but I was not there, I did not experiement wit=\r\nh it, I have no results with which to base an opinion on. All we have left =\r\nis some recorded data, and heresay.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;As for&nbs=\r\np;Frank&#39;s box and Sweep Tuning I can say I have seen the results, I have ex=\r\nperimented with ST myself and I have received some astounding results which=\r\n are message communications that are outside of my own knowledge and my own=\r\n ability to control or create. I have used many methods for EVP and ITC and=\r\n have had many interesting results that have been confirmed, recognized, an=\r\nd proved beyond a shadow of&nbsp;MY own doubt. This is&nbsp;MY personal exp=\r\nerience and I invite anyone who wishes to know more to try it for themselve=\r\ns and get their own results rather than waste time trying to pick apart oth=\r\ners ideas, theories or results. I never try and prove anything to anyone el=\r\nse because for each of us it takes that one very personal experience to hav=\r\ne that eye opening moment and realize that there is more around us than wha=\r\nt is apparent.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;So no I am not offended by anyt=\r\nhing anyone has to say as long as they base thier statements on truth rathe=\r\nr than BS. And we all know there are alot of people who make their life rev=\r\nolve around the BS as well as try to profit from it.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV=\r\n&gt;\n&lt;DIV&gt;My best advice would be to try it in depth before you form an opinio=\r\nn. Your results may differ from others, your personal experience may not be=\r\n the same but that is YOUR experience, not mine, to explore further.&lt;/DIV&gt;\n=\r\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;My journey has been quite fascinating, educational, =\r\nand enlightening. I could only hope that everyone else has a similar path, =\r\nbut we each have our own roads to travel.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Mist=\r\ny&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Sat, 9/26/09, purplespacefriend &lt;I&gt;&lt;purpl=\r\nealiengirl@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;&lt;/DIV&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORD=\r\nER-LEFT: rgb(16,16,255) 2px solid; PADDING-LEFT: 5px; MARGIN-LEFT: 5px&quot;&gt;&lt;BR=\r\n&gt;From: purplespacefriend &lt;purplealiengirl@...&gt;&lt;BR&gt;Subject: [EVP=\r\n-ITC] Anyone else offended by C2C?&lt;BR&gt;To: EVP-ITC@yahoogroups.com&lt;BR&gt;Date: =\r\nSaturday, September 26, 2009, 8:29 PM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3Dyiv567112638&gt;&lt;SPAN =\r\nstyle=3D&quot;DISPLAY: none&quot;&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV id=3Dygrp-text&gt;\n&lt;DIV&gt;Art Bell w=\r\nas filling in, and he had a guest that supposedly worked with Spiricom. The=\r\n bottom line was the guy thought Spiricom was faked and he used that as a w=\r\nay of implying all EVP was faked, at least that&#39;s the way I took it, and he=\r\n connected the boxes to Spiricom, implying they also did not work. Not only=\r\n that, it was implied that if one speaks to the dead, one goes insane! I wa=\r\ns out raged! As usual though Art Bell, and C2C never answer e-mails, and co=\r\nntinue to act like they are the last word on anything paranormal, turning i=\r\nnto more of debunking agency than anything informative. The thinking of the=\r\n listeners, I think, is being carefully guided and manipulated. Radio remai=\r\nns only good for a source of raw audio, and not any meaningful information =\r\nor dialog. &lt;BR&gt;&lt;BR&gt;These &quot;researchers&quot; /debunkers never check any facts, ne=\r\nver check with anyone that makes or uses the equipment, they just pass thei=\r\nr opinions off as facts. If they actuyally honelstly\n tested this technolog=\r\ny they would be singing a different tune, but I supposed they are not paid =\r\nto be honest. &lt;BR&gt;&lt;BR&gt;Frank-S&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/td&gt;&lt;/=\r\ntr&gt;&lt;/table&gt;&lt;br&gt;\n\n      \r\n--0-400651051-1254015711=:45875--"}