{"id": "16063", "subject": "Re: Anyone else offended by C2C?", "author": "mrscaptainjack2", "timestamp": "2009-09-30T03:34:01Z", "full_text": "That&#39;s silly -- doesn&#39;t this guy Rorke have the faintest idea of how these boxes work?  I mean, that&#39;s pretty basic.\n\n\n\n\n--- In EVP-ITC@...m, &quot;purplespacefriend&quot; &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  The stuff that gets me is the implied information, like both were saying how you go crazy if you try to talk to the dead. That&#39;s pure BS and meant to scare peole away from the field. \n&gt; \n&gt;  This Dr. Rorke wants one of my boxes so he can put it in a faraday cage to test it. Well dah, it ain&#39;t gonna work with all radio signals blocked. Just another debunking ploy. \n&gt; \n&gt;  F-S\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;April Abercrombie&quot; &lt;april@&gt; wrote:\n&gt; &gt;\n&gt; &gt; OMG!!! This is why I don&#39;t listen to many of these programs.\n&gt; &gt; \n&gt; &gt; By far, my largest pet peeve is misinformation.\n&gt; &gt; \n&gt; &gt;   ----- Original Message ----- \n&gt; &gt;   From: purplespacefriend \n&gt; &gt;   To: EVP-ITC@yahoogroups.com \n&gt; &gt;   Sent: Saturday, September 26, 2009 6:29 PM\n&gt; &gt;   Subject: [EVP-ITC] Anyone else offended by C2C?\n&gt; &gt; \n&gt; &gt; \n&gt; &gt;     Art Bell was filling in, and he had a guest that supposedly worked with Spiricom. The bottom line was the guy thought Spiricom was faked and he used that as a way of implying all EVP was faked, at least that&#39;s the way I took it, and he connected the boxes to Spiricom, implying they also did not work. Not only that, it was implied that if one speaks to the dead, one goes insane! I was out raged! As usual though Art Bell, and C2C never answer e-mails, and continue to act like they are the last word on anything paranormal, turning into more of debunking agency than anything informative. The thinking of the listeners, I think, is being carefully guided and manipulated. Radio remains only good for a source of raw audio, and not any meaningful information or dialog. \n&gt; &gt; \n&gt; &gt;   These &quot;researchers&quot;/debunkers never check any facts, never check with anyone that makes or uses the equipment, they just pass their opinions off as facts. If they actuyally honelstly tested this technology they would be singing a different tune, but I supposed they are not paid to be honest. \n&gt; &gt; \n&gt; &gt;   Frank-S\n&gt; &gt;\n&gt;"}