{"id": "16079", "subject": "Re: Anyone else offended by C2C?", "author": "ourobouros2k2", "timestamp": "2009-10-01T08:29:53Z", "full_text": "EVP itself defies categorization. Some folks think it is a modulated em field in proximity to the microphone. There is evidence to support this, as evp has been recorded in faraday cages and vacuum jars. It would then be logical to assume that evp is independent of vibratory sound waves. Then that is blown to hell when you consider that Waldemar Bogoras is credited with the first reported evp capture while recording rituals of the Tchoutki tribe in Siberia in 1901. The was with a mechanical gramaphone-like device, no microphone, just a horn to amplify sound, mechanical &quot;write&quot; needle, and wax cylinder. Electric gramaphones didn&#39;t come about till almost the &#39;20s. In that case it would appear that evp exists as soundwaves and not em fields.\n\nWhich one is right? Both probably, and that isn&#39;t even taking into account the mechanism involved in box-related evp.\n\nIntent and desire to communicate. The rest works itself out.\n\nThanks\nAndy\n\n\n\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, Rj &lt;rasterer@...&gt; wrote:\n&gt;\n&gt; I hear different people proposing different mechanisms by which EVP operates. Some say it uses the words in radio transmissions, and anyone can hear it if they listen. Some say it uses the disturbance or energy of radio transmissions to form new words, but it is harder to hear (some say you have to be &quot;chosen&quot; to hear it). Some say it can use any transmission, and can even be seen in video. Some say it doesn&#39;t require any transmission, and can be extracted from white noise, or no noise. Some say it can be heard even in things like running water.\n&gt; \n&gt; So it depends on which theory this person is testing. If he were testing the claim that the EVPs required a radio broadcast, then this test wouldn&#39;t be good, since the Faraday cage should block the radio needed. If he is testing the one where people claim that words appear on a radio or recording device that have not been transmitted, then this sounds like a reaonsable test to me. \n&gt; \n&gt; --- On Wed, 9/30/09, purplespacefriend &lt;purplealiengirl@...&gt; wrote:\n&gt; \n&gt; From: purplespacefriend &lt;purplealiengirl@...&gt;\n&gt; Subject: [EVP-ITC] Re: Anyone else offended by C2C?\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Wednesday, September 30, 2009, 1:17 PM\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;     \n&gt;                    I don&#39;t knwo if it&#39;s silly in the scientific curiosity way. I suspect he wants to prove it doesn&#39;t wokr. He plans to shiled a box as a &quot;control&quot;, which is kinda senseless, why not just leave it turned off as control if ya don&#39;t want it to work?\n&gt; \n&gt; \n&gt; \n&gt; Frank-S\n&gt; \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups .com, &quot;mrscaptainjack2&quot; &lt;jjkamp@&gt; wrote:\n&gt; \n&gt; &gt;\n&gt; \n&gt; &gt; That&#39;s silly -- doesn&#39;t this guy Rorke have the faintest idea of how these boxes work?  I mean, that&#39;s pretty basic.\n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups .com, &quot;purplespacefriend&quot; &lt;purplealiengirl@ &gt; wrote:\n&gt; \n&gt; &gt; &gt;\n&gt; \n&gt; &gt; &gt;  The stuff that gets me is the implied information, like both were saying how you go crazy if you try to talk to the dead. That&#39;s pure BS and meant to scare peole away from the field. \n&gt; \n&gt; &gt; &gt; \n&gt; \n&gt; &gt; &gt;  This Dr. Rorke wants one of my boxes so he can put it in a faraday cage to test it. Well dah, it ain&#39;t gonna work with all radio signals blocked. Just another debunking ploy. \n&gt; \n&gt; &gt; &gt; \n&gt; \n&gt; &gt; &gt;  F-S\n&gt; \n&gt; &gt; &gt; \n&gt; \n&gt; &gt; &gt; --- In EVP-ITC@yahoogroups .com, &quot;April Abercrombie&quot; &lt;april@&gt; wrote:\n&gt; \n&gt; &gt; &gt; &gt;\n&gt; \n&gt; &gt; &gt; &gt; OMG!!! This is why I don&#39;t listen to many of these programs.\n&gt; \n&gt; &gt; &gt; &gt; \n&gt; \n&gt; &gt; &gt; &gt; By far, my largest pet peeve is misinformation.\n&gt; \n&gt; &gt; &gt; &gt; \n&gt; \n&gt; &gt; &gt; &gt;   ----- Original Message ----- \n&gt; \n&gt; &gt; &gt; &gt;   From: purplespacefriend \n&gt; \n&gt; &gt; &gt; &gt;   To: EVP-ITC@yahoogroups .com \n&gt; \n&gt; &gt; &gt; &gt;   Sent: Saturday, September 26, 2009 6:29 PM\n&gt; \n&gt; &gt; &gt; &gt;   Subject: [EVP-ITC] Anyone else offended by C2C?\n&gt; \n&gt; &gt; &gt; &gt; \n&gt; \n&gt; &gt; &gt; &gt; \n&gt; \n&gt; &gt; &gt; &gt;     Art Bell was filling in, and he had a guest that supposedly worked with Spiricom. The bottom line was the guy thought Spiricom was faked and he used that as a way of implying all EVP was faked, at least that&#39;s the way I took it, and he connected the boxes to Spiricom, implying they also did not work. Not only that, it was implied that if one speaks to the dead, one goes insane! I was out raged! As usual though Art Bell, and C2C never answer e-mails, and continue to act like they are the last word on anything paranormal, turning into more of debunking agency than anything informative. The thinking of the listeners, I think, is being carefully guided and manipulated. Radio remains only good for a source of raw audio, and not any meaningful information or dialog. \n&gt; \n&gt; &gt; &gt; &gt; \n&gt; \n&gt; &gt; &gt; &gt;   These &quot;researchers&quot; /debunkers never check any facts, never check with anyone that makes or uses the equipment, they just pass their opinions off as facts. If they actuyally honelstly tested this technology they would be singing a different tune, but I supposed they are not paid to be honest. \n&gt; \n&gt; &gt; &gt; &gt; \n&gt; \n&gt; &gt; &gt; &gt;   Frank-S\n&gt; \n&gt; &gt; &gt; &gt;\n&gt; \n&gt; &gt; &gt;\n&gt; \n&gt; &gt;\n&gt;"}