{"id": "16078", "subject": "RE: [EVP-ITC] Re: Newbie with a question about other communication devices.", "author": "JeffL1965", "timestamp": "2009-10-01T05:42:28Z", "full_text": "Yes, that&#39;s it! Thanks! I saw it used once, but couldn&#39;t recall if the name\nwas mentioned or not.\n\nSorry, I guess I should&#39;ve said &quot;Non-Human Entities&quot;? But in my book, if the\nentity has bad intentions, it&#39;s a demon. And we do know that they pretend to\nbe otherwise until it no longer serves their purpose or they slip up.\n\nThanks again for the help!\n\nJeff\n\n\n-----Original Message-----\nFrom: EVP-ITC@yahoogroups.com [mailto:EVP-ITC@yahoogroups.com] On Behalf Of\nmrscaptainjack2\nSent: Tuesday, September 29, 2009 10:40 PM\nTo: EVP-ITC@yahoogroups.com\nSubject: [EVP-ITC] Re: Newbie with a question about other communication\ndevices.\n\nAre you talking about the Speakjet?  See the video halfway down this page:\n\nhttp://www.keyportparanormal.com/ghostboxsamplevideos.html\n\nAlso, just a heads up:  I think it&#39;s kind of frowned upon to call the\nentities &quot;demons.&quot;  Even &quot;spirits&quot; can be questioned in some circles, as\nthere seems to be evidence not all of those we talk to have lived as a human\nbeing on earth.\n\nJill\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, JeffL1965 &lt;JeffL1965@...&gt; wrote:\n&gt;\n&gt; Hi group!\n&gt; \n&gt;  \n&gt; \n&gt; I&#39;ve just been approved, and can&#39;t wait to learn more about the EVP field,\n&gt; as I&#39;m very interested in it, and the Paranormal. :-)\n&gt; \n&gt;  \n&gt; \n&gt; Without getting too OT, I hope, can some kind soul tell me what other\n&gt; similar devices there are to this? I recall seeing one such box that a\n&gt; spirit/demon communicates with a synthesized voice using only 1 word. I\n&gt; think this one will be very helpful to me as well, as I begin my\nParanormal\n&gt; research career.\n&gt; \n&gt;  \n&gt; \n&gt; Thanks in advance, and eagerly looking forward to learning from all of\nyou.\n&gt; \n&gt;  \n&gt; \n&gt; Jeff\n&gt;\n\n\n\n\n------------------------------------\n\nYahoo! Groups Links"}