{"id": "16088", "subject": "Re: [EVP-ITC] Re: Anyone else offended by C2C?", "author": "Zack Widup", "timestamp": "2009-10-02T13:21:10Z", "full_text": "In my mind the word &quot;skeptic&quot; is a misnomer. There is a difference between a\nskeptic and an unbeliever.\n\nIf I said &quot;I&#39;m skeptical about your rebuilding that engine&quot; I would admit\nthat it&#39;s possible, just doubt that you&#39;re going to do it.  An unbeliever\nwouldn&#39;t believe that it&#39;s even possible to rebuild engines.\n\nI think most of the &quot;skeptics&quot; we see in any sort of paranormal sphere are\nreally unbelievers. As Frank pointed out, they don&#39;t even believe or\nrecognize that we ARE spirits, so how could a ghost exist and how could the\nbox work? A ghost could hit them in the head with a 2X4 and they still\nwouldn&#39;t believe it.\n\nZack\n\nOn Fri, Oct 2, 2009 at 3:22 AM, ourobouros2k2 &lt;ourobouros2k2@...&gt;wrote:\n\n&gt;\n&gt;\n&gt; Not to mention that when they want to &quot;test&quot; something they are already\n&gt; skeptical about, then they will come up with impossible criteria. The day I\n&gt; finally stopped caring why a ghost box worked and just accepted that it did\n&gt; was the start of rewarding sessions.\n&gt;\n&gt; I think most of us are beyond the point where skeptics can make a dent in\n&gt; our searching for answers. Skepticism can be good, but sometimes it can be\n&gt; self defeating. More people just want to make a name for themselves by\n&gt; trying to be the one that brought down this or that device. If they would\n&gt; try some of these methods with an open mind and a brief suspension of\n&gt; disbelief, then they might get their own rewarding experiences as well...\n&gt;\n&gt; Andy\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;,\n&gt; &quot;purplespacefriend&quot; &lt;purplealiengirl@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Well then, just build youself a box and test the hell out of it!\n&gt; &gt;\n&gt; &gt; I&#39;ve said all along that one has to be careful not to create the\n&gt; voices/answers one wants to hear. We are, despite appearances, spirit, and\n&gt; we can create our own spirit voices just as easy as any other entity. But\n&gt; what do I know, I just make the damn boxes and I don&#39;t even believe in ghost\n&gt; hunting!?\n&gt; &gt;\n&gt; &gt; Whatever these brainiacs claim that want to do all this testing--they\n&gt; never-ever ask the freaking inventors! They can&#39;t even get their heads\n&gt; around EVPmaker, so pretend that doesn&#39;t even exist, even though the box\n&gt; came later. Probably they think it would be easier to disprove the box. Some\n&gt; duffus puts a DR. in front of his name and I&#39;m supposed to be impressed, it\n&gt; just means all intellect has been programmed out. After all , they &quot;know&quot;\n&gt; there are no spirits, so it has to be something else--anything else!\n&gt; &gt;\n&gt; &gt; Frank-S\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nIn my mind  he wo d \"skep ic\" is a misnome . The e is a di e ence be ween a skep ic and an unbelie e .\n \nI I said \"I'm skep ical abou you ebuilding ha engine\" I would admi ha i 's possible, jus doub ha you' e going o do i .  An unbelie e wouldn' belie e ha i 's e en possible o ebuild engines.\n\n \nI hink mos o he \"skep ics\" we see in any so o pa ano mal sphe e a e eally unbelie e s. As F ank poin ed ou , hey don' e en belie e o ecognize ha we ARE spi i s, so how could a ghos exis and how could he box wo k? A ghos could hi hem in he head wi h a 2X4 and hey s ill wouldn' belie e i .\n\n \nZack\nOn F i, Oc 2, 2009 a 3:22 AM, ou obou os2k2 ou obou os2k2@...> w o e:\n\n  \n\n\n\nNo o men ion ha when hey wan o \" es \" some hing hey a e al eady skep ical abou , hen hey will come up wi h impossible c i e ia. The day I inally s opped ca ing why a ghos box wo ked and jus accep ed ha i did was he s a o ewa ding sessions. \nI hink mos o us a e beyond he poin whe e skep ics can make a den in ou sea ching o answe s. Skep icism can be good, bu some imes i can be sel de ea ing. Mo e people jus wan o make a name o hemsel es by ying o be he one ha b ough down his o ha de ice. I hey would y some o hese me hods wi h an open mind and a b ie suspension o disbelie , hen hey migh ge hei own ewa ding expe iences as well...\nAndy \n--- In EVP-ITC@yahoog oups.com, \"pu plespace iend\" w o e:>> Well hen, jus build yousel a box and es he hell ou o i !\n> > I' e said all along ha one has o be ca e ul no o c ea e he oices/answe s one wan s o hea . We a e, despi e appea ances, spi i , and we can c ea e ou own spi i oices jus as easy as any o he en i y. Bu wha do I know, I jus make he damn boxes and I don' e en belie e in ghos hun ing!?\n> > Wha e e hese b ainiacs claim ha wan o do all his es ing-- hey ne e -e e ask he eaking in en o s! They can' e en ge hei heads a ound EVPmake , so p e end ha doesn' e en exis , e en hough he box came la e . P obably hey hink i would be easie o disp o e he box. Some du us pu s a DR. in on o his name and I'm supposed o be imp essed, i jus means all in ellec has been p og ammed ou . A e all , hey \"know\" he e a e no spi i s, so i has o be some hing else--any hing else!\n> > F ank-S>"}