{"id": "16087", "subject": "Newbie to RS-Hack 470", "author": "John M. Carr", "timestamp": "2008-03-10T17:37:26Z", "full_text": "------=_NextPart_000_0003_01C882B3.E0BFEB50\r\nContent-Type: text/plain;\n\tcharset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nHi Everyone & Frank,\nI just completed my first RS-470 Hack, and was success=\r\nful in my first 2 mini session. Mine bc I so startled that I got a reply on=\r\n the first try,(got &quot;Frank&quot; on the other end, not Frank S.) then on the sec=\r\nond session, I tested the radio by telling them I&#39;m writing a name on a pie=\r\nce of paper, which was my name, &quot;John&quot;, and they told me &quot;John&quot; before I co=\r\nmpleted the &quot;n&quot;. I, unfortunately didn&#39;t hook up the RS-470 to a recorder d=\r\nue to that I didn&#39;t have a microphone set-up to mix me and the box. While t=\r\nhis was happening, I kept hearing my walls admit the sound of furniture mov=\r\ning, I looked around my duplex, nothing was moving, I looked outside to see=\r\n if my neighbor might be home, but his car wasn&#39;t there. I got spooked, eve=\r\nn though I&#39;ve been an investigator since 1998. I did remember to tell them =\r\nto go back to the other side before I shut my unit off, they said, &quot;wait&quot;, =\r\nthen &quot;o.k.&quot;.\n\nOn the next day, I tried another session that didn&#39;t go so we=\r\nll. I live in SE Florida and there is so many radio stations that I was bon=\r\nbarded with sound and I guess my ear wasn&#39;t quite trained enough to get the=\r\n astral being/ technician on the otherside. I did 2 session and felt helple=\r\nss to all the different station that were coming through. Later that day, I=\r\n was able to get a mixing unit and hook up my professional microphone (I wa=\r\ns a Dj in a former life), then attached the RS-470. I asked for a technicia=\r\nn and for reply with a name, I swear, I couldn&#39;t hear them, and kept saying=\r\n, &quot;repeat your name&quot;. I thought to myself, &quot;I would have been pissed gettin=\r\ng someone that couldn&#39;t hear me, asking me to repeat my name, over and over=\r\n again. Upon playback on my computer, I heard the responses, His name was P=\r\nete, and after asking his name again, he said, &quot;I Did&quot;. I definately did wa=\r\nnt to piss off anyone, especially someone I haven&#39;t met before, but especia=\r\nlly a spirit that I can&#39;t see. I did asked them to test the unit by repeati=\r\nng the word &quot;Dragonfly&quot;, I got a reply, but it was very weak. Sounded like,=\r\n &quot;ragon fly&quot;. You could hear the fly more than the dragon part.\n\nIs there a=\r\n way to squelch the bonbardment of stations coming throught? If I can&#39;t hea=\r\nr them, will they get pissed off and stop communication? Beside being a inv=\r\nentor, ie, Frank Sumption, who I feel is the most qualified and talented in=\r\n this field, can &quot;we&quot;, those who have little technical skills, do any bette=\r\nr in getting a, or creating a better unit from the RS-470 hack? Does the tr=\r\naining of your ears take a long time with the multiple use of this unit? Am=\r\n I hearing the otherside, or am I fooling myself into hearing what I want t=\r\no hear from fragments of the stations coming through?\n\nI would appreciate a=\r\nny response to my questions and any help in my quest to be a better RS-470 =\r\nHack owner.\n\nHappy Haunting,\nJohn Marc Carr\r\n------=_NextPart_000_0003_01C882B3.E0BFEB50\r\nContent-Type: text/html;\n\tcharset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML 4.0 Transitional//EN&quot;&gt;\n&lt;HTML&gt;&lt;HEAD&gt;=\r\n\n&lt;META http-equiv=3DContent-Type content=3D&quot;text/html; charset=3Diso-8859-1=\r\n&quot;&gt;\n&lt;META content=3D&quot;MSHTML 6.00.6000.16609&quot; name=3DGENERATOR&gt;\n&lt;STYLE&gt;&lt;/STYL=\r\nE&gt;\n&lt;/HEAD&gt;\n&lt;BODY bgColor=3D#ffffff&gt;\n&lt;DIV&gt;Hi Everyone &amp; Frank,&lt;/DIV&gt;\n&lt;DI=\r\nV&gt;I just completed my first RS-470 Hack, and was successful in my first 2 \n=\r\nmini session. Mine bc I so startled that I got a reply on the first try,(go=\r\nt \n&quot;Frank&quot;&nbsp;on the other end, not Frank S.)&nbsp;then on the second \nse=\r\nssion,&nbsp;I tested the radio by telling them I&#39;m writing a name on a piec=\r\ne \nof paper, which was my name, &quot;John&quot;, and they told me &quot;John&quot; before I co=\r\nmpleted \nthe &quot;n&quot;. I, unfortunately didn&#39;t hook up the RS-470 to a recorder =\r\ndue to that I \ndidn&#39;t have a microphone set-up to mix me and the box. While=\r\n this was happening, \nI kept hearing my walls admit the sound of furniture =\r\nmoving, I looked around my \nduplex, nothing was moving, I looked outside to=\r\n see if my neighbor might be \nhome, but his car wasn&#39;t there. I got spooked=\r\n, even though I&#39;ve been an \ninvestigator since 1998. I did remember to tell=\r\n them to go back to the other \nside before I shut my unit off, they said, &quot;=\r\nwait&quot;, then &quot;o.k.&quot;.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;On the next day, I tried a=\r\nnother session that didn&#39;t go so well. I live in \nSE Florida and there is s=\r\no many radio stations that I was bonbarded with sound \nand I guess my ear w=\r\nasn&#39;t quite trained enough to get the astral being/ \ntechnician on the othe=\r\nrside. I did 2 session and felt helpless to all the \ndifferent station that=\r\n were coming through. Later that day, I was able to get a \nmixing unit and =\r\nhook up my professional microphone (I was a Dj in&nbsp;a former \nlife), the=\r\nn attached the RS-470. I asked for a technician and for reply with a \nname,=\r\n I swear, I couldn&#39;t hear them, and kept saying, &quot;repeat your name&quot;. I \ntho=\r\nught to myself, &quot;I would have been pissed getting someone that couldn&#39;t hea=\r\nr \nme, asking me to repeat my name, over and over again. Upon playback on m=\r\ny \ncomputer, I heard the responses, His name was Pete, and after asking his=\r\n name \nagain, he said, &quot;I Did&quot;. I definately did want to piss off anyone, e=\r\nspecially \nsomeone I haven&#39;t met before, but especially a spirit that I can=\r\n&#39;t see. I did \nasked them to test the unit by repeating the word &quot;Dragonfly=\r\n&quot;, I got a reply, \nbut it was very weak. Sounded like, &quot;ragon fly&quot;. You cou=\r\nld hear the fly more \nthan the dragon part.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Is=\r\n there a way to squelch the bonbardment of stations coming throught? If I \n=\r\ncan&#39;t hear them, will they get pissed off and stop communication? Beside be=\r\ning a \ninventor, ie, Frank Sumption, who I feel is the most qualified and t=\r\nalented in \nthis field, can &quot;we&quot;, those who have little technical skills, d=\r\no any better in \ngetting a, or creating a better unit from the RS-470 hack?=\r\n Does the training of \nyour ears take a long time with the multiple use of =\r\nthis unit? Am I hearing the \notherside, or am I fooling myself into hearing=\r\n what I want to hear from \nfragments of the stations coming through?&lt;/DIV&gt;\n=\r\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I would appreciate any response to my questions and =\r\nany help in my quest to \nbe a better RS-470 Hack owner.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/=\r\nDIV&gt;\n&lt;DIV&gt;Happy Haunting,&lt;/DIV&gt;\n&lt;DIV&gt;John Marc Carr&lt;/DIV&gt;&lt;/BODY&gt;&lt;/HTML&gt;\n\r\n------=_NextPart_000_0003_01C882B3.E0BFEB50--"}