{"id": "16083", "subject": "Re: [EVP-ITC] Re: Anyone else offended by C2C?", "author": "David Koenig", "timestamp": "2009-10-01T21:27:14Z", "full_text": "THANKS !!!!!!\n\nOn Thu, Oct 1, 2009 at 4:05 PM, ourobouros2k2 &lt;ourobouros2k2@...&gt;wrote:\n\n&gt;\n&gt;\n&gt; The information was featured in the book &quot;Strange Frequencies&quot; by Craig\n&gt; Telesha, and is also a key point in Jeff Belanger&#39;s &quot;History of ITC&quot;\n&gt; lecture. You can also hear Mr. Belanger discuss it on his darkness radio\n&gt; podcast on 4/13/08, just go to darknessradio.com and go to the archive\n&gt; page.\n&gt;\n&gt; There are many short, 1 paragraph blurbs on the subject (too many to list),\n&gt; just google Bogoras and EVP. For a more in-depth article on the man himself,\n&gt; check out\n&gt;\n&gt;\n&gt; http://www.mnsu.edu/emuseum/information/biography/abcde/bogoras_waldemar.html\n&gt;\n&gt;\n&gt; http://onlinebooks.library.upenn.edu/webbin/book/lookupname?key=Bogoras,%20Waldemar,%201865-1936\n&gt;\n&gt; thanks\n&gt; Andy\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, David Koenig\n&gt; &lt;floridajakeblues@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Can you point me to the Siberian tribe information. I&#39;m very interested!\n&gt; &gt; ThanksDave\n&gt; &gt;\n&gt; &gt; On Thu, Oct 1, 2009 at 8:18 AM, phenom_investigator &lt;\n&gt; &gt; phenom_investigator@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt; &lt;EVP-ITC%\n&gt; 40yahoogroups.com&gt;,\n&gt;\n&gt; &gt; &gt; &quot;ourobouros2k2&quot; &lt;ourobouros2k2@&gt; wrote:\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; EVP itself defies categorization. Some folks think it is a modulated\n&gt; em\n&gt; &gt; &gt; field in proximity to the microphone. There is evidence to support\n&gt; this, as\n&gt; &gt; &gt; evp has been recorded in faraday cages and vacuum jars. It would then\n&gt; be\n&gt; &gt; &gt; logical to assume that evp is independent of vibratory sound waves.\n&gt; Then\n&gt; &gt; &gt; that is blown to hell when you consider that Waldemar Bogoras is\n&gt; credited\n&gt; &gt; &gt; with the first reported evp capture while recording rituals of the\n&gt; Tchoutki\n&gt; &gt; &gt; tribe in Siberia in 1901. The was with a mechanical gramaphone-like\n&gt; device,\n&gt; &gt; &gt; no microphone, just a horn to amplify sound, mechanical &quot;write&quot; needle,\n&gt; and\n&gt; &gt; &gt; wax cylinder. Electric gramaphones didn&#39;t come about till almost the\n&gt; &#39;20s.\n&gt; &gt; &gt; In that case it would appear that evp exists as soundwaves and not em\n&gt; &gt; &gt; fields.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Which one is right? Both probably, and that isn&#39;t even taking into\n&gt; &gt; &gt; account the mechanism involved in box-related evp.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Intent and desire to communicate. The rest works itself out.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Thanks\n&gt; &gt; &gt; &gt; Andy\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; And all of this supports the notion that the real underlying principle\n&gt; is\n&gt; &gt; &gt; actually psychokinesis, most likely of the operator but possibly of\n&gt; some\n&gt; &gt; &gt; external agent as well. This would not require any external &#39;power&#39; in\n&gt; the\n&gt; &gt; &gt; sense we normally think of it, and would explain why such voices are\n&gt; &gt; &gt; recorded in powered and non-powered devices all using various recording\n&gt; &gt; &gt; media. It would also explain the presence of audio and video since PK\n&gt; &gt; &gt; appears to be an ability to affect the environment with the mind, which\n&gt; &gt; &gt; could extend to manipulating or creating video and audio signals.\n&gt; &gt; &gt;\n&gt; &gt; &gt; In this context, conducting (or perhaps more correctly replicating)\n&gt; tests\n&gt; &gt; &gt; in Faraday cages makes sense; in that one could then rule out anything\n&gt; &gt; &gt; electromagnetic as a potential source. It may or may not be the case\n&gt; that\n&gt; &gt; &gt; the sweep signal is critical to voice production. This is actually a\n&gt; notion\n&gt; &gt; &gt; that needs further clarification - the presence of noise seems\n&gt; beneficial,\n&gt; &gt; &gt; but is it required? Finding voices inside a Faraday cage in a\n&gt; replicated\n&gt; &gt; &gt; test would actually be a very helpful outcome to advancing the\n&gt; research.\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nTHANKS !!!!!!On Thu, Oc 1, 2009 a 4:05 PM, ou obou os2k2 ou obou os2k2@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n \n The in o ma ion was ea u ed in he book \"S ange F equencies\" by C aig Telesha, and is also a key poin in Je Belange 's \"His o y o ITC\" lec u e. You can also hea M . Belange discuss i on his da kness adio podcas on 4/13/08, jus go o da kness adio.com and go o he a chi e page.\n\n\nThe e a e many sho , 1 pa ag aph blu bs on he subjec ( oo many o lis ), jus google Bogo as and EVP. Fo a mo e in-dep h a icle on he man himsel , check ou \n\nh p://www.mnsu.edu/emuseum/in o ma ion/biog aphy/abcde/bogo as_waldema .h ml\n\nh p://onlinebooks.lib a y.upenn.edu/webbin/book/lookupname?key=Bogo as,%20Waldema ,%201865-1936\n\n\n hanks\nAndy\n\n--- In EVP-ITC@...m, Da id Koenig w o e:\n>\n> Can you poin me o he Sibe ian ibe in o ma ion. I'm e y in e es ed!\n> ThanksDa e\n> \n> On Thu, Oc 1, 2009 a 8:18 AM, phenom_in es iga o \n> phenom_in es iga o @...> w o e:\n> \n> >\n> >\n> > --- In EVP-ITC@yahoog oups.com 40yahoog oups.com>,\n\n> > \"ou obou os2k2\" w o e:\n> > >\n> > > EVP i sel de ies ca ego iza ion. Some olks hink i is a modula ed em\n> > ield in p oximi y o he mic ophone. The e is e idence o suppo his, as\n> > e p has been eco ded in a aday cages and acuum ja s. I would hen be\n> > logical o assume ha e p is independen o ib a o y sound wa es. Then\n> > ha is blown o hell when you conside ha Waldema Bogo as is c edi ed\n> > wi h he i s epo ed e p cap u e while eco ding i uals o he Tchou ki\n> > ibe in Sibe ia in 1901. The was wi h a mechanical g amaphone-like de ice,\n> > no mic ophone, jus a ho n o ampli y sound, mechanical \"w i e\" needle, and\n> > wax cylinde . Elec ic g amaphones didn' come abou ill almos he '20s.\n> > In ha case i would appea ha e p exis s as soundwa es and no em\n> > ields.\n> > >\n> > > Which one is igh ? Bo h p obably, and ha isn' e en aking in o\n> > accoun he mechanism in ol ed in box- ela ed e p.\n> > >\n> > > In en and desi e o communica e. The es wo ks i sel ou .\n> > >\n> > > Thanks\n> > > Andy\n> > >\n> >\n> > And all o his suppo s he no ion ha he eal unde lying p inciple is\n> > ac ually psychokinesis, mos likely o he ope a o bu possibly o some\n> > ex e nal agen as well. This would no equi e any ex e nal 'powe ' in he\n> > sense we no mally hink o i , and would explain why such oices a e\n> > eco ded in powe ed and non-powe ed de ices all using a ious eco ding\n> > media. I would also explain he p esence o audio and ideo since PK\n> > appea s o be an abili y o a ec he en i onmen wi h he mind, which\n> > could ex end o manipula ing o c ea ing ideo and audio signals.\n> >\n> > In his con ex , conduc ing (o pe haps mo e co ec ly eplica ing) es s\n> > in Fa aday cages makes sense; in ha one could hen ule ou any hing\n> > elec omagne ic as a po en ial sou ce. I may o may no be he case ha \n> > he sweep signal is c i ical o oice p oduc ion. This is ac ually a no ion\n> > ha needs u he cla i ica ion - he p esence o noise seems bene icial,\n> > bu is i equi ed? Finding oices inside a Fa aday cage in a eplica ed\n> > es would ac ually be a e y help ul ou come o ad ancing he esea ch.\n> >\n> > \n> >\n>"}