{"id": "16082", "subject": "Re: Anyone else offended by C2C?", "author": "ourobouros2k2", "timestamp": "2009-10-01T20:05:45Z", "full_text": "The information was featured in the book &quot;Strange Frequencies&quot; by Craig Telesha, and is also a key point in Jeff Belanger&#39;s &quot;History of ITC&quot; lecture. You can also hear Mr. Belanger discuss it on his darkness radio podcast on 4/13/08, just go to darknessradio.com and go to the archive page.\n\nThere are many short, 1 paragraph blurbs on the subject (too many to list), just google Bogoras and EVP. For a more in-depth article on the man himself, check out\n\nhttp://www.mnsu.edu/emuseum/information/biography/abcde/bogoras_waldemar.html\n\nhttp://onlinebooks.library.upenn.edu/webbin/book/lookupname?key=Bogoras,%20Waldemar,%201865-1936\n\nthanks\nAndy\n\n--- In EVP-ITC@yahoogroups.com, David Koenig &lt;floridajakeblues@...&gt; wrote:\n&gt;\n&gt; Can you point me to the Siberian tribe information. I&#39;m very interested!\n&gt; ThanksDave\n&gt; \n&gt; On Thu, Oct 1, 2009 at 8:18 AM, phenom_investigator &lt;\n&gt; phenom_investigator@...&gt; wrote:\n&gt; \n&gt; &gt;\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;,\n&gt; &gt; &quot;ourobouros2k2&quot; &lt;ourobouros2k2@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; EVP itself defies categorization. Some folks think it is a modulated em\n&gt; &gt; field in proximity to the microphone. There is evidence to support this, as\n&gt; &gt; evp has been recorded in faraday cages and vacuum jars. It would then be\n&gt; &gt; logical to assume that evp is independent of vibratory sound waves. Then\n&gt; &gt; that is blown to hell when you consider that Waldemar Bogoras is credited\n&gt; &gt; with the first reported evp capture while recording rituals of the Tchoutki\n&gt; &gt; tribe in Siberia in 1901. The was with a mechanical gramaphone-like device,\n&gt; &gt; no microphone, just a horn to amplify sound, mechanical &quot;write&quot; needle, and\n&gt; &gt; wax cylinder. Electric gramaphones didn&#39;t come about till almost the &#39;20s.\n&gt; &gt; In that case it would appear that evp exists as soundwaves and not em\n&gt; &gt; fields.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Which one is right? Both probably, and that isn&#39;t even taking into\n&gt; &gt; account the mechanism involved in box-related evp.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Intent and desire to communicate. The rest works itself out.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Thanks\n&gt; &gt; &gt; Andy\n&gt; &gt; &gt;\n&gt; &gt;\n&gt; &gt; And all of this supports the notion that the real underlying principle is\n&gt; &gt; actually psychokinesis, most likely of the operator but possibly of some\n&gt; &gt; external agent as well. This would not require any external &#39;power&#39; in the\n&gt; &gt; sense we normally think of it, and would explain why such voices are\n&gt; &gt; recorded in powered and non-powered devices all using various recording\n&gt; &gt; media. It would also explain the presence of audio and video since PK\n&gt; &gt; appears to be an ability to affect the environment with the mind, which\n&gt; &gt; could extend to manipulating or creating video and audio signals.\n&gt; &gt;\n&gt; &gt; In this context, conducting (or perhaps more correctly replicating) tests\n&gt; &gt; in Faraday cages makes sense; in that one could then rule out anything\n&gt; &gt; electromagnetic as a potential source. It may or may not be the case that\n&gt; &gt; the sweep signal is critical to voice production. This is actually a notion\n&gt; &gt; that needs further clarification - the presence of noise seems beneficial,\n&gt; &gt; but is it required? Finding voices inside a Faraday cage in a replicated\n&gt; &gt; test would actually be a very helpful outcome to advancing the research.\n&gt; &gt;\n&gt; &gt;  \n&gt; &gt;\n&gt;"}