{"id": "16081", "subject": "Re: [EVP-ITC] Re: Anyone else offended by C2C?", "author": "David Koenig", "timestamp": "2009-10-01T14:12:13Z", "full_text": "Can you point me to the Siberian tribe information. I&#39;m very interested!\nThanksDave\n\nOn Thu, Oct 1, 2009 at 8:18 AM, phenom_investigator &lt;\nphenom_investigator@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;,\n&gt; &quot;ourobouros2k2&quot; &lt;ourobouros2k2@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; EVP itself defies categorization. Some folks think it is a modulated em\n&gt; field in proximity to the microphone. There is evidence to support this, as\n&gt; evp has been recorded in faraday cages and vacuum jars. It would then be\n&gt; logical to assume that evp is independent of vibratory sound waves. Then\n&gt; that is blown to hell when you consider that Waldemar Bogoras is credited\n&gt; with the first reported evp capture while recording rituals of the Tchoutki\n&gt; tribe in Siberia in 1901. The was with a mechanical gramaphone-like device,\n&gt; no microphone, just a horn to amplify sound, mechanical &quot;write&quot; needle, and\n&gt; wax cylinder. Electric gramaphones didn&#39;t come about till almost the &#39;20s.\n&gt; In that case it would appear that evp exists as soundwaves and not em\n&gt; fields.\n&gt; &gt;\n&gt; &gt; Which one is right? Both probably, and that isn&#39;t even taking into\n&gt; account the mechanism involved in box-related evp.\n&gt; &gt;\n&gt; &gt; Intent and desire to communicate. The rest works itself out.\n&gt; &gt;\n&gt; &gt; Thanks\n&gt; &gt; Andy\n&gt; &gt;\n&gt;\n&gt; And all of this supports the notion that the real underlying principle is\n&gt; actually psychokinesis, most likely of the operator but possibly of some\n&gt; external agent as well. This would not require any external &#39;power&#39; in the\n&gt; sense we normally think of it, and would explain why such voices are\n&gt; recorded in powered and non-powered devices all using various recording\n&gt; media. It would also explain the presence of audio and video since PK\n&gt; appears to be an ability to affect the environment with the mind, which\n&gt; could extend to manipulating or creating video and audio signals.\n&gt;\n&gt; In this context, conducting (or perhaps more correctly replicating) tests\n&gt; in Faraday cages makes sense; in that one could then rule out anything\n&gt; electromagnetic as a potential source. It may or may not be the case that\n&gt; the sweep signal is critical to voice production. This is actually a notion\n&gt; that needs further clarification - the presence of noise seems beneficial,\n&gt; but is it required? Finding voices inside a Faraday cage in a replicated\n&gt; test would actually be a very helpful outcome to advancing the research.\n&gt;\n&gt;  \n&gt;\n\nCan you poin me o he Sibe ian ibe in o ma ion. I'm e y in e es ed! ThanksDa eOn Thu, Oc 1, 2009 a 8:18 AM, phenom_in es iga o phenom_in es iga o @...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n \n --- In EVP-ITC@yahoog oups.com, \"ou obou os2k2\" w o e:\n>\n> EVP i sel de ies ca ego iza ion. Some olks hink i is a modula ed em ield in p oximi y o he mic ophone. The e is e idence o suppo his, as e p has been eco ded in a aday cages and acuum ja s. I would hen be logical o assume ha e p is independen o ib a o y sound wa es. Then ha is blown o hell when you conside ha Waldema Bogo as is c edi ed wi h he i s epo ed e p cap u e while eco ding i uals o he Tchou ki ibe in Sibe ia in 1901. The was wi h a mechanical g amaphone-like de ice, no mic ophone, jus a ho n o ampli y sound, mechanical \"w i e\" needle, and wax cylinde . Elec ic g amaphones didn' come abou ill almos he '20s. In ha case i would appea ha e p exis s as soundwa es and no em ields.\n\n> \n> Which one is igh ? Bo h p obably, and ha isn' e en aking in o accoun he mechanism in ol ed in box- ela ed e p.\n> \n> In en and desi e o communica e. The es wo ks i sel ou .\n> \n> Thanks\n> Andy\n> \n\nAnd all o his suppo s he no ion ha he eal unde lying p inciple is ac ually psychokinesis, mos likely o he ope a o bu possibly o some ex e nal agen as well. This would no equi e any ex e nal 'powe ' in he sense we no mally hink o i , and would explain why such oices a e eco ded in powe ed and non-powe ed de ices all using a ious eco ding media. I would also explain he p esence o audio and ideo since PK appea s o be an abili y o a ec he en i onmen wi h he mind, which could ex end o manipula ing o c ea ing ideo and audio signals. \n\n\nIn his con ex , conduc ing (o pe haps mo e co ec ly eplica ing) es s in Fa aday cages makes sense; in ha one could hen ule ou any hing elec omagne ic as a po en ial sou ce. I may o may no be he case ha he sweep signal is c i ical o oice p oduc ion. This is ac ually a no ion ha needs u he cla i ica ion - he p esence o noise seems bene icial, bu is i equi ed? Finding oices inside a Fa aday cage in a eplica ed es would ac ually be a e y help ul ou come o ad ancing he esea ch."}