{"id": "16090", "subject": "Re: Anyone else offended by C2C?", "author": "Alan", "timestamp": "2009-10-02T16:47:40Z", "full_text": "I think C2C is one of the few media places where EVP, Spiritualism, Mediumship, Ghost-hunting, and things of that nature get a fair hearing. I think George Noory does a great job of extending courtesy towards his guests and listeners. Hell, how many times has Frank been on C2C? People obviously react or he wouldn&#39;t be brought back.\n\n--- In EVP-ITC@yahoogroups.com, Zack Widup &lt;w9sz.zack@...&gt; wrote:\n&gt;\n&gt; In my mind the word &quot;skeptic&quot; is a misnomer. There is a difference between a\n&gt; skeptic and an unbeliever.\n&gt; \n&gt; If I said &quot;I&#39;m skeptical about your rebuilding that engine&quot; I would admit\n&gt; that it&#39;s possible, just doubt that you&#39;re going to do it.  An unbeliever\n&gt; wouldn&#39;t believe that it&#39;s even possible to rebuild engines.\n&gt; \n&gt; I think most of the &quot;skeptics&quot; we see in any sort of paranormal sphere are\n&gt; really unbelievers. As Frank pointed out, they don&#39;t even believe or\n&gt; recognize that we ARE spirits, so how could a ghost exist and how could the\n&gt; box work? A ghost could hit them in the head with a 2X4 and they still\n&gt; wouldn&#39;t believe it.\n&gt; \n&gt; Zack\n&gt; \n&gt; On Fri, Oct 2, 2009 at 3:22 AM, ourobouros2k2 &lt;ourobouros2k2@...&gt;wrote:\n&gt; \n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Not to mention that when they want to &quot;test&quot; something they are already\n&gt; &gt; skeptical about, then they will come up with impossible criteria. The day I\n&gt; &gt; finally stopped caring why a ghost box worked and just accepted that it did\n&gt; &gt; was the start of rewarding sessions.\n&gt; &gt;\n&gt; &gt; I think most of us are beyond the point where skeptics can make a dent in\n&gt; &gt; our searching for answers. Skepticism can be good, but sometimes it can be\n&gt; &gt; self defeating. More people just want to make a name for themselves by\n&gt; &gt; trying to be the one that brought down this or that device. If they would\n&gt; &gt; try some of these methods with an open mind and a brief suspension of\n&gt; &gt; disbelief, then they might get their own rewarding experiences as well...\n&gt; &gt;\n&gt; &gt; Andy\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;,\n&gt; &gt; &quot;purplespacefriend&quot; &lt;purplealiengirl@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; Well then, just build youself a box and test the hell out of it!\n&gt; &gt; &gt;\n&gt; &gt; &gt; I&#39;ve said all along that one has to be careful not to create the\n&gt; &gt; voices/answers one wants to hear. We are, despite appearances, spirit, and\n&gt; &gt; we can create our own spirit voices just as easy as any other entity. But\n&gt; &gt; what do I know, I just make the damn boxes and I don&#39;t even believe in ghost\n&gt; &gt; hunting!?\n&gt; &gt; &gt;\n&gt; &gt; &gt; Whatever these brainiacs claim that want to do all this testing--they\n&gt; &gt; never-ever ask the freaking inventors! They can&#39;t even get their heads\n&gt; &gt; around EVPmaker, so pretend that doesn&#39;t even exist, even though the box\n&gt; &gt; came later. Probably they think it would be easier to disprove the box. Some\n&gt; &gt; duffus puts a DR. in front of his name and I&#39;m supposed to be impressed, it\n&gt; &gt; just means all intellect has been programmed out. After all , they &quot;know&quot;\n&gt; &gt; there are no spirits, so it has to be something else--anything else!\n&gt; &gt; &gt;\n&gt; &gt; &gt; Frank-S\n&gt; &gt; &gt;\n&gt; &gt;\n&gt; &gt;  \n&gt; &gt;\n&gt;"}