{"id": "16094", "subject": "Re: Newbie to RS-Hack 470", "author": "mrscaptainjack2", "timestamp": "2009-10-02T23:03:47Z", "full_text": "Hi John!  \n\nIn my (albiet small) experience, the ability to hear something amid the noise can depend upon several factors:  your own mood, your tiredness (or lack thereof), who you are getting on the other side and how in tune/proficient/emotionally connected they are, and maybe most importantly, the time of day and/or the weather.\n\nBeing tired or in a bad mood can affect the results.\n\nWho you get talking to you can affect the results.  If I&#39;m talking to this guy &quot;Steve&quot; (who, by the way, I haven&#39;t gotten for quite a while), the messages are always loud and clear, even though I didn&#39;t know this guy in real life.  When I talked to my dad, however, I think it took him a while to come through loudly; I think he was there earlier, but I just didn&#39;t hear him.  Maybe he was distracted, or maybe there was a learning curve, or maybe he and I don&#39;t &quot;resonate&quot; on the same frequency.  Who knows?\n\nThe time of day seems to make a huge difference for me.  After dark, radio stations seem more numerous, so the airwaves are crowded -- it makes it ten times harder for me to hear the responses because I can&#39;t sift through all the noise.  If the weather is overcast, rainy or foggy, it seems to make it harder, too.  Clear sunny days work the best for me.  Maybe this was the difference between your sessions?\n\nJill\n\n--- In EVP-ITC@yahoogroups.com, &quot;John M. Carr&quot; &lt;johnmarc_carr@...&gt; wrote:\n&gt;\n&gt; Hi Everyone & Frank,\n&gt; I just completed my first RS-470 Hack, and was successful in my first 2 mini session. Mine bc I so startled that I got a reply on the first try,(got &quot;Frank&quot; on the other end, not Frank S.) then on the second session, I tested the radio by telling them I&#39;m writing a name on a piece of paper, which was my name, &quot;John&quot;, and they told me &quot;John&quot; before I completed the &quot;n&quot;. I, unfortunately didn&#39;t hook up the RS-470 to a recorder due to that I didn&#39;t have a microphone set-up to mix me and the box. While this was happening, I kept hearing my walls admit the sound of furniture moving, I looked around my duplex, nothing was moving, I looked outside to see if my neighbor might be home, but his car wasn&#39;t there. I got spooked, even though I&#39;ve been an investigator since 1998. I did remember to tell them to go back to the other side before I shut my unit off, they said, &quot;wait&quot;, then &quot;o.k.&quot;.\n&gt; \n&gt; On the next day, I tried another session that didn&#39;t go so well. I live in SE Florida and there is so many radio stations that I was bonbarded with sound and I guess my ear wasn&#39;t quite trained enough to get the astral being/ technician on the otherside. I did 2 session and felt helpless to all the different station that were coming through. Later that day, I was able to get a mixing unit and hook up my professional microphone (I was a Dj in a former life), then attached the RS-470. I asked for a technician and for reply with a name, I swear, I couldn&#39;t hear them, and kept saying, &quot;repeat your name&quot;. I thought to myself, &quot;I would have been pissed getting someone that couldn&#39;t hear me, asking me to repeat my name, over and over again. Upon playback on my computer, I heard the responses, His name was Pete, and after asking his name again, he said, &quot;I Did&quot;. I definately did want to piss off anyone, especially someone I haven&#39;t met before, but especially a spirit that I can&#39;t see. I did asked them to test the unit by repeating the word &quot;Dragonfly&quot;, I got a reply, but it was very weak. Sounded like, &quot;ragon fly&quot;. You could hear the fly more than the dragon part.\n&gt; \n&gt; Is there a way to squelch the bonbardment of stations coming throught? If I can&#39;t hear them, will they get pissed off and stop communication? Beside being a inventor, ie, Frank Sumption, who I feel is the most qualified and talented in this field, can &quot;we&quot;, those who have little technical skills, do any better in getting a, or creating a better unit from the RS-470 hack? Does the training of your ears take a long time with the multiple use of this unit? Am I hearing the otherside, or am I fooling myself into hearing what I want to hear from fragments of the stations coming through?\n&gt; \n&gt; I would appreciate any response to my questions and any help in my quest to be a better RS-470 Hack owner.\n&gt; \n&gt; Happy Haunting,\n&gt; John Marc Carr\n&gt;"}