{"id": "16117", "subject": "Re: [EVP-ITC] A Question on Radiation", "author": "Zack Widup", "timestamp": "2009-10-06T02:56:21Z", "full_text": "It depends on what radiation you&#39;re talking about,  the electronic equipment\nand what it&#39;s made of.\n\nEMP (electromagnetic pulse) generated at the time of a nuclear detonation\nwill probably wipe out any solid-state electronics that isn&#39;t heavily\nshielded against it. Alpha and beta particles could affect some electronics\nthat managed to survive an EMP.\n\nThe older stuff like RTL and TTL logic is probably not going to be much\naffected by the alpha and beta radiation. CMOS devices, sensitive to static\ndischarges, would be next. VLSI chips have the greatest chance of being\naffected (read: home computers). Vacuum tube circuits would hardly be\naffected at all, even by EMP.\nStrange that some of our oldest devices would be the last to go.\n:-)\n\nZack\n\n\nOn Mon, Oct 5, 2009 at 9:33 PM, Jon &lt;jms480@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;   yes it causes electronic equipment to malfunction.\n&gt;\n&gt; Regards,\n&gt; Jon in Texas\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; --- On *Sat, 10/3/09, April Abercrombie &lt;\n&gt; april@abercrombieghostresearch.com&gt;* wrote:\n&gt;\n&gt;\n&gt; From: April Abercrombie &lt;april@abercrombieghostresearch.com&gt;\n&gt; Subject: [EVP-ITC] A Question on Radiation\n&gt; To: &quot;EVP-ITC Group&quot; &lt;EVP-ITC@yahoogroups.com&gt;\n&gt; Date: Saturday, October 3, 2009, 8:38 AM\n&gt;\n&gt;\n&gt;\n&gt; Does anyone here know anything about radiation? In particularly if it can\n&gt; cause electronic equipment to malfunction?\n&gt;\n&gt; Thanks!\n&gt;\n&gt;\n&gt; \n&gt;\n\nI depends on wha adia ion you' e alking abou ,   he elec onic equipmen and wha i 's made o . \n \nEMP (elec omagne ic pulse) gene a ed a he ime o a nuclea de ona ion will p obably wipe ou any solid-s a e elec onics ha isn' hea ily shielded agains i . Alpha and be a pa icles could a ec some elec onics ha managed o su i e an EMP.\n\n \nThe olde s u like RTL and TTL logic is p obably no going o be much a ec ed by he alpha and be a adia ion. CMOS de ices, sensi i e o s a ic discha ges, would be nex . VLSI chips ha e he g ea es chance o being a ec ed ( ead: home compu e s). Vacuum ube ci cui s would ha dly be a ec ed a all, e en by EMP.\n\nS ange ha some o ou oldes de ices would be he las o go.\n:-)\n \nZack \n \nOn Mon, Oc 5, 2009 a 9:33 PM, Jon jms480@...> w o e:\n\n  \n\n\n\n\n\n\n\nyes i causes elec onic equipmen o mal unc ion.\nRega ds,Jon in Texas\n\n --- On Sa , 10/3/09, Ap il Abe c ombie ap il@...> w o e:\n\nF om: Ap il Abe c ombie ap il@abe c ombieghos esea ch.com>\nSubjec : [EVP-ITC] A Ques ion on Radia ionTo: \"EVP-ITC G oup\" EVP-ITC@yahoog oups.com>Da e: Sa u day, Oc obe 3, 2009, 8:38 AM \n\n  \n\n\nDoes anyone he e know any hing abou adia ion? In pa icula ly i i can cause elec onic equipmen o mal unc ion?\n \nThanks!"}