{"id": "16121", "subject": "Re: [EVP-ITC] A Question on Radiation", "author": "Zack Widup", "timestamp": "2009-10-06T03:44:38Z", "full_text": "No, I include them in the category of VLSI devices. Even if they don&#39;t have\nmicrocontrollers they usually have FPGA&#39;s or CPLD&#39;s in them. Very easy to\ndamage even if it&#39;s all alphabet soup!\n:-)\n\nZack\n\nOn Mon, Oct 5, 2009 at 10:15 PM, Jon &lt;jms480@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;   Hi Zack,\n&gt;\n&gt; You fail to mention all the dishwashers, laundry equipment, refrigerators,\n&gt; stoves, ovens, and ice machines in every home.  All the medical equipment in\n&gt; the hospitals.\n&gt; These devices have all come to use computer boards in them.\n&gt;\n&gt; We have frequent storms here on the Texas Gulf Coast.  I can&#39;t begin to\n&gt; tell you how barbaric we become with the extended loss of electricity.\n&gt; Radiation would be far worse and more wide spread.\n&gt;\n&gt; Regards,\n&gt; Jon in Texas\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; --- On *Mon, 10/5/09, Zack Widup &lt;w9sz.zack@...&gt;* wrote:\n&gt;\n&gt;\n&gt; From: Zack Widup &lt;w9sz.zack@...&gt;\n&gt; Subject: Re: [EVP-ITC] A Question on Radiation\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Monday, October 5, 2009, 9:56 PM\n&gt;\n&gt;\n&gt;\n&gt; It depends on what radiation you&#39;re talking about,  the electronic\n&gt; equipment and what it&#39;s made of.\n&gt;\n&gt; EMP (electromagnetic pulse) generated at the time of a nuclear detonation\n&gt; will probably wipe out any solid-state electronics that isn&#39;t heavily\n&gt; shielded against it. Alpha and beta particles could affect some electronics\n&gt; that managed to survive an EMP.\n&gt;\n&gt; The older stuff like RTL and TTL logic is probably not going to be much\n&gt; affected by the alpha and beta radiation. CMOS devices, sensitive to static\n&gt; discharges, would be next. VLSI chips have the greatest chance of being\n&gt; affected (read: home computers). Vacuum tube circuits would hardly be\n&gt; affected at all, even by EMP.\n&gt; Strange that some of our oldest devices would be the last to go.\n&gt; :-)\n&gt;\n&gt; Zack\n&gt;\n&gt;\n&gt;  On Mon, Oct 5, 2009 at 9:33 PM, Jon &lt;jms480@yahoo. com&lt;http://mc/compose?to=jms480@...&gt;\n&gt; &gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;   yes it causes electronic equipment to malfunction.\n&gt;&gt;\n&gt;&gt; Regards,\n&gt;&gt; Jon in Texas\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; --- On *Sat, 10/3/09, April Abercrombie &lt;april@abercrombiegh ostresearch.\n&gt;&gt; com &lt;http://mc/compose?to=april@...&gt;&gt;* wrote:\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; From: April Abercrombie &lt;april@abercrombiegh ostresearch. com&lt;http://mc/compose?to=april@...&gt;\n&gt;&gt; &gt;\n&gt;&gt;  Subject: [EVP-ITC] A Question on Radiation\n&gt;&gt; To: &quot;EVP-ITC Group&quot; &lt;EVP-ITC@yahoogroups .com&lt;http://mc/compose?to=EVP-ITC@yahoogroups.com&gt;\n&gt;&gt; &gt;\n&gt;&gt; Date: Saturday, October 3, 2009, 8:38 AM\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; Does anyone here know anything about radiation? In particularly if it can\n&gt;&gt; cause electronic equipment to malfunction?\n&gt;&gt;\n&gt;&gt; Thanks!\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;\n&gt; \n&gt;\n\nNo, I include hem in he ca ego y o VLSI de ices. E en i hey don' ha e mic ocon olle s hey usually ha e FPGA's o CPLD's in hem. Ve y easy o damage e en i i 's all alphabe soup!\n:-)\n \nZack\nOn Mon, Oc 5, 2009 a 10:15 PM, Jon jms480@...> w o e:\n\n  \n\n\n\n\n\n\n\nHi Zack,You ail o men ion all he dishwashe s, laund y equipmen , e ige a o s, s o es, o ens, and ice machines in e e y home.  All he medical equipmen in he hospi als. These de ices ha e all come o use compu e boa ds in hem.  \nWe ha e equen s o ms he e on he Texas Gul Coas .  I can' begin o ell you how ba ba ic we become wi h he ex ended loss o elec ici y.  Radia ion would be a wo se and mo e wide sp ead. \nRega ds,Jon in Texas\n --- On Mon, 10/5/09, Zack Widup w9sz.zack@...> w o e:\nF om: Zack Widup w9sz.zack@...>Subjec : Re: [EVP-ITC] A Ques ion on Radia ionTo: EVP-ITC@yahoog oups.com\nDa e: Monday, Oc obe 5, 2009, 9:56 PM\n  \n\n\n\nI depends on wha adia ion you' e alking abou ,   he elec onic equipmen and wha i 's made o . \n \nEMP (elec omagne ic pulse) gene a ed a he ime o a nuclea de ona ion will p obably wipe ou any solid-s a e elec onics ha isn' hea ily shielded agains i . Alpha and be a pa icles could a ec some elec onics ha managed o su i e an EMP.\n\n \nThe olde s u like RTL and TTL logic is p obably no going o be much a ec ed by he alpha and be a adia ion. CMOS de ices, sensi i e o s a ic discha ges, would be nex . VLSI chips ha e he g ea es chance o being a ec ed ( ead: home compu e s). Vacuum ube ci cui s would ha dly be a ec ed a all, e en by EMP.\n\nS ange ha some o ou oldes de ices would be he las o go.\n:-)\n \nZack \n \n\nOn Mon, Oc 5, 2009 a 9:33 PM, Jon jms480@yahoo. com> w o e:\n\n  \n\n\n\n\n\n\n\n\nyes i causes elec onic equipmen o mal unc ion.\nRega ds,Jon in Texas\n\n --- On Sa , 10/3/09, Ap il Abe c ombie ap il@abe c ombiegh os esea ch. com> w o e:\n\n\nF om: Ap il Abe c ombie ap il@abe c ombiegh os esea ch. com>\n\nSubjec : [EVP-ITC] A Ques ion on Radia ionTo: \"EVP-ITC G oup\" EVP-ITC@yahoog oups .com>Da e: Sa u day, Oc obe 3, 2009, 8:38 AM \n\n  \n\n\nDoes anyone he e know any hing abou adia ion? In pa icula ly i i can cause elec onic equipmen o mal unc ion?\n \nThanks!"}