{"id": "16182", "subject": "2012 is not the end!", "author": "April Abercrombie", "timestamp": "2009-10-11T15:39:05Z", "full_text": "------=_NextPart_000_006F_01CA4A56.AC34E130\r\nContent-Type: text/plain;\n\tcharset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nhttp://news.yahoo.com/s/ap/20091011/ap_on_re_la_am_ca/lt_mexico_apocalypse2=\r\n012\n\n\n\nMEXICO CITY - Apolinario Chile Pixtun is tired of being bombarded wi=\r\nth frantic questions about the Mayan calendar supposedly &quot;running out&quot; on D=\r\nec. 21, 2012. After all, it&#39;s not the end of the world.\n\nOr is it?\n\nDefinit=\r\nely not, the Mayan Indian elder insists. &quot;I came back from England last yea=\r\nr and, man, they had me fed up with this stuff.&quot;\n\nIt can only get worse for=\r\n him. Next month Hollywood&#39;s &quot;2012&quot; opens in cinemas, featuring earthquakes=\r\n, meteor showers and a tsunami dumping an aircraft carrier on the White Hou=\r\nse.\n\nAt Cornell University, Ann Martin, who runs the &quot;Curious? Ask an Astro=\r\nnomer&quot; Web site, says people are scared.\n\n&quot;It&#39;s too bad that we&#39;re getting =\r\ne-mails from fourth-graders who are saying that they&#39;re too young to die,&quot; =\r\nMartin said. &quot;We had a mother of two young children who was afraid she woul=\r\ndn&#39;t live to see them grow up.&quot;\n\nChile Pixtun, a Guatemalan, says the dooms=\r\nday theories spring from Western, not Mayan ideas.\n\nA significant time peri=\r\nod for the Mayas does end on the date, and enthusiasts have found a series =\r\nof astronomical alignments they say coincide in 2012, including one that ha=\r\nppens roughly only once every 25,800 years.\n\nBut most archaeologists, astro=\r\nnomers and Maya say the only thing likely to hit Earth is a meteor shower o=\r\nf New Age philosophy, pop astronomy, Internet doomsday rumors and TV specia=\r\nls such as one on the History Channel which mixes &quot;predictions&quot; from Nostra=\r\ndamus and the Mayas and asks: &quot;Is 2012 the year the cosmic clock finally wi=\r\nnds down to zero days, zero hope?&quot;\n\nIt may sound all too much like other do=\r\nomsday scenarios of recent decades - the 1987 Harmonic Convergence, the Jup=\r\niter Effect or &quot;Planet X.&quot; But this one has some grains of archaeological b=\r\nasis.\n\nOne of them is Monument Six.\n\nFound at an obscure ruin in southern M=\r\nexico during highway construction in the 1960s, the stone tablet almost did=\r\nn&#39;t survive; the site was largely paved over and parts of the tablet were l=\r\nooted.\n\nIt&#39;s unique in that the remaining parts contain the equivalent of t=\r\nhe date 2012. The inscription describes something that is supposed to occur=\r\n in 2012 involving Bolon Yokte, a mysterious Mayan god associated with both=\r\n war and creation.\n\nHowever - shades of Indiana Jones - erosion and a crack=\r\n in the stone make the end of the passage almost illegible.\n\nArchaeologist =\r\nGuillermo Bernal of Mexico&#39;s National Autonomous University interprets the =\r\nlast eroded glyphs as maybe saying, &quot;He will descend from the sky.&quot;\n\nSpooky=\r\n, perhaps, but Bernal notes there are other inscriptions at Mayan sites for=\r\n dates far beyond 2012 - including one that roughly translates into the yea=\r\nr 4772.\n\nAnd anyway, Mayas in the drought-stricken Yucatan peninsula have b=\r\nigger worries than 2012.\n\n&quot;If I went to some Mayan-speaking communities and=\r\n asked people what is going to happen in 2012, they wouldn&#39;t have any idea,=\r\n&quot; said Jose Huchim, a Yucatan Mayan archaeologist. &quot;That the world is going=\r\n to end? They wouldn&#39;t believe you. We have real concerns these days, like =\r\nrain.&quot;\n\nThe Mayan civilization, which reached its height from 300 A.D. to 9=\r\n00 A.D., had a talent for astronomy\n\nIts Long Count calendar begins in 3,11=\r\n4 B.C., marking time in roughly 394-year periods known as Baktuns. Thirteen=\r\n was a significant, sacred number for the Mayas, and the 13th Baktun ends a=\r\nround Dec. 21, 2012.\n\n&quot;It&#39;s a special anniversary of creation,&quot; said David =\r\nStuart, a specialist in Mayan epigraphy at the University of Texas at Austi=\r\nn. &quot;The Maya never said the world is going to end, they never said anything=\r\n bad would happen necessarily, they&#39;re just recording this future anniversa=\r\nry on Monument Six.&quot;\n\nBernal suggests that apocalypse is &quot;a very Western, C=\r\nhristian&quot; concept projected onto the Maya, perhaps because Western myths ar=\r\ne &quot;exhausted.&quot;\n\nIf it were all mythology, perhaps it could be written off.\n=\r\n\nBut some say the Maya knew another secret: the Earth&#39;s axis wobbles, sligh=\r\ntly changing the alignment of the stars every year. Once every 25,800 years=\r\n, the sun lines up with the center of our Milky Way galaxy on a winter sols=\r\ntice, the sun&#39;s lowest point in the horizon.\n\nThat will happen on Dec. 21, =\r\n2012, when the sun appears to rise in the same spot where the bright center=\r\n of galaxy sets.\n\nAnother spooky coincidence?\n\n&quot;The question I would ask th=\r\nese guys is, so what?&quot; says Phil Plait, an astronomer who runs the &quot;Bad Ast=\r\nronomy&quot; blog. He says the alignment doesn&#39;t fall precisely in 2012, and dis=\r\ntant stars exert no force that could harm Earth.\n\n&quot;They&#39;re really super-dup=\r\ner trying to find anything astronomical they can to fit that date of 2012,&quot;=\r\n Plait said.\n\nBut author John Major Jenkins says his two-decade study of Ma=\r\nyan ruins indicate the Maya were aware of the alignment and attached great =\r\nimportance to it.\n\n&quot;If we want to honor and respect how the Maya think abou=\r\nt this, then we would say that the Maya viewed 2012, as all cycle endings, =\r\nas a time of transformation and renewal,&quot; said Jenkins.\n\nAs the Internet ga=\r\nined popularity in the 1990s, so did word of the &quot;fateful&quot; date, and some b=\r\negan worrying about 2012 disasters the Mayas never dreamed of.\n\nAuthor Lawr=\r\nence Joseph says a peak in explosive storms on the surface of the sun could=\r\n knock out North America&#39;s power grid for years, triggering food shortages,=\r\n water scarcity - a collapse of civilization. Solar peaks occur about every=\r\n 11 years, but Joseph says there&#39;s evidence the 2012 peak could be &quot;a lulu.=\r\n&quot;\n\nWhile pressing governments to install protection for power grids, Joseph=\r\n counsels readers not to &quot;use 2012 as an excuse to not live in a healthy, r=\r\nesponsible fashion. I mean, don&#39;t let the credit cards go up.&quot;\n\nAnother His=\r\ntory Channel program titled &quot;Decoding the Past: Doomsday 2012: End of Days&quot;=\r\n says a galactic alignment or magnetic disturbances could somehow trigger a=\r\n &quot;pole shift.&quot;\n\n&quot;The entire mantle of the earth would shift in a matter of =\r\ndays, perhaps hours, changing the position of the north and south poles, ca=\r\nusing worldwide disaster,&quot; a narrator proclaims. &quot;Earthquakes would rock ev=\r\nery continent, massive tsunamis would inundate coastal cities. It would be =\r\nthe ultimate planetary catastrophe.&quot;\n\nThe idea apparently originates with a=\r\n 19th century Frenchman, Charles Etienne Brasseur de Bourbourg, a priest-tu=\r\nrned-archaeologist who got it from his study of ancient Mayan and Aztec tex=\r\nts.\n\nScientists say that, at best, the poles might change location by one d=\r\negree over a million years, with no sign that it would start in 2012.\n\nWhil=\r\ne long discredited, Brasseur de Bourbourg proves one thing: Westerners have=\r\n been trying for more than a century to pin doomsday scenarios on the Maya.=\r\n And while fascinated by ancient lore, advocates seldom examine more recent=\r\n experiences with apocalypse predictions.\n\n&quot;No one who&#39;s writing in now see=\r\nms to remember that the last time we thought the world was going to end, it=\r\n didn&#39;t,&quot; says Martin, the astronomy webmaster. &quot;There doesn&#39;t seem to be a=\r\n lot of memory that things were fine the last time around.&quot;\n\r\n------=_NextPart_000_006F_01CA4A56.AC34E130\r\nContent-Type: text/html;\n\tcharset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML 4.0 Transitional//EN&quot;&gt;\n&lt;HTML&gt;&lt;HEAD&gt;=\r\n\n&lt;META content=3D&quot;text/html; charset=3Diso-8859-1&quot; http-equiv=3DContent-Typ=\r\ne&gt;\n&lt;META name=3DGENERATOR content=3D&quot;MSHTML 8.00.6001.18812&quot;&gt;\n&lt;STYLE&gt;&lt;/STYL=\r\nE&gt;\n&lt;/HEAD&gt;\n&lt;BODY bgColor=3D#ffffff&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 face=3D&quot;Myriad Pro&quot;=\r\n&gt;\n&lt;P&gt;http://news.&lt;WBR&gt;yahoo.com/&lt;WBR&gt;s/ap/20091011/&lt;WBR&gt;ap_on_re_&lt;WBR&gt;la_am=\r\n_ca/&lt;WBR&gt;lt_mexico_&lt;WBR&gt;apocalypse2012&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;MEXICO \nCITY =96 Apol=\r\ninario Chile Pixtun is tired of being bombarded with frantic \nquestions abo=\r\nut the Mayan calendar supposedly &quot;running out&quot; on Dec. 21, 2012. \nAfter all=\r\n, it&#39;s not the end of the world.&lt;BR&gt;&lt;BR&gt;Or is it?&lt;BR&gt;&lt;BR&gt;Definitely \nnot, t=\r\nhe Mayan Indian elder insists. &quot;I came back from England last year and, \nma=\r\nn, they had me fed up with this stuff.&quot;&lt;BR&gt;&lt;BR&gt;It can only get worse for hi=\r\nm. \nNext month Hollywood&#39;s &quot;2012&quot; opens in cinemas, featuring earthquakes, =\r\nmeteor \nshowers and a tsunami dumping an aircraft carrier on the White Hous=\r\ne.&lt;BR&gt;&lt;BR&gt;At \nCornell University, Ann Martin, who runs the &quot;Curious? Ask an=\r\n Astronomer&quot; Web \nsite, says people are scared.&lt;BR&gt;&lt;BR&gt;&quot;It&#39;s too bad that w=\r\ne&#39;re getting e-mails \nfrom fourth-graders who are saying that they&#39;re too y=\r\noung to die,&quot; Martin said. \n&quot;We had a mother of two young children who was =\r\nafraid she wouldn&#39;t live to see \nthem grow up.&quot;&lt;BR&gt;&lt;BR&gt;Chile Pixtun, a Guat=\r\nemalan, says the doomsday theories \nspring from Western, not Mayan ideas.&lt;B=\r\nR&gt;&lt;BR&gt;A significant time period for the \nMayas does end on the date, and en=\r\nthusiasts have found a series of astronomical \nalignments they say coincide=\r\n in 2012, including one that happens roughly only \nonce every 25,800 years.=\r\n&lt;BR&gt;&lt;BR&gt;But most archaeologists, astronomers and Maya \nsay the only thing l=\r\nikely to hit Earth is a meteor shower of New Age philosophy, \npop astronomy=\r\n, Internet doomsday rumors and TV specials such as one on the \nHistory Chan=\r\nnel which mixes &quot;predictions&quot; from Nostradamus and the Mayas and \nasks: &quot;Is=\r\n 2012 the year the cosmic clock finally winds down to zero days, zero \nhope=\r\n?&quot;&lt;BR&gt;&lt;BR&gt;It may sound all too much like other doomsday scenarios of recent=\r\n \ndecades =97 the 1987 Harmonic Convergence, the Jupiter Effect or &quot;Planet =\r\nX.&quot; But \nthis one has some grains of archaeological basis.&lt;BR&gt;&lt;BR&gt;One of th=\r\nem is Monument \nSix.&lt;BR&gt;&lt;BR&gt;Found at an obscure ruin in southern Mexico dur=\r\ning highway \nconstruction in the 1960s, the stone tablet almost didn&#39;t surv=\r\nive; the site was \nlargely paved over and parts of the tablet were looted.&lt;=\r\nBR&gt;&lt;BR&gt;It&#39;s unique in \nthat the remaining parts contain the equivalent of t=\r\nhe date 2012. The \ninscription describes something that is supposed to occu=\r\nr in 2012 involving \nBolon Yokte, a mysterious Mayan god associated with bo=\r\nth war and \ncreation.&lt;BR&gt;&lt;BR&gt;However =97 shades of Indiana Jones =97 erosio=\r\nn and a crack in the \nstone make the end of the passage almost illegible.&lt;B=\r\nR&gt;&lt;BR&gt;Archaeologist \nGuillermo Bernal of Mexico&#39;s National Autonomous Unive=\r\nrsity interprets the last \neroded glyphs as maybe saying, &quot;He will descend =\r\nfrom the sky.&quot;&lt;BR&gt;&lt;BR&gt;Spooky, \nperhaps, but Bernal notes there are other in=\r\nscriptions at Mayan sites for dates \nfar beyond 2012 =97 including one that=\r\n roughly translates into the year \n4772.&lt;BR&gt;&lt;BR&gt;And anyway, Mayas in the dr=\r\nought-stricken Yucatan peninsula have \nbigger worries than 2012.&lt;BR&gt;&lt;BR&gt;&quot;If=\r\n I went to some Mayan-speaking communities \nand asked people what is going =\r\nto happen in 2012, they wouldn&#39;t have any idea,&quot; \nsaid Jose Huchim, a Yucat=\r\nan Mayan archaeologist. &quot;That the world is going to \nend? They wouldn&#39;t bel=\r\nieve you. We have real concerns these days, like \nrain.&quot;&lt;BR&gt;&lt;BR&gt;The Mayan c=\r\nivilization, which reached its height from 300 A.D. to \n900 A.D., had a tal=\r\nent for astronomy&lt;BR&gt;&lt;BR&gt;Its Long Count calendar begins in \n3,114 B.C., mar=\r\nking time in roughly 394-year periods known as Baktuns. Thirteen \nwas a sig=\r\nnificant, sacred number for the Mayas, and the 13th Baktun ends around \nDec=\r\n. 21, 2012.&lt;BR&gt;&lt;BR&gt;&quot;It&#39;s a special anniversary of creation,&quot; said David \nSt=\r\nuart, a specialist in Mayan epigraphy at the University of Texas at Austin.=\r\n \n&quot;The Maya never said the world is going to end, they never said anything =\r\nbad \nwould happen necessarily, they&#39;re just recording this future anniversa=\r\nry on \nMonument Six.&quot;&lt;BR&gt;&lt;BR&gt;Bernal suggests that apocalypse is &quot;a very Wes=\r\ntern, \nChristian&quot; concept projected onto the Maya, perhaps because Western =\r\nmyths are \n&quot;exhausted.&quot;&lt;BR&gt;&lt;BR&gt;If it were all mythology, perhaps it could b=\r\ne written \noff.&lt;BR&gt;&lt;BR&gt;But some say the Maya knew another secret: the Earth=\r\n&#39;s axis wobbles, \nslightly changing the alignment of the stars every year. =\r\nOnce every 25,800 \nyears, the sun lines up with the center of our Milky Way=\r\n galaxy on a winter \nsolstice, the sun&#39;s lowest point in the horizon.&lt;BR&gt;&lt;B=\r\nR&gt;That will happen on Dec. \n21, 2012, when the sun appears to rise in the s=\r\name spot where the bright center \nof galaxy sets.&lt;BR&gt;&lt;BR&gt;Another spooky coi=\r\nncidence?&lt;BR&gt;&lt;BR&gt;&quot;The question I would \nask these guys is, so what?&quot; says P=\r\nhil Plait, an astronomer who runs the &quot;Bad \nAstronomy&quot; blog. He says the al=\r\nignment doesn&#39;t fall precisely in 2012, and \ndistant stars exert no force t=\r\nhat could harm Earth.&lt;BR&gt;&lt;BR&gt;&quot;They&#39;re really \nsuper-duper trying to find an=\r\nything astronomical they can to fit that date of \n2012,&quot; Plait said.&lt;BR&gt;&lt;BR=\r\n&gt;But author John Major Jenkins says his two-decade \nstudy of Mayan ruins in=\r\ndicate the Maya were aware of the alignment and attached \ngreat importance =\r\nto it.&lt;BR&gt;&lt;BR&gt;&quot;If we want to honor and respect how the Maya \nthink about th=\r\nis, then we would say that the Maya viewed 2012, as all cycle \nendings, as =\r\na time of transformation and renewal,&quot; said Jenkins.&lt;BR&gt;&lt;BR&gt;As the \nInterne=\r\nt gained popularity in the 1990s, so did word of the &quot;fateful&quot; date, and \ns=\r\nome began worrying about 2012 disasters the Mayas never dreamed \nof.&lt;BR&gt;&lt;BR=\r\n&gt;Author Lawrence Joseph says a peak in explosive storms on the surface \nof =\r\nthe sun could knock out North America&#39;s power grid for years, triggering fo=\r\nod \nshortages, water scarcity =97 a collapse of civilization. Solar peaks o=\r\nccur about \nevery 11 years, but Joseph says there&#39;s evidence the 2012 peak =\r\ncould be &quot;a \nlulu.&quot;&lt;BR&gt;&lt;BR&gt;While pressing governments to install protection=\r\n for power grids, \nJoseph counsels readers not to &quot;use 2012 as an excuse to=\r\n not live in a healthy, \nresponsible fashion. I mean, don&#39;t let the credit =\r\ncards go up.&quot;&lt;BR&gt;&lt;BR&gt;Another \nHistory Channel program titled &quot;Decoding the =\r\nPast: Doomsday 2012: End of Days&quot; \nsays a galactic alignment or magnetic di=\r\nsturbances could somehow trigger a &quot;pole \nshift.&quot;&lt;BR&gt;&lt;BR&gt;&quot;The entire mantle=\r\n of the earth would shift in a matter of days, \nperhaps hours, changing the=\r\n position of the north and south poles, causing \nworldwide disaster,&quot; a nar=\r\nrator proclaims. &quot;Earthquakes would rock every \ncontinent, massive tsunamis=\r\n would inundate coastal cities. It would be the \nultimate planetary catastr=\r\nophe.&quot;&lt;BR&gt;&lt;BR&gt;The idea apparently originates with a \n19th century Frenchman=\r\n, Charles Etienne Brasseur de Bourbourg, a \npriest-turned-&lt;WBR&gt;archaeologis=\r\nt who got it from his study of ancient Mayan and \nAztec texts.&lt;BR&gt;&lt;BR&gt;Scien=\r\ntists say that, at best, the poles might change \nlocation by one degree ove=\r\nr a million years, with no sign that it would start in \n2012.&lt;BR&gt;&lt;BR&gt;While =\r\nlong discredited, Brasseur de Bourbourg proves one thing: \nWesterners have =\r\nbeen trying for more than a century to pin doomsday scenarios on \nthe Maya.=\r\n And while fascinated by ancient lore, advocates seldom examine more \nrecen=\r\nt experiences with apocalypse predictions.&lt;BR&gt;&lt;BR&gt;&quot;No one who&#39;s writing in =\r\n\nnow seems to remember that the last time we thought the world was going to=\r\n end, \nit didn&#39;t,&quot; says Martin, the astronomy webmaster. &quot;There doesn&#39;t see=\r\nm to be a \nlot of memory that things were fine the last time \naround.&quot;&lt;/P&gt;&lt;=\r\n/FONT&gt;&lt;/DIV&gt;&lt;/BODY&gt;&lt;/HTML&gt;\n\r\n------=_NextPart_000_006F_01CA4A56.AC34E130--"}