{"id": "16198", "subject": "Re: [EVP-ITC] Re: Question for you all", "author": "SnowfireL@aol.com", "timestamp": "2009-10-14T13:32:31Z", "full_text": "----------MB_8CC1AE9EA9AC639_1B20_4708_webmail-d051.sysops.aol.com\r\nContent-Transfer-Encoding: quoted-printable\r\nContent-Type: text/plain; charset=&quot;us-ascii&quot;\r\n\r\n Do not anyone to have you loose faith, they are very real, and very much a=\r\nlive!? In the Bible, it says, to &quot;test the spirits, to see if they be of Go=\r\nd&quot;? so right there Scripture talks about spirits,? I could go into it with =\r\nhundreds of references, you can see for yourself we are all here because of=\r\n &quot;the prime mover&quot; God, who is spirit..? Test them if you have doubt, I kno=\r\nw they are who they say they are, I would bet my life on it too.sf\n\n\n\n \n\n\n\n=\r\n\n\n\n-----Original Message-----\n\nFrom: mrscaptainjack2 &lt;jjkamp@...=\r\n&gt;\n\nTo: EVP-ITC@yahoogroups.com\n\nSent: Wed, Oct 14, 2009 4:24 am\n\nSubject=\r\n: [EVP-ITC] Re: Question for you all\n\n\n\n  \n                ?    \n  \n       =\r\n \n                    \nI don&#39;t know for sure it was my dad&#39;s friend.  But I=\r\n find it hard to believe that entities on the other side who are not dead p=\r\neople would go to so much trouble to impersonate my dead friends and relati=\r\nves -- why bother?  If they truly seek attention, why not come up with some=\r\nthing more attention-getting than my dad&#39;s friend?  Why not impersonate my =\r\nbrother, who is really the one I&#39;m trying to reach?  And anyways, there are=\r\n hundreds and hundreds of stories of people believing they have seen or hea=\r\nrd or spoken to the ghost of their dead family members (my mother being one=\r\n of them).  They can&#39;t all be wishful thinking.\n\n  \n\n  I find it much easie=\r\nr to believe that I&#39;m somehow unconsciously making this happen (via the pro=\r\ncess Phenom Investigator describes) using the box.  But since it&#39;s equally =\r\npossible for me or a discarnate dead person to influence the box (via me an=\r\nd PK) (because, after all, we are no different from the dead people except =\r\nwe still have our bodies), I will probably never know if it&#39;s me or them ma=\r\nking it happen.  \n\n  \n\n  I do know that I hear things on the tape that are =\r\nrepeated over and over and over again, in some cases twelve times in a row,=\r\n which tends to rule out pareidolia.  I also have very clear sentences whic=\r\nh anyone -- ANYONE -- without prompting could understand and hear (I&#39;ve tes=\r\nted this with friends and family, letting them listen and asking what they =\r\nhear).  And, like I&#39;ve said, the names I&#39;ve gotten have mostly been of obsc=\r\nure dead friends and relatives, not the ones I&#39;m trying so desperately to c=\r\nontact.\n\n  \n\n  So I&#39;m leaning toward the dead people theory for now.\n\n  \n\n =\r\n --- In EVP-ITC@yahoogroups.com, &quot;April Abercrombie&quot; &lt;april@...&gt; wrot=\r\ne:\n\n  &gt;\n\n  &gt; Maybe you&#39;re not, but most EVP&#39;s you hear are just matri=\r\nxng, which is why mostly no one hears what the person recorded it thinks th=\r\nat they hear.\n\n  &gt; \n\n  &gt; But your proof here is subjective. How do yo=\r\nu  know for sure that it is your dad&#39;s friend?\n\n  &gt; \n\n  &gt; I&#39;m not try=\r\ning to be argumentative-you may be right.\n\n  &gt; \n\n  &gt; \n\n  &gt;   -----=\r\n Original Message ----- \n\n  &gt;   From: mrscaptainjack2 \n\n  &gt;   To: EVP=\r\n-ITC@yahoogroups.com \n\n  &gt;   Sent: Sunday, October 11, 2009 10:08 PM\n\n  =\r\n&gt;   Subject: [EVP-ITC] Re: Question for you all\n\n  &gt; \n\n  &gt; \n\n  &gt=\r\n;     Well, I would disagree with the idea I&#39;m hearing what I want to hear.=\r\n The first time I got my dad&#39;s friend Gordy, I didn&#39;t even hear his name; I=\r\n thought he was saying &quot;Forty, forty, forty.&quot; It was only in a later sessio=\r\nn that he identified himself again using his full proper name. Then I reali=\r\nzed that he is now dead (last I saw him he was very much alive), and that h=\r\ne&#39;d been saying Gordy all along (confirmed by playing back the old tape). I=\r\n certainly didn&#39;t expect to hear him come through, and yet he did, so I can=\r\n&#39;t see how I could&#39;ve expected to hear his name.\n\n  &gt; \n\n  &gt;   Jill\n\n =\r\n &gt; \n\n  &gt;   --- In EVP-ITC@yahoogroups.com, &quot;phenom_investigator&quot; &lt;=\r\nphenom_investigator@&gt; wrote:\n\n  &gt;   &gt;\n\n  &gt;   &gt; Why do you di=\r\nsagree that PK is responsible for most true EVPs? \n\n  &gt;   &gt; What abou=\r\nt EVPs and/or PK tells you this might be so?\n\n  &gt;   &gt; \n\n  &gt;   &gt;=\r\n \n\n  &gt;   &gt; \n\n  &gt;   &gt; --- In EVP-ITC@yahoogroups.com, &quot;April Abe=\r\nrcrombie&quot; &lt;april@&gt; wrote:\n\n  &gt;   &gt; &gt;\n\n  &gt;   &gt; &gt; I a=\r\ngree in that much of EVP is just pareidolia, or the listener hearing what h=\r\ne wants to hear. But I disagree in that PK is responsible for most true EVP=\r\ns.\n\n  &gt;   &gt; &gt; \n\n  &gt;   &gt; &gt; ----- Original Message ----- \n\n=\r\n  &gt;   &gt; &gt; From: phenom_investigator \n\n  &gt;   &gt; &gt; To: EVP-I=\r\nTC@yahoogroups.com \n\n  &gt;   &gt; &gt; Sent: Saturday, October 10, 2009 7:=\r\n09 AM\n\n  &gt;   &gt; &gt; Subject: [EVP-ITC] Re: Question for you all\n\n  &g=\r\nt;   &gt; &gt; \n\n  &gt;   &gt; &gt; \n\n  &gt;   &gt; &gt; If we presume that=\r\n much of what is heard is in fact the result of personal PK and not a disca=\r\nrnate voice, we may have an answer to the question of why some sourcse comm=\r\nunicate and others do not.\n\n  &gt;   &gt; &gt; \n\n  &gt;   &gt; &gt; I would=\r\n suggest that while the operator may produce the voice phenomena, that oper=\r\nator may indeed be influenced by external agents. This could include discar=\r\nnate agents. \n\n  &gt;   &gt; &gt; \n\n  &gt;   &gt; &gt; When you carefully c=\r\nonsider what is being heard, the themes often seem to reflect what may be s=\r\nubconscious concerns of the operator or the listener. If external sources a=\r\ndditionally inform this process of perception, it is quite possible they in=\r\nfluence both what is recorded and how is later perceived. This would also n=\r\nicely explain why some people hear the same things on a recording while oth=\r\ners hear quite different things and more importantly while one person hears=\r\n different things from the same recording at different times.\n\n  &gt;   &gt=\r\n; &gt; \n\n  &gt;   &gt; &gt; It would also remove the requirement that disca=\r\nrnates manifest the phenomena. If discarnates are indeed non-physical, it i=\r\ns unclear how they would modify the physical world. On the other hand, we h=\r\nave good evidence demonstrating the ability of living individuals to alter =\r\ntheir environments in profound ways, apparently with their minds. So it see=\r\nms to make more sense that this might indeed by the underlying mechanism to=\r\n EVPs rather than discarnate manipulations.\n\n  &gt;   &gt; &gt; \n\n  &gt;   =\r\n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;mrscaptainjack2&quot; &lt;jjkamp@&gt;=\r\n wrote:\n\n  &gt;   &gt; &gt; &gt;I&#39;m wondering if a haunting-type situation =\r\nsuch as yours would be different from talking to your ancestors four or fiv=\r\ne generations back? I guess I&#39;m just wondering out loud what makes us conne=\r\nct with some entities, no matter how obscure or nonexistent the connection,=\r\n and not others? What makes some &quot;tune in&quot; to talk to us, or hang around on=\r\n a plane closest to us...or what? At least in a haunting, you&#39;d be getting =\r\nthe entity that happened to reside at that location.\n\n  &gt;   &gt; &gt; &g=\r\nt; \n\n  &gt;   &gt; &gt; &gt; Never mind me, guys. I just have this driving =\r\nneed to understand how all this works, and I don&#39;t think it&#39;s possible.\n\n  =\r\n&gt;   &gt; &gt; &gt; \n\n  &gt;   &gt; &gt; &gt; Jill\n\n  &gt;   &gt; &gt; &g=\r\nt; \n\n  &gt;   &gt; &gt; &gt; \n\n  &gt;   &gt; &gt; &gt; \n\n  &gt;   &gt; &gt;=\r\n &gt; --- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; &lt;purplealiengi=\r\nrl@&gt; wrote:\n\n  &gt;   &gt; &gt; &gt; &gt;\n\n  &gt;   &gt; &gt; &gt; &gt; =\r\n\n\n  &gt;   &gt; &gt; &gt; &gt; Capericus. Nicolaus Copernicus (1473-1543) \n=\r\n\n  &gt;   &gt; &gt; &gt; &gt; \n\n  &gt;   &gt; &gt; &gt; &gt; \n\n  &gt;   &gt=\r\n; &gt; &gt; &gt; F-S\n\n  &gt;   &gt; &gt; &gt; &gt; \n\n  &gt;   &gt; &gt; &gt=\r\n; &gt; \n\n  &gt;   &gt; &gt; &gt; &gt; \n\n  &gt;   &gt; &gt; &gt; &gt; \n\n  &g=\r\nt;   &gt; &gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;mrscaptainjack2&quot; =\r\n&lt;jjkamp@&gt; wrote:\n\n  &gt;   &gt; &gt; &gt; &gt; &gt;\n\n  &gt;   &gt; &g=\r\nt; &gt; &gt; &gt; Those of you who have contacted entities claiming to be d=\r\nead people, what is the oldest person you&#39;ve spoken to (in terms of how lon=\r\ng ago they died)?\n\n  &gt;   &gt; &gt; &gt; &gt; &gt; \n\n  &gt;   &gt; &gt; &=\r\ngt; &gt; &gt; I&#39;m wondering because my great uncle has been coming through =\r\na lot, and he was murdered in 1942. Since I wasn&#39;t born until decades later=\r\n, I never knew him, but I do understand that people come through we did not=\r\n know in life. Has anyone else contacted someone claiming to have lived tha=\r\nt far back? Or in another lifetime entirely?\n\n  &gt;   &gt; &gt; &gt; &gt; =\r\n&gt;\n\n  &gt;   &gt; &gt; &gt; &gt;\n\n  &gt;   &gt; &gt; &gt;\n\n  &gt;   &gt; =\r\n&gt;\n\n  &gt;   &gt;\n\n  &gt;\n\n  \n\n  \n           \n                \n\n         =\r\n                       \n   \n\n\r\n----------MB_8CC1AE9EA9AC639_1B20_4708_webmail-d051.sysops.aol.com\r\nContent-Transfer-Encoding: quoted-printable\r\nContent-Type: text/html; charset=&quot;us-ascii&quot;\r\n\r\n\n&lt;div style=3D&quot;font-family: arial; color: black; font-size: 10pt;&quot;&gt; Do not =\r\nanyone to have you loose faith, they are very real, and very much alive!&nb=\r\nsp; In the Bible, it says, to &quot;test the spirits, to see if they be of God&quot;&=\r\nnbsp; so right there Scripture talks about spirits,&nbsp; I could go into i=\r\nt with hundreds of references, you can see for yourself we are all here bec=\r\nause of &quot;the &lt;b&gt;prime mover&lt;/b&gt;&quot; God, who is spirit..&nbsp; Test them if yo=\r\nu have doubt, I know they are who they say they are, I would bet my life on=\r\n it too.sf&lt;br&gt;\n&lt;/div&gt;\n\n&lt;div&gt; &lt;br&gt;\n&lt;/div&gt;\n\n&lt;div&gt;&lt;br&gt;\n&lt;/div&gt;\n-----Original Me=\r\nssage-----&lt;br&gt;\nFrom: mrscaptainjack2 &lt;jjkamp@...&gt;&lt;br&gt;\nTo: EVP=\r\n-ITC@yahoogroups.com&lt;br&gt;\nSent: Wed, Oct 14, 2009 4:24 am&lt;br&gt;\nSubject: [EVP-=\r\nITC] Re: Question for you all&lt;br&gt;\n&lt;br&gt;\n  \n&lt;div id=3D&quot;AOLMsgPart_2_e5764b11-=\r\n9bd7-4dc1-94c0-483b242e0034&quot;&gt;                &lt;span style=3D&quot;display: none;&quot;=\r\n&gt;&nbsp;&lt;/span&gt;    \n&lt;div id=3D&quot;ygrp-mlmsg&quot; style=3D&quot;width: 655px; position: =\r\nrelative;&quot;&gt;  \n&lt;div id=3D&quot;ygrp-msg&quot; style=3D&quot;margin: 0pt; padding: 0pt 25px =\r\n0pt 0pt; width: 470px; float: left; z-index: 1;&quot;&gt;        \n&lt;div id=3D&quot;ygrp-t=\r\next&quot;&gt;                    \n&lt;div&gt;I don&#39;t know for sure it was my dad&#39;s friend=\r\n.  But I find it hard to believe that entities on the other side who are no=\r\nt dead people would go to so much trouble to impersonate my dead friends an=\r\nd relatives -- why bother?  If they truly seek attention, why not come up w=\r\nith something more attention-getting than my dad&#39;s friend?  Why not imperso=\r\nnate my brother, who is really the one I&#39;m trying to reach?  And anyways, t=\r\nhere are hundreds and hundreds of stories of people believing they have see=\r\nn or heard or spoken to the ghost of their dead family members (my mother b=\r\neing one of them).  They can&#39;t all be wishful thinking.&lt;br&gt;\n  &lt;br&gt;\n  I find=\r\n it much easier to believe that I&#39;m somehow unconsciously making this happe=\r\nn (via the process Phenom Investigator describes) using the box.  But since=\r\n it&#39;s equally possible for me or a discarnate dead person to influence the =\r\nbox (via me and PK) (because, after all, we are no different from the dead =\r\npeople except we still have our bodies), I will probably never know if it&#39;s=\r\n me or them making it happen.  &lt;br&gt;\n  &lt;br&gt;\n  I do know that I hear things o=\r\nn the tape that are repeated over and over and over again, in some cases tw=\r\nelve times in a row, which tends to rule out pareidolia.  I also have very =\r\nclear sentences which anyone -- ANYONE -- without prompting could understan=\r\nd and hear (I&#39;ve tested this with friends and family, letting them listen a=\r\nnd asking what they hear).  And, like I&#39;ve said, the names I&#39;ve gotten have=\r\n mostly been of obscure dead friends and relatives, not the ones I&#39;m trying=\r\n so desperately to contact.&lt;br&gt;\n  &lt;br&gt;\n  So I&#39;m leaning toward the dead peo=\r\nple theory for now.&lt;br&gt;\n  &lt;br&gt;\n  --- In &lt;a href=3D&quot;mailto:EVP-ITC%40yahoogr=\r\noups.com&quot;&gt;EVP-ITC@yahoogroups&lt;wbr&gt;.com&lt;/a&gt;, &quot;April Abercrombie&quot; &lt;april@.=\r\n..&gt; wrote:&lt;br&gt;\n  &gt;&lt;br&gt;\n  &gt; Maybe you&#39;re not, but most EVP&#39;s you he=\r\nar are just matrixng, which is why mostly no one hears what the person reco=\r\nrded it thinks that they hear.&lt;br&gt;\n  &gt; &lt;br&gt;\n  &gt; But your proof here i=\r\ns subjective. How do you  know for sure that it is your dad&#39;s friend?&lt;br&gt;\n =\r\n &gt; &lt;br&gt;\n  &gt; I&#39;m not trying to be argumentative-&lt;wbr&gt;you may be right.=\r\n&lt;br&gt;\n  &gt; &lt;br&gt;\n  &gt; &lt;br&gt;\n  &gt;   ----- Original Message ----- &lt;br&gt;\n  &=\r\ngt;   From: mrscaptainjack2 &lt;br&gt;\n  &gt;   To: &lt;a href=3D&quot;mailto:EVP-ITC%40y=\r\nahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;wbr&gt;.com&lt;/a&gt; &lt;br&gt;\n  &gt;   Sent: Sunday=\r\n, October 11, 2009 10:08 PM&lt;br&gt;\n  &gt;   Subject: [EVP-ITC] Re: Question fo=\r\nr you all&lt;br&gt;\n  &gt; &lt;br&gt;\n  &gt; &lt;br&gt;\n  &gt;     Well, I would disagree wit=\r\nh the idea I&#39;m hearing what I want to hear. The first time I got my dad&#39;s f=\r\nriend Gordy, I didn&#39;t even hear his name; I thought he was saying &quot;Forty, f=\r\norty, forty.&quot; It was only in a later session that he identified himself aga=\r\nin using his full proper name. Then I realized that he is now dead (last I =\r\nsaw him he was very much alive), and that he&#39;d been saying Gordy all along =\r\n(confirmed by playing back the old tape). I certainly didn&#39;t expect to hear=\r\n him come through, and yet he did, so I can&#39;t see how I could&#39;ve expected t=\r\no hear his name.&lt;br&gt;\n  &gt; &lt;br&gt;\n  &gt;   Jill&lt;br&gt;\n  &gt; &lt;br&gt;\n  &gt;   ---=\r\n In &lt;a href=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;wbr&gt;.c=\r\nom&lt;/a&gt;, &quot;phenom_investigato&lt;wbr&gt;r&quot; &lt;phenom_investigato&lt;wbr&gt;r@&gt; wrote:=\r\n&lt;br&gt;\n  &gt;   &gt;&lt;br&gt;\n  &gt;   &gt; Why do you disagree that PK is respons=\r\nible for most true EVPs? &lt;br&gt;\n  &gt;   &gt; What about EVPs and/or PK tells=\r\n you this might be so?&lt;br&gt;\n  &gt;   &gt; &lt;br&gt;\n  &gt;   &gt; &lt;br&gt;\n  &gt;   &=\r\ngt; &lt;br&gt;\n  &gt;   &gt; --- In &lt;a href=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;=\r\nEVP-ITC@yahoogroups&lt;wbr&gt;.com&lt;/a&gt;, &quot;April Abercrombie&quot; &lt;april@&gt; wrote:=\r\n&lt;br&gt;\n  &gt;   &gt; &gt;&lt;br&gt;\n  &gt;   &gt; &gt; I agree in that much of EVP =\r\nis just pareidolia, or the listener hearing what he wants to hear. But I di=\r\nsagree in that PK is responsible for most true EVPs.&lt;br&gt;\n  &gt;   &gt; &gt;=\r\n &lt;br&gt;\n  &gt;   &gt; &gt; ----- Original Message ----- &lt;br&gt;\n  &gt;   &gt; &g=\r\nt; From: phenom_investigator &lt;br&gt;\n  &gt;   &gt; &gt; To: &lt;a href=3D&quot;mailto:=\r\nEVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;wbr&gt;.com&lt;/a&gt; &lt;br&gt;\n  &gt;   &=\r\ngt; &gt; Sent: Saturday, October 10, 2009 7:09 AM&lt;br&gt;\n  &gt;   &gt; &gt; Su=\r\nbject: [EVP-ITC] Re: Question for you all&lt;br&gt;\n  &gt;   &gt; &gt; &lt;br&gt;\n  &gt=\r\n;   &gt; &gt; &lt;br&gt;\n  &gt;   &gt; &gt; If we presume that much of what is he=\r\nard is in fact the result of personal PK and not a discarnate voice, we may=\r\n have an answer to the question of why some sourcse communicate and others =\r\ndo not.&lt;br&gt;\n  &gt;   &gt; &gt; &lt;br&gt;\n  &gt;   &gt; &gt; I would suggest that=\r\n while the operator may produce the voice phenomena, that operator may inde=\r\ned be influenced by external agents. This could include discarnate agents. =\r\n&lt;br&gt;\n  &gt;   &gt; &gt; &lt;br&gt;\n  &gt;   &gt; &gt; When you carefully consider=\r\n what is being heard, the themes often seem to reflect what may be subconsc=\r\nious concerns of the operator or the listener. If external sources addition=\r\nally inform this process of perception, it is quite possible they influence=\r\n both what is recorded and how is later perceived. This would also nicely e=\r\nxplain why some people hear the same things on a recording while others hea=\r\nr quite different things and more importantly while one person hears differ=\r\nent things from the same recording at different times.&lt;br&gt;\n  &gt;   &gt; &g=\r\nt; &lt;br&gt;\n  &gt;   &gt; &gt; It would also remove the requirement that discar=\r\nnates manifest the phenomena. If discarnates are indeed non-physical, it is=\r\n unclear how they would modify the physical world. On the other hand, we ha=\r\nve good evidence demonstrating the ability of living individuals to alter t=\r\nheir environments in profound ways, apparently with their minds. So it seem=\r\ns to make more sense that this might indeed by the underlying mechanism to =\r\nEVPs rather than discarnate manipulations.&lt;br&gt;\n  &gt;   &gt; &gt; &lt;br&gt;\n  &g=\r\nt;   &gt; &gt; --- In &lt;a href=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@=\r\nyahoogroups&lt;wbr&gt;.com&lt;/a&gt;, &quot;mrscaptainjack2&quot; &lt;jjkamp@&gt; wrote:&lt;br&gt;\n  &g=\r\nt;   &gt; &gt; &gt;I&#39;m wondering if a haunting-type situation such as yours=\r\n would be different from talking to your ancestors four or five generations=\r\n back? I guess I&#39;m just wondering out loud what makes us connect with some =\r\nentities, no matter how obscure or nonexistent the connection, and not othe=\r\nrs? What makes some &quot;tune in&quot; to talk to us, or hang around on a plane clos=\r\nest to us...or what? At least in a haunting, you&#39;d be getting the entity th=\r\nat happened to reside at that location.&lt;br&gt;\n  &gt;   &gt; &gt; &gt; &lt;br&gt;\n  =\r\n&gt;   &gt; &gt; &gt; Never mind me, guys. I just have this driving need to=\r\n understand how all this works, and I don&#39;t think it&#39;s possible.&lt;br&gt;\n  &gt;=\r\n   &gt; &gt; &gt; &lt;br&gt;\n  &gt;   &gt; &gt; &gt; Jill&lt;br&gt;\n  &gt;   &gt; &gt; =\r\n&gt; &lt;br&gt;\n  &gt;   &gt; &gt; &gt; &lt;br&gt;\n  &gt;   &gt; &gt; &gt; &lt;br&gt;\n  &gt; =\r\n  &gt; &gt; &gt; --- In &lt;a href=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-IT=\r\nC@yahoogroups&lt;wbr&gt;.com&lt;/a&gt;, &quot;purplespacefriend&quot; &lt;purplealiengirl@&lt;wbr&gt;&g=\r\nt; wrote:&lt;br&gt;\n  &gt;   &gt; &gt; &gt; &gt;&lt;br&gt;\n  &gt;   &gt; &gt; &gt; &gt;=\r\n &lt;br&gt;\n  &gt;   &gt; &gt; &gt; &gt; Capericus. Nicolaus Copernicus (1473-154=\r\n3) &lt;br&gt;\n  &gt;   &gt; &gt; &gt; &gt; &lt;br&gt;\n  &gt;   &gt; &gt; &gt; &gt; &lt;br&gt;=\r\n\n  &gt;   &gt; &gt; &gt; &gt; F-S&lt;br&gt;\n  &gt;   &gt; &gt; &gt; &gt; &lt;br&gt;\n  &=\r\ngt;   &gt; &gt; &gt; &gt; &lt;br&gt;\n  &gt;   &gt; &gt; &gt; &gt; &lt;br&gt;\n  &gt;   &=\r\ngt; &gt; &gt; &gt; &lt;br&gt;\n  &gt;   &gt; &gt; &gt; &gt; --- In &lt;a href=3D&quot;mail=\r\nto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;wbr&gt;.com&lt;/a&gt;, &quot;mrscaptain=\r\njack2&quot; &lt;jjkamp@&gt; wrote:&lt;br&gt;\n  &gt;   &gt; &gt; &gt; &gt; &gt;&lt;br&gt;\n  &=\r\ngt;   &gt; &gt; &gt; &gt; &gt; Those of you who have contacted entities cla=\r\niming to be dead people, what is the oldest person you&#39;ve spoken to (in ter=\r\nms of how long ago they died)?&lt;br&gt;\n  &gt;   &gt; &gt; &gt; &gt; &gt; &lt;br&gt;\n =\r\n &gt;   &gt; &gt; &gt; &gt; &gt; I&#39;m wondering because my great uncle has b=\r\neen coming through a lot, and he was murdered in 1942. Since I wasn&#39;t born =\r\nuntil decades later, I never knew him, but I do understand that people come=\r\n through we did not know in life. Has anyone else contacted someone claimin=\r\ng to have lived that far back? Or in another lifetime entirely?&lt;br&gt;\n  &gt; =\r\n  &gt; &gt; &gt; &gt; &gt;&lt;br&gt;\n  &gt;   &gt; &gt; &gt; &gt;&lt;br&gt;\n  &gt;   &g=\r\nt; &gt; &gt;&lt;br&gt;\n  &gt;   &gt; &gt;&lt;br&gt;\n  &gt;   &gt;&lt;br&gt;\n  &gt;&lt;br&gt;\n  &lt;br&gt;=\r\n\n  &lt;/div&gt;\n           &lt;/div&gt;\n                \n&lt;div width=3D&quot;1&quot; style=3D&quot;colo=\r\nr: white; clear: both;&quot;&gt;&lt;/div&gt;\n              &lt;style type=3D&quot;text/css&quot;&gt;#AOLM=\r\nsgPart_2_e5764b11-9bd7-4dc1-94c0-483b242e0034 #ygrp-mkp{  border: 1px solid=\r\n #d8d8d8;  font-family: Arial;  margin: 14px 0px;  padding: 0px 14px;}#AOLM=\r\nsgPart_2_e5764b11-9bd7-4dc1-94c0-483b242e0034 #ygrp-mkp hr{  border: 1px so=\r\nlid #d8d8d8;}#AOLMsgPart_2_e5764b11-9bd7-4dc1-94c0-483b242e0034 #ygrp-mkp #=\r\nhd{  color: #628c2a;  font-size: 85%;  font-weight: bold;  line-height: 122=\r\n%;  margin: 10px 0px;}#AOLMsgPart_2_e5764b11-9bd7-4dc1-94c0-483b242e0034 #y=\r\ngrp-mkp #ads{  margin-bottom: 10px;}#AOLMsgPart_2_e5764b11-9bd7-4dc1-94c0-4=\r\n83b242e0034 #ygrp-mkp .ad{  padding: 0 0;}#AOLMsgPart_2_e5764b11-9bd7-4dc1-=\r\n94c0-483b242e0034 #ygrp-mkp .ad a{  color: #0000ff;  text-decoration: none;=\r\n}&lt;/style&gt;    &lt;style type=3D&quot;text/css&quot;&gt;#AOLMsgPart_2_e5764b11-9bd7-4dc1-94c0=\r\n-483b242e0034 #ygrp-sponsor #ygrp-lc{  font-family: Arial;}#AOLMsgPart_2_e5=\r\n764b11-9bd7-4dc1-94c0-483b242e0034 #ygrp-sponsor #ygrp-lc #hd{  margin: 10p=\r\nx 0px;  font-weight: bold;  font-size: 78%;  line-height: 122%;}#AOLMsgPart=\r\n_2_e5764b11-9bd7-4dc1-94c0-483b242e0034 #ygrp-sponsor #ygrp-lc .ad{  margin=\r\n-bottom: 10px;  padding: 0 0;}&lt;/style&gt;        &lt;style type=3D&quot;text/css&quot;&gt;    =\r\n #AOLMsgPart_2_e5764b11-9bd7-4dc1-94c0-483b242e0034 #ygrp-mlmsg {font-size:=\r\n13px; font-family: arial,helvetica,clean,sans-serif;*font-size:small;*font:=\r\nx-small;} #AOLMsgPart_2_e5764b11-9bd7-4dc1-94c0-483b242e0034 #ygrp-mlmsg ta=\r\nble {font-size:inherit;font:100%;} #AOLMsgPart_2_e5764b11-9bd7-4dc1-94c0-48=\r\n3b242e0034 #ygrp-mlmsg select,#AOLMsgPart_2_e5764b11-9bd7-4dc1-94c0-483b242=\r\ne0034  input,#AOLMsgPart_2_e5764b11-9bd7-4dc1-94c0-483b242e0034  textarea {=\r\nfont:99% arial,helvetica,clean,sans-serif;} #AOLMsgPart_2_e5764b11-9bd7-4dc=\r\n1-94c0-483b242e0034 #ygrp-mlmsg pre,#AOLMsgPart_2_e5764b11-9bd7-4dc1-94c0-4=\r\n83b242e0034  code {font:115% monospace;*font-size:100%;} #AOLMsgPart_2_e576=\r\n4b11-9bd7-4dc1-94c0-483b242e0034 #ygrp-mlmsg * {line-height:1.22em;} #AOLMs=\r\ngPart_2_e5764b11-9bd7-4dc1-94c0-483b242e0034 #ygrp-text{     font-family: G=\r\neorgia;  } #AOLMsgPart_2_e5764b11-9bd7-4dc1-94c0-483b242e0034 #ygrp-text p{=\r\n     margin: 0 0 1em 0; } #AOLMsgPart_2_e5764b11-9bd7-4dc1-94c0-483b242e003=\r\n4 dd.last p a {          font-family: Verdana;          font-weight: bold; =\r\n} #AOLMsgPart_2_e5764b11-9bd7-4dc1-94c0-483b242e0034 #ygrp-vitnav{  padding=\r\n-top: 10px;  font-family: Verdana;  font-size: 77%;  margin: 0; } #AOLMsgPa=\r\nrt_2_e5764b11-9bd7-4dc1-94c0-483b242e0034 #ygrp-vitnav a{  padding: 0 1px; =\r\n} #AOLMsgPart_2_e5764b11-9bd7-4dc1-94c0-483b242e0034 #ygrp-mlmsg #logo{   p=\r\nadding-bottom: 10px; } #AOLMsgPart_2_e5764b11-9bd7-4dc1-94c0-483b242e0034 #=\r\nygrp-reco { margin-bottom: 20px; padding: 0px; } #AOLMsgPart_2_e5764b11-9bd=\r\n7-4dc1-94c0-483b242e0034 #ygrp-reco #reco-head {  font-weight: bold;  color=\r\n: #ff7900; } #AOLMsgPart_2_e5764b11-9bd7-4dc1-94c0-483b242e0034 #reco-categ=\r\nory{         font-size: 77%; } #AOLMsgPart_2_e5764b11-9bd7-4dc1-94c0-483b24=\r\n2e0034 #reco-desc{         font-size: 77%; } #AOLMsgPart_2_e5764b11-9bd7-4d=\r\nc1-94c0-483b242e0034 #ygrp-vital a{  text-decoration: none; } #AOLMsgPart_2=\r\n_e5764b11-9bd7-4dc1-94c0-483b242e0034 #ygrp-vital a:hover{   text-decoratio=\r\nn: underline; } #AOLMsgPart_2_e5764b11-9bd7-4dc1-94c0-483b242e0034 #ygrp-sp=\r\nonsor #ov ul{  padding: 0 0 0 8px;  margin: 0; } #AOLMsgPart_2_e5764b11-9bd=\r\n7-4dc1-94c0-483b242e0034 #ygrp-sponsor #ov li{  list-style-type: square;  p=\r\nadding: 6px 0;  font-size: 77%; } #AOLMsgPart_2_e5764b11-9bd7-4dc1-94c0-483=\r\nb242e0034 #ygrp-sponsor #ov li a{  text-decoration: none;  font-size: 130%;=\r\n } #AOLMsgPart_2_e5764b11-9bd7-4dc1-94c0-483b242e0034 #ygrp-sponsor #nc{   =\r\nbackground-color: #eee;   margin-bottom: 20px;   padding: 0 8px; } #AOLMsgP=\r\nart_2_e5764b11-9bd7-4dc1-94c0-483b242e0034 #ygrp-sponsor .ad{  padding: 8px=\r\n 0; } #AOLMsgPart_2_e5764b11-9bd7-4dc1-94c0-483b242e0034 #ygrp-sponsor .ad =\r\n#hd1{  font-family: Arial;  font-weight: bold;  color: #628c2a;  font-size:=\r\n 100%;  line-height: 122%; } #AOLMsgPart_2_e5764b11-9bd7-4dc1-94c0-483b242e=\r\n0034 #ygrp-sponsor .ad a{  text-decoration: none; } #AOLMsgPart_2_e5764b11-=\r\n9bd7-4dc1-94c0-483b242e0034 #ygrp-sponsor .ad a:hover{  text-decoration: un=\r\nderline; } #AOLMsgPart_2_e5764b11-9bd7-4dc1-94c0-483b242e0034 #ygrp-sponsor=\r\n .ad p{  margin: 0;  font-weight: normal;  color: #000000; } #AOLMsgPart_2_=\r\ne5764b11-9bd7-4dc1-94c0-483b242e0034 o{font-size: 0; } #AOLMsgPart_2_e5764b=\r\n11-9bd7-4dc1-94c0-483b242e0034 .MsoNormal{    margin: 0 0 0 0; } #AOLMsgPar=\r\nt_2_e5764b11-9bd7-4dc1-94c0-483b242e0034 #ygrp-text tt{   font-size: 120%; =\r\n} #AOLMsgPart_2_e5764b11-9bd7-4dc1-94c0-483b242e0034 blockquote{margin: 0 0=\r\n 0 4px;} #AOLMsgPart_2_e5764b11-9bd7-4dc1-94c0-483b242e0034 .replbq{margin:=\r\n4}#AOLMsgPart_2_e5764b11-9bd7-4dc1-94c0-483b242e0034 dd.last p span {  marg=\r\nin-right: 10px;  font-family: Verdana;  font-weight: bold;}#AOLMsgPart_2_e5=\r\n764b11-9bd7-4dc1-94c0-483b242e0034 dd.last p span.yshortcuts {  margin-righ=\r\nt: 0;}#AOLMsgPart_2_e5764b11-9bd7-4dc1-94c0-483b242e0034 div.photo-title a,=\r\n#AOLMsgPart_2_e5764b11-9bd7-4dc1-94c0-483b242e0034 div.photo-title a:active=\r\n,#AOLMsgPart_2_e5764b11-9bd7-4dc1-94c0-483b242e0034 div.photo-title a:hover=\r\n,#AOLMsgPart_2_e5764b11-9bd7-4dc1-94c0-483b242e0034 div.photo-title a:visit=\r\ned {    text-decoration: none;}#AOLMsgPart_2_e5764b11-9bd7-4dc1-94c0-483b24=\r\n2e0034 div.file-title a,#AOLMsgPart_2_e5764b11-9bd7-4dc1-94c0-483b242e0034 =\r\ndiv.file-title a:active,#AOLMsgPart_2_e5764b11-9bd7-4dc1-94c0-483b242e0034 =\r\ndiv.file-title a:hover,#AOLMsgPart_2_e5764b11-9bd7-4dc1-94c0-483b242e0034 d=\r\niv.file-title a:visited {    text-decoration: none;}#AOLMsgPart_2_e5764b11-=\r\n9bd7-4dc1-94c0-483b242e0034 #ygrp-msg p#attach-count {    clear: both;    p=\r\nadding: 15px 0 3px 0;    overflow: hidden;}#AOLMsgPart_2_e5764b11-9bd7-4dc1=\r\n-94c0-483b242e0034 #ygrp-msg p#attach-count span {    color: #1E66AE;    fo=\r\nnt-weight: bold;}#AOLMsgPart_2_e5764b11-9bd7-4dc1-94c0-483b242e0034 div#ygr=\r\np-mlmsg #ygrp-msg p a span.yshortcuts {    font-family: Verdana;    font-si=\r\nze: 10px;    font-weight: normal;}#AOLMsgPart_2_e5764b11-9bd7-4dc1-94c0-483=\r\nb242e0034 #ygrp-msg p a {    font-family: Verdana;}#AOLMsgPart_2_e5764b11-9=\r\nbd7-4dc1-94c0-483b242e0034 #ygrp-mlmsg a {    color: #1E66AE;}#AOLMsgPart_2=\r\n_e5764b11-9bd7-4dc1-94c0-483b242e0034 div.attach-table div div a {    text-=\r\ndecoration: none;}#AOLMsgPart_2_e5764b11-9bd7-4dc1-94c0-483b242e0034 div.at=\r\ntach-table {    width: 400px;}     &lt;/style&gt;      &lt;/div&gt;\n   \n\r\n----------MB_8CC1AE9EA9AC639_1B20_4708_webmail-d051.sysops.aol.com--"}