{"id": "16195", "subject": "Re: Question for you all", "author": "mrscaptainjack2", "timestamp": "2009-10-14T08:24:44Z", "full_text": "I don&#39;t know for sure it was my dad&#39;s friend.  But I find it hard to believe that entities on the other side who are not dead people would go to so much trouble to impersonate my dead friends and relatives -- why bother?  If they truly seek attention, why not come up with something more attention-getting than my dad&#39;s friend?  Why not impersonate my brother, who is really the one I&#39;m trying to reach?  And anyways, there are hundreds and hundreds of stories of people believing they have seen or heard or spoken to the ghost of their dead family members (my mother being one of them).  They can&#39;t all be wishful thinking.\n\nI find it much easier to believe that I&#39;m somehow unconsciously making this happen (via the process Phenom Investigator describes) using the box.  But since it&#39;s equally possible for me or a discarnate dead person to influence the box (via me and PK) (because, after all, we are no different from the dead people except we still have our bodies), I will probably never know if it&#39;s me or them making it happen.  \n\nI do know that I hear things on the tape that are repeated over and over and over again, in some cases twelve times in a row, which tends to rule out pareidolia.  I also have very clear sentences which anyone -- ANYONE -- without prompting could understand and hear (I&#39;ve tested this with friends and family, letting them listen and asking what they hear).  And, like I&#39;ve said, the names I&#39;ve gotten have mostly been of obscure dead friends and relatives, not the ones I&#39;m trying so desperately to contact.\n\nSo I&#39;m leaning toward the dead people theory for now.\n\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;April Abercrombie&quot; &lt;april@...&gt; wrote:\n&gt;\n&gt; Maybe you&#39;re not, but most EVP&#39;s you hear are just matrixng, which is why mostly no one hears what the person recorded it thinks that they hear.\n&gt; \n&gt; But your proof here is subjective. How do you  know for sure that it is your dad&#39;s friend?\n&gt; \n&gt; I&#39;m not trying to be argumentative-you may be right.\n&gt; \n&gt; \n&gt;   ----- Original Message ----- \n&gt;   From: mrscaptainjack2 \n&gt;   To: EVP-ITC@yahoogroups.com \n&gt;   Sent: Sunday, October 11, 2009 10:08 PM\n&gt;   Subject: [EVP-ITC] Re: Question for you all\n&gt; \n&gt; \n&gt;     Well, I would disagree with the idea I&#39;m hearing what I want to hear. The first time I got my dad&#39;s friend Gordy, I didn&#39;t even hear his name; I thought he was saying &quot;Forty, forty, forty.&quot; It was only in a later session that he identified himself again using his full proper name. Then I realized that he is now dead (last I saw him he was very much alive), and that he&#39;d been saying Gordy all along (confirmed by playing back the old tape). I certainly didn&#39;t expect to hear him come through, and yet he did, so I can&#39;t see how I could&#39;ve expected to hear his name.\n&gt; \n&gt;   Jill\n&gt; \n&gt;   --- In EVP-ITC@yahoogroups.com, &quot;phenom_investigator&quot; &lt;phenom_investigator@&gt; wrote:\n&gt;   &gt;\n&gt;   &gt; Why do you disagree that PK is responsible for most true EVPs? \n&gt;   &gt; What about EVPs and/or PK tells you this might be so?\n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; --- In EVP-ITC@yahoogroups.com, &quot;April Abercrombie&quot; &lt;april@&gt; wrote:\n&gt;   &gt; &gt;\n&gt;   &gt; &gt; I agree in that much of EVP is just pareidolia, or the listener hearing what he wants to hear. But I disagree in that PK is responsible for most true EVPs.\n&gt;   &gt; &gt; \n&gt;   &gt; &gt; ----- Original Message ----- \n&gt;   &gt; &gt; From: phenom_investigator \n&gt;   &gt; &gt; To: EVP-ITC@yahoogroups.com \n&gt;   &gt; &gt; Sent: Saturday, October 10, 2009 7:09 AM\n&gt;   &gt; &gt; Subject: [EVP-ITC] Re: Question for you all\n&gt;   &gt; &gt; \n&gt;   &gt; &gt; \n&gt;   &gt; &gt; If we presume that much of what is heard is in fact the result of personal PK and not a discarnate voice, we may have an answer to the question of why some sourcse communicate and others do not.\n&gt;   &gt; &gt; \n&gt;   &gt; &gt; I would suggest that while the operator may produce the voice phenomena, that operator may indeed be influenced by external agents. This could include discarnate agents. \n&gt;   &gt; &gt; \n&gt;   &gt; &gt; When you carefully consider what is being heard, the themes often seem to reflect what may be subconscious concerns of the operator or the listener. If external sources additionally inform this process of perception, it is quite possible they influence both what is recorded and how is later perceived. This would also nicely explain why some people hear the same things on a recording while others hear quite different things and more importantly while one person hears different things from the same recording at different times.\n&gt;   &gt; &gt; \n&gt;   &gt; &gt; It would also remove the requirement that discarnates manifest the phenomena. If discarnates are indeed non-physical, it is unclear how they would modify the physical world. On the other hand, we have good evidence demonstrating the ability of living individuals to alter their environments in profound ways, apparently with their minds. So it seems to make more sense that this might indeed by the underlying mechanism to EVPs rather than discarnate manipulations.\n&gt;   &gt; &gt; \n&gt;   &gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;mrscaptainjack2&quot; &lt;jjkamp@&gt; wrote:\n&gt;   &gt; &gt; &gt;I&#39;m wondering if a haunting-type situation such as yours would be different from talking to your ancestors four or five generations back? I guess I&#39;m just wondering out loud what makes us connect with some entities, no matter how obscure or nonexistent the connection, and not others? What makes some &quot;tune in&quot; to talk to us, or hang around on a plane closest to us...or what? At least in a haunting, you&#39;d be getting the entity that happened to reside at that location.\n&gt;   &gt; &gt; &gt; \n&gt;   &gt; &gt; &gt; Never mind me, guys. I just have this driving need to understand how all this works, and I don&#39;t think it&#39;s possible.\n&gt;   &gt; &gt; &gt; \n&gt;   &gt; &gt; &gt; Jill\n&gt;   &gt; &gt; &gt; \n&gt;   &gt; &gt; &gt; \n&gt;   &gt; &gt; &gt; \n&gt;   &gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; &lt;purplealiengirl@&gt; wrote:\n&gt;   &gt; &gt; &gt; &gt;\n&gt;   &gt; &gt; &gt; &gt; \n&gt;   &gt; &gt; &gt; &gt; Capericus. Nicolaus Copernicus (1473-1543) \n&gt;   &gt; &gt; &gt; &gt; \n&gt;   &gt; &gt; &gt; &gt; \n&gt;   &gt; &gt; &gt; &gt; F-S\n&gt;   &gt; &gt; &gt; &gt; \n&gt;   &gt; &gt; &gt; &gt; \n&gt;   &gt; &gt; &gt; &gt; \n&gt;   &gt; &gt; &gt; &gt; \n&gt;   &gt; &gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;mrscaptainjack2&quot; &lt;jjkamp@&gt; wrote:\n&gt;   &gt; &gt; &gt; &gt; &gt;\n&gt;   &gt; &gt; &gt; &gt; &gt; Those of you who have contacted entities claiming to be dead people, what is the oldest person you&#39;ve spoken to (in terms of how long ago they died)?\n&gt;   &gt; &gt; &gt; &gt; &gt; \n&gt;   &gt; &gt; &gt; &gt; &gt; I&#39;m wondering because my great uncle has been coming through a lot, and he was murdered in 1942. Since I wasn&#39;t born until decades later, I never knew him, but I do understand that people come through we did not know in life. Has anyone else contacted someone claiming to have lived that far back? Or in another lifetime entirely?\n&gt;   &gt; &gt; &gt; &gt; &gt;\n&gt;   &gt; &gt; &gt; &gt;\n&gt;   &gt; &gt; &gt;\n&gt;   &gt; &gt;\n&gt;   &gt;\n&gt;"}