{"id": "16215", "subject": "Re: Question for you all", "author": "phenom_investigator", "timestamp": "2009-10-15T17:20:55Z", "full_text": "Please note that I used the word &#39;evidence&#39; not proof. We are working here in what is best called an &#39;edge&#39; or &#39;border&#39; science. This is the province of theoretical constructs, frameworks and models. It is not applied science. The sort of proofs implied in the response below are meaningful in applied research, such as in the physical sciences. Unfortunately, this research has not yet advanced to that stage. And for that reason, it is premature to suggest that such proofs should be expected at this juncture. \n\nWe use terms like &#39;suggests&#39; and &#39;implies&#39; precisely for this reason. Nothing is known for certain, and it would be (and is) irresponsible to suggest to the contrary at this point. \n\nWhat we seek in our models is consistency with observations. What I have done here is to provide reports of observations which suggest a coherent link that in turn provides one possible explanation to the phenomena in question.\n\nI would suggest that a &quot;proof&quot; might be had if anyone could describe a condition wherein no belief per se were required and the only explanation of a phenomenon were due to discarnate activity. This means that no alternative explanation is allowable. Hundreds of quite brilliant people have tried for well over a century to find this one thing and thus far, have been unsuccessful. \n\n--- In EVP-ITC@yahoogroups.com, &quot;April Abercrombie&quot; &lt;april@...&gt; wrote:\n&gt;\n&gt; None of this is proof. None of this evidence say that all, or even most EVP&#39;s are caused by PK. You even used words like &quot;potential link&quot; and &quot;strongly implicates.&quot;  This doesn&#39;t mean it is proven.\n&gt; \n&gt; --------------------------------------------------------------------------------\n&gt; \n&gt; \n&gt; [Now let&#39;s turn to the evidence for PK as an explanation for the EVP. A close colleague of mine, a respected parapsychologist in Los Angeles, was working years ago in a well-known haunted site in the Hollywood area. He recorded the voice of the home&#39;s owner, while standing next to the man. During this interval the man did not speak; no one heard what was recorded until it was played back. This sounds like a classic EVP thus far. The playback was easily heard by all. The man recognized his own voice, including swear words; he had a penchant for swearing in his normal speech.]\n&gt; \n&gt; Not personally having seen or heard of  any documentation of this experiment, I am skeptical of it. But lets just say it is true and this really happened and as portrayed. This still doesn&#39;t prove in any way that most EVP&#39;s are caused by PK. Again, as I said earlier, I am open to the possibility that it might happened in some rare cases.\n&gt; \n&gt; --------------------------------------------------------------------------------\n&gt; \n&gt; \n&gt; [This anecdotal story would suggest that PK could be an explanation for EVPs based on this single example alone.]\n&gt; \n&gt; It only suggests that PK *could* have played part on this particular case. To say that PK is responsible for most EVP-there has to be way more experimentation and testing that renders consistent results.\n&gt; \n&gt; --------------------------------------------------------------------------------\n&gt; \n&gt; \n&gt; [Lastly we&#39;ll consider a recent experiment by Dr. Dean Radin. In this experiment, ...\n&gt; \n&gt; This implies that retrocausation could be at work during EVP production. And that suggests the involvement of the operator as opposed to discarante entities manipulating the environment.]\n&gt; \n&gt; I have heard of this experiment. Still, it does not prove that most EVP&#39;s are due to PK. All it *suggests* is that PK itself may be possible.\n&gt; \n&gt; --------------------------------------------------------------------------------\n&gt; \n&gt; \n&gt; IMO, if it were the case that most EVP&#39;s were caused by PK, we should have been able to prove that by now.\n&gt; \n&gt; \n&gt;   ----- Original Message ----- \n&gt;   From: phenom_investigator \n&gt;   To: EVP-ITC@yahoogroups.com \n&gt;   Sent: Tuesday, October 13, 2009 9:22 AM\n&gt;   Subject: [EVP-ITC] Re: Question for you all\n&gt; \n&gt; \n&gt;     Let&#39;s examine the supporting evidence a bit more closely. First consider the potential link between healing and PK. Both phenomena can occur due to a local or distant agent. Absent healing for example would be the distant analogy to distank or remote PK. Both have been studied in controlled experiments. Dr Larry Dossy in Texas is one of the primary investigators in healing research. Both healing and general PK are reliably observed to be either intentional or spontaneous. So both exhibit similar traits. Both involve apparent manipulation by the mind of the physical environment. And certainly healing strongly implicates an indirect effect on complex systems. So it makes some sense that the two may indeed be related.\n&gt; \n&gt;   Now let&#39;s turn to the evidence for PK as an explanation for the EVP. A close colleague of mine, a respected parapsychologist in Los Angeles, was working years ago in a well-known haunted site in the Hollywood area. He recorded the voice of the home&#39;s owner, while standing next to the man. During this interval the man did not speak; no one heard what was recorded until it was played back. This sounds like a classic EVP thus far. The playback was easily heard by all. The man recognized his own voice, including swear words; he had a penchant for swearing in his normal speech. This anecdotal story would suggest that PK could be an explanation for EVPs based on this single example alone. \n&gt; \n&gt;   Lastly we&#39;ll consider a recent experiment by Dr. Dean Radin. In this experiment, mediators were asked to influence which paths photons would take passing through one of two very tiny slits. You would expect this to occur normally by random chance, producing an equal distribution of photons in two regions on the target photograph. When uninfluenced, this is exactly what happened. When the mediator tried to &#39;block&#39; one of the slits, the distribution shifted, indicating success. But this is not what&#39;s important - it is necessary background. For the next trial, the machine was turned on and the exposure taken with no influence attempted. In fact, the mediatator was not even present. The following day the mediatator was asked to influence the machine. He was not told the machine was turned off and could not even record at that time. The next day the image was inspected for the first time - the meditator again was not present. The image revealed a pattern similar to the one produced when the mediatator successfully &quot;blocked&quot; the slit in the first trial. Theoretical physicst Dr. Richard Stroup suggested this indicated to him a demonstration of what he calls &quot;retrocausation&quot; - a notion in theoretical physics that the future actually impacts on the past (as well as the past impacting the future as most people believe). Dr. Radin raised an interesting point with respect to designing experiments. He now wonders if investigators are so entangled with experiments that they unwittingly can influence outcomes even before the experiment is designed. Remember, these are trained academicians at the top of their respective fields. \n&gt; \n&gt;   This implies that retrocausation could be at work during EVP production. And that suggests the involvement of the operator as opposed to discarante entities manipulating the environment.\n&gt; \n&gt;   I have no problem with the notion that external influences may indeed in some way mediate what is done; I simply wonder if they are really manipulating sound directly.\n&gt; \n&gt;   This is what I could consider the evidence for the position I stated.\n&gt; \n&gt;   --- In EVP-ITC@yahoogroups.com, &quot;April Abercrombie&quot; &lt;april@&gt; wrote:\n&gt;   &gt;\n&gt;   &gt; Personal experience, and lack of supporting evidence is why I disagree about PK being responsible for most EVPs.\n&gt;   &gt; \n&gt;   &gt; I am open to the possibility that it might be possible, however it would have to be a very rare occurrence.\n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; ----- Original Message ----- \n&gt;   &gt; From: phenom_investigator \n&gt;   &gt; To: EVP-ITC@yahoogroups.com \n&gt;   &gt; Sent: Sunday, October 11, 2009 1:30 PM\n&gt;   &gt; Subject: [EVP-ITC] Re: Question for you all\n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; Why do you disagree that PK is responsible for most true EVPs? \n&gt;   &gt; What about EVPs and/or PK tells you this might be so?\n&gt;   &gt; \n&gt;   &gt; --- In EVP-ITC@yahoogroups.com, &quot;April Abercrombie&quot; &lt;april@&gt; wrote:\n&gt;   &gt; &gt;\n&gt;   &gt; &gt; I agree in that much of EVP is just pareidolia, or the listener hearing what he wants to hear. But I disagree in that PK is responsible for most true EVPs.\n&gt;   &gt; &gt; \n&gt;   &gt; &gt; ----- Original Message ----- \n&gt;   &gt; &gt; From: phenom_investigator \n&gt;   &gt; &gt; To: EVP-ITC@yahoogroups.com \n&gt;   &gt; &gt; Sent: Saturday, October 10, 2009 7:09 AM\n&gt;   &gt; &gt; Subject: [EVP-ITC] Re: Question for you all\n&gt;   &gt; &gt; \n&gt;   &gt; &gt; \n&gt;   &gt; &gt; If we presume that much of what is heard is in fact the result of personal PK and not a discarnate voice, we may have an answer to the question of why some sourcse communicate and others do not.\n&gt;   &gt; &gt; \n&gt;   &gt; &gt; I would suggest that while the operator may produce the voice phenomena, that operator may indeed be influenced by external agents. This could include discarnate agents. \n&gt;   &gt; &gt; \n&gt;   &gt; &gt; When you carefully consider what is being heard, the themes often seem to reflect what may be subconscious concerns of the operator or the listener. If external sources additionally inform this process of perception, it is quite possible they influence both what is recorded and how is later perceived. This would also nicely explain why some people hear the same things on a recording while others hear quite different things and more importantly while one person hears different things from the same recording at different times.\n&gt;   &gt; &gt; \n&gt;   &gt; &gt; It would also remove the requirement that discarnates manifest the phenomena. If discarnates are indeed non-physical, it is unclear how they would modify the physical world. On the other hand, we have good evidence demonstrating the ability of living individuals to alter their environments in profound ways, apparently with their minds. So it seems to make more sense that this might indeed by the underlying mechanism to EVPs rather than discarnate manipulations.\n&gt;   &gt; &gt; \n&gt;   &gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;mrscaptainjack2&quot; &lt;jjkamp@&gt; wrote:\n&gt;   &gt; &gt; &gt;I&#39;m wondering if a haunting-type situation such as yours would be different from talking to your ancestors four or five generations back? I guess I&#39;m just wondering out loud what makes us connect with some entities, no matter how obscure or nonexistent the connection, and not others? What makes some &quot;tune in&quot; to talk to us, or hang around on a plane closest to us...or what? At least in a haunting, you&#39;d be getting the entity that happened to reside at that location.\n&gt;   &gt; &gt; &gt; \n&gt;   &gt; &gt; &gt; Never mind me, guys. I just have this driving need to understand how all this works, and I don&#39;t think it&#39;s possible.\n&gt;   &gt; &gt; &gt; \n&gt;   &gt; &gt; &gt; Jill\n&gt;   &gt; &gt; &gt; \n&gt;   &gt; &gt; &gt; \n&gt;   &gt; &gt; &gt; \n&gt;   &gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; &lt;purplealiengirl@&gt; wrote:\n&gt;   &gt; &gt; &gt; &gt;\n&gt;   &gt; &gt; &gt; &gt; \n&gt;   &gt; &gt; &gt; &gt; Capericus. Nicolaus Copernicus (1473-1543) \n&gt;   &gt; &gt; &gt; &gt; \n&gt;   &gt; &gt; &gt; &gt; \n&gt;   &gt; &gt; &gt; &gt; F-S\n&gt;   &gt; &gt; &gt; &gt; \n&gt;   &gt; &gt; &gt; &gt; \n&gt;   &gt; &gt; &gt; &gt; \n&gt;   &gt; &gt; &gt; &gt; \n&gt;   &gt; &gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;mrscaptainjack2&quot; &lt;jjkamp@&gt; wrote:\n&gt;   &gt; &gt; &gt; &gt; &gt;\n&gt;   &gt; &gt; &gt; &gt; &gt; Those of you who have contacted entities claiming to be dead people, what is the oldest person you&#39;ve spoken to (in terms of how long ago they died)?\n&gt;   &gt; &gt; &gt; &gt; &gt; \n&gt;   &gt; &gt; &gt; &gt; &gt; I&#39;m wondering because my great uncle has been coming through a lot, and he was murdered in 1942. Since I wasn&#39;t born until decades later, I never knew him, but I do understand that people come through we did not know in life. Has anyone else contacted someone claiming to have lived that far back? Or in another lifetime entirely?\n&gt;   &gt; &gt; &gt; &gt; &gt;\n&gt;   &gt; &gt; &gt; &gt;\n&gt;   &gt; &gt; &gt;\n&gt;   &gt; &gt;\n&gt;   &gt;\n&gt;"}