{"id": "16216", "subject": "Re: [EVP-ITC] Re: Question for you all", "author": "April Abercrombie", "timestamp": "2009-10-15T18:04:22Z", "full_text": "------=_NextPart_000_01B3_01CA4D8F.A206D7E0\r\nContent-Type: text/plain;\n\tcharset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n[We use terms like &#39;suggests&#39; and &#39;implies&#39; precisely for this reason. Noth=\r\ning is known for certain, and it would be (and is) irresponsible to suggest=\r\n to the contrary at this point. ]\n\nExactly my point. Which is why you can&#39;t=\r\n say that most EVP is due to PK. You can hold it as your opinion, but it is=\r\n not fact.\n\n  ----- Original Message ----- \n  From: phenom_investigator \n  =\r\nTo: EVP-ITC@yahoogroups.com \n  Sent: Thursday, October 15, 2009 11:20 AM\n  =\r\nSubject: [EVP-ITC] Re: Question for you all\n\n\n    Please note that I used t=\r\nhe word &#39;evidence&#39; not proof. We are working here in what is best called an=\r\n &#39;edge&#39; or &#39;border&#39; science. This is the province of theoretical constructs=\r\n, frameworks and models. It is not applied science. The sort of proofs impl=\r\nied in the response below are meaningful in applied research, such as in th=\r\ne physical sciences. Unfortunately, this research has not yet advanced to t=\r\nhat stage. And for that reason, it is premature to suggest that such proofs=\r\n should be expected at this juncture. \n\n  We use terms like &#39;suggests&#39; and =\r\n&#39;implies&#39; precisely for this reason. Nothing is known for certain, and it w=\r\nould be (and is) irresponsible to suggest to the contrary at this point. \n\n=\r\n  What we seek in our models is consistency with observations. What I have =\r\ndone here is to provide reports of observations which suggest a coherent li=\r\nnk that in turn provides one possible explanation to the phenomena in quest=\r\nion.\n\n  I would suggest that a &quot;proof&quot; might be had if anyone could describ=\r\ne a condition wherein no belief per se were required and the only explanati=\r\non of a phenomenon were due to discarnate activity. This means that no alte=\r\nrnative explanation is allowable. Hundreds of quite brilliant people have t=\r\nried for well over a century to find this one thing and thus far, have been=\r\n unsuccessful. \n\n  --- In EVP-ITC@yahoogroups.com, &quot;April Abercrombie&quot; &lt;apr=\r\nil@...&gt; wrote:\n  &gt;\n  &gt; None of this is proof. None of this evidence say tha=\r\nt all, or even most EVP&#39;s are caused by PK. You even used words like &quot;poten=\r\ntial link&quot; and &quot;strongly implicates.&quot; This doesn&#39;t mean it is proven.\n  &gt; \n=\r\n  &gt; ----------------------------------------------------------\n  &gt; \n  &gt; \n  =\r\n&gt; [Now let&#39;s turn to the evidence for PK as an explanation for the EVP. A c=\r\nlose colleague of mine, a respected parapsychologist in Los Angeles, was wo=\r\nrking years ago in a well-known haunted site in the Hollywood area. He reco=\r\nrded the voice of the home&#39;s owner, while standing next to the man. During =\r\nthis interval the man did not speak; no one heard what was recorded until i=\r\nt was played back. This sounds like a classic EVP thus far. The playback wa=\r\ns easily heard by all. The man recognized his own voice, including swear wo=\r\nrds; he had a penchant for swearing in his normal speech.]\n  &gt; \n  &gt; Not per=\r\nsonally having seen or heard of any documentation of this experiment, I am =\r\nskeptical of it. But lets just say it is true and this really happened and =\r\nas portrayed. This still doesn&#39;t prove in any way that most EVP&#39;s are cause=\r\nd by PK. Again, as I said earlier, I am open to the possibility that it mig=\r\nht happened in some rare cases.\n  &gt; \n  &gt; ----------------------------------=\r\n------------------------\n  &gt; \n  &gt; \n  &gt; [This anecdotal story would suggest =\r\nthat PK could be an explanation for EVPs based on this single example alone=\r\n.]\n  &gt; \n  &gt; It only suggests that PK *could* have played part on this parti=\r\ncular case. To say that PK is responsible for most EVP-there has to be way =\r\nmore experimentation and testing that renders consistent results.\n  &gt; \n  &gt; =\r\n----------------------------------------------------------\n  &gt; \n  &gt; \n  &gt; [L=\r\nastly we&#39;ll consider a recent experiment by Dr. Dean Radin. In this experim=\r\nent, ...\n  &gt; \n  &gt; This implies that retrocausation could be at work during =\r\nEVP production. And that suggests the involvement of the operator as oppose=\r\nd to discarante entities manipulating the environment.]\n  &gt; \n  &gt; I have hea=\r\nrd of this experiment. Still, it does not prove that most EVP&#39;s are due to =\r\nPK. All it *suggests* is that PK itself may be possible.\n  &gt; \n  &gt; ---------=\r\n-------------------------------------------------\n  &gt; \n  &gt; \n  &gt; IMO, if it =\r\nwere the case that most EVP&#39;s were caused by PK, we should have been able t=\r\no prove that by now.\n  &gt; \n  &gt; \n  &gt; ----- Original Message ----- \n  &gt; From: =\r\nphenom_investigator \n  &gt; To: EVP-ITC@yahoogroups.com \n  &gt; Sent: Tuesday, Oc=\r\ntober 13, 2009 9:22 AM\n  &gt; Subject: [EVP-ITC] Re: Question for you all\n  &gt; =\r\n\n  &gt; \n  &gt; Let&#39;s examine the supporting evidence a bit more closely. First c=\r\nonsider the potential link between healing and PK. Both phenomena can occur=\r\n due to a local or distant agent. Absent healing for example would be the d=\r\nistant analogy to distank or remote PK. Both have been studied in controlle=\r\nd experiments. Dr Larry Dossy in Texas is one of the primary investigators =\r\nin healing research. Both healing and general PK are reliably observed to b=\r\ne either intentional or spontaneous. So both exhibit similar traits. Both i=\r\nnvolve apparent manipulation by the mind of the physical environment. And c=\r\nertainly healing strongly implicates an indirect effect on complex systems.=\r\n So it makes some sense that the two may indeed be related.\n  &gt; \n  &gt; Now le=\r\nt&#39;s turn to the evidence for PK as an explanation for the EVP. A close coll=\r\neague of mine, a respected parapsychologist in Los Angeles, was working yea=\r\nrs ago in a well-known haunted site in the Hollywood area. He recorded the =\r\nvoice of the home&#39;s owner, while standing next to the man. During this inte=\r\nrval the man did not speak; no one heard what was recorded until it was pla=\r\nyed back. This sounds like a classic EVP thus far. The playback was easily =\r\nheard by all. The man recognized his own voice, including swear words; he h=\r\nad a penchant for swearing in his normal speech. This anecdotal story would=\r\n suggest that PK could be an explanation for EVPs based on this single exam=\r\nple alone. \n  &gt; \n  &gt; Lastly we&#39;ll consider a recent experiment by Dr. Dean =\r\nRadin. In this experiment, mediators were asked to influence which paths ph=\r\notons would take passing through one of two very tiny slits. You would expe=\r\nct this to occur normally by random chance, producing an equal distribution=\r\n of photons in two regions on the target photograph. When uninfluenced, thi=\r\ns is exactly what happened. When the mediator tried to &#39;block&#39; one of the s=\r\nlits, the distribution shifted, indicating success. But this is not what&#39;s =\r\nimportant - it is necessary background. For the next trial, the machine was=\r\n turned on and the exposure taken with no influence attempted. In fact, the=\r\n mediatator was not even present. The following day the mediatator was aske=\r\nd to influence the machine. He was not told the machine was turned off and =\r\ncould not even record at that time. The next day the image was inspected fo=\r\nr the first time - the meditator again was not present. The image revealed =\r\na pattern similar to the one produced when the mediatator successfully &quot;blo=\r\ncked&quot; the slit in the first trial. Theoretical physicst Dr. Richard Stroup =\r\nsuggested this indicated to him a demonstration of what he calls &quot;retrocaus=\r\nation&quot; - a notion in theoretical physics that the future actually impacts o=\r\nn the past (as well as the past impacting the future as most people believe=\r\n). Dr. Radin raised an interesting point with respect to designing experime=\r\nnts. He now wonders if investigators are so entangled with experiments that=\r\n they unwittingly can influence outcomes even before the experiment is desi=\r\ngned. Remember, these are trained academicians at the top of their respecti=\r\nve fields. \n  &gt; \n  &gt; This implies that retrocausation could be at work duri=\r\nng EVP production. And that suggests the involvement of the operator as opp=\r\nosed to discarante entities manipulating the environment.\n  &gt; \n  &gt; I have n=\r\no problem with the notion that external influences may indeed in some way m=\r\nediate what is done; I simply wonder if they are really manipulating sound =\r\ndirectly.\n  &gt; \n  &gt; This is what I could consider the evidence for the posit=\r\nion I stated.\n  &gt; \n  &gt; --- In EVP-ITC@yahoogroups.com, &quot;April Abercrombie&quot; =\r\n&lt;april@&gt; wrote:\n  &gt; &gt;\n  &gt; &gt; Personal experience, and lack of supporting evi=\r\ndence is why I disagree about PK being responsible for most EVPs.\n  &gt; &gt; \n  =\r\n&gt; &gt; I am open to the possibility that it might be possible, however it woul=\r\nd have to be a very rare occurrence.\n  &gt; &gt; \n  &gt; &gt; \n  &gt; &gt; ----- Original Mes=\r\nsage ----- \n  &gt; &gt; From: phenom_investigator \n  &gt; &gt; To: EVP-ITC@yahoogroups.=\r\ncom \n  &gt; &gt; Sent: Sunday, October 11, 2009 1:30 PM\n  &gt; &gt; Subject: [EVP-ITC] =\r\nRe: Question for you all\n  &gt; &gt; \n  &gt; &gt; \n  &gt; &gt; Why do you disagree that PK is=\r\n responsible for most true EVPs? \n  &gt; &gt; What about EVPs and/or PK tells you=\r\n this might be so?\n  &gt; &gt; \n  &gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;April Aber=\r\ncrombie&quot; &lt;april@&gt; wrote:\n  &gt; &gt; &gt;\n  &gt; &gt; &gt; I agree in that much of EVP is jus=\r\nt pareidolia, or the listener hearing what he wants to hear. But I disagree=\r\n in that PK is responsible for most true EVPs.\n  &gt; &gt; &gt; \n  &gt; &gt; &gt; ----- Origi=\r\nnal Message ----- \n  &gt; &gt; &gt; From: phenom_investigator \n  &gt; &gt; &gt; To: EVP-ITC@y=\r\nahoogroups.com \n  &gt; &gt; &gt; Sent: Saturday, October 10, 2009 7:09 AM\n  &gt; &gt; &gt; Su=\r\nbject: [EVP-ITC] Re: Question for you all\n  &gt; &gt; &gt; \n  &gt; &gt; &gt; \n  &gt; &gt; &gt; If we p=\r\nresume that much of what is heard is in fact the result of personal PK and =\r\nnot a discarnate voice, we may have an answer to the question of why some s=\r\nourcse communicate and others do not.\n  &gt; &gt; &gt; \n  &gt; &gt; &gt; I would suggest that=\r\n while the operator may produce the voice phenomena, that operator may inde=\r\ned be influenced by external agents. This could include discarnate agents. =\r\n\n  &gt; &gt; &gt; \n  &gt; &gt; &gt; When you carefully consider what is being heard, the them=\r\nes often seem to reflect what may be subconscious concerns of the operator =\r\nor the listener. If external sources additionally inform this process of pe=\r\nrception, it is quite possible they influence both what is recorded and how=\r\n is later perceived. This would also nicely explain why some people hear th=\r\ne same things on a recording while others hear quite different things and m=\r\nore importantly while one person hears different things from the same recor=\r\nding at different times.\n  &gt; &gt; &gt; \n  &gt; &gt; &gt; It would also remove the requirem=\r\nent that discarnates manifest the phenomena. If discarnates are indeed non-=\r\nphysical, it is unclear how they would modify the physical world. On the ot=\r\nher hand, we have good evidence demonstrating the ability of living individ=\r\nuals to alter their environments in profound ways, apparently with their mi=\r\nnds. So it seems to make more sense that this might indeed by the underlyin=\r\ng mechanism to EVPs rather than discarnate manipulations.\n  &gt; &gt; &gt; \n  &gt; &gt; &gt; =\r\n--- In EVP-ITC@yahoogroups.com, &quot;mrscaptainjack2&quot; &lt;jjkamp@&gt; wrote:\n  &gt; &gt; &gt; =\r\n&gt;I&#39;m wondering if a haunting-type situation such as yours would be differen=\r\nt from talking to your ancestors four or five generations back? I guess I&#39;m=\r\n just wondering out loud what makes us connect with some entities, no matte=\r\nr how obscure or nonexistent the connection, and not others? What makes som=\r\ne &quot;tune in&quot; to talk to us, or hang around on a plane closest to us...or wha=\r\nt? At least in a haunting, you&#39;d be getting the entity that happened to res=\r\nide at that location.\n  &gt; &gt; &gt; &gt; \n  &gt; &gt; &gt; &gt; Never mind me, guys. I just have=\r\n this driving need to understand how all this works, and I don&#39;t think it&#39;s=\r\n possible.\n  &gt; &gt; &gt; &gt; \n  &gt; &gt; &gt; &gt; Jill\n  &gt; &gt; &gt; &gt; \n  &gt; &gt; &gt; &gt; \n  &gt; &gt; &gt; &gt; \n  &gt; &gt;=\r\n &gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; &lt;purplealiengirl@&gt;=\r\n wrote:\n  &gt; &gt; &gt; &gt; &gt;\n  &gt; &gt; &gt; &gt; &gt; \n  &gt; &gt; &gt; &gt; &gt; Capericus. Nicolaus Copernicus=\r\n (1473-1543) \n  &gt; &gt; &gt; &gt; &gt; \n  &gt; &gt; &gt; &gt; &gt; \n  &gt; &gt; &gt; &gt; &gt; F-S\n  &gt; &gt; &gt; &gt; &gt; \n  &gt; &gt; =\r\n&gt; &gt; &gt; \n  &gt; &gt; &gt; &gt; &gt; \n  &gt; &gt; &gt; &gt; &gt; \n  &gt; &gt; &gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com=\r\n, &quot;mrscaptainjack2&quot; &lt;jjkamp@&gt; wrote:\n  &gt; &gt; &gt; &gt; &gt; &gt;\n  &gt; &gt; &gt; &gt; &gt; &gt; Those of y=\r\nou who have contacted entities claiming to be dead people, what is the olde=\r\nst person you&#39;ve spoken to (in terms of how long ago they died)?\n  &gt; &gt; &gt; &gt; =\r\n&gt; &gt; \n  &gt; &gt; &gt; &gt; &gt; &gt; I&#39;m wondering because my great uncle has been coming thr=\r\nough a lot, and he was murdered in 1942. Since I wasn&#39;t born until decades =\r\nlater, I never knew him, but I do understand that people come through we di=\r\nd not know in life. Has anyone else contacted someone claiming to have live=\r\nd that far back? Or in another lifetime entirely?\n  &gt; &gt; &gt; &gt; &gt; &gt;\n  &gt; &gt; &gt; &gt; &gt;=\r\n\n  &gt; &gt; &gt; &gt;\n  &gt; &gt; &gt;\n  &gt; &gt;\n  &gt;\n\n\n\n  \r\n------=_NextPart_000_01B3_01CA4D8F.A206D7E0\r\nContent-Type: text/html;\n\tcharset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML 4.0 Transitional//EN&quot;&gt;\n&lt;HTML&gt;&lt;HEAD&gt;=\r\n\n&lt;META content=3D&quot;text/html; charset=3Diso-8859-1&quot; http-equiv=3DContent-Typ=\r\ne&gt;\n&lt;META name=3DGENERATOR content=3D&quot;MSHTML 8.00.6001.18812&quot;&gt;&lt;/HEAD&gt;\n&lt;BODY =\r\nstyle=3D&quot;BACKGROUND-COLOR: #ffffff&quot; bgColor=3D#ffffff&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 =\r\nface=3D&quot;Myriad Pro&quot;&gt;&lt;FONT size=3D3 face=3D&quot;Times New Roman&quot;&gt;&lt;EM&gt;[We \nuse te=\r\nrms like &#39;suggests&#39; and &#39;implies&#39; precisely for this reason. Nothing is \nkn=\r\nown for certain, and it would be (and is) irresponsible to suggest to the \n=\r\ncontrary at this point. ]&lt;/EM&gt;&lt;/FONT&gt;&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 face=\r\n=3D&quot;Myriad Pro&quot;&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2 face=3D&quot;Myriad Pro&quot;=\r\n&gt;Exactly my point. Which is why you can&#39;t say \nthat most EVP is due to PK. =\r\nYou can hold it as your opinion, but it&nbsp;is not \nfact.&lt;BR&gt;&lt;/DIV&gt;&lt;/FONT&gt;=\r\n\n&lt;BLOCKQUOTE \nstyle=3D&quot;BORDER-LEFT: #000000 2px solid; PADDING-LEFT: 5px; P=\r\nADDING-RIGHT: 0px; MARGIN-LEFT: 5px; MARGIN-RIGHT: 0px&quot; \ndir=3Dltr&gt;\n  &lt;DIV =\r\nstyle=3D&quot;FONT: 10pt arial&quot;&gt;----- Original Message ----- &lt;/DIV&gt;\n  &lt;DIV \n  st=\r\nyle=3D&quot;FONT: 10pt arial; BACKGROUND: #e4e4e4; font-color: black&quot;&gt;&lt;B&gt;From:&lt;/=\r\nB&gt; \n  &lt;A title=3Dphenom_investigator@... \n  href=3D&quot;mailto:phenom_inv=\r\nestigator@...&quot;&gt;phenom_investigator&lt;/A&gt; &lt;/DIV&gt;\n  &lt;DIV style=3D&quot;FONT: 1=\r\n0pt arial&quot;&gt;&lt;B&gt;To:&lt;/B&gt; &lt;A title=3DEVP-ITC@yahoogroups.com \n  href=3D&quot;mailto:=\r\nEVP-ITC@yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups.com&lt;/A&gt; &lt;/DIV&gt;\n  &lt;DIV style=3D=\r\n&quot;FONT: 10pt arial&quot;&gt;&lt;B&gt;Sent:&lt;/B&gt; Thursday, October 15, 2009 11:20 \n  AM&lt;/DIV=\r\n&gt;\n  &lt;DIV style=3D&quot;FONT: 10pt arial&quot;&gt;&lt;B&gt;Subject:&lt;/B&gt; [EVP-ITC] Re: Question =\r\nfor you \n  all&lt;/DIV&gt;\n  &lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;SPAN style=3D&quot;DISPLAY: none&quot;&gt;&nbsp;&lt;=\r\n/SPAN&gt; \n  &lt;DIV id=3Dygrp-text&gt;\n  &lt;P&gt;Please note that I used the word &#39;evide=\r\nnce&#39; not proof. We are working here \n  in what is best called an &#39;edge&#39; or =\r\n&#39;border&#39; science. This is the province of \n  theoretical constructs, framew=\r\norks and models. It is not applied science. The \n  sort of proofs implied i=\r\nn the response below are meaningful in applied \n  research, such as in the =\r\nphysical sciences. Unfortunately, this research has \n  not yet advanced to =\r\nthat stage. And for that reason, it is premature to \n  suggest that such pr=\r\noofs should be expected at this juncture. &lt;BR&gt;&lt;BR&gt;We use \n  terms like &#39;sug=\r\ngests&#39; and &#39;implies&#39; precisely for this reason. Nothing is \n  known for cer=\r\ntain, and it would be (and is) irresponsible to suggest to the \n  contrary =\r\nat this point. &lt;BR&gt;&lt;BR&gt;What we seek in our models is consistency with \n  ob=\r\nservations. What I have done here is to provide reports of observations \n  =\r\nwhich suggest a coherent link that in turn provides one possible explanatio=\r\nn \n  to the phenomena in question.&lt;BR&gt;&lt;BR&gt;I would suggest that a &quot;proof&quot; mi=\r\nght be \n  had if anyone could describe a condition wherein no belief per se=\r\n were \n  required and the only explanation of a phenomenon were due to disc=\r\narnate \n  activity. This means that no alternative explanation is allowable=\r\n. Hundreds of \n  quite brilliant people have tried for well over a century =\r\nto find this one \n  thing and thus far, have been unsuccessful. &lt;BR&gt;&lt;BR&gt;---=\r\n In &lt;A \n  href=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR=\r\n&gt;.com&lt;/A&gt;, \n  &quot;April Abercrombie&quot; &lt;april@...&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; =\r\nNone of this is \n  proof. None of this evidence say that all, or even most =\r\nEVP&#39;s are caused by \n  PK. You even used words like &quot;potential link&quot; and &quot;s=\r\ntrongly implicates.&quot; This \n  doesn&#39;t mean it is proven.&lt;BR&gt;&gt; &lt;BR&gt;&gt; \n =\r\n ------------&lt;WBR&gt;---------&lt;WBR&gt;---------&lt;WBR&gt;---------&lt;WBR&gt;---------&lt;WBR&gt;-=\r\n--------&lt;WBR&gt;-&lt;BR&gt;&gt; \n  &lt;BR&gt;&gt; &lt;BR&gt;&gt; [Now let&#39;s turn to the evidence=\r\n for PK as an explanation for \n  the EVP. A close colleague of mine, a resp=\r\nected parapsychologist in Los \n  Angeles, was working years ago in a well-k=\r\nnown haunted site in the Hollywood \n  area. He recorded the voice of the ho=\r\nme&#39;s owner, while standing next to the \n  man. During this interval the man=\r\n did not speak; no one heard what was \n  recorded until it was played back.=\r\n This sounds like a classic EVP thus far. \n  The playback was easily heard =\r\nby all. The man recognized his own voice, \n  including swear words; he had =\r\na penchant for swearing in his normal \n  speech.]&lt;BR&gt;&gt; &lt;BR&gt;&gt; Not pers=\r\nonally having seen or heard of any \n  documentation of this experiment, I a=\r\nm skeptical of it. But lets just say it \n  is true and this really happened=\r\n and as portrayed. This still doesn&#39;t prove in \n  any way that most EVP&#39;s a=\r\nre caused by PK. Again, as I said earlier, I am open \n  to the possibility =\r\nthat it might happened in some rare cases.&lt;BR&gt;&gt; &lt;BR&gt;&gt; \n  ------------=\r\n&lt;WBR&gt;---------&lt;WBR&gt;---------&lt;WBR&gt;---------&lt;WBR&gt;---------&lt;WBR&gt;---------&lt;WBR&gt;=\r\n-&lt;BR&gt;&gt; \n  &lt;BR&gt;&gt; &lt;BR&gt;&gt; [This anecdotal story would suggest that PK =\r\ncould be an \n  explanation for EVPs based on this single example alone.]&lt;BR=\r\n&gt;&gt; &lt;BR&gt;&gt; It \n  only suggests that PK *could* have played part on this=\r\n particular case. To say \n  that PK is responsible for most EVP-there has t=\r\no be way more experimentation \n  and testing that renders consistent result=\r\ns.&lt;BR&gt;&gt; &lt;BR&gt;&gt; \n  ------------&lt;WBR&gt;---------&lt;WBR&gt;---------&lt;WBR&gt;-------=\r\n--&lt;WBR&gt;---------&lt;WBR&gt;---------&lt;WBR&gt;-&lt;BR&gt;&gt; \n  &lt;BR&gt;&gt; &lt;BR&gt;&gt; [Lastly w=\r\ne&#39;ll consider a recent experiment by Dr. Dean \n  Radin. In this experiment,=\r\n ...&lt;BR&gt;&gt; &lt;BR&gt;&gt; This implies that \n  retrocausation could be at work =\r\nduring EVP production. And that suggests the \n  involvement of the operator=\r\n as opposed to discarante entities manipulating the \n  environment.&lt;WBR&gt;]&lt;B=\r\nR&gt;&gt; &lt;BR&gt;&gt; I have heard of this experiment. Still, it \n  does not prov=\r\ne that most EVP&#39;s are due to PK. All it *suggests* is that PK \n  itself may=\r\n be possible.&lt;BR&gt;&gt; &lt;BR&gt;&gt; \n  ------------&lt;WBR&gt;---------&lt;WBR&gt;---------&lt;=\r\nWBR&gt;---------&lt;WBR&gt;---------&lt;WBR&gt;---------&lt;WBR&gt;-&lt;BR&gt;&gt; \n  &lt;BR&gt;&gt; &lt;BR&gt;&gt=\r\n; IMO, if it were the case that most EVP&#39;s were caused by PK, \n  we should =\r\nhave been able to prove that by now.&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; ----- \n  Ori=\r\nginal Message ----- &lt;BR&gt;&gt; From: phenom_investigator &lt;BR&gt;&gt; To: &lt;A \n  h=\r\nref=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt; \n=\r\n  &lt;BR&gt;&gt; Sent: Tuesday, October 13, 2009 9:22 AM&lt;BR&gt;&gt; Subject: [EVP-IT=\r\nC] \n  Re: Question for you all&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; Let&#39;s examine the =\r\n\n  supporting evidence a bit more closely. First consider the potential lin=\r\nk \n  between healing and PK. Both phenomena can occur due to a local or dis=\r\ntant \n  agent. Absent healing for example would be the distant analogy to d=\r\nistank or \n  remote PK. Both have been studied in controlled experiments. D=\r\nr Larry Dossy in \n  Texas is one of the primary investigators in healing re=\r\nsearch. Both healing \n  and general PK are reliably observed to be either i=\r\nntentional or spontaneous. \n  So both exhibit similar traits. Both involve =\r\napparent manipulation by the mind \n  of the physical environment. And certa=\r\ninly healing strongly implicates an \n  indirect effect on complex systems. =\r\nSo it makes some sense that the two may \n  indeed be related.&lt;BR&gt;&gt; &lt;BR&gt;&=\r\ngt; Now let&#39;s turn to the evidence for PK as \n  an explanation for the EVP.=\r\n A close colleague of mine, a respected \n  parapsychologist in Los Angeles,=\r\n was working years ago in a well-known haunted \n  site in the Hollywood are=\r\na. He recorded the voice of the home&#39;s owner, while \n  standing next to the=\r\n man. During this interval the man did not speak; no one \n  heard what was =\r\nrecorded until it was played back. This sounds like a classic \n  EVP thus f=\r\nar. The playback was easily heard by all. The man recognized his own \n  voi=\r\nce, including swear words; he had a penchant for swearing in his normal \n  =\r\nspeech. This anecdotal story would suggest that PK could be an explanation =\r\nfor \n  EVPs based on this single example alone. &lt;BR&gt;&gt; &lt;BR&gt;&gt; Lastly we=\r\n&#39;ll \n  consider a recent experiment by Dr. Dean Radin. In this experiment, =\r\nmediators \n  were asked to influence which paths photons would take passing=\r\n through one of \n  two very tiny slits. You would expect this to occur norm=\r\nally by random chance, \n  producing an equal distribution of photons in two=\r\n regions on the target \n  photograph. When uninfluenced, this is exactly wh=\r\nat happened. When the \n  mediator tried to &#39;block&#39; one of the slits, the di=\r\nstribution shifted, \n  indicating success. But this is not what&#39;s important=\r\n - it is necessary \n  background. For the next trial, the machine was turne=\r\nd on and the exposure \n  taken with no influence attempted. In fact, the me=\r\ndiatator was not even \n  present. The following day the mediatator was aske=\r\nd to influence the machine. \n  He was not told the machine was turned off a=\r\nnd could not even record at that \n  time. The next day the image was inspec=\r\nted for the first time - the meditator \n  again was not present. The image =\r\nrevealed a pattern similar to the one \n  produced when the mediatator succe=\r\nssfully &quot;blocked&quot; the slit in the first \n  trial. Theoretical physicst Dr. =\r\nRichard Stroup suggested this indicated to him \n  a demonstration of what h=\r\ne calls &quot;retrocausation&quot; - a notion in theoretical \n  physics that the futu=\r\nre actually impacts on the past (as well as the past \n  impacting the futur=\r\ne as most people believe). Dr. Radin raised an interesting \n  point with re=\r\nspect to designing experiments. He now wonders if investigators \n  are so e=\r\nntangled with experiments that they unwittingly can influence outcomes \n  e=\r\nven before the experiment is designed. Remember, these are trained \n  acade=\r\nmicians at the top of their respective fields. &lt;BR&gt;&gt; &lt;BR&gt;&gt; This \n  im=\r\nplies that retrocausation could be at work during EVP production. And that =\r\n\n  suggests the involvement of the operator as opposed to discarante entiti=\r\nes \n  manipulating the environment.&lt;BR&gt;&gt; &lt;BR&gt;&gt; I have no problem with=\r\n the \n  notion that external influences may indeed in some way mediate what=\r\n is done; I \n  simply wonder if they are really manipulating sound directly=\r\n.&lt;BR&gt;&gt; &lt;BR&gt;&gt; \n  This is what I could consider the evidence for the po=\r\nsition I stated.&lt;BR&gt;&gt; \n  &lt;BR&gt;&gt; --- In &lt;A \n  href=3D&quot;mailto:EVP-ITC%40=\r\nyahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;, \n  &quot;April Abercrombie&quot; &=\r\nlt;april@&gt; wrote:&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt; Personal \n  experience, and =\r\nlack of supporting evidence is why I disagree about PK being \n  responsible=\r\n for most EVPs.&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; I am open to the \n  possibility =\r\nthat it might be possible, however it would have to be a very rare \n  occur=\r\nrence.&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; ----- Original Message \n  -=\r\n---- &lt;BR&gt;&gt; &gt; From: phenom_investigator &lt;BR&gt;&gt; &gt; To: &lt;A \n  href=\r\n=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt; \n  &lt;=\r\nBR&gt;&gt; &gt; Sent: Sunday, October 11, 2009 1:30 PM&lt;BR&gt;&gt; &gt; Subject: \n=\r\n  [EVP-ITC] Re: Question for you all&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &g=\r\nt; \n  Why do you disagree that PK is responsible for most true EVPs? &lt;BR&gt;&g=\r\nt; &gt; \n  What about EVPs and/or PK tells you this might be so?&lt;BR&gt;&gt; &g=\r\nt; &lt;BR&gt;&gt; \n  &gt; --- In &lt;A \n  href=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;=\r\nEVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;, \n  &quot;April Abercrombie&quot; &lt;april@&gt; wro=\r\nte:&lt;BR&gt;&gt; &gt; &gt;&lt;BR&gt;&gt; &gt; &gt; \n  I agree in that much of EVP is j=\r\nust pareidolia, or the listener hearing what \n  he wants to hear. But I dis=\r\nagree in that PK is responsible for most true \n  EVPs.&lt;BR&gt;&gt; &gt; &gt; &lt;B=\r\nR&gt;&gt; &gt; &gt; ----- Original Message ----- \n  &lt;BR&gt;&gt; &gt; &gt; From: p=\r\nhenom_investigator &lt;BR&gt;&gt; &gt; &gt; To: &lt;A \n  href=3D&quot;mailto:EVP-ITC%40ya=\r\nhoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt; \n  &lt;BR&gt;&gt; &gt; &gt; Sent:=\r\n Saturday, October 10, 2009 7:09 AM&lt;BR&gt;&gt; &gt; &gt; \n  Subject: [EVP-ITC]=\r\n Re: Question for you all&lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; \n  &gt; &lt;BR&gt;&gt; =\r\n&gt; &gt; If we presume that much of what is heard is in fact \n  the result=\r\n of personal PK and not a discarnate voice, we may have an answer to \n  the=\r\n question of why some sourcse communicate and others do not.&lt;BR&gt;&gt; &gt; \n=\r\n  &gt; &lt;BR&gt;&gt; &gt; &gt; I would suggest that while the operator may produ=\r\nce \n  the voice phenomena, that operator may indeed be influenced by extern=\r\nal \n  agents. This could include discarnate agents. &lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;=\r\n&gt; &gt; \n  &gt; When you carefully consider what is being heard, the them=\r\nes often seem to \n  reflect what may be subconscious concerns of the operat=\r\nor or the listener. If \n  external sources additionally inform this process=\r\n of perception, it is quite \n  possible they influence both what is recorde=\r\nd and how is later perceived. This \n  would also nicely explain why some pe=\r\nople hear the same things on a recording \n  while others hear quite differe=\r\nnt things and more importantly while one person \n  hears different things f=\r\nrom the same recording at different times.&lt;BR&gt;&gt; \n  &gt; &gt; &lt;BR&gt;&gt; &g=\r\nt; &gt; It would also remove the requirement that \n  discarnates manifest t=\r\nhe phenomena. If discarnates are indeed non-physical, it \n  is unclear how =\r\nthey would modify the physical world. On the other hand, we \n  have good ev=\r\nidence demonstrating the ability of living individuals to alter \n  their en=\r\nvironments in profound ways, apparently with their minds. So it seems \n  to=\r\n make more sense that this might indeed by the underlying mechanism to EVPs=\r\n \n  rather than discarnate manipulations.&lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &=\r\ngt; --- \n  In &lt;A \n  href=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoo=\r\ngroups&lt;WBR&gt;.com&lt;/A&gt;, \n  &quot;mrscaptainjack2&quot; &lt;jjkamp@&gt; wrote:&lt;BR&gt;&gt; &g=\r\nt; &gt; &gt;I&#39;m wondering \n  if a haunting-type situation such as yours wou=\r\nld be different from talking to \n  your ancestors four or five generations =\r\nback? I guess I&#39;m just wondering out \n  loud what makes us connect with som=\r\ne entities, no matter how obscure or \n  nonexistent the connection, and not=\r\n others? What makes some &quot;tune in&quot; to talk \n  to us, or hang around on a pl=\r\nane closest to us...or what? At least in a \n  haunting, you&#39;d be getting th=\r\ne entity that happened to reside at that \n  location.&lt;BR&gt;&gt; &gt; &gt; &gt=\r\n; &lt;BR&gt;&gt; &gt; &gt; &gt; Never mind me, guys. \n  I just have this driving =\r\nneed to understand how all this works, and I don&#39;t \n  think it&#39;s possible.&lt;=\r\nBR&gt;&gt; &gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &gt; \n  Jill&lt;BR&gt;&gt; &gt; &gt; &g=\r\nt; &lt;BR&gt;&gt; &gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &gt; \n  &lt;BR&gt;&gt; &gt; &gt; &g=\r\nt; --- In &lt;A \n  href=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogrou=\r\nps&lt;WBR&gt;.com&lt;/A&gt;, \n  &quot;purplespacefriend&quot; &lt;purplealiengirl@&lt;WBR&gt;&gt; wrote=\r\n:&lt;BR&gt;&gt; &gt; &gt; \n  &gt; &gt;&lt;BR&gt;&gt; &gt; &gt; &gt; &gt; &lt;BR&gt;&gt; &gt; =\r\n&gt; &gt; &gt; Capericus. \n  Nicolaus Copernicus (1473-1543) &lt;BR&gt;&gt; &gt; =\r\n&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; \n  &gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &gt; &gt;=\r\n F-S&lt;BR&gt;&gt; &gt; &gt; &gt; &gt; \n  &lt;BR&gt;&gt; &gt; &gt; &gt; &gt; &lt;BR&gt;&gt; &=\r\ngt; &gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; \n  &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &gt; =\r\n&gt; --- In &lt;A \n  href=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogr=\r\noups&lt;WBR&gt;.com&lt;/A&gt;, \n  &quot;mrscaptainjack2&quot; &lt;jjkamp@&gt; wrote:&lt;BR&gt;&gt; &gt;=\r\n &gt; &gt; &gt; \n  &gt;&lt;BR&gt;&gt; &gt; &gt; &gt; &gt; &gt; Those of you who h=\r\nave contacted entities \n  claiming to be dead people, what is the oldest pe=\r\nrson you&#39;ve spoken to (in \n  terms of how long ago they died)?&lt;BR&gt;&gt; &gt;=\r\n &gt; &gt; &gt; &gt; &lt;BR&gt;&gt; \n  &gt; &gt; &gt; &gt; &gt; I&#39;m wondering bec=\r\nause my great uncle has been coming \n  through a lot, and he was murdered i=\r\nn 1942. Since I wasn&#39;t born until decades \n  later, I never knew him, but I=\r\n do understand that people come through we did \n  not know in life. Has any=\r\none else contacted someone claiming to have lived \n  that far back? Or in a=\r\nnother lifetime entirely?&lt;BR&gt;&gt; &gt; &gt; &gt; &gt; \n  &gt;&lt;BR&gt;&gt; &gt; =\r\n&gt; &gt; &gt;&lt;BR&gt;&gt; &gt; &gt; &gt;&lt;BR&gt;&gt; &gt; \n  &gt;&lt;BR&gt;&gt; &gt;&lt;BR&gt;=\r\n&gt;&lt;BR&gt;&lt;BR&gt;&lt;/P&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BODY&gt;&lt;/HTML&gt;\n\r\n------=_NextPart_000_01B3_01CA4D8F.A206D7E0--"}