{"id": "16246", "subject": "Re: Stupid question", "author": "mrscaptainjack2", "timestamp": "2009-11-03T20:15:53Z", "full_text": "I wondered if it was something weird like that, because the voice was constant even though the sweep was clicking away.  There were four of us in the car listening to it, and none of us could understand a word of it.  Of course no tape recorder running in the car, so no chance to go back and listen again.  The responses did seem to directly correlate to the questions we asked, e.g. the Russian stuff came right after we asked a question, and if we didn&#39;t ask a question, it was silent and we got normal radio snippets.  Really interesting.  Too bad the location where we were driving is two hours away, or I&#39;d be back there, trying it again to see if I could duplicate the happening.\n\nYes, I think it&#39;s crazy to say we know who these entities are.  I think it&#39;s safe to say that many or most are either dead people, or entities pretending to be dead people, but who really knows?  I just know that something is there.\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  Several months ago(maybe last year) I got a &quot;level&quot; that was all Russian accent voices, and they even called themselve &quot;soviets&quot;, but they spoke in English. There&#39;s not just the one ghost level, there&#39;s an almost infinite number of levels or demensions that come through the boxes depending on what the conditions are. The conditions being something similar to radio propogation on this level, but I don&#39;t know how you could measure it, or predict where the signals were coming from with the boxes. If you can hear the radio continue to sweep, yet the voices remain constant, I&#39;m pretty sure that is not &quot;normal&quot; radio. I think there is an RF component to the voices, and some entities transmit &quot;something&quot;.\n&gt; \n&gt;  These experts out there would have us believe that EVP is just &quot;so and so&quot; or such and such,  all well understood, and it happens in only one way. All totally explained! There&#39;s people out there writting books by the dozen that want everyone to think they are the experts and know how all this paranormal stuff works. They don&#39;t know squat! They act like even me, the one that made the stupid box in the first place, has no understanding of what it does or how it works. God forbid I should contradict the experts--the ones making money off the Hollywood version of ghosts and hauntings! Anything that does contradict the accepted norms is either ignored, or ridiculed. Mostly the experts ignore me--yet want the latest box version to show off---not use.\n&gt; \n&gt;  Ok, jump off my soap box!\n&gt; \n&gt;  F-S  \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;mrscaptainjack2&quot; &lt;jjkamp@&gt; wrote:\n&gt; &gt;\n&gt; &gt; I was on a long road trip today with some friends, and just for fun to kill time, we pulled out the box.  We got some responses that were long sentences, all in one voice, in what sounded like Russian -- like a Russian radio station.  But I could hear the clicks as the sweep kept going.  Is it possible, if you are close to a tower or something, to pick up such a strong signal that you get long, loud complete sentences from newscasters?  (This was AM radio.)\n&gt; &gt;\n&gt;"}