{"id": "16323", "subject": "Re: [EVP-ITC] Fw: Does Nibiru Realy Exist?", "author": "Green Metal Recycling", "timestamp": "2009-11-24T22:11:35Z", "full_text": "--0-1497906717-1259100695=:88371\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nAbout 15 years ago i saw a map of our solar system in an older 60&#39;s or 70&#39;s=\r\n Encyclopedia Britannica it showed that we have two suns, one is burned out=\r\n or dead and planet x orbits around these two suns about every 26,000 years=\r\n.=C2=A0\nDavid\n--- On Tue, 11/24/09, April Abercrombie &lt;april@abercrombiegho=\r\nstresearch.com&gt; wrote:\n\n\nFrom: April Abercrombie &lt;april@abercrombieghostres=\r\nearch.com&gt;\nSubject: [EVP-ITC] Fw: Does Nibiru Realy Exist?\nTo: &quot;EVP-ITC Gro=\r\nup&quot; &lt;EVP-ITC@yahoogroups.com&gt;\nDate: Tuesday, November 24, 2009, 2:33 PM\n\n\n=\r\n=C2=A0 \n\n\n\n\n=C2=A0\nNibiru - Armageddon Planet or Astronomical Baloney?\nMy T=\r\nake: Conspiracy theorists are convinced that a rogue planet is bound to doo=\r\nm Earth in 2012. NASA astronomer David Morrison gives his take.\n\n\n \nWed Oct=\r\n 01, 2008 06:59 PM ET | content provided by David Morrison \n=C2=A0\n\n\n \nThe =\r\nancient Mesopotamians predicted Nibiru? Don&#39;t bet on it.\nNASA\n\n\nThe scoop: =\r\nConspiracy theorists are convinced a rogue planet will destroy the Earth in=\r\n 2012, and just as we are about to see the release of a Hollywood movie on =\r\nthe topic, the hype is set to increase. David Morrison, a NASA astrobiologi=\r\nst and expert scientist for NASA&#39;s Ask an Astrobiologist website, calls for=\r\n a reality check and in 2008 he contributed this article to Discovery News.=\r\n\nUnbeknownst to most of us, a small but vocal group of conspiracy theorists=\r\n is convinced that a rogue planet is about to enter the inner solar system =\r\nand doom the Earth.\nThey say that this threatening planet on a 3600-year or=\r\nbit was discovered by the ancient Mesopotamians, who named it Nibiru, and i=\r\nt was known also to the Mayans, who associated it with the end of their cal=\r\nendar &quot;long count&quot; in December 2012. In Web sites, blogs, and radio talk sh=\r\nows, they insist that NASA is tracking Nibiru -- but that this information =\r\nis being kept from the public as part of a worldwide conspiracy.\nThey say t=\r\nhe official silence can&#39;t be maintained for much longer, however, because b=\r\ny 2009 Nibiru will be visible to the naked eye from the southern hemisphere=\r\n. They also say Earth&#39;s axis is already tilting and the length of the day i=\r\ns changing under its influence. As one believer recently wrote to me, &quot;Why =\r\nare you lying. It&#39;s coming, and everyone knows it.&quot;\nI began to receive ques=\r\ntions about this bizarre story in December 2007 through NASA&#39;s &quot;Ask an Astr=\r\nobiologist&quot; site. Normally I receive up to a dozen questions per week from =\r\nthe public, dealing mostly with life in the universe -- but in the past 6 m=\r\nonths the Nibiru traffic alone has grown to 20-25 messages a week, ranging =\r\nfrom the anguished &quot;I can&#39;t sleep,&quot; &quot;I am really scared&quot; or &quot;I don&#39;t want t=\r\no die&quot; to the abusive &quot;you are putting my family at risk&quot; and &quot;if NASA deni=\r\nes it then it must be true.&quot;\nAs a scientist, I&#39;m both fascinated and astoni=\r\nshed by the deluge of questions from people who are genuinely frightened an=\r\nd, apparently, unable to distinguish astronomical fact from fiction. They&#39;r=\r\ne watching YouTube videos and visiting slick Web sites with nothing in thei=\r\nr skeptical toolkit, or to quote Carl Sagan no &quot;baloney detector.&quot; Now a bl=\r\nockbuster disaster film called &quot;2012&quot; is set for release in the summer of 2=\r\n009, and the commercial enterprise is clearly trying to cash in on people&#39;s=\r\n concern (perhaps contributing to their fear as well).\nMy guess is that onl=\r\ny a tiny fraction of people truly believes that Armageddon is coming in Dec=\r\nember 2012. But their uncritical acceptance of this story worries me as a w=\r\narning of the dangers of our current scientific illiteracy.\nWe&#39;re facing mo=\r\nnumental problems with global warming and loss of habitat, yet a substantia=\r\nl minority of Americans thinks the world was formed less than 10,000 years =\r\nago and deny that evolution is possible. Many Americans seem to prefer coal=\r\n-fired generators to nuclear power plants without realizing the toll in pub=\r\nlic health that coal imposes. Billions are spent, including tax-payer dolla=\r\nrs, for so-called alternative medicine with no scientific evidence for its =\r\nefficacy. And legislators often resist efforts to collect the data that cou=\r\nld actually demonstrate which government programs are effective and which o=\r\nnes don&#39;t work as intended.\nIn spite of my frustrations, I can always hope =\r\nthat Nibiru will turn into a teaching moment. Its proponents are convinced =\r\nthat it will be visible to the unaided eye this coming spring, and its effe=\r\ncts on the rotation and orbit of the Earth will be obvious by summer (just =\r\nin time for the release of the film &quot;2012&quot;). When none of this happens, I h=\r\nope they&#39;ll realize that they need better tools to distinguish fact from fi=\r\nction.\n\n\n\n\n\n\n\n      \r\n--0-1497906717-1259100695=:88371\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;About 15 years ago i saw a map of our solar s=\r\nystem in an older 60&#39;s or 70&#39;s Encyclopedia Britannica it showed that we ha=\r\nve two suns, one is burned out or dead and planet x orbits around these two=\r\n suns about every 26,000 years.&nbsp;&lt;BR&gt;David&lt;BR&gt;--- On &lt;B&gt;Tue, 11/24/09, =\r\nApril Abercrombie &lt;I&gt;&lt;april@...&gt;&lt;/I&gt;&lt;/B&gt; wro=\r\nte:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: rgb(16,16,255) 2px solid; PADDING=\r\n-LEFT: 5px; MARGIN-LEFT: 5px&quot;&gt;&lt;BR&gt;From: April Abercrombie &lt;april@abercro=\r\nmbieghostresearch.com&gt;&lt;BR&gt;Subject: [EVP-ITC] Fw: Does Nibiru Realy Exist=\r\n?&lt;BR&gt;To: &quot;EVP-ITC Group&quot; &lt;EVP-ITC@yahoogroups.com&gt;&lt;BR&gt;Date: Tuesday, =\r\nNovember 24, 2009, 2:33 PM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3Dyiv1393433046&gt;&lt;SPAN style=3D&quot;D=\r\nISPLAY: none&quot;&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV id=3Dygrp-text&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D2=\r\n face=3D&quot;Myriad Pro&quot;&gt;&nbsp;&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;H1&gt;Nibiru - Armageddon Planet or =\r\nAstronomical Baloney?&lt;/H1&gt;\n&lt;H2&gt;My Take: Conspiracy theorists are convinced =\r\nthat a rogue planet is bound to doom Earth in 2012. NASA astronomer David M=\r\norrison gives his take.&lt;/H2&gt;\n&lt;DD class=3Dentitlement&gt;\n&lt;DIV id=3Dad-entitlem=\r\nent&gt;\n&lt;DIV id=3Dpage-ad-container-Top3&gt;&lt;A href=3D&quot;http://omnikool.discovery.=\r\ncom/RealMedia/ads/click_lx.ads/news.discovery.com/space/david-morrison-nibi=\r\nru-2012.html/2017163281/Top3/default/empty.gif/59585965675571416c5838414271=\r\n622b?x&quot; rel=3Dnofollow target=3D_blank&gt;&lt;IMG border=3D0 alt=3D&quot;&quot; src=3D&quot;http=\r\n://imagec12.247realmedia.com/RealMedia/ads/Creatives/default/empty.gif&quot; wid=\r\nth=3D1 height=3D1&gt;&lt;/A&gt; &lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV class=3Dinformation&gt;Wed Oct 01, 20=\r\n08 06:59 PM ET | content provided by &lt;A href=3D&quot;http://astrobiology.nasa.go=\r\nv/ask-an-astrobiologist/&quot; rel=3Dnofollow target=3D_blank&gt;David Morrison&lt;/A&gt;=\r\n &lt;/DIV&gt;\n&lt;DIV class=3Dinformation&gt;&lt;FONT size=3D2 face=3D&quot;Myriad Pro&quot;&gt;&lt;/FONT&gt;=\r\n&nbsp;&lt;/DIV&gt;\n&lt;DIV id=3Darticle-body&gt;\n&lt;DIV id=3Dmedia-blocks&gt;\n&lt;DIV class=3Dp=\r\nhoto&gt;&lt;IMG title=3D&quot;The ancient Mesopotamians predicted Nibiru? Don&#39;t bet on=\r\n it.&quot; alt=3D&quot;The ancient Mesopotamians predicted Nibiru? Don&#39;t bet on it.&quot; =\r\nsrc=3D&quot;http://news.discovery.com/space/2008/10/18/2012-nibiru-278x225.jpg&quot;&gt;=\r\n \n&lt;DIV&gt;&lt;SPAN class=3Dcaption&gt;The ancient Mesopotamians predicted Nibiru? Do=\r\nn&#39;t bet on it.&lt;/SPAN&gt;&lt;BR&gt;&lt;EM class=3Dphoto-credits&gt;NASA&lt;/EM&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV=\r\n&gt;&lt;/DIV&gt;\n&lt;DIV id=3Dbody-copy&gt;\n&lt;DIV&gt;The scoop: &lt;EM&gt;Conspiracy theorists are c=\r\nonvinced a rogue planet will destroy the Earth in 2012, and just as we are =\r\nabout to see the release of a Hollywood movie on the topic, the hype is set=\r\n to increase. David Morrison, a NASA astrobiologist and expert scientist fo=\r\nr NASA&#39;s &lt;A href=3D&quot;http://astrobiology.nasa.gov/ask-an-astrobiologist/intr=\r\no/nibiru-and-doomsday-2012-questions-and-answers&quot; rel=3Dnofollow target=3D_=\r\nblank&gt;Ask an Astrobiologist website&lt;/A&gt;, calls for a reality check and in 2=\r\n008 he contributed this article to Discovery News.&lt;/EM&gt;&lt;/DIV&gt;\n&lt;DIV&gt;Unbeknow=\r\nnst to most of us, a small but vocal group of conspiracy theorists is convi=\r\nnced that a rogue planet is about to enter the inner solar system and doom =\r\nthe Earth.&lt;/DIV&gt;\n&lt;DIV&gt;They say that this threatening planet on a 3600-year =\r\norbit was discovered by the ancient Mesopotamians, who named it Nibiru, and=\r\n it was known also to the Mayans, who associated it with the end of their c=\r\nalendar &quot;long count&quot; in December 2012. In Web sites, blogs, and radio talk =\r\nshows, they insist that &lt;A href=3D&quot;http://dsc.discovery.com/space/my-take/n=\r\nasa-50th-birthday.html&quot; rel=3Dnofollow target=3D_blank&gt;NASA&lt;/A&gt; is tracking=\r\n Nibiru -- but that this information is being kept from the public as part =\r\nof a worldwide conspiracy.&lt;/DIV&gt;\n&lt;DIV&gt;They say the official silence can&#39;t b=\r\ne maintained for much longer, however, because by 2009 Nibiru will be visib=\r\nle to the naked eye from the southern hemisphere. They also say Earth&#39;s axi=\r\ns is already tilting and the length of the day is changing under its influe=\r\nnce. As one believer recently wrote to me, &quot;Why are you lying. It&#39;s coming,=\r\n and everyone knows it.&quot;&lt;/DIV&gt;\n&lt;DIV&gt;I began to receive questions about this=\r\n bizarre story in December 2007 through NASA&#39;s &quot;&lt;A href=3D&quot;http://astrobiol=\r\nogy.nasa.gov/ask-an-astrobiologist/&quot; rel=3Dnofollow target=3D_blank&gt;Ask an =\r\nAstrobiologist&lt;/A&gt;&quot; site. Normally I receive up to a dozen questions per we=\r\nek from the public, dealing mostly with life in the universe -- but in the =\r\npast 6 months the Nibiru traffic alone has grown to 20-25 messages a week, =\r\nranging from the anguished &quot;I can&#39;t sleep,&quot; &quot;I am really scared&quot; or &quot;I don&#39;=\r\nt want to die&quot; to the abusive &quot;you are putting my family at risk&quot; and &quot;if N=\r\nASA denies it then it must be true.&quot;&lt;/DIV&gt;\n&lt;DIV&gt;As a scientist, I&#39;m both fa=\r\nscinated and astonished by the deluge of questions from people who are genu=\r\ninely frightened and, apparently, unable to distinguish astronomical fact f=\r\nrom fiction. They&#39;re watching &lt;A href=3D&quot;http://www.youtube.com/watch?v=3Dm=\r\nkv4chj47XY&quot; rel=3Dnofollow target=3D_blank&gt;YouTube videos&lt;/A&gt; and visiting =\r\nslick Web sites with nothing in their skeptical toolkit, or to quote Carl S=\r\nagan no &quot;baloney detector.&quot; Now a blockbuster disaster film called &quot;2012&quot; i=\r\ns set for release in the summer of 2009, and the commercial enterprise is c=\r\nlearly trying to cash in on people&#39;s concern (perhaps contributing to their=\r\n fear as well).&lt;/DIV&gt;\n&lt;DIV&gt;My guess is that only a tiny fraction of people =\r\ntruly believes that Armageddon is coming in December 2012. But their uncrit=\r\nical acceptance of this story worries me as a warning of the dangers of our=\r\n current scientific illiteracy.&lt;/DIV&gt;\n&lt;DIV&gt;We&#39;re facing monumental problems=\r\n with global warming and loss of habitat, yet a substantial minority of Ame=\r\nricans thinks the world was formed less than 10,000 years ago and deny that=\r\n evolution is possible. Many Americans seem to prefer coal-fired generators=\r\n to nuclear power plants without realizing the toll in public health that c=\r\noal imposes. Billions are spent, including tax-payer dollars, for so-called=\r\n alternative medicine with no scientific evidence for its efficacy. And leg=\r\nislators often resist efforts to collect the data that could actually demon=\r\nstrate which government programs are effective and which ones don&#39;t work as=\r\n intended.&lt;/DIV&gt;\n&lt;DIV&gt;In spite of my frustrations, I can always hope that N=\r\nibiru will turn into a teaching moment. Its proponents are convinced that i=\r\nt will be visible to the unaided eye this coming spring, and its effects on=\r\n the rotation and orbit of the Earth will be obvious by summer (just in tim=\r\ne for the release of the film &quot;2012&quot;). When none of this happens, I hope th=\r\ney&#39;ll realize that they need better tools to distinguish fact from fiction.=\r\n&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DD&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n   =\r\n   \r\n--0-1497906717-1259100695=:88371--"}