{"id": "16334", "subject": "Re: [EVP-ITC] Hertz vs Gauss, Attention RJ, oranyone else who may \tknow", "author": "Zack Widup", "timestamp": "2009-11-25T23:40:46Z", "full_text": "The unit now called Hertz was formerly called cycles per second, and is the\nfrequency of an electromagnetic signal. For instance, WLS radio in Chicago\noperates on a frequency of 890 kilohertz.\n\nA Gauss is a unit of magnetic field strength. It is not a measure of\nelectric or electromagnetic field strength, only the magnetic component.\nZack\n\n\nOn Wed, Nov 25, 2009 at 3:33 PM, April Abercrombie &lt;\napril@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Recently someone asked me the following question:\n&gt;\n&gt; *[I am brand new to the world of paranormal investigation. I believe I\n&gt; have a good grasp on what hertz and gauss measurments are, however am\n&gt; confused as to all of the differences between them. Hertz has more to do\n&gt; with the complete cycles per second and gauss is the strength of an EMF. I\n&gt; guess where I am fuzzy is in my lack of physics. I thought frequency is also\n&gt; a measurment of strength. I may not be making much sense here, but can you\n&gt; tell me where I am missing somthing?]*\n&gt;\n&gt; My answer was that I wasn&#39;t entirely sure myself but I think that Hertz\n&gt; measures the wave frequencies of the entire electromagnetic spectrum. Gauss\n&gt; only measures the intensity or strength of EMF generated around these wave\n&gt; frequencies. Depending on the range of hertz, an EMF is generated.\n&gt;\n&gt; I told him that I would check around with other people in the field to make\n&gt; sure.\n&gt;\n&gt; Was I correct?\n&gt;\n&gt; Thanks!\n&gt; April\n&gt;\n&gt;\n&gt;\n&gt; \n&gt;\n\nThe uni now called He z was o me ly called cycles pe second, and is he equency o an elec omagne ic signal. Fo ins ance, WLS adio in Chicago ope a es on a equency o 890 kilohe z.\n \nA Gauss is a uni o magne ic ield s eng h. I is no a measu e o elec ic o elec omagne ic ield s eng h, only he magne ic componen .\nZack\n \nOn Wed, No 25, 2009 a 3:33 PM, Ap il Abe c ombie ap il@...> w o e:\n\n  \n\n\n\n\nRecen ly someone asked me he ollowing ques ion:\n \n[I am b and new o he wo ld o pa ano mal in es iga ion. I belie e I ha e a good g asp on wha he z and gauss measu men s a e, howe e am con used as o all o he di e ences be ween hem. He z has mo e o do wi h he comple e cycles pe second and gauss is he s eng h o an EMF. I guess whe e I am uzzy is in my lack o physics. I hough equency is also a measu men o s eng h. I may no be making much sense he e, bu can you ell me whe e I am missing som hing?]\n\n \nMy answe was ha I wasn' en i ely su e mysel bu I hink  ha  He z measu es he wa e equencies o he en i e elec omagne ic spec um. Gauss only measu es he in ensi y o s eng h o  EMF gene a ed a ound hese wa e equencies. Depending on  he ange o he z, an EMF is gene a ed.\n\n \nI old him ha I would check a ound wi h o he people in he ield o make su e.\n \nWas I co ec ?\n \nThanks!\nAp il"}