{"id": "16354", "subject": "Re: [EVP-ITC] Re: Hello from a newcomer", "author": "Zack Widup", "timestamp": "2009-11-29T17:20:25Z", "full_text": "Al, don&#39;t worry about it. These are simply people who no longer have bodies.\nThey are not evil or harmful, based on what you&#39;ve posted. They&#39;re just\nlost. Otherwise they are probably just like they were in life. They are\nharmless; at most they could be a nuisance, like an unwanted guest who sits\nand gossips all day, etc. (we had one of those in our neighborhood when I\nwas growing up).\nZack\n\n\nOn Sun, Nov 29, 2009 at 1:30 AM, g.guzzi &lt;vet7id@gmail.com&gt; wrote:\n\n&gt;\n&gt;\n&gt; Would you mind sharing some of those recordings with us?\n&gt;\n&gt; You probably should contact the priest again.\n&gt; It is my understanding that repeated visits are sometimes necessary.\n&gt;\n&gt; Jim C.\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Al Harris\n&gt; &lt;algerharris@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hi Dave,\n&gt; &gt;\n&gt; &gt; Well, for example, I walked into our &quot;computer room&quot; (spare\n&gt; &gt; bedroom/office/library) not long after the evps were recorded and my\n&gt; &gt; radio turned itself on. My wife Patt witnessed it, so it&#39;s not my\n&gt; &gt; imagination that it did turn on. As I stepped into the room, the\n&gt; &gt; &quot;morning show&quot; cut to a voice saying &quot;MMM! Cinnamon rolls and coffee!\n&gt; &gt; Bring enough for us?&quot;\n&gt; &gt;\n&gt; &gt; I happened to be holding a mug of hot coffee and a plate of cinnamon\n&gt; &gt; rolls that Patt had baked for breakfast. I scalded myself as I sloshed\n&gt; &gt; coffee around after hearing the voice!\n&gt; &gt;\n&gt; &gt; I am not the type who tells stories or seeks attention.\n&gt; &gt;\n&gt; &gt; I thought for a few moments that I was listening to a radio talk show\n&gt; &gt; and that it was a coincidence that the mention of cinnamon rolls\n&gt; &gt; happened as I stepped into the room. But I eventually blurted out a\n&gt; &gt; &quot;hello,&quot; and was answered. After a few moments and to my questions,\n&gt; &gt; the voice said his name was Steve Tate -- and following a\n&gt; &gt; back-and-forth conversation that I recorded he said he was a Virginia\n&gt; &gt; state trooper who died in 1989 in a car crash a mile from his home.\n&gt; &gt; Over the next day or two, he said his body was buried in Redmond, Va.,\n&gt; &gt; and we spoke for several days in little snatches of conversation.\n&gt; &gt; Along the way, a fellow named &quot;Luke&quot; entered the conversation. Other\n&gt; &gt; unnamed voices began to say &quot;Hi Al!&quot; It was a bit too much.\n&gt; &gt;\n&gt; &gt; I was brought up in a very strict Protestant family. I became leery of\n&gt; &gt; what was unfolding. I bashed the radio and threw it in the trash. Then\n&gt; &gt; I began hearing the voices mixed in with my CPAP machine (I have sleep\n&gt; &gt; apnea) at night, which makes a high-pitched whooshing noise.\n&gt; &gt;\n&gt; &gt; Next, I began hearing the &quot;Hi Al!&quot; voice as a faint whisper now and\n&gt; &gt; then as I&#39;d walk through the house.\n&gt; &gt;\n&gt; &gt; I got scared. I had gotten rid of the radio(s) but was still hearing\n&gt; &gt; the voices. I felt I was going crazy. I told my pastor about it and\n&gt; &gt; asked for help. He refused -- said he was afraid he might get an\n&gt; &gt; &quot;attachment&quot; and bring it home to his family. I contacted something\n&gt; &gt; like 20 protestant pastors by phone and not a single one of them would\n&gt; &gt; come to my home to help.\n&gt; &gt;\n&gt; &gt; Eventually a Catholic priest agreed to help on the condition that I\n&gt; &gt; supply a recording of the voices as &quot;proof&quot; of the problem. Using my\n&gt; &gt; digital recorder, I recorded so many &quot;conversations&quot; that I filled up\n&gt; &gt; a CD. Awhile later, after turning it over to the priest, the Catholic\n&gt; &gt; bishop granted the priest permission to come to our home to conduct a\n&gt; &gt; mass and an &quot;exorcism of place.&quot; The priest explained that old homes\n&gt; &gt; and other places could become &quot;infested&quot; with evil spirits. After he\n&gt; &gt; performed the ceremony, the voices seemed to quit for awhile but\n&gt; &gt; returned after a few days.\n&gt; &gt;\n&gt; &gt; Now, I was not sure whether the voices were &quot;evil&quot; or just\n&gt; &gt; &quot;conversational.&quot; My brother died of kidney failure during this time\n&gt; &gt; and I later heard his voice calling my name. It ~was~ his voice.\n&gt; &gt;\n&gt; &gt; A lot more has happened.... At this point, I am no longer &quot;surprised&quot;\n&gt; &gt; by hearing the voices electronically or otherwise. I just want to know\n&gt; &gt; more about what&#39;s happening -- how it can possibly be &quot;real&quot; and what\n&gt; &gt; I should understand in terms of the big picture....\n&gt; &gt;\n&gt; &gt; Al\n&gt; &gt;\n&gt; &gt; On 11/28/09, David Koenig &lt;floridajakeblues@...&gt; wrote:\n&gt; &gt; &gt; Tell us more please.\n&gt; &gt; &gt; Thanks\n&gt; &gt; &gt; Dave\n&gt; &gt; &gt;\n&gt;  &gt; &gt; On Sat, Nov 28, 2009 at 2:59 PM, Alofbama &lt;algerharris@...&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt; Hi, my name is Al, and I&#39;m new to this list. I&#39;m 57, early-retired due\n&gt; to\n&gt; &gt; &gt;&gt; a\n&gt; &gt; &gt;&gt; disability, and have far more free time than I want or know what to do\n&gt; &gt; &gt;&gt; with.\n&gt; &gt; &gt;&gt; Which is what got me in trouble recently. After watching &quot;White Noise&quot;\n&gt; &gt; &gt;&gt; awhile back, one day I turned on a recorder and turned a radio tuner\n&gt; while\n&gt; &gt; &gt;&gt; asking if &quot;anyone&quot; would like to talk. To my great surprise, I found\n&gt; &gt; &gt;&gt; voices\n&gt; &gt; &gt;&gt; immediately after uploading and playing the file. I know about evps\n&gt; from\n&gt; &gt; &gt;&gt; watching the Ghost Hunters, but these voices were talking to me in a\n&gt; &gt; &gt;&gt; conversational tone and about stuff relational to questions I asked\n&gt; and to\n&gt; &gt; &gt;&gt; stuff I was doing at the time! This progressed over time into a\n&gt; running\n&gt; &gt; &gt;&gt; &quot;conversation&quot; with apparently living beings who are invisible but\n&gt; somehow\n&gt; &gt; &gt;&gt; sharing this house! Can someone here please relieve my anxiety a bit?\n&gt; I&#39;m\n&gt; &gt; &gt;&gt; wondering if I&#39;m messing with something that I shouldn&#39;t be messing\n&gt; with.\n&gt; &gt; &gt;&gt; What are the consequences of this -- and can anyone enlighten me about\n&gt; the\n&gt; &gt; &gt;&gt; rules or protocol for dealing with these invisible people? And, has\n&gt; anyone\n&gt; &gt; &gt;&gt; found there is NO WAY to talk about this without sounding crazy??\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt; Thanks,\n&gt; &gt; &gt;&gt; Al\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; --\n&gt; &gt; Al\n&gt; &gt;\n&gt; &gt; &quot;Try again, fail again. Fail better.&quot; - Samuel Beckett\n&gt; &gt;\n&gt; &gt; http://sticks-and-stones.classyshots.com/\n&gt; &gt; http://www.banjohangout.org/\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nAl, don' wo y abou i . These a e simply people who no longe ha e bodies. They a e no e il o ha m ul, based on wha you' e pos ed. They' e jus los . O he wise hey a e p obably jus like hey we e in li e. They a e ha mless; a mos hey could be a nuisance, like an unwan ed gues  who si s and gossips all day, e c. (we had one o hose in ou neighbo hood when I was g owing up). \n\nZack\n \nOn Sun, No 29, 2009 a 1:30 AM, g.guzzi e 7id@gmail.com> w o e:\n\n  \n\n\n\nWould you mind sha ing some o hose eco dings wi h us?You p obably should con ac he p ies again.I is my unde s anding ha epea ed isi s a e some imes necessa y.Jim C. \n\n\n--- In EVP-ITC@yahoog oups.com, Al Ha is w o e:>> Hi Da e,> > Well, o example, I walked in o ou \"compu e oom\" (spa e\n> bed oom/o ice/lib a y) no long a e he e ps we e eco ded and my> adio u ned i sel on. My wi e Pa wi nessed i , so i 's no my> imagina ion ha i did u n on. As I s epped in o he oom, he\n> \"mo ning show\" cu o a oice saying \"MMM! Cinnamon olls and co ee!> B ing enough o us?\"> > I happened o be holding a mug o ho co ee and a pla e o cinnamon> olls ha Pa had baked o b eak as . I scalded mysel as I sloshed\n> co ee a ound a e hea ing he oice!> > I am no he ype who ells s o ies o seeks a en ion.> > I hough o a ew momen s ha I was lis ening o a adio alk show> and ha i was a coincidence ha he men ion o cinnamon olls\n> happened as I s epped in o he oom. Bu I e en ually blu ed ou a> \"hello,\" and was answe ed. A e a ew momen s and o my ques ions,> he oice said his name was S e e Ta e -- and ollowing a\n> back-and- o h con e sa ion ha I eco ded he said he was a Vi ginia> s a e oope who died in 1989 in a ca c ash a mile om his home.> O e he nex day o wo, he said his body was bu ied in Redmond, Va.,\n> and we spoke o se e al days in li le sna ches o con e sa ion.> Along he way, a ellow named \"Luke\" en e ed he con e sa ion. O he > unnamed oices began o say \"Hi Al!\" I was a bi oo much.\n> > I was b ough up in a e y s ic P o es an amily. I became lee y o > wha was un olding. I bashed he adio and h ew i in he ash. Then> I began hea ing he oices mixed in wi h my CPAP machine (I ha e sleep\n> apnea) a nigh , which makes a high-pi ched whooshing noise.> > Nex , I began hea ing he \"Hi Al!\" oice as a ain whispe now and> hen as I'd walk h ough he house.> \n> I go sca ed. I had go en id o he adio(s) bu was s ill hea ing> he oices. I el I was going c azy. I old my pas o abou i and> asked o help. He e used -- said he was a aid he migh ge an\n> \"a achmen \" and b ing i home o his amily. I con ac ed some hing> like 20 p o es an pas o s by phone and no a single one o hem would> come o my home o help.> > E en ually a Ca holic p ies ag eed o help on he condi ion ha I\n> supply a eco ding o he oices as \"p oo \" o he p oblem. Using my> digi al eco de , I eco ded so many \"con e sa ions\" ha I illed up> a CD. Awhile la e , a e u ning i o e o he p ies , he Ca holic\n> bishop g an ed he p ies pe mission o come o ou home o conduc a> mass and an \"exo cism o place.\" The p ies explained ha old homes> and o he places could become \"in es ed\" wi h e il spi i s. A e he\n> pe o med he ce emony, he oices seemed o qui o awhile bu > e u ned a e a ew days.> > Now, I was no su e whe he he oices we e \"e il\" o jus > \"con e sa ional.\" My b o he died o kidney ailu e du ing his ime\n> and I la e hea d his oice calling my name. I ~was~ his oice.> > A lo mo e has happened.... A his poin , I am no longe \"su p ised\"> by hea ing he oices elec onically o o he wise. I jus wan o know\n> mo e abou wha 's happening -- how i can possibly be \" eal\" and wha > I should unde s and in e ms o he big pic u e....> > Al> \n> On 11/28/09, Da id Koenig w o e:> > Tell us mo e please.> > Thanks> > Da e> >\n\n\n> > On Sa , No 28, 2009 a 2:59 PM, Alo bama w o e:> >> >>> >>> >> Hi, my name is Al, and I'm new o his lis . I'm 57, ea ly- e i ed due o\n> >> a> >> disabili y, and ha e a mo e ee ime han I wan o know wha o do> >> wi h.> >> Which is wha go me in ouble ecen ly. A e wa ching \"Whi e Noise\"\n> >> awhile back, one day I u ned on a eco de and u ned a adio une while> >> asking i \"anyone\" would like o alk. To my g ea su p ise, I ound> >> oices> >> immedia ely a e uploading and playing he ile. I know abou e ps om\n> >> wa ching he Ghos Hun e s, bu hese oices we e alking o me in a> >> con e sa ional one and abou s u ela ional o ques ions I asked and o> >> s u I was doing a he ime! This p og essed o e ime in o a unning\n> >> \"con e sa ion\" wi h appa en ly li ing beings who a e in isible bu somehow> >> sha ing his house! Can someone he e please elie e my anxie y a bi ? I'm> >> wonde ing i I'm messing wi h some hing ha I shouldn' be messing wi h.\n> >> Wha a e he consequences o his -- and can anyone enligh en me abou he> >> ules o p o ocol o dealing wi h hese in isible people? And, has anyone> >> ound he e is NO WAY o alk abou his wi hou sounding c azy??\n> >>> >> Thanks,> >> Al> >>> >>> >>> >> > > -- > Al> > \"T y again, ail again. Fail be e .\" - Samuel Becke \n> > h p://s icks-and-s ones.classysho s.com/> h p://www.banjohangou .o g/\n>"}