{"id": "16360", "subject": "Re: Hello from a newcomer", "author": "phenom_investigator", "timestamp": "2009-11-30T15:06:09Z", "full_text": "A few possibly useful comments. First it is understandable that the Catholic church would want proof prior to becoming involved. Based on their belief systems it certainly sounds like you were reporting what is called an &#39;infestation&#39; from their perspective. The priest in question was likely unqualified to perform a full exorcism, and your situation did not call for one. This is based on the teachings of the Catholic church and their official position on demons.\n\nI am surprised that Protestant pastors were unwilling to become involved. But you seem to have made a good try.\n\nAs you may know the general idea is that reaching out to the dead is considered turning away from the Deity and this is why most religions frown on things like clairvoyance and mediumship frankly. I am not so sure about the interpretation and the source of authority, but I do understand what they are saying.\n\nAs far as the state trooper, like Jill I too do quite a bit of online research and I happen to live in the NOVA area, only a few miles from where these events alledgely took place. I will ask around to see if there is any support for any of this story, going a bit beyond what is online. \n\nI research mediumship and my experience has been mixed in terms of accuracies. We have literally rewritten history as a result of mediumistic communications and we have had our share of dud info as well. I have come to believe that a great deal of it has to do with the quality of the medium and their ability to get the information clear. This turns out to be a difficult task under the best of conditions. Many mediums, even the competent ones, have trouble separating themselves from the messages.\n\nThis brings me to what may be going on in your case. It would be good to know if others had heard the recordings (when they still existed) and agreed without prompting on their contents. What I am trying to determine here is whether or not the recordings were clear and contained unquestionable sounds or whether they were subject to interpretation. This might help understand the potential source.\n\nI have suggested on this forum and elsewhere that at least some EVP may in fact be the production of the operator, informed perhaps by some external (and potentially discarnate) source. This actually makes a lot of sense when you think about other anomalous psi phenomena where it is quite common for unknown information to become known by percipients. Apparitional cases are great examples of this. So it may be that the sources are discarnates but the point is that the source of the actual voices may be yourself. This is not to suggest there is really anything &#39;wrong&#39; with you, as this ability seems to be far more common than was ever believed. What it does suggest however is that there may be no more influence over you than the detail that you are able to manifest this information you are receiving. It may begin and end with that. This in turn would suggest that you could inhibit these voices. \n\nDo you associate hearing these voices with a place or activity, beyond just recording? I ask that since you indicated that you had heard voices outside the EVP context. This might help understand the true source of the voices as well. \n\nAs to the relative you heard, this sounds like a post-mortem apparitional appearance. Apparitions can appeal to any of the senses. And it may be that event has little to do with the other activity you have reported. I would advise keeping that event separate for now in your mind as you think about all of this.\n\nI would suggest that you not record further if it makes you uncomfortable. Belief systems seem to play a significant role in this phenomena. That would suggest that you should do nothing that you feel uncomfortable with.\n\nI will let everyone here know if I find anything further on Tate."}