{"id": "16364", "subject": "Re: Okay", "author": "Mark", "timestamp": "2009-12-01T16:30:01Z", "full_text": "Zach, Everyone,\n\nAlmost forgot, I have the shack hacked hand-held radio with speaker. The hack is easy to undo. \n\nMark\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;Mark&quot; &lt;ppsmeet@...&gt; wrote:\n&gt;\n&gt; Zach, I&#39;ve got a list of stuff recently scavenged from a few closets and the basement. \n&gt; \n&gt; One radio shack mini amplifier, it has both an input and an output. \n&gt; \n&gt; One radio shack phone recorder mic, which I have ear marked for a parabolic microphone I&#39;m making out of PVC pipe and a large potato chip bowl. I can spare the mic if we need to I&#39;ll get another. \n&gt; \n&gt; A Belkin Tunecast II which is an FM transmitter. Can we transmit a voice with this  and would you sweep or use variable voltage tuning?   \n&gt; \n&gt; An inductive probe used for wire tracing. I have the toner as well.\n&gt; \n&gt; A polariod digital picture frame which the backlight on the LCD went out. But it has an SD memory card reader and speaker circuit. \n&gt; \n&gt; Tie-clip mic/mono earpiece for a cell phone\n&gt; \n&gt; Few motion detectors, one of them is dual technology which IR and Microwave\n&gt; \n&gt; a large number of RCA, mini plug, mini jack adapters and so on\n&gt; \n&gt; Some 12v sirens and bells, enough to scare the crap out of someone\n&gt; \n&gt; I bought a few small project boards, I have basic soldering tools.\n&gt; \n&gt; I see some possibilities here. But I&#39;m more interested in what you see, if anything. Could just be a pile of junk.\n&gt; \n&gt; \n&gt; On a separate topic, I heard of a satan box or something to that effect. Haven&#39;t really seen anything but photos of it and a comment that people are afraid of it. Well I say that&#39;s for me. I have more churches than  anything in my area, so I can get help if I need it.\n&gt; \n&gt; \n&gt; Thanks,\n&gt; \n&gt; Mark Cottell\n&gt; PPSMEET\n&gt; The Phoenixville Paranormal Society\n&gt; http://www.meetup.com/pps-mu/\n&gt;"}