{"id": "16368", "subject": "Re: [EVP-ITC] &quot;Alger help me!&quot; ???", "author": "Frank Ratka", "timestamp": "2009-12-06T06:38:26Z", "full_text": "--0-894720486-1260081506=:93825\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nHey Al,\n\nWhen I started experimenting with the different forms of ITC I use=\r\n to get the Help Me&#39;s also. I found that it was not only me but some associ=\r\nates of mine experienced the same phenomenon. One of my friends got so wrap=\r\nped up in trying to help them it threatened her health (as in she was extre=\r\nmely fatigued and close to mental collapse). Speaking with others outside m=\r\ny &quot;circle&quot; I found that this was common and was told it will pass. \n\nI have=\r\n kind of a hypothesis on this experience I would like to share. Seeing that=\r\n the layered or &quot;level&quot; model of existence is widely accepted I will refer =\r\nto it. Beyond our physical presence lies many layers of reality with those =\r\nclosest our own being the densest and darkest. Some folks or beings (not al=\r\nl have physically lived) get stuck in these layers for various reasons. The=\r\ny are lost if you will!? Being that they are so close to our own &quot;living vi=\r\nbration&quot;, they are the easiest for us to tune into and pick up across our c=\r\nhosen medium (radio, recorder, or whatever). In other words we act as the a=\r\nntenna and the radio is the reciever... Because they are presumably stuck t=\r\nhey constantly reach out for help but the sad part is they are the only one=\r\ns that can help themselves. As you progress in your experiments, you will e=\r\nventually evolve beyond that level and tune into higher (or lower) vibratio=\r\nns. Keep in mind some of them will be sweet as candy while\n others can be n=\r\nasty. If you get a nasty one tell the others to keep them quite or you will=\r\n cease contact. It usually works!\n\nRegards,\n\nFrank R.\n\n\n\n\n_________________=\r\n_______________\nFrom: Alofbama &lt;algerharris@...&gt;\nTo: EVP-ITC@yahoogro=\r\nups.com\nSent: Thu, December 3, 2009 2:45:06 PM\nSubject: [EVP-ITC] &quot;Alger he=\r\nlp me!&quot; ???\n\n=C2=A0 \nHi,\n\nAwhile back I stopped recording evps because I go=\r\nt unnerved when I began hearing the voices without a radio or recorder. Aft=\r\ner learning more, I decided to pursue my interest with the help of EVP Make=\r\nr software rather than a hacked radio. Today I picked up an EVP on my first=\r\n attempt. I&#39;ve uploaded it to the new &quot;Al&#39;s Files&quot; folder. \n\nThe significan=\r\nce: My full first name is Alger, but I go by &quot;Al&quot; because most people mispr=\r\nonounce Alger. It appears that the spirit entity knows my full first name. =\r\nDo you guys understand the sentence the way that I am hearing it: &quot;Alger he=\r\nlp me&quot; ? Most people incorrectly pronounce Alger with a &quot;grrr&quot; growling sou=\r\nnd rather than the softer &quot;jer.&quot; The evp seems to have gotten the pronuncia=\r\ntion right, though it is difficult to make out distinctly in the robotic vo=\r\nice.\n\nAnother question: I get a lot of &quot;Help me&quot; statements. What is that a=\r\nll about? Any theories? From what do they need help? Anyone else get a lot =\r\nof calls for &quot;help&quot; ?\n\nThanks,\nAl\n\n\n\n\n\n      \r\n--0-894720486-1260081506=:93825\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;&lt;head&gt;&lt;style type=3D&quot;text/css&quot;&gt;&lt;!-- DIV {margin:0px;} --&gt;&lt;/style&gt;&lt;/he=\r\nad&gt;&lt;body&gt;&lt;div style=3D&quot;font-family:times new roman, new york, times, serif;=\r\nfont-size:12pt&quot;&gt;&lt;DIV&gt;Hey Al,&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;When I started ex=\r\nperimenting with the different forms of ITC I use to get the Help Me&#39;s also=\r\n. I found that it was not only me but some associates of mine experienced t=\r\nhe same phenomenon. One of my friends got so wrapped up in trying to help t=\r\nhem it threatened her health (as in she was extremely fatigued and close to=\r\n mental collapse). Speaking with others outside my &quot;circle&quot; I found that th=\r\nis was common and was told it will pass. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I ha=\r\nve kind of a hypothesis on this experience I would like to share. Seeing th=\r\nat the layered or &quot;level&quot; model of existence is widely accepted I will refe=\r\nr to it. Beyond our physical presence lies many layers of reality with thos=\r\ne closest our own being the densest and darkest. Some folks or beings (not =\r\nall have physically lived) get stuck in these layers for various reasons. T=\r\nhey are lost if you will!? Being that they are so close to our own &quot;living =\r\nvibration&quot;, they are the easiest for us to tune into and pick up across our=\r\n chosen medium (radio, recorder, or whatever). In other words we act as the=\r\n antenna and the radio is the reciever... Because they are presumably stuck=\r\n they constantly reach out for help but the sad part is they are the only o=\r\nnes that can help themselves. As you progress in your experiments, you will=\r\n eventually evolve beyond that level and tune into higher (or lower) vibrat=\r\nions. Keep in mind some of them will be sweet as candy\n while others can be=\r\n nasty. If you get a nasty one tell the others to keep them quite or you wi=\r\nll cease contact. It usually works!&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Regards,&lt;/=\r\nDIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Frank R.&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV style=3D&quot;FONT-FAMILY: t=\r\nimes new roman, new york, times, serif; FONT-SIZE: 12pt&quot;&gt;&lt;BR&gt;\n&lt;DIV style=3D=\r\n&quot;BORDER-LEFT: #1010ff 2px solid; MARGIN: 5px 0px 5px 5px; PADDING-LEFT: 5px=\r\n; FONT-FAMILY: times new roman, new york, times, serif; FONT-SIZE: 12pt&quot;&gt;&lt;F=\r\nONT size=3D2 face=3DTahoma&gt;\n&lt;HR SIZE=3D1&gt;\n&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: bo=\r\nld&quot;&gt;From:&lt;/SPAN&gt;&lt;/B&gt; Alofbama &lt;algerharris@...&gt;&lt;BR&gt;&lt;B&gt;&lt;SPAN sty=\r\nle=3D&quot;FONT-WEIGHT: bold&quot;&gt;To:&lt;/SPAN&gt;&lt;/B&gt; EVP-ITC@yahoogroups.com&lt;BR&gt;&lt;B&gt;&lt;SPAN=\r\n style=3D&quot;FONT-WEIGHT: bold&quot;&gt;Sent:&lt;/SPAN&gt;&lt;/B&gt; Thu, December 3, 2009 2:45:06=\r\n PM&lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: bold&quot;&gt;Subject:&lt;/SPAN&gt;&lt;/B&gt; [EVP-ITC] &quot;=\r\nAlger help me!&quot; ???&lt;BR&gt;&lt;/FONT&gt;&lt;BR&gt;&lt;SPAN style=3D&quot;DISPLAY: none&quot;&gt;&nbsp;&lt;/SPA=\r\nN&gt; \n&lt;DIV id=3Dygrp-text&gt;\n&lt;P&gt;Hi,&lt;BR&gt;&lt;BR&gt;Awhile back I stopped recording evps=\r\n because I got unnerved when I began hearing the voices without a radio or =\r\nrecorder. After learning more, I decided to pursue my interest with the hel=\r\np of EVP Maker software rather than a hacked radio. Today I picked up an EV=\r\nP on my first attempt. I&#39;ve uploaded it to the new &quot;Al&#39;s Files&quot; folder. &lt;BR=\r\n&gt;&lt;BR&gt;The significance: My full first name is Alger, but I go by &quot;Al&quot; becaus=\r\ne most people mispronounce Alger. It appears that the spirit entity knows m=\r\ny full first name. Do you guys understand the sentence the way that I am he=\r\naring it: &quot;Alger help me&quot; ? Most people incorrectly pronounce Alger with a =\r\n&quot;grrr&quot; growling sound rather than the softer &quot;jer.&quot; The evp seems to have g=\r\notten the pronunciation right, though it is difficult to make out distinctl=\r\ny in the robotic voice.&lt;BR&gt;&lt;BR&gt;Another question: I get a lot of &quot;Help me&quot; s=\r\ntatements. What is that all about? Any theories? From what do they need hel=\r\np? Anyone else get\n a lot of calls for &quot;help&quot; ?&lt;BR&gt;&lt;BR&gt;Thanks,&lt;BR&gt;Al&lt;BR&gt;&lt;BR=\r\n&gt;&lt;/P&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;!-- cg22.c1.mail.mud.yahoo.com compressed/chunked S=\r\nat Dec  5 22:13:42 PST 2009 --&gt;&lt;/div&gt;&lt;br&gt;\n\n      &lt;/body&gt;&lt;/html&gt;\r\n--0-894720486-1260081506=:93825--"}