{"id": "16363", "subject": "Re: Hello from a newcomer", "author": "Jill", "timestamp": "2009-12-01T05:53:10Z", "full_text": "Reading what you&#39;ve wrote below, I&#39;m still leaning toward a haunting-type situation worsened by the honing of your psychic abilities in using the ghost box.  And even though you say that you don&#39;t have ESP, trust me, you do now.  There&#39;s something about using the box that seems to enhance this ability in some people.\n\nAbout your &quot;head counters&quot; on the other side:  very interesting.  Maybe this would account for the lying?  If those who talk to us are being monitored, maybe they can&#39;t tell us the truth, and so want to tell us something to keep us talking to them?  I have read about people who&#39;ve had paranormal experiences with their dead loved ones, and they&#39;ve been told that they can only talk about certain things.  If you read, for instance, the book &quot;Hello from Heaven,&quot; nearly every single encounter in that book consists of the message, &quot;I&#39;m fine, don&#39;t worry about me, I love you.&quot;  As if there&#39;s a rule book that only permits the dead to tell the living these simple facts.  In my own (limited) experience, &quot;I love you&quot; seems to be the most common message I receive.  Like, over and over and over again.  Which jives with your &quot;head counters&#39;&quot; rules, I should think.\n\n\n--- In EVP-ITC@yahoogroups.com, Al Harris &lt;algerharris@...&gt; wrote:\n&gt;\n&gt; Hello again.\n&gt; \n&gt; Thank you, phenom_investigator, for your comments and theories, which\n&gt; make sense.\n&gt; \n&gt; Keep in mind that I still feel very &quot;foolish&quot; or sheepish about\n&gt; talking about what happened -- speaking to an open list makes me kind\n&gt; of leery, but it seems I&#39;ve landed at a place where people know enough\n&gt; to be able to help me, or to at least help me reduce my stress over\n&gt; this. I have extremely high blood pressure and other concerns, so it\n&gt; is very important to me to lose the anxiety I feel about all this. I\n&gt; am so keyed up at times it is difficult to rest and recharge.\n&gt; \n&gt; I shared some private info in an off-list post to a member here who I\n&gt; have confidence in. Some of that content touches on your remarks, so\n&gt; I&#39;m going to take a deep breath and go ahead and share the following\n&gt; info:\n&gt; \n&gt; ---\n&gt; \n&gt; The reason I&#39;ve been so concerned about the voices is that I\n&gt; encountered threatening communication while under quite a bit of\n&gt; stress -- I had to retire early from a long career ... because of failing\n&gt; health, low vision (doc predicted I\n&gt; would go blind but surgery saved (I hope) my remaining vision), the\n&gt; death of my brother, etc. I began recording evps as a pastime but it\n&gt; escalated into hearing threats and then being able to hear the voices\n&gt; with my unaided ears! Hearing them without a radio really freaked me\n&gt; out.\n&gt; \n&gt; The character &quot;Luke&quot; said I had poked around and asked for &quot;their\n&gt; help&quot; and information, and that I owed payback. He said, &quot;Now you have\n&gt; become ours, and I will be there in court with you on the last day\n&gt; arguing for it!&quot; etc. Very chilling stuff for someone who has\n&gt; dangerously high blood pressure problems and many other challenges.\n&gt; \n&gt; A different voice (not Luke) informed me one day that my brother\n&gt; Walter was gravely ill. I had not spoken with Walt for awhile, so I\n&gt; called right away and was told by my sister-in-law that Walt was in\n&gt; end stage kidney failure! It happened so quickly that the family hadn&#39;t had\n&gt; time to inform me. Patt and I drove the hundred miles or so to his\n&gt; home and got there in time to spend only three short days with him\n&gt; before he died! In that case, the voice did a good thing by letting me\n&gt; know about my brother, but there have been times when the voices have\n&gt; been mocking and threatening or full of useless BS.\n&gt; \n&gt; For example, I&#39;m now Catholic and I do some devotional prayers at\n&gt; bedtime as I sit near a shelf where I keep rosaries and prayer books.\n&gt; One night the &quot;Luke&quot; fellow began speaking from my nearby pillow! I\n&gt; was several feet away from the pillow at the time but could hear the\n&gt; voice very distinctly. It was almost as if there was a speaker in the\n&gt; pillow. Over the next several nights the voice would wake me up,\n&gt; making it difficult to sleep. I then called the priest and he returned\n&gt; to our home a second time to pray and bless the place with holy water\n&gt; and blessed salt. I now keep lots of holy water and blessed salt\n&gt; around -- I get the water from our church by the jug-full. Our house\n&gt; (which we lease) was built in about 1830 and restored several times.\n&gt; The priest said it is possible for old objects and places to become\n&gt; &quot;infested&quot; with evil spirits. We don&#39;t know much about the history of\n&gt; the house, but we do know for certain that a previous occupant used\n&gt; the bedroom to do ceremonies of some type -- a huge pentagram was\n&gt; painted on the floor and the entire room was painted red. The owner\n&gt; had a big repair job to correct it. The priest referred me to numerous\n&gt; spiritual warfare prayers, and I have been using those since that\n&gt; time. Things have been fairly quiet for awhile, but the voices return\n&gt; very frequently almost as if to remind us they&#39;re still around and\n&gt; that there&#39;s nothing we can do to get rid of them. Our priest said\n&gt; simply moving might not fix the problem, as the voices could follow.\n&gt; Because I&#39;m on Social Security with only a tiny retirement supplement\n&gt; from my work, moving would be a hardship -- and we&#39;d be in a real fix\n&gt; if we moved and the voices came along too....\n&gt; \n&gt; The encounter with the voice of &quot;Steve Tate&quot; lasted on and off over\n&gt; several days, then he just abruptly quit communicating. Most of the\n&gt; remaining voices laugh, mock, and taunt us.\n&gt; \n&gt; The only &quot;useful&quot; or positive thing that resulted from any of this was\n&gt; my being able to spend time with my brother before he died.\n&gt; \n&gt; Would you please give me your thoughts on this as to whether what I&#39;ve\n&gt; described is the &quot;typical&quot; encounter and whether you believe it is\n&gt; harmful or springing from something &quot;demonic.&quot; I&#39;m a very\n&gt; &quot;cause-and-effect&quot; type of person who previously believed this sort of\n&gt; thing was impossible. Now I don&#39;t know what the truth is.\n&gt; \n&gt; You know more that I do about this stuff and seem to have experience,\n&gt; and I would appreciate it very much if you can put things into context\n&gt; for me -- I&#39;ll appreciate anything you can tell me, even if you just\n&gt; share your theories.  In particular, do you know of any way to make\n&gt; the voices hush?\n&gt; \n&gt; &gt; The priest in question was likely\n&gt; &gt; unqualified to perform a full exorcism, and your situation did not call for\n&gt; &gt; one. This is based on the teachings of the Catholic church and their\n&gt; &gt; official position on demons.\n&gt; \n&gt; Correct. The bishop specifically directed me to a priest who holds a\n&gt; doctorate and is\n&gt; knowledgeable but not &quot;experienced&quot; in exorcisms -- I&#39;m sure he has\n&gt; never conducted an exorcism apart from the &quot;mini exorcism&quot; that&#39;s part\n&gt; of the baptismal rite. He conducted a mass at our home and then\n&gt; blessed the premises and said some warfare prayers. Now (several\n&gt; months later), our diocese does have an official, experienced exorcist\n&gt; but I have not yet asked to meet with him and have been wondering if I\n&gt; need to....\n&gt; \n&gt; &gt;\n&gt; &gt; I am surprised that Protestant pastors were unwilling to become involved.\n&gt; &gt; But you seem to have made a good try.\n&gt; \n&gt; I live in the Bible Belt and found it surprising that every single one\n&gt; of them wanted nothing to do with the situation or even to meet me in\n&gt; person! Rather &quot;fair weather Christians,&quot; I thought.\n&gt; \n&gt; &gt;\n&gt; &gt; As you may know the general idea is that reaching out to the dead is\n&gt; &gt; considered turning away from the Deity and this is why most religions frown\n&gt; &gt; on things like clairvoyance and mediumship frankly.\n&gt; \n&gt; Yes, that&#39;s right. &quot;Have no other gods,&quot; etc.\n&gt; \n&gt; &gt; As far as the state trooper, like Jill I too do quite a bit of online\n&gt; &gt; research and I happen to live in the NOVA area, only a few miles from where\n&gt; &gt; these events alledgely took place. I will ask around to see if there is any\n&gt; &gt; support for any of this story, going a bit beyond what is online.\n&gt; \n&gt; Unlike the other voices, Tate was very friendly and conversational and\n&gt; we fell into a discussion that verged on being an &quot;interview.&quot; When I\n&gt; was a young man, I worked as a daily newspaper reporter in Birmingham\n&gt; -- I&#39;ve conducted possibly thousands of interviews. I cut right to the\n&gt; chase -- who, what, when, where, etc. But we reached a point, when I\n&gt; asked &quot;where&quot; Tate was in relation to time and my physical location,\n&gt; that we got cut off by an authoritative-sounding female voice that\n&gt; basically called out to us in a stern tone. I tried to press on with\n&gt; the conversation and &quot;she&quot; snapped at me and called me &quot;Mr. Harris&quot; in\n&gt; an angry / exasperated tone. I&#39;m paraphrasing, but Tate said &quot;they&quot;\n&gt; (&quot;over there&quot;) are monitored when they talk to us &quot;air-breathers&quot; and\n&gt; that certain topics are forbidden. Tate called the monitors the &quot;head\n&gt; counters.&quot; Tate&#39;s conversations were all recorded from the radio and\n&gt; the quality of voice was as distinct and clear as anything else on the\n&gt; AM dial. Clearer, maybe. And the REALLY strange thing is, many chunks\n&gt; of his conversation took up several &quot;cycles&quot; of scans -- I mean, it\n&gt; wasn&#39;t in fragments most of the time!\n&gt; \n&gt; &gt; I have come to\n&gt; &gt; believe that a great deal of it has to do with the quality of the medium and\n&gt; &gt; their ability to get the information clear. This turns out to be a difficult\n&gt; &gt; task under the best of conditions. Many mediums, even the competent ones,\n&gt; &gt; have trouble separating themselves from the messages.\n&gt; \n&gt; I read somewhere, maybe on the ITC world site, that a theory is that\n&gt; the equipment has less to do with it than the person&#39;s ability to pick\n&gt; it up. Now, this is very confusing in my case. Patt and I have heard\n&gt; the voices with and without a radio, and we have heard them while\n&gt; sitting together and while we were separate. I am not imagining the\n&gt; voices that come without aid of a radio because I can record them with\n&gt; my Olympus digital recorder. This is probably the main thing that lets\n&gt; me know I&#39;m not going crazy or having a nervous breakdown.\n&gt; \n&gt; &gt; This brings me to what may be going on in your case. It would be good to\n&gt; &gt; know if others had heard the recordings (when they still existed) and agreed\n&gt; &gt; without prompting on their contents.\n&gt; \n&gt; Yes! Most definitely -- others could hear the recordings and\n&gt; understand clearly what was said. In some cases it became difficult to\n&gt; understand particular words (was I hearing the name &quot;Tate&quot; or &quot;Pate&quot; ?\n&gt; Most of us decided it was &quot;Tate.&quot; Most of the time it was so clear\n&gt; that my wife and a few close friends were totally creeped out! In\n&gt; fact, I had the recorder on one morning and I checked my e-mail and\n&gt; then stripped for a shower, then took another glug of coffee before\n&gt; actually going into the bathroom. I began to realize that a female\n&gt; voice was laughing and talking about me standing there naked!!! The\n&gt; evp voices always seemed so much faster-paced than &quot;real&quot; voices -- I\n&gt; got to where I&#39;d upload them and play them back in Sound Forge so I\n&gt; could slow it down. At a slower speed they sounded more normal. Is\n&gt; this typical?\n&gt; \n&gt; &gt; What I am trying to determine here is\n&gt; &gt; whether or not the recordings were clear and contained unquestionable sounds\n&gt; &gt; or whether they were subject to interpretation.\n&gt; \n&gt; Yes, more than 80 percent of the time they were clear and distinct.\n&gt; Another creepy thing is that I accidentally found that I could play\n&gt; them backwards in Sound Forge. Many, many times I found there were\n&gt; additional messages when played in reverse! This stuff was so creepy\n&gt; that the Bishop IMMEDIATELY gave permission for the priest to help.\n&gt; The recordings never seemed to be subject to various interpretations.\n&gt; Now, I know this sounds really, really paranoid, but they were so\n&gt; clear that I actually looked around to see whether someone might have\n&gt; been spying on us and somehow transmitting their voice to our radio.\n&gt; And there was just no way. We live on top of a hill on 15 acres of\n&gt; thick pine forest and have a mean ole southern yard dog with a\n&gt; trip-wire temper, so there is just no way I can think of that this\n&gt; could have been a prank.\n&gt; \n&gt; &gt; I have suggested on this forum and elsewhere that at least some EVP may in\n&gt; &gt; fact be the production of the operator, informed perhaps by some external\n&gt; &gt; (and potentially discarnate) source. ....\n&gt; \n&gt; Well, I thought of that, but I went through phases, in much younger /\n&gt; healthier times of life, when I experimented with clairvoyance and\n&gt; telepathy and so forth, and I have never, not one single time, been\n&gt; able to correctly guess which card was pulled or come up with what\n&gt; anyone else was thinking or any of that. I am probably the most\n&gt; thick-headed non-esp type of person you&#39;d ever meet. My eegs are\n&gt; probably flat lines.\n&gt; \n&gt; &gt;\n&gt; &gt; Do you associate hearing these voices with a place or activity, beyond just\n&gt; &gt; recording? I ask that since you indicated that you had heard voices outside\n&gt; &gt; the EVP context. This might help understand the true source of the voices as\n&gt; &gt; well.\n&gt; \n&gt; The only place I have ever heard the voices was in this house. A week\n&gt; or so after it started, I began hearing what I thought was &quot;chatter&quot;\n&gt; mixed in with the sound of running water at the kitchen sink, in the\n&gt; bathroom, etc. I noticed it at other places when I&#39;d &quot;take a leak&quot; at\n&gt; a public restroom or elsewhere. I thought it was another sign I was\n&gt; losing my mind. The water-talk has eased up. I never tried to record\n&gt; it and slow it down (afraid of what I might hear). For one thing, it\n&gt; is hard to use the bathroom and hold a recorder at the same time\n&gt; &lt;grin&gt;.\n&gt; \n&gt; &gt; I would suggest that you not record further if it makes you uncomfortable.\n&gt; &gt; Belief systems seem to play a significant role in this phenomena. That would\n&gt; &gt; suggest that you should do nothing that you feel uncomfortable with.\n&gt; \n&gt; Yes, I came here hoping to find some answers I can understand and have\n&gt; firmly resolved not to experiment further until I can understand\n&gt; what&#39;s happening.\n&gt; \n&gt; Thanks very much for giving this issue your time and thought.\n&gt; \n&gt; -- \n&gt; Al\n&gt; \n&gt; &quot;Try again, fail again. Fail better.&quot; - Samuel Beckett\n&gt; \n&gt; http://sticks-and-stones.classyshots.com/\n&gt; http://www.banjohangout.org/\n&gt;"}