{"id": "16378", "subject": "To magnolia.massage Re: [EVP-ITC] Re: Hello from a newcomer", "author": "Al Harris", "timestamp": "2009-12-08T16:50:32Z", "full_text": "Hi magnolia.massage,\n\nI started more than a year ago with a radio shack &quot;hacked&quot; box that\nanother member hacked for me so that it continuously scanned stations.\nHere&#39;s what I did: despite feeling a little silly, I turned on the\nradio and my Olympus digital recorder, and I asked my questions in the\ndirection of the radio (it felt like I was talking to myself, and I\nexpected nothing to happen). After 5 minutes or so, I quit recording\nthen uploaded the .wav file to Sound Forge on my computer. It sounded\npretty much like hearing myself talk to a scanning radio -- nothing\nintelligible there. Then I used Sound Forge to slow down the gibberish\nI heard in the scanning portions, and as I experimented with slower\nplayback speeds I began hearing &quot;Hi Al&quot; and all sorts of other\ncomments that could not possibly have been a part of radio programming\nfragments. As I mentioned in my first post the other day, this\neventually turned into a distressing situation for me in which the\nradio shack radio began turning itself on, literally, each morning and\nI later began hearing the voices without aid of a radio. I assure you\nI am telling you the 100 percent truth.  Apparently, something\n&quot;negative&quot; attached itself here and it took much effort and help from\na Catholic priest to get rid of it. I don&#39;t exactly know what we did\nthat was THE solution to get rid of it, but it finally left.  I knew\nnothing about how to protect myself at that time. Although the\nnegative energies may not be able to physically harm us (I still\nwonder about that), the emotional/mental distress can be every bit as\nbad or dangerous as physical harm. I&#39;ve begun slowly experimenting\nagain but this time I am trying some new techniques to protect myself.\nI&#39;ve been told by experienced ghost-box users that if your intent is\npositive, you will attract positive voices, and that is the theory I&#39;m\nusing now as I cautiously pursue the hobby again.\n\nMy only advice would be that, if you do proceed, to use caution and to\nremember that the voices lie. If I were you, I would not take any\naction based on what a voice says without checking it out in the usual\nhuman ways first.\n\nIf you&#39;re interested in hearing more about my previous experience,\njust drop me a private note off list.\n\nRegards,\nAl\n\nOn 12/7/09, magnolia.massage &lt;magnolia.massage@...&gt; wrote:\n&gt; Hello, Al. Like you I have many questions about the paranormal. Also like\n&gt; you, I&#39;m interested in communicating with these astral beings. Im a\n&gt; beginner, and I have no clue where to start or what to start with. Any\n&gt; advice you could give me would be most appreciated. What devices do you\n&gt; currently use? I would like to try ITC but I have no idea how to set it up.\n&gt; I would like to go beyond EVP trials with a recorder...any suggestions?\n&gt; Thanks, P\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Alofbama&quot; &lt;algerharris@...&gt; wrote:\n&gt;&gt;\n&gt;&gt; Hi, my name is Al, and I&#39;m new to this list. I&#39;m 57, early-retired due to\n&gt;&gt; a disability, and have far more free time than I want or know what to do\n&gt;&gt; with. Which is what got me in trouble recently. After watching &quot;White\n&gt;&gt; Noise&quot; awhile back, one day I turned on a recorder and turned a radio\n&gt;&gt; tuner while asking if &quot;anyone&quot; would like to talk. To my great surprise, I\n&gt;&gt; found voices immediately after uploading and playing the file. I know\n&gt;&gt; about evps from watching the Ghost Hunters, but these voices were talking\n&gt;&gt; to me in a conversational tone and about stuff relational to questions I\n&gt;&gt; asked and to stuff I was doing at the time! This progressed over time into\n&gt;&gt; a running &quot;conversation&quot; with apparently living beings who are invisible\n&gt;&gt; but somehow sharing this house! Can someone here please relieve my anxiety\n&gt;&gt; a bit? I&#39;m wondering if I&#39;m messing with something that I shouldn&#39;t be\n&gt;&gt; messing with. What are the consequences of this -- and can anyone\n&gt;&gt; enlighten me about the rules or protocol for dealing with these invisible\n&gt;&gt; people? And, has anyone found there is NO WAY to talk about this without\n&gt;&gt; sounding crazy??\n&gt;&gt;\n&gt;&gt; Thanks,\n&gt;&gt; Al\n&gt;&gt;\n&gt;\n&gt;\n&gt;\n\n\n-- \nAl\n\n&quot;Try again, fail again. Fail better.&quot; - Samuel Beckett\n\nhttp://sticks-and-stones.classyshots.com/\nhttp://www.banjohangout.org/"}