{"id": "16372", "subject": "DEMON DISPELLED (GHOST ?) BY EXOTIC NEW TECHNOLOGY", "author": "Doc Stars", "timestamp": "2009-12-07T18:33:57Z", "full_text": "Can you let me know if the below is of interest to you folks?\n\nSomething I thought would be of interest to most of our readers. \n\nTwo different amazing stories here, one where a demonic, shadow person like force gets repelled dramatically and another story where the \nsudden appearance  of an angel like being occurs\n\n(Note, this is a post form another forum, Ive included the link to this message for convenience sake, but feel free to delete this if you wish) \n\nId love to see our fellow members here field test this rigorously and share their findings with us, its free after all so why not put it to the test and see if you can get the same dramatic results? \n\nRe: report on Dispel Darkness Max --- \nIn \nthe_sound_of_stars@yahoogroups.com \n&quot;Carol B.&quot; &lt;cbreck&gt; wrote: \n\nHello Group  \n\nI have an interesting report on the events that occurred whilst playing  the Dispel Darkness max for the first time. First, I&#39;ll give you a little background. I have been a paranormal investigator for going on 13 years. Over time I have inadvertently brought things home with me. By things I mean various energy. For the last year, I have had a serious problem with something that won&#39;t leave.\n\nI&#39;ve tried EVERYTHING I can to have it go to whereever it is supposed to be. It has brought havoc and chaos to my household and in particular, my 24 year old daughter. (She;s a police officer). I have \nthis energy&#39;s voice on dvr, saying horrible things. It responds to Christian items, as well to sage smudging..by either accelerated chaos or retreating for a while. It touches people. It leaves bruises. \nIt has chased us up our hallway. It has no real form..shows as a HUGE black, dense mass. Moves very quickly.\n\nAnyway, I get the Dispel Darkness max series, and immediately put it on. I was in my home office, in the dark, with aforementioned hall lit up two feet from me. Literally two seconds into the first frequency,\nthis huge black mass came shooting up directly behind me...very aggressive energy. I turned around and struckout my arm to stop what felt like a physical assault..and then..it just dissolved..\n\nKinda like from big black to &quot;snow&quot; &gt; on TV, to nothing! Amazing! \n\nThank you Doc, from the bottom of my heart.  Carol B.\n=============\n[the_sound_of_stars] Dispel Darkness \n\nFriday, December 4, 2009 9:44 PM \nFrom: &quot;englishv&quot; &lt;englishv@ \nTo: the_sound_of_stars@yahoogroups.com \n\nAfter downloading the MP-3 I played it twice. I did not notice any particular effect on me personally, but the young fellow from across the street came to my house and knocked on the front door (presumably while the D.D. was playing because I did not hear him), and later in the afternoon he called and asked me who was &quot;the man&quot; (tall blond, blue eyed) that answered the door , looked &quot;right through him&quot;, and told him to &quot;go back where he came from - and that I was not &quot;accepting visitors&quot;. ???????  !!!!!!!!!!!!!!!!! \n\nIs the young fellow across the street evil in some way? Was this beautiful blond man some kind of entity that decided that I needed protection? Who knows, but it was &quot;different&quot;... I am continuing (starting tonight) to play the D.D. in the hope that it will banish my extreme depression which seems to be affecting my physical health. (My husband of 34 years died last August and I really miss him. Even though he was very sick and I wouldn&#39;t bring him back to that horrid cement body he was trapped in, I still am very lonely.) \n\nThanks for your gift.... \n\nNancy E.v. \n=======================\n\nIf you want more of these stories email at  doc_starz@...\n\nLINKS WHERE YOU CAN VIEW THESE ORIGINAL MESSAGES AND FOLLOWUP, AND CONTACT THE POSTERS ; \n\nCarols&#39; \n\nhttp://health.groups.yahoo.com/group/the_sound_of_stars/message/11154 \n\nNancy&#39;s \n\nhttp://health.groups.yahoo.com/group/the_sound_of_stars/message/11243 \n\n\n\n      __________________________________________________________________\nLooking for the perfect gift? Give the gift of Flickr! \n\nhttp://www.flickr.com/gift/"}