{"id": "16388", "subject": "Re: [EVP-ITC] Why do entities lie?", "author": "wyatt talley", "timestamp": "2009-12-09T20:08:20Z", "full_text": "--0-1277749949-1260389300=:95022\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nMichelle,\n\nHere is my expiation based on my experiences and what i know abo=\r\nut the other side from other spiritual experiences. \n\nWhy do ghosts lie? We=\r\nll some of them don&#39;t they just base everything they say on past events on =\r\nthe life they just died from.  Once they pass from the outher side to the l=\r\night then they will learn about the love of the world and where things make=\r\n more sense.  Now why do they not pass into the light? Who knows, its based=\r\n on what they consider judgment of themselves by God or they want to stay a=\r\nround to see family grow or wait till a love one passes. So saying that the=\r\n ghost knows nothing about future or current events just past events that t=\r\nhey were alive for. Now notice that your guides or spirits that pass on can=\r\nnot give us any information other than currents events or reassure you of t=\r\nhings going to be OK or express love for who you are and what people and Go=\r\nd see of you. Im still in the park that events happen due to human hands an=\r\nd not what God says, but God helps when you need it most and are not afraid=\r\n to ask him and the things you NEED (not want)\n will come to pass in some s=\r\ntrange way. Anyway im getting off tangent lol.  Another thing im sure you h=\r\nave noticed is demons will assume the shape of a loved one or another spiri=\r\nt and just spit lies and fear to you or in EVP&#39;s.  I think frank gets a lot=\r\n of this building radios. They will just blatantly lie just to see you get =\r\nin trouble or cause heartache for you or people close to you.  If you want =\r\nme to explain more then let me know but im not sure ill post it here on the=\r\n forum unless people really want to hear. \n\nOnyx\n\n\n\n\n______________________=\r\n__________\nFrom: michellewisbith &lt;mwisbith@...&gt;\nTo: EVP-ITC@yahoogr=\r\noups.com\nSent: Wed, December 9, 2009 11:47:09 AM\nSubject: [EVP-ITC] Why do =\r\nentities lie?\n\n  \n\n\nHello, all.\n\nMy name is Michelle.  I&#39;m a certified medi=\r\num with a Spiritualist church.  This was a two year process which involved =\r\nproving I can communicate with spirits to a  congregation (not bragging - j=\r\nust trying to explain my background and why I know what I do). I&#39;m also one=\r\n of the biggest skeptics you&#39;ll ever meet (It was one of two reasons I beca=\r\nme a medium.  I wanted to see how they were &quot;faking&quot; it.  Surprise!  They w=\r\neren&#39;t). I&#39;d like to contribute what I&#39;ve learned about spirits.  As Jill w=\r\nrote, &quot;I(t) really takes personal experience to believe this stuff exists&quot;.=\r\n\n\nAs to her main question of &quot;Why do spirits lie&quot;, I don&#39;t think we can alw=\r\nays assume they&#39;re lying.  If the information comes through a medium, one o=\r\nf the first items to address is whether or not the medium received the mess=\r\nage correctly and then whether or not he/she interepreted it correctly and =\r\nphrased it in a way that allowed the recipient to understand the spirit&#39;s m=\r\neaning.  There are a variety of ways spirits communicate with mediums; some=\r\n are easier than others to understand and pass on.  For the harder methods,=\r\n it would be possible for a medium to inadvertently misinterept the message=\r\n based on his/her past experiences. \n\nWhen we look at the question from the=\r\n connection to EVP&#39;s and ghost boxes, we have to examine a few items.  Was =\r\nthe spirit able to use the devices correctly to form the words he/she actua=\r\nlly intended? This is a two step process. It can be difficult for them to n=\r\not only pull the available energy into a useable form, but to also form the=\r\n correct words (think it as a foreigner learning English and saying &quot;car&quot; w=\r\nhen they mean &quot;star&quot;. They sound similar, but have very different meanings)=\r\n. \n\nDid we understand the words they said?  It&#39;s fairly easy to get them wr=\r\nong, especially in instances where you aren&#39;t the first person to listen to=\r\n the recording and someone else says, &quot;Here listen to this.  I think they&#39;r=\r\ne saying (fill in the blank)&quot;.  Our brains are going to tell us (fill in th=\r\ne blank) simply because that thought is now prevalent.  If we&#39;re the only p=\r\nerson listening to the recordings, the same mistake can be made.  The only =\r\nconclusive way is to use equipment that can amplify and break down the reco=\r\nrdings to make them clear enough to be agreed upon by a number of people wh=\r\no don&#39;t know what conclusions the other listeners have drawn. \n\nThe idea of=\r\n a spirit distorting the facts must also be considered.  Not lying, per se,=\r\n but rather getting the facts within their reality confused. This is where =\r\nyou have the right to have the facts validated by the spirit.  Ask them to =\r\nprove it to you.  They can tell you some corresponding items that back up t=\r\nheir claims, direct you to old newspaper stories or to a person they used t=\r\no affiliate with or bring the validation into your focus (meaning the same =\r\nthing comes into your life while you&#39;re driving/working/ at home/talking to=\r\n someone/reading and etc.) at least three times.  A spirit who is being tru=\r\nthful will not mind trying to make this happen. \n\nOnce these have been cons=\r\nidered and eliminated, then we should be willing to entertain the idea the =\r\nspirit may be a lower energy being (a bully/swindler/ con-man or woman/narc=\r\nissist and etc) in their past life and this is the only way they know how t=\r\no achieve what they want.  And yes, those spirits do exist.  &quot;As in life, s=\r\no in death&quot;, meaning our personalities don&#39;t change when our bodies die.\n\nA=\r\nl, maybe he wasn&#39;t trying to prove anything.  Is it possible the spirit voi=\r\nce didn&#39;t mean he WAS (typed larger for emphasis) Steve Tate, but rather wa=\r\nnted to talk ABOUT Steve Tate or get a message TO Steve Tate?  Did he mean =\r\nto say &quot;Still fate&quot;?  Could he have meant &quot;paratrooper&quot; ?  See where I&#39;m go=\r\ning with this? \n\nAnd finally, in regards to the &quot;end of the world stuff&quot;, i=\r\nt has been taught to me by mediums and teachers who were all very honest an=\r\nd excellent at what they do, and it has been relayed to me by spirits I&#39;ve =\r\nencountered in my mediumship service that we don&#39;t have a free glimpse of t=\r\nhe future once our bodies die and we move into spirit form.  I mean no offe=\r\nnse and I&#39;m not impying that wasn&#39;t what was heard.  That said (or rather &#39;=\r\ntyped&#39;), I&#39;d be VERY hesitant to believe this communication.  There are bei=\r\nngs that are privvy to the potential (underscore &quot;potential&quot;) future in our=\r\n lives, but it isn&#39;t their nature to join us for EVP sessions. \n\nI hope I h=\r\naven&#39;t taken liberty with this forum by posting such a long reply. I thank =\r\nyou for your time and attention. If you have other questions or would like =\r\nme to clarify something, please ask.  I&#39;d be honored to share what I know a=\r\nnd track down what I don&#39;t.  :) \n\nMichelle\n\n\n \r\n--0-1277749949-1260389300=:95022\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;&lt;head&gt;&lt;style type=3D&quot;text/css&quot;&gt;&lt;!-- DIV {margin:0px;} --&gt;&lt;/style&gt;&lt;/he=\r\nad&gt;&lt;body&gt;&lt;div style=3D&quot;font-family:times new roman,new york,times,serif;fon=\r\nt-size:12pt&quot;&gt;&lt;div&gt;Michelle,&lt;br&gt;&lt;br&gt;Here is my expiation based on my experie=\r\nnces and what i know about the other side from other spiritual experiences.=\r\n &lt;br&gt;&lt;br&gt;Why do ghosts lie? Well some of them don&#39;t they just base everythi=\r\nng they say on past events on the life they just died from.&nbsp; Once they=\r\n pass from the outher side to the light then they will learn about the love=\r\n of the world and where things make more sense.&nbsp; Now why do they not p=\r\nass into the light? Who knows, its based on what they consider judgment of =\r\nthemselves by God or they want to stay around to see family grow or wait ti=\r\nll a love one passes. So saying that the ghost knows nothing about future o=\r\nr current events just past events that they were alive for. Now notice that=\r\n your guides or spirits that pass on cannot give us any information\n other =\r\nthan currents events or reassure you of things going to be OK or express lo=\r\nve for who you are and what people and God see of you. Im still in the park=\r\n that events happen due to human hands and not what God says, but God helps=\r\n when you need it most and are not afraid to ask him and the things you NEE=\r\nD (not want) will come to pass in some strange way. Anyway im getting off t=\r\nangent lol.&nbsp; Another thing im sure you have noticed is demons will ass=\r\nume the shape of a loved one or another spirit and just spit lies and fear =\r\nto you or in EVP&#39;s.&nbsp; I think frank gets a lot of this building radios.=\r\n They will just blatantly lie just to see you get in trouble or cause heart=\r\nache for you or people close to you.&nbsp; If you want me to explain more t=\r\nhen let me know but im not sure ill post it here on the forum unless people=\r\n really want to hear. &lt;br&gt;&lt;br&gt;Onyx&lt;br&gt;&lt;/div&gt;&lt;div style=3D&quot;font-family: time=\r\ns new roman,new york,times,serif; font-size: 12pt;&quot;&gt;&lt;br&gt;&lt;div\n style=3D&quot;bord=\r\ner-left: 2px solid rgb(16, 16, 255); margin: 5px 0px 5px 5px; padding-left:=\r\n 5px; font-family: times new roman,new york,times,serif; font-size: 12pt;&quot;&gt;=\r\n&lt;font face=3D&quot;Tahoma&quot; size=3D&quot;2&quot;&gt;&lt;hr size=3D&quot;1&quot;&gt;&lt;b&gt;&lt;span style=3D&quot;font-weig=\r\nht: bold;&quot;&gt;From:&lt;/span&gt;&lt;/b&gt; michellewisbith &lt;mwisbith@...&gt;&lt;br=\r\n&gt;&lt;b&gt;&lt;span style=3D&quot;font-weight: bold;&quot;&gt;To:&lt;/span&gt;&lt;/b&gt; EVP-ITC@yahoogroups.c=\r\nom&lt;br&gt;&lt;b&gt;&lt;span style=3D&quot;font-weight: bold;&quot;&gt;Sent:&lt;/span&gt;&lt;/b&gt; Wed, December =\r\n9, 2009 11:47:09 AM&lt;br&gt;&lt;b&gt;&lt;span style=3D&quot;font-weight: bold;&quot;&gt;Subject:&lt;/span=\r\n&gt;&lt;/b&gt; [EVP-ITC] Why do entities lie?&lt;br&gt;&lt;/font&gt;&lt;br&gt;\n\n\n\n\n\n\n\n&lt;span style=3D&quot;d=\r\nisplay: none;&quot;&gt;&nbsp;&lt;/span&gt;\n\n\n\n    &lt;div id=3D&quot;ygrp-text&quot;&gt;\n      \n      \n  =\r\n    &lt;p&gt;&lt;br&gt;\n&lt;br&gt;\nHello, all.&lt;br&gt;\n&lt;br&gt;\nMy name is Michelle.  I&#39;m a certified=\r\n medium with a Spiritualist church.  This was a two year process which invo=\r\nlved proving I can communicate with spirits to a  congregation (not braggin=\r\ng - just trying to explain my background and why I know what I do). I&#39;m als=\r\no one of the biggest skeptics you&#39;ll ever meet (It was one of two reasons I=\r\n became a medium.  I wanted to see how they were &quot;faking&quot; it.  Surprise!  T=\r\nhey weren&#39;t). I&#39;d like to contribute what I&#39;ve learned about spirits.  As J=\r\nill wrote, &quot;I(t) really takes personal experience to believe this stuff exi=\r\nsts&quot;.&lt;br&gt;\n&lt;br&gt;\nAs to her main question of &quot;Why do spirits lie&quot;, I don&#39;t thi=\r\nnk we can always assume they&#39;re lying.  If the information comes through a =\r\nmedium, one of the first items to address is whether or not the medium rece=\r\nived the message correctly and then whether or not he/she interepreted it c=\r\norrectly and phrased it in a way that allowed the recipient to understand t=\r\nhe spirit&#39;s meaning.  There are a variety of ways spirits communicate with =\r\nmediums; some are easier than others to understand and pass on.  For the ha=\r\nrder methods, it would be possible for a medium to inadvertently misinterep=\r\nt the message based on his/her past experiences.  &lt;br&gt;\n&lt;br&gt;\nWhen we look at=\r\n the question from the connection to EVP&#39;s and ghost boxes, we have to exam=\r\nine a few items.  Was the spirit able to use the devices correctly to form =\r\nthe words he/she actually intended? This is a two step process. It can be d=\r\nifficult for them to not only pull the available energy into a useable form=\r\n, but to also form the correct words (think it as a foreigner learning Engl=\r\nish and saying &quot;car&quot; when they mean &quot;star&quot;. They sound similar, but have ve=\r\nry different meanings). &lt;br&gt;\n&lt;br&gt;\nDid we understand the words they said?  I=\r\nt&#39;s fairly easy to get them wrong, especially in instances where you aren&#39;t=\r\n the first person to listen to the recording and someone else says, &quot;Here l=\r\nisten to this.  I think they&#39;re saying (fill in the blank)&quot;.  Our brains ar=\r\ne going to tell us (fill in the blank) simply because that thought is now p=\r\nrevalent.  If we&#39;re the only person listening to the recordings, the same m=\r\nistake can be made.  The only conclusive way is to use equipment that can a=\r\nmplify and break down the recordings to make them clear enough to be agreed=\r\n upon by a number of people who don&#39;t know what conclusions the other liste=\r\nners have drawn.  &lt;br&gt;\n&lt;br&gt;\nThe idea of a spirit distorting the facts must =\r\nalso be considered.  Not lying, per se, but rather getting the facts within=\r\n their reality confused. This is where you have the right to have the facts=\r\n validated by the spirit.  Ask them to prove it to you.  They can tell you =\r\nsome corresponding items that back up their claims, direct you to old newsp=\r\naper stories or to a person they used to affiliate with or bring the valida=\r\ntion into your focus (meaning the same thing comes into your life while you=\r\n&#39;re driving/working/ at home/talking to someone/reading and etc.) at least =\r\nthree times.  A spirit who is being truthful will not mind trying to make t=\r\nhis happen.  &lt;br&gt;\n&lt;br&gt;\nOnce these have been considered and eliminated, then=\r\n we should be willing to entertain the idea the spirit may be a lower energ=\r\ny being (a bully/swindler/ con-man or woman/narcissist and etc) in their pa=\r\nst life and this is the only way they know how to achieve what they want.  =\r\nAnd yes, those spirits do exist.  &quot;As in life, so in death&quot;, meaning our pe=\r\nrsonalities don&#39;t change when our bodies die.&lt;br&gt;\n&lt;br&gt;\nAl, maybe he wasn&#39;t =\r\ntrying to prove anything.  Is it possible the spirit voice didn&#39;t mean he W=\r\nAS (typed larger for emphasis) Steve Tate, but rather wanted to talk ABOUT =\r\nSteve Tate or get a message TO Steve Tate?  Did he mean to say &quot;Still fate&quot;=\r\n?  Could he have meant &quot;paratrooper&quot; ?  See where I&#39;m going with this? &lt;br&gt;=\r\n\n&lt;br&gt;\nAnd finally, in regards to the &quot;end of the world stuff&quot;, it has been =\r\ntaught to me by mediums and teachers who were all very honest and excellent=\r\n at what they do, and it has been relayed to me by spirits I&#39;ve encountered=\r\n in my mediumship service that we don&#39;t have a free glimpse of the future o=\r\nnce our bodies die and we move into spirit form.  I mean no offense and I&#39;m=\r\n not impying that wasn&#39;t what was heard.  That said (or rather &#39;typed&#39;), I&#39;=\r\nd be VERY hesitant to believe this communication.  There are beings that ar=\r\ne privvy to the potential (underscore &quot;potential&quot;) future in our lives, but=\r\n it isn&#39;t their nature to join us for EVP sessions.  &lt;br&gt;\n&lt;br&gt;\nI hope I hav=\r\nen&#39;t taken liberty with this forum by posting such a long reply. I thank yo=\r\nu for your time and attention. If you have other questions or would like me=\r\n to clarify something, please ask.  I&#39;d be honored to share what I know and=\r\n track down what I don&#39;t.  :) &lt;br&gt;\n&lt;br&gt;\nMichelle&lt;br&gt;\n&lt;br&gt;\n&lt;/p&gt;\n\n    &lt;/div&gt;\n=\r\n     \n\n\n\n\n&lt;/div&gt;&lt;/div&gt;\n&lt;!-- cg17.c2.mail.ac4.yahoo.com compressed/chunked T=\r\nue Dec  8 16:56:06 PST 2009 --&gt;\n&lt;/div&gt;&lt;/body&gt;&lt;/html&gt;\r\n--0-1277749949-1260389300=:95022--"}