{"id": "16387", "subject": "Why do entities lie?", "author": "michellewisbith", "timestamp": "2009-12-09T18:47:09Z", "full_text": "Hello, all.\n\nMy name is Michelle.  I&#39;m a certified medium with a Spiritualist church.  This was a two year process which involved proving I can communicate with spirits to a  congregation (not bragging - just trying to explain my background and why I know what I do). I&#39;m also one of the biggest skeptics you&#39;ll ever meet (It was one of two reasons I became a medium.  I wanted to see how they were &quot;faking&quot; it.  Surprise!  They weren&#39;t). I&#39;d like to contribute what I&#39;ve learned about spirits.  As Jill wrote, &quot;I(t) really takes personal experience to believe this stuff exists&quot;.\n\nAs to her main question of &quot;Why do spirits lie&quot;, I don&#39;t think we can always assume they&#39;re lying.  If the information comes through a medium, one of the first items to address is whether or not the medium received the message correctly and then whether or not he/she interepreted it correctly and phrased it in a way that allowed the recipient to understand the spirit&#39;s meaning.  There are a variety of ways spirits communicate with mediums; some are easier than others to understand and pass on.  For the harder methods, it would be possible for a medium to inadvertently misinterept the message based on his/her past experiences.  \n\nWhen we look at the question from the connection to EVP&#39;s and ghost boxes, we have to examine a few items.  Was the spirit able to use the devices correctly to form the words he/she actually intended? This is a two step process. It can be difficult for them to not only pull the available energy into a useable form, but to also form the correct words (think it as a foreigner learning English and saying &quot;car&quot; when they mean &quot;star&quot;. They sound similar, but have very different meanings). \n\nDid we understand the words they said?  It&#39;s fairly easy to get them wrong, especially in instances where you aren&#39;t the first person to listen to the recording and someone else says, &quot;Here listen to this.  I think they&#39;re saying (fill in the blank)&quot;.  Our brains are going to tell us (fill in the blank) simply because that thought is now prevalent.  If we&#39;re the only person listening to the recordings, the same mistake can be made.  The only conclusive way is to use equipment that can amplify and break down the recordings to make them clear enough to be agreed upon by a number of people who don&#39;t know what conclusions the other listeners have drawn.  \n\nThe idea of a spirit distorting the facts must also be considered.  Not lying, per se, but rather getting the facts within their reality confused. This is where you have the right to have the facts validated by the spirit.  Ask them to prove it to you.  They can tell you some corresponding items that back up their claims, direct you to old newspaper stories or to a person they used to affiliate with or bring the validation into your focus (meaning the same thing comes into your life while you&#39;re driving/working/at home/talking to someone/reading and etc.) at least three times.  A spirit who is being truthful will not mind trying to make this happen.  \n\nOnce these have been considered and eliminated, then we should be willing to entertain the idea the spirit may be a lower energy being (a bully/swindler/con-man or woman/narcissist and etc) in their past life and this is the only way they know how to achieve what they want.  And yes, those spirits do exist.  &quot;As in life, so in death&quot;, meaning our personalities don&#39;t change when our bodies die.\n\nAl, maybe he wasn&#39;t trying to prove anything.  Is it possible the spirit voice didn&#39;t mean he WAS (typed larger for emphasis) Steve Tate, but rather wanted to talk ABOUT Steve Tate or get a message TO Steve Tate?  Did he mean to say &quot;Still fate&quot;?  Could he have meant &quot;paratrooper&quot;?  See where I&#39;m going with this? \n\nAnd finally, in regards to the &quot;end of the world stuff&quot;, it has been taught to me by mediums and teachers who were all very honest and excellent at what they do, and it has been relayed to me by spirits I&#39;ve encountered in my mediumship service that we don&#39;t have a free glimpse of the future once our bodies die and we move into spirit form.  I mean no offense and I&#39;m not impying that wasn&#39;t what was heard.  That said (or rather &#39;typed&#39;), I&#39;d be VERY hesitant to believe this communication.  There are beings that are privvy to the potential (underscore &quot;potential&quot;) future in our lives, but it isn&#39;t their nature to join us for EVP sessions.  \n\nI hope I haven&#39;t taken liberty with this forum by posting such a long reply. I thank you for your time and attention. If you have other questions or would like me to clarify something, please ask.  I&#39;d be honored to share what I know and track down what I don&#39;t.  :) \n\nMichelle"}