{"id": "16391", "subject": "Re: [EVP-ITC] Why do entities lie?", "author": "Rj", "timestamp": "2009-12-09T23:50:18Z", "full_text": "--0-709897104-1260402618=:72041\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nPrimarily the people who care are those selling books about it, making TV=\r\n=C2=A0 specials, putting movies in theaters, and those who have either forg=\r\notten about all the previous end-of-world predictions that didn&#39;t come to p=\r\nass, or those who need to feel special by having some &#39;future knowledge&#39;, o=\r\nr who have been &#39;chosen&#39; by the spirits, or something.\n\nWell, anyway, I&#39;m s=\r\nure they will enjoy themselves,=C2=A0 until about Dec 24, 2012, when they&#39;l=\r\nl have to come up with some new date (and then try to avoid the questions a=\r\nbout how they could have believed it all in the first place).\n\n--- On Wed, =\r\n12/9/09, don powell &lt;dpowell7299@...&gt; wrote:\n\nFrom: don powell &lt;dpowe=\r\nll7299@...&gt;\nSubject: Re: [EVP-ITC] Why do entities lie?\nTo: EVP-ITC@y=\r\nahoogroups.com\nDate: Wednesday, December 9, 2009, 2:43 PM\n\n\n\n\n\n\n\n=C2=A0\n\n\n\n=\r\n  \n\n\n    \n      \n      \n      \nI&#39;ve always loved this end of the world stuf=\r\nf. =C2=A0The way I see it, if the world ends, I&#39;m dead and I don&#39;t care. =\r\n=C2=A0I could just as easily die tomorrow driving to work. =C2=A0So if ther=\r\ne is something you should do while you are alive then do it. =C2=A0Otherwis=\r\ne who cares about worlds ending?\nDon\nFrom: Frank Sumption &lt;purplealiengirl@=\r\n gmail.com&gt;\nTo:\n EVP-ITC@yahoogroups .com\nSent: Wed, December 9, 2009 3:24:=\r\n46 PM\nSubject: Re: [EVP-ITC] Why do entities lie?\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n=C2=A0\n\n=\r\n\n\n    \n      \n      \n      =C2=A0I&#39;ve been doing &quot;box&quot; work for almost ten =\r\nyears, and I still get to the decepticons( liars). Perhaps it&#39;s just a leve=\r\nl out there, as I think there is an inifinite number of levels and/or demen=\r\nsions. Maybe there is a demonic level? I have a group that communicates, an=\r\nd they usually tell &quot;this is an apple&quot;, a metaphor for a truth. Not all of =\r\nthese voices are spirit per se`, some have never been human,=C2=A0there is =\r\na group out there called the fish group, a group of entities that exist off=\r\n planet and really enjoy screwing with EVPers. =C2=A0I think it was the peo=\r\nple-I forget their names, experimenting in Luxemberg quite some time ago th=\r\nat first got the Fish Group. \n\n=C2=A0\n=C2=A0For me, I don&#39;t really care wha=\r\nt comes through, it&#39;s the fact that something talks that shouldn&#39;t be there=\r\n, my approach hasd always been on the technical side. \n=C2=A0\n=C2=A0I get s=\r\nome mediumistic contacts/visions, and I have some spirits that seemingly pr=\r\nefer telepathic contacts, but I don&#39;t take=C2=A0that as anymore gosple than=\r\n anything else. Most of the=C2=A0&quot;communication&quot; tends to be extremely triv=\r\nial in nature. \n\n=C2=A0\n=C2=A0As far as end of the world stuff, I do get th=\r\nat, alot of it, in almost every session, they insist it&#39;s true, at least as=\r\n far as end of the cycle goes, but, and it&#39;s a big but, who knows what leve=\r\nl/source that is from--they claim not to be human. Plus we do have access t=\r\no the future, if I do my meditation regularly I see almost everything ahead=\r\n of time, plus I dream it, and I know everyone on this planet. I would expe=\r\nct spirit to be much more aware, at least after they reach a higher state. =\r\nHuman is not the highest level, so you can&#39;t compare everything to what y&#39;a=\r\nll think you know. \n\n=C2=A0\n=C2=A0Frank-S\n=C2=A0\n=C2=A0\n=C2=A0\n\n\n=C2=A0\nOn =\r\nWed, Dec 9, 2009 at 11:47 AM, michellewisbith &lt;mwisbith@hotmail. com&gt; wrote=\r\n:\n\n\n=C2=A0 \n\n\n\n\n\nHello, all.\n\nMy name is Michelle. I&#39;m a certified medium w=\r\nith a Spiritualist church. This was a two year process which involved provi=\r\nng I can communicate with spirits to a congregation (not bragging - just tr=\r\nying to explain my background and why I know what I do). I&#39;m also one of th=\r\ne biggest skeptics you&#39;ll ever meet (It was one of two reasons I became a m=\r\nedium. I wanted to see how they were &quot;faking&quot; it. Surprise! They weren&#39;t). =\r\nI&#39;d like to contribute what I&#39;ve learned about spirits. As Jill wrote, &quot;I(t=\r\n) really takes personal experience to believe this stuff exists&quot;.\n\n\nAs to h=\r\ner main question of &quot;Why do spirits lie&quot;, I don&#39;t think we can always assum=\r\ne they&#39;re lying. If the information comes through a medium, one of the firs=\r\nt items to address is whether or not the medium received the message correc=\r\ntly and then whether or not he/she interepreted it correctly and phrased it=\r\n in a way that allowed the recipient to understand the spirit&#39;s meaning. Th=\r\nere are a variety of ways spirits communicate with mediums; some are easier=\r\n than others to understand and pass on. For the harder methods, it would be=\r\n possible for a medium to inadvertently misinterept the message based on hi=\r\ns/her past experiences. \n\n\nWhen we look at the question from the connection=\r\n to EVP&#39;s and ghost boxes, we have to examine a few items. Was the spirit a=\r\nble to use the devices correctly to form the words he/she actually intended=\r\n? This is a two step process. It can be difficult for them to not only pull=\r\n the available energy into a useable form, but to also form the correct wor=\r\nds (think it as a foreigner learning English and saying &quot;car&quot; when they mea=\r\nn &quot;star&quot;. They sound similar, but have very different meanings). \n\n\nDid we =\r\nunderstand the words they said? It&#39;s fairly easy to get them wrong, especia=\r\nlly in instances where you aren&#39;t the first person to listen to the recordi=\r\nng and someone else says, &quot;Here listen to this. I think they&#39;re saying (fil=\r\nl in the blank)&quot;. Our brains are going to tell us (fill in the blank) simpl=\r\ny because that thought is now prevalent. If we&#39;re the only person listening=\r\n to the recordings, the same mistake can be made. The only conclusive way i=\r\ns to use equipment that can amplify and break down the recordings to make t=\r\nhem clear enough to be agreed upon by a number of people who don&#39;t know wha=\r\nt conclusions the other listeners have drawn. \n\n\nThe idea of a spirit disto=\r\nrting the facts must also be considered. Not lying, per se, but rather gett=\r\ning the facts within their reality confused. This is where you have the rig=\r\nht to have the facts validated by the spirit. Ask them to prove it to you. =\r\nThey can tell you some corresponding items that back up their claims, direc=\r\nt you to old newspaper stories or to a person they used to affiliate with o=\r\nr bring the validation into your focus (meaning the same thing comes into y=\r\nour life while you&#39;re driving/working/ at home/talking to someone/reading a=\r\nnd etc.) at least three times. A spirit who is being truthful will not mind=\r\n trying to make this happen. \n\n\nOnce these have been considered and elimina=\r\nted, then we should be willing to entertain the idea the spirit may be a lo=\r\nwer energy being (a bully/swindler/ con-man or woman/narcissist and etc) in=\r\n their past life and this is the only way they know how to achieve what the=\r\ny want. And yes, those spirits do exist. &quot;As in life, so in death&quot;, meaning=\r\n our personalities don&#39;t change when our bodies die.\n\n\nAl, maybe he wasn&#39;t =\r\ntrying to prove anything. Is it possible the spirit voice didn&#39;t mean he WA=\r\nS (typed larger for emphasis) Steve Tate, but rather wanted to talk ABOUT S=\r\nteve Tate or get a message TO Steve Tate? Did he mean to say &quot;Still fate&quot;? =\r\nCould he have meant &quot;paratrooper&quot; ? See where I&#39;m going with this? \n\n\nAnd f=\r\ninally, in regards to the &quot;end of the world stuff&quot;, it has been taught to m=\r\ne by mediums and teachers who were all very honest and excellent at what th=\r\ney do, and it has been relayed to me by spirits I&#39;ve encountered in my medi=\r\numship service that we don&#39;t have a free glimpse of the future once our bod=\r\nies die and we move into spirit form. I mean no offense and I&#39;m not impying=\r\n that wasn&#39;t what was heard. That said (or rather &#39;typed&#39;), I&#39;d be VERY hes=\r\nitant to believe this communication. There are beings that are privvy to th=\r\ne potential (underscore &quot;potential&quot;) future in our lives, but it isn&#39;t thei=\r\nr nature to join us for EVP sessions. \n\n\nI hope I haven&#39;t taken liberty wit=\r\nh this forum by posting such a long reply. I thank you for your time and at=\r\ntention. If you have other questions or would like me to clarify something,=\r\n please ask. I&#39;d be honored to share what I know and track down what I don&#39;=\r\nt. :) \n\n\nMichelle\n\n\n\n\n\n\n    \n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n    \n     \n\n    \n    \n\n\n =\r\n\n\n\n\n  \n\n\n\n\n\n\n      \r\n--0-709897104-1260402618=:72041\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;Primarily the people who care are those selli=\r\nng books about it, making TV&nbsp; specials, putting movies in theaters, an=\r\nd those who have either forgotten about all the previous end-of-world predi=\r\nctions that didn&#39;t come to pass, or those who need to feel special by havin=\r\ng some &#39;future knowledge&#39;, or who have been &#39;chosen&#39; by the spirits, or som=\r\nething.&lt;br&gt;&lt;br&gt;Well, anyway, I&#39;m sure they will enjoy themselves,&nbsp; unt=\r\nil about Dec 24, 2012, when they&#39;ll have to come up with some new date (and=\r\n then try to avoid the questions about how they could have believed it all =\r\nin the first place).&lt;br&gt;&lt;br&gt;--- On &lt;b&gt;Wed, 12/9/09, don powell &lt;i&gt;&lt;dpowe=\r\nll7299@...&gt;&lt;/i&gt;&lt;/b&gt; wrote:&lt;br&gt;&lt;blockquote style=3D&quot;border-left: 2p=\r\nx solid rgb(16, 16, 255); margin-left: 5px; padding-left: 5px;&quot;&gt;&lt;br&gt;From: d=\r\non powell &lt;dpowell7299@...&gt;&lt;br&gt;Subject: Re: [EVP-ITC] Why do\n e=\r\nntities lie?&lt;br&gt;To: EVP-ITC@yahoogroups.com&lt;br&gt;Date: Wednesday, December 9,=\r\n 2009, 2:43 PM&lt;br&gt;&lt;br&gt;&lt;div id=3D&quot;yiv777936814&quot;&gt;\n\n\n\n\n\n&lt;span style=3D&quot;display=\r\n: none;&quot;&gt;&nbsp;&lt;/span&gt;\n\n\n\n    &lt;div id=3D&quot;ygrp-text&quot;&gt;\n      \n      \n      &lt;p=\r\n&gt;&lt;/p&gt;&lt;div style=3D&quot;font-family: &#39;times new roman&#39;,&#39;new york&#39;,times,serif; f=\r\nont-size: 12pt;&quot;&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;I&#39;ve always loved this end of the worl=\r\nd stuff. &nbsp;The way I see it, if the world ends, I&#39;m dead and I don&#39;t ca=\r\nre. &nbsp;I could just as easily die tomorrow driving to work. &nbsp;So if =\r\nthere is something you should do while you are alive then do it. &nbsp;Othe=\r\nrwise who cares about worlds ending?&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;Don&lt;/div&gt;&lt;div=\r\n style=3D&quot;font-family: times new roman,new york,times,serif; font-size: 12p=\r\nt;&quot;&gt;&lt;br&gt;&lt;div style=3D&quot;border-left: 2px solid rgb(16, 16, 255); font-family:=\r\n times new roman,new york,times,serif; font-size: 12pt;&quot;&gt;&lt;font face=3D&quot;Taho=\r\nma&quot; size=3D&quot;2&quot;&gt;&lt;hr size=3D&quot;1&quot;&gt;&lt;b&gt;&lt;span style=3D&quot;font-weight: bold;&quot;&gt;From:&lt;/=\r\nspan&gt;&lt;/b&gt; Frank Sumption &lt;purplealiengirl@ gmail.com&gt;&lt;br&gt;&lt;b&gt;&lt;span sty=\r\nle=3D&quot;font-weight: bold;&quot;&gt;To:&lt;/span&gt;&lt;/b&gt;\n EVP-ITC@yahoogroups .com&lt;br&gt;&lt;b&gt;&lt;s=\r\npan style=3D&quot;font-weight: bold;&quot;&gt;Sent:&lt;/span&gt;&lt;/b&gt; Wed, December 9, 2009 3:2=\r\n4:46 PM&lt;br&gt;&lt;b&gt;&lt;span style=3D&quot;font-weight: bold;&quot;&gt;Subject:&lt;/span&gt;&lt;/b&gt; Re: [E=\r\nVP-ITC] Why do entities lie?&lt;br&gt;&lt;/font&gt;&lt;br&gt;\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n&lt;span&gt;&nbsp;&lt;/sp=\r\nan&gt;\n\n\n\n    &lt;div id=3D&quot;ygrp-text&quot;&gt;\n      \n      \n      &lt;p&gt;&lt;/p&gt;&lt;div&gt;&nbsp;I&#39;v=\r\ne been doing &quot;box&quot; work for almost ten years, and I still get to the decept=\r\nicons( liars). Perhaps it&#39;s just a level out there, as I think there is an =\r\ninifinite number of levels and/or demensions. Maybe there is a demonic leve=\r\nl? I have a group that communicates, and they usually tell &quot;this is an appl=\r\ne&quot;, a metaphor for a truth. Not all of these voices are spirit per se`, som=\r\ne have never been human,&nbsp;there is a group out there called the fish gr=\r\noup, a group of entities that exist off planet and really enjoy screwing wi=\r\nth EVPers. &nbsp;I think it was the people-I forget their names, experiment=\r\ning in Luxemberg quite some time ago that first got the Fish Group. &lt;/div&gt;\n=\r\n\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;For me, I don&#39;t really care what comes throug=\r\nh, it&#39;s the fact that something talks that shouldn&#39;t be there, my approach =\r\nhasd always been on the technical side. &lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp=\r\n;I get some mediumistic contacts/visions, and I have some spirits that seem=\r\ningly prefer telepathic contacts, but I don&#39;t take&nbsp;that as anymore gos=\r\nple than anything else. Most of the&nbsp;&quot;communication&quot; tends to be extrem=\r\nely trivial in nature. &lt;/div&gt;\n\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;As far as end o=\r\nf the world stuff, I do get that, alot of it, in almost every session, they=\r\n insist it&#39;s true, at least as far as end of the cycle goes, but, and it&#39;s =\r\na big but, who knows what level/source that is from--they claim not to be h=\r\numan. Plus we do have access to the future, if I do my meditation regularly=\r\n I see almost everything ahead of time, plus I dream it, and I know everyon=\r\ne on this planet. I would expect spirit to be much more aware, at least aft=\r\ner they reach a higher state. Human is not the highest level, so you can&#39;t =\r\ncompare everything to what y&#39;all think you know. &lt;/div&gt;\n\n&lt;div&gt;&nbsp;&lt;/div&gt;\n=\r\n&lt;div&gt;&nbsp;Frank-S&lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/d=\r\niv&gt;\n&lt;div&gt;&lt;br&gt;&lt;br&gt;&nbsp;&lt;/div&gt;\n&lt;div class=3D&quot;gmail_quote&quot;&gt;On Wed, Dec 9, 200=\r\n9 at 11:47 AM, michellewisbith &lt;span dir=3D&quot;ltr&quot;&gt;&lt;&lt;a rel=3D&quot;nofollow&quot; ym=\r\nailto=3D&quot;mailto:mwisbith@...&quot; target=3D&quot;_blank&quot; href=3D&quot;/mc/compose=\r\n?to=3Dmwisbith@...&quot;&gt;mwisbith@hotmail. com&lt;/a&gt;&gt;&lt;/span&gt; wrote:&lt;br&gt;=\r\n\n&lt;blockquote class=3D&quot;gmail_quote&quot; style=3D&quot;border-left: 1px solid rgb(204,=\r\n 204, 204);&quot;&gt;\n&lt;div style=3D&quot;background-color: rgb(255, 255, 255);&quot;&gt;&lt;span&gt;&n=\r\nbsp;&lt;/span&gt; \n&lt;div&gt;\n&lt;div&gt;\n&lt;div&gt;\n&lt;p&gt;&lt;br&gt;&lt;br&gt;Hello, all.&lt;br&gt;&lt;br&gt;My name is Mic=\r\nhelle. I&#39;m a certified medium with a Spiritualist church. This was a two ye=\r\nar process which involved proving I can communicate with spirits to a congr=\r\negation (not bragging - just trying to explain my background and why I know=\r\n what I do). I&#39;m also one of the biggest skeptics you&#39;ll ever meet (It was =\r\none of two reasons I became a medium. I wanted to see how they were &quot;faking=\r\n&quot; it. Surprise! They weren&#39;t). I&#39;d like to contribute what I&#39;ve learned abo=\r\nut spirits. As Jill wrote, &quot;I(t) really takes personal experience to believ=\r\ne this stuff exists&quot;.&lt;br&gt;\n&lt;br&gt;As to her main question of &quot;Why do spirits li=\r\ne&quot;, I don&#39;t think we can always assume they&#39;re lying. If the information co=\r\nmes through a medium, one of the first items to address is whether or not t=\r\nhe medium received the message correctly and then whether or not he/she int=\r\nerepreted it correctly and phrased it in a way that allowed the recipient t=\r\no understand the spirit&#39;s meaning. There are a variety of ways spirits comm=\r\nunicate with mediums; some are easier than others to understand and pass on=\r\n. For the harder methods, it would be possible for a medium to inadvertentl=\r\ny misinterept the message based on his/her past experiences. &lt;br&gt;\n&lt;br&gt;When =\r\nwe look at the question from the connection to EVP&#39;s and ghost boxes, we ha=\r\nve to examine a few items. Was the spirit able to use the devices correctly=\r\n to form the words he/she actually intended? This is a two step process. It=\r\n can be difficult for them to not only pull the available energy into a use=\r\nable form, but to also form the correct words (think it as a foreigner lear=\r\nning English and saying &quot;car&quot; when they mean &quot;star&quot;. They sound similar, bu=\r\nt have very different meanings). &lt;br&gt;\n&lt;br&gt;Did we understand the words they =\r\nsaid? It&#39;s fairly easy to get them wrong, especially in instances where you=\r\n aren&#39;t the first person to listen to the recording and someone else says, =\r\n&quot;Here listen to this. I think they&#39;re saying (fill in the blank)&quot;. Our brai=\r\nns are going to tell us (fill in the blank) simply because that thought is =\r\nnow prevalent. If we&#39;re the only person listening to the recordings, the sa=\r\nme mistake can be made. The only conclusive way is to use equipment that ca=\r\nn amplify and break down the recordings to make them clear enough to be agr=\r\need upon by a number of people who don&#39;t know what conclusions the other li=\r\nsteners have drawn. &lt;br&gt;\n&lt;br&gt;The idea of a spirit distorting the facts must=\r\n also be considered. Not lying, per se, but rather getting the facts within=\r\n their reality confused. This is where you have the right to have the facts=\r\n validated by the spirit. Ask them to prove it to you. They can tell you so=\r\nme corresponding items that back up their claims, direct you to old newspap=\r\ner stories or to a person they used to affiliate with or bring the validati=\r\non into your focus (meaning the same thing comes into your life while you&#39;r=\r\ne driving/working/ at home/talking to someone/reading and etc.) at least th=\r\nree times. A spirit who is being truthful will not mind trying to make this=\r\n happen. &lt;br&gt;\n&lt;br&gt;Once these have been considered and eliminated, then we s=\r\nhould be willing to entertain the idea the spirit may be a lower energy bei=\r\nng (a bully/swindler/ con-man or woman/narcissist and etc) in their past li=\r\nfe and this is the only way they know how to achieve what they want. And ye=\r\ns, those spirits do exist. &quot;As in life, so in death&quot;, meaning our personali=\r\nties don&#39;t change when our bodies die.&lt;br&gt;\n&lt;br&gt;Al, maybe he wasn&#39;t trying t=\r\no prove anything. Is it possible the spirit voice didn&#39;t mean he WAS (typed=\r\n larger for emphasis) Steve Tate, but rather wanted to talk ABOUT Steve Tat=\r\ne or get a message TO Steve Tate? Did he mean to say &quot;Still fate&quot;? Could he=\r\n have meant &quot;paratrooper&quot; ? See where I&#39;m going with this? &lt;br&gt;\n&lt;br&gt;And fin=\r\nally, in regards to the &quot;end of the world stuff&quot;, it has been taught to me =\r\nby mediums and teachers who were all very honest and excellent at what they=\r\n do, and it has been relayed to me by spirits I&#39;ve encountered in my medium=\r\nship service that we don&#39;t have a free glimpse of the future once our bodie=\r\ns die and we move into spirit form. I mean no offense and I&#39;m not impying t=\r\nhat wasn&#39;t what was heard. That said (or rather &#39;typed&#39;), I&#39;d be VERY hesit=\r\nant to believe this communication. There are beings that are privvy to the =\r\npotential (underscore &quot;potential&quot;) future in our lives, but it isn&#39;t their =\r\nnature to join us for EVP sessions. &lt;br&gt;\n&lt;br&gt;I hope I haven&#39;t taken liberty=\r\n with this forum by posting such a long reply. I thank you for your time an=\r\nd attention. If you have other questions or would like me to clarify someth=\r\ning, please ask. I&#39;d be honored to share what I know and track down what I =\r\ndon&#39;t. :) &lt;br&gt;\n&lt;br&gt;Michelle&lt;br&gt;&lt;br&gt;&lt;/p&gt;&lt;/div&gt;\n&lt;div style=3D&quot;color: rgb(255,=\r\n 255, 255);&quot;&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/blockquote&gt;&lt;/div&gt;&lt;br&gt;\n\n\n    &lt;/div&gt;\n =\r\n    \n\n\n\n\n\n\n\n\n\n&lt;/div&gt;&lt;/div&gt;&lt;div&gt;&lt;/div&gt;\n\n\n\n&lt;/div&gt;\n\n    &lt;/div&gt;\n     \n\n\n\n \n\n\n&lt;/=\r\ndiv&gt;&lt;/blockquote&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n      \r\n--0-709897104-1260402618=:72041--"}