{"id": "16390", "subject": "Re: [EVP-ITC] Why do entities lie?", "author": "don powell", "timestamp": "2009-12-09T22:43:47Z", "full_text": "--0-1267965246-1260398627=:68562\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n\n\nI&#39;ve always loved this end of the world stuff.  The way I see it, if the =\r\nworld ends, I&#39;m dead and I don&#39;t care.  I could just as easily die tomorrow=\r\n driving to work.  So if there is something you should do while you are ali=\r\nve then do it.  Otherwise who cares about worlds ending?\n\nDon\n\n\n\n__________=\r\n______________________\nFrom: Frank Sumption &lt;purplealiengirl@...&gt;\nTo:=\r\n EVP-ITC@yahoogroups.com\nSent: Wed, December 9, 2009 3:24:46 PM\nSubject: Re=\r\n: [EVP-ITC] Why do entities lie?\n\n  \n I&#39;ve been doing &quot;box&quot; work for almost=\r\n ten years, and I still get to the decepticons( liars). Perhaps it&#39;s just a=\r\n level out there, as I think there is an inifinite number of levels and/or =\r\ndemensions. Maybe there is a demonic level? I have a group that communicate=\r\ns, and they usually tell &quot;this is an apple&quot;, a metaphor for a truth. Not al=\r\nl of these voices are spirit per se`, some have never been human, there is =\r\na group out there called the fish group, a group of entities that exist off=\r\n planet and really enjoy screwing with EVPers.  I think it was the people-I=\r\n forget their names, experimenting in Luxemberg quite some time ago that fi=\r\nrst got the Fish Group. \n \n For me, I don&#39;t really care what comes through,=\r\n it&#39;s the fact that something talks that shouldn&#39;t be there, my approach ha=\r\nsd always been on the technical side. \n \n I get some mediumistic contacts/v=\r\nisions, and I have some spirits that seemingly prefer telepathic contacts, =\r\nbut I don&#39;t take that as anymore gosple than anything else. Most of the &quot;co=\r\nmmunication&quot; tends to be extremely trivial in nature. \n \n As far as end of =\r\nthe world stuff, I do get that, alot of it, in almost every session, they i=\r\nnsist it&#39;s true, at least as far as end of the cycle goes, but, and it&#39;s a =\r\nbig but, who knows what level/source that is from--they claim not to be hum=\r\nan. Plus we do have access to the future, if I do my meditation regularly I=\r\n see almost everything ahead of time, plus I dream it, and I know everyone =\r\non this planet. I would expect spirit to be much more aware, at least after=\r\n they reach a higher state. Human is not the highest level, so you can&#39;t co=\r\nmpare everything to what y&#39;all think you know. \n \n Frank-S\n \n \n \n\n\n \nOn Wed=\r\n, Dec 9, 2009 at 11:47 AM, michellewisbith &lt;mwisbith@hotmail. com&gt; wrote:\n\n=\r\n  \n&gt;\n&gt;\n&gt;Hello, all.\n&gt;\n&gt;My name is Michelle. I&#39;m a certified medium with a S=\r\npiritualist church. This was a two year process which involved proving I ca=\r\nn communicate with spirits to a congregation (not bragging - just trying to=\r\n explain my background and why I know what I do). I&#39;m also one of the bigge=\r\nst skeptics you&#39;ll ever meet (It was one of two reasons I became a medium. =\r\nI wanted to see how they were &quot;faking&quot; it. Surprise! They weren&#39;t). I&#39;d lik=\r\ne to contribute what I&#39;ve learned about spirits. As Jill wrote, &quot;I(t) reall=\r\ny takes personal experience to believe this stuff exists&quot;.\n&gt;\n&gt;As to her mai=\r\nn question of &quot;Why do spirits lie&quot;, I don&#39;t think we can always assume they=\r\n&#39;re lying. If the information comes through a medium, one of the first item=\r\ns to address is whether or not the medium received the message correctly an=\r\nd then whether or not he/she interepreted it correctly and phrased it in a =\r\nway that allowed the recipient to understand the spirit&#39;s meaning. There ar=\r\ne a variety of ways spirits communicate with mediums; some are easier than =\r\nothers to understand and pass on. For the harder methods, it would be possi=\r\nble for a medium to inadvertently misinterept the message based on his/her =\r\npast experiences. \n&gt;\n&gt;When we look at the question from the connection to E=\r\nVP&#39;s and ghost boxes, we have to examine a few items. Was the spirit able t=\r\no use the devices correctly to form the words he/she actually intended? Thi=\r\ns is a two step process. It can be difficult for them to not only pull the =\r\navailable energy into a useable form, but to also form the correct words (t=\r\nhink it as a foreigner learning English and saying &quot;car&quot; when they mean &quot;st=\r\nar&quot;. They sound similar, but have very different meanings). \n&gt;\n&gt;Did we unde=\r\nrstand the words they said? It&#39;s fairly easy to get them wrong, especially =\r\nin instances where you aren&#39;t the first person to listen to the recording a=\r\nnd someone else says, &quot;Here listen to this. I think they&#39;re saying (fill in=\r\n the blank)&quot;. Our brains are going to tell us (fill in the blank) simply be=\r\ncause that thought is now prevalent. If we&#39;re the only person listening to =\r\nthe recordings, the same mistake can be made. The only conclusive way is to=\r\n use equipment that can amplify and break down the recordings to make them =\r\nclear enough to be agreed upon by a number of people who don&#39;t know what co=\r\nnclusions the other listeners have drawn. \n&gt;\n&gt;The idea of a spirit distorti=\r\nng the facts must also be considered. Not lying, per se, but rather getting=\r\n the facts within their reality confused. This is where you have the right =\r\nto have the facts validated by the spirit. Ask them to prove it to you. The=\r\ny can tell you some corresponding items that back up their claims, direct y=\r\nou to old newspaper stories or to a person they used to affiliate with or b=\r\nring the validation into your focus (meaning the same thing comes into your=\r\n life while you&#39;re driving/working/ at home/talking to someone/reading and =\r\netc.) at least three times. A spirit who is being truthful will not mind tr=\r\nying to make this happen. \n&gt;\n&gt;Once these have been considered and eliminate=\r\nd, then we should be willing to entertain the idea the spirit may be a lowe=\r\nr energy being (a bully/swindler/ con-man or woman/narcissist and etc) in t=\r\nheir past life and this is the only way they know how to achieve what they =\r\nwant. And yes, those spirits do exist. &quot;As in life, so in death&quot;, meaning o=\r\nur personalities don&#39;t change when our bodies die.\n&gt;\n&gt;Al, maybe he wasn&#39;t t=\r\nrying to prove anything. Is it possible the spirit voice didn&#39;t mean he WAS=\r\n (typed larger for emphasis) Steve Tate, but rather wanted to talk ABOUT St=\r\neve Tate or get a message TO Steve Tate? Did he mean to say &quot;Still fate&quot;? C=\r\nould he have meant &quot;paratrooper&quot;? See where I&#39;m going with this? \n&gt;\n&gt;And fi=\r\nnally, in regards to the &quot;end of the world stuff&quot;, it has been taught to me=\r\n by mediums and teachers who were all very honest and excellent at what the=\r\ny do, and it has been relayed to me by spirits I&#39;ve encountered in my mediu=\r\nmship service that we don&#39;t have a free glimpse of the future once our bodi=\r\nes die and we move into spirit form. I mean no offense and I&#39;m not impying =\r\nthat wasn&#39;t what was heard. That said (or rather &#39;typed&#39;), I&#39;d be VERY hesi=\r\ntant to believe this communication. There are beings that are privvy to the=\r\n potential (underscore &quot;potential&quot;) future in our lives, but it isn&#39;t their=\r\n nature to join us for EVP sessions. \n&gt;\n&gt;I hope I haven&#39;t taken liberty wit=\r\nh this forum by posting such a long reply. I thank you for your time and at=\r\ntention. If you have other questions or would like me to clarify something,=\r\n please ask. I&#39;d be honored to share what I know and track down what I don&#39;=\r\nt. :) \n&gt;\n&gt;Michelle\n&gt;\n&gt;\n\n \r\n--0-1267965246-1260398627=:68562\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;&lt;head&gt;&lt;style type=3D&quot;text/css&quot;&gt;&lt;!-- DIV {margin:0px;} --&gt;&lt;/style&gt;&lt;/he=\r\nad&gt;&lt;body&gt;&lt;div style=3D&quot;font-family:&#39;times new roman&#39;, &#39;new york&#39;, times, se=\r\nrif;font-size:12pt&quot;&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;I&#39;ve always loved this end of the w=\r\norld stuff. &nbsp;The way I see it, if the world ends, I&#39;m dead and I don&#39;t=\r\n care. &nbsp;I could just as easily die tomorrow driving to work. &nbsp;So =\r\nif there is something you should do while you are alive then do it. &nbsp;O=\r\ntherwise who cares about worlds ending?&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;Don&lt;/div&gt;&lt;=\r\ndiv style=3D&quot;font-family:times new roman, new york, times, serif;font-size:=\r\n12pt&quot;&gt;&lt;br&gt;&lt;div style=3D&quot;padding-left:5px;margin:5px 0px 5px 5px;border-left=\r\n:#1010ff 2px solid;font-family:times new roman, new york, times, serif;font=\r\n-size:12pt&quot;&gt;&lt;font size=3D&quot;2&quot; face=3D&quot;Tahoma&quot;&gt;&lt;hr size=3D&quot;1&quot;&gt;&lt;b&gt;&lt;span style=\r\n=3D&quot;font-weight: bold;&quot;&gt;From:&lt;/span&gt;&lt;/b&gt; Frank Sumption &lt;purplealiengirl=\r\n@...&gt;&lt;br&gt;&lt;b&gt;&lt;span style=3D&quot;font-weight: bold;&quot;&gt;To:&lt;/span&gt;&lt;/b&gt;\n EVP=\r\n-ITC@yahoogroups.com&lt;br&gt;&lt;b&gt;&lt;span style=3D&quot;font-weight: bold;&quot;&gt;Sent:&lt;/span&gt;&lt;=\r\n/b&gt; Wed, December 9, 2009 3:24:46 PM&lt;br&gt;&lt;b&gt;&lt;span style=3D&quot;font-weight: bold=\r\n;&quot;&gt;Subject:&lt;/span&gt;&lt;/b&gt; Re: [EVP-ITC] Why do entities lie?&lt;br&gt;&lt;/font&gt;&lt;br&gt;\n\n\n=\r\n\n\n\n\n\n\n\n\n\n\n\n\n\n&lt;span style=3D&quot;display:none;&quot;&gt;&nbsp;&lt;/span&gt;\n\n\n\n    &lt;div id=3D&quot;=\r\nygrp-text&quot;&gt;\n      \n      \n      &lt;p&gt;&lt;/p&gt;&lt;div&gt;&nbsp;I&#39;ve been doing &quot;box&quot; wor=\r\nk for almost ten years, and I still get to the decepticons( liars). Perhaps=\r\n it&#39;s just a level out there, as I think there is an inifinite number of le=\r\nvels and/or demensions. Maybe there is a demonic level? I have a group that=\r\n communicates, and they usually tell &quot;this is an apple&quot;, a metaphor for a t=\r\nruth. Not all of these voices are spirit per se`, some have never been huma=\r\nn,&nbsp;there is a group out there called the fish group, a group of entiti=\r\nes that exist off planet and really enjoy screwing with EVPers. &nbsp;I thi=\r\nnk it was the people-I forget their names, experimenting in Luxemberg quite=\r\n some time ago that first got the Fish Group. &lt;/div&gt;\n\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;di=\r\nv&gt;&nbsp;For me, I don&#39;t really care what comes through, it&#39;s the fact that =\r\nsomething talks that shouldn&#39;t be there, my approach hasd always been on th=\r\ne technical side. &lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;I get some mediumisti=\r\nc contacts/visions, and I have some spirits that seemingly prefer telepathi=\r\nc contacts, but I don&#39;t take&nbsp;that as anymore gosple than anything else=\r\n. Most of the&nbsp;&quot;communication&quot; tends to be extremely trivial in nature.=\r\n &lt;/div&gt;\n\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;As far as end of the world stuff, I d=\r\no get that, alot of it, in almost every session, they insist it&#39;s true, at =\r\nleast as far as end of the cycle goes, but, and it&#39;s a big but, who knows w=\r\nhat level/source that is from--they claim not to be human. Plus we do have =\r\naccess to the future, if I do my meditation regularly I see almost everythi=\r\nng ahead of time, plus I dream it, and I know everyone on this planet. I wo=\r\nuld expect spirit to be much more aware, at least after they reach a higher=\r\n state. Human is not the highest level, so you can&#39;t compare everything to =\r\nwhat y&#39;all think you know. &lt;/div&gt;\n\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;Frank-S&lt;/di=\r\nv&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&lt;br&gt;&lt;br&gt;&nbsp=\r\n;&lt;/div&gt;\n&lt;div class=3D&quot;gmail_quote&quot;&gt;On Wed, Dec 9, 2009 at 11:47 AM, michell=\r\newisbith &lt;span dir=3D&quot;ltr&quot;&gt;&lt;&lt;a rel=3D&quot;nofollow&quot; ymailto=3D&quot;mailto:mwisbi=\r\nth@...&quot; target=3D&quot;_blank&quot; href=3D&quot;mailto:mwisbith@...&quot;&gt;mwis=\r\nbith@hotmail. com&lt;/a&gt;&gt;&lt;/span&gt; wrote:&lt;br&gt;\n&lt;blockquote class=3D&quot;gmail_quot=\r\ne&quot; style=3D&quot;BORDER-LEFT:#ccc 1px solid;&quot;&gt;\n&lt;div style=3D&quot;BACKGROUND-COLOR:#f=\r\nff;&quot;&gt;&lt;span&gt;&nbsp;&lt;/span&gt; \n&lt;div&gt;\n&lt;div&gt;\n&lt;div&gt;\n&lt;p&gt;&lt;br&gt;&lt;br&gt;Hello, all.&lt;br&gt;&lt;br&gt;M=\r\ny name is Michelle. I&#39;m a certified medium with a Spiritualist church. This=\r\n was a two year process which involved proving I can communicate with spiri=\r\nts to a congregation (not bragging - just trying to explain my background a=\r\nnd why I know what I do). I&#39;m also one of the biggest skeptics you&#39;ll ever =\r\nmeet (It was one of two reasons I became a medium. I wanted to see how they=\r\n were &quot;faking&quot; it. Surprise! They weren&#39;t). I&#39;d like to contribute what I&#39;v=\r\ne learned about spirits. As Jill wrote, &quot;I(t) really takes personal experie=\r\nnce to believe this stuff exists&quot;.&lt;br&gt;\n&lt;br&gt;As to her main question of &quot;Why =\r\ndo spirits lie&quot;, I don&#39;t think we can always assume they&#39;re lying. If the i=\r\nnformation comes through a medium, one of the first items to address is whe=\r\nther or not the medium received the message correctly and then whether or n=\r\not he/she interepreted it correctly and phrased it in a way that allowed th=\r\ne recipient to understand the spirit&#39;s meaning. There are a variety of ways=\r\n spirits communicate with mediums; some are easier than others to understan=\r\nd and pass on. For the harder methods, it would be possible for a medium to=\r\n inadvertently misinterept the message based on his/her past experiences. &lt;=\r\nbr&gt;\n&lt;br&gt;When we look at the question from the connection to EVP&#39;s and ghost=\r\n boxes, we have to examine a few items. Was the spirit able to use the devi=\r\nces correctly to form the words he/she actually intended? This is a two ste=\r\np process. It can be difficult for them to not only pull the available ener=\r\ngy into a useable form, but to also form the correct words (think it as a f=\r\noreigner learning English and saying &quot;car&quot; when they mean &quot;star&quot;. They soun=\r\nd similar, but have very different meanings). &lt;br&gt;\n&lt;br&gt;Did we understand th=\r\ne words they said? It&#39;s fairly easy to get them wrong, especially in instan=\r\nces where you aren&#39;t the first person to listen to the recording and someon=\r\ne else says, &quot;Here listen to this. I think they&#39;re saying (fill in the blan=\r\nk)&quot;. Our brains are going to tell us (fill in the blank) simply because tha=\r\nt thought is now prevalent. If we&#39;re the only person listening to the recor=\r\ndings, the same mistake can be made. The only conclusive way is to use equi=\r\npment that can amplify and break down the recordings to make them clear eno=\r\nugh to be agreed upon by a number of people who don&#39;t know what conclusions=\r\n the other listeners have drawn. &lt;br&gt;\n&lt;br&gt;The idea of a spirit distorting t=\r\nhe facts must also be considered. Not lying, per se, but rather getting the=\r\n facts within their reality confused. This is where you have the right to h=\r\nave the facts validated by the spirit. Ask them to prove it to you. They ca=\r\nn tell you some corresponding items that back up their claims, direct you t=\r\no old newspaper stories or to a person they used to affiliate with or bring=\r\n the validation into your focus (meaning the same thing comes into your lif=\r\ne while you&#39;re driving/working/ at home/talking to someone/reading and etc.=\r\n) at least three times. A spirit who is being truthful will not mind trying=\r\n to make this happen. &lt;br&gt;\n&lt;br&gt;Once these have been considered and eliminat=\r\ned, then we should be willing to entertain the idea the spirit may be a low=\r\ner energy being (a bully/swindler/ con-man or woman/narcissist and etc) in =\r\ntheir past life and this is the only way they know how to achieve what they=\r\n want. And yes, those spirits do exist. &quot;As in life, so in death&quot;, meaning =\r\nour personalities don&#39;t change when our bodies die.&lt;br&gt;\n&lt;br&gt;Al, maybe he wa=\r\nsn&#39;t trying to prove anything. Is it possible the spirit voice didn&#39;t mean =\r\nhe WAS (typed larger for emphasis) Steve Tate, but rather wanted to talk AB=\r\nOUT Steve Tate or get a message TO Steve Tate? Did he mean to say &quot;Still fa=\r\nte&quot;? Could he have meant &quot;paratrooper&quot;? See where I&#39;m going with this? &lt;br&gt;=\r\n\n&lt;br&gt;And finally, in regards to the &quot;end of the world stuff&quot;, it has been t=\r\naught to me by mediums and teachers who were all very honest and excellent =\r\nat what they do, and it has been relayed to me by spirits I&#39;ve encountered =\r\nin my mediumship service that we don&#39;t have a free glimpse of the future on=\r\nce our bodies die and we move into spirit form. I mean no offense and I&#39;m n=\r\not impying that wasn&#39;t what was heard. That said (or rather &#39;typed&#39;), I&#39;d b=\r\ne VERY hesitant to believe this communication. There are beings that are pr=\r\nivvy to the potential (underscore &quot;potential&quot;) future in our lives, but it =\r\nisn&#39;t their nature to join us for EVP sessions. &lt;br&gt;\n&lt;br&gt;I hope I haven&#39;t t=\r\naken liberty with this forum by posting such a long reply. I thank you for =\r\nyour time and attention. If you have other questions or would like me to cl=\r\narify something, please ask. I&#39;d be honored to share what I know and track =\r\ndown what I don&#39;t. :) &lt;br&gt;\n&lt;br&gt;Michelle&lt;br&gt;&lt;br&gt;&lt;/p&gt;&lt;/div&gt;\n&lt;div style=3D&quot;COL=\r\nOR:#fff;&quot;&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/blockquote&gt;&lt;/div&gt;&lt;br&gt;\n\n\n    &lt;/div&gt;\n    =\r\n \n\n\n\n\n\n\n\n\n\n&lt;/div&gt;&lt;/div&gt;&lt;div style=3D&quot;position:fixed&quot;&gt;&lt;/div&gt;\n\n\n&lt;!-- cg30.c4.=\r\nmail.gq1.yahoo.com compressed/chunked Wed Dec  9 12:26:04 PST 2009 --&gt;\n&lt;/di=\r\nv&gt;&lt;/body&gt;&lt;/html&gt;\r\n--0-1267965246-1260398627=:68562--"}