{"id": "16412", "subject": "Re: Hello from a newcomer", "author": "dbmdude", "timestamp": "2009-12-13T23:03:50Z", "full_text": "&quot;why would a spirit supply all these details if it didn&#39;t want to prove something?&quot;\n\nAn evil entity trying to gain your confidence; much like what happens wiht Ouja boards.\n\nBe careful to trust the information you are receiving!!!\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, Al Harris &lt;algerharris@...&gt; wrote:\n&gt;\n&gt; Hi again. Following up....\n&gt; \n&gt; Jim C asked:\n&gt; &gt;...Would you mind sharing some of those recordings with us?\n&gt; \n&gt; I&#39;d be more than happy to but the Catholic priest said I should clean\n&gt; all the sound files off my computer and stop trying to record them. I\n&gt; did as he asked because we were pretty shaken up at the time and I\n&gt; didn&#39;t think it through carefully enough, I guess.\n&gt; \n&gt; For awhile I had mixed feelings about trashing the files, but I wasn&#39;t\n&gt; sure I&#39;d want to tell anyone else about what happened. However, now\n&gt; that the &quot;shock&quot; is over, I find it easier to talk about it. If I had\n&gt; to, I&#39;m sure I could catch some more voices. I&#39;m just not sure I&#39;m\n&gt; ready to do that until I know more about it -- I&#39;m unable to grasp how\n&gt; voices can just materialize out of thin air.\n&gt; \n&gt; Jill said:\n&gt; &gt;...I tried to look up your state trooper (being the googling fiend that I am), and I found nothing that matches what you were told....\n&gt; \n&gt; Right -- I tried to look him up too. When I couldn&#39;t find a Redmond, I\n&gt; &quot;confronted&quot; the voice about it, and he said there&#39;s a rural,\n&gt; unincorporated community called Redmond not far from DC & Manassas\n&gt; (sp?) and that he&#39;s buried in a community cemetery. I&#39;ve been through\n&gt; there and know it can get rural pretty quick outside of the DC metro\n&gt; area, so I spent hours trying to track it down on maps and by computer\n&gt; but never found anything to support what he said. I even searched for\n&gt; a trooper named &quot;Pate&quot; instead of &quot;Tate&quot; in case I misunderstood, but\n&gt; I came up empty. I realized I was on a wild goose chase and finally\n&gt; quit. But why would a spirit supply all these details if it didn&#39;t\n&gt; want to prove something?\n&gt; \n&gt; Thanks,\n&gt; Al\n&gt; \n&gt; \n&gt; \n&gt; On 11/29/09, mrscaptainjack2 &lt;jjkamp@...&gt; wrote:\n&gt; &gt; Hi Al, thanks for sharing your story.\n&gt; &gt;\n&gt; &gt; I tried to look up your state trooper (being the googling fiend that I am),\n&gt; &gt; and I found nothing that matches what you were told.  From what I can tell,\n&gt; &gt; there is no such place as Redmond, Virginia.  I find only one person named\n&gt; &gt; Steve Tate who died in 1989 (according to the social security death index),\n&gt; &gt; and since I would expect there would exist some memorial online for a fallen\n&gt; &gt; trooper, this guy was apparently not the Tate we&#39;re looking for.  If I just\n&gt; &gt; look for fallen troopers in Virginia by any name, I can find one Robert Hill\n&gt; &gt; who died in 2006 from being struck during a traffic stop by a passing\n&gt; &gt; motorist in Emporia, Va.  So...either your entity was confused or lying.\n&gt; &gt;\n&gt; &gt; Since I always try to look this stuff up whenever I hear of such things, I\n&gt; &gt; know it&#39;s apparently not uncommon to get faulty info like this.  For\n&gt; &gt; instance, in &quot;The Coming of Seth,&quot; there&#39;s a spirit who gives detailed\n&gt; &gt; information about its previous life, all of which cannot be verified via\n&gt; &gt; modern internet research.  I still find that much of what&#39;s written in the\n&gt; &gt; Seth books seems to dovetail nicely with everything I&#39;m hearing about the\n&gt; &gt; ghost box and from John Edward and so forth, so I don&#39;t think Jane Roberts\n&gt; &gt; invented her story; I just think we cannot trust much of anything we hear\n&gt; &gt; coming out of the ghost box or via mediums -- which doesn&#39;t help when it\n&gt; &gt; comes to proving this phenomena exists.\n&gt; &gt;\n&gt; &gt; Anyway, I would still love to hear more about your experiences.  I\n&gt; &gt; completely believe what you&#39;re telling us, and no, there doesn&#39;t seem to be\n&gt; &gt; a way to talk about this without sounding crazy.  I keep trying to get my\n&gt; &gt; cousin to do a session with me, because she always looks at me funny when I\n&gt; &gt; talk about the boxes.  I really takes personal experience to believe this\n&gt; &gt; stuff exists.\n&gt; &gt;\n&gt; &gt; Jill\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com, Al Harris &lt;algerharris@&gt; wrote:\n&gt; &gt;&gt;\n&gt; &gt;&gt; Hi Dave,\n&gt; &gt;&gt;\n&gt; &gt;&gt; Well, for example, I walked into our &quot;computer room&quot; (spare\n&gt; &gt;&gt; bedroom/office/library) not long after the evps were recorded and my\n&gt; &gt;&gt; radio turned itself on. My wife Patt witnessed it, so it&#39;s not my\n&gt; &gt;&gt; imagination that it did turn on. As I stepped into the room, the\n&gt; &gt;&gt; &quot;morning show&quot; cut to a voice saying &quot;MMM! Cinnamon rolls and coffee!\n&gt; &gt;&gt; Bring enough for us?&quot;\n&gt; &gt;&gt;\n&gt; &gt;&gt; I happened to be holding a mug of hot coffee and a plate of cinnamon\n&gt; &gt;&gt; rolls that Patt had baked for breakfast. I scalded myself as I sloshed\n&gt; &gt;&gt; coffee around after hearing the voice!\n&gt; &gt;&gt;\n&gt; &gt;&gt; I am not the type who tells stories or seeks attention.\n&gt; &gt;&gt;\n&gt; &gt;&gt; I thought for a few moments that I was listening to a radio talk show\n&gt; &gt;&gt; and that it was a coincidence that the mention of cinnamon rolls\n&gt; &gt;&gt; happened as I stepped into the room. But I eventually blurted out a\n&gt; &gt;&gt; &quot;hello,&quot; and was answered. After a few moments and to my questions,\n&gt; &gt;&gt; the voice said his name was Steve Tate -- and following a\n&gt; &gt;&gt; back-and-forth conversation that I recorded he said he was a Virginia\n&gt; &gt;&gt; state trooper who died in 1989 in a car crash a mile from his home.\n&gt; &gt;&gt; Over the next day or two, he said his body was buried in Redmond, Va.,\n&gt; &gt;&gt; and we spoke for several days in little snatches of conversation.\n&gt; &gt;&gt; Along the way, a fellow named &quot;Luke&quot; entered the conversation. Other\n&gt; &gt;&gt; unnamed voices began to say &quot;Hi Al!&quot; It was a bit too much.\n&gt; &gt;&gt;\n&gt; &gt;&gt; I was brought up in a very strict Protestant family. I became leery of\n&gt; &gt;&gt; what was unfolding. I bashed the radio and threw it in the trash. Then\n&gt; &gt;&gt; I began hearing the voices mixed in with my CPAP machine (I have sleep\n&gt; &gt;&gt; apnea) at night, which makes a high-pitched whooshing noise.\n&gt; &gt;&gt;\n&gt; &gt;&gt; Next, I began hearing the &quot;Hi Al!&quot; voice as a faint whisper now and\n&gt; &gt;&gt; then as I&#39;d walk through the house.\n&gt; &gt;&gt;\n&gt; &gt;&gt; I got scared. I had gotten rid of the radio(s) but was still hearing\n&gt; &gt;&gt; the voices. I felt I was going crazy. I told my pastor about it and\n&gt; &gt;&gt; asked for help. He refused -- said he was afraid he might get an\n&gt; &gt;&gt; &quot;attachment&quot; and bring it home to his family. I contacted something\n&gt; &gt;&gt; like 20 protestant pastors by phone and not a single one of them would\n&gt; &gt;&gt; come to my home to help.\n&gt; &gt;&gt;\n&gt; &gt;&gt; Eventually a Catholic priest agreed to help on the condition that I\n&gt; &gt;&gt; supply a recording of the voices as &quot;proof&quot; of the problem. Using my\n&gt; &gt;&gt; digital recorder, I recorded so many &quot;conversations&quot; that I filled up\n&gt; &gt;&gt; a CD. Awhile later, after turning it over to the priest, the Catholic\n&gt; &gt;&gt; bishop granted the priest permission to come to our home to conduct a\n&gt; &gt;&gt; mass and an &quot;exorcism of place.&quot; The priest explained that old homes\n&gt; &gt;&gt; and other places could become &quot;infested&quot; with evil spirits. After he\n&gt; &gt;&gt; performed the ceremony, the voices seemed to quit for awhile but\n&gt; &gt;&gt; returned after a few days.\n&gt; &gt;&gt;\n&gt; &gt;&gt; Now, I was not sure whether the voices were &quot;evil&quot; or just\n&gt; &gt;&gt; &quot;conversational.&quot; My brother died of kidney failure during this time\n&gt; &gt;&gt; and I later heard his voice calling my name. It ~was~ his voice.\n&gt; &gt;&gt;\n&gt; &gt;&gt; A lot more has happened.... At this point, I am no longer &quot;surprised&quot;\n&gt; &gt;&gt; by hearing the voices electronically or otherwise. I just want to know\n&gt; &gt;&gt; more about what&#39;s happening -- how it can possibly be &quot;real&quot; and what\n&gt; &gt;&gt; I should understand in terms of the big picture....\n&gt; &gt;&gt;\n&gt; &gt;&gt; Al\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; \n&gt; \n&gt; -- \n&gt; Al\n&gt; \n&gt; &quot;Try again, fail again. Fail better.&quot; - Samuel Beckett\n&gt; \n&gt; http://sticks-and-stones.classyshots.com/\n&gt; http://www.banjohangout.org/\n&gt;"}