{"id": "1641", "subject": "Re: [EVP-ITC] Re: New file uploaded to EVP-ITC", "author": "Frank Sumption", "timestamp": "2007-07-22T02:40:17Z", "full_text": "Thanks Tinamarie;\n\nI wonder if you could pcik up on the energy they supposedly focused on the \nbox? That&#39;s something I&#39;m skeptical about, as the box builder. I don&#39;t think \nit&#39;s needed. When I do my sessions I ask no questions, and don&#39;t ask for any \nparticular spirit. I like to leave it open, and all enetities are welcome. I \ndon&#39;t want to set up expectations, or limitations, but..that&#39;s only my way \nof running it.\n\nDid you hear anything out of the box?\n\nFrank-S\n&gt;From: Tinamarie bianchino &lt;gypsyharlot1111@...&gt;\n&gt;Reply-To: EVP-ITC@yahoogroups.com\n&gt;To: EVP-ITC@yahoogroups.com\n&gt;Subject: Re: [EVP-ITC] Re: New file uploaded to EVP-ITC\n&gt;Date: Sat, 21 Jul 2007 19:16:44 -0700 (PDT)\n&gt;\n&gt;Hi To All\n&gt;I have been listening to every posted file, and there are several that are \n&gt;so distinct. This one is one of them! Very nice, very interesting, \n&gt;definatley something happening! I am fixin to get my own and start as well. \n&gt;I got to witness the box belonging to Bill Murphy at a Paranormal Meetup \n&gt;group. This was the first time I had seen such a thing and to be honest at \n&gt;first was a bit skeptical, even though I strongly believe and feel have \n&gt;collected much credible evidence of paranormal activity for many years now. \n&gt;I have come to conclude that I am extremely sensitive to energies as well \n&gt;as extremely intuitive. The box has a definate energy about it. I continue \n&gt;to read everything thats posted and listen in hope to grasp this whole \n&gt;concept. I cant get it out of my mind. How amazing this form of EVP is. \n&gt;Good job to all, hopefully I will be able to contribute some time soon. You \n&gt;know years ago my kids had Furbies (sp?), and they would just start talking \n&gt;out of no\n&gt;  where and say very revelent things that I felt was strange at the time \n&gt;and out of context to anything my kids said....LOL, I wonder if there is \n&gt;any connection. Maybe not but I never forget them, Frank&#39;s Box conjures up \n&gt;the same energy to me.\n&gt;Tinamarie Sexton (gypsyharlot1111)\n&gt;Tinamarie\n&gt;\n\n_________________________________________________________________\nhttp://im.live.com/messenger/im/home/?source=hmtextlinkjuly07"}