{"id": "16414", "subject": "Re: Hello from a newcomer", "author": "dbmdude", "timestamp": "2009-12-13T23:00:05Z", "full_text": "You see; this is where I have a problem....\n\n&quot;I recorded he said he was a Virginia state trooper who died in 1989 in a car crash a mile from his home.&quot;\n\nThere is no such person listed @ http://www.odmp.org/ (Officers Down Memorial Page) so I wonder was it really a spirit, a coincidence, or maybe a spirit &quot;pretending&quot; to be somone else.\n\nhttp://www.odmp.org/agency/4055-virginia-state-police-virginia\n\nOf course this page listed above requires someone submit the officer and maybe no one has. so then why not check to see if Steve Tate is in a 1989 Virginia newspaper.\n\nIn this case the fact that solid information was given it &quot;should be&quot; easy to prove/disprove that Steve Tate even existed.\n\nI am not a skeptic; but I really question the information received by Audio ITC because there could be evil people communicating to gain your confidence.\n\n--- In EVP-ITC@yahoogroups.com, Al Harris &lt;algerharris@...&gt; wrote:\n&gt;\n&gt; Hi Dave,\n&gt; \n&gt; Well, for example, I walked into our &quot;computer room&quot; (spare\n&gt; bedroom/office/library) not long after the evps were recorded and my\n&gt; radio turned itself on. My wife Patt witnessed it, so it&#39;s not my\n&gt; imagination that it did turn on. As I stepped into the room, the\n&gt; &quot;morning show&quot; cut to a voice saying &quot;MMM! Cinnamon rolls and coffee!\n&gt; Bring enough for us?&quot;\n&gt; \n&gt; I happened to be holding a mug of hot coffee and a plate of cinnamon\n&gt; rolls that Patt had baked for breakfast. I scalded myself as I sloshed\n&gt; coffee around after hearing the voice!\n&gt; \n&gt; I am not the type who tells stories or seeks attention.\n&gt; \n&gt; I thought for a few moments that I was listening to a radio talk show\n&gt; and that it was a coincidence that the mention of cinnamon rolls\n&gt; happened as I stepped into the room. But I eventually blurted out a\n&gt; &quot;hello,&quot; and was answered. After a few moments and to my questions,\n&gt; the voice said his name was Steve Tate -- and following a\n&gt; back-and-forth conversation that I recorded he said he was a Virginia\n&gt; state trooper who died in 1989 in a car crash a mile from his home.\n&gt; Over the next day or two, he said his body was buried in Redmond, Va.,\n&gt; and we spoke for several days in little snatches of conversation.\n&gt; Along the way, a fellow named &quot;Luke&quot; entered the conversation. Other\n&gt; unnamed voices began to say &quot;Hi Al!&quot; It was a bit too much.\n&gt; \n&gt; I was brought up in a very strict Protestant family. I became leery of\n&gt; what was unfolding. I bashed the radio and threw it in the trash. Then\n&gt; I began hearing the voices mixed in with my CPAP machine (I have sleep\n&gt; apnea) at night, which makes a high-pitched whooshing noise.\n&gt; \n&gt; Next, I began hearing the &quot;Hi Al!&quot; voice as a faint whisper now and\n&gt; then as I&#39;d walk through the house.\n&gt; \n&gt; I got scared. I had gotten rid of the radio(s) but was still hearing\n&gt; the voices. I felt I was going crazy. I told my pastor about it and\n&gt; asked for help. He refused -- said he was afraid he might get an\n&gt; &quot;attachment&quot; and bring it home to his family. I contacted something\n&gt; like 20 protestant pastors by phone and not a single one of them would\n&gt; come to my home to help.\n&gt; \n&gt; Eventually a Catholic priest agreed to help on the condition that I\n&gt; supply a recording of the voices as &quot;proof&quot; of the problem. Using my\n&gt; digital recorder, I recorded so many &quot;conversations&quot; that I filled up\n&gt; a CD. Awhile later, after turning it over to the priest, the Catholic\n&gt; bishop granted the priest permission to come to our home to conduct a\n&gt; mass and an &quot;exorcism of place.&quot; The priest explained that old homes\n&gt; and other places could become &quot;infested&quot; with evil spirits. After he\n&gt; performed the ceremony, the voices seemed to quit for awhile but\n&gt; returned after a few days.\n&gt; \n&gt; Now, I was not sure whether the voices were &quot;evil&quot; or just\n&gt; &quot;conversational.&quot; My brother died of kidney failure during this time\n&gt; and I later heard his voice calling my name. It ~was~ his voice.\n&gt; \n&gt; A lot more has happened.... At this point, I am no longer &quot;surprised&quot;\n&gt; by hearing the voices electronically or otherwise. I just want to know\n&gt; more about what&#39;s happening -- how it can possibly be &quot;real&quot; and what\n&gt; I should understand in terms of the big picture....\n&gt; \n&gt; Al\n&gt; \n&gt; On 11/28/09, David Koenig &lt;floridajakeblues@...&gt; wrote:\n&gt; &gt; Tell us more please.\n&gt; &gt; Thanks\n&gt; &gt; Dave\n&gt; &gt;\n&gt; &gt; On Sat, Nov 28, 2009 at 2:59 PM, Alofbama &lt;algerharris@...&gt; wrote:\n&gt; &gt;\n&gt; &gt;&gt;\n&gt; &gt;&gt;\n&gt; &gt;&gt; Hi, my name is Al, and I&#39;m new to this list. I&#39;m 57, early-retired due to\n&gt; &gt;&gt; a\n&gt; &gt;&gt; disability, and have far more free time than I want or know what to do\n&gt; &gt;&gt; with.\n&gt; &gt;&gt; Which is what got me in trouble recently. After watching &quot;White Noise&quot;\n&gt; &gt;&gt; awhile back, one day I turned on a recorder and turned a radio tuner while\n&gt; &gt;&gt; asking if &quot;anyone&quot; would like to talk. To my great surprise, I found\n&gt; &gt;&gt; voices\n&gt; &gt;&gt; immediately after uploading and playing the file. I know about evps from\n&gt; &gt;&gt; watching the Ghost Hunters, but these voices were talking to me in a\n&gt; &gt;&gt; conversational tone and about stuff relational to questions I asked and to\n&gt; &gt;&gt; stuff I was doing at the time! This progressed over time into a running\n&gt; &gt;&gt; &quot;conversation&quot; with apparently living beings who are invisible but somehow\n&gt; &gt;&gt; sharing this house! Can someone here please relieve my anxiety a bit? I&#39;m\n&gt; &gt;&gt; wondering if I&#39;m messing with something that I shouldn&#39;t be messing with.\n&gt; &gt;&gt; What are the consequences of this -- and can anyone enlighten me about the\n&gt; &gt;&gt; rules or protocol for dealing with these invisible people? And, has anyone\n&gt; &gt;&gt; found there is NO WAY to talk about this without sounding crazy??\n&gt; &gt;&gt;\n&gt; &gt;&gt; Thanks,\n&gt; &gt;&gt; Al\n&gt; &gt;&gt;\n&gt; &gt;&gt;\n&gt; &gt;&gt;\n&gt; &gt;\n&gt; \n&gt; \n&gt; -- \n&gt; Al\n&gt; \n&gt; &quot;Try again, fail again. Fail better.&quot; - Samuel Beckett\n&gt; \n&gt; http://sticks-and-stones.classyshots.com/\n&gt; http://www.banjohangout.org/\n&gt;"}