{"id": "16424", "subject": "Live Paranormal Shows and Events", "author": "bulletbabea", "timestamp": "2009-12-17T17:05:22Z", "full_text": "Live Shows Daily On PTN including some of our members and experiments in EVP ITC and other paranormal topics\n\nwww.paranormaltvnetwork.com Check the homepage for full schedule. There are some upcoming all night events and usually one every weekend!\n\nThursday\nCh # 1 SMP Paranormal with Dan Holroyd & Johnny Meyle 7 PM- 9 PM EST & Ch # 2 - Live Tonight With Nuclear Physicist and UFO Researcher Stanton T. Friedman and Michael Cohen Presented by Skywatchers with Jamie Havican and Tha Jackal\n\nFriday\nCh # 4 Psychic Sahvanna of Soul&#39;s Journey Radio 10 AM - 11 AM EST\nCh # 1 Paranormal Truth 9 PM - Midnight EST\nCh # 4 Skywatchers with Jamie Havican and Tha Jackal 9 PM - 10 PM EST \n\nSaturday\nCh # 3 Paranormal Zone TV with Norene Balovich and Group 10:30 PM  2:30 AM EST \n\nSunday\nCh # 2 Strange Frequencies 4 PM - 6 PM EST\nCh # 3 THE NOT REAL SHOW with EVERYONE 8 PM - 10 pm EST\nCh # 4 Paranormal Wavelengths with Bob Cenkner 10 PM - 11 pm EST\n\nMonday\nCh # 4 Psychic Sahvanna of Soul&#39;s Journey Radio 10 AM - 11 AM EST\nCh # 1 Haunted Hillbillies with Alabama Bobcat & Steve Hill Noon - 1:30 PM EST\nCh # 4 Readings by Priestess Denise Iwaniw from Gathering Thunder Foundation 8 PM - 9 PM EST\n\nCh # 4 Skywatchers with Jamie Havican and Tha Jackal 9 PM - 10 PM EST\nTuesday\nCh # 2 The Otherside with Chris Conlon 9 PM - 11 PM EST\nCh # 1 Enlightened Conversations With Lucy 10 PM - Midnight EST\nCh # 4 Skywatchers with Jamie Havican and Tha Jackal 9 PM - 10 PM EST\n\nWednesday\nCh # 4 Psychic Sahvanna of Soul&#39;s Journey Radio 10 AM - 11 AM EST\nCh # 2 Strange Frequencies 7 PM - 9 PM EST\nCh # 1 One Foot Out Of The Grave with Jeff & Nancy Rezman 9 PM - 11 PM EST\nCh # 4 Skywatchers with Jamie Havican and Tha Jackal 9 PM - 10 PM EST\n\nMore coming soon there so check it out. They are still taking submissions for new live shows and prerecorded shows so feel free to contact them with your work. There are alot of ufo evp itc and box researchers over there.\n\nHappy Holidays Everyone.\nMisty"}