{"id": "16438", "subject": "Re: [EVP-ITC] How rude!", "author": "Zack Widup", "timestamp": "2009-12-29T17:19:29Z", "full_text": "Seems some people have really big egos. A lot of people have\n&quot;moderate-sized&quot; egos and don&#39;t make waves. A very very few people I\nknow have almost no ego and are almost too altruistic.\n\nI see this in a lot of areas - not only in the ghost box and paranormal\nfield but also in the free energy field (which might actually be considered\nan area of the paranormal).\nZack\nOn Tue, Dec 29, 2009 at 11:06 AM, Frank Sumption\n&lt;purplealiengirl@...&gt;wrote:\n\n&gt;\n&gt;\n&gt; http://www.prrsociety.org/worldwideghostbox.html\n&gt;\n&gt;  None of these crackheads out there ever ask me anything,  any input, or\n&gt; technical advice. Always they want to act like the onlyest freaking\n&gt; worldwide experts with the box. Coletta will not even acknowledge an e-mail\n&gt; from me, guess he&#39;s afraid I&#39;ll contradict his expertness. Way too many of\n&gt; these presumptuous ego driven dorks out there on the web. All seeking the\n&gt; fame and fortune, not knowledge.\n&gt;\n&gt;  Frank-S\n&gt;\n&gt; \n&gt;\n\nSeems some people ha e eally big egos. A lo o people ha e \"mode a e-sized\" egos and don' make wa es. A e y e y  ew people I know ha e almos no ego and a e almos oo al uis ic.\n \nI see his in a lo o a eas - no only in he ghos box and pa ano mal ield bu also in he ee ene gy ield (which migh ac ually be conside ed an a ea o he pa ano mal).\nZack\nOn Tue, Dec 29, 2009 a 11:06 AM, F ank Sump ion pu plealiengi l@...> w o e:\n\n  \n\n\n\n\nh p://www.p socie y.o g/wo ldwideghos box.h ml\n \n None o hese c ackheads ou he e e e ask me any hing,  any inpu , o echnical ad ice. Always hey wan o ac like he onlyes eaking wo ldwide expe s wi h he box. Cole a will no e en acknowledge an e-mail om me, guess he's a aid I'll con adic his expe ness. Way oo many o hese p esump uous ego d i en do ks ou he e on  he web. All seeking he ame and o une, no knowledge.\n\n \n F ank-S"}