{"id": "16446", "subject": "Re: Getting Started", "author": "Jill", "timestamp": "2009-12-30T20:34:02Z", "full_text": "I would add that, in my limited experience, I&#39;ve found that if you are the sensitive type, and have some psychic ability, using the box can somehow increase that talent.  At least that&#39;s what happened to me.  It can be disturbing to have contact with (what I presume are) dead people you don&#39;t know, and have them infringe upon your life when you are not expecting it.  So keep that in mind and be prepared that it might happen.  Otherwise, I agree with everything April said.  We had a lot of activity in our house after my dad died, and as soon as we acknowledged him, the activity backed off a bit.  \n\nI would also add that my friends and family think I&#39;m crazy, too, when I talk about this stuff.  But as soon as I conned my best friend and mother into doing a session, they believed.  Until someone experiences a ghost box session, it&#39;s hard to fathom that the person talking about it isn&#39;t schizophrenic.\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;April Abercrombie&quot; &lt;april@...&gt; wrote:\n&gt;\n&gt; Hi Brian,\n&gt; \n&gt; I am a paranormal investigator and have been working extensively in the field for 9 years now. My research team has been around for going on 3 years now and have been through some 23 cases. Not one of those cases has reported that activity increased after we were there. In fact, quiet the opposite has occurred. In a few our cases, people have reported that after attempts to communicate with the spirit, activity has decreased.\n&gt; \n&gt; IMO, while I can&#39;t say it is impossible, I believe it would be very rare for activity to increase just because you tried to communicate.\n&gt; \n&gt; As far as friends and family, I learned along time ago not to care about what other people think. People will believe what they want to believe, and that shouldn&#39;t keep you from pursuing anything you feel important to you.\n&gt; \n&gt; That being said, when asked, I just quote the facts as I know them - \n&gt; \n&gt; 1. There is no proof that ghosts are demons.\n&gt; \n&gt; 2. Ghosts do not physically hurt people.\n&gt; \n&gt; 3. They rarely attach themselves to you and even rarer still, follow you home.\n&gt; \n&gt; 4. There is way more to fear from living beings than dead ones.\n&gt; \n&gt; I hope this helps a little.\n&gt; \n&gt; Take care,\n&gt; April\n&gt; \n&gt;   ----- Original Message ----- \n&gt;   From: brian_empson \n&gt;   To: EVP-ITC@yahoogroups.com \n&gt;   Sent: Tuesday, December 29, 2009 6:35 PM\n&gt;   Subject: [EVP-ITC] Getting Started\n&gt; \n&gt; \n&gt;     \n&gt;   Hello all,\n&gt; \n&gt;   First post. I want to get started with this stuff, and figured the best place would be EVP. I got an IC recorder and am ready to go. I have a few questions though.\n&gt; \n&gt;   At my friend&#39;s house there is *something* that likes to make noises when it knows you can hear it. It&#39;ll make big loud footsteps and generally try to scare the crap out of you. It would seem like a good place to start buuuuut I don&#39;t know if attempting to communicate with it will make things worse. Good idea? Bad idea? Does it matter?\n&gt; \n&gt;   I really wanted to tryout that allophone + EVPMaker combo that seems to be generating some good results. EVP voices are so faint it&#39;s incredibly hard for me to make them out at this point.\n&gt; \n&gt;   Lastly, how do you deal with family and relatives that disapprove of this stuff? I live alone (well, with a roommate) and they seem to think I&#39;m getting into some sort of voodoo or sorcery or something. They seem to think that the voices are all demons or something. I don&#39;t know how to explain it to them, I wish I could get them to understand. I am generally a curious person so it was only a matter of time before I actually started with this stuff.\n&gt; \n&gt;   Thanks for reading! :)\n&gt;"}