{"id": "16453", "subject": "Re: [EVP-ITC] Big Mistake!", "author": "Zack Widup", "timestamp": "2009-12-31T21:17:45Z", "full_text": "Don&#39;t they even have a website?\n:-)\n\nZack\n\nOn Thu, Dec 31, 2009 at 12:51 PM, don powell &lt;dpowell7299@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;  I thought the &quot;secret location&quot; was a hoot too.  I mean it is frigging\n&gt; HUGE!  It&#39;s not like you can miss it :))\n&gt;\n&gt;  ------------------------------\n&gt; *From:* Misty Dawn &lt;bulletbabea@...&gt;\n&gt; *To:* EVP-ITC@yahoogroups.com\n&gt; *Sent:* Thu, December 31, 2009 12:19:21 PM\n&gt; *Subject:* Re: [EVP-ITC] Big Mistake!\n&gt;\n&gt;\n&gt;\n&gt;   Sorry to hear that Frank. I can think of plenty of actual researchers\n&gt; who would love to test one and are already getting great results with other\n&gt; methods and versions of your work. I am also sorry I didnt make it very far\n&gt; past the second paragraph. Karen obviously does not research before she\n&gt; writes her articles.\n&gt;\n&gt; &quot;However, the precise location of the Sanatorium is a closely guarded\n&gt; secret.&quot;\n&gt;\n&gt; Ummm Karen needs to learn to use Google as well. If she had she would have\n&gt; been able to print out a map to Waverly which includes information such as\n&gt; tracks, businesses, adresses AND golf courses at the corner.  It even shows\n&gt; you an overhead view of each building you pass along the way on each street.\n&gt; Hint to Karen click sattelite view after you explore closeups of map view.\n&gt;\n&gt; Im sorry but if you are going to write a well informed article the first\n&gt; step is become well informed. I wont bother reading the rest of her articles\n&gt; because I wont waste my time looking at research from someone who cant\n&gt; bother to cover the basics like look at a map before you drive out to\n&gt; someplace you&#39;ve never been before and then misinform people that it is in a\n&gt; secret location. Nor do I see walking on a tour as as actual &quot;investigation&quot;\n&gt; .\n&gt;\n&gt; Alot of the people once believed the earth was flat, unfortunately they\n&gt; were not &quot;well informed&quot; and they too were victims of shoddy research.\n&gt; Luckily there are those who do look beyond the horizon and open their minds\n&gt; to the possibility that there is more out there.\n&gt;\n&gt; Happy New Years everyone and may your journey next year be in the right\n&gt; direction!\n&gt;\n&gt; Misty\n&gt;\n&gt; --- On *Thu, 12/31/09, Frank Sumption &lt;purplealiengirl@ gmail.com&gt;* wrote:\n&gt;\n&gt;\n&gt; From: Frank Sumption &lt;purplealiengirl@ gmail.com&gt;\n&gt; Subject: [EVP-ITC] Big Mistake!\n&gt; To: RTSC@yahoogroups. com, evp-itc@yahoogroups .com\n&gt; Date: Thursday, December 31, 2009, 4:11 AM\n&gt;\n&gt;\n&gt;  http://www.bad- language. com/ &lt;http://www.bad-language.com/&gt;\n&gt;\n&gt;  I was lead to believe this person had an interset in the box, and she\n&gt; brought her &quot;boyfirend&quot; that just happen to be local, to our meeting the\n&gt; other day. I let them &quot;barrow&quot; #63, now  I&#39;m sure she will claim she tested\n&gt; the box &quot;scientifically, and can prove it does not work.\n&gt;\n&gt;  Karen had contacted me via e-mail requesting a meeting. I thought she was\n&gt; someone off the group and has an interest in EVP and the boxes. She did\n&gt; mention she was a skeptic, but I didn&#39;t think debunker, or a professional\n&gt; skeptic--wonder who pays these twits?\n&gt;\n&gt;\n&gt;  These skeptics don&#39;t allow themselves to hear anything, yet will proclaim\n&gt; that as proof the boxes and EVP don&#39;t work, as if their hearing is somehow\n&gt; better than the average persons ear. If a person doesn&#39;t want to hear it,\n&gt; they won&#39;t, and because they can&#39;&#39;t hear EVP that means no one else an\n&gt; either.  Yeah, real scientific!\n&gt;\n&gt;  Gonna have to remember Google-googel- google!!\n&gt;\n&gt;  Frank-S\n&gt;\n&gt;\n&gt;  \n&gt;\n\nDon' hey e en ha e a websi e?\n:-)\n \nZack\nOn Thu, Dec 31, 2009 a 12:51 PM, don powell dpowell7299@...> w o e:\n\n  \n\n\n\n\n\nI hough he \"sec e loca ion\" was a hoo oo.  I mean i is igging HUGE!  I 's no like you can miss i :))\n\n\n\nF om: Mis y Dawn bulle babea@...>To: EVP-ITC@yahoog oups.com\nSen : Thu, Decembe 31, 2009 12:19:21 PMSubjec : Re: [EVP-ITC] Big Mis ake!\n  \n\n\n\n\n\n\nSo y o hea ha F ank. I can hink o plen y o ac ual esea che s who would lo e o es one and a e al eady ge ing g ea esul s wi h o he me hods and e sions o you wo k. I am also so y I didn make i e y a pas he second pa ag aph. Ka en ob iously does no esea ch be o e she w i es he a icles.\n\n \n\"Howe e , he p ecise loca ion o he Sana o ium is a closely gua ded sec e .\" \n \nUmmm Ka en needs o lea n o use Google as well. I she had she would ha e been able o p in ou a map o Wa e ly which includes in o ma ion such as acks, businesses, ad esses AND gol cou ses a he co ne .  I e en shows you an o e head iew o each building you pass along he way on each s ee . Hin o Ka en click sa eli e iew a e you explo e closeups o map iew. \n\n \nIm so y bu i you a e going o w i e a well in o med a icle he i s s ep is become well in o med. I won bo he eading he es o he a icles because I won was e my ime looking a esea ch om someone who can bo he o co e he basics like look a a map be o e you d i e ou o someplace you' e ne e  been be o e and hen misin o m people ha i is in a sec e loca ion. No do I see walking on a ou as as ac ual \"in es iga ion\" .\n\n \nAlo o he people once belie ed he ea h was la , un o una ely hey we e no \"well in o med\" and hey oo we e ic ims o shoddy esea ch. Luckily he e a e hose who do look beyond he ho izon and open hei minds o he possibili y ha he e is mo e ou he e.\n\n \nHappy New Yea s e e yone and may you jou ney nex yea be in he igh di ec ion!\n \nMis y--- On Thu, 12/31/09, F ank Sump ion gmail.com> w o e:\nF om: F ank Sump ion gmail.com>Subjec : [EVP-ITC] Big Mis ake!To: RTSC@yahoog oups. com, e p-i c@yahoog oups .com\nDa e: Thu sday, Decembe 31, 2009, 4:11 AM\n  \n\n\nh p://www.bad- language. com/\n \n I was lead o belie e his pe son had an in e se in he box, and she b ough he \"boy i end\" ha jus happen o be local, o ou mee ing he o he day. I le hem \"ba ow\" #63, now  I'm su e she will claim she es ed he box \"scien i ically, and can p o e i does no wo k. \n\n \n Ka en had con ac ed me ia e-mail eques ing a mee ing. I hough she was someone o he g oup and has an in e es in EVP and he boxes. She did men ion she was a skep ic, bu I didn' hink debunke , o a p o essional skep ic--wonde who pays hese wi s?\n\n \n \n These skep ics don' allow hemsel es o hea any hing, ye will p oclaim ha as p oo he boxes and EVP don' wo k, as i hei hea ing is somehow be e han he a e age pe sons ea . I a pe son doesn' wan o hea i , hey won' , and because hey can'' hea EVP  ha means no one else an ei he .  Yeah, eal scien i ic!\n\n \n Gonna ha e o emembe Google-googel- google!!\n \n F ank-S"}