{"id": "16451", "subject": "Re: [EVP-ITC] Big Mistake!", "author": "Misty Dawn", "timestamp": "2009-12-31T18:19:21Z", "full_text": "--0-1281933152-1262283561=:18799\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nSorry to hear that Frank. I can think of plenty of actual researchers who w=\r\nould love to test one and are already getting great results with other meth=\r\nods and versions of your work. I am also sorry I didnt make it very far pas=\r\nt the second paragraph. Karen obviously does=C2=A0not research before she w=\r\nrites her articles.\n=C2=A0\n&quot;However, the precise location of the Sanatorium=\r\n is a closely guarded secret.&quot; \n=C2=A0\nUmmm Karen needs to learn to use Goo=\r\ngle as well. If she had she would have been able to print out a map to Wave=\r\nrly which includes information such as tracks, businesses, adresses=C2=A0AN=\r\nD golf courses at the corner.=C2=A0 It even shows you an overhead view of e=\r\nach building you pass along the way on each street. Hint to Karen click sat=\r\ntelite view after you explore closeups of map view. \n=C2=A0\nIm sorry but if=\r\n you are going to write a well informed article the first step is become we=\r\nll informed. I wont bother reading the rest of her articles because I=C2=A0=\r\nwont waste my time looking at research from someone who cant bother to cove=\r\nr the basics like look at a map before you drive out to someplace you&#39;ve ne=\r\nver=C2=A0been before and then misinform people that it is in a secret locat=\r\nion. Nor do I see walking on a tour as as actual &quot;investigation&quot;.\n=C2=A0\nAl=\r\not of the people once believed the earth was flat, unfortunately they were =\r\nnot &quot;well informed&quot; and they too were victims of shoddy research. Luckily t=\r\nhere are those who do look beyond the horizon and open their minds to the p=\r\nossibility that there is more out there.\n=C2=A0\nHappy New Years everyone an=\r\nd may your journey next year be in the right direction!\n=C2=A0\nMisty\n\n--- O=\r\nn Thu, 12/31/09, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n\n\nFrom: =\r\nFrank Sumption &lt;purplealiengirl@...&gt;\nSubject: [EVP-ITC] Big Mistake!\n=\r\nTo: RTSC@yahoogroups.com, evp-itc@yahoogroups.com\nDate: Thursday, December =\r\n31, 2009, 4:11 AM\n\n\n=C2=A0 \n\n\n\n\nhttp://www.bad- language. com/\n=C2=A0\n=C2=\r\n=A0I was lead to believe this person had an interset in the box, and she br=\r\nought her &quot;boyfirend&quot; that just happen to be local, to our meeting the othe=\r\nr day.=C2=A0I let them &quot;barrow&quot; #63, now=C2=A0 I&#39;m sure she will claim she =\r\ntested the box &quot;scientifically, and can prove it does not work. \n=C2=A0\n=C2=\r\n=A0Karen had contacted me via e-mail requesting a meeting.=C2=A0I thought s=\r\nhe was someone off the group and has an interest in EVP and the boxes.=C2=\r\n=A0She did mention she was a skeptic, but I didn&#39;t think debunker,=C2=A0or =\r\na professional skeptic--wonder who pays these twits?\n=C2=A0\n=C2=A0\n=C2=A0Th=\r\nese skeptics don&#39;t allow themselves to hear anything, yet will proclaim tha=\r\nt as proof the boxes and EVP don&#39;t work, as if their hearing is somehow bet=\r\nter than the average persons ear. If a person doesn&#39;t want to hear it, they=\r\n won&#39;t, and because they can&#39;&#39;t hear EVP=C2=A0that means no one else an eit=\r\nher.=C2=A0 Yeah, real scientific!\n=C2=A0\n=C2=A0Gonna have to remember Googl=\r\ne-googel- google!!\n=C2=A0\n=C2=A0Frank-S\n\n\n\n\n\n\n\n      \r\n--0-1281933152-1262283561=:18799\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;DIV&gt;Sorry to hear that Frank. I can think of=\r\n plenty of actual researchers who would love to test one and are already ge=\r\ntting great results with other methods and versions of your work. I am also=\r\n sorry I didnt make it very far past the second paragraph. Karen obviously =\r\ndoes&nbsp;not research before she writes her articles.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/D=\r\nIV&gt;\n&lt;DIV&gt;&quot;However, the precise location of the Sanatorium is a closely guar=\r\nded secret.&quot; &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Ummm Karen needs to learn to use=\r\n Google as well. If she had she would have been able to print out a map to =\r\nWaverly which includes information such as tracks, businesses, adresses&nbs=\r\np;AND golf courses at the corner.&nbsp; It even shows you an overhead view =\r\nof each building you pass along the way on each street. Hint to Karen click=\r\n sattelite view after you explore closeups of map view. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;=\r\n/DIV&gt;\n&lt;DIV&gt;Im sorry but if you are going to write a well informed article t=\r\nhe first step is become well informed. I wont bother reading the rest of he=\r\nr articles because I&nbsp;wont waste my time looking at research from someo=\r\nne who cant bother to cover the basics like look at a map before you drive =\r\nout to someplace you&#39;ve never&nbsp;been before and then misinform people th=\r\nat it is in a secret location. Nor do I see walking on a tour as as actual =\r\n&quot;investigation&quot;.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Alot of the people once belie=\r\nved the earth was flat, unfortunately they were not &quot;well informed&quot; and the=\r\ny too were victims of shoddy research. Luckily there are those who do look =\r\nbeyond the horizon and open their minds to the possibility that there is mo=\r\nre out there.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Happy New Years everyone and may=\r\n your journey next year be in the right direction!&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n=\r\n&lt;DIV&gt;Misty&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Thu, 12/31/09, Frank Sumption &lt;I&gt;&lt;purplealie=\r\nngirl@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;&lt;/DIV&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LE=\r\nFT: rgb(16,16,255) 2px solid; PADDING-LEFT: 5px; MARGIN-LEFT: 5px&quot;&gt;&lt;BR&gt;From=\r\n: Frank Sumption &lt;purplealiengirl@...&gt;&lt;BR&gt;Subject: [EVP-ITC] Bi=\r\ng Mistake!&lt;BR&gt;To: RTSC@yahoogroups.com, evp-itc@yahoogroups.com&lt;BR&gt;Date: Th=\r\nursday, December 31, 2009, 4:11 AM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3Dyiv1226006238&gt;&lt;SPAN st=\r\nyle=3D&quot;DISPLAY: none&quot;&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV id=3Dygrp-text&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;A hre=\r\nf=3D&quot;http://www.bad-language.com/&quot; rel=3Dnofollow target=3D_blank&gt;http://ww=\r\nw.bad- language. com/&lt;/A&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;I was lead to =\r\nbelieve this person had an interset in the box, and she brought her &quot;boyfir=\r\nend&quot; that just happen to be local, to our meeting the other day.&nbsp;I let=\r\n them &quot;barrow&quot; #63, now&nbsp; I&#39;m sure she will claim she tested the box &quot;s=\r\ncientifically, and can prove it does not work. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DI=\r\nV&gt;&nbsp;Karen had contacted me via e-mail requesting a meeting.&nbsp;I thou=\r\nght she was someone off the group and has an interest in EVP and the boxes.=\r\n&nbsp;She did mention she was a skeptic, but I didn&#39;t think debunker,&nbsp;=\r\nor a professional skeptic--wonder who pays these twits?&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/=\r\nDIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;These skeptics don&#39;t allow themselves to =\r\nhear anything, yet will proclaim that as proof the boxes and EVP don&#39;t work=\r\n, as if their hearing is somehow better than the average persons ear. If a =\r\nperson doesn&#39;t want to hear it, they won&#39;t, and because they can&#39;&#39;t hear EV=\r\nP&nbsp;that means no one else an either.&nbsp; Yeah, real scientific!&lt;/DIV&gt;=\r\n\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;Gonna have to remember Google-googel- google!=\r\n!&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;Frank-S&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;=\r\n&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n      \r\n--0-1281933152-1262283561=:18799--"}