{"id": "16454", "subject": "Re: [EVP-ITC] Big Mistake!", "author": "Michael Berry", "timestamp": "2009-12-31T21:30:47Z", "full_text": "Yes and there&#39;s directions and a map\nMike\n\nZack Widup wrote:\n&gt; Don&#39;t they even have a website?\n&gt; :-)\n&gt; Zack\n&gt;\n&gt; On Thu, Dec 31, 2009 at 12:51 PM, don powell &lt;dpowell7299@... \n&gt; &lt;mailto:dpowell7299@...&gt;&gt; wrote:\n&gt;\n&gt;     I thought the &quot;secret location&quot; was a hoot too. I mean it is\n&gt;     frigging HUGE! It&#39;s not like you can miss it :))\n&gt;\n&gt;     ------------------------------------------------------------------------\n&gt;     *From:* Misty Dawn &lt;bulletbabea@...\n&gt;     &lt;mailto:bulletbabea@...&gt;&gt;\n&gt;     *To:* EVP-ITC@yahoogroups.com &lt;mailto:EVP-ITC@yahoogroups.com&gt;\n&gt;     *Sent:* Thu, December 31, 2009 12:19:21 PM\n&gt;     *Subject:* Re: [EVP-ITC] Big Mistake!\n&gt;\n&gt;     Sorry to hear that Frank. I can think of plenty of actual\n&gt;     researchers who would love to test one and are already getting\n&gt;     great results with other methods and versions of your work. I am\n&gt;     also sorry I didnt make it very far past the second paragraph.\n&gt;     Karen obviously does not research before she writes her articles.\n&gt;     &quot;However, the precise location of the Sanatorium is a closely\n&gt;     guarded secret.&quot;\n&gt;     Ummm Karen needs to learn to use Google as well. If she had she\n&gt;     would have been able to print out a map to Waverly which includes\n&gt;     information such as tracks, businesses, adresses AND golf courses\n&gt;     at the corner. It even shows you an overhead view of each building\n&gt;     you pass along the way on each street. Hint to Karen click\n&gt;     sattelite view after you explore closeups of map view.\n&gt;     Im sorry but if you are going to write a well informed article the\n&gt;     first step is become well informed. I wont bother reading the rest\n&gt;     of her articles because I wont waste my time looking at research\n&gt;     from someone who cant bother to cover the basics like look at a\n&gt;     map before you drive out to someplace you&#39;ve never been before and\n&gt;     then misinform people that it is in a secret location. Nor do I\n&gt;     see walking on a tour as as actual &quot;investigation&quot; .\n&gt;     Alot of the people once believed the earth was flat, unfortunately\n&gt;     they were not &quot;well informed&quot; and they too were victims of shoddy\n&gt;     research. Luckily there are those who do look beyond the horizon\n&gt;     and open their minds to the possibility that there is more out there.\n&gt;     Happy New Years everyone and may your journey next year be in the\n&gt;     right direction!\n&gt;     Misty\n&gt;\n&gt;     --- On *Thu, 12/31/09, Frank Sumption /&lt;purplealiengirl@ gmail.com\n&gt;     &lt;http://gmail.com/&gt;&gt;/* wrote:\n&gt;\n&gt;\n&gt;         From: Frank Sumption &lt;purplealiengirl@ gmail.com\n&gt;         &lt;http://gmail.com/&gt;&gt;\n&gt;         Subject: [EVP-ITC] Big Mistake!\n&gt;         To: RTSC@yahoogroups. com, evp-itc@yahoogroups .com\n&gt;         Date: Thursday, December 31, 2009, 4:11 AM\n&gt;\n&gt;         http://www.bad- language. com/ &lt;http://www.bad-language.com/&gt;\n&gt;         I was lead to believe this person had an interset in the box,\n&gt;         and she brought her &quot;boyfirend&quot; that just happen to be local,\n&gt;         to our meeting the other day. I let them &quot;barrow&quot; #63, now I&#39;m\n&gt;         sure she will claim she tested the box &quot;scientifically, and\n&gt;         can prove it does not work.\n&gt;         Karen had contacted me via e-mail requesting a meeting. I\n&gt;         thought she was someone off the group and has an interest in\n&gt;         EVP and the boxes. She did mention she was a skeptic, but I\n&gt;         didn&#39;t think debunker, or a professional skeptic--wonder who\n&gt;         pays these twits?\n&gt;         These skeptics don&#39;t allow themselves to hear anything, yet\n&gt;         will proclaim that as proof the boxes and EVP don&#39;t work, as\n&gt;         if their hearing is somehow better than the average persons\n&gt;         ear. If a person doesn&#39;t want to hear it, they won&#39;t, and\n&gt;         because they can&#39;&#39;t hear EVP that means no one else an either.\n&gt;         Yeah, real scientific!\n&gt;         Gonna have to remember Google-googel- google!!\n&gt;         Frank-S\n&gt;\n&gt;\n&gt;\n&gt; \n&gt; ------------------------------------------------------------------------\n&gt;\n&gt;\n&gt; No virus found in this incoming message.\n&gt; Checked by AVG - www.avg.com \n&gt; Version: 9.0.725 / Virus Database: 270.14.123/2595 - Release Date: 12/31/09 03:52:00\n&gt;\n&gt;"}