{"id": "16467", "subject": "Re: [EVP-ITC] Re: Finally uploaded a file!", "author": "David Koenig", "timestamp": "2010-01-01T23:44:48Z", "full_text": "Misty .. I&#39;m looking for people with good EVP&#39;s like yourself for a radio\nprogram ...Interested?\nThanks&#39;\nDave\n\nOn Fri, Jan 1, 2010 at 5:04 PM, Misty Dawn &lt;bulletbabea@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Cool Jill I will check it out when I get time to listen. Its fine its in\n&gt; mp3 format. When group gets too full of the mp3 formats then I will let\n&gt; people know if they have too much up. I usually suggest if someone wants to\n&gt; upload many files they use esnips.com. Or if they want to upload wav files\n&gt; since its not allowed here they can use their free esnips account to do\n&gt; whatever format they wish and host multiple files. Glad ya figured out how\n&gt; to transfer them. I didnt know you didnt know how. Let us know if you have\n&gt; any problems!\n&gt;\n&gt; Misty\n&gt;\n&gt; --- On *Thu, 12/31/09, Jill &lt;jjkamp@...&gt;* wrote:\n&gt;\n&gt;\n&gt; From: Jill &lt;jjkamp@...&gt;\n&gt; Subject: [EVP-ITC] Re: Finally uploaded a file!\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Thursday, December 31, 2009, 11:35 PM\n&gt;\n&gt;\n&gt;\n&gt; Just realized that I think my file is probably too large and is taking up\n&gt; all the group&#39;s space. If this is true, please let me know immediately and\n&gt; I&#39;ll delete the file (since I have no idea how to make it smaller).\n&gt;\n&gt; --- In EVP-ITC@yahoogroups .com&lt;http://us.mc329.mail.yahoo.com/mc/compose?to=EVP-ITC%40yahoogroups.com&gt;,\n&gt; &quot;Jill&quot; &lt;jjkamp@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; So I finally got some motivation and figured out how to get a file from\n&gt; my cassette tape to the computer. It&#39;s in the &quot;Files&quot; area here (hopefully I\n&gt; did everything correctly and according to protocol):\n&gt; &gt;\n&gt; &gt; http://tech. groups.yahoo. com/group/ EVP-ITC/files/ Jill%27s%\n&gt; 20Ghost%20Box% 20Files/&lt;http://tech.groups.yahoo.com/group/EVP-ITC/files/Jill%27s%20Ghost%20Box%20Files/&gt;\n&gt; &gt;\n&gt; &gt; I cleaned it up somewhat in Audacity, taking out all the extra radio\n&gt; snippets, so what&#39;s left is me asking for someone to say my niece&#39;s name,\n&gt; and then the four &quot;Katies&quot; that came after that. There&#39;s even, I think, a\n&gt; fifth Katie tucked in there while I&#39;m asking, as well as the obligatory &quot;I\n&gt; love you&quot; first thing after I&#39;ve finished asking.\n&gt; &gt;\n&gt; &gt; Some background: Got my niece and cousin to do a session with me today.\n&gt; Cousin has been dragging her feet, is skeptical, and the niece just arrived\n&gt; from out of town, is more openminded. I&#39;m pleased we got someone to say her\n&gt; name four times in a row, and I&#39;m uploading it here so she can hear it back\n&gt; home. So this isn&#39;t the best file I have. Maybe now that I know how to\n&gt; upload (if it worked), I can upload some of my better session happenings!\n&gt; &gt;\n&gt;\n&gt;\n&gt;  \n&gt;\n\nMis y .. I'm looking o people wi h good EVP's like you sel o a adio p og am ...In e es ed?Thanks'Da eOn F i, Jan 1, 2010 a 5:04 PM, Mis y Dawn bulle babea@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n Cool Jill I will check i ou when I ge ime o lis en. I s ine i s in mp3 o ma . When g oup ge s oo ull o he mp3 o ma s hen I will le people know i hey ha e oo much up. I usually sugges i someone wan s o upload many iles hey use esnips.com. O i hey wan o upload wa iles since i s no allowed he e hey can use hei ee esnips accoun o do wha e e o ma hey wish and hos mul iple iles. Glad ya igu ed ou how o ans e hem. I didn know you didn know how. Le us know i you ha e any p oblems!\n\n \nMis y--- On Thu, 12/31/09, Jill jjkamp@...> w o e:\nF om: Jill jjkamp@...>Subjec : [EVP-ITC] Re: Finally uploaded a ile!\nTo: EVP-ITC@yahoog oups.comDa e: Thu sday, Decembe 31, 2009, 11:35 PM\n  \n\nJus ealized ha I hink my ile is p obably oo la ge and is aking up all he g oup's space. I his is ue, please le me know immedia ely and I'll dele e he ile (since I ha e no idea how o make i smalle ).\n--- In EVP-ITC@yahoog oups .com, \"Jill\" w o e:>> So I inally go some mo i a ion and igu ed ou how o ge a ile om my casse e ape o he compu e . I 's in he \"Files\" a ea he e (hope ully I did e e y hing co ec ly and acco ding o p o ocol):\n> > h p:// ech. g oups.yahoo. com/g oup/ EVP-ITC/ iles/ Jill%27s% 20Ghos %20Box% 20Files/\n> > I cleaned i up somewha in Audaci y, aking ou all he\n ex a adio snippe s, so wha 's le is me asking o someone o say my niece's name, and hen he ou \"Ka ies\" ha came a e ha . The e's e en, I hink, a i h Ka ie ucked in he e while I'm asking, as well as he obliga o y \"I lo e you\" i s hing a e I' e inished asking. \n> > Some backg ound: Go my niece and cousin o do a session wi h me oday. Cousin has been d agging he ee , is skep ical, and he niece jus a i ed om ou o own, is mo e openminded. I'm pleased we go someone o say he name ou imes in a ow, and I'm uploading i he e so she can hea i back home. So his isn' he bes ile I ha e. Maybe now ha I know how o upload (i i wo ked), I can upload some o my be e session happenings!\n>"}