{"id": "16468", "subject": "Re: Finally uploaded a file!", "author": "Jill", "timestamp": "2010-01-02T02:24:33Z", "full_text": "Thanks for the offer of help, Misty!  It was really my computer that I needed to figure out, as in, where to plug in the minijack and how to get Audacity to recognize that input...but it&#39;s all cake now.  I&#39;m really anxious to hear what you think of my file, and if you can hear all the &quot;Katies&quot; in it.  Let me know when you get a chance!  (And everyone else, too, please!)\n\n\n\n--- In EVP-ITC@yahoogroups.com, Misty Dawn &lt;bulletbabea@...&gt; wrote:\n&gt;\n&gt; Cool Jill I will check it out when I get time to listen. Its fine its in mp3 format. When group gets too full of the mp3 formats then I will let people know if they have too much up. I usually suggest if someone wants to upload many files they use esnips.com. Or if they want to upload wav files since its not allowed here they can use their free esnips account to do whatever format they wish and host multiple files. Glad ya figured out how to transfer them. I didnt know you didnt know how. Let us know if you have any problems!\n&gt;  \n&gt; Misty\n&gt; \n&gt; --- On Thu, 12/31/09, Jill &lt;jjkamp@...&gt; wrote:\n&gt; \n&gt; \n&gt; From: Jill &lt;jjkamp@...&gt;\n&gt; Subject: [EVP-ITC] Re: Finally uploaded a file!\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Thursday, December 31, 2009, 11:35 PM\n&gt; \n&gt; \n&gt;   \n&gt; \n&gt; \n&gt; \n&gt; Just realized that I think my file is probably too large and is taking up all the group&#39;s space. If this is true, please let me know immediately and I&#39;ll delete the file (since I have no idea how to make it smaller).\n&gt; \n&gt; --- In EVP-ITC@yahoogroups .com, &quot;Jill&quot; &lt;jjkamp@&gt; wrote:\n&gt; &gt;\n&gt; &gt; So I finally got some motivation and figured out how to get a file from my cassette tape to the computer. It&#39;s in the &quot;Files&quot; area here (hopefully I did everything correctly and according to protocol):\n&gt; &gt; \n&gt; &gt; http://tech. groups.yahoo. com/group/ EVP-ITC/files/ Jill%27s% 20Ghost%20Box% 20Files/\n&gt; &gt; \n&gt; &gt; I cleaned it up somewhat in Audacity, taking out all the extra radio snippets, so what&#39;s left is me asking for someone to say my niece&#39;s name, and then the four &quot;Katies&quot; that came after that. There&#39;s even, I think, a fifth Katie tucked in there while I&#39;m asking, as well as the obligatory &quot;I love you&quot; first thing after I&#39;ve finished asking. \n&gt; &gt; \n&gt; &gt; Some background: Got my niece and cousin to do a session with me today. Cousin has been dragging her feet, is skeptical, and the niece just arrived from out of town, is more openminded. I&#39;m pleased we got someone to say her name four times in a row, and I&#39;m uploading it here so she can hear it back home. So this isn&#39;t the best file I have. Maybe now that I know how to upload (if it worked), I can upload some of my better session happenings!\n&gt; &gt;\n&gt;"}