{"id": "16489", "subject": "Re: [EVP-ITC] Big Mistake!", "author": "Rj", "timestamp": "2010-01-05T16:48:52Z", "full_text": "--0-111825434-1262710132=:87805\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nFrank =E2=80=93 thanks for participating in the test discussions.\n\n\n\nI am n=\r\not running the tests, but I am going to try to participate, even if it is o=\r\nnly giving my input, as much as I can. =C2=A0I envision =E2=80=9CObjective =\r\nListeners=E2=80=9D to be people who are not trying to prove, or disprove, t=\r\nhe theories either way. I envision the tests being developed to help them b=\r\ne objective: for example, maybe one group of people ask questions, but a di=\r\nfferent group listen to the recordings without knowing the questions, and t=\r\nry to hear the answers. =C2=A0Maybe that would help control for questions l=\r\neading what you hear (for example, asking a YES/NO question might predispos=\r\ne someone to hearing a YES or NO in the noise). =C2=A0While everyone may he=\r\nar different, maybe they won=E2=80=99t. =C2=A0Maybe a large enough group of=\r\n people will show a higher percentage giving one answer over another. =C2=\r\n=A0=C2=A0=C2=A0Any if no one hears the same thing, that could also be signi=\r\nficant, and raise the question how anyone could have any confidence that wh=\r\nat they hear, is what is on the\n tape? =C2=A0I think these are all interest=\r\ning possibilities, hence my interest in the tests.\n\n\n\nYou are probably righ=\r\nt that there are supposed objective scientists out there, and those adherin=\r\ng to their own dogma over pure science. I think that is a potential failing=\r\n of people in general: religious people can focus on dogma over reason, sci=\r\nence can focus on dogma over reason, believers can focus on dogma over reas=\r\non, skeptics can focus on dogma over reason. =C2=A0Left alone, they don=E2=\r\n=80=99t grow out of this. =C2=A0That=E2=80=99s why it is always important, =\r\nfor those who understand the dangers of this kind of close-minded dogma, to=\r\n support testing and critical thinking, and to involve themselves in tests =\r\nto not only challenge traditional beliefs, but challenge beliefs of their o=\r\nwn.\n\n\n\nSo I thinks it=E2=80=99s great that you and all of us here are parti=\r\ncipating in these discussions, and that you=E2=80=99ve gone the extra mile =\r\nto support this testing by lending your box to the researchers. =C2=A0And o=\r\nf course, the more people who are informed with the workings and potential =\r\nof this technology being involved, the better the test environment will be,=\r\n and the less chance for subjective-errors to creep in. =C2=A0The better th=\r\ne tests, the better the chance that theories and beliefs that are wrong, wi=\r\nll be shown to be wrong. And those that are right, shown to all to be right=\r\n.\n\n\n\nAgain, I will be sure to keep everyone informed, and hope that anyone =\r\nelse who wants to participate will do so. \n\n\n\n=C2=A0\n\n\n\n\n\n\n\n\n--- On Tue, 1/=\r\n5/10, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n\nFrom: Frank Sumpti=\r\non &lt;purplealiengirl@...&gt;\nSubject: Re: [EVP-ITC] Big Mistake!\nTo: EVP-=\r\nITC@yahoogroups.com\nDate: Tuesday, January 5, 2010, 8:02 AM\n\n\n\n\n\n\n\n=C2=A0\n\n=\r\n\n\n  \n\n\n    \n      \n      \n      =C2=A0So who certified these &quot;objective&quot; li=\r\nsteners in these supposed tests? Everyone hears different, and I doubt havi=\r\nng some degree means you get perfect hearing. Even everyday stuff like musi=\r\nc lyrics, everyone hears different, why aren&#39;t these skeptics out there kee=\r\nping people from buying records? \n\n=C2=A0\n=C2=A0That&#39;s pure BS about trying=\r\n to save people from wasting money and time. I don&#39;t know what the motivati=\r\non is, but I suspect it has more to do with science dogma, than pure scienc=\r\ne. It&#39;s like we are all supposed to to get some bozo&#39;s permission to do our=\r\n investigations, and research has to be approved by some university.=C2=A0I=\r\n say bite me!\n\n=C2=A0\n=C2=A0I dared to question the motivation and methods =\r\nof these supposed objective scientists and was accused of attacking them, l=\r\nike how dare I even question their authority! I&#39;m supposed to supply my equ=\r\nipment for debunking and not even ask how it will=C2=A0 be tested, or what =\r\nqualifies these bozos to test anything? \n\n=C2=A0\n=C2=A0I&#39;ve said all along =\r\nthat you can&#39;t take everything from the boxes as gospel, and you do in fact=\r\n hear what you want to hear at times, but these pompus jerks act like I&#39;m=\r\n=C2=A0the one out there fooling everyone. =C2=A0These science dorks want on=\r\ne thing, they want the boxes to go away because it does in fact show that t=\r\nhere is more to life than the physical and we are=C2=A0in fact more that so=\r\nme stupid accident as they would have us believe. There is very strong moti=\r\nvation for science to show the box is nothing, as with all things paranorma=\r\nl. \n\n=C2=A0\n=C2=A0Why is is ok for them to lie in the name of science!?=C2=\r\n=A0 When they say &quot;there is no evidence&quot; that is a lie!\n=C2=A0\n=C2=A0Frank-=\r\nS\n=C2=A0\n=C2=A0\n\n\n\n    \n     \n\n    \n    \n\n\n \n\n\n\n  \n\n\n\n\n\n\n      \r\n--0-111825434-1262710132=:87805\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;font face=3D&quot;Verdana, Helvetica, Arial&quot;&gt;&lt;spa=\r\nn style=3D&quot;font-size: 12px;&quot;&gt;Frank =E2=80=93 thanks for participating in th=\r\ne test discussions.&lt;br&gt;\n&lt;br&gt;\nI am not running the tests, but I am going to =\r\ntry to participate, even if it is only giving my input, as much as I can. &=\r\nnbsp;I envision =E2=80=9CObjective Listeners=E2=80=9D to be people who are =\r\nnot trying to prove, or disprove, the theories either way. I envision the t=\r\nests being developed to help them be objective: for example, maybe one grou=\r\np of people ask questions, but a different group listen to the recordings w=\r\nithout knowing the questions, and try to hear the answers. &nbsp;Maybe that=\r\n would help control for questions leading what you hear (for example, askin=\r\ng a YES/NO question might predispose someone to hearing a YES or NO in the =\r\nnoise). &nbsp;While everyone may hear different, maybe they won=E2=80=99t. =\r\n&nbsp;Maybe a large enough group of people will show a higher percentage gi=\r\nving one answer over another. &nbsp;&nbsp;&nbsp;Any if no one hears the sam=\r\ne thing, that could also be significant, and raise the question how anyone =\r\ncould have any confidence that what they\n hear, is what is on the tape? &nb=\r\nsp;I think these are all interesting possibilities, hence my interest in th=\r\ne tests.&lt;br&gt;\n&lt;br&gt;\nYou are probably right that there are supposed objective =\r\nscientists out there, and those adhering to their own dogma over pure scien=\r\nce. I think that is a potential failing of people in general: religious peo=\r\nple can focus on dogma over reason, science can focus on dogma over reason,=\r\n believers can focus on dogma over reason, skeptics can focus on dogma over=\r\n reason. &nbsp;Left alone, they don=E2=80=99t grow out of this. &nbsp;That=\r\n=E2=80=99s why it is always important, for those who understand the dangers=\r\n of this kind of close-minded dogma, to support testing and critical thinki=\r\nng, and to involve themselves in tests to not only challenge traditional be=\r\nliefs, but challenge beliefs of their own.&lt;br&gt;\n&lt;br&gt;\nSo I thinks it=E2=80=99=\r\ns great that you and all of us here are participating in these discussions,=\r\n and that you=E2=80=99ve gone the extra mile to support this testing by len=\r\nding your box to the researchers. &nbsp;And of course, the more people who =\r\nare informed with the workings and potential of this technology being invol=\r\nved, the better the test environment will be, and the less chance for subje=\r\nctive-errors to creep in. &nbsp;The better the tests, the better the chance=\r\n that theories and beliefs that are wrong, will be shown to be wrong. And t=\r\nhose that are right, shown to all to be right.&lt;br&gt;\n&lt;br&gt;\nAgain, I will be su=\r\nre to keep everyone informed, and hope that anyone else who wants to partic=\r\nipate will do so. &lt;br&gt;\n&lt;br&gt;\n&nbsp;&lt;br&gt;\n&lt;br&gt;\n&lt;br&gt;\n&lt;/span&gt;&lt;/font&gt;\n&lt;!--EndFrag=\r\nment--&gt;&lt;br&gt;&lt;br&gt;--- On &lt;b&gt;Tue, 1/5/10, Frank Sumption &lt;i&gt;&lt;purplealiengirl=\r\n@...&gt;&lt;/i&gt;&lt;/b&gt; wrote:&lt;br&gt;&lt;blockquote style=3D&quot;border-left: 2px soli=\r\nd rgb(16, 16, 255); margin-left: 5px; padding-left: 5px;&quot;&gt;&lt;br&gt;From: Frank S=\r\numption &lt;purplealiengirl@...&gt;&lt;br&gt;Subject: Re: [EVP-ITC] Big Mis=\r\ntake!&lt;br&gt;To: EVP-ITC@yahoogroups.com&lt;br&gt;Date: Tuesday, January 5, 2010, 8:0=\r\n2 AM&lt;br&gt;&lt;br&gt;&lt;div id=3D&quot;yiv1353775422&quot;&gt;\n\n\n\n\n\n&lt;span style=3D&quot;display: none;&quot;&gt;=\r\n&nbsp;&lt;/span&gt;\n\n\n\n    &lt;div id=3D&quot;ygrp-text&quot;&gt;\n      \n      \n      &lt;p&gt;&lt;/p&gt;&lt;div=\r\n&gt;&nbsp;So who certified these &quot;objective&quot; listeners in these supposed tests=\r\n? Everyone hears different, and I doubt having some degree means you get pe=\r\nrfect hearing. Even everyday stuff like music lyrics, everyone hears differ=\r\nent, why aren&#39;t these skeptics out there keeping people from buying records=\r\n? &lt;/div&gt;\n\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;That&#39;s pure BS about trying to save =\r\npeople from wasting money and time. I don&#39;t know what the motivation is, bu=\r\nt I suspect it has more to do with science dogma, than pure science. It&#39;s l=\r\nike we are all supposed to to get some bozo&#39;s permission to do our investig=\r\nations, and research has to be approved by some university.&nbsp;I say bite=\r\n me!&lt;/div&gt;\n\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;I dared to question the motivation=\r\n and methods of these supposed objective scientists and was accused of atta=\r\ncking them, like how dare I even question their authority! I&#39;m supposed to =\r\nsupply my equipment for debunking and not even ask how it will&nbsp; be tes=\r\nted, or what qualifies these bozos to test anything? &lt;/div&gt;\n\n&lt;div&gt;&nbsp;&lt;/d=\r\niv&gt;\n&lt;div&gt;&nbsp;I&#39;ve said all along that you can&#39;t take everything from the =\r\nboxes as gospel, and you do in fact hear what you want to hear at times, bu=\r\nt these pompus jerks act like I&#39;m&nbsp;the one out there fooling everyone. =\r\n&nbsp;These science dorks want one thing, they want the boxes to go away be=\r\ncause it does in fact show that there is more to life than the physical and=\r\n we are&nbsp;in fact more that some stupid accident as they would have us b=\r\nelieve. There is very strong motivation for science to show the box is noth=\r\ning, as with all things paranormal. &lt;/div&gt;\n\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;Wh=\r\ny is is ok for them to lie in the name of science!?&nbsp; When they say &quot;th=\r\nere is no evidence&quot; that is a lie!&lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;Frank=\r\n-S&lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;br&gt;&lt;/div&gt;\n\n\n    &lt;/div&gt;\n     \n\n\n\n \n\n\n=\r\n&lt;/div&gt;&lt;/blockquote&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n      \r\n--0-111825434-1262710132=:87805--"}