{"id": "16486", "subject": "Re: [EVP-ITC] Re: Types of messages", "author": "Misty Dawn", "timestamp": "2010-01-05T15:34:44Z", "full_text": "--0-675327560-1262705684=:33490\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nHiya Jill. \n=C2=A0\nMost likely most are busy with work, kids going back to =\r\nschool, and family from the holidays. No you arent the only one who gets th=\r\nose types of messages. As for the name thing some do give names and some do=\r\nn&#39;t. I have been given full names of those who passed or those who I will l=\r\nater meet many of which I never heard of until then. I dont think names are=\r\n quite as important once the physical body it was labeled upon passes on. S=\r\nome have stated they do not have names or never have been born as we were.\n=\r\n=C2=A0\nAs for why you dont get the reply you wish for or the magic words...=\r\n. take a look around. This board is a good example of how you dont always g=\r\net the reponse you wish for or the answers to all of your questions hehehe.=\r\n\n=C2=A0\nHope you had a great holiday and good luck in the upcoming year!\n=\r\n=C2=A0\nMisty\n\n--- On Mon, 1/4/10, Jill &lt;jjkamp@...&gt; wrote:\n\n\nFrom: =\r\nJill &lt;jjkamp@...&gt;\nSubject: [EVP-ITC] Re: Types of messages\nTo: EVP-=\r\nITC@yahoogroups.com\nDate: Monday, January 4, 2010, 10:37 PM\n\n\n=C2=A0 \n\n\n\nSo=\r\n I&#39;m guessing no one else here gets &quot;I love you&quot; from the entities? It&#39;s ju=\r\nst me? (I&#39;m just that loveable?) \n\n--- In EVP-ITC@yahoogroups .com, &quot;Jill&quot; =\r\n&lt;jjkamp@...&gt; wrote:\n&gt;\n&gt; On New Year&#39;s Eve and New Year&#39;s Day I did two sess=\r\nions with two different sets of participants. The messages always seem to b=\r\ne the same, though: &quot;I love you.&quot; Over and over, threading all through the =\r\nrecording, both in the background, and more overtly when I ask a specific q=\r\nuestion such as, &quot;Do you have a message for Heather?&quot; Does anyone else get =\r\nthis? I mean, it&#39;s flattering and all, but it doesn&#39;t really mean that much=\r\n when I don&#39;t know for sure who&#39;s telling me this.\n&gt; \n&gt; Also, &quot;they&quot; seem q=\r\nuite ready to tell me their first names, but almost never their last names.=\r\n Why? Do last names cease to exist on the other side? Or is there some unwr=\r\nitten rule that says verifiable information can&#39;t be passed along? If so, w=\r\nho makes and enforces these rules?\n&gt; \n&gt; And if they can so easily say a nam=\r\ne four times in a row (yesterday it was my friend&#39;s grandfather&#39; s name Don=\r\nald), why can&#39;t they say one word to me that would mean something? Or to my=\r\n friend Heather? We both asked, and got nothing, at least not that we could=\r\n discern. It would seem a simple thing to say the word plumber (that was my=\r\n dad&#39;s secret word) or some other single-syllable word. Now I&#39;m pretty sure=\r\n I really did talk to my dad, as I had another &quot;contact&quot; from him in my wak=\r\ning dream state the other morning, but if it&#39;s really him, why can&#39;t he say=\r\n something he would&#39;ve said in life? Why do I have the nagging feeling that=\r\n &quot;they&quot; aren&#39;t human and never were? \n&gt; \n&gt; I just don&#39;t get it! Any thought=\r\ns, guys?\n&gt;\n\n\n\n\n\n\n\n\n\n      \r\n--0-675327560-1262705684=:33490\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;DIV&gt;Hiya Jill. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV=\r\n&gt;Most likely most are busy with work, kids going back to school, and family=\r\n from the holidays. No you arent the only one who gets those types of messa=\r\nges. As for the name thing some do give names and some don&#39;t. I have been g=\r\niven full names of those who passed or those who I will later meet many of =\r\nwhich I never heard of until then. I dont think names are quite as importan=\r\nt once the physical body it was labeled upon passes on. Some have stated th=\r\ney do not have names or never have been born as we were.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;=\r\n/DIV&gt;\n&lt;DIV&gt;As for why you dont get the reply you wish for or the magic word=\r\ns.... take a look around. This board is a good example of how you dont alwa=\r\nys get the reponse you wish for or the answers to all of your questions heh=\r\nehe.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Hope you had a great holiday and good luc=\r\nk in the upcoming year!&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Misty&lt;BR&gt;&lt;BR&gt;--- On &lt;B=\r\n&gt;Mon, 1/4/10, Jill &lt;I&gt;&lt;jjkamp@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;&lt;/DIV&gt;\n&lt;=\r\nBLOCKQUOTE style=3D&quot;BORDER-LEFT: rgb(16,16,255) 2px solid; PADDING-LEFT: 5p=\r\nx; MARGIN-LEFT: 5px&quot;&gt;&lt;BR&gt;From: Jill &lt;jjkamp@...&gt;&lt;BR&gt;Subject: =\r\n[EVP-ITC] Re: Types of messages&lt;BR&gt;To: EVP-ITC@yahoogroups.com&lt;BR&gt;Date: Mon=\r\nday, January 4, 2010, 10:37 PM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3Dyiv756854252&gt;&lt;SPAN style=\r\n=3D&quot;DISPLAY: none&quot;&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV id=3Dygrp-text&gt;\n&lt;DIV&gt;So I&#39;m guessing=\r\n no one else here gets &quot;I love you&quot; from the entities? It&#39;s just me? (I&#39;m j=\r\nust that loveable?) &lt;BR&gt;&lt;BR&gt;--- In &lt;A href=3D&quot;http://us.mc329.mail.yahoo.co=\r\nm/mc/compose?to=3DEVP-ITC%40yahoogroups.com&quot; rel=3Dnofollow target=3D_blank=\r\n ymailto=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups .com&lt;/A&gt;,=\r\n &quot;Jill&quot; &lt;jjkamp@...&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; On New Year&#39;s Eve and New=\r\n Year&#39;s Day I did two sessions with two different sets of participants. The=\r\n messages always seem to be the same, though: &quot;I love you.&quot; Over and over, =\r\nthreading all through the recording, both in the background, and more overt=\r\nly when I ask a specific question such as, &quot;Do you have a message for Heath=\r\ner?&quot; Does anyone else get this? I mean, it&#39;s flattering and all, but it doe=\r\nsn&#39;t really mean that much when I don&#39;t know for sure who&#39;s telling me this=\r\n.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Also, &quot;they&quot; seem quite ready to tell me their first nam=\r\nes, but almost never their last names. Why? Do last names\n cease to exist o=\r\nn the other side? Or is there some unwritten rule that says verifiable info=\r\nrmation can&#39;t be passed along? If so, who makes and enforces these rules?&lt;B=\r\nR&gt;&gt; &lt;BR&gt;&gt; And if they can so easily say a name four times in a row (y=\r\nesterday it was my friend&#39;s grandfather&#39; s name Donald), why can&#39;t they say=\r\n one word to me that would mean something? Or to my friend Heather? We both=\r\n asked, and got nothing, at least not that we could discern. It would seem =\r\na simple thing to say the word plumber (that was my dad&#39;s secret word) or s=\r\nome other single-syllable word. Now I&#39;m pretty sure I really did talk to my=\r\n dad, as I had another &quot;contact&quot; from him in my waking dream state the othe=\r\nr morning, but if it&#39;s really him, why can&#39;t he say something he would&#39;ve s=\r\naid in life? Why do I have the nagging feeling that &quot;they&quot; aren&#39;t human and=\r\n never were? &lt;BR&gt;&gt; &lt;BR&gt;&gt; I just don&#39;t get it! Any thoughts,\n guys?&lt;BR=\r\n&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n      \r\n--0-675327560-1262705684=:33490--"}