{"id": "16490", "subject": "Re: Big Mistake!", "author": "Jill", "timestamp": "2010-01-05T17:35:13Z", "full_text": "Agree 100%, Frank.\n\n\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  So who certified these &quot;objective&quot; listeners in these supposed tests?\n&gt; Everyone hears different, and I doubt having some degree means you get\n&gt; perfect hearing. Even everyday stuff like music lyrics, everyone hears\n&gt; different, why aren&#39;t these skeptics out there keeping people from buying\n&gt; records?\n&gt; \n&gt;  That&#39;s pure BS about trying to save people from wasting money and time. I\n&gt; don&#39;t know what the motivation is, but I suspect it has more to do with\n&gt; science dogma, than pure science. It&#39;s like we are all supposed to to get\n&gt; some bozo&#39;s permission to do our investigations, and research has to be\n&gt; approved by some university. I say bite me!\n&gt; \n&gt;  I dared to question the motivation and methods of these supposed objective\n&gt; scientists and was accused of attacking them, like how dare I even question\n&gt; their authority! I&#39;m supposed to supply my equipment for debunking and not\n&gt; even ask how it will  be tested, or what qualifies these bozos to test\n&gt; anything?\n&gt; \n&gt;  I&#39;ve said all along that you can&#39;t take everything from the boxes as\n&gt; gospel, and you do in fact hear what you want to hear at times, but these\n&gt; pompus jerks act like I&#39;m the one out there fooling everyone.  These science\n&gt; dorks want one thing, they want the boxes to go away because it does in fact\n&gt; show that there is more to life than the physical and we are in fact more\n&gt; that some stupid accident as they would have us believe. There is very\n&gt; strong motivation for science to show the box is nothing, as with all things\n&gt; paranormal.\n&gt; \n&gt;  Why is is ok for them to lie in the name of science!?  When they say &quot;there\n&gt; is no evidence&quot; that is a lie!\n&gt; \n&gt;  Frank-S\n&gt;"}