{"id": "16491", "subject": "Re: Types of messages", "author": "Jill", "timestamp": "2010-01-05T17:47:36Z", "full_text": "Thanks for answering me, because I was wondering if the &quot;I love yous&quot; were something characteristic of just the entities I&#39;m talking to (maybe even the same entity over and over again), or characteristic of most entities in general -- like they have different priorities on what constitutes an important message once a person has died.  For instance, my father I&#39;m certain would&#39;ve told me to move the trees I&#39;d planted over the septic tank, but would&#39;ve never said &quot;I love you.&quot;  Maybe once he&#39;s dead, everything looks different to him?  (That&#39;s providing I&#39;m really talking to dead people, which I&#39;m starting to wonder about.)\n\nI&#39;m also noticing a tendency for the names I&#39;m getting lately to be Biblical:  Joseph and Michael have come through strongly, and I have no clue who they are.  Maybe they make a name in order to talk to me?\n\nI&#39;ve also been reading more about how there can be seemingly different groups of entities competing to talk:\n\nhttp://othersidecommunications.com/modules.php?name=Content&pa=showpage&pid=11\n\nI witnessed this, I think, myself when my uncle came through (giving supporting evidence that it truly was him) and I also heard someone say &quot;Get away from me.&quot;  So maybe our dead relatives are indeed there, but other entities, wanting to hog the spotlight, get in the way or skew what our dead relatives say?  Just a thought.\n\n\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt; I get those two. I rarely get last names. names have menaing on this level,\n&gt; but none of us are the same person in death, this is just one existence, one\n&gt; label or name, or gender, or species(?)\n&gt; \n&gt;  F-S\n&gt; \n&gt; On Mon, Jan 4, 2010 at 8:37 PM, Jill &lt;jjkamp@...&gt; wrote:\n&gt; \n&gt; &gt;\n&gt; &gt;\n&gt; &gt; So I&#39;m guessing no one else here gets &quot;I love you&quot; from the entities? It&#39;s\n&gt; &gt; just me? (I&#39;m just that loveable?)\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, &quot;Jill&quot;\n&gt; &gt; &lt;jjkamp@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; On New Year&#39;s Eve and New Year&#39;s Day I did two sessions with two\n&gt; &gt; different sets of participants. The messages always seem to be the same,\n&gt; &gt; though: &quot;I love you.&quot; Over and over, threading all through the recording,\n&gt; &gt; both in the background, and more overtly when I ask a specific question such\n&gt; &gt; as, &quot;Do you have a message for Heather?&quot; Does anyone else get this? I mean,\n&gt; &gt; it&#39;s flattering and all, but it doesn&#39;t really mean that much when I don&#39;t\n&gt; &gt; know for sure who&#39;s telling me this.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Also, &quot;they&quot; seem quite ready to tell me their first names, but almost\n&gt; &gt; never their last names. Why? Do last names cease to exist on the other side?\n&gt; &gt; Or is there some unwritten rule that says verifiable information can&#39;t be\n&gt; &gt; passed along? If so, who makes and enforces these rules?\n&gt; &gt; &gt;\n&gt; &gt; &gt; And if they can so easily say a name four times in a row (yesterday it\n&gt; &gt; was my friend&#39;s grandfather&#39;s name Donald), why can&#39;t they say one word to\n&gt; &gt; me that would mean something? Or to my friend Heather? We both asked, and\n&gt; &gt; got nothing, at least not that we could discern. It would seem a simple\n&gt; &gt; thing to say the word plumber (that was my dad&#39;s secret word) or some other\n&gt; &gt; single-syllable word. Now I&#39;m pretty sure I really did talk to my dad, as I\n&gt; &gt; had another &quot;contact&quot; from him in my waking dream state the other morning,\n&gt; &gt; but if it&#39;s really him, why can&#39;t he say something he would&#39;ve said in life?\n&gt; &gt; Why do I have the nagging feeling that &quot;they&quot; aren&#39;t human and never were?\n&gt; &gt; &gt;\n&gt; &gt; &gt; I just don&#39;t get it! Any thoughts, guys?\n&gt; &gt; &gt;\n&gt; &gt;\n&gt; &gt; \n&gt; &gt;\n&gt;"}