{"id": "16507", "subject": "Re: [EVP-ITC] Re: Jason Profits &quot;Cross Talk&quot;", "author": "Zack Widup", "timestamp": "2010-01-06T15:52:47Z", "full_text": "That&#39;s what I thought from the description.\n\nIt amazes me what some people sell (and evidently some people buy). I&#39;ve\nseen Linux being sold at various places, and you can download that for free,\ntoo.\n\nZack\n\nOn Tue, Jan 5, 2010 at 6:22 PM, Urkel23 &lt;urkel23@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;\n&gt; Here&#39;s the so called &quot;Crossover Talk&quot;. It&#39;s actually a piece of free\n&gt; software that some charlatan decided to cash in on. It&#39;s evpmaker with an\n&gt; allophone file created by Stefan Bion. I guess i just saved some people $50\n&gt; or whatever he&#39;s selling it for. Also, for those who have questions about\n&gt; audio editing software there is more people on Ebay selling &quot;Audacity&quot; for\n&gt; like $20 and that&#39;s also free on the internet.\n&gt;\n&gt; http://www.keyportparanormal.com/evpsoftware.html\n&gt;\n&gt; -Steve H.\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, &quot;john54542&quot;\n&gt; &lt;jfrick45@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; I am now wondering what people know about Jason Profits Cross Talk. This\n&gt; is something that is being sold on Ebay as a &quot;ghost hunting tool&quot;.\n&gt; Supposedly it is better than Frank&#39;s box or the hack box. Has anyone got\n&gt; this or know anything about it?\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nTha 's wha I hough om he desc ip ion.\n \nI amazes me wha some people sell (and e iden ly some people buy). I' e seen Linux being sold a a ious places, and you can download ha o ee, oo.\n \nZack\nOn Tue, Jan 5, 2010 a 6:22 PM, U kel23 u kel23@...> w o e:\n\n  \n\n\n\nHe e's he so called \"C osso e Talk\". I 's ac ually a piece o ee so wa e ha some cha la an decided o cash in on. I 's e pmake wi h an allophone ile c ea ed by S e an Bion. I guess i jus sa ed some people $50 o wha e e he's selling i o . Also, o hose who ha e ques ions abou audio edi ing so wa e he e is mo e people on Ebay selling \"Audaci y\" o like $20 and ha 's also ee on he in e ne .\nh p://www.keypo pa ano mal.com/e pso wa e.h ml-S e e H. \n--- In EVP-ITC@yahoog oups.com, \"john54542\" w o e:>> I am now wonde ing wha people know abou Jason P o i s C oss Talk. This is some hing ha is being sold on Ebay as a \"ghos hun ing ool\". Supposedly i is be e han F ank's box o he hack box. Has anyone go his o know any hing abou i ?\n>"}