{"id": "16517", "subject": "Re: [EVP-ITC] Re: What does it do?", "author": "Rj", "timestamp": "2010-01-07T18:12:52Z", "full_text": "--0-1305983698-1262887972=:86930\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nSo the entities are &#39;spirits&#39;?\n\nCan you be more specific as to what you mea=\r\nn by &#39;spirits&#39;?\n\nMaybe that also sounds like a dumb question, but I want to=\r\n make sure we&#39;re talking about the same thing.\n\n--- On Thu, 1/7/10, Tom &lt;To=\r\nm_Ray@...&gt; wrote:\n\nFrom: Tom &lt;Tom_Ray@...&gt;\nSubject:=\r\n [EVP-ITC] Re: What does it do?\nTo: EVP-ITC@yahoogroups.com\nDate: Thursday,=\r\n January 7, 2010, 9:52 AM\n\n\n\n\n\n\n\n=C2=A0\n\n\n\n  \n\n\n    \n      \n      \n      I =\r\ncan&#39;t speak for Frank, But for myself.  We Don&#39;t really KNOW how it works, =\r\nbut only that it DOES seem to work.\n\n\n\nI have at least three theories which=\r\n would cover both EVPs and Frank&#39;s box.  It seems that researchers will sel=\r\nect one theory as a &quot;working theory&quot; and thus build receivers that would op=\r\ntimize the effect.\n\n\n\nIn EVP we have at least two major theories.  In the E=\r\nM (Electromagnetic) theory, we assume thatthe spirits are communicating wit=\r\nh voice modulated EM waves--either via a kind of &quot;radio technology&quot; or the =\r\n&quot;fact&quot; that sound waves from the other side are Electromagnetic relative to=\r\n our own universe.  This explains why we often need a device like a electri=\r\nc sound recorder to hear the waves. \n\n\n\nThe other major theory, and the one=\r\n I subscribe to, is that the voices are made from existing background sound=\r\ns.  This is sorta like using an electronic larynix or holding an electric r=\r\nazor to one&#39;s lips and &quot;mouthing&quot; words. The vocal appratus changes shape a=\r\nnd resonance characteristics, making a sufficiently randomized sound(like a=\r\n buzzing razor) sound like words.  Spirits may do something similar, near a=\r\nn EVP recording microphone, either &quot;semi-manefesting&quot; a vocal apparatus or =\r\nby utilizing some of their own sound altering technology.\n\n\n\nThe third theo=\r\nry involves the listener putting the background noise together somewhat sel=\r\nectively- -in one&#39;s own mind, so to speak. The noise itself which forms whi=\r\nch is called a &quot;random field&quot;--- One of the &quot;psychic levers&quot; which effectiv=\r\nely enhances one&#39;s psychic abilities to useful levels.\n\n\n\nResearchers will =\r\ndesign their machines with one of these theories in mind.  FOr example, if =\r\ntheory two is chosen, the researcher will stress the production of an optim=\r\num sound/noise carrier wave that would work best for the proposed principle=\r\n. \n\n\n\nIf theory One is chosen the researcher would think in terms of radio =\r\nfrequencies.\n\n\n\nALL of these theories may be correct, so something designed=\r\n to exploit one effect might also work with other methods of EVP listening.=\r\n\n\n\n\nI think Frank&#39;s box is being used to generate and develop an optimum BA=\r\nCKGROUND noise that the spirits can use to modulate---whicheve r way they d=\r\no it.----Hey its called research--we are looking for answers we havent foun=\r\nd yet.\n\n\n\n--- In EVP-ITC@yahoogroups .com, &quot;rasterer&quot; &lt;rasterer@.. .&gt; wrote=\r\n:\n\n&gt;\n\n&gt; \n\n&gt; Hey all, I&#39;ve seen lots of people posting their perspectives an=\r\nd results and such about the Frank&#39;s Box.  In order to help develop some go=\r\nod testing for it, I think the first step is to get a common or official co=\r\nnsensus or statement on what it is the Frank&#39;s Box is claiming to be doing.=\r\n  This might seem a silly question, but I think it&#39;s important to make sure=\r\n any testing doesn&#39;t go off in some irrevelevant direction.\n\n&gt; \n\n&gt; Frank - =\r\nor anyone - what is a good official statement on what the Frank&#39;s box can d=\r\no?\n\n&gt;\n\n\n\n\n\n    \n     \n\n    \n    \n\n\n \n\n\n\n  \n\n\n\n\n\n\n      \r\n--0-1305983698-1262887972=:86930\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;So the entities are &#39;spirits&#39;?&lt;br&gt;&lt;br&gt;Can you=\r\n be more specific as to what you mean by &#39;spirits&#39;?&lt;br&gt;&lt;br&gt;Maybe that also =\r\nsounds like a dumb question, but I want to make sure we&#39;re talking about th=\r\ne same thing.&lt;br&gt;&lt;br&gt;--- On &lt;b&gt;Thu, 1/7/10, Tom &lt;i&gt;&lt;Tom_Ray@...=\r\n.us&gt;&lt;/i&gt;&lt;/b&gt; wrote:&lt;br&gt;&lt;blockquote style=3D&quot;border-left: 2px solid rgb(1=\r\n6, 16, 255); margin-left: 5px; padding-left: 5px;&quot;&gt;&lt;br&gt;From: Tom &lt;Tom_Ra=\r\ny@...&gt;&lt;br&gt;Subject: [EVP-ITC] Re: What does it do?&lt;br&gt;To: EVP=\r\n-ITC@yahoogroups.com&lt;br&gt;Date: Thursday, January 7, 2010, 9:52 AM&lt;br&gt;&lt;br&gt;&lt;di=\r\nv id=3D&quot;yiv843665323&quot;&gt;\n\n\n\n\n\n&lt;span style=3D&quot;display: none;&quot;&gt;&nbsp;&lt;/span&gt;\n\n\n=\r\n\n    &lt;div id=3D&quot;ygrp-text&quot;&gt;\n      \n      \n      &lt;p&gt;I can&#39;t speak for Frank,=\r\n But for myself.  We Don&#39;t really KNOW how it works, but only that it DOES =\r\nseem to work.&lt;br&gt;\n&lt;br&gt;\nI have at least three theories which would cover bot=\r\nh EVPs and Frank&#39;s box.  It seems that researchers will select one theory a=\r\ns a &quot;working theory&quot; and thus build receivers that would optimize the effec=\r\nt.&lt;br&gt;\n&lt;br&gt;\nIn EVP we have at least two major theories.  In the EM (Electro=\r\nmagnetic) theory, we assume thatthe spirits are communicating with voice mo=\r\ndulated EM waves--either via a kind of &quot;radio technology&quot; or the &quot;fact&quot; tha=\r\nt sound waves from the other side are Electromagnetic relative to our own u=\r\nniverse.  This explains why we often need a device like a electric sound re=\r\ncorder to hear the waves. &lt;br&gt;\n&lt;br&gt;\nThe other major theory, and the one I s=\r\nubscribe to, is that the voices are made from existing background sounds.  =\r\nThis is sorta like using an electronic larynix or holding an electric razor=\r\n to one&#39;s lips and &quot;mouthing&quot; words. The vocal appratus changes shape and r=\r\nesonance characteristics, making a sufficiently randomized sound(like a buz=\r\nzing razor) sound like words.  Spirits may do something similar, near an EV=\r\nP recording microphone, either &quot;semi-manefesting&quot; a vocal apparatus or by u=\r\ntilizing some of their own sound altering technology.&lt;br&gt;\n&lt;br&gt;\nThe third th=\r\neory involves the listener putting the background noise together somewhat s=\r\nelectively- -in one&#39;s own mind, so to speak. The noise itself which forms w=\r\nhich is called a &quot;random field&quot;--- One of the &quot;psychic levers&quot; which effect=\r\nively enhances one&#39;s psychic abilities to useful levels.&lt;br&gt;\n&lt;br&gt;\nResearche=\r\nrs will design their machines with one of these theories in mind.  FOr exam=\r\nple, if theory two is chosen, the researcher will stress the production of =\r\nan optimum sound/noise carrier wave that would work best for the proposed p=\r\nrinciple. &lt;br&gt;\n&lt;br&gt;\nIf theory One is chosen the researcher would think in t=\r\nerms of radio frequencies.&lt;br&gt;\n&lt;br&gt;\nALL of these theories may be correct, s=\r\no something designed to exploit one effect might also work with other metho=\r\nds of EVP listening.&lt;br&gt;\n&lt;br&gt;\nI think Frank&#39;s box is being used to generate=\r\n and develop an optimum BACKGROUND noise that the spirits can use to modula=\r\nte---whicheve r way they do it.----Hey its called research--we are looking =\r\nfor answers we havent found yet.&lt;br&gt;\n&lt;br&gt;\n--- In &lt;a rel=3D&quot;nofollow&quot; ymailt=\r\no=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot; target=3D&quot;_blank&quot; href=3D&quot;/mc/compos=\r\ne?to=3DEVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups .com&lt;/a&gt;, &quot;rasterer&quot; =\r\n&lt;rasterer@.. .&gt; wrote:&lt;br&gt;\n&gt;&lt;br&gt;\n&gt; &lt;br&gt;\n&gt; Hey all, I&#39;ve seen=\r\n lots of people posting their perspectives and results and such about the F=\r\nrank&#39;s Box.  In order to help develop some good testing for it, I think the=\r\n first step is to get a common or official consensus or statement on what i=\r\nt is the Frank&#39;s Box is claiming to be doing.  This might seem a silly ques=\r\ntion, but I think it&#39;s important to make sure any testing doesn&#39;t go off in=\r\n some irrevelevant direction.&lt;br&gt;\n&gt; &lt;br&gt;\n&gt; Frank - or anyone - what i=\r\ns a good official statement on what the Frank&#39;s box can do?&lt;br&gt;\n&gt;&lt;br&gt;\n&lt;b=\r\nr&gt;\n&lt;/p&gt;\n\n    &lt;/div&gt;\n     \n\n\n\n \n\n\n&lt;/div&gt;&lt;/blockquote&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n=\r\n\n\n\n      \r\n--0-1305983698-1262887972=:86930--"}