{"id": "16516", "subject": "Re: What does it do?", "author": "Tom", "timestamp": "2010-01-07T17:52:41Z", "full_text": "I can&#39;t speak for Frank, But for myself.  We Don&#39;t really KNOW how it works, but only that it DOES seem to work.\n\nI have at least three theories which would cover both EVPs and Frank&#39;s box.  It seems that researchers will select one theory as a &quot;working theory&quot; and thus build receivers that would optimize the effect.\n\nIn EVP we have at least two major theories.  In the EM (Electromagnetic)theory, we assume thatthe spirits are communicating with voice modulated EM waves--either via a kind of &quot;radio technology&quot; or the &quot;fact&quot; that sound waves from the other side are Electromagnetic relative to our own universe.  This explains why we often need a device like a electric sound recorder to hear the waves. \n\nThe other major theory, and the one I subscribe to, is that the voices are made from existing background sounds.  This is sorta like using an electronic larynix or holding an electric razor to one&#39;s lips and &quot;mouthing&quot; words. The vocal appratus changes shape and resonance characteristics, making a sufficiently randomized sound(like a buzzing razor) sound like words.  Spirits may do something similar, near an EVP recording microphone, either &quot;semi-manefesting&quot; a vocal apparatus or by utilizing some of their own sound altering technology.\n\nThe third theory involves the listener putting the background noise together somewhat selectively--in one&#39;s own mind, so to speak. The noise itself which forms which is called a &quot;random field&quot;--- One of the &quot;psychic levers&quot; which effectively enhances one&#39;s psychic abilities to useful levels.\n\nResearchers will design their machines with one of these theories in mind.  FOr example, if theory two is chosen, the researcher will stress the production of an optimum sound/noise carrier wave that would work best for the proposed principle. \n\n If theory One is chosen the researcher would think in terms of radio frequencies.\n\nALL of these theories may be correct, so something designed to exploit one effect might also work with other methods of EVP listening.\n\nI think Frank&#39;s box is being used to generate and develop an optimum BACKGROUND noise that the spirits can use to modulate---whichever way they do it.----Hey its called research--we are looking for answers we havent found yet.\n\n--- In EVP-ITC@yahoogroups.com, &quot;rasterer&quot; &lt;rasterer@...&gt; wrote:\n&gt;\n&gt; \n&gt; Hey all, I&#39;ve seen lots of people posting their perspectives and results and such about the Frank&#39;s Box.  In order to help develop some good testing for it, I think the first step is to get a common or official consensus or statement on what it is the Frank&#39;s Box is claiming to be doing.  This might seem a silly question, but I think it&#39;s important to make sure any testing doesn&#39;t go off in some irrevelevant direction.\n&gt; \n&gt; Frank - or anyone - what is a good official statement on what the Frank&#39;s box can do?\n&gt;"}