{"id": "16524", "subject": "Re: [EVP-ITC] What does it do?", "author": "Zack Widup", "timestamp": "2010-01-07T19:25:51Z", "full_text": "Just a guess, since I don&#39;t have a lot of experience with this - probably\nthe mesages are meant for one user and it&#39;s best if one user listens at a\ntime.\n\nIt could be that some messages come through that are meant for multiple\nusers at once. I&#39;ve heard the same things as Frank in some of the recordings\nhe&#39;s posted. FWIW.\n\nZack\n\nOn Thu, Jan 7, 2010 at 12:51 PM, Rj &lt;rasterer@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;   Thanks Zack.  So how do you see not asking it questions squaring with\n&gt; Frank&#39;s comment of &quot;It&#39;s not the device, it&#39;s the user. The messages\n&gt; received are for the user, and rarely does anyone hear the same thing as the\n&gt; original listener.&quot;\n&gt;\n&gt; Does that mean two people can&#39;t use it together?  How would they know which\n&gt; the message was for if they do?  Or is it best to only use it alone?\n&gt;\n&gt;\n&gt; --- On *Thu, 1/7/10, Zack Widup &lt;w9sz.zack@...&gt;* wrote:\n&gt;\n&gt;\n&gt; From: Zack Widup &lt;w9sz.zack@gmail.com&gt;\n&gt;\n&gt; Subject: Re: [EVP-ITC] What does it do?\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Thursday, January 7, 2010, 10:40 AM\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; I don&#39;t think any of us know really who or what the &quot;entities&quot; are. They\n&gt; have told a few people who they are, but given the propensity of some to\n&gt; lie, who knows?\n&gt;\n&gt; I also believe you do not need to ask any questions at all - just let the\n&gt; box run and listen to what comes out, maybe record it at the same time so\n&gt; you can replay it later.\n&gt;\n&gt; Zack\n&gt;\n&gt; On Thu, Jan 7, 2010 at 12:10 PM, Rj &lt;rasterer@yahoo. com&lt;http://mc/compose?to=rasterer@...&gt;\n&gt; &gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;   Perhaps I am not being clear.  I am not asking how it works.  I am\n&gt;&gt; asking what you claim it does.\n&gt;&gt;\n&gt;&gt; For example, from your statements below, I get:\n&gt;&gt;\n&gt;&gt; &quot;The Frank&#39;s box allows entities to use FM and AM radio broadcast as raw\n&gt;&gt; material, which these enties select and shape to communicate with the user.\n&gt;&gt; The messages received are for the user, and rarely does anyone hear the same\n&gt;&gt; thing as the original listener.&quot;\n&gt;&gt;\n&gt;&gt; Can you be any more specific as to what you mean by &#39;entities&#39;?\n&gt;&gt; Also, can the user be defined as the person asking the box questions?\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; --- On *Thu, 1/7/10, Frank Sumption &lt;purplealiengirl@ gmail.com&lt;http://mc/compose?to=purplealiengirl@...&gt;\n&gt;&gt; &gt;* wrote:\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; From: Frank Sumption &lt;purplealiengirl@ gmail.com&lt;http://mc/compose?to=purplealiengirl@...&gt;\n&gt;&gt; &gt;\n&gt;&gt; Subject: Re: [EVP-ITC] What does it do?\n&gt;&gt;\n&gt;&gt; To: EVP-ITC@yahoogroups .com&lt;http://mc/compose?to=EVP-ITC@yahoogroups.com&gt;\n&gt;&gt; Date: Thursday, January 7, 2010, 9:35 AM\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;  It&#39;s a freaking radio!  The tuning is swept across the entire band, AM or\n&gt;&gt; FM, the resulting bits of speech, music, and noise are used by the enitites\n&gt;&gt; as a raw material to build their voices from. The sweep can be linear,\n&gt;&gt; random, or manual, and it does not have to cover the entire broadcast band.\n&gt;&gt; This is one method and device for providing the raw audio, and if you&#39;re\n&gt;&gt; tesitng to see if it&#39;s just broadcast fragments, consider this-the concept\n&gt;&gt; is the same as EVPmaker, EVPmaker runs on a computer, the entities\n&gt;&gt; manipulate that raw audio *inside* the conmputer, and if you think stray\n&gt;&gt; RF is going to get *inside* the hard drive and mix with the audio file\n&gt;&gt; you have no clue how any technology works.\n&gt;&gt;\n&gt;&gt;  Testing is irrelavent! It&#39;s not the device, it&#39;s the user. The messages\n&gt;&gt; received are for the user, and rarely does anyone hear the same thing as the\n&gt;&gt; original listener.\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;  You test it by use, you judge it by what comes through and what it means\n&gt;&gt; to you, you can&#39;t play the sound snipets to a panel of numbnuts(objective\n&gt;&gt; listeners)) and expect to get an unbiased/honest test. No two people hear\n&gt;&gt; the same, so an &quot;objective listener&quot; is an insult to most people doing this\n&gt;&gt; work.\n&gt;&gt;\n&gt;&gt;  I know, I&#39;m being harsh.\n&gt;&gt;\n&gt;&gt;  Frank-S\n&gt;&gt;\n&gt;&gt; On Thu, Jan 7, 2010 at 8:20 AM, rasterer &lt;rasterer@yahoo. com&lt;http://mc/compose?to=rasterer@...&gt;\n&gt;&gt; &gt; wrote:\n&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt; Hey all, I&#39;ve seen lots of people posting their perspectives and results\n&gt;&gt;&gt; and such about the Frank&#39;s Box. In order to help develop some good testing\n&gt;&gt;&gt; for it, I think the first step is to get a common or official consensus or\n&gt;&gt;&gt; statement on what it is the Frank&#39;s Box is claiming to be doing. This might\n&gt;&gt;&gt; seem a silly question, but I think it&#39;s important to make sure any testing\n&gt;&gt;&gt; doesn&#39;t go off in some irrevelevant direction.\n&gt;&gt;&gt;\n&gt;&gt;&gt; Frank - or anyone - what is a good official statement on what the Frank&#39;s\n&gt;&gt;&gt; box can do?\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;\n&gt; \n&gt;\n\nJus a guess, since I don' ha e a lo o expe ience wi h his - p obably he mesages a e mean o one use and i 's bes i one use lis ens a a ime.\n \nI could be ha some messages come h ough ha  a e mean o mul iple use s a once. I' e hea d he same hings as F ank in some o he eco dings he's pos ed. FWIW.\n \nZack\nOn Thu, Jan 7, 2010 a 12:51 PM, Rj as e e @...> w o e:\n\n  \n\n\n\n\n\n\n\nThanks Zack.  So how do you see no asking i ques ions squa ing wi h F ank's commen o \"I 's no he de ice, i 's he use . The messages ecei ed a e o he use , and a ely does anyone hea he same hing as he o iginal lis ene .\"\nDoes ha mean wo people can' use i oge he ?  How would hey know which he message was o i hey do?  O is i bes o only use i alone?--- On Thu, 1/7/10, Zack Widup w9sz.zack@...> w o e:\n\nF om: Zack Widup w9sz.zack@...> \nSubjec : Re: [EVP-ITC] Wha does i do?To: EVP-ITC@yahoog oups.comDa e: Thu sday, Janua y 7, 2010, 10:40 AM \n\n\n\n  \n\n\nI don' hink any o us know eally who o wha he \"en i ies\" a e. They ha e old a ew people who hey a e, bu gi en he p opensi y o some o lie, who knows?\n \nI also belie e you do no need o ask any ques ions a all - jus le he box un and lis en o wha comes ou , maybe eco d i a he same ime so you can eplay i la e .\n \nZack\nOn Thu, Jan 7, 2010 a 12:10 PM, Rj as e e @yahoo. com> w o e:\n\n  \n\n\n\n\n\n\n\nPe haps I am no being clea .  I am no asking how i wo ks.  I am asking wha you claim i does.Fo example, om you s a emen s below, I ge :\"The F ank's box allows en i ies o use FM and AM adio b oadcas as aw ma e ial, which hese en ies selec and shape o communica e wi h he use .  The messages ecei ed a e o he use , and a ely does anyone hea he same hing as he o iginal lis ene .\"\nCan you be any mo e speci ic as o wha you mean by 'en i ies'?Also, can he use be de ined as he pe son asking he box ques ions?--- On Thu, 1/7/10, F ank Sump ion pu plealiengi l@ gmail.com> w o e:\n\nF om: F ank Sump ion pu plealiengi l@ gmail.com>Subjec : Re: [EVP-ITC] Wha does i do? \nTo: EVP-ITC@yahoog oups .comDa e: Thu sday, Janua y 7, 2010, 9:35 AM \n\n  \n\n\n I 's a eaking adio!  The uning is swep ac oss he en i e band, AM o FM, he esul ing bi s o speech, music, and noise a e used by he eni i es as a aw ma e ial o build hei oices om. The sweep can be linea , andom, o manual, and i does no ha e o co e he en i e b oadcas band. This is one me hod and de ice o p o iding he aw audio, and i you' e esi ng o see i i 's jus b oadcas agmen s, conside his- he concep is he same as EVPmake , EVPmake uns on a compu e , he en i ies manipula e ha aw audio inside he conmpu e , and i you hink s ay RF is going o ge inside he ha d d i e and mix wi h  he audio ile you ha e no clue how any echnology wo ks. \n\n \n Tes ing is i ela en ! I 's no he de ice, i 's he use . The messages ecei ed a e o he use , and a ely does anyone hea he same hing as he o iginal lis ene . \n \n \n You es i by use, you judge i by wha comes h ough and wha i means o you, you can' play he sound snipe s o a panel o numbnu s(objec i e lis ene s)) and expec o ge an unbiased/hones es . No wo people hea he same, so an \"objec i e lis ene \" is an insul o mos people doing his wo k.\n\n \n I know, I'm being ha sh.\n \n F ank-S\nOn Thu, Jan 7, 2010 a 8:20 AM, as e e as e e @yahoo. com> w o e:\n\n  \n\n\n\nHey all, I' e seen lo s o people pos ing hei pe spec i es and esul s and such abou he F ank's Box. In o de o help de elop some good es ing o i , I hink he i s s ep is o ge a common o o icial consensus o s a emen on wha i is he F ank's Box is claiming o be doing. This migh seem a silly ques ion, bu I hink i 's impo an o make su e any es ing doesn' go o in some i e ele an di ec ion.\nF ank - o anyone - wha is a good o icial s a emen on wha he F ank's box can do?"}