{"id": "16557", "subject": "Re: Hello", "author": "Jill", "timestamp": "2010-01-09T19:50:08Z", "full_text": "I&#39;m not an expert by any means, but this would be my response (take it with a grain of salt):\n\nI&#39;m not sure if you are saying the girl is coming through on the ghost box and asking for prayers to be said for her, but if that&#39;s what you&#39;re saying, I would wonder first if it is truly her coming through.  It&#39;s common to get entities who lie about their identity, so you may have an entity who wants prayers said for itself, or thinks prayers should be said for the girl and is acting on her behalf.  Or...it really is the girl sending these messages.  Was she known to be religious in life?  She might be stuck somehow, and might need some sort of assistance to get &quot;into the light.&quot;  \n\nIf it were me, I would do as she asked; what could it hurt?  Another thing that could be done is to do a ghost box session, and ask for assistance from other loving, helpful entities to assist the girl into the light.  Or you could try talking her through yourself.  Although I&#39;d tend to leave these last two suggestions to those who are experienced in such matters.  But the prayers and whatnot certainly couldn&#39;t hurt.\n\nAs for the rose, I have no idea.  My guess is, it&#39;s some sort of message intended for those close to her, and only they will know its meaning.\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, shipsdrummer@... wrote:\n&gt;\n&gt; Hello Frank,\n&gt; I am new, my name is lee and both me and my son have heard you on the Art \n&gt; Bell show. My son is into electronics and will join soon but I have a \n&gt; question that you or your members might be able to answer.\n&gt; There is a person in Nova Scocia whos 14 yr old daughter commited suicide \n&gt; by hanging in a tree. They keep getting that she is asking for Masses and \n&gt; prayers to be said for her. Why do they need many Masses said for them/ She is \n&gt; also always holding a Rose everytime she shows up.\n&gt; Any thoughts on this subject? I dont know what to say to this lady.\n&gt;  \n&gt; Also, my son has built one of the radio shack boxes.\n&gt;  \n&gt; lee\n&gt;"}