{"id": "16571", "subject": "Re: [EVP-ITC] My", "author": "Zack Widup", "timestamp": "2010-01-13T22:29:08Z", "full_text": "What free energy machines did they try to build? There are hundreds of\ndifferent ideas, designs and concepts out there.\n\nIf it was John Bedini&#39;s, I don&#39;t doubt it.\n\nZack\n\nOn Wed, Jan 13, 2010 at 4:24 PM, April Abercrombie &lt;\napril@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; ﻿\n&gt; They did a MythBusters episode on the free energy machines...BUSTED!!!\n&gt;\n&gt;\n&gt;  ----- Original Message -----\n&gt; *From:* don powell &lt;dpowell7299@...&gt;\n&gt; *To:* EVP-ITC@yahoogroups.com\n&gt;  *Sent:* Wednesday, January 13, 2010 3:07 PM\n&gt; *Subject:* Re: [EVP-ITC] My\n&gt;\n&gt;\n&gt;\n&gt;  Well as a great lover of Radio Shack&#39;s various projects (150 in 1 was my\n&gt; fave), I&#39;m pretty sure you will not be able to build a sweeping AM radio\n&gt; from that.  Sorry.  But they are great to learn basic principles from.\n&gt;\n&gt; Also while the jury is still out on whether or not free energy machines\n&gt; exist, it is definitely not going to be able to be built using a radio shack\n&gt; learning lab.  Otherwise everyone would have one by now and we would not\n&gt; need the power companies.\n&gt;\n&gt; Don\n&gt;\n&gt;\n&gt;\n&gt;  ------------------------------\n&gt; *From:* Jean Brisson &lt;sonny_mtl_can@yahoo.com&gt;\n&gt; *To:* EVP-ITC@yahoogroups.com\n&gt; *Sent:* Wed, January 13, 2010 3:27:31 PM\n&gt; *Subject:* [EVP-ITC] My\n&gt;\n&gt;\n&gt;\n&gt;  I am too intrested in making my own box. I recieved my Radio Shack\n&gt; Electronics Learning Lab just a last week from EBay http://cgi.ebay.\n&gt; com/BRAND- NEW-ELECTRONICS- LEARNING- LAB-RADIO- SHACK-28- 280_W0QQitemZ150\n&gt; 404642293QQcmdZV iewItemQQptZLH_ DefaultDomain_ 0?hash=item2304d 0b5f5#shId&lt;http://cgi.ebay.com/BRAND-NEW-ELECTRONICS-LEARNING-LAB-RADIO-SHACK-28-280_W0QQitemZ150404642293QQcmdZViewItemQQptZLH_DefaultDomain_0?hash=item2304d0b5f5#shId&gt;\n&gt; .\n&gt; I believe I can learn electronics using this kit and YouTube videos.\n&gt; I am following a video lesson course on how to use the Electronics leaning\n&gt; Lab on YouTube Here&#39;s the Link: http://www.youtube. com/watch?\n&gt; v=xGHjd88ASNM&feature=fvw&lt;http://www.youtube.com/watch?v=xGHjd88ASNM&feature=fvw&gt;\n&gt; I hope using this electronics kit I can learn to make a box out of it so\n&gt; anyone who knows electronics or this kit will believe and can make something\n&gt; like a ghost radio box. I also believe I can try to make a few different\n&gt; boxs out of this kit. But does anyone have the diagrames? or the\n&gt; chips/parts? Videos on how too are good also.\n&gt;\n&gt; I also would like to try to make my Eletronics learning Lab into a free\n&gt; energy device. Does any one have any plans on that?\n&gt; Here&#39;s a YouTube video on that: http://www.youtube. com/watch? v=Ee9uYqFb-\n&gt; OI &lt;http://www.youtube.com/watch?v=Ee9uYqFb-OI&gt;\n&gt;\n&gt; Thanks.\n&gt;\n&gt;   \n&gt;\n\nWha ee ene gy machines did hey y o build? The e a e hund eds o di e en ideas, designs and concep s ou he e.\n \nI i was John Bedini's, I don' doub i .\n \nZack\nOn Wed, Jan 13, 2010 a 4:24 PM, Ap il Abe c ombie ap il@...> w o e:\n\n  \n\n\n\n﻿ \nThey did a My hBus e s episode on he ee ene gy machines...BUSTED!!!\n \n\n\n----- O iginal Message ----- \nF om: don powell \nTo: EVP-ITC@yahoog oups.com \n\nSen : Wednesday, Janua y 13, 2010 3:07 PM\nSubjec : Re: [EVP-ITC] My\n  \n\n\n\nWell as a g ea lo e o Radio Shack's a ious p ojec s (150 in 1 was my a e), I'm p e y su e you will no be able o build a sweeping AM adio om ha .  So y.  Bu hey a e g ea o lea n basic p inciples om.\nAlso while he ju y is s ill ou on whe he o no ee ene gy machines exis , i is de ini ely no going o be able o be buil using a adio shack lea ning lab.  O he wise e e yone would ha e one by now and we would no need he powe companies.\nDon\n\n\n\nF om: Jean B isson sonny_m l_can@...>To: EVP-ITC@yahoog oups.com\nSen : Wed, Janua y 13, 2010 3:27:31 PMSubjec : [EVP-ITC] My  \n\n\n\nI am oo in es ed in making my own box. I  ecie ed my Radio Shack Elec onics Lea ning Lab jus a las week om EBay h p://cgi.ebay. com/BRAND- NEW-ELECTRONICS- LEARNING- LAB-RADIO- SHACK-28- 280_W0QQi emZ150 404642293QQcmdZV iewI emQQp ZLH_ De aul Domain_ 0?hash=i em2304d 0b5 5#shId.\n\nI belie e I can lea n elec onics using his ki and YouTube ideos.\nI am ollowing a ideo lesson cou se on how o use he Elec onics leaning Lab on YouTube He e's he Link: h p://www.you ube. com/wa ch? =xGHjd88ASNM& ea u e= w\n\nI hope using his elec onics ki I can lea n o make a box ou o i so anyone who knows elec onics o his ki will belie e and can make some hing like a ghos adio box. I also belie e I can y o make a ew di e en boxs ou o his ki . Bu does anyone ha e he diag ames? o he chips/pa s? Videos on how oo a e good also.\n\n \nI also would like o y o make my Ele onics lea ning Lab in o a ee ene gy de ice. Does any one ha e any plans on ha ?\nHe e's a YouTube ideo on ha : h p://www.you ube. com/wa ch? =Ee9uYqFb- OI\n \nThanks."}