{"id": "16590", "subject": "Re: [EVP-ITC] pcb", "author": "Zack Widup", "timestamp": "2010-01-16T16:46:27Z", "full_text": "I&#39;m an electrical engineer and also a radio amateur so I make a lot of pc\nboards, both at work and at home.\n\nYes, that board should work. If you have a single-sided board pattern, after\nyou&#39;ve developed the photoresist (or ironed on the toner, if you do it that\nway) spray the other side of the board with spray paint and let dry. I like\nto use the clear coat paint but it doesn&#39;t really matter.\n\nAfter you&#39;ve etched one side, clean the paint and the photoresist off (clean\nboth sides) with acetone, MEK, etc. Do this in a well-ventilated area! Then\ndrill your holes.\n\nIf you are going to make a double-sided board, drill a few of the holes that\nhave common pads on both sides to orient the pattern on the other side and\nrepeat whatever method you use to put a resist on that side. After it&#39;s\ndeveloped/ironed on, spray the already etched side with paint and etch the\nother side. Clean off the board and drill holes.\n\nZack\n\nOn Sat, Jan 16, 2010 at 2:40 AM, elmer kliewer &lt;\ncowboy_ridehard2003@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;   hay thanks zack where do you fine that stuff.\n&gt;  what i have now is a two sided copper clad board (not sensitize)  will it\n&gt; work with that as well? Would hate to wast them.\n&gt;\n&gt;\n&gt; \n&gt;\n\nI'm an elec ical enginee and also a adio ama eu so I make a lo o pc boa ds, bo h a wo k and a home.\n \nYes, ha boa d should wo k. I you ha e a single-sided boa d pa e n, a e you' e de eloped he pho o esis (o i oned on he one , i you do i ha way) sp ay he o he side o he boa d wi h sp ay pain and le d y. I like o use he clea coa pain bu i doesn' eally ma e .\n\n \nA e you' e e ched one side, clean he pain and he pho o esis  o (clean bo h sides) wi h ace one, MEK, e c. Do his in a well- en ila ed a ea! Then d ill you holes.\n \nI you a e going o make a double-sided boa d, d ill a ew o he holes ha ha e common pads on bo h sides o o ien he pa e n on he o he side and epea wha e e me hod you use o pu a esis on ha side. A e i 's de eloped/i oned on, sp ay he al eady e ched side wi h pain and e ch he o he side. Clean o he boa d and d ill holes.\n\n \nZack\nOn Sa , Jan 16, 2010 a 2:40 AM, elme kliewe cowboy_ ideha d2003@...> w o e:\n\n  \n\n\n\n\n\n\n\nhay hanks zack whe e do you ine ha s u .   wha i ha e now is a wo sided coppe clad boa d (no sensi ize)  will i wo k wi h ha as well? Would ha e o was hem."}