{"id": "16600", "subject": "Re: &quot;Tom&#39;s Toob&quot;--ghost box", "author": "Jill", "timestamp": "2010-01-18T05:06:37Z", "full_text": "Hi Tom, thanks for sharing.  I love hearing about what sorts of replies other people get during their sessions.  You sound like you had a great success right out of the gate.  I would, however, HIGHLY recommend that you tape EVERYTHING from now on.  You will find that you hear many, many things that you couldn&#39;t hear during the actual session; whether this is because EVP is involved, or because messages are just quiet (mine almost always are found in the background of the regular newscaster snippets), I don&#39;t know, maybe both, but you should always record somehow -- just my &quot;newbie&quot; advice.\n\nIf you get more, I&#39;d love to hear what &quot;they&quot; tell you.  I&#39;m so completely fascinated by the things they say, because it&#39;s really all we have to go on to figure out who &quot;they&quot; really are.  It&#39;s wonderful that you got the actual voice tone of your friend -- that tends to suggest it really was him (and not an imposter who just wanted to talk to someone).\n\nKeep trying to talk to Bradley and let us know what he tells you!\n\nJill\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;Tom&quot; &lt;Tom_Ray@...&gt; wrote:\n&gt;\n&gt; Well, I finally got my own ghost box put together in a single, portable package.\n&gt; I call it &quot;Tom&#39;s Toob&quot; (Tube).\n&gt; \n&gt; Its a 25 inch long, 2&quot;/id peice of PVC pipe, painted black. It has two slots\n&gt; cut into its right half, near the center just big enough to accomidate the lower\n&gt; half of a hacked 587 radio in one and an Avon &quot;SpaFinder&quot; sleep noise generator\n&gt; in the other. The loudspeakers of both thus open inside the tube while the\n&gt; controls remain outside the pipe and are easily accessible. I must say that\n&gt; the resonance and sound mixing in the tube are great. The noise generator has\n&gt; several different random sounds that might be useful, like a fairly clean &quot;white\n&gt; noise&quot;, a &quot;water fall&quot; sound and a &quot;running stream&quot; sound with a volume control.\n&gt; Other sounds like &quot;wind chimes&quot; &quot;jungle&quot;, etc. likely are less useful, but might\n&gt; be fun to play with.\n&gt; \n&gt; It seems to work, but I miss a lot---I need more practice, I suppose. \n&gt; &quot;Bradley&quot;, a deceased friend of mine said his name-- and It did sound like his\n&gt; voice. When I asked how he died--he replied &quot;accident!&quot;--which is true--he\n&gt; drove his car under a moving train.--he said more, but I couldnt make it\n&gt; out---gotta get the tape recorder running.\n&gt; \n&gt; The picture of Tom&#39;s Toob should be in my album. My omly problem is that I\n&gt; might need to speed the scan up just a bit. It there a capacitor or resistor I\n&gt; can add to do this?\n&gt; \n&gt; I like the fact that the pipe is easy to carry in one hand or on my shoulder. I\n&gt; was inspired to use a pipe to house the components by a recent episode of &quot;Ghost\n&gt; adventures&quot;--they only had a radio in theirs though.\n&gt;"}