{"id": "16605", "subject": "Re: &quot;Tom&#39;s Toob&quot;--ghost box", "author": "Tom", "timestamp": "2010-01-19T14:07:32Z", "full_text": "I tried again the next night and asked Brad WHY he did what he did---His one word reply was &quot;Crazy&quot;  he did not elaborate.  Brad was like that though-- Often very &quot;deadpan&quot; not much for words.\n  We had great conversations about the paranormal when he was alive.  He HAD been known for episodes of &quot;instability&quot; though. The night he died---Back in 2002, he woke up ranting and raving to his Girlfriend, jumped in his car and raced down the street.  Unfortunately, a train was crossing it at the time, and he ran his car under it-- without stopping.  I could feel him for years urging me to develop some kind of &quot;electrical&quot; communication with him,(really a long term goal of mine) but I never got around to it. Then I discovered this &quot;Franks Box&quot; stuff a few months back and finally decided to make something like it when I found the hack on the web a few weeks back.  \n I have been working with the components, radio, resonator, noise source, recorder, just layed out on my dining room table and playing with it for a few days, planning to box it up in a transportable unit---Then I saw on TV how someone was using a large PVC pipe to both house the radio and form a resonator.--The idea was great.  by cutting a slot to fit the radio in the side of the pipe the radio fit in prfectly, with the speaker end INSIDE the pipe and it&#39;s controls , on its upper half, on the outside of the pipe. I did the same thing with the noise generator, right next to the radio. I turned it on and decided to ask questions.  Bradley finally came to mind and I asked if he was there---Thats when I heard him say his name and I asked what happened to him the night he died.  I heard &quot;Accident&quot; and some other stuff I could not make out.  Unfortunately, I was not running the sound recorder at the time.  The next night I asked the question again and got &quot;Crazy&quot;.  (still no recorder)  I have just figgured out how to use a rubber band to secure my small panasonic digital recorder into one end of the tube, but I have not done a session with it in the last couple of days.  My next step is to download the audacity software in my computer so I can process the recordings I get THEN I will be in business.\n\n--- In EVP-ITC@yahoogroups.com, &quot;Jill&quot; &lt;jjkamp@...&gt; wrote:\n&gt;\n&gt; Hi Tom, thanks for sharing.  I love hearing about what sorts of replies other people get during their sessions.  You sound like you had a great success right out of the gate.  I would, however, HIGHLY recommend that you tape EVERYTHING from now on.  You will find that you hear many, many things that you couldn&#39;t hear during the actual session; whether this is because EVP is involved, or because messages are just quiet (mine almost always are found in the background of the regular newscaster snippets), I don&#39;t know, maybe both, but you should always record somehow -- just my &quot;newbie&quot; advice.\n&gt; \n&gt; If you get more, I&#39;d love to hear what &quot;they&quot; tell you.  I&#39;m so completely fascinated by the things they say, because it&#39;s really all we have to go on to figure out who &quot;they&quot; really are.  It&#39;s wonderful that you got the actual voice tone of your friend -- that tends to suggest it really was him (and not an imposter who just wanted to talk to someone).\n&gt; \n&gt; Keep trying to talk to Bradley and let us know what he tells you!\n&gt; \n&gt; Jill\n&gt; \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Tom&quot; &lt;Tom_Ray@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Well, I finally got my own ghost box put together in a single, portable package.\n&gt; &gt; I call it &quot;Tom&#39;s Toob&quot; (Tube).\n&gt; &gt; \n&gt; &gt; Its a 25 inch long, 2&quot;/id peice of PVC pipe, painted black. It has two slots\n&gt; &gt; cut into its right half, near the center just big enough to accomidate the lower\n&gt; &gt; half of a hacked 587 radio in one and an Avon &quot;SpaFinder&quot; sleep noise generator\n&gt; &gt; in the other. The loudspeakers of both thus open inside the tube while the\n&gt; &gt; controls remain outside the pipe and are easily accessible. I must say that\n&gt; &gt; the resonance and sound mixing in the tube are great. The noise generator has\n&gt; &gt; several different random sounds that might be useful, like a fairly clean &quot;white\n&gt; &gt; noise&quot;, a &quot;water fall&quot; sound and a &quot;running stream&quot; sound with a volume control.\n&gt; &gt; Other sounds like &quot;wind chimes&quot; &quot;jungle&quot;, etc. likely are less useful, but might\n&gt; &gt; be fun to play with.\n&gt; &gt; \n&gt; &gt; It seems to work, but I miss a lot---I need more practice, I suppose. \n&gt; &gt; &quot;Bradley&quot;, a deceased friend of mine said his name-- and It did sound like his\n&gt; &gt; voice. When I asked how he died--he replied &quot;accident!&quot;--which is true--he\n&gt; &gt; drove his car under a moving train.--he said more, but I couldnt make it\n&gt; &gt; out---gotta get the tape recorder running.\n&gt; &gt; \n&gt; &gt; The picture of Tom&#39;s Toob should be in my album. My omly problem is that I\n&gt; &gt; might need to speed the scan up just a bit. It there a capacitor or resistor I\n&gt; &gt; can add to do this?\n&gt; &gt; \n&gt; &gt; I like the fact that the pipe is easy to carry in one hand or on my shoulder. I\n&gt; &gt; was inspired to use a pipe to house the components by a recent episode of &quot;Ghost\n&gt; &gt; adventures&quot;--they only had a radio in theirs though.\n&gt; &gt;\n&gt;"}