{"id": "16632", "subject": "Re: Franks box", "author": "Tom", "timestamp": "2010-01-23T17:20:27Z", "full_text": "In my personal opinion Franks box is simply a random noise source that generates a wide frequency band of raw sound that the spirits can modulate into understandable voices.  Not unlike the trick of putting a buzzing electric razor to one&#39;s lips and mothing words, or the principle of the &#39;artificial larynix&quot; that people without vocal cords put to their throats.\n\nFranks box generates sound waves in the human vocal waveform and frequency range that the spirits can use to make voices of their own.  Frank uses, primarily a hacked radio (or a home built equivalent)and, I think, a white noise source and a hollow box resonator to mix the noises and give the spirits a place to modulate the sounds.\n\n  The resonator sorta takes the &quot;edge&quot; off discrete &quot;radio words and smoothly mixes MORE random noise frequencies from the noise generator to futher open up more frequencies to the entities to use.\n\nMY opinion is that we need simply strive to provide the spirits with the OPTIMUM noise of this type so that their sound manipulation techniques can be most effective.  In MY case I use a hacked 587 radio, a battery powered &quot;sleep sounds&quot; noise generator (white and pink noises)\nand cut two side by side slots on the side and near the center an open ended PVC pipe (2inch ID by 24 inches long)  The radio and noise generator fit snugly in the custom slots, speaker end down (inside the tune) and the controls accesable outside.  Record the sound from one of the open pipe ends.  Its a GREAT mixer/resonator and I have got some good clear stuff already (see &quot;tom&#39;s tube&quot; folder in the files) \n\nI would suggest you build a similar set up to Franks box OR Tom&#39;s tube and try to impvove them based on the operating theory of your choice.  This is not a competition, but ongoing experimentation to inprove contact between the human and spirit realms.\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;Michael&quot; &lt;smellytoolman@...&gt; wrote:\n&gt;\n&gt; New to ghost hunting.  I have actually gotten involved with a group who does this now.  We have captured a few EVP&#39;s and it&#39;s just insane when you first hear them.   I came across some directions for building a Frank&#39;s box, and was wondering 1)how well do they work?  2)does anybody have a full parts list of what I would need to build one?   I don&#39;t want to do just the hacked radio shack version.   I would rather build my own from scratch.   Just curious though.  Any help would be appreciated.\n&gt;"}