{"id": "16636", "subject": "Re: [EVP-ITC] Re: Medium---well!", "author": "shipsdrummer@aol.com", "timestamp": "2010-01-24T19:03:01Z", "full_text": "--part1_3ee89.277aba4f.388df365_boundary\r\nContent-Type: text/plain; charset=&quot;US-ASCII&quot;\r\nContent-Transfer-Encoding: 7bit\r\n\r\n \nHello,\nI have been listening in and watching some of your videos. My name is San. \nI think once the spirits know that you are open for business, that they \nbegin to know who you are and come to you. I can see many spirits on the ghost \nshows before the TV folks do. I get headaches and pains where the bullets \nwent in around the same time that the other mediums on the shows do. Its a \nmatter of intent, spiritual intent. You are letting them know that you are one \nthat will listen and then they begin to show up. But it takes awhile for them \nto tune to your mind frequently but once they get used to it I guess it \nwill just happen. \nSan\n \nTom_Ray@... writes:\n\nThe random sounds make it easier to hear spirit voices in your head. I \ndiscovered this effect VISUALLY staining at rsndom dots on a viewing screen. In \nthe visual mode the spirit only has to suppress the light spots and enhance \nthe dark spots that do not match the image it is sending----Light and dark \nspots on the screen that correspond to the image dont have to be modulated at \nall---the result is a SAVING of &quot;psychic energy&quot; on the observers part, \nperhaps not much, but enough to make the difference between seeing and NOT \nseeing, however. Random sound would work the same way only the frequencies that \ndid not match the sounds being sent would have to be blocked or replaced, \nthe frequencies already present would NOT have to be modulated--so SOME energy \nis saved and not as much effort is needed to hear the entity. Effectively \nenhancing one&#39;s innate abilities. It a lot easier to hear a spirit sound if \nsome of the waves are already in place, than it would be if you had to build \nthe entire word from scratch.\n\n--- In _EVP-ITC@yahoogroupsEVP-_ (mailto:EVP-ITC@yahoogroups.com) , &quot;Jill&quot; \n&lt;jjkamp@...&gt; wrote:\n&gt;\n&gt; That doesn&#39;t surprise me at all. I wish someone could figure out why \nusing the box enhances one&#39;s abilities as a medium, but apparently this is so -- \nI know it was true for me. As much experience as you have, Frank, it would \nseem to follow you&#39;d have built up some considerable ability.\n&gt; \n&gt; \n&gt; \n&gt; --- In _EVP-ITC@yahoogroupsEVP-_ (mailto:EVP-ITC@yahoogroups.com) , Frank \nSumption &lt;purplealiengirl@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Went to the medium development class last night and OMG! Suprised \nmyselff,\n&gt; &gt; had no idea I could get visions on demand like that. I am uncertain if \nit\n&gt; &gt; was due to being in a group with those expectations though. I&#39;ve never\n&gt; &gt; attempted to read for anyone before, always seems kinda presumptuous to \nme.\n&gt; &gt; They do a circle for exchanging messages the third Friday of the month.\n&gt; &gt; \n&gt; &gt; Frank-S\n\n\r\n--part1_3ee89.277aba4f.388df365_boundary\r\nContent-Type: text/html; charset=&quot;US-ASCII&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;HTML&gt;&lt;HEAD&gt;\n&lt;META charset=3DUS-ASCII http-equiv=3DContent-Type content=3D&quot;=\r\ntext/html; charset=3DUS-ASCII&quot;&gt;\n&lt;META content=3D&quot;MSHTML 6.00.2900.5921&quot; nam=\r\ne=3DGENERATOR&gt;&lt;/HEAD&gt;\n&lt;BODY style=3D&quot;FONT-SIZE: 12pt; FONT-FAMILY: Arial; B=\r\nACKGROUND-COLOR: #ffffff&quot;&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3D&quot;Palatino Linotype&quot; colo=\r\nr=3D#010101&gt;Hello,&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3D&quot;Palatino Linotype&quot; color=\r\n=3D#010101&gt;I have been listening in and watching some of&nbsp;your videos. =\r\nMy name is San. I think once the spirits know that you are open for busines=\r\ns, that they begin to know who you are and come to you. I can see many spir=\r\nits on the ghost shows before the TV folks do. I get headaches and pains wh=\r\nere the bullets went in around the same time that the other mediums on the =\r\nshows do. Its a matter of intent, spiritual intent. You are letting them kn=\r\now that you are one that will listen and then they begin to show up. But it=\r\n takes awhile for them to tune to your mind frequently but once they get us=\r\ned to it I guess it will just happen. &lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3D&quot;Pala=\r\ntino Linotype&quot; color=3D#010101&gt;San&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3D&quot;Palatino=\r\n Linotype&quot; color=3D#010101&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Tom_Ray@...=\r\n writes:&lt;/DIV&gt;\n&lt;BLOCKQUOTE style=3D&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BO=\r\nRDER-LEFT: blue 2px solid&quot;&gt;&lt;FONT size=3D2&gt;The random sounds make it easier =\r\nto hear spirit voices in your head. I discovered this effect VISUALLY stain=\r\ning at rsndom dots on a viewing screen. In the visual mode the spirit only =\r\nhas to suppress the light spots and enhance the dark spots that do not matc=\r\nh the image it is sending----Light and dark spots on the screen that corres=\r\npond to the image dont have to be modulated at all---the result is a SAVING=\r\n of &quot;psychic energy&quot; on the observers part, perhaps not much, but enough to=\r\n make the difference between seeing and NOT seeing, however. Random sound w=\r\nould work the same way only the frequencies that did not match the sounds b=\r\neing sent would have to be blocked or replaced, the frequencies already pre=\r\nsent would NOT have to be modulated--so SOME energy is saved and not as muc=\r\nh effort is needed to hear the entity. Effectively enhancing one&#39;s innate a=\r\nbilities. It a lot easier to hear a spirit sound if some of the waves are a=\r\nlready in place, than it would be if you had to build the entire word from =\r\nscratch.&lt;BR&gt;&lt;BR&gt;--- In &lt;/FONT&gt;&lt;A title=3Dmailto:EVP-ITC@yahoogroups.com hre=\r\nf=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;&lt;FONT size=3D2&gt;EVP-ITC@yahoogroups&lt;W=\r\nBR&gt;.com&lt;/FONT&gt;&lt;/A&gt;&lt;FONT size=3D2&gt;, &quot;Jill&quot; &lt;jjkamp@...&gt; wrote:&lt;BR&gt;&gt;=\r\n&lt;BR&gt;&gt; That doesn&#39;t surprise me at all. I wish someone could figure out w=\r\nhy using the box enhances one&#39;s abilities as a medium, but apparently this =\r\nis so -- I know it was true for me. As much experience as you have, Frank, =\r\nit would seem to follow you&#39;d have built up some considerable ability.&lt;BR&gt;&=\r\ngt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; --- In &lt;/FONT&gt;&lt;A title=3Dmailto:EVP-ITC@yaho=\r\nogroups.com href=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;&lt;FONT size=3D2&gt;EVP-IT=\r\nC@yahoogroups&lt;WBR&gt;.com&lt;/FONT&gt;&lt;/A&gt;&lt;FONT size=3D2&gt;, Frank Sumption &lt;purple=\r\naliengirl@&lt;WBR&gt;&gt; wrote:&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt; Went to the medium dev=\r\nelopment class last night and OMG! Suprised myselff,&lt;BR&gt;&gt; &gt; had no id=\r\nea I could get visions on demand like that. I am uncertain if it&lt;BR&gt;&gt; &g=\r\nt; was due to being in a group with those expectations though. I&#39;ve never&lt;B=\r\nR&gt;&gt; &gt; attempted to read for anyone before, always seems kinda presump=\r\ntuous to me.&lt;BR&gt;&gt; &gt; They do a circle for exchanging messages the thir=\r\nd Friday of the month.&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; Frank-S&lt;/FONT&gt;&lt;/BLOCKQUOT=\r\nE&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3D&quot;Palatino Linotype&quot; color=3D#010101&gt;&lt;/FONT&gt;&lt;/DIV=\r\n&gt;&lt;/BODY&gt;&lt;/HTML&gt;\n\r\n--part1_3ee89.277aba4f.388df365_boundary--"}