{"id": "16631", "subject": "Re: Medium---well!", "author": "Tom", "timestamp": "2010-01-24T01:54:24Z", "full_text": "The random sounds make it easier to hear spirit voices in your head.  I discovered this effect VISUALLY staining at rsndom dots on a viewing screen.   In the visual mode the spirit only has to suppress the light spots and enhance the dark spots that do not match the image it is sending----Light and dark spots on the screen that correspond to the image dont have to be modulated at all---the result is a SAVING of &quot;psychic energy&quot; on the observers part, perhaps not much, but enough to make the difference between seeing and NOT seeing, however.   Random sound would work the same way only the frequencies that did not match the sounds being sent would have to be blocked or replaced, the frequencies already present would NOT have to be modulated--so SOME energy is saved and not as much effort is needed to hear the entity.  Effectively enhancing one&#39;s innate abilities.  It a lot easier to hear a spirit sound if some of the waves are already in place, than it would be if you had to build the entire word from scratch.\n\n--- In EVP-ITC@yahoogroups.com, &quot;Jill&quot; &lt;jjkamp@...&gt; wrote:\n&gt;\n&gt; That doesn&#39;t surprise me at all.  I wish someone could figure out why using the box enhances one&#39;s abilities as a medium, but apparently this is so -- I know it was true for me.  As much experience as you have, Frank, it would seem to follow you&#39;d have built up some considerable ability.\n&gt; \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@&gt; wrote:\n&gt; &gt;\n&gt; &gt;  Went to the medium development class last night and OMG! Suprised myselff,\n&gt; &gt; had no idea I could get visions on demand like that. I am uncertain if it\n&gt; &gt; was due to being in a group with those expectations though. I&#39;ve never\n&gt; &gt; attempted to read for anyone before, always seems kinda presumptuous to me.\n&gt; &gt; They do a circle for exchanging messages the third Friday of the month.\n&gt; &gt; \n&gt; &gt;  Frank-S\n&gt; &gt;\n&gt;"}