{"id": "16639", "subject": "Re: Medium---well!", "author": "Jill", "timestamp": "2010-01-24T23:43:19Z", "full_text": "I agree, I do think you attract entities more because they know you are &quot;open for business.&quot;  However, along with some people I didn&#39;t know, I also had communication from those I did, and who had clearly been with me all along:  my dad, etc.  Before using the ghost box, my mom and I would experience phenomena around the house such as the tv being turned on, the gps suddenly turning on by itself and talking, a bottle of my dad&#39;s booze being knocked over and broken.  After the ghost box, all that stopped, and instead, every morning after a ghost box session, I would get an image like a still photograph put into my mind the very first thing upon waking up.  My grandparents, my dad, my uncle, even my distant ancestors I&#39;d never met, all of them were shown to me like they were at the age they were the most vibrant (before I was born), and always in a pose wearing clothes that didn&#39;t match any photos.  During the dry spells when I haven&#39;t used the box for months, no photos in my head.  \n\nSo I would definitely say somehow the box can enhance psychic ability.  I just would like to know HOW!\n\n\n\n--- In EVP-ITC@yahoogroups.com, shipsdrummer@... wrote:\n&gt;\n&gt;  \n&gt; Hello,\n&gt; I have been listening in and watching some of your videos. My name is San. \n&gt; I think once the spirits know that you are open for business, that they \n&gt; begin to know who you are and come to you. I can see many spirits on the ghost \n&gt; shows before the TV folks do. I get headaches and pains where the bullets \n&gt; went in around the same time that the other mediums on the shows do. Its a \n&gt; matter of intent, spiritual intent. You are letting them know that you are one \n&gt; that will listen and then they begin to show up. But it takes awhile for them \n&gt; to tune to your mind frequently but once they get used to it I guess it \n&gt; will just happen. \n&gt; San\n&gt;  \n&gt; Tom_Ray@... writes:\n&gt; \n&gt; The random sounds make it easier to hear spirit voices in your head. I \n&gt; discovered this effect VISUALLY staining at rsndom dots on a viewing screen. In \n&gt; the visual mode the spirit only has to suppress the light spots and enhance \n&gt; the dark spots that do not match the image it is sending----Light and dark \n&gt; spots on the screen that correspond to the image dont have to be modulated at \n&gt; all---the result is a SAVING of &quot;psychic energy&quot; on the observers part, \n&gt; perhaps not much, but enough to make the difference between seeing and NOT \n&gt; seeing, however. Random sound would work the same way only the frequencies that \n&gt; did not match the sounds being sent would have to be blocked or replaced, \n&gt; the frequencies already present would NOT have to be modulated--so SOME energy \n&gt; is saved and not as much effort is needed to hear the entity. Effectively \n&gt; enhancing one&#39;s innate abilities. It a lot easier to hear a spirit sound if \n&gt; some of the waves are already in place, than it would be if you had to build \n&gt; the entire word from scratch.\n&gt; \n&gt; --- In _EVP-ITC@yahoogroupsEVP-_ (mailto:EVP-ITC@yahoogroups.com) , &quot;Jill&quot; \n&gt; &lt;jjkamp@&gt; wrote:\n&gt; &gt;\n&gt; &gt; That doesn&#39;t surprise me at all. I wish someone could figure out why \n&gt; using the box enhances one&#39;s abilities as a medium, but apparently this is so -- \n&gt; I know it was true for me. As much experience as you have, Frank, it would \n&gt; seem to follow you&#39;d have built up some considerable ability.\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; --- In _EVP-ITC@yahoogroupsEVP-_ (mailto:EVP-ITC@yahoogroups.com) , Frank \n&gt; Sumption &lt;purplealiengirl@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; Went to the medium development class last night and OMG! Suprised \n&gt; myselff,\n&gt; &gt; &gt; had no idea I could get visions on demand like that. I am uncertain if \n&gt; it\n&gt; &gt; &gt; was due to being in a group with those expectations though. I&#39;ve never\n&gt; &gt; &gt; attempted to read for anyone before, always seems kinda presumptuous to \n&gt; me.\n&gt; &gt; &gt; They do a circle for exchanging messages the third Friday of the month.\n&gt; &gt; &gt; \n&gt; &gt; &gt; Frank-S\n&gt;"}