{"id": "16642", "subject": "Re: [EVP-ITC] Re: Disturbing clip---Lost souls?", "author": "Kim Sharples", "timestamp": "2010-01-25T00:55:11Z", "full_text": "I hear Help Me and the Amelia....\nthe Help me sounds evil....\nthe Amelia sounds like a woman very afraid or distraught.\n\nKim\n\nOn Sun, Jan 24, 2010 at 2:00 PM, Tom &lt;Tom_Ray@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; GOT IT UP!--Tom&#39;s Tube File folder &#39;helpAmelia&quot;\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, &quot;Tom&quot;\n&gt; &lt;Tom_Ray@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; My session yesterday yeilded disturbing (to me)clip. A man with a\n&gt; &quot;country accent&quot; repeats &quot;Help me Jesus, help me je--&quot; and is interrupted by\n&gt; a mournful woman shouting out the name &quot;Amelia!&quot;\n&gt; &gt;\n&gt; &gt; Did I tap into some sort of &quot;lower realm&quot; or were these perhaps lost or\n&gt; confused souls calling out. Something I didnt really expect.\n&gt; &gt;\n&gt; &gt; I have been trying to upload the file into my TOM&#39;S TUBE folder for a\n&gt; while this morning but it blinks out before it loads when I press the upload\n&gt; button---I think that this might just be a tempory connection glitch, so I\n&gt; will upload it later.\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nI hea Help Me and he Amelia.... he Help me sounds e il.... he Amelia sounds like a woman e y a aid o dis augh .KimOn Sun, Jan 24, 2010 a 2:00 PM, Tom Tom_Ray@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n GOT IT UP!--Tom's Tube File olde 'helpAmelia\"\n\n--- In EVP-ITC@yahoog oups.com, \"Tom\" w o e:\n>\n> My session yes e day yeilded dis u bing ( o me)clip. A man wi h a \"coun y accen \" epea s \"Help me Jesus, help me je--\" and is in e up ed by a mou n ul woman shou ing ou he name \"Amelia!\"\n\n> \n> Did I ap in o some so o \"lowe ealm\" o we e hese pe haps los o con used souls calling ou . Some hing I didn eally expec .\n> \n> I ha e been ying o upload he ile in o my TOM'S TUBE olde o a while his mo ning bu i blinks ou be o e i loads when I p ess he upload bu on---I hink ha his migh jus be a empo y connec ion gli ch, so I will upload i la e .\n\n>"}