{"id": "16647", "subject": "Re: Medium---well!", "author": "Tom", "timestamp": "2010-01-25T03:09:08Z", "full_text": "I beleive we are ALL psychic too, but for most of us, we need a little bit of help to boost our latent abilities to useful levels.  We can use &quot;Psychic levers&quot; to do this such as idomoter response devices (the Ouija board and the deChevrul pendulum for example) Synchronicity generators (e.g. Tarrot cards, I Ching) Ganzfields (crystal balls,Ink pools white walls) and vidio or audio random fields\n(Ghost box, random field screen)\n\n--- In EVP-ITC@yahoogroups.com, &quot;Tim&quot; &lt;sir_tim1@...&gt; wrote:\n&gt;\n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Debra Yeung &lt;debra.yeung@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Try this option out for size.\n&gt; &gt; \n&gt; &gt; The Box clearly is a translator/tuner for the entities, to speak to you.\n&gt; &gt; Obviously you are able to &#39;understand&#39; or &#39;translate&#39; what the box says. \n&gt; &gt; When you hear the entities speak to you.\n&gt; &gt;   It would follow, that there is some kind of tuning in going on, after \n&gt; &gt; all.\n&gt; &gt; And it also seems to me that maybe you are also &#39;tuning&#39; in psychically \n&gt; &gt; while using the box, just its subtle.\n&gt; &gt; \n&gt; &gt; I gather that unless prompted people may occasionally hear/perceive \n&gt; &gt; different things, there was a thread to that effect not too long ago.\n&gt; &gt; \n&gt; &gt; Well thats my two cents worth, but Franks congrats, its an exciting \n&gt; &gt; time.  Enjoy! and keep us in the loop.\n&gt; &gt; Deb\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; On 1/24/2010 6:31 PM, Jill wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; I think you have a reasonable theory, and I like it. Except what I was \n&gt; &gt; &gt; referring to was the way using the box makes you suddenly more able to \n&gt; &gt; &gt; have psychic abilities, e.g. having more dreams that are &quot;visitations&quot; \n&gt; &gt; &gt; from the dead, or being more able to know right before your best \n&gt; &gt; &gt; friend is going to phone you, stuff like that. Psychic abilities. Why \n&gt; &gt; &gt; should using the box make stuff like that happen more easily? Because \n&gt; &gt; &gt; it does, and it&#39;s weird!\n&gt; &gt; &gt;\n&gt; &gt;\n&gt; i think we are all psychic but we do not use our abilities because we are all caught up with the physical world and and our other daily lives, the box helps us focus our psychic abilities and produces results. the box is just a tool for psychic development i think.\n&gt;"}