{"id": "16656", "subject": "Re: [EVP-ITC] Re: Medium---well!", "author": "Zack Widup", "timestamp": "2010-01-25T18:26:07Z", "full_text": "ITC is different from EVP. Many people just let an audio recorder run to\nmonitor the output of the box to record whatever may show up. And they do\nshow up.\n\nZack\n\nOn Mon, Jan 25, 2010 at 11:56 AM, &lt;shipsdrummer@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;  Just adding: thats exactly how it works. When we contact a spirit or see\n&gt; one they wont talk &quot;unless&quot; a question is asked. Then they will speak or\n&gt; send a picture or noise or whatever.\n&gt; Talking to spirits is a series of questions. One you notice that you have\n&gt; the ability, then people just look at it awhile, then it hits them to ask\n&gt; questions and then they find that the spirits answer things too. :) The box\n&gt; is a tool to bring the conversations on the outside of your head. Its a big\n&gt; deal. How did this first get thought of, Frank? How did Frank get the idea\n&gt; to ask it questions? That is what mediumship is all about.\n&gt;\n&gt; My son has built one of the boxes. I am trying to get him on here because\n&gt; he will do the work for me of building them. I help a little from having 6\n&gt; months of electronics too. This is really going to go far. This is a brave\n&gt; new adventure and I am happy to be here.\n&gt; Thank you\n&gt; San\n&gt;\n&gt;\n&gt; Tom_Ray@... writes:\n&gt;\n&gt; Well, I consider myself a &quot;Psychic&quot; too I use a &quot;monitor Technique not\n&gt; unlike the CIA was said to employ (I discovered it on my own and later read\n&gt; that the CIA was using a similar method) I use a &quot;monitor&quot; or person to ask\n&gt; questions and I find I can reply psychically It involves not using the\n&gt; &quot;questioning/judgemental&quot; part of my brain and staying in the &quot;declaritive\n&gt; mode&quot;--somehow THAT holds the psychic &quot;conduit&quot; open and I can function as a\n&gt; medium. The monitor person asks the questions and the replies come. Should I\n&gt; ask the question myself, however, the conduit shuts. It IS interesting\n&gt; though, I can ask questions indirectly, staying in declaritive mode, by\n&gt; saying to my monitor something like &quot;ask me to look at the flag or ask me\n&gt; what color is his coat---The monitor asks and THEN I get my answer--I stay\n&gt; concious, but with a slight &quot;buzz&quot; and often the info does not go to my long\n&gt; term mem ory.\n&gt;\n&gt; My suggestions on how the boxes work are based on my own years of\n&gt; experience with random viewing fields. once it became obvious how THEY\n&gt; worked, it was a simple thing to see the correspondence with audio factor in\n&gt; boxes. One thing the boxes have taught me, however, is that it is NOT &quot;all\n&gt; in the head&quot; as these sound files can be shared with others.---This is\n&gt; making me rethink that my VIDEO random feild stuff may also not be &quot;in the\n&gt; head, and perhaps may be captured on imagery.\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Frank Sumption\n&gt; &lt;purplealiengirl@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; You&#39;re making alot of presumptuous statements that have no basis in fact.\n&gt; &gt; You&#39;re just jealous cuz you can&#39;t hear the boxes. I don&#39;t need any noise\n&gt; to\n&gt; &gt; hear spirits, and I do just fine seeing through the third eye. It&#39;s just\n&gt; &gt; that same old skeptic BS that it&#39;s all in the brain.\n&gt; &gt;\n&gt; &gt; F-S\n&gt; &gt;\n&gt; &gt; On Sat, Jan 23, 2010 at 6:54 PM, Tom &lt;Tom_Ray@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; The random sounds make it easier to hear spirit voices in your head. I\n&gt; &gt; &gt; discovered this effect VISUALLY staining at rsndom dots on a viewing\n&gt; screen.\n&gt; &gt; &gt; In the visual mode the spirit only has to suppress the light spots and\n&gt; &gt; &gt; enhance the dark spots that do not match the image it is\n&gt; sending----Light\n&gt; &gt; &gt; and dark spots on the screen that correspond to the image dont have to\n&gt; be\n&gt; &gt; &gt; modulated at all---the result is a SAVING of &quot;psychic energy&quot; on the\n&gt; &gt; &gt; observers part, perhaps not much, but enough to make the difference\n&gt; between\n&gt; &gt; &gt; seeing and NOT seeing, however. Random sound would work the same way\n&gt; only\n&gt; &gt; &gt; the frequencies that did not match the sounds being sent would have to\n&gt; be\n&gt; &gt; &gt; blocked or replaced, the frequencies already present would NOT have to\n&gt; be\n&gt; &gt; &gt; modulated--so SOME energy is saved and not as much effort is needed to\n&gt; hear\n&gt; &gt; &gt; the entity. Effectively enhancing one&#39;s innate abilities. It a lot\n&gt; easier to\n&gt; &gt; &gt; hear a spirit sound if some of the waves are already in place, than it\n&gt; would\n&gt; &gt; &gt; be if you had to build the entire word from scratch.\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt; &lt;EVP-ITC%\n&gt; 40yahoogroups.com&gt;, &quot;Jill&quot;\n&gt; &gt; &gt; &lt;jjkamp@&gt; wrote:\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; That doesn&#39;t surprise me at all. I wish someone could figure out why\n&gt; &gt; &gt; using the box enhances one&#39;s abilities as a medium, but apparently this\n&gt; is\n&gt; &gt; &gt; so -- I know it was true for me. As much experience as you have, Frank,\n&gt; it\n&gt; &gt; &gt; would seem to follow you&#39;d have built up some considerable ability.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt; &lt;EVP-ITC%\n&gt; 40yahoogroups.com&gt;, Frank\n&gt; &gt; &gt; Sumption &lt;purplealiengirl@&gt; wrote:\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; Went to the medium development class last night and OMG! Suprised\n&gt; &gt; &gt; myselff,\n&gt; &gt; &gt; &gt; &gt; had no idea I could get visions on demand like that. I am uncertain\n&gt; if\n&gt; &gt; &gt; it\n&gt; &gt; &gt; &gt; &gt; was due to being in a group with those expectations though. I&#39;ve\n&gt; never\n&gt; &gt; &gt; &gt; &gt; attempted to read for anyone before, always seems kinda\n&gt; presumptuous to\n&gt; &gt; &gt; me.\n&gt; &gt; &gt; &gt; &gt; They do a circle for exchanging messages the third Friday of the\n&gt; month.\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; Frank-S\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nITC is di e en om EVP. Many people jus le an audio eco de un o moni o he ou pu o he box o eco d wha e e may show up. And hey do show up.\n \nZack\nOn Mon, Jan 25, 2010 a 11:56 AM, shipsd umme @...> w o e:\n\n  \n\n\n\n\n\nJus adding: ha s exac ly how i wo ks. When we con ac a spi i o see one hey won alk \"unless\" a ques ion is asked. Then hey will speak o send a pic u e o noise o wha e e .\n\nTalking o spi i s is a se ies o ques ions. One you no ice ha you ha e he abili y, hen people jus look a i awhile, hen i hi s hem o ask ques ions and hen hey ind ha he spi i s answe hings oo. :) The box is a ool o b ing he con e sa ions on he ou side o you head. I s a big deal. How did his i s ge hough o , F ank? How did F ank ge he idea o ask i ques ions? Tha is wha mediumship is all abou .\n\n \nMy son has buil one o he boxes. I am ying o ge him on he e because he will do he wo k o me o building hem. I help a li le om ha ing 6 mon hs o elec onics oo. This is eally going o go a . This is a b a e new ad en u e and I am happy o be he e. \n\nThank you\nSan\n\n\n\n \n \nTom_Ray@....ms.us w i es:\nWell, I conside mysel a \"Psychic\" oo I use a \"moni o Technique no unlike he CIA was said o employ (I disco e ed i on my own and la e ead ha he CIA was using a simila me hod) I use a \"moni o \" o pe son o ask ques ions and I ind I can eply psychically I in ol es no using he \"ques ioning/judgemen al\" pa o my b ain and s aying in he \"decla i i e mode\"--somehow THAT holds he psychic \"condui \" open and I can unc ion as a medium. The moni o pe son asks he ques ions and he eplies come. Should I ask he ques ion mysel , howe e , he condui shu s. I IS in e es ing hough, I can ask ques ions indi ec ly, s aying in decla i i e mode, by saying o my moni o some hing like \"ask me o look a he lag o ask me wha colo is his coa ---The moni o asks and THEN I ge my answe --I s ay concious, bu wi h a sligh \"buzz\" and o en he in o does no go o my long e m mem o y. \nMy sugges ions on how he boxes wo k a e based on my own yea s o expe ience wi h andom iewing ields. once i became ob ious how THEY wo ked, i was a simple hing o see he co espondence wi h audio ac o in boxes. One hing he boxes ha e augh me, howe e , is ha i is NOT \"all in he head\" as hese sound iles can be sha ed wi h o he s.---This is making me e hink ha my VIDEO andom eild s u may also no be \"in he head, and pe haps may be cap u ed on image y. \n--- In EVP-ITC@yahoog oups.com, F ank Sump ion w o e:\n>> You' e making alo o p esump uous s a emen s ha ha e no basis in ac .> You' e jus jealous cuz you can' hea he boxes. I don' need any noise o> hea spi i s, and I do jus ine seeing h ough he hi d eye. I 's jus \n> ha same old skep ic BS ha i 's all in he b ain.> > F-S> > On Sa , Jan 23, 2010 a 6:54 PM, Tom w o e:> > >> >> > The andom sounds make i easie o hea spi i oices in you head. I\n> > disco e ed his e ec VISUALLY s aining a sndom do s on a iewing sc een.> > In he isual mode he spi i only has o supp ess he ligh spo s and> > enhance he da k spo s ha do no ma ch he image i is sending----Ligh \n> > and da k spo s on he sc een ha co espond o he image don ha e o be> > modula ed a all--- he esul is a SAVING o \"psychic ene gy\" on he> > obse e s pa , pe haps no much, bu enough o make he di e ence be ween\n> > seeing and NOT seeing, howe e . Random sound would wo k he same way only> > he equencies ha did no ma ch he sounds being sen would ha e o be> > blocked o eplaced, he equencies al eady p esen would NOT ha e o be\n> > modula ed--so SOME ene gy is sa ed and no as much e o is needed o hea > > he en i y. E ec i ely enhancing one's inna e abili ies. I a lo easie o> > hea a spi i sound i some o he wa es a e al eady in place, han i would\n> > be i you had o build he en i e wo d om sc a ch.> >> >> > --- In EVP-ITC@yahoog oups.com 40yahoog oups.com>, \"Jill\"\n> > w o e:> > >> > > Tha doesn' su p ise me a all. I wish someone could igu e ou why> > using he box enhances one's abili ies as a medium, bu appa en ly his is\n> > so -- I know i was ue o me. As much expe ience as you ha e, F ank, i > > would seem o ollow you'd ha e buil up some conside able abili y.> > >> > >> > >\n> > > --- In EVP-ITC@yahoog oups.com 40yahoog oups.com>, F ank\n> > Sump ion w o e:> > > >> > > > Wen o he medium de elopmen class las nigh and OMG! Sup ised> > mysel ,> > > > had no idea I could ge isions on demand like ha . I am unce ain i \n> > i > > > > was due o being in a g oup wi h hose expec a ions hough. I' e ne e > > > > a emp ed o ead o anyone be o e, always seems kinda p esump uous o> > me.\n> > > > They do a ci cle o exchanging messages he hi d F iday o he mon h.> > > >> > > > F ank-S> > > >> > >> >> > > >\n>"}