{"id": "16658", "subject": "Re: Medium---well!", "author": "Tom", "timestamp": "2010-01-25T19:15:00Z", "full_text": "Now THATS an angle I have not thought of  the box making my &quot;Medium Messages&quot; REAL  WOW!  Just when I was speculating that the VISUAL random field viewing screen could be doing the same thing--as I noted in a previous post, I could see the same image my sister claimed to see.   I was thinking to see if those images could be photographed.---and we might already be doing the same thing HERE in taping ghost box messages.\n\n--- In EVP-ITC@yahoogroups.com, shipsdrummer@... wrote:\n&gt;\n&gt;  \n&gt; Just adding: thats exactly how it works. When we contact a spirit or see \n&gt; one they wont talk &quot;unless&quot; a question is asked. Then they will speak or send \n&gt; a picture or noise or whatever.\n&gt; Talking to spirits is a series of questions. One you notice that you have \n&gt; the ability, then people just look at it awhile, then it hits them to ask \n&gt; questions and then they find that the spirits answer things too. :) The box is \n&gt; a tool to bring the conversations on the outside of your head. Its a big \n&gt; deal. How did this first get thought of, Frank? How did Frank get the idea to \n&gt; ask it questions? That is what mediumship is all about.\n&gt;  \n&gt; My son has built one of the boxes. I am trying to get him on here because \n&gt; he will do the work for me of building them. I help a little from having 6 \n&gt; months of electronics too. This is really going to go far. This is a brave new \n&gt; adventure and I am happy to be here. \n&gt; Thank you\n&gt; San\n&gt;  \n&gt;  \n&gt; Tom_Ray@... writes:\n&gt; \n&gt; Well, I consider myself a &quot;Psychic&quot; too I use a &quot;monitor Technique not \n&gt; unlike the CIA was said to employ (I discovered it on my own and later read that \n&gt; the CIA was using a similar method) I use a &quot;monitor&quot; or person to ask \n&gt; questions and I find I can reply psychically It involves not using the \n&gt; &quot;questioning/Well, I consider myself a &quot;Psychic&quot; too I use a &quot;monitor Technique not \n&gt; unlike the CIA was said to employ (I discovered it on my own and later read \n&gt; that the CIA was using a similar method) I use a &quot;monitor&quot; or person to ask \n&gt; questions and I find I can reply psychically It involves not using the \n&gt; &quot;questioning/&lt;WBR&gt;judgemental&quot; part of my brain and staying in the &quot;declaritive \n&gt; mode&quot;--somehow THAT holds the psychic &quot;conduit&quot; open and I can function as a \n&gt; medium. The monitor person asks the questions and the replies come. Should I \n&gt; ask the question myself, however, the conduit shuts. It IS interesting \n&gt; \n&gt; My suggestions on how the boxes work are based on my own years of \n&gt; experience with random viewing fields. once it became obvious how THEY worked, it was \n&gt; a simple thing to see the correspondence with audio factor in boxes. One \n&gt; thing the boxes have taught me, however, is that it is NOT &quot;all in the head&quot; \n&gt; as these sound files can be shared with others.---This is making me rethink \n&gt; that my VIDEO random feild stuff may also not be &quot;in the head, and perhaps \n&gt; may be captured on imagery. \n&gt; \n&gt; --- In _EVP-ITC@yahoogroupsEVP-_ (mailto:EVP-ITC@yahoogroups.com) , Frank \n&gt; Sumption &lt;purplealiengirl@pur&gt; wrote:\n&gt; &gt;\n&gt; &gt; You&#39;re making alot of presumptuous statements that have no basis in fact.\n&gt; &gt; You&#39;re just jealous cuz you can&#39;t hear the boxes. I don&#39;t need any noise \n&gt; to\n&gt; &gt; hear spirits, and I do just fine seeing through the third eye. It&#39;s just\n&gt; &gt; that same old skeptic BS that it&#39;s all in the brain.\n&gt; &gt; \n&gt; &gt; F-S\n&gt; &gt; \n&gt; &gt; On Sat, Jan 23, 2010 at 6:54 PM, Tom &lt;Tom_Ray@&gt; wrote:\n&gt; &gt; \n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; The random sounds make it easier to hear spirit voices in your head. I\n&gt; &gt; &gt; discovered this effect VISUALLY staining at rsndom dots on a viewing \n&gt; screen.\n&gt; &gt; &gt; In the visual mode the spirit only has to suppress the light spots and\n&gt; &gt; &gt; enhance the dark spots that do not match the image it is \n&gt; sending----Light\n&gt; &gt; &gt; and dark spots on the screen that correspond to the image dont have to \n&gt; be\n&gt; &gt; &gt; modulated at all---the result is a SAVING of &quot;psychic energy&quot; on the\n&gt; &gt; &gt; observers part, perhaps not much, but enough to make the difference \n&gt; between\n&gt; &gt; &gt; seeing and NOT seeing, however. Random sound would work the same way \n&gt; only\n&gt; &gt; &gt; the frequencies that did not match the sounds being sent would have to \n&gt; be\n&gt; &gt; &gt; blocked or replaced, the frequencies already present would NOT have to \n&gt; be\n&gt; &gt; &gt; modulated--so SOME energy is saved and not as much effort is needed to \n&gt; hear\n&gt; &gt; &gt; the entity. Effectively enhancing one&#39;s innate abilities. It a lot \n&gt; easier to\n&gt; &gt; &gt; hear a spirit sound if some of the waves are already in place, than it \n&gt; would\n&gt; &gt; &gt; be if you had to build the entire word from scratch.\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; --- In _EVP-ITC@yahoogroupsEVP-_ (mailto:EVP-ITC@yahoogroups.com)  \n&gt; &lt;EVP-ITC%40yahoogroEVP-ITC&gt;, &quot;Jill&quot;\n&gt; &gt; &gt; &lt;jjkamp@&gt; wrote:\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; That doesn&#39;t surprise me at all. I wish someone could figure out why\n&gt; &gt; &gt; using the box enhances one&#39;s abilities as a medium, but apparently this \n&gt; is\n&gt; &gt; &gt; so -- I know it was true for me. As much experience as you have, Frank, \n&gt; it\n&gt; &gt; &gt; would seem to follow you&#39;d have built up some considerable ability.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; --- In _EVP-ITC@yahoogroupsEVP-_ (mailto:EVP-ITC@yahoogroups.com)  \n&gt; &lt;EVP-ITC%40yahoogroEVP-ITC&gt;, Frank\n&gt; &gt; &gt; Sumption &lt;purplealiengirl@&gt; wrote:\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; Went to the medium development class last night and OMG! Suprised\n&gt; &gt; &gt; myselff,\n&gt; &gt; &gt; &gt; &gt; had no idea I could get visions on demand like that. I am uncertain \n&gt; if\n&gt; &gt; &gt; it\n&gt; &gt; &gt; &gt; &gt; was due to being in a group with those expectations though. I&#39;ve \n&gt; never\n&gt; &gt; &gt; &gt; &gt; attempted to read for anyone before, always seems kinda \n&gt; presumptuous to\n&gt; &gt; &gt; me.\n&gt; &gt; &gt; &gt; &gt; They do a circle for exchanging messages the third Friday of the \n&gt; month.\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; Frank-S\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; \n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}