{"id": "16661", "subject": "Re: Disturbing clip---Lost souls?", "author": "Jill", "timestamp": "2010-01-25T20:20:09Z", "full_text": "Since I don&#39;t use any speakers, I would have to modify my setup to try this -- but I just might do it soon.  My beloved 4-year-old kitty just died of pancreatitis, so I&#39;m thinking I should do some sessions to see if I can get a meow or two to make me feel better that he&#39;s in a better place.\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;Tom&quot; &lt;Tom_Ray@...&gt; wrote:\n&gt;\n&gt; I primarily am using Franks method as first of all, its hard to hear my own questions being asked, and secondly, my own voice seems to &quot;walk over&quot; some potntially good stuff.  So I say my peice at the beginning of the tape---time/date and a request and let the entities then take over on their own.\n&gt; \n&gt; I attribute the sentances to the 25 inch long, 2 inch PVC pipe I use as a resonator.  Set the loudspeaker of your radio on one end and record from the other.  If you want, do what I did and cut a slot on the side of the pipe just big enough to insert your speaker or speaker end of the radio and have it as a single unit.  I think the pipe approximates the resonance of a human vocal tract and also can pick up environmental sounds--all for the use of the entity.  not to mention reduce the &quot;spikey-ness&quot; of the radio scanner sounds and thus produce a more continious carrier wave.\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Jill&quot; &lt;jjkamp@&gt; wrote:\n&gt; &gt;\n&gt; &gt; I&#39;m jealous that you are getting such complete sentences!  These are great!\n&gt; &gt; \n&gt; &gt; I&#39;m curious, though:  did you ask questions and then get these responses?  Or did you follow Frank&#39;s school of thought and just let the tape run?\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;Tom&quot; &lt;Tom_Ray@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; I interpret as TWO people in trouble  the man seems to be saying over and over again Help me jesus in the background and the woman sounds very distrought herself either calling for &quot;amelia&quot; or shouting her own name--like they are trapped in their own little place or world and frightened and confused---my own take N E ways\n&gt; &gt; &gt; \n&gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com, Kim Sharples &lt;dreambelieveachieve21@&gt; wrote:\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; I hear Help Me and the Amelia....\n&gt; &gt; &gt; &gt; the Help me sounds evil....\n&gt; &gt; &gt; &gt; the Amelia sounds like a woman very afraid or distraught.\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; Kim\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; On Sun, Jan 24, 2010 at 2:00 PM, Tom &lt;Tom_Ray@&gt; wrote:\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; GOT IT UP!--Tom&#39;s Tube File folder &#39;helpAmelia&quot;\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, &quot;Tom&quot;\n&gt; &gt; &gt; &gt; &gt; &lt;Tom_Ray@&gt; wrote:\n&gt; &gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; &gt; My session yesterday yeilded disturbing (to me)clip. A man with a\n&gt; &gt; &gt; &gt; &gt; &quot;country accent&quot; repeats &quot;Help me Jesus, help me je--&quot; and is interrupted by\n&gt; &gt; &gt; &gt; &gt; a mournful woman shouting out the name &quot;Amelia!&quot;\n&gt; &gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; &gt; Did I tap into some sort of &quot;lower realm&quot; or were these perhaps lost or\n&gt; &gt; &gt; &gt; &gt; confused souls calling out. Something I didnt really expect.\n&gt; &gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; &gt; I have been trying to upload the file into my TOM&#39;S TUBE folder for a\n&gt; &gt; &gt; &gt; &gt; while this morning but it blinks out before it loads when I press the upload\n&gt; &gt; &gt; &gt; &gt; button---I think that this might just be a tempory connection glitch, so I\n&gt; &gt; &gt; &gt; &gt; will upload it later.\n&gt; &gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt;  \n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}