{"id": "16685", "subject": "Re: A couple more cool clips  Hey, I didnt know he&#39;d shoot me", "author": "Tom", "timestamp": "2010-01-28T14:33:08Z", "full_text": "I think the key is to make sure there is a CONTINIOUS background sound for the entities to work with, and not just the &quot;blips&quot; of sound emmited from the radio. The resonator works at that by filling in the spaces between the radio words--sort of spreading or blending the blips together somewhat.  I also include a white/random noise source with the radio in the resonator pipe.  That seems to help even more (I dont think its really necessary though)  You can see a pic of my Tom&#39;s Tube set up in the tom&#39;s photos folder in the photo section. (the pipe is a white PVC 24-25&quot; long 2&quot; inside diameter)\n\nCutting the hole(s) for the radio and noise source(if you have one) seems to be the hardest part of it.  I just held the bottom of the radio against the pipe and marked it with a sharpee.  and drilled some holes with a drill--then filing or cutting away until a hole big enough to accomidate the radio SORTA TIGHT is finally made. Right now I simplu lay the mike end of the voice recorder just inside one of the open ends of the pipe. \n\nBefore I cut the holes, or even thought of mounting the components IN the pipe I simply lay the pipe in front of the radio speaker on my table.  Not very transportable that way, but that worked too. \n\nA radio shack &quot;nature sounds&quot; unit, &quot;sleep machine&quot; or Avon Spafinder will serve as a good noise source, as like the radio, the speaker is on the &quot;bottom end&quot; that can be inserted into the pipe, leaving the controls accessable on the outside of the pipe. \n\nMy latest improvement is a 2 inch PVC 90degree elbow on one end of the pipe to direct the sound towards me so I can hear it better in real time.  No glue is necessary. it can be swiveled for best listening.\n\nGood luck.\n\n--- In EVP-ITC@yahoogroups.com, &quot;Jill&quot; &lt;jjkamp@...&gt; wrote:\n&gt;\n&gt; OK, I definitely need to try mimicking your setup -- it&#39;s amazing how you get stuff all in one voice.\n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Tom&quot; &lt;Tom_Ray@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Uploaded 2 of about 20 things from my 1/25th session\n&gt; &gt;  A young man says &quot;Hey, I didnt know he&#39;d shoot me&quot;\n&gt; &gt; \n&gt; &gt; A voice that sounds like Gollum &quot;Look at THAT! can you adjust the Cash(?)(or map(?)&quot; and a reply &quot;Big Money!&quot;\n&gt; &gt; \n&gt; &gt; In the toms tube file\n&gt; &gt;\n&gt;"}