{"id": "16694", "subject": "Re: [EVP-ITC] Re: Spies?", "author": "David Koenig", "timestamp": "2010-01-29T04:50:07Z", "full_text": "THAT&#39;S JUST FUNNY !!!!!!!!!!\n\nOn Thu, Jan 28, 2010 at 11:45 PM, bulletbabea &lt;bulletbabea@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; LOL\n&gt;\n&gt; No one needs to spy to get the information here. This group shares\n&gt; information freely with the world. As for Karen she made a little appearance\n&gt; on a show on PTN yesterday and when I realized who their guest was I\n&gt; referenced my previous note to her about her research tactics or lack\n&gt; thereof. Someone else (her boyfriend) asked her if she is such a good\n&gt; researcher why couldnt she find waverly and she said &quot;is that question from\n&gt; some bitch named Misty&quot;. LOL no it wasn&#39;t Karen actually you have your\n&gt; boyfriend to thank for that one because he is the one who outed you and\n&gt; trashed you on air for all to see and hear, not me.\n&gt;\n&gt; As I said a dumb bitch no...bitch maybe...depends on what kind of bull you\n&gt; are trying to pass off as documented research. So here Karen Stollznow this\n&gt; is for you just because I know you liked my previous post to you enough that\n&gt; your felt it resorted to name calling. Which shows me exactly what kind of\n&gt; person you are and what state of mind you are in.\n&gt;\n&gt; POSTED FROM MY PREVIOUS MESSAGE TO THIS GROUP WHICH INSPIRED HER TO CALL ME\n&gt; A NAME. WOW I WAS ACTUALLY BEING PRETTY NICE WHEN I POSTED IT.\n&gt;\n&gt; _____BEGIN QUOTE_____\n&gt; Karen obviously does not research before she writes her articles.\n&gt;\n&gt; &quot;However, the precise location of the Sanatorium is a closely guarded\n&gt; secret.&quot;\n&gt;\n&gt; Ummm Karen needs to learn to use Google as well. If she had she would have\n&gt; been able to print out a map to Waverly which includes information such as\n&gt; tracks, businesses, adresses AND golf courses at the corner. It even shows\n&gt; you an overhead view of each building you pass along the way on each street.\n&gt; Hint to Karen click sattelite view after you explore closeups of map view.\n&gt;\n&gt; Im sorry but if you are going to write a well informed article the first\n&gt; step is become well informed. I wont bother reading the rest of her articles\n&gt; because I wont waste my time looking at research from someone who cant\n&gt; bother to cover the basics like look at a map before you drive out to\n&gt; someplace you&#39;ve never been before and then misinform people that it is in a\n&gt; secret location. Nor do I see walking on a tour as as actual &quot;investigation&quot;\n&gt; .\n&gt;\n&gt; Alot of the people once believed the earth was flat, unfortunately they\n&gt; were not &quot;well informed&quot; and they too were victims of shoddy research.\n&gt; Luckily there are those who do look beyond the horizon and open their minds\n&gt; to the possibility that there is more out there.\n&gt; _____END QUOTE______\n&gt;\n&gt; You also may want to check the website of the place before you visit, as\n&gt; you will see they also give directions to their establishment on there. I am\n&gt; sorry I wont waste my time reading any more of this wannabe &quot;researcher&quot;\n&gt; articles. I would rather spend my time actually learning something.\n&gt;\n&gt; Have a great day Karen and just remember if you are going to open your\n&gt; mouth and insert foot, it&#39;s always a good idea to scrape the crap off it\n&gt; first!\n&gt;\n&gt; Love and Light\n&gt; Misty\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Zack Widup\n&gt; &lt;w9sz.zack@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Someone&#39;s been spying on this group:\n&gt; &gt;\n&gt; &gt; http://www.csicop.org/specialarticles/show/franks_box_the_broken_radio/\n&gt; &gt;\n&gt; &gt; Zack\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nTHAT'S JUST FUNNY !!!!!!!!!!On Thu, Jan 28, 2010 a 11:45 PM, bulle babea bulle babea@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n LOL \n\nNo one needs o spy o ge he in o ma ion he e. This g oup sha es in o ma ion eely wi h he wo ld. As o Ka en she made a li le appea ance on a show on PTN yes e day and when I ealized who hei gues was I e e enced my p e ious no e o he abou he esea ch ac ics o lack he eo . Someone else (he boy iend) asked he i she is such a good esea che why couldn she ind wa e ly and she said \"is ha ques ion om some bi ch named Mis y\". LOL no i wasn' Ka en ac ually you ha e you boy iend o hank o ha one because he is he one who ou ed you and ashed you on ai o all o see and hea , no me.\n\n\nAs I said a dumb bi ch no...bi ch maybe...depends on wha kind o bull you a e ying o pass o as documen ed esea ch. So he e Ka en S ollznow his is o you jus because I know you liked my p e ious pos o you enough ha you el i eso ed o name calling. Which shows me exac ly wha kind o pe son you a e and wha s a e o mind you a e in.\n\n\nPOSTED FROM MY PREVIOUS MESSAGE TO THIS GROUP WHICH INSPIRED HER TO CALL ME A NAME. WOW I WAS ACTUALLY BEING PRETTY NICE WHEN I POSTED IT.\n\n_____BEGIN QUOTE_____\nKa en ob iously does no esea ch be o e she w i es he a icles. \n \n\"Howe e , he p ecise loca ion o he Sana o ium is a closely gua ded sec e .\" \n \nUmmm Ka en needs o lea n o use Google as well. I she had she would ha e been able o p in ou a map o Wa e ly which includes in o ma ion such as acks, businesses, ad esses AND gol cou ses a he co ne . I e en shows you an o e head iew o each building you pass along he way on each s ee . Hin o Ka en click sa eli e iew a e you explo e closeups o map iew. \n\n \nIm so y bu i you a e going o w i e a well in o med a icle he i s s ep is become well in o med. I won bo he eading he es o he a icles because I won was e my ime looking a esea ch om someone who can bo he o co e he basics like look a a map be o e you d i e ou o someplace you' e ne e been be o e and hen misin o m people ha i is in a sec e loca ion. No do I see walking on a ou as as ac ual \"in es iga ion\" .\n\n \nAlo o he people once belie ed he ea h was la , un o una ely hey we e no \"well in o med\" and hey oo we e ic ims o shoddy esea ch. Luckily he e a e hose who do look beyond he ho izon and open hei minds o he possibili y ha he e is mo e ou he e.\n\n_____END QUOTE______\n\nYou also may wan o check he websi e o he place be o e you isi , as you will see hey also gi e di ec ions o hei es ablishmen on he e. I am so y I won was e my ime eading any mo e o his wannabe \" esea che \" a icles. I would a he spend my ime ac ually lea ning some hing.\n\n\nHa e a g ea day Ka en and jus emembe i you a e going o open you mou h and inse oo , i 's always a good idea o sc ape he c ap o i i s !\n\nLo e and Ligh \nMis y\n\n--- In EVP-ITC@yahoog oups.com, Zack Widup w o e:\n>\n> Someone's been spying on his g oup:\n> \n> h p://www.csicop.o g/speciala icles/show/ anks_box_ he_b oken_ adio/\n> \n> Zack\n>"}