{"id": "16693", "subject": "Re: Spies?", "author": "bulletbabea", "timestamp": "2010-01-29T04:45:50Z", "full_text": "LOL \n\nNo one needs to spy to get the information here. This group shares information freely with the world. As for Karen she made a little appearance on a show on PTN yesterday and when I realized who their guest was I referenced my previous note to her about her research tactics or lack thereof. Someone else (her boyfriend) asked her if she is such a good researcher why couldnt she find waverly and she said &quot;is that question from some bitch named Misty&quot;. LOL no it wasn&#39;t Karen actually you have your boyfriend to thank for that one because he is the one who outed you and trashed you on air for all to see and hear, not me.\n\nAs I said a dumb bitch no...bitch maybe...depends on what kind of bull you are trying to pass off as documented research. So here Karen Stollznow this is for you just because I know you liked my previous post to you enough that your felt it resorted to name calling. Which shows me exactly what kind of person you are and what state of mind you are in.\n\nPOSTED FROM MY PREVIOUS MESSAGE TO THIS GROUP WHICH INSPIRED HER TO CALL ME A NAME. WOW I WAS ACTUALLY BEING PRETTY NICE WHEN I POSTED IT.\n\n_____BEGIN QUOTE_____\nKaren obviously does not research before she writes her articles. \n \n&quot;However, the precise location of the Sanatorium is a closely guarded secret.&quot; \n \nUmmm Karen needs to learn to use Google as well. If she had she would have been able to print out a map to Waverly which includes information such as tracks, businesses, adresses AND golf courses at the corner.  It even shows you an overhead view of each building you pass along the way on each street. Hint to Karen click sattelite view after you explore closeups of map view. \n \nIm sorry but if you are going to write a well informed article the first step is become well informed. I wont bother reading the rest of her articles because I wont waste my time looking at research from someone who cant bother to cover the basics like look at a map before you drive out to someplace you&#39;ve never been before and then misinform people that it is in a secret location. Nor do I see walking on a tour as as actual &quot;investigation&quot; .\n \nAlot of the people once believed the earth was flat, unfortunately they were not &quot;well informed&quot; and they too were victims of shoddy research. Luckily there are those who do look beyond the horizon and open their minds to the possibility that there is more out there.\n_____END QUOTE______\n\nYou also may want to check the website of the place before you visit, as you will see they also give directions to their establishment on there. I am sorry I wont waste my time reading any more of this wannabe &quot;researcher&quot; articles. I would rather spend my time actually learning something.\n\nHave a great day Karen and just remember if you are going to open your mouth and insert foot, it&#39;s always a good idea to scrape the crap off it first!\n\nLove and Light\nMisty\n\n\n--- In EVP-ITC@yahoogroups.com, Zack Widup &lt;w9sz.zack@...&gt; wrote:\n&gt;\n&gt; Someone&#39;s been spying on this group:\n&gt; \n&gt; http://www.csicop.org/specialarticles/show/franks_box_the_broken_radio/\n&gt; \n&gt; Zack\n&gt;"}