{"id": "16709", "subject": "Re: [EVP-ITC] Re: Looking for equipment", "author": "Zack Widup", "timestamp": "2010-01-29T19:05:41Z", "full_text": "I have a Trifield Natural EMF Meter. Cool instrument. I used it on an\ninvestigation last summer and didn&#39;t get any sort of unusual readings. I&#39;m\nparticipating in another one this Saturday night and the place appears to be\nvery haunted. I&#39;ll let you know if I get any readings with it.\n\nThe little $10 &quot;point and shoot&quot; thermometers they sell at Harbor Freight\nare a good deal, too. But the one I have appears to eat batteries.\n:-(\n\nZack\n\nOn Fri, Jan 29, 2010 at 12:31 PM, Michael &lt;smellytoolman@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; We have thermometers too, just didn&#39;t mention them. I will grab a compass\n&gt; and some motion detectors. Must say I didn&#39;t even think of grabbing a\n&gt; hygrometer but will definitely look into it. The trifield meter is a bit out\n&gt; of budget right now but we are going to get one here soon. And yes we do\n&gt; have a K2 meter already. We have most everything I could think of, just\n&gt; looking for some oddities. One of the things I found a while ago was a\n&gt; homemade battery detector. Basically it was 4 batteries running 2 led&#39;s that\n&gt; somebody had made. It was used to correlate the draining of equipment\n&gt; batteries. Wish I could find it again. That&#39;s the type of stuff I&#39;m looking\n&gt; for, stuff that someone made that helped them out.\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, &quot;Tom&quot;\n&gt; &lt;Tom_Ray@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Dont forget thermometers to check for &quot;cold spots&quot;---Are the spots\n&gt; actually &quot;Cold&quot; or are they making us FEEL cold?\n&gt; &gt; Also a compass for magnetic fluctuations.\n&gt; &gt; Some of those ultrasonic or IR motion detectors (real cheap at radio\n&gt; shack)\n&gt; &gt; A hygrometer for measuring dewpoint( at what temp water in air will\n&gt; condense to form a mist---great for correlating with cold spots---mist\n&gt; apparations)\n&gt; &gt; A K2 meter--only 50 bucks or so. great for &quot;gross screening&quot; of the area\n&gt; &gt; A natural EM trifield meter a bit expensive($200-250) but standard ghost\n&gt; hunting equipment.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, &quot;Michael&quot;\n&gt; &lt;smellytoolman@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; I love this discussion group. There is so much information here it is\n&gt; hard to process all of it. Currently, I am working on building a Frank&#39;s box\n&gt; for my paranormal group, however, I am looking for some other home made type\n&gt; equipment to have for our investigation this next week. We currently have IR\n&gt; cameras, EMF detectors, tons of audio recorders and many different cameras.\n&gt; Is there anything else we should have or be using that anyone can think of??\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nI ha e a T i ield Na u al EMF Me e . Cool ins umen . I used i on an in es iga ion las summe and didn' ge any so o unusual eadings. I'm pa icipa ing in ano he one his Sa u day nigh and he place appea s o be e y haun ed. I'll le you know i I ge any eadings wi h i .\n\n \nThe li le $10 \"poin and shoo \" he mome e s hey sell a Ha bo F eigh a e a good deal, oo. Bu he one I ha e appea s o ea ba e ies.\n:-(\n \nZack\nOn F i, Jan 29, 2010 a 12:31 PM, Michael smelly oolman@...> w o e:\n\n  \n\n\n\nWe ha e he mome e s oo, jus didn' men ion hem. I will g ab a compass and some mo ion de ec o s. Mus say I didn' e en hink o g abbing a hyg ome e bu will de ini ely look in o i . The i ield me e is a bi ou o budge igh now bu we a e going o ge one he e soon. And yes we do ha e a K2 me e al eady. We ha e mos e e y hing I could hink o , jus looking o some oddi ies. One o he hings I ound a while ago was a homemade ba e y de ec o . Basically i was 4 ba e ies unning 2 led's ha somebody had made. I was used o co ela e he d aining o equipmen ba e ies. Wish I could ind i again. Tha 's he ype o s u I'm looking o , s u ha someone made ha helped hem ou . \n--- In EVP-ITC@yahoog oups.com, \"Tom\" w o e:>> Don o ge he mome e s o check o \"cold spo s\"---A e he spo s ac ually \"Cold\" o a e hey making us FEEL cold?\n> Also a compass o magne ic luc ua ions.> Some o hose ul asonic o IR mo ion de ec o s ( eal cheap a adio shack)> A hyg ome e o measu ing dewpoin ( a wha emp wa e in ai will condense o o m a mis ---g ea o co ela ing wi h cold spo s---mis appa a ions)\n> A K2 me e --only 50 bucks o so. g ea o \"g oss sc eening\" o he a ea> A na u al EM i ield me e a bi expensi e($200-250) bu s anda d ghos hun ing equipmen .> > > --- In EVP-ITC@yahoog oups.com, \"Michael\" w o e:\n> >> > I lo e his discussion g oup. The e is so much in o ma ion he e i is ha d o p ocess all o i . Cu en ly, I am wo king on building a F ank's box o my pa ano mal g oup, howe e , I am looking o some o he home made ype equipmen o ha e o ou in es iga ion his nex week. We cu en ly ha e IR came as, EMF de ec o s, ons o audio eco de s and many di e en came as. Is he e any hing else we should ha e o be using ha anyone can hink o ??\n> >>"}