{"id": "16704", "subject": "Re: Looking for equipment", "author": "Michael", "timestamp": "2010-01-29T18:31:48Z", "full_text": "We have thermometers too, just didn&#39;t mention them.   I will grab a compass and some motion detectors.   Must say I didn&#39;t even think of grabbing a hygrometer but will definitely look into it.  The trifield meter is a bit out of budget right now but we are going to get one here soon. And yes we do have a K2 meter already.   We have most everything I could think of, just looking for some oddities.  One of the things I found a while ago was a homemade battery detector.  Basically it was 4 batteries running 2 led&#39;s that somebody had made.  It was used to correlate the draining of equipment batteries.  Wish I could find it again.  That&#39;s the type of stuff I&#39;m looking for, stuff that someone made that helped them out.\n\n--- In EVP-ITC@yahoogroups.com, &quot;Tom&quot; &lt;Tom_Ray@...&gt; wrote:\n&gt;\n&gt; Dont forget thermometers to check for &quot;cold spots&quot;---Are the spots actually &quot;Cold&quot; or are they making us FEEL cold?\n&gt; Also a compass for magnetic fluctuations.\n&gt; Some of those ultrasonic or IR motion detectors (real cheap at radio shack)\n&gt; A hygrometer for measuring dewpoint( at what temp water in air will condense to form a mist---great for correlating with cold spots---mist apparations)\n&gt; A K2 meter--only 50 bucks or so.  great for &quot;gross screening&quot; of the area\n&gt; A natural EM trifield meter  a bit expensive($200-250) but standard ghost hunting equipment.\n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Michael&quot; &lt;smellytoolman@&gt; wrote:\n&gt; &gt;\n&gt; &gt; I love this discussion group.   There is so much information here it is hard to process all of it.  Currently, I am working on building a Frank&#39;s box for my paranormal group, however, I am looking for some other home made type equipment to have for our investigation this next week.   We currently have IR cameras, EMF detectors, tons of audio recorders and many different cameras.  Is there anything else we should have or be using that anyone can think of??\n&gt; &gt;\n&gt;"}