{"id": "16727", "subject": "Re: [EVP-ITC] Blog this!", "author": "Zack Widup", "timestamp": "2010-02-02T20:48:39Z", "full_text": "People are what they are despite whatever education they have. I&#39;ve known\nand worked with people of all educational levels and the percentages of good\nguys and jerks remains the same across the boards.\n\n Did you actually create a blog there, Frank?\n\nZack\n\nOn Tue, Feb 2, 2010 at 2:31 PM, Frank Sumption &lt;purplealiengirl@...&gt;wrote:\n\n&gt;\n&gt;\n&gt;  Frank&#39;s Box blog\n&gt;\n&gt;\n&gt; http://www.blogger.com/home\n&gt;\n&gt; https://www.blogger.com/start\n&gt;\n&gt;  Since just questioning some of the box blogs out there results in insults,\n&gt; cussing, and name calling, I wanted a place to respond quietly and sanely,\n&gt; and also make general box use and function comments where people are not\n&gt; going to be attacked, although I bet we can expect attacks via comments.\n&gt; Like that one that&#39;s all F-Us and name calling, yet is supposed to be from a\n&gt; titled degree dork. Evidence that a &quot;higher&quot; education is more a process of\n&gt; brainwashing than anythign else, and god help anyone that contradicts the\n&gt; brainwashing. &quot;Thinking not allowed!&quot;. Also the group isn&#39;t for this type of\n&gt; comments. Sorry!\n&gt;\n&gt;  F-S\n&gt;\n&gt; \n&gt;\n\nPeople a e wha hey a e despi e wha e e educa ion hey ha e. I' e known and wo ked wi h people o all educa ional le els and he pe cen ages o good guys and je ks emains he same ac oss he boa ds.\n \n Did you ac ually c ea e a blog he e, F ank?\n \nZack\nOn Tue, Feb 2, 2010 a 2:31 PM, F ank Sump ion pu plealiengi l@...> w o e:\n\n  \n\n\n\n\n\nF ank's Box blog\n \n \nh p://www.blogge .com/home\n \nh ps://www.blogge .com/s a \n \n Since jus ques ioning some o he box blogs ou he e esul s in insul s, cussing, and name calling, I wan ed a place o espond quie ly and sanely, and also make gene al box use and unc ion commen s whe e people a e no going o be a acked, al hough I be we can expec a acks ia commen s. Like ha one ha 's all F-Us and name calling, ye is supposed o be om a i led deg ee do k. E idence ha a \"highe \" educa ion is mo e a p ocess o b ainwashing han any hign else, and god help anyone ha con adic s he b ainwashing. \"Thinking no allowed!\". Also he g oup isn' o his ype o commen s. So y!\n\n \n F-S"}