{"id": "16733", "subject": "apples & oranges", "author": "harpo103", "timestamp": "2010-02-03T19:39:22Z", "full_text": "The only problem with trying to &quot;prove&quot; the paranormal is that the paranormal usually doesn&#39;t cooperate. How many times do you guys use a &quot;ghostbox&quot; and it says something whacky or bizarre? How many time does it say your name, or say the word acorn after an acorn falls out of a tree and hits the box that you&#39;re holding? It happens when it happens.\nScience DEMANDS repeatability!\nHow many times have you gone to the zoo and watched the apes just sit around and scratch themselves, while other times they jump around and cavort like teenagers on a sugar high?\nYou just never know when or what will happen in the paranormal?\nI was skeptical too until I had personal experiences. I didn&#39;t go into this to prove or to disprove. I only went into this to find out for myself. I do believe that there is something outside of the normal going on-what it is, I don&#39;t know. These &quot;scientific&quot; types like to debunk rather than prove paranormal phenomena because its just a lot easier to do! They want to be The Great Debunker, and base their careers on pointing at the crazy apes instead of trying to understand what is going on here. There are some scientific minds involved in this field. At great risk to their future career prospects too. Nobody wants to labeled a kook and therefore laughed at at every turn. This stuff is REALLY hard to prove. Even with solid evidence of apparitions on video tape or EVPs on audio recorders, the overly-skeptical mind will dismiss this as swamp gas or paradoleia-which it sometimes could be. There is nothing to convince someone better than a personal, up-close experience to get your mind wondering if there is something beyond the veil. I encourage all die-hard skeptics and debunkers to get together with some friends, do something strange and go for a ghosthunt, play around with a ghostbox, make friends with a legitimate psychic. You&#39;ll make new friends, have some fun and have your mind challenged all at the same time."}