{"id": "16740", "subject": "Re: [WillCountyGhostHuntersSociety] Possible EVP - Need Opinions", "author": "Zack Widup", "timestamp": "2010-02-03T23:49:13Z", "full_text": "Hi April,\n\nI did some serious processing on this. I managed to get rid of most of the\nlow frequency rumble and high-pitched background noise and left just the\nmale voice frequency band.\n\nIt comes through as either &quot;The best for the weather&quot; or &quot;The best for the\nlevel.&quot; After listening to it about 50 times I think &quot;The best for the\nlevel&quot; is a better statement. What it means, who knows?\n:-)\n\nZack\n\nOn Wed, Feb 3, 2010 at 3:56 PM, April Abercrombie &lt;\napril@...&gt; wrote:\n\n&gt; Awesome Zack! Thanks!\n&gt;\n&gt; Yeah...it is a whole lot of fun!!! 1 little EVP can make all the hours and\n&gt; hours of sitting, watching and waiting well worth it. Would love to hear\n&gt; what you got too.\n&gt;\n&gt; April\n&gt;\n&gt;\n&gt; On Wed, Feb 3, 2010 at 1:59 PM, Zack Widup &lt;w9sz.zack@...&gt; wrote:\n&gt;\n&gt;&gt; Hi April,\n&gt;&gt;\n&gt;&gt; I&#39;ll give a listen when I get home in a few hours.\n&gt;&gt;\n&gt;&gt; I was involved in an investigation on Saturday night of an old house in\n&gt;&gt; Shelbyville, IL. It&#39;s one of the oldest houses in that town, built shortly\n&gt;&gt; after the CIvil War, and has a history of deaths in the house. I recorded\n&gt;&gt; about 6 hours of audio.\n&gt;&gt;\n&gt;&gt; So far I&#39;ve found 3 EVP&#39;s. The first one plainly says &quot;Welcome&quot; to\n&gt;&gt; everyone who has listened to it so far. The second is fairly clear to me but\n&gt;&gt; most of the other members who were on the investigation can&#39;t hear it. A\n&gt;&gt; third one sounds clear to me and to others but MIGHT be a stomach growl.\n&gt;&gt; Isn&#39;t this fun?\n&gt;&gt;\n&gt;&gt; Zack\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;   On Wed, Feb 3, 2010 at 2:25 PM, April Abercrombie &lt;\n&gt;&gt; april@...&gt; wrote:\n&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt; Hi All,\n&gt;&gt;&gt;\n&gt;&gt;&gt; This was captured during a Ghost Hunt last weekend at Golden Hill\n&gt;&gt;&gt; Cemetery in Lakewood, CO. You will hear my daughter ask a question, and then\n&gt;&gt;&gt; there seems to be a response.\n&gt;&gt;&gt;\n&gt;&gt;&gt; Please let me know if if you can hear it, and if so, what you think it\n&gt;&gt;&gt; might be saying.\n&gt;&gt;&gt;\n&gt;&gt;&gt; Thanks!\n&gt;&gt;&gt; April\n&gt;&gt;&gt;\n&gt;&gt;&gt; *Untouched:*\n&gt;&gt;&gt; http://www.esnips.com/doc/a5aeea09-fb8e-4434-88e1-42fe66d21bc1/01-09-55-Anomaly\n&gt;&gt;&gt;\n&gt;&gt;&gt; *Enhanced Version:*\n&gt;&gt;&gt; http://www.esnips.com/doc/a0affd9c-fb76-4667-94d5-24a006990869/01-09-55-Anomaly-Enhanced\n&gt;&gt;&gt;\n&gt;&gt;&gt;  \n&gt;&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;\n\nHi Ap il,\n \nI did some se ious p ocessing on his. I managed o ge id o mos o he low equency umble and high-pi ched backg ound noise and le jus he male oice equency band.\n \nI comes h ough as ei he \"The bes o he wea he \" o \"The bes o he le el.\" A e lis ening o i abou 50 imes I hink \"The bes o he le el\" is a be e s a emen . Wha i means, who knows?\n\n:-)\n \nZack\nOn Wed, Feb 3, 2010 a 3:56 PM, Ap il Abe c ombie ap il@...> w o e:\nAwesome Zack! Thanks!Yeah...i is a whole lo o un!!! 1 li le EVP can make all he hou s and hou s o si ing, wa ching and wai ing well wo h i . Would lo e o hea wha you go oo.\nAp il \n\n\n\nOn Wed, Feb 3, 2010 a 1:59 PM, Zack Widup w9sz.zack@...> w o e:\n\nHi Ap il,\n \nI'll gi e a lis en when I ge home in a ew hou s.\n \nI was in ol ed in an in es iga ion on Sa u day nigh o an old house in Shelby ille, IL. I 's one o he oldes houses in ha own, buil sho ly a e he CI il Wa , and has a his o y o dea hs in he house. I eco ded abou 6 hou s o audio.\n\n \nSo a I' e ound 3 EVP's. The i s one plainly says \"Welcome\" o e e yone who has lis ened o i so a . The second is ai ly clea o me bu mos o he o he membe s who we e on he in es iga ion can' hea i . A hi d one sounds clea o me and o o he s bu MIGHT be a s omach g owl. \n\nIsn' his un?\n \nZack\n \n\n\n\nOn Wed, Feb 3, 2010 a 2:25 PM, Ap il Abe c ombie ap il@...> w o e:\n\n  \n\n\n\n\n\n\nHi All,\nThis was cap u ed du ing a Ghos Hun las weekend a Golden Hill Ceme e y in Lakewood, CO. You will hea my daugh e ask a ques ion, and hen he e seems o be a esponse.Please le me know i i you can hea i , and i so, wha you hink i migh be saying.\nThanks!Ap ilUn ouched: h p://www.esnips.com/doc/a5aeea09- b8e-4434-88e1-42 e66d21bc1/01-09-55-Anomaly\nEnhanced Ve sion: h p://www.esnips.com/doc/a0a d9c- b76-4667-94d5-24a006990869/01-09-55-Anomaly-Enhanced"}