{"id": "16772", "subject": "Re: [EVP-ITC] Franks box", "author": "Rj", "timestamp": "2010-02-09T20:35:17Z", "full_text": "--0-833638340-1265747717=:46322\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nHello Gary.=C2=A0 What kind of professional or medical training do you have=\r\n in the area of treating mental illness?=C2=A0 Are you a doctor?\n\n\n--- On T=\r\nue, 2/9/10, maltesefalcon18 &lt;maltesefalcon18@...&gt; wrote:\n\nFrom: malte=\r\nsefalcon18 &lt;maltesefalcon18@...&gt;\nSubject: [EVP-ITC] Franks box\nTo: EV=\r\nP-ITC@yahoogroups.com\nDate: Tuesday, February 9, 2010, 11:47 AM\n\n\n\n\n\n\n\n=C2=\r\n=A0\n\n\n\n  \n\n\n    \n      \n      \n      Hi my name is Gary. I volunteer at a n=\r\non profit hope center for NAMI springfield mo.Over the last 2 years have be=\r\nen working with the mentally ill in alternative medicine and community reso=\r\nurces.I have come to belive that not all mentally ill people are really sic=\r\nk at all but instead may actually  be hearing voices that are related to ev=\r\nps.I belive that Franks box actually could allow those who suffer from delu=\r\nisions and voices to confront and identifie discarnate entitys who have bec=\r\nome attached to the livving.I also belive that by using franks box its poss=\r\nible to remove and cure the livving from these unwantted energys that plagu=\r\ne many people around the world.In my own exsperimenting I have found that s=\r\nome of the voices that the mentally ill exsperiance actually have awareness=\r\n outside of their victims knowledge,space and time.I have seen these voices=\r\n destroy many lives that were cut short by medicines that were uneffective =\r\nand offten worse then\n the condition whitch they were prescribed for.I wish=\r\n to conduct a study using franks box in a controled exsperiment to see if t=\r\nhis theory maybe true and if a real cure can be found to rid the livving fr=\r\nom negative attachments that can cause and mimick mental illness in normall=\r\ny healthy people.Is there anyone who could help in this research.Basicly ne=\r\ned to find a ghost box AKA Franks box that could be used for this ground br=\r\neaking exsperiment. Any help would greatly be appreciated, Thank you.\n\n\n\n\n\n=\r\n    \n     \n\n    \n    \n\n\n \n\n\n\n  \n\n\n\n\n\n\n      \r\n--0-833638340-1265747717=:46322\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;Hello Gary.&nbsp; What kind of professional o=\r\nr medical training do you have in the area of treating mental illness?&nbsp=\r\n; Are you a doctor?&lt;br&gt;&lt;br&gt;&lt;br&gt;--- On &lt;b&gt;Tue, 2/9/10, maltesefalcon18 &lt;i&gt;&l=\r\nt;maltesefalcon18@...&gt;&lt;/i&gt;&lt;/b&gt; wrote:&lt;br&gt;&lt;blockquote style=3D&quot;bord=\r\ner-left: 2px solid rgb(16, 16, 255); margin-left: 5px; padding-left: 5px;&quot;&gt;=\r\n&lt;br&gt;From: maltesefalcon18 &lt;maltesefalcon18@...&gt;&lt;br&gt;Subject: [EV=\r\nP-ITC] Franks box&lt;br&gt;To: EVP-ITC@yahoogroups.com&lt;br&gt;Date: Tuesday, February=\r\n 9, 2010, 11:47 AM&lt;br&gt;&lt;br&gt;&lt;div id=3D&quot;yiv1413849556&quot;&gt;\n\n\n\n\n\n&lt;span style=3D&quot;di=\r\nsplay: none;&quot;&gt;&nbsp;&lt;/span&gt;\n\n\n\n    &lt;div id=3D&quot;ygrp-text&quot;&gt;\n      \n      \n   =\r\n   &lt;p&gt;Hi my name is Gary. I volunteer at a non profit hope center for NAMI =\r\nspringfield mo.Over the last 2 years have been working with the mentally il=\r\nl in alternative medicine and community resources.I have come to belive tha=\r\nt not all mentally ill people are really sick at all but instead may actual=\r\nly  be hearing voices that are related to evps.I belive that Franks box act=\r\nually could allow those who suffer from deluisions and voices to confront a=\r\nnd identifie discarnate entitys who have become attached to the livving.I a=\r\nlso belive that by using franks box its possible to remove and cure the liv=\r\nving from these unwantted energys that plague many people around the world.=\r\nIn my own exsperimenting I have found that some of the voices that the ment=\r\nally ill exsperiance actually have awareness outside of their victims knowl=\r\nedge,space and time.I have seen these voices destroy many lives that were c=\r\nut short by medicines that were uneffective and offten worse then\n the cond=\r\nition whitch they were prescribed for.I wish to conduct a study using frank=\r\ns box in a controled exsperiment to see if this theory maybe true and if a =\r\nreal cure can be found to rid the livving from negative attachments that ca=\r\nn cause and mimick mental illness in normally healthy people.Is there anyon=\r\ne who could help in this research.Basicly need to find a ghost box AKA Fran=\r\nks box that could be used for this ground breaking exsperiment. Any help wo=\r\nuld greatly be appreciated, Thank you.&lt;br&gt;\n&lt;br&gt;\n&lt;/p&gt;\n\n    &lt;/div&gt;\n     \n\n\n\n =\r\n\n\n\n&lt;/div&gt;&lt;/blockquote&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n      \r\n--0-833638340-1265747717=:46322--"}