{"id": "16780", "subject": "Re: Rules", "author": "Barbara", "timestamp": "2010-02-10T16:16:58Z", "full_text": "OK...  I&#39;m biting.  :-)\n\nYour response below surprised me.  I&#39;ve only been a member of this group for a short time, thus may have missed your theory of origin relative to EVPs and ghost box verbalizations.  So, with respect, and only if you don&#39;t mind taking the time to reply, I ask... what do you think they are, or represent.  If this info is located elsewhere, a mere link to that spot would suffice, too. \n\nThanks so much in advance.\nBarbara_NY\n\n\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  It&#39;s stuff like this that makes me want to completely withdraw. I don&#39;t\n&gt; follow the friggin&#39; Hollywood pack and accept all the Hollywood BS about\n&gt; ghosts and haunings, so everyone gets all condescending. Bite me!\n&gt; \n&gt; \n&gt; \n&gt;  F-S\n&gt; \n&gt; On Wed, Feb 10, 2010 at 8:02 AM, Frank Sumption\n&gt; &lt;purplealiengirl@...&gt;wrote:\n&gt; \n&gt; &gt;\n&gt; &gt;\n&gt; &gt;  On Tue, Feb 9, 2010 at 2:54 PM, Jill &lt;jjkamp@...&gt; wrote:\n&gt; &gt;\n&gt; &gt;&gt;\n&gt; &gt;&gt;\n&gt; &gt;&gt; Hi all. I am wondering, has anyone here ever gotten an entity through the\n&gt; &gt;&gt; box who mentions &quot;rules&quot; for speaking to the living, and if so, what were\n&gt; &gt;&gt; those rules? I seem to vaguely recall mention of this somewhere, but can&#39;t\n&gt; &gt;&gt; recall where. Wondering if the rules are laws of physics, or laws\n&gt; &gt;&gt; enforceable by (insert deity name here).\n&gt; &gt;&gt;\n&gt; &gt;&gt; Frank, stop reading, because the next part assumes a belief in ghosts.\n&gt; &gt;&gt; Well that&#39;s rude!\n&gt; &gt;&gt;\n&gt; &gt;&gt; Reason I ask is, I was watching one of the better ghost shows on TV, and\n&gt; &gt;&gt; it got me to thinking about how paranormal activity often happens in the\n&gt; &gt;&gt; next room, almost never directly (unless it&#39;s a deceased loved one, or a\n&gt; &gt;&gt; residual haunting). Could this be because of those &quot;rules&quot;? Could the reason\n&gt; &gt;&gt; entities lie so much have to do with the &quot;rules&quot;?\n&gt; &gt;&gt;\n&gt; &gt;&gt; Thinking out loud here, so just ignore if I&#39;m not making any sense.\n&gt; &gt;&gt;\n&gt; &gt;&gt;  \n&gt; &gt;&gt;\n&gt; &gt;\n&gt; &gt;\n&gt;"}