{"id": "16793", "subject": "Resonance--Stuff we need to know", "author": "Tom", "timestamp": "2010-02-18T17:52:07Z", "full_text": "I have been doing some more research, specifically into the subject of RESONANCE and have came up with a few things that everybody involved in this field should know.  Of course some of you might already be familiar with some of the terminology and principles, but this is interesting and informative just the same.\n\nThere appear to be TWO DIFFERENT KINDS of resonance involved in instrumental spirit communication.  STOCHASTIC resonance and ACOUSTIC resonance.  BOTH seem to employ a background &quot;noise&quot; of some sort so make the voices of the entities audible.  However, the principles are different and may be a source of dissagreement between approaches of spirit communications---Anoung those who do NOT know the differences between Stochastic and Acoustic systems and theories.\n\nIn STOCHASTIC resonance the alledged &quot;entitiy voices&quot;---The SIGNAL are effectively AMPLIFIED by the presense of a random noise background. This kind of signal amplification is an accepted tennant of conventional science and mathematics, BTW. &quot;STOCHASTIC&quot; refering to a Greek term for &quot;randomness&quot;. Apparently a weak signal can be &quot;amplified&quot; by a background of &quot;white&quot; or pink noise.  While still not entirely understood, the signal apparently &quot;skews&quot; the randomness of the carrier in the directions of different frequencies (by momentarily canceling out and enhansing the different sets of frequency waves) giving the overall  resulting sound--OR EM waves a tone suggestive of those of the signal.\n\nIn ACOUSTIC Resonance, the background sound is MODULATED by &quot;containment&quot; and in changes in the size and shape of that &quot;containment&quot; so that certian frequencies available in the background noise are enhanced or surpressed.  This is the same principle of being able to hear a voice when one &quot;mouths words&quot; when holding a buzzing electric rasor to one&#39;s lips or uses an artificial lyarinix.\n\nOne of the THEORIES of EVP, etc. suggests that the entities may &quot;materialize&quot; a vocal tract like resonating cavity to modify random background noises into sounds that sound like words. Or they may use a more sophisticated method for such modulations.\n This is the ACOUSTIC theory that I base my &quot;Tom&#39;s Tube&quot; Ghost box on. \n\nFrank&#39;s box apparently is stressing the STOCHASTIC principle--and this might happen on both the AUDIO and EM levels.  I likely suspect though, that BOTH methods are used to some extent,by the entities. in MINE and HIS devices   \n\nMy &quot;Random field viewer&quot; mentioned in other messages, apparently exploits Stochastic resonance to make images from random dots on a screen, and this method might also be used to help some ghosts do apparations--as seen in some photos.\n\nSO At least TWO kinds of resosance may be involved. Amplification of a Random(signal) played against against a random background(Stochastic) And Acoustic resonance--enhancing and supression of selected frequencies in a random background (usually by variable containment)"}