{"id": "1680", "subject": "Re: [EVP-ITC] Re: More experiments.", "author": "Zack Widup", "timestamp": "2007-07-27T13:52:48Z", "full_text": "Wow, excellent!  I was kind of leading into that - possibly it could be \nused in conjunction with Frank&#39;s box or just by itself on an \ninvestigation.\n\nI&#39;ve been fascinated with &quot;radionics&quot;, &quot;psychotronics&quot;, &quot;psi machines&quot;, \nor whatever you want to call them, for decades. There&#39;s some interesting \nstuff in the book &quot;The Excalibur Briefing&quot; by Thomas E. Bearden.\n\n(Sorry about the late response, I&#39;ve been terribly busy and I&#39;m getting \ncaught up on some e-mail).\n\nZack\n\nOn Tue, 17 Jul 2007, psi_research wrote:\n\n&gt; Hi Zack, I have a new radionics kit based on the original Hieronymus\n&gt; machine. It made from Bakelite, even the stick plate is. I still need\n&gt; to wire it up so I just placed the components on the still unassembled\n&gt; board and uploaded a pic in my photo album on this forum. The stick\n&gt; plate is also made of Bakelite but I placed a small plastic square\n&gt; where the stick pad goes. My crazy plane was to adapt it to the tuning\n&gt; mechanism of Frank&#39;s Box to allow an intuitive tactile feedback\n&gt; interface so I could try to find the frequencies where spirits contact\n&gt; us.\n&gt;\n&gt; Sort of like the manual linear sweep but with a stick pad added. These\n&gt; 3 dial machines are still available from Bill Jensen out of Knoxville\n&gt; TN who makes them to original spec except with modern internal\n&gt; circuitry. -Bill Murphy\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, Zack Widup &lt;w9sz@...&gt; wrote:\n&gt;&gt;\n&gt;&gt; On Mon, 16 Jul 2007, Frank Sumption wrote:\n&gt;&gt;\n&gt;&gt;&gt; This time I made a small plastic echo box. I tried plastic years\n&gt; ago, and it\n&gt;&gt;&gt; didn&#39;t work, this time it seems to. The injection speaker accounts\n&gt; for the\n&gt;&gt;&gt; weaker voices I think, since it&#39;s an ear bud, and is 32 ohm,\n&gt; normal speakers\n&gt;&gt;&gt; are 8 ohms. More voices are in my folder.\n&gt;&gt;&gt;\n&gt;&gt;\n&gt;&gt; There are so many different types of plastics with so many different\n&gt;&gt; characteristics ... ABS plastic, PVC, Delrin, acrylic, PTFE (teflon),\n&gt;&gt; Cyrolon ZX ...\n&gt;&gt;\n&gt;&gt; It might be interesting to experiment with different types and see what\n&gt;&gt; works the best.\n&gt;&gt;\n&gt;&gt; Anyone here ever build a Hieronymus machine?  I understand teflon (or\n&gt;&gt; fiberglass-teflon PC board material) works incredibly well for the\n&gt;&gt; &quot;stick&quot; sensor plate.\n&gt;&gt;\n&gt;&gt; Zack\n&gt;&gt;"}