{"id": "16816", "subject": "Re: [EVP-ITC] What the skepdicks r missing", "author": "Alyson Gannon", "timestamp": "2010-03-04T21:23:23Z", "full_text": "I&#39;m new here and just chiming in with my two cents....\n\nAs a practicing medium I do believe Spirits get stuck.  There is a different\nenergetic feeling I receive when connecting with someone who has truly\ncrossed over and is now &quot;in spirit&quot; versus someone who has not.   Those who\nare stuck either do not realize they have died or they are attached to our\nEarth plane (be it a particular person or event) and don&#39;t want to or know\nhow to leave.  I believe it is those stuck individuals who are often behind\nthe rattle & clatter in hauntings---although this topic is still new to me.\n\nFor those who have actually crossed over (and I believe this is the majority\nof souls), they return to Spirit and become the light & love they came\nfrom.  Spirits have much better things to do than haunt us, they continue to\nlearn and evolve on the other side.  However, they do enjoy communicating\nwith us, especially letting their loved ones know they are ok.\n\nBest,\nAlyson\n\n\n\nOn Thu, Mar 4, 2010 at 12:05 PM, Frank Sumption\n&lt;purplealiengirl@...&gt;wrote:\n\n&gt;\n&gt;\n&gt;  Just like I am skeptical about hauntings, not that I don&#39;t believe\n&gt; something is going on, I don&#39;t think there are stuck spirits, so I think\n&gt; hauntings are a show for the living.\n&gt;\n&gt;\n&gt;\n&gt;  Frank-S\n&gt;\n&gt; On Thu, Mar 4, 2010 at 10:32 AM, Michelle Ayers &lt;diver4skynsea@...&gt;wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; Wow, Tom...excellent way to sort and define the differences. Do you mind\n&gt;&gt; if I quote you on that? Would like to share that thought with some friends I\n&gt;&gt; was just discussing that point with...\n&gt;&gt;\n&gt;&gt; M\n&gt;&gt;\n&gt;&gt; (have not formally introduced myself, but very much enjoying the work and\n&gt;&gt; discussions here. Thanks to you all.)\n&gt;&gt;\n&gt;&gt; Michelle D. Ayers; Sent from iPhone\n&gt;&gt;\n&gt;&gt; On Mar 4, 2010, at 8:14 AM, Tom_Ray@... wrote:\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; What Frank is referring to is more properly termed a &quot;Pseudo-Skeptic&quot;.\n&gt;&gt;  Indeed Skepticism is a vital part of scientific investigations, but it&#39;s\n&gt;&gt; Skepticism based on consideration of the facts and  expressing a caution or\n&gt;&gt; difference of opinion is what is useful in the Scientific community.  A\n&gt;&gt; pseudo Skeptic is characterized by a person who clearly does not know the\n&gt;&gt; subject area other than through what may be termed &quot;common knowledge&quot; or, at\n&gt;&gt; best, a brief overview of the literature.  A  Pseudo skeptic&#39;s &quot;opinions&quot;\n&gt;&gt; are based primarily on an emotional attitude towards the subject matter\n&gt;&gt; rather than what few &quot;facts&quot; he knows.  Its a psychological defense he uses\n&gt;&gt; to shore up his status, the validity of his work, and to cope with things\n&gt;&gt; that frighten him.\n&gt;&gt;\n&gt;&gt; A real Skeptic is a friend with a difference of opinion based on a genuine\n&gt;&gt; desire to help and sufficient data on the subject at hand to know what\n&gt;&gt; he/she is talking about.  We, as Scientists must always have a health dose\n&gt;&gt; of real Skepticism.  Otherwise we risk being the exact inverse of the Pseudo\n&gt;&gt; skeptic---the &quot;FLAKE&quot;.  The Flake is the type who will believe anything.\n&gt;&gt;  Just as the Pseudo Skeptic has a need to reject things on emotional\n&gt;&gt; grounds, the Flake has a need to accept EVERYTHING on emotional grounds.\n&gt;&gt;  Any shadow,  sound, or corner of the eye flash just HAS to be a ghost or\n&gt;&gt; spirit. ----or whatever.  I think you know the type, and   these &quot;flakes&quot;\n&gt;&gt; are what Pseudo skeptics accuse us who are serious about paranormal studies\n&gt;&gt;  of being.  Perhaps its one of the reasons they get us so angry.\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;   *Rj &lt;rasterer@...&gt;*\n&gt;&gt; Sent by: EVP-ITC@yahoogroups.com\n&gt;&gt;\n&gt;&gt; 03/04/2010 09:48 AM\n&gt;&gt;   Please respond to\n&gt;&gt; EVP-ITC@yahoogroups.com\n&gt;&gt;\n&gt;&gt;    To\n&gt;&gt; EVP-ITC@yahoogroups.com\n&gt;&gt; cc\n&gt;&gt;   Subject\n&gt;&gt; Re: [EVP-ITC] What the skepdicks r missing\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;   I&#39;ve heard the same said for the evp researchers!  But it&#39;s not that\n&gt;&gt; simple in either case:\n&gt;&gt; the last block that you reference has small print that says &quot;Compare the\n&gt;&gt; hypothesis to the experiment&#39;s conclusion&quot;.  Which of course you can&#39;t do\n&gt;&gt; unless you already visited the hypothesis block and have a hypothesis to\n&gt;&gt; which to compare.  That in turn has small print which says &quot;predict the\n&gt;&gt; outcome of the problem&quot;, which of course you can&#39;t do either unless you&#39;ve\n&gt;&gt; already visited the earlier block of Purpose (&quot;state the problem&quot;).\n&gt;&gt;\n&gt;&gt; I don&#39;t think it&#39;s helpful to deny good evidence, whether it is good\n&gt;&gt; evidence from someone claiming to have detected spirits, or whether it is\n&gt;&gt; good evidence from someone claiming that people can mistake noise for speech\n&gt;&gt; or random radio tunings for spirit control.  That&#39;s why the scientific\n&gt;&gt; method is valuable: it keeps both the skeptic and the believer real.\n&gt;&gt;\n&gt;&gt; --- On *Wed, 3/3/10, Frank Sumption &lt;purplealiengirl@...&gt;* wrote:\n&gt;&gt;\n&gt;&gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt;&gt; Subject: [EVP-ITC] What the skepdicks r missing [1 Attachment]\n&gt;&gt; To: evp-itc@yahoogroups.com\n&gt;&gt; Date: Wednesday, March 3, 2010, 8:25 PM\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; They all just skip to tbottom.\n&gt;&gt;\n&gt;&gt;  F-S\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;  \n&gt;\n\nI'm new he e and jus chiming in wi h my wo cen s....As a p ac icing medium I do belie e Spi i s ge s uck.  The e is a di e en ene ge ic eeling I ecei e when connec ing wi h someone who has uly c ossed o e and is now \"in spi i \" e sus someone who has no .   Those who a e s uck ei he do no ealize hey ha e died o hey a e a ached o ou Ea h plane (be i a pa icula pe son o e en ) and don' wan o o know how o lea e.  I belie e i is hose s uck indi iduals who a e o en behind he a le & cla e in haun ings---al hough his opic is s ill new o me.\nFo hose who ha e ac ually c ossed o e (and I belie e his is he majo i y o souls), hey e u n o Spi i and become he ligh & lo e hey came om.  Spi i s ha e much be e hings o do han haun us, hey con inue o lea n and e ol e on he o he side.  Howe e , hey do enjoy communica ing wi h us, especially le ing hei lo ed ones know hey a e ok.\nBes ,AlysonOn Thu, Ma 4, 2010 a 12:05 PM, F ank Sump ion pu plealiengi l@gmail.com> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n  Jus like I am skep ical abou haun ings, no ha I don' belie e some hing is going on, I don' hink he e a e s uck spi i s, so I hink haun ings a e a show o he li ing. \n \n \n \n F ank-S\nOn Thu, Ma 4, 2010 a 10:32 AM, Michelle Aye s di e 4skynsea@...> w o e:\n\n  \n\n\n\n\nWow, Tom...excellen way o so and de ine he di e ences. Do you mind i I quo e you on ha ? Would like o sha e ha hough wi h some iends I was jus discussing ha poin wi h...\n\nM\n\n(ha e no o mally in oduced mysel , bu e y much enjoying he wo k and discussions he e. Thanks o you all.)Michelle D. Aye s; Sen om iPhone\nOn Ma 4, 2010, a 8:14 AM, Tom_Ray@... w o e:\n\n\n  \n\nWha F ank is e e ing o is mo e p ope ly e med a \"Pseudo-Skep ic\".  Indeed Skep icism is a i al pa o scien i ic in es iga ions, bu i 's Skep icism based on conside a ion o he ac s and  exp essing a cau ion o di e ence o opinion is wha is use ul in he Scien i ic communi y.  A pseudo Skep ic is cha ac e ized by a pe son who clea ly does no know he subjec a ea o he han h ough wha may be e med \"common knowledge\" o , a bes , a b ie o e iew o he li e a u e.  A  Pseudo skep ic's \"opinions\" a e based p ima ily on an emo ional a i ude owa ds he subjec ma e a he han wha ew \" ac s\" he knows.  I s a psychological de ense he uses o sho e up his s a us, he alidi y o his wo k, and o cope wi h hings ha igh en him. \n\nA eal Skep ic is a iend wi h a di e ence o opinion based on a genuine desi e o help and su icien da a on he subjec a hand o know wha he/she is alking abou .  We, as Scien is s mus always ha e a heal h dose o eal Skep icism.  O he wise we isk being he exac in e se o he Pseudo skep ic--- he \"FLAKE\".  The Flake is he ype who will belie e any hing.  Jus as he Pseudo Skep ic has a need o ejec hings on emo ional g ounds, he Flake has a need o accep EVERYTHING on emo ional g ounds.  Any shadow,  sound, o co ne o he eye lash jus HAS o be a ghos o spi i . ----o wha e e .  I hink you know he ype, and   hese \" lakes\" a e wha Pseudo skep ics accuse us who a e se ious abou pa ano mal s udies  o being.  Pe haps i s one o he easons hey ge us so ang y. \n\n\n\n\n\nRj as e e @...> Sen by: EVP-ITC@yahoog oups.com \n03/04/2010 09:48 AM \n\n\n\n\nPlease espond oEVP-ITC@yahoog oups.com\n\n\n\n\n\nTo\nEVP-ITC@yahoog oups.com \n\n\ncc\n\n\n\nSubjec \nRe: [EVP-ITC] Wha he skepdicks missing\n\n\n\n\n\n  \n\n\n\n\nI' e hea d he same said o he e p esea che s!  Bu i 's no ha simple in ei he case: he las block ha you e e ence has small p in ha says \"Compa e he hypo hesis o he expe imen 's conclusion\".  Which o cou se you can' do unless you al eady isi ed he hypo hesis block and ha e a hypo hesis o which o compa e.  Tha in u n has small p in which says \"p edic he ou come o he p oblem\", which o cou se you can' do ei he unless you' e al eady isi ed he ea lie block o Pu pose (\"s a e he p oblem\").\n\nI don' hink i 's help ul o deny good e idence, whe he i is good e idence om someone claiming o ha e de ec ed spi i s, o whe he i is good e idence om someone claiming ha people can mis ake noise o speech o andom adio unings o spi i con ol.  Tha 's why he scien i ic me hod is aluable: i keeps bo h he skep ic and he belie e eal.\n\n--- On Wed, 3/3/10, F ank Sump ion gmail.com> w o e: F om: F ank Sump ion gmail.com>\n\nSubjec : [EVP-ITC] Wha he skepdicks missing [1 A achmen ]To: e p-i c@yahoog oups.comDa e: Wednesday, Ma ch 3, 2010, 8:25 PM  \nThey all jus skip o bo om.    F-S"}