{"id": "16822", "subject": "Re: [EVP-ITC] Re: What the skepdicks r missing", "author": "Zack Widup", "timestamp": "2010-03-05T16:48:59Z", "full_text": "The whole thing hinges on TRUST. I have a lot of EVP I&#39;ve recorded, one of\nwhich blatantly shows something &quot;paranormal&quot; occurring by actual evidence\navailable. But anyone listening, not trusting the originator, can say it was\nfaked. There&#39;s no way to prove it wasn&#39;t, to their satisfaction. If I were\nto send these EVP to them, they&#39;d just wave it off as made up or altered by\nme, I&#39;m sure - which ISN&#39;T the case. But these guys have no idea who to\ntrust and who not to trust. There ARE some trustworthy people out there.\n\nZack\n\nOn Fri, Mar 5, 2010 at 10:12 AM, Urkel23 &lt;urkel23@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Yeah Frank, i saw someone challenged me on there. It&#39;s pointless to apply\n&gt; for that, they would make the conditions unfavorable to retrieve anything at\n&gt; all. It&#39;s all a scam over there, you can&#39;t prove anything in this field so i\n&gt; think JREF was made for the fun of it.\n&gt;\n&gt; -Steve H.\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Frank Sumption\n&gt; &lt;purplealiengirl@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; On the skepdork blog someone is offering the JREF challenge, as if there\n&gt; is\n&gt; &gt; a chance in hell of any honest evaluation of any results, think I&#39;ll\n&gt; pass,\n&gt; &gt; and 2 1/2 years, their money will be worthless anyway, and.. money is an\n&gt; &gt; alien concept.\n&gt; &gt;\n&gt; &gt; F-S\n&gt; &gt;\n&gt; &gt; On Thu, Mar 4, 2010 at 2:23 PM, Alyson Gannon &lt;alysongannon@...&gt;wrote:\n&gt;\n&gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; I&#39;m new here and just chiming in with my two cents....\n&gt; &gt; &gt;\n&gt; &gt; &gt; As a practicing medium I do believe Spirits get stuck. There is a\n&gt; &gt; &gt; different energetic feeling I receive when connecting with someone who\n&gt; has\n&gt; &gt; &gt; truly crossed over and is now &quot;in spirit&quot; versus someone who has not.\n&gt; &gt; &gt; Those who are stuck either do not realize they have died or they are\n&gt; &gt; &gt; attached to our Earth plane (be it a particular person or event) and\n&gt; don&#39;t\n&gt; &gt; &gt; want to or know how to leave. I believe it is those stuck individuals\n&gt; who\n&gt; &gt; &gt; are often behind the rattle & clatter in hauntings---although this\n&gt; topic is\n&gt; &gt; &gt; still new to me.\n&gt; &gt; &gt;\n&gt; &gt; &gt; For those who have actually crossed over (and I believe this is the\n&gt; &gt; &gt; majority of souls), they return to Spirit and become the light & love\n&gt; they\n&gt; &gt; &gt; came from. Spirits have much better things to do than haunt us, they\n&gt; &gt; &gt; continue to learn and evolve on the other side. However, they do enjoy\n&gt; &gt; &gt; communicating with us, especially letting their loved ones know they\n&gt; are ok.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Best,\n&gt; &gt; &gt; Alyson\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; On Thu, Mar 4, 2010 at 12:05 PM, Frank Sumption &lt;purplealiengirl@...\n&gt;\n&gt; &gt; &gt; &gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt; Just like I am skeptical about hauntings, not that I don&#39;t believe\n&gt; &gt; &gt;&gt; something is going on, I don&#39;t think there are stuck spirits, so I\n&gt; think\n&gt; &gt; &gt;&gt; hauntings are a show for the living.\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt; Frank-S\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt; On Thu, Mar 4, 2010 at 10:32 AM, Michelle Ayers &lt;diver4skynsea@...&gt;wrote:\n&gt;\n&gt;\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt;&gt; Wow, Tom...excellent way to sort and define the differences. Do you\n&gt; mind\n&gt; &gt; &gt;&gt;&gt; if I quote you on that? Would like to share that thought with some\n&gt; friends I\n&gt; &gt; &gt;&gt;&gt; was just discussing that point with...\n&gt; &gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt;&gt; M\n&gt; &gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt;&gt; (have not formally introduced myself, but very much enjoying the work\n&gt; and\n&gt; &gt; &gt;&gt;&gt; discussions here. Thanks to you all.)\n&gt; &gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt;&gt; Michelle D. Ayers; Sent from iPhone\n&gt; &gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt;&gt; On Mar 4, 2010, at 8:14 AM, Tom_Ray@... wrote:\n&gt; &gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt;&gt; What Frank is referring to is more properly termed a\n&gt; &quot;Pseudo-Skeptic&quot;.\n&gt; &gt; &gt;&gt;&gt; Indeed Skepticism is a vital part of scientific investigations, but\n&gt; it&#39;s\n&gt; &gt; &gt;&gt;&gt; Skepticism based on consideration of the facts and expressing a\n&gt; caution or\n&gt; &gt; &gt;&gt;&gt; difference of opinion is what is useful in the Scientific community.\n&gt; A\n&gt; &gt; &gt;&gt;&gt; pseudo Skeptic is characterized by a person who clearly does not know\n&gt; the\n&gt; &gt; &gt;&gt;&gt; subject area other than through what may be termed &quot;common knowledge&quot;\n&gt; or, at\n&gt; &gt; &gt;&gt;&gt; best, a brief overview of the literature. A Pseudo skeptic&#39;s\n&gt; &quot;opinions&quot;\n&gt; &gt; &gt;&gt;&gt; are based primarily on an emotional attitude towards the subject\n&gt; matter\n&gt; &gt; &gt;&gt;&gt; rather than what few &quot;facts&quot; he knows. Its a psychological defense he\n&gt; uses\n&gt; &gt; &gt;&gt;&gt; to shore up his status, the validity of his work, and to cope with\n&gt; things\n&gt; &gt; &gt;&gt;&gt; that frighten him.\n&gt; &gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt;&gt; A real Skeptic is a friend with a difference of opinion based on a\n&gt; &gt; &gt;&gt;&gt; genuine desire to help and sufficient data on the subject at hand to\n&gt; know\n&gt; &gt; &gt;&gt;&gt; what he/she is talking about. We, as Scientists must always have a\n&gt; health\n&gt; &gt; &gt;&gt;&gt; dose of real Skepticism. Otherwise we risk being the exact inverse of\n&gt; the\n&gt; &gt; &gt;&gt;&gt; Pseudo skeptic---the &quot;FLAKE&quot;. The Flake is the type who will believe\n&gt; &gt; &gt;&gt;&gt; anything. Just as the Pseudo Skeptic has a need to reject things on\n&gt; &gt; &gt;&gt;&gt; emotional grounds, the Flake has a need to accept EVERYTHING on\n&gt; emotional\n&gt; &gt; &gt;&gt;&gt; grounds. Any shadow, sound, or corner of the eye flash just HAS to be\n&gt; a\n&gt; &gt; &gt;&gt;&gt; ghost or spirit. ----or whatever. I think you know the type, and\n&gt; these\n&gt; &gt; &gt;&gt;&gt; &quot;flakes&quot; are what Pseudo skeptics accuse us who are serious about\n&gt; paranormal\n&gt; &gt; &gt;&gt;&gt; studies of being. Perhaps its one of the reasons they get us so\n&gt; angry.\n&gt; &gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt;&gt; *Rj &lt;rasterer@...&gt;*\n&gt;\n&gt; &gt; &gt;&gt;&gt; Sent by: EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;\n&gt; &gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt;&gt; 03/04/2010 09:48 AM\n&gt; &gt; &gt;&gt;&gt; Please respond to\n&gt; &gt; &gt;&gt;&gt; EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;\n&gt; &gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt;&gt; To\n&gt; &gt; &gt;&gt;&gt; EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;\n&gt; &gt; &gt;&gt;&gt; cc\n&gt; &gt; &gt;&gt;&gt; Subject\n&gt; &gt; &gt;&gt;&gt; Re: [EVP-ITC] What the skepdicks r missing\n&gt; &gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt;&gt; I&#39;ve heard the same said for the evp researchers! But it&#39;s not that\n&gt; &gt; &gt;&gt;&gt; simple in either case:\n&gt; &gt; &gt;&gt;&gt; the last block that you reference has small print that says &quot;Compare\n&gt; the\n&gt; &gt; &gt;&gt;&gt; hypothesis to the experiment&#39;s conclusion&quot;. Which of course you can&#39;t\n&gt; do\n&gt; &gt; &gt;&gt;&gt; unless you already visited the hypothesis block and have a hypothesis\n&gt; to\n&gt; &gt; &gt;&gt;&gt; which to compare. That in turn has small print which says &quot;predict\n&gt; the\n&gt; &gt; &gt;&gt;&gt; outcome of the problem&quot;, which of course you can&#39;t do either unless\n&gt; you&#39;ve\n&gt; &gt; &gt;&gt;&gt; already visited the earlier block of Purpose (&quot;state the problem&quot;).\n&gt; &gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt;&gt; I don&#39;t think it&#39;s helpful to deny good evidence, whether it is good\n&gt; &gt; &gt;&gt;&gt; evidence from someone claiming to have detected spirits, or whether\n&gt; it is\n&gt; &gt; &gt;&gt;&gt; good evidence from someone claiming that people can mistake noise for\n&gt; speech\n&gt; &gt; &gt;&gt;&gt; or random radio tunings for spirit control. That&#39;s why the scientific\n&gt; &gt; &gt;&gt;&gt; method is valuable: it keeps both the skeptic and the believer real.\n&gt; &gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt;&gt; --- On *Wed, 3/3/10, Frank Sumption &lt;purplealiengirl@...&gt;* wrote:\n&gt; &gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt;&gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt;\n&gt; &gt; &gt;&gt;&gt; Subject: [EVP-ITC] What the skepdicks r missing [1 Attachment]\n&gt; &gt; &gt;&gt;&gt; To: evp-itc@yahoogroups.com &lt;evp-itc%40yahoogroups.com&gt;\n&gt; &gt; &gt;&gt;&gt; Date: Wednesday, March 3, 2010, 8:25 PM\n&gt; &gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt;&gt; They all just skip to tbottom.\n&gt; &gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt;&gt; F-S\n&gt; &gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nThe whole hing hinges on TRUST. I ha e a lo o EVP I' e eco ded, one o which bla an ly shows some hing \"pa ano mal\" occu ing by ac ual e idence a ailable. Bu anyone lis ening, no us ing he o igina o , can say i was aked. The e's no way o p o e i wasn' , o hei sa is ac ion. I I we e o send hese EVP o hem, hey'd jus wa e i o as made up o al e ed by me, I'm su e - which ISN'T he case. Bu hese guys ha e no idea who o us and who no o us . The e ARE some us wo hy people ou he e.\n\n \nZack\nOn F i, Ma 5, 2010 a 10:12 AM, U kel23 u kel23@...> w o e:\n\n  \n\n\n\nYeah F ank, i saw someone challenged me on he e. I 's poin less o apply o ha , hey would make he condi ions un a o able o e ie e any hing a all. I 's all a scam o e he e, you can' p o e any hing in his ield so i hink JREF was made o he un o i .\n-S e e H. \n--- In EVP-ITC@yahoog oups.com, F ank Sump ion w o e:>> On he skepdo k blog someone is o e ing he JREF challenge, as i he e is\n> a chance in hell o any hones e alua ion o any esul s, hink I'll pass,> and 2 1/2 yea s, hei money will be wo hless anyway, and.. money is an> alien concep .> > F-S> \n> On Thu, Ma 4, 2010 a 2:23 PM, Alyson Gannon w o e: \n> > >> >> > I'm new he e and jus chiming in wi h my wo cen s....> >> > As a p ac icing medium I do belie e Spi i s ge s uck. The e is a> > di e en ene ge ic eeling I ecei e when connec ing wi h someone who has\n> > uly c ossed o e and is now \"in spi i \" e sus someone who has no .> > Those who a e s uck ei he do no ealize hey ha e died o hey a e> > a ached o ou Ea h plane (be i a pa icula pe son o e en ) and don' \n> > wan o o know how o lea e. I belie e i is hose s uck indi iduals who> > a e o en behind he a le & cla e in haun ings---al hough his opic is> > s ill new o me.> >\n> > Fo hose who ha e ac ually c ossed o e (and I belie e his is he> > majo i y o souls), hey e u n o Spi i and become he ligh & lo e hey> > came om. Spi i s ha e much be e hings o do han haun us, hey\n> > con inue o lea n and e ol e on he o he side. Howe e , hey do enjoy> > communica ing wi h us, especially le ing hei lo ed ones know hey a e ok.> >> > Bes ,> > Alyson\n> >> >> >> >> > On Thu, Ma 4, 2010 a 12:05 PM, F ank Sump ion > > > w o e:> >> >>> >>> >> Jus like I am skep ical abou haun ings, no ha I don' belie e> >> some hing is going on, I don' hink he e a e s uck spi i s, so I hink\n> >> haun ings a e a show o he li ing.> >>> >>> >>> >> F ank-S> >>> >> On Thu, Ma 4, 2010 a 10:32 AM, Michelle Aye s w o e: \n> >>> >>>> >>>> >>> Wow, Tom...excellen way o so and de ine he di e ences. Do you mind> >>> i I quo e you on ha ? Would like o sha e ha hough wi h some iends I\n> >>> was jus discussing ha poin wi h...> >>>> >>> M> >>>> >>> (ha e no o mally in oduced mysel , bu e y much enjoying he wo k and> >>> discussions he e. Thanks o you all.)\n> >>>> >>> Michelle D. Aye s; Sen om iPhone> >>>\n> >>> On Ma 4, 2010, a 8:14 AM, Tom_Ray@... w o e:> >>>> >>>> >>>> >>>> >>> Wha F ank is e e ing o is mo e p ope ly e med a \"Pseudo-Skep ic\".\n> >>> Indeed Skep icism is a i al pa o scien i ic in es iga ions, bu i 's> >>> Skep icism based on conside a ion o he ac s and exp essing a cau ion o > >>> di e ence o opinion is wha is use ul in he Scien i ic communi y. A\n> >>> pseudo Skep ic is cha ac e ized by a pe son who clea ly does no know he> >>> subjec a ea o he han h ough wha may be e med \"common knowledge\" o , a > >>> bes , a b ie o e iew o he li e a u e. A Pseudo skep ic's \"opinions\"\n> >>> a e based p ima ily on an emo ional a i ude owa ds he subjec ma e > >>> a he han wha ew \" ac s\" he knows. I s a psychological de ense he uses> >>> o sho e up his s a us, he alidi y o his wo k, and o cope wi h hings\n> >>> ha igh en him.> >>>> >>> A eal Skep ic is a iend wi h a di e ence o opinion based on a> >>> genuine desi e o help and su icien da a on he subjec a hand o know\n> >>> wha he/she is alking abou . We, as Scien is s mus always ha e a heal h> >>> dose o eal Skep icism. O he wise we isk being he exac in e se o he> >>> Pseudo skep ic--- he \"FLAKE\". The Flake is he ype who will belie e\n> >>> any hing. Jus as he Pseudo Skep ic has a need o ejec hings on> >>> emo ional g ounds, he Flake has a need o accep EVERYTHING on emo ional> >>> g ounds. Any shadow, sound, o co ne o he eye lash jus HAS o be a\n> >>> ghos o spi i . ----o wha e e . I hink you know he ype, and hese> >>> \" lakes\" a e wha Pseudo skep ics accuse us who a e se ious abou pa ano mal> >>> s udies o being. Pe haps i s one o he easons hey ge us so ang y.\n> >>>> >>>> >>>> >>>> >>>> >>>> >>> *Rj * \n> >>> Sen by: EVP-ITC@yahoog oups.com> >>>> >>> 03/04/2010 09:48 AM> >>> Please espond o\n> >>> EVP-ITC@yahoog oups.com> >>>> >>> To> >>> EVP-ITC@yahoog oups.com\n> >>> cc> >>> Subjec > >>> Re: [EVP-ITC] Wha he skepdicks missing> >>>> >>>> >>>> >>>> >>>\n> >>>> >>> I' e hea d he same said o he e p esea che s! Bu i 's no ha > >>> simple in ei he case:> >>> he las block ha you e e ence has small p in ha says \"Compa e he\n> >>> hypo hesis o he expe imen 's conclusion\". Which o cou se you can' do> >>> unless you al eady isi ed he hypo hesis block and ha e a hypo hesis o> >>> which o compa e. Tha in u n has small p in which says \"p edic he\n> >>> ou come o he p oblem\", which o cou se you can' do ei he unless you' e> >>> al eady isi ed he ea lie block o Pu pose (\"s a e he p oblem\").> >>>\n> >>> I don' hink i 's help ul o deny good e idence, whe he i is good> >>> e idence om someone claiming o ha e de ec ed spi i s, o whe he i is> >>> good e idence om someone claiming ha people can mis ake noise o speech\n> >>> o andom adio unings o spi i con ol. Tha 's why he scien i ic> >>> me hod is aluable: i keeps bo h he skep ic and he belie e eal.> >>>> >>> --- On *Wed, 3/3/10, F ank Sump ion * w o e:\n> >>>> >>> F om: F ank Sump ion \n> >>> Subjec : [EVP-ITC] Wha he skepdicks missing [1 A achmen ]> >>> To: e p-i c@yahoog oups.com> >>> Da e: Wednesday, Ma ch 3, 2010, 8:25 PM\n> >>>> >>>> >>>> >>> They all jus skip o bo om.> >>>> >>> F-S> >>>> >>>> >>>\n> >>> > > >>"}