{"id": "16823", "subject": "Re: What the skeptics r missing", "author": "rasterer", "timestamp": "2010-03-05T14:27:55Z", "full_text": "Yep.  And I agree sometimes it&#39;s obvious, and sometimes it isn&#39;t, who is a cynic and who is a flake.  One sympptom of both seems to be they focus on emotional outbursts and name calling.  Like children, I suppose.\n\n\n--- In EVP-ITC@yahoogroups.com, Tom_Ray@... wrote:\n&gt;\n&gt; Indeed!  A Pseudo EVP Researcher might also be considered &quot;A Flake&quot; right \n&gt; in there with the tin foil hat crowd.\n&gt; Pseudo Skeptics and flakes are opposite sides of the same coin.  One uses \n&gt; denial  of things that make him uncomfortable to ease his fears, the other \n&gt; embraces the &quot;unknown&quot; also for personal emotional comfort.  With both of \n&gt; these types you have a lack of information and data.  The Pseudo skeptic \n&gt; does not have enough information about what paranormal studies is about, \n&gt; and the Flake will often be unaware of or refuse to consider perfectly \n&gt; reasonable alternative explanations for what he finds.\n&gt; \n&gt; Neither of these types are &quot;real scientists&quot;.   I tend to rag on the \n&gt; Pseudo skeptics though more than the &quot;Flakes&quot; and the &quot;Quacks&quot; (a quack is \n&gt; a purposely dishonest fraud) as the pseudo skeptics seem to be more \n&gt; prevalent and less obviously the fools they are---having undue influence \n&gt; over the general public.\n&gt; \n&gt; TOM \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Rj &lt;rasterer@...&gt; \n&gt; Sent by: EVP-ITC@yahoogroups.com\n&gt; 03/04/2010 02:16 PM\n&gt; Please respond to\n&gt; EVP-ITC@yahoogroups.com\n&gt; \n&gt; \n&gt; To\n&gt; EVP-ITC@yahoogroups.com\n&gt; cc\n&gt; \n&gt; Subject\n&gt; Re: [EVP-ITC] What the skepdicks r missing\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;  \n&gt; \n&gt; \n&gt; That&#39;s true, though the word for Pseudo-skeptic in your context is also \n&gt; &quot;Cynic&quot;.  Which also brings to light the &#39;Pseudo-EVP-researcher&#39;.  To \n&gt; re-quote your article switching the terms, it comes out just as true:\n&gt; \n&gt; ... Indeed Skepticism is a vital part of scientific investigations, but \n&gt; it&#39;s Skepticism based on consideration of the facts and  expressing a \n&gt; caution or difference of opinion is what is useful in the Scientific \n&gt; community.  A Pseudo-EVP-researcher is characterized by a person who \n&gt; clearly does not know the subject area other than through what may be \n&gt; termed &quot;common knowledge&quot; or, at best, a brief overview of the  tv.  A  \n&gt; Pseudo-EVP-researcher&#39;s &quot;opinions&quot; are based primarily on an emotional \n&gt; attitude towards the subject matter rather than what few &quot;facts&quot; he knows. \n&gt;  Its a psychological defense he uses to shore up his status, the validity \n&gt; of his work, and to cope with things that frighten him. \n&gt; \n&gt; A real EVP-researcher is a friend with a difference of opinion based on a \n&gt; genuine desire to help and sufficient data on the subject at hand to know \n&gt; what he/she is talking about.  We, as Scientists must always have a health \n&gt; dose of real Skepticism.  Otherwise we risk being the exact inverse of the \n&gt; cynic ---the &quot;FLAKE&quot;.  The Flake is the type who will believe anything. \n&gt; Just as the cynic has a need to reject things on emotional grounds, the \n&gt; Flake has a need to accept EVERYTHING on emotional grounds.  Any shadow, \n&gt; sound, or corner of the eye flash just HAS to be a ghost or spirit. ----or \n&gt; whatever.  I think you know the type, and   these &quot;flakes&quot; are what cynics \n&gt; accuse us who are serious about paranormal studies  of being.  Perhaps its \n&gt; one of the reasons they get us so angry. \n&gt; \n&gt; --- On Thu, 3/4/10, Tom_Ray@... &lt;Tom_Ray@...&gt; \n&gt; wrote:\n&gt; \n&gt; From: Tom_Ray@... &lt;Tom_Ray@...&gt;\n&gt; Subject: Re: [EVP-ITC] What the skepdicks r missing\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Thursday, March 4, 2010, 8:14 AM\n&gt; \n&gt;  \n&gt; \n&gt; What Frank is referring to is more properly termed a &quot;Pseudo-Skeptic&quot;. \n&gt; Indeed Skepticism is a vital part of scientific investigations, but it&#39;s \n&gt; Skepticism based on consideration of the facts and  expressing a caution \n&gt; or difference of opinion is what is useful in the Scientific community.  A \n&gt; pseudo Skeptic is characterized by a person who clearly does not know the \n&gt; subject area other than through what may be termed &quot;common knowledge&quot; or, \n&gt; at best, a brief overview of the literature.  A  Pseudo skeptic&#39;s \n&gt; &quot;opinions&quot; are based primarily on an emotional attitude towards the \n&gt; subject matter rather than what few &quot;facts&quot; he knows.  Its a psychological \n&gt; defense he uses to shore up his status, the validity of his work, and to \n&gt; cope with things that frighten him. \n&gt; \n&gt; A real Skeptic is a friend with a difference of opinion based on a genuine \n&gt; desire to help and sufficient data on the subject at hand to know what \n&gt; he/she is talking about.  We, as Scientists must always have a health dose \n&gt; of real Skepticism.  Otherwise we risk being the exact inverse of the \n&gt; Pseudo skeptic---the &quot;FLAKE&quot;.  The Flake is the type who will believe \n&gt; anything.  Just as the Pseudo Skeptic has a need to reject things on \n&gt; emotional grounds, the Flake has a need to accept EVERYTHING on emotional \n&gt; grounds.  Any shadow,  sound, or corner of the eye flash just HAS to be a \n&gt; ghost or spirit. ----or whatever.  I think you know the type, and   these \n&gt; &quot;flakes&quot; are what Pseudo skeptics accuse us who are serious about \n&gt; paranormal studies  of being.  Perhaps its one of the reasons they get us \n&gt; so angry. \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Rj &lt;rasterer@yahoo. com&gt; \n&gt; Sent by: EVP-ITC@yahoogroups .com \n&gt; 03/04/2010 09:48 AM \n&gt; \n&gt; Please respond to\n&gt; EVP-ITC@yahoogroups .com\n&gt; \n&gt; \n&gt; \n&gt; To\n&gt; EVP-ITC@yahoogroups .com \n&gt; cc\n&gt; \n&gt; Subject\n&gt; Re: [EVP-ITC] What the skepdicks r missing\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;  \n&gt; \n&gt; \n&gt; I&#39;ve heard the same said for the evp researchers!  But it&#39;s not that \n&gt; simple in either case:\n&gt; the last block that you reference has small print that says &quot;Compare the \n&gt; hypothesis to the experiment&#39;s conclusion&quot;.  Which of course you can&#39;t do \n&gt; unless you already visited the hypothesis block and have a hypothesis to \n&gt; which to compare.  That in turn has small print which says &quot;predict the \n&gt; outcome of the problem&quot;, which of course you can&#39;t do either unless you&#39;ve \n&gt; already visited the earlier block of Purpose (&quot;state the problem&quot;).\n&gt; \n&gt; I don&#39;t think it&#39;s helpful to deny good evidence, whether it is good \n&gt; evidence from someone claiming to have detected spirits, or whether it is \n&gt; good evidence from someone claiming that people can mistake noise for \n&gt; speech or random radio tunings for spirit control.  That&#39;s why the \n&gt; scientific method is valuable: it keeps both the skeptic and the believer \n&gt; real.\n&gt; \n&gt; --- On Wed, 3/3/10, Frank Sumption &lt;purplealiengirl@ gmail.com&gt; wrote: \n&gt; \n&gt; From: Frank Sumption &lt;purplealiengirl@ gmail.com&gt;\n&gt; Subject: [EVP-ITC] What the skepdicks r missing [1 Attachment]\n&gt; To: evp-itc@yahoogroups .com\n&gt; Date: Wednesday, March 3, 2010, 8:25 PM\n&gt; \n&gt;  \n&gt; They all just skip to tbottom. \n&gt;  \n&gt;  F-S\n&gt;"}