{"id": "1684", "subject": "Re: [EVP-ITC] Not a happy EVPer!", "author": "Frank Sumption", "timestamp": "2007-07-27T21:49:41Z", "full_text": "I don&#39;t know what kind of breakthroughs you&#39;d expect to make. My system is \npretty much like EVPmaker, and you can do the same thing by tuning a radio \nacross it&#39;s band manually, while recording. There&#39;s not really a special \ntechnology you need. It&#39;s mostly providing something the spirits/entities \ncan use to form thier voices, and they have most of the control on their \nside. I think most of all, you can&#39;t approach it like you already know \neverything about the paranormal, I think it takes an open mindedness, an \nalmost childlike attitude. You have to remember the people you are \nattempting to contact have all their mental faculties, we on the hand are \nquite limited. I think maybe you&#39;re basing your expectations on what Moon \nclaims, most of which is highly exagerated.\n\nI&#39;m just now having a go-round with people that claim to be paranormal \nexperts, they won&#39;t use the boxes as I recommend, yet proceed to tell the \nworld how it really works. It always creates hard feelings on both sides.  I \nsuggest you work on some of the simple methods first, they can be just as \neffective as an electronic system, and you may learn more. I&#39;m not even sure \nI want to make any more boxes.\n\nFrank-S\n\n\n&gt;From: erick hunter &lt;erick_hunter9@...&gt;\n&gt;Reply-To: EVP-ITC@yahoogroups.com\n&gt;To: EVP-ITC@yahoogroups.com\n&gt;Subject: Re: [EVP-ITC] Not a happy EVPer!\n&gt;Date: Fri, 27 Jul 2007 12:57:12 -0700 (PDT)\n&gt;\n&gt;Mr Sumption, I desire very much to obtain a &quot;box&quot;. What would it take to \n&gt;get one??? I am a serious researcher with over 40 yrs. of investigation \n&gt;under my belt. After reading and reviewing everything I could find \n&gt;concerning your device, I, personally, have the greatest confidence in \n&gt;making milestone leaps of progress with it. I would be very pleased to hear \n&gt;back from you soonest. Thank you in advance.    --Roderick Pyatt, Ph.D \n&gt;(Paranormal Psychology)\n&gt;\n&gt;\n&gt;\n\n_________________________________________________________________\nhttp://liveearth.msn.com"}