{"id": "16859", "subject": "Re: Paranormal Investigation Into 2012 Via Ghost Box EVP Part 2", "author": "eastern_paranormal", "timestamp": "2010-03-18T13:12:12Z", "full_text": "Hi Frank,\n\nI just posted a negative one I have never posted in public in our Eastern Paranormal folder. By negative, I mean how they describe 2012 verses current New Age Thought. I posted the one titeled : 2012 Q&A? Answer Fire.....Skulls Melt\n\nThese sort of replies are what my husband calls my &quot;Night Light Ghost Boxing,&quot; because when I lay and think about them, then I get up and turn on my night light. \n\nWe will keep on asking the 2012 questions as part of our 2012 series, but honestly if nothing else it makes you think a lot about your own life and what happens when we pass. I am much more aware of my actions now, and make sure that I always treat others and I would like to be treated.  \n\nGab\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  Ya mean like this? &quot;They&quot; always say they&#39;re coming for me--and I\n&gt; think--yeah, me and a million others that think they have a cosmic\n&gt; connection--not meaning to sound negative or mean. This is from a ransom\n&gt; mode recording last weekend. Random mode is really hard to get to run\n&gt; consistently, as I did in the first boxes, and I have no idea why it doesn&#39;t\n&gt; want to work anymore.\n&gt; \n&gt;  Reversed, at 12 seconds &quot;the earth will die&quot;. My guys are not optimistic\n&gt; about Earth&#39;s future in the slightest. Supposedly, and I&#39;ve picked up bits\n&gt; and pieces, that seem to indicate there are a large number of ET souls here\n&gt; that supposedly will get picked up, but I&#39;m not holding my breath waiting.\n&gt; \n&gt;  Frank-S\n&gt; On Mon, Mar 15, 2010 at 8:49 PM, eastern_paranormal &lt;eparanormal@...&gt;wrote:\n&gt; \n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Frank,\n&gt; &gt;\n&gt; &gt; Thank you for checking out my videos. I feel honored. I must tell you it\n&gt; &gt; took A LOT for me to put these 2012 clips out there. I had to do some soul\n&gt; &gt; searching. I have never been attracted to alien stuff, it spooks me out.\n&gt; &gt; I&#39;ve gotten a couple of them that keep saying things like &quot;Gabreael\n&gt; &gt; abducted, Gabreael don&#39;t fear us, Gabbie we&#39;re on our way.&quot; I just posted\n&gt; &gt; one of the abducted ones in the files on here. When I started asking about\n&gt; &gt; parallel universe they just started pouring in and will not shut up. No\n&gt; &gt; matter which box I use now (I&#39;ve made 5). Everyone is saying it&#39;s just\n&gt; &gt; another day (Dec 21, 2012), or it&#39;s a new awakening. Very few are really\n&gt; &gt; addressing the &quot;What if&quot; on the other side of the issue. So we are simply\n&gt; &gt; asking the questions and posting. You are right about the AM band thing. I\n&gt; &gt; have gotten some REALLY scary ones on AM that I haven&#39;t posted. They are not\n&gt; &gt; cursing, but they are graphic in what they say about earth in 2012. Last\n&gt; &gt; time I did an AM band sweep I slept with a night light on for a week :P\n&gt; &gt;\n&gt; &gt; Gabreael\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Frank Sumption\n&gt; &gt; &lt;purplealiengirl@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; Interesting. My guys were going on and on tonight about 2012, the\n&gt; &gt; &quot;monster&quot;\n&gt; &gt; &gt; Wormwood, the end of the world. Mostly I get that stuff if I&#39;m not\n&gt; &gt; &gt; recording. You have to be very cautious about questions, or at least I\n&gt; &gt; do,\n&gt; &gt; &gt; as they tend to tell me what they think I want to hear, so usually I\n&gt; &gt; don&#39;t\n&gt; &gt; &gt; ask.\n&gt; &gt; &gt;\n&gt; &gt; &gt; F-S\n&gt; &gt; &gt;\n&gt; &gt; &gt; On Sat, Mar 13, 2010 at 8:40 PM, eastern_paranormal &lt;eparanormal@&gt;wrote:\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Hi Everyone,\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Here is Eastern Paranormal&#39;s latest ghost box clip:\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Paranormal Investigation Into 2012 Via Ghost Box EVP Part 2\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; http://www.youtube.com/watch?v=HMh6e3uiCr8\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Tanx!\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Gabreael\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt; &gt;  \n&gt; &gt;\n&gt;"}