{"id": "16879", "subject": "Re: [EVP-ITC] Re: Paranormal Investigation Into 2012 Via Ghost Box \tEVP Part 2", "author": "Zack Widup", "timestamp": "2010-03-26T22:01:17Z", "full_text": "Was this posted here already?\n\nhttp://www.nasa.gov/topics/earth/features/2012-guest.html\n\nZack\n\n\nOn Fri, Mar 26, 2010 at 3:26 PM, neferkit &lt;Neferkit@verizon.net&gt; wrote:\n\n&gt;\n&gt;\n&gt; Since most of the 2012 doomsday prophecies focus on the Mayan calendar, I\n&gt; thought I&#39;d chimed in. I&#39;m 1/2 Cherokee and have a PhD in Ethnic Studies\n&gt; with a specialization in Native American Studies. I know many Maya people\n&gt; and have studied their mythology and culture. I hate to break anyone&#39;s\n&gt; doomsday bubbles, but the Mayan calendar did not end with the date Dec. 21,\n&gt; 2012. That was the end date on one stellae. There are many others that go\n&gt; beyond that date, including one that goes well into the 4000s. Plus, there\n&gt; are many contemporary Maya daykeepers who continue working on the calendar.\n&gt; So, to those using the Mayan calendar as a prophetic compass, I really\n&gt; wouldn&#39;t worry about the world coming to an end in 2012. Please don&#39;t take\n&gt; this post as pompous snottiness on my part. I see a lot of fear out there\n&gt; about 2012 and I&#39;m just trying to alleviate that.\n&gt;\n&gt; Pat\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Frank Sumption\n&gt; &lt;purplealiengirl@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; I was watching the video on YouTube, and at 22 seconds &quot;all is doomed&quot;,\n&gt; &gt; that&#39;s what I get too, and have gotten it since box day one. 2.8 years to\n&gt; &gt; go! Bwa--bwahahahhaha\n&gt; &gt;\n&gt; &gt; The new age brainiacs always say it&#39;s a shift in consciousness--yeah,\n&gt; death\n&gt; &gt; can be considered a shift of the conciousness! We&#39;ll all live happily\n&gt; ever\n&gt; &gt; after that magic date--as we slowly run out of drinkable water, oil,\n&gt; land,\n&gt; &gt; food--you name it.\n&gt; &gt;\n&gt; &gt; Frank-S\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; On Sun, Mar 14, 2010 at 11:55 PM, Frank Sumption\n&gt; &gt; &lt;purplealiengirl@...&gt;wrote:\n&gt;\n&gt; &gt;\n&gt; &gt; &gt; Interesting. My guys were going on and on tonight about 2012, the\n&gt; &gt; &gt; &quot;monster&quot; Wormwood, the end of the world. Mostly I get that stuff if\n&gt; I&#39;m not\n&gt; &gt; &gt; recording. You have to be very cautious about questions, or at least I\n&gt; do,\n&gt; &gt; &gt; as they tend to tell me what they think I want to hear, so usually I\n&gt; don&#39;t\n&gt; &gt; &gt; ask.\n&gt; &gt; &gt;\n&gt; &gt; &gt; F-S\n&gt; &gt; &gt;\n&gt; &gt; &gt; On Sat, Mar 13, 2010 at 8:40 PM, eastern_paranormal &lt;eparanormal@...\n&gt;\n&gt; &gt; &gt; &gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt; Hi Everyone,\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt; Here is Eastern Paranormal&#39;s latest ghost box clip:\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt; Paranormal Investigation Into 2012 Via Ghost Box EVP Part 2\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt; http://www.youtube.com/watch?v=HMh6e3uiCr8\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt; Tanx!\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt; Gabreael\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nWas his pos ed he e al eady?h p://www.nasa.go / opics/ea h/ ea u es/2012-gues .h mlZackOn F i, Ma 26, 2010 a 3:26 PM, ne e ki Ne e ki @...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n Since mos o he 2012 doomsday p ophecies ocus on he Mayan calenda , I hough I'd chimed in. I'm 1/2 Che okee and ha e a PhD in E hnic S udies wi h a specializa ion in Na i e Ame ican S udies. I know many Maya people and ha e s udied hei my hology and cul u e. I ha e o b eak anyone's doomsday bubbles, bu he Mayan calenda did no end wi h he da e Dec. 21, 2012. Tha was he end da e on one s ellae. The e a e many o he s ha go beyond ha da e, including one ha goes well in o he 4000s. Plus, he e a e many con empo a y Maya daykeepe s who con inue wo king on he calenda . So, o hose using he Mayan calenda as a p ophe ic compass, I eally wouldn' wo y abou he wo ld coming o an end in 2012. Please don' ake his pos as pompous sno iness on my pa . I see a lo o ea ou he e abou 2012 and I'm jus ying o alle ia e ha .\n\n\nPa \n\n--- In EVP-ITC@yahoog oups.com, F ank Sump ion w o e:\n>\n> I was wa ching he ideo on YouTube, and a 22 seconds \"all is doomed\",\n> ha 's wha I ge oo, and ha e go en i since box day one. 2.8 yea s o\n> go! Bwa--bwahahahhaha\n> \n> The new age b ainiacs always say i 's a shi in consciousness--yeah, dea h\n> can be conside ed a shi o he conciousness! We'll all li e happily e e \n> a e ha magic da e--as we slowly un ou o d inkable wa e , oil, land,\n> ood--you name i .\n> \n> F ank-S\n> \n> \n> \n> On Sun, Ma 14, 2010 a 11:55 PM, F ank Sump ion\n> w o e:\n> \n> > In e es ing. My guys we e going on and on onigh abou 2012, he\n> > \"mons e \" Wo mwood, he end o he wo ld. Mos ly I ge ha s u i I'm no \n> > eco ding. You ha e o be e y cau ious abou ques ions, o a leas I do,\n> > as hey end o ell me wha hey hink I wan o hea , so usually I don' \n> > ask.\n> >\n> > F-S\n> >\n> > On Sa , Ma 13, 2010 a 8:40 PM, eas e n_pa ano mal \n> > > w o e:\n> >\n> >>\n> >>\n> >> Hi E e yone,\n> >>\n> >> He e is Eas e n Pa ano mal's la es ghos box clip:\n> >>\n> >> Pa ano mal In es iga ion In o 2012 Via Ghos Box EVP Pa 2\n> >>\n> >> h p://www.you ube.com/wa ch? =HMh6e3uiC 8\n> >>\n> >> Tanx!\n> >>\n> >> Gab eael\n> >>\n> >> \n> >>\n> >\n> >\n>"}