{"id": "16878", "subject": "Re: Paranormal Investigation Into 2012 Via Ghost Box EVP Part 2", "author": "neferkit", "timestamp": "2010-03-26T21:26:07Z", "full_text": "Since most of the 2012 doomsday prophecies focus on the Mayan calendar, I thought I&#39;d chimed in. I&#39;m 1/2 Cherokee and have a PhD in Ethnic Studies with a specialization in Native American Studies. I know many Maya people and have studied their mythology and culture. I hate to break anyone&#39;s doomsday bubbles, but the Mayan calendar did not end with the date Dec. 21, 2012. That was the end date on one stellae. There are many others that go beyond that date, including one that goes well into the 4000s. Plus, there are many contemporary Maya daykeepers who continue working on the calendar. So, to those using the Mayan calendar as a prophetic compass, I really wouldn&#39;t worry  about the world coming to an end in 2012. Please don&#39;t take this post as pompous snottiness on my part. I see a lot of fear out there about 2012 and I&#39;m just trying to alleviate that.\n\nPat\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  I was watching the video on YouTube, and at 22 seconds &quot;all is doomed&quot;,\n&gt; that&#39;s what I get too, and have gotten it since box day one. 2.8 years to\n&gt; go! Bwa--bwahahahhaha\n&gt; \n&gt;  The new age brainiacs always say it&#39;s a shift in consciousness--yeah, death\n&gt; can be considered a shift of the conciousness!  We&#39;ll all live happily ever\n&gt; after that magic date--as we slowly run out of drinkable water, oil, land,\n&gt; food--you name it.\n&gt; \n&gt;  Frank-S\n&gt; \n&gt; \n&gt; \n&gt; On Sun, Mar 14, 2010 at 11:55 PM, Frank Sumption\n&gt; &lt;purplealiengirl@...&gt;wrote:\n&gt; \n&gt; &gt;  Interesting. My guys were going on and on tonight about 2012, the\n&gt; &gt; &quot;monster&quot; Wormwood, the end of the world. Mostly I get that stuff if I&#39;m not\n&gt; &gt; recording. You have to be very cautious about questions, or at least I do,\n&gt; &gt; as they tend to tell me what they think I want to hear, so usually I don&#39;t\n&gt; &gt; ask.\n&gt; &gt;\n&gt; &gt;  F-S\n&gt; &gt;\n&gt; &gt;   On Sat, Mar 13, 2010 at 8:40 PM, eastern_paranormal &lt;eparanormal@...\n&gt; &gt; &gt; wrote:\n&gt; &gt;\n&gt; &gt;&gt;\n&gt; &gt;&gt;\n&gt; &gt;&gt; Hi Everyone,\n&gt; &gt;&gt;\n&gt; &gt;&gt; Here is Eastern Paranormal&#39;s latest ghost box clip:\n&gt; &gt;&gt;\n&gt; &gt;&gt; Paranormal Investigation Into 2012 Via Ghost Box EVP Part 2\n&gt; &gt;&gt;\n&gt; &gt;&gt; http://www.youtube.com/watch?v=HMh6e3uiCr8\n&gt; &gt;&gt;\n&gt; &gt;&gt; Tanx!\n&gt; &gt;&gt;\n&gt; &gt;&gt; Gabreael\n&gt; &gt;&gt;\n&gt; &gt;&gt; \n&gt; &gt;&gt;\n&gt; &gt;\n&gt; &gt;\n&gt;"}