{"id": "16898", "subject": "Re: Franks box", "author": "maltesefalcon18", "timestamp": "2010-03-29T18:25:01Z", "full_text": "Personnelly have about 5 years as a EMT,10 years as an herbolist and another 20 in parapsychology.I really due belive that the voices the mentally ill hear aren,t necessaraly in their heads but out side influences.I have seen mentally ill people comment on subjects they new nothing about with details from some source outside of their normal awareness.I have also listened to the mentally ill and questioned their mental voices only to hear them speak on personnel matters that happend before the patient was ever born.Theres a book called 30 years among the      that gives clues on how these voices attach themselves to the livving, the author of the book was a surgeon in the 1920s that also became interrested in the strange happenings that began to happen after he had performned an         for the state medical exsaminer.The state I am in springfield,mo its getting ready to cut $500 million from the states health services across the board.I,m tryying to find as many alternatives for medical help to the millions who are getting ready to loose their health care services after may 7 2010 so far the best I can offer all these people is alternatives from herbol supplements to ,message therapy and traditional Qi Gong healing techniques.I do belive that theres got to be more to helpping then watching people slowly die for lack of medical care and treatment right here in the good old USA.Thats why  I,m willing to try Franks box and think outside the box for answers ,so yes I think The ghost box could provide those missing answers the problem is in obtaining one that works.Let me ask you a question ?If one of your family members needed medical help but couldn,t afford it how long would you let them suffer before you tried alternatives?So the question is?? Is there anyone willing to ask this one question of a ghost box( is it possible to use one to heal illness?Any answers would help millions who have few options left.\n\n--- In EVP-ITC@yahoogroups.com, Rj &lt;rasterer@...&gt; wrote:\n&gt;\n&gt; Hello Gary.  What kind of professional or medical training do you have in the area of treating mental illness?  Are you a doctor?\n&gt; \n&gt; \n&gt; --- On Tue, 2/9/10, maltesefalcon18 &lt;maltesefalcon18@...&gt; wrote:\n&gt; \n&gt; From: maltesefalcon18 &lt;maltesefalcon18@...&gt;\n&gt; Subject: [EVP-ITC] Franks box\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Tuesday, February 9, 2010, 11:47 AM\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt;   \n&gt; \n&gt; \n&gt;     \n&gt;       \n&gt;       \n&gt;       Hi my name is Gary. I volunteer at a non profit hope center for NAMI springfield mo.Over the last 2 years have been working with the mentally ill in alternative medicine and community resources.I have come to belive that not all mentally ill people are really sick at all but instead may actually  be hearing voices that are related to evps.I belive that Franks box actually could allow those who suffer from deluisions and voices to confront and identifie discarnate entitys who have become attached to the livving.I also belive that by using franks box its possible to remove and cure the livving from these unwantted energys that plague many people around the world.In my own exsperimenting I have found that some of the voices that the mentally ill exsperiance actually have awareness outside of their victims knowledge,space and time.I have seen these voices destroy many lives that were cut short by medicines that were uneffective and offten worse then\n&gt;  the condition whitch they were prescribed for.I wish to conduct a study using franks box in a controled exsperiment to see if this theory maybe true and if a real cure can be found to rid the livving from negative attachments that can cause and mimick mental illness in normally healthy people.Is there anyone who could help in this research.Basicly need to find a ghost box AKA Franks box that could be used for this ground breaking exsperiment. Any help would greatly be appreciated, Thank you.\n&gt;"}