{"id": "16895", "subject": "Re: [EVP-ITC] Re: Paranormal Investigation Into 2012 Via Ghost Box  EVP Part 2 [1 Attachment]", "author": "Rj", "timestamp": "2010-03-29T16:08:58Z", "full_text": "--0-771915250-1269878938=:42885\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nNew evidence is constantly being analyzed.=C2=A0 But, as I said, the eviden=\r\nce I have checked out was not convincing. And yes, this is evidence &quot;per se=\r\n&quot;.=C2=A0 As you put it, it is evidence of &quot;something that should not be the=\r\nre&quot;.=C2=A0 And my point is, all of this evidence I have heard, is evidence =\r\nof something that is completely reasonable to be there: noise and radio bro=\r\nadcasts.\n\nAnd I still don&#39;t understand why those who analyze evidence (pick=\r\ning it apart, as you call it), you feel must be name called, insulted, and =\r\nreferred to as a &quot;clown&quot;, because they are skeptical of these claims, and d=\r\necide not to simply believe the claims.\n\nBut critical thinking is just thin=\r\nking logically.=C2=A0 If someone presents claims, and includes a=C2=A0=C2=\r\n=A0 disclaimer about not being allowed to think logically when viewing the =\r\nevidence, I&#39;m afraid it would not be unexpected for those claims to be ridi=\r\nculed.=C2=A0 Maybe that is why you have such bad experiences when presentin=\r\ng your findings?\n\nThere is no need for there to be such friction between EV=\r\nP researchers, and skeptics.=C2=A0 As long as each group could agree that t=\r\nhe basis for analyzing evidence is to be allowed to think logically.\n\n\n--- =\r\nOn Mon, 3/29/10, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n\nFrom: F=\r\nrank Sumption &lt;purplealiengirl@...&gt;\nSubject: Re: [EVP-ITC] Re: Parano=\r\nrmal Investigation Into 2012 Via Ghost Box  EVP Part 2 [1 Attachment]\nTo: E=\r\nVP-ITC@yahoogroups.com\nDate: Monday, March 29, 2010, 8:43 AM\n\n\n\n\n\n\n\n=C2=A0\n=\r\n\n\n\n  \n\n\n    \n      \n              \n        [Attachment(s) from Frank Sumpti=\r\non included below]\n        \n      \n      =C2=A0So where&#39;s your evidence, yo=\r\nur recordings? Let me guess, they&#39;re being analyzed. I didn&#39;t start this th=\r\nread. just chimming in that I get similar voices. \n=C2=A0\n=C2=A0This ain&#39;t =\r\nevidence per se`, as the source is unknown, all we can do is present what w=\r\ne get. I&#39;ve alwasy said there&#39;s something that talks that shouldn&#39;t be ther=\r\ne, and that&#39;s all. You can&#39;t know who it is, or what it is, that doesn&#39;t ma=\r\nke it useless. But as soon as we present what we get there&#39;s always some cl=\r\nown that wants to pick it apart and try to take away all meaning and experi=\r\nence. So if you want critcial thinking and consistent evidence go hang out=\r\n=C2=A0on JREF. \n\n=C2=A0\n=C2=A0F-S\n\n\nOn Mon, Mar 29, 2010 at 8:05 AM, Rj &lt;ra=\r\nsterer@yahoo. com&gt; wrote:\n\n\n=C2=A0 \n\n\n\n\n\n\n\nYou say the &#39;bitch&#39; comes out wh=\r\nen you feel you&#39;re being spoken down to, yet you start threads on you own (=\r\nlike this one) where you attack those who hold different opinions than your=\r\ns, but who have said nothing against you.=C2=A0 Skeptic simply means not be=\r\nlieving things just because someone claims it.=C2=A0 Anyone on the internet=\r\n who is NOT a skeptic is in danger of losing a lot of money to Nigerian ban=\r\nkers.\n\n\nNo testing I&#39;ve ever seen, whether my own or from others, has shown=\r\n me results that could be shown to only have come from some paranormal enti=\r\nties.=C2=A0 That is, while one could claim it did, there was nothing about =\r\nit that also couldn&#39;t be explained as coming from just the misinterpretatio=\r\nn of noise, or of random radio broadcast snippets.=C2=A0 And so I see no re=\r\nason to explain the results by claiming they come from ghosts or aliens whe=\r\nn a more mundane explanation works just as well.=C2=A0 Well one reason mayb=\r\ne: its more fun to believe.\n\n\nMany people who claim a more exotic explanati=\r\non also, curiously, claim it can&#39;t be tested or verified.=C2=A0 While those=\r\n who claim it is based on personal interpretation of noise and random broad=\r\ncast, can and do test that theory just fine.=C2=A0 Again, this could be exp=\r\nlained by some incredibly complex system of ghost-rules where ghosts aren&#39;t=\r\n allowed to communicate in good grammar, and are required to make only bad =\r\npredictions or spew irrelevant comments, or must perform poorly only when b=\r\neing tested.=C2=A0 Or it could be explained simply by accepting that the te=\r\nsts are good, and that it is the claims being=C2=A0 tested that are bogus.=\r\n=C2=A0=C2=A0 I think it takes a lot of dancing to believe the former over t=\r\nhe latter.\n\n\nAgain, being skeptical means not simply accepting=C2=A0 claims=\r\n, especially unusual ones, without some critical thinking and investigation=\r\n.=C2=A0 It doesn&#39;t mean that the claims deserve to be rejected outright, ju=\r\nst as it doesn&#39;t mean rejecting everything we know about history and scienc=\r\ne.=C2=A0 There is nothing wrong with demanding evidence of unusual claims.=\r\n=C2=A0 But not just evidence: good evidence, evidence gathered under contro=\r\nlled conditions.=C2=A0 Personal claims about ghosts are not good evidence.=\r\n=C2=A0 Recordings that can only be understood once someone is first told wh=\r\nat they are supposed to hear, is not good evidence.=C2=A0 The only good evi=\r\ndence we have are the claims where the recordings are said to predict somet=\r\nhing: and then that something doesn&#39;t happen.=C2=A0 Unfortunately, that is =\r\ngood evidence that this is just random sounds, not that their is any intell=\r\nigence lying to us.\n\n\nNotice also, that if I am a skeptic, I do not need to=\r\n call those who are not skeptical, or are convinced that their are ghosts o=\r\nn their radio, names or other insulting things.=C2=A0 I do not feel the nee=\r\nd to be defensive, because I have nothing to defend.=C2=A0 I just ask for, =\r\nlook for, and wait for, better evidence.=C2=A0 Nothing would make me happie=\r\nr to find proof of an afterlife, beyond just claims and televangelists and =\r\nshows on tv.=C2=A0 That&#39;s why I comment about claims of proof that I don&#39;t =\r\nthink hold water. Because I think real proof is important.=C2=A0 And bogus =\r\nproof is the primary obstacle to finding the good stuff.\n\n\n\n\n--- On Mon, 3/=\r\n29/10, purplespacefriend &lt;purplealiengirl@ gmail.com&gt; wrote:\n\n\nFrom: purple=\r\nspacefriend &lt;purplealiengirl@ gmail.com&gt;\nSubject: [EVP-ITC] Re: Paranormal =\r\nInvestigation Into 2012 Via Ghost Box EVP Part 2 \n\nTo: EVP-ITC@yahoogroups =\r\n.com\nDate: Monday, March 29, 2010, 12:02 AM\n\n\n=C2=A0 \n\nI have had numrerous=\r\n instance where they show a knowledge of what I will see and hear in the ne=\r\nar future, which is good enough for me. For reasons I don&#39;t understand we a=\r\nre seemingly not allowed to get the proof you want, at least not in af rom =\r\nthat it can be shared, so you have to prove it to yourself. \n\n\nThe bitch co=\r\nmes out when I think I&#39;m being talked down to. You speak like a typical ske=\r\nptic, demanding evidence and accepting none, nor doing your own damn home w=\r\nork and testing for your self. \n\nF-S\n\n--- In EVP-ITC@yahoogroups .com, &quot;ras=\r\nterer&quot; &lt;rasterer@.. .&gt; wrote:\n\n&gt;\n&gt; \n&gt; I would suggest that the &#39;better way&#39;=\r\n is to drop the drama, the insults, and the name calling. Keep an open mind=\r\n, and test claims. If the claim is that something catastrophic is going to =\r\nhappen in 2012, wait and see, then decide the reliability of the source. If=\r\n the claim is that ghosts are talking on my radio, test that claim, and the=\r\nn decide on the reliability of those making the claim, and those disputing =\r\nit.\n\n&gt; \n&gt; Rj \n\n&gt; \n&gt; --- In EVP-ITC@yahoogroups .com, Frank Sumption &lt;purple=\r\naliengirl@ &gt; wrote:\n&gt; &gt;\n\n&gt; &gt; Here&#39;s a commet BITE ME! I&#39;ve had a gut full o=\r\nf the crackhead ghosthunter\n&gt; &gt; types that act like only certain kinds of v=\r\noices are valid from the box or\n&gt; &gt; any EVP method. I&#39;m also tired or the d=\r\numbass skeptics that go with this\n\n&gt; &gt; field. Thewre has to be a better way=\r\n..\n&gt; &gt; \n&gt; &gt; Frank-S\n&gt; &gt; \n&gt; &gt; On Sun, Mar 28, 2010 at 1:30 AM, Frank Sumptio=\r\nn\n&gt; &gt; &lt;purplealiengirl@ &gt;wrote: \n\n&gt; &gt; \n&gt; &gt; &gt; Does that mean you&#39;re preparin=\r\ng a heaping helping serving of crow to be\n&gt; &gt; &gt; served clod?\n&gt; &gt; &gt;\n&gt; &gt; &gt; If=\r\n nothing happens, soon, 2012 or shortly after, we are all in for a slow\n\n&gt; =\r\n&gt; &gt; rotting death as we run out of oil, then drinkable water, then arable l=\r\nand,\n&gt; &gt; &gt; then food.\n&gt; &gt; &gt;\n&gt; &gt; &gt; F-S\n\n&gt; &gt; &gt; On Sat, Mar 27, 2010 at 5:49 P=\r\nM, Rj &lt;rasterer@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt; Personally, I am saving=\r\n some of the comments, like from the NASA\n\n&gt; &gt; &gt;&gt; article, and like from Fr=\r\nank. The best way to tell who the idiots here are,\n&gt; &gt; &gt;&gt; is to wait for 20=\r\n12 and see what happens.\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt; Then there will be no doubt.\n\n&gt; &gt; &gt;&gt;=\r\n\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt;\n\n&gt; &gt; &gt;&gt; --- On *Sat, 3/27/10, Frank Sumption &lt;purplealiengir=\r\nl@ &gt;* wrote:\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt; From: Frank Sumption &lt;purplealiengirl@ &gt;\n=\r\n\n\n&gt; &gt; &gt;&gt; Subject: Re: [EVP-ITC] Re: Paranormal Investigation Into 2012 Via =\r\nGhost\n&gt; &gt; &gt;&gt; Box EVP Part 2\n&gt; &gt; &gt;&gt; To: EVP-ITC@yahoogroups .com\n\n&gt; &gt; &gt;&gt; Dat=\r\ne: Saturday, March 27, 2010, 4:21 PM\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt; So =\r\nwhat make some NASA duffus so sure he can say none of the 2012 stuff\n\n&gt; &gt; &gt;=\r\n&gt; is true. Every freaking culture in the world has the same damn date--but\n=\r\n&gt; &gt; &gt;&gt; everyone knows they were so backward and so retarded that they could=\r\n not\n&gt; &gt; &gt;&gt; possible have known anything! All they could do was plot the or=\r\nbits of the\n\n&gt; &gt; &gt;&gt; planets with unbelievable accuracy and at a time when w=\r\nestern science still\n&gt; &gt; &gt;&gt; thought the Earth was the center of the univers=\r\ne and flat! These ancients\n&gt; &gt; &gt;&gt; built structures that &quot;modern&quot; science ca=\r\nn&#39;t even comprehend, yet &quot;modern&quot;\n\n&gt; &gt; &gt;&gt; scientists act like they know eve=\r\nrything and all has been discovered. These\n&gt; &gt; &gt;&gt; scientists already know e=\r\nverything,. so no need to check their facts. Same\n&gt; &gt; &gt;&gt; question as always=\r\n, who is paying these idiots?\n\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt; F-S\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt; On Fri, Mar =\r\n26, 2010 at 5:53 PM, neferkit &lt;Neferkit@verizon. net&lt;http://mc/compose? to=\r\n=3DNeferkit@&gt; \n\n&gt; &gt; &gt;&gt; &gt; wrote:\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt;&gt; Hi, Zack! I&#39;=\r\nm fairly new to the group, so I don&#39;t know if the article was\n\n&gt; &gt; &gt;&gt;&gt; alre=\r\nady posted or not. At any rate, thanks for posting the link. It was a\n&gt; &gt; &gt;=\r\n&gt;&gt; great article and well worth reading.\n&gt; &gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt;&gt; Pat :-)\n\n&gt; &gt; &gt;&gt;&gt;\n&gt;=\r\n &gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt;&gt; --- In EVP-ITC@yahoogroups .com&lt;http://mc/compose? to=3DEVP-=\r\nITC% 40yahoogroups. com&gt;, \n\n&gt; &gt; &gt;&gt;&gt; Zack Widup &lt;w9sz.zack@ .&gt; wrote:\n&gt; &gt; &gt;&gt;=\r\n&gt; &gt;\n&gt; &gt; &gt;&gt;&gt; &gt; Was this posted here already?\n&gt; &gt; &gt;&gt;&gt; &gt;\n&gt; &gt; &gt;&gt;&gt; &gt; http://www.=\r\nnasa. gov/topics/ earth/features/ 2012-guest. html&lt;http://www.nasa. gov/top=\r\nics/ earth/features/ 2012-guest. html&gt;\n\n&gt; &gt; &gt;&gt;&gt; &gt;\n&gt; &gt; &gt;&gt;&gt; &gt; Zack\n&gt; &gt; &gt;&gt;&gt; &gt;\n=\r\n&gt; &gt; &gt;&gt;&gt; &gt;\n&gt; &gt; &gt;&gt;&gt; &gt;\n&gt; &gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt;\n\n&gt; &gt; &gt;&gt; \n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n=\r\n&gt;\n\n\n\n\n\n\n\n\n    \n     \n\n    \n    \n\n\n \n\n\n\n  \n\n\n\n\n\n\n      \r\n--0-771915250-1269878938=:42885\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;New evidence is constantly being analyzed.&nb=\r\nsp; But, as I said, the evidence I have checked out was not convincing. And=\r\n yes, this is evidence &quot;per se&quot;.&nbsp; As you put it, it is evidence of &quot;so=\r\nmething that should not be there&quot;.&nbsp; And my point is, all of this evide=\r\nnce I have heard, is evidence of something that is completely reasonable to=\r\n be there: noise and radio broadcasts.&lt;br&gt;&lt;br&gt;And I still don&#39;t understand =\r\nwhy those who analyze evidence (picking it apart, as you call it), you feel=\r\n must be name called, insulted, and referred to as a &quot;clown&quot;, because they =\r\nare skeptical of these claims, and decide not to simply believe the claims.=\r\n&lt;br&gt;&lt;br&gt;But critical thinking is just thinking logically.&nbsp; If someone =\r\npresents claims, and includes a&nbsp;&nbsp; disclaimer about not being allo=\r\nwed to think logically when viewing the evidence, I&#39;m afraid it would not b=\r\ne\n unexpected for those claims to be ridiculed.&nbsp; Maybe that is why you=\r\n have such bad experiences when presenting your findings?&lt;br&gt;&lt;br&gt;There is n=\r\no need for there to be such friction between EVP researchers, and skeptics.=\r\n&nbsp; As long as each group could agree that the basis for analyzing evide=\r\nnce is to be allowed to think logically.&lt;br&gt;&lt;br&gt;&lt;br&gt;--- On &lt;b&gt;Mon, 3/29/10,=\r\n Frank Sumption &lt;i&gt;&lt;purplealiengirl@...&gt;&lt;/i&gt;&lt;/b&gt; wrote:&lt;br&gt;&lt;blo=\r\nckquote style=3D&quot;border-left: 2px solid rgb(16, 16, 255); margin-left: 5px;=\r\n padding-left: 5px;&quot;&gt;&lt;br&gt;From: Frank Sumption &lt;purplealiengirl@...=\r\n&gt;&lt;br&gt;Subject: Re: [EVP-ITC] Re: Paranormal Investigation Into 2012 Via G=\r\nhost Box  EVP Part 2 [1 Attachment]&lt;br&gt;To: EVP-ITC@yahoogroups.com&lt;br&gt;Date:=\r\n Monday, March 29, 2010, 8:43 AM&lt;br&gt;&lt;br&gt;&lt;div id=3D&quot;yiv2033862823&quot;&gt;\n\n\n\n\n\n&lt;sp=\r\nan style=3D&quot;display: none;&quot;&gt;&nbsp;&lt;/span&gt;\n\n\n\n    &lt;div id=3D&quot;ygrp-text&quot;&gt;\n   =\r\n   \n        \n      \n      &lt;p&gt;&lt;/p&gt;&lt;div&gt;&nbsp;So where&#39;s your evidence, your =\r\nrecordings? Let me guess, they&#39;re being analyzed. I didn&#39;t start this threa=\r\nd. just chimming in that I get similar voices. &lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;di=\r\nv&gt;&nbsp;This ain&#39;t evidence per se`, as the source is unknown, all we can d=\r\no is present what we get. I&#39;ve alwasy said there&#39;s something that talks tha=\r\nt shouldn&#39;t be there, and that&#39;s all. You can&#39;t know who it is, or what it =\r\nis, that doesn&#39;t make it useless. But as soon as we present what we get the=\r\nre&#39;s always some clown that wants to pick it apart and try to take away all=\r\n meaning and experience. So if you want critcial thinking and consistent ev=\r\nidence go hang out&nbsp;on JREF. &lt;/div&gt;\n\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;F-S&lt;b=\r\nr&gt;&lt;br&gt;&lt;/div&gt;\n&lt;div class=3D&quot;gmail_quote&quot;&gt;On Mon, Mar 29, 2010 at 8:05 AM, Rj=\r\n &lt;span dir=3D&quot;ltr&quot;&gt;&lt;&lt;a rel=3D&quot;nofollow&quot; ymailto=3D&quot;mailto:rasterer@yahoo=\r\n.com&quot; target=3D&quot;_blank&quot; href=3D&quot;/mc/compose?to=3Drasterer@...&quot;&gt;raster=\r\ner@yahoo. com&lt;/a&gt;&gt;&lt;/span&gt; wrote:&lt;br&gt;\n&lt;blockquote style=3D&quot;border-left: 1=\r\npx solid rgb(204, 204, 204);&quot; class=3D&quot;gmail_quote&quot;&gt;\n&lt;div style=3D&quot;backgrou=\r\nnd-color: rgb(255, 255, 255);&quot;&gt;&lt;span&gt;&nbsp;&lt;/span&gt; \n&lt;div&gt;\n&lt;div&gt;\n&lt;div&gt;\n&lt;p&gt;\n&lt;=\r\ntable border=3D&quot;0&quot; cellpadding=3D&quot;0&quot; cellspacing=3D&quot;0&quot;&gt;\n&lt;tbody&gt;\n&lt;tr&gt;\n&lt;td va=\r\nlign=3D&quot;top&quot;&gt;You say the &#39;bitch&#39; comes out when you feel you&#39;re being spoke=\r\nn down to, yet you start threads on you own (like this one) where you attac=\r\nk those who hold different opinions than yours, but who have said nothing a=\r\ngainst you.&nbsp; Skeptic simply means not believing things just because so=\r\nmeone claims it.&nbsp; Anyone on the internet who is NOT a skeptic is in da=\r\nnger of losing a lot of money to Nigerian bankers.&lt;br&gt;\n&lt;br&gt;No testing I&#39;ve =\r\never seen, whether my own or from others, has shown me results that could b=\r\ne shown to only have come from some paranormal entities.&nbsp; That is, whi=\r\nle one could claim it did, there was nothing about it that also couldn&#39;t be=\r\n explained as coming from just the misinterpretation of noise, or of random=\r\n radio broadcast snippets.&nbsp; And so I see no reason to explain the resu=\r\nlts by claiming they come from ghosts or aliens when a more mundane explana=\r\ntion works just as well.&nbsp; Well one reason maybe: its more fun to belie=\r\nve.&lt;br&gt;\n&lt;br&gt;Many people who claim a more exotic explanation also, curiously=\r\n, claim it can&#39;t be tested or verified.&nbsp; While those who claim it is b=\r\nased on personal interpretation of noise and random broadcast, can and do t=\r\nest that theory just fine.&nbsp; Again, this could be explained by some inc=\r\nredibly complex system of ghost-rules where ghosts aren&#39;t allowed to commun=\r\nicate in good grammar, and are required to make only bad predictions or spe=\r\nw irrelevant comments, or must perform poorly only when being tested.&nbsp;=\r\n Or it could be explained simply by accepting that the tests are good, and =\r\nthat it is the claims being&nbsp; tested that are bogus.&nbsp;&nbsp; I thin=\r\nk it takes a lot of dancing to believe the former over the latter.&lt;br&gt;\n&lt;br&gt;=\r\nAgain, being skeptical means not simply accepting&nbsp; claims, especially =\r\nunusual ones, without some critical thinking and investigation.&nbsp; It do=\r\nesn&#39;t mean that the claims deserve to be rejected outright, just as it does=\r\nn&#39;t mean rejecting everything we know about history and science.&nbsp; Ther=\r\ne is nothing wrong with demanding evidence of unusual claims.&nbsp; But not=\r\n just evidence: good evidence, evidence gathered under controlled condition=\r\ns.&nbsp; Personal claims about ghosts are not good evidence.&nbsp; Recordin=\r\ngs that can only be understood once someone is first told what they are sup=\r\nposed to hear, is not good evidence.&nbsp; The only good evidence we have a=\r\nre the claims where the recordings are said to predict something: and then =\r\nthat something doesn&#39;t happen.&nbsp; Unfortunately, that is good evidence t=\r\nhat this is just random sounds, not that their is any intelligence lying to=\r\n us.&lt;br&gt;\n&lt;br&gt;Notice also, that if I am a skeptic, I do not need to call tho=\r\nse who are not skeptical, or are convinced that their are ghosts on their r=\r\nadio, names or other insulting things.&nbsp; I do not feel the need to be d=\r\nefensive, because I have nothing to defend.&nbsp; I just ask for, look for,=\r\n and wait for, better evidence.&nbsp; Nothing would make me happier to find=\r\n proof of an afterlife, beyond just claims and televangelists and shows on =\r\ntv.&nbsp; That&#39;s why I comment about claims of proof that I don&#39;t think hol=\r\nd water. Because I think real proof is important.&nbsp; And bogus proof is =\r\nthe primary obstacle to finding the good stuff.&lt;br&gt;\n&lt;br&gt;&lt;br&gt;&lt;br&gt;--- On &lt;b&gt;M=\r\non, 3/29/10, purplespacefriend &lt;i&gt;&lt;&lt;a rel=3D&quot;nofollow&quot; ymailto=3D&quot;mailto=\r\n:purplealiengirl@...&quot; target=3D&quot;_blank&quot; href=3D&quot;/mc/compose?to=3Dpurp=\r\nlealiengirl@...&quot;&gt;purplealiengirl@ gmail.com&lt;/a&gt;&gt;&lt;/i&gt;&lt;/b&gt; wrote:&lt;br=\r\n&gt;\n&lt;blockquote style=3D&quot;border-left: 2px solid rgb(16, 16, 255);&quot;&gt;&lt;br&gt;From: =\r\npurplespacefriend &lt;&lt;a rel=3D&quot;nofollow&quot; ymailto=3D&quot;mailto:purplealiengirl=\r\n@...&quot; target=3D&quot;_blank&quot; href=3D&quot;/mc/compose?to=3Dpurplealiengirl@gmai=\r\nl.com&quot;&gt;purplealiengirl@ gmail.com&lt;/a&gt;&gt;&lt;br&gt;Subject: [EVP-ITC] Re: Paranor=\r\nmal Investigation Into 2012 Via Ghost Box EVP Part 2 \n&lt;div class=3D&quot;im&quot;&gt;&lt;br=\r\n&gt;To: &lt;a rel=3D&quot;nofollow&quot; ymailto=3D&quot;mailto:EVP-ITC@yahoogroups.com&quot; target=\r\n=3D&quot;_blank&quot; href=3D&quot;/mc/compose?to=3DEVP-ITC@yahoogroups.com&quot;&gt;EVP-ITC@yahoo=\r\ngroups .com&lt;/a&gt;&lt;br&gt;&lt;/div&gt;Date: Monday, March 29, 2010, 12:02 AM&lt;br&gt;&lt;br&gt;\n&lt;di=\r\nv&gt;&lt;span&gt;&nbsp;&lt;/span&gt; \n&lt;div&gt;\n&lt;p&gt;I have had numrerous instance where they sh=\r\now a knowledge of what I will see and hear in the near future, which is goo=\r\nd enough for me. For reasons I don&#39;t understand we are seemingly not allowe=\r\nd to get the proof you want, at least not in af rom that it can be shared, =\r\nso you have to prove it to yourself. &lt;br&gt;\n&lt;br&gt;The bitch comes out when I th=\r\nink I&#39;m being talked down to. You speak like a typical skeptic, demanding e=\r\nvidence and accepting none, nor doing your own damn home work and testing f=\r\nor your self. &lt;br&gt;&lt;br&gt;F-S&lt;br&gt;&lt;br&gt;--- In &lt;a rel=3D&quot;nofollow&quot; target=3D&quot;_blan=\r\nk&quot; href=3D&quot;http://mc/compose?to=3DEVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoog=\r\nroups .com&lt;/a&gt;, &quot;rasterer&quot; &lt;rasterer@.. .&gt; wrote:&lt;br&gt;\n&gt;&lt;br&gt;&gt; &lt;b=\r\nr&gt;&gt; I would suggest that the &#39;better way&#39; is to drop the drama, the insu=\r\nlts, and the name calling. Keep an open mind, and test claims. If the claim=\r\n is that something catastrophic is going to happen in 2012, wait and see, t=\r\nhen decide the reliability of the source. If the claim is that ghosts are t=\r\nalking on my radio, test that claim, and then decide on the reliability of =\r\nthose making the claim, and those disputing it.&lt;br&gt;\n&gt; &lt;br&gt;&gt; Rj \n&lt;/p&gt;&lt;=\r\ndiv class=3D&quot;im&quot;&gt;&lt;br&gt;&gt; &lt;br&gt;&gt; --- In &lt;a rel=3D&quot;nofollow&quot; target=3D&quot;_bl=\r\nank&quot; href=3D&quot;http://mc/compose?to=3DEVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yaho=\r\nogroups .com&lt;/a&gt;, Frank Sumption &lt;purplealiengirl@ &gt; wrote:&lt;br&gt;&gt; &=\r\ngt;&lt;br&gt;\n&gt; &gt; Here&#39;s a commet BITE ME! I&#39;ve had a gut full of the crack=\r\nhead ghosthunter&lt;br&gt;&gt; &gt; types that act like only certain kinds of voi=\r\nces are valid from the box or&lt;br&gt;&gt; &gt; any EVP method. I&#39;m also tired o=\r\nr the dumbass skeptics that go with this&lt;br&gt;\n&gt; &gt; field. Thewre has to=\r\n be a better way..&lt;br&gt;&gt; &gt; &lt;br&gt;&gt; &gt; Frank-S&lt;br&gt;&gt; &gt; &lt;br&gt;&gt;=\r\n &gt; On Sun, Mar 28, 2010 at 1:30 AM, Frank Sumption&lt;br&gt;&lt;/div&gt;&gt; &gt; &l=\r\nt;purplealiengirl@ &gt;wrote: \n&lt;div class=3D&quot;im&quot;&gt;&lt;br&gt;&gt; &gt; &lt;br&gt;&gt; &gt=\r\n; &gt; Does that mean you&#39;re preparing a heaping helping serving of crow to=\r\n be&lt;br&gt;&gt; &gt; &gt; served clod?&lt;br&gt;&gt; &gt; &gt;&lt;br&gt;&gt; &gt; &gt; If n=\r\nothing happens, soon, 2012 or shortly after, we are all in for a slow&lt;br&gt;\n&=\r\ngt; &gt; &gt; rotting death as we run out of oil, then drinkable water, the=\r\nn arable land,&lt;br&gt;&gt; &gt; &gt; then food.&lt;br&gt;&gt; &gt; &gt;&lt;br&gt;&gt; &gt; =\r\n&gt; F-S&lt;br&gt;&lt;/div&gt;\n&lt;div class=3D&quot;im&quot;&gt;&gt; &gt; &gt; On Sat, Mar 27, 2010 at=\r\n 5:49 PM, Rj &lt;rasterer@&gt; wrote:&lt;br&gt;&gt; &gt; &gt;&lt;br&gt;&gt; &gt; &gt;&g=\r\nt;&lt;br&gt;&gt; &gt; &gt;&gt;&lt;br&gt;&gt; &gt; &gt;&gt; Personally, I am saving some=\r\n of the comments, like from the NASA&lt;br&gt;\n&gt; &gt; &gt;&gt; article, and li=\r\nke from Frank. The best way to tell who the idiots here are,&lt;br&gt;&gt; &gt; &=\r\ngt;&gt; is to wait for 2012 and see what happens.&lt;br&gt;&gt; &gt; &gt;&gt;&lt;br&gt;=\r\n&gt; &gt; &gt;&gt; Then there will be no doubt.&lt;br&gt;\n&gt; &gt; &gt;&gt;&lt;br&gt;&=\r\ngt; &gt; &gt;&gt;&lt;br&gt;&gt; &gt; &gt;&gt;&lt;br&gt;&lt;/div&gt;\n&lt;div class=3D&quot;im&quot;&gt;&gt; &g=\r\nt; &gt;&gt; --- On *Sat, 3/27/10, Frank Sumption &lt;purplealiengirl@ &gt;*=\r\n wrote:&lt;br&gt;&gt; &gt; &gt;&gt;&lt;br&gt;&gt; &gt; &gt;&gt;&lt;br&gt;&gt; &gt; &gt;&gt; F=\r\nrom: Frank Sumption &lt;purplealiengirl@ &gt;&lt;br&gt;\n&lt;/div&gt;\n&lt;div class=3D&quot;im&quot;&gt;=\r\n&gt; &gt; &gt;&gt; Subject: Re: [EVP-ITC] Re: Paranormal Investigation Into=\r\n 2012 Via Ghost&lt;br&gt;&gt; &gt; &gt;&gt; Box EVP Part 2&lt;br&gt;&gt; &gt; &gt;&gt; =\r\nTo: &lt;a rel=3D&quot;nofollow&quot; target=3D&quot;_blank&quot; href=3D&quot;http://mc/compose?to=3DEV=\r\nP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups .com&lt;/a&gt;&lt;br&gt;\n&gt; &gt; &gt;&gt=\r\n; Date: Saturday, March 27, 2010, 4:21 PM&lt;br&gt;&gt; &gt; &gt;&gt;&lt;br&gt;&gt; &gt=\r\n; &gt;&gt;&lt;br&gt;&gt; &gt; &gt;&gt;&lt;br&gt;&gt; &gt; &gt;&gt;&lt;br&gt;&gt; &gt; &gt;&gt=\r\n; So what make some NASA duffus so sure he can say none of the 2012 stuff&lt;b=\r\nr&gt;\n&gt; &gt; &gt;&gt; is true. Every freaking culture in the world has the =\r\nsame damn date--but&lt;br&gt;&gt; &gt; &gt;&gt; everyone knows they were so backw=\r\nard and so retarded that they could not&lt;br&gt;&gt; &gt; &gt;&gt; possible have=\r\n known anything! All they could do was plot the orbits of the&lt;br&gt;\n&gt; &gt;=\r\n &gt;&gt; planets with unbelievable accuracy and at a time when western sci=\r\nence still&lt;br&gt;&gt; &gt; &gt;&gt; thought the Earth was the center of the un=\r\niverse and flat! These ancients&lt;br&gt;&gt; &gt; &gt;&gt; built structures that=\r\n &quot;modern&quot; science can&#39;t even comprehend, yet &quot;modern&quot;&lt;br&gt;\n&gt; &gt; &gt;&gt=\r\n; scientists act like they know everything and all has been discovered. The=\r\nse&lt;br&gt;&gt; &gt; &gt;&gt; scientists already know everything,. so no need to=\r\n check their facts. Same&lt;br&gt;&gt; &gt; &gt;&gt; question as always, who is p=\r\naying these idiots?&lt;br&gt;\n&gt; &gt; &gt;&gt;&lt;br&gt;&gt; &gt; &gt;&gt; F-S&lt;br&gt;&gt=\r\n; &gt; &gt;&gt;&lt;br&gt;&lt;/div&gt;&gt; &gt; &gt;&gt; On Fri, Mar 26, 2010 at 5:53 PM=\r\n, neferkit &lt;Neferkit@verizon. net&lt;&lt;a rel=3D&quot;nofollow&quot; target=3D&quot;_blan=\r\nk&quot; href=3D&quot;http://mc/compose?to=3DNeferkit@&quot;&gt;http://mc/compose? to=3DNeferk=\r\nit@&lt;/a&gt;&gt; \n&lt;div class=3D&quot;im&quot;&gt;&lt;br&gt;&gt; &gt; &gt;&gt; &gt; wrote:&lt;br&gt;&gt; &=\r\ngt; &gt;&gt;&lt;br&gt;&gt; &gt; &gt;&gt;&gt;&lt;br&gt;&gt; &gt; &gt;&gt;&gt;&lt;br&gt;&gt; &g=\r\nt; &gt;&gt;&gt; Hi, Zack! I&#39;m fairly new to the group, so I don&#39;t know if t=\r\nhe article was&lt;br&gt;\n&gt; &gt; &gt;&gt;&gt; already posted or not. At any rat=\r\ne, thanks for posting the link. It was a&lt;br&gt;&gt; &gt; &gt;&gt;&gt; great ar=\r\nticle and well worth reading.&lt;br&gt;&gt; &gt; &gt;&gt;&gt;&lt;br&gt;&gt; &gt; &gt;&g=\r\nt;&gt; Pat :-)&lt;br&gt;\n&gt; &gt; &gt;&gt;&gt;&lt;br&gt;&gt; &gt; &gt;&gt;&gt;&lt;br&gt;&lt;/di=\r\nv&gt;&gt; &gt; &gt;&gt;&gt; --- In EVP-ITC@yahoogroups .com&lt;&lt;a rel=3D&quot;nofol=\r\nlow&quot; target=3D&quot;_blank&quot; href=3D&quot;http://mc/compose?to=3DEVP-ITC%40yahoogroups=\r\n.com&quot;&gt;http://mc/compose? to=3DEVP-ITC% 40yahoogroups. com&lt;/a&gt;&gt;, \n&lt;div cl=\r\nass=3D&quot;im&quot;&gt;&lt;br&gt;&gt; &gt; &gt;&gt;&gt; Zack Widup &lt;w9sz.zack@ .&gt; wrote=\r\n:&lt;br&gt;&gt; &gt; &gt;&gt;&gt; &gt;&lt;br&gt;&gt; &gt; &gt;&gt;&gt; &gt; Was this po=\r\nsted here already?&lt;br&gt;&gt; &gt; &gt;&gt;&gt; &gt;&lt;br&gt;&lt;/div&gt;&gt; &gt; &gt;&g=\r\nt;&gt; &gt; &lt;a rel=3D&quot;nofollow&quot; target=3D&quot;_blank&quot; href=3D&quot;http://www.nasa./=\r\n&quot;&gt;http://www.nasa.&lt;/a&gt; gov/topics/ earth/features/ 2012-guest. html&lt;&lt;a r=\r\nel=3D&quot;nofollow&quot; target=3D&quot;_blank&quot; href=3D&quot;http://www.nasa.gov/topics/earth/=\r\nfeatures/2012-guest.html&quot;&gt;http://www.nasa. gov/topics/ earth/features/ 2012=\r\n-guest. html&lt;/a&gt;&gt;&lt;br&gt;\n&gt; &gt; &gt;&gt;&gt; &gt;&lt;br&gt;&gt; &gt; &gt;&gt;&=\r\ngt; &gt; Zack&lt;br&gt;&gt; &gt; &gt;&gt;&gt; &gt;&lt;br&gt;&gt; &gt; &gt;&gt;&gt; &gt;=\r\n&lt;br&gt;&gt; &gt; &gt;&gt;&gt; &gt;&lt;br&gt;&gt; &gt; &gt;&gt;&gt;&lt;br&gt;&gt; &gt; &gt;=\r\n&gt;&gt;&lt;br&gt;&gt; &gt; &gt;&gt;&lt;br&gt;\n&gt; &gt; &gt;&gt; &lt;br&gt;&gt; &gt; &gt;&gt=\r\n;&lt;br&gt;&gt; &gt; &gt;&lt;br&gt;&gt; &gt; &gt;&lt;br&gt;&gt; &gt;&lt;br&gt;&gt;&lt;br&gt;&lt;br&gt;\n&lt;p&gt;&lt;/p&gt;&lt;=\r\n/div&gt;&lt;/div&gt;&lt;/blockquote&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/tbody&gt;&lt;/table&gt;&lt;br&gt;&lt;/p&gt;&lt;/div&gt;\n&lt;div style=\r\n=3D&quot;color: rgb(255, 255, 255);&quot;&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/blockquote&gt;&lt;/div&gt;=\r\n&lt;br&gt;\n\n\n    &lt;/div&gt;\n     \n\n\n\n \n\n\n&lt;/div&gt;&lt;/blockquote&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n =\r\n     \r\n--0-771915250-1269878938=:42885--"}