{"id": "16899", "subject": "Re: [EVP-ITC] Re: Paranormal Investigation Into 2012 Via Ghost Box \tEVP Part 2", "author": "Zack Widup", "timestamp": "2010-03-29T19:04:56Z", "full_text": "I wish I knew. That place is the most active place I&#39;ve ever been in. We\nguessed at least a half dozen different voices were gotten on EVP. Some\nmale, some female. All gave direct answers to our questions that made sense\nas answers to the questions, even if wrong (e.g. &quot;Do you know what year it\nis?&quot; - EVP: &quot;1996.&quot; The actual year was 2006.) One of the funniest was in\nanswer to the question &quot;Do you want us to leave?&quot; simultaneously a male\nvoice said &quot;Yes&quot; and a female voice said &quot;No.&quot; So there definitely seemed to\nbe some interaction between us and whatever was answering the questions.\nI investigated a place a month ago where someone gave a name, too. Some of\nthe EVP there might have been residual. It was hard to say, as we were the\nfirst known group to ever investigate the building. But I got a name &quot;I am\n(pause) Francey (pause) William.&quot; I did some searching with Google and found\nthere was a Francey family in that town once, although I coundn&#39;t come up\nwith any records for someone named William Francey. Someone else is digging\ninto that.\n\nIt&#39;s all very interesting, no matter what.\n\nZack\n\n\nOn Mon, Mar 29, 2010 at 12:26 PM, Frank Sumption\n&lt;purplealiengirl@...&gt;wrote:\n\n&gt;\n&gt;\n&gt;  See, that&#39;s interesting, tends to blow my haunting ideas out of the water.\n&gt; Is the guy stuck there, or chooses to be there? Probably unanswerable. There\n&gt; does seem to be the residual energy hauntings, but that stuff I wouldn&#39;t\n&gt; expect to be interactive.\n&gt;\n&gt;  F-S\n&gt;\n&gt;   On Mon, Mar 29, 2010 at 9:56 AM, Zack Widup &lt;w9sz.zack@...&gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; I&#39;m not trying to prove anything to anyone. I know what I&#39;ve got and what\n&gt;&gt; I haven&#39;t got. I know when I&#39;ve gotten something that can&#39;t be explained and\n&gt;&gt; I know I didn&#39;t fake the recordings.\n&gt;&gt;\n&gt;&gt; I was on an investigation of a former mental hospital in Illinois a few\n&gt;&gt; years ago, and during one recording I made, all of us in the group were\n&gt;&gt; looking at a shadow figure moving a distance away. A hoarse, whispery voice\n&gt;&gt; came in on the recording and said a name. None of us would have thought of\n&gt;&gt; saying that particular name. None of us heard this voice with our ears at\n&gt;&gt; the time of the recording. I got it simultaneously on both a pocket digital\n&gt;&gt; voice recorcer and on the audio of a video tape.\n&gt;&gt;\n&gt;&gt; A couple weeks later, someone in the group got into the hospital records\n&gt;&gt; and found that a man with that name had died of typhoid fever in the mental\n&gt;&gt; hospital in 1938. None of us knew that at the time of the investigation. The\n&gt;&gt; probability of anyone else knowing it at the time is very very small.\n&gt;&gt;\n&gt;&gt; No doubt someone who doesn&#39;t know me would say it was faked somehow. But\n&gt;&gt; like I said, I don&#39;t care. I know it wasn&#39;t.\n&gt;&gt;\n&gt;&gt; Zack\n&gt;&gt;\n&gt;&gt; On Mon, Mar 29, 2010 at 9:43 AM, Frank Sumption &lt;\n&gt;&gt; purplealiengirl@...&gt; wrote:\n&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;  [Attachment(s)&lt;http://mail.google.com/mail/?ui=2&view=js&name=js&ver=zJ9UubJxl0w.en.&am=!FbnCc2JPCDmRtdzVEfQ4cvNSIMiSPM733OXSlj95VBIBpzoY#127aa98f8959a5e4_TopText&gt;from Frank Sumption included below]\n&gt;&gt;&gt;\n&gt;&gt;&gt;  So where&#39;s your evidence, your recordings? Let me guess, they&#39;re being\n&gt;&gt;&gt; analyzed. I didn&#39;t start this thread. just chimming in that I get similar\n&gt;&gt;&gt; voices.\n&gt;&gt;&gt;\n&gt;&gt;&gt;  This ain&#39;t evidence per se`, as the source is unknown, all we can do is\n&gt;&gt;&gt; present what we get. I&#39;ve alwasy said there&#39;s something that talks that\n&gt;&gt;&gt; shouldn&#39;t be there, and that&#39;s all. You can&#39;t know who it is, or what it is,\n&gt;&gt;&gt; that doesn&#39;t make it useless. But as soon as we present what we get there&#39;s\n&gt;&gt;&gt; always some clown that wants to pick it apart and try to take away all\n&gt;&gt;&gt; meaning and experience. So if you want critcial thinking and consistent\n&gt;&gt;&gt; evidence go hang out on JREF.\n&gt;&gt;&gt;\n&gt;&gt;&gt;  F-S\n&gt;&gt;&gt;\n&gt;&gt;&gt; On Mon, Mar 29, 2010 at 8:05 AM, Rj &lt;rasterer@...&gt; wrote:\n&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;   You say the &#39;bitch&#39; comes out when you feel you&#39;re being spoken down\n&gt;&gt;&gt;&gt; to, yet you start threads on you own (like this one) where you attack those\n&gt;&gt;&gt;&gt; who hold different opinions than yours, but who have said nothing against\n&gt;&gt;&gt;&gt; you.  Skeptic simply means not believing things just because someone claims\n&gt;&gt;&gt;&gt; it.  Anyone on the internet who is NOT a skeptic is in danger of losing a\n&gt;&gt;&gt;&gt; lot of money to Nigerian bankers.\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; No testing I&#39;ve ever seen, whether my own or from others, has shown me\n&gt;&gt;&gt;&gt; results that could be shown to only have come from some paranormal\n&gt;&gt;&gt;&gt; entities.  That is, while one could claim it did, there was nothing about it\n&gt;&gt;&gt;&gt; that also couldn&#39;t be explained as coming from just the misinterpretation of\n&gt;&gt;&gt;&gt; noise, or of random radio broadcast snippets.  And so I see no reason to\n&gt;&gt;&gt;&gt; explain the results by claiming they come from ghosts or aliens when a more\n&gt;&gt;&gt;&gt; mundane explanation works just as well.  Well one reason maybe: its more fun\n&gt;&gt;&gt;&gt; to believe.\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; Many people who claim a more exotic explanation also, curiously, claim\n&gt;&gt;&gt;&gt; it can&#39;t be tested or verified.  While those who claim it is based on\n&gt;&gt;&gt;&gt; personal interpretation of noise and random broadcast, can and do test that\n&gt;&gt;&gt;&gt; theory just fine.  Again, this could be explained by some incredibly complex\n&gt;&gt;&gt;&gt; system of ghost-rules where ghosts aren&#39;t allowed to communicate in good\n&gt;&gt;&gt;&gt; grammar, and are required to make only bad predictions or spew irrelevant\n&gt;&gt;&gt;&gt; comments, or must perform poorly only when being tested.  Or it could be\n&gt;&gt;&gt;&gt; explained simply by accepting that the tests are good, and that it is the\n&gt;&gt;&gt;&gt; claims being  tested that are bogus.   I think it takes a lot of dancing to\n&gt;&gt;&gt;&gt; believe the former over the latter.\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; Again, being skeptical means not simply accepting  claims, especially\n&gt;&gt;&gt;&gt; unusual ones, without some critical thinking and investigation.  It doesn&#39;t\n&gt;&gt;&gt;&gt; mean that the claims deserve to be rejected outright, just as it doesn&#39;t\n&gt;&gt;&gt;&gt; mean rejecting everything we know about history and science.  There is\n&gt;&gt;&gt;&gt; nothing wrong with demanding evidence of unusual claims.  But not just\n&gt;&gt;&gt;&gt; evidence: good evidence, evidence gathered under controlled conditions.\n&gt;&gt;&gt;&gt; Personal claims about ghosts are not good evidence.  Recordings that can\n&gt;&gt;&gt;&gt; only be understood once someone is first told what they are supposed to\n&gt;&gt;&gt;&gt; hear, is not good evidence.  The only good evidence we have are the claims\n&gt;&gt;&gt;&gt; where the recordings are said to predict something: and then that something\n&gt;&gt;&gt;&gt; doesn&#39;t happen.  Unfortunately, that is good evidence that this is just\n&gt;&gt;&gt;&gt; random sounds, not that their is any intelligence lying to us.\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; Notice also, that if I am a skeptic, I do not need to call those who are\n&gt;&gt;&gt;&gt; not skeptical, or are convinced that their are ghosts on their radio, names\n&gt;&gt;&gt;&gt; or other insulting things.  I do not feel the need to be defensive, because\n&gt;&gt;&gt;&gt; I have nothing to defend.  I just ask for, look for, and wait for, better\n&gt;&gt;&gt;&gt; evidence.  Nothing would make me happier to find proof of an afterlife,\n&gt;&gt;&gt;&gt; beyond just claims and televangelists and shows on tv.  That&#39;s why I comment\n&gt;&gt;&gt;&gt; about claims of proof that I don&#39;t think hold water. Because I think real\n&gt;&gt;&gt;&gt; proof is important.  And bogus proof is the primary obstacle to finding the\n&gt;&gt;&gt;&gt; good stuff.\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; --- On *Mon, 3/29/10, purplespacefriend &lt;purplealiengirl@...&gt;*wrote:\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; From: purplespacefriend &lt;purplealiengirl@...&gt;\n&gt;&gt;&gt;&gt; Subject: [EVP-ITC] Re: Paranormal Investigation Into 2012 Via Ghost Box\n&gt;&gt;&gt;&gt; EVP Part 2\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; To: EVP-ITC@yahoogroups.com\n&gt;&gt;&gt;&gt; Date: Monday, March 29, 2010, 12:02 AM\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; I have had numrerous instance where they show a knowledge of what I will\n&gt;&gt;&gt;&gt; see and hear in the near future, which is good enough for me. For reasons I\n&gt;&gt;&gt;&gt; don&#39;t understand we are seemingly not allowed to get the proof you want, at\n&gt;&gt;&gt;&gt; least not in af rom that it can be shared, so you have to prove it to\n&gt;&gt;&gt;&gt; yourself.\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; The bitch comes out when I think I&#39;m being talked down to. You speak\n&gt;&gt;&gt;&gt; like a typical skeptic, demanding evidence and accepting none, nor doing\n&gt;&gt;&gt;&gt; your own damn home work and testing for your self.\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; F-S\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; --- In EVP-ITC@yahoogroups .com&lt;http://mc/compose?to=EVP-ITC%40yahoogroups.com&gt;,\n&gt;&gt;&gt;&gt; &quot;rasterer&quot; &lt;rasterer@.. .&gt; wrote:\n&gt;&gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt; &gt; I would suggest that the &#39;better way&#39; is to drop the drama, the\n&gt;&gt;&gt;&gt; insults, and the name calling. Keep an open mind, and test claims. If the\n&gt;&gt;&gt;&gt; claim is that something catastrophic is going to happen in 2012, wait and\n&gt;&gt;&gt;&gt; see, then decide the reliability of the source. If the claim is that ghosts\n&gt;&gt;&gt;&gt; are talking on my radio, test that claim, and then decide on the reliability\n&gt;&gt;&gt;&gt; of those making the claim, and those disputing it.\n&gt;&gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt; &gt; Rj\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt; &gt; --- In EVP-ITC@yahoogroups .com&lt;http://mc/compose?to=EVP-ITC%40yahoogroups.com&gt;,\n&gt;&gt;&gt;&gt; Frank Sumption &lt;purplealiengirl@ &gt; wrote:\n&gt;&gt;&gt;&gt; &gt; &gt;\n&gt;&gt;&gt;&gt; &gt; &gt; Here&#39;s a commet BITE ME! I&#39;ve had a gut full of the crackhead\n&gt;&gt;&gt;&gt; ghosthunter\n&gt;&gt;&gt;&gt; &gt; &gt; types that act like only certain kinds of voices are valid from the\n&gt;&gt;&gt;&gt; box or\n&gt;&gt;&gt;&gt; &gt; &gt; any EVP method. I&#39;m also tired or the dumbass skeptics that go with\n&gt;&gt;&gt;&gt; this\n&gt;&gt;&gt;&gt; &gt; &gt; field. Thewre has to be a better way..\n&gt;&gt;&gt;&gt; &gt; &gt;\n&gt;&gt;&gt;&gt; &gt; &gt; Frank-S\n&gt;&gt;&gt;&gt; &gt; &gt;\n&gt;&gt;&gt;&gt; &gt; &gt; On Sun, Mar 28, 2010 at 1:30 AM, Frank Sumption\n&gt;&gt;&gt;&gt; &gt; &gt; &lt;purplealiengirl@ &gt;wrote:\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; &gt; &gt;\n&gt;&gt;&gt;&gt; &gt; &gt; &gt; Does that mean you&#39;re preparing a heaping helping serving of crow\n&gt;&gt;&gt;&gt; to be\n&gt;&gt;&gt;&gt; &gt; &gt; &gt; served clod?\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;\n&gt;&gt;&gt;&gt; &gt; &gt; &gt; If nothing happens, soon, 2012 or shortly after, we are all in for\n&gt;&gt;&gt;&gt; a slow\n&gt;&gt;&gt;&gt; &gt; &gt; &gt; rotting death as we run out of oil, then drinkable water, then\n&gt;&gt;&gt;&gt; arable land,\n&gt;&gt;&gt;&gt; &gt; &gt; &gt; then food.\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;\n&gt;&gt;&gt;&gt; &gt; &gt; &gt; F-S\n&gt;&gt;&gt;&gt; &gt; &gt; &gt; On Sat, Mar 27, 2010 at 5:49 PM, Rj &lt;rasterer@&gt; wrote:\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt;\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt;\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt; Personally, I am saving some of the comments, like from the NASA\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt; article, and like from Frank. The best way to tell who the idiots\n&gt;&gt;&gt;&gt; here are,\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt; is to wait for 2012 and see what happens.\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt;\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt; Then there will be no doubt.\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt;\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt;\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt;\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt; --- On *Sat, 3/27/10, Frank Sumption &lt;purplealiengirl@ &gt;* wrote:\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt;\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt;\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt; From: Frank Sumption &lt;purplealiengirl@ &gt;\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt; Subject: Re: [EVP-ITC] Re: Paranormal Investigation Into 2012 Via\n&gt;&gt;&gt;&gt; Ghost\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt; Box EVP Part 2\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt; To: EVP-ITC@yahoogroups .com&lt;http://mc/compose?to=EVP-ITC%40yahoogroups.com&gt;\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt; Date: Saturday, March 27, 2010, 4:21 PM\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt;\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt;\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt;\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt;\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt; So what make some NASA duffus so sure he can say none of the 2012\n&gt;&gt;&gt;&gt; stuff\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt; is true. Every freaking culture in the world has the same damn\n&gt;&gt;&gt;&gt; date--but\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt; everyone knows they were so backward and so retarded that they\n&gt;&gt;&gt;&gt; could not\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt; possible have known anything! All they could do was plot the\n&gt;&gt;&gt;&gt; orbits of the\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt; planets with unbelievable accuracy and at a time when western\n&gt;&gt;&gt;&gt; science still\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt; thought the Earth was the center of the universe and flat! These\n&gt;&gt;&gt;&gt; ancients\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt; built structures that &quot;modern&quot; science can&#39;t even comprehend, yet\n&gt;&gt;&gt;&gt; &quot;modern&quot;\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt; scientists act like they know everything and all has been\n&gt;&gt;&gt;&gt; discovered. These\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt; scientists already know everything,. so no need to check their\n&gt;&gt;&gt;&gt; facts. Same\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt; question as always, who is paying these idiots?\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt;\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt; F-S\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt;\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt; On Fri, Mar 26, 2010 at 5:53 PM, neferkit &lt;Neferkit@...&lt;http://mc/compose?\n&gt;&gt;&gt;&gt; to=Neferkit@ &lt;http://mc/compose?to=Neferkit@&gt;&gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt; &gt; wrote:\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt;\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt;&gt;\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt;&gt;\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt;&gt; Hi, Zack! I&#39;m fairly new to the group, so I don&#39;t know if the\n&gt;&gt;&gt;&gt; article was\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt;&gt; already posted or not. At any rate, thanks for posting the link.\n&gt;&gt;&gt;&gt; It was a\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt;&gt; great article and well worth reading.\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt;&gt;\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt;&gt; Pat :-)\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt;&gt;\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt;&gt;\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt;&gt; --- In EVP-ITC@yahoogroups .com&lt;http://mc/compose? to=EVP-ITC%\n&gt;&gt;&gt;&gt; 40yahoogroups. com &lt;http://mc/compose?to=EVP-ITC%40yahoogroups.com&gt;&gt;,\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt;&gt; Zack Widup &lt;w9sz.zack@ .&gt; wrote:\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt;&gt; &gt; Was this posted here already?\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt;&gt; &gt; http://www.nasa. gov/topics/ earth/features/ 2012-guest.\n&gt;&gt;&gt;&gt; html&lt;http://www.nasa. gov/topics/ earth/features/ 2012-guest. html&lt;http://www.nasa.gov/topics/earth/features/2012-guest.html&gt;\n&gt;&gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt;&gt; &gt; Zack\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt;&gt;\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt;&gt;\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt;\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt;\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;&gt;\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;\n&gt;&gt;&gt;&gt; &gt; &gt; &gt;\n&gt;&gt;&gt;&gt; &gt; &gt;\n&gt;&gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;\n&gt;  \n&gt;\n\nI wish I knew. Tha place is he mos ac i e place I' e e e been in. We guessed a leas a hal dozen di e en oices we e go en on EVP. Some male, some emale. All ga e di ec answe s o ou ques ions ha made sense as answe s o he ques ions, e en i w ong (e.g. \"Do you know wha yea i is?\" - EVP: \"1996.\" The ac ual yea was 2006.) One o he unnies was in answe o he ques ion \"Do you wan us o lea e?\" simul aneously a male oice said \"Yes\" and a emale oice said \"No.\" So he e de ini ely seemed o be some in e ac ion be ween us and wha e e was answe ing he ques ions.\n\nI in es iga ed a place a mon h ago whe e someone ga e a name, oo. Some o he EVP he e migh ha e been esidual. I was ha d o say, as we we e he i s known g oup o e e in es iga e he building. Bu I go a name \"I am (pause) F ancey (pause) William.\" I did some sea ching wi h Google and ound he e was a F ancey amily in ha own once, al hough I coundn' come up wi h any eco ds o someone named William F ancey. Someone else is digging in o ha .\n\n \nI 's all e y in e es ing, no ma e wha .\n \nZack\n \nOn Mon, Ma 29, 2010 a 12:26 PM, F ank Sump ion pu plealiengi l@...> w o e:\n\n  \n\n\n\n\n See, ha 's in e es ing, ends o blow my haun ing ideas ou o he wa e . Is he guy s uck he e, o chooses o be he e? P obably unanswe able. The e does seem o be he esidual ene gy haun ings, bu ha s u I wouldn' expec o be in e ac i e. \n\n \n F-S\n\n\n\nOn Mon, Ma 29, 2010 a 9:56 AM, Zack Widup w9sz.zack@...> w o e:\n\n  \n\n\n\n\nI'm no ying o p o e any hing o anyone. I know wha I' e go and wha I ha en' go . I know when I' e go en some hing ha can' be explained and I know I didn' ake he eco dings.\n\n \nI was on an in es iga ion o a o me men al hospi al in Illinois a ew yea s ago, and du ing one eco ding I made, all o us in he g oup we e looking a a shadow igu e mo ing a dis ance away. A hoa se, whispe y  oice came in on he eco ding and said a name. None o us would ha e hough o saying ha pa icula name. None o us hea d his oice wi h ou ea s a he ime o he eco ding. I go i simul aneously on bo h a pocke digi al oice eco ce and on he audio o a ideo ape.\n\n \nA couple weeks la e , someone in he g oup go in o he hospi al eco ds and ound ha a man wi h ha name had died o yphoid e e in he men al hospi al in 1938. None o us knew ha a he ime o he in es iga ion. The p obabili y o anyone else knowing i a he ime is e y e y small.\n\n \nNo doub someone who doesn' know me would say i was aked somehow. Bu like I said, I don' ca e. I know i wasn' .\n \nZack\nOn Mon, Ma 29, 2010 a 9:43 AM, F ank Sump ion pu plealiengi l@gmail.com> w o e:\n\n  \n\n\n[A achmen (s) om F ank Sump ion included below] \n\n\n\n\n So whe e's you e idence, you eco dings? Le me guess, hey' e being analyzed. I didn' s a his h ead. jus chimming in ha I ge simila oices. \n \n This ain' e idence pe se`, as he sou ce is unknown, all we can do is p esen wha we ge . I' e alwasy said he e's some hing ha alks ha shouldn' be he e, and ha 's all. You can' know who i is, o wha i is, ha doesn' make i useless. Bu as soon as we p esen wha we ge he e's always some clown ha wan s o pick i apa and y o ake away all meaning and expe ience. So i you wan c i cial hinking and consis en e idence go hang ou  on JREF. \n\n \n F-S\nOn Mon, Ma 29, 2010 a 8:05 AM, Rj as e e @...> w o e:\n\n  \n\n\n\n\n\n\n\nYou say he 'bi ch' comes ou when you eel you' e being spoken down o, ye you s a h eads on you own (like his one) whe e you a ack hose who hold di e en opinions han you s, bu who ha e said no hing agains you.  Skep ic simply means no belie ing hings jus because someone claims i .  Anyone on he in e ne who is NOT a skep ic is in dange o losing a lo o money o Nige ian banke s.\nNo es ing I' e e e seen, whe he my own o om o he s, has shown me esul s ha could be shown o only ha e come om some pa ano mal en i ies.  Tha is, while one could claim i did, he e was no hing abou i ha also couldn' be explained as coming om jus he misin e p e a ion o noise, o o andom adio b oadcas snippe s.  And so I see no eason o explain he esul s by claiming hey come om ghos s o aliens when a mo e mundane explana ion wo ks jus as well.  Well one eason maybe: i s mo e un o belie e.\nMany people who claim a mo e exo ic explana ion also, cu iously, claim i can' be es ed o e i ied.  While hose who claim i is based on pe sonal in e p e a ion o noise and andom b oadcas , can and do es ha heo y jus ine.  Again, his could be explained by some inc edibly complex sys em o ghos - ules whe e ghos s a en' allowed o communica e in good g amma , and a e equi ed o make only bad p edic ions o spew i ele an commen s, o mus pe o m poo ly only when being es ed.  O i could be explained simply by accep ing ha he es s a e good, and ha i is he claims being  es ed ha a e bogus.   I hink i akes a lo o dancing o belie e he o me o e he la e .\nAgain, being skep ical means no simply accep ing  claims, especially unusual ones, wi hou some c i ical hinking and in es iga ion.  I doesn' mean ha he claims dese e o be ejec ed ou igh , jus as i doesn' mean ejec ing e e y hing we know abou his o y and science.  The e is no hing w ong wi h demanding e idence o unusual claims.  Bu no jus e idence: good e idence, e idence ga he ed unde con olled condi ions.  Pe sonal claims abou ghos s a e no good e idence.  Reco dings ha can only be unde s ood once someone is i s old wha hey a e supposed o hea , is no good e idence.  The only good e idence we ha e a e he claims whe e he eco dings a e said o p edic some hing: and hen ha some hing doesn' happen.  Un o una ely, ha is good e idence ha his is jus andom sounds, no ha hei is any in elligence lying o us.\nNo ice also, ha i I am a skep ic, I do no need o call hose who a e no skep ical, o a e con inced ha hei a e ghos s on hei adio, names o o he insul ing hings.  I do no eel he need o be de ensi e, because I ha e no hing o de end.  I jus ask o , look o , and wai o , be e e idence.  No hing would make me happie o ind p oo o an a e li e, beyond jus claims and ele angelis s and shows on .  Tha 's why I commen abou claims o p oo ha I don' hink hold wa e . Because I hink eal p oo is impo an .  And bogus p oo is he p ima y obs acle o inding he good s u .\n--- On Mon, 3/29/10, pu plespace iend pu plealiengi l@...> w o e:\nF om: pu plespace iend pu plealiengi l@gmail.com>Subjec : [EVP-ITC] Re: Pa ano mal In es iga ion In o 2012 Via Ghos Box EVP Pa 2 \nTo: EVP-ITC@yahoog oups.comDa e: Monday, Ma ch 29, 2010, 12:02 AM\n  \n\nI ha e had num e ous ins ance whe e hey show a knowledge o wha I will see and hea in he nea u u e, which is good enough o me. Fo easons I don' unde s and we a e seemingly no allowed o ge he p oo you wan , a leas no in a om ha i can be sha ed, so you ha e o p o e i o you sel . \nThe bi ch comes ou when I hink I'm being alked down o. You speak like a ypical skep ic, demanding e idence and accep ing none, no doing you own damn home wo k and es ing o you sel . F-S--- In EVP-ITC@yahoog oups .com, \" as e e \" w o e:\n>> > I would sugges ha he 'be e way' is o d op he d ama, he insul s, and he name calling. Keep an open mind, and es claims. I he claim is ha some hing ca as ophic is going o happen in 2012, wai and see, hen decide he eliabili y o he sou ce. I he claim is ha ghos s a e alking on my adio, es ha claim, and hen decide on he eliabili y o hose making he claim, and hose dispu ing i .\n> > Rj \n> > --- In EVP-ITC@yahoog oups .com, F ank Sump ion w o e:> >> > He e's a comme BITE ME! I' e had a gu ull o he c ackhead ghos hun e \n> > ypes ha ac like only ce ain kinds o oices a e alid om he box o > > any EVP me hod. I'm also i ed o he dumbass skep ics ha go wi h his> > ield. Thew e has o be a be e way..\n> > > > F ank-S> > > > On Sun, Ma 28, 2010 a 1:30 AM, F ank Sump ion> > w o e: \n> > > > > Does ha mean you' e p epa ing a heaping helping se ing o c ow o be> > > se ed clod?> > >> > > I no hing happens, soon, 2012 o sho ly a e , we a e all in o a slow\n> > > o ing dea h as we un ou o oil, hen d inkable wa e , hen a able land,> > > hen ood.> > >> > > F-S\n> > > On Sa , Ma 27, 2010 a 5:49 PM, Rj w o e:> > >> > >>> > >>> > >> Pe sonally, I am sa ing some o he commen s, like om he NASA\n> > >> a icle, and like om F ank. The bes way o ell who he idio s he e a e,> > >> is o wai o 2012 and see wha happens.> > >>> > >> Then he e will be no doub .\n> > >>> > >>> > >>\n> > >> --- On *Sa , 3/27/10, F ank Sump ion * w o e:> > >>> > >>> > >> F om: F ank Sump ion \n> > >> Subjec : Re: [EVP-ITC] Re: Pa ano mal In es iga ion In o 2012 Via Ghos > > >> Box EVP Pa 2> > >> To: EVP-ITC@yahoog oups .com\n> > >> Da e: Sa u day, Ma ch 27, 2010, 4:21 PM> > >>> > >>> > >>> > >>> > >> So wha make some NASA du us so su e he can say none o he 2012 s u \n> > >> is ue. E e y eaking cul u e in he wo ld has he same damn da e--bu > > >> e e yone knows hey we e so backwa d and so e a ded ha hey could no > > >> possible ha e known any hing! All hey could do was plo he o bi s o he\n> > >> plane s wi h unbelie able accu acy and a a ime when wes e n science s ill> > >> hough he Ea h was he cen e o he uni e se and la ! These ancien s> > >> buil s uc u es ha \"mode n\" science can' e en comp ehend, ye \"mode n\"\n> > >> scien is s ac like hey know e e y hing and all has been disco e ed. These> > >> scien is s al eady know e e y hing,. so no need o check hei ac s. Same> > >> ques ion as always, who is paying hese idio s?\n> > >>> > >> F-S> > >>> > >> On F i, Ma 26, 2010 a 5:53 PM, ne e ki h p://mc/compose? o=Ne e ki @> \n> > >> > w o e:> > >>> > >>>> > >>>> > >>> Hi, Zack! I'm ai ly new o he g oup, so I don' know i he a icle was\n> > >>> al eady pos ed o no . A any a e, hanks o pos ing he link. I was a> > >>> g ea a icle and well wo h eading.> > >>>> > >>> Pa :-)\n> > >>>> > >>>> > >>> --- In EVP-ITC@yahoog oups .comh p://mc/compose? o=EVP-ITC% 40yahoog oups. com>, \n> > >>> Zack Widup w o e:> > >>> >> > >>> > Was his pos ed he e al eady?> > >>> >> > >>> > h p://www.nasa. go / opics/ ea h/ ea u es/ 2012-gues . h mlh p://www.nasa. go / opics/ ea h/ ea u es/ 2012-gues . h ml>\n> > >>> >> > >>> > Zack> > >>> >> > >>> >> > >>> >> > >>>> > >>>> > >>\n> > >> > > >>> > >> > >> >>"}