{"id": "16917", "subject": "New to EVP", "author": "Anthony Rhimes", "timestamp": "2010-04-03T00:59:55Z", "full_text": "--0-1753653573-1270256395=:22498\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nHi All,\n\nI&#39;m new to this group, and to the practical side of EVP, so after =\r\nreading a few posts I thought I would introduce myself and also ask for som=\r\ne advice.\n\nFirst, those ghost boxes look great! I&#39;d love to make one, but m=\r\ny electrical knowledge is non-existent. Are there any good websites out the=\r\nre that I can learn the basics of electronics from? Or in the meantime is t=\r\nhere some makeshift thing I can do, like just manually moving the dial of m=\r\ny radio?\n\nSecondly, I have tried several EVP recordings, and not really got=\r\nten anything. I had one interesting comment that I hear from using EVP Make=\r\nr with the Allophones voice samples. I asked &quot;are there any spirits here?&quot; =\r\nand the answer I got was &quot;No we are not here right now&quot;. I don&#39;t readily ha=\r\nve access to any known haunted sites, although I will be checking out some =\r\ncemetaries soon. My theory, based on reading the works of more experienced =\r\npeople is that the more you work with EVP the more you begin to recieve mes=\r\nsages. Almost like you begin to stand out on their map and they flock to yo=\r\nu. I think this is in some ways equivalent to being a medium. Would any of =\r\nyou agree with that idea? What I&#39;m getting at is that my hope is that the m=\r\nore I attempt to record EVP hopefully there is more chance of my getting EV=\r\nPS regardless of the location I am at. \n\nThirdly, I have done some reading =\r\non reverse speech and did have quite a shock with one recording of myself t=\r\nhat definitely went into subconscious material. Do any of you work with rev=\r\nersing your EVPs? There is some FAR OUT material on the web on reverse spee=\r\nch, but I think using the protocols you all use you can still get good stuf=\r\nf from it.\n\n\n\nAnthony\n\n\n      \r\n--0-1753653573-1270256395=:22498\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;&lt;head&gt;&lt;style type=3D&quot;text/css&quot;&gt;&lt;!-- DIV {margin:0px;} --&gt;&lt;/style&gt;&lt;/he=\r\nad&gt;&lt;body&gt;&lt;div style=3D&quot;font-family:times new roman, new york, times, serif;=\r\nfont-size:10pt&quot;&gt;&lt;DIV&gt;Hi All,&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I&#39;m new to this g=\r\nroup, and to the practical side of EVP, so after reading a few posts I thou=\r\nght I would introduce myself and also ask for some advice.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp=\r\n;&lt;/DIV&gt;\n&lt;DIV&gt;First, those ghost boxes look great! I&#39;d love to make one, but=\r\n my electrical knowledge is non-existent. Are there any good websites out t=\r\nhere that I can learn the basics of electronics from? Or in the meantime is=\r\n there some makeshift thing I can do, like just manually moving the dial of=\r\n my radio?&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Secondly, I have tried several EVP =\r\nrecordings, and not really gotten anything. I had one interesting comment t=\r\nhat I hear from using EVP Maker with the Allophones voice samples. I asked =\r\n&quot;are there any spirits here?&quot; and the answer I got was &quot;No we are not here =\r\nright now&quot;. I don&#39;t readily have access to any known haunted sites, althoug=\r\nh I will be checking out some cemetaries soon. My theory, based on reading =\r\nthe works of more experienced people is that the more you work with EVP the=\r\n more you begin to recieve messages. Almost like you begin to stand out on =\r\ntheir map and they flock to you. I think this is in some ways equivalent to=\r\n being a medium. Would any of you agree with that idea? What I&#39;m getting at=\r\n is that my hope is that the more I attempt to record EVP hopefully there i=\r\ns more chance of my getting EVPS regardless of the location I am at. &lt;/DIV&gt;=\r\n\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Thirdly, I have done some reading on reverse speech=\r\n and did have quite a shock with one recording of myself that definitely we=\r\nnt into subconscious material. Do any of you work with reversing your EVPs?=\r\n There is some FAR OUT material on the web on reverse speech, but I think u=\r\nsing the protocols you all use you can still get good stuff from it.&lt;/DIV&gt;\n=\r\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Anthony&lt;/DIV&gt;&lt;/d=\r\niv&gt;&lt;br&gt;\n\n\n\n      &nbsp;&lt;/body&gt;&lt;/html&gt;\r\n--0-1753653573-1270256395=:22498--"}