{"id": "16931", "subject": "Re: Maybe they have a sense of humor?", "author": "trilobitegal", "timestamp": "2010-04-08T23:28:33Z", "full_text": "Frank, I listened and commented a couple of days ago, too, but my comment somehow didn&#39;t make it to the board.  So you have more people listening than you think.  ;-)\n\n--- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  I do have to do more cinsistent seesions to get more. I tend to only record when I&#39;m testing a system. \n&gt; \n&gt;  Thanks for taking the time to listen!\n&gt; \n&gt; F-S\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, John S &lt;phenom_investigator@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Frank,\n&gt; &gt; \n&gt; &gt; I listened carefully to the Rosetta Stone ad fragment you posted and found it interesting.\n&gt; &gt; The final word clearly comes from another source as it is another voice. This suggests \n&gt; &gt; that what may be happening has more to do with controlling the sequence rather than \n&gt; &gt; manipulating the audio directly. This was an interesting fragment since you know what \n&gt; &gt; to expectas it comes from a well-known source.\n&gt; &gt; \n&gt; &gt; That observation leads me to wonder if there are any other high-quality samples which \n&gt; &gt; would lead us to another conclusion. In other words, are there any good examples that\n&gt; &gt; sound more like there ismanipulationofintended words rather thansplicing?\n&gt; &gt; \n&gt; &gt; For instance, let&#39;s say we knew a phrase was &#39;world&#39;s leading language software&#39;. And \n&gt; &gt; we normally heard that phrase in a single voice. If we heard that phrase with the last\n&gt; &gt; word changed to &#39;hardware&#39; in the same voice, that would suggest actual phonetic \n&gt; &gt; manipulation. Somy question: is there any good evidence of that sort of manipulation?\n&gt; &gt; \n&gt; &gt; I keep using the phrase &#39;good evidence&#39; to mean high quality sound that is easily\n&gt; &gt; understood without having to strain one&#39;s ears. The sample you gave in this\n&gt; &gt; case is for me a good example of what I am calling good or high-quality evidence.\n&gt; &gt;\n&gt;"}