{"id": "16933", "subject": "Re: Maybe they have a sense of humor?", "author": "trilobitegal", "timestamp": "2010-04-09T04:24:44Z", "full_text": "Hey, this is the note I wrote a couple of days ago, yet it is dated tomorrow in the wee hours.  It is now 4/8/10 at 10:21pm your time, Frank.  Can&#39;t figure this out!!\n\n--- In EVP-ITC@yahoogroups.com, &quot;trilobitegal&quot; &lt;flexicalymenemeeki@...&gt; wrote:\n&gt;\n&gt; Hi, Frank - Am sure many appreciated this communication, but have just been too busy with Easter to do much on the web.  I got a similar answer, but in a deep voice, when I asked for a cure for a specific type of cancer - lol!  I have a bunch of comedians around here. \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@&gt; wrote:\n&gt; &gt;\n&gt; &gt;  I mean--get a voice that seems to be really cool, and not one frikin&#39;\n&gt; &gt; person to share to with. I am not about to spend every waking moment after I\n&gt; &gt; retire building boxes for bozos that seek only fame and fortune, and only\n&gt; &gt; want a box to show off on all kinds of duffus shows, and never use the damn\n&gt; &gt; thing for anykind of intelligent communcation from the other side.\n&gt; &gt; \n&gt; &gt;  What torques my jaws is I get stuff that shows they manipulate the\n&gt; &gt; broadcast fragments to form messages and phrases, and I might well\n&gt; &gt; demonstrate it to my dogs, as it is always ignored on all groups.  Everyone\n&gt; &gt; is too damn busy doing shows and bogus investigations to actually figure out\n&gt; &gt; how this stuff works. How to turn it to profit is the only question on most\n&gt; &gt; minds here.\n&gt; &gt; \n&gt; &gt;  For the one in 12 million that might be curious, they took athe ad fore\n&gt; &gt; Rosetta Stone software &quot;the natural way to learn a foreign language&quot; and\n&gt; &gt; changed it to &quot;the natural way to learn---sex!&quot;. Not demon enough, or ghost\n&gt; &gt; hunters enough for most I guess.\n&gt; &gt; \n&gt; &gt;  Frank-S\n&gt; &gt;\n&gt;"}