{"id": "16948", "subject": "Re: This File Is Hard to dismiss as actual communication [1 Attachment]", "author": "Urkel23", "timestamp": "2010-04-12T00:53:38Z", "full_text": "You do make a good point, but you&#39;re looking for the unlikely answer being of a skeptical nature.  I just know it was in response to my question immediately after i asked it.  My version of what i hear would make more sense to my question then what you possibly heard.  I wasn&#39;t looking for that specifically to come through, i just posted what i thought i heard.  I do believe that there is something going on here other than just random words relating to our questions.  I appreciate you taking the time to offer your opinion, that&#39;s what makes this field good.  Getting alternate ideas and not receiving stuff as fact, i&#39;m on board with that.\n\nThanx for listening,\n-Steve H.\n\n\n\n\n \n\n--- In EVP-ITC@yahoogroups.com, Rj &lt;rasterer@...&gt; wrote:\n&gt;\n&gt; In my opinion, I think it&#39;s a classic example of  putting yourself in the context of looking to hear something, and then hearing what you want, and not considering the other possibilities.\n&gt; \n&gt; The answers &quot;Sweet Love&quot; and &quot;Shirt&quot; are just as easy to hear.  \n&gt; \n&gt; --- On Sun, 4/11/10, urkel23@... &lt;urkel23@...&gt; wrote:\n&gt; \n&gt; From: urkel23@... &lt;urkel23@...&gt;\n&gt; Subject: [EVP-ITC] This File Is Hard to dismiss as actual communication [1 Attachment]\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Sunday, April 11, 2010, 11:06 AM\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt;   \n&gt; \n&gt; \n&gt;     \n&gt;       \n&gt;               \n&gt;         [Attachment(s) from urkel23@... included below]\n&gt;         \n&gt;       \n&gt;       \n&gt; \n&gt; \n&gt;  \n&gt; I asked a specific question about the latest box i&#39;m building.  My \n&gt; question was simple and to the point &quot;Is it the board or the radio that&#39;s \n&gt; causing the problem?&quot;\n&gt;  \n&gt; The answer came seconds after asking it.  It was an intelligent \n&gt; response to my question.  I would like for someone to comment of this with \n&gt; the explanation of how they did that.  I just know they speak to me and i \n&gt; don&#39;t know how they do it.  There is still so much to learn about this \n&gt; field.\n&gt;  \n&gt; -Steve H.\n&gt;  \n&gt;  \n&gt;  \n&gt; Steve Hultay\n&gt; www.keyportparanorm al.com\n&gt; http://tech. groups.yahoo. com/group/ rtsc/\n&gt; www.stevehultay. com\n&gt; www.rtscresearch. org\n&gt;"}