{"id": "16958", "subject": "Re: [EVP-ITC] Re: Horrorfest Paranormal Discussions", "author": "David Koenig", "timestamp": "2010-04-13T20:09:37Z", "full_text": "Really?\n\nOn Tue, Apr 13, 2010 at 3:03 PM, purplespacefriend &lt;\npurplealiengirl@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Dude! It&#39;s Rocky Mountain Paranormal, the same jerkweeds that set up the\n&gt; thing with Skepdork, and her &quot;experts&quot; that are analzying the box I I gave\n&gt; to them. Rocky Mountain Paranormal has never aknowledged a single e-mail\n&gt; from me, even though we&#39;re freaking neighbors. Nor have they ever asked me\n&gt; anything about the boxes, same as all the self proclaimed paranormal experts\n&gt; out there on every god damn site in the world. Rocky Mountain Paranormal\n&gt; refuses all input from me, yet will beat my up the boxes, I have Cds of past\n&gt; shows with these clowns. People wonder why I&#39;m pissed and fed up with\n&gt; everything in this field, it&#39;s all a bunch of ego postering babies chasing\n&gt; radio and TV shows, nothing else!\n&gt;\n&gt; AND why the damn Horror BS, all focusing on fear--cuz these freaking\n&gt; pre-adolesent dweebs in the paranormal can&#39;t get past Hollywood and Friday\n&gt; the 13th movies. It&#39;s like dealing with a bunch of 13 year olds.\n&gt;\n&gt; I don&#39;t have time that Halloween crap!\n&gt;\n&gt; F-S\n&gt;\n&gt;  \n&gt;\n\nReally?On Tue, Ap 13, 2010 a 3:03 PM, pu plespace iend pu plealiengi l@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n Dude! I 's Rocky Moun ain Pa ano mal, he same je kweeds ha se up he hing wi h Skepdo k, and he \"expe s\" ha a e analzying he box I I ga e o hem. Rocky Moun ain Pa ano mal has ne e aknowledged a single e-mail om me, e en hough we' e eaking neighbo s. No ha e hey e e asked me any hing abou he boxes, same as all he sel p oclaimed pa ano mal expe s ou he e on e e y god damn si e in he wo ld. Rocky Moun ain Pa ano mal e uses all inpu om me, ye will bea my up he boxes, I ha e Cds o pas shows wi h hese clowns. People wonde why I'm pissed and ed up wi h e e y hing in his ield, i 's all a bunch o ego pos e ing babies chasing adio and TV shows, no hing else! \n\n\nAND why he damn Ho o BS, all ocusing on ea --cuz hese eaking p e-adolesen dweebs in he pa ano mal can' ge pas Hollywood and F iday he 13 h mo ies. I 's like dealing wi h a bunch o 13 yea olds. \n\n\nI don' ha e ime ha Halloween c ap!\n\nF-S"}