{"id": "16956", "subject": "Re: [EVP-ITC] Re: Horrorfest Paranormal Discussions", "author": "Rj", "timestamp": "2010-04-13T19:46:02Z", "full_text": "--0-1661736124-1271187962=:6544\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nI will probably be at Horrorfest for some of this stuff. If you like, I can=\r\n pass your messages on to them in person,=C2=A0 and get their response to a=\r\nnything.=C2=A0 If you like to send me some emails I can hand them to them a=\r\nnd get responses.=C2=A0 And I could suggest they contact you for a setting =\r\nwhere you all could get together and develop some tests, do some Q&A (on vi=\r\ndeo so you have proof if they blow you off or cheat) so that you can be abs=\r\nolutely assured of that input?\n\nPardon me if I am reading your email incorr=\r\nectly though. I might be taking seriously some of your complaints and accus=\r\nations,=C2=A0 when all you really mean to do is vent.\n\n\n\n--- On Tue, 4/13/1=\r\n0, purplespacefriend &lt;purplealiengirl@...&gt; wrote:\n\nFrom: purplespacef=\r\nriend &lt;purplealiengirl@...&gt;\nSubject: [EVP-ITC] Re: Horrorfest Paranor=\r\nmal Discussions\nTo: EVP-ITC@yahoogroups.com\nDate: Tuesday, April 13, 2010, =\r\n12:03 PM\n\n\n\n\n\n\n\n=C2=A0\n\n\n\n  \n\n\n    \n      \n      \n       Dude! It&#39;s Rocky M=\r\nountain Paranormal, the same jerkweeds that set up the thing with Skepdork,=\r\n and her &quot;experts&quot; that are analzying the box I I gave to them. Rocky Mount=\r\nain Paranormal has never aknowledged a single e-mail from me, even though w=\r\ne&#39;re freaking neighbors. Nor have they ever asked me anything about the box=\r\nes, same as all the self proclaimed paranormal experts out there on every g=\r\nod damn site in the world. Rocky Mountain Paranormal refuses all input from=\r\n me, yet will beat my up the boxes, I have Cds of past shows with these clo=\r\nwns.   People wonder why I&#39;m pissed and fed up with everything in this fiel=\r\nd, it&#39;s all a bunch of ego postering babies chasing radio and TV shows, not=\r\nhing else! \n\n\n\nAND why the damn Horror BS, all focusing on fear--cuz these =\r\nfreaking pre-adolesent dweebs in the paranormal can&#39;t get past Hollywood an=\r\nd Friday the 13th movies. It&#39;s like dealing with a bunch of 13 year olds. \n=\r\n\n\n\nI don&#39;t have time that Halloween crap!\n\n\n\nF-S\n\n\n\n\n\n    \n     \n\n    \n    =\r\n\n\n\n \n\n\n\n  \n\n\n\n\n\n\n      \r\n--0-1661736124-1271187962=:6544\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;I will probably be at Horrorfest for some of =\r\nthis stuff. If you like, I can pass your messages on to them in person,&nbs=\r\np; and get their response to anything.&nbsp; If you like to send me some em=\r\nails I can hand them to them and get responses.&nbsp; And I could suggest t=\r\nhey contact you for a setting where you all could get together and develop =\r\nsome tests, do some Q&amp;A (on video so you have proof if they blow you of=\r\nf or cheat) so that you can be absolutely assured of that input?&lt;br&gt;&lt;br&gt;Par=\r\ndon me if I am reading your email incorrectly though. I might be taking ser=\r\niously some of your complaints and accusations,&nbsp; when all you really m=\r\nean to do is vent.&lt;br&gt;&lt;br&gt;&lt;br&gt;&lt;br&gt;--- On &lt;b&gt;Tue, 4/13/10, purplespacefriend=\r\n &lt;i&gt;&lt;purplealiengirl@...&gt;&lt;/i&gt;&lt;/b&gt; wrote:&lt;br&gt;&lt;blockquote style=\r\n=3D&quot;border-left: 2px solid rgb(16, 16, 255); margin-left: 5px; padding-left=\r\n:\n 5px;&quot;&gt;&lt;br&gt;From: purplespacefriend &lt;purplealiengirl@...&gt;&lt;br&gt;S=\r\nubject: [EVP-ITC] Re: Horrorfest Paranormal Discussions&lt;br&gt;To: EVP-ITC@yaho=\r\nogroups.com&lt;br&gt;Date: Tuesday, April 13, 2010, 12:03 PM&lt;br&gt;&lt;br&gt;&lt;div id=3D&quot;yi=\r\nv1175418283&quot;&gt;\n\n\n\n\n\n&lt;span style=3D&quot;display: none;&quot;&gt;&nbsp;&lt;/span&gt;\n\n\n\n    &lt;div=\r\n id=3D&quot;ygrp-text&quot;&gt;\n      \n      \n      &lt;p&gt; Dude! It&#39;s Rocky Mountain Parano=\r\nrmal, the same jerkweeds that set up the thing with Skepdork, and her &quot;expe=\r\nrts&quot; that are analzying the box I I gave to them. Rocky Mountain Paranormal=\r\n has never aknowledged a single e-mail from me, even though we&#39;re freaking =\r\nneighbors. Nor have they ever asked me anything about the boxes, same as al=\r\nl the self proclaimed paranormal experts out there on every god damn site i=\r\nn the world. Rocky Mountain Paranormal refuses all input from me, yet will =\r\nbeat my up the boxes, I have Cds of past shows with these clowns.   People =\r\nwonder why I&#39;m pissed and fed up with everything in this field, it&#39;s all a =\r\nbunch of ego postering babies chasing radio and TV shows, nothing else! &lt;br=\r\n&gt;\n&lt;br&gt;\nAND why the damn Horror BS, all focusing on fear--cuz these freaking=\r\n pre-adolesent dweebs in the paranormal can&#39;t get past Hollywood and Friday=\r\n the 13th movies. It&#39;s like dealing with a bunch of 13 year olds. &lt;br&gt;\n&lt;br&gt;=\r\n\nI don&#39;t have time that Halloween crap!&lt;br&gt;\n&lt;br&gt;\nF-S&lt;br&gt;\n&lt;br&gt;\n&lt;/p&gt;\n\n    &lt;/d=\r\niv&gt;\n     \n\n\n\n \n\n\n&lt;/div&gt;&lt;/blockquote&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n      \r\n--0-1661736124-1271187962=:6544--"}