{"id": "16987", "subject": "Re: [EVP-ITC] Re: Bloody Mary and Ouija", "author": "David Koenig", "timestamp": "2010-04-20T17:29:59Z", "full_text": "I understand. Sometimes scientists give something a name like Ideomotor\nResponse but they really have no explanation. They just have a Name that\nthey like to call it! And then they say they&#39;ve debunked it or something\nequally as silly.\n\nOn Tue, Apr 20, 2010 at 1:07 PM, Frank Sumption\n&lt;purplealiengirl@...&gt;wrote:\n\n&gt;\n&gt;\n&gt;  I have to ask--How much experience do you have using the quija board,\n&gt; and/or other methods?\n&gt;\n&gt;  There is no shortage of people that give their opinions on how these\n&gt; communications work, there is a shortage of people that honestly understand.\n&gt;\n&gt;\n&gt;  Yes, you can get get operator influence with any of these methods, but it\n&gt; seems too tempting for the skeptic/debunker to throw all out as if it&#39;s all\n&gt; explained. Could it be that you own mind has access to levels you are not\n&gt; aware of, perhaps spiritual contacts, or higher levels of being?\n&gt;\n&gt;  I think it&#39;s a bit of everything, there is external contact, and there is\n&gt; some of just the mind talking to itself through these methods. I have always\n&gt; said you have to be careful that you don&#39;t create the evidence you are\n&gt; looking for, but I am conveniently ignored.\n&gt;\n&gt;\n&gt;  F-S\n&gt;\n&gt; On Tue, Apr 20, 2010 at 9:26 AM, John S &lt;phenom_investigator@...&gt;wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;  As has been said, one of  the most likely explanations for the Ouija is\n&gt;&gt; the working of the mind.\n&gt;&gt; What is somewhat at issue, as is so often the case when discussing\n&gt;&gt; apparent discarnate\n&gt;&gt; communications, is the actual source of the apparent intelligence.\n&gt;&gt;\n&gt;&gt; Micromuscular reactions do indeed appear to be one source of the Ouija\n&gt;&gt; when operators are\n&gt;&gt; in contact with the planchette. But this is only one category of Ouija\n&gt;&gt; interactions. There is\n&gt;&gt; another completely different category where no operator is touching the\n&gt;&gt; board or the planchette,\n&gt;&gt; and yet it moves and remains in motion, often changing directions or\n&gt;&gt; flying off the board. This\n&gt;&gt; type of activity is more akin to psychokinesis, the mind affecting the\n&gt;&gt; environment.\n&gt;&gt;\n&gt;&gt; Both types of activity could be mediated in the mind of a living operator,\n&gt;&gt; and in fact modern\n&gt;&gt; parapsychology research suggest this is the most reasonable explanation.\n&gt;&gt; But again the\n&gt;&gt; source of the information thus presented is at question and is currently\n&gt;&gt; unknown.\n&gt;&gt;\n&gt;&gt; Against this backdrop it would seem that it would be quite difficult to\n&gt;&gt; demonstrate with\n&gt;&gt; any clarity or precision that any specific individual (living or deceased)\n&gt;&gt; was indeed affecting\n&gt;&gt; the Ouija (or any other device for that matter). It would all come down to\n&gt;&gt; beliefs which is the\n&gt;&gt; best we can hope for at this time.\n&gt;&gt;\n&gt;&gt; So &#39;scientific&#39; proof per se is off the table if you define &#39;scientific&#39;\n&gt;&gt; in the classic sense.\n&gt;&gt; If you mean objective proof, in some way documenting activity such as by\n&gt;&gt; video for example,\n&gt;&gt; that is a different matter. But to be very clear, this would not be\n&gt;&gt; considered scientific proof\n&gt;&gt; because you are cannot demonstrate the causation. You can however document\n&gt;&gt; the effect.\n&gt;&gt;\n&gt;&gt; Blood Mary (the ritual of Mary Worth) is considered by most to be\n&gt;&gt; folk-legend. So it would\n&gt;&gt; be difficult, would it not, to ascertain who in fact you were\n&gt;&gt; communicating with. And again,\n&gt;&gt; there is a real possiblity, based on existing lab research from the past\n&gt;&gt; many decades that\n&gt;&gt; you just might be communicating with yourself.\n&gt;&gt;\n&gt;&gt; Best of luck in your endeavors!\n&gt;&gt;\n&gt;&gt; -------\n&gt;&gt;\n&gt;&gt; Hey guys,\n&gt;&gt;\n&gt;&gt; I am doing some research on the Bloody Mary ritual and Ouija Boards. I am\n&gt;&gt;\n&gt;&gt; looking for anyone with stories or experiences from those that would be\n&gt;&gt; willing  to share them - as well as any research and evidence you may have\n&gt;&gt;\n&gt;&gt; gathered from  them. I am looking to bring the folklore together with the\n&gt;&gt; history, science and  experience.\n&gt;&gt;\n&gt;&gt; Thanks.\n&gt;&gt;\n&gt;&gt; Dwayne Claud\n&gt;&gt; _Dwayne@..._ (mailto:Dwayne@...)\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;  \n&gt;\n\nI unde s and. Some imes scien is s gi e some hing a name like Ideomo o Response bu hey eally ha e no explana ion. They jus ha e a Name ha hey like o call i ! And hen hey say hey' e debunked i o some hing equally as silly.\nOn Tue, Ap 20, 2010 a 1:07 PM, F ank Sump ion pu plealiengi l@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n  I ha e o ask--How much expe ience do you ha e using he quija boa d, and/o o he me hods?\n \n The e is no sho age o people ha gi e hei opinions on how hese communica ions wo k, he e is a sho age o people ha hones ly unde s and. \n \n Yes, you can ge ge ope a o in luence wi h any o hese me hods, bu i seems oo emp ing o he skep ic/debunke o h ow all ou as i i 's all explained. Could i be ha you own mind has access o le els you a e no awa e o , pe haps spi i ual con ac s, o highe le els o being?\n\n\n \n I hink i 's a bi o e e y hing, he e is ex e nal con ac , and he e is some o jus he mind alking o i sel h ough hese me hods. I ha e always said you ha e o be ca e ul ha you don' c ea e he e idence you a e looking o , bu I am con enien ly igno ed. \n\n\n \n \n F-S\n \nOn Tue, Ap 20, 2010 a 9:26 AM, John S phenom_in es iga o @...> w o e:\n\n  \n\n\n\n\n\nAs has been said, one o    he mos likely explana ions o he Ouija is he wo king o he mind.\nWha is somewha a issue, as is so o en he case when discussing appa en disca na e \ncommunica ions, is he ac ual sou ce o he appa en in elligence.\n \nMic omuscula eac ions do indeed appea o be one sou ce o he Ouija when ope a o s a e\nin con ac wi h he planche e. Bu his is only one ca ego y o Ouija in e ac ions. The e is\nano he comple ely di e en ca ego y whe e no ope a o is ouching he boa d o he planche e,\nand ye i mo es and emains in mo ion, o en changing di ec ions o lying o he boa d. This\n ype o ac i i y is mo e akin o psychokinesis, he mind a ec ing he en i onmen .\n \nBo h ypes o ac i i y could be media ed in he mind o a li ing ope a o , and in ac mode n\npa apsychology esea ch sugges his is he mos easonable explana ion. Bu again he \nsou ce o he in o ma ion hus p esen ed is a ques ion and is cu en ly unknown.\n \nAgains his backd op i would seem ha i would be qui e di icul o demons a e wi h\nany cla i y o p ecision ha any speci ic indi idual (li ing o deceased) was indeed a ec ing\n he Ouija (o any o he de ice o ha ma e ). I would all come down o belie s which is he\nbes we can hope o a his ime.\n \nSo 'scien i ic' p oo pe se is o he able i you de ine 'scien i ic' in he classic sense.\nI you mean objec i e p oo , in some way documen ing ac i i y such as by ideo o example,\n ha is a di e en ma e . Bu o be e y clea , his would no be conside ed scien i ic p oo \nbecause you a e canno demons a e he causa ion. You can howe e documen he e ec .\n \nBlood Ma y ( he i ual o Ma y Wo h) is conside ed by mos o be olk-legend. So i would \nbe di icul , would i no , o asce ain who in ac you we e communica ing wi h. And again, \n he e is a eal possibli y, based on exis ing lab  esea ch om he pas many decades ha \nyou jus migh be communica ing wi h you sel .\n \nBes o luck in you endea o s!\n \n-------\n\nHey guys,I am doing some esea ch on he Bloody Ma y i ual and Ouija Boa ds. I am  looking o anyone wi h s o ies o expe iences om hose ha would be willing  o sha e hem - as well as any esea ch and e idence you may ha e \n\nga he ed om  hem. I am looking o b ing he olklo e oge he wi h he his o y, science and  expe ience.Thanks.Dwayne Claud_Dwayne@..._ (mail o:Dwayne@...)"}