{"id": "17010", "subject": "Re: [EVP-ITC] and it gets freakier. [1 Attachment]", "author": "April Abercrombie", "timestamp": "2010-04-22T17:11:48Z", "full_text": "&quot;Psychology works better than any other method.&quot;\n\nYes. As a matter of fact, paredolia is used in Psychology. It is a known\nphenomena. Pareidolia is a function of the physical brain. Has nothing to do\nwith magick, your spirit, etc.\n\nJust sayin&#39; :)\n\nOn Thu, Apr 22, 2010 at 10:20 AM, Frank Sumption\n&lt;purplealiengirl@...&gt;wrote:\n\n&gt;\n&gt;  [Attachment(s) &lt;#1282651bb9911b4c_TopText&gt; from Frank Sumption included\n&gt; below]\n&gt;\n&gt;  For crying out loud!! It means the god damn skeptics gots ya so freaking\n&gt; brainwashed that nothing is acceptable and they have robbed you and everyone\n&gt; else of your magic! That is your spirit. I, and apparently I am the only\n&gt; one, will not lay down and let the NAZI jerks diminish me into oblivion! If\n&gt; you are just a piece of meat how can you have any value or importance? You\n&gt; are just a worker drone to some corporate-fascist NAZI rich prick that pays\n&gt; these debunker/skeptics to keep your dumbass in line! Psychology works\n&gt; better than any other method. I can tell you for what--there is a huge comet\n&gt; coming, it&#39;s gonna hit and these jerks don&#39;t want hords of unwashed masses\n&gt; over running their bunkers-you are just supposed to lay down and die!\n&gt;\n&gt;  No-No, let them convince you I am just some loud mouth hillbilly, my words\n&gt; mean nothing.\n&gt;\n&gt;  Yeah, meeeeza had about enough talking/typing to the brain dead. Ya can&#39;t\n&gt; discuss anything, ya can&#39;t present any &quot;evidence&quot;, ya can&#39;t show there&#39;s\n&gt; other methods. It&#39;s freaking useless!\n&gt;\n&gt;  The voice-from TRF, as if anyone will listen--&quot;See There&#39;s a Huge\n&gt; Comet--It Moves The Opposite Way--It&#39;s Gonna Kill Us&quot;. I know! Y&#39;all know\n&gt; better, so I&#39;ll stop now.\n&gt;\n&gt;  Maybe I am wrong and voices are wrong-- I don&#39;t care, at least I can stand\n&gt; up and speak what I think is important, even if it is against the party\n&gt; line.\n&gt;\n&gt;  Frank-S\n&gt;\n&gt; On Thu, Apr 22, 2010 at 7:25 AM, April Abercrombie &lt;\n&gt; april@...&gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; It means your brains is functioning as it should ;)\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; On Wed, Apr 21, 2010 at 8:52 PM, Frank Sumption &lt;\n&gt;&gt; purplealiengirl@...&gt; wrote:\n&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;  What I meant is this stuff is easliy dismissed by the brainiacs the\n&gt;&gt;&gt; &quot;know better&quot;, I&#39;m not so fast to dismiss it as meaningless.\n&gt;&gt;&gt;\n&gt;&gt;&gt;  F-S\n&gt;&gt;&gt;\n&gt;&gt;&gt; On Wed, Apr 21, 2010 at 6:33 PM, April Abercrombie &lt;\n&gt;&gt;&gt; april@abercrombieghostresearch.com&gt; wrote:\n&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; That is right. It is only pareidolia. But it is uncanny.\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;  On Wed, Apr 21, 2010 at 3:26 PM, Frank Sumption &lt;\n&gt;&gt;&gt;&gt; purplealiengirl@...&gt; wrote:\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt;  [Attachment(s)&lt;https://mail.google.com/mail/?ui=2&view=js&name=js&ver=RxLTyuhykO4.en.&am=%21YQiGgwtZmyiRZdzVEfQ0TrVu7INPbDRsuoVhBERCQu3eF_r1&fri#12822f52e80ca26a_1282243e3fb0a6dd_TopText&gt;from Frank Sumption included below]\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt;  The volcano holes look like a skull---AKA death mask. Don&#39;t look, it&#39;s\n&gt;&gt;&gt;&gt;&gt; just your mind trying to make sense out fof the vast meaningless\n&gt;&gt;&gt;&gt;&gt; universe--and there&#39;s no one behind the curtain.\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt;  F-S\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;\n&gt;  \n&gt;\n\n\"Psychology wo ks be e han any o he me hod.\"Yes. As a ma e o ac , pa edolia is used in Psychology. I is a known phenomena. Pa eidolia is a unc ion o he physical b ain. Has no hing o do wi h magick, you spi i , e c.\nJus sayin' :)On Thu, Ap 22, 2010 a 10:20 AM, F ank Sump ion pu plealiengi l@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n [A achmen (s) om F ank Sump ion included below]\n \n \n  Fo c ying ou loud!! I means he god damn skep ics go s ya so eaking b ainwashed ha no hing is accep able and hey ha e obbed you and e e yone else o you magic! Tha is you spi i . I, and appa en ly I am he only one, will no lay down and le he NAZI je ks diminish me in o obli ion! I you a e jus a piece o mea how can you ha e any alue o impo ance? You a e jus a wo ke d one  o some co po a e- ascis NAZI ich p ick ha pays hese debunke /skep ics o keep you dumbass in line! Psychology wo ks be e han any o he me hod. I can ell you o wha -- he e is a huge come coming, i 's gonna hi and hese je ks don' wan ho ds o unwashed masses o e unning hei bunke s-you a e jus supposed o lay down and die!\n\n\n \n No-No, le hem con ince you I am jus some loud mou h hillbilly, my wo ds mean no hing. \n \n Yeah, meeeeza had abou enough alking/ yping o he b ain dead. Ya can' discuss any hing, ya can' p esen any \"e idence\", ya can' show he e's o he me hods. I 's eaking useless! \n\n\n \n The oice- om TRF, as i anyone will lis en--\"See The e's a Huge Come --I Mo es The Opposi e Way--I 's Gonna Kill Us\". I know! Y'all know be e , so I'll s op now. \n \n Maybe I am w ong and oices a e w ong-- I don' ca e, a leas I can s and up and speak wha I hink is impo an , e en i i is agains he pa y line.\n \n F ank-S\nOn Thu, Ap 22, 2010 a 7:25 AM, Ap il Abe c ombie ap il@abe c ombieghos esea ch.com> w o e:\n\n\n  \n\n\n\nI means you b ains is unc ioning as i should ;) \n\nOn Wed, Ap 21, 2010 a 8:52 PM, F ank Sump ion pu plealiengi l@...> w o e:\n\n  \n\n\n\n\n Wha I mean is his s u is easliy dismissed by he b ainiacs he \"know be e \", I'm no so as o dismiss i as meaningless. \n \n F-S\nOn Wed, Ap 21, 2010 a 6:33 PM, Ap il Abe c ombie ap il@...> w o e:\n\n\n\n  \n\n\n\nTha is igh . I is only pa eidolia. Bu i is uncanny.\n\nOn Wed, Ap 21, 2010 a 3:26 PM, F ank Sump ion pu plealiengi l@gmail.com> w o e:\n\n  \n\n\n\n[A achmen (s) om F ank Sump ion included below] \n\n\n\n\n The olcano holes look like a skull---AKA dea h mask. Don' look, i 's jus you mind ying o make sense ou o he as meaningless uni e se--and he e's no one behind he cu ain.\n \n F-S"}