{"id": "17022", "subject": "Re: [EVP-ITC] Pareidolia this!! [1 Attachment]", "author": "April Abercrombie", "timestamp": "2010-04-22T23:04:55Z", "full_text": "Oh Frank...what are we gunna do with you???\n\nOn Thu, Apr 22, 2010 at 11:47 AM, Frank Sumption\n&lt;purplealiengirl@...&gt;wrote:\n\n&gt;\n&gt;  [Attachment(s) &lt;#12826a1ca9fd9137_TopText&gt; from Frank Sumption included\n&gt; below]\n&gt;\n&gt;  The meaning clear, it&#39;s freaking image of a comet. No-no, don&#39;t you dare\n&gt; look at the clouds, you just might &quot;imagine&quot; you see something. Don&#39;t listen\n&gt; to Frank&#39;s Broken radio, you might &quot;imagine&quot; you hear something. Don&#39;t try\n&gt; to think, you are certainly not qualified, that takes a university degree!\n&gt;\n&gt;  I guess the paranormal has to fit into a very narrow well defined\n&gt; spectrum, or it must be ignored. It&#39;s not just the doomsville voices, all\n&gt; that don&#39;t fit in the already well defined paranormal must be rejected--who\n&gt; the hell says so!!!? Everyone out there knows spirits and ghosts dont have\n&gt; sex, they don&#39;t eat, they don&#39;t sleep, and they can only function in dark\n&gt; moldy basemens. God Almighty!\n&gt;\n&gt; F-S\n&gt;  \n&gt;\n\nOh F ank...wha a e we gunna do wi h you???On Thu, Ap 22, 2010 a 11:47 AM, F ank Sump ion pu plealiengi l@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n [A achmen (s) om F ank Sump ion included below]\n \n \n  The meaning clea , i 's eaking image o a come . No-no, don' you da e look a he clouds, you jus migh \"imagine\" you see some hing. Don' lis en o F ank's B oken adio, you migh \"imagine\" you hea some hing. Don' y o hink, you a e ce ainly no quali ied, ha akes a uni e si y deg ee!  \n\n\n \n I guess he pa ano mal has o i in o a e y na ow well de ined spec um, o i mus be igno ed. I 's no jus he dooms ille oices, all ha don' i in he al eady well de ined pa ano mal mus be ejec ed--who he hell says so!!!? E e yone ou he e knows spi i s and ghos s don ha e sex, hey don' ea , hey don' sleep, and hey can only unc ion in da k moldy basemens. God Almigh y!  \n\n\n \nF-S"}