{"id": "17047", "subject": "Re: [EVP-ITC] nuff said?", "author": "April Abercrombie", "timestamp": "2010-04-23T22:30:25Z", "full_text": "Pareidolia is not psuedo science. It is an actual, proven, natural\nfunctioning of the brain.\n\nhttp://en.wikipedia.org/wiki/Pareidolia\n\nPlease read this article, and more, if you have any questions about it being\npsuedo science. I chose the Wikipedia version because I thought it would be\nthe least offensive to you. Other articles specifically called out EVP and\nother things.\n\nFor the record, I don&#39;t think all EVP&#39;s are due to pareidolia.\n\n\nOn Fri, Apr 23, 2010 at 3:47 PM, Frank Sumption\n&lt;purplealiengirl@...&gt;wrote:\n\n&gt;\n&gt;\n&gt;  It was implied that all this stuff is &quot;Pareidolia&quot;, and because you could\n&gt; put a name on it that somehow meant it was all explanined. I&#39;ve been hearing\n&gt; this pseudo scientific BS for 10 years, so I&#39;m a bit touchy. Science\n&gt; explains the paranormal away, and yet people continune to photograph images,\n&gt; and get their names, and the names of deseased loved ones through EVP, as\n&gt; well as questions answered, and science(althogh not all scientists) just\n&gt; ignores these inconvinient facts and focuses on that we might see things\n&gt; that are not there, which I disagree with as well.\n&gt;\n&gt;  Did you even bother looking at the image on the group home page. That was\n&gt; from sweeping a TV tuner with a random voltage and video recording the\n&gt; monitor screen. So explain away why there is a wolf image embedded in the\n&gt; guy&#39;s hat, an image of an alien below his ear, and why in God&#39;s name does he\n&gt; resembles the classic description of an MIB or Shadow Person?  Pareidolia no\n&gt; doubt!\n&gt;\n&gt;  F-S\n&gt;\n&gt; On Fri, Apr 23, 2010 at 3:19 PM, Rj &lt;rasterer@yahoo.com&gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;   I&#39;m not sure who you&#39;re talking to about &quot;holier than thou&quot;.  But, you\n&gt;&gt; are the one who keeps dismissing any question about results and testing with\n&gt;&gt; phrases like &quot;Bite Me&quot;. I don&#39;t see anyone else doing that, and I certainly\n&gt;&gt; never have.\n&gt;&gt;\n&gt;&gt; I agree trying new things is good.  And discussing results.  And looking\n&gt;&gt; for new directions.   So I&#39;m still not sure who you are upset with.  Perhaps\n&gt;&gt; you could be more specific: quote what you have found objectionable, and let\n&gt;&gt; us know why?\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; --- On *Fri, 4/23/10, Frank Sumption &lt;purplealiengirl@...&gt;* wrote:\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt;&gt; Subject: [EVP-ITC] nuff said?\n&gt;&gt; To: evp-itc@yahoogroups.com\n&gt;&gt; Date: Friday, April 23, 2010, 12:59 PM\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; &quot;Congratulations! bulletbabea has changed your membership status for the\n&gt;&gt; group EVP-ITC from Member to Moderator.&quot;\n&gt;&gt;\n&gt;&gt;  Go ahead skepdorks, make my day!  I don&#39;t mind some honest debate, but\n&gt;&gt; not this holier than thou science BS, where you think cuz you stick a label\n&gt;&gt; on something it can be dismissed as thoroughly debunked. Maybe--I&#39;m easily\n&gt;&gt; offended, and I&#39;ll take that into account.\n&gt;&gt;\n&gt;&gt;  F-S\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;  \n&gt;\n\nPa eidolia is no psuedo science. I is an ac ual, p o en, na u al unc ioning o he b ain.h p://en.wikipedia.o g/wiki/Pa eidoliaPlease ead his a icle, and mo e, i you ha e any ques ions abou i being psuedo science. I chose he Wikipedia e sion because I hough i would be he leas o ensi e o you. O he a icles speci ically called ou EVP and o he hings.\nFo he eco d, I don' hink all EVP's a e due o pa eidolia.On F i, Ap 23, 2010 a 3:47 PM, F ank Sump ion pu plealiengi l@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n  I was implied ha all his s u is \"Pa eidolia\", and because you could pu a name on i ha somehow mean i was all explanined. I' e been hea ing his pseudo scien i ic BS o 10 yea s, so I'm a bi ouchy. Science explains he pa ano mal away, and ye people con inune o pho og aph images, and ge hei names, and he names o deseased lo ed ones h ough EVP, as well as ques ions answe ed, and science(al hogh no all scien is s) jus igno es hese incon inien ac s and ocuses on  ha we migh see hings ha a e no he e, which I disag ee wi h as well. \n\n\n \n Did you e en bo he looking a he image on he g oup home page. Tha was om sweeping a TV une wi h a andom ol age and ideo eco ding he moni o sc een. So explain away why he e is a wol image embedded in he guy's ha , an image o an alien below his ea , and why in God's name does he esembles he classic desc ip ion o an MIB o  Shadow Pe son?  Pa eidolia no doub !\n\n\n \n F-S\nOn F i, Ap 23, 2010 a 3:19 PM, Rj as e e @yahoo.com> w o e:\n\n  \n\n\n\n\n\n\n\nI'm no su e who you' e alking o abou \"holie han hou\".  Bu , you a e he one who keeps dismissing any ques ion abou esul s and es ing wi h ph ases like \"Bi e Me\". I don' see anyone else doing ha , and I ce ainly ne e ha e.\n\nI ag ee ying new hings is good.  And discussing esul s.  And looking o new di ec ions.   So I'm s ill no su e who you a e upse wi h.  Pe haps you could be mo e speci ic: quo e wha you ha e ound objec ionable, and le us know why?\n\n--- On F i, 4/23/10, F ank Sump ion pu plealiengi l@...> w o e:\nF om: F ank Sump ion pu plealiengi l@...>Subjec : [EVP-ITC] nu said?To: e p-i c@yahoog oups.com\n\nDa e: F iday, Ap il 23, 2010, 12:59 PM \n\n\n\n  \n\n\n\"Cong a ula ions! bulle babea has changed you membe ship s a us o heg oup EVP-ITC om Membe o Mode a o .\" \n \n Go ahead skepdo ks, make my day!  I don' mind some hones deba e, bu no his holie han hou science BS, whe e you hink cuz you s ick a label on some hing i can be dismissed as ho oughly debunked. Maybe--I'm easily o ended, and I'll ake ha in o accoun . \n\n\n \n F-S"}