{"id": "17049", "subject": "Re: [EVP-ITC] I need help, please.", "author": "April Abercrombie", "timestamp": "2010-04-23T22:52:37Z", "full_text": "Have you considered that it may just be energy, and not a sentient being?\n\nIt sounds like a typical poltergeist case.\n\n\nOn Fri, Apr 23, 2010 at 4:47 PM, Azure D &lt;azuredamselfly@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; I am Annie. I have not written much but have visaully followed this group\n&gt; over the past year. I have much experience in the realm of the paranormal.\n&gt;\n&gt; Here is the issue. Our home has an inhabitant that we cannot seem to\n&gt; remove. It does not speak to us on the frank&#39;s box nor will it communicate\n&gt; through either me or my partner, Jay. We are both mediums. It slams and\n&gt; bangs in the house almost ceaselessly at night. It hits the walls, windows,\n&gt; the tv, the bedside tables and the doors. I am at a loss as to how to\n&gt; otherwise communicate because as I said with the 2 boxes we have, it won&#39;t\n&gt; speak.\n&gt;\n&gt; I am open to any and all suggestions. We have told it to go, tried many\n&gt; different suggested rituals and to no avail. It will go quiet for a day to\n&gt; three days after ritual work but begins again, only louder.\n&gt;\n&gt; Please, if anyone can help or direct us to someone who can I would be most\n&gt; grateful.\n&gt;\n&gt; Sincerely,\n&gt; Annie & Jay C.\n&gt;\n&gt;  \n&gt;\n\nHa e you conside ed ha i may jus be ene gy, and no a sen ien being?I sounds like a ypical pol e geis case.On F i, Ap 23, 2010 a 4:47 PM, Azu e D azu edamsel ly@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n I am Annie. I ha e no w i en much bu ha e isaully ollowed his g oup o e he pas yea . I ha e much expe ience in he ealm o he pa ano mal. \n\nHe e is he issue. Ou home has an inhabi an ha we canno seem o emo e. I does no speak o us on he ank's box no will i communica e h ough ei he me o my pa ne , Jay. We a e bo h mediums. I slams and bangs in he house almos ceaselessly a nigh . I hi s he walls, windows, he , he bedside ables and he doo s. I am a a loss as o how o o he wise communica e because as I said wi h he 2 boxes we ha e, i won' speak.\n\n\nI am open o any and all sugges ions. We ha e old i o go, ied many di e en sugges ed i uals and o no a ail. I will go quie o a day o h ee days a e i ual wo k bu begins again, only loude .\n \nPlease, i anyone can help o di ec us o someone who can I would be mos g a e ul.\n\nSince ely,\nAnnie & Jay C."}