{"id": "17055", "subject": "Re: [EVP-ITC] I need help, please.", "author": "April Abercrombie", "timestamp": "2010-04-24T00:57:35Z", "full_text": "Your welcome :)\n\nOn Fri, Apr 23, 2010 at 5:36 PM, AzureDamselfly &lt;azuredamselfly@...&gt;wrote:\n\n&gt;\n&gt;\n&gt; Thank you, again.\n&gt;\n&gt; Jay wondered if it was something with a lack of consciousness or simply\n&gt; unaware of us. We will give your suggestions a try. And yes, I&#39;ve had\n&gt; literal entities refuse to leave.\n&gt;\n&gt; I hope you have a blessed day!\n&gt;\n&gt;\n&gt; Take every chance you get because some things only happen once...\n&gt;\n&gt; --- On *Fri, 4/23/10, April Abercrombie &lt;\n&gt; april@...&gt;* wrote:\n&gt;\n&gt;\n&gt; From: April Abercrombie &lt;april@...&gt;\n&gt; Subject: Re: [EVP-ITC] I need help, please.\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Friday, April 23, 2010, 7:26 PM\n&gt;\n&gt;\n&gt; Your welcome :)\n&gt;\n&gt; Poltergeist phenomena could also explain why it gets quieter after ritual,\n&gt; especially if the person from which the energy is stemming is involved in\n&gt; the ritual. The ritual lets the person release this energy in a constructive\n&gt; manner. After a while though, it builds back up.\n&gt;\n&gt; Also, people have reported seeing glimpses of apparitions even in\n&gt; poltergeist cases. So it is something for you to consider. That Jay sees the\n&gt; apparition could mean that the energy is coming from him.\n&gt;\n&gt; The good news is that if it is PK energy, it should go away eventually.\n&gt; Since it seems to relax after ritual, you may try some experiments with\n&gt; that. Have Jay do some personal ritual work and see if the phenomena\n&gt; subsides. If it doesn&#39;t subside, then do some personal ritual yourself and\n&gt; see what happens. Just see if you can effect or find some patten to it. If\n&gt; you are able to establish that it does consistently respond to ritual work\n&gt; by either of you, then that may be your answer. You just need to do some\n&gt; kind of regular ritual work to release the energy constructively.\n&gt;\n&gt; Even if it is an actual entity, since ritual does seem to affect it, this\n&gt; may still be your answer-maybe you can make a ritual around communicating\n&gt; with it.\n&gt;\n&gt; If it is an actual being, unfortunately there just is no sure fire method\n&gt; to make them leave. I am sure you have run into this before in your work as\n&gt; a medium - you can ask them to leave, but it&#39;s just like asking a living\n&gt; person to leave. If they don&#39;t want to go, they won&#39;t.\n&gt;\n&gt; My suggestion in this case would be to keep trying to communicate with it.\n&gt; Eventually hopefully you will get through to it.\n&gt;\n&gt;\n&gt; On Fri, Apr 23, 2010 at 4:56 PM, AzureDamselfly &lt;azuredamselfly@ yahoo.com&lt;http://us.mc841.mail.yahoo.com/mc/compose?to=azuredamselfly@...&gt;\n&gt; &gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;    Thank you , April. We wondered about that  as well. I just keep\n&gt;&gt; getting it is male. Jay said he saw a man standing behind him in the room\n&gt;&gt; when he looked in the full length mirror but upon turning around, no one was\n&gt;&gt; there. I thank you for taking the time to respond!\n&gt;&gt;\n&gt;&gt; Take every chance you get because some things only happen once...\n&gt;&gt;\n&gt;&gt; --- On *Fri, 4/23/10, April Abercrombie &lt;april@abercrombiegh ostresearch.\n&gt;&gt; com&lt;http://us.mc841.mail.yahoo.com/mc/compose?to=april@...&gt;\n&gt;&gt; &gt;* wrote:\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; From: April Abercrombie &lt;april@abercrombiegh ostresearch. com&lt;http://us.mc841.mail.yahoo.com/mc/compose?to=april@abercrombieghostresearch.com&gt;\n&gt;&gt; &gt;\n&gt;&gt;\n&gt;&gt; Subject: Re: [EVP-ITC] I need help, please.\n&gt;&gt; To: EVP-ITC@yahoogroups .com&lt;http://us.mc841.mail.yahoo.com/mc/compose?to=EVP-ITC@yahoogroups.com&gt;\n&gt;&gt; Date: Friday, April 23, 2010, 6:52 PM\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; Have you considered that it may just be energy, and not a sentient being?\n&gt;&gt;\n&gt;&gt; It sounds like a typical poltergeist case.\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; On Fri, Apr 23, 2010 at 4:47 PM, Azure D &lt;azuredamselfly@ yahoo.com&lt;http://us.mc841.mail.yahoo.com/mc/compose?to=azuredamselfly@...&gt;\n&gt;&gt; &gt; wrote:\n&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;  I am Annie. I have not written much but have visaully followed this\n&gt;&gt;&gt; group over the past year. I have much experience in the realm of the\n&gt;&gt;&gt; paranormal.\n&gt;&gt;&gt;\n&gt;&gt;&gt; Here is the issue. Our home has an inhabitant that we cannot seem to\n&gt;&gt;&gt; remove. It does not speak to us on the frank&#39;s box nor will it communicate\n&gt;&gt;&gt; through either me or my partner, Jay. We are both mediums. It slams and\n&gt;&gt;&gt; bangs in the house almost ceaselessly at night. It hits the walls, windows,\n&gt;&gt;&gt; the tv, the bedside tables and the doors. I am at a loss as to how to\n&gt;&gt;&gt; otherwise communicate because as I said with the 2 boxes we have, it won&#39;t\n&gt;&gt;&gt; speak.\n&gt;&gt;&gt;\n&gt;&gt;&gt; I am open to any and all suggestions. We have told it to go, tried many\n&gt;&gt;&gt; different suggested rituals and to no avail. It will go quiet for a day to\n&gt;&gt;&gt; three days after ritual work but begins again, only louder.\n&gt;&gt;&gt;\n&gt;&gt;&gt; Please, if anyone can help or direct us to someone who can I would be\n&gt;&gt;&gt; most grateful.\n&gt;&gt;&gt;\n&gt;&gt;&gt; Sincerely,\n&gt;&gt;&gt; Annie & Jay C.\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;\n&gt;  \n&gt;\n\nYou welcome :)On F i, Ap 23, 2010 a 5:36 PM, Azu eDamsel ly azu edamsel ly@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n Thank you, again.\n \nJay wonde ed i i was some hing wi h a lack o consciousness o simply unawa e o us. We will gi e you sugges ions a y. And yes, I' e had li e al en i ies e use o lea e. \n \nI hope you ha e a blessed day!\n Take e e y chance you ge because some hings only happen once...--- On F i, 4/23/10, Ap il Abe c ombie ap il@abe c ombieghos esea ch.com> w o e:\n\nF om: Ap il Abe c ombie ap il@...>\nSubjec : Re: [EVP-ITC] I need help, please.To: EVP-ITC@yahoog oups.comDa e: F iday, Ap il 23, 2010, 7:26 PM\n  \n\nYou welcome :)Pol e geis phenomena could also explain why i ge s quie e a e i ual, especially i he pe son om which he ene gy is s emming is in ol ed in he i ual. The i ual le s he pe son elease his ene gy in a cons uc i e manne . A e a while hough, i builds back up.\nAlso, people ha e epo ed seeing glimpses o appa i ions e en in pol e geis cases. So i is some hing o you o conside . Tha Jay sees he appa i ion could mean ha he ene gy is coming om him.The good news is ha i i is PK ene gy, i should go away e en ually. Since i seems o elax a e i ual, you may y some expe imen s wi h ha . Ha e Jay do some pe sonal i ual wo k and see i he phenomena subsides. I i doesn' subside, hen do some pe sonal i ual you sel and see wha happens. Jus see i you can e ec o ind some pa en o i . I you a e able o es ablish ha i does consis en ly espond o i ual wo k by ei he o \n you, hen ha may be you answe . You jus need o do some kind o egula i ual wo k o elease he ene gy cons uc i ely.E en i i is an ac ual en i y, since i ual does seem o a ec i , his may s ill be you answe -maybe you can make a i ual a ound communica ing wi h i .\nI i is an ac ual being, un o una ely he e jus is no su e i e me hod o make hem lea e. I am su e you ha e un in o his be o e in you wo k as a medium - you can ask hem o lea e, bu i 's jus like asking a li ing pe son o lea e. I hey don' wan o go, hey won' .\nMy sugges ion in his case would be o keep ying o communica e wi h i . E en ually hope ully you will ge h ough o i . \nOn F i, Ap 23, 2010 a 4:56 PM, Azu eDamsel ly azu edamsel ly@ yahoo.com> w o e:\n\n\n  \n\n\n\n\n\n\n\nThank you , Ap il. We wonde ed abou ha   as well. I jus keep ge ing i is male. Jay said he saw a man s anding behind him in he oom when he looked in he ull leng h mi o bu upon u ning a ound, no one was he e. I hank you o aking he ime o espond!\nTake e e y chance you ge because some hings only happen once...--- On F i, 4/23/10, Ap il Abe c ombie ap il@abe c ombiegh os esea ch. com> w o e:\n\nF om: Ap il Abe c ombie ap il@abe c ombiegh os esea ch. com>\nSubjec : Re: [EVP-ITC] I need help, please.To: EVP-ITC@yahoog oups .comDa e: F iday, Ap il 23, 2010, 6:52 PM\n\n  \n\nHa e you conside ed ha i may jus be ene gy, and no a sen ien being?I sounds like a ypical pol e geis case.\nOn F i, Ap 23, 2010 a 4:47 PM, Azu e D azu edamsel ly@ yahoo.com> w o e:\n\n\n  \n\n\n\nI am Annie. I ha e no w i en much bu ha e isaully ollowed his g oup o e he pas yea . I ha e much expe ience in he ealm o he pa ano mal. He e is he issue. Ou home has an inhabi an ha we canno seem o emo e. I does no speak o us on he ank's box no will i communica e h ough ei he me o my pa ne , Jay. We a e bo h mediums. I slams and bangs in he house almos ceaselessly a nigh . I hi s he walls, windows, he , he bedside ables and he doo s. I am a a loss as o how o o he wise communica e because as I said wi h he 2 boxes we ha e, i won' speak.\nI am open o any and all sugges ions. We ha e old i o go, ied many di e en sugges ed i uals and o no a ail. I will go quie o a day o h ee days a e i ual wo k bu begins again, only loude .Please, i anyone can help o di ec us o someone who can I would be mos g a e ul.\nSince ely,Annie & Jay\n C."}