{"id": "17057", "subject": "Re: [EVP-ITC] Re: nuff said?", "author": "April Abercrombie", "timestamp": "2010-04-24T02:18:10Z", "full_text": "Uh oh Frank!!!!!\n\nJust teasin&#39; ;)\n\nOn Fri, Apr 23, 2010 at 7:27 PM, purplespacefriend &lt;\npurplealiengirl@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Thanks! I hear &quot;them&quot; in my head from time to time.\n&gt;\n&gt; F-S\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, &quot;Andrea Carr&quot;\n&gt; &lt;fairlia@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Frank,\n&gt; &gt;\n&gt; &gt; Long before I began recording they where talking to me out loud too & you\n&gt; know i wondered about when it happened....they still come talk to me without\n&gt; recording & if there is someone else with me they hear it too...now I say\n&gt; this it is what it is!\n&gt; &gt;\n&gt; &gt; Andrea\n&gt; &gt; ----- Original Message -----\n&gt; &gt; From: Frank Sumption\n&gt; &gt; To: EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;\n&gt; &gt; Sent: Friday, April 23, 2010 8:29 PM\n&gt; &gt; Subject: Re: [EVP-ITC] nuff said?\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; I know what it is, even though I can&#39;t even spell it or pronounce it.\n&gt; It&#39;s what the skeptics and debunkers tout as the answer to all paranormal\n&gt; experience. I think we ought to pull our claws back in, especially me!\n&gt; &gt;\n&gt; &gt; I have gotten &quot;voices&quot; that I thought were perfectly clear, and no one\n&gt; else could hear it, and some I found was just a snippet of music, so yeah,\n&gt; that happens, but it does not eliminate or explain everything from the\n&gt; boxes, and other EVP methods, you just have to be aware of the possibility.\n&gt; Anotherr problem is broadcast fragments, sometimes they are just what they\n&gt; sound like, an ad for one thing or another, sometimes they can have\n&gt; sychronistic meaning, and sometimes they can be altered in some way to form\n&gt; a messages, such as the recent one I had about learning sex, which was\n&gt; seemingly ignored by all cuz it has the &quot;s&quot; word--I guess. The fragments can\n&gt; also be distorted as the radio tuning is swept across a station, I don&#39;t\n&gt; accept every word and syllable as meaning something. You have tio judge\n&gt; mnessage by content and personal meaning.\n&gt; &gt;\n&gt; &gt; I have seen faces stand up in a carpet right in front of me, not\n&gt; something I just happened across, something that happened live as I watched.\n&gt; For someone to suggest that&#39;s imagination I find very offensive.\n&gt; &gt;\n&gt; &gt; When I first switched to a linear sweep in the boxes, I could hear\n&gt; nothing but gibberish, then suddenly I could hear &quot;them&quot; speaking. I doubt\n&gt; that is all imagination either, I think the mind(which is not brain) has to\n&gt; reprogram the ears, which are brain, to hear. I also think the skeptics can\n&gt; not allow this programming to take place, hence they can&#39;t hear. I would be\n&gt; very surprised if any of the hard core skeptics even turned on a box for\n&gt; fear that they may hear something that&#39;s not there. Rorke(the Phd) implied\n&gt; as much when he wanted a box to test, or more like debunk. That crap is\n&gt; frikkin&#39; pathetic!\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; F-S\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; On Fri, Apr 23, 2010 at 4:30 PM, April Abercrombie &lt;april@...&gt; wrote:\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Pareidolia is not psuedo science. It is an actual, proven, natural\n&gt; functioning of the brain.\n&gt; &gt;\n&gt; &gt; http://en.wikipedia.org/wiki/Pareidolia\n&gt; &gt;\n&gt; &gt; Please read this article, and more, if you have any questions about it\n&gt; being psuedo science. I chose the Wikipedia version because I thought it\n&gt; would be the least offensive to you. Other articles specifically called out\n&gt; EVP and other things.\n&gt; &gt;\n&gt; &gt; For the record, I don&#39;t think all EVP&#39;s are due to pareidolia.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; On Fri, Apr 23, 2010 at 3:47 PM, Frank Sumption &lt;purplealiengirl@...&gt;\n&gt; wrote:\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; It was implied that all this stuff is &quot;Pareidolia&quot;, and because you could\n&gt; put a name on it that somehow meant it was all explanined. I&#39;ve been hearing\n&gt; this pseudo scientific BS for 10 years, so I&#39;m a bit touchy. Science\n&gt; explains the paranormal away, and yet people continune to photograph images,\n&gt; and get their names, and the names of deseased loved ones through EVP, as\n&gt; well as questions answered, and science(althogh not all scientists) just\n&gt; ignores these inconvinient facts and focuses on that we might see things\n&gt; that are not there, which I disagree with as well.\n&gt; &gt;\n&gt; &gt; Did you even bother looking at the image on the group home page. That was\n&gt; from sweeping a TV tuner with a random voltage and video recording the\n&gt; monitor screen. So explain away why there is a wolf image embedded in the\n&gt; guy&#39;s hat, an image of an alien below his ear, and why in God&#39;s name does he\n&gt; resembles the classic description of an MIB or Shadow Person? Pareidolia no\n&gt; doubt!\n&gt; &gt;\n&gt; &gt; F-S\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; On Fri, Apr 23, 2010 at 3:19 PM, Rj &lt;rasterer@...&gt; wrote:\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; I&#39;m not sure who you&#39;re talking to about &quot;holier than thou&quot;. But, you are\n&gt; the one who keeps dismissing any question about results and testing with\n&gt; phrases like &quot;Bite Me&quot;. I don&#39;t see anyone else doing that, and I certainly\n&gt; never have.\n&gt; &gt;\n&gt; &gt; I agree trying new things is good. And discussing results. And looking\n&gt; for new directions. So I&#39;m still not sure who you are upset with. Perhaps\n&gt; you could be more specific: quote what you have found objectionable, and let\n&gt; us know why?\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; --- On Fri, 4/23/10, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt; &gt; Subject: [EVP-ITC] nuff said?\n&gt; &gt; To: evp-itc@yahoogroups.com &lt;evp-itc%40yahoogroups.com&gt;\n&gt; &gt; Date: Friday, April 23, 2010, 12:59 PM\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; &quot;Congratulations! bulletbabea has changed your membership status for the\n&gt; &gt; group EVP-ITC from Member to Moderator.&quot;\n&gt; &gt;\n&gt; &gt; Go ahead skepdorks, make my day! I don&#39;t mind some honest debate, but not\n&gt; this holier than thou science BS, where you think cuz you stick a label on\n&gt; something it can be dismissed as thoroughly debunked. Maybe--I&#39;m easily\n&gt; offended, and I&#39;ll take that into account.\n&gt; &gt;\n&gt; &gt; F-S\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nUh oh F ank!!!!!Jus easin' ;)On F i, Ap 23, 2010 a 7:27 PM, pu plespace iend pu plealiengi l@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n Thanks! I hea \" hem\" in my head om ime o ime. \n\nF-S\n\n--- In EVP-ITC@yahoog oups.com, \"And ea Ca \" w o e:\n>\n> F ank,\n> \n> Long be o e I began eco ding hey whe e alking o me ou loud oo & you know i wonde ed abou when i happened.... hey s ill come alk o me wi hou eco ding & i he e is someone else wi h me hey hea i oo...now I say his i is wha i is!\n\n> \n> And ea\n> ----- O iginal Message ----- \n> F om: F ank Sump ion \n> To: EVP-ITC@yahoog oups.com \n> Sen : F iday, Ap il 23, 2010 8:29 PM\n> Subjec : Re: [EVP-ITC] nu said?\n> \n> \n> \n> \n> I know wha i is, e en hough I can' e en spell i o p onounce i . I 's wha he skep ics and debunke s ou as he answe o all pa ano mal expe ience. I hink we ough o pull ou claws back in, especially me!\n\n> \n> I ha e go en \" oices\" ha I hough we e pe ec ly clea , and no one else could hea i , and some I ound was jus a snippe o music, so yeah, ha happens, bu i does no elimina e o explain e e y hing om he boxes, and o he EVP me hods, you jus ha e o be awa e o he possibili y. Ano he p oblem is b oadcas agmen s, some imes hey a e jus wha hey sound like, an ad o one hing o ano he , some imes hey can ha e sych onis ic meaning, and some imes hey can be al e ed in some way o o m a messages, such as he ecen one I had abou lea ning sex, which was seemingly igno ed by all cuz i has he \"s\" wo d--I guess. The agmen s can also be dis o ed as he adio uning is swep ac oss a s a ion, I don' accep e e y wo d and syllable as meaning some hing. You ha e io judge mnessage by con en and pe sonal meaning. \n\n> \n> I ha e seen aces s and up in a ca pe igh in on o me, no some hing I jus happened ac oss, some hing ha happened li e as I wa ched. Fo someone o sugges ha 's imagina ion I ind e y o ensi e. \n\n> \n> When I i s swi ched o a linea sweep in he boxes, I could hea no hing bu gibbe ish, hen suddenly I could hea \" hem\" speaking. I doub ha is all imagina ion ei he , I hink he mind(which is no b ain) has o ep og am he ea s, which a e b ain, o hea . I also hink he skep ics can no allow his p og amming o ake place, hence hey can' hea . I would be e y su p ised i any o he ha d co e skep ics e en u ned on a box o ea ha hey may hea some hing ha 's no he e. Ro ke( he Phd) implied as much when he wan ed a box o es , o mo e like debunk. Tha c ap is ikkin' pa he ic!\n\n> \n> \n> \n> \n> F-S\n> \n> \n> \n> \n> On F i, Ap 23, 2010 a 4:30 PM, Ap il Abe c ombie w o e:\n> \n> \n> Pa eidolia is no psuedo science. I is an ac ual, p o en, na u al unc ioning o he b ain.\n> \n> h p://en.wikipedia.o g/wiki/Pa eidolia\n> \n> Please ead his a icle, and mo e, i you ha e any ques ions abou i being psuedo science. I chose he Wikipedia e sion because I hough i would be he leas o ensi e o you. O he a icles speci ically called ou EVP and o he hings.\n\n> \n> Fo he eco d, I don' hink all EVP's a e due o pa eidolia. \n> \n> \n> \n> \n> \n> On F i, Ap 23, 2010 a 3:47 PM, F ank Sump ion w o e:\n> \n> \n> \n> I was implied ha all his s u is \"Pa eidolia\", and because you could pu a name on i ha somehow mean i was all explanined. I' e been hea ing his pseudo scien i ic BS o 10 yea s, so I'm a bi ouchy. Science explains he pa ano mal away, and ye people con inune o pho og aph images, and ge hei names, and he names o deseased lo ed ones h ough EVP, as well as ques ions answe ed, and science(al hogh no all scien is s) jus igno es hese incon inien ac s and ocuses on ha we migh see hings ha a e no he e, which I disag ee wi h as well. \n\n> \n> Did you e en bo he looking a he image on he g oup home page. Tha was om sweeping a TV une wi h a andom ol age and ideo eco ding he moni o sc een. So explain away why he e is a wol image embedded in he guy's ha , an image o an alien below his ea , and why in God's name does he esembles he classic desc ip ion o an MIB o Shadow Pe son? Pa eidolia no doub !\n\n> \n> F-S\n> \n> \n> On F i, Ap 23, 2010 a 3:19 PM, Rj w o e:\n> \n> \n> \n> I'm no su e who you' e alking o abou \"holie han hou\". Bu , you a e he one who keeps dismissing any ques ion abou esul s and es ing wi h ph ases like \"Bi e Me\". I don' see anyone else doing ha , and I ce ainly ne e ha e.\n\n> \n> I ag ee ying new hings is good. And discussing esul s. And looking o new di ec ions. So I'm s ill no su e who you a e upse wi h. Pe haps you could be mo e speci ic: quo e wha you ha e ound objec ionable, and le us know why?\n\n> \n> \n> \n> --- On F i, 4/23/10, F ank Sump ion w o e:\n> \n> \n> F om: F ank Sump ion \n> Subjec : [EVP-ITC] nu said?\n> To: e p-i c@yahoog oups.com\n> Da e: F iday, Ap il 23, 2010, 12:59 PM \n> \n> \n> \n> \n> \n> \"Cong a ula ions! bulle babea has changed you membe ship s a us o he\n> g oup EVP-ITC om Membe o Mode a o .\" \n> \n> Go ahead skepdo ks, make my day! I don' mind some hones deba e, bu no his holie han hou science BS, whe e you hink cuz you s ick a label on some hing i can be dismissed as ho oughly debunked. Maybe--I'm easily o ended, and I'll ake ha in o accoun . \n\n> \n> F-S\n>"}