{"id": "17066", "subject": "Re: [EVP-ITC] nuff said?", "author": "Rj", "timestamp": "2010-04-24T14:21:28Z", "full_text": "Are your recordings EVPS?  If so, if you&#39;d like to post some of them, I&#39;m sure people here would be interested in listening, and you might benefit from a third party&#39;s interpretation, to see if it matches your own interpretation.  Sometimes, when you are with other people, and one person says they hear a word on a recording, the others start to hear it too (but not before).  As has been mentioned, a possible reason is what has been called paradolia (same kind of thing when you point to a cloud and say you see a dragon, then someone else is able to see it too).\n\nFor this kind of test though, please don&#39;t tell anyone what you think the recording says when you post it, and don&#39;t name the file with a name that describes it.  That&#39;s the cloud-dragon danger if you do.\n\n\n\n--- On Sat, 4/24/10, AzureDamselfly &lt;azuredamselfly@...&gt; wrote:\n\nFrom: AzureDamselfly &lt;azuredamselfly@yahoo.com&gt;\nSubject: Re: [EVP-ITC] nuff said?\nTo:\n EVP-ITC@yahoogroups.com\nDate: Saturday, April 24, 2010, 7:10 AM\n\n\n\n\n\n\n\n \n\n\n\n  \n\n\n    \n      \n      \n      Lizzie, I don&#39;t write here often. In fact, this is my third time in responding to other than my question yesterday. \n \nI HEAR what you are saying. I was skeptical , even as a medium, of my abilities, what I would see, hear, feel and receive, even when witnessed by others and including physical manifestation.\n \nI got some &quot;hard evidence&quot; last June and throughout the rest of 2009. We obtained/ photographed and have unretouched photos from within our home, K meter readings, videos of our lights & stereo/tv turning itself off and on , including changing channels with NO person being responsible, NO intereference that could have caused it and outside witnesses to said activities.Please bear with me if I am not overly clear or you feel things are left out, I will always answer questions! * smile * We have hours of recordings, both video and audio, of the goings ons in our home and those of others, my partner Jay & I have met. \n \nLet&#39;s talk, discuss this. Okay? I am more than willing to hear you out.\n \nAnnie C.\n\nTake every chance you get because some things only happen once...\n\n--- On Sat, 4/24/10, Lizzie Broden &lt;yahuli69@yahoo. com&gt; wrote:\n\n\nFrom: Lizzie Broden &lt;yahuli69@yahoo. com&gt;\nSubject: Re: [EVP-ITC] nuff said?\nTo: EVP-ITC@yahoogroups .com\nDate: Saturday, April 24, 2010, 2:11 AM\n\n\n  \n\n\n\n\nNo I don&#39;t have a spirit box, a Franks Box or anything like that.  And no, I do not want one.\n \nI have been involved with this research a long time, been a paranormal researcher for a long time, with ten years of real investigative work under my belt to boot.\n \nI am not cutting anyone down at the knees here, not insulting anyones work or personal beliefs.  \n \nBut this onslaught of betterment against logical thought and questioning is a bit troubling, do you not think?  Can we not hear both sides?  \n \nNot every Skeptic is out to get you!  But you might be asked a few  questions.  And in the long run of things, what is will be.  There is no one &quot;OUT TO GET YOU&quot;\n \nThat is not the nature of discovery or of Science.  If, people are talking to dead people with (Effectively) broken radios, lets see the facts and analyze it.  Let&#39;s test it! Let&#39;s get to the bottom of it.\n \nLet us really, really look at it.\n \nIf anything like that was ever able to be proven as a solid Scientific principle or fact, it would be monumental.  It would be Earth shattering and completely change how we view logic and science as we know it.\n \nSo if this is real, lets look at it. Lets try and be objective about it?\n \nWhat is wrong with that?\n\n &quot;Nature is showing us only the tail of the lion, but I have no doubt that the lion belongs to it even though, because of its large size, it cannot totally reveal itself all at once.&quot; \n-— Albert Einstein \n\n\n\n&quot;It is far better to grasp the universe as it really is than to persist in delusions, however satisfying and reassuring.&quot;\n--Carl Sagan\n\n\n&quot;There is no such thing as an insignificant detail. Don&#39;t just look \nfor what you want to find.&quot;\n-- Me LOL \n\n\n\n\n\n\nFrom: JANDANACOSTA &lt;jandan108@yahoo. com&gt;\nTo: EVP-ITC@yahoogroups .com\nSent: Fri, April 23, 2010 11:41:09 PM\nSubject: Re: [EVP-ITC] nuff said?\n\n  \n\n\n\n\n\nDid someone berate you for your opinion? I haven&#39;t seen that here either.  Do you have a spirit box and do sessions to communicate with the spirits?  I would be interested in knowing what you have experienced and any conclusions you may have made. \n\n\n--- On Fri, 4/23/10, Lizzie Broden &lt;yahuli69@yahoo. com&gt; wrote:\n\n\nFrom: Lizzie Broden &lt;yahuli69@yahoo. com&gt;\nSubject: Re: [EVP-ITC] nuff said?\nTo: EVP-ITC@yahoogroups .com\nDate: Friday, April 23, 2010, 9:01 PM\n\n\n  \n\n\n\n\nI am angry because I feel personally berated, as a Human with a thinking mind or brain!\n \nWhy am I here?  To see if there is really anything to this idea and theory.  So far I am not seeing a whole lot other than people being pissed off at the questioning of ideas. \n \nIf this is real, lets see it.  Get over all this &quot;Skeptic&quot; crap and prove the point.  I am gong to say it one more time, if this is a question of faith or religion, WONDERFUL!  Best of luck with it!  I got no problem with the idea.  If you don&#39;t want your ideas questioned, or it is a mater of Faith, that is fine. But say so, and while you are at it, don&#39;t kick the rest of us that are honestly looking at thing for what they are, not what we want them to be!\n \nBut, when you put it out there as a statement of fact, and then ride the asses of anyone that questions it, I got more than a problem with it.\n \nI have sat back and been a member here for a long time. Keep my mouth shut, but this is more than crossing the line.\n \nIf it is real, than lets look at it.  But when we look at it, lets look at what we know to be the truth and lets take all of that data into consideration and discernment before coming to a conclusion.\n \nThat is not to much to ask!\n\n &quot;Nature is showing us only the tail of the lion, but I have no doubt that the lion belongs to it even though, because of its large size, it cannot totally reveal itself all at once.&quot; \n-— Albert Einstein \n\n\n\n&quot;It is far better to grasp the universe as it really is than to persist in delusions, however satisfying and reassuring.&quot;\n--Carl Sagan\n\n\n&quot;There is no such thing as an insignificant detail. Don&#39;t just look \nfor what you want to find.&quot;\n-- Me LOL \n\n\n\n\n\n\nFrom: JANDANACOSTA &lt;jandan108@yahoo. com&gt;\nTo: EVP-ITC@yahoogroups .com\nSent: Fri, April 23, 2010 10:34:30 PM\nSubject: Re: [EVP-ITC] nuff said?\n\n  \n\n\n\n\n\nI am confused about two issues. First, Why the angry emails?  I don&#39;t think I have seen this before with this group. Also, I don&#39;t get why anyone who is a skeptic would belong to this group.? I mean no disrespect , just curious.\n\n--- On Fri, 4/23/10, Lizzie Broden &lt;yahuli69@yahoo. com&gt; wrote:\n\n\nFrom: Lizzie Broden &lt;yahuli69@yahoo. com&gt;\nSubject: Re: [EVP-ITC] nuff said?\nTo: EVP-ITC@yahoogroups .com\nDate: Friday, April 23, 2010, 8:09 PM\n\n\n  \n\n\n\n\nYou are ever bit as bad as Randi or any of them!  You are just the flip-side of the coin!\n \nYour misuse of the word, &quot;Skeptic&quot; has taken on a totally new meaning.  You see anyone that has a problem with your half baked ideas, and insanity, yeah I said it, as a &quot;Skeptic.&quot;\n \nMaybe it would do you some good to research the word and idea behind it before you go off half cocked as you are.  The world is not out to get you or your damned box!  If there is any truth to it, the let&#39;s see the evidence of it.  Lets look at it for what it is, NOT WHAT YOU OR ANYONE WANTS IT TO BE!\n \nWhat it is, no more and no less!\n \nI am a Skeptic, it the true sense of the word.  And I have been holding my tongue hoping you would pull out of this crap.  Frank, get a grip!\n \nNot everyone that disagrees with you is out to get you!  I have real problems with the whole theory, but I have never questioned your heart or integrity over it.  (Well, other than letting Moon play the dance he is playing with YOUR BOX!)\n \nBut, lets analytically look at this for what it is and find the truth of it?  If you want to turn it into a religion that is on top of some mountain, so be it!  But other people are not going to see the subject in black and white standards.\n \nGive it a rest and thinks about it.  The world is not out to get you Frank!\n\n &quot;Nature is showing us only the tail of the lion, but I have no doubt that the lion belongs to it even though, because of its large size, it cannot totally reveal itself all at once.&quot; \n-— Albert Einstein \n\n\n\n\n&quot;It is far better to grasp the universe as it really is than to persist in delusions, however satisfying and reassuring.&quot;\n--Carl Sagan\n\n\n&quot;There is no such thing as an insignificant detail. Don&#39;t just look \nfor what you want to find.&quot;\n-- Me LOL \n\n\n\n\n\n\nFrom: Frank Sumption &lt;purplealiengirl@ gmail.com&gt;\nTo: EVP-ITC@yahoogroups .com\nSent: Fri, April 23, 2010 7:29:14 PM\nSubject: Re: [EVP-ITC] nuff said?\n\n  \n\n\n I know what it is, even though I can&#39;t even spell it or pronounce it. It&#39;s what the skeptics and debunkers tout as the answer to all paranormal experience. I think we ought to pull our claws back in, especially me!\n \n I have gotten &quot;voices&quot; that I thought were perfectly clear, and no one else could hear it, and some I found was just a snippet of music, so yeah, that happens, but it does not eliminate or explain everything from the boxes, and other EVP methods, you  just have to be aware of the possibility. Anotherr problem is broadcast fragments, sometimes they are just what they sound like, an ad for one thing or another, sometimes they can have sychronistic meaning, and sometimes they can be altered in some way to form a messages, such as the recent one I had about learning sex, which was seemingly ignored by all cuz it has the &quot;s&quot; word--I guess. The fragments can also be distorted as the radio tuning is swept across a station, I don&#39;t accept every word and syllable as meaning something. You have tio judge mnessage by content and personal meaning. \n \n I have seen faces stand up in a carpet right in front of me, not something I just happened across, something that happened live as I watched. For someone to suggest that&#39;s imagination I find very offensive.  \n \n When I first switched to a linear sweep in the boxes, I could hear nothing but gibberish, then suddenly I could hear &quot;them&quot; speaking. I doubt that is all imagination either, I think the mind(which is not brain) has to reprogram the ears, which are brain, to hear.  I also think the skeptics can not allow this programming to take place, hence they can&#39;t hear. I would be very surprised if any of the hard core skeptics even turned on a box for fear that they may hear something that&#39;s not there. Rorke(the Phd) implied as much when he wanted a box to test, or more like debunk. That crap is frikkin&#39; pathetic!\n \n \n \n \nF-S\n \n\n\n \nOn Fri, Apr 23, 2010 at 4:30 PM, April Abercrombie &lt;april@abercrombiegh ostresearch. com&gt; wrote:\n\n\n  \n\n\n\nPareidolia is not psuedo science. It is an actual, proven, natural functioning of the brain.\n\nhttp://en.wikipedia .org/wiki/ Pareidolia\n\nPlease read this article, and more, if you have any questions about it being psuedo science. I chose the Wikipedia version because I thought it would be the least offensive to you. Other articles specifically called out EVP and other things.\n\nFor the record, I don&#39;t think all EVP&#39;s are due to pareidolia. \n\n\n\n\nOn Fri, Apr 23, 2010 at 3:47 PM, Frank Sumption &lt;purplealiengirl@ gmail.com&gt; wrote:\n\n\n  \n\n\n\n\n It was implied that all this stuff is &quot;Pareidolia&quot; , and because you could put a name on it that somehow meant it was all explanined. I&#39;ve been hearing this pseudo scientific BS for 10 years, so I&#39;m a bit touchy. Science explains the paranormal away, and yet people continune to photograph images, and get their names, and the names of deseased loved ones through EVP, as well as questions answered, and science(althogh not all scientists) just ignores these inconvinient facts and focuses on that we might see things that are not there, which I disagree with as well. \n \n Did you even bother looking at the image on the group home page. That was from sweeping a TV tuner with a random voltage and video recording the monitor screen. So explain away why there is a wolf image embedded in the guy&#39;s hat, an image of an alien below his ear, and why in God&#39;s name does he resembles the classic description of an MIB or Shadow Person?  Pareidolia no doubt!\n \n F-S\n\n\n\nOn Fri, Apr 23, 2010 at 3:19 PM, Rj &lt;rasterer@yahoo. com&gt; wrote:\n\n\n  \n\n\n\n\n\n\n\nI&#39;m not sure who you&#39;re talking to about &quot;holier than thou&quot;.  But, you are the one who keeps dismissing any question about results and testing with phrases like &quot;Bite Me&quot;. I don&#39;t see anyone else doing that, and I certainly never have.\n\nI agree trying new things is good.  And discussing results.  And looking for new directions.   So I&#39;m still not sure who you are upset with.  Perhaps you could be more specific: quote what you have found objectionable, and let us know why?\n\n\n\n--- On Fri, 4/23/10, Frank Sumption &lt;purplealiengirl@ gmail.com&gt; wrote:\n\n\nFrom: Frank Sumption &lt;purplealiengirl@ gmail.com&gt;\nSubject: [EVP-ITC] nuff said?\nTo: evp-itc@yahoogroups .com\nDate: Friday, April 23, 2010, 12:59 PM \n\n\n\n\n\n  \n\n\n&quot;Congratulations! bulletbabea has changed your membership status for the\ngroup EVP-ITC from Member to Moderator.&quot; \n \n Go ahead skepdorks, make my day!  I don&#39;t mind some honest debate, but not this holier than thou science BS, where you think cuz you stick a label on something it can be dismissed as thoroughly debunked. Maybe--I&#39;m easily offended, and I&#39;ll take that into account. \n \n F-S"}