{"id": "17068", "subject": "Re: [EVP-ITC] nuff said?", "author": "April Abercrombie", "timestamp": "2010-04-24T15:17:43Z", "full_text": "Whenever I think I have an EVP, I always run a poll on all my message boards\nto see first if people hear anything at all, then second, what it is they\nthink they hear.\n\nIf most people hear the same thing, then you can be reasonably certain it\nisn&#39;t just pareidolia. On my last round, everyone unanimously agreed they\nheard a male voice, but what they thought it said varied widely. But I was\nsatisfied because no men were present when it was recorded, so I know at\nleast there was some other voice there. In this case, what it said wasn&#39;t as\nimportant as just knowing it was there.\n\nIf no one or only a few hear the same thing though, then I have to assume it\nis just paredolia.\n\n\nOn Sat, Apr 24, 2010 at 8:21 AM, Rj &lt;rasterer@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Are your recordings EVPS?  If so, if you&#39;d like to post some of them, I&#39;m\n&gt; sure people here would be interested in listening, and you might benefit\n&gt; from a third party&#39;s interpretation, to see if it matches your own\n&gt; interpretation.  Sometimes, when you are with other people, and one person\n&gt; says they hear a word on a recording, the others start to hear it too (but\n&gt; not before). As has been mentioned, a possible reason is what has been\n&gt; called paradolia (same kind of thing when you point to a cloud and say you\n&gt; see a dragon, then someone else is able to see it too).\n&gt;\n&gt; For this kind of test though, please don&#39;t tell anyone what you think the\n&gt; recording says when you post it, and don&#39;t name the file with a name that\n&gt; describes it. That&#39;s the cloud-dragon danger if you do.\n&gt;\n&gt; --- On Sat, 4/24/10, AzureDamselfly &lt;azuredamselfly@...&lt;azuredamselfly%40yahoo.com&gt;&gt;\n&gt; wrote:\n&gt;\n&gt; From: AzureDamselfly &lt;azuredamselfly@...&lt;azuredamselfly%40yahoo.com&gt;\n&gt; &gt;\n&gt; Subject: Re: [EVP-ITC] nuff said?\n&gt; To:\n&gt; EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;\n&gt; Date: Saturday, April 24, 2010, 7:10 AM\n&gt;\n&gt;\n&gt;\n&gt; Lizzie, I don&#39;t write here often. In fact, this is my third time in\n&gt; responding to other than my question yesterday.\n&gt;\n&gt; I HEAR what you are saying. I was skeptical , even as a medium, of my\n&gt; abilities, what I would see, hear, feel and receive, even when witnessed by\n&gt; others and including physical manifestation.\n&gt;\n&gt; I got some &quot;hard evidence&quot; last June and throughout the rest of 2009. We\n&gt; obtained/ photographed and have unretouched photos from within our home, K\n&gt; meter readings, videos of our lights & stereo/tv turning itself off and on ,\n&gt; including changing channels with NO person being responsible, NO\n&gt; intereference that could have caused it and outside witnesses to said\n&gt; activities.Please bear with me if I am not overly clear or you feel things\n&gt; are left out, I will always answer questions! * smile * We have hours of\n&gt; recordings, both video and audio, of the goings ons in our home and those of\n&gt; others, my partner Jay & I have met.\n&gt;\n&gt; Let&#39;s talk, discuss this. Okay? I am more than willing to hear you out.\n&gt;\n&gt; Annie C.\n&gt;\n&gt; Take every chance you get because some things only happen once...\n&gt;\n&gt; --- On Sat, 4/24/10, Lizzie Broden &lt;yahuli69@yahoo. com&gt; wrote:\n&gt;\n&gt; From: Lizzie Broden &lt;yahuli69@yahoo. com&gt;\n&gt; Subject: Re: [EVP-ITC] nuff said?\n&gt; To: EVP-ITC@yahoogroups .com\n&gt; Date: Saturday, April 24, 2010, 2:11 AM\n&gt;\n&gt;\n&gt;\n&gt; No I don&#39;t have a spirit box, a Franks Box or anything like that.  And no,\n&gt; I do not want one.\n&gt;\n&gt; I have been involved with this research a long time, been a paranormal\n&gt; researcher for a long time, with ten years of real investigative work under\n&gt; my belt to boot.\n&gt;\n&gt; I am not cutting anyone down at the knees here, not insulting anyones work\n&gt; or personal beliefs.\n&gt;\n&gt; But this onslaught of betterment against logical thought and questioning is\n&gt; a bit troubling, do you not think?  Can we not hear both sides?\n&gt;\n&gt; Not every Skeptic is out to get you!  But you might be asked a few\n&gt; questions.  And in the long run of things, what is will be.  There is no one\n&gt; &quot;OUT TO GET YOU&quot;\n&gt;\n&gt; That is not the nature of discovery or of Science.  If, people are talking\n&gt; to dead people with (Effectively) broken radios, lets see the facts and\n&gt; analyze it.  Let&#39;s test it! Let&#39;s get to the bottom of it.\n&gt;\n&gt; Let us really, really look at it.\n&gt;\n&gt; If anything like that was ever able to be proven as a solid Scientific\n&gt; principle or fact, it would be monumental.  It would be Earth shattering and\n&gt; completely change how we view logic and science as we know it.\n&gt;\n&gt; So if this is real, lets look at it. Lets try and be objective about it?\n&gt;\n&gt; What is wrong with that?\n&gt;\n&gt;  &quot;Nature is showing us only the tail of the lion, but I have no doubt that\n&gt; the lion belongs to it even though, because of its large size, it cannot\n&gt; totally reveal itself all at once.&quot;\n&gt; -— Albert Einstein\n&gt;\n&gt; &quot;It is far better to grasp the universe as it really is than to persist in\n&gt; delusions, however satisfying and reassuring.&quot;\n&gt; --Carl Sagan\n&gt;\n&gt; &quot;There is no such thing as an insignificant detail. Don&#39;t just look\n&gt; for what you want to find.&quot;\n&gt; -- Me LOL\n&gt;\n&gt; From: JANDANACOSTA &lt;jandan108@yahoo. com&gt;\n&gt; To: EVP-ITC@yahoogroups .com\n&gt; Sent: Fri, April 23, 2010 11:41:09 PM\n&gt; Subject: Re: [EVP-ITC] nuff said?\n&gt;\n&gt;\n&gt;\n&gt; Did someone berate you for your opinion? I haven&#39;t seen that here either.\n&gt;  Do you have a spirit box and do sessions to communicate with the spirits?\n&gt;  I would be interested in knowing what you have experienced and any\n&gt; conclusions you may have made.\n&gt;\n&gt; --- On Fri, 4/23/10, Lizzie Broden &lt;yahuli69@yahoo. com&gt; wrote:\n&gt;\n&gt; From: Lizzie Broden &lt;yahuli69@yahoo. com&gt;\n&gt; Subject: Re: [EVP-ITC] nuff said?\n&gt; To: EVP-ITC@yahoogroups .com\n&gt; Date: Friday, April 23, 2010, 9:01 PM\n&gt;\n&gt;\n&gt;\n&gt; I am angry because I feel personally berated, as a Human with a thinking\n&gt; mind or brain!\n&gt;\n&gt; Why am I here?  To see if there is really anything to this idea and\n&gt; theory.  So far I am not seeing a whole lot other than people being pissed\n&gt; off at the questioning of ideas.\n&gt;\n&gt; If this is real, lets see it.  Get over all this &quot;Skeptic&quot; crap and prove\n&gt; the point.  I am gong to say it one more time, if this is a question of\n&gt; faith or religion, WONDERFUL!  Best of luck with it!  I got no problem with\n&gt; the idea.  If you don&#39;t want your ideas questioned, or it is a mater of\n&gt; Faith, that is fine. But say so, and while you are at it, don&#39;t kick the\n&gt; rest of us that are honestly looking at thing for what they are, not what we\n&gt; want them to be!\n&gt;\n&gt; But, when you put it out there as a statement of fact, and then ride the\n&gt; asses of anyone that questions it, I got more than a problem with it.\n&gt;\n&gt; I have sat back and been a member here for a long time. Keep my mouth shut,\n&gt; but this is more than crossing the line.\n&gt;\n&gt; If it is real, than lets look at it.  But when we look at it, lets look at\n&gt; what we know to be the truth and lets take all of that data into\n&gt; consideration and discernment before coming to a conclusion.\n&gt;\n&gt; That is not to much to ask!\n&gt;\n&gt;  &quot;Nature is showing us only the tail of the lion, but I have no doubt that\n&gt; the lion belongs to it even though, because of its large size, it cannot\n&gt; totally reveal itself all at once.&quot;\n&gt; -— Albert Einstein\n&gt;\n&gt; &quot;It is far better to grasp the universe as it really is than to persist in\n&gt; delusions, however satisfying and reassuring.&quot;\n&gt; --Carl Sagan\n&gt;\n&gt; &quot;There is no such thing as an insignificant detail. Don&#39;t just look\n&gt; for what you want to find.&quot;\n&gt; -- Me LOL\n&gt;\n&gt; From: JANDANACOSTA &lt;jandan108@yahoo. com&gt;\n&gt; To: EVP-ITC@yahoogroups .com\n&gt; Sent: Fri, April 23, 2010 10:34:30 PM\n&gt; Subject: Re: [EVP-ITC] nuff said?\n&gt;\n&gt;\n&gt;\n&gt; I am confused about two issues. First, Why the angry emails?  I don&#39;t think\n&gt; I have seen this before with this group. Also, I don&#39;t get why anyone who is\n&gt; a skeptic would belong to this group.? I mean no disrespect , just curious.\n&gt;\n&gt; --- On Fri, 4/23/10, Lizzie Broden &lt;yahuli69@yahoo. com&gt; wrote:\n&gt;\n&gt; From: Lizzie Broden &lt;yahuli69@yahoo. com&gt;\n&gt; Subject: Re: [EVP-ITC] nuff said?\n&gt; To: EVP-ITC@yahoogroups .com\n&gt; Date: Friday, April 23, 2010, 8:09 PM\n&gt;\n&gt;\n&gt;\n&gt; You are ever bit as bad as Randi or any of them!  You are just the\n&gt; flip-side of the coin!\n&gt;\n&gt; Your misuse of the word, &quot;Skeptic&quot; has taken on a totally new meaning.  You\n&gt; see anyone that has a problem with your half baked ideas, and insanity, yeah\n&gt; I said it, as a &quot;Skeptic.&quot;\n&gt;\n&gt; Maybe it would do you some good to research the word and idea behind it\n&gt; before you go off half cocked as you are.  The world is not out to get you\n&gt; or your damned box!  If there is any truth to it, the let&#39;s see the evidence\n&gt; of it.  Lets look at it for what it is, NOT WHAT YOU OR ANYONE WANTS IT TO\n&gt; BE!\n&gt;\n&gt; What it is, no more and no less!\n&gt;\n&gt; I am a Skeptic, it the true sense of the word.  And I have been holding my\n&gt; tongue hoping you would pull out of this crap.  Frank, get a grip!\n&gt;\n&gt; Not everyone that disagrees with you is out to get you!  I have real\n&gt; problems with the whole theory, but I have never questioned your heart\n&gt; or integrity over it.  (Well, other than letting Moon play the dance he is\n&gt; playing with YOUR BOX!)\n&gt;\n&gt; But, lets analytically look at this for what it is and find the truth of\n&gt; it?  If you want to turn it into a religion that is on top of some mountain,\n&gt; so be it!  But other people are not going to see the subject in black and\n&gt; white standards.\n&gt;\n&gt; Give it a rest and thinks about it.  The world is not out to get you Frank!\n&gt;\n&gt;  &quot;Nature is showing us only the tail of the lion, but I have no doubt that\n&gt; the lion belongs to it even though, because of its large size, it cannot\n&gt; totally reveal itself all at once.&quot;\n&gt; -— Albert Einstein\n&gt;\n&gt; &quot;It is far better to grasp the universe as it really is than to persist in\n&gt; delusions, however satisfying and reassuring.&quot;\n&gt; --Carl Sagan\n&gt;\n&gt; &quot;There is no such thing as an insignificant detail. Don&#39;t just look\n&gt; for what you want to find.&quot;\n&gt; -- Me LOL\n&gt;\n&gt; From: Frank Sumption &lt;purplealiengirl@ gmail.com&gt;\n&gt; To: EVP-ITC@yahoogroups .com\n&gt; Sent: Fri, April 23, 2010 7:29:14 PM\n&gt; Subject: Re: [EVP-ITC] nuff said?\n&gt;\n&gt;\n&gt;\n&gt;  I know what it is, even though I can&#39;t even spell it or pronounce it. It&#39;s\n&gt; what the skeptics and debunkers tout as the answer to all paranormal\n&gt; experience. I think we ought to pull our claws back in, especially me!\n&gt;\n&gt;  I have gotten &quot;voices&quot; that I thought were perfectly clear, and no one\n&gt; else could hear it, and some I found was just a snippet of music, so yeah,\n&gt; that happens, but it does not eliminate or explain everything from the\n&gt; boxes, and other EVP methods, you  just have to be aware of the possibility.\n&gt; Anotherr problem is broadcast fragments, sometimes they are just what they\n&gt; sound like, an ad for one thing or another, sometimes they can have\n&gt; sychronistic meaning, and sometimes they can be altered in some way to form\n&gt; a messages, such as the recent one I had about learning sex, which was\n&gt; seemingly ignored by all cuz it has the &quot;s&quot; word--I guess. The fragments can\n&gt; also be distorted as the radio tuning is swept across a station, I don&#39;t\n&gt; accept every word and syllable as meaning something. You have tio judge\n&gt; mnessage by content and personal meaning.\n&gt;\n&gt;  I have seen faces stand up in a carpet right in front of me, not something\n&gt; I just happened across, something that happened live as I watched. For\n&gt; someone to suggest that&#39;s imagination I find very offensive.\n&gt;\n&gt;  When I first switched to a linear sweep in the boxes, I could hear nothing\n&gt; but gibberish, then suddenly I could hear &quot;them&quot; speaking. I doubt that is\n&gt; all imagination either, I think the mind(which is not brain) has to\n&gt; reprogram the ears, which are brain, to hear.  I also think the skeptics can\n&gt; not allow this programming to take place, hence they can&#39;t hear. I would be\n&gt; very surprised if any of the hard core skeptics even turned on a box for\n&gt; fear that they may hear something that&#39;s not there. Rorke(the Phd) implied\n&gt; as much when he wanted a box to test, or more like debunk. That crap is\n&gt; frikkin&#39; pathetic!\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; F-S\n&gt;\n&gt;\n&gt;\n&gt; On Fri, Apr 23, 2010 at 4:30 PM, April Abercrombie &lt;april@abercrombieghostresearch. com&gt; wrote:\n&gt;\n&gt;\n&gt;\n&gt; Pareidolia is not psuedo science. It is an actual, proven, natural\n&gt; functioning of the brain.\n&gt;\n&gt; http://en.wikipedia .org/wiki/ Pareidolia\n&gt;\n&gt; Please read this article, and more, if you have any questions about it\n&gt; being psuedo science. I chose the Wikipedia version because I thought it\n&gt; would be the least offensive to you. Other articles specifically called out\n&gt; EVP and other things.\n&gt;\n&gt; For the record, I don&#39;t think all EVP&#39;s are due to pareidolia.\n&gt;\n&gt; On Fri, Apr 23, 2010 at 3:47 PM, Frank Sumption &lt;purplealiengirl@\n&gt; gmail.com&gt; wrote:\n&gt;\n&gt;\n&gt;\n&gt;  It was implied that all this stuff is &quot;Pareidolia&quot; , and because you could\n&gt; put a name on it that somehow meant it was all explanined. I&#39;ve been hearing\n&gt; this pseudo scientific BS for 10 years, so I&#39;m a bit touchy. Science\n&gt; explains the paranormal away, and yet people continune to photograph images,\n&gt; and get their names, and the names of deseased loved ones through EVP, as\n&gt; well as questions answered, and science(althogh not all scientists) just\n&gt; ignores these inconvinient facts and focuses on that we might see things\n&gt; that are not there, which I disagree with as well.\n&gt;\n&gt;  Did you even bother looking at the image on the group home page. That was\n&gt; from sweeping a TV tuner with a random voltage and video recording the\n&gt; monitor screen. So explain away why there is a wolf image embedded in the\n&gt; guy&#39;s hat, an image of an alien below his ear, and why in God&#39;s name does he\n&gt; resembles the classic description of an MIB or Shadow Person?  Pareidolia no\n&gt; doubt!\n&gt;\n&gt;  F-S\n&gt;\n&gt; On Fri, Apr 23, 2010 at 3:19 PM, Rj &lt;rasterer@yahoo. com&gt; wrote:\n&gt;\n&gt;\n&gt;\n&gt; I&#39;m not sure who you&#39;re talking to about &quot;holier than thou&quot;.  But, you are\n&gt; the one who keeps dismissing any question about results and testing with\n&gt; phrases like &quot;Bite Me&quot;. I don&#39;t see anyone else doing that, and I certainly\n&gt; never have.\n&gt;\n&gt; I agree trying new things is good.  And discussing results.  And looking\n&gt; for new directions.   So I&#39;m still not sure who you are upset with.  Perhaps\n&gt; you could be more specific: quote what you have found objectionable, and let\n&gt; us know why?\n&gt;\n&gt; --- On Fri, 4/23/10, Frank Sumption &lt;purplealiengirl@ gmail.com&gt; wrote:\n&gt;\n&gt; From: Frank Sumption &lt;purplealiengirl@ gmail.com&gt;\n&gt; Subject: [EVP-ITC] nuff said?\n&gt; To: evp-itc@yahoogroups .com\n&gt; Date: Friday, April 23, 2010, 12:59 PM\n&gt;\n&gt;\n&gt;\n&gt; &quot;Congratulations! bulletbabea has changed your membership status for the\n&gt; group EVP-ITC from Member to Moderator.&quot;\n&gt;\n&gt;  Go ahead skepdorks, make my day!  I don&#39;t mind some honest debate, but not\n&gt; this holier than thou science BS, where you think cuz you stick a label on\n&gt; something it can be dismissed as thoroughly debunked. Maybe--I&#39;m easily\n&gt; offended, and I&#39;ll take that into account.\n&gt;\n&gt;  F-S\n&gt;\n&gt;  \n&gt;\n\nWhene e I hink I ha e an EVP, I always un a poll on all my message boa ds o see i s i people hea any hing a all, hen second, wha i is hey hink hey hea .I mos people hea he same hing, hen you can be easonably ce ain i isn' jus pa eidolia. On my las ound, e e yone unanimously ag eed hey hea d a male oice, bu wha hey hough i said a ied widely. Bu I was sa is ied because no men we e p esen when i was eco ded, so I know a leas he e was some o he oice he e. In his case, wha i said wasn' as impo an as jus knowing i was he e.\nI no one o only a ew hea he same hing hough, hen I ha e o assume i is jus pa edolia.On Sa , Ap 24, 2010 a 8:21 AM, Rj as e e @...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n A e you eco dings EVPS?  I so, i you'd like o pos some o hem, I'm su e people he e would be in e es ed in lis ening, and you migh bene i om a hi d pa y's in e p e a ion, o see i i ma ches you own in e p e a ion.  Some imes, when you a e wi h o he people, and one pe son says hey hea a wo d on a eco ding, he o he s s a o hea i oo (bu no be o e). As has been men ioned, a possible eason is wha has been called pa adolia (same kind o hing when you poin o a cloud and say you see a d agon, hen someone else is able o see i oo).\n\n\nFo his kind o es hough, please don' ell anyone wha you hink he eco ding says when you pos i , and don' name he ile wi h a name ha desc ibes i . Tha 's he cloud-d agon dange i you do.\n\n\n--- On Sa , 4/24/10, Azu eDamsel ly azu edamsel ly@...> w o e:\n\nF om: Azu eDamsel ly azu edamsel ly@...>\nSubjec : Re: [EVP-ITC] nu said?\nTo:\n EVP-ITC@yahoog oups.com\nDa e: Sa u day, Ap il 24, 2010, 7:10 AM\n\n \n\nLizzie, I don' w i e he e o en. In ac , his is my hi d ime in esponding o o he han my ques ion yes e day. \n \nI HEAR wha you a e saying. I was skep ical , e en as a medium, o my abili ies, wha I would see, hea , eel and ecei e, e en when wi nessed by o he s and including physical mani es a ion.\n \nI go some \"ha d e idence\" las June and h oughou he es o 2009. We ob ained/ pho og aphed and ha e un e ouched pho os om wi hin ou home, K me e eadings, ideos o ou ligh s & s e eo/ u ning i sel o and on , including changing channels wi h NO pe son being esponsible, NO in e e e ence ha could ha e caused i and ou side wi nesses o said ac i i ies.Please bea wi h me i I am no o e ly clea o you eel hings a e le ou , I will always answe ques ions! * smile * We ha e hou s o eco dings, bo h ideo and audio, o he goings ons in ou home and hose o o he s, my pa ne Jay & I ha e me . \n\n \nLe 's alk, discuss his. Okay? I am mo e han willing o hea you ou .\n \nAnnie C.\n\nTake e e y chance you ge because some hings only happen once...\n\n--- On Sa , 4/24/10, Lizzie B oden w o e:\n\nF om: Lizzie B oden \nSubjec : Re: [EVP-ITC] nu said?\nTo: EVP-ITC@yahoog oups .com\nDa e: Sa u day, Ap il 24, 2010, 2:11 AM\n\n  \n\nNo I don' ha e a spi i box, a F anks Box o any hing like ha .  And no, I do no wan one.\n \nI ha e been in ol ed wi h  his esea ch a long ime, been a pa ano mal esea che o a long ime, wi h en yea s o eal in es iga i e wo k unde my bel o boo .\n \nI am no cu ing anyone down a he knees he e, no insul ing anyones wo k o pe sonal belie s.  \n \nBu his onslaugh o be e men agains logical hough and ques ioning is a bi oubling, do you no hink?  Can we no hea bo h sides?  \n \nNo e e y Skep ic is ou o ge you!  Bu you migh be asked a ew  ques ions.  And in he long un o hings, wha is will be.  The e is no one \"OUT TO GET YOU\"\n \nTha is no he na u e o disco e y o o Science.  I , people a e alking o dead people wi h (E ec i ely) b oken adios, le s see he ac s and analyze i .  Le 's es i ! Le 's ge o he bo om o i .\n \nLe us  eally, eally look a i .\n \nI any hing like ha was e e able o be p o en as a solid Scien i ic p inciple o ac , i would be monumen al.  I would be Ea h sha e ing and comple ely change how we  iew logic and science as we know i .\n \nSo i his is eal, le s look a i . Le s y and be objec i e abou i ?\n \nWha is w ong wi h ha ?\n\n \"Na u e is showing us only he ail o he lion, bu I ha e no doub ha he lion belongs o i e en hough, because o i s la ge size, i canno o ally e eal i sel all a once.\" \n-— Albe Eins ein \n\n\"I is a be e o g asp he uni e se as i eally is han o pe sis in delusions, howe e sa is ying and eassu ing.\"\n--Ca l Sagan\n\n\"The e is no such hing as an insigni ican de ail. Don' jus look \n o wha you wan o ind.\"\n-- Me LOL \n\nF om: JANDANACOSTA \nTo: EVP-ITC@yahoog oups .com\nSen : F i, Ap il 23, 2010 11:41:09 PM\nSubjec : Re: [EVP-ITC] nu said?\n\n  \n\nDid someone be a e you o you opinion? I ha en' seen ha he e ei he .  Do you ha e a spi i box and do sessions o communica e wi h he spi i s?  I would be in e es ed in knowing wha you ha e expe ienced and any conclusions you may ha e made. \n\n\n--- On F i, 4/23/10, Lizzie B oden w o e:\n\nF om: Lizzie B oden \nSubjec : Re: [EVP-ITC] nu said?\nTo: EVP-ITC@yahoog oups .com\nDa e: F iday, Ap il 23, 2010, 9:01 PM\n\n  \n\nI am ang y because I eel pe sonally be a ed, as a Human wi h a hinking mind o b ain!\n \nWhy am I he e?  To see i he e is eally any hing o his idea and heo y.  So a I am no seeing a whole lo o he han people being pissed o a he ques ioning o ideas. \n \nI his is eal, le s see i .  Ge o e all his \"Skep ic\" c ap and p o e he poin .  I am gong o say i one mo e ime, i his is a ques ion o ai h o eligion, WONDERFUL!  Bes o luck wi h i !  I go no p oblem wi h he idea.  I you don' wan you ideas ques ioned, o i is a ma e o Fai h, ha is ine. Bu say so, and while you a e a i , don' kick he es o us ha a e hones ly looking a hing o wha hey a e, no wha we wan hem o be!\n\n \nBu , when you pu i ou he e as a s a emen o ac , and hen ide he asses o anyone ha ques ions i , I go mo e han a p oblem wi h i .\n \nI ha e sa back and been a membe he e o a long ime. Keep my mou h shu , bu his is mo e han c ossing he line.\n \nI i is eal, han le s look a i .  Bu when we look a i , le s look a wha we know o be he u h and le s ake all o ha da a in o conside a ion and disce nmen be o e coming o a conclusion.\n \nTha is no o much o ask!\n\n \"Na u e is showing us only he ail o he lion, bu I ha e no doub ha he lion belongs o i e en hough, because o i s la ge size, i canno o ally e eal i sel all a once.\" \n-— Albe Eins ein \n\n\"I is a be e o g asp he uni e se as i eally is han o pe sis in delusions, howe e sa is ying and eassu ing.\"\n--Ca l Sagan\n\n\"The e is no such hing as an insigni ican de ail. Don' jus look \n o wha you wan o ind.\"\n-- Me LOL \n\nF om: JANDANACOSTA \nTo: EVP-ITC@yahoog oups .com\nSen : F i, Ap il 23, 2010 10:34:30 PM\nSubjec : Re: [EVP-ITC] nu said?\n\n  \n\nI am con used abou wo issues. Fi s , Why he ang y emails?  I don' hink I ha e seen his be o e wi h his g oup. Also, I don' ge why anyone who is a skep ic would belong o his g oup.? I mean no dis espec , jus cu ious.\n\n\n--- On F i, 4/23/10, Lizzie B oden w o e:\n\nF om: Lizzie B oden \nSubjec : Re: [EVP-ITC] nu said?\nTo: EVP-ITC@yahoog oups .com\nDa e: F iday, Ap il 23, 2010, 8:09 PM\n\n  \n\nYou a e e e bi as bad as Randi o any o hem!  You a e jus he lip-side o he coin!\n \nYou misuse o he wo d, \"Skep ic\" has aken on a o ally new meaning.  You see anyone ha has a p oblem wi h you hal baked ideas, and insani y, yeah I said i , as a \"Skep ic.\"\n \nMaybe i would do you some good o esea ch he wo d and idea behind i be o e you go o hal cocked as you a e.  The wo ld is no ou o ge you o you damned box!  I he e is any u h o i , he le 's see he e idence o i .  Le s look a i o wha i is, NOT WHAT YOU OR ANYONE WANTS IT TO BE!\n\n \nWha i is, no mo e and no less!\n \nI am a Skep ic, i he ue sense o he wo d.  And I ha e been holding my ongue hoping you would pull ou o his c ap.  F ank, ge a g ip!\n \nNo e e yone ha disag ees wi h you is ou o ge you!  I ha e eal p oblems wi h he whole heo y, bu I ha e ne e ques ioned you hea o  in eg i y o e i .  (Well, o he han le ing Moon play he dance he is playing wi h YOUR BOX!)\n\n \nBu , le s analy ically look a his o wha i is and ind  he u h o i ?  I you wan o u n i in o a eligion ha is on op o some moun ain, so be i !  Bu o he people a e no going o see he subjec in black and whi e s anda ds.\n\n \nGi e i a es and hinks abou i .  The wo ld is no ou o ge you F ank!\n\n \"Na u e is showing us only he ail o he lion, bu I ha e no doub ha he lion belongs o i e en hough, because o i s la ge size, i canno o ally e eal i sel all a once.\" \n-— Albe Eins ein \n\n\"I is a be e o g asp he uni e se as i eally is han o pe sis in delusions, howe e sa is ying and eassu ing.\"\n--Ca l Sagan\n\n\"The e is no such hing as an insigni ican de ail. Don' jus look \n o wha you wan o ind.\"\n-- Me LOL \n\nF om: F ank Sump ion gmail.com>\nTo: EVP-ITC@yahoog oups .com\nSen : F i, Ap il 23, 2010 7:29:14 PM\nSubjec : Re: [EVP-ITC] nu said?\n\n  \n\n I know wha i is, e en hough I can' e en spell i o p onounce i . I 's wha he skep ics and debunke s ou as he answe o all pa ano mal expe ience. I hink we ough o pull ou claws back in, especially me!\n\n \n I ha e go en \" oices\" ha I hough we e pe ec ly clea , and no one else could hea i , and some I ound was jus  a snippe o music, so yeah, ha happens, bu i does no elimina e o explain e e y hing om he boxes, and o he EVP me hods, you  jus ha e o be awa e o he possibili y. Ano he p oblem is b oadcas agmen s, some imes hey a e jus wha hey sound like, an ad o one hing o ano he , some imes hey can ha e sych onis ic meaning, and some imes hey can be al e ed in some way o o m a messages, such as he ecen one I had abou lea ning sex, which was seemingly igno ed by all cuz i has he \"s\" wo d--I guess. The agmen s can also be dis o ed as he adio uning is swep ac oss a s a ion, I don' accep e e y wo d and syllable as meaning some hing. You ha e io judge mnessage by con en and pe sonal meaning. \n\n \n I ha e seen aces s and up in a ca pe igh in on o me, no some hing I jus happened ac oss, some hing ha happened li e as I wa ched. Fo someone o sugges ha 's imagina ion I ind e y o ensi e.  \n \n When I i s swi ched o a linea sweep in he boxes, I could hea no hing bu gibbe ish, hen suddenly I could hea \" hem\" speaking. I doub ha is all imagina ion ei he , I hink he mind(which is no b ain) has o ep og am he ea s, which a e b ain, o hea .  I also hink he skep ics can no allow his p og amming o ake place, hence hey can' hea . I would be e y su p ised i any o he ha d co e skep ics e en u ned on a box o ea ha hey may hea some hing ha 's no he e. Ro ke( he Phd) implied as much when he wan ed a box o es , o mo e like debunk. Tha c ap is ikkin' pa he ic!\n\n \n \n \n \nF-S\n \n\n \nOn F i, Ap 23, 2010 a 4:30 PM, Ap il Abe c ombie w o e:\n\n  \n\nPa eidolia is no psuedo science. I is an ac ual, p o en, na u al unc ioning o he b ain.\n\nh p://en.wikipedia .o g/wiki/ Pa eidolia\n\nPlease ead his a icle, and mo e, i you ha e any ques ions abou i being psuedo science. I chose he Wikipedia e sion because I hough i would be he leas o ensi e o you. O he a icles speci ically called ou EVP and o he hings.\n\n\nFo he eco d, I don' hink all EVP's a e due o pa eidolia. \n\nOn F i, Ap 23, 2010 a 3:47 PM, F ank Sump ion gmail.com> w o e:\n\n  \n\n I was implied ha all his s u is \"Pa eidolia\" , and because you could pu a name on i ha somehow mean i was all explanined. I' e been hea ing his pseudo scien i ic BS o 10 yea s, so I'm a bi ouchy. Science explains he pa ano mal away, and ye people con inune o pho og aph images, and ge hei names, and he names o deseased lo ed ones h ough EVP, as well as ques ions answe ed, and science(al hogh no all scien is s) jus igno es hese incon inien ac s and ocuses on  ha we migh see hings ha a e no he e, which I disag ee wi h as well. \n\n \n Did you e en bo he looking a he image on he g oup home page. Tha was om sweeping a TV une wi h a andom ol age and ideo eco ding he moni o sc een. So explain away why he e is a wol image embedded in he guy's ha , an image o an alien below his ea , and why in God's name does he esembles he classic desc ip ion o an MIB o  Shadow Pe son?  Pa eidolia no doub !\n\n \n F-S\n\nOn F i, Ap 23, 2010 a 3:19 PM, Rj w o e:\n\n  \n\nI'm no su e who you' e alking o abou \"holie han hou\".  Bu , you a e he one who keeps dismissing any ques ion abou esul s and es ing wi h ph ases like \"Bi e Me\". I don' see anyone else doing ha , and I ce ainly ne e ha e.\n\n\nI ag ee ying new hings is good.  And discussing esul s.  And looking o new di ec ions.   So I'm s ill no su e who you a e upse wi h.  Pe haps you could be mo e speci ic: quo e wha you ha e ound objec ionable, and le us know why?\n\n\n--- On F i, 4/23/10, F ank Sump ion gmail.com> w o e:\n\nF om: F ank Sump ion gmail.com>\nSubjec : [EVP-ITC] nu said?\nTo: e p-i c@yahoog oups .com\nDa e: F iday, Ap il 23, 2010, 12:59 PM \n\n  \n\n\"Cong a ula ions! bulle babea has changed you membe ship s a us o he\ng oup EVP-ITC om Membe o Mode a o .\" \n \n Go ahead skepdo ks, make my day!  I don' mind some hones deba e, bu no his holie han hou science BS, whe e you hink cuz you s ick a label on some hing i can be dismissed as ho oughly debunked. Maybe--I'm easily o ended, and I'll ake ha in o accoun . \n\n \n F-S"}