{"id": "17065", "subject": "Re: [EVP-ITC] nuff said?", "author": "AzureDamselfly", "timestamp": "2010-04-24T14:10:23Z", "full_text": "--0-593953624-1272118223=:20029\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nLizzie, I don&#39;t write here often. In fact, this is my third time in respond=\r\ning to other than my question yesterday. \n=C2=A0\nI HEAR what you are saying=\r\n. I was skeptical , even as a medium, of my abilities, what I would see, he=\r\nar, feel and receive, even when witnessed by others=C2=A0and including phys=\r\nical manifestation.\n=C2=A0\nI got some &quot;hard evidence&quot; last June and through=\r\nout the rest of 2009. We obtained/ photographed and have unretouched photos=\r\n from within our home, K meter readings, videos of our lights & stereo/tv t=\r\nurning itself off and on , including changing channels with NO person being=\r\n responsible, NO intereference that could have caused it and outside witnes=\r\nses to said activities.Please bear with me if I am not overly clear or you =\r\nfeel things are left out, I will always answer questions! * smile * We have=\r\n hours of recordings, both video and audio, of the goings ons in our home a=\r\nnd those of others, my partner Jay & I have met. \n=C2=A0\nLet&#39;s talk, discus=\r\ns this. Okay? I am more than willing to hear you out.\n=C2=A0\nAnnie C.\n\nTake=\r\n every chance you get because some things only happen once...\n\n--- On Sat, =\r\n4/24/10, Lizzie Broden &lt;yahuli69@...&gt; wrote:\n\n\nFrom: Lizzie Broden &lt;y=\r\nahuli69@...&gt;\nSubject: Re: [EVP-ITC] nuff said?\nTo: EVP-ITC@yahoogroup=\r\ns.com\nDate: Saturday, April 24, 2010, 2:11 AM\n\n\n=C2=A0 \n\n\n\n\n\n\nNo I don&#39;t ha=\r\nve a spirit box, a Franks Box or anything like that.=C2=A0 And no, I do not=\r\n want one.\n=C2=A0\nI have=C2=A0been involved with=C2=A0this research a long =\r\ntime, been a paranormal researcher for a long time, with ten years of real =\r\ninvestigative work under my belt to boot.\n=C2=A0\nI am not cutting anyone do=\r\nwn at the knees here, not insulting anyones work or personal beliefs.=C2=A0=\r\n \n=C2=A0\nBut this onslaught of betterment against logical thought and quest=\r\nioning is a bit troubling, do you not think?=C2=A0 Can we not hear both sid=\r\nes?=C2=A0 \n=C2=A0\nNot every Skeptic is out to get you!=C2=A0 But you might =\r\nbe asked a few=C2=A0 questions.=C2=A0 And in the long run of things,=C2=A0w=\r\nhat is will be.=C2=A0 There is no one &quot;OUT TO GET YOU&quot;\n=C2=A0\nThat is not t=\r\nhe nature of discovery=C2=A0or of Science.=C2=A0 If, people are talking to =\r\ndead people with (Effectively) broken radios, lets see the facts and analyz=\r\ne it.=C2=A0 Let&#39;s test it! Let&#39;s get to the bottom of it.\n=C2=A0\nLet us=C2=\r\n=A0really, really look at it.\n=C2=A0\nIf anything like that was ever able to=\r\n be proven as a solid Scientific principle or fact, it would be monumental.=\r\n=C2=A0 It would be Earth shattering and completely change how we=C2=A0view =\r\nlogic and science as we know it.\n=C2=A0\nSo if this is real, lets look at it=\r\n.=C2=A0Lets try and be objective about it?\n=C2=A0\nWhat is wrong with that?\n=\r\n\n=C2=A0&quot;Nature is showing us only the tail of the lion, but I have no doubt=\r\n that the lion belongs to it even though, because of its large size, it can=\r\nnot totally reveal itself all at once.&quot; \n-=E2=80=94 Albert Einstein \n\n\n\n&quot;It=\r\n is far better to grasp the universe as it really is than to persist in del=\r\nusions, however satisfying and reassuring.&quot;\n--Carl Sagan\n\n\n&quot;There is no suc=\r\nh thing as an insignificant detail. Don&#39;t just look \nfor what you want to f=\r\nind.&quot;\n-- Me LOL \n\n\n\n\n\n\nFrom: JANDANACOSTA &lt;jandan108@yahoo. com&gt;\nTo: EVP-IT=\r\nC@yahoogroups .com\nSent: Fri, April 23, 2010 11:41:09 PM\nSubject: Re: [EVP-=\r\nITC] nuff said?\n\n=C2=A0 \n\n\n\n\n\nDid someone berate you for your opinion? I ha=\r\nven&#39;t seen that here either. =C2=A0Do you have a spirit box and do sessions=\r\n to communicate with the spirits? =C2=A0I would be interested in knowing wh=\r\nat you have experienced and any conclusions you may have made. \n\n\n--- On Fr=\r\ni, 4/23/10, Lizzie Broden &lt;yahuli69@yahoo. com&gt; wrote:\n\n\nFrom: Lizzie Brode=\r\nn &lt;yahuli69@yahoo. com&gt;\nSubject: Re: [EVP-ITC] nuff said?\nTo: EVP-ITC@yahoo=\r\ngroups .com\nDate: Friday, April 23, 2010, 9:01 PM\n\n\n=C2=A0 \n\n\n\n\nI am angry =\r\nbecause I feel personally berated, as a=C2=A0Human with a thinking mind or =\r\nbrain!\n=C2=A0\nWhy am I here?=C2=A0 To see if there is really=C2=A0anything =\r\nto this idea and theory.=C2=A0 So far I am not seeing a whole lot other tha=\r\nn people being pissed off at the questioning=C2=A0of ideas. \n=C2=A0\nIf this=\r\n is real, lets see it.=C2=A0 Get over all this &quot;Skeptic&quot; crap and prove the=\r\n point.=C2=A0 I am gong to say it one more time, if this is a question of f=\r\naith or religion, WONDERFUL!=C2=A0 Best of luck with it!=C2=A0 I got no pro=\r\nblem with the idea.=C2=A0 If you don&#39;t want your ideas questioned, or it is=\r\n a mater of Faith, that is fine. But say so, and while you are at it, don&#39;t=\r\n kick the rest of us that are honestly looking at thing for what they are, =\r\nnot what we want them to be!\n=C2=A0\nBut, when you put it out there as a sta=\r\ntement of fact, and then ride the asses of anyone that questions it, I got =\r\nmore than a problem with it.\n=C2=A0\nI have sat back and been a member here =\r\nfor a long time. Keep my mouth shut, but this is more than crossing the lin=\r\ne.\n=C2=A0\nIf it is real, than lets look at it.=C2=A0 But when we look at it=\r\n, lets look at what we know to be the truth and lets take all of that data =\r\ninto consideration and discernment before coming to a conclusion.\n=C2=A0\nTh=\r\nat is not to much to ask!\n\n=C2=A0&quot;Nature is showing us only the tail of the=\r\n lion, but I have no doubt that the lion belongs to it even though, because=\r\n of its large size, it cannot totally reveal itself all at once.&quot; \n-=E2=80=\r\n=94 Albert Einstein \n\n\n\n&quot;It is far better to grasp the universe as it reall=\r\ny is than to persist in delusions, however satisfying and reassuring.&quot;\n--Ca=\r\nrl Sagan\n\n\n&quot;There is no such thing as an insignificant detail. Don&#39;t just l=\r\nook \nfor what you want to find.&quot;\n-- Me LOL \n\n\n\n\n\n\nFrom: JANDANACOSTA &lt;janda=\r\nn108@yahoo. com&gt;\nTo: EVP-ITC@yahoogroups .com\nSent: Fri, April 23, 2010 10:=\r\n34:30 PM\nSubject: Re: [EVP-ITC] nuff said?\n\n=C2=A0 \n\n\n\n\n\nI am confused abou=\r\nt two issues. First, Why the angry emails? =C2=A0I don&#39;t think I have seen =\r\nthis before with this group. Also, I don&#39;t get why anyone who is a skeptic =\r\nwould belong to this group.? I mean no disrespect , just curious.\n\n--- On F=\r\nri, 4/23/10, Lizzie Broden &lt;yahuli69@yahoo. com&gt; wrote:\n\n\nFrom: Lizzie Brod=\r\nen &lt;yahuli69@yahoo. com&gt;\nSubject: Re: [EVP-ITC] nuff said?\nTo: EVP-ITC@yaho=\r\nogroups .com\nDate: Friday, April 23, 2010, 8:09 PM\n\n\n=C2=A0 \n\n\n\n\nYou are ev=\r\ner bit as bad=C2=A0as Randi or any of them!=C2=A0 You are just the flip-sid=\r\ne of the coin!\n=C2=A0\nYour misuse of the word,=C2=A0&quot;Skeptic&quot; has taken on =\r\na totally new meaning.=C2=A0 You see anyone that has a problem with your ha=\r\nlf baked ideas, and insanity, yeah I said it, as a &quot;Skeptic.&quot;\n=C2=A0\nMaybe =\r\nit would do you some good to research the word and idea behind it before yo=\r\nu go off half cocked as you are.=C2=A0=C2=A0The world is not out to get you=\r\n or your damned box!=C2=A0 If there is any truth to it, the let&#39;s see the e=\r\nvidence of it.=C2=A0 Lets look at it for what it is, NOT WHAT YOU OR ANYONE=\r\n WANTS IT TO BE!\n=C2=A0\nWhat it is, no more and no less!\n=C2=A0\nI am a Skep=\r\ntic, it the true sense of the word.=C2=A0 And I have been holding my tongue=\r\n hoping you would pull out of this crap.=C2=A0 Frank, get a grip!\n=C2=A0\nNo=\r\nt everyone that disagrees with=C2=A0you is out to get you!=C2=A0 I have rea=\r\nl problems with the whole theory, but I have never questioned your heart or=\r\n=C2=A0integrity over it.=C2=A0 (Well, other than letting Moon play the danc=\r\ne he is playing with YOUR BOX!)\n=C2=A0\nBut, lets analytically look at this =\r\nfor what it is and find=C2=A0the truth of it?=C2=A0 If you want to turn it =\r\ninto a religion that is on top of some mountain, so be it!=C2=A0 But other =\r\npeople are not going to see the subject in black and white standards.\n=C2=\r\n=A0\nGive it a rest and thinks about it.=C2=A0 The world is not out to get y=\r\nou Frank!\n\n=C2=A0&quot;Nature is showing us only the tail of the lion, but I hav=\r\ne no doubt that the lion belongs to it even though, because of its large si=\r\nze, it cannot totally reveal itself all at once.&quot; \n-=E2=80=94 Albert Einste=\r\nin \n\n\n\n&quot;It is far better to grasp the universe as it really is than to pers=\r\nist in delusions, however satisfying and reassuring.&quot;\n--Carl Sagan\n\n\n&quot;There=\r\n is no such thing as an insignificant detail. Don&#39;t just look \nfor what you=\r\n want to find.&quot;\n-- Me LOL \n\n\n\n\n\n\nFrom: Frank Sumption &lt;purplealiengirl@ gma=\r\nil.com&gt;\nTo: EVP-ITC@yahoogroups .com\nSent: Fri, April 23, 2010 7:29:14 PM\nS=\r\nubject: Re: [EVP-ITC] nuff said?\n\n=C2=A0 \n\n\n=C2=A0I=C2=A0know what it is, e=\r\nven though I can&#39;t even spell it or pronounce it. It&#39;s what the skeptics an=\r\nd debunkers tout as the answer to all paranormal experience. I think we oug=\r\nht to pull our claws back in, especially me!\n=C2=A0\n=C2=A0I have gotten &quot;vo=\r\nices&quot; that I thought were perfectly clear, and no one else could hear it, a=\r\nnd some=C2=A0I found=C2=A0was just=C2=A0a snippet of music, so yeah, that h=\r\nappens, but it does not eliminate or explain everything from the boxes, and=\r\n other EVP methods, you=C2=A0 just have to be aware of the possibility. Ano=\r\ntherr problem is broadcast fragments, sometimes they are just what they sou=\r\nnd like, an ad for one thing or another, sometimes they can=C2=A0have sychr=\r\nonistic meaning, and sometimes they can be altered in some way to form a me=\r\nssages, such as the recent one I had about learning sex, which was seemingl=\r\ny ignored by all cuz it has the &quot;s&quot; word--I guess. The fragments can also b=\r\ne distorted as the radio tuning is swept across a station, I don&#39;t accept e=\r\nvery word and syllable as meaning something. You have tio judge mnessage by=\r\n content and personal meaning. \n=C2=A0\n=C2=A0I have seen faces stand up in =\r\na carpet right in front of me, not something I just happened across, someth=\r\ning that happened live as I watched. For someone to suggest that&#39;s imaginat=\r\nion I find very offensive.=C2=A0 \n=C2=A0\n=C2=A0When I first switched to a l=\r\ninear sweep in the boxes, I could hear nothing but gibberish, then suddenly=\r\n=C2=A0I could hear &quot;them&quot;=C2=A0speaking. I doubt that is all imagination ei=\r\nther, I think the mind(which is not brain) has to reprogram the ears, which=\r\n are brain, to hear.=C2=A0 I also think the skeptics can not allow this pro=\r\ngramming to take place, hence they can&#39;t hear. I would be very surprised if=\r\n any of the hard core skeptics even turned on a box for fear that they may =\r\nhear something that&#39;s not there. Rorke(the Phd) implied as much when he wan=\r\nted a box to test, or more=C2=A0like debunk. That crap is frikkin&#39; pathetic=\r\n!\n=C2=A0\n=C2=A0\n=C2=A0\n=C2=A0\nF-S\n=C2=A0\n\n\n=C2=A0\nOn Fri, Apr 23, 2010 at 4=\r\n:30 PM, April Abercrombie &lt;april@abercrombiegh ostresearch. com&gt; wrote:\n\n\n=\r\n=C2=A0 \n\n\n\nPareidolia is not psuedo science. It is an actual, proven, natur=\r\nal functioning of the brain.\n\nhttp://en.wikipedia .org/wiki/ Pareidolia\n\nPl=\r\nease read this article, and more, if you have any questions about it being =\r\npsuedo science. I chose the Wikipedia version because I thought it would be=\r\n the least offensive to you. Other articles specifically called out EVP and=\r\n other things.\n\nFor the record, I don&#39;t think all EVP&#39;s are due to pareidol=\r\nia. \n\n\n\n\nOn Fri, Apr 23, 2010 at 3:47 PM, Frank Sumption &lt;purplealiengirl@ =\r\ngmail.com&gt; wrote:\n\n\n=C2=A0 \n\n\n\n\n=C2=A0It was implied that all this stuff is=\r\n &quot;Pareidolia&quot; , and because you could put a name on it that somehow meant i=\r\nt was all explanined. I&#39;ve been hearing this pseudo scientific BS for 10 ye=\r\nars, so I&#39;m a bit touchy. Science explains the paranormal away, and yet peo=\r\nple continune to photograph images, and get their names, and the names of d=\r\neseased loved ones through EVP, as well as questions answered, and science(=\r\nalthogh not all scientists)=C2=A0just ignores these inconvinient facts and =\r\nfocuses on=C2=A0that we=C2=A0might see things that are not there, which I d=\r\nisagree with as well. \n=C2=A0\n=C2=A0Did you even bother looking at the imag=\r\ne on the group home page. That was from sweeping a TV tuner with a random v=\r\noltage and video recording the monitor screen. So explain away why there is=\r\n a wolf image embedded in the guy&#39;s hat, an image of an alien below his ear=\r\n, and why in God&#39;s name does he resembles the classic description=C2=A0of a=\r\nn MIB or=C2=A0Shadow Person?=C2=A0 Pareidolia no doubt!\n=C2=A0\n=C2=A0F-S\n\n\n=\r\n\nOn Fri, Apr 23, 2010 at 3:19 PM, Rj &lt;rasterer@yahoo. com&gt; wrote:\n\n\n=C2=A0 =\r\n\n\n\n\n\n\n\n\nI&#39;m not sure who you&#39;re talking to about &quot;holier than thou&quot;.=C2=A0 =\r\nBut, you are the one who keeps dismissing any question about results and te=\r\nsting with phrases like &quot;Bite Me&quot;. I don&#39;t see anyone else doing that, and =\r\nI certainly never have.\n\nI agree trying new things is good.=C2=A0 And discu=\r\nssing results.=C2=A0 And looking for new directions.=C2=A0=C2=A0 So I&#39;m sti=\r\nll not sure who you are upset with.=C2=A0 Perhaps you could be more specifi=\r\nc: quote what you have found objectionable, and let us know why?\n\n\n\n--- On =\r\nFri, 4/23/10, Frank Sumption &lt;purplealiengirl@ gmail.com&gt; wrote:\n\n\nFrom: Fr=\r\nank Sumption &lt;purplealiengirl@ gmail.com&gt;\nSubject: [EVP-ITC] nuff said?\nTo:=\r\n evp-itc@yahoogroups .com\nDate: Friday, April 23, 2010, 12:59 PM \n\n\n\n\n\n=C2=\r\n=A0 \n\n\n&quot;Congratulations! bulletbabea has changed your membership status for=\r\n the\ngroup EVP-ITC from Member to Moderator.&quot; \n=C2=A0\n=C2=A0Go ahead skepdo=\r\nrks, make my day!=C2=A0=C2=A0I don&#39;t mind some honest debate, but not this =\r\nholier than thou science BS, where you think cuz you stick a label on somet=\r\nhing=C2=A0it can be dismissed as thoroughly debunked. Maybe--I&#39;m easily off=\r\nended, and I&#39;ll take that into account. \n=C2=A0\n=C2=A0F-S\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\r\n--0-593953624-1272118223=:20029\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;DIV&gt;Lizzie, I don&#39;t write here often. In fac=\r\nt, this is my third time in responding to other than my question yesterday.=\r\n &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I HEAR what you are saying. I was skeptical =\r\n, even as a medium, of my abilities, what I would see, hear, feel and recei=\r\nve, even when witnessed by others&nbsp;and including physical manifestation=\r\n.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I got some &quot;hard evidence&quot; last June and thr=\r\noughout the rest of 2009. We obtained/ photographed and have unretouched ph=\r\notos from within our home, K meter readings, videos of our lights &amp; ste=\r\nreo/tv turning itself off and on , including changing channels with NO pers=\r\non being responsible, NO intereference that could have caused it and outsid=\r\ne witnesses to said activities.Please bear with me if I am not overly clear=\r\n or you feel things are left out, I will always answer questions! * smile *=\r\n We have hours of recordings, both video and audio, of the goings ons in ou=\r\nr home and those of others, my partner Jay &amp; I have met. &lt;/DIV&gt;\n&lt;DIV&gt;&n=\r\nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Let&#39;s talk, discuss this. Okay? I am more than willing to h=\r\near you out.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Annie C.&lt;BR&gt;&lt;BR&gt;&lt;FONT face=3D&quot;com=\r\nic sans ms&quot; color=3D#a040ff size=3D3&gt;Take every chance you get because some=\r\n things only happen once...&lt;/FONT&gt;&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Sat, 4/24/10, Lizzie Br=\r\noden &lt;I&gt;&lt;yahuli69@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;&lt;/DIV&gt;\n&lt;BLOCKQUOTE sty=\r\nle=3D&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: rgb(16,16,255) 2px =\r\nsolid&quot;&gt;&lt;BR&gt;From: Lizzie Broden &lt;yahuli69@...&gt;&lt;BR&gt;Subject: Re: [=\r\nEVP-ITC] nuff said?&lt;BR&gt;To: EVP-ITC@yahoogroups.com&lt;BR&gt;Date: Saturday, April=\r\n 24, 2010, 2:11 AM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3Dyiv1890319407&gt;&lt;SPAN style=3D&quot;DISPLAY: =\r\nnone&quot;&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV id=3Dygrp-text&gt;\n&lt;DIV&gt;\n&lt;DIV style=3D&quot;FONT-SIZE: 12=\r\npt; FONT-FAMILY: arial, helvetica, sans-serif&quot;&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;No I don&#39;t=\r\n have a spirit box, a Franks Box or anything like that.&nbsp; And no, I do =\r\nnot want one.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I have&nbsp;been involved with&n=\r\nbsp;this research a long time, been a paranormal researcher for a long time=\r\n, with ten years of real investigative work under my belt to boot.&lt;/DIV&gt;\n&lt;D=\r\nIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I am not cutting anyone down at the knees here, not in=\r\nsulting anyones work or personal beliefs.&nbsp; &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;D=\r\nIV&gt;But this onslaught of betterment against logical thought and questioning=\r\n is a bit troubling, do you not think?&nbsp; Can we not hear both sides?&nb=\r\nsp; &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Not every Skeptic is out to get you!&nbsp=\r\n; But you might be asked a few&nbsp; questions.&nbsp; And in the long run o=\r\nf things,&nbsp;what is will be.&nbsp; There is no one &quot;OUT TO GET YOU&quot;&lt;/DIV=\r\n&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;That is not the nature of discovery&nbsp;or of Sci=\r\nence.&nbsp; If, people are talking to dead people with (Effectively) broken=\r\n radios, lets see the facts and analyze it.&nbsp; Let&#39;s test it! Let&#39;s get =\r\nto the bottom of it.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Let us&nbsp;really, reall=\r\ny look at it.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;If anything like that was ever a=\r\nble to be proven as a solid Scientific principle or fact, it would be monum=\r\nental.&nbsp; It would be Earth shattering and completely change how we&nbsp=\r\n;view logic and science as we know it.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;So if t=\r\nhis is real, lets look at it.&nbsp;Lets try and be objective about it?&lt;/DIV=\r\n&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;What is wrong with that?&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&nbsp;&lt;/DI=\r\nV&gt;&quot;Nature is showing us only the tail of the lion, but I have no doubt that=\r\n the lion belongs to it even though, because of its large size, it cannot t=\r\notally reveal itself all at once.&quot; &lt;BR&gt;-=E2=80=94 Albert Einstein \n&lt;DIV&gt;&lt;/D=\r\nIV&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;DIV&gt;&quot;It is far better to grasp the universe as it really is th=\r\nan to persist in delusions, however satisfying and reassuring.&quot;&lt;BR&gt;--Carl S=\r\nagan&lt;/DIV&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;DIV&gt;&quot;There is no such thing as an insignificant detail.=\r\n Don&#39;t just look &lt;BR&gt;for what you want to find.&quot;&lt;BR&gt;-- Me LOL \n&lt;DIV&gt;&lt;BR&gt;&lt;/D=\r\nIV&gt;\n&lt;DIV style=3D&quot;FONT-SIZE: 12pt; FONT-FAMILY: arial, helvetica, sans-seri=\r\nf&quot;&gt;&lt;BR&gt;\n&lt;DIV style=3D&quot;FONT-SIZE: 12pt; BORDER-LEFT: #1010ff 2px solid; FONT=\r\n-FAMILY: times new roman, new york, times, serif&quot;&gt;&lt;FONT face=3DTahoma size=\r\n=3D2&gt;\n&lt;HR SIZE=3D1&gt;\n&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: bold&quot;&gt;From:&lt;/SPAN&gt;&lt;/B&gt; J=\r\nANDANACOSTA &lt;jandan108@yahoo. com&gt;&lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: =\r\nbold&quot;&gt;To:&lt;/SPAN&gt;&lt;/B&gt; EVP-ITC@yahoogroups .com&lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEI=\r\nGHT: bold&quot;&gt;Sent:&lt;/SPAN&gt;&lt;/B&gt; Fri, April 23, 2010 11:41:09 PM&lt;BR&gt;&lt;B&gt;&lt;SPAN sty=\r\nle=3D&quot;FONT-WEIGHT: bold&quot;&gt;Subject:&lt;/SPAN&gt;&lt;/B&gt; Re: [EVP-ITC] nuff said?&lt;BR&gt;&lt;/=\r\nFONT&gt;&lt;BR&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV id=3Dygrp-text&gt;\n&lt;DIV&gt;\n&lt;TABLE cellSpacing=\r\n=3D0 cellPadding=3D0 border=3D0&gt;\n&lt;TBODY&gt;\n&lt;TR&gt;\n&lt;TD vAlign=3Dtop&gt;Did someone =\r\nberate you for your opinion? I haven&#39;t seen that here either. &nbsp;Do you =\r\nhave a spirit box and do sessions to communicate with the spirits? &nbsp;I =\r\nwould be interested in knowing what you have experienced and any conclusion=\r\ns you may have made. \n&lt;DIV&gt;&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Fri, 4/23/10, Lizzie Broden &lt;I=\r\n&gt;&lt;yahuli69@yahoo. com&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER=\r\n-LEFT: rgb(16,16,255) 2px solid&quot;&gt;&lt;BR&gt;From: Lizzie Broden &lt;yahuli69@yahoo=\r\n. com&gt;&lt;BR&gt;Subject: Re: [EVP-ITC] nuff said?&lt;BR&gt;To: EVP-ITC@yahoogroups .=\r\ncom&lt;BR&gt;Date: Friday, April 23, 2010, 9:01 PM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3Dyiv210476240=\r\n9&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV id=3Dygrp-text&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV style=3D&quot;FONT-=\r\nSIZE: 12pt; FONT-FAMILY: arial, helvetica, sans-serif&quot;&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;I =\r\nam angry because I feel personally berated, as a&nbsp;Human with a thinking=\r\n mind or brain!&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Why am I here?&nbsp; To see if=\r\n there is really&nbsp;anything to this idea and theory.&nbsp; So far I am n=\r\not seeing a whole lot other than people being pissed off at the questioning=\r\n&nbsp;of ideas. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;If this is real, lets see it.=\r\n&nbsp; Get over all this &quot;Skeptic&quot; crap and prove the point.&nbsp; I am gon=\r\ng to say it one more time, if this is a question of faith or religion, WOND=\r\nERFUL!&nbsp; Best of luck with it!&nbsp; I got no problem with the idea.&nb=\r\nsp; If you don&#39;t want your ideas questioned, or it is a mater of Faith, tha=\r\nt is fine. But say so, and while you are at it, don&#39;t kick the rest of us t=\r\nhat are honestly looking at thing for what they are, not what we want them =\r\nto be!&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;But, when you put it out there as a sta=\r\ntement of fact, and then ride the asses of anyone that questions it, I got =\r\nmore than a problem with it.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I have sat back a=\r\nnd been a member here for a long time. Keep my mouth shut, but this is more=\r\n than crossing the line.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;If it is real, than l=\r\nets look at it.&nbsp; But when we look at it, lets look at what we know to =\r\nbe the truth and lets take all of that data into consideration and discernm=\r\nent before coming to a conclusion.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;That is not=\r\n to much to ask!&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&nbsp;&lt;/DIV&gt;&quot;Nature is showing us only the =\r\ntail of the lion, but I have no doubt that the lion belongs to it even thou=\r\ngh, because of its large size, it cannot totally reveal itself all at once.=\r\n&quot; &lt;BR&gt;-=E2=80=94 Albert Einstein \n&lt;DIV&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;DIV&gt;&quot;It is far bette=\r\nr to grasp the universe as it really is than to persist in delusions, howev=\r\ner satisfying and reassuring.&quot;&lt;BR&gt;--Carl Sagan&lt;/DIV&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;DIV&gt;&quot;There is=\r\n no such thing as an insignificant detail. Don&#39;t just look &lt;BR&gt;for what you=\r\n want to find.&quot;&lt;BR&gt;-- Me LOL \n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV style=3D&quot;FONT-SIZE: 12pt=\r\n; FONT-FAMILY: arial, helvetica, sans-serif&quot;&gt;&lt;BR&gt;\n&lt;DIV style=3D&quot;FONT-SIZE: =\r\n12pt; BORDER-LEFT: #1010ff 2px solid; FONT-FAMILY: times new roman, new yor=\r\nk, times, serif&quot;&gt;&lt;FONT face=3DTahoma size=3D2&gt;\n&lt;HR SIZE=3D1&gt;\n&lt;B&gt;&lt;SPAN style=\r\n=3D&quot;FONT-WEIGHT: bold&quot;&gt;From:&lt;/SPAN&gt;&lt;/B&gt; JANDANACOSTA &lt;jandan108@yahoo. c=\r\nom&gt;&lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: bold&quot;&gt;To:&lt;/SPAN&gt;&lt;/B&gt; EVP-ITC@yahoo=\r\ngroups .com&lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: bold&quot;&gt;Sent:&lt;/SPAN&gt;&lt;/B&gt; Fri, A=\r\npril 23, 2010 10:34:30 PM&lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: bold&quot;&gt;Subject:&lt;=\r\n/SPAN&gt;&lt;/B&gt; Re: [EVP-ITC] nuff said?&lt;BR&gt;&lt;/FONT&gt;&lt;BR&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV=\r\n id=3Dygrp-text&gt;\n&lt;DIV&gt;\n&lt;TABLE cellSpacing=3D0 cellPadding=3D0 border=3D0&gt;\n&lt;=\r\nTBODY&gt;\n&lt;TR&gt;\n&lt;TD vAlign=3Dtop&gt;I am confused about two issues. First, Why the=\r\n angry emails? &nbsp;I don&#39;t think I have seen this before with this group.=\r\n Also, I don&#39;t get why anyone who is a skeptic would belong to this group.?=\r\n I mean no disrespect , just curious.&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Fri, 4/23/10, Lizzie=\r\n Broden &lt;I&gt;&lt;yahuli69@yahoo. com&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=\r\n=3D&quot;BORDER-LEFT: rgb(16,16,255) 2px solid&quot;&gt;&lt;BR&gt;From: Lizzie Broden &lt;yahu=\r\nli69@yahoo. com&gt;&lt;BR&gt;Subject: Re: [EVP-ITC] nuff said?&lt;BR&gt;To: EVP-ITC@yah=\r\noogroups .com&lt;BR&gt;Date: Friday, April 23, 2010, 8:09 PM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3Dyi=\r\nv1890843569&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV id=3Dygrp-text&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV styl=\r\ne=3D&quot;FONT-SIZE: 12pt; FONT-FAMILY: arial, helvetica, sans-serif&quot;&gt;\n&lt;DIV&gt;&lt;/DI=\r\nV&gt;\n&lt;DIV&gt;You are ever bit as bad&nbsp;as Randi or any of them!&nbsp; You are=\r\n just the flip-side of the coin!&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Your misuse o=\r\nf the word,&nbsp;&quot;Skeptic&quot; has taken on a totally new meaning.&nbsp; You se=\r\ne anyone that has a problem with your half baked ideas, and insanity, yeah =\r\nI said it, as a &quot;Skeptic.&quot;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Maybe it would do y=\r\nou some good to research the word and idea behind it before you go off half=\r\n cocked as you are.&nbsp;&nbsp;The world is not out to get you or your damn=\r\ned box!&nbsp; If there is any truth to it, the let&#39;s see the evidence of it=\r\n.&nbsp; Lets look at it for what it is, NOT WHAT YOU OR ANYONE WANTS IT TO =\r\nBE!&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;What it is, no more and no less!&lt;/DIV&gt;\n&lt;DI=\r\nV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I am a Skeptic, it the true sense of the word.&nbsp; An=\r\nd I have been holding my tongue hoping you would pull out of this crap.&nbs=\r\np; Frank, get a grip!&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Not everyone that disagr=\r\nees with&nbsp;you is out to get you!&nbsp; I have real problems with the wh=\r\nole theory, but I have never questioned your heart or&nbsp;integrity over i=\r\nt.&nbsp; (Well, other than letting Moon play the dance he is playing with Y=\r\nOUR BOX!)&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;But, lets analytically look at this =\r\nfor what it is and find&nbsp;the truth of it?&nbsp; If you want to turn it =\r\ninto a religion that is on top of some mountain, so be it!&nbsp; But other =\r\npeople are not going to see the subject in black and white standards.&lt;/DIV&gt;=\r\n\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Give it a rest and thinks about it.&nbsp; The world=\r\n is not out to get you Frank!&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&nbsp;&lt;/DIV&gt;&quot;Nature is showing=\r\n us only the tail of the lion, but I have no doubt that the lion belongs to=\r\n it even though, because of its large size, it cannot totally reveal itself=\r\n all at once.&quot; &lt;BR&gt;-=E2=80=94 Albert Einstein \n&lt;DIV&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;DIV&gt;&quot;It=\r\n is far better to grasp the universe as it really is than to persist in del=\r\nusions, however satisfying and reassuring.&quot;&lt;BR&gt;--Carl Sagan&lt;/DIV&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;=\r\nDIV&gt;&quot;There is no such thing as an insignificant detail. Don&#39;t just look &lt;BR=\r\n&gt;for what you want to find.&quot;&lt;BR&gt;-- Me LOL \n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV style=3D&quot;FO=\r\nNT-SIZE: 12pt; FONT-FAMILY: arial, helvetica, sans-serif&quot;&gt;&lt;BR&gt;\n&lt;DIV style=\r\n=3D&quot;FONT-SIZE: 12pt; BORDER-LEFT: #1010ff 2px solid; FONT-FAMILY: times new=\r\n roman, new york, times, serif&quot;&gt;&lt;FONT face=3DTahoma size=3D2&gt;\n&lt;HR SIZE=3D1&gt;=\r\n\n&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: bold&quot;&gt;From:&lt;/SPAN&gt;&lt;/B&gt; Frank Sumption &lt;p=\r\nurplealiengirl@ gmail.com&gt;&lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: bold&quot;&gt;To:&lt;/=\r\nSPAN&gt;&lt;/B&gt; EVP-ITC@yahoogroups .com&lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: bold&quot;&gt;=\r\nSent:&lt;/SPAN&gt;&lt;/B&gt; Fri, April 23, 2010 7:29:14 PM&lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FONT-W=\r\nEIGHT: bold&quot;&gt;Subject:&lt;/SPAN&gt;&lt;/B&gt; Re: [EVP-ITC] nuff said?&lt;BR&gt;&lt;/FONT&gt;&lt;BR&gt;&lt;SP=\r\nAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV id=3Dygrp-text&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;I&nbsp;know w=\r\nhat it is, even though I can&#39;t even spell it or pronounce it. It&#39;s what the=\r\n skeptics and debunkers tout as the answer to all paranormal experience. I =\r\nthink we ought to pull our claws back in, especially me!&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;=\r\n/DIV&gt;\n&lt;DIV&gt;&nbsp;I have gotten &quot;voices&quot; that I thought were perfectly clear=\r\n, and no one else could hear it, and some&nbsp;I found&nbsp;was just&nbsp;a=\r\n snippet of music, so yeah, that happens, but it does not eliminate or expl=\r\nain everything from the boxes, and other EVP methods, you&nbsp; just have t=\r\no be aware of the possibility. Anotherr problem is broadcast fragments, som=\r\netimes they are just what they sound like, an ad for one thing or another, =\r\nsometimes they can&nbsp;have sychronistic meaning, and sometimes they can b=\r\ne altered in some way to form a messages, such as the recent one I had abou=\r\nt learning sex, which was seemingly ignored by all cuz it has the &quot;s&quot; word-=\r\n-I guess. The fragments can also be distorted as the radio tuning is swept =\r\nacross a station, I don&#39;t accept every word and syllable as meaning somethi=\r\nng. You have tio judge mnessage by content and personal meaning. &lt;/DIV&gt;\n&lt;DI=\r\nV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;I have seen faces stand up in a carpet right in f=\r\nront of me, not something I just happened across, something that happened l=\r\nive as I watched. For someone to suggest that&#39;s imagination I find very off=\r\nensive.&nbsp; &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;When I first switched to =\r\na linear sweep in the boxes, I could hear nothing but gibberish, then sudde=\r\nnly&nbsp;I could hear &quot;them&quot;&nbsp;speaking. I doubt that is all imagination=\r\n either, I think the mind(which is not brain) has to reprogram the ears, wh=\r\nich are brain, to hear.&nbsp; I also think the skeptics can not allow this =\r\nprogramming to take place, hence they can&#39;t hear. I would be very surprised=\r\n if any of the hard core skeptics even turned on a box for fear that they m=\r\nay hear something that&#39;s not there. Rorke(the Phd) implied as much when he =\r\nwanted a box to test, or more&nbsp;like debunk. That crap is frikkin&#39; pathe=\r\ntic!&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp=\r\n;&lt;/DIV&gt;\n&lt;DIV&gt;F-S&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;BR&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV cla=\r\nss=3Dgmail_quote&gt;On Fri, Apr 23, 2010 at 4:30 PM, April Abercrombie &lt;SPAN d=\r\nir=3Dltr&gt;&lt;&lt;A rel=3Dnofollow&gt;april@abercrombiegh ostresearch. com&lt;/A&gt;&gt;=\r\n&lt;/SPAN&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE class=3Dgmail_quote style=3D&quot;BORDER-LEFT: #c=\r\ncc 1px solid&quot;&gt;\n&lt;DIV style=3D&quot;BACKGROUND-COLOR: #fff&quot;&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;=\r\nDIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;Pareidolia is not psuedo science. It is an actual, pr=\r\noven, natural functioning of the brain.&lt;BR&gt;&lt;BR&gt;&lt;A href=3D&quot;http://en.wikiped=\r\nia.org/wiki/Pareidolia&quot; target=3D_blank rel=3Dnofollow&gt;http://en.wikipedia =\r\n.org/wiki/ Pareidolia&lt;/A&gt;&lt;BR&gt;&lt;BR&gt;Please read this article, and more, if you=\r\n have any questions about it being psuedo science. I chose the Wikipedia ve=\r\nrsion because I thought it would be the least offensive to you. Other artic=\r\nles specifically called out EVP and other things.&lt;BR&gt;&lt;BR&gt;For the record, I =\r\ndon&#39;t think all EVP&#39;s are due to pareidolia. &lt;/DIV&gt;\n&lt;DIV class=3Dim&gt;&lt;BR&gt;&lt;BR=\r\n&gt;&lt;BR&gt;\n&lt;DIV class=3Dgmail_quote&gt;On Fri, Apr 23, 2010 at 3:47 PM, Frank Sumpt=\r\nion &lt;SPAN dir=3Dltr&gt;&lt;&lt;A rel=3Dnofollow&gt;purplealiengirl@ gmail.com&lt;/A&gt;&gt=\r\n;&lt;/SPAN&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE class=3Dgmail_quote style=3D&quot;BORDER-LEFT: r=\r\ngb(204,204,204) 1px solid&quot;&gt;\n&lt;DIV style=3D&quot;BACKGROUND-COLOR: rgb(255,255,255=\r\n)&quot;&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;It was imp=\r\nlied that all this stuff is &quot;Pareidolia&quot; , and because you could put a name=\r\n on it that somehow meant it was all explanined. I&#39;ve been hearing this pse=\r\nudo scientific BS for 10 years, so I&#39;m a bit touchy. Science explains the p=\r\naranormal away, and yet people continune to photograph images, and get thei=\r\nr names, and the names of deseased loved ones through EVP, as well as quest=\r\nions answered, and science(althogh not all scientists)&nbsp;just ignores th=\r\nese inconvinient facts and focuses on&nbsp;that we&nbsp;might see things th=\r\nat are not there, which I disagree with as well. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;=\r\nDIV&gt;&nbsp;Did you even bother looking at the image on the group home page. =\r\nThat was from sweeping a TV tuner with a random voltage and video recording=\r\n the monitor screen. So explain away why there is a wolf image embedded in =\r\nthe guy&#39;s hat, an image of an alien below his ear, and why in God&#39;s name do=\r\nes he resembles the classic description&nbsp;of an MIB or&nbsp;Shadow Perso=\r\nn?&nbsp; Pareidolia no doubt!&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;F-S&lt;BR&gt;&lt;BR=\r\n&gt;&lt;/DIV&gt;\n&lt;DIV&gt;\n&lt;DIV class=3Dgmail_quote&gt;On Fri, Apr 23, 2010 at 3:19 PM, Rj =\r\n&lt;SPAN dir=3Dltr&gt;&lt;&lt;A rel=3Dnofollow&gt;rasterer@yahoo. com&lt;/A&gt;&gt;&lt;/SPAN&gt; wr=\r\note:&lt;BR&gt;\n&lt;BLOCKQUOTE class=3Dgmail_quote style=3D&quot;BORDER-LEFT: rgb(204,204,=\r\n204) 1px solid&quot;&gt;\n&lt;DIV style=3D&quot;BACKGROUND-COLOR: rgb(255,255,255)&quot;&gt;&lt;SPAN&gt;&n=\r\nbsp;&lt;/SPAN&gt; \n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;TABLE cellSpacing=3D0 cellPaddi=\r\nng=3D0 border=3D0&gt;\n&lt;TBODY&gt;\n&lt;TR&gt;\n&lt;TD vAlign=3Dtop&gt;I&#39;m not sure who you&#39;re ta=\r\nlking to about &quot;holier than thou&quot;.&nbsp; But, you are the one who keeps dis=\r\nmissing any question about results and testing with phrases like &quot;Bite Me&quot;.=\r\n I don&#39;t see anyone else doing that, and I certainly never have.&lt;BR&gt;&lt;BR&gt;I a=\r\ngree trying new things is good.&nbsp; And discussing results.&nbsp; And loo=\r\nking for new directions.&nbsp;&nbsp; So I&#39;m still not sure who you are upse=\r\nt with.&nbsp; Perhaps you could be more specific: quote what you have found=\r\n objectionable, and let us know why?&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Fri, 4/23/10,=\r\n Frank Sumption &lt;I&gt;&lt;&lt;A rel=3Dnofollow&gt;purplealiengirl@ gmail.com&lt;/A&gt;&gt;=\r\n&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: rgb(16,16,255) 2px so=\r\nlid&quot;&gt;&lt;BR&gt;From: Frank Sumption &lt;&lt;A rel=3Dnofollow&gt;purplealiengirl@ gmail.=\r\ncom&lt;/A&gt;&gt;&lt;BR&gt;Subject: [EVP-ITC] nuff said?&lt;BR&gt;To: &lt;A rel=3Dnofollow&gt;evp-i=\r\ntc@yahoogroups .com&lt;/A&gt;&lt;BR&gt;Date: Friday, April 23, 2010, 12:59 PM \n&lt;DIV&gt;\n&lt;D=\r\nIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;DIV&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&quot;C=\r\nongratulations! bulletbabea has changed your membership status for the&lt;BR&gt;g=\r\nroup EVP-ITC from Member to Moderator.&quot; &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp=\r\n;Go ahead skepdorks, make my day!&nbsp;&nbsp;I don&#39;t mind some honest debat=\r\ne, but not this holier than thou science BS, where you think cuz you stick =\r\na label on something&nbsp;it can be dismissed as thoroughly debunked. Maybe=\r\n--I&#39;m easily offended, and I&#39;ll take that into account. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;=\r\n/DIV&gt;\n&lt;DIV&gt;&nbsp;F-S&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/TD&gt;&lt;/TR&gt;&lt;/=\r\nTBODY&gt;&lt;/TABLE&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV style=3D&quot;COLOR: rgb(255,255,255)&quot;&gt;&lt;/DIV&gt;&lt;/DIV=\r\n&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV style=3D&quot;COLOR: rgb(2=\r\n55,255,255)&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;/D=\r\nIV&gt;&lt;/DIV&gt;\n&lt;DIV style=3D&quot;COLOR: #fff&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;=\r\n/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/TD&gt;&lt;/=\r\nTR&gt;&lt;/TBODY&gt;&lt;/TABLE&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;=\r\n&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;/TD&gt;&lt;/TR&gt;&lt;/TBODY&gt;&lt;/TABLE&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/=\r\nDIV&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;\r\n--0-593953624-1272118223=:20029--"}