{"id": "17069", "subject": "Re: [EVP-ITC] nuff said?", "author": "April Abercrombie", "timestamp": "2010-04-24T17:27:11Z", "full_text": "&quot;Also, I don&#39;t get why anyone who is a skeptic would belong to this group?&quot;\n\nI am here because I want to see what its all about, ask questions, and form\nmy own conclusions. I can&#39;t have an opinion on something if I don&#39;t even\nknow what it is about. So I am here to learn about ITC technologies from\nboth believers and other skeptics alike.\n\nI am not here to debunk or otherwise tear apart anything Frank is doing, and\nmy opinion should not matter to him.\n\nI am here to hopefully find proof one way or another.\n\nSome people here have very bad baggage associated with skeptics. A true\nskeptic neither believes, nor disbelieves anything without proof either way.\nThere are people who won&#39;t believe anything no matter what proof you give\nthem. They are not true skeptics. They are disbelievers, the flip side of\nbelievers.\n\nSkeptics should be square in the middle. Skeptics think only objectively.\n\n\nOn Sat, Apr 24, 2010 at 9:04 AM, Rj &lt;rasterer@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; JANDANACOSTA,\n&gt;\n&gt; Being skeptical about something - doubting something is certain - seems\n&gt; like a reasonable attitude with all the things we encounter in life\n&gt; (politics, tv, religion, car salesmen, diets, advertisements, etc).\n&gt;\n&gt; So to answer your question &quot;Also, I don&#39;t get why anyone who is a skeptic\n&gt; would belong to this group?&quot;.  Doubting and questioning results can only\n&gt; make a field of research more  solid in the long run.  It helps to divide\n&gt; the weak evidence and methods from the strong.   While everyone is still\n&gt; free to pursue their beliefs, everyone only has so much time and money,  and\n&gt; getting help with determining the best areas to spend that time and money\n&gt; can be a valuable thing.\n&gt;\n&gt; So for anyone doing research, especially their own personal research, who\n&gt; is not wealthy and does not have 100 years left in their lives, being\n&gt; skeptical about one&#39;s results seems not only a necessity, but I don&#39;t think\n&gt; any kind of progress, especially in a difficult area like the paranormal, is\n&gt; even possible without it.\n&gt;\n&gt;\n&gt; **\n&gt; --- On *Fri, 4/23/10, JANDANACOSTA &lt;jandan108@...&gt;* wrote:\n&gt;\n&gt;\n&gt; From: JANDANACOSTA &lt;jandan108@...&gt;\n&gt; Subject: Re: [EVP-ITC] nuff said?\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Friday, April 23, 2010, 8:34 PM\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; I am confused about two issues. First, Why the angry emails?  I don&#39;t think\n&gt; I have seen this before with this group. Also, I don&#39;t get why anyone who is\n&gt; a skeptic would belong to this group.? I mean no disrespect , just curious.\n&gt;\n&gt; --- On *Fri, 4/23/10, Lizzie Broden &lt;yahuli69@yahoo. com&gt;* wrote:\n&gt;\n&gt;\n&gt; From: Lizzie Broden &lt;yahuli69@yahoo. com&gt;\n&gt; Subject: Re: [EVP-ITC] nuff said?\n&gt; To: EVP-ITC@yahoogroups .com\n&gt; Date: Friday, April 23, 2010, 8:09 PM\n&gt;\n&gt;\n&gt;\n&gt; You are ever bit as bad as Randi or any of them!  You are just the\n&gt; flip-side of the coin!\n&gt;\n&gt; Your misuse of the word, &quot;Skeptic&quot; has taken on a totally new meaning.  You\n&gt; see anyone that has a problem with your half baked ideas, and insanity, yeah\n&gt; I said it, as a &quot;Skeptic.&quot;\n&gt;\n&gt; Maybe it would do you some good to research the word and idea behind it\n&gt; before you go off half cocked as you are.  The world is not out to get you\n&gt; or your damned box!  If there is any truth to it, the let&#39;s see the evidence\n&gt; of it.  Lets look at it for what it is, NOT WHAT YOU OR ANYONE WANTS IT TO\n&gt; BE!\n&gt;\n&gt; What it is, no more and no less!\n&gt;\n&gt; I am a Skeptic, it the true sense of the word.  And I have been holding my\n&gt; tongue hoping you would pull out of this crap.  Frank, get a grip!\n&gt;\n&gt; Not everyone that disagrees with you is out to get you!  I have real\n&gt; problems with the whole theory, but I have never questioned your heart\n&gt; or integrity over it.  (Well, other than letting Moon play the dance he is\n&gt; playing with YOUR BOX!)\n&gt;\n&gt; But, lets analytically look at this for what it is and find the truth of\n&gt; it?  If you want to turn it into a religion that is on top of some mountain,\n&gt; so be it!  But other people are not going to see the subject in black and\n&gt; white standards.\n&gt;\n&gt; Give it a rest and thinks about it.  The world is not out to get you Frank!\n&gt;\n&gt;\n&gt; &quot;Nature is showing us only the tail of the lion, but I have no doubt that\n&gt; the lion belongs to it even though, because of its large size, it cannot\n&gt; totally reveal itself all at once.&quot;\n&gt; -— Albert Einstein\n&gt;\n&gt;\n&gt; &quot;It is far better to grasp the universe as it really is than to persist in\n&gt; delusions, however satisfying and reassuring.&quot;\n&gt; --Carl Sagan\n&gt;\n&gt;\n&gt; &quot;There is no such thing as an insignificant detail. Don&#39;t just look\n&gt; for what you want to find.&quot;\n&gt; -- Me LOL\n&gt;\n&gt;\n&gt;  ------------------------------\n&gt; *From:* Frank Sumption &lt;purplealiengirl@ gmail.com&gt;\n&gt; *To:* EVP-ITC@yahoogroups .com\n&gt; *Sent:* Fri, April 23, 2010 7:29:14 PM\n&gt; *Subject:* Re: [EVP-ITC] nuff said?\n&gt;\n&gt;\n&gt;\n&gt;  I know what it is, even though I can&#39;t even spell it or pronounce it. It&#39;s\n&gt; what the skeptics and debunkers tout as the answer to all paranormal\n&gt; experience. I think we ought to pull our claws back in, especially me!\n&gt;\n&gt;  I have gotten &quot;voices&quot; that I thought were perfectly clear, and no one\n&gt; else could hear it, and some I found was just a snippet of music, so yeah,\n&gt; that happens, but it does not eliminate or explain everything from the\n&gt; boxes, and other EVP methods, you  just have to be aware of the possibility.\n&gt; Anotherr problem is broadcast fragments, sometimes they are just what they\n&gt; sound like, an ad for one thing or another, sometimes they can have\n&gt; sychronistic meaning, and sometimes they can be altered in some way to form\n&gt; a messages, such as the recent one I had about learning sex, which was\n&gt; seemingly ignored by all cuz it has the &quot;s&quot; word--I guess. The fragments can\n&gt; also be distorted as the radio tuning is swept across a station, I don&#39;t\n&gt; accept every word and syllable as meaning something. You have tio judge\n&gt; mnessage by content and personal meaning.\n&gt;\n&gt;  I have seen faces stand up in a carpet right in front of me, not something\n&gt; I just happened across, something that happened live as I watched. For\n&gt; someone to suggest that&#39;s imagination I find very offensive.\n&gt;\n&gt;  When I first switched to a linear sweep in the boxes, I could hear nothing\n&gt; but gibberish, then suddenly I could hear &quot;them&quot; speaking. I doubt that is\n&gt; all imagination either, I think the mind(which is not brain) has to\n&gt; reprogram the ears, which are brain, to hear.  I also think the skeptics can\n&gt; not allow this programming to take place, hence they can&#39;t hear. I would be\n&gt; very surprised if any of the hard core skeptics even turned on a box for\n&gt; fear that they may hear something that&#39;s not there. Rorke(the Phd) implied\n&gt; as much when he wanted a box to test, or more like debunk. That crap is\n&gt; frikkin&#39; pathetic!\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; F-S\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; On Fri, Apr 23, 2010 at 4:30 PM, April Abercrombie &lt;april@abercrombiegh\n&gt; ostresearch. com&gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; Pareidolia is not psuedo science. It is an actual, proven, natural\n&gt;&gt; functioning of the brain.\n&gt;&gt;\n&gt;&gt; http://en.wikipedia .org/wiki/ Pareidolia&lt;http://en.wikipedia.org/wiki/Pareidolia&gt;\n&gt;&gt;\n&gt;&gt; Please read this article, and more, if you have any questions about it\n&gt;&gt; being psuedo science. I chose the Wikipedia version because I thought it\n&gt;&gt; would be the least offensive to you. Other articles specifically called out\n&gt;&gt; EVP and other things.\n&gt;&gt;\n&gt;&gt; For the record, I don&#39;t think all EVP&#39;s are due to pareidolia.\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; On Fri, Apr 23, 2010 at 3:47 PM, Frank Sumption &lt;purplealiengirl@\n&gt;&gt; gmail.com&gt; wrote:\n&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;  It was implied that all this stuff is &quot;Pareidolia&quot; , and because you\n&gt;&gt;&gt; could put a name on it that somehow meant it was all explanined. I&#39;ve been\n&gt;&gt;&gt; hearing this pseudo scientific BS for 10 years, so I&#39;m a bit touchy. Science\n&gt;&gt;&gt; explains the paranormal away, and yet people continune to photograph images,\n&gt;&gt;&gt; and get their names, and the names of deseased loved ones through EVP, as\n&gt;&gt;&gt; well as questions answered, and science(althogh not all scientists) just\n&gt;&gt;&gt; ignores these inconvinient facts and focuses on that we might see things\n&gt;&gt;&gt; that are not there, which I disagree with as well.\n&gt;&gt;&gt;\n&gt;&gt;&gt;  Did you even bother looking at the image on the group home page. That\n&gt;&gt;&gt; was from sweeping a TV tuner with a random voltage and video recording the\n&gt;&gt;&gt; monitor screen. So explain away why there is a wolf image embedded in the\n&gt;&gt;&gt; guy&#39;s hat, an image of an alien below his ear, and why in God&#39;s name does he\n&gt;&gt;&gt; resembles the classic description of an MIB or Shadow Person?  Pareidolia no\n&gt;&gt;&gt; doubt!\n&gt;&gt;&gt;\n&gt;&gt;&gt;  F-S\n&gt;&gt;&gt;\n&gt;&gt;&gt;  On Fri, Apr 23, 2010 at 3:19 PM, Rj &lt;rasterer@yahoo. com&gt; wrote:\n&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;   I&#39;m not sure who you&#39;re talking to about &quot;holier than thou&quot;.  But,\n&gt;&gt;&gt;&gt; you are the one who keeps dismissing any question about results and testing\n&gt;&gt;&gt;&gt; with phrases like &quot;Bite Me&quot;. I don&#39;t see anyone else doing that, and I\n&gt;&gt;&gt;&gt; certainly never have.\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; I agree trying new things is good.  And discussing results.  And looking\n&gt;&gt;&gt;&gt; for new directions.   So I&#39;m still not sure who you are upset with.  Perhaps\n&gt;&gt;&gt;&gt; you could be more specific: quote what you have found objectionable, and let\n&gt;&gt;&gt;&gt; us know why?\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; --- On *Fri, 4/23/10, Frank Sumption &lt;purplealiengirl@ gmail.com&gt;*wrote:\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; From: Frank Sumption &lt;purplealiengirl@ gmail.com&gt;\n&gt;&gt;&gt;&gt; Subject: [EVP-ITC] nuff said?\n&gt;&gt;&gt;&gt; To: evp-itc@yahoogroups .com\n&gt;&gt;&gt;&gt; Date: Friday, April 23, 2010, 12:59 PM\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; &quot;Congratulations! bulletbabea has changed your membership status for the\n&gt;&gt;&gt;&gt; group EVP-ITC from Member to Moderator.&quot;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;  Go ahead skepdorks, make my day!  I don&#39;t mind some honest debate, but\n&gt;&gt;&gt;&gt; not this holier than thou science BS, where you think cuz you stick a label\n&gt;&gt;&gt;&gt; on something it can be dismissed as thoroughly debunked. Maybe--I&#39;m easily\n&gt;&gt;&gt;&gt; offended, and I&#39;ll take that into account.\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;  F-S\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;\n&gt;\n&gt;\n&gt;\n&gt;  \n&gt;\n\n\"Also, I don' ge why anyone who is a skep ic would belong o his \ng oup?\"I am he e because I wan o see wha i s all abou , ask ques ions, and o m my own conclusions. I can' ha e an opinion on some hing i I don' e en know wha i is abou . So I am he e o lea n abou ITC echnologies om bo h belie e s and o he skep ics alike.\nI am no he e o debunk o o he wise ea apa any hing F ank is doing, and my opinion should no ma e o him.I am he e o hope ully ind p oo one way o ano he .Some people he e ha e e y bad baggage associa ed wi h skep ics. A ue skep ic nei he belie es, no disbelie es any hing wi hou p oo ei he way. The e a e people who won' belie e any hing no ma e wha p oo you gi e hem. They a e no ue skep ics. They a e disbelie e s, he lip side o belie e s.\nSkep ics should be squa e in he middle. Skep ics hink only objec i ely.On Sa , Ap 24, 2010 a 9:04 AM, Rj as e e @...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n JANDANACOSTA, Being skep ical abou some hing - doub ing some hing is ce ain - seems like a easonable a i ude wi h all he hings we encoun e in li e (poli ics, , eligion, ca salesmen, die s, ad e isemen s, e c).  \nSo o answe you ques ion \"Also, I don' ge why anyone who is a skep ic would belong o his \ng oup?\".  Doub ing and ques ioning esul s can only make a ield o esea ch mo e  solid in he long un.  I helps o di ide he weak e idence and me hods om he s ong.   While e e yone is s ill ee o pu sue hei belie s, e e yone only has so much ime and money,  and ge ing help wi h de e mining he bes a eas o spend ha ime and money can be a aluable hing. \nSo o anyone doing esea ch, especially hei own pe sonal esea ch, who is no weal hy and does no ha e 100 yea s le in hei li es, being skep ical abou one's esul s seems no only a necessi y, bu I don' hink any kind o p og ess, especially in a di icul a ea like he pa ano mal, is e en possible wi hou i .\n--- On F i, 4/23/10, JANDANACOSTA jandan108@...> w o e:\nF om: JANDANACOSTA\n jandan108@...>Subjec : Re: [EVP-ITC] nu said?To: EVP-ITC@yahoog oups.com\nDa e: F iday, Ap il 23, 2010, 8:34 PM\n\n\n\n\n\n \n\n\n\n \n \n \n I am con used abou wo issues. Fi s , Why he ang y emails?  I don' hink I ha e seen his be o e wi h his g oup. Also, I don' ge why anyone who is a skep ic would belong o his g oup.? I mean no dis espec , jus cu ious.\n--- On F i, 4/23/10, Lizzie B oden w o e:F om: Lizzie B oden Subjec : Re: [EVP-ITC] nu said?\nTo: EVP-ITC@yahoog oups .comDa e: F iday, Ap il 23, 2010, 8:09 PM\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n \n\n\n\n \n \n \n \nYou a e e e bi as bad as Randi o any o hem!  You a e jus he lip-side o he coin!\n \nYou misuse o he wo d, \"Skep ic\" has aken on a o ally new meaning.  You see anyone ha has a p oblem wi h you hal baked ideas, and insani y, yeah I said i , as a \"Skep ic.\"\n \nMaybe i would do you some good o esea ch he wo d and idea behind i be o e you go o hal cocked as you a e.  The wo ld is no ou o ge you o you damned box!  I he e is any u h o i , he le 's see he e idence o i .  Le s look a i o wha i is, NOT WHAT YOU OR ANYONE WANTS IT TO BE!\n\n \nWha i is, no mo e and no less!\n \nI am a Skep ic, i he ue sense o he wo d.  And I ha e been holding my ongue hoping you would pull ou o his c ap.  F ank, ge a g ip!\n \nNo e e yone ha disag ees wi h you is ou o ge you!  I ha e eal p oblems wi h he whole heo y, bu I ha e ne e ques ioned you hea o  in eg i y o e i .  (Well, o he han le ing Moon play he dance he is playing wi h YOUR BOX!)\n\n \nBu , le s analy ically look a his o wha i is and ind  he u h o i ?  I you wan o u n i in o a eligion ha is on op o some moun ain, so be i !  Bu o he people a e no going o see he subjec in black and whi e s anda ds.\n\n \nGi e i a es and hinks abou i .  The wo ld is no ou o ge you F ank!\n \"Na u e is showing us only he ail o he lion, bu I ha e no doub ha he lion belongs o i e en hough, because o i s la ge size, i canno o ally e eal i sel all a once.\" -— Albe Eins ein \n\n\"I is a be e o g asp he uni e se as i eally is han o pe sis in delusions, howe e sa is ying and eassu ing.\"--Ca l Sagan\n\"The e is no such hing as an insigni ican de ail. Don' jus look o wha you wan o ind.\"-- Me LOL \n\n\n\n\nF om: F ank Sump ion gmail.com>To: EVP-ITC@yahoog oups .com\nSen : F i, Ap il 23, 2010 7:29:14 PMSubjec : Re: [EVP-ITC] nu said?  \n\n\n I know wha i is, e en hough I can' e en spell i o p onounce i . I 's wha he skep ics and debunke s ou as he answe o all pa ano mal expe ience. I hink we ough o pull ou claws back in, especially me!\n\n \n I ha e go en \" oices\" ha I hough we e pe ec ly clea , and no one else could hea i , and some I ound was jus  a snippe o music, so yeah, ha happens, bu i does no elimina e o explain e e y hing om he boxes, and o he EVP me hods, you  jus ha e o be awa e o he possibili y. Ano he p oblem is b oadcas agmen s, some imes hey a e jus wha hey sound like, an ad o one hing o ano he , some imes hey can ha e sych onis ic meaning, and some imes hey can be al e ed in some way o o m a messages, such as he ecen one I had abou lea ning sex, which was seemingly igno ed by all cuz i has he \"s\" wo d--I guess. The agmen s can also be dis o ed as he adio uning is swep ac oss a s a ion, I don' accep e e y wo d and syllable as meaning some hing. You ha e io judge mnessage by con en and pe sonal meaning. \n\n \n I ha e seen aces s and up in a ca pe igh in on o me, no some hing I jus happened ac oss, some hing ha happened li e as I wa ched. Fo someone o sugges ha 's imagina ion I ind e y o ensi e.  \n\n \n When I i s swi ched o a linea sweep in he boxes, I could hea no hing bu gibbe ish, hen suddenly I could hea \" hem\" speaking. I doub ha is all imagina ion ei he , I hink he mind(which is no b ain) has o ep og am he ea s, which a e b ain, o hea .  I also hink he skep ics can no allow his p og amming o ake place, hence hey can' hea . I would be e y su p ised i any o he ha d co e skep ics e en u ned on a box o ea ha hey may hea some hing ha 's no he e. Ro ke( he Phd) implied as much when he wan ed a box o es , o mo e like debunk. Tha c ap is ikkin' pa he ic!\n\n \n \n \n \nF-S\n \n \nOn F i, Ap 23, 2010 a 4:30 PM, Ap il Abe c ombie ap il@abe c ombiegh os esea ch. com> w o e:\n\n  \n\n\n\nPa eidolia is no psuedo science. I is an ac ual, p o en, na u al unc ioning o he b ain.h p://en.wikipedia .o g/wiki/ Pa eidolia\nPlease ead his a icle, and mo e, i you ha e any ques ions abou i being psuedo science. I chose he Wikipedia e sion because I hough i would be he leas o ensi e o you. O he a icles speci ically called ou EVP and o he hings.\nFo he eco d, I don' hink all EVP's a e due o pa eidolia. \n\nOn F i, Ap 23, 2010 a 3:47 PM, F ank Sump ion pu plealiengi l@ gmail.com> w o e:\n\n  \n\n\n\n\n I was implied ha all his s u is \"Pa eidolia\" , and because you could pu a name on i ha somehow mean i was all explanined. I' e been hea ing his pseudo scien i ic BS o 10 yea s, so I'm a bi ouchy. Science explains he pa ano mal away, and ye people con inune o pho og aph images, and ge hei names, and he names o deseased lo ed ones h ough EVP, as well as ques ions answe ed, and science(al hogh no all scien is s) jus igno es hese incon inien ac s and ocuses on  ha we migh see hings ha a e no he e, which I disag ee wi h as well. \n\n \n Did you e en bo he looking a he image on he g oup home page. Tha was om sweeping a TV une wi h a andom ol age and ideo eco ding he moni o sc een. So explain away why he e is a wol image embedded in he guy's ha , an image o an alien below his ea , and why in God's name does he esembles he classic desc ip ion o an MIB o  Shadow Pe son?  Pa eidolia no doub !\n\n \n F-S\n\nOn F i, Ap 23, 2010 a 3:19 PM, Rj as e e @yahoo. com> w o e:\n\n  \n\n\n\n\n\n\n\nI'm no su e who you' e alking o abou \"holie han hou\".  Bu , you a e he one who keeps dismissing any ques ion abou esul s and es ing wi h ph ases like \"Bi e Me\". I don' see anyone else doing ha , and I ce ainly ne e ha e.\nI ag ee ying new hings is good.  And discussing esul s.  And looking o new di ec ions.   So I'm s ill no su e who you a e upse wi h.  Pe haps you could be mo e speci ic: quo e wha you ha e ound objec ionable, and le us know why?\n--- On F i, 4/23/10, F ank Sump ion pu plealiengi l@ gmail.com> w o e:\nF om: F ank Sump ion pu plealiengi l@ gmail.com>Subjec : [EVP-ITC] nu said?To: e p-i c@yahoog oups .com\nDa e: F iday, Ap il 23, 2010, 12:59 PM \n\n\n\n  \n\n\n\"Cong a ula ions! bulle babea has changed you membe ship s a us o heg oup EVP-ITC om Membe o Mode a o .\" \n \n Go ahead skepdo ks, make my day!  I don' mind some hones deba e, bu no his holie han hou science BS, whe e you hink cuz you s ick a label on some hing i can be dismissed as ho oughly debunked. Maybe--I'm easily o ended, and I'll ake ha in o accoun . \n\n \n F-S"}