{"id": "17082", "subject": "Re: I need help, please.", "author": "M.A.P.S.", "timestamp": "2010-04-27T01:19:00Z", "full_text": "We are located in southern missouri, and will travel...lol   Wow, and more wow&#39;s.... where are you located? Have you tried to not talk about &quot;it&quot; while you are in the house? That way you are not giving it attenion...\n\n--- In EVP-ITC@yahoogroups.com, AzureDamselfly &lt;azuredamselfly@...&gt; wrote:\n&gt;\n&gt; Hi!\n&gt;  \n&gt; It happens always at night and at different times during the day. Rain, shine, snow does not matter. Today the diningroom lights were turning off and on, we have new electrical and did all of those checks necessary. \n&gt;  \n&gt; The pattern recently is this: We go to bed . We may or may not see a dark shadow move in the bedroom. Within 10 minutes the banging begins. It sounded last night as if things were being thrown on the floor on my side of the bed. Nothing had fallen. Then it moves all around the room hitting the mirrorred door, the tv, the next wall, then Jay&#39;s bedside table and ends with the window above our heads. A full circle. We told it to go. It got quiet for 4 hours. Usually it just continues and gets louder. It also seems to like banging the door and all 4 walls of the closet. I have been sleeping with a fan on to drown it out and as a result it has gotten much louder. \n&gt;  \n&gt; HAha as I type this it is banging behind my head on the china cabinet. When I came downstairs early this a.m. it banged 3 walls, in succession, as loudly as it could not 2 feet behind me. It is now banging on the case of my PC, my monitor, the dinigroom table and the ceiling...brother, it never gives up.  It walks up and down the stairs, scars the bejeezuz outta our 14 yr old cat, bangs the front door, the porch ceiling and walks overhead in the attic over the 2nd floor bedroom. \n&gt;  \n&gt; We know the other spirits who reside with us, this one we don&#39;t. Oh yes, sometimes we get a very foul odor associated with it. ( heavy testosterone/ chicken soup/ dirty sweatsocks smells) Other times we smell heavy Old Spice over our faces in the bed.\n&gt;  \n&gt; It also seems to thrive on negativity. We work very hard to contain that in our home, the negativity I mean. If Jay & I have an argument it REALLY gets active. Makes us wonder if moving is the solution.\n&gt;  \n&gt; BTW, we have so many EVP&#39;s it isn&#39;t funny. One of my deceased son, Jay&#39;s Dad, and something very garbled. The one of my son is VERY clearly stating his name. THAT was the best! \n&gt;  \n&gt; Keep the ideas and suggestions coming, please! \n&gt;  \n&gt; Thanks much! \n&gt; Annie & Jay C.\n&gt;  \n&gt; I appreciate your response. Where is MAPS located?\n&gt;  \n&gt; \n&gt; \n&gt; Take every chance you get because some things only happen once...\n&gt; \n&gt; --- On Mon, 4/26/10, M.A.P.S. &lt;maps_paranormal2010@...&gt; wrote:\n&gt; \n&gt; \n&gt; From: M.A.P.S. &lt;maps_paranormal2010@...&gt;\n&gt; Subject: [EVP-ITC] Re: I need help, please.\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Monday, April 26, 2010, 11:41 AM\n&gt; \n&gt; \n&gt;   \n&gt; \n&gt; \n&gt; \n&gt; Hi annie,\n&gt; \n&gt; We just joined this group, and I would like to say that with your problem, pay close attenion to the times that this happens and the weather. you might have a residual huanting, if that is the case you wont get rid of it and it wont talk to you, because it wont know that you are there.. hope I am not repeating imformation. ..Have a great day\n&gt; \n&gt; --- In EVP-ITC@yahoogroups .com, &quot;Azure D&quot; &lt;azuredamselfly@ ...&gt; wrote:\n&gt; &gt;\n&gt; &gt; I am Annie. I have not written much but have visaully followed this group over the past year. I have much experience in the realm of the paranormal. \n&gt; &gt; \n&gt; &gt; Here is the issue. Our home has an inhabitant that we cannot seem to remove. It does not speak to us on the frank&#39;s box nor will it communicate through either me or my partner, Jay. We are both mediums. It slams and bangs in the house almost ceaselessly at night. It hits the walls, windows, the tv, the bedside tables and the doors. I am at a loss as to how to otherwise communicate because as I said with the 2 boxes we have, it won&#39;t speak.\n&gt; &gt; \n&gt; &gt; I am open to any and all suggestions. We have told it to go, tried many different suggested rituals and to no avail. It will go quiet for a day to three days after ritual work but begins again, only louder.\n&gt; &gt; \n&gt; &gt; Please, if anyone can help or direct us to someone who can I would be most grateful.\n&gt; &gt; \n&gt; &gt; Sincerely,\n&gt; &gt; Annie & Jay C.\n&gt; &gt;\n&gt;"}