{"id": "17084", "subject": "Re: [EVP-ITC] Re: I need help, please.", "author": "AzureDamselfly", "timestamp": "2010-04-27T13:58:06Z", "full_text": "--0-1039843672-1272376686=:72106\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nThank you Barb and Tim.\n=C2=A0\nTim, We will follow your suggestions. We hav=\r\ne done this in the past with the exception of fresh sage and blessed by ano=\r\nther salt. I have also hung lavender, mugwart, salt and rosemary on the doo=\r\nrs. Have a blessed day!\n=C2=A0\nAnnie\n\nTake every chance you get because som=\r\ne things only happen once...\n\n--- On Tue, 4/27/10, hypnobarb &lt;hypnobarb@yah=\r\noo.com&gt; wrote:\n\n\nFrom: hypnobarb &lt;hypnobarb@...&gt;\nSubject: [EVP-ITC] R=\r\ne: I need help, please.\nTo: EVP-ITC@yahoogroups.com\nDate: Tuesday, April 27=\r\n, 2010, 9:54 AM\n\n\n=C2=A0 \n\n\n\nTim,\n\nThis is one of the most coherent descrip=\r\ntions of how to do a cleansing I have ever read. Well done!\n\nBarb\n\n--- In E=\r\nVP-ITC@yahoogroups .com, &quot;Tim&quot; &lt;tjwoolwo@.. .&gt; wrote:\n&gt;\n&gt; \n&gt; Annie / Jay,\n&gt;=\r\n \n&gt; I am sorry to hear that you have to go through this. \n&gt; \n&gt; How long aft=\r\ner you moved into this place did the events in question begin occurring? Di=\r\nd they begin after a traumatic event? Or after a previously used object was=\r\n brought in to the house? Have you dabbled with opening portals via ritual =\r\nor device recently? Have you asked anything to manifest itself to you?\n&gt; \n&gt;=\r\n What it sounds like you have is an intelligent entity that is responding t=\r\no you. The more sound it makes, the more you notice it. Someone is trying t=\r\no get your attention, and it does not appear to be negative by the way you =\r\ndescribe it (no one is getting hurt, things are not breaking).\n&gt; \n&gt; So ther=\r\nefore, the question is why are they trying to get your attention? My first =\r\nguess is that because you have intimated that you ad your partners are sens=\r\nitives; this may be why this being is drawn to you. It may feel that you ca=\r\nn understand it better than most and therefore help it.\n&gt; \n&gt; You have menti=\r\noned that you have done rituals. I am assuming that one of those rituals is=\r\n a cleansing. A cleansing typically works with an intelligent entity if it =\r\nis done properly. In cases like this, the most important thing to know is t=\r\nhat you can never tell an entity to leave. If it is intelligent, it will le=\r\nave on its own accord. \n&gt; \n&gt; In my experience, I have found that most of th=\r\ne time, the entity is &quot;stuck&quot; here. They passed on, but missed the light. F=\r\nrom EVP&#39;s and Box sessions, I have found that most of these entities stuck =\r\nare afraid of eternal judgement so they avoided the light. This creates a w=\r\norld for them which grows more and more hopeless as time passes on, a sort =\r\nof &quot;limbo&quot; if you will. The more hopeless they get, the more angrier they b=\r\necome.\n&gt; \n&gt; If you do a cleansing properly, the entity should be able to le=\r\nave:\n&gt; \n&gt; 1). Open all your windows and doors.\n&gt; 2). Use only a fresh sage =\r\nsmudge stick (pick it yourself or buy them from a farmer on eBay). When bur=\r\nning sage, carry a metal bowl around to catch the ash and a grill lighter (=\r\nfresh sage wants to go out a lot at first, try to keep it lit before it bur=\r\nns out). If you set the sage on glass, it will break from the heat and plas=\r\ntic will melt.\n&gt; 3). Buy a blessed salt mixture from your local esoteric sh=\r\nop. If you don&#39;t have one nearby, send me an email and I&#39;ll ship you a bag.=\r\n\n&gt; 4). Protect yourself and focus in on the energy of the house. If you are=\r\n sensitive you should be able to tell if it is male or female and that is a=\r\n great start. \n&gt; 5). Begin in the basement of the house and proceed through=\r\n every\n&gt; room of the house while leaving the most active room of the house =\r\nfor last. Before you leave each room, sprinkle the salt at the opening of a=\r\nny window or door to bind it.\n&gt; 6). Most importantly, take your house back =\r\nbut be nice. Address the entity directly compassionately and begin a one si=\r\nded conversation with it. Tell him or her that it needs to cross over, that=\r\n there is nothing but peace on the other side, that friends and loved ones =\r\nare waiting, and that there is nothing to fear and to not be afraid. It is =\r\na place of no judgement but of pure understanding and love, and that it is =\r\nthe natural progression of life and there physical time on earth is done fo=\r\nr now. Let it know that the house is no longer there&#39;s and that you do not =\r\ndesire it&#39;s presence in you life any longer. This is very important: invite=\r\n it to let your spirit guides show it the way to the light. Let it know tha=\r\nt once it crosses over, it can come back to check on loved ones, but it nee=\r\nds to cross over first to learn the way. Keep saying these things politely =\r\nand confidently.\n&gt; 7). Chances are when you reach the last room, your entit=\r\ny will have holed itself in there and this is where you need to be at your =\r\nstrongest and most confident. If you feel it in there with you, have a hear=\r\nt to heart with it and say these things. Tell it how it is disrupting your =\r\nfamily and all the things about crossing over. Also be clear about whether =\r\nor not you will allow it to come back and visit you after it has crossed; i=\r\nf you feel good about the process I would invite it back if it will be peac=\r\neful (this makes you seem less forceful).\n&gt; \n&gt; You should feel an energy li=\r\nft if it happens. Let your house air out and then say a binding prayer befo=\r\nre closing each window and door. do not snuff out the sage, bring it outsid=\r\ne and let it burn its way out. Some people recommend binding the perimeter =\r\nof the house with salt but this should not be necessary.\n&gt; \n&gt; I have done t=\r\nhis many times and it works most of the time. \n&gt; \n&gt; Good luck, \n&gt; TJ\n&gt; \n&gt; \n=\r\n\n\n\n\n\n\n\r\n--0-1039843672-1272376686=:72106\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;DIV&gt;Thank you Barb and Tim.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp=\r\n;&lt;/DIV&gt;\n&lt;DIV&gt;Tim, We will follow your suggestions. We have done this in the=\r\n past with the exception of fresh sage and blessed by another salt. I have =\r\nalso hung lavender, mugwart, salt and rosemary on the doors. Have a blessed=\r\n day!&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Annie&lt;BR&gt;&lt;BR&gt;&lt;FONT face=3D&quot;comic sans ms=\r\n&quot; color=3D#a040ff size=3D3&gt;Take every chance you get because some things on=\r\nly happen once...&lt;/FONT&gt;&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Tue, 4/27/10, hypnobarb &lt;I&gt;&lt;hy=\r\npnobarb@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;&lt;/DIV&gt;\n&lt;BLOCKQUOTE style=3D&quot;PADDING=\r\n-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: rgb(16,16,255) 2px solid&quot;&gt;&lt;BR&gt;Fr=\r\nom: hypnobarb &lt;hypnobarb@...&gt;&lt;BR&gt;Subject: [EVP-ITC] Re: I need =\r\nhelp, please.&lt;BR&gt;To: EVP-ITC@yahoogroups.com&lt;BR&gt;Date: Tuesday, April 27, 20=\r\n10, 9:54 AM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3Dyiv1685876021&gt;&lt;SPAN style=3D&quot;DISPLAY: none&quot;&gt;&=\r\nnbsp;&lt;/SPAN&gt; \n&lt;DIV id=3Dygrp-text&gt;\n&lt;DIV&gt;Tim,&lt;BR&gt;&lt;BR&gt;This is one of the most=\r\n coherent descriptions of how to do a cleansing I have ever read. Well done=\r\n!&lt;BR&gt;&lt;BR&gt;Barb&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=3D&quot;http://us.mc841.mail.yahoo.com/mc/co=\r\nmpose?to=3DEVP-ITC%40yahoogroups.com&quot; target=3D_blank rel=3Dnofollow ymailt=\r\no=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups .com&lt;/A&gt;, &quot;Tim&quot; =\r\n&lt;tjwoolwo@.. .&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; &lt;BR&gt;&gt; Annie / Jay,&lt;BR&gt;&gt; =\r\n&lt;BR&gt;&gt; I am sorry to hear that you have to go through this. &lt;BR&gt;&gt; &lt;BR&gt;=\r\n&gt; How long after you moved into this place did the events in question be=\r\ngin occurring? Did they begin after a traumatic event? Or after a previousl=\r\ny used object was brought in to the house? Have you dabbled with opening po=\r\nrtals via ritual or device recently? Have you asked anything to manifest it=\r\nself to you?&lt;BR&gt;&gt; &lt;BR&gt;&gt; What it sounds like you have is an intelligen=\r\nt entity that is responding to you. The more sound it makes, the more you n=\r\notice it. Someone is trying to get\n your attention, and it does not appear =\r\nto be negative by the way you describe it (no one is getting hurt, things a=\r\nre not breaking).&lt;BR&gt;&gt; &lt;BR&gt;&gt; So therefore, the question is why are th=\r\ney trying to get your attention? My first guess is that because you have in=\r\ntimated that you ad your partners are sensitives; this may be why this bein=\r\ng is drawn to you. It may feel that you can understand it better than most =\r\nand therefore help it.&lt;BR&gt;&gt; &lt;BR&gt;&gt; You have mentioned that you have do=\r\nne rituals. I am assuming that one of those rituals is a cleansing. A clean=\r\nsing typically works with an intelligent entity if it is done properly. In =\r\ncases like this, the most important thing to know is that you can never tel=\r\nl an entity to leave. If it is intelligent, it will leave on its own accord=\r\n. &lt;BR&gt;&gt; &lt;BR&gt;&gt; In my experience, I have found that most of the time, t=\r\nhe entity is &quot;stuck&quot; here. They passed on, but missed the light. From EVP&#39;s=\r\n and Box sessions, I have\n found that most of these entities stuck are afra=\r\nid of eternal judgement so they avoided the light. This creates a world for=\r\n them which grows more and more hopeless as time passes on, a sort of &quot;limb=\r\no&quot; if you will. The more hopeless they get, the more angrier they become.&lt;B=\r\nR&gt;&gt; &lt;BR&gt;&gt; If you do a cleansing properly, the entity should be able t=\r\no leave:&lt;BR&gt;&gt; &lt;BR&gt;&gt; 1). Open all your windows and doors.&lt;BR&gt;&gt; 2). =\r\nUse only a fresh sage smudge stick (pick it yourself or buy them from a far=\r\nmer on eBay). When burning sage, carry a metal bowl around to catch the ash=\r\n and a grill lighter (fresh sage wants to go out a lot at first, try to kee=\r\np it lit before it burns out). If you set the sage on glass, it will break =\r\nfrom the heat and plastic will melt.&lt;BR&gt;&gt; 3). Buy a blessed salt mixture=\r\n from your local esoteric shop. If you don&#39;t have one nearby, send me an em=\r\nail and I&#39;ll ship you a bag.&lt;BR&gt;&gt; 4). Protect yourself and focus in on t=\r\nhe energy of the\n house. If you are sensitive you should be able to tell if=\r\n it is male or female and that is a great start. &lt;BR&gt;&gt; 5). Begin in the =\r\nbasement of the house and proceed through every&lt;BR&gt;&gt; room of the house w=\r\nhile leaving the most active room of the house for last. Before you leave e=\r\nach room, sprinkle the salt at the opening of any window or door to bind it=\r\n.&lt;BR&gt;&gt; 6). Most importantly, take your house back but be nice. Address t=\r\nhe entity directly compassionately and begin a one sided conversation with =\r\nit. Tell him or her that it needs to cross over, that there is nothing but =\r\npeace on the other side, that friends and loved ones are waiting, and that =\r\nthere is nothing to fear and to not be afraid. It is a place of no judgemen=\r\nt but of pure understanding and love, and that it is the natural progressio=\r\nn of life and there physical time on earth is done for now. Let it know tha=\r\nt the house is no longer there&#39;s and that you do not desire it&#39;s presence i=\r\nn you life\n any longer. This is very important: invite it to let your spiri=\r\nt guides show it the way to the light. Let it know that once it crosses ove=\r\nr, it can come back to check on loved ones, but it needs to cross over firs=\r\nt to learn the way. Keep saying these things politely and confidently.&lt;BR&gt;&=\r\ngt; 7). Chances are when you reach the last room, your entity will have hol=\r\ned itself in there and this is where you need to be at your strongest and m=\r\nost confident. If you feel it in there with you, have a heart to heart with=\r\n it and say these things. Tell it how it is disrupting your family and all =\r\nthe things about crossing over. Also be clear about whether or not you will=\r\n allow it to come back and visit you after it has crossed; if you feel good=\r\n about the process I would invite it back if it will be peaceful (this make=\r\ns you seem less forceful).&lt;BR&gt;&gt; &lt;BR&gt;&gt; You should feel an energy lift =\r\nif it happens. Let your house air out and then say a binding prayer before\n=\r\n closing each window and door. do not snuff out the sage, bring it outside =\r\nand let it burn its way out. Some people recommend binding the perimeter of=\r\n the house with salt but this should not be necessary.&lt;BR&gt;&gt; &lt;BR&gt;&gt; I h=\r\nave done this many times and it works most of the time. &lt;BR&gt;&gt; &lt;BR&gt;&gt; G=\r\nood luck, &lt;BR&gt;&gt; TJ&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUO=\r\nTE&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;\r\n--0-1039843672-1272376686=:72106--"}