{"id": "17080", "subject": "Re: [EVP-ITC] Re: I need help, please.", "author": "AzureDamselfly", "timestamp": "2010-04-26T18:51:14Z", "full_text": "--0-1859872551-1272307874=:8399\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nHi!\n=C2=A0\nIt happens always at night and at different times during the day=\r\n. Rain, shine, snow does not matter. Today the diningroom lights were turni=\r\nng off and on, we have new electrical and did all of those checks necessary=\r\n. \n=C2=A0\nThe pattern recently is this: We go to bed . We may or may not se=\r\ne a dark shadow move in the bedroom. Within 10 minutes the banging begins. =\r\nIt sounded last night as if things were being thrown on the floor on my sid=\r\ne of the bed. Nothing had fallen. Then it moves all around the room hitting=\r\n the mirrorred door, the tv, the next wall, then Jay&#39;s bedside table and en=\r\nds with the window above our heads. A full circle. We told it to go. It got=\r\n quiet for 4 hours. Usually it just continues and gets louder. It also seem=\r\ns to like banging the door and all 4 walls of the closet. I have been sleep=\r\ning with a fan on to drown it out and as a result it has gotten much louder=\r\n. \n=C2=A0\nHAha as I type this it is banging behind my head on the china cab=\r\ninet. When I came downstairs early this a.m. it banged 3 walls, in successi=\r\non, as loudly as it could not 2 feet behind me. It is now banging on the ca=\r\nse of my PC, my monitor, the dinigroom table and the ceiling...brother, it =\r\nnever gives up.=C2=A0 It walks up and down the stairs, scars the bejeezuz o=\r\nutta our 14 yr old cat, bangs the front door, the porch ceiling and walks o=\r\nverhead in the attic over the 2nd floor bedroom. \n=C2=A0\nWe know the other =\r\nspirits who reside with us, this one we don&#39;t. Oh yes, sometimes we get a v=\r\nery foul odor associated with it. ( heavy testosterone/ chicken soup/ dirty=\r\n sweatsocks smells) Other times we smell heavy Old Spice over our faces in =\r\nthe bed.\n=C2=A0\nIt also seems to thrive on negativity. We work very hard to=\r\n contain that in our home, the negativity I mean. If Jay & I have an argume=\r\nnt it REALLY gets active. Makes us wonder if moving is the solution.\n=C2=A0=\r\n\nBTW, we have so many EVP&#39;s it isn&#39;t funny. One of my deceased son, Jay&#39;s D=\r\nad, and something very garbled. The one of my son is VERY clearly stating h=\r\nis name. THAT was the best! \n=C2=A0\nKeep the ideas and suggestions coming, =\r\nplease! \n=C2=A0\nThanks much! \nAnnie & Jay C.\n=C2=A0\nI appreciate your respo=\r\nnse. Where is MAPS located?\n=C2=A0\n\n\nTake every chance you get because some=\r\n things only happen once...\n\n--- On Mon, 4/26/10, M.A.P.S. &lt;maps_paranormal=\r\n2010@...&gt; wrote:\n\n\nFrom: M.A.P.S. &lt;maps_paranormal2010@...&gt;\nSub=\r\nject: [EVP-ITC] Re: I need help, please.\nTo: EVP-ITC@yahoogroups.com\nDate: =\r\nMonday, April 26, 2010, 11:41 AM\n\n\n=C2=A0 \n\n\n\nHi annie,\n\nWe just joined thi=\r\ns group, and I would like to say that with your problem, pay close attenion=\r\n to the times that this happens and the weather. you might have a residual =\r\nhuanting, if that is the case you wont get rid of it and it wont talk to yo=\r\nu, because it wont know that you are there.. hope I am not repeating imform=\r\nation. ..Have a great day\n\n--- In EVP-ITC@yahoogroups .com, &quot;Azure D&quot; &lt;azur=\r\nedamselfly@ ...&gt; wrote:\n&gt;\n&gt; I am Annie. I have not written much but have vi=\r\nsaully followed this group over the past year. I have much experience in th=\r\ne realm of the paranormal. \n&gt; \n&gt; Here is the issue. Our home has an inhabit=\r\nant that we cannot seem to remove. It does not speak to us on the frank&#39;s b=\r\nox nor will it communicate through either me or my partner, Jay. We are bot=\r\nh mediums. It slams and bangs in the house almost ceaselessly at night. It =\r\nhits the walls, windows, the tv, the bedside tables and the doors. I am at =\r\na loss as to how to otherwise communicate because as I said with the 2 boxe=\r\ns we have, it won&#39;t speak.\n&gt; \n&gt; I am open to any and all suggestions. We ha=\r\nve told it to go, tried many different suggested rituals and to no avail. I=\r\nt will go quiet for a day to three days after ritual work but begins again,=\r\n only louder.\n&gt; \n&gt; Please, if anyone can help or direct us to someone who c=\r\nan I would be most grateful.\n&gt; \n&gt; Sincerely,\n&gt; Annie & Jay C.\n&gt;\n\n\n\n\n\n\n\r\n--0-1859872551-1272307874=:8399\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;DIV&gt;Hi!&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;It happ=\r\nens always at night and at different times during the day. Rain, shine, sno=\r\nw does not matter. Today the diningroom lights were turning off and on, we =\r\nhave new electrical and did all of those checks necessary. &lt;/DIV&gt;\n&lt;DIV&gt;&nbs=\r\np;&lt;/DIV&gt;\n&lt;DIV&gt;The pattern recently is this: We go to bed . We may or may no=\r\nt see a dark shadow move in the bedroom. Within 10 minutes the banging begi=\r\nns. It sounded last night as if things were being thrown on the floor on my=\r\n side of the bed. Nothing had fallen. Then it moves all around the room hit=\r\nting the mirrorred door, the tv, the next wall, then Jay&#39;s bedside table an=\r\nd ends with the window above our heads. A full circle. We told it to go. It=\r\n got quiet for 4 hours. Usually it just continues and gets louder. It also =\r\nseems to like banging the door and all 4 walls of the closet. I have been s=\r\nleeping with a fan on to drown it out and as a result it has gotten much lo=\r\nuder. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;HAha as I type this it is banging behin=\r\nd my head on the china cabinet. When I came downstairs early this a.m. it b=\r\nanged 3 walls, in succession, as loudly as it could not 2 feet behind me. I=\r\nt is now banging on the case of my PC, my monitor, the dinigroom table and =\r\nthe ceiling...brother, it never gives up.&nbsp; It walks up and down the st=\r\nairs, scars the bejeezuz outta our 14 yr old cat, bangs the front door, the=\r\n porch ceiling and walks overhead in the attic over the 2nd floor bedroom. =\r\n&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;We know the other spirits who reside with us,=\r\n this one we don&#39;t. Oh yes, sometimes we get a very foul odor associated wi=\r\nth it. ( heavy testosterone/ chicken soup/ dirty sweatsocks smells) Other t=\r\nimes we smell heavy Old Spice over our faces in the bed.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;=\r\n/DIV&gt;\n&lt;DIV&gt;It also seems to thrive on negativity. We work very hard to cont=\r\nain that in our home, the negativity I mean. If Jay &amp; I have an argumen=\r\nt it REALLY gets active. Makes us wonder if moving is the solution.&lt;/DIV&gt;\n&lt;=\r\nDIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;BTW, we have so many EVP&#39;s it isn&#39;t funny. One of my =\r\ndeceased son, Jay&#39;s Dad, and something very garbled. The one of my son is V=\r\nERY clearly stating his name. THAT was the best! &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;=\r\nDIV&gt;Keep the ideas and suggestions coming, please! &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;=\r\n\n&lt;DIV&gt;Thanks much! &lt;/DIV&gt;\n&lt;DIV&gt;Annie &amp; Jay C.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;=\r\nDIV&gt;I appreciate your response. Where is MAPS located?&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/D=\r\nIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;BR&gt;&lt;FONT face=3D&quot;comic sans ms&quot; color=3D#a040ff size=3D3&gt;Take=\r\n every chance you get because some things only happen once...&lt;/FONT&gt;&lt;BR&gt;&lt;BR=\r\n&gt;--- On &lt;B&gt;Mon, 4/26/10, M.A.P.S. &lt;I&gt;&lt;maps_paranormal2010@...&gt;&lt;=\r\n/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;&lt;/DIV&gt;\n&lt;BLOCKQUOTE style=3D&quot;PADDING-LEFT: 5px; MARGIN-LEF=\r\nT: 5px; BORDER-LEFT: rgb(16,16,255) 2px solid&quot;&gt;&lt;BR&gt;From: M.A.P.S. &lt;maps_=\r\nparanormal2010@...&gt;&lt;BR&gt;Subject: [EVP-ITC] Re: I need help, please.=\r\n&lt;BR&gt;To: EVP-ITC@yahoogroups.com&lt;BR&gt;Date: Monday, April 26, 2010, 11:41 AM&lt;B=\r\nR&gt;&lt;BR&gt;\n&lt;DIV id=3Dyiv1156486272&gt;&lt;SPAN style=3D&quot;DISPLAY: none&quot;&gt;&nbsp;&lt;/SPAN&gt; =\r\n\n&lt;DIV id=3Dygrp-text&gt;\n&lt;DIV&gt;Hi annie,&lt;BR&gt;&lt;BR&gt;We just joined this group, and =\r\nI would like to say that with your problem, pay close attenion to the times=\r\n that this happens and the weather. you might have a residual huanting, if =\r\nthat is the case you wont get rid of it and it wont talk to you, because it=\r\n wont know that you are there.. hope I am not repeating imformation. ..Have=\r\n a great day&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=3D&quot;http://us.mc841.mail.yahoo.com/mc/com=\r\npose?to=3DEVP-ITC%40yahoogroups.com&quot; target=3D_blank rel=3Dnofollow ymailto=\r\n=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups .com&lt;/A&gt;, &quot;Azure =\r\nD&quot; &lt;azuredamselfly@ ...&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; I am Annie. I have no=\r\nt written much but have visaully followed this group over the past year. I =\r\nhave much experience in the realm of the paranormal. &lt;BR&gt;&gt; &lt;BR&gt;&gt; Here=\r\n is the issue. Our home has an inhabitant that we cannot seem to remove. It=\r\n does not speak to us on the frank&#39;s box nor will it communicate through ei=\r\nther me or my partner,\n Jay. We are both mediums. It slams and bangs in the=\r\n house almost ceaselessly at night. It hits the walls, windows, the tv, the=\r\n bedside tables and the doors. I am at a loss as to how to otherwise commun=\r\nicate because as I said with the 2 boxes we have, it won&#39;t speak.&lt;BR&gt;&gt; &lt;=\r\nBR&gt;&gt; I am open to any and all suggestions. We have told it to go, tried =\r\nmany different suggested rituals and to no avail. It will go quiet for a da=\r\ny to three days after ritual work but begins again, only louder.&lt;BR&gt;&gt; &lt;B=\r\nR&gt;&gt; Please, if anyone can help or direct us to someone who can I would b=\r\ne most grateful.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Sincerely,&lt;BR&gt;&gt; Annie &amp; Jay C.&lt;BR&gt;=\r\n&gt;&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;\r\n--0-1859872551-1272307874=:8399--"}