{"id": "17085", "subject": "Re: [EVP-ITC] Re: I need help, please.", "author": "AzureDamselfly", "timestamp": "2010-04-27T13:47:34Z", "full_text": "--0-1797345795-1272376054=:39203\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nWe aren&#39;t very close to you.=C2=A0We had Tom Lynch come here from NH last y=\r\near in June. He did not get much in the way of solid proof. HOWEVER, he&#39;d h=\r\neard parts of what I have discussed here in this message, over the phone wi=\r\nth us. \n=C2=A0\nWe did get positive Mel meter,( EMF,) IR=C2=A0Thermometer an=\r\nd=C2=A0KII meter readings. We used an, danged if I can think of the name, i=\r\nt uses predictive voice and begins with an O. We used night cameras, EVP re=\r\ncorders, Frank&#39;s boxes, etc.\n=C2=A0\nI usually don&#39;t have trouble talking to=\r\n or removing spirits/ crossing them over. This is just so different than an=\r\nything else I&#39;ve experienced. We have done the only talking about &quot;it&quot; in t=\r\nhe car thing or away from home but it makes no difference.Maybe we are focu=\r\nsing on it too much lately. We aren&#39;t sleeping well. We are tired. We are a=\r\nggravated as a result and Jay works in a very high pressure job and needs t=\r\no be on top of things. \n=C2=A0\nSo far, it&#39;s quiet today.\n=C2=A0\n\nTake every=\r\n chance you get because some things only happen once...\n\n--- On Mon, 4/26/1=\r\n0, M.A.P.S. &lt;maps_paranormal2010@...&gt; wrote:\n\n\nFrom: M.A.P.S. &lt;maps_p=\r\naranormal2010@...&gt;\nSubject: [EVP-ITC] Re: I need help, please.\nTo: EV=\r\nP-ITC@yahoogroups.com\nDate: Monday, April 26, 2010, 9:19 PM\n\n\n=C2=A0 \n\n\n\nWe=\r\n are located in southern missouri, and will travel...lol Wow, and more wow&#39;=\r\ns.... where are you located? Have you tried to not talk about &quot;it&quot; while yo=\r\nu are in the house? That way you are not giving it attenion...\n\n--- In EVP-=\r\nITC@yahoogroups .com, AzureDamselfly &lt;azuredamselfly@ ...&gt; wrote:\n&gt;\n&gt; Hi!\n&gt;=\r\n =C3=82=C2=A0\n&gt; It happens always at night and at different times during th=\r\ne day. Rain, shine, snow does not matter. Today the diningroom lights were =\r\nturning off and on, we have new electrical and did all of those checks nece=\r\nssary. \n&gt; =C3=82=C2=A0\n&gt; The pattern recently is this: We go to bed . We ma=\r\ny or may not see a dark shadow move in the bedroom. Within 10 minutes the b=\r\nanging begins. It sounded last night as if things were being thrown on the =\r\nfloor on my side of the bed. Nothing had fallen. Then it moves all around t=\r\nhe room hitting the mirrorred door, the tv, the next wall, then Jay&#39;s bedsi=\r\nde table and ends with the window above our heads. A full circle. We told i=\r\nt to go. It got quiet for 4 hours. Usually it just continues and gets loude=\r\nr. It also seems to like banging the door and all 4 walls of the closet. I =\r\nhave been sleeping with a fan on to drown it out and as a result it has got=\r\nten much louder. \n&gt; =C3=82=C2=A0\n&gt; HAha as I type this it is banging behind=\r\n my head on the china cabinet. When I came downstairs early this a.m. it ba=\r\nnged 3 walls, in succession, as loudly as it could not 2 feet behind me. It=\r\n is now banging on the case of my PC, my monitor, the dinigroom table and t=\r\nhe ceiling...brother, it never gives up.=C3=82=C2=A0 It walks up and down t=\r\nhe stairs, scars the bejeezuz outta our 14 yr old cat, bangs the front door=\r\n, the porch ceiling and walks overhead in the attic over the 2nd floor bedr=\r\noom. \n&gt; =C3=82=C2=A0\n&gt; We know the other spirits who reside with us, this o=\r\nne we don&#39;t. Oh yes, sometimes we get a very foul odor associated with it. =\r\n( heavy testosterone/ chicken soup/ dirty sweatsocks smells) Other times we=\r\n smell heavy Old Spice over our faces in the bed.\n&gt; =C3=82=C2=A0\n&gt; It also =\r\nseems to thrive on negativity. We work very hard to contain that in our hom=\r\ne, the negativity I mean. If Jay & I have an argument it REALLY gets active=\r\n. Makes us wonder if moving is the solution.\n&gt; =C3=82=C2=A0\n&gt; BTW, we have =\r\nso many EVP&#39;s it isn&#39;t funny. One of my deceased son, Jay&#39;s Dad, and someth=\r\ning very garbled. The one of my son is VERY clearly stating his name. THAT =\r\nwas the best! \n&gt; =C3=82=C2=A0\n&gt; Keep the ideas and suggestions coming, plea=\r\nse! \n&gt; =C3=82=C2=A0\n&gt; Thanks much! \n&gt; Annie & Jay C.\n&gt; =C3=82=C2=A0\n&gt; I app=\r\nreciate your response. Where is MAPS located?\n&gt; =C3=82=C2=A0\n&gt; \n&gt; \n&gt; Take e=\r\nvery chance you get because some things only happen once...\n&gt; \n&gt; --- On Mon=\r\n, 4/26/10, M.A.P.S. &lt;maps_paranormal201 0@...&gt; wrote:\n&gt; \n&gt; \n&gt; From: M.A.P.S=\r\n. &lt;maps_paranormal201 0@...&gt;\n&gt; Subject: [EVP-ITC] Re: I need help, please.\n=\r\n&gt; To: EVP-ITC@yahoogroups .com\n&gt; Date: Monday, April 26, 2010, 11:41 AM\n&gt; \n=\r\n&gt; \n&gt; =C3=82=C2=A0 \n&gt; \n&gt; \n&gt; \n&gt; Hi annie,\n&gt; \n&gt; We just joined this group, and=\r\n I would like to say that with your problem, pay close attenion to the time=\r\ns that this happens and the weather. you might have a residual huanting, if=\r\n that is the case you wont get rid of it and it wont talk to you, because i=\r\nt wont know that you are there.. hope I am not repeating imformation. ..Hav=\r\ne a great day\n&gt; \n&gt; --- In EVP-ITC@yahoogroups .com, &quot;Azure D&quot; &lt;azuredamself=\r\nly@ ...&gt; wrote:\n&gt; &gt;\n&gt; &gt; I am Annie. I have not written much but have visaul=\r\nly followed this group over the past year. I have much experience in the re=\r\nalm of the paranormal. \n&gt; &gt; \n&gt; &gt; Here is the issue. Our home has an inhabit=\r\nant that we cannot seem to remove. It does not speak to us on the frank&#39;s b=\r\nox nor will it communicate through either me or my partner, Jay. We are bot=\r\nh mediums. It slams and bangs in the house almost ceaselessly at night. It =\r\nhits the walls, windows, the tv, the bedside tables and the doors. I am at =\r\na loss as to how to otherwise communicate because as I said with the 2 boxe=\r\ns we have, it won&#39;t speak.\n&gt; &gt; \n&gt; &gt; I am open to any and all suggestions. W=\r\ne have told it to go, tried many different suggested rituals and to no avai=\r\nl. It will go quiet for a day to three days after ritual work but begins ag=\r\nain, only louder.\n&gt; &gt; \n&gt; &gt; Please, if anyone can help or direct us to someo=\r\nne who can I would be most grateful.\n&gt; &gt; \n&gt; &gt; Sincerely,\n&gt; &gt; Annie & Jay C.=\r\n\n&gt; &gt;\n&gt;\n\n\n\n\n\n\n\r\n--0-1797345795-1272376054=:39203\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;DIV&gt;We aren&#39;t very close to you.&nbsp;We had=\r\n Tom Lynch come here from NH last year in June. He did not get much in the =\r\nway of solid proof. HOWEVER, he&#39;d heard parts of what I have discussed here=\r\n in this message, over the phone with us. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;We =\r\ndid get positive Mel meter,( EMF,) IR&nbsp;Thermometer and&nbsp;KII meter r=\r\neadings. We used an, danged if I can think of the name, it uses predictive =\r\nvoice and begins with an O. We used night cameras, EVP recorders, Frank&#39;s b=\r\noxes, etc.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I usually don&#39;t have trouble talkin=\r\ng to or removing spirits/ crossing them over. This is just so different tha=\r\nn anything else I&#39;ve experienced. We have done the only talking about &quot;it&quot; =\r\nin the car thing or away from home but it makes no difference.Maybe we are =\r\nfocusing on it too much lately. We aren&#39;t sleeping well. We are tired. We a=\r\nre aggravated as a result and Jay works in a very high pressure job and nee=\r\nds to be on top of things. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;So far, it&#39;s quiet=\r\n today.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;FONT face=3D&quot;comic sans ms&quot; color=\r\n=3D#a040ff size=3D3&gt;Take every chance you get because some things only happ=\r\nen once...&lt;/FONT&gt;&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Mon, 4/26/10, M.A.P.S. &lt;I&gt;&lt;maps_paran=\r\normal2010@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;&lt;/DIV&gt;\n&lt;BLOCKQUOTE style=3D&quot;PADDI=\r\nNG-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: rgb(16,16,255) 2px solid&quot;&gt;&lt;BR&gt;=\r\nFrom: M.A.P.S. &lt;maps_paranormal2010@...&gt;&lt;BR&gt;Subject: [EVP-ITC] =\r\nRe: I need help, please.&lt;BR&gt;To: EVP-ITC@yahoogroups.com&lt;BR&gt;Date: Monday, Ap=\r\nril 26, 2010, 9:19 PM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3Dyiv1368096215&gt;&lt;SPAN style=3D&quot;DISPLA=\r\nY: none&quot;&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV id=3Dygrp-text&gt;\n&lt;DIV&gt;We are located in souther=\r\nn missouri, and will travel...lol Wow, and more wow&#39;s.... where are you loc=\r\nated? Have you tried to not talk about &quot;it&quot; while you are in the house? Tha=\r\nt way you are not giving it attenion...&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=3D&quot;http://us.=\r\nmc841.mail.yahoo.com/mc/compose?to=3DEVP-ITC%40yahoogroups.com&quot; target=3D_b=\r\nlank rel=3Dnofollow ymailto=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@ya=\r\nhoogroups .com&lt;/A&gt;, AzureDamselfly &lt;azuredamselfly@ ...&gt; wrote:&lt;BR&gt;&g=\r\nt;&lt;BR&gt;&gt; Hi!&lt;BR&gt;&gt; =C3=82&nbsp;&lt;BR&gt;&gt; It happens always at night and =\r\nat different times during the day. Rain, shine, snow does not matter. Today=\r\n the diningroom lights were turning off and on, we have new electrical and =\r\ndid all of those checks necessary. &lt;BR&gt;&gt; =C3=82&nbsp;&lt;BR&gt;&gt; The patter=\r\nn recently is this: We go to bed . We may or may not see a dark shadow move=\r\n in the bedroom. Within 10 minutes the banging begins. It sounded last nigh=\r\nt as if things were being thrown on the floor on my side\n of the bed. Nothi=\r\nng had fallen. Then it moves all around the room hitting the mirrorred door=\r\n, the tv, the next wall, then Jay&#39;s bedside table and ends with the window =\r\nabove our heads. A full circle. We told it to go. It got quiet for 4 hours.=\r\n Usually it just continues and gets louder. It also seems to like banging t=\r\nhe door and all 4 walls of the closet. I have been sleeping with a fan on t=\r\no drown it out and as a result it has gotten much louder. &lt;BR&gt;&gt; =C3=82&n=\r\nbsp;&lt;BR&gt;&gt; HAha as I type this it is banging behind my head on the china =\r\ncabinet. When I came downstairs early this a.m. it banged 3 walls, in succe=\r\nssion, as loudly as it could not 2 feet behind me. It is now banging on the=\r\n case of my PC, my monitor, the dinigroom table and the ceiling...brother, =\r\nit never gives up.=C3=82&nbsp; It walks up and down the stairs, scars the b=\r\nejeezuz outta our 14 yr old cat, bangs the front door, the porch ceiling an=\r\nd walks overhead in the attic over the 2nd floor bedroom.\n &lt;BR&gt;&gt; =C3=82&=\r\nnbsp;&lt;BR&gt;&gt; We know the other spirits who reside with us, this one we don=\r\n&#39;t. Oh yes, sometimes we get a very foul odor associated with it. ( heavy t=\r\nestosterone/ chicken soup/ dirty sweatsocks smells) Other times we smell he=\r\navy Old Spice over our faces in the bed.&lt;BR&gt;&gt; =C3=82&nbsp;&lt;BR&gt;&gt; It al=\r\nso seems to thrive on negativity. We work very hard to contain that in our =\r\nhome, the negativity I mean. If Jay &amp; I have an argument it REALLY gets=\r\n active. Makes us wonder if moving is the solution.&lt;BR&gt;&gt; =C3=82&nbsp;&lt;BR=\r\n&gt;&gt; BTW, we have so many EVP&#39;s it isn&#39;t funny. One of my deceased son, Ja=\r\ny&#39;s Dad, and something very garbled. The one of my son is VERY clearly stat=\r\ning his name. THAT was the best! &lt;BR&gt;&gt; =C3=82&nbsp;&lt;BR&gt;&gt; Keep the ide=\r\nas and suggestions coming, please! &lt;BR&gt;&gt; =C3=82&nbsp;&lt;BR&gt;&gt; Thanks muc=\r\nh! &lt;BR&gt;&gt; Annie &amp; Jay C.&lt;BR&gt;&gt; =C3=82&nbsp;&lt;BR&gt;&gt; I appreciate yo=\r\nur response. Where is MAPS located?&lt;BR&gt;&gt; =C3=82&nbsp;&lt;BR&gt;&gt; &lt;BR&gt;&gt;\n =\r\n&lt;BR&gt;&gt; Take every chance you get because some things only happen once...&lt;=\r\nBR&gt;&gt; &lt;BR&gt;&gt; --- On Mon, 4/26/10, M.A.P.S. &lt;maps_paranormal201 0@...=\r\n&gt; wrote:&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; From: M.A.P.S. &lt;maps_paranormal201=\r\n 0@...&gt;&lt;BR&gt;&gt; Subject: [EVP-ITC] Re: I need help, please.&lt;BR&gt;&gt; To: =\r\n&lt;A href=3D&quot;http://us.mc841.mail.yahoo.com/mc/compose?to=3DEVP-ITC%40yahoogr=\r\noups.com&quot; target=3D_blank rel=3Dnofollow ymailto=3D&quot;mailto:EVP-ITC%40yahoog=\r\nroups.com&quot;&gt;EVP-ITC@yahoogroups .com&lt;/A&gt;&lt;BR&gt;&gt; Date: Monday, April 26, 201=\r\n0, 11:41 AM&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; =C3=82&nbsp; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&g=\r\nt; &lt;BR&gt;&gt; Hi annie,&lt;BR&gt;&gt; &lt;BR&gt;&gt; We just joined this group, and I wou=\r\nld like to say that with your problem, pay close attenion to the times that=\r\n this happens and the weather. you might have a residual huanting, if that =\r\nis the case you wont get rid of it and it wont talk to you, because it wont=\r\n know that you are there.. hope I am not repeating imformation. ..Have a gr=\r\neat\n day&lt;BR&gt;&gt; &lt;BR&gt;&gt; --- In EVP-ITC@yahoogroups .com, &quot;Azure D&quot; &lt;az=\r\nuredamselfly@ ...&gt; wrote:&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt; I am Annie. I have n=\r\not written much but have visaully followed this group over the past year. I=\r\n have much experience in the realm of the paranormal. &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt=\r\n; &gt; Here is the issue. Our home has an inhabitant that we cannot seem to=\r\n remove. It does not speak to us on the frank&#39;s box nor will it communicate=\r\n through either me or my partner, Jay. We are both mediums. It slams and ba=\r\nngs in the house almost ceaselessly at night. It hits the walls, windows, t=\r\nhe tv, the bedside tables and the doors. I am at a loss as to how to otherw=\r\nise communicate because as I said with the 2 boxes we have, it won&#39;t speak.=\r\n&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; I am open to any and all suggestions. We have t=\r\nold it to go, tried many different suggested rituals and to no avail. It wi=\r\nll go quiet for a day to three days after ritual work but begins again,\n on=\r\nly louder.&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; Please, if anyone can help or direct =\r\nus to someone who can I would be most grateful.&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; =\r\nSincerely,&lt;BR&gt;&gt; &gt; Annie &amp; Jay C.&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/DI=\r\nV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;\r\n--0-1797345795-1272376054=:39203--"}