{"id": "17081", "subject": "Re: I need help, please.", "author": "Tim", "timestamp": "2010-04-26T20:54:31Z", "full_text": "Annie / Jay,\n\nI am sorry to hear that you have to go through this.  \n\nHow long after you moved into this place did the events in question begin occurring?  Did they begin after a traumatic event?  Or after a previously used object was brought in to the house?  Have you dabbled with opening portals via ritual or device recently?  Have you asked anything to manifest itself to you?\n\nWhat it sounds like you have is an intelligent entity that is responding to you.  The more sound it makes, the more you notice it.  Someone is trying to get your attention, and it does not appear to be  negative by the way you describe it (no one is getting hurt, things are not breaking).\n\nSo therefore, the question is why are they trying to get your attention?  My first guess is that because you have intimated that you ad your partners are sensitives; this may be why this being is drawn to you.  It may feel that you can understand it better than most and therefore help it.\n\nYou have mentioned that you have done rituals.  I am assuming that one of those rituals is a cleansing.  A cleansing typically works with an intelligent entity if it is done properly.  In cases like this, the most important thing to know is that you can never tell an entity to leave.  If it is intelligent, it will leave on its own accord.  \n\nIn my experience, I have found that most of the time, the entity is &quot;stuck&quot; here.  They passed on, but missed the light.  From EVP&#39;s and Box sessions, I have found that most of these entities stuck are afraid of eternal judgement so they avoided the light.  This creates a world for them which grows more and more hopeless as time passes on, a sort of &quot;limbo&quot; if you will.  The more hopeless they get, the more angrier they become.\n\nIf you do a cleansing properly, the entity should be able to leave:\n\n1). Open all your windows and doors.\n2). Use only a fresh sage smudge stick (pick it yourself or buy them from a farmer on eBay).  When burning sage, carry a metal bowl around to catch the ash and a grill lighter (fresh sage wants to go out a lot at first, try to keep it lit before it burns out).  If you set the sage on glass, it will break from the heat and plastic will melt.\n3). Buy a blessed salt mixture from your local esoteric shop.  If you don&#39;t have one nearby, send me an email and I&#39;ll ship you a bag.\n4). Protect yourself and focus in on the energy of the house.  If you are sensitive you should be able to tell if it is male or female and that is a great start.  \n5). Begin in the basement of the house and proceed through every\nroom of the house while leaving the most active room of the house for last.  Before you leave each room, sprinkle the salt at the opening of any window or door to bind it.\n6).  Most importantly, take your house back but be nice.  Address the entity directly compassionately and begin a one sided conversation with it.  Tell him or her that it needs to cross over, that there is nothing but peace on the other side, that friends and loved ones are waiting, and that there is nothing to fear and to not be afraid.  It is a place of no judgement but of pure understanding and love, and that it is the natural progression of life and there physical time on earth is done for now.  Let it know that the house is no longer there&#39;s and that you do not desire it&#39;s presence in you life any longer.  This is very important: invite it to let your spirit guides show it the way to the light.  Let it know that once it crosses over, it can come back to check on loved ones, but it needs to cross over first to learn the way.  Keep saying these things politely and confidently.\n7).  Chances are when you reach the last room, your entity will have holed itself in there and this is where you need to be at your strongest and most confident.  If you feel it in there with you, have a heart to heart with it and say these things.  Tell it how it is disrupting your family and all the things about crossing over.  Also be clear about whether or not you will allow it to come back and visit you after it has crossed; if you feel good about the process I would invite it back if it will be peaceful (this makes you seem less forceful).\n\nYou should feel an energy lift if it happens.  Let your house air out and then say a binding prayer before closing each window and door.  do not snuff out the sage, bring it outside and let it burn its way out.  Some people recommend binding the perimeter of the house with salt but this should not be necessary.\n\nI have done this many times and it works most of the time.  \n\nGood luck, \nTJ\n\n--- In EVP-ITC@yahoogroups.com, AzureDamselfly &lt;azuredamselfly@...&gt; wrote:\n&gt;\n&gt; Hi!\n&gt;  \n&gt; It happens always at night and at different times during the day. Rain, shine, snow does not matter. Today the diningroom lights were turning off and on, we have new electrical and did all of those checks necessary. \n&gt;  \n&gt; The pattern recently is this: We go to bed . We may or may not see a dark shadow move in the bedroom. Within 10 minutes the banging begins. It sounded last night as if things were being thrown on the floor on my side of the bed. Nothing had fallen. Then it moves all around the room hitting the mirrorred door, the tv, the next wall, then Jay&#39;s bedside table and ends with the window above our heads. A full circle. We told it to go. It got quiet for 4 hours. Usually it just continues and gets louder. It also seems to like banging the door and all 4 walls of the closet. I have been sleeping with a fan on to drown it out and as a result it has gotten much louder. \n&gt;  \n&gt; HAha as I type this it is banging behind my head on the china cabinet. When I came downstairs early this a.m. it banged 3 walls, in succession, as loudly as it could not 2 feet behind me. It is now banging on the case of my PC, my monitor, the dinigroom table and the ceiling...brother, it never gives up.  It walks up and down the stairs, scars the bejeezuz outta our 14 yr old cat, bangs the front door, the porch ceiling and walks overhead in the attic over the 2nd floor bedroom. \n&gt;  \n&gt; We know the other spirits who reside with us, this one we don&#39;t. Oh yes, sometimes we get a very foul odor associated with it. ( heavy testosterone/ chicken soup/ dirty sweatsocks smells) Other times we smell heavy Old Spice over our faces in the bed.\n&gt;  \n&gt; It also seems to thrive on negativity. We work very hard to contain that in our home, the negativity I mean. If Jay & I have an argument it REALLY gets active. Makes us wonder if moving is the solution.\n&gt;  \n&gt; BTW, we have so many EVP&#39;s it isn&#39;t funny. One of my deceased son, Jay&#39;s Dad, and something very garbled. The one of my son is VERY clearly stating his name. THAT was the best! \n&gt;  \n&gt; Keep the ideas and suggestions coming, please! \n&gt;  \n&gt; Thanks much! \n&gt; Annie & Jay C.\n&gt;  \n&gt; I appreciate your response. Where is MAPS located?\n&gt;  \n&gt; \n&gt; \n&gt; Take every chance you get because some things only happen once...\n&gt; \n&gt; --- On Mon, 4/26/10, M.A.P.S. &lt;maps_paranormal2010@...&gt; wrote:\n&gt; \n&gt; \n&gt; From: M.A.P.S. &lt;maps_paranormal2010@...&gt;\n&gt; Subject: [EVP-ITC] Re: I need help, please.\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Monday, April 26, 2010, 11:41 AM\n&gt; \n&gt; \n&gt;   \n&gt; \n&gt; \n&gt; \n&gt; Hi annie,\n&gt; \n&gt; We just joined this group, and I would like to say that with your problem, pay close attenion to the times that this happens and the weather. you might have a residual huanting, if that is the case you wont get rid of it and it wont talk to you, because it wont know that you are there.. hope I am not repeating imformation. ..Have a great day\n&gt; \n&gt; --- In EVP-ITC@yahoogroups .com, &quot;Azure D&quot; &lt;azuredamselfly@ ...&gt; wrote:\n&gt; &gt;\n&gt; &gt; I am Annie. I have not written much but have visaully followed this group over the past year. I have much experience in the realm of the paranormal. \n&gt; &gt; \n&gt; &gt; Here is the issue. Our home has an inhabitant that we cannot seem to remove. It does not speak to us on the frank&#39;s box nor will it communicate through either me or my partner, Jay. We are both mediums. It slams and bangs in the house almost ceaselessly at night. It hits the walls, windows, the tv, the bedside tables and the doors. I am at a loss as to how to otherwise communicate because as I said with the 2 boxes we have, it won&#39;t speak.\n&gt; &gt; \n&gt; &gt; I am open to any and all suggestions. We have told it to go, tried many different suggested rituals and to no avail. It will go quiet for a day to three days after ritual work but begins again, only louder.\n&gt; &gt; \n&gt; &gt; Please, if anyone can help or direct us to someone who can I would be most grateful.\n&gt; &gt; \n&gt; &gt; Sincerely,\n&gt; &gt; Annie & Jay C.\n&gt; &gt;\n&gt;"}