{"id": "17101", "subject": "Re: [EVP-ITC] Next.", "author": "Frank Sumption", "timestamp": "2010-05-06T15:23:41Z", "full_text": "Thanks! Another video, AM manual sweep, at 3 seconds &quot;Princess-I come\nFriday--That&#39;s the date&quot;. All one needs is an easily tuned radio, manual\nworks as good as anything else.\n\n\n F-S\n\nOn Thu, May 6, 2010 at 9:15 AM, Chris Salois &lt;chrissalois@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;  Sounds good Frank. Nice job and thanks for posting. The video clips are a\n&gt; great bonus. I was able to hear the audio file clearly. :)\n&gt;\n&gt; Chris\n&gt;\n&gt;  ------------------------------\n&gt; *From:* Frank Sumption &lt;purplealiengirl@...&gt;\n&gt; *To:* evp-itc@yahoogroups.com\n&gt; *Sent:* Thu, May 6, 2010 10:57:01 AM\n&gt; *Subject:* [EVP-ITC] Next. [2 Attachments]\n&gt;\n&gt;\n&gt;\n&gt;  I have a frikkin&#39; obsession with this junk! I want to try mixing the white\n&gt; noise with the tuner audio, being able to disable the funcion via a panel\n&gt; switch. That is, given enough time! I always get these crackhead ETs, or\n&gt; what claims to be them giving these pick up dates. May 7th is another one of\n&gt; these.\n&gt;\n&gt;  This the tuner from a Timex T309T Clock Radio. Even in this, at one second\n&gt; &quot;girl-it&#39;s done...&quot;, and don&#39;t think for a nono second that I don&#39;t still\n&gt; feel embarrased at posting voices that call me a girl, even after all these\n&gt; years.\n&gt;\n&gt;\n&gt;  F-S\n&gt;\n&gt;\n&gt;  \n&gt;\n\nThanks! Ano he   ideo, AM manual sweep, a 3 seconds \"P incess-I come F iday--Tha 's he da e\". All one needs is an easily uned adio, manual wo ks as good as any hing else. \n \n \n F-S\nOn Thu, May 6, 2010 a 9:15 AM, Ch is Salois ch issalois@...> w o e:\n\n  \n\n\n\n\n\nSounds good F ank. Nice job and hanks o pos ing. The ideo clips a e a g ea bonus. I was able o hea he audio ile clea ly. :)\n \nCh is\n\n\n\nF om: F ank Sump ion pu plealiengi l@...>To: e p-i c@yahoog oups.com\nSen : Thu, May 6, 2010 10:57:01 AMSubjec : [EVP-ITC] Nex . [2 A achmen s]\n  \n\n\n I ha e a ikkin' obsession wi h his junk! I wan o y mixing he whi e noise wi h he une audio, being able o disable he uncion ia a panel swi ch. Tha is, gi en enough ime! I always ge hese c ackhead ETs, o wha claims o be hem gi ing hese pick up da es. May 7 h is ano he one o hese. \n\n \n This he une om a Timex T309T Clock Radio. E en in his, a one second \"gi l-i 's done...\", and don' hink o a nono second ha I don' s ill eel emba ased a pos ing oices ha call me a gi l, e en a e all hese yea s. \n\n \n \n F-S"}