{"id": "17122", "subject": "Re: [EVP-ITC] Re: [SDWR-SpeakingToTheDeadWithRadios-] Try, Try Again,", "author": "Frank Sumption", "timestamp": "2010-05-11T17:41:21Z", "full_text": "I checked out that group link and applied for membership. I hope it&#39;s not\nlike it sounds, a guy almost claiming he invented the concept. Even I don&#39;t\ndo that, I give originality to Stein, the Danish researcher that was\nexperimenting with swept radio back in the 80s. I&#39;ve never been able to\ncommunicate with him, but he&#39;s mentioned on the German VTF site, get to that\nvia Stefan Bion&#39;s EVPmaker links.\n\n F-S\n\nOn Sat, May 8, 2010 at 6:56 AM, Michael Ed &lt;f1cracker75@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;  Snowfire, I have not had any time to listen to them yet, as *I *have been\n&gt; working long hours again dropping to bed after dinner. I will listen to your\n&gt; files this weekend.\n&gt; **\n&gt; **\n&gt; **\n&gt; *Michael Edwards     ***\n&gt; http://tech.groups.yahoo.com/group/SDWR-SpeakingToTheDeadWithRadios-/\n&gt;\n&gt;\n&gt;\n&gt;  ------------------------------\n&gt; *From:* &quot;SnowfireL@...&quot; &lt;SnowfireL@...&gt;\n&gt; *To:* inside_the_box_rtsc_ghost_box_research@yahoogroups.com;\n&gt; EVP-ITC@yahoogroups.com; RTSC@yahoogroups.com; Seraph@yahoogroups.com;\n&gt; SDWR-SpeakingToTheDeadWithRadios-@yahoogroups.com\n&gt; *Sent:* Sat, May 8, 2010 8:24:06 AM\n&gt; *Subject:* [SDWR-SpeakingToTheDeadWithRadios-] Try, Try Again,\n&gt;\n&gt;\n&gt;\n&gt; Looks like I&#39;m going to try this again, maybe with me trying to change the\n&gt; wav to mp messed up the Edgar file, so no one heard it looks like, maybe,\n&gt; I&#39;m getting in the way or allowing my gift to interfere, also, it could have\n&gt; been subjective.  I&#39;ll try to get him to speak up, hopefully next time.  It\n&gt; was very fuzzy though, tons of static coming in with the voice of a man\n&gt; saying that name, even saying mine but, was not clearly defined. Sorry, but\n&gt; dat folks, will try this again. sf\n&gt;\n&gt;\n&gt;   \n&gt;\n\nI checked ou ha g oup link and applied o membe ship. I hope i 's no like i sounds, a guy almos claiming he in en ed he concep . E en I don' do ha , I gi e o iginali y o S ein, he Danish esea che ha was expe imen ing wi h swep adio back in he 80s. I' e ne e been able o communica e wi h him, bu he's men ioned on he Ge man VTF si e, ge o ha ia S e an Bion's EVPmake links. \n\n \n F-S\nOn Sa , May 8, 2010 a 6:56 AM, Michael Ed 1c acke 75@...> w o e:\n\n  \n\n\n\n\n\n\nSnow i e, I ha e no had any ime o lis en o hem ye , as I ha e been wo king long hou s again d opping o bed a e dinne . I will lis en o you iles his weekend.\n \n \n \nMichael Edwa ds      h p:// ech.g oups.yahoo.com/g oup/SDWR-SpeakingToTheDeadWi hRadios-/\n\n \n\n\n\n\nF om: \"Snow i eL@...\" Snow i eL@...>\nTo: inside_ he_box_ sc_ghos _box_ esea ch@yahoog oups.com; EVP-ITC@yahoog oups.com; RTSC@yahoog oups.com; Se aph@yahoog oups.com; SDWR-SpeakingToTheDeadWi hRadios-@yahoog oups.com\nSen : Sa , May 8, 2010 8:24:06 AMSubjec : [SDWR-SpeakingToTheDeadWi hRadios-] T y, T y Again,\n\n\n  \n\n\nLooks like I'm going o y his again, maybe wi h me ying o change he wa o mp messed up he Edga ile, so no one hea d i looks like, maybe, I'm ge ing in he way o allowing my gi o in e e e, also, i could ha e been subjec i e.  I'll y o ge him o speak up, hope ully nex ime.  I was e y uzzy hough, ons o s a ic coming in wi h he oice o a man saying ha name, e en saying mine bu , was no clea ly de ined. So y, bu da olks, will y his again. s"}