{"id": "17120", "subject": "Re: [EVP-ITC] Going to build a box", "author": "Frank Sumption", "timestamp": "2010-05-10T16:06:07Z", "full_text": "The tuner is *the most critical component.*  I have not been able to build\nusable home made tuners, the problem being they are extrmemly noisy when\nswept.  This problem prevents me from any serious production. I do make a\nTRF tuner based on the MK484 chip, and that type of reciever eleiminates\nalmost all the static normally found on the AM band, but it doesn&#39;t have the\nselectivity of super hets, so broadcast fragments tend to be longer,\nwith the &quot;voices&quot; seemingly in between the fragments. With a fast sweep\nthough, at times they will use all the audio and modualate a voice into it.\n\n I use digital radios I pick up at Thrift strores, as well as the tuners\nfrom the Radio Shack radios.\n\n The sweep is little more than the triangle function from a funtion\ngenerator, I add a DC offset and amp so I can cover the entire AM and FM\nbands of a given tuner.  I do use a random sweep, but so far that is a real\npain in the butt to make it run consistently, but I think I have a solution.\n\n\n For store bought tuners you have to use a sope or meter and find all the\npowere=, band change and tuning voltage inputs before removing it from the\nmain unit. After removing the tuner test sweep it with a 9 volt battery and\n100k pot to see how noisy it is as it&#39;s swept, and to determine the tuning\nvoltage range.\n\n F-S\nOn Mon, May 10, 2010 at 9:20 AM, cclc14481 &lt;dc3644@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Hello,\n&gt;\n&gt; I have watched the forum here and not really participated a whole lot until\n&gt; now. The boxes have always been an interest to me, especially after a\n&gt; demonstration by Steve Hultay. I have been using a Shack Hack he gave me\n&gt; with some good success but I want to go the next level and build a box. I\n&gt; have an electrical engineer who is going to work with me and I was wondering\n&gt; where the best place to start would be. I have run across the schematics for\n&gt; box #1 on-line but know that there have been numerous upgrades and changes\n&gt; since then - not certain what number you&#39;re at now Frank but was wondering\n&gt; where the best place to start would be and are there any schematics\n&gt; available of the later generations of the box available for us to expand\n&gt; upon?\n&gt;\n&gt; Dwayne Claud\n&gt;\n&gt; \n&gt;\n\nThe une is he mos c i ical componen .  I ha e no been able  o build usable home made une s, he p oblem being hey a e ex memly noisy when swep .  This p oblem p e en s me om any se ious p oduc ion. I do make a TRF une based on he MK484 chip, and ha ype o ecie e  eleimina es almos all he s a ic no mally ound on he AM band, bu i doesn' ha e he selec i i y o supe he s, so b oadcas agmen s end o be longe , wi h  he \" oices\" seemingly in be ween he agmen s. Wi h a as sweep hough, a imes hey will use all he audio and moduala e a oice in o i . \n\n \n I use digi al adios I pick up a Th i s o es, as well as he une s om he Radio Shack adios. \n \n The sweep is li le mo e han he iangle unc ion om a un ion gene a o , I add a DC o se and amp so I can co e he en i e AM and FM bands o a gi en une .  I do use a andom sweep, bu so a ha is a eal pain in he bu o make i un consis en ly, bu I hink I ha e a solu ion. \n\n \n Fo s o e bough une s you ha e o use a sope o me e and ind all he powe e=, band change and uning ol age inpu s be o e emo ing i om he main uni . A e emo ing he une es sweep i wi h a 9 ol ba e y and 100k po o see how noisy i is as i 's swep , and o de e mine he uning ol age ange. \n\n \n F-S\nOn Mon, May 10, 2010 a 9:20 AM, cclc14481 dc3644@...> w o e:\n\n  \n\n\n\nHello,I ha e wa ched he o um he e and no eally pa icipa ed a whole lo un il now. The boxes ha e always been an in e es o me, especially a e a demons a ion by S e e Hul ay. I ha e been using a Shack Hack he ga e me wi h some good success bu I wan o go he nex le el and build a box. I ha e an elec ical enginee who is going o wo k wi h me and I was wonde ing whe e he bes place o s a would be. I ha e un ac oss he schema ics o box #1 on-line bu know ha he e ha e been nume ous upg ades and changes since hen - no ce ain wha numbe you' e a now F ank bu was wonde ing whe e he bes place o s a would be and a e he e any schema ics a ailable o he la e gene a ions o he box a ailable o us o expand upon?\nDwayne Claud"}