{"id": "17121", "subject": "Re: [EVP-ITC] New files,", "author": "Frank Sumption", "timestamp": "2010-05-10T16:09:08Z", "full_text": "I get those to, people asking for help, and one said saying mass helps(that\ncatholic connection again). I don&#39;t know what to do with that.\n\n F-S\n\nOn Sun, May 9, 2010 at 1:26 PM, &lt;SnowfireL@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Happy Mother&#39;s Day everyone, I just sent a sad file to my folder, there is\n&gt; a funny one in there too.  The sad one is an older lady and young man\n&gt; talking to each other, The lady is concerned, saying; &quot;Nick, get up to the\n&gt; group, he responds with, &quot;they&#39;ll see us, she says, are they praying for\n&gt; us?&quot;  Pardon me, but I think we have been given this technology for a\n&gt; purpose, maybe it&#39;s to help these souls in darkness, i know some of you\n&gt; don&#39;t believe this, and it&#39;s always easier to turn our backs, and not see\n&gt; pain in someone else.  But, there is a reason, you with all those radios&#39;s\n&gt; out there, with all that power, try helping these folks over there, it won&#39;t\n&gt; hurt us to say silent prayers for them once and awhile think about it folks.\n&gt; sf\n&gt;\n&gt; \n&gt;\n\nI ge hose o, people asking o help, and one said saying mass helps( ha ca holic connec ion again). I don' know wha o do wi h ha . \n \n F-S\nOn Sun, May 9, 2010 a 1:26 PM, Snow i eL@...> w o e:\n\n  \n\n\n\n\nHappy Mo he 's Day e e yone, I jus sen a sad ile o my olde , he e is a unny one in he e oo.  The sad one is an olde  lady and young man alking o each o he , The lady is conce ned, saying; \"Nick, ge up o he g oup, he esponds wi h, \" hey'll see us, she says, a e hey p aying o us?\"  Pa don me, bu I hink we ha e been gi en his echnology o a pu pose, maybe i 's o help hese souls in da kness, i know some o you don' belie e his, and i 's always easie o u n ou backs, and no see pain in someone else.  Bu , he e is a eason, you wi h all hose adios's ou he e, wi h all ha powe , y helping hese olks o e he e, i won' hu us o say silen p aye s o hem once and awhile hink abou i olks. s"}