{"id": "17140", "subject": "Re: [EVP-ITC] Usual snowy night&#39;s work.", "author": "Frank Sumption", "timestamp": "2010-05-12T19:33:02Z", "full_text": "It&#39;s the Timex tuner, and AM is very noisy in my location. Plus I had a\nwhite noise generator on the board to add noise to the radio audio.\n I&#39;m gonna see iof I can remove the mechanical cap, and replace it with\ntuing diodes in this older radio.\n\nOn Wed, May 12, 2010 at 7:47 AM, Chris Salois &lt;chrissalois@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;  Sounds good Frank. What radio did you use on this one? Most of what I\n&gt; heard on the linear am seemed like it was coming through the white noise.\n&gt; The random mode seems to work well, it sounded very clear.\n&gt;\n&gt; Chris\n&gt;\n&gt;  ------------------------------\n&gt; *From:* Frank Sumption &lt;purplealiengirl@...&gt;\n&gt; *To:* evp-itc@yahoogroups.com; grassharp@yahoogroups.com\n&gt; *Sent:* Wed, May 12, 2010 1:35:21 AM\n&gt; *Subject:* [EVP-ITC] Usual snowy night&#39;s work.\n&gt;\n&gt;\n&gt;\n&gt;  Wasn&#39;t the definition of insanity--doing the same thing over and over an\n&gt; expecting different results--? Random mode is a little fast, as I only have\n&gt; one setting for it at the moment. There is a tiny amount of white noise\n&gt; mixed with the audio, as if I need that here.\n&gt;\n&gt;  Linear aM seems to start out &quot;I will speak to---&quot; can&#39;t make out the rest.\n&gt; Then at 4 seconds &quot;this is good&quot;, they seem to make use of the white noise,\n&gt; but this is only the first test.\n&gt;\n&gt;  Frank-S\n&gt;\n&gt;\n&gt;  \n&gt;\n\nI 's he Timex une , and AM is e y noisy in my loca ion. Plus I had a whi e noise gene a o on he boa d o add noise o he adio audio.\n I'm gonna see io I can emo e he mechanical cap, and eplace i wi h uing diodes in his olde adio. \nOn Wed, May 12, 2010 a 7:47 AM, Ch is Salois ch issalois@...> w o e:\n\n  \n\n\n\n\n\nSounds good F ank. Wha adio did you use on his one? Mos o wha I hea d on he linea am seemed like i was coming h ough he whi e noise. The andom mode seems o wo k well, i sounded e y clea .\n \nCh is\n\n\n\nF om: F ank Sump ion pu plealiengi l@...>To: e p-i c@yahoog oups.com; g assha p@yahoog oups.com\nSen : Wed, May 12, 2010 1:35:21 AMSubjec : [EVP-ITC] Usual snowy nigh 's wo k.\n  \n\n\n Wasn' he de ini ion o insani y--doing he same hing o e and o e an expec ing di e en esul s--? Random mode is a li le as , as I only ha e one se ing o i a he momen . The e is a iny amoun o whi e noise mixed wi h he audio, as i I need ha he e. \n\n \n Linea aM seems o s a ou \"I will speak o---\" can' make ou he es . Then a 4 seconds \" his is good\", hey seem o make use o he whi e noise, bu his is only he i s es . \n\n \n F ank-S"}