{"id": "17155", "subject": "Re: [EVP-ITC] Re: Why it have to look high tech?", "author": "Frank Sumption", "timestamp": "2010-05-17T16:13:42Z", "full_text": "I use a line output to the recorder. A mic inside the chamber picks up the\nsounds, then it&#39;s amplified inside the box and fed to the oputput jack and\nmonitor speaker.\n\n F-S\n\nOn Mon, May 17, 2010 at 8:40 AM, trilobitegal &lt;\nflexicalymenemeeki@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Frank, do you put the recorder in the echo chamber, or outside it? Thanks!\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Frank Sumption\n&gt; &lt;purplealiengirl@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; No, the echo chamber is not needed, but it does seem to add something, or\n&gt; &gt; allow some other levels access. For the past couple years I&#39;ve been using\n&gt; &gt; mostly what I call direct mode, or no echo chamber. When I use an\n&gt; aluminum\n&gt; &gt; foil chamber I seem to get more ET types, and that&#39;s what I used to get\n&gt; &quot;we\n&gt; &gt; come from the 6th planet&quot; years ago.\n&gt; &gt;\n&gt; &gt; A very large echo chamber can have a dramatic effect, like 12 inches\n&gt; &gt; square, and 4 feet long. I made one that size out of MDF board and lined\n&gt; it\n&gt; &gt; wiht aluminum foil, the voices were so demonic sounding that I took it\n&gt; &gt; apart. Later I found that if something works, you tend to get the\n&gt; negative\n&gt; &gt; guys to try to scare you away from it.\n&gt; &gt;\n&gt; &gt; F-S\n&gt; &gt;\n&gt; &gt; On Sat, May 15, 2010 at 8:33 PM, &lt;dc3644@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; So in building a Frank&#39;s Box is it essential to use an echo chamber?\n&gt; And if\n&gt; &gt; &gt; so, how come?\n&gt; &gt; &gt;\n&gt; &gt; &gt; Dwayne Claud\n&gt; &gt; &gt;\n&gt; &gt; &gt; In a message dated 5/15/2010 12:15:54 A.M. Pacific Daylight Time,\n&gt; &gt; &gt; purplealiengirl@... writes:\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; Time to introduce some artsy boxes?\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nI use a line ou pu o he eco de . A mic inside he chambe picks up he sounds, hen i 's ampli ied inside he box and ed o he opu pu jack and moni o speake . \n \n F-S\nOn Mon, May 17, 2010 a 8:40 AM, ilobi egal lexicalymenemeeki@...> w o e:\n\n  \n\n\n\nF ank, do you pu he eco de in he echo chambe , o ou side i ? Thanks! \n--- In EVP-ITC@yahoog oups.com, F ank Sump ion w o e:>> No, he echo chambe is no needed, bu i does seem o add some hing, o \n> allow some o he le els access. Fo he pas couple yea s I' e been using> mos ly wha I call di ec mode, o no echo chambe . When I use an aluminum> oil chambe I seem o ge mo e ET ypes, and ha 's wha I used o ge \"we\n> come om he 6 h plane \" yea s ago.> > A e y la ge echo chambe can ha e a d ama ic e ec , like 12 inches> squa e, and 4 ee long. I made one ha size ou o MDF boa d and lined i > wih aluminum oil, he oices we e so demonic sounding ha I ook i \n> apa . La e I ound ha i some hing wo ks, you end o ge he nega i e> guys o y o sca e you away om i .> > F-S> \n> On Sa , May 15, 2010 a 8:33 PM, w o e:> > >> >> > So in building a F ank's Box is i essen ial o use an echo chambe ? And i > > so, how come?\n> >> > Dwayne Claud> >> > In a message da ed 5/15/2010 12:15:54 A.M. Paci ic Dayligh Time,\n> > pu plealiengi l@... w i es:> >> >> >> > Time o in oduce some a sy boxes?> >> > > >>"}