{"id": "17187", "subject": "Re: [EVP-ITC] Some offended.", "author": "Frank Sumption", "timestamp": "2010-05-22T06:05:36Z", "full_text": "Thanks! I don&#39;t communicate very well. I&#39;m just tired of the bullies, and\nthe people claiming to be the onlyest expert on this stuff.\n\n The box does seem to operate differently for me. Some seem to be able to\nask questions, and some get verifiable information, and known personalities.\n\n\n F-S\nOn Fri, May 21, 2010 at 8:24 PM, paige chavez &lt;magnolia.massage@...&gt;wrote:\n\n&gt;\n&gt;\n&gt;   *Frank im thankful and ecstatic over all you do and have done for the\n&gt; field. More power to ya....as far as the nuts and nay-sayers.....let them\n&gt; wallow in their own insecurity and misery.....-p*\n&gt;\n&gt; -----Original message-----\n&gt;\n&gt; *From: *Frank Sumption &lt;purplealiengirl@...&gt;*\n&gt; To: *evp-itc@yahoogroups.com, RTSC@yahoogroups.com*\n&gt; Sent: *Fri, May 21, 2010 22:03:37 GMT+00:00*\n&gt; Subject: *[EVP-ITC] Some offended.\n&gt;\n&gt;   I get requests for boxes, and I think some get offended that I don&#39;t\n&gt; just whip out a box and throw it at them for &quot;their research&quot;. Trouble is,\n&gt; there&#39;s too many whack jobs out there wanting to be the world&#39;s onlyest box\n&gt; expert, or the ones desperately grieving, or lately, religious nuts!\n&gt;\n&gt;  I&#39;ve said it over and over and over and over and over and\n&gt; over--expectation will create the voices you want to hear. If you are\n&gt; seeking Jesus, that is exactly what you are going to get and you&#39;ll swear\n&gt; it&#39;s God gospel freaking truth, and the rest of us should bow down to you. I\n&gt; think y&#39;all know who I&#39;m talking about.\n&gt;\n&gt;  I am uncertain if one can ask for certain spirits, or if even that tends\n&gt; to create what one wans. I think maybe it works the same as the above. I\n&gt; don&#39;t ask for any specific spirits/entities, I don&#39;t ask questions, I just\n&gt; let them talk and try not to influance it. If I have question, I might think\n&gt; it, and most of the time they&#39;ll answer, wiht out me asking.  That could be\n&gt; just creating want I want to hear as well--don&#39;t know.\n&gt;\n&gt;  I don&#39;t have to be on these groups and I don&#39;t have make  boxes, except\n&gt; for my own use. I think the messages are personal in nature, no one is going\n&gt; to hear it the same, and it&#39;s about worthless as &quot;evidence&quot;. We get enough\n&gt; that&#39;s shareable to show others that it&#39;s real, and I think that is about\n&gt; the best that can be hoped for. I think, and it is only my opinion, that\n&gt; &quot;evidence&quot; at so called haunted areas is just what is expected, I really\n&gt; don&#39;t think it proves anything.\n&gt;\n&gt;  Then, there the bullies that want all this to conform to their wishes, and\n&gt; we saw more examples of that with the recent e-bay auction, and y&#39;all know\n&gt; who you are! If no one sells boxes, no one builds boxes, its&#39; that simple!\n&gt; Parts and radios are not free, and why the hell should we be expected to\n&gt; spend endless hours on this stuff for nothing!?\n&gt;\n&gt;  I know, I know --sacrilege!-- I should be banned from all groups and box\n&gt; work, burned at the stake, tarred and feathered, run out of town on rail,\n&gt; how dare I say anything!?\n&gt;\n&gt;  Frank S\n&gt;\n&gt;  \n&gt;\n\nThanks! I don' communica e e y well. I'm jus i ed o he bullies, and he people claiming o be he onlyes expe on his s u . \n \n The box does seem o ope a e di e en ly o me. Some seem o be able  o ask ques ions, and some ge e i iable in o ma ion, and known pe sonali ies. \n \n F-S\nOn F i, May 21, 2010 a 8:24 PM, paige cha ez magnolia.massage@...> w o e:\n\n  \n\n\n\n\n\n\n\n\nF ank im hank ul and ecs a ic o e all you do and ha e done o he ield. Mo e powe o ya....as a as he nu s and nay-saye s.....le hem wallow in hei own insecu i y and mise y.....-p\n\n\n\n-----O iginal message-----\n\nF om: F ank Sump ion pu plealiengi l@...>To: e p-i c@yahoog oups.com, RTSC@yahoog oups.com\nSen : F i, May 21, 2010 22:03:37 GMT+00:00Subjec : [EVP-ITC] Some o ended.\n\n\n I ge eques s o boxes, and I hink some ge o ended ha I don' jus whip ou a box and h ow i a hem o \" hei esea ch\". T ouble is, he e's oo many whack jobs ou he e wan ing o be he wo ld's onlyes box expe , o he ones despe a ely g ie ing, o la ely, eligious nu s! \n\n \n I' e said i o e and o e and o e and o e and o e and o e --expec a ion will c ea e he oices you wan o hea . I you a e seeking Jesus, ha is exac ly wha you a e going o ge and you'll swea i 's God gospel eaking u h, and he es o us should bow down o you. I hink y'all know who I'm alking abou . \n\n \n I am unce ain i one can ask o ce ain spi i s, o i e en ha ends o c ea e wha one wans. I hink maybe i wo ks he same as he abo e. I don' ask o any speci ic spi i s/en i ies, I don' ask ques ions, I jus le hem alk and y no o in luance i . I I ha e ques ion, I migh hink i , and mos o he ime hey'll answe , wih ou me asking.  Tha could be jus c ea ing wan I wan o hea as well--don' know.\n\n \n I don' ha e o be on hese g oups and I don' ha e make  boxes, excep o my own use. I hink he messages a e pe sonal in na u e, no one is going o hea i he same, and i 's abou wo hless as \"e idence\". We ge enough ha 's sha eable o show o he s ha i 's eal, and I hink ha is abou he bes ha can be hoped o . I hink, and i is only my opinion, ha \"e idence\" a so called haun ed a eas is jus wha is expec ed, I eally don' hink i  p o es any hing.\n\n \n Then, he e he bullies ha wan all his o con o m o hei wishes, and we saw mo e examples o ha wi h  he ecen e-bay auc ion, and y'all know who you a e! I no one sells boxes, no one builds boxes, i s' ha simple! Pa s and adios a e no ee, and why he hell should we be expec ed o spend endless hou s on his s u o no hing!?\n\n \n I know, I know --sac ilege!-- I should be banned om all g oups and box wo k, bu ned a he s ake, a ed and ea he ed, un ou o own on ail, how da e I say any hing!?\n \n F ank S"}