{"id": "17192", "subject": "Re: Some offended.", "author": "jay", "timestamp": "2010-05-23T00:55:23Z", "full_text": "It&#39;s been some months since I had applied to this group and eventhough I don&#39;t log into it very often I am always reading the updates on subjects.All of them.I may not know Frank personally,nor do I even know who allowed me in the group,but I wouldn&#39;t have asked to join if there wasn&#39;t something in here I beleive.Ever since I saw the first usage of that box on a paranormal show,I knew something new has evolved.The ideas and thoughts behind the makings and application if such a device still astounds me.Whenever there comes something new and amazing to the public eye there are always balkers and naysayers,not to mention fanpeople as well.I dont know which are more harmful.All I know is that those of us who have been exposed to something that we cannot explain and those who have been fortunate enough to own such a device appreciate the work that was put forth.I&#39;d tip my hat if I wore one.Would a nod of my glasses do?\n--- In EVP-ITC@yahoogroups.com, SnowfireL@... wrote:\n&gt;\n&gt; I was willing to pay for a box from Frank, and said so for over a year now, \n&gt;  he has the right to sell what he makes, he has earned that right.  I can&#39;t \n&gt;  make one that&#39;s for sure, wish I could, but I am thankful for what I have  \n&gt; now.  I have my RS, and my ITC of my spirit&#39;s friend own workings, but that \n&gt;  a secret. sssh! and i&#39;ve already said too much. sf\n&gt;  \n&gt;  \n&gt; In a message dated 5/22/2010 1:57:03 A.M. Eastern Daylight Time,  \n&gt; magnolia.massage@... writes:\n&gt; \n&gt;  \n&gt;  \n&gt;  \n&gt;     Frank im thankful and ecstatic over all you do and have  done for the \n&gt; field. More power to ya....as far as the nuts and  nay-sayers..Frank im \n&gt; thankful and ecstatic over all you do and have  donF\n&gt; \n&gt; -----Original  message-----\n&gt; \n&gt; From: Frank  Sumption &lt;purplealiengirl@purpleali&gt;\n&gt; To:  evp-itc@yahoogroupsevp-itc@yahoogroups&lt;WBRevp\n&gt; Sent:  Fri, May 21, 2010 22:03:37 GMT+00:00\n&gt; Subject: [EVP-ITC] Some  offended.\n&gt; \n&gt; \n&gt; \n&gt;  \n&gt; I get requests for boxes, and I think some get offended that I  don&#39;t just \n&gt; whip out a box and throw it at them for &quot;their research&quot;. Trouble  is, \n&gt; there&#39;s too many whack jobs out there wanting to be the  world&#39;s onlyest box \n&gt; expert, or the ones desperately grieving, or  lately, religious nuts! \n&gt;  \n&gt;  I&#39;ve said it over and over and over and over and over and  \n&gt; over--expectation will create the voices you want to hear. If you are  seeking Jesus, that \n&gt; is exactly what you are going to get and you&#39;ll swear  it&#39;s God gospel \n&gt; freaking truth, and the rest of us should bow down to you. I  think y&#39;all know \n&gt; who I&#39;m talking about. \n&gt;  \n&gt;  I am uncertain if one can ask for certain spirits, or if even  that tends \n&gt; to create what one wans. I think maybe it works the same as the  above. I \n&gt; don&#39;t ask for any specific spirits/entities, I don&#39;t ask questions,  I just \n&gt; let them talk and try not to influance it. If I have question, I  might think \n&gt; it, and most of the time they&#39;ll answer, wiht out me  asking.  That could be \n&gt; just creating want I want to hear as well--don&#39;t  know.\n&gt;  \n&gt;  I don&#39;t have to be on these groups and I don&#39;t have make   boxes, except \n&gt; for my own use. I think the messages are personal in  nature, no one is going \n&gt; to hear it the same, and it&#39;s about worthless as  &quot;evidence&quot;. We get enough \n&gt; that&#39;s shareable to show others that it&#39;s real,  and I think that is about \n&gt; the best that can be hoped for. I think, and it is  only my opinion, that \n&gt; &quot;evidence&quot; at so called haunted areas is just what is  expected, I really \n&gt; don&#39;t think it proves anything.\n&gt;  \n&gt;  Then, there the bullies that want all this to conform to their  wishes, \n&gt; and we saw more examples of that with the recent e-bay auction,  and y&#39;all \n&gt; know who you are! If no one sells boxes, no one builds boxes, its&#39;  that \n&gt; simple! Parts and radios are not free, and why the hell should we be  expected to \n&gt; spend endless hours on this stuff for nothing!?\n&gt;  \n&gt;  I know, I know --sacrilege!I know, I know --sacrilege!&lt;WBR&gt;-- I should be \n&gt; banned from all  groups and box work, burned at the stake, tarred and \n&gt; feathered, run out I say anything!?\n&gt;  \n&gt;  Frank S\n&gt;"}