{"id": "17193", "subject": "Re: [EVP-ITC] A little, okay a lot, of help needed here. :-)", "author": "Frank Sumption", "timestamp": "2010-05-23T04:54:57Z", "full_text": "The guy on the home page was gotten by sweeping a VCR tuner, similar to\nusing a radio for a box, then video recording the screen of a TV monitor. It\nwasn&#39;t the video loop most use, and I&#39;ve never tried.\n\n\n F-S\n\nOn Sat, May 22, 2010 at 7:43 AM, bmcduffie59 &lt;bmcduffie59@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Hello everybody!\n&gt;\n&gt; First, let me say I am new here, and I really love this group.\n&gt;\n&gt; I have just started trying to capture images on my TV using a camcorder. I\n&gt; have had some luck, but my pictures do not look like the guy on the home\n&gt; page here. Lol. I think I am not getting the video loop to work, and am just\n&gt; taking a picture of the noise on the screen. I have tried to manually focus\n&gt; in and out as far as I can go, and I still don&#39;t seem to have the right\n&gt; focus to create the loop. Any ideas on how to achieve this loop would be\n&gt; greatly appreciated. (I have tried to find more info on the web about this\n&gt; and I have yet to come up with an answer.)\n&gt;\n&gt; Thanks so much!\n&gt;\n&gt; \n&gt;\n\nThe guy on he home page was go en by sweeping a VCR une , simila o using a adio o a box, hen ideo eco ding he sc een o a TV moni o . I wasn' he ideo loop mos use, and I' e ne e ied. \n\n \n \n F-S\nOn Sa , May 22, 2010 a 7:43 AM, bmcdu ie59 bmcdu ie59@...> w o e:\n\n  \n\n\n\nHello e e ybody!Fi s , le me say I am new he e, and I eally lo e his g oup.I ha e jus s a ed ying o cap u e images on my TV using a camco de . I ha e had some luck, bu my pic u es do no look like he guy on he home page he e. Lol. I hink I am no ge ing he ideo loop o wo k, and am jus aking a pic u e o he noise on he sc een. I ha e ied o manually ocus in and ou as a as I can go, and I s ill don' seem o ha e he igh ocus o c ea e he loop. Any ideas on how o achie e his loop would be g ea ly app ecia ed. (I ha e ied o ind mo e in o on he web abou his and I ha e ye o come up wi h an answe .)\nThanks so much!"}