{"id": "17204", "subject": "Re: [EVP-ITC] Some offended.", "author": "Charles Gilbreath", "timestamp": "2010-05-24T06:42:41Z", "full_text": "--0-492819675-1274683361=:87199\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nI have worked in electronics for over 40 years.=C2=A0 I NEVER went to trade=\r\n school or college.=C2=A0 I taught myself because that&#39;s how bad I wanted t=\r\no learn.=C2=A0 At a very young age, I went to the library and read everythi=\r\nng I could find on electronics.=C2=A0 When I ran out of books, I became a h=\r\nam radio operator.=C2=A0 I worked in the aerospace industry in an engineeri=\r\nng lab until 10 years ago, when the government made cuts.=C2=A0 I still get=\r\n paid for what I know.\n\nMy point is that if you want it bad enough, you can=\r\n do whatever you need to do to make it happen.=C2=A0 If Frank can&#39;t or won&#39;=\r\nt build it, from what I&#39;ve seen, he is willing to provide all the informati=\r\non to do it yourself.=C2=A0 If you are not willing to put that type of effo=\r\nrt into it, find something else to occupy your time and efforts.\n\n\n\n\n\n\n\n\n\n\n=\r\n\n\n\n--- On Fri, 5/21/10, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n\n=\r\nFrom: Frank Sumption &lt;purplealiengirl@...&gt;\nSubject: [EVP-ITC] Some of=\r\nfended.\nTo: evp-itc@yahoogroups.com, RTSC@yahoogroups.com\nDate: Friday, May=\r\n 21, 2010, 6:02 PM\n\n\n\n\n\n\n\n=C2=A0\n\n\n\n  \n\n\n    \n      \n      \n      =C2=A0I g=\r\net requests for boxes, and I think some get offended that I don&#39;t just whip=\r\n out a box and throw it at them for &quot;their research&quot;. Trouble is, there&#39;s t=\r\noo many whack jobs out there wanting to be the world&#39;s=C2=A0onlyest box exp=\r\nert, or the ones desperately grieving, or lately, religious nuts! \n\n=C2=A0\n=\r\n=C2=A0I&#39;ve said it over and over and over and over and over and over--expec=\r\ntation will create the voices you want to hear. If you are seeking Jesus, t=\r\nhat is exactly what you are going to get and you&#39;ll swear it&#39;s God gospel f=\r\nreaking truth, and the rest of us should bow down to you. I think y&#39;all kno=\r\nw who I&#39;m talking about. \n\n=C2=A0\n=C2=A0I am uncertain if one can ask for c=\r\nertain spirits, or if even that tends to create what one wans. I think mayb=\r\ne it works the same as the above. I don&#39;t ask for any specific spirits/enti=\r\nties, I don&#39;t ask questions, I just let them talk and try not to influance =\r\nit. If I have question, I might think it, and most of the time they&#39;ll answ=\r\ner, wiht out me asking.=C2=A0 That could be just creating want I want to he=\r\nar as well--don&#39;t know.\n\n=C2=A0\n=C2=A0I don&#39;t have to be on these groups an=\r\nd I don&#39;t have make=C2=A0 boxes, except for my=C2=A0own use. I think the me=\r\nssages are personal in nature, no one is going to hear it the same, and it&#39;=\r\ns about worthless as &quot;evidence&quot;. We get enough that&#39;s shareable to show oth=\r\ners that it&#39;s real, and I think that is about the best that can be hoped fo=\r\nr. I think, and it is only my opinion, that &quot;evidence&quot; at so called haunted=\r\n areas is just what is expected, I really don&#39;t think it=C2=A0proves anythi=\r\nng.\n\n=C2=A0\n=C2=A0Then, there the bullies that want all this to conform to =\r\ntheir wishes, and we saw more examples of that with=C2=A0the recent e-bay a=\r\nuction, and y&#39;all know who you are! If no one sells boxes, no one builds bo=\r\nxes, its&#39; that simple! Parts and radios are not free, and why the hell shou=\r\nld we be expected to spend endless hours on this stuff for nothing!?\n\n=C2=\r\n=A0\n=C2=A0I know, I know --sacrilege! -- I should be banned from all groups=\r\n and box work, burned at the stake, tarred and feathered, run out of town o=\r\nn rail, how dare=C2=A0I say anything!?\n=C2=A0\n=C2=A0Frank S\n\n\n    \n     \n\n =\r\n   \n    \n\n\n \n\n\n\n  \n\n\n\n\n\n\n      \r\n--0-492819675-1274683361=:87199\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;I have worked in electronics for over 40 year=\r\ns.&nbsp; I NEVER went to trade school or college.&nbsp; I taught myself bec=\r\nause that&#39;s how bad I wanted to learn.&nbsp; At a very young age, I went to=\r\n the library and read everything I could find on electronics.&nbsp; When I =\r\nran out of books, I became a ham radio operator.&nbsp; I worked in the aero=\r\nspace industry in an engineering lab until 10 years ago, when the governmen=\r\nt made cuts.&nbsp; I still get paid for what I know.&lt;br&gt;&lt;br&gt;My point is tha=\r\nt if you want it bad enough, you can do whatever you need to do to make it =\r\nhappen.&nbsp; If Frank can&#39;t or won&#39;t build it, from what I&#39;ve seen, he is =\r\nwilling to provide all the information to do it yourself.&nbsp; If you are =\r\nnot willing to put that type of effort into it, find something else to occu=\r\npy your time and\n efforts.&lt;br&gt;&lt;br&gt;&lt;br&gt;&lt;br&gt;&lt;br&gt;&lt;br&gt;&lt;br&gt;&lt;br&gt;&lt;br&gt;&lt;br&gt;&lt;br&gt;&lt;br&gt;&lt;=\r\nbr&gt;&lt;br&gt;--- On &lt;b&gt;Fri, 5/21/10, Frank Sumption &lt;i&gt;&lt;purplealiengirl@gmail.=\r\ncom&gt;&lt;/i&gt;&lt;/b&gt; wrote:&lt;br&gt;&lt;blockquote style=3D&quot;border-left: 2px solid rgb(1=\r\n6, 16, 255); margin-left: 5px; padding-left: 5px;&quot;&gt;&lt;br&gt;From: Frank Sumption=\r\n &lt;purplealiengirl@...&gt;&lt;br&gt;Subject: [EVP-ITC] Some offended.&lt;br&gt;=\r\nTo: evp-itc@yahoogroups.com, RTSC@yahoogroups.com&lt;br&gt;Date: Friday, May 21, =\r\n2010, 6:02 PM&lt;br&gt;&lt;br&gt;&lt;div id=3D&quot;yiv251159122&quot;&gt;\n\n\n\n\n\n&lt;span style=3D&quot;display:=\r\n none;&quot;&gt;&nbsp;&lt;/span&gt;\n\n\n\n    &lt;div id=3D&quot;ygrp-text&quot;&gt;\n      \n      \n      &lt;p&gt;=\r\n&lt;/p&gt;&lt;div&gt;&nbsp;I get requests for boxes, and I think some get offended that=\r\n I don&#39;t just whip out a box and throw it at them for &quot;their research&quot;. Tro=\r\nuble is, there&#39;s too many whack jobs out there wanting to be the world&#39;s&nb=\r\nsp;onlyest box expert, or the ones desperately grieving, or lately, religio=\r\nus nuts! &lt;/div&gt;\n\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;I&#39;ve said it over and over an=\r\nd over and over and over and over--expectation will create the voices you w=\r\nant to hear. If you are seeking Jesus, that is exactly what you are going t=\r\no get and you&#39;ll swear it&#39;s God gospel freaking truth, and the rest of us s=\r\nhould bow down to you. I think y&#39;all know who I&#39;m talking about. &lt;/div&gt;\n\n&lt;d=\r\niv&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;I am uncertain if one can ask for certain spirit=\r\ns, or if even that tends to create what one wans. I think maybe it works th=\r\ne same as the above. I don&#39;t ask for any specific spirits/entities, I don&#39;t=\r\n ask questions, I just let them talk and try not to influance it. If I have=\r\n question, I might think it, and most of the time they&#39;ll answer, wiht out =\r\nme asking.&nbsp; That could be just creating want I want to hear as well--d=\r\non&#39;t know.&lt;/div&gt;\n\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;I don&#39;t have to be on these =\r\ngroups and I don&#39;t have make&nbsp; boxes, except for my&nbsp;own use. I thi=\r\nnk the messages are personal in nature, no one is going to hear it the same=\r\n, and it&#39;s about worthless as &quot;evidence&quot;. We get enough that&#39;s shareable to=\r\n show others that it&#39;s real, and I think that is about the best that can be=\r\n hoped for. I think, and it is only my opinion, that &quot;evidence&quot; at so calle=\r\nd haunted areas is just what is expected, I really don&#39;t think it&nbsp;prov=\r\nes anything.&lt;/div&gt;\n\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;Then, there the bullies th=\r\nat want all this to conform to their wishes, and we saw more examples of th=\r\nat with&nbsp;the recent e-bay auction, and y&#39;all know who you are! If no on=\r\ne sells boxes, no one builds boxes, its&#39; that simple! Parts and radios are =\r\nnot free, and why the hell should we be expected to spend endless hours on =\r\nthis stuff for nothing!?&lt;/div&gt;\n\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;I know, I know=\r\n --sacrilege! -- I should be banned from all groups and box work, burned at=\r\n the stake, tarred and feathered, run out of town on rail, how dare&nbsp;I =\r\nsay anything!?&lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;Frank S&lt;/div&gt;\n\n\n    &lt;/div=\r\n&gt;\n     \n\n\n\n \n\n\n&lt;/div&gt;&lt;/blockquote&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n      \r\n--0-492819675-1274683361=:87199--"}