{"id": "17205", "subject": "Re: [EVP-ITC] Some offended.", "author": "Frank Sumption", "timestamp": "2010-05-24T16:04:34Z", "full_text": "I just can&#39;t mass produce the junk.\n\n F-S\n\nOn Mon, May 24, 2010 at 12:42 AM, Charles Gilbreath &lt;\naardvarksvcsinc@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;   I have worked in electronics for over 40 years.  I NEVER went to trade\n&gt; school or college.  I taught myself because that&#39;s how bad I wanted to\n&gt; learn.  At a very young age, I went to the library and read everything I\n&gt; could find on electronics.  When I ran out of books, I became a ham radio\n&gt; operator.  I worked in the aerospace industry in an engineering lab until 10\n&gt; years ago, when the government made cuts.  I still get paid for what I know.\n&gt;\n&gt; My point is that if you want it bad enough, you can do whatever you need to\n&gt; do to make it happen.  If Frank can&#39;t or won&#39;t build it, from what I&#39;ve\n&gt; seen, he is willing to provide all the information to do it yourself.  If\n&gt; you are not willing to put that type of effort into it, find something else\n&gt; to occupy your time and efforts.\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; --- On *Fri, 5/21/10, Frank Sumption &lt;purplealiengirl@...&gt;* wrote:\n&gt;\n&gt;\n&gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt; Subject: [EVP-ITC] Some offended.\n&gt; To: evp-itc@yahoogroups.com, RTSC@yahoogroups.com\n&gt; Date: Friday, May 21, 2010, 6:02 PM\n&gt;\n&gt;\n&gt;\n&gt;  I get requests for boxes, and I think some get offended that I don&#39;t just\n&gt; whip out a box and throw it at them for &quot;their research&quot;. Trouble is,\n&gt; there&#39;s too many whack jobs out there wanting to be the world&#39;s onlyest box\n&gt; expert, or the ones desperately grieving, or lately, religious nuts!\n&gt;\n&gt;  I&#39;ve said it over and over and over and over and over and\n&gt; over--expectation will create the voices you want to hear. If you are\n&gt; seeking Jesus, that is exactly what you are going to get and you&#39;ll swear\n&gt; it&#39;s God gospel freaking truth, and the rest of us should bow down to you. I\n&gt; think y&#39;all know who I&#39;m talking about.\n&gt;\n&gt;  I am uncertain if one can ask for certain spirits, or if even that tends\n&gt; to create what one wans. I think maybe it works the same as the above. I\n&gt; don&#39;t ask for any specific spirits/entities, I don&#39;t ask questions, I just\n&gt; let them talk and try not to influance it. If I have question, I might think\n&gt; it, and most of the time they&#39;ll answer, wiht out me asking.  That could be\n&gt; just creating want I want to hear as well--don&#39;t know.\n&gt;\n&gt;  I don&#39;t have to be on these groups and I don&#39;t have make  boxes, except\n&gt; for my own use. I think the messages are personal in nature, no one is going\n&gt; to hear it the same, and it&#39;s about worthless as &quot;evidence&quot;. We get enough\n&gt; that&#39;s shareable to show others that it&#39;s real, and I think that is about\n&gt; the best that can be hoped for. I think, and it is only my opinion, that\n&gt; &quot;evidence&quot; at so called haunted areas is just what is expected, I really\n&gt; don&#39;t think it proves anything.\n&gt;\n&gt;  Then, there the bullies that want all this to conform to their wishes, and\n&gt; we saw more examples of that with the recent e-bay auction, and y&#39;all know\n&gt; who you are! If no one sells boxes, no one builds boxes, its&#39; that simple!\n&gt; Parts and radios are not free, and why the hell should we be expected to\n&gt; spend endless hours on this stuff for nothing!?\n&gt;\n&gt;  I know, I know --sacrilege! -- I should be banned from all groups and box\n&gt; work, burned at the stake, tarred and feathered, run out of town on rail,\n&gt; how dare I say anything!?\n&gt;\n&gt;  Frank S\n&gt;\n&gt;\n&gt; \n&gt;\n\nI jus can' mass p oduce he junk. \n \n F-S\nOn Mon, May 24, 2010 a 12:42 AM, Cha les Gilb ea h aa d a ks csinc@...> w o e:\n\n  \n\n\n\n\n\n\n\nI ha e wo ked in elec onics o o e 40 yea s.  I NEVER wen o ade school o college.  I augh mysel because ha 's how bad I wan ed o lea n.  A a e y young age, I wen o he lib a y and ead e e y hing I could ind on elec onics.  When I an ou o books, I became a ham adio ope a o .  I wo ked in he ae ospace indus y in an enginee ing lab un il 10 yea s ago, when he go e nmen made cu s.  I s ill ge paid o wha I know.\nMy poin is ha i you wan i bad enough, you can do wha e e you need o do o make i happen.  I F ank can' o won' build i , om wha I' e seen, he is willing o p o ide all he in o ma ion o do i you sel .  I you a e no willing o pu ha ype o e o in o i , ind some hing else o occupy you ime and e o s.\n--- On F i, 5/21/10, F ank Sump ion pu plealiengi l@gmail.com> w o e:\nF om: F ank Sump ion pu plealiengi l@...>Subjec : [EVP-ITC] Some o ended.\nTo: e p-i c@yahoog oups.com, RTSC@yahoog oups.comDa e: F iday, May 21, 2010, 6:02 PM\n  \n\n\n I ge eques s o boxes, and I hink some ge o ended ha I don' jus whip ou a box and h ow i a hem o \" hei esea ch\". T ouble is, he e's oo many whack jobs ou he e wan ing o be he wo ld's onlyes box expe , o he ones despe a ely g ie ing, o la ely, eligious nu s! \n\n \n I' e said i o e and o e and o e and o e and o e and o e --expec a ion will c ea e he oices you wan o hea . I you a e seeking Jesus, ha is exac ly wha you a e going o ge and you'll swea i 's God gospel eaking u h, and he es o us should bow down o you. I hink y'all know who I'm alking abou . \n\n \n I am unce ain i one can ask o ce ain spi i s, o i e en ha ends o c ea e wha one wans. I hink maybe i wo ks he same as he abo e. I don' ask o any speci ic spi i s/en i ies, I don' ask ques ions, I jus le hem alk and y no o in luance i . I I ha e ques ion, I migh hink i , and mos o he ime hey'll answe , wih ou me asking.  Tha could be jus c ea ing wan I wan o hea as well--don' know.\n\n \n I don' ha e o be on hese g oups and I don' ha e make  boxes, excep o my own use. I hink he messages a e pe sonal in na u e, no one is going o hea i he same, and i 's abou wo hless as \"e idence\". We ge enough ha 's sha eable o show o he s ha i 's eal, and I hink ha is abou he bes ha can be hoped o . I hink, and i is only my opinion, ha \"e idence\" a so called haun ed a eas is jus wha is expec ed, I eally don' hink i  p o es any hing.\n\n \n Then, he e he bullies ha wan all his o con o m o hei wishes, and we saw mo e examples o ha wi h  he ecen e-bay auc ion, and y'all know who you a e! I no one sells boxes, no one builds boxes, i s' ha simple! Pa s and adios a e no ee, and why he hell should we be expec ed o spend endless hou s on his s u o no hing!?\n\n \n I know, I know --sac ilege! -- I should be banned om all g oups and box wo k, bu ned a he s ake, a ed and ea he ed, un ou o own on ail, how da e I say any hing!?\n \n F ank S"}