{"id": "17209", "subject": "Re: [EVP-ITC] Sony Arm Band radio", "author": "Frank Sumption", "timestamp": "2010-05-25T20:51:55Z", "full_text": "That&#39;s just the radio as it was, just the processor board removed.\nSometimes the radios are crappy sounding when swept, it&#39;s a crap shoot.\n\n  I had this sony headphone radio, but it wouldn&#39;t work whwen assemble in a\nbox. At the end &quot;Earth Is Doomed&quot;\n\nDid you cut the VT wire and connect the sweep board to the radio side? With\na ground wire from the sweep board?\n\n F-S\n\nOn Tue, May 25, 2010 at 1:59 PM, Chris Salois &lt;chrissalois@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;  Hey Frank! Thats a very nice sounding armband radio. Did you have to add\n&gt; a new antenna to the radio? I&#39;ve been trying to use the 12-580 armband with\n&gt; the same sweep circuit (kit23) I&#39;ve been using and it just doesn&#39;t want to\n&gt; take.... Seeing as though I am stabbing in the dark everytime I try\n&gt; something new because I really know little about electronics overall, maybe\n&gt; you could provide a suggestion on what I may be missing Frank? anything you\n&gt; can tell me about prepping the radio board before adding the circuit (ie:\n&gt; cutting a wire or trace or something else)? The only thing I&#39;ve done is cut\n&gt; the mute wire like in past radios. Any thoughts would be great. You have\n&gt; used that radio in the past in the Frank&#39;s Box , right? Hope to hear from\n&gt; you.\n&gt;\n&gt; Thanks,\n&gt; Chris\n&gt;\n&gt;  ------------------------------\n&gt; *From:* Frank Sumption &lt;purplealiengirl@...&gt;\n&gt; *To:* evp-itc@yahoogroups.com; RTSC@yahoogroups.com\n&gt; *Sent:* Tue, May 25, 2010 9:33:11 AM\n&gt; *Subject:* [EVP-ITC] Sony Arm Band radio [1 Attachment]\n&gt;\n&gt;\n&gt;\n&gt;  The never ending quest for a perfect tuner, while varnish dries on other\n&gt; boxes. It would help if I really understood how the voices are formed, how\n&gt; the sound is actually manipulated. The sound quality of the tuner is vital,\n&gt; othere things I&#39;ve tried, like echo chambers and adding in tones seem to be\n&gt; of little help. I&#39;m not an engineer, all I know is do the sweep thing and\n&gt; &quot;they&quot; talk. I don&#39;t know how to dail up an enitity, and I&#39;m not wise enough\n&gt; to ask questions.\n&gt;\n&gt;  There&#39;s some out there that seem to think the box is imperfect and they\n&gt; wait fo rthr next stage. All that is a symptom of our siociety, expectingthe\n&gt; next programmed advance. I think some are not being told how great they are,\n&gt; so the box must not be working correctly. Not so much here on these groups,\n&gt; just people I&#39;ve run into in the past.\n&gt;\n&gt;  As above, so below! I&#39;m easily dismissed on this level, and I&#39;m not sure\n&gt; this isn&#39;t true on high as well.\n&gt;\n&gt;  F-S\n&gt;\n&gt;\n&gt;  \n&gt;\n\nTha 's jus he adio as i was, jus he p ocesso boa d emo ed. Some imes  he adios a e c appy sounding when swep , i 's a c ap shoo . \n \n  I had his sony headphone adio, bu i wouldn' wo k whwen assemble in a box. A he end \"Ea h Is Doomed\"\n \nDid you cu he VT wi e and connec he sweep boa d o he adio side? Wi h a g ound wi e om he sweep boa d? \n \n F-S\nOn Tue, May 25, 2010 a 1:59 PM, Ch is Salois ch issalois@...> w o e:\n\n  \n\n\n\n\n\n\nHey F ank! Tha s a e y nice sounding a mband adio. Did you ha e o add a new an enna o he adio? I' e been ying o use he 12-580 a mband wi h he same sweep ci cui (ki 23) I' e been using and i jus doesn' wan o ake.... Seeing as hough I am s abbing in he da k e e y ime I y some hing new because I eally know li le abou elec onics o e all, maybe you could p o ide a sugges ion on wha I may be missing F ank? any hing you can ell me abou p epping he adio boa d be o e adding he ci cui (ie:  cu ing a wi e o ace o some hing else)? The only hing I' e done is cu he mu e wi e like in pas adios. Any hough s would be g ea . You ha e used ha adio in he pas in he F ank's Box , igh ? Hope o hea om you.\n\n \nThanks,\nCh is\n\n\n\nF om: F ank Sump ion pu plealiengi l@...>To: e p-i c@yahoog oups.com; RTSC@yahoog oups.com\nSen : Tue, May 25, 2010 9:33:11 AMSubjec : [EVP-ITC] Sony A m Band adio [1 A achmen ]\n\n\n  \n\n\n The ne e ending ques o a pe ec une , while a nish d ies on o he boxes. I would help i I eally unde s ood how he oices a e o med, how he sound is ac ually manipula ed. The sound quali y o he une is i al, o he e hings I' e ied, like echo chambe s and adding in ones seem o be o li le help. I'm no an enginee , all I know is do he sweep hing and \" hey\" alk. I don' know how o dail up an eni i y, and I'm no wise enough o ask ques ions. \n\n \n The e's some ou he e ha seem o hink he box is impe ec and hey wai o h nex s age. All ha is a symp om o ou siocie y, expec ing he nex p og ammed ad ance. I hink some a e no being old how g ea hey a e, so he box mus no be wo king co ec ly. No so much he e on hese g oups, jus  people I' e un in o in he pas . \n\n \n As abo e, so below! I'm easily dismissed on his le el, and I'm no su e his isn' ue on high as well. \n \n F-S"}