{"id": "17215", "subject": "Re: RTSC Talk Show Today at 6pm est.", "author": "rasterer", "timestamp": "2010-05-25T23:18:50Z", "full_text": "This can be a good test of psychic powers.  Let&#39;s see what we have:\n\n\nFirst, there was a lot of rambling.  But under &quot;Steve Stops&quot; we hear:\n\nYou can see in detail, how one and two join forces to evolve and grow. You recognize that what seemed to be blocking the one&#39;s expansion was only a process of deliberation. You take many details into account and throughly prepare to put your plans into action.\n\nBut then part of &quot;Steve Continues&quot; also contains:\n\n... You can see in detail, how one and two join forces to evolve and grow. you recognize that what seemed to be blocking the one&#39;s expansion was only a process of deliberation. ... You take many details into account and throughly prepare to put your plans into action.\n\n\nSo sorry Steve, either your darned if you do, and darned if you don&#39;t, or our psychic is of the mystic school of &quot;Cut and Paste&quot;. (Note even &quot;throughly&quot; is misspelled they same way in the same place).\n\nBut, assuming that Sonny Psychic isn&#39;t just tossing out a lot of `ifs&#39; and `maybe&#39;s, which of course are meaningless and can match any result, let&#39;s list the predictions solidly, which Steve could, at the end of the summer,  give details of as true or false:\n\n\nSteve Continues:\n\nSteve feels exuberance.\nSteve achieves abundance.\nSteve has cause to celebrate because of it.\nSteve discovers hidden talents.\nSteve  has a new relationship bloom.\nSteve is happy.\nSteve experiences healing.\n\n\nSteve Stops (and so does not experience the former):\n\nSteve does not experience abundance.\nSteve has no cause to celebrate.\nSteve does not  discover hidden talents.\nSteve  does not have a new relationship bloom.\nSteve is not happy.\nSteve does not experience healing.\n\nWell, that&#39;s all sort of tricky, since we can list a million things Steve will likely NOT get.  \n\nWhat will he get?\n\nSteve feels wasted.\nSteve feels unappreciated.\n\nI will put this on my calendar for Sept 22 (end of summer).  Then I will post it back here, and we can ask Steve how his summer went.  This should be a nice little test, and good feedback for Sonny Psychic to see if they are useful to the people they advise. \n\n\n\n\n--- In EVP-ITC@yahoogroups.com, Jean Brisson &lt;sonny_mtl_can@...&gt; wrote:\n&gt;\n&gt; Hi,\n&gt; My psychic power says Steve should continue. \n&gt; Here&#39;s what I came-up with:\n&gt; If you stop for summer:\n&gt;  achievement, end.\n&gt; Unknown talents may remain hidden. You may let yourself be wasted and unappreciated. \n&gt; You can see in detail, how one and two join forces to evolve and grow. You recognize that what seemed to be blocking the one&#39;s expansion was only a process of deliberation. You take many details into account and throughly prepare to put your plans into action.\n&gt;  If you contnue through the summer I sense:\n&gt;   Support, Harmony, Celebrations, Abundance, Exuberance, CELEBRATION\n&gt; You hidden talents will be discovered.  You are a hospitable and sensitive person. This signifies blooming of a new relationship. You intuition will become clearer.\n&gt; The conclusion of any matter in plenty, perfection and merriment, happy issue, victory, fulfillmeny, solace, healing.\n&gt; More on if you continue:\n&gt;  Now the aggressive energy of the One is united with the stabilizing energy of the two. A third point allows you to get some distance and prespective on the first two. It allows you to become aware of the full potential of thier interaction. You can see in detail, how one and two join forces to evolve and grow. you recognize that what seemed to be blocking the one&#39;s expansion was only a process of deliberation. You can clearly see the whole picture. You can see that both the aggressive and stabilizing energies are needed for your ideas to be actualized. The three level is the level of clarification, refinement, and articulation. It&#39;s the level of planning. You take many details into account and throughly prepare to put your plans into action.\n&gt; \n&gt; Sonny Psychic\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; ________________________________\n&gt; From: Urkel23 &lt;urkel23@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Sun, May 23, 2010 1:31:57 PM\n&gt; Subject: [EVP-ITC] RTSC Talk Show Today at 6pm est.\n&gt; \n&gt;   \n&gt; \n&gt; I&#39;ve decided to take the summer off, so this is the final show until the fall.\n&gt; \n&gt; http://www.stevehultay.com/rtsctalkradiogolive.html\n&gt; \n&gt; Hope to see you there,\n&gt; -Steve H.\n&gt;"}