{"id": "17239", "subject": "Re: [EVP-ITC] Intro", "author": "Frank Sumption", "timestamp": "2010-05-26T20:04:24Z", "full_text": "Welcome Fiona!\n\n Personally, I dopn&#39;t believe in hainted hot spots, or portals. I think the\nspirits and entities exist ina higher demension, and so have full access to\nus and our speace, with virtually no linmitations.\n\n I don&#39;t go to hanunted areas to record, or test boxes, I do it from home\nand have no shortage of contacts.\n\n Paranormal activity is whereever one expects it to be.\n\n There does seem to be conditions that limit contacts via EVP, similar to\nradio propogation, which might make it seem like activeity is spiking. From\nme, my ET contacts have about three month interval.\n\nFrank-S\n\nOn Wed, May 26, 2010 at 8:07 AM, Fiona Broome &lt;email@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Hi,\n&gt;\n&gt; I&#39;m new to this group, but not new to paranormal studies. Depending on how\n&gt; willing I am to reveal my age, I admit to between 20 and 30 years&#39; active\n&gt; research in ghost-related fields.\n&gt;\n&gt; Today, most people seem to associate me with my research to analyze &\n&gt; predict locations where paranormal activity will spike. (It&#39;s not just ley\n&gt; lines.)\n&gt;\n&gt; My goal is to refine those predictions so people can be in the right places\n&gt; at the right times, to use devices that will prove (and/or analyze) that\n&gt; something paranormal is going on.\n&gt;\n&gt; Right now, one of our big problems is not knowing where to investigate for\n&gt; the best and most consistent results, and when to have the equipment set up.\n&gt; (It&#39;s like surfing: I keep hearing people say, &quot;You should have been here\n&gt; yesterday...&quot;)\n&gt;\n&gt; Though I&#39;ve generally dismissed most EVP in the past, seeing Chris Moon&#39;s\n&gt; work at a recent event... that got my attention in a hurry.\n&gt;\n&gt; I&#39;m very interested in anything that provides a voice to whatever-it-is\n&gt; people (including me, for convenience sake) tend to call &quot;ghosts.&quot;\n&gt;\n&gt; I&#39;ve seen several not-impressive demonstrations of the Shack Hack, and then\n&gt; one that was vastly better, but it didn&#39;t make me run out and buy (or make)\n&gt; one. I may need to revisit that.\n&gt;\n&gt; I&#39;ve used an Ovilus, which seemed to work okay for me, but I haven&#39;t seen\n&gt; the same compelling results in others&#39; hands... even with the same Ovilus.\n&gt; (Then again, I don&#39;t ask questions. I&#39;ll talk to whatever-it-is,\n&gt; conversationally, but that&#39;s my limit. To me -- at least at this point -- it\n&gt; feels rather rude to demand a performance on cue.)\n&gt;\n&gt; The box that Chris Moon had... it impressed me, big time. I&#39;d like to\n&gt; understand who (or what) are talking, where they&#39;re actually talking from,\n&gt; and why they think it&#39;s important to tell us whatever they&#39;re saying.\n&gt;\n&gt; My background is art and writing, not electronics. So, I&#39;m not quite sure\n&gt; where to go from here. I can manage simple electronics tweaks, but diagrams\n&gt; are beyond me, at least for now.\n&gt;\n&gt; Anyway, that&#39;s who I am and where I am with this concept. I&#39;m delighted to\n&gt; find this group, and I can see lots of hours ahead, reading the Archives,\n&gt; etc.\n&gt;\n&gt; Cheerfully,\n&gt; Fiona Broome\n&gt;\n&gt; \n&gt;\n\nWelcome Fiona!\n \n Pe sonally, I dopn' belie e in hain ed ho spo s, o po als. I hink he spi i s and en i ies exis ina highe demension, and so ha e ull access o us and ou speace, wi h i ually no linmi a ions. \n \n I don' go o hanun ed a eas o eco d, o es boxes, I do i om home and ha e no sho age o con ac s.\n \n Pa ano mal ac i i y is whe ee e one expec s i o be. \n \n The e does seem o be condi ions ha limi con ac s ia EVP, simila o adio p opoga ion, which migh make i seem like ac i ei y is spiking. F om me, my ET con ac s ha e abou h ee mon h in e al. \n \nF ank-S\nOn Wed, May 26, 2010 a 8:07 AM, Fiona B oome email@...> w o e:\n\n  \n\n\n\nHi,I'm new o his g oup, bu no new o pa ano mal s udies. Depending on how willing I am o e eal my age, I admi o be ween 20 and 30 yea s' ac i e esea ch in ghos - ela ed ields.Today, mos people seem o associa e me wi h my esea ch o analyze & p edic loca ions whe e pa ano mal ac i i y will spike. (I 's no jus ley lines.)\nMy goal is o e ine hose p edic ions so people can be in he igh places a he igh imes, o use de ices ha will p o e (and/o analyze) ha some hing pa ano mal is going on. Righ now, one o ou big p oblems is no knowing whe e o in es iga e o he bes and mos consis en esul s, and when o ha e he equipmen se up. (I 's like su ing: I keep hea ing people say, \"You should ha e been he e yes e day...\")\nThough I' e gene ally dismissed mos EVP in he pas , seeing Ch is Moon's wo k a a ecen e en ... ha go my a en ion in a hu y. I'm e y in e es ed in any hing ha p o ides a oice o wha e e -i -is people (including me, o con enience sake) end o call \"ghos s.\" \nI' e seen se e al no -imp essi e demons a ions o he Shack Hack, and hen one ha was as ly be e , bu i didn' make me un ou and buy (o make) one. I may need o e isi ha .I' e used an O ilus, which seemed o wo k okay o me, bu I ha en' seen he same compelling esul s in o he s' hands... e en wi h he same O ilus. (Then again, I don' ask ques ions. I'll alk o wha e e -i -is, con e sa ionally, bu ha 's my limi . To me -- a leas a his poin -- i eels a he ude o demand a pe o mance on cue.)\nThe box ha Ch is Moon had... i imp essed me, big ime. I'd like o unde s and who (o wha ) a e alking, whe e hey' e ac ually alking om, and why hey hink i 's impo an o ell us wha e e hey' e saying.\nMy backg ound is a and w i ing, no elec onics. So, I'm no qui e su e whe e o go om he e. I can manage simple elec onics weaks, bu diag ams a e beyond me, a leas o now.Anyway, ha 's who I am and whe e I am wi h his concep . I'm deligh ed o ind his g oup, and I can see lo s o hou s ahead, eading he A chi es, e c.\nChee ully,Fiona B oome"}