{"id": "17249", "subject": "Re: [EVP-ITC] Intro", "author": "Aisling D&#39;Art", "timestamp": "2010-05-26T22:24:12Z", "full_text": "Hi again,\n\nFrank, thanks for the welcome.\n\nI also believe that entities (or spirits, or whatever) exist in a dimension\nfrom which they can access us across time and space... if they want to.\nSome seem to choose particular times and/or locations, but that may be\nputting the cart before the horse.\n\nI&#39;m not claiming that portals exist, per se.  Wormholes are a maybe, if\nrecent reports are accurate, but the technical reason/s why certain times\nand locations seem to attract reports of the paranormal are -- in my opinion\n-- secondary to what I&#39;m doing.\n\n(In fact, I&#39;m not even certain that ghosts exist, per se.  That&#39;s a\nconvenient term for a general set of phenomena, and it&#39;s an explanation that\nmany people prefer to use for that phenomena.  But, in scientific terms --\nsomething that can be duplicated in a lab -- we&#39;re not even close to saying,\n&quot;Those are ghosts, without a doubt.&quot;  With my readers, I try to separate the\nemotion-related issues, from hard-core scientific study.  Both are important\nwithin their respective contexts, but when people try to blur the lines\nbetween them, arguments can ensue.)\n\nI&#39;m looking for the locations (and times) with the best odds of reported\nparanormal activity, period.  Whether those patterns are caused by\nexpectations and/or preconceptions is a separate issue, and one that I hope\nwill become clearer when the patterns are.\n\nAt its simplest:  In some areas, people expect cemeteries to be haunted.\nThat&#39;s a chicken-or-the-egg issue for me: Is the cemetery (and sometimes a\nparticular grave) &quot;haunted&quot; because of expectations, or for some other\nreason?  (In most cases, that&#39;s a rhetorical question.)\n\nThe one that baffles me is that, among &quot;haunted&quot; cemeteries, about 80% of\nthe reports are about the back left corner of the cemetery, relative to the\noriginal, main gate. That&#39;s not necessarily the most popular gate or the\ncurrent main gate.\n\nMost people making reports don&#39;t know the historical layout of the\ncemeteries. That back left corner is not necessarily the oldest or most\nneglected part of the cemetery.  A pattern seems to be there, but I&#39;m not\nsure why... yet.\n\nThough I&#39;m most associated with ghost research, I don&#39;t limit the patterns\nto ghost reports.  Aliens, crypto, faeries, weird crimes, freakish\nweather... I&#39;m simply looking at anomalous patterns.  So far, when I find\none set of reports -- say, ghosts -- I often discover parallel patterns of\nUFO reports.  Since those two communities don&#39;t often swap notes, the\ncorrelations aren&#39;t always evident at first glance.\n\nBut, whether it&#39;s cultural conditioning (and expectations/preconceptions) or\nsomething else, if someone wants to test &quot;ghost detecting&quot; equipment,\nincluding EVP-related devices, they seem to get the best results in\nlocations where they (and others) expect to encounter ghosts.  So, my work\ninvolves finding those places... and sometimes related time patterns.\n\nSure, it might be nothing more than a 19th century tale that&#39;s making a\ncomeback among fifth graders, and now that old location is experiencing\nearly stages of a surge in ghost reports.  Expectations are high, and so are\nthe number of reports.\n\nIt might also be placebo effect from my own work.  I publicly say a spot is\ngoing to start reporting ghosts, and -- sure enough -- weird phenomena are\nreported.  That&#39;s where measuring devices may weed out some contagion of\nsuggestion, but even with those devices, there&#39;s a question of the power of\nthe observer. (The suggestions in the book &quot;Conjuring Up Philip&quot; are\nimportant, and may relate to quantum-observer studies.  I think we&#39;re more\nat the phase of developing good questions and the tools that may improve\nthem, than finding certain answers.)\n\nTime factors seem to have more variables than geographical patterns.  (For\nthat reason, a lot of my current work focuses on geographical links.)  Sure,\non the anniversary of a particular battle, a lot of people report &quot;ghostly&quot;\nphenomena at that location. However, in that context, we&#39;re far from being\nable to separate expectations (and sheer numbers of observers) from\npotential energy spikes.\n\nI also believe that people who want to communicate with whatever-it-is...\nwell, that can be accomplished just as well at home.  In the dowsing (for\nwater, etc.) community, many people can work as well at home with a pendulum\n(or rods) and a map, as they do on-site.  That doesn&#39;t seem at all weird to\nme, particularly if time and space are perceptions and merely some harmonic\nof filing systems, suited to our particular universe/reality.\n\nIt makes equal sense that, at home, you&#39;d have an abundance of entities\ncommunicating through any device.\n\nWhat would interest me is if more voices, or more particular kinds of\nentities, come through at a particular time or place, if all other variables\nare relatively consistent.\n\nFrank, your three-month intervals related to ET contacts... they interest\nme.\n\nIf I see anything related in my pattern studies, I&#39;ll let you know.  Of\ncourse, there are the six-month spikes at the end of October and at the and\nof April, but those are so deeply, culturally ingrained expectations, I&#39;m\nback at chicken-or-the-egg.\n\nOkay, this turned into a far longer reply than I had in mind. And, it\nreveals far more of my geeky nature than I usually display in public.\n\nFor me, this is a nagging puzzle... and a fascinating one.\n\nCheerfully,\nFiona\n\n\n\nOn Wed, May 26, 2010 at 4:04 PM, Frank Sumption\n&lt;purplealiengirl@...&gt;wrote:\n\n&gt;\n&gt;\n&gt; Welcome Fiona!\n&gt;\n&gt;  Personally, I dopn&#39;t believe in hainted hot spots, or portals. I think the\n&gt; spirits and entities exist ina higher demension, and so have full access to\n&gt; us and our speace, with virtually no linmitations.\n&gt;\n&gt;  I don&#39;t go to hanunted areas to record, or test boxes, I do it from home\n&gt; and have no shortage of contacts.\n&gt;\n&gt;  Paranormal activity is whereever one expects it to be.\n&gt;\n&gt;  There does seem to be conditions that limit contacts via EVP, similar to\n&gt; radio propogation, which might make it seem like activeity is spiking. From\n&gt; me, my ET contacts have about three month interval.\n&gt;\n&gt; Frank-S\n&gt;\n&gt;\n&gt;\n\nHi again,F ank, hanks o he welcome.  I also belie e ha en i ies (o spi i s, o wha e e ) exis in a dimension om which hey can access us ac oss ime and space... i hey wan o.  Some seem o choose pa icula imes and/o loca ions, bu ha may be pu ing he ca be o e he ho se.\n\nI'm no claiming ha po als exis , pe se.  Wo mholes a e a maybe, i ecen epo s a e accu a e, bu he echnical eason/s why ce ain imes and loca ions seem o a ac epo s o he pa ano mal a e -- in my opinion -- seconda y o wha I'm doing.\n\n(In ac , I'm no e en ce ain ha ghos s exis , pe se.  Tha 's a con enien e m o a gene al se o phenomena, and i 's an explana ion ha many people p e e o use o ha phenomena.  Bu , in scien i ic e ms -- some hing ha can be duplica ed in a lab -- we' e no e en close o saying, \"Those a e ghos s, wi hou a doub .\"  Wi h my eade s, I y o sepa a e he emo ion- ela ed issues, om ha d-co e scien i ic s udy.  Bo h a e impo an wi hin hei espec i e con ex s, bu when people y o blu he lines be ween hem, a gumen s can ensue.)\n\nI'm looking o he loca ions (and imes) wi h he bes odds o epo ed pa ano mal ac i i y, pe iod.  Whe he hose pa e ns a e caused by expec a ions and/o p econcep ions is a sepa a e issue, and one ha I hope will become clea e when he pa e ns a e.\n\nA i s simples :  In some a eas, people expec ceme e ies o be haun ed.  Tha 's a chicken-o - he-egg issue o me: Is he ceme e y (and some imes a pa icula g a e) \"haun ed\" because o expec a ions, o o some o he eason?  (In mos cases, ha 's a he o ical ques ion.)\n\nThe one ha ba les me is ha , among \"haun ed\" ceme e ies, abou 80% o he epo s a e abou he back le co ne o he ceme e y, ela i e o he o iginal, main ga e. Tha 's no necessa ily he mos popula ga e o he cu en main ga e.  \n\nMos people making epo s don' know he his o ical layou o he ceme e ies. Tha back le co ne is no necessa ily he oldes o mos neglec ed pa o he ceme e y.  A pa e n seems o be he e, bu I'm no su e why... ye .\n\nThough I'm mos associa ed wi h ghos esea ch, I don' limi he pa e ns o ghos epo s.  Aliens, c yp o, ae ies, wei d c imes, eakish wea he ... I'm simply looking a anomalous pa e ns.  So a , when I ind one se o epo s -- say, ghos s -- I o en disco e pa allel pa e ns o UFO epo s.  Since hose wo communi ies don' o en swap no es, he co ela ions a en' always e iden a i s glance.\n\nBu , whe he i 's cul u al condi ioning (and expec a ions/p econcep ions) o some hing else, i someone wan s o es \"ghos de ec ing\" equipmen , including EVP- ela ed de ices, hey seem o ge he bes esul s in loca ions whe e hey (and o he s) expec o encoun e ghos s.  So, my wo k in ol es inding hose places... and some imes ela ed ime pa e ns.\n\nSu e, i migh be no hing mo e han a 19 h cen u y ale ha 's making a comeback among i h g ade s, and now ha old loca ion is expe iencing ea ly s ages o a su ge in ghos epo s.  Expec a ions a e high, and so a e he numbe o epo s.\n\nI migh also be placebo e ec om my own wo k.  I publicly say a spo is going o s a epo ing ghos s, and -- su e enough -- wei d phenomena a e epo ed.  Tha 's whe e measu ing de ices may weed ou some con agion o sugges ion, bu e en wi h hose de ices, he e's a ques ion o he powe o he obse e . (The sugges ions in he book \"Conju ing Up Philip\" a e impo an , and may ela e o quan um-obse e s udies.  I hink we' e mo e a he phase o de eloping good ques ions and he ools ha may imp o e hem, han inding ce ain answe s.)\n\nTime ac o s seem o ha e mo e a iables han geog aphical pa e ns.  (Fo ha eason, a lo o my cu en wo k ocuses on geog aphical links.)  Su e, on he anni e sa y o a pa icula ba le, a lo o people epo \"ghos ly\" phenomena a ha loca ion. Howe e , in ha con ex , we' e a om being able o sepa a e expec a ions (and shee numbe s o obse e s) om po en ial ene gy spikes.\n\nI also belie e ha people who wan o communica e wi h wha e e -i -is... well, ha can be accomplished jus as well a home.  In he dowsing ( o wa e , e c.) communi y, many people can wo k as well a home wi h a pendulum (o ods) and a map, as hey do on-si e.  Tha doesn' seem a all wei d o me, pa icula ly i ime and space a e pe cep ions and me ely some ha monic o iling sys ems, sui ed o ou pa icula uni e se/ eali y.\n\nI makes equal sense ha , a home, you'd ha e an abundance o en i ies communica ing h ough any de ice.  Wha would in e es me is i mo e oices, o mo e pa icula kinds o en i ies, come h ough a a pa icula ime o place, i all o he a iables a e ela i ely consis en .\n\nF ank, you h ee-mon h in e als ela ed o ET con ac s... hey in e es me.  I I see any hing ela ed in my pa e n s udies, I'll le you know.  O cou se, he e a e he six-mon h spikes a he end o Oc obe and a he and o Ap il, bu hose a e so deeply, cul u ally ing ained expec a ions, I'm back a chicken-o - he-egg.\n\nOkay, his u ned in o a a longe eply han I had in mind. And, i e eals a mo e o my geeky na u e han I usually display in public.Fo me, his is a nagging puzzle... and a ascina ing one.Chee ully,\n\nFionaOn Wed, May 26, 2010 a 4:04 PM, F ank Sump ion pu plealiengi l@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n Welcome Fiona!\n \n Pe sonally, I dopn' belie e in hain ed ho spo s, o po als. I hink he spi i s and en i ies exis ina highe demension, and so ha e ull access o us and ou speace, wi h i ually no linmi a ions. \n \n I don' go o hanun ed a eas o eco d, o es boxes, I do i om home and ha e no sho age o con ac s.\n \n Pa ano mal ac i i y is whe ee e one expec s i o be. \n \n The e does seem o be condi ions ha limi con ac s ia EVP, simila o adio p opoga ion, which migh make i seem like ac i ei y is spiking. F om me, my ET con ac s ha e abou h ee mon h in e al. \n \nF ank-S#a g_ls_inline_popup { posi ion:absolu e; z-index:9999; padding: 0px 0px; ma gin-le : 0px; ma gin- op: 0px; wid h: 240px; o e low: hidden; wo d-w ap: b eak-wo d; colo : black; on -size: 10px; ex -align: le ; line-heigh : 13px;}"}