{"id": "17259", "subject": "Re: [EVP-ITC] more suggestions?", "author": "Frank Sumption", "timestamp": "2010-05-27T01:46:53Z", "full_text": "Seriously, it seems ok for some to call the rest of us delusional, but how\ndare I, or anyone speak up. When I do, I&#39;m the evil bastard.\n\n F-S\n\nOn Wed, May 26, 2010 at 6:07 PM, Lizzie Broden &lt;yahuli69@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;  No not at all.  I am here to see if there is any truth to any of this.\n&gt; Nothing more and nothing less.\n&gt;\n&gt; What we inevitable get from you is insults, whining, bitching and woe is\n&gt; me.\n&gt;\n&gt; The world is not out to get you Frank.  Stop with the crap and grow a\n&gt; pair.  Stop with the generalizations and absolute thinking.  If you want to\n&gt; make this into a religion then so be it, but don&#39;t kick the rest of us that\n&gt; want to look at things objectively.  You are only making yourself look like\n&gt; an ass!\n&gt;\n&gt;\n&gt; &quot;Nature is showing us only the tail of the lion, but I have no doubt that\n&gt; the lion belongs to it even though, because of its large size, it cannot\n&gt; totally reveal itself all at once.&quot;\n&gt; -— Albert Einstein\n&gt;\n&gt;\n&gt; &quot;It is far better to grasp the universe as it really is than to persist in\n&gt; delusions, however satisfying and reassuring.&quot;\n&gt; --Carl Sagan\n&gt;\n&gt;\n&gt;  &quot;There is no such thing as an insignificant detail. Don&#39;t just look\n&gt; for what you want to find.&quot;\n&gt; -- Me LOL\n&gt;\n&gt;\n&gt;  ------------------------------\n&gt; *From:* Frank Sumption &lt;purplealiengirl@...&gt;\n&gt; *To:* EVP-ITC@yahoogroups.com\n&gt; *Sent:* Wed, May 26, 2010 6:24:08 PM\n&gt;\n&gt; *Subject:* Re: [EVP-ITC] more suggestions?\n&gt;\n&gt;\n&gt;\n&gt;  So if there&#39;s nothing to the boxes why the hell do you hang on these\n&gt; groups? To feel smarter than everyone!?\n&gt;\n&gt; On Wed, May 26, 2010 at 5:20 PM, Lizzie Broden &lt;yahuli69@yahoo. com&lt;yahuli69@...&gt;\n&gt; &gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;   Because you are an egotistical know it all that lives in a shallow and\n&gt;&gt; fragile little world that can&#39;t take constructive criticism and viciously\n&gt;&gt; attacks anyone that questions your theories?  It can&#39;t be all hogwash\n&gt;&gt; because you might have an emotional investment in this, right?  So you go\n&gt;&gt; after anyone of opposition with the full fury of a raving lunatic?\n&gt;&gt;\n&gt;&gt; That is what I am reading, but carry on.  Keep digging the hole.\n&gt;&gt;\n&gt;&gt; If there is truth to any of this, then lets see it.  At this point I am\n&gt;&gt; real close to telling you where you can stick your damn box!\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; &quot;Nature is showing us only the tail of the lion, but I have no doubt that\n&gt;&gt; the lion belongs to it even though, because of its large size, it cannot\n&gt;&gt; totally reveal itself all at once.&quot;\n&gt;&gt; -— Albert Einstein\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; &quot;It is far better to grasp the universe as it really is than to persist in\n&gt;&gt; delusions, however satisfying and reassuring.&quot;\n&gt;&gt; --Carl Sagan\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; &quot;There is no such thing as an insignificant detail. Don&#39;t just look\n&gt;&gt; for what you want to find.&quot;\n&gt;&gt; -- Me LOL\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;  ------------------------------\n&gt;&gt; *From:* Frank Sumption &lt;purplealiengirl@ gmail.com&lt;purplealiengirl@...&gt;\n&gt;&gt; &gt;\n&gt;&gt; *To:* EVP-ITC@yahoogroups .com &lt;EVP-ITC@yahoogroups.com&gt;\n&gt;&gt; *Sent:* Wed, May 26, 2010 5:34:57 PM\n&gt;&gt; *Subject:* Re: [EVP-ITC] more suggestions?\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;  I&#39;m just sayin&#39;--there are a very few that act like all is known and can\n&gt;&gt; all be expelaned away. It&#39;s those few that make comments back and forth,\n&gt;&gt; between themselves implying that all this is foolishness, and they know so\n&gt;&gt; much better. I don&#39;t know why why, but that stuff really chaps my hide!\n&gt;&gt;\n&gt;&gt;  I know for a fact that some of the voices out of the box, and other\n&gt;&gt; methods are imagination, as they tend to change from day to as perceptions\n&gt;&gt; shift. I have stuff form ten years ago that sound the same, and I aslo have\n&gt;&gt; tapes from the first boxes that talk about what&#39;s going on now. I have some\n&gt;&gt; voice segments for m years ago that are also gibberish and noise.\n&gt;&gt;\n&gt;&gt;  I don&#39;t need some duffus telling me how I fool myself.\n&gt;&gt;\n&gt;&gt;  F-S\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;\n&gt;  \n&gt;\n\nSe iously, i seems ok o some o call he es o us delusional, bu how da e I, o anyone speak up. When I do, I'm he e il bas a d. \n \n F-S\nOn Wed, May 26, 2010 a 6:07 PM, Lizzie B oden yahuli69@...> w o e:\n\n  \n\n\n\n\n\n\nNo no a all.  I am he e o see i he e is any u h o any o his.  No hing mo e and no hing less.  \n \nWha we ine i able ge om you is insul s, whining, bi ching and woe is me.\n \nThe wo ld is no ou o ge you F ank.  S op wi h he c ap and g ow a pai .  S op wi h he gene aliza ions and absolu e hinking.  I you wan o make his in o a eligion hen so be i , bu don' kick he es o us ha wan o look a hings objec i ely.  You a e only making you sel look like an ass!\n\n\n \"Na u e is showing us only he ail o he lion, bu I ha e no doub ha he lion belongs o i e en hough, because o i s la ge size, i canno o ally e eal i sel all a once.\" -— Albe Eins ein \n\n\"I is a be e o g asp he uni e se as i eally is han o pe sis in delusions, howe e sa is ying and eassu ing.\"--Ca l Sagan\n\n\"The e is no such hing as an insigni ican de ail. Don' jus look o wha you wan o ind.\"-- Me LOL \n\n\n\n\n\nF om: F ank Sump ion pu plealiengi l@...>To: EVP-ITC@yahoog oups.com\nSen : Wed, May 26, 2010 6:24:08 PM \nSubjec : Re: [EVP-ITC] mo e sugges ions?\n  \n\n So i he e's no hing o he boxes why he hell do you hang on hese g oups? To eel sma e han e e yone!?\nOn Wed, May 26, 2010 a 5:20 PM, Lizzie B oden yahuli69@yahoo. com> w o e:\n\n  \n\n\n\n\n\n\n\nBecause you a e an ego is ical know i all ha li es in a shallow and agile li le wo ld ha can' ake cons uc i e c i icism and iciously a acks anyone ha ques ions you   heo ies?  I can' be all hogwash because you migh ha e an emo ional in es men in his, igh ?  So you go a e anyone o opposi ion wi h he ull u y o a a ing luna ic?  \n\n \nTha is wha I am  eading, bu ca y on.  Keep digging he hole.\n \nI he e is u h o any o his, hen le s see i .  A his poin I am eal close o elling you whe e you can s ick you  damn box! \"Na u e is showing us only he ail o he lion, bu I ha e no doub ha he lion belongs o i e en hough, because o i s la ge size, i canno o ally e eal i sel all a once.\" \n-— Albe Eins ein \n\n\"I is a be e o g asp he uni e se as i eally is han o pe sis in delusions, howe e sa is ying and eassu ing.\"--Ca l Sagan\n\"The e is no such hing as an insigni ican de ail. Don' jus look o wha you wan o ind.\"-- Me LOL \n\n\n\n\n\nF om: F ank Sump ion pu plealiengi l@ gmail.com>To: EVP-ITC@yahoog oups .com\nSen : Wed, May 26, 2010 5:34:57 PMSubjec : Re: [EVP-ITC] mo e sugges ions?\n\n\n  \n\n\n I'm jus sayin'-- he e a e a e y ew ha ac like all is known and can all be expelaned away. I 's hose ew ha make commen s back and o h, be ween hemsel es implying ha all his is oolishness, and hey know so much be e . I don' know why why, bu ha s u eally chaps my hide!\n\n \n I know o a ac ha some o he oices ou o he box, and o he me hods a e imagina ion, as hey end o change om day o as pe cep ions shi . I ha e s u o m en yea s ago ha sound he same, and I aslo ha e apes om he i s boxes ha alk abou wha 's going on now. I ha e some oice segmen s o m yea s ago ha a e also gibbe ish and noise. \n\n \n I don' need some du us elling me how I ool mysel . \n \n F-S"}