{"id": "17253", "subject": "Re: [EVP-ITC] more suggestions?", "author": "April Abercrombie", "timestamp": "2010-05-26T22:49:08Z", "full_text": "I don&#39;t comment on your stuff anymore because this is what we get when I do.\nSo unless you ask me personally for my opinion, I will keep it to myself.\n\nOn Wed, May 26, 2010 at 4:38 PM, Frank Sumption\n&lt;purplealiengirl@...m&gt;wrote:\n\n&gt;\n&gt;\n&gt;  Yeah, and here is the same old crapola. Present stuff for consideration\n&gt; and not one freaking comment on that, always sidetracked on how acceptable\n&gt; other junk is, or who siad what, or who is pissed off today.\n&gt;\n&gt;  Always I have to aks, why bother!? I guess so the debunker skepdicks don&#39;t\n&gt; get their way,\n&gt;\n&gt;  F-S\n&gt;\n&gt; On Wed, May 26, 2010 at 4:34 PM, Frank Sumption &lt;purplealiengirl@...\n&gt; &gt; wrote:\n&gt;\n&gt;&gt;  I&#39;m just sayin&#39;--there are a very few that act like all is known and can\n&gt;&gt; all be expelaned away. It&#39;s those few that make comments back and forth,\n&gt;&gt; between themselves implying that all this is foolishness, and they know so\n&gt;&gt; much better. I don&#39;t know why why, but that stuff really chaps my hide!\n&gt;&gt;\n&gt;&gt;  I know for a fact that some of the voices out of the box, and other\n&gt;&gt; methods are imagination, as they tend to change from day to as perceptions\n&gt;&gt; shift. I have stuff form ten years ago that sound the same, and I aslo have\n&gt;&gt; tapes from the first boxes that talk about what&#39;s going on now. I have some\n&gt;&gt; voice segments for m years ago that are also gibberish and noise.\n&gt;&gt;\n&gt;&gt;  I don&#39;t need some duffus telling me how I fool myself.\n&gt;&gt;\n&gt;&gt;  F-S\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;\n&gt;  \n&gt;\n\nI don' commen on you s u anymo e because his is wha we ge when I do. So unless you ask me pe sonally o my opinion, I will keep i o mysel .On Wed, May 26, 2010 a 4:38 PM, F ank Sump ion pu plealiengi l@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n  Yeah, and he e is he same old c apola. P esen s u o conside a ion and no one eaking commen on ha , always side acked on how accep able o he junk is, o who siad wha , o who is pissed o oday. \n\n \n Always I ha e o aks, why bo he !? I guess so he debunke skepdicks don' ge hei way,\n \n F-S\nOn Wed, May 26, 2010 a 4:34 PM, F ank Sump ion pu plealiengi l@...> w o e:\n\n I'm jus sayin'-- he e a e a e y ew ha ac like all is known and can all be expelaned away. I 's hose ew ha make commen s back and o h, be ween hemsel es implying ha all his is oolishness, and hey know so much be e . I don' know why why, bu ha s u eally chaps my hide!\n\n\n \n I know o a ac ha some o he oices ou o he box, and o he me hods a e imagina ion, as hey end o change om day o as pe cep ions shi . I ha e s u o m en yea s ago ha sound he same, and I aslo ha e apes om he i s boxes ha alk abou wha 's going on now. I ha e some oice segmen s o m yea s ago ha a e also gibbe ish and noise. \n\n\n \n I don' need some du us elling me how I ool mysel . \n \n F-S"}