{"id": "17265", "subject": "Re: [EVP-ITC] Re: Anoither changed tape?", "author": "Zack Widup", "timestamp": "2010-05-27T02:14:18Z", "full_text": "P.S. Schrodinger&#39;s cat is dead.\n:-)\n\nOn Wed, May 26, 2010 at 9:08 PM, Zack Widup &lt;w9sz.zack@...&gt; wrote:\n\n&gt; I have had that thought and have had a couple instances where that might be\n&gt; true. But I have a lot of evidence that contradicts that, too.\n&gt;\n&gt; I like to make recordings in all sorts of places, some supposedly haunted,\n&gt; some not supposedly haunted, some have no reason to be haunted (like a\n&gt; brand-new shopping mall) and the responses or lack of them is totally\n&gt; unpredictable.\n&gt;\n&gt; I&#39;ve been in several of the supposedly most haunted cemeteries in Illinois\n&gt; many times, day and night, and recorded several hours of audio in them,\n&gt; asking questions that might get an EVP response. In some I got nothing.\n&gt; Other cemeteries that were supposedly haunted got some responses. A lot of\n&gt; other places (old and new buildings, etc.) also seemed to get a few EVP\n&gt; responses occasionally and at other times nothing.\n&gt;\n&gt; So all I can say is that what happens, happens. I can&#39;t predict it. This\n&gt; observer in particular doesn&#39;t seem to have a lot to do with the presence or\n&gt; lack of responses and what those responses will be.\n&gt; Zack\n&gt;\n&gt;\n&gt; On Wed, May 26, 2010 at 3:28 PM, Frank Sumption &lt;purplealiengirl@...\n&gt; &gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt; So why spend time ghost huntig if you think there&#39;s nothign to it? And- I\n&gt; think expectations can create/allow the conditions you want to experience or\n&gt; investigate. You want to get EVP, but you want to be able to explain it\n&gt; away. Too Freudian perhaps?\n&gt;\n&gt;  I am pretty sure all this paranormal business operates on the quantum\n&gt; level, you can&#39;t seperate the events from the observer. All one can really\n&gt; do on this level is participate.\n&gt;\n&gt;  F-S\n&gt;\n\nP.S. Sch odinge 's ca is dead.\n:-)\nOn Wed, May 26, 2010 a 9:08 PM, Zack Widup w9sz.zack@...> w o e:\n\nI ha e had ha hough and ha e had a couple ins ances whe e ha migh be ue. Bu I ha e a lo o e idence ha con adic s ha , oo.\n \nI like o make eco dings in all so s o places, some supposedly haun ed, some no supposedly haun ed, some ha e no eason o be haun ed (like a b and-new shopping mall) and he esponses o lack o hem is o ally unp edic able. \n\n \nI' e been in se e al o he supposedly mos haun ed ceme e ies in Illinois many imes, day and nigh , and eco ded se e al hou s o audio in hem, asking ques ions ha migh ge an EVP esponse. In some I go no hing. O he ceme e ies ha we e supposedly haun ed go some esponses. A lo o o he places (old and new buildings, e c.) also seemed o ge a ew EVP esponses occasionally and a o he imes no hing.\n\n \nSo all I can say is ha wha happens, happens. I can' p edic i . This obse e in pa icula  doesn' seem o ha e a lo o do wi h he p esence o lack o esponses and wha hose esponses will be.\n\nZack\n\n\n\n \nOn Wed, May 26, 2010 a 3:28 PM, F ank Sump ion pu plealiengi l@...> w o e:\n\n \nSo why spend ime ghos hun ig i you hink he e's no hign o i ? And- I hink expec a ions can c ea e/allow he condi ions you wan o expe ience o in es iga e. You wan o ge EVP, bu you wan o be able o explain i away. Too F eudian pe haps? \n  I am p e y su e all his pa ano mal business ope a es on he quan um le el, you can' sepe a e he e en s om he obse e . All one can eally do on his le el is pa icipa e.  F-S"}