{"id": "17294", "subject": "Re: [EVP-ITC] Re: more suggestions?", "author": "April Abercrombie", "timestamp": "2010-05-27T15:10:17Z", "full_text": "We&#39;re not trying to silence anything. On the contrary science is always\nasking &quot;what if&quot; then it attempts to see if &quot;what if&quot; is in the realm of\npossibility.\n\nOn Thu, May 27, 2010 at 8:53 AM, Fiona Broome &lt;email@fionabroome.com&gt; wrote:\n\n&gt;\n&gt;\n&gt; Hi,\n&gt;\n&gt; At this stage, a lot of paranormal research seems to be in the &quot;hmm...&quot; and\n&gt; &quot;what if..?&quot; areas. I like that. It keeps things interesting.\n&gt;\n&gt; Trying to silence those with data and results to share... to me, that seems\n&gt; counterproductive.\n&gt;\n&gt; Many of my best discoveries were reached by overcoming my own closed-minded\n&gt; approach to the research.\n&gt;\n&gt; I&#39;m new here, so I&#39;m very dazzled by what Frank is sharing, and the amount\n&gt; of information I&#39;m seeing in this group&#39;s Archives. Also, I&#39;m a little\n&gt; chagrined that I&#39;d previously heard so little about the box, and what I had\n&gt; heard... well, it didn&#39;t encourage me to explore the subject.\n&gt;\n&gt; But, that&#39;s my point: Demanding personal proof and/or trying to silence\n&gt; speculation, data and results... I&#39;m not seeing an up side to that kind of\n&gt; effort.\n&gt;\n&gt; Baffled,\n&gt; Fiona\n&gt;\n&gt;  \n&gt;\n\nWe' e no ying o silence any hing. On he con a y science is always asking \"wha i \" hen i a emp s o see i \"wha i \" is in he ealm o possibili y.On Thu, May 27, 2010 a 8:53 AM, Fiona B oome email@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n Hi,\n\nA his s age, a lo o pa ano mal esea ch seems o be in he \"hmm...\" and \"wha i ..?\" a eas. I like ha . I keeps hings in e es ing.\n\nT ying o silence hose wi h da a and esul s o sha e... o me, ha seems coun e p oduc i e.\n\nMany o my bes disco e ies we e eached by o e coming my own closed-minded app oach o he esea ch. \n\nI'm new he e, so I'm e y dazzled by wha F ank is sha ing, and he amoun o in o ma ion I'm seeing in his g oup's A chi es. Also, I'm a li le chag ined ha I'd p e iously hea d so li le abou he box, and wha I had hea d... well, i didn' encou age me o explo e he subjec .\n\n\nBu , ha 's my poin : Demanding pe sonal p oo and/o ying o silence specula ion, da a and esul s... I'm no seeing an up side o ha kind o e o .\n\nBa led,\nFiona"}