{"id": "17315", "subject": "Re: [EVP-ITC] Get Out Your Ghost Boxes", "author": "Zack Widup", "timestamp": "2010-05-27T17:56:52Z", "full_text": "Get on VHF SSB/CW too. Aurora propagation is a lot of fun!\n\nZack\n\nOn Thu, May 27, 2010 at 11:05 AM, Frank Sumption\n&lt;purplealiengirl@...&gt;wrote:\n\n&gt;\n&gt;\n&gt;  I really need to get he ham statuion set back up.\n&gt;\n&gt;  f-S\n&gt;\n&gt;  On Thu, May 27, 2010 at 9:06 AM, mllejade &lt;leongbabe@...&gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; On May 27th or May 28th, the CME, Solar Flare is expected to hit Earth in\n&gt;&gt; a glancing blow. It could spark geomagnetic storms and will most likely\n&gt;&gt; affect cell phones, radios, and the bioelectric fields around the human body\n&gt;&gt; creating an energetic shift which will be felt differently depending on ones\n&gt;&gt; energetic signature. Some will be agitated some will feel very lethargic and\n&gt;&gt; many go up and down between the two.\n&gt;&gt;\n&gt;&gt; Additionally, the moon is waxing, at its fullest at 4:07 pm PDT today, May\n&gt;&gt; 27, but expect its effects to last for at least 24 hours after its peak.\n&gt;&gt;\n&gt;&gt; http://spaceweather.com/\n&gt;&gt;\n&gt;&gt; Sharon from SF\n&gt;&gt;\n&gt;&gt;\n&gt;  \n&gt;\n\nGe on VHF SSB/CW  oo. Au o a p opaga ion is a lo o un!\n \nZack\nOn Thu, May 27, 2010 a 11:05 AM, F ank Sump ion pu plealiengi l@...> w o e:\n\n  \n\n\n\n\n I eally need o ge he ham s a uion se back up. \n \n  -S\n\nOn Thu, May 27, 2010 a 9:06 AM, mllejade leongbabe@...> w o e:\n\n  \n\n\n\nOn May 27 h o May 28 h, he CME, Sola Fla e is expec ed o hi Ea h in a glancing blow. I could spa k geomagne ic s o ms and will mos likely a ec cell phones, adios, and he bioelec ic ields a ound he human body c ea ing an ene ge ic shi which will be el di e en ly depending on ones ene ge ic signa u e. Some will be agi a ed some will eel e y le ha gic and many go up and down be ween he wo.\nAddi ionally, he moon is waxing, a i s ulles a 4:07 pm PDT oday, May 27, bu expec i s e ec s o las o a leas 24 hou s a e i s peak.h p://spacewea he .com/\nSha on om SF"}