{"id": "17329", "subject": "Re: [EVP-ITC] Re: Tesing-testing", "author": "Frank Sumption", "timestamp": "2010-05-27T21:51:01Z", "full_text": "So does that mean there was a possiblity of a something event on May 7th?\nGot anything for June 17th, or 22nd?\n\n Frank-S\n\nOn Thu, May 27, 2010 at 1:19 PM, Fiona Broome &lt;email@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Hi,\n&gt;\n&gt; Well, I&#39;ll still be hoping... and watching things like composite Z-scores\n&gt; at the EGG project. After all, the dates could refer to something in their\n&gt; world, not ours, but still show up here as energy anomalies... if we know\n&gt; where to look.\n&gt;\n&gt; Checking last year&#39;s EGG composite numbers, I see a notable drop between\n&gt; August 14th (7 spikes) and 15th (7 spikes), and the 16th (4 spikes) and the\n&gt; 17th (3 spikes).\n&gt;\n&gt; That doesn&#39;t mean anything, of course, but it&#39;s something that I check now\n&gt; & then. (I&#39;d have a better sense of the significance if August&#39;s monthly\n&gt; graph was available, but that file is showing no data right now.)\n&gt;\n&gt; On May 7th of this year, there was a significant dip (6 spikes on the 6th,\n&gt; 2 on the 7th, then 6 on the 8th). But, it was one of three similar dips this\n&gt; month. I&#39;m not sure that they correlate to anything geopolitical.\n&gt;\n&gt; There may come a time when the puzzle pieces fit together. Until then, I\n&gt; feel a little color-blind trying to figure which piece goes where, and which\n&gt; aren&#39;t even part of the puzzle I&#39;m studying!\n&gt;\n&gt; Cheerfully,\n&gt; Fiona\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Frank Sumption\n&gt; &lt;purplealiengirl@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; I&#39;ve gotten dates before, and nothing happens. It&#39;s a non-specific\n&gt; &gt; rpediction, so it doesn&#39;t mean much. We had August 15th last year,\n&gt; nothing,\n&gt; &gt; and I had May 7th, this year, nothin&#39;. someday something will happen on\n&gt; one\n&gt; &gt; of these dates and we&#39;ll have our proof ;-0\n&gt; &gt;\n&gt; &gt; F-S\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nSo does ha mean he e was a possibli y o a some hing e en on May 7 h? Go any hing o June 17 h, o 22nd?\n \n F ank-S\nOn Thu, May 27, 2010 a 1:19 PM, Fiona B oome email@...> w o e:\n\n  \n\n\n\nHi,Well, I'll s ill be hoping... and wa ching hings like composi e Z-sco es a he EGG p ojec . A e all, he da es could e e o some hing in hei wo ld, no ou s, bu s ill show up he e as ene gy anomalies... i we know whe e o look.\nChecking las yea 's EGG composi e numbe s, I see a no able d op be ween Augus 14 h (7 spikes) and 15 h (7 spikes), and he 16 h (4 spikes) and he 17 h (3 spikes).Tha doesn' mean any hing, o cou se, bu i 's some hing ha I check now & hen. (I'd ha e a be e sense o he signi icance i Augus 's mon hly g aph was a ailable, bu ha ile is showing no da a igh now.)\nOn May 7 h o his yea , he e was a signi ican dip (6 spikes on he 6 h, 2 on he 7 h, hen 6 on he 8 h). Bu , i was one o h ee simila dips his mon h. I'm no su e ha hey co ela e o any hing geopoli ical.\nThe e may come a ime when he puzzle pieces i oge he . Un il hen, I eel a li le colo -blind ying o igu e which piece goes whe e, and which a en' e en pa o he puzzle I'm s udying!Chee ully,\nFiona \n--- In EVP-ITC@yahoog oups.com, F ank Sump ion w o e:>> I' e go en da es be o e, and no hing happens. I 's a non-speci ic\n> pedic ion, so i doesn' mean much. We had Augus 15 h las yea , no hing,> and I had May 7 h, his yea , no hin'. someday some hing will happen on one> o hese da es and we'll ha e ou p oo ;-0\n> > F-S>"}