{"id": "17326", "subject": "Re: [EVP-ITC] more suggestions?", "author": "Frank Sumption", "timestamp": "2010-05-27T21:42:27Z", "full_text": "More than enough to show any one in the world that reads these posts how\n100% unreasonable, unyielding, and ignorant these self proclaimed skeptics\ntruly are. They expect all of us to buy their version of what EVP and the\nparanormal really is, all imagination, and anyone that disagrees gets\nattacked. Time and time again the three here side steped the issue that they\ncompletely ignore all evidence, and all expereince of just about anyone else\non the this group. Intead over an over imply it&#39;s all imiagination and\ndelusion, and only they are smart enough to decern the truth.\n\n The follwing is right off he home page. I don&#39;t rmember when I started thsi\ngroup, buyt htis has benn a couple years or so.\n\n\n&quot;\nTry not to get too religious, some discussion will be tolerated as long as\nno one is offended. There is a &quot;banned&quot; button for those that get too\nobnoxious. I don&#39;t mind a good argument as long as it&#39;s not taken too\nserious, and people get pissed off, or hurt feelings. Try to be considerate\nof others! *If I detect attempts at debunking, I&#39;ll ban immediately! It&#39;s\none thing to be skeptical, it&#39;s another to ignore and deny all evidence.* &quot;\n\n Ignore and deny is excatly what these three skeptics are doing.\n\n F-S\n\nMo e han enough o show any one in he wo ld ha eads hese pos s how 100% un easonable, unyielding, and igno an hese sel p oclaimed skep ics uly a e. They expec all o us o buy hei e sion o wha EVP and he pa ano mal eally is, all imagina ion, and anyone ha disag ees ge s a acked. Time and ime again he h ee he e side s eped he issue ha hey comple ely igno e all e idence, and all expe eince o jus abou anyone else on he his g oup. In ead o e an o e imply i 's all imiagina ion and delusion, and only hey a e sma enough o dece n he u h. \n\n \n The ollwing is igh o he home page. I don' membe when I s a ed hsi g oup, buy h is has benn a couple yea s o so. \n \n \n\"T y no o ge oo eligious, some discussion will be ole a ed as long as no one is o ended. The e is a \"banned\" bu on o hose ha ge oo obnoxious. I don' mind a good a gumen as long as i 's no aken oo se ious, and people ge pissed o , o hu eelings. T y o be conside a e o o he s! I I de ec a emp s a debunking, I'll ban immedia ely! I 's one hing o be skep ical, i 's ano he o igno e and deny all e idence. \"\n\n \n Igno e and deny is exca ly wha hese h ee skep ics a e doing. \n \n F-S"}