{"id": "17331", "subject": "Re: [EVP-ITC] more suggestions?", "author": "Rj", "timestamp": "2010-05-27T22:02:43Z", "full_text": "--0-408958606-1274997763=:88185\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n\nYou&#39;re rewriting what people are saying again. No one is &#39;attacking&#39; you, =\r\nand &#39;denying all evidence&#39;.=C2=A0 They are offering multiple interpretation=\r\ns of results.=C2=A0 To expect everyone to &quot;buy your interpretation&quot; of ever=\r\nything puts you in the same state that pisses you off about skeptics.\n\nAnd =\r\nto threaten to ban people who disagree with you - aren&#39;t the ones calling n=\r\names and making attacks, aren&#39;t the ones being obnoxious, aren&#39;t the ones g=\r\netting religious - to threaten to throw those people out of the compound, d=\r\noes not make the group better, or smarter, or more enlightened.\n\nIt&#39;s makes=\r\n it a cult.\n\n\n\n--- On Thu, 5/27/10, Frank Sumption &lt;purplealiengirl@gmail.c=\r\nom&gt; wrote:\n\nFrom: Frank Sumption &lt;purplealiengirl@...&gt;\nSubject: Re: [=\r\nEVP-ITC] more suggestions?\nTo: EVP-ITC@yahoogroups.com\nDate: Thursday, May =\r\n27, 2010, 2:42 PM\n\n\n\n\n\n\n\n=C2=A0\n\n\n\n  \n\n\n    \n      \n      \n      =C2=A0More=\r\n than enough to show any one in the world that reads these posts how 100% u=\r\nnreasonable, unyielding, and ignorant these self proclaimed skeptics truly =\r\nare. They expect all of us to buy their version of what EVP and the paranor=\r\nmal really is, all imagination, and anyone that disagrees gets attacked. Ti=\r\nme and time again the three here side steped the issue that they completely=\r\n ignore all evidence, and all expereince of just about anyone else on the t=\r\nhis group. Intead over an over imply it&#39;s all imiagination and delusion, an=\r\nd only they are smart enough to decern the truth. \n\n=C2=A0\n=C2=A0The follwi=\r\nng is right off he home page. I don&#39;t rmember when I started thsi group, bu=\r\nyt htis has benn a couple years or so. \n=C2=A0\n=C2=A0\n&quot;\nTry not to get too =\r\nreligious, some discussion will be tolerated as long as no one is offended.=\r\n There is a &quot;banned&quot; button for those that get too obnoxious. I don&#39;t mind =\r\na good argument as long as it&#39;s not taken too serious, and people get pisse=\r\nd off, or hurt feelings. Try to be considerate of others! If I detect attem=\r\npts at debunking, I&#39;ll ban immediately! It&#39;s one thing to be skeptical, it&#39;=\r\ns another to ignore and deny all evidence. &quot;\n\n=C2=A0\n=C2=A0Ignore and deny =\r\nis excatly what these three skeptics are doing. \n=C2=A0\n=C2=A0F-S\n\n\n\n\n    \n=\r\n     \n\n    \n    \n\n\n \n\n\n\n  \n\n\n\n\n\n\n      \r\n--0-408958606-1274997763=:88185\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;br&gt;You&#39;re rewriting what people are saying a=\r\ngain. No one is &#39;attacking&#39; you, and &#39;denying all evidence&#39;.&nbsp; They are=\r\n offering multiple interpretations of results.&nbsp; To expect everyone to =\r\n&quot;buy your interpretation&quot; of everything puts you in the same state that pis=\r\nses you off about skeptics.&lt;br&gt;&lt;br&gt;And to threaten to ban people who disagr=\r\nee with you - aren&#39;t the ones calling names and making attacks, aren&#39;t the =\r\nones being obnoxious, aren&#39;t the ones getting religious - to threaten to th=\r\nrow those people out of the compound, does not make the group better, or sm=\r\narter, or more enlightened.&lt;br&gt;&lt;br&gt;It&#39;s makes it a cult.&lt;br&gt;&lt;br&gt;&lt;br&gt;&lt;br&gt;---=\r\n On &lt;b&gt;Thu, 5/27/10, Frank Sumption &lt;i&gt;&lt;purplealiengirl@...&gt;&lt;/i=\r\n&gt;&lt;/b&gt; wrote:&lt;br&gt;&lt;blockquote style=3D&quot;border-left: 2px solid rgb(16, 16, 255=\r\n); margin-left: 5px; padding-left: 5px;&quot;&gt;&lt;br&gt;From: Frank Sumption\n &lt;purp=\r\nlealiengirl@...&gt;&lt;br&gt;Subject: Re: [EVP-ITC] more suggestions?&lt;br&gt;To=\r\n: EVP-ITC@yahoogroups.com&lt;br&gt;Date: Thursday, May 27, 2010, 2:42 PM&lt;br&gt;&lt;br&gt;&lt;=\r\ndiv id=3D&quot;yiv225177997&quot;&gt;\n\n\n\n\n\n&lt;span style=3D&quot;display: none;&quot;&gt;&nbsp;&lt;/span&gt;\n=\r\n\n\n\n    &lt;div id=3D&quot;ygrp-text&quot;&gt;\n      \n      \n      &lt;p&gt;&lt;/p&gt;&lt;div&gt;&nbsp;More th=\r\nan enough to show any one in the world that reads these posts how 100% unre=\r\nasonable, unyielding, and ignorant these self proclaimed skeptics truly are=\r\n. They expect all of us to buy their version of what EVP and the paranormal=\r\n really is, all imagination, and anyone that disagrees gets attacked. Time =\r\nand time again the three here side steped the issue that they completely ig=\r\nnore all evidence, and all expereince of just about anyone else on the this=\r\n group. Intead over an over imply it&#39;s all imiagination and delusion, and o=\r\nnly they are smart enough to decern the truth. &lt;/div&gt;\n\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;d=\r\niv&gt;&nbsp;The follwing is right off he home page. I don&#39;t rmember when I sta=\r\nrted thsi group, buyt htis has benn a couple years or so. &lt;/div&gt;\n&lt;div&gt;&nbsp=\r\n;&lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&quot;&lt;br&gt;Try not to get too religious, some disc=\r\nussion will be tolerated as long as no one is offended. There is a &quot;banned&quot;=\r\n button for those that get too obnoxious. I don&#39;t mind a good argument as l=\r\nong as it&#39;s not taken too serious, and people get pissed off, or hurt feeli=\r\nngs. Try to be considerate of others! &lt;u&gt;If I detect attempts at debunking,=\r\n I&#39;ll ban immediately! It&#39;s one thing to be skeptical, it&#39;s another to igno=\r\nre and deny all evidence.&lt;/u&gt; &quot;&lt;/div&gt;\n\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;Ignore =\r\nand deny is excatly what these three skeptics are doing. &lt;/div&gt;\n&lt;div&gt;&nbsp;=\r\n&lt;/div&gt;\n&lt;div&gt;&nbsp;F-S&lt;br&gt;&lt;br&gt;&lt;/div&gt;\n\n\n    &lt;/div&gt;\n     \n\n\n\n \n\n\n&lt;/div&gt;&lt;/block=\r\nquote&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n      \r\n--0-408958606-1274997763=:88185--"}