{"id": "17333", "subject": "Re: Tesing-testing", "author": "Fiona Broome", "timestamp": "2010-05-27T22:56:14Z", "full_text": "Hi,\n\nI&#39;m not sure.\n\nThis concept has its rabid detractors and -- like so many studies -- it&#39;s in the early, wild-and-crazy &quot;what if...?&quot; phase.  \n\nAll the numbers show is that an RNG (random number generator) anomaly occurred. There&#39;s speculation that the anomalies relate to global consciousness.  I&#39;m not convinced that&#39;s the whole story.\n\nFor now, scientists are taking RNG anomalies and -- once the anomalies are clear and have concluded -- data-mining backwards to associate them with world events.\n\nIt&#39;s interesting what events seem linked to RNG anomalies and which events seem not to affect them.  The numbers turned anomalous hours before Princess Diana&#39;s death, the 9/11 attacks, and the Asian tsunami.\n\nHowever, other apparently important events -- and some may argue, more important events -- don&#39;t seem to connect to RNG anomalies.\n\nOther RNG anomalies can&#39;t be linked to one event, but may relate to several.\n\nFor example, the RNG sequences were anomalous at the time of the volcano eruption in Iceland. However, the timing also coincided with the Kumbh Mela in India, and the big earthquake in Qinghai China.  Did one, two or all of them relate to the RNG variation... or were the RNG anomalies coincidental?  (Rhetorical question.)  \n\nSo, I look at the May 7th RNG numbers and I see an anomaly. I&#39;m not aware of anything in our world that correlates to that date.\n\nThis may be piling wild extrapolation on top of wild extrapolation, but I speculate that these RNG anomalies aren&#39;t just about our world.  They may reflect something larger.\n\nOr, the RNG anomalies may be a reaction to something far more mundane, but not yet measurable or detectable. \n\nAt this point, it&#39;s too early to predict anything in June.  I think I&#39;ll be watching the numbers starting about a week before the 17th.\n\nThis is the kind of quirky study that intrigues me.  It may amount to nothing, but my &quot;gut feeling&quot; is: Something useful is in those RNG studies.  I just don&#39;t know what it is, yet.\n\nCheerfully,\nFiona\n\nRefs: http://noosphere.princeton.edu/\nhttp://en.wikipedia.org/wiki/Global_Consciousness_Project\nhttp://www.abovetopsecret.com/forum/thread119102/pg1\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  So does that mean there was a possiblity of a something event on May 7th?\n&gt; Got anything for June 17th, or 22nd?\n&gt; \n&gt;  Frank-S\n&gt; \n&gt; On Thu, May 27, 2010 at 1:19 PM, Fiona Broome &lt;email@...&gt; wrote:\n&gt; \n...\n&gt; &gt; Checking last year&#39;s EGG composite numbers, I see a notable drop between\n&gt; &gt; August 14th (7 spikes) and 15th (7 spikes), and the 16th (4 spikes) and the\n&gt; &gt; 17th (3 spikes).\n&gt; &gt;\n&gt; &gt; That doesn&#39;t mean anything, of course, but it&#39;s something that I check now\n&gt; &gt; & then. (I&#39;d have a better sense of the significance if August&#39;s monthly\n&gt; &gt; graph was available, but that file is showing no data right now.)\n&gt; &gt;\n&gt; &gt; On May 7th of this year, there was a significant dip (6 spikes on the 6th,\n&gt; &gt; 2 on the 7th, then 6 on the 8th). But, it was one of three similar dips this\n&gt; &gt; month. I&#39;m not sure that they correlate to anything geopolitical.\n&gt; &gt;"}