{"id": "17339", "subject": "Re: [EVP-ITC] Enough of the BS", "author": "April Abercrombie", "timestamp": "2010-05-28T14:03:31Z", "full_text": "Mind you, it hasn&#39;t been too many, because I don&#39;t get many EVP&#39;s that I\ndeem worthy enough to put up as evidence.\n\nMy sole purpose with this whole volley this last few days was to try and\nconvince Frank that I am not picking on him or his research by being\nskeptical. If I where just here to tear him apart, I would be commenting on\neverything he posts.\n\n\nOn Fri, May 28, 2010 at 7:33 AM, April Abercrombie &lt;\napril@...&gt; wrote:\n\n&gt; Who are you referring to? I have shared a few EVP&#39;s with this group asking\n&gt; what they hear. I do this every time I get an EVP. I post them to all my\n&gt; groups, not just this one.\n&gt;\n&gt; On Thu, May 27, 2010 at 10:51 PM, bulletbabea &lt;bulletbabea@...&gt;wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; You know its kind of humorous for me that those who have the desire to\n&gt;&gt; &quot;discuss&quot; thier different views are often the ones who do the least amount\n&gt;&gt; of actual research... as long as you have been in this group not once have\n&gt;&gt; you shared one evp. If you did then please refresh my memory. This seems to\n&gt;&gt; more about commenting on what others share for you than it is about doing\n&gt;&gt; any research yourself. Im not sure what you are looking for, if you are here\n&gt;&gt; to learn, correspond, or if you are just here to get a rise out of others\n&gt;&gt; but to be honest I do not have time for it.\n&gt;&gt;\n&gt;&gt; Whether Frank bans anyone or not is up to him entirely. But I have warned\n&gt;&gt; you before and I am saying it again. Cut the crap and move on. That goes for\n&gt;&gt; ALL of you. I dont mind discussions, I dont mind differences of opinion but\n&gt;&gt; I do mind BS.\n&gt;&gt;\n&gt;&gt; If you have research to share then do so, if your research yeilds no\n&gt;&gt; results then state it as such. If your only purpose for being in this group\n&gt;&gt; is to question others, disect them, and cause negative discussions then\n&gt;&gt; perhaps you are wasting your time here. You are definitely wasting mine.\n&gt;&gt;\n&gt;&gt; Misty\n&gt;&gt;\n&gt;&gt;  \n&gt;&gt;\n&gt;\n&gt;\n\nMind you, i hasn' been oo many, because I don' ge many EVP's ha I deem wo hy enough o pu up as e idence.My sole pu pose wi h his whole olley his las ew days was o y and con ince F ank ha I am no picking on him o his esea ch by being skep ical. I I whe e jus he e o ea him apa , I would be commen ing on e e y hing he pos s.\nOn F i, May 28, 2010 a 7:33 AM, Ap il Abe c ombie ap il@...> w o e:\nWho a e you e e ing o? I ha e sha ed a ew EVP's wi h his g oup asking wha hey hea . I do his \ne e y ime I ge an EVP. I pos hem o all my g oups, no jus his one.On Thu, May 27, 2010 a 10:51 PM, bulle babea bulle babea@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n \n\nYou know i s kind o humo ous o me ha hose who ha e he desi e o \"discuss\" hie di e en iews a e o en he ones who do he leas amoun o ac ual esea ch... as long as you ha e been in his g oup no once ha e you sha ed one e p. I you did hen please e esh my memo y. This seems o mo e abou commen ing on wha o he s sha e o you han i is abou doing any esea ch you sel . Im no su e wha you a e looking o , i you a e he e o lea n, co espond, o i you a e jus he e o ge a ise ou o o he s bu o be hones I do no ha e ime o i . \n\n\n\nWhe he F ank bans anyone o no is up o him en i ely. Bu I ha e wa ned you be o e and I am saying i again. Cu he c ap and mo e on. Tha goes o ALL o you. I don mind discussions, I don mind di e ences o opinion bu I do mind BS. \n\n\n\nI you ha e esea ch o sha e hen do so, i you esea ch yeilds no esul s hen s a e i as such. I you only pu pose o being in his g oup is o ques ion o he s, disec hem, and cause nega i e discussions hen pe haps you a e was ing you ime he e. You a e de ini ely was ing mine.\n\n\n\nMis y"}