{"id": "17332", "subject": "Re: more suggestions?", "author": "entity247", "timestamp": "2010-05-28T00:28:01Z", "full_text": "Well, Iam new here to the group and sorry to say there sure is allot of bellyaching with what little I have read. Anyway. Well, the radio dose work. Believe it or not I know this first hand. Anyone can use it. But needs to be used by a sensitive to realy work it accurately. It is a great tool for paranormal reaches. The voices will come through vary clear. One thing I would like to know is will they stay on one frequency when you dial it in or, dose it always change? And sense the voices are coming through as a frequency which is a form of electricity witch we are all made of, is there a way of tuning just these waves? so we don&#39;t here all the stations.  \n\n--- In EVP-ITC@yahoogroups.com, Rj &lt;rasterer@...&gt; wrote:\n&gt;\n&gt; \n&gt; You&#39;re rewriting what people are saying again. No one is &#39;attacking&#39; you, and &#39;denying all evidence&#39;.  They are offering multiple interpretations of results.  To expect everyone to &quot;buy your interpretation&quot; of everything puts you in the same state that pisses you off about skeptics.\n&gt; \n&gt; And to threaten to ban people who disagree with you - aren&#39;t the ones calling names and making attacks, aren&#39;t the ones being obnoxious, aren&#39;t the ones getting religious - to threaten to throw those people out of the compound, does not make the group better, or smarter, or more enlightened.\n&gt; \n&gt; It&#39;s makes it a cult.\n&gt; \n&gt; \n&gt; \n&gt; --- On Thu, 5/27/10, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt; \n&gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt; Subject: Re: [EVP-ITC] more suggestions?\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Thursday, May 27, 2010, 2:42 PM\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt;   \n&gt; \n&gt; \n&gt;     \n&gt;       \n&gt;       \n&gt;        More than enough to show any one in the world that reads these posts how 100% unreasonable, unyielding, and ignorant these self proclaimed skeptics truly are. They expect all of us to buy their version of what EVP and the paranormal really is, all imagination, and anyone that disagrees gets attacked. Time and time again the three here side steped the issue that they completely ignore all evidence, and all expereince of just about anyone else on the this group. Intead over an over imply it&#39;s all imiagination and delusion, and only they are smart enough to decern the truth. \n&gt; \n&gt;  \n&gt;  The follwing is right off he home page. I don&#39;t rmember when I started thsi group, buyt htis has benn a couple years or so. \n&gt;  \n&gt;  \n&gt; &quot;\n&gt; Try not to get too religious, some discussion will be tolerated as long as no one is offended. There is a &quot;banned&quot; button for those that get too obnoxious. I don&#39;t mind a good argument as long as it&#39;s not taken too serious, and people get pissed off, or hurt feelings. Try to be considerate of others! If I detect attempts at debunking, I&#39;ll ban immediately! It&#39;s one thing to be skeptical, it&#39;s another to ignore and deny all evidence. &quot;\n&gt; \n&gt;  \n&gt;  Ignore and deny is excatly what these three skeptics are doing. \n&gt;  \n&gt;  F-S\n&gt;"}