{"id": "1734", "subject": "Re: Good Box...Bad Box", "author": "Steve Hultay", "timestamp": "2007-07-30T04:22:04Z", "full_text": "That&#39;s funny you mentioned that.  I thought of turning them both on \nand letting them fight it out wild west style, but than i came to my \nsenses and thought that was ridiculous...but funny though.  I guess \ni&#39;ll see what happens, it may be good to get 2 different points of \nview on things.  I&#39;ll ask one a question and than the other and meet \nsomewhere in he middle on common ground.  I know they say to wash a \nOuija board to cleanse it, but that probably wouldn&#39;t work a piece \nof electronics equipment.  I don&#39;t mind the cussing, but it&#39;s just \nmean and uncalled for.  They hurt my feelings and i want them to \napologize...lol.  I thought this would be a different angle for the \ngroup to branch out in and it worked.  All business and no play \nmakes for a dull board, sometimes you have to mix it up and add some \nhumor.  My problem is absolutely true, but not life threatening.  I \njust wanted to hear some response and i got it.\n\nThank you Misty,\n-Steve H.\n\n\n--- In EVP-ITC@yahoogroups.com, Misty Dawn &lt;bulletbabea@...&gt; wrote:\n&gt;\n&gt; What happens when you flip them both on at the same time? LOL \nmaybe they will &#39;cancel&#39; each other out and you will have \ntwo &quot;normal&quot; working boxes again. Give it a try and let me know the \nend results will ya.\n&gt;    \n&gt;   I have had evp where some said they prefer one method over \nanother and I did get alot of neg stuff when I first started using \nevpmaker. Once I became more focused and at peace with the process \nand set a few guidelines for my sessions I find any method pretty \nmuch the same as another. My friends/family cussed like sailors \nanyway so for some its just language and not an attack. As for the \nones who like to attack or play mind games, they usually get kicked \nout or interrupted after the first words they speak. It&#39;s just one \nof the guidelines I set as well as speak one at a time with a loud \nvoice if possible. \n&gt;    \n&gt;   Works well for me. I gave in to a couple things in return for \nthose. Cant hurt to try.\n&gt;    \n&gt;   Misty\n&gt; \n&gt; Steve Hultay &lt;urkel23@...&gt; wrote:\n&gt;           \n&gt; Does anybody think it&#39;s possible to get 2 extreme opposites in \n&gt; communication? 1 Box curses at me constantly and tells me to die \nand \n&gt; also talks about the end of the world and hell. And the other one \n&gt; talks about how pretty it is there and i always get &quot;Hi&quot; and &quot;I&#39;m \n&gt; Here&quot; as well as &quot;Don&#39;t leave&quot; when i&#39;m signing off and an \n&gt; occasional &quot;Goodbye&quot;. Has anyone experienced anything like this \n&gt; before? The 1 box even shuts off appliances in my house when i use \n&gt; it, i guess i&#39;ll stop using that one for now until i figure out a \n&gt; solution to what&#39;s going on. Any ideas?????\n&gt; \n&gt; -Steve H.\n&gt; \n&gt; \n&gt; \n&gt;          \n&gt; \n&gt;        \n&gt; ---------------------------------\n&gt; Sick sense of humor? Visit Yahoo! TV&#39;s Comedy with an Edge to see \nwhat&#39;s on, when.\n&gt;"}