{"id": "17341", "subject": "Re: [EVP-ITC] Enough of the BS", "author": "Rj", "timestamp": "2010-05-28T14:25:51Z", "full_text": "--0-476146878-1275056751=:13396\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nSame here - I have said=C2=A0 (several=C2=A0 times before) that since I hav=\r\ne no results I consider can only be explained paranormally, I have not post=\r\ned them.=C2=A0 As soon as I=C2=A0 get those, I will post them.=C2=A0 But I =\r\ndon&#39;t see the point of me just posting stuff to say &#39;me too!&#39;, or to follow=\r\n the crowd, or to try to fit in.=C2=A0 I am not disparaging those who have =\r\nthose results, and do post them.=C2=A0 And since this is a discussion,group=\r\n, it seems we should be able to discuss them, and question, and make sugges=\r\ntions.\n\nCivilly.\n\nAlso, Misty, there is more to &#39;research&#39; than everybody d=\r\noing and saying the same thing.=C2=A0 Even in what might seem a well-scoped=\r\n area of study, people can be at different levels of knowledge, or interest=\r\n, or focus.=C2=A0 Some people here are interested mostly in the hardware.=\r\n=C2=A0 Some have no interest or talent there, and focus on using the techno=\r\nlogy.=C2=A0 Some stand back some, looking at process, controls, quality ass=\r\nurance.=C2=A0 Some may just be interested in the psychic or paranormal comp=\r\nonents.=C2=A0 Some may be more interested in the &quot;Is there anything there&quot; =\r\nquestion.=C2=A0 Some, &quot;I know something&#39;s there, but what is it?&quot;.=C2=A0 So=\r\nme &quot;I know there are ghosts there, what do they want?&quot;.=C2=A0 Some, &quot;I know=\r\n what they want, how can I help?&quot;.=C2=A0 And so on.\n\nOne person giving thei=\r\nr perspective, in a different focus, or a different opinion, is not, &quot;crap&quot;=\r\n, or &quot;wasting time&quot;.=C2=A0=C2=A0 It should be seen as healthy, helping a sc=\r\nience stretch and check, redirect or confirm,=C2=A0 grow and explore.=C2=A0=\r\n To swat that down is a source of the negativity.=C2=A0 And if you are conc=\r\nerned about negative comments, go back and read the threads, and see who is=\r\n actually making the insults.\n\nBut, to make what I consider a positive sugg=\r\nestion, I would suggest people stop insulting others with different opinion=\r\ns, and allow civil discussion, and consider that none of us knows it all, a=\r\nnd can still learn things from others.=C2=A0 In fact, I hope that is the re=\r\nal purpose of the group.\n\n\n\n--- On Fri, 5/28/10, April Abercrombie &lt;april@a=\r\nbercrombieghostresearch.com&gt; wrote:\n\nFrom: April Abercrombie &lt;april@abercro=\r\nmbieghostresearch.com&gt;\nSubject: Re: [EVP-ITC] Enough of the BS\nTo: EVP-ITC@=\r\nyahoogroups.com\nDate: Friday, May 28, 2010, 7:03 AM\n\n\n\n\n\n\n\n=C2=A0\n\n\n\n  \n\n\n =\r\n   \n      \n      \n      Mind you, it hasn&#39;t been too many, because I don&#39;t =\r\nget many EVP&#39;s that I deem worthy enough to put up as evidence.\n\nMy sole pu=\r\nrpose with this whole volley this last few days was to try and convince Fra=\r\nnk that I am not picking on him or his research by being skeptical. If I wh=\r\nere just here to tear him apart, I would be commenting on everything he pos=\r\nts.\n\n\n\nOn Fri, May 28, 2010 at 7:33 AM, April Abercrombie &lt;april@abercrombi=\r\negh ostresearch. com&gt; wrote:\n\nWho are you referring to? I have shared a few=\r\n EVP&#39;s with this group asking what they hear. I do this \nevery time I get a=\r\nn EVP. I post them to all my groups, not just this one.\n\nOn Thu, May 27, 20=\r\n10 at 10:51 PM, bulletbabea &lt;bulletbabea@ yahoo.com&gt; wrote:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n=\r\n\n\n=C2=A0\n\n\n\n  \n\n\n    \n      \n      \n      \n\n\n\nYou know its kind of humorous=\r\n for me that those who have the desire to &quot;discuss&quot; thier different views a=\r\nre often the ones who do the least amount of actual research... as long as =\r\nyou have been in this group not once have you shared one evp. If you did th=\r\nen please refresh my memory. This seems to more about commenting on what ot=\r\nhers share for you than it is about doing any research yourself. Im not sur=\r\ne what you are looking for, if you are here to learn, correspond, or if you=\r\n are just here to get a rise out of others but to be honest I do not have t=\r\nime for it. \n\n\n\n\n\nWhether Frank bans anyone or not is up to him entirely. B=\r\nut I have warned you before and I am saying it again. Cut the crap and move=\r\n on. That goes for ALL of you. I dont mind discussions, I dont mind differe=\r\nnces of opinion but I do mind BS. \n\n\n\n\n\nIf you have research to share then =\r\ndo so, if your research yeilds no results then state it as such. If your on=\r\nly purpose for being in this group is to question others, disect them, and =\r\ncause negative discussions then perhaps you are wasting your time here. You=\r\n are definitely wasting mine.\n\n\n\n\n\nMisty\n\n\n\n\n\n    \n     \n\n    \n    \n\n\n\n\n\n\n =\r\n \n\n\n\n\n\n\n\n\n\n\n\n\n    \n     \n\n    \n    \n\n\n \n\n\n\n  \n\n\n\n\n\n\n      \r\n--0-476146878-1275056751=:13396\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;Same here - I have said&nbsp; (several&nbsp; =\r\ntimes before) that since I have no results I consider can only be explained=\r\n paranormally, I have not posted them.&nbsp; As soon as I&nbsp; get those, =\r\nI will post them.&nbsp; But I don&#39;t see the point of me just posting stuff =\r\nto say &#39;me too!&#39;, or to follow the crowd, or to try to fit in.&nbsp; I am n=\r\not disparaging those who have those results, and do post them.&nbsp; And si=\r\nnce this is a discussion,group, it seems we should be able to discuss them,=\r\n and question, and make suggestions.&lt;br&gt;&lt;br&gt;Civilly.&lt;br&gt;&lt;br&gt;Also, Misty, th=\r\nere is more to &#39;research&#39; than everybody doing and saying the same thing.&n=\r\nbsp; Even in what might seem a well-scoped area of study, people can be at =\r\ndifferent levels of knowledge, or interest, or focus.&nbsp; Some people her=\r\ne are interested mostly in the hardware.&nbsp; Some have no interest or tal=\r\nent\n there, and focus on using the technology.&nbsp; Some stand back some, =\r\nlooking at process, controls, quality assurance.&nbsp; Some may just be int=\r\nerested in the psychic or paranormal components.&nbsp; Some may be more int=\r\nerested in the &quot;Is there anything there&quot; question.&nbsp; Some, &quot;I know some=\r\nthing&#39;s there, but what is it?&quot;.&nbsp; Some &quot;I know there are ghosts there,=\r\n what do they want?&quot;.&nbsp; Some, &quot;I know what they want, how can I help?&quot;.=\r\n&nbsp; And so on.&lt;br&gt;&lt;br&gt;One person giving their perspective, in a differen=\r\nt focus, or a different opinion, is not, &quot;crap&quot;, or &quot;wasting time&quot;.&nbsp;&n=\r\nbsp; It should be seen as healthy, helping a science stretch and check, red=\r\nirect or confirm,&nbsp; grow and explore.&nbsp; To swat that down is a sour=\r\nce of the negativity.&nbsp; And if you are concerned about negative comment=\r\ns, go back and read the threads, and see who is actually making the insults=\r\n.&lt;br&gt;&lt;br&gt;But, to make what I consider a positive suggestion, I would\n sugge=\r\nst people stop insulting others with different opinions, and allow civil di=\r\nscussion, and consider that none of us knows it all, and can still learn th=\r\nings from others.&nbsp; In fact, I hope that is the real purpose of the gro=\r\nup.&lt;br&gt;&lt;br&gt;&lt;br&gt;&lt;br&gt;--- On &lt;b&gt;Fri, 5/28/10, April Abercrombie &lt;i&gt;&lt;april@a=\r\nbercrombieghostresearch.com&gt;&lt;/i&gt;&lt;/b&gt; wrote:&lt;br&gt;&lt;blockquote style=3D&quot;bord=\r\ner-left: 2px solid rgb(16, 16, 255); margin-left: 5px; padding-left: 5px;&quot;&gt;=\r\n&lt;br&gt;From: April Abercrombie &lt;april@...&gt;&lt;br&gt;S=\r\nubject: Re: [EVP-ITC] Enough of the BS&lt;br&gt;To: EVP-ITC@yahoogroups.com&lt;br&gt;Da=\r\nte: Friday, May 28, 2010, 7:03 AM&lt;br&gt;&lt;br&gt;&lt;div id=3D&quot;yiv1259836165&quot;&gt;\n\n\n\n\n\n&lt;s=\r\npan style=3D&quot;display: none;&quot;&gt;&nbsp;&lt;/span&gt;\n\n\n\n    &lt;div id=3D&quot;ygrp-text&quot;&gt;\n  =\r\n    \n      \n      &lt;p&gt;Mind you, it hasn&#39;t been too many, because I don&#39;t get=\r\n many EVP&#39;s that I deem worthy enough to put up as evidence.&lt;br&gt;&lt;br&gt;My sole=\r\n purpose with this whole volley this last few days was to try and convince =\r\nFrank that I am not picking on him or his research by being skeptical. If I=\r\n where just here to tear him apart, I would be commenting on everything he =\r\nposts.&lt;br&gt;\n&lt;br&gt;&lt;br&gt;&lt;/p&gt;&lt;div class=3D&quot;gmail_quote&quot;&gt;On Fri, May 28, 2010 at 7=\r\n:33 AM, April Abercrombie &lt;span dir=3D&quot;ltr&quot;&gt;&lt;&lt;a rel=3D&quot;nofollow&quot; ymailto=\r\n=3D&quot;mailto:april@...&quot; target=3D&quot;_blank&quot; href=3D&quot;/m=\r\nc/compose?to=3Dapril@...&quot;&gt;april@abercrombiegh ostr=\r\nesearch. com&lt;/a&gt;&gt;&lt;/span&gt; wrote:&lt;br&gt;&lt;blockquote class=3D&quot;gmail_quote&quot; sty=\r\nle=3D&quot;border-left: 1px solid rgb(204, 204, 204);&quot;&gt;\nWho are you referring to=\r\n? I have shared a few EVP&#39;s with this group asking what they hear. I do thi=\r\ns \nevery time I get an EVP. I post them to all my groups, not just this one=\r\n.&lt;br&gt;&lt;br&gt;&lt;div class=3D&quot;gmail_quote&quot;&gt;&lt;div class=3D&quot;im&quot;&gt;On Thu, May 27, 2010 =\r\nat 10:51 PM, bulletbabea &lt;span dir=3D&quot;ltr&quot;&gt;&lt;&lt;a rel=3D&quot;nofollow&quot; ymailto=\r\n=3D&quot;mailto:bulletbabea@...&quot; target=3D&quot;_blank&quot; href=3D&quot;/mc/compose?to=\r\n=3Dbulletbabea@...&quot;&gt;bulletbabea@ yahoo.com&lt;/a&gt;&gt;&lt;/span&gt; wrote:&lt;br&gt;\n=\r\n\n&lt;/div&gt;&lt;div&gt;&lt;div&gt;&lt;/div&gt;&lt;div class=3D&quot;h5&quot;&gt;&lt;blockquote class=3D&quot;gmail_quote&quot; =\r\nstyle=3D&quot;border-left: 1px solid rgb(204, 204, 204);&quot;&gt;\n\n\n\n\n\n\n\n\n\n\n\n\n\n&lt;div sty=\r\nle=3D&quot;background-color: rgb(255, 255, 255);&quot;&gt;\n&lt;span&gt;&nbsp;&lt;/span&gt;\n\n\n&lt;div&gt;\n =\r\n &lt;div&gt;\n\n\n    &lt;div&gt;\n      \n      \n      &lt;p&gt;&lt;br&gt;\n&lt;br&gt;\nYou know its kind of hu=\r\nmorous for me that those who have the desire to &quot;discuss&quot; thier different v=\r\niews are often the ones who do the least amount of actual research... as lo=\r\nng as you have been in this group not once have you shared one evp. If you =\r\ndid then please refresh my memory. This seems to more about commenting on w=\r\nhat others share for you than it is about doing any research yourself. Im n=\r\not sure what you are looking for, if you are here to learn, correspond, or =\r\nif you are just here to get a rise out of others but to be honest I do not =\r\nhave time for it. &lt;br&gt;\n\n\n&lt;br&gt;\nWhether Frank bans anyone or not is up to him=\r\n entirely. But I have warned you before and I am saying it again. Cut the c=\r\nrap and move on. That goes for ALL of you. I dont mind discussions, I dont =\r\nmind differences of opinion but I do mind BS. &lt;br&gt;\n\n\n&lt;br&gt;\nIf you have resea=\r\nrch to share then do so, if your research yeilds no results then state it a=\r\ns such. If your only purpose for being in this group is to question others,=\r\n disect them, and cause negative discussions then perhaps you are wasting y=\r\nour time here. You are definitely wasting mine.&lt;br&gt;\n\n\n&lt;br&gt;\nMisty&lt;br&gt;\n&lt;br&gt;\n&lt;=\r\n/p&gt;\n\n    &lt;/div&gt;\n     \n\n    \n    &lt;div style=3D&quot;color: rgb(255, 255, 255);&quot;&gt;&lt;=\r\n/div&gt;\n\n\n&lt;/div&gt;\n\n\n\n  \n\n\n\n\n\n\n&lt;/div&gt;&lt;/div&gt;&lt;/blockquote&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;br&gt;\n=\r\n&lt;/blockquote&gt;&lt;/div&gt;&lt;br&gt;\n\n\n    &lt;/div&gt;\n     \n\n\n\n \n\n\n&lt;/div&gt;&lt;/blockquote&gt;&lt;/td&gt;&lt;=\r\n/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n\n\n\n\n\n\n      \r\n--0-476146878-1275056751=:13396--"}