{"id": "17347", "subject": "Re: [EVP-ITC] Re: more suggestions?", "author": "Frank Sumption", "timestamp": "2010-05-28T16:32:53Z", "full_text": "When I first started making boxes in 2002, I assumed that the entities used\nthe bits of speech, music, and noise to form voices as the radio was swept\nacross it&#39;s tuning range, so it&#39;s not using a fixed frequency. Now days, I\nhave no idea how this stuff works, or how we get such clear voices that seem\nto carry across as the radio covers several different stations, yet the\nvoice remains the same. There seem to be a RF component, or something they\nactually transmit at times, other times they seem to remodulate the bits of\naudio.\n\n The bellyaching is cuz we get these people that proclaim to know all about\nhow the voices are formed--in our heads and imply it&#39;s all imagination.\n\n F-S\n\nOn Thu, May 27, 2010 at 6:28 PM, entity247 &lt;entity247@hotmail.com&gt; wrote:\n\n&gt;\n&gt;\n&gt; Well, Iam new here to the group and sorry to say there sure is allot of\n&gt; bellyaching with what little I have read. Anyway. Well, the radio dose work.\n&gt; Believe it or not I know this first hand. Anyone can use it. But needs to be\n&gt; used by a sensitive to realy work it accurately. It is a great tool for\n&gt; paranormal reaches. The voices will come through vary clear. One thing I\n&gt; would like to know is will they stay on one frequency when you dial it in\n&gt; or, dose it always change? And sense the voices are coming through as a\n&gt; frequency which is a form of electricity witch we are all made of, is there\n&gt; a way of tuning just these waves? so we don&#39;t here all the stations.\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Rj &lt;rasterer@...&gt;\n&gt; wrote:\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; You&#39;re rewriting what people are saying again. No one is &#39;attacking&#39; you,\n&gt; and &#39;denying all evidence&#39;.Â  They are offering multiple interpretations of\n&gt; results.Â  To expect everyone to &quot;buy your interpretation&quot; of everything\n&gt; puts you in the same state that pisses you off about skeptics.\n&gt;\n&gt; &gt;\n&gt; &gt; And to threaten to ban people who disagree with you - aren&#39;t the ones\n&gt; calling names and making attacks, aren&#39;t the ones being obnoxious, aren&#39;t\n&gt; the ones getting religious - to threaten to throw those people out of the\n&gt; compound, does not make the group better, or smarter, or more enlightened.\n&gt; &gt;\n&gt; &gt; It&#39;s makes it a cult.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; --- On Thu, 5/27/10, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt;\n&gt; &gt; Subject: Re: [EVP-ITC] more suggestions?\n&gt; &gt; To: EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;\n&gt; &gt; Date: Thursday, May 27, 2010, 2:42 PM\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Â\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Â More than enough to show any one in the world that reads these posts\n&gt; how 100% unreasonable, unyielding, and ignorant these self proclaimed\n&gt; skeptics truly are. They expect all of us to buy their version of what EVP\n&gt; and the paranormal really is, all imagination, and anyone that disagrees\n&gt; gets attacked. Time and time again the three here side steped the issue that\n&gt; they completely ignore all evidence, and all expereince of just about anyone\n&gt; else on the this group. Intead over an over imply it&#39;s all imiagination and\n&gt; delusion, and only they are smart enough to decern the truth.\n&gt; &gt;\n&gt; &gt; Â\n&gt; &gt; Â The follwing is right off he home page. I don&#39;t rmember when I started\n&gt; thsi group, buyt htis has benn a couple years or so.\n&gt; &gt; Â\n&gt; &gt; Â\n&gt;\n&gt; &gt; &quot;\n&gt; &gt; Try not to get too religious, some discussion will be tolerated as long\n&gt; as no one is offended. There is a &quot;banned&quot; button for those that get too\n&gt; obnoxious. I don&#39;t mind a good argument as long as it&#39;s not taken too\n&gt; serious, and people get pissed off, or hurt feelings. Try to be considerate\n&gt; of others! If I detect attempts at debunking, I&#39;ll ban immediately! It&#39;s one\n&gt; thing to be skeptical, it&#39;s another to ignore and deny all evidence. &quot;\n&gt; &gt;\n&gt; &gt; Â\n&gt; &gt; Â Ignore and deny is excatly what these three skeptics are doing.\n&gt; &gt; Â\n&gt; &gt; Â F-S\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nWhen I i s s a ed making boxes in 2002, I assumed ha he en i ies used he bi s o speech, music, and noise o o m oices as he adio was swep ac oss i 's uning ange, so i 's no using a ixed equency. Now days, I ha e no idea how his s u wo ks, o how we ge such clea oices ha seem o ca y ac oss as he adio co e s se e al di e en s a ions, ye he oice emains he same. The e seem o be a RF componen , o some hing hey ac ually ansmi a imes, o he imes hey seem o emodula e he bi s o audio. \n\n \n The bellyaching is cuz we ge hese people ha p oclaim o know all abou how he oices a e o med--in ou heads and imply i 's all imagina ion. \n \n F-S\nOn Thu, May 27, 2010 a 6:28 PM, en i y247 en i y247@...> w o e:\n\n  \n\n\n\nWell, Iam new he e o he g oup and so y o say he e su e is allo o bellyaching wi h wha li le I ha e ead. Anyway. Well, he adio dose wo k. Belie e i o no I know his i s hand. Anyone can use i . Bu needs o be used by a sensi i e o ealy wo k i accu a ely. I is a g ea ool o pa ano mal eaches. The oices will come h ough a y clea . One hing I would like o know is will hey s ay on one equency when you dial i in o , dose i always change? And sense he oices a e coming h ough as a equency which is a o m o elec ici y wi ch we a e all made o , is he e a way o uning jus hese wa es? so we don' he e all he s a ions. \n--- In EVP-ITC@yahoog oups.com, Rj w o e:>> > You' e ew i ing wha people a e saying again. No one is 'a acking' you, and 'denying all e idence'.Â  They a e o e ing mul iple in e p e a ions o esul s.Â  To expec e e yone o \"buy you in e p e a ion\" o e e y hing pu s you in he same s a e ha pisses you o abou skep ics. \n> > And o h ea en o ban people who disag ee wi h you - a en' he ones calling names and making a acks, a en' he ones being obnoxious, a en' he ones ge ing eligious - o h ea en o h ow hose people ou o he compound, does no make he g oup be e , o sma e , o mo e enligh ened.\n> > I 's makes i a cul .> > > > --- On Thu, 5/27/10, F ank Sump ion w o e:> > F om: F ank Sump ion \n> Subjec : Re: [EVP-ITC] mo e sugges ions?> To: EVP-ITC@yahoog oups.com> Da e: Thu sday, May 27, 2010, 2:42 PM> \n> > > > > > > Â > > > > > > > > > > Â Mo e han enough o show any one in he wo ld ha eads hese pos s how 100% un easonable, unyielding, and igno an hese sel p oclaimed skep ics uly a e. They expec all o us o buy hei e sion o wha EVP and he pa ano mal eally is, all imagina ion, and anyone ha disag ees ge s a acked. Time and ime again he h ee he e side s eped he issue ha hey comple ely igno e all e idence, and all expe eince o jus abou anyone else on he his g oup. In ead o e an o e imply i 's all imiagina ion and delusion, and only hey a e sma enough o dece n he u h. \n> > Â > Â The ollwing is igh o he home page. I don' membe when I s a ed hsi g oup, buy h is has benn a couple yea s o so. > Â > Â  \n> \"> T y no o ge oo eligious, some discussion will be ole a ed as long as no one is o ended. The e is a \"banned\" bu on o hose ha ge oo obnoxious. I don' mind a good a gumen as long as i 's no aken oo se ious, and people ge pissed o , o hu eelings. T y o be conside a e o o he s! I I de ec a emp s a debunking, I'll ban immedia ely! I 's one hing o be skep ical, i 's ano he o igno e and deny all e idence. \"\n> > Â > Â Igno e and deny is exca ly wha hese h ee skep ics a e doing. > Â > Â F-S>"}