{"id": "17344", "subject": "Re: [EVP-ITC] Enough of the BS", "author": "David Koenig", "timestamp": "2010-05-28T16:05:24Z", "full_text": "I&#39;ve never posted an EVP but I do like to read about everyone else. Am I OK?\n\nOn Fri, May 28, 2010 at 10:25 AM, Rj &lt;rasterer@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Same here - I have said  (several  times before) that since I have no\n&gt; results I consider can only be explained paranormally, I have not posted\n&gt; them.  As soon as I  get those, I will post them.  But I don&#39;t see the point\n&gt; of me just posting stuff to say &#39;me too!&#39;, or to follow the crowd, or to try\n&gt; to fit in.  I am not disparaging those who have those results, and do post\n&gt; them.  And since this is a discussion,group, it seems we should be able to\n&gt; discuss them, and question, and make suggestions.\n&gt;\n&gt; Civilly.\n&gt;\n&gt; Also, Misty, there is more to &#39;research&#39; than everybody doing and saying\n&gt; the same thing.  Even in what might seem a well-scoped area of study, people\n&gt; can be at different levels of knowledge, or interest, or focus.  Some people\n&gt; here are interested mostly in the hardware.  Some have no interest or talent\n&gt; there, and focus on using the technology.  Some stand back some, looking at\n&gt; process, controls, quality assurance.  Some may just be interested in the\n&gt; psychic or paranormal components.  Some may be more interested in the &quot;Is\n&gt; there anything there&quot; question.  Some, &quot;I know something&#39;s there, but what\n&gt; is it?&quot;.  Some &quot;I know there are ghosts there, what do they want?&quot;.  Some,\n&gt; &quot;I know what they want, how can I help?&quot;.  And so on.\n&gt;\n&gt; One person giving their perspective, in a different focus, or a different\n&gt; opinion, is not, &quot;crap&quot;, or &quot;wasting time&quot;.   It should be seen as healthy,\n&gt; helping a science stretch and check, redirect or confirm,  grow and\n&gt; explore.  To swat that down is a source of the negativity.  And if you are\n&gt; concerned about negative comments, go back and read the threads, and see who\n&gt; is actually making the insults.\n&gt;\n&gt; But, to make what I consider a positive suggestion, I would suggest people\n&gt; stop insulting others with different opinions, and allow civil discussion,\n&gt; and consider that none of us knows it all, and can still learn things from\n&gt; others.  In fact, I hope that is the real purpose of the group.\n&gt;\n&gt;\n&gt;\n&gt; --- On *Fri, 5/28/10, April Abercrombie &lt;\n&gt; april@...&gt;* wrote:\n&gt;\n&gt;\n&gt; From: April Abercrombie &lt;april@...&gt;\n&gt; Subject: Re: [EVP-ITC] Enough of the BS\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Friday, May 28, 2010, 7:03 AM\n&gt;\n&gt;\n&gt;\n&gt; Mind you, it hasn&#39;t been too many, because I don&#39;t get many EVP&#39;s that I\n&gt; deem worthy enough to put up as evidence.\n&gt;\n&gt; My sole purpose with this whole volley this last few days was to try and\n&gt; convince Frank that I am not picking on him or his research by being\n&gt; skeptical. If I where just here to tear him apart, I would be commenting on\n&gt; everything he posts.\n&gt;\n&gt;\n&gt; On Fri, May 28, 2010 at 7:33 AM, April Abercrombie &lt;april@abercrombiegh\n&gt; ostresearch. com &lt;http://mc/compose?to=april@abercrombieghostresearch.com&gt;\n&gt; &gt; wrote:\n&gt;\n&gt;&gt; Who are you referring to? I have shared a few EVP&#39;s with this group asking\n&gt;&gt; what they hear. I do this every time I get an EVP. I post them to all my\n&gt;&gt; groups, not just this one.\n&gt;&gt;\n&gt;&gt; On Thu, May 27, 2010 at 10:51 PM, bulletbabea &lt;bulletbabea@ yahoo.com&lt;http://mc/compose?to=bulletbabea@...&gt;\n&gt;&gt; &gt; wrote:\n&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt; You know its kind of humorous for me that those who have the desire to\n&gt;&gt;&gt; &quot;discuss&quot; thier different views are often the ones who do the least amount\n&gt;&gt;&gt; of actual research... as long as you have been in this group not once have\n&gt;&gt;&gt; you shared one evp. If you did then please refresh my memory. This seems to\n&gt;&gt;&gt; more about commenting on what others share for you than it is about doing\n&gt;&gt;&gt; any research yourself. Im not sure what you are looking for, if you are here\n&gt;&gt;&gt; to learn, correspond, or if you are just here to get a rise out of others\n&gt;&gt;&gt; but to be honest I do not have time for it.\n&gt;&gt;&gt;\n&gt;&gt;&gt; Whether Frank bans anyone or not is up to him entirely. But I have warned\n&gt;&gt;&gt; you before and I am saying it again. Cut the crap and move on. That goes for\n&gt;&gt;&gt; ALL of you. I dont mind discussions, I dont mind differences of opinion but\n&gt;&gt;&gt; I do mind BS.\n&gt;&gt;&gt;\n&gt;&gt;&gt; If you have research to share then do so, if your research yeilds no\n&gt;&gt;&gt; results then state it as such. If your only purpose for being in this group\n&gt;&gt;&gt; is to question others, disect them, and cause negative discussions then\n&gt;&gt;&gt; perhaps you are wasting your time here. You are definitely wasting mine.\n&gt;&gt;&gt;\n&gt;&gt;&gt; Misty\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;\n&gt;\n&gt;  \n&gt;\n\nI' e ne e pos ed an EVP bu I do like o ead abou e e yone else. Am I OK?On F i, May 28, 2010 a 10:25 AM, Rj as e e @yahoo.com> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n Same he e - I ha e said  (se e al  imes be o e) ha since I ha e no esul s I conside can only be explained pa ano mally, I ha e no pos ed hem.  As soon as I  ge hose, I will pos hem.  Bu I don' see he poin o me jus pos ing s u o say 'me oo!', o o ollow he c owd, o o y o i in.  I am no dispa aging hose who ha e hose esul s, and do pos hem.  And since his is a discussion,g oup, i seems we should be able o discuss hem, and ques ion, and make sugges ions.\nCi illy.Also, Mis y, he e is mo e o ' esea ch' han e e ybody doing and saying he same hing.  E en in wha migh seem a well-scoped a ea o s udy, people can be a di e en le els o knowledge, o in e es , o ocus.  Some people he e a e in e es ed mos ly in he ha dwa e.  Some ha e no in e es o alen \n he e, and ocus on using he echnology.  Some s and back some, looking a p ocess, con ols, quali y assu ance.  Some may jus be in e es ed in he psychic o pa ano mal componen s.  Some may be mo e in e es ed in he \"Is he e any hing he e\" ques ion.  Some, \"I know some hing's he e, bu wha is i ?\".  Some \"I know he e a e ghos s he e, wha do hey wan ?\".  Some, \"I know wha hey wan , how can I help?\".  And so on.\nOne pe son gi ing hei pe spec i e, in a di e en ocus, o a di e en opinion, is no , \"c ap\", o \"was ing ime\".   I should be seen as heal hy, helping a science s e ch and check, edi ec o con i m,  g ow and explo e.  To swa ha down is a sou ce o he nega i i y.  And i you a e conce ned abou nega i e commen s, go back and ead he h eads, and see who is ac ually making he insul s.\nBu , o make wha I conside a posi i e sugges ion, I would\n sugges people s op insul ing o he s wi h di e en opinions, and allow ci il discussion, and conside ha none o us knows i all, and can s ill lea n hings om o he s.  In ac , I hope ha is he eal pu pose o he g oup.\n--- On F i, 5/28/10, Ap il Abe c ombie ap il@abe c ombieghos esea ch.com> w o e:\nF om: Ap il Abe c ombie ap il@abe c ombieghos esea ch.com>Subjec : Re: [EVP-ITC] Enough o he BSTo: EVP-ITC@yahoog oups.com\nDa e: F iday, May 28, 2010, 7:03 AM\n\n\n\n\n\n \n\n\n\n \n \n \n Mind you, i hasn' been oo many, because I don' ge many EVP's ha I deem wo hy enough o pu up as e idence.My sole pu pose wi h his whole olley his las ew days was o y and con ince F ank ha I am no picking on him o his esea ch by being skep ical. I I whe e jus he e o ea him apa , I would be commen ing on e e y hing he pos s.\n\nOn F i, May 28, 2010 a 7:33 AM, Ap il Abe c ombie ap il@abe c ombiegh os esea ch. com> w o e:\n\nWho a e you e e ing o? I ha e sha ed a ew EVP's wi h his g oup asking wha hey hea . I do his \ne e y ime I ge an EVP. I pos hem o all my g oups, no jus his one.On Thu, May 27, 2010 a 10:51 PM, bulle babea bulle babea@ yahoo.com> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n \n\nYou know i s kind o humo ous o me ha hose who ha e he desi e o \"discuss\" hie di e en iews a e o en he ones who do he leas amoun o ac ual esea ch... as long as you ha e been in his g oup no once ha e you sha ed one e p. I you did hen please e esh my memo y. This seems o mo e abou commen ing on wha o he s sha e o you han i is abou doing any esea ch you sel . Im no su e wha you a e looking o , i you a e he e o lea n, co espond, o i you a e jus he e o ge a ise ou o o he s bu o be hones I do no ha e ime o i . \n\n\n\n\nWhe he F ank bans anyone o no is up o him en i ely. Bu I ha e wa ned you be o e and I am saying i again. Cu he c ap and mo e on. Tha goes o ALL o you. I don mind discussions, I don mind di e ences o opinion bu I do mind BS. \n\n\n\n\nI you ha e esea ch o sha e hen do so, i you esea ch yeilds no esul s hen s a e i as such. I you only pu pose o being in his g oup is o ques ion o he s, disec hem, and cause nega i e discussions hen pe haps you a e was ing you ime he e. You a e de ini ely was ing mine.\n\n\n\n\nMis y"}