{"id": "17342", "subject": "Re: [EVP-ITC] Re: Tesing-testing", "author": "Frank Sumption", "timestamp": "2010-05-28T15:46:40Z", "full_text": "Most of my contacts seem to be in real time, but ther &#39;s also sopmething\ncalled sidereal time.\n\n F-S\n\nOn Fri, May 28, 2010 at 8:40 AM, Zack Widup &lt;w9sz.zack@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; I haven&#39;t gotten any EVP that talk about current events. Once I asked what\n&gt; year it was and a feamle voice on the EVP responded &quot;1996.&quot; It was in fact\n&gt; 2006 then.\n&gt; :-)\n&gt;\n&gt; Zack\n&gt;\n&gt;   On Fri, May 28, 2010 at 8:33 AM, Frank Sumption &lt;\n&gt; purplealiengirl@...&gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;  Wow, sounds just like EVP, sometimes &quot;they&quot; talk about earthquakes, and\n&gt;&gt; bombing, but major events are often not mentioned as well. I think all this\n&gt;&gt; stuff is connected.\n&gt;&gt;\n&gt;&gt;  It&#39;s gets weirder, if you get these specific warnings, you can put the\n&gt;&gt; though &quot;out there&quot;, not allowing it to happen, and it seems to affect the\n&gt;&gt; predicted event. So who is to say if a prediction was false, or it was not\n&gt;&gt; allowed?\n&gt;&gt;\n&gt;&gt;  Skeptics need not chime in! I mean, I think everything functions on the\n&gt;&gt; quantum level and we effect it, or even recreate it.\n&gt;&gt;\n&gt;&gt;  F-S\n&gt;&gt;\n&gt;&gt;   On Thu, May 27, 2010 at 4:56 PM, Fiona Broome &lt;email@...&gt;wrote:\n&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt; Hi,\n&gt;&gt;&gt;\n&gt;&gt;&gt; I&#39;m not sure.\n&gt;&gt;&gt;\n&gt;&gt;&gt; This concept has its rabid detractors and -- like so many studies -- it&#39;s\n&gt;&gt;&gt; in the early, wild-and-crazy &quot;what if...?&quot; phase.\n&gt;&gt;&gt;\n&gt;&gt;&gt; All the numbers show is that an RNG (random number generator) anomaly\n&gt;&gt;&gt; occurred. There&#39;s speculation that the anomalies relate to global\n&gt;&gt;&gt; consciousness. I&#39;m not convinced that&#39;s the whole story.\n&gt;&gt;&gt;\n&gt;&gt;&gt; For now, scientists are taking RNG anomalies and -- once the anomalies\n&gt;&gt;&gt; are clear and have concluded -- data-mining backwards to associate them with\n&gt;&gt;&gt; world events.\n&gt;&gt;&gt;\n&gt;&gt;&gt; It&#39;s interesting what events seem linked to RNG anomalies and which\n&gt;&gt;&gt; events seem not to affect them. The numbers turned anomalous hours before\n&gt;&gt;&gt; Princess Diana&#39;s death, the 9/11 attacks, and the Asian tsunami.\n&gt;&gt;&gt;\n&gt;&gt;&gt; However, other apparently important events -- and some may argue, more\n&gt;&gt;&gt; important events -- don&#39;t seem to connect to RNG anomalies.\n&gt;&gt;&gt;\n&gt;&gt;&gt; Other RNG anomalies can&#39;t be linked to one event, but may relate to\n&gt;&gt;&gt; several.\n&gt;&gt;&gt;\n&gt;&gt;&gt; For example, the RNG sequences were anomalous at the time of the volcano\n&gt;&gt;&gt; eruption in Iceland. However, the timing also coincided with the Kumbh Mela\n&gt;&gt;&gt; in India, and the big earthquake in Qinghai China. Did one, two or all of\n&gt;&gt;&gt; them relate to the RNG variation... or were the RNG anomalies coincidental?\n&gt;&gt;&gt; (Rhetorical question.)\n&gt;&gt;&gt;\n&gt;&gt;&gt; So, I look at the May 7th RNG numbers and I see an anomaly. I&#39;m not aware\n&gt;&gt;&gt; of anything in our world that correlates to that date.\n&gt;&gt;&gt;\n&gt;&gt;&gt; This may be piling wild extrapolation on top of wild extrapolation, but I\n&gt;&gt;&gt; speculate that these RNG anomalies aren&#39;t just about our world. They may\n&gt;&gt;&gt; reflect something larger.\n&gt;&gt;&gt;\n&gt;&gt;&gt; Or, the RNG anomalies may be a reaction to something far more mundane,\n&gt;&gt;&gt; but not yet measurable or detectable.\n&gt;&gt;&gt;\n&gt;&gt;&gt; At this point, it&#39;s too early to predict anything in June. I think I&#39;ll\n&gt;&gt;&gt; be watching the numbers starting about a week before the 17th.\n&gt;&gt;&gt;\n&gt;&gt;&gt; This is the kind of quirky study that intrigues me. It may amount to\n&gt;&gt;&gt; nothing, but my &quot;gut feeling&quot; is: Something useful is in those RNG studies.\n&gt;&gt;&gt; I just don&#39;t know what it is, yet.\n&gt;&gt;&gt;\n&gt;&gt;&gt; Cheerfully,\n&gt;&gt;&gt; Fiona\n&gt;&gt;&gt;\n&gt;&gt;&gt; Refs: http://noosphere.princeton.edu/\n&gt;&gt;&gt; http://en.wikipedia.org/wiki/Global_Consciousness_Project\n&gt;&gt;&gt; http://www.abovetopsecret.com/forum/thread119102/pg1\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Frank\n&gt;&gt;&gt; Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt;&gt;&gt; &gt;\n&gt;&gt;&gt; &gt; So does that mean there was a possiblity of a something event on May\n&gt;&gt;&gt; 7th?\n&gt;&gt;&gt; &gt; Got anything for June 17th, or 22nd?\n&gt;&gt;&gt; &gt;\n&gt;&gt;&gt; &gt; Frank-S\n&gt;&gt;&gt; &gt;\n&gt;&gt;&gt; &gt; On Thu, May 27, 2010 at 1:19 PM, Fiona Broome &lt;email@...&gt; wrote:\n&gt;&gt;&gt; &gt;\n&gt;&gt;&gt; ...\n&gt;&gt;&gt;\n&gt;&gt;&gt; &gt; &gt; Checking last year&#39;s EGG composite numbers, I see a notable drop\n&gt;&gt;&gt; between\n&gt;&gt;&gt; &gt; &gt; August 14th (7 spikes) and 15th (7 spikes), and the 16th (4 spikes)\n&gt;&gt;&gt; and the\n&gt;&gt;&gt; &gt; &gt; 17th (3 spikes).\n&gt;&gt;&gt; &gt; &gt;\n&gt;&gt;&gt; &gt; &gt; That doesn&#39;t mean anything, of course, but it&#39;s something that I\n&gt;&gt;&gt; check now\n&gt;&gt;&gt; &gt; &gt; & then. (I&#39;d have a better sense of the significance if August&#39;s\n&gt;&gt;&gt; monthly\n&gt;&gt;&gt; &gt; &gt; graph was available, but that file is showing no data right now.)\n&gt;&gt;&gt; &gt; &gt;\n&gt;&gt;&gt; &gt; &gt; On May 7th of this year, there was a significant dip (6 spikes on the\n&gt;&gt;&gt; 6th,\n&gt;&gt;&gt; &gt; &gt; 2 on the 7th, then 6 on the 8th). But, it was one of three similar\n&gt;&gt;&gt; dips this\n&gt;&gt;&gt; &gt; &gt; month. I&#39;m not sure that they correlate to anything geopolitical.\n&gt;&gt;&gt; &gt; &gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;\n&gt;  \n&gt;\n\nMos o my con ac s seem o be in eal ime, bu he 's also sopme hing called side eal ime.\n \n F-S\nOn F i, May 28, 2010 a 8:40 AM, Zack Widup w9sz.zack@...> w o e:\n\n  \n\n\n\n\nI ha en' go en any EVP ha alk abou cu en e en s. Once I asked wha yea i was and a eamle  oice on he EVP esponded \"1996.\" I was in ac 2006 hen.\n:-)\n \nZack\n\n\n\nOn F i, May 28, 2010 a 8:33 AM, F ank Sump ion pu plealiengi l@...> w o e:\n\n  \n\n\n\n\n Wow, sounds jus like EVP, some imes \" hey\" alk abou ea hquakes, and bombing, bu majo e en s a e o en no men ioned as well. I hink all his s u is connec ed. \n \n I 's ge s wei de , i you ge hese speci ic wa nings, you can pu he hough \"ou he e\", no allowing i o happen, and i seems o a ec he p edic ed e en . So who is o say i a p edic ion was alse, o i was no allowed? \n\n \n Skep ics need no chime in! I mean, I hink e e y hing unc ions on he quan um le el and we e ec i , o e en ec ea e i . \n \n F-S\n\n\n\nOn Thu, May 27, 2010 a 4:56 PM, Fiona B oome email@...> w o e:\n\n  \n\n\n\nHi,I'm no su e.This concep has i s abid de ac o s and -- like so many s udies -- i 's in he ea ly, wild-and-c azy \"wha i ...?\" phase. All he numbe s show is ha an RNG ( andom numbe gene a o ) anomaly occu ed. The e's specula ion ha he anomalies ela e o global consciousness. I'm no con inced ha 's he whole s o y.\nFo now, scien is s a e aking RNG anomalies and -- once he anomalies a e clea and ha e concluded -- da a-mining backwa ds o associa e hem wi h wo ld e en s.I 's in e es ing wha e en s seem linked o RNG anomalies and which e en s seem no o a ec hem. The numbe s u ned anomalous hou s be o e P incess Diana's dea h, he 9/11 a acks, and he Asian sunami.\nHowe e , o he appa en ly impo an e en s -- and some may a gue, mo e impo an e en s -- don' seem o connec o RNG anomalies.O he RNG anomalies can' be linked o one e en , bu may ela e o se e al.\nFo example, he RNG sequences we e anomalous a he ime o he olcano e up ion in Iceland. Howe e , he iming also coincided wi h he Kumbh Mela in India, and he big ea hquake in Qinghai China. Did one, wo o all o hem ela e o he RNG a ia ion... o we e he RNG anomalies coinciden al? (Rhe o ical ques ion.) \nSo, I look a he May 7 h RNG numbe s and I see an anomaly. I'm no awa e o any hing in ou wo ld ha co ela es o ha da e.This may be piling wild ex apola ion on op o wild ex apola ion, bu I specula e ha hese RNG anomalies a en' jus abou ou wo ld. They may e lec some hing la ge .\nO , he RNG anomalies may be a eac ion o some hing a mo e mundane, bu no ye measu able o de ec able. A his poin , i 's oo ea ly o p edic any hing in June. I hink I'll be wa ching he numbe s s a ing abou a week be o e he 17 h.\nThis is he kind o qui ky s udy ha in igues me. I may amoun o no hing, bu my \"gu eeling\" is: Some hing use ul is in hose RNG s udies. I jus don' know wha i is, ye .Chee ully,Fiona\nRe s: h p://noosphe e.p ince on.edu/h p://en.wikipedia.o g/wiki/Global_Consciousness_P ojec \nh p://www.abo e opsec e .com/ o um/ h ead119102/pg1 \n--- In EVP-ITC@yahoog oups.com, F ank Sump ion w o e:>\n> So does ha mean he e was a possibli y o a some hing e en on May 7 h?> Go any hing o June 17 h, o 22nd?> > F ank-S> > On Thu, May 27, 2010 a 1:19 PM, Fiona B oome w o e:\n> ... \n> > Checking las yea 's EGG composi e numbe s, I see a no able d op be ween> > Augus 14 h (7 spikes) and 15 h (7 spikes), and he 16 h (4 spikes) and he> > 17 h (3 spikes).> >\n> > Tha doesn' mean any hing, o cou se, bu i 's some hing ha I check now> > & hen. (I'd ha e a be e sense o he signi icance i Augus 's mon hly> > g aph was a ailable, bu ha ile is showing no da a igh now.)\n> >> > On May 7 h o his yea , he e was a signi ican dip (6 spikes on he 6 h,> > 2 on he 7 h, hen 6 on he 8 h). Bu , i was one o h ee simila dips his> > mon h. I'm no su e ha hey co ela e o any hing geopoli ical.\n> >"}