{"id": "17350", "subject": "Re: Tesing-testing", "author": "Fiona Broome", "timestamp": "2010-05-28T20:14:37Z", "full_text": "Hi,\n\nFrank, I love that you posted this.  That&#39;s the kind of logic that keeps me in this field.  These aren&#39;t simple dilemmas or logic problems... they&#39;re huge, possibly crossing dimensions.\n\nThough grasping the full implications can be a continual challenge, I&#39;m reminded of the sparkle in Sherlock Holmes&#39; eye when he said, &quot;The game is afoot!&quot; \n\n(I&#39;m even more amused by the more complete quotation from Shakespeare&#39;s play, Henry V: &quot;The game&#39;s afoot!\nFollow your spirit!&quot;)\n\nI think we need to test every theory -- pushing each of them beyond &quot;sensible&quot; limits, in some cases -- to find new answers.\n\nFor me, this is tremendously exciting, and the &quot;what if...?&quot; questions get better & better.  Sure, maybe some (or many) of them lead nowhere, but they&#39;re such fun to explore!  \n\n(And, if they shed even a tiny light on the real answers, that might be all we need to take the next step forward in the research.)\n\nLike you, I think quantum studies are a major part of what we&#39;re trying to figure out.  This is such an exciting time!  I feel like I&#39;m standing in front of a huge buffet of clues, and I&#39;m considering how they might all fit together... or at least how to fit more of them on my plate to study them! *grin*\n\nA month ago, I would have said that EVP was interesting, but nothing I&#39;d pursue.  Having heard crystal clear voices, day after day, when I was in Canada... I&#39;m hooked.  \n\nThe idea that you can take the English language radio stations out of the equation and still hear unmistakably clear phrases... wow!\n\nAnyway, your post made me smile.  This is exactly what intrigues me about paranormal studies.\n\nThanks!\n\nCheerfully,\nFiona\n\n\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  Wow, sounds just like EVP, sometimes &quot;they&quot; talk about earthquakes, and\n&gt; bombing, but major events are often not mentioned as well. I think all this\n&gt; stuff is connected.\n&gt; \n&gt;  It&#39;s gets weirder, if you get these specific warnings, you can put the\n&gt; though &quot;out there&quot;, not allowing it to happen, and it seems to affect the\n&gt; predicted event. So who is to say if a prediction was false, or it was not\n&gt; allowed?\n&gt; \n&gt;  Skeptics need not chime in! I mean, I think everything functions on the\n&gt; quantum level and we effect it, or even recreate it.\n&gt; \n&gt;  F-S\n&gt;"}