{"id": "17353", "subject": "Re: [EVP-ITC] Re: more suggestions?", "author": "Frank Sumption", "timestamp": "2010-05-28T21:05:02Z", "full_text": "There&#39;s another group that tends to focus more on the technical aspects,\nRTSC (real time spirit communucation).\n\n F-S\n\nOn Fri, May 28, 2010 at 2:43 PM, Fiona Broome &lt;email@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Hi,\n&gt;\n&gt; When it comes to EVP, I was one of the most cynical/skeptical people ever.\n&gt; Well, I was until about two weeks ago.\n&gt;\n&gt; Then, a box cut me off in the middle of a rhetorical question. It was\n&gt; speaking clearly -- and directly to me -- from across the room. That got my\n&gt; attention in a hurry.\n&gt;\n&gt; Electronics is not my field, so I won&#39;t pretend to understand how the box\n&gt; works, but I&#39;m pretty darned sure it&#39;s not all in my head.\n&gt;\n&gt; Though I was a very busy speaker that weekend, I kept trying to be around\n&gt; the box during our ghost investigations, etc., just to hear more.\n&gt;\n&gt; It would be so much simpler if I could shrug this off and say, &quot;It&#39;s\n&gt; probably just my imagination.&quot;\n&gt;\n&gt; Instead, I want to know more about the voices, what they&#39;re saying, why\n&gt; they&#39;re saying what they do, and... well, what they are.\n&gt;\n&gt; To me, this is fascinating because of the potential variables.\n&gt;\n&gt; But, this isn&#39;t convenient and it wasn&#39;t what I had in mind when I packed\n&gt; my bag to speak in Canada. Right now, I should be finishing three books I&#39;m\n&gt; writing, one of which is very overdue.\n&gt;\n&gt; Instead, I&#39;m sitting here, wide-eyed, listening to recordings posted to\n&gt; this Yahoo Group, and I&#39;m trying to put this into a context that I can\n&gt; easily compartmentalize.\n&gt;\n&gt; So far, that&#39;s not working. I&#39;m finding no easy answers.\n&gt;\n&gt; Oh, I&#39;m grateful to each person who&#39;s posting their recordings. Thank you!\n&gt; But each recording makes me even more sure that I haven&#39;t a clue what this\n&gt; is... and that&#39;s a challenge that&#39;s singing a siren song.\n&gt;\n&gt; Cheerfully,\n&gt; Fiona\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Frank Sumption\n&gt; &lt;purplealiengirl@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; The bellyaching is cuz we get these people that proclaim to know all\n&gt; about\n&gt; &gt; how the voices are formed--in our heads and imply it&#39;s all imagination.\n&gt; &gt;\n&gt; &gt; F-S\n&gt;\n&gt;  \n&gt;\n\nThe e's ano he g oup ha ends o ocus mo e on he echnical aspec s, RTSC ( eal ime spi i communuca ion).\n \n F-S\nOn F i, May 28, 2010 a 2:43 PM, Fiona B oome email@...> w o e:\n\n  \n\n\n\nHi,When i comes o EVP, I was one o he mos cynical/skep ical people e e . Well, I was un il abou wo weeks ago.Then, a box cu me o in he middle o a he o ical ques ion. I was speaking clea ly -- and di ec ly o me -- om ac oss he oom. Tha go my a en ion in a hu y.\nElec onics is no my ield, so I won' p e end o unde s and how he box wo ks, bu I'm p e y da ned su e i 's no all in my head.Though I was a e y busy speake ha weekend, I kep ying o be a ound he box du ing ou ghos in es iga ions, e c., jus o hea mo e. \nI would be so much simple i I could sh ug his o and say, \"I 's p obably jus my imagina ion.\"Ins ead, I wan o know mo e abou he oices, wha hey' e saying, why hey' e saying wha hey do, and... well, wha hey a e. \nTo me, his is ascina ing because o he po en ial a iables.Bu , his isn' con enien and i wasn' wha I had in mind when I packed my bag o speak in Canada. Righ now, I should be inishing h ee books I'm w i ing, one o which is e y o e due.\nIns ead, I'm si ing he e, wide-eyed, lis ening o eco dings pos ed o his Yahoo G oup, and I'm ying o pu his in o a con ex ha I can easily compa men alize.So a , ha 's no wo king. I'm inding no easy answe s.\nOh, I'm g a e ul o each pe son who's pos ing hei eco dings. Thank you! Bu each eco ding makes me e en mo e su e ha I ha en' a clue wha his is... and ha 's a challenge ha 's singing a si en song. \nChee ully,Fiona \n--- In EVP-ITC@yahoog oups.com, F ank Sump ion w o e:> > The bellyaching is cuz we ge hese people ha p oclaim o know all abou \n> how he oices a e o med--in ou heads and imply i 's all imagina ion.> > F-S"}