{"id": "17352", "subject": "Re: more suggestions?", "author": "Fiona Broome", "timestamp": "2010-05-28T20:43:47Z", "full_text": "Hi,\n\nWhen it comes to EVP, I was one of the most cynical/skeptical people ever.  Well, I was until about two weeks ago.\n\nThen, a box cut me off in the middle of a rhetorical question. It was speaking clearly -- and directly to me -- from across the room. That got my attention in a hurry.\n\nElectronics is not my field, so I won&#39;t pretend to understand how the box works, but I&#39;m pretty darned sure it&#39;s not all in my head.\n\nThough I was a very busy speaker that weekend, I kept trying to be around the box during our ghost investigations, etc., just to hear more.  \n\nIt would be so much simpler if I could shrug this off and say, &quot;It&#39;s probably just my imagination.&quot;\n\nInstead, I want to know more about the voices, what they&#39;re saying, why they&#39;re saying what they do, and... well, what they are.  \n\nTo me, this is fascinating because of the potential variables.\n\nBut, this isn&#39;t convenient and it wasn&#39;t what I had in mind when I packed my bag to speak in Canada.  Right now, I should be finishing three books I&#39;m writing, one of which is very overdue.\n\nInstead, I&#39;m sitting here, wide-eyed, listening to recordings posted to this Yahoo Group, and I&#39;m trying to put this into a context that I can easily compartmentalize.\n\nSo far, that&#39;s not working.  I&#39;m finding no easy answers.\n\nOh, I&#39;m grateful to each person who&#39;s posting their recordings. Thank you!  But each recording makes me even more sure that I haven&#39;t a clue what this is... and that&#39;s a challenge that&#39;s singing a siren song. \n\nCheerfully,\nFiona\n\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt; \n&gt;  The bellyaching is cuz we get these people that proclaim to know all about\n&gt; how the voices are formed--in our heads and imply it&#39;s all imagination.\n&gt; \n&gt;  F-S"}