{"id": "1735", "subject": "RE: [EVP-ITC] Good Box...Bad Box", "author": "Frank Sumption", "timestamp": "2007-07-30T04:54:41Z", "full_text": "I never paid much attention as to which boxes produced more negatives, but I \nused to get alot when I first started this stuff. I tend to ignore those, \nand sometimes if it&#39;s in a segment I copy to the computer I&#39;ll play it \nbackward. Reversed, sometimes the evil voices are angelic.  That&#39;s curious \nabout it shutting off aplliances, I thought those ran on internal batteries. \nMaybe you&#39;re getting a lesson in energies?\n\nI did get a quake warning in last nights test, it said  China suffers a \nquake, followed by August 11. I usually don&#39;t get dates, or locations, so I \nguess wait any see, of maybe they can evacuate China? Often, when a quake is \ncoming I get a wolf image, well there&#39;s a wolf face on the shower window, \nkind of a medium size wolf, so I think if there is a quake it won&#39;t be real \nsevere, maybe like a 6 or 7. Wolves for quakes, cats for wind, and bears for \ntsunamis, which I didn&#39;t know ahead of time. For Katrina I had a cat(image) \nwith huge round eyes.\n\n\nFrank\n&gt;From: &quot;Steve Hultay&quot; &lt;urkel23@...&gt;\n&gt;Reply-To: EVP-ITC@yahoogroups.com\n&gt;To: EVP-ITC@yahoogroups.com\n&gt;Subject: [EVP-ITC] Good Box...Bad Box\n&gt;Date: Mon, 30 Jul 2007 00:42:01 -0000\n&gt;\n&gt;\n&gt;Does anybody think it&#39;s possible to get 2 extreme opposites in\n&gt;communication?  1 Box curses at me constantly and tells me to die and\n&gt;also talks about the end of the world and hell.  And the other one\n&gt;talks about how pretty it is there and i always get &quot;Hi&quot; and &quot;I&#39;m\n&gt;Here&quot; as well as &quot;Don&#39;t leave&quot; when i&#39;m signing off and an\n&gt;occasional &quot;Goodbye&quot;.  Has anyone experienced anything like this\n&gt;before?  The 1 box even shuts off appliances in my house when i use\n&gt;it, i guess i&#39;ll stop using that one for now until i figure out a\n&gt;solution to what&#39;s going on.  Any ideas?????\n&gt;\n&gt;-Steve H.\n&gt;\n\n_________________________________________________________________\nhttp://imagine-windowslive.com/hotmail/?locale=en-us&ocid=TXT_TAGHM_migration_HM_mini_2G_0507"}