{"id": "17351", "subject": "Re: Enough of the BS", "author": "purplespacefriend", "timestamp": "2010-05-28T20:32:54Z", "full_text": "Thanks April, but I am aware of the shortcomings of the box, and all these methods. I don&#39;t really need some &quot;expert&quot; telling me what it really is. I&#39;ve said very often that none of this s--- it written stone, and it ain&#39;t gospel either, same with these opinions. \n\n Personally I don&#39;t give a crap about proof, it&#39;s the fact that something talks that intrigues me, and how to make it better. These skepdicks make alot of assumptions about my motives, and character. 99% of the time they are way wrong. I don&#39;t do this work for mankind, or the paranormal community, fame or fortune. That&#39;s why the skeptic attacks are so insulting and infuriating. \n\n\nFrank-S\n\n--- In EVP-ITC@yahoogroups.com, April Abercrombie &lt;april@...&gt; wrote:\n&gt;\n&gt; Mind you, it hasn&#39;t been too many, because I don&#39;t get many EVP&#39;s that I\n&gt; deem worthy enough to put up as evidence.\n&gt; \n&gt; My sole purpose with this whole volley this last few days was to try and\n&gt; convince Frank that I am not picking on him or his research by being\n&gt; skeptical. If I where just here to tear him apart, I would be commenting on\n&gt; everything he posts.\n&gt; \n&gt; \n&gt; On Fri, May 28, 2010 at 7:33 AM, April Abercrombie &lt;\n&gt; april@...&gt; wrote:\n&gt; \n&gt; &gt; Who are you referring to? I have shared a few EVP&#39;s with this group asking\n&gt; &gt; what they hear. I do this every time I get an EVP. I post them to all my\n&gt; &gt; groups, not just this one.\n&gt; &gt;\n&gt; &gt; On Thu, May 27, 2010 at 10:51 PM, bulletbabea &lt;bulletbabea@...&gt;wrote:\n&gt; &gt;\n&gt; &gt;&gt;\n&gt; &gt;&gt;\n&gt; &gt;&gt;\n&gt; &gt;&gt;\n&gt; &gt;&gt; You know its kind of humorous for me that those who have the desire to\n&gt; &gt;&gt; &quot;discuss&quot; thier different views are often the ones who do the least amount\n&gt; &gt;&gt; of actual research... as long as you have been in this group not once have\n&gt; &gt;&gt; you shared one evp. If you did then please refresh my memory. This seems to\n&gt; &gt;&gt; more about commenting on what others share for you than it is about doing\n&gt; &gt;&gt; any research yourself. Im not sure what you are looking for, if you are here\n&gt; &gt;&gt; to learn, correspond, or if you are just here to get a rise out of others\n&gt; &gt;&gt; but to be honest I do not have time for it.\n&gt; &gt;&gt;\n&gt; &gt;&gt; Whether Frank bans anyone or not is up to him entirely. But I have warned\n&gt; &gt;&gt; you before and I am saying it again. Cut the crap and move on. That goes for\n&gt; &gt;&gt; ALL of you. I dont mind discussions, I dont mind differences of opinion but\n&gt; &gt;&gt; I do mind BS.\n&gt; &gt;&gt;\n&gt; &gt;&gt; If you have research to share then do so, if your research yeilds no\n&gt; &gt;&gt; results then state it as such. If your only purpose for being in this group\n&gt; &gt;&gt; is to question others, disect them, and cause negative discussions then\n&gt; &gt;&gt; perhaps you are wasting your time here. You are definitely wasting mine.\n&gt; &gt;&gt;\n&gt; &gt;&gt; Misty\n&gt; &gt;&gt;\n&gt; &gt;&gt;  \n&gt; &gt;&gt;\n&gt; &gt;\n&gt; &gt;\n&gt;"}