{"id": "17362", "subject": "Re: [EVP-ITC] Re: more suggestions?", "author": "Frank Sumption", "timestamp": "2010-05-29T18:25:44Z", "full_text": "Yeah, I know. People that think they can make a name for themselves\ndebunking, and the ones wanting to sell their own versions of the box. Many\nwant to be TAPS and Chirs Moon. I don&#39;t understand it. One thing though,\nwithout Moon, no one would know about the box! It&#39;s these skeptics and\ndebunkers that try to make him look bad.\n\n I don&#39;t know what the answer is.\n\n\n F-S\n\n\n\n\n\nOn Sat, May 29, 2010 at 7:19 AM, johnny u &lt;overwhelmed999@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;   I guess the format of this site is the best we can have for sharing this\n&gt; stuff. EVP&#39;s are one thing, but info from the real-time gathering seems more\n&gt; plentiful in intelligence we are receiving. I personally was able to get\n&gt; feedback from a deceased loved one on whether they wre ok on the other side\n&gt; and so on by whomever the messenger was. I do get quite disgusted with the\n&gt; ones scrambling to score a carreer in this stuff and the ones who go as far\n&gt; to infiltrate groups with their own team &#39;plants&#39; to steal info and scoop\n&gt; ideas and so on. You&#39;d be surprised at who they are.\n&gt;\n&gt; \n&gt;\n\nYeah, I know. People ha hink hey can make a name o hemsel es debunking, and he ones wan ing o sell hei own e sions o he box. Many wan o be TAPS and Chi s Moon. I don' unde s and i . One hing hough, wi hou Moon, no one would know abou he box! I 's hese skep ics and debunke s ha y o make him look bad. \n\n \n I don' know wha he answe is.\n \n \n F-S\n \n \n \n \nOn Sa , May 29, 2010 a 7:19 AM, johnny u o e whelmed999@...> w o e:\n\n  \n\n\n\n\n\n\n\n\nI guess he o ma o his si e is he bes we can ha e o sha ing his s u . EVP's a e one hing, bu in o om he eal- ime ga he ing seems mo e plen i ul in in elligence we a e ecei ing. I pe sonally was able o ge eedback om a deceased lo ed one on whe he hey w e ok on he o he side and so on by whome e he messenge was. I do ge qui e disgus ed wi h he ones sc ambling o sco e a ca ee in his s u and he ones who go as a o in il a e g oups wi h hei own eam 'plan s' o s eal in o and scoop ideas and so on. You'd be su p ised a who hey a e."}