{"id": "17363", "subject": "Re: [EVP-ITC] New Messages, [1 Attachment]", "author": "Frank Sumption", "timestamp": "2010-05-29T18:31:14Z", "full_text": "Formal box? These thing are radio based, and static and noise kinda come\nwith the territroy. Filter out the noise and many of the voices will\nprobably be lost. There are other methods though,lik eEVPmaker, which works\nwell for higher spirit contact.\n\n You might try an external antenan, like C. Crane twin ferrite antenna, you\ncan also make a homemade  AM loop, it works by by placing the radio inside\ntho loop so it has access to higher level signals.\n\n F-S\n\nOn Sat, May 29, 2010 at 9:24 AM, &lt;SnowfireL@...&gt; wrote:\n\n&gt;\n&gt;  [Attachment(s)&lt;https://mail.google.com/mail/?ui=2&view=js&name=js&ver=pd_Am7ltdRI.en.&am=!ZKLuV0Z3Ba-RZb6MUfUyekW6R1ZDBlrsLBQKZVHlEOnUFYet&fri#128e54d03589a5d0_TopText&gt;from\n&gt; SnowfireL@... included below]\n&gt;\n&gt; Here&#39;s an interesting message I received last night, I was asking about\n&gt; confirmation of what David keeps telling me,,here&#39;s what I got. There are\n&gt; several people saying things, and me at the end repeating what I think I\n&gt; hear the guy before me saying.   You&#39;ll need to listen at least two times to\n&gt; hear it, because of static, wish i could get my hands on one of those formal\n&gt; boxes, bet I could get some really good stuff, because they don&#39;t seem to\n&gt; carry so much static. Now, why is that I wonder.  Maybe I can stop the\n&gt; static with this 20-125 some how. sf\n&gt;\n&gt; \n&gt;\n\nFo mal box? These hing a e adio based, and s a ic and noise kinda come wi h he e i oy. Fil e ou he noise and many o he oices will p obably be los . The e a e o he me hods hough,lik eEVPmake , which wo ks well o highe spi i con ac . \n\n \n You migh y an ex e nal an enan, like C. C ane win e i e an enna, you can also make a homemade  AM loop, i wo ks by by placing he adio inside ho loop so i has access o highe le el signals.\n \n F-S\nOn Sa , May 29, 2010 a 9:24 AM, Snow i eL@...> w o e:\n\n  \n\n\n[A achmen (s) om Snow i eL@... included below] \n\nHe e's an in e es ing message I ecei ed las nigh , I was asking abou con i ma ion o wha Da id keeps elling me,,he e's wha I go . The e a e se e al people saying hings, and me a he end epea ing wha I hink I hea he guy be o e me saying.   You'll need o lis en a leas wo imes o hea i , because o s a ic, wish i could ge my hands on one o hose o mal boxes, be I could ge some eally good s u , because hey don' seem o ca y so much s a ic. Now, why is ha I wonde .  Maybe I can s op he s a ic wi h his 20-125 some how. s"}