{"id": "1737", "subject": "Re: [EVP-ITC] Re: Good Box...Bad Box", "author": "Anne", "timestamp": "2007-07-30T12:04:34Z", "full_text": "Steve,\n\nI don&#39;t know anything about wiring or electronics, but I&#39;m wondering if, \nwith both boxes going, it does something to your wiring?  Not because of the \nspirits, but just because it creates a load? LOL, load is probably not the \ncorrect electrical term..  Or is your wiring okay?  I hate to see you frying \nall your appliances!!\n\nAnne\n\n----- Original Message ----- \nFrom: &quot;Steve Hultay&quot; &lt;urkel23@...&gt;\nTo: &lt;EVP-ITC@yahoogroups.com&gt;\nSent: Monday, July 30, 2007 7:53 AM\nSubject: [EVP-ITC] Re: Good Box...Bad Box\n\n\n&gt; Wow, that&#39;s a lot of info to think about.  I thought i was alone\n&gt; with this.  When i first started i had asked for a sign that i was\n&gt; actually speaking to someone and my ceiling fan stopped for a few\n&gt; seconds and than started again.  The next day it wouldn&#39;t work at\n&gt; all, so i pulled the switch out of the wall and it was completely\n&gt; fried.  I luckily had a spare and re-installed it and it works fine\n&gt; again, but lesson was learned from that.  Don&#39;t ask for a sign b\n&gt; ecause you never know what they will do, and that goes for with or\n&gt; without a box.  They do listen and will pull energy from anywhere\n&gt; they can to achieve it.  I think that explains the appliances going\n&gt; out, i will ask a question and right before they answer something in\n&gt; the house will flicker or go out.  Sometimes they say &quot;I did that&quot;\n&gt; to take credit for shutting something off.  It&#39;s all about energy\n&gt; and how we use it in life and in death.\n&gt;\n&gt; -Steve H.\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Frank Sumption&quot; &lt;franks-boxes@...&gt;\n&gt; wrote:\n&gt;&gt;\n&gt;&gt; I never paid much attention as to which boxes produced more\n&gt; negatives, but I\n&gt;&gt; used to get alot when I first started this stuff. I tend to ignore\n&gt; those,\n&gt;&gt; and sometimes if it&#39;s in a segment I copy to the computer I&#39;ll\n&gt; play it\n&gt;&gt; backward. Reversed, sometimes the evil voices are angelic.  That&#39;s\n&gt; curious\n&gt;&gt; about it shutting off aplliances, I thought those ran on internal\n&gt; batteries.\n&gt;&gt; Maybe you&#39;re getting a lesson in energies?\n&gt;&gt;\n&gt;&gt; I did get a quake warning in last nights test, it said  China\n&gt; suffers a\n&gt;&gt; quake, followed by August 11. I usually don&#39;t get dates, or\n&gt; locations, so I\n&gt;&gt; guess wait any see, of maybe they can evacuate China? Often, when\n&gt; a quake is\n&gt;&gt; coming I get a wolf image, well there&#39;s a wolf face on the shower\n&gt; window,\n&gt;&gt; kind of a medium size wolf, so I think if there is a quake it\n&gt; won&#39;t be real\n&gt;&gt; severe, maybe like a 6 or 7. Wolves for quakes, cats for wind, and\n&gt; bears for\n&gt;&gt; tsunamis, which I didn&#39;t know ahead of time. For Katrina I had a\n&gt; cat(image)\n&gt;&gt; with huge round eyes.\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; Frank\n&gt;&gt; &gt;From: &quot;Steve Hultay&quot; &lt;urkel23@...&gt;\n&gt;&gt; &gt;Reply-To: EVP-ITC@yahoogroups.com\n&gt;&gt; &gt;To: EVP-ITC@yahoogroups.com\n&gt;&gt; &gt;Subject: [EVP-ITC] Good Box...Bad Box\n&gt;&gt; &gt;Date: Mon, 30 Jul 2007 00:42:01 -0000\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;Does anybody think it&#39;s possible to get 2 extreme opposites in\n&gt;&gt; &gt;communication?  1 Box curses at me constantly and tells me to die\n&gt; and\n&gt;&gt; &gt;also talks about the end of the world and hell.  And the other one\n&gt;&gt; &gt;talks about how pretty it is there and i always get &quot;Hi&quot; and &quot;I&#39;m\n&gt;&gt; &gt;Here&quot; as well as &quot;Don&#39;t leave&quot; when i&#39;m signing off and an\n&gt;&gt; &gt;occasional &quot;Goodbye&quot;.  Has anyone experienced anything like this\n&gt;&gt; &gt;before?  The 1 box even shuts off appliances in my house when i\n&gt; use\n&gt;&gt; &gt;it, i guess i&#39;ll stop using that one for now until i figure out a\n&gt;&gt; &gt;solution to what&#39;s going on.  Any ideas?????\n&gt;&gt; &gt;\n&gt;&gt; &gt;-Steve H.\n&gt;&gt; &gt;\n&gt;&gt;\n&gt;&gt; _________________________________________________________________\n&gt;&gt; http://imagine-windowslive.com/hotmail/?locale=en-\n&gt; us&ocid=TXT_TAGHM_migration_HM_mini_2G_0507\n&gt;&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Yahoo! Groups Links\n&gt;\n&gt;\n&gt;\n&gt;"}