{"id": "17385", "subject": "Re: more suggestions?", "author": "Fiona Broome", "timestamp": "2010-05-29T14:18:51Z", "full_text": "Hi,\n\nThough my own experience with the box (in Canada) included a personal message that defied &quot;normal&quot; explanations, I regard that as anecdotal proof.  I don&#39;t share the details on this list because they won&#39;t prove anything to anyone... not that I&#39;m sure it&#39;d make any difference, one way or the other, to anyone whose mind is made up.\n\nI also believe that my experience was rooted in the balanced levels of expectation on both sides of the box. That intrigues and amuses me. I wasn&#39;t desperate for a message from &quot;the other side,&quot; though the voice clearly had an urgent question for me, and repeated it twice.  \n\nBut, that may be one reason why I had such an impressive experience: I was interested but not desperate.  \n\nThat&#39;s also how I explain the bitterness of some debunkers; they&#39;ve been badly disappointed and, in their heart of hearts, they&#39;re actually desperate for comfort or closure from &quot;the other side.&quot; \n\nThat kind of grasping, in energy terms, can exceed anything I&#39;d describe as reasonable expectations.  As a parent, it reminds me most of a tantrum-y toddler or petulant teen, neither of whom I ever encouraged by giving in to their demands.\n\nThe cynical skeptics and debunkers go beyond saying, &quot;Well, I didn&#39;t want it, anyway.&quot;  They are so distraught, they take it to a much higher level, asserting &quot;...and it isn&#39;t real, either.&quot;\n\nI feel profoundly sorry for them, but they usually don&#39;t want sympathy; they want to vent, often in inappropriate manners and/or settings.\n\nThat can&#39;t become my issue.  I&#39;m here to learn and to share whatever I can.\n\nHowever, your idea of &quot;plants&quot; eludes me.  I&#39;m sorry to be so blunt, but that sounds like a short route to paranoia. By not sharing our info and ideas, I think we&#39;d be short-changing ourselves, each other and -- for the more altruistically-minded -- this field.\n\n(I don&#39;t pretend to be working in this field for altruistic reasons.  I&#39;m also not in this to become rich and/or famous.  I&#39;d be a lot happier as a recluse, working on my paintings, living in the cute beachfront cottage with the white picket fence, and avoiding controversy.  Instead, I&#39;m fascinated with this kind of research, for better or for worse.)\n\nFor me, the simplest way to &quot;stake a claim&quot; with my ideas and info is to be very forthright with them.  I share them broadly and steadily, so there&#39;s no doubt about my originality or my integrity. (Unfortunately, sharing broadly sort of defeats my aspirations of being a recluse.)\n\nI&#39;m not sure how it&#39;d serve me to conceal what I&#39;m doing.  Seeing what other people do with my info and ideas... that&#39;s a reward, not a liability. \n\nSure, I&#39;m irked when others copy my articles, word-for-word, or barely change my research notes and claim them as their own.  At any moment, with a few clicks at Copyscape or even at Google, I can find at least 50 websites that have blatantly plagiarized my writing.\n\nI can either spend my time chasing after the plagiarists, or I can pursue my research and share each new discovery with others.  I choose the latter.  Sooner or later, the people who matter will realize where the plagiarized materials have been coming from: Me.\n\nAnd, in the immortal words of Tammy Faye Bakker Messner -- whose voice I&#39;d love to hear from a box -- &quot;you can&#39;t go forward in life looking in the rear view mirror.&quot;\n\nI&#39;m looking forward, eager to see what&#39;s next in this field.  It&#39;s always an adventure!\n\nCheerfully,\nFiona \n\n--- In EVP-ITC@yahoogroups.com, johnny u &lt;overwhelmed999@...&gt; wrote:\n&gt;\n&gt; I guess the format of this site is the best we can have for sharing this stuff. EVP&#39;s are one thing, but info from the real-time gathering seems more plentiful in intelligence we are receiving. I personally was able to get feedback from a deceased loved one on whether they wre ok on the other side and so on by whomever the messenger was. I do get quite disgusted with the ones scrambling to score a carreer in this stuff and the ones who go as far to infiltrate groups with their own team &#39;plants&#39; to steal info and scoop ideas and so on. You&#39;d be surprised at who they are.\n&gt;"}