{"id": "17395", "subject": "Re: New Messages,", "author": "eastern_paranormal", "timestamp": "2010-06-01T01:52:07Z", "full_text": "You can also wrap a small box in foil and insert your radio into it. That sometimes helps.\n\nGabreael\nwww.easternparanormal.com \n\n--- In EVP-ITC@yahoogroups.com, SnowfireL@... wrote:\n&gt;\n&gt; Frank, are you saying, that if I put my radio inside, sitting inside a loop \n&gt;  it will take away the static?  It won&#39;t be connected to the radio or  \n&gt; anything though. sf\n&gt;  \n&gt;  \n&gt; In a message dated 5/29/2010 2:31:23 P.M. Eastern Daylight Time,  \n&gt; purplealiengirl@... writes:\n&gt; \n&gt;  \n&gt;  \n&gt;  \n&gt; Formal box? These thing are radio based, and static and noise kinda  come \n&gt; with the territroy. Filter out the noise and many of the voices will  \n&gt; probably be lost. There are other methods though,lik eEVPmaker, which works  well \n&gt; for higher spirit contact. \n&gt;  \n&gt;  You might try an external antenan, like C. Crane twin ferrite  antenna, \n&gt; you can also make a homemade  AM loop, it works by by placing  the radio \n&gt; inside tho loop so it has access to higher level signals.\n&gt;  \n&gt;  F-S\n&gt; \n&gt; \n&gt; On Sat, May 29, 2010 at 9:24 AM, &lt;_SnowfireL@..._ \n&gt; (mailto:SnowfireL@...) &gt;  wrote:\n&gt; \n&gt; \n&gt;  \n&gt;  \n&gt; [_Attachment(s)_ \n&gt; (https://mail.google.com/mail/?ui=2&view=js&name=js&ver=pd_Am7ltdRI.en.&am=!ZKLuV0Z3Ba-RZb6MUfUyekW6R1ZDBlrsLBQKZVHlEOnUFYet&fri#128e54\n&gt; d03589a5d0_TopText)   from _SnowfireL@..._ (mailto:SnowfireL@...)  \n&gt; included below]  \n&gt; Here&#39;s an interesting message I received last night, I was asking about  \n&gt; confirmation of what David keeps telling me,,here&#39;s what I got. There are  \n&gt; several people saying things, and me at the end repeating what I think I  hear \n&gt; the guy before me saying.   You&#39;ll need to listen at least  two times to \n&gt; hear it, because of static, wish i could get my hands on one of  those formal \n&gt; boxes, bet I could get some really good stuff, because they  don&#39;t seem to \n&gt; carry so much static. Now, why is that I wonder.  Maybe I  can stop the static \n&gt; with this 20-125 some how. sf\n&gt;"}