{"id": "17407", "subject": "Re: Nissan the movie.", "author": "tim_woolworth", "timestamp": "2010-06-02T03:59:04Z", "full_text": "I typically refrain from posting on the boards precisely because of people like you who feel that their insipid comments are worth hearing.  There is nothing wrong with skepticism, hell, I have been in a relationship with a laboratory scientist who is an atheist for going on four years now so I know what skepticism is supposed to sound like.  I hear it everyday.  Your posts do not reflect the nature of skepticism, they reflect outright denial.  There is a difference betwixt the two, and it is not slight.\n\nWhy?  Because you claim to want irrefutable proof.  Yet, you do nothing about it.  As the old adage goes, it&#39;s time for you to sh*t or get off the pot.  Get your hands on a ghost box and start experimenting.  There are numerous radios to hack yourself, so do it already (granted, a hack is by no means up to par with a Frank&#39;s Box, Minibox, or any of the other guys doing this, but it will get you started).  Then take the time to design controlled experiments to be implemented.  Share your results.  Write up a paper about it.  Follow the scientific method.  There are ghost box users all over the country, so I am sure you can find someone relatively close to you to work with if you actually want to take the time and responsibility of adding any knowledge to this community. \n\nDo something, anything, other than gripe about not having enough &#39;proof.&#39;  Epistemological knowledge has been debated by much better minds for thousands of years and the very notion of proof is still, well, unprovable.  Exactly like science.  What we believe today may not be true next year.  Talk to any post-modernist in this post-modern society we live in and he will tell you that the notion of scientific proof is meaningless precisely because its very knowledge base is in constant flux.  Gravity may be here today as a constant, but we cannot know with certainty the same will be true tomorrow.  This is why we have the scientific method to explore variables.  This is why skepticism is good. \n\nWe are all individuals, functioning individually in this field.  We do not have government funding.  We do not have PhD&#39;s working on this stuff.  We have guys and girls, in their homes and shops, trying to understand the incomprehensible.  Can you not realize that we all know that the evidence we collect is instantly disprovable and will always be so?  Just the simple fact of audio clips being posted here abnegates the power of empiricism.  As you have stated, you are a skeptic.  No audio clip will provide you with empirical evidence because you did not collect it yourself and therefore too many variables involved make it easily dismissable with just an iota of scientific rigor.  We accept that, and you cannot.  Therefore, your mere presence alone on these forums is antagonistic to the work we do because we can never provide you with proof.\n\nHow can you expect proof when we do not even know with certainty whether we are talking to spirits, ET&#39;s, gods, or frickin unicorns.\n\nHow can you expect proof when the very nature of spirit and afterlife is wholly unprovable.\n\nHow can you expect proof in a yahoo forum?  Does not the very nature of a forum defy all skeptical enquiry?\n\nAnd finally, speaking of forums, you are a guest in one run by people who believe this to be true expressly for people who believe likewise.  \n\nSo why are you here?\n\nSo please, do something to add to the community and quit relying on others to do it for you.  If you keep relying on this forum to give you proof, you will always be disappointed because there is no proof other than the audio clips you deny.  \n\nPeriod.\n\nFor the other forum users, I&#39;m sorry to feed the troll this time.  I know its best to let them starve, but once in a while you just might be able to shoo them away from the bridge to allow a safe crossing (yes, pun intended).\n\nTim W.\n--- In EVP-ITC@yahoogroups.com, Lizzie Broden &lt;yahuli69@...&gt; wrote:\n&gt;\n&gt; Read the one that was posted before mine.  I am here to see if there is any truth to this.  As stated previously, many times, and by your commentary, this is very much starting to look like a cult!  \n&gt; \n&gt; And that is not childish at all.\n&gt; \n&gt; If you have a point to make, please do so.  And while you are at it stop with the insults, because that is childish also.  I have stated my reason for being here several times before in the past and I harbor no ill will to anyone.  but I might if you keep it up!  Is that what you want?\n&gt; \n&gt; I want hard evidence, irrefutable evidence, not excuses or wishes or could be&#39;s.  I want facts.\n&gt; \n&gt; I want nothing more and nothing less.  That is the cold hard truth of it all, the ugly necked truth that no one wants to look at.  And if you want to throw rocks at me, that is fine.  I am a very big person.  But the question will remain the same, with me or without me.  Lambaste me to Hattie&#39;s, it will not change one damn thing.  That question will still be there.\n&gt; \n&gt; I would like to say and give a thank you to Snowflake for the kind words.  They very much touched me in a time when I needed it.  Please go ahead and contact her, but you will need to prove it is her you are talking to.  And that is not unreasonable at all.\n&gt; \n&gt; \n&gt;  &quot;Nature is showing us only the tail of the lion, but I have no doubt that the lion belongs to it even though, because of its large size, it cannot totally reveal itself all at once.&quot; \n&gt; -&quot; Albert Einstein \n&gt; \n&gt; \n&gt; &quot;It is far better to grasp the universe as it really is than to persist in delusions, however satisfying and reassuring.&quot;\n&gt; --Carl Sagan\n&gt; \n&gt; \n&gt; &quot;There is no such thing as an insignificant detail. Don&#39;t just look \n&gt; for what you want to find.&quot;\n&gt; -- Me LOL \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; ________________________________\n&gt; From: JANDANACOSTA &lt;jandan108@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Tue, June 1, 2010 8:51:18 PM\n&gt; Subject: Re: [EVP-ITC] Re: Nissan the movie.\n&gt; \n&gt;   \n&gt; Exactly what is your purpose here? These kind of &quot;drive-by&quot; comments with snide remarks are extremely childish. Commenting on another&#39;s post is more appropriate.\n&gt; \n&gt; --- On Tue, 6/1/10, Lizzie Broden &lt;yahuli69@yahoo. com&gt; wrote:\n&gt; \n&gt; \n&gt; &gt;From: Lizzie Broden &lt;yahuli69@yahoo. com&gt;\n&gt; &gt;Subject: Re: [EVP-ITC] Re: Nissan the movie.\n&gt; &gt;To: EVP-ITC@yahoogroups .com\n&gt; &gt;Date: Tuesday, June 1, 2010, 5:39 PM\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;  \n&gt; &gt;Damn those Skeptics for making me think for myself!  \n&gt; &gt;\n&gt; &gt;Life and the world (Might still be flat) would be a much better place if it wasn&#39;t for them!!!!\n&gt; &gt;\n&gt; &gt;Oh well, it is what it is   Time will tell \n&gt; &gt;\n&gt; &gt; &quot;Nature is showing us only the tail of the lion, but I have no doubt that the lion belongs to it even though, because of its large size, it cannot totally reveal itself all at once.&quot; \n&gt; &gt;-&quot; Albert Einstein \n&gt; &gt;\n&gt; &gt;\n&gt; &gt;&quot;It is far better to grasp the universe as it really is than to persist in delusions, however satisfying and reassuring.&quot;\n&gt; &gt;--Carl Sagan\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;&quot;There is no such thing as an insignificant detail. Don&#39;t just look \n&gt; &gt;for what you want to find.&quot;\n&gt; &gt;-- Me LOL \n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; ________________________________\n&gt; From: Frank Sumption &lt;purplealiengirl@ gmail.com&gt;\n&gt; &gt;To: EVP-ITC@yahoogroups .com\n&gt; &gt;Sent: Tue, June 1, 2010 8:35:29 AM\n&gt; &gt;Subject: Re: [EVP-ITC] Re: Nissan the movie.\n&gt; &gt;\n&gt; &gt;  \n&gt; &gt; Wow! I am amazed.That&#39; s pretty much what I heard! Very rare! See the skeptics acuse people of only hearing what&#39;s labled, and we just had another round and round about that last week. Thanks!\n&gt; &gt;\n&gt; &gt; F-S\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;On Tue, Jun 1, 2010 at 12:34 AM, Tim &lt;tjwoolwo@syr. edu&gt; wrote:\n&gt; &gt;\n&gt; &gt;  \n&gt; &gt;&gt;Frank,\n&gt; &gt;&gt;\n&gt; &gt;&gt;Very interesting. It&#39;s been a while since I&#39;ve listenend to your files. The fm on this tuner sounds really active; the Others are definitely chatty on this band. \n&gt; &gt;&gt;\n&gt; &gt;&gt;This is what I hear (in studio grade headphones):\n&gt; &gt;&gt;\n&gt; &gt;&gt;Your AM file @ 03 secs: &quot;Here Prin Cess&quot; (male + two escalating tones)\n&gt; &gt;&gt;@ 11 secs: &quot;Be sure (static) good news&quot; (male)\n&gt; &gt;&gt;\n&gt; &gt;&gt;Your FM file @ 01 secs: &quot;Trying to get through&quot; (in female tones)\n&gt; &gt;&gt;@ 03 secs: &quot;It don&#39;t ?boost? right&quot; (male then two tones)\n&gt; &gt;&gt;@ 05 secs: &quot;Closer to cooperating? &quot; (male, first vowel sound is hard and second vowel sound in this word is a soft &#39;a&#39; or &#39;o&#39; so it cannot be calamity)\n&gt; &gt;&gt;@ 06 secs: &quot;Till we&#39;re done&quot; (female, fast)\n&gt; &gt;&gt;@ 08 secs: &quot;Frank&quot; (male)\n&gt; &gt;&gt;@ 09 secs: &quot;Hi&quot; (female singing, drawn out) \n&gt; &gt;&gt;@ 11 secs: &quot;How you doing&quot; (male)\n&gt; &gt;&gt;@ 14 secs: &quot;Hi&quot; (female or child)\n&gt; &gt;&gt;\n&gt; &gt;&gt;Tim W. \n&gt; &gt;&gt;\n&gt; &gt;&gt;\n&gt; &gt;&gt;--- In EVP-ITC@yahoogroups .com, Frank Sumption &lt;purplealiengirl@ ...&gt; wrote:\n&gt; &gt;&gt;&gt;\n&gt; &gt;&gt;&gt; This is case no one was wondering. In the AM video at 9 seconds &quot;this is\n&gt; &gt;&gt;&gt; Otto&quot;, an ever present past life friend. In FM at 5 seconds &quot;gettin&#39; closer\n&gt; &gt;&gt;&gt; to calamity&quot; Calamityville horror? Who&#39;s Thomas Pane? (at the)\n&gt; &gt;&gt;&gt; \n&gt; &gt;&gt;&gt; F-S\n&gt; &gt;&gt;&gt;\n&gt; &gt;&gt;\n&gt; &gt;&gt;\n&gt; &gt;\n&gt; &gt;\n&gt;"}