{"id": "17409", "subject": "Re: [EVP-ITC] Re: Nissan the movie.", "author": "Lizzie Broden", "timestamp": "2010-06-02T04:59:45Z", "full_text": "--0-1592028508-1275454785=:37484\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nI don&#39;t know you from Adam, but you jump around a lot and make asumptions a=\r\nbout what I believe and dont believe.\n\nKinda typicial aint it?=C2=A0 \n\nI am=\r\n sorry=C2=A0I skimmed your post, as it is very much standard BS.\n\nI am not =\r\nin denial of anything, and if it is real I very much want to learn about it=\r\n.=C2=A0 But this almost religious furvor you people have for this.=C2=A0 Th=\r\nis unquestioning and going after anyone that presents you with fundamental =\r\nlogic and critical thinking, is a bit insulting.=C2=A0 \n\nI am sorry if logi=\r\nc,=C2=A0science, critical thinking and basic comon sence is threating to yo=\r\nu.=C2=A0 That is not my intention in the least.=C2=A0 LOOK AND STOP=C2=A0 I=\r\nF any of this is real, it needs to be tested and understood.=C2=A0 So far, =\r\nI aint seen that crap! LOL\n\nYour Guroue over there made the statment that n=\r\no contrabutions=C2=A0from Science have ever beinfited mankind.=C2=A0 Mull t=\r\nhat statment over in your brain and think about how ignorant and assinie th=\r\nat is.=C2=A0 That is a fools arron.\n\nSo I shut my mouth, yet here we are ag=\r\nain.=C2=A0 Bring me the body, Latin Ducuis=C2=A0Tetium (My Latin sucks) ?=\r\n=C2=A0 Ask Frank, I am sure he is up on that.=C2=A0 In other words, show=C2=\r\n=A0me.=C2=A0 Prove it.\n\nI am sure I am a very bad person for asking for suc=\r\nh things, and like I posted, I can deal with that.=C2=A0 All that oil spill=\r\ning out in the gulf is my fault LOL.=C2=A0 Where do you want to go with=C2=\r\n=A0 this? LOL=C2=A0 I will take the blame.=C2=A0 But the QUESTION will rema=\r\nin the same.=C2=A0 It will never change.\n\nI am not in denial of anything, I=\r\n am asking for research, well real research.=C2=A0 So far I get your kinda =\r\ncrap.=C2=A0 You are not helping your cause.=C2=A0 I am not out to get you b=\r\nuddy, so get off the stump!\n=C2=A0&quot;Nature is showing us only the tail of th=\r\ne lion, but I have no doubt that the lion belongs to it even though, becaus=\r\ne of its large size, it cannot totally reveal itself all at once.&quot; \n-=E2=80=\r\n=94 Albert Einstein \n\n\n&quot;It is far better to grasp the universe as it really=\r\n is than to persist in delusions, however satisfying and reassuring.&quot;\n--Car=\r\nl Sagan\n\n\n&quot;There is no such thing as an insignificant detail. Don&#39;t just lo=\r\nok \nfor what you want to find.&quot;\n-- Me LOL \n\n\n\n\n____________________________=\r\n____\nFrom: tim_woolworth &lt;tim@...&gt;\nTo: EVP-ITC@yahoogroups.com\nSe=\r\nnt: Tue, June 1, 2010 10:59:04 PM\nSubject: [EVP-ITC] Re: Nissan the movie.\n=\r\n\n=C2=A0 \n\nI typically refrain from posting on the boards precisely because =\r\nof people like you who feel that their insipid comments are worth hearing. =\r\nThere is nothing wrong with skepticism, hell, I have been in a relationship=\r\n with a laboratory scientist who is an atheist for going on four years now =\r\nso I know what skepticism is supposed to sound like. I hear it everyday. Yo=\r\nur posts do not reflect the nature of skepticism, they reflect outright den=\r\nial. There is a difference betwixt the two, and it is not slight.\n\nWhy? Bec=\r\nause you claim to want irrefutable proof. Yet, you do nothing about it. As =\r\nthe old adage goes, it&#39;s time for you to sh*t or get off the pot. Get your =\r\nhands on a ghost box and start experimenting. There are numerous radios to =\r\nhack yourself, so do it already (granted, a hack is by no means up to par w=\r\nith a Frank&#39;s Box, Minibox, or any of the other guys doing this, but it wil=\r\nl get you started). Then take the time to design controlled experiments to =\r\nbe implemented. Share your results. Write up a paper about it. Follow the s=\r\ncientific method. There are ghost box users all over the country, so I am s=\r\nure you can find someone relatively close to you to work with if you actual=\r\nly want to take the time and responsibility of adding any knowledge to this=\r\n community. \n\nDo something, anything, other than gripe about not having eno=\r\nugh &#39;proof.&#39; Epistemological knowledge has been debated by much better mind=\r\ns for thousands of years and the very notion of proof is still, well, unpro=\r\nvable. Exactly like science. What we believe today may not be true next yea=\r\nr. Talk to any post-modernist in this post-modern society we live in and he=\r\n will tell you that the notion of scientific proof is meaningless precisely=\r\n because its very knowledge base is in constant flux. Gravity may be here t=\r\noday as a constant, but we cannot know with certainty the same will be true=\r\n tomorrow. This is why we have the scientific method to explore variables. =\r\nThis is why skepticism is good. \n\nWe are all individuals, functioning indiv=\r\nidually in this field. We do not have government funding. We do not have Ph=\r\nD&#39;s working on this stuff. We have guys and girls, in their homes and shops=\r\n, trying to understand the incomprehensible. Can you not realize that we al=\r\nl know that the evidence we collect is instantly disprovable and will alway=\r\ns be so? Just the simple fact of audio clips being posted here abnegates th=\r\ne power of empiricism. As you have stated, you are a skeptic. No audio clip=\r\n will provide you with empirical evidence because you did not collect it yo=\r\nurself and therefore too many variables involved make it easily dismissable=\r\n with just an iota of scientific rigor. We accept that, and you cannot. The=\r\nrefore, your mere presence alone on these forums is antagonistic to the wor=\r\nk we do because we can never provide you with proof.\n\nHow can you expect pr=\r\noof when we do not even know with certainty whether we are talking to spiri=\r\nts, ET&#39;s, gods, or frickin unicorns.\n\nHow can you expect proof when the ver=\r\ny nature of spirit and afterlife is wholly unprovable.\n\nHow can you expect =\r\nproof in a yahoo forum? Does not the very nature of a forum defy all skepti=\r\ncal enquiry?\n\nAnd finally, speaking of forums, you are a guest in one run b=\r\ny people who believe this to be true expressly for people who believe likew=\r\nise. \n\nSo why are you here?\n\nSo please, do something to add to the communit=\r\ny and quit relying on others to do it for you. If you keep relying on this =\r\nforum to give you proof, you will always be disappointed because there is n=\r\no proof other than the audio clips you deny. \n\nPeriod.\n\nFor the other forum=\r\n users, I&#39;m sorry to feed the troll this time. I know its best to let them =\r\nstarve, but once in a while you just might be able to shoo them away from t=\r\nhe bridge to allow a safe crossing (yes, pun intended).\n\nTim W.\n--- In EVP-=\r\nITC@yahoogroups.com, Lizzie Broden &lt;yahuli69@...&gt; wrote:\n&gt;\n&gt; Read the one t=\r\nhat was posted before mine.=C3=82=C2=A0 I am here to see if there is any tr=\r\nuth to this.=C3=82=C2=A0 As stated previously, many times, and by your comm=\r\nentary,=C3=82=C2=A0this is very much starting to look like a cult!=C3=82=C2=\r\n=A0 \n&gt; \n&gt; And that is not childish at all.\n&gt; \n&gt; If you have a point to make=\r\n, please do so.=C3=82=C2=A0 And while you are at it stop with the insults, =\r\nbecause that is childish also.=C3=82=C2=A0 I have stated my reason for bein=\r\ng here several times=C3=82=C2=A0before in the past and I harbor no ill will=\r\n to anyone.=C3=82=C2=A0 but I might if you keep it up!=C3=82=C2=A0 Is that =\r\nwhat you want?\n&gt; \n&gt; I want hard evidence, irrefutable evidence, not excuses=\r\n or wishes or could be&#39;s.=C3=82=C2=A0 I want facts.\n&gt; \n&gt; I want nothing mor=\r\ne and nothing less.=C3=82=C2=A0 That is the cold hard=C3=82=C2=A0truth of i=\r\nt all, the ugly necked truth that no one wants to look at.=C3=82=C2=A0 And =\r\nif you want to throw rocks at me, that is fine.=C3=82=C2=A0 I am a very big=\r\n person.=C3=82=C2=A0 But the question will remain the same, with me or with=\r\nout me.=C3=82=C2=A0 Lambaste me to Hattie&#39;s, it will not change=C3=82=C2=A0=\r\none damn=C3=82=C2=A0thing.=C3=82=C2=A0 That question will still be there.\n&gt;=\r\n \n&gt; I would like to say=C3=82=C2=A0and give a thank you to Snowflake for th=\r\ne kind words.=C3=82=C2=A0 They very much touched me in a time when=C3=82=C2=\r\n=A0I needed it.=C3=82=C2=A0 Please go ahead and contact her, but you will n=\r\need to prove it is her you are talking to.=C3=82=C2=A0 And that is not unre=\r\nasonable at all.\n&gt; \n&gt; \n&gt; =C3=82=C2=A0&quot;Nature is showing us only the tail of=\r\n the lion, but I have no doubt that the lion belongs to it even though, bec=\r\nause of its large size, it cannot totally reveal itself all at once.&quot; \n&gt; -=\r\n=C3=A2=E2=82=AC&quot; Albert Einstein \n&gt; \n&gt; \n&gt; &quot;It is far better to grasp the un=\r\niverse as it really is than to persist in delusions, however satisfying and=\r\n reassuring.&quot;\n&gt; --Carl Sagan\n&gt; \n&gt; \n&gt; &quot;There is no such thing as an insignif=\r\nicant detail. Don&#39;t just look \n&gt; for what you want to find.&quot;\n&gt; -- Me LOL \n&gt;=\r\n \n&gt; \n&gt; \n&gt; \n&gt; ________________________________\n&gt; From: JANDANACOSTA &lt;jandan1=\r\n08@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Tue, June 1, 2010 8:51:18 PM\n=\r\n&gt; Subject: Re: [EVP-ITC] Re: Nissan the movie.\n&gt; \n&gt; =C3=82=C2=A0 \n&gt; Exactly=\r\n what is your purpose here? These kind of &quot;drive-by&quot; comments with snide re=\r\nmarks are extremely childish. Commenting on another&#39;s post is more appropri=\r\nate.\n&gt; \n&gt; --- On Tue, 6/1/10, Lizzie Broden &lt;yahuli69@yahoo. com&gt; wrote:\n&gt; =\r\n\n&gt; \n&gt; &gt;From: Lizzie Broden &lt;yahuli69@yahoo. com&gt;\n&gt; &gt;Subject: Re: [EVP-ITC] =\r\nRe: Nissan the movie.\n&gt; &gt;To: EVP-ITC@yahoogroups .com\n&gt; &gt;Date: Tuesday, Jun=\r\ne 1, 2010, 5:39 PM\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;=C3=82=C2=A0 \n&gt; &gt;Damn those Skeptics for maki=\r\nng me think for myself!=C3=82=C2=A0 \n&gt; &gt;\n&gt; &gt;Life and the=C3=82=C2=A0world (=\r\nMight still be flat) would be a much better place if it wasn&#39;t for them!!!!=\r\n\n&gt; &gt;\n&gt; &gt;Oh well, it is what it is =C3=82=C2=A0 Time will tell \n&gt; &gt;\n&gt; &gt;=C3=\r\n=82=C2=A0&quot;Nature is showing us only the tail of the lion, but I have no dou=\r\nbt that the lion belongs to it even though, because of its large size, it c=\r\nannot totally reveal itself all at once.&quot; \n&gt; &gt;-=C3=A2=E2=82=AC&quot; Albert Eins=\r\ntein \n&gt; &gt;\n&gt; &gt;\n&gt; &gt;&quot;It is far better to grasp the universe as it really is th=\r\nan to persist in delusions, however satisfying and reassuring.&quot;\n&gt; &gt;--Carl S=\r\nagan\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;&quot;There is no such thing as an insignificant detail. Don&#39;t j=\r\nust look \n&gt; &gt;for what you want to find.&quot;\n&gt; &gt;-- Me LOL \n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n=\r\n&gt; ________________________________\n&gt; From: Frank Sumption &lt;purplealiengirl@=\r\n gmail.com&gt;\n&gt; &gt;To: EVP-ITC@yahoogroups .com\n&gt; &gt;Sent: Tue, June 1, 2010 8:35=\r\n:29 AM\n&gt; &gt;Subject: Re: [EVP-ITC] Re: Nissan the movie.\n&gt; &gt;\n&gt; &gt;=C3=82=C2=A0 =\r\n\n&gt; &gt;=C3=82=C2=A0Wow! I am amazed.That&#39; s pretty much what I heard! Very rar=\r\ne! See the skeptics acuse people of only hearing what&#39;s labled, and we=C3=\r\n=82=C2=A0just had another round and round about that last week. Thanks!\n&gt; &gt;=\r\n\n&gt; &gt;=C3=82=C2=A0F-S\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;On Tue, Jun 1, 2010 at 12:34 AM, Tim &lt;tjwool=\r\nwo@syr. edu&gt; wrote:\n&gt; &gt;\n&gt; &gt;=C3=82=C2=A0 \n&gt; &gt;&gt;Frank,\n&gt; &gt;&gt;\n&gt; &gt;&gt;Very interesti=\r\nng. It&#39;s been a while since I&#39;ve listenend to your files. The fm on this tu=\r\nner sounds really active; the Others are definitely chatty on this band. \n&gt;=\r\n &gt;&gt;\n&gt; &gt;&gt;This is what I hear (in studio grade headphones):\n&gt; &gt;&gt;\n&gt; &gt;&gt;Your AM =\r\nfile @ 03 secs: &quot;Here Prin Cess&quot; (male + two escalating tones)\n&gt; &gt;&gt;@ 11 sec=\r\ns: &quot;Be sure (static) good news&quot; (male)\n&gt; &gt;&gt;\n&gt; &gt;&gt;Your FM file @ 01 secs: &quot;Tr=\r\nying to get through&quot; (in female tones)\n&gt; &gt;&gt;@ 03 secs: &quot;It don&#39;t ?boost? rig=\r\nht&quot; (male then two tones)\n&gt; &gt;&gt;@ 05 secs: &quot;Closer to cooperating? &quot; (male, f=\r\nirst vowel sound is hard and second vowel sound in this word is a soft &#39;a&#39; =\r\nor &#39;o&#39; so it cannot be calamity)\n&gt; &gt;&gt;@ 06 secs: &quot;Till we&#39;re done&quot; (female, =\r\nfast)\n&gt; &gt;&gt;@ 08 secs: &quot;Frank&quot; (male)\n&gt; &gt;&gt;@ 09 secs: &quot;Hi&quot; (female singing, dr=\r\nawn out) \n&gt; &gt;&gt;@ 11 secs: &quot;How you doing&quot; (male)\n&gt; &gt;&gt;@ 14 secs: &quot;Hi&quot; (female=\r\n or child)\n&gt; &gt;&gt;\n&gt; &gt;&gt;Tim W. \n&gt; &gt;&gt;\n&gt; &gt;&gt;\n&gt; &gt;&gt;--- In EVP-ITC@yahoogroups .com, =\r\nFrank Sumption &lt;purplealiengirl@ ...&gt; wrote:\n&gt; &gt;&gt;&gt;\n&gt; &gt;&gt;&gt; This is case no on=\r\ne was wondering. In the AM video at 9 seconds &quot;this is\n&gt; &gt;&gt;&gt; Otto&quot;, an ever=\r\n present past life friend. In FM at 5 seconds &quot;gettin&#39; closer\n&gt; &gt;&gt;&gt; to cala=\r\nmity&quot; Calamityville horror? Who&#39;s Thomas Pane? (at the)\n&gt; &gt;&gt;&gt; \n&gt; &gt;&gt;&gt; F-S\n&gt; =\r\n&gt;&gt;&gt;\n&gt; &gt;&gt;\n&gt; &gt;&gt;\n&gt; &gt;\n&gt; &gt;\n&gt;\n\n\n\n\n\n      \r\n--0-1592028508-1275454785=:37484\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;&lt;head&gt;&lt;style type=3D&quot;text/css&quot;&gt;&lt;!-- DIV {margin:0px;} --&gt;&lt;/style&gt;&lt;/he=\r\nad&gt;&lt;body&gt;&lt;div style=3D&quot;font-family:arial, helvetica, sans-serif;font-size:1=\r\n2pt&quot;&gt;&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;I don&#39;t know you from Adam, but you jump around a lot=\r\n and make asumptions about what I believe and dont believe.&lt;/DIV&gt;\n&lt;DIV&gt;&nbs=\r\np;&lt;/DIV&gt;\n&lt;DIV&gt;Kinda typicial aint it?&nbsp; &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I=\r\n am sorry&nbsp;I skimmed your post, as it is very much standard BS.&lt;/DIV&gt;\n&lt;=\r\nDIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I am not in denial of anything, and if it is real I v=\r\nery much want to learn about it.&nbsp; But this almost religious furvor you=\r\n people have for this.&nbsp; This unquestioning and going after anyone that=\r\n presents you with fundamental logic and critical thinking, is a bit insult=\r\ning.&nbsp; &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I am sorry if logic,&nbsp;science,=\r\n critical thinking and basic comon sence is threating to you.&nbsp; That is=\r\n not my intention in the least.&nbsp; LOOK AND STOP&nbsp; IF any of this is=\r\n real, it needs to be tested and understood.&nbsp; So far, I aint seen that=\r\n crap! LOL&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Your Guroue over there made the sta=\r\ntment that no contrabutions&nbsp;from Science have ever beinfited mankind.&=\r\nnbsp; Mull that statment over in your brain and think about how ignorant an=\r\nd assinie that is.&nbsp; That is a fools arron.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DI=\r\nV&gt;So I shut my mouth, yet here we are again.&nbsp; Bring me the body, Latin=\r\n Ducuis&nbsp;Tetium (My Latin sucks) ?&nbsp; Ask Frank, I am sure he is up =\r\non that.&nbsp; In other words, show&nbsp;me.&nbsp; Prove it.&lt;/DIV&gt;\n&lt;DIV&gt;&nb=\r\nsp;&lt;/DIV&gt;\n&lt;DIV&gt;I am sure I am a very bad person for asking for such things,=\r\n and like I posted, I can deal with that.&nbsp; All that oil spilling out i=\r\nn the gulf is my fault LOL.&nbsp; Where do you want to go with&nbsp; this? =\r\nLOL&nbsp; I will take the blame.&nbsp; But the QUESTION will remain the sam=\r\ne.&nbsp; It will never change.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I am not in den=\r\nial of anything, I am asking for research, well real research.&nbsp; So far=\r\n I get your kinda crap.&nbsp; You are not helping your cause.&nbsp; I am no=\r\nt out to get you buddy, so get off the stump!&lt;BR&gt;&nbsp;&lt;/DIV&gt;&quot;Nature is sho=\r\nwing us only the tail of the lion, but I have no doubt that the lion belong=\r\ns to it even though, because of its large size, it cannot totally reveal it=\r\nself all at once.&quot; &lt;BR&gt;-=E2=80=94 Albert Einstein \n&lt;DIV&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;DIV=\r\n&gt;&quot;It is far better to grasp the universe as it really is than to persist in=\r\n delusions, however satisfying and reassuring.&quot;&lt;BR&gt;--Carl Sagan&lt;/DIV&gt;&lt;BR&gt;&lt;B=\r\nR&gt;\n&lt;DIV&gt;&quot;There is no such thing as an insignificant detail. Don&#39;t just look=\r\n &lt;BR&gt;for what you want to find.&quot;&lt;BR&gt;-- Me LOL \n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV style=\r\n=3D&quot;FONT-SIZE: 12pt; FONT-FAMILY: arial, helvetica, sans-serif&quot;&gt;&lt;BR&gt;\n&lt;DIV s=\r\ntyle=3D&quot;PADDING-LEFT: 5px; FONT-SIZE: 12pt; MARGIN: 5px 0px 5px 5px; BORDER=\r\n-LEFT: #1010ff 2px solid; FONT-FAMILY: times new roman, new york, times, se=\r\nrif&quot;&gt;&lt;FONT face=3DTahoma size=3D2&gt;\n&lt;HR SIZE=3D1&gt;\n&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEI=\r\nGHT: bold&quot;&gt;From:&lt;/SPAN&gt;&lt;/B&gt; tim_woolworth &lt;tim@...&gt;&lt;BR&gt;&lt;B&gt;&lt;=\r\nSPAN style=3D&quot;FONT-WEIGHT: bold&quot;&gt;To:&lt;/SPAN&gt;&lt;/B&gt; EVP-ITC@yahoogroups.com&lt;BR&gt;=\r\n&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: bold&quot;&gt;Sent:&lt;/SPAN&gt;&lt;/B&gt; Tue, June 1, 2010 10:=\r\n59:04 PM&lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: bold&quot;&gt;Subject:&lt;/SPAN&gt;&lt;/B&gt; [EVP-I=\r\nTC] Re: Nissan the movie.&lt;BR&gt;&lt;/FONT&gt;&lt;BR&gt;&lt;SPAN style=3D&quot;DISPLAY: none&quot;&gt;&nbsp=\r\n;&lt;/SPAN&gt; \n&lt;DIV id=3Dygrp-text&gt;\n&lt;P&gt;&lt;BR&gt;I typically refrain from posting on t=\r\nhe boards precisely because of people like you who feel that their insipid =\r\ncomments are worth hearing. There is nothing wrong with skepticism, hell, I=\r\n have been in a relationship with a laboratory scientist who is an atheist =\r\nfor going on four years now so I know what skepticism is supposed to sound =\r\nlike. I hear it everyday. Your posts do not reflect the nature of skepticis=\r\nm, they reflect outright denial. There is a difference betwixt the two, and=\r\n it is not slight.&lt;BR&gt;&lt;BR&gt;Why? Because you claim to want irrefutable proof.=\r\n Yet, you do nothing about it. As the old adage goes, it&#39;s time for you to =\r\nsh*t or get off the pot. Get your hands on a ghost box and start experiment=\r\ning. There are numerous radios to hack yourself, so do it already (granted,=\r\n a hack is by no means up to par with a Frank&#39;s Box, Minibox, or any of the=\r\n other guys doing this, but it will get you started). Then take the time to=\r\n design controlled\n experiments to be implemented. Share your results. Writ=\r\ne up a paper about it. Follow the scientific method. There are ghost box us=\r\ners all over the country, so I am sure you can find someone relatively clos=\r\ne to you to work with if you actually want to take the time and responsibil=\r\nity of adding any knowledge to this community. &lt;BR&gt;&lt;BR&gt;Do something, anythi=\r\nng, other than gripe about not having enough &#39;proof.&#39; Epistemological knowl=\r\nedge has been debated by much better minds for thousands of years and the v=\r\nery notion of proof is still, well, unprovable. Exactly like science. What =\r\nwe believe today may not be true next year. Talk to any post-modernist in t=\r\nhis post-modern society we live in and he will tell you that the notion of =\r\nscientific proof is meaningless precisely because its very knowledge base i=\r\ns in constant flux. Gravity may be here today as a constant, but we cannot =\r\nknow with certainty the same will be true tomorrow. This is why we have the=\r\n scientific\n method to explore variables. This is why skepticism is good. &lt;=\r\nBR&gt;&lt;BR&gt;We are all individuals, functioning individually in this field. We d=\r\no not have government funding. We do not have PhD&#39;s working on this stuff. =\r\nWe have guys and girls, in their homes and shops, trying to understand the =\r\nincomprehensible. Can you not realize that we all know that the evidence we=\r\n collect is instantly disprovable and will always be so? Just the simple fa=\r\nct of audio clips being posted here abnegates the power of empiricism. As y=\r\nou have stated, you are a skeptic. No audio clip will provide you with empi=\r\nrical evidence because you did not collect it yourself and therefore too ma=\r\nny variables involved make it easily dismissable with just an iota of scien=\r\ntific rigor. We accept that, and you cannot. Therefore, your mere presence =\r\nalone on these forums is antagonistic to the work we do because we can neve=\r\nr provide you with proof.&lt;BR&gt;&lt;BR&gt;How can you expect proof when we do not ev=\r\nen\n know with certainty whether we are talking to spirits, ET&#39;s, gods, or f=\r\nrickin unicorns.&lt;BR&gt;&lt;BR&gt;How can you expect proof when the very nature of sp=\r\nirit and afterlife is wholly unprovable.&lt;BR&gt;&lt;BR&gt;How can you expect proof in=\r\n a yahoo forum? Does not the very nature of a forum defy all skeptical enqu=\r\niry?&lt;BR&gt;&lt;BR&gt;And finally, speaking of forums, you are a guest in one run by =\r\npeople who believe this to be true expressly for people who believe likewis=\r\ne. &lt;BR&gt;&lt;BR&gt;So why are you here?&lt;BR&gt;&lt;BR&gt;So please, do something to add to th=\r\ne community and quit relying on others to do it for you. If you keep relyin=\r\ng on this forum to give you proof, you will always be disappointed because =\r\nthere is no proof other than the audio clips you deny. &lt;BR&gt;&lt;BR&gt;Period.&lt;BR&gt;&lt;=\r\nBR&gt;For the other forum users, I&#39;m sorry to feed the troll this time. I know=\r\n its best to let them starve, but once in a while you just might be able to=\r\n shoo them away from the bridge to allow a safe crossing (yes, pun\n intende=\r\nd).&lt;BR&gt;&lt;BR&gt;Tim W.&lt;BR&gt;--- In &lt;A href=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot; ta=\r\nrget=3D_blank rel=3Dnofollow ymailto=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;E=\r\nVP-ITC@yahoogroups.com&lt;/A&gt;, Lizzie Broden &lt;yahuli69@...&gt; wrote:&lt;BR&gt;&g=\r\nt;&lt;BR&gt;&gt; Read the one that was posted before mine.=C3=82&nbsp; I am here =\r\nto see if there is any truth to this.=C3=82&nbsp; As stated previously, man=\r\ny times, and by your commentary,=C3=82&nbsp;this is very much starting to l=\r\nook like a cult!=C3=82&nbsp; &lt;BR&gt;&gt; &lt;BR&gt;&gt; And that is not childish at =\r\nall.&lt;BR&gt;&gt; &lt;BR&gt;&gt; If you have a point to make, please do so.=C3=82&nbsp=\r\n; And while you are at it stop with the insults, because that is childish a=\r\nlso.=C3=82&nbsp; I have stated my reason for being here several times=C3=82=\r\n&nbsp;before in the past and I harbor no ill will to anyone.=C3=82&nbsp; bu=\r\nt I might if you keep it up!=C3=82&nbsp; Is that what you want?&lt;BR&gt;&gt; &lt;BR=\r\n&gt;&gt; I want hard evidence, irrefutable evidence, not excuses or wishes or =\r\ncould be&#39;s.=C3=82&nbsp; I want\n facts.&lt;BR&gt;&gt; &lt;BR&gt;&gt; I want nothing more=\r\n and nothing less.=C3=82&nbsp; That is the cold hard=C3=82&nbsp;truth of it=\r\n all, the ugly necked truth that no one wants to look at.=C3=82&nbsp; And i=\r\nf you want to throw rocks at me, that is fine.=C3=82&nbsp; I am a very big =\r\nperson.=C3=82&nbsp; But the question will remain the same, with me or witho=\r\nut me.=C3=82&nbsp; Lambaste me to Hattie&#39;s, it will not change=C3=82&nbsp;o=\r\nne damn=C3=82&nbsp;thing.=C3=82&nbsp; That question will still be there.&lt;BR=\r\n&gt;&gt; &lt;BR&gt;&gt; I would like to say=C3=82&nbsp;and give a thank you to Snowf=\r\nlake for the kind words.=C3=82&nbsp; They very much touched me in a time wh=\r\nen=C3=82&nbsp;I needed it.=C3=82&nbsp; Please go ahead and contact her, but=\r\n you will need to prove it is her you are talking to.=C3=82&nbsp; And that =\r\nis not unreasonable at all.&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; =C3=82&nbsp;&quot;Nature i=\r\ns showing us only the tail of the lion, but I have no doubt that the lion b=\r\nelongs to it even though, because of its large size, it cannot totally reve=\r\nal itself\n all at once.&quot; &lt;BR&gt;&gt; -=C3=A2=E2=82=AC&quot; Albert Einstein &lt;BR&gt;&gt=\r\n; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &quot;It is far better to grasp the universe as it really is=\r\n than to persist in delusions, however satisfying and reassuring.&quot;&lt;BR&gt;&gt; =\r\n--Carl Sagan&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &quot;There is no such thing as an insign=\r\nificant detail. Don&#39;t just look &lt;BR&gt;&gt; for what you want to find.&quot;&lt;BR&gt;&gt=\r\n; -- Me LOL &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; __________________=\r\n______________&lt;BR&gt;&gt; From: JANDANACOSTA &lt;jandan108@...&gt;&lt;BR&gt;&gt; To:=\r\n &lt;A href=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot; target=3D_blank rel=3Dnofollo=\r\nw ymailto=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups.com&lt;/A&gt;&lt;=\r\nBR&gt;&gt; Sent: Tue, June 1, 2010 8:51:18 PM&lt;BR&gt;&gt; Subject: Re: [EVP-ITC] R=\r\ne: Nissan the movie.&lt;BR&gt;&gt; &lt;BR&gt;&gt; =C3=82&nbsp; &lt;BR&gt;&gt; Exactly what is=\r\n your purpose here? These kind of &quot;drive-by&quot; comments with snide remarks ar=\r\ne extremely childish. Commenting on another&#39;s post is more appropriate.&lt;BR&gt;=\r\n&gt; &lt;BR&gt;&gt; --- On Tue,\n 6/1/10, Lizzie Broden &lt;yahuli69@yahoo. com&gt=\r\n; wrote:&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &gt;From: Lizzie Broden &lt;yahuli69@yah=\r\noo. com&gt;&lt;BR&gt;&gt; &gt;Subject: Re: [EVP-ITC] Re: Nissan the movie.&lt;BR&gt;&gt=\r\n; &gt;To: EVP-ITC@yahoogroups .com&lt;BR&gt;&gt; &gt;Date: Tuesday, June 1, 2010,=\r\n 5:39 PM&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt;=C3=82&nbsp; &lt;BR&gt;&gt; &gt;Da=\r\nmn those Skeptics for making me think for myself!=C3=82&nbsp; &lt;BR&gt;&gt; &gt;=\r\n&lt;BR&gt;&gt; &gt;Life and the=C3=82&nbsp;world (Might still be flat) would be a=\r\n much better place if it wasn&#39;t for them!!!!&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt;Oh we=\r\nll, it is what it is =C3=82&nbsp; Time will tell &lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt;=\r\n=C3=82&nbsp;&quot;Nature is showing us only the tail of the lion, but I have no =\r\ndoubt that the lion belongs to it even though, because of its large size, i=\r\nt cannot totally reveal itself all at once.&quot; &lt;BR&gt;&gt; &gt;-=C3=A2=E2=82=AC&quot;=\r\n Albert Einstein &lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt;&quot;It is far better t=\r\no grasp the universe as it really is than to\n persist in delusions, however=\r\n satisfying and reassuring.&quot;&lt;BR&gt;&gt; &gt;--Carl Sagan&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; =\r\n&gt;&lt;BR&gt;&gt; &gt;&quot;There is no such thing as an insignificant detail. Don&#39;t =\r\njust look &lt;BR&gt;&gt; &gt;for what you want to find.&quot;&lt;BR&gt;&gt; &gt;-- Me LOL &lt;B=\r\nR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; ___=\r\n_____________________________&lt;BR&gt;&gt; From: Frank Sumption &lt;purplealieng=\r\nirl@ gmail.com&gt;&lt;BR&gt;&gt; &gt;To: EVP-ITC@yahoogroups .com&lt;BR&gt;&gt; &gt;Sen=\r\nt: Tue, June 1, 2010 8:35:29 AM&lt;BR&gt;&gt; &gt;Subject: Re: [EVP-ITC] Re: Niss=\r\nan the movie.&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt;=C3=82&nbsp; &lt;BR&gt;&gt; &gt;=C3=82&nbs=\r\np;Wow! I am amazed.That&#39; s pretty much what I heard! Very rare! See the ske=\r\nptics acuse people of only hearing what&#39;s labled, and we=C3=82&nbsp;just ha=\r\nd another round and round about that last week. Thanks!&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt=\r\n; &gt;=C3=82&nbsp;F-S&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt;On Tue, Jun 1, =\r\n2010 at 12:34 AM, Tim &lt;tjwoolwo@syr. edu&gt;\n wrote:&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt=\r\n; &gt;=C3=82&nbsp; &lt;BR&gt;&gt; &gt;&gt;Frank,&lt;BR&gt;&gt; &gt;&gt;&lt;BR&gt;&gt; &gt;&gt=\r\n;Very interesting. It&#39;s been a while since I&#39;ve listenend to your files. Th=\r\ne fm on this tuner sounds really active; the Others are definitely chatty o=\r\nn this band. &lt;BR&gt;&gt; &gt;&gt;&lt;BR&gt;&gt; &gt;&gt;This is what I hear (in stud=\r\nio grade headphones):&lt;BR&gt;&gt; &gt;&gt;&lt;BR&gt;&gt; &gt;&gt;Your AM file @ 03 se=\r\ncs: &quot;Here Prin Cess&quot; (male + two escalating tones)&lt;BR&gt;&gt; &gt;&gt;@ 11 sec=\r\ns: &quot;Be sure (static) good news&quot; (male)&lt;BR&gt;&gt; &gt;&gt;&lt;BR&gt;&gt; &gt;&gt;You=\r\nr FM file @ 01 secs: &quot;Trying to get through&quot; (in female tones)&lt;BR&gt;&gt; &gt;=\r\n&gt;@ 03 secs: &quot;It don&#39;t ?boost? right&quot; (male then two tones)&lt;BR&gt;&gt; &gt;&=\r\ngt;@ 05 secs: &quot;Closer to cooperating? &quot; (male, first vowel sound is hard an=\r\nd second vowel sound in this word is a soft &#39;a&#39; or &#39;o&#39; so it cannot be cala=\r\nmity)&lt;BR&gt;&gt; &gt;&gt;@ 06 secs: &quot;Till we&#39;re done&quot; (female, fast)&lt;BR&gt;&gt; &=\r\ngt;&gt;@ 08 secs: &quot;Frank&quot; (male)&lt;BR&gt;&gt;\n &gt;&gt;@ 09 secs: &quot;Hi&quot; (female s=\r\ninging, drawn out) &lt;BR&gt;&gt; &gt;&gt;@ 11 secs: &quot;How you doing&quot; (male)&lt;BR&gt;&g=\r\nt; &gt;&gt;@ 14 secs: &quot;Hi&quot; (female or child)&lt;BR&gt;&gt; &gt;&gt;&lt;BR&gt;&gt; &gt;&=\r\ngt;Tim W. &lt;BR&gt;&gt; &gt;&gt;&lt;BR&gt;&gt; &gt;&gt;&lt;BR&gt;&gt; &gt;&gt;--- In EVP-ITC=\r\n@yahoogroups .com, Frank Sumption &lt;purplealiengirl@ ...&gt; wrote:&lt;BR&gt;&g=\r\nt; &gt;&gt;&gt;&lt;BR&gt;&gt; &gt;&gt;&gt; This is case no one was wondering. In =\r\nthe AM video at 9 seconds &quot;this is&lt;BR&gt;&gt; &gt;&gt;&gt; Otto&quot;, an ever pres=\r\nent past life friend. In FM at 5 seconds &quot;gettin&#39; closer&lt;BR&gt;&gt; &gt;&gt;&g=\r\nt; to calamity&quot; Calamityville horror? Who&#39;s Thomas Pane? (at the)&lt;BR&gt;&gt; &=\r\ngt;&gt;&gt; &lt;BR&gt;&gt; &gt;&gt;&gt; F-S&lt;BR&gt;&gt; &gt;&gt;&gt;&lt;BR&gt;&gt; &gt;&gt;=\r\n&lt;BR&gt;&gt; &gt;&gt;&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/P&gt;&lt;/DIV&gt;\n&lt;STYL=\r\nE type=3Dtext/css&gt; &lt;!-- #ygrp-mkp { border:1px solid #d8d8d8;font-family:Ar=\r\nial;margin:10px 0;padding:0 10px;}  #ygrp-mkp hr { border:1px solid #d8d8d8=\r\n;}  #ygrp-mkp #hd { color:#628c2a;font-size:85%;font-weight:700;line-height=\r\n:122%;margin:10px 0;}  #ygrp-mkp #ads { margin-bottom:10px;}  #ygrp-mkp .ad=\r\n { padding:0 0;}  #ygrp-mkp .ad a { color:#0000ff;text-decoration:none;} #y=\r\ngrp-sponsor #ygrp-lc { font-family:Arial;}  #ygrp-sponsor #ygrp-lc #hd { ma=\r\nrgin:10px 0px;font-weight:700;font-size:78%;line-height:122%;}  #ygrp-spons=\r\nor #ygrp-lc .ad { margin-bottom:10px;padding:0 0;}  a { color:#1e66ae;}  #a=\r\nctions { font-family:Verdana;font-size:11px;padding:10px 0;}  #activity { b=\r\nackground-color:#e0ecee;float:left;font-family:Verdana;font-size:10px;paddi=\r\nng:10px;}  #activity span { font-weight:700;}  #activity span:first-child {=\r\n text-transform:uppercase;}  #activity span a { color:#5085b6;text-decorati=\r\non:none;}  #activity span span { color:#ff7900;}  #activity span\n .underlin=\r\ne { text-decoration:underline;}  .attach { clear:both;display:table;font-fa=\r\nmily:Arial;font-size:12px;padding:10px 0;width:400px;}  .attach div a { tex=\r\nt-decoration:none;}  .attach img { border:none;padding-right:5px;}  .attach=\r\n label { display:block;margin-bottom:5px;}  .attach label a { text-decorati=\r\non:none;}  blockquote { margin:0 0 0 4px;}  .bold { font-family:Arial;font-=\r\nsize:13px;font-weight:700;}  .bold a { text-decoration:none;}  dd.last p a =\r\n{ font-family:Verdana;font-weight:700;}  dd.last p span { margin-right:10px=\r\n;font-family:Verdana;font-weight:700;}  dd.last p span.yshortcuts { margin-=\r\nright:0;}  div.attach-table div div a { text-decoration:none;}  div.attach-=\r\ntable { width:400px;}  div.file-title a, div.file-title a:active, div.file-=\r\ntitle a:hover, div.file-title a:visited { text-decoration:none;}  div.photo=\r\n-title a, div.photo-title a:active, div.photo-title a:hover, div.photo-titl=\r\ne a:visited { text-decoration:none;}  div#ygrp-mlmsg\n #ygrp-msg p a span.ys=\r\nhortcuts { font-family:Verdana;font-size:10px;font-weight:normal;}  .green =\r\n{ color:#628c2a;}  .MsoNormal { margin:0 0 0 0;}  o { font-size:0;}  #photo=\r\ns div { float:left;width:72px;}  #photos div div { border:1px solid #666666=\r\n;height:62px;overflow:hidden;width:62px;}  #photos div label { color:#66666=\r\n6;font-size:10px;overflow:hidden;text-align:center;white-space:nowrap;width=\r\n:64px;}  #reco-category { font-size:77%;}  #reco-desc { font-size:77%;}  .r=\r\neplbq { margin:4px;}  #ygrp-actbar div a:first-child { margin-right:2px;pad=\r\nding-right:5px;}  #ygrp-mlmsg { font-size:13px;font-family:Arial, helvetica=\r\n, clean, sans-serif;}  #ygrp-mlmsg table { font-size:inherit;font:100%;}  #=\r\nygrp-mlmsg select, input, textarea { font:99% Arial, Helvetica, clean, sans=\r\n-serif;}  #ygrp-mlmsg pre, code { font:115% monospace;}  #ygrp-mlmsg * { li=\r\nne-height:1.22em;}  #ygrp-mlmsg #logo { padding-bottom:10px;}  #ygrp-mlmsg =\r\na { color:#1E66AE;}  #ygrp-msg p a {\n font-family:Verdana;}  #ygrp-msg p#at=\r\ntach-count span { color:#1E66AE;font-weight:700;}  #ygrp-reco #reco-head { =\r\ncolor:#ff7900;font-weight:700;}  #ygrp-reco { margin-bottom:20px;padding:0p=\r\nx;}  #ygrp-sponsor #ov li a { font-size:130%;text-decoration:none;}  #ygrp-=\r\nsponsor #ov li { font-size:77%;list-style-type:square;padding:6px 0;}  #ygr=\r\np-sponsor #ov ul { margin:0;padding:0 0 0 8px;}  #ygrp-text { font-family:G=\r\neorgia;}  #ygrp-text p { margin:0 0 1em 0;}  #ygrp-text tt { font-size:120%=\r\n;}  #ygrp-vital ul li:last-child { border-right:none !important; } --&gt; &lt;/ST=\r\nYLE&gt;\n&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/div&gt;&lt;br&gt;\n\n      &lt;/body&gt;&lt;/html&gt;\r\n--0-1592028508-1275454785=:37484--"}