{"id": "17419", "subject": "Re: [EVP-ITC] Re: Nissan the movie.", "author": "Zack Widup", "timestamp": "2010-06-02T13:39:01Z", "full_text": "Frank, I think you&#39;re confusing science and scientists. Science is supposed\nto be a body of knowledge that can explain all known phenomena and predict\nnew ones not yet observed. That&#39;s all it is. In a few rare cases, a landmark\npiece of work does just that.\n\nOne example is James Clerk Maxwell&#39;s &quot;A Treatise on Electricity and\nMagnetism.&quot; Not only did it explain all electromagnetic phenomena observable\n(except a couple which were explained by refinements) but it predicted\nthings not known at the time Maxwell wrote it. Like Vivaldi antennas.\n\nScientists are supposed to look for holes in the existing theories and\nimprove on them so they can explain all phenomena. An example is the Bohr\ntheory of the atom. It did a great job of predicting the spectral lines of\nhydrogen - the Lyman, Balmer, H series etc. But it didn&#39;t do so well\nexplaining the spectral lines of things like uranium. So other theories had\nto come about. And they did. They do a pretty good job of explaining\nexisting phenomena and predicting as yet unknown phenomena but they still\nhave their flaws.\nHowever, it is true that some scientists have adopted certain arenas of\nscience almost as religions. But note physics deals with PHYSICAL things -\nit says so right in its name. So does chemistry. It&#39;s great if you want\nbetter batteries, automobile engines or radios. But we&#39;re dealing with\nsomething here on this group that&#39;s non-physical. To the best I can\ndetermine, EVP and ITC are produced by spirits. These spirits transcend the\nphysical and only use the physical universe for their own purposes.\n\nEvidently the one thing they love to do is comunicate, whether it be from\nwithin a human body or outside it or from who knows where. And they are not\npredictable. Science, in dealing with the physical, is not going to explain\nany of this phenomena. Very little is actually known in the realm of\nspirits. Mostly what I see is beliefs. Everyone seems to have their own\nbeliefs in this arena; some agree and some conflict. But no one seems to\nhave any proof of anything that would take it out of the realm of belief,\nexcept that the phenomena do exist.\n\nI wish I knew how the EVP voices can make words that appear at twice or half\nthe rate of normal speech, talk backwards, etc. I&#39;d like to learn those\ntricks! And I still don&#39;t know what to think about shadow people. I have\nseen them with my own eyes many, many times. So have others I was with. I\nhaven&#39;t been successful at photographing them. For some reason the ones I&#39;ve\nexperienced can be seen by human eyes but not photographed. Science lets us\ndown on that one. A lot of people think shadow people are evil but I have\nnever felt that from them. Again, that&#39;s a belief. No one has proof of it. I\nhave felt &quot;evil&quot; from other things. Maybe I&#39;ll tell you about one of these\n&quot;things&quot; that was existing in someone&#39;s attic once. Man, talk about an evil\npresence! But I never got that from shadow people.\n\nSorry for going on so long; I just wanted to point out that science and\nscientists are not the same thing and that science has indeed given us some\nthings (like Velcro cable ties - the greatest invention of whatever century\nit was invented in).\n:-)\n\nZack\n\n\nOn Wed, Jun 2, 2010 at 7:48 AM, Frank Sumption &lt;purplealiengirl@...&gt;wrote:\n\n&gt;\n&gt;\n&gt;  No difference between the skeptic and the religious twits, try to force\n&gt; their beliefs on everyone else. Science taliban or religious taliban--same\n&gt; effect!  I&#39;ve had a gut full of both!\n&gt;\n&gt;  F-S\n&gt;\n&gt;   On Tue, Jun 1, 2010 at 6:39 PM, Lizzie Broden &lt;yahuli69@...&gt;wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;  Damn those Skeptics for making me think for myself!\n&gt;&gt;\n&gt;&gt; Life and the world (Might still be flat) would be a much better place if\n&gt;&gt; it wasn&#39;t for them!!!!\n&gt;&gt;\n&gt;&gt; Oh well, it is what it is   Time will tell\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; &quot;Nature is showing us only the tail of the lion, but I have no doubt that\n&gt;&gt; the lion belongs to it even though, because of its large size, it cannot\n&gt;&gt; totally reveal itself all at once.&quot;\n&gt;&gt; -— Albert Einstein\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; &quot;It is far better to grasp the universe as it really is than to persist in\n&gt;&gt; delusions, however satisfying and reassuring.&quot;\n&gt;&gt; --Carl Sagan\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; &quot;There is no such thing as an insignificant detail. Don&#39;t just look\n&gt;&gt; for what you want to find.&quot;\n&gt;&gt; -- Me LOL\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;  ------------------------------\n&gt;&gt; *From:* Frank Sumption &lt;purplealiengirl@gmail.com&gt;\n&gt;&gt; *To:* EVP-ITC@yahoogroups.com\n&gt;&gt; *Sent:* Tue, June 1, 2010 8:35:29 AM\n&gt;&gt; *Subject:* Re: [EVP-ITC] Re: Nissan the movie.\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;  Wow! I am amazed.That&#39;s pretty much what I heard! Very rare! See the\n&gt;&gt; skeptics acuse people of only hearing what&#39;s labled, and we just had another\n&gt;&gt; round and round about that last week. Thanks!\n&gt;&gt;\n&gt;&gt;  F-S\n&gt;&gt;\n&gt;&gt; On Tue, Jun 1, 2010 at 12:34 AM, Tim &lt;tjwoolwo@syr. edu&lt;tjwoolwo@...&gt;\n&gt;&gt; &gt; wrote:\n&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt; Frank,\n&gt;&gt;&gt;\n&gt;&gt;&gt; Very interesting. It&#39;s been a while since I&#39;ve listenend to your files.\n&gt;&gt;&gt; The fm on this tuner sounds really active; the Others are definitely chatty\n&gt;&gt;&gt; on this band.\n&gt;&gt;&gt;\n&gt;&gt;&gt; This is what I hear (in studio grade headphones):\n&gt;&gt;&gt;\n&gt;&gt;&gt; Your AM file @ 03 secs: &quot;Here Prin Cess&quot; (male + two escalating tones)\n&gt;&gt;&gt; @ 11 secs: &quot;Be sure (static) good news&quot; (male)\n&gt;&gt;&gt;\n&gt;&gt;&gt; Your FM file @ 01 secs: &quot;Trying to get through&quot; (in female tones)\n&gt;&gt;&gt; @ 03 secs: &quot;It don&#39;t ?boost? right&quot; (male then two tones)\n&gt;&gt;&gt; @ 05 secs: &quot;Closer to cooperating?&quot; (male, first vowel sound is hard and\n&gt;&gt;&gt; second vowel sound in this word is a soft &#39;a&#39; or &#39;o&#39; so it cannot be\n&gt;&gt;&gt; calamity)\n&gt;&gt;&gt; @ 06 secs: &quot;Till we&#39;re done&quot; (female, fast)\n&gt;&gt;&gt; @ 08 secs: &quot;Frank&quot; (male)\n&gt;&gt;&gt; @ 09 secs: &quot;Hi&quot; (female singing, drawn out)\n&gt;&gt;&gt; @ 11 secs: &quot;How you doing&quot; (male)\n&gt;&gt;&gt; @ 14 secs: &quot;Hi&quot; (female or child)\n&gt;&gt;&gt;\n&gt;&gt;&gt; Tim W.\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt; --- In EVP-ITC@yahoogroups .com &lt;EVP-ITC%40yahoogroups.com&gt;, Frank\n&gt;&gt;&gt; Sumption &lt;purplealiengirl@ ...&gt; wrote:\n&gt;&gt;&gt; &gt;\n&gt;&gt;&gt; &gt; This is case no one was wondering. In the AM video at 9 seconds &quot;this\n&gt;&gt;&gt; is\n&gt;&gt;&gt; &gt; Otto&quot;, an ever present past life friend. In FM at 5 seconds &quot;gettin&#39;\n&gt;&gt;&gt; closer\n&gt;&gt;&gt; &gt; to calamity&quot; Calamityville horror? Who&#39;s Thomas Pane? (at the)\n&gt;&gt;&gt; &gt;\n&gt;&gt;&gt; &gt; F-S\n&gt;&gt;&gt; &gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;  \n&gt;\n\nF ank, I hink you' e con using science and scien is s. Science is supposed o be a body o knowledge ha can explain all known phenomena and p edic new ones no ye obse ed. Tha 's all i is. In a ew a e cases, a landma k piece o wo k does jus ha .\n\n \nOne example is James Cle k Maxwell's \"A T ea ise on Elec ici y and Magne ism.\" No only did i explain all elec omagne ic phenomena obse able (excep a couple which we e explained by e inemen s) bu i p edic ed hings no known a he ime Maxwell w o e i . Like Vi aldi an ennas.\n\n \nScien is s a e supposed o look o holes in he exis ing heo ies and imp o e on hem so hey can explain all phenomena. An example is he Boh heo y o he a om. I did a g ea job o p edic ing he spec al lines o hyd ogen - he Lyman, Balme , H se ies e c. Bu i didn' do so well explaining he spec al lines o hings like u anium. So o he heo ies had o come abou . And hey did. They do a p e y good job o explaining exis ing phenomena and p edic ing as ye unknown phenomena bu hey s ill ha e hei laws. \n\nHowe e , i is ue ha some scien is s ha e adop ed ce ain a enas o science almos as eligions. Bu no e physics deals wi h PHYSICAL hings - i says so igh in i s name. So does chemis y. I 's g ea i you wan be e ba e ies, au omobile engines o adios. Bu we' e dealing wi h some hing he e on his g oup  ha 's non-physical. To he bes I can de e mine, EVP and ITC a e p oduced by spi i s. These spi i s anscend he physical and only use he physical uni e se o hei own pu poses. \n\n \nE iden ly he one hing hey lo e o do is comunica e, whe he i be om wi hin a human body o ou side i o om who knows whe e. And hey a e no p edic able. Science, in dealing wi h he physical, is no going o explain any o his phenomena. Ve y li le is ac ually known in he ealm o spi i s. Mos ly wha I see is belie s. E e yone seems o ha e hei own belie s in his a ena; some ag ee and some con lic . Bu no one seems o ha e any p oo o any hing ha would ake i ou o he ealm o belie , excep ha he phenomena do exis .\n\nI wish I knew how he EVP oices can make wo ds ha appea a wice o hal he a e o no mal speech, alk backwa ds, e c. I'd like o lea n hose icks! And I s ill don' know wha o hink abou shadow people. I ha e seen hem wi h my own eyes many, many imes. So ha e o he s I was wi h. I ha en' been success ul a pho og aphing hem. Fo some eason he ones I' e expe ienced can be seen by human eyes bu no pho og aphed. Science le s us down on ha one. A lo o people hink shadow people a e e il bu I ha e ne e el ha om hem. Again, ha 's a belie . No one has p oo o i . I ha e el \"e il\" om o he hings. Maybe I'll ell you abou one o hese \" hings\" ha was exis ing in someone's a ic once. Man, alk abou an e il p esence! Bu I ne e go ha om shadow people.\n\n \nSo y o going on so long; I jus wan ed o poin ou ha science and scien is s a e no he same hing and ha science has indeed gi en us some hings (like Velc o cable ies - he g ea es in en ion o wha e e cen u y i was in en ed in). \n\n:-)\n \nZack\n \n \nOn Wed, Jun 2, 2010 a 7:48 AM, F ank Sump ion pu plealiengi l@...> w o e:\n\n  \n\n\n\n\n No di e ence be ween he skep ic and he eligious wi s, y o o ce hei belie s on e e yone else. Science aliban o eligious aliban--same e ec !  I' e had a gu ull o bo h!\n \n F-S\n\n\n\nOn Tue, Jun 1, 2010 a 6:39 PM, Lizzie B oden yahuli69@...> w o e:\n\n  \n\n\n\n\n\n\nDamn hose Skep ics o making me hink o mysel !  \n \nLi e and he wo ld (Migh s ill be la ) would be a much be e place i i wasn' o hem!!!!\n \nOh well, i is wha i is   Time will ell \n \"Na u e is showing us only he ail o he lion, bu I ha e no doub ha he lion belongs o i e en hough, because o i s la ge size, i canno o ally e eal i sel all a once.\" -— Albe Eins ein \n\n\"I is a be e o g asp he uni e se as i eally is han o pe sis in delusions, howe e sa is ying and eassu ing.\"--Ca l Sagan\n\"The e is no such hing as an insigni ican de ail. Don' jus look o wha you wan o ind.\"-- Me LOL \n\n\n\n\n\nF om: F ank Sump ion pu plealiengi l@...>To: EVP-ITC@yahoog oups.com\nSen : Tue, June 1, 2010 8:35:29 AMSubjec : Re: [EVP-ITC] Re: Nissan he mo ie.\n  \n\n\n Wow! I am amazed.Tha 's p e y much wha I hea d! Ve y a e! See he skep ics acuse people o only hea ing wha 's labled, and we jus had ano he ound and ound abou ha las week. Thanks!\n \n F-S\nOn Tue, Jun 1, 2010 a 12:34 AM, Tim jwoolwo@sy . edu> w o e:\n\n  \n\n\n\nF ank,Ve y in e es ing. I 's been a while since I' e lis enend o you iles. The m on his une sounds eally ac i e; he O he s a e de ini ely cha y on his band. This is wha I hea (in s udio g ade headphones):\nYou AM ile @ 03 secs: \"He e P in Cess\" (male + wo escala ing ones)@ 11 secs: \"Be su e (s a ic) good news\" (male)You FM ile @ 01 secs: \"T ying o ge h ough\" (in emale ones)\n@ 03 secs: \"I don' ?boos ? igh \" (male hen wo ones)@ 05 secs: \"Close o coope a ing?\" (male, i s owel sound is ha d and second owel sound in his wo d is a so 'a' o 'o' so i canno be calami y)\n@ 06 secs: \"Till we' e done\" ( emale, as )@ 08 secs: \"F ank\" (male)@ 09 secs: \"Hi\" ( emale singing, d awn ou ) @ 11 secs: \"How you doing\" (male)@ 14 secs: \"Hi\" ( emale o child)\nTim W. \n\n\n--- In EVP-ITC@yahoog oups .com, F ank Sump ion w o e:>> This is case no one was wonde ing. In he AM ideo a 9 seconds \" his is\n> O o\", an e e p esen pas li e iend. In FM a 5 seconds \"ge in' close > o calami y\" Calami y ille ho o ? Who's Thomas Pane? (a he)> > F-S>"}