{"id": "17414", "subject": "Re: Nissan the movie.", "author": "tim_woolworth", "timestamp": "2010-06-02T06:30:18Z", "full_text": "Obviously this needs to be studied by science, I haven&#39;t seen anyone argue differently.  ITC in general has been attacked since Jurgenson.  When Konstantin Raudive went into the shielded control room of Pye Studios and recorded EVP&#39;s, it still wasn&#39;t good enough for &quot;science.&quot;\n\nFact is, as I alluded to earlier in the post you so graciously &quot;skimmed,&quot; science is not studying this.  Real two way communication through frequency sweeping radio has only come to light less than nine years ago.  \n\nWhat scientists do you think would study this?  What lab would take on the Ghost Boxes as a project?  The answer: none.  Why?  Because there is no way a project like this could get funding.  Also, if any reputed lab did study this and found out that there might be something to it, and then published about it, any scientists involved with that lab would be black listed from future projects just do to the incendiary nature of exploring the paranormal.  \n\nSo it is up to independent people to work on this stuff right now, which, as stated earlier, is in its absolute infancy as an ITC device.  The fact is that there are many people who use these boxes and if they do it at all seriously, then they get results...some of which are indicative of some intelligence trying to communicate with us.\n\nAssociation Transcommunication (Formerly AA-EVP) has recently embarked upon a study of ghost boxes, but the results are not yet available because they are being examined and the results interpreted.  If they post something positive (white papers are always available on their site), would that constitute proof for you?  These guys are going to be the closest thing to unbiased research that you will find in the field and their reputation is impeccable.\n\nhttp://atransc.org/journal/radiosweep_study.htm\n\nFor the rest of us, we do not have labs, nor the equipment to do the rigorous science you call for to find the proof.  Most of us have no idea how electronics, physics, or energy waves work.  We accept that, we just know that our boxes work.  This is the same as turning on a light bulb...we don&#39;t know diddly about how electrons fire or electricity is generated, but I&#39;ll be damned if there isn&#39;t a light while I&#39;m typing this and it works.  \n\nWould you please answer a two-part question for my own edification?\n\nWhat would you consider proof, and how can evidential proof be presented to you so it will not be in question? \n\nAnd yes, you figured out the big secret: we are a cult.  Too bad you won&#39;t drink the Kool-Aid with us.\n\nTim W.\n\n--- In EVP-ITC@yahoogroups.com, Lizzie Broden &lt;yahuli69@...&gt; wrote:\n&gt;\n&gt; I forget to address the Cult thing.  \n&gt; \n&gt; Yes it is a Cult when you don&#39;t look at common sense and search for ideas outside of your &quot;NORM&quot;  More than that, it is very much a cult when you are shot down, ridiculed and basically called everything other than a human-being when you question an idea of a group.\n&gt; \n&gt; I have huge amounts of sympathy for this idea.  I understand loss.  This is extremely difficult for me to express.\n&gt; \n&gt; If this is a faith based thing, then so be it.  I walk away and bless you, wish you well.  More than that I will be there for you if you need to talk.\n&gt; \n&gt; But if this is a thing of Science, then it needs to be understood and examined.  It needs to be looked at in an unbiased light, for what it is.  It needs to be studied.\n&gt; \n&gt; Now there are a lot of people here that are going to kiss Frank&#39;s ass for a box.  And anytime a person meets with resistance over simple questions.  That is cause for concerns.  It has a Cult feel.  (I should know I was raised a Seventh Day Adventist) LOL  I am just saying LOL\n&gt; \n&gt;  &quot;Nature is showing us only the tail of the lion, but I have no doubt that the lion belongs to it even though, because of its large size, it cannot totally reveal itself all at once.&quot; \n&gt; -&quot; Albert Einstein \n&gt; \n&gt; \n&gt; &quot;It is far better to grasp the universe as it really is than to persist in delusions, however satisfying and reassuring.&quot;\n&gt; --Carl Sagan\n&gt; \n&gt; \n&gt; &quot;There is no such thing as an insignificant detail. Don&#39;t just look \n&gt; for what you want to find.&quot;\n&gt; -- Me LOL \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; ________________________________\n&gt; From: Lizzie Broden &lt;yahuli69@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Wed, June 2, 2010 12:23:29 AM\n&gt; Subject: Re: [EVP-ITC] Re: Nissan the movie.\n&gt; \n&gt;   \n&gt; I am sorry I missed your posts and I can understand how anyone would see that as insulting.\n&gt; \n&gt; My hands have been very full for the past two weeks and I am sorry for that.  Death and all the things that come with it.\n&gt; \n&gt; Ummmmmmmmmmm lets see.  OH!  you asked me what I am?  I am a Deist, with strong leanings in the directions of Pantheism and Humanitarianism.  I am an active member of the Democrat party and a very proud American.  I have nothing to hide and love people for who they are.  I just ask for the same back.\n&gt; \n&gt; I am a Paranormal Investigator and have been for several years.  Prior to that I was an Investigator here in the Beautiful State of Tennessee for approximately ten years.\n&gt; \n&gt; I have not been able to be that active with any field research in a while because I was the primary Caregiver for a termly ill person for the past six years.  But I did and still do research work.\n&gt; \n&gt; Is there anything else you would like to know?  Oh, and who the hell are you? LOL\n&gt; \n&gt; &quot;Nature is showing us only the tail of the lion, but I have no doubt that the lion belongs to it even though, because of its large size, it cannot totally reveal itself all at once.&quot; \n&gt; -&quot; Albert Einstein \n&gt; \n&gt; \n&gt; &quot;It is far better to grasp the universe as it really is than to persist in delusions, however satisfying and reassuring.&quot;\n&gt; --Carl Sagan\n&gt; \n&gt; \n&gt; &quot;There is no such thing as an insignificant detail. Don&#39;t just look \n&gt; for what you want to find.&quot;\n&gt; -- Me LOL \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; ________________________________\n&gt; From: JANDANACOSTA &lt;jandan108@yahoo. com&gt;\n&gt; To: EVP-ITC@yahoogroups .com\n&gt; Sent: Tue, June 1, 2010 10:32:56 PM\n&gt; Subject: Re: [EVP-ITC] Re: Nissan the movie.\n&gt; \n&gt;   \n&gt; Insults? You are the one who posts insults. Frank&#39;s reply to an email,(addressed to him by the way), was not addressed to you. But, you felt it necessary to respond with a snide, cryptic remark. \n&gt; \n&gt; You state you are here to find &quot;the truth&quot;.? Have you ever tried to communicate with a spirit box? Are you a Paranormal Investigator? I haven&#39;t seen any posts where you offer any information about your beliefs.\n&gt;  I responded to your post last week and you ignored me. This is a group of &quot;like minded &quot;people who discuss RTSC sessions and share findings we others. We exchange ideas and offer help to one another in our search for answers.  Your snide snippets only serve to demean others .  \n&gt; Now that I have explained my position, you can now accuse me of slinging insults and being part of a cult.!\n&gt; \n&gt; --- On Tue, 6/1/10, Lizzie Broden &lt;yahuli69@yahoo. com&gt; wrote:\n&gt; \n&gt; \n&gt; &gt;From: Lizzie Broden &lt;yahuli69@yahoo. com&gt;\n&gt; &gt;Subject: Re: [EVP-ITC] Re: Nissan the movie.\n&gt; &gt;To: EVP-ITC@yahoogroups .com\n&gt; &gt;Date: Tuesday, June 1, 2010, 8:08 PM\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;  \n&gt; &gt;Read the one that was posted before mine.  I am here to see if there is any truth to this.  As stated previously, many times, and by your commentary, this is very much starting to look like a cult!  \n&gt; &gt;\n&gt; &gt;And that is not childish at all.\n&gt; &gt;\n&gt; &gt;If you have a point to make, please do so.  And while you are at it stop with the insults, because that is childish also.  I have stated my reason for being here several times before in the past and I harbor no ill will to anyone.  but I might if you keep it up!  Is that what you want?\n&gt; &gt;\n&gt; &gt;I want hard evidence, irrefutable evidence, not excuses or wishes or could be&#39;s.  I want facts.\n&gt; &gt;\n&gt; &gt;I want nothing more and nothing less.  That is the cold hard truth of it all, the ugly necked truth that no one wants to look at.  And if you want to throw rocks at me, that is fine.  I am a very big person.  But the question will remain the same, with me or without me.  Lambaste me to Hattie&#39;s, it will not change one damn thing.  That question will still be there.\n&gt; &gt;\n&gt; &gt;I would like to say and give a thank you to Snowflake for the kind words.  They very much touched me in a time when I needed it.  Please go ahead and contact her, but you will need to prove it is her you are talking to.  And that is not unreasonable at all.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; &quot;Nature is showing us only the tail of the lion, but I have no doubt that the lion belongs to it even though, because of its large size, it cannot totally reveal itself all at once.&quot; \n&gt; &gt;-&quot; Albert Einstein \n&gt; &gt;\n&gt; &gt;\n&gt; &gt;&quot;It is far better to grasp the universe as it really is than to persist in delusions, however satisfying and reassuring.&quot;\n&gt; &gt;--Carl Sagan\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;&quot;There is no such thing as an insignificant detail. Don&#39;t just look \n&gt; &gt;for what you want to find.&quot;\n&gt; &gt;-- Me LOL \n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; ________________________________\n&gt; From: JANDANACOSTA &lt;jandan108@yahoo. com&gt;\n&gt; &gt;To: EVP-ITC@yahoogroups .com\n&gt; &gt;Sent: Tue, June 1, 2010 8:51:18 PM\n&gt; &gt;Subject: Re: [EVP-ITC] Re: Nissan the movie.\n&gt; &gt;\n&gt; &gt;  \n&gt; &gt;Exactly what is your purpose here? These kind of &quot;drive-by&quot; comments with snide remarks are extremely childish. Commenting on another&#39;s post is more appropriate.\n&gt; &gt;\n&gt; &gt;--- On Tue, 6/1/10, Lizzie Broden &lt;yahuli69@yahoo. com&gt; wrote:\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;&gt;From: Lizzie Broden &lt;yahuli69@yahoo. com&gt;\n&gt; &gt;&gt;Subject: Re: [EVP-ITC] Re: Nissan the movie.\n&gt; &gt;&gt;To: EVP-ITC@yahoogroups .com\n&gt; &gt;&gt;Date: Tuesday, June 1, 2010, 5:39 PM\n&gt; &gt;&gt;\n&gt; &gt;&gt;\n&gt; &gt;&gt;  \n&gt; &gt;&gt;Damn those Skeptics for making me think for myself!  \n&gt; &gt;&gt;\n&gt; &gt;&gt;Life and the world (Might still be flat) would be a much better place if it wasn&#39;t for them!!!!\n&gt; &gt;&gt;\n&gt; &gt;&gt;Oh well, it is what it is   Time will tell \n&gt; &gt;&gt;\n&gt; &gt;&gt; &quot;Nature is showing us only the tail of the lion, but I have no doubt that the lion belongs to it even though, because of its large size, it cannot totally reveal itself all at once.&quot; \n&gt; &gt;&gt;-&quot; Albert Einstein \n&gt; &gt;&gt;\n&gt; &gt;&gt;\n&gt; &gt;&gt;&quot;It is far better to grasp the universe as it really is than to persist in delusions, however satisfying and reassuring.&quot;\n&gt; &gt;&gt;--Carl Sagan\n&gt; &gt;&gt;\n&gt; &gt;&gt;\n&gt; &gt;&gt;&quot;There is no such thing as an insignificant detail. Don&#39;t just look \n&gt; &gt;&gt;for what you want to find.&quot;\n&gt; &gt;&gt;-- Me LOL \n&gt; &gt;&gt;\n&gt; &gt;&gt;\n&gt; &gt;&gt;\n&gt; &gt;&gt;\n&gt; &gt;&gt;\n&gt; ________________________________\n&gt; From: Frank Sumption &lt;purplealiengirl@ gmail.com&gt;\n&gt; &gt;&gt;To: EVP-ITC@yahoogroups .com\n&gt; &gt;&gt;Sent: Tue, June 1, 2010 8:35:29 AM\n&gt; &gt;&gt;Subject: Re: [EVP-ITC] Re: Nissan the movie.\n&gt; &gt;&gt;\n&gt; &gt;&gt;  \n&gt; &gt;&gt; Wow! I am amazed.That&#39; s pretty much what I heard! Very rare! See the skeptics acuse people of only hearing what&#39;s labled, and we just had another round and round about that last week. Thanks!\n&gt; &gt;&gt;\n&gt; &gt;&gt; F-S\n&gt; &gt;&gt;\n&gt; &gt;&gt;\n&gt; &gt;&gt;On Tue, Jun 1, 2010 at 12:34 AM, Tim &lt;tjwoolwo@syr. edu&gt; wrote:\n&gt; &gt;&gt;\n&gt; &gt;&gt;  \n&gt; &gt;&gt;&gt;Frank,\n&gt; &gt;&gt;&gt;\n&gt; &gt;&gt;&gt;Very interesting. It&#39;s been a while since I&#39;ve listenend to your files. The fm on this tuner sounds really active; the Others are definitely chatty on this band. \n&gt; &gt;&gt;&gt;\n&gt; &gt;&gt;&gt;This is what I hear (in studio grade headphones):\n&gt; &gt;&gt;&gt;\n&gt; &gt;&gt;&gt;Your AM file @ 03 secs: &quot;Here Prin Cess&quot; (male + two escalating tones)\n&gt; &gt;&gt;&gt;@ 11 secs: &quot;Be sure (static) good news&quot; (male)\n&gt; &gt;&gt;&gt;\n&gt; &gt;&gt;&gt;Your FM file @ 01 secs: &quot;Trying to get through&quot; (in female tones)\n&gt; &gt;&gt;&gt;@ 03 secs: &quot;It don&#39;t ?boost? right&quot; (male then two tones)\n&gt; &gt;&gt;&gt;@ 05 secs: &quot;Closer to cooperating? &quot; (male, first vowel sound is hard and second vowel sound in this word is a soft &#39;a&#39; or &#39;o&#39; so it cannot be calamity)\n&gt; &gt;&gt;&gt;@ 06 secs: &quot;Till we&#39;re done&quot; (female, fast)\n&gt; &gt;&gt;&gt;@ 08 secs: &quot;Frank&quot; (male)\n&gt; &gt;&gt;&gt;@ 09 secs: &quot;Hi&quot; (female singing, drawn out) \n&gt; &gt;&gt;&gt;@ 11 secs: &quot;How you doing&quot; (male)\n&gt; &gt;&gt;&gt;@ 14 secs: &quot;Hi&quot; (female or child)\n&gt; &gt;&gt;&gt;\n&gt; &gt;&gt;&gt;Tim W. \n&gt; &gt;&gt;&gt;\n&gt; &gt;&gt;&gt;\n&gt; &gt;&gt;&gt;--- In EVP-ITC@yahoogroups .com, Frank Sumption &lt;purplealiengirl@ ...&gt; wrote:\n&gt; &gt;&gt;&gt;&gt;\n&gt; &gt;&gt;&gt;&gt; This is case no one was wondering. In the AM video at 9 seconds &quot;this is\n&gt; &gt;&gt;&gt;&gt; Otto&quot;, an ever present past life friend. In FM at 5 seconds &quot;gettin&#39; closer\n&gt; &gt;&gt;&gt;&gt; to calamity&quot; Calamityville horror? Who&#39;s Thomas Pane? (at the)\n&gt; &gt;&gt;&gt;&gt; \n&gt; &gt;&gt;&gt;&gt; F-S\n&gt; &gt;&gt;&gt;&gt;\n&gt; &gt;&gt;&gt;\n&gt; &gt;&gt;&gt;\n&gt; &gt;&gt;\n&gt; &gt;&gt; \n&gt; &gt;\n&gt; &gt;\n&gt;"}