{"id": "17416", "subject": "Re: [EVP-ITC] Re: Nissan the movie.", "author": "Zack Widup", "timestamp": "2010-06-02T13:08:55Z", "full_text": "Build a box, do some experimenting and find out for yourself. It what we\nhave been discussing here works for you, great. If it doesn&#39;t, great. That;s\nthe only way you&#39;ll find out.\n\nHeck, get yourself a pocket digital voice recorder and go to some place near\nyou that&#39;s supposed to be haunted. Try to get some EVP. You might get\nnothing and you might get surprised.\nA friend recently sent me some audio recordings to listen to. They were made\non a pocket DVR. Both were made in places where she was the only person for\nmiles (except one where her husband was about 1000 feet away in a car) and\nthe places were quiet. There was no power in these places, no nearby radio\nstations. Both recordings contained quite a number of EVP voices that I\ncould hear.\n\nZack\n\n\nOn Tue, Jun 1, 2010 at 11:59 PM, Lizzie Broden &lt;yahuli69@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;\n&gt; I am not in denial of anything, and if it is real I very much want to learn\n&gt; about it.  But this almost religious furvor you people have for this.  This\n&gt; unquestioning and going after anyone that presents you with fundamental\n&gt; logic and critical thinking, is a bit insulting.\n&gt;\n&gt; \n&gt;\n\nBuild a box, do some expe imen ing and ind ou o you sel . I wha we ha e been discussing he e wo ks o you, g ea . I i doesn' , g ea . Tha ;s he only way you'll ind ou .\n \nHeck, ge you sel a pocke digi al oice eco de and go o some place nea you ha 's supposed o be haun ed. T y o ge some EVP. You migh ge no hing and you migh ge su p ised.\nA iend ecen ly sen me some audio  eco dings o lis en o. They we e made on a pocke DVR. Bo h we e made in places whe e she was he only pe son o miles (excep one whe e he husband was abou 1000 ee away in a ca ) and he places we e quie . The e was no powe in hese places, no nea by adio s a ions. Bo h eco dings con ained qui e a numbe o EVP oices ha I could hea .\n\n \nZack\n \nOn Tue, Jun 1, 2010 a 11:59 PM, Lizzie B oden yahuli69@...> w o e:\n\n  \n\n\n\n\n\n\n \nI am no in denial o any hing, and i i is eal I e y much wan o lea n abou i .  Bu his almos eligious u o you people ha e o his.  This unques ioning and going a e anyone ha p esen s you wi h undamen al logic and c i ical hinking, is a bi insul ing."}