{"id": "17426", "subject": "Re: [EVP-ITC] Re: Nissan the movie.", "author": "Frank Sumption", "timestamp": "2010-06-02T15:52:49Z", "full_text": "I don&#39;t  mind others hearing this stuff different, or not at all, and so is\npure imagination or wishfull thinking. What I don not like is these personal\nattacks because what I post does not agree with some cherished beliefs.  I\nmostly post post to show what I&#39;m doing and using. These people that can not\naccept anything as evidence can go somewhere else to post their views.\n\n F-S\n\nOn Wed, Jun 2, 2010 at 8:38 AM, Zack Widup &lt;w9sz.zack@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; How much do you trust your own observations? How certain are you of what\n&gt; you see and hear and don&#39;t see and hear? I think it comes down to that.\n&gt;\n&gt; People with a lot of uncertainty may claim things like &quot;pareidolia&quot; or\n&gt; whatever, but if you have the certainty and confidence to say you hear this\n&gt; or that, then you really don&#39;t care.\n&gt;\n&gt; No doubt some people DO fall pray to pareidolia (whatever that is) but I&#39;m\n&gt; not one of them. I do have to wonder about the people who see &quot;orbs&quot; in\n&gt; every photo but don&#39;t know enough about photography to say whether they may\n&gt; in fact be something uusual or not. I&#39;m not one of them.\n&gt;\n&gt; I think it&#39;s a good idea to put the audio clips up here for others to\n&gt; listen to. Others may hear something different. That doesn&#39;t mean you&#39;re\n&gt; wrong in your initial interpretation. You&#39;re free to agree with the other\n&gt; person and revise what you say you hear. And you&#39;re free not to.\n&gt;\n&gt; Does this make sense or do I need more coffee this morning?\n&gt; :-)\n&gt;\n&gt; Zack\n&gt;\n&gt;  On Wed, Jun 2, 2010 at 9:00 AM, purplespacefriend &lt;\n&gt; purplealiengirl@...&gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; That person is no longer allowed ot contribute! I&#39;ve had it with these\n&gt;&gt; nasty negative attacks when we present--at least to us--what seems to be\n&gt;&gt; evidence, and/or discuss various methods and techniques. These &quot;skeptics&quot;\n&gt;&gt; accept no evidence and basically call anyone doing this research either\n&gt;&gt; crazy or liars. They have no place on this group, this group is not about\n&gt;&gt; gettng accpetable evidence, or the &quot;proof&quot; that will play in some air head\n&gt;&gt; university, it&#39;s about exploring something that is real and demonstratable.\n&gt;&gt; I do think for myself and I don&#39;t need some duffus to tell me what is\n&gt;&gt; acceptable to think about.\n&gt;&gt;\n&gt;&gt; F-S\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, &quot;Fiona\n&gt;&gt; Broome&quot; &lt;email@...&gt; wrote:\n&gt;&gt; &gt;\n&gt;&gt; &gt; Hi,\n&gt;&gt; &gt;\n&gt;&gt; &gt; It seems to me that simply being on this list and taking these\n&gt;&gt; discoveries seriously, we already ARE thinking for ourselves.\n&gt;&gt; &gt;\n&gt;&gt; &gt; Seriously, why would anyone use/waste time on this subject (and this\n&gt;&gt; list) if he or she wanted the safety of accepted, mainstream, dogmatic\n&gt;&gt; thinking? (Rhetorical question.)\n&gt;&gt; &gt;\n&gt;&gt; &gt; I understand that some people feel obliged to play &quot;Devil&#39;s Advocate&quot;\n&gt;&gt; with new and extraordinary theories and R&D, but it seems to me that the\n&gt;&gt; Devil has enough advocates, thank you.\n&gt;&gt; &gt;\n&gt;&gt; &gt; Healthy skepticism is one thing. All I&#39;m seeing here is compelling\n&gt;&gt; evidence supporting EVP/ITC, followed by attempts to shout down the\n&gt;&gt; concepts.\n&gt;&gt; &gt;\n&gt;&gt; &gt; It looks like you&#39;re attacking the messenger. I don&#39;t think this is the\n&gt;&gt; right forum for that... if any is.\n&gt;&gt; &gt;\n&gt;&gt; &gt; However, since I&#39;m new to this Yahoo Group, maybe I misunderstood what\n&gt;&gt; this group is about.\n&gt;&gt; &gt;\n&gt;&gt; &gt; Bemused,\n&gt;&gt; &gt; Fiona\n&gt;&gt; &gt;\n&gt;&gt; &gt; &gt; On Tue, Jun 1, 2010 at 6:39 PM, Lizzie Broden &lt;yahuli69@&gt; wrote:\n&gt;&gt; &gt; &gt;\n&gt;&gt; &gt; &gt; &gt;\n&gt;&gt; &gt; &gt; &gt;\n&gt;&gt; &gt; &gt; &gt; Damn those Skeptics for making me think for myself!\n&gt;&gt; &gt; &gt; &gt;\n&gt;&gt; &gt; &gt; &gt; Life and the world (Might still be flat) would be a much better\n&gt;&gt; place if it\n&gt;&gt; &gt; &gt; &gt; wasn&#39;t for them!!!!\n&gt;&gt; &gt; &gt; &gt;\n&gt;&gt; &gt; &gt; &gt; Oh well, it is what it is Time will tell\n&gt;&gt; &gt;\n&gt;&gt;\n&gt;&gt;\n&gt;  \n&gt;\n\nI don'   mind o he s hea ing his s u di e en , o no a all, and so is pu e imagina ion o wish ull hinking. Wha I don no like is hese pe sonal a acks because wha I pos does no ag ee wi h some che ished belie s.  I mos ly pos pos o show wha I'm doing and using. These people ha can no accep any hing as e idence can go somewhe e else o pos hei iews. \n\n \n F-S\nOn Wed, Jun 2, 2010 a 8:38 AM, Zack Widup w9sz.zack@...> w o e:\n\n  \n\n\n\n\nHow much do you us you own obse a ions? How ce ain a e you o wha you see and hea and don' see and hea ? I hink i comes down o ha . \n \nPeople wi h a lo o unce ain y may claim hings like \"pa eidolia\" o wha e e , bu i you ha e he ce ain y and con idence o say you hea his o ha , hen you eally don' ca e.\n \nNo doub some people DO all p ay o pa eidolia (wha e e ha is) bu I'm no one o hem. I do ha e o wonde abou he people who see \"o bs\" in e e y pho o bu don' know enough abou pho og aphy o say whe he hey may in ac be some hing uusual o no . I'm no one o hem.\n\n \nI hink i 's a good idea o pu he audio clips up he e o o he s o lis en o. O he s may hea some hing di e en . Tha doesn' mean you' e w ong in you ini ial in e p e a ion. You' e ee o ag ee wi h he o he pe son and e ise wha you say you hea . And you' e ee no o.\n\n \nDoes his make sense o do I need mo e co ee his mo ning?\n:-)\n \nZack\n\nOn Wed, Jun 2, 2010 a 9:00 AM, pu plespace iend pu plealiengi l@...> w o e:\n\n  \n\n\n\nTha pe son is no longe allowed o con ibu e! I' e had i wi h hese nas y nega i e a acks when we p esen --a leas o us--wha seems o be e idence, and/o discuss a ious me hods and echniques. These \"skep ics\" accep no e idence and basically call anyone doing his esea ch ei he c azy o lia s. They ha e no place on his g oup, his g oup is no abou ge ng accpe able e idence, o he \"p oo \" ha will play in some ai head uni e si y, i 's abou explo ing some hing ha is eal and demons a able. I do hink o mysel and I don' need some du us o ell me wha is accep able o hink abou .\nF-S \n--- In EVP-ITC@yahoog oups.com, \"Fiona B oome\" w o e:>> Hi,> > I seems o me ha simply being on his lis and aking hese disco e ies se iously, we al eady ARE hinking o ou sel es.\n> > Se iously, why would anyone use/was e ime on his subjec (and his lis ) i he o she wan ed he sa e y o accep ed, mains eam, dogma ic hinking? (Rhe o ical ques ion.)> > I unde s and ha some people eel obliged o play \"De il's Ad oca e\" wi h new and ex ao dina y heo ies and R&D, bu i seems o me ha he De il has enough ad oca es, hank you.\n> > Heal hy skep icism is one hing. All I'm seeing he e is compelling e idence suppo ing EVP/ITC, ollowed by a emp s o shou down he concep s.> > I looks like you' e a acking he messenge . I don' hink his is he igh o um o ha ... i any is. \n> > Howe e , since I'm new o his Yahoo G oup, maybe I misunde s ood wha his g oup is abou .> > Bemused,> Fiona> > > On Tue, Jun 1, 2010 a 6:39 PM, Lizzie B oden w o e:\n> > > > >> > >> > > Damn hose Skep ics o making me hink o mysel !> > >> > > Li e and he wo ld (Migh s ill be la ) would be a much be e place i i \n> > > wasn' o hem!!!!> > >> > > Oh well, i is wha i is Time will ell>"}