{"id": "17421", "subject": "Re: Nissan the movie.", "author": "purplespacefriend", "timestamp": "2010-06-02T14:00:49Z", "full_text": "That person is no longer allowed ot contribute! I&#39;ve had it with these nasty negative attacks when we present--at least to us--what seems to be evidence, and/or discuss various methods and techniques. These &quot;skeptics&quot; accept no evidence and basically call anyone doing this research either crazy or liars.  They have no place on this group, this group is not about gettng accpetable evidence, or the &quot;proof&quot; that will play in some air head university, it&#39;s about exploring something that is real and demonstratable. I do think for myself and I don&#39;t need some duffus to tell me what is acceptable to think about.\n\n F-S\n\n--- In EVP-ITC@yahoogroups.com, &quot;Fiona Broome&quot; &lt;email@...&gt; wrote:\n&gt;\n&gt; Hi,\n&gt; \n&gt; It seems to me that simply being on this list and taking these discoveries seriously, we already ARE thinking for ourselves.\n&gt; \n&gt; Seriously, why would anyone use/waste time on this subject (and this list) if he or she wanted the safety of accepted, mainstream, dogmatic thinking?  (Rhetorical question.)\n&gt; \n&gt; I understand that some people feel obliged to play &quot;Devil&#39;s Advocate&quot; with new and extraordinary theories and R&D, but it seems to me that the Devil has enough advocates, thank you.\n&gt; \n&gt; Healthy skepticism is one thing.  All I&#39;m seeing here is compelling evidence supporting EVP/ITC, followed by attempts to shout down the concepts.\n&gt; \n&gt; It looks like you&#39;re attacking the messenger. I don&#39;t think this is the right forum for that... if any is. \n&gt; \n&gt; However, since I&#39;m new to this Yahoo Group, maybe I misunderstood what this group is about.\n&gt; \n&gt; Bemused,\n&gt; Fiona\n&gt; \n&gt; &gt; On Tue, Jun 1, 2010 at 6:39 PM, Lizzie Broden &lt;yahuli69@&gt; wrote:\n&gt; &gt; \n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;  Damn those Skeptics for making me think for myself!\n&gt; &gt; &gt;\n&gt; &gt; &gt; Life and the world (Might still be flat) would be a much better place if it\n&gt; &gt; &gt; wasn&#39;t for them!!!!\n&gt; &gt; &gt;\n&gt; &gt; &gt; Oh well, it is what it is   Time will tell\n&gt;"}