{"id": "1742", "subject": "RE: [EVP-ITC] Good Box...Bad Box", "author": "Frank Sumption", "timestamp": "2007-07-30T16:41:05Z", "full_text": "I think you&#39;d be better served to try the simpler methods first, if those \ndon&#39;t work, chances are a box won&#39;t either. I think almost everyone is \nbasing their expectations of the boxes on Moon&#39;s claims, which may be highly \nexaggerated. Besides, it&#39;s not Like I can just throw this stuff together, \ndespite Moon telling the world I give it away. I give away the proto types \nI&#39;m done with, and don&#39;t have any at the moment.\n\nMany of the other methods work as well as my stuff, such as EVPmaker, the \nvarious direct radio voice methods.  They have a huge advantage--simple and \ncheap! I swear, all I do  is the same, provide a source of raw audio.\n\nFrank\n\n\n&gt;From: erick hunter &lt;erick_hunter9@...&gt;\n&gt;Reply-To: EVP-ITC@yahoogroups.com\n&gt;To: EVP-ITC@yahoogroups.com\n&gt;Subject: RE: [EVP-ITC] Good Box...Bad Box\n&gt;Date: Mon, 30 Jul 2007 07:32:10 -0700 (PDT)\n&gt;\n&gt;Mr. Sumption, I would like very much like to receive information as to \n&gt;acquiring one of your Boxes. I am a serious, independant Paranormal \n&gt;researcher, Not! a de-tractor of your instrument, not by any means. I \n&gt;mention this here because I&#39;ve followed the various exchanges of \n&gt;information, and &quot;information,&quot; concerning your instrument. I&#39;ve reviewed \n&gt;the sound bytes posted and am very impressed with the results. I would \n&gt;appreciate a responce, one way or the other, from you at your convenience. \n&gt;Thank you in advance.   --Rod\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;Frank Sumption &lt;franks-boxes@...&gt; wrote:\n&gt;           I never paid much attention as to which boxes produced more \n&gt;negatives, but I\n&gt;used to get alot when I first started this stuff. I tend to ignore those,\n&gt;and sometimes if it&#39;s in a segment I copy to the computer I&#39;ll play it\n&gt;backward. Reversed, sometimes the evil voices are angelic. That&#39;s curious\n&gt;about it shutting off aplliances, I thought those ran on internal \n&gt;batteries.\n&gt;Maybe you&#39;re getting a lesson in energies?\n&gt;\n&gt;I did get a quake warning in last nights test, it said China suffers a\n&gt;quake, followed by August 11. I usually don&#39;t get dates, or locations, so I\n&gt;guess wait any see, of maybe they can evacuate China? Often, when a quake \n&gt;is\n&gt;coming I get a wolf image, well there&#39;s a wolf face on the shower window,\n&gt;kind of a medium size wolf, so I think if there is a quake it won&#39;t be real\n&gt;severe, maybe like a 6 or 7. Wolves for quakes, cats for wind, and bears \n&gt;for\n&gt;tsunamis, which I didn&#39;t know ahead of time. For Katrina I had a cat(image)\n&gt;with huge round eyes.\n&gt;\n&gt;Frank\n&gt; &gt;From: &quot;Steve Hultay&quot; &lt;urkel23@...&gt;\n&gt; &gt;Reply-To: EVP-ITC@yahoogroups.com\n&gt; &gt;To: EVP-ITC@yahoogroups.com\n&gt; &gt;Subject: [EVP-ITC] Good Box...Bad Box\n&gt; &gt;Date: Mon, 30 Jul 2007 00:42:01 -0000\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;Does anybody think it&#39;s possible to get 2 extreme opposites in\n&gt; &gt;communication? 1 Box curses at me constantly and tells me to die and\n&gt; &gt;also talks about the end of the world and hell. And the other one\n&gt; &gt;talks about how pretty it is there and i always get &quot;Hi&quot; and &quot;I&#39;m\n&gt; &gt;Here&quot; as well as &quot;Don&#39;t leave&quot; when i&#39;m signing off and an\n&gt; &gt;occasional &quot;Goodbye&quot;. Has anyone experienced anything like this\n&gt; &gt;before? The 1 box even shuts off appliances in my house when i use\n&gt; &gt;it, i guess i&#39;ll stop using that one for now until i figure out a\n&gt; &gt;solution to what&#39;s going on. Any ideas?????\n&gt; &gt;\n&gt; &gt;-Steve H.\n&gt; &gt;\n&gt;\n&gt;__________________________________________________________\n&gt;http://imagine-windowslive.com/hotmail/?locale=en-us&ocid=TXT_TAGHM_migration_HM_mini_2G_0507\n&gt;\n&gt;\n&gt;\n&gt;\n\n_________________________________________________________________\nhttp://imagine-windowslive.com/hotmail/?locale=en-us&ocid=TXT_TAGHM_migration_HM_mini_pcmag_0507"}