{"id": "17435", "subject": "Re: [EVP-ITC] Re: Tesing-testing", "author": "Zack Widup", "timestamp": "2010-06-02T16:45:54Z", "full_text": "Yes; if it happened now it would be visible 500 years from now. If it\nhappened 500 years ago, it would be visible now.\n\nHowever, there are people including Greg Hodowanec who have collected some\nevidence that gravity waves are near instantaneous, and that if a supernova\noccurred now, it could be detected now. Still, we wouldn&#39;t SEE it for 500\nyears. And the equipment described by Hodowanec (which I&#39;ve built) can&#39;t\ntell us WHERE the supernova occurred, just the fact it did.\nZack\n\n\nOn Wed, Jun 2, 2010 at 10:10 AM, draiga1 &lt;blackwing@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Fiona,\n&gt;\n&gt; Sorry to butt in, but I&#39;m curious. If this is happening 500 Light Years\n&gt; away from us, doesn&#39;t that mean it will be visible to us in 500 years? I\n&gt; know that there is a delay with sound such as thunder, then the delay before\n&gt; an individual hears it depending on how far they are from where the sound\n&gt; originated. Wouldn&#39;t it be the same with light?\n&gt;\n&gt; ~Draiga\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, &quot;Fiona Broome&quot;\n&gt; &lt;email@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hi,\n&gt; &gt;\n&gt; &gt; Frank, you mentioned June 17th and 22nd... I&#39;ll be watching the PEAR\n&gt; project (RNG anomalies) anyway, but I think I&#39;ve found what they&#39;re talking\n&gt; to you about:\n&gt; &gt;\n&gt; &gt; http://unixronin.livejournal.com/763082.html\n&gt; &gt;\n&gt; &gt; Yes, that could be the biggest & best lightshow, ever. Get your lawn\n&gt; chairs ready!\n&gt; &gt;\n&gt; &gt; Cheerfully,\n&gt; &gt; Fiona\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Frank\n&gt; Sumption &lt;purplealiengirl@&gt; wrote:\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; So does that mean there was a possiblity of a something event on May\n&gt; 7th?\n&gt; &gt; &gt; &gt; Got anything for June 17th, or 22nd?\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Frank-S\n&gt; &gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nYes; i i happened now i would be isible 500 yea s om now. I i happened 500 yea s ago, i would be isible now.\n \nHowe e , he e a e people including G eg Hodowanec who ha e collec ed some e idence ha g a i y wa es a e nea ins an aneous, and ha i a supe no a occu ed now, i could be de ec ed now. S ill, we wouldn' SEE i o 500 yea s. And  he equipmen  desc ibed by Hodowanec (which I' e buil ) can' ell us WHERE he supe no a occu ed, jus he ac i did.\n\nZack\n \nOn Wed, Jun 2, 2010 a 10:10 AM, d aiga1 blackwing@...> w o e:\n\n  \n\n\n\nFiona,So y o bu in, bu I'm cu ious. I his is happening 500 Ligh Yea s away om us, doesn' ha mean i will be isible o us in 500 yea s? I know ha he e is a delay wi h sound such as hunde , hen he delay be o e an indi idual hea s i depending on how a hey a e om whe e he sound o igina ed. Wouldn' i be he same wi h ligh ?\n~D aiga \n--- In EVP-ITC@yahoog oups.com, \"Fiona B oome\" w o e:>> Hi,> > F ank, you men ioned June 17 h and 22nd... I'll be wa ching he PEAR p ojec (RNG anomalies) anyway, bu I hink I' e ound wha hey' e alking o you abou :\n> > h p://unix onin.li ejou nal.com/763082.h ml> > Yes, ha could be he bigges & bes ligh show, e e . Ge you lawn chai s eady!\n> > Chee ully,> Fiona> > > > > --- In EVP-ITC@yahoog oups.com, F ank Sump ion w o e:\n> > >> > > So does ha mean he e was a possibli y o a some hing e en on May 7 h?> > > Go any hing o June 17 h, o 22nd?> > > > > > F ank-S> > >\n>"}