{"id": "1744", "subject": "Re: Good Box...Bad Box", "author": "Steve Hultay", "timestamp": "2007-07-31T01:34:26Z", "full_text": "The only thing i lost was a switch for the ceiling fan so far, so i \nthink that&#39;s a good ratio.  Lights flicker and they shut stuff off \nand turn it back on, but nothing really breaks.  I really can&#39;t \nblame them anyway, it was probably just a coincidence.  My house is \n200 years old and has only 60 amp service.\n\n-Steve H.\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;Frank Sumption&quot; &lt;franks-boxes@...&gt; \nwrote:\n&gt;\n&gt; This stuff can get kinda weird. I had another box request recieved \na via \n&gt; snail mail, asking for a &quot;digital box&quot;, I don&#39;t know where they \ngot idea. \n&gt; They also sent along a series of CDs that were excepts of \nchanneled material \n&gt; talking about &quot;the telephone to the dead&quot;. I thought I would at \nleast see \n&gt; what was on it, so started listening to the first CD, the dog went \ntotally \n&gt; bonkers, running around the house barking and howling! I stpped \nthe play \n&gt; back, and put the stuff back in it&#39;s box to ship back.\n&gt; \n&gt; The little that I did hear, as I kinda scanned through the first \ntrack, was \n&gt; pretty religious sounding, with some guy talking in a very deep \nmono tone. I \n&gt; don&#39;t have time to try to sort that BS out, and I am not impressed \nwith \n&gt; supposed spiritual revelations.  Ya reach a point after 40 years \nof reading, \n&gt; and other sources, that you develope pretty good BS detectors. I \ngot \n&gt; interested in paranormal stuff when I was 13.\n&gt; \n&gt; I also get the flickering lights, and thumps in the walls, but \nnothing ever \n&gt; burns up, or stops working, except from normal failure.\n&gt; \n&gt; Frank-S\n&gt; \n&gt; _________________________________________________________________\n&gt; http://imagine-windowslive.com/hotmail/?locale=en-\nus&ocid=TXT_TAGHM_migration_HM_mini_2G_0507\n&gt;"}