{"id": "17454", "subject": "Re: [EVP-ITC] Re: music", "author": "Frank Sumption", "timestamp": "2010-06-02T19:47:06Z", "full_text": "There was a guy here sometime ago that used to cut out the garbage as he\ncalled it, to bring the words or messages out. Trouble is, it was more like\nhe was pulling disconnected words together to form a message that he wanted.\nCut and paste.\n I get some that are different broadcast voices strung together to form a\ncontiguous message, but I usually don&#39;t accept any  as having personal\nmeaning that have a discontinuity. When I post voices, I seperate that\nsegment that has the voice or phrase, I don&#39;t try to join together segments\nthat might form a message, or cut out any noise, except maybe basic noise\nreduction on a few--if that makes any sense.\n\n Maybe I misunderstand?\n\n This stuff is not as straight forward as most seem to think, it can be very\ncomplicated, and there is no one right way.\n\n F-S\n\nOn Wed, Jun 2, 2010 at 1:32 PM, &lt;SnowfireL@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; I was ill on and off for the past 10 years.  However, since I have learned\n&gt; about you guys, and what you have all been sharing, and with me working on\n&gt; it myself, I have not been sick.  I am still really new at this, I only\n&gt; started doing this since March of 09, and I&#39;ve collected, and kept all the\n&gt; raw data, plus what i tried to pull out of the files, it was harder then\n&gt; because I didn&#39;t know how to work with it I still don&#39;t know what to do with\n&gt; Goldwave, but Kristin is the one that told me about Goldwave, it is easy to\n&gt; save files, and just recently I learned how to make the wav files mp3&#39;s most\n&gt; of the older files are still in Wav format.\n&gt;\n&gt; All  i do now, is make their words louder, and try to pull them out, from\n&gt; the other voices, that get in the way.  As far as &quot;listening to negative\n&gt; entities&quot; look at what goes on in this world, don&#39;t we have enough negative\n&gt; stuff to worry about already?  I just don&#39;t enjoy encouraging them to keep\n&gt; it up, feeding into the negatives only makes them stronger, and does not set\n&gt; a very good example it&#39;s like what a philosophy professor once told a\n&gt; class back I took one, students could understand him, oh yes, he spoke\n&gt; clearly perfect English, but the man spoke 8 languages fluently, wrote\n&gt; several books;  &quot;I speak to lift this class up to my level of understanding,\n&gt; so you will learn, I will not lower myself to your level, you are all here\n&gt; to learn.&quot;   Difficult class?  Very much so, and no student ever managed to\n&gt; get an A or B in his class one was lucky to get a C + in that class, and I\n&gt; had 3.9 in all of my undergraduate work, and a 4.0 in what PhD credits I\n&gt; accumulated.  But of all the science classes I took, the biology&#39;s,\n&gt; chemistry&#39;s, theology, physics, all of them, that was by far the most\n&gt; challenging ever, but boy was it interesting! sf\n&gt;\n&gt;\n&gt;  In a message dated 6/2/2010 2:28:19 P.M. Eastern Daylight Time,\n&gt; rasterer@... writes:\n&gt;\n&gt;\n&gt;\n&gt;   Snowfire, based on your hearing of all the negative entities, do you\n&gt; think listening to them could cause a person to become ill, or more\n&gt; negative? If so, what do you think the symptoms of that would be?  That is,\n&gt; what kind of behavior would a person exhibit who had become, perhaps\n&gt; dangerously, effected?\n&gt;\n&gt;\n&gt; --- On *Wed, 6/2/10, SnowfireL@... &lt;SnowfireL@...&gt;* wrote:\n&gt;\n&gt;\n&gt; From: SnowfireL@... &lt;SnowfireL@...&gt;\n&gt; Subject: Re: [EVP-ITC] Re: music\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Wednesday, June 2, 2010, 10:11 AM\n&gt;\n&gt;\n&gt;\n&gt; ... I don&#39;t think it is good to pass that negative stuff around, there is\n&gt; enough of that on these lists already.  ..\n&gt;\n&gt;  In a message dated 6/2/2010 12:42:44 P.M. Eastern Daylight Time,\n&gt; clockdryve@yahoo. com writes:\n&gt;\n&gt;\n&gt;\n&gt; I get the last part &quot;play some music&quot;. But what is the first part&quot;? I have\n&gt; a terrible time with these slashed bits of voice.\n&gt;\n&gt; --- In EVP-ITC@yahoogroups .com, SnowfireL@.. . wrote:\n&gt; &gt;\n&gt; &gt; This is very clear to me, see if you can hear. sf\n&gt; &gt;\n&gt;\n&gt;\n&gt;  \n&gt;\n\nThe e was a guy he e some ime ago ha used o cu ou he ga bage as he called i , o b ing he wo ds o messages ou . T ouble is, i was mo e like he was pulling disconnec ed wo ds oge he o o m a message ha he wan ed. Cu and pas e.\n\n I ge some ha a e di e en b oadcas oices s ung oge he o o m a con iguous message, bu I usually don' accep any  as ha ing pe sonal meaning ha ha e a discon inui y. When I pos oices, I sepe a e ha segmen ha has he oice o ph ase, I don' y o join oge he segmen s ha migh o m a message, o cu ou any noise, excep maybe basic noise educ ion on a ew--i ha makes any sense. \n\n \n Maybe I misunde s and?\n \n This s u is no as s aigh o wa d as mos seem o hink, i can be e y complica ed, and he e is no one igh way. \n \n F-S\nOn Wed, Jun 2, 2010 a 1:32 PM, Snow i eL@...> w o e:\n\n  \n\n\n\n\nI was ill on and o o he pas 10 yea s.  Howe e , since I ha e lea ned abou you guys, and wha you ha e all been sha ing, and wi h me wo king on i mysel , I ha e no been sick.  I am s ill eally new a his, I only s a ed doing his since Ma ch o 09, and I' e collec ed, and kep all he aw da a, plus wha i ied o pull ou o he iles, i was ha de hen because I didn' know how o wo k wi h i I s ill don' know wha o do wi h Goldwa e, bu K is in is he one ha old me abou Goldwa e, i is easy o sa e iles, and jus ecen ly I lea ned how o make he wa iles mp3's mos o he olde iles a e s ill in Wa o ma .\n\n \nAll  i do now, is make hei wo ds loude , and y o pull hem ou , om he o he oices, ha ge in he way.  As a as \"lis ening o nega i e  en i ies\" look a wha goes on in his wo ld, don' we ha e enough nega i e s u o wo y abou al eady?  I jus don' enjoy encou aging hem o keep i up, eeding in o he nega i es only makes hem s onge , and does no se a e y good example i 's like wha a philosophy p o esso once old a class back I ook one, s uden s could unde s and him, oh yes, he spoke clea ly pe ec English, bu he man spoke 8 languages luen ly, w o e se e al books;  \"I speak o li his class up o my le el o unde s anding, so you will lea n, I will no lowe mysel   o you le el, you a e all he e o lea n.\"   Di icul class?  Ve y much so, and no s uden e e managed o ge an A o B in his class one was lucky o ge a C + in ha class, and I had 3.9 in all o my unde g adua e wo k, and a 4.0 in wha PhD c edi s I accumula ed.  Bu  o all he science classes I ook, he biology's, chemis y's, heology, physics, all o hem, ha was by a he mos challenging e e , bu boy was i in e es ing! s \n\n \n \n\n\nIn a message da ed 6/2/2010 2:28:19 P.M. Eas e n Dayligh Time, as e e @... w i es:\n  \n\n\n\n\n\n\nSnow i e, based on you hea ing o all he nega i e en i ies, do you hink lis ening o hem could cause a pe son o become ill, o mo e nega i e? I so, wha do you hink he symp oms o ha would be?  Tha is, wha kind o beha io would a pe son exhibi who had become, pe haps dange ously, e ec ed?\n--- On Wed, 6/2/10, Snow i eL@... Snow i eL@...> w o e:\n\nF om: Snow i eL@... Snow i eL@...>Subjec : Re: [EVP-ITC] Re: musicTo: EVP-ITC@yahoog oups.com\nDa e: Wednesday, June 2, 2010, 10:11 AM\n  \n\n\n... I don' hink i is good o pass ha nega i e s u a ound, he e is enough o ha on hese lis s al eady.  ..\n\n \n\nIn a message da ed 6/2/2010 12:42:44 P.M. Eas e n Dayligh Time, clockd y e@yahoo. com w i es:\n  \n\nI ge he las pa \"play some music\". Bu wha is he i s pa \"? I ha e a e ible ime wi h hese slashed bi s o oice.--- In EVP-ITC@yahoog oups .com, Snow i eL@.. . w o e:\n>> This is e y clea o me, see i you can hea . s >"}