{"id": "17467", "subject": "Re: Greetings", "author": "tim_woolworth", "timestamp": "2010-06-03T06:55:47Z", "full_text": "Thanks for listening to the audio I posted.\n\nI have an older model Minibox Plus.  The boxes are hella expensive, and I was lucky enough to find a man selling one who really needed the money at the time so I got a great deal.\n\nThey are made by Ron Ricketts of Paranormal Systems out of Texas.  As the story goes, Ron is an electrical engineer and a member of paranormal group.  They group he is with wanted to explore the Frank&#39;s Box phenomena so he built one based on Frank&#39;s schematics a couple of years ago to find out what the fuss was about.  Liking what he heard, he decided to go into business by making these boxes for production.  The circuit boards are pressed, the whole unit is in a pre-fab plastic case.  It runs AM band only, the antennae is internal (with crystal enhancement) connected to an outside post extension, has seven different frequencies sweeping modes, user frequency sweep rate adjustments, and it has an internal battery.  Interestingly enough, my internal antennae broke the solder point internally from the post and it gets even better reception now.  \n\nThe Minibox has an internal amplifer (300mW) which is enough to power a small external speaker badly.  The reason my files are so clear is because I run my sessions very differently than other Minibox users.  I take the amp out from the box and run it into an external 7 watt / 4 ohm amp designed by Ron to work with this box.  I like having the amplified sound, but the internal amp is noisy so when this noise is amplified, I get a lot of hiss.  But, it also allows me to achieve really loud volume.  The louder I make the volume, the lower I can set the sensitivity and still be able to hear it.  The box itself has two knobs, volume and sensitivity.  So I set the sensitivity to the point where it gates out most sound, then I tweak it gently while I crank the volume.  My hand is always on the sensitivity knob and I cannot explain it, but I &quot;feel&quot; when to open the gate a little more to add in some more sound and when to back off and close the gate some more to cut out sound.\n\nThis is how I keep all other frequencies out and limit radio chatter considerably.  I have found that the Others have learned to work this box with me.  It took time, a little over a month or so of using it every night until I could communicate clearly using this box.  I have often asked them before if they want me to switch to a different mode of frequency sweeping (I currently use random jump) and I always get &quot;No&quot; as a reply.  They seem to be happy with the way it works now, I only wish that some of their replies did not get cut off.  \n\nAs a result, the responses take a little longer, as you can hear, some sentences form over several seconds, but they are often very clear individual words or phrases.  They have told me that the clicking sound you hear is them trying to manipulate the sound so they can speak.\n\nAs for recording, I record with a standard sony stereo digital recorder set up about 3 feet from the speaker, and I do my editing in Audition.  Nothing has been manipulated, just sliced and put into a file.\n\nTim W.\n--- In EVP-ITC@yahoogroups.com, &quot;draiga1&quot; &lt;blackwing@...&gt; wrote:\n&gt;\n&gt; Those are really clear files Tim! What is a minibox plus? I am not hearing any radio scan. \n&gt; \n&gt; ~Draiga\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;tim_woolworth&quot; &lt;tim@&gt; wrote:\n&gt; &gt;\n&gt; &gt; I have replied to a few posts here in the past and I intend to do so with much more regularity now.  I have come to the realization that skeptics cannot be avoided and my audio needs to get out there for feedback.\n&gt; &gt; \n&gt; &gt; For those who don&#39;t know me, my name is Tim Woolworth.  I have been (sigh) a ghost hunter for years.  I discovered ITC a couple of years ago  and I was relegated to using a Shack Hack until 6 or 7 months ago.  At that time, a Minibox Plus found its way to me and my view of ITC and the afterlife has changed entirely.  Since I have been practicing ITC, ghost hunting just isn&#39;t that much fun anymore.\n&gt; &gt; \n&gt; &gt; I now do sessions about three times a week.  I have been keeping my audio clips to myself until now.  I have posted clips on other boards and I almost never get replies.  One thing I have noticed about this group is that everyone is good at listening to clips and responding so I decided to start posting only at this forum instead of the others.  \n&gt; &gt; \n&gt; &gt; I have started a folder today.  The clips put in there are from last night.  I recorded a ten minute session after writing the reply to the skeptic last night.  These are five short clips, and a transcript, from that session which had activity the entire time.  The clips include konstantin Raudive, the Others talking about using the Ghost Boxes, a warning for me, and my new favorite clip: a rapper comes through at the end to say good-bye.\n&gt; &gt; \n&gt; &gt; Thank you for listening.\n&gt; &gt; \n&gt; &gt; http://tech.groups.yahoo.com/group/EVP-ITC/files/Tim%20Woolworth/June%202010/\n&gt; &gt; \n&gt; &gt; Tim W.\n&gt; &gt;\n&gt;"}