{"id": "17474", "subject": "Re: Nissan the movie.", "author": "purplespacefriend", "timestamp": "2010-06-03T13:51:44Z", "full_text": "It comes down to not calling people names, and expecting all results to fit into some extrememly narrowly defined version of reality. It comes down to having a bit of respect for people that are attempting to deal with something that is still a big taboo in this society. There are people here afraid to use their real names because of repercussions from work and family. People that are smart enough to realize there is something to this and they don&#39;t need some authority to tell them it&#39;s ok to think about it. \n\n I sacrificed my carreer for this stuff, I could have been doing network management, instead I&#39;m religated to intalling the network cable--manual labor--because I had the audacity to think I could communicate with the dead. And whose job do you think was eliminated because of buget cuts!? \n\n There&#39;s science, and then there&#39;s judgement. We don&#39;t need no more judgement.\n\n frank-S\n\n--- In EVP-ITC@yahoogroups.com, Lizzie Broden &lt;yahuli69@...&gt; wrote:\n&gt;\n&gt; Is that what it comes down to?  Anyone that has a different opinion is censored?  \n&gt; \n&gt; Do you think that helps discovery?\n&gt; \n&gt; Keep throwing rocks at me, personally.  You are now guilty of the very thing you hate so much and accuse others of.\n&gt; \n&gt; I am not here to hurt you, and if my questions bother you I am sorry.  I will say it one more time.  If this is a religion, something that is faith based, above question, then I am sorry.  Best wishes and I will go away.\n&gt; \n&gt; But if this is a Science that can be controlled and studied, then we need to take a real hard look at the subject.  \n&gt; \n&gt; Censoring people that have real questions is simply not very proactive to your cause, even if you don&#39;t like what they have to say.\n&gt; \n&gt; Shoot me down with facts, not wishful thinking and faith.  Don&#39;t be a Nazi and what you have preached against\n&gt;  &quot;Nature is showing us only the tail of the lion, but I have no doubt that the lion belongs to it even though, because of its large size, it cannot totally reveal itself all at once.&quot; \n&gt; -&quot; Albert Einstein \n&gt; \n&gt; \n&gt; &quot;It is far better to grasp the universe as it really is than to persist in delusions, however satisfying and reassuring.&quot;\n&gt; --Carl Sagan\n&gt; \n&gt; \n&gt; &quot;There is no such thing as an insignificant detail. Don&#39;t just look \n&gt; for what you want to find.&quot;\n&gt; -- Me LOL \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; ________________________________\n&gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Wed, June 2, 2010 10:59:17 AM\n&gt; Subject: Re: [EVP-ITC] Re: Nissan the movie.\n&gt; \n&gt;   \n&gt;  Okay, I put the mean and nasty back on moderated, so she at least has some chance of responding. Personal attacks will not be tolerated. \n&gt; \n&gt;  Frank-S\n&gt; \n&gt; \n&gt; On Wed, Jun 2, 2010 at 9:17 AM, draiga1 &lt;blackwing@cox. net&gt; wrote:\n&gt; \n&gt;   \n&gt; &gt;Thank you, Frank. It&#39;s nice to get back to our regularly scheduled programming. I am enjoying learning about this field and like to feel it&#39;s a safe haven for those researching ghost box communication without being ridiculed in the process.\n&gt; &gt;\n&gt; &gt;~Draiga \n&gt; &gt;\n&gt; &gt;\n&gt; &gt;--- In EVP-ITC@yahoogroups .com, &quot;purplespacefriend&quot; &lt;purplealiengirl@ ...&gt; wrote:\n&gt; &gt;&gt;\n&gt; &gt;&gt; That person is no longer allowed ot contribute! I&#39;ve had it with these nasty negative attacks when we present--at least to us--what seems to be evidence, and/or discuss various methods and techniques. These &quot;skeptics&quot; accept no evidence and basically call anyone doing this research either crazy or liars. They have no place on this group, this group is not about gettng accpetable evidence, or the &quot;proof&quot; that will play in some air head university, it&#39;s about exploring something that is real and demonstratable. I do think for myself and I don&#39;t need some duffus to tell me what is acceptable to think about.\n&gt; &gt;&gt; \n&gt; &gt;&gt; F-S\n&gt; &gt;&gt; \n&gt; &gt;&gt; --- In EVP-ITC@yahoogroups .com, &quot;Fiona Broome&quot; &lt;email@&gt; wrote:\n&gt; &gt;&gt; &gt;\n&gt; &gt;&gt; &gt; Hi,\n&gt; &gt;&gt; &gt; \n&gt; &gt;&gt; &gt; It seems to me that simply being on this list and taking these discoveries seriously, we already ARE thinking for ourselves.\n&gt; &gt;&gt; &gt; \n&gt; &gt;&gt; &gt; Seriously, why would anyone use/waste time on this subject (and this list) if he or she wanted the safety of accepted, mainstream, dogmatic thinking? (Rhetorical question.)\n&gt; &gt;&gt; &gt; \n&gt; &gt;&gt; &gt; I understand that some people feel obliged to play &quot;Devil&#39;s Advocate&quot; with new and extraordinary theories and R&D, but it seems to me that the Devil has enough advocates, thank you.\n&gt; &gt;&gt; &gt; \n&gt; &gt;&gt; &gt; Healthy skepticism is one thing. All I&#39;m seeing here is compelling evidence supporting EVP/ITC, followed by attempts to shout down the concepts.\n&gt; &gt;&gt; &gt; \n&gt; &gt;&gt; &gt; It looks like you&#39;re attacking the messenger. I don&#39;t think this is the right forum for that... if any is. \n&gt; &gt;&gt; &gt; \n&gt; &gt;&gt; &gt; However, since I&#39;m new to this Yahoo Group, maybe I misunderstood what this group is about.\n&gt; &gt;&gt; &gt; \n&gt; &gt;&gt; &gt; Bemused,\n&gt; &gt;&gt; &gt; Fiona\n&gt; &gt;&gt; &gt; \n&gt; &gt;&gt; &gt; &gt; On Tue, Jun 1, 2010 at 6:39 PM, Lizzie Broden &lt;yahuli69@&gt; wrote:\n&gt; &gt;&gt; &gt; &gt; \n&gt; &gt;&gt; &gt; &gt; &gt;\n&gt; &gt;&gt; &gt; &gt; &gt;\n&gt; &gt;&gt; &gt; &gt; &gt; Damn those Skeptics for making me think for myself!\n&gt; &gt;&gt; &gt; &gt; &gt;\n&gt; &gt;&gt; &gt; &gt; &gt; Life and the world (Might still be flat) would be a much better place if it\n&gt; &gt;&gt; &gt; &gt; &gt; wasn&#39;t for them!!!!\n&gt; &gt;&gt; &gt; &gt; &gt;\n&gt; &gt;&gt; &gt; &gt; &gt; Oh well, it is what it is Time will tell\n&gt; &gt;&gt; &gt;\n&gt; &gt;&gt;\n&gt; &gt;\n&gt; &gt;\n&gt;"}