{"id": "17470", "subject": "Re: [EVP-ITC] Greetings", "author": "cbreck elknet.net", "timestamp": "2010-06-03T13:26:11Z", "full_text": "Tim,\nThank you for posting these sessions.  Very clear....awesome!\n\nCarol B....\n\nOn Wed, Jun 2, 2010 at 8:37 PM, tim_woolworth &lt;tim@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; I have replied to a few posts here in the past and I intend to do so with\n&gt; much more regularity now. I have come to the realization that skeptics\n&gt; cannot be avoided and my audio needs to get out there for feedback.\n&gt;\n&gt; For those who don&#39;t know me, my name is Tim Woolworth. I have been (sigh) a\n&gt; ghost hunter for years. I discovered ITC a couple of years ago and I was\n&gt; relegated to using a Shack Hack until 6 or 7 months ago. At that time, a\n&gt; Minibox Plus found its way to me and my view of ITC and the afterlife has\n&gt; changed entirely. Since I have been practicing ITC, ghost hunting just isn&#39;t\n&gt; that much fun anymore.\n&gt;\n&gt; I now do sessions about three times a week. I have been keeping my audio\n&gt; clips to myself until now. I have posted clips on other boards and I almost\n&gt; never get replies. One thing I have noticed about this group is that\n&gt; everyone is good at listening to clips and responding so I decided to start\n&gt; posting only at this forum instead of the others.\n&gt;\n&gt; I have started a folder today. The clips put in there are from last night.\n&gt; I recorded a ten minute session after writing the reply to the skeptic last\n&gt; night. These are five short clips, and a transcript, from that session which\n&gt; had activity the entire time. The clips include konstantin Raudive, the\n&gt; Others talking about using the Ghost Boxes, a warning for me, and my new\n&gt; favorite clip: a rapper comes through at the end to say good-bye.\n&gt;\n&gt; Thank you for listening.\n&gt;\n&gt;\n&gt; http://tech.groups.yahoo.com/group/EVP-ITC/files/Tim%20Woolworth/June%202010/\n&gt;\n&gt; Tim W.\n&gt;\n&gt; \n&gt;\n\nTim,\nThank you o pos ing hese sessions.  Ve y clea ....awesome!\n \nCa ol B....\nOn Wed, Jun 2, 2010 a 8:37 PM, im_woolwo h im@...> w o e:\n\n  \n\n\n\nI ha e eplied o a ew pos s he e in he pas and I in end o do so wi h much mo e egula i y now. I ha e come o he ealiza ion ha skep ics canno be a oided and my audio needs o ge ou he e o eedback.\nFo hose who don' know me, my name is Tim Woolwo h. I ha e been (sigh) a ghos hun e o yea s. I disco e ed ITC a couple o yea s ago and I was elega ed o using a Shack Hack un il 6 o 7 mon hs ago. A ha ime, a Minibox Plus ound i s way o me and my iew o ITC and he a e li e has changed en i ely. Since I ha e been p ac icing ITC, ghos hun ing jus isn' ha much un anymo e.\nI now do sessions abou h ee imes a week. I ha e been keeping my audio clips o mysel un il now. I ha e pos ed clips on o he boa ds and I almos ne e ge eplies. One hing I ha e no iced abou his g oup is ha e e yone is good a lis ening o clips and esponding so I decided o s a pos ing only a his o um ins ead o he o he s. \nI ha e s a ed a olde oday. The clips pu in he e a e om las nigh . I eco ded a en minu e session a e w i ing he eply o he skep ic las nigh . These a e i e sho clips, and a ansc ip , om ha session which had ac i i y he en i e ime. The clips include kons an in Raudi e, he O he s alking abou using he Ghos Boxes, a wa ning o me, and my new a o i e clip: a appe comes h ough a he end o say good-bye.\nThank you o lis ening.h p:// ech.g oups.yahoo.com/g oup/EVP-ITC/ iles/Tim%20Woolwo h/June%202010/\nTim W."}