{"id": "17481", "subject": "Re: [EVP-ITC] Re: Tesing-testing", "author": "April Abercrombie", "timestamp": "2010-06-03T14:36:19Z", "full_text": "Honestly Frank..we may agree to some extent on this. This borders on\nprinciples of magick, and using your Will to effect change in the universe.\nIt is kinda like where magick and science meet.\n\nBuddhism has beliefs along these lines as well, though they do not explain\nit quite like this. They believe there is an objective universe, but that we\nproject our own images onto this matter, thereby perceiving things\ndifferently. They believe we percieve matter mainly based on our emotions,\nand what we think want versus what is actually there. Part of achieving\nenlightenment is actually breaking out of the emotional way of viewing\nthings, and actually using our minds to our advantage, rather then just\nletting our emotions rule what we perceive.\n\nOn Thu, Jun 3, 2010 at 8:19 AM, purplespacefriend &lt;purplealiengirl@...\n&gt; wrote:\n\n&gt;\n&gt;\n&gt; I recall a book from years ago, something like &quot;When Fire Doesn&#39;t Burn&quot;. We\n&gt; seem to have the ability to change our perceptions and /or reality and\n&gt; create the conditions where fire doesn&#39;t burn the body. It&#39;s been way to\n&gt; long for me to have anything but a vague memory of the book. I think the\n&gt; quantum states of matter do manifest on the marco level, and can be effected\n&gt; by thought--yeah I know, where&#39;s the proof.\n&gt;\n&gt; F-S\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Rj &lt;rasterer@...&gt;\n&gt; wrote:\n&gt; &gt;\n&gt; &gt; Thanks for the pointer - it sounds interesting.\n&gt; &gt;\n&gt; &gt; My understanding of this idea is that there are weird things along those\n&gt; lines that happen with individual atoms and below that level.Â  But this\n&gt; does not apply (has never been observed) in normal life.Â  For instance, all\n&gt; the quantum theories or disbelief in the world is not going to save usÂ  if\n&gt; we lie down in traffic.Â  :)\n&gt; &gt;\n&gt; &gt; --- On Thu, 6/3/10, April Abercrombie &lt;april@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; From: April Abercrombie &lt;april@...&gt;\n&gt;\n&gt; &gt; Subject: Re: [EVP-ITC] Re: Tesing-testing\n&gt; &gt; To: EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;\n&gt; &gt; Date: Thursday, June 3, 2010, 6:27 AM\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Â\n&gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Frank did have a point there. There is some schools of thought that\n&gt; suggest that nothuing existis outside of ourselves, that we perceive and\n&gt; create our own realities. Things exist because we believe they do, calling\n&gt; them into reality. If you have ever watched the movie/documentary &#39;What the\n&gt; Bleep Do We Know?&quot; it explains this in detail using scientific principals.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; I am not sure how much of it I agree with, but there is some truth to the\n&gt; thought that we create our own realities.\n&gt; &gt;\n&gt; &gt; If you have not seen this movie, I can recommend it. Even of you don&#39;t\n&gt; agree with all of it, it does give you some interesting food for thought.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; On Wed, Jun 2, 2010 at 4:33 PM, Rj &lt;rasterer@yahoo. com&gt; wrote:\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Â\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Interesting.Â  I see science as being the basis for most of our lives.\n&gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; --- On Wed, 6/2/10, Frank Sumption &lt;purplealiengirl@ gmail.com&gt; wrote:\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; From: Frank Sumption &lt;purplealiengirl@ gmail.com&gt;\n&gt; &gt; Subject: Re: [EVP-ITC] Re: Tesing-testing\n&gt; &gt;\n&gt; &gt; To: EVP-ITC@yahoogroups .com\n&gt; &gt; Date: Wednesday, June 2, 2010, 11:58 AM\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Â\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Â I was just kidding, but personally I don&#39;t think there is a fixed,\n&gt; fundamental reality. Just like the wave/particle, it&#39;s whatever one thinks\n&gt; it is at that moment, for that person/test.\n&gt; &gt; Â When the they aim Hubble at a blank spot in space, and give it a long\n&gt; exposure, revealing billions of new galaxies--did those galaxies always\n&gt; exist, or did science wish them to exist-er theorize they exist? and who can\n&gt; prove either way? Quantum &quot;science&quot; sugggests that everytime anyone on the\n&gt; planet/universe has a discision to make an new universe is instantly created\n&gt; to accommodate both, kinda negates the speed of light speed limit wouldn&#39;t\n&gt; it, not to mention every other law of physics.\n&gt; &gt;\n&gt; &gt; Â\n&gt; &gt; Â Yeah, I just don&#39;t see science being of much help with anything.\n&gt; &gt; Â\n&gt; &gt; Â F-S\n&gt; &gt; Â\n&gt; &gt; Â\n&gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; On Wed, Jun 2, 2010 at 12:38 PM, Rj &lt;rasterer@yahoo. com&gt; wrote:\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Â\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Light is both a particle and a wave, depending on what you&#39;re looking\n&gt; for, or how you measure it.Â  That goes for everything on the\n&gt; electro-magnetic (EM) spectrum, of which light is part, but gravity is not.\n&gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; According to current science, there are 4 fundamental forces in the\n&gt; universe: EM is one, and gravity is another (and then the others I think are\n&gt; strong and weak forces at the atomic level).\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; --- On Wed, 6/2/10, Frank Sumption &lt;purplealiengirl@ gmail.com&gt; wrote:\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; From: Frank Sumption &lt;purplealiengirl@ gmail.com&gt;\n&gt; &gt; Subject: Re: [EVP-ITC] Re: Tesing-testing\n&gt; &gt;\n&gt; &gt; To: EVP-ITC@yahoogroups .com\n&gt; &gt; Date: Wednesday, June 2, 2010, 11:31 AM\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Â\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Oh, it&#39;s light is a particle and gravity a wave?\n&gt; &gt; Â\n&gt;\n&gt; &gt; F-S\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; On Wed, Jun 2, 2010 at 11:07 AM, Rj &lt;rasterer@yahoo. com&gt; wrote:\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Â\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; No gravity-particle has been discovered (graviton?). But there are\n&gt; theories about gravity being a particle, or a bend in space-time, or a wave,\n&gt; or a lot of things.Â  Science is still grappling with this.\n&gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; --- On Wed, 6/2/10, Frank Sumption &lt;purplealiengirl@ gmail.com&gt; wrote:\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; From: Frank Sumption &lt;purplealiengirl@ gmail.com&gt;\n&gt; &gt; Subject: Re: [EVP-ITC] Re: Tesing-testing\n&gt; &gt;\n&gt; &gt; To: EVP-ITC@yahoogroups .com\n&gt; &gt; Date: Wednesday, June 2, 2010, 9:55 AM\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Â\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; I thought gravity was a particle.\n&gt; &gt; Â\n&gt; &gt; Â F-S\n&gt;\n&gt; &gt;\n&gt; &gt; On Wed, Jun 2, 2010 at 10:45 AM, Zack Widup &lt;w9sz.zack@gmail. com&gt;\n&gt; wrote:\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Â\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Yes; if it happened now it would be visible 500 years from now. If it\n&gt; happened 500 years ago, it would be visible now.\n&gt; &gt; Â\n&gt; &gt; However, there are people including Greg Hodowanec who have collected\n&gt; some evidence that gravity waves are near instantaneous, and that if a\n&gt; supernova occurred now, it could be detected now. Still, we wouldn&#39;t SEE it\n&gt; for 500 years. AndÂ the equipmentÂ described by Hodowanec (which I&#39;ve\n&gt; built)Â can&#39;t tell us WHERE the supernova occurred, just the fact it did.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Zack\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Â\n&gt;\n&gt; &gt; On Wed, Jun 2, 2010 at 10:10 AM, draiga1 &lt;blackwing@cox. net&gt; wrote:\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Â\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Fiona,\n&gt; &gt;\n&gt; &gt; Sorry to butt in, but I&#39;m curious. If this is happening 500 Light Years\n&gt; away from us, doesn&#39;t that mean it will be visible to us in 500 years? I\n&gt; know that there is a delay with sound such as thunder, then the delay before\n&gt; an individual hears it depending on how far they are from where the sound\n&gt; originated. Wouldn&#39;t it be the same with light?\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; ~Draiga\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups .com, &quot;Fiona Broome&quot; &lt;email@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; Hi,\n&gt; &gt; &gt;\n&gt; &gt;\n&gt; &gt; &gt; Frank, you mentioned June 17th and 22nd... I&#39;ll be watching the PEAR\n&gt; project (RNG anomalies) anyway, but I think I&#39;ve found what they&#39;re talking\n&gt; to you about:\n&gt; &gt; &gt;\n&gt; &gt; &gt; http://unixronin. livejournal. com/763082. html\n&gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; Yes, that could be the biggest & best lightshow, ever. Get your lawn\n&gt; chairs ready!\n&gt; &gt; &gt;\n&gt; &gt; &gt; Cheerfully,\n&gt; &gt; &gt; Fiona\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; &gt; --- In EVP-ITC@yahoogroups .com, Frank Sumption &lt;purplealiengirl@&gt;\n&gt; wrote:\n&gt; &gt;\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; So does that mean there was a possiblity of a something\n&gt; &gt; event on May 7th?\n&gt; &gt; &gt; &gt; &gt; Got anything for June 17th, or 22nd?\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; Frank-S\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nHones ly F ank..we may ag ee o some ex en on his. This bo de s on p inciples o magick, and using you Will o e ec change in he uni e se. I is kinda like whe e magick and science mee .Buddhism has belie s along hese lines as well, hough hey do no explain i qui e like his. They belie e he e is an objec i e uni e se, bu ha we p ojec ou own images on o his ma e , he eby pe cei ing hings di e en ly. They belie e we pe cie e ma e mainly based on ou emo ions, and wha we hink wan e sus wha is ac ually he e. Pa o achie ing enligh enmen is ac ually b eaking ou o he emo ional way o iewing hings, and ac ually using ou minds o ou ad an age, a he hen jus le ing ou emo ions ule wha we pe cei e.\nOn Thu, Jun 3, 2010 a 8:19 AM, pu plespace iend pu plealiengi l@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n I ecall a book om yea s ago, some hing like \"When Fi e Doesn' Bu n\". We seem o ha e he abili y o change ou pe cep ions and /o eali y and c ea e he condi ions whe e i e doesn' bu n he body. I 's been way o long o me o ha e any hing bu a ague memo y o he book. I hink he quan um s a es o ma e do mani es on he ma co le el, and can be e ec ed by hough --yeah I know, whe e's he p oo . \n\n\nF-S\n\n--- In EVP-ITC@yahoog oups.com, Rj w o e:\n>\n> Thanks o he poin e - i sounds in e es ing.\n> \n> My unde s anding o his idea is ha he e a e wei d hings along hose lines ha happen wi h indi idual a oms and below ha le el.Â  Bu his does no apply (has ne e been obse ed) in no mal li e.Â  Fo ins ance, all he quan um heo ies o disbelie in he wo ld is no going o sa e usÂ  i we lie down in a ic.Â  :)\n\n> \n> --- On Thu, 6/3/10, Ap il Abe c ombie w o e:\n> \n> F om: Ap il Abe c ombie \n> Subjec : Re: [EVP-ITC] Re: Tesing- es ing\n> To: EVP-ITC@yahoog oups.com\n> Da e: Thu sday, June 3, 2010, 6:27 AM\n> \n> \n> \n> \n> \n> \n> \n> Â \n> \n> \n> \n> \n> \n> \n> \n> \n> \n> F ank did ha e a poin he e. The e is some schools o hough ha sugges ha no huing exis is ou side o ou sel es, ha we pe cei e and c ea e ou own eali ies. Things exis because we belie e hey do, calling hem in o eali y. I you ha e e e wa ched he mo ie/documen a y 'Wha he Bleep Do We Know?\" i explains his in de ail using scien i ic p incipals.\n\n> \n> \n> I am no su e how much o i I ag ee wi h, bu he e is some u h o he hough ha we c ea e ou own eali ies.\n> \n> I you ha e no seen his mo ie, I can ecommend i . E en o you don' ag ee wi h all o i , i does gi e you some in e es ing ood o hough .\n> \n> \n> On Wed, Jun 2, 2010 a 4:33 PM, Rj w o e:\n> \n> \n> \n> \n> \n> \n> \n> \n> \n> \n> \n> \n> \n> \n> \n> \n> Â \n> \n> \n> \n> \n> \n> \n> \n> \n> \n> In e es ing.Â  I see science as being he basis o mos o ou li es.\n> \n> \n> --- On Wed, 6/2/10, F ank Sump ion gmail.com> w o e:\n> \n> \n> F om: F ank Sump ion gmail.com>\n> Subjec : Re: [EVP-ITC] Re: Tesing- es ing\n> \n> To: EVP-ITC@yahoog oups .com\n> Da e: Wednesday, June 2, 2010, 11:58 AM\n> \n> \n> Â  \n> \n> \n> Â I was jus kidding, bu pe sonally I don' hink he e is a ixed, undamen al eali y. Jus like he wa e/pa icle, i 's wha e e one hinks i is a ha momen , o ha pe son/ es . \n> Â When he hey aim Hubble a a blank spo in space, and gi e i a long exposu e, e ealing billions o new galaxies--did hose galaxies always exis , o did science wish hem o exis -e heo ize hey exis ? and who can p o e ei he way? Quan um \"science\" suggges s ha e e y ime anyone on he plane /uni e se has a discision o make an new uni e se is ins an ly c ea ed o accommoda e bo h, kinda nega es he speed o ligh speed limi wouldn' i , no o men ion e e y o he law o physics. \n\n> \n> Â \n> Â Yeah, I jus don' see science being o much help wi h any hing. \n> Â \n> Â F-S\n> Â \n> Â \n> \n> \n> On Wed, Jun 2, 2010 a 12:38 PM, Rj w o e:\n> \n> \n> \n> Â  \n> \n> \n> \n> \n> \n> \n> \n> Ligh is bo h a pa icle and a wa e, depending on wha you' e looking o , o how you measu e i .Â  Tha goes o e e y hing on he elec o-magne ic (EM) spec um, o which ligh is pa , bu g a i y is no .\n\n> \n> \n> Acco ding o cu en science, he e a e 4 undamen al o ces in he uni e se: EM is one, and g a i y is ano he (and hen he o he s I hink a e s ong and weak o ces a he a omic le el). \n> \n> \n> --- On Wed, 6/2/10, F ank Sump ion gmail.com> w o e:\n> \n> \n> \n> \n> F om: F ank Sump ion gmail.com>\n> Subjec : Re: [EVP-ITC] Re: Tesing- es ing\n> \n> To: EVP-ITC@yahoog oups .com\n> Da e: Wednesday, June 2, 2010, 11:31 AM \n> \n> \n> \n> \n> \n> Â  \n> \n> \n> Oh, i 's ligh is a pa icle and g a i y a wa e?\n> Â \n> F-S\n> \n> \n> On Wed, Jun 2, 2010 a 11:07 AM, Rj w o e:\n> \n> \n> Â  \n> \n> \n> \n> \n> \n> \n> \n> No g a i y-pa icle has been disco e ed (g a i on?). Bu he e a e heo ies abou g a i y being a pa icle, o a bend in space- ime, o a wa e, o a lo o hings.Â  Science is s ill g appling wi h his.\n\n> \n> \n> \n> --- On Wed, 6/2/10, F ank Sump ion gmail.com> w o e:\n> \n> \n> F om: F ank Sump ion gmail.com>\n> Subjec : Re: [EVP-ITC] Re: Tesing- es ing \n> \n> To: EVP-ITC@yahoog oups .com\n> Da e: Wednesday, June 2, 2010, 9:55 AM \n> \n> \n> \n> Â  \n> \n> \n> \n> I hough g a i y was a pa icle.\n> Â \n> Â F-S\n> \n> On Wed, Jun 2, 2010 a 10:45 AM, Zack Widup w o e:\n> \n> \n> Â  \n> \n> \n> \n> \n> Yes; i i happened now i would be isible 500 yea s om now. I i happened 500 yea s ago, i would be isible now.\n> Â \n> Howe e , he e a e people including G eg Hodowanec who ha e collec ed some e idence ha g a i y wa es a e nea ins an aneous, and ha i a supe no a occu ed now, i could be de ec ed now. S ill, we wouldn' SEE i o 500 yea s. AndÂ  he equipmen Â desc ibed by Hodowanec (which I' e buil )Â can' ell us WHERE he supe no a occu ed, jus he ac i did.\n\n> \n> \n> Zack\n> \n> \n> Â \n> On Wed, Jun 2, 2010 a 10:10 AM, d aiga1 w o e:\n> \n> \n> Â  \n> \n> \n> \n> Fiona,\n> \n> So y o bu in, bu I'm cu ious. I his is happening 500 Ligh Yea s away om us, doesn' ha mean i will be isible o us in 500 yea s? I know ha he e is a delay wi h sound such as hunde , hen he delay be o e an indi idual hea s i depending on how a hey a e om whe e he sound o igina ed. Wouldn' i be he same wi h ligh ?\n\n> \n> \n> ~D aiga \n> \n> \n> --- In EVP-ITC@yahoog oups .com, \"Fiona B oome\" w o e:\n> >\n> > Hi,\n> > \n> \n> > F ank, you men ioned June 17 h and 22nd... I'll be wa ching he PEAR p ojec (RNG anomalies) anyway, bu I hink I' e ound wha hey' e alking o you abou :\n> > \n> > h p://unix onin. li ejou nal. com/763082. h ml\n> \n> > \n> > Yes, ha could be he bigges & bes ligh show, e e . Ge you lawn chai s eady!\n> > \n> > Chee ully,\n> > Fiona\n> > \n> > \n> > \n> > > --- In EVP-ITC@yahoog oups .com, F ank Sump ion w o e:\n> \n> > > >\n> > > > So does ha mean he e was a possibli y o a some hing\n> e en on May 7 h?\n> > > > Go any hing o June 17 h, o 22nd?\n> > > > \n> > > > F ank-S\n> > > >\n> >\n>"}