{"id": "17505", "subject": "Re: [EVP-ITC] Re:Greetings", "author": "Frank Sumption", "timestamp": "2010-06-04T13:46:58Z", "full_text": "Most of the time I&#39;m so busy building the junk I don&#39;t take time to\nactually use it. My right ear has about 1/4 the sensitvity of the left ear,\nmaybe less, I miss alot. Some of these voices are my ET guys and some are\nposers that confuse everything.\n\n f-S\n\nOn Thu, Jun 3, 2010 at 5:01 PM, tim_woolworth &lt;tim@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Frank,\n&gt;\n&gt; Yeah, you do get them talking about you. It seems like there is a lot of\n&gt; conversation between many voices here and they are talking about calling. At\n&gt; .08, somebody is tee&#39;d off.\n&gt;\n&gt; There is something to labeling affecting subliminal interpretation. When I\n&gt; read your interpretation of the &quot;jesus&quot; line at the beginning, that is what\n&gt; I heard through the speakers first and foremost. I turned the speakers off\n&gt; and used studio grade headphones for analysis. Voila, no Jesus. I guess he\n&gt; was resurrected from this clip! I often wonder if the sound waves between\n&gt; speaker and listener are manipulated in some way. This is why I like to\n&gt; listen in enclosed headphones, that way your ear is directly against the\n&gt; sound source.\n&gt;\n&gt; That said, this is what I hear from your clip:\n&gt;\n&gt; @.01: &quot;He&#39;s calling you, he&#39;s a (unclear)&quot; (male, electronic)\n&gt; @.03: It amounts to scheisse\n&gt; @.05: &quot;Make sure he has the date&quot; (male)\n&gt; @.06: &quot;May Eighteenth&quot; (electronic)\n&gt; @.08: &quot;Fuck this guy&quot; (male)\n&gt; @.09: Singing - &quot;He doesn&#39;t call her, call her (?anymore?)&quot; (female)\n&gt; @.12: He doesn&#39;t seem to reply (male)\n&gt; @.13: Steve (?Coogle? - unclear)\n&gt;\n&gt; I know you typically don&#39;t interact with the box by asking questions, but\n&gt; have you ever tried telling them to communicate one at a time? It works for\n&gt; me most of the time when multiple voices crowd the box. Regardless, they\n&gt; definitely like communicating with you. I find the electronic voices and\n&gt; tones you get most interesting; they remind me of spiricom audio.\n&gt;\n&gt; Tim\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Frank Sumption\n&gt; &lt;purplealiengirl@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; A 6 seconds &quot;make sure he has the date--the 17th&quot;, as two seem to talk\n&gt; back\n&gt; &gt; and forth. Yet another pick up date? I keep saying I still have stuff to\n&gt; do,\n&gt; &gt; but now the talk about using force.\n&gt; &gt;\n&gt; &gt; Starts out &quot;he calls like I&#39;m Jesus..&quot; it gets head warping weird.\n&gt; &gt;\n&gt; &gt; I really doubt these are acidental &quot;captures&quot;, as I don&#39;t have a set time\n&gt; &gt; to record.\n&gt; &gt;\n&gt; &gt; F-S\n&gt; &gt;\n&gt; &gt; On Thu, Jun 3, 2010 at 3:49 PM, Frank Sumption &lt;purplealiengirl@...&gt;wrote:\n&gt;\n&gt;\n&gt; &gt;\n&gt; &gt; &gt; I hear that stuff too.\n&gt; &gt; &gt;\n&gt; &gt; &gt; F-S\n&gt; &gt; &gt;\n&gt; &gt; &gt; On Thu, Jun 3, 2010 at 1:42 PM, tim_woolworth &lt;tim@...&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt; Thanks.\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt; I have found that they do talk among themselves all the time. A lot of\n&gt; the\n&gt; &gt; &gt;&gt; time, they are talking about me like I am not even there. In some of\n&gt; those\n&gt; &gt; &gt;&gt; clips, you can definitely hear them talking amongst themselves.\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt; The main voice you hear (especially in clip 4) is my technician, or as\n&gt; I\n&gt; &gt; &gt;&gt; call him, my facilitator. He is the one telling Raudive to ask his\n&gt; question\n&gt; &gt; &gt;&gt; and telling an Other to wait. I have numerous clips where I will ask a\n&gt; &gt; &gt;&gt; question and I can hear him ask the same question of the Others. This\n&gt; is all\n&gt; &gt; &gt;&gt; the personal proof I need (besides my name and facts about my life\n&gt; coming\n&gt; &gt; &gt;&gt; through a broken radio). To hear your own words coming through the\n&gt; radio in\n&gt; &gt; &gt;&gt; a different voice is something that should be considered\n&gt; impossible...but\n&gt; &gt; &gt;&gt; then to get an answer back from those reiterated words, well, I\n&gt; consider\n&gt; &gt; &gt;&gt; that pretty damn good evidence that there is an intelligence trying to\n&gt; &gt; &gt;&gt; communicate.\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt; But then again, any scientist can easily say that I was experiencing\n&gt; &gt; &gt;&gt; nothing more that a Ham radio operator having fun at my expense. My\n&gt; only\n&gt; &gt; &gt;&gt; come back to this is that since I still a ghost hunter, I have\n&gt; traveled\n&gt; &gt; &gt;&gt; extensively to different locations. I have been bringing my box out in\n&gt; to\n&gt; &gt; &gt;&gt; the field for location experiments. Guess what? My facilitator speaks\n&gt; in\n&gt; &gt; &gt;&gt; every spot, in every state that I have tried this in.\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt; Tim\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt; &lt;EVP-ITC%\n&gt; 40yahoogroups.com&gt;, leongbabe@\n&gt;\n&gt; &gt; &gt;&gt; wrote:\n&gt; &gt; &gt;&gt; &gt;\n&gt; &gt; &gt;&gt; &gt;\n&gt; &gt; &gt;&gt; &gt; Hi Tim,\n&gt; &gt; &gt;&gt; &gt;\n&gt; &gt; &gt;&gt; &gt; Thanks for sharing your files - I heard a lot of different names in\n&gt; your\n&gt; &gt; &gt;&gt; clips Nos. 1-3, including the names Tim, Mark, and Steve; in clip No.\n&gt; 2,\n&gt; &gt; &gt;&gt; sounded like they&#39;re mostly talking among themselves. In No. 1, I\n&gt; heard\n&gt; &gt; &gt;&gt; &quot;This is Tim ... what is that... enough power.... settled.&quot; Nos. 4 and\n&gt; 5 are\n&gt; &gt; &gt;&gt; very clear - heard what you heard.\n&gt; &gt; &gt;&gt; &gt;\n&gt; &gt; &gt;&gt; &gt; Sharon from SF\n&gt; &gt; &gt;&gt; &gt;\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nMos o he ime I'm so busy building he junk I don' ake ime o ac ually use i . My igh ea has abou 1/4 he sensi i y o he le ea , maybe less, I miss alo . Some o hese oices a e my ET guys and some a e pose s ha con use e e y hing. \n\n \n  -S\nOn Thu, Jun 3, 2010 a 5:01 PM, im_woolwo h im@...> w o e:\n\n  \n\n\n\nF ank,Yeah, you do ge hem alking abou you. I seems like he e is a lo o con e sa ion be ween many oices he e and hey a e alking abou calling. A .08, somebody is ee'd o . The e is some hing o labeling a ec ing subliminal in e p e a ion. When I ead you in e p e a ion o he \"jesus\" line a he beginning, ha is wha I hea d h ough he speake s i s and o emos . I u ned he speake s o and used s udio g ade headphones o analysis. Voila, no Jesus. I guess he was esu ec ed om his clip! I o en wonde i he sound wa es be ween speake and lis ene a e manipula ed in some way. This is why I like o lis en in enclosed headphones, ha way you ea is di ec ly agains he sound sou ce.\nTha said, his is wha I hea om you clip:@.01: \"He's calling you, he's a (unclea )\" (male, elec onic)@.03: I amoun s o scheisse@.05: \"Make su e he has he da e\" (male)\n@.06: \"May Eigh een h\" (elec onic)@.08: \"Fuck his guy\" (male)@.09: Singing - \"He doesn' call he , call he (?anymo e?)\" ( emale)@.12: He doesn' seem o eply (male)\n@.13: S e e (?Coogle? - unclea )I know you ypically don' in e ac wi h he box by asking ques ions, bu ha e you e e ied elling hem o communica e one a a ime? I wo ks o me mos o he ime when mul iple oices c owd he box. Rega dless, hey de ini ely like communica ing wi h you. I ind he elec onic oices and ones you ge mos in e es ing; hey emind me o spi icom audio.\nTim \n--- In EVP-ITC@yahoog oups.com, F ank Sump ion w o e:>> A 6 seconds \"make su e he has he da e-- he 17 h\", as wo seem o alk back\n> and o h. Ye ano he pick up da e? I keep saying I s ill ha e s u o do,> bu now he alk abou using o ce.> > S a s ou \"he calls like I'm Jesus..\" i ge s head wa ping wei d.\n> > I eally doub hese a e aciden al \"cap u es\", as I don' ha e a se ime> o eco d.> > F-S> > On Thu, Jun 3, 2010 a 3:49 PM, F ank Sump ion w o e: \n> > > I hea ha s u oo.> >> > F-S> >\n> > On Thu, Jun 3, 2010 a 1:42 PM, im_woolwo h w o e:> >> >>> >>> >> Thanks.> >>> >> I ha e ound ha hey do alk among hemsel es all he ime. A lo o he\n> >> ime, hey a e alking abou me like I am no e en he e. In some o hose> >> clips, you can de ini ely hea hem alking amongs hemsel es.> >>> >> The main oice you hea (especially in clip 4) is my echnician, o as I\n> >> call him, my acili a o . He is he one elling Raudi e o ask his ques ion> >> and elling an O he o wai . I ha e nume ous clips whe e I will ask a> >> ques ion and I can hea him ask he same ques ion o he O he s. This is all\n> >> he pe sonal p oo I need (besides my name and ac s abou my li e coming> >> h ough a b oken adio). To hea you own wo ds coming h ough he adio in> >> a di e en oice is some hing ha should be conside ed impossible...bu \n> >> hen o ge an answe back om hose ei e a ed wo ds, well, I conside > >> ha p e y damn good e idence ha he e is an in elligence ying o> >> communica e.> >>\n> >> Bu hen again, any scien is can easily say ha I was expe iencing> >> no hing mo e ha a Ham adio ope a o ha ing un a my expense. My only> >> come back o his is ha since I s ill a ghos hun e , I ha e a eled\n> >> ex ensi ely o di e en loca ions. I ha e been b inging my box ou in o> >> he ield o loca ion expe imen s. Guess wha ? My acili a o speaks in> >> e e y spo , in e e y s a e ha I ha e ied his in.\n> >>> >> Tim> >>> >> --- In EVP-ITC@yahoog oups.com 40yahoog oups.com>, leongbabe@ \n> >> w o e:> >> >> >> >> >> > Hi Tim,> >> >> >> > Thanks o sha ing you iles - I hea d a lo o di e en names in you \n> >> clips Nos. 1-3, including he names Tim, Ma k, and S e e; in clip No. 2,> >> sounded like hey' e mos ly alking among hemsel es. In No. 1, I hea d> >> \"This is Tim ... wha is ha ... enough powe .... se led.\" Nos. 4 and 5 a e\n> >> e y clea - hea d wha you hea d.> >> >> >> > Sha on om SF> >> >> >>> >> > >>> >> >>"}