{"id": "17511", "subject": "Re: [EVP-ITC] For skeptics?", "author": "Frank Sumption", "timestamp": "2010-06-04T21:47:01Z", "full_text": "They&#39;re cheap, just run to Radio Shack. It wouldn&#39;t be worth the postage to\nmail one.  You&#39;ll need a bit flux core solder to tin the wire with!\n\n F-S\n\nOn Fri, Jun 4, 2010 at 3:23 PM, &lt;SnowfireL@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; anyone have a soldering gun i can borrow??? lol, i managed to take off the\n&gt; mute on this 20-125 but broke off the end of the black speaker wire, old\n&gt; tumble fingers and blind as a bat over here. sf\n&gt;\n&gt;  In a message dated 6/4/2010 5:21:55 P.M. Eastern Daylight Time,\n&gt; purplealiengirl@... writes:\n&gt;\n&gt;\n&gt;\n&gt; C2C next week *Tuesday June 8, 2010*&lt;http://www.coasttocoastam.com/show/2010/06/08&gt;\n&gt;\n&gt; &quot;Former nuclear physicist Stanton Friedman&lt;http://www.stantonfriedman.com/&gt;and social scientist Kathleen\n&gt; Marden &lt;http://www.kathleen-marden.com/&gt; will discuss the various examples\n&gt; throughout history when scientists misjudged or ignored the potential for\n&gt; advancements in science.&quot;\n&gt;\n&gt;  You know, the stuff &quot;science&quot; was telling everyone was impossible while\n&gt; inventors were doing it.\n&gt;\n&gt;  F-S\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;   \n&gt;\n\nThey' e cheap, jus un o Radio Shack. I wouldn' be wo h he pos age o mail one.  You'll need a bi lux co e solde o in he wi e wi h!\n \n F-S\nOn F i, Jun 4, 2010 a 3:23 PM, Snow i eL@...> w o e:\n\n  \n\n\n\n\nanyone ha e a solde ing gun i can bo ow??? lol, i managed o ake o he mu e on his 20-125 bu b oke o he end o he black speake wi e, old umble inge s and blind as a ba o e he e. s \n\n\n\n \n\nIn a message da ed 6/4/2010 5:21:55 P.M. Eas e n Dayligh Time, pu plealiengi l@... w i es:\n  \n\n\nC2C nex week Tuesday June 8, 2010\n \n\"Fo me nuclea physicis S an on F iedman and social scien is Ka hleen Ma den will discuss he a ious examples h oughou his o y when scien is s misjudged o igno ed he po en ial o ad ancemen s in science.\"\n\n \n You know, he s u \"science\" was elling e e yone was impossible while in en o s we e doing i .\n \n F-S"}