{"id": "17524", "subject": "Re: [EVP-ITC] For skeptics?", "author": "Frank Sumption", "timestamp": "2010-06-05T07:11:24Z", "full_text": "Tin means just melt some solder on the wire, then you melt the solder onthe\nconnectin and stick them together.\n\n F-S\n\nOn Fri, Jun 4, 2010 at 3:58 PM, &lt;SnowfireL@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Well, i wasn&#39;t able to get things back together, i know nothing about\n&gt; taking radios a part, and i couldn&#39;t get those little gray buttions back\n&gt; into place, too afraid i&#39;ll make things worse. I taped the wire but, it\n&gt; doesn&#39;t stay, i couldn&#39;t get the little strap back on it, i have them\n&gt; hollering at me, at how to fix it, lol,  &quot;tin&quot;  what do you mean by &quot;tin the\n&gt; wire.&quot;  Sorry for my stupidity, but i shouldn&#39;t have done this to begin\n&gt; with, i some how did cut the mute wire though, but i have no idea how i did\n&gt; that, probably just broke it, tomorrow i go to RS and see if i can get\n&gt; something. Tks. sf\n&gt;\n&gt;  In a message dated 6/4/2010 5:47:08 P.M. Eastern Daylight Time,\n&gt; purplealiengirl@... writes:\n&gt;\n&gt;\n&gt;\n&gt; They&#39;re cheap, just run to Radio Shack. It wouldn&#39;t be worth the postage to\n&gt; mail one.  You&#39;ll need a bit flux core solder to tin the wire with!\n&gt;\n&gt;  F-S\n&gt;\n&gt; On Fri, Jun 4, 2010 at 3:23 PM, &lt;SnowfireL@...&gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; anyone have a soldering gun i can borrow??? lol, i managed to take off the\n&gt;&gt; mute on this 20-125 but broke off the end of the black speaker wire, old\n&gt;&gt; tumble fingers and blind as a bat over here. sf\n&gt;&gt;\n&gt;&gt;  In a message dated 6/4/2010 5:21:55 P.M. Eastern Daylight Time,\n&gt;&gt; purplealiengirl@... writes:\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; C2C next week *Tuesday June 8, 2010*&lt;http://www.coasttocoastam.com/show/2010/06/08&gt;\n&gt;&gt;\n&gt;&gt; &quot;Former nuclear physicist Stanton Friedman&lt;http://www.stantonfriedman.com/&gt;and social scientist Kathleen\n&gt;&gt; Marden &lt;http://www.kathleen-marden.com/&gt; will discuss the various\n&gt;&gt; examples throughout history when scientists misjudged or ignored the\n&gt;&gt; potential for advancements in science.&quot;\n&gt;&gt;\n&gt;&gt;  You know, the stuff &quot;science&quot; was telling everyone was impossible while\n&gt;&gt; inventors were doing it.\n&gt;&gt;\n&gt;&gt;  F-S\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;   \n&gt;\n\nTin means jus mel some solde on he wi e, hen you mel he solde on he connec in and s ick hem oge he . \n \n F-S\nOn F i, Jun 4, 2010 a 3:58 PM, Snow i eL@...> w o e:\n\n  \n\n\n\n\nWell, i wasn' able o ge hings back oge he , i know no hing abou aking adios a pa , and i couldn' ge hose li le g ay bu ions back in o place, oo a aid i'll make hings wo se. I aped he wi e bu , i doesn' s ay, i couldn' ge he li le s ap back on i , i ha e hem holle ing a me, a how o ix i , lol,  \" in\"  wha do you mean by \" in he wi e.\"  So y o my s upidi y, bu i shouldn' ha e done his o begin wi h, i some how did cu he mu e wi e hough, bu i ha e no idea how i did ha , p obably jus b oke i , omo ow i go o RS and see i i can ge some hing. Tks. s \n\n\n \n\nIn a message da ed 6/4/2010 5:47:08 P.M. Eas e n Dayligh Time, pu plealiengi l@gmail.com w i es:\n  \n\n\nThey' e cheap, jus un o Radio Shack. I wouldn' be wo h he pos age o mail one.  You'll need a bi lux co e solde o in he wi e wi h!\n \n F-S\nOn F i, Jun 4, 2010 a 3:23 PM, Snow i eL@...> w o e:\n\n  \n\n\n\n\nanyone ha e a solde ing gun i can bo ow??? lol, i managed o ake o he mu e on his 20-125 bu b oke o he end o he black speake wi e, old umble inge s and blind as a ba o e he e. s \n\n\n\n \n\nIn a message da ed 6/4/2010 5:21:55 P.M. Eas e n Dayligh Time, pu plealiengi l@... w i es:\n  \n\n\nC2C nex week Tuesday June 8, 2010\n \n\"Fo me nuclea physicis S an on F iedman and social scien is Ka hleen Ma den will discuss he a ious examples h oughou his o y when scien is s misjudged o igno ed he po en ial o ad ancemen s in science.\"\n\n \n You know, he s u \"science\" was elling e e yone was impossible while in en o s we e doing i .\n \n F-S"}