{"id": "17578", "subject": "Re: [EVP-ITC] Same stupid nasty negative BS!", "author": "Kim Sharples", "timestamp": "2010-06-09T05:27:34Z", "full_text": "all the experts know ghosts can&#39;t cuss.......?????\nare you kidding me?\n\nWhile I&#39;ve never been fortunate to use a box - this is just bull*&^%....\nI&#39;ve heard EVP&#39;s with cussing...\n\ntry not to let it get you down...\n\nKim S\n\n\n\nOn Tue, Jun 8, 2010 at 2:59 PM, Frank Sumption &lt;purplealiengirl@...&gt;wrote:\n\n&gt;\n&gt;\n&gt;  Got letter(e-mail) from a world renowned EVP authority( name withheld cuz\n&gt; I know the threats that would come), explaining how they tested the boxes\n&gt; and found nothing to it, y&#39;all just silly uninformed masses that don&#39;t know\n&gt; any better and they&#39;ll tell us all what&#39;s ok to hear and believe in!\n&gt; Thousands of box users and experiencers are either lying or insane!\n&gt;\n&gt;  Pseudo scientific BS! Their testing reveals exactly what they expectt,\n&gt; that is the nature of the paranormal. Getting the results they wanted, they\n&gt; puff out their chests and proclaim yet another victory for science!\n&gt; Science has a habit of supplying exactly the results wanted by whoever is\n&gt; paying for the tests..\n&gt;\n&gt;  First, where do they find people that are somehow qualified listeners!?\n&gt; WTF is that S---!? It&#39;s BS, and they know it. Same old skeptic/science crap,\n&gt; except from a group that wants to be the worlds onlyest EVP authority.\n&gt;\n&gt;  I&#39;m sure there will be articles in major paranormal mags proclaiming how\n&gt; the experts thoroughly debunked the boxes.\n&gt;\n&gt;  They keep testing and getting nothing, and the rest of us keep recording\n&gt; and have no shortage of voices that others can hear, can be validated, and\n&gt; gives infromation that&#39;s unknow to the listener. I just posted a video where\n&gt; a voice says &quot;I said fuck&quot; just to show it&#39;s not broadcast frags. This stuff\n&gt; conveniently ignored.  I&#39;ve been kicked off groups for getting voices thast\n&gt; somehow were judged not ghostly enough, cuz all the experts know ghosts\n&gt; can&#39;t cuss, they can barely even talk and communcate!\n&gt;\n&gt;  They send me their stupid results thinking I&#39;m the one out there pushing\n&gt; boxes. Ignorant dorks, it&#39;s the results pushing boxes!\n&gt;\n&gt;  Frank-S\n&gt;\n&gt;\n&gt;  \n&gt;\n\nall he expe s know ghos s can' cuss.......?????a e you kidding me?While I' e ne e been o una e o use a box - his is jus bull*&^%....I' e hea d EVP's wi h cussing... y no o le i ge you down...\nKim SOn Tue, Jun 8, 2010 a 2:59 PM, F ank Sump ion pu plealiengi l@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n  Go le e (e-mail) om a wo ld enowned EVP au ho i y( name wi hheld cuz I know he h ea s ha would come), explaining how hey es ed he boxes and ound no hing o i , y'all jus silly unin o med masses ha don'  know any be e and hey'll ell us all wha 's ok  o hea and belie e in! Thousands o box use s and expe ience s a e ei he lying o insane!\n\n\n \n Pseudo scien i ic BS! Thei es ing e eals exac ly wha hey expec , ha is he na u e o he pa ano mal. Ge ing he esul s hey wan ed, hey pu ou hei ches s and p oclaim ye ano he ic o y o science!   Science has a habi o supplying exac ly he esul s wan ed by whoe e is paying o he es s.. \n\n\n \n Fi s , whe e do hey ind people ha a e somehow quali ied lis ene s!? WTF is ha S---!? I 's BS, and hey know i . Same old skep ic/science c ap, excep om a g oup ha wan s o be he wo lds onlyes EVP au ho i y.\n\n\n \n I'm su e he e will be a icles in majo pa ano mal mags p oclaiming how he expe s ho oughly debunked he boxes. \n \n They keep es ing and ge ing no hing, and he es o us keep eco ding and ha e no sho age o oices ha o he s can hea , can be alida ed, and gi es in oma ion ha 's unknow o he lis ene . I jus pos ed a ideo whe e a oice says \"I said uck\" jus o show i 's no b oadcas ags. This s u con enien ly igno ed.  I' e been kicked o g oups o ge ing oices has somehow we e judged no ghos ly enough, cuz all he expe s know ghos s can' cuss, hey can ba ely e en alk and communca e! \n\n\n \n They send me hei s upid esul s hinking I'm he one ou he e pushing boxes. Igno an do ks, i 's he esul s pushing boxes! \n \n F ank-S\n \n \n\n\n \n \n\n \n \n\n\n\n\n\n\n \n\n\n\n\n\n\n#a g_ls_inline_popup { posi ion:absolu e; z-index:9999; padding: 0px 0px; ma gin-le : 0px; ma gin- op: 0px; wid h: 240px; o e low: hidden; wo d-w ap: b eak-wo d; colo : black; on -size: 10px; ex -align: le ; line-heigh : 13px;}"}