{"id": "17577", "subject": "Re: [EVP-ITC] Re: Same stupid nasty negative BS!", "author": "Frank Sumption", "timestamp": "2010-06-09T06:44:23Z", "full_text": "Thanks. It&#39;s the same &quot;scientific&quot; BS, this time with &quot;more qualified\nlisteners&quot;, not only that, from an unexpected source. There&#39;s skpetics that\nwant the boxes to go away, and there&#39;s EVP authorities that want the boxes\nto go away.\n\n F-S\n\nOn Tue, Jun 8, 2010 at 3:24 PM, Fiona Broome &lt;email@fionabroome.com&gt; wrote:\n\n&gt;\n&gt;\n&gt; Hi,\n&gt;\n&gt; I&#39;m amazed when anyone claims they can&#39;t clearly hear the voices. Okay, so\n&gt; far my only experience has been listening to Chris Moon&#39;s sessions in\n&gt; Canada, and the recordings posted here.\n&gt;\n&gt; What I hadn&#39;t expected were consistent voices. Oh, I&#39;d heard some &quot;Shack\n&gt; Hack&quot; recordings with one word in a female voice, another word sung, a third\n&gt; word in a male voice, and so on. That didn&#39;t impress me.\n&gt;\n&gt; My experiences with Chris&#39; work startled me. Your recordings astonish and\n&gt; impress me.\n&gt;\n&gt; (Not just yours, Frank, but many of the recordings posted to this list.\n&gt; I&#39;ve been listening in my spare time, trying to wrap my brain around how\n&gt; well this works, and how I&#39;ve been totally missing the boat with this stuff,\n&gt; for years.)\n&gt;\n&gt; I&#39;m hearing consistent voices, consistent accents, consistent speech\n&gt; patterns.\n&gt;\n&gt; Regularly, I have to debate so-called authorities who want to be the\n&gt; best/only &quot;experts&quot; in the paranormal field. (That&#39;s one of the perils of\n&gt; appearing on panels at events.)\n&gt;\n&gt; Someone else in the field aptly described the self-proclaimed authorities\n&gt; as a bunch of junkyard dogs fighting over a chewed-over bone.\n&gt;\n&gt; Well, maybe that&#39;s an insult to junkyard dogs, now that I think about it.\n&gt;\n&gt; My point is: A whole lot of what I see at paranormal events is about status\n&gt; and politics. I&#39;m not interested in that. I&#39;m interested in results.\n&gt;\n&gt; Results are what I&#39;m seeing on this list. That&#39;s what matters.\n&gt;\n&gt; Keep doing what you&#39;re doing. This is important.\n&gt;\n&gt; Sincerely,\n&gt; Fiona\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Frank Sumption\n&gt; &lt;purplealiengirl@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Got letter(e-mail) from a world renowned EVP authority( name withheld cuz\n&gt; I\n&gt; &gt; know the threats that would come), explaining how they tested the boxes\n&gt; and\n&gt; &gt; found nothing to it, y&#39;all just silly uninformed masses that don&#39;t know\n&gt; any\n&gt; &gt; better and they&#39;ll tell us all what&#39;s ok to hear and believe in!\n&gt; Thousands\n&gt; &gt; of box users and experiencers are either lying or insane!\n&gt;\n&gt;  \n&gt;\n\nThanks. I 's he same \"scien i ic\" BS, his ime wi h \"mo e quali ied lis ene s\", no only ha , om an unexpec ed sou ce. The e's skpe ics ha wan   he boxes o go away, and he e's EVP au ho i ies ha wan he boxes o go away. \n\n \n F-S\nOn Tue, Jun 8, 2010 a 3:24 PM, Fiona B oome email@...> w o e:\n\n  \n\n\n\nHi,I'm amazed when anyone claims hey can' clea ly hea he oices. Okay, so a my only expe ience has been lis ening o Ch is Moon's sessions in Canada, and he eco dings pos ed he e.Wha I hadn' expec ed we e consis en oices. Oh, I'd hea d some \"Shack Hack\" eco dings wi h one wo d in a emale oice, ano he wo d sung, a hi d wo d in a male oice, and so on. Tha didn' imp ess me.\nMy expe iences wi h Ch is' wo k s a led me. You eco dings as onish and imp ess me. (No jus you s, F ank, bu many o he eco dings pos ed o his lis . I' e been lis ening in my spa e ime, ying o w ap my b ain a ound how well his wo ks, and how I' e been o ally missing he boa wi h his s u , o yea s.)\nI'm hea ing consis en oices, consis en accen s, consis en speech pa e ns.Regula ly, I ha e o deba e so-called au ho i ies who wan o be he bes /only \"expe s\" in he pa ano mal ield. (Tha 's one o he pe ils o appea ing on panels a e en s.)\nSomeone else in he ield ap ly desc ibed he sel -p oclaimed au ho i ies as a bunch o junkya d dogs igh ing o e a chewed-o e bone.Well, maybe ha 's an insul o junkya d dogs, now ha I hink abou i .\nMy poin is: A whole lo o wha I see a pa ano mal e en s is abou s a us and poli ics. I'm no in e es ed in ha . I'm in e es ed in esul s.Resul s a e wha I'm seeing on his lis . Tha 's wha ma e s.\nKeep doing wha you' e doing. This is impo an .Since ely,Fiona \n--- In EVP-ITC@yahoog oups.com, F ank Sump ion w o e:>> Go le e (e-mail) om a wo ld enowned EVP au ho i y( name wi hheld cuz I\n> know he h ea s ha would come), explaining how hey es ed he boxes and> ound no hing o i , y'all jus silly unin o med masses ha don' know any> be e and hey'll ell us all wha 's ok o hea and belie e in! Thousands\n> o box use s and expe ience s a e ei he lying o insane!"}