{"id": "17575", "subject": "Re: Same stupid nasty negative BS!", "author": "Fiona Broome", "timestamp": "2010-06-08T21:24:34Z", "full_text": "Hi,\n\nI&#39;m amazed when anyone claims they can&#39;t clearly hear the voices.  Okay, so far my only experience has been listening to Chris Moon&#39;s sessions in Canada, and the recordings posted here.\n\nWhat I hadn&#39;t expected were consistent voices.  Oh, I&#39;d heard some &quot;Shack Hack&quot; recordings with one word in a female voice, another word sung, a third word in a male voice, and so on.  That didn&#39;t impress me.\n\nMy experiences with Chris&#39; work startled me. Your recordings astonish and impress me.  \n\n(Not just yours, Frank, but many of the recordings posted to this list.  I&#39;ve been listening in my spare time, trying to wrap my brain around how well this works, and how I&#39;ve been totally missing the boat with this stuff, for years.)\n\nI&#39;m hearing consistent voices, consistent accents, consistent speech patterns.\n\nRegularly, I have to debate so-called authorities who want to be the best/only &quot;experts&quot; in the paranormal field. (That&#39;s one of the perils of appearing on panels at events.)\n\nSomeone else in the field aptly described the self-proclaimed authorities as a bunch of junkyard dogs fighting over a chewed-over bone.\n\nWell, maybe that&#39;s an insult to junkyard dogs, now that I think about it.\n\nMy point is: A whole lot of what I see at paranormal events is about status and politics.  I&#39;m not interested in that.  I&#39;m interested in results.\n\nResults are what I&#39;m seeing on this list.  That&#39;s what matters.\n\nKeep doing what you&#39;re doing. This is important.\n\nSincerely,\nFiona \n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  Got letter(e-mail) from a world renowned EVP authority( name withheld cuz I\n&gt; know the threats that would come), explaining how they tested the boxes and\n&gt; found nothing to it, y&#39;all just silly uninformed masses that don&#39;t know any\n&gt; better and they&#39;ll tell us all what&#39;s ok to hear and believe in! Thousands\n&gt; of box users and experiencers are either lying or insane!"}