{"id": "17580", "subject": "Re: [EVP-ITC] Same stupid nasty negative BS!", "author": "Frank Sumption", "timestamp": "2010-06-09T07:25:43Z", "full_text": "Well, that much was a bit of an exageration, the experts don&#39;t actually say\nghost don&#39;t cuss, it&#39;s just implied, asn they know better.\n\n It&#39;s like they don&#39;t have anything else&#39; I&#39;ve gotten the crap about\nunbiased listeners and somehow more qualified listeners, before. As sual,\ncompletely ignore all the users out there do hear this stuff, and do get\nverifiable information, time and again through EVP.\n----------------------------------------------------------------------------------------------------------------------\n\n\n&quot;We are pretty sure that, in transform EVP (ordinary recorder), the voice is\nformed in the electronics by transforming available audio-frequency noise in\nan active part of the electronics such as a transistor junction.&quot;\n\n--------------------------------------------------------------------------------------------------------------------------\n Same old skeptic BS, ignore all facts and test nothing. I&#39;ve said this\nseveral times that the sound is manipulated inside the electronics, same as\nthis bozo claims old style EVP is made. You don&#39;t need any external sound,\njust connect the recorder to the headphone jack and record, and you still\nget meaningful messages. Always, these dorks place limitation on spirit, as\nif spirit is just a deminished sub-human. Ignore the fact that people get\nimages via computer, TV, open air, messages on printers not even connected\nto a compter and telephones. Completely ignore EVPmaker, as the voices form\ncompletely inside the computer.\n\n Frank-S\n\nWell, ha much was a bi o an exage a ion, he expe s don' ac ually say ghos don' cuss, i 's jus implied, asn hey know be e . \n \n I 's like hey don' ha e any hing else' I' e go en he c ap abou unbiased lis ene s and somehow mo e quali ied lis ene s, be o e. As sual, comple ely igno e all he use s ou he e do hea his s u , and do ge e i iable in o ma ion, ime and again h ough EVP.\n\n----------------------------------------------------------------------------------------------------------------------\n \n\"We a e p e y su e ha , in ans o m EVP (o dina y eco de ), he oice is o med in he elec onics by ans o ming a ailable audio- equency noise in an ac i e pa o he elec onics such as a ansis o junc ion.\"\n\n \n-------------------------------------------------------------------------------------------------------------------------- \n Same old skep ic BS, igno e all ac s and es no hing. I' e said his se e al imes ha he sound is manipula ed inside he elec onics, same as his bozo claims old s yle EVP is made. You don' need any ex e nal sound, jus connec   he eco de o he headphone jack and eco d, and you s ill ge meaning ul messages. Always, hese do ks place limi a ion on spi i , as i spi i is jus a deminished sub-human. Igno e he ac ha people ge images ia compu e , TV, open ai , messages on p in e s no e en connec ed o a comp e and elephones. Comple ely igno e EVPmake , as he oices o m comple ely inside he compu e . \n\n \n F ank-S"}