{"id": "17586", "subject": "Re: Same stupid nasty negative BS!", "author": "Fiona Broome", "timestamp": "2010-06-09T14:35:42Z", "full_text": "Hi,\n\nI&#39;m not sure why we should give time or space in this forum to something like that.  After all, if their study is valid and published (or going to be), a link will be sufficient for those who are interested.\n\nI&#39;m not interested. Even the excerpt, which seemed to pull out all the big words to dismiss the &quot;science&quot; of this, was a snooze.\n\nI&#39;m also not here to dissect the debunkers and rabid skeptics. Really, what&#39;s the point?  No proof will be sufficient to meet their demands.  Let&#39;s just keep moving forward; momentum will serve us better than stopping to analyze the follies of others.\n\nI&#39;m here to learn about the results from work by Frank and others who are developing these devices.\n\nWhile it was disappointing to hear that a study didn&#39;t find merit in this approach to paranormal research and EVP, it was worth noting.\n\nHaving done so, I&#39;d be a lot happier with more information about the extreme experiments (the Ouija board idea tickled me) and where the &quot;what if...?&quot; questions lead people in this research.\n\nLet those with less originality pontificate the meaning and validity of all this. They may yet provide something useful to this field. Or perhaps they won&#39;t.  \n\nWhat matters is the research. When it pauses or stops, the entire community loses.\n\nSincerely,\nFiona\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, Rj &lt;rasterer@...&gt; wrote:\n&gt;\n&gt; I don&#39;t see them &quot;completely ignoring all the users out there do hear this stuff&quot;.  The fact that they did the study says in itself that they do recognize &quot;all the users out there do hear this stuff&quot;.  Those claims are WHY they seem to have done the study.\n&gt; \n&gt; And to do they study, they need a controlled environment, not just one where they grab  random anecdotes from &quot;all the users out there do hear this stuff&quot;.\n&gt; \n&gt; So I still look forward to the entire study.  Why not post it, so we can judge for ourselves what they got right and what they got wrong?\n&gt; \n&gt;"}