{"id": "17584", "subject": "Re: [EVP-ITC] Re: Same stupid nasty negative BS!", "author": "Rj", "timestamp": "2010-06-09T13:57:26Z", "full_text": "--0-835179397-1276091846=:49336\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nFrom what you&#39;ve posted so far, it sounds like an interesting effort, and I=\r\n look forward to reading the entire study.\n\nAlso, from what you posted, it =\r\ndid not say they didn&#39;t use double-blind testing. It says one of the reason=\r\ns they do not consider the current radio-sweep claims reliable, is that tho=\r\nse making those claims do not do double blind tests.=C2=A0 \n\nSo if you are =\r\ncalling BS and clueless those who are not doing double blind testing, that =\r\nbegs the question - are you?\n\n\n--- On Wed, 6/9/10, Frank Sumption &lt;purpleal=\r\niengirl@...&gt; wrote:\n\nFrom: Frank Sumption &lt;purplealiengirl@...&gt;=\r\n\nSubject: Re: [EVP-ITC] Re: Same stupid nasty negative BS!\nTo: EVP-ITC@yaho=\r\nogroups.com\nDate: Wednesday, June 9, 2010, 12:52 AM\n\n\n\n\n\n\n\n=C2=A0\n\n\n\n  \n\n\n =\r\n   \n      \n      \n      =C2=A0It&#39;s probably not kosher to post this, but I =\r\nfind this highly insulting to all of us. As usual, igonore all facts and al=\r\nl other methods, such as EVPmaker, which forms all the voices inside=C2=A0t=\r\nhe computer. Ignore all phone EVP messages, ignore all voices heard with no=\r\n electronic aids. Ignore messages received via turned off TV and printers--=\r\nand on and on, yet they know all about EVP..Ignore the fact that probably t=\r\nhousands use boxes successfully.\n\n=C2=A0\n&quot;We have conducted a few listening=\r\n studies of reported radio-sweep EVP and the results have not been good. We=\r\n have also worked with a variety of such devices. Based on what we know abo=\r\nut trans-etheric influences, how EVP and visual forms of ITC are formed and=\r\n what we know about mediumship, it is difficult to fit radio-sweep into any=\r\n established hypothesis. Without solid research supporting it as producing =\r\nEVP, it is impossible for us to recommend it or support its use. If there w=\r\nere double-blind studies conducted by experienced researchers that shows it=\r\n does produce phenomena, we would gladly promote it as an alternative techn=\r\nique.\n\n=C2=A0\nWe are pretty sure that, in transform EVP (ordinary recorder)=\r\n, the voice is formed in the electronics by transforming available audio-fr=\r\nequency noise in an active part of the electronics such as a transistor jun=\r\nction. We think the process is amplification of a weak telekinetic signal v=\r\nia stochastic resonance and we have found that the optimum audio-frequency =\r\nsignal for this is a chaotic one rich in voice-frequencies with many transi=\r\nent perturbation. That is our working hypothesis. &quot;\n\n=C2=A0\n=C2=A0I can&#39;t s=\r\nay who this is from, cuz almost certain I&#39;d get sued. There&#39;s no double bli=\r\nnd testing their BS either. Clueless!!\n=C2=A0\n=C2=A0F-S\n\n\nOn Wed, Jun 9, 20=\r\n10 at 1:24 AM, paracomm &lt;xxxsinxxxsinxxx@ yahoo.com&gt; wrote:\n\n\n=C2=A0 \n\n\n\nWh=\r\nen people start calling themselves experts at something that is not or may =\r\nnever be fully understood the crap gets deep. I love these so called expert=\r\ns that tell us that we can only make contact using their exact methods and =\r\nwe need to refrain from any other way of doing research because in their ey=\r\nes were just spinning our wheels. So we can&#39;t get communication from modifi=\r\ned radios and were all just hearing what we want I guess. I have heard it a=\r\nll,,&quot;I wrote a book and im an expert&quot; or &quot;believe me that wont work, I know=\r\n cause im physic&quot;=E2=80=A6.in one ear and out the other. Everyone is an exp=\r\nert these days and most of what they say is BS. If I start hearing someone =\r\nor something talking through my dogs butt guess what im recording it.\n\n\nSou=\r\nnds like these so called experts are just trying to deter and silence anyth=\r\ning they dont agree with by doing there Scientific tests. If it works it wo=\r\nrks and if it didnt work what the hell are we all still doing here. \n\n\n--- =\r\nIn EVP-ITC@yahoogroups .com, Frank Sumption &lt;purplealiengirl@ ...&gt; wrote:\n&gt;=\r\n\n\n\n\n&gt; Got letter(e-mail) from a world renowned EVP authority( name withheld=\r\n cuz I\n&gt; know the threats that would come), explaining how they tested the =\r\nboxes and\n&gt; found nothing to it, y&#39;all just silly uninformed masses that do=\r\nn&#39;t know any\n\n&gt; better and they&#39;ll tell us all what&#39;s ok to hear and believ=\r\ne in! Thousands\n&gt; of box users and experiencers are either lying or insane!=\r\n\n&gt; \n&gt; Pseudo scientific BS! Their testing reveals exactly what they expectt=\r\n, that\n\n&gt; is the nature of the paranormal. Getting the results they wanted,=\r\n they puff\n&gt; out their chests and proclaim yet another victory for science!=\r\n Science has\n&gt; a habit of supplying exactly the results wanted by whoever i=\r\ns paying for the\n\n&gt; tests..\n&gt; \n&gt; First, where do they find people that are =\r\nsomehow qualified listeners!? WTF\n&gt; is that S---!? It&#39;s BS, and they know i=\r\nt. Same old skeptic/science crap,\n&gt; except from a group that wants to be th=\r\ne worlds onlyest EVP authority.\n\n&gt; \n&gt; I&#39;m sure there will be articles in ma=\r\njor paranormal mags proclaiming how\n&gt; the experts thoroughly debunked the b=\r\noxes.\n&gt; \n&gt; They keep testing and getting nothing, and the rest of us keep r=\r\necording\n\n&gt; and have no shortage of voices that others can hear, can be val=\r\nidated, and\n&gt; gives infromation that&#39;s unknow to the listener. I just poste=\r\nd a video where\n&gt; a voice says &quot;I said fuck&quot; just to show it&#39;s not broadcas=\r\nt frags. This stuff\n\n&gt; conveniently ignored. I&#39;ve been kicked off groups fo=\r\nr getting voices thast\n&gt; somehow were judged not ghostly enough, cuz all th=\r\ne experts know ghosts\n&gt; can&#39;t cuss, they can barely even talk and communcat=\r\ne!\n\n&gt; \n&gt; They send me their stupid results thinking I&#39;m the one out there p=\r\nushing\n&gt; boxes. Ignorant dorks, it&#39;s the results pushing boxes!\n&gt; \n&gt; Frank-=\r\nS\n&gt;\n\n\n\n\n\n\n\n\n    \n     \n\n    \n    \n\n\n \n\n\n\n  \n\n\n\n\n\n\n      \r\n--0-835179397-1276091846=:49336\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;From what you&#39;ve posted so far, it sounds lik=\r\ne an interesting effort, and I look forward to reading the entire study.&lt;br=\r\n&gt;&lt;br&gt;Also, from what you posted, it did not say they didn&#39;t use double-blin=\r\nd testing. It says one of the reasons they do not consider the current radi=\r\no-sweep claims reliable, is that those making those claims do not do double=\r\n blind tests.&nbsp; &lt;br&gt;&lt;br&gt;So if you are calling BS and clueless those who=\r\n are not doing double blind testing, that begs the question - are you?&lt;br&gt;&lt;=\r\nbr&gt;&lt;br&gt;--- On &lt;b&gt;Wed, 6/9/10, Frank Sumption &lt;i&gt;&lt;purplealiengirl@gmail.c=\r\nom&gt;&lt;/i&gt;&lt;/b&gt; wrote:&lt;br&gt;&lt;blockquote style=3D&quot;border-left: 2px solid rgb(16=\r\n, 16, 255); margin-left: 5px; padding-left: 5px;&quot;&gt;&lt;br&gt;From: Frank Sumption =\r\n&lt;purplealiengirl@...&gt;&lt;br&gt;Subject: Re: [EVP-ITC] Re: Same stupid=\r\n nasty negative BS!&lt;br&gt;To: EVP-ITC@yahoogroups.com&lt;br&gt;Date: Wednesday, June=\r\n 9,\n 2010, 12:52 AM&lt;br&gt;&lt;br&gt;&lt;div id=3D&quot;yiv1463342548&quot;&gt;\n\n\n\n\n\n&lt;span style=3D&quot;d=\r\nisplay: none;&quot;&gt;&nbsp;&lt;/span&gt;\n\n\n\n    &lt;div id=3D&quot;ygrp-text&quot;&gt;\n      \n      \n  =\r\n    &lt;p&gt;&lt;/p&gt;&lt;div&gt;&nbsp;It&#39;s probably not kosher to post this, but I find thi=\r\ns highly insulting to all of us. As usual, igonore all facts and all other =\r\nmethods, such as EVPmaker, which forms all the voices inside&nbsp;the compu=\r\nter. Ignore all phone EVP messages, ignore all voices heard with no electro=\r\nnic aids. Ignore messages received via turned off TV and printers--and on a=\r\nnd on, yet they know all about EVP..Ignore the fact that probably thousands=\r\n use boxes successfully.&lt;/div&gt;\n\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&quot;We have conducted a=\r\n few listening studies of reported radio-sweep EVP and the results have not=\r\n been good. We have also worked with a variety of such devices. Based on wh=\r\nat we know about trans-etheric influences, how EVP and visual forms of ITC =\r\nare formed and what we know about mediumship, it is difficult to fit radio-=\r\nsweep into any established hypothesis. Without solid research supporting it=\r\n as producing EVP, it is impossible for us to recommend it or support its u=\r\nse. If there were double-blind studies conducted by experienced researchers=\r\n that shows it does produce phenomena, we would gladly promote it as an alt=\r\nernative technique.&lt;br&gt;\n&nbsp;&lt;br&gt;We are pretty sure that, in transform EVP=\r\n (ordinary recorder), the voice is formed in the electronics by transformin=\r\ng available audio-frequency noise in an active part of the electronics such=\r\n as a transistor junction. We think the process is amplification of a weak =\r\ntelekinetic signal via stochastic resonance and we have found that the opti=\r\nmum audio-frequency signal for this is a chaotic one rich in voice-frequenc=\r\nies with many transient perturbation. That is our working hypothesis. &quot;&lt;/di=\r\nv&gt;\n\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;I can&#39;t say who this is from, cuz almost c=\r\nertain I&#39;d get sued. There&#39;s no double blind testing their BS either. Cluel=\r\ness!!&lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;F-S&lt;br&gt;&lt;br&gt;&lt;/div&gt;\n&lt;div class=3D&quot;gm=\r\nail_quote&quot;&gt;On Wed, Jun 9, 2010 at 1:24 AM, paracomm &lt;span dir=3D&quot;ltr&quot;&gt;&lt;&lt;=\r\na rel=3D&quot;nofollow&quot; ymailto=3D&quot;mailto:xxxsinxxxsinxxx@...&quot; target=3D&quot;_=\r\nblank&quot; href=3D&quot;/mc/compose?to=3Dxxxsinxxxsinxxx@...&quot;&gt;xxxsinxxxsinxxx@=\r\n yahoo.com&lt;/a&gt;&gt;&lt;/span&gt; wrote:&lt;br&gt;\n&lt;blockquote style=3D&quot;border-left: 1px =\r\nsolid rgb(204, 204, 204);&quot; class=3D&quot;gmail_quote&quot;&gt;\n&lt;div style=3D&quot;background-=\r\ncolor: rgb(255, 255, 255);&quot;&gt;&lt;span&gt;&nbsp;&lt;/span&gt; \n&lt;div&gt;\n&lt;div&gt;\n&lt;div&gt;\n&lt;p&gt;When =\r\npeople start calling themselves experts at something that is not or may nev=\r\ner be fully understood the crap gets deep. I love these so called experts t=\r\nhat tell us that we can only make contact using their exact methods and we =\r\nneed to refrain from any other way of doing research because in their eyes =\r\nwere just spinning our wheels. So we can&#39;t get communication from modified =\r\nradios and were all just hearing what we want I guess. I have heard it all,=\r\n,&quot;I wrote a book and im an expert&quot; or &quot;believe me that wont work, I know ca=\r\nuse im physic&quot;=E2=80=A6.in one ear and out the other. Everyone is an expert=\r\n these days and most of what they say is BS. If I start hearing someone or =\r\nsomething talking through my dogs butt guess what im recording it.&lt;br&gt;\n&lt;br&gt;=\r\nSounds like these so called experts are just trying to deter and silence an=\r\nything they dont agree with by doing there Scientific tests. If it works it=\r\n works and if it didnt work what the hell are we all still doing here. \n&lt;/p=\r\n&gt;&lt;div&gt;&lt;br&gt;&lt;br&gt;--- In &lt;a rel=3D&quot;nofollow&quot; ymailto=3D&quot;mailto:EVP-ITC%40yahoog=\r\nroups.com&quot; target=3D&quot;_blank&quot; href=3D&quot;/mc/compose?to=3DEVP-ITC%40yahoogroups=\r\n.com&quot;&gt;EVP-ITC@yahoogroups .com&lt;/a&gt;, Frank Sumption &lt;purplealiengirl@ ...=\r\n&gt; wrote:&lt;br&gt;&gt;&lt;br&gt;&lt;/div&gt;\n&lt;div&gt;\n&lt;div&gt;&lt;/div&gt;\n&lt;div&gt;&gt; Got letter(e-mail=\r\n) from a world renowned EVP authority( name withheld cuz I&lt;br&gt;&gt; know the=\r\n threats that would come), explaining how they tested the boxes and&lt;br&gt;&gt;=\r\n found nothing to it, y&#39;all just silly uninformed masses that don&#39;t know an=\r\ny&lt;br&gt;\n&gt; better and they&#39;ll tell us all what&#39;s ok to hear and believe in!=\r\n Thousands&lt;br&gt;&gt; of box users and experiencers are either lying or insane=\r\n!&lt;br&gt;&gt; &lt;br&gt;&gt; Pseudo scientific BS! Their testing reveals exactly what=\r\n they expectt, that&lt;br&gt;\n&gt; is the nature of the paranormal. Getting the r=\r\nesults they wanted, they puff&lt;br&gt;&gt; out their chests and proclaim yet ano=\r\nther victory for science! Science has&lt;br&gt;&gt; a habit of supplying exactly =\r\nthe results wanted by whoever is paying for the&lt;br&gt;\n&gt; tests..&lt;br&gt;&gt; &lt;b=\r\nr&gt;&gt; First, where do they find people that are somehow qualified listener=\r\ns!? WTF&lt;br&gt;&gt; is that S---!? It&#39;s BS, and they know it. Same old skeptic/=\r\nscience crap,&lt;br&gt;&gt; except from a group that wants to be the worlds onlye=\r\nst EVP authority.&lt;br&gt;\n&gt; &lt;br&gt;&gt; I&#39;m sure there will be articles in majo=\r\nr paranormal mags proclaiming how&lt;br&gt;&gt; the experts thoroughly debunked t=\r\nhe boxes.&lt;br&gt;&gt; &lt;br&gt;&gt; They keep testing and getting nothing, and the r=\r\nest of us keep recording&lt;br&gt;\n&gt; and have no shortage of voices that other=\r\ns can hear, can be validated, and&lt;br&gt;&gt; gives infromation that&#39;s unknow t=\r\no the listener. I just posted a video where&lt;br&gt;&gt; a voice says &quot;I said fu=\r\nck&quot; just to show it&#39;s not broadcast frags. This stuff&lt;br&gt;\n&gt; conveniently=\r\n ignored. I&#39;ve been kicked off groups for getting voices thast&lt;br&gt;&gt; some=\r\nhow were judged not ghostly enough, cuz all the experts know ghosts&lt;br&gt;&gt;=\r\n can&#39;t cuss, they can barely even talk and communcate!&lt;br&gt;\n&gt; &lt;br&gt;&gt; Th=\r\ney send me their stupid results thinking I&#39;m the one out there pushing&lt;br&gt;&=\r\ngt; boxes. Ignorant dorks, it&#39;s the results pushing boxes!&lt;br&gt;&gt; &lt;br&gt;&gt;=\r\n Frank-S&lt;br&gt;&gt;&lt;br&gt;&lt;br&gt;&lt;/div&gt;&lt;/div&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;p&gt;&lt;/p&gt;&lt;/div&gt;\n&lt;div style=3D&quot;co=\r\nlor: rgb(255, 255, 255);&quot;&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/blockquote&gt;&lt;/div&gt;&lt;br&gt;\n\n=\r\n\n    &lt;/div&gt;\n     \n\n\n\n \n\n\n&lt;/div&gt;&lt;/blockquote&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n      \r\n--0-835179397-1276091846=:49336--"}