{"id": "17594", "subject": "Re: Alert,", "author": "tim_woolworth", "timestamp": "2010-06-09T20:41:28Z", "full_text": "I would be cautious accepting responses from a box as gospel.  I have had contradictory responses about religion come through, but then again, I align myself much closer with atheism than christianity.  \n\nMany times I feel that the boxes tell us what we want to hear.  Why? I could not tell you.  It could be spirits playing with our heads, or, it could be a piece of our unconscious coming through the radio.  This does happen, I have recorded the voices of people in the same room with me coming through with the same speech patterns (although this happened twice with a Shack hack but I haven&#39;t had it happen with my Minibox yet).  \n\nSo in short, if you ascribe to a belief and keep asking pointed questions about that belief over and over, do not be surprised when you hear what you believe coming through the box.\n\nTim\n\n--- In EVP-ITC@yahoogroups.com, SnowfireL@... wrote:\n&gt;\n&gt; gee, I&#39;ll be sure to make note of it, sf\n&gt;  \n&gt;  \n&gt; In a message dated 6/9/2010 1:31:09 P.M. Eastern Daylight Time,  \n&gt; shgiruss@... writes:\n&gt; \n&gt;  \n&gt;  \n&gt;  \n&gt; Snowfire, if i was dead (passed on) and was able to by  happenstance come \n&gt; across you and the evp device and you asked me the  question, what makes you \n&gt; think I know what I am talking about? Because I  would tell you that their \n&gt; is no antichrist, no devil, no anthropomorphic  hebrew savage god who \n&gt; commands his people to murder children and women  in one town and in the next town \n&gt; kill all but virgin girls (old  testament). \n&gt; \n&gt; I would say that there is only consciousness, not  confined to any man made \n&gt; religion.\n&gt; \n&gt; with love,\n&gt; Russ\n&gt; \n&gt; ---  On Tue, 6/8/10, SnowfireL@..., 6/8/10, S&lt;SnowfireL@...&gt; wrote:\n&gt; \n&gt; \n&gt; From:  SnowfireL@...&lt;SnowfireL@...&gt;\n&gt; Subject:  [EVP-ITC] Alert, [1 Attachment]\n&gt; To: RTSC@...: RTSC@yahoogroups.&lt;WBR&gt;com,  To: \n&gt; RTSC@yahoogroups.&lt;WBR&gt;com,  To: RTSC@yaTo: RTSC@yahoTo: RTSC@yahTo: RTSC@yahoogroups.&lt;WBR&gt;com, \n&gt;  To:\n&gt; Date: Tuesday, June 8, 2010, 12:54  PM\n&gt; \n&gt; \n&gt;  \n&gt; this one is very scary, I have not cleaned it up, I was asking  about the \n&gt; antichrist, and if he was released yet, and they are saying,  &quot;yes, he has \n&gt; been released, yes, he has, and that Christ is  coming.&quot;  Please, don&#39;t get \n&gt; left here, just believe in what  JC did, and don&#39;t be left behind, &quot;the \n&gt; teleport is going to be  instantaneous, &quot; we won&#39;t feel a thing, one minute you \n&gt; will be sitting  at a desk, next minute we will find our self in some grassy \n&gt; field is  what I was told.  I have more, I haven&#39;t cleaned them up yet, but  \n&gt; you can see how plain and clear they are from that newer RS that I  messed \n&gt; up the other day.  They are saying scary things on it,  they said, he is not \n&gt; the devil, that the antichrist is a &quot;spirit  energy&quot; &quot;worse then the devil,&quot; \n&gt; and will &quot;infect&quot; posess some person  after Obama.\n&gt;"}