{"id": "17603", "subject": "Re: Same stupid nasty negative BS!", "author": "tim_woolworth", "timestamp": "2010-06-09T22:04:19Z", "full_text": "April,\n\nI have received EVP&#39;s during ghost box sessions.  One thing that bugs me about doing sessions is that you can never be sure whether the clear communications received are EVP or box related.  It has been shown in studies that EVP&#39;s can be received in a vacuum so even recording a session with using the line out may capture EVP&#39;s (but probably is much less likely to do so).\n\nThis clip is from June 2009 at Rolling Hills Asylum.  I am sure that this is an EVP because it my recorder was set up about 12 feet from the shack hack and it was the only recorder from that session to pick up this audio.  This is a genuine Class A EVP, which is a rare thing.  \n\nWe were conducting a session and you can hear the cycle through ending and starting again.  We were just about to end the session and had just called for any last minute communications when this clip occurred. \n\nI use Google Chrome as a browser, so and it has problems with attachments.  According to Chrome, the link is here:\n\nhttp://tech.groups.yahoo.com/group/EVP-ITC/files/Tim%20Woolworth/Misc/TW_RH_Xmas_I&#39;m Here I&#39;m Here.mp3\n\nIf that doesn&#39;t work, here is the folder (the only clip in it):\n\nhttp://tech.groups.yahoo.com/group/EVP-ITC/files/Tim%20Woolworth/Misc/\n\nTim\n--- In EVP-ITC@yahoogroups.com, April Abercrombie &lt;april@...&gt; wrote:\n&gt;\n&gt; &quot;Listening to the box is certainly not like listening to an EVP and I\n&gt; personally disagree vehemently with the people out there who call box\n&gt; communications EVP&#39;s!&quot;\n&gt; \n&gt; I totally agree. Electronic Voice Phenomena is a completely different\n&gt; animal. That is not to say however that one couldn&#39;t get an EVP during a\n&gt; ghost box session.\n&gt; \n&gt; On Wed, Jun 9, 2010 at 3:04 PM, tim_woolworth &lt;tim@...&gt; wrote:\n&gt; \n&gt; &gt;\n&gt; &gt;\n&gt; &gt; So you have stated that the person conducting this study was an EVP expert?\n&gt; &gt; That leads me to question how the study was actually conducted. Listening to\n&gt; &gt; the box is certainly not like listening to an EVP and I personally disagree\n&gt; &gt; vehemently with the people out there who call box communications EVP&#39;s!\n&gt; &gt;\n&gt; &gt; In an EVP situation, you are listening closely for a voice to sound\n&gt; &gt; typically over the quiet. A box session forces one to listen through the\n&gt; &gt; noise as opposed to the silence.\n&gt; &gt;\n&gt; &gt; Were these sessions recorded and listened back too or was an analysis made\n&gt; &gt; strictly from real time? I do sessions all the time and I am lucky if I can\n&gt; &gt; pick up 35% of what comes through in real time.\n&gt; &gt;\n&gt; &gt; And finally, try not to be too dismayed. An EVP &#39;expert&#39; makes their bread\n&gt; &gt; and butter parading their EVP techniques. I witnessed one such expert who we\n&gt; &gt; all have at least heard of create an EVP. How? The person in question\n&gt; &gt; scratched their thumb nail against the recorders mic to create a sound. This\n&gt; &gt; person then played back the recorder to me and pitched it down to make what\n&gt; &gt; this person say what was heard sound more convincing.\n&gt; &gt;\n&gt; &gt; If I made my money parading my EVP ability, I would discredit your box too.\n&gt; &gt; Why? Because box users are the future of ITC and paranormal research. It is\n&gt; &gt; relatively cheap, vastly available, and provides instant gratuity when\n&gt; &gt; operating. Who wants to sit alone in the dark talking to silence when you\n&gt; &gt; can hear the responses in real time? EVP is still a valid form of\n&gt; &gt; communication, but ghost boxes threaten an EVP experts way to make money.\n&gt; &gt; Boxes are being used more and more, especially on the television shows and\n&gt; &gt; public hunts. This hurts the revenue stream for EVP experts who used to be\n&gt; &gt; the ones getting invited to guest star on hunts for a fee; they are now\n&gt; &gt; being replaced by box users.\n&gt; &gt;\n&gt; &gt; In short, box use can be discredited by every expert and skeptic in the\n&gt; &gt; field. It doesn&#39;t matter. Ghost box use now has its place in paranormal\n&gt; &gt; culture and it is not going to leave it anytime soon. Being situated in a\n&gt; &gt; paranormal group that is lead by a para-celebrity has put me in the unique\n&gt; &gt; position of visiting other groups and working with the other\n&gt; &gt; para-celebrities in this field quite frequently. I can assure you that ghost\n&gt; &gt; boxes aren&#39;t going anywhere because the majority of these people have at\n&gt; &gt; least a shack hack in their paranormal arsenal.\n&gt; &gt;\n&gt; &gt; So let this expert discredit to his or her&#39;s hearts&#39; content. When they\n&gt; &gt; publish their results, the results become public and they are on the hook\n&gt; &gt; for what they say at that point (which could bite them in the ass one day).\n&gt; &gt; Their results will not hurt the work that you are doing today Frank, nor\n&gt; &gt; will what they say influence this forums core group in any way because we\n&gt; &gt; know the boxes work.\n&gt; &gt;\n&gt; &gt; Tim\n&gt; &gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Frank Sumption\n&gt; &gt; &lt;purplealiengirl@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; It&#39;s probably not kosher to post this, but I find this highly insulting\n&gt; &gt; to\n&gt; &gt; &gt; all of us. As usual, igonore all facts and all other methods, such as\n&gt; &gt; &gt; EVPmaker, which forms all the voices inside the computer. Ignore all\n&gt; &gt; phone\n&gt; &gt; &gt; EVP messages, ignore all voices heard with no electronic aids. Ignore\n&gt; &gt; &gt; messages received via turned off TV and printers--and on and on, yet they\n&gt; &gt; &gt; know all about EVP..Ignore the fact that probably thousands use boxes\n&gt; &gt; &gt; successfully.\n&gt; &gt; &gt;\n&gt; &gt; &gt; &quot;We have conducted a few listening studies of reported radio-sweep EVP\n&gt; &gt; and\n&gt; &gt; &gt; the results have not been good. We have also worked with a variety of\n&gt; &gt; such\n&gt; &gt; &gt; devices. Based on what we know about trans-etheric influences, how EVP\n&gt; &gt; and\n&gt; &gt; &gt; visual forms of ITC are formed and what we know about mediumship, it is\n&gt; &gt; &gt; difficult to fit radio-sweep into any established hypothesis. Without\n&gt; &gt; solid\n&gt; &gt; &gt; research supporting it as producing EVP, it is impossible for us to\n&gt; &gt; &gt; recommend it or support its use. If there were double-blind studies\n&gt; &gt; &gt; conducted by experienced researchers that shows it does produce\n&gt; &gt; phenomena,\n&gt; &gt; &gt; we would gladly promote it as an alternative technique.\n&gt; &gt; &gt;\n&gt; &gt; &gt; We are pretty sure that, in transform EVP (ordinary recorder), the voice\n&gt; &gt; is\n&gt; &gt; &gt; formed in the electronics by transforming available audio-frequency noise\n&gt; &gt; in\n&gt; &gt; &gt; an active part of the electronics such as a transistor junction. We think\n&gt; &gt; &gt; the process is amplification of a weak telekinetic signal via stochastic\n&gt; &gt; &gt; resonance and we have found that the optimum audio-frequency signal for\n&gt; &gt; this\n&gt; &gt; &gt; is a chaotic one rich in voice-frequencies with many transient\n&gt; &gt; perturbation.\n&gt; &gt; &gt; That is our working hypothesis. &quot;\n&gt; &gt; &gt;\n&gt; &gt; &gt; I can&#39;t say who this is from, cuz almost certain I&#39;d get sued. There&#39;s no\n&gt; &gt; &gt; double blind testing their BS either. Clueless!!\n&gt; &gt; &gt;\n&gt; &gt; &gt; F-S\n&gt; &gt; &gt;\n&gt; &gt; &gt; On Wed, Jun 9, 2010 at 1:24 AM, paracomm &lt;xxxsinxxxsinxxx@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; When people start calling themselves experts at something that is not\n&gt; &gt; or\n&gt; &gt; &gt; &gt; may never be fully understood the crap gets deep. I love these so\n&gt; &gt; called\n&gt; &gt; &gt; &gt; experts that tell us that we can only make contact using their exact\n&gt; &gt; methods\n&gt; &gt; &gt; &gt; and we need to refrain from any other way of doing research because in\n&gt; &gt; their\n&gt; &gt; &gt; &gt; eyes were just spinning our wheels. So we can&#39;t get communication from\n&gt; &gt; &gt; &gt; modified radios and were all just hearing what we want I guess. I have\n&gt; &gt; heard\n&gt; &gt; &gt; &gt; it all,,&quot;I wrote a book and im an expert&quot; or &quot;believe me that wont\n&gt; &gt; work, I\n&gt; &gt; &gt; &gt; know cause im physic&quot;.in one ear and out the other. Everyone is an\n&gt; &gt; expert\n&gt; &gt; &gt; &gt; these days and most of what they say is BS. If I start hearing someone\n&gt; &gt; or\n&gt; &gt; &gt; &gt; something talking through my dogs butt guess what im recording it.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Sounds like these so called experts are just trying to deter and\n&gt; &gt; silence\n&gt; &gt; &gt; &gt; anything they dont agree with by doing there Scientific tests. If it\n&gt; &gt; works\n&gt; &gt; &gt; &gt; it works and if it didnt work what the hell are we all still doing\n&gt; &gt; here.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt; &lt;EVP-ITC%\n&gt; &gt; 40yahoogroups.com&gt;, Frank Sumption\n&gt; &gt; &gt; &gt; &lt;purplealiengirl@&gt; wrote:\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; Got letter(e-mail) from a world renowned EVP authority( name withheld\n&gt; &gt; &gt; &gt; cuz I\n&gt; &gt; &gt; &gt; &gt; know the threats that would come), explaining how they tested the\n&gt; &gt; boxes\n&gt; &gt; &gt; &gt; and\n&gt; &gt; &gt; &gt; &gt; found nothing to it, y&#39;all just silly uninformed masses that don&#39;t\n&gt; &gt; know\n&gt; &gt; &gt; &gt; any\n&gt; &gt; &gt; &gt; &gt; better and they&#39;ll tell us all what&#39;s ok to hear and believe in!\n&gt; &gt; &gt; &gt; Thousands\n&gt; &gt; &gt; &gt; &gt; of box users and experiencers are either lying or insane!\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; Pseudo scientific BS! Their testing reveals exactly what they\n&gt; &gt; expectt,\n&gt; &gt; &gt; &gt; that\n&gt; &gt; &gt; &gt; &gt; is the nature of the paranormal. Getting the results they wanted,\n&gt; &gt; they\n&gt; &gt; &gt; &gt; puff\n&gt; &gt; &gt; &gt; &gt; out their chests and proclaim yet another victory for science!\n&gt; &gt; Science\n&gt; &gt; &gt; &gt; has\n&gt; &gt; &gt; &gt; &gt; a habit of supplying exactly the results wanted by whoever is paying\n&gt; &gt; for\n&gt; &gt; &gt; &gt; the\n&gt; &gt; &gt; &gt; &gt; tests..\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; First, where do they find people that are somehow qualified\n&gt; &gt; listeners!?\n&gt; &gt; &gt; &gt; WTF\n&gt; &gt; &gt; &gt; &gt; is that S---!? It&#39;s BS, and they know it. Same old skeptic/science\n&gt; &gt; crap,\n&gt; &gt; &gt; &gt; &gt; except from a group that wants to be the worlds onlyest EVP\n&gt; &gt; authority.\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; I&#39;m sure there will be articles in major paranormal mags proclaiming\n&gt; &gt; how\n&gt; &gt; &gt; &gt; &gt; the experts thoroughly debunked the boxes.\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; They keep testing and getting nothing, and the rest of us keep\n&gt; &gt; recording\n&gt; &gt; &gt; &gt; &gt; and have no shortage of voices that others can hear, can be\n&gt; &gt; validated,\n&gt; &gt; &gt; &gt; and\n&gt; &gt; &gt; &gt; &gt; gives infromation that&#39;s unknow to the listener. I just posted a\n&gt; &gt; video\n&gt; &gt; &gt; &gt; where\n&gt; &gt; &gt; &gt; &gt; a voice says &quot;I said fuck&quot; just to show it&#39;s not broadcast frags.\n&gt; &gt; This\n&gt; &gt; &gt; &gt; stuff\n&gt; &gt; &gt; &gt; &gt; conveniently ignored. I&#39;ve been kicked off groups for getting voices\n&gt; &gt; &gt; &gt; thast\n&gt; &gt; &gt; &gt; &gt; somehow were judged not ghostly enough, cuz all the experts know\n&gt; &gt; ghosts\n&gt; &gt; &gt; &gt; &gt; can&#39;t cuss, they can barely even talk and communcate!\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; They send me their stupid results thinking I&#39;m the one out there\n&gt; &gt; pushing\n&gt; &gt; &gt; &gt; &gt; boxes. Ignorant dorks, it&#39;s the results pushing boxes!\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; Frank-S\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt; &gt;  \n&gt; &gt;\n&gt;"}