{"id": "17601", "subject": "Re: Alert,", "author": "tim_woolworth", "timestamp": "2010-06-09T21:42:37Z", "full_text": "I am by no means implying that you want to hear this kind of thing! \n\nBut, you are thinking about it at the time of your questioning.  Just that simple act alone may be influencing the outcome of the communication&#39;s results.  This is why I question the old trick of asking the box to tell you what is in your hand, because you already know!  I think that the unconscious mind has a lot to do with the communication we receive but I cannot tell you exactly why.\n\nTim\n\n--- In EVP-ITC@yahoogroups.com, SnowfireL@... wrote:\n&gt;\n&gt; What&#39;s makes you think I want to hear something like  this Tim?  I \n&gt; certainly do NOT want to hear this king of thing, I was asking  for verification \n&gt; from what I heard from someone else, SF\n&gt;  \n&gt;  \n&gt; In a message dated 6/9/2010 4:58:43 P.M. Eastern Daylight Time,  \n&gt; tim@... writes:\n&gt; \n&gt;  \n&gt;  \n&gt;  \n&gt; I would be cautious accepting responses from a box as gospel. I have had  \n&gt; contradictory responses about religion come through, but then again, I align  \n&gt; myself much closer with atheism than christianity. \n&gt; \n&gt; Many times I feel  that the boxes tell us what we want to hear. Why? I \n&gt; could not tell you. It  could be spirits playing with our heads, or, it could be \n&gt; a piece of our  unconscious coming through the radio. This does happen, I \n&gt; have recorded the  voices of people in the same room with me coming through \n&gt; with the same speech  patterns (although this happened twice with a Shack \n&gt; hack but I haven&#39;t had it  happen with my Minibox yet). \n&gt; \n&gt; So in short, if you ascribe to a belief  and keep asking pointed questions \n&gt; about that belief over and over, do not be  surprised when you hear what you \n&gt; believe coming through the  box.\n&gt; \n&gt; Tim\n&gt; \n&gt; --- In _EVP-ITC@yahoogroups.com_ (mailto:EVP-ITC@yahoogroups.com) ,  \n&gt; SnowfireL@ wrote:\n&gt; &gt;\n&gt; &gt; gee, I&#39;ll be sure to make note of it,  sf\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; In a message dated 6/9/2010 1:31:09 P.M. Eastern  Daylight Time, \n&gt; &gt; shgiruss@ writes:\n&gt; &gt; \n&gt; &gt; \n&gt; &gt;  \n&gt; &gt; \n&gt; &gt; Snowfire, if i was dead (passed on) and was able to by  happenstance come \n&gt; &gt; across you and the evp device and you asked me the  question, what makes \n&gt; you \n&gt; &gt; think I know what I am talking about?  Because I would tell you that \n&gt; their \n&gt; &gt; is no antichrist, no devil, no  anthropomorphic hebrew savage god who \n&gt; &gt; commands his people to murder  children and women in one town and in the \n&gt; next town \n&gt; &gt; kill all but  virgin girls (old testament). \n&gt; &gt; \n&gt; &gt; I would say that there is only  consciousness, not confined to any man \n&gt; made \n&gt; &gt; religion.\n&gt; &gt;  \n&gt; &gt; with love,\n&gt; &gt; Russ\n&gt; &gt; \n&gt; &gt; --- On Tue, 6/8/10,  SnowfireL@, 6/8/10, S&lt;SnowfireL@&gt; wrote:\n&gt; &gt; \n&gt; &gt; \n&gt; &gt;  From: SnowfireL@&lt;SnowfireL@&gt;\n&gt; &gt; Subject: [EVP-ITC] Alert, [1  Attachment]\n&gt; &gt; To: RTSC@: RTSC@yahoogroups.&lt;WBR&gt;com, To:  \n&gt; &gt; RTSC@yahoogroups.&lt;WBR&gt;com, To: RTSC@yaTo: RTSC@yahoTo:  RTSC@yahTo: \n&gt; RTSC@yahoogroups.&lt;WBR&gt;com, \n&gt; &gt; To:\n&gt; &gt; Date:  Tuesday, June 8, 2010, 12:54 PM\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; this one is  very scary, I have not cleaned it up, I was asking about the \n&gt; &gt;  antichrist, and if he was released yet, and they are saying, &quot;yes, he \n&gt; has  \n&gt; &gt; been released, yes, he has, and that Christ is coming.&quot; Please, don&#39;t  \n&gt; get \n&gt; &gt; left here, just believe in what JC did, and don&#39;t be left behind,  &quot;the \n&gt; &gt; teleport is going to be instantaneous, &quot; we won&#39;t feel a thing,  one \n&gt; minute you \n&gt; &gt; will be sitting at a desk, next minute we will find  our self in some \n&gt; grassy \n&gt; &gt; field is what I was told. I have more, I  haven&#39;t cleaned them up yet, \n&gt; but \n&gt; &gt; you can see how plain and clear they  are from that newer RS that I \n&gt; messed \n&gt; &gt; up the other day. They are  saying scary things on it, they said, he is \n&gt; not \n&gt; &gt; the devil, that the  antichrist is a &quot;spirit energy&quot; &quot;worse then the \n&gt; devil,&quot; \n&gt; &gt; and will  &quot;infect&quot; posess some person after Obama.\n&gt; &gt;\n&gt;"}