{"id": "17619", "subject": "Re: [EVP-ITC] Re: Same stupid nasty negative BS!", "author": "Frank Sumption", "timestamp": "2010-06-10T17:14:42Z", "full_text": "Thanks. It&#39;s not just the boxes, these &quot;rational thinkers&quot; want all free\nthinking to go away. That is what I find so infuriating. It&#39;s all this pure\nscience BS, how many thousands die every year from drugs tested by good\nscience, how many die every year being denied treatments that work because\nit goes against science. How long did cigarette companies rely on good\nscience to show smoking is good for you. You can get any result you pay for\nwith science. Science is nothing but dogma and egos--in this society.\n\n I could understand someone saying they tested to boxes and all they heard\nwas broadcast fragments, or gibberish, or a mix of the above along --with\nsome stuff that is not supposed to be there. But to just flat out claim they\nhear nothing!, what? are they frikkin&#39; deaf!? Two ways to hear nothing, put\nthe broken radio in a faraday cage, blocking all signals, or never turn the\nthing on! It&#39;s the ignore all facts and statements of live witnesses, stuff\nthat stands up in any court, and then claim they are somehow superior.\nThat&#39;s the freaking NAZIs, the darkside, pure evil!\n\n F-S\n\nOn Thu, Jun 10, 2010 at 7:07 AM, April Abercrombie &lt;\napril@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; You have nothing to worry about there Frank. There isn&#39;t anything anyone\n&gt; can do to make the boxes go away. Even if they somehow convinced everyone\n&gt; else that there isn&#39;t anything to the ghost boxes, would that matter to you?\n&gt; It certainly shouldn&#39;t.\n&gt;\n&gt;\n&gt; On Wed, Jun 9, 2010 at 9:46 PM, Frank Sumption &lt;purplealiengirl@...&gt;wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; No. It&#39;s the dorks that try to claim scientific testing to make something\n&gt;&gt; like the boxes go away, despite the fact the countless users get verifiable\n&gt;&gt; information almost daily through the box, and yet these crackheads\n&gt;&gt; deny-deny-deny!! Need I remind anyone how many times &quot;science&quot; has been\n&gt;&gt; wrong--over and over and over--it&#39;s a freaking useless discipline, all it\n&gt;&gt; does is build egos!\n&gt;&gt;\n&gt;&gt;  Frank-S\n&gt;&gt;\n&gt;&gt; On Wed, Jun 9, 2010 at 7:57 AM, Rj &lt;rasterer@yahoo.com&gt; wrote:\n&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;   From what you&#39;ve posted so far, it sounds like an interesting effort,\n&gt;&gt;&gt; and I look forward to reading the entire study.\n&gt;&gt;&gt;\n&gt;&gt;&gt; Also, from what you posted, it did not say they didn&#39;t use double-blind\n&gt;&gt;&gt; testing. It says one of the reasons they do not consider the current\n&gt;&gt;&gt; radio-sweep claims reliable, is that those making those claims do not do\n&gt;&gt;&gt; double blind tests.\n&gt;&gt;&gt;\n&gt;&gt;&gt; So if you are calling BS and clueless those who are not doing double\n&gt;&gt;&gt; blind testing, that begs the question - are you?\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt; --- On *Wed, 6/9/10, Frank Sumption &lt;purplealiengirl@...&gt;* wrote:\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt; From: Frank Sumption &lt;purplealiengirl@gmail.com&gt;\n&gt;&gt;&gt; Subject: Re: [EVP-ITC] Re: Same stupid nasty negative BS!\n&gt;&gt;&gt; To: EVP-ITC@yahoogroups.com\n&gt;&gt;&gt; Date: Wednesday, June 9, 2010, 12:52 AM\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;  It&#39;s probably not kosher to post this, but I find this highly insulting\n&gt;&gt;&gt; to all of us. As usual, igonore all facts and all other methods, such as\n&gt;&gt;&gt; EVPmaker, which forms all the voices inside the computer. Ignore all phone\n&gt;&gt;&gt; EVP messages, ignore all voices heard with no electronic aids. Ignore\n&gt;&gt;&gt; messages received via turned off TV and printers--and on and on, yet they\n&gt;&gt;&gt; know all about EVP..Ignore the fact that probably thousands use boxes\n&gt;&gt;&gt; successfully.\n&gt;&gt;&gt;\n&gt;&gt;&gt; &quot;We have conducted a few listening studies of reported radio-sweep EVP\n&gt;&gt;&gt; and the results have not been good. We have also worked with a variety of\n&gt;&gt;&gt; such devices. Based on what we know about trans-etheric influences, how EVP\n&gt;&gt;&gt; and visual forms of ITC are formed and what we know about mediumship, it is\n&gt;&gt;&gt; difficult to fit radio-sweep into any established hypothesis. Without solid\n&gt;&gt;&gt; research supporting it as producing EVP, it is impossible for us to\n&gt;&gt;&gt; recommend it or support its use. If there were double-blind studies\n&gt;&gt;&gt; conducted by experienced researchers that shows it does produce phenomena,\n&gt;&gt;&gt; we would gladly promote it as an alternative technique.\n&gt;&gt;&gt;\n&gt;&gt;&gt; We are pretty sure that, in transform EVP (ordinary recorder), the voice\n&gt;&gt;&gt; is formed in the electronics by transforming available audio-frequency noise\n&gt;&gt;&gt; in an active part of the electronics such as a transistor junction. We think\n&gt;&gt;&gt; the process is amplification of a weak telekinetic signal via stochastic\n&gt;&gt;&gt; resonance and we have found that the optimum audio-frequency signal for this\n&gt;&gt;&gt; is a chaotic one rich in voice-frequencies with many transient perturbation.\n&gt;&gt;&gt; That is our working hypothesis. &quot;\n&gt;&gt;&gt;\n&gt;&gt;&gt;  I can&#39;t say who this is from, cuz almost certain I&#39;d get sued. There&#39;s\n&gt;&gt;&gt; no double blind testing their BS either. Clueless!!\n&gt;&gt;&gt;\n&gt;&gt;&gt;  F-S\n&gt;&gt;&gt;\n&gt;&gt;&gt;  On Wed, Jun 9, 2010 at 1:24 AM, paracomm &lt;xxxsinxxxsinxxx@ yahoo.com&lt;http://mc/compose?to=xxxsinxxxsinxxx@...&gt;\n&gt;&gt;&gt; &gt; wrote:\n&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; When people start calling themselves experts at something that is not or\n&gt;&gt;&gt;&gt; may never be fully understood the crap gets deep. I love these so called\n&gt;&gt;&gt;&gt; experts that tell us that we can only make contact using their exact methods\n&gt;&gt;&gt;&gt; and we need to refrain from any other way of doing research because in their\n&gt;&gt;&gt;&gt; eyes were just spinning our wheels. So we can&#39;t get communication from\n&gt;&gt;&gt;&gt; modified radios and were all just hearing what we want I guess. I have heard\n&gt;&gt;&gt;&gt; it all,,&quot;I wrote a book and im an expert&quot; or &quot;believe me that wont work, I\n&gt;&gt;&gt;&gt; know cause im physic&quot;….in one ear and out the other. Everyone is an expert\n&gt;&gt;&gt;&gt; these days and most of what they say is BS. If I start hearing someone or\n&gt;&gt;&gt;&gt; something talking through my dogs butt guess what im recording it.\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; Sounds like these so called experts are just trying to deter and silence\n&gt;&gt;&gt;&gt; anything they dont agree with by doing there Scientific tests. If it works\n&gt;&gt;&gt;&gt; it works and if it didnt work what the hell are we all still doing here.\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; --- In EVP-ITC@yahoogroups .com&lt;http://mc/compose?to=EVP-ITC%40yahoogroups.com&gt;,\n&gt;&gt;&gt;&gt; Frank Sumption &lt;purplealiengirl@ ...&gt; wrote:\n&gt;&gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt;  &gt; Got letter(e-mail) from a world renowned EVP authority( name\n&gt;&gt;&gt;&gt; withheld cuz I\n&gt;&gt;&gt;&gt; &gt; know the threats that would come), explaining how they tested the\n&gt;&gt;&gt;&gt; boxes and\n&gt;&gt;&gt;&gt; &gt; found nothing to it, y&#39;all just silly uninformed masses that don&#39;t\n&gt;&gt;&gt;&gt; know any\n&gt;&gt;&gt;&gt; &gt; better and they&#39;ll tell us all what&#39;s ok to hear and believe in!\n&gt;&gt;&gt;&gt; Thousands\n&gt;&gt;&gt;&gt; &gt; of box users and experiencers are either lying or insane!\n&gt;&gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt; &gt; Pseudo scientific BS! Their testing reveals exactly what they expectt,\n&gt;&gt;&gt;&gt; that\n&gt;&gt;&gt;&gt; &gt; is the nature of the paranormal. Getting the results they wanted, they\n&gt;&gt;&gt;&gt; puff\n&gt;&gt;&gt;&gt; &gt; out their chests and proclaim yet another victory for science! Science\n&gt;&gt;&gt;&gt; has\n&gt;&gt;&gt;&gt; &gt; a habit of supplying exactly the results wanted by whoever is paying\n&gt;&gt;&gt;&gt; for the\n&gt;&gt;&gt;&gt; &gt; tests..\n&gt;&gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt; &gt; First, where do they find people that are somehow qualified\n&gt;&gt;&gt;&gt; listeners!? WTF\n&gt;&gt;&gt;&gt; &gt; is that S---!? It&#39;s BS, and they know it. Same old skeptic/science\n&gt;&gt;&gt;&gt; crap,\n&gt;&gt;&gt;&gt; &gt; except from a group that wants to be the worlds onlyest EVP authority.\n&gt;&gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt; &gt; I&#39;m sure there will be articles in major paranormal mags proclaiming\n&gt;&gt;&gt;&gt; how\n&gt;&gt;&gt;&gt; &gt; the experts thoroughly debunked the boxes.\n&gt;&gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt; &gt; They keep testing and getting nothing, and the rest of us keep\n&gt;&gt;&gt;&gt; recording\n&gt;&gt;&gt;&gt; &gt; and have no shortage of voices that others can hear, can be validated,\n&gt;&gt;&gt;&gt; and\n&gt;&gt;&gt;&gt; &gt; gives infromation that&#39;s unknow to the listener. I just posted a video\n&gt;&gt;&gt;&gt; where\n&gt;&gt;&gt;&gt; &gt; a voice says &quot;I said fuck&quot; just to show it&#39;s not broadcast frags. This\n&gt;&gt;&gt;&gt; stuff\n&gt;&gt;&gt;&gt; &gt; conveniently ignored. I&#39;ve been kicked off groups for getting voices\n&gt;&gt;&gt;&gt; thast\n&gt;&gt;&gt;&gt; &gt; somehow were judged not ghostly enough, cuz all the experts know\n&gt;&gt;&gt;&gt; ghosts\n&gt;&gt;&gt;&gt; &gt; can&#39;t cuss, they can barely even talk and communcate!\n&gt;&gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt; &gt; They send me their stupid results thinking I&#39;m the one out there\n&gt;&gt;&gt;&gt; pushing\n&gt;&gt;&gt;&gt; &gt; boxes. Ignorant dorks, it&#39;s the results pushing boxes!\n&gt;&gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt; &gt; Frank-S\n&gt;&gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;\n&gt;  \n&gt;\n\nThanks. I 's no jus he boxes, hese \" a ional hinke s\" wan all ee hinking o go away. Tha is wha I ind so in u ia ing. I 's all his pu e science BS, how many housands die e e y yea om d ugs es ed by good science, how many die e e y yea being denied ea men s ha wo k because i goes agains science. How long did ciga e e companies ely on good science o show smoking is good o you. You can ge any esul you pay o wi h science. Science is no hing bu dogma and egos--in his socie y. \n\n \n I could unde s and someone saying hey es ed o boxes and all hey hea d was b oadcas agmen s, o gibbe ish, o a mix o he abo e along --wi h some s u ha is no supposed o be he e. Bu o jus la ou claim hey hea no hing!, wha ? a e hey ikkin' dea !? Two ways o hea no hing, pu he b oken adio in a a aday cage, blocking all signals, o ne e u n he hing on! I 's he igno e all ac s and s a emen s o li e wi nesses, s u ha s ands up in any cou , and hen claim hey a e somehow supe io . Tha 's he eaking NAZIs, he da kside, pu e e il!\n\n \n F-S\nOn Thu, Jun 10, 2010 a 7:07 AM, Ap il Abe c ombie ap il@...> w o e:\n\n  \n\n\n\nYou ha e no hing o wo y abou he e F ank. The e isn' any hing anyone can do o make he boxes go away. E en i hey somehow con inced e e yone else ha he e isn' any hing o he ghos boxes, would ha ma e o you? I ce ainly shouldn' . \n\n\n\nOn Wed, Jun 9, 2010 a 9:46 PM, F ank Sump ion pu plealiengi l@gmail.com> w o e:\n\n  \n\n\n\n\nNo. I 's he do ks ha y o claim scien i ic es ing o make some hing like he boxes go away, despi e he ac he coun less use s ge e i iable in o ma ion almos daily h ough he box, and ye hese c ackheads deny-deny-deny!! Need I emind anyone how many imes \"science\" has been w ong--o e and o e and o e --i 's a eaking useless discipline, all i does is build egos! \n\n \n F ank-S\nOn Wed, Jun 9, 2010 a 7:57 AM, Rj as e e @yahoo.com> w o e:\n\n  \n\n\n\n\n\n\n\nF om wha you' e pos ed so a , i sounds like an in e es ing e o , and I look o wa d o eading he en i e s udy.Also, om wha you pos ed, i did no say hey didn' use double-blind es ing. I says one o he easons hey do no conside he cu en adio-sweep claims eliable, is ha hose making hose claims do no do double blind es s.  \nSo i you a e calling BS and clueless hose who a e no doing double blind es ing, ha begs he ques ion - a e you? \n--- On Wed, 6/9/10, F ank Sump ion pu plealiengi l@...> w o e:\n\nF om: F ank Sump ion pu plealiengi l@...>\nSubjec : Re: [EVP-ITC] Re: Same s upid nas y nega i e BS!\nTo: EVP-ITC@yahoog oups.comDa e: Wednesday, June 9, 2010, 12:52 AM \n\n\n\n  \n\n\n\n I 's p obably no koshe o pos his, bu I ind his highly insul ing o all o us. As usual, igono e all ac s and all o he me hods, such as EVPmake , which o ms all he oices inside  he compu e . Igno e all phone EVP messages, igno e all oices hea d wi h no elec onic aids. Igno e messages ecei ed ia u ned o TV and p in e s--and on and on, ye hey know all abou EVP..Igno e he ac ha p obably housands use boxes success ully.\n\n \n\"We ha e conduc ed a ew lis ening s udies o epo ed adio-sweep EVP and he esul s ha e no been good. We ha e also wo ked wi h a a ie y o such de ices. Based on wha we know abou ans-e he ic in luences, how EVP and isual o ms o ITC a e o med and wha we know abou mediumship, i is di icul o i adio-sweep in o any es ablished hypo hesis. Wi hou solid esea ch suppo ing i as p oducing EVP, i is impossible o us o ecommend i o suppo i s use. I he e we e double-blind s udies conduc ed by expe ienced esea che s ha shows i does p oduce phenomena, we would gladly p omo e i as an al e na i e echnique.\n We a e p e y su e ha , in ans o m EVP (o dina y eco de ), he oice is o med in he elec onics by ans o ming a ailable audio- equency noise in an ac i e pa o he elec onics such as a ansis o junc ion. We hink he p ocess is ampli ica ion o a weak elekine ic signal ia s ochas ic esonance and we ha e ound ha he op imum audio- equency signal o his is a chao ic one ich in oice- equencies wi h many ansien pe u ba ion. Tha is ou wo king hypo hesis. \"\n\n \n I can' say who his is om, cuz almos ce ain I'd ge sued. The e's no double blind es ing hei BS ei he . Clueless!!\n \n F-S\n\nOn Wed, Jun 9, 2010 a 1:24 AM, pa acomm xxxsinxxxsinxxx@ yahoo.com> w o e:\n\n  \n\n\n\n\nWhen people s a calling hemsel es expe s a some hing ha is no o may ne e be ully unde s ood he c ap ge s deep. I lo e hese so called expe s ha ell us ha we can only make con ac using hei exac me hods and we need o e ain om any o he way o doing esea ch because in hei eyes we e jus spinning ou wheels. So we can' ge communica ion om modi ied adios and we e all jus hea ing wha we wan I guess. I ha e hea d i all,,\"I w o e a book and im an expe \" o \"belie e me ha won wo k, I know cause im physic\"….in one ea and ou he o he . E e yone is an expe hese days and mos o wha hey say is BS. I I s a hea ing someone o some hing alking h ough my dogs bu guess wha im eco ding i .\nSounds like hese so called expe s a e jus ying o de e and silence any hing hey don ag ee wi h by doing he e Scien i ic es s. I i wo ks i wo ks and i i didn wo k wha he hell a e we all s ill doing he e. \n\n\n\n\n--- In EVP-ITC@yahoog oups .com, F ank Sump ion w o e:>\n\n\n> Go le e (e-mail) om a wo ld enowned EVP au ho i y( name wi hheld cuz I> know he h ea s ha would come), explaining how hey es ed he boxes and> ound no hing o i , y'all jus silly unin o med masses ha don' know any\n> be e and hey'll ell us all wha 's ok o hea and belie e in! Thousands> o box use s and expe ience s a e ei he lying o insane!> > Pseudo scien i ic BS! Thei es ing e eals exac ly wha hey expec , ha \n> is he na u e o he pa ano mal. Ge ing he esul s hey wan ed, hey pu > ou hei ches s and p oclaim ye ano he ic o y o science! Science has> a habi o supplying exac ly he esul s wan ed by whoe e is paying o he\n> es s..> > Fi s , whe e do hey ind people ha a e somehow quali ied lis ene s!? WTF> is ha S---!? I 's BS, and hey know i . Same old skep ic/science c ap,> excep om a g oup ha wan s o be he wo lds onlyes EVP au ho i y.\n> > I'm su e he e will be a icles in majo pa ano mal mags p oclaiming how> he expe s ho oughly debunked he boxes.> > They keep es ing and ge ing no hing, and he es o us keep eco ding\n> and ha e no sho age o oices ha o he s can hea , can be alida ed, and> gi es in oma ion ha 's unknow o he lis ene . I jus pos ed a ideo whe e> a oice says \"I said uck\" jus o show i 's no b oadcas ags. This s u \n> con enien ly igno ed. I' e been kicked o g oups o ge ing oices has > somehow we e judged no ghos ly enough, cuz all he expe s know ghos s> can' cuss, hey can ba ely e en alk and communca e!\n> > They send me hei s upid esul s hinking I'm he one ou he e pushing> boxes. Igno an do ks, i 's he esul s pushing boxes!> > F ank-S>"}