{"id": "17627", "subject": "Re: [EVP-ITC] Re: Some test videos from today", "author": "Frank Sumption", "timestamp": "2010-06-11T01:42:19Z", "full_text": "I think I need to spend more time listening. Thanks!\n\n F-S\n\nOn Thu, Jun 10, 2010 at 3:23 PM, tim_woolworth &lt;tim@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Frank,\n&gt;\n&gt; I listened closely to the clips and I found only one to contain continuous\n&gt; conversation between voices. I am continually amazed that you receive\n&gt; multiple voices in conversation. It never seems to be just one person\n&gt; speaking in your clips (from the ones I&#39;ve heard anyway).\n&gt;\n&gt; There are typically two or more voices in conversation with one another,\n&gt; which, as you know, should not be possible because of the rapid switching of\n&gt; frequencies. But yet, these voices carry over all the switching. That should\n&gt; be proof enough for people.\n&gt;\n&gt; By any chance do you know the amount of time your box stays on one\n&gt; frequency before switching? Is this time different between random and sweep?\n&gt;\n&gt; Anyway, to my ears, the best clip of these was the one labeled 0609101820.\n&gt; The voices in this clip were quite clear.\n&gt;\n&gt; @.01: Go Back (male)\n&gt; @.02: It&#39;s pretty cool (same male voice)\n&gt; @.04: Awesome (female)\n&gt; @.06: Hello (different female)\n&gt; @.08: Help me (electronic)\n&gt; @.09: Hi (same female as before)\n&gt; @.10: Help me Help me (same electronic)\n&gt; @.12: Help me (same electronic)\n&gt; @.13: Help me (same electronic)\n&gt; @.14: Help me (same electronic)\n&gt;\n&gt; Clip 0609102333 had few clear words to be analyzed:\n&gt;\n&gt; @.02: Hello (male)\n&gt; @.03: Who has (?pulled center?) (female)\n&gt; @.06: Whatever (same female)\n&gt;\n&gt; The 0609101257 clip (the one with the scope) was odd. There are vocal\n&gt; characteristics present such as pitch and timbre, there are times when it\n&gt; even sounds syllabled, but it does not sound like English to me. Could this\n&gt; be one of your ET clips?\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Frank Sumption\n&gt; &lt;purplealiengirl@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; The car tuner system, and then the wierd board I found last night.\n&gt; &gt;\n&gt; &gt; F-S\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nI hink I need o spend mo e ime lis ening. Thanks!\n \n F-S\nOn Thu, Jun 10, 2010 a 3:23 PM, im_woolwo h im@...> w o e:\n\n  \n\n\n\nF ank,I lis ened closely o he clips and I ound only one o con ain con inuous con e sa ion be ween oices. I am con inually amazed ha you ecei e mul iple oices in con e sa ion. I ne e seems o be jus one pe son speaking in you clips ( om he ones I' e hea d anyway). \nThe e a e ypically wo o mo e oices in con e sa ion wi h one ano he , which, as you know, should no be possible because o he apid swi ching o equencies. Bu ye , hese oices ca y o e all he swi ching. Tha should be p oo enough o people.\nBy any chance do you know he amoun o ime you box s ays on one equency be o e swi ching? Is his ime di e en be ween andom and sweep?Anyway, o my ea s, he bes clip o hese was he one labeled 0609101820. The oices in his clip we e qui e clea .\n@.01: Go Back (male)@.02: I 's p e y cool (same male oice)@.04: Awesome ( emale)@.06: Hello (di e en emale)@.08: Help me (elec onic)@.09: Hi (same emale as be o e)@.10: Help me Help me (same elec onic)\n@.12: Help me (same elec onic)@.13: Help me (same elec onic)@.14: Help me (same elec onic)Clip 0609102333 had ew clea wo ds o be analyzed:@.02: Hello (male)@.03: Who has (?pulled cen e ?) ( emale)\n@.06: Wha e e (same emale)The 0609101257 clip ( he one wi h he scope) was odd. The e a e ocal cha ac e is ics p esen such as pi ch and imb e, he e a e imes when i e en sounds syllabled, bu i does no sound like English o me. Could his be one o you ET clips? \n--- In EVP-ITC@yahoog oups.com, F ank Sump ion w o e:>\n> The ca une sys em, and hen he wie d boa d I ound las nigh .> > F-S>"}