{"id": "17628", "subject": "Re: [EVP-ITC] Re: Some test videos from today", "author": "Frank Sumption", "timestamp": "2010-06-11T01:48:06Z", "full_text": "Y&#39;all should hear when I&#39;m not recording, it&#39;s mind numbing! How&#39;s this for\na cloud face, almost looks like two empty eye sockets looking out from a\nhood.\n\n F-S\n\nOn Thu, Jun 10, 2010 at 3:48 PM, Michael Hobert E &lt;\nmessagebygabriel@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;  Well it could be multiple spirits or just one spirit using different\n&gt; fragments of speech making you think there are multiple entities.\n&gt;\n&gt; Or it could be multiple entities like in the movie Ghost when Whoopie\n&gt; Goldberg was doing a reading with Orlando&#39;s wife to get messages from\n&gt; Orlando, and she was surrounded by multiple entities talking at the same\n&gt; time.\n&gt;\n&gt; I do a lot of recordings for clients, and I have gotten multiple voices in\n&gt; just about every recording, and often times get lets say a five word\n&gt; sentence with each word a different sounding voice.\n&gt;\n&gt; First time clients expect to hear the voice of their loved one exactly as\n&gt; when they were alive, but that rarely occurs, and in truth almost never.\n&gt;\n&gt; When I record with my dad, I get male, female, young, old, animated, peter\n&gt; framption messages in music from him, and he talks in these many different\n&gt; voices about my family mentioning their first names in discussion.\n&gt;\n&gt; I still do not understand how those messages magically appear, or even if\n&gt; they are from one entity or many others having side conversations while I\n&gt; record with one deceased client.\n&gt;\n&gt; Heck the dead for all we know, while they talk to us, some guide could be\n&gt; typing what they said into a etherical machine that projects the words into\n&gt; the noise of the radio scanning for our recorders to pick up.\n&gt;\n&gt; Before I start a session, I always ask if there are other entities present\n&gt; that they please do not speak or even have a side conversation while they\n&gt; watch as their conversation can get picked up on my recorder in addition to\n&gt; the client entity I am recording with.\n&gt;\n&gt; I guess when I did, I will find the answer to that question.\n&gt;\n&gt; Michael Edwards\n&gt;\n&gt;\n&gt; http://tech.groups.yahoo.com/group/SDWR-SpeakingToTheDeadWithRadios-/\n&gt; http://groups.yahoo.com/group/EVPMessagesWithJesusChrist/\n&gt;\n&gt;\n&gt;  ------------------------------\n&gt; *From:* tim_woolworth &lt;tim@...&gt;\n&gt; *To:* EVP-ITC@yahoogroups.com\n&gt; *Sent:* Thu, June 10, 2010 5:23:52 PM\n&gt; *Subject:* [EVP-ITC] Re: Some test videos from today\n&gt;\n&gt;\n&gt;\n&gt; Frank,\n&gt;\n&gt; I listened closely to the clips and I found only one to contain continuous\n&gt; conversation between voices. I am continually amazed that you receive\n&gt; multiple voices in conversation. It never seems to be just one person\n&gt; speaking in your clips (from the ones I&#39;ve heard anyway).\n&gt;\n&gt; There are typically two or more voices in conversation with one another,\n&gt; which, as you know, should not be possible because of the rapid switching of\n&gt; frequencies. But yet, these voices carry over all the switching. That should\n&gt; be proof enough for people.\n&gt;\n&gt; By any chance do you know the amount of time your box stays on one\n&gt; frequency before switching? Is this time different between random and sweep?\n&gt;\n&gt; Anyway, to my ears, the best clip of these was the one labeled 0609101820.\n&gt; The voices in this clip were quite clear.\n&gt;\n&gt; @.01: Go Back (male)\n&gt; @.02: It&#39;s pretty cool (same male voice)\n&gt; @.04: Awesome (female)\n&gt; @.06: Hello (different female)\n&gt; @.08: Help me (electronic)\n&gt; @.09: Hi (same female as before)\n&gt; @.10: Help me Help me (same electronic)\n&gt; @.12: Help me (same electronic)\n&gt; @.13: Help me (same electronic)\n&gt; @.14: Help me (same electronic)\n&gt;\n&gt; Clip 0609102333 had few clear words to be analyzed:\n&gt;\n&gt; @.02: Hello (male)\n&gt; @.03: Who has (?pulled center?) (female)\n&gt; @.06: Whatever (same female)\n&gt;\n&gt; The 0609101257 clip (the one with the scope) was odd. There are vocal\n&gt; characteristics present such as pitch and timbre, there are times when it\n&gt; even sounds syllabled, but it does not sound like English to me. Could this\n&gt; be one of your ET clips?\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Frank Sumption\n&gt; &lt;purplealiengirl@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; The car tuner system, and then the wierd board I found last night.\n&gt; &gt;\n&gt; &gt; F-S\n&gt; &gt;\n&gt;\n&gt;\n&gt;  \n&gt;\n\nY'all should hea when I'm no eco ding, i 's mind numbing! How's his o a cloud ace, almos looks like wo emp y eye socke s looking ou om a hood.\n \n F-S\nOn Thu, Jun 10, 2010 a 3:48 PM, Michael Hobe E messagebygab iel@...> w o e:\n\n  \n\n\n\n\n\n\nWell i could be mul iple spi i s o jus one spi i using di e en agmen s o speech making you hink he e a e mul iple en i ies.\n \nO i could be mul iple en i ies like in he mo ie Ghos when Whoopie Goldbe g was doing a eading wi h O lando's wi e o ge messages om O lando, and she was su ounded by mul iple en i ies alking a he same ime.\n\n \nI do a lo o eco dings o clien s, and I ha e go en mul iple oices in jus abou e e y eco ding, and o en imes ge le s say a i e wo d sen ence wi h each wo d a di e en sounding oice.\n \nFi s ime clien s expec o hea he oice o hei lo ed one exac ly as when hey we e ali e, bu ha a ely occu s, and in u h almos ne e .\n \nWhen I eco d wi h my dad, I ge male, emale, young, old, anima ed, pe e amp ion messages in music om him, and he alks in hese many di e en oices abou my amily men ioning hei i s names in discussion. \n\n \nI s ill do no  unde s and how hose messages magically appea , o e en i hey a e om one en i y o many o he s ha ing side con e sa ions while I eco d wi h one deceased clien .\n \nHeck he dead o all we know, while hey alk o us, some guide could be yping wha hey said in o a e he ical machine ha p ojec s he wo ds in o he noise o he adio scanning o ou eco de s o pick up.\n\n \nBe o e I s a a session, I always ask i he e a e o he en i ies p esen ha hey please do no speak o e en ha e a side con e sa ion while hey wa ch as hei con e sa ion can ge picked up on my eco de in addi ion o he clien en i y I am eco ding wi h.\n\n \nI guess when I did, I will ind he answe o ha ques ion. Michael Edwa ds \n\nh p:// ech.g oups.yahoo.com/g oup/SDWR-SpeakingToTheDeadWi hRadios-/h p://g oups.yahoo.com/g oup/EVPMessagesWi hJesusCh is / \n\n\n\n\nF om: im_woolwo h im@i c oices.o g>To: EVP-ITC@yahoog oups.com\nSen : Thu, June 10, 2010 5:23:52 PMSubjec : [EVP-ITC] Re: Some es ideos om oday\n  \n\nF ank,I lis ened closely o he clips and I ound only one o con ain con inuous con e sa ion be ween oices. I am con inually amazed ha you ecei e mul iple oices in con e sa ion. I ne e seems o be jus one pe son speaking in you clips ( om he ones I' e hea d anyway). \nThe e a e ypically wo o mo e oices in con e sa ion wi h one ano he , which, as you know, should no be possible because o he apid swi ching o equencies. Bu ye , hese oices ca y o e all he swi ching. Tha should be p oo enough o people.\nBy any chance do you know he amoun o ime you box s ays on one equency be o e swi ching? Is his ime di e en be ween andom and sweep?Anyway, o my ea s, he bes clip o hese was he one labeled 0609101820. The oices in his clip we e qui e clea .\n@.01: Go Back (male)@.02: I 's p e y cool (same male oice)@.04: Awesome ( emale)@.06: Hello (di e en emale)@.08: Help me (elec onic)@.09: Hi (same emale as be o e)@.10: Help me Help me (same elec onic)\n@.12: Help me (same elec onic)@.13: Help me (same elec onic)@.14: Help me (same elec onic)Clip 0609102333 had ew clea wo ds o be analyzed:@.02: Hello (male)@.03: Who has (?pulled cen e ?) ( emale)\n@.06: Wha e e (same emale)The 0609101257 clip ( he one wi h he scope) was odd. The e a e ocal cha ac e is ics p esen such as pi ch and imb e, he e a e imes when i e en sounds syllabled, bu i does no sound like English o me. Could his be one o you ET clips?\n--- In EVP-ITC@yahoog oups.com, F ank Sump ion w o e:>> The ca une sys em, and hen he wie d boa d I ound las nigh .\n> > F-S>"}