{"id": "17626", "subject": "Re: Chris&#39;s Ghost Box 1  RS-12-589", "author": "Urkel23", "timestamp": "2010-06-11T01:18:11Z", "full_text": "Hard to get a perfect sweep, because it&#39;s constantly changing. A sweep may be\ngood here at say setting #6 with 30 stations. But your sweep may be better at\n#8 with only 20 stations. Not to mention atmospheric conditions and whether you\nare inside or outside.\n\nIf you think that would work well for you, just mark the spot with a dab of\nwhite out. If the condition changes, you can always scratch it right off.\n\n-Steve H.\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;messagebygabriel&quot; &lt;messagebygabriel@...&gt; wrote:\n&gt;\n&gt; This morning I did some minimal testing of Chris&#39;s Ghost Box 1 RS-12-589, and I must say I did get some good messages, that were so clear that I did not have to use Clear Voice at all on them. I actually tested it on a crime case.\n&gt; \n&gt; I think I am going to really like this radio, but still have much more testing to do before I start using it with my clients.\n&gt; \n&gt; I sent Chris a note as I am still trying to figure out what the toggle switch on top is for.\n&gt; \n&gt; Chris if you see this note, please tell me what that toggle switch is, and I have a suggestion for your next radio.\n&gt; \n&gt; Steve Hultay you may need what I suggest too.\n&gt; \n&gt; The silver dial that controls the speed of the scan, if you can add a circle label underneath that displays 1/8 line increments in a circular pattern, so we can turn the dial to each increment. What this will allow the user to do is mark the line increment that works best for recording.\n&gt; \n&gt; For me I need to be able to turn the device on and record for a client, and it will be hard for me to try and find that sweet spot every time I record.\n&gt; \n&gt; I am going to see if I can find or make a sticker to place under the dial.\n&gt; \n&gt; Again, so far I love it! Especially knowing I will likely not need to use Clear Voice or any other software to bring clarity.\n&gt; \n&gt; I will keep you informed.\n&gt; \n&gt; Michael Edwards  http://tech.groups.yahoo.com/group/SDWR-SpeakingToTheDeadWithRadios-/\n&gt;"}