{"id": "17631", "subject": "Re: [EVP-ITC] Re: Same stupid nasty negative BS!", "author": "Frank Sumption", "timestamp": "2010-06-11T02:04:14Z", "full_text": "Thanks, but these skeptic/science dorks ignore all evidence.\n\n F-S\n\nOn Thu, Jun 10, 2010 at 2:13 PM, &lt;SnowfireL@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; *You write these posts yet, I do not know your name, maybe i can ask\n&gt; someone in the box, and one of those kind spirit folks will give it to\n&gt; me....we do know they are speaking to us because often 2 or 3 people will\n&gt; hear the same thing, this is the reason we exchange our files, so that\n&gt; others may hear them too.  Last summer when the young lady tech student got\n&gt; killed, she was the young Chinese girl that was going to be married that\n&gt; week she just disappeared, it was the spirit people from the box that\n&gt; reported to me that she had been killed, the first day she came up as only\n&gt; missing, I called it in and the cop heard it, and hoped it was only people\n&gt; talking about it over the radio, he didn&#39;t understand, but the spirit gave\n&gt; the name of the guy that killed her, and where they would find her body, and\n&gt; sure enough it was all true.  If that was not test enough, I don&#39;t know what\n&gt; else, yes, I do have all those files intact here on my pc. Thank God, for\n&gt; Frank S. as it was he that first worked one the RS radio&#39;s and got this off\n&gt; the ground, he has a wonderful gift there, and no one can take it away. sf\n&gt; *\n&gt;\n&gt;\n&gt; -----Original Message-----\n&gt; From: Frank Sumption &lt;purplealiengirl@gmail.com&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Thu, Jun 10, 2010 3:08 am\n&gt; Subject: Re: [EVP-ITC] Re: Same stupid nasty negative BS!\n&gt;\n&gt;\n&gt;    It&#39;s the same old story, ignore all facts, ignore all users, deny deny\n&gt; deny!\n&gt;\n&gt;  Ahhh Dah! they address me by name!\n&gt;\n&gt;  And there ya go, it&#39;s all me, I&#39;m the bad guy, how dare I question sacred\n&gt; science. I&#39;m the one after a cult following-Don&#39;t look in a frikin&#39; mirror,\n&gt; never question your brainwashing! Presumptuous self righteous twit!\n&gt;\n&gt;  No, this BS will not continue here.\n&gt;\n&gt;  Frank-S\n&gt;\n&gt;  On Wed, Jun 9, 2010 at 11:33 PM, Lizzie Broden &lt;yahuli69@...&gt;wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;     &quot;Need I remind anyone how many times &quot;science&quot; has been wrong--over\n&gt;&gt; and over and over--it&#39;s a freaking useless discipline, all it does is build\n&gt;&gt; egos!&quot;\n&gt;&gt;\n&gt;&gt; Anybody see a problem with this line of thinking?  Anybody see the pure\n&gt;&gt; insanity of that said as a factual statement?  Modern Medicine? LOL  Ummmmmm\n&gt;&gt; basic Physics?  It would be insane, more than that, asinine to say that\n&gt;&gt; Science has never helped mankind or is a worthless endeavor.  &lt;&lt;&lt;&lt;&lt;&lt; Wasted\n&gt;&gt; space even having to write the words out.  It is unquestionable, on the\n&gt;&gt; whole.\n&gt;&gt;\n&gt;&gt; I have seen several bright minds ask for more information.  Studies that\n&gt;&gt; are quoted from and &quot;EVP Experts&quot;  Yet I am seeing that information slow to\n&gt;&gt; come forth.\n&gt;&gt;\n&gt;&gt; You are very correct.  Science has been wrong many times before.  But, it\n&gt;&gt; is always self correcting.  Not because of ego, but because of the very\n&gt;&gt; reason you are mad at it.  It is an unrelenting, cold-hearted swamp bitch!\n&gt;&gt; LOL   Science is not a thing that cares about what you want or think you\n&gt;&gt; hear.  It cares about verifiable, commendable and repeatable evidence.\n&gt;&gt;\n&gt;&gt; The problem you are having, well other than not getting the Theorize shots\n&gt;&gt; on time LOL  Might be, the about lack of logic in the theory to begin with.\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; What you are doing is going from point (A) to point (C)  And never taking\n&gt;&gt; a real hard look at point (B)  Now, you are an electrician guy.  You of all\n&gt;&gt; people understand the idea of circuits and connections and flow.  The same\n&gt;&gt; thing works in Logic and Science.\n&gt;&gt;\n&gt;&gt; POINT (A)  I am taking a constantly scaning radio and getting voices.\n&gt;&gt;\n&gt;&gt; POINT (C)  They are talking to me and making sense.  They are telling me\n&gt;&gt; all kinds of information that no one could ever know, at least as I perceive\n&gt;&gt; it.\n&gt;&gt;\n&gt;&gt; Now here is the real kicker!\n&gt;&gt;\n&gt;&gt; POINT (B)  Yeah this is the hard one.  How do you know they are taking to\n&gt;&gt; you?  You do understand the nature of the human mind and how it works?  Do\n&gt;&gt; you understand that this information is nothing new and it dates back to the\n&gt;&gt; year 1956? (I am thinking)\n&gt;&gt;\n&gt;&gt; How do you get past point (B)?  Do you except it on faith?  That is a\n&gt;&gt; Religion.  Can we study it as a Science?\n&gt;&gt;\n&gt;&gt; And if we come to our own conclusions about things are we not all heretics\n&gt;&gt; in the school of &quot;Frank&quot;  Maybe the word &quot;Church&quot; would be better LOL\n&gt;&gt;\n&gt;&gt; Get me past point (B) and I will lead the charge against the ignorant\n&gt;&gt; Scientific / Skeptic assholes out to get FRANK.\n&gt;&gt;\n&gt;&gt; Till then, there are problems with logic.\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; &quot;Nature is showing us only the tail of the lion, but I have no doubt that\n&gt;&gt; the lion belongs to it even though, because of its large size, it cannot\n&gt;&gt; totally reveal itself all at once.&quot;\n&gt;&gt; -— Albert Einstein\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; &quot;It is far better to grasp the universe as it really is than to persist in\n&gt;&gt; delusions, however satisfying and reassuring.&quot;\n&gt;&gt; --Carl Sagan\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;   &quot;There is no such thing as an insignificant detail. Don&#39;t just look\n&gt;&gt; for what you want to find.&quot;\n&gt;&gt; -- Me LOL\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;   ------------------------------\n&gt;&gt; *From:* Frank Sumption &lt;purplealiengirl@...&gt;\n&gt;&gt; *To:* EVP-ITC@yahoogroups.com\n&gt;&gt; *Sent:* Wed, June 9, 2010 10:46:41 PM\n&gt;&gt;\n&gt;&gt; *Subject:* Re: [EVP-ITC] Re: Same stupid nasty negative BS!\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;   No. It&#39;s the dorks that try to claim scientific testing to make\n&gt;&gt; something like the boxes go away, despite the fact the countless users get\n&gt;&gt; verifiable information almost daily through the box, and yet these\n&gt;&gt; crackheads deny-deny-deny! ! Need I remind anyone how many times &quot;science&quot;\n&gt;&gt; has been wrong--over and over and over--it&#39;s a freaking useless discipline,\n&gt;&gt; all it does is build egos!\n&gt;&gt;\n&gt;&gt;  Frank-S\n&gt;&gt;\n&gt;&gt;   On Wed, Jun 9, 2010 at 7:57 AM, Rj &lt;rasterer@yahoo. com&lt;rasterer@...&gt;\n&gt;&gt; &gt; wrote:\n&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;      From what you&#39;ve posted so far, it sounds like an interesting\n&gt;&gt;&gt; effort, and I look forward to reading the entire study.\n&gt;&gt;&gt;\n&gt;&gt;&gt; Also, from what you posted, it did not say they didn&#39;t use double-blind\n&gt;&gt;&gt; testing. It says one of the reasons they do not consider the current\n&gt;&gt;&gt; radio-sweep claims reliable, is that those making those claims do not do\n&gt;&gt;&gt; double blind tests.\n&gt;&gt;&gt;\n&gt;&gt;&gt; So if you are calling BS and clueless those who are not doing double\n&gt;&gt;&gt; blind testing, that begs the question - are you?\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt; --- On *Wed, 6/9/10, Frank Sumption &lt;purplealiengirl@ gmail.com&lt;purplealiengirl@...&gt;\n&gt;&gt;&gt; &gt;* wrote:\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt; From: Frank Sumption &lt;purplealiengirl@ gmail.com&lt;purplealiengirl@...&gt;\n&gt;&gt;&gt; &gt;\n&gt;&gt;&gt; Subject: Re: [EVP-ITC] Re: Same stupid nasty negative BS!\n&gt;&gt;&gt; To: EVP-ITC@yahoogroups .com &lt;EVP-ITC@yahoogroups.com&gt;\n&gt;&gt;&gt; Date: Wednesday, June 9, 2010, 12:52 AM\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;   It&#39;s probably not kosher to post this, but I find this highly\n&gt;&gt;&gt; insulting to all of us. As usual, ignore all facts and all other methods,\n&gt;&gt;&gt; such as EVPmaker, which forms all the voices inside the computer. Ignore all\n&gt;&gt;&gt; phone EVP messages, ignore all voices heard with no electronic aids. Ignore\n&gt;&gt;&gt; messages received via turned off TV and printers--and on and on, yet they\n&gt;&gt;&gt; know all about EVP..Ignore the fact that probably thousands use boxes\n&gt;&gt;&gt; successfully.\n&gt;&gt;&gt;\n&gt;&gt;&gt; &quot;We have conducted a few listening studies of reported radio-sweep EVP\n&gt;&gt;&gt; and the results have not been good. We have also worked with a variety of\n&gt;&gt;&gt; such devices. Based on what we know about trans-etheric influences, how EVP\n&gt;&gt;&gt; and visual forms of ITC are formed and what we know about mediumship, it is\n&gt;&gt;&gt; difficult to fit radio-sweep into any established hypothesis. Without solid\n&gt;&gt;&gt; research supporting it as producing EVP, it is impossible for us to\n&gt;&gt;&gt; recommend it or support its use. If there were double-blind studies\n&gt;&gt;&gt; conducted by experienced researchers that shows it does produce phenomena,\n&gt;&gt;&gt; we would gladly promote it as an alternative technique.\n&gt;&gt;&gt;\n&gt;&gt;&gt; We are pretty sure that, in transform EVP (ordinary recorder), the voice\n&gt;&gt;&gt; is formed in the electronics by transforming available audio-frequency noise\n&gt;&gt;&gt; in an active part of the electronics such as a transistor junction. We think\n&gt;&gt;&gt; the process is amplification of a weak telekinetic signal via stochastic\n&gt;&gt;&gt; resonance and we have found that the optimum audio-frequency signal for this\n&gt;&gt;&gt; is a chaotic one rich in voice-frequencies with many transient perturbation.\n&gt;&gt;&gt; That is our working hypothesis. &quot;\n&gt;&gt;&gt;\n&gt;&gt;&gt;  I can&#39;t say who this is from, cuz almost certain I&#39;d get sued. There&#39;s\n&gt;&gt;&gt; no double blind testing their BS either. Clueless!!\n&gt;&gt;&gt;\n&gt;&gt;&gt;  F-S\n&gt;&gt;&gt;\n&gt;&gt;&gt;  On Wed, Jun 9, 2010 at 1:24 AM, paracomm &lt;xxxsinxxxsinxxx@ yahoo.com&lt;http://mc/compose?to=xxxsinxxxsinxxx@...&gt;\n&gt;&gt;&gt; &gt; wrote:\n&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;   When people start calling themselves experts at something that is not\n&gt;&gt;&gt;&gt; or may never be fully understood the crap gets deep. I love these so called\n&gt;&gt;&gt;&gt; experts that tell us that we can only make contact using their exact methods\n&gt;&gt;&gt;&gt; and we need to refrain from any other way of doing research because in their\n&gt;&gt;&gt;&gt; eyes were just spinning our wheels. So we can&#39;t get communication from\n&gt;&gt;&gt;&gt; modified radios and were all just hearing what we want I guess. I have heard\n&gt;&gt;&gt;&gt; it all,,&quot;I wrote a book and im an expert&quot; or &quot;believe me that wont work, I\n&gt;&gt;&gt;&gt; know cause im physic&quot;….in one ear and out the other. Everyone is an expert\n&gt;&gt;&gt;&gt; these days and most of what they say is BS. If I start hearing someone or\n&gt;&gt;&gt;&gt; something talking through my dogs butt guess what im recording it.\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; Sounds like these so called experts are just trying to deter and silence\n&gt;&gt;&gt;&gt; anything they don&#39;t agree with by doing there Scientific tests. If it works\n&gt;&gt;&gt;&gt; it works and if it didnt work what the hell are we all still doing here.\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; --- In EVP-ITC@yahoogroups .com&lt;http://mc/compose?to=EVP-ITC%40yahoogroups.com&gt;,\n&gt;&gt;&gt;&gt; Frank Sumption &lt;purplealiengirl@ ...&gt; wrote:\n&gt;&gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt;   &gt; Got letter(e-mail) from a world renowned EVP authority( name\n&gt;&gt;&gt;&gt; withheld cuz I\n&gt;&gt;&gt;&gt; &gt; know the threats that would come), explaining how they tested the\n&gt;&gt;&gt;&gt; boxes and\n&gt;&gt;&gt;&gt; &gt; found nothing to it, y&#39;all just silly uninformed masses that don&#39;t\n&gt;&gt;&gt;&gt; know any\n&gt;&gt;&gt;&gt; &gt; better and they&#39;ll tell us all what&#39;s ok to hear and believe in!\n&gt;&gt;&gt;&gt; Thousands\n&gt;&gt;&gt;&gt; &gt; of box users and experiences are either lying or insane!\n&gt;&gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt; &gt; Pseudo scientific BS! Their testing reveals exactly what they expect,\n&gt;&gt;&gt;&gt; that\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; &gt; is the nature of the paranormal. Getting the results they wanted, they\n&gt;&gt;&gt;&gt; puff\n&gt;&gt;&gt;&gt; &gt; out their chests and proclaim yet another victory for science! Science\n&gt;&gt;&gt;&gt; has\n&gt;&gt;&gt;&gt; &gt; a habit of supplying exactly the results wanted by whoever is paying\n&gt;&gt;&gt;&gt; for the\n&gt;&gt;&gt;&gt; &gt; tests..\n&gt;&gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt; &gt; First, where do they find people that are somehow qualified\n&gt;&gt;&gt;&gt; listeners!? WTF\n&gt;&gt;&gt;&gt; &gt; is that S---!? It&#39;s BS, and they know it. Same old skeptic/science\n&gt;&gt;&gt;&gt; crap,\n&gt;&gt;&gt;&gt; &gt; except from a group that wants to be the worlds only est EVP\n&gt;&gt;&gt;&gt; authority.\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt; &gt; I&#39;m sure there will be articles in major paranormal mags proclaiming\n&gt;&gt;&gt;&gt; how\n&gt;&gt;&gt;&gt; &gt; the experts thoroughly debunked the boxes.\n&gt;&gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt; &gt; They keep testing and getting nothing, and the rest of us keep\n&gt;&gt;&gt;&gt; recording\n&gt;&gt;&gt;&gt; &gt; and have no shortage of voices that others can hear, can be validated,\n&gt;&gt;&gt;&gt; and\n&gt;&gt;&gt;&gt; &gt; gives information that&#39;s unknow to the listener. I just posted a video\n&gt;&gt;&gt;&gt; where\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; &gt; a voice says &quot;I said fuck&quot; just to show it&#39;s not broadcast frags. This\n&gt;&gt;&gt;&gt; stuff\n&gt;&gt;&gt;&gt; &gt; conveniently ignored. I&#39;ve been kicked off groups for getting voices\n&gt;&gt;&gt;&gt; that\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; &gt; somehow were judged not ghostly enough, cuz all the experts know\n&gt;&gt;&gt;&gt; ghosts\n&gt;&gt;&gt;&gt; &gt; can&#39;t cuss, they can barely even talk and communicate!\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt; &gt; They send me their stupid results thinking I&#39;m the one out there\n&gt;&gt;&gt;&gt; pushing\n&gt;&gt;&gt;&gt; &gt; boxes. Ignorant dorks, it&#39;s the results pushing boxes!\n&gt;&gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt; &gt; Frank-S\n&gt;&gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;   \n&gt;\n\nThanks, bu hese skep ic/science do ks igno e all e idence.  \n \n F-S\nOn Thu, Jun 10, 2010 a 2:13 PM, Snow i eL@...> w o e:\n\n  \n\n\n\n\nYou w i e hese pos s ye , I do no know you name, maybe i can ask someone in he box, and one o hose kind spi i olks will gi e i o me....we do know hey a e speaking o us because o en 2 o 3 people will hea he same hing, his is he eason we exchange ou iles, so ha o he s may hea hem oo.  Las summe when he young lady ech s uden go killed, she was he young Chinese gi l ha was going o be ma ied ha week she jus disappea ed, i was he spi i people om he box ha epo ed o me ha she had been killed, he i s day she came up as only missing, I called i in and he cop hea d i , and hoped i was only people alking abou i o e he adio, he didn' unde s and, bu he spi i ga e he name o he guy ha killed he , and whe e hey would ind he body, and su e enough i was all ue.  I ha was no es enough, I don' know wha else, yes, I do ha e all hose iles in ac he e on my pc. Thank God, o F ank S. as i was he ha i s wo ked one he RS adio's and go his o he g ound, he has a wonde ul gi he e, and no one can ake i away. s \n\n\n\n-----O iginal Message-----F om: F ank Sump ion pu plealiengi l@...>To: EVP-ITC@yahoog oups.com\n\nSen : Thu, Jun 10, 2010 3:08 amSubjec : Re: [EVP-ITC] Re: Same s upid nas y nega i e BS!\n\n  \n\n\n\n\n\n I 's he same old s o y, igno e all ac s, igno e all use s, deny deny deny!\n \n Ahhh Dah! hey add ess me by name!\n \n And he e ya go, i 's all me, I'm he bad guy, how da e I ques ion sac ed science. I'm he one a e a cul ollowing-Don' look in a ikin' mi o , ne e ques ion you b ainwashing! P esump uous sel igh eous wi ! \n\n \n No, his BS will no con inue he e.\n \n F ank-S\n\nOn Wed, Jun 9, 2010 a 11:33 PM, Lizzie B oden yahuli69@...> w o e:\n\n  \n\n\n\n\n\n\n\n\n\"Need I emind anyone how many imes \"science\" has been w ong--o e and o e and o e --i 's a eaking useless discipline, all i does is build egos!\"\n \nAnybody see a p oblem wi h his line o hinking?  Anybody see he pu e insani y o ha said as a ac ual s a emen ?  Mode n Medicine? LOL  Ummmmmm basic Physics?  I would be insane, mo e han ha , asinine o say ha Science has ne e helped mankind o is a wo hless endea o .  \n\n \nI ha e seen se e al b igh minds ask o mo e in o ma ion.  S udies ha a e quo ed om and \"EVP Expe s\"  Ye I am seeing ha in o ma ion slow o come o h.\n \nYou a e e y co ec .  Science has been w ong many imes be o e.  Bu , i is always sel co ec ing.  No because o ego, bu because o he e y eason you a e mad a i .  I is an un elen ing, cold-hea ed swamp bi ch! LOL   Science is no a hing ha ca es abou wha you wan o hink you hea .  I ca es abou e i iable, commendable and epea able e idence.\n\n \nThe p oblem you a e ha ing, well o he han no ge ing he Theo ize sho s on ime LOL  Migh be, he abou lack o logic in he heo y o begin wi h.  \n\n\n\n \nWha you a e doing is going om poin (A) o poin (C)  And ne e aking a eal ha d look a poin (B)  Now, you a e an elec ician guy.  You o all people unde s and he idea o ci cui s and connec ions and low.  The same hing wo ks in Logic and Science.\n\n \nPOINT (A)  I am aking a cons an ly scaning adio and ge ing oices.\n \nPOINT (C)  They a e alking o me and making sense.  They a e elling me all kinds o in o ma ion ha no one could e e know, a leas as I pe cei e i .\n \nNow he e is he eal kicke !\n \nPOINT (B)  Yeah his is he ha d one.  How do you know hey a e aking o you?  You do unde s and he na u e o he human mind and how i wo ks?  Do you unde s and ha his in o ma ion is no hing new and i da es back o he yea 1956? (I am hinking)  \n\n \nHow do you ge pas poin (B)?  Do you excep i on ai h?  Tha is a Religion.  Can we s udy i as a Science?  \n \nAnd i we come o ou own conclusions abou hings a e we no all he e ics in he school o \"F ank\"  Maybe he wo d \"Chu ch\" would be be e LOL\n \nGe me pas poin (B) and I will lead he cha ge agains he igno an Scien i ic / Skep ic assholes ou o ge FRANK.\n \nTill hen, he e a e p oblems wi h logic.\n \"Na u e is showing us only he ail o he lion, bu I ha e no doub ha he lion belongs o i e en hough, because o i s la ge size, i canno o ally e eal i sel all a once.\" -— Albe Eins ein \n\n\"I is a be e o g asp he uni e se as i eally is han o pe sis in delusions, howe e sa is ying and eassu ing.\"--Ca l Sagan\n\n\n\n\"The e is no such hing as an insigni ican de ail. Don' jus look o wha you wan o ind.\"-- Me LOL \n\n\n\n\n\n\n\n\nF om: F ank Sump ion pu plealiengi l@...>\nTo: EVP-ITC@yahoog oups.comSen : Wed, June 9, 2010 10:46:41 PM \n\n\nSubjec : Re: [EVP-ITC] Re: Same s upid nas y nega i e BS!\n\n\n  \n\n\n\n\n\nNo. I 's he do ks ha y o claim scien i ic es ing o make some hing like he boxes go away, despi e he ac he coun less use s ge e i iable in o ma ion almos daily h ough he box, and ye hese c ackheads deny-deny-deny! ! Need I emind anyone how many imes \"science\" has been w ong--o e and o e and o e --i 's a eaking useless discipline, all i does is build egos! \n\n \n F ank-S\n\n\n\nOn Wed, Jun 9, 2010 a 7:57 AM, Rj as e e @yahoo. com> w o e:\n\n  \n\n\n\n\n\n\n\n\n\n\nF om wha you' e pos ed so a , i sounds like an in e es ing e o , and I look o wa d o eading he en i e s udy.Also, om wha you pos ed, i did no say hey didn' use double-blind es ing. I says one o he easons hey do no conside he cu en adio-sweep claims eliable, is ha hose making hose claims do no do double blind es s.  \nSo i you a e calling BS and clueless hose who a e no doing double blind es ing, ha begs he ques ion - a e you? \n--- On Wed, 6/9/10, F ank Sump ion pu plealiengi l@ gmail.com> w o e:\n\n\n\n\nF om: F ank Sump ion pu plealiengi l@ gmail.com>\nSubjec : Re: [EVP-ITC] Re: Same s upid nas y nega i e BS!\nTo: EVP-ITC@yahoog oups .comDa e: Wednesday, June 9, 2010, 12:52 AM \n\n\n\n  \n\n\n I 's p obably no koshe o pos his, bu I ind his highly insul ing o all o us. As usual, igno e all ac s and all o he me hods, such as EVPmake , which o ms all he oices inside  he compu e . Igno e all phone EVP messages, igno e all oices hea d wi h no elec onic aids. Igno e messages ecei ed ia u ned o TV and p in e s--and on and on, ye hey know all abou EVP..Igno e he ac ha p obably housands use boxes success ully.\n\n\n \n\"We ha e conduc ed a ew lis ening s udies o epo ed adio-sweep EVP and he esul s ha e no been good. We ha e also wo ked wi h a a ie y o such de ices. Based on wha we know abou ans-e he ic in luences, how EVP and isual o ms o ITC a e o med and wha we know abou mediumship, i is di icul o i adio-sweep in o any es ablished hypo hesis. Wi hou solid esea ch suppo ing i as p oducing EVP, i is impossible o us o ecommend i o suppo i s use. I he e we e double-blind s udies conduc ed by expe ienced esea che s ha shows i does p oduce phenomena, we would gladly p omo e i as an al e na i e echnique.\n We a e p e y su e ha , in ans o m EVP (o dina y eco de ), he oice is o med in he elec onics by ans o ming a ailable audio- equency noise in an ac i e pa o he elec onics such as a ansis o junc ion. We hink he p ocess is ampli ica ion o a weak elekine ic signal ia s ochas ic esonance and we ha e ound ha he op imum audio- equency signal o his is a chao ic one ich in oice- equencies wi h many ansien pe u ba ion. Tha is ou wo king hypo hesis. \"\n\n \n I can' say who his is om, cuz almos ce ain I'd ge sued. The e's no double blind es ing hei BS ei he . Clueless!!\n \n F-S\n\nOn Wed, Jun 9, 2010 a 1:24 AM, pa acomm xxxsinxxxsinxxx@ yahoo.com> w o e:\n\n\n  \n\n\n\n\nWhen people s a calling hemsel es expe s a some hing ha is no o may ne e be ully unde s ood he c ap ge s deep. I lo e hese so called expe s ha ell us ha we can only make con ac using hei exac me hods and we need o e ain om any o he way o doing esea ch because in hei eyes we e jus spinning ou wheels. So we can' ge communica ion om modi ied adios and we e all jus hea ing wha we wan I guess. I ha e hea d i all,,\"I w o e a book and im an expe \" o \"belie e me ha won wo k, I know cause im physic\"….in one ea and ou he o he . E e yone is an expe hese days and mos o wha hey say is BS. I I s a hea ing someone o some hing alking h ough my dogs bu guess wha im eco ding i .\nSounds like hese so called expe s a e jus ying o de e and silence any hing hey don' ag ee wi h by doing he e Scien i ic es s. I i wo ks i wo ks and i i didn wo k wha he hell a e we all s ill doing he e. \n\n\n--- In EVP-ITC@yahoog oups .com, F ank Sump ion w o e:>\n\n\n\n> Go le e (e-mail) om a wo ld enowned EVP au ho i y( name wi hheld cuz I> know he h ea s ha would come), explaining how hey es ed he boxes and> ound no hing o i , y'all jus silly unin o med masses ha don' know any\n> be e and hey'll ell us all wha 's ok o hea and belie e in! Thousands> o box use s and expe iences a e ei he lying o insane!> > Pseudo scien i ic BS! Thei es ing e eals exac ly wha hey expec , ha \n> is he na u e o he pa ano mal. Ge ing he esul s hey wan ed, hey pu > ou hei ches s and p oclaim ye ano he ic o y o science! Science has> a habi o supplying exac ly he esul s wan ed by whoe e is paying o he\n> es s..> > Fi s , whe e do hey ind people ha a e somehow quali ied lis ene s!? WTF> is ha S---!? I 's BS, and hey know i . Same old skep ic/science c ap,> excep om a g oup ha wan s o be he wo lds only es EVP au ho i y. \n> > I'm su e he e will be a icles in majo pa ano mal mags p oclaiming how> he expe s ho oughly debunked he boxes.> > They keep es ing and ge ing no hing, and he es o us keep eco ding\n> and ha e no sho age o oices ha o he s can hea , can be alida ed, and> gi es in o ma ion ha 's unknow o he lis ene . I jus pos ed a ideo whe e \n> a oice says \"I said uck\" jus o show i 's no b oadcas ags. This s u > con enien ly igno ed. I' e been kicked o g oups o ge ing oices ha \n> somehow we e judged no ghos ly enough, cuz all he expe s know ghos s> can' cuss, hey can ba ely e en alk and communica e! \n> > They send me hei s upid esul s hinking I'm he one ou he e pushing> boxes. Igno an do ks, i 's he esul s pushing boxes!> > F ank-S>"}