{"id": "17630", "subject": "Re: [EVP-ITC] Alert,", "author": "Frank Sumption", "timestamp": "2010-06-11T01:55:37Z", "full_text": "Thanks.\n\n F-S\n\nOn Thu, Jun 10, 2010 at 2:26 PM, &lt;SnowfireL@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Well said, Frank, well said, some of us do have personal proof, other must\n&gt; be first hit over the head with a large brick before they can know\n&gt; something. sf\n&gt;\n&gt;\n&gt; -----Original Message-----\n&gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Thu, Jun 10, 2010 3:46 am\n&gt; Subject: Re: [EVP-ITC] Alert,\n&gt;\n&gt;\n&gt;    Easy to claim one is all modern and sophisticated, that all is known,\n&gt; there are no demons, gods,or angels. Easy to forget, modern man doesn&#39;t know\n&gt; squat! All your science, all your universities, all your &quot;logic&quot;--nothing!\n&gt; Y&#39;all don&#39;t know anythin&#39;!\n&gt;\n&gt;  Awhile back I had an experience where I was awakened in the middle of the\n&gt; night to what seemed to be some entity crawling up inside my body starting\n&gt; at my feet, accompanied by weird visions/hallucinations, unable to move.\n&gt; Easy to dismiss as dreams, maybe a bit of undigested beef-to quote scrooge,\n&gt; but none of my usual protection stuff worked, till I thought &quot;Jesus!&quot; The\n&gt; thing lifted it&#39;s head and took off. I&#39;m still not a believer, but I&#39;m not a\n&gt; total rejector either. There has been times when I needed &quot;His&quot; help, and\n&gt; was answered, plus, what I guess were angels, in open air &quot;Frank, He heard\n&gt; you&quot;. I don&#39;t believe in the church crap, but God is out there!  Not only\n&gt; that, is been &quot;:scientifically&quot; -as close to -proven as possible-- that the\n&gt; Shoud of Turin is in fact waht it appears to be--Jesus! Same question, what\n&gt; the hell kind of evidence will you find acceptable?\n&gt;\n&gt;  Some here will still insist all is known, and they are in fact the most\n&gt; advanced being the universe has ever seen--they have a great deal to learn!\n&gt; I try to tolerate their arrogance, but my patience is gone for that stuff.\n&gt; When they get over their name calling, maybe they will be allowed to post.\n&gt;\n&gt;  Frank-S\n&gt;\n&gt; On Wed, Jun 9, 2010 at 9:31 AM, Buck &lt;shgiruss@...&gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;    Snowfire, if i was dead (passed on) and was able to by happenstance\n&gt;&gt; come across you and the evp device and you asked me the question, what makes\n&gt;&gt; you think I know what I am talking about? Because I would tell you that\n&gt;&gt; their is no antichrist, no devil, no anthropomorphic hebrew savage god who\n&gt;&gt; commands his people to murder children and women in one town and in the next\n&gt;&gt; town kill all but virgin girls (old testament).\n&gt;&gt;\n&gt;&gt; I would say that there is only consciousness, not confined to any man made\n&gt;&gt; religion.\n&gt;&gt;\n&gt;&gt; with love,\n&gt;&gt; Russ\n&gt;&gt;\n&gt;&gt; --- On *Tue, 6/8/10, SnowfireL@... &lt;SnowfireL@...&gt;* wrote:\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; From: SnowfireL@... &lt;SnowfireL@...&gt;\n&gt;&gt; Subject: [EVP-ITC] Alert, [1 Attachment]\n&gt;&gt; To: RTSC@yahoogroups.com, EVP-ITC@yahoogroups.com,\n&gt;&gt; inside_the_box_rtsc_ghost_box_research@yahoogroups.com,\n&gt;&gt; Seraph@yahoogroups.com\n&gt;&gt; Date: Tuesday, June 8, 2010, 12:54 PM\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;  this one is very scary, I have not cleaned it up, I was asking about the\n&gt;&gt; antichrist, and if he was released yet, and they are saying, &quot;yes, he has\n&gt;&gt; been released, yes, he has, and that Christ is coming.&quot;  Please, don&#39;t\n&gt;&gt; get left here, just believe in what JC did, and don&#39;t be left behind, &quot;the\n&gt;&gt; teleport is going to be instantaneous, &quot; we won&#39;t feel a thing, one minute\n&gt;&gt; you will be sitting at a desk, next minute we will find our self in some\n&gt;&gt; grassy field is what I was told.  I have more, I haven&#39;t cleaned them up\n&gt;&gt; yet, but you can see how plain and clear they are from that newer RS that I\n&gt;&gt; messed up the other day.  They are saying scary things on it, they said, he\n&gt;&gt; is not the devil, that the antichrist is a &quot;spirit energy&quot; &quot;worse then the\n&gt;&gt; devil,&quot; and will &quot;infect&quot; posess some person after Obama.\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;   \n&gt;\n\nThanks.\n \n F-S\nOn Thu, Jun 10, 2010 a 2:26 PM, Snow i eL@...> w o e:\n\n  \n\n\n\n\nWell said, F ank, well said, some o us do ha e pe sonal p oo , o he mus be i s hi o e he head wi h a la ge b ick be o e hey can know some hing. s \n\n\n\n-----O iginal Message-----F om: F ank Sump ion pu plealiengi l@...>To: EVP-ITC@yahoog oups.com\n\nSen : Thu, Jun 10, 2010 3:46 amSubjec : Re: [EVP-ITC] Ale ,\n\n  \n\n\n\n\n Easy o claim one is all mode n and sophis ica ed, ha all is known, he e a e no demons, gods,o angels. Easy o o ge , mode n man doesn' know squa ! All you science, all you uni e si ies, all you \"logic\"--no hing! Y'all don' know any hin'!\n\n \n Awhile back I had an expe ience whe e I was awakened in he middle o he nigh o wha seemed o be some en i y c awling up inside my body s a ing a my ee , accompanied by wei d isions/hallucina ions, unable o mo e. Easy o dismiss as d eams, maybe a bi o undiges ed bee - o quo e sc ooge, bu none o my usual p o ec ion s u wo ked, ill I hough \"Jesus!\" The hing li ed i 's head and ook o . I'm s ill no a belie e , bu I'm no a o al ejec o ei he . The e has been imes when I needed \"His\" help, and was answe ed, plus, wha I guess we e angels, in open ai \"F ank, He hea d you\". I don' belie e in he chu ch c ap, bu God is ou he e!  No only ha , is been \":scien i ically\" -as close o -p o en as possible-- ha he Shoud o Tu in is in ac wah i appea s o be--Jesus! Same ques ion, wha he hell kind o e idence will you ind accep able?\n\n \n Some he e will s ill insis all is known, and hey a e in ac he mos ad anced being he uni e se has e e seen-- hey ha e a g ea deal o lea n! I y o ole a e hei a ogance, bu my pa ience is gone o ha s u . When hey ge o e hei name calling, maybe hey will be allowed o pos . \n\n \n F ank-S\nOn Wed, Jun 9, 2010 a 9:31 AM, Buck shgi uss@...> w o e:\n\n  \n\n\n\n\n\n\n\nSnow i e, i i was dead (passed on) and was able o by happens ance come ac oss you and he e p de ice and you asked me he ques ion, wha makes you hink I know wha I am alking abou ? Because I would ell you ha hei is no an ich is , no de il, no an h opomo phic heb ew sa age god who commands his people o mu de child en and women in one own and in he nex own kill all bu i gin gi ls (old es amen ). \nI would say ha he e is only consciousness, no con ined o any man made eligion.wi h lo e,Russ--- On Tue, 6/8/10, Snow i eL@... Snow i eL@...> w o e:\n\nF om: Snow i eL@... Snow i eL@...>\nSubjec : [EVP-ITC] Ale , [1 A achmen ]To: RTSC@yahoog oups.com, EVP-ITC@yahoog oups.com, inside_ he_box_ sc_ghos _box_ esea ch@yahoog oups.com, Se aph@yahoog oups.com\nDa e: Tuesday, June 8, 2010, 12:54 PM\n  \n\n\n his one is e y sca y, I ha e no cleaned i up, I was asking abou he an ich is , and i he was eleased ye , and hey a e saying, \"yes, he has been eleased, yes, he has, and ha Ch is is coming.\"  Please, don' ge  le he e, jus belie e in wha JC did, and don' be le behind, \" he elepo is going o be ins an aneous, \" we won' eel a hing, one minu e you will be si ing a a desk, nex minu e we will ind ou sel in some g assy ield is wha I was old.  I ha e mo e, I ha en' cleaned hem up ye , bu you can see how plain and clea hey a e om ha newe RS ha I messed up he o he day.  They a e saying sca y hings on i , hey said, he is no he de il, ha he an ich is is a \"spi i ene gy\" \"wo se hen he de il,\" and will \"in ec \" posess some pe son a e Obama."}