{"id": "17642", "subject": "Re: [EVP-ITC] Something interesting ...", "author": "Zack Widup", "timestamp": "2010-06-11T19:35:57Z", "full_text": "That&#39;s all fascinating. It makes sense to me.\n\nI have gotten several EVP recordings in which a name was given. In all cases\nthe name is not a name that was known by any of the living people present\nand there is no particular reason for anyone there to be thinking of that\nname. In one case the name was verified in old records as a person present\nin that location many years ago (but we certainly didn&#39;t know that at the\ntime we were there). In another case we&#39;re still trying to find out if\nanyone by that name was in that area within the last 150 years.\nZack\n\n\nOn Fri, Jun 11, 2010 at 1:59 PM, John S &lt;phenom_investigator@...&gt;wrote:\n\n&gt;\n&gt;\n&gt;  I was listening to Tom&#39;s very clear recording and decided to put it\n&gt; through Audacity\n&gt; so I could view the spectrum. Usually recordings have far too much noise\n&gt; for this\n&gt; to work well, which is why I like the clearer and cleaner recordings many\n&gt; people\n&gt; call &#39;Class A&#39;.  What I found got me to thinking and I want to share my\n&gt; thoughts.\n&gt;\n&gt; First, it&#39;s helpful to know that I have quite a bit of professional\n&gt; experience studying\n&gt; spectra - from ULF up through sound and light and way into the region of\n&gt; radio\n&gt; waves and even cosmic radiation. I have stared at more spectrum analyzers\n&gt; over\n&gt; the decades than I care to count. So when I realized what I was seeing in\n&gt; Tom&#39;s\n&gt; recording I was a bit surprised I hadn&#39;t thought about it before.\n&gt;\n&gt; Usually when you look at a visual representation of an audio recording, you\n&gt; can\n&gt; clearly see the noise with the signal superimposed atop it. The higher the\n&gt; noise\n&gt; level relative to the signal level, the lower the &#39;signal-to-noise&#39; ratio\n&gt; which results\n&gt; in recordings that are very hard to hear. In a normal recording, such as\n&gt; you might\n&gt; make of yourself speaking into a microphone, there is a specific way the\n&gt; noise\n&gt; band disappears when the signal level gets high enough. But more than that,\n&gt;\n&gt; this only occurs when the signal is introduced in the early stages of audio\n&gt;\n&gt; processing - a noisy amplifier for example looks completely different than\n&gt; a high level background noise with someone speaking over it. And that&#39;s\n&gt; what is important here.\n&gt;\n&gt; What I noticed that got me thinking was that in the spectrum analysis,\n&gt; the noise level was reasonable for this type of recording. And it was\n&gt; fairly\n&gt; constant. It was what I have come to see in these recordings except that\n&gt; the signal to noise ratio was a bit better. Meaning the signal was a bit\n&gt; clearer initially. When the sound (which seems to be a young girl&#39;s\n&gt; voice) begins, the noise level rapidly goes down and almost completely\n&gt; vanishes while the signal goes high. This is why you can clearly hear\n&gt; the voice: the absence of noise as much as the signal level itself.\n&gt;\n&gt; Now here&#39;s what got me going. I realized that this specific waveform\n&gt; suggests strongly that the point of influence is not deep inside the\n&gt; electronics. Rather, it is at an exterior point, such as where the signal\n&gt; first enters the system. And that would imply that something towards\n&gt; the outer part of the electronics is being manipulated, and not the\n&gt; recording media or anything near it.\n&gt;\n&gt; This would also explain why voice phenomena can appear on different\n&gt; media and on different electronics such as transistor or solid state or\n&gt; vacuum tube. AAEVP has suggested, and based on this observation\n&gt; I would agree, that the probable point of influence is a junction near\n&gt; the a front-end stage of an early amplifier circuit. Every electronic\n&gt; system would have this in common.\n&gt;\n&gt; I have suggested before that I believe that at least some (probably\n&gt; the higher quality) EVPs may be due to operator PK influence.\n&gt; MicroPK is believed to operate at or near the molecular level as\n&gt; evidenced by things such as healing. And healing agents have\n&gt; been identified who have many similar traits to PK agents. So\n&gt; it follows they may employ similar abilities and use similar\n&gt; mechanisms.  This observation is entirely in line with this idea.\n&gt;\n&gt; Does this mean that in truth no discarnates are communicating?\n&gt; In a dramatic demonstration of who I really am, or more to the\n&gt; point what I really believe, let me say that I&#39;m not yet sure.\n&gt; Maybe they are, and maybe they are not. This evidence does\n&gt; not tell us that answer.\n&gt;\n&gt; This is similar to work in mediumship research. We have shown\n&gt; that mediums can receive information they should not know in\n&gt; controlled laboratory conditions. But we don&#39;t know scientifically\n&gt; where this information comes from. Apparitional experients are\n&gt; convinced they have seen or heard the dead, but apparitions of\n&gt; the living are quite common as well. The more you learn about\n&gt; this phenomena, the more you realize that many commoly\n&gt; accepted explanations fall short when applied in general.\n&gt;\n&gt; As I wrote previously, the real issue is that science today\n&gt; does  not have the understanding or the tools to properly\n&gt; evaluate this data. Science cannot prove or disprove this\n&gt; phenomena. Not today. An honest scientist (and skeptic)\n&gt; will tell you this is an unknown, an anomaly. And so, as\n&gt; folks here know, it comes down to belief in the absence\n&gt; of any protocol or experiment to clearly demonstrate the\n&gt; source of these sounds.\n&gt;\n&gt; But I for one feel comfortable that higher quality recordings\n&gt; will help move us along, if for no other reason than we can\n&gt; eliminate some variables. The analysis I mentioned can&#39;t\n&gt; be done on noisier recordings; it took a very quiet one to\n&gt; be able to see this clearly. And that&#39;s what triggered my\n&gt; thoughts.\n&gt;\n&gt; I also noticed a tiny spike before and after the higher\n&gt; quality speech. To some this might suggest an edit,\n&gt; but in this case I don&#39;t think that happened - here&#39;s why.\n&gt; You can see the signal emerging from the noise when\n&gt; noise is still present and only when it achieves a certain\n&gt; level is the noise suppressed. Had this been an edit,\n&gt; the noise level on this close a scrutiny would have\n&gt; been a bit more obvious - unless the editor got very lucky.\n&gt; But in consideration of how the voice appears and\n&gt; also the fact that similar low-level spikes appear\n&gt; elsewhere in the recording, it would seem more likely\n&gt; that the spikes are artifacts of the tuning that&#39;s going\n&gt; on or some other random events.\n&gt;\n&gt; Once again, this makes the case for me at least\n&gt; for trying to get the highest quality possible. These\n&gt; are the kinds of recordings which scientists may be\n&gt; able to use sooner than later as understanding and\n&gt; tools inevitably improve.\n&gt;\n&gt; One last thought regarding the notion of PK as an\n&gt; explanation. It is very important we come to understand\n&gt; PK well. Only then might it actually be used in a\n&gt; practical way. I&#39;m sure you&#39;ve heard or thought about\n&gt; a world where you could literally turn things on and off\n&gt; with your mind. Or type simply by thinking about it.\n&gt; Believe it or not, one way forward to such technology\n&gt; could well be through the understanding of PK. So much\n&gt; of Parapsychology is actually exploring the leading edge\n&gt; (some might say &#39;bleeding&#39; edge) of science. It shows us\n&gt; where things might go and, frankly, that is one interesting\n&gt; world at least for me. That&#39;s why I have been in the field\n&gt; for many decades.\n&gt;\n&gt; Apologies for the long post, but I thought some might\n&gt; find it useful and informative.\n&gt;\n&gt;\n&gt;  \n&gt;\n\nTha 's all ascina ing. I makes sense o me.\n \nI ha e go en se e al EVP eco dings in which a name was gi en. In all cases he name is no a name ha was known by any o he li ing people p esen and he e is no pa icula eason o anyone he e o be hinking o ha name. In one case he name was e i ied in old  eco ds as a pe son p esen in ha loca ion many yea s ago (bu we ce ainly didn' know ha a he ime we we e he e). In ano he case we' e s ill  ying o ind ou i anyone by ha name was in ha a ea wi hin he las 150 yea s.\n\nZack\n \nOn F i, Jun 11, 2010 a 1:59 PM, John S phenom_in es iga o @...> w o e:\n\n  \n\n\n\n\n\nI was lis ening o Tom's e y clea eco ding and decided o pu i h ough Audaci y\nso I could iew he spec um. Usually eco dings ha e a oo much noise o his\n o wo k well, which is why I like he clea e and cleane eco dings many people\ncall 'Class A'.  Wha I ound go me o hinking and I wan o sha e my hough s.\n \nFi s , i 's help ul o know ha I ha e qui e a bi o p o essional expe ience s udying\nspec a - om ULF up h ough sound and ligh and way in o he egion o adio\nwa es and e en cosmic adia ion. I ha e s a ed a mo e spec um analyze s o e \n he decades han I ca e o coun . So when I ealized wha I was seeing in Tom's\n eco ding I was a bi su p ised I hadn' hough abou i be o e.\n \nUsually when you look a a isual ep esen a ion o an audio eco ding, you can\nclea ly see he noise wi h he signal supe imposed a op i . The highe he noise\nle el ela i e o he signal le el, he lowe he 'signal- o-noise' a io which esul s\nin eco dings ha a e e y ha d o hea . In a no mal eco ding, such as you migh \nmake o you sel speaking in o a mic ophone, he e is a speci ic way he noise\nband disappea s when he signal le el ge s high enough. Bu mo e han ha , \n his only occu s when he signal is in oduced in he ea ly s ages o audio \np ocessing - a noisy ampli ie o example looks comple ely di e en han \na high le el backg ound noise wi h someone speaking o e i . And ha 's \nwha is impo an he e.\n \nWha I no iced ha go me hinking was ha in he spec um analysis, \n he noise le el was easonable o his ype o eco ding. And i was ai ly\ncons an . I was wha I ha e come o see in hese eco dings excep ha \n he signal o noise a io was a bi be e . Meaning he signal was a bi \nclea e ini ially. When he sound (which seems o be a young gi l's\n oice) begins, he noise le el apidly goes down and almos comple ely\n anishes while he signal goes high. This is why you can clea ly hea \n he oice: he absence o noise as much as he signal le el i sel .\n \nNow he e's wha go me going. I ealized ha his speci ic wa e o m\nsugges s s ongly ha he poin o in luence is no deep inside he \nelec onics. Ra he , i is a an ex e io poin , such as whe e he signal\n i s en e s he sys em. And ha would imply ha some hing owa ds\n he ou e pa o he elec onics is being manipula ed, and no he \n eco ding media o any hing nea i . \n \nThis would also explain why oice phenomena can appea on di e en \nmedia and on di e en elec onics such as ansis o o solid s a e o \n acuum ube. AAEVP has sugges ed, and based on his obse a ion\nI would ag ee, ha he p obable poin o in luence is a junc ion nea \n he a on -end s age o an ea ly ampli ie ci cui . E e y elec onic \nsys em would ha e his in common.\n \nI ha e sugges ed be o e ha I belie e ha a leas some (p obably \n he highe quali y) EVPs may be due o ope a o PK in luence.\nMic oPK is belie ed o ope a e a o nea he molecula le el as \ne idenced by hings such as healing. And healing agen s ha e\nbeen iden i ied who ha e many simila ai s o PK agen s. So\ni ollows hey may employ simila abili ies and use simila \nmechanisms.  This obse a ion is en i ely in line wi h his idea.\n \nDoes his mean ha in u h no disca na es a e communica ing?\nIn a d ama ic demons a ion o who I eally am, o mo e o he \npoin wha I eally belie e, le me say ha I'm no ye su e.\nMaybe hey a e, and maybe hey a e no . This e idence does\nno ell us ha answe .\n \nThis is simila o wo k in mediumship esea ch. We ha e shown\n ha mediums can ecei e in o ma ion hey should no know in\ncon olled labo a o y condi ions. Bu we don' know scien i ically\nwhe e his in o ma ion comes om. Appa i ional expe ien s a e\ncon inced hey ha e seen o hea d he dead, bu appa i ions o \n he li ing a e qui e common as well. The mo e you lea n abou \n his phenomena, he mo e you ealize ha many commoly \naccep ed explana ions all sho when applied in gene al.\n \nAs I w o e p e iously, he eal issue is ha science oday\ndoes  no ha e he unde s anding o he ools o p ope ly \ne alua e his da a. Science canno p o e o disp o e his \nphenomena. No oday. An hones scien is (and skep ic)\nwill ell you his is an unknown, an anomaly. And so, as\n olks he e know, i comes down o belie in he absence \no any p o ocol o expe imen o clea ly demons a e he\nsou ce o hese sounds.\n \nBu I o one eel com o able ha highe quali y eco dings\nwill help mo e us along, i o no o he eason han we can \nelimina e some a iables. The analysis I men ioned can' \nbe done on noisie eco dings; i ook a e y quie one o\nbe able o see his clea ly. And ha 's wha igge ed my \n hough s.\n \nI also no iced a iny spike be o e and a e he highe \nquali y speech. To some his migh sugges an edi , \nbu in his case I don' hink ha happened - he e's why.\nYou can see he signal eme ging om he noise when\nnoise is s ill p esen and only when i achie es a ce ain\nle el is he noise supp essed. Had his been an edi , \n he noise le el on his close a sc u iny would ha e \nbeen a bi mo e ob ious - unless he edi o go e y lucky.\nBu in conside a ion o how he oice appea s and \nalso he ac ha simila low-le el spikes appea \nelsewhe e in he eco ding, i would seem mo e likely\n ha he spikes a e a i ac s o he uning ha 's going\non o some o he andom e en s.\n \nOnce again, his makes he case o me a leas \n o ying o ge he highes quali y possible. These\na e he kinds o   eco dings which scien is s may be \nable o use soone han la e as unde s anding and \n ools ine i ably imp o e.\n \nOne las hough ega ding he no ion o PK as an \nexplana ion. I is e y impo an we come o unde s and\nPK well. Only hen migh i ac ually be used in a \np ac ical way. I'm su e you' e hea d o hough abou \na wo ld whe e you could li e ally u n hings on and o \nwi h you mind. O ype simply by hinking abou i .\nBelie e i o no , one way o wa d o such echnology\ncould well be h ough he unde s anding o PK. So much\no Pa apsychology is ac ually explo ing he leading edge\n(some migh say 'bleeding' edge) o science. I shows us\nwhe e hings migh go and, ankly, ha is one in e es ing\nwo ld a leas o me. Tha 's why I ha e been in he ield\n o many decades.\n \nApologies o he long pos , bu I hough some migh \n ind i use ul and in o ma i e."}