{"id": "17643", "subject": "Re: Something interesting ...", "author": "Fiona Broome", "timestamp": "2010-06-11T19:58:59Z", "full_text": "Hi,\n\nJohn, that&#39;s really interesting.  I&#39;ve tried looking at EVPs in Audacity, but I&#39;ll admit I know just enough about audio spectra to be dangerous. *chuckle* I know what looks &quot;odd&quot; but I&#39;m not always sure what it means.\n\nThe PK issue, as well as other relatively routine (at least in my work) ESP-related phenomena are always questions when I try to understand the source/s of information -- audio, impressions, poltergeist phenomena, etc. \n\nDespite my cynicism -- reinforced because I&#39;m supposedly psychic and have to be honest about where the internal messages might come from -- my experiences with Chris Moon were a surprise.  The clear (and consistent) voice I heard from his &quot;Frank&#39;s box&quot; was astonishing in itself.  What it said (and asked) really amazed me.  Oh, it made sense when I thought about it, but it was not the usual &quot;Well, yes, but this could be telepathy&quot; sort of message/dialogue I&#39;m accustomed to and can at least _halfway_ dismiss.\n\nI can&#39;t rule out anything, of course, and I look forward to additional experiences with boxes that &quot;talk&quot; clearly.  However, based on what I heard with Chris Moon, and the recordings on this list, I&#39;m deeply intrigued.\n\nThe influence of PK, etc., are exactly what I want to look at more critically... but on a far wider scale than voices-from-boxes.\n\nIn fact, from what I&#39;ve heard so far, the voices may be easier to accept (and perhaps validate) as authentic than much phenomena at &quot;haunted&quot; sites.  (Clear and predictive messages will be very helpful.)\n\nOf course, more questions seem to open more doors to even wider (and wilder) possibilities.\n\nThe more that people experiment with this, and ask the &quot;what if..?&quot; questions to see where they lead, the better.\n\nUsing literature as a reference, it seems to me that the current research is at the &quot;rough draft&quot; stage of things.  We&#39;re seeing what works and what doesn&#39;t.  The more brainstorming, the better!\n\nMetaphorically speaking, it&#39;s far too early to bring in an editor, or censor the work in any way.  The more information that can be gathered -- and without expectations or constraints -- the better. \n\nPK and related phenomena are important issues to keep in mind, particularly in later phases, as we explore the myriad possible answers to diverse paranormal phenomena.  \n\nThe role of expectations and our cultural/spiritual contexts will probably play a role, as well.\n\nHowever, I keep going back to how unexpected all of this has been, at least for me.  For me, that&#39;s important.\n\nCheerfully,\nFiona\n\n\n--- In EVP-ITC@...m, John S &lt;phenom_investigator@...&gt; wrote:\n&gt;\n&gt; I was listening to Tom&#39;s very clear recording and decided to put it through Audacity\n&gt; so I could view the spectrum. Usually recordings have far too much noise for this\n&gt; to work well, which is why I like the clearer and cleaner recordings many people\n&gt; call &#39;Class A&#39;. What I found got me to thinking and I want toshare my thoughts.\n&gt;"}