{"id": "17655", "subject": "Re: [EVP-ITC] long time no talk...", "author": "Frank Sumption", "timestamp": "2010-06-12T18:27:41Z", "full_text": "Radio Shack has a Loop antenna that can boost signals, and there&#39;s the\nfamous C. Crane twin ferrite antenna. Or you could google AM loop antenna,\nand make one pretty easy.\n\n F-S\n\nOn Fri, Jun 11, 2010 at 1:21 PM, rhondak1973 &lt;rhondak1973@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; So I have a question...I been keepin up wit the posts and all. Been some\n&gt; good stuff. Hope everyne is doing well.\n&gt;\n&gt; I moved from Tucson to Lake Havasu and my little radio shack 12-470 seems\n&gt; to be having a hard time picking up signals where we live. The big stereo in\n&gt; the living room picks up stations fine tho I dont think the bf would like if\n&gt; I &quot;hacked&quot; it LOL.\n&gt;\n&gt; So my question is, Is there something I could do to boost this little\n&gt; ratshacks ability to pick up signals(theres no external antenna jack) or\n&gt; should i just try to save up for a newer better model? Ive been trying for\n&gt; months to record but no go really. I do know they are there cuz i can hear\n&gt; em but it takes like 5 mins(or more) for a complete sentence. i think its\n&gt; frustrating both sides lol.\n&gt; Thanks!\n&gt; Rhonda\n&gt;\n&gt; \n&gt;\n\nRadio Shack has a Loop an enna ha can boos signals, and he e's he amous C. C ane win e i e an enna. O you could google AM loop an enna, and make one p e y easy. \n \n F-S\nOn F i, Jun 11, 2010 a 1:21 PM, hondak1973 hondak1973@...> w o e:\n\n  \n\n\n\nSo I ha e a ques ion...I been keepin up wi he pos s and all. Been some good s u . Hope e e yne is doing well.I mo ed om Tucson o Lake Ha asu and my li le adio shack 12-470 seems o be ha ing a ha d ime picking up signals whe e we li e. The big s e eo in he li ing oom picks up s a ions ine ho I don hink he b would like i I \"hacked\" i LOL. \nSo my ques ion is, Is he e some hing I could do o boos his li le a shacks abili y o pick up signals( he es no ex e nal an enna jack) o should i jus y o sa e up o a newe be e model? I e been ying o mon hs o eco d bu no go eally. I do know hey a e he e cuz i can hea em bu i akes like 5 mins(o mo e) o a comple e sen ence. i hink i s us a ing bo h sides lol.\nThanks!Rhonda"}