{"id": "17667", "subject": "Re: [EVP-ITC] Alert,", "author": "Frank Sumption", "timestamp": "2010-06-14T05:42:37Z", "full_text": "The bible has been hacked into oblivion, I think. It&#39;s origins are the\nmiddle east, notorious for treating women very badly, and notorious for\ntheir f&#39;d up religions.\n\n I do have personal experience with some deity, certainly not the guy from\nbible, as well as angels, and I still wouldn&#39;t step foot in a church. You\nwould be wise to be a bit more reverent. Try Native American Religion, you\nmight find more enlightening.\n I just tinker with this junk and got intrigued with the voices--other than\nthat I don&#39;t really care! Everyone gets on these stupid ego trips for\nreasons I can&#39;t comprehend, and it&#39;s not just boxes, everyone does it for\none stupid thing or another.\n\n F-S\nOn Sun, Jun 13, 2010 at 9:28 AM, Buck &lt;shgiruss@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;   And some of us are logical and read other material besides tribal\n&gt; religion. Care to do any logical debates Im up for it.\n&gt;\n&gt; Frank your reference to &quot;Modern&quot; beliefs are wrong I assume you classify me\n&gt; as a newager. I think you may have a cool box, but please don&#39;t think that\n&gt; makes you an expert on tribal religon versus Quantum physics.\n&gt;\n&gt; Personally I believe the god of the bible is a savage evil god who really\n&gt; is the devil...if he were real. Don&#39;t beieve me? Have you ever read the old\n&gt; testament? Did you know that over 400 virgin girls were given to the priests\n&gt; during one raid for slavery? Hmmm, I wonder what those holy priests used so\n&gt; many little girls for?\n&gt;\n&gt; Could you go into a town and murder all women and children (drive swords\n&gt; thu them) and then take them outside and put them in a pile and burn them?\n&gt; Does that sound like a loving god? The hebrews were wild savages that\n&gt; decimated a town, commited atrocities worse than hitler all in the name of\n&gt; what a self proclaimed Jealous god?\n&gt;\n&gt; stick to your box but please don&#39;t try to save us from the\n&gt; anti-christ.....by the way, jesus was not a christian. He was a jewish.\n&gt;\n&gt; Research Constantine, he was the gay emperor that killed his wife, brother\n&gt; and son and chose to put together the books of the new testament. He\n&gt; required that all believe and follow this religion or be put to death.\n&gt;\n&gt; Im just saying that this group is about EVP not about snowfire saving our\n&gt; sould from the debil.\n&gt;\n&gt; --- On *Thu, 6/10/10, SnowfireL@... &lt;SnowfireL@...&gt;* wrote:\n&gt;\n&gt;\n&gt; From: SnowfireL@... &lt;SnowfireL@...&gt;\n&gt; Subject: Re: [EVP-ITC] Alert,\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Thursday, June 10, 2010, 4:26 PM\n&gt;\n&gt;\n&gt;  Well said, Frank, well said, some of us do have personal proof, other\n&gt; must be first hit over the head with a large brick before they can know\n&gt; something. sf\n&gt;\n&gt;\n&gt; -----Original Message-----\n&gt; From: Frank Sumption &lt;purplealiengirl@ gmail.com&gt;\n&gt; To: EVP-ITC@yahoogroups .com\n&gt; Sent: Thu, Jun 10, 2010 3:46 am\n&gt; Subject: Re: [EVP-ITC] Alert,\n&gt;\n&gt;\n&gt;    Easy to claim one is all modern and sophisticated, that all is known,\n&gt; there are no demons, gods,or angels. Easy to forget, modern man doesn&#39;t know\n&gt; squat! All your science, all your universities, all your &quot;logic&quot;--nothing!\n&gt; Y&#39;all don&#39;t know anythin&#39;!\n&gt;\n&gt;   Awhile back I had an experience where I was awakened in the middle of\n&gt; the night to what seemed to be some entity crawling up inside my body\n&gt; starting at my feet, accompanied by weird visions/hallucinati ons, unable to\n&gt; move. Easy to dismiss as dreams, maybe a bit of undigested beef-to quote\n&gt; scrooge, but none of my usual protection stuff worked, till I thought\n&gt; &quot;Jesus!&quot; The thing lifted it&#39;s head and took off. I&#39;m still not a believer,\n&gt; but I&#39;m not a total rejector either. There has been times when I needed\n&gt; &quot;His&quot; help, and was answered, plus, what I guess were angels, in open air\n&gt; &quot;Frank, He heard you&quot;. I don&#39;t believe in the church crap, but God is out\n&gt; there!  Not only that, is been &quot;:scientifically&quot; -as close to -proven as\n&gt; possible-- that the Shoud of Turin is in fact waht it appears to be--Jesus!\n&gt; Same question, what the hell kind of evidence will you find acceptable?\n&gt;\n&gt;  Some here will still insist all is known, and they are in fact the most\n&gt; advanced being the universe has ever seen--they have a great deal to learn!\n&gt; I try to tolerate their arrogance, but my patience is gone for that stuff.\n&gt; When they get over their name calling, maybe they will be allowed to post.\n&gt;\n&gt;  Frank-S\n&gt;\n&gt; On Wed, Jun 9, 2010 at 9:31 AM, Buck &lt;shgiruss@yahoo. com&lt;http://us.mc531.mail.yahoo.com/mc/compose?to=shgiruss@yahoo.com&gt;\n&gt; &gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;    Snowfire, if i was dead (passed on) and was able to by happenstance\n&gt;&gt; come across you and the evp device and you asked me the question, what makes\n&gt;&gt; you think I know what I am talking about? Because I would tell you that\n&gt;&gt; their is no antichrist, no devil, no anthropomorphic hebrew savage god who\n&gt;&gt; commands his people to murder children and women in one town and in the next\n&gt;&gt; town kill all but virgin girls (old testament).\n&gt;&gt;\n&gt;&gt; I would say that there is only consciousness, not confined to any man made\n&gt;&gt; religion.\n&gt;&gt;\n&gt;&gt; with love,\n&gt;&gt; Russ\n&gt;&gt;\n&gt;&gt; --- On *Tue, 6/8/10, SnowfireL@aol. com&lt;http://us.mc531.mail.yahoo.com/mc/compose?to=SnowfireL@...&gt;\n&gt;&gt; &lt;SnowfireL@aol. com&lt;http://us.mc531.mail.yahoo.com/mc/compose?to=SnowfireL@...&gt;\n&gt;&gt; &gt;* wrote:\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; From: SnowfireL@aol. com&lt;http://us.mc531.mail.yahoo.com/mc/compose?to=SnowfireL@...&gt;&lt;SnowfireL@aol.\n&gt;&gt; com &lt;http://us.mc531.mail.yahoo.com/mc/compose?to=SnowfireL@...&gt;&gt;\n&gt;&gt; Subject: [EVP-ITC] Alert, [1 Attachment]\n&gt;&gt; To: RTSC@yahoogroups. com&lt;http://us.mc531.mail.yahoo.com/mc/compose?to=RTSC@...m&gt;,\n&gt;&gt; EVP-ITC@yahoogroups .com&lt;http://us.mc531.mail.yahoo.com/mc/compose?to=EVP-ITC@yahoogroups.com&gt;,\n&gt;&gt; inside_the_box_ rtsc_ghost_ box_research@ yahoogroups. com&lt;http://us.mc531.mail.yahoo.com/mc/compose?to=inside_the_box_rtsc_ghost_box_research@yahoogroups.com&gt;,\n&gt;&gt; Seraph@yahoogroups. com&lt;http://us.mc531.mail.yahoo.com/mc/compose?to=Seraph@yahoogroups.com&gt;\n&gt;&gt; Date: Tuesday, June 8, 2010, 12:54 PM\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;  this one is very scary, I have not cleaned it up, I was asking about the\n&gt;&gt; antichrist, and if he was released yet, and they are saying, &quot;yes, he has\n&gt;&gt; been released, yes, he has, and that Christ is coming.&quot;  Please, don&#39;t\n&gt;&gt; get left here, just believe in what JC did, and don&#39;t be left behind, &quot;the\n&gt;&gt; teleport is going to be instantaneous, &quot; we won&#39;t feel a thing, one minute\n&gt;&gt; you will be sitting at a desk, next minute we will find our self in some\n&gt;&gt; grassy field is what I was told.  I have more, I haven&#39;t cleaned them up\n&gt;&gt; yet, but you can see how plain and clear they are from that newer RS that I\n&gt;&gt; messed up the other day.  They are saying scary things on it, they said, he\n&gt;&gt; is not the devil, that the antichrist is a &quot;spirit energy&quot; &quot;worse then the\n&gt;&gt; devil,&quot; and will &quot;infect&quot; posess some person after Obama.\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;\n&gt; \n&gt;\n\nThe bible has been hacked in o obli ion, I hink. I 's o igins a e he middle eas , no o ious o ea ing women e y badly, and no o ious o hei 'd up eligions. \n \n I do ha e pe sonal expe ience wi h some dei y, ce ainly no he guy om bible, as well as angels, and I s ill wouldn' s ep oo in a chu ch. You would be wise o be a bi mo e e e en . T y Na i e Ame ican Religion, you migh ind mo e enligh ening.\n\n I jus inke wi h his junk and go in igued wi h he oices--o he han ha I don' eally ca e! E e yone ge s on hese s upid ego ips o easons I can' comp ehend, and i 's no jus boxes, e e yone does i o one s upid hing o ano he . \n\n \n F-S\nOn Sun, Jun 13, 2010 a 9:28 AM, Buck shgi uss@...> w o e:\n\n  \n\n\n\n\n\n\n\n\nAnd some o us a e logical and ead o he ma e ial besides ibal eligion. Ca e o do any logical deba es Im up o i . F ank you e e ence o \"Mode n\" belie s a e w ong I assume you classi y me as a newage . I hink you may ha e a cool box, bu please don' hink ha makes you an expe on ibal eligon e sus Quan um physics.\n\n \nPe sonally I belie e he god o he bible is a sa age e il god who eally is he de il...i he we e eal. Don' beie e me? Ha e you e e ead he old es amen ? Did you know ha o e 400 i gin gi ls we e gi en o he p ies s du ing one aid o sla e y? Hmmm, I wonde wha hose holy p ies s used so many li le gi ls o ?\n\n \nCould you go in o a own and mu de all women and child en (d i e swo ds hu hem) and hen ake hem ou side and pu hem in a pile and bu n hem? Does ha sound like a lo ing god? The heb ews we e wild sa ages ha decima ed a own, commi ed a oci ies wo se han hi le all in he name o wha a sel p oclaimed Jealous god?\n\n \ns ick o you box bu please don' y o sa e us om he an i-ch is .....by he way, jesus was no a ch is ian. He was a jewish.\n \nResea ch Cons an ine, he was he gay empe o ha killed his wi e, b o he and son and chose o pu oge he he books o he new es amen . He equi ed ha all belie e and ollow his eligion o be pu o dea h. \n\n \nIm jus saying ha his g oup is abou EVP no abou snow i e sa ing ou sould om he debil. \n--- On Thu, 6/10/10, Snow i eL@... Snow i eL@...> w o e:\n\n\nF om: Snow i eL@... Snow i eL@...>Subjec : Re: [EVP-ITC] Ale , \nTo: EVP-ITC@yahoog oups.comDa e: Thu sday, June 10, 2010, 4:26 PM\n  \n\n\n\nWell said, F ank, well said, some o us do ha e pe sonal p oo , o he mus be i s hi o e he head wi h a la ge b ick be o e hey can know some hing. s \n\n\n-----O iginal Message-----F om: F ank Sump ion gmail.com>To: EVP-ITC@yahoog oups .comSen : Thu, Jun 10, 2010 3:46 amSubjec : Re: [EVP-ITC] Ale ,\n\n\n  \n\n\n\n\n\n Easy o claim one is all mode n and sophis ica ed, ha all is known, he e a e no demons, gods,o angels. Easy o o ge , mode n man doesn' know squa ! All you science, all you uni e si ies, all you \"logic\"--no hing! Y'all don' know any hin'!\n\n \n\n Awhile back I had an expe ience whe e I was awakened in he middle o he nigh o wha seemed o be some en i y c awling up inside my body s a ing a my ee , accompanied by wei d isions/hallucina i ons, unable o mo e. Easy o dismiss as d eams, maybe a bi o undiges ed bee - o quo e sc ooge, bu none o my usual p o ec ion s u wo ked, ill I hough \"Jesus!\" The hing li ed i 's head and ook o . I'm s ill no a belie e , bu I'm no a o al ejec o ei he . The e has been imes when I needed \"His\" help, and was answe ed, plus, wha I guess we e angels, in open ai \"F ank, He hea d you\". I don' belie e in he chu ch c ap, bu God is ou he e!  No only ha , is been \":scien i ically\" -as close o -p o en as possible-- ha he Shoud o Tu in is in ac wah i appea s o be--Jesus! Same ques ion, wha he hell kind o e idence will you ind accep able?\n\n \n Some he e will s ill insis all is known, and hey a e in ac he mos ad anced being he uni e se has e e seen-- hey ha e a g ea deal o lea n! I y o ole a e hei a ogance, bu my pa ience is gone o ha s u . When hey ge o e hei name calling, maybe hey will be allowed o pos . \n\n \n F ank-S\nOn Wed, Jun 9, 2010 a 9:31 AM, Buck shgi uss@yahoo. com> w o e:\n\n\n  \n\n\n\n\n\n\n\nSnow i e, i i was dead (passed on) and was able o by happens ance come ac oss you and he e p de ice and you asked me he ques ion, wha makes you hink I know wha I am alking abou ? Because I would ell you ha hei is no an ich is , no de il, no an h opomo phic heb ew sa age god who commands his people o mu de child en and women in one own and in he nex own kill all bu i gin gi ls (old es amen ). \nI would say ha he e is only consciousness, no con ined o any man made eligion.wi h lo e,Russ--- On Tue, 6/8/10, Snow i eL@aol. com Snow i eL@aol. com> w o e:\n\nF om: Snow i eL@aol. com Snow i eL@aol. com>\nSubjec : [EVP-ITC] Ale , [1 A achmen ]To: RTSC@yahoog oups. com, EVP-ITC@yahoog oups .com, inside_ he_box_ sc_ghos _ box_ esea ch@ yahoog oups. com, Se aph@yahoog oups. com\nDa e: Tuesday, June 8, 2010, 12:54 PM\n  \n\n\n his one is e y sca y, I ha e no cleaned i up, I was asking abou he an ich is , and i he was eleased ye , and hey a e saying, \"yes, he has been eleased, yes, he has, and ha Ch is is coming.\"  Please, don' ge  le he e, jus belie e in wha JC did, and don' be le behind, \" he elepo is going o be ins an aneous, \" we won' eel a hing, one minu e you will be si ing a a desk, nex minu e we will ind ou sel in some g assy ield is wha I was old.  I ha e mo e, I ha en' cleaned hem up ye , bu you can see how plain and clea hey a e om ha newe RS ha I messed up he o he day.  They a e saying sca y hings on i , hey said, he is no he de il, ha he an ich is is a \"spi i ene gy\" \"wo se hen he de il,\" and will \"in ec \" posess some pe son a e Obama."}