{"id": "17670", "subject": "Re: [EVP-ITC] Re: The car tuner.auto sweep--noise \treduction--seperated", "author": "Frank Sumption", "timestamp": "2010-06-14T06:24:16Z", "full_text": "Amazing how many words and letters I leave out, need to remember spell\ncheck!\n\nYeah, the entities seem to like the car tuners as well. About the only\ndifference is the antenna input, the car tuners don&#39;t use the ferrite rod\nantenna, they use a tuned RF amplifier front end. RF=radio frequency.\n\n F-S\n\nOn Wed, Jun 9, 2010 at 5:38 PM, jennifer &lt;3eyesofwisdom@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; There might be something to the car tuners. I had a very weird experience.\n&gt; If I told a psychiatrist he would shout schizo. I think people receive\n&gt; messages from their radio all the time, but in another way. That is\n&gt; advertising. But I was in the car and kept pushing the different buttons for\n&gt; the different radio stations. I felt like I was being communicated to. With\n&gt; strange gifts, perhaps I knew when to change the station. Anyways, maybe\n&gt; there is something to this. I am excited to work on my own projects when the\n&gt; house is put together and I have more funds.\n&gt; And Snowfire, I will pray. Thank you for your kind words.\n&gt; Jennifer\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Frank Sumption\n&gt; &lt;purplealiengirl@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; This i sabout as the car tuenr boxes get, at least for me, lost of noise.\n&gt; &gt;\n&gt; &gt; F-S\n&gt; &gt;\n&gt;\n&gt; \n&gt;\n\nAmazing how many wo ds and le e s I lea e ou , need o emembe spell check! \n \nYeah, he en i ies seem o like he ca une s as well. Abou   he only di e ence is he an enna inpu ,  he ca une s don' use he e i e od an enna, hey use a uned RF ampli ie on end. RF= adio equency. \n\n \n F-S\nOn Wed, Jun 9, 2010 a 5:38 PM, jenni e 3eyeso wisdom@...> w o e:\n\n  \n\n\n\nThe e migh be some hing o he ca une s. I had a e y wei d expe ience. I I old a psychia is he would shou schizo. I hink people ecei e messages om hei adio all he ime, bu in ano he way. Tha is ad e ising. Bu I was in he ca and kep pushing he di e en bu ons o he di e en adio s a ions. I el like I was being communica ed o. Wi h s ange gi s, pe haps I knew when o change he s a ion. Anyways, maybe he e is some hing o his. I am exci ed o wo k on my own p ojec s when he house is pu oge he and I ha e mo e unds.\nAnd Snow i e, I will p ay. Thank you o you kind wo ds.Jenni e --- In EVP-ITC@yahoog oups.com, F ank Sump ion w o e:\n>> This i sabou as he ca uen boxes ge , a leas o me, los o noise.> > F-S>"}