{"id": "1767", "subject": "FW: Re: Guess they want it shared!", "author": "Frank Sumption", "timestamp": "2007-08-02T21:13:55Z", "full_text": "Piece of cake! The boxes are pretty much ready, it requires only \nconnecting the box line out to the sound card input, and sending out \nover the internet, which I have no idea how to do the soft ware \npart, but the guy that suggested seems to. \n\n I&#39;m sure that people in different locations would get different \nmessages although, presumalby, the box was outputing only a single \nstream of information. \n\n This is something to be excited about. It could be just weeks away.\n\n  \n Frank-S\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;Travis&quot; &lt;vampire2kd@...&gt; wrote:\n&gt;\n&gt; Thats an awesome idea. imagine though its streaming live across \ncables\n&gt; throughout the states. The possibility of the audio being further\n&gt; influenced is greater Im sure. Reminds me of when a radio show was\n&gt; being done on evps people recording the show played it back later \nto\n&gt; listen again and heard messages to them during the play back and \nthis\n&gt; was being reported from tons of people. So its pretty interesting \nif\n&gt; you can actually have this done, cant wait to see what happens.\n&gt; \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Frank Sumption&quot; &lt;franks-boxes@&gt; \nwrote:\n&gt; &gt;\n&gt; &gt; It&#39;s like DAH!!! Why I not think about this!? Setup an internet \nserver \n&gt; &gt; (somehow) and connect a box to the internet to run 24/7----LIVE. \nOr\n&gt; make \n&gt; &gt; coordinated short tests so remote reception can be compared to\n&gt; local. It \n&gt; &gt; would be an easy task to make modes and bands switchable \nremotely as\n&gt; well. \n&gt; &gt; What about multiple boxes?\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; Just imagine, a box accessible to the world 24 hours a day, seven\n&gt; days a \n&gt; &gt; week! It staggers the imagination! Given the nature of the \nvoices and \n&gt; &gt; contacts, I wouldn&#39;t be surprised if several people could access \nthe\n&gt; system \n&gt; &gt; at the exact same time, yet all receive personal communications.\n&gt; &gt; \n&gt; &gt; Guess that would create wee ripple in the darkside!!\n&gt; &gt; \n&gt; &gt; I wasn&#39;t sure if the originator of the idea wanted his name out\n&gt; there, I \n&gt; &gt; took it off.\n&gt; &gt; \n&gt; &gt; Frank-S\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt;\n&gt; &gt; &gt;To: &quot;Frank Sumption&quot; &lt;franks-boxes@&gt;\n&gt; &gt; &gt;Subject: Re: Guess they want it shared!\n&gt; &gt; &gt;Date: Thu, 02 Aug 2007 05:56:16 -0000\n&gt; &gt; &gt;\n&gt; &gt; &gt;--- In EVP-ITC@yahoogroups.com, &quot;Frank Sumption&quot; &lt;franks-\nboxes@&gt; wrote:\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; There&#39;s no way I can stop making boxes, I just don&#39;t have the\n&gt; &gt; &gt;resuources to\n&gt; &gt; &gt; &gt; supply them to everyone that wants at this time, plus trying \not find\n&gt; &gt; &gt;waay to\n&gt; &gt; &gt; &gt; make the things more better. I am no engineer, and it takes a\n&gt; while to\n&gt; &gt; &gt; &gt; figure things out--as with all aspects of this life.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Frank-S\n&gt; &gt; &gt;\n&gt; &gt; &gt;Hey Frank,\n&gt; &gt; &gt;\n&gt; &gt; &gt;Its me again\n&gt; &gt; &gt;\n&gt; &gt; &gt;I haven&#39;t had much time to work on ITC lately but I&#39;m \ninterested in\n&gt; &gt; &gt;taking a slightly different approach using a quantum random \nnumber\n&gt; &gt; &gt;generator (unless its cost prohibitive) and computer (hoping it\n&gt; &gt; &gt;doesn&#39;t get fried).\n&gt; &gt; &gt;\n&gt; &gt; &gt;But... what are your thoughts on this:\n&gt; &gt; &gt;\n&gt; &gt; &gt;What if we hooked up one of your boxes to the internet for \nremote\n&gt; &gt; &gt;users to attempt interaction with?  Leaning on the non-locality \ntheory.\n&gt; &gt; &gt;\n&gt; &gt; &gt;Couple things I&#39;m wondering about, assuming it works:\n&gt; &gt; &gt;\n&gt; &gt; &gt;- Would the box work &quot;better&quot; physically present at a &quot;high \nenergy&quot;\n&gt; &gt; &gt;location?  I&#39;m refering to locations on Earth that are known to \nbe\n&gt; &gt; &gt;high energy from lay lines, etc. &quot;portals&quot;.\n&gt; &gt; &gt;- Will the recorded audio from your box be the same recorded or \nheard\n&gt; &gt; &gt;audio at the remote location?  Meaning will the EVP be \nrecordable at\n&gt; &gt; &gt;your location or only the remote users location?  Or if both, \nwill\n&gt; &gt; &gt;they match?\n&gt; &gt; &gt;\n&gt; &gt; &gt;Just some things I&#39;ve been thinking about lately.  Curious what \nyou\n&gt; think.\n&gt; &gt; &gt;\n&gt; &gt; &gt;Thanks,\n&gt; &gt; \n&gt; &gt; &gt;\n&gt; &gt; \n&gt; &gt; _________________________________________________________________\n&gt; &gt; Tease your brain--play Clink! Win cool prizes! \n&gt; &gt; http://club.live.com/clink.aspx?icid=clink_hotmailtextlink2\n&gt; &gt;\n&gt;"}