{"id": "17676", "subject": "Re: [EVP-ITC] Re: Tesing-testing", "author": "Frank Sumption", "timestamp": "2010-06-14T15:38:28Z", "full_text": "Sorry, just tired of trying to defnd this stuff to self proclaimed skeptics\nthat accept absolutely no evidence, and catagorically ignore/reject every\nresearchers EVP and results.\n\n I&#39;ll post what I got Friday, even it doesn&#39;t mean anything.\n\n F-S\n\nOn Mon, Jun 14, 2010 at 9:18 AM, Rj &lt;rasterer@yahoo.com&gt; wrote:\n\n&gt;\n&gt;\n&gt;\n&gt; Well, I was going to try to objectively compare your statements to anything\n&gt; that might happen on Thursday.  Why get so defensive over that?\n&gt;\n&gt; And why not just post the full details?  It&#39;s not really a prediction if\n&gt; you post the details after the fact.  Something a little better than\n&gt; &quot;Wait... Navy&quot;, which says nothing really.\n&gt;\n&gt;\n&gt;\n&gt; --- On *Mon, 6/14/10, Frank Sumption &lt;purplealiengirl@...&gt;* wrote:\n&gt;\n&gt;\n&gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt; Subject: Re: [EVP-ITC] Re: Tesing-testing\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Monday, June 14, 2010, 8:04 AM\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;  So you&#39;re just sitting there with baited breath hoping and praying nothing\n&gt; will happen so you can puff out chest and say see I told you it&#39;s all BS.\n&gt;\n&gt;  I do have more information for the date, but not posting till afterwards.\n&gt; If it&#39;s real, I don&#39;t want it getting out to soon.  I did tell a couple\n&gt; others so you can&#39;t claim it&#39;s prediction after the fact. Doesn&#39;t matter\n&gt; though, cuz the skeptics ignore all facts anyway.\n&gt;\n&gt;  F-S\n&gt;\n&gt; On Mon, Jun 14, 2010 at 8:40 AM, rasterer &lt;rasterer@yahoo. com&lt;http://mc/compose?to=rasterer@...&gt;\n&gt; &gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; BTW, the 17th is this coming Thursday.\n&gt;&gt;\n&gt;&gt; --- In EVP-ITC@yahoogroups .com&lt;http://mc/compose?to=EVP-ITC%40yahoogroups.com&gt;,\n&gt;&gt; Frank Sumption &lt;purplealiengirl@ ...&gt; wrote:\n&gt;&gt; &gt;\n&gt;&gt; &gt; Starts out &quot;next month the 17th&quot; Don&#39;t know what that is, but I&#39;ve heard\n&gt;&gt; it\n&gt;&gt; &gt; several times in various recordings. But wait, this is AM, where&#39;s the\n&gt;&gt; usual\n&gt;&gt; &gt; interference? At 5 seconds &quot;Wait---Navy&quot;, maybe that has to do with the\n&gt;&gt; old\n&gt;&gt; &gt; disaster.\n&gt;&gt; &gt;\n&gt;&gt; &gt; Oh crap! I forgot to ask for the scientfic aproval before posting.\n&gt;&gt; &gt; Admittedly, I was being mean spirited on purpose, I&#39;m not going to allow\n&gt;&gt; &gt; some science dork to brow beat me into submission. I believe the home\n&gt;&gt; page\n&gt;&gt; &gt; of EVP-ITC says something to the effect that we don&#39;t follow science,\n&gt;&gt; this\n&gt;&gt; &gt; is for sharing information, and using the cut and try method, see what\n&gt;&gt; &gt; works. I know everyone hears different, and that&#39;s ok, that does not\n&gt;&gt; &gt; invalidate this stuff. My apologies for ruffling feathers.\n&gt;&gt; &gt;\n&gt;&gt; &gt; F-S\n&gt;&gt; &gt;\n&gt;&gt;\n&gt;&gt;\n&gt;\n&gt; \n&gt;\n\nSo y, jus i ed o ying o de nd his s u o sel p oclaimed skep ics ha accep absolu ely no e idence, and ca ago ically igno e/ ejec e e y esea che s EVP and esul s. \n \n I'll pos wha I go F iday, e en i doesn' mean any hing. \n \n F-S\nOn Mon, Jun 14, 2010 a 9:18 AM, Rj as e e @...> w o e:\n\n  \n\n\n\n\n\n\n\nWell, I was going o y o objec i ely compa e you s a emen s o any hing ha migh happen on Thu sday.  Why ge so de ensi e o e ha ?And why no jus pos he ull de ails?  I 's no eally a p edic ion i you pos he de ails a e he ac .  Some hing a li le be e han \"Wai ... Na y\", which says no hing eally.\n --- On Mon, 6/14/10, F ank Sump ion pu plealiengi l@...> w o e:\nF om: F ank Sump ion pu plealiengi l@gmail.com>Subjec : Re: [EVP-ITC] Re: Tesing- es ing\nTo: EVP-ITC@yahoog oups.comDa e: Monday, June 14, 2010, 8:04 AM \n\n  \n\n\n So you' e jus si ing he e wi h bai ed b ea h hoping and p aying no hing will happen so you can pu ou ches and say see I old you i 's all BS. \n \n I do ha e mo e in o ma ion o he da e, bu no pos ing ill a e wa ds. I i 's eal, I don' wan i ge ing ou o soon.  I did ell a couple o he s so you can' claim i 's p edic ion a e he ac . Doesn' ma e hough, cuz he skep ics igno e all ac s anyway. \n\n \n F-S\nOn Mon, Jun 14, 2010 a 8:40 AM, as e e as e e @yahoo. com> w o e:\n\n  \n\n\n\nBTW, he 17 h is his coming Thu sday.--- In EVP-ITC@yahoog oups .com, F ank Sump ion w o e:\n>> S a s ou \"nex mon h he 17 h\" Don' know wha ha is, bu I' e hea d i > se e al imes in a ious eco dings. Bu wai , his is AM, whe e's he usual> in e e ence? A 5 seconds \"Wai ---Na y\", maybe ha has o do wi h he old\n> disas e .> > Oh c ap! I o go o ask o he scien ic ap o al be o e pos ing.> Admi edly, I was being mean spi i ed on pu pose, I'm no going o allow> some science do k o b ow bea me in o submission. I belie e he home page\n> o EVP-ITC says some hing o he e ec ha we don' ollow science, his> is o sha ing in o ma ion, and using he cu and y me hod, see wha > wo ks. I know e e yone hea s di e en , and ha 's ok, ha does no \n> in alida e his s u . My apologies o u ling ea he s.> > F-S>"}