{"id": "17689", "subject": "Re: Tesing-testing", "author": "Fiona Broome", "timestamp": "2010-06-16T15:11:36Z", "full_text": "Hi,\n\nIt seems to me that there&#39;s plenty of room for individuality and personal opinion.  \n\nHowever, I&#39;m not sure if everyone understands that this is a Yahoo Group.  It&#39;s not a democracy and it&#39;s not an anarchy... it&#39;s whatever the group Owner/Moderator decides it is.\n\nFrank started this group.  Frank stated the rules pretty clearly on the homepage. I didn&#39;t join with the idea that the rules were optional, or open for discussion.  (I&#39;ve been running a few non-paranormal Yahoo Groups since the late 1990s, and Frank is vastly more tolerant than I am.)\n\nI&#39;m here to learn what Frank and others are discovering with various audio devices. Until I heard Chris Moon working with a box in Canada, I was a fairly rabid skeptic regarding this subject. Now, I&#39;m eager to learn everything that I can about how this works.  (I rarely do 180-degree turns like that.)\n\nThe interruptions by critics -- leaping in rather prematurely, in my opinion -- are about as annoying as the flashes of apparently useless noise that interrupt the box and recordings.  \n\nI don&#39;t see Frank being defensive about the possible theories involved, but keeping the group on track. I appreciate that. I nearly quit the group shortly after joining, because I don&#39;t have time to read snarks and flames... only interesting questions and results. \n\nI&#39;m sorry that you don&#39;t hear anything extraordinary (and very clear) in at least some of the recordings. I&#39;m not sure if you&#39;re asking for help, or what your purpose is with these comments.\n\nSincerely,\nFiona\n\n--- In EVP-ITC@yahoogroups.com, Rj &lt;rasterer@...&gt; wrote:\n&gt;\n&gt; You claim I don&#39;t listen to any of this stuff because I can&#39;t take the chance I might hear something.  I do listen to some of them.   I hear stuff.  But I don&#39;t hear anything that I can&#39;t explain by simple pareidolia or random radio transmissions. So you&#39;re wrong there.\n&gt; \n&gt; In fact, to try to control for my own pareidolia, that is why I suggest the files not be labeled or explained.  That would help make listening to them a little less likely to be influenced by the perceptions of others, or made to &quot;fit their personal expectation&quot; as you noted.\n&gt; \n&gt; I continue to be at a loss as to why Frank is so defensive when people disagree with him.  If I don&#39;t listen or comment, Frank attacks me.  If I do listen and \n&gt; comment, Frank attacks me.  Is there no room for individuality and personal opinion? \n&gt;"}