{"id": "17688", "subject": "Re: Tesing-testing", "author": "Fiona Broome", "timestamp": "2010-06-16T14:46:54Z", "full_text": "Hi,\n\nI hear &quot;date is&quot; then &quot;Hebron,&quot; very clearly.  Then there&#39;s something I still can&#39;t get -- two words -- and the word &quot;run&quot; (or something like it) seems to be in there.  After that, it&#39;s too choppy for me to understand.  \n\nHowever, my experiences so far have been a few Shack Hack sessions, only one of which impressed me, as well as listening to Chris Moon&#39;s conversations with a Frank&#39;s box in Canada during May.  The box spoke so clearly in Canada, I&#39;m still astonished.\n\nSo, I don&#39;t have enough experience with EVP/ITC to identify anything except the most clear voices and speech.\n\nWhat I listened for in this recording was what I heard in Canada, and what I&#39;ve heard on several recordings posted to this list: A consistent voice in terms of tone, accent, and speech patterns.\n\nIn this recording, &quot;Date is,&quot; &quot;Hebron,&quot; and something before (and including) the word &quot;run&quot; all sound consistent to me. I&#39;m hearing that exact same voice tone (male) towards the end of the recording, but I just can&#39;t make out the words.  I hear a K sound, but that&#39;s all I can say for sure.\n\nMeanwhile, at the PEAR/Global Consciousness project, I&#39;m seeing more downward spikes than normal, as of Monday.  (Tuesday&#39;s data isn&#39;t online yet, but yesterday&#39;s movie was pretty good. Watch the egg blips around South America and Japan.)\n\nI&#39;m not sure if this is enough to signify an event about to happen.  Usually, the numbers make the most sense in hindsight.  That&#39;s part of the learning curve as people try to understand what&#39;s causing the RNG spikes.\n\nFor those who just can&#39;t get enough predictive intrigue, there&#39;s also a linguistic-based anomaly study, the Web Bot project, http://en.wikipedia.org/wiki/Web_Bot (further explained at http://www.halfpasthuman.com/altaprocess.html )\n\nAccording to Wikipedia, July 8th is predicted as significant.  I don&#39;t have the current Shape report (http://www.halfpasthuman.com/), so I don&#39;t know what (if anything) they&#39;ve predicted for June.\n\nI hardly ever watch the news, but I may start watching for a few days, out of curiosity.\n\nIt&#39;s funny, but watching for events around the 17th has some of the anticipation of the first day of school, with a hefty dose of similar anxieties as well.\n\nCheerfully,\nFiona\n\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt; I don&#39;t know! To me it sounds like a military operation, but who knows.\n&gt; We&#39;ll do a little test, see if anyone else the world hears what I do.\n&gt; \n&gt;  Frank-S\n&gt;"}