{"id": "17680", "subject": "Re: [EVP-ITC] Re: Tesing-testing", "author": "Frank Sumption", "timestamp": "2010-06-15T05:09:52Z", "full_text": "I don&#39;t know! To me it sounds like a military operation, but who knows.\nWe&#39;ll do a little test, see if anyone else the world hears what I do.\n\n Frank-S\n\nOn Mon, Jun 14, 2010 at 11:12 AM, Rj &lt;rasterer@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;   My two cents then:  it depends on the purpose of the announcement how\n&gt; best to go about the experiment.  If the purpose is to confirm to yourself\n&gt; or others that this was a valid prediction, or be able to make a case for\n&gt; there being something to this ITC stuff, or to have a prediction you can\n&gt; wave in the face of them darned skepdicks, then specifics have to be\n&gt; presented before the event.\n&gt;\n&gt; If the purpose is not to do any of those things, but just try to see for\n&gt; yourself &#39;what works&#39;, then it doesn&#39;t much matter whether you give details\n&gt; after the event, or even bothering announcing the event at all.\n&gt;\n&gt; So the only confusing part is why announce the event at all, if no details\n&gt; are given before it takes place?  Besides, if the details might help save\n&gt; someone from harm, it would be really a bad thing to do to keep them to\n&gt; yourself, wouldn&#39;t it?\n&gt;\n&gt; Personally, if I thought I was getting predictions of future events that\n&gt; might cause harm to someone, I&#39;d be posting those details far and wide, in\n&gt; the hope of helping who I can.  Not doing that... well, I just hope the\n&gt; person doesn&#39;t believe in karma.\n&gt;\n&gt; --- On *Mon, 6/14/10, Fiona Broome &lt;email@...&gt;* wrote:\n&gt;\n&gt;\n&gt; From: Fiona Broome &lt;email@...&gt;\n&gt; Subject: [EVP-ITC] Re: Tesing-testing\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Monday, June 14, 2010, 9:19 AM\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Hi,\n&gt;\n&gt; Well, here&#39;s my two cents:\n&gt;\n&gt; If we want to rule out as much &quot;observer&quot; interference -- whether PK or\n&gt; whatever -- the fewer details we know, the better.\n&gt;\n&gt; So, I&#39;m happy with a date, period. I trust Frank&#39;s integrity to tell me if\n&gt; the event (if any happens) is a reasonable match, or not.\n&gt;\n&gt; I&#39;d rather stumble onto the event on my own, than be accused of trying to\n&gt; mold the event -- or selectively focus on just certain aspects of it -- to\n&gt; fit criteria known ahead of time.\n&gt;\n&gt; That&#39;s why I like things like the PEAR project (aka Global Consciousness\n&gt; Project); it&#39;s just numbers. If and how it correlates... that&#39;s what gets\n&gt; interesting.\n&gt;\n&gt; Cheerfully,\n&gt; Fiona\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com&lt;http://mc/compose?to=EVP-ITC%40yahoogroups.com&gt;,\n&gt; Rj &lt;rasterer@...&gt; wrote:\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Well, I was going to try to objectively compare your statements to\n&gt; anything that might happen on Thursday.Â  Why get so defensive over that?\n&gt; &gt;\n&gt; &gt; And why not just post the full details?Â  It&#39;s not really a prediction if\n&gt; you post the details after the fact.Â  Something a little better than\n&gt; &quot;Wait... Navy&quot;, which says nothing really.\n&gt; &gt;\n&gt; &gt; Â\n&gt; &gt;\n&gt;\n&gt;\n&gt; \n&gt;\n\nI don' know! To me i sounds like a mili a y ope a ion, bu who knows. We'll do a li le es , see i anyone else he wo ld hea s wha I do. \n \n F ank-S\nOn Mon, Jun 14, 2010 a 11:12 AM, Rj as e e @...> w o e:\n\n  \n\n\n\n\n\n\n\nMy wo cen s hen:  i depends on he pu pose o he announcemen how bes o go abou he expe imen .  I he pu pose is o con i m o you sel o o he s ha his was a alid p edic ion, o be able o make a case o he e being some hing o his ITC s u , o o ha e a p edic ion you can wa e in he ace o hem da ned skepdicks, hen speci ics ha e o be p esen ed be o e he e en .\nI he pu pose is no o do any o hose hings, bu jus y o see o you sel 'wha wo ks', hen i doesn' much ma e whe he you gi e de ails a e he e en , o e en bo he ing announcing he e en a all.\nSo he only con using pa is why announce he e en a all, i no de ails a e gi en be o e i akes place?  Besides, i he de ails migh help sa e someone om ha m, i would be eally a bad hing o do o keep hem o you sel , wouldn' i ?\nPe sonally, i I hough I was ge ing p edic ions o u u e e en s ha migh cause ha m o someone, I'd be pos ing hose de ails a and wide, in he hope o helping who I can.  No doing ha ... well, I jus hope he pe son doesn' belie e in ka ma.\n--- On Mon, 6/14/10, Fiona B oome email@...> w o e:\nF om: Fiona B oome email@...>Subjec : [EVP-ITC] Re: Tesing- es ing \nTo: EVP-ITC@yahoog oups.comDa e: Monday, June 14, 2010, 9:19 AM \n\n  \n\nHi,Well, he e's my wo cen s:I we wan o ule ou as much \"obse e \" in e e ence -- whe he PK o wha e e -- he ewe de ails we know, he be e .So, I'm happy wi h a da e, pe iod. I us F ank's in eg i y o ell me i he e en (i any happens) is a easonable ma ch, o no .\nI'd a he s umble on o he e en on my own, han be accused o ying o mold he e en -- o selec i ely ocus on jus ce ain aspec s o i -- o i c i e ia known ahead o ime.Tha 's why I like hings like he PEAR p ojec (aka Global Consciousness P ojec ); i 's jus numbe s. I and how i co ela es... ha 's wha ge s in e es ing.\nChee ully,Fiona--- In EVP-ITC@yahoog oups.com, Rj w o e:>> > Well, I was going o y o objec i ely compa e you s a emen s o any hing ha migh happen on Thu sday.Â  Why ge so de ensi e o e ha ?\n> > And why no jus pos he ull de ails?Â  I 's no eally a p edic ion i you pos he de ails a e he ac .Â  Some hing a li le be e han \"Wai ... Na y\", which says no hing eally.> \n> Â >"}