{"id": "17696", "subject": "Re: Tesing-testing", "author": "rasterer", "timestamp": "2010-06-17T14:22:09Z", "full_text": "To answer your question to me, yes I suppose pareidolia could apply to reading, if the text was blurry or water-damaged or broken up or something (like radio sounds), and someone was trying to figure out what it said.  In those cases, different people could get different things, and not all could be correct.\n\nAlso, you mentioned &quot;it seems to evaporate when one tries to pin it down.&quot;  To me, pin-it-down means to test it well, under good controlled conditions, to greatly reduce the possibility of coincidence and subjective interpretation.  So, if &quot;it seems to evaporate when one tries to pin it down&quot;, then no wonder people don&#39;t accept the messages and information others call &#39;validated&#39;.\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  sooooo, is pareidolia just an auditory thing, or does that apply to reading as well?\n&gt; \n&gt;  This stuff ain&#39;t gospel, as I&#39;ve said over and over, it gets confusing. We get messages and information that can often be validated, which is enough to &quot;prove&quot; to most of us that something is going on, but it seems to evaporate when one tries to pin it down. Just this moring I hear a &quot;voice&quot; from tape talking about the 17th, &quot; you&#39;ll be making a big jump&quot;, back the tape up, and hear rhe same voice &quot;quit making all the jokes&quot;--so, which is it?\n&gt; \n&gt;  As for the 17th, I&#39;ve learned not to hold my breath waiting for something to land. \n&gt; \n&gt;  I get more than alittle annoyed by people that act like this stuff is all cut and dried, all perfectly understood, and known--all easily explained. \n&gt; \n&gt;  F-S\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Rj &lt;rasterer@&gt; wrote:\n&gt; &gt;\n&gt; &gt; You claim I don&#39;t listen to any of this stuff because I can&#39;t take the chance I might hear something.  I do listen to some of them.   I hear stuff.  But I don&#39;t hear anything that I can&#39;t explain by simple pareidolia or random radio transmissions. So you&#39;re wrong there.\n&gt; &gt; \n&gt; &gt; In fact, to try to control for my own pareidolia, that is why I suggest the files not be labeled or explained.  That would help make listening to them a little less likely to be influenced by the perceptions of others, or made to &quot;fit their personal expectation&quot; as you noted.\n&gt; &gt; \n&gt; &gt; I continue to be at a loss as to why Frank is so defensive when people disagree with him.  If I don&#39;t listen or comment, Frank attacks me.  If I do listen and \n&gt; &gt; comment, Frank attacks me.  Is there no room for individuality and personal opinion? \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; --- On Wed, 6/16/10, purplespacefriend &lt;purplealiengirl@&gt; wrote:\n&gt; &gt; \n&gt; &gt; From: purplespacefriend &lt;purplealiengirl@&gt;\n&gt; &gt; Subject: [EVP-ITC] Re: Tesing-testing\n&gt; &gt; To: EVP-ITC@yahoogroups.com\n&gt; &gt; Date: Wednesday, June 16, 2010, 6:50 AM\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt;  \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt;   \n&gt; &gt; \n&gt; &gt; \n&gt; &gt;     \n&gt; &gt;       \n&gt; &gt;       \n&gt; &gt;        I got your two cents! Post the freaking voice, unlabeled and not even a comment from the self proclaimed science dorks. Won&#39;t even give it try, to GD busy telling everyone what this stuff really is. Y0ou can&#39;t even listen to any of this stuff cuz yopu can not takle the chance you might hear someyhting. The rest, they are so locked up in the ghost hunter mentality they can&#39;t hear anything else.\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; I don&#39;t care if no one hear this shit, but not listen, or to say it said something else! That is number one probelm wiht this craop, everyone wnats it to fit their personal expectations, and  only they can be the world&#39;s expert.\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; I&#39;m not sure what I expect, but enough is enough.  No wonder the skeptdicks eat this crap up!\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, Rj &lt;rasterer@&gt; wrote:\n&gt; &gt; \n&gt; &gt; &gt;\n&gt; &gt; \n&gt; &gt; &gt; My two cents then:Â  it depends on the purpose of the announcement how best to go about the experiment.Â  If the purpose is to confirm to yourself or others that this was a valid prediction, or be able to make a case for there being something to this ITC stuff, or to have a prediction you can wave in the face of them darned skepdicks, then specifics have to be presented before the event.\n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; If the purpose is not to do any of those things, but just try to see for yourself &#39;what works&#39;, then it doesn&#39;t much matter whether you give details after the event, or even bothering announcing the event at all.\n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; So the only confusing part is why announce the event at all, if no details are given before it takes place?Â  Besides, if the details might help save someone from harm, it would be really a bad thing to do to keep them to yourself, wouldn&#39;t it?\n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; Personally, if I thought I was getting predictions of future events that might cause harm to someone, I&#39;d be posting those details far and wide, in the hope of helping who I can.Â  Not doing that... well, I just hope the person doesn&#39;t believe in karma.\n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; --- On Mon, 6/14/10, Fiona Broome &lt;email@&gt; wrote:\n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; From: Fiona Broome &lt;email@&gt;\n&gt; &gt; \n&gt; &gt; &gt; Subject: [EVP-ITC] Re: Tesing-testing\n&gt; &gt; \n&gt; &gt; &gt; To: EVP-ITC@yahoogroups.com\n&gt; &gt; \n&gt; &gt; &gt; Date: Monday, June 14, 2010, 9:19 AM\n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; Â \n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt;   \n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt;     \n&gt; &gt; \n&gt; &gt; &gt;       \n&gt; &gt; \n&gt; &gt; &gt;       \n&gt; &gt; \n&gt; &gt; &gt;       Hi,\n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; Well, here&#39;s my two cents:\n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; If we want to rule out as much &quot;observer&quot; interference -- whether PK or whatever -- the fewer details we know, the better.\n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; So, I&#39;m happy with a date, period.  I trust Frank&#39;s integrity to tell me if the event (if any happens) is a reasonable match, or not.\n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; I&#39;d rather stumble onto the event on my own, than be accused of trying to mold the event -- or selectively focus on just certain aspects of it -- to fit criteria known ahead of time.\n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; That&#39;s why I like things like the PEAR project (aka Global Consciousness Project); it&#39;s just numbers.  If and how it correlates... that&#39;s what gets interesting.\n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; Cheerfully,\n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; Fiona\n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com, Rj &lt;rasterer@&gt; wrote:\n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; &gt;\n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; &gt; Well, I was going to try to objectively compare your statements to anything that might happen on Thursday.Ã‚Â  Why get so defensive over that?\n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; &gt; And why not just post the full details?Ã‚Â  It&#39;s not really a prediction if you post the details after the fact.Ã‚Â  Something a little better than &quot;Wait... Navy&quot;, which says nothing really.\n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; &gt; Ã‚Â \n&gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; &gt; &gt;\n&gt; &gt; \n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}