{"id": "17705", "subject": "Re: [EVP-ITC] Re: Tesing-testing", "author": "Zack Widup", "timestamp": "2010-06-17T14:51:43Z", "full_text": "This all seems simple to me. If you&#39;re going to put up a recording for\nothers to listen to, others listen to it. They either hear it, they hear\nsomething different, or they hear nothing. And they say so. That doesn&#39;t\nmake less of what you hear. You hear what you hear. You&#39;re free to assert\nwhat you hear or change your mind and say it&#39;s something else later on.\n\nIt seems to me that&#39;s all we&#39;re doing at this point. I&#39;m not going to get\ninto a discussion of where the sounds came from or what they mean, I&#39;d just\nsay yes I heard it or no I didn&#39;t ot I heard something else.\n\nIs that so difficult?\n\nZack\n\nOn Thu, Jun 17, 2010 at 9:28 AM, purplespacefriend &lt;\npurplealiengirl@gmail.com&gt; wrote:\n\n&gt;\n&gt;\n&gt; What you don&#39;t seem to get is that there is more to the individual than the\n&gt; physical body.\n&gt;\n&gt; Apparently reading what one wants to hear is also problem, and seems to ge\n&gt; huge problme with he these skeptics. This one convinced I&#39;m out to form a\n&gt; group of groupies, and she ignores all else.\n&gt;\n&gt; Guess we are not allowed to question out loud, or throw thoughts and\n&gt; theories out there for the consideration and comment of others. Sorry, not\n&gt; being from &quot;here&quot; I didn&#39;t learn all the social taboos of this primitive\n&gt; culture. I tried goose stepping once, it made my ankles hurt.\n&gt;\n&gt; I took the skeptics off moderation in a mistaken effort to be fair, but all\n&gt; this does is disrupt the conversation about what these voices are, and how\n&gt; to hear it and interpret it better. This group is not about how to explain\n&gt; all the inconvenient truths away.\n&gt;\n&gt; Frank-S\n&gt;\n&gt; \n&gt;\n\nThis all seems simple o me. I you' e going o pu up a eco ding o o he s o lis en o, o he s lis en o i . They ei he hea i , hey hea some hing di e en , o hey hea no hing. And hey say so. Tha doesn' make less o wha you hea . You hea wha you hea . You' e ee o asse wha you hea o change you mind and say i 's some hing else la e on.\n\n \nI seems o me ha 's all we' e doing a his poin . I'm no going o ge in o a discussion o whe e he sounds came om o wha hey mean, I'd jus say yes I hea d i o no I didn' o I hea d some hing else.\n\n \nIs ha so di icul ? \n \nZack\nOn Thu, Jun 17, 2010 a 9:28 AM, pu plespace iend pu plealiengi l@...> w o e:\n\n  \n\n\n\nWha you don' seem o ge is ha he e is mo e o he indi idual han he physical body. Appa en ly eading wha one wan s o hea is also p oblem, and seems o ge huge p oblme wi h he hese skep ics. This one con inced I'm ou o o m a g oup o g oupies, and she igno es all else.\nGuess we a e no allowed o ques ion ou loud, o h ow hough s and heo ies ou he e o he conside a ion and commen o o he s. So y, no being om \"he e\" I didn' lea n all he social aboos o his p imi i e cul u e. I ied goose s epping once, i made my ankles hu .\nI ook he skep ics o mode a ion in a mis aken e o o be ai , bu all his does is dis up he con e sa ion abou wha hese oices a e, and how o hea i and in e p e i be e . This g oup is no abou how o explain all he incon enien u hs away. \nF ank-S"}