{"id": "17706", "subject": "Re: [EVP-ITC] Re: Tesing-testing", "author": "Zack Widup", "timestamp": "2010-06-17T14:55:42Z", "full_text": "No one has any &quot;rights&quot; on a Yahoogroup other than what the group\nowner/moderators give them. Yahoogroups are international in scope. One\ngroup I&#39;m on has members in over 200 countries. The Constitution of the USA\ndoesn&#39;t apply to Yahoogroups.\n\nSome group owners are benevolent and will let anything go. Others are\ntyrants and ban someone at the slightest whim. Most are in between. I&#39;m on\none of the &quot;tyrant&quot; groups which maintains membership simply because it&#39;s\nthe only one doing what it&#39;s doing and it provides data the members consider\nvery valuable\nThis one is actually pretty good.\n\nZack\n\n\nOn Thu, Jun 17, 2010 at 9:35 AM, Lizzie Broden &lt;yahuli69@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;  Frank, you didnt let me post and took away my rights to do so.  You got\n&gt; no room to talk about such things.\n&gt;\n&gt; And even as of last night you posted that you were going to leave the\n&gt; board.  Yet here we are?\n&gt;\n&gt; Shit or get off the pot Frank!  Manke up your mind!  Do what you say and\n&gt; say what you mean!  Grow some balls!  Man up!\n&gt;\n&gt;\n&gt; &quot;Nature is showing us only the tail of the lion, but I have no doubt that\n&gt; the lion belongs to it even though, because of its large size, it cannot\n&gt; totally reveal itself all at once.&quot;\n&gt; -— Albert Einstein\n&gt;\n&gt;\n&gt; &quot;It is far better to grasp the universe as it really is than to persist in\n&gt; delusions, however satisfying and reassuring.&quot;\n&gt; --Carl Sagan\n&gt;\n&gt;\n&gt;  &quot;There is no such thing as an insignificant detail. Don&#39;t just look\n&gt; for what you want to find.&quot;\n&gt; -- Me LOL\n&gt;\n&gt;\n&gt;  ------------------------------\n&gt; *From:* purplespacefriend &lt;purplealiengirl@...&gt;\n&gt; *To:* EVP-ITC@yahoogroups.com\n&gt; *Sent:* Thu, June 17, 2010 9:28:22 AM\n&gt;\n&gt; *Subject:* [EVP-ITC] Re: Tesing-testing\n&gt;\n&gt;\n&gt;\n&gt; What you don&#39;t seem to get is that there is more to the individual than the\n&gt; physical body.\n&gt;\n&gt; Apparently reading what one wants to hear is also problem, and seems to ge\n&gt; huge problme with he these skeptics. This one convinced I&#39;m out to form a\n&gt; group of groupies, and she ignores all else.\n&gt;\n&gt; Guess we are not allowed to question out loud, or throw thoughts and\n&gt; theories out there for the consideration and comment of others. Sorry, not\n&gt; being from &quot;here&quot; I didn&#39;t learn all the social taboos of this primitive\n&gt; culture. I tried goose stepping once, it made my ankles hurt.\n&gt;\n&gt; I took the skeptics off moderation in a mistaken effort to be fair, but all\n&gt; this does is disrupt the conversation about what these voices are, and how\n&gt; to hear it and interpret it better. This group is not about how to explain\n&gt; all the inconvenient truths away.\n&gt;\n&gt; Frank-S\n&gt;\n&gt;\n&gt;  \n&gt;\n\nNo one has any \" igh s\" on a Yahoog oup o he han wha he g oup owne /mode a o s gi e hem. Yahoog oups a e in e na ional in scope. One g oup I'm on has membe s in o e 200 coun ies. The Cons i u ion o he USA doesn' apply o Yahoog oups.\n\n \nSome g oup owne s a e bene olen and will le any hing go. O he s a e y an s and ban someone a he sligh es whim. Mos a e in be ween. I'm on one o he \" y an \" g oups which main ains membe ship simply because i 's he only one doing wha i 's doing and i p o ides da a he membe s conside e y aluable\n\nThis one is ac ually p e y good.\n \nZack\n \nOn Thu, Jun 17, 2010 a 9:35 AM, Lizzie B oden yahuli69@...> w o e:\n\n  \n\n\n\n\n\n\nF ank, you didn le me pos and ook away my igh s o do so.  You go no oom o alk abou such hings.\n \nAnd e en as o las nigh you pos ed ha you we e going o lea e he boa d.  Ye he e we a e?\n \nShi o ge o he po  F ank!  Manke up you mind!  Do wha you say and say wha you mean!  G ow some balls!  Man up!\n\n \"Na u e is showing us only he ail o he lion, bu I ha e no doub ha he lion belongs o i e en hough, because o i s la ge size, i canno o ally e eal i sel all a once.\" -— Albe Eins ein \n\n\"I is a be e o g asp he uni e se as i eally is han o pe sis in delusions, howe e sa is ying and eassu ing.\"--Ca l Sagan\n\n\"The e is no such hing as an insigni ican de ail. Don' jus look o wha you wan o ind.\"-- Me LOL \n\n\n\n\n\nF om: pu plespace iend pu plealiengi l@...>To: EVP-ITC@yahoog oups.com\nSen : Thu, June 17, 2010 9:28:22 AM \nSubjec : [EVP-ITC] Re: Tesing- es ing  \n\nWha you don' seem o ge is ha he e is mo e o he indi idual han he physical body. \nAppa en ly eading wha one wan s o hea is also p oblem, and seems o ge huge p oblme wi h he hese skep ics. This one con inced I'm ou o o m a g oup o g oupies, and she igno es all else.\nGuess we a e no allowed o ques ion ou loud, o h ow hough s and heo ies ou he e o he conside a ion and commen o o he s. So y, no being om \"he e\" I didn' lea n all he social aboos o his p imi i e cul u e. I ied goose s epping once, i made my ankles hu .\nI ook he skep ics o mode a ion in a mis aken e o o be ai , bu all his does is dis up he con e sa ion abou wha hese oices a e, and how o hea i and in e p e i be e . This g oup is no abou how o explain all he incon enien u hs away. \nF ank-S"}