{"id": "17713", "subject": "Re: [EVP-ITC] Re: Tesing-testing", "author": "April Abercrombie", "timestamp": "2010-06-17T15:11:22Z", "full_text": "I don&#39;t want to believe...I want to KNOW.\n\nOn Thu, Jun 17, 2010 at 8:40 AM, Fiona Broome &lt;email@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Hi,\n&gt;\n&gt; Frank, you&#39;ve been fair... more fair than I&#39;d be, in a similar situation.\n&gt;\n&gt; I&#39;m not hearing anything new or interesting from the complainers and\n&gt; critics.\n&gt;\n&gt; I&#39;m here for conversations about... well, exactly what you said, &quot;what\n&gt; these voices are, and how to hear it and interpret it better.&quot;\n&gt;\n&gt; Might some of this be pareidolia? Of course. We&#39;re not stupid... or at\n&gt; least most of us aren&#39;t. Is ALL of it pareidolia? Not a chance.\n&gt;\n&gt; So let&#39;s get back to what&#39;s interesting: Searching for what the voices are,\n&gt; how to hear and interpret what they&#39;re saying, and which ones to take\n&gt; seriously. Let&#39;s find ways to hear them so even the most adamant skeptic\n&gt; must concede that something interesting is going on here.\n&gt;\n&gt; (Of course, the very fact that they&#39;re still reading this list suggests\n&gt; that, in their heart of hearts, they do find the voices interesting, and\n&gt; deeply want to believe.)\n&gt;\n&gt;\n&gt; Cheerfully,\n&gt; Fiona\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;,\n&gt; &quot;purplespacefriend&quot; &lt;purplealiengirl@...&gt; wrote:\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; I took the skeptics off moderation in a mistaken effort to be fair, but\n&gt; all this does is disrupt the conversation about what these voices are, and\n&gt; how to hear it and interpret it better. This group is not about how to\n&gt; explain all the inconvenient truths away.\n&gt; &gt;\n&gt; &gt; Frank-S\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nI don' wan o belie e...I wan o KNOW.On Thu, Jun 17, 2010 a 8:40 AM, Fiona B oome email@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n Hi,\n\nF ank, you' e been ai ... mo e ai han I'd be, in a simila si ua ion.\n\nI'm no hea ing any hing new o in e es ing om he complaine s and c i ics. \n\nI'm he e o con e sa ions abou ... well, exac ly wha you said, \"wha hese oices a e, and how o hea i and in e p e i be e .\"\n\nMigh some o his be pa eidolia? O cou se. We' e no s upid... o a leas mos o us a en' . Is ALL o i pa eidolia? No a chance.\n\nSo le 's ge back o wha 's in e es ing: Sea ching o wha he oices a e, how o hea and in e p e wha hey' e saying, and which ones o ake se iously. Le 's ind ways o hea hem so e en he mos adaman skep ic mus concede ha some hing in e es ing is going on he e. \n\n\n(O cou se, he e y ac ha hey' e s ill eading his lis sugges s ha , in hei hea o hea s, hey do ind he oices in e es ing, and deeply wan o belie e.)\n\nChee ully,\nFiona\n\n--- In EVP-ITC@...m, \"pu plespace iend\" w o e:\n>\n> \n> I ook he skep ics o mode a ion in a mis aken e o o be ai , bu all his does is dis up he con e sa ion abou wha hese oices a e, and how o hea i and in e p e i be e . This g oup is no abou how o explain all he incon enien u hs away. \n\n> \n> F ank-S\n>"}