{"id": "17714", "subject": "Re: Tesing-testing", "author": "purplespacefriend", "timestamp": "2010-06-17T15:14:10Z", "full_text": "I think these rapid postings don&#39;t show up in order. Anyway, thanks for the support, and I don&#39;t think I&#39;ll be so tolerant of the disrespectful, nasty negatives in the future.  \n\n It is ok to question, and to point out flaws in brain wiring, but attacks are not ok. \n\n F-S\n\n--- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  Yep! enough is enough!\n&gt; \n&gt;  F-S\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Lizzie Broden &lt;yahuli69@&gt; wrote:\n&gt; &gt;\n&gt; &gt; &quot;I know that I heard voices with Chris Moon that I absolutely, positively cannot explain&quot;\n&gt; &gt; \n&gt; &gt; Just how much did that cost you?\n&gt; &gt; \n&gt; &gt; And here is another problem Frank, your name is associated with well known charlatans, con-artists, frauds, fly by night people looking to make a buck off a sucker.  \n&gt; &gt; \n&gt; &gt; Your name, your product & your reputation.  Yet you do squat about it.  Why is that Frank?  Your name is dragged  through the mud by people like Moon (not his real name) and you just let it happen, why?  People like this are making money hand over fist and screwing people that are in pain and real grief.  Why do you let this happen in your name?\n&gt; &gt;  &quot;Nature is showing us only the tail of the lion, but I have no doubt that the lion belongs to it even though, because of its large size, it cannot totally reveal itself all at once.&quot; \n&gt; &gt; -&quot; Albert Einstein \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; &quot;It is far better to grasp the universe as it really is than to persist in delusions, however satisfying and reassuring.&quot;\n&gt; &gt; --Carl Sagan\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; &quot;There is no such thing as an insignificant detail. Don&#39;t just look \n&gt; &gt; for what you want to find.&quot;\n&gt; &gt; -- Me LOL \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; ________________________________\n&gt; &gt; From: Fiona Broome &lt;email@&gt;\n&gt; &gt; To: EVP-ITC@yahoogroups.com\n&gt; &gt; Sent: Thu, June 17, 2010 9:25:12 AM\n&gt; &gt; Subject: [EVP-ITC] Re: Tesing-testing\n&gt; &gt; \n&gt; &gt;   \n&gt; &gt; Hello,\n&gt; &gt; \n&gt; &gt; Well, what makes all of this intriguing for me is exactly that: It&#39;s so difficult to explain.\n&gt; &gt; \n&gt; &gt; If all the answers were clear, I&#39;d have checked it out, said, &quot;Oh. That&#39;s what that is,&quot; and promptly quit this list.\n&gt; &gt; \n&gt; &gt; It&#39;s the mystery that keeps this interesting... wondering what the voices are, what the messages mean (and which ones are worth taking seriously), why some people seem to hear them better than others, and so on.\n&gt; &gt; \n&gt; &gt; I know that I heard voices with Chris Moon that I absolutely, positively cannot explain, except in terms of a parallel world/reality, or something like that. And the replies to what I was saying were completely illogical, if someone was trying to do a &quot;cold reading.&quot; \n&gt; &gt; \n&gt; &gt; So, for me it&#39;s a mystery, and a fascinating one!\n&gt; &gt; \n&gt; &gt; Cheerfully,\n&gt; &gt; Fiona\n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; &lt;purplealiengirl@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; ... \n&gt; &gt; &gt; \n&gt; &gt; &gt; I get more than alittle annoyed by people that act like this stuff is all cut and dried, all perfectly understood, and known--all easily explained. \n&gt; &gt; &gt; \n&gt; &gt; &gt; F-S\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}