{"id": "1771", "subject": "Re: [EVP-ITC] FW: Re: Guess they want it shared!", "author": "Frank Sumption", "timestamp": "2007-08-03T03:21:03Z", "full_text": "Yeah, that was brought up to me this evening, I didn&#39;t think about \nbandwidth!\nSo there&#39;s a copuple snags to work out.\nFrank\n\n\n&gt;From: Misty Dawn &lt;bulletbabea@...&gt;\n&gt;Reply-To: EVP-ITC@yahoogroups.com\n&gt;To: EVP-ITC@yahoogroups.com\n&gt;Subject: Re: [EVP-ITC] FW: Re: Guess they want it shared!\n&gt;Date: Thu, 2 Aug 2007 16:07:34 -0700 (PDT)\n&gt;\n&gt;Just make sure YOU arent paying for the website bandwith on that idea LOL. \n&gt;Sounds great though. A bit like \n&gt;http://www.dxzone.com/catalog/Internet_and_Radio/Online_Receivers/\n&gt;   with all thier online radio hams broadcasting over the ineternet but \n&gt;with a franks box spin on it. In most of them multiple users can tune in at \n&gt;the same time to whats going on..its who has control of the radio that is \n&gt;the problem when diff people want to listen to diff things.\n&gt;\n&gt;   I say go for it, we know they can modulate the sound on each users end \n&gt;so theres no reason why people shouldnt get results and responses. Ive \n&gt;heard them use online radios for contact recently, by modulating the sound \n&gt;being broadcast. They use peoples names so there is no doubting its being \n&gt;used to communicate.\n&gt;\n&gt;   Misty\n&gt;\n&gt;Frank Sumption &lt;franks-boxes@...&gt; wrote:\n&gt;           It&#39;s like DAH!!! Why I not think about this!? Setup an internet \n&gt;server\n&gt;(somehow) and connect a box to the internet to run 24/7----LIVE. Or make\n&gt;coordinated short tests so remote reception can be compared to local. It\n&gt;would be an easy task to make modes and bands switchable remotely as well.\n&gt;What about multiple boxes?\n&gt;\n&gt;Just imagine, a box accessible to the world 24 hours a day, seven days a\n&gt;week! It staggers the imagination! Given the nature of the voices and\n&gt;contacts, I wouldn&#39;t be surprised if several people could access the system\n&gt;at the exact same time, yet all receive personal communications.\n&gt;\n&gt;Guess that would create wee ripple in the darkside!!\n&gt;\n&gt;I wasn&#39;t sure if the originator of the idea wanted his name out there, I\n&gt;took it off.\n&gt;\n&gt;Frank-S\n&gt;\n&gt; &gt;\n&gt; &gt;To: &quot;Frank Sumption&quot; &lt;franks-boxes@...&gt;\n&gt; &gt;Subject: Re: Guess they want it shared!\n&gt; &gt;Date: Thu, 02 Aug 2007 05:56:16 -0000\n&gt; &gt;\n&gt; &gt;--- In EVP-ITC@yahoogroups.com, &quot;Frank Sumption&quot; &lt;franks-boxes@...&gt; \n&gt;wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; There&#39;s no way I can stop making boxes, I just don&#39;t have the\n&gt; &gt;resuources to\n&gt; &gt; &gt; supply them to everyone that wants at this time, plus trying ot find\n&gt; &gt;waay to\n&gt; &gt; &gt; make the things more better. I am no engineer, and it takes a while to\n&gt; &gt; &gt; figure things out--as with all aspects of this life.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Frank-S\n&gt; &gt;\n&gt; &gt;Hey Frank,\n&gt; &gt;\n&gt; &gt;Its me again\n&gt; &gt;\n&gt; &gt;I haven&#39;t had much time to work on ITC lately but I&#39;m interested in\n&gt; &gt;taking a slightly different approach using a quantum random number\n&gt; &gt;generator (unless its cost prohibitive) and computer (hoping it\n&gt; &gt;doesn&#39;t get fried).\n&gt; &gt;\n&gt; &gt;But... what are your thoughts on this:\n&gt; &gt;\n&gt; &gt;What if we hooked up one of your boxes to the internet for remote\n&gt; &gt;users to attempt interaction with? Leaning on the non-locality theory.\n&gt; &gt;\n&gt; &gt;Couple things I&#39;m wondering about, assuming it works:\n&gt; &gt;\n&gt; &gt;- Would the box work &quot;better&quot; physically present at a &quot;high energy&quot;\n&gt; &gt;location? I&#39;m refering to locations on Earth that are known to be\n&gt; &gt;high energy from lay lines, etc. &quot;portals&quot;.\n&gt; &gt;- Will the recorded audio from your box be the same recorded or heard\n&gt; &gt;audio at the remote location? Meaning will the EVP be recordable at\n&gt; &gt;your location or only the remote users location? Or if both, will\n&gt; &gt;they match?\n&gt; &gt;\n&gt; &gt;Just some things I&#39;ve been thinking about lately. Curious what you think.\n&gt; &gt;\n&gt; &gt;Thanks,\n&gt;\n&gt; &gt;\n&gt;\n&gt;__________________________________________________________\n&gt;Tease your brain--play Clink! Win cool prizes!\n&gt;http://club.live.com/clink.aspx?icid=clink_hotmailtextlink2\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;---------------------------------\n&gt;Fussy? Opinionated? Impossible to please? Perfect.  Join Yahoo!&#39;s user \n&gt;panel and lay it on us.\n\n_________________________________________________________________\nA new home for Mom, no cleanup required. All starts here. \nhttp://www.reallivemoms.com?ocid=TXT_TAGHM&loc=us"}