{"id": "17723", "subject": "Re: Tesing-testing", "author": "purplespacefriend", "timestamp": "2010-06-17T16:25:39Z", "full_text": "Well, if someone is doing this &quot;work&quot; as their sole source of income, I don&#39;t fault them, and there does seem to be a market, and no shortage of people seeking readings. \n\n One thing is certain, no Moon==no boxes. It was Moon that got this technology/technique out in the public. Also worth mentioning is Bill Chappell, who came up with the hack version. \n\n\n\n Frank-S\n\n\n\n--- In EVP-ITC@yahoogroups.com, Rj &lt;rasterer@...&gt; wrote:\n&gt;\n&gt; Mr Moon hosts seminars, at which, you may see him do public demonstrations.  But if you want a private reading.... $$$ (I&#39;ve heard several hundred dollars an hour, with discounts to conference atendees).\n&gt; \n&gt; So one suspects the public demonstrations probably help to acquire private clientele.\n&gt; \n&gt; \n&gt; \n&gt; --- On Thu, 6/17/10, Fiona Broome &lt;email@...&gt; wrote:\n&gt; \n&gt; From: Fiona Broome &lt;email@...&gt;\n&gt; Subject: [EVP-ITC] Re: Tesing-testing\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Thursday, June 17, 2010, 8:25 AM\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt;   \n&gt; \n&gt; \n&gt;     \n&gt;       \n&gt;       \n&gt;       Hi,\n&gt; \n&gt; \n&gt; \n&gt; Thank you, Frank!  \n&gt; \n&gt; \n&gt; \n&gt; And, to answer a reference to money: My experience with Chris Moon didn&#39;t cost a cent.  In fact, the box spoke to me from across a large room -- I&#39;d guess about 20 or 30 feet away and from a platform about 10 feet above me -- in a distinctive voice and speech pattern that I recognized immediately.  \n&gt; \n&gt; \n&gt; \n&gt; I&#39;d asked a rhetorical question. The box answered. That rattled me, big time.  After that, I stuck close to the box.  I wanted to hear more.\n&gt; \n&gt; \n&gt; \n&gt; However, at no time did this involve payment of any kind.  In fact, innate skeptic that I am (having been badly burned by one regrettable association), I watched Chris and Dina closely during the weekend.  I saw zero hustling or salesmanship. They never asked me for money, and have never asked me to talk about my experiences with the box.\n&gt; \n&gt; \n&gt; \n&gt; My interest in the boxes and this list are unabashedly self-serving:  I want to understand why some devices work better than others, why some of us hear them more clearly than others, who the voices really are (if they&#39;re not who they seem to be), and the significance of what they&#39;re saying.  I want to hear more.\n&gt; \n&gt; \n&gt; \n&gt; I don&#39;t have the expertise to build a box, and I can&#39;t afford to hire someone to build one for me, right now.  So, I&#39;m on this list, listening vicariously to others&#39; experiences and recordings.\n&gt; \n&gt; \n&gt; \n&gt; I&#39;m grateful for those who share their insights, experiences, thoughts on how we can understand this stuff better, and the recordings of voices that keep talking & talking.\n&gt; \n&gt; \n&gt; \n&gt; Thanks again, Frank!\n&gt; \n&gt; \n&gt; \n&gt; Relieved,\n&gt; \n&gt; Fiona\n&gt; \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; &lt;purplealiengirl@&gt; wrote:\n&gt; \n&gt; &gt;\n&gt; \n&gt; &gt;  Well, I was very reluctant, despite all the insults and attacks, but I hit the banned button. \n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt;  Frank-S \n&gt; \n&gt; &gt;\n&gt;"}