{"id": "17738", "subject": "Re: Tesing-testing", "author": "Urkel23", "timestamp": "2010-06-18T00:46:53Z", "full_text": "I was on a show called &quot;Mystery Hunters&quot; a couple years ago with FB #36 and i didn&#39;t get paid anything at all.  No gas, travel expense or anything.  They did offer to buy me dinner though, but i had just ate.  So, i agree with that analogy.  I&#39;ve also never got paid for any of my speaking events either.  I do this because i love and believe in the research, not for money.  I have a full time job, this is my passion.\n\n-Steve H.\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;Fiona Broome&quot; &lt;email@...&gt; wrote:\n&gt;\n&gt; Hi,\n&gt; \n&gt; Well, yes, and five years ago, I was getting $3k for being one of the speakers at weekend events.  The economy changes, sometimes dramatically, and our fees change accordingly.\n&gt; \n&gt; These days, most of what we do includes paying out-of-pocket for gas or airfare, plus motels of dubious distinction, en route.  At about 80% of events, no speaker&#39;s fee is involved. (In case you&#39;re wondering, the hotel or other meeting rooms where events are hosted... that&#39;s where most of the money goes.)\n&gt; \n&gt; Guest appearances on reality TV shows rarely pay anything at all. (Not such a great &quot;reality&quot;... huh? *chuckle and sigh*)  However, a TV appearance is a credential that can (usually just briefly) allow us to charge more for our services.\n&gt; \n&gt; In boom or bust, we keep doing what we do. We aspire to earn enough when times are good, to keep the bills paid when they&#39;re not so great.\n&gt; \n&gt; I don&#39;t know anyone in this field who wouldn&#39;t rather be doing something else, preferably with a steady paycheck.  We do this because we can&#39;t NOT do it.  If anyone is getting rich in this field, I have yet to meet them.\n&gt; \n&gt; I don&#39;t want sympathy, but I also don&#39;t want someone digging through my 11+ year old website, finding a page with my old fees, and deciding I&#39;m doing this for the money. \n&gt; \n&gt; I&#39;m on this list to learn about the box, and similar devices.  I want to understand what they do, why we hear impossibly consistent voices on them, how to improve the results, and what the significance of this is.\n&gt; \n&gt; I can&#39;t remain silent when someone suggests that a fellow researcher is money motivated.  But really, let&#39;s get back on-topic.\n&gt; \n&gt; Sincerely,\n&gt; Fiona\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Rj &lt;rasterer@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Yes it is going off topic, but just to make sure all the facts are here:\n&gt; &gt; \n&gt; &gt; - Mr Moon does solicit clients and charge for readings. \n&gt;"}