{"id": "17730", "subject": "Re: Tesing-testing", "author": "Fiona Broome", "timestamp": "2010-06-17T18:40:18Z", "full_text": "Hi,\n\nI&#39;m glad you mentioned Bill. Some of his products have been startling.  \n\nMy experiences with the Ovilus were interesting, and I&#39;m not sure if they support the PK-interference theory.\n\nOn a public investigation in Salem (MA), the Ovilus said my name as Fiona Broome.  Okay, &quot;broom&quot; is probably in its vocabulary; Fiona isn&#39;t.\n\nHowever, I kept waiting nervously for the Ovilus to say my actual name. (&quot;Fiona Broome&quot; is not what it says on my passport.)\n\nIt never did.  So, I&#39;ve wondered if the Ovilus -- or the entity/energy behind it -- was being discreet (for which I&#39;m grateful), or feeding off the group energy, since most everyone knew me only as Fiona Broome.\n\nRegarding an earlier comment about haunted locations (and whether location makes any difference), I know a reality-show star who couldn&#39;t use one of Bill&#39;s devices on-camera.  So, he was using the Puck before leaving for the site... and, according to him, the Puck often accurately provided a history and predicting what would happen at the location.\n\nAgain, there&#39;s the &quot;chicken or the egg&quot; question.  However, that story supports the idea that location is not an important variable.\n\nThough all of this is anecdotal, these are the kinds of things that force me to keep an open mind when I slide back into my default skeptic mode.\n\nAnd, they also raise good questions.  Many years ago, reading &quot;Conjuring Up Philip&quot; changed everything about how I look at &quot;haunted&quot; sites and phenomena at them.\n\nThe more specific the evidence/phenomena -- such as what the box seems to do -- the more intrigued I am.\n\nThe well of questions seems bottomless.  I&#39;m interested in expanding the range of &quot;what if...?&quot; questions because they get us to look at the evidence differently.\n\nThe more we explore the questions and answers, the closer we may get to understanding this.\n\nCheerfully,\nFiona\n\n--- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  Well, if someone is doing this &quot;work&quot; as their sole source of income, I don&#39;t fault them, and there does seem to be a market, and no shortage of people seeking readings. \n&gt; \n&gt;  One thing is certain, no Moon==no boxes. It was Moon that got this technology/technique out in the public. Also worth mentioning is Bill Chappell, who came up with the hack version. \n&gt; \n&gt; \n&gt; \n&gt;  Frank-S\n&gt;"}