{"id": "17735", "subject": "Re: Tesing-testing", "author": "purplespacefriend", "timestamp": "2010-06-17T21:58:52Z", "full_text": "Well, I can&#39;t address what Moon does with the box. It&#39;s like a computer maker, they don&#39;t control what the PC is used for. Chris and I communicate very little, usually only when he needs a box, and that&#39;s been a couple years. \n\n F-S\n\n--- In EVP-ITC@yahoogroups.com, Rj &lt;rasterer@...&gt; wrote:\n&gt;\n&gt; Yes it is going off topic, but just to make sure all the facts are here:\n&gt; \n&gt; - Mr Moon does solicit clients and charge for readings.  His Haunted Times web site notes that (but doesn&#39;t print prices, which is usually a concern for me when someone doesn&#39;t).  So if he&#39;s giving out Haunted Times magazines, it&#39;s like advertising.\n&gt; \n&gt; - On Chris&#39; blog last year, he announced his  DISCOUNT was $300/hour!:\n&gt; \n&gt; \n&gt; \t\tTelephone to the Dead (Frank’s Box) private sessions discounted for a \n&gt; limited time!\t\n&gt; \n&gt; Category: Dreams and the Supernatural\n&gt; \n&gt; \n&gt; \n&gt; For those who haven&#39;t seen the Telephone to the Dead (Frank&#39;s Box) in \n&gt; action and how I use it please check out this episode of Paranormal \n&gt; State that I had a guest spot on: http://www.youtube.com/watch?v=lp00GgB0F-w\n&gt; \n&gt; \n&gt; \n&gt; I am doing a limited number of private sessions over the phone this week\n&gt;  for those who are interested. The prices are as follows:\n&gt; \n&gt; \n&gt; \n&gt; * 15 minute reading: $90\n&gt; \n&gt; \n&gt; \n&gt; * 30 minute reading: $180\n&gt; \n&gt; \n&gt; \n&gt; * 45 minute reading: $260\n&gt; \n&gt; \n&gt; \n&gt; * 1 hour reading: $300\n&gt; \n&gt; \n&gt; \n&gt; ***optional recording: $50\n&gt; \t\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; --- On Thu, 6/17/10, Fiona Broome &lt;email@...&gt; wrote:\n&gt; \n&gt; From: Fiona Broome &lt;email@...&gt;\n&gt; Subject: [EVP-ITC] Re: Tesing-testing\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Thursday, June 17, 2010, 9:58 AM\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt;   \n&gt; \n&gt; \n&gt;     \n&gt;       \n&gt;       \n&gt;       Hi,\n&gt; \n&gt; \n&gt; \n&gt; Chris and I were both speakers at an event in Canada.  (And, for the record: No speaker&#39;s fees were involved.  I think most of us were there to share our latest research, meet fans, and -- in our spare time -- sit around over coffee and catch up with others in this field.) \n&gt; \n&gt; \n&gt; \n&gt; Chris&#39; table was across the aisle from mine at the tradeshow; neither of us were &quot;selling&quot; anything.  I was signing autographs (free), posing for photos with fans, and talking with anyone and everyone who had a question or an opinion to share.  \n&gt; \n&gt; \n&gt; \n&gt; Chris and Dina answered questions and gave out (free) copies of Haunted Times.\n&gt; \n&gt; \n&gt; \n&gt; I had ample opportunity to watch and hear pretty much everything that was going on at their table.  It was a very small tradeshow, with maybe a dozen tables.  \n&gt; \n&gt; \n&gt; \n&gt; I heard Chris&#39; presentation both times he talked.  He was hilariously funny, as he described his work in paranormal research, with some references to the box and how surprised he&#39;d been that it actually worked.  \n&gt; \n&gt; \n&gt; \n&gt; Chris did not close with anything even vaguely resembling a pitch for business.  I don&#39;t think he mentioned that he was willing to do readings, during or after the event. \n&gt; \n&gt; \n&gt; \n&gt; At the tradeshow, I never once saw or heard anything that involved &quot;selling,&quot; asking people for money, or soliciting &quot;private clientele.&quot; \n&gt; \n&gt; \n&gt; \n&gt; If I&#39;d seen or heard anything questionable, I&#39;d have distanced myself from Chris in a hurry.  (In case you&#39;re not familiar with my standards, my &quot;Scams and Con Artists&quot; article has been widely reprinted. People who are in this field for the money usually do NOT like me.)\n&gt; \n&gt; \n&gt; \n&gt; I believe that Chris usually charges for his time, and that seems fair to me. I know one person who paid him for a reading; it definitely did not involve &quot;hundreds of dollars an hour.&quot;  (It was considerably less than what many psychics charge.) She was thrilled with the answers she received, as they resolved a long-standing question she&#39;d had.  \n&gt; \n&gt; \n&gt; \n&gt; I heard several other people rave about Chris&#39; readings; I&#39;m not sure if they were paid readings or something that -- like my experience -- had been heard in a public setting, out of the blue.\n&gt; \n&gt; \n&gt; \n&gt; I heard no one say anything less than glowing about Chris.  I did hear negative things about at least one other speaker, so don&#39;t get the idea that everyone was simply starry-eyed.\n&gt; \n&gt; \n&gt; \n&gt; This was a low-budget event. Those of us who were there... we were there for the fun of getting together with others who are interested in paranormal studies.  There were crypto specialists, ghost enthusiasts, vampire experts, and I even got to meet Al Peacock of &quot;Conjuring Up Philip&quot; fame.\n&gt; \n&gt; \n&gt; \n&gt; There is a lot of gossip in this field.  I wish there wasn&#39;t... but there is.  People seem to feel safe talking in the third person, so I&#39;m sorry if I bristle when I hear &quot;one suspects&quot; or anything that&#39;s not a first-person observation.  Too often, it&#39;s turned out to be something taken out of context.  \n&gt; \n&gt; \n&gt; \n&gt; I try to look at the facts objectively, and usually in-person.\n&gt; \n&gt; \n&gt; \n&gt; Everyone has a learning curve trying to find a way to work full-time in this field and still pay the rent. I&#39;ve made mistakes and I&#39;m sure Chris has, too; we all stumble along, seeing what works and what&#39;s a Very Bad Idea.\n&gt; \n&gt; \n&gt; \n&gt; I judge people on what I see when they&#39;re in the spotlight and out of it.  I see what they&#39;re like when they&#39;re upbeat, as well as running on adrenaline and caffeine, during the final hours of an exhausting multi-day event.\n&gt; \n&gt; \n&gt; \n&gt; I double-check their claims, and I listen carefully to people who&#39;ve had readings with them, if they&#39;re giving readings (paid or free).\n&gt; \n&gt; \n&gt; \n&gt; To be blunt, I&#39;m working in a field where we&#39;ve recently discovered a couple of child molesters posing as ghost experts.  Ick! \n&gt; \n&gt; \n&gt; \n&gt; &quot;Cautious&quot; is an understatement, for how many of us now look at anyone who presents themselves as an authority.  We just can&#39;t risk being tarred, even with the &quot;charlatan&quot; brush.\n&gt; \n&gt; \n&gt; \n&gt; That&#39;s all way off-topic here, but I want to be sure that I describe my experiences clearly and completely. \n&gt; \n&gt; \n&gt; \n&gt; Sincerely,\n&gt; \n&gt; Fiona\n&gt; \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Rj &lt;rasterer@&gt; wrote:\n&gt; \n&gt; &gt;\n&gt; \n&gt; &gt; Mr Moon hosts seminars, at which, you may see him do public demonstrations.Â  But if you want a private reading.... $$$ (I&#39;ve heard several hundred dollars an hour, with discounts to conference atendees).\n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; So one suspects the public demonstrations probably help to acquire private clientele.\n&gt; \n&gt; &gt;\n&gt;"}