{"id": "17754", "subject": "Re: [EVP-ITC] 061310Echo Chamber", "author": "Frank Sumption", "timestamp": "2010-06-20T06:05:19Z", "full_text": "The speaker is from a dead mini tape deck, the chamber is 3 inch lengths of\n3/4 inch PVC conduit, flattened on a band saw--very carefully. I try to\nenclose it to minimize feedback, but that&#39;s only partially successful. And\nthis is how it sounds, at 3 seconds &quot;Purple Princess Ghost Box&quot;.\n\n The first speaker I had glued in the lid was bad, so had to replace it.\n\n F-S\n\nOn Sat, Jun 19, 2010 at 4:56 PM, Frank Sumption\n&lt;purplealiengirl@...&gt;wrote:\n\n&gt; Depends on what I have room for. The mic is the standard 3/8 inch diameter\n&gt; electret mic, and the speaker I try to find the smallest possible 8 ohm,\n&gt; with decent sound.\n&gt;\n&gt;  Frank-s\n&gt;\n&gt;   On Fri, Jun 18, 2010 at 6:33 PM, &lt;dc3644@...&gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; Frank,\n&gt;&gt;\n&gt;&gt; Couple questions on your echo chamber. How big are the speaker and\n&gt;&gt; microphone on each side? Are they enclosed in a box with the tubes with one\n&gt;&gt; on each end and how are they positioned? Just trying to piece things\n&gt;&gt; together. :)\n&gt;&gt;\n&gt;&gt; Dwayne\n&gt;&gt;\n&gt;&gt;  \n&gt;&gt;\n&gt;\n&gt;\n\nThe speake is om a dead mini ape deck, he chambe is 3 inch leng hs o 3/4 inch PVC condui , la ened on a band saw-- e y ca e ully. I y o enclose i o minimize eedback, bu ha 's only pa ially success ul. And his is how i sounds, a 3 seconds \"Pu ple P incess Ghos Box\".\n\n \n The i s speake I had glued in he lid was bad, so had o eplace i . \n \n F-S\nOn Sa , Jun 19, 2010 a 4:56 PM, F ank Sump ion pu plealiengi l@...> w o e:\n\nDepends on wha  I ha e oom o . The mic is he s anda d 3/8 inch diame e elec e mic, and he speake  I y o ind he smalles possible 8 ohm, wi h decen sound. \n \n F ank-s\n\n\n\nOn F i, Jun 18, 2010 a 6:33 PM, dc3644@...> w o e:\n\n  \n\n\n\n\nF ank,\n \nCouple ques ions on you echo chambe . How big a e he speake and mic ophone on each side? A e hey enclosed in a box wi h he ubes wi h one on each end and how a e hey posi ioned? Jus ying o piece hings oge he . :)\n\n \nDwayne"}