{"id": "17761", "subject": "Re: 061310Echo Chamber", "author": "Urkel23", "timestamp": "2010-06-20T18:50:34Z", "full_text": "For an easier Echo effect, you can take a regular radio and stand in the shower with it....LOL\n\n-Steve\n\n\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  The speaker in on one &quot;end&quot; of the echo chamber tube, and the mic is one\n&gt; the other, In this case I glued thin plastic sheet from something I bought\n&gt; in a blister pack over the ends of the tubes, then cut a hole the diameter\n&gt; of the tube for the speaker, and for the mic I melted a hole with a\n&gt; soldering iron, then glued mic and speaker in place.. I have used all\n&gt; kinds of stuff for the chamber, 12 inch X 4 foot long MDF board chamber,\n&gt; aluminum foil in a 1/4 inch wood frame, metal channels formed by gluing in\n&gt; metal strips. In box #1, I used a triangle shaped cany tin, and hte main\n&gt; board for the box was mounted on top.\n&gt; \n&gt;  The mic feed the fourth op amp channel of the sweep generator, where it&#39;s\n&gt; amplified and forms the line out signal, and then drives the monitor/panel\n&gt; speaker. The electret mic has to be biased to work, if you buy one at RS I\n&gt; think the paskage shows the details. it gets a little complicated.\n&gt; \n&gt;  Frank-S\n&gt; \n&gt; On Sun, Jun 20, 2010 at 6:49 AM, &lt;dc3644@...&gt; wrote:\n&gt; \n&gt; &gt;\n&gt; &gt;\n&gt; &gt; So how is the mic positioned? Is it on the other end then? The mic then\n&gt; &gt; feeds into what?\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;  In a message dated 6/19/2010 11:05:31 P.M. Pacific Daylight Time,\n&gt; &gt; purplealiengirl@... writes:\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;   The speaker is from a dead mini tape deck, the chamber is 3 inch lengths\n&gt; &gt; of 3/4 inch PVC conduit, flattened on a band saw--very carefully. I try to\n&gt; &gt; enclose it to minimize feedback, but that&#39;s only partially successful. And\n&gt; &gt; this is how it sounds, at 3 seconds &quot;Purple Princess Ghost Box&quot;.\n&gt; &gt;\n&gt; &gt;  The first speaker I had glued in the lid was bad, so had to replace it.\n&gt; &gt;\n&gt; &gt;  F-S\n&gt; &gt;\n&gt; &gt;  On Sat, Jun 19, 2010 at 4:56 PM, Frank Sumption &lt;\n&gt; &gt; purplealiengirl@...&gt; wrote:\n&gt; &gt;\n&gt; &gt;&gt;  Depends on what I have room for. The mic is the standard 3/8 inch\n&gt; &gt;&gt; diameter electret mic, and the speaker I try to find the smallest possible 8\n&gt; &gt;&gt; ohm, with decent sound.\n&gt; &gt;&gt;\n&gt; &gt;&gt;  Frank-s\n&gt; &gt;&gt;\n&gt; &gt;&gt;   On Fri, Jun 18, 2010 at 6:33 PM, &lt;dc3644@...&gt; wrote:\n&gt; &gt;&gt;\n&gt; &gt;&gt;&gt;\n&gt; &gt;&gt;&gt;\n&gt; &gt;&gt;&gt; Frank,\n&gt; &gt;&gt;&gt;\n&gt; &gt;&gt;&gt; Couple questions on your echo chamber. How big are the speaker and\n&gt; &gt;&gt;&gt; microphone on each side? Are they enclosed in a box with the tubes with one\n&gt; &gt;&gt;&gt; on each end and how are they positioned? Just trying to piece things\n&gt; &gt;&gt;&gt; together. :)\n&gt; &gt;&gt;&gt;\n&gt; &gt;&gt;&gt; Dwayne\n&gt; &gt;&gt;&gt;\n&gt; &gt;&gt;&gt;\n&gt; &gt;&gt;\n&gt; &gt;   \n&gt; &gt;\n&gt;"}