{"id": "17781", "subject": "Re: [EVP-ITC] Re: Edison?!", "author": "Tim Woolworth", "timestamp": "2010-06-21T19:38:16Z", "full_text": "I get this quite frequently also.  I think that the technicians facilitate\nthe communication with the Others.  In my experience, when I am doing a\nsession and I am asking questions, the Others kind of line-up to all be\nheard at once.  Many times I have to ask them to only let one at a time\nspeak because a lot of chatter results.  I received these two clips while\nghosting on Saturday night and I think that they are directly pertinent to\nthis idea.\n\nThe first one you will hear is a child saying how many people are there to\nspeak through the box.\n\nThe second clip is a good one.  In this one you will hear my technician\nreiterating my request to the Others.\n\nTim\n\nOn Mon, Jun 21, 2010 at 2:35 PM, Frank Sumption\n&lt;purplealiengirl@...&gt;wrote:\n\n&gt;\n&gt;\n&gt; It almost sounded like a transmission, where one says &quot;commence&quot;, or start\n&gt; talking.\n&gt;\n&gt;  F-S\n&gt;\n&gt; On Mon, Jun 21, 2010 at 10:53 AM, tim_woolworth &lt;tim@...&gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; Sorry I haven&#39;t been involved for the last week or so. I have been up to\n&gt;&gt; my eyeballs in the paranormal lately and I needed a break. I am going\n&gt;&gt; through the posts now and I see it was a lively week.\n&gt;&gt;\n&gt;&gt; As for these clips Frank, the first one is exceptional. I hear it slightly\n&gt;&gt; different from you. To me it sounds like: &quot;Here is Edison everyone.&quot;\n&gt;&gt;\n&gt;&gt; Could he be announcing himself to the group who was using the box? Or was\n&gt;&gt; someone introducing him?\n&gt;&gt;\n&gt;&gt; Good stuff.\n&gt;&gt;\n&gt;&gt; Tim\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Frank\n&gt;&gt; Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt;&gt; &gt;\n&gt;&gt; &gt; Too noisy, the last one I can hear something about Edison, but not sure\n&gt;&gt; what\n&gt;&gt; &gt; it says.\n&gt;&gt; &gt;\n&gt;&gt; &gt; F-S\n&gt;&gt; &gt;\n&gt;&gt;\n&gt;&gt;\n&gt;  \n&gt;\n\nI ge his qui e equen ly also.  I hink ha he echnicians acili a e he communica ion wi h he O he s.  In my expe ience, when I am doing a session and I am asking ques ions, he O he s kind o line-up o all be hea d a once.  Many imes I ha e o ask hem o only le one a a ime speak because a lo o cha e esul s.  I ecei ed hese wo clips while ghos ing on Sa u day nigh and I hink ha hey a e di ec ly pe inen o his idea.\nThe i s one you will hea is a child saying how many people a e he e o speak h ough he box.The second clip is a good one.  In his one you will hea my echnician ei e a ing my eques o he O he s.\nTimOn Mon, Jun 21, 2010 a 2:35 PM, F ank Sump ion pu plealiengi l@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n I almos sounded like a ansmission, whe e one says \"commence\", o s a alking. \n \n F-S\nOn Mon, Jun 21, 2010 a 10:53 AM, im_woolwo h im@...> w o e:\n\n  \n\n\n\nSo y I ha en' been in ol ed o he las week o so. I ha e been up o my eyeballs in he pa ano mal la ely and I needed a b eak. I am going h ough he pos s now and I see i was a li ely week.As o hese clips F ank, he i s one is excep ional. I hea i sligh ly di e en om you. To me i sounds like: \"He e is Edison e e yone.\"\n\nCould he be announcing himsel o he g oup who was using he box? O was someone in oducing him?Good s u .Tim \n\n\n--- In EVP-ITC@yahoog oups.com, F ank Sump ion w o e:>> Too noisy, he las one I can hea some hing abou Edison, bu no su e wha \n\n> i says.> > F-S>"}