{"id": "17792", "subject": "Re: [EVP-ITC] Re: A few more car tuner tests. [4 Attachments]", "author": "Frank Sumption", "timestamp": "2010-06-24T16:11:40Z", "full_text": "That whooosing sound everyone hears with these--that&#39;s the stuff flying\nover my head! I didn&#39;t even see, or hear the posts with this. I just\nlistened and heard them clear, Tim.\n\n F-S\n\nOn Mon, Jun 21, 2010 at 1:44 PM, Tim Woolworth &lt;tjwoolworth@...&gt;wrote:\n\n&gt;\n&gt;  [Attachment(s)&lt;https://mail.google.com/mail/?ui=2&view=js&name=main_init,tlist&ver=aZxD9j7SvLo.en.&am=!ogafcFI2wOKxxXse0fc-Mgn0-u0doTX0pcCc8a3viHG0wzCe0Q&fri#1295c40243acb9db_TopText&gt;from Tim Woolworth included below]\n&gt;\n&gt; I get my full name called out, and Woolworth&#39;s has&#39;t had a store in the USA\n&gt; for over a decade so I know that it isn&#39;t radio interference when it\n&gt; happens.\n&gt;\n&gt; Interestingly enough, during my sessions on Saturday, they were mentioning\n&gt; you Frank.  I heard you name spoken many times and I know of no other Frank.\n&gt;\n&gt;\n&gt; The following clip cracked me up.  The clip after that used your nickname.\n&gt;  These were received on Saturday, I was participating in a fund raiser for\n&gt; the local historical society that involved the public going on a ghost hunt\n&gt; in two different locations across the street from one another.\n&gt;\n&gt; These clips came through during that hunt, two different locations\n&gt; (&quot;Purple&quot; was in a house, and the &quot;call Frank&quot; was in a public library).\n&gt;\n&gt; The other clips are just some of the standard clips I get that mention my\n&gt; name, same hunt on Saturday.\n&gt;\n&gt; Tim\n&gt;\n&gt; On Mon, Jun 21, 2010 at 2:36 PM, Frank Sumption &lt;purplealiengirl@...\n&gt; &gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; I get that--alot.\n&gt;&gt;\n&gt;&gt;  F-S\n&gt;&gt;\n&gt;&gt; On Mon, Jun 21, 2010 at 11:17 AM, tim_woolworth &lt;tim@itcvoices.org&gt;wrote:\n&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt; In your &quot;Echo chamber or not&quot; clip there is a male voice clearly saying\n&gt;&gt;&gt; &quot;Frank&quot; at nine seconds.\n&gt;&gt;&gt;\n&gt;&gt;&gt; Tim\n&gt;&gt;&gt;\n&gt;&gt;&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Frank\n&gt;&gt;&gt; Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt;&gt;&gt; &gt;\n&gt;&gt;&gt; &gt; Weird how this is what started the boxes.\n&gt;&gt;&gt; &gt;\n&gt;&gt;&gt; &gt; F-S\n&gt;&gt;&gt; &gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;\n&gt;  \n&gt;\n\nTha whooosing sound e e yone hea s wi h hese-- ha 's he s u lying o e my head! I didn' e en see, o hea he pos s wi h his. I jus lis ened and hea d hem clea , Tim.\n \n F-S\nOn Mon, Jun 21, 2010 a 1:44 PM, Tim Woolwo h jwoolwo h@...> w o e:\n\n  \n\n\n[A achmen (s) om Tim Woolwo h included below] \nI ge my ull name called ou , and Woolwo h's has' had a s o e in he USA o o e a decade so I know ha i isn' adio in e e ence when i happens. \n\nIn e es ingly enough, du ing my sessions on Sa u day, hey we e men ioning you F ank.  I hea d you name spoken many imes and I know o no o he F ank.  \n\nThe ollowing clip c acked me up.  The clip a e ha used you nickname.  These we e ecei ed on Sa u day, I was pa icipa ing in a und aise o he local his o ical socie y ha in ol ed he public going on a ghos hun in wo di e en loca ions ac oss he s ee om one ano he .  \n\n\nThese clips came h ough du ing ha hun , wo di e en loca ions (\"Pu ple\" was in a house, and he \"call F ank\" was in a public lib a y).\n\nThe o he clips a e jus some o he s anda d clips I ge ha men ion my name, same hun on Sa u day.\n\nTim\n\nOn Mon, Jun 21, 2010 a 2:36 PM, F ank Sump ion pu plealiengi l@...> w o e:\n\n  \n\n\n\n\nI ge ha --alo . \n \n F-S\nOn Mon, Jun 21, 2010 a 11:17 AM, im_woolwo h im@...> w o e:\n\n  \n\n\n\nIn you \"Echo chambe o no \" clip he e is a male oice clea ly saying \"F ank\" a nine seconds.Tim \n\n--- In EVP-ITC@yahoog oups.com, F ank Sump ion w o e:>\n> Wei d how his is wha s a ed he boxes.> > F-S>"}