{"id": "17791", "subject": "Re: pcb", "author": "purplespacefriend", "timestamp": "2010-06-24T15:59:50Z", "full_text": "I missed the original post on the PCB, or couldn&#39;t find it. Anyway, I use a company called ExpressPCB  http://www.expresspcb.com/ $60 for 3 their of mini boards. I can fit all functions minus the tuner on a mini board. I use SMT with the mini boards, and theat&#39;s not difficult using 1206 components. mouser carries all the SMT parts.\n\n But mostly I use perf board and use the money I would have spent on PCBs for parts. \n\n I did find a schematic for the function generator kit others have been using for sweep, and converted to use the LM324, 1N4148 diodes and added a DC offset and amp. I made a board to see how the sine wave functions as sweep instead of the triangle wave. \n\n Frank-S\n\n--- In EVP-ITC@yahoogroups.com, &quot;Tim&quot; &lt;sir_tim1@...&gt; wrote:\n&gt;\n&gt; i wonder if there is a way to get a copy of a pre eched board to iron it onto a new pcb.\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Zack Widup &lt;w9sz.zack@&gt; wrote:\n&gt; &gt;\n&gt; &gt; I&#39;m an electrical engineer and also a radio amateur so I make a lot of pc\n&gt; &gt; boards, both at work and at home.\n&gt; &gt; \n&gt; &gt; Yes, that board should work. If you have a single-sided board pattern, after\n&gt; &gt; you&#39;ve developed the photoresist (or ironed on the toner, if you do it that\n&gt; &gt; way) spray the other side of the board with spray paint and let dry. I like\n&gt; &gt; to use the clear coat paint but it doesn&#39;t really matter.\n&gt; &gt; \n&gt; &gt; After you&#39;ve etched one side, clean the paint and the photoresist off (clean\n&gt; &gt; both sides) with acetone, MEK, etc. Do this in a well-ventilated area! Then\n&gt; &gt; drill your holes.\n&gt; &gt; \n&gt; &gt; If you are going to make a double-sided board, drill a few of the holes that\n&gt; &gt; have common pads on both sides to orient the pattern on the other side and\n&gt; &gt; repeat whatever method you use to put a resist on that side. After it&#39;s\n&gt; &gt; developed/ironed on, spray the already etched side with paint and etch the\n&gt; &gt; other side. Clean off the board and drill holes.\n&gt; &gt; \n&gt; &gt; Zack\n&gt; &gt; \n&gt; &gt; On Sat, Jan 16, 2010 at 2:40 AM, elmer kliewer &lt;\n&gt; &gt; cowboy_ridehard2003@&gt; wrote:\n&gt; &gt; \n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;   hay thanks zack where do you fine that stuff.\n&gt; &gt; &gt;  what i have now is a two sided copper clad board (not sensitize)  will it\n&gt; &gt; &gt; work with that as well? Would hate to wast them.\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; \n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}