{"id": "1780", "subject": "Re: Messages delievered no matter what...", "author": "rosemary_guiley", "timestamp": "2007-08-04T05:17:50Z", "full_text": "Hi Juli,\n\nJust catching up with this.  Many thanks for your comments.  I agree\nthat messages sometimes do not pertain to place, but to someone who\nneeds the message, and who may not even be present.  That happens\nsometimes with &quot;regular&quot; EVP, and may account for why some messages\ndon&#39;t make much sense.\n\nRosemary\n--- In EVP-ITC@yahoogroups.com, &quot;Juli Velazquez&quot;\n&lt;ghostchasingfool@...&gt; wrote:\n&gt;\n&gt; I just wanted to say that what I really find amazing with the make \n&gt; up of the box, that no matter what field your working in \n&gt; (paranormal, UFO&#39;s etc.)is the fact that if a message needs to be \n&gt; delivered it will find a way of coming through to the right people \n&gt; to be delivered.  \n&gt; \n&gt; I really believe that there is a hugh misconception that the box \n&gt; needs to be at specific location and will only recieve the messages \n&gt; pretaining to the history there, which is so not true.  \n&gt; \n&gt; I know in on many occassions that a special message was to be \n&gt; delivered to certain people, especially in times of trouble and \n&gt; the &quot;greater powers that be&quot; have followed through alerting us, when \n&gt; the box was not in our possession, which is an example in RoseMary \n&gt; Ellen&#39;s case. Knowing RoseMary Ellen personally, I can tell you that \n&gt; she has devoted much of her life to the paranormal and through her \n&gt; writings and teachings have been able to convey messages in many \n&gt; ways and her intentions are sincere.\n&gt; \n&gt; I do have a theory on this, and is only my opinion.  \n&gt; \n&gt; I have watched and observed the box on many occassions.  I have \n&gt; worked on many evp&#39;s from the box, and for the most I understand \n&gt; much of what is coming through immediately. I have had one on one \n&gt; conversations many with the same voices and reconized them.  I see \n&gt; how many people claim it doesn&#39;t work or they can not understand \n&gt; it.  Me however, truly believe that people whomn are &quot;pure&quot; with \n&gt; their intensions and their heart is in the right place with their \n&gt; research can fully understand and make a connect with the \n&gt; otherside.  The otherside know&#39;s who they are and what they stand \n&gt; for and build a respect for them to carry on their work.  \n&gt; \n&gt; I myself do not have a box at this moment, base on a respect issue \n&gt; for Frank and his work.  See, I truly believe that when you are \n&gt; suppose to acquire this tool of communication, the message will come \n&gt; through to let you know, and only then if your dedicated and \n&gt; passionate, should you be an advocate for the otherside.\n&gt; \n&gt;  \n&gt; These are just my thoughts.....\n&gt; \n&gt; Juli\n&gt;"}