{"id": "17835", "subject": "This is mind numbing to watch/listen to.", "author": "Frank Sumption", "timestamp": "2010-06-30T00:01:56Z", "full_text": "With the &quot;new&quot; digital TV you can use the last channel viewed button to\nrapidly switch between two different channels. Here there is some high\nnumber channel that is AMC, and also #64 is AMC, so switching between the\ntwo almost, or maybe does,  result in meaningful messages. Many of the\nchannels have a second or more delay to get audio, so it doesn&#39;t work on all\npairs.\n\n &quot;The answers will come if I (wait?)....simplest believe\n&#39;em---gibberish--(at 8 seconds) Believe My Princess gets it&quot; and I think the\nend is gibberish. Of course I&#39;ll have to wait for the more qualified\nlisteners judge this to be sure. Just kidding!\n\n The secret? &quot;They&quot; know exactly what I&#39;m doing and what I&#39;m going to do. No\naccidental captures!\n\n The image freezes until the new channel is switched to, the audio comes\nfirst, then the pix, so if you switch before the new picture comes up you\nget these little micro sound bits and a frozen image on the screeen, it\ntakes a littel practice.\n\n Frank-S\n\nWi h he \"new\" digi al TV you can use he las channel iewed bu on o apidly swi ch be ween wo di e en channels. He e he e is some high numbe channel  ha is AMC, and also #64 is AMC, so swi ching be ween he wo almos , o maybe does,   esul in meaning ul messages. Many o he channels ha e a second o mo e delay o ge audio, so i doesn' wo k on all pai s. \n\n \n \"The answe s will come i I (wai ?)....simples belie e 'em---gibbe ish--(a 8 seconds) Belie e My P incess ge s i \" and I hink he end is gibbe ish. O cou se I'll ha e o wai o he mo e quali ied lis ene s judge his o be su e. Jus kidding!\n\n \n The sec e ? \"They\" know exac ly wha I'm doing and wha I'm going o do. No acciden al cap u es! \n \n The image eezes un il he new channel is swi ched o, he audio comes i s , hen he pix, so i you swi ch be o e he new pic u e comes up you ge hese li le mic o sound bi s and a ozen image on he sc eeen, i akes a li el p ac ice. \n\n \n F ank-S"}