{"id": "17893", "subject": "Re: [EVP-ITC] inplants, this is scary stuff, people. Gimme a Break \tSnowfire!", "author": "Frank Sumption", "timestamp": "2010-07-08T00:17:49Z", "full_text": "I don&#39;t know, all EVP all the time gets boring me thinks. No one is held\nhere, all you do is go to edit memebership on the group home page and choose\nleave group.\n\n F-S\n\nOn Wed, Jul 7, 2010 at 10:35 AM, Buck &lt;shgiruss@yahoo.com&gt; wrote:\n\n&gt;\n&gt;\n&gt;   I thought this was about evp? Instead its a snowfireblog to tout tribal\n&gt; religion. ATTENTION MODERATOR&lt; please remove me or snowfire from this group.\n&gt; My mailbox is full and its mainly snowfire&#39;s childish behavior. Here\n&gt; snowfire read this:\n&gt;\n&gt; Why do I need jesus to save me from his evil hebrew savage dad? God of the\n&gt; bible is evil. He commandeth me to gointo town and murder all women, men and\n&gt; children and pile them outside and burn them (its in the bible). In the next\n&gt; town do the same thing but they are allowed to keep the little young\n&gt; &quot;VIRGIN&quot; girls as (ahem), slaves. The priests are allocated over 300 virgin\n&gt; girls for themselves. Its in the bible snowfire. Now can you tell me what\n&gt; these girls who as stated in the bible &quot;virgins&quot; are supposed to do for\n&gt; these hebrew savage men? Sew? cook? They were raped snowfire and while they\n&gt; were being humped on by these sweaty men they only could think of their\n&gt; memories of watching their mom and dad as the swords ran through them, as\n&gt; they watched their moms head cut clean off and her brother likely eaten for\n&gt; dinner. This all brought to you by the hebrew savage god.\n&gt;\n&gt; I would ask that all well read individuals please consider &quot;My Big Toe&quot; by\n&gt; Thomas Campbell and snowfire put down your evp device as your bible says it\n&gt; is communicating with demons. Be true to your religion and walk away from\n&gt; this group, or abstain from saving us from the debil. Now where can i get\n&gt; that stamp on my forehead or my right hand....shame the bible didnt say a\n&gt; microchip....oh well close enough for Pastor Billy.\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; --- On *Mon, 7/5/10, SnowfireL@... &lt;SnowfireL@...&gt;* wrote:\n&gt;\n&gt;\n&gt; From: SnowfireL@... &lt;SnowfireL@...&gt;\n&gt; Subject: Re: [EVP-ITC] inplants, this is scary stuff, people.\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Monday, July 5, 2010, 1:10 AM\n&gt;\n&gt;\n&gt;  Glad you are not scarred Frank, guess we&#39;ll all come to your house for\n&gt; protection from the government then &lt;s&gt;sf\n&gt;\n&gt;\n&gt; -----Original Message-----\n&gt; From: Frank Sumption &lt;purplealiengirl@ gmail.com&gt;\n&gt; To: EVP-ITC@yahoogroups .com\n&gt; Sent: Sun, Jul 4, 2010 10:52 pm\n&gt; Subject: Re: [EVP-ITC] inplants, this is scary stuff, people.\n&gt;\n&gt;\n&gt;    Kinda useful to have your pets chips, it helps locate them if they are\n&gt; lost. The rest of that video is the fear BS from the church. Who needs a\n&gt; Jesus if you don&#39;t have any fear?\n&gt;\n&gt;  F-S\n&gt;\n&gt; On Sun, Jul 4, 2010 at 8:47 PM, &lt;SnowfireL@aol. com&lt;http://us.mc531.mail.yahoo.com/mc/compose?to=SnowfireL@...&gt;\n&gt; &gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;   by any chance did you see the part where they like to put the\n&gt;&gt; implants?  Either in the forhead at the hair line or in the top of the hand,\n&gt;&gt; very biblical, and scary. sf\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; -----Original Message-----\n&gt;&gt; From: Frank Sumption &lt;purplealiengirl@ gmail.com&lt;http://us.mc531.mail.yahoo.com/mc/compose?to=purplealiengirl@...&gt;\n&gt;&gt; &gt;\n&gt;&gt; To: EVP-ITC@yahoogroups .com&lt;http://us.mc531.mail.yahoo.com/mc/compose?to=EVP-ITC@yahoogroups.com&gt;\n&gt;&gt; Sent: Sun, Jul 4, 2010 10:43 pm\n&gt;&gt; Subject: Re: [EVP-ITC] inplants, this is scary stuff, people.\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;   How else are &quot;they&quot; supposed to know where you are when the planet goes\n&gt;&gt; boom!? I could only watch about 1 second of that guy!\n&gt;&gt;\n&gt;&gt; F-S\n&gt;&gt;\n&gt;&gt; On Sat, Jul 3, 2010 at 8:29 PM, &lt;SnowfireL@aol. com&lt;http://us.mc531.mail.yahoo.com/mc/compose?to=SnowfireL@...&gt;\n&gt;&gt; &gt; wrote:\n&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;   This is scary, check this out about these implants: http://www.youtube.\n&gt;&gt;&gt; com/watch?\n&gt;&gt;&gt; v=8kH-tHk0bsc&feature=pyv&ad=3616086197&kw=jesus&gclid=CMDc5Obn0KICF\n&gt;&gt;&gt; Yp95QodjXsjxA&lt;http://www.youtube.com/watch?v=8kH-tHk0bsc&feature=pyv&ad=3616086197&kw=jesus&gclid=CMDc5Obn0KICFYp95QodjXsjxA&gt;\n&gt;&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;\n&gt; \n&gt;\n\nI don' know, all EVP all he ime ge s bo ing me hinks. No one is held he e, all you do is go o edi memebe ship on he g oup home page and choose lea e g oup. \n \n F-S\nOn Wed, Jul 7, 2010 a 10:35 AM, Buck shgi uss@...> w o e:\n\n  \n\n\n\n\n\n\n\n\nI hough his was abou e p? Ins ead i s a snow i eblog o ou ibal eligion. ATTENTION MODERATOR\n\n \nWhy do I need jesus o sa e me om his e il heb ew sa age dad? God o he bible is e il. He commande h me o goin o own and mu de all women, men and child en and pile hem ou side and bu n hem (i s in he bible). In he nex own do he same hing bu hey a e allowed o keep he li le young \"VIRGIN\" gi ls as (ahem), sla es. The p ies s a e alloca ed o e 300 i gin gi ls o hemsel es. I s in he bible snow i e. Now can you ell me wha hese gi ls who as s a ed in he bible \" i gins\" a e supposed o do o hese heb ew sa age men? Sew? cook? They we e aped snow i e and while hey we e being humped on by hese swea y men hey only could hink o hei memo ies o wa ching hei mom and dad as he swo ds an h ough hem, as hey wa ched hei moms head cu clean o  and he b o he likely ea en o dinne . This all b ough o you by he heb ew sa age god.\n\n \nI would ask ha all well ead indi iduals please conside \"My Big Toe\" by Thomas Campbell and snow i e pu down you e p de ice as you bible says i is communica ing wi h demons. Be ue o you eligion and walk away om his g oup, o abs ain om sa ing us om he debil. Now whe e can i ge ha s amp on my o ehead o my igh hand....shame he bible didn say a mic ochip....oh well close enough o Pas o Billy.\n\n \n \n \n \n--- On Mon, 7/5/10, Snow i eL@... Snow i eL@...> w o e:\nF om: Snow i eL@... Snow i eL@...>\nSubjec : Re: [EVP-ITC] inplan s, his is sca y s u , people.To: EVP-ITC@yahoog oups.comDa e: Monday, July 5, 2010, 1:10 AM\n  \n\n\nGlad you a e no sca ed F ank, guess we'll all come o you house o p o ec ion om he go e nmen hen s \n\n-----O iginal Message-----F om: F ank Sump ion gmail.com>To: EVP-ITC@yahoog oups .comSen : Sun, Jul 4, 2010 10:52 pmSubjec : Re: [EVP-ITC] inplan s, his is sca y s u , people.\n\n\n  \n\n\n\n\n Kinda use ul o ha e you pe s chips, i helps loca e hem i hey a e los . The es o ha ideo is he ea BS om he chu ch. Who needs a Jesus i you don' ha e any ea ? \n \n F-S\nOn Sun, Jul 4, 2010 a 8:47 PM, Snow i eL@aol. com> w o e:\n\n\n  \n\n\n\n\nby any chance did you see he pa whe e hey like o pu he implan s?  Ei he in he o head a he hai line o in he op o he hand, e y biblical, and sca y. s \n\n\n\n\n-----O iginal Message-----F om: F ank Sump ion pu plealiengi l@ gmail.com>\nTo: EVP-ITC@yahoog oups .comSen : Sun, Jul 4, 2010 10:43 pmSubjec : Re: [EVP-ITC] inplan s, his is sca y s u , people.\n\n\n\n  \n\n\n\n\n\nHow else a e \" hey\" supposed o know whe e you a e when he plane goes boom!? I could only wa ch abou 1 second o ha guy!\n \nF-S\nOn Sa , Jul 3, 2010 a 8:29 PM, Snow i eL@aol. com> w o e:\n\n\n  \n\n\n\n\nThis is sca y, check his ou abou hese implan s: h p://www.you ube. com/wa ch? =8kH- Hk0bsc& ea u e=py &ad=3616086197&kw=jesus&gclid=CMDc5Obn0KICF Yp95QodjXsjxA"}