{"id": "17895", "subject": "Re: [EVP-ITC] Off topic,", "author": "Frank Sumption", "timestamp": "2010-07-08T00:20:36Z", "full_text": "At first I thought this was about alien implants, which is mentioned in\nsome of the voices I get. Implants from the governent?--not gonna matter.\n\n F-S\n\nOn Wed, Jul 7, 2010 at 12:22 PM, &lt;SnowfireL@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Thank you Fiona.  As for that person who wanted to find out all the why&#39;s,\n&gt; here is a link, I will not post out context info. but if this person cares\n&gt; to visit this page, he or she will get the info needed, and it won&#39;t &quot;pile\n&gt; up&quot; in the list.  sf\n&gt; http://www.godandscience.org/apologetics/killergod.html\n&gt;\n&gt;  In a message dated 7/7/2010 1:35:13 P.M. Eastern Daylight Time,\n&gt; email@... writes:\n&gt;\n&gt;\n&gt;\n&gt; Hi,\n&gt;\n&gt; I&#39;m generally in lurk mode due to some offline priorities that need my\n&gt; immediate attention. I&#39;ll probably be fairly silent through mid-July, but I\n&gt; had to speak up when this email crossed my desk.\n&gt;\n&gt; While I don&#39;t share Snowfire&#39;s views in most cases, I&#39;ve always enjoyed the\n&gt; links & banter. The recordings are always interesting... and isn&#39;t that the\n&gt; focus of this group?\n&gt;\n&gt; I&#39;m not thrilled with ultimatums, as if the group isn&#39;t big enough (or\n&gt; big-hearted enough) to include diverse views, respectfully shared.\n&gt;\n&gt; My two cents: Snowfire, please don&#39;t leave!\n&gt;\n&gt; In haste,\n&gt; Fiona\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, SnowfireL@...\n&gt; wrote:\n&gt; &gt;\n&gt; &gt; I mean the stuff below, if you are so bothered by opinion, Billy? I will\n&gt; &gt; leave, but the stuff in that statement below of yours, is very out of\n&gt; &gt; context, to each is own. I was merely presenting something I came across\n&gt; on the\n&gt; &gt; You Tube, I don&#39;t even know that person. Take care, sf\n&gt;\n&gt;  \n&gt;\n\nA i s I hough his was abou alien implan s, which is men ioned in some o he oices I ge . Implan s om he go e nen ?--no gonna ma e . \n \n F-S\nOn Wed, Jul 7, 2010 a 12:22 PM, Snow i eL@...> w o e:\n\n  \n\n\n\n\nThank you Fiona.  As o ha pe son who wan ed o ind ou all he why's, he e is a link, I will no pos ou con ex in o. bu i his pe son ca es o isi his page, he o she will ge he in o needed, and i won' \"pile up\" in he lis .  s    h p://www.godandscience.o g/apologe ics/kille god.h ml\n\n \n\nIn a message da ed 7/7/2010 1:35:13 P.M. Eas e n Dayligh Time, email@... w i es:\n  \n\nHi,I'm gene ally in lu k mode due o some o line p io i ies ha need my immedia e a en ion. I'll p obably be ai ly silen h ough mid-July, bu I had o speak up when his email c ossed my desk.\nWhile I don' sha e Snow i e's iews in mos cases, I' e always enjoyed he links & ban e . The eco dings a e always in e es ing... and isn' ha he ocus o his g oup?I'm no h illed wi h ul ima ums, as i he g oup isn' big enough (o big-hea ed enough) o include di e se iews, espec ully sha ed.\nMy wo cen s: Snow i e, please don' lea e!In has e,Fiona--- In EVP-ITC@yahoog oups.com, Snow i eL@... w o e:\n>> I mean he s u below, i you a e so bo he ed by opinion, Billy? I will > lea e, bu he s u in ha s a emen below o you s, is e y ou o > con ex , o each is own. I was me ely p esen ing some hing I came ac oss on he \n> You Tube, I don' e en know ha pe son. Take ca e, s"}