{"id": "17902", "subject": "Re: [EVP-ITC] TRF--manual", "author": "Frank Sumption", "timestamp": "2010-07-09T00:06:15Z", "full_text": "Thanks!\n\n F-S\n\nOn Thu, Jul 8, 2010 at 11:36 AM, &lt;SnowfireL@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Very clear Frank, heard them plus  other people talking. sf\n&gt;\n&gt;\n&gt; -----Original Message-----\n&gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt; To: evp-itc@yahoogroups.com; RTSC@yahoogroups.com\n&gt; Sent: Thu, Jul 8, 2010 12:59 pm\n&gt; Subject: [EVP-ITC] TRF--manual [1 Attachment]\n&gt;\n&gt;\n&gt;  [Attachment(s)&lt;https://mail.google.com/mail/?ui=2&view=js&name=main,tlist&ver=msMvpc35A6Q.en.&am=!5unIWCRtioyxxXse0fImgmmdR27htDEelMYI-RdG-6SL0Jv2-w&fri#129b32274e811288_TopText&gt;from Frank Sumption included below]\n&gt;  TRF=tuned radio frequency. The kind of radio that was in use when radio\n&gt; was first invented. There is a modern chip version, it has three pins and is\n&gt; very simple to set up. TRF has the advantage of less noise and static, but\n&gt; in a box the stations tend to over lap, but it still can give good results.\n&gt; It&#39;s the same radio in earlier version of the Mini box, and Chapple also\n&gt; used it in one of his projects. I have found it&#39;s best to wind the coil and\n&gt; tweak it to the radio by removing tunrs until it covers the AM band. I start\n&gt; with 70 turns of wire, the remove five at a time--or you could just wind\n&gt; sixty turns and leave it at that, but being anal I tend to over do it.\n&gt;\n&gt;  At 3 seconds &quot;April, that gorgeous (capsule)&quot;, at 6 seconds &quot;break it up&quot;,\n&gt; and 11 seconds &quot;that woman-talk to Hultay&quot;.\n&gt;\n&gt;  F-S\n&gt;\n&gt; \n&gt;\n\nThanks!\n \n F-S\nOn Thu, Jul 8, 2010 a 11:36 AM, Snow i eL@...> w o e:\n\n  \n\n\n\n\nVe y clea F ank, hea d hem plus  o he people alking. s \n\n\n\n\n-----O iginal Message-----F om: F ank Sump ion pu plealiengi l@...>To: e p-i c@yahoog oups.com; RTSC@yahoog oups.com\nSen : Thu, Jul 8, 2010 12:59 pmSubjec : [EVP-ITC] TRF--manual [1 A achmen ]\n\n  \n\n\n[A achmen (s) om F ank Sump ion included below] \n\n TRF= uned adio equency. The kind o adio ha was in use when adio was i s in en ed. The e is a mode n chip e sion, i has h ee pins and is e y simple o se up. TRF has he ad an age o less noise and s a ic, bu in a box he s a ions end o o e lap, bu i s ill can gi e good esul s. I 's he same adio in ea lie e sion o he Mini box, and Chapple also used i in one o his p ojec s. I ha e ound i 's bes o wind he coil and weak i o he adio by emo ing un s un il i co e s he AM band. I s a wi h 70 u ns o wi e, he emo e i e a a ime--o you could jus wind six y u ns and lea e i a ha , bu being anal I end o o e do i . \n\n \n A 3 seconds \"Ap il, ha go geous (capsule)\", a 6 seconds \"b eak i up\", and 11 seconds \" ha woman- alk o Hul ay\".\n \n F-S"}