{"id": "17905", "subject": "Re: [EVP-ITC] Idea,", "author": "Frank Sumption", "timestamp": "2010-07-09T05:30:44Z", "full_text": "Oh for crying out loud! No one has to read every frikkin&#39; post! If ya don&#39;t\nlike the voices/messages/e-mails don&#39;t open the damn things!  I&#39;m no\nexc&#92;pert, but I&#39;m pretty sure all e-mail programs have a freaking delete\nbutton.\n\n Not one of us &quot;knows better&quot;, so try not to judge what someone else is\ngetting.\n\n Frank-S\n\nOn Thu, Jul 8, 2010 at 3:18 PM, &lt;SnowfireL@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; *I have an idea, those that do not want any files from me, please say so,\n&gt; those on the list that do, just mail me privately, and I will share my stuff\n&gt; only with you, when I get a file that is something from Angels or whomever,\n&gt; I will just email it to you privately to see what you think.  Other wise I\n&gt; will not post my files to the lists any longer, sorry but I am not going to\n&gt; change my personality, I did not squawk at any of one else&#39;s files, all\n&gt; those other people that send in files.  Some to me might be offensive, and I\n&gt; may not care for, yet I don&#39;t say a thing, because I believe in freedom of\n&gt; speech...if you don&#39;t like what I send, just pass me up, don&#39;t even try to\n&gt; listen to them, chances are maybe you cannot hear them anyway.   I do not\n&gt; control what Spirit&#39;s say to me, how did you ever get that idea?  sf*\n&gt;\n&gt; \n&gt;\n\nOh o c ying ou loud! No one has o ead e e y ikkin' pos ! I ya don' like he oices/messages/e-mails don' open he damn hings!  I'm no exc pe , bu I'm p e y su e all e-mail p og ams ha e a eaking dele e bu on. \n\n \n No one o us \"knows be e \", so y no o judge wha someone else is ge ing. \n \n F ank-S\nOn Thu, Jul 8, 2010 a 3:18 PM, Snow i eL@...> w o e:\n\n  \n\n\n\n\nI ha e an idea, hose ha do no wan any iles om me, please say so, hose on he lis ha do, jus mail me p i a ely, and I will sha e my s u only wi h you, when I ge a ile ha is some hing om Angels o whome e , I will jus email i o you p i a ely o see wha you hink.  O he wise I will no pos my iles o he lis s any longe , so y bu I am no going o change my pe sonali y, I did no squawk a any o one else's iles, all hose o he people ha send in  iles.  Some o me migh be o ensi e, and I may no ca e o , ye I don' say a hing, because I belie e in eedom o speech...i you don' like wha I send, jus pass me up, don' e en y o lis en o hem, chances a e maybe you canno hea hem anyway.   I do no con ol wha Spi i 's say o me, how did you e e ge ha idea?  s"}