{"id": "1790", "subject": "Re: manual fm sweep as apposed to the fm sweep box", "author": "joecioppi", "timestamp": "2007-08-05T20:19:50Z", "full_text": "Hi Steve and Bruce,\n\nI would like to post my theory concerning Bruces manual sweep method.\nThe receiver he is using is likely to have a built in automatic\nfrequency control circuit. This is a sort of feedback voltage that tends\nto hang on to a tuned station while tuning past in the FM band.\n\nIf a relatively slow manual sweep is used, one would tend to hear whole\nwords or even phrases from strong stations in the band. This is the same\neffect one gets with the automatic scan tuning set for a slow scan rate.\nThe receiver dwells on a station longer and captures more of the vocal\nsegment being broadcast.\n\nI, however, can&#39;t say if any one method is better than another...except\nfor the resulting massage clarity and content received. This is judged\nby the user!\n\nJoe Cioppi\n\n--- In EVP-ITC@yahoogroups.com, &quot;Steve Hultay&quot; &lt;urkel23@...&gt; wrote:\n&gt;\n&gt; Bruce,\n&gt;\n&gt; I actually listened to your files Bruce and they seem pretty clear\n&gt; that they are answering your questions.  The problem i&#39;ve been\n&gt; fighting with is at what speed to set it at when it&#39;s automatic to\n&gt; have people not say it&#39;s just a radio DJ or part of a song.  I know\n&gt; the files are fast and are very fragmented, but there is no way to\n&gt; say it is the radio because of the speed.  You are correct in saying\n&gt; that it could be mistaken for words that our minds make up\n&gt; themselves.  I just post what i think i hear.  If i send it to 10\n&gt; people they probably would hear 10 different things or nothing at\n&gt; all.  That&#39;s the problem with any EVP, if you listen to the files\n&gt; enough no matter how you record them, you may think you hear one\n&gt; thing and convince yourself of it.  While doubters will always say\n&gt; you are nuts for hearing that.  There are no EVP experts\n&gt; unfortunately to sift through all our files and decipher them for\n&gt; us, so we just have to post what we have and let the general public\n&gt; come up with there own answers.  I will try and slow it down a bit\n&gt; and see if that does make a difference.  I never really thought to\n&gt; do that, but now that you suggested it, it seems like a good idea to\n&gt; go that direction next.  I think your manual sweep files are great\n&gt; captures, but there is really no right and wrong way to do EVP&#39;s in\n&gt; this experimental work.  It&#39;s whatever you have the best outcome\n&gt; doing i guess and stick with that.\n&gt;\n&gt; -Steve\n&gt;\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, &quot;bhali333&quot;\n&gt; paranormalinvestigating@ wrote:\n&gt; &gt;\n&gt; &gt; hi everyone,\n&gt; &gt;\n&gt; &gt; I have been experimenting with the manual FM sweep method for a\n&gt; good\n&gt; &gt; two weeks and have gotten some amazing results, but I can&#39;t help\n&gt; but\n&gt; &gt; wonder if the manual movement of the dial no matter how consistent\n&gt; you\n&gt; &gt; try to make it results in some lagging and getting caught on a\n&gt; full\n&gt; &gt; word or phrase that is coming from an actual broadcast. The\n&gt; majority of\n&gt; &gt; messages I have been getting are direct answers to questions or a\n&gt; &gt; phrase or sentence that is obviously put together by different\n&gt; bits and\n&gt; &gt; pieces of the FM signals. I would like to know what you think of\n&gt; the\n&gt; &gt; manual sweep versus the automatic, I know Steve does his research\n&gt; using\n&gt; &gt; the automatic FM sweep box and I have been working with the manual\n&gt; &gt; method. When I listen to Steve&#39;s captures they seem to be very\n&gt; fast and\n&gt; &gt; that to me makes it harder to understand and gives the opportunity\n&gt; for\n&gt; &gt; mistaking the sound of a word. the manual method on the other hand\n&gt; is\n&gt; &gt; slower and may give the opportunity to catch a broadcast word or\n&gt; two\n&gt; &gt; like I said so the question is which one do you think is more\n&gt; reliable ?\n&gt; &gt;\n&gt; &gt; Bruce\n&gt; &gt;\n&gt;"}