{"id": "17923", "subject": "Re: Last nights files,", "author": "rasterer", "timestamp": "2010-07-09T18:13:06Z", "full_text": "I don&#39;t see how posting a prediction only you can confirm has any bearing on demonstrating anything other than that you believe.  It means nothing else.\n\nIf you have a post with a prediction we can all confirm, I&#39;d love to hear it.  \n\nBefore it is supposed to happen, with a date it is supposed to happen, and exactly what is to happen, of course.\n\nWe&#39;ve already got lots of end-of-the-world stuff from Frank on 2012.  So we can skip those.  We can measure that validity of that in 2012.\n\n\n\n--- In EVP-ITC@yahoogroups.com, SnowfireL@... wrote:\n&gt;\n&gt; RJ, I have plenty of files with things from past events, I posted them  \n&gt; before it came true, that was back last year, are you new on the list?  My  \n&gt; bird got lost last year, and spirit via the RS told me where to find her, I \n&gt; did,  maybe it&#39;s subjective, if you have a problem with this type of research,  \n&gt; sf\n&gt;  \n&gt;  \n&gt; In a message dated 7/9/2010 1:49:03 P.M. Eastern Daylight Time,  \n&gt; rasterer@... writes:\n&gt; \n&gt;  \n&gt;  \n&gt;  \n&gt; Why do you call what I say mean?  Is it because I  hold a different opinion \n&gt; to yours?  Just because I am honest about  my observations of a technology \n&gt; does not make me &#39;mean&#39;, does  it?\n&gt; \n&gt; Also, even though you said you got &quot;lots of prediction type files&quot;, it \n&gt; doesn&#39;t apply as  any kind of proof when it is talked about after the fact.  The \n&gt;  predictions must be clear to everyone before they happen, and not  subject \n&gt; to misinterpretation, generalization, or vague dating.   (Like \n&gt; _nostradamus_ \n&gt; (https://encrypted.google.com/search?hl=en&&sa=X&ei=KmA3TJyVFYublgeu2LyjBg&ved=0CBYQBSgA&q=nostradamus&spell=1)   usually is).\n&gt; \n&gt; I also must point out, when I give an observation on  a technique or \n&gt; device, it is not my observation that you all argue  against: rather, you attack \n&gt; me personally (accusing me of not posting  enough EVPs, or of being mean).  \n&gt; That&#39;s the mean part, not  me.\n&gt; \n&gt; \n&gt; \n&gt; --- On Fri, 7/9/10, SnowfireL@..., 7/9/10, S&lt;SnowfireL@...&gt; wrote:\n&gt; \n&gt; \n&gt; From:  SnowfireL@...:&lt;SnowfireL@...&gt;\n&gt; Subject: Re:  [EVP-ITC] Last nights files,\n&gt; To:  EVP-ITC@yahoogroupsTo: \n&gt; Date: Friday, July 9, 2010, 10:40  AM\n&gt; \n&gt; \n&gt;  \n&gt; Why are you being so mean  to people RJ?  We&#39;ve all gotten lots of \n&gt; prediction type files,  that have come true, last year some spirit even found my \n&gt; lost  bird, and she was right where they said she&#39;d be. sf\n&gt;  \n&gt;  \n&gt; In a message dated 7/9/2010  1:34:00 P.M. Eastern Daylight Time, \n&gt; rasterer@yahoo. com  writes:\n&gt; \n&gt;  \n&gt; &quot;   So RJ--where&#39;s your EVPs?  How can a skeptic type judge others research \n&gt; if he don&#39;t do  any research? Like a food critic that only dines at  \n&gt; MacDonald&#39;s, yet critiques major restaurants. &quot;\n&gt; \n&gt; I  wouldn&#39;t waste anyone&#39;s time  by posting a bunch of radio  snippets that \n&gt; &quot;Sound like something&quot;.  I would post one  if it ever actually seemed proof \n&gt; of intelligent communication  to me: for example, a bunch of consistent \n&gt; predictions, posted  before the event, read by all, then confirmed  afterwards. \n&gt;  That would be the only worthwhile thing to  post that I can think of.\n&gt; \n&gt; Since I have never gotten  anything like that, I have not posted it.\n&gt; \n&gt; And I notice  neither have you.\n&gt; \n&gt; \n&gt; --- On Fri, 7/9/10, Frank  Sumption &lt;purplealiengirl@ gmail.com&gt;  wrote:\n&gt; \n&gt; \n&gt; From:  Frank Sumption &lt;purplealiengirl@  gmail.com&gt;\n&gt; Subject: Re: [EVP-ITC] Last nights  files,\n&gt; To: EVP-ITC@yahoogroups .com\n&gt; Date: Friday, July  9, 2010, 9:12 AM\n&gt; \n&gt; \n&gt;  \n&gt; So RJ--where&#39;s your EVPs? How can a skeptic type  judge others research if \n&gt; he don&#39;t do any research? Like a  food critic that only dines at \n&gt; MacDonald&#39;s, yet critiques  major restaurants.\n&gt;  \n&gt; &quot;I think your instinct to stop posting this stuff might  have been a good \n&gt; one. I suspect you are feeling a bit  overwhelmed with this field right now, \n&gt; and it may be  something is nagging at you inside someplace, saying it is a  \n&gt; waste of your time or a burden on your life and health, or  that you just \n&gt; need a little more space for a while.&quot;\n&gt;  \n&gt;  It&#39;s a knowing we all have, that there&#39;s  something to this, that it&#39;s \n&gt; amazing, yet remains unprovable  to others. \n&gt;  \n&gt;  F-S\n&gt; \n&gt; \n&gt; On Fri, Jul 9, 2010 at 9:04 AM, Rj  &lt;rasterer@yahoo. com&gt; wrote:\n&gt; \n&gt;  \n&gt;  \n&gt;  \n&gt;  \n&gt; \n&gt; &quot;I do not  control what spirits say though, after all they are  just people \n&gt; too.  &quot;\n&gt; \n&gt; Actually, it&#39;s more  interesting than that.  Not only do you not  control \n&gt; what the &#39;spirits&#39; say, you also don&#39;t  control what broadcast radio says, \n&gt; and to a large  extent you don&#39;t control what your brain finds and  interprets \n&gt; in the noise you are hearing.\n&gt; \n&gt; I  listened to these (trying not to look at the labels,  since once a \n&gt; person looks at the labels, they prime  their brains to interpret the sounds in \n&gt; YOUR way,  not their own way).  To me, they were either  just a mess of \n&gt; random radio snippets, exactly what  you&#39;d expect if a 3 year old were randomly \n&gt; twisting  the radio dial, or they were just noise.   Nothing paranormal in \n&gt; the least.\n&gt; \n&gt; I think your  instinct to stop posting this stuff might have been  a good \n&gt; one. I suspect you are feeling a bit  overwhelmed with this field right now, \n&gt; and it may be  something is nagging at you inside someplace, saying  it is a \n&gt; waste of your time or a burden on your life  and health, or that you just \n&gt; need a little more  space for a while.\n&gt; \n&gt; In any case, I&#39;d recommend  a break: take a nice month off.  See how you  \n&gt; feel being away from all this for a while.   Come back fresh if you feel ok \n&gt; after that.  But  if you feel obsessed when away, it might be good to  ask \n&gt; your friends and loved ones for some opinions on  what they see in you.  Your \n&gt; health is more  important than anything here anyways, and you can&#39;t  really \n&gt; do a job with interpretation of your results,  much less your other \n&gt; responsibilities in life,  unless you put your health first.\n&gt; \n&gt; \n&gt; --- On  Fri, 7/9/10, SnowfireL@aol. com &lt;SnowfireL@aol. com&gt;  wrote:\n&gt; \n&gt; \n&gt; From:  SnowfireL@aol. com &lt;SnowfireL@aol.  com&gt;\n&gt; Subject: [EVP-ITC] Last nights  files, [13 Attachments]\n&gt; To: inside_the_box_ rtsc_ghost_  box_research@ yahoogroups. com, \n&gt; EVP-ITC@yahoogroups .com, RTSC@yahoogroups. com\n&gt; Date:  Friday, July 9, 2010, 7:26 AM\n&gt; \n&gt; \n&gt;  \n&gt; Well, got no  response out of the other list, let&#39;s see if any  of you \n&gt; folks on these lists can hear these at all.  They may be too fast, but I did try \n&gt; to  slow them a bit,  I know, these are very  hard to hear, got them last \n&gt; night in response to  Steve&#39;s letter about all the  &quot;religious&quot;  crap I&#39;ve \n&gt; been sending,   such weird files I sometimes send in lately.  I do not control \n&gt; what spirits say though,  after all they are just people too.  Got one  on \n&gt; here that&#39;s really funny, I think it has a  little demon on it too, he seems \n&gt; very angry, and  wants someone to &quot;Let me out!  Let me out!&quot;  is what he is \n&gt; saying, I think he is wanting to  come after some folks, because, even \n&gt; demon&#39;s  believe in God.  He really sounds mad at some  people and wants \n&gt; &quot;.....out,&quot; just going to let you  hear it, may need to play it several times to  \n&gt; hear, but I think its kinda cute. I told them  what some on the lists were \n&gt; saying,  and this was the response.  btw  Is  someone going to Florida ?  The \n&gt; last one says  something about FL Hope you all enjoy them.  sf\n&gt;"}