{"id": "17936", "subject": "Re: [EVP-ITC] waves,", "author": "Zack Widup", "timestamp": "2010-07-10T04:31:35Z", "full_text": "Hmm ... even with the cheapest AM radio with a loopstick antenna, you should\nbe able to get stations in the daytime a couple hundred miles away unless\nyou&#39;re in a metal building. At night you should be able to get AM stations\nup to 500-1000 miles away. I&#39;m listening to WBZ in Boston on 1030 right now\nfrom Illinois. If you&#39;re not, I&#39;d say there&#39;s something wrong with your\nradio.\n\nZack\n\nOn Fri, Jul 9, 2010 at 9:16 PM, &lt;SnowfireL@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Tks. Zack, I get virtually no AM here, because I am rural, in the woods,\n&gt; most people I think are using AM to pick up the voice&#39;s, I have a large\n&gt; antenna on the roof, I have no idea if that has anything to do with it or\n&gt; not, and I have satellites for tv, and a wireless Y on the pc, There&#39;s got\n&gt; to be something we not seeing in how they are communicating, they may not\n&gt; really be using just a radio signal, but something else over the top of it\n&gt; or through? sf\n&gt;\n&gt;  In a message dated 7/9/2010 9:10:57 P.M. Eastern Daylight Time,\n&gt; w9sz.zack@... writes:\n&gt;\n&gt;\n&gt;\n&gt; The range of frequencies generally considered longwave are BELOW the AM\n&gt; broadcast band in frequency - in the vicinity of 100 to 400 kHz (or even\n&gt; lower). The wavelength of these frequencies ranges from 750 to 3000 meters -\n&gt; approximately 0.5 to 1.8 miles. The longwave part of the spectrum is not\n&gt; conducive to radio transmissions of wide bandwidth. In Europe there are some\n&gt; AM radio stations in the 2000 to 1000 meter range. Very large antennas are\n&gt; usually needed. In the USA, there are airport beacons in this frequency\n&gt; range which send Morse code identifiers.\n&gt;\n&gt; FM is in the VHF part of the spectrum. The wavelengths range from 2.8\n&gt; to 3.4 meters - about 9.2 to 11.2 feet.\n&gt;\n&gt; Zack\n&gt;\n&gt; On Fri, Jul 9, 2010 at 7:32 PM, &lt;SnowfireL@...&gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; Does any one know anything about long wave lengths? And wide band widths?\n&gt;&gt; Is FM a long wave?  My RS do not get signal on the AM where I am, and there\n&gt;&gt; are limited stations here, actually only one or two radio stations, and they\n&gt;&gt; are anywhere from 50 to 60 miles away for the closest very few stations.\n&gt;&gt; For the heck of it I asked if they need the long wave, i got a &quot;yes&quot; out of\n&gt;&gt; a guy, wish I knew how to make these things. sf\n&gt;&gt;\n&gt;&gt;\n&gt;   \n&gt;\n\nHmm ... e en wi h he cheapes AM adio wi h a loops ick an enna, you should be able o ge s a ions in he day ime a couple hund ed miles away unless you' e in a me al building. A nigh you should be able o ge AM s a ions up o 500-1000 miles away. I'm lis ening o WBZ in Bos on on 1030  igh now om Illinois. I you' e no , I'd say he e's some hing w ong wi h you adio.\n\n \nZack\n \nOn F i, Jul 9, 2010 a 9:16 PM, Snow i eL@aol.com> w o e:\n\n  \n\n\n\n\nTks. Zack, I ge i ually no AM he e, because I am u al, in he woods, mos people I hink a e using AM o pick up he oice's, I ha e a la ge an enna on he oo , I ha e no idea i ha has any hing o do wi h i o no , and I ha e sa elli es o , and a wi eless Y on he pc, The e's go o be some hing we no seeing in how hey a e communica ing, hey may no eally be using jus a adio signal, bu some hing else o e he op o i o h ough? s \n\n\n \n\nIn a message da ed 7/9/2010 9:10:57 P.M. Eas e n Dayligh Time, w9sz.zack@... w i es:\n  \n\n\nThe ange o equencies gene ally conside ed longwa e a e BELOW he AM b oadcas band in equency - in he icini y o 100 o 400 kHz (o e en lowe ). The wa eleng h o hese equencies anges om 750 o 3000 me e s - app oxima ely 0.5 o 1.8 miles. The longwa e pa o he spec um is no conduci e o adio ansmissions o wide bandwid h. In Eu ope he e a e some AM adio s a ions in he 2000 o 1000 me e ange. Ve y la ge an ennas a e usually needed. In he USA, he e a e ai po beacons in his equency ange which send Mo se code iden i ie s.\n\n \nFM is in he VHF pa o he spec um. The wa eleng hs ange om 2.8 o 3.4 me e s - abou 9.2 o 11.2 ee .\n \nZack\nOn F i, Jul 9, 2010 a 7:32 PM, Snow i eL@...> w o e:\n\n  \n\n\n\n\nDoes any one know any hing abou long wa e leng hs? And wide band wid hs?  Is FM a long wa e?  My RS do no ge signal on he AM whe e I am, and he e a e limi ed s a ions he e, ac ually only one o wo adio s a ions, and hey a e anywhe e om 50 o 60 miles away o he closes e y ew s a ions.  Fo he heck o i I asked i hey need he long wa e, i go a \"yes\" ou o a guy, wish I knew how o make hese hings. s"}