{"id": "17932", "subject": "Re: [EVP-ITC] Last nights files,", "author": "Frank Sumption", "timestamp": "2010-07-10T02:31:34Z", "full_text": "Translation--don&#39;t do any recordings of my own.. Yet, critique others\nresults.  I have gotten predictions that did in fact come true, but like a\nskeptic moron, I thought no frikkin&#39; way and didn&#39;t post it.\n\n F-S\n\nOn Fri, Jul 9, 2010 at 11:01 AM, Rj &lt;rasterer@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;   &quot;   So RJ--where&#39;s your EVPs? How can a skeptic type judge others\n&gt; research if he don&#39;t do any research? Like a food critic that only dines at\n&gt; MacDonald&#39;s, yet critiques major restaurants.&quot;\n&gt;\n&gt; I wouldn&#39;t waste anyone&#39;s time  by posting a bunch of radio snippets that\n&gt; &quot;Sound like something&quot;.  I would post one if it ever actually seemed proof\n&gt; of intelligent communication to me: for example, a bunch of consistent\n&gt; predictions, posted before the event, read by all, then confirmed\n&gt; afterwards.  That would be the only worthwhile thing to post that I can\n&gt; think of.\n&gt;\n&gt; Since I have never gotten anything like that, I have not posted it.\n&gt;\n&gt; And I notice neither have you.\n&gt;\n&gt;\n&gt;\n&gt; --- On *Fri, 7/9/10, Frank Sumption &lt;purplealiengirl@...&gt;* wrote:\n&gt;\n&gt;\n&gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt; Subject: Re: [EVP-ITC] Last nights files,\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Friday, July 9, 2010, 9:12 AM\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;  So RJ--where&#39;s your EVPs? How can a skeptic type judge others research if\n&gt; he don&#39;t do any research? Like a food critic that only dines at MacDonald&#39;s,\n&gt; yet critiques major restaurants.\n&gt;\n&gt; &quot;I think your instinct to stop posting this stuff might have been a good\n&gt; one. I suspect you are feeling a bit overwhelmed with this field right now,\n&gt; and it may be something is nagging at you inside someplace, saying it is a\n&gt; waste of your time or a burden on your life and health, or that you just\n&gt; need a little more space for a while.&quot;\n&gt;\n&gt;  It&#39;s a knowing we all have, that there&#39;s something to this, that it&#39;s\n&gt; amazing, yet remains unprovable to others.\n&gt;\n&gt;  F-S\n&gt;\n&gt; On Fri, Jul 9, 2010 at 9:04 AM, Rj &lt;rasterer@yahoo. com&lt;http://mc/compose?to=rasterer@...&gt;\n&gt; &gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; &quot;*I do not control what spirits say though, after all they are just\n&gt;&gt; people too. &quot;\n&gt;&gt;\n&gt;&gt; *Actually, it&#39;s more interesting than that.  Not only do you not control\n&gt;&gt; what the &#39;spirits&#39; say, you also don&#39;t control what broadcast radio says,\n&gt;&gt; and to a large extent you don&#39;t control what your brain finds and interprets\n&gt;&gt; in the noise you are hearing.\n&gt;&gt;\n&gt;&gt; I listened to these (trying not to look at the labels, since once a person\n&gt;&gt; looks at the labels, they prime their brains to interpret the sounds in YOUR\n&gt;&gt; way, not their own way).  To me, they were either just a mess of random\n&gt;&gt; radio snippets, exactly what you&#39;d expect if a 3 year old were randomly\n&gt;&gt; twisting the radio dial, or they were just noise.  Nothing paranormal in the\n&gt;&gt; least.\n&gt;&gt;\n&gt;&gt; I think your instinct to stop posting this stuff might have been a good\n&gt;&gt; one. I suspect you are feeling a bit overwhelmed with this field right now,\n&gt;&gt; and it may be something is nagging at you inside someplace, saying it is a\n&gt;&gt; waste of your time or a burden on your life and health, or that you just\n&gt;&gt; need a little more space for a while.\n&gt;&gt;\n&gt;&gt; In any case, I&#39;d recommend a break: take a nice month off.  See how you\n&gt;&gt; feel being away from all this for a while.  Come back fresh if you feel ok\n&gt;&gt; after that.  But if you feel obsessed when away, it might be good to ask\n&gt;&gt; your friends and loved ones for some opinions on what they see in you.  Your\n&gt;&gt; health is more important than anything here anyways, and you can&#39;t really do\n&gt;&gt; a job with interpretation of your results, much less your other\n&gt;&gt; responsibilities in life, unless you put your health first.\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; --- On *Fri, 7/9/10, SnowfireL@aol. com&lt;http://mc/compose?to=SnowfireL@...&gt;\n&gt;&gt; &lt;SnowfireL@aol. com &lt;http://mc/compose?to=SnowfireL@...&gt;&gt;* wrote:\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; From: SnowfireL@aol. com &lt;http://mc/compose?to=SnowfireL@...&gt; &lt;SnowfireL@aol.\n&gt;&gt; com &lt;http://mc/compose?to=SnowfireL@...&gt;&gt;\n&gt;&gt; Subject: [EVP-ITC] Last nights files, [13 Attachments]\n&gt;&gt; To: inside_the_box_ rtsc_ghost_ box_research@ yahoogroups. com&lt;http://mc/compose?to=inside_the_box_rtsc_ghost_box_research@yahoogroups.com&gt;,\n&gt;&gt; EVP-ITC@yahoogroups .com &lt;http://mc/compose?to=EVP-ITC@yahoogroups.com&gt;, RTSC@yahoogroups.\n&gt;&gt; com &lt;http://mc/compose?to=RTSC@yahoogroups.com&gt;\n&gt;&gt; Date: Friday, July 9, 2010, 7:26 AM\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; *Well, got no response out of the other list, let&#39;s see if any of you\n&gt;&gt; folks on these lists can hear these at all. They may be too fast, but I did\n&gt;&gt; try to slow them a bit,  I know, these are very hard to hear, got them last\n&gt;&gt; night in response to Steve&#39;s letter about all the &quot;religious&quot;  crap I&#39;ve\n&gt;&gt; been sending,  such weird files I sometimes send in lately.  I do not\n&gt;&gt; control what spirits say though, after all they are just people too.  Got\n&gt;&gt; one on here that&#39;s really funny, I think it has a little demon on it too, he\n&gt;&gt; seems very angry, and wants someone to &quot;Let me out!  Let me out!&quot; is what he\n&gt;&gt; is saying, I think he is wanting to come after some folks, because, even\n&gt;&gt; demon&#39;s believe in God.  He really sounds mad at some people and wants\n&gt;&gt; &quot;.....out,&quot; just going to let you hear it, may need to play it several times\n&gt;&gt; to hear, but I think its kinda cute. I told them what some on the lists\n&gt;&gt; were saying, and this was the response.  btw  Is someone going to Florida ?\n&gt;&gt; The last one says something about FL Hope you all enjoy them. sf*\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;\n&gt; \n&gt;\n\nT ansla ion--don' do any eco dings o my own.. Ye , c i ique o he s esul s.  I ha e go en p edic ions ha did in ac come ue, bu like a skep ic mo on, I hough no ikkin' way and didn' pos i .  \n\n \n F-S\nOn F i, Jul 9, 2010 a 11:01 AM, Rj as e e @...> w o e:\n\n  \n\n\n\n\n\n\n\n\n\"   So RJ--whe e's you EVPs? How can a skep ic ype judge o he s esea ch i he don' do any esea ch? Like a ood c i ic ha only dines a MacDonald's, ye c i iques majo es au an s.\"\nI wouldn' was e anyone's ime  by pos ing a bunch o adio snippe s ha \"Sound like some hing\".  I would pos one i i e e ac ually seemed p oo o in elligen communica ion o me: o example, a bunch o consis en p edic ions, pos ed be o e he e en , ead by all, hen con i med a e wa ds.  Tha would be he only wo hwhile hing o pos ha I can hink o .\nSince I ha e ne e go en any hing like ha , I ha e no pos ed i .And I no ice nei he ha e you. \n--- On F i, 7/9/10, F ank Sump ion pu plealiengi l@...> w o e:\n\nF om: F ank Sump ion pu plealiengi l@...>Subjec : Re: [EVP-ITC] Las nigh s iles,To: EVP-ITC@yahoog oups.com\nDa e: F iday, July 9, 2010, 9:12 AM \n\n  \n\n\n So RJ--whe e's you EVPs? How can a skep ic ype judge o he s esea ch i he don' do any esea ch? Like a ood c i ic ha only dines a MacDonald's, ye c i iques majo es au an s.\n \n\"I hink you ins inc o s op pos ing his s u migh ha e been a good one. I suspec you a e eeling a bi o e whelmed wi h his ield igh now, and i may be some hing is nagging a you inside someplace, saying i is a was e o you ime o a bu den on you li e and heal h, o ha you jus need a li le mo e space o a while.\"\n\n \n I 's a knowing we all ha e, ha he e's some hing o his, ha i 's amazing, ye emains unp o able o o he s. \n \n F-S\nOn F i, Jul 9, 2010 a 9:04 AM, Rj as e e @yahoo. com> w o e:\n\n  \n\n\n\n\n\n\n\n\"I do no con ol wha spi i s say hough, a e all hey a e jus people oo. \"Ac ually, i 's mo e in e es ing han ha .  No only do you no con ol wha he 'spi i s' say, you also don' con ol wha b oadcas adio says, and o a la ge ex en you don' con ol wha you b ain inds and in e p e s in he noise you a e hea ing.\nI lis ened o hese ( ying no o look a he labels, since once a pe son looks a he labels, hey p ime hei b ains o in e p e he sounds in YOUR way, no hei own way).  To me, hey we e ei he jus a mess o andom adio snippe s, exac ly wha you'd expec i a 3 yea old we e andomly wis ing he adio dial, o hey we e jus noise.  No hing pa ano mal in he leas .\nI hink you ins inc o s op pos ing his s u migh ha e been a good one. I suspec you a e eeling a bi o e whelmed wi h his ield igh now, and i may be some hing is nagging a you inside someplace, saying i is a was e o you ime o a bu den on you li e and heal h, o ha you jus need a li le mo e space o a while.\nIn any case, I'd ecommend a b eak: ake a nice mon h o .  See how you eel being away om all his o a while.  Come back esh i you eel ok a e ha .  Bu i you eel obsessed when away, i migh be good o ask you iends and lo ed ones o some opinions on wha hey see in you.  You heal h is mo e impo an han any hing he e anyways, and you can' eally do a job wi h in e p e a ion o you esul s, much less you o he esponsibili ies in li e, unless you pu you heal h i s .\n--- On F i, 7/9/10, Snow i eL@aol. com Snow i eL@aol. com> w o e:\n\nF om: Snow i eL@aol. com Snow i eL@aol. com>\nSubjec : [EVP-ITC] Las nigh s iles, [13 A achmen s]To: inside_ he_box_ sc_ghos _ box_ esea ch@ yahoog oups. com, EVP-ITC@yahoog oups .com, RTSC@yahoog oups. com\nDa e: F iday, July 9, 2010, 7:26 AM\n  \n\n\nWell, go no esponse ou o he o he lis , le 's see i any o you olks on hese lis s can hea hese a all. They may be oo as , bu  I did y o slow hem a bi ,  I know,  hese a e e y ha d o hea , go hem las nigh in esponse o S e e's le e abou all  he \" eligious\"  c ap I' e been sending,  such wei d iles I some imes send in la ely.  I do no con ol wha spi i s say hough, a e all hey a e jus people oo.  Go one on he e ha 's eally unny, I hink i has a li le demon on i oo, he seems e y ang y, and wan s someone o \"Le me ou !  Le me ou !\" is wha he is saying, I hink he is wan ing o come a e some olks, because, e en demon's belie e in God.  He eally sounds mad a some people and wan s \".....ou ,\" jus going o le you hea i , may need o play i se e al imes o hea , bu I hink i s kinda cu e. I old hem wha  some on he lis s we e saying, and his was he esponse.  b w  Is someone going o Flo ida ?  The las one says some hing abou FL Hope you all enjoy hem. s"}