{"id": "17952", "subject": "Re: [EVP-ITC] Just the chamber and speaker", "author": "Frank Sumption", "timestamp": "2010-07-10T17:56:34Z", "full_text": "When I first &quot;got&quot; the idea for the box, using a chamber was poionted out\nto me kinda telepathicly. It seems to function as a space where the sound\ncan be manipulated easier by the entities, and using different materials\nseems to get different levels. When I use aluminum, that seems to facilitate\nET contact more often than not using the chamber. Using pipe helps make the\nchambers smaller. Thre seems to be a filtering effect by the chamber that\ntends to enhance the voices. Most of the boxes I make have an option to use\nthe chambers.\n\n The mind contact that poined out the chamber--I think--was that shadow guy\non the group home page.\n\n F-S\n\nOn Sat, Jul 10, 2010 at 12:30 AM, &lt;SnowfireL@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Frank, do those pipes lessen the static a bit?  What is it used for?\n&gt;\n&gt;  In a message dated 7/10/2010 2:15:19 A.M. Eastern Daylight Time,\n&gt; purplealiengirl@... writes:\n&gt;\n&gt;\n&gt;\n&gt;  The small hole is for the mic. At 7 seconds &quot;smoking and you stay right\n&gt; here&quot;. Smoke for 35 years and even after five or six or whatever it&#39;s been\n&gt; years of not smoking, it still crosses my mind from time to time, and this\n&gt; is the imediate response.\n&gt;\n&gt;  F-S\n&gt;\n&gt;   \n&gt;\n\nWhen I i s \"go \" he idea o he box, using a chambe was poion ed ou o me kinda elepa hicly. I seems o unc ion as a space whe e he sound can be manipula ed easie by he en i ies, and using di e en ma e ials seems o ge di e en le els. When I use aluminum, ha seems o acili a e ET con ac mo e o en han no using he chambe . Using pipe helps make he chambe s smalle . Th e seems o be a il e ing e ec by he chambe ha ends o enhance he oices. Mos o he boxes I make ha e an op ion o use he chambe s. \n\n \n The mind con ac ha poined ou he chambe --I hink--was ha shadow guy on he g oup home page. \n \n F-S\nOn Sa , Jul 10, 2010 a 12:30 AM, Snow i eL@...> w o e:\n\n  \n\n\n\n\nF ank, do hose pipes lessen he s a ic a bi ?  Wha is i used o ?\n\n \n\nIn a message da ed 7/10/2010 2:15:19 A.M. Eas e n Dayligh Time, pu plealiengi l@gmail.com w i es:\n  \n\n\n The small hole is o he mic. A 7 seconds \"smoking and you s ay igh he e\". Smoke o 35 yea s and e en a e i e o six o wha e e i 's been yea s o no smoking, i s ill c osses my mind om ime o ime, and his is he imedia e esponse. \n\n \n F-S"}