{"id": "17955", "subject": "Re: Last nights files,", "author": "rasterer", "timestamp": "2010-07-10T19:29:10Z", "full_text": "Again, posting stories after the fact isn&#39;t a good example.\n\nSince I agree with Frank&#39;s sentiments of &quot;I just take the approach, try different methods, see what works. I go on the results I get&quot;, let me see if I can help there in determining &quot;what works&quot;.\n\nI will post an experiment shortly. I hope you will participate.\n\nRj\n\n\n--- In EVP-ITC@yahoogroups.com, SnowfireL@... wrote:\n&gt;\n&gt;  \n&gt; \n&gt;  RJ, I do not need to post things all over the net, I only took the time to locate some old files from last year just for you, not for glory dear heart.  And if you took the time to listen you would see in the messages that the girl had not yet been found, she as she was only missing one day, I got this all on the first day from spirit, and I asked spirit if I should call it in, which i did, the police did not know it was from Spirit, he thought it was just people talking in a bar or something, I did not tell him what it was, but he took down the information, I am not claiming to have been the clue for the people at all, but they did find her body right in the wall and the guy that killed her was indeed the same name given by the spirit, there are people on the these lists that do remember this, but I think it was Bruce&#39;s list, he could verify it please don&#39;t keep bothering me with such mundane talk, i am not going to respond anymore to you, this is silly, if I cannot convince you, then I leave it in the hands of the Great Almighty, Peace lets be still, sf\n&gt; \n&gt; \n&gt; \n&gt; -----Original Message-----\n&gt; From: Rj rasterer@...\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Sat, Jul 10, 2010 9:59 am\n&gt; Subject: Re: [EVP-ITC] Re: Last nights files,\n&gt; \n&gt;                                              If you want to post a prediction, post one.  Give specific dates and details.  Try not to make it for something that is already all over the news and whose outcome is already pretty obvious.\n&gt; \n&gt; You keep saying you don&#39;t need to prove this stuff, then you keep trying to post proof.  Just giving more stories from the past does not prove anything.  No one can confirm the story: and I&#39;ll bet, even though you claim to have gone to the police with it, you will not be able to even produce the police report.  And I&#39;ll bet there was not one mention in a newspaper that the case was solved by EVPs.  Must be a conspiracy :)\n&gt; \n&gt; We can also not confirm that the stuff you are telling the police wasn&#39;t already all over the news: which is how I&#39;ve noticed many EVP interpretations seems operate: you hear what is already on your  mind.\n&gt; \n&gt; So if you have a prediction,  post it far and wide, if you think it could help people or save their lives.  What does it say about you, if could have helped people, and turned your back?\n&gt; \n&gt; It&#39;s this kind of thing that turns believers, and even open-minded people, into skeptics.\n&gt; \n&gt; \n&gt; --- On Fri, 7/9/10, SnowfireL@... SnowfireL@... wrote:\n&gt; \n&gt; From: SnowfireL@... SnowfireL@...\n&gt; Subject: Re: [EVP-ITC] Re: Last nights files, [15 Attachments]\n&gt; To: EVP-ITC@yahoogroups.com, inside_the_box_rtsc_ghost_box_research@yahoogroups.com, RTSC@yahoogroups.com\n&gt; Date: Friday, July 9, 2010, 9:16 PM\n&gt; \n&gt;                                                 Ok, here is your &quot;evidence&quot; RJ, last year in spring a  girl was killed, her name was Annie Le, back then i was new to this but, got  some great files, which i gave let police hear on DAY  ONE of her being only still missing.  Even in the files themselves  some spirits are telling me she is dead, her voice came through, I have tons of  them, these are a few, and yes I left what they say on them, some are clearer  then others, and if the police officer was able to hear them, you should be  able to as well. I don&#39;t know why i even bother to worry my head over doubters  anyway.  I posted these to all three lists, because Bruce can  verify what happened  back then too.   You will also  find that the files themselves verify this by the questions asked of  them.   Enjoy,  sf \n&gt;   \n&gt;   In a message dated 7/9/2010 7:15:49 P.M. Eastern Daylight Time,  rasterer@yahoo. com writes:\n&gt;                              Very good example of my points:\n&gt; More &#39;personal&#39;          claims. \n&gt; More attacks on the person with a different opinion (hard          hearted, close minded, etc)\n&gt; And still, no addressing the problems of          lack of credible evidence.\n&gt; The problem that noise can &#39;sound like          something&#39;, but that doesn&#39;t make it from spirits.\n&gt; The problem of          claims of predictions, but no predictions.\n&gt; \n&gt; Nicely          done.\n&gt; \n&gt; \n&gt; --- On Fri, 7/9/10, SnowfireL@aol. com          SnowfireL@aol. com&gt; wrote:\n&gt;          \n&gt; From:            SnowfireL@aol. com SnowfireL@aol. com&gt;\n&gt; Subject: Re:            [EVP-ITC] Re: Last nights files,\n&gt; To:            EVP-ITC@yahoogroups .com\n&gt; Date: Friday, July 9, 2010, 3:40            PM\n&gt; \n&gt;                                    \n&gt;            Well, for me, I am satisfied, they do not need to            prove anything more to me, I have already received all the convincing            I need, I spoke to my mother many times in spirit, hearing her voice,            not to mention many other people I know personally, I feel bad for            folks who are so materialistic that they cannot see any further than            the old brick wall surrounding them, even if one should knock it down            these type of people then question if they ever saw the wall to begin            with, their mind&#39;s are so closed, the hearts so hardened. My motto is            something more like this statement, it&#39;s only with the heart that one            can see clearly, what&#39;s essential is invisible to the eye, no matter            what a person might demonstrate to such a skeptic would not convince            them, so it&#39;s best you live in your world, and I will stay in            mine.  And to each is own, sf ps. i like to use the colors            because that&#39;s what they are there for. :)\n&gt; \n&gt;            \n&gt; \n&gt;            \n&gt; \n&gt; -----Original Message-----\n&gt; From: Rj            rasterer@yahoo. com&gt;\n&gt; To: EVP-ITC@yahoogroups .com\n&gt; Sent:            Fri, Jul 9, 2010 4:02 pm\n&gt; Subject: Re: [EVP-ITC] Re: Last nights            files,\n&gt; \n&gt;                                                                                                                         Stories about things in the past are not testable                  predictions, and continue to suggest this is all just radio                  snippets that people claim are spirits, but have nothing to                  justify that claim.  \n&gt; \n&gt; Like I said, post a prediction                  for everyone to hear, before it happens, with specific dates and                  details.  If it happens, I would expect to be more                  interested that this is not just random radio. But, when it                  doesn&#39;t happen, it makes me wonder why people still claim it&#39;s                  spirits, but they must be lying. :-)\n&gt; \n&gt; \n&gt; \n&gt; --- On                  Fri, 7/9/10, SnowfireL@aol. com SnowfireL@aol.                  com&gt; wrote:\n&gt;                  \n&gt; From:                    SnowfireL@aol. com SnowfireL@aol. com&gt;\n&gt; Subject: Re:                    [EVP-ITC] Re: Last nights files,\n&gt; To: EVP-ITC@yahoogroups                    .com\n&gt; Date: Friday, July 9, 2010, 11:33 AM\n&gt; \n&gt;                                                                               RJ, unless you lived here of course                    you would not have proof of things, as you were not here when                    the event happened, so what&#39;s the deal?  You might get                    hit on the top of your head with a brick one day, and tell us                    what happened, why would any one else have cause to believe                    you?  What type of prediction you would like to                    have?  Maybe some spirit out there could give you                    one, forget the lotto, it&#39;s rigged, last year I got names,                    happenings for that murdered girl before they ever found her                    body, and yes, I played it for the police, and also posted the                    files on the lists, police did find her body right where                    spirit said it was, &quot;in the wall&quot; even gave first and last                    name of the same guy that did it, as well as the job he                    did too.  This work is subjective to the person, we                    all have different acuity I have nothing to prove to you, I do                    not need to prove what i get to anyone.  I feel these                    lists are for learning, and discovery. sf\n&gt;                     \n&gt;                                       In a message dated 7/9/2010 2:19:05 P.M. Eastern Daylight                    Time, rasterer@yahoo. com writes:\n&gt;                                                                I don&#39;t see how posting a prediction only you can                      confirm has any bearing on demonstrating anything other than                      that you believe. It means nothing else.\n&gt; \n&gt; If you have                      a post with a prediction we can all confirm, I&#39;d love to                      hear it. \n&gt; \n&gt; Before it is supposed to happen, with a                      date it is supposed to happen, and exactly what is to                      happen, of course.\n&gt; \n&gt; We&#39;ve already got lots of                      end-of-the-world stuff from Frank on 2012. So we can skip                      those. We can measure that validity of that in                      2012.\n&gt; \n&gt; --- In EVP-ITC@yahoogroups .com, SnowfireL@ .                      wrote:\n&gt; &gt;\n&gt; &gt; RJ, I have plenty of files with                      things from past events, I posted them \n&gt; &gt; before it                      came true, that was back last year, are you new on the list?                      My \n&gt; &gt; bird got lost last year, and spirit via the RS                      told me where to find her, I \n&gt; &gt; did, maybe it&#39;s                      subjective, if you have a problem with this type of                      research, \n&gt; &gt; sf\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; In a message                      dated 7/9/2010 1:49:03 P.M. Eastern Daylight Time, \n&gt; &gt;                      rasterer@ writes:\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt;                      \n&gt; &gt; Why do you call what I say mean? Is it because I                      hold a different opinion \n&gt; &gt; to yours? Just because I                      am honest about my observations of a technology \n&gt; &gt;                      does not make me &#39;mean&#39;, does it?\n&gt; &gt; \n&gt; &gt; Also,                      even though you said you got &quot;lots of prediction type                      files&quot;, it \n&gt; &gt; doesn&#39;t apply as any kind of proof when                      it is talked about after the fact. The \n&gt; &gt; predictions                      must be clear to everyone before they happen, and not                      subject \n&gt; &gt; to misinterpretation, generalization, or                      vague dating. (Like \n&gt; &gt; _nostradamus_ \n&gt; &gt; (https://encrypted. google.com/                      search?hl= en&&sa=X&ei=KmA3TJyVFYublgeu                      2LyjBg&ved=0CBYQBSgA&q=nostradamus&spell=1)                      usually is).\n&gt; &gt; \n&gt; &gt; I also must point out, when I                      give an observation on a technique or \n&gt; &gt; device, it is                      not my observation that you all argue against: rather, you                      attack \n&gt; &gt; me personally (accusing me of not posting                      enough EVPs, or of being mean). \n&gt; &gt; That&#39;s the mean                      part, not me.\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; --- On Fri,                      7/9/10, SnowfireL@ ., 7/9/10, SSnowfireL@ .&gt;                      wrote:\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; From: SnowfireL@                      .:SnowfireL@ .&gt;\n&gt; &gt; Subject: Re: [EVP-ITC] Last                      nights files,\n&gt; &gt; To: EVP-ITC@yahoogroups To: \n&gt; &gt;                      Date: Friday, July 9, 2010, 10:40 AM\n&gt; &gt; \n&gt; &gt;                      \n&gt; &gt; \n&gt; &gt; Why are you being so mean to people RJ?                      We&#39;ve all gotten lots of \n&gt; &gt; prediction type files,                      that have come true, last year some spirit even found my                      \n&gt; &gt; lost bird, and she was right where they said she&#39;d                      be. sf\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; In a message dated 7/9/2010                      1:34:00 P.M. Eastern Daylight Time, \n&gt; &gt; rasterer@yahoo.                      com writes:\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; &quot; So RJ--where&#39;s your                      EVPs? How can a skeptic type judge others research \n&gt; &gt;                      if he don&#39;t do any research? Like a food critic that only                      dines at \n&gt; &gt; MacDonald&#39;s, yet critiques major                      restaurants. &quot;\n&gt; &gt; \n&gt; &gt; I wouldn&#39;t waste anyone&#39;s                      time by posting a bunch of radio snippets that \n&gt; &gt;                      &quot;Sound like something&quot;. I would post one if it ever actually                      seemed proof \n&gt; &gt; of intelligent communication to me:                      for example, a bunch of consistent \n&gt; &gt; predictions,                      posted before the event, read by all, then confirmed                      afterwards. \n&gt; &gt; That would be the only worthwhile thing                      to post that I can think of.\n&gt; &gt; \n&gt; &gt; Since I have                      never gotten anything like that, I have not posted                      it.\n&gt; &gt; \n&gt; &gt; And I notice neither have you.\n&gt; &gt;                      \n&gt; &gt; \n&gt; &gt; --- On Fri, 7/9/10, Frank Sumption                      &lt;purplealiengirl@ gmail.com&gt; wrote:\n&gt; &gt; \n&gt; &gt;                      \n&gt; &gt; From: Frank Sumption &lt;purplealiengirl@                      gmail.com&gt;\n&gt; &gt; Subject: Re: [EVP-ITC] Last nights                      files,\n&gt; &gt; To: EVP-ITC@yahoogroups .com\n&gt; &gt; Date:                      Friday, July 9, 2010, 9:12 AM\n&gt; &gt; \n&gt; &gt; \n&gt; &gt;                      \n&gt; &gt; So RJ--where&#39;s your EVPs? How can a skeptic type                      judge others research if \n&gt; &gt; he don&#39;t do any research?                      Like a food critic that only dines at \n&gt; &gt; MacDonald&#39;s,                      yet critiques major restaurants.\n&gt; &gt; \n&gt; &gt; &quot;I think                      your instinct to stop posting this stuff might have been a                      good \n&gt; &gt; one. I suspect you are feeling a bit                      overwhelmed with this field right now, \n&gt; &gt; and it may                      be something is nagging at you inside someplace, saying it                      is a \n&gt; &gt; waste of your time or a burden on your life                      and health, or that you just \n&gt; &gt; need a little more                      space for a while.&quot;\n&gt; &gt; \n&gt; &gt; It&#39;s a knowing we all                      have, that there&#39;s something to this, that it&#39;s \n&gt; &gt;                      amazing, yet remains unprovable to others. \n&gt; &gt; \n&gt; &gt;                      F-S\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; On Fri, Jul 9, 2010 at 9:04                      AM, Rj rasterer@yahoo. com&gt; wrote:\n&gt; &gt; \n&gt; &gt;                      \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; &quot;I do not                      control what spirits say though, after all they are just                      people \n&gt; &gt; too. &quot;\n&gt; &gt; \n&gt; &gt; Actually, it&#39;s more                      interesting than that. Not only do you not control \n&gt; &gt;                      what the &#39;spirits&#39; say, you also don&#39;t control what                      broadcast radio says, \n&gt; &gt; and to a large extent you                      don&#39;t control what your brain finds and interprets \n&gt; &gt;                      in the noise you are hearing.\n&gt; &gt; \n&gt; &gt; I listened to                      these (trying not to look at the labels, since once a                      \n&gt; &gt; person looks at the labels, they prime their brains                      to interpret the sounds in \n&gt; &gt; YOUR way, not their own                      way). To me, they were either just a mess of \n&gt; &gt; random                      radio snippets, exactly what you&#39;d expect if a 3 year old                      were randomly \n&gt; &gt; twisting the radio dial, or they were                      just noise. Nothing paranormal in \n&gt; &gt; the                      least.\n&gt; &gt; \n&gt; &gt; I think your instinct to stop                      posting this stuff might have been a good \n&gt; &gt; one. I                      suspect you are feeling a bit overwhelmed with this field                      right now, \n&gt; &gt; and it may be something is nagging at                      you inside someplace, saying it is a \n&gt; &gt; waste of your                      time or a burden on your life and health, or that you just                      \n&gt; &gt; need a little more space for a while.\n&gt; &gt;                      \n&gt; &gt; In any case, I&#39;d recommend a break: take a nice                      month off. See how you \n&gt; &gt; feel being away from all                      this for a while. Come back fresh if you feel ok \n&gt; &gt;                      after that. But if you feel obsessed when away, it might be                      good to ask \n&gt; &gt; your friends and loved ones for some                      opinions on what they see in you. Your \n&gt; &gt; health is                      more important than anything here anyways, and you can&#39;t                      really \n&gt; &gt; do a job with interpretation of your                      results, much less your other \n&gt; &gt; responsibilities in                      life, unless you put your health first.\n&gt; &gt; \n&gt; &gt;                      \n&gt; &gt; --- On Fri, 7/9/10, SnowfireL@aol. com                      SnowfireL@aol. com&gt; wrote:\n&gt; &gt; \n&gt; &gt; \n&gt; &gt;                      From: SnowfireL@aol. com SnowfireL@aol. com&gt;\n&gt; &gt;                      Subject: [EVP-ITC] Last nights files, [13                      Attachments]\n&gt; &gt; To: inside_the_box_ rtsc_ghost_                      box_research@ yahoogroups. com, \n&gt; &gt; EVP-ITC@yahoogroups                      .com, RTSC@yahoogroups. com\n&gt; &gt; Date: Friday, July 9,                      2010, 7:26 AM\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; Well, got                      no response out of the other list, let&#39;s see if any of you                      \n&gt; &gt; folks on these lists can hear these at all. They                      may be too fast, but I did try \n&gt; &gt; to slow them a bit,                      I know, these are very hard to hear, got them last \n&gt; &gt;                      night in response to Steve&#39;s letter about all the                      &quot;religious&quot; crap I&#39;ve \n&gt; &gt; been sending, such weird                      files I sometimes send in lately. I do not control \n&gt; &gt;                      what spirits say though, after all they are just people too.                      Got one on \n&gt; &gt; here that&#39;s really funny, I think it has                      a little demon on it too, he seems \n&gt; &gt; very angry, and                      wants someone to &quot;Let me out! Let me out!&quot; is what he is                      \n&gt; &gt; saying, I think he is wanting to come after some                      folks, because, even \n&gt; &gt; demon&#39;s believe in God. He                      really sounds mad at some people and wants \n&gt; &gt;                      &quot;.....out,&quot; just going to let you hear it, may need to play                      it several times to \n&gt; &gt; hear, but I think its kinda                      cute. I told them what some on the lists were \n&gt; &gt;                      saying, and this was the response. btw Is someone going to                      Florida ? The \n&gt; &gt; last one says something about FL Hope                      you all enjoy them. sf\n&gt; &gt;\n&gt;"}