{"id": "17989", "subject": "Re: [EVP-ITC] Just the chamber and speaker", "author": "Frank Sumption", "timestamp": "2010-07-11T06:43:35Z", "full_text": "Nope, no pix.\n\n F-S\n\nOn Sat, Jul 10, 2010 at 8:25 PM, &lt;SnowfireL@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Did you get the picture i sent?  I don&#39;t really know how it relates, but it\n&gt; once worked, spirit used it to speak through it, some how forming vocal\n&gt; cords out of this ectoplasm like stuff I think.  The trumpet would sit on a\n&gt; desk or floor, and lift up all by itself, and sometimes fly around the room\n&gt; to each person, I had a really hard time believing, but I checked things out\n&gt; over the years, and when a room full of about 15 to 20 people all hear the\n&gt; name, &quot;Abraham Lincoln&quot; in thin air speak his name, and he has a deep strong\n&gt; voice too, then ya gotta believe.  We were told back in the early 60&#39;s that\n&gt; one day, we would have a phone where we would be able to speak with loved\n&gt; ones on the their side.  So, you inventors that have been given this\n&gt; privilege, and soon, well, you,ll see. sf\n&gt;\n&gt;\n&gt; -----Original Message-----\n&gt; From: Frank Sumption &lt;purplealiengirl@gmail.com&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Sat, Jul 10, 2010 10:00 pm\n&gt; Subject: Re: [EVP-ITC] Just the chamber and speaker\n&gt;\n&gt;\n&gt;   I&#39;ve heard of the the spirit trumpet, mihgt be a related technology(?)\n&gt;\n&gt; F-S\n&gt;\n&gt; On Sat, Jul 10, 2010 at 12:12 PM, &lt;SnowfireL@...&gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;   It&#39;s going to sound silly to you Frank, but I still have my old spirit\n&gt;&gt; trumpet, it&#39;s about 60 or more years old now, i got it from a man that made\n&gt;&gt; them back in the heydays for spiritualism, it would sit in the middle of a\n&gt;&gt; room, where people sat for seance, and it would take the energy of the\n&gt;&gt; people and from the medium, and a glass of water was in the room and fly\n&gt;&gt; about, and get direct spirit voice, it&#39;s said, that at one time spirit was\n&gt;&gt; able to some how form these &quot;spiritual vocal cords&quot; inside the trumpet pipe,\n&gt;&gt; and talk.  I know, it sounds crazy, but it did use to happen, and it was not\n&gt;&gt; a gimmick, Trumpets are made of a hard aluminum pipe light weight long tube,\n&gt;&gt; i have a picture of it if you&#39;d like to see it, maybe it&#39;s the same type\n&gt;&gt; principle  your using in the box. sf\n&gt;&gt;\n&gt;&gt; -----Original Message-----\n&gt;&gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt;&gt; To: EVP-ITC@yahoogroups.com\n&gt;&gt; Sent: Sat, Jul 10, 2010 1:56 pm\n&gt;&gt; Subject: Re: [EVP-ITC] Just the chamber and speaker\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;    When I first &quot;got&quot; the idea for the box, using a chamber was poionted\n&gt;&gt; out to me kinda telepathicly. It seems to function as a space where the\n&gt;&gt; sound can be manipulated easier by the entities, and using different\n&gt;&gt; materials seems to get different levels. When I use aluminum, that seems to\n&gt;&gt; facilitate ET contact more often than not using the chamber. Using pipe\n&gt;&gt; helps make the chambers smaller. Thre seems to be a filtering effect by the\n&gt;&gt; chamber that tends to enhance the voices. Most of the boxes I make have an\n&gt;&gt; option to use the chambers.\n&gt;&gt;\n&gt;&gt;  The mind contact that poined out the chamber--I think--was that shadow\n&gt;&gt; guy on the group home page.\n&gt;&gt;\n&gt;&gt;  F-S\n&gt;&gt;\n&gt;&gt; On Sat, Jul 10, 2010 at 12:30 AM, &lt;SnowfireL@...&gt; wrote:\n&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;   Frank, do those pipes lessen the static a bit?  What is it used for?\n&gt;&gt;&gt;\n&gt;&gt;&gt;  In a message dated 7/10/2010 2:15:19 A.M. Eastern Daylight Time,\n&gt;&gt;&gt; purplealiengirl@... writes:\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;   The small hole is for the mic. At 7 seconds &quot;smoking and you stay\n&gt;&gt;&gt; right here&quot;. Smoke for 35 years and even after five or six or whatever it&#39;s\n&gt;&gt;&gt; been years of not smoking, it still crosses my mind from time to time, and\n&gt;&gt;&gt; this is the imediate response.\n&gt;&gt;&gt;\n&gt;&gt;&gt;  F-S\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;\n&gt;   \n&gt;\n\nNope, no pix.\n \n F-S\nOn Sa , Jul 10, 2010 a 8:25 PM, Snow i eL@...> w o e:\n\n  \n\n\n\n\nDid you ge he pic u e i sen ?  I don' eally know how i ela es, bu i once wo ked, spi i used i o speak h ough i , some how o ming ocal co ds ou o his ec oplasm like s u I hink.  The umpe would si on a desk o loo , and li up all by i sel , and some imes ly a ound he oom o each pe son, I had a eally ha d ime belie ing, bu I checked hings ou o e he yea s, and when a oom ull o abou 15 o 20 people all hea he name, \"Ab aham Lincoln\" in hin ai speak his name, and he has a deep s ong oice oo, hen ya go a belie e.  We we e old back in he ea ly 60's ha one day, we would ha e a phone whe e we would be able o speak wi h lo ed ones on he hei side.  So, you in en o s ha ha e been gi en his p i ilege, and soon, well, you,ll see. s \n\n\n\n-----O iginal Message-----F om: F ank Sump ion pu plealiengi l@...>To: EVP-ITC@yahoog oups.com\n\nSen : Sa , Jul 10, 2010 10:00 pmSubjec : Re: [EVP-ITC] Jus he chambe and speake \n\n  \n\n\n\n\nI' e hea d o he he spi i umpe , mihg be a ela ed echnology(?)\n \nF-S\nOn Sa , Jul 10, 2010 a 12:12 PM, Snow i eL@...> w o e:\n\n  \n\n\n\n\nI 's going o sound silly o you F ank, bu I s ill ha e my old spi i umpe , i 's abou 60 o mo e yea s old now, i go i om a man ha made hem back in he heydays o spi i ualism, i would si in he middle o a oom, whe e people sa o seance, and i would ake he ene gy o he people and om he medium, and a glass o wa e was in he oom and ly abou , and ge di ec spi i oice, i 's said, ha a one ime spi i was able o some how o m hese \"spi i ual ocal co ds\" inside he umpe pipe, and alk.  I know, i sounds c azy, bu i did use o happen, and i was no a gimmick, T umpe s a e made o a ha d aluminum pipe ligh weigh long ube, i ha e a pic u e o i i you'd like o see i , maybe i 's he same ype p inciple  you using in he box. s \n\n\n-----O iginal Message-----F om: F ank Sump ion pu plealiengi l@...>To: EVP-ITC@yahoog oups.com\n\nSen : Sa , Jul 10, 2010 1:56 pmSubjec : Re: [EVP-ITC] Jus he chambe and speake \n\n  \n\n\n\n\n When I i s \"go \" he idea o he box, using a chambe was poion ed ou o me kinda elepa hicly. I seems o unc ion as a space whe e he sound can be manipula ed easie by he en i ies, and using di e en ma e ials seems o ge di e en le els. When I use aluminum, ha seems o acili a e ET con ac mo e o en han no using he chambe . Using pipe helps make he chambe s smalle . Th e seems o be a il e ing e ec by he chambe ha ends o enhance he oices. Mos o he boxes I make ha e an op ion o use he chambe s. \n\n \n The mind con ac ha poined ou he chambe --I hink--was ha shadow guy on he g oup home page. \n \n F-S\nOn Sa , Jul 10, 2010 a 12:30 AM, Snow i eL@...> w o e:\n\n  \n\n\n\n\nF ank, do hose pipes lessen he s a ic a bi ?  Wha is i used o ?\n\n \n\nIn a message da ed 7/10/2010 2:15:19 A.M. Eas e n Dayligh Time, pu plealiengi l@... w i es:\n  \n\n\n The small hole is o he mic. A 7 seconds \"smoking and you s ay igh he e\". Smoke o 35 yea s and e en a e i e o six o wha e e i 's been yea s o no smoking, i s ill c osses my mind om ime o ime, and his is he imedia e esponse. \n\n \n F-S"}