{"id": "17987", "subject": "Re: [EVP-ITC] Are radio waves necessary?", "author": "Zack Widup", "timestamp": "2010-07-11T05:37:30Z", "full_text": "My guess is there is something wrong with your radio. Those things should\nnot be stopping you from receiving FM and AM transmissions.\n\nZack\n\nOn Sat, Jul 10, 2010 at 11:55 AM, &lt;SnowfireL@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;\n&gt; Since i live rural, i wonder if my property being next to a small private\n&gt; lake, and across the road about 1/4 mile is the tower for Altel now Verison\n&gt; on the north west side, and same distance on the other side is ATT, they are\n&gt; south east of me, then down further is another ATT tower, and plus my big\n&gt; antennae on the roof, i wonder if that&#39;s help them come through on my FM RS\n&gt; 20-125 radio&#39;s, I don&#39;t even hear radio signal on them anymore, even on the\n&gt; FM channel, it&#39;s weird, and can&#39;t get any AM&#39;s either, AM&#39;s only give me\n&gt; this funny ringing noise, but the FM gives me static or them talking, I sure\n&gt; wish i could buy one of those fancy boxes Franks has bet I&#39;d be a boomin\n&gt; over here!  hint hint., sf\n&gt;\n&gt; -----Original Message-----\n&gt; From: Zack Widup &lt;w9sz.zack@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Sat, Jul 10, 2010 10:11 am\n&gt; Subject: Re: [EVP-ITC] Are radio waves necessary?\n&gt;\n&gt;\n&gt;   My take on it is that the spirits or whatever they are are capable of\n&gt; using whatever methods are placed in front of them. DVR&#39;s get EVP. I&#39;ve\n&gt; gotten EVP on the sound tracks of a video recorder. The radio and ITC seems\n&gt; to generate a different class of communication. EVP-Maker is another one.\n&gt;\n&gt; Probably the method of actually producing the sound waves is different for\n&gt; each device.\n&gt;\n&gt; Zack\n&gt;\n&gt;\n&gt; On Sat, Jul 10, 2010 at 8:20 AM, John S &lt;phenom_investigator@...&gt;wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;   Raymond Bayless was getting recorded spirit voices back in the 1950&#39;s.\n&gt;&gt; While his best known work was with von Salazy on audio tape, Bayless\n&gt;&gt; also received voices using an early grammophone-style recording device.\n&gt;&gt; In other words, he was using strictly a mechanical recorder. This would\n&gt;&gt; suggest that the voices may not require electronics at all. And that would\n&gt;&gt; imply that radio signals may have nothing to do with the voice reception.\n&gt;&gt;\n&gt;&gt; Consider too that EVPMAKER sessions seem to work well for some people.\n&gt;&gt; Except for the mechnical recordings, which are few in number, all the\n&gt;&gt; current techniques have electronics in common. So it would make sense\n&gt;&gt; that electronics might be important to the process. However, when\n&gt;&gt; you factor in the mechanical recordings made using devices prior to\n&gt;&gt; modern electronics, it seems more sensible to look for a common\n&gt;&gt; explanation which involves environmental manipulation. The most reasonable\n&gt;&gt; thing we know of that meets this criterion is mind-matter interaction,\n&gt;&gt; or psychokinesis (PK).\n&gt;&gt;\n&gt;&gt; The only remaining question then, aside from the actual source of the\n&gt;&gt; information which cannot be objectively ascertained as of yet, is whether\n&gt;&gt; a single or multiple mechanisms are indeed at work. Even though radio\n&gt;&gt; waves\n&gt;&gt; are not required to produce the phenomena, if multiple mechanisms are at\n&gt;&gt; work,\n&gt;&gt; it may be that radio waves are one of many ways the phenomena is produced.\n&gt;&gt;\n&gt;&gt; Bottom line, with so many options much more information is needed to form\n&gt;&gt; any\n&gt;&gt; reasonable hypothesis.\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;   \n&gt;\n\nMy guess is he e is some hing w ong wi h you adio. Those hings should no be s opping you om ecei ing FM and AM ansmissions.\n \nZack\nOn Sa , Jul 10, 2010 a 11:55 AM, Snow i eL@...> w o e:\n\n  \n\n\n\n\n\nSince i li e u al, i wonde i my p ope y being nex o a small p i a e lake, and ac oss he oad abou 1/4 mile is he owe o Al el now Ve ison on he no h wes side, and same dis ance on he o he side is ATT, hey a e sou h eas o me, hen down u he is ano he ATT owe , and plus my big an ennae on he oo , i wonde i ha 's help hem come h ough on my FM RS 20-125 adio's, I don' e en hea adio signal on hem anymo e, e en on he FM channel, i 's wei d, and can' ge any AM's ei he , AM's only gi e me his unny inging noise, bu he FM gi es me s a ic o hem alking, I su e wish i could buy one o hose ancy boxes F anks has be I'd be a boomin o e he e!  hin hin ., s \n\n\n\n\n-----O iginal Message-----F om: Zack Widup w9sz.zack@gmail.com>To: EVP-ITC@yahoog oups.com\nSen : Sa , Jul 10, 2010 10:11 amSubjec : Re: [EVP-ITC] A e adio wa es necessa y?\n\n  \n\n\n\n\nMy ake on i is ha he spi i s o wha e e hey a e a e capable o using wha e e me hods a e placed in on o hem. DVR's ge EVP. I' e go en EVP on he sound acks o a ideo eco de . The adio and ITC seems o gene a e a di e en class o communica ion. EVP-Make is ano he one.\n\n \nP obably he me hod o ac ually p oducing he sound wa es is di e en o each de ice.\n \nZack\n \nOn Sa , Jul 10, 2010 a 8:20 AM, John S phenom_in es iga o @yahoo.com> w o e:\n\n  \n\n\n\n\n\nRaymond Bayless was ge ing eco ded spi i oices back in he 1950's.\nWhile his bes known wo k was wi h on Salazy on audio ape, Bayless\nalso ecei ed oices using an ea ly g ammophone-s yle eco ding de ice.\nIn o he wo ds, he was using s ic ly a mechanical eco de . This would\nsugges ha he oices may no equi e elec onics a all. And ha would\nimply ha adio signals may ha e no hing o do wi h he oice ecep ion.\n \nConside oo ha EVPMAKER sessions seem o wo k well o some people.\nExcep o he mechnical eco dings, which a e ew in numbe , all he\ncu en echniques ha e elec onics in common. So i would make sense\n ha elec onics migh be impo an o he p ocess. Howe e , when \nyou ac o in he mechanical eco dings made using de ices p io o \nmode n elec onics, i seems mo e sensible o look o a common \nexplana ion which in ol es en i onmen al manipula ion. The mos easonable\n hing we know o ha mee s his c i e ion is mind-ma e in e ac ion,\no psychokinesis (PK).\n \nThe only emaining ques ion hen, aside om he ac ual sou ce o he \nin o ma ion which canno be objec i ely asce ained as o ye , is whe he \na single o mul iple mechanisms a e indeed a wo k. E en hough adio wa es \na e no equi ed o p oduce he phenomena, i mul iple mechanisms a e a wo k, \ni may be  ha adio wa es a e one o many ways he phenomena is p oduced.\n \nBo om line, wi h so many op ions much mo e in o ma ion is needed o o m any\n easonable hypo hesis."}