{"id": "18004", "subject": "Re: [EVP-ITC] Improved protocol", "author": "April Abercrombie", "timestamp": "2010-07-11T16:59:09Z", "full_text": "I fail to see a problem with it. Why are you so freaked out Snow? Regardless\nof the outcome, it shouldn&#39;t bother you any. We only stand to gain from\nthis.\n\nOn Sun, Jul 11, 2010 at 10:43 AM, Rj &lt;rasterer@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; What are your objections Snowfire?\n&gt; How can we improve this?\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; --- On *Sun, 7/11/10, SnowfireL@... &lt;SnowfireL@...&gt;* wrote:\n&gt;\n&gt;\n&gt; From: SnowfireL@... &lt;SnowfireL@...&gt;\n&gt; Subject: Re: [EVP-ITC] Improved protocol\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Sunday, July 11, 2010, 9:40 AM\n&gt;\n&gt;\n&gt;\n&gt;  I am sorry now that I got involved in this testing, this is not a science\n&gt; class, and I am sorry list members, I was unaware of what they were up to.\n&gt; no wonder David (the tech) did not want to get involved.  We don&#39;t know\n&gt; who people are on these lists to begin with, and I should have been more\n&gt; careful, getting old.  sf\n&gt;\n&gt;  In a message dated 7/11/2010 11:37:38 A.M. Eastern Daylight Time,\n&gt; rasterer@yahoo. com writes:\n&gt;\n&gt;\n&gt;\n&gt;   Your points are well taken John.  And I agree it is a first attempt and\n&gt; certainly can be improved on successive trials, and cannot determine the\n&gt; origin of the messages.\n&gt;\n&gt; For this first experiment/protocol , I thought we would go as generic as\n&gt; possible: it doesn&#39;t matter really here where the information comes from, or\n&gt; how different people interpret it: just determine the object in the specific\n&gt; timeframe.  We&#39;ll start with data on how accurate the participants can get,\n&gt; however they do it.\n&gt;\n&gt; As to your comment on the audio files:  originally I considered requiring\n&gt; as part of the protocol to include the audio.  Maybe that is still a good\n&gt; idea.  The reason I didn&#39;t, is because people often claim to hear different\n&gt; things each time they listen to a file.  Posting a file with an incorrect\n&gt; answer, for example, the person may later claim (after the experiment) to\n&gt; NOW hear the right answer.  And others may confirm it.\n&gt;\n&gt; This seemed liked a rabbit hole, and I&#39;m not sure how to handle it. So for\n&gt; this trial, I figured we&#39;d just not go there, and require replies only be\n&gt; valid if they are given during the experiments specified time frame. Once\n&gt; the actual object is know, it seems too easy for a person to come up with\n&gt; the answer.\n&gt;\n&gt; But yeah, we need to see how this goes, fix the problems, and come up with\n&gt; more of them!\n&gt;\n&gt; --- On *Sun, 7/11/10, John S &lt;phenom_investigator @yahoo.com&gt;* wrote:\n&gt;\n&gt;\n&gt; From: John S &lt;phenom_investigator @...&gt;\n&gt; Subject: [EVP-ITC] Improved protocol\n&gt;\n&gt; To: EVP-ITC@yahoogroups .com\n&gt; Date: Sunday, July 11, 2010, 8:08 AM\n&gt;\n&gt;\n&gt;\n&gt;  Since we&#39;re talking about experiments and protocols here are some ideas\n&gt; to improve\n&gt; the protocol RJ suggested initially. Using a test target is one way of\n&gt; establishing a\n&gt; truth in time, which is the basis of this experiment. But there are a\n&gt; couple of issues.\n&gt;\n&gt; It is quite possible that someone could discern the target through remote\n&gt; viewing alone.\n&gt; This would negate the need for involvement of a spirit communicator or\n&gt; discarnate entity.\n&gt; Outcomes depend on the word of those reporting. The true skeptic (not\n&gt; cynic) would\n&gt; therefore say that this experiment contains a basic flaw in that it does\n&gt; not uniquely\n&gt; indicate that the information was obtained in the prescribed manner.\n&gt; Providing access\n&gt; to the raw audio file would not necessarily constitute proof either, since\n&gt; many of these\n&gt; communications can only be heard by certain people,\n&gt;\n&gt; If the audio file were quite clear, timing  becomes an issue. In other\n&gt; words, when was\n&gt; the audio actually recorded?  This issue can be mitigated simply by\n&gt; requiring any\n&gt; claimant to email the audio file to a trusted party before the test ends.\n&gt; It would be best\n&gt; if the trusted party were not otherwise involved in the experiment and it\n&gt; was  their duty\n&gt; simply to collect the claims. Once all claims had been collected they could\n&gt; be posted\n&gt; publicly for review by the community in general.  The experimenter could\n&gt; decide if any\n&gt; of the claims seemed to have hit, and this decision could be reviewed by\n&gt; anyone if desired.\n&gt;\n&gt; The important detail however is that this experiment does not completely\n&gt; answer the\n&gt; question. It is a first attempt and certainly can be improved on successive\n&gt; trials.\n&gt;\n&gt; Successive trials are always a good idea, since it provides replication.\n&gt; And it would be\n&gt; best if others replicated the experiment using a very similar protocol. If\n&gt; these were to\n&gt; succeed, the community could then state that out of X trials Y had\n&gt; succeeded (by\n&gt; some definition of success) potentially giving a success rate above that\n&gt; expected\n&gt; by random chance. This would make the outcome quantifiable and measureable\n&gt; and thus meaningful.\n&gt;\n&gt; But also important to note, this would only prove the potential veracity of\n&gt; the messages.\n&gt; It would not (and cannot as far as I can tell) prove the origin of the\n&gt; messages. This detail\n&gt; will, I fear, remain a matter for belief and speculation for quite some\n&gt; time to come.\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;  \n&gt;\n\nI ail o see a p oblem wi h i . Why a e you so eaked ou Snow? Rega dless o he ou come, i shouldn' bo he you any. We only s and o gain om his.On Sun, Jul 11, 2010 a 10:43 AM, Rj as e e @yahoo.com> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n Wha a e you objec ions Snow i e?  How can we imp o e his?--- On Sun, 7/11/10, Snow i eL@... Snow i eL@...> w o e:\nF om: Snow i eL@... Snow i eL@aol.com>\nSubjec : Re: [EVP-ITC] Imp o ed p o ocolTo: EVP-ITC@yahoog oups.comDa e: Sunday, July 11, 2010, 9:40 AM\n\n\n\n\n\n \n\n\n\n \n \n \n \n\n\nI am so y now ha I go in ol ed in his es ing, his is no a science \nclass, and I am so y lis membe s, I was unawa e o wha hey we e up o. no \nwonde Da id ( he ech) did no wan o ge in ol ed.  We don'  know \nwho people a e on hese lis s o begin wi h, and I should ha e been \nmo e ca e ul, ge ing old.  s \n \n\nIn a message da ed 7/11/2010 11:37:38 A.M. Eas e n Dayligh Time, \n as e e @yahoo. com w i es:\n  \n \n \n \n \n \n You poin s a e well aken John.  And I ag ee i is \n a i s a emp and ce ainly can be imp o ed on successi e ials, and \n canno de e mine he o igin o he messages.Fo his i s \n expe imen /p o ocol , I hough we would go as gene ic as possible: \n i doesn' ma e eally he e whe e he in o ma ion comes om, o how \n di e en people in e p e i : jus de e mine he objec in he speci ic \n ime ame.  We'll s a wi h da a on how accu a e he pa icipan s \n can ge , howe e hey do i .As o you commen on he audio \n iles:  o iginally I conside ed equi ing as pa o he p o ocol \n o include he audio.  Maybe ha is s ill a good idea.  The \n eason I didn' , is because people o en claim o hea di e en hings \n each ime hey lis en o a ile.  Pos ing a ile wi h an inco ec \n answe , o example, he pe son may la e claim (a e he expe imen ) \n o NOW hea he igh answe .  And o he s may con i m \n i .This seemed liked a abbi hole, and I'm no su e how o \n handle i . So o his ial, I igu ed we'd jus no go he e, and \n equi e eplies only be alid i hey a e gi en du ing he expe imen s \n speci ied ime ame. Once he ac ual objec is know, i seems oo easy \n o a pe son o come up wi h he answe .Bu yeah, we need o see \n how his goes, ix he p oblems, and come up wi h mo e o \n hem!--- On Sun, 7/11/10, John S \n yahoo.com> w o e:\n F om: \n John S yahoo.com>Subjec : \n [EVP-ITC] Imp o ed p o ocolTo: \n EVP-ITC@yahoog oups .comDa e: Sunday, July 11, 2010, 8:08 \n AM\n   \n \n \n \n \n Since we' e alking abou expe imen s and p o ocols he e a e some \n ideas o imp o e\n he p o ocol RJ sugges ed ini ially. Using a es a ge is one \n way o es ablishing a \n u h in ime, which is he basis o his expe imen . Bu he e \n a e a couple o issues.\n  \n I is qui e possible ha someone could disce n he a ge \n h ough emo e iewing alone.\n This would nega e he need o in ol emen o a spi i \n communica o o disca na e en i y.\n Ou comes depend on he wo d o hose epo ing. The ue \n skep ic (no cynic) would \n he e o e say ha his expe imen con ains a basic law in ha \n i  does no uniquely \n indica e ha he in o ma ion was ob ained in he p esc ibed \n manne . P o iding access\n o he aw audio ile would no necessa ily cons i u e p oo \n ei he , since many o hese \n communica ions can only be hea d by ce ain people, \n  \n I he audio ile we e qui e clea , iming  becomes an \n issue. In o he wo ds, when was \n he audio ac ually eco ded?  This issue can be mi iga ed \n simply by equi ing any\n claiman o email he audio ile o a us ed pa y be o e he \n es ends. I would be bes \n i he us ed pa y we e no o he wise in ol ed in he \n expe imen and i was  hei du y \n simply o collec he claims. Once all claims had been \n collec ed hey could be pos ed \n publicly o e iew by he communi y in gene al.  The \n expe imen e could decide i any \n o he claims seemed o ha e hi , and his decision could be \n e iewed by anyone i desi ed. \n  \n The impo an de ail howe e is ha his expe imen does no \n comple ely answe he \n ques ion. I is a i s a emp and ce ainly can be imp o ed on \n successi e ials.\n  \n Successi e ials a e always a good idea, since i p o ides \n eplica ion. And i would be\n bes i o he s eplica ed he expe imen using a e y simila \n p o ocol. I hese we e o\n succeed, he communi y could hen s a e ha ou o X ials Y \n had succeeded (by \n some de ini ion o success) po en ially gi ing a success \n a e abo e ha expec ed \n by andom chance. This would make he ou come quan i iable and \n measu eable \n and hus meaning ul.\n  \n Bu also impo an o no e, his would only p o e he po en ial \n e aci y o he messages.\n I would no (and canno as a as I can ell) p o e he o igin \n o he messages. This de ail\n will, I ea , emain a ma e o belie and specula ion o \n qui e some ime o come."}