{"id": "18019", "subject": "Re: [EVP-ITC] Re: Experiment 20100710", "author": "Frank Sumption", "timestamp": "2010-07-11T21:06:31Z", "full_text": "Why don&#39;t you do your fraking recording and see if  &quot;they&quot; tell what it is?\n\nF-S\n\nOn Sun, Jul 11, 2010 at 8:05 AM, rasterer &lt;rasterer@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;\n&gt; Three days left on this first experiment.\n&gt;\n&gt; For those who say skeptical people won&#39;t listen to any evidence, here is a\n&gt; great way to provide some publicly and prove or disprove that statement.\n&gt;\n&gt; And if your&#39;re just the type who maintains an open mind, and would like to\n&gt; try to see what works and what doesn&#39;t, here&#39;s an opportunity to participate\n&gt; in a multi-person test.\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, &quot;rasterer&quot;\n&gt; &lt;rasterer@...&gt; wrote:\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; I have placed a little something on top of my computer monitor, right in\n&gt; front of me. It is now 7/10/2010. I will leave it there 4 days, and remove\n&gt; it Noon Denver time, on Wednesday, 7/14/2010.\n&gt; &gt;\n&gt; &gt; All you have to do is ask your boxes/spirits/aliens/etc, what it is.\n&gt; &gt;\n&gt; &gt; I have taken a picture of it, and posted it to the files section here, so\n&gt; there is no way I can squirm out of the results:\n&gt; &gt;\n&gt; &gt; http://tech.groups.yahoo.com/group/EVP-ITC/files/RJ/RJ.20100710.1.zip\n&gt; &gt;\n&gt; &gt; Please do not try to open the file before noon Wednesday. But feel free\n&gt; to download it to your computer beforehand, so you can be sure I won&#39;t\n&gt; change it during, or after, the test.\n&gt; &gt;\n&gt; &gt; Answers anyone reveals after noon Wednesday don&#39;t count. Partial answers\n&gt; (like just the color, or shape, or some emotion vibe) don&#39;t count. Just tell\n&gt; me what it is.\n&gt; &gt;\n&gt; &gt; Best of Luck. I hope for this to be a regularly occurring experiment, and\n&gt; I hope we all can learn from the results.\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nWhy don' you do you aking eco ding and see i   \" hey\" ell wha i is? \n \nF-S\nOn Sun, Jul 11, 2010 a 8:05 AM, as e e as e e @...> w o e:\n\n  \n\n\n\nTh ee days le on his i s expe imen .Fo hose who say skep ical people won' lis en o any e idence, he e is a g ea way o p o ide some publicly and p o e o disp o e ha s a emen .And i you ' e jus he ype who main ains an open mind, and would like o y o see wha wo ks and wha doesn' , he e's an oppo uni y o pa icipa e in a mul i-pe son es . \n--- In EVP-ITC@yahoog oups.com, \" as e e \" w o e:>> > I ha e placed a li le some hing on op o my compu e moni o , igh in on o me. I is now 7/10/2010. I will lea e i he e 4 days, and emo e i Noon Den e ime, on Wednesday, 7/14/2010.\n> > All you ha e o do is ask you boxes/spi i s/aliens/e c, wha i is.> > I ha e aken a pic u e o i , and pos ed i o he iles sec ion he e, so he e is no way I can squi m ou o he esul s:\n> > h p:// ech.g oups.yahoo.com/g oup/EVP-ITC/ iles/RJ/RJ.20100710.1.zip> > Please do no y o open he ile be o e noon Wednesday. Bu eel ee o download i o you compu e be o ehand, so you can be su e I won' change i du ing, o a e , he es .\n> > Answe s anyone e eals a e noon Wednesday don' coun . Pa ial answe s (like jus he colo , o shape, o some emo ion ibe) don' coun . Jus ell me wha i is.> > Bes o Luck. I hope o his o be a egula ly occu ing expe imen , and I hope we all can lea n om he esul s.\n>"}