{"id": "18018", "subject": "Re: [EVP-ITC] Improved protocol", "author": "Frank Sumption", "timestamp": "2010-07-11T21:04:15Z", "full_text": "Whatever you do, do not do your own EVP recordings! There is only one\npossible outcome of the test, and that&#39;s &quot;see, we told everyone, nothing to\nit&quot;. I think the otherside is not interested in performing for skeptics that\nwould not accept it anyway.\n\n and don&#39;t even ask, I don&#39;t play those games either. There is far more than\nenough to prove to any thinking person this stuff is real.\n\n F-S\n\nOn Sun, Jul 11, 2010 at 9:08 AM, John S &lt;phenom_investigator@...&gt;wrote:\n\n&gt;\n&gt;\n&gt;  Since we&#39;re talking about experiments and protocols here are some ideas\n&gt; to improve\n&gt; the protocol RJ suggested initially. Using a test target is one way of\n&gt; establishing a\n&gt; truth in time, which is the basis of this experiment. But there are a\n&gt; couple of issues.\n&gt;\n&gt; It is quite possible that someone could discern the target through remote\n&gt; viewing alone.\n&gt; This would negate the need for involvement of a spirit communicator or\n&gt; discarnate entity.\n&gt; Outcomes depend on the word of those reporting. The true skeptic (not\n&gt; cynic) would\n&gt; therefore say that this experiment contains a basic flaw in that it does\n&gt; not uniquely\n&gt; indicate that the information was obtained in the prescribed manner.\n&gt; Providing access\n&gt; to the raw audio file would not necessarily constitute proof either, since\n&gt; many of these\n&gt; communications can only be heard by certain people,\n&gt;\n&gt; If the audio file were quite clear, timing  becomes an issue. In other\n&gt; words, when was\n&gt; the audio actually recorded?  This issue can be mitigated simply by\n&gt; requiring any\n&gt; claimant to email the audio file to a trusted party before the test ends.\n&gt; It would be best\n&gt; if the trusted party were not otherwise invovled in the experiment and it\n&gt; was  their duty\n&gt; simply to collect the claims. Once all claims had been collected they could\n&gt; be posted\n&gt; publicly for review by the community in general.  The experimenter could\n&gt; decide if any\n&gt; of the claims seemed to have hit, and this decision could be reviewed by\n&gt; anyone if desired.\n&gt;\n&gt; The important detail however is that this experiment does not completely\n&gt; answer the\n&gt; question. It is a first attempt and certainly can be improved on successive\n&gt; trials.\n&gt;\n&gt; Successive trials are always a good idea, since it provides replication.\n&gt; And it would be\n&gt; best if others replicated the experiment using a very similar protocol. If\n&gt; these were to\n&gt; succeed, the community could then state that out of X trials Y had\n&gt; succeeded (by\n&gt; some definition of success) potentially giving a success rate above that\n&gt; expected\n&gt; by random chance. This would make the outcome quantifiable and measureable\n&gt; and thus meaningful.\n&gt;\n&gt; But also important to note, this would only prove the potential veracity of\n&gt; the messages.\n&gt; It would not (and cannot as far as I can tell) prove the origin of the\n&gt; messages. This detail\n&gt; will, I fear, remain a matter for belief and speculation for quite some\n&gt; time to come.\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;  \n&gt;\n\nWha e e you do, do no do you own EVP eco dings! The e is only one possible ou come o he es , and ha 's \"see, we old e e yone, no hing o i \". I hink he o he side is no in e es ed in pe o ming o skep ics ha would no accep i anyway. \n\n \n and don' e en ask, I don' play hose games ei he . The e is a mo e han enough o p o e o any hinking pe son his s u is eal. \n \n F-S\nOn Sun, Jul 11, 2010 a 9:08 AM, John S phenom_in es iga o @...> w o e:\n\n  \n\n\n\n\n\n\nSince we' e alking abou expe imen s and p o ocols he e a e some ideas o imp o e\n he p o ocol RJ sugges ed ini ially. Using a es a ge is one way o es ablishing a \n u h in ime, which is he basis o his expe imen . Bu he e a e a couple o issues.\n \nI is qui e possible ha someone could disce n he a ge h ough emo e iewing alone.\nThis would nega e he need o in ol emen o a spi i communica o o disca na e en i y.\nOu comes depend on he wo d o hose epo ing. The ue skep ic (no cynic) would \n he e o e say ha his expe imen con ains a basic law in ha i  does no uniquely \nindica e ha he in o ma ion was ob ained in he p esc ibed manne . P o iding access\n o he aw audio ile would no necessa ily cons i u e p oo ei he , since many o hese \ncommunica ions can only be hea d by ce ain people, \n \nI he audio ile we e qui e clea , iming  becomes an issue. In o he wo ds, when was \n he audio ac ually eco ded?  This issue can be mi iga ed simply by equi ing any\nclaiman o email he audio ile o a us ed pa y be o e he es ends. I would be bes \ni he us ed pa y we e no o he wise in o led in he expe imen and i was  hei du y \nsimply o collec he claims. Once all claims had been collec ed hey could be pos ed \npublicly o e iew by he communi y in gene al.  The expe imen e could decide i any \no he claims seemed o ha e hi , and his decision could be e iewed by anyone i desi ed. \n \nThe impo an de ail howe e is ha his expe imen does no comple ely answe he \nques ion. I is a i s a emp and ce ainly can be imp o ed on successi e ials.\n \nSuccessi e ials a e always a good idea, since i p o ides eplica ion. And i would be\nbes i o he s eplica ed he expe imen using a e y simila p o ocol. I hese we e o\nsucceed, he communi y could hen s a e ha ou o X ials Y had succeeded (by \nsome de ini ion o success) po en ially gi ing a success a e abo e ha expec ed \nby andom chance. This would make he ou come quan i iable and measu eable \nand hus meaning ul.\n \nBu also impo an o no e, his would only p o e he po en ial e aci y o he messages.\nI would no (and canno as a as I can ell) p o e he o igin o he messages. This de ail\nwill, I ea , emain a ma e o belie and specula ion o qui e some ime o come."}