{"id": "18016", "subject": "Re: Last nights files,", "author": "Beth", "timestamp": "2010-07-11T13:41:13Z", "full_text": "Wow, I remember when that happened to that girl.  She was just about to be married right?  I am glad you posted them again because I hadn&#39;t been able to hear them either.  Very interesting!\n\nBeth\n\n--- In EVP-ITC@yahoogroups.com, SnowfireL@... wrote:\n&gt;\n&gt; Yeah, maybe same persons?  At any rate, i found some of those old  files, \n&gt; and in them one can hear where they haven&#39;t found her body yet, that was  on \n&gt; day one, before the police even thought she had been killed.  You can  hear \n&gt; my questions, and the spirits answers fairly well I hope, they are not very  \n&gt; loud though.  Frank, I know this stuff is real! sf\n&gt;  \n&gt;  \n&gt; In a message dated 7/10/2010 2:08:46 A.M. Eastern Daylight Time,  \n&gt; purplealiengirl@... writes:\n&gt; \n&gt;  \n&gt;  \n&gt;  \n&gt; Yeah, it&#39;s that stuff that proves EVP, except to the skeptic, they  accept \n&gt; no evidence whatsoever. No matter what is present it&#39;s ignored. Recall  \n&gt; Lizzie Boring, who just attacked, \n&gt; attacked, attacked and would not even  acknowledge anyone&#39;s claims. \n&gt;  \n&gt;  I think maybe ignore the skeptics, their comments and negative  attitude \n&gt; is irrelavant. \n&gt; \n&gt; F-S\n&gt;  \n&gt; On Fri, Jul 9, 2010 at 9:09 PM, &lt;_SnowfireL@..._ \n&gt; (mailto:SnowfireL@...) &gt;  wrote:\n&gt; \n&gt; \n&gt;  \n&gt;  \n&gt;  \n&gt; Hi Frank, so you remember back last year in  spring of 2009 when that \n&gt; Chinese student, Annie Le  who was going to be  married within the following  \n&gt; week was murdered?  I was really new  to this but, from the first day she came \n&gt; up missing, and the police thought  she would be found ok, I did a session \n&gt; on that first day, and I posted what  I got on a couple of lists.  I still \n&gt; have those files, and date on them  on the pc here, I played them to police \n&gt; over the phone, and they took the  report, in the end every thing spirit said \n&gt; was true.  Everything, right  down to the place they found her body, I think \n&gt; Bruce might recall this, it  was his list I think where they were posted, \n&gt; everyone was hoping she&#39;d be  ok, but as it turns out she was killed, spirit \n&gt; said, &quot;code blue&quot;, gave his  occupation, &quot;the tech&quot; and his full name \n&gt; &quot;Raymond Clark&quot; and hers &quot;Annie Le&quot;  they said &quot;he buried her body in the wall&quot; \n&gt; and that her body would be  found.  The girl herself even came through crying, \n&gt; and had an older  Chinese woman (the accent) I can locate these files, if \n&gt; you like I will  post them again.  I know this stuff is true, I let the \n&gt; police hear the  files over the phone when they were taking reports, the files \n&gt; were clear  enough, that the guy heard them, he thought it was people in a bar \n&gt; talking  about the what happened, sf \n&gt;  \n&gt; \n&gt;  \n&gt; \n&gt;  \n&gt; In a message dated 7/9/2010 10:33:40 P.M. Eastern Daylight Time, \n&gt; _purplealiengirl@purpleali_ (mailto:purplealiengirl@...)  writes:\n&gt; \n&gt;  \n&gt; Translation-Translation-&lt;WBR&gt;-don&#39;t do any recordings of my own.. Yet,  \n&gt; critiqu  I have gotten predictions that did in fact  come true, but like a \n&gt; skeptic moron, I thought no frikkin&#39; way and  didn&#39;t post it.  \n&gt;  \n&gt;  F-S\n&gt; \n&gt; \n&gt; On Fri, Jul 9, 2010 at 11:01 AM, Rj &lt;_rasterer@..._ \n&gt; (mailto:rasterer@...) &gt; wrote:\n&gt; \n&gt; \n&gt;  \n&gt;  \n&gt;  \n&gt; &quot;   So RJ--where&#39;s your EVPs? How can a  skeptic type judge others research \n&gt; if he don&#39;t do any research?  Like a food critic that only dines at \n&gt; MacDonald&#39;s, yet critiques  major restaurants.&quot;\n&gt; \n&gt; \n&gt; I wouldn&#39;t waste anyone&#39;s  time  by posting a bunch of radio snippets that \n&gt; &quot;Sound like  something&quot;.  I would post one if it ever actually seemed  proof \n&gt; of intelligent communication to me: for example, a bunch of  consistent \n&gt; predictions, posted before the event, read by all, then  confirmed afterwards.  \n&gt; That would be the only worthwhile  thing to post that I can think of.\n&gt; \n&gt; Since I have never  gotten anything like that, I have not posted it.\n&gt; \n&gt; And I  notice neither have you.  \n&gt; \n&gt; \n&gt; \n&gt; --- On Fri, 7/9/10, Frank Sumption &lt;_purplealiengirl@purpleali_ \n&gt; (mailto:purplealiengirl@...) &gt;  wrote:\n&gt; \n&gt; \n&gt; \n&gt; From: Frank Sumption &lt;_purplealiengirl@purpleali_ \n&gt; (mailto:purplealiengirl@...) &gt;\n&gt; \n&gt; Subject:  Re: [EVP-ITC] Last nights files,\n&gt; To: _EVP-ITC@yahoogroupsEVP-_ (mailto:EVP-ITC@yahoogroups.com) \n&gt; Date: Friday,  July 9, 2010, 9:12 AM  \n&gt; \n&gt; \n&gt; \n&gt;  \n&gt; So RJ--where&#39;s your EVPs? How can a skeptic type  judge others research if \n&gt; he don&#39;t do any research? Like a food  critic that only dines at \n&gt; MacDonald&#39;s, yet critiques major  restaurants.\n&gt;  \n&gt; &quot;I think your instinct to stop posting this stuff might  have been a good \n&gt; one. I suspect you are feeling a bit  overwhelmed with this field right now, \n&gt; and it may be something  is nagging at you inside someplace, saying it is a \n&gt; waste of your  time or a burden on your life and health, or that you just \n&gt; need  a little more space for a while.&quot;\n&gt;  \n&gt;  It&#39;s a knowing we all have, that there&#39;s something to  this, that it&#39;s \n&gt; amazing, yet remains unprovable to others. \n&gt;  \n&gt;  F-S\n&gt; \n&gt; \n&gt; On Fri, Jul 9, 2010 at 9:04 AM, Rj &lt;_rasterer@yahoo. com_ \n&gt; (http://mc/compose?to=rasterer@...) &gt; wrote:\n&gt; \n&gt;  \n&gt;  \n&gt;  \n&gt;  \n&gt; \n&gt; &quot;I do not control  what spirits say though, after all they are just people  \n&gt; too. &quot;\n&gt; \n&gt; Actually, it&#39;s more  interesting than that.  Not only do you not control  \n&gt; what the &#39;spirits&#39; say, you also don&#39;t control what  broadcast radio says, \n&gt; and to a large extent you don&#39;t  control what your brain finds and interprets \n&gt; in the  noise you are hearing.\n&gt; \n&gt; I listened to these  (trying not to look at the labels, since once a person \n&gt;  looks at the labels, they prime their brains to  interpret the sounds in \n&gt; YOUR way, not their own  way).  To me, they were either just a mess of  \n&gt; random radio snippets, exactly what you&#39;d expect if a 3  year old were randomly \n&gt; twisting the radio dial, or they  were just noise.  Nothing paranormal in the \n&gt;  least.\n&gt; \n&gt; I think your instinct to stop posting this  stuff might have been a good \n&gt; one. I suspect you are  feeling a bit overwhelmed with this field right now, \n&gt; and  it may be something is nagging at you inside someplace,  saying it is a \n&gt; waste of your time or a burden on your  life and health, or that you just \n&gt; need a little more  space for a while.\n&gt; \n&gt; In any case, I&#39;d recommend a  break: take a nice month off.  See how you \n&gt; feel  being away from all this for a while.  Come back  fresh if you feel ok \n&gt; after that.  But if you feel  obsessed when away, it might be good to ask \n&gt; your friends  and loved ones for some opinions on what they see in  you.  Your \n&gt; health is more important than anything  here anyways, and you can&#39;t really \n&gt; do a job with  interpretation of your results, much less your other  \n&gt; responsibilities in life, unless you put your health  first.\n&gt; \n&gt; \n&gt; --- On Fri, 7/9/10, _SnowfireL@aol. com_ \n&gt; (http://mc/compose?to=SnowfireL@...)   &lt;_SnowfireL@aol.  com_ (http://mc/compose?to=SnowfireL@...) &gt; \n&gt; wrote:\n&gt; \n&gt; \n&gt; From:  _SnowfireL@aol. com_ (http://mc/compose?to=SnowfireL@...)   \n&gt; &lt;_SnowfireL@aol.  com_ (http://mc/compose?to=SnowfireL@...) &gt;\n&gt; Subject: [EVP-ITC] Last nights files,  [13 Attachments]\n&gt; To: _inside_the_box_ rtsc_ghost_  box_research@ yahoogroups. com_ \n&gt; (http://mc/compose?to=inside_the_box_rtsc_ghost_box_research@yahoogroups.com) , \n&gt; _EVP-ITC@yahoogroups  .com_ (http://mc/compose?to=EVP-ITC@yahoogroups.com) , \n&gt; _RTSC@yahoogroups.  com_ (http://mc/compose?to=RTSC@yahoogroups.com) \n&gt; Date: Friday, July 9, 2010, 7:26 AM\n&gt; \n&gt; \n&gt;  \n&gt; Well, got no response  out of the other list, let&#39;s see if any of you folks \n&gt;  on these lists can hear these at all. They may be too  fast, but I did try \n&gt; to slow them a  bit,  I know, these are very hard to hear,  got them last \n&gt; night in response to Steve&#39;s letter  about all the &quot;religious&quot;  crap I&#39;ve \n&gt; been  sending,  such weird files I sometimes send in  lately.  I do not control \n&gt; what spirits say  though, after all they are just people too.  Got  one on \n&gt; here that&#39;s really funny, I think it has a  little demon on it too, he seems \n&gt; very angry, and wants  someone to &quot;Let me out!  Let me out!&quot; is what he  is \n&gt; saying, I think he is wanting to come after some  folks, because, even \n&gt; demon&#39;s believe in  God.  He really sounds mad at some people and  wants \n&gt; &quot;.....out,&quot; just going to let you hear it, may  need to play it several times to \n&gt; hear, but I think its  kinda cute. I told them what some on the  lists were \n&gt; saying, and this was the  response.  btw  Is someone going to Florida  ?  The \n&gt; last one says something about FL Hope you  all enjoy them. sf\n&gt;"}