{"id": "18015", "subject": "Re: Experiment 20100710", "author": "Beth", "timestamp": "2010-07-11T14:48:18Z", "full_text": "Okay, well, I am going to put my bid in on this prize. This is the first time I have ever tried to do an experiment like this, so I have no clue as to if I am even close or not.  I came up with &quot;a rock&quot;.  I will make a folder in my name and post it so, if by chance it is right, you can listen to it ahead of time.\n\nThis is really interesting, even if I came up totally wrong.\n\nBeth\n\n--- In EVP-ITC@yahoogroups.com, SnowfireL@... wrote:\n&gt;\n&gt; RJ, I did not ask spirit for evidence, they have nothing to prove to me,  \n&gt; because it is as i said before, this is subject to the listener for the most  \n&gt; part.  They are real people over there just like here, and for this type of \n&gt;  communication to be coming out now was a part of God&#39;s plan.  Except it  \n&gt; not.  The Wright Brother&#39;s were laughed at too, people thought flying was  \n&gt; nuts!  Yet here we are today flying all over the place, lol everything  \n&gt; material in existence today was once first in the realm of spirit or a  thought \n&gt; like state, I believe Jung called the prototypes  of everything,  Archtypes,  \n&gt; Some might think of the Archtype for the person a guardian  angel of each \n&gt; spirit.sf\n&gt;  \n&gt;  \n&gt; In a message dated 7/11/2010 10:11:49 A.M. Eastern Daylight Time,  \n&gt; rasterer@... writes:\n&gt; \n&gt;  \n&gt;  \n&gt;  \n&gt; \n&gt; Three days left on this first experiment.\n&gt; \n&gt; For those who say  skeptical people won&#39;t listen to any evidence, here is a \n&gt; great way to provide  some publicly and prove or disprove that statement.\n&gt; \n&gt; And if your&#39;re just  the type who maintains an open mind, and would like to \n&gt; try to see what works  and what doesn&#39;t, here&#39;s an opportunity to \n&gt; participate in a multi-person  test.\n&gt; \n&gt; --- In _EVP-ITC@yahoogroups.com_ (mailto:EVP-ITC@yahoogroups.com) ,  \n&gt; &quot;rasterer&quot; &lt;rasterer@&gt; wrote:\n&gt; &gt;\n&gt; &gt; \n&gt; &gt; I have placed  a little something on top of my computer monitor, right in \n&gt; front of me. It is  now 7/10/2010. I will leave it there 4 days, and remove \n&gt; it Noon Denver time,  on Wednesday, 7/14/2010.\n&gt; &gt; \n&gt; &gt; All you have to do is ask your  boxes/spirits/aliens/etc, what it is.\n&gt; &gt; \n&gt; &gt; I have taken a picture  of it, and posted it to the files section here, \n&gt; so there is no way I can  squirm out of the results:\n&gt; &gt; \n&gt; &gt; _http://tech.groups.yahoo.com/group/EVP-ITC/files/RJ/RJ.20100710.1.zip_ \n&gt; (http://tech.groups.yahoo.com/group/EVP-ITC/files/RJ/RJ.20100710.1.zip) \n&gt; &gt;  \n&gt; &gt; Please do not try to open the file before noon Wednesday. But feel  free \n&gt; to download it to your computer beforehand, so you can be sure I won&#39;t  \n&gt; change it during, or after, the test.\n&gt; &gt; \n&gt; &gt; Answers anyone reveals  after noon Wednesday don&#39;t count. Partial answers \n&gt; (like just the color, or  shape, or some emotion vibe) don&#39;t count. Just \n&gt; tell me what it is.\n&gt; &gt;  \n&gt; &gt; Best of Luck. I hope for this to be a regularly occurring experiment,  \n&gt; and I hope we all can learn from the results.\n&gt; &gt;\n&gt;"}