{"id": "18054", "subject": "Re: [EVP-ITC] Experiment 20100710 - RESULTS!", "author": "Frank Sumption", "timestamp": "2010-07-14T23:29:15Z", "full_text": "So you&#39;re not going to count my prediction as accurate? Or at least a big\nDAH!\n\n So go out in the world and claim you thoroughly debunked spirit&#39;s\nexistance.\n\n\n\n F-S\n\nOn Wed, Jul 14, 2010 at 12:00 PM, rasterer &lt;rasterer@yahoo.com&gt; wrote:\n\n&gt;\n&gt;\n&gt;\n&gt; Thanks again for everyone who participated! I admire your courage and\n&gt; motivation to try different methods, see what works, and try to improve\n&gt; everyone&#39;s understanding of EVP-ITC.\n&gt;\n&gt; If you recall, on 7/10/2010 I placed an object on top of my computer\n&gt; monitor, right in front of me, and left it there until today, 7/14/2010,\n&gt; noon Denver time. The experiment was for participants to determine what it\n&gt; was. Vague or partial answers wouldn&#39;t be counted (for example, just colors,\n&gt; shapes, sizes, what it&#39;s made of, etc): we&#39;re looking for what it is.\n&gt; Participants could use their ghost boxes, EVP recorders, or I suppose any\n&gt; other means they chose.\n&gt;\n&gt; In order to keep me honest, I took a picture of the object at the start of\n&gt; the experiment and loaded it to the Files section (RJ folder) of this group.\n&gt; If you can follow the link, it is here:\n&gt;\n&gt; http://tech.groups.yahoo.com/group/EVP-ITC/files/RJ/RJ.20100710.1.zip\n&gt;\n&gt; The idea was that you could download the file at the beginning of the test,\n&gt; and &#39;keep it safe&#39; on your computer. Then at the end of the test, I would\n&gt; release the password so you could reveal the contents of the file. That way,\n&gt; you were in control of the original image during the entire test, not me.\n&gt;\n&gt; The password for that file is: 123BlastOff\n&gt; Instructions, if you need them, are also in that RJ folder.\n&gt;\n&gt; And if you did not care to download the zip file before the test, I will\n&gt; post the final image there too.\n&gt;\n&gt; So to the results:\n&gt;\n&gt; Number of participants: 5\n&gt; Total tries: 8\n&gt; Ambiguous answers: 0\n&gt; Correct answers: 0\n&gt;\n&gt; Object: A radio\n&gt; Uzipped picture:\n&gt; http://tech.groups.yahoo.com/group/EVP-ITC/files/RJ/RJ.20100710.1.JPG\n&gt;\n&gt; So what do the results mean? All that we can really agree on from this\n&gt; experiment is that no participant, with whatever theories or methods or\n&gt; technology they used, was able to correctly determine the object. We can&#39;t\n&gt; say those theories or methods or technologies never work. Just as we can&#39;t\n&gt; say they do. Just that, for whatever reason, they did not work this time.\n&gt; Readers can take the results, use them to improve or change their methods,\n&gt; or keep doing what they&#39;re doing.\n&gt;\n&gt; If anyone has any observations, comments, or ideas for improvement, let me\n&gt; know. I hope to get a new experiment up and running soon. Since there wasn&#39;t\n&gt; much participation Mon-Wed, I think the next experiment will be arranged to\n&gt; mostly span the weekends.\n&gt;\n&gt; Again, thanks to everyone who participated in this first experiment.\n&gt;\n&gt; \n&gt;\n\nSo you' e no going o coun my p edic ion as accu a e? O a leas a big DAH!\n \n So go ou in he wo ld and claim you ho oughly debunked spi i 's exis ance.\n \n \n \n F-S\nOn Wed, Jul 14, 2010 a 12:00 PM, as e e as e e @...> w o e:\n\n  \n\n\n\nThanks again o e e yone who pa icipa ed! I admi e you cou age and mo i a ion o y di e en me hods, see wha wo ks, and y o imp o e e e yone's unde s anding o EVP-ITC.I you ecall, on 7/10/2010 I placed an objec on op o my compu e moni o , igh in on o me, and le i he e un il oday, 7/14/2010, noon Den e ime. The expe imen was o pa icipan s o de e mine wha i was. Vague o pa ial answe s wouldn' be coun ed ( o example, jus colo s, shapes, sizes, wha i 's made o , e c): we' e looking o wha i is. Pa icipan s could use hei ghos boxes, EVP eco de s, o I suppose any o he means hey chose.\nIn o de o keep me hones , I ook a pic u e o he objec a he s a o he expe imen and loaded i o he Files sec ion (RJ olde ) o his g oup. I you can ollow he link, i is he e:h p:// ech.g oups.yahoo.com/g oup/EVP-ITC/ iles/RJ/RJ.20100710.1.zip\nThe idea was ha you could download he ile a he beginning o he es , and 'keep i sa e' on you compu e . Then a he end o he es , I would elease he passwo d so you could e eal he con en s o he ile. Tha way, you we e in con ol o he o iginal image du ing he en i e es , no me. \nThe passwo d o ha ile is: 123Blas O Ins uc ions, i you need hem, a e also in ha RJ olde .And i you did no ca e o download he zip ile be o e he es , I will pos he inal image he e oo.\nSo o he esul s:Numbe o pa icipan s: 5To al ies: 8Ambiguous answe s: 0Co ec answe s: 0Objec : A adioUzipped pic u e:h p:// ech.g oups.yahoo.com/g oup/EVP-ITC/ iles/RJ/RJ.20100710.1.JPG\nSo wha do he esul s mean? All ha we can eally ag ee on om his expe imen is ha no pa icipan , wi h wha e e heo ies o me hods o echnology hey used, was able o co ec ly de e mine he objec . We can' say hose heo ies o me hods o echnologies ne e wo k. Jus as we can' say hey do. Jus ha , o wha e e eason, hey did no wo k his ime. Reade s can ake he esul s, use hem o imp o e o change hei me hods, o keep doing wha hey' e doing.\nI anyone has any obse a ions, commen s, o ideas o imp o emen , le me know. I hope o ge a new expe imen up and unning soon. Since he e wasn' much pa icipa ion Mon-Wed, I hink he nex expe imen will be a anged o mos ly span he weekends.\nAgain, hanks o e e yone who pa icipa ed in his i s expe imen ."}