{"id": "18076", "subject": "Re: Experiment 20100710 - RESULTS!", "author": "Beth", "timestamp": "2010-07-15T17:55:09Z", "full_text": "Lod, I can see you are trying to get me in trouble here. :-)  I don&#39;t think everybody believes everything they hear, but you have to admit it is very interesting when you get a reply to what you are asking.  I still am amazed at that, and I cannot fathom how it works.  I do question who am I talking to.  Are they really who they say they are?  Where are they?  How do they talk on the radio waves?\n\nI don&#39;t know.  I just find this very interesting to say the least.  I must admit I am a bit scared of it, though I do have sessions.  I am just too intrigued by it not too.  But, having said that, I have not heard anything that has made me change my life in anyway.  It, for the most part, makes me ponder...\n\nBeth\n\n--- In EVP-ITC@yahoogroups.com, Rj &lt;rasterer@...&gt; wrote:\n&gt;\n&gt; Thanks Beth - that&#39;s an interesting conclusion.\n&gt; I suppose that would imply that there may also be a level of trust which people apply to what they hear, that maybe isn&#39;t justified?\n&gt; \n&gt; And I&#39;ll make the next timeframe shorter  :)\n&gt; \n&gt; \n&gt; --- On Wed, 7/14/10, Beth &lt;bmcduffie59@...&gt; wrote:\n&gt; \n&gt; From: Beth &lt;bmcduffie59@...&gt;\n&gt; Subject: [EVP-ITC] Re: Experiment 20100710 - RESULTS!\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Wednesday, July 14, 2010, 10:30 PM\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt;   \n&gt; \n&gt; \n&gt;     \n&gt;       \n&gt;       \n&gt;       I must admit I enjoyed the experiment even though none of us got the right answer.  I was thinking about this earlier.  Part of the problem, I think, is that we are dealing with spirits of people.. hopefully... and they have the same limitations I do.  They are just people, so they cannot know everything that is everywhere.  They are not like God who is all seeing and all knowing.  I don&#39;t know that we could ever get this answer right.\n&gt; \n&gt; \n&gt; \n&gt; I still enjoyed doing it though, and I couldn&#39;t wait to see what the picture was.  Lol, I didn&#39;t think Wed. would ever get here!\n&gt; \n&gt; \n&gt; \n&gt; Beth\n&gt; \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, SnowfireL@ wrote:\n&gt; \n&gt; &gt;\n&gt; \n&gt; &gt; That&#39;s because I did not send &quot;radio&quot; in I  thought he was wrong!  I \n&gt; \n&gt; &gt; reasoned, how could a radio sit a top a  monitor?  I was not looking for such a \n&gt; \n&gt; &gt; huge old monitor like that one you  see? sf\n&gt; \n&gt; &gt;  \n&gt; \n&gt; &gt;  \n&gt; \n&gt; &gt; In a message dated 7/14/2010 9:02:01 P.M. Eastern Daylight Time,  \n&gt; \n&gt; &gt; rasterer@ writes:\n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt;  \n&gt; \n&gt; &gt;  \n&gt; \n&gt; &gt;  \n&gt; \n&gt; &gt; One of the points of that first experiment was to shake  out the bugs.  Now \n&gt; \n&gt; &gt; that everyone has seen the monitor, we should be  good for the next run, if \n&gt; \n&gt; &gt; that was an issue for anyone.\n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; BTW, I  didn&#39;t hear &#39;radio&#39; in your files, but that&#39;s not important.  It&#39;s  \n&gt; \n&gt; &gt; just what you all say the object is during the  timeframe.\n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; --- On Wed, 7/14/10, SnowfireL@, 7/14/10, &lt;SnowfireL@&gt; wrote:\n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; From:  SnowfireL@&lt;SnowfireL@&gt;\n&gt; \n&gt; &gt; Subject: Re:  [EVP-ITC] Experiment 20100710 - RESULTS!\n&gt; \n&gt; &gt; To:  EVP-ITC@yahoogroupsTo: \n&gt; \n&gt; &gt; Date: Wednesday, July 14, 2010, 4:23  PM\n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt;  \n&gt; \n&gt; &gt; I sent  you the part of the file where He said that is was a radio, it&#39;s in \n&gt; \n&gt; &gt;  the whole thing, when  I asked Him on Skype, I  couldn&#39;t understand what \n&gt; \n&gt; &gt; He was trying to say, so, I just took  the first few, the ones that made the \n&gt; \n&gt; &gt; most sense of something on top  of a monitor, your monitor is different from \n&gt; \n&gt; &gt; mine, mine is so skinny,  only a bird can sit on it. You probably should \n&gt; \n&gt; &gt; have shown us a picture  of what your monitor looked like, so we would not \n&gt; \n&gt; &gt; have just tossed out  other possible answers.  As I said before, your monitor \n&gt; \n&gt; &gt; looks  like a big white box from the early 90&#39;s  to me, or maybe my  eyes are \n&gt; \n&gt; &gt; not seeing it clearly enough. sf\n&gt; \n&gt; &gt;  \n&gt; \n&gt; &gt;  \n&gt; \n&gt; &gt; In a message dated  7/14/2010 7:12:11 P.M. Eastern Daylight Time, \n&gt; \n&gt; &gt; rasterer@yahoo. com  writes:\n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt;  \n&gt; \n&gt; &gt; Here&#39;s a way to look at your specific  method.  You say that David gave you \n&gt; \n&gt; &gt; the answer.   But, you were not able to hear it, or would not accept it,  \n&gt; \n&gt; &gt; until I told you what it was.  That would sound like a  frustrating situation \n&gt; \n&gt; &gt; for David, and you.  But, this  experiment could in theory help there, by \n&gt; \n&gt; &gt; making it more clear  to you when you have heard a valid message, versus when \n&gt; \n&gt; &gt; you  have imposed your own prejudices into the sound (as in this  case, you \n&gt; \n&gt; &gt; said you did not believe a radio could fit on the  monitor).   So in your \n&gt; \n&gt; &gt; methodology this would be of  benefit both to you (because you could improve \n&gt; \n&gt; &gt; your skills  through these experiments) and to David (as he would not have  \n&gt; \n&gt; &gt; to have you miss what he was saying as often).\n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; --- On  Wed, 7/14/10, SnowfireL@aol. com &lt;SnowfireL@aol.  com&gt; wrote:\n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; From:  SnowfireL@aol. com &lt;SnowfireL@aol. com&gt;\n&gt; \n&gt; &gt; Subject:  Re: [EVP-ITC] Experiment 20100710 - RESULTS!\n&gt; \n&gt; &gt; To:  EVP-ITC@yahoogroups .com\n&gt; \n&gt; &gt; Date: Wednesday, July 14, 2010,  4:09 PM\n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt;  \n&gt; \n&gt; &gt; Well, the problem RJ, is all the voices that  are coming through all the \n&gt; \n&gt; &gt; time, some of them are from lower  levels or plains, they are usually easier \n&gt; \n&gt; &gt; to hear, because  they are closer, unless of course they happen to  be tech&#39;s \n&gt; \n&gt; &gt; or our guides and angels.  The spirit&#39;s  with the most credibility are \n&gt; \n&gt; &gt; going to be harder  to hear, since they are well beyond the white light, and are \n&gt; \n&gt; &gt;  in much higher plains.  They read our minds, as they  can read the minds \n&gt; \n&gt; &gt; of each other, only the ones in lower  plains are not able to read the minds \n&gt; \n&gt; &gt; of those higher  spirits if they choose to not reveal themselves.   Because \n&gt; \n&gt; &gt; of this it&#39;s going to be tough, if I gave everyone&#39;s  opinion out of the 4 \n&gt; \n&gt; &gt; minutes, you could write a book, then  when I found Dave&#39;s voice, he was not \n&gt; \n&gt; &gt; so easy to hear, I had  to make it louder, when I tried to reach Him on \n&gt; \n&gt; &gt; Skype, I  couldn&#39;t get what He said correctly, so it was my own fault,  and not \n&gt; \n&gt; &gt; His. sf\n&gt; \n&gt; &gt;  \n&gt; \n&gt; &gt;  \n&gt; \n&gt; &gt; In a message  dated 7/14/2010 6:27:09 P.M. Eastern Daylight Time,  \n&gt; \n&gt; &gt; rasterer@yahoo. com writes:\n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt;  \n&gt; \n&gt; &gt; I think it does matter though.  \n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; One of the things we&#39;re trying to do is set  up an objective framework for \n&gt; \n&gt; &gt; experimenting with  some of these aspects.  I think we have all  experienced \n&gt; \n&gt; &gt; the difficulty in hearing what is on  some of these recordings: sometimes \n&gt; \n&gt; &gt; we&#39;re not sure  at first what it says. Sometimes we ask others for  their \n&gt; \n&gt; &gt; input.  Sometimes we only hear it once  someone else tells us it first.  \n&gt; \n&gt; &gt; Sometimes we  hear it wrong.  Sometimes we hear it right. And  so on.\n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; It would be useful to know, as an  individual, how good we are at hearing \n&gt; \n&gt; &gt; it right, so  we have some idea how trustworthy our skill, or  methods, or \n&gt; \n&gt; &gt; technology, is.  If we can measure  that, or even get a feel for it, we can \n&gt; \n&gt; &gt; look for  ways to improve it.  If we can&#39;t measure it,  then we could be \n&gt; \n&gt; &gt; stuck.  \n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; So, by  restricting the answers only to the timeframe of the  experiment, \n&gt; \n&gt; &gt; we can help filter out some of the  problems of subjectivity: for example, \n&gt; \n&gt; &gt; one theory is  that people can hear what they want to hear, or can  these \n&gt; \n&gt; &gt; sounds in a certain way, once you already know  the answer.  Or, given 2 ways to \n&gt; \n&gt; &gt; hear a sound,  being influenced, even subconsciously, to hear it  one way \n&gt; \n&gt; &gt; over the other.  We want to rule that  out.\n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; This is one reason we can only count on  answers given during the \n&gt; \n&gt; &gt; timeframe.  That is  when the answer is most objective.  Once the  object has been \n&gt; \n&gt; &gt; announced, we move into a   period where we can&#39;t discount possible influence  \n&gt; \n&gt; &gt; from already knowing the answer.\n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; But, I am  confident that if a person&#39;s method or technology  really can \n&gt; \n&gt; &gt; reveal the correct answer outside the  timeframe, then doing it within the \n&gt; \n&gt; &gt; timeframe should  be just as easy, and would then be a valid objective  result \n&gt; \n&gt; &gt; for all to see.\n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; --- On Wed,  7/14/10, SnowfireL@aol. com &lt;SnowfireL@aol.  com&gt; wrote:\n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; From:  SnowfireL@aol. com &lt;SnowfireL@aol.  com&gt;\n&gt; \n&gt; &gt; Subject: Re: [EVP-ITC] Experiment  20100710 - RESULTS!\n&gt; \n&gt; &gt; To: EVP-ITC@yahoogroups  .com\n&gt; \n&gt; &gt; Date: Wednesday, July 14, 2010, 2:50  PM\n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt;  \n&gt; \n&gt; &gt; it  doesn&#39;t matter, it&#39;s in the whole file, I didn&#39;t  think it was possible \n&gt; \n&gt; &gt; to have a radio sit on top  of a pc screen i guess.  But, I know He did  \n&gt; \n&gt; &gt; say it, that&#39;s all the proof I need. haha!  &lt;G&gt; would you like the whole 4 \n&gt; \n&gt; &gt; minute  question the whole tape?\n&gt; \n&gt; &gt;  \n&gt; \n&gt; &gt;  \n&gt; \n&gt; &gt; In a  message dated 7/14/2010 5:46:11 P.M. Eastern  Daylight Time, \n&gt; \n&gt; &gt; rasterer@yahoo. com  writes:\n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt;  \n&gt; \n&gt; &gt; Snowfire, as I noted at the  beginning of the test, sending in results \n&gt; \n&gt; &gt; after  I already announced what the object is can&#39;t of  course be part of the \n&gt; \n&gt; &gt; experiment.  Someone  could simply read what I said, and it could then  \n&gt; \n&gt; &gt; influence their own interpretation of ramdom  noise, for example, or they could \n&gt; \n&gt; &gt; say &quot;I got it  but forgot to mail it&quot;, or a host of other  reasons.\n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; To make the experiment as  objective as possible, only answers sent during  \n&gt; \n&gt; &gt; the experiment&#39;s timeframe can be  valid.\n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; --- On Wed, 7/14/10,  SnowfireL@aol. com &lt;SnowfireL@aol.  com&gt; wrote:\n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; From:  SnowfireL@aol. com &lt;SnowfireL@aol.  com&gt;\n&gt; \n&gt; &gt; Subject: Re: [EVP-ITC] Experiment  20100710 - RESULTS! [1 Attachment]\n&gt; \n&gt; &gt; To:  EVP-ITC@yahoogroups .com\n&gt; \n&gt; &gt; Date: Wednesday,  July 14, 2010, 2:35 PM\n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt;  \n&gt; \n&gt; &gt; Haha,  David did get it right RJ, I just didn&#39;t send  this one in.  He \n&gt; \n&gt; &gt; says, Radio twice!!!   So, cool, I didn&#39;t think he was right, but i  guess, he \n&gt; \n&gt; &gt; was after all. sf\n&gt; \n&gt; &gt;  \n&gt; \n&gt; &gt;  \n&gt; \n&gt; &gt; In a  message dated 7/14/2010 5:31:02 P.M. Eastern  Daylight Time, \n&gt; \n&gt; &gt; rasterer@yahoo. com  writes:\n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt;  \n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; Snowfire, I do have more  than one monitor.  Some are in my closet  (so not \n&gt; \n&gt; &gt; in this room, and not near me).   And the others in this room are laptops.  \n&gt; \n&gt; &gt;  None of the laptops had anything on them.   And the monitors in the closet \n&gt; \n&gt; &gt; just have other  equipment on them.\n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; But now that I&#39;ve sent  out a picture of the monitor, next time everyone  \n&gt; \n&gt; &gt; knows what it looks like, so maybe that will  help.  Or, I&#39;m open to \n&gt; \n&gt; &gt; suggestions for  other locations for the object in question  too.  This was just \n&gt; \n&gt; &gt; close to me (I would  see it every day), and was also the monitor I  use for \n&gt; \n&gt; &gt; this newsgroup.\n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; --- On  Wed, 7/14/10, SnowfireL@aol. com  &lt;SnowfireL@aol. com&gt; wrote:\n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; From:  SnowfireL@aol. com &lt;SnowfireL@aol.  com&gt;\n&gt; \n&gt; &gt; Subject: Re: [EVP-ITC] Experiment  20100710 - RESULTS!\n&gt; \n&gt; &gt; To: EVP-ITC@yahoogroups  .com\n&gt; \n&gt; &gt; Date: Wednesday, July 14, 2010, 2:00  PM\n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt;  \n&gt; \n&gt; &gt; Well, RJ don&#39;t know why they couldn&#39;t get  it, maybe that thing doesn&#39;t  \n&gt; \n&gt; &gt; look like a monitor to them, looks more like a  box, do you have more then one \n&gt; \n&gt; &gt; monitor in your  house?  If David got it wrong, it was my  fault for not \n&gt; \n&gt; &gt; understanding Him.   sf\n&gt; \n&gt; &gt;  \n&gt; \n&gt; &gt;  \n&gt; \n&gt; &gt; In a message dated 7/14/2010 2:20:10 P.M.  Eastern Daylight Time, \n&gt; \n&gt; &gt; rasterer@yahoo. com  writes:\n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt;  \n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; Thanks again for everyone who  participated! I admire your courage and  \n&gt; \n&gt; &gt; motivation to try different methods, see what  works, and try to improve \n&gt; \n&gt; &gt; everyone&#39;s  understanding of EVP-ITC.\n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; If you recall,  on 7/10/2010 I placed an object on top of my  computer \n&gt; \n&gt; &gt; monitor, right in front of me, and left  it there until today, 7/14/2010, noon \n&gt; \n&gt; &gt; Denver  time. The experiment was for participants to  determine what it was. \n&gt; \n&gt; &gt; Vague or partial answers  wouldn&#39;t be counted (for example, just colors,  \n&gt; \n&gt; &gt; shapes, sizes, what it&#39;s made of, etc): we&#39;re  looking for what it is. \n&gt; \n&gt; &gt; Participants could use  their ghost boxes, EVP recorders, or I suppose  any other \n&gt; \n&gt; &gt; means they chose.\n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; In order to  keep me honest, I took a picture of the object  at the start \n&gt; \n&gt; &gt; of the experiment and loaded it to  the Files section (RJ folder) of this \n&gt; \n&gt; &gt; group. If  you can follow the link, it is here:\n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; _http://tech.  groups.yahoo. com/group/ EVP-ITC/files/  RJ/RJ.20100710. \n&gt; \n&gt; &gt; 1.zip_ (http://tech.groups.yahoo.com/group/EVP-ITC/files/RJ/RJ.20100710.1.zip) \n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; The idea was  that you could download the file at the  beginning of the \n&gt; \n&gt; &gt; test, and &#39;keep it safe&#39; on  your computer. Then at the end of the test, I  \n&gt; \n&gt; &gt; would release the password so you could reveal  the contents of the file. That \n&gt; \n&gt; &gt; way, you were in  control of the original image during the entire  test, not \n&gt; \n&gt; &gt; me. \n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; The password for that file  is: 123BlastOff\n&gt; \n&gt; &gt; Instructions, if you need  them, are also in that RJ folder.\n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; And if  you did not care to download the zip file before  the test, I will \n&gt; \n&gt; &gt; post the final image there  too.\n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; So to the results:\n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; Number of  participants: 5\n&gt; \n&gt; &gt; Total tries: 8\n&gt; \n&gt; &gt; Ambiguous  answers: 0\n&gt; \n&gt; &gt; Correct answers: 0\n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; Object:  A radio\n&gt; \n&gt; &gt; Uzipped picture:\n&gt; \n&gt; &gt; _http://tech.  groups.yahoo. com/group/ EVP-ITC/files/  RJ/RJ.20100710. \n&gt; \n&gt; &gt; 1.JPG_ (http://tech.groups.yahoo.com/group/EVP-ITC/files/RJ/RJ.20100710.1.JPG) \n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; So what do the  results mean? All that we can really agree on  from this \n&gt; \n&gt; &gt; experiment is that no participant,  with whatever theories or methods or \n&gt; \n&gt; &gt; technology  they used, was able to correctly determine the  object. We can&#39;t say \n&gt; \n&gt; &gt; those theories or methods  or technologies never work. Just as we can&#39;t say  \n&gt; \n&gt; &gt; they do. Just that, for whatever reason, they  did not work this time. \n&gt; \n&gt; &gt; Readers can take the  results, use them to improve or change their  methods, or \n&gt; \n&gt; &gt; keep doing what they&#39;re  doing.\n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; If anyone has any observations,  comments, or ideas for improvement, let me \n&gt; \n&gt; &gt; know.  I hope to get a new experiment up and running  soon. Since there \n&gt; \n&gt; &gt; wasn&#39;t much participation  Mon-Wed, I think the next experiment will be  \n&gt; \n&gt; &gt; arranged to mostly span the  weekends.\n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; Again, thanks to everyone who  participated in this first  experiment.\n&gt; \n&gt; &gt;\n&gt;"}