{"id": "18081", "subject": "Experiment 2", "author": "rasterer", "timestamp": "2010-07-16T18:28:45Z", "full_text": "Experiment 2\n\nOn Friday, 7/16/2010 I placed an object on top of my computer monitor, right in front of me, and will leave it there until noon Denver time on Monday, 7/19/2010.   This experiment asks for participants to determine what that object is. Vague or partial answers won&#39;t be counted (for example, just giving a color, shape, size,  what it&#39;s made of, etc): we&#39;re looking for what it is. Answers anyone reveals after noon Monday won&#39;t count.  Participants can use their ghost boxes, EVP recorders, or any other means they chose.  At the end of the experiment, I will reveal the object, and a tally of the number of correct and/or incorrect answers.\n\nIn order to keep me honest, I have taken a picture of the object at the start of the experiment and loaded it to the Files section (RJ folder) of this group.  The idea with this file is that you can download it now and &#39;keep it safe&#39; on your computer. Then at the end of the experiment, I will post the password so you can reveal the contents of the file. That way, you were in control of the original image during the entire test, not me. If you can follow the link, it is here:\n\nWindows users: http://tech.groups.yahoo.com/group/EVP-ITC/files/RJ/RJ20100716.win.zip\n\nMac users: http://tech.groups.yahoo.com/group/EVP-ITC/files/RJ/RJ20100716.mac.zip\n\n\nAnd if you do not care to download the zip file now, I will post the final image there at the end of the experiment anyway.\n\nMy monitor is one of the older box-like SONY CRTs, and says &quot;Trinitron&quot; and  &quot;Multiscan 200sf&quot; on the upper front.   I have a couple monitors stacked in my closet too: they are not the monitors used in this experiment (and have nothing else on them anyway), and I have several laptops around: they are also not the monitors in this experiment.  The monitor in this experiment is the only SONY monitor I have, says &quot;SONY in various places on it, can be seen in the following link from the first experiment, when the correct answer would have been &quot;radio&quot;:\n\nhttp://tech.groups.yahoo.com/group/EVP-ITC/files/RJ/RJ.20100710.1.JPG\n\nPlease post all answers to the group thread: that way, there will be a public record and I won&#39;t get accused of losing any answers. \n\nAnd best of luck to all the participants!"}