{"id": "18085", "subject": "Re: [EVP-ITC] Experiment 2", "author": "David Koenig", "timestamp": "2010-07-16T19:59:27Z", "full_text": "Sounds good if you can insure the &quot;Secret&#39; ... Please remember that I&#39;m a\nMagician/Mentalist and I&#39;ve utilized similar procedures in a Deceptive\nmanner. But if you can assure no &quot;Hanky Panky&quot; it is a fantastic idea!!!!\nI once did something similar with three boxes. Only about 30 or so people\nguessed. One fellow hit one directly and said one of the other boxes was\nempty .. and it was !!!! (But he guesses the wrong one... Still, with\nmillions of things it could have been... Very Interesting !!! All on the up\nand up.\nKeep up the good work.\n\nOn Fri, Jul 16, 2010 at 3:42 PM, Rj &lt;rasterer@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; I am  hesitant to reveal the answer to anyone before the end of the test,\n&gt; since that would call into question a possible &#39;leak&#39;.\n&gt;\n&gt; But I have loaded a mac version of the file up now, which doesn&#39;t use any\n&gt; self-extracting extra applications: just the disk imaging built into the\n&gt; OS.  I&#39;ll look into doing the same with Windows, so there is no worry about\n&gt; any apps in the zip file.\n&gt;\n&gt;\n&gt;\n&gt; --- On *Fri, 7/16/10, David Koenig &lt;floridajakeblues@...&gt;* wrote:\n&gt;\n&gt;\n&gt; From: David Koenig &lt;floridajakeblues@...&gt;\n&gt; Subject: Re: [EVP-ITC] Experiment 2\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Friday, July 16, 2010, 12:15 PM\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; This is AWESOME!!!!\n&gt; We did several experiments like this on the Magic Cafe and the results were\n&gt; amazing. However, I would request that you contact one member on the board\n&gt; and tell them the real answer. If the zip file carries any applications it\n&gt; can not be trusted unfortunately.\n&gt; I think this can be very exciting and fun too!!!!\n&gt; Dave\n&gt; THE MAN THE SKEPTICS REFUSED TO TEST FOR A MILLION DOLLARS.\n&gt;\n&gt; On Fri, Jul 16, 2010 at 2:28 PM, rasterer &lt;rasterer@yahoo. com&lt;http://mc/compose?to=rasterer@...&gt;\n&gt; &gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; Experiment 2\n&gt;&gt;\n&gt;&gt; On Friday, 7/16/2010 I placed an object on top of my computer monitor,\n&gt;&gt; right in front of me, and will leave it there until noon Denver time on\n&gt;&gt; Monday, 7/19/2010. This experiment asks for participants to determine what\n&gt;&gt; that object is. Vague or partial answers won&#39;t be counted (for example, just\n&gt;&gt; giving a color, shape, size, what it&#39;s made of, etc): we&#39;re looking for what\n&gt;&gt; it is. Answers anyone reveals after noon Monday won&#39;t count. Participants\n&gt;&gt; can use their ghost boxes, EVP recorders, or any other means they chose. At\n&gt;&gt; the end of the experiment, I will reveal the object, and a tally of the\n&gt;&gt; number of correct and/or incorrect answers.\n&gt;&gt;\n&gt;&gt; In order to keep me honest, I have taken a picture of the object at the\n&gt;&gt; start of the experiment and loaded it to the Files section (RJ folder) of\n&gt;&gt; this group. The idea with this file is that you can download it now and\n&gt;&gt; &#39;keep it safe&#39; on your computer. Then at the end of the experiment, I will\n&gt;&gt; post the password so you can reveal the contents of the file. That way, you\n&gt;&gt; were in control of the original image during the entire test, not me. If you\n&gt;&gt; can follow the link, it is here:\n&gt;&gt;\n&gt;&gt; Windows users: http://tech. groups.yahoo. com/group/ EVP-ITC/files/\n&gt;&gt; RJ/RJ20100716. win.zip&lt;http://tech.groups.yahoo.com/group/EVP-ITC/files/RJ/RJ20100716.win.zip&gt;\n&gt;&gt;\n&gt;&gt; Mac users: http://tech. groups.yahoo. com/group/ EVP-ITC/files/\n&gt;&gt; RJ/RJ20100716. mac.zip&lt;http://tech.groups.yahoo.com/group/EVP-ITC/files/RJ/RJ20100716.mac.zip&gt;\n&gt;&gt;\n&gt;&gt; And if you do not care to download the zip file now, I will post the final\n&gt;&gt; image there at the end of the experiment anyway.\n&gt;&gt;\n&gt;&gt; My monitor is one of the older box-like SONY CRTs, and says &quot;Trinitron&quot;\n&gt;&gt; and &quot;Multiscan 200sf&quot; on the upper front. I have a couple monitors stacked\n&gt;&gt; in my closet too: they are not the monitors used in this experiment (and\n&gt;&gt; have nothing else on them anyway), and I have several laptops around: they\n&gt;&gt; are also not the monitors in this experiment. The monitor in this experiment\n&gt;&gt; is the only SONY monitor I have, says &quot;SONY in various places on it, can be\n&gt;&gt; seen in the following link from the first experiment, when the correct\n&gt;&gt; answer would have been &quot;radio&quot;:\n&gt;&gt;\n&gt;&gt; http://tech. groups.yahoo. com/group/ EVP-ITC/files/ RJ/RJ.20100710. 1.JPG&lt;http://tech.groups.yahoo.com/group/EVP-ITC/files/RJ/RJ.20100710.1.JPG&gt;\n&gt;&gt;\n&gt;&gt; Please post all answers to the group thread: that way, there will be a\n&gt;&gt; public record and I won&#39;t get accused of losing any answers.\n&gt;&gt;\n&gt;&gt; And best of luck to all the participants!\n&gt;&gt;\n&gt;&gt;\n&gt;\n&gt;  \n&gt;\n\nSounds good i you can insu e he \"Sec e ' ... Please emembe ha I'm a Magician/Men alis and I' e u ilized simila p ocedu es in a Decep i e manne . Bu i you can assu e no \"Hanky Panky\" i is a an as ic idea!!!!\nI once did some hing simila wi h h ee boxes. Only abou 30 o so people guessed. One ellow hi one di ec ly and said one o he o he boxes was emp y .. and i was !!!! (Bu he guesses he w ong one... S ill, wi h millions o hings i could ha e been... Ve y In e es ing !!! All on he up and up.\nKeep up he good wo k.On F i, Jul 16, 2010 a 3:42 PM, Rj as e e @...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n I am  hesi an o e eal he answe o anyone be o e he end o he es , since ha would call in o ques ion a possible 'leak'.  \nBu I ha e loaded a mac e sion o he ile up now, which doesn' use any sel -ex ac ing ex a applica ions: jus he disk imaging buil in o he OS.  I'll look in o doing he same wi h Windows, so he e is no wo y abou any apps in he zip ile.\n--- On F i, 7/16/10, Da id Koenig lo idajakeblues@...> w o e:\nF om: Da id Koenig lo idajakeblues@...>Subjec : Re: [EVP-ITC] Expe imen 2To: EVP-ITC@yahoog oups.com\nDa e: F iday, July 16, 2010, 12:15 PM\n\n\n\n\n\n \n\n\n\n \n \n \n This is AWESOME!!!!We did se e al expe imen s like his on he Magic Ca e and he esul s we e amazing. Howe e , I would eques ha you con ac one membe on he boa d and ell hem he eal answe . I he zip ile ca ies any applica ions i can no be us ed un o una ely.\n\nI hink his can be e y exci ing and un oo!!!!Da eTHE MAN THE SKEPTICS REFUSED TO TEST FOR A MILLION DOLLARS.On F i, Jul 16, 2010 a 2:28 PM, as e e as e e @yahoo. com> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n Expe imen 2\n\nOn F iday, 7/16/2010 I placed an objec on op o my compu e moni o , igh in on o me, and will lea e i he e un il noon Den e ime on Monday, 7/19/2010. This expe imen asks o pa icipan s o de e mine wha ha objec is. Vague o pa ial answe s won' be coun ed ( o example, jus gi ing a colo , shape, size, wha i 's made o , e c): we' e looking o wha i is. Answe s anyone e eals a e noon Monday won' coun . Pa icipan s can use hei ghos boxes, EVP eco de s, o any o he means hey chose. A he end o he expe imen , I will e eal he objec , and a ally o he numbe o co ec and/o inco ec answe s.\n\n\n\nIn o de o keep me hones , I ha e aken a pic u e o he objec a he s a o he expe imen and loaded i o he Files sec ion (RJ olde ) o his g oup. The idea wi h his ile is ha you can download i now and 'keep i sa e' on you compu e . Then a he end o he expe imen , I will pos he passwo d so you can e eal he con en s o he ile. Tha way, you we e in con ol o he o iginal image du ing he en i e es , no me. I you can ollow he link, i is he e:\n\n\n\nWindows use s: h p:// ech. g oups.yahoo. com/g oup/ EVP-ITC/ iles/ RJ/RJ20100716. win.zip\n\nMac use s: h p:// ech. g oups.yahoo. com/g oup/ EVP-ITC/ iles/ RJ/RJ20100716. mac.zip\n\nAnd i you do no ca e o download he zip ile now, I will pos he inal image he e a he end o he expe imen anyway.\n\nMy moni o is one o he olde box-like SONY CRTs, and says \"T ini on\" and \"Mul iscan 200s \" on he uppe on . I ha e a couple moni o s s acked in my close oo: hey a e no he moni o s used in his expe imen (and ha e no hing else on hem anyway), and I ha e se e al lap ops a ound: hey a e also no he moni o s in his expe imen . The moni o in his expe imen is he only SONY moni o I ha e, says \"SONY in a ious places on i , can be seen in he ollowing link om he i s expe imen , when he co ec answe would ha e been \" adio\":\n\n\n\nh p:// ech. g oups.yahoo. com/g oup/ EVP-ITC/ iles/ RJ/RJ.20100710. 1.JPG\n\nPlease pos all answe s o he g oup h ead: ha way, he e will be a public eco d and I won' ge accused o losing any answe s. \n\nAnd bes o luck o all he pa icipan s!"}