{"id": "18104", "subject": "Re: [EVP-ITC] noodles anyone?", "author": "Frank Sumption", "timestamp": "2010-07-17T20:51:36Z", "full_text": "It is all vegetarian!\n\n F-S\n\nOn Sat, Jul 17, 2010 at 2:22 PM, &lt;SnowfireL@aol.com&gt; wrote:\n\n&gt;\n&gt;\n&gt; Your stew doesn&#39;t look too bad for an alien shrouded in purple all the\n&gt; time. &lt;g&gt; sf\n&gt;\n&gt;  In a message dated 7/17/2010 3:29:53 P.M. Eastern Daylight Time,\n&gt; purplealiengirl@... writes:\n&gt;\n&gt;\n&gt;\n&gt;  I see those eyes everywhere, but my interpretation different. I think it&#39;s\n&gt; the eye sockets of skulls, a universal symbol of death and doom. Sometimes\n&gt; the whole skull will show in these images. Charli Claypool used to call\n&gt; these eyes Cat Eyes, she thought they looked like cats.\n&gt;\n&gt;  When I see just the circles in the clouds, that means tornado&#39;s somewhere\n&gt; east of here. Unpaired circles, the bigger the circle the bigger the storm.\n&gt; there was one over the mountains for Katrina, it was huge where the entire\n&gt; circumferencee of the circle was circulating on itself.\n&gt;\n&gt;  Instead of noodles, how &#39;bout some nice vegible stew?\n&gt;\n&gt;\n&gt;  F-S\n&gt;\n&gt; On Sat, Jul 17, 2010 at 12:09 PM, &lt;SnowfireL@...&gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; http://www.youtube.com/watch?v=I_rmVCNUB0w&NR=1&feature=fvwp\n&gt;&gt;\n&gt;&gt;\n&gt;     \n&gt;\n\nI is all ege a ian!\n \n F-S\nOn Sa , Jul 17, 2010 a 2:22 PM, Snow i eL@...> w o e:\n\n  \n\n\n\n\nYou s ew doesn' look oo bad o an alien sh ouded in pu ple all he ime. s \n\n\n\n \n\nIn a message da ed 7/17/2010 3:29:53 P.M. Eas e n Dayligh Time, pu plealiengi l@... w i es:\n  \n\n\n I see hose eyes e e ywhe e, bu my in e p e a ion di e en . I hink i 's he eye socke s o skulls, a uni e sal symbol o dea h and doom. Some imes he whole skull will show in hese images. Cha li Claypool used o call hese eyes Ca Eyes, she hough hey looked like ca s. \n\n \n When I see jus he ci cles in he clouds, ha means o nado's somewhe e eas o he e. Unpai ed ci cles, he bigge he ci cle he bigge he s o m. he e was one o e he moun ains o Ka ina, i was huge whe e he en i e ci cum e encee o he ci cle was ci cula ing on i sel . \n\n \n Ins ead o noodles, how 'bou some nice egible s ew?\n \n \n F-S\nOn Sa , Jul 17, 2010 a 12:09 PM, Snow i eL@...> w o e:\n\n  \n\n\n\n\nh p://www.you ube.com/wa ch? =I_ mVCNUB0w&NR=1& ea u e= wp"}