{"id": "18176", "subject": "Re: Experiment 2 - RESULTS!", "author": "Urkel23", "timestamp": "2010-07-20T01:35:45Z", "full_text": "Just because we are not getting the correct information you&#39;re putting us under the microscope to get, doesn&#39;t mean that this communication doesn&#39;t exist.  I hate to get like this, because that&#39;s not my style.  But you sit back and judge us and expect the spirit community to perform for you like puppets.\n\np.s.---Scientists are rarely right about anything.  Instead of experimenting and trying things themselves, they feel they are superior to the researchers and can judge every move we make without doing anything.  I don&#39;t mind the blind testing, it&#39;s that something speaks and makes sense that shouldn&#39;t is my fascination with this.  If you had a 68&#39; mustang parked on your monitor and they said it was an ice cream cone, it still was a voice that responded to my question....whether right or wrong.\n\n-Steve H.\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, Rj &lt;rasterer@...&gt; wrote:\n&gt;\n&gt; All we can say is so far is that the information you got was unreliable.  We can&#39;t necessarily say why.\n&gt; \n&gt; And what do you mean,. doing something for myself? This is doing something for myself, and for others: I am testing claims, to see which methods work, and which don&#39;t. So far, the ones being used here, haven&#39;t been shown to work.\n&gt; \n&gt; \n&gt; \n&gt; --- On Mon, 7/19/10, Urkel23 &lt;urkel23@...&gt; wrote:\n&gt; \n&gt; From: Urkel23 &lt;urkel23@...&gt;\n&gt; Subject: [EVP-ITC] Re: Experiment 2 - RESULTS!\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Monday, July 19, 2010, 5:13 PM\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt;   \n&gt; \n&gt; \n&gt;     \n&gt;       \n&gt;       \n&gt;       \n&gt; \n&gt; I see a point that frank makes.  For example, my file was very clear that said &quot;marker&quot;.  It doesn&#39;t mean that we are all nuts, that&#39;s the information that was given to us.  It was a direct response to a question that i asked.  It&#39;s not our fault that they gave me bad info, they probably didn&#39;t know the answer. \n&gt; \n&gt; \n&gt; \n&gt; I don&#39;t want to treat them like some retarded idiots over there, i wish to give them respect.  The fact in my mind is that they are saying something and just because they didn&#39;t get your test right doesn&#39;t mean that it&#39;s any less fascinating to me that something talks that shouldn&#39;t.  They probably could care less what&#39;s on your monitor.  \n&gt; \n&gt; \n&gt; \n&gt; They are probably sitting there trying to figure out why you aren&#39;t doing anything yourself.  \n&gt; \n&gt; \n&gt; \n&gt; -Steve H.\n&gt; \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@&gt; wrote:\n&gt; \n&gt; &gt;\n&gt; \n&gt; &gt;  DAH! again. There&#39;s way to much expectation created in trying to guess, so\n&gt; \n&gt; &gt; participants minds interfere with whatever spirit communication there might\n&gt; \n&gt; &gt; be. You do not understand how this communcations works, nor do you\n&gt; \n&gt; &gt; understand the effects of the observer, you can not seperate the observer\n&gt; \n&gt; &gt; from the event in the pararnormal. therefore any results are invalid--before\n&gt; \n&gt; &gt; you go puffing your chest out thinking how clever you are in debunking\n&gt; \n&gt; &gt; spirit communication. Even your own expectation that no valid information\n&gt; \n&gt; &gt; will be received is enough to block all information. But as usual,\n&gt; \n&gt; &gt; skeptic/debunker ignore all!\n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt;  F-S\n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; On Mon, Jul 19, 2010 at 1:03 PM, &lt;SnowfireL@&gt; wrote:\n&gt; \n&gt; &gt; \n&gt; \n&gt; &gt; &gt;\n&gt; \n&gt; &gt; &gt;\n&gt; \n&gt; &gt; &gt; RJ. David insists you had an ink pen there, and &quot;he changed it.&quot;\n&gt; \n&gt; &gt; &gt;\n&gt; \n&gt; &gt; &gt;\n&gt; \n&gt; &gt; &gt; -----Original Message-----\n&gt; \n&gt; &gt; &gt; From: rasterer &lt;rasterer@&gt;\n&gt; \n&gt; &gt; &gt; To: EVP-ITC@yahoogroups.com\n&gt; \n&gt; &gt; &gt; Sent: Mon, Jul 19, 2010 2:39 pm\n&gt; \n&gt; &gt; &gt; Subject: [EVP-ITC] Experiment 2 - RESULTS!\n&gt; \n&gt; &gt; &gt;\n&gt; \n&gt; &gt; &gt;\n&gt; \n&gt; &gt; &gt;  Thanks to everyone who participated in Experiment 2.\n&gt; \n&gt; &gt; &gt;\n&gt; \n&gt; &gt; &gt; On Friday, 7/16/2010 I placed an object on top of my computer monitor,\n&gt; \n&gt; &gt; &gt; right in front of me, and left it there until noon Denver time on Monday,\n&gt; \n&gt; &gt; &gt; 7/19/2010. This experiment asked for participants to determine what that\n&gt; \n&gt; &gt; &gt; object was. Vague or partial answers would not be counted (for example, just\n&gt; \n&gt; &gt; &gt; giving a color, shape, size, what it&#39;s made of, etc): we&#39;re looking for what\n&gt; \n&gt; &gt; &gt; it is. Answers anyone reveals after noon Denver time Monday won&#39;t count.\n&gt; \n&gt; &gt; &gt; Participants can use their ghost boxes, EVP recorders, or any other means\n&gt; \n&gt; &gt; &gt; they chose.\n&gt; \n&gt; &gt; &gt;\n&gt; \n&gt; &gt; &gt; In order to keep me honest, I took a picture of the object at the start of\n&gt; \n&gt; &gt; &gt; the experiment and loaded it to the Files section (RJ folder) of this group.\n&gt; \n&gt; &gt; &gt; The idea with this file is that you could download it at the beginning of\n&gt; \n&gt; &gt; &gt; the experiment and &#39;keep it safe&#39; on your computer. Then at the end of the\n&gt; \n&gt; &gt; &gt; experiment, I would post the password so you can reveal the contents of the\n&gt; \n&gt; &gt; &gt; file. That way, you were in control of the original image during the entire\n&gt; \n&gt; &gt; &gt; time, not me.\n&gt; \n&gt; &gt; &gt;\n&gt; \n&gt; &gt; &gt; Passworded pdf:\n&gt; \n&gt; &gt; &gt; http://tech.groups.yahoo.com/group/EVP-ITC/files/RJ/RJ20100716.pdf\n&gt; \n&gt; &gt; &gt;\n&gt; \n&gt; &gt; &gt; The password for that file is: 2plus2isFour\n&gt; \n&gt; &gt; &gt; Instructions, if you need them for the other files, are also in that RJ\n&gt; \n&gt; &gt; &gt; folder.\n&gt; \n&gt; &gt; &gt;\n&gt; \n&gt; &gt; &gt; So to the results:\n&gt; \n&gt; &gt; &gt;\n&gt; \n&gt; &gt; &gt; Number of participants: 6\n&gt; \n&gt; &gt; &gt; Total tries: 29\n&gt; \n&gt; &gt; &gt; Ambiguous answers: 0\n&gt; \n&gt; &gt; &gt; Correct answers: 0\n&gt; \n&gt; &gt; &gt;\n&gt; \n&gt; &gt; &gt; Object: Chair\n&gt; \n&gt; &gt; &gt; Object picture:\n&gt; \n&gt; &gt; &gt; http://tech.groups.yahoo.com/group/EVP-ITC/files/RJ/RJ20100716.jpg\n&gt; \n&gt; &gt; &gt;\n&gt; \n&gt; &gt; &gt; As a little side experiment, on Monday I also asked if anyone had gotten\n&gt; \n&gt; &gt; &gt; any answers that might indicate an article of clothing (though I did not say\n&gt; \n&gt; &gt; &gt; why I was asking). One theory is that the human operator can be influenced\n&gt; \n&gt; &gt; &gt; by things they already know or suspect, and so interpret audio with their\n&gt; \n&gt; &gt; &gt; own personal &#39;educated guesses&#39;, that would differ from what they would hear\n&gt; \n&gt; &gt; &gt; had they not known those things. This side experiment did indicate some\n&gt; \n&gt; &gt; &gt; support for that theory, since before I mentioned &#39;articles of clothing&#39;, no\n&gt; \n&gt; &gt; &gt; one included an article of clothing in their results. But after I mentioned\n&gt; \n&gt; &gt; &gt; it, several reports of clothing began to appear. I did not add these tries\n&gt; \n&gt; &gt; &gt; to the results above.\n&gt; \n&gt; &gt; &gt;\n&gt; \n&gt; &gt; &gt; If anyone has any observations, comments, or ideas for improvement, let me\n&gt; \n&gt; &gt; &gt; know. Again, thanks to everyone who participated in this experiment.\n&gt; \n&gt; &gt; &gt;\n&gt; \n&gt; &gt; &gt;  \n&gt; \n&gt; &gt; &gt;\n&gt; \n&gt; &gt;\n&gt;"}