{"id": "18207", "subject": "Re: [EVP-ITC] Re: [RTSC] From #78", "author": "SnowfireL@aol.com", "timestamp": "2010-07-22T00:50:05Z", "full_text": "----------MB_8CCF74EF5C519B4_1C40_B9D2_Webmail-m107.sysops.aol.com\r\nContent-Transfer-Encoding: quoted-printable\r\nContent-Type: text/plain; charset=&quot;utf-8&quot;\r\n\r\n It would be nice if someone could verify that, that Kurt Cobain went into =\r\nthe light ok, he was a singer in the 90&#39;s some say suicide, other&#39;s say he =\r\nwas murdered.=C2=A0 He was a heavy drug user. sf\n\n \n\n\n\n-----Original Messag=\r\ne-----\nFrom: SnowfireL@...\nTo: EVP-ITC@yahoogroups.com\nSent: Wed, Jul 2=\r\n1, 2010 8:37 pm\nSubject: Re: [EVP-ITC] Re: [RTSC] From #78\n\n          =C2=\r\n=A0                                   \n \n \n   I am not sure but the antichr=\r\nist who is now 29 years old, is of Turkish=C2=A0 and Spanish, born and rais=\r\ned in Spain, and recently moved to Rome.=C2=A0 He more then likely is Catho=\r\nlic, and will try to control them too, and may do so, if he can, I have no =\r\nidea how he is going to start up, but I do know, people will really like hi=\r\nm at first, for the first 3 years or so, thing is, this country will be dra=\r\nwn into a needless war, don&#39;t know much from there, got to bug David about =\r\nstuff.=C2=A0 btw, the singer, Kurt Cobain, went into the light late last ni=\r\nght, he had been in darkness since he died in i think, 95, David was here, =\r\nat about midnight last night,=C2=A0 I was doing a short sessions, trying my=\r\n 3 RS, on AM, and I asked who was here, some lady says, clearly, &quot;your moth=\r\ner&#39; then i heard moms voice, i just said, Hi mom!=C2=A0 Then some man&#39;s voi=\r\nce broke in asking for David, he said, &quot;David&quot; twice, and then said, &quot;emerg=\r\nency, seems he had to go back to higher planes, to take care of something, =\r\nI found out the lower &quot;dark heads&quot; as they are called, were not allowing Ku=\r\nrt C. to go into the light, but David got over and took care of things, I g=\r\nuess.=C2=A0 I also heard, &quot;Michael&quot; says his name, not sure which Michael i=\r\nt was, but he sure has a nice voice.=C2=A0 So he did get in, later,=C2=A0 I=\r\n asked David if Kurt went to the Rest plane or where, and he told me that K=\r\nurt went with his guardian angel and was all right, i guess he had loved on=\r\nes there waiting for him for a long time now.sf\n \n  \n \n -----Original Messa=\r\nge-----\n From: SnowfireL@...\n To: EVP-ITC@yahoogroups.com\n Sent: Wed, J=\r\nul 21, 2010 8:09 pm\n Subject: Re: [EVP-ITC] Re: [RTSC] From #78\n \n         =\r\n    =C2=A0                                      Well, it&#39;s sure not her, it=\r\n&#39;s some fella now in Rome, according to David the Tech, he is now 29 years =\r\nold, and he will start up his thing right after Obama makes a big mess for =\r\nthe US, gets more kids killed in senseless wars, I know, he didn&#39;t start th=\r\nings, but he isn&#39;t getting those kids out either, he is sending more to tho=\r\nse country&#39;s over there, such a waste.=C2=A0 And will even start up a 3 mon=\r\nth mandatory civilian army for young people ages 18 to 19 maybe, younger.=\r\n=C2=A0 Jerusalem will be left neutral, as will be the country of Israel, be=\r\ncause the antichrist wants to seat himself there in the near future.=C2=A0 =\r\nThe antichrist is some guy that was born without a spirit, he has a soul, b=\r\nut wasn&#39;t given a spirit until recently, that was the spirit of the antichr=\r\nist that took over his physical body, so in a sense it is a spirit possessi=\r\non.=C2=A0 I really hope this is all wrong, I want to have things be like Po=\r\nllyanna, but it won&#39;t be that way for some time yet. sf\n   \n   \n  \n    \n  \n=\r\n  -----Original Message-----\n  From: Beth &lt;bmcduffie59@...&gt;\n  T=\r\no: EVP-ITC@yahoogroups.com\n  Sent: Wed, Jul 21, 2010 5:24 pm\n  Subject: [EV=\r\nP-ITC] Re: [RTSC] From #78\n  \n                =C2=A0                       =\r\n                   I saw a clip on youtube where a ghost box group was aski=\r\nng who the antichrist was.  Of course their first question was if it was Ob=\r\nama.  the answer was no.  So then they asked who it was, and the box said i=\r\nt was Sarah Palin!  Lol, now I know... the spirits are all people from the =\r\nleft!\n   \n   Beth\n   \n   PS- I love Sarah!  At this point, I would vote for=\r\n her in a second!\n   \n   --- In EVP-ITC@yahoogroups.com, SnowfireL@... wrot=\r\ne:\n   &gt;\n   &gt;  Well, ya know Beth, he has broke many promises, as they=\r\n all do once they get into office, look at how he has &quot;brought them all hom=\r\ne&quot;=C3=82=C2=A0 lol, he is sending more and more into other country&#39;s, maybe=\r\n, he is like a puppet for higher ups, it&#39;s a scary situation, David has men=\r\ntion the antichrist on more then one occasion, he has moved from Spain to R=\r\nome lately, and will start up soon, making people really like him at first,=\r\n then after someone here, could be a president, not going to say who, start=\r\ns a war between several big country&#39;s.=C3=82=C2=A0 The US will be so weak f=\r\nrom all the wasted life of those young people going into middle east and pl=\r\naces, (they should be getting married, buying homes, and making baby&#39;s righ=\r\nt now, not dying).=C3=82=C2=A0 It&#39;s a situation \n   &gt; similar to Viet Na=\r\nm, we lost a whole generation just right there, and what did we win?=C3=82=\r\n=C2=A0 \n   &gt; \n   &gt; Only about oil control, thing is the US may not fo=\r\nllow the antichrist cause, but we are going to be so darn weak, that we wil=\r\nl be fighting each other just to survive from what he says, he mentioned se=\r\nveral country&#39;s that will not follow antichrist, which are: US, Australia, =\r\nCanada, UK, Russia, or China, thing is we may be enticed into fighting thes=\r\ne other country&#39;s which will only serve to weaken US more.=C3=82=C2=A0 The =\r\nantichrist won&#39;t get Canada because they will bring him trouble, for some r=\r\neason, maybe, when he thinks he&#39;ll get those stubborn limies.=C3=82=C2=A0 B=\r\nelieve me, I hope nothing like this happens, but we are moving toward much =\r\nof it right now, and it&#39;s scary. sf\n   &gt; \n   &gt;  \n   &gt; \n   &gt; \n  =\r\n &gt; \n   &gt; -----Original Message-----\n   &gt; From: Beth bmcduffie59@..=\r\n.\n   &gt; To: EVP-ITC@yahoogroups.com\n   &gt; Sent: Wed, Jul 21, 2010 1:00 =\r\npm\n   &gt; Subject: [EVP-ITC] Re: [RTSC] From #78\n   &gt; \n   &gt;         =\r\n  =C3=82=C2=A0                                  Well, I for one, hope David=\r\n is right about Obama leaving office.  Of course, that would mean Joe Biden=\r\n would be president... sigh.  That isn&#39;t a happy thought either.\n   &gt;  \n=\r\n   &gt;  I hope there is not another war.  I just heard somewhere of secret=\r\n plans to attack Iran.  Lol, if I heard about it, it must not be very secre=\r\nt.\n   &gt;  \n   &gt;  Beth\n   &gt;  \n   &gt;  --- In EVP-ITC@...=\r\nm, SnowfireL@ wrote:\n   &gt;  &gt;\n   &gt;  &gt;  I think there may be anot=\r\nher earth quake, yikes!=C3=83=E2=80=9A=C3=82=C2=A0=C3=83=E2=80=9A=C3=82=C2=\r\n=A0 And in march Obama is supposed to leave office, just after we are drawn=\r\n into another bigger war, double yikes!!\n   &gt;  &gt; \n   &gt;  &gt;  Don&#39;=\r\nt know what after that, whole thing is scary, he was going to bring back th=\r\ne troops, ya right!=C3=83=E2=80=9A=C3=82=C2=A0 &quot;liar, liar, pants on fire.&quot;=\r\n\n   &gt;  &gt; \n   &gt;  &gt; As the Tech, David might say; &quot;oh well,&quot;=C3=\r\n=83=E2=80=9A=C3=82=C2=A0 sometimes his expression is; &quot;for the last time&quot; o=\r\nr &quot;i really don&#39;t wanna talk about it.&quot; sf\n   &gt;  &gt; \n   &gt;  &gt; \n  =\r\n &gt;  &gt; ----Original Message-----\n   &gt;  &gt; From: Frank Sumption pu=\r\nrplealiengirl@\n   &gt;  &gt; To: evp-itc@yahoogroups.com; RTSC@yahoogroups.=\r\ncom\n   &gt;  &gt; Sent: Wed, Jul 21, 2010 2:58 am\n   &gt;  &gt; Subject: [R=\r\nTSC] From #78 [1 Attachment]\n   &gt;  &gt; \n   &gt;  &gt;           =C3=83=\r\n=E2=80=9A=C3=82=C2=A0                                            [Attachmen=\r\nt(s) from Frank Sumption included below]                       \n   &gt;  &g=\r\nt; Just the usual.\n   &gt;  &gt;  =C3=83=E2=80=9A=C3=82=C2=A0\n   &gt;  &gt;=\r\n  =C3=83=E2=80=9A=C3=82=C2=A0F-S\n   &gt;  &gt;\n   &gt;\n   \n   \n        \n   =\r\n                  \n     \n         \n     \n \n  \n       \n                   \n =\r\n   \n        \n    \n\n\n      \n                 \n   \n       \n  \n\n\r\n----------MB_8CCF74EF5C519B4_1C40_B9D2_Webmail-m107.sysops.aol.com\r\nContent-Transfer-Encoding: quoted-printable\r\nContent-Type: text/html; charset=&quot;utf-8&quot;\r\n\r\n\n&lt;div style=3D&quot;font-family: arial; color: black; font-size: 10pt;&quot;&gt; It woul=\r\nd be nice if someone could verify that, that Kurt Cobain went into the ligh=\r\nt ok, he was a singer in the 90&#39;s some say suicide, other&#39;s say he was murd=\r\nered.&nbsp; He was a heavy drug user. sf&lt;br&gt;\n&lt;/div&gt;\n\n&lt;div&gt; &lt;br&gt;\n&lt;/div&gt;\n\n&lt;di=\r\nv&gt;&lt;br&gt;\n&lt;/div&gt;\n-----Original Message-----&lt;br&gt;\nFrom: SnowfireL@...&lt;br&gt;\nTo=\r\n: EVP-ITC@yahoogroups.com&lt;br&gt;\nSent: Wed, Jul 21, 2010 8:37 pm&lt;br&gt;\nSubject: =\r\nRe: [EVP-ITC] Re: [RTSC] From #78&lt;br&gt;\n&lt;br&gt;\n \n&lt;div id=3D&quot;AOLMsgPart_2_083f8c=\r\n51-19c3-4da5-8015-9b76e6ce3218&quot;&gt;        \n&lt;div class=3D&quot;aolReplacedBody&quot; sty=\r\nle=3D&quot;background-color: rgb(255, 255, 255);&quot;&gt; &lt;span style=3D&quot;display: none;=\r\n&quot;&gt;&nbsp;&lt;/span&gt;   \n&lt;div id=3D&quot;ygrp-mlmsg&quot; style=3D&quot;position: relative;&quot;&gt;   =\r\n\n&lt;div id=3D&quot;ygrp-msg&quot; style=3D&quot;z-index: 1;&quot;&gt;       \n&lt;div id=3D&quot;ygrp-text&quot;&gt; =\r\n                    \n&lt;div&gt; &lt;/div&gt;\n\n&lt;div style=3D&quot;font-family: arial; color:=\r\n black; font-size: 10pt;&quot;&gt; &lt;br&gt;\n &lt;/div&gt;\n  \n&lt;div&gt; I am not sure but the anti=\r\nchrist who is now 29 years old, is of Turkish&nbsp; and Spanish, born and r=\r\naised in Spain, and recently moved to Rome.&nbsp; He more then likely is Ca=\r\ntholic, and will try to control them too, and may do so, if he can, I have =\r\nno idea how he is going to start up, but I do know, people will really like=\r\n him at first, for the first 3 years or so, thing is, this country will be =\r\ndrawn into a needless war, don&#39;t know much from there, got to bug David abo=\r\nut stuff.&nbsp; btw, the singer, Kurt Cobain, went into the light late last=\r\n night, he had been in darkness since he died in i think, 95, David was her=\r\ne, at about midnight last night,&nbsp; I was doing a short sessions, trying=\r\n my 3 RS, on AM, and I asked who was here, some lady says, clearly, &quot;your m=\r\nother&#39; then i heard moms voice, i just said, Hi mom!&nbsp; Then some man&#39;s =\r\nvoice broke in asking for David, he said, &quot;David&quot; twice, and then said, &quot;em=\r\nergency, seems he had to go back to higher planes, to take care of somethin=\r\ng, I found out the lower &quot;dark heads&quot; as they are called, were not allowing=\r\n Kurt C. to go into the light, but David got over and took care of things, =\r\nI guess.&nbsp; I also heard, &quot;Michael&quot; says his name, not sure which Michae=\r\nl it was, but he sure has a nice voice.&nbsp; So he did get in, later,&nbsp=\r\n; I asked David if Kurt went to the Rest plane or where, and he told me tha=\r\nt Kurt went with his guardian angel and was all right, i guess he had loved=\r\n ones there waiting for him for a long time now.sf&lt;br&gt;\n &lt;/div&gt;\n  \n&lt;div&gt;&lt;br&gt;=\r\n\n &lt;/div&gt;\n -----Original Message-----&lt;br&gt;\n From: SnowfireL@aol.&lt;wbr&gt;com&lt;br&gt;\n=\r\n To: EVP-ITC@yahoogroups&lt;wbr&gt;.com&lt;br&gt;\n Sent: Wed, Jul 21, 2010 8:09 pm&lt;br&gt;\n=\r\n Subject: Re: [EVP-ITC] Re: [RTSC] From #78&lt;br&gt;\n &lt;br&gt;\n   \n&lt;div id=3D&quot;AOLMsg=\r\nPart_2_c100320b-9a11-4ad4-afc7-bb184a8a6864&quot;&gt;         \n&lt;div class=3D&quot;aolRep=\r\nlacedBody&quot; style=3D&quot;background-color: rgb(255, 255, 255);&quot;&gt; &lt;span&gt;&nbsp;&lt;/s=\r\npan&gt;    \n&lt;div id=3D&quot;ygrp-mlmsg&quot;&gt;    \n&lt;div id=3D&quot;ygrp-msg&quot;&gt;        \n&lt;div id=\r\n=3D&quot;ygrp-text&quot;&gt;                      \n&lt;div&gt;&lt;font color=3D&quot;black&quot;&gt;&lt;font size=\r\n=3D&quot;2&quot;&gt;&lt;font face=3D&quot;arial&quot;&gt;Well, it&#39;s sure not her, it&#39;s some fella now in=\r\n Rome, according to David the Tech, he is now 29 years old, and he will sta=\r\nrt up his thing right after Obama makes a big mess for the US, gets more ki=\r\nds killed in senseless wars&lt;/font&gt;&lt;/font&gt;&lt;/font&gt;, I know, he didn&#39;t start t=\r\nhings, but he isn&#39;t getting those kids out either, he is sending more to th=\r\nose country&#39;s over there, such a waste.&nbsp; And will even start up a 3 mo=\r\nnth mandatory civilian army for young people ages 18 to 19 maybe, younger.&=\r\nnbsp; Jerusalem will be left neutral, as will be the country of Israel, bec=\r\nause the antichrist wants to seat himself there in the near future.&nbsp; T=\r\nhe antichrist is some guy that was born without a spirit, he has a soul, bu=\r\nt wasn&#39;t given a spirit until recently, that was the spirit of the antichri=\r\nst that took over his physical body, so in a sense it is a spirit possessio=\r\nn.&nbsp; I really hope this is all wrong, I want to have things be like Pol=\r\nlyanna, but it won&#39;t be that way for some time yet. sf&lt;br&gt;\n   &lt;/div&gt;\n  \n&lt;di=\r\nv&gt; &lt;br&gt;\n  &lt;/div&gt;\n    \n&lt;div&gt;&lt;br&gt;\n  &lt;/div&gt;\n  -----Original Message-----&lt;br&gt;\n =\r\n From: Beth &lt;bmcduffie59@&lt;wbr&gt;yahoo.com&gt;&lt;br&gt;\n  To: EVP-ITC@yahoogroup=\r\ns&lt;wbr&gt;.com&lt;br&gt;\n  Sent: Wed, Jul 21, 2010 5:24 pm&lt;br&gt;\n  Subject: [EVP-ITC] R=\r\ne: [RTSC] From #78&lt;br&gt;\n  &lt;br&gt;\n     \n&lt;div id=3D&quot;AOLMsgPart_2_34ed05f7-a80b-4=\r\n046-b692-d43f73d3ed9b&quot;&gt;          \n&lt;div class=3D&quot;aolReplacedBody&quot; style=3D&quot;b=\r\nackground-color: rgb(255, 255, 255);&quot;&gt; &lt;span&gt;&nbsp;&lt;/span&gt;     \n&lt;div id=3D&quot;=\r\nygrp-mlmsg&quot;&gt;     \n&lt;div id=3D&quot;ygrp-msg&quot;&gt;         \n&lt;div id=3D&quot;ygrp-text&quot;&gt;    =\r\n                   \n&lt;div&gt;I saw a clip on youtube where a ghost box group wa=\r\ns asking who the antichrist was.  Of course their first question was if it =\r\nwas Obama.  the answer was no.  So then they asked who it was, and the box =\r\nsaid it was Sarah Palin!  Lol, now I know... the spirits are all people fro=\r\nm the left!&lt;br&gt;\n   &lt;br&gt;\n   Beth&lt;br&gt;\n   &lt;br&gt;\n   PS- I love Sarah!  At this p=\r\noint, I would vote for her in a second!&lt;br&gt;\n   &lt;br&gt;\n   --- In &lt;a href=3D&quot;ma=\r\nilto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;wbr&gt;.com&lt;/a&gt;, SnowfireL=\r\n@..&lt;wbr&gt;. wrote:&lt;br&gt;\n   &gt;&lt;br&gt;\n   &gt;  Well, ya know Beth, he has broke =\r\nmany promises, as they all do once they get into office, look at how he has=\r\n &quot;brought them all home&quot;=C3=82&nbsp; lol, he is sending more and more into =\r\nother country&#39;s, maybe, he is like a puppet for higher ups, it&#39;s a scary si=\r\ntuation, David has mention the antichrist on more then one occasion, he has=\r\n moved from Spain to Rome lately, and will start up soon, making people rea=\r\nlly like him at first, then after someone here, could be a president, not g=\r\noing to say who, starts a war between several big country&#39;s.=C3=82&nbsp; Th=\r\ne US will be so weak from all the wasted life of those young people going i=\r\nnto middle east and places, (they should be getting married, buying homes, =\r\nand making baby&#39;s right now, not dying).=C3=82&nbsp; It&#39;s a situation &lt;br&gt;\n=\r\n   &gt; similar to Viet Nam, we lost a whole generation just right there, a=\r\nnd what did we win?=C3=82&nbsp; &lt;br&gt;\n   &gt; &lt;br&gt;\n   &gt; Only about oil co=\r\nntrol, thing is the US may not follow the antichrist cause, but we are goin=\r\ng to be so darn weak, that we will be fighting each other just to survive f=\r\nrom what he says, he mentioned several country&#39;s that will not follow antic=\r\nhrist, which are: US, Australia, Canada, UK, Russia, or China, thing is we =\r\nmay be enticed into fighting these other country&#39;s which will only serve to=\r\n weaken US more.=C3=82&nbsp; The antichrist won&#39;t get Canada because they w=\r\nill bring him trouble, for some reason, maybe, when he thinks he&#39;ll get tho=\r\nse stubborn limies.=C3=82&nbsp; Believe me, I hope nothing like this happen=\r\ns, but we are moving toward much of it right now, and it&#39;s scary. sf&lt;br&gt;\n  =\r\n &gt; &lt;br&gt;\n   &gt;  &lt;br&gt;\n   &gt; &lt;br&gt;\n   &gt; &lt;br&gt;\n   &gt; &lt;br&gt;\n   &gt; ---=\r\n--Original Message-----&lt;br&gt;\n   &gt; From: Beth bmcduffie59@&lt;wbr&gt;...&lt;br&gt;\n   =\r\n&gt; To: &lt;a href=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;w=\r\nbr&gt;.com&lt;/a&gt;&lt;br&gt;\n   &gt; Sent: Wed, Jul 21, 2010 1:00 pm&lt;br&gt;\n   &gt; Subject=\r\n: [EVP-ITC] Re: [RTSC] From #78&lt;br&gt;\n   &gt; &lt;br&gt;\n   &gt;           =C3=82&n=\r\nbsp;                                  Well, I for one, hope David is right =\r\nabout Obama leaving office.  Of course, that would mean Joe Biden would be =\r\npresident... sigh.  That isn&#39;t a happy thought either.&lt;br&gt;\n   &gt;  &lt;br&gt;\n  =\r\n &gt;  I hope there is not another war.  I just heard somewhere of secret p=\r\nlans to attack Iran.  Lol, if I heard about it, it must not be very secret.=\r\n&lt;br&gt;\n   &gt;  &lt;br&gt;\n   &gt;  Beth&lt;br&gt;\n   &gt;  &lt;br&gt;\n   &gt;  --- In &lt;a href=\r\n=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;wbr&gt;.com&lt;/a&gt;, Sno=\r\nwfireL@ wrote:&lt;br&gt;\n   &gt;  &amp;gt;&lt;br&gt;\n   &gt;  &amp;gt;  I think there m=\r\nay be another earth quake, yikes!=C3=83=E2=80=9A=C3=82&nbsp;=C3=83=E2=80=9A=\r\n=C3=82&nbsp; And in march Obama is supposed to leave office, just after we =\r\nare drawn into another bigger war, double yikes!!&lt;br&gt;\n   &gt;  &amp;gt; &lt;br=\r\n&gt;\n   &gt;  &amp;gt;  Don&#39;t know what after that, whole thing is scary, he w=\r\nas going to bring back the troops, ya right!=C3=83=E2=80=9A=C3=82&nbsp; &quot;li=\r\nar, liar, pants on fire.&quot;&lt;br&gt;\n   &gt;  &amp;gt; &lt;br&gt;\n   &gt;  &amp;gt; As t=\r\nhe Tech, David might say; &quot;oh well,&quot;=C3=83=E2=80=9A=C3=82&nbsp; sometimes h=\r\nis expression is; &quot;for the last time&quot; or &quot;i really don&#39;t wanna talk about i=\r\nt.&quot; sf&lt;br&gt;\n   &gt;  &amp;gt; &lt;br&gt;\n   &gt;  &amp;gt; &lt;br&gt;\n   &gt;  &amp;gt; =\r\n----Original Message-----&lt;br&gt;\n   &gt;  &amp;gt; From: Frank Sumption purple=\r\naliengirl@&lt;br&gt;\n   &gt;  &amp;gt; To: &lt;a href=3D&quot;mailto:evp-itc%40yahoogroup=\r\ns.com&quot;&gt;evp-itc@yahoogroups&lt;wbr&gt;.com&lt;/a&gt;; &lt;a href=3D&quot;mailto:RTSC%40yahoogrou=\r\nps.com&quot;&gt;RTSC@yahoogroups.&lt;wbr&gt;com&lt;/a&gt;&lt;br&gt;\n   &gt;  &amp;gt; Sent: Wed, Jul =\r\n21, 2010 2:58 am&lt;br&gt;\n   &gt;  &amp;gt; Subject: [RTSC] From #78 [1 Attachme=\r\nnt]&lt;br&gt;\n   &gt;  &amp;gt; &lt;br&gt;\n   &gt;  &amp;gt;           =C3=83=E2=80=9A=\r\n=C3=82&nbsp;                                            [Attachment(&lt;wbr&gt;s)=\r\n from Frank Sumption included below]                       &lt;br&gt;\n   &gt;  &a=\r\nmp;gt; Just the usual.&lt;br&gt;\n   &gt;  &amp;gt;  =C3=83=E2=80=9A=C3=82&nbsp;&lt;b=\r\nr&gt;\n   &gt;  &amp;gt;  =C3=83=E2=80=9A=C3=82&nbsp;F-S&lt;br&gt;\n   &gt;  &amp;gt;&lt;=\r\nbr&gt;\n   &gt;&lt;br&gt;\n   &lt;br&gt;\n   &lt;/div&gt;\n        &lt;/div&gt;\n                     \n&lt;div=\r\n style=3D&quot;color: rgb(255, 255, 255); height: 0pt;&quot;&gt;&lt;/div&gt;\n     &lt;/div&gt;\n     =\r\n    &lt;/div&gt;\n     &lt;/div&gt;\n &lt;/div&gt;\n  \n&lt;div&gt;&lt;/div&gt;\n       &lt;/div&gt;\n               =\r\n    \n&lt;div style=3D&quot;color: rgb(255, 255, 255); height: 0pt;&quot;&gt;&lt;/div&gt;\n    &lt;/di=\r\nv&gt;\n        &lt;/div&gt;\n    &lt;/div&gt;\n&lt;/div&gt;\n\n&lt;div&gt;&lt;/div&gt;\n      &lt;/div&gt;\n             =\r\n    \n&lt;div style=3D&quot;color: rgb(255, 255, 255); height: 0pt;&quot;&gt;&lt;/div&gt;\n   &lt;/div=\r\n&gt;\n      &lt;style type=3D&quot;text/css&quot;&gt;#AOLMsgPart_2_083f8c51-19c3-4da5-8015-9b76=\r\ne6ce3218 td{color: black;}     #AOLMsgPart_2_083f8c51-19c3-4da5-8015-9b76e6=\r\nce3218 #ygrp-mkp {  border: 1px solid #d8d8d8;  font-family: Arial;  margin=\r\n: 10px 0;  padding: 0 10px;}#AOLMsgPart_2_083f8c51-19c3-4da5-8015-9b76e6ce3=\r\n218 #ygrp-mkp hr {  border: 1px solid #d8d8d8;}#AOLMsgPart_2_083f8c51-19c3-=\r\n4da5-8015-9b76e6ce3218 #ygrp-mkp #hd {  color: #628c2a;  font-size: 85%;  f=\r\nont-weight: 700;  line-height: 122%;  margin: 10px 0;}#AOLMsgPart_2_083f8c5=\r\n1-19c3-4da5-8015-9b76e6ce3218 #ygrp-mkp #ads {  margin-bottom: 10px;}#AOLMs=\r\ngPart_2_083f8c51-19c3-4da5-8015-9b76e6ce3218 #ygrp-mkp .ad {  padding: 0 0;=\r\n}#AOLMsgPart_2_083f8c51-19c3-4da5-8015-9b76e6ce3218 #ygrp-mkp .ad a {  colo=\r\nr: #0000ff;  text-decoration: none;}  #AOLMsgPart_2_083f8c51-19c3-4da5-8015=\r\n-9b76e6ce3218 #ygrp-sponsor #ygrp-lc {  font-family: Arial;}#AOLMsgPart_2_0=\r\n83f8c51-19c3-4da5-8015-9b76e6ce3218 #ygrp-sponsor #ygrp-lc #hd {  margin: 1=\r\n0px 0px;  font-weight: 700;  font-size: 78%;  line-height: 122%;}#AOLMsgPar=\r\nt_2_083f8c51-19c3-4da5-8015-9b76e6ce3218 #ygrp-sponsor #ygrp-lc .ad {  marg=\r\nin-bottom: 10px;  padding: 0 0;}  #AOLMsgPart_2_083f8c51-19c3-4da5-8015-9b7=\r\n6e6ce3218 a {    color: #1e66ae;  }  #AOLMsgPart_2_083f8c51-19c3-4da5-8015-=\r\n9b76e6ce3218 #actions {    font-family: Verdana;    font-size: 11px;    pad=\r\nding: 10px 0;  }  #AOLMsgPart_2_083f8c51-19c3-4da5-8015-9b76e6ce3218 #activ=\r\nity {    background-color: #e0ecee;    float: left;    font-family: Verdana=\r\n;    font-size: 10px;    padding: 10px;  }  #AOLMsgPart_2_083f8c51-19c3-4da=\r\n5-8015-9b76e6ce3218 #activity span {    font-weight: 700;  }  #AOLMsgPart_2=\r\n_083f8c51-19c3-4da5-8015-9b76e6ce3218 #activity span:first-child {    text-=\r\ntransform: uppercase;  }  #AOLMsgPart_2_083f8c51-19c3-4da5-8015-9b76e6ce321=\r\n8 #activity span a {    color: #5085b6;    text-decoration: none;  }  #AOLM=\r\nsgPart_2_083f8c51-19c3-4da5-8015-9b76e6ce3218 #activity span span {    colo=\r\nr: #ff7900;  }  #AOLMsgPart_2_083f8c51-19c3-4da5-8015-9b76e6ce3218 #activit=\r\ny span .underline {    text-decoration: underline;  }  #AOLMsgPart_2_083f8c=\r\n51-19c3-4da5-8015-9b76e6ce3218 .attach {    clear: both;    display: table;=\r\n    font-family: Arial;    font-size: 12px;    padding: 10px 0;    width: 4=\r\n00px;  }  #AOLMsgPart_2_083f8c51-19c3-4da5-8015-9b76e6ce3218 .attach div a =\r\n{    text-decoration: none;  }  #AOLMsgPart_2_083f8c51-19c3-4da5-8015-9b76e=\r\n6ce3218 .attach img {    border: none;    padding-right: 5px;  }  #AOLMsgPa=\r\nrt_2_083f8c51-19c3-4da5-8015-9b76e6ce3218 .attach label {    display: block=\r\n;    margin-bottom: 5px;  }  #AOLMsgPart_2_083f8c51-19c3-4da5-8015-9b76e6ce=\r\n3218 .attach label a {    text-decoration: none;  }    #AOLMsgPart_2_083f8c=\r\n51-19c3-4da5-8015-9b76e6ce3218 blockquote {    margin: 0 0 0 4px;  }  #AOLM=\r\nsgPart_2_083f8c51-19c3-4da5-8015-9b76e6ce3218 .bold {    font-family: Arial=\r\n;    font-size: 13px;    font-weight: 700;  }  #AOLMsgPart_2_083f8c51-19c3-=\r\n4da5-8015-9b76e6ce3218 .bold a {    text-decoration: none;  }  #AOLMsgPart_=\r\n2_083f8c51-19c3-4da5-8015-9b76e6ce3218 dd.last p a {    font-family: Verdan=\r\na;    font-weight: 700;  }  #AOLMsgPart_2_083f8c51-19c3-4da5-8015-9b76e6ce3=\r\n218 dd.last p span {    margin-right: 10px;    font-family: Verdana;    fon=\r\nt-weight: 700;  }  #AOLMsgPart_2_083f8c51-19c3-4da5-8015-9b76e6ce3218 dd.la=\r\nst p span.yshortcuts {    margin-right: 0;  }  #AOLMsgPart_2_083f8c51-19c3-=\r\n4da5-8015-9b76e6ce3218 div.attach-table div div a {    text-decoration: non=\r\ne;  }  #AOLMsgPart_2_083f8c51-19c3-4da5-8015-9b76e6ce3218 div.attach-table =\r\n{    width: 400px;  }  #AOLMsgPart_2_083f8c51-19c3-4da5-8015-9b76e6ce3218 d=\r\niv.file-title a,#AOLMsgPart_2_083f8c51-19c3-4da5-8015-9b76e6ce3218  div.fil=\r\ne-title a:active,#AOLMsgPart_2_083f8c51-19c3-4da5-8015-9b76e6ce3218  div.fi=\r\nle-title a:hover,#AOLMsgPart_2_083f8c51-19c3-4da5-8015-9b76e6ce3218  div.fi=\r\nle-title a:visited {    text-decoration: none;  }  #AOLMsgPart_2_083f8c51-1=\r\n9c3-4da5-8015-9b76e6ce3218 div.photo-title a,#AOLMsgPart_2_083f8c51-19c3-4d=\r\na5-8015-9b76e6ce3218  div.photo-title a:active,#AOLMsgPart_2_083f8c51-19c3-=\r\n4da5-8015-9b76e6ce3218  div.photo-title a:hover,#AOLMsgPart_2_083f8c51-19c3=\r\n-4da5-8015-9b76e6ce3218  div.photo-title a:visited {    text-decoration: no=\r\nne;  }  #AOLMsgPart_2_083f8c51-19c3-4da5-8015-9b76e6ce3218 div#ygrp-mlmsg #=\r\nygrp-msg p a span.yshortcuts {    font-family: Verdana;    font-size: 10px;=\r\n    font-weight: normal;  }  #AOLMsgPart_2_083f8c51-19c3-4da5-8015-9b76e6ce=\r\n3218 .green {    color: #628c2a;  }  #AOLMsgPart_2_083f8c51-19c3-4da5-8015-=\r\n9b76e6ce3218 .MsoNormal {    margin: 0 0 0 0;  }  #AOLMsgPart_2_083f8c51-19=\r\nc3-4da5-8015-9b76e6ce3218 o {    font-size: 0;  }  #AOLMsgPart_2_083f8c51-1=\r\n9c3-4da5-8015-9b76e6ce3218 #photos div {    float: left;    width: 72px;  }=\r\n  #AOLMsgPart_2_083f8c51-19c3-4da5-8015-9b76e6ce3218 #photos div div {    b=\r\norder: 1px solid #666666;    height: 62px;    overflow: hidden;    width: 6=\r\n2px;  }  #AOLMsgPart_2_083f8c51-19c3-4da5-8015-9b76e6ce3218 #photos div lab=\r\nel {    color: #666666;    font-size: 10px;    overflow: hidden;    text-al=\r\nign: center;    white-space: nowrap;    width: 64px;  }  #AOLMsgPart_2_083f=\r\n8c51-19c3-4da5-8015-9b76e6ce3218 #reco-category {    font-size: 77%;  }  #A=\r\nOLMsgPart_2_083f8c51-19c3-4da5-8015-9b76e6ce3218 #reco-desc {    font-size:=\r\n 77%;  }  #AOLMsgPart_2_083f8c51-19c3-4da5-8015-9b76e6ce3218 .replbq {    m=\r\nargin: 4px;  }  #AOLMsgPart_2_083f8c51-19c3-4da5-8015-9b76e6ce3218 #ygrp-ac=\r\ntbar div a:first-child {       margin-right: 2px;    padding-right: 5px;  }=\r\n  #AOLMsgPart_2_083f8c51-19c3-4da5-8015-9b76e6ce3218 #ygrp-mlmsg {    font-=\r\nsize: 13px;    font-family: Arial, helvetica,clean, sans-serif;    *font-si=\r\nze: small;    *font: x-small;  }  #AOLMsgPart_2_083f8c51-19c3-4da5-8015-9b7=\r\n6e6ce3218 #ygrp-mlmsg table {    font-size: inherit;    font: 100%;  }  #AO=\r\nLMsgPart_2_083f8c51-19c3-4da5-8015-9b76e6ce3218 #ygrp-mlmsg select,#AOLMsgP=\r\nart_2_083f8c51-19c3-4da5-8015-9b76e6ce3218  input,#AOLMsgPart_2_083f8c51-19=\r\nc3-4da5-8015-9b76e6ce3218  textarea {    font: 99% Arial, Helvetica, clean,=\r\n sans-serif;  }  #AOLMsgPart_2_083f8c51-19c3-4da5-8015-9b76e6ce3218 #ygrp-m=\r\nlmsg pre,#AOLMsgPart_2_083f8c51-19c3-4da5-8015-9b76e6ce3218  code {    font=\r\n:115% monospace;    *font-size:100%;  }  #AOLMsgPart_2_083f8c51-19c3-4da5-8=\r\n015-9b76e6ce3218 #ygrp-mlmsg * {    line-height: 1.22em;  }  #AOLMsgPart_2_=\r\n083f8c51-19c3-4da5-8015-9b76e6ce3218 #ygrp-mlmsg #logo {    padding-bottom:=\r\n 10px;  }  #AOLMsgPart_2_083f8c51-19c3-4da5-8015-9b76e6ce3218 #ygrp-mlmsg a=\r\n {    color: #1E66AE;  }  #AOLMsgPart_2_083f8c51-19c3-4da5-8015-9b76e6ce321=\r\n8 #ygrp-msg p a {    font-family: Verdana;  }  #AOLMsgPart_2_083f8c51-19c3-=\r\n4da5-8015-9b76e6ce3218 #ygrp-msg p#attach-count span {    color: #1E66AE;  =\r\n  font-weight: 700;  }  #AOLMsgPart_2_083f8c51-19c3-4da5-8015-9b76e6ce3218 =\r\n#ygrp-reco #reco-head {    color: #ff7900;    font-weight: 700;  }  #AOLMsg=\r\nPart_2_083f8c51-19c3-4da5-8015-9b76e6ce3218 #ygrp-reco {    margin-bottom: =\r\n20px;    padding: 0px;  }  #AOLMsgPart_2_083f8c51-19c3-4da5-8015-9b76e6ce32=\r\n18 #ygrp-sponsor #ov li a {    font-size: 130%;    text-decoration: none;  =\r\n}  #AOLMsgPart_2_083f8c51-19c3-4da5-8015-9b76e6ce3218 #ygrp-sponsor #ov li =\r\n{    font-size: 77%;    list-style-type: square;    padding: 6px 0;  }   #A=\r\nOLMsgPart_2_083f8c51-19c3-4da5-8015-9b76e6ce3218 #ygrp-sponsor #ov ul {    =\r\nmargin: 0;    padding: 0 0 0 8px;  }  #AOLMsgPart_2_083f8c51-19c3-4da5-8015=\r\n-9b76e6ce3218 #ygrp-text {    font-family: Georgia;  }  #AOLMsgPart_2_083f8=\r\nc51-19c3-4da5-8015-9b76e6ce3218 #ygrp-text p {    margin: 0 0 1em 0;  }  #A=\r\nOLMsgPart_2_083f8c51-19c3-4da5-8015-9b76e6ce3218 #ygrp-text tt {    font-si=\r\nze: 120%;  }  #AOLMsgPart_2_083f8c51-19c3-4da5-8015-9b76e6ce3218 #ygrp-vita=\r\nl ul li:last-child {    border-right: none !important;   }     &lt;/style&gt; &lt;/d=\r\niv&gt;\n  \n\r\n----------MB_8CCF74EF5C519B4_1C40_B9D2_Webmail-m107.sysops.aol.com--"}