{"id": "18203", "subject": "Re: [RTSC] From #78", "author": "Beth", "timestamp": "2010-07-21T21:23:45Z", "full_text": "I saw a clip on youtube where a ghost box group was asking who the anitchrist was.  Of course their first question was if it was Obama.  the answer was no.  So then they asked who it was, and the box said it was Sarah Palin!  Lol, now I know... the spirits are all people from the left!\n\nBeth\n\nPS- I love Sarah!  At this point, I would vote for her in a second!\n\n--- In EVP-ITC@yahoogroups.com, SnowfireL@... wrote:\n&gt;\n&gt;  Well, ya know Beth, he has broke many promises, as they all do once they get into office, look at how he has &quot;brought them all home&quot;  lol, he is sending more and more into other country&#39;s, maybe, he is like a puppet for higher ups, it&#39;s a scary situation, David has mention the antichrist on more then one occasion, he has moved from Spain to Rome latey, and will start up soon, making people really like him at first, then after someone here, could be a president, not going to say who, starts a war between several big country&#39;s.  The US will be so weak from all the wasted life of those young people going into middle east and places, (they should be getting married, buying homes, and making baby&#39;s right now, not dying).  It&#39;s a situation \n&gt; similar to Viet Nam, we lost a whole generation just right there, and what did we win?  \n&gt; \n&gt; Only about oil control, thing is the US may not follow the antichrist cause, but we are going to be so darn weak, that we will be fighting each other just to survive from what he says, he mentioned several countrys that will not follow antichrist, which are: US, Australia, Canada, UK, Russia, or China, thing is we may be enticed into fighting these other country&#39;s which will only serve to weaken US more.  The antichrist won&#39;t get Canada because they will bring him trouble, for some reason, maybe, when he thinks he&#39;ll get those stubborn limies.  Believe me, I hope nothing like this happens, but we are moving toward much of it right now, and it&#39;s scary. sf\n&gt; \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; -----Original Message-----\n&gt; From: Beth bmcduffie59@...\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Wed, Jul 21, 2010 1:00 pm\n&gt; Subject: [EVP-ITC] Re: [RTSC] From #78\n&gt; \n&gt;                                              Well, I for one, hope David is right about Obama leaving office.  Of course, that would mean Joe Biden would be president... sigh.  That isn&#39;t a happy thought either.\n&gt;  \n&gt;  I hope there is not another war.  I just heard somewhere of secret plans to attack Iran.  Lol, if I heard about it, it must not be very secret.\n&gt;  \n&gt;  Beth\n&gt;  \n&gt;  --- In EVP-ITC@yahoogroups.com, SnowfireL@ wrote:\n&gt;  &gt;\n&gt;  &gt;  I think there may be another earth quake, yikes!Â Â  And in march Obama is supposed to leave office, just after we are drawn into another bigger war, double yikes!!\n&gt;  &gt; \n&gt;  &gt;  Don&#39;t know what after that, whole thing is scary, he was going to bring back the troops, ya right!Â  &quot;liar, liar, pants on fire.&quot;\n&gt;  &gt; \n&gt;  &gt; As the Tech, David might say; &quot;oh well,&quot;Â  sometimes his expression is; &quot;for the last time&quot; or &quot;i really don&#39;t wanna talk about it.&quot; sf\n&gt;  &gt; \n&gt;  &gt; \n&gt;  &gt; ----Original Message-----\n&gt;  &gt; From: Frank Sumption purplealiengirl@\n&gt;  &gt; To: evp-itc@yahoogroups.com; RTSC@yahoogroups.com\n&gt;  &gt; Sent: Wed, Jul 21, 2010 2:58 am\n&gt;  &gt; Subject: [RTSC] From #78 [1 Attachment]\n&gt;  &gt; \n&gt;  &gt;           Â                                             [Attachment(s) from Frank Sumption included below]                       \n&gt;  &gt; Just the usual.\n&gt;  &gt;  Â \n&gt;  &gt;  Â F-S\n&gt;  &gt;\n&gt;"}