{"id": "18277", "subject": "Re: [EVP-ITC] AiWA picture,", "author": "Frank Sumption", "timestamp": "2010-07-26T07:23:43Z", "full_text": "Well, easy if you know what you&#39;re looking for. You have to find the tuning\nvoltage line coming form the processor, then cut it and insert your own\ntuning voltage. I didn&#39;t even know about the mute function when I did these,\nI use a different conversion method.\n\n I have an older, made in 1998 Radio Shack home stereo that I got out of the\ntrash at work, that had the service manual wiht it, so I found the mute\ncircuit and removed the two transistors to make it sweep. Then added a push\nbutton so the tuning button doesn&#39;t have to be held in. Push the button in\nand instant GB mode. That one collects duct too, but it&#39;s heavy.\n\n F-S\n\nOn Mon, Jul 26, 2010 at 12:58 AM, &lt;SnowfireL@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Was it easy to hack?  How is it as a ghost box?  I would like to do this\n&gt; one, since everything still works great, and it has those two big speakers,\n&gt; I don&#39;t go anywhere to need portable, and I have these others if i did, how\n&gt; does yours sound for ghosts?  Where is the mute wire in it?  Is there a\n&gt; symbol for the mute?  And which board is it on, there seem to be a few\n&gt; boards in this one. Thanks, s\n&gt;\n&gt;\n&gt; -----Original Message-----\n&gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Mon, Jul 26, 2010 2:41 am\n&gt; Subject: Re: [EVP-ITC] AiWA picture,\n&gt;\n&gt;\n&gt;    Goofy google won&#39;t show the pix,  but I have an Aiwa 3 cd system that&#39;s\n&gt; converted to a ghost box. It&#39;s a home stereo system so not at all portable.\n&gt;\n&gt;  F-S\n&gt;\n&gt;  On Sun, Jul 25, 2010 at 11:23 AM, &lt;SnowfireL@...&gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;   is one, mine is a NX CX 202 whatever that is, plus mine has two big\n&gt;&gt; speakers, will speakers dry, they may be ok, on the inside.  Don&#39;t know\n&gt;&gt; until I can get a new electrical cord for the player, it use to work great,\n&gt;&gt; even the CD player worked, is it hard to replace an electric cord?  Thanks,\n&gt;&gt; sf\n&gt;&gt;\n&gt;\n&gt;   \n&gt;\n\nWell, easy i you know wha you' e looking o . You ha e o ind he uning ol age line coming o m he p ocesso , hen cu i and inse you own uning ol age. I didn' e en know abou   he mu e unc ion when I did hese, I use a di e en con e sion me hod. \n\n \n I ha e an olde , made in 1998 Radio Shack home s e eo ha  I go ou o he ash a wo k, ha had he se ice manual wih i , so I ound he mu e ci cui and emo ed he wo ansis o s o make i sweep. Then added a push bu on so he uning bu on doesn' ha e o be held in. Push he bu on in and ins an GB mode. Tha one collec s duc oo, bu i 's hea y.  \n\n \n F-S\nOn Mon, Jul 26, 2010 a 12:58 AM, Snow i eL@...> w o e:\n\n  \n\n\n\n\nWas i easy o hack?  How is i as a ghos box?  I would like o do his one, since e e y hing s ill wo ks g ea , and i has hose wo big speake s, I don' go anywhe e o need po able, and I ha e hese o he s i i did, how does you s sound o ghos s?  Whe e is he mu e wi e in i ?  Is he e a symbol o he mu e?  And which boa d is i on, he e seem o be a ew boa ds in his one. Thanks, s\n\n\n\n-----O iginal Message-----F om: F ank Sump ion pu plealiengi l@...>To: EVP-ITC@yahoog oups.com\nSen : Mon, Jul 26, 2010 2:41 amSubjec : Re: [EVP-ITC] AiWA pic u e,\n\n  \n\n\n\n\n\n Goo y google won' show he pix,  bu I ha e an Aiwa 3 cd sys em ha 's con e ed o a ghos box. I 's a home s e eo sys em so no a all po able. \n \n F-S\n\nOn Sun, Jul 25, 2010 a 11:23 AM, Snow i eL@...> w o e:\n\n\n\n\n\n\nis one, mine is a NX CX 202 wha e e ha is, plus mine has wo big speake s, will speake s d y, hey may be ok, on he inside.  Don' know un il I can ge a new elec ical co d o he playe , i use o wo k g ea , e en he CD playe wo ked, is i ha d o eplace an elec ic co d?  Thanks, s"}