{"id": "18287", "subject": "Re: [EVP-ITC] Re: Science vs. Ghost Box Technology", "author": "Frank Sumption", "timestamp": "2010-07-26T20:01:03Z", "full_text": "They have no facts, and can not test the devices themselves, that leaves\nname calling and chidish behavior. I just ignore it--for now.\n\nF-S\n\nOn Mon, Jul 26, 2010 at 5:07 AM, Urkel23 &lt;urkel23@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Also, if you listen to that podcast you will hear some very specific\n&gt; protocols that these science minded folks display. Like giggling like school\n&gt; girls while attacking a person that neither of them know. And, my favorite\n&gt; in the show:\n&gt;\n&gt; Dr Rorke calling me a douce bag at around 20 minutes in. This is who is\n&gt; representing the field of scientific research.\n&gt;\n&gt; -Steve H.\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Frank Sumption\n&gt; &lt;purplealiengirl@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; That&#39;s the rub, a cure for cancer would put many thousands out of\n&gt; &gt; work--there will be no cure, too much $$$ in research and toxic\n&gt; treatments\n&gt; &gt; that kill more than the desease. Science in this county is a joke! You\n&gt; can\n&gt; &gt; fund a study to verify whatever results you are willing to pay for.\n&gt; &gt;\n&gt; &gt; Frank-s\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; On Sun, Jul 25, 2010 at 8:37 PM, &lt;urkel23@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; Been thinking and decided that we are not wrong in our beliefs. If we\n&gt; can\n&gt; &gt; &gt; help find a missing child as so many do with $30 shack hacks, than\n&gt; where is\n&gt; &gt; &gt; the harm and the threat.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Science spends billions of dollars each and every year to find a cure\n&gt; for\n&gt; &gt; &gt; cancer with no results. I&#39;m talking about a $30 radio that may help and\n&gt; &gt; &gt; has. Seems like we have the upper hand in the matter. Just because our\n&gt; &gt; &gt; methods are not accepted as the norm, does that mean that it serves no\n&gt; &gt; &gt; purpose.\n&gt; &gt; &gt;\n&gt; &gt; &gt; If society spent billions of dollars on ghost box research every year,\n&gt; we\n&gt; &gt; &gt; wouldn&#39;t even be having a conversation.\n&gt; &gt; &gt;\n&gt; &gt; &gt; p.s.---- Modern science has found a cure for cancer, they just can&#39;t\n&gt; reveal\n&gt; &gt; &gt; it because they are making a fortune off of treatments.\n&gt; &gt; &gt;\n&gt; &gt; &gt; p.s.s.----Thanx RJ for posting that link for that show.....Why are you\n&gt; here\n&gt; &gt; &gt; anyway?\n&gt; &gt; &gt;\n&gt; &gt; &gt; -Steve H.\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; *Steve Hultay\n&gt; &gt; &gt; *www.keyportparanormal.com*\n&gt; &gt; &gt; http://tech.groups.yahoo.com/group/rtsc/\n&gt; &gt; &gt; www.stevehultay.com\n&gt; &gt; &gt; www.rtscresearch.org*\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nThey ha e no ac s, and can no es he de ices hemsel es, ha lea es name calling and chidish beha io . I jus igno e i -- o now. \n \nF-S\nOn Mon, Jul 26, 2010 a 5:07 AM, U kel23 u kel23@...> w o e:\n\n  \n\n\n\nAlso, i you lis en o ha podcas you will hea some e y speci ic p o ocols ha hese science minded olks display. Like giggling like school gi ls while a acking a pe son ha nei he o hem know. And, my a o i e in he show:\nD Ro ke calling me a douce bag a a ound 20 minu es in. This is who is ep esen ing he ield o scien i ic esea ch.-S e e H. \n--- In EVP-ITC@yahoog oups.com, F ank Sump ion w o e:>> Tha 's he ub, a cu e o cance would pu many housands ou o \n> wo k-- he e will be no cu e, oo much $$$ in esea ch and oxic ea men s> ha kill mo e han he desease. Science in his coun y is a joke! You can> und a s udy o e i y wha e e esul s you a e willing o pay o .\n> > F ank-s> > > \n> On Sun, Jul 25, 2010 a 8:37 PM, w o e:> > >> >> >> > Been hinking and decided ha we a e no w ong in ou belie s. I we can> > help ind a missing child as so many do wi h $30 shack hacks, han whe e is\n> > he ha m and he h ea .> >> > Science spends billions o dolla s each and e e y yea o ind a cu e o > > cance wi h no esul s. I'm alking abou a $30 adio ha may help and\n> > has. Seems like we ha e he uppe hand in he ma e . Jus because ou > > me hods a e no accep ed as he no m, does ha mean ha i se es no> > pu pose.> >> > I socie y spen billions o dolla s on ghos box esea ch e e y yea , we\n> > wouldn' e en be ha ing a con e sa ion.> >> > p.s.---- Mode n science has ound a cu e o cance , hey jus can' e eal> > i because hey a e making a o une o o ea men s.\n> >> > p.s.s.----Thanx RJ o pos ing ha link o ha show.....Why a e you he e> > anyway?> >> > -S e e H.> >> >> >> > *S e e Hul ay\n> > *www.keypo pa ano mal.com*> > h p:// ech.g oups.yahoo.com/g oup/ sc/\n> > www.s e ehul ay.com> > www. sc esea ch.o g*> >> > > >\n>"}