{"id": "18295", "subject": "Re: [EVP-ITC] Re: Science vs. Ghost Box Technology", "author": "Frank Sumption", "timestamp": "2010-07-26T23:06:07Z", "full_text": "I think it&#39;s time to just ignore the bozo&#39;s ourselves before this stuff\nescalates any further.\n\n F-S\nOn Mon, Jul 26, 2010 at 5:02 PM, Ursula Kalin &lt;kalinu@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;  I&#39;m sorry who are you? I don&#39;t understand what you are talking\n&gt; about...why can&#39;t you go over this with a &quot;fine toothe comb&quot;. Are you going\n&gt; to tell me people are getting radio waves or cb or some crap like that? I\n&gt; hope not...and i don&#39;t know how anyone can we people including myself get\n&gt; personal messages regarding there family and children names etc..Please\n&gt; explain to me how can you dispute that? Not only do i and others get detail\n&gt; infomation regarding things that Know one would know...but they also tell\n&gt; you where you are in the house and say what your doing at the time...NOW\n&gt; what do you need to belive this?\n&gt;\n&gt;  ------------------------------\n&gt; *From:* Matt &lt;elvymir@...&gt;\n&gt;\n&gt; *To:* EVP-ITC@yahoogroups.com\n&gt; *Sent:* Mon, July 26, 2010 3:01:25 PM\n&gt;\n&gt; *Subject:* [EVP-ITC] Re: Science vs. Ghost Box Technology\n&gt;\n&gt;\n&gt;\n&gt; Is this not a scientific feild? Especially a young one? From read these\n&gt; emails it seems all this is, is a lot of he/she said crap. The matter\n&gt; remains (regardless of beliefs) these boxes hold no concrete proof of\n&gt; paranormal. Just because one or two things happen doesnt make it indefinetly\n&gt; perfect. I mean i have faith in them but science teaches us to go over\n&gt; things with a fine tooth comb and you cant with these. That is the point,\n&gt; regardless of beliefs minimal evidence.\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, SnowfireL@...\n&gt; wrote:\n&gt; &gt;\n&gt; &gt; Have an idea, we will go to bat for you and Frank, Steve, don&#39;t be\n&gt; afraid, at least talk to an attorney, they won&#39;t charge you a thing at least\n&gt; for a first consultation, let them know, you and Frank have witnesses, this\n&gt; will damage your reps. Curtis is right this could hang on the net for many\n&gt; years what they said, I have sites from years ago, for my paralegal business\n&gt; from 10 years ago, i have no idea how to even take the thing down anymore, I\n&gt; would go for it, Steve, don&#39;t even talk to them, the lawyer will tell you\n&gt; not to have any conversation with those people, otherwise it could\n&gt; jeopardize when you go to court. sf\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; -----Original Message-----\n&gt; &gt; From: Urkel23 urkel23@...\n&gt; &gt; To: EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;\n&gt; &gt; Sent: Mon, Jul 26, 2010 2:19 pm\n&gt; &gt; Subject: [EVP-ITC] Re: Science vs. Ghost Box Technology\n&gt; &gt;\n&gt; &gt; Â  Also, if you listen to that podcast you will hear some very specific\n&gt; protocols that these science minded folks display. Like giggling like school\n&gt; girls while attacking a person that neither of them know. And, my favorite\n&gt; in the show:\n&gt; &gt;\n&gt; &gt; Dr Rorke calling me a douce bag at around 20 minutes in. This is who is\n&gt; representing the field of scientific research.\n&gt; &gt;\n&gt; &gt; -Steve H.\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Frank\n&gt; Sumption purplealiengirl@ wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; That&#39;s the rub, a cure for cancer would put many thousands out of\n&gt; &gt; &gt; work--there will be no cure, too much $$$ in research and toxic\n&gt; treatments\n&gt; &gt; &gt; that kill more than the desease. Science in this county is a joke!\n&gt; You can\n&gt; &gt; &gt; fund a study to verify whatever results you are willing to pay for.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Frank-s\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; On Sun, Jul 25, 2010 at 8:37 PM, urkel23@ wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Been thinking and decided that we are not wrong in our beliefs.\n&gt; If we can\n&gt; &gt; &gt; &gt; help find a missing child as so many do with $30 shack hacks,\n&gt; than where is\n&gt; &gt; &gt; &gt; the harm and the threat.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Science spends billions of dollars each and every year to find\n&gt; a cure for\n&gt; &gt; &gt; &gt; cancer with no results. I&#39;m talking about a $30 radio that may\n&gt; help and\n&gt; &gt; &gt; &gt; has. Seems like we have the upper hand in the matter. Just\n&gt; because our\n&gt; &gt; &gt; &gt; methods are not accepted as the norm, does that mean that it\n&gt; serves no\n&gt; &gt; &gt; &gt; purp.s..\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; If society spent billions of dollars on ghost box research\n&gt; every year, we\n&gt; &gt; &gt; &gt; wouldn&#39;t even be having a conversation.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; p.s.---- Modern science has found a cure for cancer, they just\n&gt; can&#39;t reveal\n&gt; &gt; &gt; &gt; it because they are making a fortune off of treatments.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; p.s.s.----Thanx RJ for p.s.ing that link for that show.....Why\n&gt; are you here\n&gt; &gt; &gt; &gt; anyway?\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; -Steve H.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; *Steve Hultay\n&gt; &gt; &gt; &gt; *www.keyportparanormal.com*\n&gt; &gt; &gt; &gt; http://tech.groups.yahoo.com/group/rtsc/\n&gt; &gt; &gt; &gt; www.stevehultay.com\n&gt; &gt; &gt; &gt; www.rtscresearch.org*\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nI hink i 's ime o jus igno e he bozo's ou sel es be o e his s u escala es any u he .\n \n F-S\nOn Mon, Jul 26, 2010 a 5:02 PM, U sula Kalin kalinu@sbcglobal.ne > w o e:\n\n  \n\n\n\n\n\nI'm so y who a e you? I don' unde s and wha you a e alking abou ...why can' you go o e his wi h a \" ine oo he comb\". A e you going o ell me people a e ge ing adio wa es o cb o some c ap like ha ? I hope no ...and i don' know how anyone can we people including mysel ge pe sonal messages ega ding he e amily and child en names e c..Please explain o me how can you dispu e ha ? No only do i and o he s ge de ail in oma ion ega ding hings ha Know one would know...bu hey also ell you whe e you a e in he house and say wha you doing a he ime...NOW wha do you need o beli e his?\n\n\n\n\nF om: Ma el ymi @...> \nTo: EVP-ITC@yahoog oups.comSen : Mon, July 26, 2010 3:01:25 PM \n\n\nSubjec : [EVP-ITC] Re: Science s. Ghos Box Technology\n\n\n  \n\nIs his no a scien i ic eild? Especially a young one? F om ead hese emails i seems all his is, is a lo o he/she said c ap. The ma e emains ( ega dless o belie s) hese boxes hold no conc e e p oo o pa ano mal. Jus because one o wo hings happen doesn make i inde ine ly pe ec . I mean i ha e ai h in hem bu science eaches us o go o e hings wi h a ine oo h comb and you can wi h hese. Tha is he poin , ega dless o belie s minimal e idence.\n--- In EVP-ITC@yahoog oups.com, Snow i eL@... w o e:>> Ha e an idea, we will go o ba o you and F ank, S e e, don' be a aid, a leas alk o an a o ney, hey won' cha ge you a hing a leas o a i s consul a ion, le hem know, you and F ank ha e wi nesses, his will damage you eps. Cu is is igh his could hang on he ne o many yea s wha hey said, I ha e si es om yea s ago, o my pa alegal business om 10 yea s ago, i ha e no idea how o e en ake he hing down anymo e, I would go o i , S e e, don' e en alk o hem, he lawye will ell you no o ha e any con e sa ion wi h hose people, o he wise i could jeopa dize when you go o cou . s \n> > > > > > -----O iginal Message-----> F om: U kel23 u kel23@...> To: EVP-ITC@yahoog oups.com\n> Sen : Mon, Jul 26, 2010 2:19 pm> Subjec : [EVP-ITC] Re: Science s. Ghos Box Technology> > Â  Also, i you lis en o ha podcas you will hea some e y speci ic p o ocols ha hese science minded olks display. Like giggling like school gi ls while a acking a pe son ha nei he o hem know. And, my a o i e in he show:\n> > D Ro ke calling me a douce bag a a ound 20 minu es in. This is who is ep esen ing he ield o scien i ic esea ch.> > -S e e H.> > --- In EVP-ITC@yahoog oups.com, F ank Sump ion pu plealiengi l@ w o e:\n> &g ;> &g ; Tha 's he ub, a cu e o cance would pu many housands ou o > &g ; wo k-- he e will be no cu e, oo much $$$ in esea ch and oxic ea men s> &g ; ha kill mo e han he desease. Science in his coun y is a joke! You can\n> &g ; und a s udy o e i y wha e e esul s you a e willing o pay o .> &g ; > &g ; F ank-s> &g ; > &g ; > &g ; > &g ; On Sun, Jul 25, 2010 a 8:37 PM, u kel23@ w o e:\n> &g ; > &g ; &g ;> &g ; &g ;> &g ; &g ;> &g ; &g ; Been hinking and decided ha we a e no w ong in ou belie s. I we can> &g ; &g ; help ind a missing child as so many do wi h $30 shack hacks, han whe e is\n> &g ; &g ; he ha m and he h ea .> &g ; &g ;> &g ; &g ; Science spends billions o dolla s each and e e y yea o ind a cu e o > &g ; &g ; cance wi h no esul s. I'm alking abou a $30 adio ha may help and\n> &g ; &g ; has. Seems like we ha e he uppe hand in he ma e . Jus because ou > &g ; &g ; me hods a e no accep ed as he no m, does ha mean ha i se es no> &g ; &g ; pu p.s..\n> &g ; &g ;> &g ; &g ; I socie y spen billions o dolla s on ghos box esea ch e e y yea , we> &g ; &g ; wouldn' e en be ha ing a con e sa ion.> &g ; &g ;\n> &g ; &g ; p.s.---- Mode n science has ound a cu e o cance , hey jus can' e eal> &g ; &g ; i because hey a e making a o une o o ea men s.> &g ; &g ;> &g ; &g ; p.s.s.----Thanx RJ o p.s.ing ha link o ha show.....Why a e you he e\n> &g ; &g ; anyway?> &g ; &g ;> &g ; &g ; -S e e H.> &g ; &g ;> &g ; &g ;> &g ; &g ;> &g ; &g ; *S e e Hul ay> &g ; &g ; *www.keypo pa ano mal.com*\n> &g ; &g ; h p:// ech.g oups.yahoo.com/g oup/ sc/> &g ; &g ; www.s e ehul ay.com\n> &g ; &g ; www. sc esea ch.o g*> &g ; &g ;> &g ; &g ; > &g ; &g ;> &g ;>"}