{"id": "18305", "subject": "Re: Science vs. Ghost Box Technology", "author": "draiga1", "timestamp": "2010-07-26T16:02:03Z", "full_text": "Steve, \n\nIf we didn&#39;t see real results with the ghost boxes, this forum wouldn&#39;t even exist. The boxes even address you by name! As well as Frank and Bruce. Other people have heard their names as well. And to top it off, the boxes give accurate information. When I&#39;m not certain on a given day whether I am actually getting communication, I will ask them what color shirt I&#39;m wearing at the time. The answer is always correct. That&#39;s proof to me.\n\nYeah, isn&#39;t it a shame that illness has become nothing more than big business? \n\n~Draiga\n\n--- In EVP-ITC@yahoogroups.com, urkel23@... wrote:\n&gt;\n&gt; \n&gt; Been thinking and decided that we are not wrong in our beliefs.  If we  can \n&gt; help find a missing child as so many do with $30 shack hacks, than where is \n&gt;  the harm and the threat.\n&gt;  \n&gt; Science spends billions of dollars each and every year to find a cure for  \n&gt; cancer with no results.  I&#39;m talking about a $30 radio that may help and  \n&gt; has.  Seems like we have the upper hand in the matter.  Just because  our \n&gt; methods are not accepted as the norm, does that mean that it serves no  purpose.\n&gt;  \n&gt; If society spent billions of dollars on ghost box research every year, we  \n&gt; wouldn&#39;t even be having a conversation.\n&gt;  \n&gt; p.s.---- Modern science has found a cure for cancer, they just can&#39;t reveal \n&gt;  it because they are making a fortune off of treatments.\n&gt;  \n&gt; p.s.s.----Thanx RJ for posting that link for that show.....Why are you here \n&gt;  anyway?\n&gt;  \n&gt; -Steve H.\n&gt;  \n&gt;  \n&gt;  \n&gt; Steve Hultay\n&gt; _www.keyportparanormal.com_ (http://www.keyportparanormal.com/) \n&gt; _http://tech.groups.yahoo.com/group/rtsc/_ \n&gt; (http://tech.groups.yahoo.com/group/rtsc/) \n&gt; _www.stevehultay.com_ (http://www.stevehultay.com/) \n&gt; _www.rtscresearch.org_ (http://www.rtscresearch.org/)\n&gt;"}