{"id": "18325", "subject": "Re: [EVP-ITC] Re: depressing,", "author": "Zack Widup", "timestamp": "2010-07-27T17:16:10Z", "full_text": "I make a separate folder for each set of files, e.g. &quot;Greenwood Cemetery\n5-12-07&quot; and then put the files in the folder with numbers, e.g. &quot;001.mp3&quot;\nor &quot;DSC0001.jpg&quot;. That way, the files do not have any distinctive name but\nthey are all organized.\nZack\n\n\nOn Tue, Jul 27, 2010 at 10:30 AM, &lt;SnowfireL@aol.com&gt; wrote:\n\n&gt;\n&gt;\n&gt;\n&gt; I could, but it&#39;s hard to keep track, i have hundreds of files on my pc,\n&gt; and I have to write it down, i want to see if anyone else is able to hear\n&gt; these few, I have other&#39;s on this child too, with my voice, and his name and\n&gt; stuff, but i didn&#39;t want to post them, i hope he is found alive.  Spirit\n&gt; say, he is over there in rest plane, with other spirit children, i guess he\n&gt; is now in the spiritual baby land.  sf\n&gt;\n&gt; -----Original Message-----\n&gt; From: Rj &lt;rasterer@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt;  Sent: Tue, Jul 27, 2010 11:26 am\n&gt; Subject: Re: [EVP-ITC] Re: depressing,\n&gt;\n&gt;\n&gt;    When you label the files with what you heard, you influence the\n&gt; listener to try to hear what you heard, rather than what they hear with no\n&gt; hints.  So if you want to know what people really hear without your hints,\n&gt; you need to send them out unlabeled.\n&gt;\n&gt;\n&gt; --- On *Tue, 7/27/10, SnowfireL@... &lt;SnowfireL@...&gt;* wrote:\n&gt;\n&gt;\n&gt; From: SnowfireL@... &lt;SnowfireL@...&gt;\n&gt; Subject: Re: [EVP-ITC] Re: depressing,\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Tuesday, July 27, 2010, 8:16 AM\n&gt;\n&gt;\n&gt;  Are you able to hear those few files I sent to the list?\n&gt;\n&gt;\n&gt; -----Original Message-----\n&gt; From: Rj &lt;rasterer@yahoo. com&gt;\n&gt; To: EVP-ITC@yahoogroups .com\n&gt; Sent: Tue, Jul 27, 2010 10:54 am\n&gt; Subject: Re: [EVP-ITC] Re: depressing,\n&gt;\n&gt;\n&gt;\n&gt; If there is a chance you might be able to stop this Morgan person from\n&gt; hurting another child, you must call now.   Waiting so that you don&#39;t look\n&gt; wrong or silly is not the priority here: there are more important things on\n&gt; the line than personal ego (I hope).\n&gt;\n&gt;\n&gt;\n&gt; --- On *Tue, 7/27/10, SnowfireL@aol. com &lt;SnowfireL@aol. com&gt;* wrote:\n&gt;\n&gt;\n&gt; From: SnowfireL@aol. com &lt;SnowfireL@aol. com&gt;\n&gt; Subject: Re: [EVP-ITC] Re: depressing,\n&gt; To: EVP-ITC@yahoogroups .com\n&gt; Date: Tuesday, July 27, 2010, 7:38 AM\n&gt;\n&gt;\n&gt;  No, and no, this is a younger child, recently missing, I have not called\n&gt; yet, I want to see if anyone can hear what I am hearing yet before I let\n&gt; them know.  I got names, and the little guy, I think said &quot;hi&quot; to me.  At\n&gt; this point no one else is able to hear my files, so I won&#39;t do a thing until\n&gt; i get validation from the so-called living first. sf\n&gt;\n&gt;\n&gt; -----Original Message-----\n&gt; From: rasterer &lt;rasterer@yahoo. com&gt;\n&gt; To: EVP-ITC@yahoogroups .com\n&gt; Sent: Tue, Jul 27, 2010 9:34 am\n&gt; Subject: [EVP-ITC] Re: depressing,\n&gt;\n&gt;\n&gt;  Do you mean the missing 7-year-old Oregon boy named Kyron Horman?\n&gt;\n&gt; Have you told the police that Morgan has him? Have you told them what you\n&gt; know?\n&gt;\n&gt; --- In EVP-ITC@yahoogroups .com, SnowfireL@.. . wrote:\n&gt; &gt;\n&gt; &gt; These are files concerning a recent missing child, I will not say whom,\n&gt; but\n&gt; &gt; it is on file, sad to hear. sf\n&gt; &gt;\n&gt;\n&gt;\n&gt;\n&gt;  \n&gt;\n\nI make a sepa a e olde o each se o iles, e.g. \"G eenwood Ceme e y 5-12-07\" and hen pu he iles in he olde wi h numbe s, e.g. \"001.mp3\" o \"DSC0001.jpg\". Tha way, he iles do no ha e any dis inc i e name bu hey a e all o ganized.\n\nZack\n \nOn Tue, Jul 27, 2010 a 10:30 AM, Snow i eL@...> w o e:\n\n  \n\n\n\n\n\nI could, bu i 's ha d o keep ack, i ha e hund eds o iles on my pc, and I ha e o w i e i down, i wan o see i anyone else is able o hea hese ew, I ha e o he 's on his child oo, wi h my oice, and his name and s u , bu i didn' wan o pos hem, i hope he is ound ali e.  Spi i say, he is o e he e in es plane, wi h o he spi i child en, i guess he is now in he spi i ual baby land.  s \n\n\n-----O iginal Message-----F om: Rj as e e @...>To: EVP-ITC@yahoog oups.com\n\n\n\nSen : Tue, Jul 27, 2010 11:26 amSubjec : Re: [EVP-ITC] Re: dep essing,\n\n  \n\n\n\n\n\n\n\nWhen you label he iles wi h wha you hea d, you in luence he lis ene o y o hea wha you hea d, a he han wha hey hea wi h no hin s.  So i you wan o know wha people eally hea wi hou you hin s, you need o send hem ou unlabeled.\n--- On Tue, 7/27/10, Snow i eL@... Snow i eL@...> w o e:\nF om: Snow i eL@... Snow i eL@aol.com>\nSubjec : Re: [EVP-ITC] Re: dep essing,To: EVP-ITC@yahoog oups.comDa e: Tuesday, July 27, 2010, 8:16 AM\n  \n\n\nA e you able o hea hose ew iles I sen o he lis ?\n\n-----O iginal Message-----F om: Rj To: EVP-ITC@yahoog oups .comSen : Tue, Jul 27, 2010 10:54 amSubjec : Re: [EVP-ITC] Re: dep essing,\n\n  \n\n\n\n\n\n\n\nI he e is a chance you migh be able o s op his Mo gan pe son om hu ing ano he child, you mus call now.   Wai ing so ha you don' look w ong o silly is no he p io i y he e: he e a e mo e impo an hings on he line han pe sonal ego (I hope).\n--- On Tue, 7/27/10, Snow i eL@aol. com w o e:\nF om: Snow i eL@aol. com Subjec : Re: [EVP-ITC] Re: dep essing,To: EVP-ITC@yahoog oups .comDa e: Tuesday, July 27, 2010, 7:38 AM\n\n  \n\n\nNo, and no, his is a younge child, ecen ly missing, I ha e no called ye , I wan o see i anyone can hea wha I am hea ing ye be o e I le hem know.  I go names, and he li le guy, I hink said \"hi\" o me.  A his poin no one else is able o hea my iles, so I won' do a hing un il i ge alida ion om he so-called li ing i s . s \n\n\n-----O iginal Message-----F om: as e e To: EVP-ITC@yahoog oups .comSen : Tue, Jul 27, 2010 9:34 amSubjec : [EVP-ITC] Re: dep essing,\n\n  \n\n\n\nDo you mean he missing 7-yea -old O egon boy named Ky on Ho man?Ha e you old he police ha Mo gan has him? Ha e you old hem wha you know? --- In EVP-ITC@yahoog oups .com, Snow i eL@.. . w o e:\n>> These a e iles conce ning a ecen missing child, I will no say whom, bu > i is on ile, sad o hea . s >"}