{"id": "18378", "subject": "Re: Science vs. Ghost Box Technology", "author": "Beth", "timestamp": "2010-07-27T22:38:19Z", "full_text": "I listened to the podcast and I have to say those men were very unprofessional.  All they did was laugh, which showed to me, that they had no real way of disproving it either.  I am not sure why they chose to belittle the attempts we are making unless, for some reason, it is a threat to them.\n\nThey may not be impressed with us, but neither am I impressed with them.  If they were serious about finding out what this really is, they should have had Steve and Frank on the show so they could tell their thoughts on the subject.\n\nBeth\n\n--- In EVP-ITC@yahoogroups.com, SnowfireL@... wrote:\n&gt;\n&gt;  They are a mockery, I tried to listen to what they said, and every word makes me sick, my mother comes through over that box, I know her voice, my sister comes through too.  These people make me want to puke, i don&#39;t usually hate people, and I got to count to ten right now over the stupid comments out of their voices, sf  \n&gt; \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; -----Original Message-----\n&gt; From: Frank Sumption purplealiengirl@...\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Mon, Jul 26, 2010 4:02 pm\n&gt; Subject: Re: [EVP-ITC] Re: Science vs. Ghost Box Technology\n&gt; \n&gt;                                              \n&gt;  They have no facts, and can not test the devices themselves, that leaves name calling and chidish behavior. I just ignore it--for now. \n&gt;   \n&gt;  F-S\n&gt; \n&gt; \n&gt;  On Mon, Jul 26, 2010 at 5:07 AM, Urkel23 urkel23@... wrote:\n&gt;         Also, if you listen to that podcast you will hear some very specific protocols that these science minded folks display. Like giggling like school girls while attacking a person that neither of them know. And, my favorite in the show:\n&gt;  \n&gt; Dr Rorke calling me a douce bag at around 20 minutes in. This is who is representing the field of scientific research.\n&gt; \n&gt; -Steve H.  \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Frank Sumption purplealiengirl@ wrote:\n&gt; &gt;\n&gt; &gt; That&#39;s the rub, a cure for cancer would put many thousands out of\n&gt;  &gt; work--there will be no cure, too much $$$ in research and toxic treatments\n&gt; &gt; that kill more than the desease. Science in this county is a joke! You can\n&gt; &gt; fund a study to verify whatever results you are willing to pay for.\n&gt;  &gt; \n&gt; &gt; Frank-s\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; \n&gt;  &gt; On Sun, Jul 25, 2010 at 8:37 PM, urkel23@ wrote:\n&gt; &gt; \n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; Been thinking and decided that we are not wrong in our beliefs. If we can\n&gt; &gt; &gt; help find a missing child as so many do with $30 shack hacks, than where is\n&gt;  &gt; &gt; the harm and the threat.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Science spends billions of dollars each and every year to find a cure for\n&gt; &gt; &gt; cancer with no results. I&#39;m talking about a $30 radio that may help and\n&gt;  &gt; &gt; has. Seems like we have the upper hand in the matter. Just because our\n&gt; &gt; &gt; methods are not accepted as the norm, does that mean that it serves no\n&gt; &gt; &gt; purp.s..\n&gt; &gt; &gt;\n&gt; &gt; &gt; If society spent billions of dollars on ghost box research every year, we\n&gt;  &gt; &gt; wouldn&#39;t even be having a conversation.\n&gt; &gt; &gt;\n&gt; &gt; &gt; p.s.---- Modern science has found a cure for cancer, they just can&#39;t reveal\n&gt; &gt; &gt; it because they are making a fortune off of treatments.\n&gt;  &gt; &gt;\n&gt; &gt; &gt; p.s.s.----Thanx RJ for p.s.ing that link for that show.....Why are you here\n&gt; &gt; &gt; anyway?\n&gt; &gt; &gt;\n&gt; &gt; &gt; -Steve H.\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; *Steve Hultay\n&gt;  &gt; &gt; *www.keyportparanormal.com*\n&gt; &gt; &gt; http://tech.groups.yahoo.com/group/rtsc/\n&gt;  &gt; &gt; www.stevehultay.com\n&gt; &gt; &gt; www.rtscresearch.org*\n&gt; &gt; &gt;\n&gt; &gt; &gt; \n&gt; &gt; &gt;\n&gt;  &gt;\n&gt; \n&gt; \n&gt;  \n&gt; \n&gt; \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;  \n&gt;       \n&gt;                  \n&gt;    \n&gt;        \n&gt;   \n&gt; \n&gt; =\n&gt;"}