{"id": "18383", "subject": "Re: [EVP-ITC] Re: Science vs. Ghost Box Technology", "author": "Frank Sumption", "timestamp": "2010-07-28T06:38:00Z", "full_text": "I&#39;d try to explain how the damn things work, but I doubt it would be\nunderstood.\n\n F-S\nOn Tue, Jul 27, 2010 at 11:34 AM, Ursula Kalin &lt;kalinu@sbcglobal.net&gt; wrote:\n\n&gt;\n&gt;\n&gt;  you sound insane\n&gt;\n&gt;  ------------------------------\n&gt; *From:* Matt &lt;elvymir@...&gt;\n&gt; *To:* EVP-ITC@yahoogroups.com\n&gt; *Sent:* Sun, July 25, 2010 11:16:52 PM\n&gt;\n&gt; *Subject:* [EVP-ITC] Re: Science vs. Ghost Box Technology\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Well Id first wish to introduce myself. My name is Matt Dowdell and im from\n&gt; a small group of people who have been doing paranormal\n&gt; research/investigation in the CT area. This is my first post, but i have\n&gt; been lurking threw these forums for some time.\n&gt;\n&gt; One thing i would like everyone who reads this realize is that paranormal\n&gt; research/investigating, like any new science, nothing can be written in\n&gt; stone.\n&gt;\n&gt; Now i do want to say that the research into the boxes and other devices by\n&gt; Frank and others can not go unnoticed, but there is still one or two flaws\n&gt; in them.\n&gt;\n&gt; I mean, with the short bit i listened to, i dont feel as if they are\n&gt; bashing you or frank personally but the idea behind the boxes, but without a\n&gt; doubt in a ignorant fashion.\n&gt;\n&gt; Regardless, i personally try to stay away from the boxes, but i join this\n&gt; site inorder to learn more about them and how they work. To me the boxes\n&gt; have to much &quot;chance&quot; to may be or may not be something. I have used one in\n&gt; the past and had an interesting result, but for all i know, it could have\n&gt; been a rogue radio wave from a station in the area. Im just hoping to give\n&gt; you an idea of this thinking is VS bashing your ideas and work, which im\n&gt; simpley not. Science is about proving something from every angle and being\n&gt; without a doubt its correct without anyone able to say its something else.\n&gt;\n&gt; Unfortunetly, with the boxes, there is alot of noise and when matrixing\n&gt; comes into mind, you create a situation where something is absolutly\n&gt; nothing, seems to be otherwise. Im not saying they dont work, from it, again\n&gt; im saying it could be a &quot;chance&quot;.\n&gt;\n&gt; Video, pictures are fool proof, audio really isnt, and honestly, when my\n&gt; team picks up EVPs we go into them with a doubtful mind and dont depend on\n&gt; them to be our evidence.\n&gt;\n&gt;  \n&gt;\n\nI'd y o explain how he damn hings wo k, bu I doub i would be unde s ood. \n \n F-S\nOn Tue, Jul 27, 2010 a 11:34 AM, U sula Kalin kalinu@...> w o e:\n\n  \n\n\n\n\n\nyou sound insane\n\n\n\n\nF om: Ma el ymi @...>\nTo: EVP-ITC@yahoog oups.comSen : Sun, July 25, 2010 11:16:52 PM \nSubjec : [EVP-ITC] Re: Science s. Ghos Box Technology  \n\nWell Id i s wish o in oduce mysel . My name is Ma Dowdell and im om a small g oup o people who ha e been doing pa ano mal esea ch/in es iga ion in he CT a ea. This is my i s pos , bu i ha e been lu king h ew hese o ums o some ime.\nOne hing i would like e e yone who eads his ealize is ha pa ano mal esea ch/in es iga ing, like any new science, no hing can be w i en in s one.Now i do wan o say ha he esea ch in o he boxes and o he de ices by F ank and o he s can no go unno iced, bu he e is s ill one o wo laws in hem.\nI mean, wi h he sho bi i lis ened o, i don eel as i hey a e bashing you o ank pe sonally bu he idea behind he boxes, bu wi hou a doub in a igno an ashion.Rega dless, i pe sonally y o s ay away om he boxes, bu i join his si e ino de o lea n mo e abou hem and how hey wo k. To me he boxes ha e o much \"chance\" o may be o may no be some hing. I ha e used one in he pas and had an in e es ing esul , bu o all i know, i could ha e been a ogue adio wa e om a s a ion in he a ea. Im jus hoping o gi e you an idea o his hinking is VS bashing you ideas and wo k, which im simpley no . Science is abou p o ing some hing om e e y angle and being wi hou a doub i s co ec wi hou anyone able o say i s some hing else.\nUn o une ly, wi h he boxes, he e is alo o noise and when ma ixing comes in o mind, you c ea e a si ua ion whe e some hing is absolu ly no hing, seems o be o he wise. Im no saying hey don wo k, om i , again im saying i could be a \"chance\".\nVideo, pic u es a e ool p oo , audio eally isn , and hones ly, when my eam picks up EVPs we go in o hem wi h a doub ul mind and don depend on hem o be ou e idence."}