{"id": "18384", "subject": "Re: [EVP-ITC] Science vs. Ghost Box Technology", "author": "Frank Sumption", "timestamp": "2010-07-28T06:59:10Z", "full_text": "We are not wrong. Most have such limited awareness and intellect that they\ncan&#39;t allow the box, or any method for that matter to work. Most think\nspirits are somehow half human retarded zombies that can&#39;t possibly make use\nof the raw audio supplied by The boxes. Most have absolutely no technical\nknowledge whatsoever, yet will tell us how ITC really works. Most can not\ngrasp the concept of higher demensions of reality and have the audacity to\nthink this is the top of evolution.\n\n Like Steve, I&#39;ve had it too. I&#39;m tied of these idiotic arguments, and\ndumbass skeptic jerks.\n\n Who gives a crap if you accept the box, I do this shit for my own\ncuriosity, everyone else can bite me! This stuff works. except for people\nthat think they are such geniuses that they can out guess spirit and every\nother frikkin&#39; thing in the world.\n\n The skeptics can&#39;t make the box go away, so what do they do? Name calling\nand bullying--yeah that&#39;s science in this country.\n\n Once again--the box is just a source of raw audio--bits of speech, music,\nand noise that the entities manipulate into voices and messages. There are\nno freaking accidental captures, these entities know exactly when you are\nrecording, who is recording and what you want to hear/know. You do not have\nto second guess them by asking questions. Forget the white noise EVP days,\nthat shit is over and useless. Forget you ever saw Ghost Busters, and every\nother Hollywood paranormal movie. If you think you know all about\nspirit-you&#39;re wrong!\n\n Frank-S\n\nOn Sun, Jul 25, 2010 at 8:37 PM, &lt;urkel23@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;\n&gt; Been thinking and decided that we are not wrong in our beliefs.  If we can\n&gt; help find a missing child as so many do with $30 shack hacks, than where is\n&gt; the harm and the threat.\n&gt;\n&gt; Science spends billions of dollars each and every year to find a cure for\n&gt; cancer with no results.  I&#39;m talking about a $30 radio that may help and\n&gt; has.  Seems like we have the upper hand in the matter.  Just because our\n&gt; methods are not accepted as the norm, does that mean that it serves no\n&gt; purpose.\n&gt;\n&gt; If society spent billions of dollars on ghost box research every year, we\n&gt; wouldn&#39;t even be having a conversation.\n&gt;\n&gt; p.s.---- Modern science has found a cure for cancer, they just can&#39;t reveal\n&gt; it because they are making a fortune off of treatments.\n&gt;\n&gt; p.s.s.----Thanx RJ for posting that link for that show.....Why are you here\n&gt; anyway?\n&gt;\n&gt; -Steve H.\n&gt;\n&gt;\n&gt;\n&gt; *Steve Hultay\n&gt; *www.keyportparanormal.com*\n&gt; http://tech.groups.yahoo.com/group/rtsc/\n&gt; www.stevehultay.com\n&gt; www.rtscresearch.org*\n&gt;\n&gt; \n&gt;\n\nWe a e no w ong. Mos ha e such limi ed awa eness and in ellec ha hey can'  allow he box, o any me hod o   ha ma e o wo k. Mos hink spi i s a e somehow hal human e a ded zombies ha can' possibly make use o he aw audio supplied by The boxes. Mos ha e absolu ely no echnical knowledge wha soe e , ye will ell us how ITC eally wo ks. Mos can no g asp he concep o highe demensions o eali y and ha e he audaci y o hink his is he op o e olu ion. \n\n \n Like S e e, I' e had i oo. I'm ied o hese idio ic a gumen s, and dumbass skep ic je ks.\n \n Who gi es a c ap i you accep he box, I do his shi o my own cu iosi y, e e yone else can bi e me! This s u wo ks. excep o people ha hink hey a e such geniuses ha hey can ou guess spi i and e e y o he ikkin' hing in he wo ld. \n\n \n The skep ics can' make he box go away, so wha do hey do? Name calling and bullying--yeah ha 's science in his coun y.\n \n Once again-- he box is jus a sou ce o aw audio--bi s o speech, music, and noise ha he en i ies manipula e in o oices and messages. The e a e no eaking acciden al cap u es, hese en i ies know exac ly when you a e eco ding, who is eco ding and wha you wan o hea /know. You do no ha e o second guess hem by asking ques ions. Fo ge he whi e noise EVP days, ha shi is o e and useless. Fo ge you e e saw Ghos Bus e s, and e e y o he Hollywood pa ano mal mo ie. I you hink you know all abou spi i -you' e w ong!\n\n \n F ank-S\nOn Sun, Jul 25, 2010 a 8:37 PM, u kel23@...> w o e:\n\n  \n\n\n\n\n \nBeen hinking and decided ha we a e no w ong in ou belie s.  I we can help ind a missing child as so many do wi h $30 shack hacks, han whe e is he ha m and he h ea .\n \nScience spends billions o dolla s each and e e y yea o ind a cu e o cance wi h no esul s.  I'm alking abou a $30 adio ha may help and has.  Seems like we ha e he uppe hand in he ma e .  Jus because ou me hods a e no accep ed as he no m, does ha mean ha i se es no pu pose.\n\n \nI socie y spen billions o dolla s on ghos box esea ch e e y yea , we wouldn' e en be ha ing a con e sa ion.\n \np.s.---- Mode n science has ound a cu e o cance , hey jus can' e eal i because hey a e making a o une o o ea men s.\n \np.s.s.----Thanx RJ o pos ing ha link o ha show.....Why a e you he e anyway?\n \n-S e e H.\n \n \n \nS e e Hul aywww.keypo pa ano mal.com\nh p:// ech.g oups.yahoo.com/g oup/ sc/www.s e ehul ay.comwww. sc esea ch.o g"}