{"id": "18400", "subject": "Re: [EVP-ITC] Experiment 3", "author": "Frank Sumption", "timestamp": "2010-07-31T16:48:33Z", "full_text": "I really doubt a Ghost Box is capable of remote viewing.\n\nF-S\n\nOn Fri, Jul 30, 2010 at 1:07 PM, rasterer &lt;rasterer@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;\n&gt; This experiment is intended for those interested in exploring the Remote\n&gt; Viewing capabilities of their Ghost Box&#39;s, EVP recorders. or even personal\n&gt; clairvoyant or precognitive capabilities And to maybe even have a little fun\n&gt; here.\n&gt;\n&gt; On Friday, 7/30/2010 I placed an object on top of my computer monitor,\n&gt; right in front of me, and will leave it there until noon Denver time on\n&gt; Monday, 8/2/2010. This experiment asks for participants to determine what\n&gt; that object is. Vague or partial answers won&#39;t be counted (for example, just\n&gt; giving a color, shape, size, what it&#39;s made of, etc): we&#39;re looking for what\n&gt; it is. Answers anyone reveals after noon Denver time Monday won&#39;t count.\n&gt; Participants can use their ghost boxes, EVP recorders, or any other means\n&gt; they chose. At the end of the experiment, I will reveal the object, and a\n&gt; tally of the number of correct and/or incorrect answers.\n&gt;\n&gt; In order to keep me honest, I have taken a picture of the object at the\n&gt; start of the experiment and loaded it to the Files section (RJ folder) of\n&gt; this group. The idea with this file is that you can download it now and\n&gt; &#39;keep it safe&#39; on your computer. Then at the end of the experiment, I will\n&gt; post the password so you can reveal the contents of the file. That way, you\n&gt; were in control of the original image during the entire test, not me.\n&gt;\n&gt; Password pdf:\n&gt; http://tech.groups.yahoo.com/group/EVP-ITC/files/RJ/RJ20100730.pdf\n&gt;\n&gt; And if you do not care to download the pdf file now, I will post the final\n&gt; image there at the end of the experiment anyway.\n&gt;\n&gt; My monitor is one of the older box-like SONY CRTs, and says &quot;Trinitron&quot; and\n&gt; &quot;Multiscan 200sf&quot; on the upper front. I have a couple monitors stacked in my\n&gt; closet too: they are not the monitors used in this experiment (they are not\n&gt; plugged in, and have nothing else on them anyway), and I have several\n&gt; laptops around: they are also not the monitors in this experiment. The\n&gt; monitor in this experiment is the only SONY monitor I have, says &quot;SONY in\n&gt; various places on it, and can be seen in the following link from the first\n&gt; experiment, when the correct answer would have been &quot;radio&quot;:\n&gt;\n&gt; http://tech.groups.yahoo.com/group/EVP-ITC/files/RJ/RJ.20100710.1.JPG\n&gt;\n&gt; Please post all answers to the group thread: that way, there will be a\n&gt; public record and I won&#39;t get accused of losing any answers. Any answers\n&gt; sent directly to me, I will repost on the public thread.\n&gt;\n&gt; \n&gt;\n\nI eally doub a Ghos Box is capable o emo e iewing.\n \nF-S\nOn F i, Jul 30, 2010 a 1:07 PM, as e e as e e @...> w o e:\n\n  \n\n\n\nThis expe imen is in ended o hose in e es ed in explo ing he Remo e Viewing capabili ies o hei Ghos Box's, EVP eco de s. o e en pe sonal clai oyan o p ecogni i e capabili ies And o maybe e en ha e a li le un he e.\nOn F iday, 7/30/2010 I placed an objec on op o my compu e moni o , igh in on o me, and will lea e i he e un il noon Den e ime on Monday, 8/2/2010. This expe imen asks o pa icipan s o de e mine wha ha objec is. Vague o pa ial answe s won' be coun ed ( o example, jus gi ing a colo , shape, size, wha i 's made o , e c): we' e looking o wha i is. Answe s anyone e eals a e noon Den e ime Monday won' coun . Pa icipan s can use hei ghos boxes, EVP eco de s, o any o he means hey chose. A he end o he expe imen , I will e eal he objec , and a ally o he numbe o co ec and/o inco ec answe s.\nIn o de o keep me hones , I ha e aken a pic u e o he objec a he s a o he expe imen and loaded i o he Files sec ion (RJ olde ) o his g oup. The idea wi h his ile is ha you can download i now and 'keep i sa e' on you compu e . Then a he end o he expe imen , I will pos he passwo d so you can e eal he con en s o he ile. Tha way, you we e in con ol o he o iginal image du ing he en i e es , no me. \nPasswo d pd : h p:// ech.g oups.yahoo.com/g oup/EVP-ITC/ iles/RJ/RJ20100730.pd And i you do no ca e o download he pd ile now, I will pos he inal image he e a he end o he expe imen anyway.\nMy moni o is one o he olde box-like SONY CRTs, and says \"T ini on\" and \"Mul iscan 200s \" on he uppe on . I ha e a couple moni o s s acked in my close oo: hey a e no he moni o s used in his expe imen ( hey a e no plugged in, and ha e no hing else on hem anyway), and I ha e se e al lap ops a ound: hey a e also no he moni o s in his expe imen . The moni o in his expe imen is he only SONY moni o I ha e, says \"SONY in a ious places on i , and can be seen in he ollowing link om he i s expe imen , when he co ec answe would ha e been \" adio\":\nh p:// ech.g oups.yahoo.com/g oup/EVP-ITC/ iles/RJ/RJ.20100710.1.JPGPlease pos all answe s o he g oup h ead: ha way, he e will be a public eco d and I won' ge accused o losing any answe s. Any answe s sen di ec ly o me, I will epos on he public h ead."}