{"id": "18418", "subject": "Re: [EVP-ITC] Re: Experiment 3 - Results!", "author": "Rj", "timestamp": "2010-08-04T15:22:34Z", "full_text": "--0-1248013582-1280935354=:22702\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nAs I&#39;ve said, we&#39;re just trying some things, and seeing what works and what=\r\n doesn&#39;t.=C2=A0 I don&#39;t understand why people run their own experiments sep=\r\narate from yours upsets you so.\n\nYou said below &quot;I think much of the parano=\r\nrmal depends on expectations, and if one \nexpects to test this stuff with n=\r\no results, that&#39;s what they get.&quot;=C2=A0 So then, if participants expect to =\r\nget the right answers, by your comment, it should work.\n\n\nYou said: &quot;these =\r\npompus \nskeptics that accept no evidence&quot;.=C2=A0 It seems like you&#39;ve start=\r\ned calling me names again, but I am accepting all the evidence these experi=\r\nments, show, whether positive or negative. You are not accepting the eviden=\r\nce the experiments are showing.\n\nIf you have other experiments, or changes =\r\nto the current conditions, I am happy to try to accommodate them.=C2=A0 But=\r\n just calling people names from the sidelines doesn&#39;t really add anything t=\r\no the research, doesn&#39;t really advance any of your points, and certainly do=\r\nesn&#39;t reflect well on your claims\n\nRj\n\n\n\n--- On Wed, 8/4/10, purplespacefri=\r\nend &lt;purplealiengirl@...&gt; wrote:\n\nFrom: purplespacefriend &lt;purplealie=\r\nngirl@...&gt;\nSubject: [EVP-ITC] Re: Experiment 3 - Results!\nTo: EVP-ITC=\r\n@yahoogroups.com\nDate: Wednesday, August 4, 2010, 8:07 AM\n\n\n\n\n\n\n\n=C2=A0\n\n\n\n=\r\n  \n\n\n    \n      \n      \n       Y&#39;all don&#39;t get it! Paranormal stuff does no=\r\nt seem to work on demand like this. Much has to do with expectation, and if=\r\n the one doing the testing expects no results, that&#39;s usually what comes of=\r\n these tests. The only result is making the participants look like idiots. =\r\nMany skeptics pull this testing crap, and they are notorious for changing t=\r\nhe rules and conditions to make all things paranormal go away. \n\n\n\nI said t=\r\nhis at the start of this crap that there was only one result possible, to m=\r\nake all paticipants look foolish for believing in ghosts. \n\n\n\nPeople like t=\r\nhis will not allow themselves to hear EVPs, as they can&#39;t trust their heari=\r\nng, and are convinced by other eskeptics that that it&#39;s all the brain fooli=\r\nng itself, and somehow their hearing is superior to everyone else&#39;s. \n\n\n\nI =\r\nthink much of the paranormal depends on expectations, and if one expects to=\r\n test this stuff with no results, that&#39;s what they get. There is a certain =\r\nopenness and allowing that is required.\n\n\n\nEveryone of these test is just m=\r\nore ammo for the skeptics that want the world to conform to what some autho=\r\nrity figure says is ok the think about. \n\n\n\nI&#39;ve had it with this group, it=\r\n&#39;s not bad enough to get these pompus skeptics that accept no evidence, but=\r\n then there&#39;s the one&#39;s the know so much better that the boxes can&#39;t work, =\r\ndespite the fact that thousands use the method and get two way, verifiable =\r\ncommunications. Not good enouhg, they want Slimmer from Ghost Busters to ju=\r\nmp out of the box and slap them one the side of the head.  \n\n\n\nAlot of verb=\r\nage that be ignored anyway. It either has to be all TAPS, or all debunking.=\r\n \n\n\n\nF-S\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;rasterer&quot; &lt;rasterer@...&gt; wrote=\r\n:\n\n&gt;\n\n&gt; \n\n&gt; Thanks to everyone who participated in Experiment 3.\n\n&gt; \n\n&gt; On =\r\nFriday, 7/30/2010 I placed an object on top of my computer monitor, right i=\r\nn front of me, and left it there until noon Denver time on Monday, 8/2/2010=\r\n.   This experiment asked for participants to determine what that object wa=\r\ns. Vague or partial answers won&#39;t be counted (for example, just giving a co=\r\nlor, shape, size,  what it&#39;s made of, etc): we&#39;re looking for what it is. A=\r\nnswers anyone reveals after noon Denver time Monday won&#39;t count.  Participa=\r\nnts could use their ghost boxes, EVP recorders, or any other means they cho=\r\nse.  \n\n&gt; \n\n&gt; In order to keep me honest, I took a picture of the object at =\r\nthe start of the experiment and loaded it to the Files section (RJ folder) =\r\nof this group.  The idea with this file is that you could download it at th=\r\ne beginning of the experiment and &#39;keep it safe&#39; on your computer. Then at =\r\nthe end of the experiment, I would post the password so you could reveal th=\r\ne contents of the file. That way, you were in control of the original image=\r\n during the entire time, not me.  \n\n&gt; \n\n&gt; Passworded pdf: http://tech.group=\r\ns.yahoo.com/group/EVP-ITC/files/RJ/RJ20100730.pdf\n\n&gt; \n\n&gt; The password for t=\r\nhat file is: 867530Nieine\n\n&gt; \n\n&gt; So to the results:\n\n&gt; \n\n&gt; Number of partic=\r\nipants: 2\n\n&gt; Total tries: 3\n\n&gt; Ambiguous answers: 0\n\n&gt; Correct answers: 0\n\n=\r\n&gt; \n\n&gt; Object: A Pot\n\n&gt; Object picture: http://tech.groups.yahoo.com/group/E=\r\nVP-ITC/files/RJ/RJ20100730.jpg\n\n&gt; \n\n&gt; \n\n&gt; If anyone has any observations, c=\r\nomments, or ideas for improvement, let me know. Again, thanks to everyone w=\r\nho participated in this experiment.\n\n&gt;\n\n\n\n\n\n    \n     \n\n    \n    \n\n\n \n\n\n\n  =\r\n\n\n\n\n\n\n\n      \r\n--0-1248013582-1280935354=:22702\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;As I&#39;ve said, we&#39;re just trying some things, =\r\nand seeing what works and what doesn&#39;t.&nbsp; I don&#39;t understand why people=\r\n run their own experiments separate from yours upsets you so.&lt;br&gt;&lt;br&gt;You sa=\r\nid below &quot;I think much of the paranormal depends on expectations, and if on=\r\ne \nexpects to test this stuff with no results, that&#39;s what they get.&quot;&nbsp;=\r\n So then, if participants expect to get the right answers, by your comment,=\r\n it should work.&lt;br&gt;\n&lt;br&gt;You said: &quot;these pompus \nskeptics that accept no e=\r\nvidence&quot;.&nbsp; It seems like you&#39;ve started calling me names again, but I =\r\nam accepting all the evidence these experiments, show, whether positive or =\r\nnegative. You are not accepting the evidence the experiments are showing.&lt;b=\r\nr&gt;&lt;br&gt;If you have other experiments, or changes to the current conditions, =\r\nI am happy to try to accommodate them.&nbsp; But just calling people names =\r\nfrom the sidelines doesn&#39;t really add anything to the research, doesn&#39;t rea=\r\nlly advance any of your points, and certainly doesn&#39;t reflect well on your =\r\nclaims&lt;br&gt;&lt;br&gt;Rj&lt;br&gt;&lt;br&gt;&lt;br&gt;&lt;br&gt;--- On &lt;b&gt;Wed, 8/4/10, purplespacefriend &lt;i=\r\n&gt;&lt;purplealiengirl@...&gt;&lt;/i&gt;&lt;/b&gt; wrote:&lt;br&gt;&lt;blockquote style=3D&quot;b=\r\norder-left: 2px solid rgb(16, 16, 255); margin-left: 5px; padding-left: 5px=\r\n;&quot;&gt;&lt;br&gt;From: purplespacefriend &lt;purplealiengirl@...&gt;&lt;br&gt;Subject=\r\n: [EVP-ITC] Re: Experiment 3 - Results!&lt;br&gt;To: EVP-ITC@yahoogroups.com&lt;br&gt;D=\r\nate: Wednesday, August 4, 2010, 8:07\n AM&lt;br&gt;&lt;br&gt;&lt;div id=3D&quot;yiv2106438825&quot;&gt;\n=\r\n\n\n\n\n\n&lt;span style=3D&quot;display: none;&quot;&gt;&nbsp;&lt;/span&gt;\n\n\n\n    &lt;div id=3D&quot;yiv2106=\r\n438825ygrp-text&quot;&gt;\n      \n      \n      &lt;p&gt; Y&#39;all don&#39;t get it! Paranormal st=\r\nuff does not seem to work on demand like this. Much has to do with expectat=\r\nion, and if the one doing the testing expects no results, that&#39;s usually wh=\r\nat comes of these tests. The only result is making the participants look li=\r\nke idiots. Many skeptics pull this testing crap, and they are notorious for=\r\n changing the rules and conditions to make all things paranormal go away. &lt;=\r\nbr&gt;\n&lt;br&gt;\nI said this at the start of this crap that there was only one resu=\r\nlt possible, to make all paticipants look foolish for believing in ghosts. =\r\n&lt;br&gt;\n&lt;br&gt;\nPeople like this will not allow themselves to hear EVPs, as they =\r\ncan&#39;t trust their hearing, and are convinced by other eskeptics that that i=\r\nt&#39;s all the brain fooling itself, and somehow their hearing is superior to =\r\neveryone else&#39;s. &lt;br&gt;\n&lt;br&gt;\nI think much of the paranormal depends on expect=\r\nations, and if one expects to test this stuff with no results, that&#39;s what =\r\nthey get. There is a certain openness and allowing that is required.&lt;br&gt;\n&lt;b=\r\nr&gt;\nEveryone of these test is just more ammo for the skeptics that want the =\r\nworld to conform to what some authority figure says is ok the think about. =\r\n&lt;br&gt;\n&lt;br&gt;\nI&#39;ve had it with this group, it&#39;s not bad enough to get these pom=\r\npus skeptics that accept no evidence, but then there&#39;s the one&#39;s the know s=\r\no much better that the boxes can&#39;t work, despite the fact that thousands us=\r\ne the method and get two way, verifiable communications. Not good enouhg, t=\r\nhey want Slimmer from Ghost Busters to jump out of the box and slap them on=\r\ne the side of the head.  &lt;br&gt;\n&lt;br&gt;\nAlot of verbage that be ignored anyway. =\r\nIt either has to be all TAPS, or all debunking. &lt;br&gt;\n&lt;br&gt;\nF-S&lt;br&gt;\n&lt;br&gt;\n--- =\r\nIn &lt;a rel=3D&quot;nofollow&quot; ymailto=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot; target=\r\n=3D&quot;_blank&quot; href=3D&quot;/mc/compose?to=3DEVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yah=\r\noogroups.com&lt;/a&gt;, &quot;rasterer&quot; &lt;rasterer@...&gt; wrote:&lt;br&gt;\n&gt;&lt;br&gt;\n&gt; =\r\n&lt;br&gt;\n&gt; Thanks to everyone who participated in Experiment 3.&lt;br&gt;\n&gt; &lt;br=\r\n&gt;\n&gt; On Friday, 7/30/2010 I placed an object on top of my computer monito=\r\nr, right in front of me, and left it there until noon Denver time on Monday=\r\n, 8/2/2010.   This experiment asked for participants to determine what that=\r\n object was. Vague or partial answers won&#39;t be counted (for example, just g=\r\niving a color, shape, size,  what it&#39;s made of, etc): we&#39;re looking for wha=\r\nt it is. Answers anyone reveals after noon Denver time Monday won&#39;t count. =\r\n Participants could use their ghost boxes, EVP recorders, or any other mean=\r\ns they chose.  &lt;br&gt;\n&gt; &lt;br&gt;\n&gt; In order to keep me honest, I took a pic=\r\nture of the object at the start of the experiment and loaded it to the File=\r\ns section (RJ folder) of this group.  The idea with this file is that you c=\r\nould download it at the beginning of the experiment and &#39;keep it safe&#39; on y=\r\nour computer. Then at the end of the experiment, I would post the password =\r\nso you could reveal the contents of the file. That way, you were in control=\r\n of the original image during the entire time, not me.  &lt;br&gt;\n&gt; &lt;br&gt;\n&gt;=\r\n Passworded pdf: &lt;a rel=3D&quot;nofollow&quot; target=3D&quot;_blank&quot; href=3D&quot;http://tech.=\r\ngroups.yahoo.com/group/EVP-ITC/files/RJ/RJ20100730.pdf&quot;&gt;http://tech.groups.=\r\nyahoo.com/group/EVP-ITC/files/RJ/RJ20100730.pdf&lt;/a&gt;&lt;br&gt;\n&gt; &lt;br&gt;\n&gt; The =\r\npassword for that file is: 867530Nieine&lt;br&gt;\n&gt; &lt;br&gt;\n&gt; So to the result=\r\ns:&lt;br&gt;\n&gt; &lt;br&gt;\n&gt; Number of participants: 2&lt;br&gt;\n&gt; Total tries: 3&lt;br&gt;=\r\n\n&gt; Ambiguous answers: 0&lt;br&gt;\n&gt; Correct answers: 0&lt;br&gt;\n&gt; &lt;br&gt;\n&gt; O=\r\nbject: A Pot&lt;br&gt;\n&gt; Object picture: &lt;a rel=3D&quot;nofollow&quot; target=3D&quot;_blank&quot;=\r\n href=3D&quot;http://tech.groups.yahoo.com/group/EVP-ITC/files/RJ/RJ20100730.jpg=\r\n&quot;&gt;http://tech.groups.yahoo.com/group/EVP-ITC/files/RJ/RJ20100730.jpg&lt;/a&gt;&lt;br=\r\n&gt;\n&gt; &lt;br&gt;\n&gt; &lt;br&gt;\n&gt; If anyone has any observations, comments, or ide=\r\nas for improvement, let me know. Again, thanks to everyone who participated=\r\n in this experiment.&lt;br&gt;\n&gt;&lt;br&gt;\n&lt;br&gt;\n&lt;/p&gt;\n\n    &lt;/div&gt;\n     \n\n\n\n \n\n\n&lt;/div&gt;=\r\n&lt;/blockquote&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n\n\n\n\n\n\n      \r\n--0-1248013582-1280935354=:22702--"}