{"id": "18427", "subject": "Re: [EVP-ITC] Re: Experiment 3 - Results!", "author": "Zack Widup", "timestamp": "2010-08-04T21:33:43Z", "full_text": "We did that on another group I&#39;m on. We did about 20 tests for &quot;remote\nviewing&quot; and several people got the correct answers in a much higher\nprobability than expected.\n\nAnd it was fun!\n\nZack\n\nOn Wed, Aug 4, 2010 at 4:07 PM, harpo103 &lt;rmc103@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Thats a REALY small sample size.\n&gt; You would likely need several dozen experimenters to get any solid results.\n&gt; But, nice try anyway.\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, &quot;rasterer&quot;\n&gt; &lt;rasterer@...&gt; wrote:\n&gt; &gt;\n&gt; &gt;\n&gt;  &gt; Thanks to everyone who participated in Experiment 3.\n&gt; &gt;\n&gt; &gt; On Friday, 7/30/2010 I placed an object on top of my computer monitor,\n&gt; right in front of me, and left it there until noon Denver time on Monday,\n&gt; 8/2/2010. This experiment asked for participants to determine what that\n&gt; object was. Vague or partial answers won&#39;t be counted (for example, just\n&gt; giving a color, shape, size, what it&#39;s made of, etc): we&#39;re looking for what\n&gt; it is. Answers anyone reveals after noon Denver time Monday won&#39;t count.\n&gt; Participants could use their ghost boxes, EVP recorders, or any other means\n&gt; they chose.\n&gt; &gt;\n&gt; &gt; In order to keep me honest, I took a picture of the object at the start\n&gt; of the experiment and loaded it to the Files section (RJ folder) of this\n&gt; group. The idea with this file is that you could download it at the\n&gt; beginning of the experiment and &#39;keep it safe&#39; on your computer. Then at the\n&gt; end of the experiment, I would post the password so you could reveal the\n&gt; contents of the file. That way, you were in control of the original image\n&gt; during the entire time, not me.\n&gt; &gt;\n&gt; &gt; Passworded pdf:\n&gt; http://tech.groups.yahoo.com/group/EVP-ITC/files/RJ/RJ20100730.pdf\n&gt; &gt;\n&gt; &gt; The password for that file is: 867530Nieine\n&gt; &gt;\n&gt; &gt; So to the results:\n&gt; &gt;\n&gt; &gt; Number of participants: 2\n&gt; &gt; Total tries: 3\n&gt; &gt; Ambiguous answers: 0\n&gt; &gt; Correct answers: 0\n&gt; &gt;\n&gt; &gt; Object: A Pot\n&gt; &gt; Object picture:\n&gt; http://tech.groups.yahoo.com/group/EVP-ITC/files/RJ/RJ20100730.jpg\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; If anyone has any observations, comments, or ideas for improvement, let\n&gt; me know. Again, thanks to everyone who participated in this experiment.\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nWe did ha on ano he g oup I'm on. We did abou 20 es s o \" emo e iewing\" and se e al people go he co ec answe s in a much highe p obabili y han expec ed.\n \nAnd i was  un!\n \nZack \nOn Wed, Aug 4, 2010 a 4:07 PM, ha po103 mc103@...> w o e:\n\n  \n\n\n\nTha s a REALY small sample size.You would likely need se e al dozen expe imen e s o ge any solid esul s. Bu , nice y anyway. \n--- In EVP-ITC@...m, \" as e e \" w o e:>> \n\n\n> Thanks o e e yone who pa icipa ed in Expe imen 3.> > On F iday, 7/30/2010 I placed an objec on op o my compu e moni o , igh in on o me, and le i he e un il noon Den e ime on Monday, 8/2/2010. This expe imen asked o pa icipan s o de e mine wha ha objec was. Vague o pa ial answe s won' be coun ed ( o example, jus gi ing a colo , shape, size, wha i 's made o , e c): we' e looking o wha i is. Answe s anyone e eals a e noon Den e ime Monday won' coun . Pa icipan s could use hei ghos boxes, EVP eco de s, o any o he means hey chose. \n> > In o de o keep me hones , I ook a pic u e o he objec a he s a o he expe imen and loaded i o he Files sec ion (RJ olde ) o his g oup. The idea wi h his ile is ha you could download i a he beginning o he expe imen and 'keep i sa e' on you compu e . Then a he end o he expe imen , I would pos he passwo d so you could e eal he con en s o he ile. Tha way, you we e in con ol o he o iginal image du ing he en i e ime, no me. \n> > Passwo ded pd : h p:// ech.g oups.yahoo.com/g oup/EVP-ITC/ iles/RJ/RJ20100730.pd > > The passwo d o ha ile is: 867530Nieine\n> > So o he esul s:> > Numbe o pa icipan s: 2> To al ies: 3> Ambiguous answe s: 0> Co ec answe s: 0> > Objec : A Po > Objec pic u e: h p:// ech.g oups.yahoo.com/g oup/EVP-ITC/ iles/RJ/RJ20100730.jpg\n> > > I anyone has any obse a ions, commen s, o ideas o imp o emen , le me know. Again, hanks o e e yone who pa icipa ed in his expe imen .>"}