{"id": "18426", "subject": "Re: [EVP-ITC] Re: Baby monitors?", "author": "Zack Widup", "timestamp": "2010-08-04T21:30:17Z", "full_text": "Once upon a time the cordless phones and baby monitors both operated in the\n49 MHz part of the spectrum. It wasn&#39;t unusual to be able to hear baby\nmonitors on cordless phones.\n\nI also had a piece of ham radio equipment for the 6-meter band (50 MHz) that\nwould tune below that. I would listen to the phone conversations on the\ncordless phones and also the baby monitors once in a while. But it got\nboring fast!\n:-)\n\nZack\n\nOn Wed, Aug 4, 2010 at 4:05 PM, harpo103 &lt;rmc103@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; I used to get one of my neighbors on the BM whenever she had a phone call.\n&gt; Maybe, she used a cordless?\n&gt; I never told her and I would listen in for fun sometimes.\n&gt; (naughty me)\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, &quot;Fiona Broome&quot;\n&gt; &lt;email@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hi,\n&gt; &gt;\n&gt; &gt; One of my readers asked me what I thought about using a baby monitor for\n&gt; EVP. Apparently there&#39;s one that gets poor reviews at Amazon because it\n&gt; seems to pick up voices from nowhere.\n&gt; &gt;\n&gt; &gt; That sounds like a good candidate for EVP, etc... no pun intended.\n&gt; &gt;\n&gt; &gt; I wanted to see if anyone on this list had talked about this, but Yahoo\n&gt; Groups&#39; search form isn&#39;t working.\n&gt; &gt;\n&gt; &gt; Has this been discussed? Tested?\n&gt; &gt;\n&gt; &gt; Opinions?\n&gt; &gt;\n&gt; &gt; Cheerfully,\n&gt; &gt; Fiona\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nOnce upon a ime he co dless phones and baby moni o s bo h ope a ed in he 49 MHz pa o he spec um. I wasn' unusual o be able o hea baby moni o s on co dless phones.\n \nI also had a piece o ham adio equipmen o he 6-me e band (50 MHz) ha would une below ha . I would lis en o he phone con e sa ions on he co dless phones and also he baby moni o s once in a while. Bu i go bo ing as !\n\n:-)\n \nZack\nOn Wed, Aug 4, 2010 a 4:05 PM, ha po103 mc103@...> w o e:\n\n  \n\n\n\nI used o ge one o my neighbo s on he BM whene e she had a phone call. Maybe, she used a co dless?I ne e old he and I would lis en in o un some imes.(naugh y me) \n--- In EVP-ITC@yahoog oups.com, \"Fiona B oome\" w o e:>\n> Hi,> > One o my eade s asked me wha I hough abou using a baby moni o o EVP. Appa en ly he e's one ha ge s poo e iews a Amazon because i seems o pick up oices om nowhe e.\n> > Tha sounds like a good candida e o EVP, e c... no pun in ended.> > I wan ed o see i anyone on his lis had alked abou his, bu Yahoo G oups' sea ch o m isn' wo king.> \n> Has his been discussed? Tes ed? > > Opinions?> > Chee ully,> Fiona>"}