{"id": "18433", "subject": "Re: [EVP-ITC] RTSC denied", "author": "David Koenig", "timestamp": "2010-08-06T00:39:49Z", "full_text": "Seems you&#39;ve done something wrong.\n\nOn Thu, Aug 5, 2010 at 7:58 PM, rasterer &lt;rasterer@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;\n&gt; So I submitted a request to join the RTSC yahoo group, and it was denied. I\n&gt; continue to be blown away by the fears and insecurities and cliches of some\n&gt; of the people involved in RTSC. The group says:\n&gt;\n&gt; &quot;This Board is dedicated solely to the research of Real Time Spirit\n&gt; Communication. Any form of devices that are used in 2-way communication are\n&gt; welcome here openly for all to share. This group is for the discussion,\n&gt; promotion and development of new ideas to further this research. This group\n&gt; was designed to take the next step in EVP to get away from conventional\n&gt; methods. -Steve Hultay&quot;\n&gt;\n&gt; I suggest it add:\n&gt;\n&gt; &quot;Unless you ask questions, experiment outside our box, or don&#39;t agree with\n&gt; what we state is so. Then you can&#39;t join&quot;.\n&gt;\n&gt; Amazing.\n&gt;\n&gt;  \n&gt;\n\nSeems you' e done some hing w ong.On Thu, Aug 5, 2010 a 7:58 PM, as e e as e e @...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n \nSo I submi ed a eques o join he RTSC yahoo g oup, and i was denied. I con inue o be blown away by he ea s and insecu i ies and cliches o some o he people in ol ed in RTSC. The g oup says: \n\n\"This Boa d is dedica ed solely o he esea ch o Real Time Spi i Communica ion. Any o m o de ices ha a e used in 2-way communica ion a e welcome he e openly o all o sha e. This g oup is o he discussion, p omo ion and de elopmen o new ideas o u he his esea ch. This g oup was designed o ake he nex s ep in EVP o ge away om con en ional me hods. -S e e Hul ay\"\n\n\nI sugges i add: \n\n\"Unless you ask ques ions, expe imen ou side ou box, o don' ag ee wi h wha we s a e is so. Then you can' join\".\n\nAmazing."}