{"id": "18436", "subject": "Re: [EVP-ITC] RTSC denied", "author": "Frank Sumption", "timestamp": "2010-08-06T06:56:30Z", "full_text": "This stuff is not about people that can&#39;t hear the voices, or see the\nimages in ITC, yet feel they are somehow more qualified to test. These\ngroups are not about ignore all evidence that other members get, and presume\nyou can test for paranormal activity.\n\n I don&#39;t disagree with testing, but somehow spirit contact and paranormal in\ngeneral doesn&#39;t seem to work that way. I think the best you can get is to\nprove it for yourself, and if you can&#39;t get anything, move on to something\nthat does work. Try fishing, or golf.\n\n\n F-S\n\n\n\nOn Thu, Aug 5, 2010 at 6:39 PM, David Koenig &lt;floridajakeblues@gmail.com&gt;wrote:\n\n&gt;\n&gt;\n&gt; Seems you&#39;ve done something wrong.\n&gt;\n&gt;\n&gt; On Thu, Aug 5, 2010 at 7:58 PM, rasterer &lt;rasterer@...&gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; So I submitted a request to join the RTSC yahoo group, and it was denied.\n&gt;&gt; I continue to be blown away by the fears and insecurities and cliches of\n&gt;&gt; some of the people involved in RTSC. The group says:\n&gt;&gt;\n&gt;&gt; &quot;This Board is dedicated solely to the research of Real Time Spirit\n&gt;&gt; Communication. Any form of devices that are used in 2-way communication are\n&gt;&gt; welcome here openly for all to share. This group is for the discussion,\n&gt;&gt; promotion and development of new ideas to further this research. This group\n&gt;&gt; was designed to take the next step in EVP to get away from conventional\n&gt;&gt; methods. -Steve Hultay&quot;\n&gt;&gt;\n&gt;&gt; I suggest it add:\n&gt;&gt;\n&gt;&gt; &quot;Unless you ask questions, experiment outside our box, or don&#39;t agree with\n&gt;&gt; what we state is so. Then you can&#39;t join&quot;.\n&gt;&gt;\n&gt;&gt; Amazing.\n&gt;&gt;\n&gt;&gt;\n&gt;  \n&gt;\n\nThis s u is no abou people ha can' hea he oices, o see he images in ITC, ye eel hey a e somehow mo e quali ied o es . These g oups a e no abou igno e all e idence ha o he membe s ge , and p esume you can es o pa ano mal ac i i y.  \n\n \n I don' disag ee wi h es ing, bu somehow spi i con ac and pa ano mal in gene al doesn' seem o wo k ha way. I hink he bes you can ge is o p o e i o you sel , and i you can' ge any hing, mo e on o some hing ha does wo k. T y ishing, o gol . \n\n \n \n F-S\n \nOn Thu, Aug 5, 2010 a 6:39 PM, Da id Koenig lo idajakeblues@...> w o e:\n\n  \n\n\n\nSeems you' e done some hing w ong. \n\nOn Thu, Aug 5, 2010 a 7:58 PM, as e e as e e @yahoo.com> w o e:\n\n  \n\n\n\nSo I submi ed a eques o join he RTSC yahoo g oup, and i was denied. I con inue o be blown away by he ea s and insecu i ies and cliches o some o he people in ol ed in RTSC. The g oup says: \"This Boa d is dedica ed solely o he esea ch o Real Time Spi i Communica ion. Any o m o de ices ha a e used in 2-way communica ion a e welcome he e openly o all o sha e. This g oup is o he discussion, p omo ion and de elopmen o new ideas o u he his esea ch. This g oup was designed o ake he nex s ep in EVP o ge away om con en ional me hods. -S e e Hul ay\"\nI sugges i add: \"Unless you ask ques ions, expe imen ou side ou box, o don' ag ee wi h wha we s a e is so. Then you can' join\".Amazing."}