{"id": "18456", "subject": "Re: [EVP-ITC] Frank / Friends", "author": "Frank Sumption", "timestamp": "2010-08-14T06:02:33Z", "full_text": "Thanks!\n Incase anyone is wondering, Rick lives about two blocks from me, that&#39;s how\nhe rates a box.\n\n Yeah, it can be amazing at times. I had a box running random sweep mode\ntonight, and as my daughter in-law pulled into the drive way &quot;Hi Dad&quot; came\nout of the box, which is her usual greetting. Random seems to have some\nmerit, it wiol pick up thought, since we are all sprit that shouldn&#39;t be\nsurprising.  but it&#39;s a real pain to get it to work stable.\n\n Frank-S\n\nOn Fri, Aug 13, 2010 at 12:42 PM, Rick Wegrzyn &lt;rickwegrzyn@...&gt;wrote:\n\n&gt;\n&gt;\n&gt;  I&#39;ve been investigating for 33 years...The day I got that &quot;BOX&quot; really\n&gt; changed things...I don&#39;t take everything I hear as spirit,if  I catch it on\n&gt; EVP and it&#39;s clear I&#39;ll take it under my wing for some sort of response,BUT\n&gt; on the other hand We&#39;re getting our names called and asnwers to &quot;Do You Know\n&gt; Where You Are ?&quot; An d the response made us stop and wonder...reponse was &quot;In\n&gt; the basement&quot;......HELLO we&#39;re in the Basement......Also I believe it will\n&gt; bring out the EVIL SIDE...which we did..and both my house as well as our\n&gt; partners seems to have someone that has followed us,turning on lights in the\n&gt; kitchen and opening the kitchen cabinets up,It made me feel sick all day and\n&gt; affected our cat...not to mention simular things at our partners home...Be\n&gt; careful what you say and ask for...cause you might get more than you\n&gt; want.....Love Ya Frank....Rick\n&gt;\n&gt;  \n&gt;\n\nThanks!\n Incase anyone is wonde ing, Rick li es abou wo blocks om me, ha 's how he a es a box.\n \n Yeah, i can be amazing a imes. I had a box unning andom sweep mode onigh , and as my daugh e in-law pulled in o he d i e way \"Hi Dad\" came ou o he box, which is he usual g ee ing. Random seems o ha e some me i , i wiol pick up hough , since we a e all sp i ha shouldn' be su p ising.  bu i 's a eal pain o ge i o wo k s able. \n\n \n F ank-S\nOn F i, Aug 13, 2010 a 12:42 PM, Rick Weg zyn ickweg zyn@...> w o e:\n\n  \n\n\n\n\n\nI' e been in es iga ing o 33 yea s...The day I go ha \"BOX\" eally changed hings...I don' ake e e y hing I hea as spi i ,i   I ca ch i on EVP and i 's clea I'll ake i unde my wing o some so o esponse,BUT on he o he hand We' e ge ing ou names called and asnwe s o \"Do You Know Whe e You A e ?\" An d he esponse made us s op and wonde ... eponse was \"In he basemen \"......HELLO we' e in he Basemen ......Also I belie e i will b ing ou he EVIL SIDE...which we did..and bo h my house as well as ou pa ne s seems o ha e someone ha has ollowed us, u ning on ligh s in he ki chen and opening he ki chen cabine s up,I made me eel sick all day and a ec ed ou ca ...no o men ion simula hings a ou pa ne s home...Be ca e ul wha you say and ask o ...cause you migh ge mo e han you wan .....Lo e Ya F ank....Rick"}