{"id": "18468", "subject": "Single supply random.", "author": "Frank Sumption", "timestamp": "2010-08-17T02:46:22Z", "full_text": "This is a box I made back in March with single supply(one set of batteries)\nlinear and random sweep. Most of the time random hangs up and never starts.\nThe cure isn&#39;t real elegant, but it works. I use a variable voltage\nregulator to supply the DC offset for the random pulse amplifier, and use a\npanel mount trim pot to tweak it as needed. I have a resisitor attached to\nboth ends of the pot to limit it&#39;s range.  The DC offset is needed in the\nsingle, or dual supply versions, the dual supply doesn&#39;t hang up though.\n\n I asked how they like random, and hillbilly woman responds &quot;hear&#39;d ya--it&#39;s\nlousy&quot; at two seconds. This is one of thing about random, it seems to get\nmore real, or natural sounding voices. At 9 seconds &quot;it&#39;s perfect--I need\nit&quot;(?).\n\n Wihtout the panel mounted trim, it will work, but it takes up to 20\nminutes, I can cut that down maybe five minute by shifting the DC level in\nincrements. Again with dual supply, 30 seconds and the random mode is up and\nrunning.\n\n So maybe moving the box forward means going back to waht i started with?\n\n Frank-S\n\nThis is a box I made back in Ma ch wi h single supply(one se o ba e ies) linea and andom sweep. Mos o he ime andom hangs up and ne e s a s. The cu e isn' eal elegan , bu i wo ks. I use a a iable ol age egula o o supply he DC o se o he andom pulse ampli ie , and use a panel moun im po o weak i as needed. I ha e a esisi o a ached o bo h ends o he po o limi i 's ange.  The DC o se is needed in he single, o dual supply e sions, he dual supply doesn' hang up hough.\n\n \n I asked how hey like andom, and hillbilly woman esponds \"hea 'd ya--i 's lousy\" a wo seconds. This is one o hing abou andom, i seems o ge mo e eal, o na u al sounding oices. A 9 seconds \"i 's pe ec --I need i \"(?).\n\n \n Wih ou he panel moun ed im, i will wo k, bu i akes up o 20 minu es, I can cu ha down maybe i e minu e by shi ing he DC le el in inc emen s. Again wi h dual supply, 30 seconds and he andom mode is up and unning. \n\n \n So maybe mo ing he box o wa d means going back o wah i s a ed wi h?\n \n F ank-S"}