{"id": "18464", "subject": "Re: Frank / Friends", "author": "Country", "timestamp": "2010-08-16T03:39:53Z", "full_text": "Rick:\n\nHave you asked your box if the spirit(s) is now gone? Did you ever get any information on the spirit from the box or whatever you are using? Very interesting experience to read, although I imagine you find it a little more than just interesting of course. Can you let us know if the spirit returns or if there are more still there?\nThanks,\nCountry\n\n--- In EVP-ITC@yahoogroups.com, Rick Wegrzyn &lt;rickwegrzyn@...&gt; wrote:\n&gt;\n&gt; Are using the &quot;BOX&#39; or going at it with a digital recorder ????We went back to \n&gt; the cemetary and asked what followed me to follow me back...I always go for \n&gt; evp&#39;s,KII,thermal temp. guage,and video....Today is fine what ever is no longer \n&gt; here and the air is lighter,but the evp&#39;s we got are class a..there is a evil \n&gt; presence there,we were followed by a small red light ..cahght by video,kinda \n&gt; like a cigerett...I walked around and nothing...But the evp we got was a women \n&gt; saying yes to the evil one,and along with the KII hits...That box from my \n&gt; xper.brings out more than I was ready for...Thanks again Frank....love Ya,Rick\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; ________________________________\n&gt; From: draiga1 &lt;mail@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Sun, August 15, 2010 4:45:58 PM\n&gt; Subject: [EVP-ITC] Re: Frank / Friends\n&gt; \n&gt;   \n&gt; I haven&#39;t noticed that any spirits have set up house with mme because I \n&gt; communicate with them. I have spirits here already since I collect haunted \n&gt; objects, but they have gotten quiet since they&#39;ve settled in years ago.\n&gt; \n&gt; ~Draiga\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Country&quot; &lt;plaine@&gt; wrote:\n&gt; &gt;\n&gt; &gt; It is interesting that you posted this because I was thinking of asking the \n&gt; &gt;group if using the box, a digital recorder, EVP Maker, and the like created any \n&gt; &gt;odd occurences in your home. I have had things happen and it always seems to be \n&gt; &gt;after I have spent some time trying to communicate with one of those methods. \n&gt; &gt;Does this kind of communication bring spirits into your home? Has anyone else \n&gt; &gt;had similar experiences to Rick?\n&gt; &gt; Thanks,\n&gt; &gt; Country\n&gt;"}