{"id": "18474", "subject": "Re: PX - Has anyone tried this piece of equipment?", "author": "ghosttrackerguy", "timestamp": "2010-08-18T17:47:48Z", "full_text": "I currently use this unit called the PX.  It was offered by a company called digital dowsing.  It was offered on a limited run by the creator Bill Chappell early 2010.\n\nIt is 1/2 ovilus 1/2 puck, which were 2 earlier devices created by Bill Chappell.  I have used this instrument on every investigation that I have been involved with and it has provided some interesting results to say the least.\n\nThe website with a full description on this device can be found here\nwww.digitaldowsing.com/px\n\nHope that this helps..\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;Fransen, Debbie&quot; &lt;debbie.fransen@...&gt; wrote:\n&gt;\n&gt; It sounds like what the Ovilus does.... Who has come up with this PX EMF?\n&gt; I have an Ovilus, and I am not really sure about it yet.\n&gt; Still testing it...... How much are they asking for this PX EMF ?\n&gt; Some of this equipment gets really expensive......\n&gt; debfransen\n&gt; \n&gt; ________________________________\n&gt; From: EVP-ITC@yahoogroups.com [mailto:EVP-ITC@yahoogroups.com] On Behalf Of Country\n&gt; Sent: Wednesday, August 18, 2010 12:16 PM\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Subject: [EVP-ITC] PX - Has anyone tried this piece of equipment?\n&gt; \n&gt; \n&gt; \n&gt; Hello Everyone:\n&gt; \n&gt; I am wondering if anyone has tried the PX EMF meter for EVP? Below is a description of this meter, in case you haven&#39;t heard of it. Any thoughts on this meter?\n&gt; \n&gt; Thanks,\n&gt; Country\n&gt; \n&gt; &quot;&quot;&quot;The PX EMF meter is a talking ghost box which translate EMF signals into speech. It uses an internal database of 2000+ words or can translate in Phonetic Mode speech which is not in the dictionary. It also has a reverse Phonetic mode. My favorite though is the Touch Mode. In this mode, if the PX is left alone and someone or something touches it, it will start pinging like a deep sea submarine.\n&gt; \n&gt; 1: Dictionary Mode the PX has 2048 internal words that are used in this mode\n&gt; 2: Phonetic Mode the PX will use phonemes to speak\n&gt; 3. Reverse Phonetic Mode The PX will reverse the phonetic output in effect it talks backwards\n&gt; 4. Touch Mode this mode is used to detect if the device is being touched\n&gt; 5. Voice Change Mode, this mode is the same as #1 dictionary mode except the voice\n&gt; can be altered detected inputs\n&gt; 6. Repeat Mode say last words said .. in this mode the PX will repeat the last words spoke from last said to first\n&gt; up to 400 words.\n&gt; 7. Energy Mode : this mode allows the user to set the sensitivity of the device with one of 3\n&gt; preset levels. The PX will say LOW then give four beeps pressing mode during this time will set the Energy level low.&quot;&quot;&quot;\n&gt;"}