{"id": "18563", "subject": "Re: [EVP-ITC] Scamp,", "author": "Frank Sumption", "timestamp": "2010-08-22T21:15:45Z", "full_text": "Yeah I know, science no accept anecdotes. There is plenty of hard evidence,\ntrouble, science don&#39;t accept that either cuz they are taught, no spirits,\nso there are no sprit voices, fact is fact is facts. Well that&#39;s about all\nthere is in this field. Perhaps you should take bird watching or something\nconcrete. To not accept what others say is the same as calling us all liars,\nand I find very insulting.\n\n How irrational is it to ignore all evidence and continuously try to fit the\nphenomon into a diffintion where it will not fit and does not belong, and\nthen claim you&#39;re looking for a more rational explantation, it just does not\nmake sense. I say forget the BS &quot;science&quot; whatever that is, puts out and try\nthinking on your own.  Mr Spock was a fictional charactor!\n\n F-S\n\n\n\nOn Sun, Aug 22, 2010 at 7:20 AM, Rj &lt;rasterer@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;\n&gt; Experimental data in controlled conditions, and personal anecdotes, are not\n&gt; the same thing,\n&gt;\n&gt;\n&gt;\n&gt; --- On *Sun, 8/22/10, Frank Sumption &lt;purplealiengirl@...&gt;* wrote:\n&gt;\n&gt;\n&gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt; Subject: Re: [EVP-ITC] Scamp,\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Sunday, August 22, 2010, 12:21 AM\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;  If you completely ignore what everyone else in the whole wide freaking\n&gt; world gets via EVP, various photography and ITC methods, and just chance\n&gt; encounters, then yeah, you probably don&#39;t have any data, and won&#39;t have any\n&gt; data no matter what.\n&gt;\n&gt; F-S\n&gt;\n&gt; On Sat, Aug 21, 2010 at 3:42 PM, Rick Wegrzyn &lt;rickwegrzyn@...&lt;http://mc/compose?to=rickwegrzyn@...&gt;\n&gt; &gt; wrote:\n&gt;\n&gt;\n&gt;\n&gt;  Hey RJ,I think we need to go to the cemetary and see what you get\n&gt; there....\n&gt;\n&gt;  ------------------------------\n&gt; *From:* Rj &lt;rasterer@... &lt;http://mc/compose?to=rasterer@...&gt;&gt;\n&gt;\n&gt; *To:* EVP-ITC@yahoogroups.com&lt;http://mc/compose?to=EVP-ITC@yahoogroups.com&gt;\n&gt; *Sent:* Sat, August 21, 2010 2:29:36 PM\n&gt;\n&gt; *Subject:* Re: [EVP-ITC] Scamp,\n&gt;\n&gt;\n&gt;\n&gt;   I don&#39;t think I have enough data yet to make any conclusions, so I plan\n&gt; more experiments.  Since there are different distinct claims about what the\n&gt; box or the recorders can do, I try to make different distinct experiments\n&gt; for each.\n&gt;\n&gt; Some people claim they can get the box to tell them things that the\n&gt; operator couldn&#39;t know, so my &quot;whats the object&quot; experiment is one way to\n&gt; examine that.  Some people claim the boxes can make predictions, so\n&gt; cataloging predictions and examining the results can help examine that.  If\n&gt; there are other claims, I will try to figure experiments based on those.\n&gt;\n&gt; --- On *Sat, 8/21/10, Frank Sumption &lt;purplealiengirl@gmail.com&lt;http://mc/compose?to=purplealiengirl@...&gt;\n&gt; &gt;* wrote:\n&gt;\n&gt;\n&gt; From: Frank Sumption &lt;purplealiengirl@...&lt;http://mc/compose?to=purplealiengirl@...&gt;\n&gt; &gt;\n&gt; Subject: Re: [EVP-ITC] Scamp,\n&gt; To: EVP-ITC@yahoogroups.com &lt;http://mc/compose?to=EVP-ITC@yahoogroups.com&gt;\n&gt; Date: Saturday, August 21, 2010, 12:48 PM\n&gt;\n&gt;\n&gt;\n&gt;  I get our last dogs from time to time, and used to get them via white\n&gt; noise when I first started this. Last summer some kids came down into the\n&gt; basement wiht the younger grandson, and the little yorkie barked, but &quot;get\n&gt; outta here&quot; came out, some how.\n&gt;\n&gt;  Yeah, I think I was too hard on RJ. I don&#39;t know why, but testing doens&#39;t\n&gt; seem to work, but we get enough to prove this to ourselves. It&#39;s probably a\n&gt; faith thing, although I&#39;m not religious, even anti-religion.\n&gt;\n&gt;  F-S\n&gt;\n&gt;\n&gt;\n&gt; On Fri, Aug 20, 2010 at 6:27 PM, &lt;SnowfireL@...&gt; wrote:\n&gt;\n&gt;\n&gt;  [Attachment(s)&lt;https://mail.google.com/mail/?ui=2&view=js&name=main,tlist&ver=9oD1J7yvz5o.en.&am=%21xONyw1plirqxhZ4a1PIWg1xlTveuJ8oWIzqJ6mz0Dt83ht4Zrp4&fri#12a920b21a6295da_TopText&gt;from\n&gt; SnowfireL@... included below]\n&gt;\n&gt; Here is a short file, where someone says, &quot;Scamp, Scamp,&quot; then Scamp barks.\n&gt; &quot;yap.&quot;  This little dog belonged to my grandma, when I was about 9 or 10\n&gt; years old, he was a Manchester Terrier, and lived with us for many years,\n&gt; and this is his bark for sure.  I&#39;d know that bark anywhere.  Sorry, that I\n&gt; can&#39;t make it any clearer, I need to get one of those better ghost boxes I\n&gt; guess.  RJ, spirits are just like us, they are not omnipresent like\n&gt; God,  probably why David doesn&#39;t want to play the guessing game, he has\n&gt; better things to do over there, and has said, they have thousands of people\n&gt; standing in this long line waiting to get into the Heavens, and He can&#39;t\n&gt; just drop His job and go to your house to see what you have over there, He\n&gt; did tell me that first time what it was, and i sent it to you, but it was\n&gt; too late.  It&#39;s hard for me to understand them sometimes, He was also right\n&gt; about that little boy, Syler being killed, and where his body would be\n&gt; found, I don&#39;t know what they did about it though. sf\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; \n&gt;\n\nYeah I know, science no accep anecdo es. The e is plen y o ha d e idence, ouble, science don' accep ha ei he cuz hey a e augh , no spi i s, so he e a e no sp i oices, ac is ac is ac s. Well ha 's abou all he e is in his ield. Pe haps you should ake bi d wa ching o some hing conc e e. To no accep wha o he s say is he same as calling us all lia s, and I ind e y insul ing. \n\n \n How i a ional is i o igno e all e idence and con inuously y o i he phenomon in o a di in ion whe e i will no i and does no belong, and hen claim you' e looking o a mo e a ional explan a ion, i jus does no make sense. I say o ge he BS \"science\" wha e e ha is, pu s ou and y hinking on you own.  M Spock was a ic ional cha ac o !\n\n \n F-S\n \n \nOn Sun, Aug 22, 2010 a 7:20 AM, Rj as e e @...> w o e:\n\n  \n\n\n\n\n\n\n\nExpe imen al da a in con olled condi ions, and pe sonal anecdo es, a e no he same hing, \n--- On Sun, 8/22/10, F ank Sump ion pu plealiengi l@...> w o e:\n\nF om: F ank Sump ion pu plealiengi l@...>Subjec : Re: [EVP-ITC] Scamp,To: EVP-ITC@yahoog oups.com\nDa e: Sunday, Augus 22, 2010, 12:21 AM \n\n  \n\n\n I you comple ely igno e wha e e yone else in he whole wide eaking wo ld ge s ia EVP, a ious pho og aphy and ITC me hods, and jus chance encoun e s, hen yeah, you p obably don' ha e any da a, and won' ha e any da a no ma e wha . \n\n \nF-S\nOn Sa , Aug 21, 2010 a 3:42 PM, Rick Weg zyn ickweg zyn@...> w o e:\n\n  \n\n\n\n\n\nHey RJ,I hink we need o go o he ceme a y and see wha you ge he e....\n\n\n\nF om: Rj as e e @yahoo.com> \nTo: EVP-ITC@yahoog oups.comSen : Sa , Augus 21, 2010 2:29:36 PM \nSubjec : Re: [EVP-ITC] Scamp,\n  \n\n\n\n\n\nI don' hink I ha e enough da a ye o make any conclusions, so I plan mo e expe imen s.  Since he e a e di e en dis inc claims abou wha he box o he eco de s can do, I y o make di e en dis inc expe imen s o each.\nSome people claim hey can ge he box o ell hem hings ha he ope a o couldn' know, so my \"wha s he objec \" expe imen is one way o examine ha .  Some people claim he boxes can make p edic ions, so ca aloging p edic ions and examining he esul s can help examine ha .  I he e a e o he claims, I will y o igu e expe imen s based on hose.\n--- On Sa , 8/21/10, F ank Sump ion pu plealiengi l@...> w o e:\nF om: F ank Sump ion pu plealiengi l@...>Subjec : Re: [EVP-ITC] Scamp,\nTo: EVP-ITC@...mDa e: Sa u day, Augus 21, 2010, 12:48 PM\n  \n\n\n I ge ou las dogs om ime o ime, and used o ge hem ia whi e noise when I i s s a ed his. Las summe some kids came down in o he basemen wih he younge g andson, and he li le yo kie ba ked, bu \"ge ou a he e\" came ou , some how. \n\n \n Yeah, I hink I was oo ha d on RJ. I don' know why, bu es ing doens' seem o wo k, bu we ge enough o p o e his o ou sel es. I 's p obably a ai h hing, al hough I'm no eligious, e en an i- eligion.  \n\n \n F-S\n \n \nOn F i, Aug 20, 2010 a 6:27 PM, Snow i eL@...> w o e:\n\n  \n\n\n[A achmen (s) om Snow i eL@... included below] \n\nHe e is a sho ile, whe e someone says, \"Scamp, Scamp,\" hen Scamp ba ks. \"yap.\"  This li le dog belonged o my g andma, when I was abou 9 o 10 yea s old, he was a Manches e Te ie , and li ed wi h us o many yea s, and his is his ba k o su e.  I'd know ha ba k anywhe e.  So y, ha I can' make i any clea e , I need o ge one o hose be e ghos boxes I guess.  RJ, spi i s a e jus like us, hey a e no omnip esen like God,  p obably why Da id doesn' wan o play he guessing game, he has be e hings o do o e he e, and has said, hey ha e housands o people s anding in his long line wai ing o ge in o he Hea ens, and He can' jus d op His job and go o you house o see wha you ha e o e he e, He did ell me ha i s ime wha i was, and i sen i o you, bu i was oo la e.  I 's ha d o me o unde s and hem some imes, He was also igh abou ha li le boy, Syle being killed, and whe e his body would be ound, I don' know wha hey did abou i hough. s"}