{"id": "18569", "subject": "Re: [EVP-ITC] Nope, no eividence here!", "author": "Frank Sumption", "timestamp": "2010-08-22T22:15:38Z", "full_text": "Just try listening to the gibberish for awhile, see if sense emerges from\nthe chaos. When I tried my frist linear sweep system all I heard was\ngibberish, then all the sudden I could hear them. I think the problem is all\nyou.\n\n F-S\n\nOn Sun, Aug 22, 2010 at 4:05 PM, Rj &lt;rasterer@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;   Since all I hear is gibberish, and since interpreting such gibberish is\n&gt; subjective, and can be influenced by telling people what they are supposed\n&gt; to hear first, I would agree this kind of test is poor evidence.\n&gt;\n&gt; --- On *Sun, 8/22/10, Frank Sumption &lt;purplealiengirl@...&gt;* wrote:\n&gt;\n&gt;\n&gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt; Subject: [EVP-ITC] Nope, no eividence here! [2 Attachments]\n&gt; To: evp-itc@yahoogroups.com\n&gt; Date: Sunday, August 22, 2010, 2:31 PM\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;  Nope, no evidencee, totally insignificant that a ghost box says &quot;ghost\n&gt; box&quot;, must be anecdotal imaginary hallucinations caused by supplying oxygen\n&gt; to a living brain stem. It must only count as evidence if the researcher has\n&gt; multiple degrees in BSology--and I smile as I type that!\n&gt;\n&gt;  F-S\n&gt;\n&gt;\n&gt; \n&gt;\n\nJus y lis ening o he gibbe ish o awhile, see i sense eme ges om he chaos. When I ied my is linea sweep sys em all I hea d was gibbe ish, hen all he sudden I could hea hem. I hink he p oblem is all you.\n\n \n F-S\nOn Sun, Aug 22, 2010 a 4:05 PM, Rj as e e @...> w o e:\n\n  \n\n\n\n\n\n\n\nSince all I hea is gibbe ish, and since in e p e ing such gibbe ish is subjec i e, and can be in luenced by elling people wha hey a e supposed o hea i s , I would ag ee his kind o es is poo e idence.\n--- On Sun, 8/22/10, F ank Sump ion pu plealiengi l@...> w o e:\nF om: F ank Sump ion pu plealiengi l@...>Subjec : [EVP-ITC] Nope, no ei idence he e! [2 A achmen s]\nTo: e p-i c@yahoog oups.comDa e: Sunday, Augus 22, 2010, 2:31 PM \n\n  \n\n\n Nope, no e idencee, o ally insigni ican ha a ghos box says \"ghos box\", mus be anecdo al imagina y hallucina ions caused by supplying oxygen o a li ing b ain s em. I mus only coun as e idence i he esea che has mul iple deg ees in BSology--and I smile as I ype ha ! \n\n \n F-S"}