{"id": "18574", "subject": "Re: Nope, no eividence here!", "author": "rasterer", "timestamp": "2010-08-22T22:34:14Z", "full_text": "For me, the question is not whether sense will emerge: it will.  Just like when looking at the randomness clouds eventually will emerge pictures.\n\nFor me, the question is where is that sense coming from: inside me, my brain? Or some entity?  \n\nMy problem is that many of the results people post are ambiguous.  While they could be from spirits, I can not find anything about them that  rules out just the operator&#39;s brain.\n\nAnd so I try to listen to the specific claims people make about the box and what it can reveal. And I try to construct my experiments to see if I can rule out the brain, leaving the spirits.\n\nWhy is that so awful?\n\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  Just try listening to the gibberish for awhile, see if sense emerges from\n&gt; the chaos. When I tried my frist linear sweep system all I heard was\n&gt; gibberish, then all the sudden I could hear them. I think the problem is all\n&gt; you.\n&gt; \n&gt;  F-S\n&gt; \n&gt; On Sun, Aug 22, 2010 at 4:05 PM, Rj &lt;rasterer@...&gt; wrote:\n&gt; \n&gt; &gt;\n&gt; &gt;\n&gt; &gt;   Since all I hear is gibberish, and since interpreting such gibberish is\n&gt; &gt; subjective, and can be influenced by telling people what they are supposed\n&gt; &gt; to hear first, I would agree this kind of test is poor evidence.\n&gt; &gt;\n&gt; &gt; --- On *Sun, 8/22/10, Frank Sumption &lt;purplealiengirl@...&gt;* wrote:\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt; &gt; Subject: [EVP-ITC] Nope, no eividence here! [2 Attachments]\n&gt; &gt; To: evp-itc@yahoogroups.com\n&gt; &gt; Date: Sunday, August 22, 2010, 2:31 PM\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;  Nope, no evidencee, totally insignificant that a ghost box says &quot;ghost\n&gt; &gt; box&quot;, must be anecdotal imaginary hallucinations caused by supplying oxygen\n&gt; &gt; to a living brain stem. It must only count as evidence if the researcher has\n&gt; &gt; multiple degrees in BSology--and I smile as I type that!\n&gt; &gt;\n&gt; &gt;  F-S\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; \n&gt; &gt;\n&gt;"}