{"id": "18575", "subject": "Re: [EVP-ITC] Re: Nope, no eividence here!", "author": "Frank Sumption", "timestamp": "2010-08-22T22:52:08Z", "full_text": "You don&#39;t understand, those cloud images are sometimes more than some\nretarded imagination. Same as the voices the rest of us hear. If you are so\nsure it&#39;s all hallucinatory, why do you bother us with the brainiac BS.\n\n You have voices that cuss and swear over these boxes, many can hear it, but\nthat still is not good enough, it&#39;s still ignoring all evidence, and no\neividence is good enough.\nThe entites are not going to kiss your ass. It is of no consequence if you\nbelieve in it or not, except to you.\n\n This is a cloud image, it is a representation of the coming comet. A moron\ncan see it, so don&#39;t sit there all smug an tell me it&#39;s imagination and\nworthless. The skeptics want to make everyone afraid to look up, they want\nus all afraid and controlled.\n\n Brain or outside, personally I don&#39;t care! It&#39;s the message that matters.\n Stop being so fearful, and imagine something else exists wihtout science&#39;s\npersmission.\n\n F-S\nOn Sun, Aug 22, 2010 at 4:34 PM, rasterer &lt;rasterer@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;\n&gt; For me, the question is not whether sense will emerge: it will. Just like\n&gt; when looking at the randomness clouds eventually will emerge pictures.\n&gt;\n&gt; For me, the question is where is that sense coming from: inside me, my\n&gt; brain? Or some entity?\n&gt;\n&gt; My problem is that many of the results people post are ambiguous. While\n&gt; they could be from spirits, I can not find anything about them that rules\n&gt; out just the operator&#39;s brain.\n&gt;\n&gt; And so I try to listen to the specific claims people make about the box and\n&gt; what it can reveal. And I try to construct my experiments to see if I can\n&gt; rule out the brain, leaving the spirits.\n&gt;\n&gt; Why is that so awful?\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Frank Sumption\n&gt; &lt;purplealiengirl@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Just try listening to the gibberish for awhile, see if sense emerges from\n&gt; &gt; the chaos. When I tried my frist linear sweep system all I heard was\n&gt; &gt; gibberish, then all the sudden I could hear them. I think the problem is\n&gt; all\n&gt; &gt; you.\n&gt; &gt;\n&gt; &gt; F-S\n&gt; &gt;\n&gt; &gt; On Sun, Aug 22, 2010 at 4:05 PM, Rj &lt;rasterer@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; Since all I hear is gibberish, and since interpreting such gibberish is\n&gt; &gt; &gt; subjective, and can be influenced by telling people what they are\n&gt; supposed\n&gt; &gt; &gt; to hear first, I would agree this kind of test is poor evidence.\n&gt; &gt; &gt;\n&gt; &gt; &gt; --- On *Sun, 8/22/10, Frank Sumption &lt;purplealiengirl@...&gt;* wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt;\n&gt; &gt; &gt; Subject: [EVP-ITC] Nope, no eividence here! [2 Attachments]\n&gt; &gt; &gt; To: evp-itc@yahoogroups.com &lt;evp-itc%40yahoogroups.com&gt;\n&gt; &gt; &gt; Date: Sunday, August 22, 2010, 2:31 PM\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; Nope, no evidencee, totally insignificant that a ghost box says &quot;ghost\n&gt; &gt; &gt; box&quot;, must be anecdotal imaginary hallucinations caused by supplying\n&gt; oxygen\n&gt; &gt; &gt; to a living brain stem. It must only count as evidence if the\n&gt; researcher has\n&gt; &gt; &gt; multiple degrees in BSology--and I smile as I type that!\n&gt; &gt; &gt;\n&gt; &gt; &gt; F-S\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nYou don' unde s and, hose cloud images a e some imes mo e han some e a ded imagina ion. Same as he oices he es o us hea . I you a e so su e i 's all hallucina o y, why do you bo he us wi h he b ainiac BS.\n\n \n You ha e oices ha cuss and swea o e hese boxes, many can hea i , bu ha s ill is no good enough, i 's s ill igno ing all e idence, and no ei idence is good enough. The en i es a e no going o kiss you ass. I is o no consequence i you belie e in i o no , excep o you. \n\n \n This is a cloud image, i is a ep esen a ion o he coming come . A mo on can see i , so don' si he e all smug an ell me i 's imagina ion and wo hless. The skep ics wan o make e e yone a aid o look up,  hey wan us all a aid and con olled. \n\n \n B ain o ou side, pe sonally I don' ca e! I 's he message ha ma e s.  S op being so ea ul, and imagine some hing else exis s wih ou science's pe smission. \n \n F-S\nOn Sun, Aug 22, 2010 a 4:34 PM, as e e as e e @...> w o e:\n\n  \n\n\n\nFo me, he ques ion is no whe he sense will eme ge: i will. Jus like when looking a he andomness clouds e en ually will eme ge pic u es.Fo me, he ques ion is whe e is ha sense coming om: inside me, my b ain? O some en i y? \nMy p oblem is ha many o he esul s people pos a e ambiguous. While hey could be om spi i s, I can no ind any hing abou hem ha ules ou jus he ope a o 's b ain.And so I y o lis en o he speci ic claims people make abou he box and wha i can e eal. And I y o cons uc my expe imen s o see i I can ule ou he b ain, lea ing he spi i s.\nWhy is ha so aw ul? \n--- In EVP-ITC@yahoog oups.com, F ank Sump ion w o e:>> Jus y lis ening o he gibbe ish o awhile, see i sense eme ges om\n> he chaos. When I ied my is linea sweep sys em all I hea d was> gibbe ish, hen all he sudden I could hea hem. I hink he p oblem is all> you.> > F-S> \n> On Sun, Aug 22, 2010 a 4:05 PM, Rj w o e:> > >> >> > Since all I hea is gibbe ish, and since in e p e ing such gibbe ish is> > subjec i e, and can be in luenced by elling people wha hey a e supposed\n> > o hea i s , I would ag ee his kind o es is poo e idence.> >> > --- On *Sun, 8/22/10, F ank Sump ion * w o e:> >> >> > F om: F ank Sump ion \n> > Subjec : [EVP-ITC] Nope, no ei idence he e! [2 A achmen s]> > To: e p-i c@yahoog oups.com> > Da e: Sunday, Augus 22, 2010, 2:31 PM\n> >> >> >> >> > Nope, no e idencee, o ally insigni ican ha a ghos box says \"ghos > > box\", mus be anecdo al imagina y hallucina ions caused by supplying oxygen\n> > o a li ing b ain s em. I mus only coun as e idence i he esea che has> > mul iple deg ees in BSology--and I smile as I ype ha !> >> > F-S> >> >> > \n> >>"}