{"id": "18594", "subject": "Re: [EVP-ITC] Scamp,", "author": "Frank Sumption", "timestamp": "2010-08-23T16:59:41Z", "full_text": "I suggest you go do that somewhere else. It&#39;s very, very obvious that\nnothing will qualify for &quot;data&quot; in your mind. We don&#39;t need a Mr Spock poser\nhere. This circular BS is going to come to a sqreaching halt. You can&#39;t\ntest, can&#39;t hear, can&#39;t see, and won&#39;t accept anyone else&#39;s &quot;stories&quot;, it&#39;s\npure BS and you know it!\n\n F-S\n\nOn Mon, Aug 23, 2010 at 10:50 AM, Rj &lt;rasterer@yahoo.com&gt; wrote:\n\n&gt;\n&gt;\n&gt;   I&#39;ll accept any other data, that was created in a well controlled\n&gt; environment.\n&gt; Stories are interesting. But do not really qualify as that.\n&gt;\n&gt;\n&gt;\n&gt; --- On *Mon, 8/23/10, Frank Sumption &lt;purplealiengirl@...&gt;* wrote:\n&gt;\n&gt;\n&gt; From: Frank Sumption &lt;purplealiengirl@gmail.com&gt;\n&gt; Subject: Re: [EVP-ITC] Scamp,\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Monday, August 23, 2010, 9:13 AM\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Third person---creeeeeepy! How can you test anything if you can&#39;t gather\n&gt; data yourself and will not accept any other data? (aka evidence)\n&gt;\n&gt; F-S\n&gt;\n&gt; On Mon, Aug 23, 2010 at 9:24 AM, Rj &lt;rasterer@...&lt;http://mc/compose?to=rasterer@...&gt;\n&gt; &gt; wrote:\n&gt;\n&gt;\n&gt;\n&gt;   RJ&#39;s experiments are to collect data so I can form  conclusions based on\n&gt; objective results.  That may prove some theories true, or prove some\n&gt; theories false.  Or show some theories are simply not testable. That is not\n&gt; debunking.\n&gt;\n&gt; Read the groups main page for how Frank describes the group: &quot;I invite\n&gt; anyone interested to join. I am not really scientific, I just take the\n&gt; approach, try different methods, see what works. I go on the results I get&quot;\n&gt;\n&gt; It doesn&#39;t say &quot;Only for those who believe what we do&quot;.\n&gt;\n&gt;\n&gt; --- On *Mon, 8/23/10, Fransen, Debbie &lt;debbie.fransen@delta.com&lt;http://mc/compose?to=debbie.fransen@...&gt;\n&gt; &gt;* wrote:\n&gt;\n&gt;\n&gt; From: Fransen, Debbie &lt;debbie.fransen@...&lt;http://mc/compose?to=debbie.fransen@...&gt;\n&gt; &gt;\n&gt; Subject: RE: [EVP-ITC] Scamp,\n&gt; To: &quot;&#39;EVP-ITC@yahoogroups.com&lt;http://mc/compose?to=EVP-ITC@yahoogroups.com&gt;&#39;&quot;\n&gt; &lt;EVP-ITC@yahoogroups.com &lt;http://mc/compose?to=EVP-ITC@yahoogroups.com&gt;&gt;\n&gt; Date: Monday, August 23, 2010, 8:16 AM\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; R U Kidding me ?\n&gt; This is Frank&#39;s group and I am here to learn how to make the boxes and talk\n&gt; amongst other people\n&gt; with boxes about what we get... we are not here to listen to people who\n&gt; don&#39;t believe in what we are\n&gt; doing or trying to do.... If you don&#39;t have a box to work with or listen\n&gt; to, how can you be skeptical about\n&gt; what someone hears regardless of whether they write out what they hear or\n&gt; not? Alot of times we don&#39;t hear\n&gt; the same things ,so it is ridiculous for people to believe it&#39;s the power\n&gt; of suggestion.\n&gt; RJ&#39;s experiments are to disprove for his own personal reasons, not to help\n&gt; this group in any way.\n&gt; So, why don&#39;t you skeptical people and the ones who want to try different\n&gt; methods and any other personal\n&gt; ideas that you have, start your own group?  This is Frank&#39;s group......\n&gt; I personally want to see what Frank and Steve come up with and that&#39;s why\n&gt; MOST of us are here....\n&gt; not to criticize them..or try to do experiments disproving anything....\n&gt;\n&gt;  ------------------------------\n&gt; *From:* EVP-ITC@yahoogroups.com&lt;http://mc/compose?to=EVP-ITC@yahoogroups.com&gt;[mailto:\n&gt; EVP-ITC@yahoogroups.com &lt;http://mc/compose?to=EVP-ITC@yahoogroups.com&gt;] *On\n&gt; Behalf Of *Salvi\n&gt; *Sent:* Monday, August 23, 2010 8:21 AM\n&gt; *To:* EVP-ITC@yahoogroups.com&lt;http://mc/compose?to=EVP-ITC@yahoogroups.com&gt;\n&gt; *Subject:* AW: [EVP-ITC] Scamp,\n&gt;\n&gt;\n&gt;\n&gt; if frank will end that project here, then you (or we all) have the\n&gt; possibility to open another yahoo group and we can continue\n&gt; to discussing. in a group all members must have the opportunity to write\n&gt; his ideas and, if someone like RJ (or some others,\n&gt; maybe like me) tend to other types of ideas and try to point to other\n&gt; prespectives, what is here wrong?\n&gt;\n&gt; we must be prepared to all evidences, also evidences that are not\n&gt; convenient to our personal ideas but\n&gt; maybe we can learn something more and we can change our point of view.\n&gt; think about that.\n&gt;\n&gt; i try to reach the goal of the &quot;voices&quot; with a sceptict mind, but i am\n&gt; experimenting with many differente methods to hopefully\n&gt; reach maybe one day something more convincing.\n&gt;\n&gt;  ------------------------------\n&gt; *Von:* EVP-ITC@yahoogroups.com&lt;http://mc/compose?to=EVP-ITC@yahoogroups.com&gt;[mailto:\n&gt; EVP-ITC@yahoogroups.com &lt;http://mc/compose?to=EVP-ITC@yahoogroups.com&gt;] *Im\n&gt; Auftrag von *Fransen, Debbie\n&gt; *Gesendet:* Montag, 23. August 2010 14:04\n&gt; *An:* &#39;EVP-ITC@yahoogroups.com&lt;http://mc/compose?to=EVP-ITC@yahoogroups.com&gt;\n&gt; &#39;\n&gt; *Betreff:* RE: [EVP-ITC] Scamp,\n&gt;\n&gt;\n&gt;\n&gt; I am  worried that he is going to push Frank to far and Frank will not be\n&gt; here anymore\n&gt; THAT IS WHAT I AM AFRAID OF... And he is the most important person here.\n&gt; It&#39;s his group....and if he gets mad enough he will end it, and then what ?\n&gt;\n&gt;  ------------------------------\n&gt; *From:* EVP-ITC@yahoogroups.com&lt;http://mc/compose?to=EVP-ITC@yahoogroups.com&gt;[mailto:\n&gt; EVP-ITC@yahoogroups.com &lt;http://mc/compose?to=EVP-ITC@yahoogroups.com&gt;] *On\n&gt; Behalf Of *Salvi\n&gt; *Sent:* Monday, August 23, 2010 7:44 AM\n&gt; *To:* EVP-ITC@yahoogroups.com&lt;http://mc/compose?to=EVP-ITC@yahoogroups.com&gt;\n&gt; *Subject:* AW: [EVP-ITC] Scamp,\n&gt;\n&gt;\n&gt;\n&gt; i hope that RJ stay for a long time here because i like its methods and his\n&gt; ideas.\n&gt; if you dont like read his mails, then lets swing the delete key on your\n&gt; keyboard.\n&gt; leave him write his ideas, because others (like me) want to continue to\n&gt; read.\n&gt;\n&gt;  ------------------------------\n&gt; *Von:* EVP-ITC@yahoogroups.com&lt;http://mc/compose?to=EVP-ITC@yahoogroups.com&gt;[mailto:\n&gt; EVP-ITC@yahoogroups.com &lt;http://mc/compose?to=EVP-ITC@yahoogroups.com&gt;] *Im\n&gt; Auftrag von *Fransen, Debbie\n&gt; *Gesendet:* Montag, 23. August 2010 13:25\n&gt; *An:* &#39;EVP-ITC@yahoogroups.com&lt;http://mc/compose?to=EVP-ITC@yahoogroups.com&gt;\n&gt; &#39;\n&gt; *Betreff:* RE: [EVP-ITC] Scamp,\n&gt;\n&gt;\n&gt;\n&gt; RJ, it is very obvious that you are not here for the same reasons we are.\n&gt; We are trying to prove something we know, and\n&gt; you are trying to disprove it .\n&gt; Why don&#39;t we all just ignore him from now on and not reply to anything he\n&gt; says and maybe he will go away.....\n&gt; Bye RJ. You are just not in the group that you need to be in....\n&gt;\n&gt;\n&gt;  ------------------------------\n&gt; *From:* EVP-ITC@yahoogroups.com&lt;http://mc/compose?to=EVP-ITC@yahoogroups.com&gt;[mailto:\n&gt; EVP-ITC@yahoogroups.com &lt;http://mc/compose?to=EVP-ITC@yahoogroups.com&gt;] *On\n&gt; Behalf Of *Rj\n&gt; *Sent:* Sunday, August 22, 2010 6:17 PM\n&gt; *To:* EVP-ITC@yahoogroups.com&lt;http://mc/compose?to=EVP-ITC@yahoogroups.com&gt;\n&gt; *Subject:* Re: [EVP-ITC] Scamp,\n&gt;\n&gt;\n&gt;\n&gt;   I realize you have plenty of subjective anecdotal evidence.I don&#39;t\n&gt; consider that &#39;hard evidence&#39; however.  I am looking for something a little\n&gt; more objective and less subject to influence and interpretations.\n&gt;\n&gt; And stop putting words in my mouth. A person can misinterpret something,\n&gt; mistake something, or confuse something, without lying about something.  And\n&gt; before you jump down my throat claiming I am saying all results are\n&gt; mistakes, I am not.  I am performing experiments, keeping an open mind, and\n&gt; considering all evidence I find.\n&gt;\n&gt; The way you have been attacking me by calling me names at every turn, just\n&gt; because I try new things and don&#39;t always agree with your world view, is\n&gt; eerily reminiscent of the way the church of old tried to suppress new\n&gt; thought and discoveries, except you&#39;re just substituting the word &#39;heretic&#39;\n&gt; with &#39;science&#39;. and &#39;blasphemy&#39; with anything that disagrees with you.\n&gt;\n&gt; There&#39;s an old saying:  &quot;We become that which we hate&quot;.  So far, all you&#39;ve\n&gt; done is denounce people&#39;s efforts to try new methods and see what works.\n&gt; You accept nothing anyone else proposes if it does not agree with you.  That\n&gt; is the realm of the extreme skeptic: the same skeptic you ridicule.\n&gt;\n&gt; You certainly don&#39;t have to agree with my comments.  And I don&#39;t have to\n&gt; agree with yours.  But no one needs all the name calling Frank.   It really\n&gt; adds nothing to support your theories.\n&gt;\n&gt;\n&gt;\n&gt; --- On *Sun, 8/22/10, Frank Sumption &lt;purplealiengirl@...&lt;http://mc/compose?to=purplealiengirl@gmail.com&gt;\n&gt; &gt;* wrote:\n&gt;\n&gt;\n&gt; From: Frank Sumption &lt;purplealiengirl@...&lt;http://mc/compose?to=purplealiengirl@...&gt;\n&gt; &gt;\n&gt; Subject: Re: [EVP-ITC] Scamp,\n&gt; To: EVP-ITC@yahoogroups.com &lt;http://mc/compose?to=EVP-ITC@yahoogroups.com&gt;\n&gt; Date: Sunday, August 22, 2010, 2:15 PM\n&gt;\n&gt;\n&gt;\n&gt;  Yeah I know, science no accept anecdotes. There is plenty of hard\n&gt; evidence, trouble, science don&#39;t accept that either cuz they are taught, no\n&gt; spirits, so there are no sprit voices, fact is fact is facts. Well that&#39;s\n&gt; about all there is in this field. Perhaps you should take bird watching or\n&gt; something concrete. To not accept what others say is the same as calling us\n&gt; all liars, and I find very insulting.\n&gt;\n&gt;  How irrational is it to ignore all evidence and continuously try to fit\n&gt; the phenomon into a diffintion where it will not fit and does not belong,\n&gt; and then claim you&#39;re looking for a more rational explantation, it just does\n&gt; not make sense. I say forget the BS &quot;science&quot; whatever that is, puts out and\n&gt; try thinking on your own.  Mr Spock was a fictional charactor!\n&gt;\n&gt;  F-S\n&gt;\n&gt;\n&gt;\n&gt; On Sun, Aug 22, 2010 at 7:20 AM, Rj &lt;rasterer@...&gt; wrote:\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Experimental data in controlled conditions, and personal anecdotes, are not\n&gt; the same thing,\n&gt;\n&gt;\n&gt;\n&gt; --- On *Sun, 8/22/10, Frank Sumption &lt;purplealiengirl@...&gt;* wrote:\n&gt;\n&gt;\n&gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt; Subject: Re: [EVP-ITC] Scamp,\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Sunday, August 22, 2010, 12:21 AM\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;  If you completely ignore what everyone else in the whole wide freaking\n&gt; world gets via EVP, various photography and ITC methods, and just chance\n&gt; encounters, then yeah, you probably don&#39;t have any data, and won&#39;t have any\n&gt; data no matter what.\n&gt;\n&gt; F-S\n&gt;\n&gt; On Sat, Aug 21, 2010 at 3:42 PM, Rick Wegrzyn &lt;rickwegrzyn@...&lt;http://mc/compose?to=rickwegrzyn@...&gt;\n&gt; &gt; wrote:\n&gt;\n&gt;\n&gt;\n&gt;  Hey RJ,I think we need to go to the cemetary and see what you get\n&gt; there....\n&gt;\n&gt;  ------------------------------\n&gt; *From:* Rj &lt;rasterer@... &lt;http://mc/compose?to=rasterer@...&gt;&gt;\n&gt;\n&gt; *To:* EVP-ITC@yahoogroups.com&lt;http://mc/compose?to=EVP-ITC@yahoogroups.com&gt;\n&gt; *Sent:* Sat, August 21, 2010 2:29:36 PM\n&gt;\n&gt; *Subject:* Re: [EVP-ITC] Scamp,\n&gt;\n&gt;\n&gt;\n&gt;   I don&#39;t think I have enough data yet to make any conclusions, so I plan\n&gt; more experiments.  Since there are different distinct claims about what the\n&gt; box or the recorders can do, I try to make different distinct experiments\n&gt; for each.\n&gt;\n&gt; Some people claim they can get the box to tell them things that the\n&gt; operator couldn&#39;t know, so my &quot;whats the object&quot; experiment is one way to\n&gt; examine that.  Some people claim the boxes can make predictions, so\n&gt; cataloging predictions and examining the results can help examine that.  If\n&gt; there are other claims, I will try to figure experiments based on those.\n&gt;\n&gt; --- On *Sat, 8/21/10, Frank Sumption &lt;purplealiengirl@...&lt;http://mc/compose?to=purplealiengirl@...&gt;\n&gt; &gt;* wrote:\n&gt;\n&gt;\n&gt; From: Frank Sumption &lt;purplealiengirl@...&lt;http://mc/compose?to=purplealiengirl@...&gt;\n&gt; &gt;\n&gt; Subject: Re: [EVP-ITC] Scamp,\n&gt; To: EVP-ITC@yahoogroups.com &lt;http://mc/compose?to=EVP-ITC@yahoogroups.com&gt;\n&gt; Date: Saturday, August 21, 2010, 12:48 PM\n&gt;\n&gt;\n&gt;\n&gt;  I get our last dogs from time to time, and used to get them via white\n&gt; noise when I first started this. Last summer some kids came down into the\n&gt; basement wiht the younger grandson, and the little yorkie barked, but &quot;get\n&gt; outta here&quot; came out, some how.\n&gt;\n&gt;  Yeah, I think I was too hard on RJ. I don&#39;t know why, but testing doens&#39;t\n&gt; seem to work, but we get enough to prove this to ourselves. It&#39;s probably a\n&gt; faith thing, although I&#39;m not religious, even anti-religion.\n&gt;\n&gt;  F-S\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; On Fri, Aug 20, 2010 at 6:27 PM, &lt;SnowfireL@aol.com&gt; wrote:\n&gt;\n&gt;\n&gt;  [Attachment(s)&lt;https://mail.google.com/mail/?ui=2&view=js&name=main,tlist&ver=9oD1J7yvz5o.en.&am=%21xONyw1plirqxhZ4a1PIWg1xlTveuJ8oWIzqJ6mz0Dt83ht4Zrp4&fri#12a920b21a6295da_TopText&gt;from\n&gt; SnowfireL@... included below]\n&gt;\n&gt; Here is a short file, where someone says, &quot;Scamp, Scamp,&quot; then Scamp barks.\n&gt; &quot;yap.&quot;  This little dog belonged to my grandma, when I was about 9 or 10\n&gt; years old, he was a Manchester Terrier, and lived with us for many years,\n&gt; and this is his bark for sure.  I&#39;d know that bark anywhere.  Sorry, that I\n&gt; can&#39;t make it any clearer, I need to get one of those better ghost boxes I\n&gt; guess.  RJ, spirits are just like us, they are not omnipresent like\n&gt; God,  probably why David doesn&#39;t want to play the guessing game, he has\n&gt; better things to do over there, and has said, they have thousands of people\n&gt; standing in this long line waiting to get into the Heavens, and He can&#39;t\n&gt; just drop His job and go to your house to see what you have over there, He\n&gt; did tell me that first time what it was, and i sent it to you, but it was\n&gt; too late.  It&#39;s hard for me to understand them sometimes, He was also right\n&gt; about that little boy, Syler being killed, and where his body would be\n&gt; found, I don&#39;t know what they did about it though. sf\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; \n&gt;\n\nI sugges you go do ha somewhe e else. I 's e y, e y ob ious ha no hing will quali y o \"da a\" in you mind. We don' need a M Spock pose he e. This ci cula BS is going o come o a sq eaching hal . You can' es , can' hea , can' see, and won' accep anyone else's \"s o ies\", i 's pu e BS and you know i !\n\n \n F-S\nOn Mon, Aug 23, 2010 a 10:50 AM, Rj as e e @...> w o e:\n\n  \n\n\n\n\n\n\n\nI'll accep any o he da a, ha was c ea ed in a well con olled en i onmen .S o ies a e in e es ing. Bu do no eally quali y as ha . \n--- On Mon, 8/23/10, F ank Sump ion pu plealiengi l@...> w o e:\n\nF om: F ank Sump ion pu plealiengi l@gmail.com>Subjec : Re: [EVP-ITC] Scamp,To: EVP-ITC@yahoog oups.com\nDa e: Monday, Augus 23, 2010, 9:13 AM \n\n\n\n  \n\n\nThi d pe son---c eeeeeepy! How can you es any hing i you can' ga he da a you sel and will no accep any o he da a? (aka e idence)\n \nF-S\nOn Mon, Aug 23, 2010 a 9:24 AM, Rj as e e @...> w o e:\n\n  \n\n\n\n\n\n\n\nRJ's expe imen s a e o collec da a so I can o m  conclusions based on objec i e esul s.  Tha may p o e some heo ies ue, o p o e some heo ies alse.  O show some heo ies a e simply no es able. Tha is no debunking. \nRead he g oups main page o how F ank desc ibes he g oup: \"I in i e anyone in e es ed o join. I am no eally scien i ic, I jus ake he app oach, y di e en me hods, see wha wo ks. I go on he esul s I ge \"\nI doesn' say \"Only o hose who belie e wha we do\".--- On Mon, 8/23/10, F ansen, Debbie debbie. ansen@...> w o e:\n\nF om: F ansen, Debbie debbie. ansen@...>Subjec : RE: [EVP-ITC] Scamp,\nTo: \"'EVP-ITC@yahoog oups.com'\" EVP-ITC@yahoog oups.com>\nDa e: Monday, Augus 23, 2010, 8:16 AM \n\n\n\n  \n\n\nR U Kidding me ?\nThis is F ank's g oup and I am he e o lea n how o make he boxes and alk amongs o he people\nwi h boxes abou wha we ge ... we a e no he e o lis en o people who don' belie e in wha we a e\ndoing o ying o do.... I you don' ha e a box o wo k wi h o lis en o, how can you be skep ical abou \nwha someone hea s ega dless o whe he hey w i e ou wha hey hea o no ? Alo o imes we don' hea \n he same hings ,so i is idiculous o people o belie e i 's he powe o sugges ion.\nRJ's expe imen s a e o disp o e o his own pe sonal easons, no o help his g oup in any way.\nSo, why don' you skep ical people and he ones who wan o y di e en me hods and any o he pe sonal\nideas ha you ha e, s a you own g oup?  This is F ank's g oup......\nI pe sonally wan o see wha F ank and S e e come up wi h and ha 's why MOST o us a e he e....\nno o c i icize hem..o y o do expe imen s disp o ing any hing....\n\n\nF om: EVP-ITC@yahoog oups.com [mail o:EVP-ITC@yahoog oups.com] On Behal O Sal i\nSen : Monday, Augus 23, 2010 8:21 AMTo: EVP-ITC@yahoog oups.comSubjec : AW: [EVP-ITC] Scamp,\n\n  \n\n\ni ank will end ha p ojec he e,  hen you (o we all) ha e he possibili y o open ano he yahoo g oup and we can con inue \n\n o discussing. in a g oup all membe s mus ha e he oppo uni y o w i e his ideas and, i someone like RJ (o some o he s,\n\nmaybe like me) end o o he ypes o ideas and y o poin   o o he p espec i es, wha is he e w ong?\n \nwe mus be p epa ed o all e idences, also e idences ha  a e no con enien o ou pe sonal ideas bu \nmaybe we can lea n some hing mo e and we can change ou poin o iew. hink abou ha .\n \ni y o each he goal o he \" oices\" wi h a scep ic  mind, bu i am expe imen ing wi h many di e en e me hods o hope ully \n\n each maybe one day some hing mo e con incing.\n\n\nVon: EVP-ITC@yahoog oups.com [mail o:EVP-ITC@yahoog oups.com] Im Au ag on F ansen, Debbie\nGesende : Mon ag, 23. Augus 2010 14:04An: 'EVP-ITC@yahoog oups.com'Be e : RE: [EVP-ITC] Scamp,\n\n  \n\n\nI am  wo ied ha he is going o push F ank o a and F ank will no be he e anymo e\nTHAT IS WHAT I AM AFRAID OF... And he is he mos impo an pe son he e.\nI 's his g oup....and i he ge s mad enough he will end i , and hen wha ?\n\n\nF om: EVP-ITC@yahoog oups.com [mail o:EVP-ITC@yahoog oups.com] On Behal O Sal i\nSen : Monday, Augus 23, 2010 7:44 AMTo: EVP-ITC@yahoog oups.comSubjec : AW: [EVP-ITC] Scamp,\n\n  \n\n\ni hope ha RJ s ay o a long ime he e because i like i s me hods and his ideas.\ni you don like  ead his mails, hen le s swing he dele e key on you keyboa d.\nlea e him w i e his ideas, because o he s (like me) wan o con inue o ead.\n\n\n\nVon: EVP-ITC@yahoog oups.com [mail o:EVP-ITC@yahoog oups.com] Im Au ag on F ansen, Debbie\nGesende : Mon ag, 23. Augus 2010 13:25An: 'EVP-ITC@yahoog oups.com'Be e : RE: [EVP-ITC] Scamp,\n\n  \n\n\nRJ, i is e y ob ious ha you a e no he e o he same easons we a e. We a e ying o p o e some hing we know, and\nyou a e ying o disp o e i .\nWhy don' we all jus igno e him om now on and no eply o any hing he says and maybe he will go away.....\nBye RJ. You a e jus  no in he g oup ha you need o be in....\n \n\n\nF om: EVP-ITC@yahoog oups.com [mail o:EVP-ITC@yahoog oups.com] On Behal O Rj\nSen : Sunday, Augus 22, 2010 6:17 PMTo: EVP-ITC@yahoog oups.comSubjec : Re: [EVP-ITC] Scamp,\n\n  \n\n\n\n\n\nI ealize you ha e plen y o subjec i e anecdo al e idence.I don' conside ha 'ha d e idence' howe e .  I am looking o some hing a li le mo e objec i e and less subjec o in luence and in e p e a ions.\nAnd s op pu ing wo ds in my mou h. A pe son can misin e p e some hing, mis ake some hing, o con use some hing, wi hou lying abou some hing.  And be o e you jump down my h oa claiming I am saying all esul s a e mis akes, I am no .  I am pe o ming expe imen s, keeping an open mind, and conside ing all e idence I ind. \nThe way you ha e been a acking me by calling me names a e e y u n, jus because I y new hings and don' always ag ee wi h you wo ld iew, is ee ily eminiscen o he way he chu ch o old ied o supp ess new hough and disco e ies, excep you' e jus subs i u ing he wo d 'he e ic' wi h 'science'. and 'blasphemy' wi h any hing ha disag ees wi h you.\nThe e's an old saying:  \"We become ha which we ha e\".  So a , all you' e done is denounce people's e o s o y new me hods and see wha wo ks.  You accep no hing anyone else p oposes i i does no ag ee wi h you.  Tha is he ealm o he ex eme skep ic: he same skep ic you idicule.\n You ce ainly don' ha e o ag ee wi h my commen s.  And I don' ha e o ag ee wi h you s.  Bu no one needs all he name calling F ank.   I eally adds no hing o suppo you heo ies.--- On Sun, 8/22/10, F ank Sump ion pu plealiengi l@...> w o e:\n\nF om: F ank Sump ion pu plealiengi l@...m>Subjec : Re: [EVP-ITC] Scamp,\nTo: EVP-ITC@yahoog oups.comDa e: Sunday, Augus 22, 2010, 2:15 PM\n  \n\n\n Yeah I know, science no accep anecdo es. The e is plen y o ha d e idence, ouble, science don' accep ha ei he cuz hey a e augh , no spi i s, so he e a e no sp i oices, ac is ac is ac s. Well ha 's abou all he e is in his ield. Pe haps you should ake bi d wa ching o some hing conc e e. To no accep wha o he s say is he same as calling us all lia s, and I ind e y insul ing. \n\n \n How i a ional is i o igno e all e idence and con inuously y o i he phenomon in o a di in ion whe e i will no i and does no belong, and hen claim you' e looking o a mo e a ional explan a ion, i jus does no make sense. I say o ge he BS \"science\" wha e e ha is, pu s ou and y hinking on you own.  M Spock was a ic ional cha ac o !\n\n \n F-S\n \n \nOn Sun, Aug 22, 2010 a 7:20 AM, Rj as e e @...> w o e:\n\n  \n\n\n\n\n\n\n\nExpe imen al da a in con olled condi ions, and pe sonal anecdo es, a e no he same hing, \n--- On Sun, 8/22/10, F ank Sump ion pu plealiengi l@...> w o e:\n\nF om: F ank Sump ion pu plealiengi l@...>Subjec : Re: [EVP-ITC] Scamp,To: EVP-ITC@yahoog oups.comDa e: Sunday, Augus 22, 2010, 12:21 AM \n\n  \n\n\n I you comple ely igno e wha e e yone else in he whole wide eaking wo ld ge s ia EVP, a ious pho og aphy and ITC me hods, and jus chance encoun e s, hen yeah, you p obably don' ha e any da a, and won' ha e any da a no ma e wha . \n\n \nF-S\nOn Sa , Aug 21, 2010 a 3:42 PM, Rick Weg zyn ickweg zyn@...> w o e:\n\n  \n\n\n\n\n\nHey RJ,I hink we need o go o he ceme a y and see wha you ge he e....\n\n\n\nF om: Rj as e e @...> \nTo: EVP-ITC@yahoog oups.comSen : Sa , Augus 21, 2010 2:29:36 PM \nSubjec : Re: [EVP-ITC] Scamp,\n  \n\n\n\n\n\nI don' hink I ha e enough da a ye o make any conclusions, so I plan mo e expe imen s.  Since he e a e di e en dis inc claims abou wha he box o he eco de s can do, I y o make di e en dis inc expe imen s o each.\nSome people claim hey can ge he box o ell hem hings ha he ope a o couldn' know, so my \"wha s he objec \" expe imen is one way o examine ha .  Some people claim he boxes can make p edic ions, so ca aloging p edic ions and examining he esul s can help examine ha .  I he e a e o he claims, I will y o igu e expe imen s based on hose.\n--- On Sa , 8/21/10, F ank Sump ion pu plealiengi l@...> w o e:\nF om: F ank Sump ion pu plealiengi l@...>Subjec : Re: [EVP-ITC] Scamp,\nTo: EVP-ITC@yahoog oups.comDa e: Sa u day, Augus 21, 2010, 12:48 PM\n  \n\n\n I ge ou las dogs om ime o ime, and used o ge hem ia whi e noise when I i s s a ed his. Las summe some kids came down in o he basemen wih he younge g andson, and he li le yo kie ba ked, bu \"ge ou a he e\" came ou , some how. \n\n \n Yeah, I hink I was oo ha d on RJ. I don' know why, bu es ing doens' seem o wo k, bu we ge enough o p o e his o ou sel es. I 's p obably a ai h hing, al hough I'm no eligious, e en an i- eligion.  \n\n \n F-S\n \n \nOn F i, Aug 20, 2010 a 6:27 PM, Snow i eL@...> w o e:\n\n  \n\n\n[A achmen (s) om Snow i eL@... included below] \n\nHe e is a sho ile, whe e someone says, \"Scamp, Scamp,\" hen Scamp ba ks. \"yap.\"  This li le dog belonged o my g andma, when I was abou 9 o 10 yea s old, he was a Manches e Te ie , and li ed wi h us o many yea s, and his is his ba k o su e.  I'd know ha ba k anywhe e.  So y, ha I can' make i any clea e , I need o ge one o hose be e ghos boxes I guess.  RJ, spi i s a e jus like us, hey a e no omnip esen like God,  p obably why Da id doesn' wan o play he guessing game, he has be e hings o do o e he e, and has said, hey ha e housands o people s anding in his long line wai ing o ge in o he Hea ens, and He can' jus d op His job and go o you house o see wha you ha e o e he e, He did ell me ha i s ime wha i was, and i sen i o you, bu i was oo la e.  I 's ha d o me o unde s and hem some imes, He was also igh abou ha li le boy, Syle being killed, and whe e his body would be ound, I don' know wha hey did abou i hough. s"}