{"id": "18608", "subject": "Re: [EVP-ITC] A suggestion for less hostility", "author": "Zack Widup", "timestamp": "2010-08-24T14:39:55Z", "full_text": "Yes, I am. I try to stay objective and I&#39;ve read your past e-mails and\nhonestly, I think a lot of people are reading things into what you post that\nI do not see. I do not understand the hostility that is being flung at you.\nPeople are misunderstanding you tremendously for some reason.\n\nThis does not bode well ...\n\nZack\n\nOn Tue, Aug 24, 2010 at 9:26 AM, Rj &lt;rasterer@yahoo.com&gt; wrote:\n\n&gt;\n&gt;\n&gt;   I can see you&#39;re not in favor of this suggestion for a more peaceful\n&gt; group, though I don&#39;t understand why,\n&gt;\n&gt; Is anyone else with me on this?\n&gt;\n&gt;\n&gt; --- On *Tue, 8/24/10, Fransen, Debbie &lt;debbie.fransen@delta.com&gt;* wrote:\n&gt;\n&gt;\n&gt; From: Fransen, Debbie &lt;debbie.fransen@...&gt;\n&gt; Subject: RE: [EVP-ITC] A suggestion for less hostility\n&gt; To: &quot;&#39;EVP-ITC@yahoogroups.com&#39;&quot; &lt;EVP-ITC@yahoogroups.com&gt;\n&gt; Date: Tuesday, August 24, 2010, 7:16 AM\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; that would be fine, if you didn&#39;t piss Frank off....... But you do.....\n&gt; AND THAT IS NOT OKAY.....\n&gt; The same thing will happen when you do it again....\n&gt; So what&#39;s the point in you being here.\n&gt;\n&gt;  ------------------------------\n&gt; *From:* EVP-ITC@yahoogroups.com [mailto:EVP-ITC@yahoogroups.com] *On\n&gt; Behalf Of *rasterer\n&gt; *Sent:* Tuesday, August 24, 2010 10:08 AM\n&gt; *To:* EVP-ITC@yahoogroups.com\n&gt; *Subject:* [EVP-ITC] A suggestion for less hostility\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; I expect none of us like all the recent attacks, insults, accusations,\n&gt; threats, hurting of feelings, and attempts to piss people off.\n&gt;\n&gt; Can I suggest we stick to the purpose of the group: &quot;the discussion,\n&gt; promotion, and developemnt of Electronic Voice Phenomenon, and Instrumental\n&gt; Transcommunication methods and technologies as used in the communication\n&gt; with spirit, and other entities.&quot;\n&gt;\n&gt; And that we go with Frank&#39;s philosophy &quot;just take the approach, try\n&gt; different methods, see what works.&quot;\n&gt;\n&gt; No more threats. No name calling, insults, or accusations. Just try to keep\n&gt; a positive group attitude, be open that not everyone believes what everyone\n&gt; else does, and that&#39;s ok?\n&gt;\n&gt;\n&gt; \n&gt;\n\nYes, I am. I y o s ay objec i e and I' e ead you pas e-mails and hones ly, I hink a lo o people a e eading hings in o wha you pos ha I do no see. I do no unde s and he hos ili y ha is being lung a you. People a e misunde s anding you emendously o some eason.\n\n \nThis does no bode well ...\n \nZack\nOn Tue, Aug 24, 2010 a 9:26 AM, Rj as e e @...> w o e:\n\n  \n\n\n\n\n\n\n\nI can see you' e no in a o o his sugges ion o a mo e peace ul g oup, hough I don' unde s and why,Is anyone else wi h me on his?--- On Tue, 8/24/10, F ansen, Debbie debbie. ansen@...> w o e:\n\nF om: F ansen, Debbie debbie. ansen@del a.com>Subjec : RE: [EVP-ITC] A sugges ion o less hos ili y\nTo: \"'EVP-ITC@yahoog oups.com'\" EVP-ITC@yahoog oups.com>Da e: Tuesday, Augus 24, 2010, 7:16 AM \n\n  \n\n\n ha would be ine, i you didn' piss F ank o ....... Bu you do.....\nAND THAT IS NOT OKAY.....\nThe same hing will happen when you do i again....\nSo wha 's he poin in you being he e.\n\n\nF om: EVP-ITC@yahoog oups.com [mail o:EVP-ITC@yahoog oups.com] On Behal O as e e \nSen : Tuesday, Augus 24, 2010 10:08 AMTo: EVP-ITC@yahoog oups.comSubjec : [EVP-ITC] A sugges ion o less hos ili y\n\n  \n\nI expec none o us like all he ecen a acks, insul s, accusa ions, h ea s, hu ing o eelings, and a emp s o piss people o . Can I sugges we s ick o he pu pose o he g oup: \" he discussion, p omo ion, and de elopemn o Elec onic Voice Phenomenon, and Ins umen al T anscommunica ion me hods and echnologies as used in he communica ion wi h spi i , and o he en i ies.\"\nAnd ha we go wi h F ank's philosophy \"jus ake he app oach, y di e en me hods, see wha wo ks.\"No mo e h ea s. No name calling, insul s, o accusa ions. Jus y o keep a posi i e g oup a i ude, be open ha no e e yone belie es wha e e yone else does, and ha 's ok?"}