{"id": "18624", "subject": "Everytime", "author": "Frank Sumption", "timestamp": "2010-08-24T20:42:31Z", "full_text": "Everytime I&#39;m about to drop all public interaction cuz of the idiot\nskeptics that accept nothing, I get this kind of voice. As I switch to TRF a\nvoice says &quot;People do listen&quot;.\n\n Try to answer these skeptics and all they can do is accuse me of attacking\nthem, while they accept no evidence, no one else&#39;s results, and break out\nall smug and arrogant.  Nothing paranormal eh!? Well explain just how\nsomething would know when I was going to switch and make a meaningful\ncomment at that instant.  Actually don&#39;t bother explaining, I don&#39;t wanna\nhear your crap science answer.  Most thinking people here can see/hear there\nis something to the paranormal and it is not imagination.\n\n This is what I call the &quot;History Box&quot; as I tried to incorporate all\nfunctions I&#39;ve been using into one unit. It almost works, been working on it\nsince last December. Arm Band tuner, TRF tuner, and car tuner, random and\nlinear sweep, random still needs work.\n\n\n\n F-S\n\nE e y ime I'm abou o d op all public in e ac ion cuz o he idio skep ics ha accep no hing, I ge his kind o oice. As I swi ch o TRF a oice says \"People do lis en\".\n \n T y o answe hese skep ics and all hey can do is accuse me o a acking hem, while hey accep no e idence, no one else's esul s, and b eak ou all smug and a ogan .  No hing pa ano mal eh!? Well explain jus how some hing would know when I was going o swi ch and make a meaning ul commen a ha ins an .  Ac ually don' bo he explaining, I don' wanna hea  you c ap science answe .  Mos hinking people he e can see/hea he e is some hing o he pa ano mal and i is no imagina ion.\n\n \n This is wha I call he \"His o y Box\" as I ied o inco po a e all unc ions I' e been using in o one uni . I almos wo ks, been wo king on i since las Decembe . A m Band une , TRF une , and ca une , andom and linea sweep, andom s ill needs wo k. \n\n \n \n \n F-S"}