{"id": "18629", "subject": "Re: A suggestion for less hostility", "author": "purplespacefriend", "timestamp": "2010-08-26T15:29:48Z", "full_text": "So if someone is saying that something you have worked on for years is all in your head while they completely ignore all evidence and results, you just sit quiet, don&#39;t say a word cuz someone might get upset? \n\n In the meantime, if some chase only the dark shadows, &quot;investigate&quot; in the dark at night, get growling voices saying &quot;get oput&quot;--that must be the absolute truth!\n\n There seems to be no way to beat the negativity on this planet. All focus on the darkside, the lies, the misinformation. All seek only fear and evil, the drama, Hollywood fame. No place for truth of anykind or form here. \n\n Think I&#39;m done here. \n\n F-S\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;Joeine C.&quot; &lt;raggedyann8140@...&gt; wrote:\n&gt;\n&gt; I agree, If you don&#39;t like what somebody says, just push delete.  There are so many\n&gt; other things going on in the world to get upset about.  You just attract more negativity.\n&gt;  \n&gt; \n&gt; \n&gt; IS THIS WHERE YOU LIVE? \n&gt; &quot;No, I live in heaven, and my affections\n&gt; are there. I just borrow this shack while\n&gt; waiting for my ride home.&quot;\n&gt; \n&gt; --- On Tue, 8/24/10, Zack Widup &lt;w9sz.zack@...&gt; wrote:\n&gt; \n&gt; \n&gt; From: Zack Widup &lt;w9sz.zack@...&gt;\n&gt; Subject: Re: [EVP-ITC] A suggestion for less hostility\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Tuesday, August 24, 2010, 9:39 AM\n&gt; \n&gt; \n&gt;   \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Yes, I am. I try to stay objective and I&#39;ve read your past e-mails and honestly, I think a lot of people are reading things into what you post that I do not see. I do not understand the hostility that is being flung at you. People are misunderstanding you tremendously for some reason.\n&gt;  \n&gt; This does not bode well ...\n&gt;  \n&gt; Zack\n&gt; \n&gt; \n&gt; On Tue, Aug 24, 2010 at 9:26 AM, Rj &lt;rasterer@...&gt; wrote:\n&gt; \n&gt; \n&gt;   \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; I can see you&#39;re not in favor of this suggestion for a more peaceful group, though I don&#39;t understand why,\n&gt; \n&gt; Is anyone else with me on this?\n&gt; \n&gt; \n&gt; --- On Tue, 8/24/10, Fransen, Debbie &lt;debbie.fransen@...&gt; wrote:\n&gt; \n&gt; \n&gt; From: Fransen, Debbie &lt;debbie.fransen@...&gt;\n&gt; Subject: RE: [EVP-ITC] A suggestion for less hostility\n&gt; To: &quot;&#39;EVP-ITC@yahoogroups.com&#39;&quot; &lt;EVP-ITC@yahoogroups.com&gt;\n&gt; Date: Tuesday, August 24, 2010, 7:16 AM \n&gt; \n&gt; \n&gt; \n&gt;   \n&gt; \n&gt; \n&gt; that would be fine, if you didn&#39;t piss Frank off....... But you do.....\n&gt; AND THAT IS NOT OKAY.....\n&gt; The same thing will happen when you do it again....\n&gt; So what&#39;s the point in you being here.\n&gt; \n&gt; \n&gt; \n&gt; From: EVP-ITC@yahoogroups.com [mailto:EVP-ITC@yahoogroups.com] On Behalf Of rasterer\n&gt; Sent: Tuesday, August 24, 2010 10:08 AM\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Subject: [EVP-ITC] A suggestion for less hostility\n&gt; \n&gt; \n&gt;   \n&gt; \n&gt; \n&gt; I expect none of us like all the recent attacks, insults, accusations, threats, hurting of feelings, and attempts to piss people off. \n&gt; \n&gt; Can I suggest we stick to the purpose of the group: &quot;the discussion, promotion, and developemnt of Electronic Voice Phenomenon, and Instrumental Transcommunication methods and technologies as used in the communication with spirit, and other entities.&quot;\n&gt; \n&gt; And that we go with Frank&#39;s philosophy &quot;just take the approach, try different methods, see what works.&quot;\n&gt; \n&gt; No more threats. No name calling, insults, or accusations. Just try to keep a positive group attitude, be open that not everyone believes what everyone else does, and that&#39;s ok?\n&gt;"}