{"id": "18636", "subject": "Re: [EVP-ITC] Re: A suggestion for less hostility", "author": "Frank Sumption", "timestamp": "2010-08-27T15:50:27Z", "full_text": "Thanks!\n\n F-S\n\nOn Fri, Aug 27, 2010 at 12:42 AM, JANDANACOSTA &lt;jandan108@yahoo.com&gt; wrote:\n\n&gt;\n&gt;\n&gt;   Frank, Reading all the BS those two were spewing on a daily basis, did\n&gt; not contribute one positive idea or thought. This is your group and I\n&gt; support your decision to do whatever you feel is necessary to keep the group\n&gt; intact and a pleasant place to be.\n&gt;\n&gt; I, for one am sick and tired of those who demand &quot;scientific&quot; evidence,\n&gt; when dealing with a reality  which is not scientifically based and never\n&gt; will be.  Those who wish to walk down that narrow minded path will never\n&gt; experience what we have experienced.  Thank you for your willingness to\n&gt; &quot;uninvite&quot; those who only want to place negativity into the group.\n&gt;\n&gt; Jan\n&gt;\n&gt; --- On *Thu, 8/26/10, Frank Sumption &lt;purplealiengirl@...&gt;* wrote:\n&gt;\n&gt;\n&gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt; Subject: Re: [EVP-ITC] Re: A suggestion for less hostility\n&gt; To: &quot;Rj&quot; &lt;EVP-ITC@yahoogroups.com&gt;\n&gt; Date: Thursday, August 26, 2010, 10:48 PM\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;  I&#39;ll repeat it just to be clear. The two I kicked off never accepted any\n&gt; evidence, ignored all examples of voices others posted, regardless of how\n&gt; clear they were. Claimed all they heard was gibbersih from the boxes, yet\n&gt; presented themselves as somehow more qualified to test the paranormal.\n&gt; Always no data, no evidence, while ignoring everything presented.  They tend\n&gt; to imply all the EVP voices were the brain trying to make sense out of\n&gt; chaotic noise, nothing more. When questioned as to their motives they acuse\n&gt; me of attacking them.\n&gt;\n&gt;  I&#39;ve been doing this stuff for ten years, and the two were pretty typical\n&gt; of most debunker/skeptics who deny deny deny, ignore ignore ignore and claim\n&gt; a higher intellect. I reached my saturation point.\n&gt;\n&gt;  They wanted to quote the statement on the group home page, which in fact\n&gt; states I will kick off people that appear to be debunkers.\n&gt;\n&gt;  Other methods are fine, not methods of debunking though! The box is one\n&gt; method of supplying the raw audio, just as white noise is a method of\n&gt; supplying the raw audio. *My opinion* is that the spirits and entities\n&gt; communicate best if they have something to make their voices out of, and the\n&gt; box, aka a swept radio, provides bits of speech music and noise for that\n&gt; purpose. I do not know anything about the so called paranormal, I don&#39;t do\n&gt; &quot;investigations&quot;, don&#39;t go to haunted areas to get EVPs. I do this stuff out\n&gt; of curiosity, and remain intrigued with these voices from a &quot;broken radio&quot;.\n&gt; It really pisses me off to have someone who can&#39;t hear the stuff tell me\n&gt; what it really is.\n&gt;\n&gt;  Frank-S\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; \n&gt;\n\nThanks! \n \n F-S\nOn F i, Aug 27, 2010 a 12:42 AM, JANDANACOSTA jandan108@...> w o e:\n\n  \n\n\n\n\n\n\n\nF ank, Reading all he BS hose wo we e spewing on a daily basis, did no con ibu e one posi i e idea o hough . This is you g oup and I suppo you decision o do wha e e you eel is necessa y o keep he g oup in ac and a pleasan place o be.   \n\nI, o one am sick and i ed o hose who demand \"scien i ic\" e idence, when dealing wi h a eali y  which is no scien i ically based and ne e will be.  Those who wish o walk down ha na ow minded pa h will ne e expe ience wha we ha e expe ienced.  Thank you o you willingness o \"unin i e\" hose who only wan o place nega i i y in o he g oup.\n\n\nJan--- On Thu, 8/26/10, F ank Sump ion pu plealiengi l@...> w o e:\nF om: F ank Sump ion pu plealiengi l@...>Subjec : Re: [EVP-ITC] Re: A sugges ion o less hos ili y\nTo: \"Rj\" EVP-ITC@yahoog oups.com>Da e: Thu sday, Augus 26, 2010, 10:48 PM \n\n\n\n  \n\n\n I'll epea i jus o be clea . The wo I kicked o ne e accep ed any e idence, igno ed all examples o oices o he s pos ed, ega dless o how clea hey we e. Claimed all hey hea d was gibbe sih om he boxes, ye p esen ed hemsel es as somehow mo e quali ied o es he pa ano mal. Always no da a, no e idence, while igno ing e e y hing p esen ed.  They end o imply all he EVP oices we e he b ain ying o make sense ou o chao ic noise, no hing mo e. When ques ioned as o hei mo i es hey acuse me o a acking hem. \n\n \n I' e been doing his s u o en yea s, and he wo we e p e y ypical o mos debunke /skep ics who deny deny deny, igno e igno e igno e and claim a highe in ellec . I eached my sa u a ion poin . \n \n They wan ed o quo e he s a emen on he g oup home page, which in ac s a es I will kick o people ha appea o be debunke s. \n \n O he me hods a e ine, no me hods o debunking hough! The box is one me hod o supplying he aw audio, jus as whi e noise is a me hod o supplying he aw audio. My opinion is ha he spi i s and en i ies communica e bes i hey ha e some hing o make hei oices ou o , and he box, aka a swep adio, p o ides bi s o speech music and noise o ha pu pose. I do no know any hing abou he so called pa ano mal, I don' do \"in es iga ions\", don' go o haun ed a eas o ge EVPs. I do his s u ou o cu iosi y, and emain in igued wi h hese oices om a \"b oken adio\". I eally pisses me o o ha e someone who can' hea he s u ell me wha i eally is. \n\n \n F ank-S"}