{"id": "18653", "subject": "Re: [EVP-ITC] Re: Something I forgot in some boxes", "author": "Frank Sumption", "timestamp": "2010-08-30T22:21:00Z", "full_text": "Well, not much time for people to wake up, less than 2.5 years. I can&#39;t\nimagine every culture in the world having the exact same date in prophecy\nand it means nothing.  I&#39;m talking the 2012 thing, it&#39;s not just the Mayans.\nIt&#39;s in Europe, China, India, Egypt, Native Americans, the Bible, just to\nname a few off the top of my head, plus it&#39;s from the GB as well.\n\n F-S\n\nOn Mon, Aug 30, 2010 at 11:01 AM, Golden Phoenix &lt;golden_phoenix42@...\n&gt; wrote:\n\n&gt;\n&gt;\n&gt;  Some day all the skeptics will have a change of heart and be able to\n&gt; understand what the rest of us have seen heard and felt for so long. Ignore\n&gt; the ignorant its not our place to teach the world what they cannot learn\n&gt; till its their time.\n&gt; GP\n&gt;\n&gt; &lt;font style=&quot;BACKGROUND-COLOR:#ffffff;&quot; color=&quot;#bf005f&quot;&gt;&lt;strong&gt;&lt;em&gt;&lt;u&gt;&lt;a\n&gt; rel=&quot;nofollow&quot; target=&quot;_blank&quot; href=&quot;http://www.myspace.com/ghost_hunter50\n&gt; &quot;&gt;http://www.myspace.com/ghost_hunter50&lt;/a&gt;&lt;/u&gt;&lt;/em&gt;&lt;/strong&gt;&lt;/font&gt;\n&gt; &lt;font style=&quot;BACKGROUND-COLOR:#ffffff;&quot; face=&quot;System&quot; color=&quot;#ff0000&quot;&gt;see\n&gt; my site links&lt;/font&gt;\n&gt;\n&gt;\n&gt;  ------------------------------\n&gt; *From:* Fiona Broome &lt;email@fionabroome.com&gt;\n&gt; *To:* EVP-ITC@yahoogroups.com\n&gt; *Sent:* Mon, August 30, 2010 9:03:22 AM\n&gt; *Subject:* [EVP-ITC] Re: Something I forgot in some boxes\n&gt;\n&gt;\n&gt;\n&gt; Hi,\n&gt;\n&gt; I can only speak for myself, but here it is:\n&gt;\n&gt; Awhile ago, another skeptic (or two?) left the list, and I thought it was\n&gt; okay to post here. Then, &quot;Rj&quot; and friend filled in the skeptic gap, big\n&gt; time.\n&gt;\n&gt; I deal with enough critics and skeptics in the rest of my work. I don&#39;t\n&gt; work nearly as well when I&#39;m upset, and fretting because someone has\n&gt; insulted me (or my intelligence) or someone I respect, like Frank.\n&gt;\n&gt; I&#39;m learning that insulating myself allows me to focus on my work. If\n&gt; that&#39;s what I have to do... well, that&#39;s what I&#39;ll do.\n&gt;\n&gt; I&#39;ve been in &quot;wait and see&quot; mode here, in case there are yet more critics\n&gt; and skeptics who&#39;ll fill in the &quot;Rj&quot; gap. I want to believe that\n&gt; everything&#39;s okay now, but I&#39;m still stinging from recent negative comments,\n&gt; on and off of this list.\n&gt;\n&gt; But mostly, I&#39;m about to leave for my biggest annual gig, in a field that&#39;s\n&gt; become more land mines than safe paths. Between the anxiety and the\n&gt; pre-event preps, I&#39;m in lurk mode here... and I&#39;ll be offline entirely for\n&gt; most of the first two weeks of September.\n&gt;\n&gt; So, those are the reasons why I&#39;ve been quiet.\n&gt;\n&gt; In haste,\n&gt; Fiona\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Frank Sumption\n&gt; &lt;purplealiengirl@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Soooo, the skeptic types are responsible for most of the dialog? Weird,\n&gt; &gt; you&#39;d think more would feel safer posting and commenting. Get rid of the\n&gt; &gt; ones that accept no evidence, can&#39;t test, ignore all of our resutls,\n&gt; can&#39;t\n&gt; &gt; hear and acuse us of halucinating this and---dead silence. Human\n&gt; psychology\n&gt; &gt; is beyond my comprehension!\n&gt; &gt;\n&gt; &gt; F-S\n&gt; &gt;\n&gt;\n&gt;\n&gt;  \n&gt;\n\nWell, no much ime o people o wake up, less han 2.5 yea s. I can' imagine e e y cul u e in he wo ld ha ing he exac same da e in p ophecy and i means no hing.  I'm alking he 2012 hing, i 's no jus he Mayans. I 's in Eu ope, China, India, Egyp , Na i e Ame icans, he Bible, jus o name a ew o he op o my head, plus i 's om he GB as well. \n\n \n F-S\nOn Mon, Aug 30, 2010 a 11:01 AM, Golden Phoenix golden_phoenix42@...> w o e:\n\n  \n\n\n\n\n\n\nSome day all he skep ics will ha e a change o hea and be able o unde s and wha he es o us ha e seen hea d and el o so long. Igno e he igno an i s no ou place o each he wo ld wha hey canno lea n ill i s hei ime. \n\nGP \nh p://www.myspace.com/ghos _hun e 50\">h p://www.myspace.com/ghos _hun e 50\n\nsee my si e links\n\n\n\n\nF om: Fiona B oome email@...>To: EVP-ITC@yahoog oups.com\nSen : Mon, Augus 30, 2010 9:03:22 AMSubjec : [EVP-ITC] Re: Some hing I o go in some boxes\n  \n\nHi,I can only speak o mysel , bu he e i is:Awhile ago, ano he skep ic (o wo?) le he lis , and I hough i was okay o pos he e. Then, \"Rj\" and iend illed in he skep ic gap, big ime. \nI deal wi h enough c i ics and skep ics in he es o my wo k. I don' wo k nea ly as well when I'm upse , and e ing because someone has insul ed me (o my in elligence) o someone I espec , like F ank.\nI'm lea ning ha insula ing mysel allows me o ocus on my wo k. I ha 's wha I ha e o do... well, ha 's wha I'll do.I' e been in \"wai and see\" mode he e, in case he e a e ye mo e c i ics and skep ics who'll ill in he \"Rj\" gap. I wan o belie e ha e e y hing's okay now, bu I'm s ill s inging om ecen nega i e commen s, on and o o his lis .\nBu mos ly, I'm abou o lea e o my bigges annual gig, in a ield ha 's become mo e land mines han sa e pa hs. Be ween he anxie y and he p e-e en p eps, I'm in lu k mode he e... and I'll be o line en i ely o mos o he i s wo weeks o Sep embe .\nSo, hose a e he easons why I' e been quie .In has e,Fiona --- In EVP-ITC@yahoog oups.com, F ank Sump ion w o e:\n>> Soooo, he skep ic ypes a e esponsible o mos o he dialog? Wei d,> you'd hink mo e would eel sa e pos ing and commen ing. Ge id o he> ones ha accep no e idence, can' es , igno e all o ou esu ls, can' \n> hea and acuse us o halucina ing his and---dead silence. Human psychology> is beyond my comp ehension!> > F-S>"}