{"id": "18669", "subject": "Re: [EVP-ITC] How do you tell?", "author": "Zack Widup", "timestamp": "2010-08-31T18:21:54Z", "full_text": "If you read back in some of the earliest messages on the group, you&#39;ll find\nout that Frank built his boxes with a totally different purpose than\nreceiving communications from &quot;ghosts.&quot; It appears the entities who have\nbeen communicating through Frank&#39;s boxes are NOT ghosts at all. They are\nsomething else. I guess &quot;spirit technicians&quot; seems to describe them best. We\nstill don&#39;t know who or where they are or what their purpose is. But they&#39;re\nthere somewhere, apparently.\n\nZack\n\n\nOn Tue, Aug 31, 2010 at 1:03 PM, Rick Wegrzyn &lt;rickwegrzyn@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Hey Frank and all....Listen it is what it is...I&#39;m gonna put together a\n&gt; Paranormal site up hopefully today,Thats what I do....Investigate\n&gt; &quot;HAUNTINGS&quot; ...I explore the things that most people wont...We dont want to\n&gt; be like Taps..We want to be ourselfs doing what we do...I Get not only video\n&gt; evidence but Digital recordings as well, and the use of &quot;THE BOX&quot; at\n&gt; times...We got on all three several times evidence of voices,some as clear\n&gt; as you standing next to me...We did come across Evil whether you believe it\n&gt; or not,and thats not good at all....So to the skeptics and all others walk\n&gt; in my shoes and you&#39;re life will change...I&#39;ve been searching for answers\n&gt; for 33 years and I still havent found what I lookin for wnat ever that would\n&gt; be....lol...Peace and God Bless....Rick       just something I had to get\n&gt; off my sholders...\n&gt;\n&gt;  ------------------------------\n&gt; *From:* Frank Sumption &lt;purplealiengirl@gmail.com&gt;\n&gt; *To:* EVP-ITC@yahoogroups.com\n&gt; *Sent:* Tue, August 31, 2010 11:36:21 AM\n&gt;\n&gt; *Subject:* Re: [EVP-ITC] How do you tell?\n&gt;\n&gt;\n&gt;\n&gt;  I don&#39;t have the time and resources to mass produce this stuff. Besides, I\n&gt; find what most want to use the boxes for, ghost hunting and demon chasing\n&gt; very discouraging. I don&#39;t know of anyone that uses this stuff, be it hack\n&gt; boxes, or any other method to try to actually get higher level contacts. No\n&gt; one just allows the entities to speak, all want to second guess something\n&gt; that has more access and is in a higher state of being. Everyone wants to be\n&gt; TAPS, and get the crap scared out themselves. Most hear only what they want\n&gt; to hear. I don&#39;t know what the answer is.\n&gt;\n&gt;  F-S\n&gt;\n&gt; On Mon, Aug 30, 2010 at 8:59 AM, Kae Tee &lt;usmcmacswife@...&gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;   Frank,\n&gt;&gt; Do you personally make boxes for purchase?\n&gt;&gt;\n&gt;&gt; Teddy\n&gt;&gt;\n&gt;&gt; --- On *Mon, 8/30/10, Frank Sumption &lt;purplealiengirl@...&gt;* wrote:\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt;&gt; Subject: Re: [EVP-ITC] How do you tell?\n&gt;&gt; To: EVP-ITC@yahoogroups.com\n&gt;&gt; Date: Monday, August 30, 2010, 1:56 AM\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;  Well, &quot;the box&quot; in nothing more than a radio with swept tuning--as far as\n&gt;&gt; I know and have experienced, sweep across the radios tuning range, or band\n&gt;&gt; generates bits of speech music and noise that the entities use to reform\n&gt;&gt; into their voices, although there maybe more involved, but I don&#39;t know how\n&gt;&gt; one would test it.\n&gt;&gt;\n&gt;&gt;  Most of the boxes for sale out there are the hack radio boxes. Many of\n&gt;&gt; the modern digital radios have a function that mutes, or quiets the radio\n&gt;&gt; while tuning between stations. I&#39;m not sure why, but unmutting the radio\n&gt;&gt; allows the audio to be heard while the radio searches for the next\n&gt;&gt; station--and--the radio is disallowed form locking onto a station, so it\n&gt;&gt; keeps sweeping all the way to the end of the band--AM or FM, then starts\n&gt;&gt; over. This creates the raw audio and &quot;they&quot; speak. The sweep can even be\n&gt;&gt; done by hand, tuning a radio slowing by hand. I sue cheap radios I get at\n&gt;&gt; thrift stores for this, gluing a dowel to the tuning knob to make it easier.\n&gt;&gt; Then record form the speaker--open air.\n&gt;&gt;\n&gt;&gt;  So as long as the radio sweeps at not to fast and not too slow, it&#39;ll\n&gt;&gt; works. Some are better than others.\n&gt;&gt;\n&gt;&gt;  It takes some practice, and maybe even a certain allowing to hear the\n&gt;&gt; ghost voices.\n&gt;&gt;\n&gt;&gt;  I prefer to take a tuner out of a radio, such as a clock radio and supply\n&gt;&gt; an external sweep voltage. The sweep circuits are just basic op amps, and\n&gt;&gt; you can buy a function generator kit to supply a triangle wave for linear\n&gt;&gt; sweep. See keyportparanormal.com for more info on using this kit, and\n&gt;&gt; building boxes.\n&gt;&gt;\n&gt;&gt;  One problem with this stuff is that it can be extremely subjective,\n&gt;&gt; others may not hear what you hear, or hear it the same. I think mostly the\n&gt;&gt; messages are meant for the one that receives it. We go round and round with\n&gt;&gt; the skeptics and debunkers.\n&gt;&gt;\n&gt;&gt;  F-S\n&gt;&gt; On Sun, Aug 29, 2010 at 11:08 PM, usmcmacswife &lt;usmcmacswife@...&lt;http://mc/compose?to=usmcmacswife@...&gt;\n&gt;&gt; &gt; wrote:\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; Ok, we&#39;re new here hello!\n&gt;&gt;\n&gt;&gt; We just had a couple questions. HOW do you tell if you&#39;re being ripped off\n&gt;&gt; if you are searching online to buy a box? If you can point us in the right\n&gt;&gt; direction of where to purchase a &quot;frank&#39;s box&quot; would be deeply appreciated.\n&gt;&gt; We saw that you can try and make your own but with my husband&#39;s work\n&gt;&gt; schedule and mine with 4 kids, sports etc.. the only time we get to work\n&gt;&gt; with EVP&#39;s and such is when we schedule an investigation and secure a\n&gt;&gt; babysitter! LOL Not to mention my husband isn&#39;t that technologically\n&gt;&gt; inclined. That is my job... and I would be afraid that I&#39;d have done\n&gt;&gt; something incorrectly and what we were experiencing really wasn&#39;t &quot;true&quot;.\n&gt;&gt; Sorry to sound like such a newbie I&#39;m sure!\n&gt;&gt;\n&gt;&gt; Thank you! Teddy\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;\n&gt;  \n&gt;\n\nI you ead back in some o he ea lies messages on he g oup, you'll ind ou ha F ank buil his boxes wi h a o ally di e en pu pose han ecei ing communica ions om \"ghos s.\" I appea s he en i ies who ha e been communica ing h ough F ank's boxes a e NOT ghos s a all. They a e some hing else. I guess \"spi i echnicians\" seems o desc ibe hem bes . We s ill don' know who o whe e hey a e o wha hei pu pose is. Bu hey' e he e somewhe e, appa en ly.\nZackOn Tue, Aug 31, 2010 a 1:03 PM, Rick Weg zyn ickweg zyn@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n Hey F ank and all....Lis en i is wha i is...I'm gonna pu oge he a Pa ano mal si e up hope ully oday,Tha s wha I do....In es iga e \"HAUNTINGS\" ...I explo e he hings ha mos people won ...We don wan o be like Taps..We wan o be ou sel s doing wha we do...I Ge no only ideo e idence bu Digi al eco dings as well, and he use o \"THE BOX\" a imes...We go on all h ee se e al imes e idence o oices,some as clea as you s anding nex o me...We did come ac oss E il whe he you belie e i o no ,and ha s no good a all....So o he skep ics and all o he s walk in my shoes and you' e li e will change...I' e been sea ching o answe s o 33 yea s and I s ill ha en ound wha I lookin o wna e e ha would be....lol...Peace and God\n Bless....Rick       jus some hing I had o ge o my sholde s...\n\n\n\nF om: F ank Sump ion pu plealiengi l@...>To: EVP-ITC@yahoog oups.com\nSen : Tue, Augus 31, 2010 11:36:21 AMSubjec : Re: [EVP-ITC] How do you ell?\n  \n\n\n I don' ha e he ime and esou ces o mass p oduce his s u . Besides, I ind wha mos wan o use he boxes o , ghos hun ing and demon chasing e y discou aging. I don' know o anyone ha uses his s u , be i hack boxes, o any o he me hod o y o ac ually ge highe le el con ac s. No one jus allows he en i ies o speak, all wan o second guess some hing ha has mo e access and is in a highe s a e o being. E e yone wan s o be TAPS, and ge he c ap sca ed ou hemsel es. Mos hea only wha hey wan o hea . I don' know wha he answe is. \n\n \n F-S\nOn Mon, Aug 30, 2010 a 8:59 AM, Kae Tee usmcmacswi e@...> w o e:\n\n  \n\n\n\n\n\n\n\nF ank, \nDo you pe sonally make boxes o pu chase?\n\nTeddy--- On Mon, 8/30/10, F ank Sump ion pu plealiengi l@...> w o e:\nF om: F ank Sump ion pu plealiengi l@...>Subjec : Re: [EVP-ITC] How do you ell?\nTo: EVP-ITC@yahoog oups.comDa e: Monday, Augus 30, 2010, 1:56 AM \n\n\n\n  \n\n\n Well, \" he box\" in no hing mo e han a adio wi h swep uning--as a as I know and ha e expe ienced, sweep ac oss he adios uning ange, o band gene a es bi s o speech music and noise ha   he en i ies use o e o m in o hei oices, al hough he e maybe mo e in ol ed, bu I don' know how one would es i .  \n\n \n Mos o he boxes o sale ou he e a e he hack adio boxes. Many o he mode n digi al adios ha e a unc ion ha mu es, o quie s he adio while uning be ween s a ions. I'm no su e why, bu unmu ing he adio allows he audio o be hea d while he adio sea ches o he nex s a ion--and-- he adio is disallowed o m locking on o a s a ion, so i keeps sweeping all he way o he end o he band--AM o FM, hen s a s o e . This c ea es he aw audio and \" hey\" speak. The sweep can e en be done by hand, uning a adio slowing by hand. I sue cheap adios I ge a h i s o es o his, gluing a dowel o he uning knob o make i easie . Then eco d o m he speake --open ai . \n\n \n So as long as he adio sweeps a no o as and no oo slow, i 'll wo ks. Some a e be e han o he s. \n \n I akes some p ac ice, and maybe e en a ce ain allowing o hea he ghos oices. \n \n I p e e o ake a une ou o a adio, such as a clock adio and supply an ex e nal sweep ol age. The sweep ci cui s a e jus basic op amps, and you can buy a unc ion gene a o ki o supply a iangle wa e o linea sweep. See keypo pa ano mal.com o mo e in o on using his ki , and building boxes. \n\n \n One p oblem wi h his s u is ha i can be ex emely subjec i e, o he s may no hea wha you hea , o hea i he same. I hink mos ly he messages a e mean o he one ha ecei es i . We go ound and ound wi h he skep ics and debunke s.\n\n \n F-S\nOn Sun, Aug 29, 2010 a 11:08 PM, usmcmacswi e usmcmacswi e@...> w o e:\n\n  \n\n\n\nOk, we' e new he e hello!We jus had a couple ques ions. HOW do you ell i you' e being ipped o i you a e sea ching online o buy a box? I you can poin us in he igh di ec ion o whe e o pu chase a \" ank's box\" would be deeply app ecia ed.\nWe saw ha you can y and make you own bu wi h my husband's wo k schedule and mine wi h 4 kids, spo s e c.. he only ime we ge o wo k wi h EVP's and such is when we schedule an in es iga ion and secu e a babysi e ! LOL No o men ion my husband isn' ha echnologically inclined. Tha is my job... and I would be a aid ha I'd ha e done some hing inco ec ly and wha we we e expe iencing eally wasn' \" ue\".\nSo y o sound like such a newbie I'm su e!Thank you! Teddy"}