{"id": "18700", "subject": "Re: [EVP-ITC] Re: more echo chamber.", "author": "Frank Sumption", "timestamp": "2010-09-13T05:44:19Z", "full_text": "I don&#39;t know if I answered this, but yeah, it makes a  longer tube. Using a\nstraight tube seems to make the sound tinny, but putting in bends seems to\nadd more bass, plus I can fit a longer tube in a smaller area.. That&#39;s why I\nuse two or more tunbes glued together.\n\n F-S\n\n\nOn Sun, Aug 29, 2010 at 10:29 AM, JanP &lt;janpassmore22@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Hi Frank,\n&gt;\n&gt; As I am new to studying your designs and electronics in general, am I\n&gt; correct in assuming that the PVC has been cut and glued so that the pipes\n&gt; are open to each other, in effect one large chamber? Thanks,\n&gt;\n&gt; Jan\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Frank Sumption\n&gt; &lt;purplealiengirl@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Chamber made out of 1 inch PVC electrical conduit about 4 1/2 inches\n&gt; long,\n&gt; &gt; the size was determined by how much room I had. Inthe vidoe at 5 seconds\n&gt; &quot;a\n&gt; &gt; plane-hits the Earth&quot;.\n&gt; &gt;\n&gt; &gt; F-S\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nI don' know i I answe ed his, bu yeah, i makes a  longe ube. Using a s aigh ube seems o make he sound inny, bu pu ing in bends seems  o add mo e bass, plus I can i a longe ube in a smalle a ea.. Tha 's why I use wo o mo e unbes glued oge he . \n\n \n F-S\n \nOn Sun, Aug 29, 2010 a 10:29 AM, JanP janpassmo e22@...> w o e:\n\n  \n\n\n\nHi F ank,As I am new o s udying you designs and elec onics in gene al, am I co ec in assuming ha he PVC has been cu and glued so ha he pipes a e open o each o he , in e ec one la ge chambe ? Thanks,\nJan \n\n\n--- In EVP-ITC@yahoog oups.com, F ank Sump ion w o e:>> Chambe made ou o 1 inch PVC elec ical condui abou 4 1/2 inches long,\n> he size was de e mined by how much oom I had. In he idoe a 5 seconds \"a> plane-hi s he Ea h\".> > F-S>"}