{"id": "18709", "subject": "Re: [EVP-ITC] Re: if you use Ghost radar", "author": "Kae Tee", "timestamp": "2010-09-14T06:02:29Z", "full_text": "--0-378012662-1284444149=:12508\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nI downloaded the iOvilus, emFX, magCAM etc for iPhone last week. I found it=\r\n by searching for the Ovilus information from someone in our group asked me=\r\n if I had ever tried.. I thought OK, an app for the iphone this CAN&#39;T be mo=\r\nre than a joke.Well, I tried it the next morning before I left to pick up o=\r\nur boys from school and take them to an appointment. Right away it said &quot;Tr=\r\nain Tracks&quot; and then &quot;Police&quot;. Well, we live near train tracks and there is=\r\n a place that the police sit. So, I thought to myself, I&#39;ll just go around =\r\nthe other way because lately I was just feeling I was going to get a ticket=\r\n or an encounter with a police officer (I know call me silly.. Comes from l=\r\niving on a military base for years where they LOOKED for people to pull ove=\r\nr constantly just to have something to do so now I live in fear! LOL) So I =\r\nam sitting there thinking to myself I&#39;ll just take the other way around whe=\r\nn the thing goes off and says &quot;Accident&quot; &quot;Fire Trucks&quot;. So I am\n thinking o=\r\nk, I really will go the other way around now. So, I take the long way and I=\r\n about peed my pants when I see an accident, police and firetrucks. I calle=\r\nd my husband right away and he&#39;s like OK.. calm down.. (Because one of the =\r\ncars in the accident looked like my dad&#39;s car. I called my dad but he didn&#39;=\r\nt pick up, which is unusual.. so, me being the no patience worry wart, star=\r\nts to burn up my dad&#39;s phone and I am thinking maybe I should have let the =\r\napp continue!! lol.. He was to pick up our boys and then get my mom but I s=\r\naid no don&#39;t worry about it I&#39;ll go get them so he was over that way... Tur=\r\nns out it was&#39;t him..) BUT all that made me sort of on edge. SO, DH starts =\r\nplaying with it on his phone at work. He said it just spit out all kinds of=\r\n garble on his phone. He wasn&#39;t even asking questions it just kept going an=\r\nd going..=C2=A0So, I tried it a few more times and couldn&#39;t make heads or t=\r\nails of anything on there. The one time our kids heard it and\n started aski=\r\nng questions too but nothing that made sense in a response but they had fun=\r\n. =C2=A0So, I didn&#39;t play with it again for a while. I turned it on today a=\r\ns I was bored looking through my apps and it says my name right off the bat=\r\n so I turned it off immediately... DH thinks it&#39;s just a coinkydinc because=\r\n how can an iPhone app do that.. We have had our phones next to each other =\r\nand it picks up different words we were thinking it would say the same bein=\r\ng next to each other.. At times it seems to send our &quot;random&quot; words and oth=\r\ner times it&#39;s like making my hair stand up on my arms. =C2=A0The emFX we ca=\r\nn&#39;t decide if it&#39;s really picking up a true EMF reading or not.. =C2=A0Any =\r\nexperiences with any of those? (They also drain the battery very fast!)I wi=\r\nll go look and see if Ghost Radar is available for an iphone app!\nTeddy\n---=\r\n On Mon, 9/13/10, Fiona Broome &lt;email@...&gt; wrote:\n\nFrom: Fiona =\r\nBroome &lt;email@...&gt;\nSubject: [EVP-ITC] Re: if you use Ghost rada=\r\nr\nTo: EVP-ITC@yahoogroups.com\nDate: Monday, September 13, 2010, 9:22 AM\n\n\n\n=\r\n\n\n\n\n\n\n\n\n\n\n\n\n \n=C2=A0\n\n\n\n  \n\n\n    \n      \n      \n      Hi,\n\n\n\nSince I don&#39;t =\r\nuse a droid or even a cellphone (except when I&#39;m on the road), I won&#39;t pret=\r\nend that I have a lot of experience with the Ghost Radar App.\n\n\n\nHowever, I=\r\n did see it during a lunch in Canada last May.  Two (of the four of us) at =\r\nthe table wanted a message from a particular person.  The Ghost Radar began=\r\n saying things, including several words that -- to me -- clearly indicated =\r\nthe painting on the wall next to us.  \n\n\n\n(When I&#39;m not being a researcher/=\r\nauthor, I&#39;m an artist, so I&#39;d noticed the painting&#39;s subject, medium, artis=\r\nt&#39;s name, date, etc.)\n\n\n\nThe two people hadn&#39;t looked closely at the painti=\r\nng.  However, when they did, they felt that it included exactly the kind of=\r\n message they were looking for.\n\n\n\nWhat most impressed me were their reacti=\r\nons.  Both are fairly accustomed to paranormal phenomena and the ways that =\r\npeople convince themselves that whatever-it-is is actually a message.\n\n\n\nHo=\r\nwever, this incident seemed to have significance to them, and satisfied the=\r\nm that they&#39;d rec&#39;d the message they were looking for.\n\n\n\nIt&#39;s just anecdot=\r\nal and just one incident, but... well, there it is.  I think the Ghost Rada=\r\nr is worth exploring if you already have a droid or similar tool.  And, for=\r\n the price... well, hey, why not!\n\n\n\nI&#39;ll experiment with it more when I ac=\r\ntually own something it&#39;ll run on.  For now, other research is a higher pri=\r\nority.\n\n\n\nCheerfully,\n\nFiona\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;Timbo&quot; &lt;ti=\r\nmbo1138@...&gt; wrote:\n\n&gt;\n\n&gt; I started a group about Ghost Radar App. If you u=\r\nse it come by and check it out. I want to be able to share experiences usin=\r\ng the new tool.\n\n&gt; thanks\n\n&gt; http://tech.groups.yahoo.com/group/ghost_radar=\r\n_experiences/\n\n&gt; Timothy\n\n&gt;\n\n\n\n\n\n    \n     \n\n    \n    \n\n\n \n\n\n\n  \n\n\n\n\n\n\n\n\n\n\n=\r\n\n      \r\n--0-378012662-1284444149=:12508\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;div&gt;I downloaded the iOvilus, emFX, magCAM e=\r\ntc for iPhone last week. I found it by searching for the Ovilus information=\r\n from someone in our group asked me if I had ever tried.. I thought OK, an =\r\napp for the iphone this CAN&#39;T be more than a joke.&lt;/div&gt;&lt;div&gt;Well, I tried =\r\nit the next morning before I left to pick up our boys from school and take =\r\nthem to an appointment. Right away it said &quot;Train Tracks&quot; and then &quot;Police&quot;=\r\n. Well, we live near train tracks and there is a place that the police sit.=\r\n So, I thought to myself, I&#39;ll just go around the other way because lately =\r\nI was just feeling I was going to get a ticket or an encounter with a polic=\r\ne officer (I know call me silly.. Comes from living on a military base for =\r\nyears where they LOOKED for people to pull over constantly just to have som=\r\nething to do so now I live in fear! LOL) So I am sitting there thinking to\n=\r\n myself I&#39;ll just take the other way around when the thing goes off and say=\r\ns &quot;Accident&quot; &quot;Fire Trucks&quot;. So I am thinking ok, I really will go the other=\r\n way around now. So, I take the long way and I about peed my pants when I s=\r\nee an accident, police and firetrucks. I called my husband right away and h=\r\ne&#39;s like OK.. calm down.. (Because one of the cars in the accident looked l=\r\nike my dad&#39;s car. I called my dad but he didn&#39;t pick up, which is unusual..=\r\n so, me being the no patience worry wart, starts to burn up my dad&#39;s phone =\r\nand I am thinking maybe I should have let the app continue!! lol.. He was t=\r\no pick up our boys and then get my mom but I said no don&#39;t worry about it I=\r\n&#39;ll go get them so he was over that way... Turns out it was&#39;t him..) BUT al=\r\nl that made me sort of on edge. SO, DH starts playing with it on his phone =\r\nat work. He said it just spit out all kinds of garble on his phone. He wasn=\r\n&#39;t even asking questions it just kept going and\n going..&nbsp;&lt;/div&gt;&lt;div&gt;So=\r\n, I tried it a few more times and couldn&#39;t make heads or tails of anything =\r\non there. The one time our kids heard it and started asking questions too b=\r\nut nothing that made sense in a response but they had fun. &nbsp;&lt;/div&gt;&lt;div=\r\n&gt;So, I didn&#39;t play with it again for a while. I turned it on today as I was=\r\n bored looking through my apps and it says my name right off the bat so I t=\r\nurned it off immediately... DH thinks it&#39;s just a coinkydinc because how ca=\r\nn an iPhone app do that.. We have had our phones next to each other and it =\r\npicks up different words we were thinking it would say the same being next =\r\nto each other.. At times it seems to send our &quot;random&quot; words and other time=\r\ns it&#39;s like making my hair stand up on my arms. &nbsp;The emFX we can&#39;t dec=\r\nide if it&#39;s really picking up a true EMF reading or not.. &nbsp;Any experie=\r\nnces with any of those? (They also drain the battery very fast!)&lt;/div&gt;&lt;div&gt;=\r\nI will go look and see if Ghost Radar is\n available for an iphone app!&lt;/div=\r\n&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;Teddy&lt;/div&gt;&lt;br&gt;--- On &lt;b&gt;Mon, 9/13/10, Fiona Broome &lt;i=\r\n&gt;&lt;email@...&gt;&lt;/i&gt;&lt;/b&gt; wrote:&lt;br&gt;&lt;blockquote style=3D&quot;borde=\r\nr-left: 2px solid rgb(16, 16, 255); margin-left: 5px; padding-left: 5px;&quot;&gt;&lt;=\r\nbr&gt;From: Fiona Broome &lt;email@...&gt;&lt;br&gt;Subject: [EVP-ITC] R=\r\ne: if you use Ghost radar&lt;br&gt;To: EVP-ITC@yahoogroups.com&lt;br&gt;Date: Monday, S=\r\neptember 13, 2010, 9:22 AM&lt;br&gt;&lt;br&gt;&lt;div id=3D&quot;yiv787482808&quot;&gt;\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n=\r\n&lt;span style=3D&quot;display:none;&quot;&gt;&nbsp;&lt;/span&gt;\n\n\n\n    &lt;div id=3D&quot;yiv787482808y=\r\ngrp-text&quot;&gt;\n      \n      \n      &lt;p&gt;Hi,&lt;br&gt;\n&lt;br&gt;\nSince I don&#39;t use a droid or=\r\n even a cellphone (except when I&#39;m on the road), I won&#39;t pretend that I hav=\r\ne a lot of experience with the Ghost Radar App.&lt;br&gt;\n&lt;br&gt;\nHowever, I did see=\r\n it during a lunch in Canada last May.  Two (of the four of us) at the tabl=\r\ne wanted a message from a particular person.  The Ghost Radar began saying =\r\nthings, including several words that -- to me -- clearly indicated the pain=\r\nting on the wall next to us.  &lt;br&gt;\n&lt;br&gt;\n(When I&#39;m not being a researcher/au=\r\nthor, I&#39;m an artist, so I&#39;d noticed the painting&#39;s subject, medium, artist&#39;=\r\ns name, date, etc.)&lt;br&gt;\n&lt;br&gt;\nThe two people hadn&#39;t looked closely at the pa=\r\ninting.  However, when they did, they felt that it included exactly the kin=\r\nd of message they were looking for.&lt;br&gt;\n&lt;br&gt;\nWhat most impressed me were th=\r\neir reactions.  Both are fairly accustomed to paranormal phenomena and the =\r\nways that people convince themselves that whatever-it-is is actually a mess=\r\nage.&lt;br&gt;\n&lt;br&gt;\nHowever, this incident seemed to have significance to them, a=\r\nnd satisfied them that they&#39;d rec&#39;d the message they were looking for.&lt;br&gt;\n=\r\n&lt;br&gt;\nIt&#39;s just anecdotal and just one incident, but... well, there it is.  =\r\nI think the Ghost Radar is worth exploring if you already have a droid or s=\r\nimilar tool.  And, for the price... well, hey, why not!&lt;br&gt;\n&lt;br&gt;\nI&#39;ll exper=\r\niment with it more when I actually own something it&#39;ll run on.  For now, ot=\r\nher research is a higher priority.&lt;br&gt;\n&lt;br&gt;\nCheerfully,&lt;br&gt;\nFiona&lt;br&gt;\n&lt;br&gt;\n=\r\n--- In &lt;a rel=3D&quot;nofollow&quot; ymailto=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot; tar=\r\nget=3D&quot;_blank&quot; href=3D&quot;/mc/compose?to=3DEVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@=\r\nyahoogroups.com&lt;/a&gt;, &quot;Timbo&quot; &lt;timbo1138@...&gt; wrote:&lt;br&gt;\n&gt;&lt;br&gt;\n&gt;=\r\n I started a group about Ghost Radar App. If you use it come by and check i=\r\nt out. I want to be able to share experiences using the new tool.&lt;br&gt;\n&gt; =\r\nthanks&lt;br&gt;\n&gt; &lt;a rel=3D&quot;nofollow&quot; target=3D&quot;_blank&quot; href=3D&quot;http://tech.g=\r\nroups.yahoo.com/group/ghost_radar_experiences/&quot;&gt;http://tech.groups.yahoo.co=\r\nm/group/ghost_radar_experiences/&lt;/a&gt;&lt;br&gt;\n&gt; Timothy&lt;br&gt;\n&gt;&lt;br&gt;\n&lt;br&gt;\n&lt;/p=\r\n&gt;\n\n    &lt;/div&gt;\n     \n\n\n\n \n\n\n\n\n\n&lt;/div&gt;&lt;/blockquote&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n  =\r\n    \r\n--0-378012662-1284444149=:12508--"}