{"id": "18715", "subject": "Re: [EVP-ITC] Re: [RTSC] RF amp from AM", "author": "Frank Sumption", "timestamp": "2010-09-15T16:08:07Z", "full_text": "It would be tough to add the amp to a hack radio, I added it to the tuner\nafter it was unmanufactured. You have to pull the tuner, add some turns of\nwire around the antena rod, bring some leads out of the case and make a\nlittle add on box outside the radio. Might be easier, but more expensive to\nget an external antenna, like C-Crane&#39;s twin coil ferrite antenna, or RS&#39;s\namplfied AM antenna. You should be able to get AM skipo at night.\n\n F-S\nOn Wed, Sep 15, 2010 at 10:00 AM, Snowfire Lioness &lt;SnowfireL@...&gt;wrote:\n\n&gt;\n&gt;\n&gt; Wish i had me one of those, this RS 12-150 works well on the FM but, very\n&gt; little comes in on AM, not enough stations around here I guess, I put an\n&gt; ante on it too.  The Peanut gallery are still crossing into the light to be\n&gt; with (You know who) one at a time, and they are saying the line going is\n&gt; still huge. sf\n&gt;\n&gt;\n&gt;\n&gt; -----Original Message-----\n&gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com; RTSC@yahoogroups.com\n&gt; Sent: Wed, Sep 15, 2010 2:19 am\n&gt; Subject: [RTSC] RF amp from AM [6 Attachments]\n&gt;\n&gt;\n&gt;  [Attachment(s)&lt;https://mail.google.com/mail/?ui=2&view=js&name=main,tlist&ver=Q6vO6XqMw58.en.&am=!W2uZWpgK4PexhZ4C2vD2RkQQRnToy8mwki44JFdBukOjO36y4Jg&fri#12b162213832d34d_TopText&gt;from Frank Sumption included below]\n&gt;  Trying to get improvement for weak signal areas. I added a simple single\n&gt; stage FET antenna amplifier to the AM rod antenna by adding and extra loop\n&gt; on the end of the rod. It&#39;s specially designed to reject all MP3 signals at\n&gt; the antenna :-0\n&gt;\n&gt;  F-S\n&gt;\n&gt; \n&gt;\n\nI would be ough o add he amp o a hack adio, I added i o he une a e i was unmanu ac u ed. You ha e o pull he une , add some u ns o wi e a ound he an ena od, b ing some leads ou o he case and make a li le add on box ou side he adio. Migh be easie , bu mo e expensi e o ge an ex e nal an enna, like C-C ane's win coil e i e an enna, o RS's ampl ied AM an enna. You should be able o ge AM skipo a nigh . \n\n \n F-S\nOn Wed, Sep 15, 2010 a 10:00 AM, Snow i e Lioness Snow i eL@...> w o e:\n\n  \n\n\n\nWish i had me one o hose, his RS 12-150 wo ks well on he FM bu , e y li le comes in on AM, no enough s a ions a ound he e I guess, I pu an an e on i oo.  The Peanu galle y a e s ill c ossing in o he ligh o be wi h (You know who) one a a ime, and hey a e saying he line going is s ill huge. s \n\n\n\n\n\n\n-----O iginal Message-----F om: F ank Sump ion pu plealiengi l@...>To: EVP-ITC@yahoog oups.com; RTSC@yahoog oups.com\nSen : Wed, Sep 15, 2010 2:19 amSubjec : [RTSC] RF amp om AM [6 A achmen s]\n\n  \n\n\n[A achmen (s) om F ank Sump ion included below] \n\n T ying o ge imp o emen o weak signal a eas. I added a simple single s age FET an enna ampli ie o he AM od an enna by adding and ex a loop on he end o he od. I 's specially designed o ejec all MP3 signals a he an enna :-0\n\n \n F-S"}