{"id": "18721", "subject": "Re: [EVP-ITC] The Worldwide Radio Sweep EVP Alliance on Face Book", "author": "Frank Sumption", "timestamp": "2010-09-16T16:16:25Z", "full_text": "I don&#39;t know if I was successful in creating a Facebook account. Technology\nhates me.\n\n F-S\n\nOn Thu, Sep 16, 2010 at 9:27 AM, f1cracker75 &lt;f1cracker75@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Hello everyone. I have created a Face Book titled &quot;The Worldwide Radio\n&gt; Sweep EVP Alliance&quot; with intent to create a fan base for our cause, a place\n&gt; where newcomers can access our yahoo sites from the wall or discussions\n&gt; view, and through fan base membership get a feeling for how many of us\n&gt; actually exist worldwide.\n&gt;\n&gt; In conversation with many FB friends, mostly of the paranormal\n&gt; investigation group, most of these groups do not believe in nor use Radio\n&gt; Sweep technology during their investigations.\n&gt;\n&gt; Paranormal meetup groups around the country are popping up with intent to\n&gt; teach the general public how to perform an investigation using cameras and\n&gt; recorders, but again they tend to leave out Radio Sweep as a usable device.\n&gt;\n&gt; We have a valuable tool that we know can and does bring in paranormal\n&gt; messages, but I am in belief that these paranormal groups as well as the\n&gt; likes of AAEVP or like organizations are keeping our work hidden away from\n&gt; individuals that would benefit from it, as well as have the intelect and\n&gt; electronic backgrounds to get in the trenches with us to move our work into\n&gt; mainstream.\n&gt;\n&gt; Setting up this alliance fan page is a start, and I welcome each of you to\n&gt; join and post your web pages under discussion, so any newcomers can join\n&gt; your groups and perhaps become part of our cause.\n&gt;\n&gt;\n&gt; http://www.facebook.com/group.php?gid=102193593178906&v=app_2373072738&ref=mf#\n&gt; !/group.php?gid=102193593178906&v=wall&ref=mf\n&gt;\n&gt; Michael Edwards SDWR.\n&gt;\n&gt; \n&gt;\n\nI don' know i I was success ul in c ea ing a Facebook accoun . Technology ha es me.\n \n F-S\nOn Thu, Sep 16, 2010 a 9:27 AM, 1c acke 75 1c acke 75@...> w o e:\n\n  \n\n\n\nHello e e yone. I ha e c ea ed a Face Book i led \"The Wo ldwide Radio Sweep EVP Alliance\" wi h in en o c ea e a an base o ou cause, a place whe e newcome s can access ou yahoo si es om he wall o discussions iew, and h ough an base membe ship ge a eeling o how many o us ac ually exis wo ldwide.\nIn con e sa ion wi h many FB iends, mos ly o he pa ano mal in es iga ion g oup, mos o hese g oups do no belie e in no use Radio Sweep echnology du ing hei in es iga ions. Pa ano mal mee up g oups a ound he coun y a e popping up wi h in en o each he gene al public how o pe o m an in es iga ion using came as and eco de s, bu again hey end o lea e ou Radio Sweep as a usable de ice.\nWe ha e a aluable ool ha we know can and does b ing in pa ano mal messages, bu I am in belie ha hese pa ano mal g oups as well as he likes o AAEVP o like o ganiza ions a e keeping ou wo k hidden away om indi iduals ha would bene i om i , as well as ha e he in elec and elec onic backg ounds o ge in he enches wi h us o mo e ou wo k in o mains eam.\nSe ing up his alliance an page is a s a , and I welcome each o you o join and pos you web pages unde discussion, so any newcome s can join you g oups and pe haps become pa o ou cause.h p://www. acebook.com/g oup.php?gid=102193593178906& =app_2373072738& e =m #!/g oup.php?gid=102193593178906& =wall& e =m \nMichael Edwa ds SDWR."}