{"id": "18744", "subject": "Re: [EVP-ITC] What do you use?", "author": "Frank Sumption", "timestamp": "2010-09-20T22:39:58Z", "full_text": "I prefer magnetic tape--not so lossy as digital junk.\n\n F-S\n\nOn Mon, Sep 20, 2010 at 9:09 AM, Zack Widup &lt;w9sz.zack@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; I use an Olympus VN960PC. It&#39;s a nice recorder but they have come out with\n&gt; advanced models for about the same cost as mine. I think they have models in\n&gt; the same series that record 24 hours or more of audio in the Hi-Q position.\n&gt; BTW I would only use the Hi-Q position with this machine unless I&#39;m just\n&gt; recording notes to myself.\n&gt;\n&gt; The things I like about it are that it records each new audio in a new\n&gt; file, it has three general use folders and one that goes by date, has lots\n&gt; of features and it&#39;s very easy to use. Batteries last a long time.\n&gt;\n&gt; Things I don&#39;t like about this particular model are that it only has 6\n&gt; hours of recording time, and you have to use their special program to\n&gt; download the files to your computer, and it takes a long time. 6 hours of\n&gt; audio takes about 20 minutes to download.\n&gt;\n&gt; Zack\n&gt;\n&gt;\n&gt;  On Mon, Sep 20, 2010 at 2:54 AM, usmcmacswife &lt;usmcmacswife@...&gt;wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; What brand of recorders do each one of you use to record EVP&#39;s or when you\n&gt;&gt; speak to someone with a ghost box?\n&gt;&gt;\n&gt;&gt; We are looking at changing our recorder. The one we want to go with it no\n&gt;&gt; longer being made..\n&gt;&gt; We&#39;d like to find one that is compatible with MAC and Windows Computers.\n&gt;&gt;\n&gt;&gt; Your response and input as to why you like it, love it or hate it would be\n&gt;&gt; deeply appreciated!!!\n&gt;&gt; We don&#39;t want to jut go out buy one and hate it again!!!\n&gt;&gt;\n&gt;&gt; Thank you in advance!!!\n&gt;&gt;\n&gt;&gt;\n&gt;  \n&gt;\n\nI p e e magne ic ape--no so lossy as digi al junk.\n \n F-S\nOn Mon, Sep 20, 2010 a 9:09 AM, Zack Widup w9sz.zack@...> w o e:\n\n  \n\n\n\nI use an Olympus VN960PC. I 's a nice eco de bu hey ha e come ou wi h ad anced models o abou he same cos as mine. I hink hey ha e models in he same se ies ha eco d 24 hou s o mo e o audio in he Hi-Q posi ion. BTW I would only use he Hi-Q posi ion wi h his machine unless I'm jus eco ding no es o mysel .\nThe hings I like abou i a e ha i eco ds each new audio in a new ile, i has h ee gene al use olde s and one ha goes by da e, has lo s o ea u es and i 's e y easy o use. Ba e ies las a long ime.\nThings I don' like abou his pa icula model a e ha i only has 6 hou s o eco ding ime, and you ha e o use hei special p og am o download he iles o you compu e , and i akes a long ime. 6 hou s o audio akes abou 20 minu es o download.\nZack\n\nOn Mon, Sep 20, 2010 a 2:54 AM, usmcmacswi e usmcmacswi e@...> w o e:\n\n\n  \n\n\n\nWha b and o eco de s do each one o you use o eco d EVP's o when you speak o someone wi h a ghos box?We a e looking a changing ou eco de . The one we wan o go wi h i no longe being made..\nWe'd like o ind one ha is compa ible wi h MAC and Windows Compu e s.You esponse and inpu as o why you like i , lo e i o ha e i would be deeply app ecia ed!!!We don' wan o ju go ou buy one and ha e i again!!!\nThank you in ad ance!!!"}