{"id": "18755", "subject": "Re: E.F.P.-has anyone heard of this or tried this piece of equipment?", "author": "Country", "timestamp": "2010-09-22T02:01:07Z", "full_text": "Thanks for your response, Tim. Are you saying that basically what this unit provides, versus typical digital recorders, is white noise and the ability to visually see when you have caught an EVP? If so, I agree that the $145.00 price is a bit steep.\nCheers,\nCountry\n\n--- In EVP-ITC@yahoogroups.com, Tim Woolworth &lt;tjwoolworth@...&gt; wrote:\n&gt;\n&gt; My understanding of this device is that it has a white noise generator that\n&gt; you adjust when your recorder is in record mode while the speaker output is\n&gt; plugged into the device.  The idea is to adjust the white noise so that\n&gt; there is no spike on the meter.  This ideally would set the white noise\n&gt; level as being the same as the room in which you are in and fine tuned to\n&gt; the inherent noise in your recorder.  Once this is done, any noise that goes\n&gt; above this white noise threshold would cause a jump in the LED meter.\n&gt;  Obviously, during the questioning part of an EVP session, your voice would\n&gt; register on the LED&#39;s as being above the white noise threshold.  The idea is\n&gt; to look at the meters when no one is talking to see if you get an EVP.   The\n&gt; EVP should also trigger the meters if it is above the noise level of the\n&gt; room.  I looked at buying one of these back in May when they were first made\n&gt; available, but I didn&#39;t think it would be worth the $145 the group was\n&gt; charging for them because any cough, rustle of jackets, or movement would\n&gt; also trigger the LED&#39;s and in a group with more than one person in a\n&gt; session, this could create frustrating false positives.\n&gt; \n&gt; On Sat, Sep 18, 2010 at 8:18 PM, Country &lt;plaine@...&gt; wrote:\n&gt; \n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Greetings Everyone....\n&gt; &gt;\n&gt; &gt; In search to try all methods or equipment for EVP/ITC, I have come across\n&gt; &gt; this piece of equipment at Ebay. Could someone explain in simpler terms what\n&gt; &gt; this does and how? Apparently you need your own digital recorder to record\n&gt; &gt; anything this picks up.\n&gt; &gt;\n&gt; &gt; Also I noticed that this the group mentioned who endorses this meter is\n&gt; &gt; also the manufacturer.\n&gt; &gt;\n&gt; &gt; *Thanks for your help,\n&gt; &gt; *Country\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; The E.F.P. has been tested and is commonly used by the American Paranormal\n&gt; &gt; Research Association, proving to be a valuable tool when conducting E.V.P.\n&gt; &gt; investigations\n&gt; &gt;\n&gt; &gt; The E.F.P.&#39;s &quot;real time, high visibility&quot; green with red\n&gt; &gt; center LED display, allows others to view E.V.P. responses\n&gt; &gt; easily in dark locations. This feature allows users the\n&gt; &gt; ability to capture E.V.P. evidence on video. The device\n&gt; &gt; has a &quot;white noise/ambient noise baseline adjustment&quot;\n&gt; &gt; allowing the user, to set the baseline level on the devices\n&gt; &gt; illuminated scale. This provides a &quot;visual reference&quot; to\n&gt; &gt; see in real time any &quot;addition&quot; or &quot;reduction&quot; of\n&gt; &gt; proprietary frequency noise. The E.F.P.&#39;s built in circuitry\n&gt; &gt; amplifies input signals to high levels allowing users to\n&gt; &gt; visually monitor E.V.P. responses at higher resolution. The\n&gt; &gt; input to the device has (1) 3.5mm stereo plug used to\n&gt; &gt; connect to any recording devices live audio output\n&gt; &gt; (earphone). The E.F.P. also has (1) 3.5mm audio output\n&gt; &gt; which can be used for earphone or mp3 type speakers.\n&gt; &gt; The E.F.P. has a &quot;manual on/off switch&quot; and built in &quot;push\n&gt; &gt; button single LED navigational light&quot;. The E.F.P. operates\n&gt; &gt; on one standard &quot;9volt&quot; battery. The current regulation\n&gt; &gt; circuitry in the device provides hours of use.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;  \n&gt; &gt;\n&gt;"}