{"id": "18771", "subject": "Re: [EVP-ITC] Minibox 2 Test----Remember this box? [6 Attachments]", "author": "Frank Sumption", "timestamp": "2010-09-27T06:23:05Z", "full_text": "Still works better than many of my boxes.\n\n F-S\n\nOn Sat, Sep 25, 2010 at 2:30 PM, &lt;urkel23@...&gt; wrote:\n\n&gt;\n&gt;  [Attachment(s)&lt;https://mail.google.com/mail/?ui=2&view=js&name=main,tlist&ver=PLpFW8mo6ZU.en.&am=!Y-v-bx6-hLCxhZ4C2vD2RvIM-1u6I_ggKFI_CVzYW0-PTv2Kn6GH&fri#12b4a97e414f232b_TopText&gt;from\n&gt; urkel23@... included below]\n&gt;\n&gt;\n&gt; Going through some stuff today and came across this box.  Ron from\n&gt; paranormalsystems.com only sold a dozen of these and i think 11 came back\n&gt; to him.  That project was a disaster from start to finish.  I tried to help,\n&gt; but cheap parts were used to build it.\n&gt;\n&gt; I took it apart today to look and see what i can do to improve it.  The\n&gt; first thing i noticed was a crappy antenna, so i swapped it out with one\n&gt; from a broken radio sitting here.\n&gt;\n&gt; Reception did improve, but it still sucks.  It&#39;s like polishing a\n&gt; turd......Sorry, i know that was disgusting.\n&gt;\n&gt; This box is AM Random mode only.  I think when you try to get too advanced\n&gt; with building these, that&#39;s when the problems start.  Simple is the best way\n&gt; to do it.  I&#39;ve attached the raw audio of the test with it and some sample\n&gt; files i got.\n&gt;\n&gt; Now i guess it goes back into the closet where i got it from.\n&gt;\n&gt; -Steve\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; *Steve Hultay\n&gt; *www.keyportparanormal.com*\n&gt; http://tech.groups.yahoo.com/group/rtsc/\n&gt; www.stevehultay.com\n&gt; www.rtscresearch.org*\n&gt;\n&gt; \n&gt;\n\nS ill wo ks be e han many o my boxes.\n \n F-S\nOn Sa , Sep 25, 2010 a 2:30 PM, u kel23@aol.com> w o e:\n\n  \n\n\n[A achmen (s) om u kel23@... included below] \n\n \nGoing h ough some s u oday and came ac oss his box.  Ron om pa ano malsys ems.com only sold a dozen o hese and i hink 11 came back o him.  Tha p ojec was a disas e om s a o inish.  I ied o help, bu cheap pa s we e used o build i .\n\n \nI ook i apa oday o look and see wha i can do o imp o e i .  The i s hing i no iced was a c appy an enna, so i swapped i ou wi h one om a b oken adio si ing he e.\n \nRecep ion did imp o e, bu i s ill sucks.  I 's like polishing a u d......So y, i know ha was disgus ing.\n \nThis box is AM Random mode only.  I hink when you y o ge oo ad anced wi h building hese, ha 's when he p oblems s a .  Simple is he bes way o do i .  I' e a ached he aw audio o he es wi h i and some sample iles i go .\n\n \nNow i guess i goes back in o he close whe e i go i om.\n \n-S e e\n \n \n \n \nS e e Hul aywww.keypo pa ano mal.com\nh p:// ech.g oups.yahoo.com/g oup/ sc/www.s e ehul ay.comwww. sc esea ch.o g"}