{"id": "18784", "subject": "Re: [EVP-ITC] Re: Now it says &quot;gypsie&quot;!", "author": "Frank Sumption", "timestamp": "2010-09-29T04:44:53Z", "full_text": "FYI all, that&#39;s not the same RJ-- I don&#39;t think! We had a skepdork that\nwent by RJ, did no recordings of his own, could accept no evidence,\ndisregarded all other researchers work and then presummed to tell us what\nwas really going on with EVP. I finally got fed up and kicked his ass off.\n\n F-S\n\nOn Tue, Sep 28, 2010 at 5:43 PM, &lt;SnowfireL@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; RJ, are you still doing this kind of thing?  What is it this time, I will\n&gt; ask David if he wishes to play with you this time. sf\n&gt;\n&gt;  In a message dated 8/9/2010 10:37:05 A.M. Eastern Standard Time,\n&gt; rasterer@... writes:\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; There&#39;s still time to submit answers for Experiment 4. Is anything you&#39;re\n&gt; doing related to that?\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Frank Sumption\n&gt; &lt;purplealiengirl@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; As if we need more debunker fodder! But now I hear &quot;gypsie F----ed the\n&gt; &gt; horizon&quot; off the tape. I don&#39;t know what the answer is, I get enough to\n&gt; &gt; show this is real, but I also get enough to make me want to throw my\n&gt; hands\n&gt; &gt; up to grab a big hammer!\n&gt; &gt;\n&gt; &gt; F-S\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nFYI all, ha 's no he same RJ-- I don' hink! We had a skepdo k ha wen by RJ, did no eco dings o his own, could accep no e idence, dis ega ded all o he esea che s wo k and hen p esummed o ell us wha was eally going on wi h EVP. I inally go ed up and kicked his ass o . \n\n \n F-S\nOn Tue, Sep 28, 2010 a 5:43 PM, Snow i eL@...> w o e:\n\n  \n\n\n\n\nRJ, a e you s ill doing his kind o hing?  Wha is i his ime, I will ask Da id i he wishes o play wi h you his ime. s \n \n\nIn a message da ed 8/9/2010 10:37:05 A.M. Eas e n S anda d Time, as e e @... w i es:\n  \n\nThe e's s ill ime o submi answe s o Expe imen 4. Is any hing you' e doing ela ed o ha ? --- In EVP-ITC@yahoog oups.com, F ank Sump ion w o e:\n>> As i we need mo e debunke odde ! Bu now I hea \"gypsie F----ed he> ho izon\" o he ape. I don' know wha he answe is, I ge enough o> show his is eal, bu I also ge enough o make me wan o h ow my hands\n> up o g ab a big hamme !> > F-S>"}