{"id": "18813", "subject": "Re: [EVP-ITC] Government Conspiracy... I Think Not", "author": "Frank Sumption", "timestamp": "2010-10-01T14:37:04Z", "full_text": "&quot;The proof&quot; is in what comes through, what is the meaning to the individual.\nI don&#39;t think you can prove a spirit is talking. The skeptics out there that\ntry to debunk this stuff put alot of doubt in people&#39;s minds. All you can, I\nthink is use the stuff and report your results.  Often information is\nreceived that tends to prove something talks that shouldn&#39;t be\nthere--ignored by the skeptics.\n\n F-S\n\nOn Fri, Oct 1, 2010 at 2:40 AM, adrianamjones &lt;adrianamjones@...&gt;wrote:\n\n&gt;\n&gt;\n&gt; So last Saturday I had my first ghost box session with an experienced box\n&gt; user who also claims to be an empath medium. It was successful, in that\n&gt; there were too many intelligent responses from the radio for it to be &quot;a\n&gt; coincidence&quot;. Despite this, there are some people I&#39;ve talked to about this\n&gt; who, even after having heard the recording of the session, still want to\n&gt; hold on to an old way of thinking at any cost to logic and reality. Just\n&gt; because it is too amazing to be true, doesn&#39;t ALWAYS mean that it is. For\n&gt; those of us that have experienced the paranormal in our life, we know that\n&gt; not all things in life are too incredible to be true. But for others, it is\n&gt; harder to accept...\n&gt; Tonight I hacked my first ghost box, a Radio Shack 20-125, it was an easy\n&gt; hack despite claims that it is difficult, and the fact that I am completely\n&gt; new to this area of research and know next to nothing about electronics. I\n&gt; could really see myself spending a lot of my future life immersed in this,\n&gt; so can anyone tell me... what do I say to somebody that wants to claim that\n&gt; ghost box communication is a technological government conspiracy akin to the\n&gt; conspiracy of using Christianity to brainwashes the masses... (i.e. to keep\n&gt; them believing in the next life, so they can be &quot;raped&quot; and willingly give\n&gt; to Caesar in this life). What is the proof and evidence against this being\n&gt; the case?\n&gt;\n&gt; \n&gt;\n\n\"The p oo \" is in wha comes h ough, wha is he meaning o he indi idual. I don' hink you can p o e a spi i is alking. The skep ics ou he e ha y o debunk his s u pu alo o doub in people's minds. All you can, I hink is use he s u and epo you esul s.  O en in o ma ion is ecei ed ha ends o p o e some hing alks ha shouldn' be he e--igno ed by he skep ics. \n\n \n F-S\nOn F i, Oc 1, 2010 a 2:40 AM, ad ianamjones ad ianamjones@...> w o e:\n\n  \n\n\n\nSo las Sa u day I had my i s ghos box session wi h an expe ienced box use who also claims o be an empa h medium. I was success ul, in ha he e we e oo many in elligen esponses om he adio o i o be \"a coincidence\". Despi e his, he e a e some people I' e alked o abou his who, e en a e ha ing hea d he eco ding o he session, s ill wan o hold on o an old way o hinking a any cos o logic and eali y. Jus because i is oo amazing o be ue, doesn' ALWAYS mean ha i is. Fo hose o us ha ha e expe ienced he pa ano mal in ou li e, we know ha no all hings in li e a e oo inc edible o be ue. Bu o o he s, i is ha de o accep ...\nTonigh I hacked my i s ghos box, a Radio Shack 20-125, i was an easy hack despi e claims ha i is di icul , and he ac ha I am comple ely new o his a ea o esea ch and know nex o no hing abou elec onics. I could eally see mysel spending a lo o my u u e li e imme sed in his, so can anyone ell me... wha do I say o somebody ha wan s o claim ha ghos box communica ion is a echnological go e nmen conspi acy akin o he conspi acy o using Ch is iani y o b ainwashes he masses... (i.e. o keep hem belie ing in he nex li e, so hey can be \" aped\" and willingly gi e o Caesa in his li e). Wha is he p oo and e idence agains his being he case?"}