{"id": "18817", "subject": "Re: [EVP-ITC] FM", "author": "Frank Sumption", "timestamp": "2010-10-01T17:59:30Z", "full_text": "Thanks. Mostly what I want to know is if I&#39;m just hearing broadcast frags,\nor if anyone hears something similar to what I get. Kinda like additional\ntesting.\n\n F-S\n\nOn Fri, Oct 1, 2010 at 10:45 AM, Snowfire Lioness &lt;SnowfireL@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;\n&gt; Hear all yours frank, loud and clear, just don&#39;t have time to write down\n&gt; all they are saying though, they are regular little chatter boxes over there\n&gt; at your house Frank. sf\n&gt;\n&gt; -----Original Message-----\n&gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com; RTSC@yahoogroups.com\n&gt; Sent: Fri, Oct 1, 2010 2:32 am\n&gt; Subject: [EVP-ITC] FM [1 Attachment]\n&gt;\n&gt;\n&gt;  [Attachment(s)&lt;https://mail.google.com/mail/?ui=2&view=js&name=main,tlist&ver=PLpFW8mo6ZU.en.&am=!Y-v-bx6-hLCxhZ4C2vD2RvIM-1u6I_hAKFI_CVzYW09PTIsUQC10&fri#12b68afe7029e8aa_TopText&gt;from Frank Sumption included below]\n&gt;    Less than a minute of FM, you can hear more feedback in this--feedback\n&gt; is from being in echo chamber mode. At 3 seconds &quot;box---big box&#39;,\n&gt; 15--seconds &quot;Hultay gets---something&quot;, at about 23 seconds a weird one &quot;the\n&gt; end comes in hours--you leave the planet&quot;, like I haven&#39;t heard that about a\n&gt; thousand times.\n&gt;\n&gt;  I found if I lift the top panel up I kills the feedback, so I drilled some\n&gt; 3/8 vent holes in the sides that helped quite a bit.\n&gt;\n&gt;  These aren&#39;t Jack approved EVPs, so probably not real, since they are not\n&gt; in digital format--except conversion to mp3 for e-mailing. This recording\n&gt; started out braodcast out of the radio station analog, traveled to the radio\n&gt; in analog RF, was down converted in the radio chip in analog circuits, and\n&gt; the audio was recorded on magnetic tape. The EVPs are clearer from tape,\n&gt; that&#39;s why I use it, cuz digital sucks! I&#39;d use tubes if it wasn&#39;t for the\n&gt; high voltage power supplies and larger transformers. Some worship this high\n&gt; tech crap, which is killing the planet. They over estimate it&#39;s true value.\n&gt;\n&gt;  F-S\n&gt;\n&gt; \n&gt;\n\nThanks. Mos ly wha I wan o know is i I'm jus hea ing b oadcas ags, o i anyone hea s some hing simila o wha I ge . Kinda like addi ional es ing. \n \n F-S\nOn F i, Oc 1, 2010 a 10:45 AM, Snow i e Lioness Snow i eL@...> w o e:\n\n  \n\n\n\n\n\nHea all you s ank, loud and clea , jus don' ha e ime o w i e down all hey a e saying hough, hey a e egula li le cha e boxes o e he e a you house F ank. s \n\n\n\n\n-----O iginal Message-----F om: F ank Sump ion pu plealiengi l@...>To: EVP-ITC@yahoog oups.com; RTSC@yahoog oups.com\nSen : F i, Oc 1, 2010 2:32 amSubjec : [EVP-ITC] FM [1 A achmen ]\n\n  \n\n\n[A achmen (s) om F ank Sump ion included below] \n\n   Less han a minu e o FM, you can hea mo e eedback in his-- eedback is om being in echo chambe mode. A 3 seconds \"box---big box', 15--seconds \"Hul ay ge s---some hing\", a abou 23 seconds a wei d one \" he end comes in hou s--you lea e  he plane \", like I ha en' hea d ha abou a housand imes. \n\n \n I ound i I li he op panel up I kills he eedback, so I d illed some 3/8 en holes in he sides ha helped qui e a bi . \n \n These a en' Jack app o ed EVPs, so p obably no eal, since hey a e no in digi al o ma --excep con e sion o mp3 o e-mailing. This eco ding s a ed ou b aodcas ou o he adio s a ion analog, a eled o he adio in analog RF, was down con e ed in he adio chip in analog ci cui s, and he audio was eco ded on magne ic ape. The EVPs a e clea e om ape, ha 's why I use i , cuz digi al sucks! I'd use ubes i i wasn' o he high ol age powe supplies and la ge ans o me s. Some wo ship his high ech c ap, which is killing he plane . They o e es ima e i 's ue alue. \n\n \n F-S"}