{"id": "18819", "subject": "Re: Messages this morning?", "author": "adrianamjones", "timestamp": "2010-10-01T19:40:55Z", "full_text": "Jennifer,\nDon&#39;t worry about feeling weird.  I&#39;ve felt &quot;weird&quot; most of my life... though I can&#39;t speak for anyone here (and this is only my second post here, lol)  I&#39;d venture to say that many other people in this group have experienced similar feelings at one point or another.\nI forget the actual website, but I too have read in the last few days the theory that some of what comes through the ghost box can be the thoughts of the living... and that this would make sense given the idea that ghosts are the survival of our consciousness after the death of the physical body.  If ghosts are simply the survival of our consciousness, it would be that same consciousness that exists in us while we are alive, and would therefore operate upon the ghost box by technically the same mechanism... or so goes the theory... upon first ponder, it makes a lot of sense...\nAs far as being ridiculed, remember what the say about The Truth..\n\nTruth passes through three phases:\n\nFirst it is ridiculed. \nSecond it is fiercely and violently opposed. \nThird, it becomes self-evident. \n Arthur Schopenhauer\n\n\n\n--- In EVP-ITC@...m, &quot;jennifer&quot; &lt;3eyesofwisdom@...&gt; wrote:\n&gt;\n&gt; Fiona, this was an exciting link for me. I have so many strange phenomena and I have grown quiet, i suppose as others may have, due to ridicule. It has made me wonder if the ghost boxes pick up some of the human thoughts of the living. If the mind can influence machine I think it is very possible. \n&gt; I am not very knowledgeable on electronics but I have been looking for a group I can discuss some psychic phenomena. I would openly discuss it here but I do not want to distract the focus of the group.  perhaps I can explain my weirdness to the people who are in the GCP group or one of the sites. I could here too, if it doesn&#39;t bother anyone.\n&gt; This seems to go right along with what I saw that I have yet been able to fully explain. Anyways, Thanks for the link.\n&gt; Jennifer\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Fiona Broome&quot; &lt;email@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hi,\n&gt; &gt; \n&gt; &gt; I&#39;m interested in very recent EVP-ITC messages... what people have heard on boxes, etc.  \n&gt; &gt; \n&gt; &gt; This morning, there&#39;s an unusual display of RNG anomalies at the GCP (Global Consciousness Project) site: http://gcpdot.com/\n&gt; &gt; \n&gt; &gt; If you read this too late to see it, I&#39;ve posted a screenshot and some blather about possible connections, at http://extreme.hollowhill.com/global-consciousness-dot-blip\n&gt; &gt; \n&gt; &gt; At this point, it&#39;s a stretch to connect the dot anomalies with anything else.  I just figured I&#39;d mention it, in case anyone looks at the data and has an &quot;ah-HA!&quot; thought.\n&gt; &gt; \n&gt; &gt; Cheerfully,\n&gt; &gt; Fiona\n&gt; &gt;\n&gt;"}