{"id": "18825", "subject": "Ghost Box Success Rate", "author": "Adriana Jones", "timestamp": "2010-10-02T09:51:23Z", "full_text": "What is the general success rate in receiving intelligent word exchanges between the operators and the radio?  What percent of the time? And what percentage is considered &quot;better than coincidence&quot;?  I know that in statistics, better than 50% is considered better than mere chance, but there is nobody that would disagree that even 25% success rate would be considered &quot;better than coincidence&quot; in the case of using a ghost box.  The reason that I ask is because as I&#39;m really getting into ghost boxes in the last few days I notice that various articles, like the wiki article on evp sound a bit skeptical, yet my first and so far only ghost box session was significantly successful.  I left 100% convinced.  Does the fact that a person who claims to be psychic was its operator, make a difference in success rate? \n\nI was really psyched after leaving the session, which was done at a haunted covered bridge at night, where I also felt what is said to be a ghost (the air feels electrified).  \n\nHas anyone in the ghost box operating community ever tried to conduct systematic, videotaped scientifically rigorous repetitions of the sessions?  If the kind of success I experienced that night could happen again and again, why are people so skeptical?  Incredible as it sounds, it&#39;s occurring.  And just because we can&#39;t explain why, doesn&#39;t mean its not happening.  I have the whole session recorded and would like to post up some of the snippets (just want to get permission from my local hunting group to make sure its ok), because they are - contrary to claims made in various skeptical articles - NOT, I repeat, NOT just words that people are trying to construct with their minds out of mere noise, they are in fact clearly spoken words coming out of the radio.... at just the right times... again and again... I would say that categorically rules out the possibility of coincidence...\n\nSo any info on anyone trying to systematically prove this phenomenon by scientific method? Or has no one tried yet?"}