{"id": "18826", "subject": "Re: all the meditation colors", "author": "inyanga4", "timestamp": "2010-10-02T15:09:11Z", "full_text": "This color meditation is a great one - I&#39;ve found it VERY helpful over the years for inducing a state of relaxed focused awareness. Not only is this beneficial for GB work & listening, but as Adriana noted it may also elicit &quot;clairvoyant&quot; type visions at times. \n\nI first discovered this meditation technique as a &quot;cure&quot; for insomnia about 15-16 years ago in a book called &quot;Lessons in Instant ESP&quot; by David St.Clair. Great book for those of you who wish to check it out!\n\nHere is a free Scribd link to the book and resource: http://www.scribd.com/doc/17056459/David-Stclairs-Lessons-in-Instant-ESP\n\nThe book is OOP and a classic in the field. I base my psychic development classes off of this text and my students never fail to get wonderful results. I highly recommend it. \n\nFor those people who experience difficulty visualizing imagery with their eyes closed, there&#39;s another exercise you can do with phosphenes (the colored, flashing after-images of light and objects retained in our visual field).\n\nTo create a phosphene you&#39;ll need a low watt lamp and lightbulb (about 60 watts works perfectly). Sit roughly 5 feet away from the lamp and focus on the lightbulb for 30 seconds or so. If your eyes are too sensitive for such a practice at first you can cover the lamp with a piece of white cloth (a white sheet or even a t-shirt works fine). \n\nWhen finished with your light gazing, close your eyes and enjoy the phosphene you&#39;ve just created!\n\nYou&#39;ll immediately see a colored circle appear in your mind&#39;s eye and (inner) plane/field of vision. This colored sphere can remain anywhere from 1 to 3 minutes or so. Breathing, chanting and gentle rhythmic swaying can increase the effects and intensity of the phosphene, and this practice is known as &quot;Phosphenic Mixing&quot; or &quot;Phosphenism&quot; developed by a one Doctor Lefebure. \n\nMore information and a near-complete course available via PDF for free download is available here:   http://www.phosphenism.com/methode.html\n\nThough this is an artificial method for creating phosphenes, the effects are obvious in nature just the same. For instance, scrying (&#39;gazing&#39;) into a bowl of water, glass of wine, crystal sphere, a mirror and other reflective surfaces bearing a light source will create a phosphene. The ancients used to create them by gazing upon lakes, ponds, streams and the ocean as the sun or moon was reflected upon the water&#39;s surface. This will also produce a phosphene. \n\nMuch like the &quot;Red, Orange, Yellow, Green, Blue, Indigo & Violet (Purple)&quot; meditation and color visualization technique, your phosphenes will pulse, shift and morph through the color spectrum over the 1-3 minutes of their lifespan. This is exceedingly helpful for those students and practitioners who have trouble creating bursts of color in their mind&#39;s eye only and is a sufficient tool for training and conditioning one&#39;s visionary faculties. I&#39;ve noticed time and time again that it only takes a handful of live phosphenes to be experienced and once that&#39;s done nearly ANY person can easily begin to see colors brought to focus in their mind&#39;s eye and imagination. \n\nOrmond McGill used a similar meditation technique (taught in various books to his credit, also appearing in his &quot;Encyclopedia of Stage Hypnosis&quot; with several other Yogic-type inductions & meditation techniques) and would end his sequence by visualizing WHITE LIGHT moving within him and all around him. This is also very helpful, in my experience. \n\nBefore just about any (every!) GB session I do I like to take a few moments and create a mental phosphene (without the lamp or lightbulb, much like Frank explains in his OP on the subject) and end it by visualizing pure white light flowing through me and the GB connecting us. This DOES seem to affect the quality of the voices and clarity of the communication and messages coming through. \n\nNOTE: I do NOT do this as any sort of &quot;protective&quot; measure for the simple reason that I do not believe we have anything to be afraid of during our GB sessions besides deceiving ourselves, buying into the messages too heavily or taking this stuff TOO seriously. \n\nI keep in mind that we&#39;re researchers and conducting experimental sessions with experimental equipment and devices. Both the impetus behind the phenomena, the results and exactly how it works is something we don&#39;t quite understand at this point and should be kept in mind. The worst thing I believe can happen is that one can get scared by what comes through (whether it&#39;s the subject matter, clarity of the voices or accuracy and relevance of the info provided) and up to this point I have no reason to believe otherwise. \n\nBy going into these sessions with a mindframe of NEEDING to be protected I think we set ourselves up for a potentially negative experience and condition or bias our results. I&#39;ve seen many a new GB facilitator work themselves (and others) into a frenzy with elaborate smudgings, protective rites and rituals, banishing the room with hexagrams and pentagrams, giving folks large chunks of crystals and hematite to hold for grounding, etc. I&#39;ve never seen it do a bit of good, but to the contrary, I HAVE seen such practices negatively impact and affect sitters, friends, witnesses to the phenomena and other (would-be) researchers in the long run by opening their sessions with an underlying thread and covert fear-based suggestions and responses. \n\nEND NOTE (and a word to the wise!). \n\nShifting back to the use of lights and light/color visualizations for use in this work, meditation in general, hypnosis & hypnotherapy (automatic/self, facilitated or otherwise) I&#39;ve discovered a few more techniques that really add volumes to these practices and my own private work and research that folks may like to experiment with.\n\nOne of these is simply working with binaural tones and &quot;HemiSync&quot; technology (in specially formed musical tracks known today as &quot;Metamusic&quot;) as offered by the Monroe Institute and other whole brain learning/hemispheric synchronization practitioners. \n\nOne can find various HemiSync cd&#39;s online through a number of stores and venues, as well as locally in numerous New Age shops, music stores and even the electronics department at our local Target & Wal-Mart at times!\n\nThe music is produced with binaural tones meant to synchronize the right and left hemispheres of the brain (allowing for a much greater capacity for information to travel and be exchanged freely between the two hemispheres) and creates a WHOLE BRAIN state. \n\nMuch like centering myself before listening to the GB, taking a few deep breaths and running through the color spectrum (mixing a phosphene) the use of binaural tones has proven invaluable to my work and seems to prepare my mind for that &quot;hearing between the lines&quot; that is so valuable to GB work and research. \n\nIf CD&#39;s aren&#39;t your thing, I recommend getting a set of tuning forks with C and G notes. We can use these two forks together to create &quot;The Perfect 5th Tone&quot; which also syncs&#39; up the right and left hemisphere of the brain. \n\nResearchers now estimate listening to &quot;The Perfect 5th&quot; tone for just 30-60 seconds (created by striking the C and G tuning forks together and listening to their soundwaves and vibrations simultaneously) as having and distributing the positive effects equal to roughly 30-45 minutes of deep meditation. Keep in mind this happens automatically as the cycles per second and brainwave states change naturally when hearing such a tone. The Perfect 5th also calms, relaxes and balances one&#39;s neurophysiology and brings one into a light, meditative or &quot;trance like&quot; state easily and naturally. All you have to do is listen.  ;)\n\nTuning forks are great for other things as well (energetic balancing, clearings and entering altered states, mostly). You can see a large selection of different tuning sets here: http://www.tuningforktherapy.com/photo_3.html\n\nYou&#39;ll notice a set of 7 forks (one for each major note/scale, basic color in the spectrum and associated energy center or &quot;chakra&quot;) is quite common. For a full mind/body meditation that only takes a few moments I teach my students how to strike the forks, hold them a few inches away from their ear(s) and take a deep breath while visualizing the corresponding color and/or energy center (Red = Sacrum, Orange = Navel, Yellow = Solar Plexus, etc). \n\nWorking in this fashion we travel through the various tones/forks and color spectrum and end with C & G together (creating the &quot;Perfect 5th&quot; tone) and visualize pure white light within us and all around us. While it takes less than 4 minutes to complete the entire sequence I&#39;ve found few things that change consciousness faster or more effectively (well, safely and LEGALLY that is, ha!). \n\nA German physician and MD named Hans Berger discovered that by simply closing our eyes and visualizing the 7 basic colors of the spectrum (as reflected through a prism - the same colors we&#39;ve been discussing this entire thread) that we naturally change our brainwave patterns and move from a waking BETA state, level of consciousness & activity (14-21 CPS, cycles per second) down to an ALPHA brainwave state and level of consciousness (roughly 8-12 CPS), which is PERFECT for ITC work and research. \n\nA recent book by the ever-popular WAYNE DYER titled, &quot;Getting in the Gap&quot; describes and teaches an effective sequence known as &quot;The AHH Meditation&quot; (also known as the 1 Minute Meditation). This technique literally only takes 1 MINUTE and is also incredibly effective for entering a state of relaxed focused awareness (i.e. &quot;trance&quot; or meditation = same thing!) and increased receptivity and sensitivity which may be helpful to practitioners working with EVP/ITC and specifically the GB tools, sessions and devices.  \n\nI also prefer a variant technique given to Wayne Dyer by a funny little Indian Guru who hit the scene recently. I don&#39;t put any stock in this guy&#39;s teachings BUT his original &quot;1 Minute Meditation&quot; is superb, uses basic tones and creation sounds (AH, OH, MA and OM) together to produce a similar state of physical relaxation, expanded mind and heightened consciousness. His MP3&#39;s are available for download (for very inexpensively I might add) here: http://www.pillaicenter.com/shopping/ShopEvents.aspx?categ=search&search=One%20Minute%20Mind%20Process\n\nI get a kick out of this guy and again, though I go no further with his teachings, personal beliefs and agenda I happily use his 1 Minute Meditation technique myself, with my clients and my students with incredible success. \n\nNow here&#39;s where things get REALLY fun!\n\nWe can use the AHH Meditation OR 1 Minute Meditation WITH the 7 color/spectrum visualization sequence together to improve the results and positive effects obtained therein. \n\nSupplementing this practice with tuning forks/pure musical notes and scales AND generated phosphenes (phosphenic mixing with a low watt lamp and natural light bulb) produces amazing effects. Besides greatly increasing my own natural knowing and intuition I&#39;ve found such things a perfect adjunct to my daily meditations and ghost box sessions. \n\nI figure, if it only takes 1 MINUTE and doesn&#39;t need to be any harder than simply seeing each of the 7 basic colors while humming or toning (internally) the sound &quot;AHH&quot;, what have I got to lose? \n\nThe positive results will speak for the practice itself. \n\nPart of my work with EVP/ITC and RTSC includes gauging the effects of light, colors, sound, crystals, magnets, geometric patterns (fractals, mandalas, Yantras, crop circles, etc) and Universal life force energies with these devices and how a carefully chosen combination of such modalities may affect the quality and clarity of our communications with the Ghost Box.\n\nMy apologies for the dreadfully long post. I&#39;m new here and while I&#39;ve rather enjoyed lurking and watching the fireworks, insightful posts, sharing and discussions so far I saw an opportunity being presented to add to the discussion and helpful input in an area I have some level of experience with. \n\nFrank is right on the money with his suggestion of seeing these colors and looking at like-colored objects (such as the flower bed) mentally or otherwise OOB to achieve, attain and elicit various changes in state within our own mind and consciousness prior to working with the Frank&#39;s Box and other devices.  \n\nOne (err, two) LAST things:\n\n1). Is ANY of this really necessary to obtain great results using the Ghost Box? \n\nAbsolutely not! \n\nI don&#39;t think there are any hard and fast or dead-set &quot;rules&quot; when it comes to this line of work and research. I and many others I know have attained great results without any prior conditioning or preiminary exercises having taken place whatsoever. If anything, the techniques I&#39;ve mentioned here may serve to help, aid and assist practitioners in their GB communications by simply RELAXING, becoming more open, receptive and aware of the messages, codes, voices and sound vibrations coming through the boxes. These techniques are by no means &quot;vital&quot; or necessary precursors to your own great results and experience using ITC devices.\n\n2). I am in no way, shape or form affiliated with any of the above resource links, shops or commercial/retail offerings and have nothing to gain by providing such links. They are meant and provided as working examples of tools, techniques and modalities that I myself have derived great use, work and benefit from and are included here for informational and educational purposes only...\n\n...in other words, &quot;Buyer Beware&quot; (!) and please remember the use of such techniques and suggestions as gazing into low watt light bulbs or holding vibrating tuning forks up to your ear drum are done at your own risk and neither I as a member of this group nor the hosts, group mods or originators of this group and forum can be held responsible or liable based on your own ability or decision to do so.\n\nNone of the information in this post is meant to cure, treat or diagnose any existing physical condition or malady and these practices, if at all questionable to you (such as in cases of certain epileptic people and those sensitive to lights, colors and sound) should only be used under the care, discretion and supervision of a properly trained and licensed medical doctor. \n\nNuff said. \n\n;)\n\nHope this helps!\n\n-JF\n\n\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt; I went to a medium development circle a couple times last year, and the\n&gt; visions received were similar to your cross.\n&gt; \n&gt;  F-S\n&gt; \n&gt; On Sat, Oct 2, 2010 at 1:04 AM, Adriana Jones &lt;adrianamjones@...&gt;wrote:\n&gt; \n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Funny you should say that because only a few days ago I myself read about\n&gt; &gt; doing this and its ability to open up your psychic side. I&#39;ve only tried it\n&gt; &gt; a little bit, but you mentioning it again here will reinforce it and I will\n&gt; &gt; try it more now. The first time I ever noticed my mind being able to do that\n&gt; &gt; I was over three years ago in an almost pitch black room at night in bed,\n&gt; &gt; and all of sudden I saw a fuzzy white cross floating near the ceiling, and I\n&gt; &gt; was like &quot;Whoa, did my mind just do that?&quot; And I&#39;m thankful for the fact\n&gt; &gt; that it was a white cross and no other thing, because I think anything else\n&gt; &gt; would have completely freaked me out. The fact that it was a white cross\n&gt; &gt; kept me calm about it. Later I tried to recreate the same white cross by\n&gt; &gt; thinking about it really hard, and I was able to do so but not as distinctly\n&gt; &gt; as when it &quot;just came&quot;. Recently I&#39;ve been able to think about a couple\n&gt; &gt; shapes and colors and actually make them show up in my mental visual field\n&gt; &gt; (eyes closed/dark room). Freaking fascinating.\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Frank Sumption\n&gt; &gt; &lt;purplealiengirl@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; Visualize red-oragnge-yellow-green-blue-violet. You have to be able to\n&gt; &gt; &gt; actually see the colors in the minds eye. I like to go out\n&gt; &gt; &gt; --non-physically-- and look at stuff like this to see the colors, it\n&gt; &gt; &gt; enhances psychic ability.\n&gt; &gt; &gt;\n&gt; &gt; &gt; F-S\n&gt; &gt; &gt;\n&gt; &gt;\n&gt; &gt; \n&gt; &gt;\n&gt;"}