{"id": "18822", "subject": "Re: [EVP-ITC] Re: all the meditation colors", "author": "Frank Sumption", "timestamp": "2010-10-02T07:07:40Z", "full_text": "I went to a medium development circle a couple times last year, and the\nvisions received were similar to your cross.\n\n F-S\n\nOn Sat, Oct 2, 2010 at 1:04 AM, Adriana Jones &lt;adrianamjones@...&gt;wrote:\n\n&gt;\n&gt;\n&gt; Funny you should say that because only a few days ago I myself read about\n&gt; doing this and its ability to open up your psychic side. I&#39;ve only tried it\n&gt; a little bit, but you mentioning it again here will reinforce it and I will\n&gt; try it more now. The first time I ever noticed my mind being able to do that\n&gt; I was over three years ago in an almost pitch black room at night in bed,\n&gt; and all of sudden I saw a fuzzy white cross floating near the ceiling, and I\n&gt; was like &quot;Whoa, did my mind just do that?&quot; And I&#39;m thankful for the fact\n&gt; that it was a white cross and no other thing, because I think anything else\n&gt; would have completely freaked me out. The fact that it was a white cross\n&gt; kept me calm about it. Later I tried to recreate the same white cross by\n&gt; thinking about it really hard, and I was able to do so but not as distinctly\n&gt; as when it &quot;just came&quot;. Recently I&#39;ve been able to think about a couple\n&gt; shapes and colors and actually make them show up in my mental visual field\n&gt; (eyes closed/dark room). Freaking fascinating.\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Frank Sumption\n&gt; &lt;purplealiengirl@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Visualize red-oragnge-yellow-green-blue-violet. You have to be able to\n&gt; &gt; actually see the colors in the minds eye. I like to go out\n&gt; &gt; --non-physically-- and look at stuff like this to see the colors, it\n&gt; &gt; enhances psychic ability.\n&gt; &gt;\n&gt; &gt; F-S\n&gt; &gt;\n&gt;\n&gt; \n&gt;\n\nI wen o a medium de elopmen ci cle a couple imes las yea , and he isions ecei ed we e simila o you c oss. \n \n F-S\nOn Sa , Oc 2, 2010 a 1:04 AM, Ad iana Jones ad ianamjones@...> w o e:\n\n  \n\n\n\nFunny you should say ha because only a ew days ago I mysel ead abou doing his and i s abili y o open up you psychic side. I' e only ied i a li le bi , bu you men ioning i again he e will ein o ce i and I will y i mo e now. The i s ime I e e no iced my mind being able o do ha I was o e h ee yea s ago in an almos pi ch black oom a nigh in bed, and all o sudden I saw a uzzy whi e c oss loa ing nea he ceiling, and I was like \"Whoa, did my mind jus do ha ?\" And I'm hank ul o he ac ha i was a whi e c oss and no o he hing, because I hink any hing else would ha e comple ely eaked me ou . The ac ha i was a whi e c oss kep me calm abou i . La e I ied o ec ea e he same whi e c oss by hinking abou i eally ha d, and I was able o do so bu no as dis inc ly as when i \"jus came\". Recen ly I' e been able o hink abou a couple shapes and colo s and ac ually make hem show up in my men al isual ield (eyes closed/da k oom). F eaking ascina ing.\n--- In EVP-ITC@yahoog oups.com, F ank Sump ion w o e:>> Visualize ed-o agnge-yellow-g een-blue- iole . You ha e o be able o\n> ac ually see he colo s in he minds eye. I like o go ou > --non-physically-- and look a s u like his o see he colo s, i > enhances psychic abili y.> > F-S>"}