{"id": "18835", "subject": "Re: [EVP-ITC] Ghost Box Success Rate", "author": "Frank Sumption", "timestamp": "2010-10-02T23:16:22Z", "full_text": "What&#39;s the chance of a personality coming through that I have gotten often,\nwhile I&#39;m doing a test video. &#39;bout a bazillion to one? How many times do\nthey call me &quot;Purple&quot;, just about everytime I turn one of these on.\n\n Then, what about other methods, what&#39;s the chance of the boxes mentioned\nwhile flipping between channels pairs on cable TV? At 10-11 seconds on this\nvideo &quot;Your boxes---you hear us&quot;. It&#39;s not just &quot;a box&quot; thing, it&#39;s anything\nthat provides bits of speech, and/or sound frequencies. Recording seems to\nallow manipulation of the sound bits, as if it&#39;s done in the air, between\nsource and recorder/ear---but you can also get the same thing with no\nexternal sound, recording from a line output on the box/radio. This subject\ncan be extrememly complicated, with many variables.\n\n I go by results, screw science, mostly they want what is in the text book,\nor you have to be a PH.D to think of something new. Certain subjects are\nstrictly taboo, like anything spirit/God. We&#39;ve gone round and round\nwith the so called skeptics here, they accept no evidence, can&#39;t test this\nstuff, cuz there maybe a chance of it being real, so they just call us all\nnames--real scientific! I mean the mind numbing mental gymnastics these\ndorks do to try explain why there is no conciousness in the universe is\nappalling. Thought experiment by ph.d, that makes it fact!\n\n There are supposed paranormal researchers and sites that claim the boxes\ndon&#39;t work, they&#39;re just veiled skeptics, a skpetic in this case being a\nnon-believer that can not be convinced no matter what the evidence.\n\n Most important is that users learn life is forever, there are multiple\nlevels,  and tell others. That&#39;s all it&#39;s for. I don&#39;t think we are supposed\nto get the absolute proof, there&#39;s that faith thing--or making one reach\noutside themselves.\n\n Try leaving out the &quot;haunted location&quot;, yeah scary but record at home.\nEntites are everywhere, and you may get more repeatble results.\n\n F-S\nOn Sat, Oct 2, 2010 at 3:51 AM, Adriana Jones &lt;adrianamjones@...&gt;wrote:\n\n&gt;\n&gt;\n&gt; What is the general success rate in receiving intelligent word exchanges\n&gt; between the operators and the radio? What percent of the time? And what\n&gt; percentage is considered &quot;better than coincidence&quot;? I know that in\n&gt; statistics, better than 50% is considered better than mere chance, but there\n&gt; is nobody that would disagree that even 25% success rate would be considered\n&gt; &quot;better than coincidence&quot; in the case of using a ghost box. The reason that\n&gt; I ask is because as I&#39;m really getting into ghost boxes in the last few days\n&gt; I notice that various articles, like the wiki article on evp sound a bit\n&gt; skeptical, yet my first and so far only ghost box session was significantly\n&gt; successful. I left 100% convinced. Does the fact that a person who claims to\n&gt; be psychic was its operator, make a difference in success rate?\n&gt;\n&gt; I was really psyched after leaving the session, which was done at a haunted\n&gt; covered bridge at night, where I also felt what is said to be a ghost (the\n&gt; air feels electrified).\n&gt;\n&gt; Has anyone in the ghost box operating community ever tried to conduct\n&gt; systematic, videotaped scientifically rigorous repetitions of the sessions?\n&gt; If the kind of success I experienced that night could happen again and\n&gt; again, why are people so skeptical? Incredible as it sounds, it&#39;s occurring.\n&gt; And just because we can&#39;t explain why, doesn&#39;t mean its not happening. I\n&gt; have the whole session recorded and would like to post up some of the\n&gt; snippets (just want to get permission from my local hunting group to make\n&gt; sure its ok), because they are - contrary to claims made in various\n&gt; skeptical articles - NOT, I repeat, NOT just words that people are trying to\n&gt; construct with their minds out of mere noise, they are in fact clearly\n&gt; spoken words coming out of the radio.... at just the right times... again\n&gt; and again... I would say that categorically rules out the possibility of\n&gt; coincidence...\n&gt;\n&gt; So any info on anyone trying to systematically prove this phenomenon by\n&gt; scientific method? Or has no one tried yet?\n&gt;\n&gt; \n&gt;\n\nWha 's he chance o a pe sonali y coming h ough ha I ha e go en o en, while I'm doing a es ideo. 'bou a bazillion o one? How many imes do hey call me \"Pu ple\", jus abou e e y ime I u n one o hese on. \n\n \n Then, wha abou o he me hods, wha 's he chance o he boxes men ioned while lipping be ween channels pai s on cable TV? A 10-11 seconds on his ideo \"You boxes---you hea us\". I 's no jus \"a box\" hing, i 's any hing ha p o ides bi s o speech, and/o sound equencies. Reco ding seems o allow manipula ion o he sound bi s, as i i 's done in he ai , be ween sou ce and eco de /ea ---bu you can also ge he same hing wi h no ex e nal sound, eco ding om a line ou pu on he box/ adio. This subjec can be ex ememly complica ed, wi h many a iables.\n\n \n I go by esul s, sc ew science, mos ly hey wan wha is in he ex book, o you ha e  o be a PH.D o hink o some hing new. Ce ain subjec s a e s ic ly aboo, like any hing spi i /God. We' e gone ound and ound wi h  he so called skep ics he e, hey accep no e idence, can' es his s u , cuz he e maybe a chance o i being eal, so hey jus call us all names-- eal scien i ic! I mean he mind numbing men al gymnas ics hese do ks do o y explain why he e is no conciousness in he uni e se is appalling. Though expe imen by ph.d, ha makes i ac !\n\n \n The e a e supposed pa ano mal esea che s and si es ha claim he boxes don' wo k, hey' e jus eiled skep ics, a skpe ic in his case being a non-belie e ha can no be con inced no ma e wha he e idence. \n\n \n Mos impo an is ha use s lea n li e is o e e , he e a e mul iple le els,  and ell o he s. Tha 's all i 's o . I don' hink we a e supposed o ge he absolu e p oo , he e's ha ai h hing--o making one each ou side hemsel es. \n\n \n T y lea ing ou he \"haun ed loca ion\", yeah sca y bu eco d a home. En i es a e e e ywhe e, and you may ge mo e epea ble esul s. \n \n F-S\nOn Sa , Oc 2, 2010 a 3:51 AM, Ad iana Jones ad ianamjones@...> w o e:\n\n  \n\n\n\nWha is he gene al success a e in ecei ing in elligen wo d exchanges be ween he ope a o s and he adio? Wha pe cen o he ime? And wha pe cen age is conside ed \"be e han coincidence\"? I know ha in s a is ics, be e han 50% is conside ed be e han me e chance, bu he e is nobody ha would disag ee ha e en 25% success a e would be conside ed \"be e han coincidence\" in he case o using a ghos box. The eason ha I ask is because as I'm eally ge ing in o ghos boxes in he las ew days I no ice ha a ious a icles, like he wiki a icle on e p sound a bi skep ical, ye my i s and so a only ghos box session was signi ican ly success ul. I le 100% con inced. Does he ac ha a pe son who claims o be psychic was i s ope a o , make a di e ence in success a e? \nI was eally psyched a e lea ing he session, which was done a a haun ed co e ed b idge a nigh , whe e I also el wha is said o be a ghos ( he ai eels elec i ied). Has anyone in he ghos box ope a ing communi y e e ied o conduc sys ema ic, ideo aped scien i ically igo ous epe i ions o he sessions? I he kind o success I expe ienced ha nigh could happen again and again, why a e people so skep ical? Inc edible as i sounds, i 's occu ing. And jus because we can' explain why, doesn' mean i s no happening. I ha e he whole session eco ded and would like o pos up some o he snippe s (jus wan o ge pe mission om my local hun ing g oup o make su e i s ok), because hey a e - con a y o claims made in a ious skep ical a icles - NOT, I epea , NOT jus wo ds ha people a e ying o cons uc wi h hei minds ou o me e noise, hey a e in ac clea ly spoken wo ds coming ou o he adio.... a jus he igh imes... again and again... I would say ha ca ego ically ules ou he possibili y o coincidence...\nSo any in o on anyone ying o sys ema ically p o e his phenomenon by scien i ic me hod? O has no one ied ye ?"}