{"id": "18830", "subject": "Re: Ghost Box Success Rate", "author": "Adriana Jones", "timestamp": "2010-10-02T19:46:30Z", "full_text": "(Does yahoo groups have and &#39;edit message&#39; function... wish it did because I want to add this to my last post):  The skeptical argument is made that if you&#39;re constantly arbitrarily picking out your chosen relevant words out of the rest of the crowd, even if you choose to only deal with the clear words... that it&#39;s still arbitrary and not scientific... and with that argument I really beg to differ... if you use a defined time frame - such as only waiting a few seconds in which to allow the answer - and you are able to receive relevant answers not just once or twice but again and again in the same session , and again and again session after session... then that is as far from arbitrary and coincidental as anything... the proof comes in the consistency through time... if the communication was co-incidental, how many co-incidences are you will to accept, before you admit that mere co-incidence cannot be the sole factor?\n\n--- In EVP-ITC@yahoogroups.com, &quot;Adriana Jones&quot; &lt;adrianamjones@...&gt; wrote:\n&gt;\n&gt; My ghost box session was on, I think a 12-469, he had a little palm held white one with a horizontal screen at the top... I&#39;m fairly sure thats the 12-469, he says he uses a &quot;shack hack&quot;...\n&gt; \n&gt; Anyway... the way I&#39;m approaching this ghost box thing - and tell me whether you think this is wise or not - is I&#39;m looking for clear words only, if the words are not clear I will not try to read into them... if however there is sufficient  context around the unclear word that IS clear, then I may attempt to infer what the unclear word actually is...\n&gt; The only aspect in which I &quot;read into&quot; is in picking out the relevant CLEAR messages out of the irrelevant rest of the radio words... if they are situated in a timely enough frame (and the timeliness is subjective, don&#39;t know if there is a community standard or something, like say 5 or 10 seconds...), then I will arbitrarily pick the relevant words out of the rest of the words / noise.  This is the way I personally approached that session, at which - I felt - there was successful intelligent exchange.\n&gt; \n&gt; I know you said you don&#39;t like asking questions, but I feel that if you don&#39;t ask questions then it&#39;s even harder to decipher which messages are noise and which are relevant... when you ask a question like &quot;Are you happy or sad?&quot; and a few seconds later you clearly hear &quot;sad&quot;... as happened at the session,  then you know without a shadow of a doubt that something is talking to you...\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Urkel23&quot; &lt;urkel23@&gt; wrote:\n&gt; &gt;\n&gt; &gt; \n&gt; &gt; It depends on how you listen to the box, the messages are layered a lot of times.  I do the research a little different than others.  I don&#39;t snip out full radio words and have my mind try and make sense of that word.  I use snippets of sound as the radio sweeps through, with that sound they are able to make words.  \n&gt; &gt; \n&gt; &gt; The files aren;t as clear sounding, but they are authentic and harder to toss out as evidence.  That&#39;s why in my opinion a faster sweeping radio is the way to go.  They will use a fast sweep, you just have to get use to listening a little different.\n&gt; &gt; \n&gt; &gt; If you ask the box &quot;What&#39;s your name?&quot;, your brain will automatically be listening for a name on the radio.  Although it could happen that way, it&#39;s more likely a coincidence.  They call that chasing ghosts, that&#39;s why Frank doesn&#39;t ask questions.  I usually don&#39;t either, because i&#39;m usually doing a sample recording of a new box.  The messages are still in there upon review of that sample audio.\n&gt; &gt; \n&gt; &gt; -Steve\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;Adriana Jones&quot; &lt;adrianamjones@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; What is the general success rate in receiving intelligent word exchanges between the operators and the radio?  What percent of the time? And what percentage is considered &quot;better than coincidence&quot;?  I know that in statistics, better than 50% is considered better than mere chance, but there is nobody that would disagree that even 25% success rate would be considered &quot;better than coincidence&quot; in the case of using a ghost box.  The reason that I ask is because as I&#39;m really getting into ghost boxes in the last few days I notice that various articles, like the wiki article on evp sound a bit skeptical, yet my first and so far only ghost box session was significantly successful.  I left 100% convinced.  Does the fact that a person who claims to be psychic was its operator, make a difference in success rate? \n&gt; &gt; &gt; \n&gt; &gt; &gt; I was really psyched after leaving the session, which was done at a haunted covered bridge at night, where I also felt what is said to be a ghost (the air feels electrified).  \n&gt; &gt; &gt; \n&gt; &gt; &gt; Has anyone in the ghost box operating community ever tried to conduct systematic, videotaped scientifically rigorous repetitions of the sessions?  If the kind of success I experienced that night could happen again and again, why are people so skeptical?  Incredible as it sounds, it&#39;s occurring.  And just because we can&#39;t explain why, doesn&#39;t mean its not happening.  I have the whole session recorded and would like to post up some of the snippets (just want to get permission from my local hunting group to make sure its ok), because they are - contrary to claims made in various skeptical articles - NOT, I repeat, NOT just words that people are trying to construct with their minds out of mere noise, they are in fact clearly spoken words coming out of the radio.... at just the right times... again and again... I would say that categorically rules out the possibility of coincidence...\n&gt; &gt; &gt; \n&gt; &gt; &gt; So any info on anyone trying to systematically prove this phenomenon by scientific method? Or has no one tried yet?\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}