{"id": "18842", "subject": "Re: Ghost Box Success Rate", "author": "Adriana Jones", "timestamp": "2010-10-03T15:33:28Z", "full_text": "&quot;Some of these people have $$ interest in keep real knowledge hidden.&quot;\n\nAgreed.\n\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  I know ther are real scientists out there that would probably study this\n&gt; stuff if it weren&#39;t for being ridiculed by the dumb ones. Unfortunate that\n&gt; there are people that have put themselves in positions of authority, such as\n&gt; the Bulters, that claim they had a team of &quot;more qualified listeners&quot; test\n&gt; the boxes and they found nothing to it. Never asking me anything about the\n&gt; box, or the theory behind it. Always these experts that know better.  Some\n&gt; of these people have $$ interest in keep real knowledge hidden.\n&gt; \n&gt;  F-S\n&gt; \n&gt; On Sat, Oct 2, 2010 at 7:34 PM, Adriana Jones &lt;adrianamjones@...&gt;wrote:\n&gt; \n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Yes, you&#39;re right, what are the chances... bazillion to one is right...\n&gt; &gt;\n&gt; &gt; Scientists have a bias against religion because they equate it with blind\n&gt; &gt; faith and superstition, some of them perhaps even have a vendetta against\n&gt; &gt; their family religion, for making them grow up with a belief system that\n&gt; &gt; they feel is constrictive, and as scientist adults their emotional reaction\n&gt; &gt; is to do whatever is in their power to bash down anything that might point\n&gt; &gt; to a higher power or anything that transcends the five senses... as if a\n&gt; &gt; higher power and religion are synonymous (which they most certainly are not,\n&gt; &gt; if you ask me)... the truth is hardly ever black or white... the scientific\n&gt; &gt; bias and the religious bias.... neither one alone will ever arrive at the\n&gt; &gt; truth... the truth is somewhere in the middle...\n&gt; &gt;\n&gt; &gt; I can also understand your sentiment in which you want to say &quot;screw\n&gt; &gt; science&quot;, as you did below :), and it is that same frustration/resentment\n&gt; &gt; that some scientists have toward religion when they say &quot;screw religion&quot; and\n&gt; &gt; reject EVP recordings. However, if you reject the scientific method, then\n&gt; &gt; you reject the other half of the truth, just like those scientists are\n&gt; &gt; doing. The truth must meet in the middle.\n&gt; &gt; I too feel frustrated at how scientists manipulate the scientific method to\n&gt; &gt; arrive at the most &quot;convenient&quot; scientific results - often outright lies,\n&gt; &gt; probably, to be quite blunt. Science is rife with corruption, as is just\n&gt; &gt; about every area of human endeavor where someone has something to personally\n&gt; &gt; gain. However, the concept of empirical science itself, when not tainted by\n&gt; &gt; the human elements, works to ultimately prove or disprove the given tested\n&gt; &gt; theories, in a more or less logical and objective manner. The scientific\n&gt; &gt; method does have its inherent limitations, but still I feel that the evp\n&gt; &gt; area of research could have a lot to gain if some &quot;community standards&quot;\n&gt; &gt; could be adopted, in order to advance this area of research on common\n&gt; &gt; grounds, with a common language, where results could be compared, and apples\n&gt; &gt; could be compared to apples. Although none of us personally need this to\n&gt; &gt; prove anything to ourselves - because we already know the communication is\n&gt; &gt; real and this conviction and certainty is what drives you on further - to\n&gt; &gt; develop and adopt some sort of common scientific language, with which to\n&gt; &gt; discuss results, I think would help to lend a lot more credence to all of\n&gt; &gt; this.\n&gt; &gt; I say this because it looks like such a shame to me that all of the\n&gt; &gt; incredible work of you, Steve and all these other people I&#39;m reading about\n&gt; &gt; and talking to online, is so easily ignored, when with the right approach\n&gt; &gt; and presentation, it seems to me that these results would be so convincing,\n&gt; &gt; that they would not only draw the incredible attention they deserve, but\n&gt; &gt; would also be nearly impossible to debunk. The question of whether or not\n&gt; &gt; intelligent communication is occuring through these devices ought to be\n&gt; &gt; impossible to debunk, this is my gut feeling from my limited experience with\n&gt; &gt; it.\n&gt; &gt; I don&#39;t know maybe this is just the naive talk of a novice enthusiast, but\n&gt; &gt; this is how I feel.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Frank Sumption\n&gt; &gt; &lt;purplealiengirl@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; What&#39;s the chance of a personality coming through that I have gotten\n&gt; &gt; often,\n&gt; &gt; &gt; while I&#39;m doing a test video. &#39;bout a bazillion to one? How many times do\n&gt; &gt; &gt; they call me &quot;Purple&quot;, just about everytime I turn one of these on.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Then, what about other methods, what&#39;s the chance of the boxes mentioned\n&gt; &gt; &gt; while flipping between channels pairs on cable TV? At 10-11 seconds on\n&gt; &gt; this\n&gt; &gt; &gt; video &quot;Your boxes---you hear us&quot;. It&#39;s not just &quot;a box&quot; thing, it&#39;s\n&gt; &gt; anything\n&gt; &gt; &gt; that provides bits of speech, and/or sound frequencies. Recording seems\n&gt; &gt; to\n&gt; &gt; &gt; allow manipulation of the sound bits, as if it&#39;s done in the air, between\n&gt; &gt; &gt; source and recorder/ear---but you can also get the same thing with no\n&gt; &gt; &gt; external sound, recording from a line output on the box/radio. This\n&gt; &gt; subject\n&gt; &gt; &gt; can be extrememly complicated, with many variables.\n&gt; &gt; &gt;\n&gt; &gt; &gt; I go by results, screw science, mostly they want what is in the text\n&gt; &gt; book,\n&gt; &gt; &gt; or you have to be a PH.D to think of something new. Certain subjects are\n&gt; &gt; &gt; strictly taboo, like anything spirit/God. We&#39;ve gone round and round\n&gt; &gt; &gt; with the so called skeptics here, they accept no evidence, can&#39;t test\n&gt; &gt; this\n&gt; &gt; &gt; stuff, cuz there maybe a chance of it being real, so they just call us\n&gt; &gt; all\n&gt; &gt; &gt; names--real scientific! I mean the mind numbing mental gymnastics these\n&gt; &gt; &gt; dorks do to try explain why there is no conciousness in the universe is\n&gt; &gt; &gt; appalling. Thought experiment by ph.d, that makes it fact!\n&gt; &gt; &gt;\n&gt; &gt; &gt; There are supposed paranormal researchers and sites that claim the boxes\n&gt; &gt; &gt; don&#39;t work, they&#39;re just veiled skeptics, a skpetic in this case being a\n&gt; &gt; &gt; non-believer that can not be convinced no matter what the evidence.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Most important is that users learn life is forever, there are multiple\n&gt; &gt; &gt; levels, and tell others. That&#39;s all it&#39;s for. I don&#39;t think we are\n&gt; &gt; supposed\n&gt; &gt; &gt; to get the absolute proof, there&#39;s that faith thing--or making one reach\n&gt; &gt; &gt; outside themselves.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Try leaving out the &quot;haunted location&quot;, yeah scary but record at home.\n&gt; &gt; &gt; Entites are everywhere, and you may get more repeatble results.\n&gt; &gt; &gt;\n&gt; &gt; &gt; F-S\n&gt; &gt; &gt; On Sat, Oct 2, 2010 at 3:51 AM, Adriana Jones &lt;adrianamjones@&gt;wrote:\n&gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; What is the general success rate in receiving intelligent word\n&gt; &gt; exchanges\n&gt; &gt; &gt; &gt; between the operators and the radio? What percent of the time? And what\n&gt; &gt; &gt; &gt; percentage is considered &quot;better than coincidence&quot;? I know that in\n&gt; &gt; &gt; &gt; statistics, better than 50% is considered better than mere chance, but\n&gt; &gt; there\n&gt; &gt; &gt; &gt; is nobody that would disagree that even 25% success rate would be\n&gt; &gt; considered\n&gt; &gt; &gt; &gt; &quot;better than coincidence&quot; in the case of using a ghost box. The reason\n&gt; &gt; that\n&gt; &gt; &gt; &gt; I ask is because as I&#39;m really getting into ghost boxes in the last few\n&gt; &gt; days\n&gt; &gt; &gt; &gt; I notice that various articles, like the wiki article on evp sound a\n&gt; &gt; bit\n&gt; &gt; &gt; &gt; skeptical, yet my first and so far only ghost box session was\n&gt; &gt; significantly\n&gt; &gt; &gt; &gt; successful. I left 100% convinced. Does the fact that a person who\n&gt; &gt; claims to\n&gt; &gt; &gt; &gt; be psychic was its operator, make a difference in success rate?\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; I was really psyched after leaving the session, which was done at a\n&gt; &gt; haunted\n&gt; &gt; &gt; &gt; covered bridge at night, where I also felt what is said to be a ghost\n&gt; &gt; (the\n&gt; &gt; &gt; &gt; air feels electrified).\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Has anyone in the ghost box operating community ever tried to conduct\n&gt; &gt; &gt; &gt; systematic, videotaped scientifically rigorous repetitions of the\n&gt; &gt; sessions?\n&gt; &gt; &gt; &gt; If the kind of success I experienced that night could happen again and\n&gt; &gt; &gt; &gt; again, why are people so skeptical? Incredible as it sounds, it&#39;s\n&gt; &gt; occurring.\n&gt; &gt; &gt; &gt; And just because we can&#39;t explain why, doesn&#39;t mean its not happening.\n&gt; &gt; I\n&gt; &gt; &gt; &gt; have the whole session recorded and would like to post up some of the\n&gt; &gt; &gt; &gt; snippets (just want to get permission from my local hunting group to\n&gt; &gt; make\n&gt; &gt; &gt; &gt; sure its ok), because they are - contrary to claims made in various\n&gt; &gt; &gt; &gt; skeptical articles - NOT, I repeat, NOT just words that people are\n&gt; &gt; trying to\n&gt; &gt; &gt; &gt; construct with their minds out of mere noise, they are in fact clearly\n&gt; &gt; &gt; &gt; spoken words coming out of the radio.... at just the right times...\n&gt; &gt; again\n&gt; &gt; &gt; &gt; and again... I would say that categorically rules out the possibility\n&gt; &gt; of\n&gt; &gt; &gt; &gt; coincidence...\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; So any info on anyone trying to systematically prove this phenomenon by\n&gt; &gt; &gt; &gt; scientific method? Or has no one tried yet?\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt; &gt;  \n&gt; &gt;\n&gt;"}