{"id": "18864", "subject": "Re: I apologize", "author": "jennifer", "timestamp": "2010-10-04T19:36:42Z", "full_text": "No, I haven&#39;t read about the 9-11  and the energy patterns.\nAs far as my radio goes, it doesn&#39;t have the number on it to identify the model. Whoever lived here before was into electronics as well. As I found an electronic component in the basement closet. It weirded me out when I heard of a Joe&#39;s box. We bought our house from a Joe. So many synchronizations. It is not the same Joe as the group.\nJust as a man named Frank walked up to me and said &quot;It gets better from here.&quot; I have had the weirdest experiences just in daily life. And it is not the typical paranormal. Even my husband had said to me,&quot;If i was not with you, I wouldn&#39;t have believed myself.&quot; \nIt is kinda lonely. Maybe if I open up to this group it won&#39;t have to be that way anymore.\n\n--- In EVP-ITC@yahoogroups.com, &quot;Adriana Jones&quot; &lt;adrianamjones@...&gt; wrote:\n&gt;\n&gt; I don&#39;t have any electronics experience, other than putting battery circuits together in 6th grade science class, lol... but modifying my ffirst radio a few nights ago was easy anyway, so it&#39;s possible you won&#39;t even need any help.  What model radio are you modifying?  Maybe someone could give you pointers to save you some trouble along the way.  (For example, when I modified the radio shack 20-125 it was helpful that someone wrote in the online instructions to put scotch tape over the buttons before opening the radio in half, so the buttons don&#39;t fall out and then make it a pain in the butt to puzzle piece them back in place when you&#39;re done... also on that model be very careful when snipping the MU wire because any amount of extra force might snip through an additional wire because they&#39;re situated so close together... I almost snipped through two wires, but luckily my hand stopped JUST before that happened... I used a razor pen with a freshly changed blade).\n&gt; \n&gt; I agree with how the subjective experience can become part of reality... everything affects everything else... and I agree with you, I too sing better when no one is listening :)\n&gt; \n&gt; I&#39;ve actually read about the global consciousness project a few months ago.  Very fascinating, and if everything they say about it is true, then no doubt mind has incredible power over matter.  Did you read the bit about how humanity&#39;s global reaction to 9/11 was supposed to have changed the energy patterns inside the earth?  \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;jennifer&quot; &lt;3eyesofwisdom@&gt; wrote:\n&gt; &gt;\n&gt; &gt; I have been silent out of fear. Sometimes the ridicule gets hard to take. I know that sometimes mind does influence perception of reality. The other day I was brought back to quantum physics. They talk of an observer and how just the observer being there can change things. I was thinking it is like when I sing. I sing much better when I am alone than when I think someone can hear me. \n&gt; &gt;      This goes into old teachings. the &quot;As above , so below.&quot; A lot of people seem to believe humans are the only thing that feel and think. I do not believe this, as I have witnessed strange occurrences.\n&gt; &gt; We should be having someone over to bless our house soon. The energy needs cleansed and I feel too drained to attempt it.\n&gt; &gt;      I am very interested in one of the things posted. It was about Global consciousness project. Someone had posted about an experience where they were told by device about a wreck around the corner, or something like that. I wonder if their subconscious picked up on it and it manifested on their device. I know it could be other things as well. As humans it is often us putting limits on what is possible that keeps us from our full potential. At least thats my thoughts at this time.\n&gt; &gt;    And don&#39;t give up just because others may not believe. In my invention books I have found  a lot of times it is those who are called crazy and mocked that actually progress things. Recently I read that Marconi was put in an asylum for telling them about the technology we use today. \n&gt; &gt;      I have many thoughts. If I am to make a ghost box with the radio I have I am probably going to need help. I didn&#39;t make it far in my electronics course before getting ill. I want to read more throughout the site and others to see if I can do it without bothering anyone.\n&gt; &gt;     I know I kind of come and go. I hope you don&#39;t mind. Everyone has always called me a free spirit. I tend to just go wherever my heart takes me.\n&gt; &gt;\n&gt;"}