{"id": "18877", "subject": "Re: [EVP-ITC] Re: I apologize for Jennifer", "author": "Kae Tee", "timestamp": "2010-10-05T05:34:06Z", "full_text": "--0-651114711-1286256846=:37916\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nJennifer,\nI had this long reply posted and for whatever reason I clicked se=\r\nnd and it made me sign in again! It always seems to happen that way! (Espec=\r\nially when I sit here thinking oh.. the won&#39;t be interested in a personal e=\r\nxperience!)\nOk, my son was a twin. He didn&#39;t know it. His twin died in uter=\r\no around the time the 2nd trimester started. They wanted to do a D&C becaus=\r\ne they said if the one twin died he died too. They refused another ultrasou=\r\nnd a few days later to &quot;be sure&quot; and I refused to allow them to do the surg=\r\nery as I had stopped bleeding and had no more issues after those first few =\r\ndays. I made an appointment with a new OB. I went in a few days later and t=\r\nhe first thing they did was an ultrasound. There was my son and his big str=\r\nong heartbeat just fine. If I wouldn&#39;t have went with my gut my 12 year old=\r\n wouldn&#39;t be here right now.\nThat being said.. several years ago he came to=\r\n me because he said this boy came to him, told him he was his twin in his d=\r\nreams and talked to him. I didn&#39;t say much at the time because I was in sho=\r\nck. My husband had no clue about what happened with my first husband and my=\r\n pregnancy with him at that point.=C2=A0After what we experienced in 2004 i=\r\nn a home we lived in I started to open my eyes to a lot and believe in thin=\r\ngs that I never would have imagined.=C2=A0This &quot;boy&quot; has come around here a=\r\nnd there to our son. He now knows he was a twin. Is it his brother? Honestl=\r\ny, I do not know. I&#39;d like to think perhaps it is and he&#39;s looking over him=\r\n!\nNo one can explain certain things. Somethings might never have an explana=\r\ntion. Some people can&#39;t handle this so if this happens it&#39;s no true because=\r\n there is no scientific explanation...=C2=A0\nThere are so many things that =\r\nI&#39;ve experienced in life that I&#39;d love to be able to open up about. It took=\r\n everything I had back in 2004 to walk into the church rectory. I remember =\r\nlooking at our priest saying either there is something in our home or you n=\r\need to commit me.=C2=A0I was raised don&#39;t talk about it, it&#39;s all your imag=\r\nination and just pull the covers over your head and go to sleep.=C2=A0Hugs,=\r\nTeddy\n\n--- On Mon, 10/4/10, jennifer &lt;3eyesofwisdom@...&gt; wrote:\n\nFrom=\r\n: jennifer &lt;3eyesofwisdom@...&gt;\nSubject: [EVP-ITC] Re: I apologize\nTo:=\r\n EVP-ITC@yahoogroups.com\nDate: Monday, October 4, 2010, 3:50 PM\n\n\n\n\n\n\n\n\n\n\n\n=\r\n\n\n\n\n \n=C2=A0\n\n\n\n  \n\n\n    \n      \n      \n      Yes, it was your post. I only=\r\n question what are subconscious may know that we do not. It is due to the w=\r\nhole idea of automatic writing. I have written things I don&#39;t feel are from=\r\n me. Psychology would say it is probably just my subconscious. So I jump be=\r\ntween realms of thought. I could downplay certain psychic abilities with ps=\r\nychology. It has left me wondering if I am really talking to my dead sister=\r\n or if it a way of processing the past. I forget the details, but I guess m=\r\ny mom was going to have twins, but I was what came.\n\n     I do know that ps=\r\nychology cannot explain certain things. Your post got me really interested =\r\nin that device. I believe everything is connected. I do not doubt that you =\r\nheard no sirens and such or your experience. I guess I just question how it=\r\n works, as all of us do here.\n\nThank you for your thoughts and prayers.\n\n\n\n=\r\n--- In EVP-ITC@yahoogroups.com, Kae Tee &lt;usmcmacswife@...&gt; wrote:\n\n&gt;\n\n&gt; Jen=\r\nnifer,\n\n&gt; \n\n&gt; I had an iovulus tell me there was an accident with police et=\r\nc is that was you were referencing?\n\n&gt; \n\n&gt; If so, I had NO clue as where I =\r\nlive is out in farm land. I don&#39;t hear sirens unless it is late at night an=\r\nd all our kids are in bed and it is dead silence in my home. That day our 3=\r\n kids were home and totally bouncing off the walls.. I was actually playing=\r\n with the device as I was in the bathroom and getting dressed, makeup etc. =\r\nSo there was no influence on what I heard.\n\n&gt; \n\n&gt; I know a good house clean=\r\nsing is wonderful! I am not sure what you are experiencing but I would like=\r\n you to know you will be in my thoughts and prayers!!\n\n&gt; \n\n&gt; On Mon Oct 4th=\r\n, 2010 2:45 PM EDT jennifer wrote:\n\n&gt; \n\n&gt; &gt;I have been silent out of fear. =\r\nSometimes the ridicule gets hard to take. I know that sometimes mind does i=\r\nnfluence perception of reality. The other day I was brought back to quantum=\r\n physics. They talk of an observer and how just the observer being there ca=\r\nn change things. I was thinking it is like when I sing. I sing much better =\r\nwhen I am alone than when I think someone can hear me. \n\n&gt; &gt;     This goes =\r\ninto old teachings. the &quot;As above , so below.&quot; A lot of people seem to beli=\r\neve humans are the only thing that feel and think. I do not believe this, a=\r\ns I have witnessed strange occurrences.\n\n&gt; &gt;We should be having someone ove=\r\nr to bless our house soon. The energy needs cleansed and I feel too drained=\r\n to attempt it.\n\n&gt; &gt;     I am very interested in one of the things posted. =\r\nIt was about Global consciousness project. Someone had posted about an expe=\r\nrience where they were told by device about a wreck around the corner, or s=\r\nomething like that. I wonder if their subconscious picked up on it and it m=\r\nanifested on their device. I know it could be other things as well. As huma=\r\nns it is often us putting limits on what is possible that keeps us from our=\r\n full potential. At least thats my thoughts at this time.\n\n&gt; &gt;   And don&#39;t =\r\ngive up just because others may not believe. In my invention books I have f=\r\nound  a lot of times it is those who are called crazy and mocked that actua=\r\nlly progress things. Recently I read that Marconi was put in an asylum for =\r\ntelling them about the technology we use today. \n\n&gt; &gt;     I have many thoug=\r\nhts. If I am to make a ghost box with the radio I have I am probably going =\r\nto need help. I didn&#39;t make it far in my electronics course before getting =\r\nill. I want to read more throughout the site and others to see if I can do =\r\nit without bothering anyone.\n\n&gt; &gt;    I know I kind of come and go. I hope y=\r\nou don&#39;t mind. Everyone has always called me a free spirit. I tend to just =\r\ngo wherever my heart takes me. \n\n&gt; &gt;     \n\n&gt; &gt;\n\n&gt;\n\n\n\n\n\n    \n     \n\n    \n   =\r\n \n\n\n \n\n\n\n  \n\n\n\n\n\n\n\n\n\n\n\n      \r\n--0-651114711-1286256846=:37916\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;Jennifer,&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;I had this long =\r\nreply posted and for whatever reason I clicked send and it made me sign in =\r\nagain! It always seems to happen that way! (Especially when I sit here thin=\r\nking oh.. the won&#39;t be interested in a personal experience!)&lt;/div&gt;&lt;div&gt;&lt;br&gt;=\r\n&lt;/div&gt;&lt;div&gt;Ok, my son was a twin. He didn&#39;t know it. His twin died in utero=\r\n around the time the 2nd trimester started. They wanted to do a D&amp;C bec=\r\nause they said if the one twin died he died too. They refused another ultra=\r\nsound a few days later to &quot;be sure&quot; and I refused to allow them to do the s=\r\nurgery as I had stopped bleeding and had no more issues after those first f=\r\new days. I made an appointment with a new OB. I went in a few days later an=\r\nd the first thing they did was an ultrasound. There was my son and his big =\r\nstrong heartbeat just fine. If I wouldn&#39;t have went with my gut my 12 year =\r\nold\n wouldn&#39;t be here right now.&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;That being said..=\r\n several years ago he came to me because he said this boy came to him, told=\r\n him he was his twin in his dreams and talked to him. I didn&#39;t say much at =\r\nthe time because I was in shock. My husband had no clue about what happened=\r\n with my first husband and my pregnancy with him at that point.&nbsp;&lt;/div&gt;=\r\n&lt;div&gt;After what we experienced in 2004 in a home we lived in I started to o=\r\npen my eyes to a lot and believe in things that I never would have imagined=\r\n.&nbsp;&lt;/div&gt;&lt;div&gt;This &quot;boy&quot; has come around here and there to our son. He =\r\nnow knows he was a twin. Is it his brother? Honestly, I do not know. I&#39;d li=\r\nke to think perhaps it is and he&#39;s looking over him!&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;d=\r\niv&gt;No one can explain certain things. Somethings might never have an explan=\r\nation. Some people can&#39;t handle this so if this happens it&#39;s no true becaus=\r\ne there is no scientific\n explanation...&nbsp;&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;The=\r\nre are so many things that I&#39;ve experienced in life that I&#39;d love to be abl=\r\ne to open up about. It took everything I had back in 2004 to walk into the =\r\nchurch rectory. I remember looking at our priest saying either there is som=\r\nething in our home or you need to commit me.&nbsp;&lt;/div&gt;&lt;div&gt;I was raised d=\r\non&#39;t talk about it, it&#39;s all your imagination and just pull the covers over=\r\n your head and go to sleep.&nbsp;&lt;/div&gt;&lt;div&gt;Hugs,&lt;/div&gt;&lt;div&gt;Teddy&lt;br&gt;&lt;br&gt;--=\r\n- On &lt;b&gt;Mon, 10/4/10, jennifer &lt;i&gt;&lt;3eyesofwisdom@...&gt;&lt;/i&gt;&lt;/b&gt; w=\r\nrote:&lt;br&gt;&lt;blockquote style=3D&quot;border-left: 2px solid rgb(16, 16, 255); marg=\r\nin-left: 5px; padding-left: 5px;&quot;&gt;&lt;br&gt;From: jennifer &lt;3eyesofwisdom@gmai=\r\nl.com&gt;&lt;br&gt;Subject: [EVP-ITC] Re: I apologize&lt;br&gt;To: EVP-ITC@yahoogroups.=\r\ncom&lt;br&gt;Date: Monday, October 4, 2010, 3:50 PM&lt;br&gt;&lt;br&gt;&lt;div id=3D&quot;yiv21084206=\r\n4&quot;&gt;\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n&lt;span style=3D&quot;display:none;&quot;&gt;&nbsp;&lt;/span&gt;\n\n\n\n    &lt;div =\r\nid=3D&quot;yiv210842064ygrp-text&quot;&gt;\n      \n      \n      &lt;p&gt;Yes, it was your post.=\r\n I only question what are subconscious may know that we do not. It is due t=\r\no the whole idea of automatic writing. I have written things I don&#39;t feel a=\r\nre from me. Psychology would say it is probably just my subconscious. So I =\r\njump between realms of thought. I could downplay certain psychic abilities =\r\nwith psychology. It has left me wondering if I am really talking to my dead=\r\n sister or if it a way of processing the past. I forget the details, but I =\r\nguess my mom was going to have twins, but I was what came.&lt;br&gt;\n     I do kn=\r\now that psychology cannot explain certain things. Your post got me really i=\r\nnterested in that device. I believe everything is connected. I do not doubt=\r\n that you heard no sirens and such or your experience. I guess I just quest=\r\nion how it works, as all of us do here.&lt;br&gt;\nThank you for your thoughts and=\r\n prayers.&lt;br&gt;\n&lt;br&gt;\n--- In &lt;a rel=3D&quot;nofollow&quot; ymailto=3D&quot;mailto:EVP-ITC%40y=\r\nahoogroups.com&quot; target=3D&quot;_blank&quot; href=3D&quot;/mc/compose?to=3DEVP-ITC%40yahoog=\r\nroups.com&quot;&gt;EVP-ITC@yahoogroups.com&lt;/a&gt;, Kae Tee &lt;usmcmacswife@...&gt; wr=\r\note:&lt;br&gt;\n&gt;&lt;br&gt;\n&gt; Jennifer,&lt;br&gt;\n&gt; &lt;br&gt;\n&gt; I had an iovulus tell m=\r\ne there was an accident with police etc is that was you were referencing?&lt;b=\r\nr&gt;\n&gt; &lt;br&gt;\n&gt; If so, I had NO clue as where I live is out in farm land.=\r\n I don&#39;t hear sirens unless it is late at night and all our kids are in bed=\r\n and it is dead silence in my home. That day our 3 kids were home and total=\r\nly bouncing off the walls.. I was actually playing with the device as I was=\r\n in the bathroom and getting dressed, makeup etc. So there was no influence=\r\n on what I heard.&lt;br&gt;\n&gt; &lt;br&gt;\n&gt; I know a good house cleansing is wonde=\r\nrful! I am not sure what you are experiencing but I would like you to know =\r\nyou will be in my thoughts and prayers!!&lt;br&gt;\n&gt; &lt;br&gt;\n&gt; On Mon Oct 4th,=\r\n 2010 2:45 PM EDT jennifer wrote:&lt;br&gt;\n&gt; &lt;br&gt;\n&gt; &gt;I have been silent=\r\n out of fear. Sometimes the ridicule gets hard to take. I know that sometim=\r\nes mind does influence perception of reality. The other day I was brought b=\r\nack to quantum physics. They talk of an observer and how just the observer =\r\nbeing there can change things. I was thinking it is like when I sing. I sin=\r\ng much better when I am alone than when I think someone can hear me. &lt;br&gt;\n&=\r\ngt; &gt;     This goes into old teachings. the &quot;As above , so below.&quot; A lot=\r\n of people seem to believe humans are the only thing that feel and think. I=\r\n do not believe this, as I have witnessed strange occurrences.&lt;br&gt;\n&gt; &gt=\r\n;We should be having someone over to bless our house soon. The energy needs=\r\n cleansed and I feel too drained to attempt it.&lt;br&gt;\n&gt; &gt;     I am very=\r\n interested in one of the things posted. It was about Global consciousness =\r\nproject. Someone had posted about an experience where they were told by dev=\r\nice about a wreck around the corner, or something like that. I wonder if th=\r\neir subconscious picked up on it and it manifested on their device. I know =\r\nit could be other things as well. As humans it is often us putting limits o=\r\nn what is possible that keeps us from our full potential. At least thats my=\r\n thoughts at this time.&lt;br&gt;\n&gt; &gt;   And don&#39;t give up just because othe=\r\nrs may not believe. In my invention books I have found  a lot of times it i=\r\ns those who are called crazy and mocked that actually progress things. Rece=\r\nntly I read that Marconi was put in an asylum for telling them about the te=\r\nchnology we use today. &lt;br&gt;\n&gt; &gt;     I have many thoughts. If I am to =\r\nmake a ghost box with the radio I have I am probably going to need help. I =\r\ndidn&#39;t make it far in my electronics course before getting ill. I want to r=\r\nead more throughout the site and others to see if I can do it without bothe=\r\nring anyone.&lt;br&gt;\n&gt; &gt;    I know I kind of come and go. I hope you don&#39;=\r\nt mind. Everyone has always called me a free spirit. I tend to just go wher=\r\never my heart takes me. &lt;br&gt;\n&gt; &gt;     &lt;br&gt;\n&gt; &gt;&lt;br&gt;\n&gt;&lt;br&gt;\n&lt;br&gt;=\r\n\n&lt;/p&gt;\n\n    &lt;/div&gt;\n     \n\n\n\n \n\n\n\n\n\n&lt;/div&gt;&lt;/blockquote&gt;&lt;/div&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/tabl=\r\ne&gt;&lt;br&gt;\n\n      \r\n--0-651114711-1286256846=:37916--"}