{"id": "18903", "subject": "Re: [EVP-ITC] Faraday Cage", "author": "Zack Widup", "timestamp": "2010-10-07T20:46:39Z", "full_text": "Using the boxes in the way Frank does, it wold be pointless. Frank depends\non the radios actually picking up stations and the communicators arranging\nthe voices from the stations into some sort of assembly that sounds like a\nmessage. If you can&#39;t get radio stations, there&#39;s no reson to do it.\n\nIf you&#39;re trying to get EVP in some other manner, it might be interesting\nbut you&#39;d have to bring the Faraday cage to the haunted site by truck.\n\nZack\n\n\nOn Thu, Oct 7, 2010 at 9:00 AM, Fransen, Debbie &lt;debbie.fransen@...&gt;wrote:\n\n&gt;\n&gt;\n&gt;\n&gt; I just had a thought go thru my head ( Oh shit ).What would happen if you\n&gt; put a voice recorder in a\n&gt; Faraday Cage, and have a session with a ghost box.... The Faraday Cage\n&gt; isn&#39;t supposed to pick up radio\n&gt; interference right ? Would it pick up the other voices or not ? I know the\n&gt; entities are talking thru the radio\n&gt; but has anyone ever tried it ? Stupid question huh ?????\n&gt;\n&gt;\n&gt;  \n&gt;\n\nUsing he boxes in he way F ank does, i wold be poin less. F ank depends on he adios ac ually picking up s a ions and he communica o s a anging he oices om he s a ions in o some so o assembly ha sounds like a message. I you can' ge adio s a ions, he e's no eson o do i .\nI you' e ying o ge EVP in some o he manne , i migh be in e es ing bu you'd ha e o b ing he Fa aday cage o he haun ed si e by uck.ZackOn Thu, Oc 7, 2010 a 9:00 AM, F ansen, Debbie debbie. ansen@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n \n\n\n \nI jus had a hough \ngo h u my head ( Oh shi  ).Wha would happen i you pu a oice \n eco de in a\nFa aday Cage, and \nha e a session wi h a ghos box.... The Fa aday Cage isn' supposed o pick up \n adio\nin e e ence igh ? \nWould i pick up he o he oices o no ? I know he en i ies a e alking h u \n he adio\nbu has anyone e e \n ied i ? S upid ques ion huh ?????"}