{"id": "18910", "subject": "Re: [EVP-ITC] Faraday Cage", "author": "Frank Sumption", "timestamp": "2010-10-08T04:05:27Z", "full_text": "Try a box on the Queen Mary-ya get nodda-unles you&#39;re by a port hole.\nSounds like the microwave makes a poor faraday cage--unless ---- left the\ndoor open.  Just like most of the wanna be box experts out there Colletta\nwon&#39;t even achknowedge any e-mails from me, and he lives here in Co.\nSprings.\n\n I don&#39;t know how many freaking times I have to explain that the box is a\nswept radio for the purpose of providng bits of speech, music, and noise\nthat the entities use to make voices out of--No radio stations==no voices!\nIt&#39;s that simple, but try to get that through these dipstick self prclaimed\nexperts.  Not one of them has the slightest technical knowledge, yet will\ntell even me how the box really works.\n\n I think he forgot the turn on the micro wave.\n\n F-S\n\nOn Thu, Oct 7, 2010 at 8:00 AM, Fransen, Debbie &lt;debbie.fransen@...&gt;wrote:\n\n&gt;\n&gt;\n&gt;\n&gt; I just had a thought go thru my head ( Oh shit ).What would happen if you\n&gt; put a voice recorder in a\n&gt; Faraday Cage, and have a session with a ghost box.... The Faraday Cage\n&gt; isn&#39;t supposed to pick up radio\n&gt; interference right ? Would it pick up the other voices or not ? I know the\n&gt; entities are talking thru the radio\n&gt; but has anyone ever tried it ? Stupid question huh ?????\n&gt;\n&gt;\n&gt;\n&gt; \n&gt;\n\nT y a box on he Queen Ma y-ya ge nodda-unles you' e by a po hole. Sounds like he mic owa e makes a poo a aday cage--unless ---- le   he doo open.  Jus like mos o he wanna be box expe s ou   he e Colle a won' e en achknowedge any e-mails om me, and he li es he e in Co. Sp ings. \n\n \n I don' know how many eaking imes I ha e o explain ha he box is a swep adio o he pu pose o p o idng bi s o speech, music, and noise ha he en i ies use o make oices ou o --No adio s a ions==no oices! I 's ha simple, bu y o ge ha h ough hese dips ick sel p claimed expe s.  No one o hem has he sligh es echnical knowledge, ye will ell e en me how he box eally wo ks. \n\n \n I hink he o go he u n on he mic o wa e.\n \n F-S\nOn Thu, Oc 7, 2010 a 8:00 AM, F ansen, Debbie debbie. ansen@...> w o e:\n\n  \n\n\n\n\n \nI jus had a hough go h u my head ( Oh shi  ).Wha would happen i you pu a oice eco de in a\nFa aday Cage, and ha e a session wi h a ghos box.... The Fa aday Cage isn' supposed o pick up adio\nin e e ence igh ? Would i pick up he o he oices o no ? I know he en i ies a e alking h u he adio\nbu has anyone e e ied i ? S upid ques ion huh ?????"}