{"id": "18919", "subject": "Re: Faraday Cage", "author": "vortex6066", "timestamp": "2010-10-08T20:09:40Z", "full_text": "A friend of mine did a series of experiments using a faraday cage with evp. A radio was connected via patch cord to a cassette recorder. The radio was de-tuned so was only picking up static. The recorder was switched on and the 2 units were placed inside a 44 gallon drum and the lid sealed on (excellent faraday cage). Result - evp voices recorded.\nThe conclusion reached is that evp is neither a radio signal nor accoustic, as there was no microphone and no stations able to be received. It is likely therefore that evp affects the electronics inside the radio and tape recorder BUT a carrier signal of some sort is always needed - like the internally generated white noise the radio was producing inside the drum - and the white noise inside the recorder.\n\nRadio sweep wouldnt work inside a (good) faraday cage. It requires radio station segments to be efficient, but as mentioned it would however &#39;fall back&#39; to conventional evp mode if starved of voice material, and produce some white noise based evps.\nJEFF\n\nAn optimum faraday cage would need to be ferrous based metal, so it can also shield magnetic components of EM fields. Aluminum foil doesnt do this. Id recommend an ammo box.\nJEFF\n\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt; One of the skepdorks wanted to put one of my boxes ina faraday cage for\n&gt; testing. My response was Well Dah, of course it won&#39;t work if you block out\n&gt; the radio signals. I told him to bite me.\n&gt; \n&gt; As far as EVP, I thought someone tried that and you can get &quot;normal&quot; EVP.\n&gt; \n&gt;  F-S\n&gt; \n&gt; On Thu, Oct 7, 2010 at 8:00 AM, Fransen, Debbie &lt;debbie.fransen@...&gt;wrote:\n&gt; \n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; I just had a thought go thru my head ( Oh shit ).What would happen if you\n&gt; &gt; put a voice recorder in a\n&gt; &gt; Faraday Cage, and have a session with a ghost box.... The Faraday Cage\n&gt; &gt; isn&#39;t supposed to pick up radio\n&gt; &gt; interference right ? Would it pick up the other voices or not ? I know the\n&gt; &gt; entities are talking thru the radio\n&gt; &gt; but has anyone ever tried it ? Stupid question huh ?????\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; \n&gt; &gt;\n&gt;"}