{"id": "18916", "subject": "Re: Faraday Cage", "author": "Urkel23", "timestamp": "2010-10-08T15:52:37Z", "full_text": "I recently got one of these antennas, it really helps bring in the radio signal.  You might want to try this, simple to hook up too.  All you do is hook the alligator clip on to the antenna.\n\nhttp://cgi.ebay.com/85-Helical-Slinky-Antenna-Ham-CB-Shortwave-SWL-/320576898365?pt=Shortwave_Radios&hash=item4aa3df453d\n\n\n-Steve\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;draiga1&quot; &lt;mail@...&gt; wrote:\n&gt;\n&gt; Hi Steve,\n&gt; \n&gt; I haven&#39;t been on the lists much lately due to a heavy Fall workload, but I wanted to let you know that I have been using your box, and getting great results. I did a session with a girl who had a loved one commit suicide, and he came through. \n&gt; \n&gt; I have some investigations coming up where I will be bringing my Steve&#39;s box too! \n&gt; \n&gt; I also asked the box about a sensitive situation with a ghost and a family, and got answers to my questions on that as well.\n&gt; \n&gt; I know you work very hard on your boxes and they rock! The day before yesterday I was more signally challenged than usual and had the sweep set quite fast, yet clear as can be a woman&#39;s voice came through a couple of times. It could not have been stray radio signal. \n&gt; \n&gt; So just wanted to let you know, that I may fall way behind on the lists at the moment till I get this updating done, I am still using your box, though. Your hard work is appreciated here!\n&gt; \n&gt; Thanks!\n&gt; Draiga\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Urkel23&quot; &lt;urkel23@&gt; wrote:\n&gt; &gt;\n&gt; &gt; \n&gt; &gt; Was that the same person who stole box #63 after i tested it and sent it back to you.  I hate to see these things go to waste.  It really gets to me when you send these boxes to people after spending several hours making them, only to sit on someones shelf getting dusty.\n&gt; &gt; \n&gt; &gt; There are a lot of people who want these, so how can you tell who is a good candidate to get one?\n&gt; &gt; \n&gt; &gt; -Steve\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; One of the skepdorks wanted to put one of my boxes ina faraday cage for\n&gt; &gt; &gt; testing. My response was Well Dah, of course it won&#39;t work if you block out\n&gt; &gt; &gt; the radio signals. I told him to bite me.\n&gt; &gt; &gt; \n&gt; &gt; &gt; As far as EVP, I thought someone tried that and you can get &quot;normal&quot; EVP.\n&gt; &gt; &gt; \n&gt; &gt; &gt;  F-S\n&gt; &gt; &gt; \n&gt; &gt; &gt; On Thu, Oct 7, 2010 at 8:00 AM, Fransen, Debbie &lt;debbie.fransen@&gt;wrote:\n&gt; &gt; &gt; \n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; I just had a thought go thru my head ( Oh shit ).What would happen if you\n&gt; &gt; &gt; &gt; put a voice recorder in a\n&gt; &gt; &gt; &gt; Faraday Cage, and have a session with a ghost box.... The Faraday Cage\n&gt; &gt; &gt; &gt; isn&#39;t supposed to pick up radio\n&gt; &gt; &gt; &gt; interference right ? Would it pick up the other voices or not ? I know the\n&gt; &gt; &gt; &gt; entities are talking thru the radio\n&gt; &gt; &gt; &gt; but has anyone ever tried it ? Stupid question huh ?????\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}