{"id": "18920", "subject": "Re: [EVP-ITC] Vulgar Voices", "author": "Rhonda W", "timestamp": "2010-10-08T21:18:26Z", "full_text": "--0-379116975-1286572706=:36025\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nIve had a couple times where I had some potty language come thru, f you and=\r\n ahole whore and the like. I just told them hey knock off the foul language=\r\n please=C2=A0and a lil bit later got a sorry.=C2=A0 I found that being firm=\r\n but polite is prolly the best way to handle it. I always use the treat oth=\r\ners(even the dead)=C2=A0how I wish to be treated and it usually works out w=\r\nell.=C2=A0 If that doesnt work tell them foul language isnt allowed here an=\r\nd if they cant respect that then they need to leave...try ignoring it if th=\r\ney dont stop....cant get your goat if they arent getting attention and pret=\r\nty soon, like a child, they will stop because it becomes boring.\n=C2=A0\nHop=\r\ne this helps.\nRhonda\n\n--- On Fri, 10/8/10, Adriana Jones &lt;adrianamjones@yah=\r\noo.com&gt; wrote:\n\n\nFrom: Adriana Jones &lt;adrianamjones@...&gt;\nSubject: [EV=\r\nP-ITC] Vulgar Voices\nTo: EVP-ITC@yahoogroups.com\nDate: Friday, October 8, 2=\r\n010, 12:42 PM\n\n\n=C2=A0 \n\n\n\nI know that there are many spirits who are vulga=\r\nr, malicious, liars, troublemakers, etc. Last night I did my first ghost bo=\r\nx session alone, (my second session overall - or third if I count the synth=\r\n voice box session). During the session, I was feeling a little bit self-co=\r\nnscious and discouraged, not sure if it would work for me alone, etc. so my=\r\n mood was a little down, maybe negative.... also I&#39;m a relatively young fem=\r\nale (28). I&#39;m wondering if its due to those two factors that I received - u=\r\npon going back to listen to the recorded session (I&#39;ll try to post files up=\r\n later for confirmation)... a series of unwelcoming and vulgar messages... =\r\ntoward the beginning of the session someone said &quot;you&#39;re too young&quot; and the=\r\nn a while into it I got &quot;h* cheats, hit me hit me hit me hit me&quot;... and the=\r\nn toward the end of the session I got &quot;a**hole&quot;. (Frank, please let me know=\r\n if I&#39;ve crossed the line as far as posting up vulgar words on this group -=\r\n not sure how else\n to discuss my session, lol... and I do apologize)\n\nSo h=\r\nere&#39;s the thing, I can alter my attitude, to be more positive, but I can&#39;t =\r\nalter my age and gender... so any other females get vulgar messages like th=\r\nis? And what can I do about it? What should I say? I really have no desire =\r\nto continue with these sessions if this is how I get treated... I guess I w=\r\nas an easy target, just starting out with the ghost box, and not being a co=\r\nnfident type, I&#39;m a shy, timid, walk-all-over-me type too often.... how do =\r\nI &quot;administer discipline&quot; in this situation? Does it work to just tell them=\r\n to please stop it, or that you&#39;re not welcome if you don&#39;t behave, etc? Or=\r\n does that only egg them on further? Help! \n\n\n\n\n\n\n\n\n\n      \r\n--0-379116975-1286572706=:36025\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;DIV&gt;Ive had a couple times where I had some =\r\npotty language come thru, f you and ahole whore and the like. I just told t=\r\nhem hey knock off the foul language please&nbsp;and a lil bit later got a s=\r\norry.&nbsp; I found that being firm but polite is prolly the best way to ha=\r\nndle it. I always use the treat others(even the dead)&nbsp;how I wish to be=\r\n treated and it usually works out well.&nbsp; If that doesnt work tell them=\r\n foul language isnt allowed here and if they cant respect that then they ne=\r\ned to leave...try ignoring it if they dont stop....cant get your goat if th=\r\ney arent getting attention and pretty soon, like a child, they will stop be=\r\ncause it becomes boring.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Hope this helps.&lt;/DIV=\r\n&gt;\n&lt;DIV&gt;Rhonda&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Fri, 10/8/10, Adriana Jones &lt;I&gt;&lt;adrianamj=\r\nones@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;&lt;/DIV&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEF=\r\nT: rgb(16,16,255) 2px solid; PADDING-LEFT: 5px; MARGIN-LEFT: 5px&quot;&gt;&lt;BR&gt;From:=\r\n Adriana Jones &lt;adrianamjones@...&gt;&lt;BR&gt;Subject: [EVP-ITC] Vulgar=\r\n Voices&lt;BR&gt;To: EVP-ITC@yahoogroups.com&lt;BR&gt;Date: Friday, October 8, 2010, 12=\r\n:42 PM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3Dyiv451759604&gt;&lt;SPAN style=3D&quot;DISPLAY: none&quot;&gt;&nbsp;&lt;=\r\n/SPAN&gt; \n&lt;DIV id=3Dyiv451759604ygrp-text&gt;\n&lt;DIV&gt;I know that there are many sp=\r\nirits who are vulgar, malicious, liars, troublemakers, etc. Last night I di=\r\nd my first ghost box session alone, (my second session overall - or third i=\r\nf I count the synth voice box session). During the session, I was feeling a=\r\n little bit self-conscious and discouraged, not sure if it would work for m=\r\ne alone, etc. so my mood was a little down, maybe negative.... also I&#39;m a r=\r\nelatively young female (28). I&#39;m wondering if its due to those two factors =\r\nthat I received - upon going back to listen to the recorded session (I&#39;ll t=\r\nry to post files up later for confirmation)... a series of unwelcoming and =\r\nvulgar messages... toward the beginning of the session someone said &quot;you&#39;re=\r\n too young&quot; and then a while into it I got &quot;h* cheats, hit me hit me hit me=\r\n hit me&quot;... and then toward the end of the session I got &quot;a**hole&quot;. (Frank,=\r\n please let me know if I&#39;ve crossed the line as far as posting up vulgar wo=\r\nrds on this group - not sure how\n else to discuss my session, lol... and I =\r\ndo apologize)&lt;BR&gt;&lt;BR&gt;So here&#39;s the thing, I can alter my attitude, to be mo=\r\nre positive, but I can&#39;t alter my age and gender... so any other females ge=\r\nt vulgar messages like this? And what can I do about it? What should I say?=\r\n I really have no desire to continue with these sessions if this is how I g=\r\net treated... I guess I was an easy target, just starting out with the ghos=\r\nt box, and not being a confident type, I&#39;m a shy, timid, walk-all-over-me t=\r\nype too often.... how do I &quot;administer discipline&quot; in this situation? Does =\r\nit work to just tell them to please stop it, or that you&#39;re not welcome if =\r\nyou don&#39;t behave, etc? Or does that only egg them on further? Help! &lt;BR&gt;&lt;BR=\r\n&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n      \r\n--0-379116975-1286572706=:36025--"}