{"id": "18925", "subject": "Re: [EVP-ITC] Re: Faraday Cage", "author": "Frank Sumption", "timestamp": "2010-10-09T01:53:00Z", "full_text": "Thanks. I don&#39;t do investigations, and usually asking questions does not\nwork for me, so I am not 100% on how much the entities rely on broadcast\nstations, or if it&#39;s possible to still get voices with no radio stations.\nLots of questions that need answers.\n\n F-S\n\nOn Fri, Oct 8, 2010 at 9:48 AM, draiga1 &lt;mail@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Hi Steve,\n&gt;\n&gt; I haven&#39;t been on the lists much lately due to a heavy Fall workload, but I\n&gt; wanted to let you know that I have been using your box, and getting great\n&gt; results. I did a session with a girl who had a loved one commit suicide, and\n&gt; he came through.\n&gt;\n&gt; I have some investigations coming up where I will be bringing my Steve&#39;s\n&gt; box too!\n&gt;\n&gt; I also asked the box about a sensitive situation with a ghost and a family,\n&gt; and got answers to my questions on that as well.\n&gt;\n&gt; I know you work very hard on your boxes and they rock! The day before\n&gt; yesterday I was more signally challenged than usual and had the sweep set\n&gt; quite fast, yet clear as can be a woman&#39;s voice came through a couple of\n&gt; times. It could not have been stray radio signal.\n&gt;\n&gt; So just wanted to let you know, that I may fall way behind on the lists at\n&gt; the moment till I get this updating done, I am still using your box, though.\n&gt; Your hard work is appreciated here!\n&gt;\n&gt; Thanks!\n&gt; Draiga\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, &quot;Urkel23&quot;\n&gt; &lt;urkel23@...&gt; wrote:\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Was that the same person who stole box #63 after i tested it and sent it\n&gt; back to you. I hate to see these things go to waste. It really gets to me\n&gt; when you send these boxes to people after spending several hours making\n&gt; them, only to sit on someones shelf getting dusty.\n&gt; &gt;\n&gt; &gt; There are a lot of people who want these, so how can you tell who is a\n&gt; good candidate to get one?\n&gt; &gt;\n&gt; &gt; -Steve\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Frank\n&gt; Sumption &lt;purplealiengirl@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; One of the skepdorks wanted to put one of my boxes ina faraday cage for\n&gt; &gt; &gt; testing. My response was Well Dah, of course it won&#39;t work if you block\n&gt; out\n&gt; &gt; &gt; the radio signals. I told him to bite me.\n&gt; &gt; &gt;\n&gt; &gt; &gt; As far as EVP, I thought someone tried that and you can get &quot;normal&quot;\n&gt; EVP.\n&gt; &gt; &gt;\n&gt; &gt; &gt; F-S\n&gt; &gt; &gt;\n&gt; &gt; &gt; On Thu, Oct 7, 2010 at 8:00 AM, Fransen, Debbie &lt;debbie.fransen@\n&gt; &gt;wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; I just had a thought go thru my head ( Oh shit ).What would happen if\n&gt; you\n&gt; &gt; &gt; &gt; put a voice recorder in a\n&gt; &gt; &gt; &gt; Faraday Cage, and have a session with a ghost box.... The Faraday\n&gt; Cage\n&gt; &gt; &gt; &gt; isn&#39;t supposed to pick up radio\n&gt; &gt; &gt; &gt; interference right ? Would it pick up the other voices or not ? I\n&gt; know the\n&gt; &gt; &gt; &gt; entities are talking thru the radio\n&gt; &gt; &gt; &gt; but has anyone ever tried it ? Stupid question huh ?????\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nThanks. I don' do in es iga ions, and usually asking ques ions does no wo k o me, so I am no 100% on how much he en i ies ely on b oadcas s a ions, o i i 's possible o s ill ge oices wi h no adio s a ions. Lo s o ques ions ha need answe s.\n\n \n F-S\nOn F i, Oc 8, 2010 a 9:48 AM, d aiga1 mail@...> w o e:\n\n  \n\n\n\nHi S e e,I ha en' been on he lis s much la ely due o a hea y Fall wo kload, bu I wan ed o le you know ha I ha e been using you box, and ge ing g ea esul s. I did a session wi h a gi l who had a lo ed one commi suicide, and he came h ough. \nI ha e some in es iga ions coming up whe e I will be b inging my S e e's box oo! I also asked he box abou a sensi i e si ua ion wi h a ghos and a amily, and go answe s o my ques ions on ha as well.\nI know you wo k e y ha d on you boxes and hey ock! The day be o e yes e day I was mo e signally challenged han usual and had he sweep se qui e as , ye clea as can be a woman's oice came h ough a couple o imes. I could no ha e been s ay adio signal. \nSo jus wan ed o le you know, ha I may all way behind on he lis s a he momen ill I ge his upda ing done, I am s ill using you box, hough. You ha d wo k is app ecia ed he e!Thanks!D aiga \n--- In EVP-ITC@yahoog oups.com, \"U kel23\" w o e:>> > Was ha he same pe son who s ole box #63 a e i es ed i and sen i back o you. I ha e o see hese hings go o was e. I eally ge s o me when you send hese boxes o people a e spending se e al hou s making hem, only o si on someones shel ge ing dus y.\n> > The e a e a lo o people who wan hese, so how can you ell who is a good candida e o ge one?> > -S e e> > > > --- In EVP-ITC@yahoog oups.com, F ank Sump ion w o e:\n> >> > One o he skepdo ks wan ed o pu one o my boxes ina a aday cage o > > es ing. My esponse was Well Dah, o cou se i won' wo k i you block ou > > he adio signals. I old him o bi e me.\n> > > > As a as EVP, I hough someone ied ha and you can ge \"no mal\" EVP.> > > > F-S> > > > On Thu, Oc 7, 2010 a 8:00 AM, F ansen, Debbie w o e:\n> > > > >> > >> > >> > > I jus had a hough go h u my head ( Oh shi ).Wha would happen i you> > > pu a oice eco de in a> > > Fa aday Cage, and ha e a session wi h a ghos box.... The Fa aday Cage\n> > > isn' supposed o pick up adio> > > in e e ence igh ? Would i pick up he o he oices o no ? I know he> > > en i ies a e alking h u he adio> > > bu has anyone e e ied i ? S upid ques ion huh ?????\n> > >> > >> > >> > > > > >> >>"}