{"id": "18945", "subject": "Re: [EVP-ITC] Re: Vulgar Voices", "author": "Frank Sumption", "timestamp": "2010-10-10T01:16:01Z", "full_text": "Besides Pebbles Flintstone?\n\nF-S\n\nOn Sat, Oct 9, 2010 at 12:18 PM, Tim &lt;sir_tim1@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; frank, there is also a person (girl) who they call pebbles also. she has a\n&gt; nice voice too.\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Frank Sumption\n&gt; &lt;purplealiengirl@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; &quot;Coincidentally&quot; they&#39;re talking about pebbles.\n&gt; &gt;\n&gt; &gt; F-S\n&gt; &gt;\n&gt; &gt; On Sat, Oct 9, 2010 at 12:09 AM, Frank Sumption\n&gt; &gt; &lt;purplealiengirl@...&gt;wrote:\n&gt;\n&gt; &gt;\n&gt; &gt; &gt; I used to get alot of that stuff, I usually listen form tape, and when\n&gt; &gt; &gt; they were really obnoxious I would just back the tape up and record\n&gt; over the\n&gt; &gt; &gt; bad voice. I don&#39;t how it works, but it stops them cold. They don&#39;t\n&gt; come\n&gt; &gt; &gt; back and keep harassing. I tolerate some cussing an name calling, I can\n&gt; out\n&gt; &gt; &gt; cuss any of them!\n&gt; &gt; &gt;\n&gt; &gt; &gt; They probably find other ways to pull tricks, which is why I don&#39;t any\n&gt; &gt; &gt; information as gospel from the boxes, and I laugh at the experts that\n&gt; think\n&gt; &gt; &gt; they have it all figured out.\n&gt; &gt; &gt;\n&gt; &gt; &gt; There&#39;s a thing from India--I think--the spirits throw pebbles at\n&gt; people\n&gt; &gt; &gt; walking along the paths at night to put a little fear in the people.\n&gt; With\n&gt; &gt; &gt; boxes, they also throw pebbles--and &quot;they&quot; tell me they throw pebbles.\n&gt; It&#39;s\n&gt; &gt; &gt; like a game or something.\n&gt; &gt; &gt;\n&gt; &gt; &gt; F-S\n&gt; &gt; &gt;\n&gt; &gt; &gt; On Fri, Oct 8, 2010 at 3:28 PM, Adriana Jones &lt;adrianamjones@...&gt;wrote:\n&gt;\n&gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt; Thanks guys for the advice, I was a little bit distressed at first\n&gt; upon\n&gt; &gt; &gt;&gt; hearing those things, but I feel a little bit better now... and armed\n&gt; with\n&gt; &gt; &gt;&gt; advice on how to handle it next time... I also found someone say the\n&gt; f-word\n&gt; &gt; &gt;&gt; now too, but I&#39;ll know how to handle it better now. Should I post the\n&gt; vulgar\n&gt; &gt; &gt;&gt; files up on here, as proof, or should I leave them off this group, for\n&gt; being\n&gt; &gt; &gt;&gt; vulgar? Frank? Anyone? Please let me know.\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt; &lt;EVP-ITC%\n&gt; 40yahoogroups.com&gt;, &quot;Adriana\n&gt;\n&gt; &gt; &gt;&gt; Jones&quot; &lt;adrianamjones@&gt; wrote:\n&gt; &gt; &gt;&gt; &gt;\n&gt; &gt; &gt;&gt; &gt; I know that there are many spirits who are vulgar, malicious, liars,\n&gt; &gt; &gt;&gt; troublemakers, etc. Last night I did my first ghost box session alone,\n&gt; (my\n&gt; &gt; &gt;&gt; second session overall - or third if I count the synth voice box\n&gt; session).\n&gt; &gt; &gt;&gt; During the session, I was feeling a little bit self-conscious and\n&gt; &gt; &gt;&gt; discouraged, not sure if it would work for me alone, etc. so my mood\n&gt; was a\n&gt; &gt; &gt;&gt; little down, maybe negative.... also I&#39;m a relatively young female\n&gt; (28). I&#39;m\n&gt; &gt; &gt;&gt; wondering if its due to those two factors that I received - upon going\n&gt; back\n&gt; &gt; &gt;&gt; to listen to the recorded session (I&#39;ll try to post files up later for\n&gt; &gt; &gt;&gt; confirmation)... a series of unwelcoming and vulgar messages... toward\n&gt; the\n&gt; &gt; &gt;&gt; beginning of the session someone said &quot;you&#39;re too young&quot; and then a\n&gt; while\n&gt; &gt; &gt;&gt; into it I got &quot;h* cheats, hit me hit me hit me hit me&quot;... and then\n&gt; toward\n&gt; &gt; &gt;&gt; the end of the session I got &quot;a**hole&quot;. (Frank, please let me know if\n&gt; I&#39;ve\n&gt; &gt; &gt;&gt; crossed the line as far as posting up vulgar words on this group - not\n&gt; sure\n&gt; &gt; &gt;&gt; how else to discuss my session, lol... and I do apologize)\n&gt; &gt; &gt;&gt; &gt;\n&gt; &gt; &gt;&gt; &gt; So here&#39;s the thing, I can alter my attitude, to be more positive,\n&gt; but I\n&gt; &gt; &gt;&gt; can&#39;t alter my age and gender... so any other females get vulgar\n&gt; messages\n&gt; &gt; &gt;&gt; like this? And what can I do about it? What should I say? I really\n&gt; have no\n&gt; &gt; &gt;&gt; desire to continue with these sessions if this is how I get treated...\n&gt; I\n&gt; &gt; &gt;&gt; guess I was an easy target, just starting out with the ghost box, and\n&gt; not\n&gt; &gt; &gt;&gt; being a confident type, I&#39;m a shy, timid, walk-all-over-me type too\n&gt; &gt; &gt;&gt; often.... how do I &quot;administer discipline&quot; in this situation? Does it\n&gt; work\n&gt; &gt; &gt;&gt; to just tell them to please stop it, or that you&#39;re not welcome if you\n&gt; don&#39;t\n&gt; &gt; &gt;&gt; behave, etc? Or does that only egg them on further? Help!\n&gt; &gt; &gt;&gt; &gt;\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nBesides Pebbles Flin s one?\n \nF-S\nOn Sa , Oc 9, 2010 a 12:18 PM, Tim si _ im1@...> w o e:\n\n  \n\n\n\n ank, he e is also a pe son (gi l) who hey call pebbles also. she has a nice oice oo. \n--- In EVP-ITC@yahoog oups.com, F ank Sump ion w o e:>> \"Coinciden ally\" hey' e alking abou pebbles.\n> > F-S> > On Sa , Oc 9, 2010 a 12:09 AM, F ank Sump ion> w o e: \n> > > I used o ge alo o ha s u , I usually lis en o m ape, and when> > hey we e eally obnoxious I would jus back he ape up and eco d o e he> > bad oice. I don' how i wo ks, bu i s ops hem cold. They don' come\n> > back and keep ha assing. I ole a e some cussing an name calling, I can ou > > cuss any o hem!> >> > They p obably ind o he ways o pull icks, which is why I don' any\n> > in o ma ion as gospel om he boxes, and I laugh a he expe s ha hink> > hey ha e i all igu ed ou .> >> > The e's a hing om India--I hink-- he spi i s h ow pebbles a people\n> > walking along he pa hs a nigh o pu a li le ea in he people. Wi h> > boxes, hey also h ow pebbles--and \" hey\" ell me hey h ow pebbles. I 's> > like a game o some hing.\n> >> > F-S> >> > On F i, Oc 8, 2010 a 3:28 PM, Ad iana Jones w o e: \n> >> >>> >>> >> Thanks guys o he ad ice, I was a li le bi dis essed a i s upon> >> hea ing hose hings, bu I eel a li le bi be e now... and a med wi h\n> >> ad ice on how o handle i nex ime... I also ound someone say he -wo d> >> now oo, bu I'll know how o handle i be e now. Should I pos he ulga > >> iles up on he e, as p oo , o should I lea e hem o his g oup, o being\n> >> ulga ? F ank? Anyone? Please le me know.> >>> >>> >> --- In EVP-ITC@yahoog oups.com 40yahoog oups.com>, \"Ad iana \n\n\n> >> Jones\" w o e:> >> >> >> > I know ha he e a e many spi i s who a e ulga , malicious, lia s,> >> oublemake s, e c. Las nigh I did my i s ghos box session alone, (my\n> >> second session o e all - o hi d i I coun he syn h oice box session).> >> Du ing he session, I was eeling a li le bi sel -conscious and> >> discou aged, no su e i i would wo k o me alone, e c. so my mood was a\n> >> li le down, maybe nega i e.... also I'm a ela i ely young emale (28). I'm> >> wonde ing i i s due o hose wo ac o s ha I ecei ed - upon going back> >> o lis en o he eco ded session (I'll y o pos iles up la e o \n> >> con i ma ion)... a se ies o unwelcoming and ulga messages... owa d he> >> beginning o he session someone said \"you' e oo young\" and hen a while> >> in o i I go \"h* chea s, hi me hi me hi me hi me\"... and hen owa d\n> >> he end o he session I go \"a**hole\". (F ank, please le me know i I' e> >> c ossed he line as a as pos ing up ulga wo ds on his g oup - no su e> >> how else o discuss my session, lol... and I do apologize)\n> >> >> >> > So he e's he hing, I can al e my a i ude, o be mo e posi i e, bu I> >> can' al e my age and gende ... so any o he emales ge ulga messages> >> like his? And wha can I do abou i ? Wha should I say? I eally ha e no\n> >> desi e o con inue wi h hese sessions i his is how I ge ea ed... I> >> guess I was an easy a ge , jus s a ing ou wi h he ghos box, and no > >> being a con iden ype, I'm a shy, imid, walk-all-o e -me ype oo\n> >> o en.... how do I \"adminis e discipline\" in his si ua ion? Does i wo k> >> o jus ell hem o please s op i , o ha you' e no welcome i you don' > >> beha e, e c? O does ha only egg hem on u he ? Help!\n> >> >> >>> >> > >>> >> >>"}