{"id": "18974", "subject": "Re: [EVP-ITC] Re: Ghost Box Success Rate / Response to FS post", "author": "Tim Woolworth", "timestamp": "2010-10-12T02:45:20Z", "full_text": "I read on the Butlers ATC site a few months back that they had a group\ntesting the boxes and they would post their findings soon.  Are these the\nresults that the Butler&#39;s came up with from this test, or are these results\nfrom an early experiment?  I just went to their site and couldn&#39;t find\nmention of it, but right on their homepage there was this:\n\n&quot;Everyone is invited to use EVPmaker to name the secret object.&quot;\n\nSounds familiar, huh?  I wonder if RJ is part of their group.\n\nTim\n\nOn Mon, Oct 11, 2010 at 10:39 PM, Country &lt;plaine@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Wow, never knew that the Butlers had supposedly tested your box, along with\n&gt; having no contact with you, and dubbed it or the method nothing. That is an\n&gt; eye opener for me.\n&gt;\n&gt; The association (ITC) now run by the Butlers used to be named, AA-EVP, I\n&gt; believe, so named by the creator of the group, Sarah Estep but they felt the\n&gt; name should be changed, why, who knows, never thought there was a problem\n&gt; with the original name.\n&gt;\n&gt; I am glad you posted this bit of information; I see some people in a\n&gt; different light now. I agree with you regarding the money aspect coloring\n&gt; the actions of some &quot;experts&quot; in the field, not everyone of course but\n&gt; enough to be cautious. They aren&#39;t fooling anyone but themselves in the long\n&gt; run.\n&gt; CB\n&gt;\n&gt; &gt;&gt;&gt;Re: Ghost Box Success Rate\n&gt; Posted by: &quot;Frank Sumption&quot; purplealiengirl@...&lt;purplealiengirl%40gmail.com&gt;purplespacefriend\n&gt; Sat Oct 2, 2010 11:52 pm (PDT)\n&gt; I know ther are real scientists out there that would probably study this\n&gt; stuff if it weren&#39;t for being ridiculed by the dumb ones. Unfortunate that\n&gt; there are people that have put themselves in positions of authority, such\n&gt; as\n&gt; the Bulters, that claim they had a team of &quot;more qualified listeners&quot; test\n&gt; the boxes and they found nothing to it. Never asking me anything about the\n&gt; box, or the theory behind it. Always these experts that know better. Some\n&gt; of these people have $$ interest in keep real knowledge hidden.\n&gt;\n&gt; F-S&lt;\n&gt;\n&gt;  \n&gt;\n\nI ead on he Bu le s ATC si e a ew mon hs back ha hey had a g oup es ing he boxes and hey would pos hei indings soon.  A e hese he esul s ha he Bu le 's came up wi h om his es , o a e hese esul s om an ea ly expe imen ?  I jus wen o hei si e and couldn' ind men ion o i , bu igh on hei homepage he e was his: \n\"E e yone is in i ed o use EVPmake o name he sec e objec .\"\nSounds amilia , huh?  I wonde i RJ is pa o hei g oup.\nTimOn Mon, Oc 11, 2010 a 10:39 PM, Coun y plaine@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n Wow, ne e knew ha he Bu le s had supposedly es ed you box, along wi h ha ing no con ac wi h you, and dubbed i o he me hod no hing. Tha is an eye opene o me.\n\nThe associa ion (ITC) now un by he Bu le s used o be named, AA-EVP, I belie e, so named by he c ea o o he g oup, Sa ah Es ep bu hey el he name should be changed, why, who knows, ne e hough he e was a p oblem wi h he o iginal name.\n\n\nI am glad you pos ed his bi o in o ma ion; I see some people in a di e en ligh now. I ag ee wi h you ega ding he money aspec colo ing he ac ions o some \"expe s\" in he ield, no e e yone o cou se bu enough o be cau ious. They a en' ooling anyone bu hemsel es in he long un.\n\nCB\n\n>>>Re: Ghos Box Success Ra e \nPos ed by: \"F ank Sump ion\" pu plealiengi l@... pu plespace iend \nSa Oc 2, 2010 11:52 pm (PDT) \nI know he a e eal scien is s ou he e ha would p obably s udy his\ns u i i we en' o being idiculed by he dumb ones. Un o una e ha \n he e a e people ha ha e pu hemsel es in posi ions o au ho i y, such as\n he Bul e s, ha claim hey had a eam o \"mo e quali ied lis ene s\" es \n he boxes and hey ound no hing o i . Ne e asking me any hing abou he\nbox, o he heo y behind i . Always hese expe s ha know be e . Some\no hese people ha e $$ in e es in keep eal knowledge hidden.\n\nF-S"}