{"id": "18984", "subject": "Re: [EVP-ITC] &#39;nother &quot;hits the earth&quot; [1 Attachment]", "author": "Tim Woolworth", "timestamp": "2010-10-13T23:37:09Z", "full_text": "It&#39;s weird how many of these messages you get.  The only reason I question\nthem is that they keep changes the month on you, but it always seems to be\nbetween may-august in their messages.\n\nThe solar system is exceedingly active this month, way more so than usual.\n On October 8 - 10 - 12- 13 - 14 - 16 - 17 there are asteroids that are real\nclose to Earths orbit, and on October 20th, Comet Hartley 2 will be about 45\ntimes the Earth-Moon distance from the Earth (or about 17.7 million\nkilometers).  Which is pretty close in space distance.\n\nTim\n\nOn Wed, Oct 13, 2010 at 6:05 PM, Frank Sumption\n&lt;purplealiengirl@...&gt;wrote:\n\n&gt;\n&gt;  [Attachment(s) &lt;#12ba7a0700dd6213_TopText&gt; from Frank Sumption included\n&gt; below]\n&gt;\n&gt;  I screwed up, I thought I plugged the box in to the recorder mic input,\n&gt; but had it in the headphone jack, so this was recorded open air, off the\n&gt; speaker. Sometimes ya get clearer voices like that. Others have gotten\n&gt; voices having to do with Seven.\n&gt;\n&gt;  F-S\n&gt;\n&gt;  \n&gt;\n\nI 's wei d how many o hese messages you ge .  The only eason I ques ion hem is ha hey keep changes he mon h on you, bu i always seems o be be ween may-augus in hei messages.The sola sys em is exceedingly ac i e his mon h, way mo e so han usual.  On Oc obe  8 - 10 - 12- 13 - 14 - 16 - 17 he e a e as e oids ha a e eal close o Ea hs o bi , and on Oc obe 20 h, Come Ha ley 2 will be abou 45 imes he Ea h-Moon dis ance om he Ea h (o abou 17.7 million kilome e s).  Which is p e y close in space dis ance. \nTim\nOn Wed, Oc 13, 2010 a 6:05 PM, F ank Sump ion pu plealiengi l@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n [A achmen (s) om F ank Sump ion included below]\n \n \n  I sc ewed up, I hough I plugged he box in o he eco de  mic inpu , bu had i in he headphone jack, so his was eco ded open ai , o he speake . Some imes ya ge clea e oices like ha . O he s ha e go en oices ha ing o do wi h Se en. \n\n\n \n F-S"}