{"id": "18982", "subject": "Re: [EVP-ITC] New cool file [3 Attachments]", "author": "Frank Sumption", "timestamp": "2010-10-13T22:15:51Z", "full_text": "The 069 file I can hear, the understand one, to me--&quot;your fault I&#39;m here&quot;,\nand the last is that same broken wash machine sound. As far a s new\nlanguage--why!? Even the ET&#39;s use english.\n\n BTW, ya don&#39;t wanna leave a box on all the time, that&#39;s just nutz.\n\n Try watching the Naked Archeologist on History International, you&#39;ll find\nall the religion junk isn&#39;t as you/we were taught, and is suspect at best.\nHardly gospel truth as most assume, more of an urban legend than anything.\n\nF-S\n\nOn Wed, Oct 13, 2010 at 1:17 PM, &lt;SnowfireL@...&gt; wrote:\n\n&gt;\n&gt;  [Attachment(s)&lt;https://mail.google.com/mail/?ui=2&view=js&name=main,tlist&ver=B0YhjO3vx0M.en.&am=!iMxkIOjHSP6xhZ4C2vD2RlU83tVDsdkscI1vf0X-QVRrkJZeJ30L&fri#12ba706a2f44ad29_TopText&gt;from\n&gt; SnowfireL@... included below]\n&gt;\n&gt; Hopefully, you all can hear these too.  Enjoy, sf\n&gt; First one for me, a man and group says; &quot;good day, radio seems clear, radio\n&gt; back on.&quot;  Guess, they wanted me to leave it on for them.  Next one, says,\n&gt; last one is an attempt to teach you a new language, David says, &quot;they won&#39;t\n&gt; understand&quot; but as I told him, we gonna try to make em understand anyway,\n&gt; some how. &lt;g&gt;. sf\n&gt;\n&gt; \n&gt;\n\nThe 069 ile I can hea , he unde s and one, o me--\"you aul I'm he e\", and he las is ha same b oken wash machine sound. As a a s new language--why!? E en he ET's use english. \n \n BTW, ya don' wanna lea e a box on all he ime, ha 's jus nu z. \n \n T y wa ching he Naked A cheologis on His o y In e na ional, you'll ind all he eligion junk isn' as you/we we e augh , and is suspec a bes . Ha dly gospel u h as mos assume, mo e o an u ban legend han any hing. \n\n \nF-S\nOn Wed, Oc 13, 2010 a 1:17 PM, Snow i eL@...> w o e:\n\n  \n\n\n[A achmen (s) om Snow i eL@... included below] \n\nHope ully, you all can hea hese oo.  Enjoy, s \nFi s one o  me, a man and g oup says; \"good day, adio seems clea ,  adio back on.\"  Guess, hey wan ed me o lea e i on o hem.  Nex one, says, las one is an a emp o each you a new language, Da id says, \" hey won' unde s and\" bu as I old him, we gonna y o make em unde s and anyway, some how. . s"}