{"id": "19018", "subject": "Re: [EVP-ITC] Re: Ghost Box Success Rate / Response to FS post", "author": "Tim Woolworth", "timestamp": "2010-10-18T01:31:11Z", "full_text": "CB,\n\nThanks for the link.  That is exactly what I was talking about.  The last\ntime I checked, the results had not been posted.  No surprise here, they\nrules GB out.  But, their fallacy was that they were trying to condense GB\ncommunication into terms of EVP which in my opinion cannot be done.  They\nare two distinctly different forms of communication.\n\nI find it quite amusing that they surmised that GB technology does not work\nbased upon a few select files based off of one user using one box.  How\nridiculous, not to mention limiting, is that?  If they wanted to actually\nconduct a study, it should have been with ghost box users who have a\nrelationship with the other side.  Or at the very least, invited ghost box\nusers to listen to their meager file selection in order to contribute.\n\nOh well.  Those of us who use the boxes know that it works and that is all\nthat matters.  I did a public demonstration of ghost boxes last night during\na fund raising event (using a minibox plus and a Joe&#39;s box) that left over\n400 people convinced (including members of a different ghost group) that\nthere was something to this.  Jaws were dropping as my name was called out,\nsoldiers names were called out, and even the name of a general who was at\nthe Fort we did the benefit for.\n\nSo despite the efforts of groups like ATC to put GB down, ghost boxes will\ncatch on.\n\nTim\n\nOn Thu, Oct 14, 2010 at 11:53 PM, Country &lt;plaine@colomail.com&gt; wrote:\n\n&gt;\n&gt;\n&gt; Tim:\n&gt;\n&gt; I, too, saw the &quot;guess my line&quot; (i.e. guess the secret object) experiment\n&gt; on the ITC web site as well and also thought of someone else who used to be\n&gt; on this group. I suspect he may possibly have gotten that idea from this web\n&gt; site?\n&gt;\n&gt; In any case, I did find this article on the ITC web site discrediting or\n&gt; debunking or whatever the proper term is for EVP&#39;s via radio sweep. Perhaps\n&gt; this is what you are referring to?\n&gt;\n&gt; http://atransc.org/journal/radiosweep_study.htm\n&gt;\n&gt; Cheers,\n&gt; CB\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Tim Woolworth\n&gt; &lt;tjwoolworth@...&gt; wrote:\n&gt; I read on the Butlers ATC site a few months back that they had a\n&gt; grouptesting the boxes and they would post their findings soon. Are these\n&gt; the results that the Butler&#39;s came up with from this test, or are these\n&gt; results from an early experiment? I just went to their site and couldn&#39;t\n&gt; find mention of it, but right on their homepage there was this:\n&gt; &gt; &quot;Everyone is invited to use EVPmaker to name the secret object.&quot;\n&gt; &gt; Sounds familiar, huh? I wonder if RJ is part of their group.\n&gt; &gt; Tim\n&gt;\n&gt;  \n&gt;\n\nCB,Thanks o he link.  Tha is exac ly wha I was alking abou .  The las ime I checked, he esul s had no been pos ed.  No su p ise he e, hey ules GB ou .  Bu , hei allacy was ha hey we e ying o condense GB communica ion in o e ms o EVP which in my opinion canno be done.  They a e wo dis inc ly di e en o ms o communica ion.\nI ind i qui e amusing ha hey su mised ha GB echnology does no wo k based upon a ew selec iles based o o one use using one box.  How idiculous, no o men ion limi ing, is ha ?  I hey wan ed o ac ually conduc a s udy, i should ha e been wi h ghos box use s who ha e a ela ionship wi h he o he side.  O a he e y leas , in i ed ghos box use s o lis en o hei meage ile selec ion in o de o con ibu e.\nOh well.  Those o us who use he boxes know ha i wo ks and ha is all ha ma e s.  I did a public demons a ion o ghos boxes las nigh du ing a und aising e en (using a minibox plus and a Joe's box) ha le o e 400 people con inced (including membe s o a di e en ghos g oup) ha he e was some hing o his.  Jaws we e d opping as my name was called ou , soldie s names we e called ou , and e en he name o a gene al who was a he Fo we did he bene i o .\nSo despi e he e o s o g oups like ATC o pu GB down, ghos boxes will ca ch on.  TimOn Thu, Oc 14, 2010 a 11:53 PM, Coun y plaine@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n Tim:\n\nI, oo, saw he \"guess my line\" (i.e. guess he sec e objec ) expe imen on he ITC web si e as well and also hough o someone else who used o be on his g oup. I suspec he may possibly ha e go en ha idea om his web si e?\n\n\nIn any case, I did ind his a icle on he ITC web si e disc edi ing o debunking o wha e e he p ope e m is o EVP's ia adio sweep. Pe haps his is wha you a e e e ing o?\n\nh p://a ansc.o g/jou nal/ adiosweep_s udy.h m\n\nChee s,\nCB\n\n--- In EVP-ITC@yahoog oups.com, Tim Woolwo h w o e:\nI ead on he Bu le s ATC si e a ew mon hs back ha hey had a g oup es ing he boxes and hey would pos hei indings soon. A e hese he esul s ha he Bu le 's came up wi h om his es , o a e hese esul s om an ea ly expe imen ? I jus wen o hei si e and couldn' ind men ion o i , bu igh on hei homepage he e was his: \n\n> \"E e yone is in i ed o use EVPmake o name he sec e objec .\" \n> Sounds amilia , huh? I wonde i RJ is pa o hei g oup. \n> Tim"}