{"id": "19010", "subject": "Re: A slew of &quot;no&quot;&#39;s", "author": "Adriana Jones", "timestamp": "2010-10-17T17:26:06Z", "full_text": "I don&#39;t know one way or the other about reincarnation... heard so many sides don&#39;t know what to believe... but can certainly understand the idea that we would share cellular memories, regardles of whether or not full reincarnation is real... fascinating ideas and possibilities there..\n\n--- In EVP-ITC@yahoogroups.com, SnowfireL@... wrote:\n&gt;\n&gt; DEJ&#39; EVUES, are cellular memory of our loved ones, or guides memory&#39;s while \n&gt;  on earth when they lived, this universe is far to vast a place for souls \n&gt; to  return here over and over again, makes no sense really. 16 people could \n&gt; have  been related to Cleopatra through cell memory, but they all cannot have \n&gt; been  her.  When ones hears about the &quot;long, long line&quot; going from darkness \n&gt; into  the light for all those who may have thought they were going to \n&gt; reincarnate, to  buy Heaven know differently now.  There is a such thing as \n&gt; &quot;incarnation&quot;  but that is far different from reincarnation.  Difference is: with \n&gt; R, they  try to buy the way into Heaven, with In, they are already coming \n&gt; from Heaven  down to help on this side for a purpose, not to try to earn \n&gt; brownie points to  get into Heaven, they come here to attach with other spirits \n&gt; in the body to aid  in some way, or for a Divine purpose. sf\n&gt;  \n&gt;  \n&gt; In a message dated 10/17/2010 12:58:16 P.M. Eastern Standard Time,  \n&gt; rickwegrzyn@... writes:\n&gt; \n&gt;  \n&gt;  \n&gt;  \n&gt;  \n&gt; I believe in the reincarnation thing cause I&#39;ve had to many DEJ&#39; EVUES  how \n&gt; ever u spell it..lol..done alot of traveling and seem to know whats coming  \n&gt; down the road before we get there.....That recorder your husband uses,is it \n&gt;  digital....\n&gt; \n&gt; \n&gt;  \n&gt; ____________________________________\n&gt;  From: Adriana Jones  &lt;adrianamjones@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Sun, October 17, 2010 9:08:01  AM\n&gt; Subject: [EVP-ITC] A slew  of &quot;no&quot;&#39;s\n&gt; \n&gt; \n&gt; When my husband asked whether or not reincarnation is real, he was met with \n&gt;  a slew of &quot;no&quot;&#39;s. We know better than to believe anything they say one way \n&gt; or  the other, but we do recognize that this is excellent proof of \n&gt; intelligent  communication... how often do you scan the dial and get like five or \n&gt; six  &quot;no&quot;&#39;s this close together?\n&gt; \n&gt; See &quot;reincar-no&quot; file in my folder  &quot;Adriana&#39;s files&quot; in the files  section.\n&gt;"}