{"id": "19012", "subject": "Re: A slew of &quot;no&quot;&#39;s", "author": "Adriana Jones", "timestamp": "2010-10-17T17:43:36Z", "full_text": "Lol, gotta agree that I&#39;d rather retain my identity, and NOT come back here again.  Once around here is more than enough, lol!\n\n--- In EVP-ITC@yahoogroups.com, SnowfireL@... wrote:\n&gt;\n&gt; Well, Christ did not die in vain, must have been a reason for Him to come  \n&gt; here to begin with, and I don&#39;t want to bust bubbles, incarnation is far  \n&gt; different from reincarnation.  We retain our identity after the change  called \n&gt; death, if anyone wants to come back here over again, so be it, but can&#39;t  \n&gt; pay me too.   Well, maybe for a little visit, &lt;g&gt;. sf\n&gt;  \n&gt;  \n&gt; In a message dated 10/17/2010 1:26:18 P.M. Eastern Standard Time,  \n&gt; adrianamjones@... writes:\n&gt; \n&gt;  \n&gt;  \n&gt;  \n&gt; I don&#39;t know one way or the other about reincarnation... heard so many  \n&gt; sides don&#39;t know what to believe... but can certainly understand the idea that  \n&gt; we would share cellular memories, regardles of whether or not full  \n&gt; reincarnation is real... fascinating ideas and possibilities  there..\n&gt; \n&gt; --- In _EVP-ITC@yahoogroups.com_ (mailto:EVP-ITC@yahoogroups.com) ,  \n&gt; SnowfireL@ wrote:\n&gt; &gt;\n&gt; &gt; DEJ&#39; EVUES, are cellular memory of our  loved ones, or guides memory&#39;s \n&gt; while \n&gt; &gt; on earth when they lived, this  universe is far to vast a place for souls \n&gt; &gt; to return here over and  over again, makes no sense really. 16 people \n&gt; could \n&gt; &gt; have been related  to Cleopatra through cell memory, but they all cannot \n&gt; have \n&gt; &gt; been her.  When ones hears about the &quot;long, long line&quot; going from \n&gt; darkness \n&gt; &gt; into  the light for all those who may have thought they were going to \n&gt; &gt;  reincarnate, to buy Heaven know differently now. There is a such thing \n&gt; as  \n&gt; &gt; &quot;incarnation&quot; but that is far different from reincarnation.  Difference \n&gt; is: with \n&gt; &gt; R, they try to buy the way into Heaven, with In,  they are already coming \n&gt; &gt; from Heaven down to help on this side for a  purpose, not to try to earn \n&gt; &gt; brownie points to get into Heaven, they  come here to attach with other \n&gt; spirits \n&gt; &gt; in the body to aid in some  way, or for a Divine purpose. sf\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; In a message dated  10/17/2010 12:58:16 P.M. Eastern Standard Time, \n&gt; &gt; rickwegrzyn@  writes:\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; I believe in the  reincarnation thing cause I&#39;ve had to many DEJ&#39; EVUES \n&gt; how \n&gt; &gt; ever u  spell it..lol..done alot of traveling and seem to know whats \n&gt; coming \n&gt; &gt;  down the road before we get there.....That recorder your husband uses,is \n&gt; it  \n&gt; &gt; digital....\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt;  ____________________________________\n&gt; &gt; From: Adriana Jones  &lt;adrianamjones@&gt;\n&gt; &gt; To: _EVP-ITC@yahoogroups.com_ (mailto:EVP-ITC@yahoogroups.com) \n&gt; &gt;  Sent: Sun, October 17, 2010 9:08:01 AM\n&gt; &gt; Subject: [EVP-ITC] A slew of  &quot;no&quot;&#39;s\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; When my husband asked whether or not  reincarnation is real, he was met \n&gt; with \n&gt; &gt; a slew of &quot;no&quot;&#39;s. We know  better than to believe anything they say one \n&gt; way \n&gt; &gt; or the other, but we  do recognize that this is excellent proof of \n&gt; &gt; intelligent  communication... how often do you scan the dial and get like \n&gt; five or \n&gt; &gt;  six &quot;no&quot;&#39;s this close together?\n&gt; &gt; \n&gt; &gt; See &quot;reincar-no&quot; file in my  folder &quot;Adriana&#39;s files&quot; in the files \n&gt; section.\n&gt; &gt;\n&gt;"}