{"id": "19026", "subject": "Re: [EVP-ITC] This one speaks for itself...", "author": "Zack Widup", "timestamp": "2010-10-18T14:49:08Z", "full_text": "It&#39;s spelled &quot;urchin&quot; and it&#39;s a term you hardly ever see used anymore. It\nmeans &quot;a street child&quot; and was sometimes used as a term of affection.\n\nI once asked &quot;Do you want us to leave?&quot; on an investigation and got a\nresponse &quot;You just got here.&quot;\n:-)\n\nZack\n\n\nOn Mon, Oct 18, 2010 at 9:44 AM, Adriana Jones &lt;adrianamjones@...&gt;wrote:\n\n&gt;\n&gt;\n&gt; See endoffilewow.mp3 in my files folder. This was the very end of the\n&gt; session my husband and I did at night in Charles Town, WV cemetery, on\n&gt; October 15.\n&gt;\n&gt; Notice:\n&gt; A man whose voice persists through several seconds of the file saying...\n&gt; &quot;you...too...erchin...wonderful&quot; what the heck is erchin, lol! Here you\n&gt; should also notice that between &quot;erchin&quot; and &quot;wonderful&quot; there is a definite\n&gt; station change &quot;whine&quot; sound...\n&gt;\n&gt; Then you may also notice when I ask &quot;Should we come back ever?&quot; A lady\n&gt; says, &quot;Ever?&quot; or &quot;Never&quot; can tell which....\n&gt;\n&gt; We&#39;re getting some pretty convincing stuff for having been doing less than\n&gt; a month.\n&gt;\n&gt;  \n&gt;\n\nI 's spelled \"u chin\" and i 's a e m you ha dly e e see used anymo e. I means \"a s ee child\" and was some imes used as a e m o a ec ion.I once asked \"Do you wan us o lea e?\" on an in es iga ion and go a esponse \"You jus go he e.\"\n:-)ZackOn Mon, Oc 18, 2010 a 9:44 AM, Ad iana Jones ad ianamjones@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n See endo ilewow.mp3 in my iles olde . This was he e y end o he session my husband and I did a nigh in Cha les Town, WV ceme e y, on Oc obe 15.\n\nNo ice:\nA man whose oice pe sis s h ough se e al seconds o he ile saying... \"you... oo...e chin...wonde ul\" wha he heck is e chin, lol! He e you should also no ice ha be ween \"e chin\" and \"wonde ul\" he e is a de ini e s a ion change \"whine\" sound...\n\n\nThen you may also no ice when I ask \"Should we come back e e ?\" A lady says, \"E e ?\" o \"Ne e \" can ell which....\n\nWe' e ge ing some p e y con incing s u o ha ing been doing less han a mon h."}