{"id": "19021", "subject": "Re: A slew of &quot;no&quot;&#39;s", "author": "Adriana Jones", "timestamp": "2010-10-18T12:40:01Z", "full_text": "Paige, I hold the same views as you do on God and religion.  I believe in God, but it&#39;s not so much a matter of faith, as it is of observation (of nature and life and myself and others) that has brought me to the conclusion of the existence of a higher power, for example the fact that despite everything, people still thrive best when loved,and when they love... and find it oppressive and insulting in the end, for an institution to ask you to remain in its clutches if you have outgrown it.  It&#39;s like a parent that is possessive and does not want their children to gain independence, for fear of losing them. It is selfish.  Why have to walk slowly in my walk with God by retaining my religion, when I am already speeding toward God, independently of religion?    \n\n--- In EVP-ITC@yahoogroups.com, Paige Chavez &lt;magnolia.massage@...&gt; wrote:\n&gt;\n&gt; I agree 100% with you SF...we are just beginning to emerge from institutionalized religion and leaning toward independent thinking, as a planet. Years of the &quot;powers that be&quot; grasping for ultimate control disguised as organized religion has made human beings afraid of free thinking. The beautiful part about the paranormal movement and related theories on the afterlife is that we can now use scientific instruments to legitimize what we believe. I, for one, believe in God, or a supreme being and intelligent design.....just not the way I was instructed to believe. It&#39;s quite comforting to be able to discuss this way of life (and death) with people of the same convictions. Im thankful for all of you guys.....even the skeptics that keep us on our toes.\n&gt; \n&gt; --- On Sun, 10/17/10, SnowfireL@... &lt;SnowfireL@...&gt; wrote:\n&gt; \n&gt; \n&gt; From: SnowfireL@... &lt;SnowfireL@...&gt;\n&gt; Subject: Re: [EVP-ITC] A slew of &quot;no&quot;&#39;s\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Sunday, October 17, 2010, 12:11 PM\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; DEJ&#39; EVUES, are cellular memory of our loved ones, or guides memory&#39;s while on earth when they lived, this universe is far to vast a place for souls to return here over and over again, makes no sense really. 16 people could have been related to Cleopatra through cell memory, but they all cannot have been her. When ones hears about the &quot;long, long line&quot; going from darkness into the light for all those who may have thought they were going to reincarnate, to buy Heaven know differently now. There is a such thing as &quot;incarnation&quot; but that is far different from reincarnation. Difference is: with R, they try to buy the way into Heaven, with In, they are already coming from Heaven down to help on this side for a purpose, not to try to earn brownie points to get into Heaven, they come here to attach with other spirits in the body to aid in some way, or for a Divine purpose. sf\n&gt; \n&gt; \n&gt; In a message dated 10/17/2010 12:58:16 P.M. Eastern Standard Time, rickwegrzyn@... writes:\n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; I believe in the reincarnation thing cause I&#39;ve had to many DEJ&#39; EVUES how ever u spell it..lol..done alot of traveling and seem to know whats coming down the road before we get there.....That recorder your husband uses,is it digital....\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; From: Adriana Jones &lt;adrianamjones@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Sun, October 17, 2010 9:08:01 AM\n&gt; Subject: [EVP-ITC] A slew of &quot;no&quot;&#39;s\n&gt; \n&gt;  \n&gt; \n&gt; When my husband asked whether or not reincarnation is real, he was met with a slew of &quot;no&quot;&#39;s. We know better than to believe anything they say one way or the other, but we do recognize that this is excellent proof of intelligent communication... how often do you scan the dial and get like five or six &quot;no&quot;&#39;s this close together?\n&gt; \n&gt; See &quot;reincar-no&quot; file in my folder &quot;Adriana&#39;s files&quot; in the files section.\n&gt;"}