{"id": "19035", "subject": "Re: [EVP-ITC] Re: [RTSC] Is random as good/better?", "author": "Frank Sumption", "timestamp": "2010-10-19T06:03:10Z", "full_text": "The Sony Headphone, the same one from 2009, the one that says &quot;.......earth\nis doomed&quot; at the end. It&#39;s also the only Sony headphone radio I&#39;ve ever\nfound.  I don&#39;t know why, but after that I couldn&#39;t get it to sweep, and now\nit works.\n\n These things almost seem to have a mind of their own, I was having trouble\nwith the sound distortion in 86 and thought it was a bad tuner so I replaced\nit. I needed a part and was going to rob it off the tuner from 86, and I\ncould not hold on to that board, it seemed to almost jump out of my hand. I\ngot the message and reused that tuner in 86, and it turned out to be a power\nproblem, not the tuner.\n\n F-S\n\nOn Mon, Oct 18, 2010 at 11:33 PM, Snowfire Lioness &lt;SnowfireL@...&gt;wrote:\n\n&gt;\n&gt;\n&gt;\n&gt; This is a good clear radio Frank, what kind is it?  They are very clear, sf\n&gt;\n&gt; -----Original Message-----\n&gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com; RTSC@yahoogroups.com\n&gt; Sent: Tue, Oct 19, 2010 1:08 am\n&gt; Subject: [RTSC] Is random as good/better? [1 Attachment]\n&gt;\n&gt;\n&gt;  [Attachment(s)&lt;https://mail.google.com/mail/?ui=2&view=js&name=main,tlist&ver=QQYA_sWazoU.en.&am=!ejB6U8yloC-xhZ4i_uQ2UUqOwynYk0K4yIkvT7HOoZcgwz-VuAyO&fri#12bc2fad5ae2c4b6_TopText&gt;from Frank Sumption included below]\n&gt; Random sweep, at 3 seconds &quot;Hultay keeps getting an awful love&quot;, I don&#39;t\n&gt; know what it means, but it seems clearer than usual.  I&#39;ve noticed this with\n&gt; random, if and when it works, that the phrases are more connected and\n&gt; longer, and radio broadcasts tend to disappear.  they also talk about Hultay\n&gt; often.\n&gt;\n&gt;  F-S\n&gt;\n&gt; \n&gt;\n\nThe Sony Headphone, he same one om 2009, he one ha says \".......ea h is doomed\" a he end. I 's also he only Sony headphone adio I' e e e ound.  I don' know why, bu a e ha I couldn' ge i o sweep, and now i wo ks. \n\n \n These hings almos seem o ha e a mind o hei own, I was ha ing ouble wi h he sound dis o ion in 86 and hough i was a bad une so I eplaced i . I needed a pa and was going o ob i o he une om 86, and I could no hold on o ha boa d, i seemed o almos jump ou o my hand. I go he message and eused ha une in 86, and i u ned ou o be a powe p oblem, no he une .\n\n \n F-S\nOn Mon, Oc 18, 2010 a 11:33 PM, Snow i e Lioness Snow i eL@aol.com> w o e:\n\n  \n\n\n\n\n\nThis is a good clea adio F ank, wha kind is i ?  They a e e y clea , s \n\n\n\n-----O iginal Message-----F om: F ank Sump ion pu plealiengi l@...>To: EVP-ITC@yahoog oups.com; RTSC@yahoog oups.com\nSen : Tue, Oc 19, 2010 1:08 amSubjec : [RTSC] Is andom as good/be e ? [1 A achmen ]\n\n  \n\n\n[A achmen (s) om F ank Sump ion included below] \n\nRandom sweep, a 3 seconds \"Hul ay keeps ge ing an aw ul lo e\", I don' know wha i means, bu i seems clea e han usual.  I' e no iced his wi h andom, i and when i wo ks, ha he ph ases a e mo e connec ed and longe , and adio b oadcas s end o disappea .  hey also alk abou Hul ay o en.\n\n \n F-S"}