{"id": "19046", "subject": "Re: [EVP-ITC] More randomnesses.", "author": "Frank Sumption", "timestamp": "2010-10-21T22:15:17Z", "full_text": "I don&#39;t know why random is clearer, unless they have the raw audio, but\ndon&#39;t have it on continuously so it interference with their speech(?) Back\nwhen I first started and there was sunspots the voices were amazingly clear.\n\n\n F-S\n\nOn Thu, Oct 21, 2010 at 4:10 PM, Tim Woolworth &lt;tjwoolworth@gmail.com&gt;wrote:\n\n&gt;\n&gt;\n&gt; When I use my Minibox Pluses and I strictly use a random jump setting on\n&gt; them because it always gives me startlingly clear communications.  When  I\n&gt; use the Joe&#39;s Box, it is strictly linear and provides the same amount of\n&gt; communication, just not as clearly.\n&gt;\n&gt; Do you have any opinions on why you think random works better with your\n&gt; boxes?\n&gt;\n&gt; I hear the first two messages. For the message at .11, I could not make out\n&gt; the first part but the second part sounds like &quot;Fuck the people,&quot; not &quot;for\n&gt; the people.&quot;  I did not hear anything in the last one.\n&gt;\n&gt; Tim\n&gt;\n&gt; On Thu, Oct 21, 2010 at 2:42 PM, Frank Sumption &lt;purplealiengirl@...\n&gt; &gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;  [Attachment(s)&lt;https://mail.google.com/mail/?ui=2&view=js&name=main,tlist&ver=QQYA_sWazoU.en.&am=!ejB6U8yloC-xhZ4i_uQ2UUqOwynYk0K4yIkvT7HOoZcgwz-VuAyO&fri#12bd0d7c5d8c0f24_12bd01965ee51323_TopText&gt;from Frank Sumption included below]\n&gt;&gt;\n&gt;&gt;  I send this type of box out and invariably I hear back &quot;that doesn&#39;t\n&gt;&gt; work!&quot; This is single supply random mode, seems to work here! Starts out\n&gt;&gt; &quot;--be good&quot;, at 4 seconds &quot;This is to calm Chris down&quot;, at 11 seconds &quot;this\n&gt;&gt; is recorded for the people&quot;, and at the end &quot;the girl is seventeen&quot; --I get\n&gt;&gt; that alot, and I don&#39;t why it is important. &quot;They&quot; claim the &quot;princess&quot; was\n&gt;&gt; kidnapped, it&#39;s the one thing I do remember, and at the same age she was,\n&gt;&gt; 17,  I actually relived the event, so maybe it&#39;s for validation. I don&#39;t\n&gt;&gt; believe in living in the past,  reliving past traumas, or grieving.\n&gt;&gt;  I don&#39;t know, I&#39;m still uncertain if random has an advantage, the\n&gt;&gt; messages seem longer and in a more natural sounding voice.\n&gt;&gt;\n&gt;&gt;  Single supply random takes some finessing to make it work, so I prefer to\n&gt;&gt; use dual supplies. + and - 12 volts.===more batteries==more $$$ to operate.\n&gt;&gt;\n&gt;&gt;  F-S\n&gt;&gt;\n&gt;&gt;\n&gt;  \n&gt;\n\nI don' know why andom is clea e , unless hey ha e he aw audio, bu don' ha e i on con inuously so i in e e ence wi h hei speech(?) Back when I i s s a ed and he e was sunspo s he oices we e amazingly clea . \n\n \n F-S\nOn Thu, Oc 21, 2010 a 4:10 PM, Tim Woolwo h jwoolwo h@...> w o e:\n\n  \n\n\n\nWhen I use my Minibox Pluses and I s ic ly use a andom jump se ing on hem because i always gi es me s a lingly clea communica ions.  When  I use he Joe's Box, i is s ic ly linea and p o ides he same amoun o communica ion, jus no as clea ly.   \n\nDo you ha e any opinions on why you hink andom wo ks be e wi h you boxes? \n\nI hea he i s wo messages. Fo he message a .11, I could no make ou he i s pa bu he second pa sounds like \"Fuck he people,\" no \" o he people.\"  I did no hea any hing in he las one.\n\n\nTim\n\nOn Thu, Oc 21, 2010 a 2:42 PM, F ank Sump ion pu plealiengi l@...> w o e:\n\n  \n\n\n[A achmen (s) om F ank Sump ion included below] \n\n\n\n\n I send his ype o box ou and in a iably I hea back \" ha doesn' wo k!\" This is single supply andom mode, seems o wo k he e! S a s ou \"--be good\", a 4 seconds \"This is o calm Ch is down\", a 11 seconds \" his is eco ded o he people\", and a he end \" he gi l is se en een\" --I ge ha alo , and I don' why i is impo an . \"They\" claim he \"p incess\" was kidnapped, i 's he one hing I do emembe , and a he same age she was, 17,  I ac ually eli ed he e en , so maybe i 's o alida ion. I don' belie e in li ing in he pas ,  eli ing pas aumas, o g ie ing.  \n\n I don' know, I'm s ill unce ain i andom has an ad an age, he messages seem longe and in a mo e na u al sounding oice. \n \n Single supply andom akes some inessing o make i wo k, so I p e e o use dual supplies. + and - 12 ol s.===mo e ba e ies==mo e $$$ o ope a e.\n \n F-S"}