{"id": "19062", "subject": "Re: [EVP-ITC] Real Time EVP Recorder", "author": "Tim Woolworth", "timestamp": "2010-10-23T13:35:50Z", "full_text": "I haven&#39;t used it yet, but I am going to a conference next weekend where the\nmaker of the device (Gary Galka) is allowing the attendees to use it on an\ninvestigation.  If you don&#39;t find out any info from anyone else, I&#39;ll gladly\nlet you know next Monday if it is worth the money if you put up a reminder\npost.  I have been an investigator for years and have had my eye on this\npiece but I haven&#39;t been able to justify purchasing it yet.  I am eager to\nknow if it is worth it myself!\n\nTim\n\nOn Sat, Oct 23, 2010 at 9:26 AM, Michael Ed &lt;f1cracker75@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Has anyone in the goup used this Real Time EVP device, and if yes, is it\n&gt; worth buying?\n&gt;\n&gt; http://unknownmagazine.com/cubecart/Equipment/Digital-Recorders/RT-EVP-Interactive-Digital-Voice-Recorder/prod_1336.html\n&gt;\n&gt; **\n&gt; **\n&gt; Michael Edwards\n&gt;\n&gt; The Worldwide Radio Sweep EVP Alliance\n&gt; http://www.facebook.com/group.php?gid=102193593178906\n&gt;\n&gt;\n&gt; **\n&gt; **\n&gt;\n&gt;  \n&gt;\n\nI ha en' used i ye , bu I am going o a con e ence nex weekend whe e he make o he de ice (Ga y Galka) is allowing he a endees o use i on an in es iga ion.  I you don' ind ou any in o om anyone else, I'll gladly le you know nex Monday i i is wo h he money i you pu up a eminde pos .  I ha e been an in es iga o o yea s and ha e had my eye on his piece bu I ha en' been able o jus i y pu chasing i ye .  I am eage o know i i is wo h i mysel !\nTimOn Sa , Oc 23, 2010 a 9:26 AM, Michael Ed 1c acke 75@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n Has anyone in he goup used his Real Time EVP de ice, and i yes, is i wo h buying?\nh p://unknownmagazine.com/cubeca /Equipmen /Digi al-Reco de s/RT-EVP-In e ac i e-Digi al-Voice-Reco de /p od_1336.h ml \n\n \n  \nMichael Edwa ds\n The Wo ldwide Radio Sweep EVP Alliance\nh p://www. acebook.com/g oup.php?gid=102193593178906"}