{"id": "19060", "subject": "Re: [EVP-ITC] They answer--sorta.", "author": "Frank Sumption", "timestamp": "2010-10-23T03:01:30Z", "full_text": "I don&#39;t know, I only heard about it on C2C.\n\nF-S\n\nOn Fri, Oct 22, 2010 at 2:08 AM, Tim Woolworth &lt;tjwoolworth@...&gt;wrote:\n\n&gt;\n&gt;\n&gt; Is that China story true?  I read about that a week or so ago but hadn&#39;t\n&gt; heard anything about it since.  Nice piece of audio by the way, they say\n&gt; &quot;Down&quot; twice and sing it once.  What are the chances of getting that word\n&gt; three times in a row?\n&gt;\n&gt; Tim\n&gt;\n&gt; On Fri, Oct 22, 2010 at 3:17 AM, Frank Sumption &lt;purplealiengirl@...\n&gt; &gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;  [Attachment(s)&lt;https://mail.google.com/mail/?ui=2&view=js&name=main,tlist&ver=vDkaykVSG9w.en.&am=!yGvcqUNUUxexhZ5ijtQ2ZMKIZroesisZtoKH5kognAihF0mgsh4P&fri#12bd2fbb14e51c50_12bd2cc6721f073a_TopText&gt;from Frank Sumption included below]\n&gt;&gt;\n&gt;&gt;  On C2C the other night Noory mentioned a town in China that seemingly\n&gt;&gt; disappeared,  I was asking what happend to it, and in this video at 4\n&gt;&gt; seconds &quot;the town went down&quot;. this is random mode. That&#39;s the problem, I\n&gt;&gt; hear this stuff different all the time, and which hearing is the correct\n&gt;&gt; one, or is there a correct one?\n&gt;&gt;\n&gt;&gt;  At 11 seconds &quot;what is the Earth--What is doom&quot; wierd., and &quot;German\n&gt;&gt; hostage&quot; at the end.\n&gt;&gt;\n&gt;&gt;  This one going to Rolling Hills too.\n&gt;&gt;\n&gt;&gt;  F-S\n&gt;&gt;\n&gt;&gt;\n&gt;  \n&gt;\n\nI don' know, I only hea d abou i on C2C.\n \nF-S\nOn F i, Oc 22, 2010 a 2:08 AM, Tim Woolwo h jwoolwo h@...> w o e:\n\n  \n\n\n\nIs ha China s o y ue?  I ead abou ha a week o so ago bu hadn' hea d any hing abou i since.  Nice piece o audio by he way, hey say \"Down\" wice and sing i once.  Wha a e he chances o ge ing ha wo d h ee imes in a ow? \n\nTim\nOn F i, Oc 22, 2010 a 3:17 AM, F ank Sump ion pu plealiengi l@...> w o e:\n\n  \n\n\n[A achmen (s) om F ank Sump ion included below] \n\n\n\n\n On C2C he o he nigh Noo y men ioned a own in China ha seemingly disappea ed,  I was asking wha happend o i , and in his ideo a 4 seconds \" he own wen down\". his is andom mode. Tha 's he p oblem, I hea his s u di e en all he ime, and which hea ing is he co ec one, o is he e a co ec one?\n\n \n A 11 seconds \"wha is he Ea h--Wha is doom\" wie d., and \"Ge man hos age\" a he end.\n \n This one going o Rolling Hills oo. \n \n F-S"}