{"id": "19077", "subject": "Re: [EVP-ITC] Starting a session [1 Attachment]", "author": "Frank Sumption", "timestamp": "2010-10-24T18:49:16Z", "full_text": "Even when doing the test videos, I just announce out loud I&#39;m doing an EVP\nrecording. Even with these it&#39;s like they are right there and ready. There\nseems to be some, or a group that actually transmit something, and\nparticipants stand in front of, or use a mic of somekind. When I first\nstarted, box #1, &quot;they&quot; had Lincoln, and were showing him how to use the\nmic. Chicken skin just thinking about it!\n\n Like this one, starts out &quot;you don&#39;t believe&quot; sung, I think it&#39;s a\nremodulated song from Radio Disney. I try to explain to them, I look in a\nmirror, and that ain&#39;t alien Princess looking back! It&#39;s a difficult\nconcept. This was manual sweep with a minimal &quot;box&quot;.\n\n\n\n Frank-S\n\nOn Sun, Oct 24, 2010 at 8:33 AM, Mvanah Maloti &lt;inyanga4@...&gt; wrote:\n\n&gt;\n&gt;  [Attachment(s)&lt;https://mail.google.com/mail/?ui=2&view=js&name=main,tlist&ver=vDkaykVSG9w.en.&am=!yGvcqUNUUxexhZ5ijtQ2ZMKIZroesisZtoKH5kognAihF0mgsh4P&fri#12bdea83ffbe09fe_TopText&gt;from Mvanah Maloti included below]\n&gt;\n&gt;   Tim,\n&gt;\n&gt; I experience something similar on a regular basis.\n&gt;\n&gt; My &quot;crew&quot; usually begins immediately (sometimes less than 20 or 30 seconds\n&gt; and often as soon as the box is turned on) with my name and the words *\n&gt; &quot;START&quot;,* *&quot;Here&quot;* or *&quot;Hello&quot;* to show me that we&#39;ve made proper contact\n&gt; and the connection is clear.\n&gt;\n&gt; The sessions typically end in much the same way with a loud* &quot;STOP!&quot;* or *\n&gt; &quot;end&quot;* to signal that we&#39;re finished.\n&gt;\n&gt; I&#39;ve attached an example of my own and thank you for sharing!\n&gt;\n&gt; It&#39;s incredibly interesting to read about and hear the communication\n&gt; &quot;systems&quot; employed by other researchers.\n&gt;\n&gt; -Jerome\n&gt; \n&gt;\n\nE en when doing he es ideos, I jus announce ou loud I'm doing an EVP eco ding. E en wi h hese i 's like hey a e igh he e and eady. The e seems o be some, o a g oup ha ac ually ansmi some hing, and pa icipan s s and in on o , o use a mic o somekind. When I i s s a ed, box #1, \" hey\" had Lincoln, and we e showing him how o use he mic. Chicken skin jus hinking abou i !\n\n \n Like his one, s a s ou \"you don' belie e\" sung, I hink i 's a emodula ed song om Radio Disney. I y o explain o hem, I look in a mi o , and ha ain' alien P incess looking back! I 's a di icul concep . This was manual sweep wi h a minimal \"box\". \n\n \n \n \n F ank-S\nOn Sun, Oc 24, 2010 a 8:33 AM, M anah Malo i inyanga4@...> w o e:\n\n  \n\n\n[A achmen (s) om M anah Malo i included below] \n\n\n\n\n\nTim, \n \nI expe ience some hing simila on a egula basis. \n \nMy \"c ew\" usually begins immedia ely (some imes less han 20 o 30 seconds and o en as soon as he box is u ned on) wi h my name and he wo ds \"START\", \"He e\" o \"Hello\" o show me ha we' e made p ope con ac and he connec ion is clea . \n\n \nThe sessions  ypically end in much he same way wi h a loud \"STOP!\" o \"end\" o signal ha we' e inished.  \n \nI' e a ached an example o my own and hank you o sha ing! \n \nI 's inc edibly in e es ing o  ead abou and hea   he communica ion \"sys ems\" employed by o he esea che s. \n \n-Je ome"}