{"id": "19079", "subject": "Re: [EVP-ITC] Starting a session [1 Attachment]", "author": "Tim Woolworth", "timestamp": "2010-10-24T22:37:05Z", "full_text": "Jerome,\n\nI like how your crew sounds is more personal than mine when they let you\nknow they are ready to start.  Your sample, &quot;Hello, people are here&quot; is a\nnice example.  My &quot;Now&quot; guy sounds very brusque but I have become used to\nhim.  Interestingly, I have never had anyone from the other side tell me\nwhen a session is over.  I always have to end the session or they would\ncontinue talking to me forever.  About 70% of the time when I try to end a\nsession I get a very clear &quot;wait&quot; because they have something else to say.\n\nTim\n\nOn Sun, Oct 24, 2010 at 10:33 AM, Mvanah Maloti &lt;inyanga4@...&gt; wrote:\n\n&gt;\n&gt;  [Attachment(s) &lt;#12be06097b30e225_12bdea8407c86657_TopText&gt; from Mvanah\n&gt; Maloti included below]\n&gt;\n&gt; Tim,\n&gt;\n&gt; I experience something similar on a regular basis.\n&gt;\n&gt; My &quot;crew&quot; usually begins immediately (sometimes less than 20 or 30 seconds\n&gt; and often as soon as the box is turned on) with my name and the words *\n&gt; &quot;START&quot;,* *&quot;Here&quot;* or *&quot;Hello&quot;* to show me that we&#39;ve made proper contact\n&gt; and the connection is clear.\n&gt;\n&gt; The sessions typically end in much the same way with a loud* &quot;STOP!&quot;* or *\n&gt; &quot;end&quot;* to signal that we&#39;re finished.\n&gt;\n&gt; I&#39;ve attached an example of my own and thank you for sharing!\n&gt;\n&gt; It&#39;s incredibly interesting to read about and hear the communication\n&gt; &quot;systems&quot; employed by other researchers.\n&gt;\n&gt; -Jerome\n&gt;  \n&gt;\n\nJe ome,I like how you c ew sounds is mo e pe sonal han mine when hey le you know hey a e eady o s a .  You sample, \"Hello, people a e he e\" is a nice example.  My \"Now\" guy sounds e y b usque bu I ha e become used o him.  In e es ingly, I ha e ne e had anyone om he o he side ell me when a session is o e .  I always ha e o end he session o hey would con inue alking o me o e e .  Abou 70% o he ime when I y o end a session I ge a e y clea \"wai \" because hey ha e some hing else o say.\nTim\nOn Sun, Oc 24, 2010 a 10:33 AM, M anah Malo i inyanga4@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n [A achmen (s) om M anah Malo i included below]\n \n \n Tim, \n \nI expe ience some hing simila on a egula basis. \n \nMy \"c ew\" usually begins immedia ely (some imes less han 20 o 30 seconds and o en as soon as he box is u ned on) wi h my name and he wo ds \"START\", \"He e\" o \"Hello\" o show me ha we' e made p ope con ac and he connec ion is clea . \n\n\n \nThe sessions  ypically end in much he same way wi h a loud \"STOP!\" o \"end\" o signal ha we' e inished.  \n \nI' e a ached an example o my own and hank you o sha ing! \n \nI 's inc edibly in e es ing o  ead abou and hea   he communica ion \"sys ems\" employed by o he esea che s. \n \n-Je ome"}