{"id": "19081", "subject": "Re: [EVP-ITC] The wee hours of the morning. [5 Attachments]", "author": "Tim Woolworth", "timestamp": "2010-10-24T23:00:43Z", "full_text": "I did not hear anything in the last three of these clips.  But, the first\none had some great communication.  I did not hear what you heard, but the\nfollowing was quite clear to me:\n\n.06 receive you\n.07 we&#39;re going home, home, home\n.09 Forgive us (followed by two unclear words)\n\nBut we all hear this stuff different because of differences in speakers and\nears.\n\nTim\n\n\nOn Sun, Oct 24, 2010 at 4:41 AM, Frank Sumption\n&lt;purplealiengirl@...&gt;wrote:\n\n&gt;\n&gt;  [Attachment(s) &lt;#12bdd677873a4a36_TopText&gt; from Frank Sumption included\n&gt; below]\n&gt;\n&gt;  While waitng for glue and varnish to dry on the box I was working, went to\n&gt; Good Will and found this tuner, a Toyota with not tape deck or CD player.\n&gt; The thing wouldn&#39;t turn on so I could get he pin out form measuring\n&gt; voltages, but I had the pin out for the AM tuner in my notes from 2006, so\n&gt; that is waht&#39;s use here. I wanted to make the smallest possible dual supply\n&gt; random sweep box that I could. Dual supply cuz random doens&#39;t work so great\n&gt; on sinlge supply and single supply requires more parts, even for linear\n&gt; sweep.\n&gt;\n&gt;  I tuned the radio between statiosn cuz this tuner is sensitive enough to\n&gt; get distant AM stations even in my garage. You can use AM skip as the raw\n&gt; audio. On the first one at 2 seconds &quot;we&#39;re talklin&#39; to Frank&quot;, at 4 seconds\n&gt; &quot; I saw Frankie(my son) with you&quot; and at the end &quot;Frank Believe&quot;. In the\n&gt; second on at 3 seconds &quot;f--you purple&quot;, and at 13 seconds &quot;we&#39;ve go to end\n&gt; with Bruce&quot;.\n&gt;\n&gt;  F-S\n&gt;\n&gt;  \n&gt;\n\nI did no hea any hing in he las h ee o hese clips.  Bu , he i s one had some g ea communica ion.  I did no hea wha you hea d, bu he ollowing was qui e clea o me:.06 ecei e you\n.07 we' e going home, home, home.09 Fo gi e us ( ollowed by wo unclea wo ds)Bu we all hea his s u di e en because o di e ences in speake s and ea s.\nTimOn Sun, Oc 24, 2010 a 4:41 AM, F ank Sump ion pu plealiengi l@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n [A achmen (s) om F ank Sump ion included below]\n \n \n  While wai ng o glue and a nish o d y on he box I was wo king, wen o Good Will and ound his une , a Toyo a wi h no ape deck o CD playe .  The hing wouldn' u n on so I could ge he pin ou o m measu ing ol ages, bu I had he pin ou o   he AM une in my no es om 2006, so ha is wah 's use he e. I wan ed o make he smalles possible dual supply andom sweep box ha I could. Dual supply cuz andom doens' wo k so g ea on sinlge supply and single supply equi es mo e pa s, e en o linea sweep. \n\n\n \n I uned he adio be ween s a iosn cuz his une is sensi i e enough o ge dis an AM s a ions e en in my ga age. You can use AM skip as he aw audio. On he i s one a 2 seconds \"we' e alklin' o F ank\", a 4 seconds \" I saw F ankie(my son) wi h you\" and a he end \"F ank Belie e\". In he second on a 3 seconds \" --you pu ple\", and a 13 seconds \"we' e go o end wi h B uce\".\n\n\n \n F-S"}