{"id": "19095", "subject": "Re: [EVP-ITC] Re: [RTSC] RT-EVP", "author": "Tim Woolworth", "timestamp": "2010-10-25T19:31:23Z", "full_text": "Jerome,\n\nI love this:\n\n&quot;I feel it&#39;s at least a *3 PART* dynamic and one which exists between the\ndevice itself, the operator and those on the other side.&quot;\n\nVery succinct and from my experience I find it to be quite true.  For me,\nthe most uncontrollable aspect of this dynamic is the device itself.  I use\nMinibox Pluses and a Joe&#39;s Box because they work for me.  But, if you put a\nShack Hack in my hands, it works but not nearly as well.  Others experience\namazing results with Shack hacks.  I was experimenting with a Shack Hack\nabout a month back and the communication wasn&#39;t clear enough but I got the\ngist of what they were saying.  I asked them to hold on while I switched\nboxes and the conversation continued with the same guy from the other side.\n The conversations and communicators are there, always.  This is why I put a\npremium on the equipment being used because I know that I already have a\nconnection with the other side that can be facilitated on any box designed\nto do so, but only a few boxes have worked to my personal satisfaction so\nfar.\n\nTim\n\nOn Mon, Oct 25, 2010 at 3:04 PM, Mvanah Maloti &lt;inyanga4@yahoo.com&gt; wrote:\n\n&gt;\n&gt;\n&gt; *CB* brings up a great point in that each user has their own input and\n&gt; individual &quot;key&quot; regarding how well a certain device is going to work for\n&gt; them. I think the same holds true for the impetus, energy and intelligence\n&gt; behind the GB phenomenon...certainly &quot;they&quot; have just as much to do with it\n&gt; as &quot;we&quot; do...(perhaps even more so!).\n&gt;\n&gt; I feel it&#39;s at least a *3 PART* dynamic and one which exists between the\n&gt; device itself, the operator and those on the other side.\n&gt;\n&gt; I&#39;m in agreement that what works best for one might be horrible for another\n&gt; (& vice versa) and this is something we could all do well to keep in mind -\n&gt; perhaps especially myself as I&#39;ve been quite harsh with a few devices in the\n&gt; past and my own opinion and experience with them is the furthest thing from\n&gt; the &quot;holy work&quot; or final word on the subject. Like everyone else here I\n&gt; experiment, conduct my sessions, record my work and file my research in\n&gt; effort to find what works best FOR ME and garners the greatest results.\n&gt;\n&gt; Part of what makes this field, our individual work and collective efforts\n&gt; so exciting and progressive is that each researcher brings their own\n&gt; unique approach and combined experience to the table. I don&#39;t think ITC\n&gt; research would ever grow or progress if everyone used the same devices or\n&gt; recorded their sessions in the same way, naturally.\n&gt;\n&gt; That said, if you&#39;re still interested in testing and experimenting\n&gt; with this device to see if you like it or not, Michael, I&#39;d be happy to send\n&gt; you mine to experiment with if you&#39;re open to paying for postage and return\n&gt; shipping. I&#39;d rather see the devices in my care and the equipment I&#39;ve\n&gt; invested in be actively used or sold or at least scrapped for parts to\n&gt; create other devices when and where possible. Practically any ITC device can\n&gt; get some kind of results and who knows? Perhaps the *RT-EVP* will work\n&gt; better for you than it has for me...you might even fall in love with it and\n&gt; be able to show me all the things I&#39;ve missed!\n&gt;\n&gt; Best,\n&gt; Jerome\n&gt;\n&gt;\n&gt;\n&gt;  \n&gt;\n\nJe ome,I lo e his: \"I eel i 's a leas a 3 PART dynamic and one which exis s be ween he de ice i sel , he ope a o and hose on he o he side.\"\nVe y succinc and om my expe ience I ind i o be qui e ue.  Fo me, he mos uncon ollable aspec o his dynamic is he de ice i sel .  I use Minibox Pluses and a Joe's Box because hey wo k o me.  Bu , i you pu a Shack Hack in my hands, i wo ks bu no nea ly as well.  O he s expe ience amazing esul s wi h Shack hacks.  I was expe imen ing wi h a Shack Hack abou a mon h back and he communica ion wasn' clea enough bu I go he gis o wha hey we e saying.  I asked hem o hold on while I swi ched boxes and he con e sa ion con inued wi h he same guy om he o he side.  The con e sa ions and communica o s a e he e, always.  This is why I pu a p emium on he equipmen being used because I know ha I al eady ha e a connec ion wi h he o he side ha can be acili a ed on any box designed o do so, bu only a ew boxes ha e wo ked o my pe sonal sa is ac ion so a .\nTimOn Mon, Oc 25, 2010 a 3:04 PM, M anah Malo i inyanga4@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n CB b ings up a g ea poin in ha each use has hei own inpu and indi idual \"key\" ega ding how well a ce ain de ice is going o wo k o hem. I hink he same holds ue o he impe us, ene gy and in elligence behind he GB phenomenon...ce ainly \" hey\" ha e jus as much o do wi h i as \"we\" do...(pe haps e en mo e so!). \n\n \nI eel i 's a leas a 3 PART dynamic and one which exis s be ween he de ice i sel , he ope a o and hose on he o he side. \n \nI'm in ag eemen ha wha wo ks bes o one migh be ho ible  o ano he (& ice e sa) and his is some hing we could all do well o keep in mind - pe haps especially mysel as I' e been qui e ha sh wi h a ew de ices in he pas and my own opinion and expe ience wi h hem is he u hes hing om he \"holy wo k\" o inal wo d on he subjec . Like e e yone else he e I expe imen , conduc my sessions, eco d my wo k and ile my esea ch in e o o ind wha wo ks bes FOR ME and ga ne s he g ea es esul s. \n\n \nPa o wha makes his ield, ou indi idual wo k and collec i e e o s so exci ing and p og essi e is ha each esea che b ings hei own unique app oach and combined expe ience o he able. I don' hink ITC esea ch would e e g ow o p og ess i e e yone used he same de ices o eco ded hei sessions in he same way, na u ally. \n\n \nTha said, i you' e s ill in e es ed in es ing and expe imen ing wi h  his de ice o see i you like i o no , Michael, I'd be happy o send you mine o expe imen wi h i you' e open  o paying o pos age and e u n shipping. I'd a he see he de ices in my ca e and he equipmen I' e in es ed in be ac i ely used o sold o a leas sc apped o pa s o c ea e o he de ices when and whe e possible. P ac ically any ITC de ice can ge some kind o esul s and who knows? Pe haps he RT-EVP will wo k be e o you han i has o me...you migh e en all in lo e wi h i and be able o show me all he  hings I' e missed!  \n\n \nBes , \nJe ome"}