{"id": "19093", "subject": "Re: [EVP-ITC] Re: [RTSC] RT-EVP", "author": "Mvanah Maloti", "timestamp": "2010-10-25T19:04:18Z", "full_text": "--0-2082433186-1288033458=:7289\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nCB brings up a great point in that each user has their own input and indivi=\r\ndual &quot;key&quot; regarding how well a certain device is going to work for them. I=\r\n think the same holds true for the impetus, energy and intelligence behind =\r\nthe=A0GB=A0phenomenon...certainly &quot;they&quot; have just as much to do with it as=\r\n &quot;we&quot; do...(perhaps even more so!). \n=A0\nI feel it&#39;s at least a=A03 PART dy=\r\nnamic and one which exists between the device itself, the operator and thos=\r\ne on the other side. \n=A0\nI&#39;m in agreement that what works best for one mig=\r\nht be horrible=A0for another (& vice versa)=A0and this is something we coul=\r\nd all do well to keep in mind - perhaps especially myself as I&#39;ve been quit=\r\ne harsh with a few devices in the past and my own opinion and experience wi=\r\nth them is the furthest thing from the &quot;holy work&quot; or final word on the sub=\r\nject. Like everyone else here=A0I experiment, conduct my sessions, record m=\r\ny work and file my research in effort to find what works best FOR ME and ga=\r\nrners the=A0greatest results. \n=A0\nPart of what makes this field, our indiv=\r\nidual work and collective efforts so exciting and progressive is that each =\r\nresearcher brings their own unique=A0approach and combined experience to th=\r\ne table. I don&#39;t think ITC research would ever grow or progress=A0if everyo=\r\nne used the same devices or recorded their sessions in the same way, natura=\r\nlly. \n=A0\nThat said, if you&#39;re still interested in testing and experimentin=\r\ng with=A0this device to see if you like it or not, Michael, I&#39;d be happy to=\r\n send you mine to experiment with if you&#39;re open=A0to paying for postage an=\r\nd return shipping. I&#39;d rather see the devices in my care and the equipment =\r\nI&#39;ve invested in be actively used or sold or at least scrapped for parts to=\r\n create other devices when and where possible. Practically any ITC device c=\r\nan get some kind of results and who knows? Perhaps the RT-EVP will work bet=\r\nter for you than it has for me...you might even fall in love with it and be=\r\n able to show me all the=A0things I&#39;ve missed! =A0\n=A0\nBest, \nJerome\n=A0\n=\r\n=A0\r\n--0-2082433186-1288033458=:7289\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;DIV&gt;&lt;STRONG&gt;CB&lt;/STRONG&gt; brings up a great po=\r\nint in that each user has their own input and individual &quot;key&quot; regarding ho=\r\nw well a certain device is going to work for them. I think the same holds t=\r\nrue for the impetus, energy and intelligence behind the&nbsp;GB&nbsp;phenom=\r\nenon...certainly &quot;they&quot; have just as much to do with it as &quot;we&quot; do...(perha=\r\nps even more so!). &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I feel it&#39;s at least a&nbs=\r\np;&lt;STRONG&gt;3 PART&lt;/STRONG&gt; dynamic and one which exists between the device i=\r\ntself, the operator and those on the other side. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;=\r\nDIV&gt;I&#39;m in agreement that what works best for one might be horrible&nbsp;fo=\r\nr another (&amp; vice versa)&nbsp;and this is something we could all do wel=\r\nl to keep in mind - perhaps especially myself as I&#39;ve been quite harsh with=\r\n a few devices in the past and my own opinion and experience with them is t=\r\nhe furthest thing from the &quot;holy work&quot; or final word on the subject. Like e=\r\nveryone else here&nbsp;I experiment, conduct my sessions, record my work an=\r\nd file my research in effort to find what works best FOR ME and garners the=\r\n&nbsp;greatest results. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Part of what makes th=\r\nis field, our individual work and collective efforts so exciting and progre=\r\nssive is that each researcher brings their own unique&nbsp;approach and com=\r\nbined experience to the table. I don&#39;t think ITC research would ever grow o=\r\nr progress&nbsp;if everyone used the same devices or recorded their session=\r\ns in the same way, naturally. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;That said, if y=\r\nou&#39;re still interested in testing and experimenting with&nbsp;this device t=\r\no see if you like it or not, Michael, I&#39;d be happy to send you mine to expe=\r\nriment with if you&#39;re open&nbsp;to paying for postage and return shipping. =\r\nI&#39;d rather see the devices in my care and the equipment I&#39;ve invested in be=\r\n actively used or sold or at least scrapped for parts to create other devic=\r\nes when and where possible. Practically any ITC device can get some kind of=\r\n results and who knows? Perhaps the &lt;STRONG&gt;RT-EVP&lt;/STRONG&gt; will work bette=\r\nr for you than it has for me...you might even fall in love with it and be a=\r\nble to show me all the&nbsp;things I&#39;ve missed! &nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/D=\r\nIV&gt;\n&lt;DIV&gt;Best, &lt;/DIV&gt;\n&lt;DIV&gt;Jerome&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;=\r\n&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;\r\n--0-2082433186-1288033458=:7289--"}