{"id": "19096", "subject": "Re: [EVP-ITC] Thoughts on My Antique Communication Device? [3 Attachments]", "author": "Tim Woolworth", "timestamp": "2010-10-25T19:34:36Z", "full_text": "Kris,\n\nI have no idea what you have there, but it looks great.  Hopefully you can\nget it working again.  Try searching out antique radio dealers online or\nnear your location and show them the photos, maybe you can get a little more\ninformation that way.\n\nTim\n\nOn Mon, Oct 25, 2010 at 3:04 PM, Kris Bronson\n&lt;the_rocker_chick1@...&gt;wrote:\n\n&gt;\n&gt;  [Attachment(s) &lt;#12be4c7a6b13896d_TopText&gt; from Kris Bronson included\n&gt; below]\n&gt;\n&gt; I&#39;ll be the first to admit I&#39;m no expert when it comes to ITC. The majority\n&gt; of my experience comes from working with Chris (Moon) and his box for the\n&gt; past 3 years. The results still never cease to amaze me!\n&gt;\n&gt; Anyhow, I came across this device at an estate auction. It appears to be an\n&gt; antique communication device of some sort. The only verifiable information I\n&gt; have is that is was probably built around 1910-1912, which is before radio\n&gt; was publicly available.\n&gt; (I obtained this date from researching the packaging cylinder used to build\n&gt; the device.)\n&gt;\n&gt; Does anyone have any thoughts on what it might be? I did show this device\n&gt; to Chris a while back and he agreed that it probably was a communication device.\n&gt; He also suggested I show it to Frank... = )\n&gt; According to Chris&#39;s box, &quot;this *IS* a communication device of historical\n&gt; value.&quot; It also mentioned the device was &quot;meant specifically for me to have,\n&gt; but no longer worked.&quot; There was more, but I&#39;m trying to remain unbiased and\n&gt; only use tangible evidence. However, I have little to go on.\n&gt;\n&gt; If anyone has any clues or can lead me in a research direction I would\n&gt; appreciate it! Thanks!\n&gt;\n&gt;\n&gt;  \n&gt;\n\nK is,I ha e no idea wha you ha e he e, bu i looks g ea .  Hope ully you can ge i wo king again.  T y sea ching ou an ique adio deale s online o nea you loca ion and show hem he pho os, maybe you can ge a li le mo e in o ma ion ha way.\nTimOn Mon, Oc 25, 2010 a 3:04 PM, K is B onson he_ ocke _chick1@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n [A achmen (s) om K is B onson included below]\n \n \n I'll be he i s o admi I'm no expe when i comes o ITC. The majo i y o my expe ience comes om wo king wi h Ch is (Moon) and his box o he pas 3 yea s. The esul s s ill ne e cease o amaze me! \nAnyhow, I came ac oss his de ice a an es a e auc ion. I appea s o be an an ique communica ion de ice o some so . The only e i iable in o ma ion I ha e is ha is was p obably buil a ound 1910-1912, which is be o e adio was publicly a ailable. \n(I ob ained his da e om esea ching he\n packaging cylinde used o build he de ice.) Does anyone ha e any hough s on wha i migh be? I did show his de ice o Ch is a while back and he ag eed ha i p obably was a communica ion de ice. He also sugges ed I show i o F ank... = )\nAcco ding o Ch is's box, \" his IS a communica ion de ice o his o ical alue.\" I also men ioned he de ice was \"mean speci ically o me o ha e, bu no longe wo ked.\" The e was mo e, bu I'm ying o emain unbiased and only use  angible e idence.\n Howe e , I ha e li le o go on.I anyone has any clues o can lead me in a esea ch di ec ion I would app ecia e i ! Thanks!"}