{"id": "19100", "subject": "Re: [EVP-ITC] Re: How long should I run a session?", "author": "Tim Woolworth", "timestamp": "2010-10-26T01:22:00Z", "full_text": "I think Frank said it best when he said it gets tedious with longer\nsessions.  As you do more sessions, you will want to continue conversing\nwith the Others for as long as possible.  But, upon playback, careful\nanalysis (with headphones and Adobe Audition) takes me an hour for every 5\nminutes.  So three sessions a week at 15 minutes a session can eat up a lot\nof time.  So I try to keep my home sessions to 10 minutes or less.  There\nare times when they are not too communicative and I keep pressing on past 15\nminutes and I always dread it when I do because there is so much more to\nlisten to.\n\nIn the field, it is a different story.  Session times can go from 15 to 40\nminutes and leave you with a helluva lot of audio to consider.  Being very\nactive in investigations and home sessions can make going over the audio a\nvery dreadful process if you inundate yourself with longer sessions.\n\nSo my advice?  Keep it under ten unless you are getting something fantastic.\n Also, keep a word file on every session file that documents the time and\ncommunication received in the session for future reference.  Sometimes\npeople and messages come across that I got over a year ago and I would have\nnever known it if it weren&#39;t for the files I keep.\n\nHope this helps.\n\nOn Mon, Oct 25, 2010 at 9:12 PM, Adriana Jones &lt;adrianamjones@...&gt;wrote:\n\n&gt;\n&gt;\n&gt; I would go at least 10 to 15 minutes, but that&#39;s just in my own experience,\n&gt; which is not very extensive. What do some others on here have to say? I&#39;m\n&gt; actually curious about this question myself.\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, &quot;imrudym&quot;\n&gt; &lt;imrudym@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; I have recently started doing EVP Maker sessions in my home and have\n&gt; gotten results (Rudy&#39;s Folder) from two of the first four sessions. I have\n&gt; only been doing five minute sessions at a time. Is this too long or too\n&gt; short of a session time?\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nI hink F ank said i bes when he said i ge s edious wi h longe sessions.  As you do mo e sessions, you will wan o con inue con e sing wi h he O he s o as long as possible.  Bu , upon playback, ca e ul analysis (wi h headphones and Adobe Audi ion) akes me an hou o e e y 5 minu es.  So h ee sessions a week a 15 minu es a session can ea up a lo o ime.  So I y o keep my home sessions o 10 minu es o less.  The e a e imes when hey a e no oo communica i e and I keep p essing on pas 15 minu es and I always d ead i when I do because he e is so much mo e o lis en o.\nIn he ield, i is a di e en s o y.  Session imes can go om 15 o 40 minu es and lea e you wi h a hellu a lo o audio o conside .  Being e y ac i e in in es iga ions and home sessions can make going o e he audio a e y d ead ul p ocess i you inunda e you sel wi h longe sessions.\nSo my ad ice?  Keep i unde en unless you a e ge ing some hing an as ic.  Also, keep a wo d ile on e e y session ile ha documen s he ime and communica ion ecei ed in he session o u u e e e ence.  Some imes people and messages come ac oss ha I go o e a yea ago and I would ha e ne e known i i i we en' o he iles I keep.\nHope his helps.On Mon, Oc 25, 2010 a 9:12 PM, Ad iana Jones ad ianamjones@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n I would go a leas 10 o 15 minu es, bu ha 's jus in my own expe ience, which is no e y ex ensi e. Wha do some o he s on he e ha e o say? I'm ac ually cu ious abou his ques ion mysel .\n\n--- In EVP-ITC@yahoog oups.com, \"im udym\" w o e:\n>\n> I ha e ecen ly s a ed doing EVP Make sessions in my home and ha e go en esul s (Rudy's Folde ) om wo o he i s ou sessions. I ha e only been doing i e minu e sessions a a ime. Is his oo long o oo sho o a session ime?\n\n>"}