{"id": "19102", "subject": "Re: How long should I run a session?", "author": "Urkel23", "timestamp": "2010-10-26T01:27:42Z", "full_text": "I do one recorded session a week for 6-8 minutes.  I usually do longer sessions during the week, but i don&#39;t record them.  If i do, i will feel obligated to go over it.\n\n-Steve\n\n\n\n--- In EVP-ITC@yahoogroups.com, Tim Woolworth &lt;tjwoolworth@...&gt; wrote:\n&gt;\n&gt; I think Frank said it best when he said it gets tedious with longer\n&gt; sessions.  As you do more sessions, you will want to continue conversing\n&gt; with the Others for as long as possible.  But, upon playback, careful\n&gt; analysis (with headphones and Adobe Audition) takes me an hour for every 5\n&gt; minutes.  So three sessions a week at 15 minutes a session can eat up a lot\n&gt; of time.  So I try to keep my home sessions to 10 minutes or less.  There\n&gt; are times when they are not too communicative and I keep pressing on past 15\n&gt; minutes and I always dread it when I do because there is so much more to\n&gt; listen to.\n&gt; \n&gt; In the field, it is a different story.  Session times can go from 15 to 40\n&gt; minutes and leave you with a helluva lot of audio to consider.  Being very\n&gt; active in investigations and home sessions can make going over the audio a\n&gt; very dreadful process if you inundate yourself with longer sessions.\n&gt; \n&gt; So my advice?  Keep it under ten unless you are getting something fantastic.\n&gt;  Also, keep a word file on every session file that documents the time and\n&gt; communication received in the session for future reference.  Sometimes\n&gt; people and messages come across that I got over a year ago and I would have\n&gt; never known it if it weren&#39;t for the files I keep.\n&gt; \n&gt; Hope this helps.\n&gt; \n&gt; On Mon, Oct 25, 2010 at 9:12 PM, Adriana Jones &lt;adrianamjones@...&gt;wrote:\n&gt; \n&gt; &gt;\n&gt; &gt;\n&gt; &gt; I would go at least 10 to 15 minutes, but that&#39;s just in my own experience,\n&gt; &gt; which is not very extensive. What do some others on here have to say? I&#39;m\n&gt; &gt; actually curious about this question myself.\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, &quot;imrudym&quot;\n&gt; &gt; &lt;imrudym@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; I have recently started doing EVP Maker sessions in my home and have\n&gt; &gt; gotten results (Rudy&#39;s Folder) from two of the first four sessions. I have\n&gt; &gt; only been doing five minute sessions at a time. Is this too long or too\n&gt; &gt; short of a session time?\n&gt; &gt; &gt;\n&gt; &gt;\n&gt; &gt;  \n&gt; &gt;\n&gt;"}