{"id": "19115", "subject": "Re: [EVP-ITC] Re: Thoughts on My Antique Communication Device?", "author": "Zack Widup", "timestamp": "2010-10-26T19:32:07Z", "full_text": "I have one somewhat similar to it. I was going to remark that the cat\nwhisker assembly seems to be missing.\n\nThose things were designed to be used with a set of high-impedance\nheadphones.\n\nZack\n\n\nOn Tue, Oct 26, 2010 at 2:14 PM, vortex6066 &lt;vortex6066@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Its a crystal radio receiver. Probably made in the early 20&#39;s judging by\n&gt; the condition and parts used. The front controls are tuning and headphone\n&gt; volume.\n&gt; A crystal detector is meant to plug into that socket, and the set wont work\n&gt; without it. A (modern) germanium diode could be used instead and soldered\n&gt; across the socket terminals.\n&gt; The wire on the coil looks like its loosing its insulation so the coil is\n&gt; probably faulty and would have to be re-wound.\n&gt; JEFF\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Kris Bronson\n&gt; &lt;the_rocker_chick1@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; I&#39;ll be the first to admit I&#39;m no expert when it comes to ITC. The\n&gt; majority of\n&gt; &gt; my experience comes from working with Chris (Moon) and his box for the\n&gt; past 3\n&gt; &gt; years. The results still never cease to amaze me!\n&gt; &gt;\n&gt; &gt; Anyhow, I came across this device at an estate auction. It appears to be\n&gt; an\n&gt; &gt; antique communication device of some sort. The only verifiable\n&gt; information I\n&gt; &gt; have is that is was probably built around 1910-1912, which is before\n&gt; radio was\n&gt; &gt; publicly available.\n&gt; &gt; (I obtained this date from researching the packaging cylinder used to\n&gt; build the\n&gt; &gt; device.)\n&gt; &gt;\n&gt; &gt; Does anyone have any thoughts on what it might be? I did show this device\n&gt; to\n&gt; &gt; Chris a while back and he agreed that it probably was a communication\n&gt; device. He\n&gt; &gt; also suggested I show it to Frank... = )\n&gt; &gt; According to Chris&#39;s box, &quot;this IS a communication device of historical\n&gt; value.&quot;\n&gt; &gt; It also mentioned the device was &quot;meant specifically for me to have, but\n&gt; no\n&gt; &gt; longer worked.&quot; There was more, but I&#39;m trying to remain unbiased and\n&gt; only\n&gt; &gt; use tangible evidence. However, I have little to go on.\n&gt; &gt;\n&gt; &gt; If anyone has any clues or can lead me in a research direction I would\n&gt; &gt; appreciate it! Thanks!\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nI ha e one somewha simila o i . I was going o ema k ha he ca whiske assembly seems o be missing.Those hings we e designed o be used wi h a se o high-impedance headphones.Zack\nOn Tue, Oc 26, 2010 a 2:14 PM, o ex6066 o ex6066@...m.au> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n I s a c ys al adio ecei e . P obably made in he ea ly 20's judging by he condi ion and pa s used. The on con ols a e uning and headphone olume.\nA c ys al de ec o is mean o plug in o ha socke , and he se won wo k wi hou i . A (mode n) ge manium diode could be used ins ead and solde ed ac oss he socke e minals.\nThe wi e on he coil looks like i s loosing i s insula ion so he coil is p obably aul y and would ha e o be e-wound. \nJEFF\n\n--- In EVP-ITC@...m, K is B onson w o e:\n>\n> I'll be he i s o admi I'm no expe when i comes o ITC. The majo i y o \n> my expe ience comes om wo king wi h Ch is (Moon) and his box o he pas 3 \n> yea s. The esul s s ill ne e cease o amaze me! \n> \n> Anyhow, I came ac oss his de ice a an es a e auc ion. I appea s o be an \n> an ique communica ion de ice o some so . The only e i iable in o ma ion I \n> ha e is ha is was p obably buil a ound 1910-1912, which is be o e adio was \n> publicly a ailable. \n> (I ob ained his da e om esea ching he packaging cylinde used o build he \n> de ice.) \n> \n> Does anyone ha e any hough s on wha i migh be? I did show his de ice o \n> Ch is a while back and he ag eed ha i p obably was a communica ion de ice. He \n> also sugges ed I show i o F ank... = )\n> Acco ding o Ch is's box, \" his IS a communica ion de ice o his o ical alue.\" \n> I also men ioned he de ice was \"mean speci ically o me o ha e, bu no \n> longe wo ked.\" The e was mo e, bu I'm ying o emain unbiased and only \n> use angible e idence. Howe e , I ha e li le o go on.\n> \n> I anyone has any clues o can lead me in a esea ch di ec ion I would \n> app ecia e i ! Thanks!\n>"}