{"id": "19123", "subject": "Re: [EVP-ITC] Try to get rid of Feedingback", "author": "Frank Sumption", "timestamp": "2010-10-27T16:14:03Z", "full_text": "Feedback is the big problem with the internal echo chamber. For a while I\nwas leaving out the echo chamber, but trying to provide external chambers\nwas a problem too, it makes the box less portable. The chamber adds\n&quot;something&quot;, kinda like a filter, plus &quot;they&quot; seems to be able to make their\nvoices easier. Usually I can drill holes in the cabinet to relive the\nfeedback, with this box I had to seal the whole thing with silicone. I had a\nbetter seal between the battery compartment and the main compartment, so I\nguess sound was finding other ways to interact.\n\n The chamber speaker is less than an inch in diameter, and the mic just a\nstandard electret.  I use three tubes, instead of the two shown in the\ndiagram so I can get more separation. The larger the chamber the more\npronounced the enhancement effect, the voices are almost scary. I made one\nonce that was 12 inch by 48 inch MDF board lined with aluminum foil with\ncrystals and magnets glued on the insides, OMG  I had to take to it apart!\nThat was frikkin&#39; demonic.\n\n That&#39;s one reason I don&#39;t have a fixed design, there&#39;s just too much to\nthis.\n\n F-S\n\nOn Wed, Oct 27, 2010 at 6:12 AM, Tim Woolworth &lt;tjwoolworth@...&gt;wrote:\n\n&gt;\n&gt;\n&gt; It is a simple concept as to why the vents cut down on feedback.  As a\n&gt; former live sound engineer, feedback was quite the nemesis.\n&gt;\n&gt; If I remember reading right, you have a small microphone and a small\n&gt; speaker in your &quot;echo chamber.&quot;  A feedback loop happens when a speaker\n&gt; produces audio and a microphone pics that audio up.  The thing is, if the\n&gt; speaker and microphone are not far enough apart from one another, a feedback\n&gt; loop occurs where the audio loop between microphone to speaker keeps\n&gt; building up and frequencies start to converge into feedback.\n&gt;\n&gt; Considering that your echo chamber is right under the batteries, the\n&gt; microphone in the echo chamber is probably picking up the audio from the\n&gt; main speaker output at the same time as the output that is in the echo\n&gt; chamber.  The two sources picked up at the same time is causing the\n&gt; feedback.   By venting the battery chamber, the soundwaves from the main\n&gt; speaker  are being released easier from the hollow design of the box.  This\n&gt; allows for the natural reverberation caused by speaker output to stop\n&gt; reverberating around inside the box, it is this bouncing around of audio\n&gt; that is= eventually picked up by your echo chamber microphone at the same\n&gt; time and becomes feedback.\n&gt;\n&gt; The same thing happens during a concert when a performer gets his\n&gt; microphone to close to the floor monitor.  A feedback loop occurs because\n&gt; the singer hear&#39;s his voice in the floor monitor at the same time as it is\n&gt; coming out of his mouth.  A loop occurs where the frequencies build upon\n&gt; each other and feedback happens.  In your case, the microphone inside the\n&gt; echo chamber is simply picking up the main speaker at the same time as the\n&gt; speaker in your echo box, causing the same audio pattern.\n&gt;\n&gt; Hope this helps,\n&gt;\n&gt; Tim\n&gt; On Wed, Oct 27, 2010 at 2:38 AM, Frank Sumption &lt;purplealiengirl@gmail.com\n&gt; &gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;  [Attachment(s)&lt;https://mail.google.com/mail/?ui=2&view=js&name=main,tlist&ver=vDkaykVSG9w.en.&am=!yGvcqUNUUxexhZ5ijtQ2ZMKIZroesisZtoKH5kognAihF0mgsh4P&fri#12bed9ab56331f24_12bec6a7bae7ff88_TopText&gt;from Frank Sumption included below]\n&gt;&gt;\n&gt;&gt; The battery box is on top of the echo chamber, and venting the door helps\n&gt;&gt; cut the feedback for some weird acoustical reason. The new box should be\n&gt;&gt; &quot;92&quot; doh!\n&gt;&gt;\n&gt;&gt;  F-S\n&gt;&gt;\n&gt;&gt;\n&gt;  \n&gt;\n\nFeedback is he big p oblem wi h  he in e nal echo chambe . Fo a while I was lea ing ou he echo chambe , bu ying o p o ide ex e nal chambe s was a p oblem oo, i makes he box less po able. The chambe adds \"some hing\", kinda like a il e , plus \" hey\" seems o be able o make hei oices easie . Usually I can d ill holes in he cabine o eli e he eedback, wi h his box I had o seal he whole hing wi h silicone. I had a be e seal be ween he ba e y compa men and he main compa men , so I guess sound was inding o he ways o in e ac . \n\n \n The chambe speake is less han an inch in diame e , and he mic jus a s anda d elec e .  I use h ee ubes, ins ead o he wo shown in he diag am so I can ge mo e sepa a ion. The la ge he chambe he mo e p onounced he enhancemen  e ec , he oices a e almos sca y. I made one once ha was 12 inch by 48 inch MDF boa d lined wi h aluminum oil wi h c ys als and magne s glued on he insides, OMG  I had o ake  o i apa ! Tha was ikkin' demonic.\n\n \n Tha 's one eason I don' ha e a ixed design, he e's jus oo much o his. \n \n F-S\nOn Wed, Oc 27, 2010 a 6:12 AM, Tim Woolwo h jwoolwo h@gmail.com> w o e:\n\n  \n\n\n\nI is a simple concep as o why he en s cu down on eedback.  As a o me li e sound enginee , eedback was qui e he nemesis.   \n\nI I emembe eading igh , you ha e a small mic ophone and a small speake in you \"echo chambe .\"  A eedback loop happens when a speake p oduces audio and a mic ophone pics ha audio up.  The hing is, i he speake and mic ophone a e no a enough apa om one ano he , a eedback loop occu s whe e he audio loop be ween mic ophone o speake keeps building up and equencies s a o con e ge in o eedback.  \n\n\nConside ing ha you echo chambe is igh unde he ba e ies, he mic ophone in he echo chambe is p obably picking up he audio om he main speake ou pu a he same ime as he ou pu ha is in he echo chambe .  The wo sou ces picked up a he same ime is causing he eedback.   By en ing he ba e y chambe , he soundwa es om he main speake  a e being eleased easie om he hollow design o he box.  This allows o he na u al e e be a ion caused by speake ou pu o s op e e be a ing a ound inside he box, i is his bouncing a ound o audio ha is= e en ually picked up by you echo chambe mic ophone a he same ime and becomes eedback.\n\n\nThe same hing happens du ing a conce when a pe o me ge s his mic ophone o close o he loo moni o .  A eedback loop occu s because he singe hea 's his oice in he loo moni o a he same ime as i is coming ou o his mou h.  A loop occu s whe e he equencies build upon each o he and eedback happens.  In you case, he mic ophone inside he echo chambe is simply picking up he main speake a he same ime as he speake in you echo box, causing he same audio pa e n.\n\n\nHope his helps,\n\nTim\nOn Wed, Oc 27, 2010 a 2:38 AM, F ank Sump ion pu plealiengi l@...> w o e:\n\n  \n\n\n[A achmen (s) om F ank Sump ion included below] \n\n\nThe ba e y box is on op o he echo chambe , and en ing he doo helps cu he eedback o some wei d acous ical eason. The new box should be \"92\" doh!\n \n F-S"}