{"id": "19134", "subject": "Re: [EVP-ITC] For the &quot;pure EVP&quot; enthusiast", "author": "Rhonda W", "timestamp": "2010-11-02T15:37:56Z", "full_text": "--0-1877086980-1288712276=:44723\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nwoooohooooo nekkid investigations! Im game =3Dp\n\n--- On Tue, 11/2/10, Frank=\r\n Sumption &lt;purplealiengirl@...&gt; wrote:\n\n\nFrom: Frank Sumption &lt;purple=\r\naliengirl@...&gt;\nSubject: [EVP-ITC] For the &quot;pure EVP&quot; enthusiast\nTo: E=\r\nVP-ITC@yahoogroups.com, RTSC@yahoogroups.com\nDate: Tuesday, November 2, 201=\r\n0, 8:30 AM\n\n\n=C2=A0 \n\n\n\n\n=C2=A0Such as those that think real EVP can only b=\r\ne received using white noise might want to do some real research starting w=\r\nith natural radio and what are call spherics and whistlers, or pulses gener=\r\nated by lightening and other &quot;natural&quot; EMF sources. Some,=C2=A0 will no dou=\r\nbt claim=C2=A0their system operates at such a high frequency that it can no=\r\nt get the low frequency EMFs of natural radio--wrong again. This stuff cove=\r\nrs the whole the spectrum from DC to light, and those little whispers are=\r\n=C2=A0mostly just RF noise from natural and man made sources, you can even =\r\nget=C2=A0the noise from big planets, here on Earth, from Jupiter and Saturn=\r\n.=C2=A0 Get a sound=C2=A0 that might seem like singing and I am pretty sure=\r\n it&#39;s just what is called a &quot;whistler&quot;, probably from terrestrial lightenin=\r\ng. The thunderstorm can be anywhere, this stuff propagates just like radio,=\r\n and there are hundreds of thunderstorms all over the planet at any given m=\r\noment.=C2=A0 Everytime an electric motor starts, or\n a florescent light, or=\r\n a car starts, anything that uses electricity, there is going to be a magne=\r\ntic field radiated.=C2=A0 How many electric lights are in the world going o=\r\nn and off!?=C2=A0 How about in a factory, large shop, lab, or manufacturing=\r\n/research facility?Lots and lots of magnetic/electric pulses.\n=C2=A0\n=C2=A0=\r\nThen, to make it worse, people claim be touched during investigations might=\r\n want to investigate static electricity!=C2=A0 Clothes generate electric fi=\r\nelds as we move around, normally it goes unnoticed, but=C2=A0moving around=\r\n=C2=A0in the dark listening and feeling for anything, you might think you&#39;r=\r\ne being touched, or your clothes moved. Could it be just the static electri=\r\ncity causing attraction and/or repulsion of areas of clothing?=C2=A0 I&#39;m no=\r\nt saying that&#39;s what it is. Just be sure, and to get the pure=C2=A0experien=\r\nce, I think all ghost investigations should be done naked to eliminate all =\r\nstatic electricity from clothing. :-O \n=C2=A0\n=C2=A0I know, sounds like deb=\r\nunking, but ya have to stop and think sometimes.=C2=A0 Some of these effect=\r\ns we feel and hear can be caused by natural magnetic and electric sources. =\r\nThen, make it worse cuz we can create, via thought forms, just what we want=\r\n to experience. One must control one&#39;s emotions! \n=C2=A0\n=C2=A0There are=C2=\r\n=A0some that have established themselves as experts based on white noise EV=\r\nP. To maintain position they may claim only white noise EVP is acceptable a=\r\nnd pure.=C2=A0 What is white noise? A frikkin&#39; raw audio in it&#39;s simplest f=\r\norm, so why not use higher level sounds and get higher level voices? When y=\r\nou get voices giving names, answering questions, and even cussing and swear=\r\ning, I am pretty sure &quot;the box&quot; as it&#39;s come to be=C2=A0known beats the be-=\r\ngeeesies out of white noise BS. Yes, you can get broadcast fragments, and b=\r\nits that can be mistaken, but with white noise, you can get all kinds of we=\r\nak noise pulses that probably say nothing, but you are desperately trying t=\r\no interpret. It&#39;s been my experience that the more one filters and cleans a=\r\n recording, the more these noises sound intelligible. If you have to filter=\r\n it just to hear if it is saying anything--forget about it!=C2=A0 I think o=\r\nur own minds and psi ability--can--- influence the sounds and create a\n mea=\r\nning where there was none. \n=C2=A0\n=C2=A0Spirit exists in a higher dimensio=\r\nn, as such they have full access to our level and can easily manipulate sou=\r\nnd and everything else. We are limited, they are not. That&#39;s why I focus on=\r\n higher level, more energetic phenomenon and ignore stuff like white noise =\r\nEVP or orbs. Paranormal experience is more dictated by what one can accept =\r\nthan anything else,=C2=A0 by what one fears as well. \n=C2=A0\n=C2=A0\n=C2=A0W=\r\nait=C2=A0for it! Wait for it! Here it comes-- the threats of law suits and =\r\nhow dare you question......\n=C2=A0\n=C2=A0Am I an expert--hell no, ex=3D=3D=\r\n=3Dhas been, &#39;spert=3D=3Ddrip under pressure.=C2=A0I don&#39;t want to be a &quot;pa=\r\nranormal expert&quot; \n=C2=A0\n=C2=A0\n=C2=A0F-S\n\n\n\n\n\n\n\n      \r\n--0-1877086980-1288712276=:44723\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;woooohooooo nekkid investigations! Im game =\r\n=3Dp&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Tue, 11/2/10, Frank Sumption &lt;I&gt;&lt;purplealiengirl@g=\r\nmail.com&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: rgb(16,16=\r\n,255) 2px solid; PADDING-LEFT: 5px; MARGIN-LEFT: 5px&quot;&gt;&lt;BR&gt;From: Frank Sumpt=\r\nion &lt;purplealiengirl@...&gt;&lt;BR&gt;Subject: [EVP-ITC] For the &quot;pure E=\r\nVP&quot; enthusiast&lt;BR&gt;To: EVP-ITC@yahoogroups.com, RTSC@yahoogroups.com&lt;BR&gt;Date=\r\n: Tuesday, November 2, 2010, 8:30 AM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3Dyiv24645080&gt;&lt;SPAN st=\r\nyle=3D&quot;DISPLAY: none&quot;&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV id=3Dyiv24645080ygrp-text&gt;\n&lt;DIV&gt;\n=\r\n&lt;DIV&gt;&nbsp;Such as those that think real EVP can only be received using whi=\r\nte noise might want to do some real research starting with natural radio an=\r\nd what are call spherics and whistlers, or pulses generated by lightening a=\r\nnd other &quot;natural&quot; EMF sources. Some,&nbsp; will no doubt claim&nbsp;their =\r\nsystem operates at such a high frequency that it can not get the low freque=\r\nncy EMFs of natural radio--wrong again. This stuff covers the whole the spe=\r\nctrum from DC to light, and those little whispers are&nbsp;mostly just RF n=\r\noise from natural and man made sources, you can even get&nbsp;the noise fro=\r\nm big planets, here on Earth, from Jupiter and Saturn.&nbsp; Get a sound&nb=\r\nsp; that might seem like singing and I am pretty sure it&#39;s just what is cal=\r\nled a &quot;whistler&quot;, probably from terrestrial lightening. The thunderstorm ca=\r\nn be anywhere, this stuff propagates just like radio, and there are hundred=\r\ns of thunderstorms all over the planet at any given moment.&nbsp;\n Everytim=\r\ne an electric motor starts, or a florescent light, or a car starts, anythin=\r\ng that uses electricity, there is going to be a magnetic field radiated.&nb=\r\nsp; How many electric lights are in the world going on and off!?&nbsp; How =\r\nabout in a factory, large shop, lab, or manufacturing/research facility?Lot=\r\ns and lots of magnetic/electric pulses.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;=\r\nThen, to make it worse, people claim be touched during investigations might=\r\n want to investigate static electricity!&nbsp; Clothes generate electric fi=\r\nelds as we move around, normally it goes unnoticed, but&nbsp;moving around&=\r\nnbsp;in the dark listening and feeling for anything, you might think you&#39;re=\r\n being touched, or your clothes moved. Could it be just the static electric=\r\nity causing attraction and/or repulsion of areas of clothing?&nbsp; I&#39;m not=\r\n saying that&#39;s what &lt;U&gt;it is&lt;/U&gt;. Just be sure, and to get the pure&nbsp;ex=\r\nperience, I think all ghost investigations should be done naked to eliminat=\r\ne all static electricity from clothing. :-O &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&=\r\nnbsp;I know, sounds like debunking, but ya have to stop and think sometimes=\r\n.&nbsp; Some of these effects we feel and hear can be caused by natural mag=\r\nnetic and electric sources. Then, make it worse cuz we can create, via thou=\r\nght forms, just what we want to experience. One must control one&#39;s emotions=\r\n! &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;There are&nbsp;some that have establi=\r\nshed themselves as experts based on white noise EVP. To maintain position t=\r\nhey may claim only white noise EVP is acceptable and pure.&nbsp; What is wh=\r\nite noise? A frikkin&#39; raw audio in it&#39;s simplest form, so why not use highe=\r\nr level sounds and get higher level voices? When you get voices giving name=\r\ns, answering questions, and even cussing and swearing, I am pretty sure &quot;th=\r\ne box&quot; as it&#39;s come to be&nbsp;known beats the be-geeesies out of white noi=\r\nse BS. Yes, you can get broadcast fragments, and bits that can be mistaken,=\r\n but with white noise, you can get all kinds of weak noise pulses that prob=\r\nably say nothing, but you are desperately trying to interpret. It&#39;s been my=\r\n experience that the more one filters and cleans a recording, the more thes=\r\ne noises sound intelligible. If you have to filter it just to hear if it is=\r\n saying anything--forget about it!&nbsp; I think our own minds and psi abil=\r\nity--can---\n influence the sounds and create a meaning where there was none=\r\n. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;Spirit exists in a higher dimension, =\r\nas such they have full access to our level and can easily manipulate sound =\r\nand everything else. We are limited, they are not. That&#39;s why I focus on hi=\r\ngher level, more energetic phenomenon and ignore stuff like white noise EVP=\r\n or orbs. Paranormal experience is more dictated by what one can accept tha=\r\nn anything else,&nbsp; by what one fears as well. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n=\r\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;Wait&nbsp;for it! Wait for it! Here it comes--=\r\n the threats of law suits and how dare you question......&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;=\r\n&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;Am I an expert--hell no, ex=3D=3D=3Dhas been, &#39;spert=3D=\r\n=3Ddrip under pressure.&nbsp;I don&#39;t want to be a &quot;paranormal expert&quot; &lt;/DIV=\r\n&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;F-S&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLO=\r\nCKQUOTE&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;br&gt;\n\n      \r\n--0-1877086980-1288712276=:44723--"}