{"id": "19139", "subject": "Re: [EVP-ITC] Has anyone tried this piece of equipment for EVPS? Raudive Diode", "author": "Tim Woolworth", "timestamp": "2010-11-03T01:00:59Z", "full_text": "Our group tried the various Raudive Diode&#39;s for over five years and it\nyielded precisely nothing.\n\nThe Raudive Diode was, at the time of the book Breakthrough, a new technique\nthat was being developed by an american physicist named Stanley that he was\nworking with.  The forward of the book was written by a women who worked\nwith Raudive shortly after the book was published.  She recounts how\nKonstantin plugged the diode in between the radio and the recorder and\nwas embarrassed when it did not work.  Eventually it did work, but the\nantennae length had to be constantly adjusted.  This basically creates a\nvery primitive radio crystal set.  The diode really came to light thanks to\nGeorge Meek who claims that he modified it for the Spiricom.\n\nSo does it work?\n\nNot for us, and apparently, it worked very rarely for Raudive.\n\nTim\n\nOn Tue, Nov 2, 2010 at 8:42 PM, Country &lt;countrybumpkin1956@yahoo.com&gt;wrote:\n\n&gt;\n&gt;\n&gt; Hello everyone....\n&gt;\n&gt; I was wondering if anyone had tried this piece of equipment to help them\n&gt; get EVP&#39;s and what their experience was like (good, bad, neutral)? I have\n&gt; read some about the original creator or discover of this method for EVP&#39;s.\n&gt; Anyway, I saw this listed on Ebay:\n&gt;\n&gt; &gt;&gt;This device re-creates two authentic Raudive Diode circuits in one unit\n&gt; that you can record together using any stereo recording device with a\n&gt; microphone socket. Unique dual circuitry gives you two different receivers\n&gt; in one unit. Connects to a microphone jack on a PC or tape recorder.&gt;&gt;&gt;&gt;\n&gt;\n&gt; Thanks very much for your help and/or input!\n&gt; CB\n&gt;\n&gt;  \n&gt;\n\nOu g oup ied he a ious Raudi e Diode's o o e i e yea s and i yielded p ecisely no hing.   The Raudi e Diode was, a he ime o he book B eak h ough, a new echnique ha was being de eloped by an ame ican physicis named S anley ha he was wo king wi h.  The o wa d o he book was w i en by a women who wo ked wi h Raudi e sho ly a e he book was published.  She ecoun s how Kons an in plugged he diode in be ween he adio and he eco de and was emba assed when i did no wo k.  E en ually i did wo k, bu he an ennae leng h had o be cons an ly adjus ed.  This basically c ea es a e y p imi i e adio c ys al se .  The diode eally came o ligh hanks o Geo ge Meek who claims ha he modi ied i o he Spi icom.\nSo does i wo k?No o us, and appa en ly, i wo ked e y a ely o Raudi e.TimOn Tue, No 2, 2010 a 8:42 PM, Coun y coun ybumpkin1956@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n Hello e e yone....\n\nI was wonde ing i anyone had ied his piece o equipmen o help hem ge EVP's and wha hei expe ience was like (good, bad, neu al)? I ha e ead some abou he o iginal c ea o o disco e o his me hod o EVP's. Anyway, I saw his lis ed on Ebay:\n\n\n>>This de ice e-c ea es wo au hen ic Raudi e Diode ci cui s in one uni ha you can eco d oge he using any s e eo eco ding de ice wi h a mic ophone socke . Unique dual ci cui y gi es you wo di e en ecei e s in one uni . Connec s o a mic ophone jack on a PC o ape eco de .>>>>\n\n\nThanks e y much o you help and/o inpu !\nCB"}