{"id": "19136", "subject": "Re: [EVP-ITC] For the &quot;pure EVP&quot; enthusiast", "author": "Joanne Tauferner", "timestamp": "2010-11-02T16:15:54Z", "full_text": "--0-1830679323-1288714554=:74292\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nI didn&#39;t know you were in this group.=C2=A0 I have been in this EVP group a=\r\nbout 3 years.=C2=A0 When did you join?\n\n--- On Tue, 11/2/10, Rhonda W &lt;rhon=\r\ndak1973@...&gt; wrote:\n\nFrom: Rhonda W &lt;rhondak1973@...&gt;\nSubject: =\r\nRe: [EVP-ITC] For the &quot;pure EVP&quot; enthusiast\nTo: EVP-ITC@yahoogroups.com\nDat=\r\ne: Tuesday, November 2, 2010, 8:37 AM\n\n\n\n\n\n\n\n=C2=A0\n\n\n\n  \n\n\n    \n      \n   =\r\n   \n      woooohooooo nekkid investigations! Im game =3Dp\n\n--- On Tue, 11/2=\r\n/10, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n\n\nFrom: Frank Sumpti=\r\non &lt;purplealiengirl@...&gt;\nSubject: [EVP-ITC] For the &quot;pure EVP&quot; enthus=\r\niast\nTo: EVP-ITC@yahoogroups.com, RTSC@yahoogroups.com\nDate: Tuesday, Novem=\r\nber 2, 2010, 8:30 AM\n\n\n=C2=A0 \n\n\n=C2=A0Such as those that think real EVP ca=\r\nn only be received using white noise might want to do some real research st=\r\narting with natural radio and what are call spherics and whistlers, or puls=\r\nes generated by lightening and other &quot;natural&quot; EMF sources. Some,=C2=A0 wil=\r\nl no doubt claim=C2=A0their system operates at such a high frequency that i=\r\nt can not get the low frequency EMFs of natural radio--wrong again. This st=\r\nuff covers the whole the spectrum from DC to light, and those little whispe=\r\nrs are=C2=A0mostly just RF noise from natural and man made sources, you can=\r\n even get=C2=A0the noise from big planets, here on Earth, from Jupiter and =\r\nSaturn.=C2=A0 Get a sound=C2=A0 that might seem like singing and I am prett=\r\ny sure it&#39;s just what is called a &quot;whistler&quot;, probably from terrestrial lig=\r\nhtening. The thunderstorm can be anywhere, this stuff propagates just like =\r\nradio, and there are hundreds of thunderstorms all over the planet at any g=\r\niven moment.=C2=A0\n Everytime an electric motor starts, or a florescent lig=\r\nht, or a car starts, anything that uses electricity, there is going to be a=\r\n magnetic field radiated.=C2=A0 How many electric lights are in the world g=\r\noing on and off!?=C2=A0 How about in a factory, large shop, lab, or manufac=\r\nturing/research facility?Lots and lots of magnetic/electric pulses.\n=C2=A0\n=\r\n=C2=A0Then, to make it worse, people claim be touched during investigations=\r\n might want to investigate static electricity!=C2=A0 Clothes generate elect=\r\nric fields as we move around, normally it goes unnoticed, but=C2=A0moving a=\r\nround=C2=A0in the dark listening and feeling for anything, you might think =\r\nyou&#39;re being touched, or your clothes moved. Could it be just the static el=\r\nectricity causing attraction and/or repulsion of areas of clothing?=C2=A0 I=\r\n&#39;m not saying that&#39;s what it is. Just be sure, and to get the pure=C2=A0exp=\r\nerience, I think all ghost investigations should be done naked to eliminate=\r\n all static electricity from clothing. :-O \n=C2=A0\n=C2=A0I know, sounds lik=\r\ne debunking, but ya have to stop and think sometimes.=C2=A0 Some of these e=\r\nffects we feel and hear can be caused by natural magnetic and electric sour=\r\nces. Then, make it worse cuz we can create, via thought forms, just what we=\r\n want to experience. One must control one&#39;s emotions! \n=C2=A0\n=C2=A0There a=\r\nre=C2=A0some that have established themselves as experts based on white noi=\r\nse EVP. To maintain position they may claim only white noise EVP is accepta=\r\nble and pure.=C2=A0 What is white noise? A frikkin&#39; raw audio in it&#39;s simpl=\r\nest form, so why not use higher level sounds and get higher level voices? W=\r\nhen you get voices giving names, answering questions, and even cussing and =\r\nswearing, I am pretty sure &quot;the box&quot; as it&#39;s come to be=C2=A0known beats th=\r\ne be-geeesies out of white noise BS. Yes, you can get broadcast fragments, =\r\nand bits that can be mistaken, but with white noise, you can get all kinds =\r\nof weak noise pulses that probably say nothing, but you are desperately try=\r\ning to interpret. It&#39;s been my experience that the more one filters and cle=\r\nans a recording, the more these noises sound intelligible. If you have to f=\r\nilter it just to hear if it is saying anything--forget about it!=C2=A0 I th=\r\nink our own minds and psi ability--can---\n influence the sounds and create =\r\na meaning where there was none. \n=C2=A0\n=C2=A0Spirit exists in a higher dim=\r\nension, as such they have full access to our level and can easily manipulat=\r\ne sound and everything else. We are limited, they are not. That&#39;s why I foc=\r\nus on higher level, more energetic phenomenon and ignore stuff like white n=\r\noise EVP or orbs. Paranormal experience is more dictated by what one can ac=\r\ncept than anything else,=C2=A0 by what one fears as well. \n=C2=A0\n=C2=A0\n=\r\n=C2=A0Wait=C2=A0for it! Wait for it! Here it comes-- the threats of law sui=\r\nts and how dare you question......\n=C2=A0\n=C2=A0Am I an expert--hell no, ex=\r\n=3D=3D=3Dhas been, &#39;spert=3D=3Ddrip under pressure.=C2=A0I don&#39;t want to be=\r\n a &quot;paranormal expert&quot; \n=C2=A0\n=C2=A0\n=C2=A0F-S\n\n\n      \n\n    \n     \n\n    \n=\r\n    \n\n\n \n\n\n\n  \n\n\n\n\n\n\n      \r\n--0-1830679323-1288714554=:74292\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;I didn&#39;t know you were in this group.&nbsp; I=\r\n have been in this EVP group about 3 years.&nbsp; When did you join?&lt;br&gt;&lt;br=\r\n&gt;--- On &lt;b&gt;Tue, 11/2/10, Rhonda W &lt;i&gt;&lt;rhondak1973@...&gt;&lt;/i&gt;&lt;/b&gt; =\r\nwrote:&lt;br&gt;&lt;blockquote style=3D&quot;border-left: 2px solid rgb(16, 16, 255); mar=\r\ngin-left: 5px; padding-left: 5px;&quot;&gt;&lt;br&gt;From: Rhonda W &lt;rhondak1973@yahoo=\r\n.com&gt;&lt;br&gt;Subject: Re: [EVP-ITC] For the &quot;pure EVP&quot; enthusiast&lt;br&gt;To: EVP=\r\n-ITC@yahoogroups.com&lt;br&gt;Date: Tuesday, November 2, 2010, 8:37 AM&lt;br&gt;&lt;br&gt;&lt;di=\r\nv id=3D&quot;yiv714191687&quot;&gt;\n\n\n\n\n\n&lt;span style=3D&quot;display: none;&quot;&gt;&nbsp;&lt;/span&gt;\n\n\n=\r\n\n    &lt;div id=3D&quot;yiv714191687ygrp-text&quot;&gt;\n      \n      \n      &lt;p&gt;&lt;table borde=\r\nr=3D&quot;0&quot; cellpadding=3D&quot;0&quot; cellspacing=3D&quot;0&quot;&gt;&lt;tbody&gt;&lt;tr&gt;&lt;td style=3D&quot;font: i=\r\nnherit;&quot; valign=3D&quot;top&quot;&gt;woooohooooo nekkid investigations! Im game =3Dp&lt;br&gt;=\r\n&lt;br&gt;--- On &lt;b&gt;Tue, 11/2/10, Frank Sumption &lt;i&gt;&lt;purplealiengirl@...=\r\n&gt;&lt;/i&gt;&lt;/b&gt; wrote:&lt;br&gt;\n&lt;blockquote style=3D&quot;border-left: 2px solid rgb(16,=\r\n 16, 255);&quot;&gt;&lt;br&gt;From: Frank Sumption &lt;purplealiengirl@...&gt;&lt;br&gt;S=\r\nubject: [EVP-ITC] For the &quot;pure EVP&quot; enthusiast&lt;br&gt;To: EVP-ITC@yahoogroups.=\r\ncom, RTSC@yahoogroups.com&lt;br&gt;Date: Tuesday, November 2, 2010, 8:30 AM&lt;br&gt;&lt;b=\r\nr&gt;\n&lt;div id=3D&quot;yiv714191687yiv24645080&quot;&gt;&lt;span&gt;&nbsp;&lt;/span&gt; \n&lt;div id=3D&quot;yiv7=\r\n14191687yiv24645080ygrp-text&quot;&gt;\n&lt;div&gt;\n&lt;div&gt;&nbsp;Such as those that think re=\r\nal EVP can only be received using white noise might want to do some real re=\r\nsearch starting with natural radio and what are call spherics and whistlers=\r\n, or pulses generated by lightening and other &quot;natural&quot; EMF sources. Some,&=\r\nnbsp; will no doubt claim&nbsp;their system operates at such a high frequen=\r\ncy that it can not get the low frequency EMFs of natural radio--wrong again=\r\n. This stuff covers the whole the spectrum from DC to light, and those litt=\r\nle whispers are&nbsp;mostly just RF noise from natural and man made sources=\r\n, you can even get&nbsp;the noise from big planets, here on Earth, from Jup=\r\niter and Saturn.&nbsp; Get a sound&nbsp; that might seem like singing and I=\r\n am pretty sure it&#39;s just what is called a &quot;whistler&quot;, probably from terres=\r\ntrial lightening. The thunderstorm can be anywhere, this stuff propagates j=\r\nust like radio, and there are hundreds of thunderstorms all over the planet=\r\n at any given moment.&nbsp;\n Everytime an electric motor starts, or a flore=\r\nscent light, or a car starts, anything that uses electricity, there is goin=\r\ng to be a magnetic field radiated.&nbsp; How many electric lights are in th=\r\ne world going on and off!?&nbsp; How about in a factory, large shop, lab, o=\r\nr manufacturing/research facility?Lots and lots of magnetic/electric pulses=\r\n.&lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;Then, to make it worse, people claim b=\r\ne touched during investigations might want to investigate static electricit=\r\ny!&nbsp; Clothes generate electric fields as we move around, normally it go=\r\nes unnoticed, but&nbsp;moving around&nbsp;in the dark listening and feeling=\r\n for anything, you might think you&#39;re being touched, or your clothes moved.=\r\n Could it be just the static electricity causing attraction and/or repulsio=\r\nn of areas of clothing?&nbsp; I&#39;m not saying that&#39;s what &lt;u&gt;it is&lt;/u&gt;. Just=\r\n be sure, and to get the pure&nbsp;experience, I think all ghost investigat=\r\nions should be done naked to eliminate all static electricity from clothing=\r\n. :-O &lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;I know, sounds like debunking, bu=\r\nt ya have to stop and think sometimes.&nbsp; Some of these effects we feel =\r\nand hear can be caused by natural magnetic and electric sources. Then, make=\r\n it worse cuz we can create, via thought forms, just what we want to experi=\r\nence. One must control one&#39;s emotions! &lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;=\r\nThere are&nbsp;some that have established themselves as experts based on wh=\r\nite noise EVP. To maintain position they may claim only white noise EVP is =\r\nacceptable and pure.&nbsp; What is white noise? A frikkin&#39; raw audio in it&#39;=\r\ns simplest form, so why not use higher level sounds and get higher level vo=\r\nices? When you get voices giving names, answering questions, and even cussi=\r\nng and swearing, I am pretty sure &quot;the box&quot; as it&#39;s come to be&nbsp;known b=\r\neats the be-geeesies out of white noise BS. Yes, you can get broadcast frag=\r\nments, and bits that can be mistaken, but with white noise, you can get all=\r\n kinds of weak noise pulses that probably say nothing, but you are desperat=\r\nely trying to interpret. It&#39;s been my experience that the more one filters =\r\nand cleans a recording, the more these noises sound intelligible. If you ha=\r\nve to filter it just to hear if it is saying anything--forget about it!&nbs=\r\np; I think our own minds and psi ability--can---\n influence the sounds and =\r\ncreate a meaning where there was none. &lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;=\r\nSpirit exists in a higher dimension, as such they have full access to our l=\r\nevel and can easily manipulate sound and everything else. We are limited, t=\r\nhey are not. That&#39;s why I focus on higher level, more energetic phenomenon =\r\nand ignore stuff like white noise EVP or orbs. Paranormal experience is mor=\r\ne dictated by what one can accept than anything else,&nbsp; by what one fea=\r\nrs as well. &lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;Wait&nbsp=\r\n;for it! Wait for it! Here it comes-- the threats of law suits and how dare=\r\n you question......&lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;Am I an expert--hell=\r\n no, ex=3D=3D=3Dhas been, &#39;spert=3D=3Ddrip under pressure.&nbsp;I don&#39;t wan=\r\nt to be a &quot;paranormal expert&quot; &lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;d=\r\niv&gt;&nbsp;F-S&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/blockquote&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/tbody&gt;&lt;/table&gt;=\r\n&lt;br&gt;\n\n      &lt;/p&gt;\n\n    &lt;/div&gt;\n     \n\n\n\n \n\n\n&lt;/div&gt;&lt;/blockquote&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/ta=\r\nble&gt;&lt;br&gt;\n\n      \r\n--0-1830679323-1288714554=:74292--"}