{"id": "19135", "subject": "Re: [EVP-ITC] For the &quot;pure EVP&quot; enthusiast", "author": "Tim Woolworth", "timestamp": "2010-11-02T15:55:23Z", "full_text": "Well I, for one, am glad that you do not drip under pressure Frank (although\nI think they have a pill for that)!\n\nYou have some interesting stuff posted here and I think that it needs to be\ntaken into consideration.  There are too many people who are convinced that\neverything is a paranormal event.\n\nLike you intimated, most of what we experience is some form of stored\nelectromagnetic energy.  It builds up and releases in devices like\ntelevisions, refrigerators, light and microwaves.  How often have you heard\nyour TV make a popping sound when it is off?  We must consider that these\nreleases of electromagnetic energy travel via waves that can not only\ninteract  with, but also resonate in wood.  Is it possible that this\nfrequency resonation can cause a tapping sound once in a while?\n\nI agree fully with the concept of static electricity being responsible for\nthe willies we get on investigations once in a while.  I am certain that\nthis is NOT the only cause, but it may play an important role some of the\ntime.\n\nShow me a picture of an orb and I will show you a picture of a piece of\ndust.\n\nBut, i am far from a debunking skeptic.  I like to be somewhat rational\nbefore proclaiming that it is a spirit scurrying across the floor in my\nattic!  This is why I find GBC so fascinating.  To be able to record the\nsame voices at different times in different parts of the country is proof\nenough for me that there is something fantastic going on with these boxes.\n Whatever is communicating with us is intelligent and responsive, and that\nalone should merit further GB research by &quot;science.&quot;\n\nThis will not happen though.  The implications of discovering life beyond\nour own limited 5 senses are too incomprehensible for the ordered world\nscience has constructed for us.\n\nThere are no experts, only experiences.\n\nTim\n\nOn Tue, Nov 2, 2010 at 11:37 AM, Rhonda W &lt;rhondak1973@yahoo.com&gt; wrote:\n\n&gt;\n&gt;\n&gt; woooohooooo nekkid investigations! Im game =p\n&gt;\n&gt; --- On *Tue, 11/2/10, Frank Sumption &lt;purplealiengirl@...&gt;* wrote:\n&gt;\n&gt;\n&gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt; Subject: [EVP-ITC] For the &quot;pure EVP&quot; enthusiast\n&gt; To: EVP-ITC@yahoogroups.com, RTSC@yahoogroups.com\n&gt; Date: Tuesday, November 2, 2010, 8:30 AM\n&gt;\n&gt;\n&gt;\n&gt;   Such as those that think real EVP can only be received using white noise\n&gt; might want to do some real research starting with natural radio and what are\n&gt; call spherics and whistlers, or pulses generated by lightening and other\n&gt; &quot;natural&quot; EMF sources. Some,  will no doubt claim their system operates at\n&gt; such a high frequency that it can not get the low frequency EMFs of natural\n&gt; radio--wrong again. This stuff covers the whole the spectrum from DC to\n&gt; light, and those little whispers are mostly just RF noise from natural and\n&gt; man made sources, you can even get the noise from big planets, here on\n&gt; Earth, from Jupiter and Saturn.  Get a sound  that might seem like singing\n&gt; and I am pretty sure it&#39;s just what is called a &quot;whistler&quot;, probably from\n&gt; terrestrial lightening. The thunderstorm can be anywhere, this stuff\n&gt; propagates just like radio, and there are hundreds of thunderstorms all over\n&gt; the planet at any given moment.  Everytime an electric motor starts, or a\n&gt; florescent light, or a car starts, anything that uses electricity, there is\n&gt; going to be a magnetic field radiated.  How many electric lights are in the\n&gt; world going on and off!?  How about in a factory, large shop, lab, or\n&gt; manufacturing/research facility?Lots and lots of magnetic/electric pulses.\n&gt;\n&gt;  Then, to make it worse, people claim be touched during investigations\n&gt; might want to investigate static electricity!  Clothes generate electric\n&gt; fields as we move around, normally it goes unnoticed, but moving around in\n&gt; the dark listening and feeling for anything, you might think you&#39;re being\n&gt; touched, or your clothes moved. Could it be just the static electricity\n&gt; causing attraction and/or repulsion of areas of clothing?  I&#39;m not saying\n&gt; that&#39;s what *it is*. Just be sure, and to get the pure experience, I think\n&gt; all ghost investigations should be done naked to eliminate all static\n&gt; electricity from clothing. :-O\n&gt;\n&gt;  I know, sounds like debunking, but ya have to stop and think sometimes.\n&gt; Some of these effects we feel and hear can be caused by natural magnetic and\n&gt; electric sources. Then, make it worse cuz we can create, via thought forms,\n&gt; just what we want to experience. One must control one&#39;s emotions!\n&gt;\n&gt;  There are some that have established themselves as experts based on white\n&gt; noise EVP. To maintain position they may claim only white noise EVP is\n&gt; acceptable and pure.  What is white noise? A frikkin&#39; raw audio in it&#39;s\n&gt; simplest form, so why not use higher level sounds and get higher level\n&gt; voices? When you get voices giving names, answering questions, and even\n&gt; cussing and swearing, I am pretty sure &quot;the box&quot; as it&#39;s come to be known\n&gt; beats the be-geeesies out of white noise BS. Yes, you can get broadcast\n&gt; fragments, and bits that can be mistaken, but with white noise, you can get\n&gt; all kinds of weak noise pulses that probably say nothing, but you are\n&gt; desperately trying to interpret. It&#39;s been my experience that the more one\n&gt; filters and cleans a recording, the more these noises sound intelligible. If\n&gt; you have to filter it just to hear if it is saying anything--forget about\n&gt; it!  I think our own minds and psi ability--can--- influence the sounds and\n&gt; create a meaning where there was none.\n&gt;\n&gt;  Spirit exists in a higher dimension, as such they have full access to our\n&gt; level and can easily manipulate sound and everything else. We are limited,\n&gt; they are not. That&#39;s why I focus on higher level, more energetic phenomenon\n&gt; and ignore stuff like white noise EVP or orbs. Paranormal experience is more\n&gt; dictated by what one can accept than anything else,  by what one fears as\n&gt; well.\n&gt;\n&gt;\n&gt;  Wait for it! Wait for it! Here it comes-- the threats of law suits and how\n&gt; dare you question......\n&gt;\n&gt;  Am I an expert--hell no, ex===has been, &#39;spert==drip under pressure. I\n&gt; don&#39;t want to be a &quot;paranormal expert&quot;\n&gt;\n&gt;\n&gt;  F-S\n&gt;\n&gt;\n&gt;  \n&gt;\n\nWell I, o one, am glad ha you do no d ip unde p essu e F ank (al hough I hink hey ha e a pill o ha )! You ha e some in e es ing s u pos ed he e and I hink ha i needs o be aken in o conside a ion.  The e a e oo many people who a e con inced ha e e y hing is a pa ano mal e en .  \nLike you in ima ed, mos o wha we expe ience is some o m o s o ed elec omagne ic ene gy.  I builds up and eleases in de ices like ele isions, e ige a o s, ligh and mic owa es.  How o en ha e you hea d you TV make a popping sound when i is o ?  We mus conside ha hese eleases o elec omagne ic ene gy a el ia wa es ha can no only in e ac  wi h, bu also esona e in wood.  Is i possible ha his equency esona ion can cause a apping sound once in a while?\nI ag ee ully wi h he concep o s a ic elec ici y being esponsible o he willies we ge on in es iga ions once in a while.  I am ce ain ha his is NOT he only cause, bu i may play an impo an ole some o he ime.\nShow me a pic u e o an o b and I will show you a pic u e o a piece o dus .Bu , i am a om a debunking skep ic.  I like o be somewha a ional be o e p oclaiming ha i is a spi i scu ying ac oss he loo in my a ic!  This is why I ind GBC so ascina ing.  To be able o eco d he same oices a di e en imes in di e en pa s o he coun y is p oo enough o me ha he e is some hing an as ic going on wi h hese boxes.  Wha e e is communica ing wi h us is in elligen and esponsi e, and ha alone should me i u he GB esea ch by \"science.\"\nThis will no happen hough.  The implica ions o disco e ing li e beyond ou own limi ed 5 senses a e oo incomp ehensible o he o de ed wo ld science has cons uc ed o us.\nThe e a e no expe s, only expe iences.TimOn Tue, No 2, 2010 a 11:37 AM, Rhonda W hondak1973@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n woooohooooo nekkid in es iga ions! Im game =p--- On Tue, 11/2/10, F ank Sump ion pu plealiengi l@...> w o e:\n\nF om: F ank Sump ion pu plealiengi l@...>Subjec : [EVP-ITC] Fo he \"pu e EVP\" en husias \nTo: EVP-ITC@yahoog oups.com, RTSC@...mDa e: Tuesday, No embe 2, 2010, 8:30 AM\n\n  \n\n\n Such as hose ha hink eal EVP can only be ecei ed using whi e noise migh wan o do some eal esea ch s a ing wi h na u al adio and wha a e call sphe ics and whis le s, o pulses gene a ed by ligh ening and o he \"na u al\" EMF sou ces. Some,  will no doub claim  hei sys em ope a es a such a high equency ha i can no ge he low equency EMFs o na u al adio--w ong again. This s u co e s he whole he spec um om DC o ligh , and hose li le whispe s a e mos ly jus RF noise om na u al and man made sou ces, you can e en ge   he noise om big plane s, he e on Ea h, om Jupi e and Sa u n.  Ge a sound  ha migh seem like singing and I am p e y su e i 's jus wha is called a \"whis le \", p obably om e es ial ligh ening. The hunde s o m can be anywhe e, his s u p opaga es jus like adio, and he e a e hund eds o hunde s o ms all o e he plane a any gi en momen . \n E e y ime an elec ic mo o s a s, o a lo escen ligh , o a ca s a s, any hing ha uses elec ici y, he e is going o be a magne ic ield adia ed.  How many elec ic ligh s a e in he wo ld going on and o !?  How abou in a ac o y, la ge shop, lab, o manu ac u ing/ esea ch acili y?Lo s and lo s o magne ic/elec ic pulses.\n\n \n Then, o make i wo se, people claim be ouched du ing in es iga ions migh wan o in es iga e s a ic elec ici y!  Clo hes gene a e elec ic ields as we mo e a ound, no mally i goes unno iced, bu  mo ing a ound in he da k lis ening and eeling o any hing, you migh hink you' e being ouched, o you clo hes mo ed. Could i be jus he s a ic elec ici y causing a ac ion and/o epulsion o a eas o clo hing?  I'm no saying ha 's wha i is. Jus be su e, and o ge he pu e expe ience, I hink all ghos in es iga ions should be done naked o elimina e all s a ic elec ici y om clo hing. :-O \n\n \n I know, sounds like debunking, bu ya ha e o s op and hink some imes.  Some o hese e ec s we eel and hea can be caused by na u al magne ic and elec ic sou ces. Then, make i wo se cuz we can c ea e, ia hough o ms, jus wha we wan o expe ience. One mus con ol one's emo ions! \n\n \n The e a e some ha ha e es ablished hemsel es as expe s based on whi e noise EVP. To main ain posi ion hey may claim only whi e noise EVP is accep able and pu e.  Wha is whi e noise? A ikkin' aw audio in i 's simples o m, so why no use highe le el sounds and ge highe le el oices? When you ge oices gi ing names, answe ing ques ions, and e en cussing and swea ing, I am p e y su e \" he box\" as i 's come o be known bea s he be-geeesies ou o whi e noise BS. Yes, you can ge b oadcas agmen s, and bi s ha can be mis aken, bu wi h whi e noise, you can ge all kinds o weak noise pulses ha p obably say no hing, bu you a e despe a ely ying o in e p e . I 's been my expe ience ha he mo e one il e s and cleans a eco ding, he mo e hese noises sound in elligible. I you ha e o il e i jus o hea i i is saying any hing-- o ge abou i !  I hink ou own minds and psi abili y--can---\n in luence he sounds and c ea e a meaning whe e he e was none. \n \n Spi i exis s in a highe dimension, as such hey ha e ull access o ou le el and can easily manipula e sound and e e y hing else. We a e limi ed, hey a e no . Tha 's why I ocus on highe le el, mo e ene ge ic phenomenon and igno e s u like whi e noise EVP o o bs. Pa ano mal expe ience is mo e dic a ed by wha one can accep han any hing else,  by wha one ea s as well. \n\n \n \n Wai   o i ! Wai o i ! He e i comes-- he h ea s o law sui s and how da e you ques ion......\n \n Am I an expe --hell no, ex===has been, 'spe ==d ip unde p essu e. I don' wan o be a \"pa ano mal expe \" \n \n \n F-S"}