{"id": "19148", "subject": "Re: [EVP-ITC] A weird flute---or-what? [6 Attachments]", "author": "Tim Woolworth", "timestamp": "2010-11-07T16:35:05Z", "full_text": "I am not sure about the Flutes, but they sure do sound cool even if they are\nfeedback.  Looks like you created a synthesizer!\n\nIn your other files, there is plenty of communication though.\n\n(NormalOp-1)\n.03 - A woman says &quot;hello people (? or purple ?)&quot;\n.05 - A man &quot;press that ? back ?&quot;\n.10 - A man &quot;Ask him those questions it means that we&#39;ll ? give up ? &quot;\n.14 - A man &quot;You should talk to Frank&quot;\n\n(NormalOp-2)\n.12 - A man &quot;Yeah, put over it&quot;  - This happens after you replace the lid!\n.14 - A man &quot;Hello&quot;\n\nTim\n\nOn Sun, Nov 7, 2010 at 2:26 AM, Frank Sumption &lt;purplealiengirl@...&gt;wrote:\n\n&gt;\n&gt;  [Attachment(s) &lt;#12c253b26b9fde48_TopText&gt; from Frank Sumption included\n&gt; below]\n&gt;\n&gt;  Not sure what this flute sound is. The sweep hung up, and put AM reception\n&gt; down below the band--I think. I&#39;m guessing it&#39;s a weird feedback signal, as\n&gt; it was only audible in the echo chamber. Could it be an amazing example of\n&gt; spirit communication, naw, I think it much more mundane. It was after I put\n&gt; the top cover on, so my vote is feedback notes.\n&gt;\n&gt;  This is not intended to reflect on any other systems out there, real or\n&gt; imagined, only my own work is in question.\n&gt;\n&gt;  Frank-S\n&gt;\n&gt;  \n&gt;\n\nI am no su e abou he Flu es, bu hey su e do sound cool e en i hey a e eedback.  Looks like you c ea ed a syn hesize !In you o he iles, he e is plen y o communica ion hough. \n(No malOp-1) .03 - A woman says \"hello people (? o pu ple ?)\".05 - A man \"p ess ha ? back ?\".10 - A man \"Ask him hose ques ions i means ha we'll ? gi e up ? \"\n.14 - A man \"You should alk o F ank\"(No malOp-2).12 - A man \"Yeah, pu o e i \"  - This happens a e you eplace he lid!.14 - A man \"Hello\"\nTimOn Sun, No 7, 2010 a 2:26 AM, F ank Sump ion pu plealiengi l@gmail.com> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n [A achmen (s) om F ank Sump ion included below]\n \n \n  No su e wha his lu e sound is. The sweep hung up, and pu AM ecep ion down below he band--I hink. I'm guessing i 's a wei d eedback signal, as i was only audible in he echo chambe . Could i be an amazing example o spi i communica ion, naw, I hink i much mo e mundane. I was a e I pu he op co e on, so my o e is eedback no es.  \n\n\n \n This is no in ended o e lec on any o he sys ems ou he e, eal o imagined, only my own wo k is in ques ion. \n \n F ank-S"}