{"id": "19143", "subject": "About &quot;pure&quot; EVP", "author": "Frank Sumption", "timestamp": "2010-11-04T17:00:29Z", "full_text": "It was claimed by the maker of the RT-EVP that it gets pure EVP because\nwhile it&#39;s still a swept radio, it sweeps in an area of the RF\nspectrum where there are no radios stations, specifically he said the FM\nband in the RT ends at 88.5mhz, where broadcast FM starts--in this country.\nThat much is not correct, here in Denver we have a sports station at\n87.7mhz, and PBS at 88.1mhz, and it is not just this one radio, I can set\nthese frequencies on any radio and get the stations.  Who knows what&#39;s else\nis in the supposedly unoccupied areas of any band? Just as in the past, AM\nused to go to 1600 khz, it&#39;s now at 1710khz. Couple that with the fact that\nradio is not absolute, you don&#39;t have a station exactly on any given\nfrequency, and that&#39;s the only frequecny it can be received on. All\nbroadcasts have a certain bandwidth, in AM it&#39;s limited to 10khz, I don&#39;t\nremember what the band width is for FM broadcast, a hundred khz maybe?\nThen--too make it worse you can get all kinds of cross modulation effects in\nthe atmosphere and get signals all over the spectrum.  Then, couple these\ninherent problem with a tiny radio, where the circuits can not be made real\ntight, unless you want $10,000 radio, there is all kinds of room for\nunexpected signals to creep in. That&#39;s not even to mention harmonics, all\namplifiers and transmitters produce harmonics that cover a huge spectrum.\nYou can filter to cut down the harmonics, but it&#39;s not 100%.  FCC rules just\nsay they have to be so many DB down from the main transmission, I don&#39;t know\nexactly how many DB (decibels), translation, there is still some energy\nbroadcast across the RF spectrum from any transmitter. Like I said,\natmospherics, what about atmospheric ducting, where VHF signals can be\ntransmitted great distances in sort of a wave guide formed in the atmosphere\nduring certain conditions. FM is VHF, very high frequency.  Even at my house\nthere is still a bunch of garbage at 88.5mhz, where FM is supposed to\nstart, where the RT&#39;s sweep is supposed to end. I probably don&#39;t know the\nhalf of it, I&#39;m a ham operator, not an engineer.\n\n To make matters worse, there are sources of natural radio that cover the\nwhole RF spectum--I think--I may be wrong about that. You can even get these\nnatural radio signals from space, from Jupiter and Saturn--the sun. Some\nsound like voices, whispers, whistles and moans.\n\n Sooooo, &quot;pure EVP&quot;, No such thing! I don&#39;t  like to get all skeptical, but\nI&#39;m alot nicer than then the real skeptics out there. It&#39;s not my intention\nto attack.  If one is making claims, they better know what they are talking\nabout.\n\n That said, I think the RT-EVP has merit, and is probably useful, as long as\none understands the limitations. You still have to judge what is received by\ncontent and meaning, and you have to be aware that those little whispers can\nbe just about anything. White noise EVP is still a valid concept. Just like\nthe box, some of what is heard is just a broadcast fragments, if it talks\nabout tires, sports, or hamburgers, it&#39;s probably just radio.\n\n My apologies to the makers of the RT-EVP, the concept is good, I like the\ndelay feature where you can hear what is received, and the size, you can&#39;t\nbeat the size, I was not privy to it&#39;s use, so my experience with\nit limited. Same with the P-SB7(except thanks to Gary, now have one), very\ncool that if fits in a shirt pocket, with rechargable batteries, and it\nworks, &quot;they&quot; will use what we use. Kinda torques my jaws though that no one\nout there thinks I merit even asking a question of.  If ya don&#39;t like me, at\nleast seek out another ham operator, preferably an extra class. The box is\nfrikkin&#39; radio, I don&#39;t have a lock on it, and hack radios are a good thing.\nI don&#39;t care what others make and sell. What I say about the RT is based on\nwhat I was told about it at Rolling Hills Asylum, by the maker of the\ndevice, and even that was pitifully little information, like most that see\nme, they assume I can&#39;t possibly understand the concept of the technology\ninvolved.\n\n The main criticism with the box is that it picks up broadcast bits, well\nthat&#39;s the function of the box, to provide bits of sounds--speech, music and\nnoise--for the purpose of creating a raw audio, a material that the entities\ncan use to form their voices. Radio just happens to be a very convenient\nsource of raw audio. It works, these sound bits are reorganized in real time\nto create meaningful, often interactive voices. They address us by name,\ngive their names, answer questions, and give other information. The main\nlimitation is taking it out in the boondocks where there are no radio\nstaions. So some previously established EVP expert out there doesn&#39;t like\nit--too bad so sad!  I won&#39;t jump through hoops to make it &quot;more\nacceptable&quot;, besides, it&#39;s way, way, way out of my hands.\n\n In this field, say the wrong thing........\n\n F-S\n\nI was claimed by he make o he RT-EVP ha i ge s pu e EVP because while i 's s ill a swep adio, i sweeps in an a ea o he RF spec um whe e he e a e no adios s a ions, speci ically he said he FM band in he RT ends a 88.5mhz, whe e b oadcas FM s a s--in his coun y. Tha much is no co ec , he e in Den e we ha e a spo s s a ion a 87.7mhz, and PBS a 88.1mhz, and i is no jus his one adio, I can se hese equencies on any adio and ge he s a ions.  Who knows wha 's else is in he supposedly unoccupied a eas o any band? Jus as in he pas , AM used o go o 1600 khz, i 's now a 1710khz. Couple ha wi h he ac ha adio is no absolu e, you don' ha e a s a ion exac ly on any gi en equency, and ha 's he only equecny i can be ecei ed on. All b oadcas s ha e a ce ain bandwid h, in AM i 's limi ed o 10khz, I don' emembe wha he band wid h is o FM b oadcas , a hund ed khz maybe? Then-- oo make i wo se you can ge all kinds o c oss modula ion e ec s in he a mosphe e and ge signals all o e he spec um.  Then, couple hese inhe en p oblem wi h a iny adio, whe e he ci cui s can no be made eal igh , unless you wan $10,000 adio,  he e is all kinds o oom o unexpec ed signals o c eep in. Tha 's no e en o men ion ha monics, all ampli ie s and ansmi e s p oduce ha monics ha co e a huge spec um. You can il e o cu down he ha monics, bu i 's no 100%.  FCC ules jus say hey ha e o be so many DB down om he main ansmission, I don' know exac ly how many DB (decibels), ansla ion, he e is s ill some ene gy b oadcas ac oss he RF spec um om any ansmi e . Like I said, a mosphe ics, wha abou a mosphe ic duc ing, whe e VHF signals can be ansmi ed g ea dis ances in so o a wa e guide o med in he a mosphe e du ing ce ain condi ions. FM is VHF, e y high equency.  E en a my house he e is s ill a bunch o ga bage a 88.5mhz, whe e FM is supposed o s a , whe e he RT's sweep is supposed o end. I p obably don' know he hal o i , I'm a ham ope a o , no an enginee . \n\n \n To make ma e s wo se, he e a e sou ces o na u al adio ha co e he whole RF spec um--I hink--I may be w ong abou ha . You can e en ge hese na u al adio signals om space, om Jupi e and Sa u n-- he sun. Some sound like oices, whispe s, whis les and moans. \n\n \n Sooooo, \"pu e EVP\", No such hing! I don'   like o ge all skep ical, bu I'm alo nice han hen he eal skep ics ou he e. I 's no my in en ion o a ack.  I one is making claims, hey be e know wha hey a e alking abou .  \n\n \n Tha said, I hink he RT-EVP has me i , and is p obably use ul, as long as one unde s ands he limi a ions. You s ill ha e o judge wha is ecei ed by con en and meaning, and you ha e o be awa e ha hose li le whispe s can be jus abou any hing. Whi e noise EVP is s ill a alid concep . Jus like he box, some o wha is hea d is jus a b oadcas agmen s, i i alks abou i es, spo s, o hambu ge s, i 's p obably jus adio. \n\n \n My apologies o he make s o he RT-EVP, he concep is good, I like he delay ea u e whe e you can hea wha is ecei ed, and he size, you can' bea he size, I was no p i y o i 's use, so my expe ience wi h i  limi ed. Same wi h he P-SB7(excep hanks o Ga y, now ha e one), e y cool ha i i s in a shi pocke , wi h echa gable ba e ies, and i wo ks, \" hey\" will use wha we use. Kinda o ques my jaws hough ha no one ou he e hinks I me i e en asking a ques ion o .  I ya don' like me, a leas seek ou ano he ham ope a o , p e e ably an ex a class. The box is ikkin' adio, I don' ha e a lock on i , and hack adios a e a good hing. I don' ca e wha o he s make and sell. Wha I say abou   he RT is based on wha I was old abou i a Rolling Hills Asylum, by he make o he de ice, and e en ha was pi i ully li le in o ma ion, like mos ha see me, hey assume I can' possibly unde s and he concep o he echnology in ol ed.   \n\n \n The main c i icism wi h he box is ha i picks up b oadcas bi s, well ha 's he unc ion o he box, o p o ide bi s o sounds--speech, music and noise-- o he pu pose o c ea ing a aw audio, a ma e ial ha he en i ies can use o o m hei oices. Radio jus happens o be a e y con enien sou ce o aw audio. I wo ks, hese sound bi s a e eo ganized in eal ime o c ea e meaning ul, o en in e ac i e oices. They add ess us by name, gi e hei names, answe ques ions, and gi e o he in o ma ion. The main limi a ion is aking i ou in he boondocks whe e he e a e no adio s aions. So some p e iously es ablished EVP expe ou he e doesn' like i -- oo bad so sad!  I won' jump h ough hoops  o make i \"mo e accep able\", besides, i 's way, way, way ou o my hands.\n\n \n In his ield, say he w ong hing........ \n \n F-S"}