{"id": "19153", "subject": "Re: [EVP-ITC] Other---creatures? [1 Attachment]", "author": "Tim Woolworth", "timestamp": "2010-11-08T18:14:18Z", "full_text": "I hear US SPIDERS DO very clearly.\n\nTalking to bugs is not that weird, I am guilty of it too.  I have a dislike\nof spiders myself, they just creep me out.  Back about ten years ago I was\nliving in Northern California and I moved into a house that had spiders\neverywhere!  I was practicing Wicca at the time (burn me at the stake!) so I\nhad a sit down talk with them.  I told the spiders that they could have the\nkitchen, the hall and the guest bedroom and I would never bother them as\nlong as they left the rest of the house alone and never bothered me when we\nshared a room.  Guess what?  The next day every spider was gone from my\nbedroom and the living room and I never had a single problem with them at\nthat place.  I have a spider on my ceiling now and I talked to him at the\nbeginning of summer and I told him he had to stay on that side of the room\nand he hasn&#39;t moved any closer to my side of the room.\n\nYou can certainly tell the quality difference of that tuner you&#39;re using, it\nis very clear.\n\nOn Mon, Nov 8, 2010 at 12:55 PM, Frank Sumption\n&lt;purplealiengirl@...&gt;wrote:\n\n&gt;\n&gt;  [Attachment(s) &lt;#12c2ca09b662fe87_TopText&gt; from Frank Sumption included\n&gt; below]\n&gt;\n&gt;  My work room out in the garage, and spiders come in. I told them, yeah I\n&gt; talk to bugs--bite me and I gas everyone of ya! They stay outta sight. So\n&gt; this was recorded in the garage last night &quot;Us, (or house) Spiders Speak&quot;\n&gt; at 15 seconds. Brain is not mind, anything that lives, thinks, ghost voices\n&gt; are thoughts. If man thinks he is so advanced, how many can control eight\n&gt; legs and spin a web? How many eyes does a fly need if there is no intellect\n&gt; to process the information? Humans vastly underestimate the rest of nature.\n&gt; Human ego, unjustifiable.\n&gt;\n&gt;  These big radios make better boxes because the quality of the radio is\n&gt; better. Better front end, not so easlily overloaded by strong nearby\n&gt; signals, and better IF filter(the down conversion process), less surious\n&gt; signals, clearer sound. Larger audio amplifiers, and less distortion.\n&gt;\n&gt;  F-S\n&gt;\n&gt;  \n&gt;\n\nI hea US SPIDERS DO e y clea ly.Talking o bugs is no ha wei d, I am guil y o i oo.  I ha e a dislike o spide s mysel , hey jus c eep me ou .  Back abou en yea s ago I was li ing in No he n Cali o nia and I mo ed in o a house ha had spide s e e ywhe e!  I was p ac icing Wicca a he ime (bu n me a he s ake!) so I had a si down alk wi h hem.  I old he spide s ha hey could ha e he ki chen, he hall and he gues bed oom and I would ne e bo he hem as long as hey le he es o he house alone and ne e bo he ed me when we sha ed a oom.  Guess wha ?  The nex day e e y spide was gone om my bed oom and he li ing oom and I ne e had a single p oblem wi h hem a ha place.  I ha e a spide on my ceiling now and I alked o him a he beginning o summe and I old him he had o s ay on ha side o he oom and he hasn' mo ed any close o my side o he oom.\nYou can ce ainly ell he quali y di e ence o ha une you' e using, i is e y clea .On Mon, No 8, 2010 a 12:55 PM, F ank Sump ion pu plealiengi l@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n [A achmen (s) om F ank Sump ion included below]\n \n \n  My wo k oom ou in he ga age, and spide s come in. I old hem, yeah I alk o bugs--bi e me and I gas e e yone o ya! They s ay ou a sigh . So his was eco ded in he ga age las nigh \"Us, (o house) Spide s Speak\"  a 15 seconds. B ain is no mind, any hing ha li es, hinks, ghos oices a e hough s. I man hinks he is so ad anced, how many can con ol eigh legs and spin a web? How many eyes does a ly need i he e is no in ellec o p ocess he in o ma ion? Humans as ly unde es ima e he es o na u e. Human ego, unjus i iable. \n\n\n \n These big adios make be e boxes because he quali y o he adio is be e . Be e on end, no so easlily o e loaded by s ong nea by signals, and be e IF il e ( he down con e sion p ocess), less su ious signals, clea e sound. La ge audio ampli ie s, and less dis o ion. \n\n\n \n F-S"}