{"id": "19150", "subject": "Re: [EVP-ITC] A weird flute---or-what?", "author": "Frank Sumption", "timestamp": "2010-11-07T18:34:05Z", "full_text": "Yeah, the sweep was stoppped on the low end of the AM band, so nothing but\nstatic. I make Native American flutes, and the tones sounded similar, till I\nnoticed no melody, or patterns. It was curious though that if the radio\nswept alitle, the tone were only  at the end of the band. Maybe it was pure\nEVP with radio station involved? or not.\n\n There are some jacked up audio problms with this box that I have never\nencountered before, such as the monitor amp drops dead at 3/4 volume and I\ncan find no reason for this, I changed all components and the IC socket,\neven the volume control cable. To get sufficient volume I had to connect pin\none of the LM386 to ground through a .68 capacitor.  Never had to do\nanything like that before.\n\n F-S\n\nOn Sun, Nov 7, 2010 at 7:03 AM, Zack Widup &lt;w9sz.zack@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; I don&#39;t think that&#39;s a radio signal. It sounds like some sort of\n&gt; resonance being set up in the echo chamber by something in the noise\n&gt; from the radio. Sort of an audio oscillation.\n&gt;\n&gt; Zack\n&gt;\n&gt;\n&gt; On 11/7/10, Frank Sumption &lt;purplealiengirl@...&lt;purplealiengirl%40gmail.com&gt;&gt;\n&gt; wrote:\n&gt; &gt; Not sure what this flute sound is. The sweep hung up, and put AM\n&gt; reception\n&gt; &gt; down below the band--I think. I&#39;m guessing it&#39;s a weird feedback signal,\n&gt; as\n&gt; &gt; it was only audible in the echo chamber. Could it be an amazing example\n&gt; of\n&gt; &gt; spirit communication, naw, I think it much more mundane. It was after I\n&gt; put\n&gt; &gt; the top cover on, so my vote is feedback notes.\n&gt; &gt;\n&gt; &gt; This is not intended to reflect on any other systems out there, real or\n&gt; &gt; imagined, only my own work is in question.\n&gt; &gt;\n&gt; &gt; Frank-S\n&gt; &gt;\n&gt;\n&gt; \n&gt;\n\nYeah, he sweep was s oppped on he low end o he AM band, so no hing bu s a ic. I make Na i e Ame ican lu es, and he ones sounded simila , ill I no iced no melody, o pa e ns. I was cu ious hough ha i he adio swep ali le, he one we e only  a he end o he band. Maybe i was pu e EVP wi h adio s a ion in ol ed? o no . \n\n \n The e a e some jacked up audio p oblms wi h his box ha I ha e ne e encoun e ed be o e, such as he moni o amp d ops dead a 3/4 olume and I can ind no eason o his, I changed all componen s and he IC socke , e en he olume con ol cable. To ge su icien olume I had o connec pin one o he LM386 o g ound h ough a .68 capaci o .  Ne e had o do any hing like ha be o e. \n\n \n F-S\nOn Sun, No 7, 2010 a 7:03 AM, Zack Widup w9sz.zack@gmail.com> w o e:\n\n  \n\n\n\nI don' hink ha 's a adio signal. I sounds like some so o esonance being se up in he echo chambe by some hing in he noise om he adio. So o an audio oscilla ion.Zack \n\n\nOn 11/7/10, F ank Sump ion pu plealiengi l@...> w o e:> No su e wha his lu e sound is. The sweep hung up, and pu AM ecep ion\n> down below he band--I hink. I'm guessing i 's a wei d eedback signal, as> i was only audible in he echo chambe . Could i be an amazing example o > spi i communica ion, naw, I hink i much mo e mundane. I was a e I pu \n> he op co e on, so my o e is eedback no es.>> This is no in ended o e lec on any o he sys ems ou he e, eal o > imagined, only my own wo k is in ques ion.>> F ank-S>"}