{"id": "19175", "subject": "Re: [EVP-ITC] Question...", "author": "Tim Woolworth", "timestamp": "2010-11-09T16:26:06Z", "full_text": "That is why I use the natural trifield solely on a flat surface, typically\nduring a sit down EVP session, and never while moving.  They say you can use\nit while moving but I would not trust any results.\n\nThe device on the webpage listed looks damn impressive.  Unfortunately I am\na electro-ignoramus, but reading the description of the device was quite\nintriguing.  I cannot assemble such devices, but I can understand their use.\n This device appears to have a wonderful range of application.\n\nIs there any video online of this device being used? My curiosity is piqued.\n\nThe natural trifield is woefully inadequate for paranormal research and\n&quot;real&quot; meters are so damn expensive that I cannot justify spending the\nmonetary amount they command at the present time.\n*\n\n\n*\n\nOn Tue, Nov 9, 2010 at 11:07 AM, Zack Widup &lt;w9sz.zack@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; The Trifield Natural EMF meter is not the same as the general Trifield\n&gt; meter. It is very sensitive to the Earth&#39;s magnetic field. It is in magnetic\n&gt; mode that I have the most trouble. They state this problem in the manual.\n&gt; Moving too fast or turning causes the meter to flick. I have the knob for\n&gt; the audible beep trigger turned down most of the time because the constant\n&gt; beeps when I walk or turn get annoying.\n&gt;\n&gt; It is a TriFIELD meter, not a TriAXIS meter. I always assumed it had that\n&gt; name because it has settings to detect electric, magnetic and RF\n&gt; (electromagnetic) fields. Those are the three fields it is capable of\n&gt; detecting.\n&gt;\n&gt; I also built the scalar electrostatic gradiometer but the thing is not\n&gt; always stable (especially in high-humidity settings). But it surpasses\n&gt; anything you can buy commercially.\n&gt;\n&gt; http://amasci.com/freenrg/grado.html\n&gt;\n&gt; Zack\n&gt;\n&gt; P.S. I am an electrical engineer, specifically an RF/microwave engineer.\n&gt;\n&gt;\n&gt;\n&gt; On Tue, Nov 9, 2010 at 9:42 AM, Tim Woolworth &lt;tjwoolworth@...&gt;wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; This device is misused by almost everybody!  This is because the manual\n&gt;&gt; sucks and the TV people use it wrong consistently.  To figure it out, I\n&gt;&gt; contacted the manufacturer a couple years back and this is what they told\n&gt;&gt; me.\n&gt;&gt;\n&gt;&gt; Always us the Trifield in Magnetic mode.  If the box is stable and there\n&gt;&gt; is no lightning, the box should not sound an alarm unless something\n&gt;&gt; paranormal is happening (or you move your digital recorder to close to it,\n&gt;&gt; magnetized speakers).  If you use electric or combination, you can, and\n&gt;&gt; will, pick up the body electric with every motion and may receive many false\n&gt;&gt; positives.  The meter should also never be used while walking because this\n&gt;&gt; too gives unreliable readings.  There is nothing worse than seeing some TV\n&gt;&gt; schmuck holding it in their hands and claiming something paranormal is going\n&gt;&gt; on because an alarm is sounding, never mind that the camera is right next to\n&gt;&gt; it emitting magnetism through the mic / internal speaker.\n&gt;&gt;\n&gt;&gt; Also, the name trifield is a misnomer.  It only has one plane of reading,\n&gt;&gt; not three!  The yellow one (AC) has three fields.  The natural trifield only\n&gt;&gt; measures the plane that extends from the top and bottom edges lengthwise\n&gt;&gt; from the devices.  So if you have the device sitting upright, you will only\n&gt;&gt; measure whatever is above the device.  If you have it laying flat, you will\n&gt;&gt; be able to measure the full plane of length extending beyond the bottom and\n&gt;&gt; top edges.  Therefore, it is best to use this device slightly elevated and\n&gt;&gt; laying flat.\n&gt;&gt;\n&gt;&gt; Using it in this fashion has yielded some amazing results thus far.  While\n&gt;&gt; it is rare for this meter to fire when used properly, when a &quot;spirit&quot;\n&gt;&gt; understands how to trigger the alarm you can get conversations that can last\n&gt;&gt; upwards of an hour.  I have experiences this only 6 times in all the years I\n&gt;&gt; have investigated.  Most of the time, this device yields a single alarm, or\n&gt;&gt; maybe two, with no real time interaction with questions.\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; On Tue, Nov 9, 2010 at 10:29 AM, Zack Widup &lt;w9sz.zack@...&gt; wrote:\n&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt; I have a Trifield Natural EMF meter. It does not respond to 60 Hz fields.\n&gt;&gt;&gt; The problem I have with it is that it is too darned sensitive. It registers\n&gt;&gt;&gt; the magnetic field of the earth in magnetic and combination mode and\n&gt;&gt;&gt; whenever I turn or move too quickly, the meter flicks. If I run it in\n&gt;&gt;&gt; electric field mode it does not do this but I&#39;m always afraid of missing\n&gt;&gt;&gt; something, so I generally run it in combination mode.\n&gt;&gt;&gt;\n&gt;&gt;&gt; Zack\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt; On Tue, Nov 9, 2010 at 9:17 AM, Tim Woolworth &lt;tjwoolworth@...&gt;wrote:\n&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; Like Zack said, nobody knows for sure.  The only thing that we do know\n&gt;&gt;&gt;&gt; is that there is a correlation between spikes in EMF&#39;s and paranormal\n&gt;&gt;&gt;&gt; events.  I have used various meters during GB sessions and there is a\n&gt;&gt;&gt;&gt; correlation at times, but this has to be discounted solely because a radio\n&gt;&gt;&gt;&gt; uses part of the EMF spectrum.\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; It is theorized that EMF measurements are to be taken solely in DC\n&gt;&gt;&gt;&gt; current because it is natural electricity.  So any EMF meter you have that\n&gt;&gt;&gt;&gt; measures AC is worthless on an investigation because it picks up man made\n&gt;&gt;&gt;&gt; electricity.  As for the range, well that is also speculative at best.  The\n&gt;&gt;&gt;&gt; most current theories hold that under 30 Hz DC is where you will find the\n&gt;&gt;&gt;&gt; most paranormal activity.  This is because the Delta, Theta, Alpha, and Beta\n&gt;&gt;&gt;&gt; brainwaves of a human are all below 30 Hz.  This is where the Body Electric\n&gt;&gt;&gt;&gt; fires and consciousness is formed.  If we are dealing with a continuation of\n&gt;&gt;&gt;&gt; consciousness, results are more apt to be found in this range.\n&gt;&gt;&gt;&gt;  Interestingly enough, the earth vibrates in this same range with 5 standing\n&gt;&gt;&gt;&gt; waves at or below 33Hz (Shuman Resonance), so it appears that the new agers\n&gt;&gt;&gt;&gt; are right when they say we vibrate with the Earth.\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; But, as always, no one knows for sure.  And no one knows if these\n&gt;&gt;&gt;&gt; frequencies have anything to do with what we receive in GBC.\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; On Tue, Nov 9, 2010 at 5:10 AM, Adriana Jones &lt;adrianamjones@...&gt;wrote:\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt; This has probably already been discussed a hundred times over by people\n&gt;&gt;&gt;&gt;&gt; building ghost boxes, but... what&#39;s the average emf range of ghosts... and\n&gt;&gt;&gt;&gt;&gt; would creating sounds in that emf range make it easier for the ghosts to\n&gt;&gt;&gt;&gt;&gt; communicate? And would it be possible to make those sounds heard somehow?\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;\n&gt;  \n&gt;\n\nTha is why I use he na u al i ield solely on a la su ace, ypically du ing a si down EVP session, and ne e while mo ing.  They say you can use i while mo ing bu I would no us any esul s.\nThe de ice on he webpage lis ed looks damn imp essi e.  Un o una ely I am a elec o-igno amus, bu eading he desc ip ion o he de ice was qui e in iguing.  I canno assemble such de ices, bu I can unde s and hei use.  This de ice appea s o ha e a wonde ul ange o applica ion.  \nIs he e any ideo online o his de ice being used? My cu iosi y is piqued.The na u al i ield is woe ully inadequa e o pa ano mal esea ch and \" eal\" me e s a e so damn expensi e ha I canno jus i y spending he mone a y amoun hey command a he p esen ime.\n  \nOn Tue, No 9, 2010 a 11:07 AM, Zack Widup w9sz.zack@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n The T i ield Na u al EMF me e is no he same as he gene al T i ield me e . I is e y sensi i e o he Ea h's magne ic ield. I is in magne ic mode ha I ha e he mos ouble. They s a e his p oblem in he manual. Mo ing oo as o u ning causes he me e o lick. I ha e he knob o he audible beep igge u ned down mos o he ime because he cons an beeps when I walk o u n ge annoying.\n\nI is a T iFIELD me e , no a T iAXIS me e . I always assumed i had ha name because i has se ings o de ec elec ic, magne ic and RF (elec omagne ic) ields. Those a e he h ee ields i is capable o de ec ing.\n\nI also buil he scala elec os a ic g adiome e bu he hing is no always s able (especially in high-humidi y se ings). Bu i su passes any hing you can buy comme cially.h p://amasci.com/ een g/g ado.h ml\n\nZackP.S. I am an elec ical enginee , speci ically an RF/mic owa e enginee .On Tue, No 9, 2010 a 9:42 AM, Tim Woolwo h jwoolwo h@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n This de ice is misused by almos e e ybody!  This is because he manual sucks and he TV people use i w ong consis en ly.  To igu e i ou , I con ac ed he manu ac u e a couple yea s back and his is wha hey old me.\n\n\nAlways us he T i ield in Magne ic mode.  I he box is s able and he e is no ligh ning, he box should no sound an ala m unless some hing pa ano mal is happening (o you mo e you digi al eco de o close o i , magne ized speake s).  I you use elec ic o combina ion, you can, and will, pick up he body elec ic wi h e e y mo ion and may ecei e many alse posi i es.  The me e should also ne e be used while walking because his oo gi es un eliable eadings.  The e is no hing wo se han seeing some TV schmuck holding i in hei hands and claiming some hing pa ano mal is going on because an ala m is sounding, ne e mind ha he came a is igh nex o i emi ing magne ism h ough he mic / in e nal speake .  \n\n\nAlso, he name i ield is a misnome .  I only has one plane o eading, no h ee!  The yellow one (AC) has h ee ields.  The na u al i ield only measu es he plane ha ex ends om he op and bo om edges leng hwise om he de ices.  So i you ha e he de ice si ing up igh , you will only measu e wha e e is abo e he de ice.  I you ha e i laying la , you will be able o measu e he ull plane o leng h ex ending beyond he bo om and op edges.  The e o e, i is bes o use his de ice sligh ly ele a ed and laying la .\n\n\nUsing i in his ashion has yielded some amazing esul s hus a .  While i is a e o his me e o i e when used p ope ly, when a \"spi i \" unde s ands how o igge he ala m you can ge con e sa ions ha can las upwa ds o an hou .  I ha e expe iences his only 6 imes in all he yea s I ha e in es iga ed.  Mos o he ime, his de ice yields a single ala m, o maybe wo, wi h no eal ime in e ac ion wi h ques ions.\n\n\nOn Tue, No 9, 2010 a 10:29 AM, Zack Widup w9sz.zack@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n I ha e a T i ield Na u al EMF me e . I does no espond o 60 Hz ields. The p oblem I ha e wi h i is ha i is oo da ned sensi i e. I egis e s he magne ic ield o he ea h in magne ic and combina ion mode and whene e I u n o mo e oo quickly, he me e licks. I I un i in elec ic ield mode i does no do his bu I'm always a aid o missing some hing, so I gene ally un i in combina ion mode.\n\n\n\nZackOn Tue, No 9, 2010 a 9:17 AM, Tim Woolwo h jwoolwo h@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n Like Zack said, nobody knows o su e.  The only hing ha we do know is ha he e is a co ela ion be ween spikes in EMF's and pa ano mal e en s.  I ha e used a ious me e s du ing GB sessions and he e is a co ela ion a imes, bu his has o be discoun ed solely because a adio uses pa o he EMF spec um.\n\n\n\n\nI is heo ized ha EMF measu emen s a e o be aken solely in DC cu en because i is na u al elec ici y.  So any EMF me e you ha e ha measu es AC is wo hless on an in es iga ion because i picks up man made elec ici y.  As o he ange, well ha is also specula i e a bes .  The mos cu en heo ies hold ha unde 30 Hz DC is whe e you will ind he mos pa ano mal ac i i y.  This is because he Del a, The a, Alpha, and Be a b ainwa es o a human a e all below 30 Hz.  This is whe e he Body Elec ic i es and consciousness is o med.  I we a e dealing wi h a con inua ion o consciousness, esul s a e mo e ap o be ound in his ange.  In e es ingly enough, he ea h ib a es in his same ange wi h 5 s anding wa es a o below 33Hz (Shuman Resonance), so i appea s ha he new age s a e igh when hey say we ib a e wi h he Ea h.\n\n\n\n\nBu , as always, no one knows o su e.  And no one knows i hese equencies ha e any hing o do wi h wha we ecei e in GBC.On Tue, No 9, 2010 a 5:10 AM, Ad iana Jones ad ianamjones@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n This has p obably al eady been discussed a hund ed imes o e by people building ghos boxes, bu ... wha 's he a e age em ange o ghos s... and would c ea ing sounds in ha em ange make i easie o he ghos s o communica e? And would i be possible o make hose sounds hea d somehow?"}