{"id": "19182", "subject": "Re: [EVP-ITC] Re: Question...", "author": "Zack Widup", "timestamp": "2010-11-10T04:36:52Z", "full_text": "The Trifield 100XE is a good all-around EMF meter. A lot of people use\nthem on ghost hunts. I&#39;ve borrowed one from a friend once in a while.\nYou should do fine with it.\n\nThe Natural EMF meter is supposed to be more sensitive to fields in a\nlower frequency range that are emitted by living things (or ghosts).\nIt is supposed to reduce sensitivity to the frequency used by house\nwiring, I believe, so this does not affect it so much.\n\nI think both are sensitive to the human range of fields.\n\nExperiment with it and have fun!\n\nZack\n\n\nOn 11/9/10, Adriana Jones &lt;adrianamjones@...&gt; wrote:\n&gt; Wow all this electronics stuff is so confusing for me, we just went out to\n&gt; the used books store, and I picked out a basic book on electronics  and\n&gt; electricity so I could start learning about this stuff, I feel so in the\n&gt; dark in this fascinating field.  We bought a cheapo emf meter for ghost\n&gt; hunting but then went on to invest in an expensive one after the cheap meter\n&gt; told us our house is emf polluted, so now we have a Trifield Model 100XE is\n&gt; that ok for ghost hunting or no?  Is it &quot;natural&quot; or just for electronics?\n&gt; I did notice that when standing with it then when I put my arm next to it\n&gt; the &quot;electric&quot; reading goes DOWN.  Does that mean it&#39;s sensitive to the\n&gt; human range?\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, Tim Woolworth &lt;tjwoolworth@...&gt; wrote:\n&gt;&gt;\n&gt;&gt; This device is misused by almost everybody!  This is because the manual\n&gt;&gt; sucks and the TV people use it wrong consistently.  To figure it out, I\n&gt;&gt; contacted the manufacturer a couple years back and this is what they told\n&gt;&gt; me.\n&gt;&gt;\n&gt;&gt; Always us the Trifield in Magnetic mode.  If the box is stable and there\n&gt;&gt; is\n&gt;&gt; no lightning, the box should not sound an alarm unless something\n&gt;&gt; paranormal\n&gt;&gt; is happening (or you move your digital recorder to close to it, magnetized\n&gt;&gt; speakers).  If you use electric or combination, you can, and will, pick up\n&gt;&gt; the body electric with every motion and may receive many false positives.\n&gt;&gt;  The meter should also never be used while walking because this too gives\n&gt;&gt; unreliable readings.  There is nothing worse than seeing some TV schmuck\n&gt;&gt; holding it in their hands and claiming something paranormal is going on\n&gt;&gt; because an alarm is sounding, never mind that the camera is right next to\n&gt;&gt; it\n&gt;&gt; emitting magnetism through the mic / internal speaker.\n&gt;&gt;\n&gt;&gt; Also, the name trifield is a misnomer.  It only has one plane of reading,\n&gt;&gt; not three!  The yellow one (AC) has three fields.  The natural trifield\n&gt;&gt; only\n&gt;&gt; measures the plane that extends from the top and bottom edges lengthwise\n&gt;&gt; from the devices.  So if you have the device sitting upright, you will\n&gt;&gt; only\n&gt;&gt; measure whatever is above the device.  If you have it laying flat, you\n&gt;&gt; will\n&gt;&gt; be able to measure the full plane of length extending beyond the bottom\n&gt;&gt; and\n&gt;&gt; top edges.  Therefore, it is best to use this device slightly elevated and\n&gt;&gt; laying flat.\n&gt;&gt;\n&gt;&gt; Using it in this fashion has yielded some amazing results thus far.  While\n&gt;&gt; it is rare for this meter to fire when used properly, when a &quot;spirit&quot;\n&gt;&gt; understands how to trigger the alarm you can get conversations that can\n&gt;&gt; last\n&gt;&gt; upwards of an hour.  I have experiences this only 6 times in all the years\n&gt;&gt; I\n&gt;&gt; have investigated.  Most of the time, this device yields a single alarm,\n&gt;&gt; or\n&gt;&gt; maybe two, with no real time interaction with questions.\n&gt;&gt;\n&gt;&gt; On Tue, Nov 9, 2010 at 10:29 AM, Zack Widup &lt;w9sz.zack@...&gt; wrote:\n&gt;&gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt; I have a Trifield Natural EMF meter. It does not respond to 60 Hz\n&gt;&gt; &gt; fields.\n&gt;&gt; &gt; The problem I have with it is that it is too darned sensitive. It\n&gt;&gt; &gt; registers\n&gt;&gt; &gt; the magnetic field of the earth in magnetic and combination mode and\n&gt;&gt; &gt; whenever I turn or move too quickly, the meter flicks. If I run it in\n&gt;&gt; &gt; electric field mode it does not do this but I&#39;m always afraid of missing\n&gt;&gt; &gt; something, so I generally run it in combination mode.\n&gt;&gt; &gt;\n&gt;&gt; &gt; Zack\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt; On Tue, Nov 9, 2010 at 9:17 AM, Tim Woolworth &lt;tjwoolworth@...&gt;wrote:\n&gt;&gt; &gt;\n&gt;&gt; &gt;&gt;\n&gt;&gt; &gt;&gt;\n&gt;&gt; &gt;&gt; Like Zack said, nobody knows for sure.  The only thing that we do know\n&gt;&gt; &gt;&gt; is\n&gt;&gt; &gt;&gt; that there is a correlation between spikes in EMF&#39;s and paranormal\n&gt;&gt; &gt;&gt; events.\n&gt;&gt; &gt;&gt;  I have used various meters during GB sessions and there is a\n&gt;&gt; &gt;&gt; correlation at\n&gt;&gt; &gt;&gt; times, but this has to be discounted solely because a radio uses part\n&gt;&gt; &gt;&gt; of the\n&gt;&gt; &gt;&gt; EMF spectrum.\n&gt;&gt; &gt;&gt;\n&gt;&gt; &gt;&gt; It is theorized that EMF measurements are to be taken solely in DC\n&gt;&gt; &gt;&gt; current\n&gt;&gt; &gt;&gt; because it is natural electricity.  So any EMF meter you have that\n&gt;&gt; &gt;&gt; measures\n&gt;&gt; &gt;&gt; AC is worthless on an investigation because it picks up man made\n&gt;&gt; &gt;&gt; electricity.  As for the range, well that is also speculative at best.\n&gt;&gt; &gt;&gt; The\n&gt;&gt; &gt;&gt; most current theories hold that under 30 Hz DC is where you will find\n&gt;&gt; &gt;&gt; the\n&gt;&gt; &gt;&gt; most paranormal activity.  This is because the Delta, Theta, Alpha, and\n&gt;&gt; &gt;&gt; Beta\n&gt;&gt; &gt;&gt; brainwaves of a human are all below 30 Hz.  This is where the Body\n&gt;&gt; &gt;&gt; Electric\n&gt;&gt; &gt;&gt; fires and consciousness is formed.  If we are dealing with a\n&gt;&gt; &gt;&gt; continuation of\n&gt;&gt; &gt;&gt; consciousness, results are more apt to be found in this range.\n&gt;&gt; &gt;&gt;  Interestingly enough, the earth vibrates in this same range with 5\n&gt;&gt; &gt;&gt; standing\n&gt;&gt; &gt;&gt; waves at or below 33Hz (Shuman Resonance), so it appears that the new\n&gt;&gt; &gt;&gt; agers\n&gt;&gt; &gt;&gt; are right when they say we vibrate with the Earth.\n&gt;&gt; &gt;&gt;\n&gt;&gt; &gt;&gt; But, as always, no one knows for sure.  And no one knows if these\n&gt;&gt; &gt;&gt; frequencies have anything to do with what we receive in GBC.\n&gt;&gt; &gt;&gt;\n&gt;&gt; &gt;&gt;\n&gt;&gt; &gt;&gt; On Tue, Nov 9, 2010 at 5:10 AM, Adriana Jones &lt;adrianamjones@...&gt;wrote:\n&gt;&gt; &gt;&gt;\n&gt;&gt; &gt;&gt;&gt;\n&gt;&gt; &gt;&gt;&gt;\n&gt;&gt; &gt;&gt;&gt; This has probably already been discussed a hundred times over by\n&gt;&gt; &gt;&gt;&gt; people\n&gt;&gt; &gt;&gt;&gt; building ghost boxes, but... what&#39;s the average emf range of ghosts...\n&gt;&gt; &gt;&gt;&gt; and\n&gt;&gt; &gt;&gt;&gt; would creating sounds in that emf range make it easier for the ghosts\n&gt;&gt; &gt;&gt;&gt; to\n&gt;&gt; &gt;&gt;&gt; communicate? And would it be possible to make those sounds heard\n&gt;&gt; &gt;&gt;&gt; somehow?\n&gt;&gt; &gt;&gt;&gt;\n&gt;&gt; &gt;&gt;&gt;\n&gt;&gt; &gt;&gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt;\n&gt;\n&gt;\n&gt;"}