{"id": "19192", "subject": "Re: [EVP-ITC] Re: Question...", "author": "cbreck elknet.net", "timestamp": "2010-11-11T17:30:25Z", "full_text": "I have a Mel 8704.  I love it!  Darn good tool to have....those pesky cold\nspots can be detected with the\ndegrees in C or F...as well as read out for emf...all backlit?!   Love,love,\nlove it!\n\nCarol B.\n\nOn Thu, Nov 11, 2010 at 9:29 AM, JanP &lt;janpassmore22@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Has anyone here ever used, or known someone who has used, a MEL-8704REM? I\n&gt; bought one recently, but have not had a chance to use it since I have\n&gt; resigned from the group I was investigating with. It was a little pricey\n&gt; (for me), and I&#39;d like to know if it&#39;s worth keeping or should I sell it and\n&gt; try one of these others that y&#39;all are talking about? Thanks,\n&gt;\n&gt; Jan\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, Zack Widup &lt;w9sz.zack@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; The Trifield 100XE is a good all-around EMF meter. A lot of people use\n&gt; &gt; them on ghost hunts. I&#39;ve borrowed one from a friend once in a while.\n&gt; &gt; You should do fine with it.\n&gt; &gt;\n&gt; &gt; The Natural EMF meter is supposed to be more sensitive to fields in a\n&gt; &gt; lower frequency range that are emitted by living things (or ghosts).\n&gt; &gt; It is supposed to reduce sensitivity to the frequency used by house\n&gt; &gt; wiring, I believe, so this does not affect it so much.\n&gt; &gt;\n&gt; &gt; I think both are sensitive to the human range of fields.\n&gt; &gt;\n&gt; &gt; Experiment with it and have fun!\n&gt; &gt;\n&gt; &gt; Zack\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; On 11/9/10, Adriana Jones adrianamjones@... wrote:\n&gt; &gt; &gt; Wow all this electronics stuff is so confusing for me, we just went out\n&gt; to\n&gt; &gt; &gt; the used books store, and I picked out a basic book on electronics and\n&gt; &gt; &gt; electricity so I could start learning about this stuff, I feel so in\n&gt; the\n&gt; &gt; &gt; dark in this fascinating field. We bought a cheapo emf meter for ghost\n&gt; &gt; &gt; hunting but then went on to invest in an expensive one after the cheap\n&gt; meter\n&gt; &gt; &gt; told us our house is emf polluted, so now we have a Trifield Model\n&gt; 100XE is\n&gt; &gt; &gt; that ok for ghost hunting or no? Is it &quot;natural&quot; or just for\n&gt; electronics?\n&gt; &gt; &gt; I did notice that when standing with it then when I put my arm next to\n&gt; it\n&gt; &gt; &gt; the &quot;electric&quot; reading goes DOWN. Does that mean it&#39;s sensitive to the\n&gt; &gt; &gt; human range?\n&gt; &gt; &gt;\n&gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com, Tim Woolworth tjwoolworth@ wrote:\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt; This device is misused by almost everybody! This is because the manual\n&gt; &gt; &gt;&gt; sucks and the TV people use it wrong consistently. To figure it out, I\n&gt; &gt; &gt;&gt; contacted the manufacturer a couple years back and this is what they\n&gt; told\n&gt; &gt; &gt;&gt; me.\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt; Always us the Trifield in Magnetic mode. If the box is stable and\n&gt; there\n&gt; &gt; &gt;&gt; is\n&gt; &gt; &gt;&gt; no lightning, the box should not sound an alarm unless something\n&gt; &gt; &gt;&gt; paranormal\n&gt; &gt; &gt;&gt; is happening (or you move your digital recorder to close to it,\n&gt; magnetized\n&gt; &gt; &gt;&gt; speakers). If you use electric or combination, you can, and will, pick\n&gt; up\n&gt; &gt; &gt;&gt; the body electric with every motion and may receive many false\n&gt; positives.\n&gt; &gt; &gt;&gt; The meter should also never be used while walking because this too\n&gt; gives\n&gt; &gt; &gt;&gt; unreliable readings. There is nothing worse than seeing some TV\n&gt; schmuck\n&gt; &gt; &gt;&gt; holding it in their hands and claiming something paranormal is going\n&gt; on\n&gt; &gt; &gt;&gt; because an alarm is sounding, never mind that the camera is right next\n&gt; to\n&gt; &gt; &gt;&gt; it\n&gt; &gt; &gt;&gt; emitting magnetism through the mic / internal speaker.\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt; Also, the name trifield is a misnomer. It only has one plane of\n&gt; reading,\n&gt; &gt; &gt;&gt; not three! The yellow one (AC) has three fields. The natural trifield\n&gt; &gt; &gt;&gt; only\n&gt; &gt; &gt;&gt; measures the plane that extends from the top and bottom edges\n&gt; lengthwise\n&gt; &gt; &gt;&gt; from the devices. So if you have the device sitting upright, you will\n&gt; &gt; &gt;&gt; only\n&gt; &gt; &gt;&gt; measure whatever is above the device. If you have it laying flat, you\n&gt; &gt; &gt;&gt; will\n&gt; &gt; &gt;&gt; be able to measure the full plane of length extending beyond the\n&gt; bottom\n&gt; &gt; &gt;&gt; and\n&gt; &gt; &gt;&gt; top edges. Therefore, it is best to use this device slightly elevated\n&gt; and\n&gt; &gt; &gt;&gt; laying flat.\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt; Using it in this fashion has yielded some amazing results thus far.\n&gt; While\n&gt; &gt; &gt;&gt; it is rare for this meter to fire when used properly, when a &quot;spirit&quot;\n&gt; &gt; &gt;&gt; understands how to trigger the alarm you can get conversations that\n&gt; can\n&gt; &gt; &gt;&gt; last\n&gt; &gt; &gt;&gt; upwards of an hour. I have experiences this only 6 times in all the\n&gt; years\n&gt; &gt; &gt;&gt; I\n&gt; &gt; &gt;&gt; have investigated. Most of the time, this device yields a single\n&gt; alarm,\n&gt; &gt; &gt;&gt; or\n&gt; &gt; &gt;&gt; maybe two, with no real time interaction with questions.\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt; On Tue, Nov 9, 2010 at 10:29 AM, Zack Widup w9sz.zack@ wrote:\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt; &gt;\n&gt; &gt; &gt;&gt; &gt;\n&gt; &gt; &gt;&gt; &gt; I have a Trifield Natural EMF meter. It does not respond to 60 Hz\n&gt; &gt; &gt;&gt; &gt; fields.\n&gt; &gt; &gt;&gt; &gt; The problem I have with it is that it is too darned sensitive. It\n&gt; &gt; &gt;&gt; &gt; registers\n&gt; &gt; &gt;&gt; &gt; the magnetic field of the earth in magnetic and combination mode and\n&gt; &gt; &gt;&gt; &gt; whenever I turn or move too quickly, the meter flicks. If I run it\n&gt; in\n&gt; &gt; &gt;&gt; &gt; electric field mode it does not do this but I&#39;m always afraid of\n&gt; missing\n&gt; &gt; &gt;&gt; &gt; something, so I generally run it in combination mode.\n&gt; &gt; &gt;&gt; &gt;\n&gt; &gt; &gt;&gt; &gt; Zack\n&gt; &gt; &gt;&gt; &gt;\n&gt; &gt; &gt;&gt; &gt;\n&gt; &gt; &gt;&gt; &gt; On Tue, Nov 9, 2010 at 9:17 AM, Tim Woolworth tjwoolworth@wrote:\n&gt; &gt; &gt;&gt; &gt;\n&gt; &gt; &gt;&gt; &gt;&gt;\n&gt; &gt; &gt;&gt; &gt;&gt;\n&gt; &gt; &gt;&gt; &gt;&gt; Like Zack said, nobody knows for sure. The only thing that we do\n&gt; know\n&gt; &gt; &gt;&gt; &gt;&gt; is\n&gt; &gt; &gt;&gt; &gt;&gt; that there is a correlation between spikes in EMF&#39;s and paranormal\n&gt; &gt; &gt;&gt; &gt;&gt; events.\n&gt; &gt; &gt;&gt; &gt;&gt; I have used various meters during GB sessions and there is a\n&gt; &gt; &gt;&gt; &gt;&gt; correlation at\n&gt; &gt; &gt;&gt; &gt;&gt; times, but this has to be discounted solely because a radio uses\n&gt; part\n&gt; &gt; &gt;&gt; &gt;&gt; of the\n&gt; &gt; &gt;&gt; &gt;&gt; EMF spectrum.\n&gt; &gt; &gt;&gt; &gt;&gt;\n&gt; &gt; &gt;&gt; &gt;&gt; It is theorized that EMF measurements are to be taken solely in DC\n&gt; &gt; &gt;&gt; &gt;&gt; current\n&gt; &gt; &gt;&gt; &gt;&gt; because it is natural electricity. So any EMF meter you have that\n&gt; &gt; &gt;&gt; &gt;&gt; measures\n&gt; &gt; &gt;&gt; &gt;&gt; AC is worthless on an investigation because it picks up man made\n&gt; &gt; &gt;&gt; &gt;&gt; electricity. As for the range, well that is also speculative at\n&gt; best.\n&gt; &gt; &gt;&gt; &gt;&gt; The\n&gt; &gt; &gt;&gt; &gt;&gt; most current theories hold that under 30 Hz DC is where you will\n&gt; find\n&gt; &gt; &gt;&gt; &gt;&gt; the\n&gt; &gt; &gt;&gt; &gt;&gt; most paranormal activity. This is because the Delta, Theta, Alpha,\n&gt; and\n&gt; &gt; &gt;&gt; &gt;&gt; Beta\n&gt; &gt; &gt;&gt; &gt;&gt; brainwaves of a human are all below 30 Hz. This is where the Body\n&gt; &gt; &gt;&gt; &gt;&gt; Electric\n&gt; &gt; &gt;&gt; &gt;&gt; fires and consciousness is formed. If we are dealing with a\n&gt; &gt; &gt;&gt; &gt;&gt; continuation of\n&gt; &gt; &gt;&gt; &gt;&gt; consciousness, results are more apt to be found in this range.\n&gt; &gt; &gt;&gt; &gt;&gt; Interestingly enough, the earth vibrates in this same range with 5\n&gt; &gt; &gt;&gt; &gt;&gt; standing\n&gt; &gt; &gt;&gt; &gt;&gt; waves at or below 33Hz (Shuman Resonance), so it appears that the\n&gt; new\n&gt; &gt; &gt;&gt; &gt;&gt; agers\n&gt; &gt; &gt;&gt; &gt;&gt; are right when they say we vibrate with the Earth.\n&gt; &gt; &gt;&gt; &gt;&gt;\n&gt; &gt; &gt;&gt; &gt;&gt; But, as always, no one knows for sure. And no one knows if these\n&gt; &gt; &gt;&gt; &gt;&gt; frequencies have anything to do with what we receive in GBC.\n&gt; &gt; &gt;&gt; &gt;&gt;\n&gt; &gt; &gt;&gt; &gt;&gt;\n&gt; &gt; &gt;&gt; &gt;&gt; On Tue, Nov 9, 2010 at 5:10 AM, Adriana Jones adrianamjones@wrote:\n&gt; &gt; &gt;&gt; &gt;&gt;\n&gt; &gt; &gt;&gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt; &gt;&gt;&gt; This has probably already been discussed a hundred times over by\n&gt; &gt; &gt;&gt; &gt;&gt;&gt; people\n&gt; &gt; &gt;&gt; &gt;&gt;&gt; building ghost boxes, but... what&#39;s the average emf range of\n&gt; ghosts...\n&gt; &gt; &gt;&gt; &gt;&gt;&gt; and\n&gt; &gt; &gt;&gt; &gt;&gt;&gt; would creating sounds in that emf range make it easier for the\n&gt; ghosts\n&gt; &gt; &gt;&gt; &gt;&gt;&gt; to\n&gt; &gt; &gt;&gt; &gt;&gt;&gt; communicate? And would it be possible to make those sounds heard\n&gt; &gt; &gt;&gt; &gt;&gt;&gt; somehow?\n&gt; &gt; &gt;&gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt; &gt;&gt;&gt;\n&gt; &gt; &gt;&gt; &gt;&gt;\n&gt; &gt; &gt;&gt; &gt;\n&gt; &gt; &gt;&gt; &gt;\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt; \n&gt;\n\nI ha e a Mel 8704.  I lo e i !  Da n good ool o ha e.... hose pesky cold spo s can be de ec ed wi h he \ndeg ees in C o F...as well as ead ou o em ...all backli ?!   Lo e,lo e, lo e i !\n \nCa ol B.\n \nOn Thu, No 11, 2010 a 9:29 AM, JanP janpassmo e22@...> w o e:\n\n  \n\n\n\n\nHas anyone he e e e used, o known someone who has used, a MEL-8704REM? I bough one ecen ly, bu ha e no had a chance o use i since I ha e esigned om he g oup I was in es iga ing wi h. I was a li le p icey ( o me), and I'd like o know i i 's wo h keeping o should I sell i and y one o hese o he s ha y'all a e alking abou ? Thanks,\n\nJan\n--- In EVP-ITC@yahoog oups.com, Zack Widup w o e:>> The T i ield 100XE is a good all-a ound EMF me e . A lo o people use\n> hem on ghos hun s. I' e bo owed one om a iend once in a while.> You should do ine wi h i .> > The Na u al EMF me e is supposed o be mo e sensi i e o ields in a> lowe equency ange ha a e emi ed by li ing hings (o ghos s).\n> I is supposed o educe sensi i i y o he equency used by house> wi ing, I belie e, so his does no a ec i so much.> > I hink bo h a e sensi i e o he human ange o ields.> \n> Expe imen wi h i and ha e un!> > Zack> > > On 11/9/10, Ad iana Jones ad ianamjones@... w o e:> > Wow all his elec onics s u is so con using o me, we jus wen ou o\n> > he used books s o e, and I picked ou a basic book on elec onics and> > elec ici y so I could s a lea ning abou his s u , I eel so in he> > da k in his ascina ing ield. We bough a cheapo em me e o ghos \n> > hun ing bu hen wen on o in es in an expensi e one a e he cheap me e > > old us ou house is em pollu ed, so now we ha e a T i ield Model 100XE is> > ha ok o ghos hun ing o no? Is i \"na u al\" o jus o elec onics?\n> > I did no ice ha when s anding wi h i hen when I pu my a m nex o i > > he \"elec ic\" eading goes DOWN. Does ha mean i 's sensi i e o he> > human ange?> >\n> > --- In EVP-ITC@yahoog oups.com, Tim Woolwo h jwoolwo h@ w o e:> >>> >> This de ice is misused by almos e e ybody! This is because he manual\n> >> sucks and he TV people use i w ong consis en ly. To igu e i ou , I> >> con ac ed he manu ac u e a couple yea s back and his is wha hey old> >> me.> >>> >> Always us he T i ield in Magne ic mode. I he box is s able and he e\n> >> is> >> no ligh ning, he box should no sound an ala m unless some hing> >> pa ano mal> >> is happening (o you mo e you digi al eco de o close o i , magne ized\n> >> speake s). I you use elec ic o combina ion, you can, and will, pick up> >> he body elec ic wi h e e y mo ion and may ecei e many alse posi i es.> >> The me e should also ne e be used while walking because his oo gi es\n> >> un eliable eadings. The e is no hing wo se han seeing some TV schmuck> >> holding i in hei hands and claiming some hing pa ano mal is going on> >> because an ala m is sounding, ne e mind ha he came a is igh nex o\n> >> i > >> emi ing magne ism h ough he mic / in e nal speake .> >>> >> Also, he name i ield is a misnome . I only has one plane o eading,> >> no h ee! The yellow one (AC) has h ee ields. The na u al i ield\n> >> only> >> measu es he plane ha ex ends om he op and bo om edges leng hwise> >> om he de ices. So i you ha e he de ice si ing up igh , you will> >> only\n> >> measu e wha e e is abo e he de ice. I you ha e i laying la , you> >> will> >> be able o measu e he ull plane o leng h ex ending beyond he bo om> >> and> >> op edges. The e o e, i is bes o use his de ice sligh ly ele a ed and\n> >> laying la .> >>> >> Using i in his ashion has yielded some amazing esul s hus a . While> >> i is a e o his me e o i e when used p ope ly, when a \"spi i \"\n> >> unde s ands how o igge he ala m you can ge con e sa ions ha can> >> las > >> upwa ds o an hou . I ha e expe iences his only 6 imes in all he yea s> >> I\n> >> ha e in es iga ed. Mos o he ime, his de ice yields a single ala m,> >> o > >> maybe wo, wi h no eal ime in e ac ion wi h ques ions.> >>> >> On Tue, No 9, 2010 a 10:29 AM, Zack Widup w9sz.zack@ w o e:\n> >>> >> >> >> >> >> > I ha e a T i ield Na u al EMF me e . I does no espond o 60 Hz> >> > ields.> >> > The p oblem I ha e wi h i is ha i is oo da ned sensi i e. I \n> >> > egis e s> >> > he magne ic ield o he ea h in magne ic and combina ion mode and> >> > whene e I u n o mo e oo quickly, he me e licks. I I un i in> >> > elec ic ield mode i does no do his bu I'm always a aid o missing\n> >> > some hing, so I gene ally un i in combina ion mode.> >> >> >> > Zack> >> >> >> >> >> > On Tue, No 9, 2010 a 9:17 AM, Tim Woolwo h jwoolwo h@w o e:\n> >> >> >> >>> >> >>> >> >> Like Zack said, nobody knows o su e. The only hing ha we do know> >> >> is> >> >> ha he e is a co ela ion be ween spikes in EMF's and pa ano mal\n> >> >> e en s.> >> >> I ha e used a ious me e s du ing GB sessions and he e is a> >> >> co ela ion a > >> >> imes, bu his has o be discoun ed solely because a adio uses pa \n> >> >> o he> >> >> EMF spec um.> >> >>> >> >> I is heo ized ha EMF measu emen s a e o be aken solely in DC> >> >> cu en \n> >> >> because i is na u al elec ici y. So any EMF me e you ha e ha > >> >> measu es> >> >> AC is wo hless on an in es iga ion because i picks up man made> >> >> elec ici y. As o he ange, well ha is also specula i e a bes .\n> >> >> The> >> >> mos cu en heo ies hold ha unde 30 Hz DC is whe e you will ind> >> >> he> >> >> mos pa ano mal ac i i y. This is because he Del a, The a, Alpha, and\n> >> >> Be a> >> >> b ainwa es o a human a e all below 30 Hz. This is whe e he Body> >> >> Elec ic> >> >> i es and consciousness is o med. I we a e dealing wi h a\n> >> >> con inua ion o > >> >> consciousness, esul s a e mo e ap o be ound in his ange.> >> >> In e es ingly enough, he ea h ib a es in his same ange wi h 5\n> >> >> s anding> >> >> wa es a o below 33Hz (Shuman Resonance), so i appea s ha he new> >> >> age s> >> >> a e igh when hey say we ib a e wi h he Ea h.\n> >> >>> >> >> Bu , as always, no one knows o su e. And no one knows i hese> >> >> equencies ha e any hing o do wi h wha we ecei e in GBC.> >> >>\n> >> >>> >> >> On Tue, No 9, 2010 a 5:10 AM, Ad iana Jones ad ianamjones@w o e:> >> >>> >> >>>> >> >>>> >> >>> This has p obably al eady been discussed a hund ed imes o e by\n> >> >>> people> >> >>> building ghos boxes, bu ... wha 's he a e age em ange o ghos s...> >> >>> and> >> >>> would c ea ing sounds in ha em ange make i easie o he ghos s\n> >> >>> o> >> >>> communica e? And would i be possible o make hose sounds hea d> >> >>> somehow?> >> >>>> >> >>>\n> >> >>> >> >> >> >> >>> >> >> >>"}