{"id": "1921", "subject": "Re: [EVP-ITC] 24---almost.", "author": "Frank Sumption", "timestamp": "2007-08-22T15:02:57Z", "full_text": "------=_NextPart_000_455f_616d_2d74\r\nContent-Type: text/plain; format=flowed\r\n\r\nThanks Joe! I have a bar antenna I&#39;m using now, and I think the main problem \nis I&#39;m trying to use too large of tuning cap, maybe the the varactor is even \nbad(?). Trying to resonate the antenna with the varactor is like feeding a \nshort, I get nothing. So far I have to put the bar antenna across the choke, \nshowin in the schematic for the LA1816. The choke provieds a DC path for the \nRF Vcc, I get nothing without it, but just putting a finger on the choke \nresults in good loud signals.\n\nThe bar has 30 turns #34 that is across the choke, and another 120 turns \nlike a primary, with one end grounded, and the other end just goes to a \nlonger wire. Just connecting the large end across the input results in less \nsignal. I got good clear signals late last night with this. The clarity of \nsome of the voices even surprises me.\n\nThen there&#39;s problems with a bad connection on the main board, and if I push \non the board, the audio clears up. I think I have it working well enough to \nshow the PCB design will work ok, so I can order the PCBs, which will \neliminate some of the problems. I added extra &quot;holes&quot; so there&#39;s alternate \nantenna connection possiblities, while leaving the original RF amp idea in \nplace.\n\nI do have antenna rods of various sizes in the junk box.\n\nLike I said, I ain&#39;t no engineer!\n\n\nFrank-S\n\n\n&gt;From: &quot;joseph a. cioppi, sr.&quot; &lt;joecioppi@...&gt;\n&gt;Reply-To: EVP-ITC@yahoogroups.com\n&gt;To: EVP-ITC@yahoogroups.com\n&gt;Subject: Re: [EVP-ITC] 24---almost.\n&gt;Date: Wed, 22 Aug 2007 10:15:18 -0400\n&gt;\n&gt;Hi Frank,\n&gt;\n&gt;I wonder if you have the small bar antenna I suggested awhile ago? That\n&gt;antenna has two coils and can be used in any way two windings on the same\n&gt;coil can be used. These antennae are resonated with parallel caps. I&#39;ve\n&gt;resonated two windings in series with a parallel varactor diode to get a\n&gt;high impedance tank circuit. Total series inductance 600uH, in parallel \n&gt;with\n&gt;100pf diode. The larger coil (500uH) can be resonated with 140pf tuning \n&gt;cap.\n&gt;These antennae are used without input windings because they rely on the\n&gt;concentration of flux in the ferrite core to gather radio signal.\n&gt;\n&gt;The long replacement rod antennas have two windings, one for AM MW\n&gt;(broadcast) and a smaller one for SW. These windings are separately\n&gt;resonated with  tuning caps on there respective bands.\n&gt;\n&gt;These antennae are not viewed as input transformers, but as signal \n&gt;gathering\n&gt;tank circuits. However, I believe they can also act as broadband magnetic\n&gt;loop antennae. In this mode they are not sharply tuned to each channel, but\n&gt;are meant to develop a broadband output. The characteristic impedance is\n&gt;high compared to the tuner input and might need matching for good results.\n&gt;\n&gt;I suggest the use of a grounded foil shield to reduce static pickup.\n&gt;\n&gt;Joe\n&gt;\n&gt;On 8/21/07, Frank Sumption &lt;franks-boxes@...&gt; wrote:\n&gt; &gt;\n&gt; &gt;   I can&#39;t get the antenna to work the way it&#39;s shown in the data sheet, \n&gt;I\n&gt; &gt; have\n&gt; &gt; a bar antenna with the smaller coil on the input, and one end of the\n&gt; &gt; larger\n&gt; &gt; side grounded, the other side goes to a 3 foot wire. ( for those \n&gt;familialr\n&gt; &gt;\n&gt; &gt; wiht AM antennas)\n&gt; &gt;\n&gt; &gt; There&#39;s a voice toward the end &quot;people save us&quot;, wonder if it&#39;s the\n&gt; &gt; miners?\n&gt; &gt;\n&gt; &gt; Frank-S\n&gt; &gt;\n&gt; &gt; __________________________________________________________\n&gt; &gt; Learn.Laugh.Share. Reallivemoms is right place!\n&gt; &gt; http://www.reallivemoms.com?ocid=TXT_TAGHM&loc=us\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n\n_________________________________________________________________\nLearn.Laugh.Share. Reallivemoms is right place! \nhttp://www.reallivemoms.com?ocid=TXT_TAGHM&loc=us\n\r\n------=_NextPart_000_455f_616d_2d74\r\nContent-Type: image/pjpeg; name=&quot;AntInput.JPG&quot;\r\nContent-Disposition: attachment; filename=&quot;AntInput.JPG&quot;\r\n\r\n[ Attachment content not displayed ]\r\n------=_NextPart_000_455f_616d_2d74--"}