{"id": "19232", "subject": "Re: Cool voice, too bad no one hears it.", "author": "Adriana Jones", "timestamp": "2010-11-20T09:40:24Z", "full_text": "Lol! You&#39;re not the only that&#39;s been questioning their sanity at times here lately... Some of the stuff I hear is just plain perplexing, and then it gets even more so when others say they don&#39;t hear it.\n\nI&#39;ve only discovered ghost box two months ago, and at first my husband and I took it to cemeteries, but the most interesting things I&#39;ve captured have been at home, I believe.  I plan to keep using it at various locations, but also at home.  At home I keep getting the strangest communications that sound as if there are people in various scenarios talking to each other, oblivious to my presence (places like shopping at a market, an auction, an ambulance scene, pilots in airplane - this is what I&#39;m inferring from what I&#39;m hearing).  So far I&#39;ve not been able to get validation from others of what I&#39;m hearing, but I keep thinking that something is there, and not just broadcast fragments.  Only time will tell if this is the case or not.  So far, it is still possible that I am wrong due to the fact that I have not amassed that many examples of it yet, and the simple fact that I&#39;m new to GBC and my ears are not trained... however, I would also be wrong to deny to myself what my ears are hearing... I spent enough of my life doing that, denying what I sense, just to fit in with others/society.  I&#39;m no longer into doing that, otherwise I wouldn&#39;t even be found on a forum like this :)\n\n--- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt; Thanks. I expect to see some vsriations, what bothers me is when most just hear a broadcast frags, then I have to question my sanity. \n&gt; \n&gt;  &quot;They&#39;ve&quot; called me Kiera since before the boxes, I heard &quot;Kiera, it&#39;s time to come home&quot; like telepathicaly in 2000. So I asked via EVPmaker who she was, and they said &quot;she&#39;s our Princess&quot;, and ever since they insist I was/am/will be her. Purple Princess Kiera. That much remains unchanged over the last ten years.\n&gt; \n&gt;  I don&#39;t use EVP as most, for ghost hunting, I use it for personal messages, and rarely go to haunted areas. So I&#39;m kinda put off by what of these ghost hunters do to and with boxes.\n&gt; \n&gt;  F-S\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Adriana Jones&quot; &lt;adrianamjones@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Yes the R is a rolling R and &quot;proving&quot; is high pitched... however just going on my own ears without any suggestions, it could also sound like &quot;hide keira&quot; or &quot;hi keira&quot;, and &quot;we&#39;re proving&quot; could also sound like &quot;improving&quot;.. either the sound file or the communication is not very clear... does it sound clearer than this in real life, or is the recorder pretty much capturing it as clearly as it can?\n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; &lt;purplealiengirl@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt;  So somebody does hear it? The r is rolling, kinda like in Spanish. (so I didn&#39;t know how to spell it)\n&gt; &gt; &gt; \n&gt; &gt; &gt;  F-S\n&gt; &gt; &gt; \n&gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;Adriana Jones&quot; &lt;adrianamjones@&gt; wrote:\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Wouldn&#39;t that be &quot;Keira&quot; like in the actress Keira Knightley?\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@&gt; wrote:\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt;  From Ouija Box 4. Check the pronunciation of Kiera, that is exactly what it\n&gt; &gt; &gt; &gt; &gt; is supposed to sound like and never coulds figure out how to spell that.\n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt;  F-S\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}