{"id": "19284", "subject": "Re: [EVP-ITC] One my first conversion boxes.", "author": "Frank Sumption", "timestamp": "2010-11-25T19:13:09Z", "full_text": "Many, maybe most of these &quot;digital&quot; radios are actually analog tuners that\nare voltage tuned. So instead of removing the tuner, as these are large\nboards, just add a sweep board. It&#39;s the same thing Hultay does. It has the\nadvange of much better sound, since you&#39;re using he amplifiers and speakers\nthat it was designed with. This also has the built in tape deck.\n\n The radio is kind of a crap shoot, as some are all digital, and the tuner\nis tuned with software, usually IC-to-IC(ICsquared) a language put out by\nPhilips. Some car tuners use this, and I even had a couple Arm Band radio\nthat are all digital tuning.\n\n F-S\n\n\n\nOn Thu, Nov 25, 2010 at 10:27 AM, Mvanah Maloti &lt;inyanga4@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;   Whoa.\n&gt;\n&gt; That&#39;s wild, Frank!\n&gt;\n&gt; I admit to having a very limited scope and knowledge of electronics in\n&gt; general and how these things are built and actually function specifically,\n&gt; but still, opening them up and showing us &quot;the works&quot; like this just boggles\n&gt; my mind.\n&gt;\n&gt; Thanks for doing what ya do, lol!\n&gt;\n&gt; Converting an AM/FM/Cassette/CD player is great. I like it, I like it.\n&gt;\n&gt; -Jerome\n&gt;\n&gt; --- On *Wed, 11/24/10, Frank Sumption &lt;purplealiengirl@...&gt;* wrote:\n&gt;\n&gt;\n&gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt; Subject: [EVP-ITC] One my first conversion boxes. [1 Attachment]\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com, RTSC@yahoogroups.com\n&gt; Date: Wednesday, November 24, 2010, 11:35 PM\n&gt;\n&gt;\n&gt;\n&gt;   AM/FM/Cassette/CD boom box. With an added board for linear, random and\n&gt; manual sweep, built 9/2008. It was sweeping out of band on FM, so I added a\n&gt; control to set the sweep limits on the back panel, and a linear rate control\n&gt; on the side.\n&gt;\n&gt;  F-S\n&gt;\n&gt; \n&gt;\n\nMany, maybe mos o hese \"digi al\" adios a e ac ually analog une s ha a e ol age uned. So ins ead o emo ing he une , as hese a e la ge boa ds, jus add a sweep boa d. I 's he same hing Hul ay does. I has he ad ange o much be e sound, since you' e using he ampli ie s and speake s ha i was designed wi h. This also has he buil in ape deck. \n\n \n The adio is kind o a c ap shoo , as some a e all digi al, and he une is uned wi h so wa e, usually IC- o-IC(ICsqua ed) a language pu ou by Philips. Some ca une s use his, and I e en had a couple A m Band adio ha a e all digi al uning. \n\n \n F-S\n \nOn Thu, No 25, 2010 a 10:27 AM, M anah Malo i inyanga4@...> w o e:\n\n  \n\n\n\n\n\n\n\n\nWhoa.\n \nTha 's wild, F ank!\n \nI admi o ha ing a e y limi ed scope and knowledge o elec onics in gene al and how hese hings a e buil and ac ually unc ion speci ically, bu s ill, opening hem up and showing us \" he wo ks\" like his jus boggles my mind. \n\n \nThanks o doing wha ya do, lol! \n \nCon e ing an AM/FM/Casse e/CD playe is g ea . I like i , I like i . \n \n-Je ome--- On Wed, 11/24/10, F ank Sump ion pu plealiengi l@gmail.com> w o e:\nF om: F ank Sump ion pu plealiengi l@...>Subjec : [EVP-ITC] One my i s con e sion boxes. [1 A achmen ] \nTo: EVP-ITC@yahoog oups.com, RTSC@yahoog oups.comDa e: Wednesday, No embe 24, 2010, 11:35 PM \n\n  \n\n\n AM/FM/Casse e/CD boom box. Wi h an added boa d o linea , andom and manual sweep, buil 9/2008. I was sweeping ou o band on FM, so I added a con ol o se he sweep limi s on he back panel, and a linea a e con ol on he side.\n\n \n F-S"}