{"id": "19299", "subject": "Re: [EVP-ITC] Re: The Audiovox booooooooombox", "author": "Frank Sumption", "timestamp": "2010-11-28T00:23:28Z", "full_text": "Thanks, not as good as the other boombox.\nF-s\n\nOn Sat, Nov 27, 2010 at 3:50 PM, tim_woolworth &lt;tjwoolworth@...&gt;wrote:\n\n&gt;\n&gt;\n&gt; Sounding good so far, Frank. You are right, the audio quality in these\n&gt; prefabbed boomboxes is superior.\n&gt;\n&gt; In the AM boost clip I hear:\n&gt;\n&gt; .03 hultay\n&gt; .07 find Tim\n&gt;\n&gt; The rest I believe is radio noise, especially Shanahan at the end. I am not\n&gt; sure what the first word said in this clip is though, it may be a message of\n&gt; sorts.\n&gt;\n&gt; In the first FM clip I hear:\n&gt;\n&gt; .03 alright\n&gt; .04 Fay\n&gt; .11 I don&#39;t tape record the one (not very clear, but this is what it sounds\n&gt; like to my ears)\n&gt;\n&gt; In the last FM clip I hear:\n&gt;\n&gt; .01 Getting called from me -or- Getting call from Dee\n&gt; .06 Help people\n&gt; .11 Right this hand (not very clear, but this is what it sounds like to my\n&gt; ears)\n&gt;\n&gt; Nice work as usual!\n&gt;\n&gt; Tim\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Frank Sumption\n&gt; &lt;purplealiengirl@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Just need a switch for the AM antenna amp. FM kinda noisy. &quot;PLL&quot;==phase\n&gt; &gt; locked loop. This one has a delay when fiorst turned on, or when the band\n&gt; is\n&gt; &gt; changed, it has to wait for the sweep to bottom out before the sound\n&gt; comes\n&gt; &gt; on.\n&gt; &gt;\n&gt; &gt; F-S\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nThanks, no as good as he o he boombox.\nF-s\nOn Sa , No 27, 2010 a 3:50 PM, im_woolwo h jwoolwo h@gmail.com> w o e:\n\n  \n\n\n\nSounding good so a , F ank. You a e igh , he audio quali y in hese p e abbed boomboxes is supe io .In he AM boos clip I hea :.03 hul ay.07 ind TimThe es I belie e is adio noise, especially Shanahan a he end. I am no su e wha he i s wo d said in his clip is hough, i may be a message o so s.\nIn he i s FM clip I hea :.03 al igh .04 Fay.11 I don' ape eco d he one (no e y clea , bu his is wha i sounds like o my ea s)In he las FM clip I hea :.01 Ge ing called om me -o - Ge ing call om Dee\n.06 Help people.11 Righ his hand (no e y clea , bu his is wha i sounds like o my ea s)Nice wo k as usual!Tim \n\n\n--- In EVP-ITC@yahoog oups.com, F ank Sump ion w o e:>> Jus need a swi ch o he AM an enna amp. FM kinda noisy. \"PLL\"==phase\n> locked loop. This one has a delay when io s u ned on, o when he band is> changed, i has o wai o he sweep o bo om ou be o e he sound comes> on.> > F-S>"}