{"id": "19320", "subject": "Re: [EVP-ITC] Another tuner--It&#39;s a Sony! [8 Attachments]", "author": "Frank Sumption", "timestamp": "2010-11-30T17:23:50Z", "full_text": "Okay then, this makes me step back and ask WTF? I think hear something,\npost what I thought I heard, then listen the next day, and it&#39;s nothing but\nbroadcast frags. In #6 now &quot;frank&#39;s ol&#39; lady---wormwood...&quot;, and 8, &quot;he&#39;s\ngot a good idea....&quot; Ya have to be able to ask, what if it is all just\nbrain? If no one in the world hears the same sutff, is it valid? and who\nthinks their hearing is so much more superior to anyone else&#39;s that they can\ntell what it really says. So far, these other experts seem to hear only\nfrags.  All I can figure is that we get enough to show others, and ourselves\nthat something is going on, but most of the communication is just using the\nsounds being used as a psychic prop--in the brain. It does not mean the\ncommunication is invalid, or what one hears false. It just means it&#39;s more\npersonal, and not provable. Round and round, till one finally breaks loose,\nand hits this wall. I find myself questioning this stuff more and more.\n\n I don&#39;t know what to think anymore, I came up with this braindead box idea,\nand it seems to work for everyone except me. I&#39;m thinkin&#39; I wasted my IT\ncareer for this crap.\n\nF-S\n\nOn Tue, Nov 30, 2010 at 12:00 AM, Frank Sumption\n&lt;purplealiengirl@...&gt;wrote:\n\n&gt;\n&gt;  [Attachment(s)&lt;https://mail.google.com/mail/?ui=2&view=js&name=main,tlist&ver=b1_WpQkzs8s.en.&am=!10dEyMHDV0SxhZ5ijtQ2BJKmLyOdKCgMTqG0rdjvFN8dECfogY-iKw&fri#12c9b951c7604807_TopText&gt;from Frank Sumption included below]\n&gt;\n&gt;  Had a Sony AM/FM/Cassette/CD boom box that I got two years ago for $3. I\n&gt; made a sweep board for it this afternoon, then found it had a seperate tuner\n&gt; board. So I liberated the tuner from the rest, and striped everything else\n&gt; for parts. It make primo box! This runs on six volts and takes a signal wire\n&gt; to change bands.\n&gt;\n&gt;  #6 starts out &quot;Is Hultay even---wormwood&quot;. #8 is cool &quot;I think that he\n&gt; videos this reciever&quot;, after that &quot;the alamo&#39;s on ten meter basement(?)&quot; teh\n&gt; 10 meter band is at 28 to 29.5 mhz, it&#39;s one of the ham bands. So is\n&gt; basement the bottom if 10 meters, at about 28.5Mhz if I remember right? Now\n&gt; that&#39;s a trip, cuz I was switching between AM and FM.\n&gt;\n&gt; F-S\n&gt;\n&gt; \n&gt;\n\nOkay hen, his makes me s ep back and ask WTF? I hink hea some hing, pos wha  I hough I hea d, hen lis en he nex day, and i 's no hing bu b oadcas ags. In #6 now \" ank's ol' lady---wo mwood...\", and 8, \"he's go a good idea....\" Ya ha e o be able o ask, wha i i is all jus b ain? I no one in he wo ld hea s he same su , is i alid? and who hinks hei hea ing is so much mo e supe io o anyone else's ha hey can ell wha i eally says. So a , hese o he expe s seem  o hea only ags.  All I can igu e is ha we ge enough o show o he s, and ou sel es ha some hing is going on, bu mos o he communica ion is jus using he sounds being used as a psychic p op--in he b ain. I does no mean he communica ion is in alid, o wha one hea s alse. I jus means i 's mo e pe sonal, and no p o able. Round and ound, ill one inally b eaks loose, and hi s his wall. I ind mysel ques ioning his s u mo e and mo e.  \n\n \n I don' know wha o hink anymo e, I came up wi h his b aindead box idea, and i seems  o wo k o e e yone excep me. I'm hinkin' I was ed my IT ca ee   o his c ap.  \n \nF-S\nOn Tue, No 30, 2010 a 12:00 AM, F ank Sump ion pu plealiengi l@...> w o e:\n\n  \n\n\n[A achmen (s) om F ank Sump ion included below] \n\n Had a Sony AM/FM/Casse e/CD boom box ha I go wo yea s ago o $3. I made a sweep boa d o i his a e noon, hen ound i had a sepe a e une boa d. So I libe a ed he une om he es , and s iped e e y hing else o pa s. I make p imo box! This uns on six ol s and akes a signal wi e o change bands. \n\n \n #6 s a s ou \"Is Hul ay e en---wo mwood\". #8 is cool \"I hink ha he ideos his ecie e \", a e ha \" he alamo's on en me e basemen (?)\" eh 10 me e band is a 28 o 29.5 mhz, i 's one o he ham bands. So is basemen he bo om i 10 me e s, a abou 28.5Mhz i I emembe igh ? Now ha 's a ip, cuz I was swi ching be ween AM and FM.\n\n \nF-S"}