{"id": "19322", "subject": "Re: Another tuner--It&#39;s a Sony!", "author": "purplespacefriend", "timestamp": "2010-11-30T19:54:56Z", "full_text": "Thanks. I know there is much to spirit communication, just wish I could actually prove it.\n\n f-s\n\n--- In EVP-ITC@yahoogroups.com, Mvanah Maloti &lt;inyanga4@...&gt; wrote:\n&gt;\n&gt; Frank, \n&gt;  \n&gt; Please don&#39;t. \n&gt;  \n&gt; I know that you probably hear it all the time (I hope you do, at least) and that it&#39;s hard to stomach...but your work IS great, it has immense value, helped transform an entire field of research and opened up the doors wide to future experimentation, expanding knowledge and various personal (psycho-spiritual-technological) advances. \n&gt;  \n&gt; Your continued questioning is a good thing and I certainly applaud your efforts used to gain a deeper understanding into what we do, how it works and just what the hell is going on here. \n&gt;  \n&gt; It&#39;s my personal feeling that &quot;psychic-prop&quot; is a spot on term for such things. In reality, I believe most who conduct GBC can/could communicate without such devices. It becomes a matter of training, experience and preference. Working with the GB has allowed my own intuitive, clairvoyant, clairaudient and clairsentient gifts to become more fully developed and that&#39;s not to mention the immense joy I and others have gained through this work and it is, in a very large way, because of YOU my friend. \n&gt;  \n&gt; I&#39;ve been feeling more and more lately that GBC does indeed happen, for the most part, in the user&#39;s brain. I believe that our unconscious self and subconscious mind has things it wishes to communicate to us at a conscious level. \n&gt;  \n&gt; With the box we get a never-ending supply of raw audio that our minds can use to &quot;realize&quot; (perceive) things that only makes sense to us, the individual operating the device and GB sessions. I think that what we find, hear and become receptive to during our sessions...all that we &quot;pick out&quot; of a recording are things the unconscious self wishes to make known to the conscious self. \n&gt;  \n&gt; The audio matrixing principle, phonological ambiguities and auditory un-clarities resulting doesn&#39;t take anything away from the information and messages which come through. We hear the parts, pieces and patterns that we&#39;re supposed to. The voices, messages and information that each of us is drawn to is, in some way, exactly what the subconscious mind wishes to communicate to us and we hear it just as we&#39;re supposed to. \n&gt;  \n&gt; Some people might perceive these messages as originating from spirit or ET&#39;s or &quot;The Great Field&quot;...whatever it is and by whichever name seems to &quot;fit&quot; and make the most sense to the individual. \n&gt;  \n&gt; I think in many ways that we are ALL right!\n&gt;  \n&gt; If all there is IS &quot;mind&quot;, thought, consciousness, light, energy and endless fields of pure information...if everything is connected by one quantum field, one Source of energy and one point of origin (The Big Bang, Intelligent Design, Divine Happenstance, a total fluke or whatever the case may be!) then I&#39;m far led to believe that our minds are connected to ALL of it and will continue to use whatever methods, mediums and forms are at our disposal to assist with that communication. \n&gt;  \n&gt; What you&#39;ve said here doesn&#39;t invalidate anything for me, personally. If anything your insights and frustrations make it more relevant...I just wish it wasn&#39;t all so taxing on you, Frank. \n&gt;  \n&gt; -Jerome\n&gt; \n&gt; \n&gt; --- On Tue, 11/30/10, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt; \n&gt; \n&gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt; Subject: Re: [EVP-ITC] Another tuner--It&#39;s a Sony!\n&gt; To: EVP-ITC@yahoogroups.com, RTSC@yahoogroups.com\n&gt; Date: Tuesday, November 30, 2010, 10:23 AM\n&gt; \n&gt; \n&gt;   \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;  Okay then, this makes me step back and ask WTF? I think hear something, post what I thought I heard, then listen the next day, and it&#39;s nothing but broadcast frags. In #6 now &quot;frank&#39;s ol&#39; lady---wormwood...&quot;, and 8, &quot;he&#39;s got a good idea....&quot; Ya have to be able to ask, what if it is all just brain? If no one in the world hears the same sutff, is it valid? and who thinks their hearing is so much more superior to anyone else&#39;s that they can tell what it really says. So far, these other experts seem to hear only frags.  All I can figure is that we get enough to show others, and ourselves that something is going on, but most of the communication is just using the sounds being used as a psychic prop--in the brain. It does not mean the communication is invalid, or what one hears false. It just means it&#39;s more personal, and not provable. Round and round, till one finally breaks loose, and hits this wall. I find myself questioning this stuff more and\n&gt;  more.  \n&gt;  \n&gt;  I don&#39;t know what to think anymore, I came up with this braindead box idea, and it seems to work for everyone except me. I&#39;m thinkin&#39; I wasted my IT career for this crap.  \n&gt;  \n&gt; F-S\n&gt; \n&gt; \n&gt; On Tue, Nov 30, 2010 at 12:00 AM, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt; \n&gt; \n&gt;   \n&gt; \n&gt; \n&gt; [Attachment(s) from Frank Sumption included below] \n&gt; \n&gt;  Had a Sony AM/FM/Cassette/CD boom box that I got two years ago for $3. I made a sweep board for it this afternoon, then found it had a seperate tuner board. So I liberated the tuner from the rest, and striped everything else for parts. It make primo box! This runs on six volts and takes a signal wire to change bands. \n&gt;  \n&gt;  #6 starts out &quot;Is Hultay even---wormwood&quot;. #8 is cool &quot;I think that he videos this reciever&quot;, after that &quot;the alamo&#39;s on ten meter basement(?)&quot; teh 10 meter band is at 28 to 29.5 mhz, it&#39;s one of the ham bands. So is basement the bottom if 10 meters, at about 28.5Mhz if I remember right? Now that&#39;s a trip, cuz I was switching between AM and FM.\n&gt;  \n&gt; F-S\n&gt;"}