{"id": "19334", "subject": "Re: [EVP-ITC] It&#39;s b-a-n-a-n-a-s!", "author": "Frank Sumption", "timestamp": "2010-12-01T04:48:40Z", "full_text": "I was doing reverse speech before EVP, and it works. Not only that, spirits\nand other entities talk backward too.  I had a reversing deck, but it broke\nin our move. You can record yourself, and reverse it, use it for psycho\nanalysis. We&#39;re dealing with mind, not brain, so this stuff is universal.\n\nF-S\n\nOn Tue, Nov 30, 2010 at 4:05 PM, Tim Woolworth &lt;tjwoolworth@...&gt;wrote:\n\n&gt;\n&gt;\n&gt; Don&#39;t know if you have heard of this guy, but John Oates has made a living\n&gt; claiming that reverse speech messages are the one way the unconscious cannot\n&gt; lie.  He also claims that reverse speech messages are almost always linked\n&gt; to the forward speech message.\n&gt;\n&gt; Some of his examples are quite intriguing, but I don&#39;t buy it fully yet.  I\n&gt; have recorded my own voice and played it backwards and got zilch.\n&gt;\n&gt; But, if there is some truth to it, maybe we should all be reversing some of\n&gt; our files from time to time just in case.  Wouldn&#39;t it be a startling find\n&gt; to have this be true not only of the living, but also in those who\n&gt; communicate through the box a well.\n&gt;\n&gt; http://www.reversespeech.com/Simple_Examples.htm\n&gt;\n&gt;  &lt;http://www.reversespeech.com/Simple_Examples.htm&gt;Tim\n&gt;\n&gt; On Tue, Nov 30, 2010 at 5:46 PM, Frank Sumption &lt;purplealiengirl@...\n&gt; &gt; wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;  [Attachment(s)&lt;https://mail.google.com/mail/?ui=2&view=js&name=main,tlist&ver=b1_WpQkzs8s.en.&am=!10dEyMHDV0SxhZ5ijtQ2BJKmLyOdKCgMTqG0rdjvFN8dECfogY-iKw&fri#12c9f0896c824766_12c9ef77032341cf_TopText&gt;from Frank Sumption included below]\n&gt;&gt;\n&gt;&gt; Just about yelling it now. Reversed &quot;cuz we&#39;re gonna make you a\n&gt;&gt; spirit--(or regret it-?)&quot;.  Maybe I hear/think/wanna believe too much.\n&gt;&gt;\n&gt;&gt; F-S\n&gt;&gt;\n&gt;&gt;\n&gt;  \n&gt;\n\nI was doing e e se speech be o e EVP, and i wo ks. No only ha , spi i s and o he en i ies alk backwa d oo.  I had a e e sing deck, bu i b oke in ou mo e. You can eco d you sel , and e e se i , use i o psycho analysis. We' e dealing wi h mind, no b ain, so his s u is uni e sal. \n\n \nF-S\nOn Tue, No 30, 2010 a 4:05 PM, Tim Woolwo h jwoolwo h@...> w o e:\n\n  \n\n\n\nDon' know i you ha e hea d o his guy, bu John Oa es has made a li ing claiming ha e e se speech messages a e he one way he unconscious canno lie.  He also claims ha e e se speech messages a e almos always linked o he o wa d speech message. \n\nSome o his examples a e qui e in iguing, bu I don' buy i ully ye .  I ha e eco ded my own oice and played i backwa ds and go zilch. \n\nBu , i he e is some u h o i , maybe we should all be e e sing some o ou iles om ime o ime jus in case.  Wouldn' i be a s a ling ind o ha e his be ue no only o he li ing, bu also in hose who communica e h ough he box a well.\n\n\nh p://www. e e sespeech.com/Simple_Examples.h m\n\nTim\nOn Tue, No 30, 2010 a 5:46 PM, F ank Sump ion pu plealiengi l@...> w o e:\n\n  \n\n\n[A achmen (s) om F ank Sump ion included below] \n\n\nJus abou yelling i now. Re e sed \"cuz we' e gonna make you a spi i --(o eg e i -?)\".  Maybe I hea / hink/wanna belie e  oo much. \n \nF-S"}