{"id": "19346", "subject": "Yeah, it can be advanced.", "author": "Frank Sumption", "timestamp": "2010-12-02T17:38:38Z", "full_text": "Dual supply, linear sweep, treble-bass filter, audio amps. *Tuner is a\nseparate board*, so this layout is not dependent on what tuner is available.\nMe thinks I am vastly underestimated. Cellphone camera--crappy! Dual\nsupply=it needs  + and - 12 volts to function. Two 12 volts supplies--two\n8-AA battery packs or two 12V gel cells, or NiMh packs--or what ever.\n\n BTW, I have a random sweep board too, the boards are designed to stack  :-)\nand no, I can&#39;t mass produce these either. But... 3 boards for $85 from\nExpressPCB, solder mask and silk screened, just add components and shake.\nThere&#39;s a few SMT resistors and caps, but that&#39;s pretty easy.  PBCs are\neasy, the only hold up is tuners. 1/8th watt resistors and standard caps can\nbe used in the tone section. I know, about impossible to see. Tuners are the\nproblem. Thios was designed to be used wiht car tuners, but any tuner will\nwork. There is a three input mixer section that combines the left and right\nstereo channels, and an AM channel from a seperate tuner if needed. But\nwait, there&#39;s more, it has the mic amp for the echo chamber as well. One\nwould have to supply all components, controls and switches. This is not a\nsimple project.\n\n Chris Moon&#39;s latest box is done with the PCBs and a RS Arm Band tuner, his\ndaughter&#39;s uses a car tuner with the same PCBs. It&#39;s two years old. Not the\nfirst printed boards I have done.\n\n I usually do perf board and point to point wiring to save money. I should\nbe doing kits or something.\n\n FYI, the tone control I found on the web, just so you are aware when some\none tries to bootleg the boards. Ripping off someone&#39;s designs may have\nconsequences-that&#39;s why I don&#39;t sell these, paying royalties reduces my\nlabor profit from 5 cents an hour to 2 cents an hour.\n\n The point is, *if you have tuners*, excess money, and want a spiffy looking\nbox, you can have PCBs made.\n\n Sooooo, at the risk of everyone wanting to order these----I can&#39;t take\norders for PCBs, I don&#39;t have the tuners, and I don&#39;t have the $$$$$$ extra\nfor boards.  The boxes I sold for very reduced prices at Rolling Hills is\nwhat financed these boards. I don&#39;t make any money on boxes, I barely get\nenough to buy parts, and labor? Forget about it.\n\nF-S\n\nDual supply, linea sweep, eble-bass il e , audio amps. Tune is a sepa a e boa d, so his layou is no dependen on wha une is a ailable. Me hinks I am as ly unde es ima ed. Cellphone came a--c appy! Dual supply=i needs  + and - 12 ol s o unc ion. Two 12 ol s supplies-- wo 8-AA ba e y packs o wo 12V gel cells, o NiMh packs--o wha e e . \n\n \n BTW, I ha e a andom sweep boa d oo, he boa ds a e designed o s ack  :-) and no, I can' mass p oduce hese ei he . Bu ... 3 boa ds o $85 om Exp essPCB, solde  mask and silk sc eened, jus add componen s and shake. The e's a ew SMT esis o s and caps, bu ha 's p e y easy.  PBCs a e easy, he only hold up is une s. 1/8 h wa esis o s and s anda d caps can be used in he one sec ion. I know, abou impossible o see. Tune s a e he p oblem. Thios was designed o be used wih ca une s, bu any une will wo k. The e is a h ee inpu mixe sec ion ha combines he le and igh s e eo channels, and an AM channel om a sepe a e une i needed. Bu wai , he e's mo e, i has he mic amp o he echo chambe as well. One would ha e o supply all componen s, con ols and swi ches. This is no a simple p ojec . \n\n \n Ch is Moon's la es box is done wi h he PCBs and a RS A m Band une , his daugh e 's uses a ca une wi h  he same PCBs. I 's wo yea s old. No he i s p in ed boa ds I ha e done. \n \n I usually do pe boa d and poin o poin wi ing o sa e money. I should be doing ki s o some hing. \n \n FYI, he one con ol I ound on he web, jus so you a e awa e when some one ies o boo leg he boa ds. Ripping o someone's designs may ha e consequences- ha 's why I don' sell hese, paying oyal ies educes my labo p o i om 5 cen s an hou o 2 cen s an hou .\n\n \n The poin is, i you ha e une s, excess money, and wan a spi y looking box, you can ha e PCBs made. \n \n Sooooo, a he isk o e e yone wan ing o o de hese----I can' ake o de s o PCBs, I don' ha e he une s, and I don' ha e he $$$$$$ ex a o boa ds.  The boxes I sold o e y educed p ices a Rolling Hills is wha inanced hese boa ds. I don' make any money on boxes, I ba ely ge enough o buy pa s, and labo ? Fo ge abou i . \n\n \nF-S"}