{"id": "1934", "subject": "Re: Curious!", "author": "Travis", "timestamp": "2007-08-23T21:09:51Z", "full_text": "Its very unfortunate, those people probably think that you will just \nkeep them if they were sent to you to fix or what have you. Which is \npretty dumb considering you gave it to them in the first place. I do \napplaud you though however for trying to at least advance \nparapsychology in what you are doing and freely supplying paranormal \ninvestigators with your tool/box.\n--- In EVP-ITC@yahoogroups.com, &quot;Frank Sumption&quot; &lt;franks-boxes@...&gt; \nwrote:\n&gt;\n&gt; Hey Frank-R;\n&gt; \n&gt; Yahoo marked your message as spam, and I can&#39;t go approve it from \nhere at \n&gt; work. But anyway, I don&#39;t know if I should name names, in an \nattempt to be a \n&gt; nicer bitch. I don&#39;t get it, I made the damn things, gave them \naway free, \n&gt; yet I can&#39;t be trusted to fix it, or at least verify the box works \nfor me. I \n&gt; think there may indeed be a limit, or at least a certain state of \nmind for \n&gt; users. So I guess these people are left with ugly little door \nstops? I tried \n&gt; to e-mail  but one e-mail came back, the other ignored,  so I&#39;m \nthinkin&#39; \n&gt; blocked maybe, which does not show they are anymore honest then \nthe user \n&gt; they all hate------without naming names. BTW-Steve&#39;s not one of \nthese \n&gt; people.\n&gt; \n&gt; \n&gt; This probably sounds vague, but they know who they are, and I \ndon&#39;t get a \n&gt; response any other way, so probably a mis-use of the group, sorta.\n&gt; \n&gt; \n&gt; I didn&#39;t realize just how crappy car tuners were until I got the \nhomebrew \n&gt; tuner working. I don&#39;t have anywhere near the static and noise in \nthe HB \n&gt; tuner.\n&gt; \n&gt; \n&gt;   Frank-S\n&gt; \n&gt; _________________________________________________________________\n&gt; A new home for Mom, no cleanup required. All starts here. \n&gt; http://www.reallivemoms.com?ocid=TXT_TAGHM&loc=us\n&gt;"}