{"id": "19379", "subject": "Re: Franks statement is true,", "author": "Adriana Jones", "timestamp": "2010-12-07T06:19:24Z", "full_text": "lol, you&#39;re prolly right!  I would completely dismiss the 2012 thing as another y2k hysteria if it wasn&#39;t for the fact that they say different cultures around the world all say something about 2012. And now again that could all be a lie and concoction, but then again how long could a lie like that last?  not sure... either way it&#39;s kinda interesting...\n\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  Everyone thinks they can just go hunting, there would be about three deer\n&gt; left in the whole country by December 22nd, 2012. On the 23rd, all the dogs\n&gt; would be gone, on the 24th, we&#39;d eat each other.\n&gt;  The whole warning thing is to get your head prepared for a sudden\n&gt; transition to spirit.\n&gt; \n&gt;  F-S\n&gt; \n&gt; On Mon, Dec 6, 2010 at 11:03 AM, Adriana Jones &lt;adrianamjones@...&gt;wrote:\n&gt; \n&gt; &gt;\n&gt; &gt;\n&gt; &gt; All I know about 2012 worth remembering is that different people say a\n&gt; &gt; bunch of different cultures all point toward something happening in 2012...\n&gt; &gt; ****if**** this is true, then that&#39;s some crazy-*** **it, indeed!! The other\n&gt; &gt; thing I heard about it is that nasa-confirmed the sun&#39;s going to be throwing\n&gt; &gt; some temper tantrums worse than usual.... personally, if it makes the power\n&gt; &gt; go out, I&#39;m all for it, our modern pace is way to fast, unnatural and\n&gt; &gt; stressful... as far as rioting and looting, I&#39;ll leave that to the idiots\n&gt; &gt; who still believe they can eat, drink and sleep money :) If I have to break\n&gt; &gt; my veganism at that point, I will be well justified in doing so, I&#39;ll be the\n&gt; &gt; first one out there hunting deer if I have to... and if a giant asteriod is\n&gt; &gt; supposed to land on my a** in 2012, then I&#39;m not even going to worry about\n&gt; &gt; it till then, lol!\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, SnowfireL@\n&gt; &gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; David the Tech, says, &quot;Frank is right!&quot; and that things may happen before\n&gt; &gt;\n&gt; &gt; &gt; 2012, and if we are drawn into war, we may not come out the winner.\n&gt; &gt; &gt; Frank Sumption said: &quot; I suggest y&#39;all do a little research into 2012,\n&gt; &gt; and\n&gt; &gt; &gt; try to get your\n&gt; &gt; &gt; &gt; &gt; spiritual houses in order.&quot; sf\n&gt; &gt; &gt;\n&gt; &gt;\n&gt; &gt;  \n&gt; &gt;\n&gt;"}