{"id": "19386", "subject": "What if it is true!??", "author": "Frank Sumption", "timestamp": "2010-12-09T17:27:07Z", "full_text": "http://www.examiner.com/ufo-in-canada/3-very-large-objects-space-flying-to-earth\n\n  Tim sent me this link.\n\n Either the giant comet, or The Princess&#39;s father coming back, aka Marduke.\nFor the the new comers, since I started EVP &quot;they&quot; call me their &quot;Purple\nPrincess&quot; and claim I&#39;m Marduke&#39;s daughter. Could be true, or just the\ncolllective subconcious of man, or who knows what other possible\nexplanation--besides just nuts. When I first started with the box, I would\nalso get images forming out of steam on the bathroom window, towels, and\nrugs. One of the first images was the face of Marduke with that curious\nwoven beard they seem to wear on the Sumerain tablets. That face stood up in\na rug right in front of me. well, more like at my feet.\n\nThe story gets pretty deep.\n http://home.tiscali.nl/gibbon/merduk-innana.htm\n\n Marduke is asscoiated with the winged planet aka Niburu, hence the wings in\nhis figures. Niburu is supposedly Planet X.\n\n\n My guys pronounce the name Mar-duke, as in Dukes of hazard.\n\n Yeah, nutzo. Maybe.\n\n\n\n F-S\n\nh p://www.examine .com/u o-in-canada/3- e y-la ge-objec s-space- lying- o-ea h\n \n  Tim sen me his link.\n \n Ei he he gian come , o The P incess's a he coming back, aka Ma duke. Fo he he new come s, since I s a ed EVP \" hey\" call me hei \"Pu ple P incess\" and claim I'm Ma duke's daugh e . Could be ue, o jus he colllec i e subconcious o man, o who knows wha o he possible explana ion--besides jus nu s. When I i s s a ed wi h he box, I would also ge images o ming ou o s eam on he ba h oom window, owels, and ugs. One o he i s images was he ace o Ma duke wi h ha cu ious wo en bea d hey seem o wea on he Sume ain able s. Tha ace s ood up in a ug igh in on o me. well, mo e like a my ee . \n\n \nThe s o y ge s p e y deep. \n h p://home. iscali.nl/gibbon/me duk-innana.h m\n \n Ma duke is asscoia ed wi h he winged plane aka Nibu u, hence he wings in his igu es. Nibu u is supposedly Plane X.\n \n \n My guys p onounce he name Ma -duke, as in Dukes o haza d. \n \n Yeah, nu zo. Maybe. \n \n \n \n F-S"}