{"id": "19407", "subject": "Re: [EVP-ITC] It&#39;s still mind numbing!", "author": "Frank Sumption", "timestamp": "2010-12-10T23:31:07Z", "full_text": "Thanks. I thnk they change the tapes as needed, since they know we&#39;ll be\nlistening.\n\n F-S\n\nOn Fri, Dec 10, 2010 at 4:17 PM, Mvanah Maloti &lt;inyanga4@yahoo.com&gt; wrote:\n\n&gt;\n&gt;\n&gt;   Very clear, Frank!\n&gt;\n&gt; The first (forward) file is undeniable. I&#39;m still wrapping my ears around\n&gt; the 2nd/reversed file.\n&gt;\n&gt; Funny how we can always seem to find things we missed from these\n&gt; recordings. I&#39;ve gone through a session half a dozen times (or more in some\n&gt; cases) and STILL find volumes of things I missed with every new review.\n&gt;\n&gt; I know we miss the vast majority of this stuff in real time/during the\n&gt; session & recording...but good hell!  ;)\n&gt;\n&gt; -J\n&gt;\n&gt; --- On *Fri, 12/10/10, Frank Sumption &lt;purplealiengirl@...&gt;* wrote:\n&gt;\n&gt;\n&gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt; Subject: [EVP-ITC] It&#39;s still mind numbing! [2 Attachments]\n&gt; To: EVP-ITC@yahoogroups.com, RTSC@yahoogroups.com\n&gt; Date: Friday, December 10, 2010, 4:12 PM\n&gt;\n&gt;\n&gt;\n&gt;   I go through these tapes usually two or three times, so Iwas gettign\n&gt; ready to do another session after this one, and making sure I was paste the\n&gt; end of that last recording, and heard this. I did not hear this one previous\n&gt; passes through the tape. It&#39;s mind numbing. I havben&#39;t been compressing\n&gt; these, hopin git&#39;s easier to hear.\n&gt;\n&gt;  F-S\n&gt;\n&gt; \n&gt;\n\nThanks. I hnk hey change he apes as needed, since hey know we'll be lis ening. \n \n F-S\nOn F i, Dec 10, 2010 a 4:17 PM, M anah Malo i inyanga4@...> w o e:\n\n  \n\n\n\n\n\n\n\n\nVe y clea , F ank!\n \nThe i s ( o wa d) ile is undeniable. I'm s ill w apping my ea s a ound he 2nd/ e e sed ile.\n \nFunny how we can always seem o ind hings we missed om hese eco dings. I' e gone h ough a session hal  a dozen imes (o mo e in some cases) and STILL  ind olumes o hings I missed wi h e e y new e iew. \n\n \nI know we miss he as majo i y o his s u in eal ime/du ing he session & eco ding...bu good hell!  ;)\n \n-J--- On F i, 12/10/10, F ank Sump ion pu plealiengi l@...> w o e:\nF om: F ank Sump ion pu plealiengi l@...>Subjec : [EVP-ITC] I 's s ill mind numbing! [2 A achmen s]\nTo: EVP-ITC@yahoog oups.com, RTSC@yahoog oups.comDa e: F iday, Decembe 10, 2010, 4:12 PM \n\n  \n\n\n I go h ough hese apes usually wo o h ee imes, so Iwas ge ign eady o do ano he session a e his one, and making su e I was pas e he end o ha las eco ding, and hea d his. I did no hea his one p e ious passes h ough he ape. I 's mind numbing. I ha ben' been comp essing hese, hopin gi 's easie o hea . \n\n \n F-S"}