{"id": "19419", "subject": "Re: [EVP-ITC] Anybody know the Ghost Adventures Guys?", "author": "Frank Sumption", "timestamp": "2010-12-11T08:40:56Z", "full_text": "Well, you&#39;re in luck! The guy that makes it just happens to be a\nmember--recall the discussion over the RT. I would expect the same\nreaction-- we do not know what we are talking about, even though every\nadvancement in the box is from this group.\n\n F-S\n\n\n\nOn Fri, Dec 10, 2010 at 9:32 PM, &lt;urkel23@aol.com&gt; wrote:\n\n&gt;\n&gt;\n&gt;\n&gt; I watched another great episode tonight at the Villasca Axe Murder house\n&gt; and it was a good show, but....\n&gt;\n&gt; It seems the main focus on their show is evp&#39;s and spirit communication,\n&gt; which is preferred for my taste.  But they are using the sb7 ghost box.\n&gt; That is the worst box to use for spirit communication, it gets poor\n&gt; reception and the sweep is horrible.  Any voices that could and do come\n&gt; through are drowned out by the unnecessary white noise incorporated into the\n&gt; sweep.\n&gt;\n&gt; I would like to get in touch with them and give them a quality ghost box to\n&gt; work with.\n&gt;\n&gt; So.....Does anybody know how i can get a hold of these guys?\n&gt;\n&gt; -Steve H.\n&gt;\n&gt;\n&gt;\n&gt; *Steve Hultay\n&gt; *www.keyportparanormal.com*\n&gt; http://tech.groups.yahoo.com/group/rtsc/\n&gt; www.stevehultay.com\n&gt; www.rtscresearch.org*\n&gt;\n&gt; \n&gt;\n\nWell, you' e in luck! The guy ha makes i jus happens o be a membe -- ecall he discussion o e he RT. I would expec he same eac ion-- we do no know wha we a e alking abou , e en hough e e y ad ancemen in he box is om his g oup. \n\n \n F-S\n \n \nOn F i, Dec 10, 2010 a 9:32 PM, u kel23@...> w o e:\n\n  \n\n\n\n\n \nI wa ched ano he g ea episode onigh a he Villasca Axe Mu de house and i was a good show, bu ....\n \nI seems he main ocus on hei show is e p's and spi i communica ion, which is p e e ed o my as e.  Bu hey a e using he sb7 ghos box.  Tha is he wo s box o use o spi i communica ion, i ge s poo ecep ion and he sweep is ho ible.  Any oices ha could and do come h ough a e d owned ou by he unnecessa y whi e noise inco po a ed in o he sweep.\n\n \nI would like o ge in ouch wi h hem and gi e hem a quali y ghos box o wo k wi h.\n \nSo.....Does anybody know how i can ge a hold o hese guys?\n \n-S e e H.\n \n \n \nS e e Hul aywww.keypo pa ano mal.com\nh p:// ech.g oups.yahoo.com/g oup/ sc/www.s e ehul ay.comwww. sc esea ch.o g"}