{"id": "19499", "subject": "Re: Full Spectrum Cameras", "author": "mllejade", "timestamp": "2010-12-14T06:50:04Z", "full_text": "Hello Ursula and Draiga,\n\nFrom my experience with all kinds of cameras, I say it&#39;s best to experiment.  On one of my experiments, I went to a purported haunted alley and took 4 different shots using 4 different cameras from the same angle, taking the photos one after the other within a minute&#39;s span.  The 4 cameras I used were:  1.  Moditronics&#39; so-called &quot;Full Spectrum&quot; (which I&#39;ve dubbed &quot;Duo-Spectrum&quot; because it only sees into the near UV and IR spectrums, excluding the visible spectrum altogether) and 2.  Moditronics &quot;Deep IR&quot; which only sees into the IR spectrum, excluding the visible and UV spectrums, 3. a &quot;Full Spectrum&quot; camera, which sees all 3 spectrums (i.e., UV, visible and IR) and 4. a regular digital point n&#39; shoot consumer camera.  The results were interesting.  In the pictures I shot with Moditronics&#39; Full (&quot;Duo&quot;) Spectrum camera and &quot;Deep IR&quot; camera, I got a face floating in a fire escape from the side of a building adjoining the alley; that face did not show up on neither the full spectrum camera nor on the point n&#39; shoot camera.  Interesting indeed.  I intend to carry on with more experiments of this type, i.e., shooting the same scene using multiple cameras with different capabilities.  BTW, as you may already know, the Moditronics camera takes stills as well as video, and it records onto SD cards.  \n\nUrsula, thanks for your review on the SpecterCam 3, which I&#39;ll definitely look into purchasing.  In the past I&#39;ve purchase accessories from the SpecterCam site and the site&#39;s owner is definitely very knowledgeable.  My philosophy is that we know so little about this research is that I may as well try it all (if I could afford it, that is).\n\nDraiga - if you decide to make videos with one of the SpecterCam cameras, and you want sound, be sure you also have a digital voice recorder running at the same time as DVR cameras record only images, and not sound.  Also, about Moditronics&#39; full spectrum and deep IR cameras, you&#39;ll need an external light source if you film at night since those cameras do not see into the visible spectrum and if it&#39;s a pitch black or very dark environment, they won&#39;t see anyhing without a light source.  However, they&#39;re perfect for daytime ghost hunting, which I do as well as night-time investigations (I don&#39;t believe that ghosts only come out and show themselves at night).\n\nHope that helps.  When I find time, I will post the photos from my alley experiment.\n\nSharon from SF\n\n\n\n--- In EVP-ITC@yahoogroups.com, Ursula Kalin &lt;kalinu@...&gt; wrote:\n&gt;\n&gt; well yeah the price is nice and everything... its not a full spectrum cam..if you read the information on the link where the spectrercam is sold it explain all of this...thats why people on paranormal show go with the brand i have..its the best..he has one for 150 or someting i think called spectrumcam 1 or something...what I&#39;m saying is something paying the least is not the best thing when it don&#39;t work...check out the spectercam web site he has camera at vary prices...\n&gt; \n&gt; --- On Mon, 12/13/10, draiga1 &lt;mail@...&gt; wrote:\n&gt; \n&gt; \n&gt; From: draiga1 &lt;mail@...&gt;\n&gt; Subject: [EVP-ITC] Re: Full Spectrum Cameras\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Monday, December 13, 2010, 11:14 AM\n&gt; \n&gt; \n&gt;   \n&gt; \n&gt; \n&gt; \n&gt; I am seriously considering it. The other one I&#39;m considering is the Moditronic Full Spectrum camera. It&#39;s more in our price range, and the apparition photos are awesome.\n&gt; http://www.moditronic.com\n&gt; \n&gt; I wonder if anyone here has had experience with one of these? \n&gt; \n&gt; ~Draiga\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Ursula Kalin &lt;kalinu@&gt; wrote:\n&gt; &gt;\n&gt; &gt; see thats what Im afraid of lol..thats why i was glad i found someone who was selling the protable dvr in the us lol...no problem for the help..I&#39;m excited for you..don&#39;t worry about it not being the 3 I hear any of the products are amazing...so your going with the spectercam 2 with dvr...I hear that was is awesome to--- &gt;\n&gt;"}