{"id": "19500", "subject": "Re: [EVP-ITC] Re: Full Spectrum Cameras", "author": "Ursula Kalin", "timestamp": "2010-12-14T07:03:47Z", "full_text": "--0-754413835-1292310227=:72746\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&quot;I don&#39;t believe that ghosts only come out and show themselves at night).&quot;\n=\r\n\nsooo true Sharon :) the spectercam3 has motion detection and the dvr I use=\r\n have a sd card record as well.also if there a section you don&#39;t want showi=\r\nng say a address you can blur that part out. Your right about the sound!...=\r\n\n=C2=A0\nawesome info Sharon! thank you :)\n=C2=A0\nthat&#39;s the amazing part ab=\r\nout the specter3 you don&#39;t need any light at all! I should get a commission=\r\n for selling them lol. But no really i can&#39;t say how impressed and everyone=\r\n who see it is..and these are some tech guys and don&#39;t impress very easy.\n\n=\r\n\n\n--- On Tue, 12/14/10, mllejade &lt;leongbabe@...&gt; wrote:\n\n\nFrom: mllejad=\r\ne &lt;leongbabe@...&gt;\nSubject: [EVP-ITC] Re: Full Spectrum Cameras\nTo: EVP-=\r\nITC@yahoogroups.com\nDate: Tuesday, December 14, 2010, 12:50 AM\n\n\n=C2=A0 \n\n\n=\r\n\nHello Ursula and Draiga,\n\nFrom my experience with all kinds of cameras, I =\r\nsay it&#39;s best to experiment. On one of my experiments, I went to a purporte=\r\nd haunted alley and took 4 different shots using 4 different cameras from t=\r\nhe same angle, taking the photos one after the other within a minute&#39;s span=\r\n. The 4 cameras I used were: 1. Moditronics&#39; so-called &quot;Full Spectrum&quot; (whi=\r\nch I&#39;ve dubbed &quot;Duo-Spectrum&quot; because it only sees into the near UV and IR =\r\nspectrums, excluding the visible spectrum altogether) and 2. Moditronics &quot;D=\r\neep IR&quot; which only sees into the IR spectrum, excluding the visible and UV =\r\nspectrums, 3. a &quot;Full Spectrum&quot; camera, which sees all 3 spectrums (i.e., U=\r\nV, visible and IR) and 4. a regular digital point n&#39; shoot consumer camera.=\r\n The results were interesting. In the pictures I shot with Moditronics&#39; Ful=\r\nl (&quot;Duo&quot;) Spectrum camera and &quot;Deep IR&quot; camera, I got a face floating in a =\r\nfire escape from the side of a building adjoining the alley; that face did =\r\nnot show up on\n neither the full spectrum camera nor on the point n&#39; shoot =\r\ncamera. Interesting indeed. I intend to carry on with more experiments of t=\r\nhis type, i.e., shooting the same scene using multiple cameras with differe=\r\nnt capabilities. BTW, as you may already know, the Moditronics camera takes=\r\n stills as well as video, and it records onto SD cards. \n\nUrsula, thanks fo=\r\nr your review on the SpecterCam 3, which I&#39;ll definitely look into purchasi=\r\nng. In the past I&#39;ve purchase accessories from the SpecterCam site and the =\r\nsite&#39;s owner is definitely very knowledgeable. My philosophy is that we kno=\r\nw so little about this research is that I may as well try it all (if I coul=\r\nd afford it, that is).\n\nDraiga - if you decide to make videos with one of t=\r\nhe SpecterCam cameras, and you want sound, be sure you also have a digital =\r\nvoice recorder running at the same time as DVR cameras record only images, =\r\nand not sound. Also, about Moditronics&#39; full spectrum and deep IR cameras, =\r\nyou&#39;ll need an external light source if you film at night since those camer=\r\nas do not see into the visible spectrum and if it&#39;s a pitch black or very d=\r\nark environment, they won&#39;t see anyhing without a light source. However, th=\r\ney&#39;re perfect for daytime ghost hunting, which I do as well as night-time i=\r\nnvestigations (I don&#39;t believe that ghosts only come out and show themselve=\r\ns at night).\n\nHope that helps. When I find time, I will post the photos fro=\r\nm my alley experiment.\n\nSharon from SF\n\n--- In EVP-ITC@yahoogroups.com, Urs=\r\nula Kalin &lt;kalinu@...&gt; wrote:\n&gt;\n&gt; well yeah the price is nice and everythin=\r\ng... its not a full spectrum cam..if you read the information on the link w=\r\nhere the spectrercam is sold it explain all of this...thats why people on p=\r\naranormal show go with the brand i have..its the best..he has one for 150 o=\r\nr someting i think called spectrumcam 1 or something...what I&#39;m saying is s=\r\nomething paying the least is not the best thing when it don&#39;t work...check =\r\nout the spectercam web site he has camera at vary prices...\n&gt; \n&gt; --- On Mon=\r\n, 12/13/10, draiga1 &lt;mail@...&gt; wrote:\n&gt; \n&gt; \n&gt; From: draiga1 &lt;mail@...&gt;\n&gt; Su=\r\nbject: [EVP-ITC] Re: Full Spectrum Cameras\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; =\r\nDate: Monday, December 13, 2010, 11:14 AM\n&gt; \n&gt; \n&gt; =C3=82=C2=A0 \n&gt; \n&gt; \n&gt; \n&gt; =\r\nI am seriously considering it. The other one I&#39;m considering is the Moditro=\r\nnic Full Spectrum camera. It&#39;s more in our price range, and the apparition =\r\nphotos are awesome.\n&gt; http://www.moditronic.com\n&gt; \n&gt; I wonder if anyone her=\r\ne has had experience with one of these? \n&gt; \n&gt; ~Draiga\n&gt; \n&gt; --- In EVP-ITC@y=\r\nahoogroups.com, Ursula Kalin &lt;kalinu@&gt; wrote:\n&gt; &gt;\n&gt; &gt; see thats what Im afr=\r\naid of lol..thats why i was glad i found someone who was selling the protab=\r\nle dvr in the us lol...no problem for the help..I&#39;m excited for you..don&#39;t =\r\nworry about it not being the 3 I hear any of the products are amazing...so =\r\nyour going with the spectercam 2 with dvr...I hear that was is awesome to--=\r\n- &gt;\n&gt;\n\n\n\n\n\n\n\r\n--0-754413835-1292310227=:72746\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;DIV&gt;&lt;FONT size=3D4&gt;&quot;I don&#39;t believe that gho=\r\nsts only come out and show themselves at night).&quot;&lt;BR&gt;&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FO=\r\nNT size=3D4&gt;sooo true Sharon :) the spectercam3 has motion detection and th=\r\ne dvr I use have a sd card record as well.also if there a section you don&#39;t=\r\n want showing say a address you can blur that part out. Your right about th=\r\ne sound!...&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D4&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT=\r\n size=3D4&gt;awesome info Sharon! thank you :)&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D=\r\n4&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D4&gt;that&#39;s the amazing part about the=\r\n specter3 you don&#39;t need any light at all! I should get a commission for se=\r\nlling them lol. But no really i can&#39;t say how impressed and everyone who se=\r\ne it is..and these are some tech guys and don&#39;t impress very easy.&lt;/DIV&gt;\n&lt;D=\r\nIV&gt;&lt;BR&gt;&lt;/FONT&gt;&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Tue, 12/14/10, &lt;SPAN&gt;mllejade&lt;/SPAN&gt; &lt;I&gt;&lt=\r\n;leongbabe@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;&lt;/DIV&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER=\r\n-LEFT: rgb(16,16,255) 2px solid; PADDING-LEFT: 5px; MARGIN-LEFT: 5px&quot;&gt;&lt;BR&gt;F=\r\nrom: mllejade &lt;leongbabe@...&gt;&lt;BR&gt;Subject: [EVP-ITC] Re: Full Spec=\r\ntrum Cameras&lt;BR&gt;To: EVP-ITC@yahoogroups.com&lt;BR&gt;Date: Tuesday, December 14, =\r\n2010, 12:50 AM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3Dyiv1166661392&gt;&lt;SPAN style=3D&quot;DISPLAY: none=\r\n&quot;&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV id=3Dyiv1166661392ygrp-text&gt;\n&lt;DIV&gt;Hello Ursula and Dr=\r\naiga,&lt;BR&gt;&lt;BR&gt;From my experience with all kinds of cameras, I say it&#39;s best =\r\nto experiment. On one of my experiments, I went to a purported haunted alle=\r\ny and took 4 different shots using 4 different cameras from the same angle,=\r\n taking the photos one after the other within a minute&#39;s span. The 4 camera=\r\ns I used were: 1. Moditronics&#39; so-called &quot;Full Spectrum&quot; (which I&#39;ve dubbed=\r\n &quot;Duo-Spectrum&quot; because it only sees into the near UV and IR spectrums, exc=\r\nluding the visible spectrum altogether) and 2. Moditronics &quot;Deep IR&quot; which =\r\nonly sees into the IR spectrum, excluding the visible and UV spectrums, 3. =\r\na &quot;Full Spectrum&quot; camera, which sees all 3 spectrums (i.e., UV, visible and=\r\n IR) and 4. a regular digital point n&#39; shoot consumer camera. The results w=\r\nere interesting. In the pictures I shot with Moditronics&#39; Full (&quot;Duo&quot;) Spec=\r\ntrum camera and &quot;Deep IR&quot; camera, I got a face floating in a fire escape fr=\r\nom the side of a building adjoining the\n alley; that face did not show up o=\r\nn neither the full spectrum camera nor on the point n&#39; shoot camera. Intere=\r\nsting indeed. I intend to carry on with more experiments of this type, i.e.=\r\n, shooting the same scene using multiple cameras with different capabilitie=\r\ns. BTW, as you may already know, the Moditronics camera takes stills as wel=\r\nl as video, and it records onto SD cards. &lt;BR&gt;&lt;BR&gt;Ursula, thanks for your r=\r\neview on the SpecterCam 3, which I&#39;ll definitely look into purchasing. In t=\r\nhe past I&#39;ve purchase accessories from the SpecterCam site and the site&#39;s o=\r\nwner is definitely very knowledgeable. My philosophy is that we know so lit=\r\ntle about this research is that I may as well try it all (if I could afford=\r\n it, that is).&lt;BR&gt;&lt;BR&gt;Draiga - if you decide to make videos with one of the=\r\n SpecterCam cameras, and you want sound, be sure you also have a digital vo=\r\nice recorder running at the same time as DVR cameras record only images, an=\r\nd not sound. Also, about\n Moditronics&#39; full spectrum and deep IR cameras, y=\r\nou&#39;ll need an external light source if you film at night since those camera=\r\ns do not see into the visible spectrum and if it&#39;s a pitch black or very da=\r\nrk environment, they won&#39;t see anyhing without a light source. However, the=\r\ny&#39;re perfect for daytime ghost hunting, which I do as well as night-time in=\r\nvestigations (I don&#39;t believe that ghosts only come out and show themselves=\r\n at night).&lt;BR&gt;&lt;BR&gt;Hope that helps. When I find time, I will post the photo=\r\ns from my alley experiment.&lt;BR&gt;&lt;BR&gt;Sharon from SF&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=3D&quot;=\r\nhttp://us.mc1807.mail.yahoo.com/mc/compose?to=3DEVP-ITC%40yahoogroups.com&quot; =\r\nrel=3Dnofollow target=3D_blank ymailto=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot;=\r\n&gt;EVP-ITC@yahoogroups.com&lt;/A&gt;, Ursula Kalin &lt;kalinu@...&gt; wrote:&lt;BR&gt;&gt=\r\n;&lt;BR&gt;&gt; well yeah the price is nice and everything... its not a full spec=\r\ntrum cam..if you read the information on the link where the spectrercam is =\r\nsold it explain all of\n this...thats why people on paranormal show go with =\r\nthe brand i have..its the best..he has one for 150 or someting i think call=\r\ned spectrumcam 1 or something...what I&#39;m saying is something paying the lea=\r\nst is not the best thing when it don&#39;t work...check out the spectercam web =\r\nsite he has camera at vary prices...&lt;BR&gt;&gt; &lt;BR&gt;&gt; --- On Mon, 12/13/10,=\r\n draiga1 &lt;mail@...&gt; wrote:&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; From: draiga1 &l=\r\nt;mail@...&gt;&lt;BR&gt;&gt; Subject: [EVP-ITC] Re: Full Spectrum Cameras&lt;BR&gt;&gt;=\r\n To: &lt;A href=3D&quot;http://us.mc1807.mail.yahoo.com/mc/compose?to=3DEVP-ITC%40y=\r\nahoogroups.com&quot; rel=3Dnofollow target=3D_blank ymailto=3D&quot;mailto:EVP-ITC%40=\r\nyahoogroups.com&quot;&gt;EVP-ITC@yahoogroups.com&lt;/A&gt;&lt;BR&gt;&gt; Date: Monday, December=\r\n 13, 2010, 11:14 AM&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; =C3=82&nbsp; &lt;BR&gt;&gt; &lt;BR&gt;&gt=\r\n; &lt;BR&gt;&gt; &lt;BR&gt;&gt; I am seriously considering it. The other one I&#39;m consid=\r\nering is the Moditronic Full Spectrum camera. It&#39;s more in our price range,=\r\n and the apparition photos are\n awesome.&lt;BR&gt;&gt; &lt;A href=3D&quot;http://www.modi=\r\ntronic.com/&quot; rel=3Dnofollow target=3D_blank&gt;http://www.moditronic.com&lt;/A&gt;&lt;B=\r\nR&gt;&gt; &lt;BR&gt;&gt; I wonder if anyone here has had experience with one of thes=\r\ne? &lt;BR&gt;&gt; &lt;BR&gt;&gt; ~Draiga&lt;BR&gt;&gt; &lt;BR&gt;&gt; --- In &lt;A href=3D&quot;http://us.m=\r\nc1807.mail.yahoo.com/mc/compose?to=3DEVP-ITC%40yahoogroups.com&quot; rel=3Dnofol=\r\nlow target=3D_blank ymailto=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@ya=\r\nhoogroups.com&lt;/A&gt;, Ursula Kalin &lt;kalinu@&gt; wrote:&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt;=\r\n &gt; see thats what Im afraid of lol..thats why i was glad i found someone=\r\n who was selling the protable dvr in the us lol...no problem for the help..=\r\nI&#39;m excited for you..don&#39;t worry about it not being the 3 I hear any of the=\r\n products are amazing...so your going with the spectercam 2 with dvr...I he=\r\nar that was is awesome to--- &gt;&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQ=\r\nUOTE&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;\r\n--0-754413835-1292310227=:72746--"}