{"id": "19512", "subject": "Re: I&#39;m just curious..where do you conduct your Ghost box sessions?", "author": "Adriana Jones", "timestamp": "2010-12-15T01:11:49Z", "full_text": "I also agree, I didn&#39;t think of that aspect, that using the box away from home also means making more friends...\n\n--- In EVP-ITC@yahoogroups.com, Ursula Kalin &lt;kalinu@...&gt; wrote:\n&gt;\n&gt; I like what you said Tim and I agree :)\n&gt; \n&gt; --- On Tue, 12/14/10, Tim Woolworth &lt;tjwoolworth@...&gt; wrote:\n&gt; \n&gt; \n&gt; From: Tim Woolworth &lt;tjwoolworth@...&gt;\n&gt; Subject: Re: [EVP-ITC] Re: I&#39;m just curious..where do you conduct your Ghost box sessions?\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Tuesday, December 14, 2010, 4:49 PM\n&gt; \n&gt; \n&gt;   \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; I agree that the voices come to you in your home, I think we can all agree on that.\n&gt; \n&gt; \n&gt; As a ghost hunter, locations allow you access to voices that would otherwise never find you.  I am not sure why this is, but it seems that the spirits like to hang around certain areas.  I know that radius has nothing to do with it because I have been on hunts hundreds of miles from my house and I get the same voices I have at home.  I have also been on hunts far from my home where I met someone new on the other side that was there again when I turned my box on at the house!\n&gt; \n&gt; \n&gt; I love the idea of doing GBC at home and I try to get in at least 2 sessions a week.  But, going to a location has its perks too.  You can find out names and historical facts that you wouldn&#39;t know otherwise.  If you go to a place it seems like you announce yourself to a new group of people when you turn on your box, and you never know, those people might stick with you for a while.\n&gt; \n&gt; \n&gt; It has always puzzled me how they recognize me when I am on no matter where I am.  One of the greatest pieces of evidence we can gather is having the same voice communicate with you in different parts of the country.\n&gt; \n&gt; \n&gt; As it has been stated before, you can use a box anywhere there is a radio station and you&#39;ll get something.  But, the more places you travel too, the more access you have to a growing chorus of voices.\n&gt; \n&gt; \n&gt; Tim\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; On Tue, Dec 14, 2010 at 5:39 PM, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt; \n&gt; \n&gt;   \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Yeah, about 99%.\n&gt;  \n&gt; F-\n&gt; \n&gt; \n&gt; \n&gt; On Tue, Dec 14, 2010 at 3:35 PM, Ursula Kalin &lt;kalinu@...&gt; wrote:\n&gt; \n&gt; \n&gt;   \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; very true Frank...so do you do  it mostly in your home ?..your sessions that is.\n&gt; \n&gt; --- On Tue, 12/14/10, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt; \n&gt; \n&gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt; Subject: Re: [EVP-ITC] Re: I&#39;m just curious..where do you conduct your Ghost box sessions?\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Tuesday, December 14, 2010, 4:05 PM \n&gt; \n&gt; \n&gt; \n&gt;   \n&gt; \n&gt; \n&gt;  I, as a rule, don&#39;t go to haunted locations. For one thing, don&#39;t like that creepy walking through spider web feeling at some of these places.  Second, spirits and entities travel, they will come to you. \n&gt;  \n&gt; F-S \n&gt; \n&gt; \n&gt; On Tue, Dec 14, 2010 at 12:48 AM, Adriana Jones &lt;adrianamjones@...&gt; wrote:\n&gt; \n&gt; \n&gt;   \n&gt; \n&gt; \n&gt; \n&gt; For me its mainly at home, because I&#39;m a homebody I love home... and the added bonus with that is that you get to see how amazing the ghost box is even when you&#39;re not in &quot;haunted&quot; locations. The most calls for help I&#39;ve ever gotten have been just sitting at home on my bed... it&#39;s just simply amazing. My sessions are one to two times a week... \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Ursula&quot; &lt;kalinu@&gt; wrote:\n&gt; &gt;\n&gt; &gt; I was just wondering weather it be in your home in the park etc? and how often..\n&gt; &gt;\n&gt;"}