{"id": "19510", "subject": "Re: [EVP-ITC] Re: I&#39;m just curious..where do you conduct your Ghost box sessions?", "author": "Tim Woolworth", "timestamp": "2010-12-14T22:49:17Z", "full_text": "I agree that the voices come to you in your home, I think we can all agree\non that.\n\nAs a ghost hunter, locations allow you access to voices that would otherwise\nnever find you.  I am not sure why this is, but it seems that the spirits\nlike to hang around certain areas.  I know that radius has nothing to do\nwith it because I have been on hunts hundreds of miles from my house and I\nget the same voices I have at home.  I have also been on hunts far from my\nhome where I met someone new on the other side that was there again when I\nturned my box on at the house!\n\nI love the idea of doing GBC at home and I try to get in at least 2 sessions\na week.  But, going to a location has its perks too.  You can find out names\nand historical facts that you wouldn&#39;t know otherwise.  If you go to a place\nit seems like you announce yourself to a new group of people when you turn\non your box, and you never know, those people might stick with you for a\nwhile.\n\nIt has always puzzled me how they recognize me when I am on no matter where\nI am.  One of the greatest pieces of evidence we can gather is having the\nsame voice communicate with you in different parts of the country.\n\nAs it has been stated before, you can use a box anywhere there is a radio\nstation and you&#39;ll get something.  But, the more places you travel too, the\nmore access you have to a growing chorus of voices.\n\nTim\n\n\nOn Tue, Dec 14, 2010 at 5:39 PM, Frank Sumption\n&lt;purplealiengirl@...&gt;wrote:\n\n&gt;\n&gt;\n&gt; Yeah, about 99%.\n&gt;\n&gt; F-\n&gt;\n&gt; On Tue, Dec 14, 2010 at 3:35 PM, Ursula Kalin &lt;kalinu@...&gt;wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;   very true Frank...so do you do  it mostly in your home ?..your sessions\n&gt;&gt; that is.\n&gt;&gt;\n&gt;&gt; --- On *Tue, 12/14/10, Frank Sumption &lt;purplealiengirl@...&gt;* wrote:\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; From: Frank Sumption &lt;purplealiengirl@gmail.com&gt;\n&gt;&gt; Subject: Re: [EVP-ITC] Re: I&#39;m just curious..where do you conduct your\n&gt;&gt; Ghost box sessions?\n&gt;&gt; To: EVP-ITC@yahoogroups.com\n&gt;&gt; Date: Tuesday, December 14, 2010, 4:05 PM\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;   I, as a rule, don&#39;t go to haunted locations. For one thing, don&#39;t like\n&gt;&gt; that creepy walking through spider web feeling at some of these places.\n&gt;&gt; Second, spirits and entities travel, they will come to you.\n&gt;&gt;\n&gt;&gt; F-S\n&gt;&gt;\n&gt;&gt; On Tue, Dec 14, 2010 at 12:48 AM, Adriana Jones &lt;adrianamjones@...&lt;http://us.mc1807.mail.yahoo.com/mc/compose?to=adrianamjones@...&gt;\n&gt;&gt; &gt; wrote:\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;  For me its mainly at home, because I&#39;m a homebody I love home... and the\n&gt;&gt; added bonus with that is that you get to see how amazing the ghost box is\n&gt;&gt; even when you&#39;re not in &quot;haunted&quot; locations. The most calls for help I&#39;ve\n&gt;&gt; ever gotten have been just sitting at home on my bed... it&#39;s just simply\n&gt;&gt; amazing. My sessions are one to two times a week...\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; --- In EVP-ITC@yahoogroups.com&lt;http://us.mc1807.mail.yahoo.com/mc/compose?to=EVP-ITC%40yahoogroups.com&gt;,\n&gt;&gt; &quot;Ursula&quot; &lt;kalinu@...&gt; wrote:\n&gt;&gt; &gt;\n&gt;&gt; &gt; I was just wondering weather it be in your home in the park etc? and how\n&gt;&gt; often..\n&gt;&gt; &gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;  \n&gt;\n\nI ag ee ha he oices come o you in you home, I hink we can all ag ee on ha .As a ghos hun e , loca ions allow you access o oices ha would o he wise ne e ind you.  I am no su e why his is, bu i seems ha he spi i s like o hang a ound ce ain a eas.  I know ha adius has no hing o do wi h i because I ha e been on hun s hund eds o miles om my house and I ge he same oices I ha e a home.  I ha e also been on hun s a om my home whe e I me someone new on he o he side ha was he e again when I u ned my box on a he house!\nI lo e he idea o doing GBC a home and I y o ge in a leas 2 sessions a week.  Bu , going o a loca ion has i s pe ks oo.  You can ind ou names and his o ical ac s ha you wouldn' know o he wise.  I you go o a place i seems like you announce you sel o a new g oup o people when you u n on you box, and you ne e know, hose people migh s ick wi h you o a while.\nI has always puzzled me how hey ecognize me when I am on no ma e whe e I am.  One o he g ea es pieces o e idence we can ga he is ha ing he same oice communica e wi h you in di e en pa s o he coun y.\nAs i has been s a ed be o e, you can use a box anywhe e he e is a adio s a ion and you'll ge some hing.  Bu , he mo e places you a el oo, he mo e access you ha e o a g owing cho us o oices.\nTimOn Tue, Dec 14, 2010 a 5:39 PM, F ank Sump ion pu plealiengi l@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n Yeah, abou 99%.\n \nF-\nOn Tue, Dec 14, 2010 a 3:35 PM, U sula Kalin kalinu@...> w o e:\n\n  \n\n\n\n\n\n\n\n e y ue F ank...so do you do  i mos ly in you home ?..you sessions ha is.--- On Tue, 12/14/10, F ank Sump ion pu plealiengi l@...> w o e:\n\n\nF om: F ank Sump ion pu plealiengi l@...>Subjec : Re: [EVP-ITC] Re: I'm jus cu ious..whe e do you conduc you Ghos box sessions?\n\nTo: EVP-ITC@yahoog oups.comDa e: Tuesday, Decembe 14, 2010, 4:05 PM \n\n  \n\n\n I, as a ule, don' go o haun ed loca ions. Fo one hing, don' like ha c eepy walking h ough spide web eeling a some o hese places.  Second, spi i s and en i ies a el, hey will come o you. \n\n\n \nF-S \nOn Tue, Dec 14, 2010 a 12:48 AM, Ad iana Jones ad ianamjones@yahoo.com> w o e:\n\n\n\n  \n\n\n\nFo me i s mainly a home, because I'm a homebody I lo e home... and he added bonus wi h ha is ha you ge o see how amazing he ghos box is e en when you' e no in \"haun ed\" loca ions. The mos calls o help I' e e e go en ha e been jus si ing a home on my bed... i 's jus simply amazing. My sessions a e one o wo imes a week... \n--- In EVP-ITC@yahoog oups.com, \"U sula\" w o e:>> I was jus wonde ing wea he i be in you home in he pa k e c? and how o en..\n\n>"}