{"id": "19525", "subject": "Re: [EVP-ITC] Re: Full Spectrum Cameras", "author": "Ursula Kalin", "timestamp": "2010-12-15T18:24:01Z", "full_text": "--0-1690243032-1292437441=:32799\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nwell clearly I&#39;m alittle bias...but if you ask around anyone will tell it i=\r\ns not a full spectrum camera,it does have it good point but spectercam is r=\r\neally the only full spec camera without paying a arm and a leg. I was recom=\r\nmened the cam by Andy from the other group and he works i some sort of engi=\r\nneer. But I can only suggest.So I hope your happy with your choice. The spe=\r\ncterCam is has motion censer. They work on a SD card from your DVR..so that=\r\ns no big deal what matter is weather it is trully a full specter cam. I was=\r\n going with that brand myself until I researched the product..I never Jump =\r\nabd buy anything without checking out reviews and such.Your going to need a=\r\nnother like source with this.&quot;Moditronics&#39; so-called &quot;Full Spectrum&quot; (which=\r\n I&#39;ve dubbed &quot;Duo-Spectrum&quot; because it only sees into the near UV and IR sp=\r\nectrums&quot;Please make sure you understand what sharon is saying...this is NOT=\r\n a full spectrum cam...if your happy with that go for it :). You\n will get =\r\nbetter result with a full spectrum...and if you can get one why settle for =\r\nless. But thats just the sorta person i am.\n\n--- On Wed, 12/15/10, draiga1 =\r\n&lt;mail@...&gt; wrote:\n\n\nFrom: draiga1 &lt;mail@...&gt;\n=\r\nSubject: [EVP-ITC] Re: Full Spectrum Cameras\nTo: EVP-ITC@yahoogroups.com\nDa=\r\nte: Wednesday, December 15, 2010, 12:11 PM\n\n\n=C2=A0 \n\n\n\nThank you so much, =\r\nSharon. I was hoping someone had the moditronics camera too. It sounds like=\r\n it works great for what I want. I appreciate you sharing your results with=\r\n it.\n\nThanks!\nDraiga\n\n--- In EVP-ITC@yahoogroups.com, &quot;mllejade&quot; &lt;leongbabe=\r\n@...&gt; wrote:\n&gt;\n&gt; Hello Ursula and Draiga,\n&gt; \n&gt; From my experience with all =\r\nkinds of cameras, I say it&#39;s best to experiment. On one of my experiments, =\r\nI went to a purported haunted alley and took 4 different shots using 4 diff=\r\nerent cameras from the same angle, taking the photos one after the other wi=\r\nthin a minute&#39;s span. The 4 cameras I used were: 1. Moditronics&#39; so-called =\r\n&quot;Full Spectrum&quot; (which I&#39;ve dubbed &quot;Duo-Spectrum&quot; because it only sees into=\r\n the near UV and IR spectrums, excluding the visible spectrum altogether) a=\r\nnd 2. Moditronics &quot;Deep IR&quot; which only sees into the IR spectrum, excluding=\r\n the visible and UV spectrums, 3. a &quot;Full Spectrum&quot; camera, which sees all =\r\n3 spectrums (i.e., UV, visible and IR) and 4. a regular digital point n&#39; sh=\r\noot consumer camera. The results were interesting. In the pictures I shot w=\r\nith Moditronics&#39; Full (&quot;Duo&quot;) Spectrum camera and &quot;Deep IR&quot; camera, I got a=\r\n face floating in a fire escape from the side of a building adjoining the a=\r\nlley; that face did not show up on\n neither the full spectrum camera nor on=\r\n the point n&#39; shoot camera. Interesting indeed. I intend to carry on with m=\r\nore experiments of this type, i.e., shooting the same scene using multiple =\r\ncameras with different capabilities. BTW, as you may already know, the Modi=\r\ntronics camera takes stills as well as video, and it records onto SD cards.=\r\n \n&gt; \n&gt; Ursula, thanks for your review on the SpecterCam 3, which I&#39;ll defin=\r\nitely look into purchasing. In the past I&#39;ve purchase accessories from the =\r\nSpecterCam site and the site&#39;s owner is definitely very knowledgeable. My p=\r\nhilosophy is that we know so little about this research is that I may as we=\r\nll try it all (if I could afford it, that is).\n&gt; \n&gt; Draiga - if you decide =\r\nto make videos with one of the SpecterCam cameras, and you want sound, be s=\r\nure you also have a digital voice recorder running at the same time as DVR =\r\ncameras record only images, and not sound. Also, about Moditronics&#39; full sp=\r\nectrum and deep IR cameras, you&#39;ll need an external light source if you fil=\r\nm at night since those cameras do not see into the visible spectrum and if =\r\nit&#39;s a pitch black or very dark environment, they won&#39;t see anyhing without=\r\n a light source. However, they&#39;re perfect for daytime ghost hunting, which =\r\nI do as well as night-time investigations (I don&#39;t believe that ghosts only=\r\n come out and show themselves at night).\n&gt; \n&gt; Hope that helps. When I find =\r\ntime, I will post the photos from my alley experiment.\n&gt; \n&gt; Sharon from SF\n=\r\n&gt; \n&gt; \n\n\n\n\n\n\n\r\n--0-1690243032-1292437441=:32799\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;FONT size=3D4&gt;well clearly I&#39;m alittle bias.=\r\n..but if you ask around anyone will tell it is not a full spectrum camera,i=\r\nt does have it good point but spectercam is really the only full spec camer=\r\na without paying a arm and a leg. I was recommened the cam by Andy from the=\r\n other group and he works i some sort of engineer. But I can only suggest.S=\r\no I hope your happy with your choice. The specterCam is has motion censer. =\r\nThey work on a SD card from your DVR..so thats no big deal what matter is w=\r\neather it is trully a full specter cam. I was going with that brand myself =\r\nuntil I researched the product..I never Jump abd buy anything without check=\r\ning out reviews and such.Your going to need another like source with this.&quot;=\r\n&lt;FONT color=3D#ff007f&gt;Moditronics&#39; so-called &quot;Full Spectrum&quot; (which I&#39;ve du=\r\nbbed &quot;Duo-Spectrum&quot; because it only sees into the near UV and IR\n spectrums=\r\n&quot;&lt;/FONT&gt;&lt;FONT color=3D#000000&gt;Please make sure you understand what sharon i=\r\ns saying...this is NOT a full spectrum cam...if your happy with that go for=\r\n it :). You will get better result with a full spectrum...and if you can ge=\r\nt one why settle for less. But thats just the sorta person i am.&lt;/FONT&gt;&lt;/FO=\r\nNT&gt;&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Wed, 12/15/10, draiga1 &lt;I&gt;&lt;mail@...&=\r\ngt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: rgb(16,16,255) 2px=\r\n solid; PADDING-LEFT: 5px; MARGIN-LEFT: 5px&quot;&gt;&lt;BR&gt;From: draiga1 &lt;mail@mys=\r\nticcauldron.com&gt;&lt;BR&gt;Subject: [EVP-ITC] Re: Full Spectrum Cameras&lt;BR&gt;To: =\r\nEVP-ITC@yahoogroups.com&lt;BR&gt;Date: Wednesday, December 15, 2010, 12:11 PM&lt;BR&gt;=\r\n&lt;BR&gt;\n&lt;DIV id=3Dyiv1618562230&gt;&lt;SPAN style=3D&quot;DISPLAY: none&quot;&gt;&nbsp;&lt;/SPAN&gt; \n&lt;=\r\nDIV id=3Dyiv1618562230ygrp-text&gt;\n&lt;DIV&gt;Thank you so much, Sharon. I was hopi=\r\nng someone had the moditronics camera too. It sounds like it works great fo=\r\nr what I want. I appreciate you sharing your results with it.&lt;BR&gt;&lt;BR&gt;Thanks=\r\n!&lt;BR&gt;Draiga&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=3D&quot;http://us.mc1807.mail.yahoo.com/mc/com=\r\npose?to=3DEVP-ITC%40yahoogroups.com&quot; rel=3Dnofollow target=3D_blank ymailto=\r\n=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups.com&lt;/A&gt;, &quot;mllejad=\r\ne&quot; &lt;leongbabe@...&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; Hello Ursula and Draiga,&lt;BR=\r\n&gt;&gt; &lt;BR&gt;&gt; From my experience with all kinds of cameras, I say it&#39;s bes=\r\nt to experiment. On one of my experiments, I went to a purported haunted al=\r\nley and took 4 different shots using 4 different cameras from the same angl=\r\ne, taking the photos one after the other within a minute&#39;s span. The 4 came=\r\nras I used were: 1. Moditronics&#39; so-called &quot;Full Spectrum&quot; (which I&#39;ve dubb=\r\ned &quot;Duo-Spectrum&quot; because it only sees into the near UV and IR spectrums, e=\r\nxcluding the visible spectrum\n altogether) and 2. Moditronics &quot;Deep IR&quot; whi=\r\nch only sees into the IR spectrum, excluding the visible and UV spectrums, =\r\n3. a &quot;Full Spectrum&quot; camera, which sees all 3 spectrums (i.e., UV, visible =\r\nand IR) and 4. a regular digital point n&#39; shoot consumer camera. The result=\r\ns were interesting. In the pictures I shot with Moditronics&#39; Full (&quot;Duo&quot;) S=\r\npectrum camera and &quot;Deep IR&quot; camera, I got a face floating in a fire escape=\r\n from the side of a building adjoining the alley; that face did not show up=\r\n on neither the full spectrum camera nor on the point n&#39; shoot camera. Inte=\r\nresting indeed. I intend to carry on with more experiments of this type, i.=\r\ne., shooting the same scene using multiple cameras with different capabilit=\r\nies. BTW, as you may already know, the Moditronics camera takes stills as w=\r\nell as video, and it records onto SD cards. &lt;BR&gt;&gt; &lt;BR&gt;&gt; Ursula, thank=\r\ns for your review on the SpecterCam 3, which I&#39;ll definitely look into purc=\r\nhasing. In the past\n I&#39;ve purchase accessories from the SpecterCam site and=\r\n the site&#39;s owner is definitely very knowledgeable. My philosophy is that w=\r\ne know so little about this research is that I may as well try it all (if I=\r\n could afford it, that is).&lt;BR&gt;&gt; &lt;BR&gt;&gt; Draiga - if you decide to make=\r\n videos with one of the SpecterCam cameras, and you want sound, be sure you=\r\n also have a digital voice recorder running at the same time as DVR cameras=\r\n record only images, and not sound. Also, about Moditronics&#39; full spectrum =\r\nand deep IR cameras, you&#39;ll need an external light source if you film at ni=\r\nght since those cameras do not see into the visible spectrum and if it&#39;s a =\r\npitch black or very dark environment, they won&#39;t see anyhing without a ligh=\r\nt source. However, they&#39;re perfect for daytime ghost hunting, which I do as=\r\n well as night-time investigations (I don&#39;t believe that ghosts only come o=\r\nut and show themselves at night).&lt;BR&gt;&gt; &lt;BR&gt;&gt; Hope that helps. When I =\r\nfind time, I\n will post the photos from my alley experiment.&lt;BR&gt;&gt; &lt;BR&gt;&g=\r\nt; Sharon from SF&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;=\r\n/td&gt;&lt;/tr&gt;&lt;/table&gt;\r\n--0-1690243032-1292437441=:32799--"}