{"id": "19539", "subject": "Re: [EVP-ITC] Re: Full Spectrum Cameras (Moditronics)", "author": "Ursula Kalin", "timestamp": "2010-12-17T01:48:50Z", "full_text": "--0-152124138-1292550530=:8393\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nwooo have you tryed the spectercam 3? I assure you it is not low anything..=\r\n..you don&#39;t need extra light or anything. you can use it as is. and it IS f=\r\null spectrum\n\n--- On Thu, 12/16/10, Country &lt;countrybumpkin1956@...&gt; =\r\nwrote:\n\n\nFrom: Country &lt;countrybumpkin1956@...&gt;\nSubject: [EVP-ITC] Re=\r\n: Full Spectrum Cameras (Moditronics)\nTo: EVP-ITC@yahoogroups.com\nDate: Thu=\r\nrsday, December 16, 2010, 7:34 PM\n\n\n=C2=A0 \n\n\n\nHello....\nI, too, have a Mod=\r\nitronics UV/IR Full Spectrum HD Camcorder and a Moditronics Deep IR Still C=\r\namera (made by SVP). I agree that the camcorder is incorrectly named as it =\r\nis not full spectrum. It is the UV and IR fields I am interested in anyway.=\r\n\n\nBoth are made from low quality, in my opinion, cameras. But whatever the =\r\ntechnology this company uses in their units is very good, and I have yet to=\r\n see it duplicated. Their deep IR still camera will not pick up dust orbs, =\r\nfor example. When you get an orb on the still camera, chances are it is som=\r\nething...they are often self illuminating, solid or near solid white, often=\r\n have a tail. I have also gotten very, very few orbs using this camera as w=\r\nell.\n\nI did buy this same SVP camera but modified by a different equipment =\r\nsupplier on the internet. It does show every dust orb there is, the picture=\r\n quality is a bit blurry or fuzzy many times. I was very disappointed.\n\nOne=\r\n thing about the SVP still camera is if you drop it, even once, you will ha=\r\nve a broken SD card slot. I was sold one on Ebay from someone who knew the =\r\nSD card was broken and never revealed it. Some research showed me what the =\r\npossible reason was...it cannot take a drop. So handle it with care. Their =\r\npacking slip even says they will not warrant the camera against drops. But =\r\nyou probably won&#39;t find that advertised on their web site though.\n\nI found =\r\nit interesting and somewhat amusing that Ghost Hunters on tv showed up with=\r\n this equipment in their series. However the Moditronics label was ripped o=\r\nff, the glue was still on the camera and there was a zoom in to this portio=\r\nn of one of the cameras.\n\nIn regards to the spectercams, in this economy an=\r\nd with the infrequency that I investigate, I cannot justify spending what a=\r\nny of the spectercams go for. If I were going out to investigate every week=\r\n or every other week, then sure I could justify spending more money. But I =\r\nwould be nervous without having more reviews from users and especially thos=\r\ne that have caught something on the Spectercam.\n\nHope this helps,\nCB\n\nIn EV=\r\nP-ITC@yahoogroups.com, &quot;draiga1&quot; &lt;mail@...&gt; wrote:\n&gt; Thank you so much, Sha=\r\nron. I was hoping someone had the moditronics camera too. It sounds like it=\r\n works great for what I want. I appreciate you sharing your results with it=\r\n.\n\nFrom my experience with all kinds of cameras, I say it&#39;s best to experim=\r\nent. On one of my experiments, I went to a purported haunted alley and took=\r\n 4 different shots using 4 different cameras from the same angle, taking th=\r\ne photos one after the other within a minute&#39;s span. The 4 cameras I used w=\r\nere: 1. Moditronics&#39; so-called &quot;Full Spectrum&quot; (which I&#39;ve dubbed &quot;Duo-Spec=\r\ntrum&quot; because it only sees into the near UV and IR spectrums, excluding the=\r\n visible spectrum altogether) and 2. Moditronics &quot;Deep IR&quot; which only sees =\r\ninto the IR spectrum, excluding the visible and UV spectrums, \n&gt; &gt; Sharon f=\r\nrom SF\n\n\n\n\n\n\n\r\n--0-152124138-1292550530=:8393\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;FONT size=3D4&gt;wooo have you tryed the specte=\r\nrcam 3? I assure you it is not low anything....you don&#39;t need extra light o=\r\nr anything. you can use it as is. and it IS full spectrum&lt;/FONT&gt;&lt;BR&gt;&lt;BR&gt;---=\r\n On &lt;B&gt;Thu, 12/16/10, Country &lt;I&gt;&lt;countrybumpkin1956@...&gt;&lt;/I&gt;&lt;/=\r\nB&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: rgb(16,16,255) 2px solid; P=\r\nADDING-LEFT: 5px; MARGIN-LEFT: 5px&quot;&gt;&lt;BR&gt;From: Country &lt;countrybumpkin195=\r\n6@...&gt;&lt;BR&gt;Subject: [EVP-ITC] Re: Full Spectrum Cameras (Moditronic=\r\ns)&lt;BR&gt;To: EVP-ITC@yahoogroups.com&lt;BR&gt;Date: Thursday, December 16, 2010, 7:3=\r\n4 PM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3Dyiv987226983&gt;&lt;SPAN style=3D&quot;DISPLAY: none&quot;&gt;&nbsp;&lt;/S=\r\nPAN&gt; \n&lt;DIV id=3Dyiv987226983ygrp-text&gt;\n&lt;DIV&gt;Hello....&lt;BR&gt;I, too, have a Mod=\r\nitronics UV/IR Full Spectrum HD Camcorder and a Moditronics Deep IR Still C=\r\namera (made by SVP). I agree that the camcorder is incorrectly named as it =\r\nis not full spectrum. It is the UV and IR fields I am interested in anyway.=\r\n&lt;BR&gt;&lt;BR&gt;Both are made from low quality, in my opinion, cameras. But whateve=\r\nr the technology this company uses in their units is very good, and I have =\r\nyet to see it duplicated. Their deep IR still camera will not pick up dust =\r\norbs, for example. When you get an orb on the still camera, chances are it =\r\nis something...they are often self illuminating, solid or near solid white,=\r\n often have a tail. I have also gotten very, very few orbs using this camer=\r\na as well.&lt;BR&gt;&lt;BR&gt;I did buy this same SVP camera but modified by a differen=\r\nt equipment supplier on the internet. It does show every dust orb there is,=\r\n the picture quality is a bit blurry or fuzzy many times. I was very disapp=\r\nointed.&lt;BR&gt;&lt;BR&gt;One thing about\n the SVP still camera is if you drop it, eve=\r\nn once, you will have a broken SD card slot. I was sold one on Ebay from so=\r\nmeone who knew the SD card was broken and never revealed it. Some research =\r\nshowed me what the possible reason was...it cannot take a drop. So handle i=\r\nt with care. Their packing slip even says they will not warrant the camera =\r\nagainst drops. But you probably won&#39;t find that advertised on their web sit=\r\ne though.&lt;BR&gt;&lt;BR&gt;I found it interesting and somewhat amusing that Ghost Hun=\r\nters on tv showed up with this equipment in their series. However the Modit=\r\nronics label was ripped off, the glue was still on the camera and there was=\r\n a zoom in to this portion of one of the cameras.&lt;BR&gt;&lt;BR&gt;In regards to the =\r\nspectercams, in this economy and with the infrequency that I investigate, I=\r\n cannot justify spending what any of the spectercams go for. If I were goin=\r\ng out to investigate every week or every other week, then sure I could just=\r\nify spending more money.\n But I would be nervous without having more review=\r\ns from users and especially those that have caught something on the Specter=\r\ncam.&lt;BR&gt;&lt;BR&gt;Hope this helps,&lt;BR&gt;CB&lt;BR&gt;&lt;BR&gt;In &lt;A href=3D&quot;http://us.mc1807.ma=\r\nil.yahoo.com/mc/compose?to=3DEVP-ITC%40yahoogroups.com&quot; rel=3Dnofollow targ=\r\net=3D_blank ymailto=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroup=\r\ns.com&lt;/A&gt;, &quot;draiga1&quot; &lt;mail@...&gt; wrote:&lt;BR&gt;&gt; Thank you so much, Sha=\r\nron. I was hoping someone had the moditronics camera too. It sounds like it=\r\n works great for what I want. I appreciate you sharing your results with it=\r\n.&lt;BR&gt;&lt;BR&gt;From my experience with all kinds of cameras, I say it&#39;s best to e=\r\nxperiment. On one of my experiments, I went to a purported haunted alley an=\r\nd took 4 different shots using 4 different cameras from the same angle, tak=\r\ning the photos one after the other within a minute&#39;s span. The 4 cameras I =\r\nused were: 1. Moditronics&#39; so-called &quot;Full Spectrum&quot; (which I&#39;ve dubbed &quot;Du=\r\no-Spectrum&quot; because it only\n sees into the near UV and IR spectrums, exclud=\r\ning the visible spectrum altogether) and 2. Moditronics &quot;Deep IR&quot; which onl=\r\ny sees into the IR spectrum, excluding the visible and UV spectrums, &lt;BR&gt;&g=\r\nt; &gt; Sharon from SF&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/ta=\r\nble&gt;\r\n--0-152124138-1292550530=:8393--"}