{"id": "19531", "subject": "Re: [EVP-ITC] Re: Full Spectrum Cameras", "author": "Ursula Kalin", "timestamp": "2010-12-16T05:50:34Z", "full_text": "--0-238732796-1292478634=:46284\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\ngotcha lol research is good..my husband says I&#39;m alittle anal when it come =\r\nto that.. I just hate=C2=A0buying something then reading later that it was =\r\ncrap or there was=C2=A0something better UGH!! LOL\n\n--- On Wed, 12/15/10, dr=\r\naiga1 &lt;mail@...&gt; wrote:\n\n\nFrom: draiga1 &lt;mail@mysticcauldron=\r\n.com&gt;\nSubject: [EVP-ITC] Re: Full Spectrum Cameras\nTo: EVP-ITC@yahoogroups.=\r\ncom\nDate: Wednesday, December 15, 2010, 11:26 PM\n\n\n=C2=A0 \n\n\n\nYes, that&#39;s w=\r\nhy I asked if anyone had used these cameras. Trying to research before maki=\r\nng the purchase. I understand what Sharon was saying about the Moditronics =\r\ncamera.\n\nThanks,\nDraiga\n\n--- In EVP-ITC@yahoogroups.com, Ursula Kalin &lt;kali=\r\nnu@...&gt; wrote:\n&gt;\n&gt; well clearly I&#39;m alittle bias...but if you ask around an=\r\nyone will tell it is not a full spectrum camera,it does have it good point =\r\nbut spectercam is really the only full spec camera without paying a arm and=\r\n a leg. I was recommened the cam by Andy from the other group and he works =\r\ni some sort of engineer. But I can only suggest.So I hope your happy with y=\r\nour choice. The specterCam is has motion censer. They work on a SD card fro=\r\nm your DVR..so thats no big deal what matter is weather it is trully a full=\r\n specter cam. I was going with that brand myself until I researched the pro=\r\nduct..I never Jump abd buy anything without checking out reviews and such.Y=\r\nour going to need another like source with this.&quot;Moditronics&#39; so-called &quot;Fu=\r\nll Spectrum&quot; (which I&#39;ve dubbed &quot;Duo-Spectrum&quot; because it only sees into th=\r\ne near UV and IR spectrums&quot;Please make sure you understand what sharon is s=\r\naying...this is NOT a full spectrum cam...if your happy with that go for it=\r\n :). You\n&gt; will get better result with a full spectrum...and if you can get=\r\n one why settle for less. But thats just the sorta person i am.\n&gt; \n&gt; --- On=\r\n Wed, 12/15/10, draiga1 &lt;mail@...&gt; wrote:\n&gt; \n&gt; \n&gt; From: draiga1 &lt;mail@...&gt;\n=\r\n&gt; Subject: [EVP-ITC] Re: Full Spectrum Cameras\n&gt; To: EVP-ITC@...=\r\nm\n&gt; Date: Wednesday, December 15, 2010, 12:11 PM\n&gt; \n&gt; \n&gt; =C3=82=C2=A0 \n&gt; \n&gt;=\r\n \n&gt; \n&gt; Thank you so much, Sharon. I was hoping someone had the moditronics =\r\ncamera too. It sounds like it works great for what I want. I appreciate you=\r\n sharing your results with it.\n&gt; \n&gt; Thanks!\n&gt; Draiga\n&gt; \n&gt; --- In EVP-ITC@ya=\r\nhoogroups.com, &quot;mllejade&quot; &lt;leongbabe@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hello Ursula and Drai=\r\nga,\n&gt; &gt; \n&gt; &gt; From my experience with all kinds of cameras, I say it&#39;s best =\r\nto experiment. On one of my experiments, I went to a purported haunted alle=\r\ny and took 4 different shots using 4 different cameras from the same angle,=\r\n taking the photos one after the other within a minute&#39;s span. The 4 camera=\r\ns I used were: 1. Moditronics&#39; so-called &quot;Full Spectrum&quot; (which I&#39;ve dubbed=\r\n &quot;Duo-Spectrum&quot; because it only sees into the near UV and IR spectrums, exc=\r\nluding the visible spectrum altogether) and 2. Moditronics &quot;Deep IR&quot; which =\r\nonly sees into the IR spectrum, excluding the visible and UV spectrums, 3. =\r\na &quot;Full Spectrum&quot; camera, which sees all 3 spectrums (i.e., UV, visible and=\r\n IR) and 4. a regular digital point n&#39; shoot consumer camera. The results w=\r\nere interesting. In the pictures I shot with Moditronics&#39; Full (&quot;Duo&quot;) Spec=\r\ntrum camera and &quot;Deep IR&quot; camera, I got a face floating in a fire escape fr=\r\nom the side of a building adjoining the alley; that face did not show up on=\r\n\n&gt; neither the full spectrum camera nor on the point n&#39; shoot camera. Inter=\r\nesting indeed. I intend to carry on with more experiments of this type, i.e=\r\n., shooting the same scene using multiple cameras with different capabiliti=\r\nes. BTW, as you may already know, the Moditronics camera takes stills as we=\r\nll as video, and it records onto SD cards. \n&gt; &gt; \n&gt; &gt; Ursula, thanks for you=\r\nr review on the SpecterCam 3, which I&#39;ll definitely look into purchasing. I=\r\nn the past I&#39;ve purchase accessories from the SpecterCam site and the site&#39;=\r\ns owner is definitely very knowledgeable. My philosophy is that we know so =\r\nlittle about this research is that I may as well try it all (if I could aff=\r\nord it, that is).\n&gt; &gt; \n&gt; &gt; Draiga - if you decide to make videos with one o=\r\nf the SpecterCam cameras, and you want sound, be sure you also have a digit=\r\nal voice recorder running at the same time as DVR cameras record only image=\r\ns, and not sound. Also, about Moditronics&#39; full spectrum and deep IR camera=\r\ns, you&#39;ll need an external light source if you film at night since those ca=\r\nmeras do not see into the visible spectrum and if it&#39;s a pitch black or ver=\r\ny dark environment, they won&#39;t see anyhing without a light source. However,=\r\n they&#39;re perfect for daytime ghost hunting, which I do as well as night-tim=\r\ne investigations (I don&#39;t believe that ghosts only come out and show themse=\r\nlves at night).\n&gt; &gt; \n&gt; &gt; Hope that helps. When I find time, I will post the=\r\n photos from my alley experiment.\n&gt; &gt; \n&gt; &gt; Sharon from SF\n&gt; &gt; \n&gt; &gt;\n&gt;\n\n\n\n\n\n\n\r\n--0-238732796-1292478634=:46284\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;FONT size=3D4&gt;gotcha lol research is good..m=\r\ny husband says I&#39;m alittle anal when it come to that.. I just hate&nbsp;buy=\r\ning something then reading later that it was crap or there was&nbsp;somethi=\r\nng better UGH!! LOL&lt;/FONT&gt;&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Wed, 12/15/10, draiga1 &lt;I&gt;&lt;m=\r\nail@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-L=\r\nEFT: rgb(16,16,255) 2px solid; PADDING-LEFT: 5px; MARGIN-LEFT: 5px&quot;&gt;&lt;BR&gt;Fro=\r\nm: draiga1 &lt;mail@...&gt;&lt;BR&gt;Subject: [EVP-ITC] Re: Full S=\r\npectrum Cameras&lt;BR&gt;To: EVP-ITC@yahoogroups.com&lt;BR&gt;Date: Wednesday, December=\r\n 15, 2010, 11:26 PM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3Dyiv294446714&gt;&lt;SPAN style=3D&quot;DISPLAY: =\r\nnone&quot;&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV id=3Dyiv294446714ygrp-text&gt;\n&lt;DIV&gt;Yes, that&#39;s why =\r\nI asked if anyone had used these cameras. Trying to research before making =\r\nthe purchase. I understand what Sharon was saying about the Moditronics cam=\r\nera.&lt;BR&gt;&lt;BR&gt;Thanks,&lt;BR&gt;Draiga&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=3D&quot;http://us.mc1807.mai=\r\nl.yahoo.com/mc/compose?to=3DEVP-ITC%40yahoogroups.com&quot; rel=3Dnofollow targe=\r\nt=3D_blank ymailto=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups=\r\n.com&lt;/A&gt;, Ursula Kalin &lt;kalinu@...&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; well clear=\r\nly I&#39;m alittle bias...but if you ask around anyone will tell it is not a fu=\r\nll spectrum camera,it does have it good point but spectercam is really the =\r\nonly full spec camera without paying a arm and a leg. I was recommened the =\r\ncam by Andy from the other group and he works i some sort of engineer. But =\r\nI can only suggest.So I hope your happy with your choice. The specterCam is=\r\n has motion censer. They work on a SD card from your DVR..so thats no big d=\r\neal what matter is weather it is trully a full specter\n cam. I was going wi=\r\nth that brand myself until I researched the product..I never Jump abd buy a=\r\nnything without checking out reviews and such.Your going to need another li=\r\nke source with this.&quot;Moditronics&#39; so-called &quot;Full Spectrum&quot; (which I&#39;ve dub=\r\nbed &quot;Duo-Spectrum&quot; because it only sees into the near UV and IR spectrums&quot;P=\r\nlease make sure you understand what sharon is saying...this is NOT a full s=\r\npectrum cam...if your happy with that go for it :). You&lt;BR&gt;&gt; will get be=\r\ntter result with a full spectrum...and if you can get one why settle for le=\r\nss. But thats just the sorta person i am.&lt;BR&gt;&gt; &lt;BR&gt;&gt; --- On Wed, 12/1=\r\n5/10, draiga1 &lt;mail@...&gt; wrote:&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; From: draig=\r\na1 &lt;mail@...&gt;&lt;BR&gt;&gt; Subject: [EVP-ITC] Re: Full Spectrum Cameras&lt;BR=\r\n&gt;&gt; To: &lt;A href=3D&quot;http://us.mc1807.mail.yahoo.com/mc/compose?to=3DEVP-IT=\r\nC%40yahoogroups.com&quot; rel=3Dnofollow target=3D_blank ymailto=3D&quot;mailto:EVP-I=\r\nTC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups.com&lt;/A&gt;&lt;BR&gt;&gt;\n Date: Wednesday,=\r\n December 15, 2010, 12:11 PM&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; =C3=82&nbsp; &lt;BR&gt;&gt=\r\n; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; Thank you so much, Sharon. I was hoping someon=\r\ne had the moditronics camera too. It sounds like it works great for what I =\r\nwant. I appreciate you sharing your results with it.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Thank=\r\ns!&lt;BR&gt;&gt; Draiga&lt;BR&gt;&gt; &lt;BR&gt;&gt; --- In &lt;A href=3D&quot;http://us.mc1807.mail.=\r\nyahoo.com/mc/compose?to=3DEVP-ITC%40yahoogroups.com&quot; rel=3Dnofollow target=\r\n=3D_blank ymailto=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups.=\r\ncom&lt;/A&gt;, &quot;mllejade&quot; &lt;leongbabe@&gt; wrote:&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt; Hel=\r\nlo Ursula and Draiga,&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; From my experience with al=\r\nl kinds of cameras, I say it&#39;s best to experiment. On one of my experiments=\r\n, I went to a purported haunted alley and took 4 different shots using 4 di=\r\nfferent cameras from the same angle, taking the photos one after the other =\r\nwithin a minute&#39;s span. The 4 cameras I used were: 1. Moditronics&#39;\n so-call=\r\ned &quot;Full Spectrum&quot; (which I&#39;ve dubbed &quot;Duo-Spectrum&quot; because it only sees i=\r\nnto the near UV and IR spectrums, excluding the visible spectrum altogether=\r\n) and 2. Moditronics &quot;Deep IR&quot; which only sees into the IR spectrum, exclud=\r\ning the visible and UV spectrums, 3. a &quot;Full Spectrum&quot; camera, which sees a=\r\nll 3 spectrums (i.e., UV, visible and IR) and 4. a regular digital point n&#39;=\r\n shoot consumer camera. The results were interesting. In the pictures I sho=\r\nt with Moditronics&#39; Full (&quot;Duo&quot;) Spectrum camera and &quot;Deep IR&quot; camera, I go=\r\nt a face floating in a fire escape from the side of a building adjoining th=\r\ne alley; that face did not show up on&lt;BR&gt;&gt; neither the full spectrum cam=\r\nera nor on the point n&#39; shoot camera. Interesting indeed. I intend to carry=\r\n on with more experiments of this type, i.e., shooting the same scene using=\r\n multiple cameras with different capabilities. BTW, as you may already know=\r\n, the Moditronics camera takes stills as well as video, and\n it records ont=\r\no SD cards. &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; Ursula, thanks for your review on t=\r\nhe SpecterCam 3, which I&#39;ll definitely look into purchasing. In the past I&#39;=\r\nve purchase accessories from the SpecterCam site and the site&#39;s owner is de=\r\nfinitely very knowledgeable. My philosophy is that we know so little about =\r\nthis research is that I may as well try it all (if I could afford it, that =\r\nis).&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; Draiga - if you decide to make videos with =\r\none of the SpecterCam cameras, and you want sound, be sure you also have a =\r\ndigital voice recorder running at the same time as DVR cameras record only =\r\nimages, and not sound. Also, about Moditronics&#39; full spectrum and deep IR c=\r\nameras, you&#39;ll need an external light source if you film at night since tho=\r\nse cameras do not see into the visible spectrum and if it&#39;s a pitch black o=\r\nr very dark environment, they won&#39;t see anyhing without a light source. How=\r\never, they&#39;re perfect for daytime ghost hunting,\n which I do as well as nig=\r\nht-time investigations (I don&#39;t believe that ghosts only come out and show =\r\nthemselves at night).&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; Hope that helps. When I fi=\r\nnd time, I will post the photos from my alley experiment.&lt;BR&gt;&gt; &gt; &lt;BR&gt;=\r\n&gt; &gt; Sharon from SF&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/=\r\nDIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;\r\n--0-238732796-1292478634=:46284--"}