{"id": "19530", "subject": "Re: Full Spectrum Cameras", "author": "draiga1", "timestamp": "2010-12-16T05:26:23Z", "full_text": "Yes, that&#39;s why I asked if anyone had used these cameras. Trying to research before making the purchase. I understand what Sharon was saying about the Moditronics camera.\n\n\nThanks,\nDraiga\n\n--- In EVP-ITC@yahoogroups.com, Ursula Kalin &lt;kalinu@...&gt; wrote:\n&gt;\n&gt; well clearly I&#39;m alittle bias...but if you ask around anyone will tell it is not a full spectrum camera,it does have it good point but spectercam is really the only full spec camera without paying a arm and a leg. I was recommened the cam by Andy from the other group and he works i some sort of engineer. But I can only suggest.So I hope your happy with your choice. The specterCam is has motion censer. They work on a SD card from your DVR..so thats no big deal what matter is weather it is trully a full specter cam. I was going with that brand myself until I researched the product..I never Jump abd buy anything without checking out reviews and such.Your going to need another like source with this.&quot;Moditronics&#39; so-called &quot;Full Spectrum&quot; (which I&#39;ve dubbed &quot;Duo-Spectrum&quot; because it only sees into the near UV and IR spectrums&quot;Please make sure you understand what sharon is saying...this is NOT a full spectrum cam...if your happy with that go for it :). You\n&gt;  will get better result with a full spectrum...and if you can get one why settle for less. But thats just the sorta person i am.\n&gt; \n&gt; --- On Wed, 12/15/10, draiga1 &lt;mail@...&gt; wrote:\n&gt; \n&gt; \n&gt; From: draiga1 &lt;mail@...&gt;\n&gt; Subject: [EVP-ITC] Re: Full Spectrum Cameras\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Wednesday, December 15, 2010, 12:11 PM\n&gt; \n&gt; \n&gt;   \n&gt; \n&gt; \n&gt; \n&gt; Thank you so much, Sharon. I was hoping someone had the moditronics camera too. It sounds like it works great for what I want. I appreciate you sharing your results with it.\n&gt; \n&gt; Thanks!\n&gt; Draiga\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;mllejade&quot; &lt;leongbabe@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hello Ursula and Draiga,\n&gt; &gt; \n&gt; &gt; From my experience with all kinds of cameras, I say it&#39;s best to experiment. On one of my experiments, I went to a purported haunted alley and took 4 different shots using 4 different cameras from the same angle, taking the photos one after the other within a minute&#39;s span. The 4 cameras I used were: 1. Moditronics&#39; so-called &quot;Full Spectrum&quot; (which I&#39;ve dubbed &quot;Duo-Spectrum&quot; because it only sees into the near UV and IR spectrums, excluding the visible spectrum altogether) and 2. Moditronics &quot;Deep IR&quot; which only sees into the IR spectrum, excluding the visible and UV spectrums, 3. a &quot;Full Spectrum&quot; camera, which sees all 3 spectrums (i.e., UV, visible and IR) and 4. a regular digital point n&#39; shoot consumer camera. The results were interesting. In the pictures I shot with Moditronics&#39; Full (&quot;Duo&quot;) Spectrum camera and &quot;Deep IR&quot; camera, I got a face floating in a fire escape from the side of a building adjoining the alley; that face did not show up on\n&gt;  neither the full spectrum camera nor on the point n&#39; shoot camera. Interesting indeed. I intend to carry on with more experiments of this type, i.e., shooting the same scene using multiple cameras with different capabilities. BTW, as you may already know, the Moditronics camera takes stills as well as video, and it records onto SD cards. \n&gt; &gt; \n&gt; &gt; Ursula, thanks for your review on the SpecterCam 3, which I&#39;ll definitely look into purchasing. In the past I&#39;ve purchase accessories from the SpecterCam site and the site&#39;s owner is definitely very knowledgeable. My philosophy is that we know so little about this research is that I may as well try it all (if I could afford it, that is).\n&gt; &gt; \n&gt; &gt; Draiga - if you decide to make videos with one of the SpecterCam cameras, and you want sound, be sure you also have a digital voice recorder running at the same time as DVR cameras record only images, and not sound. Also, about Moditronics&#39; full spectrum and deep IR cameras, you&#39;ll need an external light source if you film at night since those cameras do not see into the visible spectrum and if it&#39;s a pitch black or very dark environment, they won&#39;t see anyhing without a light source. However, they&#39;re perfect for daytime ghost hunting, which I do as well as night-time investigations (I don&#39;t believe that ghosts only come out and show themselves at night).\n&gt; &gt; \n&gt; &gt; Hope that helps. When I find time, I will post the photos from my alley experiment.\n&gt; &gt; \n&gt; &gt; Sharon from SF\n&gt; &gt; \n&gt; &gt;\n&gt;"}