{"id": "19544", "subject": "Re: Ghost Boxes in Action", "author": "mllejade", "timestamp": "2010-12-17T05:31:38Z", "full_text": "Hi Tim,\n\nI checked out your investigation videos - some impressive results.  \n\nThanks for sharing it,\n\nSharon from SF\n\n--- In EVP-ITC@yahoogroups.com, Tim Woolworth &lt;tjwoolworth@...&gt; wrote:\n&gt;\n&gt; Hi guys.\n&gt; \n&gt; As some of you know, I work with the inimitable Stacey Jones in a\n&gt; ghost hunting group called Central New York Ghost Hunters.  We have a\n&gt; TV show that plays throughout Central NY (accessible to over 1.5\n&gt; million viewers total) called CNY Spirits.\n&gt; \n&gt; In this episode, which has been uploaded to youtube, you can see the\n&gt; Minibox Plus on an investigation.  It was used in tandem with a poker\n&gt; game and garnered some amazing results.  The Minibox was used in part\n&gt; 2, and everyones favorite shack hack was used in part 3.  To my\n&gt; knowledge, this is the first time a Minibox has been used on\n&gt; television.  You will have to ignore what Stacey says about the\n&gt; Minibox because she was dead wrong on most of her facts.  I wish that\n&gt; the producer had interviewed me so I could have explained it a helluva\n&gt; lot better.\n&gt; \n&gt; If you are wondering, I am the goofy looking guy with the pony tail and tattoos.\n&gt; \n&gt; You can check out pt 1 here:\n&gt; \n&gt; http://www.youtube.com/watch?v=anxfj8Dlrus&feature=related\n&gt; \n&gt; This episode was a followup investigation to a prior one done about 6\n&gt; weeks earlier.  This earlier investigation yielded some amazing EVP&#39;s\n&gt; and flashlight responses.  YOu can view pt 1 here:\n&gt; \n&gt; http://www.youtube.com/watch?v=Ey6uHks4aj4&feature=related\n&gt; \n&gt; These are some of the clips from that session.\n&gt; \n&gt; The clip about &quot;pissing me off&quot; has become pretty famous because\n&gt; Stacey uses it when she lectures at conferences.  It is very\n&gt; intriguing because it is her voice coming through the Hack while she\n&gt; is sitting at the table.  I have discussed this clip with a few of\n&gt; you, and here it is a lot cleaner than in the video.\n&gt; \n&gt; The rest of the clips are from the poker session that were not in the\n&gt; video.  On the &quot;Holding a Five&quot; clip, Mike actually had a pair of\n&gt; fives in his hand.\n&gt; \n&gt; Tim\n&gt;"}