{"id": "19545", "subject": "Re: Full Spectrum Cameras", "author": "leongbabe@aol.com", "timestamp": "2010-12-17T07:57:19Z", "full_text": "----------MB_8CD6BD729C9706B_4C8_FC8D_webmail-m032.sysops.aol.com\r\nContent-Type: multipart/alternative; \n boundary=&quot;--------MB_8CD6BD729C9706B_4C8_FC8E_webmail-m032.sysops.aol.com&quot;\r\n\r\n\r\n----------MB_8CD6BD729C9706B_4C8_FC8E_webmail-m032.sysops.aol.com\r\nContent-Transfer-Encoding: quoted-printable\r\nContent-Type: text/plain; charset=&quot;us-ascii&quot;\r\n\r\n\nHi Draiga, Ursula, CB, and Rick, and all others interested in this topic:\n=\r\n\nAs promised, I&#39;ve attached a jpeg with the results of my camera experiment=\r\n using 1) digital point n&#39; shoot camera, 2) Moditronics Deep IR camera, 3) =\r\nModitronics Full ( &quot;Duo&quot;) Spectrum camera, and 4) a Nikon camera converted =\r\ninto a Full Spectrum camera.  I took these shots, one after the other, and =\r\nfrom the same angle, in a purportedly haunted alley in San Francisco&#39;s Chin=\r\natown.  Please note that I took these photos during the day, which was one =\r\nof the reasons I purchased the two Moditronics cameras - their cameras don&#39;=\r\nt see into the visible spectrum and thus prevent against visible light wash=\r\ning out any possible images that may be lurking in the IR and UV spectrums.=\r\n  And, as you can see from the attached jpeg, in the fire escape one can se=\r\ne what looks like a head floating in the two photos I took with Moditronics=\r\n Duo Spectrum and Deep IR cameras.  In the two photos taken with the regula=\r\nr point n&#39; shoot camera and the full spectrum camera, you can&#39;t see the flo=\r\nating head at all because the visible light washed it out.  Again, for nigh=\r\nt time investigations, the drawback with the Moditronics cameras is that yo=\r\nu will need some kind of external light source in order to see anything (or=\r\n, you can always turn on some lights - if lights are available, why sit in =\r\nthe dark?)\n\nUrsula, don&#39;t get me wrong, I think the SpecterCam 3 is a wonde=\r\nrful full spectrum camera (as a matter of fact, I&#39;ve just purchased one as =\r\na present to myself!).  I&#39;m going to experiment with it and will probably b=\r\nuy a filter for it that will block some of the visible light because, again=\r\n, I don&#39;t want visible light possibly washing out the IR and UV spectrums, =\r\nespecially if I investigate during the day (I also investigate a lot of bat=\r\ntlefields and many battlefields close early).\n\nApologies to the rest of you=\r\n who may be asking, what does this have to do with EVPs?  Well, photos of t=\r\nrue anomalies can help substantiate any EVPs captured and, I might add here=\r\n, the Moditronics camcorders also record sound (unlike DVR cameras, such as=\r\n Spectercams, where you would need to have a separate audio recorder if you=\r\n want sound to go with the images).  And yes, I have also picked up EVPs on=\r\n my camcorders. \n\nFinally, CB, I agree with you, the SVP cameras that Modit=\r\nronics use for their conversions are pretty flimsy in construction (plastic=\r\n casing).  I&#39;ve accidentally banged my Deep IR camera against the gear shif=\r\nt in the car and (Sob!) the bottom of the camera broke off from the tripod.=\r\n  I duck-taped it back together and it still works, though (whew!).  (And y=\r\nes, I, too, have noticed that the Ghost Hunters used the Moditronics full s=\r\npectrum camera on one of their shows this year.)\n\nTherefore, Rick, don&#39;t sw=\r\neat it.  For what you get for the price, I think you did fine.  But like CB=\r\n said, don&#39;t drop these cameras or bang them around too much.\n\nLastly, I th=\r\nink all kinds and grades of cameras are worth experimenting with.  I&#39;ve eve=\r\nn captured a very interesting light anomaly with a cheap throwaway camera a=\r\nnd have seen what appeared to be an apparition taken with a point n&#39; shoot.=\r\n  So, whatever one can afford, go with it!\n\nHappy Holidays Everyone!\n\nSharo=\r\nn from SF\n\n\n\n\r\n----------MB_8CD6BD729C9706B_4C8_FC8E_webmail-m032.sysops.aol.com\r\nContent-Transfer-Encoding: quoted-printable\r\nContent-Type: text/html; charset=&quot;us-ascii&quot;\r\n\r\n&lt;font color=3D&#39;black&#39; size=3D&#39;2&#39; face=3D&#39;arial&#39;&gt;\n&lt;div&gt;Hi Draiga, Ursula, CB=\r\n, and Rick, and all others interested in this topic:&lt;/div&gt;\n\n\n&lt;div&gt;&nbsp;&lt;/d=\r\niv&gt;\n\n\n&lt;div&gt;As promised, I&#39;ve attached a jpeg with the results of my camera =\r\nexperiment using 1) digital point n&#39; shoot camera, 2) Moditronics Deep IR c=\r\namera, 3) Moditronics Full ( &quot;Duo&quot;) Spectrum camera, and 4) a Nikon camera =\r\nconverted into a Full Spectrum camera.&nbsp; I took these shots, one after =\r\nthe other, and from the same angle, in a purportedly haunted alley in San F=\r\nrancisco&#39;s Chinatown.&nbsp; Please note that I took these photos&nbsp;durin=\r\ng the day, which was one of the reasons I purchased the two Moditronics cam=\r\neras - their cameras&nbsp;don&#39;t see into the visible spectrum and thus prev=\r\nent against visible light washing out any possible images that may be lurki=\r\nng in the IR and UV spectrums.&nbsp; And, as you can see from the attached =\r\njpeg, in the fire escape one can see what looks like a head floating in the=\r\n two photos I took with Moditronics Duo Spectrum and Deep IR cameras.&nbsp;=\r\n In the two photos taken with the regular point n&#39; shoot camera and the ful=\r\nl spectrum camera, you can&#39;t see the floating head at all because the visib=\r\nle light washed it out.&nbsp; Again, for night time investigations, the dra=\r\nwback with the Moditronics cameras is that you will need some kind of exter=\r\nnal light source in order to see anything (or, you can always turn on some =\r\nlights - if lights are available, why sit in the dark?)&lt;/div&gt;\n\n\n&lt;div&gt;&nbsp;=\r\n&lt;/div&gt;\n\n\n&lt;div&gt;Ursula, don&#39;t get me wrong, I think the SpecterCam 3 is a won=\r\nderful full spectrum camera (as a matter of fact, I&#39;ve just purchased one a=\r\ns a present to myself!).&nbsp; I&#39;m going to experiment with it and will pro=\r\nbably buy a filter for it that will block some of the visible light because=\r\n, again, I don&#39;t want visible light possibly washing out the IR and UV spec=\r\ntrums, especially if I investigate during the day (I also investigate a lot=\r\n of battlefields and many battlefields close early).&lt;/div&gt;\n\n\n&lt;div&gt;&nbsp;&lt;/d=\r\niv&gt;\n\n\n&lt;div&gt;Apologies to the rest of you who may be asking, what does this h=\r\nave to do with EVPs?&nbsp; Well, photos of true anomalies can help substant=\r\niate any EVPs captured and, I might add here, the Moditronics camcorders al=\r\nso record sound (unlike DVR cameras, such as Spectercams, where you would n=\r\need to have a separate audio recorder if you want sound to go with the imag=\r\nes).&nbsp; And yes, I have&nbsp;also&nbsp;picked up&nbsp;EVPs&nbsp;on my ca=\r\nmcorders.&nbsp;&lt;/div&gt;\n\n\n&lt;div&gt;&nbsp;&lt;/div&gt;\n\n\n&lt;div&gt;Finally, CB, I agree with =\r\nyou, the SVP cameras that Moditronics use for their conversions are pretty =\r\nflimsy in construction (plastic casing).&nbsp; I&#39;ve accidentally banged my =\r\nDeep IR camera against the gear shift in the car and (Sob!) the bottom of t=\r\nhe camera broke off from the tripod.&nbsp; I duck-taped it back together an=\r\nd it still works, though (whew!).&nbsp; (And yes, I, too, have noticed that=\r\n the Ghost Hunters used&nbsp;the Moditronics full spectrum camera on one of=\r\n their shows this year.)&lt;/div&gt;\n\n\n&lt;div&gt;&nbsp;&lt;/div&gt;\n\n\n&lt;div&gt;Therefore, Rick, =\r\ndon&#39;t sweat it.&nbsp; For what you get for the price, I think you did fine.=\r\n&nbsp; But like CB said, don&#39;t drop these cameras or bang them around too m=\r\nuch.&lt;/div&gt;\n\n\n&lt;div&gt;&nbsp;&lt;/div&gt;\n\n\n&lt;div&gt;Lastly, I think all kinds and grades =\r\nof cameras are worth experimenting with.&nbsp; I&#39;ve even captured a very in=\r\nteresting light anomaly with a cheap throwaway camera and have seen what ap=\r\npeared to be an apparition taken with a point n&#39; shoot.&nbsp; So, whatever =\r\none can afford, go with it!&lt;/div&gt;\n\n\n&lt;div&gt;&nbsp;&lt;/div&gt;\n\n\n&lt;div&gt;Happy Holidays=\r\n Everyone!&lt;/div&gt;\n\n\n&lt;div&gt;&nbsp;&lt;/div&gt;\n\n\n&lt;div&gt;Sharon from SF&lt;br&gt;\n&lt;br&gt;\n&lt;/div&gt;\n=\r\n\n\n&lt;div style=3D&quot;CLEAR: both&quot;&gt;&lt;/div&gt;\n&lt;/font&gt;\n\r\n----------MB_8CD6BD729C9706B_4C8_FC8E_webmail-m032.sysops.aol.com--\r\n\n\r\n----------MB_8CD6BD729C9706B_4C8_FC8D_webmail-m032.sysops.aol.com\r\nContent-Disposition: attachment; filename=&quot;Various Cameras Test-Results.jpg&quot;\r\nContent-Type: image/pjpeg; name=&quot;Various Cameras Test-Results.jpg&quot;\r\n\r\n[ Attachment content not displayed ]\r\n----------MB_8CD6BD729C9706B_4C8_FC8D_webmail-m032.sysops.aol.com--"}