{"id": "19546", "subject": "Re: [EVP-ITC] Re: Full Spectrum Cameras [1 Attachment]", "author": "Ursula Kalin", "timestamp": "2010-12-17T08:11:45Z", "full_text": "--0-1026791657-1292573505=:22979\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nawesome Sharon!! Which one did you get...\n\n--- On Fri, 12/17/10, leongbabe@=\r\naol.com &lt;leongbabe@...&gt; wrote:\n\n\nFrom: leongbabe@... &lt;leongbabe@aol=\r\n.com&gt;\nSubject: [EVP-ITC] Re: Full Spectrum Cameras [1 Attachment]\nTo: EVP-I=\r\nTC@yahoogroups.com\nDate: Friday, December 17, 2010, 1:57 AM\n\n\n=C2=A0 \n\n\n[At=\r\ntachment(s) from leongbabe@... included below] \n\nHi Draiga, Ursula, CB,=\r\n and Rick, and all others interested in this topic:\n=C2=A0\nAs promised, I&#39;v=\r\ne attached a jpeg with the results of my camera experiment using 1) digital=\r\n point n&#39; shoot camera, 2) Moditronics Deep IR camera, 3) Moditronics Full =\r\n( &quot;Duo&quot;) Spectrum camera, and 4) a Nikon camera converted into a Full Spect=\r\nrum camera.=C2=A0 I took these shots, one after the other, and from the sam=\r\ne angle, in a purportedly haunted alley in San Francisco&#39;s Chinatown.=C2=A0=\r\n Please note that I took these photos=C2=A0during the day, which was one of=\r\n the reasons I purchased the two Moditronics cameras - their cameras=C2=A0d=\r\non&#39;t see into the visible spectrum and thus prevent against visible light w=\r\nashing out any possible images that may be lurking in the IR and UV spectru=\r\nms.=C2=A0 And, as you can see from the attached jpeg, in the fire escape on=\r\ne can see what looks like a head floating in the two photos I took with Mod=\r\nitronics Duo Spectrum and Deep IR cameras.=C2=A0 In the two photos taken wi=\r\nth the regular point n&#39; shoot camera and the full spectrum camera, you can&#39;=\r\nt\n see the floating head at all because the visible light washed it out.=C2=\r\n=A0 Again, for night time investigations, the drawback with the Moditronics=\r\n cameras is that you will need some kind of external light source in order =\r\nto see anything (or, you can always turn on some lights - if lights are ava=\r\nilable, why sit in the dark?)\n=C2=A0\nUrsula, don&#39;t get me wrong, I think th=\r\ne SpecterCam 3 is a wonderful full spectrum camera (as a matter of fact, I&#39;=\r\nve just purchased one as a present to myself!).=C2=A0 I&#39;m going to experime=\r\nnt with it and will probably buy a filter for it that will block some of th=\r\ne visible light because, again, I don&#39;t want visible light possibly washing=\r\n out the IR and UV spectrums, especially if I investigate during the day (I=\r\n also investigate a lot of battlefields and many battlefields close early).=\r\n\n=C2=A0\nApologies to the rest of you who may be asking, what does this have=\r\n to do with EVPs?=C2=A0 Well, photos of true anomalies can help substantiat=\r\ne any EVPs captured and, I might add here, the Moditronics camcorders also =\r\nrecord sound (unlike DVR cameras, such as Spectercams, where you would need=\r\n to have a separate audio recorder if you want sound to go with the images)=\r\n.=C2=A0 And yes, I have=C2=A0also=C2=A0picked up=C2=A0EVPs=C2=A0on my camco=\r\nrders.=C2=A0\n=C2=A0\nFinally, CB, I agree with you, the SVP cameras that Mod=\r\nitronics use for their conversions are pretty flimsy in construction (plast=\r\nic casing).=C2=A0 I&#39;ve accidentally banged my Deep IR camera against the ge=\r\nar shift in the car and (Sob!) the bottom of the camera broke off from the =\r\ntripod.=C2=A0 I duck-taped it back together and it still works, though (whe=\r\nw!).=C2=A0 (And yes, I, too, have noticed that the Ghost Hunters used=C2=A0=\r\nthe Moditronics full spectrum camera on one of their shows this year.)\n=C2=\r\n=A0\nTherefore, Rick, don&#39;t sweat it.=C2=A0 For what you get for the price, =\r\nI think you did fine.=C2=A0 But like CB said, don&#39;t drop these cameras or b=\r\nang them around too much.\n=C2=A0\nLastly, I think all kinds and grades of ca=\r\nmeras are worth experimenting with.=C2=A0 I&#39;ve even captured a very interes=\r\nting light anomaly with a cheap throwaway camera and have seen what appeare=\r\nd to be an apparition taken with a point n&#39; shoot.=C2=A0 So, whatever one c=\r\nan afford, go with it!\n=C2=A0\nHappy Holidays Everyone!\n=C2=A0\nSharon from S=\r\nF\n\n\n\n\n\n\n\n\r\n--0-1026791657-1292573505=:22979\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;DIV&gt;&lt;FONT size=3D4&gt;awesome Sharon!! Which on=\r\ne did you get...&lt;/FONT&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;--- On &lt;B&gt;Fri, 12/17/10, leongbabe@a=\r\nol.com &lt;I&gt;&lt;leongbabe@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;&lt;/DIV&gt;\n&lt;BLOCKQUOTE st=\r\nyle=3D&quot;BORDER-LEFT: rgb(16,16,255) 2px solid; PADDING-LEFT: 5px; MARGIN-LEF=\r\nT: 5px&quot;&gt;&lt;BR&gt;From: leongbabe@... &lt;leongbabe@...&gt;&lt;BR&gt;Subject: [=\r\nEVP-ITC] Re: Full Spectrum Cameras [1 Attachment]&lt;BR&gt;To: EVP-ITC@yahoogroup=\r\ns.com&lt;BR&gt;Date: Friday, December 17, 2010, 1:57 AM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3Dyiv6228=\r\n53154&gt;&lt;SPAN style=3D&quot;DISPLAY: none&quot;&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV id=3Dyiv622853154yg=\r\nrp-text&gt;\n&lt;DIV&gt;&lt;FONT color=3Dblack size=3D2 face=3Darial&gt;\n&lt;DIV&gt;Hi Draiga, Ur=\r\nsula, CB, and Rick, and all others interested in this topic:&lt;/DIV&gt;\n&lt;DIV&gt;&nb=\r\nsp;&lt;/DIV&gt;\n&lt;DIV&gt;As promised, I&#39;ve attached a jpeg with the results of my cam=\r\nera experiment using 1) digital point n&#39; shoot camera, 2) Moditronics Deep =\r\nIR camera, 3) Moditronics Full ( &quot;Duo&quot;) Spectrum camera, and 4) a Nikon cam=\r\nera converted into a Full Spectrum camera.&nbsp; I took these shots, one af=\r\nter the other, and from the same angle, in a purportedly haunted alley in S=\r\nan Francisco&#39;s Chinatown.&nbsp; Please note that I took these photos&nbsp;d=\r\nuring the day, which was one of the reasons I purchased the two Moditronics=\r\n cameras - their cameras&nbsp;don&#39;t see into the visible spectrum and thus =\r\nprevent against visible light washing out any possible images that may be l=\r\nurking in the IR and UV spectrums.&nbsp; And, as you can see from the attac=\r\nhed jpeg, in the fire escape one can see what looks like a head floating in=\r\n the two photos I took with Moditronics Duo Spectrum and Deep IR cameras.&n=\r\nbsp; In the two photos taken with the regular point n&#39; shoot camera and the=\r\n\n full spectrum camera, you can&#39;t see the floating head at all because the =\r\nvisible light washed it out.&nbsp; Again, for night time investigations, th=\r\ne drawback with the Moditronics cameras is that you will need some kind of =\r\nexternal light source in order to see anything (or, you can always turn on =\r\nsome lights - if lights are available, why sit in the dark?)&lt;/DIV&gt;\n&lt;DIV&gt;&nb=\r\nsp;&lt;/DIV&gt;\n&lt;DIV&gt;Ursula, don&#39;t get me wrong, I think the SpecterCam 3 is a wo=\r\nnderful full spectrum camera (as a matter of fact, I&#39;ve just purchased one =\r\nas a present to myself!).&nbsp; I&#39;m going to experiment with it and will pr=\r\nobably buy a filter for it that will block some of the visible light becaus=\r\ne, again, I don&#39;t want visible light possibly washing out the IR and UV spe=\r\nctrums, especially if I investigate during the day (I also investigate a lo=\r\nt of battlefields and many battlefields close early).&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DI=\r\nV&gt;\n&lt;DIV&gt;Apologies to the rest of you who may be asking, what does this have=\r\n to do with EVPs?&nbsp; Well, photos of true anomalies can help substantiat=\r\ne any EVPs captured and, I might add here, the Moditronics camcorders also =\r\nrecord sound (unlike DVR cameras, such as Spectercams, where you would need=\r\n to have a separate audio recorder if you want sound to go with the images)=\r\n.&nbsp; And yes, I have&nbsp;also&nbsp;picked up&nbsp;EVPs&nbsp;on my camco=\r\nrders.&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Finally, CB, I agree with you, th=\r\ne SVP cameras that Moditronics use for their conversions are pretty flimsy =\r\nin construction (plastic casing).&nbsp; I&#39;ve accidentally banged my Deep IR=\r\n camera against the gear shift in the car and (Sob!) the bottom of the came=\r\nra broke off from the tripod.&nbsp; I duck-taped it back together and it st=\r\nill works, though (whew!).&nbsp; (And yes, I, too, have noticed that the Gh=\r\nost Hunters used&nbsp;the Moditronics full spectrum camera on one of their =\r\nshows this year.)&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Therefore, Rick, don&#39;t sweat=\r\n it.&nbsp; For what you get for the price, I think you did fine.&nbsp; But =\r\nlike CB said, don&#39;t drop these cameras or bang them around too much.&lt;/DIV&gt;\n=\r\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Lastly, I think all kinds and grades of cameras are =\r\nworth experimenting with.&nbsp; I&#39;ve even captured a very interesting light=\r\n anomaly with a cheap throwaway camera and have seen what appeared to be an=\r\n apparition taken with a point n&#39; shoot.&nbsp; So, whatever one can afford,=\r\n go with it!&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Happy Holidays Everyone!&lt;/DIV&gt;\n&lt;D=\r\nIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Sharon from SF&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;&lt;/FONT&gt;&lt;/DIV&gt;&lt;=\r\n/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;\r\n--0-1026791657-1292573505=:22979--"}