{"id": "19549", "subject": "Re: Full Spectrum Cameras", "author": "draiga1", "timestamp": "2010-12-17T17:25:35Z", "full_text": "Hi Sharon,\n\nThanks so much for the info and pics from your experiments! It seems I had read somewhere that when a camera is a true full spectrum that the visible light may wash out anything seemn in the UV or IR range. Since most of my ghost hunts tend to be restricted to daytime, the Moditronics full (duo) spectrum seems like the better camera for me right now.\n\nI do want a Spectercam 3 as well. I guess I&#39;ll have to start saving up for one. They each seem to be great cameras in their own respect.\n\n~Draiga\n\n--- In EVP-ITC@yahoogroups.com, leongbabe@... wrote:\n&gt;\n&gt; \n&gt; Hi Draiga, Ursula, CB, and Rick, and all others interested in this topic:\n&gt; \n&gt; As promised, I&#39;ve attached a jpeg with the results of my camera experiment using 1) digital point n&#39; shoot camera, 2) Moditronics Deep IR camera, 3) Moditronics Full ( &quot;Duo&quot;) Spectrum camera, and 4) a Nikon camera converted into a Full Spectrum camera.  I took these shots, one after the other, and from the same angle, in a purportedly haunted alley in San Francisco&#39;s Chinatown.  Please note that I took these photos during the day, which was one of the reasons I purchased the two Moditronics cameras - their cameras don&#39;t see into the visible spectrum and thus prevent against visible light washing out any possible images that may be lurking in the IR and UV spectrums.  And, as you can see from the attached jpeg, in the fire escape one can see what looks like a head floating in the two photos I took with Moditronics Duo Spectrum and Deep IR cameras.  In the two photos taken with the regular point n&#39; shoot camera and the full spectrum camera, you can&#39;t see the floating head at all because the visible light washed it out.  Again, for night time investigations, the drawback with the Moditronics cameras is that you will need some kind of external light source in order to see anything (or, you can always turn on some lights - if lights are available, why sit in the dark?)\n&gt; \n&gt; Ursula, don&#39;t get me wrong, I think the SpecterCam 3 is a wonderful full spectrum camera (as a matter of fact, I&#39;ve just purchased one as a present to myself!).  I&#39;m going to experiment with it and will probably buy a filter for it that will block some of the visible light because, again, I don&#39;t want visible light possibly washing out the IR and UV spectrums, especially if I investigate during the day (I also investigate a lot of battlefields and many battlefields close early).\n&gt; \n&gt; Apologies to the rest of you who may be asking, what does this have to do with EVPs?  Well, photos of true anomalies can help substantiate any EVPs captured and, I might add here, the Moditronics camcorders also record sound (unlike DVR cameras, such as Spectercams, where you would need to have a separate audio recorder if you want sound to go with the images).  And yes, I have also picked up EVPs on my camcorders. \n&gt; \n&gt; Finally, CB, I agree with you, the SVP cameras that Moditronics use for their conversions are pretty flimsy in construction (plastic casing).  I&#39;ve accidentally banged my Deep IR camera against the gear shift in the car and (Sob!) the bottom of the camera broke off from the tripod.  I duck-taped it back together and it still works, though (whew!).  (And yes, I, too, have noticed that the Ghost Hunters used the Moditronics full spectrum camera on one of their shows this year.)\n&gt; \n&gt; Therefore, Rick, don&#39;t sweat it.  For what you get for the price, I think you did fine.  But like CB said, don&#39;t drop these cameras or bang them around too much.\n&gt; \n&gt; Lastly, I think all kinds and grades of cameras are worth experimenting with.  I&#39;ve even captured a very interesting light anomaly with a cheap throwaway camera and have seen what appeared to be an apparition taken with a point n&#39; shoot.  So, whatever one can afford, go with it!\n&gt; \n&gt; Happy Holidays Everyone!\n&gt; \n&gt; Sharon from SF\n&gt;"}