{"id": "19542", "subject": "Re: [EVP-ITC] Ghost Boxes in Action", "author": "Tim Woolworth", "timestamp": "2010-12-17T02:34:23Z", "full_text": "Ursula,\n\nI agree completely. For a hack, I have yet to find one that works better and\nI have tried several.  It&#39;s cheap and sounds good and the popcorn isn&#39;t too\ndistracting.  This is the fallback hack.\n\nOn an investigation, I usually try to use one of the linear boxes I have (a\nMinibox Plus, a Joe&#39;s Box, and a Franks) for the first session.  If we do\nsubsequent sessions, it is usually on a hack because everyone in the group\nis used to the hack sounds whereas the linear boxes require an ear that uses\nthem more frequently for real time conversation.  Several people in my group\nuse GB&#39;s (5 total), but I am the only won with linear boxes.  So even though\nwe access to (arguably) better boxes for GBC, in a group situation the other\ninvestigators (with a few exceptions) prefer the step sweep sound of the 125\nbecause its what they know.\n\n\nTim\n\n\n\nOn Thu, Dec 16, 2010 at 8:57 PM, Ursula Kalin &lt;kalinu@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; I&#39;m so glad I have that hack back..its one if everything fails you can pull\n&gt; him out :)\n&gt;\n&gt; --- On *Thu, 12/16/10, Tim Woolworth &lt;tjwoolworth@...&gt;* wrote:\n&gt;\n&gt;\n&gt; From: Tim Woolworth &lt;tjwoolworth@...&gt;\n&gt; Subject: [EVP-ITC] Ghost Boxes in Action [3 Attachments]\n&gt; To: RTSC@yahoogroups.com, EVP-ITC@yahoogroups.com\n&gt; Cc: inside_the_box_rtsc_ghost_box_research@yahoogroups.com\n&gt; Date: Thursday, December 16, 2010, 6:15 PM\n&gt;\n&gt;\n&gt;\n&gt; Hi guys.\n&gt;\n&gt; As some of you know, I work with the inimitable Stacey Jones in a\n&gt; ghost hunting group called Central New York Ghost Hunters. We have a\n&gt; TV show that plays throughout Central NY (accessible to over 1.5\n&gt; million viewers total) called CNY Spirits.\n&gt;\n&gt; In this episode, which has been uploaded to youtube, you can see the\n&gt; Minibox Plus on an investigation. It was used in tandem with a poker\n&gt; game and garnered some amazing results. The Minibox was used in part\n&gt; 2, and everyones favorite shack hack was used in part 3. To my\n&gt; knowledge, this is the first time a Minibox has been used on\n&gt; television. You will have to ignore what Stacey says about the\n&gt; Minibox because she was dead wrong on most of her facts. I wish that\n&gt; the producer had interviewed me so I could have explained it a helluva\n&gt; lot better.\n&gt;\n&gt; If you are wondering, I am the goofy looking guy with the pony tail and\n&gt; tattoos.\n&gt;\n&gt; You can check out pt 1 here:\n&gt;\n&gt; http://www.youtube.com/watch?v=anxfj8Dlrus&feature=related\n&gt;\n&gt; This episode was a followup investigation to a prior one done about 6\n&gt; weeks earlier. This earlier investigation yielded some amazing EVP&#39;s\n&gt; and flashlight responses. YOu can view pt 1 here:\n&gt;\n&gt; http://www.youtube.com/watch?v=Ey6uHks4aj4&feature=related\n&gt;\n&gt; These are some of the clips from that session.\n&gt;\n&gt; The clip about &quot;pissing me off&quot; has become pretty famous because\n&gt; Stacey uses it when she lectures at conferences. It is very\n&gt; intriguing because it is her voice coming through the Hack while she\n&gt; is sitting at the table. I have discussed this clip with a few of\n&gt; you, and here it is a lot cleaner than in the video.\n&gt;\n&gt; The rest of the clips are from the poker session that were not in the\n&gt; video. On the &quot;Holding a Five&quot; clip, Mike actually had a pair of\n&gt; fives in his hand.\n&gt;\n&gt; Tim\n&gt;\n&gt;  \n&gt;\n\nU sula,I ag ee comple ely. Fo a hack, I ha e ye o ind one ha wo ks be e and I ha e ied se e al.  I 's cheap and sounds good and he popco n isn' oo dis ac ing.  This is he allback hack. \nOn an in es iga ion, I usually y o use one o he linea boxes I ha e (a Minibox Plus, a Joe's Box, and a F anks) o he i s session.  I we do subsequen sessions, i is usually on a hack because e e yone in he g oup is used o he hack sounds whe eas he linea boxes equi e an ea ha uses hem mo e equen ly o eal ime con e sa ion.  Se e al people in my g oup use GB's (5 o al), bu I am he only won wi h linea boxes.  So e en hough we access o (a guably) be e boxes o GBC, in a g oup si ua ion he o he in es iga o s (wi h a ew excep ions) p e e he s ep sweep sound o he 125 because i s wha hey know.\nTimOn Thu, Dec 16, 2010 a 8:57 PM, U sula Kalin kalinu@sbcglobal.ne > w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n I'm so glad I ha e ha hack back..i s one i e e y hing ails you can pull him ou :)\n--- On Thu, 12/16/10, Tim Woolwo h jwoolwo h@...> w o e:\nF om: Tim Woolwo h jwoolwo h@...>Subjec : [EVP-ITC] Ghos Boxes in Ac ion [3 A achmen s]\nTo: RTSC@yahoog oups.com, EVP-ITC@yahoog oups.comCc: inside_ he_box_ sc_ghos _box_ esea ch@yahoog oups.com\nDa e: Thu sday, Decembe 16, 2010, 6:15 PM\n  \n\nHi guys.As some o you know, I wo k wi h he inimi able S acey Jones in aghos hun ing g oup called Cen al New Yo k Ghos Hun e s. We ha e aTV show ha plays h oughou Cen al NY (accessible o o e 1.5\nmillion iewe s o al) called CNY Spi i s.In his episode, which has been uploaded o you ube, you can see heMinibox Plus on an in es iga ion. I was used in andem wi h a poke game and ga ne ed some amazing esul s. The Minibox was used in pa \n2, and e e yones a o i e shack hack was used in pa 3. To myknowledge, his is he i s ime a Minibox has been used on ele ision. You will ha e o igno e wha S acey says abou heMinibox because she was dead w ong on mos o he ac s. I wish ha \n he p oduce had in e iewed me so I could ha e explained i a hellu alo be e .I you a e wonde ing, I am he goo y looking guy wi h he pony ail and a oos.You can check ou p 1\n he e:h p://www.you ube.com/wa ch? =anx j8Dl us& ea u e= ela edThis episode was a ollowup in es iga ion o a p io one done abou 6\nweeks ea lie . This ea lie in es iga ion yielded some amazing EVP'sand lashligh esponses. YOu can iew p 1 he e:h p://www.you ube.com/wa ch? =Ey6uHks4aj4& ea u e= ela ed\nThese a e some o he clips om ha session.The clip abou \"pissing me o \" has become p e y amous becauseS acey uses i when she lec u es a con e ences. I is e yin iguing because i is he oice coming h ough he Hack while she\nis si ing a he able. I ha e discussed his clip wi h a ew o you, and he e i is a lo cleane han in he ideo.The es o he\n clips a e om he poke session ha we e no in he ideo. On he \"Holding a Fi e\" clip, Mike ac ually had a pai o i es in his hand.Tim"}