{"id": "19560", "subject": "Re: [EVP-ITC] Re: Full Spectrum Cameras", "author": "Ursula Kalin", "timestamp": "2010-12-17T20:16:35Z", "full_text": "--0-1586291622-1292616995=:99172\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nit is worth it..i love mine :)\n\n--- On Fri, 12/17/10, draiga1 &lt;mail@mysticc=\r\nauldron.com&gt; wrote:\n\n\nFrom: draiga1 &lt;mail@...&gt;\nSubject: [EVP=\r\n-ITC] Re: Full Spectrum Cameras\nTo: EVP-ITC@yahoogroups.com\nDate: Friday, D=\r\necember 17, 2010, 11:25 AM\n\n\n=C2=A0 \n\n\n\nHi Sharon,\n\nThanks so much for the =\r\ninfo and pics from your experiments! It seems I had read somewhere that whe=\r\nn a camera is a true full spectrum that the visible light may wash out anyt=\r\nhing seemn in the UV or IR range. Since most of my ghost hunts tend to be r=\r\nestricted to daytime, the Moditronics full (duo) spectrum seems like the be=\r\ntter camera for me right now.\n\nI do want a Spectercam 3 as well. I guess I&#39;=\r\nll have to start saving up for one. They each seem to be great cameras in t=\r\nheir own respect.\n\n~Draiga\n\n--- In EVP-ITC@yahoogroups.com, leongbabe@... w=\r\nrote:\n&gt;\n&gt; \n&gt; Hi Draiga, Ursula, CB, and Rick, and all others interested in =\r\nthis topic:\n&gt; \n&gt; As promised, I&#39;ve attached a jpeg with the results of my c=\r\namera experiment using 1) digital point n&#39; shoot camera, 2) Moditronics Dee=\r\np IR camera, 3) Moditronics Full ( &quot;Duo&quot;) Spectrum camera, and 4) a Nikon c=\r\namera converted into a Full Spectrum camera. I took these shots, one after =\r\nthe other, and from the same angle, in a purportedly haunted alley in San F=\r\nrancisco&#39;s Chinatown. Please note that I took these photos during the day, =\r\nwhich was one of the reasons I purchased the two Moditronics cameras - thei=\r\nr cameras don&#39;t see into the visible spectrum and thus prevent against visi=\r\nble light washing out any possible images that may be lurking in the IR and=\r\n UV spectrums. And, as you can see from the attached jpeg, in the fire esca=\r\npe one can see what looks like a head floating in the two photos I took wit=\r\nh Moditronics Duo Spectrum and Deep IR cameras. In the two photos taken wit=\r\nh the regular point n&#39; shoot camera and the full spectrum camera, you can&#39;t=\r\n see the\n floating head at all because the visible light washed it out. Aga=\r\nin, for night time investigations, the drawback with the Moditronics camera=\r\ns is that you will need some kind of external light source in order to see =\r\nanything (or, you can always turn on some lights - if lights are available,=\r\n why sit in the dark?)\n&gt; \n&gt; Ursula, don&#39;t get me wrong, I think the Specter=\r\nCam 3 is a wonderful full spectrum camera (as a matter of fact, I&#39;ve just p=\r\nurchased one as a present to myself!). I&#39;m going to experiment with it and =\r\nwill probably buy a filter for it that will block some of the visible light=\r\n because, again, I don&#39;t want visible light possibly washing out the IR and=\r\n UV spectrums, especially if I investigate during the day (I also investiga=\r\nte a lot of battlefields and many battlefields close early).\n&gt; \n&gt; Apologies=\r\n to the rest of you who may be asking, what does this have to do with EVPs?=\r\n Well, photos of true anomalies can help substantiate any EVPs captured and=\r\n, I might add here, the Moditronics camcorders also record sound (unlike DV=\r\nR cameras, such as Spectercams, where you would need to have a separate aud=\r\nio recorder if you want sound to go with the images). And yes, I have also =\r\npicked up EVPs on my camcorders. \n&gt; \n&gt; Finally, CB, I agree with you, the S=\r\nVP cameras that Moditronics use for their conversions are pretty flimsy in =\r\nconstruction (plastic casing). I&#39;ve accidentally banged my Deep IR camera a=\r\ngainst the gear shift in the car and (Sob!) the bottom of the camera broke =\r\noff from the tripod. I duck-taped it back together and it still works, thou=\r\ngh (whew!). (And yes, I, too, have noticed that the Ghost Hunters used the =\r\nModitronics full spectrum camera on one of their shows this year.)\n&gt; \n&gt; The=\r\nrefore, Rick, don&#39;t sweat it. For what you get for the price, I think you d=\r\nid fine. But like CB said, don&#39;t drop these cameras or bang them around too=\r\n much.\n&gt; \n&gt; Lastly, I think all kinds and grades of cameras are worth exper=\r\nimenting with. I&#39;ve even captured a very interesting light anomaly with a c=\r\nheap throwaway camera and have seen what appeared to be an apparition taken=\r\n with a point n&#39; shoot. So, whatever one can afford, go with it!\n&gt; \n&gt; Happy=\r\n Holidays Everyone!\n&gt; \n&gt; Sharon from SF\n&gt;\n\n\n\n\n\n\n\r\n--0-1586291622-1292616995=:99172\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;FONT size=3D4&gt;it is worth it..i love mine :)=\r\n&lt;/FONT&gt;&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Fri, 12/17/10, draiga1 &lt;I&gt;&lt;mail@mysticcauldron.=\r\ncom&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: rgb(16,16,255)=\r\n 2px solid; PADDING-LEFT: 5px; MARGIN-LEFT: 5px&quot;&gt;&lt;BR&gt;From: draiga1 &lt;mail=\r\n@...&gt;&lt;BR&gt;Subject: [EVP-ITC] Re: Full Spectrum Cameras&lt;BR&gt;=\r\nTo: EVP-ITC@yahoogroups.com&lt;BR&gt;Date: Friday, December 17, 2010, 11:25 AM&lt;BR=\r\n&gt;&lt;BR&gt;\n&lt;DIV id=3Dyiv165553753&gt;&lt;SPAN style=3D&quot;DISPLAY: none&quot;&gt;&nbsp;&lt;/SPAN&gt; \n&lt;=\r\nDIV id=3Dyiv165553753ygrp-text&gt;\n&lt;DIV&gt;Hi Sharon,&lt;BR&gt;&lt;BR&gt;Thanks so much for t=\r\nhe info and pics from your experiments! It seems I had read somewhere that =\r\nwhen a camera is a true full spectrum that the visible light may wash out a=\r\nnything seemn in the UV or IR range. Since most of my ghost hunts tend to b=\r\ne restricted to daytime, the Moditronics full (duo) spectrum seems like the=\r\n better camera for me right now.&lt;BR&gt;&lt;BR&gt;I do want a Spectercam 3 as well. I=\r\n guess I&#39;ll have to start saving up for one. They each seem to be great cam=\r\neras in their own respect.&lt;BR&gt;&lt;BR&gt;~Draiga&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=3D&quot;http://u=\r\ns.mc1807.mail.yahoo.com/mc/compose?to=3DEVP-ITC%40yahoogroups.com&quot; rel=3Dno=\r\nfollow target=3D_blank ymailto=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC=\r\n@yahoogroups.com&lt;/A&gt;, leongbabe@... wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; &lt;BR&gt;&gt; Hi Drai=\r\nga, Ursula, CB, and Rick, and all others interested in this topic:&lt;BR&gt;&gt; =\r\n&lt;BR&gt;&gt; As promised, I&#39;ve attached a jpeg with the results of my camera ex=\r\nperiment using 1) digital point n&#39;\n shoot camera, 2) Moditronics Deep IR ca=\r\nmera, 3) Moditronics Full ( &quot;Duo&quot;) Spectrum camera, and 4) a Nikon camera c=\r\nonverted into a Full Spectrum camera. I took these shots, one after the oth=\r\ner, and from the same angle, in a purportedly haunted alley in San Francisc=\r\no&#39;s Chinatown. Please note that I took these photos during the day, which w=\r\nas one of the reasons I purchased the two Moditronics cameras - their camer=\r\nas don&#39;t see into the visible spectrum and thus prevent against visible lig=\r\nht washing out any possible images that may be lurking in the IR and UV spe=\r\nctrums. And, as you can see from the attached jpeg, in the fire escape one =\r\ncan see what looks like a head floating in the two photos I took with Modit=\r\nronics Duo Spectrum and Deep IR cameras. In the two photos taken with the r=\r\negular point n&#39; shoot camera and the full spectrum camera, you can&#39;t see th=\r\ne floating head at all because the visible light washed it out. Again, for =\r\nnight time investigations,\n the drawback with the Moditronics cameras is th=\r\nat you will need some kind of external light source in order to see anythin=\r\ng (or, you can always turn on some lights - if lights are available, why si=\r\nt in the dark?)&lt;BR&gt;&gt; &lt;BR&gt;&gt; Ursula, don&#39;t get me wrong, I think the Sp=\r\necterCam 3 is a wonderful full spectrum camera (as a matter of fact, I&#39;ve j=\r\nust purchased one as a present to myself!). I&#39;m going to experiment with it=\r\n and will probably buy a filter for it that will block some of the visible =\r\nlight because, again, I don&#39;t want visible light possibly washing out the I=\r\nR and UV spectrums, especially if I investigate during the day (I also inve=\r\nstigate a lot of battlefields and many battlefields close early).&lt;BR&gt;&gt; &lt;=\r\nBR&gt;&gt; Apologies to the rest of you who may be asking, what does this have=\r\n to do with EVPs? Well, photos of true anomalies can help substantiate any =\r\nEVPs captured and, I might add here, the Moditronics camcorders also record=\r\n sound (unlike DVR\n cameras, such as Spectercams, where you would need to h=\r\nave a separate audio recorder if you want sound to go with the images). And=\r\n yes, I have also picked up EVPs on my camcorders. &lt;BR&gt;&gt; &lt;BR&gt;&gt; Finall=\r\ny, CB, I agree with you, the SVP cameras that Moditronics use for their con=\r\nversions are pretty flimsy in construction (plastic casing). I&#39;ve accidenta=\r\nlly banged my Deep IR camera against the gear shift in the car and (Sob!) t=\r\nhe bottom of the camera broke off from the tripod. I duck-taped it back tog=\r\nether and it still works, though (whew!). (And yes, I, too, have noticed th=\r\nat the Ghost Hunters used the Moditronics full spectrum camera on one of th=\r\neir shows this year.)&lt;BR&gt;&gt; &lt;BR&gt;&gt; Therefore, Rick, don&#39;t sweat it. For=\r\n what you get for the price, I think you did fine. But like CB said, don&#39;t =\r\ndrop these cameras or bang them around too much.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Lastly, I=\r\n think all kinds and grades of cameras are worth experimenting with. I&#39;ve e=\r\nven captured\n a very interesting light anomaly with a cheap throwaway camer=\r\na and have seen what appeared to be an apparition taken with a point n&#39; sho=\r\not. So, whatever one can afford, go with it!&lt;BR&gt;&gt; &lt;BR&gt;&gt; Happy Holiday=\r\ns Everyone!&lt;BR&gt;&gt; &lt;BR&gt;&gt; Sharon from SF&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DI=\r\nV&gt;&lt;/BLOCKQUOTE&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;\r\n--0-1586291622-1292616995=:99172--"}