{"id": "19575", "subject": "Re: [EVP-ITC] ok so im getting stuff on the spectergram", "author": "Tim Woolworth", "timestamp": "2010-12-17T21:52:14Z", "full_text": "I have tried both.  I think the Spectrogram program is too outdated and the\nresolution is really bad.  It has a save to bitmap, but does not allow you\nto save.  This program was developed for Win 95 and the last update was in\n97.  There is not even an option to register it so I am assuming it is\nunsupported software and this version was freeware for testing purposes only\n(hence the no save option).\n\nThe SEA wave software on the other hand offers much better resolution but\nless parameter tweaking.  There is no logarithmic function like the other\nsoftware has.  In the original link, the person claims to have achieved his\nresults via visual logarithms, but after seeing the visual quality of\nSpectrogram, I seriously doubt that any of the images he posted are real.\n But, this software does allow for instant snapshot saving.  As a\nfeedthrough device for GBC, it may work much like it does over on the Bridge\nsite with an instant snapshot function.  But, this version is a demo that\nonly allows for processing of 128 mB.  To actually stream a whole session,\nyou will have to upgrade the software.\n\nI still find it interesting though and it may have some use if the spirits\ncan manipulate it.  There are some amazing images that have been captured at\nthe Bridge site over the yeas.\n\nTim\n\nOn Fri, Dec 17, 2010 at 4:37 PM, Ursula Kalin &lt;kalinu@sbcglobal.net&gt; wrote:\n\n&gt;\n&gt;\n&gt; are you using the spectrogram Tim or the other? i haven&#39;t tryed that one\n&gt; yet\n&gt;\n&gt;\n&gt; --- On *Fri, 12/17/10, Tim Woolworth &lt;tjwoolworth@...&gt;* wrote:\n&gt;\n&gt;\n&gt; From: Tim Woolworth &lt;tjwoolworth@gmail.com&gt;\n&gt; Subject: Re: [EVP-ITC] ok so im getting stuff on the spectergram\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Friday, December 17, 2010, 3:31 PM\n&gt;\n&gt;\n&gt;  I have tried numerous EVP files and short box clips and so far\n&gt; nothing discernible has appeared on either program.  I still have a lot of\n&gt; hope though.\n&gt;\n&gt; I don&#39;t know about you guys, but I am going to try to work this in to a\n&gt; session tonight!\n&gt;\n&gt; Tim\n&gt;\n&gt; On Fri, Dec 17, 2010 at 4:23 PM, Ursula &lt;kalinu@...&lt;http://us.mc1807.mail.yahoo.com/mc/compose?to=kalinu@...&gt;\n&gt; &gt; wrote:\n&gt;\n&gt;\n&gt;  But I don&#39;t know how to save the image ugh...what if i just want one part\n&gt; of it..Im soo lost here..and excited at the same time LOL\n&gt;\n&gt;\n&gt;  \n&gt;\n\nI ha e ied bo h.  I hink he Spec og am p og am is oo ou da ed and he esolu ion is eally bad.  I has a sa e o bi map, bu does no allow you o sa e.  This p og am was de eloped o Win 95 and he las upda e was in 97.  The e is no e en an op ion o egis e i so I am assuming i is unsuppo ed so wa e and his e sion was eewa e o es ing pu poses only (hence he no sa e op ion).\nThe SEA wa e so wa e on he o he hand o e s much be e esolu ion bu less pa ame e weaking.  The e is no loga i hmic unc ion like he o he so wa e has.  In he o iginal link, he pe son claims o ha e achie ed his esul s ia isual loga i hms, bu a e seeing he isual quali y o Spec og am, I se iously doub ha any o he images he pos ed a e eal.  Bu , his so wa e does allow o ins an snapsho sa ing.  As a eed h ough de ice o GBC, i may wo k much like i does o e on he B idge si e wi h an ins an snapsho unc ion.  Bu , his e sion is a demo ha only allows o p ocessing o 128 mB.  To ac ually s eam a whole session, you will ha e o upg ade he so wa e.\nI s ill ind i in e es ing hough and i may ha e some use i he spi i s can manipula e i .  The e a e some amazing images ha ha e been cap u ed a he B idge si e o e he yeas.\nTimOn F i, Dec 17, 2010 a 4:37 PM, U sula Kalin kalinu@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n a e you using he spec og am Tim o he o he ? i ha en' yed ha one ye \n--- On F i, 12/17/10, Tim Woolwo h jwoolwo h@...> w o e:\nF om: Tim Woolwo h jwoolwo h@...>Subjec : Re: [EVP-ITC] ok so im ge ing s u on he spec e g am\nTo: EVP-ITC@yahoog oups.comDa e: F iday, Decembe 17, 2010, 3:31 PM\n  \n\nI ha e ied nume ous EVP iles and sho box clips and so a no hing disce nible has appea ed on ei he  p og am.  I s ill ha e a lo o hope hough.\n\nI don' know abou you guys, bu I am going o y o wo k his in o a session onigh !  \n\nTim\nOn F i, Dec 17, 2010 a 4:23 PM, U sula kalinu@...> w o e:\n\n  \n\n\n\nBu I don' know how o sa e he image ugh...wha i i jus wan one pa o i ..Im soo los he e..and exci ed a he same ime LOL"}