{"id": "19588", "subject": "Re: [EVP-ITC] Re: Full Spectrum Cameras", "author": "Ursula Kalin", "timestamp": "2010-12-18T01:05:08Z", "full_text": "--0-1902733055-1292634308=:74607\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nthanks Bill, I&#39;m a owner of the spectercam 3..and I must agree! but like yo=\r\nu said all the cams are wonderful.\n=C2=A0\nThanks for that perfect descripti=\r\non for each\n\n\n--- On Fri, 12/17/10, psi_research &lt;vilhellm@...&gt; w=\r\nrote:\n\n\nFrom: psi_research &lt;vilhellm@...&gt;\nSubject: [EVP-ITC] Re: =\r\nFull Spectrum Cameras\nTo: EVP-ITC@yahoogroups.com\nDate: Friday, December 17=\r\n, 2010, 6:51 PM\n\n\n=C2=A0 \n\n\n\n\n\nI also use SpecterCam (SC)on Fact or Faked a=\r\nnd off the show. The SC3 is certainly the most advanced model and I use tha=\r\nt one on the series since at 600 lines, it&#39;s the highest resolution and we =\r\nshoot in hi-def. It&#39;s priced at $340 but you have the added benefit of an a=\r\ndjustable image intensifier (think military night vision goggles) plus auto=\r\nswitching power supply between 24VAC or 12VDC for long distance cord runs o=\r\nr battery power. It has many other features.\n\nThe SC2 is a good compromise =\r\nbetween price/performance with 500 lines at $230 plus it has unique feature=\r\ns like motion detection and with 12VDC it can have resonable length power c=\r\nords or battery power. It is slightly more compact than the SC1 or SC3.\n\nTh=\r\ne SC1 is the way for people who want to experiement with full spec cams to =\r\nget into this research and with 380 lines at $130 its very affordable. It r=\r\nuns on 24VAC so the cord runs can be long enough to go room to room if powe=\r\nr isn&#39;t available where you want the camera set up.\n\nAll have good sized an=\r\nd sensitive CCD&#39;s coupled with a good lens and have 75ohm video out BNC tha=\r\nt you plug into a recorder or DVR. In darkened locations they are fine righ=\r\nt out of the box but if the location is brightly lit, like it was in the Ro=\r\nlling Hills conference room, I attached a douple pass filter that allows UV=\r\n and IR to pass but inhibits much of the visible spectrum. I did this to av=\r\noid overexposing the image. I offered the SC1 at $120 at the conference and=\r\n am glad to extend that deal to anyone here in the group.\n\nI have been offe=\r\nring the SC cams at all conferences I attend after purchasing them for use =\r\non the series. I really like them and compared them to other full spectrum =\r\nsolutions first. BTW, a more accurate term for virtually all cams that see =\r\ninto invisible spectrums is wide spectrum since the lens absorb some of the=\r\n wavelength but the term full spectrum is what people have come to know. Al=\r\nl of the SC models are capable of capturing very good video and light anoma=\r\nlies are showing up in the invisible spectrums which is encouraging this re=\r\nsearch.\n\nThere are more features of each camera than what I listed here but=\r\n wanted to list some of the highlights of each to help clarify the differen=\r\nces between models. \n\nA new one I now have is the SpecterCamCorder and as t=\r\nhe name implies, it has on board media storage via SD cards (not included) =\r\nplus an LCD touchscreen viewfinder. As is the case with all smaller cameras=\r\n, there are limits and advantages to downsizing but the compromise is in th=\r\ne ability to gather light onto the imager. It goes for $284 and is a well d=\r\none mobile camera that is the best of it&#39;s type in my opinion. \n\n-Bill \n\n--=\r\n- In EVP-ITC@yahoogroups.com, &quot;draiga1&quot; &lt;mail@...&gt; wrote:\n&gt;\n&gt; Hi Sharon,\n&gt; =\r\n\n&gt; Thanks so much for the info and pics from your experiments! It seems I h=\r\nad read somewhere that when a camera is a true full spectrum that the visib=\r\nle light may wash out anything seemn in the UV or IR range. Since most of m=\r\ny ghost hunts tend to be restricted to daytime, the Moditronics full (duo) =\r\nspectrum seems like the better camera for me right now.\n&gt; \n&gt; I do want a Sp=\r\nectercam 3 as well. I guess I&#39;ll have to start saving up for one. They each=\r\n seem to be great cameras in their own respect.\n&gt; \n&gt; ~Draiga\n&gt; \n&gt; --- In EV=\r\nP-ITC@yahoogroups.com, leongbabe@ wrote:\n&gt; &gt;\n&gt; &gt; \n&gt; &gt; Hi Draiga, Ursula, CB=\r\n, and Rick, and all others interested in this topic:\n&gt; &gt; \n&gt; &gt; As promised, =\r\nI&#39;ve attached a jpeg with the results of my camera experiment using 1) digi=\r\ntal point n&#39; shoot camera, 2) Moditronics Deep IR camera, 3) Moditronics Fu=\r\nll ( &quot;Duo&quot;) Spectrum camera, and 4) a Nikon camera converted into a Full Sp=\r\nectrum camera. I took these shots, one after the other, and from the same a=\r\nngle, in a purportedly haunted alley in San Francisco&#39;s Chinatown. Please n=\r\note that I took these photos during the day, which was one of the reasons I=\r\n purchased the two Moditronics cameras - their cameras don&#39;t see into the v=\r\nisible spectrum and thus prevent against visible light washing out any poss=\r\nible images that may be lurking in the IR and UV spectrums. And, as you can=\r\n see from the attached jpeg, in the fire escape one can see what looks like=\r\n a head floating in the two photos I took with Moditronics Duo Spectrum and=\r\n Deep IR cameras. In the two photos taken with the regular point n&#39; shoot c=\r\namera and the full spectrum camera, you can&#39;t see\n the floating head at all=\r\n because the visible light washed it out. Again, for night time investigati=\r\nons, the drawback with the Moditronics cameras is that you will need some k=\r\nind of external light source in order to see anything (or, you can always t=\r\nurn on some lights - if lights are available, why sit in the dark?)\n&gt; &gt; \n&gt; =\r\n&gt; Ursula, don&#39;t get me wrong, I think the SpecterCam 3 is a wonderful full =\r\nspectrum camera (as a matter of fact, I&#39;ve just purchased one as a present =\r\nto myself!). I&#39;m going to experiment with it and will probably buy a filter=\r\n for it that will block some of the visible light because, again, I don&#39;t w=\r\nant visible light possibly washing out the IR and UV spectrums, especially =\r\nif I investigate during the day (I also investigate a lot of battlefields a=\r\nnd many battlefields close early).\n&gt; &gt; \n&gt; &gt; Apologies to the rest of you wh=\r\no may be asking, what does this have to do with EVPs? Well, photos of true =\r\nanomalies can help substantiate any EVPs captured and, I might add here, th=\r\ne Moditronics camcorders also record sound (unlike DVR cameras, such as Spe=\r\nctercams, where you would need to have a separate audio recorder if you wan=\r\nt sound to go with the images). And yes, I have also picked up EVPs on my c=\r\namcorders. \n&gt; &gt; \n&gt; &gt; Finally, CB, I agree with you, the SVP cameras that Mo=\r\nditronics use for their conversions are pretty flimsy in construction (plas=\r\ntic casing). I&#39;ve accidentally banged my Deep IR camera against the gear sh=\r\nift in the car and (Sob!) the bottom of the camera broke off from the tripo=\r\nd. I duck-taped it back together and it still works, though (whew!). (And y=\r\nes, I, too, have noticed that the Ghost Hunters used the Moditronics full s=\r\npectrum camera on one of their shows this year.)\n&gt; &gt; \n&gt; &gt; Therefore, Rick, =\r\ndon&#39;t sweat it. For what you get for the price, I think you did fine. But l=\r\nike CB said, don&#39;t drop these cameras or bang them around too much.\n&gt; &gt; \n&gt; =\r\n&gt; Lastly, I think all kinds and grades of cameras are worth experimenting w=\r\nith. I&#39;ve even captured a very interesting light anomaly with a cheap throw=\r\naway camera and have seen what appeared to be an apparition taken with a po=\r\nint n&#39; shoot. So, whatever one can afford, go with it!\n&gt; &gt; \n&gt; &gt; Happy Holid=\r\nays Everyone!\n&gt; &gt; \n&gt; &gt; Sharon from SF\n&gt; &gt;\n&gt;\n\n\n\n\n\n\n\r\n--0-1902733055-1292634308=:74607\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;DIV&gt;&lt;FONT size=3D4&gt;thanks Bill, I&#39;m a owner =\r\nof the spectercam 3..and I must agree! but like you said all the cams are w=\r\nonderful.&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D4&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT s=\r\nize=3D4&gt;Thanks for that perfect description for each&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;=\r\n&lt;BR&gt;--- On &lt;B&gt;Fri, 12/17/10, psi_research &lt;I&gt;&lt;vilhellm@...&gt;=\r\n&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;&lt;/DIV&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: rgb(16,16,255) =\r\n2px solid; PADDING-LEFT: 5px; MARGIN-LEFT: 5px&quot;&gt;&lt;BR&gt;From: psi_research &lt;=\r\nvilhellm@...&gt;&lt;BR&gt;Subject: [&lt;SPAN&gt;EVP&lt;/SPAN&gt;-ITC] Re: Full Spec=\r\ntrum Cameras&lt;BR&gt;To: EVP-ITC@yahoogroups.com&lt;BR&gt;Date: Friday, December 17, 2=\r\n010, 6:51 PM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3Dyiv1954491481&gt;&lt;SPAN style=3D&quot;DISPLAY: none&quot;&gt;=\r\n&nbsp;&lt;/SPAN&gt; \n&lt;DIV id=3Dyiv1954491481ygrp-text&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;BR&gt;I also use Sp=\r\necterCam (SC)on Fact or Faked and off the show. The SC3 is certainly the mo=\r\nst advanced model and I use that one on the series since at 600 lines, it&#39;s=\r\n the highest resolution and we shoot in hi-def. It&#39;s priced at $340 but you=\r\n have the added benefit of an adjustable image intensifier (think military =\r\nnight vision goggles) plus autoswitching power supply between 24VAC or 12VD=\r\nC for long distance cord runs or battery power. It has many other features.=\r\n&lt;BR&gt;&lt;BR&gt;The SC2 is a good compromise between price/performance with 500 lin=\r\nes at $230 plus it has unique features like motion detection and with 12VDC=\r\n it can have resonable length power cords or battery power. It is slightly =\r\nmore compact than the SC1 or SC3.&lt;BR&gt;&lt;BR&gt;The SC1 is the way for people who =\r\nwant to experiement with full spec cams to get into this research and with =\r\n380 lines at $130 its very affordable. It runs on 24VAC so the cord runs ca=\r\nn be long enough to go room to room if\n power isn&#39;t available where you wan=\r\nt the camera set up.&lt;BR&gt;&lt;BR&gt;All have good sized and sensitive CCD&#39;s coupled=\r\n with a good lens and have 75ohm video out BNC that you plug into a recorde=\r\nr or DVR. In darkened locations they are fine right out of the box but if t=\r\nhe location is brightly lit, like it was in the Rolling Hills conference ro=\r\nom, I attached a douple pass filter that allows UV and IR to pass but inhib=\r\nits much of the visible spectrum. I did this to avoid overexposing the imag=\r\ne. I offered the SC1 at $120 at the conference and am glad to extend that d=\r\neal to anyone here in the group.&lt;BR&gt;&lt;BR&gt;I have been offering the SC cams at=\r\n all conferences I attend after purchasing them for use on the series. I re=\r\nally like them and compared them to other full spectrum solutions first. BT=\r\nW, a more accurate term for virtually all cams that see into invisible spec=\r\ntrums is wide spectrum since the lens absorb some of the wavelength but the=\r\n term full spectrum is what\n people have come to know. All of the SC models=\r\n are capable of capturing very good video and light anomalies are showing u=\r\np in the invisible spectrums which is encouraging this research.&lt;BR&gt;&lt;BR&gt;The=\r\nre are more features of each camera than what I listed here but wanted to l=\r\nist some of the highlights of each to help clarify the differences between =\r\nmodels. &lt;BR&gt;&lt;BR&gt;A new one I now have is the SpecterCamCorder and as the nam=\r\ne implies, it has on board media storage via SD cards (not included) plus a=\r\nn LCD touchscreen viewfinder. As is the case with all smaller cameras, ther=\r\ne are limits and advantages to downsizing but the compromise is in the abil=\r\nity to gather light onto the imager. It goes for $284 and is a well done mo=\r\nbile camera that is the best of it&#39;s type in my opinion. &lt;BR&gt;&lt;BR&gt;-Bill &lt;BR&gt;=\r\n&lt;BR&gt;--- In &lt;A href=3D&quot;http://us.mc1807.mail.yahoo.com/mc/compose?to=3DEVP-I=\r\nTC%40yahoogroups.com&quot; rel=3Dnofollow target=3D_blank\n ymailto=3D&quot;mailto:EVP=\r\n-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups.com&lt;/A&gt;, &quot;draiga1&quot; &lt;mail@...=\r\n&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; Hi Sharon,&lt;BR&gt;&gt; &lt;BR&gt;&gt; Thanks so much for =\r\nthe info and pics from your experiments! It seems I had read somewhere that=\r\n when a camera is a true full spectrum that the visible light may wash out =\r\nanything seemn in the UV or IR range. Since most of my ghost hunts tend to =\r\nbe restricted to daytime, the Moditronics full (duo) spectrum seems like th=\r\ne better camera for me right now.&lt;BR&gt;&gt; &lt;BR&gt;&gt; I do want a Spectercam 3=\r\n as well. I guess I&#39;ll have to start saving up for one. They each seem to b=\r\ne great cameras in their own respect.&lt;BR&gt;&gt; &lt;BR&gt;&gt; ~Draiga&lt;BR&gt;&gt; &lt;BR&gt;=\r\n&gt; --- In &lt;A href=3D&quot;http://us.mc1807.mail.yahoo.com/mc/compose?to=3DEVP-=\r\nITC%40yahoogroups.com&quot; rel=3Dnofollow target=3D_blank ymailto=3D&quot;mailto:EVP=\r\n-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups.com&lt;/A&gt;, leongbabe@ wrote:&lt;BR&gt;&=\r\ngt; &gt;&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; Hi Draiga, Ursula, CB,\n and Rick, and a=\r\nll others interested in this topic:&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; As promised,=\r\n I&#39;ve attached a jpeg with the results of my camera experiment using 1) dig=\r\nital point n&#39; shoot camera, 2) Moditronics Deep IR camera, 3) Moditronics F=\r\null ( &quot;Duo&quot;) Spectrum camera, and 4) a Nikon camera converted into a Full S=\r\npectrum camera. I took these shots, one after the other, and from the same =\r\nangle, in a purportedly haunted alley in San Francisco&#39;s Chinatown. Please =\r\nnote that I took these photos during the day, which was one of the reasons =\r\nI purchased the two Moditronics cameras - their cameras don&#39;t see into the =\r\nvisible spectrum and thus prevent against visible light washing out any pos=\r\nsible images that may be lurking in the IR and UV spectrums. And, as you ca=\r\nn see from the attached jpeg, in the fire escape one can see what looks lik=\r\ne a head floating in the two photos I took with Moditronics Duo Spectrum an=\r\nd Deep IR cameras. In the two photos taken with the\n regular point n&#39; shoot=\r\n camera and the full spectrum camera, you can&#39;t see the floating head at al=\r\nl because the visible light washed it out. Again, for night time investigat=\r\nions, the drawback with the Moditronics cameras is that you will need some =\r\nkind of external light source in order to see anything (or, you can always =\r\nturn on some lights - if lights are available, why sit in the dark?)&lt;BR&gt;&gt=\r\n; &gt; &lt;BR&gt;&gt; &gt; Ursula, don&#39;t get me wrong, I think the SpecterCam 3 i=\r\ns a wonderful full spectrum camera (as a matter of fact, I&#39;ve just purchase=\r\nd one as a present to myself!). I&#39;m going to experiment with it and will pr=\r\nobably buy a filter for it that will block some of the visible light becaus=\r\ne, again, I don&#39;t want visible light possibly washing out the IR and UV spe=\r\nctrums, especially if I investigate during the day (I also investigate a lo=\r\nt of battlefields and many battlefields close early).&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt;=\r\n &gt; Apologies to the rest of you who may be\n asking, what does this have =\r\nto do with EVPs? Well, photos of true anomalies can help substantiate any E=\r\nVPs captured and, I might add here, the Moditronics camcorders also record =\r\nsound (unlike DVR cameras, such as Spectercams, where you would need to hav=\r\ne a separate audio recorder if you want sound to go with the images). And y=\r\nes, I have also picked up EVPs on my camcorders. &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt=\r\n; Finally, CB, I agree with you, the SVP cameras that Moditronics use for t=\r\nheir conversions are pretty flimsy in construction (plastic casing). I&#39;ve a=\r\nccidentally banged my Deep IR camera against the gear shift in the car and =\r\n(Sob!) the bottom of the camera broke off from the tripod. I duck-taped it =\r\nback together and it still works, though (whew!). (And yes, I, too, have no=\r\nticed that the Ghost Hunters used the Moditronics full spectrum camera on o=\r\nne of their shows this year.)&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; Therefore, Rick, d=\r\non&#39;t sweat it. For what you get for the\n price, I think you did fine. But l=\r\nike CB said, don&#39;t drop these cameras or bang them around too much.&lt;BR&gt;&gt;=\r\n &gt; &lt;BR&gt;&gt; &gt; Lastly, I think all kinds and grades of cameras are wor=\r\nth experimenting with. I&#39;ve even captured a very interesting light anomaly =\r\nwith a cheap throwaway camera and have seen what appeared to be an appariti=\r\non taken with a point n&#39; shoot. So, whatever one can afford, go with it!&lt;BR=\r\n&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; Happy Holidays Everyone!&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt=\r\n; Sharon from SF&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE=\r\n&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;\r\n--0-1902733055-1292634308=:74607--"}