{"id": "19617", "subject": "Re: [EVP-ITC] Re: ok so im getting stuff on the spectergram", "author": "Tim Woolworth", "timestamp": "2010-12-18T10:07:37Z", "full_text": "I saw a couple which could be construed as images in the one series you had\nfrom SEA, but nothing that knocked me over the head yet.  I am going to have\nto see a larger sample size before I determine if what you have witnessed is\nin fact a form or not.  I cannot accept an image as paranormal without\nknowing where it sits among the bulk of audio files.  If every file has\nmultiple faces, the I would have  to say that there is nothing there.\n\nSo, I will certainly keep testing with my copy and hopefully something will\nreally pop for me.  I have run through about ten files (EVP and GBC) so far\nfor intensive study and I still haven&#39;t got anything that I would consider a\npositive hit.  I need an actual formed face, not portions thereof, to\nconsider an image real.  This is the only way to discount visual matrixing.\n\nI have high hopes for this though!\n\nTim\n\nOn Sat, Dec 18, 2010 at 5:01 AM, Ursula Kalin &lt;kalinu@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Tim did you see my images???\n&gt;\n&gt; --- On *Sat, 12/18/10, Tim Woolworth &lt;tjwoolworth@...&gt;* wrote:\n&gt;\n&gt;\n&gt; From: Tim Woolworth &lt;tjwoolworth@...&gt;\n&gt;\n&gt; Subject: Re: [EVP-ITC] Re: ok so im getting stuff on the spectergram\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Saturday, December 18, 2010, 3:26 AM\n&gt;\n&gt;\n&gt;\n&gt; I have Audition as my editor.  I am going to have to try it out.  Thanks\n&gt; Bill.\n&gt;\n&gt; Tim\n&gt;\n&gt; On Sat, Dec 18, 2010 at 1:00 AM, psi_research &lt;vilhellm@...&lt;http://us.mc1807.mail.yahoo.com/mc/compose?to=vilhellm@...&gt;\n&gt; &gt; wrote:\n&gt;\n&gt;\n&gt;  I&#39;ve seen live webcast of ITC sessions where GB output is fed directly\n&gt; into the mic line in on a computer running Adobe Audition with the\n&gt; spectragraph running. It was really compelling to see letters and numbers,\n&gt; not images or pictures, but partial words appear in the graph. At first it\n&gt; was I thought it was a software glitch but it is a repeatable event. It was\n&gt; on LiveSciFi which is run by Tim Wood, he also thought there was some kind\n&gt; of code error but it happened on more than one webcast.\n&gt;\n&gt; So if anyone has Audition, just feed Box output right in your computer and\n&gt; see what happens. I wanted to try it tonight but I have Audacity and the\n&gt; spectragraph feature doesn&#39;t have that shaded appearance that Audition does\n&gt; so it&#39;s not able to render images or characters, at least as far as I see\n&gt; using the various settings.\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com&lt;http://us.mc1807.mail.yahoo.com/mc/compose?to=EVP-ITC%40yahoogroups.com&gt;,\n&gt; Tim Woolworth &lt;tjwoolworth@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; I have tried numerous EVP files and short box clips and so far\n&gt; &gt; nothing discernible has appeared on either program. I still have a lot of\n&gt; &gt; hope though.\n&gt; &gt;\n&gt; &gt; I don&#39;t know about you guys, but I am going to try to work this in to a\n&gt; &gt; session tonight!\n&gt; &gt;\n&gt; &gt; Tim\n&gt; &gt;\n&gt; &gt; On Fri, Dec 17, 2010 at 4:23 PM, Ursula &lt;kalinu@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; But I don&#39;t know how to save the image ugh...what if i just want one\n&gt; part\n&gt; &gt; &gt; of it..Im soo lost here..and excited at the same time LOL\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;\n&gt;  \n&gt;\n\nI saw a couple which could be cons ued as images in he one se ies you had om SEA, bu no hing ha knocked me o e he head ye .  I am going o ha e o see a la ge sample size be o e I de e mine i wha you ha e wi nessed is in ac a o m o no .  I canno accep an image as pa ano mal wi hou knowing whe e i si s among he bulk o audio iles.  I e e y ile has mul iple aces, he I would ha e   o say ha he e is no hing he e.\nSo, I will ce ainly keep es ing wi h my copy and hope ully some hing will eally pop o me.  I ha e un h ough abou en iles (EVP and GBC) so a o in ensi e s udy and I s ill ha en' go any hing ha I would conside a posi i e hi .  I need an ac ual o med ace, no po ions he eo , o conside an image eal.  This is he only way o discoun isual ma ixing.\nI ha e high hopes o his hough!TimOn Sa , Dec 18, 2010 a 5:01 AM, U sula Kalin kalinu@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n Tim did you see my images???--- On Sa , 12/18/10, Tim Woolwo h jwoolwo h@...> w o e:\n\nF om: Tim Woolwo h jwoolwo h@...>Subjec : Re: [EVP-ITC] Re: ok so im ge ing s u on he spec e g am\nTo: EVP-ITC@yahoog oups.comDa e: Sa u day, Decembe 18, 2010, 3:26 AM\n  \n\nI ha e Audi ion as my edi o .  I am going o ha e o y i ou .  Thanks Bill. \n\nTim\nOn Sa , Dec 18, 2010 a 1:00 AM, psi_ esea ch ilhellm@sbcglobal.ne > w o e:\n\n\n  \n\n\n\nI' e seen li e webcas o ITC sessions whe e GB ou pu is ed di ec ly in o he mic line in on a compu e unning Adobe Audi ion wi h he spec ag aph unning. I was eally compelling o see le e s and numbe s, no images o pic u es, bu pa ial wo ds appea in he g aph. A i s i was I hough i was a so wa e gli ch bu i is a epea able e en . I was on Li eSciFi which is un by Tim Wood, he also hough he e was some kind o code e o bu i happened on mo e han one webcas . \nSo i anyone has Audi ion, jus eed Box ou pu igh in you compu e and see wha happens. I wan ed o y i onigh bu I ha e Audaci y and he spec ag aph ea u e doesn' ha e ha shaded appea ance ha Audi ion does so i 's no able o ende images o cha ac e s, a leas as a as I see using he a ious se ings.\n\n--- In EVP-ITC@yahoog oups.com, Tim Woolwo h w o e:>> I ha e ied nume ous EVP iles and sho box clips and so a \n> no hing disce nible has appea ed on ei he p og am. I s ill ha e a lo o > hope hough.> > I don' know abou you guys, bu I am going o y o wo k his in o a> session onigh !\n> > Tim> \n> On F i, Dec 17, 2010 a 4:23 PM, U sula w o e:> > >> >> > Bu I don' know how o sa e he image ugh...wha i i jus wan one pa > > o i ..Im soo los he e..and exci ed a he same ime LOL\n> >> > > >>"}