{"id": "19615", "subject": "Re: [EVP-ITC] Re: ok so im getting stuff on the spectergram", "author": "Tim Woolworth", "timestamp": "2010-12-18T09:26:44Z", "full_text": "I have Audition as my editor.  I am going to have to try it out.  Thanks\nBill.\n\nTim\n\nOn Sat, Dec 18, 2010 at 1:00 AM, psi_research &lt;vilhellm@sbcglobal.net&gt;wrote:\n\n&gt;\n&gt;\n&gt; I&#39;ve seen live webcast of ITC sessions where GB output is fed directly into\n&gt; the mic line in on a computer running Adobe Audition with the spectragraph\n&gt; running. It was really compelling to see letters and numbers, not images or\n&gt; pictures, but partial words appear in the graph. At first it was I thought\n&gt; it was a software glitch but it is a repeatable event. It was on LiveSciFi\n&gt; which is run by Tim Wood, he also thought there was some kind of code error\n&gt; but it happened on more than one webcast.\n&gt;\n&gt; So if anyone has Audition, just feed Box output right in your computer and\n&gt; see what happens. I wanted to try it tonight but I have Audacity and the\n&gt; spectragraph feature doesn&#39;t have that shaded appearance that Audition does\n&gt; so it&#39;s not able to render images or characters, at least as far as I see\n&gt; using the various settings.\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Tim Woolworth\n&gt; &lt;tjwoolworth@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; I have tried numerous EVP files and short box clips and so far\n&gt; &gt; nothing discernible has appeared on either program. I still have a lot of\n&gt; &gt; hope though.\n&gt; &gt;\n&gt; &gt; I don&#39;t know about you guys, but I am going to try to work this in to a\n&gt; &gt; session tonight!\n&gt; &gt;\n&gt; &gt; Tim\n&gt; &gt;\n&gt; &gt; On Fri, Dec 17, 2010 at 4:23 PM, Ursula &lt;kalinu@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; But I don&#39;t know how to save the image ugh...what if i just want one\n&gt; part\n&gt; &gt; &gt; of it..Im soo lost here..and excited at the same time LOL\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nI ha e Audi ion as my edi o .  I am going o ha e o y i ou .  Thanks Bill.TimOn Sa , Dec 18, 2010 a 1:00 AM, psi_ esea ch ilhellm@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n I' e seen li e webcas o ITC sessions whe e GB ou pu is ed di ec ly in o he mic line in on a compu e unning Adobe Audi ion wi h he spec ag aph unning. I was eally compelling o see le e s and numbe s, no images o pic u es, bu pa ial wo ds appea in he g aph. A i s i was I hough i was a so wa e gli ch bu i is a epea able e en . I was on Li eSciFi which is un by Tim Wood, he also hough he e was some kind o code e o bu i happened on mo e han one webcas . \n\n\nSo i anyone has Audi ion, jus eed Box ou pu igh in you compu e and see wha happens. I wan ed o y i onigh bu I ha e Audaci y and he spec ag aph ea u e doesn' ha e ha shaded appea ance ha Audi ion does so i 's no able o ende images o cha ac e s, a leas as a as I see using he a ious se ings.\n\n\n--- In EVP-ITC@yahoog oups.com, Tim Woolwo h w o e:\n>\n> I ha e ied nume ous EVP iles and sho box clips and so a \n> no hing disce nible has appea ed on ei he p og am. I s ill ha e a lo o \n> hope hough.\n> \n> I don' know abou you guys, bu I am going o y o wo k his in o a\n> session onigh !\n> \n> Tim\n> \n> On F i, Dec 17, 2010 a 4:23 PM, U sula w o e:\n> \n> >\n> >\n> > Bu I don' know how o sa e he image ugh...wha i i jus wan one pa \n> > o i ..Im soo los he e..and exci ed a he same ime LOL\n> >\n> > \n> >\n>"}