{"id": "19636", "subject": "Re: [EVP-ITC] Re: ok so im getting stuff on the spectergram", "author": "Ursula Kalin", "timestamp": "2010-12-19T05:01:09Z", "full_text": "--0-378950176-1292734869=:66261\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nI would be more inclined to believe that when these faces do occur , they a=\r\nre going to occur with a lesser frequency than multiple images in a few sec=\r\nonds of audio like Ursula&#39;s example.....\n=C2=A0\nwhat??? how would you know =\r\nthat when I only took a piece out of the picture..the face i posted did NOT=\r\n show up multiple times NOR did I say it did...why do you ALWAYS have to ac=\r\nt as if you no everything...this is something that you just heard what a co=\r\nuple of days ago...guess what..I knew about this a year ago! The person tha=\r\nt Frank mention is a mentor of mine so this is not a OMG moment for me....\n=\r\n=C2=A0\nI&#39;m not getting angry but I am getting annoyed..you act as if i post=\r\ned something with big letter saying OMG stop the press. why are you hating =\r\non my results...lets see yours..you no what I&#39;m going to say to you? good j=\r\nob can&#39;t Wait to see more..OR don&#39;t say nothing ...even more so when you do=\r\nn&#39;t no what your talking about.\n=C2=A0\nok so what the point of the reply? m=\r\nostly to say.. I did not get the same face in the whole recording actually =\r\nonly at the end...\n\n\n--- On Sat, 12/18/10, Tim Woolworth &lt;tjwoolworth@gmail=\r\n.com&gt; wrote:\n\n\nFrom: Tim Woolworth &lt;tjwoolworth@...&gt;\nSubject: Re: [EV=\r\nP-ITC] Re: ok so im getting stuff on the spectergram\nTo: EVP-ITC@yahoogroup=\r\ns.com\nDate: Saturday, December 18, 2010, 4:57 PM\n\n\n=C2=A0 \n\n\n\nNo, I don&#39;t t=\r\nhink I am being too critical, but I may have expectations that are a little=\r\n too high. =C2=A0I want to take my time with this. =C2=A0For my own underst=\r\nanding, I need to have a large sample size so I know not only what to expec=\r\nt to see, but what to look for. =C2=A0I have seen ITC snapshots from progra=\r\nms like this that offer full faces. =C2=A0I would be more inclined to belie=\r\nve in such an image as opposed to, lets say. two dark lines that may or may=\r\n not be eyebrows. \n\n\nEven in your example of the towel, you get half a face=\r\n. =C2=A0If you have half a face (on the vertical plane, not the horizontal)=\r\n you can extrapolate out what the entire face would look like. =C2=A0This i=\r\ns something I would like to get myself and I would consider that evidence i=\r\nf it showed up in one of these programs. =C2=A0But, if you have something t=\r\nhat looks like a forehead and that is all there is, then it could also look=\r\n like a rock or some other such object.\n\n\nI am certainly hoping for results=\r\n worked into box sessions. =C2=A0Directing a session with intent, like sayi=\r\nng &quot;I am going to examine the sound waves of this communication in hopes of=\r\n seeing your face. =C2=A0Is it possible you can show your face to me now th=\r\nrough sound? &quot; is what I am after. =C2=A0If a positive hit like this happen=\r\ns, then I will be jumping for joy. =C2=A0Another good example would be a na=\r\nme, lets say Tom, that occurs. =C2=A0If you get a positive affirmation that=\r\n the name you heard is present, then you try the same technique only you ad=\r\ndress Tom by name and get a face, that would be even better.\n\n\nBut, as it s=\r\ntands now, the faces as they appear are random at best. =C2=A0I would be mo=\r\nre inclined to believe that when these faces do occur , they are going to o=\r\nccur with a lesser frequency than multiple images in a few seconds of audio=\r\n like Ursula&#39;s example. =C2=A0If this where the case, there would be dozens=\r\n, and possibly hundreds, of faces during a ten minute session and I just do=\r\nn&#39;t think that is possible. =C2=A0This is why I need to look at several sam=\r\nples to find out if this is the case or not. =C2=A0If these partialized fac=\r\nes occur in multiples all the time, I would be more apt to discount it. =C2=\r\n=A0But, if they are a rarity affixed to only a few clips out of dozens, I w=\r\nould be more inclined to believe in them. =C2=A0Sample size is everything. =\r\n=C2=A0It is like listening to GBC. =C2=A0If you have never done a session b=\r\nefore, you would be inclined to believe every stray radio signal is a commu=\r\nnication. =C2=A0Only by continued practice (expanding your sample size) can=\r\n you start to\n rule out stray radio with any degree of accuracy. =C2=A0\n\n\nO=\r\nn the other hand, I am very new to this and I could certainly be wrong. =C2=\r\n=A0I will continue to plug sound into the programs and hope for the best. =\r\n=C2=A0\n\n\nI really want this to work. =C2=A0As you have probably experienced=\r\n, when they want you to hear something or know something, they make it very=\r\n obvious while communicating. =C2=A0I am hoping they apply this same rigor =\r\nto this new format to show us that they are there. =C2=A0If they can, then =\r\nthe world of video and audio ITC will merge in one source and then the skep=\r\ntics be damned!\n\n\nTim\n\n\nOn Sat, Dec 18, 2010 at 2:24 PM, Frank Sumption &lt;pu=\r\nrplealiengirl@...&gt; wrote:\n\n\n=C2=A0 \n\n\n\n\n=C2=A0I think it&#39;s unrealisti=\r\nc to expect every file to have faces and images. These faces are often just=\r\n portions, eyes and lips, some have eye brows. Like all of this, not done f=\r\nor proof, it&#39;s for emotional impact.=C2=A0 I have this woman that shows up =\r\nin towels, always just half the face. Perahps you are being too critical? A=\r\ns with all spirit messages, it&#39;s what it means to the experiencer that matt=\r\ners. Expecting full faces is like expecting the kings english and proper gr=\r\nammer in all EVPs. \n=C2=A0\nF-S\n\n\n\n\n\nOn Sat, Dec 18, 2010 at 3:07 AM, Tim Wo=\r\nolworth &lt;tjwoolworth@...&gt; wrote:\n\n\n=C2=A0 \n\n\n\nI saw a couple which co=\r\nuld be construed as images in the one series you had from SEA, but nothing =\r\nthat knocked me over the head yet. =C2=A0I am going to have to see a larger=\r\n sample size before I determine if what you have witnessed is in fact a for=\r\nm or not. =C2=A0I cannot accept an image as paranormal without knowing wher=\r\ne it sits among the bulk of audio files. =C2=A0If every file has multiple f=\r\naces, the I would have =C2=A0to say that there is nothing there. \n\n\nSo, I w=\r\nill certainly keep testing with my copy and hopefully something will really=\r\n pop for me. =C2=A0I have run through about ten files (EVP and GBC) so far =\r\nfor intensive study and I still haven&#39;t got anything that I would consider =\r\na positive hit. =C2=A0I need an actual formed face, not portions thereof, t=\r\no consider an image real. =C2=A0This is the only way to discount visual mat=\r\nrixing.\n\n\nI have high hopes for this though!\n\n\nTim \n\n\n\n\n\nOn Sat, Dec 18, 20=\r\n10 at 5:01 AM, Ursula Kalin &lt;kalinu@...&gt; wrote:\n\n\n=C2=A0 \n\n\n\n\n\n\n\n=\r\nTim did you see my images???\n\n--- On Sat, 12/18/10, Tim Woolworth &lt;tjwoolwo=\r\nrth@...&gt; wrote:\n\n\nFrom: Tim Woolworth &lt;tjwoolworth@...&gt; \n\nSubje=\r\nct: Re: [EVP-ITC] Re: ok so im getting stuff on the spectergram\nTo: EVP-ITC=\r\n@yahoogroups.com\nDate: Saturday, December 18, 2010, 3:26 AM \n\n\n\n=C2=A0 \n\nI =\r\nhave Audition as my editor. =C2=A0I am going to have to try it out. =C2=A0T=\r\nhanks Bill. \n\n\nTim\n\n\nOn Sat, Dec 18, 2010 at 1:00 AM, psi_research &lt;vilhell=\r\nm@...&gt; wrote:\n\n\n=C2=A0 \n\n\n\nI&#39;ve seen live webcast of ITC sessions=\r\n where GB output is fed directly into the mic line in on a computer running=\r\n Adobe Audition with the spectragraph running. It was really compelling to =\r\nsee letters and numbers, not images or pictures, but partial words appear i=\r\nn the graph. At first it was I thought it was a software glitch but it is a=\r\n repeatable event. It was on LiveSciFi which is run by Tim Wood, he also th=\r\nought there was some kind of code error but it happened on more than one we=\r\nbcast. \n\nSo if anyone has Audition, just feed Box output right in your comp=\r\nuter and see what happens. I wanted to try it tonight but I have Audacity a=\r\nnd the spectragraph feature doesn&#39;t have that shaded appearance that Auditi=\r\non does so it&#39;s not able to render images or characters, at least as far as=\r\n I see using the various settings.\n\n\n--- In EVP-ITC@yahoogroups.com, Tim Wo=\r\nolworth &lt;tjwoolworth@...&gt; wrote:\n&gt;\n&gt; I have tried numerous EVP files and sh=\r\nort box clips and so far\n&gt; nothing discernible has appeared on either progr=\r\nam. I still have a lot of\n&gt; hope though.\n&gt; \n&gt; I don&#39;t know about you guys, =\r\nbut I am going to try to work this in to a\n&gt; session tonight!\n&gt; \n&gt; Tim\n&gt; \n\n=\r\n&gt; On Fri, Dec 17, 2010 at 4:23 PM, Ursula &lt;kalinu@...&gt; wrote:\n&gt; \n&gt; &gt;\n&gt; &gt;\n&gt; =\r\n&gt; But I don&#39;t know how to save the image ugh...what if i just want one part=\r\n\n&gt; &gt; of it..Im soo lost here..and excited at the same time LOL\n&gt; &gt;\n&gt; &gt; \n&gt; &gt;=\r\n\n&gt;\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\r\n--0-378950176-1292734869=:66261\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;DIV&gt;I would be more inclined to believe that=\r\n when these faces do occur , they are going to occur with a lesser frequenc=\r\ny than multiple images in a few seconds of audio like Ursula&#39;s example.....=\r\n&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D4&gt;what??? how would you know tha=\r\nt when I only took a piece out of the picture..the face i posted did NOT sh=\r\now up multiple times NOR did I say it did...why do you ALWAYS have to act a=\r\ns if you no everything...this is something that you just heard what a coupl=\r\ne of days ago...guess what..I knew about this a year ago! The person that F=\r\nrank mention is a mentor of mine so this is not a OMG moment for me....&lt;/FO=\r\nNT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D4&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D4&gt;I&#39;m n=\r\not getting angry but I am getting annoyed..you act as if i posted something=\r\n with big letter saying OMG stop the press. why are you hating on my result=\r\ns...lets see yours..you no what I&#39;m going to say to you? good job can&#39;t Wai=\r\nt to see more..OR don&#39;t say nothing ...even more so when you don&#39;t no what =\r\nyour talking about.&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT size=3D4&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;D=\r\nIV&gt;&lt;FONT size=3D4&gt;ok so what the point of the reply? mostly to say.. I did =\r\nnot get the same face in the whole recording actually only at the end...&lt;/F=\r\nONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Sat, 12/18/10, Tim Woolworth &lt;I&gt;&lt;tjwoo=\r\nlworth@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;&lt;/DIV&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-L=\r\nEFT: rgb(16,16,255) 2px solid; PADDING-LEFT: 5px; MARGIN-LEFT: 5px&quot;&gt;&lt;BR&gt;Fro=\r\nm: Tim Woolworth &lt;tjwoolworth@...&gt;&lt;BR&gt;Subject: Re: [&lt;SPAN&gt;EVP&lt;/=\r\nSPAN&gt;-ITC] Re: ok so im getting stuff on the spectergram&lt;BR&gt;To: EVP-ITC@yah=\r\noogroups.com&lt;BR&gt;Date: Saturday, December 18, 2010, 4:57 PM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=\r\n=3Dyiv477107545&gt;&lt;SPAN style=3D&quot;DISPLAY: none&quot;&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV id=3Dyiv4=\r\n77107545ygrp-text&gt;\n&lt;DIV&gt;No, I don&#39;t think I am being too critical, but I ma=\r\ny have expectations that are a little too high. &nbsp;I want to take my tim=\r\ne with this. &nbsp;For my own understanding, I need to have a large sample =\r\nsize so I know not only what to expect to see, but what to look for. &nbsp;=\r\nI have seen ITC snapshots from programs like this that offer full faces. &n=\r\nbsp;I would be more inclined to believe in such an image as opposed to, let=\r\ns say. two dark lines that may or may not be eyebrows. \n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DI=\r\nV&gt;Even in your example of the towel, you get half a face. &nbsp;If you have=\r\n half a face (on the vertical plane, not the horizontal) you can extrapolat=\r\ne out what the entire face would look like. &nbsp;This is something I would=\r\n like to get myself and I would consider that evidence if it showed up in o=\r\nne of these programs. &nbsp;But, if you have something that looks like a fo=\r\nrehead and that is all there is, then it could also look like a rock or som=\r\ne other such object.&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;I am certainly hoping for r=\r\nesults worked into box sessions. &nbsp;Directing a session with intent, lik=\r\ne saying &quot;I am going to examine the sound waves of this communication in ho=\r\npes of seeing your face. &nbsp;Is it possible you can show your face to me =\r\nnow through sound? &quot; is what I am after. &nbsp;If a positive hit like this =\r\nhappens, then I will be jumping for joy. &nbsp;Another good example would b=\r\ne a name, lets say Tom, that occurs. &nbsp;If you get a positive affirmatio=\r\nn that the name you heard is present, then you try the same technique only =\r\nyou address Tom by name and get a face, that would be even better.&lt;/DIV&gt;\n&lt;D=\r\nIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;But, as it stands now, the faces as they appear are rand=\r\nom at best. &nbsp;I would be more inclined to believe that when these faces=\r\n do occur , they are going to occur with a lesser frequency than multiple i=\r\nmages in a few seconds of audio like Ursula&#39;s example. &nbsp;If this where =\r\nthe case, there would be dozens, and possibly hundreds, of faces during a t=\r\nen minute session and I just don&#39;t think that is possible. &nbsp;This is wh=\r\ny I need to look at several samples to find out if this is the case or not.=\r\n &nbsp;If these partialized faces occur in multiples all the time, I would =\r\nbe more apt to discount it. &nbsp;But, if they are a rarity affixed to only=\r\n a few clips out of dozens, I would be more inclined to believe in them. &n=\r\nbsp;Sample size is everything. &nbsp;It is like listening to GBC. &nbsp;If =\r\nyou have never done a session before, you would be inclined to believe ever=\r\ny stray radio signal is a communication. &nbsp;Only by continued practice\n =\r\n(expanding your sample size) can you start to rule out stray radio with any=\r\n degree of accuracy. &nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;On the other hand, I=\r\n am very new to this and I could certainly be wrong. &nbsp;I will continue =\r\nto plug sound into the programs and hope for the best. &nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;B=\r\nR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;I really want this to work. &nbsp;As you have probably experi=\r\nenced, when they want you to hear something or know something, they make it=\r\n very obvious while communicating. &nbsp;I am hoping they apply this same r=\r\nigor to this new format to show us that they are there. &nbsp;If they can, =\r\nthen the world of video and audio ITC will merge in one source and then the=\r\n skeptics be damned!&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;Tim&lt;BR&gt;&lt;BR&gt;\n&lt;DIV class=3Dyi=\r\nv477107545gmail_quote&gt;On Sat, Dec 18, 2010 at 2:24 PM, Frank Sumption &lt;SPAN=\r\n dir=3Dltr&gt;&lt;&lt;A href=3D&quot;http://us.mc1807.mail.yahoo.com/mc/compose?to=3Dp=\r\nurplealiengirl@...&quot; rel=3Dnofollow target=3D_blank ymailto=3D&quot;mailto:=\r\npurplealiengirl@...&quot;&gt;purplealiengirl@...&lt;/A&gt;&gt;&lt;/SPAN&gt; wrote:&lt;=\r\nBR&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: #ccc 1px solid&quot; class=3Dyiv477107545g=\r\nmail_quote&gt;\n&lt;DIV style=3D&quot;BACKGROUND-COLOR: #fff&quot;&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV=\r\n&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;I think it&#39;s unrealistic to expect eve=\r\nry file to have faces and images. These faces are often just portions, eyes=\r\n and lips, some have eye brows. Like all of this, not done for proof, it&#39;s =\r\nfor emotional impact.&nbsp; I have this woman that shows up in towels, alwa=\r\nys just half the face. Perahps you are being too critical? As with all spir=\r\nit messages, it&#39;s what it means to the experiencer that matters. Expecting =\r\nfull faces is like expecting the kings english and proper grammer in all EV=\r\nPs. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;F-S&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV =\r\nclass=3Dyiv477107545h5&gt;\n&lt;DIV class=3Dyiv477107545gmail_quote&gt;On Sat, Dec 18=\r\n, 2010 at 3:07 AM, Tim Woolworth &lt;SPAN dir=3Dltr&gt;&lt;&lt;A href=3D&quot;http://us.m=\r\nc1807.mail.yahoo.com/mc/compose?to=3Dtjwoolworth@...&quot; rel=3Dnofollow =\r\ntarget=3D_blank ymailto=3D&quot;mailto:tjwoolworth@...&quot;&gt;tjwoolworth@gmail.=\r\ncom&lt;/A&gt;&gt;&lt;/SPAN&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: #ccc 1px so=\r\nlid&quot; class=3Dyiv477107545gmail_quote&gt;\n&lt;DIV style=3D&quot;BACKGROUND-COLOR: #fff&quot;=\r\n&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;I saw a couple which could be =\r\nconstrued as images in the one series you had from SEA, but nothing that kn=\r\nocked me over the head yet. &nbsp;I am going to have to see a larger sample=\r\n size before I determine if what you have witnessed is in fact a form or no=\r\nt. &nbsp;I cannot accept an image as paranormal without knowing where it si=\r\nts among the bulk of audio files. &nbsp;If every file has multiple faces, t=\r\nhe I would have &nbsp;to say that there is nothing there. &lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;=\r\n/DIV&gt;\n&lt;DIV&gt;So, I will certainly keep testing with my copy and hopefully som=\r\nething will really pop for me. &nbsp;I have run through about ten files (EV=\r\nP and GBC) so far for intensive study and I still haven&#39;t got anything that=\r\n I would consider a positive hit. &nbsp;I need an actual formed face, not p=\r\nortions thereof, to consider an image real. &nbsp;This is the only way to d=\r\niscount visual matrixing.&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;I have high hopes for =\r\nthis though!&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;Tim \n&lt;DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;BR=\r\n&gt;\n&lt;DIV class=3Dyiv477107545gmail_quote&gt;On Sat, Dec 18, 2010 at 5:01 AM, Urs=\r\nula Kalin &lt;SPAN dir=3Dltr&gt;&lt;&lt;A href=3D&quot;http://us.mc1807.mail.yahoo.com/mc=\r\n/compose?to=3Dkalinu@...&quot; rel=3Dnofollow target=3D_blank ymailto=\r\n=3D&quot;mailto:kalinu@...&quot;&gt;kalinu@...&lt;/A&gt;&gt;&lt;/SPAN&gt; wrote:=\r\n&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: #ccc 1px solid&quot; class=3Dyiv477107545=\r\ngmail_quote&gt;\n&lt;DIV style=3D&quot;BACKGROUND-COLOR: #fff&quot;&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DI=\r\nV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;TABLE border=3D0 cellSpacing=3D0 cellPadding=3D=\r\n0&gt;\n&lt;TBODY&gt;\n&lt;TR&gt;\n&lt;TD vAlign=3Dtop&gt;Tim did you see my images???&lt;BR&gt;&lt;BR&gt;--- On=\r\n &lt;B&gt;Sat, 12/18/10, Tim Woolworth &lt;I&gt;&lt;&lt;A href=3D&quot;http://us.mc1807.mail.ya=\r\nhoo.com/mc/compose?to=3Dtjwoolworth@...&quot; rel=3Dnofollow target=3D_bla=\r\nnk ymailto=3D&quot;mailto:tjwoolworth@...&quot;&gt;tjwoolworth@...&lt;/A&gt;&gt;&lt;/=\r\nI&gt;&lt;/B&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: rgb(16,16,255) 2px soli=\r\nd&quot;&gt;&lt;BR&gt;From: Tim Woolworth &lt;&lt;A href=3D&quot;http://us.mc1807.mail.yahoo.com/m=\r\nc/compose?to=3Dtjwoolworth@...&quot; rel=3Dnofollow target=3D_blank ymailt=\r\no=3D&quot;mailto:tjwoolworth@...&quot;&gt;tjwoolworth@...&lt;/A&gt;&gt; \n&lt;DIV&gt;&lt;BR&gt;=\r\nSubject: Re: [&lt;SPAN&gt;EVP&lt;/SPAN&gt;-ITC] Re: ok so im getting stuff on the spect=\r\nergram&lt;BR&gt;To: &lt;A href=3D&quot;http://us.mc1807.mail.yahoo.com/mc/compose?to=3DEV=\r\nP-ITC@yahoogroups.com&quot; rel=3Dnofollow target=3D_blank ymailto=3D&quot;mailto:EVP=\r\n-ITC@yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups.com&lt;/A&gt;&lt;BR&gt;&lt;/DIV&gt;Date: Saturday, =\r\nDecember 18, 2010, 3:26 AM \n&lt;DIV&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;DIV&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV&gt;\n&lt;=\r\nDIV&gt;I have Audition as my editor. &nbsp;I am going to have to try it out. &=\r\nnbsp;Thanks Bill. \n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;Tim&lt;BR&gt;&lt;BR&gt;\n&lt;DIV&gt;On Sat, Dec 18, 20=\r\n10 at 1:00 AM, psi_research &lt;SPAN dir=3Dltr&gt;&lt;&lt;A href=3D&quot;http://us.mc1807=\r\n.mail.yahoo.com/mc/compose?to=3Dvilhellm@...&quot; rel=3Dnofollow targ=\r\net=3D_blank&gt;vilhellm@...&lt;/A&gt;&gt;&lt;/SPAN&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE st=\r\nyle=3D&quot;BORDER-LEFT: #ccc 1px solid&quot;&gt;\n&lt;DIV style=3D&quot;BACKGROUND-COLOR: #fff&quot;&gt;=\r\n&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;I&#39;ve seen live webcast of ITC s=\r\nessions where GB output is fed directly into the mic line in on a computer =\r\nrunning Adobe Audition with the spectragraph running. It was really compell=\r\ning to see letters and numbers, not images or pictures, but partial words a=\r\nppear in the graph. At first it was I thought it was a software glitch but =\r\nit is a repeatable event. It was on LiveSciFi which is run by Tim Wood, he =\r\nalso thought there was some kind of code error but it happened on more than=\r\n one webcast. &lt;BR&gt;&lt;BR&gt;So if anyone has Audition, just feed Box output right=\r\n in your computer and see what happens. I wanted to try it tonight but I ha=\r\nve Audacity and the spectragraph feature doesn&#39;t have that shaded appearanc=\r\ne that Audition does so it&#39;s not able to render images or characters, at le=\r\nast as far as I see using the various settings.&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;BR&gt;--- In &lt;=\r\nA href=3D&quot;http://us.mc1807.mail.yahoo.com/mc/compose?to=3DEVP-ITC%40yahoogr=\r\noups.com&quot; rel=3Dnofollow target=3D_blank&gt;EVP-ITC@yahoogroups.com&lt;/A&gt;, Tim W=\r\noolworth &lt;tjwoolworth@...&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; I have tried numero=\r\nus EVP files and short box clips and so far&lt;BR&gt;&gt; nothing discernible has=\r\n appeared on either program. I still have a lot of&lt;BR&gt;&gt; hope though.&lt;BR&gt;=\r\n&gt; &lt;BR&gt;&gt; I don&#39;t know about you guys, but I am going to try to work th=\r\nis in to a&lt;BR&gt;&gt; session tonight!&lt;BR&gt;&gt; &lt;BR&gt;&gt; Tim&lt;BR&gt;&gt; &lt;BR&gt;&lt;/DIV&gt;=\r\n\n&lt;DIV&gt;&gt; On Fri, Dec 17, 2010 at 4:23 PM, Ursula &lt;kalinu@...&gt; wrote=\r\n:&lt;BR&gt;&gt; &lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt; But I don&#39;t know how to s=\r\nave the image ugh...what if i just want one part&lt;BR&gt;&gt; &gt; of it..Im soo=\r\n lost here..and excited at the same time LOL&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt; &lt;BR&gt;=\r\n&gt; &gt;&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV style=3D&quot;COLOR: #fff=\r\n&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/=\r\nDIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/TD&gt;&lt;/TR&gt;&lt;/TBODY&gt;&lt;/TABLE&gt;\n&lt;DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV style=3D=\r\n&quot;COLOR: #fff&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/=\r\nDIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV style=3D&quot;COLOR: #fff&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;=\r\n/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV style=\r\n=3D&quot;COLOR: #fff&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV=\r\n&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;\r\n--0-378950176-1292734869=:66261--"}