{"id": "19640", "subject": "Re: [EVP-ITC] Re: ok so im getting stuff on the spectergram [2 Attachments]", "author": "Ursula Kalin", "timestamp": "2010-12-19T08:56:55Z", "full_text": "--0-788664451-1292749016=:90255\r\nContent-Type: multipart/alternative; boundary=&quot;0-1051935207-1292749016=:90255&quot;\r\n\r\n\r\n--0-1051935207-1292749016=:90255\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nThank you, Frank I live these to!! the one at the buttom of the screen the =\r\nhas a shine to it! and the peeking man looks creepy\n=C2=A0\nthe one in color=\r\n are they same two pictures i just added color\n\n--- On Sun, 12/19/10, Frank=\r\n Sumption &lt;purplealiengirl@...&gt; wrote:\n\n\nFrom: Frank Sumption &lt;purple=\r\naliengirl@...&gt;\nSubject: Re: [EVP-ITC] Re: ok so im getting stuff on t=\r\nhe spectergram [2 Attachments]\nTo: EVP-ITC@yahoogroups.com\nDate: Sunday, De=\r\ncember 19, 2010, 12:47 AM\n\n\n=C2=A0 \n\n\n[Attachment(s) from Frank Sumption in=\r\ncluded below] \n\nI think the youtube video from Kieth(forgot his last name) =\r\nof ITCbridge shows many good face, and Ursula&#39;s as well. I mean, it&#39;s not g=\r\noing to look like a photograph.\n=C2=A0\n=C2=A0Third circled face from the le=\r\nft, I mean, ya can&#39;t get much better eye detail than that, those are human =\r\nfeatures, not random noise. It&#39;s the same with people people that supposedl=\r\ny test the boxes objectively, if they don&#39;t want to hear, they won&#39;t. Same =\r\nwith seeing images in the clouds, &quot;they&quot; as in the establishment, aka the m=\r\nan, have us all so freaking brainwashed that we are affraid to look. I thin=\r\nk you&#39;re being so critical that you are affraid to see. \n=C2=A0\nF-S\n\n\nOn Sa=\r\nt, Dec 18, 2010 at 3:57 PM, Tim Woolworth &lt;tjwoolworth@...&gt; wrote:\n\n\n=\r\n=C2=A0 \n\n\n\nNo, I don&#39;t think I am being too critical, but I may have expect=\r\nations that are a little too high. =C2=A0I want to take my time with this. =\r\n=C2=A0For my own understanding, I need to have a large sample size so I kno=\r\nw not only what to expect to see, but what to look for. =C2=A0I have seen I=\r\nTC snapshots from programs like this that offer full faces. =C2=A0I would b=\r\ne more inclined to believe in such an image as opposed to, lets say. two da=\r\nrk lines that may or may not be eyebrows. \n\n\nEven in your example of the to=\r\nwel, you get half a face. =C2=A0If you have half a face (on the vertical pl=\r\nane, not the horizontal) you can extrapolate out what the entire face would=\r\n look like. =C2=A0This is something I would like to get myself and I would =\r\nconsider that evidence if it showed up in one of these programs. =C2=A0But,=\r\n if you have something that looks like a forehead and that is all there is,=\r\n then it could also look like a rock or some other such object.\n\n\nI am cert=\r\nainly hoping for results worked into box sessions. =C2=A0Directing a sessio=\r\nn with intent, like saying &quot;I am going to examine the sound waves of this c=\r\nommunication in hopes of seeing your face. =C2=A0Is it possible you can sho=\r\nw your face to me now through sound? &quot; is what I am after. =C2=A0If a posit=\r\nive hit like this happens, then I will be jumping for joy. =C2=A0Another go=\r\nod example would be a name, lets say Tom, that occurs. =C2=A0If you get a p=\r\nositive affirmation that the name you heard is present, then you try the sa=\r\nme technique only you address Tom by name and get a face, that would be eve=\r\nn better.\n\n\nBut, as it stands now, the faces as they appear are random at b=\r\nest. =C2=A0I would be more inclined to believe that when these faces do occ=\r\nur , they are going to occur with a lesser frequency than multiple images i=\r\nn a few seconds of audio like Ursula&#39;s example. =C2=A0If this where the cas=\r\ne, there would be dozens, and possibly hundreds, of faces during a ten minu=\r\nte session and I just don&#39;t think that is possible. =C2=A0This is why I nee=\r\nd to look at several samples to find out if this is the case or not. =C2=A0=\r\nIf these partialized faces occur in multiples all the time, I would be more=\r\n apt to discount it. =C2=A0But, if they are a rarity affixed to only a few =\r\nclips out of dozens, I would be more inclined to believe in them. =C2=A0Sam=\r\nple size is everything. =C2=A0It is like listening to GBC. =C2=A0If you hav=\r\ne never done a session before, you would be inclined to believe every stray=\r\n radio signal is a communication. =C2=A0Only by continued practice (expandi=\r\nng your sample size) can you start to\n rule out stray radio with any degree=\r\n of accuracy. =C2=A0\n\n\nOn the other hand, I am very new to this and I could=\r\n certainly be wrong. =C2=A0I will continue to plug sound into the programs =\r\nand hope for the best. =C2=A0\n\n\nI really want this to work. =C2=A0As you ha=\r\nve probably experienced, when they want you to hear something or know somet=\r\nhing, they make it very obvious while communicating. =C2=A0I am hoping they=\r\n apply this same rigor to this new format to show us that they are there. =\r\n=C2=A0If they can, then the world of video and audio ITC will merge in one =\r\nsource and then the skeptics be damned!\n\n\nTim \n\n\n\n\n\nOn Sat, Dec 18, 2010 at=\r\n 2:24 PM, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n\n\n=C2=A0 \n\n\n\n\n=\r\n=C2=A0I think it&#39;s unrealistic to expect every file to have faces and image=\r\ns. These faces are often just portions, eyes and lips, some have eye brows.=\r\n Like all of this, not done for proof, it&#39;s for emotional impact.=C2=A0 I h=\r\nave this woman that shows up in towels, always just half the face. Perahps =\r\nyou are being too critical? As with all spirit messages, it&#39;s what it means=\r\n to the experiencer that matters. Expecting full faces is like expecting th=\r\ne kings english and proper grammer in all EVPs. \n=C2=A0\nF-S\n\n\n\n\n\nOn Sat, De=\r\nc 18, 2010 at 3:07 AM, Tim Woolworth &lt;tjwoolworth@...&gt; wrote:\n\n\n=C2=\r\n=A0 \n\n\n\nI saw a couple which could be construed as images in the one series=\r\n you had from SEA, but nothing that knocked me over the head yet. =C2=A0I a=\r\nm going to have to see a larger sample size before I determine if what you =\r\nhave witnessed is in fact a form or not. =C2=A0I cannot accept an image as =\r\nparanormal without knowing where it sits among the bulk of audio files. =C2=\r\n=A0If every file has multiple faces, the I would have =C2=A0to say that the=\r\nre is nothing there. \n\n\nSo, I will certainly keep testing with my copy and =\r\nhopefully something will really pop for me. =C2=A0I have run through about =\r\nten files (EVP and GBC) so far for intensive study and I still haven&#39;t got =\r\nanything that I would consider a positive hit. =C2=A0I need an actual forme=\r\nd face, not portions thereof, to consider an image real. =C2=A0This is the =\r\nonly way to discount visual matrixing.\n\n\nI have high hopes for this though!=\r\n\n\n\nTim \n\n\n\n\n\nOn Sat, Dec 18, 2010 at 5:01 AM, Ursula Kalin &lt;kalinu@sbcgloba=\r\nl.net&gt; wrote:\n\n\n=C2=A0 \n\n\n\n\n\n\n\nTim did you see my images???\n\n--- On Sat, 12=\r\n/18/10, Tim Woolworth &lt;tjwoolworth@...&gt; wrote:\n\n\nFrom: Tim Woolworth =\r\n&lt;tjwoolworth@...&gt; \n\nSubject: Re: [EVP-ITC] Re: ok so im getting stuff=\r\n on the spectergram\nTo: EVP-ITC@yahoogroups.com\nDate: Saturday, December 18=\r\n, 2010, 3:26 AM \n\n\n\n=C2=A0 \n\nI have Audition as my editor. =C2=A0I am going=\r\n to have to try it out. =C2=A0Thanks Bill. \n\n\nTim\n\n\nOn Sat, Dec 18, 2010 at=\r\n 1:00 AM, psi_research &lt;vilhellm@...&gt; wrote:\n\n\n=C2=A0 \n\n\n\nI&#39;ve se=\r\nen live webcast of ITC sessions where GB output is fed directly into the mi=\r\nc line in on a computer running Adobe Audition with the spectragraph runnin=\r\ng. It was really compelling to see letters and numbers, not images or pictu=\r\nres, but partial words appear in the graph. At first it was I thought it wa=\r\ns a software glitch but it is a repeatable event. It was on LiveSciFi which=\r\n is run by Tim Wood, he also thought there was some kind of code error but =\r\nit happened on more than one webcast. \n\nSo if anyone has Audition, just fee=\r\nd Box output right in your computer and see what happens. I wanted to try i=\r\nt tonight but I have Audacity and the spectragraph feature doesn&#39;t have tha=\r\nt shaded appearance that Audition does so it&#39;s not able to render images or=\r\n characters, at least as far as I see using the various settings.\n\n\n--- In =\r\nEVP-ITC@yahoogroups.com, Tim Woolworth &lt;tjwoolworth@...&gt; wrote:\n&gt;\n&gt; I have =\r\ntried numerous EVP files and short box clips and so far\n&gt; nothing discernib=\r\nle has appeared on either program. I still have a lot of\n&gt; hope though.\n&gt; \n=\r\n&gt; I don&#39;t know about you guys, but I am going to try to work this in to a\n&gt;=\r\n session tonight!\n&gt; \n&gt; Tim\n&gt; \n\n&gt; On Fri, Dec 17, 2010 at 4:23 PM, Ursula &lt;k=\r\nalinu@...&gt; wrote:\n&gt; \n&gt; &gt;\n&gt; &gt;\n&gt; &gt; But I don&#39;t know how to save the image ugh=\r\n...what if i just want one part\n&gt; &gt; of it..Im soo lost here..and excited at=\r\n the same time LOL\n&gt; &gt;\n&gt; &gt; \n&gt; &gt;\n&gt;\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\r\n--0-1051935207-1292749016=:90255\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;DIV&gt;Thank you, Frank I live these to!! the o=\r\nne at the buttom of the screen the has a shine to it! and the peeking man l=\r\nooks creepy&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;the one in color are they same two=\r\n pictures i just added color&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Sun, 12/19/10, Frank Sumption=\r\n &lt;I&gt;&lt;purplealiengirl@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;&lt;/DIV&gt;\n&lt;BLOCKQUOTE =\r\nstyle=3D&quot;BORDER-LEFT: rgb(16,16,255) 2px solid; PADDING-LEFT: 5px; MARGIN-L=\r\nEFT: 5px&quot;&gt;&lt;BR&gt;From: Frank Sumption &lt;purplealiengirl@...&gt;&lt;BR&gt;Sub=\r\nject: Re: [EVP-ITC] Re: ok so im getting stuff on the spectergram [2 Attach=\r\nments]&lt;BR&gt;To: EVP-ITC@yahoogroups.com&lt;BR&gt;Date: Sunday, December 19, 2010, 1=\r\n2:47 AM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3Dyiv526584542&gt;&lt;SPAN style=3D&quot;DISPLAY: none&quot;&gt;&nbsp;=\r\n&lt;/SPAN&gt; \n&lt;DIV id=3Dyiv526584542ygrp-text&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;I think the youtube vi=\r\ndeo from Kieth(forgot his last name) of ITCbridge shows many good face, and=\r\n Ursula&#39;s as well. I mean, it&#39;s not going to look like a photograph.&lt;/DIV&gt;\n=\r\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;Third circled face from the left, I mean, ya c=\r\nan&#39;t get much better eye detail than that, those are human features, not ra=\r\nndom noise. It&#39;s the same with people people that supposedly test the boxes=\r\n objectively, if they don&#39;t want to hear, they won&#39;t. Same with seeing imag=\r\nes in the clouds, &quot;they&quot; as in the establishment, aka the man, have us all =\r\nso freaking brainwashed that we are affraid to look. I think you&#39;re being s=\r\no critical that you are affraid to see. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;F-S&lt;B=\r\nR&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV class=3Dyiv526584542gmail_quote&gt;On Sat, Dec 18, 2010 at 3=\r\n:57 PM, Tim Woolworth &lt;SPAN dir=3Dltr&gt;&lt;&lt;A href=3D&quot;http://us.mc1807.mail.=\r\nyahoo.com/mc/compose?to=3Dtjwoolworth@...&quot; rel=3Dnofollow target=3D_b=\r\nlank ymailto=3D&quot;mailto:tjwoolworth@...&quot;&gt;tjwoolworth@...&lt;/A&gt;&gt;=\r\n&lt;/SPAN&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: #ccc 1px solid&quot; class=\r\n=3Dyiv526584542gmail_quote&gt;\n&lt;DIV style=3D&quot;BACKGROUND-COLOR: #fff&quot;&gt;&lt;SPAN&gt;&nb=\r\nsp;&lt;/SPAN&gt; \n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;No, I don&#39;t think I am being too critica=\r\nl, but I may have expectations that are a little too high. &nbsp;I want to =\r\ntake my time with this. &nbsp;For my own understanding, I need to have a la=\r\nrge sample size so I know not only what to expect to see, but what to look =\r\nfor. &nbsp;I have seen ITC snapshots from programs like this that offer ful=\r\nl faces. &nbsp;I would be more inclined to believe in such an image as oppo=\r\nsed to, lets say. two dark lines that may or may not be eyebrows. \n&lt;DIV&gt;&lt;BR=\r\n&gt;&lt;/DIV&gt;\n&lt;DIV&gt;Even in your example of the towel, you get half a face. &nbsp;=\r\nIf you have half a face (on the vertical plane, not the horizontal) you can=\r\n extrapolate out what the entire face would look like. &nbsp;This is someth=\r\ning I would like to get myself and I would consider that evidence if it sho=\r\nwed up in one of these programs. &nbsp;But, if you have something that look=\r\ns like a forehead and that is all there is, then it could also look like a =\r\nrock or some other such object.&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;I am certainly h=\r\noping for results worked into box sessions. &nbsp;Directing a session with =\r\nintent, like saying &quot;I am going to examine the sound waves of this communic=\r\nation in hopes of seeing your face. &nbsp;Is it possible you can show your =\r\nface to me now through sound? &quot; is what I am after. &nbsp;If a positive hit=\r\n like this happens, then I will be jumping for joy. &nbsp;Another good exam=\r\nple would be a name, lets say Tom, that occurs. &nbsp;If you get a positive=\r\n affirmation that the name you heard is present, then you try the same tech=\r\nnique only you address Tom by name and get a face, that would be even bette=\r\nr.&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;But, as it stands now, the faces as they appe=\r\nar are random at best. &nbsp;I would be more inclined to believe that when =\r\nthese faces do occur , they are going to occur with a lesser frequency than=\r\n multiple images in a few seconds of audio like Ursula&#39;s example. &nbsp;If =\r\nthis where the case, there would be dozens, and possibly hundreds, of faces=\r\n during a ten minute session and I just don&#39;t think that is possible. &nbsp=\r\n;This is why I need to look at several samples to find out if this is the c=\r\nase or not. &nbsp;If these partialized faces occur in multiples all the tim=\r\ne, I would be more apt to discount it. &nbsp;But, if they are a rarity affi=\r\nxed to only a few clips out of dozens, I would be more inclined to believe =\r\nin them. &nbsp;Sample size is everything. &nbsp;It is like listening to GBC=\r\n. &nbsp;If you have never done a session before, you would be inclined to b=\r\nelieve every stray radio signal is a communication. &nbsp;Only by continued=\r\n practice\n (expanding your sample size) can you start to rule out stray rad=\r\nio with any degree of accuracy. &nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;On the ot=\r\nher hand, I am very new to this and I could certainly be wrong. &nbsp;I wil=\r\nl continue to plug sound into the programs and hope for the best. &nbsp;&lt;/D=\r\nIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;I really want this to work. &nbsp;As you have prob=\r\nably experienced, when they want you to hear something or know something, t=\r\nhey make it very obvious while communicating. &nbsp;I am hoping they apply =\r\nthis same rigor to this new format to show us that they are there. &nbsp;If=\r\n they can, then the world of video and audio ITC will merge in one source a=\r\nnd then the skeptics be damned!&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;Tim \n&lt;DIV&gt;\n&lt;DIV&gt;=\r\n&lt;/DIV&gt;\n&lt;DIV class=3Dyiv526584542h5&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;DIV class=3Dyiv526584542gmail_=\r\nquote&gt;On Sat, Dec 18, 2010 at 2:24 PM, Frank Sumption &lt;SPAN dir=3Dltr&gt;&lt;&lt;=\r\nA href=3D&quot;http://us.mc1807.mail.yahoo.com/mc/compose?to=3Dpurplealiengirl@g=\r\nmail.com&quot; rel=3Dnofollow target=3D_blank ymailto=3D&quot;mailto:purplealiengirl@=\r\ngmail.com&quot;&gt;purplealiengirl@...&lt;/A&gt;&gt;&lt;/SPAN&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE =\r\nstyle=3D&quot;BORDER-LEFT: #ccc 1px solid&quot; class=3Dyiv526584542gmail_quote&gt;\n&lt;DIV=\r\n style=3D&quot;BACKGROUND-COLOR: #fff&quot;&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;D=\r\nIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;I think it&#39;s unrealistic to expect every file to have =\r\nfaces and images. These faces are often just portions, eyes and lips, some =\r\nhave eye brows. Like all of this, not done for proof, it&#39;s for emotional im=\r\npact.&nbsp; I have this woman that shows up in towels, always just half the=\r\n face. Perahps you are being too critical? As with all spirit messages, it&#39;=\r\ns what it means to the experiencer that matters. Expecting full faces is li=\r\nke expecting the kings english and proper grammer in all EVPs. &lt;/DIV&gt;\n&lt;DIV&gt;=\r\n&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;F-S&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;\n&lt;DIV class=3Dyi=\r\nv526584542gmail_quote&gt;On Sat, Dec 18, 2010 at 3:07 AM, Tim Woolworth &lt;SPAN =\r\ndir=3Dltr&gt;&lt;&lt;A href=3D&quot;http://us.mc1807.mail.yahoo.com/mc/compose?to=3Dtj=\r\nwoolworth@...&quot; rel=3Dnofollow target=3D_blank ymailto=3D&quot;mailto:tjwoo=\r\nlworth@...&quot;&gt;tjwoolworth@...&lt;/A&gt;&gt;&lt;/SPAN&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUO=\r\nTE style=3D&quot;BORDER-LEFT: #ccc 1px solid&quot; class=3Dyiv526584542gmail_quote&gt;\n&lt;=\r\nDIV style=3D&quot;BACKGROUND-COLOR: #fff&quot;&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;=\r\n\n&lt;DIV&gt;I saw a couple which could be construed as images in the one series y=\r\nou had from SEA, but nothing that knocked me over the head yet. &nbsp;I am =\r\ngoing to have to see a larger sample size before I determine if what you ha=\r\nve witnessed is in fact a form or not. &nbsp;I cannot accept an image as pa=\r\nranormal without knowing where it sits among the bulk of audio files. &nbsp=\r\n;If every file has multiple faces, the I would have &nbsp;to say that there=\r\n is nothing there. &lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;So, I will certainly keep te=\r\nsting with my copy and hopefully something will really pop for me. &nbsp;I =\r\nhave run through about ten files (EVP and GBC) so far for intensive study a=\r\nnd I still haven&#39;t got anything that I would consider a positive hit. &nbsp=\r\n;I need an actual formed face, not portions thereof, to consider an image r=\r\neal. &nbsp;This is the only way to discount visual matrixing.&lt;/DIV&gt;\n&lt;DIV&gt;&lt;B=\r\nR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;I have high hopes for this though!&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV=\r\n&gt;Tim \n&lt;DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;DIV class=3Dyiv526584542gmail_quote&gt;=\r\nOn Sat, Dec 18, 2010 at 5:01 AM, Ursula Kalin &lt;SPAN dir=3Dltr&gt;&lt;&lt;A href=\r\n=3D&quot;http://us.mc1807.mail.yahoo.com/mc/compose?to=3Dkalinu@...&quot; r=\r\nel=3Dnofollow target=3D_blank ymailto=3D&quot;mailto:kalinu@...&quot;&gt;kalin=\r\nu@...&lt;/A&gt;&gt;&lt;/SPAN&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT:=\r\n #ccc 1px solid&quot; class=3Dyiv526584542gmail_quote&gt;\n&lt;DIV style=3D&quot;BACKGROUND-=\r\nCOLOR: #fff&quot;&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;TABLE bord=\r\ner=3D0 cellSpacing=3D0 cellPadding=3D0&gt;\n&lt;TBODY&gt;\n&lt;TR&gt;\n&lt;TD vAlign=3Dtop&gt;Tim d=\r\nid you see my images???&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Sat, 12/18/10, Tim Woolworth &lt;I&gt;&l=\r\nt;&lt;A href=3D&quot;http://us.mc1807.mail.yahoo.com/mc/compose?to=3Dtjwoolworth@gm=\r\nail.com&quot; rel=3Dnofollow target=3D_blank ymailto=3D&quot;mailto:tjwoolworth@gmail=\r\n.com&quot;&gt;tjwoolworth@...&lt;/A&gt;&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D=\r\n&quot;BORDER-LEFT: rgb(16,16,255) 2px solid&quot;&gt;&lt;BR&gt;From: Tim Woolworth &lt;&lt;A href=\r\n=3D&quot;http://us.mc1807.mail.yahoo.com/mc/compose?to=3Dtjwoolworth@...&quot; =\r\nrel=3Dnofollow target=3D_blank ymailto=3D&quot;mailto:tjwoolworth@...&quot;&gt;tjw=\r\noolworth@...&lt;/A&gt;&gt; \n&lt;DIV&gt;&lt;BR&gt;Subject: Re: [&lt;SPAN&gt;EVP&lt;/SPAN&gt;-ITC] Re=\r\n: ok so im getting stuff on the spectergram&lt;BR&gt;To: &lt;A href=3D&quot;http://us.mc1=\r\n807.mail.yahoo.com/mc/compose?to=3DEVP-ITC@yahoogroups.com&quot; rel=3Dnofollow =\r\ntarget=3D_blank ymailto=3D&quot;mailto:EVP-ITC@yahoogroups.com&quot;&gt;EVP-ITC@yahoogro=\r\nups.com&lt;/A&gt;&lt;BR&gt;&lt;/DIV&gt;Date: Saturday, December 18, 2010, 3:26 AM \n&lt;DIV&gt;&lt;BR&gt;&lt;=\r\nBR&gt;\n&lt;DIV&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV&gt;\n&lt;DIV&gt;I have Audition as my editor. &nbs=\r\np;I am going to have to try it out. &nbsp;Thanks Bill. \n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DI=\r\nV&gt;Tim&lt;BR&gt;&lt;BR&gt;\n&lt;DIV&gt;On Sat, Dec 18, 2010 at 1:00 AM, psi_research &lt;SPAN dir=\r\n=3Dltr&gt;&lt;&lt;A href=3D&quot;http://us.mc1807.mail.yahoo.com/mc/compose?to=3Dvilhe=\r\nllm@...&quot; rel=3Dnofollow target=3D_blank&gt;vilhellm@...&lt;/A=\r\n&gt;&gt;&lt;/SPAN&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: #ccc 1px solid&quot;&gt;\n=\r\n&lt;DIV style=3D&quot;BACKGROUND-COLOR: #fff&quot;&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV=\r\n&gt;\n&lt;DIV&gt;I&#39;ve seen live webcast of ITC sessions where GB output is fed direct=\r\nly into the mic line in on a computer running Adobe Audition with the spect=\r\nragraph running. It was really compelling to see letters and numbers, not i=\r\nmages or pictures, but partial words appear in the graph. At first it was I=\r\n thought it was a software glitch but it is a repeatable event. It was on L=\r\niveSciFi which is run by Tim Wood, he also thought there was some kind of c=\r\node error but it happened on more than one webcast. &lt;BR&gt;&lt;BR&gt;So if anyone ha=\r\ns Audition, just feed Box output right in your computer and see what happen=\r\ns. I wanted to try it tonight but I have Audacity and the spectragraph feat=\r\nure doesn&#39;t have that shaded appearance that Audition does so it&#39;s not able=\r\n to render images or characters, at least as far as I see using the various=\r\n settings.&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=3D&quot;http://us.mc1807.mail.yahoo=\r\n.com/mc/compose?to=3DEVP-ITC%40yahoogroups.com&quot; rel=3Dnofollow target=3D_bl=\r\nank&gt;EVP-ITC@yahoogroups.com&lt;/A&gt;, Tim Woolworth &lt;tjwoolworth@...&gt; wrot=\r\ne:&lt;BR&gt;&gt;&lt;BR&gt;&gt; I have tried numerous EVP files and short box clips and =\r\nso far&lt;BR&gt;&gt; nothing discernible has appeared on either program. I still =\r\nhave a lot of&lt;BR&gt;&gt; hope though.&lt;BR&gt;&gt; &lt;BR&gt;&gt; I don&#39;t know about you =\r\nguys, but I am going to try to work this in to a&lt;BR&gt;&gt; session tonight!&lt;B=\r\nR&gt;&gt; &lt;BR&gt;&gt; Tim&lt;BR&gt;&gt; &lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&gt; On Fri, Dec 17, 2010 at 4:=\r\n23 PM, Ursula &lt;kalinu@...&gt; wrote:&lt;BR&gt;&gt; &lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt;&lt;=\r\nBR&gt;&gt; &gt; But I don&#39;t know how to save the image ugh...what if i just wa=\r\nnt one part&lt;BR&gt;&gt; &gt; of it..Im soo lost here..and excited at the same t=\r\nime LOL&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;=\r\n&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV style=3D&quot;COLOR: #fff&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOT=\r\nE&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/TD&gt;&lt;/TR&gt;&lt;/TBODY&gt;&lt;/=\r\nTABLE&gt;\n&lt;DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV style=3D&quot;COLOR: #fff&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV=\r\n&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;D=\r\nIV style=3D&quot;COLOR: #fff&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/D=\r\nIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV style=3D&quot;COLOR: #fff&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/=\r\nDIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV style=\r\n=3D&quot;COLOR: #fff&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV=\r\n&gt;&lt;/BLOCKQUOTE&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;\r\n--0-1051935207-1292749016=:90255--\r\n\n\r\n--0-788664451-1292749016=:90255\r\nContent-Type: image/bmp; name=&quot;man peeking.bmp&quot;\r\nContent-Disposition: attachment; filename=&quot;man peeking.bmp&quot;\r\n\r\n[ Attachment content not displayed ]\r\n--0-788664451-1292749016=:90255\r\nContent-Type: image/bmp; name=&quot;man peeking color.bmp&quot;\r\nContent-Disposition: attachment; filename=&quot;man peeking color.bmp&quot;\r\n\r\n[ Attachment content not displayed ]\r\n--0-788664451-1292749016=:90255\r\nContent-Type: image/bmp; name=&quot;in color.bmp&quot;\r\nContent-Disposition: attachment; filename=&quot;in color.bmp&quot;\r\n\r\n[ Attachment content not displayed ]\r\n--0-788664451-1292749016=:90255\r\nContent-Type: image/bmp; name=&quot;is that a animal or what.bmp&quot;\r\nContent-Disposition: attachment; filename=&quot;is that a animal or what.bmp&quot;\r\n\r\n[ Attachment content not displayed ]\r\n--0-788664451-1292749016=:90255--"}