{"id": "19657", "subject": "Re: [EVP-ITC] Re: ok so im getting stuff on the spectergram", "author": "Frank Sumption", "timestamp": "2010-12-20T00:38:41Z", "full_text": "Okay, that was harsh! Put my claws back in. Been doing this stuff for ten\nyears and there&#39;s always someone that thinks they are somehow more qualified\nand more intelligent than anyone else. I&#39;ve been doing EVP related work for\nten years, that does not mean I have had no other experience, have not read\na butt load of books, and have no intuition-. I&#39;ve been having &quot;paranormal\nexpereince&quot; before most of the people on this group were born, and it really\npisses me off to be talked down to.\n\n I say the images are real, and are not at all rare, and once again I\nstate--we are the ones with all the limitations! If someone on the other\nside has been working on technology for 1000 years, how simple do you think\nit is for them to embed images in every and any freaking thing they want to?\nForget the Hollywood nonsense of spirit being a deminished human zombie\nincapable of any action on this side.\n\nF-S\n\n\n\n\n\nOn Sun, Dec 19, 2010 at 4:54 PM, Frank Sumption\n&lt;purplealiengirl@gmail.com&gt;wrote:\n\n&gt;  I just don&#39;t like pompus A-holes coming down on everyone else. That is\n&gt; exactly what you came across as, then you act you are somekind of ITC\n&gt; expert.\n&gt;\n&gt; F-S\n&gt;\n&gt;   On Sun, Dec 19, 2010 at 3:49 PM, Tim Woolworth &lt;tjwoolworth@...&gt;wrote:\n&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; Frank,\n&gt;&gt;\n&gt;&gt; WTF?\n&gt;&gt;\n&gt;&gt; Did I second guess anyone?  No.\n&gt;&gt;\n&gt;&gt; Did I prejudge all evidence?  No.\n&gt;&gt;\n&gt;&gt; Was I aware of this?  Yes.  Did I mention it before?  No.  Why?  Because\n&gt;&gt; it did not interest me until now because I did not know the software was\n&gt;&gt; available for downloading.\n&gt;&gt;\n&gt;&gt; You are putting a helluva lot of assumptions out there about me Frank, and\n&gt;&gt; you know me better than to ever equate me with the TAPS bullshit.  At least\n&gt;&gt; I thought you did.\n&gt;&gt;\n&gt;&gt; All I can ask is WTF?  Can no one understand basic English in a freaking\n&gt;&gt; post anymore?\n&gt;&gt;\n&gt;&gt; I attacked no one.  I attacked no evidence.  I did not give specific\n&gt;&gt; opinion about the validity of evidence until forced to by Ursula&#39;s last\n&gt;&gt; post.  I only said what I would need to quantify before I start posting\n&gt;&gt; images.  And you have really jumped the shark here, Frank, and I have no\n&gt;&gt; idea why.\n&gt;&gt;\n&gt;&gt; Tim\n&gt;&gt;\n&gt;&gt; On Sun, Dec 19, 2010 at 5:10 PM, Frank Sumption &lt;\n&gt;&gt; purplealiengirl@...&gt; wrote:\n&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt; HUH? You&#39;ve been aware of this for so long? That&#39;s another thing that\n&gt;&gt;&gt; gets me, people think they are such friggin&#39; great experts that they\n&gt;&gt;&gt; prejudge all evidence and and second guess everyone.\n&gt;&gt;&gt;\n&gt;&gt;&gt;  So this wasn&#39;t important enough to mention, cuz you already judged it to\n&gt;&gt;&gt; be bogus? Everyone thinks they are to world&#39;s onlyest freaking experts!\n&gt;&gt;&gt; GodAlmighty!!\n&gt;&gt;&gt;\n&gt;&gt;&gt;  I with Hultay, shut down the groups and tell everyone bite me! Go join\n&gt;&gt;&gt; TAPS if you want all this to corespond to preconceived idiotic Hollywood\n&gt;&gt;&gt; shit!\n&gt;&gt;&gt;\n&gt;&gt;&gt; F-S\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt; On Sun, Dec 19, 2010 at 7:31 AM, Tim Woolworth &lt;tjwoolworth@...&gt;wrote:\n&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; Relax Ursula.\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; I too have been aware of this at Keith&#39;s site for long, long time, but\n&gt;&gt;&gt;&gt; like I said in the last post, I am very new to this as in doing it on my own\n&gt;&gt;&gt;&gt; computer.  Just like you.  So don&#39;t act like you know what I do and do not\n&gt;&gt;&gt;&gt; know, thank you very much.\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; I am not attacking you so back the hell off.  I made it clear that this\n&gt;&gt;&gt;&gt; was for my own own edification, for me to accept my own images.\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; The image I ever so briefly mentioned the one posted that had several\n&gt;&gt;&gt;&gt; &quot;Faces&quot; or pieces thereof that were circled.  As for your image of the man\n&gt;&gt;&gt;&gt; peeking out, I saw nothing there.  Period.   Did I say previously what I\n&gt;&gt;&gt;&gt; thought about the quality of the images in that photo?  No.  I politely kept\n&gt;&gt;&gt;&gt; it to myself because I do not like to differ with people or to deflate hot\n&gt;&gt;&gt;&gt; air balloons.  But there you have it, that is what I saw.  And to my\n&gt;&gt;&gt;&gt; knowledge, that is the only time I have described what I have seen thus far\n&gt;&gt;&gt;&gt; in your images other than mentioning the word &quot;eyebrows.&quot;  In the one that\n&gt;&gt;&gt;&gt; had many circles, I saw one that looked like a set of lips and a chin and\n&gt;&gt;&gt;&gt; the rest I personally thought was matrixing.  Once again, did I saw this?\n&gt;&gt;&gt;&gt;  No.  But you asked for it so there it is.\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; The whole point of my post, had you read it with a clear head.  It was\n&gt;&gt;&gt;&gt; all about my own edification, that I, and I alone, need to keep plugging in\n&gt;&gt;&gt;&gt; files before I, and I alone, make a judgement about MY images and whether\n&gt;&gt;&gt;&gt; they are real or not based upon the images they provide in contrast to the\n&gt;&gt;&gt;&gt; bulk of other files.  If you simply compare your one image with the many\n&gt;&gt;&gt;&gt; circles to the youtube file, I suspect I am correct in saying that faces\n&gt;&gt;&gt;&gt; occur with much more rarity than your circle file and that they can appear\n&gt;&gt;&gt;&gt; fully formed.  Once again, I suspect, only, and I will only be able to tell\n&gt;&gt;&gt;&gt; after time.  Sample size is everything, and I thought I made that abundantly\n&gt;&gt;&gt;&gt; clear.  The post was simply about my process of learning rather than running\n&gt;&gt;&gt;&gt; out and saying look what I found when I simply don&#39;t know what has been\n&gt;&gt;&gt;&gt; found yet because it is the first time I have played with the controls\n&gt;&gt;&gt;&gt; rather than seeing the end snapshots on another persons website.\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; Why do you always jump on the defensive and attack every one who does\n&gt;&gt;&gt;&gt; not fall in line with you?  Not everything has to be fight or flight,\n&gt;&gt;&gt;&gt; Ursula, and not every bridge has to be burned so thoroughly to the ground.\n&gt;&gt;&gt;&gt;  This is not an attack on you or results, reread the post, and this time\n&gt;&gt;&gt;&gt; thinking a little more clearly about what is written on the page and not\n&gt;&gt;&gt;&gt; your own emotional backlash construing things in the posted text that are\n&gt;&gt;&gt;&gt; simply not there.  Had you done this, you would have seen the point of my\n&gt;&gt;&gt;&gt; post was not an attack on you, in ANY way.\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; Tim\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; On Sun, Dec 19, 2010 at 12:03 AM, Ursula Kalin &lt;kalinu@...&gt;wrote:\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt;   oo also they only image you saw me go crazy about was the mean man\n&gt;&gt;&gt;&gt;&gt; peeking what many faces did you see??\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt; --- On *Sat, 12/18/10, Tim Woolworth &lt;tjwoolworth@...&gt;* wrote:\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt; From: Tim Woolworth &lt;tjwoolworth@...&gt;\n&gt;&gt;&gt;&gt;&gt; Subject: Re: [EVP-ITC] Re: ok so im getting stuff on the spectergram\n&gt;&gt;&gt;&gt;&gt; To: EVP-ITC@yahoogroups.com\n&gt;&gt;&gt;&gt;&gt; Date: Saturday, December 18, 2010, 4:57 PM\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt; No, I don&#39;t think I am being too critical, but I may have expectations\n&gt;&gt;&gt;&gt;&gt; that are a little too high.  I want to take my time with this.  For my own\n&gt;&gt;&gt;&gt;&gt; understanding, I need to have a large sample size so I know not only what to\n&gt;&gt;&gt;&gt;&gt; expect to see, but what to look for.  I have seen ITC snapshots from\n&gt;&gt;&gt;&gt;&gt; programs like this that offer full faces.  I would be more inclined to\n&gt;&gt;&gt;&gt;&gt; believe in such an image as opposed to, lets say. two dark lines that may or\n&gt;&gt;&gt;&gt;&gt; may not be eyebrows.\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt; Even in your example of the towel, you get half a face.  If you have\n&gt;&gt;&gt;&gt;&gt; half a face (on the vertical plane, not the horizontal) you can extrapolate\n&gt;&gt;&gt;&gt;&gt; out what the entire face would look like.  This is something I would like to\n&gt;&gt;&gt;&gt;&gt; get myself and I would consider that evidence if it showed up in one of\n&gt;&gt;&gt;&gt;&gt; these programs.  But, if you have something that looks like a forehead and\n&gt;&gt;&gt;&gt;&gt; that is all there is, then it could also look like a rock or some other such\n&gt;&gt;&gt;&gt;&gt; object.\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt; I am certainly hoping for results worked into box sessions.  Directing\n&gt;&gt;&gt;&gt;&gt; a session with intent, like saying &quot;I am going to examine the sound waves of\n&gt;&gt;&gt;&gt;&gt; this communication in hopes of seeing your face.  Is it possible you can\n&gt;&gt;&gt;&gt;&gt; show your face to me now through sound? &quot; is what I am after.  If a positive\n&gt;&gt;&gt;&gt;&gt; hit like this happens, then I will be jumping for joy.  Another good example\n&gt;&gt;&gt;&gt;&gt; would be a name, lets say Tom, that occurs.  If you get a positive\n&gt;&gt;&gt;&gt;&gt; affirmation that the name you heard is present, then you try the same\n&gt;&gt;&gt;&gt;&gt; technique only you address Tom by name and get a face, that would be even\n&gt;&gt;&gt;&gt;&gt; better.\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt; But, as it stands now, the faces as they appear are random at best.  I\n&gt;&gt;&gt;&gt;&gt; would be more inclined to believe that when these faces do occur , they are\n&gt;&gt;&gt;&gt;&gt; going to occur with a lesser frequency than multiple images in a few seconds\n&gt;&gt;&gt;&gt;&gt; of audio like Ursula&#39;s example.  If this where the case, there would be\n&gt;&gt;&gt;&gt;&gt; dozens, and possibly hundreds, of faces during a ten minute session and I\n&gt;&gt;&gt;&gt;&gt; just don&#39;t think that is possible.  This is why I need to look at several\n&gt;&gt;&gt;&gt;&gt; samples to find out if this is the case or not.  If these partialized faces\n&gt;&gt;&gt;&gt;&gt; occur in multiples all the time, I would be more apt to discount it.  But,\n&gt;&gt;&gt;&gt;&gt; if they are a rarity affixed to only a few clips out of dozens, I would be\n&gt;&gt;&gt;&gt;&gt; more inclined to believe in them.  Sample size is everything.  It is like\n&gt;&gt;&gt;&gt;&gt; listening to GBC.  If you have never done a session before, you would be\n&gt;&gt;&gt;&gt;&gt; inclined to believe every stray radio signal is a communication.  Only by\n&gt;&gt;&gt;&gt;&gt; continued practice (expanding your sample size) can you start to rule out\n&gt;&gt;&gt;&gt;&gt; stray radio with any degree of accuracy.\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt; On the other hand, I am very new to this and I could certainly be\n&gt;&gt;&gt;&gt;&gt; wrong.  I will continue to plug sound into the programs and hope for the\n&gt;&gt;&gt;&gt;&gt; best.\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt; I really want this to work.  As you have probably experienced, when\n&gt;&gt;&gt;&gt;&gt; they want you to hear something or know something, they make it very obvious\n&gt;&gt;&gt;&gt;&gt; while communicating.  I am hoping they apply this same rigor to this new\n&gt;&gt;&gt;&gt;&gt; format to show us that they are there.  If they can, then the world of video\n&gt;&gt;&gt;&gt;&gt; and audio ITC will merge in one source and then the skeptics be damned!\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt; Tim\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt; On Sat, Dec 18, 2010 at 2:24 PM, Frank Sumption &lt;\n&gt;&gt;&gt;&gt;&gt; purplealiengirl@...&lt;http://us.mc1807.mail.yahoo.com/mc/compose?to=purplealiengirl@...&gt;\n&gt;&gt;&gt;&gt;&gt; &gt; wrote:\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt;    I think it&#39;s unrealistic to expect every file to have faces and\n&gt;&gt;&gt;&gt;&gt; images. These faces are often just portions, eyes and lips, some have eye\n&gt;&gt;&gt;&gt;&gt; brows. Like all of this, not done for proof, it&#39;s for emotional impact.  I\n&gt;&gt;&gt;&gt;&gt; have this woman that shows up in towels, always just half the face. Perahps\n&gt;&gt;&gt;&gt;&gt; you are being too critical? As with all spirit messages, it&#39;s what it means\n&gt;&gt;&gt;&gt;&gt; to the experiencer that matters. Expecting full faces is like expecting the\n&gt;&gt;&gt;&gt;&gt; kings english and proper grammer in all EVPs.\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt; F-S\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt;   On Sat, Dec 18, 2010 at 3:07 AM, Tim Woolworth &lt;\n&gt;&gt;&gt;&gt;&gt; tjwoolworth@...&lt;http://us.mc1807.mail.yahoo.com/mc/compose?to=tjwoolworth@...&gt;\n&gt;&gt;&gt;&gt;&gt; &gt; wrote:\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt;  I saw a couple which could be construed as images in the one series\n&gt;&gt;&gt;&gt;&gt; you had from SEA, but nothing that knocked me over the head yet.  I am going\n&gt;&gt;&gt;&gt;&gt; to have to see a larger sample size before I determine if what you have\n&gt;&gt;&gt;&gt;&gt; witnessed is in fact a form or not.  I cannot accept an image as paranormal\n&gt;&gt;&gt;&gt;&gt; without knowing where it sits among the bulk of audio files.  If every file\n&gt;&gt;&gt;&gt;&gt; has multiple faces, the I would have  to say that there is nothing there.\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt; So, I will certainly keep testing with my copy and hopefully something\n&gt;&gt;&gt;&gt;&gt; will really pop for me.  I have run through about ten files (EVP and GBC) so\n&gt;&gt;&gt;&gt;&gt; far for intensive study and I still haven&#39;t got anything that I would\n&gt;&gt;&gt;&gt;&gt; consider a positive hit.  I need an actual formed face, not portions\n&gt;&gt;&gt;&gt;&gt; thereof, to consider an image real.  This is the only way to discount visual\n&gt;&gt;&gt;&gt;&gt; matrixing.\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt; I have high hopes for this though!\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt; Tim\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt; On Sat, Dec 18, 2010 at 5:01 AM, Ursula Kalin &lt;kalinu@...&lt;http://us.mc1807.mail.yahoo.com/mc/compose?to=kalinu@...&gt;\n&gt;&gt;&gt;&gt;&gt; &gt; wrote:\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt;    Tim did you see my images???\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt; --- On *Sat, 12/18/10, Tim Woolworth &lt;tjwoolworth@...&lt;http://us.mc1807.mail.yahoo.com/mc/compose?to=tjwoolworth@...&gt;\n&gt;&gt;&gt;&gt;&gt; &gt;* wrote:\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt; From: Tim Woolworth &lt;tjwoolworth@...&lt;http://us.mc1807.mail.yahoo.com/mc/compose?to=tjwoolworth@...&gt;&gt;\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt; Subject: Re: [EVP-ITC] Re: ok so im getting stuff on the spectergram\n&gt;&gt;&gt;&gt;&gt; To: EVP-ITC@yahoogroups.com&lt;http://us.mc1807.mail.yahoo.com/mc/compose?to=EVP-ITC@yahoogroups.com&gt;\n&gt;&gt;&gt;&gt;&gt; Date: Saturday, December 18, 2010, 3:26 AM\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt; I have Audition as my editor.  I am going to have to try it out.\n&gt;&gt;&gt;&gt;&gt;  Thanks Bill.\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt; Tim\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt; On Sat, Dec 18, 2010 at 1:00 AM, psi_research &lt;vilhellm@...&lt;http://us.mc1807.mail.yahoo.com/mc/compose?to=vilhellm@...&gt;\n&gt;&gt;&gt;&gt;&gt; &gt; wrote:\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt;  I&#39;ve seen live webcast of ITC sessions where GB output is fed\n&gt;&gt;&gt;&gt;&gt; directly into the mic line in on a computer running Adobe Audition with the\n&gt;&gt;&gt;&gt;&gt; spectragraph running. It was really compelling to see letters and numbers,\n&gt;&gt;&gt;&gt;&gt; not images or pictures, but partial words appear in the graph. At first it\n&gt;&gt;&gt;&gt;&gt; was I thought it was a software glitch but it is a repeatable event. It was\n&gt;&gt;&gt;&gt;&gt; on LiveSciFi which is run by Tim Wood, he also thought there was some kind\n&gt;&gt;&gt;&gt;&gt; of code error but it happened on more than one webcast.\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt; So if anyone has Audition, just feed Box output right in your computer\n&gt;&gt;&gt;&gt;&gt; and see what happens. I wanted to try it tonight but I have Audacity and the\n&gt;&gt;&gt;&gt;&gt; spectragraph feature doesn&#39;t have that shaded appearance that Audition does\n&gt;&gt;&gt;&gt;&gt; so it&#39;s not able to render images or characters, at least as far as I see\n&gt;&gt;&gt;&gt;&gt; using the various settings.\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt; --- In EVP-ITC@yahoogroups.com&lt;http://us.mc1807.mail.yahoo.com/mc/compose?to=EVP-ITC%40yahoogroups.com&gt;,\n&gt;&gt;&gt;&gt;&gt; Tim Woolworth &lt;tjwoolworth@...&gt; wrote:\n&gt;&gt;&gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt;&gt; &gt; I have tried numerous EVP files and short box clips and so far\n&gt;&gt;&gt;&gt;&gt; &gt; nothing discernible has appeared on either program. I still have a\n&gt;&gt;&gt;&gt;&gt; lot of\n&gt;&gt;&gt;&gt;&gt; &gt; hope though.\n&gt;&gt;&gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt;&gt; &gt; I don&#39;t know about you guys, but I am going to try to work this in to\n&gt;&gt;&gt;&gt;&gt; a\n&gt;&gt;&gt;&gt;&gt; &gt; session tonight!\n&gt;&gt;&gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt;&gt; &gt; Tim\n&gt;&gt;&gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt;&gt; &gt; On Fri, Dec 17, 2010 at 4:23 PM, Ursula &lt;kalinu@...&gt; wrote:\n&gt;&gt;&gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt;&gt; &gt; &gt;\n&gt;&gt;&gt;&gt;&gt; &gt; &gt;\n&gt;&gt;&gt;&gt;&gt; &gt; &gt; But I don&#39;t know how to save the image ugh...what if i just want\n&gt;&gt;&gt;&gt;&gt; one part\n&gt;&gt;&gt;&gt;&gt; &gt; &gt; of it..Im soo lost here..and excited at the same time LOL\n&gt;&gt;&gt;&gt;&gt; &gt; &gt;\n&gt;&gt;&gt;&gt;&gt; &gt; &gt;\n&gt;&gt;&gt;&gt;&gt; &gt; &gt;\n&gt;&gt;&gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;  \n&gt;&gt;\n&gt;\n&gt;\n\nOkay, ha was ha sh! Pu my claws back in. Been doing his s u   o en yea s and he e's always someone ha hinks hey a e somehow mo e quali ied and mo e in elligen han anyone else. I' e been doing EVP ela ed wo k o en yea s, ha does no mean I ha e had no o he expe ience, ha e no ead a bu load o books, and ha e no in ui ion-. I' e been ha ing \"pa ano mal expe eince\" be o e mos o   he people on his g oup we e bo n, and i eally pisses me o o be alked down o.  \n\n \n I say he images a e eal, and a e no a all a e, and once again I s a e--we a e he ones wi h all he limi a ions! I someone on he o he side has been wo king on echnology o 1000 yea s, how simple do you hink i is o hem o embed images in e e y and any  eaking hing hey wan o? Fo ge he Hollywood nonsense o spi i being a deminished human zombie incapable o any ac ion on his side.\n\n \nF-S\n \n \n \nOn Sun, Dec 19, 2010 a 4:54 PM, F ank Sump ion pu plealiengi l@...> w o e:\n\n I jus don' like pompus A-holes coming down on e e yone else. Tha is exac ly wha you came ac oss as, hen you ac you a e somekind o ITC expe . \n \nF-S\n\n\n\nOn Sun, Dec 19, 2010 a 3:49 PM, Tim Woolwo h jwoolwo h@...> w o e:\n\n  \n\n\n\nF ank, \n\nWTF?\n\nDid I second guess anyone?  No.\n\nDid I p ejudge all e idence?  No.\n\nWas I awa e o his?  Yes.  Did I men ion i be o e?  No.  Why?  Because i did no in e es me un il now because I did no know he so wa e was a ailable o downloading.\n\nYou a e pu ing a hellu a lo o assump ions ou he e abou me F ank, and you know me be e han o e e equa e me wi h he TAPS bullshi .  A leas I hough you did.\n\nAll I can ask is WTF?  Can no one unde s and basic English in a eaking pos anymo e?  \n\nI a acked no one.  I a acked no e idence.  I did no gi e speci ic opinion abou he alidi y o e idence un il o ced o by U sula's las pos .  I only said wha I would need o quan i y be o e I s a pos ing images.  And you ha e eally jumped he sha k he e, F ank, and I ha e no idea why.\n\n\nTim\n\n\n\n\n\nOn Sun, Dec 19, 2010 a 5:10 PM, F ank Sump ion pu plealiengi l@...> w o e:\n\n  \n\n\n\n\nHUH? You' e been awa e o his o so long? Tha 's ano he hing ha ge s me, people hink hey a e such iggin' g ea expe s ha hey p ejudge all e idence and and second guess e e yone. \n So his wasn' impo an enough o men ion, cuz you al eady judged i o be bogus? E e yone hinks hey a e o wo ld's onlyes eaking expe s! GodAlmigh y!! \n \n I wi h Hul ay, shu down he g oups and ell e e yone bi e me! Go join TAPS i you wan all his o co espond o p econcei ed idio ic Hollywood shi !\n \nF-S\n\n\n\n \n \nOn Sun, Dec 19, 2010 a 7:31 AM, Tim Woolwo h jwoolwo h@gmail.com> w o e:\n\n  \n\n\n\nRelax U sula. \n\nI oo ha e been awa e o his a Kei h's si e o long, long ime, bu like I said in he las pos , I am e y new o his as in doing i on my own compu e .  Jus like you.  So don' ac like you know wha I do and do no know, hank you e y much.  \n\n\nI am no a acking you so back he hell o .  I made i clea ha his was o my own own edi ica ion, o me o accep my own images.  \n\nThe image I e e so b ie ly men ioned he one pos ed ha had se e al \"Faces\" o pieces he eo ha we e ci cled.  As o you image o he man peeking ou , I saw no hing he e.  Pe iod.   Did I say p e iously wha I hough abou he quali y o he images in ha pho o?  No.  I poli ely kep i o mysel because I do no like o di e wi h people o o de la e ho ai balloons.  Bu he e you ha e i , ha is wha I saw.  And o my knowledge, ha is he only ime I ha e desc ibed wha I ha e seen hus a in you images o he han men ioning he wo d \"eyeb ows.\"  In he one ha had many ci cles, I saw one ha looked like a se o lips and a chin and he es I pe sonally hough was ma ixing.  Once again, did I saw his?  No.  Bu you asked o i so he e i is.\n\n\nThe whole poin o my pos , had you ead i wi h a clea head.  I was all abou my own edi ica ion, ha I, and I alone, need o keep plugging in iles be o e I, and I alone, make a judgemen abou MY images and whe he hey a e eal o no based upon he images hey p o ide in con as o he bulk o o he iles.  I you simply compa e you one image wi h he many ci cles o he you ube ile, I suspec I am co ec in saying ha aces occu wi h much mo e a i y han you ci cle ile and ha hey can appea ully o med.  Once again, I suspec , only, and I will only be able o ell a e ime.  Sample size is e e y hing, and I hough I made ha abundan ly clea .  The pos was simply abou my p ocess o lea ning a he han unning ou and saying look wha I ound when I simply don' know wha has been ound ye because i is he i s ime I ha e played wi h he con ols a he han seeing he end snapsho s on ano he pe sons websi e.  \n\n\nWhy do you always jump on he de ensi e and a ack e e y one who does no all in line wi h you?  No e e y hing has o be igh o ligh , U sula, and no e e y b idge has o be bu ned so ho oughly o he g ound.  This is no an a ack on you o esul s, e ead he pos , and his ime hinking a li le mo e clea ly abou wha is w i en on he page and no you own emo ional backlash cons uing hings in he pos ed ex ha a e simply no he e.  Had you done his, you would ha e seen he poin o my pos was no an a ack on you, in ANY way.    \n\n\nTim\n\n\n\n\nOn Sun, Dec 19, 2010 a 12:03 AM, U sula Kalin kalinu@...> w o e:\n\n  \n\n\n\n\n\n\n\noo also hey only image you saw me go c azy abou was he mean man peeking wha many aces did you see?? \n\n\n--- On Sa , 12/18/10, Tim Woolwo h jwoolwo h@...> w o e:\nF om: Tim Woolwo h jwoolwo h@...>Subjec : Re: [EVP-ITC] Re: ok so im ge ing s u on he spec e g am\nTo: EVP-ITC@yahoog oups.comDa e: Sa u day, Decembe 18, 2010, 4:57 PM\n  \n\nNo, I don' hink I am being oo c i ical, bu I may ha e expec a ions ha a e a li le oo high.  I wan o ake my ime wi h his.  Fo my own unde s anding, I need o ha e a la ge sample size so I know no only wha o expec o see, bu wha o look o .  I ha e seen ITC snapsho s om p og ams like his ha o e ull aces.  I would be mo e inclined o belie e in such an image as opposed o, le s say. wo da k lines ha may o may no be eyeb ows. \n\nE en in you example o he owel, you ge hal a ace.  I you ha e hal a ace (on he e ical plane, no he ho izon al) you can ex apola e ou wha he en i e ace would look like.  This is some hing I would like o ge mysel and I would conside ha e idence i i showed up in one o hese p og ams.  Bu , i you ha e some hing ha looks like a o ehead and ha is all he e is, hen i could also look like a ock o some o he such objec .\n\n\nI am ce ainly hoping o esul s wo ked in o box sessions.  Di ec ing a session wi h in en , like saying \"I am going o examine he sound wa es o his communica ion in hopes o seeing you ace.  Is i possible you can show you ace o me now h ough sound? \" is wha I am a e .  I a posi i e hi like his happens, hen I will be jumping o joy.  Ano he good example would be a name, le s say Tom, ha occu s.  I you ge a posi i e a i ma ion ha he name you hea d is p esen , hen you y he same echnique only you add ess Tom by name and ge a ace, ha would be e en be e .\n\n\nBu , as i s ands now, he aces as hey appea a e andom a bes .  I would be mo e inclined o belie e ha when hese aces do occu , hey a e going o occu wi h a lesse equency han mul iple images in a ew seconds o audio like U sula's example.  I his whe e he case, he e would be dozens, and possibly hund eds, o aces du ing a en minu e session and I jus don' hink ha is possible.  This is why I need o look a se e al samples o ind ou i his is he case o no .  I hese pa ialized aces occu in mul iples all he ime, I would be mo e ap o discoun i .  Bu , i hey a e a a i y a ixed o only a ew clips ou o dozens, I would be mo e inclined o belie e in hem.  Sample size is e e y hing.  I is like lis ening o GBC.  I you ha e ne e done a session be o e, you would be inclined o belie e e e y s ay adio signal is a communica ion.  Only by con inued p ac ice (expanding you sample size) can you s a o ule ou s ay adio wi h any deg ee o accu acy.  \n\n\nOn he o he hand, I am e y new o his and I could ce ainly be w ong.  I will con inue o plug sound in o he p og ams and hope o he bes .  \n\nI eally wan his o wo k.  As you ha e p obably expe ienced, when hey wan you o hea some hing o know some hing, hey make i e y ob ious while communica ing.  I am hoping hey apply his same igo o his new o ma o show us ha hey a e he e.  I hey can, hen he wo ld o ideo and audio ITC will me ge in one sou ce and hen he skep ics be damned!\n\n\nTim\nOn Sa , Dec 18, 2010 a 2:24 PM, F ank Sump ion pu plealiengi l@gmail.com> w o e:\n\n\n  \n\n\n\n\n I hink i 's un ealis ic o expec e e y ile o ha e aces and images. These aces a e o en jus po ions, eyes and lips, some ha e eye b ows. Like all o his, no done o p oo , i 's o emo ional impac .  I ha e his woman ha shows up in owels, always jus hal he ace. Pe ahps you a e being oo c i ical? As wi h all spi i messages, i 's wha i means o he expe ience ha ma e s. Expec ing ull aces is like expec ing he kings english and p ope g amme in all EVPs. \n\n \nF-S\n\n\n\nOn Sa , Dec 18, 2010 a 3:07 AM, Tim Woolwo h jwoolwo h@...> w o e:\n\n\n  \n\n\n\nI saw a couple which could be cons ued as images in he one se ies you had om SEA, bu no hing ha knocked me o e he head ye .  I am going o ha e o see a la ge sample size be o e I de e mine i wha you ha e wi nessed is in ac a o m o no .  I canno accep an image as pa ano mal wi hou knowing whe e i si s among he bulk o audio iles.  I e e y ile has mul iple aces, he I would ha e   o say ha he e is no hing he e. \n\n\nSo, I will ce ainly keep es ing wi h my copy and hope ully some hing will eally pop o me.  I ha e un h ough abou en iles (EVP and GBC) so a o in ensi e s udy and I s ill ha en' go any hing ha I would conside a posi i e hi .  I need an ac ual o med ace, no po ions he eo , o conside an image eal.  This is he only way o discoun isual ma ixing.\n\n\nI ha e high hopes o his hough!\n\nTim \n\n\n\nOn Sa , Dec 18, 2010 a 5:01 AM, U sula Kalin kalinu@...> w o e:\n\n\n  \n\n\n\n\n\n\n\nTim did you see my images???--- On Sa , 12/18/10, Tim Woolwo h jwoolwo h@...> w o e:\n\nF om: Tim Woolwo h jwoolwo h@...> \nSubjec : Re: [EVP-ITC] Re: ok so im ge ing s u on he spec e g amTo: EVP-ITC@yahoog oups.com\nDa e: Sa u day, Decembe 18, 2010, 3:26 AM \n\n  \n\nI ha e Audi ion as my edi o .  I am going o ha e o y i ou .  Thanks Bill. \n\nTim\nOn Sa , Dec 18, 2010 a 1:00 AM, psi_ esea ch ilhellm@...> w o e:\n\n\n  \n\n\n\nI' e seen li e webcas o ITC sessions whe e GB ou pu is ed di ec ly in o he mic line in on a compu e unning Adobe Audi ion wi h he spec ag aph unning. I was eally compelling o see le e s and numbe s, no images o pic u es, bu pa ial wo ds appea in he g aph. A i s i was I hough i was a so wa e gli ch bu i is a epea able e en . I was on Li eSciFi which is un by Tim Wood, he also hough he e was some kind o code e o bu i happened on mo e han one webcas . \nSo i anyone has Audi ion, jus eed Box ou pu igh in you compu e and see wha happens. I wan ed o y i onigh bu I ha e Audaci y and he spec ag aph ea u e doesn' ha e ha shaded appea ance ha Audi ion does so i 's no able o ende images o cha ac e s, a leas as a as I see using he a ious se ings.\n\n--- In EVP-ITC@yahoog oups.com, Tim Woolwo h w o e:>> I ha e ied nume ous EVP iles and sho box clips and so a \n> no hing disce nible has appea ed on ei he p og am. I s ill ha e a lo o > hope hough.> > I don' know abou you guys, bu I am going o y o wo k his in o a> session onigh !\n> > Tim> \n> On F i, Dec 17, 2010 a 4:23 PM, U sula w o e:> > >> >> > Bu I don' know how o sa e he image ugh...wha i i jus wan one pa > > o i ..Im soo los he e..and exci ed a he same ime LOL\n> >> > > >>"}