{"id": "19652", "subject": "Re: [EVP-ITC] Re: ok so im getting stuff on the spectergram", "author": "Ursula Kalin", "timestamp": "2010-12-19T22:48:44Z", "full_text": "--0-1756986776-1292798924=:95211\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nI don&#39;t anything about Keith site I&#39;m speaking on somone who does this alwa=\r\nys...I&#39;m not attacking you,however I am a aggressive women if I come across=\r\n that way its&#39; because of the passion I have on the subject...Frank is righ=\r\nt you DON&quot;T want to see..so more then likely you won&#39;t\n\n--- On Sun, 12/19/1=\r\n0, Tim Woolworth &lt;tjwoolworth@...&gt; wrote:\n\n\nFrom: Tim Woolworth &lt;tjwo=\r\nolworth@...&gt;\nSubject: Re: [EVP-ITC] Re: ok so im getting stuff on the=\r\n spectergram\nTo: EVP-ITC@yahoogroups.com\nDate: Sunday, December 19, 2010, 8=\r\n:31 AM\n\n\n=C2=A0 \n\n\n\nRelax Ursula.\n\n\nI too have been aware of this at Keith&#39;=\r\ns site for long, long time, but like I said in the last post, I am very new=\r\n to this as in doing it on my own computer. =C2=A0Just like you. =C2=A0So d=\r\non&#39;t act like you know what I do and do not know, thank you very much. =C2=\r\n=A0\n\n\nI am not attacking you so back the hell off. =C2=A0I made it clear th=\r\nat this was for my own own edification, for me to accept my own images.=C2=\r\n=A0=C2=A0\n\n\nThe image I ever so briefly mentioned the one posted that had s=\r\neveral &quot;Faces&quot; or pieces thereof that were circled. =C2=A0As for your image=\r\n of the man peeking out, I saw nothing there. =C2=A0Period. =C2=A0=C2=A0Did=\r\n I say previously what I thought about the quality of the images in that ph=\r\noto? =C2=A0No. =C2=A0I politely kept it to myself because I do not like to =\r\ndiffer with people or to deflate hot air balloons. =C2=A0But there you have=\r\n it, that is what I saw. =C2=A0And to my knowledge, that is the only time I=\r\n have described what I have seen thus far in your images other than mention=\r\ning the word &quot;eyebrows.&quot; =C2=A0In the one that had many circles, I saw one =\r\nthat looked like a set of lips and a chin and the rest I personally thought=\r\n was matrixing. =C2=A0Once again, did I saw this? =C2=A0No. =C2=A0But you a=\r\nsked for it so there it is.\n\n\nThe whole point of my post, had you read it w=\r\nith a clear head. =C2=A0It was all about my own edification, that I, and I =\r\nalone, need to keep plugging in files before I, and I alone, make a judgeme=\r\nnt about MY images and whether they are real or not based upon the images t=\r\nhey provide in contrast to the bulk of other files. =C2=A0If you simply com=\r\npare your one image with the many circles to the youtube file, I suspect I =\r\nam correct in saying that faces occur with much more rarity than your circl=\r\ne file and that they can appear fully formed. =C2=A0Once again, I suspect, =\r\nonly, and I will only be able to tell after time. =C2=A0Sample size is ever=\r\nything, and I thought I made that abundantly clear. =C2=A0The post was simp=\r\nly about my process of learning rather than running out and saying look wha=\r\nt I found when I simply don&#39;t know what has been found yet because it is th=\r\ne first time I have played with the controls rather than seeing the end sna=\r\npshots on another persons website. =C2=A0\n\n\nWhy do you always jump on the d=\r\nefensive and attack every one who does not fall in line with you? =C2=A0Not=\r\n everything has to be fight or flight, Ursula, and not every bridge has to =\r\nbe burned so thoroughly to the ground. =C2=A0This is not an attack on you o=\r\nr results, reread the post, and this time thinking a little more clearly ab=\r\nout what is written on the page and not your own emotional backlash constru=\r\ning things in the posted text that are simply not there. =C2=A0Had you done=\r\n this, you would have seen the point of my post was not an attack on you, i=\r\nn ANY way. =C2=A0 =C2=A0\n\n\nTim\n\n\nOn Sun, Dec 19, 2010 at 12:03 AM, Ursula K=\r\nalin &lt;kalinu@...&gt; wrote:\n\n\n=C2=A0 \n\n\n\n\n\n\n\noo also they only image=\r\n you saw me go crazy about was the mean man peeking what many faces did you=\r\n see??\n\n\n\n\n--- On Sat, 12/18/10, Tim Woolworth &lt;tjwoolworth@...&gt; wrot=\r\ne:\n\n\nFrom: Tim Woolworth &lt;tjwoolworth@...&gt;\nSubject: Re: [EVP-ITC] Re:=\r\n ok so im getting stuff on the spectergram\nTo: EVP-ITC@yahoogroups.com\nDate=\r\n: Saturday, December 18, 2010, 4:57 PM\n\n\n=C2=A0 \n\nNo, I don&#39;t think I am be=\r\ning too critical, but I may have expectations that are a little too high. =\r\n=C2=A0I want to take my time with this. =C2=A0For my own understanding, I n=\r\need to have a large sample size so I know not only what to expect to see, b=\r\nut what to look for. =C2=A0I have seen ITC snapshots from programs like thi=\r\ns that offer full faces. =C2=A0I would be more inclined to believe in such =\r\nan image as opposed to, lets say. two dark lines that may or may not be eye=\r\nbrows. \n\n\nEven in your example of the towel, you get half a face. =C2=A0If =\r\nyou have half a face (on the vertical plane, not the horizontal) you can ex=\r\ntrapolate out what the entire face would look like. =C2=A0This is something=\r\n I would like to get myself and I would consider that evidence if it showed=\r\n up in one of these programs. =C2=A0But, if you have something that looks l=\r\nike a forehead and that is all there is, then it could also look like a roc=\r\nk or some other such object.\n\n\nI am certainly hoping for results worked int=\r\no box sessions. =C2=A0Directing a session with intent, like saying &quot;I am go=\r\ning to examine the sound waves of this communication in hopes of seeing you=\r\nr face. =C2=A0Is it possible you can show your face to me now through sound=\r\n? &quot; is what I am after. =C2=A0If a positive hit like this happens, then I w=\r\nill be jumping for joy. =C2=A0Another good example would be a name, lets sa=\r\ny Tom, that occurs. =C2=A0If you get a positive affirmation that the name y=\r\nou heard is present, then you try the same technique only you address Tom b=\r\ny name and get a face, that would be even better.\n\n\nBut, as it stands now, =\r\nthe faces as they appear are random at best. =C2=A0I would be more inclined=\r\n to believe that when these faces do occur , they are going to occur with a=\r\n lesser frequency than multiple images in a few seconds of audio like Ursul=\r\na&#39;s example. =C2=A0If this where the case, there would be dozens, and possi=\r\nbly hundreds, of faces during a ten minute session and I just don&#39;t think t=\r\nhat is possible. =C2=A0This is why I need to look at several samples to fin=\r\nd out if this is the case or not. =C2=A0If these partialized faces occur in=\r\n multiples all the time, I would be more apt to discount it. =C2=A0But, if =\r\nthey are a rarity affixed to only a few clips out of dozens, I would be mor=\r\ne inclined to believe in them. =C2=A0Sample size is everything. =C2=A0It is=\r\n like listening to GBC. =C2=A0If you have never done a session before, you =\r\nwould be inclined to believe every stray radio signal is a communication. =\r\n=C2=A0Only by continued practice (expanding your sample size) can you start=\r\n to\n rule out stray radio with any degree of accuracy. =C2=A0\n\n\nOn the othe=\r\nr hand, I am very new to this and I could certainly be wrong. =C2=A0I will =\r\ncontinue to plug sound into the programs and hope for the best. =C2=A0\n\n\nI =\r\nreally want this to work. =C2=A0As you have probably experienced, when they=\r\n want you to hear something or know something, they make it very obvious wh=\r\nile communicating. =C2=A0I am hoping they apply this same rigor to this new=\r\n format to show us that they are there. =C2=A0If they can, then the world o=\r\nf video and audio ITC will merge in one source and then the skeptics be dam=\r\nned!\n\n\nTim\n\n\nOn Sat, Dec 18, 2010 at 2:24 PM, Frank Sumption &lt;purplealiengi=\r\nrl@...&gt; wrote:\n\n\n=C2=A0 \n\n\n\n\n=C2=A0I think it&#39;s unrealistic to expect=\r\n every file to have faces and images. These faces are often just portions, =\r\neyes and lips, some have eye brows. Like all of this, not done for proof, i=\r\nt&#39;s for emotional impact.=C2=A0 I have this woman that shows up in towels, =\r\nalways just half the face. Perahps you are being too critical? As with all =\r\nspirit messages, it&#39;s what it means to the experiencer that matters. Expect=\r\ning full faces is like expecting the kings english and proper grammer in al=\r\nl EVPs. \n=C2=A0\nF-S\n\n\n\n\n\nOn Sat, Dec 18, 2010 at 3:07 AM, Tim Woolworth &lt;tj=\r\nwoolworth@...&gt; wrote:\n\n\n=C2=A0 \n\n\n\nI saw a couple which could be cons=\r\ntrued as images in the one series you had from SEA, but nothing that knocke=\r\nd me over the head yet. =C2=A0I am going to have to see a larger sample siz=\r\ne before I determine if what you have witnessed is in fact a form or not. =\r\n=C2=A0I cannot accept an image as paranormal without knowing where it sits =\r\namong the bulk of audio files. =C2=A0If every file has multiple faces, the =\r\nI would have =C2=A0to say that there is nothing there. \n\n\nSo, I will certai=\r\nnly keep testing with my copy and hopefully something will really pop for m=\r\ne. =C2=A0I have run through about ten files (EVP and GBC) so far for intens=\r\nive study and I still haven&#39;t got anything that I would consider a positive=\r\n hit. =C2=A0I need an actual formed face, not portions thereof, to consider=\r\n an image real. =C2=A0This is the only way to discount visual matrixing.\n\n\n=\r\nI have high hopes for this though!\n\n\nTim \n\n\n\n\n\nOn Sat, Dec 18, 2010 at 5:01=\r\n AM, Ursula Kalin &lt;kalinu@...&gt; wrote:\n\n\n=C2=A0 \n\n\n\n\n\n\n\nTim did yo=\r\nu see my images???\n\n--- On Sat, 12/18/10, Tim Woolworth &lt;tjwoolworth@gmail.=\r\ncom&gt; wrote:\n\n\nFrom: Tim Woolworth &lt;tjwoolworth@...&gt; \n\nSubject: Re: [E=\r\nVP-ITC] Re: ok so im getting stuff on the spectergram\nTo: EVP-ITC@yahoogrou=\r\nps.com\nDate: Saturday, December 18, 2010, 3:26 AM \n\n\n\n=C2=A0 \n\nI have Audit=\r\nion as my editor. =C2=A0I am going to have to try it out. =C2=A0Thanks Bill=\r\n. \n\n\nTim\n\n\nOn Sat, Dec 18, 2010 at 1:00 AM, psi_research &lt;vilhellm@sbcgloba=\r\nl.net&gt; wrote:\n\n\n=C2=A0 \n\n\n\nI&#39;ve seen live webcast of ITC sessions where GB =\r\noutput is fed directly into the mic line in on a computer running Adobe Aud=\r\nition with the spectragraph running. It was really compelling to see letter=\r\ns and numbers, not images or pictures, but partial words appear in the grap=\r\nh. At first it was I thought it was a software glitch but it is a repeatabl=\r\ne event. It was on LiveSciFi which is run by Tim Wood, he also thought ther=\r\ne was some kind of code error but it happened on more than one webcast. \n\nS=\r\no if anyone has Audition, just feed Box output right in your computer and s=\r\nee what happens. I wanted to try it tonight but I have Audacity and the spe=\r\nctragraph feature doesn&#39;t have that shaded appearance that Audition does so=\r\n it&#39;s not able to render images or characters, at least as far as I see usi=\r\nng the various settings.\n\n\n--- In EVP-ITC@yahoogroups.com, Tim Woolworth &lt;t=\r\njwoolworth@...&gt; wrote:\n&gt;\n&gt; I have tried numerous EVP files and short box cl=\r\nips and so far\n&gt; nothing discernible has appeared on either program. I stil=\r\nl have a lot of\n&gt; hope though.\n&gt; \n&gt; I don&#39;t know about you guys, but I am g=\r\noing to try to work this in to a\n&gt; session tonight!\n&gt; \n&gt; Tim\n&gt; \n\n&gt; On Fri, =\r\nDec 17, 2010 at 4:23 PM, Ursula &lt;kalinu@...&gt; wrote:\n&gt; \n&gt; &gt;\n&gt; &gt;\n&gt; &gt; But I do=\r\nn&#39;t know how to save the image ugh...what if i just want one part\n&gt; &gt; of it=\r\n..Im soo lost here..and excited at the same time LOL\n&gt; &gt;\n&gt; &gt; \n&gt; &gt;\n&gt;\n\n\n\n\n\n\n\n=\r\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\r\n--0-1756986776-1292798924=:95211\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;FONT size=3D4&gt;I don&#39;t anything about Keith s=\r\nite I&#39;m speaking on somone who does this always...I&#39;m not attacking you,how=\r\never I am a aggressive women if I come across that way its&#39; because of the =\r\npassion I have on the subject...Frank is right you DON&quot;T want to see..so mo=\r\nre then likely you won&#39;t&lt;/FONT&gt;&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Sun, 12/19/10, Tim Woolwor=\r\nth &lt;I&gt;&lt;tjwoolworth@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D=\r\n&quot;BORDER-LEFT: rgb(16,16,255) 2px solid; PADDING-LEFT: 5px; MARGIN-LEFT: 5px=\r\n&quot;&gt;&lt;BR&gt;From: Tim Woolworth &lt;tjwoolworth@...&gt;&lt;BR&gt;Subject: Re: [EV=\r\nP-ITC] Re: ok so im getting stuff on the spectergram&lt;BR&gt;To: EVP-ITC@yahoogr=\r\noups.com&lt;BR&gt;Date: Sunday, December 19, 2010, 8:31 AM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3Dyiv1=\r\n874873995&gt;&lt;SPAN style=3D&quot;DISPLAY: none&quot;&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV id=3Dyiv1874873=\r\n995ygrp-text&gt;\n&lt;DIV&gt;Relax Ursula.\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;I too have been aware=\r\n of this at Keith&#39;s site for long, long time, but like I said in the last p=\r\nost, I am very new to this as in doing it on my own computer. &nbsp;Just li=\r\nke you. &nbsp;So don&#39;t act like you know what I do and do not know, thank y=\r\nou very much. &nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;I am not attacking you so b=\r\nack the hell off. &nbsp;I made it clear that this was for my own own edific=\r\nation, for me to accept my own images.&nbsp;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;D=\r\nIV&gt;The image I ever so briefly mentioned the one posted that had several &quot;F=\r\naces&quot; or pieces thereof that were circled. &nbsp;As for your image of the m=\r\nan peeking out, I saw nothing there. &nbsp;Period. &nbsp;&nbsp;Did I say pr=\r\neviously what I thought about the quality of the images in that photo? &nbs=\r\np;No. &nbsp;I politely kept it to myself because I do not like to differ wi=\r\nth people or to deflate hot air balloons. &nbsp;But there you have it, that=\r\n is what I saw. &nbsp;And to my knowledge, that is the only time I have des=\r\ncribed what I have seen thus far in your images other than mentioning the w=\r\nord &quot;eyebrows.&quot; &nbsp;In the one that had many circles, I saw one that look=\r\ned like a set of lips and a chin and the rest I personally thought was matr=\r\nixing. &nbsp;Once again, did I saw this? &nbsp;No. &nbsp;But you asked for =\r\nit so there it is.&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;The whole point of my post, h=\r\nad you read it with a clear head. &nbsp;It was all about my own edification=\r\n, that I, and I alone, need to keep plugging in files before I, and I alone=\r\n, make a judgement about MY images and whether they are real or not based u=\r\npon the images they provide in contrast to the bulk of other files. &nbsp;I=\r\nf you simply compare your one image with the many circles to the youtube fi=\r\nle, I suspect I am correct in saying that faces occur with much more rarity=\r\n than your circle file and that they can appear fully formed. &nbsp;Once ag=\r\nain, I suspect, only, and I will only be able to tell after time. &nbsp;Sam=\r\nple size is everything, and I thought I made that abundantly clear. &nbsp;T=\r\nhe post was simply about my process of learning rather than running out and=\r\n saying look what I found when I simply don&#39;t know what has been found yet =\r\nbecause it is the first time I have played with the controls rather than se=\r\neing the end snapshots on another\n persons website. &nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;=\r\n/DIV&gt;\n&lt;DIV&gt;Why do you always jump on the defensive and attack every one who=\r\n does not fall in line with you? &nbsp;Not everything has to be fight or fl=\r\night, Ursula, and not every bridge has to be burned so thoroughly to the gr=\r\nound. &nbsp;This is not an attack on you or results, reread the post, and t=\r\nhis time thinking a little more clearly about what is written on the page a=\r\nnd not your own emotional backlash construing things in the posted text tha=\r\nt are simply not there. &nbsp;Had you done this, you would have seen the po=\r\nint of my post was not an attack on you, in ANY way. &nbsp; &nbsp;&lt;/DIV&gt;\n&lt;D=\r\nIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;Tim&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;\n&lt;DIV class=3Dyiv1874873995gmail_quot=\r\ne&gt;On Sun, Dec 19, 2010 at 12:03 AM, Ursula Kalin &lt;SPAN dir=3Dltr&gt;&lt;&lt;A hre=\r\nf=3D&quot;http://us.mc1807.mail.yahoo.com/mc/compose?to=3Dkalinu@...&quot; =\r\nrel=3Dnofollow target=3D_blank ymailto=3D&quot;mailto:kalinu@...&quot;&gt;kali=\r\nnu@...&lt;/A&gt;&gt;&lt;/SPAN&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT=\r\n: #ccc 1px solid&quot; class=3Dyiv1874873995gmail_quote&gt;\n&lt;DIV style=3D&quot;BACKGROUN=\r\nD-COLOR: #fff&quot;&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;TABLE bo=\r\nrder=3D0 cellSpacing=3D0 cellPadding=3D0&gt;\n&lt;TBODY&gt;\n&lt;TR&gt;\n&lt;TD vAlign=3Dtop&gt;&lt;FO=\r\nNT size=3D4&gt;oo also they only image you saw me go crazy about was the mean =\r\nman peeking what many faces did you see??&lt;/FONT&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV cla=\r\nss=3Dyiv1874873995h5&gt;&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Sat, 12/18/10, Tim Woolworth &lt;I&gt;&lt;=\r\n&lt;A href=3D&quot;http://us.mc1807.mail.yahoo.com/mc/compose?to=3Dtjwoolworth@gmai=\r\nl.com&quot; rel=3Dnofollow target=3D_blank ymailto=3D&quot;mailto:tjwoolworth@gmail.c=\r\nom&quot;&gt;tjwoolworth@...&lt;/A&gt;&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D&quot;B=\r\nORDER-LEFT: rgb(16,16,255) 2px solid&quot;&gt;&lt;BR&gt;From: Tim Woolworth &lt;&lt;A href=\r\n=3D&quot;http://us.mc1807.mail.yahoo.com/mc/compose?to=3Dtjwoolworth@...&quot; =\r\nrel=3Dnofollow target=3D_blank ymailto=3D&quot;mailto:tjwoolworth@...&quot;&gt;tjw=\r\noolworth@...&lt;/A&gt;&gt;&lt;BR&gt;Subject: Re: [EVP-ITC] Re: ok so im getting s=\r\ntuff on the spectergram&lt;BR&gt;To: &lt;A href=3D&quot;http://us.mc1807.mail.yahoo.com/m=\r\nc/compose?to=3DEVP-ITC@yahoogroups.com&quot; rel=3Dnofollow target=3D_blank ymai=\r\nlto=3D&quot;mailto:EVP-ITC@yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups.com&lt;/A&gt;&lt;BR&gt;Date:=\r\n Saturday, December 18, 2010, 4:57 PM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DI=\r\nV&gt;\n&lt;DIV&gt;No, I don&#39;t think I am being too critical, but I may have expectati=\r\nons that are a little too high. &nbsp;I want to take my time with this. &nb=\r\nsp;For my own understanding, I need to have a large sample size so I know n=\r\not only what to expect to see, but what to look for. &nbsp;I have seen ITC =\r\nsnapshots from programs like this that offer full faces. &nbsp;I would be m=\r\nore inclined to believe in such an image as opposed to, lets say. two dark =\r\nlines that may or may not be eyebrows. \n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;Even in your e=\r\nxample of the towel, you get half a face. &nbsp;If you have half a face (on=\r\n the vertical plane, not the horizontal) you can extrapolate out what the e=\r\nntire face would look like. &nbsp;This is something I would like to get mys=\r\nelf and I would consider that evidence if it showed up in one of these prog=\r\nrams. &nbsp;But, if you have something that looks like a forehead and that =\r\nis all there is, then it could also look like a rock or some other such obj=\r\nect.&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;I am certainly hoping for results worked in=\r\nto box sessions. &nbsp;Directing a session with intent, like saying &quot;I am g=\r\noing to examine the sound waves of this communication in hopes of seeing yo=\r\nur face. &nbsp;Is it possible you can show your face to me now through soun=\r\nd? &quot; is what I am after. &nbsp;If a positive hit like this happens, then I =\r\nwill be jumping for joy. &nbsp;Another good example would be a name, lets s=\r\nay Tom, that occurs. &nbsp;If you get a positive affirmation that the name =\r\nyou heard is present, then you try the same technique only you address Tom =\r\nby name and get a face, that would be even better.&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;D=\r\nIV&gt;But, as it stands now, the faces as they appear are random at best. &nbs=\r\np;I would be more inclined to believe that when these faces do occur , they=\r\n are going to occur with a lesser frequency than multiple images in a few s=\r\neconds of audio like Ursula&#39;s example. &nbsp;If this where the case, there =\r\nwould be dozens, and possibly hundreds, of faces during a ten minute sessio=\r\nn and I just don&#39;t think that is possible. &nbsp;This is why I need to look=\r\n at several samples to find out if this is the case or not. &nbsp;If these =\r\npartialized faces occur in multiples all the time, I would be more apt to d=\r\niscount it. &nbsp;But, if they are a rarity affixed to only a few clips out=\r\n of dozens, I would be more inclined to believe in them. &nbsp;Sample size =\r\nis everything. &nbsp;It is like listening to GBC. &nbsp;If you have never d=\r\none a session before, you would be inclined to believe every stray radio si=\r\ngnal is a communication. &nbsp;Only by continued practice\n (expanding your =\r\nsample size) can you start to rule out stray radio with any degree of accur=\r\nacy. &nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;On the other hand, I am very new to =\r\nthis and I could certainly be wrong. &nbsp;I will continue to plug sound in=\r\nto the programs and hope for the best. &nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;I =\r\nreally want this to work. &nbsp;As you have probably experienced, when they=\r\n want you to hear something or know something, they make it very obvious wh=\r\nile communicating. &nbsp;I am hoping they apply this same rigor to this new=\r\n format to show us that they are there. &nbsp;If they can, then the world o=\r\nf video and audio ITC will merge in one source and then the skeptics be dam=\r\nned!&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;Tim&lt;BR&gt;&lt;BR&gt;\n&lt;DIV&gt;On Sat, Dec 18, 2010 at 2:=\r\n24 PM, Frank Sumption &lt;SPAN dir=3Dltr&gt;&lt;&lt;A href=3D&quot;http://us.mc1807.mail.=\r\nyahoo.com/mc/compose?to=3Dpurplealiengirl@...&quot; rel=3Dnofollow target=\r\n=3D_blank&gt;purplealiengirl@...&lt;/A&gt;&gt;&lt;/SPAN&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE s=\r\ntyle=3D&quot;BORDER-LEFT: #ccc 1px solid&quot;&gt;\n&lt;DIV style=3D&quot;BACKGROUND-COLOR: #fff&quot;=\r\n&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;I think it&#39;s=\r\n unrealistic to expect every file to have faces and images. These faces are=\r\n often just portions, eyes and lips, some have eye brows. Like all of this,=\r\n not done for proof, it&#39;s for emotional impact.&nbsp; I have this woman tha=\r\nt shows up in towels, always just half the face. Perahps you are being too =\r\ncritical? As with all spirit messages, it&#39;s what it means to the experience=\r\nr that matters. Expecting full faces is like expecting the kings english an=\r\nd proper grammer in all EVPs. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;F-S&lt;BR&gt;&lt;BR&gt;&lt;/DI=\r\nV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;On Sat, Dec 18, 2010 at 3:07 AM, Tim Woolwo=\r\nrth &lt;SPAN dir=3Dltr&gt;&lt;&lt;A href=3D&quot;http://us.mc1807.mail.yahoo.com/mc/compo=\r\nse?to=3Dtjwoolworth@...&quot; rel=3Dnofollow target=3D_blank&gt;tjwoolworth@g=\r\nmail.com&lt;/A&gt;&gt;&lt;/SPAN&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: #ccc 1=\r\npx solid&quot;&gt;\n&lt;DIV style=3D&quot;BACKGROUND-COLOR: #fff&quot;&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV&gt;=\r\n\n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;I saw a couple which could be construed as images in the =\r\none series you had from SEA, but nothing that knocked me over the head yet.=\r\n &nbsp;I am going to have to see a larger sample size before I determine if=\r\n what you have witnessed is in fact a form or not. &nbsp;I cannot accept an=\r\n image as paranormal without knowing where it sits among the bulk of audio =\r\nfiles. &nbsp;If every file has multiple faces, the I would have &nbsp;to sa=\r\ny that there is nothing there. &lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;So, I will certa=\r\ninly keep testing with my copy and hopefully something will really pop for =\r\nme. &nbsp;I have run through about ten files (EVP and GBC) so far for inten=\r\nsive study and I still haven&#39;t got anything that I would consider a positiv=\r\ne hit. &nbsp;I need an actual formed face, not portions thereof, to conside=\r\nr an image real. &nbsp;This is the only way to discount visual matrixing.&lt;/=\r\nDIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;I have high hopes for this though!&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR=\r\n&gt;&lt;/DIV&gt;\n&lt;DIV&gt;Tim \n&lt;DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;DIV&gt;On Sat, Dec 18, 2010=\r\n at 5:01 AM, Ursula Kalin &lt;SPAN dir=3Dltr&gt;&lt;&lt;A href=3D&quot;http://us.mc1807.m=\r\nail.yahoo.com/mc/compose?to=3Dkalinu@...&quot; rel=3Dnofollow target=\r\n=3D_blank&gt;kalinu@...&lt;/A&gt;&gt;&lt;/SPAN&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=\r\n=3D&quot;BORDER-LEFT: #ccc 1px solid&quot;&gt;\n&lt;DIV style=3D&quot;BACKGROUND-COLOR: #fff&quot;&gt;&lt;SP=\r\nAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;TABLE border=3D0 cellSpaci=\r\nng=3D0 cellPadding=3D0&gt;\n&lt;TBODY&gt;\n&lt;TR&gt;\n&lt;TD vAlign=3Dtop&gt;Tim did you see my im=\r\nages???&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Sat, 12/18/10, Tim Woolworth &lt;I&gt;&lt;&lt;A href=3D&quot;htt=\r\np://us.mc1807.mail.yahoo.com/mc/compose?to=3Dtjwoolworth@...&quot; rel=3Dn=\r\nofollow target=3D_blank&gt;tjwoolworth@...&lt;/A&gt;&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;\n&lt;B=\r\nLOCKQUOTE style=3D&quot;BORDER-LEFT: rgb(16,16,255) 2px solid&quot;&gt;&lt;BR&gt;From: Tim Woo=\r\nlworth &lt;&lt;A href=3D&quot;http://us.mc1807.mail.yahoo.com/mc/compose?to=3Dtjwoo=\r\nlworth@...&quot; rel=3Dnofollow target=3D_blank&gt;tjwoolworth@...&lt;/A&gt;&=\r\ngt; \n&lt;DIV&gt;&lt;BR&gt;Subject: Re: [&lt;SPAN&gt;EVP&lt;/SPAN&gt;-ITC] Re: ok so im getting stuf=\r\nf on the spectergram&lt;BR&gt;To: &lt;A href=3D&quot;http://us.mc1807.mail.yahoo.com/mc/c=\r\nompose?to=3DEVP-ITC@yahoogroups.com&quot; rel=3Dnofollow target=3D_blank&gt;EVP-ITC=\r\n@yahoogroups.com&lt;/A&gt;&lt;BR&gt;&lt;/DIV&gt;Date: Saturday, December 18, 2010, 3:26 AM \n&lt;=\r\nDIV&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;DIV&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV&gt;\n&lt;DIV&gt;I have Audition as my edi=\r\ntor. &nbsp;I am going to have to try it out. &nbsp;Thanks Bill. \n&lt;DIV&gt;&lt;BR&gt;&lt;=\r\n/DIV&gt;\n&lt;DIV&gt;Tim&lt;BR&gt;&lt;BR&gt;\n&lt;DIV&gt;On Sat, Dec 18, 2010 at 1:00 AM, psi_research &lt;=\r\nSPAN dir=3Dltr&gt;&lt;&lt;A href=3D&quot;http://us.mc1807.mail.yahoo.com/mc/compose?to=\r\n=3Dvilhellm@...&quot; rel=3Dnofollow target=3D_blank&gt;vilhellm@sbcgloba=\r\nl.net&lt;/A&gt;&gt;&lt;/SPAN&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: #ccc 1px =\r\nsolid&quot;&gt;\n&lt;DIV style=3D&quot;BACKGROUND-COLOR: #fff&quot;&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV&gt;\n&lt;D=\r\nIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;I&#39;ve seen live webcast of ITC sessions where GB output is fe=\r\nd directly into the mic line in on a computer running Adobe Audition with t=\r\nhe spectragraph running. It was really compelling to see letters and number=\r\ns, not images or pictures, but partial words appear in the graph. At first =\r\nit was I thought it was a software glitch but it is a repeatable event. It =\r\nwas on LiveSciFi which is run by Tim Wood, he also thought there was some k=\r\nind of code error but it happened on more than one webcast. &lt;BR&gt;&lt;BR&gt;So if a=\r\nnyone has Audition, just feed Box output right in your computer and see wha=\r\nt happens. I wanted to try it tonight but I have Audacity and the spectragr=\r\naph feature doesn&#39;t have that shaded appearance that Audition does so it&#39;s =\r\nnot able to render images or characters, at least as far as I see using the=\r\n various settings.&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=3D&quot;http://us.mc1807.ma=\r\nil.yahoo.com/mc/compose?to=3DEVP-ITC%40yahoogroups.com&quot; rel=3Dnofollow targ=\r\net=3D_blank&gt;EVP-ITC@yahoogroups.com&lt;/A&gt;, Tim Woolworth &lt;tjwoolworth@...&=\r\ngt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; I have tried numerous EVP files and short box cl=\r\nips and so far&lt;BR&gt;&gt; nothing discernible has appeared on either program. =\r\nI still have a lot of&lt;BR&gt;&gt; hope though.&lt;BR&gt;&gt; &lt;BR&gt;&gt; I don&#39;t know ab=\r\nout you guys, but I am going to try to work this in to a&lt;BR&gt;&gt; session to=\r\nnight!&lt;BR&gt;&gt; &lt;BR&gt;&gt; Tim&lt;BR&gt;&gt; &lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&gt; On Fri, Dec 17, 20=\r\n10 at 4:23 PM, Ursula &lt;kalinu@...&gt; wrote:&lt;BR&gt;&gt; &lt;BR&gt;&gt; &gt;&lt;BR&gt;&g=\r\nt; &gt;&lt;BR&gt;&gt; &gt; But I don&#39;t know how to save the image ugh...what if i=\r\n just want one part&lt;BR&gt;&gt; &gt; of it..Im soo lost here..and excited at th=\r\ne same time LOL&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/DI=\r\nV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV style=3D&quot;COLOR: #fff&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/B=\r\nLOCKQUOTE&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/TD&gt;&lt;/TR&gt;&lt;/=\r\nTBODY&gt;&lt;/TABLE&gt;\n&lt;DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV style=3D&quot;COLOR: #fff&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/D=\r\nIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;&lt;=\r\n/DIV&gt;\n&lt;DIV style=3D&quot;COLOR: #fff&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV=\r\n&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV style=3D&quot;COLOR: #fff&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;=\r\n&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/D=\r\nIV&gt;&lt;/DIV&gt;&lt;/TD&gt;&lt;/TR&gt;&lt;/TBODY&gt;&lt;/TABLE&gt;\n&lt;DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV style=3D&quot;COLOR: =\r\n#fff&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BL=\r\nOCKQUOTE&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;\r\n--0-1756986776-1292798924=:95211--"}