{"id": "19660", "subject": "Re: [EVP-ITC] Re: ok so im getting stuff on the spectergram", "author": "Ursula Kalin", "timestamp": "2010-12-20T00:45:15Z", "full_text": "--0-621960288-1292805915=:2847\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nwell said...also we all are learning here. If you can&#39;t open your mind, the=\r\nn maybe this isn&#39;t for you. I believe this ITC in not our eyes playing tric=\r\nks etc etc.. This big here! open your eyes and your mind. We all should kno=\r\nw by now spirit manipulates things. Smoke,clouds,etc.=C2=A0I don&#39;t see how =\r\nthis can be any different. \n\n--- On Sun, 12/19/10, Frank Sumption &lt;purpleal=\r\niengirl@...&gt; wrote:\n\n\nFrom: Frank Sumption &lt;purplealiengirl@...=\r\n&gt;\nSubject: Re: [EVP-ITC] Re: ok so im getting stuff on the spectergram\nTo: =\r\nEVP-ITC@yahoogroups.com\nDate: Sunday, December 19, 2010, 6:38 PM\n\n\n=C2=A0 \n=\r\n\n\n\n\n=C2=A0Okay, that was harsh! Put my claws back in. Been doing this stuff=\r\n=C2=A0for ten years and there&#39;s always someone that thinks they are somehow=\r\n more qualified and more intelligent than anyone else. I&#39;ve been doing EVP =\r\nrelated work for ten years, that does not mean I have had no other experien=\r\nce, have not read a butt load of books, and have no intuition-. I&#39;ve been h=\r\naving &quot;paranormal expereince&quot; before most of=C2=A0the people on this group =\r\nwere born, and it really pisses me off to be talked down to.=C2=A0 \n=C2=A0\n=\r\n=C2=A0I say the images are real, and are not at all rare, and once again I =\r\nstate--we are the ones with all the limitations! If someone on the other si=\r\nde has been working on technology for 1000 years, how simple do you think i=\r\nt is for them to embed images in every and any=C2=A0freaking thing they wan=\r\nt to? Forget the Hollywood nonsense of spirit being a deminished human zomb=\r\nie incapable of any action on this side.\n=C2=A0\nF-S\n=C2=A0\n=C2=A0\n\n\n=C2=A0\n=\r\nOn Sun, Dec 19, 2010 at 4:54 PM, Frank Sumption &lt;purplealiengirl@...&gt;=\r\n wrote:\n\n\n=C2=A0I just don&#39;t like pompus A-holes coming down on everyone el=\r\nse. That is exactly what you came across as, then you act you are somekind =\r\nof ITC expert. \n=C2=A0\nF-S\n\n\n\n\n\nOn Sun, Dec 19, 2010 at 3:49 PM, Tim Woolwo=\r\nrth &lt;tjwoolworth@...&gt; wrote:\n\n\n=C2=A0 \n\n\n\nFrank, \n\n\nWTF?\n\n\nDid I seco=\r\nnd guess anyone? =C2=A0No.\n\n\nDid I prejudge all evidence? =C2=A0No.\n\n\nWas I=\r\n aware of this? =C2=A0Yes. =C2=A0Did I mention it before? =C2=A0No. =C2=A0W=\r\nhy? =C2=A0Because it did not interest me until now because I did not know t=\r\nhe software was available for downloading.\n\n\nYou are putting a helluva lot =\r\nof assumptions out there about me Frank, and you know me better than to eve=\r\nr equate me with the TAPS bullshit. =C2=A0At least I thought you did.\n\n\nAll=\r\n I can ask is WTF? =C2=A0Can no one understand basic English in a freaking =\r\npost anymore? =C2=A0\n\n\nI attacked no one. =C2=A0I attacked no evidence. =C2=\r\n=A0I did not give specific opinion about the validity of evidence until for=\r\nced to by Ursula&#39;s last post. =C2=A0I only said what I would need to quanti=\r\nfy before I start posting images. =C2=A0And you have really jumped the shar=\r\nk here, Frank, and I have no idea why.\n\n\nTim\n\n\n\n\n\n\nOn Sun, Dec 19, 2010 at =\r\n5:10 PM, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n\n\n=C2=A0 \n\n\n\n\nHU=\r\nH? You&#39;ve been aware of this for so long? That&#39;s another thing that gets me=\r\n, people think they are such friggin&#39; great experts that they prejudge all =\r\nevidence and and second guess everyone. \n\n=C2=A0So this wasn&#39;t important en=\r\nough to mention, cuz you already judged it to be bogus? Everyone thinks the=\r\ny are to world&#39;s onlyest freaking experts! GodAlmighty!! \n=C2=A0\n=C2=A0I wi=\r\nth Hultay, shut down the groups and tell everyone bite me! Go join TAPS if =\r\nyou want all this to corespond to preconceived idiotic Hollywood shit!\n=C2=\r\n=A0\nF-S\n\n\n\n=C2=A0\n\n=C2=A0\nOn Sun, Dec 19, 2010 at 7:31 AM, Tim Woolworth &lt;t=\r\njwoolworth@...&gt; wrote:\n\n\n=C2=A0 \n\n\n\nRelax Ursula. \n\n\nI too have been =\r\naware of this at Keith&#39;s site for long, long time, but like I said in the l=\r\nast post, I am very new to this as in doing it on my own computer. =C2=A0Ju=\r\nst like you. =C2=A0So don&#39;t act like you know what I do and do not know, th=\r\nank you very much. =C2=A0\n\n\nI am not attacking you so back the hell off. =\r\n=C2=A0I made it clear that this was for my own own edification, for me to a=\r\nccept my own images.=C2=A0=C2=A0\n\n\nThe image I ever so briefly mentioned th=\r\ne one posted that had several &quot;Faces&quot; or pieces thereof that were circled. =\r\n=C2=A0As for your image of the man peeking out, I saw nothing there. =C2=A0=\r\nPeriod. =C2=A0=C2=A0Did I say previously what I thought about the quality o=\r\nf the images in that photo? =C2=A0No. =C2=A0I politely kept it to myself be=\r\ncause I do not like to differ with people or to deflate hot air balloons. =\r\n=C2=A0But there you have it, that is what I saw. =C2=A0And to my knowledge,=\r\n that is the only time I have described what I have seen thus far in your i=\r\nmages other than mentioning the word &quot;eyebrows.&quot; =C2=A0In the one that had =\r\nmany circles, I saw one that looked like a set of lips and a chin and the r=\r\nest I personally thought was matrixing. =C2=A0Once again, did I saw this? =\r\n=C2=A0No. =C2=A0But you asked for it so there it is.\n\n\nThe whole point of m=\r\ny post, had you read it with a clear head. =C2=A0It was all about my own ed=\r\nification, that I, and I alone, need to keep plugging in files before I, an=\r\nd I alone, make a judgement about MY images and whether they are real or no=\r\nt based upon the images they provide in contrast to the bulk of other files=\r\n. =C2=A0If you simply compare your one image with the many circles to the y=\r\noutube file, I suspect I am correct in saying that faces occur with much mo=\r\nre rarity than your circle file and that they can appear fully formed. =C2=\r\n=A0Once again, I suspect, only, and I will only be able to tell after time.=\r\n =C2=A0Sample size is everything, and I thought I made that abundantly clea=\r\nr. =C2=A0The post was simply about my process of learning rather than runni=\r\nng out and saying look what I found when I simply don&#39;t know what has been =\r\nfound yet because it is the first time I have played with the controls rath=\r\ner than seeing the end snapshots on another persons website. =C2=A0\n\n\nWhy d=\r\no you always jump on the defensive and attack every one who does not fall i=\r\nn line with you? =C2=A0Not everything has to be fight or flight, Ursula, an=\r\nd not every bridge has to be burned so thoroughly to the ground. =C2=A0This=\r\n is not an attack on you or results, reread the post, and this time thinkin=\r\ng a little more clearly about what is written on the page and not your own =\r\nemotional backlash construing things in the posted text that are simply not=\r\n there. =C2=A0Had you done this, you would have seen the point of my post w=\r\nas not an attack on you, in ANY way. =C2=A0 =C2=A0\n\n\nTim\n\n\n\n\n\nOn Sun, Dec 1=\r\n9, 2010 at 12:03 AM, Ursula Kalin &lt;kalinu@...&gt; wrote:\n\n\n=C2=A0 \n\n=\r\n\n\n\n\n\n\noo also they only image you saw me go crazy about was the mean man pe=\r\neking what many faces did you see?? \n\n\n\n\n--- On Sat, 12/18/10, Tim Woolwort=\r\nh &lt;tjwoolworth@...&gt; wrote:\n\n\nFrom: Tim Woolworth &lt;tjwoolworth@gmail.c=\r\nom&gt;\nSubject: Re: [EVP-ITC] Re: ok so im getting stuff on the spectergram\nTo=\r\n: EVP-ITC@yahoogroups.com\nDate: Saturday, December 18, 2010, 4:57 PM\n\n\n=C2=\r\n=A0 \n\nNo, I don&#39;t think I am being too critical, but I may have expectation=\r\ns that are a little too high. =C2=A0I want to take my time with this. =C2=\r\n=A0For my own understanding, I need to have a large sample size so I know n=\r\not only what to expect to see, but what to look for. =C2=A0I have seen ITC =\r\nsnapshots from programs like this that offer full faces. =C2=A0I would be m=\r\nore inclined to believe in such an image as opposed to, lets say. two dark =\r\nlines that may or may not be eyebrows. \n\n\nEven in your example of the towel=\r\n, you get half a face. =C2=A0If you have half a face (on the vertical plane=\r\n, not the horizontal) you can extrapolate out what the entire face would lo=\r\nok like. =C2=A0This is something I would like to get myself and I would con=\r\nsider that evidence if it showed up in one of these programs. =C2=A0But, if=\r\n you have something that looks like a forehead and that is all there is, th=\r\nen it could also look like a rock or some other such object.\n\n\nI am certain=\r\nly hoping for results worked into box sessions. =C2=A0Directing a session w=\r\nith intent, like saying &quot;I am going to examine the sound waves of this comm=\r\nunication in hopes of seeing your face. =C2=A0Is it possible you can show y=\r\nour face to me now through sound? &quot; is what I am after. =C2=A0If a positive=\r\n hit like this happens, then I will be jumping for joy. =C2=A0Another good =\r\nexample would be a name, lets say Tom, that occurs. =C2=A0If you get a posi=\r\ntive affirmation that the name you heard is present, then you try the same =\r\ntechnique only you address Tom by name and get a face, that would be even b=\r\netter.\n\n\nBut, as it stands now, the faces as they appear are random at best=\r\n. =C2=A0I would be more inclined to believe that when these faces do occur =\r\n, they are going to occur with a lesser frequency than multiple images in a=\r\n few seconds of audio like Ursula&#39;s example. =C2=A0If this where the case, =\r\nthere would be dozens, and possibly hundreds, of faces during a ten minute =\r\nsession and I just don&#39;t think that is possible. =C2=A0This is why I need t=\r\no look at several samples to find out if this is the case or not. =C2=A0If =\r\nthese partialized faces occur in multiples all the time, I would be more ap=\r\nt to discount it. =C2=A0But, if they are a rarity affixed to only a few cli=\r\nps out of dozens, I would be more inclined to believe in them. =C2=A0Sample=\r\n size is everything. =C2=A0It is like listening to GBC. =C2=A0If you have n=\r\never done a session before, you would be inclined to believe every stray ra=\r\ndio signal is a communication. =C2=A0Only by continued practice (expanding =\r\nyour sample size) can you start to\n rule out stray radio with any degree of=\r\n accuracy. =C2=A0\n\n\nOn the other hand, I am very new to this and I could ce=\r\nrtainly be wrong. =C2=A0I will continue to plug sound into the programs and=\r\n hope for the best. =C2=A0\n\n\nI really want this to work. =C2=A0As you have =\r\nprobably experienced, when they want you to hear something or know somethin=\r\ng, they make it very obvious while communicating. =C2=A0I am hoping they ap=\r\nply this same rigor to this new format to show us that they are there. =C2=\r\n=A0If they can, then the world of video and audio ITC will merge in one sou=\r\nrce and then the skeptics be damned!\n\n\nTim\n\n\nOn Sat, Dec 18, 2010 at 2:24 P=\r\nM, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n\n\n=C2=A0 \n\n\n\n\n=C2=A0I =\r\nthink it&#39;s unrealistic to expect every file to have faces and images. These=\r\n faces are often just portions, eyes and lips, some have eye brows. Like al=\r\nl of this, not done for proof, it&#39;s for emotional impact.=C2=A0 I have this=\r\n woman that shows up in towels, always just half the face. Perahps you are =\r\nbeing too critical? As with all spirit messages, it&#39;s what it means to the =\r\nexperiencer that matters. Expecting full faces is like expecting the kings =\r\nenglish and proper grammer in all EVPs. \n=C2=A0\nF-S\n\n\n\n\n\nOn Sat, Dec 18, 20=\r\n10 at 3:07 AM, Tim Woolworth &lt;tjwoolworth@...&gt; wrote:\n\n\n=C2=A0 \n\n\n\nI =\r\nsaw a couple which could be construed as images in the one series you had f=\r\nrom SEA, but nothing that knocked me over the head yet. =C2=A0I am going to=\r\n have to see a larger sample size before I determine if what you have witne=\r\nssed is in fact a form or not. =C2=A0I cannot accept an image as paranormal=\r\n without knowing where it sits among the bulk of audio files. =C2=A0If ever=\r\ny file has multiple faces, the I would have =C2=A0to say that there is noth=\r\ning there. \n\n\nSo, I will certainly keep testing with my copy and hopefully =\r\nsomething will really pop for me. =C2=A0I have run through about ten files =\r\n(EVP and GBC) so far for intensive study and I still haven&#39;t got anything t=\r\nhat I would consider a positive hit. =C2=A0I need an actual formed face, no=\r\nt portions thereof, to consider an image real. =C2=A0This is the only way t=\r\no discount visual matrixing.\n\n\nI have high hopes for this though!\n\n\nTim \n\n\n=\r\n\n\n\nOn Sat, Dec 18, 2010 at 5:01 AM, Ursula Kalin &lt;kalinu@...&gt; wro=\r\nte:\n\n\n=C2=A0 \n\n\n\n\n\n\n\nTim did you see my images???\n\n--- On Sat, 12/18/10, Ti=\r\nm Woolworth &lt;tjwoolworth@...&gt; wrote:\n\n\nFrom: Tim Woolworth &lt;tjwoolwor=\r\nth@...&gt; \n\nSubject: Re: [EVP-ITC] Re: ok so im getting stuff on the sp=\r\nectergram\nTo: EVP-ITC@yahoogroups.com\nDate: Saturday, December 18, 2010, 3:=\r\n26 AM \n\n\n\n=C2=A0 \n\nI have Audition as my editor. =C2=A0I am going to have t=\r\no try it out. =C2=A0Thanks Bill. \n\n\nTim\n\n\nOn Sat, Dec 18, 2010 at 1:00 AM, =\r\npsi_research &lt;vilhellm@...&gt; wrote:\n\n\n=C2=A0 \n\n\n\nI&#39;ve seen live we=\r\nbcast of ITC sessions where GB output is fed directly into the mic line in =\r\non a computer running Adobe Audition with the spectragraph running. It was =\r\nreally compelling to see letters and numbers, not images or pictures, but p=\r\nartial words appear in the graph. At first it was I thought it was a softwa=\r\nre glitch but it is a repeatable event. It was on LiveSciFi which is run by=\r\n Tim Wood, he also thought there was some kind of code error but it happene=\r\nd on more than one webcast. \n\nSo if anyone has Audition, just feed Box outp=\r\nut right in your computer and see what happens. I wanted to try it tonight =\r\nbut I have Audacity and the spectragraph feature doesn&#39;t have that shaded a=\r\nppearance that Audition does so it&#39;s not able to render images or character=\r\ns, at least as far as I see using the various settings.\n\n\n--- In EVP-ITC@ya=\r\nhoogroups.com, Tim Woolworth &lt;tjwoolworth@...&gt; wrote:\n&gt;\n&gt; I have tried nume=\r\nrous EVP files and short box clips and so far\n&gt; nothing discernible has app=\r\neared on either program. I still have a lot of\n&gt; hope though.\n&gt; \n&gt; I don&#39;t =\r\nknow about you guys, but I am going to try to work this in to a\n&gt; session t=\r\nonight!\n&gt; \n&gt; Tim\n&gt; \n\n&gt; On Fri, Dec 17, 2010 at 4:23 PM, Ursula &lt;kalinu@...&gt;=\r\n wrote:\n&gt; \n&gt; &gt;\n&gt; &gt;\n&gt; &gt; But I don&#39;t know how to save the image ugh...what if=\r\n i just want one part\n&gt; &gt; of it..Im soo lost here..and excited at the same =\r\ntime LOL\n&gt; &gt;\n&gt; &gt; \n&gt; &gt;\n&gt;\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\r\n--0-621960288-1292805915=:2847\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;FONT size=3D4&gt;well said...also we all are le=\r\narning here. If you can&#39;t open your mind, then maybe this isn&#39;t for you. I =\r\nbelieve this ITC in not our eyes playing tricks etc etc.. This big here! op=\r\nen your eyes and your mind. We all should know by now spirit manipulates th=\r\nings. Smoke,clouds,etc.&nbsp;I don&#39;t see how this can be any different. &lt;/F=\r\nONT&gt;&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Sun, 12/19/10, Frank &lt;SPAN&gt;Sumption&lt;/SPAN&gt; &lt;I&gt;&lt;pur=\r\nplealiengirl@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-L=\r\nEFT: rgb(16,16,255) 2px solid; PADDING-LEFT: 5px; MARGIN-LEFT: 5px&quot;&gt;&lt;BR&gt;Fro=\r\nm: Frank Sumption &lt;purplealiengirl@...&gt;&lt;BR&gt;Subject: Re: [EVP-IT=\r\nC] Re: ok so im getting stuff on the spectergram&lt;BR&gt;To: EVP-ITC@yahoogroups=\r\n.com&lt;BR&gt;Date: Sunday, December 19, 2010, 6:38 PM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3Dyiv17646=\r\n95627&gt;&lt;SPAN style=3D&quot;DISPLAY: none&quot;&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV id=3Dyiv1764695627y=\r\ngrp-text&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&nbsp;Okay, that was harsh! Put my claws back in. Been=\r\n doing this stuff&nbsp;for ten years and there&#39;s always someone that thinks=\r\n they are somehow more qualified and more intelligent than anyone else. I&#39;v=\r\ne been doing EVP related work for ten years, that does not mean I have had =\r\nno other experience, have not read a butt load of books, and have no intuit=\r\nion-. I&#39;ve been having &quot;paranormal expereince&quot; before most of&nbsp;the peop=\r\nle on this group were born, and it really pisses me off to be talked down t=\r\no.&nbsp; &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;I say the images are real, and=\r\n are not at all rare, and once again I state--we are the ones with all the =\r\nlimitations! If someone on the other side has been working on technology fo=\r\nr 1000 years, how simple do you think it is for them to embed images in eve=\r\nry and any&nbsp;freaking thing they want to? Forget the Hollywood nonsense =\r\nof spirit being a deminished human zombie incapable of any action on this s=\r\nide.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;F-S&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/=\r\nDIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;BR&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV class=3Dyiv1764695627gmail_quote&gt;On Sun=\r\n, Dec 19, 2010 at 4:54 PM, Frank Sumption &lt;SPAN dir=3Dltr&gt;&lt;&lt;A href=3D&quot;ht=\r\ntp://us.mc1807.mail.yahoo.com/mc/compose?to=3Dpurplealiengirl@...&quot; re=\r\nl=3Dnofollow target=3D_blank ymailto=3D&quot;mailto:purplealiengirl@...&quot;&gt;p=\r\nurplealiengirl@...&lt;/A&gt;&gt;&lt;/SPAN&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D&quot;BOR=\r\nDER-LEFT: #ccc 1px solid&quot; class=3Dyiv1764695627gmail_quote&gt;\n&lt;DIV&gt;&nbsp;I ju=\r\nst don&#39;t like pompus A-holes coming down on everyone else. That is exactly =\r\nwhat you came across as, then you act you are somekind of ITC expert. &lt;/DIV=\r\n&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;&lt;FONT color=3D#888888&gt;\n&lt;DIV&gt;F-S&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/FONT&gt;\n&lt;DI=\r\nV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV class=3Dyiv1764695627h5&gt;\n&lt;DIV class=3Dyiv1764695627gmai=\r\nl_quote&gt;On Sun, Dec 19, 2010 at 3:49 PM, Tim Woolworth &lt;SPAN dir=3Dltr&gt;&lt;=\r\n&lt;A href=3D&quot;http://us.mc1807.mail.yahoo.com/mc/compose?to=3Dtjwoolworth@gmai=\r\nl.com&quot; rel=3Dnofollow target=3D_blank ymailto=3D&quot;mailto:tjwoolworth@gmail.c=\r\nom&quot;&gt;tjwoolworth@...&lt;/A&gt;&gt;&lt;/SPAN&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D&quot;BO=\r\nRDER-LEFT: #ccc 1px solid&quot; class=3Dyiv1764695627gmail_quote&gt;\n&lt;DIV style=3D&quot;=\r\nBACKGROUND-COLOR: #fff&quot;&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;Frank, =\r\n\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;WTF?&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;Did I second guess an=\r\nyone? &nbsp;No.&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;Did I prejudge all evidence? &nb=\r\nsp;No.&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;Was I aware of this? &nbsp;Yes. &nbsp;Did=\r\n I mention it before? &nbsp;No. &nbsp;Why? &nbsp;Because it did not interes=\r\nt me until now because I did not know the software was available for downlo=\r\nading.&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;You are putting a helluva lot of assumpti=\r\nons out there about me Frank, and you know me better than to ever equate me=\r\n with the TAPS bullshit. &nbsp;At least I thought you did.&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;=\r\n/DIV&gt;\n&lt;DIV&gt;All I can ask is WTF? &nbsp;Can no one understand basic English =\r\nin a freaking post anymore? &nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;I attacked no=\r\n one. &nbsp;I attacked no evidence. &nbsp;I did not give specific opinion a=\r\nbout the validity of evidence until forced to by Ursula&#39;s last post. &nbsp;=\r\nI only said what I would need to quantify before I start posting images. &n=\r\nbsp;And you have really jumped the shark here, Frank, and I have no idea wh=\r\ny.&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;Tim&lt;/DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;=\r\n&lt;BR&gt;\n&lt;DIV class=3Dyiv1764695627gmail_quote&gt;On Sun, Dec 19, 2010 at 5:10 PM,=\r\n Frank Sumption &lt;SPAN dir=3Dltr&gt;&lt;&lt;A href=3D&quot;http://us.mc1807.mail.yahoo.=\r\ncom/mc/compose?to=3Dpurplealiengirl@...&quot; rel=3Dnofollow target=3D_bla=\r\nnk ymailto=3D&quot;mailto:purplealiengirl@...&quot;&gt;purplealiengirl@...&lt;/=\r\nA&gt;&gt;&lt;/SPAN&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: #ccc 1px solid&quot; =\r\nclass=3Dyiv1764695627gmail_quote&gt;\n&lt;DIV style=3D&quot;BACKGROUND-COLOR: #fff&quot;&gt;&lt;SP=\r\nAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;HUH? You&#39;ve been aware=\r\n of this for so long? That&#39;s another thing that gets me, people think they =\r\nare such friggin&#39; great experts that they prejudge all evidence and and sec=\r\nond guess everyone. &lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&nbsp;So this wasn&#39;t important enough t=\r\no mention, cuz you already judged it to be bogus? Everyone thinks they are =\r\nto world&#39;s onlyest freaking experts! GodAlmighty!! &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;=\r\n\n&lt;DIV&gt;&nbsp;I with Hultay, shut down the groups and tell everyone bite me! =\r\nGo join TAPS if you want all this to corespond to preconceived idiotic Holl=\r\nywood shit!&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;F-S&lt;/DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;\n=\r\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV class=3Dyiv1764695627gmail_quo=\r\nte&gt;On Sun, Dec 19, 2010 at 7:31 AM, Tim Woolworth &lt;SPAN dir=3Dltr&gt;&lt;&lt;A hr=\r\nef=3D&quot;http://us.mc1807.mail.yahoo.com/mc/compose?to=3Dtjwoolworth@...=\r\n&quot; rel=3Dnofollow target=3D_blank ymailto=3D&quot;mailto:tjwoolworth@...&quot;&gt;t=\r\njwoolworth@...&lt;/A&gt;&gt;&lt;/SPAN&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-=\r\nLEFT: #ccc 1px solid&quot; class=3Dyiv1764695627gmail_quote&gt;\n&lt;DIV style=3D&quot;BACKG=\r\nROUND-COLOR: #fff&quot;&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;Relax Ursula=\r\n. &lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;I too have been aware of this at Keith&#39;s site=\r\n for long, long time, but like I said in the last post, I am very new to th=\r\nis as in doing it on my own computer. &nbsp;Just like you. &nbsp;So don&#39;t a=\r\nct like you know what I do and do not know, thank you very much. &nbsp;&lt;/DI=\r\nV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;I am not attacking you so back the hell off. &nbsp;=\r\nI made it clear that this was for my own own edification, for me to accept =\r\nmy own images.&nbsp;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;The image I ever so b=\r\nriefly mentioned the one posted that had several &quot;Faces&quot; or pieces thereof =\r\nthat were circled. &nbsp;As for your image of the man peeking out, I saw no=\r\nthing there. &nbsp;Period. &nbsp;&nbsp;Did I say previously what I thought =\r\nabout the quality of the images in that photo? &nbsp;No. &nbsp;I politely k=\r\nept it to myself because I do not like to differ with people or to deflate =\r\nhot air balloons. &nbsp;But there you have it, that is what I saw. &nbsp;An=\r\nd to my knowledge, that is the only time I have described what I have seen =\r\nthus far in your images other than mentioning the word &quot;eyebrows.&quot; &nbsp;In=\r\n the one that had many circles, I saw one that looked like a set of lips an=\r\nd a chin and the rest I personally thought was matrixing. &nbsp;Once again,=\r\n did I saw this? &nbsp;No. &nbsp;But you asked for it so there it is.&lt;/DIV&gt;=\r\n\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;The whole point of my post, had you read it with a cl=\r\near head. &nbsp;It was all about my own edification, that I, and I alone, n=\r\need to keep plugging in files before I, and I alone, make a judgement about=\r\n MY images and whether they are real or not based upon the images they prov=\r\nide in contrast to the bulk of other files. &nbsp;If you simply compare you=\r\nr one image with the many circles to the youtube file, I suspect I am corre=\r\nct in saying that faces occur with much more rarity than your circle file a=\r\nnd that they can appear fully formed. &nbsp;Once again, I suspect, only, an=\r\nd I will only be able to tell after time. &nbsp;Sample size is everything, =\r\nand I thought I made that abundantly clear. &nbsp;The post was simply about=\r\n my process of learning rather than running out and saying look what I foun=\r\nd when I simply don&#39;t know what has been found yet because it is the first =\r\ntime I have played with the controls rather than seeing the end snapshots o=\r\nn another\n persons website. &nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;Why do you al=\r\nways jump on the defensive and attack every one who does not fall in line w=\r\nith you? &nbsp;Not everything has to be fight or flight, Ursula, and not ev=\r\nery bridge has to be burned so thoroughly to the ground. &nbsp;This is not =\r\nan attack on you or results, reread the post, and this time thinking a litt=\r\nle more clearly about what is written on the page and not your own emotiona=\r\nl backlash construing things in the posted text that are simply not there. =\r\n&nbsp;Had you done this, you would have seen the point of my post was not a=\r\nn attack on you, in ANY way. &nbsp; &nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;Tim&lt;/=\r\nDIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;\n&lt;DIV class=3Dyiv1764695627gmail_quot=\r\ne&gt;On Sun, Dec 19, 2010 at 12:03 AM, Ursula Kalin &lt;SPAN dir=3Dltr&gt;&lt;&lt;A hre=\r\nf=3D&quot;http://us.mc1807.mail.yahoo.com/mc/compose?to=3Dkalinu@...&quot; =\r\nrel=3Dnofollow target=3D_blank ymailto=3D&quot;mailto:kalinu@...&quot;&gt;kali=\r\nnu@...&lt;/A&gt;&gt;&lt;/SPAN&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT=\r\n: #ccc 1px solid&quot; class=3Dyiv1764695627gmail_quote&gt;\n&lt;DIV style=3D&quot;BACKGROUN=\r\nD-COLOR: #fff&quot;&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;TABLE bo=\r\nrder=3D0 cellSpacing=3D0 cellPadding=3D0&gt;\n&lt;TBODY&gt;\n&lt;TR&gt;\n&lt;TD vAlign=3Dtop&gt;&lt;FO=\r\nNT size=3D4&gt;oo also they only image you saw me go crazy about was the mean =\r\nman peeking what many faces did you see??&lt;/FONT&gt; \n&lt;DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;B=\r\nR&gt;&lt;BR&gt;--- On &lt;B&gt;Sat, 12/18/10, Tim Woolworth &lt;I&gt;&lt;&lt;A href=3D&quot;http://us.mc=\r\n1807.mail.yahoo.com/mc/compose?to=3Dtjwoolworth@...&quot; rel=3Dnofollow t=\r\narget=3D_blank ymailto=3D&quot;mailto:tjwoolworth@...&quot;&gt;tjwoolworth@gmail.c=\r\nom&lt;/A&gt;&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: rgb(16,16,2=\r\n55) 2px solid&quot;&gt;&lt;BR&gt;From: Tim Woolworth &lt;&lt;A href=3D&quot;http://us.mc1807.mail=\r\n.yahoo.com/mc/compose?to=3Dtjwoolworth@...&quot; rel=3Dnofollow target=3D_=\r\nblank ymailto=3D&quot;mailto:tjwoolworth@...&quot;&gt;tjwoolworth@...&lt;/A&gt;&gt=\r\n;&lt;BR&gt;Subject: Re: [EVP-ITC] Re: ok so im getting stuff on the spectergram&lt;B=\r\nR&gt;To: &lt;A href=3D&quot;http://us.mc1807.mail.yahoo.com/mc/compose?to=3DEVP-ITC@ya=\r\nhoogroups.com&quot; rel=3Dnofollow target=3D_blank ymailto=3D&quot;mailto:EVP-ITC@yah=\r\noogroups.com&quot;&gt;EVP-ITC@yahoogroups.com&lt;/A&gt;&lt;BR&gt;Date: Saturday, December 18, 2=\r\n010, 4:57 PM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV&gt;\n&lt;DIV&gt;No, I don&#39;t think=\r\n I am being too critical, but I may have expectations that are a little too=\r\n high. &nbsp;I want to take my time with this. &nbsp;For my own understandi=\r\nng, I need to have a large sample size so I know not only what to expect to=\r\n see, but what to look for. &nbsp;I have seen ITC snapshots from programs l=\r\nike this that offer full faces. &nbsp;I would be more inclined to believe i=\r\nn such an image as opposed to, lets say. two dark lines that may or may not=\r\n be eyebrows. \n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;Even in your example of the towel, you =\r\nget half a face. &nbsp;If you have half a face (on the vertical plane, not =\r\nthe horizontal) you can extrapolate out what the entire face would look lik=\r\ne. &nbsp;This is something I would like to get myself and I would consider =\r\nthat evidence if it showed up in one of these programs. &nbsp;But, if you h=\r\nave something that looks like a forehead and that is all there is, then it =\r\ncould also look like a rock or some other such object.&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV=\r\n&gt;\n&lt;DIV&gt;I am certainly hoping for results worked into box sessions. &nbsp;Di=\r\nrecting a session with intent, like saying &quot;I am going to examine the sound=\r\n waves of this communication in hopes of seeing your face. &nbsp;Is it poss=\r\nible you can show your face to me now through sound? &quot; is what I am after. =\r\n&nbsp;If a positive hit like this happens, then I will be jumping for joy. =\r\n&nbsp;Another good example would be a name, lets say Tom, that occurs. &nbs=\r\np;If you get a positive affirmation that the name you heard is present, the=\r\nn you try the same technique only you address Tom by name and get a face, t=\r\nhat would be even better.&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;But, as it stands now,=\r\n the faces as they appear are random at best. &nbsp;I would be more incline=\r\nd to believe that when these faces do occur , they are going to occur with =\r\na lesser frequency than multiple images in a few seconds of audio like Ursu=\r\nla&#39;s example. &nbsp;If this where the case, there would be dozens, and poss=\r\nibly hundreds, of faces during a ten minute session and I just don&#39;t think =\r\nthat is possible. &nbsp;This is why I need to look at several samples to fi=\r\nnd out if this is the case or not. &nbsp;If these partialized faces occur i=\r\nn multiples all the time, I would be more apt to discount it. &nbsp;But, if=\r\n they are a rarity affixed to only a few clips out of dozens, I would be mo=\r\nre inclined to believe in them. &nbsp;Sample size is everything. &nbsp;It i=\r\ns like listening to GBC. &nbsp;If you have never done a session before, you=\r\n would be inclined to believe every stray radio signal is a communication. =\r\n&nbsp;Only by continued practice\n (expanding your sample size) can you star=\r\nt to rule out stray radio with any degree of accuracy. &nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;B=\r\nR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;On the other hand, I am very new to this and I could certainl=\r\ny be wrong. &nbsp;I will continue to plug sound into the programs and hope =\r\nfor the best. &nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;I really want this to work.=\r\n &nbsp;As you have probably experienced, when they want you to hear somethi=\r\nng or know something, they make it very obvious while communicating. &nbsp;=\r\nI am hoping they apply this same rigor to this new format to show us that t=\r\nhey are there. &nbsp;If they can, then the world of video and audio ITC wil=\r\nl merge in one source and then the skeptics be damned!&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV=\r\n&gt;\n&lt;DIV&gt;Tim&lt;BR&gt;&lt;BR&gt;\n&lt;DIV&gt;On Sat, Dec 18, 2010 at 2:24 PM, Frank Sumption &lt;SP=\r\nAN dir=3Dltr&gt;&lt;&lt;A href=3D&quot;http://us.mc1807.mail.yahoo.com/mc/compose?to=\r\n=3Dpurplealiengirl@...&quot; rel=3Dnofollow target=3D_blank&gt;purplealiengir=\r\nl@...&lt;/A&gt;&gt;&lt;/SPAN&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: #cc=\r\nc 1px solid&quot;&gt;\n&lt;DIV style=3D&quot;BACKGROUND-COLOR: #fff&quot;&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;D=\r\nIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;I think it&#39;s unrealistic to expect e=\r\nvery file to have faces and images. These faces are often just portions, ey=\r\nes and lips, some have eye brows. Like all of this, not done for proof, it&#39;=\r\ns for emotional impact.&nbsp; I have this woman that shows up in towels, al=\r\nways just half the face. Perahps you are being too critical? As with all sp=\r\nirit messages, it&#39;s what it means to the experiencer that matters. Expectin=\r\ng full faces is like expecting the kings english and proper grammer in all =\r\nEVPs. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;F-S&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DI=\r\nV&gt;\n&lt;DIV&gt;On Sat, Dec 18, 2010 at 3:07 AM, Tim Woolworth &lt;SPAN dir=3Dltr&gt;&lt;=\r\n&lt;A href=3D&quot;http://us.mc1807.mail.yahoo.com/mc/compose?to=3Dtjwoolworth@gmai=\r\nl.com&quot; rel=3Dnofollow target=3D_blank&gt;tjwoolworth@...&lt;/A&gt;&gt;&lt;/SPAN&gt; =\r\nwrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: #ccc 1px solid&quot;&gt;\n&lt;DIV style=3D=\r\n&quot;BACKGROUND-COLOR: #fff&quot;&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;I saw =\r\na couple which could be construed as images in the one series you had from =\r\nSEA, but nothing that knocked me over the head yet. &nbsp;I am going to hav=\r\ne to see a larger sample size before I determine if what you have witnessed=\r\n is in fact a form or not. &nbsp;I cannot accept an image as paranormal wit=\r\nhout knowing where it sits among the bulk of audio files. &nbsp;If every fi=\r\nle has multiple faces, the I would have &nbsp;to say that there is nothing =\r\nthere. &lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;So, I will certainly keep testing with m=\r\ny copy and hopefully something will really pop for me. &nbsp;I have run thr=\r\nough about ten files (EVP and GBC) so far for intensive study and I still h=\r\naven&#39;t got anything that I would consider a positive hit. &nbsp;I need an a=\r\nctual formed face, not portions thereof, to consider an image real. &nbsp;T=\r\nhis is the only way to discount visual matrixing.&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DI=\r\nV&gt;I have high hopes for this though!&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;Tim \n&lt;DIV&gt;\n=\r\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;DIV&gt;On Sat, Dec 18, 2010 at 5:01 AM, Ursula Kali=\r\nn &lt;SPAN dir=3Dltr&gt;&lt;&lt;A href=3D&quot;http://us.mc1807.mail.yahoo.com/mc/compose=\r\n?to=3Dkalinu@...&quot; rel=3Dnofollow target=3D_blank&gt;kalinu@sbcglobal=\r\n.net&lt;/A&gt;&gt;&lt;/SPAN&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: #ccc 1px s=\r\nolid&quot;&gt;\n&lt;DIV style=3D&quot;BACKGROUND-COLOR: #fff&quot;&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV&gt;\n&lt;DI=\r\nV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;TABLE border=3D0 cellSpacing=3D0 cellPadding=3D0&gt;\n&lt;TB=\r\nODY&gt;\n&lt;TR&gt;\n&lt;TD vAlign=3Dtop&gt;Tim did you see my images???&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Sa=\r\nt, 12/18/10, Tim Woolworth &lt;I&gt;&lt;&lt;A href=3D&quot;http://us.mc1807.mail.yahoo.co=\r\nm/mc/compose?to=3Dtjwoolworth@...&quot; rel=3Dnofollow target=3D_blank&gt;tjw=\r\noolworth@...&lt;/A&gt;&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-L=\r\nEFT: rgb(16,16,255) 2px solid&quot;&gt;&lt;BR&gt;From: Tim Woolworth &lt;&lt;A href=3D&quot;http:=\r\n//us.mc1807.mail.yahoo.com/mc/compose?to=3Dtjwoolworth@...&quot; rel=3Dnof=\r\nollow target=3D_blank&gt;tjwoolworth@...&lt;/A&gt;&gt; \n&lt;DIV&gt;&lt;BR&gt;Subject: Re: =\r\n[&lt;SPAN&gt;EVP&lt;/SPAN&gt;-ITC] Re: ok so im getting stuff on the spectergram&lt;BR&gt;To:=\r\n &lt;A href=3D&quot;http://us.mc1807.mail.yahoo.com/mc/compose?to=3DEVP-ITC@yahoogr=\r\noups.com&quot; rel=3Dnofollow target=3D_blank&gt;EVP-ITC@yahoogroups.com&lt;/A&gt;&lt;BR&gt;&lt;/D=\r\nIV&gt;Date: Saturday, December 18, 2010, 3:26 AM \n&lt;DIV&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;DIV&gt;&lt;SPAN&gt;&nb=\r\nsp;&lt;/SPAN&gt; \n&lt;DIV&gt;\n&lt;DIV&gt;I have Audition as my editor. &nbsp;I am going to ha=\r\nve to try it out. &nbsp;Thanks Bill. \n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;Tim&lt;BR&gt;&lt;BR&gt;\n&lt;DIV=\r\n&gt;On Sat, Dec 18, 2010 at 1:00 AM, psi_research &lt;SPAN dir=3Dltr&gt;&lt;&lt;A href=\r\n=3D&quot;http://us.mc1807.mail.yahoo.com/mc/compose?to=3Dvilhellm@...&quot;=\r\n rel=3Dnofollow target=3D_blank&gt;vilhellm@...&lt;/A&gt;&gt;&lt;/SPAN&gt; wrote=\r\n:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: #ccc 1px solid&quot;&gt;\n&lt;DIV style=3D&quot;BACK=\r\nGROUND-COLOR: #fff&quot;&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;I&#39;ve seen l=\r\nive webcast of ITC sessions where GB output is fed directly into the mic li=\r\nne in on a computer running Adobe Audition with the spectragraph running. I=\r\nt was really compelling to see letters and numbers, not images or pictures,=\r\n but partial words appear in the graph. At first it was I thought it was a =\r\nsoftware glitch but it is a repeatable event. It was on LiveSciFi which is =\r\nrun by Tim Wood, he also thought there was some kind of code error but it h=\r\nappened on more than one webcast. &lt;BR&gt;&lt;BR&gt;So if anyone has Audition, just f=\r\need Box output right in your computer and see what happens. I wanted to try=\r\n it tonight but I have Audacity and the spectragraph feature doesn&#39;t have t=\r\nhat shaded appearance that Audition does so it&#39;s not able to render images =\r\nor characters, at least as far as I see using the various settings.&lt;/DIV&gt;\n&lt;=\r\nDIV&gt;&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=3D&quot;http://us.mc1807.mail.yahoo.com/mc/compose?to=\r\n=3DEVP-ITC%40yahoogroups.com&quot; rel=3Dnofollow target=3D_blank&gt;EVP-ITC@yahoog=\r\nroups.com&lt;/A&gt;, Tim Woolworth &lt;tjwoolworth@...&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt;=\r\n I have tried numerous EVP files and short box clips and so far&lt;BR&gt;&gt; not=\r\nhing discernible has appeared on either program. I still have a lot of&lt;BR&gt;&=\r\ngt; hope though.&lt;BR&gt;&gt; &lt;BR&gt;&gt; I don&#39;t know about you guys, but I am goi=\r\nng to try to work this in to a&lt;BR&gt;&gt; session tonight!&lt;BR&gt;&gt; &lt;BR&gt;&gt; Ti=\r\nm&lt;BR&gt;&gt; &lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&gt; On Fri, Dec 17, 2010 at 4:23 PM, Ursula &lt;=\r\nkalinu@...&gt; wrote:&lt;BR&gt;&gt; &lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt; But I=\r\n don&#39;t know how to save the image ugh...what if i just want one part&lt;BR&gt;&gt=\r\n; &gt; of it..Im soo lost here..and excited at the same time LOL&lt;BR&gt;&gt; &g=\r\nt;&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV =\r\nstyle=3D&quot;COLOR: #fff&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;=\r\n&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/TD&gt;&lt;/TR&gt;&lt;/TBODY&gt;&lt;/TABLE&gt;\n&lt;DIV&gt;&lt;/DIV&gt;=\r\n&lt;/DIV&gt;\n&lt;DIV style=3D&quot;COLOR: #fff&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DI=\r\nV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV style=3D&quot;COLOR:=\r\n #fff&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;/D=\r\nIV&gt;&lt;/DIV&gt;\n&lt;DIV style=3D&quot;COLOR: #fff&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;=\r\n/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/TD&gt;&lt;/TR&gt;&lt;/TBODY=\r\n&gt;&lt;/TABLE&gt;\n&lt;DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV style=3D&quot;COLOR: #fff&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/=\r\nDIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;=\r\n\n&lt;DIV style=3D&quot;COLOR: #fff&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;BR&gt;=\r\n&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV style=3D&quot;COLOR: #fff&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV=\r\n&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;/D=\r\nIV&gt;&lt;/DIV&gt;\n&lt;DIV style=3D&quot;COLOR: #fff&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;=\r\n/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/td&gt;&lt;=\r\n/tr&gt;&lt;/table&gt;\r\n--0-621960288-1292805915=:2847--"}