{"id": "19662", "subject": "Re: [EVP-ITC] Re: ok so im getting stuff on the spectergram", "author": "Ursula Kalin", "timestamp": "2010-12-20T01:33:02Z", "full_text": "--0-610691509-1292808782=:92295\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nno one its changing anything here those where are images...also &quot;hopefully =\r\nthey will be able to do so in a visual form&quot;. \nHow can you say Hopefully..t=\r\nhey do this alll the time through smoke,black mirrors, etc..if you KNOW the=\r\n can change soundwaves why is the leap so huge for you to believe they can =\r\ndo this on through visual form...one of those faces I have seen with my own=\r\n eyes in my home..but I&#39;m sure you don&#39;t believe that either which is ok. I=\r\n&#39;m not hear to convince anyone anything..maybe you will try it out a few mo=\r\nre times and it will work for you maybe not,also I may be wrong but what wo=\r\nrks for one does not always work for everyone. Hence Boxs,digital evp, etc.=\r\n.I have a very close relationship with spirit as I&#39;m sure alot of you do..m=\r\naybe this sort of thing they have to want you to see..maybe thats why your =\r\nnot on your end\n=C2=A0\nmaybe I shouldn&#39;t said anything about this...people =\r\nare not ready\nGood luck\n=C2=A0\nsinging Kum Ba Yah now :)\n\n\n--- On Sun, 12/1=\r\n9/10, Tim Woolworth &lt;tjwoolworth@...&gt; wrote:\n\n\nFrom: Tim Woolworth &lt;t=\r\njwoolworth@...&gt;\nSubject: Re: [EVP-ITC] Re: ok so im getting stuff on =\r\nthe spectergram\nTo: EVP-ITC@yahoogroups.com\nDate: Sunday, December 19, 2010=\r\n, 6:51 PM\n\n\n=C2=A0 \n\n\n\nI&#39;m glad all is well. =C2=A0Hugs to you both. =C2=A0=\r\nCan we sing Kum Ba Yah now? \n\n\nI think Draiga&#39;s file she posted earlier tod=\r\nay hit it on the head. =C2=A0If they know something works and want us to kn=\r\now it too, it will happen. =C2=A0Be it through physical evidence, transferr=\r\ned intuition, or software manipulation. =C2=A0They only thing we know is th=\r\nat they can manipulate soundwaves, hopefully they will be able to do so in =\r\na visual form.\n\n\nTim\n\n\nOn Sun, Dec 19, 2010 at 7:45 PM, Ursula Kalin &lt;kalin=\r\nu@...&gt; wrote:\n\n\n=C2=A0 \n\n\n\n\n\n\n\nwell said...also we all are learni=\r\nng here. If you can&#39;t open your mind, then maybe this isn&#39;t for you. I beli=\r\neve this ITC in not our eyes playing tricks etc etc.. This big here! open y=\r\nour eyes and your mind. We all should know by now spirit manipulates things=\r\n. Smoke,clouds,etc.=C2=A0I don&#39;t see how this can be any different. \n\n--- O=\r\nn Sun, 12/19/10, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n\n\nFrom: =\r\nFrank Sumption &lt;purplealiengirl@...&gt; \n\nSubject: Re: [EVP-ITC] Re: ok =\r\nso im getting stuff on the spectergram\nTo: EVP-ITC@yahoogroups.com\nDate: Su=\r\nnday, December 19, 2010, 6:38 PM \n\n\n\n\n\n=C2=A0 \n\n\n=C2=A0Okay, that was harsh=\r\n! Put my claws back in. Been doing this stuff=C2=A0for ten years and there&#39;=\r\ns always someone that thinks they are somehow more qualified and more intel=\r\nligent than anyone else. I&#39;ve been doing EVP related work for ten years, th=\r\nat does not mean I have had no other experience, have not read a butt load =\r\nof books, and have no intuition-. I&#39;ve been having &quot;paranormal expereince&quot; =\r\nbefore most of=C2=A0the people on this group were born, and it really pisse=\r\ns me off to be talked down to.=C2=A0 \n=C2=A0\n=C2=A0I say the images are rea=\r\nl, and are not at all rare, and once again I state--we are the ones with al=\r\nl the limitations! If someone on the other side has been working on technol=\r\nogy for 1000 years, how simple do you think it is for them to embed images =\r\nin every and any=C2=A0freaking thing they want to? Forget the Hollywood non=\r\nsense of spirit being a deminished human zombie incapable of any action on =\r\nthis side.\n=C2=A0\nF-S\n=C2=A0\n=C2=A0\n\n\n=C2=A0\nOn Sun, Dec 19, 2010 at 4:54 P=\r\nM, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n\n\n=C2=A0I just don&#39;t l=\r\nike pompus A-holes coming down on everyone else. That is exactly what you c=\r\name across as, then you act you are somekind of ITC expert. \n=C2=A0\nF-S\n\n\n\n=\r\n\n\nOn Sun, Dec 19, 2010 at 3:49 PM, Tim Woolworth &lt;tjwoolworth@...&gt; wr=\r\note:\n\n\n=C2=A0 \n\n\n\nFrank, \n\n\nWTF?\n\n\nDid I second guess anyone? =C2=A0No.\n\n\nD=\r\nid I prejudge all evidence? =C2=A0No.\n\n\nWas I aware of this? =C2=A0Yes. =C2=\r\n=A0Did I mention it before? =C2=A0No. =C2=A0Why? =C2=A0Because it did not i=\r\nnterest me until now because I did not know the software was available for =\r\ndownloading.\n\n\nYou are putting a helluva lot of assumptions out there about=\r\n me Frank, and you know me better than to ever equate me with the TAPS bull=\r\nshit. =C2=A0At least I thought you did.\n\n\nAll I can ask is WTF? =C2=A0Can n=\r\no one understand basic English in a freaking post anymore? =C2=A0\n\n\nI attac=\r\nked no one. =C2=A0I attacked no evidence. =C2=A0I did not give specific opi=\r\nnion about the validity of evidence until forced to by Ursula&#39;s last post. =\r\n=C2=A0I only said what I would need to quantify before I start posting imag=\r\nes. =C2=A0And you have really jumped the shark here, Frank, and I have no i=\r\ndea why.\n\n\nTim\n\n\n\n\n\n\nOn Sun, Dec 19, 2010 at 5:10 PM, Frank Sumption &lt;purpl=\r\nealiengirl@...&gt; wrote:\n\n\n=C2=A0 \n\n\n\n\nHUH? You&#39;ve been aware of this f=\r\nor so long? That&#39;s another thing that gets me, people think they are such f=\r\nriggin&#39; great experts that they prejudge all evidence and and second guess =\r\neveryone. \n\n=C2=A0So this wasn&#39;t important enough to mention, cuz you alrea=\r\ndy judged it to be bogus? Everyone thinks they are to world&#39;s onlyest freak=\r\ning experts! GodAlmighty!! \n=C2=A0\n=C2=A0I with Hultay, shut down the group=\r\ns and tell everyone bite me! Go join TAPS if you want all this to corespond=\r\n to preconceived idiotic Hollywood shit!\n=C2=A0\nF-S\n\n\n\n=C2=A0\n\n=C2=A0\nOn Su=\r\nn, Dec 19, 2010 at 7:31 AM, Tim Woolworth &lt;tjwoolworth@...&gt; wrote:\n\n\n=\r\n=C2=A0 \n\n\n\nRelax Ursula. \n\n\nI too have been aware of this at Keith&#39;s site f=\r\nor long, long time, but like I said in the last post, I am very new to this=\r\n as in doing it on my own computer. =C2=A0Just like you. =C2=A0So don&#39;t act=\r\n like you know what I do and do not know, thank you very much. =C2=A0\n\n\nI a=\r\nm not attacking you so back the hell off. =C2=A0I made it clear that this w=\r\nas for my own own edification, for me to accept my own images.=C2=A0=C2=A0\n=\r\n\n\nThe image I ever so briefly mentioned the one posted that had several &quot;Fa=\r\nces&quot; or pieces thereof that were circled. =C2=A0As for your image of the ma=\r\nn peeking out, I saw nothing there. =C2=A0Period. =C2=A0=C2=A0Did I say pre=\r\nviously what I thought about the quality of the images in that photo? =C2=\r\n=A0No. =C2=A0I politely kept it to myself because I do not like to differ w=\r\nith people or to deflate hot air balloons. =C2=A0But there you have it, tha=\r\nt is what I saw. =C2=A0And to my knowledge, that is the only time I have de=\r\nscribed what I have seen thus far in your images other than mentioning the =\r\nword &quot;eyebrows.&quot; =C2=A0In the one that had many circles, I saw one that loo=\r\nked like a set of lips and a chin and the rest I personally thought was mat=\r\nrixing. =C2=A0Once again, did I saw this? =C2=A0No. =C2=A0But you asked for=\r\n it so there it is.\n\n\nThe whole point of my post, had you read it with a cl=\r\near head. =C2=A0It was all about my own edification, that I, and I alone, n=\r\need to keep plugging in files before I, and I alone, make a judgement about=\r\n MY images and whether they are real or not based upon the images they prov=\r\nide in contrast to the bulk of other files. =C2=A0If you simply compare you=\r\nr one image with the many circles to the youtube file, I suspect I am corre=\r\nct in saying that faces occur with much more rarity than your circle file a=\r\nnd that they can appear fully formed. =C2=A0Once again, I suspect, only, an=\r\nd I will only be able to tell after time. =C2=A0Sample size is everything, =\r\nand I thought I made that abundantly clear. =C2=A0The post was simply about=\r\n my process of learning rather than running out and saying look what I foun=\r\nd when I simply don&#39;t know what has been found yet because it is the first =\r\ntime I have played with the controls rather than seeing the end snapshots o=\r\nn another persons website. =C2=A0\n\n\nWhy do you always jump on the defensive=\r\n and attack every one who does not fall in line with you? =C2=A0Not everyth=\r\ning has to be fight or flight, Ursula, and not every bridge has to be burne=\r\nd so thoroughly to the ground. =C2=A0This is not an attack on you or result=\r\ns, reread the post, and this time thinking a little more clearly about what=\r\n is written on the page and not your own emotional backlash construing thin=\r\ngs in the posted text that are simply not there. =C2=A0Had you done this, y=\r\nou would have seen the point of my post was not an attack on you, in ANY wa=\r\ny. =C2=A0 =C2=A0\n\n\nTim\n\n\n\n\n\nOn Sun, Dec 19, 2010 at 12:03 AM, Ursula Kalin =\r\n&lt;kalinu@...&gt; wrote:\n\n\n=C2=A0 \n\n\n\n\n\n\n\noo also they only image you =\r\nsaw me go crazy about was the mean man peeking what many faces did you see?=\r\n? \n\n\n\n\n--- On Sat, 12/18/10, Tim Woolworth &lt;tjwoolworth@...&gt; wrote:\n\n=\r\n\nFrom: Tim Woolworth &lt;tjwoolworth@...&gt;\nSubject: Re: [EVP-ITC] Re: ok =\r\nso im getting stuff on the spectergram\nTo: EVP-ITC@yahoogroups.com\nDate: Sa=\r\nturday, December 18, 2010, 4:57 PM\n\n\n=C2=A0 \n\nNo, I don&#39;t think I am being =\r\ntoo critical, but I may have expectations that are a little too high. =C2=\r\n=A0I want to take my time with this. =C2=A0For my own understanding, I need=\r\n to have a large sample size so I know not only what to expect to see, but =\r\nwhat to look for. =C2=A0I have seen ITC snapshots from programs like this t=\r\nhat offer full faces. =C2=A0I would be more inclined to believe in such an =\r\nimage as opposed to, lets say. two dark lines that may or may not be eyebro=\r\nws. \n\n\nEven in your example of the towel, you get half a face. =C2=A0If you=\r\n have half a face (on the vertical plane, not the horizontal) you can extra=\r\npolate out what the entire face would look like. =C2=A0This is something I =\r\nwould like to get myself and I would consider that evidence if it showed up=\r\n in one of these programs. =C2=A0But, if you have something that looks like=\r\n a forehead and that is all there is, then it could also look like a rock o=\r\nr some other such object.\n\n\nI am certainly hoping for results worked into b=\r\nox sessions. =C2=A0Directing a session with intent, like saying &quot;I am going=\r\n to examine the sound waves of this communication in hopes of seeing your f=\r\nace. =C2=A0Is it possible you can show your face to me now through sound? &quot;=\r\n is what I am after. =C2=A0If a positive hit like this happens, then I will=\r\n be jumping for joy. =C2=A0Another good example would be a name, lets say T=\r\nom, that occurs. =C2=A0If you get a positive affirmation that the name you =\r\nheard is present, then you try the same technique only you address Tom by n=\r\name and get a face, that would be even better.\n\n\nBut, as it stands now, the=\r\n faces as they appear are random at best. =C2=A0I would be more inclined to=\r\n believe that when these faces do occur , they are going to occur with a le=\r\nsser frequency than multiple images in a few seconds of audio like Ursula&#39;s=\r\n example. =C2=A0If this where the case, there would be dozens, and possibly=\r\n hundreds, of faces during a ten minute session and I just don&#39;t think that=\r\n is possible. =C2=A0This is why I need to look at several samples to find o=\r\nut if this is the case or not. =C2=A0If these partialized faces occur in mu=\r\nltiples all the time, I would be more apt to discount it. =C2=A0But, if the=\r\ny are a rarity affixed to only a few clips out of dozens, I would be more i=\r\nnclined to believe in them. =C2=A0Sample size is everything. =C2=A0It is li=\r\nke listening to GBC. =C2=A0If you have never done a session before, you wou=\r\nld be inclined to believe every stray radio signal is a communication. =C2=\r\n=A0Only by continued practice (expanding your sample size) can you start to=\r\n\n rule out stray radio with any degree of accuracy. =C2=A0\n\n\nOn the other h=\r\nand, I am very new to this and I could certainly be wrong. =C2=A0I will con=\r\ntinue to plug sound into the programs and hope for the best. =C2=A0\n\n\nI rea=\r\nlly want this to work. =C2=A0As you have probably experienced, when they wa=\r\nnt you to hear something or know something, they make it very obvious while=\r\n communicating. =C2=A0I am hoping they apply this same rigor to this new fo=\r\nrmat to show us that they are there. =C2=A0If they can, then the world of v=\r\nideo and audio ITC will merge in one source and then the skeptics be damned=\r\n!\n\n\nTim\n\n\nOn Sat, Dec 18, 2010 at 2:24 PM, Frank Sumption &lt;purplealiengirl@=\r\ngmail.com&gt; wrote:\n\n\n=C2=A0 \n\n\n\n\n=C2=A0I think it&#39;s unrealistic to expect ev=\r\nery file to have faces and images. These faces are often just portions, eye=\r\ns and lips, some have eye brows. Like all of this, not done for proof, it&#39;s=\r\n for emotional impact.=C2=A0 I have this woman that shows up in towels, alw=\r\nays just half the face. Perahps you are being too critical? As with all spi=\r\nrit messages, it&#39;s what it means to the experiencer that matters. Expecting=\r\n full faces is like expecting the kings english and proper grammer in all E=\r\nVPs. \n=C2=A0\nF-S\n\n\n\n\n\nOn Sat, Dec 18, 2010 at 3:07 AM, Tim Woolworth &lt;tjwoo=\r\nlworth@...&gt; wrote:\n\n\n=C2=A0 \n\n\n\nI saw a couple which could be constru=\r\ned as images in the one series you had from SEA, but nothing that knocked m=\r\ne over the head yet. =C2=A0I am going to have to see a larger sample size b=\r\nefore I determine if what you have witnessed is in fact a form or not. =C2=\r\n=A0I cannot accept an image as paranormal without knowing where it sits amo=\r\nng the bulk of audio files. =C2=A0If every file has multiple faces, the I w=\r\nould have =C2=A0to say that there is nothing there. \n\n\nSo, I will certainly=\r\n keep testing with my copy and hopefully something will really pop for me. =\r\n=C2=A0I have run through about ten files (EVP and GBC) so far for intensive=\r\n study and I still haven&#39;t got anything that I would consider a positive hi=\r\nt. =C2=A0I need an actual formed face, not portions thereof, to consider an=\r\n image real. =C2=A0This is the only way to discount visual matrixing.\n\n\nI h=\r\nave high hopes for this though!\n\n\nTim \n\n\n\n\n\nOn Sat, Dec 18, 2010 at 5:01 AM=\r\n, Ursula Kalin &lt;kalinu@...&gt; wrote:\n\n\n=C2=A0 \n\n\n\n\n\n\n\nTim did you s=\r\nee my images???\n\n--- On Sat, 12/18/10, Tim Woolworth &lt;tjwoolworth@...=\r\n&gt; wrote:\n\n\nFrom: Tim Woolworth &lt;tjwoolworth@...&gt; \n\nSubject: Re: [EVP-=\r\nITC] Re: ok so im getting stuff on the spectergram\nTo: EVP-ITC@yahoogroups.=\r\ncom\nDate: Saturday, December 18, 2010, 3:26 AM \n\n\n\n=C2=A0 \n\nI have Audition=\r\n as my editor. =C2=A0I am going to have to try it out. =C2=A0Thanks Bill. \n=\r\n\n\nTim\n\n\nOn Sat, Dec 18, 2010 at 1:00 AM, psi_research &lt;vilhellm@sbcglobal.n=\r\net&gt; wrote:\n\n\n=C2=A0 \n\n\n\nI&#39;ve seen live webcast of ITC sessions where GB out=\r\nput is fed directly into the mic line in on a computer running Adobe Auditi=\r\non with the spectragraph running. It was really compelling to see letters a=\r\nnd numbers, not images or pictures, but partial words appear in the graph. =\r\nAt first it was I thought it was a software glitch but it is a repeatable e=\r\nvent. It was on LiveSciFi which is run by Tim Wood, he also thought there w=\r\nas some kind of code error but it happened on more than one webcast. \n\nSo i=\r\nf anyone has Audition, just feed Box output right in your computer and see =\r\nwhat happens. I wanted to try it tonight but I have Audacity and the spectr=\r\nagraph feature doesn&#39;t have that shaded appearance that Audition does so it=\r\n&#39;s not able to render images or characters, at least as far as I see using =\r\nthe various settings.\n\n\n--- In EVP-ITC@yahoogroups.com, Tim Woolworth &lt;tjwo=\r\nolworth@...&gt; wrote:\n&gt;\n&gt; I have tried numerous EVP files and short box clips=\r\n and so far\n&gt; nothing discernible has appeared on either program. I still h=\r\nave a lot of\n&gt; hope though.\n&gt; \n&gt; I don&#39;t know about you guys, but I am goin=\r\ng to try to work this in to a\n&gt; session tonight!\n&gt; \n&gt; Tim\n&gt; \n\n&gt; On Fri, Dec=\r\n 17, 2010 at 4:23 PM, Ursula &lt;kalinu@...&gt; wrote:\n&gt; \n&gt; &gt;\n&gt; &gt;\n&gt; &gt; But I don&#39;t=\r\n know how to save the image ugh...what if i just want one part\n&gt; &gt; of it..I=\r\nm soo lost here..and excited at the same time LOL\n&gt; &gt;\n&gt; &gt; \n&gt; &gt;\n&gt;\n\n\n\n\n\n\n\n\n\n\n=\r\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\r\n--0-610691509-1292808782=:92295\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;FONT size=3D4&gt;no one its changing anything h=\r\nere those where are images...also &quot;hopefully they will be able to do so in =\r\na visual form&quot;. \n&lt;DIV&gt;How can you say Hopefully..they do this alll the time=\r\n through smoke,black mirrors, etc..if you KNOW the can change soundwaves wh=\r\ny is the leap so huge for you to believe they can do this on through visual=\r\n form...one of those faces I have seen with my own eyes in my home..but I&#39;m=\r\n sure you don&#39;t believe that either which is &lt;SPAN&gt;ok&lt;/SPAN&gt;. I&#39;m not hear =\r\nto convince anyone anything..maybe you will try it out a few more times and=\r\n it will work for you maybe not,also I may be wrong but what works for one =\r\ndoes not always work for everyone. Hence Boxs,digital evp, etc..I have a ve=\r\nry close relationship with spirit as I&#39;m sure alot of you do..maybe this so=\r\nrt of thing they have to want you to see..maybe thats why your not on your =\r\nend&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;maybe I shouldn&#39;t said anything about this=\r\n...people are not ready&lt;/DIV&gt;\n&lt;DIV&gt;Good luck&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;s=\r\ninging Kum Ba Yah now :)&lt;BR&gt;&lt;/DIV&gt;&lt;/FONT&gt;&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Sun, 12/19/10, T=\r\nim Woolworth &lt;I&gt;&lt;tjwoolworth@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOT=\r\nE style=3D&quot;BORDER-LEFT: rgb(16,16,255) 2px solid; PADDING-LEFT: 5px; MARGIN=\r\n-LEFT: 5px&quot;&gt;&lt;BR&gt;From: Tim Woolworth &lt;tjwoolworth@...&gt;&lt;BR&gt;Subjec=\r\nt: Re: [EVP-ITC] Re: ok so im getting stuff on the spectergram&lt;BR&gt;To: EVP-I=\r\nTC@yahoogroups.com&lt;BR&gt;Date: Sunday, December 19, 2010, 6:51 PM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV=\r\n id=3Dyiv1781277221&gt;&lt;SPAN style=3D&quot;DISPLAY: none&quot;&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV id=3D=\r\nyiv1781277221ygrp-text&gt;\n&lt;DIV&gt;I&#39;m glad all is well. &nbsp;Hugs to you both. =\r\n&nbsp;Can we sing Kum Ba Yah now? \n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;I think Draiga&#39;s fi=\r\nle she posted earlier today hit it on the head. &nbsp;If they know somethin=\r\ng works and want us to know it too, it will happen. &nbsp;Be it through phy=\r\nsical evidence, transferred intuition, or software manipulation. &nbsp;They=\r\n only thing we know is that they can manipulate soundwaves, hopefully they =\r\nwill be able to do so in a visual form.&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;Tim&lt;BR&gt;&lt;=\r\nBR&gt;\n&lt;DIV class=3Dyiv1781277221gmail_quote&gt;On Sun, Dec 19, 2010 at 7:45 PM, =\r\nUrsula Kalin &lt;SPAN dir=3Dltr&gt;&lt;&lt;A href=3D&quot;http://us.mc1807.mail.yahoo.com=\r\n/mc/compose?to=3Dkalinu@...&quot; rel=3Dnofollow target=3D_blank ymail=\r\nto=3D&quot;mailto:kalinu@...&quot;&gt;kalinu@...&lt;/A&gt;&gt;&lt;/SPAN&gt; wrot=\r\ne:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: #ccc 1px solid&quot; class=3Dyiv1781277=\r\n221gmail_quote&gt;\n&lt;DIV style=3D&quot;BACKGROUND-COLOR: #fff&quot;&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n=\r\n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;TABLE border=3D0 cellSpacing=3D0 cellPadding=\r\n=3D0&gt;\n&lt;TBODY&gt;\n&lt;TR&gt;\n&lt;TD vAlign=3Dtop&gt;&lt;FONT size=3D4&gt;well said...also we all =\r\nare learning here. If you can&#39;t open your mind, then maybe this isn&#39;t for y=\r\nou. I believe this ITC in not our eyes playing tricks etc etc.. This big he=\r\nre! open your eyes and your mind. We all should know by now spirit manipula=\r\ntes things. Smoke,clouds,etc.&nbsp;I don&#39;t see how this can be any differen=\r\nt. &lt;/FONT&gt;&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Sun, 12/19/10, Frank &lt;SPAN&gt;Sumption&lt;/SPAN&gt; &lt;I&gt;&=\r\nlt;&lt;A href=3D&quot;http://us.mc1807.mail.yahoo.com/mc/compose?to=3Dpurplealiengi=\r\nrl@...&quot; rel=3Dnofollow target=3D_blank ymailto=3D&quot;mailto:purplealieng=\r\nirl@...&quot;&gt;purplealiengirl@...&lt;/A&gt;&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQ=\r\nUOTE style=3D&quot;BORDER-LEFT: rgb(16,16,255) 2px solid&quot;&gt;&lt;BR&gt;From: Frank Sumpti=\r\non &lt;&lt;A href=3D&quot;http://us.mc1807.mail.yahoo.com/mc/compose?to=3Dpurpleali=\r\nengirl@...&quot; rel=3Dnofollow target=3D_blank ymailto=3D&quot;mailto:purpleal=\r\niengirl@...&quot;&gt;purplealiengirl@...&lt;/A&gt;&gt; \n&lt;DIV class=3Dyiv17812=\r\n77221im&gt;&lt;BR&gt;Subject: Re: [EVP-ITC] Re: ok so im getting stuff on the specte=\r\nrgram&lt;BR&gt;To: &lt;A href=3D&quot;http://us.mc1807.mail.yahoo.com/mc/compose?to=3DEVP=\r\n-ITC@yahoogroups.com&quot; rel=3Dnofollow target=3D_blank ymailto=3D&quot;mailto:EVP-=\r\nITC@yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups.com&lt;/A&gt;&lt;BR&gt;&lt;/DIV&gt;Date: Sunday, Dec=\r\nember 19, 2010, 6:38 PM \n&lt;DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV class=3Dyiv1781277221h5&gt;&lt;BR=\r\n&gt;&lt;BR&gt;\n&lt;DIV&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&nbsp;Okay, that was harsh=\r\n! Put my claws back in. Been doing this stuff&nbsp;for ten years and there&#39;=\r\ns always someone that thinks they are somehow more qualified and more intel=\r\nligent than anyone else. I&#39;ve been doing EVP related work for ten years, th=\r\nat does not mean I have had no other experience, have not read a butt load =\r\nof books, and have no intuition-. I&#39;ve been having &quot;paranormal expereince&quot; =\r\nbefore most of&nbsp;the people on this group were born, and it really pisse=\r\ns me off to be talked down to.&nbsp; &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;I =\r\nsay the images are real, and are not at all rare, and once again I state--w=\r\ne are the ones with all the limitations! If someone on the other side has b=\r\neen working on technology for 1000 years, how simple do you think it is for=\r\n them to embed images in every and any&nbsp;freaking thing they want to? Fo=\r\nrget the Hollywood nonsense of spirit being a deminished human zombie incap=\r\nable of any action on this side.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;F-S&lt;/DIV&gt;\n&lt;DI=\r\nV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;BR&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;On Sun, Dec=\r\n 19, 2010 at 4:54 PM, Frank Sumption &lt;SPAN dir=3Dltr&gt;&lt;&lt;A href=3D&quot;http://=\r\nus.mc1807.mail.yahoo.com/mc/compose?to=3Dpurplealiengirl@...&quot; rel=3Dn=\r\nofollow target=3D_blank&gt;purplealiengirl@...&lt;/A&gt;&gt;&lt;/SPAN&gt; wrote:&lt;BR&gt;=\r\n\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: #ccc 1px solid&quot;&gt;\n&lt;DIV&gt;&nbsp;I just don&#39;t=\r\n like pompus A-holes coming down on everyone else. That is exactly what you=\r\n came across as, then you act you are somekind of ITC expert. &lt;/DIV&gt;\n&lt;DIV&gt;&=\r\nnbsp;&lt;/DIV&gt;&lt;FONT color=3D#888888&gt;\n&lt;DIV&gt;F-S&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/FONT&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;=\r\n&lt;/DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;On Sun, Dec 19, 2010 at 3:49 PM, Tim Woolworth &lt;SPAN dir=\r\n=3Dltr&gt;&lt;&lt;A href=3D&quot;http://us.mc1807.mail.yahoo.com/mc/compose?to=3Dtjwoo=\r\nlworth@...&quot; rel=3Dnofollow target=3D_blank&gt;tjwoolworth@...&lt;/A&gt;&=\r\ngt;&lt;/SPAN&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: #ccc 1px solid&quot;&gt;\n&lt;D=\r\nIV style=3D&quot;BACKGROUND-COLOR: #fff&quot;&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;\n=\r\n&lt;DIV&gt;Frank, \n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;WTF?&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;Did I sec=\r\nond guess anyone? &nbsp;No.&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;Did I prejudge all e=\r\nvidence? &nbsp;No.&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;Was I aware of this? &nbsp;Ye=\r\ns. &nbsp;Did I mention it before? &nbsp;No. &nbsp;Why? &nbsp;Because it did=\r\n not interest me until now because I did not know the software was availabl=\r\ne for downloading.&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;You are putting a helluva lot=\r\n of assumptions out there about me Frank, and you know me better than to ev=\r\ner equate me with the TAPS bullshit. &nbsp;At least I thought you did.&lt;/DIV=\r\n&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;All I can ask is WTF? &nbsp;Can no one understand ba=\r\nsic English in a freaking post anymore? &nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;I=\r\n attacked no one. &nbsp;I attacked no evidence. &nbsp;I did not give specif=\r\nic opinion about the validity of evidence until forced to by Ursula&#39;s last =\r\npost. &nbsp;I only said what I would need to quantify before I start postin=\r\ng images. &nbsp;And you have really jumped the shark here, Frank, and I hav=\r\ne no idea why.&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;Tim&lt;/DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;=\r\n\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;\n&lt;DIV&gt;On Sun, Dec 19, 2010 at 5:10 PM, Frank Sumption &lt;SPAN=\r\n dir=3Dltr&gt;&lt;&lt;A href=3D&quot;http://us.mc1807.mail.yahoo.com/mc/compose?to=3Dp=\r\nurplealiengirl@...&quot; rel=3Dnofollow target=3D_blank&gt;purplealiengirl@gm=\r\nail.com&lt;/A&gt;&gt;&lt;/SPAN&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: #ccc 1p=\r\nx solid&quot;&gt;\n&lt;DIV style=3D&quot;BACKGROUND-COLOR: #fff&quot;&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV&gt;\n=\r\n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;HUH? You&#39;ve been aware of this for so long? Th=\r\nat&#39;s another thing that gets me, people think they are such friggin&#39; great =\r\nexperts that they prejudge all evidence and and second guess everyone. &lt;/DI=\r\nV&gt;\n&lt;DIV&gt;&lt;BR&gt;&nbsp;So this wasn&#39;t important enough to mention, cuz you alrea=\r\ndy judged it to be bogus? Everyone thinks they are to world&#39;s onlyest freak=\r\ning experts! GodAlmighty!! &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;I with Hulta=\r\ny, shut down the groups and tell everyone bite me! Go join TAPS if you want=\r\n all this to corespond to preconceived idiotic Hollywood shit!&lt;/DIV&gt;\n&lt;DIV&gt;&=\r\nnbsp;&lt;/DIV&gt;\n&lt;DIV&gt;F-S&lt;/DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;=\r\nBR&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;On Sun, Dec 19, 2010 at 7:31 AM, Tim Woolworth &lt;SPAN d=\r\nir=3Dltr&gt;&lt;&lt;A href=3D&quot;http://us.mc1807.mail.yahoo.com/mc/compose?to=3Dtjw=\r\noolworth@...&quot; rel=3Dnofollow target=3D_blank&gt;tjwoolworth@...&lt;/A=\r\n&gt;&gt;&lt;/SPAN&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: #ccc 1px solid&quot;&gt;\n=\r\n&lt;DIV style=3D&quot;BACKGROUND-COLOR: #fff&quot;&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV=\r\n&gt;\n&lt;DIV&gt;Relax Ursula. &lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;I too have been aware of t=\r\nhis at Keith&#39;s site for long, long time, but like I said in the last post, =\r\nI am very new to this as in doing it on my own computer. &nbsp;Just like yo=\r\nu. &nbsp;So don&#39;t act like you know what I do and do not know, thank you ve=\r\nry much. &nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;I am not attacking you so back t=\r\nhe hell off. &nbsp;I made it clear that this was for my own own edification=\r\n, for me to accept my own images.&nbsp;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;Th=\r\ne image I ever so briefly mentioned the one posted that had several &quot;Faces&quot;=\r\n or pieces thereof that were circled. &nbsp;As for your image of the man pe=\r\neking out, I saw nothing there. &nbsp;Period. &nbsp;&nbsp;Did I say previou=\r\nsly what I thought about the quality of the images in that photo? &nbsp;No.=\r\n &nbsp;I politely kept it to myself because I do not like to differ with pe=\r\nople or to deflate hot air balloons. &nbsp;But there you have it, that is w=\r\nhat I saw. &nbsp;And to my knowledge, that is the only time I have describe=\r\nd what I have seen thus far in your images other than mentioning the word &quot;=\r\neyebrows.&quot; &nbsp;In the one that had many circles, I saw one that looked li=\r\nke a set of lips and a chin and the rest I personally thought was matrixing=\r\n. &nbsp;Once again, did I saw this? &nbsp;No. &nbsp;But you asked for it so=\r\n there it is.&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;The whole point of my post, had yo=\r\nu read it with a clear head. &nbsp;It was all about my own edification, tha=\r\nt I, and I alone, need to keep plugging in files before I, and I alone, mak=\r\ne a judgement about MY images and whether they are real or not based upon t=\r\nhe images they provide in contrast to the bulk of other files. &nbsp;If you=\r\n simply compare your one image with the many circles to the youtube file, I=\r\n suspect I am correct in saying that faces occur with much more rarity than=\r\n your circle file and that they can appear fully formed. &nbsp;Once again, =\r\nI suspect, only, and I will only be able to tell after time. &nbsp;Sample s=\r\nize is everything, and I thought I made that abundantly clear. &nbsp;The po=\r\nst was simply about my process of learning rather than running out and sayi=\r\nng look what I found when I simply don&#39;t know what has been found yet becau=\r\nse it is the first time I have played with the controls rather than seeing =\r\nthe end snapshots on another\n persons website. &nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;=\r\n\n&lt;DIV&gt;Why do you always jump on the defensive and attack every one who does=\r\n not fall in line with you? &nbsp;Not everything has to be fight or flight,=\r\n Ursula, and not every bridge has to be burned so thoroughly to the ground.=\r\n &nbsp;This is not an attack on you or results, reread the post, and this t=\r\nime thinking a little more clearly about what is written on the page and no=\r\nt your own emotional backlash construing things in the posted text that are=\r\n simply not there. &nbsp;Had you done this, you would have seen the point o=\r\nf my post was not an attack on you, in ANY way. &nbsp; &nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;B=\r\nR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;Tim&lt;/DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;\n&lt;DIV&gt;On Sun, Dec =\r\n19, 2010 at 12:03 AM, Ursula Kalin &lt;SPAN dir=3Dltr&gt;&lt;&lt;A href=3D&quot;http://us=\r\n.mc1807.mail.yahoo.com/mc/compose?to=3Dkalinu@...&quot; rel=3Dnofollow=\r\n target=3D_blank&gt;kalinu@...&lt;/A&gt;&gt;&lt;/SPAN&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE=\r\n style=3D&quot;BORDER-LEFT: #ccc 1px solid&quot;&gt;\n&lt;DIV style=3D&quot;BACKGROUND-COLOR: #ff=\r\nf&quot;&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;TABLE border=3D0 cel=\r\nlSpacing=3D0 cellPadding=3D0&gt;\n&lt;TBODY&gt;\n&lt;TR&gt;\n&lt;TD vAlign=3Dtop&gt;&lt;FONT size=3D4&gt;=\r\noo also they only image you saw me go crazy about was the mean man peeking =\r\nwhat many faces did you see??&lt;/FONT&gt; \n&lt;DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;BR&gt;--- On=\r\n &lt;B&gt;Sat, 12/18/10, Tim Woolworth &lt;I&gt;&lt;&lt;A href=3D&quot;http://us.mc1807.mail.ya=\r\nhoo.com/mc/compose?to=3Dtjwoolworth@...&quot; rel=3Dnofollow target=3D_bla=\r\nnk&gt;tjwoolworth@...&lt;/A&gt;&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D&quot;BO=\r\nRDER-LEFT: rgb(16,16,255) 2px solid&quot;&gt;&lt;BR&gt;From: Tim Woolworth &lt;&lt;A href=3D=\r\n&quot;http://us.mc1807.mail.yahoo.com/mc/compose?to=3Dtjwoolworth@...&quot; rel=\r\n=3Dnofollow target=3D_blank&gt;tjwoolworth@...&lt;/A&gt;&gt;&lt;BR&gt;Subject: Re: [=\r\nEVP-ITC] Re: ok so im getting stuff on the spectergram&lt;BR&gt;To: &lt;A href=3D&quot;ht=\r\ntp://us.mc1807.mail.yahoo.com/mc/compose?to=3DEVP-ITC@yahoogroups.com&quot; rel=\r\n=3Dnofollow target=3D_blank&gt;EVP-ITC@yahoogroups.com&lt;/A&gt;&lt;BR&gt;Date: Saturday, =\r\nDecember 18, 2010, 4:57 PM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV&gt;\n&lt;DIV&gt;No,=\r\n I don&#39;t think I am being too critical, but I may have expectations that ar=\r\ne a little too high. &nbsp;I want to take my time with this. &nbsp;For my o=\r\nwn understanding, I need to have a large sample size so I know not only wha=\r\nt to expect to see, but what to look for. &nbsp;I have seen ITC snapshots f=\r\nrom programs like this that offer full faces. &nbsp;I would be more incline=\r\nd to believe in such an image as opposed to, lets say. two dark lines that =\r\nmay or may not be eyebrows. \n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;Even in your example of t=\r\nhe towel, you get half a face. &nbsp;If you have half a face (on the vertic=\r\nal plane, not the horizontal) you can extrapolate out what the entire face =\r\nwould look like. &nbsp;This is something I would like to get myself and I w=\r\nould consider that evidence if it showed up in one of these programs. &nbsp=\r\n;But, if you have something that looks like a forehead and that is all ther=\r\ne is, then it could also look like a rock or some other such object.&lt;/DIV&gt;\n=\r\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;I am certainly hoping for results worked into box sess=\r\nions. &nbsp;Directing a session with intent, like saying &quot;I am going to exa=\r\nmine the sound waves of this communication in hopes of seeing your face. &n=\r\nbsp;Is it possible you can show your face to me now through sound? &quot; is wha=\r\nt I am after. &nbsp;If a positive hit like this happens, then I will be jum=\r\nping for joy. &nbsp;Another good example would be a name, lets say Tom, tha=\r\nt occurs. &nbsp;If you get a positive affirmation that the name you heard i=\r\ns present, then you try the same technique only you address Tom by name and=\r\n get a face, that would be even better.&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;But, as =\r\nit stands now, the faces as they appear are random at best. &nbsp;I would b=\r\ne more inclined to believe that when these faces do occur , they are going =\r\nto occur with a lesser frequency than multiple images in a few seconds of a=\r\nudio like Ursula&#39;s example. &nbsp;If this where the case, there would be do=\r\nzens, and possibly hundreds, of faces during a ten minute session and I jus=\r\nt don&#39;t think that is possible. &nbsp;This is why I need to look at several=\r\n samples to find out if this is the case or not. &nbsp;If these partialized=\r\n faces occur in multiples all the time, I would be more apt to discount it.=\r\n &nbsp;But, if they are a rarity affixed to only a few clips out of dozens,=\r\n I would be more inclined to believe in them. &nbsp;Sample size is everythi=\r\nng. &nbsp;It is like listening to GBC. &nbsp;If you have never done a sessi=\r\non before, you would be inclined to believe every stray radio signal is a c=\r\nommunication. &nbsp;Only by continued practice\n (expanding your sample size=\r\n) can you start to rule out stray radio with any degree of accuracy. &nbsp;=\r\n&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;On the other hand, I am very new to this and I =\r\ncould certainly be wrong. &nbsp;I will continue to plug sound into the prog=\r\nrams and hope for the best. &nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;I really want=\r\n this to work. &nbsp;As you have probably experienced, when they want you t=\r\no hear something or know something, they make it very obvious while communi=\r\ncating. &nbsp;I am hoping they apply this same rigor to this new format to =\r\nshow us that they are there. &nbsp;If they can, then the world of video and=\r\n audio ITC will merge in one source and then the skeptics be damned!&lt;/DIV&gt;\n=\r\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;Tim&lt;BR&gt;&lt;BR&gt;\n&lt;DIV&gt;On Sat, Dec 18, 2010 at 2:24 PM, Fran=\r\nk Sumption &lt;SPAN dir=3Dltr&gt;&lt;&lt;A href=3D&quot;http://us.mc1807.mail.yahoo.com/m=\r\nc/compose?to=3Dpurplealiengirl@...&quot; rel=3Dnofollow target=3D_blank&gt;pu=\r\nrplealiengirl@...&lt;/A&gt;&gt;&lt;/SPAN&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORD=\r\nER-LEFT: #ccc 1px solid&quot;&gt;\n&lt;DIV style=3D&quot;BACKGROUND-COLOR: #fff&quot;&gt;&lt;SPAN&gt;&nbsp=\r\n;&lt;/SPAN&gt; \n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;I think it&#39;s unrealistic=\r\n to expect every file to have faces and images. These faces are often just =\r\nportions, eyes and lips, some have eye brows. Like all of this, not done fo=\r\nr proof, it&#39;s for emotional impact.&nbsp; I have this woman that shows up i=\r\nn towels, always just half the face. Perahps you are being too critical? As=\r\n with all spirit messages, it&#39;s what it means to the experiencer that matte=\r\nrs. Expecting full faces is like expecting the kings english and proper gra=\r\nmmer in all EVPs. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;F-S&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;\n&lt;DI=\r\nV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;On Sat, Dec 18, 2010 at 3:07 AM, Tim Woolworth &lt;SPAN di=\r\nr=3Dltr&gt;&lt;&lt;A href=3D&quot;http://us.mc1807.mail.yahoo.com/mc/compose?to=3Dtjwo=\r\nolworth@...&quot; rel=3Dnofollow target=3D_blank&gt;tjwoolworth@...&lt;/A&gt;=\r\n&gt;&lt;/SPAN&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: #ccc 1px solid&quot;&gt;\n&lt;=\r\nDIV style=3D&quot;BACKGROUND-COLOR: #fff&quot;&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;=\r\n\n&lt;DIV&gt;I saw a couple which could be construed as images in the one series y=\r\nou had from SEA, but nothing that knocked me over the head yet. &nbsp;I am =\r\ngoing to have to see a larger sample size before I determine if what you ha=\r\nve witnessed is in fact a form or not. &nbsp;I cannot accept an image as pa=\r\nranormal without knowing where it sits among the bulk of audio files. &nbsp=\r\n;If every file has multiple faces, the I would have &nbsp;to say that there=\r\n is nothing there. &lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;So, I will certainly keep te=\r\nsting with my copy and hopefully something will really pop for me. &nbsp;I =\r\nhave run through about ten files (EVP and GBC) so far for intensive study a=\r\nnd I still haven&#39;t got anything that I would consider a positive hit. &nbsp=\r\n;I need an actual formed face, not portions thereof, to consider an image r=\r\neal. &nbsp;This is the only way to discount visual matrixing.&lt;/DIV&gt;\n&lt;DIV&gt;&lt;B=\r\nR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;I have high hopes for this though!&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV=\r\n&gt;Tim \n&lt;DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;DIV&gt;On Sat, Dec 18, 2010 at 5:01 AM,=\r\n Ursula Kalin &lt;SPAN dir=3Dltr&gt;&lt;&lt;A href=3D&quot;http://us.mc1807.mail.yahoo.co=\r\nm/mc/compose?to=3Dkalinu@...&quot; rel=3Dnofollow target=3D_blank&gt;kali=\r\nnu@...&lt;/A&gt;&gt;&lt;/SPAN&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT=\r\n: #ccc 1px solid&quot;&gt;\n&lt;DIV style=3D&quot;BACKGROUND-COLOR: #fff&quot;&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN=\r\n&gt; \n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;TABLE border=3D0 cellSpacing=3D0 cellPadd=\r\ning=3D0&gt;\n&lt;TBODY&gt;\n&lt;TR&gt;\n&lt;TD vAlign=3Dtop&gt;Tim did you see my images???&lt;BR&gt;&lt;BR&gt;=\r\n--- On &lt;B&gt;Sat, 12/18/10, Tim Woolworth &lt;I&gt;&lt;&lt;A href=3D&quot;http://us.mc1807.m=\r\nail.yahoo.com/mc/compose?to=3Dtjwoolworth@...&quot; rel=3Dnofollow target=\r\n=3D_blank&gt;tjwoolworth@...&lt;/A&gt;&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE styl=\r\ne=3D&quot;BORDER-LEFT: rgb(16,16,255) 2px solid&quot;&gt;&lt;BR&gt;From: Tim Woolworth &lt;&lt;A =\r\nhref=3D&quot;http://us.mc1807.mail.yahoo.com/mc/compose?to=3Dtjwoolworth@gmail.c=\r\nom&quot; rel=3Dnofollow target=3D_blank&gt;tjwoolworth@...&lt;/A&gt;&gt; \n&lt;DIV&gt;&lt;BR&gt;=\r\nSubject: Re: [&lt;SPAN&gt;EVP&lt;/SPAN&gt;-ITC] Re: ok so im getting stuff on the spect=\r\nergram&lt;BR&gt;To: &lt;A href=3D&quot;http://us.mc1807.mail.yahoo.com/mc/compose?to=3DEV=\r\nP-ITC@yahoogroups.com&quot; rel=3Dnofollow target=3D_blank&gt;EVP-ITC@yahoogroups.c=\r\nom&lt;/A&gt;&lt;BR&gt;&lt;/DIV&gt;Date: Saturday, December 18, 2010, 3:26 AM \n&lt;DIV&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;=\r\nDIV&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV&gt;\n&lt;DIV&gt;I have Audition as my editor. &nbsp;I a=\r\nm going to have to try it out. &nbsp;Thanks Bill. \n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;Tim=\r\n&lt;BR&gt;&lt;BR&gt;\n&lt;DIV&gt;On Sat, Dec 18, 2010 at 1:00 AM, psi_research &lt;SPAN dir=3Dltr=\r\n&gt;&lt;&lt;A href=3D&quot;http://us.mc1807.mail.yahoo.com/mc/compose?to=3Dvilhellm@sb=\r\ncglobal.net&quot; rel=3Dnofollow target=3D_blank&gt;vilhellm@...&lt;/A&gt;&gt;&lt;=\r\n/SPAN&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: #ccc 1px solid&quot;&gt;\n&lt;DIV s=\r\ntyle=3D&quot;BACKGROUND-COLOR: #fff&quot;&gt;&lt;SPAN&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV=\r\n&gt;I&#39;ve seen live webcast of ITC sessions where GB output is fed directly int=\r\no the mic line in on a computer running Adobe Audition with the spectragrap=\r\nh running. It was really compelling to see letters and numbers, not images =\r\nor pictures, but partial words appear in the graph. At first it was I thoug=\r\nht it was a software glitch but it is a repeatable event. It was on LiveSci=\r\nFi which is run by Tim Wood, he also thought there was some kind of code er=\r\nror but it happened on more than one webcast. &lt;BR&gt;&lt;BR&gt;So if anyone has Audi=\r\ntion, just feed Box output right in your computer and see what happens. I w=\r\nanted to try it tonight but I have Audacity and the spectragraph feature do=\r\nesn&#39;t have that shaded appearance that Audition does so it&#39;s not able to re=\r\nnder images or characters, at least as far as I see using the various setti=\r\nngs.&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=3D&quot;http://us.mc1807.mail.yahoo.com/m=\r\nc/compose?to=3DEVP-ITC%40yahoogroups.com&quot; rel=3Dnofollow target=3D_blank&gt;EV=\r\nP-ITC@yahoogroups.com&lt;/A&gt;, Tim Woolworth &lt;tjwoolworth@...&gt; wrote:&lt;BR&gt;=\r\n&gt;&lt;BR&gt;&gt; I have tried numerous EVP files and short box clips and so far=\r\n&lt;BR&gt;&gt; nothing discernible has appeared on either program. I still have a=\r\n lot of&lt;BR&gt;&gt; hope though.&lt;BR&gt;&gt; &lt;BR&gt;&gt; I don&#39;t know about you guys, =\r\nbut I am going to try to work this in to a&lt;BR&gt;&gt; session tonight!&lt;BR&gt;&gt;=\r\n &lt;BR&gt;&gt; Tim&lt;BR&gt;&gt; &lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&gt; On Fri, Dec 17, 2010 at 4:23 PM,=\r\n Ursula &lt;kalinu@...&gt; wrote:&lt;BR&gt;&gt; &lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt=\r\n; &gt; But I don&#39;t know how to save the image ugh...what if i just want one=\r\n part&lt;BR&gt;&gt; &gt; of it..Im soo lost here..and excited at the same time LO=\r\nL&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;=\r\n&lt;/DIV&gt;\n&lt;DIV style=3D&quot;COLOR: #fff&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DI=\r\nV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/TD&gt;&lt;/TR&gt;&lt;/TBODY&gt;&lt;/TABLE&gt;=\r\n\n&lt;DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV style=3D&quot;COLOR: #fff&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLO=\r\nCKQUOTE&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV sty=\r\nle=3D&quot;COLOR: #fff&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/D=\r\nIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV style=3D&quot;COLOR: #fff&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/=\r\nBLOCKQUOTE&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/TD&gt;=\r\n&lt;/TR&gt;&lt;/TBODY&gt;&lt;/TABLE&gt;\n&lt;DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV style=3D&quot;COLOR: #fff&quot;&gt;&lt;/DIV&gt;&lt;/=\r\nDIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;=\r\n&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV style=3D&quot;COLOR: #fff&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOT=\r\nE&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV style=3D&quot;COLOR: #fff&quot;&gt;&lt;/DIV=\r\n&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;/D=\r\nIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV style=3D&quot;COLOR: #fff&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/=\r\nDIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;=\r\n/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/TD&gt;&lt;/TR&gt;&lt;/TBODY&gt;&lt;/TABLE&gt;\n&lt;DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n=\r\n&lt;DIV style=3D&quot;COLOR: #fff&quot;&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;=\r\n/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;\r\n--0-610691509-1292808782=:92295--"}