{"id": "19697", "subject": "Re: [EVP-ITC] Re: A bit of validation", "author": "Frank Sumption", "timestamp": "2010-12-21T20:22:37Z", "full_text": "Most of what I seem to know I did not learn here. Maybe that&#39;s what I mean.\nIf one thinks they just know, that might be considered ignorant.\n\nF-S\n\nOn Tue, Dec 21, 2010 at 1:15 PM, Mvanah Maloti &lt;inyanga4@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;   *Hey, hey, hey!*\n&gt;\n&gt; I don&#39;t think you&#39;re ignorant at all, Frank. Don&#39;t say those things.  ;)\n&gt;\n&gt; Not that it matters, but you&#39;re not in any danger of pissing me off with\n&gt; this stuff. I love what you have to say about these things, I enjoy the\n&gt; dialogue immensely and I listen closely when you speak. I think you have a\n&gt; very good, solid grasp when it comes to the boxes and who/what we&#39;re\n&gt; communicating with, what&#39;s likely to be going on here and what their\n&gt; abilities and limitations may be. I come here to learn from you (and\n&gt; others) and to consider all of the angles in my attempt to further my own\n&gt; experience and understanding about this stuff.\n&gt;\n&gt; At the end of the day, my guess is *NOT* as good as yours is, Frank. At\n&gt; least not at this point.\n&gt;\n&gt; You&#39;re probably right about the ET&#39;s and I like to think in terms of levels\n&gt; and layers as well. For the most part I think the boxes are tuning into a\n&gt; very close spiritual level/layer/dimension and that SOME (&quot;some&quot;) of it\n&gt; turns out to be astral junk and low-level entities maquerading as something\n&gt; they&#39;re not.\n&gt;\n&gt; (Come to think of it, maybe it&#39;s *not* so different over there, lol!).\n&gt;\n&gt; That said, I know we can &quot;tune into&quot; and access all sorts of\n&gt; these dimensions and levels of consciousness and the intelligent beings that\n&gt; reside there with our sweeping radios. I think we&#39;ve both had the experience\n&gt; of speaking to loved ones who crossed over as well as ET&#39;s, angels, spirit\n&gt; guides and even plants, animals, the mineral kingdom and LIVING PEOPLE at\n&gt; times too. I&#39;m sure others have had these kinds of sessions as well and I\n&gt; love hearing about our different experiences and thoughts on the subject.\n&gt;\n&gt; Part of my own work and meditations with the boxes reflect my own repeated\n&gt; attempts to reach a higher level of intelligent being, a finer-faster energy\n&gt; and more refined consciousness during my sessions and recordings. I\n&gt; recognize it immediately when one of the &quot;dark dorks&quot; or low-level beings\n&gt; creeps through...for me it&#39;s still very much a &quot;hit or miss&quot; kinda deal and\n&gt; I&#39;m learning more all the time regarding how to increase my positive results\n&gt; and consistency of good information coming through the boxes.\n&gt;\n&gt; I&#39;ve had several strong experiences with the boxes and messages that\n&gt; may indicate or hint at something about to happen and then it did, but for\n&gt; me it&#39;s usually a few days or even a few weeks off (though there have been\n&gt; cases when what they said would happen DID happen almost immediately - the\n&gt; plane crash I spoke about a few weeks ago was one of them).\n&gt;\n&gt; It&#39;s really hard for me to say much more than *&quot;I don&#39;t know&quot;* at this\n&gt; point, which is why I take what you and the other members share here and\n&gt; consider it along with everything else. It&#39;s very helpful and I appreciate\n&gt; what you have to say, Frank.\n&gt;\n&gt; I totally agree with you in that I also feel like ET&#39;s being such *H*ighly\n&gt; *E*volved *B*eings (or &quot;HEB&#39;s&quot; as I like to call them) are more likely to\n&gt; have a better grasp on the whole time-space issue as we know and experience\n&gt; it while living on this planet.\n&gt;\n&gt; There have been sessions when I&#39;ve asked the discarnate voices how long ago\n&gt; they passed or how old they are/were or what day it is &quot;over there&quot; and many\n&gt; times they seem unable to answer, hesitant at times, confused at others and\n&gt; often completely un-aware (or possibly just un-interested) when it comes to\n&gt; questions about their sense of time and how they experience and comprehend\n&gt; such a thing.\n&gt;\n&gt; For the most part I&#39;ve quit asking questions altogether and use my time\n&gt; with the boxes to just listen for whatever they feel like addressing during\n&gt; the session and recording.\n&gt;\n&gt; Thanks for that!  :) :) :)\n&gt;\n&gt; I&#39;ll end by saying I find these conversations of great value and importance\n&gt; and I learn something new from you and the other members here every single\n&gt; day. It&#39;s all great food for thought and exactly the type of dialogue that\n&gt; needs to take place if we&#39;re ever going to get closer to the truth and a\n&gt; real understanding of what&#39;s going on here.\n&gt;\n&gt; I appreciate ya.\n&gt;\n&gt; Grateful,\n&gt; Jerome\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; --- On *Tue, 12/21/10, Frank Sumption &lt;purplealiengirl@...&gt;* wrote:\n&gt;\n&gt;\n&gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt; Subject: Re: [EVP-ITC] Re: A bit of validation\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Tuesday, December 21, 2010, 11:53 AM\n&gt;\n&gt;\n&gt;\n&gt;   I don&#39;t know, maybe it&#39;s just the different level that come through. I\n&gt; don&#39;t want to like lay down what&#39;s what, or try to be an authority. I don&#39;t\n&gt; know how this stuyff works, and I&#39;ve pissed off enough people iun the\n&gt; process.\n&gt;\n&gt;  My guys know what I&#39;ll see and hear in the near future, and often feed it\n&gt; to me ahaed of time, sometimes seconds, sometimes day and hours, just to\n&gt; show. So everything I say is just my own expereince. Maybe ET has broader\n&gt; vision? They *seem* to quite aware of what time it is, and how much is\n&gt; left.\n&gt;\n&gt;  Ya have to keep in mind, I&#39;m not educated, and not well traveled\n&gt; that===ignorance.\n&gt;\n&gt;  F-S\n&gt;\n&gt; On Tue, Dec 21, 2010 at 9:27 AM, Mvanah Maloti &lt;inyanga4@...&lt;http://us.mc1110.mail.yahoo.com/mc/compose?to=inyanga4@...&gt;\n&gt; &gt; wrote:\n&gt;\n&gt;\n&gt;     Perhaps so, and I would certainly like to believe that, but it hasn&#39;t\n&gt; been my experience so far. That said, I&#39;ve still got a long ways to go and I\n&gt; respect that you&#39;ve been at this for a lot longer than I have, Frank.\n&gt;\n&gt; For me their timelines are usually a bit skeewompous, doesn&#39;t mean that&#39;s\n&gt; the way it is for all of them necessarily. Like I said, I dunno, but I&#39;m\n&gt; trying to find out.  ;)\n&gt;\n&gt; Best,\n&gt; J\n&gt;\n&gt;\n&gt;\n&gt; --- On *Tue, 12/21/10, Frank Sumption &lt;purplealiengirl@gmail.com&lt;http://us.mc1110.mail.yahoo.com/mc/compose?to=purplealiengirl@gmail.com&gt;\n&gt; &gt;* wrote:\n&gt;\n&gt;\n&gt; From: Frank Sumption &lt;purplealiengirl@...&lt;http://us.mc1110.mail.yahoo.com/mc/compose?to=purplealiengirl@...&gt;\n&gt; &gt;\n&gt; Subject: Re: [EVP-ITC] Re: A bit of validation\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com&lt;http://us.mc1110.mail.yahoo.com/mc/compose?to=EVP-ITC@yahoogroups.com&gt;\n&gt; Date: Tuesday, December 21, 2010, 12:52 AM\n&gt;\n&gt;\n&gt;\n&gt;   I think those on the otherside are very much aware of time, who when and\n&gt; what they are communicating with here.\n&gt;\n&gt;\n&gt; F-S\n&gt; On Mon, Dec 20, 2010 at 5:01 PM, Mvanah Maloti &lt;inyanga4@...&lt;http://us.mc1110.mail.yahoo.com/mc/compose?to=inyanga4@...&gt;\n&gt; &gt; wrote:\n&gt;\n&gt;\n&gt;     Just my two cents and input based on what I get from my ancestral\n&gt; guides and guardians...\n&gt;\n&gt; The spiritual dimension and those who reside there do not perceive &quot;time&quot;\n&gt; as we do in the typical linear fashion. Remember the saying, *&quot;In the\n&gt; twinkling of an eye?&quot;*\n&gt;\n&gt; 10,000 years here may only seem like a few precious moments over there, and\n&gt; vice versa.\n&gt;\n&gt; They also remind me of the quantum field, string theory, our holographic\n&gt; Universe (etc) and that *ALL time is &quot;ticking&quot;* (past, present & future)\n&gt; at the very same moment. It&#39;s all happening RIGHT NOW in various levels,\n&gt; layers, alternative realities and spiritual/energetic dimensions.\n&gt;\n&gt; The end of the Earth has already happened (for them and us!) in many ways.\n&gt; Depending on who you&#39;re speaking to, some even describe *what it was like*when the planet Earth was destroyed, speaking as though it has/had already\n&gt; occured. There would also be dimensions in which this event has already\n&gt; occured thousands of years ago, 5 minutes ago, 3 days from now and 10,000\n&gt; years into the future and every other possible scenario.\n&gt;\n&gt; So which one is the RIGHT one then?\n&gt;\n&gt; Well, I think they all are.\n&gt;\n&gt; Because &quot;they&quot; live in a world of &quot;source energy&quot;, light, consciousness and\n&gt; perfect information fields...one that&#39;s so completely and totally different\n&gt; to our own experience here/now and are not limited by linear time and\n&gt; local/non-local space or relativity like we are, it&#39;s likely very difficult\n&gt; for most of the beings we would speak to through the box to give us specific\n&gt; information regarding such an event or the exact time (or even &quot;which Earth&quot;\n&gt; they are referencing, dimensionally speaking!).\n&gt;\n&gt; In other words, they don&#39;t experience any of this stuff (and\n&gt; especially &quot;time&quot;) like we do.\n&gt;\n&gt; To end, for several years now I&#39;ve been a devoted care-giver to the ancient\n&gt; quartz crystal skulls of Mayan legend and much of the mythologies and\n&gt; folklore surrounding these objects is focused around 2012 and the\n&gt; impending Great Shift. I&#39;ve also studied South American culture (past and\n&gt; present), anthropology, folklore and tribal customs along with their\n&gt; indigenous wisdom systems in varying depth with the Kogi Indians, Quechua\n&gt; Curanderos and residents of the Amazon.\n&gt;\n&gt; For many years I followed the work of Terence McKenna rather closely and\n&gt; Terence is someone I consider a man-genius far ahead of his time (may he\n&gt; rest in peace). He developed a time-mapping system based on the I-Ching, the\n&gt; Mayan Calendar, Great Pyramids, DMT-beings, fractals, plant\n&gt; consciousness and other mathematic systems that showed a sharp spike\n&gt; followed by a near-perfect &quot;dip&quot; before it went off the charts and moved\n&gt; into &quot;nothingness&quot; completely around December 21st, 2012...and even Terence\n&gt; didn&#39;t think this is when the world would end, necessarily.\n&gt;\n&gt; (His &quot;official&quot; position is that he simply didn&#39;t know what to make of it\n&gt; or expect. One theory is that his algorithms reflected such a change during\n&gt; a time that humanity may have finally broken the time/space barrier and\n&gt; uncovered the keys to time travel and 4th dimensional plane-shifting, to\n&gt; name just one possible solution.).\n&gt;\n&gt; I&#39;ve also been fortunate enough to live in Swaziland, South Africa with the\n&gt; Swazi, Zulu, Xhosa and San Bushmen tribes who (like most other cultures\n&gt; throughout time and history) also have their own teachings and mystery\n&gt; traditions surrounding\n&gt; this and other events.\n&gt;\n&gt; Given that the San are the most ancient tribal peoples and humanities\n&gt; oldest ancestors still living in the world today and whose incredible\n&gt; healing knowledge, spiritual wisdoms and mystical practices far exceed any\n&gt; I&#39;ve ever heard of or personally witnessed anywhere else in the world and\n&gt; they don&#39;t seem to feel that life on this planet is going to end anytime\n&gt; soon, so I&#39;m not going to panic just yet.\n&gt;\n&gt; These amazing people have their ears pressed up very closely to the\n&gt; heartbeat and rhythms of Mother Earth and told me firsthand that before the\n&gt; end comes certain events will take place on a scale the whole world will be\n&gt; instantly made aware of...events that could still take several hundred or\n&gt; even thousands of years to unfold.\n&gt;\n&gt; All I know for my own self, personally, is that I have no clue what&#39;s going\n&gt; to happen...but it will be okay, no matter what takes place. There are worst\n&gt; things than dying, believe me...and part of what makes our work with the\n&gt; Ghost Box and ITC in general so helpful and inspiring is that we can find a\n&gt; level of peace and comfort through our sessions and recordings we might\n&gt; actually need one day, whether soon or in some distant time - we&#39;re all\n&gt; going to end up there eventually, no doubt about it!\n&gt;\n&gt; *FINAL NOTE:* I don&#39;t have all the answers...I don&#39;t even have all the\n&gt; questions, and I know it. My guess is as good as any and I could be\n&gt; completely and totally WRONG about all of this (I&#39;m open to that and I&#39;m\n&gt; perfectly fine with it). Believe you me, if the world ends when a lot\n&gt; of folks think it might I&#39;ll be just as surprised as anyone. Until then I&#39;ll\n&gt; keep doing what I do now; realizing that I don&#39;t know a damn thing, taking\n&gt; life as it comes to me day by precious day, treating it with respect and\n&gt; honoring my experience here as the gift it is, loving others, being good to\n&gt; the people around me and enjoying my family and time spent here while I can.\n&gt;\n&gt;\n&gt; And I won&#39;t be afraid...not even for one second or when I&#39;m looking up and\n&gt; seeing that big f***ing rock heading right towards us, hahaha. For all I\n&gt; know (or anyone here for that matter), I could be blindsided by a Mac truck\n&gt; later this evening!\n&gt;\n&gt; Many of the people worried over 2012 won&#39;t even be here when 2012\n&gt; arrives...now how&#39;s THAT for a mind-f**k!?!?\n&gt;\n&gt; ;)\n&gt;\n&gt; -J\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; --- On *Mon, 12/20/10, Urkel23 &lt;urkel23@...&lt;http://us.mc1110.mail.yahoo.com/mc/compose?to=urkel23@...&gt;\n&gt; &gt;* wrote:\n&gt;\n&gt;\n&gt; From: Urkel23 &lt;urkel23@...&lt;http://us.mc1110.mail.yahoo.com/mc/compose?to=urkel23@...&gt;\n&gt; &gt;\n&gt; Subject: [EVP-ITC] Re: A bit of validation\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com&lt;http://us.mc1110.mail.yahoo.com/mc/compose?to=EVP-ITC@yahoogroups.com&gt;\n&gt; Date: Monday, December 20, 2010, 4:10 PM\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Frank,\n&gt;\n&gt; Remember last year when we both got the August predictions? That didn&#39;t pan\n&gt; out, so i wouldn&#39;t take what they say too seriously. They have never said\n&gt; anything that came true yet, i don&#39;t think they can.\n&gt;\n&gt; I&#39;m pretty sure that they can&#39;t tell the future, so when they say stuff i\n&gt; think they are just messing with us to see what we do with the information.\n&gt; They might even be laughing at us !\n&gt;\n&gt; -Steve\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com&lt;http://us.mc1110.mail.yahoo.com/mc/compose?to=EVP-ITC%40yahoogroups.com&gt;,\n&gt; Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Yeah, &quot;they&quot; do seem to imply that, as soon as October of next year, but\n&gt; &gt; they won&#39;t answer questions for me.\n&gt; &gt;\n&gt; &gt; F-S\n&gt; &gt;\n&gt; &gt; On Mon, Dec 20, 2010 at 11:37 AM, &lt;SnowfireL@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; It may be sooner, Frank. sf\n&gt; &gt; &gt;\n&gt; &gt; &gt; In a message dated 12/20/2010 1:42:40 A.M. Eastern Standard Time,\n&gt; &gt; &gt; kalinu@... writes:\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; what!!!\n&gt; &gt; &gt;\n&gt; &gt; &gt; --- On *Mon, 12/20/10, Frank Sumption &lt;purplealiengirl@...&gt;* wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt; &gt; &gt; Subject: Re: [EVP-ITC] A bit of validation\n&gt; &gt; &gt; To: EVP-ITC@yahoogroups.com&lt;http://us.mc1110.mail.yahoo.com/mc/compose?to=EVP-ITC%40yahoogroups.com&gt;\n&gt; &gt; &gt; Date: Monday, December 20, 2010, 12:10 AM\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; Plenty of time, all of two years!\n&gt; &gt; &gt;\n&gt; &gt; &gt; F-S\n&gt; &gt; &gt;\n&gt; &gt; &gt; On Sun, Dec 19, 2010 at 11:08 PM, Ursula Kalin &lt;kalinu@...&lt;\n&gt; http://us.mc1807.mail.yahoo.com/mc/compose?to=kalinu@...&gt;\n&gt; &gt; &gt; &gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; yeah you can hear it...I just hope its not to much in the near\n&gt; &gt; &gt; future..please I still have tons of stuff to do\n&gt; &gt; &gt;\n&gt; &gt; &gt; --- On *Mon, 12/20/10, Frank Sumption &lt;purplealiengirl@...&lt;\n&gt; http://us.mc1807.mail.yahoo.com/mc/compose?to=purplealiengirl@...&gt;\n&gt; &gt; &gt; &gt;* wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; From: Frank Sumption &lt;purplealiengirl@...&lt;\n&gt; http://us.mc1807.mail.yahoo.com/mc/compose?to=purplealiengirl@...&gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; Subject: [EVP-ITC] A bit of validation [1 Attachment]\n&gt; &gt; &gt; To: EVP-ITC@yahoogroups.com&lt;http://us.mc1110.mail.yahoo.com/mc/compose?to=EVP-ITC%40yahoogroups.com&gt;\n&gt; &lt;http://us.mc1807.mail.yahoo.com/mc/compose?to=EVP-ITC@yahoogroups.com&gt;,\n&gt; &gt; &gt; RTSC@yahoogroups.com&lt;http://us.mc1110.mail.yahoo.com/mc/compose?to=RTSC%40yahoogroups.com&gt;\n&gt; &lt;http://us.mc1807.mail.yahoo.com/mc/compose?to=RTSC@yahoogroups.com&gt;\n&gt; &gt; &gt; Date: Monday, December 20, 2010, 12:06 AM\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; Might be hard to hear, but loud. This is from Sandra Belanger, a long\n&gt; &gt; &gt; time EVP researcher. Posted with her permission.\n&gt; &gt; &gt;\n&gt; &gt; &gt; F-S\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;\n&gt;\n&gt; \n&gt;\n\nMos o wha I seem o know I did no lea n he e. Maybe ha 's wha I mean. I one hinks hey jus know, ha migh be conside ed igno an . \n \nF-S\nOn Tue, Dec 21, 2010 a 1:15 PM, M anah Malo i inyanga4@...> w o e:\n\n  \n\n\n\n\n\n\n\n\nHey, hey, hey!\n \nI don' hink you' e igno an a all, F ank. Don' say hose hings.  ;)\n \nNo ha i ma e s, bu you' e no in any dange o pissing me o wi h his s u . I lo e wha you ha e o say abou hese hings, I enjoy he dialogue immensely and I lis en closely when you speak. I hink you ha e a e y good, solid g asp when i comes o he boxes and who/wha we' e communica ing wi h, wha 's likely o be going on he e and wha hei abili ies and limi a ions may be. I come he e o lea n om you (and o he s) and o conside all o he angles in my a emp o u he my own expe ience and unde s anding abou his s u . \n\n \nA he end o he day, my guess is NOT as good as you s is, F ank. A leas no a his poin . \n \nYou' e p obably igh abou he ET's and I like o hink in e ms o le els and laye s as well. Fo he mos pa I hink he boxes a e uning in o a e y close spi i ual le el/laye /dimension and ha  SOME (\"some\") o i u ns ou o be as al junk and low-le el en i ies maque ading as some hing hey' e no . \n\n \n(Come o hink o i , maybe i 's no so di e en o e he e, lol!). \n \nTha said, I know we can \" une in o\" and access all so s o hese dimensions and le els o consciousness and he in elligen beings ha eside he e wi h ou  sweeping adios. I hink we' e bo h had he expe ience o speaking o lo ed ones who c ossed o e as well as ET's, angels, spi i guides and e en plan s, animals, he mine al kingdom and LIVING PEOPLE a imes oo. I'm su e o he s ha e had  hese kinds o sessions as well and I lo e hea ing abou ou di e en expe iences and hough s on he subjec . \n\n \nPa o my own wo k and medi a ions wi h he boxes  e lec my own  epea ed a emp s o each a highe le el o in elligen being, a ine - as e ene gy and mo e e ined consciousness du ing my sessions and eco dings. I ecognize i immedia ely when one o he \"da k do ks\" o low-le el beings c eeps h ough... o me i 's s ill e y much a \"hi o miss\" kinda deal and I'm lea ning mo e all he ime ega ding how  o inc ease my posi i e esul s and consis ency o good in o ma ion coming h ough he boxes.  \n\n \nI' e had se e al s ong expe iences wi h he boxes and messages ha may indica e o hin a  some hing abou o happen and hen i did, bu o me i 's usually a ew days o e en a ew weeks o ( hough he e ha e been cases when wha hey said would happen DID happen almos immedia ely - he plane c ash I spoke abou a ew weeks ago was one o hem).  \n\n \nI 's eally ha d o me  o say much mo e han \"I don' know\" a his poin , which is why I ake wha you and he o he membe s sha e he e and conside i along wi h e e y hing else. I 's e y help ul and I app ecia e wha you ha e o say, F ank. \n\n \nI o ally ag ee wi h you in ha I also  eel like ET's being such Highly E ol ed Beings (o \"HEB's\" as I like o call hem) a e mo e likely o ha e a be e g asp on he whole ime-space issue as we know and expe ience i while li ing on his plane . \n\n \nThe e ha e been sessions when I' e asked he disca na e  oices how long ago hey passed o how old hey a e/we e o wha day i is \"o e he e\" and many imes  hey seem unable o answe , hesi an a imes, con used a  o he s and o en comple ely un-awa e (o possibly jus  un-in e es ed) when i comes o ques ions abou hei sense o ime and how hey expe ience and comp ehend such a hing.\n\n \nFo he mos pa I' e qui asking ques ions al oge he and use my ime wi h he boxes o jus lis en o wha e e hey eel like add essing du ing he session and eco ding. \n \nThanks o ha !  :) :) :) \n \nI'll end by saying I ind hese con e sa ions o g ea alue and impo ance and I lea n some hing new om you and he o he membe s he e e e y single day. I 's all g ea ood o hough and exac ly he ype o dialogue ha needs o ake place i we' e e e going o ge close o he u h and a eal unde s anding o wha 's going on he e. \n\n \nI app ecia e ya. \n \nG a e ul, \nJe ome\n\n \n \n \n \n--- On Tue, 12/21/10, F ank Sump ion pu plealiengi l@...> w o e:\n\nF om: F ank Sump ion pu plealiengi l@gmail.com>Subjec : Re: [EVP-ITC] Re: A bi o alida ionTo: EVP-ITC@yahoog oups.com\nDa e: Tuesday, Decembe 21, 2010, 11:53 AM \n\n\n\n  \n\n\n I don' know, maybe i 's jus he di e en le el ha come h ough. I don' wan o like lay down wha 's wha , o y o be an au ho i y. I don' know how his s uy wo ks, and I' e pissed o enough people iun he p ocess. \n\n \n My guys know wha I'll see and hea in he nea u u e, and o en eed i o me ahaed o ime, some imes seconds, some imes day and hou s, jus   o show. So e e y hing I say is jus my own expe eince. Maybe ET has b oade ision? They seem o qui e awa e o wha ime i is, and how much is le . \n\n \n Ya ha e o keep in mind, I'm no educa ed, and no well a eled ha ===igno ance. \n \n F-S\nOn Tue, Dec 21, 2010 a 9:27 AM, M anah Malo i inyanga4@...> w o e:\n\n\n  \n\n\n\n\n\n\n\n\nPe haps so, and I would ce ainly like o belie e ha , bu i hasn' been my expe ience so a . Tha said, I' e s ill go a long ways o go and I espec ha you' e been a his o a lo longe han I ha e, F ank. \n\n \nFo me hei imelines a e usually a bi skeewompous, doesn' mean ha 's he way i is o all o   hem necessa ily. Like I said, I dunno, bu I'm ying o ind ou .  ;)\n \nBes , \nJ\n \n--- On Tue, 12/21/10, F ank Sump ion pu plealiengi l@...> w o e:\n\nF om: F ank Sump ion pu plealiengi l@...>\nSubjec : Re: [EVP-ITC] Re: A bi o alida ion \nTo: EVP-ITC@yahoog oups.comDa e: Tuesday, Decembe 21, 2010, 12:52 AM \n\n\n\n  \n\n\n I hink hose on he o he side a e e y much awa e o ime, who when and wha hey a e communica ing wi h he e. \n \n \nF-S\nOn Mon, Dec 20, 2010 a 5:01 PM, M anah Malo i inyanga4@...> w o e:\n\n\n  \n\n\n\n\n\n\n\n\nJus my wo cen s and inpu based on wha I ge om my ances al guides and gua dians...\n \nThe spi i ual dimension and hose who eside he e do no  pe cei e \" ime\" as we do in  he ypical linea ashion. Remembe he saying, \"In he winkling o an eye?\"\n \n10,000 yea s he e may only seem like a ew p ecious momen s o e   he e, and ice e sa. \n \nThey also emind me o he quan um ield, s ing heo y, ou  holog aphic Uni e se (e c) and ha ALL ime is \" icking\" (pas , p esen  & u u e) a he e y same momen . I 's all happening RIGHT NOW in a ious le els, laye s, al e na i e eali ies and spi i ual/ene ge ic dimensions.\n\n \nThe end o he Ea h has al eady happened ( o hem and us!) in many ways. Depending on who you' e speaking  o, some e en desc ibe wha i was like when  he plane Ea h was des oyed, speaking as hough i has/had al eady occu ed. The e would also be dimensions in which his e en has al eady occu ed housands o yea s ago, 5 minu es ago, 3 days om now and 10,000 yea s in o he u u e and e e y o he possible scena io. \n\n \nSo which one is he RIGHT one hen? \n \nWell, I hink hey all a e. \n \nBecause \" hey\" li e in a wo ld o \"sou ce ene gy\", ligh , consciousness and pe ec  in o ma ion ields...one ha 's so comple ely and o ally di e en o ou own expe ience he e/now and a e no limi ed by linea ime and local/non-local space o ela i i y like we a e, i 's likely e y di icul o mos o he beings we would speak o h ough he box o gi e us speci ic in o ma ion ega ding such an e en o he exac ime (o e en \"which Ea h\" hey a e e e encing, dimensionally speaking!). \n\n \nIn o he wo ds, hey don' expe ience any o his s u (and especially \" ime\") like we do.  \n \nTo end,  o se e al yea s now I' e been a de o ed ca e-gi e o he ancien qua z c ys al skulls o Mayan legend and much o he my hologies and olklo e su ounding hese objec s is ocused a ound 2012 and he impending G ea Shi . I' e also s udied Sou h Ame ican cul u e (pas and p esen ), an h opology,  olklo e and ibal cus oms along wi h  hei indigenous wisdom sys ems in  a ying dep h wi h he Kogi Indians, Quechua Cu ande os and esiden s o he Amazon. \n\n \nFo many yea s I ollowed he wo k o Te ence McKenna  a he closely and Te ence is someone I conside a man-genius a ahead o his ime (may he es in peace). He de eloped a ime-mapping sys em based on he I-Ching, he Mayan Calenda , G ea Py amids, DMT-beings, ac als, plan consciousness and o he ma hema ic sys ems  ha showed a sha p spike ollowed by a nea -pe ec \"dip\" be o e i wen o he cha s and mo ed in o \"no hingness\" comple ely a ound Decembe 21s , 2012...and e en Te ence didn' hink his is when he wo ld would end, necessa ily. \n\n \n(His \"o icial\" posi ion is ha he simply didn' know wha o make o i o expec . One heo y is ha his algo i hms e lec ed such a change du ing a ime  ha humani y may ha e inally b oken he ime/space ba ie and unco e ed he keys o ime a el and 4 h dimensional plane-shi ing, o name jus one possible solu ion.).  \n\n \nI' e also been o una e enough o li e in Swaziland, Sou h A ica wi h he Swazi, Zulu, Xhosa and San Bushmen ibes who (like mos o he cul u es h oughou ime and his o y) also ha e hei own eachings and mys e y adi ions su ounding\n his and o he e en s. \n \nGi en ha he San a e he mos ancien ibal peoples and humani ies oldes ances o s s ill li ing in he wo ld oday and whose inc edible healing knowledge, spi i ual wisdoms and mys ical p ac ices a exceed any I' e e e hea d o o pe sonally wi nessed anywhe e else in he wo ld and hey don' seem o eel ha li e on his plane  is going o end any ime soon, so I'm no going o panic jus ye . \n\n \nThese amazing people ha e hei ea s p essed up e y closely o he hea bea and hy hms o Mo he Ea h and old me i s hand ha be o e he end comes ce ain e en s will ake place on a scale he whole wo ld will be ins an ly made awa e o ...e en s ha could s ill ake se e al hund ed o e en housands o yea s o un old.\n\n \nAll I know o my own sel , pe sonally, is ha I ha e no clue wha 's going o happen...bu i will be okay, no ma e wha akes place. The e a e wo s hings han dying, belie e me...and pa o wha makes ou wo k wi h he Ghos Box and ITC in gene al so help ul and inspi ing is ha we can ind a le el o peace and com o h ough ou sessions and eco dings we migh ac ually need one day, whe he soon o in some dis an ime - we' e all going o end up he e e en ually, no doub abou i ! \n\n \nFINAL NOTE: I don' ha e all he answe s...I don' e en ha e all he ques ions, and I know i . My guess is as good as any and I could be comple ely and o ally WRONG abou all o his (I'm open o ha and I'm pe ec ly ine wi h i ). Belie e you me, i he wo ld ends when a lo o   olks hink i migh I'll be jus as su p ised as anyone. Un il hen I'll keep doing wha I do now; ealizing ha I don' know a damn hing, aking li e as i comes o me day by p ecious day, ea ing i wi h espec and hono ing my expe ience he e as he gi i is, lo ing o he s, being good o he people a ound me and enjoying my amily and ime spen he e while I can. \n\n \nAnd I won' be a aid...no e en o one second o when I'm looking up and seeing ha big ***ing ock heading igh owa ds us, hahaha. Fo all I know (o anyone he e o ha ma e ), I could be blindsided by a Mac uck la e his e ening! \n\n \nMany o he people wo ied o e 2012 won' e en be he e when 2012 a i es...now how's THAT o a mind- **k!?!?\n \n;)\n \n-J\n \n \n \n \n--- On Mon, 12/20/10, U kel23 u kel23@...> w o e:\nF om: U kel23 u kel23@...>Subjec : [EVP-ITC] Re: A bi o alida ion \nTo: EVP-ITC@yahoog oups.comDa e: Monday, Decembe 20, 2010, 4:10 PM \n\n\n\n  \n\nF ank,Remembe las yea when we bo h go he Augus p edic ions? Tha didn' pan ou , so i wouldn' ake wha hey say oo se iously. They ha e ne e said any hing ha came ue ye , i don' hink hey can.\nI'm p e y su e ha hey can' ell he u u e, so when hey say s u i hink hey a e jus messing wi h us o see wha we do wi h he in o ma ion. They migh e en be laughing a us !-S e e--- In EVP-ITC@yahoog oups.com, F ank Sump ion w o e:\n>> Yeah, \" hey\" do seem o imply ha , as soon as Oc obe o nex yea , bu > hey won' answe ques ions o me.> > F-S> > On Mon, Dec 20, 2010 a 11:37 AM, w o e:\n> > >> >> > I may be soone , F ank. s > >> > In a message da ed 12/20/2010 1:42:40 A.M. Eas e n S anda d Time,> > kalinu@... w i es:> >> >\n> >> > wha !!!> >> > --- On *Mon, 12/20/10, F ank Sump ion * w o e:> >> >> > F om: F ank Sump ion \n> > Subjec : Re: [EVP-ITC] A bi o alida ion> > To: EVP-ITC@yahoog oups.com> > Da e: Monday, Decembe 20, 2010, 12:10 AM\n> >> >> > Plen y o ime, all o wo yea s!> >> > F-S> >> > On Sun, Dec 19, 2010 a 11:08 PM, U sula Kalin h p://us.mc1807.mail.yahoo.com/mc/compose? o=kalinu@...>\n> > > w o e:> >> >> > yeah you can hea i ...I jus hope i s no o much in he nea > > u u e..please I s ill ha e ons o s u o do> >> > --- On *Mon, 12/20/10, F ank Sump ion h p://us.mc1807.mail.yahoo.com/mc/compose? o=pu plealiengi l@...>\n> > >* w o e:> >> >> > F om: F ank Sump ion h p://us.mc1807.mail.yahoo.com/mc/compose? o=pu plealiengi l@...>\n> > >> > Subjec : [EVP-ITC] A bi o alida ion [1 A achmen ]> > To: EVP-ITC@yahoog oups.comh p://us.mc1807.mail.yahoo.com/mc/compose? o=EVP-ITC@yahoog oups.com>,\n> > RTSC@yahoog oups.comh p://us.mc1807.mail.yahoo.com/mc/compose? o=RTSC@yahoog oups.com>\n> > Da e: Monday, Decembe 20, 2010, 12:06 AM> >> >> >> > Migh be ha d o hea , bu loud. This is om Sand a Belange , a long> > ime EVP esea che . Pos ed wi h he pe mission.\n> >> > F-S> >> >> > > >>"}