{"id": "19749", "subject": "From today--", "author": "Frank Sumption", "timestamp": "2010-12-23T22:18:14Z", "full_text": "Yeah, been told this. I get the impression there&#39;s some joining this group\nhoping to get their ghost huntng or spirit beliefs validated, or confirmed,\nwhen they hear this junk they bail. This stuff is ITC, Instrumental\nTrans-Communication. That can be audio, video, or still images. I think\nthere is a mis-conception in the paranormal whatever world that EVP is ghost\nvoice, weak whispery barely audible noise, and ITC is video feedback loop\nimages, an never shall the two ever, ever mix. Some seem to think it&#39;s all\nperfectly well defined and laid down in laws and protocols. Afterall it&#39;s\nrepeated on TV week after weak after week.\n\n I managed to completely offend the guy that told me about the embedded\nimages, Richard Roberts. He started laying down all these absolute\nundeniabel laws and definitions of EVP, and when I disagreed openly, he got\nall pissed off, deleted all his Facebook content, and went away, sulking in\nsome dark internet corner I guess. I feel bad about offending him, but come\non! Grow up out there.\n\n Think I&#39;ll replace the tuner in this box, too frikin&#39; noisy. I don&#39;t have\ntuners to spare, but this one is unacceptabel.\n\n F-S\n\nYeah, been old his. I ge he imp ession he e's some joining his g oup hoping o ge hei ghos hun ng o spi i belie s alida ed, o con i med, when hey hea his junk hey bail. This s u is ITC, Ins umen al T ans-Communica ion. Tha can be audio, ideo, o s ill images. I hink he e is a mis-concep ion in he pa ano mal wha e e wo ld ha EVP is ghos oice, weak whispe y ba ely audible noise, and ITC is ideo eedback loop images, an ne e shall he wo e e , e e mix. Some seem o hink i 's all pe ec ly well de ined and laid down in laws and p o ocols. A e all i 's epea ed on TV week a e weak a e week.\n\n \n I managed o comple ely o end he guy ha old me abou he embedded images, Richa d Robe s. He s a ed laying down all hese absolu e undeniabel laws and de ini ions o EVP, and when I disag eed openly, he go all pissed o , dele ed all his Facebook con en , and wen away, sulking in some da k in e ne co ne I guess. I eel bad abou o ending him, bu come on! G ow up ou he e. \n\n \n Think I'll eplace he une in his box, oo ikin' noisy. I don' ha e une s o spa e, bu his one is unaccep abel. \n \n F-S"}