{"id": "19752", "subject": "Re: [EVP-ITC] From today--", "author": "Frank Sumption", "timestamp": "2010-12-24T00:05:24Z", "full_text": "Thanks, but that&#39;s the Rolling Hills Box, presumably out in public, I don&#39;t\nwant it to sound like crapola. This board more better.\n\n I had some boardfs I made in advance, but don&#39;t have cabinets for, this\none, and another with a car tuner.\n\nF-S\n\nOn Thu, Dec 23, 2010 at 3:46 PM, Ursula Kalin &lt;kalinu@sbcglobal.net&gt; wrote:\n\n&gt;\n&gt;\n&gt;   I wouldn&#39;t worry about Frank all you did was tell him his stuff was\n&gt; outdated which was true..I notice he left some images up there.\n&gt;\n&gt; I see what you mean &quot;noisy&quot; but its really not that bad..unless when he\n&gt; tranfer on my end it gets a natural filter..so i can&#39;t tell what it sounds\n&gt; like in person\n&gt;\n&gt;\n&gt; --- On *Thu, 12/23/10, Frank Sumption &lt;purplealiengirl@...&gt;* wrote:\n&gt;\n&gt;\n&gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt; Subject: [EVP-ITC] From today-- [1 Attachment]\n&gt; To: EVP-ITC@yahoogroups.com, RTSC@yahoogroups.com\n&gt; Date: Thursday, December 23, 2010, 4:18 PM\n&gt;\n&gt;\n&gt;\n&gt;   Yeah, been told this. I get the impression there&#39;s some joining this\n&gt; group hoping to get their ghost huntng or spirit beliefs validated, or\n&gt; confirmed, when they hear this junk they bail. This stuff is ITC,\n&gt; Instrumental Trans-Communication. That can be audio, video, or still images.\n&gt; I think there is a mis-conception in the paranormal whatever world that EVP\n&gt; is ghost voice, weak whispery barely audible noise, and ITC is video\n&gt; feedback loop images, an never shall the two ever, ever mix. Some seem to\n&gt; think it&#39;s all perfectly well defined and laid down in laws and protocols.\n&gt; Afterall it&#39;s repeated on TV week after weak after week.\n&gt;\n&gt;  I managed to completely offend the guy that told me about the embedded\n&gt; images, Richard Roberts. He started laying down all these absolute\n&gt; undeniabel laws and definitions of EVP, and when I disagreed openly, he got\n&gt; all pissed off, deleted all his Facebook content, and went away, sulking in\n&gt; some dark internet corner I guess. I feel bad about offending him, but come\n&gt; on! Grow up out there.\n&gt;\n&gt;  Think I&#39;ll replace the tuner in this box, too frikin&#39; noisy. I don&#39;t have\n&gt; tuners to spare, but this one is unacceptabel.\n&gt;\n&gt;  F-S\n&gt;\n&gt; \n&gt;\n\nThanks, bu ha 's he Rolling Hills Box, p esumably ou in public, I don' wan i o sound like c apola. This boa d mo e be e .\n \n I had some boa d s I made in ad ance, bu don' ha e cabine s o , his one, and ano he wi h a ca une . \n \nF-S\nOn Thu, Dec 23, 2010 a 3:46 PM, U sula Kalin kalinu@...> w o e:\n\n  \n\n\n\n\n\n\n\n\nI wouldn' wo y abou F ank all you did was ell him his s u was ou da ed which was ue..I no ice he le some images up he e.\n \nI see wha you mean \"noisy\" bu i s eally no ha bad..unless when he an e on my end i ge s a na u al il e ..so i can' ell wha i sounds like in pe son\n--- On Thu, 12/23/10, F ank Sump ion pu plealiengi l@...> w o e:\nF om: F ank Sump ion pu plealiengi l@gmail.com>Subjec : [EVP-ITC] F om oday-- [1 A achmen ]\nTo: EVP-ITC@yahoog oups.com, RTSC@yahoog oups.comDa e: Thu sday, Decembe 23, 2010, 4:18 PM \n\n\n\n  \n\n\n Yeah, been old his. I ge he imp ession he e's some joining his g oup hoping o ge hei ghos hun ng o spi i belie s alida ed, o con i med, when hey hea his junk hey bail. This s u is ITC, Ins umen al T ans-Communica ion. Tha can be audio, ideo, o s ill images. I hink he e is a mis-concep ion in he pa ano mal wha e e wo ld ha EVP is ghos oice, weak whispe y ba ely audible noise, and ITC is ideo eedback loop images, an ne e shall he wo e e , e e mix. Some seem o hink i 's all pe ec ly well de ined and laid down in laws and p o ocols. A e all i 's epea ed on TV week a e weak a e week.\n\n \n I managed o comple ely o end he guy ha old me abou he embedded images, Richa d Robe s. He s a ed laying down all hese absolu e undeniabel laws and de ini ions o EVP, and when I disag eed openly, he go all pissed o , dele ed all his Facebook con en , and wen away, sulking in some da k in e ne co ne I guess. I eel bad abou o ending him, bu come on! G ow up ou he e. \n\n \n Think I'll eplace he une in his box, oo ikin' noisy. I don' ha e une s o spa e, bu his one is unaccep abel. \n \n F-S"}