{"id": "19766", "subject": "Re: [EVP-ITC] Frank&#39;s Box #94 Youtube Video", "author": "Tim Woolworth", "timestamp": "2010-12-24T18:09:32Z", "full_text": "Interesting.\n\nDo you speak French Steve?  A woman was speaking it during the clip starting\nat .41 seconds.  Are there any French radio stations down that way?  What I\nfind interesting is that she is speaking French and man is agreeing with her\nin English.  It may be radio broadcast because of the clarity, but I would\nthink a translator would be speaking for her since only the Bayou and Quebec\nuse French here in North America.\n\nMy French is really rusty, but I think she is saying:\n\n&quot;D&#39;accord.  En vous etait parlons a l&#39;etre (yes)  te t&#39;aller....&quot; and I\ncan&#39;t quite make out the rest.\n\n&quot;I agree.  What you are talking about is the being (yes).  You go....&quot;\n\nWhen you switch to direct mode random at 4:13 you get a pretty clear female\n&quot;hey.&quot;\n\nLooks like the camera was well worth the money!\n\nTim\n\n\nOn Fri, Dec 24, 2010 at 12:35 PM, Urkel23 &lt;urkel23@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;\n&gt; This video was shot with my new FLIP MinoHD camera. Great buy for $139\n&gt;\n&gt; http://www.youtube.com/watch?v=rU3nCcqgs0s\n&gt;\n&gt; -Steve H.\n&gt;\n&gt;  \n&gt;\n\nIn e es ing.Do you speak F ench S e e?  A woman was speaking i du ing he clip s a ing a .41 seconds.  A e he e any F ench adio s a ions down ha way?  Wha I ind in e es ing is ha she is speaking F ench and man is ag eeing wi h he in English.  I may be adio b oadcas because o he cla i y, bu I would hink a ansla o would be speaking o he since only he Bayou and Quebec use F ench he e in No h Ame ica.  \nMy F ench is eally us y, bu I hink she is saying:\"D'acco d.  En ous e ai pa lons a l'e e (yes)   e 'alle ....\" and I can' qui e make ou he es .\n\"I ag ee.  Wha you a e alking abou is he being (yes).  You go....\" When you swi ch o di ec mode andom a 4:13 you ge a p e y clea emale \"hey.\"\nLooks like he came a was well wo h he money!TimOn F i, Dec 24, 2010 a 12:35 PM, U kel23 u kel23@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n \nThis ideo was sho wi h my new FLIP MinoHD came a. G ea buy o $139\n\nh p://www.you ube.com/wa ch? = U3nCcqgs0s\n\n-S e e H."}