{"id": "19768", "subject": "Re: [EVP-ITC] Where&#39;s the line, remind you guys of something we all heard on ...", "author": "Frank Sumption", "timestamp": "2010-12-24T18:13:13Z", "full_text": "I know, and I don&#39;t mean to get all negative and judgemental, but.....\nF-S\n\nOn Fri, Dec 24, 2010 at 7:41 AM, &lt;SnowfireL@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; All that was sent in the video Frank, was a pretty song. sf\n&gt;\n&gt;  In a message dated 12/23/2010 10:13:39 P.M. Eastern Standard Time,\n&gt; purplealiengirl@gmail.com writes:\n&gt;\n&gt;\n&gt;\n&gt;  I know ya think everyone should believe, and I get the Jesus voices, too,\n&gt; I just don&#39;t buy it. The concept of not believing in a savior and being\n&gt; either forever dead or condemned to hell just don&#39;t make any sense. EVP, and\n&gt; just about everything paranormal proves that life is forever, no strings\n&gt; attached. I don&#39;t care how much they sugar coat the stuff, it&#39;s still giving\n&gt; your soul, spirit.--freedom, to some unkonwn entity, and that ain&#39;t good.\n&gt; Everyone I know, with out exceptiion the was &quot;born again&quot; became someone\n&gt; else, someone evil that would back stab freinds and family for the slightest\n&gt; gain. Lie cheat and steal. What about all the really evil, vile\n&gt; televangelists out there? Preaching hell&#39;s fire during the day, chasing\n&gt; little boys and doing drugs at night. Try doing some reverse speech on these\n&gt; freaks! We have one of those evil clowns right here in Colorado. Why don&#39;t\n&gt; your Jesus keep evil away for these little megolomainiacs? That&#39;s cuz he is\n&gt; that which you fear in the ultimate diguise! Think about it, call the being\n&gt; from the white light evil and lure all others into darkness. It&#39;s not rocket\n&gt; science!\n&gt;\n&gt;  I have to side with Hultay, go make yourself a group just for true\n&gt; believers.\n&gt;\n&gt;  Freedom of religion is by definition freedom from religion!\n&gt;\n&gt; F-S\n&gt;\n&gt;   \n&gt;\n\nI know, and I don' mean o ge all nega i e and judgemen al, bu .....\nF-S\nOn F i, Dec 24, 2010 a 7:41 AM, Snow i eL@...> w o e:\n\n  \n\n\n\n\nAll ha was sen in he ideo F ank, was a p e y song. s \n \n\nIn a message da ed 12/23/2010 10:13:39 P.M. Eas e n S anda d Time, pu plealiengi l@... w i es:\n  \n\n\n I know ya hink e e yone should belie e, and I ge he Jesus oices, oo, I jus don' buy i . The concep o no belie ing in a sa io and being ei he o e e dead o condemned o hell jus don' make any sense. EVP, and jus abou e e y hing pa ano mal p o es ha li e is o e e , no s ings a ached. I don' ca e how much hey suga coa he s u , i 's s ill gi ing you soul, spi i .-- eedom, o some unkonwn en i y, and ha ain' good. E e yone I know, wi h ou excep iion he was \"bo n again\" became someone else, someone e il ha would back s ab einds and amily o he sligh es gain. Lie chea and s eal. Wha abou all he eally e il, ile ele angelis s ou he e? P eaching hell's i e du ing he day, chasing li le boys and doing d ugs a nigh . T y doing some e e se speech on hese eaks! We ha e one o hose e il clowns igh he e in Colo ado. Why don' you Jesus keep e il away o hese li le megolomainiacs? Tha 's cuz he is ha which you ea in he ul ima e diguise! Think abou i , call he being om he whi e ligh e il and lu e all o he s in o da kness. I 's no ocke science!\n\n \n I ha e o side wi h Hul ay, go make you sel a g oup jus o ue belie e s. \n \n F eedom o eligion is by de ini ion eedom om eligion! \n \nF-S"}