{"id": "19760", "subject": "Re: [EVP-ITC] Where&#39;s the line, remind you guys of something we all heard on a EVP???", "author": "Ursula Kalin", "timestamp": "2010-12-24T06:11:52Z", "full_text": "--0-473310775-1293171112=:21661\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nyeah i with you and steve on this one to! I mean not that i don&#39;t believe i=\r\nn a higher power but it tends to get a bit much..\n\n--- On Thu, 12/23/10, Fr=\r\nank Sumption &lt;purplealiengirl@...&gt; wrote:\n\n\nFrom: Frank Sumption &lt;pur=\r\nplealiengirl@...&gt;\nSubject: Re: [EVP-ITC] Where&#39;s the line, remind you=\r\n guys of something we all heard on a EVP???\nTo: EVP-ITC@yahoogroups.com\nDat=\r\ne: Thursday, December 23, 2010, 9:13 PM\n\n\n=C2=A0 \n\n\n\n\n=C2=A0I know ya think=\r\n everyone should believe, and I get the Jesus voices, too, I just don&#39;t buy=\r\n it. The concept of not believing in a savior and being either forever dead=\r\n or condemned to hell just don&#39;t make any sense. EVP, and just about everyt=\r\nhing paranormal proves that life is forever, no strings attached. I don&#39;t c=\r\nare how much they sugar coat the stuff, it&#39;s still giving your soul, spirit=\r\n.--freedom, to some unkonwn entity, and that ain&#39;t good. Everyone I know, w=\r\nith out exceptiion the was &quot;born again&quot; became someone else, someone evil t=\r\nhat would back stab freinds and family for the slightest gain. Lie cheat an=\r\nd steal. What about all the really evil, vile televangelists out there? Pre=\r\naching hell&#39;s fire during the day, chasing little boys and doing drugs at n=\r\night.=C2=A0Try doing some reverse speech on these freaks!=C2=A0We have one =\r\nof those evil clowns right here in Colorado. Why don&#39;t your Jesus keep evil=\r\n away for these little megolomainiacs? That&#39;s cuz he is\n that which you fea=\r\nr in the ultimate diguise! Think about it, call the being from the white li=\r\nght evil and lure all others into darkness. It&#39;s not rocket science!\n=C2=A0=\r\n\n=C2=A0I have to side with Hultay, go make yourself a group just for true b=\r\nelievers. \n=C2=A0\n=C2=A0Freedom of religion is by definition freedom from r=\r\neligion! \n=C2=A0\nF-S\n\n\n\n\n\n\n\r\n--0-473310775-1293171112=:21661\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;FONT size=3D4&gt;yeah i with you and steve on t=\r\nhis one to! I mean not that i don&#39;t believe in a higher power but it tends =\r\nto get a bit much..&lt;/FONT&gt;&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Thu, 12/23/10, Frank Sumption &lt;=\r\nI&gt;&lt;purplealiengirl@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D=\r\n&quot;BORDER-LEFT: rgb(16,16,255) 2px solid; PADDING-LEFT: 5px; MARGIN-LEFT: 5px=\r\n&quot;&gt;&lt;BR&gt;From: Frank Sumption &lt;purplealiengirl@...&gt;&lt;BR&gt;Subject: Re=\r\n: [EVP-ITC] Where&#39;s the line, remind you guys of something we all heard on =\r\na EVP???&lt;BR&gt;To: EVP-ITC@yahoogroups.com&lt;BR&gt;Date: Thursday, December 23, 201=\r\n0, 9:13 PM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3Dyiv454124387&gt;&lt;SPAN style=3D&quot;DISPLAY: none&quot;&gt;&nb=\r\nsp;&lt;/SPAN&gt; \n&lt;DIV id=3Dyiv454124387ygrp-text&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&nbsp;I know ya thi=\r\nnk everyone should believe, and I get the Jesus voices, too, I just don&#39;t b=\r\nuy it. The concept of not believing in a savior and being either forever de=\r\nad or condemned to hell just don&#39;t make any sense. EVP, and just about ever=\r\nything paranormal proves that life is forever, no strings attached. I don&#39;t=\r\n care how much they sugar coat the stuff, it&#39;s still giving your soul, spir=\r\nit.--freedom, to some unkonwn entity, and that ain&#39;t good. Everyone I know,=\r\n with out exceptiion the was &quot;born again&quot; became someone else, someone evil=\r\n that would back stab freinds and family for the slightest gain. Lie cheat =\r\nand steal. What about all the really evil, vile televangelists out there? P=\r\nreaching hell&#39;s fire during the day, chasing little boys and doing drugs at=\r\n night.&nbsp;Try doing some reverse speech on these freaks!&nbsp;We have on=\r\ne of those evil clowns right here in Colorado. Why don&#39;t your Jesus keep ev=\r\nil away for these little megolomainiacs?\n That&#39;s cuz he is that which you f=\r\near in the ultimate diguise! Think about it, call the being from the white =\r\nlight evil and lure all others into darkness. It&#39;s not rocket science!&lt;/DIV=\r\n&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;I have to side with Hultay, go make yourself=\r\n a group just for true believers. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;Freed=\r\nom of religion is by definition freedom from religion! &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/=\r\nDIV&gt;\n&lt;DIV&gt;F-S&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;\r\n--0-473310775-1293171112=:21661--"}