{"id": "19813", "subject": "Hello (Introduction)", "author": "paradisian22@yahoo.com", "timestamp": "2010-12-28T19:04:29Z", "full_text": "I&#39;m interested in EVP/ITC/Spiricom so that I can get audio recordings\nproving that Spirit exists, that each natural-born man or woman of the  Spirit IS a differentiated spirit (either with, or without a physical body) and that after physical death the spirit body continues on, especially if the physical body was subjected to death before its time.\n\nIn particular I met, and fell in love with on first meeting (and only physical meeting) a woman in 2000 whose physical body died as a result of traumas caused by landing on rocks from 40 feet above;\nit appears likely that she was murdered instead of the public story which was that it was &quot;an accidental fall from a height&quot; with &quot;no foul play&quot; involved. In 2008, she returned to find me and did find me. I saw her in spirit walking up and down the main road near where her physical body had gone off the cliff. I thought it was maybe just my imagination \nbut then some months later she showed up in my house, laying on my bed. I could see her there in full (yet fully transparent) colour, moving slightly. I couldn&#39;t believe my eyes but having been very spiritually sensitive and open all my life, it was almost .. almost second nature and I just about jumped on her on the bed to give her a big hug. It may sound crazy but we stayed together the whole day and talked psychically about everything under the sun, moon and stars, then fell asleep in each other&#39;s &#39;arms&#39; at the end of the day; I woke up at 6:01 the next morning to find out she was still there! I was then reminded of the whole experience, and burst out with total emotion and asked her with total sincerity to marry me ... and she accepted saying &quot;Yes!!!&quot; ... (I quickly noted down the exact date and time so I could always know and remember our anniversary, which we&#39;ve now celebrated every year since then). \n\nNow after almost 3 years of being together, she and I are VERY restless about making her communication (and our communication) much more tangible. She&#39;s very capable of doing EVP etc. (possibly with a little coaching on how to do it from me, if I can learn enough about how it works myself), based on what she&#39;s told me, and the fact she&#39;s shown many manifestations of being really here and alive ... it&#39;s just hard to convince others of this without tangible evidence.\n\nSo that is in essence what brought me to the EVP-ITC forum. \nThanks for having me here!\n\nPlease feel free to call me any time at 818-428-1493, 808-217-0264, 406-564-1352 or 713-568-5238 or email me at viphawaii@...\n( viphawaii at gmail dot com) or paradisian22@... (paradisian22 at yahoo dot com [this account] ).\n\nWith Aloha,\n\n&quot;Paradisian&quot;.\n\nP.S. :\n\nKeep the Spirit Alive!"}