{"id": "19824", "subject": "Re: [EVP-ITC] Hello (Introduction)", "author": "Frank Sumption", "timestamp": "2010-12-29T17:27:23Z", "full_text": "I think maybe try the one of the various hack boxes first. The ghost box is\njust a radio that sweeps across it&#39;s tuning range providing bits of speech\nmusic and noise that the entities use to form thier voices. At least that&#39;s\nthe theory anyway, there seems to be more involved on their end. The hack\nbox is a digital radio that is easily modified so it when it tries to search\nfor a station, it won&#39;t lock on to any stations, and it still outputs sound,\nso you get the the bits of raw audio needed for spirit communication. You\ncan also do the sweep by supplying an expertal sweep voltage inthe form of a\ntriangle wave, or you can do the sweep by hand, just by turning the tuning\ndial while recording.\n\n Personally, I prefer to record, and listen to the recording, as I miss most\nof the communication if I try to listen live. I just let them talk, rarely\nask questions, and allow anyone/anything to speak.\n\n F-S\n\nOn Tue, Dec 28, 2010 at 12:04 PM, &lt;paradisian22@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; I&#39;m interested in EVP/ITC/Spiricom so that I can get audio recordings\n&gt; proving that Spirit exists, that each natural-born man or woman of the\n&gt; Spirit IS a differentiated spirit (either with, or without a physical body)\n&gt; and that after physical death the spirit body continues on, especially if\n&gt; the physical body was subjected to death before its time.\n&gt;\n&gt; In particular I met, and fell in love with on first meeting (and only\n&gt; physical meeting) a woman in 2000 whose physical body died as a result of\n&gt; traumas caused by landing on rocks from 40 feet above;\n&gt; it appears likely that she was murdered instead of the public story which\n&gt; was that it was &quot;an accidental fall from a height&quot; with &quot;no foul play&quot;\n&gt; involved. In 2008, she returned to find me and did find me. I saw her in\n&gt; spirit walking up and down the main road near where her physical body had\n&gt; gone off the cliff. I thought it was maybe just my imagination\n&gt; but then some months later she showed up in my house, laying on my bed. I\n&gt; could see her there in full (yet fully transparent) colour, moving slightly.\n&gt; I couldn&#39;t believe my eyes but having been very spiritually sensitive and\n&gt; open all my life, it was almost .. almost second nature and I just about\n&gt; jumped on her on the bed to give her a big hug. It may sound crazy but we\n&gt; stayed together the whole day and talked psychically about everything under\n&gt; the sun, moon and stars, then fell asleep in each other&#39;s &#39;arms&#39; at the end\n&gt; of the day; I woke up at 6:01 the next morning to find out she was still\n&gt; there! I was then reminded of the whole experience, and burst out with total\n&gt; emotion and asked her with total sincerity to marry me ... and she accepted\n&gt; saying &quot;Yes!!!&quot; ... (I quickly noted down the exact date and time so I could\n&gt; always know and remember our anniversary, which we&#39;ve now celebrated every\n&gt; year since then).\n&gt;\n&gt; Now after almost 3 years of being together, she and I are VERY restless\n&gt; about making her communication (and our communication) much more tangible.\n&gt; She&#39;s very capable of doing EVP etc. (possibly with a little coaching on how\n&gt; to do it from me, if I can learn enough about how it works myself), based on\n&gt; what she&#39;s told me, and the fact she&#39;s shown many manifestations of being\n&gt; really here and alive ... it&#39;s just hard to convince others of this without\n&gt; tangible evidence.\n&gt;\n&gt; So that is in essence what brought me to the EVP-ITC forum.\n&gt; Thanks for having me here!\n&gt;\n&gt; Please feel free to call me any time at 818-428-1493, 808-217-0264,\n&gt; 406-564-1352 or 713-568-5238 or email me at viphawaii@...&lt;viphawaii%40gmail.com&gt;\n&gt; ( viphawaii at gmail dot com) or paradisian22@...&lt;paradisian22%40yahoo.com&gt;(paradisian22 at yahoo dot com [this account] ).\n&gt;\n&gt; With Aloha,\n&gt;\n&gt; &quot;Paradisian&quot;.\n&gt;\n&gt; P.S. :\n&gt;\n&gt; Keep the Spirit Alive!\n&gt;\n&gt; \n&gt;\n\nI hink maybe y he one o he a ious hack boxes i s . The ghos box is jus a adio ha sweeps ac oss i 's uning ange p o iding bi s o speech music and noise ha he en i ies use o o m hie oices. A leas ha 's he heo y anyway, he e seems o be mo e in ol ed on hei end. The hack box is a digi al adio ha is easily modi ied so i when i ies o sea ch o a s a ion, i won' lock on o any s a ions, and i s ill ou pu s sound, so you ge he he bi s o aw audio needed o spi i communica ion. You can also do he sweep by supplying an expe al sweep ol age in he o m o a iangle wa e, o you can do he sweep by hand, jus by u ning he uning dial while eco ding. \n\n \n Pe sonally, I p e e o eco d, and lis en o he eco ding, as I miss mos o he communica ion i I y o lis en li e. I jus le hem alk, a ely ask ques ions, and allow anyone/any hing o speak. \n \n F-S\nOn Tue, Dec 28, 2010 a 12:04 PM, pa adisian22@...> w o e:\n\n  \n\n\n\nI'm in e es ed in EVP/ITC/Spi icom so ha I can ge audio eco dingsp o ing ha Spi i exis s, ha each na u al-bo n man o woman o he Spi i IS a di e en ia ed spi i (ei he wi h, o wi hou a physical body) and ha a e physical dea h he spi i body con inues on, especially i he physical body was subjec ed o dea h be o e i s ime.\nIn pa icula I me , and ell in lo e wi h on i s mee ing (and only physical mee ing) a woman in 2000 whose physical body died as a esul o aumas caused by landing on ocks om 40 ee abo e;i appea s likely ha she was mu de ed ins ead o he public s o y which was ha i was \"an acciden al all om a heigh \" wi h \"no oul play\" in ol ed. In 2008, she e u ned o ind me and did ind me. I saw he in spi i walking up and down he main oad nea whe e he physical body had gone o he cli . I hough i was maybe jus my imagina ion \nbu hen some mon hs la e she showed up in my house, laying on my bed. I could see he he e in ull (ye ully anspa en ) colou , mo ing sligh ly. I couldn' belie e my eyes bu ha ing been e y spi i ually sensi i e and open all my li e, i was almos .. almos second na u e and I jus abou jumped on he on he bed o gi e he a big hug. I may sound c azy bu we s ayed oge he he whole day and alked psychically abou e e y hing unde he sun, moon and s a s, hen ell asleep in each o he 's 'a ms' a he end o he day; I woke up a 6:01 he nex mo ning o ind ou she was s ill he e! I was hen eminded o he whole expe ience, and bu s ou wi h o al emo ion and asked he wi h o al since i y o ma y me ... and she accep ed saying \"Yes!!!\" ... (I quickly no ed down he exac da e and ime so I could always know and emembe ou anni e sa y, which we' e now celeb a ed e e y yea since hen). \nNow a e almos 3 yea s o being oge he , she and I a e VERY es less abou making he communica ion (and ou communica ion) much mo e angible. She's e y capable o doing EVP e c. (possibly wi h a li le coaching on how o do i om me, i I can lea n enough abou how i wo ks mysel ), based on wha she's old me, and he ac she's shown many mani es a ions o being eally he e and ali e ... i 's jus ha d o con ince o he s o his wi hou angible e idence.\nSo ha is in essence wha b ough me o he EVP-ITC o um. Thanks o ha ing me he e!Please eel ee o call me any ime a 818-428-1493, 808-217-0264, 406-564-1352 o 713-568-5238 o email me a iphawaii@...\n( iphawaii a gmail do com) o pa adisian22@... (pa adisian22 a yahoo do com [ his accoun ] ).Wi h Aloha,\"Pa adisian\".\nP.S. :Keep he Spi i Ali e!"}