{"id": "19832", "subject": "Re: [EVP-ITC] The case for faces.", "author": "Frank Sumption", "timestamp": "2010-12-30T06:23:08Z", "full_text": "Figured there would be little interest. Thanks for taking the time Ursula!\n\n F-S\n\nOn Wed, Dec 29, 2010 at 10:24 PM, Ursula Kalin &lt;kalinu@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;   well i don&#39;t know so much about faces but i do alittle about reverse\n&gt; speech which sorta of happened by mistake...I know if i look hard i will be\n&gt; able to find a file that I got my mistake its a regular digital recording\n&gt; which i didn&#39;t no that was being recorded (my 5 year use to do that alot)\n&gt; anyway he and i was arguing about our 7 month old at the time not so much\n&gt; arguing but you no what I mean...and i said to him &quot;hey she trying to get\n&gt; your attention&quot; and he was like I see her and he started like sing to her a\n&gt; silly little song that didn&#39;t have alot of words in it...well when played\n&gt; back words if was unreal  he says &quot;ignore her..I ignore her..do you her\n&gt; Ursula&quot; he even says my name Now you have to understand what he says forward\n&gt; is NOTHING like he says backward so i may very very much aware we have those\n&gt; abilities weather we know it or not...I think on the other side the have\n&gt; mastered it..I&#39;ll have to go throw alot of file but everyone who hears it\n&gt; can&#39;t believe it!\n&gt;\n&gt; --- On *Wed, 12/29/10, Frank Sumption &lt;purplealiengirl@...&gt;* wrote:\n&gt;\n&gt;\n&gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt; Subject: [EVP-ITC] The case for faces. [11 Attachments]\n&gt; To: EVP-ITC@yahoogroups.com, RTSC@yahoogroups.com\n&gt; Date: Wednesday, December 29, 2010, 11:00 PM\n&gt;\n&gt;\n&gt;\n&gt;   I&#39;m thinking there is faces embedded in sound, it&#39;s related to speech,\n&gt; and not just EVP. It seems to be a normal function of our own minds(living\n&gt; or dead), the same as reverse speech. I found some faces in old EVPs from\n&gt; boxes and also in music files. The ones from Evanescence are pretty\n&gt; impressive in person, and do not seem to be intentionaly embedded.\n&gt;\n&gt;  I know, it&#39;s not ghost hunters, and most don&#39;t want to have to think.\n&gt; I think most want this stuff in a neat little box, all well defined, all\n&gt; rules and protocols known, but it just won&#39;t stay in one box, or universe\n&gt; for that matter.\n&gt;\n&gt;  Frank-S\n&gt;\n&gt; \n&gt;\n\nFigu ed he e would be li le in e es . Thanks o aking he ime U sula!\n \n F-S\nOn Wed, Dec 29, 2010 a 10:24 PM, U sula Kalin kalinu@...> w o e:\n\n  \n\n\n\n\n\n\n\nwell i don' know so much abou aces bu i do ali le abou e e se speech which so a o happened by mis ake...I know i i look ha d i will be able o ind a ile ha I go my mis ake i s a egula digi al eco ding which i didn' no ha was being eco ded (my 5 yea use o do ha alo ) anyway he and i was a guing abou ou 7 mon h old a he ime no so much a guing bu you no wha I mean...and i said o him \"hey she ying o ge you a en ion\" and he was like I see he and he s a ed like sing o he a silly li le song ha didn' ha e alo o wo ds in i ...well when played back wo ds i was un eal  he says \"igno e he ..I igno e he ..do you he U sula\" he e en says my name Now you ha e o unde s and wha he says o wa d is NOTHING like he says backwa d so i may e y e y much awa e we ha e hose abili ies wea he we know i o no ...I hink on he o he side he ha e mas e ed i ..I'll ha e o go h ow alo o ile bu e e yone who hea s i can' belie e i !\n--- On Wed, 12/29/10, F ank Sump ion pu plealiengi l@gmail.com> w o e:\nF om: F ank Sump ion pu plealiengi l@...>Subjec : [EVP-ITC] The case o aces. [11 A achmen s]\nTo: EVP-ITC@yahoog oups.com, RTSC@...mDa e: Wednesday, Decembe 29, 2010, 11:00 PM \n\n  \n\n\n I'm hinking he e is aces embedded in sound, i 's ela ed o speech, and no jus EVP. I seems o be a no mal unc ion o ou own minds(li ing o dead), he same as e e se speech. I ound some aces in old EVPs om boxes and also in music iles. The ones om E anescence a e p e y imp essi e in pe son, and do no seem o be in en ionaly embedded. \n\n \n I know, i 's no ghos hun e s, and mos don' wan o ha e o hink. I  hink mos wan his s u in a nea li le box, all well de ined, all ules and p o ocols known, bu i jus won' s ay in one box, o uni e se o ha ma e . \n\n \n F ank-S"}