{"id": "19840", "subject": "Re: [EVP-ITC] Re: The case for faces.", "author": "Frank Sumption", "timestamp": "2010-12-30T20:44:03Z", "full_text": "It not just you, everyone wants everything handed to them, no thinking, no\nwork. They just want an excuse not to question anything so they can go on\nplaying video games, watching movies and ignoring how bad the world really\nis.\n\n\n There is not even any discussion possible, not here, not on FB, not\nanywhere. Everyone wants the same precanned BS from what they invision as\nauthorities. Just make it all go away so y&#39;all can completely ignore all\nreality. Ya don&#39;t have to question, ya don&#39;t have think, ya don&#39;t have to\nseek any answers.  I&#39;m done.\n\n F-S\n\nOn Thu, Dec 30, 2010 at 1:48 AM, Adrienne &lt;abortree@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Frank Sumption\n&gt; &lt;purplealiengirl@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; I&#39;m thinking there is faces embedded in sound, it&#39;s related to speech,\n&gt; and\n&gt; &gt; not just EVP. It seems to be a normal function of our own minds(living or\n&gt; &gt; dead), the same as reverse speech. I found some faces in old EVPs from\n&gt; boxes\n&gt; &gt; and also in music files. The ones from Evanescence are pretty impressive\n&gt; in\n&gt; &gt; person, and do not seem to be intentionaly embedded.\n&gt; &gt;\n&gt; &gt; I know, it&#39;s not ghost hunters, and most don&#39;t want to have to think.\n&gt; &gt; I think most want this stuff in a neat little box, all well defined, all\n&gt; &gt; rules and protocols known, but it just won&#39;t stay in one box, or universe\n&gt; &gt; for that matter.\n&gt; &gt;\n&gt; &gt; Frank-S\n&gt; &gt;\n&gt; Dear Frank,\n&gt;\n&gt; I think that I see what you mean. I mean no offense, but I it would be\n&gt; helpful to see something a little more definitive that couldn&#39;t be mistaken\n&gt; for matrixing. Is this possible? Is it just me?\n&gt;\n&gt; - Adrienne\n&gt;\n&gt;  \n&gt;\n\nI no jus you, e e yone wan s e e y hing handed o hem, no hinking, no wo k. They jus wan an excuse no o ques ion any hing so hey can go on playing ideo games, wa ching mo ies and igno ing how bad he wo ld eally is. \n\n \n \n The e is no e en any discussion possible, no he e, no  on FB, no anywhe e. E e yone wan s he same p ecanned BS om wha hey in ision as au ho i ies. Jus make i all go away so y'all can comple ely igno e all eali y. Ya don' ha e o ques ion, ya don' ha e hink, ya don' ha e o seek any answe s.  I'm done.\n\n \n F-S\nOn Thu, Dec 30, 2010 a 1:48 AM, Ad ienne abo ee@...> w o e:\n\n  \n\n\n\n\n\n\n--- In EVP-ITC@yahoog oups.com, F ank Sump ion w o e:>> I'm hinking he e is aces embedded in sound, i 's ela ed o speech, and\n> no jus EVP. I seems o be a no mal unc ion o ou own minds(li ing o > dead), he same as e e se speech. I ound some aces in old EVPs om boxes> and also in music iles. The ones om E anescence a e p e y imp essi e in\n> pe son, and do no seem o be in en ionaly embedded.> > I know, i 's no ghos hun e s, and mos don' wan o ha e o hink.> I hink mos wan his s u in a nea li le box, all well de ined, all\n> ules and p o ocols known, bu i jus won' s ay in one box, o uni e se> o ha ma e .> > F ank-S>Dea F ank,I hink ha I see wha you mean. I mean no o ense, bu I i would be help ul o see some hing a li le mo e de ini i e ha couldn' be mis aken o ma ixing. Is his possible? Is i jus me?\n- Ad ienne"}