{"id": "19844", "subject": "Re: The case for faces.", "author": "Adrienne", "timestamp": "2010-12-31T09:14:14Z", "full_text": "Dear Frank, \nI didn&#39;t mean any offense and I&#39;m not looking for a neat package, don&#39;t play video games, study sustainable planet options and environmental policy and don&#39;t want the Ghost Hunters experience again where I validated for myself that these entities exist but still don&#39;t know what/where they are.\n\nAfter looking at your files a few times I had an &quot;aha&quot;moment. This is why I&#39;m interested in this group.  Thank you for making the effort to share those files. I apologize if I came off like an ignorant jerk.  I realize I&#39;m a &quot;newbie&quot; without the years of experience and work that the rest of you have put into this and I have nothing to teach you.  I&#39;m here to learn.\n\n-Adrienne\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  It not just you, everyone wants everything handed to them, no thinking, no\n&gt; work. They just want an excuse not to question anything so they can go on\n&gt; playing video games, watching movies and ignoring how bad the world really\n&gt; is.\n&gt; \n&gt; \n&gt;  There is not even any discussion possible, not here, not on FB, not\n&gt; anywhere. Everyone wants the same precanned BS from what they invision as\n&gt; authorities. Just make it all go away so y&#39;all can completely ignore all\n&gt; reality. Ya don&#39;t have to question, ya don&#39;t have think, ya don&#39;t have to\n&gt; seek any answers.  I&#39;m done.\n&gt; \n&gt;  F-S\n&gt; \n&gt; On Thu, Dec 30, 2010 at 1:48 AM, Adrienne &lt;abortree@...&gt; wrote:\n&gt; \n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Frank Sumption\n&gt; &gt; &lt;purplealiengirl@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; I&#39;m thinking there is faces embedded in sound, it&#39;s related to speech,\n&gt; &gt; and\n&gt; &gt; &gt; not just EVP. It seems to be a normal function of our own minds(living or\n&gt; &gt; &gt; dead), the same as reverse speech. I found some faces in old EVPs from\n&gt; &gt; boxes\n&gt; &gt; &gt; and also in music files. The ones from Evanescence are pretty impressive\n&gt; &gt; in\n&gt; &gt; &gt; person, and do not seem to be intentionaly embedded.\n&gt; &gt; &gt;\n&gt; &gt; &gt; I know, it&#39;s not ghost hunters, and most don&#39;t want to have to think.\n&gt; &gt; &gt; I think most want this stuff in a neat little box, all well defined, all\n&gt; &gt; &gt; rules and protocols known, but it just won&#39;t stay in one box, or universe\n&gt; &gt; &gt; for that matter.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Frank-S\n&gt; &gt; &gt;\n&gt; &gt; Dear Frank,\n&gt; &gt;\n&gt; &gt; I think that I see what you mean. I mean no offense, but I it would be\n&gt; &gt; helpful to see something a little more definitive that couldn&#39;t be mistaken\n&gt; &gt; for matrixing. Is this possible? Is it just me?\n&gt; &gt;\n&gt; &gt; - Adrienne\n&gt; &gt;\n&gt; &gt;  \n&gt; &gt;\n&gt;"}