{"id": "19891", "subject": "Re: [EVP-ITC] Re: The case for faces.", "author": "Adrienne B", "timestamp": "2011-01-03T07:06:38Z", "full_text": "Yes, wow.. I don&#39;t know what to say.  I&#39;ve belonged to the group for 3-4\ndays. Your reputation and experience/experiments were  the main reason and I\nlearned afterwards of the others with experience.  I can only apologize if\nmy question was the straw.  Thank you for explaining the history, Frank.\n Sorry it&#39;s been so wearing on you.  Hope you find what you&#39;re looking for.\n\nOn Sun, Jan 2, 2011 at 12:39 PM, purplespacefriend &lt;\npurplealiengirl@gmail.com&gt; wrote:\n\n&gt;\n&gt;\n&gt; Well, for one thing, I don&#39;t own the group anymore. Due to one of these\n&gt; incessent argurments, I had to back away from this some years ago as I\n&gt; almost got fired becuase yet someone else that thought they knew so much\n&gt; more forwarded all my e-mails to my boss.\n&gt;\n&gt; Then someone else seemed to be insinuating that I may have tampered with\n&gt; the imgaes. Very insulting. This stuff goes on an on, regardless of the\n&gt; quality of voices, or the images. I have reached my saturation point. There\n&gt; seems to be nothing more to be gained by presenting anything else. Now, I\n&gt; can sympatize with Richard Roberts!\n&gt;\n&gt; The group will continue, as there are a number of box and paranormal\n&gt; experts here that are more than happy to tell everyone what this stuff\n&gt; really is and how it works.\n&gt;\n&gt; I didn&#39;t mean to create bad any feelings.\n&gt;\n&gt; F-S\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, &quot;Adrienne&quot;\n&gt; &lt;abortree@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hi\n&gt; &gt;\n&gt; &gt; Thank you for getting back to me. I thought I had destroyed the group by\n&gt; accident. Awful feeling!\n&gt; &gt;\n&gt; &gt; I completely understand and am very grateful that he started this group\n&gt; and is willing to share and let share ideas and files. God forbid he should\n&gt; leave!! I&#39;m not used to looking at video this way so it would be easy for me\n&gt; to miss a lot. I did see the Upside Down Lincoln and the face at the end in\n&gt; the second attachment of &quot;If this is the only one...&quot; I need more practice\n&gt; and a more open mind, I think. This is all so far reaching. Thank goodness\n&gt; he, especially (and the others in this group) are doing this and sharing\n&gt; these ideas. Kudos to Frank for all of his work!\n&gt; &gt;\n&gt; &gt; -Adrienne\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Ursula Kalin\n&gt; &lt;kalinu@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; I&#39;m glad you took another look..hey listen we all are learning\n&gt; here..that message was not solely to you..I never saw you try to correct\n&gt; anyone on what they where hearing but some on here does ALOT...its starting\n&gt; to sound as if they feel like they knew more then anyone and most just\n&gt; started doing this where..Frank,Steve and some other have been doing this\n&gt; for years..Some even have the nerve to try to talk done to Frank..now\n&gt; remember this is the man the made the box..so i just think its insulting and\n&gt; ignorant. I for one will be really pissed of if they ran him from his own\n&gt; group..\n&gt; &gt; &gt;\n&gt; &gt; &gt; --- On Fri, 12/31/10, Adrienne &lt;abortree@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; From: Adrienne &lt;abortree@&gt;\n&gt; &gt; &gt; Subject: [EVP-ITC] Re: The case for faces.\n&gt; &gt; &gt; To: EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;\n&gt; &gt; &gt; Date: Friday, December 31, 2010, 3:23 AM\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; Â\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; Dear Ursula,\n&gt; &gt; &gt;\n&gt; &gt; &gt; Yes I did and I saw it. This is new to me and I&#39;m here to learn so I\n&gt; think I&#39;ll just take it all in for a while and not butt in to what I don&#39;t\n&gt; understand yet, sorry.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Thank you for making me go back and look again.\n&gt; &gt; &gt;\n&gt; &gt; &gt; -Adrienne\n&gt; &gt; &gt;\n&gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Ursula\n&gt; Kalin &lt;kalinu@&gt; wrote:\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; did you see the other ones he posted?\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; --- On Thu, 12/30/10, Adrienne &lt;abortree@&gt; wrote:\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; From: Adrienne &lt;abortree@&gt;\n&gt; &gt; &gt; &gt; Subject: [EVP-ITC] Re: The case for faces.\n&gt; &gt; &gt; &gt; To: EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;\n&gt; &gt; &gt; &gt; Date: Thursday, December 30, 2010, 2:48 AM\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Ã‚Â\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Frank\n&gt; Sumption &lt;purplealiengirl@&gt; wrote:\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; I&#39;m thinking there is faces embedded in sound, it&#39;s related to\n&gt; speech, and\n&gt; &gt; &gt; &gt; &gt; not just EVP. It seems to be a normal function of our own\n&gt; minds(living or\n&gt; &gt; &gt; &gt; &gt; dead), the same as reverse speech. I found some faces in old EVPs\n&gt; from boxes\n&gt; &gt; &gt; &gt; &gt; and also in music files. The ones from Evanescence are pretty\n&gt; impressive in\n&gt; &gt; &gt; &gt; &gt; person, and do not seem to be intentionaly embedded.\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; I know, it&#39;s not ghost hunters, and most don&#39;t want to have to\n&gt; think.\n&gt; &gt; &gt; &gt; &gt; I think most want this stuff in a neat little box, all well\n&gt; defined, all\n&gt; &gt; &gt; &gt; &gt; rules and protocols known, but it just won&#39;t stay in one box, or\n&gt; universe\n&gt; &gt; &gt; &gt; &gt; for that matter.\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; Frank-S\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Dear Frank,\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; I think that I see what you mean. I mean no offense, but I it would\n&gt; be helpful to see something a little more definitive that couldn&#39;t be\n&gt; mistaken for matrixing. Is this possible? Is it just me?\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; - Adrienne\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nYes, wow.. I don' know wha o say.  I' e belonged o he g oup o 3-4 days. You epu a ion and expe ience/expe imen s we e   he main eason and I lea ned a e wa ds o he o he s wi h expe ience.  I can only apologize i my ques ion was he s aw.  Thank you o explaining he his o y, F ank.  So y i 's been so wea ing on you.  Hope you ind wha you' e looking o .\n\nOn Sun, Jan 2, 2011 a 12:39 PM, pu plespace iend pu plealiengi l@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n Well, o one hing, I don' own he g oup anymo e. Due o one o hese incessen a gu men s, I had o back away om his some yea s ago as I almos go i ed becuase ye someone else ha hough hey knew so much mo e o wa ded all my e-mails o my boss. \n\n\n\nThen someone else seemed o be insinua ing ha I may ha e ampe ed wi h he imgaes. Ve y insul ing. This s u goes on an on, ega dless o he quali y o oices, o he images. I ha e eached my sa u a ion poin . The e seems o be no hing mo e o be gained by p esen ing any hing else. Now, I can sympa ize wi h Richa d Robe s!\n\n\n\nThe g oup will con inue, as he e a e a numbe o box and pa ano mal expe s he e ha a e mo e han happy o ell e e yone wha his s u eally is and how i wo ks. \n\nI didn' mean o c ea e bad any eelings.\n\nF-S\n\n--- In EVP-ITC@yahoog oups.com, \"Ad ienne\" w o e:\n>\n> Hi \n> \n> Thank you o ge ing back o me. I hough I had des oyed he g oup by acciden . Aw ul eeling! \n> \n> I comple ely unde s and and am e y g a e ul ha he s a ed his g oup and is willing o sha e and le sha e ideas and iles. God o bid he should lea e!! I'm no used o looking a ideo his way so i would be easy o me o miss a lo . I did see he Upside Down Lincoln and he ace a he end in he second a achmen o \"I his is he only one...\" I need mo e p ac ice and a mo e open mind, I hink. This is all so a eaching. Thank goodness he, especially (and he o he s in his g oup) a e doing his and sha ing hese ideas. Kudos o F ank o all o his wo k!\n\n\n> \n> -Ad ienne\n> \n> --- In EVP-ITC@yahoog oups.com, U sula Kalin w o e:\n> >\n> > I'm glad you ook ano he look..hey lis en we all a e lea ning he e.. ha message was no solely o you..I ne e saw you y o co ec anyone on wha hey whe e hea ing bu some on he e does ALOT...i s s a ing o sound as i hey eel like hey knew mo e hen anyone and mos jus s a ed doing his whe e..F ank,S e e and some o he ha e been doing his o yea s..Some e en ha e he ne e o y o alk done o F ank..now emembe his is he man he made he box..so i jus hink i s insul ing and igno an . I o one will be eally pissed o i hey an him om his own g oup..\n\n\n> > \n> > --- On F i, 12/31/10, Ad ienne w o e:\n> > \n> > \n> > F om: Ad ienne \n> > Subjec : [EVP-ITC] Re: The case o aces.\n> > To: EVP-ITC@yahoog oups.com\n> > Da e: F iday, Decembe 31, 2010, 3:23 AM\n> > \n> > \n> > Â  \n> > \n> > \n> > \n> > Dea U sula,\n> > \n> > Yes I did and I saw i . This is new o me and I'm he e o lea n so I hink I'll jus ake i all in o a while and no bu in o wha I don' unde s and ye , so y.\n> > \n> > Thank you o making me go back and look again.\n> > \n> > -Ad ienne\n> > \n> > --- In EVP-ITC@yahoog oups.com, U sula Kalin w o e:\n> > >\n> > > did you see he o he ones he pos ed?\n> > > \n> > > --- On Thu, 12/30/10, Ad ienne w o e:\n> > > \n> > > \n> > > F om: Ad ienne \n> > > Subjec : [EVP-ITC] Re: The case o aces.\n> > > To: EVP-ITC@yahoog oups.com\n> > > Da e: Thu sday, Decembe 30, 2010, 2:48 AM\n> > > \n> > > \n> > > Ã‚Â  \n> > > \n> > > \n> > > \n> > > \n> > > \n> > > --- In EVP-ITC@yahoog oups.com, F ank Sump ion w o e:\n> > > >\n> > > > I'm hinking he e is aces embedded in sound, i 's ela ed o speech, and\n> > > > no jus EVP. I seems o be a no mal unc ion o ou own minds(li ing o \n> > > > dead), he same as e e se speech. I ound some aces in old EVPs om boxes\n> > > > and also in music iles. The ones om E anescence a e p e y imp essi e in\n> > > > pe son, and do no seem o be in en ionaly embedded.\n> > > > \n> > > > I know, i 's no ghos hun e s, and mos don' wan o ha e o hink.\n> > > > I hink mos wan his s u in a nea li le box, all well de ined, all\n> > > > ules and p o ocols known, bu i jus won' s ay in one box, o uni e se\n> > > > o ha ma e .\n> > > > \n> > > > F ank-S\n> > > >\n> > > Dea F ank,\n> > > \n> > > I hink ha I see wha you mean. I mean no o ense, bu I i would be help ul o see some hing a li le mo e de ini i e ha couldn' be mis aken o ma ixing. Is his possible? Is i jus me?\n> > > \n> > > - Ad ienne\n> > >\n> >\n>"}