{"id": "19893", "subject": "Re: The case for faces.", "author": "draiga1", "timestamp": "2011-01-03T16:42:08Z", "full_text": "I am so sorry to hear this, Frank. And I can&#39;t imagine what would possess anyone to try to send any of this type of research to anyone&#39;s job! That is just plain wrong! This research isn&#39;t entirely accepted among the paranormal folks yet, let alone people who aren&#39;t open to aliens, ghosts, or any other unusual things.\n\nYour box is what started this aspect of research for me. I saw it used on a tv show, and wanted one of my own! I still don&#39;t have a Frank&#39;s box, but feel honored to be on this list with you, and hear the files you&#39;re getting. I don&#39;t understand the nuts and bolts of building a Frank&#39;s box, Steve&#39;s box or Rich&#39;s box, but I am so glad that you guys are out their pushing the envelope in making better and better communication between us and the unseen. \n\nThere are always going to be people who are set in their own ideas, and not accept anything new. Didn&#39;t they used to think the earth was flat? But then there are always going to be pioneers who know there&#39;s more than meets the eye, and keep working at it no matter who says otherwise. It&#39;s the pioneers of any field that allow new discoveries and allow us all to grow from their efforts. Anyway, that&#39;s my 2 cents, and I hope you stay on the list, even if you take a break for awhile.\n\n~Draiga\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  Well, for one thing, I don&#39;t own the group anymore. Due to one of these incessent argurments, I had to back away from this some years ago as I almost got fired becuase yet someone else that thought they knew so much more forwarded all my e-mails to my boss. \n&gt; \n&gt;  Then someone else seemed to be insinuating that I may have tampered with the imgaes. Very insulting. This stuff goes on an on, regardless of the quality of voices, or the images. I have reached my saturation point. There seems to be nothing more to be gained by presenting anything else. Now, I can sympatize with Richard Roberts!\n&gt; \n&gt;  The group will continue, as there are a number of box and paranormal experts here that are more than happy to tell everyone what this stuff really is and how it works. \n&gt; \n&gt;  I didn&#39;t mean to create bad any feelings.\n&gt; \n&gt;  F-S\n&gt;"}