{"id": "19908", "subject": "Re: [EVP-ITC] Not the best box, but it works.", "author": "Frank Sumption", "timestamp": "2011-01-04T23:31:35Z", "full_text": "I spent endless hours listening to ham radio.\n\nF-S\n\nOn Tue, Jan 4, 2011 at 4:07 PM, Mvanah Maloti &lt;inyanga4@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;   I love that you&#39;re able to catch these things, Frank. I can hear the\n&gt; message clearly, but I&#39;ll tell you right now that I would have missed it\n&gt; over and over again during the review.\n&gt;\n&gt; Between you & Hultay, it&#39;s inspiring to see that one is able to attain this\n&gt; level and proficiency of &quot;hearing&quot; when it comes to GB communication (with\n&gt; lots of hard work and thousands of hours of listening, no doubt).\n&gt;\n&gt; It gives me something to look forward to and keep working towards.\n&gt;\n&gt; Thanks for sharing!\n&gt;\n&gt; -JF\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; --- On *Tue, 1/4/11, Frank Sumption &lt;purplealiengirl@...&gt;* wrote:\n&gt;\n&gt;\n&gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt; Subject: [EVP-ITC] Not the best box, but it works. [1 Attachment]\n&gt; To: EVP-ITC@yahoogroups.com, RTSC@yahoogroups.com\n&gt; Date: Tuesday, January 4, 2011, 2:04 PM\n&gt;\n&gt;\n&gt;\n&gt;   This will be hard to hear, it&#39;s not made of the usual bits of words,\n&gt; just mostly out of noise. I can use/do anything else, but tobacco is\n&gt; absolutely forbidden. This was a result of thinking last night that as much\n&gt; second hand smoke as I have to endure, I might as well smoke.\n&gt;\n&gt; F-S\n&gt;\n&gt; \n&gt;\n\nI spen endless hou s lis ening o ham adio.\n \nF-S\nOn Tue, Jan 4, 2011 a 4:07 PM, M anah Malo i inyanga4@...> w o e:\n\n  \n\n\n\n\n\n\n\n\nI lo e ha you' e able o ca ch hese hings, F ank. I can hea he message clea ly, bu I'll ell you igh now ha I would ha e missed i o e and o e again du ing he e iew. \n \nBe ween you & Hul ay, i 's inspi ing o see  ha one is able o a ain his le el and p o iciency o \"hea ing\" when i comes  o GB communica ion (wi h lo s o ha d wo k and housands o hou s o lis ening, no doub ). \n\n \nI gi es me some hing o look o wa d o and keep wo king owa ds. \n \nThanks o sha ing!\n \n-JF\n \n \n \n \n--- On Tue, 1/4/11, F ank Sump ion pu plealiengi l@...> w o e:\nF om: F ank Sump ion pu plealiengi l@...>Subjec : [EVP-ITC] No he bes box, bu i wo ks. [1 A achmen ]\nTo: EVP-ITC@yahoog oups.com, RTSC@yahoog oups.comDa e: Tuesday, Janua y 4, 2011, 2:04 PM \n\n  \n\n\n This will be ha d o hea , i 's no made o he usual bi s o wo ds, jus mos ly ou o noise. I can use/do any hing else, bu obacco is absolu ely o bidden. This was a esul o hinking las nigh ha as much second hand smoke as I ha e o endu e, I migh as well smoke.\n\n \nF-S"}