{"id": "19967", "subject": "Re: [EVP-ITC] Re: Another plane prediction?", "author": "Frank Sumption", "timestamp": "2011-01-08T08:10:41Z", "full_text": "Just the Ten commandos, Gods word, how come they never mention there was\n613 commandments. That many, and you can&#39;t sleep, can&#39;t think, can&#39;t eat,\ncan&#39;t read, can&#39;t question, can&#39;t breed--it&#39;s all fear crap cuz some bozo\nwas trying to guess what some imagined deity wanted. I think the &quot;gods&quot; of\nsumeria are closer to the truth, they went away, and some duffus was trying\nto figure out what we have to do to bring them back.  Only only one thing to\ndo...wait.\n\nF-S\n\nOn Sat, Jan 8, 2011 at 12:43 AM, Ursula Kalin &lt;kalinu@sbcglobal.net&gt; wrote:\n\n&gt;\n&gt;\n&gt;   totally agreed it IS hacked to death..we don&#39;t even have the full\n&gt; version that has been edited time and time again..Don&#39;t get me wrong i\n&gt; believe in God..I&#39;m a spiritualist..but i do not subscribe to everything\n&gt; that comes out of the bible..and if one really no the Bible they wouldn&#39;t\n&gt; either you can&#39;t do this sorta of thing and say ooo I&#39;m soo holy...because\n&gt; in the bible eyes we are sinner..communicating with the dead..that&#39;s why\n&gt; when i see people on here saying Jesus is talking to me it makes you\n&gt; wonder..\n&gt;\n&gt; --- On *Sat, 1/8/11, Frank Sumption &lt;purplealiengirl@...&gt;* wrote:\n&gt;\n&gt;\n&gt; From: Frank Sumption &lt;purplealiengirl@gmail.com&gt;\n&gt; Subject: Re: [EVP-ITC] Re: Another plane prediction?\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Saturday, January 8, 2011, 1:37 AM\n&gt;\n&gt;\n&gt;\n&gt;   Yeah, and funny watching the sci dorks trying to debunk it. I think it&#39;s\n&gt; like biblical, even though I don&#39;t believe in that stuff too much. Not that\n&gt; the bible is wrong, just hacked all to hell.\n&gt;\n&gt; F-S\n&gt;\n&gt; On Fri, Jan 7, 2011 at 9:15 PM, draiga1 &lt;mail@...&lt;http://us.mc1807.mail.yahoo.com/mc/compose?to=mail@...&gt;\n&gt; &gt; wrote:\n&gt;\n&gt;\n&gt;  That&#39;s possible. And what if someone had set off a bomb in the upper\n&gt; atmosphere causing this problem? That&#39;s one of the theories floating around\n&gt; out there on the web. Between the birds, the fish, and the crabs, I don&#39;t\n&gt; know what to think of it all, but your message could have been about that.\n&gt;\n&gt;\n&gt; ~Draiga\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com&lt;http://us.mc1807.mail.yahoo.com/mc/compose?to=EVP-ITC%40yahoogroups.com&gt;,\n&gt; Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; What if it&#39;s a metaphor for the birds dropping out of the air?\n&gt; &gt;\n&gt; http://www.comcast.net/video/2nd-state-experiences-mass-bird-kill/1721461553/Comcast/1722245809/\n&gt; &gt; F-s\n&gt; &gt;\n&gt;\n&gt;\n&gt; \n&gt;\n\nJus   he Ten commandos, Gods wo d, how come hey ne e men ion he e was 613 commandmen s. Tha many, and you can' sleep, can' hink, can' ea , can' ead, can' ques ion, can' b eed--i 's all ea c ap cuz some bozo was ying o guess wha some imagined dei y wan ed. I hink he \"gods\" o sume ia a e close o he u h, hey wen away, and some du us was ying o igu e ou wha we ha e o do o b ing hem back.  Only only one hing o do...wai . \n\n \nF-S\nOn Sa , Jan 8, 2011 a 12:43 AM, U sula Kalin kalinu@...> w o e:\n\n  \n\n\n\n\n\n\n\n o ally ag eed i IS hacked o dea h..we don' e en ha e he ull e sion ha has been edi ed ime and ime again..Don' ge me w ong i belie e in God..I'm a spi i ualis ..bu i do no subsc ibe o e e y hing ha comes ou o he bible..and i one eally no he Bible hey wouldn' ei he you can' do his so a o hing and say ooo I'm soo holy...because in he bible eyes we a e sinne ..communica ing wi h he dead.. ha 's why when i see people on he e saying Jesus is alking o me i makes you wonde ..\n--- On Sa , 1/8/11, F ank Sump ion pu plealiengi l@...> w o e:\nF om: F ank Sump ion pu plealiengi l@...>Subjec : Re: [EVP-ITC] Re: Ano he plane p edic ion?\nTo: EVP-ITC@yahoog oups.comDa e: Sa u day, Janua y 8, 2011, 1:37 AM \n\n  \n\n\n Yeah, and unny wa ching he sci do ks ying o debunk i . I hink i 's like biblical, e en hough I don' belie e in ha s u oo much. No ha he bible is w ong, jus hacked all o hell. \n \nF-S\nOn F i, Jan 7, 2011 a 9:15 PM, d aiga1 mail@...> w o e:\n\n\n  \n\n\n\nTha 's possible. And wha i someone had se o a bomb in he uppe a mosphe e causing his p oblem? Tha 's one o he heo ies loa ing a ound ou he e on he web. Be ween he bi ds, he ish, and he c abs, I don' know wha o hink o i all, bu you message could ha e been abou ha . \n~D aiga--- In EVP-ITC@yahoog oups.com, F ank Sump ion w o e:\n>\n> Wha i i 's a me apho o he bi ds d opping ou o he ai ?> h p://www.comcas .ne / ideo/2nd-s a e-expe iences-mass-bi d-kill/1721461553/Comcas /1722245809/\n> F-s>"}