{"id": "19978", "subject": "Re: [EVP-ITC] Hi everyone..does anyone know anything about this device?", "author": "Zack Widup", "timestamp": "2011-01-08T17:08:31Z", "full_text": "Yeah, when I saw the price it turned me off.\n\nI don&#39;t quite &quot;grok&quot; how the thing is supposed to work. How does it\nknow it&#39;s getting an EVP?  The only way I really know of is to LISTEN.\nSome of the EVP&#39;s I and others have gotten are so close to the noise\nlevel that it takes a little noise floor manipulation to hear them.\n\nZack\n\n\nOn 1/8/11, Mvanah Maloti &lt;inyanga4@...&gt; wrote:\n&gt; It looks like a cool toy, but I&#39;m not sure it would make a whole ton of\n&gt; difference in one&#39;s results, it might even detract from them. Others mileage\n&gt; & opinions may differ, naturally.\n&gt;\n&gt; It seems this device is trying to establish a very loose set of &quot;controls&quot;\n&gt; for capturing and validating EVP, but in my opinion this is the WRONG thing\n&gt; to do in some ways...I think &quot;they&quot; need anomalies, fluctuations and\n&gt; variable conditions for the best communication possible (something box-work\n&gt; provides them, and abundantly at that!).\n&gt;\n&gt; Since working with the boxes I don&#39;t think I could ever go back to white\n&gt; noise EVP and be happy; the sweeping radio is just too effective and light\n&gt; years ahead of what folks were doing even just 10-12 years (and\n&gt; months!) ago, I feel.\n&gt;\n&gt; Where the sweeping radio functions more like a proper telephone (2 way),\n&gt; traditional EVP just feels like I might as well try tying two tin cans\n&gt; together with a string between them and hoping for something useful or\n&gt; interesting to be captured or come through.\n&gt;\n&gt; Box work just feels a lot more proactive and effective to me in every way,\n&gt; shape and form. I can&#39;t think of a single advantage that classical EVP\n&gt; recording & research has or could offer one over the boxes. The skeptics are\n&gt; still going to bitch, moan and continue &quot;debunking&quot; both EVP and Ghost Box\n&gt; communication either way and that&#39;s fine with me, I don&#39;t work for them and\n&gt; I&#39;m not trying to convince anybody, lol.\n&gt;\n&gt; $135.00 could get me another FLIP!  ;)\n&gt;\n&gt; -J\n&gt;\n&gt;\n&gt;\n&gt; --- On Sat, 1/8/11, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;\n&gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt; Subject: Re: [EVP-ITC] Hi everyone..does anyone know anything about this\n&gt; device?\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Saturday, January 8, 2011, 1:16 AM\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;  Oh brother! Based on more of that white noise false assumption crapola. No\n&gt; one gets it, you get more if you just stay home and ask them to come to you.\n&gt; There seems to be a trend of moving backward in technology to the old days\n&gt; of white noise EVP. But what would I know?\n&gt;\n&gt;\n&gt; F-S\n&gt;\n&gt;\n&gt; On Sat, Jan 8, 2011 at 12:47 AM, Ursula &lt;kalinu@...&gt; wrote:\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; http://www.project-reveal.com/#/the-evp-field-processor-efp/4544723250\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;"}