{"id": "20001", "subject": "Re: [EVP-ITC] Re: Another plane prediction?", "author": "Zack Widup", "timestamp": "2011-01-08T20:06:41Z", "full_text": "A bomb in the upper atmosphere would cover a very wide range. It would also\nnot go unnoticed.\n\nI have seen speculation of testing of an electromagnetic weapon such as the\nmillimeter-wave devices talked about a year or so ago in various places.\nThese would be aimed at a specific target area that would not be too big. It\nwould not be noticed by anyone.\n\nZack\n\n\nOn Sat, Jan 8, 2011 at 12:36 PM, Snowfire Lioness &lt;SnowfireL@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;  That&#39;s what David the tech says happened, also there is more oil coming to\n&gt; land now too, but it was some kind of gas shot off that killed the\n&gt; critters.  Sad to see the little animals suffer. sf\n&gt;\n&gt;\n&gt;  -----Original Message-----\n&gt; From: draiga1 &lt;mail@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Fri, Jan 7, 2011 11:15 pm\n&gt; Subject: [EVP-ITC] Re: Another plane prediction?\n&gt;\n&gt;\n&gt;  That&#39;s possible. And what if someone had set off a bomb in the upper\n&gt; atmosphere causing this problem? That&#39;s one of the theories floating around\n&gt; out there on the web. Between the birds, the fish, and the crabs, I don&#39;t\n&gt; know what to think of it all, but your message could have been about that.\n&gt;\n&gt; ~Draiga\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Frank Sumption\n&gt; &lt;purplealiengirl@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; What if it&#39;s a metaphor for the birds dropping out of the air?\n&gt; &gt;\n&gt; http://www.comcast.net/video/2nd-state-experiences-mass-bird-kill/1721461553/Comcast/1722245809/\n&gt; &gt; F-s\n&gt; &gt;\n&gt;\n&gt;     \n&gt;\n\nA bomb in he uppe a mosphe e would co e a e y wide ange. I would also no go unno iced.I ha e seen specula ion o es ing o an elec omagne ic weapon such as he millime e -wa e de ices alked abou a yea o so ago in a ious places. These would be aimed a a speci ic a ge a ea ha would no be oo big. I would no be no iced by anyone.\nZackOn Sa , Jan 8, 2011 a 12:36 PM, Snow i e Lioness Snow i eL@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n \n Tha 's wha Da id he ech says happened, also he e is mo e oil coming o land now oo, bu i was some kind o gas sho o ha killed he c i e s.  Sad o see he li le animals su e . s \n\n\n\n \n\n\n\n\n-----O iginal Message-----\nF om: d aiga1 mail@...>\nTo: EVP-ITC@yahoog oups.com\nSen : F i, Jan 7, 2011 11:15 pm\nSubjec : [EVP-ITC] Re: Ano he plane p edic ion?\n\n \n \n   \n \n \n \nTha 's possible. And wha i someone had se o a bomb in he uppe a mosphe e causing his p oblem? Tha 's one o he heo ies loa ing a ound ou he e on he web. Be ween he bi ds, he ish, and he c abs, I don' know wha o hink o i all, bu you message could ha e been abou ha .\n\n \n ~D aiga\n \n --- In EVP-ITC@yahoog oups.com, F ank Sump ion w o e:\n >\n > Wha i i 's a me apho o he bi ds d opping ou o he ai ?\n > h p://www.comcas .ne / ideo/2nd-s a e-expe iences-mass-bi d-kill/1721461553/Comcas /1722245809/\n\n > F-s\n >"}