{"id": "20223", "subject": "I know, old news, and everyone knows better.", "author": "Frank Sumption", "timestamp": "2011-01-13T18:05:30Z", "full_text": "I get this stuff over and over and over and over and over... and I can see\nno reason why the new age gurus proclaiming 2012 will be a great and hppy\ntransformation are any more correct, or valid. They spout only an opinion,\nan opinioin of denial of all facts, and none of the ancient prophecies from\naround the world say &quot;and they all lived happily ever after&quot;. I would prefer\nto cross over conciously, not with my head up my butt hoping the outside\nworld is really a paradise. No one wants to face the possiblity, just like\nthe commercial, maybe we should chug on over to mambe pambe land and get you\nsome backbone! We all know life is forever through EVP and spirit\ncommunication, so in a way it&#39;s a transformation to higher conciousness, but\nI think ya have to be aware. Everyone runing around trying to figure out\nwhat the ancients were trying to &quot;tell us&quot;--dah, a simple message, wake the\nf---- up!\n\n They keep telling me I have to leave--what? Just jump off!? WFT is that?\n\nAnyway, I would not say it is 100%, and when 2013 comes, I will burn every\nfrikkin&#39; box I have and move on to something else.\n\nF-S\n\nI ge his s u o e and o e and o e and o e and o e ... and I can see no eason why he new age gu us p oclaiming 2012 will be a g ea and hppy ans o ma ion a e any mo e co ec , o alid. They spou only an opinion, an opinioin o denial o all ac s, and none o he ancien p ophecies om a ound he wo ld say \"and hey all li ed happily e e a e \". I would p e e o c oss o e conciously, no wi h my head up my bu hoping he ou side wo ld is eally a pa adise. No one wan s o ace he possibli y, jus like he comme cial, maybe we should chug on o e o mambe pambe land and ge you some backbone! We all know li e is o e e h ough EVP and spi i communica ion, so in a way i 's a ans o ma ion o highe conciousness, bu I hink ya ha e o be awa e. E e yone uning a ound ying o igu e ou wha he ancien s we e ying o \" ell us\"--dah, a simple message, wake he ---- up! \n\n \n They keep elling me I ha e o lea e--wha ? Jus jump o !? WFT is ha ?\n \nAnyway, I would no say i is 100%, and when 2013 comes, I will bu n e e y ikkin' box I ha e and mo e on o some hing else. \n \nF-S"}