{"id": "20230", "subject": "Re: [EVP-ITC] AM VERSUS FM FOR EVP COMMUNICATION", "author": "Frank Sumption", "timestamp": "2011-01-13T21:44:07Z", "full_text": "What,ya mean bitch and moan all the time ;-0.\n\n My guys use what even I use, AM is extremely noisy here , so I have to use\nFM most of the time. AM/FM, EVPmaker, manual, linear, random, radio between\nstations, white noise...don&#39;t matter.\n\nF-S\n\nOn Thu, Jan 13, 2011 at 9:56 AM, Mvanah Maloti &lt;inyanga4@yahoo.com&gt; wrote:\n\n&gt;\n&gt;\n&gt;   Cool...not sure what that means exactly, lol.  ;)\n&gt;\n&gt; Should we all do what FS does then? Is that better?\n&gt;\n&gt; Just asking.\n&gt;\n&gt; I&#39;m not quite sure what taking a few moments to get clear and centered\n&gt; before a box session could hurt...or how swinging a pendulum for 30 seconds\n&gt; while adjusting my scans makes it &quot;overly serious&quot;, but what do I know?\n&gt;\n&gt; I didn&#39;t invent the things.\n&gt;\n&gt; -J\n&gt;\n&gt; --- On *Tue, 1/11/11, Frank Sumption &lt;purplealiengirl@...&gt;* wrote:\n&gt;\n&gt;\n&gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt; Subject: Re: [EVP-ITC] AM VERSUS FM FOR EVP COMMUNICATION\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Tuesday, January 11, 2011, 11:00 PM\n&gt;\n&gt;\n&gt;  Weird how I invented the stuff, and don&#39;t take so serious.\n&gt;\n&gt; F-S\n&gt;\n&gt; On Tue, Jan 11, 2011 at 1:02 PM, Mvanah Maloti &lt;inyanga4@...m&lt;http://us.mc1110.mail.yahoo.com/mc/compose?to=inyanga4@...&gt;\n&gt; &gt; wrote:\n&gt;\n&gt;\n&gt;     I use both though I personally prefer using AM.\n&gt;\n&gt; A lot of it depends on the device being used, its range and reception, the\n&gt; resulting audio clarity and what &quot;they&quot; wish for me to use as well.\n&gt;\n&gt; Many times the ones I speak to and work with will give me specifics and ask\n&gt; me to adjust my sweep speeds, the specific scans and programs available to\n&gt; them or even just to switch from AM to FM and vice versa.\n&gt;\n&gt; To find the most optimal scanning rates and audio settings I prefer to use\n&gt; dowsing (with pendulums, L-Rods, an aurameter, etc), applied kinesiology and\n&gt; muscle testing. Before my box sessions and recordings I always spend some\n&gt; time (a few minutes, at least) in meditation...nothing too involved or\n&gt; outrageous...just enough to get clear, become centered, grounded, focused,\n&gt; open, receptive and properly attuned to subtle beings and energies.\n&gt;\n&gt; Once I&#39;ve entered a state of relaxed focused awareness (very similar to\n&gt; meditation or self hypnosis) I&#39;ll go ahead and connect with a higher energy\n&gt; field, my ancestors or the spirit world in general and begin the process of\n&gt; dowsing while posing my questions, mentally or aloud, to find the best\n&gt; possible combination of bands, scans, sweep rates, volume, distance and\n&gt; other factors which all contribute to great recordings and helpful,\n&gt; empowering, inspiring and positive exchanges with those in Spirit.\n&gt;\n&gt; -J\n&gt;\n&gt; --- On *Tue, 1/11/11, mart &lt;littlegreys@...&lt;http://us.mc1110.mail.yahoo.com/mc/compose?to=littlegreys@...&gt;\n&gt; &gt;* wrote:\n&gt;\n&gt;\n&gt; From: mart &lt;littlegreys@...&lt;http://us.mc1110.mail.yahoo.com/mc/compose?to=littlegreys@...&gt;\n&gt; &gt;\n&gt; Subject: [EVP-ITC] AM VERSUS FM FOR EVP COMMUNICATION\n&gt; To: EVP-ITC@yahoogroups.com&lt;http://us.mc1110.mail.yahoo.com/mc/compose?to=EVP-ITC@yahoogroups.com&gt;\n&gt; Date: Tuesday, January 11, 2011, 11:43 AM\n&gt;\n&gt;\n&gt;\n&gt; Im wondering what most people use for evp reception\n&gt; Which do you work on most AM or FM for evp personally i prefer the fm band\n&gt; i find there is less radio interference and the voices seem to be clearer\n&gt; has anyone tried the short-wave frequencies\n&gt;\n&gt;\n&gt; \n&gt;\n\nWha ,ya mean bi ch and moan all he ime ;-0.\n \n My guys use wha e en I use, AM is ex emely noisy he e , so I ha e o use FM mos o he ime. AM/FM, EVPmake , manual, linea , andom, adio be ween s a ions, whi e noise...don' ma e . \n \nF-S\nOn Thu, Jan 13, 2011 a 9:56 AM, M anah Malo i inyanga4@...> w o e:\n\n  \n\n\n\n\n\n\n\n\nCool...no su e wha ha means exac ly, lol.  ;)\n \nShould we all do wha FS does hen? Is ha be e ? \n \nJus asking. \n \nI'm no qui e su e wha aking a ew momen s o ge clea and cen e ed be o e a box session could hu ...o how swinging a pendulum o 30 seconds while adjus ing my scans makes i \"o e ly se ious\", bu wha do I know? \n\n \nI didn' in en he hings.  \n \n-J--- On Tue, 1/11/11, F ank Sump ion pu plealiengi l@...> w o e:\nF om: F ank Sump ion pu plealiengi l@...>Subjec : Re: [EVP-ITC] AM VERSUS FM FOR EVP COMMUNICATION\nTo: EVP-ITC@yahoog oups.comDa e: Tuesday, Janua y 11, 2011, 11:00 PM\n  \n\n\nWei d how I in en ed he s u , and don' ake so se ious. \n \nF-S\nOn Tue, Jan 11, 2011 a 1:02 PM, M anah Malo i inyanga4@...> w o e:\n\n\n  \n\n\n\n\n\n\n\n\nI use bo h hough I pe sonally p e e using AM. \n \nA lo o i depends on he de ice being used, i s ange and ecep ion, he esul ing audio cla i y and wha \" hey\" wish o me o use as well. \n \nMany imes  he ones I speak o and wo k wi h will gi e me speci ics and ask me  o adjus my sweep speeds, he speci ic scans and p og ams a ailable o hem o e en jus   o swi ch om AM o FM and ice e sa. \n\n \nTo ind he mos op imal scanning a es and audio se ings I p e e o use dowsing (wi h pendulums, L-Rods, an au ame e , e c), applied kinesiology and muscle es ing. Be o e my box sessions and eco dings I always spend some ime (a ew minu es, a leas ) in medi a ion...no hing oo in ol ed o ou ageous...jus enough o ge clea , become cen e ed, g ounded, ocused, open, ecep i e and p ope ly a uned o sub le beings and ene gies. \n\n \nOnce I' e en e ed a s a e o elaxed ocused awa eness ( e y simila o medi a ion o sel hypnosis) I'll go ahead and connec wi h a highe  ene gy ield, my ances o s o he spi i wo ld in gene al and begin he p ocess o dowsing while posing my ques ions, men ally o aloud, o ind he bes possible combina ion o bands, scans, sweep a es, olume, dis ance and o he ac o s which all con ibu e o g ea eco dings and help ul, empowe ing, inspi ing and posi i e exchanges wi h hose in Spi i .\n\n \n-J --- On Tue, 1/11/11, ma li leg eys@ho mail.com> w o e:\nF om: ma li leg eys@...>\nSubjec : [EVP-ITC] AM VERSUS FM FOR EVP COMMUNICATIONTo: EVP-ITC@yahoog oups.comDa e: Tuesday, Janua y 11, 2011, 11:43 AM \n\n  \n\nIm wonde ing wha mos people use o e p ecep ionWhich do you wo k on mos AM o FM o e p pe sonally i p e e he m band i ind he e is less adio in e e ence and he oices seem o be clea e has anyone ied he sho -wa e equencies"}