{"id": "20245", "subject": "Re: I know, old news, and everyone knows better. [2 Attachments]", "author": "Urkel23", "timestamp": "2011-01-14T01:09:51Z", "full_text": "?\n\n\n\n--- In EVP-ITC@yahoogroups.com, Mvanah Maloti &lt;inyanga4@...&gt; wrote:\n&gt;\n&gt; &quot;Weird how I invented the stuff, and don&#39;t take so serious.&quot; \n&gt;  \n&gt; (Just a friendly reminder)\n&gt;  \n&gt; -J\n&gt;  \n&gt;  \n&gt;  \n&gt;  \n&gt; --- On Thu, 1/13/11, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt; \n&gt; \n&gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt; Subject: [EVP-ITC] I know, old news, and everyone knows better. [2 Attachments]\n&gt; To: EVP-ITC@yahoogroups.com, RTSC@yahoogroups.com\n&gt; Date: Thursday, January 13, 2011, 11:05 AM\n&gt; \n&gt; \n&gt;   \n&gt; \n&gt; \n&gt; [Attachment(s) from Frank Sumption included below] \n&gt; \n&gt;  I get this stuff over and over and over and over and over... and I can see no reason why the new age gurus proclaiming 2012 will be a great and hppy transformation are any more correct, or valid. They spout only an opinion, an opinioin of denial of all facts, and none of the ancient prophecies from around the world say &quot;and they all lived happily ever after&quot;. I would prefer to cross over conciously, not with my head up my butt hoping the outside world is really a paradise. No one wants to face the possiblity, just like the commercial, maybe we should chug on over to mambe pambe land and get you some backbone! We all know life is forever through EVP and spirit communication, so in a way it&#39;s a transformation to higher conciousness, but I think ya have to be aware. Everyone runing around trying to figure out what the ancients were trying to &quot;tell us&quot;--dah, a simple message, wake the f---- up! \n&gt;  \n&gt;  They keep telling me I have to leave--what? Just jump off!? WFT is that?\n&gt;  \n&gt; Anyway, I would not say it is 100%, and when 2013 comes, I will burn every frikkin&#39; box I have and move on to something else. \n&gt;  \n&gt; F-S\n&gt;"}