{"id": "20268", "subject": "Re: [EVP-ITC] Hello", "author": "Frank Sumption", "timestamp": "2011-01-18T07:13:58Z", "full_text": "Yes, I remember Steve! There&#39;s still the occasional argument and\ndebunker/skeptic that shows up from time to time, and I have my moods in my\nold age.\n\n My focus has always been just the boxes, Just trying to make the stuff\nkeeps me too busy. I don&#39;t have alot of interested in haunted objects or\nlocations, but thanks to TV, like Ghost Hunters, and ghost adventures, I see\nenough to make me wonder, plus discussions here.\n\nFrank-S\n\nOn Sun, Jan 16, 2011 at 2:36 PM, steve gunn &lt;steve@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Hi Frank, hi group I&#39;m glad to see there&#39;s a place this topic can be\n&gt; discussed without the nasty junk I&#39;ve seen spouted in a few places on the\n&gt; web and Frank I&#39;m sorry to see you have to suffer that my friend you do not\n&gt; deserve it..\n&gt;\n&gt; I closed the old forum where Frank kindly came along and shared his\n&gt; information with us a few years ago but great to see this forum and thanks\n&gt; for accepting me..\n&gt;\n&gt; We do work with haunted dolls and spirits. My wife has 100 plus dolls and a\n&gt; non commercial site haunteddolls.net where we show them and talk about\n&gt; them. The few EVP&#39;s are a little out of date - they were got in the usual\n&gt; way but it would be cool to have a ghost box because the spiritual events in\n&gt; this place are 24/7..\n&gt;\n&gt; Apologies if I&#39;ve missed it and there&#39;s already a post on the subject but\n&gt; whats the best approach to a randomly scanning receiver as opposed to one\n&gt; that just scans sequentially ?\n&gt;\n&gt; Thanks ! Steve Gunn\n&gt;\n&gt; \n&gt;\n\nYes, I emembe S e e! The e's s ill he occasional a gumen and debunke /skep ic ha shows up om ime o ime, and I ha e my moods in my old age.\n \n My ocus has always been jus   he boxes, Jus ying o make he s u keeps me oo busy. I don' ha e alo  o in e es ed in haun ed objec s o loca ions, bu hanks o TV, like Ghos Hun e s, and ghos ad en u es, I see enough o make me wonde , plus discussions he e. \n\n \nF ank-S\nOn Sun, Jan 16, 2011 a 2:36 PM, s e e gunn s e e@...> w o e:\n\n  \n\n\n\nHi F ank, hi g oup I'm glad o see he e's a place his opic can be discussed wi hou he nas y junk I' e seen spou ed in a ew places on he web and F ank I'm so y o see you ha e o su e ha my iend you do no dese e i ..\nI closed he old o um whe e F ank kindly came along and sha ed his in o ma ion wi h us a ew yea s ago bu g ea o see his o um and hanks o accep ing me..We do wo k wi h haun ed dolls and spi i s. My wi e has 100 plus dolls and a non comme cial si e haun eddolls.ne whe e we show hem and alk abou hem. The ew EVP's a e a li le ou o da e - hey we e go in he usual way bu i would be cool o ha e a ghos box because he spi i ual e en s in his place a e 24/7..\nApologies i I' e missed i and he e's al eady a pos on he subjec bu wha s he bes app oach o a andomly scanning ecei e as opposed o one ha jus scans sequen ially ? Thanks ! S e e Gunn"}