{"id": "20269", "subject": "Re: Hello", "author": "steve gunn", "timestamp": "2011-01-18T14:22:18Z", "full_text": "Hi Frank nice to hear from you,\n\nGlad to hear your still working on the boxes - same here I don&#39;t do hauntings and such just help my wife work with her dolls, many of whom are disturbed spirits donated to us to calm and help and we do..more than 100 of them at the last count. \n\nWe get a lot from them psychically but as I do all that metaphysical stuff professionally which takes up most of my time, then I was thinking that with a box she wouldnt need to depend on my availibility so much to work with the dolls. \n \nI was thinking perhaps of making something. Haven&#39;t done any electronice for a few decades but I thought I&#39;d give it a go..\nI know most of the principles I was hoping to get some practical advise from the forum.\n\nCheers \n\nSteve\n  \n\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  Yes, I remember Steve! There&#39;s still the occasional argument and\n&gt; debunker/skeptic that shows up from time to time, and I have my moods in my\n&gt; old age.\n&gt; \n&gt;  My focus has always been just the boxes, Just trying to make the stuff\n&gt; keeps me too busy. I don&#39;t have alot of interested in haunted objects or\n&gt; locations, but thanks to TV, like Ghost Hunters, and ghost adventures, I see\n&gt; enough to make me wonder, plus discussions here.\n&gt; \n&gt; Frank-S\n&gt; \n&gt; On Sun, Jan 16, 2011 at 2:36 PM, steve gunn &lt;steve@...&gt; wrote:\n&gt; \n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Hi Frank, hi group I&#39;m glad to see there&#39;s a place this topic can be\n&gt; &gt; discussed without the nasty junk I&#39;ve seen spouted in a few places on the\n&gt; &gt; web and Frank I&#39;m sorry to see you have to suffer that my friend you do not\n&gt; &gt; deserve it..\n&gt; &gt;\n&gt; &gt; I closed the old forum where Frank kindly came along and shared his\n&gt; &gt; information with us a few years ago but great to see this forum and thanks\n&gt; &gt; for accepting me..\n&gt; &gt;\n&gt; &gt; We do work with haunted dolls and spirits. My wife has 100 plus dolls and a\n&gt; &gt; non commercial site haunteddolls.net where we show them and talk about\n&gt; &gt; them. The few EVP&#39;s are a little out of date - they were got in the usual\n&gt; &gt; way but it would be cool to have a ghost box because the spiritual events in\n&gt; &gt; this place are 24/7..\n&gt; &gt;\n&gt; &gt; Apologies if I&#39;ve missed it and there&#39;s already a post on the subject but\n&gt; &gt; whats the best approach to a randomly scanning receiver as opposed to one\n&gt; &gt; that just scans sequentially ?\n&gt; &gt;\n&gt; &gt; Thanks ! Steve Gunn\n&gt; &gt;\n&gt; &gt; \n&gt; &gt;\n&gt;"}