{"id": "20289", "subject": "Re: Talking fish", "author": "Adriana Jones", "timestamp": "2011-01-19T06:13:25Z", "full_text": "Not sure if my last post posted, the one in which I said that K. Stollznow unfriended me on Facebook when I replied to Frank&#39;s fish post on her wall... I knew she would unfriend me, if I said too much on her wall, and I wanted to see how much it would take.  It didn&#39;t take long at all.  Four posts on my behalf.  I&#39;m pretty much convinced now that Karen not only DOES hear what we hear, but that she is intentionally trying to keep the truth hidden. What else can you do when you make your money by being the Skepbitch.... It baffles me how some people can walk and function through an entire lifetime with such a nefarious spirit inside them... it goes beyond frightening to just plain confusing... maybe she&#39;s one of those people that woman talks about in that book &quot;The Sociopath Next Door&quot;.  People like that are not meant to be understood, the only thing you can do is avoid them to the best of your ability.  Like I&#39;ve said before Frank (and I didn&#39;t listen to my own advice), the best thing we can do for everyone and ourselves, is to simply avoid that woman like the plague.  Ironically, we&#39;re the ones pursuing her and she&#39;s the one trying to avoid US like the plague, it seems.  I guess that&#39;s what you gotta do when you&#39;re running away from the truth.\n\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  Told Skepbitch about this one, she say it just coincidence. Guess that&#39;s\n&gt; the standard answer. I do a video of frying fish while holding a ghost box\n&gt; and a voice over the radio just happens to talk about fish talking, just how\n&gt; common would that be, and what&#39;s the chances of catching that at that\n&gt; moment?--Skeptic idiots! Yeah, that&#39;ll make this go away.\n&gt; \n&gt;  I was thinking about the fish talking, but I said nothing.\n&gt; \n&gt; F-S\n&gt;"}