{"id": "20282", "subject": "Re: [EVP-ITC] Re: Hello/Haunted dolls (Steve G)", "author": "Ursula Kalin", "timestamp": "2011-01-19T03:10:11Z", "full_text": "--0-177908981-1295406611=:80030\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nhi steve went to the site couldn&#39;t find where to email her diectly..are the=\r\n links at the bottom where you can purchase \n\n--- On Tue, 1/18/11, steve gu=\r\nnn &lt;steve@...&gt; wrote:\n\n\nFrom: steve gunn &lt;steve@...&gt;\nSu=\r\nbject: [EVP-ITC] Re: Hello/Haunted dolls (Steve G)\nTo: EVP-ITC@yahoogroups.=\r\ncom\nDate: Tuesday, January 18, 2011, 7:36 PM\n\n\n=C2=A0 \n\n\n\nHello CB,\n\nIts my=\r\n wife who gets the dolls, originally she bought a few from ebay. She&#39;s a se=\r\nnsitive and I do all the metaphysical stuff so between us we tune in and se=\r\ne what we get thats how we buy them..\n\nMost people can tune in and sense so=\r\nmething it just takes practise. The human instrument is the most sensitive =\r\ninstrument for spirits but the challenge is to remove yourself from that gr=\r\neat noise generator - the brain and learn to listen with your intuition. Ta=\r\nkes practise but just try it..\n\nOver time we&#39;ve helped other people who&#39;ve =\r\nhad problems with dolls and she and her site have become very well known an=\r\nd people have donated dolls etc so we have a house full of them. Its primar=\r\nily her interest Im just recruited to read them or channel and she also use=\r\ns electronic means for that like convnetional EVP but I&#39;ve decided to build=\r\n something in the ITC mode to give her that facility too as she&#39;s very inte=\r\nrested..\n\nEbay nowadays is full of absolute junk so we would always immedia=\r\ntely dismiss anything that says &quot;very haunted doll guaranteed the best ever=\r\n&quot; and all that nonsense.. I know that for this reason she&#39;s considered offe=\r\nring her site for the sale of dolls that we know are genuine and perhaps ac=\r\nt as at least some vetting of whats genuine and what isnt. She also sometim=\r\nes sells the odd one thats been donated to her and gives the money to an an=\r\nimal charity..\n\nYou can always email her and ask her directly and sometimes=\r\n she&#39;ll offer you her opinion on ones advertized on ebay and tell you who t=\r\nhe best sellers are as she knows the good ones.. http://haunteddolls.net\n\nS=\r\nteve \n\n\n--- In EVP-ITC@yahoogroups.com, &quot;Country&quot; &lt;countrybumpkin1956@...&gt; =\r\nwrote:\n&gt;\n&gt; Hello Steve:\n&gt; I noticed in your post you mentioned having haunt=\r\ned dolls. Where and how\n&gt; do you find a haunted doll? How do you know a dol=\r\nl is haunted, what do\n&gt; you look for (for example, if it is in a flea marke=\r\nt)? Have you ever\n&gt; purchased on from Ebay? [:-/]\n&gt; Cheers,\n&gt; CB\n&gt;\n\n\n\n\n\n\n\r\n--0-177908981-1295406611=:80030\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;FONT size=3D4&gt;hi steve went to the site coul=\r\ndn&#39;t find where to email her diectly..are the links at the bottom where you=\r\n can purchase &lt;/FONT&gt;&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Tue, 1/18/11, steve gunn &lt;I&gt;&lt;stev=\r\ne@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;\n&lt;BLOCKQUOTE style=3D&quot;BORDER-LEFT: rg=\r\nb(16,16,255) 2px solid; PADDING-LEFT: 5px; MARGIN-LEFT: 5px&quot;&gt;&lt;BR&gt;From: stev=\r\ne gunn &lt;steve@...&gt;&lt;BR&gt;Subject: [EVP-ITC] Re: Hello/Haunted =\r\ndolls (Steve G)&lt;BR&gt;To: EVP-ITC@yahoogroups.com&lt;BR&gt;Date: Tuesday, January 18=\r\n, 2011, 7:36 PM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3Dyiv340543159&gt;&lt;SPAN style=3D&quot;DISPLAY: none=\r\n&quot;&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV id=3Dyiv340543159ygrp-text&gt;\n&lt;DIV&gt;Hello CB,&lt;BR&gt;&lt;BR&gt;Its=\r\n my wife who gets the dolls, originally she bought a few from ebay. She&#39;s a=\r\n sensitive and I do all the metaphysical stuff so between us we tune in and=\r\n see what we get thats how we buy them..&lt;BR&gt;&lt;BR&gt;Most people can tune in and=\r\n sense something it just takes practise. The human instrument is the most s=\r\nensitive instrument for spirits but the challenge is to remove yourself fro=\r\nm that great noise generator - the brain and learn to listen with your intu=\r\nition. Takes practise but just try it..&lt;BR&gt;&lt;BR&gt;Over time we&#39;ve helped other=\r\n people who&#39;ve had problems with dolls and she and her site have become ver=\r\ny well known and people have donated dolls etc so we have a house full of t=\r\nhem. Its primarily her interest Im just recruited to read them or channel a=\r\nnd she also uses electronic means for that like convnetional EVP but I&#39;ve d=\r\necided to build something in the ITC mode to give her that facility too as =\r\nshe&#39;s very interested..&lt;BR&gt;&lt;BR&gt;Ebay\n nowadays is full of absolute junk so w=\r\ne would always immediately dismiss anything that says &quot;very haunted doll gu=\r\naranteed the best ever&quot; and all that nonsense.. I know that for this reason=\r\n she&#39;s considered offering her site for the sale of dolls that we know are =\r\ngenuine and perhaps act as at least some vetting of whats genuine and what =\r\nisnt. She also sometimes sells the odd one thats been donated to her and gi=\r\nves the money to an animal charity..&lt;BR&gt;&lt;BR&gt;You can always email her and as=\r\nk her directly and sometimes she&#39;ll offer you her opinion on ones advertize=\r\nd on ebay and tell you who the best sellers are as she knows the good ones.=\r\n. &lt;A href=3D&quot;http://haunteddolls.net/&quot; rel=3Dnofollow target=3D_blank&gt;http:=\r\n//haunteddolls.net&lt;/A&gt;&lt;BR&gt;&lt;BR&gt;Steve &lt;BR&gt;&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=3D&quot;http://us=\r\n.mc1807.mail.yahoo.com/mc/compose?to=3DEVP-ITC%40yahoogroups.com&quot; rel=3Dnof=\r\nollow target=3D_blank ymailto=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@=\r\nyahoogroups.com&lt;/A&gt;, &quot;Country&quot;\n &lt;countrybumpkin1956@...&gt; wrote:&lt;BR&gt;&g=\r\nt;&lt;BR&gt;&gt; Hello Steve:&lt;BR&gt;&gt; I noticed in your post you mentioned having=\r\n haunted dolls. Where and how&lt;BR&gt;&gt; do you find a haunted doll? How do yo=\r\nu know a doll is haunted, what do&lt;BR&gt;&gt; you look for (for example, if it =\r\nis in a flea market)? Have you ever&lt;BR&gt;&gt; purchased on from Ebay? [:-/]&lt;B=\r\nR&gt;&gt; Cheers,&lt;BR&gt;&gt; CB&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/t=\r\nd&gt;&lt;/tr&gt;&lt;/table&gt;\r\n--0-177908981-1295406611=:80030--"}