{"id": "20284", "subject": "Re: Hello/Haunted dolls (Steve G)", "author": "steve gunn", "timestamp": "2011-01-19T03:17:15Z", "full_text": "I see the forum software filtered the email address  its kim@ and the name of the site \n\n--- In EVP-ITC@yahoogroups.com, &quot;steve gunn&quot; &lt;steve@...&gt; wrote:\n&gt;\n&gt; The email is right at the bottom of the intro text on the front page its kim@...  \n&gt; \n&gt; At the moment its not a commercial site but she does sometimes sell to people she knows will respect the doll and look after it. Just email her she&#39;s very happy to assist people with doll queries.. Steve\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Ursula Kalin &lt;kalinu@&gt; wrote:\n&gt; &gt;\n&gt; &gt; hi steve went to the site couldn&#39;t find where to email her diectly..are the links at the bottom where you can purchase \n&gt; &gt; \n&gt; &gt; --- On Tue, 1/18/11, steve gunn &lt;steve@&gt; wrote:\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; From: steve gunn &lt;steve@&gt;\n&gt; &gt; Subject: [EVP-ITC] Re: Hello/Haunted dolls (Steve G)\n&gt; &gt; To: EVP-ITC@yahoogroups.com\n&gt; &gt; Date: Tuesday, January 18, 2011, 7:36 PM\n&gt; &gt; \n&gt; &gt; \n&gt; &gt;   \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; Hello CB,\n&gt; &gt; \n&gt; &gt; Its my wife who gets the dolls, originally she bought a few from ebay. She&#39;s a sensitive and I do all the metaphysical stuff so between us we tune in and see what we get thats how we buy them..\n&gt; &gt; \n&gt; &gt; Most people can tune in and sense something it just takes practise. The human instrument is the most sensitive instrument for spirits but the challenge is to remove yourself from that great noise generator - the brain and learn to listen with your intuition. Takes practise but just try it..\n&gt; &gt; \n&gt; &gt; Over time we&#39;ve helped other people who&#39;ve had problems with dolls and she and her site have become very well known and people have donated dolls etc so we have a house full of them. Its primarily her interest Im just recruited to read them or channel and she also uses electronic means for that like convnetional EVP but I&#39;ve decided to build something in the ITC mode to give her that facility too as she&#39;s very interested..\n&gt; &gt; \n&gt; &gt; Ebay nowadays is full of absolute junk so we would always immediately dismiss anything that says &quot;very haunted doll guaranteed the best ever&quot; and all that nonsense.. I know that for this reason she&#39;s considered offering her site for the sale of dolls that we know are genuine and perhaps act as at least some vetting of whats genuine and what isnt. She also sometimes sells the odd one thats been donated to her and gives the money to an animal charity..\n&gt; &gt; \n&gt; &gt; You can always email her and ask her directly and sometimes she&#39;ll offer you her opinion on ones advertized on ebay and tell you who the best sellers are as she knows the good ones.. http://haunteddolls.net\n&gt; &gt; \n&gt; &gt; Steve \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;Country&quot; &lt;countrybumpkin1956@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; Hello Steve:\n&gt; &gt; &gt; I noticed in your post you mentioned having haunted dolls. Where and how\n&gt; &gt; &gt; do you find a haunted doll? How do you know a doll is haunted, what do\n&gt; &gt; &gt; you look for (for example, if it is in a flea market)? Have you ever\n&gt; &gt; &gt; purchased on from Ebay? [:-/]\n&gt; &gt; &gt; Cheers,\n&gt; &gt; &gt; CB\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}