{"id": "20281", "subject": "Re: Hello/Haunted dolls (Steve G)", "author": "harpo103", "timestamp": "2011-01-19T03:09:48Z", "full_text": "Steve Hultay and I saw John Zaffis a couple of months ago at a local college here in N.J.\nJohn built a barn behind his house in Connecticut which houses all sorts of items which he said are haunted. People have given him these things when their purchase brought upon their new owners all sorts of weird mojo.\nHe also has dolls, marionettes and a VERY sinister-looking ventriloquist puppet named Simon.\nCheck out his site at johnzaffis.com  \n\n--- In EVP-ITC@yahoogroups.com, &quot;steve gunn&quot; &lt;steve@...&gt; wrote:\n&gt;\n&gt; Hello CB,\n&gt; \n&gt; Its my wife who gets the dolls, originally she bought a few from ebay. She&#39;s a sensitive and I do all the metaphysical stuff so between us we tune in and see what we get thats how we buy them..\n&gt; \n&gt; Most people can tune in and sense something it just takes practise. The human instrument is the most sensitive instrument for spirits but the challenge is to remove yourself from that great noise generator - the brain and learn to listen with your intuition. Takes practise but just try it..\n&gt; \n&gt; Over time we&#39;ve helped other people who&#39;ve had problems with dolls and she and her site have become very well known and people have donated dolls etc so we have a house full of them. Its primarily her interest Im just recruited to read them or channel and she also uses electronic means for that like convnetional EVP but I&#39;ve decided to build something in the ITC mode to give her that facility too as she&#39;s very interested..\n&gt; \n&gt; Ebay nowadays is full of absolute junk so we would always immediately dismiss anything that says &quot;very haunted doll guaranteed the best ever&quot; and all that nonsense.. I know that for this reason she&#39;s considered offering her site for the sale of dolls that we know are genuine and perhaps act as at least some vetting of whats genuine and what isnt.  She also sometimes sells the odd one thats been donated to her and gives the money to an animal charity..\n&gt; \n&gt; You can always email her and ask her directly and sometimes she&#39;ll offer you her opinion on ones advertized on ebay and tell you who the best sellers are as she knows the good ones.. http://haunteddolls.net\n&gt; \n&gt; Steve \n&gt;     \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Country&quot; &lt;countrybumpkin1956@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hello Steve:\n&gt; &gt; I noticed in your post you mentioned having haunted dolls. Where and how\n&gt; &gt; do you find a haunted doll? How do you know a doll is haunted, what do\n&gt; &gt; you look for (for example, if it is in a flea market)? Have you ever\n&gt; &gt; purchased on from Ebay? [:-/]\n&gt; &gt; Cheers,\n&gt; &gt; CB\n&gt; &gt;\n&gt;"}