{"id": "20298", "subject": "Re: Talking fish", "author": "Adriana Jones", "timestamp": "2011-01-19T17:53:35Z", "full_text": "&quot;Science in this country is mostly out dated dogma that they pass off a absolute irrefutable gospel truth that must not be questioned, as if all is known, and all has been discovered.&quot;\n\nThis is so true.  Exhibit A: Our medical system.  When Dave and I went to my parents over the holidays I was rummaging through their spare room (which my dad keeps saying he&#39;ll clean up but probably never will), and I found a book called Murder by Injection: The Story of the Medical Conspiracy Against America, by Eustace Mullins, signed by the author, that a friend of the family gave us.  This friend was an alternative medicine enthusiast, like my uncle, mom, grandparents and myself.  I thank God I was surrounded by people like that growing up.  Dave has read the book in entirety, I still haven&#39;t read but the first couple chapters, but in this book it talks about how the American Medical Association many decades ago conspired to squish the homeopathic school of thought, and that&#39;s why the allopathic school of thought dominates American medicine today, even though homeopathy has been shown to be more effective in the treatment of many ailments.  This way they can concoct expensive pharmaceutical drugs against everything under the sun, so they can rob us dry, while keeping us ill.  A few years ago I was &quot;diagnosed&quot; with interstitial cystitis after an unnecessary bladder hydrodistension under general anesthesia (boy, that stuff knocks you out quickly!!!) and I was offered a possible lifetime sentence of an experimental drug with many side effects (including hair loss) and a success rate of thirty some percent.  I had the courage to refuse it, and in the process discovered that the main thing I needed to do to alleviate my symptoms was to simply drink more freaking water, and the pain went away!!!!  I don&#39;t have very many good things to say about the mainstream scientific establishment, especially the medical system, I&#39;m right there on the same page with you, Frank.\n\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  I think these skeptics purpose is to keep main stream science from looking\n&gt; at certain taboo subjects, almost like a religion trying to keep itself\n&gt; pure. It aslmost has to be the universities that fund these people,\n&gt; otehrwise why would they waste their time, unless they are so lame this is\n&gt; the only way they can make a name for themselves. Science in this country is\n&gt; mostly out dated dogma that they pass off a absolute irrefutable gospel\n&gt; truth that must not be questioned, as if all is known, and all has been\n&gt; discovered.\n&gt; \n&gt;  F-S\n&gt; \n&gt; On Wed, Jan 19, 2011 at 9:32 AM, &lt;leongbabe@...&gt; wrote:\n&gt; \n&gt; &gt;\n&gt; &gt;\n&gt; &gt; I thought true skeptics were supposed to be logical, open-minded\n&gt; &gt; people who have doubts until they&#39;re presented with evidence that would\n&gt; &gt; dispel such doubts.  She&#39;s not a skeptic but a blind, fanatical\n&gt; &gt; non-believer.  That&#39;s too bad.\n&gt; &gt;\n&gt; &gt; Sharon from SF\n&gt; &gt;\n&gt; &gt; \n&gt; &gt;\n&gt;"}