{"id": "20300", "subject": "Re: [EVP-ITC] Re: Talking fish", "author": "Frank Sumption", "timestamp": "2011-01-19T18:15:47Z", "full_text": "Yep.\n\nOn Wed, Jan 19, 2011 at 10:14 AM, harpo103 &lt;rmc103@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; My 2 cents is that it&#39;s MUCH easier to shoot down an idea as being useless\n&gt; than it is to prove that it may have some merit.\n&gt; It&#39;s just less work to be a know-it-all that debunks everything, than it is\n&gt; to actually prove the vearcity of some phenomenon.\n&gt; They all laughed at Chris Columbus!!!!!!!!!!!!\n&gt; Copernicus\n&gt; Galileo\n&gt; Einstein\n&gt; etc. etc. etc.\n&gt; A lot of people with great ideas were chortled at in their lifetimes.\n&gt; No amount of proof will EVER convince someone who firmly believes, or\n&gt; doesn&#39;t believe, in something.\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com &lt;EVP-ITC%40yahoogroups.com&gt;, Frank Sumption\n&gt; &lt;purplealiengirl@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; I think these skeptics purpose is to keep main stream science from\n&gt; looking\n&gt; &gt; at certain taboo subjects, almost like a religion trying to keep itself\n&gt; &gt; pure. It aslmost has to be the universities that fund these people,\n&gt; &gt; otehrwise why would they waste their time, unless they are so lame this\n&gt; is\n&gt; &gt; the only way they can make a name for themselves. Science in this country\n&gt; is\n&gt; &gt; mostly out dated dogma that they pass off a absolute irrefutable gospel\n&gt; &gt; truth that must not be questioned, as if all is known, and all has been\n&gt; &gt; discovered.\n&gt; &gt;\n&gt; &gt; F-S\n&gt; &gt;\n&gt; &gt; On Wed, Jan 19, 2011 at 9:32 AM, &lt;leongbabe@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; I thought true skeptics were supposed to be logical, open-minded\n&gt; &gt; &gt; people who have doubts until they&#39;re presented with evidence that would\n&gt; &gt; &gt; dispel such doubts. She&#39;s not a skeptic but a blind, fanatical\n&gt; &gt; &gt; non-believer. That&#39;s too bad.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Sharon from SF\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nYep.\nOn Wed, Jan 19, 2011 a 10:14 AM, ha po103 mc103@comcas .ne > w o e:\n\n  \n\n\n\nMy 2 cen s is ha i 's MUCH easie o shoo down an idea as being useless han i is o p o e ha i may ha e some me i .I 's jus less wo k o be a know-i -all ha debunks e e y hing, han i is o ac ually p o e he ea ci y o some phenomenon.\nThey all laughed a Ch is Columbus!!!!!!!!!!!!Cope nicusGalileoEins eine c. e c. e c.A lo o people wi h g ea ideas we e cho led a in hei li e imes.No amoun o p oo will EVER con ince someone who i mly belie es, o doesn' belie e, in some hing. \n--- In EVP-ITC@yahoog oups.com, F ank Sump ion w o e:>> I hink hese skep ics pu pose is o keep main s eam science om looking\n> a ce ain aboo subjec s, almos like a eligion ying o keep i sel > pu e. I aslmos has o be he uni e si ies ha und hese people,> o eh wise why would hey was e hei ime, unless hey a e so lame his is\n> he only way hey can make a name o hemsel es. Science in his coun y is> mos ly ou da ed dogma ha hey pass o a absolu e i e u able gospel> u h ha mus no be ques ioned, as i all is known, and all has been\n> disco e ed.> > F-S> \n> On Wed, Jan 19, 2011 a 9:32 AM, w o e:> > >> >> > I hough ue skep ics we e supposed o be logical, open-minded> > people who ha e doub s un il hey' e p esen ed wi h e idence ha would\n> > dispel such doub s. She's no a skep ic bu a blind, ana ical> > non-belie e . Tha 's oo bad.> >> > Sha on om SF> >> > > >>"}