{"id": "20309", "subject": "Re: [EVP-ITC] BB-2", "author": "Frank Sumption", "timestamp": "2011-01-21T06:13:34Z", "full_text": "I was just sayin&#39;--as they say. I just have a hard time believing there are\nstuck spirits.\n\nF-S\n\nOn Thu, Jan 20, 2011 at 4:00 PM, Ursula Kalin &lt;kalinu@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;   personally I don&#39;t chase Ghost...I don&#39;t have to,for one I have a group\n&gt; for that a second they tend to find me..and when I did it wasn&#39;t in a moldy\n&gt; basement hahah. anyway yeah I don&#39;t ghost hunt. I do go to places to seek\n&gt; different entity&#39;s..but to me the term &quot;ghost hunting&quot; is for people who are\n&gt; still seeking proof..I have no need for that I know they exist.\n&gt;\n&gt; --- On *Thu, 1/20/11, Frank Sumption &lt;purplealiengirl@...&gt;* wrote:\n&gt;\n&gt;\n&gt; From: Frank Sumption &lt;purplealiengirl@gmail.com&gt;\n&gt; Subject: [EVP-ITC] BB-2 [4 Attachments]\n&gt; To: EVP-ITC@yahoogroups.com, RTSC@yahoogroups.com\n&gt; Date: Thursday, January 20, 2011, 12:15 PM\n&gt;\n&gt;\n&gt;\n&gt;   Big Box-2 Sweep board installed, random is still finicky as usual.\n&gt; Nobody has this! Bwa--bwahahahahahaha!!! I have two, count &#39;em--two big\n&gt; boxes. I know, everyone wants the mico box so can crawl arond in dark moldy\n&gt; basements chasing ghosts. Ever hear of the concept of chasing butterflies,\n&gt; the more you run around the more they elude you. Just sit, and they land on\n&gt; your shouder! Ya don&#39;t have to chase ghosts!\n&gt;\n&gt; F-S\n&gt;\n&gt; \n&gt;\n\nI was jus sayin'--as hey say. I jus ha e a ha d ime belie ing he e a e s uck spi i s.\n \nF-S\nOn Thu, Jan 20, 2011 a 4:00 PM, U sula Kalin kalinu@...> w o e:\n\n  \n\n\n\n\n\n\n\npe sonally I don' chase Ghos ...I don' ha e o, o one I ha e a g oup o ha a second hey end o ind me..and when I did i wasn' in a moldy basemen hahah. anyway yeah I don' ghos hun . I do go o places o seek di e en en i y's..bu o me he e m \"ghos hun ing\" is o people who a e s ill seeking p oo ..I ha e no need o ha I know hey exis .\n--- On Thu, 1/20/11, F ank Sump ion pu plealiengi l@...> w o e:\nF om: F ank Sump ion pu plealiengi l@...>Subjec : [EVP-ITC] BB-2 [4 A achmen s]\nTo: EVP-ITC@yahoog oups.com, RTSC@yahoog oups.comDa e: Thu sday, Janua y 20, 2011, 12:15 PM \n\n  \n\n\n Big Box-2 Sweep boa d ins alled, andom is s ill inicky as usual. Nobody has his! Bwa--bwahahahahahaha!!! I ha e wo, coun 'em-- wo big boxes. I know, e e yone wan s he mico box so can c awl a ond in da k moldy basemen s chasing ghos s. E e hea o he concep o chasing bu e lies, he mo e you un a ound he mo e hey elude you. Jus si , and hey land on you shoude ! Ya don' ha e o chase ghos s! \n\n \nF-S"}