{"id": "20318", "subject": "Re: Hello", "author": "draiga1", "timestamp": "2011-01-22T06:00:13Z", "full_text": "The only thing I know about it is that it was bought at a yard sale in Louisiana. The story is that there were two sisters that lived in the house having the yard sale. When the man I got it from asked about it, one sister acted like she didn&#39;t want to sell it, but the other one went ahead and sold it to him. He had given it to his wife when he got home, she put it on the dresser and they didn&#39;t think much about it. It&#39;s one of those old silverplated handheld mirrors that women used to have on their vanities.\n\nThen one day a week or so later, he heard his daughter upstairs talking to someone. He figured she was having a tea party with her dolls and decided to join her play. When he went upstairs, she wasn&#39;t in her room, but in her parent&#39;s room and without any toys. He asked what she was doing, and she said she was talking to the lady. He asked what lady, and she said &quot;the lady in the picture&quot;. He asked the lady in what picture, and she pointed at the mirror. There was a little more to it, but that&#39;s the gist. He had seen an apparition I think too, and freaked out and got rid of the mirror.\n\nI have gotten definate weird negative feelings from it, including extreme pain along my spine when I put it behind my seat in my truck once. I&#39;ve had three different psychics look at it, and all three said it wasn&#39;t human. We believe someone was practicing magic and conjured this entity into the mirror. At times when people have looked in it, there eyes look black, and the mirror sometimes vibrates. It has also caused bad headaches for people. I didn&#39;t let the entity get too far before laying down the rules. Either it played nice, or would be severely harmed. We went a few rounds, but it seems to be dormant now. Or at least behaving very well. I haven&#39;t brought it out in over a year.\n\nI&#39;m sure there are probably already movies or novels about haunted mirrors.\n\n~Draiga\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;harpo103&quot; &lt;rmc103@...&gt; wrote:\n&gt;\n&gt; A spirit trapped in a mirror?\n&gt; That would make a great short story or mini series.\n&gt; Is there a story about that already?"}