{"id": "20380", "subject": "Re: 10-4", "author": "Adriana Jones", "timestamp": "2011-01-24T22:49:26Z", "full_text": "Thank you, Snow!  And, guys, I refuse to censor myself, my speech or my thoughts or my actions out of fear of debunkers.  I refuse to hide/deny what I hear, from myself.  If we do that, we miss out on finding out the WHOLE truth, in all its intricacies.  We shortchange OURSELVES.  You know I&#39;ve done that my whole life just to fit in - denied my own truth and intuition, (as most people do) and I&#39;m not about to start doing it here.  This is too sacred, and too real.  Frank, you saw what one debunker did recently.  Their arguments DIDN&#39;T EVEN MAKE SENSE and were complete lies.  They will lie through their teeth, whether or not we say something that looks like it might be &quot;fodder&quot;.  Everything we do is BS to them.  They don&#39;t even take the time to analyze our counterarguments.  I&#39;m extremely confident that what we are getting is paranormal, and I have no qualms discussing it in full detail.\n\nI wrote an article for Tim Woolworth&#39;s website Ghost Boxer at itcvoices.org.  Please check out the website, and I would LOVE to get some feedback on my article here: \n\nhttp://itcvoices.org/wordpress/?p=153\n\n\n\n--- In EVP-ITC@yahoogroups.com, Snowfire Lioness &lt;SnowfireL@...&gt; wrote:\n&gt;\n&gt;  I have plenty of files of someone over there saying my whole name, and I mean first middle and last name, and in reverse as well, these folks over there are still living!  sf\n&gt; \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; -----Original Message-----\n&gt; From: Adriana Jones adrianamjones@...\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Mon, Jan 24, 2011 4:47 pm\n&gt; Subject: [EVP-ITC] Re: 10-4\n&gt; \n&gt;                                              Frank, I realize how this sounds, but it&#39;s not debunker fodder.  They truly have said 10-4, and more than once.  And this doesn&#39;t invalidate ANYTHING.  I know for a FACT, Frank, that these voices are truly anomalous, based on a precise validation method I started using which looks at the length of the messages.  They not only 10-4 but they say everything else under the sun, which has nothing to do with police scanners or anything of that sort.  And a lot of it I&#39;ve validated to be without a doubt anomalous, based on the message length... I think they may like to use ten-code... that&#39;s my suspicion... and I&#39;d like to see if I&#39;m right.  Also I&#39;ve made two compilation sound files each lasting 20 some seconds long, which are compilations of all the &quot;help me&quot;s I&#39;ve received from a 5 minute and a 7 minute session.  Debunk that, debunkers! I feel that what we get across these ghost boxes is yes, ghosts, but also so much more than that.  I don&#39;t know what, and it&#39;s   painful not knowing, but based on the VARIETY of messages I&#39;ve received, it&#39;s just amazing, it&#39;s absolutely amazing,and I don&#39;t know what it is...\n&gt;  \n&gt;  --- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; purplealiengirl@ wrote:\n&gt;  &gt;\n&gt;  &gt;  That&#39;s debunker fodder! Some claim we just hear snippets of radio broadcasts along with CB radio. You can get harmonics, espcially if someone in the area is running an illegal amplifier. There can also be some mixing of signals under certain conditions, mixing combines combines signals, resulting in different frequency products. I am not saying that is what this radio jargon is, it might be an indication &quot;they&quot; are using some form of transmission, and trying to indicate it. \n&gt;  &gt; \n&gt;  &gt;  When I do those test vidoes, the cellphone announces &quot;Look here&quot; when it starts, and the radios pick that up. I&#39;d listen for content, and personal messages, and ignore anything that seems unrelated to questions, or spirit contact. It can get really confusing. Some take every word as meanigful, even the ones that are clearly a sports annoucer, or car salesman. The Jesus broascasts that are so common in this country can add a layer of confusion.\n&gt;  &gt; \n&gt;  &gt;  F-S\n&gt;  &gt; \n&gt;  &gt; --- In EVP-ITC@yahoogroups.com, &quot;Adriana Jones&quot; &lt;adrianamjones@&gt; wrote:\n&gt;  &gt; &gt;\n&gt;  &gt; &gt; I&#39;ve heard 10-4 across my ghost box a couple of times. I&#39;m going to start using\n&gt;  &gt; &gt; radio code to see if they respond. If anyone else wants to do this, please let\n&gt;  &gt; &gt; me know what results you get.\n&gt;  &gt; &gt; \n&gt;  &gt; &gt; Thanks.\n&gt;  &gt; &gt; \n&gt;  &gt; &gt; Adriana.\n&gt;  &gt; &gt;\n&gt;  &gt;\n&gt;"}