{"id": "20383", "subject": "Re: [EVP-ITC] Re: Sometimes they answer-", "author": "Adrienne B", "timestamp": "2011-01-25T00:07:17Z", "full_text": "Hi,\n\nThanks, Barbara. I don&#39;t buy that stuff either.  Though, as you say,\nsometimes it seems like some part of it may be plausible (?)- not the way\nthey present it or even the content. But the behavior of our species\nmystifies me sometimes.  Hubris?\n\nAdrienne\n\n\n\nOn Mon, Jan 24, 2011 at 6:17 PM, Barbara Copeland &lt;bumblebugz@...\n&gt; wrote:\n\n&gt;\n&gt;\n&gt;  i watch Ancient Aliens on History Channel (No, I am not a big UFO person,\n&gt; and I don&#39;t believe everything thats out there, lol), but some of the shows\n&gt; that I have watched, well, make sense to me. Like the things you mentined,\n&gt; so don&#39;t be too embarrassed, cause I have the same thoughts!\n&gt;\n&gt;\n&gt;\n&gt;  ------------------------------\n&gt; *From:* Adrienne B &lt;abortree@...&gt;\n&gt;\n&gt; *To:* EVP-ITC@yahoogroups.com\n&gt; *Sent:* Mon, January 24, 2011 1:32:35 PM\n&gt; *Subject:* Re: [EVP-ITC] Re: Sometimes they answer-\n&gt;\n&gt;\n&gt;\n&gt; I&#39;m almost too embarrassed to throw this out there, but studying species\n&gt; extinctions and listening to my professor (the head of a prestigious\n&gt; Institute studying sustainability issues, who believes we might be able to\n&gt; retail the parts of the global ecosystem that WE need to survive,  I\n&gt; sometimes wonder who WE are.  Are we from here?  ( I know. - that&#39;s very\n&gt; SyFi channel but when I think of the alleged superadvanced and long extinct\n&gt; cultures of the past and our collective &quot;disposable&quot; attitude toward what&#39;s\n&gt; left of our natural resources I sometimes wonder if we&#39;re just a hybrid, an\n&gt; experiment or we have some deeply subconscious awareness that we are just\n&gt; waiting to move on.\n&gt;\n&gt; Ok, that&#39;s my &quot;fringe&quot;/whaling contribution for the day.\n&gt;\n&gt; Adrienne\n&gt; On Jan 24, 2011 12:43 PM, &quot;Barbara Copeland&quot; &lt;bumblebugz@...&gt;\n&gt; wrote:\n&gt;\n&gt;\n&gt;  \n&gt;\n\nHi,Thanks, Ba ba a. I don' buy ha s u ei he .  Though, as you say, some imes i seems like some pa o i may be plausible (?)- no he way hey p esen i o e en he con en . Bu he beha io o ou species mys i ies me some imes.  Hub is?\n\nAd ienne On Mon, Jan 24, 2011 a 6:17 PM, Ba ba a Copeland bumblebugz@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n  i wa ch Ancien Aliens on His o y Channel (No, I am no a big UFO pe son, and I don' belie e e e y hing ha s ou he e, lol), bu some o he shows ha I ha e wa ched, well, make sense o me. Like he hings you men ined, so don' be oo emba assed, cause I ha e he same hough s!  \n\n\n \n\n\n\nF om: Ad ienne B abo ee@...>To: EVP-ITC@yahoog oups.com\n\nSen : Mon, Janua y 24, 2011 1:32:35 PMSubjec : Re: [EVP-ITC] Re: Some imes hey answe -\n\n\n  \n\n\nI'm almos oo emba assed o h ow his ou he e, bu s udying species ex inc ions and lis ening o my p o esso ( he head o a p es igious Ins i u e s udying sus ainabili y issues, who belie es we migh be able o e ail he pa s o he global ecosys em ha WE need o su i e,  I some imes wonde who WE a e.  A e we om he e?  ( I know. - ha 's e y SyFi channel bu when I hink o he alleged supe ad anced and long ex inc cul u es o he pas and ou collec i e \"disposable\" a i ude owa d wha 's le o ou na u al esou ces I some imes wonde i we' e jus a hyb id, an expe imen o we ha e some deeply subconscious awa eness ha we a e jus wai ing o mo e on.\n\n\nOk, ha 's my \" inge\"/whaling con ibu ion o he day.\nAd ienne \nOn Jan 24, 2011 12:43 PM, \"Ba ba a Copeland\" bumblebugz@...> w o e:"}