{"id": "20399", "subject": "Re: Ghost box making", "author": "purplespacefriend", "timestamp": "2011-01-26T01:26:24Z", "full_text": "Ahh, heard someone that seemed to be saying you were acusing us of charging $500, I can see that was a misunderstanding. Yeah, I try to get it across that &quot;the box&quot; is a friggin&#39; radio! You don&#39;t even have to have any fancy sweep, you can sweep a simple cheap radio by hand while recording from the speaker and get exactly the same results and communication. Not only that, it is one method of supplying &quot;raw audio&quot;, there are other ways that work as well, and some better. Try tuning an AM radio between stations on a night when skip is coming in--distant stations fadding in and out randomly. Annouce you/re doing an EVP recording and record from the pseaker. BTW, you do not have to go to haunted locations! No doubt, get rebuffed for that as the experts know better.\n\n\n I try to charge enough to be able to buy parts, as far my labor, I don&#39;t get squat! Less than a dollar an hour. Some seem to think we should give the stuff away, even pay shipping, at least that&#39;s what I hear from others making this junk. Believe me, making boxes is a fraking hassle I no longer want. Some users seem to get a few voices and all the sudden they are the world&#39;s only box expert. I can&#39;t say anything without pissing them off, or geting some angry response, while I&#39;m just supposed eat up what they say. I can be moody, but this shit just ain&#39;t worht it. I get midnight e-mails that make no sense what so ever, and I can&#39;t even question what the person is saying, yet I&#39;m the bad guy for for getting angry with that. Screw it!\n\n When I think I&#39;ve reached my saturation point--it gets worse! \n\nFrank-s\n\n \n\n\n\n--- In EVP-ITC@yahoogroups.com, johnny u &lt;overwhelmed999@...&gt; wrote:\n&gt;\n&gt; you&#39;ll find lots of recipies in here. Just don;t be dumb enough to buy one \n&gt; exorbitantly priced. I ahve seen some of these guys trying to pawn off\n&gt; boxes for 500.00. You will need to know how to open a radio and maybe pull a \n&gt; circuit board out and snip a wire.\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; ________________________________\n&gt; From: lord_of_kittens &lt;ashkitty53@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Mon, January 24, 2011 2:53:06 AM\n&gt; Subject: [EVP-ITC] Ghost box making\n&gt; \n&gt;   \n&gt; How do I make one I have never doing &quot;hacking&quot; so im a complete noob I would \n&gt; like on that looks like a radio\n&gt;"}