{"id": "20402", "subject": "Re: Yeah....", "author": "Adriana Jones", "timestamp": "2011-01-26T10:04:12Z", "full_text": "I know what you&#39;re saying... because these debunkers have no scruples... and because they&#39;re cold and ruthless liars like that.... they would simply lift this short statement out of context and smear it everywhere... and say, &quot;See, see even THEY said this!&quot;  I understand your concern.  On the other hand, if it&#39;s not shared with everyone, we may lose the ability to confirm this tech quirk with each other.  With each new confirmation that we get amongst each other, the more we learn and prove this and can improve our other-side communication.  It&#39;s one thing to say that ONLY ONE PERSON hears a certain something, but when we all get together and agree we all hear the same thing, that&#39;s a powerful statement right there.  We all hear help me&#39;s and we hear them disproportinately large amount of times, for scanning AM/FM.... I mean seriously, how often if ever do you hear ANYONE yell &quot;help me&quot; on the radio.... yeah, NEVER is about right... and then to get it multiple times in the same session, and then get it again session after session... that alone is enough irrefutable proof.... to me discussing the possibility that they like to adopt voice communication standard like ten-code is not a big deal, in comparison to how much irrefutable proof we have... it&#39;s just something that might help us to get better rapport with our techs.  But I&#39;ll stop talking about.   \n\nOn another note, I just did my first crossover session tonight, and I&#39;m terribly happy, relieved and excited.  After four months of nothing but &quot;help me&quot;s and &quot;f-you&#39;s&quot; it was about time!!!  It was several spirits not just one.  I&#39;m so relieved.  I thought it would never happen, but it certainly did tonight.  \n\n--- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  I&#39;m just saying, debunkers would rip it apart and use &quot;10-4&quot; as confirmation that we just get CB broadcasts. \n&gt; \n&gt;  Yeah, best if I keep my e-mail off. My failure to communicate is appalling.\n&gt; \n&gt; F-S\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Adriana Jones&quot; &lt;adrianamjones@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Frank, I realize how this sounds, but it&#39;s not debunker fodder.  They truly have said 10-4, and more than once.  And this doesn&#39;t invalidate ANYTHING.  I know for a FACT, Frank, that these voices are truly anomalous, based on a precise validation method I started using which looks at the length of the messages.  They not only 10-4 but they say everything else under the sun, which has nothing to do with police scanners or anything of that sort.  And a lot of it I&#39;ve validated to be without a doubt anomalous, based on the message length... I think they may like to use ten-code... that&#39;s my suspicion... and I&#39;d like to see if I&#39;m right.  Also I&#39;ve made two compilation sound files each lasting 20 some seconds long, which are compilations of all the &quot;help me&quot;s I&#39;ve received from a 5 minute and a 7 minute session.  Debunk that, debunkers! I feel that what we get across these ghost boxes is yes, ghosts, but also so much more than that.  I don&#39;t know what, and it&#39;s painful not knowing, but based on the VARIETY of messages I&#39;ve received, it&#39;s just amazing, it&#39;s absolutely amazing,and I don&#39;t know what it is...\n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; &lt;purplealiengirl@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt;  That&#39;s debunker fodder! Some claim we just hear snippets of radio broadcasts along with CB radio. You can get harmonics, espcially if someone in the area is running an illegal amplifier. There can also be some mixing of signals under certain conditions, mixing combines combines signals, resulting in different frequency products. I am not saying that is what this radio jargon is, it might be an indication &quot;they&quot; are using some form of transmission, and trying to indicate it. \n&gt; &gt; &gt; \n&gt; &gt; &gt;  When I do those test vidoes, the cellphone announces &quot;Look here&quot; when it starts, and the radios pick that up. I&#39;d listen for content, and personal messages, and ignore anything that seems unrelated to questions, or spirit contact. It can get really confusing. Some take every word as meanigful, even the ones that are clearly a sports annoucer, or car salesman. The Jesus broascasts that are so common in this country can add a layer of confusion.\n&gt; &gt; &gt; \n&gt; &gt; &gt;  F-S\n&gt; &gt; &gt; \n&gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;Adriana Jones&quot; &lt;adrianamjones@&gt; wrote:\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; I&#39;ve heard 10-4 across my ghost box a couple of times. I&#39;m going to start using\n&gt; &gt; &gt; &gt; radio code to see if they respond. If anyone else wants to do this, please let\n&gt; &gt; &gt; &gt; me know what results you get.\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; Thanks.\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; Adriana.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}