{"id": "20411", "subject": "Re: had anyone....", "author": "Adriana Jones", "timestamp": "2011-01-27T08:24:56Z", "full_text": "ok, that&#39;s just creepy... I&#39;d like to think that if I saw a ghost in human form I&#39;d have enough compassion for its humanity to not run off screaming in the opposite direction... but if it got down on all fours all bets are off... that just conjured an image of Samara in The Ring clawing her way up the well... *shiver*\n\nWhen I was little a saw a pair of black/dark shadow people walking away from my bed, very split second experience, almost like I was catching a glimpse of them on a walking journey... saw them from their left side, very strange looking, same height almost like replicas of each other stood very close together, tall thin angular, almost like statues, or like the generic microsoft clip art style of people.... is that what they look like? \n\n\n--- In EVP-ITC@yahoogroups.com, Ursula Kalin &lt;kalinu@...&gt; wrote:\n&gt;\n&gt; shadow people is a norm to me..I seen one come from behind a tree walking then get on all fours and shoot off..I almost had a heart attack..the last one I seen was in my kitchen..it walked by me...so I turned expecting it to be gone..it wasn&#39;t. I grabbed my books and walked quickly on the way up the stairs &quot;you people are getting way to comfy here&quot; lol it was sort of funny if you think about it\n&gt;  \n&gt;  \n&gt;  \n&gt; --- On Wed, 1/26/11, SnowfireL@... &lt;SnowfireL@...&gt; wrote:\n&gt; \n&gt; \n&gt; From: SnowfireL@... &lt;SnowfireL@...&gt;\n&gt; Subject: Re: [EVP-ITC] had anyone....\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Wednesday, January 26, 2011, 1:43 PM\n&gt; \n&gt; \n&gt;   \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; The tech, David told me that &quot;shadow people are really just spirits close to materializing&quot; so we can see them.  A few weeks ago, I saw a small hand with arm reaching out to touch me on my head, I jumped up, and hollered at it, so it went away quickly.  It wasn&#39;t really scary just startled the heck out of me. sf\n&gt;  \n&gt; \n&gt; In a message dated 1/26/2011 2:19:32 P.M. Eastern Standard Time, ashkitty53@... writes:\n&gt;   \n&gt; \n&gt; \n&gt; maybe zack lol this is also at my house which i think is unhaunted as far as i know but i have exps anything paranormal in the house though i did in a house in kearney mo i saw my first shadow person though it look more like a cat to me this was a few years ago it was in the basement in the dark \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; From: Zack Widup &lt;w9sz.zack@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Wed, January 26, 2011 1:05:41 PM\n&gt; Subject: Re: [EVP-ITC] had anyon e....\n&gt; \n&gt;   \n&gt; \n&gt; I have heard many reports and personally seen in some cases where a person on a paranormal investigation experienced rapid, unexplainable battery drain. I myself haven&#39;t had it happen to any of my batteries. Maybe they avoid me!\n&gt; :-)\n&gt; \n&gt; Zack\n&gt; \n&gt; \n&gt; On Wed, Jan 26, 2011 at 1:01 PM, lord_of_kittens &lt;ashkitty53@...&gt; wrote:\n&gt; \n&gt; \n&gt;   \n&gt; \n&gt; \n&gt; \n&gt; had anyone had something that use a battery drain in one night? cuz it happen to me i was play with my wii with a fully charged remote and i was down to 1 bar on my wii i havent even play that much for it to do that much drain i played for 30min total. any one here had similar exps?\n&gt;"}