{"id": "20444", "subject": "Re: First New Box of 2011----Steve&#39;s Box #42 [2 Attachments]", "author": "draiga1", "timestamp": "2011-01-29T16:07:09Z", "full_text": "Hi Steve,\n\nI love your box! I would love to have another one with a different type sweep to compare results. I haven&#39;t been on the lists much, because I have been pretty busy the last few months. I have some experimentimg to do with the paracorder and camera too. \n\nIt&#39;s been so cold here lately that my space heaters couldn&#39;t keep up which is unusual here in Middle GA. The cold was draining my batteries. But this weekend we&#39;re getting temps that are warmer, so I&#39;m planning on doing some of the experimenting that I&#39;ve wanted to do since Christmas.\n\nAnyway, if you would like to email me privately about a different box, please do. It&#39;s a shame that interest has waned. I know money has been tighter in general for me. Maybe it&#39;s the same for others as well.\n\n~Draiga\n\n--- In EVP-ITC@yahoogroups.com, &quot;Urkel23&quot; &lt;urkel23@...&gt; wrote:\n&gt;\n&gt; \n&gt; Thanks.  I build very slow, but always try to make something different.  This is another one of a kind sweep.\n&gt; \n&gt; Seems there isn&#39;t much interest in the boxes anymore though.  I make them and stick it in the corner to collect dust.  I put them on EBAY or offer it to the groups, but no response from either.\n&gt; \n&gt; That&#39;s why i don&#39;t make many anymore, what am i going to do with all of these?\n&gt; \n&gt; I get a lot of e-mails for a box, but it&#39;s all the same thing and frank can attest to this to.\n&gt; \n&gt; They want me to build them a box and ship it to them for FREE, usually because they are a TAPS family member or somebody halfway famous in the field.\n&gt; \n&gt; I can&#39;t do that anymore, i ran out of money and frank is retired.\n&gt; \n&gt; -Steve H.\n&gt; \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Ursula Kalin &lt;kalinu@&gt; wrote:\n&gt; &gt;\n&gt; &gt; I heard your name in the second clip..it sounds really good\n&gt; &gt; \n&gt; &gt; --- On Fri, 1/28/11, urkel23@ &lt;urkel23@&gt; wrote:\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; From: urkel23@ &lt;urkel23@&gt;\n&gt; &gt; Subject: [EVP-ITC] First New Box of 2011----Steve&#39;s Box #42 [2 Attachments]\n&gt; &gt; To: rtsc@yahoogroups.com, EVP-ITC@yahoogroups.com\n&gt; &gt; Date: Friday, January 28, 2011, 6:18 PM\n&gt; &gt; \n&gt; &gt; \n&gt; &gt;   \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; [Attachment(s) from urkel23@ included below] \n&gt; &gt; \n&gt; &gt;  \n&gt; &gt; I call this circuit a hybrid sweep.  It is a blend of random and linear modes together.  It sweeps in a linear fashion, but has a runaway speed change to it.  Let me know what you guys think of it.\n&gt; &gt;  \n&gt; &gt; -Steve H.\n&gt; &gt;  \n&gt; &gt;  \n&gt; &gt;  \n&gt; &gt; Steve Hultay\n&gt; &gt; www.keyportparanormal.com\n&gt; &gt; http://tech.groups.yahoo.com/group/rtsc/\n&gt; &gt; www.stevehultay.com\n&gt; &gt; www.rtscresearch.org\n&gt; &gt;\n&gt;"}