{"id": "20507", "subject": "Re: Steve&#39;s Box #43", "author": "Adriana Jones", "timestamp": "2011-02-01T01:55:05Z", "full_text": "On your FM \nat second 10-12 I hear &quot;telephone&quot; and a fainter &quot;hello?&quot; I&#39;ve gotten one or two &quot;telephone-hello&quot; voices myself.  Very interesting.  \n\nat about second 18 &quot;you&#39;re/its so beautiful&quot; a high soft female voice, I&#39;ve gotten this message before and have also noticed it on others&#39; files too.  These along with the &quot;I love you&quot;s are a good sign to hear, it means whoever is on the other side is feeling happy right now.\n\naround sec 33-35 a man says quickly &quot;I&#39;ve paid a bit cause of you&quot;\n\nsec 42-43 &quot;wait, just come&quot; harmonic/singing higher pitch\n\nsec 44-45 &quot;the people are talking to me&quot; also harmonic/singing higher pitch, I think in response to the message at sec 42-43\n\nsec 46-48 &quot;you must do it&quot;\n\nsec 49-51 &quot;did you say do that?&quot; another high synth voice\n\nat 1:02 there&#39;s the &quot;I love you&quot; :)\n\nthere are so many more communications just on your FM sample, but some are too quick/blurry to decipher quickly, but there are definitely way many more!\n\nAM sample:\n\nwow, I hear so much am not sure what&#39;s communication and what&#39;s just radio, I&#39;m also not used to listening to am... what&#39;s the sweep speed, will it be possible for any full words to come through at all? If not, then you&#39;ve got a heck of a lot of stuff going on... I heard something about obama twice and have only listened through about half of it.\n\n--- In EVP-ITC@yahoogroups.com, urkel23@... wrote:\n&gt;\n&gt; \n&gt; \n&gt; Threw this together in an hour today, let me know what you guys  think.\n&gt;  \n&gt; -Steve H.\n&gt;  \n&gt;  \n&gt;  \n&gt; Steve Hultay\n&gt; _www.keyportparanormal.com_ (http://www.keyportparanormal.com/) \n&gt; _http://tech.groups.yahoo.com/group/rtsc/_ \n&gt; (http://tech.groups.yahoo.com/group/rtsc/) \n&gt; _www.stevehultay.com_ (http://www.stevehultay.com/) \n&gt; _www.rtscresearch.org_ (http://www.rtscresearch.org/)\n&gt;"}