{"id": "20520", "subject": "Re: Important Message to all,", "author": "Urkel23", "timestamp": "2011-02-02T00:52:29Z", "full_text": "I think your crossover file was recorded with a poor quality recorder, when you get your new one i&#39;m sure i will here your files a lot better.\n\nS-H\n\n\n\n--- In EVP-ITC@yahoogroups.com, Ursula Kalin &lt;kalinu@...&gt; wrote:\n&gt;\n&gt; I hear some words in your files snow but alot times it&#39;s not waht you say..but who am I to tell you what&#39;s in your files...maybe it&#39;s not for some of us to hear...maybe its meant for you...am not trying to say what you say you hear you don&#39;t...because I&#39;m not you...and that would be rude..just like most people well everyone except steve and tim can&#39;t hear my crossover...see my point..\n&gt; \n&gt; --- On Mon, 1/31/11, urkel23@... &lt;urkel23@...&gt; wrote:\n&gt; \n&gt; \n&gt; From: urkel23@... &lt;urkel23@...&gt;\n&gt; Subject: Re: [EVP-ITC] Re: Important Message to all,\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Monday, January 31, 2011, 6:47 PM\n&gt; \n&gt; \n&gt;   \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;  \n&gt; I don&#39;t believe Bruce ever listened to loud music.  Being in a band and musician is where i get the good ear to hear the communication.\n&gt;  \n&gt; If i can&#39;t hear anything at all in a file, it&#39;s NOT there !  I think some are just trying to be nice.  \n&gt;  \n&gt; You just mentioned Ursula as one of the people that can hear your files, but in the previous post Ursula said that she can&#39;t hear anything in your files.\n&gt;  \n&gt; I&#39;ve tried to help you with editing, but you don&#39;t want it.\n&gt;  \n&gt; -Steve\n&gt;  \n&gt;  \n&gt;  \n&gt; Steve Hultay\n&gt; www.keyportparanormal.com\n&gt; http://tech.groups.yahoo.com/group/rtsc/\n&gt; www.stevehultay.com\n&gt; www.rtscresearch.org \n&gt;  \n&gt; \n&gt; In a message dated 1/31/2011 7:42:33 P.M. Eastern Standard Time, SnowfireL@... writes:\n&gt;   \n&gt; \n&gt; \n&gt;  \n&gt; There are some people that do hear the messages, Steve, on the listes, Mary, Jan, Urs Ron, Michael and I think Frank can hear them too.  My kids, and grandson hears them too, it could be the programs used to listen maybe?  Sometimes it takes more then one time to play them back, it play all files back at least 3 time to listen.  These are a few people that do hear my files, it&#39;s seems like you and Bruce seem to have the most trouble, it could be from playing all that loud music &lt;g&gt; no offense.  It may have damaged ear drums a bit, sf\n&gt; \n&gt; In a message dated 1/31/2011 6:24:25 P.M. Eastern Standard Time, urkel23@... writes:\n&gt;   \n&gt; \n&gt; \n&gt; Question:\n&gt; \n&gt; I don&#39;t hear most of the files you post, but you hear them so clearly. The only way to validate what you hear is true, would be to follow up with something that you got that actually happened.\n&gt; \n&gt; Have you ever heard a message that came true that nobody else heard, basically validating your experience?\n&gt; \n&gt; -Steve\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, SnowfireL@ wrote:\n&gt; &gt;\n&gt; &gt; I keep getting these messages that this Egyptian thing will escalate into \n&gt; &gt; a big war, but some of us will not be here to see it due to the \n&gt; &gt; resurrection aka rapture. Go on and laugh, but don&#39;t say I didn&#39;t let you all know, \n&gt; &gt; not going to say anymore, ( I know, what a relief ! right?), we all know in \n&gt; &gt; our hearts how we feel about things. I keep getting these kind of \n&gt; &gt; messages, and so feel compelled to let everyone know. I was also told those that \n&gt; &gt; are stuck here, will be stuck here for almost 3 years, and will be those \n&gt; &gt; that don&#39;t believe in what JC did for them. These spirits insist that He is \n&gt; &gt; the only way to life. sf\n&gt; &gt;\n&gt;"}