{"id": "20527", "subject": "Re: Steve&#39;s Box #43", "author": "Urkel23", "timestamp": "2011-02-02T02:18:40Z", "full_text": "You can set the sweep as slow as possible if your a weekend ghost hunter, but not if you want to be taken seriously.\n\nYou will never get anybody to believe your files are legit if you can clearly hear a dj from the radio, even if the word he said had good timing to answer your question.\n\n-Steve\n\n\n\n--- In EVP-ITC@yahoogroups.com, Ursula Kalin &lt;kalinu@...&gt; wrote:\n&gt;\n&gt; that&#39;s a good idea with the fast sweep..but not fair to ignore people files just because the sweep is slowers...it&#39;s like saying do it my way or it&#39;s not right... don&#39;t do  super fast sweep however I set it so you only hear tibits of a station..so no full words\n&gt; \n&gt; --- On Tue, 2/1/11, Urkel23 &lt;urkel23@...&gt; wrote:\n&gt; \n&gt; \n&gt; From: Urkel23 &lt;urkel23@...&gt;\n&gt; Subject: [EVP-ITC] Re: Steve&#39;s Box #43\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Tuesday, February 1, 2011, 6:51 PM\n&gt; \n&gt; \n&gt;   \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; I always keep the sweep at a very fast pace, most don&#39;t like it like that. I trained myself to listen that way, i never get questioned by the skeptics.\n&gt; \n&gt; If you hear a voice that&#39;s crystal clear, it&#39;s most likely just radio. The communication doesn&#39;t come over that way usually.\n&gt; \n&gt; I would suggest a test for anybody on this forum. Set you ghost box at a super fast rate, then just sit back and listen. After a while you will hear them talk, but you have to get used to listening that way.\n&gt; \n&gt; I feel that it&#39;s the only legitimate way to do this. Just my opinion on that topic. If i hear someone&#39;s file with a slow sweep, i ignore it as communication for the most part.\n&gt; \n&gt; -Steve\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Adriana Jones&quot; &lt;adrianamjones@&gt; wrote:\n&gt; &gt;\n&gt; &gt; On your FM \n&gt; &gt; at second 10-12 I hear &quot;telephone&quot; and a fainter &quot;hello?&quot; I&#39;ve gotten one or two &quot;telephone-hello&quot; voices myself. Very interesting. \n&gt; &gt; \n&gt; &gt; at about second 18 &quot;you&#39;re/its so beautiful&quot; a high soft female voice, I&#39;ve gotten this message before and have also noticed it on others&#39; files too. These along with the &quot;I love you&quot;s are a good sign to hear, it means whoever is on the other side is feeling happy right now.\n&gt; &gt; \n&gt; &gt; around sec 33-35 a man says quickly &quot;I&#39;ve paid a bit cause of you&quot;\n&gt; &gt; \n&gt; &gt; sec 42-43 &quot;wait, just come&quot; harmonic/singing higher pitch\n&gt; &gt; \n&gt; &gt; sec 44-45 &quot;the people are talking to me&quot; also harmonic/singing higher pitch, I think in response to the message at sec 42-43\n&gt; &gt; \n&gt; &gt; sec 46-48 &quot;you must do it&quot;\n&gt; &gt; \n&gt; &gt; sec 49-51 &quot;did you say do that?&quot; another high synth voice\n&gt; &gt; \n&gt; &gt; at 1:02 there&#39;s the &quot;I love you&quot; :)\n&gt; &gt; \n&gt; &gt; there are so many more communications just on your FM sample, but some are too quick/blurry to decipher quickly, but there are definitely way many more!\n&gt; &gt; \n&gt; &gt; AM sample:\n&gt; &gt; \n&gt; &gt; wow, I hear so much am not sure what&#39;s communication and what&#39;s just radio, I&#39;m also not used to listening to am... what&#39;s the sweep speed, will it be possible for any full words to come through at all? If not, then you&#39;ve got a heck of a lot of stuff going on... I heard something about obama twice and have only listened through about half of it.\n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, urkel23@ wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; Threw this together in an hour today, let me know what you guys think.\n&gt; &gt; &gt; \n&gt; &gt; &gt; -Steve H.\n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; Steve Hultay\n&gt; &gt; &gt; _www.keyportparanormal.com_ (http://www.keyportparanormal.com/) \n&gt; &gt; &gt; _http://tech.groups.yahoo.com/group/rtsc/_ \n&gt; &gt; &gt; (http://tech.groups.yahoo.com/group/rtsc/) \n&gt; &gt; &gt; _www.stevehultay.com_ (http://www.stevehultay.com/) \n&gt; &gt; &gt; _www.rtscresearch.org_ (http://www.rtscresearch.org/)\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}