{"id": "20557", "subject": "Re: DAH!", "author": "Adriana Jones", "timestamp": "2011-02-04T06:43:39Z", "full_text": "Yeah, that&#39;s what I thought too, but I&#39;m assuming there&#39;s more to this than that.... at least, I hope.  \n\n\n--- In EVP-ITC@yahoogroups.com, Ursula Kalin &lt;kalinu@...&gt; wrote:\n&gt;\n&gt; I don&#39;t get it..how can you not know what Manuel is..I think someone is pulling your leg\n&gt; \n&gt; --- On Fri, 2/4/11, Adriana Jones &lt;adrianamjones@...&gt; wrote:\n&gt; \n&gt; \n&gt; From: Adriana Jones &lt;adrianamjones@...&gt;\n&gt; Subject: [EVP-ITC] Re: DAH!\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Friday, February 4, 2011, 12:33 AM\n&gt; \n&gt; \n&gt;   \n&gt; \n&gt; \n&gt; \n&gt; Manual sweep. Manual: From the word &quot;manu&quot; in latin meaning hand. Manual sweep: Sweeping the radio dial by hand. Does anyone have any questions? Frank, who is giving you a hard time about this? It sounds absolutely asinine that this even has to be discussed....\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@&gt; wrote:\n&gt; &gt;\n&gt; &gt; It&#39;s just occuring and I&#39;m being made aware that most here, just don&#39;t get\n&gt; &gt; the concept of manual sweep, depsite the fact that it has been dicussed here\n&gt; &gt; sin at least 2008. Manual--as in done by freaking hand, as in touching the\n&gt; &gt; godamn dial!\n&gt; &gt; \n&gt; &gt; Yeah, I am pissed, cuz no matter what I say it is completely ignored in\n&gt; &gt; favor of the idiotic ghost hunter rap. Y&#39;all don&#39;t understand the sdimplest\n&gt; &gt; concepts of spirit communcation, but I bet 90% here will claim to be box and\n&gt; &gt; paranormal experts.\n&gt; &gt; \n&gt; &gt; Those that do get it, I&#39;m told are too f--- lazy to turn a radio dial, yet\n&gt; &gt; are somehow more qualified to get higher spirit communication.\n&gt; &gt; \n&gt; &gt; I don&#39;t know what to say, I thought I was totaly fed up before.... Just\n&gt; &gt; keep chasing yuur retarded lime lights--that&#39;s fame a fortune that 99% here\n&gt; &gt; are really after, and forget I was ever here!\n&gt; &gt; \n&gt; &gt; Supposedly you have to crawl before you walk, y&#39;all want to skip crawling,\n&gt; &gt; and walking and fly the space shuttle. Clueless!!\n&gt; &gt; \n&gt; &gt; Frank-S\n&gt; &gt;\n&gt;"}