{"id": "20562", "subject": "Re: Just A Little Spoiled", "author": "EdT", "timestamp": "2011-02-04T13:19:35Z", "full_text": "Bruce\nBelieve me I hear where you are coming from.  Too bad you do not live here.  I would like to talk to you abour your box.  I need to know more abour yuour silent session EVP.\n\nEd Tieman\nbe188e@...\n\n\n--- In EVP-ITC@yahoogroups.com, bruce halliday &lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; \n&gt; Dave,\n&gt;  \n&gt; I left the aa-evp about two years ago.\n&gt; After being a participating member and even working with a few\n&gt; other select members on cold case EVP the butlers did not feel that anything but an a+\n&gt; quality evp was acceptable. Tom had explained to me that my EVP files where edited so therefore\n&gt; in his opinion useless and my services would be no longer needed.\n&gt;  \n&gt; When I say edited I mean the volume was amplified because we were doing silent EVP in a silent room.\n&gt; He suggested we ask a series of questions before the evp session and then turn the recorder on and let it run.\n&gt;  \n&gt; I received numerous messages pertaining to the cases we worked on including names, places, dates and where the remains\n&gt; of the victim could be found. The evp files where discarded and never brought to light because tom and Lisa did not feel they where worthy\n&gt; because they had some of the static hiss removed and had been amplified.\n&gt;  \n&gt; I tried repeatedly to explain that unless the disembodied spirit where grounded in the location and close proximity to the recorder how was it\n&gt; possible to catch class A+ evp&#39;s.\n&gt;  \n&gt; Well to make a long story no longer,\n&gt; We had a parting of the way&#39;s and I left the organization. I firmly believe that the Butlers would never be open to the idea of box research.\n&gt;  \n&gt; Bruce\n&gt; Bruce Halliday \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: lisby@...: Tue, 29 Jan 2008 15:00:02 +0000Subject: [EVP-ITC] Re: Just A Little Spoiled\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Well, I&#39;m glad to hear it, but as of last week, the leaders wereunreceptive to the idea that this phenomenon was real.Ann--- In EVP-ITC@yahoogroups.com, &quot; RetroCom&quot; &lt;vfp19968@&gt; wrote:&gt;&gt; There is a radio sweep forum on AA-EVP for members. They have alsocreated an Etheric studies wiki that mentions Frank&#39;s Box and the MiniBox. I&#39;ll see if I can find the link for this, it is accessable by thepublic.&gt; &gt; Dave&gt; &gt; --- lisby@ wrote:&gt; &gt; From: Lisby &lt;lisby@&gt;&gt; To: EVP-ITC@yahoogroups.com&gt; Subject: Re: [EVP-ITC] Just A Little Spoiled&gt; Date: Tue, 29 Jan 2008 04:45:55 -0500&gt; &gt; Very interested. And I agree with you about the overnight change. &gt; Orgs like AA-EVP that aren&#39;t dealing with the boxes are missing the &gt; boat.&gt; &gt; Ann&gt; &gt; On Jan 28, 2008, at 8:48 PM, Jules wrote:&gt; &gt; &gt; Well guys, I have to tell you that since I started box sessions in&gt; &gt; November I have become so spoiled that conventional EVP just don&#39;t do&gt; &gt; it for me.&gt; &gt;&gt; &gt; My organization was asked to come and do an investigation at a very&gt; &gt; historial place (here in Illinois). The owner of this home asked if I&gt; &gt; would bring one of the boxes to the home (he is amazed with the&gt; &gt; immediately 2 way communication). So upon respectfully asking my tec&gt; &gt; if it was alright to do a session outside the my home we did several&gt; &gt; box sessions along with conventional EVP. We wanted to see if we could&gt; &gt; discover some unanswered history about the residence, and the &gt; &gt; otherside&gt; &gt; was more than willing to comply.&gt; &gt;&gt; &gt; I have to tell you that the regular EVP recordings were and are the&gt; &gt; most boring data to review. Something I use to love so much has&gt; &gt; actually turned into a project given I am waiting for a response&gt; &gt; immediately! Too funny how things can change overnight!&gt; &gt;&gt; &gt; I will be uploading some files for these sessions if you are &gt; &gt; interested.&gt; &gt;&gt; &gt; Juli&gt; &gt;&gt; &gt;&gt; &gt;&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Shed those extra pounds with MSN and The Biggest Loser!\n&gt; http://biggestloser.msn.com/\n&gt;"}