{"id": "20573", "subject": "Re: Watch these, what&#39;s going on in the world?", "author": "Adriana Jones", "timestamp": "2011-02-05T20:05:25Z", "full_text": "Just saw the video with the horse... wow that&#39;s really freaky... it&#39;s like a ghost, no one disperses where it rides through, and it just vanishes into thin air as it goes into the thicker crowd.... very visible, half translucent and sort of blurry\n\nwell it&#39;s either \n\na) a hoax or an unintended glare from somewhere\nor \nb) the real thing\n\nThat&#39;s about the only two options....\n\n--- In EVP-ITC@yahoogroups.com, &quot;Adriana Jones&quot; &lt;adrianamjones@...&gt; wrote:\n&gt;\n&gt; Australia&#39;s been very badly beaten by weather lately, strange stuff with animals dying - I have to admit it&#39;s strange and they don&#39;t give plausible explanations and insult our intelligence - revolutions in the Middle East.... like I&#39;ve said before, Snow, I do have to give you that if these aren&#39;t the end times, I&#39;d hate to see how much worse it can look.... and as for me, I know how morbid this sounds, but you know what if its the end, please please please bring it on, I am so weary of the nastiness of people and what they&#39;ve done to this world and each other... on the other hand, we also had revolutions before in 1989 and it wasn&#39;t the end of the world, and they say animals die off all the time in nature (albeit with acceptable explanations).... and we&#39;ve always had natural weather disasters... is it possible that the media is just covering stuff too much, or that we&#39;re all very connected with the internet, so we have an overload of bad news all the time?  (Cause you know the media is not going to give us the good news, its just doesn&#39;t sell as well as the bad news).... who knows... I have a friend who is Christian and she says that it feels like we&#39;re living in the last days of Rome... sadly, by what I see around me, I really have nothing with which I can disagree... we can only wait and see....\n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, SnowfireL@ wrote:\n&gt; &gt;\n&gt; &gt; _http://www.youtube.com/watch?v=P3pDxJNEIBQ&feature=feedu_ \n&gt; &gt; (http://www.youtube.com/watch?v=P3pDxJNEIBQ&feature=feedu) \n&gt; &gt;  \n&gt; &gt; _http://www.youtube.com/watch?v=plrf5PVyoQ4&feature=related_ \n&gt; &gt; (http://www.youtube.com/watch?v=plrf5PVyoQ4&feature=related) \n&gt; &gt;  \n&gt; &gt;  \n&gt; &gt; _http://www.youtube.com/watch?v=dNNMwpDt5R8&feature=feedu_ \n&gt; &gt; (http://www.youtube.com/watch?v=dNNMwpDt5R8&feature=feedu) \n&gt; &gt;  \n&gt; &gt; This stuff is so weird, wonder what is happening, an Egyptian friend of  \n&gt; &gt; mine the only Christian Coptic Church was destroyed by Muslims.   sf\n&gt; &gt;\n&gt;"}