{"id": "20627", "subject": "Re: Aaaaa at last, the purpose of life.", "author": "purplespacefriend", "timestamp": "2011-02-09T06:19:42Z", "full_text": "I don&#39;t know the bible, just repeat what I heard/read somewhere. Mostly it sounds just like the 72 virgin thing. All the time in the world--two years! That&#39;s what I meant. \n\n F-S\n\n--- In EVP-ITC@yahoogroups.com, Snowfire Lioness &lt;SnowfireL@...&gt; wrote:\n&gt;\n&gt;  Yeah, I know &quot;rapture&quot; isn&#39;t in Bible, however, &quot;resurrection is&quot; that&#39;s the word the spirit&#39;s are using mostly.  Yep, we do have all the time in the world right now, but even 1000 when ya think about it really isn&#39;t very long.  I don&#39;t think anyone really knows the date, the world is going to be made fresh, and we should all have body&#39;s that don&#39;t brake down, you will know who you are, from what I&#39;ve heard we&#39;ll have a youthful look, and be able to get around really well.  Just don&#39;t count the chickens until the eggs have hatched  :)    sf\n&gt; \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; -----Original Message-----\n&gt; From: purplespacefriend purplealiengirl@...\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Mon, Feb 7, 2011 6:24 pm\n&gt; Subject: [EVP-ITC] Re: Aaaaa at last, the purpose of life.\n&gt; \n&gt;                                               So if you&#39;re not Christian, you have all the time in the world?\n&gt;  \n&gt;  Yeah, I get some saying it&#39;s this month, or next month, or August, or October. I&#39;ll stick with December 2012, and even that I&#39;m not taking to the bank.\n&gt;  \n&gt;  FYI, rapture ain&#39;t in the bible. I wouldn&#39;t want to be stuck in/with this body --forever--wrong frikin&#39; gender! And species.\n&gt;  \n&gt;  F-S\n&gt;  \n&gt;  --- In EVP-ITC@yahoogroups.com, SnowfireL@ wrote:\n&gt;  &gt;\n&gt;  &gt; Great file Frank!  Says, &quot;time on earth&quot; then a different person says,  &quot;is \n&gt;  &gt; it?&quot;  They are talking about the limited time we are going to be here  now, \n&gt;  &gt; if you are Christian and believe, you will be taken up, body and all,  \n&gt;  &gt; believers will be the only ones that see Him in the sky, our physical body will  \n&gt;  &gt; be changed, and it won&#39;t hurt, the sensation will fell like when someone  \n&gt;  &gt; stretches, the adrenalin will kick in, we disappear to others around us, and \n&gt;  &gt; up  we go!  I am told it will be soon now, all I got to say is,   Yikes!  sf\n&gt;  &gt;  \n&gt;  &gt;  \n&gt;  &gt; In a message dated 2/6/2011 3:41:15 A.M. Eastern Standard Time,  \n&gt;  &gt; purplealiengirl@ writes:\n&gt;  &gt; \n&gt;  &gt;  \n&gt;  &gt;  \n&gt;  &gt; [_Attachment(s)_ (mip://05cab578/default.html#TopText)  from Frank  \n&gt;  &gt; Sumption included below]  \n&gt;  &gt; Yeah, just listen to the music. This is from a couple days ago  using that \n&gt;  &gt; Suntone radio. Yeah, I know, it&#39;s one of those messags assembled  from \n&gt;  &gt; frags, but &quot;they&quot; did the assembling!\n&gt;  &gt;  \n&gt;  &gt;  F-S\n&gt;  &gt;\n&gt;"}