{"id": "20672", "subject": "Re: My un-understanding", "author": "Adriana Jones", "timestamp": "2011-02-11T17:42:33Z", "full_text": "For being involved in a field where no one, not even the &quot;experts&quot;, really knows anything definitively, a lot of people sure do get arrogant, and act like know it alls.... very stupid indeed.  This does not mean that everything you say has to come out sounding unsure, but it does mean that you think twice before you yell out dramatically &quot;demon!&quot; or before you discredit someone else in your own mind....\n\n--- In EVP-ITC@yahoogroups.com, Ursula Kalin &lt;kalinu@...&gt; wrote:\n&gt;\n&gt; but you know I have seen that where some people who go \n&gt; ghost hunting..are so quick to say &quot;Mg it&#39;s a demon&quot; that&#39;s funny lol...I don&#39;t know if it&#39;s because they are trying to make a name for themselves or just plan stupid\n&gt; \n&gt; --- On Fri, 2/11/11, Adriana Jones &lt;adrianamjones@...&gt; wrote:\n&gt; \n&gt; \n&gt; From: Adriana Jones &lt;adrianamjones@...&gt;\n&gt; Subject: [EVP-ITC] Re: My un-understanding\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Friday, February 11, 2011, 1:50 AM\n&gt; \n&gt; \n&gt;   \n&gt; \n&gt; \n&gt; \n&gt; oh dear god, there are actually people who intentionally seek out demons???? wait, aren&#39;t they called satanists? I think there should be like a universal rule in paranormal investigation against intentionally trying to seek that out. Who in their right mind, willing to believe that the other side exists, would intentionally seek out its darkest most negative aspects???? \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; &lt;purplealiengirl@&gt; wrote:\n&gt; &gt;\n&gt; &gt; I seem to run into moslty the ones that are after domons and the darkest crap they can dig up. \n&gt; &gt; \n&gt; &gt; F-S\n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, Ursula Kalin &lt;kalinu@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; Most people I know areÂ in a group are not in it to be scared..Like you AdrianaÂ they looking for proof of some kind..I&#39;m a founder of a group..but I don&#39;t go ghost hunting..lol I don&#39;t have to,Â  I understand that some people are still looking for personal reasons or just being curious...I don&#39;t have my group paying for places we go..unless its like a very hot spot such as Mansfield which we are going in April but most places we go we are invited free of charge..we were just at a &quot;haunted hotel&quot; for free.\n&gt; &gt; &gt; \n&gt; &gt; &gt; --- On Thu, 2/10/11, Adriana Jones &lt;adrianamjones@&gt; wrote:\n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; From: Adriana Jones &lt;adrianamjones@&gt;\n&gt; &gt; &gt; Subject: [EVP-ITC] Re: My un-understanding\n&gt; &gt; &gt; To: EVP-ITC@yahoogroups.com\n&gt; &gt; &gt; Date: Thursday, February 10, 2011, 4:24 PM\n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; Â  \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; I never wanted to be scared. That was never my intention when I joined a ghosthunting group. I just wanted to make contact with something other than physical human. And I definitely got to, even felt what was apparently a ghost (the tingling feeling in the air). And I was happy, and it felt peaceful. I think I&#39;d be equally happy to meet a space alien coming out of a spaceship. As long as they didn&#39;t laser beam me when I go to hug them. :)\n&gt; &gt; &gt; \n&gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;Adriana Jones&quot; &lt;adrianamjones@&gt; wrote:\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Agreed. I was introduced to the ghost box at a paranormal group meeting, but ever since then the vast majority of my sessions have been at home. I went to a few cemeteries at midnight at first, but that quickly wore off when I realized that I get equal, and even better, communication, just sitting at the dining room table.\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; &lt;purplealiengirl@&gt; wrote:\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; My approach to EVP and ITC is for spirit communcation not associated with supposed hauntings. That&#39;s why I find it frustrating that most insist on running aorund in the dark to get evidence and EVP when they could stay home and get much more. Spirits and entities travel, even the ones that are supposedly stuck will come to you if asked. I don&#39;t like the Halloween, and fear crap. I think most just want to be frightened, so they pay gigabucks to go the haunted hot spots hoping beyond hope to get scared out their wits by imaginary demons.\n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; F-S\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}