{"id": "20709", "subject": "Re: Just incase", "author": "Urkel23", "timestamp": "2011-02-12T23:04:54Z", "full_text": "That dumpster big enough for my stuff too !\n\n-Steve\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  That&#39;s the thing, no hears this stuff, and don&#39;t think it&#39;s just my files, most EVPs are just as subjective. I don&#39;t let other people send me stuff from their boxes and other mehtods, cuz when I don&#39;t hear it they get all pissed off. I think we get enough that others can hear to show there is something to this, but most of he messages are for personal use only. Meant for the one doing the session...or I&#39;m just not one of the thirty!\n&gt; \n&gt;  There is always someone that somehow in their minds their hearing is far superior to anyone leses and what they hear some how takes presedence over all others. \n&gt; \n&gt;  I can&#39;t teach anyone how to hear, and don&#39;t know where else this stuff can be taken, &#39;cept maybe the dumpster out back. \n&gt; \n&gt;  F-S\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Adriana Jones&quot; &lt;adrianamjones@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Although I would not have been able to make out what this file says without your words, with your suggested words, I very much hear it.... despite the fact that the words are not entirely clear, there are no parts of any of the words spoken that sound DISSONANT or OPPOSED to being the words you suggested.  All sounds fall perfectly into place as being what you said.  And that is very very scary.  Lets hope that they are just plain freaking lying, or are being misinformed.\n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; I know no one wiol hear it, and I&#39;ll get some &quot;this is waht it really says&quot;,\n&gt; &gt; &gt; but......Don&#39;t know what it means exactly, but I&#39;ve gotten that for months,\n&gt; &gt; &gt; and somoehtign about the 17th for yesars. but waht do I know?\n&gt; &gt; &gt; \n&gt; &gt; &gt;  FYI, dumped Facebook, first it&#39;s a huge waste of time, and second, more of\n&gt; &gt; &gt; these self proclaimed experts, psychics, and mediums telling me what this\n&gt; &gt; &gt; stuff really is, that my stuff doesn&#39;t anything, and...one guy that can&#39;t\n&gt; &gt; &gt; even be 40 telling me he got his first EVP in 1976--what when he was\n&gt; &gt; &gt; freaking two years old!? I&#39;m about done, can&#39;t even explain this shit\n&gt; &gt; &gt; without the one I&#39;m trying to explain it to getting all pissy, like how dare\n&gt; &gt; &gt; I state how the boxes work. So, when I don&#39;t answer your e-mail, that&#39;s why.\n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; Frank-S\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}