{"id": "20785", "subject": "Re: Frank please read this....", "author": "eastern_paranormal", "timestamp": "2011-02-19T14:23:24Z", "full_text": "He wrote me back on YouTube. Here is what he had to say:\n\nOCPRS \n Re: Hello From Gabreael Of Eastern Paranormal \n\nThanks for the advice. The truth is, 90% of the people out there using a Ghost Box are imitating Frank&#39;s Box, but are not using a Frank&#39;s Box. There are some variations. Since Frank Sumption only makes these boxes (on the instructions of &quot;spirits&quot;) for specific people, his supporters will always argue that we have to use it before debunking it. However, like 90% of the paranormal investigators using a version of a Ghost Box, we did do some tests. Sometimes we thought it worked but when held up against Cognitive Bias phenomenon, the results were not only inconclusive, but obvious we were getting caught up in trying to recognize only the words that made sense to the questions asked. \n\nBut still, I truly appreciate your kind words and advice. To be honest, I&#39;m not looking for respect, just the truth. \n\nGod bless.\nSent to: eparanormal  \n\n--- In EVP-ITC@yahoogroups.com, &quot;eastern_paranormal&quot; &lt;eparanormal@...&gt; wrote:\n&gt;\n&gt; I just emailed these people, I have never heard of them. This is want I sent them through YouTube:\n&gt; \n&gt; Hello,\n&gt; \n&gt; I was a GB skeptic. I had seen someone doing a presentation, &  a bad one at that. I was sure it was fraudulant. So I built one and it took a good many tries. I was about to chuck the thing (It was around 6 or 7 different days we had tried), and me and one of my members picked someone up clear as could be. It was very bizaar. If you want others in the field to respect you do this. Build yourself a box or two. Tape yourself recording over it, over a few months at least. Then present what you have/don&#39;t have.\n&gt; \n&gt; There is so much mud slinging in this community. We should be lifting each other up instead of tearing each other down. However, you have a right to your own opinion, we all do. Just present it logically and with your own evidence. Also posting Franks name and picture is a tad crude. I&#39;d suggest making your video private until you can present some evidence to support your claims.\n&gt; \n&gt; Gabreael\n&gt; www.easternparanormal.com \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Tim Woolworth &lt;tjwoolworth@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Thanks for pointing this out, Gab.  I posted my two cents worth.\n&gt; &gt; \n&gt; &gt; Them,\n&gt; &gt; \n&gt; &gt; On Sat, Feb 19, 2011 at 12:40 AM, eastern_paranormal &lt;eparanormal@&gt;wrote:\n&gt; &gt; \n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; Frank,\n&gt; &gt; &gt;\n&gt; &gt; &gt; I don&#39;t know these idiots, but I would suggest you report this to YouTube\n&gt; &gt; &gt; since they have your picture up and your name for copyright issues or\n&gt; &gt; &gt; slander:\n&gt; &gt; &gt;\n&gt; &gt; &gt; http://www.youtube.com/watch?v=KgLVbBd7Ybg\n&gt; &gt; &gt;\n&gt; &gt; &gt; Gab\n&gt; &gt; &gt;\n&gt; &gt; &gt;  \n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}