{"id": "20783", "subject": "Re: [EVP-ITC] Re: Frank please read this....", "author": "hjkrol59@yahoo.com", "timestamp": "2011-02-01T07:43:59Z", "full_text": "i saw that lame video. i have 5 gb for my team and have gotten great\nresults with the boxes . i do not know this grp frm across the pond\n, but please do not confuse them with my open group cprs- columbia paranormal research society or my team columbia paranormal. i think their attack on frank is wrong.\n\nHolly mcgee\ndirector, columbia paranormal and columbia paranormal research society\nwww. columbiaparanormal. com/news\n\nOn Feb 19, 2011, at 12:40 AM, &quot;eastern_paranormal&quot; &lt;eparanormal@...&gt; wrote:\n\n&gt; I just emailed these people, I have never heard of them. This is want I sent them through YouTube:\n&gt; \n&gt; Hello,\n&gt; \n&gt; I was a GB skeptic. I had seen someone doing a presentation, & a bad one at that. I was sure it was fraudulant. So I built one and it took a good many tries. I was about to chuck the thing (It was around 6 or 7 different days we had tried), and me and one of my members picked someone up clear as could be. It was very bizaar. If you want others in the field to respect you do this. Build yourself a box or two. Tape yourself recording over it, over a few months at least. Then present what you have/don&#39;t have.\n&gt; \n&gt; There is so much mud slinging in this community. We should be lifting each other up instead of tearing each other down. However, you have a right to your own opinion, we all do. Just present it logically and with your own evidence. Also posting Franks name and picture is a tad crude. I&#39;d suggest making your video private until you can present some evidence to support your claims.\n&gt; \n&gt; Gabreael\n&gt; www.easternparanormal.com \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Tim Woolworth &lt;tjwoolworth@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Thanks for pointing this out, Gab. I posted my two cents worth.\n&gt; &gt; \n&gt; &gt; Them,\n&gt; &gt; \n&gt; &gt; On Sat, Feb 19, 2011 at 12:40 AM, eastern_paranormal &lt;eparanormal@...&gt;wrote:\n&gt; &gt; \n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; Frank,\n&gt; &gt; &gt;\n&gt; &gt; &gt; I don&#39;t know these idiots, but I would suggest you report this to YouTube\n&gt; &gt; &gt; since they have your picture up and your name for copyright issues or\n&gt; &gt; &gt; slander:\n&gt; &gt; &gt;\n&gt; &gt; &gt; http://www.youtube.com/watch?v=KgLVbBd7Ybg\n&gt; &gt; &gt;\n&gt; &gt; &gt; Gab\n&gt; &gt; &gt;\n&gt; &gt; &gt; \n&gt; &gt; &gt;\n&gt; &gt;\n&gt; \n&gt; \n\ni saw ha lame ideo. i ha e 5 gb o my eam and ha e go en g ea esul s wi h he boxes . i do no know his g p m ac oss he pond, bu please do no con use hem wi h my open g oup cp s- columbia pa ano mal esea ch socie y o my eam columbia pa ano mal. i hink hei a ack on ank is w ong.Holly mcgeedi ec o , columbia pa ano mal and columbia pa ano mal esea ch socie ywww. columbiapa ano mal. com/newsOn Feb 19, 2011, a 12:40 AM, \"eas e n_pa ano mal\" epa ano mal@...> w o e:\n\n\n\n\n \n\n\n\n \n \n \n I jus emailed hese people, I ha e ne e hea d o hem. This is wan I sen hem h ough YouTube:\n\nHello,\n\nI was a GB skep ic. I had seen someone doing a p esen a ion, & a bad one a ha . I was su e i was audulan . So I buil one and i ook a good many ies. I was abou o chuck he hing (I was a ound 6 o 7 di e en days we had ied), and me and one o my membe s picked someone up clea as could be. I was e y bizaa . I you wan o he s in he ield o espec you do his. Build you sel a box o wo. Tape you sel eco ding o e i , o e a ew mon hs a leas . Then p esen wha you ha e/don' ha e.\n\nThe e is so much mud slinging in his communi y. We should be li ing each o he up ins ead o ea ing each o he down. Howe e , you ha e a igh o you own opinion, we all do. Jus p esen i logically and wi h you own e idence. Also pos ing F anks name and pic u e is a ad c ude. I'd sugges making you ideo p i a e un il you can p esen some e idence o suppo you claims.\n\nGab eael\nwww.eas e npa ano mal.com \n\n--- In EVP-ITC@yahoog oups.com, Tim Woolwo h w o e:\n>\n> Thanks o poin ing his ou , Gab. I pos ed my wo cen s wo h.\n> \n> Them,\n> \n> On Sa , Feb 19, 2011 a 12:40 AM, eas e n_pa ano mal w o e:\n> \n> >\n> >\n> > F ank,\n> >\n> > I don' know hese idio s, bu I would sugges you epo his o YouTube\n> > since hey ha e you pic u e up and you name o copy igh issues o \n> > slande :\n> >\n> > h p://www.you ube.com/wa ch? =KgLVbBd7Ybg\n> >\n> > Gab\n> >\n> > \n> >\n>"}