{"id": "20813", "subject": "Re: Inform the planet!?", "author": "purplespacefriend", "timestamp": "2011-02-22T03:27:12Z", "full_text": "What if what was writtn is totally mistranslated? \n\nF-S\n\n--- In EVP-ITC@yahoogroups.com, SnowfireL@... wrote:\n&gt;\n&gt; Wish He would, thing is He must follow what has  been written first, when \n&gt; He does &quot;come in clouds&quot; at first, He will raise the  dead, I was told by \n&gt; David the Tech, that it will be only the material physical  matter left from \n&gt; those Christians that died over the years, that will just  vanish from where \n&gt; ever they are, He will use Holy Spirit to do this, HS is the  most powerful \n&gt; force in the Universe, He can be a soft as a kitten&#39;s fur, and  tougher than \n&gt; molten lava! \n&gt;  \n&gt; After the dead rise they will form into new  body&#39;s spirit type, but \n&gt; different then the way it is now, we who are in  body&#39;s now, will then be changed, \n&gt; in essence we will die, so quickly we will not  realize what happened, and \n&gt; will leave the physical world, the physical body  changes, and we become a \n&gt; new physical/spirit being and we will be taken into  Heaven for about 2.5 \n&gt; years it would have been 3 full years our time, but it&#39;s  been moved up \n&gt; somewhat.\n&gt;  \n&gt; People left on Earth will have a terrible time  here, with wars, no food, \n&gt; water, you know the rest...about that time the  antichrist will step in to \n&gt; control Europe, David told me, the antichrist will  not get the US, Canada, \n&gt; England, Australia, or even Russia, because these  countries will give him too \n&gt; hard a time.  The antichrist was some man born  in Spain, and is now living \n&gt; in Rome, is about 30 years old right now, and he  will come into power by \n&gt; his charm, and fool many at first he will be a nice guy,  fooling all \n&gt; county&#39;s but the ones I mentioned.\n&gt;  \n&gt; After a couple years he will demand to be  worshiped as God, and will have \n&gt; people believe he is JC, though many will not  believe it, and it will be \n&gt; made to suffer without food, and water, living will  be terrible for \n&gt; everything, and all except those countries I mentioned will  fall under his spell.  \n&gt; He will some how get a massive war started up, but  he won&#39;t stay in power \n&gt; very long though, because the real Jesus will then return  with all of us, \n&gt; must be gonna be some kind of event horizon or something, and  then He will  \n&gt; rebuild the Earth, set up His place of residence in  Jerusalem, which all will \n&gt; visit, we will all have fresh new physical/spirit type  body&#39;s, if you lost \n&gt; a tooth in the current body, you will have a new tooth back,  if you lost a \n&gt; limb, that limb will be back, but the new physical/spiritual type  body&#39;s \n&gt; will be stronger, and last us, JC will be here living with us for 1000  years \n&gt; our time, after that, is when He will return into the spiritual side  \n&gt; again, then afterward will return a different type of person, He will become  \n&gt; different in personality, and because, He now must be &quot;The Judge.&quot;    (His \n&gt; current personality is much too kind, heck he is letting people into the  now if \n&gt; they are sincere with apology and repent from how they acted, and are  \n&gt; willing to make up for crimes done.  Those who are Christian now, will not  be \n&gt; in that long line in darkness, now when they die, they are automatically in  \n&gt; light, that&#39;s why prayers, and leading them toward the light now does help \n&gt; those  in darkness now to get &quot;go to the light.&quot;  We hear them begging us for \n&gt; help  everyday we turn on a &quot;ghost box.&quot;)\n&gt;  \n&gt; This is when He judges the world, and those not  living in light, will get \n&gt; stuck in total darkness, they will not suffer through  torture, God is not \n&gt; into the torture thing, that is lies of Church to control  the people for \n&gt; years, heck, God didn&#39;t even enjoy those burnt offerings, that is  why He came \n&gt; to us through JC in the first place so, it wouldn&#39;t happen anymore,  but \n&gt; some do not believe in what He did.  Those that do evil will just  disappear as \n&gt; the Naphilim  did in the time of Noah, the energy from  their spirit&#39;s just \n&gt; changed into something else or He took it back since He can  make evil \n&gt; change into good things too.  While we are being judged, one at a  time, that \n&gt; will take a long time too, He does the same thing now, that is why  the line \n&gt; of those in spirit darkness is so long, David the Tech told me, and my  son \n&gt; and grandson one day, that JC works pretty much 24/7 taking people into the  \n&gt; light, they enter, repent (say they are sorry) and mean it, then He talks \n&gt; with  each person one at a time, taking about 10 minutes our time with each \n&gt; spirit,  that person&#39;s guardian angel go into another room to talk, the Angel \n&gt; opens a  &quot;book of life&quot; for that spirit, and they talk about what must be \n&gt; made up over  there, then the loved ones, and pets  meet up, they all go into  \n&gt; another room to talk about things, then that person goes to their living \n&gt; place,  given consul or whatever, some even go to school again, while others \n&gt; must serve  out sentences in a prison but at least that prison is in the \n&gt; light, it is where  they get those things they need to live on, some are still \n&gt; in need of developing  a conscience, something they never developed on earth \n&gt; when they were  here.\n&gt;  \n&gt; After He is finished judging this world, I was  told He will get to work \n&gt; with that planet we call Jupiter!  Cool eh?   He will put water on it first \n&gt; thing, it will take many thousands of years, but  it will develop into a great \n&gt; new planet to live on, I know sounds very far  fetched, but this is what \n&gt; David the tech says, believe it or not!  We live  and die on this planet is \n&gt; like a drop of sand in a bucket when compared  to eternity.   David told me \n&gt; that &quot;God wants family, and  only asks for our love and respect, when we love \n&gt; someone, we will respect that  person too.&quot;   Sorry, I got so wordy, now you \n&gt; all can shoot me  down. &lt;g&gt;  sf\n&gt;  \n&gt;  \n&gt; In a message dated 2/21/2011 4:10:31 A.M. Eastern Standard Time,  \n&gt; eyedontwant2say@... writes:\n&gt; \n&gt;  \n&gt;  \n&gt;  \n&gt; There is a group &#39;&#39;familyradio.org i think, anyways billboards all over  \n&gt; saying &#39;&#39;JESUS IS COMING MAY 21,2011. THEY THINK THIS IS  12/21/2012\n&gt; -----Original Message-----\n&gt; Date: Sunday, February 20, 2011  9:55:35 pm\n&gt; To _EVP-ITC@yahoogroups.com_ (mailto:EVP-ITC@yahoogroups.com) , \n&gt; _RTSC@yahoogroups.com_ (mailto:RTSC@yahoogroups.com) \n&gt; From: &quot;Frank  Sumption&quot; &lt;_purplealiengirl@..._ \n&gt; (mailto:purplealiengirl@...) &gt;\n&gt; Subject:  [EVP-ITC] Inform the planet!? [2 Attachments]\n&gt; \n&gt; Been gettng something  aobut May 17th, now &quot;they&quot; say it starts May \n&gt; 15th--I&#39;m like WTF is this?  There seems to be othere that have pridistion \n&gt; as well, but it&#39;s almost as  reliable as this stuff. This is from EVPmkaer \n&gt; tonight, using the origianl  raw files I used ten years ago. \n&gt; \n&gt; &quot;Thanks for writing Frank! However, it  was not me who made the \n&gt; prediction....I was talking about a Christian  scholar who has done some \n&gt; research and through his recalculation has  determined that the predicted \n&gt; 2012 shift will be occurring around May 17th  2011...he also says this is \n&gt; the \n&gt; date when Jesus will be returning to  Earth. Very interesting, we&#39;ll \n&gt; see......&quot; \n&gt; \n&gt; \n&gt; Soooo, whatever.  \n&gt; \n&gt; F-S\n&gt;"}