{"id": "20828", "subject": "Re: another youtube channel", "author": "Urkel23", "timestamp": "2011-02-22T23:33:44Z", "full_text": "Maybe it was the dead bird talking to you\n\n-Steve\n\n\n\n--- In EVP-ITC@yahoogroups.com, SnowfireL@... wrote:\n&gt;\n&gt; lol, Frank you need to get one &lt;s&gt; that guy keeps writing to me, I  told \n&gt; him about my green Macaw who got out the other day, and I&#39;ve lost so many  \n&gt; birds out in the woods over the years, it&#39;s so cold out there now, I doubt if \n&gt; he  survived the night, so I asked my spirit box friends, and they all say, \n&gt; Yes,  that dr green is on over there with them, he crossed over last night, \n&gt; so sad,  the last message is mind boggling, it&#39;s a lady&#39;s voice so very clear \n&gt; i will post  it for all you guys, and the bird is in it too.  She says, \n&gt; &quot;Yes, Bonnie&quot;  then the bird speaks up, then what is so amazing is she is now \n&gt; in reverse,  completing the sentence with, &quot;you know I am safe.&quot;  I&#39;m so \n&gt; happy I&#39;m  crying, there has got to be a reason we are able to hear them now.  I \n&gt;  looked everywhere for the bird yesterday, last night, he must have froze \n&gt; to  death, but at least he is safe now with the angels.  How in the world \n&gt; does  this kind of thing work????  The lady sounds a bit like my mom, this is a \n&gt;  reverse file!!!!   How the heck do they do this stuff?  sf\n&gt;  \n&gt;  \n&gt; In a message dated 2/22/2011 2:44:37 A.M. Eastern Standard Time,  \n&gt; purplealiengirl@... writes:\n&gt; \n&gt;  \n&gt;  \n&gt;  \n&gt; \n&gt; I must be the only one in the world without a youtube channel, podcast,  \n&gt; radio show, and movie rights. \n&gt; \n&gt; F-S\n&gt; \n&gt; --- In _EVP-ITC@yahoogroups.com_ (mailto:EVP-ITC@yahoogroups.com) , \n&gt; &quot;Adriana  Jones&quot; &lt;adrianamjones@&gt; wrote:\n&gt; &gt;\n&gt; &gt; I, too, have started  one with GB stuff... whoever feels like it friend \n&gt; and/or subscribe it,  thanks!\n&gt; &gt; \n&gt; &gt; _http://www.youtube.com/evphenomenon_ \n&gt; (http://www.youtube.com/evphenomenon) \n&gt; &gt;\n&gt;"}