{"id": "20850", "subject": "Re: This one scary!", "author": "Urkel23", "timestamp": "2011-02-24T00:53:17Z", "full_text": "OMG !\n\n\n\n--- In EVP-ITC@yahoogroups.com, Snowfire Lioness &lt;SnowfireL@...&gt; wrote:\n&gt;\n&gt;  I know you guys will laugh at this stuff, but David the Tech told me, that &quot;YOU know Who&quot; up there &quot;is going to make the planet Jupiter a place for people to live, a new star will be brought into place near Jupiter, it will have two stars, sitting at a triangle, because it is such a huge planet, it will need more energy from stars to warm it enough, and it&#39;s rotation cycle is very long too so, for life to survive there, changes will be made.  Plus He is going to create water falls, around the planet too.&quot;  Don&#39;t ask, I know ha ha&quot;  I am just repeating what I was told.&quot;  This will happen after He redoes the Earth, and He may fix up even Mars once again, oh yeah, Mars was at one time inhabited, but they destroyed the planet.  One day we will dig up the evidence there,  &quot;God only wants us to believe in Him is all, He only wants our Love and Respect.&quot;  &quot;We will also have long life spans, and life itself will exist in a healthy state because the thing known as death will be no more.&quot;  sf\n&gt; \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; -----Original Message-----\n&gt; From: Snowfire Lioness SnowfireL@...\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Wed, Feb 23, 2011 9:08 am\n&gt; Subject: Re: [EVP-ITC] This one scary!\n&gt; \n&gt;                                               \n&gt;  Very interesting link Frank, it has all kinds of things on it, one would think it would also have what you do there too, and our voices should be there as well, guess they don&#39;t really know about all of the ghost/spirit box researchers out there yet.\n&gt;  \n&gt;    \n&gt;  \n&gt;   \n&gt;  \n&gt;  -----Original Message-----\n&gt;  From: Frank Sumption purplealiengirl@...\n&gt;  To: EVP-ITC@yahoogroups.com; RTSC@yahoogroups.com\n&gt;  Sent: Wed, Feb 23, 2011 1:58 am\n&gt;  Subject: [EVP-ITC] This one scary!\n&gt;  \n&gt;                                                     \n&gt;   http://thealienproject.blogspot.com/\n&gt;     \n&gt;    &quot;What is also fascinating is that Elenin&#39;s maximum brightness is estimated to be seen in October or in November. Noted Mayan expert, Dr. Carl Johan Calleman believes that the Mayan Creation Cycles will end on October 28, 2011 as opposed to the popularly-held view of December 21, 2012.&quot;\n&gt;      \n&gt;    F-S\n&gt;"}