{"id": "2085", "subject": "Re: Question for everyone", "author": "bhali333", "timestamp": "2007-09-18T12:23:29Z", "full_text": "--- In EVP-ITC@yahoogroups.com, &quot;delchay2005&quot; &lt;azredant@...&gt; wrote:\n&gt;\n&gt; I will be condicting some EVP experiments next month in a very \nhaunted \n&gt; location.\n&gt; \n&gt; What does everyone think about the theory that some EVP&#39;s are \n&gt; generated by the human brain? Could this be possible?\n&gt; \n&gt; Thanks,\n&gt; \n&gt; \n&gt; James\n&gt;\n\nJames,\nThat is a really good question and worthy of some serious thought.\nI believe it is entirely possible for our subconscious mind to \ngenerate the electrical energy impulses to form an evp, BUT most evp \nresearchers if not all believe that a spirit or entity places the evp \nor message directly onto the recording medium and I believe that with \nfranks box the spirit will use the different fragments of energy \nprovided by the box to form words and phrases that are fed directly \nthrough the boxes circuitry and that allows us to hear the message in \nreal time.\n\nI do not believe an evp that is captured on location or in a \ncontrolled environment is placed on the recording medium by the \nresearcher or investigator for the simple reason that the energy \ngenerated by our physical brain which while in the physical houses \nour spirit would have to consciously direct that energy in the form \nof words or use the power of the mind to harness the ambient energy \nin the room or location and place it onto or into the recorder. and I \ndon&#39;t think that is the case. are we capable of generating spiritual \nenergy that could theoretically create an evp, yes do we have the \ncapacity to create said evp and place it were we would need it to be \nunconsciously no I don&#39;t believe we have that capability. Where as a \nspirit that is made up solely of spirit energy could intelligently\nmanipulate and place the energy to create the evp.\n\nbut that&#39;s just one researchers opinion !\n\nBruce"}