{"id": "20865", "subject": "Re: Inform the planet!?", "author": "Adriana Jones", "timestamp": "2011-02-24T17:53:30Z", "full_text": "No fair, I don&#39;t ever get techs telling me cool stuff, I just get people calling for help incessantly, and cursing and spitting at me when I don&#39;t hear them in real time....  I hope they have warm, fuzzy kitty cats wherever is the next place I end up after here...\n\n--- In EVP-ITC@yahoogroups.com, Snowfire Lioness &lt;SnowfireL@...&gt; wrote:\n&gt;\n&gt;  I know you guys will laugh at this stuff, but David the Tech told me, that &quot;YOU know Who&quot; up there &quot;is going to make the planet Jupiter a place for people to live, a new star will be brought into place near Jupiter, it will have two stars, sitting at a triangle, because it is such a huge planet, it will need more energy from stars to warm it enough, and it&#39;s rotation cycle is very long too so, for life to survive there, changes will be made.  Plus He is going to create water falls, around the planet too.&quot;  Don&#39;t ask, I know ha ha&quot;  I am just repeating what I was told.&quot;  This will happen after He redoes the Earth, and He may fix up even Mars once again, oh yeah, Mars was at one time inhabited, but they destroyed the planet.  One day we will dig up the evidence there,  &quot;God only wants us to believe in Him is all, He only wants our Love and Respect.&quot;  &quot;We will also have long life spans, and life itself will exist in a healthy state because the thing known as death will be no more.&quot;  sf\n&gt; \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; -----Original Message-----\n&gt; From: purplespacefriend purplealiengirl@...\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Wed, Feb 23, 2011 2:17 am\n&gt; Subject: [EVP-ITC] Re: Inform the planet!?\n&gt; \n&gt;                                               Looks like validation for your stuff, I had no idea this new comet stuff was going on, and the thing about the Mayan callendar ending sooner than we have been told.\n&gt;  \n&gt;  F-s\n&gt;  \n&gt;  --- In EVP-ITC@yahoogroups.com, Snowfire Lioness SnowfireL@ wrote:\n&gt;  &gt;\n&gt;  &gt;  Yeah, well something is going on, in all my years, I have never seen so many things all happening in the last few years, now it seems the last few months.Â  Another earth quake already, sf\n&gt;  &gt; \n&gt;  &gt; \n&gt;  &gt; http://www.aolnews.com/2011/02/22/new-zealand-earthquake-kills-dozens/\n&gt;  &gt; \n&gt;  &gt; \n&gt;  &gt; \n&gt;  &gt; -----Original Message-----\n&gt;  &gt; From: harpo103 rmc103@\n&gt;  &gt; To: EVP-ITC@yahoogroups.com\n&gt;  &gt; Sent: Tue, Feb 22, 2011 7:58 am\n&gt;  &gt; Subject: [EVP-ITC] Re: Inform the planet!?\n&gt;  &gt; \n&gt;  &gt;           Â                                   OY VEY!!!!!!!!!!\n&gt;  &gt;\n&gt;"}