{"id": "20875", "subject": "Re: Inform the planet!?", "author": "harpo103", "timestamp": "2011-02-25T15:45:37Z", "full_text": "Are those the radios made out of Bakelite?\n\n--- In EVP-ITC@yahoogroups.com, Zack Widup &lt;w9sz.zack@...&gt; wrote:\n&gt;\n&gt; If anyone has any catalin vacuum-tube radios they&#39;d like to throw my\n&gt; way, I&#39;ll take them! Especially the Fada &quot;bullet radios.&quot;\n&gt; :-)\n&gt; \n&gt; Zack\n&gt; \n&gt; \n&gt; On 2/25/11, harpo103 &lt;rmc103@...&gt; wrote:\n&gt; &gt; So........................chuck the ghoxtboxes then?\n&gt; &gt; Or just use radios with vacuum tubes?\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com, SnowfireL@ wrote:\n&gt; &gt;&gt;\n&gt; &gt;&gt; This is going to really sound weird to most folks, but both rich and poor\n&gt; &gt;&gt;\n&gt; &gt;&gt; people should go back to living as it was at the turn of 1900, only keep\n&gt; &gt;&gt; the\n&gt; &gt;&gt;  good things, like medicine, and start parking the cars and trucksfor\n&gt; &gt;&gt; awhile,  for at least twice a week, use the horse&#39;s again, for buggy or\n&gt; &gt;&gt; riding\n&gt; &gt;&gt; them  to work.  &lt;g&gt;  Stop the cutting of all wood for at least a year  or\n&gt; &gt;&gt; two,\n&gt; &gt;&gt; reuse some of the old stuff, stop using planes, unless in emergency,  and\n&gt; &gt;&gt; go back to using trains again, maybe just steam engine.  Keep the\n&gt; &gt;&gt; electricity, but, we should work on building more Solar panel&#39;s on homes,\n&gt; &gt;&gt;  wind\n&gt; &gt;&gt; turbines, and at least be granted big discounts by government to have\n&gt; &gt;&gt; these\n&gt; &gt;&gt; things installed in our homes.  People would lose some jobs, but they\n&gt; &gt;&gt; could  do\n&gt; &gt;&gt; similar without all the stress, Pilots could take on crop dusting for a\n&gt; &gt;&gt; while, lol  forest and land developers could become growers, planters for\n&gt; &gt;&gt; new\n&gt; &gt;&gt; trees.  Stop tearing out mountains for awhile, let the trees take root,\n&gt; &gt;&gt; so\n&gt; &gt;&gt; what if we must go the long way for awhile or things take more time, there\n&gt; &gt;&gt;\n&gt; &gt;&gt; would be less land slides.  With less driving would be less need for oil,\n&gt; &gt;&gt;\n&gt; &gt;&gt; less pumping, stop with the fishing for awhile too, over 90% of the oceans\n&gt; &gt;&gt;\n&gt; &gt;&gt; are  now being over harvested!  If we could stop eating so much of any one\n&gt; &gt;&gt;\n&gt; &gt;&gt; thing, things could improve, thing is, this whole world would need to see\n&gt; &gt;&gt; things  this way in order to save itself.  We may not be getting as warm\n&gt; &gt;&gt; as we\n&gt; &gt;&gt; think, even worse we are more then likely going into an ice age if we are\n&gt; &gt;&gt; not  careful, and the world is becoming off balance, or is shifting, and\n&gt; &gt;&gt; just\n&gt; &gt;&gt; melting  away without it&#39;s internal support system.  I think your right,\n&gt; &gt;&gt; Frank.  sf\n&gt; &gt;&gt; more vids:\n&gt; &gt;&gt;\n&gt; &gt;&gt; _http://www.youtube.com/user/Snowfirel_\n&gt; &gt;&gt; (http://www.youtube.com/user/Snowfirel)\n&gt; &gt;&gt;\n&gt; &gt;&gt;\n&gt; &gt;&gt;\n&gt; &gt;&gt; In a message dated 2/23/2011 12:26:11 P.M. Eastern Standard Time,\n&gt; &gt;&gt; purplealiengirl@ writes:\n&gt; &gt;&gt;\n&gt; &gt;&gt;\n&gt; &gt;&gt;\n&gt; &gt;&gt;\n&gt; &gt;&gt; What happend to guy spouting all the new age-crystal skulls-spirit stuff?\n&gt; &gt;&gt;\n&gt; &gt;&gt; Is it decernment, or denial? When you look at the weather, the\n&gt; &gt;&gt; earthquakes,\n&gt; &gt;&gt; the actions of humanity--getting dumber and dumber by the day, the active\n&gt; &gt;&gt;\n&gt; &gt;&gt; debunking going on, the lack of news coverage for comets--it begins to\n&gt; &gt;&gt; look\n&gt; &gt;&gt; like something is going on. I don&#39;t buy the Jesus stuff either, but that\n&gt; &gt;&gt; doesn&#39;t negate the facts.\n&gt; &gt;&gt;\n&gt; &gt;&gt; As far other planets in the solar system, I  think &quot;science&quot; has it all\n&gt; &gt;&gt; wrong, I think most are habitable in some form. I  got voices saying they\n&gt; &gt;&gt; came\n&gt; &gt;&gt; from the sixth planet, presumably in this system,  and once again I have\n&gt; &gt;&gt; ask, how would anyone else &quot;know better&quot;? I don&#39;t  believe constant and\n&gt; &gt;&gt; daily\n&gt; &gt;&gt; Earthquakes are the norm, or they wouldn&#39;t be  mentioned in the bible as a\n&gt; &gt;&gt;\n&gt; &gt;&gt; sign of the times. I think this planet is severely  fractured, and very\n&gt; &gt;&gt; little\n&gt; &gt;&gt; holding it together.\n&gt; &gt;&gt; What happens when you  don&#39;t keep moving parts lubricated--as in pulling\n&gt; &gt;&gt; out all the natural oil of  the planet? I think we are living on a future\n&gt; &gt;&gt; asteroid belt as it ceases up  and flies apart. Yet again, how would\n&gt; &gt;&gt; anyone\n&gt; &gt;&gt; &quot;know better&quot;? With only a slight  amount of research, anyone can punch\n&gt; &gt;&gt; holes in\n&gt; &gt;&gt; every &quot;scientific&quot; theory all  day long. Some dweeb in a university has a\n&gt; &gt;&gt; thought and it becomes gospel. Some  duffus does a &quot;thought experiment&quot;\n&gt; &gt;&gt; and\n&gt; &gt;&gt; it&#39;s irrefutable--how the f--- does  that work!? You think it, therefore\n&gt; &gt;&gt; it\n&gt; &gt;&gt; is by virture of titles and degree? If  you don&#39;t have titles and degrees,\n&gt; &gt;&gt;\n&gt; &gt;&gt; anything you think of is nonsensical.\n&gt; &gt;&gt;\n&gt; &gt;&gt; yeah, rambling of a lunatickingnutcase.\n&gt; &gt;&gt;\n&gt; &gt;&gt; F-S\n&gt; &gt;&gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt;"}