{"id": "2093", "subject": "Re: Question for everyone", "author": "psi_research", "timestamp": "2007-09-18T20:03:49Z", "full_text": "Even though it may be that researchers are able to record their\nthoughts on media, I feel that in many cases it is because the\nresearcher becomes part of the recording mechanism through a form of\npsychokinesis.\n\n It includes the the possibility that the researcher is actually in\ncommunication with others in the spirit realm and is transferring the\nthoughts and feeling of those other beings to the recording device.\n\n-Bill\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@...&gt; wrote:\n&gt;\n&gt; \n&gt;  I used to get that years ago, and I still get it from the Ol&#39; Lady,\nwhere she hears my thoughts. I think imprinting our voices and\nthoughts on recording media (or minds) is childs play on our higher\nlevels of existance. One might hypothesize about my &quot;Princess voices&quot;,\nand I wouldn&#39;t rule out the possiblity, but &quot;they&quot; claim a seperate\nexistence, but, what would you expect?\n&gt;  \n&gt;  Ann, you certainly sound Purple!\n&gt;  \n&gt;  Frank-S\n&gt; \n&gt; \n&gt; To: EVP-ITC@...: lisby@...: Tue, 18 Sep 2007 11:35:14 -0400Subject:\nRe: [EVP-ITC] Question for everyone\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Years ago, when I was taping on a reel to reel, mostly, I often got\nvoices that sounded maddeningly not like me, but like people I knew\nwho were not dead. They never identified themselves as those people,\nbut the voices were dead ringers (ar ar ar). I am also, apparently,\nable to randomly project my voice into the minds of people I know. It\nbegins to happen to almost everyone that I bond strongly with. I can&#39;t\ntell you how many times I have heard someone I know spin around and\nsay, &quot;What?&quot; They always say they hear my voice, but don&#39;t understand\nwhat I am saying. This is always accompanied, on my end, by a sort of\nringing sound in my head. I cannot control it at all. I&#39;m just\nthrowing this out there as food for thought that may pertain to your\ndiscussion.....AnnOn Sep 18, 2007, at 8:13 AM, Zack Widup wrote:&gt;&gt;\nVery true, Frank! The ghosts who are producing the EVP&#39;s certainly &gt;\ndon&#39;t&gt; have brains. :-)&gt;&gt; I have no doubt that there may be a few\npeople around who could &gt; create EVP&gt; phenomena in an electrronic\ndevice, but it would be an extremely small&gt; number. I think most of\nthe EVP we get are from disembodied beings who&gt; have figured out how\nto do it.&gt;&gt; Zack&gt;&gt; On Mon, 17 Sep 2007, Frank Sumption wrote:&gt;&gt; &gt;&gt; &gt;\nIt&#39;s not brain! We are all spirit, of course we can create our &gt; own\nEVPs. You don&#39;t suddenly become spirit when you die, you just &gt; wake\nup. That&#39;s why I don&#39;t ask questions, I don&#39;t want to create &gt; the\nanswers I&#39;m looking for.&gt; &gt;&gt; &gt; Frank-S&gt; &gt;&gt;&gt;  \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Capture your memories in an online journal!\n&gt; http://www.reallivemoms.com?ocid=TXT_TAGHM&loc=us\n&gt;"}