{"id": "20946", "subject": "Re: Where is Frank ?", "author": "Adriana Jones", "timestamp": "2011-03-02T08:42:01Z", "full_text": "I have to agree with you Frank on what you&#39;ve said.  You know the approach that I&#39;ve taken so far with the box is to not take anything they say as necessarily true because of course people/spirits lie, and of course people/spirits can also be innocently mistaken or misinformed.  However, if you get messages that sound like they might be important, how can you not share them?  We&#39;ve all heard them, Frank&#39;s not lying or crazy, the only thing left to determine is whether or not the voices are lying or clueless.  That&#39;s the only thing left to determine.  Frank has done his duty by sharing them. I don&#39;t understand why people take such pleasure in lashing out at you Frank.  I guess because you&#39;re coming out with a radical new idea you&#39;re an easy target for the bullies, isn&#39;t that always how the story goes, someone is courageous enough to extend their hand sharing something new and the people bite his hand off.  I think the following is fitting here:\n\nhttp://llerrah.com/doitanyway.htm\n\nAnd you know what?  I recently had a ghost box message that sounds like it might be appropriate for our times too, I&#39;ve been hesitant about posting it, but if Frank&#39;s brave enough to post his stuff, I can be brave enough to post mine.  They&#39;re saying &quot;there&#39;s world war&quot;  I got this on January 21, a week after Tunisia&#39;s leader was ousted... and look now, there really is revolution cropping up everywhere... dunno if world war is referring to an all out two-sided world war, or just referring to how there&#39;s revolution popping up everywhere right now... either way I&#39;m posting it now, f- it, lol!  \n\nSweet God, why is everyone so mean and malicious to each other on these ghost box boards, and whenever you tell someone the truth as you see it, they act like you just shot their dog or something....  seriously, to the vast majority of the rest of the world they look at us ALL OF US like a bunch of kooky mo-fo&#39;s, so I don&#39;t see why we have to argue so much and so personally about all the petty details of what we are dealing with... when is the last time someone on these boards felt that they could freely express their joys, fears, and true opinions about their work and about each other, without feeling like they might be knocked down with a sledgehammer?  Seriously, when&#39;s the last time there has been a fun, relaxed atmosphere?    Y&#39;all need to get over yourselves, life&#39;s too short, LOVE each other, stop cr***ing on each other for speaking your mind.... now that I&#39;ve been here long enough on these here boards, to see a few things myself, that&#39;s STILL my opinion, like it was from day one.....\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  What is your malfunction! \n&gt; \n&gt;  I have said since day one of the boxes that you don&#39;t take anything as gospel! I have said that about these predictions, Who the hell are you, me, or anyone to say they some how know better, that nothing is going to happen? So all of this EVP stuff, along with every f----- culture on the planet has to be wrong-- cuz you somehow, in your infinite wisdom know better. \n&gt; \n&gt;  I can not in good conscience, believe that I know better about the doomes day voices and not post them. You like many, I am just not wise enough to know what ifs false and waht is true from the boxes. It&#39;s not just a mayn thing, it&#39;s world wide, so how the fuck do you know it&#39;s not true!!  I have done that before, gotten clear voices that I just knew had ot be worng, so didn&#39;t post them, when it would have proven EVP.\n&gt; \n&gt;  As far your boxes, I can&#39;t help what you paid, you didn&#39;t get them from me. I can&#39;t help the fact that guy you bought them from was a crook and thought he deserved more for the damn things. If I had money I would pay you back, but I&#39;m old, retired and get half of what I ued to for income. Contrary to to waht you might think, I barely get enoiugh for this junkl to buy parts, labor isn&#39;t even counted in! There is no fucking profit in this crap! I can&#39;t help that you were so desperate for boxes that price was no object--at the time. You&#39;ll have to blame yourself for your own poor judgement. I have stated, again for freaking years, that there is no magic in the box, it&#39;s a goddamn radio!! Any, and I mean any method of sweeping the tuning results in the raw audio and if &quot;they&quot; deem you worthy, the spirits might talk to you, but there is no gaurantee! Not my probelm that you thought you were so gifted and unique that God himself would have to talk to you. \n&gt; \n&gt;  You should choose you next words carefully! Or you could just quit the group since you are obviously so much more intelluigent than anyone here.\n&gt; \n&gt;  Frank-S\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Mvanah Maloti &lt;inyanga4@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Frank&#39;s words, not mine. \n&gt; &gt;  \n&gt; &gt; &quot;Run Frank, run!&quot;\n&gt; &gt; \n&gt; &gt; --- On Tue, 3/1/11, Ursula Kalin &lt;kalinu@&gt; wrote:\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; From: Ursula Kalin &lt;kalinu@&gt;\n&gt; &gt; Subject: Re: [EVP-ITC] Where is Frank ?\n&gt; &gt; To: EVP-ITC@yahoogroups.com\n&gt; &gt; Date: Tuesday, March 1, 2011, 7:34 AM\n&gt; &gt; \n&gt; &gt; \n&gt; &gt;   \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; then you wonder why he doesn&#39;t answer question...lol\n&gt; &gt; \n&gt; &gt; --- On Tue, 3/1/11, Ursula Kalin &lt;kalinu@&gt; wrote:\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; From: Ursula Kalin &lt;kalinu@&gt;\n&gt; &gt; Subject: Re: [EVP-ITC] Where is Frank ?\n&gt; &gt; To: EVP-ITC@yahoogroups.com\n&gt; &gt; Date: Tuesday, March 1, 2011, 8:32 AM\n&gt; &gt; \n&gt; &gt; \n&gt; &gt;   \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; your on his group talking crap about him..wtf? some people\n&gt; &gt; \n&gt; &gt; --- On Tue, 3/1/11, Mvanah Maloti &lt;inyanga4@&gt; wrote:\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; From: Mvanah Maloti &lt;inyanga4@&gt;\n&gt; &gt; Subject: Re: [EVP-ITC] Where is Frank ?\n&gt; &gt; To: EVP-ITC@yahoogroups.com\n&gt; &gt; Date: Tuesday, March 1, 2011, 8:15 AM\n&gt; &gt; \n&gt; &gt; \n&gt; &gt;   \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; Nah, I&#39;m just waiting for 2012 so I can get a front row seat to Frank&#39;s pity party and making good on his promise to run over ALL of his boxes with his car if the world doesn&#39;t explode. \n&gt; &gt;  \n&gt; &gt; And I&#39;m the idiot? \n&gt; &gt;  \n&gt; &gt; LMFAO!!!\n&gt; &gt; \n&gt; &gt; --- On Tue, 3/1/11, Rick Wegrzyn &lt;rickwegrzyn@&gt; wrote:\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; From: Rick Wegrzyn &lt;rickwegrzyn@&gt;\n&gt; &gt; Subject: Re: [EVP-ITC] Where is Frank ?\n&gt; &gt; To: EVP-ITC@yahoogroups.com\n&gt; &gt; Date: Tuesday, March 1, 2011, 7:11 AM\n&gt; &gt; \n&gt; &gt; \n&gt; &gt;   \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; You r 1 of those idiots yes..\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; From: Mvanah Maloti &lt;inyanga4@&gt;\n&gt; &gt; To: EVP-ITC@yahoogroups.com\n&gt; &gt; Sent: Tue, March 1, 2011 7:07:15 AM\n&gt; &gt; Subject: Re: [EVP-ITC] Where is Frank ?\n&gt; &gt; \n&gt; &gt;   \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; You seem to think this group is about &quot;helping&quot; new GB users and (ahem) &quot;researchers.&quot;\n&gt; &gt;  \n&gt; &gt; Methinks you have another thing coming, kiddo.  ;)\n&gt; &gt;  \n&gt; &gt; -J\n&gt; &gt; \n&gt; &gt; --- On Mon, 2/28/11, Luis &lt;luispucp098@&gt; wrote:\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; From: Luis &lt;luispucp098@&gt;\n&gt; &gt; Subject: [EVP-ITC] Where is Frank ?\n&gt; &gt; To: EVP-ITC@yahoogroups.com\n&gt; &gt; Date: Monday, February 28, 2011, 7:51 PM\n&gt; &gt; \n&gt; &gt; \n&gt; &gt;   \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; I asked almost 3 questions , and are waiting the answer\n&gt; &gt;\n&gt;"}