{"id": "20958", "subject": "Re: new box idea", "author": "johniestring", "timestamp": "2011-03-03T10:55:36Z", "full_text": "A narrow doorway which will naturally increase the velocity of any air movement might be a good place to set it.\nOr an open window, a place my significant Other always had to be next to, might be a good place for it. \nAnd  of course outside , with the intake hole facing the prevailing winds.\n\n--- In EVP-ITC@yahoogroups.com, Snowfire Lioness &lt;SnowfireL@...&gt; wrote:\n&gt;\n&gt;  A fan might work with this type of thing too, but it might make too much noise. I did get some fairly good files using a fan one hot summer, with the box, but the sound from the fan reached the mic, and it sounds like they are out in a wind storm, but it did make them a bit louder. sf\n&gt; \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; -----Original Message-----\n&gt; From: johniestring johniestring@...\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Wed, Mar 2, 2011 1:42 am\n&gt; Subject: [EVP-ITC] new box idea\n&gt; \n&gt;                                                Just wondering if anybody has ever thought about making a wind tuned ghost box. \n&gt;      My idea is to put a Theremin like charged antenna in a cardboard cylinder about 1 to 2 foot tall with a diameter of about 5 to 10 inches with a wind inlet at the bottom and a screen at the top. The wind would blow a light piece of material around in the cylinder that would change the capacitance seen by the antenna. I was thinking you could probably hook the thing to an old non-electronically tuned radio directly across the tuning capacitor or in place of it. At least thats what I would try first. It may need some sort of amplification and or filtering, don&#39;t know, just a hack electrician here. \n&gt;      It would be nice if the light piece of material was a ball of hair from a loved one but i would guess that a piece or more of aluminized mylar would probably work better. And the  antenna should be offset to the side so the hairball could go up and down out of the field to choose whatever station the &quot;others&quot; would like.\n&gt;  \n&gt;          Heres a drawing:\n&gt;      http://www.flickr.com/photos/johniestring/\n&gt;"}