{"id": "20956", "subject": "More predictive.", "author": "Frank Sumption", "timestamp": "2011-03-03T02:40:17Z", "full_text": "I don&#39;t know if I should post this stuff or not, given some people&#39;s\nextreme reactions. They act like I&#39;m producing this stuff my self. since I&#39;m\nnot one to &quot;know better&quot;, I don&#39;t thihk it ethical to withhold certain\nvoices. People that don&#39;t like it can bite me!\n\nAt just after 3 seconds &quot;..it is over in March&quot;, and who out there in\nbrainiac land can base their &quot;knowing better&quot; on anything but fear?\n\n Ya have to keep in mind, I have gotten these dates since day one ogf baxes\nas well, just as somke Christian scholar has produced the exact enddate,\nrepeatedly over the last two thousand years. That&#39;s why I don&#39;t hold my\nbreath waiting for the end of the world. Yeah, all the ear  marks of a cult,\nbelieve what you want, try to stay naked, and do your own recordings, not\ntaking them as gospel. How these dumb f---s out here make that into a cult I\nhave no idea.\n\n Oh yeah, and uneducated does not mean stupid! It means not indoctrinated,\nwhich is a big help to free thinking.\n\nf-s\n\nI don' know i I should pos his s u o no , gi en some people's ex eme eac ions. They ac like I'm p oducing his s u my sel . since I'm no one o \"know be e \", I don' hihk i e hical o wi hhold ce ain oices. People ha don' like i can bi e me! \n\n \nA jus a e 3 seconds \"..i is o e in Ma ch\", and who ou he e in b ainiac land can base hei \"knowing be e \" on any hing bu ea ?\n \n Ya ha e o keep in mind, I ha e go en hese da es since day one og baxes as well, jus as somke Ch is ian schola has p oduced he exac endda e, epea edly o e he las wo housand yea s. Tha 's why I don' hold my b ea h wai ing o he end o he wo ld. Yeah, all he ea   ma ks o a cul , belie e wha you wan , y o s ay naked, and do you own eco dings, no aking hem as gospel. How hese dumb ---s ou he e make ha in o a cul  I ha e no idea. \n\n \n Oh yeah, and uneduca ed does no mean s upid! I means no indoc ina ed, which is a big help o ee hinking.\n \n -s"}