{"id": "20978", "subject": "Re: [EVP-ITC] Check this out,", "author": "Sam Reser", "timestamp": "2011-03-05T01:45:29Z", "full_text": "Hey Everyone,\n\nBelow is information I received from a source online. Forgive me for not citing the website, it was an unknown user responding to a similar question. I couldn&#39;t paste it all due to me posting this from my phone, but you will see what I mean. \n\n&quot;Sometimes it&#39;s disease, sometimes pollution. Other times it&#39;s just a mystery.\nOn average, 163 such events are reported to the federal government each year, according to USGS records. And there have been much larger die-offs than the 3,000 blackbirds in Arkansas. Twice in the summer of 1996, more than 100,000 ducks died of botulism in Canada.\nWeather — cold and wet weather like in Arkansas New Year&#39;s Eve when the birds fell out of the sky — is often associated with mass bird deaths, ornithologists say. Pollution, parasites and disease also cause mass deaths. Some are even blaming fireworks for the blackbird deaths.\nSo what&#39;s happening this time?\nBlame technology, says famed Harvard biologist E.O. Wilson. With the Internet, cell phones and worldwide communications, people are noticing events, connecting the dots more.&quot;\n\nSent from my iPhone\n\nOn Mar 4, 2011, at 5:22 PM, SnowfireL@... wrote:\n\n&gt; Bald Eagles Dying Again -- No One Knows Why - SFGate\n&gt;  \n&gt; YouTube - PENGUINS, LIONS BALD EAGLES DYING, HALLIBURTON FEMA CAMPS AND ARKANSAS QUAKES, WHAT IS GOING ON\n&gt;  \n&gt; YWhy are the animals dying? Birds, fish wiped out in mysterious deaths\n&gt;  \n&gt; youTube - OVER 1 MILLION BATS DEAD SO FAR ,1OO CATTLE DEAD, IS PLANET HEATING UP\n&gt;  \n&gt; Bumblebees are the latest animals to be dying for no apparent reason\n&gt; \n\nHey E e yone,Below is in o ma ion I ecei ed om a sou ce online. Fo gi e me o no ci ing he websi e, i was an unknown use esponding o a simila ques ion. I couldn' pas e i all due o me pos ing his om my phone, bu you will see wha I mean. \"Some imes i 's disease, some imes pollu ion. O he imes i 's jus a mys e y.On a e age, 163 such e en s a e epo ed o he ede al go e nmen each yea , acco ding o USGS eco ds. And he e ha e been much la ge die-o s han he 3,000 blackbi ds in A kansas. Twice in he summe o 1996, mo e han 100,000 ducks died o bo ulism in Canada.Wea he — cold and we wea he like in A kansas New Yea 's E e when he bi ds ell ou o he sky — is o en associa ed wi h mass bi d dea hs, o ni hologis s say. Pollu ion, pa asi es and disease also cause mass dea hs. Some a e e en blaming i ewo ks o he blackbi d dea hs.So wha 's happening his ime?Blame echnology, says amed Ha a d biologis E.O. Wilson. Wi h he In e ne , cell phones and wo ldwide communica ions, people a e no icing e en s, connec ing he do s mo e.\"Sen om my iPhoneOn Ma 4, 2011, a 5:22 PM, Snow i eL@... w o e:\n\n\n\n\n \n\n\n\n \n \n \n \n\n\nBald \nEagles Dying Again -- No One Knows Why - SFGa e \n \nYouTube - PENGUINS, \nLIONS BALD EAGLES DYING, HALLIBURTON FEMA CAMPS AND ARKANSAS QUAKES, WHAT IS \nGOING ON \n \nYWhy a e \n he animals dying? Bi ds, ish wiped ou in mys e ious dea hs\n \nyouTube \n- OVER 1 MILLION BATS DEAD SO FAR ,1OO CATTLE DEAD, IS PLANET HEATING UP \n\n \nBumblebees \na e he la es animals o be dying o no appa en eason"}