{"id": "20988", "subject": "Message from David the Tech,", "author": "SnowfireL@aol.com", "timestamp": "2011-03-05T19:49:58Z", "full_text": "--part1_80e1b.19984e8.3aa3ede6_boundary\r\nContent-Type: text/plain; charset=&quot;US-ASCII&quot;\r\nContent-Transfer-Encoding: 7bit\r\n\r\nOk, he says &quot;the world wide animal, birds, fish, bees, bats, ducks, crabs,  \ncows,whales, dolphins, buffalo,  etc...deaths are going to continue,  it \nseems they will all return after about 2 or 3 years or so after the permanent  \nreturn of Christ to this world, this will occur after the antichrist has \nall but  destroyed all life, but JC will come back, and stop him.&quot;  David says \nthat  &quot;the entire animal population may be nearly wiped out before Christ  \nreturns,&quot; things are going to only get worse,&quot; right now we are all living \nin  this bubble, thinking it won&#39;t happen.\n \nIt&#39;s very sad, I still can&#39;t get David to tell me who it is that killing  \nthe creatures, he only says they will all be brought back to earth after JC&#39;s \n return.  So, stock up on canned food if you can guys, enough to last for \nat  least a year or 2, I buy mine a few extra at a time, and if you are \ntranslated  over, the food will be there for some one else that gets stuck here \nfor that  near 3 years.  I keep hoping to win the lotto, like everyone else, \nthen I  would put lots of food in here for people so, they don&#39;t starve.   I \nhave  the lake down here, our water is from a natural artesian spring \nwater, it is 250  feet deep so, it&#39;s pretty safe to drink.  And even if I lost \nelectricity,  one could always get some water, from the lake out there which \nis private  too.  If I leave, anyone stuck here is welcome to come over here \nto live,  but you will need to probably keep up with the mortgage if there \nis still the  bank left.  Whatever, it&#39;s going to be pretty bad from what I \nhear.  sf\n\r\n--part1_80e1b.19984e8.3aa3ede6_boundary\r\nContent-Type: text/html; charset=&quot;US-ASCII&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML 4.0 Transitional//EN&quot;&gt;\n&lt;HTML&gt;&lt;HEAD&gt;=\r\n\n&lt;META content=3D&quot;text/html; charset=3DUS-ASCII&quot; http-equiv=3DContent-Type&gt;=\r\n\n&lt;META name=3DGENERATOR content=3D&quot;MSHTML 8.00.6001.18702&quot;&gt;&lt;/HEAD&gt;\n&lt;BODY st=\r\nyle=3D&quot;FONT-FAMILY: Arial; COLOR: #000000; FONT-SIZE: 10pt&quot; id=3Drole_body =\r\n bottomMargin=3D7 leftMargin=3D7 rightMargin=3D7 topMargin=3D7&gt;&lt;FONT id=3Dr=\r\nole_document  color=3D#000000 size=3D2 face=3DArial&gt;\n&lt;DIV&gt;Ok, he says &quot;the =\r\nworld wide animal, birds, fish, bees, bats, ducks, crabs, \ncows,whales, dol=\r\nphins,&nbsp;buffalo, &nbsp;etc...deaths are going to continue, \nit seems th=\r\ney will all return after about 2 or 3 years or so after the permanent \nretu=\r\nrn of Christ to this world, this will occur after the antichrist has all bu=\r\nt \ndestroyed all life, but JC will come back, and stop him.&quot;&nbsp; David sa=\r\nys that \n&quot;the entire animal population may be nearly&nbsp;wiped out before =\r\nChrist \nreturns,&quot; things are going to only get worse,&quot; right now we are all=\r\n living in \nthis bubble, thinking it won&#39;t happen.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n=\r\n&lt;DIV&gt;It&#39;s very sad, I still can&#39;t get David to tell me who it is that killi=\r\nng \nthe creatures, he only says they will all be brought back to earth afte=\r\nr JC&#39;s \nreturn.&nbsp; So, stock up on canned food if you can guys, enough t=\r\no last for at \nleast a year or 2, I buy mine a few extra at a time, and if =\r\nyou are translated \nover, the food will be there for some one else that get=\r\ns stuck here for that \nnear 3 years.&nbsp; I keep hoping to win the lotto, =\r\nlike everyone else, then I \nwould put lots of food in here for people so, t=\r\nhey don&#39;t starve. &nbsp; I have \nthe lake down here, our water is from a na=\r\ntural artesian spring water, it is 250 \nfeet deep so, it&#39;s pretty safe to d=\r\nrink.&nbsp; And even if I lost electricity, \none could always get some wate=\r\nr, from the lake out there which is private \ntoo.&nbsp; If I leave, anyone =\r\nstuck here is welcome to come over here to live, \nbut you will need to prob=\r\nably keep up with the mortgage if there is still the \nbank left.&nbsp; What=\r\never, it&#39;s going to be pretty bad from what I hear. \nsf&lt;/DIV&gt;&lt;/FONT&gt;&lt;/BODY&gt;=\r\n&lt;/HTML&gt;\n\r\n--part1_80e1b.19984e8.3aa3ede6_boundary--"}