{"id": "21007", "subject": "Re: Message from David the Tech,", "author": "purplespacefriend", "timestamp": "2011-03-08T07:33:52Z", "full_text": "Can&#39;t eat if you&#39;re thirsty! Don&#39;t forget water.\n\nF-S\n\n--- In EVP-ITC@yahoogroups.com, &quot;Joeine C.&quot; &lt;raggedyann8140@...&gt; wrote:\n&gt;\n&gt; &quot;. So, stock up on canned food if you can guys, enough to last for \n&gt; &gt; at least a year or 2, I buy mine a few extra at a time, and if you are \n&gt; &gt; translated over, the food will be there for some one else that gets stuck here \n&gt; &gt; for that near 3 years. I keep &quot;\n&gt;  \n&gt; Unfortunately, if this does happen SF, you won&#39;t have the oppourtunity use your supplies as\n&gt; there will be roving gangs with guns taking whatever they want.\n&gt;  \n&gt;  \n&gt;  \n&gt;  \n&gt;  \n&gt;  \n&gt;  \n&gt; \n&gt; \n&gt; IS THIS WHERE YOU LIVE? \n&gt; &quot;No, I live in heaven, and my affections\n&gt; are there. I just borrow this shack while\n&gt; waiting for my ride home.&quot;\n&gt; \n&gt; --- On Sun, 3/6/11, Snowfire Lioness &lt;SnowfireL@...&gt; wrote:\n&gt; \n&gt; \n&gt; From: Snowfire Lioness &lt;SnowfireL@...&gt;\n&gt; Subject: Re: [EVP-ITC] Re: Message from David the Tech,\n&gt; To: EVP-ITC@...m\n&gt; Date: Sunday, March 6, 2011, 1:04 AM\n&gt; \n&gt; \n&gt;   \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; to &quot;translate&quot; means to change, i looked up the word, as in a different language in order to understand a different language we must translate it, I&#39;m really not sure what it means to happen, I think we just vanish on this side, and appear on their side, some how.  another dimension? maybe. sf\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; -----Original Message-----\n&gt; From: harpo103 &lt;rmc103@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Sat, Mar 5, 2011 10:24 pm\n&gt; Subject: [EVP-ITC] Re: Message from David the Tech,\n&gt; \n&gt; \n&gt; \n&gt;   \n&gt; \n&gt; \n&gt; \n&gt; Translated over???\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, SnowfireL@ wrote:\n&gt; &gt;\n&gt; &gt; Ok, he says &quot;the world wide animal, birds, fish, bees, bats, ducks, crabs, \n&gt; &gt; cows,whales, dolphins, buffalo, etc...deaths are going to continue, it \n&gt; &gt; seems they will all return after about 2 or 3 years or so after the permanent \n&gt; &gt; return of Christ to this world, this will occur after the antichrist has \n&gt; &gt; all but destroyed all life, but JC will come back, and stop him.&quot; David says \n&gt; &gt; that &quot;the entire animal population may be nearly wiped out before Christ \n&gt; &gt; returns,&quot; things are going to only get worse,&quot; right now we are all living \n&gt; &gt; in this bubble, thinking it won&#39;t happen.\n&gt; &gt; \n&gt; &gt; It&#39;s very sad, I still can&#39;t get David to tell me who it is that killing \n&gt; &gt; the creatures, he only says they will all be brought back to earth after JC&#39;s \n&gt; &gt; return. So, stock up on canned food if you can guys, enough to last for \n&gt; &gt; at least a year or 2, I buy mine a few extra at a time, and if you are \n&gt; &gt; translated over, the food will be there for some one else that gets stuck here \n&gt; &gt; for that near 3 years. I keep hoping to win the lotto, like everyone else, \n&gt; &gt; then I would put lots of food in here for people so, they don&#39;t starve. I \n&gt; &gt; have the lake down here, our water is from a natural artesian spring \n&gt; &gt; water, it is 250 feet deep so, it&#39;s pretty safe to drink. And even if I lost \n&gt; &gt; electricity, one could always get some water, from the lake out there which \n&gt; &gt; is private too. If I leave, anyone stuck here is welcome to come over here \n&gt; &gt; to live, but you will need to probably keep up with the mortgage if there \n&gt; &gt; is still the bank left. Whatever, it&#39;s going to be pretty bad from what I \n&gt; &gt; hear. sf\n&gt; &gt;\n&gt;"}