{"id": "21024", "subject": "Re: Frank&#39;s Ghost Box", "author": "purplespacefriend", "timestamp": "2011-03-09T17:48:45Z", "full_text": "That&#39;s the same old trap, over think the be geesies out this stuff and wonder why it don&#39;t work. Spirit exists in a higher demension, as such they have full access to everything we have here--on our lower demension/level. They will use what we use, why over complicate the stuff? To make it more difficult for them, or us?\n\n Supply raw audio-bits of speech, music, and nosie, and they talk. Simple is better, you can sweep the radio by hand, it works, and doesn&#39;t take a degree in thinkology to figure it out! \n\n \n Yeah, I get irritated cuz I have to restate this over and over and over and over. Everyone wants it super high tech, and super complicated, or it just can&#39;t work. It&#39;s a freakin&#39; radio! Use radio cuz the possibilities of bits of human speech, music and noise are infinite. It&#39;s convinient, you turn a dial on a $2 radio and they talk, no it is not the stupid brain matrixing BS the debunkers would have us believe. \n \n If ya still think spirit is somehow deminished humans, try EVPmaker &quot;they&quot; manipulate the sound INSIDE the computer, as data bits! But wait, there&#39;s more! We can create our own &quot;voices&quot; just by thinking about it, if we are not carefull, we creat the evidence we want! It seems to work subconciously, but I bet with practice anyone--living- could learn how to communicate via EVP. hmmm, faster than light communication?  Who needs that concept?\n\n I know, different ideas, ultra sound, light, RF. The common idea, convert it to human hearing, so why not start with sound in the frist place? \n\n\nFrank-S\n\n\n\n--- In EVP-ITC@yahoogroups.com, farrukhnaik2000@... wrote:\n&gt;\n&gt; Thanks for helping me out..I thought u might get some thing beyond 20 k and then convert it to human ear range..\n&gt; Thanks once again\n&gt; Sent from my BlackBerry smartphone from Warid.\n&gt; \n&gt; -----Original Message-----\n&gt; From: Zack Widup &lt;w9sz.zack@...&gt;\n&gt; Sender: EVP-ITC@yahoogroups.com\n&gt; Date: Tue, 8 Mar 2011 08:55:07 \n&gt; To: &lt;EVP-ITC@...m&gt;\n&gt; Reply-To: EVP-ITC@yahoogroups.com\n&gt; Subject: Re: [EVP-ITC] Frank&#39;s Ghost Box\n&gt; \n&gt; First off, there are some diagrams, I believe, in the Files or Photos\n&gt; sections of some of Frank&#39;s boxes. There&#39;s really not a lot to it. Get\n&gt; a radio with electronic tuning capability and build a sweep circuit.\n&gt; Frank just posted a circuit for a sweep the other day. You could even\n&gt; do manual tuning with an analog radio by tuning the knob up and down.\n&gt; \n&gt; Why do you need to record above 20 kHz? You can&#39;t hear it. No one that\n&gt; I know of has captured any EVP or ITC even close to that range. Most\n&gt; of my EVP have been in the lower normal human voice range.\n&gt; \n&gt; Zack\n&gt; \n&gt; \n&gt; On 3/8/11, Farrukh &lt;farrukhnaik2000@...&gt; wrote:\n&gt; &gt; Hi!\n&gt; &gt; Can anyone help me out in making a Frank&#39;s Ghost Box...with easy steps of\n&gt; &gt; assembling the components...i would really appreciate ur efforts..\n&gt; &gt; Secondly i have a question for u guys....i am using sony IC recorder model\n&gt; &gt; ICDPX820 533 hours recording for EVP but the limitation of this IC recorder\n&gt; &gt; is that it records in MP3 format which is not required as wav format is more\n&gt; &gt; reliable and is closest to what u actually hear. and the next is its\n&gt; &gt; frequency range is 75 hz to 20 k and above 20 k it does not record any\n&gt; &gt; thing...\n&gt; &gt; so what is the best model available for EVP recording and is there anything\n&gt; &gt; which can be modified in the sony IC recorder so that it can record freq of\n&gt; &gt; more than 20 k...\n&gt; &gt; Hey i know it is time taking to answer these questions..but i ill be obliged\n&gt; &gt; if somebody out of u help me out....\n&gt; &gt; Thanks\n&gt; &gt; Regards\n&gt; &gt; Farrukh\n&gt; &gt; www.thenightwalkers.org\n&gt; &gt;\n&gt; &gt;\n&gt;"}