{"id": "2105", "subject": "Re: [EVP-ITC] Question for everyone", "author": "Lisby", "timestamp": "2007-09-18T22:16:15Z", "full_text": "I know. Remember how they seemed to like me a lot?\n\nAnn\nThrowin&#39; down with the aliens. ;)\n\n\nOn Sep 18, 2007, at 3:46 PM, Frank Sumption wrote:\n\n&gt;  I used to get that years ago, and I still get it from the Ol&#39;  \n&gt; Lady, where she hears my thoughts. I think imprinting our voices  \n&gt; and thoughts on recording media (or minds) is childs play on our  \n&gt; higher levels of existance. One might hypothesize about my  \n&gt; &quot;Princess voices&quot;, and I wouldn&#39;t rule out the possiblity, but  \n&gt; &quot;they&quot; claim a seperate existence, but, what would you expect?\n&gt;\n&gt;  Ann, you certainly sound Purple!\n&gt;\n&gt;\n&gt;  Frank-S\n&gt;\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; From: lisby@...\n&gt; Date: Tue, 18 Sep 2007 11:35:14 -0400\n&gt; Subject: Re: [EVP-ITC] Question for everyone\n&gt;\n&gt; Years ago, when I was taping on a reel to reel, mostly, I often got\n&gt; voices that sounded maddeningly not like me, but like people I knew\n&gt; who were not dead. They never identified themselves as those people,\n&gt; but the voices were dead ringers (ar ar ar). I am also, apparently,\n&gt; able to randomly project my voice into the minds of people I know. It\n&gt; begins to happen to almost everyone that I bond strongly with. I\n&gt; can&#39;t tell you how many times I have heard someone I know spin around\n&gt; and say, &quot;What?&quot; They always say they hear my voice, but don&#39;t\n&gt; understand what I am saying. This is always accompanied, on my end,\n&gt; by a sort of ringing sound in my head. I cannot control it at all.\n&gt; I&#39;m just throwing this out there as food for thought that may pertain\n&gt; to your discussion.....\n&gt;\n&gt; Ann\n&gt;\n&gt; On Sep 18, 2007, at 8:13 AM, Zack Widup wrote:\n&gt;\n&gt; &gt;\n&gt; &gt; Very true, Frank! The ghosts who are producing the EVP&#39;s certainly\n&gt; &gt; don&#39;t\n&gt; &gt; have brains. :-)\n&gt; &gt;\n&gt; &gt; I have no doubt that there may be a few people around who could\n&gt; &gt; create EVP\n&gt; &gt; phenomena in an electrronic device, but it would be an extremely  \n&gt; small\n&gt; &gt; number. I think most of the EVP we get are from disembodied  \n&gt; beings who\n&gt; &gt; have figured out how to do it.\n&gt; &gt;\n&gt; &gt; Zack\n&gt; &gt;\n&gt; &gt; On Mon, 17 Sep 2007, Frank Sumption wrote:\n&gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; It&#39;s not brain! We are all spirit, of course we can create our\n&gt; &gt; own EVPs. You don&#39;t suddenly become spirit when you die, you just\n&gt; &gt; wake up. That&#39;s why I don&#39;t ask questions, I don&#39;t want to create\n&gt; &gt; the answers I&#39;m looking for.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Frank-S\n&gt; &gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt;\n&gt;\n&gt;\n&gt; Make your little one a shining star! Shine on!\n&gt;\n&gt; \n\n\nI know. Remembe how hey seemed o like me a lo ?AnnTh owin' down wi h he aliens. ;)On Sep 18, 2007, a 3:46 PM, F ank Sump ion w o e: I used o ge ha yea s ago, and I s ill ge i om he Ol' Lady, whe e she hea s my hough s. I hink imp in ing ou oices and hough s on  eco ding media (o minds) is childs play on ou highe le els o exis ance. One migh hypo hesize abou my \"P incess oices\", and I wouldn' ule ou he possibli y, bu \" hey\" claim a sepe a e exis ence, bu , wha would you expec ?  Ann, you ce ainly sound Pu ple!  F ank-STo: EVP-ITC@yahoog oups.comF om: lisby@ea hlink.ne Da e: Tue, 18 Sep 2007 11:35:14 -0400Subjec : Re: [EVP-ITC] Ques ion o e e yoneYea s ago, when I was aping on a eel o eel, mos ly, I o en go oices ha sounded maddeningly no like me, bu like people I knew who we e no dead. They ne e iden i ied hemsel es as hose people, bu he oices we e dead inge s (a a a ). I am also, appa en ly, able o andomly p ojec my oice in o he minds o people I know. I begins o happen o almos e e yone ha I bond s ongly wi h. I can' ell you how many imes I ha e hea d someone I know spin a ound and say, \"Wha ?\" They always say hey hea my oice, bu don' unde s and wha I am saying. This is always accompanied, on my end, by a so o inging sound in my head. I canno con ol i a all. I'm jus h owing his ou he e as ood o hough ha may pe ain o you discussion.....AnnOn Sep 18, 2007, a 8:13 AM, Zack Widup w o e:>> Ve y ue, F ank! The ghos s who a e p oducing he EVP's ce ainly > don' > ha e b ains. :-)>> I ha e no doub ha he e may be a ew people a ound who could > c ea e EVP> phenomena in an elec onic de ice, bu i would be an ex emely small> numbe . I hink mos o he EVP we ge a e om disembodied beings who> ha e igu ed ou how o do i .>> Zack>> On Mon, 17 Sep 2007, F ank Sump ion w o e:>> >> > I 's no b ain! We a e all spi i , o cou se we can c ea e ou > own EVPs. You don' suddenly become spi i when you die, you jus > wake up. Tha 's why I don' ask ques ions, I don' wan o c ea e > he answe s I'm looking o .> >> > F ank-S> >>> Make you li le one a shining s a ! Shine on!"}