{"id": "21223", "subject": "Great files Frank!", "author": "SnowfireL@aol.com", "timestamp": "2011-03-27T18:14:54Z", "full_text": "--part1_31e91.72af3256.3ac0d89e_boundary\r\nContent-Type: multipart/alternative;\n\tboundary=&quot;part1_31e91.72af3256.3ac0d89e_alt_boundary&quot;\r\n\r\n\r\n--part1_31e91.72af3256.3ac0d89e_alt_boundary\r\nContent-Type: text/plain; charset=&quot;US-ASCII&quot;\r\nContent-Transfer-Encoding: 7bit\r\n\r\nGot lots of great files in there, Frank, these two are not a drop in the  \nbuckett to what you got here, a few spirits coming into the light see they \nare  &quot;naked&quot; one asks for some one to &quot;throw down pants&quot;  and of course I \nasked  David what this is all about, He says that while they are in the lower  \nplains  they cannot see and are in total darkness they are &quot;all naked&quot; they  \ncan&#39;t really see each other.  But when each steps up into the light, it&#39;s  \nlike a little arched doorway, with three small steps going up, and a  small \nplace to stand and kneel down, which is what they are all  asked to do before \nthey go in when they are coming out  of the lower  plain.\n \nOnce they enter the light is when they can see that they are naked, it  \nmight be one reason, He takes them in only one at a time, maybe.  Then  someone \nin the light covers or gives them a spirit rope to cover them up as they  \ncome in, then after they meet with Jesus, and He talks to them for about 10  \nminutes our time, He wants everyone within the fold, but they must forgive  \neveryone that has ever hurt them plus be willing to make up for harm they \ndid  while on Earth, and believe in what Christ did for them.  It is then \nwhere  they go to see the guardian angels, and the loved ones, and go to their  \nnew homes.   In these two files, I hear, &quot;throw down pants&quot; in the other  \none, I hear, &quot;we&#39;re naked!&quot;  &quot;me too.&quot;   If a person dies a  believer all \nready, you don&#39;t need to go through that but, are already in the  light when one \ndies, there is no need to cross over because you are already  there so to \nspeak.  At least that is the way Tech David describes things.  sf\n\r\n--part1_31e91.72af3256.3ac0d89e_alt_boundary\r\nContent-Type: text/html; charset=&quot;US-ASCII&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML 4.0 Transitional//EN&quot;&gt;\n&lt;HTML&gt;&lt;HEAD&gt;=\r\n\n&lt;META content=3D&quot;text/html; charset=3DUS-ASCII&quot; http-equiv=3DContent-Type&gt;=\r\n\n&lt;META name=3DGENERATOR content=3D&quot;MSHTML 8.00.6001.18702&quot;&gt;&lt;/HEAD&gt;\n&lt;BODY st=\r\nyle=3D&quot;FONT-FAMILY: Arial; COLOR: #000000; FONT-SIZE: 10pt&quot; id=3Drole_body =\r\n bottomMargin=3D7 leftMargin=3D7 rightMargin=3D7 topMargin=3D7&gt;&lt;FONT id=3Dr=\r\nole_document  color=3D#000000 size=3D2 face=3DArial&gt;\n&lt;DIV&gt;Got lots of great=\r\n files in there, Frank, these two are not a drop in the \nbuckett to what yo=\r\nu got here, a few spirits coming into the light see they are \n&quot;naked&quot; one a=\r\nsks for some one to &quot;throw down pants&quot;&nbsp; and of course I asked \nDavid w=\r\nhat this is all about, He says that while they are in the lower \nplains&nbs=\r\np; they cannot see and are in total darkness they are &quot;all naked&quot; they \ncan=\r\n&#39;t really see each other.&nbsp; But when each steps up into the light, it&#39;s=\r\n \nlike a little arched&nbsp;doorway, with three small&nbsp;steps going up, =\r\nand a \nsmall place to stand&nbsp;and&nbsp;kneel&nbsp;down, which is what th=\r\ney are all \nasked to&nbsp;do before they go in when they are coming out &nb=\r\nsp;of the lower \nplain.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Once they enter the li=\r\nght&nbsp;is when they can see that they are naked, it \nmight be one reason,=\r\n He takes them in only one at a time, maybe.&nbsp; Then \nsomeone in the lig=\r\nht covers or gives them a spirit rope to cover them up as they \ncome in, th=\r\nen after they meet with Jesus, and He talks to them for about 10 \nminutes o=\r\nur time, He wants everyone within the fold, but they must forgive \neveryone=\r\n that has ever hurt them plus be willing to make up for harm they did \nwhil=\r\ne on Earth, and believe in what Christ did for them.&nbsp; It is then where=\r\n \n&nbsp;they go to see the guardian angels, and the loved ones, and go to t=\r\nheir \nnew homes. &nbsp; In these two files, I hear, &quot;throw down pants&quot; in t=\r\nhe other \none, I hear, &quot;we&#39;re naked!&quot;&nbsp; &quot;me too.&quot;&nbsp;&nbsp; If a pers=\r\non dies a \nbeliever all ready, you don&#39;t need to go through that but, are a=\r\nlready in the \nlight when one dies, there is no need to cross over because =\r\nyou are already \nthere so to speak.&nbsp; At least that is the way Tech Dav=\r\nid describes things. \nsf&lt;/DIV&gt;&lt;/FONT&gt;&lt;/BODY&gt;&lt;/HTML&gt;\n\r\n--part1_31e91.72af3256.3ac0d89e_alt_boundary--\r\n\n\r\n--part1_31e91.72af3256.3ac0d89e_boundary\r\nContent-Type: application/octet-stream;\n\tname=&quot;C_thow down pants or roll down pants.mp3&quot;\r\nContent-Disposition: attachment;\n\tfilename=&quot;C_thow down pants or roll down pants.mp3&quot;\r\n\r\n[ Attachment content not displayed ]\r\n--part1_31e91.72af3256.3ac0d89e_boundary\r\nContent-Type: application/octet-stream; name=&quot;C_we&#39;re naked, me too.mp3&quot;\r\nContent-Disposition: attachment; filename=&quot;C_we&#39;re naked, me too.mp3&quot;\r\n\r\n[ Attachment content not displayed ]\r\n--part1_31e91.72af3256.3ac0d89e_boundary--"}