{"id": "21230", "subject": "Passing of my mom", "author": "Ursula", "timestamp": "2011-03-28T00:55:59Z", "full_text": "ello everyone sorry have not been commenting i lost my mother last weekend her services is Thursday..She was not sick so it was sudden. I wanted to share something with everyone regarding spirits..when we were called last Sunday and told she was not breathing on her own. we all rushed to the hospital. As we were sitting there listen as the doctor tell us she was found in the student part of the building in the library,and that she received cpr but oxygen was not given,because there is no equipment on that side of the building. When she did make it to the hospital side she flat lined three time. To make a long story short from day one the issue was her &quot;brain damage&quot; because of lack of oxygen,but of course we still want to hold on to hope. As i was sitting there i felt someone lightly touch my cheek. this is before I saw her. i later found out my siblings where touched as well while waiting to see her. She was on life support for three days..with severe brain damage so we knew even if she made it she would not be the same. and she was having seizures back to back form the damage. My baby sister told her if she had to go then let go. I found out my brother told her he didn&#39;t want to have to make a choice weather to remove her from the life support or not..we knew that was coming. My husband told me maybe i should just say out loud to her it was ok to go..My stomach started to hurt really bad after he said that.. i told my daughter something bad is gonna happen..I just felt it. I went into the bathroom and before i left i said to my mom (out loud) you can go momma...after a hour later she left,on her own,but not before we all made it to her room to see her take her last breath.I wanted to say..I had also heard my name called while sitting in the waiting.. I felt she was already gone,before even got there.after talking to my siblings they said they knew it to when they say her..that&#39;s why she was touching each of us. To let us know she was ok..and will always be with us. i haven&#39;t done the box yet..but you better believe I will..i have made contact with my rods which has been amazing..and my husband has been touched by her and we confirmed with the rods etc..I want everyone to know we really never really lose them just the physical part..I feel my mom everywhere."}