{"id": "21242", "subject": "Hey all, let&#39;s figure this out", "author": "Tim Woolworth", "timestamp": "2011-03-28T23:11:26Z", "full_text": "I know I don&#39;t post as much as I should here, but I think this is important.\n Recently there has been talk about the sweep rates of various boxes and how\nthey respond in the AM and FM bands.  I am not sure how many of you know\nthis, but Adriana has come up with a method to calculate the sweep rate of\nthe different hacks:\n\n http://itcvoices.org/?p=60\n\nWhy don&#39;t we all calculate the the sweep rates of the various boxes?  I\nwould like to put up a chart on the itcvoices website that has the sweep\nrate for each type of hack.  That way we can have a mathematical\nrepresentation of how fast these boxes stay on any one frequency.  This\nwould require those with turbo hacks to measure the rate with and without\nthe turbo.  Creating this chart will lend a lot of credence to what we do.\n\nIn addition to the rate, I would also like to post 1 minute of pure audio\nfrom each box sweeping, both in the FM and AM bands.  So not only can we\nhave a figure for the sweep, but also how the hack sounds.\n\nAlso welcome is a minute of any Frank&#39;s Box, Rich&#39;s Box, or other unique Box\nconstruction.\n\nDoes anybody want to help with this?  It will benefit everybody\n\nHere is a list of known hacks, any others are certainly welcome!\nhttp://itcvoices.org/?page_id=116\n\nRadio Shack\n12-469\n12-470\n20-125\n12-587\n12-588\n12-589\n20-820\n\nJensen\nSAB-55\n\nSangean\nDT-200VX\n\nTim\n\ntim@...\n\nI know I don' pos as much as I should he e, bu I hink his is impo an .  Recen ly he e has been alk abou he sweep a es o a ious boxes and how hey espond in he AM and FM bands.  I am no su e how many o you know his, bu Ad iana has come up wi h a me hod o calcula e he sweep a e o he di e en hacks:\n\n h p://i c oices.o g/?p=60Why don' we all calcula e he he sweep a es o he a ious boxes?  I would like o pu up a cha on he i c oices websi e ha has he sweep a e o each ype o hack.  Tha way we can ha e a ma hema ical ep esen a ion o how as hese boxes s ay on any one equency.  This would equi e hose wi h u bo hacks o measu e he a e wi h and wi hou he u bo.  C ea ing his cha will lend a lo o c edence o wha we do.\n\nIn addi ion o he a e, I would also like o pos 1 minu e o pu e audio om each box sweeping, bo h in he FM and AM bands.  So no only can we ha e a igu e o he sweep, bu also how he hack sounds.\n\nAlso welcome is a minu e o any F ank's Box, Rich's Box, o o he unique Box cons uc ion.Does anybody wan o help wi h his?  I will bene i e e ybody\n\nHe e is a lis o known hacks, any o he s a e ce ainly welcome!  h p://i c oices.o g/?page_id=116\n\nRadio Shack12-46912-47020-12512-58712-58812-58920-820JensenSAB-55Sangean\n\nDT-200VXTim im@..."}