{"id": "2125", "subject": "Re: [EVP-ITC] Franks box #12", "author": "Lisby", "timestamp": "2007-09-19T23:20:22Z", "full_text": "Hang in there, buddy. You&#39;re going to go down in history, you know.\n\nAnn\n\nOn Sep 19, 2007, at 10:03 AM, Frank Sumption wrote:\n\n&gt; Yeah, I&#39;m working to get more made, but it&#39;s a slow process, and  \n&gt; there&#39;s times when I get complterly burned out on this stuff. The  \n&gt; printed circuit boards will help, now I need to find a premade  \n&gt; cabinet, at a reasoanble price. It&#39;s not like I can just mass  \n&gt; produce this this stuff.\n&gt;\n&gt;  Frank\n&gt;\n&gt;\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; From: lisby@...\n&gt; Date: Tue, 18 Sep 2007 18:17:27 -0400\n&gt; Subject: Re: [EVP-ITC] Franks box #12\n&gt;\n&gt; Yeah Bruce! You go!  Rah! Rah! Rah! One step closer to me getting  \n&gt; one! ;)\n&gt;\n&gt; Ann\n&gt;\n&gt; On Sep 18, 2007, at 4:02 PM, bhali333 wrote:\n&gt;\n&gt; hi Everyone,\n&gt;\n&gt; Don&#39;t everybody hate me at one time, but Frank Sumption was generous\n&gt; enough to give me his Frank&#39;s box #12 and I immediately started  \n&gt; getting\n&gt; results the moment I turned it on. Here are some results from my first\n&gt; session with the box on FM linear.\n&gt;\n&gt; Bruce\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; More photos; more messages; more whatever – Get MORE with Windows  \n&gt; Live™ Hotmail®. NOW with 5GB storage. Get more!\n&gt;\n&gt; \n\n\nHang in he e, buddy. You' e going o go down in his o y, you know.AnnOn Sep 19, 2007, a 10:03 AM, F ank Sump ion w o e:Yeah, I'm wo king o ge mo e made, bu i 's a slow p ocess, and he e's imes when I ge compl e ly bu ned ou on his s u . The p in ed ci cui boa ds will help, now I need o ind a p emade cabine , a a easoanble p ice. I 's no like I can jus  mass p oduce his  his s u .  F ankTo: EVP-ITC@yahoog oups.comF om: lisby@ea hlink.ne Da e: Tue, 18 Sep 2007 18:17:27 -0400Subjec : Re: [EVP-ITC] F anks box #12Yeah B uce! You go!  Rah! Rah! Rah! One s ep close o me ge ing one! ;)AnnOn Sep 18, 2007, a 4:02 PM, bhali333 w o e:hi E e yone,Don' e e ybody ha e me a one ime, bu F ank Sump ion was gene ous enough o gi e me his F ank's box #12 and I immedia ely s a ed ge ing esul s he momen I u ned i on. He e a e some esul s om my i s session wi h he box on FM linea .B uceMo e pho os; mo e messages; mo e wha e e – Ge MORE wi h Windows Li e™ Ho mail®. NOW wi h 5GB s o age. Ge mo e!"}