{"id": "2126", "subject": "Re: EVP Experiment planned in October.", "author": "delchay2005", "timestamp": "2007-09-19T23:42:06Z", "full_text": "--- \nHi Tracy,\n\nIf you study human agent poltergeist cases of psychokinesis, the \nidentified human agent is always in the house of structure when the \nobjects move.\n\nThe famous Miami Hotel case that Dr. William Roll investigated is a \ngreat example. When a certain kitchen worker was present, all sorts \nof objects were thrown around the room. When he was not there, \nnothing happened. When he left the Hotel for good, no more activity \nwas ever recorded.\n\nI would like to try to rule out, or, support the theory that we are \nnot, or that we might be imprinting EVP&#39;s on audio tracks or tape.\n\nMy own personal experience in EVP gathering leads me to believe that \nthis is phenomena driven, not my subconscious mind.\n\nBut now I have to try and find out the truth for myself.\n\nThis last year we saw an incredible amount of EVP&#39;s being recorded \nduring our cases we investigated. \n\nhttp://arizonaparanormalinvestigations.com/api_gallery/index.php?\ncat=4\n\nThe above is our link to our new EVP gallery if you would like to \nlisten to them. These were all recorded in the last year using  \nmultiple recorders in each location. There is a Grade A and a Grade \nB icon to seperate them.\n\n\nJames\n\n\n\nIn EVP-ITC@yahoogroups.com, Tracy &lt;loneshewolf999@...&gt; wrote:\n&gt;\n&gt; I am not sure this would still rule it out.  I don&#39;t think \npsychokinesis is restrained by walls, the mind isn&#39;t restrained by \nwalls whether human or deceased.  I am guessing that psychokinesis \nbehaves similar to telepathy....\n&gt;    \n&gt;   I believe many evp&#39;s are deceased spirits, but the question on \nwhether it could be a living person imprinting the evps was \ncertainly one that made me really think !  \n&gt; \n&gt; Frank Ratka &lt;warrior18eii@...&gt; wrote:\n&gt;               Hi James,\n&gt; \n&gt; Back when I still investigated haunted sites, our team did this on \nvarious occasions within a house where we recorded several hours of \nactivity over a few years (a long term investigation). We would \nleave our audio equipment recording in several &quot;hot spots&quot; all over \nthe house and then leave for an hour or two. I have to say, in our \nexperience we never got an EVP while we were out of the house. As a \nmatter of fact we had an EVP when we reentered the house \nsaying, &quot;here they come, lets go&quot;. I don&#39;t necessarily understand \nwhy a ghost or spirit would talk with no one present to receive the \nmessage unless during setup you explained what you are trying to \naccomplish and what the spirits roll is in the experiment (we never \ntried explaining). A piece of machinery (recorders) in an empty room \ndoes not have a consciousness or spiritual presence I would be \ninterested to see if you get different results.\n&gt; \n&gt; Regards,\n&gt; \n&gt; Frank\n&gt; \n&gt;   ----- Original Message ----\n&gt; From: delchay2005 &lt;azredant@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Tuesday, September 18, 2007 6:47:24 PM\n&gt; Subject: [EVP-ITC] EVP Experiment planned in October.\n&gt; \n&gt;     To try and rule out that the EVP researchers are imprinting \nvoices \n&gt; psychokinetically on audio players mistaken as ghosts voices, I \nwill \n&gt; pre-tape an interactive evp session.\n&gt; \n&gt; I will record a bank of thirty questions, 20 seconds of silence \n&gt; after each question, on a cassete tape and played on a cassette \n&gt; player that will be utilized in all three buildings in a known \n&gt; haunted location just outside of Phoenix, Arizona.\n&gt; \n&gt; There will be digital recorders, cassette recorders, omni \n&gt; directional microphones, condensor microphones, as well as an \n&gt; electrocet boom microphone present in all of the sessions. There \n&gt; will be no human agents in the buildings when these sessions take \n&gt; place.\n&gt; \n&gt; My hope is to:\n&gt; \n&gt; Record an authentic EVP with no human agent in the building. \n&gt; \n&gt; If this is phenomena driven, will the phenomena communicate by \n&gt; responding to questions from a machine rather than a human agent? \n&gt; \n&gt; If you have any ideas to enhance this experiment, please feel free \n&gt; to let me know. This experiment will take place on October 27th. \n&gt; \n&gt; James\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;   \n&gt; ---------------------------------\n&gt;   Be a better Heartthrob. Get better relationship answers from \nsomeone who knows.\n&gt; Yahoo! Answers - Check it out.\n&gt;"}