{"id": "2134", "subject": "Re: Franks box #12", "author": "LC Duplatt", "timestamp": "2007-09-20T11:58:12Z", "full_text": "I just joined this group and would like to first say, &quot;hello.&quot;\n\nAlright, so nobody hate me due to my first question, but I have to \nask this: Is there any interest in producing these components \noverseas?  \n\nIt could be done without explanation to the manufacturers, as to what \nis being produced, and different parts could be created from \ndifferent manufacturers, etc. I propose this, as it seems most \nelectronics work is being done in China and I have a friend who \nsources/produces/imports products from there.  Just an idea...\n\nLC\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@...&gt; \nwrote:\n&gt;\n&gt; \n&gt; Yeah, I&#39;m working to get more made, but it&#39;s a slow process, and \nthere&#39;s times when I get complterly burned out on this stuff. The \nprinted circuit boards will help, now I need to find a premade \ncabinet, at a reasoanble price. It&#39;s not like I can just mass produce \nthis this stuff.\n&gt;  \n&gt;  Frank\n&gt; \n&gt; \n&gt; To: EVP-ITC@...: lisby@...: Tue, 18 Sep 2007 18:17:27 -0400Subject: \nRe: [EVP-ITC] Franks box #12\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Yeah Bruce! You go!  Rah! Rah! Rah! One step closer to me getting \none! ;) \n&gt; \n&gt; Ann\n&gt; \n&gt; \n&gt; On Sep 18, 2007, at 4:02 PM, bhali333 wrote:\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; hi Everyone,Don&#39;t everybody hate me at one time, but Frank Sumption \nwas generous enough to give me his Frank&#39;s box #12 and I immediately \nstarted getting results the moment I turned it on. Here are some \nresults from my first session with the box on FM linear.Bruce\n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; More photos; more messages; more whatever  Get MORE with Windows \nLive Hotmail. NOW with 5GB storage.\n&gt; http://imagine-windowslive.com/hotmail/?locale=en-\nus&ocid=TXT_TAGHM_migration_HM_mini_5G_0907\n&gt;"}