{"id": "21353", "subject": "Re: A prediction that came true", "author": "psi_research", "timestamp": "2011-04-15T22:43:29Z", "full_text": "Predictions from Box is really what drew me in to this particular method of ITC. A Franks Box built in March 2007 predicted a very specific military stike. I was hesitant to post the information at the time since it seemed inflammatory but was shocked to see most of it come true. Here&#39;s the link to what happened and what Franks Box predicted to a large extent.\n\nhttp://en.wikipedia.org/wiki/Operation_Orchard\n\nI told Frank about this and then dialog with him about other forecast led to a interview with George Noorey about Doomsday Predictions. After the interview it was stated by a listener that people will look for events that fits the prediction and Box forecast were unreliable. The forecast that we spoke about concerned a catastrophe on the East Coast of the United States that may result in loss of life in a tidal wave from the Atlantic ocean and possibly due to a meteor strike. However, with no meteors being tracked and no huge storm in weather forecast bearing down on the easy coast, it was a dicey prediction as it was August 14 and the prediction said the danger would be on the 15th but no year was given. Here&#39;s the link to that broadcast:\n\nhttp://www.coasttocoastam.com/show/2009/08/14\n\nAt that point Frank and I knew at least we went public with information regarding a disaster and we provided specific information. Then that next day, August 15, a sudden storm developed into Tropical Depression Bill, intensified to Tropical Storm Bill, and formed a large eye. Within days, a newly dubbed Hurricane Bill would end the life of a 7-year-old girl who drowned after she, her father, and a 12-year-old girl were swept off a rocky ledge near Acadia National Park in Maine. Here&#39;s the link to info on that storm:\n\nhttp://en.wikipedia.org/wiki/Hurricane_Bill_(2009)\n\n-Bill\n\n\n--- In EVP-ITC@yahoogroups.com, Steven &lt;nicedude1986@...&gt; wrote:\n&gt;\n&gt; \n&gt; \n&gt; Adriana Jones &lt;adrianamjones@...&gt; wrote:\n&gt; \n&gt; &gt;Also wanted to add, after the Japan earthquake happened, two people on my Facebook admitted they had been having &quot;wall of water&quot; and earthquake dreams.  You never know whose predictions are accurate and whose aren&#39;t and when, but when you get several people coming together predicting similar things that should be a warning... the psychic prediction registry website makes that possible.\n&gt; &gt;\n&gt; &gt;--- In EVP-ITC@yahoogroups.com, &quot;Adriana Jones&quot; &lt;adrianamjones@&gt; wrote:\n&gt; &gt;&gt;\n&gt; &gt;&gt; Since predictions seem to be popular on these boards I thought I&#39;d post this\n&gt; &gt;&gt; \n&gt; &gt;&gt; http://www.youtube.com/watch?v=r7QAZPb-IEQ&feature=related\n&gt; &gt;&gt; \n&gt; &gt;&gt; I found this video posted on www.prophecies.us\n&gt; &gt;&gt; Regular Joes and Janes post their  predictions there.  I&#39;ve followed this site a year and a half now, and they&#39;ve had some predictions that came true.  If you&#39;re into predictions, I highly recommend this site.\n&gt; &gt;&gt;\n&gt; &gt;\n&gt; &gt;\n&gt;"}