{"id": "21402", "subject": "Re: Fort Mifflin A Walk Thru..", "author": "ejspinn", "timestamp": "2011-04-22T13:55:08Z", "full_text": "http://www.youtube.com/profile?nomobile=1&user=ParaSpinnProductions#p/u/1/A7DpGLkAI-c\n\nTake a look at my video from the fort, that is an amazing place.  The responses we got from casement 11 were amazing too.\n\n--- In EVP-ITC@yahoogroups.com, &quot;Kris&quot; &lt;tynlilysmommy@...&gt; wrote:\n&gt;\n&gt; So yesterday was my first trip to the amazing Fort Mifflin. We were lucky enough to be the only people there. We walked into the first building and thats where we got our first EVP of the day! Now mind you my 10 year old son was out with us, but you can hear the difference in his voice and this EVP. The voice Clearly says, &quot;He looks exactly like the same age as me&quot; And then A giggle comes after my son said something. I do need to do some research because Im not sure why a childs voice is coming over at a place like that. We continued around to a building where a supposed &quot;screaming lady&quot; is supposed to be, We caught a child again, with a name &quot;elizabeth&quot; Move forward a bit I was like wow I got a name after reviewing and decided to research William Howe who was housed in Casemate 11, I came across the &quot;screaming lady&quot; Whos name happened to be Elizabeth!!! \n&gt; So back to our walk, We caught alot of evps, We had one crappy recorder and a good recorder. We ended up leaving our crap one in Casemate 11 while we continued our walk. At that time, there were 2 other groups there. Well During this alone time in Casemate 11, We caught voices and what sounds like shuffling and banging, Now the only thing that leads me to believe this is NOT a person because You can hear my footsteps coming into and leaving the casemate. With this audio you hear shuffling as if it originated inside the casemate and no one left, there are no footsteps out. Then We caught what we think is an actual conversation, What we got out of it is, A Whisper we cant make out, A Name being called, A answer back, The voice saying &quot;get out&quot; An answer of &quot;Yes Sir&quot; and then what sounds like is someone in pain or someone upset. And then it just stops. \n&gt; It is an amazing piece of audio and I cannot wait to share it with all of you as soon as i get it cleaned up and on the computer...\n&gt; We walked through the rest of the casemates and its just amazing, I will let you know as soon as I post everything!!!\n&gt; I would love to get opinions on these...\n&gt;"}