{"id": "21416", "subject": "Re: electronic visual phenomenon", "author": "Adriana Jones", "timestamp": "2011-04-25T00:04:09Z", "full_text": "Great. Thank you.\n\n--- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  Yeah, just used the pause funtion, then save the image.\n&gt; \n&gt; F-S\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Adriana Jones&quot; &lt;adrianamjones@&gt; wrote:\n&gt; &gt;\n&gt; &gt; seriously?  awesome!  what did you do, you just fast forwarded it, and videotaped the screen while doing it?  I&#39;d seriously consider trying to do this with video technology... what would be really cool is if you could run the ghost box and the video at the same time, and ask them if they&#39;d be kind enough to help validate it by holding a couple fingers up to the screen... or something to that effect.\n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; &lt;purplealiengirl@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt;  Kinda. I had a video box years ago, it was a VCR tuner that I swept just like I do with the radio in a box, got some intersting images, too bad don&#39;t work anymore because of the change in TV formats recently.\n&gt; &gt; &gt; \n&gt; &gt; &gt; F-S\n&gt; &gt; &gt; \n&gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;Adriana Jones&quot; &lt;adrianamjones@&gt; wrote:\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; does any one know if this is possible or has tried it: visual equivalent of the ghost box, like  a bunch of movie frames and scramble them and scroll through them quickly, could that produce anything?????  Is that something that could be accomplished with video editing software?  is that what evpmaker is?  pre-fed raw audio (rather than live transmitted audio like the ghost box) ?\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; I dunno, maybe sounds farfetched, but thought I&#39;d ask... was thinking about it last night....\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}