{"id": "21442", "subject": "Re: [EVP-ITC] From channel flipping. [4 Attachments]", "author": "Tim Woolworth", "timestamp": "2011-05-01T13:22:17Z", "full_text": "Frank,\n\nIn your first clip, I also hear &quot;Not&quot; before bad work.\nI heard 90% of your second clip the way you heard it.\nThe last clip I heard as you did.\n\nBut what intrigues me most is the &quot;I wanna fuck him&quot; clip.  I recorded the\nsame type of message yesterday with a Sangean hack and I got something about\n&quot;Princess,&quot; which is something I almost never record.\n\n:09 &quot;Tim&quot;\n:16 &quot;I can&#39;t find her the Princess&quot;\n:23 &quot;Hey ya know I fucked ya.&quot;\n:26 &quot;Andy&quot;\n:34 &quot;You&#39;re psycho shut-up&quot;\n:42 &quot;We talk over radio&quot;\n\nThere is also talk at the beginning about 10 million people disappearing and\nat about :20, there is a brief piece of language which is not human, at\nleast not any human language I have ever heard before.\n\nTim\n\nOn Sun, May 1, 2011 at 2:05 AM, Frank Sumption &lt;purplealiengirl@...&gt;wrote:\n\n&gt;\n&gt;  [Attachment(s) &lt;#12faa29a89b79e3b_TopText&gt; from Frank Sumption included\n&gt; below]\n&gt;\n&gt; Just flipping back and forth between a couple channels. Main file is\n&gt; 11.6mb, and it can&#39;t be compressed for use with EVPmaker.\n&gt;\n&gt;  F-S\n&gt;\n&gt;  \n&gt;\n\nF ank,In you i s clip, I also hea \"No \" be o e bad wo k.I hea d 90% o you second clip he way you hea d i .The las clip I hea d as you did.\nBu wha in igues me mos is he \"I wanna uck him\" clip.  I eco ded he same ype o message yes e day wi h a Sangean hack and I go some hing abou \"P incess,\" which is some hing I almos ne e eco d.\n:09 \"Tim\":16 \"I can' ind he he P incess\":23 \"Hey ya know I ucked ya.\"\n:26 \"Andy\":34 \"You' e psycho shu -up\":42 \"We alk o e adio\"The e is also alk a he beginning abou 10 million people disappea ing and a abou :20, he e is a b ie piece o language which is no human, a leas no any human language I ha e e e hea d be o e.\nTimOn Sun, May 1, 2011 a 2:05 AM, F ank Sump ion pu plealiengi l@gmail.com> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n [A achmen (s) om F ank Sump ion included below]\n \n \n Jus lipping back and o h be ween a couple channels. Main ile is 11.6mb, and i can' be comp essed o use wi h EVPmake .\n \n F-S"}