{"id": "21451", "subject": "Re: [EVP-ITC] Re: Warning,", "author": "SnowfireL@aol.com", "timestamp": "2011-05-03T00:03:30Z", "full_text": "--part1_4c9ae.506d92db.3af0a052_boundary\r\nContent-Type: text/plain; charset=&quot;US-ASCII&quot;\r\nContent-Transfer-Encoding: 7bit\r\n\r\nThanks Steve, sounds like something I can really use, Carbonite, got to get \nmore files with the peanut gallery first, i did manage to get some of them, \nbut the ones about those girls that got killed, and the killers name from 3 \nyears ago, are lost.  Remember, the Chinese girl, Annie Ye?  Spirit named \nher killer, and all the details and they were right, plus the info. on the \nSummers girl, and other little girl down in FL, they were right about that \ntoo.  Even the little boy, they named the step mother who tossed his body over \nsome bridge, and there were other cases they sloved.  They were right too, I \nthink that person David had a lot to do with keeping them truthful.  I sure \nwill sign up for that program. sf\n\r\n--part1_4c9ae.506d92db.3af0a052_boundary\r\nContent-Type: text/html; charset=&quot;US-ASCII&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;HTML&gt;&lt;HEAD&gt;\n&lt;META charset=3DUS-ASCII http-equiv=3DContent-Type content=3D&quot;=\r\ntext/html; charset=3DUS-ASCII&quot;&gt;\n&lt;META content=3D&quot;MSHTML 6.00.5730.13&quot; name=\r\n=3DGENERATOR&gt;&lt;/HEAD&gt;\n&lt;BODY style=3D&quot;FONT-SIZE: 10pt; FONT-FAMILY: Arial; BA=\r\nCKGROUND-COLOR: #ffffff&quot;&gt;Thanks Steve, sounds like something I can really u=\r\nse, Carbonite, got to get more files with the peanut gallery first, i did m=\r\nanage to get some of them, but the ones about those girls that got killed, =\r\nand the killers name from 3 years ago, are lost.&nbsp; Remember, the Chines=\r\ne girl, Annie Ye?&nbsp; Spirit named her killer, and all the details and th=\r\ney were right, plus the info. on the Summers girl, and other little girl do=\r\nwn in FL, they were right about that too.&nbsp; Even the little boy, they n=\r\named the step mother who tossed his body over some bridge, and there were o=\r\nther cases they sloved.&nbsp; They were right too, I think that person Davi=\r\nd had a lot to do with keeping them truthful.&nbsp; I sure will sign up for=\r\n that program. sf&lt;/BODY&gt;&lt;/HTML&gt;\n\r\n--part1_4c9ae.506d92db.3af0a052_boundary--"}