{"id": "21527", "subject": "Re: Warning from David the Tech,", "author": "jamieghostwriter", "timestamp": "2011-05-22T18:51:05Z", "full_text": "You don&#39;t need a tech guy to tell you this &quot;Ra-El&quot; is full of crap. The &quot;Donations&quot; link on his site should say that loud and clear. Why would Jesus need money? What could this person possibly hope to gain? World domination, or just lots of money before everyone figures out he&#39;s a crackpot?\n\nHonestly, there are tons of false profits, so I don&#39;t think that there will be only one, as in &quot;THE false profit.&quot; George Bush is a fine example, as well as Usama Bin Ladin. Good ol&#39; George claimed God spoke to him. Really? Conveniently enough, God didn&#39;t make ol&#39; Georgie-boy intelligent enough to run the country. Too bad.\n\nIt seems pretty obvious to me that, when and if JC does return, he ain&#39;t gonna be a fat guy on a horse in a bad Renaissance festival costume, and I&#39;m pretty sure you&#39;ll know it when he finally does hit the pavement. ;)\n\n\n--- In EVP-ITC@yahoogroups.com, SnowfireL@... wrote:\n&gt;\n&gt; Ok, guys David says this guy is &quot;very bad&quot; he claims to be JC, but of  \n&gt; course he is not.  And he is probably form what David the Tech says, the  guy \n&gt; may very well be the &quot;false prophet,&quot; although he makes his claim to be JC  \n&gt; only is using a different name.  Please be careful everyone, Israel is  \n&gt; already fighting with mobs of Muslims starting up a nasty war with them as I am  \n&gt; typing this, I don&#39;t know if I should even post this link about this false  \n&gt; prophet, but you folks are smart people and won&#39;t fall for it, your angels \n&gt; will  protect you all from these false prophets and false leaders.  David \n&gt; wanted  me to turn it off, he said it is an &quot;antichrist spirit and false \n&gt; prophet,  and he&#39;s very bad.&quot;  This false person will &quot;address the world May 22, \n&gt; here  is the link, this is NOT Jesus, so please be careful everyone, I \n&gt; hesitate to  even post it.  Stay safe,   sf\n&gt;  \n&gt;  \n&gt;  \n&gt;  \n&gt; _http://www.ra-el.org/messages.html_ (http://www.ra-el.org/messages.html)\n&gt;"}