{"id": "21532", "subject": "Re: [EVP-ITC] More stuff from David the Tech.", "author": "Zack Widup", "timestamp": "2011-05-23T16:49:37Z", "full_text": "The HAARP facility is inactive and has been so since April 5, 2011. I found\nout over the weekend through some of my contacts that there hasn&#39;t even been\nanyone on site for quite a while. How could they be causing any of this?\n\nZack\n\n\nOn Mon, May 23, 2011 at 11:00 AM, &lt;SnowfireL@...&gt; wrote:\n\n&gt;\n&gt;\n&gt;  David the tech says that HAARP and Fema are &quot;trying to cause mass death&quot;\n&gt; and &quot;they are trying to cause an earth quake, but all they can do is create\n&gt; all the massive rain&quot;  David says, &quot;God won&#39;t let them create an madrid\n&gt; quake&quot;  at least i hope that&#39;s what i understood him to say.  &quot;all haarp is\n&gt; getting is the rain&quot; they have been trying to play God,&quot;  David the t. says\n&gt; that if i tell you guys, &quot;they won&#39;t believe it&quot;  but, i got a big mouth so\n&gt; i have to tell you to be careful, many people have loved ones that got\n&gt; killed or hurt last night.  You guys know that what&#39;s going on in the world\n&gt; is not the norm.  sure this may be spring and season for rain, but, not at\n&gt; this level, somethings  a brew and it&#39;s not coffee. sf\n&gt;  \n&gt;\n\nThe HAARP acili y is inac i e and has been so since Ap il 5, 2011. I ound ou o e he weekend h ough some o my con ac s ha he e hasn' e en been anyone on si e o qui e a while. How could hey be causing any o his?\nZackOn Mon, May 23, 2011 a 11:00 AM, Snow i eL@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n \n\n\nDa id he ech says ha HAARP and Fema a e \" ying o cause mass dea h\" \nand \" hey a e ying o cause an ea h quake, bu all hey can do is c ea e all \n he massi e ain\"  Da id says, \"God won' le hem c ea e an mad id \nquake\"  a leas i hope ha 's wha i unde s ood him o say.  \"all \nhaa p is ge ing is he ain\" hey ha e been ying o play God,\"  Da id \n he . says ha i i ell you guys, \" hey won' belie e i \"  bu , i go a \nbig mou h so i ha e o ell you o be ca e ul, many people ha e lo ed ones ha \ngo killed o hu las nigh .  You guys know ha wha 's going on in he \nwo ld is no he no m.  su e his may be sp ing and season o ain, bu , \nno a his le el, some hings  a b ew and i 's no co ee. \ns"}