{"id": "21554", "subject": "Re: Too compressed Frank,", "author": "jamietreetalker", "timestamp": "2011-06-01T17:49:29Z", "full_text": "Ditto, sort of. I have limited time, and quite honestly, I&#39;ve been a member of this group for some time, but I never got around to reading any posts. I&#39;ve started reading them when I get a chance, now, though, and I&#39;m kinda feeling things out to see what might be good to share. I&#39;ve been doing many different kinds of paranormal research lately, not just ghost hunting, because ghosts (or spirits) are only one part of the larger picture. No super human abilities here, but I&#39;m a great learner, and I&#39;ve really enjoyed what I have read in this group so far. And sadly, I have no secret book project, either. ;)\n\n--- In EVP-ITC@yahoogroups.com, &quot;Joeine C.&quot; &lt;raggedyann8140@...&gt; wrote:\n&gt;\n&gt; Well.. I for one, don&#39;t post because I have nothing valuable to contribute.  I am very interested in\n&gt; communication from the spirit world. And read all the posts with interest; But I work full time and don&#39;t \n&gt; have the time to spend right now in learning and developing my interest. Maybe someday I&#39;ll be able to\n&gt; retire and be able to devote more time. But I  also know once I got started , I would become too engrossed and\n&gt; probably neglect other areas of my life. This Forum is one way for me to keep the door open, when I&#39;m ready.\n&gt; So all your posts are read and appreciated by me, even tho I don&#39;t contribute.\n&gt; \n&gt;  \n&gt; \n&gt; IS THIS WHERE YOU LIVE? \n&gt; &quot;No, I live in heaven, and my affections\n&gt; are there. I just borrow this shack while\n&gt; waiting for my ride home.&quot;\n&gt; \n&gt; From: &quot;SnowfireL@...&quot; &lt;SnowfireL@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Friday, May 20, 2011 4:08 PM\n&gt; Subject: Re: [EVP-ITC] Re: Too compressed Frank,\n&gt; \n&gt; \n&gt;   \n&gt; Makes me wonder what are all the people doing on here?  Maybe, they are using what the few send in to write books so they can take credit. lol  Oh, don&#39;t mind me, just wondering too. sf\n&gt; \n&gt; In a message dated 5/20/2011 1:45:07 P.M. Eastern Daylight Time, purplealiengirl@... writes:\n&gt;   \n&gt; &gt;Wow!! 850 members, and there are three of us that post anything.\n&gt; &gt;\n&gt; &gt;Where are all the super human ghost hunters?\n&gt; &gt;\n&gt; &gt;F-S\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt;"}