{"id": "21556", "subject": "Paranormal workshop and events", "author": "Ursula", "timestamp": "2011-06-01T22:34:46Z", "full_text": "The Watseka Roff Home, Watseka, IL June 11, 2011\nView Product Images\n\n\t\t\nPrice: \t$55.00\n\nThe Watseka Wonder       \n\nCalled &quot;America&#39;s first documented case of spiritual possession,&quot; the &quot;Watseka Wonder&quot; is the name given to the strange case of the possession of a young Lurancy Vennum by the spirit of Mary Roff, the daughter of a founder of the small town of Watseka.\n\nAs documented by an eyewitness account and later retold in the 1977 novel &quot;Watseka,&quot; Mary died suddenly in 1865 at age 19, only to come back 12 years later to possess the body of 14-year-old Lurancy Vennum.\n\nThe tale, well known in Watseka and Iroquois County, has also been the subject of writings by philosopher William James, Troy Taylor (&quot;Weird Illinois&quot; and &quot;The Possessed&quot;) and most recently the subject of the documentary &quot;The Possessed&quot; by the Booth Brothers.\n\nThe Roff Home, where Lurancy lived for 100 days when she believed herself to be possessed by the spirit of Mary Roff, still stands in Watseka today and is currently undergoing an extensive renovation to return it to its former\n\n Learn more about the background http://www.roffhome.com/lurancy-vennum.html\n\n Join us for a overnight event..we will will conduct a Ghost box sessions class We will introduce you to various &quot;Ghost Box&quot; devices including the legendary &quot;Franks&#39;s Box&quot;, which was sent to Ursula by the creator Frank Sumption,\nhimself. These rare devices have only been distributed to individuals who Frank was called to deliver through spirits. Ursula has been honored with two of these amazing devices (#67 & #83). We will go to a location and hear real time live\ncommunication with a variety of boxes including Frank&#39;s, Steve, Rich and Chris boxes, which are no longer in circulation. These more complex devices are not to be confused with a hacked radio but are modeled after the original &quot;Frank&#39;s\nBox&quot;. We will touch on hacked radio&#39;s, as well. Ursula&#39;s collection includes a total of eleven boxes, including the P-SB 7 (as seen on Ghost Adventurers and Ghost Hunters).\n\nYou will also have be able the 90% of the house including the grounds . The home sits on five acres of land that still retains much of its original landscaping from the late 1800s. Some investigators have claimed to have found certain evidence in the stand of oak trees to the west of the home. These trees were originally planted by the Roff family when they built the home in 1868.While we were there we obtained quite a few evp from the grounds alone feel free to check out our evp from our last visit including under best evp a residual evp of a young child &quot;\n\n \n\nThe owner requests anyone interested in meditation at the Roff Home before the event 30 minutes early.\n\nThe Healing Wall\n\nDuring your visit, you can place a record of your action of healing in the wall in the room in which Lurancy stayed, in honor of her time here and of the healing that her time represented. Your posting can be open, for later visitors to read, or you can seal it in an envelope, never to be opened. When Lurancy&#39;s room is replastered, all postings will be sealed in plastic and encased in the wall of her room for some future owner in some future generation to discover.\n\n \n\n10% of the proceeds will go to charity.\n \n \n\nGuest speakers\n \n \nJuli Velazquez (Juli Botwinski-Velazquez)\nfeatured in the movie &quot;The Possessed&quot; on SyFy and Children of the Grave.\n\n \n\n \n \nAlexander Felix -founder of West Chicago Paranormal, A.K.A. We-Go Paranormal, and lead investigator for Ghost Tours of Naperville.\n\n \n\n,No Hard Alcohol\n\nThese pages are dedicated to the spirit and memory of my mother, Diane Brown."}