{"id": "21564", "subject": "Re: Propagation seems to be picking up.", "author": "jamietreetalker", "timestamp": "2011-06-02T18:55:26Z", "full_text": "--5-6767656395-2977287364=:3\r\nContent-Type: text/plain; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n\n:( You mean, I&#39;m not an expert after only a few months of following your\nw=\r\nork? Dammit! (LOL, just kiddin&#39; around.)\n\nI think it would really be great =\r\nand helpful, at least to me, if someone\nheld an ITC/EVP summit where ONLY p=\r\neople who are interested in this\ntechnology could get together and particip=\r\nate in round-table discussions\nto share ideas, listen to each other&#39;s work =\r\n(recordings, live\ndemonstrations), learn from The Masters in the field (lik=\r\ne yourself!),\nand come to some serious understandings. NO celebrity promoti=\r\nons, no\nghost investigations or ghost celebrities (no offense, anyone, but =\r\nit&#39;s\nnot the place for it), no fund raising, no vendors, no competition for=\r\n\nthe spotlight, just talking and learning from each other and developing\nre=\r\nlationships. There&#39;s so much to learn and no one person knows it all\nor can=\r\n share everything they know in a handful of postings on a Web\nsite. I think=\r\n  real human interaction is what helps progress\nunderstanding. People who a=\r\nre serious about learning this stuff would\ncome to something like that, and=\r\n they would appreciate it for what it\nis. I think you guys who create and u=\r\nnderstand this technology have a\nreal responsibility to help others underst=\r\nand it. It&#39;s the Spiderman\nprinciple! &quot;With great power comes great respons=\r\nibility.&quot; (Thanks, Uncle\nBen!)\n\n\nI just feel like sometimes people in this =\r\nfield are too afraid to share\ninformation because people will debunk them o=\r\nr try to discredit them or\nsomeone will &quot;steal&quot; their ideas (believe me, I&#39;=\r\nm no friggin&#39; stranger\nto having my ideas stolen! They don&#39;t want ME around=\r\n, but the a**wipes\nsure as hell LOVE my ideas!!). I really think that most =\r\npeople are more\naccepting than that, though, and that it&#39;s time that seriou=\r\ns researchers\nwho aren&#39;t in it for the fame come together and make some pro=\r\ngress. I&#39;d\nbe happy to volunteer to help organize such a thing.\n\n\n\n\n\n\n\n\n\n--=\r\n- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@...&gt;\nwrote:\n&gt;=\r\n\n&gt;  Propagation even from the other side seems to be a function of solar\n&gt; =\r\nactivity, years ago as the sunspots went away, so did the clarity of\nthe\n&gt; =\r\nvoices. Compressed=3Dmp3 file. Here is one area of real research, people\nco=\r\nuld\n&gt; be comparing contact strength, instead of just declaring themselves\nt=\r\nop box\n&gt; experts.\n&gt;\n&gt;\n&gt; Partial list.......&quot;AM---They Call The Doctors Good=\r\n\n&gt; People-Edward-Don&#39;t DoIt----Lets Drink Some Pepsi--These Are Crazy\n&gt; Peo=\r\nple--(26sec)Lets Garden The Earth-----compressed&quot;  This Edward, I\nhave\n&gt; go=\r\ntten since day one, as well as the Pepsi drinkers. From May 20,\n2011.\n&gt; F-S=\r\n\n&gt;\n\n\r\n--5-6767656395-2977287364=:3\r\nContent-Type: text/html; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n\n&lt;p&gt;:( You mean, I&#39;m not an expert after only a few months of following you=\r\nr work? Dammit! (LOL, just kiddin&#39; around.) &lt;br&gt;&lt;br&gt;I think it would really=\r\n be great and helpful, at least to me, if someone held an ITC/EVP summit wh=\r\nere ONLY people who are interested in this technology could get together an=\r\nd participate in round-table discussions to share ideas, listen to each oth=\r\ner&#39;s work (recordings, live demonstrations), learn from The Masters in the =\r\nfield (like yourself!), and come to some serious understandings. NO celebri=\r\nty promotions, &lt;strong&gt;no ghost investigation&lt;/strong&gt;&lt;strong&gt;s or ghost ce=\r\nlebrities &lt;/strong&gt;(no offense, anyone, but it&#39;s not the place for it), no =\r\nfund raising, no vendors, no competition for the spotlight, just talking an=\r\nd learning from each other and developing relationships. There&#39;s so much to=\r\n learn and no one person knows it all or can share everything they know in =\r\na handful of postings on a Web site. I think  real human interaction is wha=\r\nt helps progress understanding. People who are serious about learning this =\r\nstuff would come to something like that, and they would appreciate it for w=\r\nhat it is. I think you guys who create and understand this technology have =\r\na real responsibility to help others understand it. It&#39;s the Spiderman prin=\r\nciple! &quot;With great power comes great responsibility.&quot; (Thanks, Uncle Ben!)&=\r\nnbsp;&lt;br&gt;&lt;/p&gt;&lt;p&gt;I just feel like sometimes people in this field are too afr=\r\naid to share information because people will debunk them or try to discredi=\r\nt them or someone will &quot;steal&quot; their ideas (believe me, I&#39;m no friggin&#39; str=\r\nanger to having my ideas stolen! They don&#39;t want ME around, but the a**wipe=\r\ns sure as hell LOVE my ideas!!). I really think that most people are more a=\r\nccepting than that, though, and that it&#39;s time that serious researchers who=\r\n aren&#39;t in it for the fame come together and make some progress. I&#39;d be hap=\r\npy to volunteer to help organize such a thing.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;=\r\n&lt;br&gt;&lt;/p&gt;--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@=\r\n...&gt; wrote:&lt;br&gt;&gt;&lt;br&gt;&gt;  Propagation even from the other side seems =\r\nto be a function of solar&lt;br&gt;&gt; activity, years ago as the sunspots went =\r\naway, so did the clarity of the&lt;br&gt;&gt; voices. Compressed=3Dmp3 file. Here=\r\n is one area of real research, people could&lt;br&gt;&gt; be comparing contact st=\r\nrength, instead of just declaring themselves top box&lt;br&gt;&gt; experts.&lt;br&gt;&g=\r\nt; &lt;br&gt;&gt; &lt;br&gt;&gt; Partial list.......&quot;AM---They Call The Doctors Good&lt;br=\r\n&gt;&gt; People-Edward-Don&#39;t DoIt----Lets Drink Some Pepsi--These Are Crazy&lt;br=\r\n&gt;&gt; People--(26sec)Lets Garden The Earth-----compressed&quot;  This Edward, I =\r\nhave&lt;br&gt;&gt; gotten since day one, as well as the Pepsi drinkers. From May =\r\n20, 2011.&lt;br&gt;&gt; F-S&lt;br&gt;&gt;&lt;br&gt;\n\r\n--5-6767656395-2977287364=:3--"}