{"id": "21575", "subject": "Re: Propagation seems to be picking up.", "author": "purplespacefriend", "timestamp": "2011-06-04T18:07:27Z", "full_text": "I don&#39;t know how one would put somehthing like together. I&#39;m just a techno droid. I&#39;m not a spiritual master, or understand the communcations that much, I&#39;m just intrigued and hooked on this stuff cuz something talks, it seems to know me, and it&#39;s ever present. I only know if you provide a way that &quot;they&quot; can make voices, they will talk, any method of supplying the raw audio seems to work, and some things work better than the boxes. \n\nFrank-S\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;jamietreetalker&quot; &lt;thequilldriver@...&gt; wrote:\n&gt;\n&gt; \n&gt; :( You mean, I&#39;m not an expert after only a few months of following your\n&gt; work? Dammit! (LOL, just kiddin&#39; around.)\n&gt; \n&gt; I think it would really be great and helpful, at least to me, if someone\n&gt; held an ITC/EVP summit where ONLY people who are interested in this\n&gt; technology could get together and participate in round-table discussions\n&gt; to share ideas, listen to each other&#39;s work (recordings, live\n&gt; demonstrations), learn from The Masters in the field (like yourself!),\n&gt; and come to some serious understandings. NO celebrity promotions, no\n&gt; ghost investigations or ghost celebrities (no offense, anyone, but it&#39;s\n&gt; not the place for it), no fund raising, no vendors, no competition for\n&gt; the spotlight, just talking and learning from each other and developing\n&gt; relationships. There&#39;s so much to learn and no one person knows it all\n&gt; or can share everything they know in a handful of postings on a Web\n&gt; site. I think  real human interaction is what helps progress\n&gt; understanding. People who are serious about learning this stuff would\n&gt; come to something like that, and they would appreciate it for what it\n&gt; is. I think you guys who create and understand this technology have a\n&gt; real responsibility to help others understand it. It&#39;s the Spiderman\n&gt; principle! &quot;With great power comes great responsibility.&quot; (Thanks, Uncle\n&gt; Ben!)\n&gt; \n&gt; \n&gt; I just feel like sometimes people in this field are too afraid to share\n&gt; information because people will debunk them or try to discredit them or\n&gt; someone will &quot;steal&quot; their ideas (believe me, I&#39;m no friggin&#39; stranger\n&gt; to having my ideas stolen! They don&#39;t want ME around, but the a**wipes\n&gt; sure as hell LOVE my ideas!!). I really think that most people are more\n&gt; accepting than that, though, and that it&#39;s time that serious researchers\n&gt; who aren&#39;t in it for the fame come together and make some progress. I&#39;d\n&gt; be happy to volunteer to help organize such a thing.\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@&gt;\n&gt; wrote:\n&gt; &gt;\n&gt; &gt;  Propagation even from the other side seems to be a function of solar\n&gt; &gt; activity, years ago as the sunspots went away, so did the clarity of\n&gt; the\n&gt; &gt; voices. Compressed=mp3 file. Here is one area of real research, people\n&gt; could\n&gt; &gt; be comparing contact strength, instead of just declaring themselves\n&gt; top box\n&gt; &gt; experts.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Partial list.......&quot;AM---They Call The Doctors Good\n&gt; &gt; People-Edward-Don&#39;t DoIt----Lets Drink Some Pepsi--These Are Crazy\n&gt; &gt; People--(26sec)Lets Garden The Earth-----compressed&quot;  This Edward, I\n&gt; have\n&gt; &gt; gotten since day one, as well as the Pepsi drinkers. From May 20,\n&gt; 2011.\n&gt; &gt; F-S\n&gt; &gt;\n&gt;"}