{"id": "21618", "subject": "Re: NEW BOOK ON EVP-BY A SCIENTIST", "author": "purplespacefriend", "timestamp": "2011-06-12T06:32:15Z", "full_text": "Well said!\n\nF-S\n\n--- In EVP-ITC@yahoogroups.com, &quot;jamietreetalker&quot; &lt;thequilldriver@...&gt; wrote:\n&gt;\n&gt; Since the 70s, huh? I&#39;m sorry, but I have to disagree. Well, maybe I&#39;ve\n&gt; been imagining things for the past ten years, but there have been a host\n&gt; of researchers inventing real-time communication devices that produce\n&gt; some pretty convincing intelligent responses, or &quot;EVP.&quot;\n&gt; \n&gt; No disrespect intended, but do you really think that this scientist is\n&gt; an expert in EVP because he wrote a book that wasn&#39;t even picked up by a\n&gt; real publisher? That doesn&#39;t fly with people who have been doing this\n&gt; for ages and who have been producing exceptional results. A person can&#39;t\n&gt; just saunter into a field such as this with a Ph.D. and flash a book\n&gt; around claiming to know it all. In my humble opinion, this isn&#39;t a field\n&gt; that can be targeted for scientific research. There are too many\n&gt; variables to consider, most of which we know nothing about. It&#39;s nearly\n&gt; impossible to prove that EVP is real, scientifically or not, because\n&gt; there are always skeptics who will claim it&#39;s all fake. (And of course,\n&gt; everyone else knows better, right?)  I&#39;ve read several journal articles\n&gt; and papers written by university professors and serious researchers, and\n&gt; from what I&#39;ve learned, you can try as many times as you want to have a\n&gt; &quot;controlled&quot; environment for so-called &quot;scientific&quot; EVP research, but it\n&gt; will fail, over and over. You know why? The human element will\n&gt; interfere, whether it&#39;s during the experiment or afterward, every time.\n&gt; Now, I&#39;m not saying your belief that this book is good is ridiculous\n&gt; because it must have value for you, or you wouldn&#39;t have posted it. I\n&gt; would like to point out, however, that you might consider a more open\n&gt; minded approach before waltzing into a group like this and insulting its\n&gt; population with your particular phraseology. We are all somewhat learned\n&gt; individuals, and we are particularly well-read in this field. Please do\n&gt; not assume we are unaware of anything.\n&gt; -Jamie\n&gt; --- In EVP-ITC@yahoogroups.com, &quot;ozestrangeufo&quot; &lt;ozestrangeufo@&gt;\n&gt; wrote:\n&gt; &gt;\n&gt; &gt; Thanks..you have a great web site there.!I was looking at your\n&gt; &gt;\n&gt; pageshttp://www.realinvestigationsoftheparanormal.net/index.php?p=1_50_H&#92;\n&gt; &#92;\n&gt; &gt; aunted-Tanning-SpaI found alot of background noise but did manage to\n&gt; &gt; hear some of the evp`s.I am half way through getting operations on my\n&gt; &gt; inner ear so I have a problem with some frequency ranges.What main\n&gt; &gt; equipment are you using for evp work.The reason I brought up the book\n&gt; &gt; was I dont think the &quot;field&quot; will advance much without a firm\n&gt; &gt; scientific/empirical basis.And no one has done the blind testing that\n&gt; &gt; McCrae has done..and published..I have a few books on evp now...and\n&gt; this\n&gt; &gt; book makes most of them look like books produced for kids..Thats the\n&gt; &gt; difference..The &quot;mere&quot; collecting of more and more evp`s..has not\n&gt; moved\n&gt; &gt; the field anywhere since the 1970`s.And that comment is not a slight\n&gt; &gt; towards people collecting evp`s.. :)But if researchers are unware what\n&gt; &gt; has been accomplished in the field by scientists, or analogies to some\n&gt; &gt; of the reports associated with some forms of mental illness etcthen I\n&gt; &gt; think they are missing out.\n&gt; &gt; Mike\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com, Rick Wegrzyn rickwegrzyn@ wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; You want Class A evps check out what we got in our home.1st FULL\n&gt; &gt; SENTENCED\n&gt; &gt; &gt; responses..www.realinvestigationsoftheparanormal.net\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; ________________________________\n&gt; &gt; &gt; From: ozestrangeufo ozestrangeufo@\n&gt; &gt; &gt; To: EVP-ITC@yahoogroups.com\n&gt; &gt; &gt; Sent: Thu, June 9, 2011 3:51:24 PM\n&gt; &gt; &gt; Subject: [EVP-ITC] NEW BOOK ON EVP-BY A SCIENTIST\n&gt; &gt; &gt;\n&gt; &gt; &gt; \n&gt; &gt; &gt; Since the evp field has hardly evolved in the last 30 years\n&gt; &gt; scientifically at\n&gt; &gt; &gt; least\n&gt; &gt; &gt; I decided to download this  ebook the other day.\n&gt; &gt; &gt; I realise that many of you would not know of a scientist called Alex\n&gt; &gt; McCrae but\n&gt; &gt; &gt; instead of wandering around with a tape recorder/any device and then\n&gt; &gt; postng up\n&gt; &gt; &gt; examples for discussion,and thinking thats cutting edge.. he has\n&gt; taken\n&gt; &gt; the genre\n&gt; &gt; &gt; about 20 steps past that.\n&gt; &gt; &gt; From his site\n&gt; &gt; &gt; He is one of the few to use faraday cages/blind tests on subject to\n&gt; &gt; rule out\n&gt; &gt; &gt; pareidolia/going to differernt countries and still getting evp in\n&gt; his\n&gt; &gt; &gt; language..finding commonlaity with evp voices and the voice that\n&gt; some\n&gt; &gt; people\n&gt; &gt; &gt; with some  forms of mental illness &quot;hear&quot;.\n&gt; &gt; &gt; Science Proves Spirits Exist!\n&gt; &gt; &gt; Science Proves Spirits Exist! You already knew that?Cool&quot;\n&gt; &gt; but now no one can\n&gt; &gt; &gt; argue with you about it.Just point to the EVIDENCE!With the kind\n&gt; &gt; permission of\n&gt; &gt; &gt; the Institute of Noetic Sciences [yes, the people mentioned in Dan\n&gt; &gt; Brown&#39;s\n&gt; &gt; &gt; book!] retired Scottish scientist Alexander MacRae carried out a key\n&gt; &gt; experiment\n&gt; &gt; &gt; at their laboratory in California.Read the evidence in The Portal\n&gt; &gt; &quot; Part One .\n&gt; &gt; &gt; From the cricket noises no one is doing reel to reel work anymore\n&gt; here\n&gt; &gt; like\n&gt; &gt; &gt; Sarah Estep.\n&gt; &gt; &gt; Fair enough..\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}