{"id": "21614", "subject": "Re: NEW BOOK ON EVP-BY A SCIENTIST", "author": "purplespacefriend", "timestamp": "2011-06-12T01:40:34Z", "full_text": "You think EVP has not evolved because you ignore all evidence and the results of all researchers/enthusiasts. It is all to easy for people to deny deny deny, do no experiments themselves, and claim they somehow know better. \n\n Alec and I have communicated on and off for maybe ten years. \n\n Bottom line, EVP is mostly for the one receiving it, few if any will hear the same thing, we get enough to show there something real hear. \n\n Ya wanna make us all believe it&#39;s some kind of skitzo shit, ya might want to move on to someone who might listen. \n\nF-S\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;ozestrangeufo&quot; &lt;ozestrangeufo@...&gt; wrote:\n&gt;\n&gt; Since the evp field has hardly evolved in the last 30 years\n&gt; scientifically at least I decided to download this \n&gt; &lt;http://stores.lulu.com/evp &gt;  ebook the other day.\n&gt; I realise that many of you would not know of a scientist called Alex\n&gt; McCrae but instead of wandering around with a tape recorder/any device\n&gt; and then postng up examples for discussion,and thinking thats cutting\n&gt; edge.. he has taken the genre about 20 steps past that.\n&gt; He is one of the few to use faraday cages/blind tests on subject to rule\n&gt; out pareidolia/going to differernt countries and still getting evp in\n&gt; his language..finding commonlaity with evp voices and the voice that\n&gt; some people with some  forms of mental illness &quot;hear&quot;.\n&gt; \n&gt; \n&gt; From his site\n&gt; Science Proves Spirits Exist!Science Proves Spirits Exist! You already\n&gt; knew that?Cool but now no one can argue with you about it.Just\n&gt; point to the EVIDENCE!With the kind permission of the Institute of\n&gt; Noetic Sciences [yes, the people mentioned in Dan Brown&#39;s book!]\n&gt; retired Scottish scientist Alexander MacRae carried out a key experiment\n&gt; at their laboratory in California.Read the evidence in The Portal \n&gt; Part One &lt;http://stores.lulu.com/evp &gt;  .\n&gt; From the cricket noises no one is doing reel to reel work anymore here\n&gt; like Sarah Estep.\n&gt; Fair enough.. [:D]\n&gt;"}