{"id": "2161", "subject": "Re: [EVP-ITC] Amazing.", "author": "Lisby", "timestamp": "2007-09-20T19:49:02Z", "full_text": "Frank, dearest (I typed &quot;deadrest&quot; first), I was about to ask you  \nwhat you are up to with the TV sweep because I was away for a month  \nand have obviously got a lot to catch up on.  So, please tell me what  \nyou&#39;re doing with this. Please show me the pictures you mention, too,  \nbecause otherwise I can&#39;t tell you if they&#39;re a sitcom, not the Other  \nSide.\n\n;)\n\nAnn\n\nOn Sep 20, 2007, at 9:43 AM, Frank Sumption wrote:\n\n&gt;\n&gt;  The same old shiesola. Post stuff that should draw comments and  \n&gt; discussions, like the pictures posted last night, but no, the  \n&gt; discussion is on how dishonest some pro psyhic is, and how foolish  \n&gt; I am to watch her on Montel&#39;s show.\n&gt;\n&gt;  I did a second test with the larger TV, and got images that were  \n&gt; like full size, some larger than the screen, they look like  \n&gt; portraits, but now I think the group in not the place present them.  \n&gt; Most would prefer to discuss some trivial POS, or some whispery  \n&gt; noise that just has to be a voice if it can just be filtered  \n&gt; enough! Y&#39;all wonder why I get fed up and quit the damn group! God  \n&gt; Almighty!!\n&gt;\n&gt;\n&gt; Frank-S\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; More photos; more messages; more whatever – Get MORE with Windows  \n&gt; Live™ Hotmail®. NOW with 5GB storage. Get more!\n&gt;\n&gt; \n\n\nF ank, dea es (I yped \"dead es \" i s ), I was abou o ask you wha you a e up o wi h he TV sweep because I was away o a mon h and ha e ob iously go a lo o ca ch up on.  So, please ell me wha you' e doing wi h his. Please show me he pic u es you men ion, oo, because o he wise I can' ell you i hey' e a si com, no he O he Side.;)AnnOn Sep 20, 2007, a 9:43 AM, F ank Sump ion w o e: The same old shiesola. Pos s u ha should d aw commen s and discussions, like he pic u es pos ed las nigh , bu no, he discussion is on how dishones some p o psyhic is, and how oolish I am o wa ch he on Mon el's show.   I did a second es wi h he la ge TV, and go images ha we e like ull size, some la ge han he sc een, hey look like po ai s, bu now I hink he g oup in no he place p esen hem. Mos would p e e o discuss some i ial POS, o some whispe y noise ha jus has o be a oice i i can jus be il e ed enough! Y'all wonde why I ge ed up and qui he damn g oup! God Almigh y!!  F ank-S Mo e pho os; mo e messages; mo e wha e e – Ge MORE wi h Windows Li e™ Ho mail®. NOW wi h 5GB s o age. Ge mo e!"}