{"id": "21620", "subject": "Re: Greetings From Australia", "author": "purplespacefriend", "timestamp": "2011-06-12T07:02:31Z", "full_text": "Ok, after backing up, and searching posts from days ago.....I don&#39;t want to offend anyone with different ideas. \n\n Yeah, I try various methods from time to time, I prefer methods that provide a form of raw audio,sound that has elements of human speech. Suych as the Ghost boxes, a radio tuned between stations, crowd noise, and EVPmaker. I know what the critics say--imagination, aka matrixing, and they are pretty much wrong. I&#39;ve been doing this stuff for more than tens years, and I get enough that others can hear to show there is alot going on. It&#39;s not just some half alive zombie ghost trying to talk, these entities tend to be more aware and more alive than any of us, and ever present as I&#39;m testing/recording. \n\n Maybe you are asking if anyone uses reel to reel recorders? Probably won&#39;t find one the works, but I prefer cassette tape, but also use digital recorders and the video function of the cell phone. \n\n There seems to be a connection between EVP and solar activity, just as with radio, there seems to be propagation effects with EVP, especially while uisng &quot;raw audio&quot; based methods, and communications are beginning to pick up with increased solar activity. Extra class ham operator BTW.\n\n There has been advancements, and I think you need to do afew more web searches, and reading before you say no one is doing anything of value.\n\n F-S \n\n--- In EVP-ITC@yahoogroups.com, &quot;ozestrangeufo&quot; &lt;ozestrangeufo@...&gt; wrote:\n&gt;\n&gt; Hi\n&gt; Great group you have here..so many posts..I have been on the fringe of\n&gt; evp off and on for years and decided to get into it again.I purchased\n&gt; &quot;voices of eternity &quot; by Sarah Estep.Great book.I really like the\n&gt; quality of the evp that Sarah used to get on her reel to reel and was\n&gt; wondering if anyone still uses that technology for evp work.\n&gt; thanks\n&gt; Mike\n&gt;"}