{"id": "2162", "subject": "Re: [EVP-ITC] Re: EVP Experiment planned in October.", "author": "Lisby", "timestamp": "2007-09-20T20:02:11Z", "full_text": "On Sep 20, 2007, at 8:51 AM, Frank Ratka wrote:\n\n&gt;\n&gt; The researcher is always part of the equation. The spirit is not  \n&gt; talking to the recorder! I record EVP and DRV everyday, with great  \n&gt; results. I have been recording with a ITC group since March which  \n&gt; seems to have &quot;boosted&quot; the clarity of the messages we get.  \n&gt; Resonance is the key!\n\nYou had me at &quot;part of the equation.&quot; You&#39;re right: resonance is the  \nkey, indeed, HMO.\n\n&gt;\n&gt; If you look at people who get consistent results everytime you will  \n&gt; find that they are connected to something greater than themselves.  \n&gt; They are usually even tempered with very little extreme emotions.  \n&gt; Their interests do not lie in the mechanism of communication so  \n&gt; much or gathering evidence to prove or disprove a theory. They are  \n&gt; interested in the message and the connection we have with the  \n&gt; spirits we all have around us. Its how our own spirit (who we  \n&gt; really are) connects with the ones we are speaking with.\n&gt; Everyone has heard the term, &quot;like attracts like&quot;. This is a crude  \n&gt; basis for resonance! Your spiritual progress or rate of vibration  \n&gt; determines what kind of etherial crowd you will attract and hang  \n&gt; out with. A lot of the viewpoints of investigators comes from the  \n&gt; belief that we are primarily physical beings. This is an automatic  \n&gt; belief because of the conditioning and programming we have received  \n&gt; by our societies all our lives. What the spirits have been telling  \n&gt; us for thousands of years in scriptures, spiritual teachings,  \n&gt; inspired philosophy and so on is that we are primarily spiritual  \n&gt; beings. We are the &quot;ghost in the machine&quot;, not the machine.\n\nThis is what I wanted to say, too, but you said it much more  \ncoherently than I could have. Personal, aside, when I try to  \ncommunicate with the Other Side, by any number of means, mediumistic  \nor mechanical, I always begin by envisioning myself either picking up  \na phone with the cord running way up into a star-filled sky, or I  \nimagine that I am a radio and I am tuning myself higher up the band.  \nI&#39;ve done this since I was a little kid.\n\n&gt;\n&gt; Now, I know many of you who actually take the time to read all this  \n&gt; will try to write these words off as some kind of personal belief  \n&gt; of mine or a unsupported philosophy. In fact everything I have just  \n&gt; stated is supported by 30 years of messages received from the 70&#39;s  \n&gt; to the present through ITC contacts all over the world.\n&gt;\n&gt; So to validate your belief Bill, yes it very much depends on the  \n&gt; person who is recording the EVP! ;)\n&gt;\n\nIt&#39;s also increasingly supported by quantum physics.\n\nAnn"}