{"id": "21645", "subject": "Re: [EVP-ITC] Re: ITC Probe", "author": "Michelle Brown", "timestamp": "2011-06-12T19:53:28Z", "full_text": "Hi...this is Michelle, Andy&#39;s partner. I dont always participate in conversations here, mainly due to time constraints, but since my name got pulled into the discussion...thought I&#39;d weigh in! :)\n\nI&#39;m glad April&#39;s discussion went well. We have enjoyed working with her and getting to know her.\n\nThank you Adrienne for your support on the sea lion case. It has been an amazing and beautiful experience.\n\n Just want to clarify a fact about the money that goes into  our research. Everything we do is funded 100% by us alone. We take no money from events, ticket sales, sales of any kind, money from any outside sources. When we do speaking engagements we waive fees or ask that it is donated to charity. We have no need for it and are concerned only with learning, finding answers to big questions, furthering everyone&#39;s ability to learn & understand...and hope that along the way some of the answers we are finding can be keys that unlock new doors and are missing pieces of puzzles we can all use to change or fix things that need it & further our understanding of our universe. \n\nIf you see us at an event-its because we want to share something new we&#39;ve learned and be available publically to answer questions in person. Most of what we are doing right now, in this early stage, requires one on one, face to face conversations I believe. And we really enjoy the challenge of interactive question & answer communication about our work.\n\nApril is one of the paranormal investigators and ITC researchers we have testing equipment for us, and yes there are others, as well as scientists in other labs in controlled settings as we are collecting data to publish results. \n\nThe device we are focusing  on right now outside of the ITC probe is one that Andy developed  based on probe results which derived from a paranormal investigation involving an autistic child that was noncommunicative. What happened that night gave him an idea about how to reach other autustic children like this one. Its basically the probe reverse engineered. It has been approved for and currently in an official &quot;trial&quot; being used by select schools where teachers & families are using it with fantastic success to communicate ...and is based on electromagnetic signals.\n\nOn a side note.....that device is unexpectedly working for us in the field in paranormal experiments, in much the same way that the ITC probe is, we now know. We&#39;ve been taking it out over the last few weeks and excited that its allowing people to hear and converse in much the same way as the probe....only I believe much easier and much more clearly.\n\nThese devices are in the very, very early stages of development and we havent thrown a great deal of information or recordings out there yet since we are still in gathering data mode, trying to answer some specific questions of our own and hoping to publish what we&#39;ve discovered in as responsible a way as possible. \n\nWe are gathering a pretty strong support group in the scientific community, which is tough given the subject matter, but the results some guys are seeing and experiencing themselves is creating quite a wave rumbling through the community. The people backing us up and supporting us are a really cool preview of what is to come and we are stoked. There will always be a few outraged chest beaters who wont like what is happening, but it will be very difficult for them to argue with the math and the data.\n\nWe both have one foot firmly planted in the science world and one foot in the paranormal world.  Im intrigued to see how this plays out in conversations once we publish and go public. Should be awesome....could get ugly. lol One other cool sign we got a few weeks ago was a serious request to hold a paranormal physics lecture at MIT. It will be an interesting litmus test. \n\nAnyway....there are a few places you can go to see our work and see a few examples of what we are doing. www.iboldlygo.com and www.youtube.com/diver4skynsea.\n\nYou can email us directly if you have questions too. We get a lot of messages and cant always be incredibly prompt because of that...but do our best. Andy@... or discover@.... \n\nAnd if you live in california or are visiting and want to meet up to talk or see what we do let us know.\n\nTake care,\nMichelle\n\nSent from Android\n\nAdrienne &lt;abortree@...&gt; wrote:\n\n&gt;Hi,\n&gt;\n&gt;Sorry I missed it.  Would like to learn more about why the probe works.  These two seem to be either making headway (and applying it to ie disabled kids experimentally so they can hear and understand better) or possibly a combo of real and hoax.  I get leery when money is involved but understand the need for funding further research and equipment, creating time to do it, and expenses involved in putting together events to share ideas and new technology (and pay for it). It&#39;s a fine line and you really need to be on the inside to know for sure but I think Andy and Michelle are genuine, as well as April Slaughter. Just my opinion. \n&gt;\n&gt;My favorite project with Andy and Michelle is the one involving trying to help the seal that lost one flipper.   \n&gt;\n&gt;Do you know if there area any archives?\n&gt;\n&gt;Thanks for sharing that.\n&gt;\n&gt;Adrienne\n&gt;\n&gt;\n&gt;\n&gt;--- In EVP-ITC@yahoogroups.com, &quot;hypnobarb&quot; &lt;hypnobarb@...&gt; wrote:\n&gt;&gt;\n&gt;&gt; I&#39;ve just finished two days at the American Ghost Society conference where I was blown away by a presentation by April Slaughter on Andy Coppock&#39;s ITC Probe.\n&gt;&gt; \n&gt;&gt; What do you guys know about this?\n&gt;&gt; \n&gt;&gt; She played a good portion of an eleven minute interactive, full sentence conversation that she had with her grandfather who died seven years ago.\n&gt;&gt; \n&gt;&gt; Unless this is a hoax, which I would hope that an MIT graduate and biomedical engineer wouldn&#39;t be part of, this is extraordinary.\n&gt;&gt; \n&gt;&gt; We heard full sentences in the same voice throughout. The words were understandable with intonation coming through.\n&gt;&gt; \n&gt;&gt; I was utterly blown away.  \n&gt;&gt; \n&gt;&gt; Coppock is doing a controlled study with it, using other scientists and a few ghost hunters.\n&gt;&gt;\n&gt;\n&gt;"}