{"id": "21646", "subject": "Re: ITC Probe", "author": "diver4skynsea", "timestamp": "2011-06-12T22:33:13Z", "full_text": "Hi Steve. If you sent it that long ago I can be pretty certain of what happened. One, at that time there were hundreds of other people who started sending probes to him--without actually asking permission--just with letters to please modify them. He would arrive at the lab and a pile of boxes would be by the front door. As if he had tons of spare time and nothing else in the world going on other than to crack them all open and go to work for everyone. He spent a fortune mailing them all back to people. It was ridiculous and difficult to figure out how to deal with at the time. If yours fell through the cracks--I&#39;ll personally make sure I send you the money to cover it myself. I&#39;m certain Andy would be willing to do that as well.\n\nTwo, the results a few years ago were ok but not all that great and based on results each time he used it- would change the device. It would evolve on a daily basis at times. It went through a period of time where modifying it for anyone else was silly because it wasn&#39;t at a point where it was not changing drastically and improving results. We figured at some point when it worked well enough and stopped evolving so rapidly- and we had more answers than questions about what made it work and why-we could teach people to do it themselves.  \n\nSo, yes, he stopped modifying anything for anyone until he was at a place where he had more answers than questions...and that was recently. Having said that, what we use now is in NO WAY anymore what we started using 3 years ago. At all. \n\nWe also realized back then, very quickly, that as the results got better...so did our concerns about what we were hearing when we took it out in the field and the times we&#39;ve taken it in public forums with us to test. Sometimes what happens we don&#39;t expect--most of the time actually--and it has opened so many different cans of worms that it sent us off on a weird direction being worried about letting anyone else have one at all. It felt dangerous. Irresponsible. Made us question whether putting these in the hands of strangers and the public at at large was really the right thing to do. We used to tease, &quot;do you want Osama Bin Laden to have one??&quot; :-) I wont go into all the reasons that sparked concern right now--but would love to explore that topic at another time.\n\nBut we&#39;ve learned a lot more about it now and some of our fears have been calmed. We realize too that so many of us are working toward this technology and ability--its going to happen and be a way of the future no matter what, so why fight it. We have a lot more answers now that we didn&#39;t have then.\n\nAt the point in our research when we could start doing controlled experiments on a good solid version of the technology a group of investigators, scientists and labs were selected to experiment with the technology and log results in a specific format to aid in publishing data properly in scientific journals, etc. That is where we are now.\n\nI apologize, again, that you didn&#39;t have the device modified that you sent. Andy Coppock is one of the kindest, coolest, most down to earth and honest humans I have ever met in my life...and people who know him personally usually agree with me on that. So I can say with certainty that whatever happened with you and your equipment was not done on purpose. Email me your address to discover@... and we&#39;ll replace the funds you lost. \n\nM\n\n--- In EVP-ITC@yahoogroups.com, &quot;Urkel23&quot; &lt;urkel23@...&gt; wrote:\n&gt;\n&gt; \n&gt; I shipped Andy an ITC probe 3 years ago to modify for me, after he agreed to do it.\n&gt; \n&gt; I&#39;m still waiting for it back.  I already figured that he stole it and i&#39;m out $80.  You probably saw mine the other day that he took from me!\n&gt; \n&gt; I made my own version last year after a friend figured out what andy did for the modification.  Been using it for a year and haven&#39;t heard anything yet.\n&gt; \n&gt; I had high hopes for this, but i fear it is just another hoax.  Check and see if it has worked for anybody else but Andy, then maybe i will re-consider that he isn&#39;t faking his results.\n&gt; \n&gt; -Steve H.\n&gt; \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;hypnobarb&quot; &lt;hypnobarb@&gt; wrote:\n&gt; &gt;\n&gt; &gt; I&#39;ve just finished two days at the American Ghost Society conference where I was blown away by a presentation by April Slaughter on Andy Coppock&#39;s ITC Probe.\n&gt; &gt; \n&gt; &gt; What do you guys know about this?\n&gt; &gt; \n&gt; &gt; She played a good portion of an eleven minute interactive, full sentence conversation that she had with her grandfather who died seven years ago.\n&gt; &gt; \n&gt; &gt; Unless this is a hoax, which I would hope that an MIT graduate and biomedical engineer wouldn&#39;t be part of, this is extraordinary.\n&gt; &gt; \n&gt; &gt; We heard full sentences in the same voice throughout. The words were understandable with intonation coming through.\n&gt; &gt; \n&gt; &gt; I was utterly blown away.  \n&gt; &gt; \n&gt; &gt; Coppock is doing a controlled study with it, using other scientists and a few ghost hunters.\n&gt; &gt;\n&gt;"}