{"id": "21654", "subject": "Re: [EVP-ITC] Re: ITC Probe", "author": "Ursula Kalin", "timestamp": "2011-06-13T12:32:52Z", "full_text": "--0-1957425319-1307968372=:79534\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nthis is truly amazing! wow\n\n--- On Sun, 6/12/11, diver4skynsea &lt;diver4skyns=\r\nea@...&gt; wrote:\n\nFrom: diver4skynsea &lt;diver4skynsea@...&gt;\nSubject: [E=\r\nVP-ITC] Re: ITC Probe\nTo: EVP-ITC@yahoogroups.com\nDate: Sunday, June 12, 20=\r\n11, 4:28 PM\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n=C2=A0\n\n\n\n  \n\n\n    \n      \n      \n      \n\n\n\nHi=\r\n...this is Michelle, Andy&#39;s partner. I dont always participate in conversat=\r\nions here, mainly due to time constraints, but since my name got pulled int=\r\no the discussion...thought I&#39;d weigh in! :)\n\n\n\nI&#39;m glad April&#39;s discussion =\r\nwent well. We have enjoyed working with her and getting to know her. \n\n\n\nTh=\r\nank you Adrienne for your support on the sea lion case. It has been an amaz=\r\ning and beautiful experience.\n\n\n\nJust want to clarify a fact about the mone=\r\ny that goes into our research. Everything we do is funded 100% by us alone.=\r\n We take no money from events, ticket sales, sales of any kind, money from =\r\nany outside sources. When we do speaking engagements we waive fees or ask t=\r\nhat it is donated to charity. We have no need for it and are concerned only=\r\n with learning, finding answers to big questions, furthering everyone&#39;s abi=\r\nlity to learn & understand...and hope that along the way some of the answer=\r\ns we are finding can be keys that unlock new doors and are missing pieces o=\r\nf puzzles we can all use to change or fix things that need it & further our=\r\n understanding of our universe. \n\n\n\nIf you see us at an event-its because w=\r\ne want to share something new we&#39;ve learned and be available publically to =\r\nanswer questions in person. Most of what we are doing right now, in this ea=\r\nrly stage, requires one on one, face to face conversations I believe. And w=\r\ne really enjoy the challenge of interactive question & answer communication=\r\n about our work.\n\n\n\nApril is one of the paranormal investigators and ITC re=\r\nsearchers we have testing equipment for us, and yes there are others, as we=\r\nll as scientists in other labs in controlled settings as we are collecting =\r\ndata to publish results. \n\n\n\nThe device we are focusing on right now outsid=\r\ne of the ITC probe is one that Andy developed based on probe results which =\r\nderived from a paranormal investigation involving an autistic child that wa=\r\ns noncommunicative. What happened that night gave him an idea about how to =\r\nreach other autustic children like this one. Its basically the probe revers=\r\ne engineered. It has been approved for and currently in an official &quot;trial&quot;=\r\n being used by select schools where teachers & families are using it with f=\r\nantastic success to communicate ...and is based on electromagnetic signals.=\r\n\n\n\n\nOn a side note.....that device is unexpectedly working for us in the fi=\r\neld in paranormal experiments, in much the same way that the ITC probe is, =\r\nwe now know. We&#39;ve been taking it out over the last few weeks and excited t=\r\nhat its allowing people to hear and converse in much the same way as the pr=\r\nobe....only I believe much easier and much more clearly.\n\n\n\nThese devices a=\r\nre in the very, very early stages of development and we havent thrown a gre=\r\nat deal of information or recordings out there yet since we are still in ga=\r\nthering data mode, trying to answer some specific questions of our own and =\r\nhoping to publish what we&#39;ve discovered in as responsible a way as possible=\r\n. \n\n\n\nWe are gathering a pretty strong support group in the scientific comm=\r\nunity, which is tough given the subject matter, but the results some guys a=\r\nre seeing and experiencing themselves is creating quite a wave rumbling thr=\r\nough the community. The people backing us up and supporting us are a really=\r\n cool preview of what is to come and we are stoked. There will always be a =\r\nfew outraged chest beaters who wont like what is happening, but it will be =\r\nvery difficult for them to argue with the math and the data.\n\n\n\nWe both hav=\r\ne one foot firmly planted in the science world and one foot in the paranorm=\r\nal world. Im intrigued to see how this plays out in conversations once we p=\r\nublish and go public. Should be awesome....could get ugly. lol One other co=\r\nol sign we got a few weeks ago was a serious request to hold a paranormal p=\r\nhysics lecture at MIT. It will be an interesting litmus test. \n\n\n\nAnyway...=\r\n.there are a few places you can go to see our work and see a few examples o=\r\nf what we are doing. www.iboldlygo.com and www.youtube.com/diver4skynsea.\n\n=\r\n\n\nYou can email us directly if you have questions too. We get a lot of mess=\r\nages and cant always be incredibly prompt because of that...but do our best=\r\n. Andy@... or discover@.... \n\n\n\nAnd if you live in californ=\r\nia or are visiting and want to meet up to talk or see what we do let us kno=\r\nw.\n\n\n\nTake care,\n\nMichelle--- In EVP-ITC@yahoogroups.com, \n\n\n\n&gt; --- In EVP-=\r\nITC@yahoogroups.com, &quot;hypnobarb&quot; &lt;hypnobarb@&gt; wrote:\n\n&gt; &gt;\n\n&gt; &gt; I&#39;ve just fi=\r\nnished two days at the American Ghost Society conference where I was blown =\r\naway by a presentation by April Slaughter on Andy Coppock&#39;s ITC Probe.\n\n&gt; &gt;=\r\n \n\n&gt; &gt; What do you guys know about this?\n\n&gt; &gt; \n\n&gt; &gt; She played a good porti=\r\non of an eleven minute interactive, full sentence conversation that she had=\r\n with her grandfather who died seven years ago.\n\n&gt; &gt; \n\n&gt; &gt; Unless this is a=\r\n hoax, which I would hope that an MIT graduate and biomedical engineer woul=\r\ndn&#39;t be part of, this is extraordinary.\n\n&gt; &gt; \n\n&gt; &gt; We heard full sentences =\r\nin the same voice throughout. The words were understandable with intonation=\r\n coming through.\n\n&gt; &gt; \n\n&gt; &gt; I was utterly blown away.  \n\n&gt; &gt; \n\n&gt; &gt; Coppock =\r\nis doing a controlled study with it, using other scientists and a few ghost=\r\n hunters.\n\n&gt; &gt;\n\n&gt;\n\n\n\n\n\n    \n     \n\n    \n    \n\n\n \n\n\n\n  \n\n\n\n\n\n\n\n\n\r\n--0-1957425319-1307968372=:79534\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;font size=3D&quot;4&quot;&gt;this is truly amazing! wow&lt;/=\r\nfont&gt;&lt;br&gt;&lt;br&gt;--- On &lt;b&gt;Sun, 6/12/11, diver4skynsea &lt;i&gt;&lt;diver4skynsea@mac=\r\n.com&gt;&lt;/i&gt;&lt;/b&gt; wrote:&lt;br&gt;&lt;blockquote style=3D&quot;border-left: 2px solid rgb(=\r\n16, 16, 255); margin-left: 5px; padding-left: 5px;&quot;&gt;&lt;br&gt;From: diver4skynsea=\r\n &lt;diver4skynsea@...&gt;&lt;br&gt;Subject: [EVP-ITC] Re: ITC Probe&lt;br&gt;To: E=\r\nVP-ITC@yahoogroups.com&lt;br&gt;Date: Sunday, June 12, 2011, 4:28 PM&lt;br&gt;&lt;br&gt;&lt;div =\r\nid=3D&quot;yiv62205703&quot;&gt;\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n&lt;span style=3D&quot;display:none;&quot;&gt;&nbsp;&lt;/sp=\r\nan&gt;\n\n\n\n    &lt;div id=3D&quot;yiv62205703ygrp-text&quot;&gt;\n      \n      \n      &lt;p&gt;&lt;br&gt;\n&lt;b=\r\nr&gt;\nHi...this is Michelle, Andy&#39;s partner. I dont always participate in conv=\r\nersations here, mainly due to time constraints, but since my name got pulle=\r\nd into the discussion...thought I&#39;d weigh in! :)&lt;br&gt;\n&lt;br&gt;\nI&#39;m glad April&#39;s =\r\ndiscussion went well. We have enjoyed working with her and getting to know =\r\nher. &lt;br&gt;\n&lt;br&gt;\nThank you Adrienne for your support on the sea lion case. It=\r\n has been an amazing and beautiful experience.&lt;br&gt;\n&lt;br&gt;\nJust want to clarif=\r\ny a fact about the money that goes into our research. Everything we do is f=\r\nunded 100% by us alone. We take no money from events, ticket sales, sales o=\r\nf any kind, money from any outside sources. When we do speaking engagements=\r\n we waive fees or ask that it is donated to charity. We have no need for it=\r\n and are concerned only with learning, finding answers to big questions, fu=\r\nrthering everyone&#39;s ability to learn &amp; understand...and hope that along=\r\n the way some of the answers we are finding can be keys that unlock new doo=\r\nrs and are missing pieces of puzzles we can all use to change or fix things=\r\n that need it &amp; further our understanding of our universe. &lt;br&gt;\n&lt;br&gt;\nIf=\r\n you see us at an event-its because we want to share something new we&#39;ve le=\r\narned and be available publically to answer questions in person. Most of wh=\r\nat we are doing right now, in this early stage, requires one on one, face t=\r\no face conversations I believe. And we really enjoy the challenge of intera=\r\nctive question &amp; answer communication about our work.&lt;br&gt;\n&lt;br&gt;\nApril is=\r\n one of the paranormal investigators and ITC researchers we have testing eq=\r\nuipment for us, and yes there are others, as well as scientists in other la=\r\nbs in controlled settings as we are collecting data to publish results. &lt;br=\r\n&gt;\n&lt;br&gt;\nThe device we are focusing on right now outside of the ITC probe is =\r\none that Andy developed based on probe results which derived from a paranor=\r\nmal investigation involving an autistic child that was noncommunicative. Wh=\r\nat happened that night gave him an idea about how to reach other autustic c=\r\nhildren like this one. Its basically the probe reverse engineered. It has b=\r\neen approved for and currently in an official &quot;trial&quot; being used by select =\r\nschools where teachers &amp; families are using it with fantastic success t=\r\no communicate ...and is based on electromagnetic signals.&lt;br&gt;\n&lt;br&gt;\nOn a sid=\r\ne note.....that device is unexpectedly working for us in the field in paran=\r\normal experiments, in much the same way that the ITC probe is, we now know.=\r\n We&#39;ve been taking it out over the last few weeks and excited that its allo=\r\nwing people to hear and converse in much the same way as the probe....only =\r\nI believe much easier and much more clearly.&lt;br&gt;\n&lt;br&gt;\nThese devices are in =\r\nthe very, very early stages of development and we havent thrown a great dea=\r\nl of information or recordings out there yet since we are still in gatherin=\r\ng data mode, trying to answer some specific questions of our own and hoping=\r\n to publish what we&#39;ve discovered in as responsible a way as possible. &lt;br&gt;=\r\n\n&lt;br&gt;\nWe are gathering a pretty strong support group in the scientific comm=\r\nunity, which is tough given the subject matter, but the results some guys a=\r\nre seeing and experiencing themselves is creating quite a wave rumbling thr=\r\nough the community. The people backing us up and supporting us are a really=\r\n cool preview of what is to come and we are stoked. There will always be a =\r\nfew outraged chest beaters who wont like what is happening, but it will be =\r\nvery difficult for them to argue with the math and the data.&lt;br&gt;\n&lt;br&gt;\nWe bo=\r\nth have one foot firmly planted in the science world and one foot in the pa=\r\nranormal world. Im intrigued to see how this plays out in conversations onc=\r\ne we publish and go public. Should be awesome....could get ugly. lol One ot=\r\nher cool sign we got a few weeks ago was a serious request to hold a parano=\r\nrmal physics lecture at MIT. It will be an interesting litmus test. &lt;br&gt;\n&lt;b=\r\nr&gt;\nAnyway....there are a few places you can go to see our work and see a fe=\r\nw examples of what we are doing. www.iboldlygo.com and www.youtube.com/dive=\r\nr4skynsea.&lt;br&gt;\n&lt;br&gt;\nYou can email us directly if you have questions too. We=\r\n get a lot of messages and cant always be incredibly prompt because of that=\r\n...but do our best. &lt;a rel=3D&quot;nofollow&quot; ymailto=3D&quot;mailto:Andy%40pfmla.com&quot;=\r\n target=3D&quot;_blank&quot; href=3D&quot;/mc/compose?to=3DAndy%40pfmla.com&quot;&gt;Andy@...=\r\nm&lt;/a&gt; or &lt;a rel=3D&quot;nofollow&quot; ymailto=3D&quot;mailto:discover%40iboldlygo.com&quot; ta=\r\nrget=3D&quot;_blank&quot; href=3D&quot;/mc/compose?to=3Ddiscover%40iboldlygo.com&quot;&gt;discover=\r\n@...&lt;/a&gt;. &lt;br&gt;\n&lt;br&gt;\nAnd if you live in california or are visiting=\r\n and want to meet up to talk or see what we do let us know.&lt;br&gt;\n&lt;br&gt;\nTake c=\r\nare,&lt;br&gt;\nMichelle--- In &lt;a rel=3D&quot;nofollow&quot; ymailto=3D&quot;mailto:EVP-ITC%40yah=\r\noogroups.com&quot; target=3D&quot;_blank&quot; href=3D&quot;/mc/compose?to=3DEVP-ITC%40yahoogro=\r\nups.com&quot;&gt;EVP-ITC@yahoogroups.com&lt;/a&gt;, &lt;br&gt;\n&lt;br&gt;\n&gt; --- In &lt;a rel=3D&quot;nofol=\r\nlow&quot; ymailto=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot; target=3D&quot;_blank&quot; href=3D=\r\n&quot;/mc/compose?to=3DEVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups.com&lt;/a&gt;, &quot;=\r\nhypnobarb&quot; &lt;hypnobarb@&gt; wrote:&lt;br&gt;\n&gt; &gt;&lt;br&gt;\n&gt; &gt; I&#39;ve just =\r\nfinished two days at the American Ghost Society conference where I was blow=\r\nn away by a presentation by April Slaughter on Andy Coppock&#39;s ITC Probe.&lt;br=\r\n&gt;\n&gt; &gt; &lt;br&gt;\n&gt; &gt; What do you guys know about this?&lt;br&gt;\n&gt; &gt; =\r\n&lt;br&gt;\n&gt; &gt; She played a good portion of an eleven minute interactive, f=\r\null sentence conversation that she had with her grandfather who died seven =\r\nyears ago.&lt;br&gt;\n&gt; &gt; &lt;br&gt;\n&gt; &gt; Unless this is a hoax, which I woul=\r\nd hope that an MIT graduate and biomedical engineer wouldn&#39;t be part of, th=\r\nis is extraordinary.&lt;br&gt;\n&gt; &gt; &lt;br&gt;\n&gt; &gt; We heard full sentences i=\r\nn the same voice throughout. The words were understandable with intonation =\r\ncoming through.&lt;br&gt;\n&gt; &gt; &lt;br&gt;\n&gt; &gt; I was utterly blown away.  &lt;br=\r\n&gt;\n&gt; &gt; &lt;br&gt;\n&gt; &gt; Coppock is doing a controlled study with it, usi=\r\nng other scientists and a few ghost hunters.&lt;br&gt;\n&gt; &gt;&lt;br&gt;\n&gt;&lt;br&gt;\n&lt;br=\r\n&gt;\n&lt;/p&gt;\n\n    &lt;/div&gt;\n     \n\n\n\n \n\n\n\n\n\n&lt;/div&gt;&lt;/blockquote&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;\r\n--0-1957425319-1307968372=:79534--"}