{"id": "21673", "subject": "Re: Casey files,", "author": "jamietreetalker", "timestamp": "2011-06-14T17:36:14Z", "full_text": "Hey, I was noticing that one-word-at-a-time thing the other day. I think\nyou&#39;re right. Some of them are way better at this than others. It very\nwell could be that the blabbery ones are the lower spirits (or what I\nthink of as the less enlightened ones). The lower ones tend to be\ndeceitful, too, and more malicious, kind of like they&#39;re bitter. I just\nignore them, mostly, but sometimes if they get to mouthy, I just turn it\noff.  If the more enlightened ones have to work around the others, maybe\nthat just forces them to make their messages more clear.\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, SnowfireL@... wrote:\n&gt;\n&gt; Thanks, but I just think Spirit are getting better with talking to us\nthen\n&gt; it use to be when we first started this, now I can even just talk with\none\n&gt; of  them, and they will skip through others with one word at a time\nover the\n&gt; others  talking, which is really cool!  The ones in the lower plains\nreally\n&gt; do need  prayer and encouragement from us to keep them moving in that\n&gt; &quot;long, line of  regrets&quot; as David calls it.sf\n&gt;\n&gt;\n&gt; In a message dated 6/13/2011 1:24:56 P.M. Eastern Daylight Time,\n&gt; thequilldriver@... writes:\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Those are nice recordings, Snow! I can hear most of them very \nclearly.\n&gt;\n&gt; Nice work!\n&gt;\n&gt; --- In _EVP-ITC@yahoogroups.com_ (mailto:EVP-ITC@yahoogroups.com) ,\n&gt; SnowfireL@ wrote:\n&gt; &gt;\n&gt; &gt; Well, I have some info from the peanut  gallery, most is high\npitched\n&gt; so\n&gt; &gt; many of you guys won&#39;t understand  it, signing type angel files, I\n&gt; didn&#39;t want\n&gt; &gt; to believe how a mother  could kill her own child, but it seems she\n&gt; did the\n&gt; &gt; deed. Seems from  what the angels say, the grandma and mom Casey got\n&gt; into a\n&gt; &gt; fight,  Casey was mad so when the parents were gone, she put the\nbaby\n&gt; into\n&gt; &gt;  the truck, and closed the lid, she may have been tied so she \ncouldn&#39;t\n&gt; get\n&gt; &gt; out and or druged. In one of the files, you can hear  Caylee crying\n&gt; for her\n&gt; &gt; mama, she stills asks for her mother, and the  angels are saying,\nthat\n&gt; &gt; &quot;Christ holds the baby&quot; I have lots of files  now, there are but a\n&gt; few. I think\n&gt; &gt; the spirit say, her mother will  &quot;get life.&quot; sf\n&gt; &gt;\n&gt;"}