{"id": "21709", "subject": "David talked about Casey,", "author": "SnowfireL@aol.com", "timestamp": "2011-06-24T04:12:34Z", "full_text": "--part1_35cc2.3e55eebd.3b3568b2_boundary\r\nContent-Type: text/plain; charset=&quot;US-ASCII&quot;\r\nContent-Transfer-Encoding: 7bit\r\n\r\nHe says, &quot;that Casey left Caylee out in the car, and went in the house  \nfalling to sleep, Caylee got out of the car, went in the house, saw mom asleep  \nthen went out into the yard, climbed up the ladder, and got into the pool, \nand  she drown, her mom didn&#39;t wake up for an hour, when she saw Caylee in \nthe pool  she went into a panic, an so started the lies.  She was going to \nmake like  her baby was kidnapped, and all but it really was a terrible  \naccident.&quot;   David says, she was too afraid to tell anyone what really  happened, \nand started the lie, by acting like nothing was wrong, that a baby  sitter \nhad her, and was going to try and make people believe her daughter was  \nkilled by someone, thinking the body would be found sooner.  I didn&#39;t get  all \nabout what the guy did yet though, the meter reader, Kronk.    sf\n\r\n--part1_35cc2.3e55eebd.3b3568b2_boundary\r\nContent-Type: text/html; charset=&quot;US-ASCII&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML 4.0 Transitional//EN&quot;&gt;\n&lt;HTML&gt;&lt;HEAD&gt;=\r\n\n&lt;META content=3D&quot;text/html; charset=3DUS-ASCII&quot; http-equiv=3DContent-Type&gt;=\r\n\n&lt;META name=3DGENERATOR content=3D&quot;MSHTML 8.00.6001.19088&quot;&gt;&lt;/HEAD&gt;\n&lt;BODY st=\r\nyle=3D&quot;FONT-FAMILY: Arial; COLOR: #000000; FONT-SIZE: 10pt&quot; id=3Drole_body =\r\n bottomMargin=3D7 leftMargin=3D7 rightMargin=3D7 topMargin=3D7&gt;&lt;FONT id=3Dr=\r\nole_document  color=3D#000000 size=3D2 face=3DArial&gt;\n&lt;DIV&gt;He says, &quot;that Ca=\r\nsey left Caylee out in the car, and went in the house \nfalling to sleep, Ca=\r\nylee got out of the car, went in the house, saw mom asleep \nthen went out i=\r\nnto the yard, climbed up the ladder, and got into the pool, and \nshe drown,=\r\n her mom didn&#39;t wake up for an hour, when she saw Caylee in the pool \nshe w=\r\nent into a panic, an so started the lies.&nbsp; She was going to make like =\r\n\nher baby was kidnapped, and all but it really was a terrible \naccident.&quot;&n=\r\nbsp;&nbsp; David says, she was too afraid to tell anyone what really \nhappe=\r\nned, and started the lie, by acting like nothing was wrong, that a baby \nsi=\r\ntter had her, and was going to try and make people believe her daughter was=\r\n \nkilled by someone, thinking the body would be found sooner.&nbsp; I didn&#39;=\r\nt get \nall about what the guy did yet though, the meter reader, Kronk. &nbs=\r\np; \nsf&lt;/DIV&gt;&lt;/FONT&gt;&lt;/BODY&gt;&lt;/HTML&gt;\n\r\n--part1_35cc2.3e55eebd.3b3568b2_boundary--"}