{"id": "2172", "subject": "Re: [EVP-ITC] Just a normal image", "author": "Lisby", "timestamp": "2007-09-20T23:28:39Z", "full_text": "When you say connected to cable, what do you mean?\n\nOn Sep 20, 2007, at 4:59 PM, Frank Sumption wrote:\n\n&gt;  Same as the voices I get, with a randomly tuned VCR tuner, removed  \n&gt; from the VCR, and connected to cable. The tuner has line level  \n&gt; video and audio out. I use a monitor to view the video, then  \n&gt; &quot;captue&quot; it with the digital camera in camcorder mode.  As with the  \n&gt; voices, you can&#39;t rule out with 100% certainty that it isn&#39;t  \n&gt; broadcast fragments, but a face surrounded in black!?\n&gt;\n&gt;  These are from last night, at around 6pm.\n&gt;\n&gt;  Frank\n&gt;\n&gt;\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; From: lisby@...\n&gt; Date: Thu, 20 Sep 2007 16:14:16 -0400\n&gt; Subject: Re: [EVP-ITC] Just a normal image\n&gt;\n&gt; Frank--how was this recorded? I can&#39;t comment on the images at all  \n&gt; unless I understand how you&#39;re getting them.\n&gt;\n&gt; Ann\n&gt; It looks really cool, tho&#39;.\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; On Sep 20, 2007, at 2:39 PM, Frank Sumption wrote:\n&gt;\n&gt;  Yeah, a woman with her face so close to the camera that the top of  \n&gt; her head is cut off, and ya can almost see her nose hairs. Probably  \n&gt; see that all the time on MTV.\n&gt;\n&gt;\n&gt; Make your little one a shining star! Shine on!\n&gt;\n&gt; &lt;091907-20Inch-a10.jpg&gt;\n&gt;\n&gt;\n&gt;\n&gt; Kick back and relax with hot games and cool activities at the  \n&gt; Messenger Café. Play now!\n&gt;\n&gt; \n\n\nWhen you say connec ed o cable, wha do you mean?On Sep 20, 2007, a 4:59 PM, F ank Sump ion w o e: Same as he oices I ge , wi h a andomly uned VCR une , emo ed om he VCR, and connec ed o cable. The une has line le el ideo and audio ou . I use a moni o o iew he ideo,  hen \"cap ue\" i wi h he digi al came a in camco de mode.  As wi h he oices, you can' ule ou wi h 100% ce ain y ha i isn' b oadcas agmen s, bu a ace su ounded in black!?  These a e om las nigh , a a ound 6pm.   F ankTo: EVP-ITC@yahoog oups.comF om: lisby@ea hlink.ne Da e: Thu, 20 Sep 2007 16:14:16 -0400Subjec : Re: [EVP-ITC] Jus a no mal imageF ank--how was his eco ded? I can' commen on he images a all unless I unde s and how you' e ge ing hem.AnnI looks eally cool, ho'.On Sep 20, 2007, a 2:39 PM, F ank Sump ion w o e: Yeah, a woman wi h he ace so close o he came a ha he op o he head is cu o , and ya can almos see he nose hai s. P obably see ha all he ime on MTV.Make you li le one a shining s a ! Shine on!a10.jpg>Kick back and elax wi h ho games and cool ac i i ies a he Messenge Ca é. Play now!"}