{"id": "21807", "subject": "True account or not, still, it&#39;s interesting", "author": "SnowfireL@aol.com", "timestamp": "2011-07-27T03:06:24Z", "full_text": "--part1_dec95.48789ccb.3b60dab0_boundary\r\nContent-Type: text/plain; charset=&quot;US-ASCII&quot;\r\nContent-Transfer-Encoding: 7bit\r\n\r\n     \n\nmention.  Here  are a couple of translations, It&#39;s getting harder to find \nthese, Catholic  say it was not a real person, yet Protestant say he was a \nreal writer. So  Enjoy, sf\n \n \n    Publius  Lentulus\n \nAccording to the The Catholic Encyclopedi,  Publius Lentulus is a \nfictitious person, said to have been Governor of  Judea before Pontius, and to have \nwritten the following letter to the  Roman Senate:  \n&quot;Lentulus, the Governor of the Jerusalemites  to the Roman Senate and \nPeople, greetings.  \nThere has appeared in our times, and there  still lives, a man of great \npower (virtue), called Jesus Christ. The  people call him prophet of truth; his \ndisciples, son of God. He raises the  dead, and heals infirmities. He is a \nman of medium size (statura  procerus, mediocris et spectabilis); tall in \nstature.  He has a  venerable aspect, and his beholders can both fear and love \nhim. His hair  is of the colour of the ripe hazel-nut, straight down to the \nears, but  below the ears wavy and curled, with a bluish and bright \nreflection,  flowing over his shoulders. It is parted in two on the top of the \nhead,  after the pattern of the Nazarenes. His brow is smooth and vary cheerful  \nwith a face without wrinkle or spot, embellished by a slightly reddish  \ncomplexion. His nose and mouth are faultless. His beard is abundant, of  the \ncolour of his hair, not long, but divided at the chin. His aspect is  simple \nand mature, his eyes are changeable and bright. He is terrible in  his \nreprimands, sweet and amiable in his admonitions, cheerful without  loss of \ngravity. He was never known to laugh, but often to weep. His  stature is straight, \nhis hands and arms beautiful to behold. His  conversation is grave, \ninfrequent, and modest. He is the most beautiful  among the children of men.&quot; \nDifferent manuscripts vary from the foregoing  text in several details: \nDobschutz (&quot;Christusbilder&quot;, Leipzig, 1899)  enumerates the manuscripts and \ngives an &quot;apparatus criticus&quot; . The letter  was first printed in the &quot;Life of \nChrist&quot; by Ludolph the Carthusian  (Cologne, 1474), and in the &quot;Introduction \nto the works of St. Anselm&quot;  (Nuremberg, 1491). But it is neither the work \nof St. Anselm nor of  Ludolph. According to the manuscript of Jena, a certain \nGiacomo Colonna  found the letter in 1421 in an ancient Roman document sent \nto Rome from  Constantinople. It must be of Greek origin, and translated \ninto Latin  during the thirteenth or fourteenth century, though it received \nits  present form at the hands of humanist of the fifteenth or sixteenth  \ncentury. The description agrees with the so-called Abgar picture of our  Lord; \nit also agrees with the portrait of Jesus Christ drawn by  Nicephorus, St. \nJohn Damascene, and the Book of Painters (of Mt. Athos).  Munter (&quot;Die \nSinnbilder und Kunstvorstellungen der alten Christen&quot;, Altona  1825, p. 9) believes \nhe can trace the letter down to the time of  Diocletian; but this is not \ngenerally admitted. The letter of Lentulus is  certainly apocryphal: there \nnever was a Governor of Jerusalem; no  Procurator of Judea is known to have \nbeen called Lentulus, a Roman  governor would not have addressed the Senate, \nbut the emperor, a Roman  writer would not have employed the expressions, \n&quot;prophet of truth&quot;, &quot;sons  of men&quot;, &quot;Jesus Christ&quot;. The former two are Hebrew \nidioms, the third is  taken from the New Testament. The letter, therefore, \nshows us a  description of our Lord such as Christian piety conceived him.  \nIs the Letter for Publius Lentulus describing Christ  legitimate?\nBy John Baskette\nThe following is a translation of a two-page handwritten document I  came \nacross Wed 5. Jan. 1994.  \nLetter from First Consul Publius Lentuleis(?) to Caesar Tiberius  (reg. 14 \n- 37 AD). The letter is partly an answer to a direct question  from the \nCaesar.  \n\nThere lives at this time in  Judea a man of singular virtue whose name is \nJesus Christ, whom the  barbarians esteem as a prophet, but his followers \nlove and adore him as  the offspring of the immortal God.  \nHe calls back the dead from the graves  and heals all sorts of diseases \nwith a word or touch. He is a tall man,  well-shaped, and of an amiable and \nreverend aspect; his hair of a color  that can hardly be matched, falling into \ngraceful curls, waving about  and very agreeable crouching upon his \nshoulders, parted on the crown of  the head, running as a stream to the front after \nfashion of the  Nazarites. His forehead high, large and imposing; his cheeks \nwithout  spot or wrinkle, beautiful with a lovely red; his nose and mouth \nformed  with exquisite symmetry; his beard, and of a color suitable to his \nhair,  reaching below his chin and parted in the middle like a fork; his eyes  \nbright blue, clear and serene. Look innocent, dignified, manly and  mature. \nIn proportion of body most perfect, and captivating; his arms  and hands \ndelectable to behold.  \nHe rebukes with majesty, councils with  mildness, His whole address whether \nin word or deed, being eloquent and  grave. No man has seen him laugh, yet \nhis manners are exceedingly  pleasant, but he has wept frequently in the \npresence of men. He is  temperate, modest and wise. A man for his extraordinary \nbeauty and  perfection, surpassing the children of men in every sense.   \n\n\r\n--part1_dec95.48789ccb.3b60dab0_boundary\r\nContent-Type: text/html; charset=&quot;US-ASCII&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML 4.0 Transitional//EN&quot;&gt;\n&lt;HTML&gt;&lt;HEAD&gt;=\r\n\n&lt;META http-equiv=3DContent-Type content=3D&quot;text/html; charset=3DUS-ASCII&quot;&gt;=\r\n\n&lt;META content=3D&quot;MSHTML 6.00.6000.17098&quot; name=3DGENERATOR&gt;&lt;/HEAD&gt;\n&lt;BODY id=\r\n=3Drole_body style=3D&quot;FONT-SIZE: 10pt; COLOR: #000000; FONT-FAMILY: Arial&quot; =\r\n bottomMargin=3D7 leftMargin=3D7 topMargin=3D7 rightMargin=3D7&gt;&lt;FONT id=3Dr=\r\nole_document  face=3DArial color=3D#000000 size=3D2&gt;\n&lt;DIV&gt;\n&lt;TABLE cellSpaci=\r\nng=3D0 cellPadding=3D0 width=3D&quot;80%&quot; border=3D0&gt;\n  &lt;TBODY&gt;\n  &lt;TR&gt;\n    &lt;TD w=\r\nidth=3D&quot;100%&quot;&gt;\n      &lt;DIV align=3Dcenter&gt;&lt;FONT size=3D2&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;=\r\n\n      &lt;DIV align=3Dcenter&gt;&lt;FONT color=3D#0000ff size=3D2&gt;&lt;STRONG&gt;mention.&=\r\nnbsp; Here \n      are a couple of translations, It&#39;s getting harder to find=\r\n these, Catholic \n      say it was not a real person, yet Protestant say he=\r\n was a real writer. So \n      Enjoy, sf&lt;/STRONG&gt;&lt;/FONT&gt;&lt;/DIV&gt;\n      &lt;DIV al=\r\nign=3Dcenter&gt;&nbsp;&lt;/DIV&gt;\n      &lt;DIV align=3Dcenter&gt;&nbsp;&lt;/DIV&gt;\n      &lt;DIV=\r\n align=3Dcenter&gt;\n      &lt;TABLE cellSpacing=3D0 cellPadding=3D0 border=3D0&gt;\n =\r\n       &lt;TBODY&gt;\n        &lt;TR&gt;\n          &lt;TD&gt;&lt;B&gt;&lt;FONT face=3DArial size=3D5&gt;Pu=\r\nblius \n        Lentulus&lt;/FONT&gt;&lt;/B&gt;&lt;/TD&gt;&lt;/TR&gt;&lt;/TBODY&gt;&lt;/TABLE&gt;&lt;/DIV&gt;\n      &lt;D=\r\nIV align=3Dcenter&gt;&lt;FONT size=3D2&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n      &lt;P&gt;&lt;FONT face=3D=\r\nArial size=3D3&gt;According to the The Catholic Encyclopedi, \n      Publius Le=\r\nntulus is a fictitious person, said to have been Governor of \n      Judea b=\r\nefore Pontius, and to have written the following letter to the \n      Roman=\r\n Senate: &lt;/FONT&gt;\n      &lt;P&gt;&lt;FONT face=3DArial size=3D3&gt;&lt;B&gt;&quot;Lentulus, the Gov=\r\nernor of the Jerusalemites \n      to the Roman Senate and People, greetings=\r\n. &lt;/B&gt;&lt;/FONT&gt;&lt;/P&gt;\n      &lt;P&gt;&lt;FONT face=3DArial size=3D3&gt;&lt;B&gt;There has appeare=\r\nd in our times, and there \n      still lives, a man of great power (virtue)=\r\n, called Jesus Christ. The \n      people call him prophet of truth; his dis=\r\nciples, son of God. He raises the \n      dead, and heals infirmities. He is=\r\n a man of medium size (&lt;I&gt;statura \n      procerus, mediocris et spectabilis=\r\n&lt;/I&gt;); tall in stature.&nbsp; He has a \n      venerable aspect, and his beh=\r\nolders can both fear and love him. His hair \n      is of the colour of the =\r\nripe hazel-nut, straight down to the ears, but \n      below the ears wavy a=\r\nnd curled, with a bluish and bright reflection, \n      flowing over his sho=\r\nulders. It is parted in two on the top of the head, \n      after the patter=\r\nn of the Nazarenes. His brow is smooth and vary cheerful \n      with a face=\r\n without wrinkle or spot, embellished by a slightly reddish \n      complexi=\r\non. His nose and mouth are faultless. His beard is abundant, of \n      the =\r\ncolour of his hair, not long, but divided at the chin. His aspect is \n     =\r\n simple and mature, his eyes are changeable and bright. He is terrible in \n=\r\n      his reprimands, sweet and amiable in his admonitions, cheerful withou=\r\nt \n      loss of gravity. He was never known to laugh, but often to weep. H=\r\nis \n      stature is straight, his hands and arms beautiful to behold. His =\r\n\n      conversation is grave, infrequent, and modest. He is the most beauti=\r\nful \n      among the children of men.&quot;&lt;/B&gt;&lt;/FONT&gt;&lt;/P&gt;\n      &lt;P&gt;&lt;FONT face=\r\n=3DArial size=3D3&gt;Different manuscripts vary from the foregoing \n      text=\r\n in several details: Dobschutz (&quot;Christusbilder&quot;, Leipzig, 1899) \n      enu=\r\nmerates the manuscripts and gives an &quot;apparatus criticus&quot; . The letter \n   =\r\n   was first printed in the &quot;Life of Christ&quot; by Ludolph the Carthusian \n   =\r\n   (Cologne, 1474), and in the &quot;Introduction to the works of St. Anselm&quot; \n =\r\n     (Nuremberg, 1491). But it is neither the work of St. Anselm nor of \n  =\r\n    Ludolph. According to the manuscript of Jena, a certain Giacomo Colonna=\r\n \n      found the letter in 1421 in an ancient Roman document sent to Rome =\r\nfrom \n      Constantinople. It must be of Greek origin, and translated into=\r\n Latin \n      during the thirteenth or fourteenth century, though it receiv=\r\ned its \n      present form at the hands of humanist of the fifteenth or six=\r\nteenth \n      century. The description agrees with the so-called Abgar pict=\r\nure of our \n      Lord; it also agrees with the portrait of Jesus Christ dr=\r\nawn by \n      Nicephorus, St. John Damascene, and the Book of Painters (of =\r\nMt. Athos). \n      Munter (&quot;Die Sinnbilder und Kunstvorstellungen der alten=\r\n Christen&quot;, Altona \n      1825, p. 9) believes he can trace the letter down=\r\n to the time of \n      Diocletian; but this is not generally admitted. The =\r\nletter of Lentulus is \n      certainly apocryphal: there never was a Govern=\r\nor of Jerusalem; no \n      Procurator of Judea is known to have been called=\r\n Lentulus, a Roman \n      governor would not have addressed the Senate, but=\r\n the emperor, a Roman \n      writer would not have employed the expressions=\r\n, &quot;prophet of truth&quot;, &quot;sons \n      of men&quot;, &quot;Jesus Christ&quot;. The former two =\r\nare Hebrew idioms, the third is \n      taken from the New Testament. The le=\r\ntter, therefore, shows us a \n      description of our Lord such as Christia=\r\nn piety conceived him.&lt;/FONT&gt;&lt;/P&gt;\n      &lt;CENTER&gt;\n      &lt;H3&gt;&lt;A name=3Dtop&gt;Is=\r\n the Letter for Publius Lentulus describing Christ \n      legitimate?&lt;/A&gt;&lt;/=\r\nH3&gt;\n      &lt;H5&gt;By John Baskette&lt;/H5&gt;&lt;/CENTER&gt;\n      &lt;P&gt;&lt;I&gt;The following is a=\r\n translation of a two-page handwritten document I \n      came across Wed 5.=\r\n Jan. 1994.&lt;/I&gt; &lt;/P&gt;\n      &lt;P&gt;&lt;I&gt;Letter from First Consul Publius Lentuleis=\r\n(?) to Caesar Tiberius \n      (reg. 14 - 37 AD). The letter is partly an an=\r\nswer to a direct question \n      from the Caesar.&lt;/I&gt; \n      &lt;P&gt;\n      &lt;BLO=\r\nCKQUOTE&gt;&lt;STRONG&gt;&lt;FONT color=3D#0000ff&gt;There lives at this time in \n        =\r\nJudea a man of singular virtue whose name is Jesus Christ, whom the \n      =\r\n  barbarians esteem as a prophet, but his followers love and adore him as \n=\r\n        the offspring of the immortal God. &lt;/FONT&gt;&lt;/STRONG&gt;\n        &lt;P&gt;&lt;STR=\r\nONG&gt;&lt;FONT color=3D#0000ff&gt;He calls back the dead from the graves \n        a=\r\nnd heals all sorts of diseases with a word or touch. He is a tall man, \n   =\r\n     well-shaped, and of an amiable and reverend aspect; his hair of a colo=\r\nr \n        that can hardly be matched, falling into graceful curls, waving =\r\nabout \n        and very agreeable crouching upon his shoulders, parted on t=\r\nhe crown of \n        the head, running as a stream to the front after fashi=\r\non of the \n        Nazarites. His forehead high, large and imposing; his ch=\r\neeks without \n        spot or wrinkle, beautiful with a lovely red; his nos=\r\ne and mouth formed \n        with exquisite symmetry; his beard, and of a co=\r\nlor suitable to his hair, \n        reaching below his chin and parted in th=\r\ne middle like a fork; his eyes \n        bright blue, clear and serene. Look=\r\n innocent, dignified, manly and \n        mature. In proportion of body most=\r\n perfect, and captivating; his arms \n        and hands delectable to behold=\r\n. &lt;/FONT&gt;&lt;/STRONG&gt;\n        &lt;P&gt;&lt;STRONG&gt;&lt;FONT color=3D#0000ff&gt;He rebukes with=\r\n majesty, councils with \n        mildness, His whole address whether in wor=\r\nd or deed, being eloquent and \n        grave. No man has seen him laugh, ye=\r\nt his manners are exceedingly \n        pleasant, but he has wept frequently=\r\n in the presence of men. He is \n        temperate, modest and wise. A man f=\r\nor his extraordinary beauty and \n        perfection, surpassing the childre=\r\nn of men in every sense. \n        &lt;/FONT&gt;&lt;/STRONG&gt;\n        &lt;P&gt;&lt;FONT  size=\r\n=3D2&gt;&lt;/FONT&gt;&lt;/P&gt;&lt;/BLOCKQUOTE&gt;&lt;/TD&gt;&lt;/TR&gt;&lt;/TBODY&gt;&lt;/TABLE&gt;&lt;/DIV&gt;&lt;/FONT&gt;&lt;/BODY&gt;=\r\n&lt;/HTML&gt;\n\r\n--part1_dec95.48789ccb.3b60dab0_boundary--"}