{"id": "21808", "subject": "Here&#39;s a cool one too,", "author": "SnowfireL@aol.com", "timestamp": "2011-07-27T03:49:54Z", "full_text": "--part1_dfc93.37098b71.3b60e4e2_boundary\r\nContent-Type: text/plain; charset=&quot;UTF-8&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\nContent-Language: en\r\n\r\n \nTo: JFK_Lib\n \nThe letter from Pontius Pilate to Tiberius Caesar\nThis is a=\r\n  reprinting of a letter from Pontius Pilate to Tiberius Caesar \ndescribing=\r\n the  physical appearance of Jesus. Copies are in the Congressional \nLibrar=\r\ny in  Washington, D.C. \nTO TIBERIUS CAESAR:\nA young man appeared in Galilee=\r\n preaching with  humble unction, a new law \nin the Name of the God that had=\r\n sent Him. At first I  was apprehensive that \nHis design was to stir up the=\r\n people against the Romans,  but my fears were \nsoon dispelled. Jesus of Na=\r\nzareth spoke rather as a friend of  the Romans \nthan of the Jews. One day I=\r\n observed in the midst of a group of  people a young \nman who was leaning a=\r\ngainst a tree, calmly addressing the  multitude. I was \ntold it was Jesus. =\r\nThis I could easily have suspected so great  was the \ndifference between Hi=\r\nm and those who were listening to Him. His golden  colored \nhair and beard =\r\ngave to his appearance a celestial aspect. He appeared to  \nbe about 30 yea=\r\nrs of age. Never have I seen a sweeter or more serene  \ncountenance. What a=\r\n contrast between Him and His bearers with their black beards  \nand tawny c=\r\nomplexions! Unwilling to interrupt Him by my presence, I continued \nmy  wal=\r\nk but signified to my secretary to join the group and listen. Later, \nmy  s=\r\necretary reported that never had he seen in the works of all the \nphilosoph=\r\ners  anything that compared to the teachings of Jesus. He told me that \nJes=\r\nus was  neither seditious nor rebellious, so we extended to Him our \nprotec=\r\ntion. He was  at liberty to act, to speak, to assemble and to address the \n=\r\npeople. This  unlimited freedom provoked the Jews =E2=80=94 not the poor bu=\r\nt the rich \nand  powerful.\nLater, I wrote to Jesus requesting an interview =\r\nwith Him at the  \nPraetorium. He came. When the Nazarene made His appearanc=\r\ne I was having my  morning \nwalk and as I faced Him my feet seemed fastened=\r\n with an iron hand to the  \nmarble pavement and I trembled in every limb as=\r\n a guilty culprit, though he was  \ncalm. For some time I stood admiring thi=\r\ns extraordinary Man. There was \nnothing  in Him that was repelling, nor in =\r\nHis character, yet I felt awed in His \n presence. I told Him that there was=\r\n a magnetic simplicity about Him and \nHis  personality that elevated Him fa=\r\nr above the philosophers and teachers of \nHis  day.\nNow, Noble Sovereign, t=\r\nhese are the facts concerning Jesus of Nazareth  and \nI have taken the time=\r\n to write you in detail concerning these matters. I \nsay  that such a man w=\r\nho could convert water into wine, change death into \nlife,  disease into he=\r\nalth; calm the stormy seas, is not guilty of any criminal \noffense  and as =\r\nothers have said, we must agree =E2=80=94 truly this is the Son of \nGod.\nYo=\r\nur  most obedient servant,\nPontius Pilate\n\r\n--part1_dfc93.37098b71.3b60e4e2_boundary\r\nContent-Type: text/html; charset=&quot;UTF-8&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\nContent-Language: en\r\n\r\n&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML 4.0 Transitional//EN&quot;&gt;\n&lt;HTML&gt;&lt;HEAD&gt;=\r\n\n&lt;META http-equiv=3DContent-Type content=3D&quot;text/html; charset=3DUTF-8&quot;&gt;\n&lt;M=\r\nETA content=3D&quot;MSHTML 6.00.6000.17098&quot; name=3DGENERATOR&gt;&lt;/HEAD&gt;\n&lt;BODY id=3D=\r\nrole_body style=3D&quot;FONT-SIZE: 10pt; COLOR: #000000; FONT-FAMILY: Arial&quot;   b=\r\nottomMargin=3D7 leftMargin=3D7 topMargin=3D7 rightMargin=3D7&gt;&lt;FONT id=3Drol=\r\ne_document   face=3DArial color=3D#000000 size=3D2&gt;\n&lt;DIV&gt;\n&lt;DIV class=3Da2&gt;T=\r\no: &lt;B&gt;JFK_Lib&lt;/B&gt;&lt;/DIV&gt;\n&lt;DIV class=3Db2&gt;\n&lt;P&gt;&lt;STRONG&gt;The letter from Pontius=\r\n Pilate to Tiberius Caesar&lt;BR&gt;This is a \nreprinting of a letter from Pontiu=\r\ns Pilate to Tiberius Caesar describing the \nphysical appearance of Jesus. C=\r\nopies are in the Congressional Library in \nWashington, D.C.&lt;/STRONG&gt;&lt;/P&gt;\n&lt;P=\r\n&gt;&lt;STRONG&gt;TO TIBERIUS CAESAR:&lt;BR&gt;A young man appeared in Galilee preaching w=\r\nith \nhumble unction, a new law in the Name of the God that had sent Him. At=\r\n first I \nwas apprehensive that His design was to stir up the people agains=\r\nt the Romans, \nbut my fears were soon dispelled. Jesus of Nazareth spoke ra=\r\nther as a friend of \nthe Romans than of the Jews. One day I observed in the=\r\n midst of a group of \npeople a young man who was leaning against a tree, ca=\r\nlmly addressing the \nmultitude. I was told it was Jesus. This I could easil=\r\ny have suspected so great \nwas the difference between Him and those who wer=\r\ne listening to Him. His golden \ncolored hair and beard gave to his appearan=\r\nce a celestial aspect. He appeared to \nbe about 30 years of age. Never have=\r\n I seen a sweeter or more serene \ncountenance. What a contrast between Him =\r\nand His bearers with their black beards \nand tawny complexions! Unwilling t=\r\no interrupt Him by my presence, I continued my \nwalk but signified to my se=\r\ncretary to join the group and listen. Later, my \nsecretary reported that ne=\r\nver had he seen in the works of all the philosophers \nanything that compare=\r\nd to the teachings of Jesus. He told me that Jesus was \nneither seditious n=\r\nor rebellious, so we extended to Him our protection. He was \nat liberty to =\r\nact, to speak, to assemble and to address the people. This \nunlimited freed=\r\nom provoked the Jews =E2=80=94 not the poor but the rich and \npowerful.&lt;BR&gt;=\r\nLater, I wrote to Jesus requesting an interview with Him at the \nPraetorium=\r\n. He came. When the Nazarene made His appearance I was having my \nmorning w=\r\nalk and as I faced Him my feet seemed fastened with an iron hand to the \nma=\r\nrble pavement and I trembled in every limb as a guilty culprit, though he w=\r\nas \ncalm. For some time I stood admiring this extraordinary Man. There was =\r\nnothing \nin Him that was repelling, nor in His character, yet I felt awed i=\r\nn His \npresence. I told Him that there was a magnetic simplicity about Him =\r\nand His \npersonality that elevated Him far above the philosophers and teach=\r\ners of His \nday.&lt;BR&gt;Now, Noble Sovereign, these are the facts concerning Je=\r\nsus of Nazareth \nand I have taken the time to write you in detail concernin=\r\ng these matters. I say \nthat such a man who could convert water into wine, =\r\nchange death into life, \ndisease into health; calm the stormy seas, is not =\r\nguilty of any criminal offense \nand as others have said, we must agree =E2=\r\n=80=94 truly this is the Son of God.&lt;BR&gt;Your \nmost obedient servant,&lt;BR&gt;Pon=\r\ntius Pilate&lt;/STRONG&gt;&lt;/P&gt;&lt;BR   clear=3Dall&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/FONT&gt;&lt;/BODY&gt;&lt;/HTML&gt;=\r\n\n\r\n--part1_dfc93.37098b71.3b60e4e2_boundary--"}