{"id": "21812", "subject": "Re: Comet is star cluster now,", "author": "natetrnr", "timestamp": "2011-07-28T15:54:56Z", "full_text": "The person in the youtube video bills himself as a theologian, and he&#39;s got that crazy look in his eye. I personally would not seek out a theologian on matters of astronomy. The photo he shows could be from anywhere in the universe. I&#39;d go to NASA, and I did.\n\nI think I paid attention during science class in high school, and I&#39;m pretty sure a comet cannot also be a star cluster. Stars don&#39;t really cluster, gravity would force them to collide. A star cluster is an optical illusion when we see stars apparently together in the night sky.\n\nHere&#39;s a quote from the NASA website:\n\nComet Elenin should be at its brightest shortly before the time of its closest approach to Earth on Oct. 16 of this year. At its closest point, it will be 35 million kilometers (22 million miles) from us. Can this icy interloper influence us from where it is, or where it will be in the future? What about this celestial object inspiring some shifting of the tides or even tectonic plates here on Earth? There have been some incorrect Internet speculations that external forces could cause comet Elenin to come closer.\n\n&quot;Comet Elenin will not encounter any dark bodies that could perturb its orbit, nor will it influence us in any way here on Earth,&quot; said Yeomans. &quot;It will get no closer to Earth than 35 million kilometers [about 22 million miles]. &quot;\n\n&quot;Comet Elenin will not only be far away, it is also on the small side for comets,&quot; said Yeomans. &quot;And comets are not the most densely-packed objects out there. They usually have the density of something akin to loosely packed icy dirt.\n\n&quot;So you&#39;ve got a modest-sized icy dirtball that is getting no closer than 35 million kilometers,&quot; said Yeomans. &quot;It will have an immeasurably miniscule influence on our planet. By comparison, my subcompact automobile exerts a greater influence on the ocean&#39;s tides than comet Elenin ever will.&quot;\n\nhttp://www.nasa.gov/topics/solarsystem/features/comet20110504.html\n\nI&#39;ll go with the scientist rather than the doomsday theologian.\n\nNate\n\n\n--- In EVP-ITC@yahoogroups.com, SnowfireL@... wrote:\n&gt;\n&gt; Now they are saying that Comet Elenin is not just a comet but a star  \n&gt; cluster, here are new photos, if you all can get past the preacher man, and  \n&gt; check out the photo he has now.  He says he got it right from NASA, why are  \n&gt; they keeping this so quiet?  I wonder?   When Hail Bob or  Hailey&#39;s  went by us \n&gt; everyone was told, but they sure are not telling us  much now.  sf\n&gt;  \n&gt;  \n&gt; _http://www.youtube.com/watch?v=xYTPbpfONzE&feature=feedu_ \n&gt; (http://www.youtube.com/watch?v=xYTPbpfONzE&feature=feedu)\n&gt;"}