{"id": "21825", "subject": "Re: [RTSC] Ghost box fame and money", "author": "jamietreetalker", "timestamp": "2011-08-02T18:03:30Z", "full_text": "--7-8599943299-6119076827=:7\r\nContent-Type: text/plain; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nI think you&#39;re right, Frank. There are several ways for &quot;them&quot; to\ncommunica=\r\nte and it seems like sound is the easiest for them to\nmanipulate. I don&#39;t c=\r\nlaim to know for certain, but it seems that if you\ngive them any kind of au=\r\ndio platform, they can manipulate the sound\nwaves as they like. I was playi=\r\nng with EVP Maker last weekend, and I had\ncreated a file from a foreign lan=\r\nguage learning file I found online. I\nloaded it into EVP Maker and was play=\r\ning with it, and I decided to\nrecord for a minute. After a few seconds, I h=\r\neard --out loud!--a man say\n&quot;I&#39;m here!&quot; as if he was standing right next to=\r\n me. However, it did not\nappear on the recording, which is very frustrating=\r\n.\nI do sometimes get communication through what I call the &quot;inner-ear&quot;\nmeth=\r\nod, where they put words in my ear (usually the left one), just like\nputtin=\r\ng a letter into an envelope. That could have been what it was.\nI&#39;ve been he=\r\naring more of that since I started paying more attention to\nthem, but I oft=\r\nen get them when there is no sound at all. It&#39;s like\nthey&#39;re using the eard=\r\nrum or something, or putting it in as a thought.\nAnywho, I still have to re=\r\nad the EVP Maker manual a little more, because\nI couldn&#39;t get it to work li=\r\nke I wanted. Do you use the manual sweep\noption?\nJamie\n\n\n--- In EVP-ITC@yah=\r\noogroups.com, Frank Sumption &lt;purplealiengirl@...&gt;\nwrote:\n&gt;\n&gt;  No one gets =\r\nit! It&#39;s not &quot;the box&quot;, it is supplying a *raw audio*\nthat the\n&gt; entities u=\r\nse to form voices. *Raw audio=3D=3Dbits of speech.* There are in\nfact\n&gt; oth=\r\ner methods that result in clearer communication. Even white noise,\nwhile\n&gt; =\r\nproducing weak voices, it&#39;s still clearer voices. Another method,\nperhaps m=\r\ny\n&gt; favorite is the Foreign language method, tuning in a foreign shortwave\n=\r\n&gt; broadcast in a language I don&#39;t understand, and after announcing I&#39;m\ndoin=\r\ng\n&gt; an EVP recording, record directly for the radio&#39;s speaker. There is\ntun=\r\ning\n&gt; an AM radio between stations when there are skip conditions, distant\n=\r\n&gt; stations fading in and out randomly.\n&gt;\n&gt;  Radio seems to be an important =\r\nelement in these communications, but\nthe\n&gt; fact is, &quot;the box&quot; is not the on=\r\nly way. With using EVPmaker, the radio\nis\n&gt; eliminated, so the importance o=\r\nf the radio element is debatable. You\ncan do\n&gt; the foreign language method =\r\nvia the Internet, see coffeepotghost.com\n&gt;\n&gt;  You can use &quot;crowd noise&quot;, li=\r\nke recording in a shopping mall, or\n&gt; restaurant, try to say, or at least t=\r\nhink &quot; I&#39;m doing an EVP\nrecording&quot;, you\n&gt; get meaningful messages made out =\r\nof the  mix of normal voices.\n&gt;\n&gt;  I use &quot;the box&quot; simply because is it con=\r\nvinient, not because it is\nthe best\n&gt; method. Sweeping a radio is a quick, =\r\nand easy way to produce *raw\naudio*.\n&gt; Ten years I try to get this across, =\r\nmight as well tell it to my dogs!\n&gt;\n&gt; F-S\n&gt;\n&gt; On Mon, Aug 1, 2011 at 6:12 A=\r\nM, Richard B Georgina wd4rbx@...wrote:\n&gt;\n&gt; &gt; **\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; **\n&gt; &gt; In my op=\r\ninion there are a hand full of inventers that have achieved\nfame in\n&gt; &gt; the=\r\n GB field. As I understand it they all are riding on the coat\ntales of\n&gt; &gt; =\r\nour very own Frank S. Every GB out there is a spin on a Franks box\neven the=\r\n\n&gt; &gt; ones that use a speech chip. The bottom line is that all the box&#39;s\nout=\r\n there\n&gt; &gt; rely on snippets of speech that the spirit world can try and use=\r\n to\n&gt; &gt; communicate with us. If you think about it there all spun up Frank&#39;=\r\ns\nBox&#39;s.\n&gt; &gt; What I&#39;m getting at is that Frank has the fame market cornered=\r\n and\nright\n&gt; &gt; fully so. Unless you are some sort of a wiz bang electrical =\r\nengineer\nyou\n&gt; &gt; might as well forget about becoming famous building GB&#39;s.\n=\r\n&gt; &gt;\n&gt; &gt; The whole idea of using kit 23 (function generator) to sweep a radi=\r\no\nand\n&gt; &gt; make a Frank&#39;s box knock off was to bring an inexpensive GB to th=\r\ne\ngroup\n&gt; &gt; that would work better then a hack and not earn a merit badge i=\r\nn GB\n&gt; &gt; building. At the time it was a good idea because this group was al=\r\nl\nabout\n&gt; &gt; the communication . It was extremely interesting and it looked =\r\nlike\nthis\n&gt; &gt; group just might take GBC to some level of understanding and =\r\neven\n&gt; &gt; consistency in the communication. If someone wants to achieve fame=\r\n\nthrough\n&gt; &gt; the GB community I believe that&#39;s the direction to go in. I do=\r\nubt\nthat you\n&gt; &gt; will have any compition and get lots of help from this gro=\r\nup.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Rich\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; &gt;&gt;Money and fame are the two evils that pl=\r\nague the field.&lt;&lt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt;\n\n\r\n--7-8599943299-6119076827=:7\r\nContent-Type: text/html; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n\nI think you&#39;re right, Frank. There are several ways for &quot;them&quot; to communic=\r\nate and it seems like sound is the easiest for them to manipulate. I don&#39;t =\r\nclaim to know for certain, but it seems that if you give them any kind of a=\r\nudio platform, they can manipulate the sound waves as they like. I was play=\r\ning with EVP Maker last weekend, and I had created a file from a foreign la=\r\nnguage learning file I found online. I loaded it into EVP Maker and was pla=\r\nying with it, and I decided to record for a minute. After a few seconds, I =\r\nheard --out loud!--a man say &quot;I&#39;m here!&quot; as if he was standing right next t=\r\no me. However, it did not appear on the recording, which is very frustratin=\r\ng.&nbsp;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;I do sometimes get communication through what I=\r\n call the &quot;inner-ear&quot; method, where they put words in my ear (usually the l=\r\neft one), just like putting a letter into an envelope. That could have been=\r\n what it was. I&#39;ve been hearing more of that since I started paying more at=\r\ntention to them, but I often get them when there is no sound at all. It&#39;s l=\r\nike they&#39;re using the eardrum or something, or putting it in as a thought.&lt;=\r\ndiv&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;Anywho, I still have to read the EVP Maker manual a litt=\r\nle more, because I couldn&#39;t get it to work like I wanted. Do you use the ma=\r\nnual sweep option?&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;Jamie&lt;br&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;&lt;b=\r\nr&gt;--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@...&gt=\r\n; wrote:&lt;br&gt;&gt;&lt;br&gt;&gt;  No one gets it! It&#39;s not &quot;the box&quot;, it is supplyi=\r\nng a *raw audio* that the&lt;br&gt;&gt; entities use to form voices. *Raw audio=\r\n=3D=3Dbits of speech.* There are in fact&lt;br&gt;&gt; other methods that result =\r\nin clearer communication. Even white noise, while&lt;br&gt;&gt; producing weak vo=\r\nices, it&#39;s still clearer voices. Another method, perhaps my&lt;br&gt;&gt; favorit=\r\ne is the Foreign language method, tuning in a foreign shortwave&lt;br&gt;&gt; bro=\r\nadcast in a language I don&#39;t understand, and after announcing I&#39;m doing&lt;br&gt;=\r\n&gt; an EVP recording, record directly for the radio&#39;s speaker. There is tu=\r\nning&lt;br&gt;&gt; an AM radio between stations when there are skip conditions, d=\r\nistant&lt;br&gt;&gt; stations fading in and out randomly.&lt;br&gt;&gt; &lt;br&gt;&gt;  Radio=\r\n seems to be an important element in these communications, but the&lt;br&gt;&gt; =\r\nfact is, &quot;the box&quot; is not the only way. With using EVPmaker, the radio is&lt;b=\r\nr&gt;&gt; eliminated, so the importance of the radio element is debatable. You=\r\n can do&lt;br&gt;&gt; the foreign language method via the Internet, see coffeepot=\r\nghost.com&lt;br&gt;&gt; &lt;br&gt;&gt;  You can use &quot;crowd noise&quot;, like recording in a =\r\nshopping mall, or&lt;br&gt;&gt; restaurant, try to say, or at least think &quot; I&#39;m d=\r\noing an EVP recording&quot;, you&lt;br&gt;&gt; get meaningful messages made out of the=\r\n  mix of normal voices.&lt;br&gt;&gt; &lt;br&gt;&gt;  I use &quot;the box&quot; simply because is=\r\n it convinient, not because it is the best&lt;br&gt;&gt; method. Sweeping a radio=\r\n is a quick, and easy way to produce *raw audio*.&lt;br&gt;&gt; Ten years I try t=\r\no get this across, might as well tell it to my dogs!&lt;br&gt;&gt; &lt;br&gt;&gt; F-S&lt;b=\r\nr&gt;&gt; &lt;br&gt;&gt; On Mon, Aug 1, 2011 at 6:12 AM, Richard B Georgina wd4rbx@.=\r\n..wrote:&lt;br&gt;&gt; &lt;br&gt;&gt; &gt; **&lt;br&gt;&gt; &gt;&lt;br&gt;&gt; &gt;&lt;br&gt;&gt; &gt; **=\r\n&lt;br&gt;&gt; &gt; In my opinion there are a hand full of inventers that have ac=\r\nhieved fame in&lt;br&gt;&gt; &gt; the GB field. As I understand it they all are r=\r\niding on the coat tales of&lt;br&gt;&gt; &gt; our very own Frank S. Every GB out =\r\nthere is a spin on a Franks box even the&lt;br&gt;&gt; &gt; ones that use a speec=\r\nh chip. The bottom line is that all the box&#39;s out there&lt;br&gt;&gt; &gt; rely o=\r\nn snippets of speech that the spirit world can try and use to&lt;br&gt;&gt; &gt; =\r\ncommunicate with us. If you think about it there all spun up Frank&#39;s Box&#39;s.=\r\n&lt;br&gt;&gt; &gt; What I&#39;m getting at is that Frank has the fame market cornere=\r\nd and right&lt;br&gt;&gt; &gt; fully so. Unless you are some sort of a wiz bang e=\r\nlectrical engineer you&lt;br&gt;&gt; &gt; might as well forget about becoming fam=\r\nous building GB&#39;s.&lt;br&gt;&gt; &gt;&lt;br&gt;&gt; &gt; The whole idea of using kit 23=\r\n (function generator) to sweep a radio and&lt;br&gt;&gt; &gt; make a Frank&#39;s box =\r\nknock off was to bring an inexpensive GB to the group&lt;br&gt;&gt; &gt; that wou=\r\nld work better then a hack and not earn a merit badge in GB&lt;br&gt;&gt; &gt; bu=\r\nilding. At the time it was a good idea because this group was all about&lt;br&gt;=\r\n&gt; &gt; the communication . It was extremely interesting and it looked li=\r\nke this&lt;br&gt;&gt; &gt; group just might take GBC to some level of understandi=\r\nng and even&lt;br&gt;&gt; &gt; consistency in the communication. If someone wants=\r\n to achieve fame through&lt;br&gt;&gt; &gt; the GB community I believe that&#39;s the=\r\n direction to go in. I doubt that you&lt;br&gt;&gt; &gt; will have any compition =\r\nand get lots of help from this group.&lt;br&gt;&gt; &gt;&lt;br&gt;&gt; &gt;&lt;br&gt;&gt; &gt=\r\n; Rich&lt;br&gt;&gt; &gt;&lt;br&gt;&gt; &gt;&lt;br&gt;&gt; &gt; &gt;&gt;Money and fame are th=\r\ne two evils that plague the field.&lt;&lt;&lt;br&gt;&gt; &gt;&lt;br&gt;&gt; &gt; &lt;br&gt;&g=\r\nt; &gt;&lt;br&gt;&gt;&lt;br&gt;\n&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;\n\r\n--7-8599943299-6119076827=:7--"}