{"id": "21824", "subject": "Re: [EVP-ITC] Re: [RTSC] Ghost box fame and money", "author": "cbreck elknet.net", "timestamp": "2011-08-02T17:25:57Z", "full_text": "I get it...I think it&#39;s the intent of the user to communicate.  I get voices\nno matter what I use.  No matter where I&quot;m at.  It has gotta be the intent\nof the user.  I&#39;m just saying,\nCarol B.\n\nOn Mon, Aug 1, 2011 at 3:56 PM, Frank Sumption &lt;purplealiengirl@...&gt;wrote:\n\n&gt; **\n&gt;\n&gt;\n&gt;  No one gets it! It&#39;s not &quot;the box&quot;, it is supplying a *raw audio* that\n&gt; the entities use to form voices. *Raw audio==bits of speech.* There are in\n&gt; fact other methods that result in clearer communication. Even white noise,\n&gt; while producing weak voices, it&#39;s still clearer voices. Another method,\n&gt; perhaps my favorite is the Foreign language method, tuning in a foreign\n&gt; shortwave broadcast in a language I don&#39;t understand, and after announcing\n&gt; I&#39;m doing an EVP recording, record directly for the radio&#39;s speaker. There\n&gt; is tuning an AM radio between stations when there are skip conditions,\n&gt; distant stations fading in and out randomly.\n&gt;\n&gt;  Radio seems to be an important element in these communications, but the\n&gt; fact is, &quot;the box&quot; is not the only way. With using EVPmaker, the radio is\n&gt; eliminated, so the importance of the radio element is debatable. You can do\n&gt; the foreign language method via the Internet, see coffeepotghost.com\n&gt;\n&gt;  You can use &quot;crowd noise&quot;, like recording in a shopping mall, or\n&gt; restaurant, try to say, or at least think &quot; I&#39;m doing an EVP recording&quot;, you\n&gt; get meaningful messages made out of the  mix of normal voices.\n&gt;\n&gt;  I use &quot;the box&quot; simply because is it convinient, not because it is the\n&gt; best method. Sweeping a radio is a quick, and easy way to produce *raw\n&gt; audio*. Ten years I try to get this across, might as well tell it to my\n&gt; dogs!\n&gt;\n&gt; F-S\n&gt;\n&gt; On Mon, Aug 1, 2011 at 6:12 AM, Richard B Georgina &lt;wd4rbx@...&gt;wrote:\n&gt;\n&gt;&gt; **\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; **\n&gt;&gt; In my opinion there are a hand full of inventers that have achieved fame\n&gt;&gt; in the GB field. As I understand it they all are riding on the coat tales of\n&gt;&gt; our very own Frank S. Every GB out there is a spin on a Franks box even the\n&gt;&gt; ones that use a speech chip. The bottom line is that all the box&#39;s out there\n&gt;&gt; rely on snippets of speech that the spirit world can try and use to\n&gt;&gt; communicate with us. If you think about it there all spun up Frank&#39;s Box&#39;s.\n&gt;&gt; What I&#39;m getting at is that Frank has the fame market cornered and right\n&gt;&gt; fully so. Unless you are some sort of a wiz bang electrical engineer you\n&gt;&gt; might as well forget about becoming famous building GB&#39;s.\n&gt;&gt;\n&gt;&gt; The whole idea of using kit 23 (function generator) to sweep a radio and\n&gt;&gt; make a Frank&#39;s box knock off was to bring an inexpensive GB to the group\n&gt;&gt; that would work better then a hack and not earn a merit badge in GB\n&gt;&gt; building. At the time it was a good idea because this group was all about\n&gt;&gt; the communication . It was extremely interesting and it looked like this\n&gt;&gt; group just might take GBC to some level of understanding and even\n&gt;&gt; consistency in the communication. If someone wants to achieve fame through\n&gt;&gt; the GB community I believe that&#39;s the direction to go in. I doubt that you\n&gt;&gt; will have any compition and get lots of help from this group.\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; Rich\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; &gt;&gt;Money and fame are the two evils that plague the field.&lt;&lt;\n&gt;&gt;\n&gt;&gt;\n&gt;  \n&gt;\n\nI ge i ...I hink i 's he in en o he use o communica e.  I ge oices no ma e wha I use.  No ma e whe e I\"m a .  I has go a be he in en o he use .  I'm jus saying,\nCa ol B.\nOn Mon, Aug 1, 2011 a 3:56 PM, F ank Sump ion pu plealiengi l@...> w o e:\n\n  \n\n\n\n\n No one ge s i ! I 's no \" he box\", i is supplying a aw audio ha he en i ies use o o m oices. Raw audio==bi s o speech. The e a e in ac o he me hods ha esul in clea e communica ion. E en whi e noise, while p oducing weak oices, i 's s ill clea e oices. Ano he me hod, pe haps my a o i e is he Fo eign language me hod, uning in a o eign sho wa e b oadcas in a language I don' unde s and, and a e announcing I'm doing an EVP eco ding, eco d di ec ly o he adio's speake . The e is uning an AM adio be ween s a ions when he e a e skip condi ions, dis an s a ions ading in and ou andomly. \n\n \n Radio seems o be an impo an elemen in hese communica ions, bu   he ac is, \" he box\" is no he only way. Wi h using EVPmake , he adio is elimina ed, so he impo ance o he adio elemen is deba able. You can do he o eign language me hod ia he In e ne , see co eepo ghos .com\n\n \n You can use \"c owd noise\", like eco ding in a shopping mall, o es au an , y o say, o a leas hink \" I'm doing an EVP eco ding\", you ge meaning ul messages made ou o he  mix o no mal oices. \n\n \n I use \" he box\" simply because is i con inien , no because i is he bes me hod. Sweeping a adio is a quick, and easy way o p oduce aw audio. Ten yea s I y o ge his ac oss, migh as well ell i o my dogs! \n\n \nF-S\nOn Mon, Aug 1, 2011 a 6:12 AM, Richa d B Geo gina wd4 bx@...> w o e:\n\n  \n\n\n\n\nIn my opinion he e a e a hand ull o in en e s ha ha e achie ed ame in he GB ield. As I unde s and i hey all a e iding on he coa ales o ou e y own F ank S. E e y GB ou he e is a spin on a F anks box e en he ones ha use a speech chip. The bo om line is ha all he box's ou he e ely on snippe s o speech ha he spi i wo ld can y and use o communica e wi h us. I you hink abou i he e all spun up F ank's Box's. Wha I'm ge ing a is ha F ank has he ame ma ke co ne ed and igh ully so. Unless you a e some so o a wiz bang elec ical enginee you migh as well o ge abou becoming amous building GB's.\n\n \nThe whole idea o using ki 23 ( unc ion gene a o ) o sweep a adio and make a F ank's box knock o was o b ing an inexpensi e GB o he g oup ha would wo k be e hen a hack and no ea n a me i badge in GB building. A he ime i was a good idea because his g oup was all abou he communica ion . I was ex emely in e es ing and i looked like his g oup jus migh ake GBC o some le el o unde s anding and e en consis ency in he communica ion. I someone wan s o achie e ame  h ough he GB communi y I belie e ha 's he di ec ion o go in. I doub ha you will ha e any compi ion and ge  lo s o help om his g oup.\n\n \n \nRich\n \n \n>>Money and ame a e he wo e ils ha plague he ield."}