{"id": "21847", "subject": "Re: [EVP-ITC] semi new", "author": "Rick Wegrzyn", "timestamp": "2011-08-05T22:07:53Z", "full_text": "--0-1819933549-1312582073=:10423\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nBy the way I&#39;m the Founder of RIPCOLORADO a paranormal group here in Little=\r\nton,Co...=C2=A0 www.realinvestigationsoftheparanormal.net=C2=A0 34 years in=\r\n the field,seen and done it all,in the process of getting a cable TV slot..=\r\n..it takes a few mins to let EVPs download,put on head phones and listen to=\r\n what I live with..\n\n\nFrom: Vicky Cox &lt;vickyw222@...&gt;\nTo: EVP-ITC@yah=\r\noogroups.com\nSent: Friday, August 5, 2011 10:22 AM\nSubject: [EVP-ITC] semi =\r\nnew\n\n\n=C2=A0 \nHello. I&#39;m sort of new to the group. I&#39;ve been observing but =\r\nnot posting much. Most of my experiences have been personal and I have deci=\r\nded to take it up a notch and join a group. My trouble has been that most g=\r\nroups I have encountered are simply unorganized or unmotivated (in it for t=\r\nhe t-shirts). I went with a group recently to an old cabin for what turned =\r\nout to be an hour and a half investigation. I got around 8 EVPs, some photo=\r\ns, and a couple of noise responses on my recorder. My first attempt with a =\r\nflash light got me a half an hour worth of consistent responses. When I got=\r\n my first recorder I got 3 EVPs while reading the instructions. I&#39;m a magne=\r\nt and for the first time in my life it doesn&#39;t scare me. What does scare me=\r\n is that my kids are just as effected. So I want to learn as much as I can =\r\non an interactive level so I can not only educate myself but protect my kid=\r\ns. Is anyone in the Toledo area interested in doing investigations?\n\nHere i=\r\ns my personal page. It&#39;s a freebie website that I recently started to organ=\r\nize some of my evidence. Don&#39;t mind the construction. But here&#39;s a link to =\r\nmy EVPs on my recent investigation I mentioned above. I very much would app=\r\nreciate any feedback or comments.\n\nclick here to see me recent evps\n\nI woul=\r\nd like to also know if anyone is familiar with the name &quot;Attoy&quot; (guess of s=\r\npelling)\n\nI recently tried communicating on a box I got off of Ebay. I aske=\r\nd for a name and heard &quot;toy&quot;. I asked again and I again heard &quot;toy&quot;.\nI didn=\r\n&#39;t think much of it until later that day my 2 year old climbs on my lap, lo=\r\noks at an empty space, gets very excited, starts waving and says &quot;toy a toy=\r\n&quot;\nI later asked my 3 year old if she knew anybody named &quot;toy&quot; and she corre=\r\ncted me by saying &quot;Atoy. He&#39;s a boy.&quot; I asked her how old he was. She looke=\r\nd confused for a second and replied &quot;He&#39;s still 4.&quot; She said he&#39;s happy, no=\r\nt sick, little like her, and only says nice words. When I asked her where s=\r\nhe met him she replied &quot;the living room.&quot; When I asked her how long he&#39;s be=\r\nen there she unhesitatingly began to reply &quot;5 years&quot; but only said &quot;5 ye&quot; S=\r\nhe doesn&#39;t understand the concept of a year. She did say he&#39;s been there as=\r\n long as she can remember. I can remember my older daughter in a previous h=\r\nouse smiling and saying &quot;hi&quot; to nothing as a baby. I have EVP&#39;s of breaths =\r\nfrom the house as well. They all sound like children. One I have is of what=\r\n I believe to be cheyne stokes. I only recognized this because I&#39;m a nurse.=\r\n It&#39;s a particular breathing pattern that people sometimes have with immine=\r\nnt death. I would appreciate any suggestions on how to communicate\n more wi=\r\nth him. \n\n\n-- \nVicky\n\n\n-- \nVicky\n\n\r\n--0-1819933549-1312582073=:10423\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;&lt;body&gt;&lt;div style=3D&quot;color:#000; background-color:#fff; font-family:bo=\r\nokman old style, new york, times, serif;font-size:14pt&quot;&gt;&lt;div style=3D&quot;RIGHT=\r\n: auto&quot;&gt;&lt;SPAN style=3D&quot;RIGHT: auto&quot;&gt;By the way I&#39;m the Founder of RIPCOLORA=\r\nDO a paranormal group here in Littleton,Co...&nbsp; &lt;A href=3D&quot;http://www.r=\r\nealinvestigationsoftheparanormal.net&quot;&gt;www.realinvestigationsoftheparanormal=\r\n.net&lt;/A&gt;&nbsp; 34 years in the field,seen and done it all,in the process of=\r\n getting a cable TV slot....it takes a few mins to let EVPs download,put on=\r\n head phones and listen to what I live with..&lt;VAR id=3Dyui-ie-cursor&gt;&lt;/VAR&gt;=\r\n&lt;BR style=3D&quot;RIGHT: auto&quot; class=3Dyui-cursor&gt;&lt;/SPAN&gt;&lt;/div&gt;\n&lt;div&gt;&lt;BR&gt;&lt;/div&gt;\n=\r\n&lt;DIV style=3D&quot;FONT-FAMILY: bookman old style, new york, times, serif; FONT-=\r\nSIZE: 14pt&quot;&gt;\n&lt;DIV style=3D&quot;FONT-FAMILY: times new roman, new york, times, s=\r\nerif; FONT-SIZE: 12pt&quot;&gt;&lt;FONT size=3D2 face=3DArial&gt;\n&lt;DIV style=3D&quot;BORDER-BO=\r\nTTOM: #ccc 1px solid; BORDER-LEFT: #ccc 1px solid; PADDING-BOTTOM: 0px; LIN=\r\nE-HEIGHT: 0; MARGIN: 5px 0px; PADDING-LEFT: 0px; PADDING-RIGHT: 0px; HEIGHT=\r\n: 0px; FONT-SIZE: 0px; BORDER-TOP: #ccc 1px solid; BORDER-RIGHT: #ccc 1px s=\r\nolid; PADDING-TOP: 0px&quot; class=3Dhr contentEditable=3Dfalse readonly=3D&quot;true=\r\n&quot;&gt;&lt;/DIV&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: bold&quot;&gt;From:&lt;/SPAN&gt;&lt;/B&gt; Vicky Cox &lt=\r\n;vickyw222@...&gt;&lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: bold&quot;&gt;To:&lt;/SPAN&gt;=\r\n&lt;/B&gt; EVP-ITC@yahoogroups.com&lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: bold&quot;&gt;Sent:&lt;=\r\n/SPAN&gt;&lt;/B&gt; Friday, August 5, 2011 10:22 AM&lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT=\r\n: bold&quot;&gt;Subject:&lt;/SPAN&gt;&lt;/B&gt; [EVP-ITC] semi new&lt;BR&gt;&lt;/FONT&gt;&lt;BR&gt;\n&lt;DIV id=3Dyiv=\r\n1410505485&gt;&lt;SPAN style=3D&quot;DISPLAY: none&quot;&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV id=3Dyiv141050=\r\n5485ygrp-text&gt;\n&lt;DIV&gt;Hello. I&#39;m sort of new to the group. I&#39;ve been observin=\r\ng but not posting much. Most of my experiences have been personal and I hav=\r\ne decided to take it up a notch and join a group. My trouble has been that =\r\nmost groups I have encountered are simply unorganized or unmotivated (in it=\r\n for the t-shirts). I went with a group recently to an old cabin for what t=\r\nurned out to be an hour and a half investigation. I got around 8 EVPs, some=\r\n photos, and a couple of noise responses on my recorder. My first attempt w=\r\nith a flash light got me a half an hour worth of consistent responses. When=\r\n I got my first recorder I got 3 EVPs while reading the instructions. I&#39;m a=\r\n magnet and for the first time in my life it doesn&#39;t scare me. What does sc=\r\nare me is that my kids are just as effected. So I want to learn as much as =\r\nI can on an interactive level so I can not only educate myself but protect =\r\nmy kids. Is anyone in the Toledo area interested in doing investigations?&lt;/=\r\nDIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Here is my personal page. It&#39;s a freebie websit=\r\ne that I recently started to organize some of my evidence. Don&#39;t mind the c=\r\nonstruction. But here&#39;s a link to my EVPs on my recent investigation I ment=\r\nioned above. I very much would appreciate any feedback or comments.&lt;/DIV&gt;\n&lt;=\r\nDIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;A href=3D&quot;http://paranormalfindings.weebly.com/see-a=\r\nll-evps.html&quot; rel=3Dnofollow target=3D_blank&gt;click here to see me recent ev=\r\nps&lt;/A&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I would like to also know if anyone is =\r\nfamiliar with the name &quot;Attoy&quot; (guess of spelling)&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n=\r\n&lt;DIV&gt;I recently tried communicating on a box I got off of Ebay. I asked for=\r\n a name and heard &quot;toy&quot;. I asked again and I again heard &quot;toy&quot;.&lt;/DIV&gt;\n&lt;DIV&gt;=\r\nI didn&#39;t think much of it until later that day my 2 year old climbs on my l=\r\nap, looks at an empty space, gets very excited, starts waving and says &quot;toy=\r\n a toy&quot;&lt;/DIV&gt;\n&lt;DIV&gt;I later asked my 3 year old if she knew anybody named &quot;t=\r\noy&quot; and she corrected me by saying &quot;Atoy. He&#39;s a boy.&quot; I asked her how old =\r\nhe was. She looked confused for a second and replied &quot;He&#39;s still 4.&quot; She sa=\r\nid he&#39;s happy, not sick, little like her, and only says nice words. When I =\r\nasked her where she met him she replied &quot;the living room.&quot; When I asked her=\r\n how long he&#39;s been there she unhesitatingly began to reply &quot;5 years&quot; but o=\r\nnly said &quot;5 ye&quot; She doesn&#39;t understand the concept of a year. She did say h=\r\ne&#39;s been there as long as she can remember. I can remember my older daughte=\r\nr in a previous house smiling and saying &quot;hi&quot; to nothing as a baby. I have =\r\nEVP&#39;s of breaths from the house as well. They all sound like children. One =\r\nI have is of what I believe to be cheyne stokes. I only recognized this bec=\r\nause I&#39;m a nurse. It&#39;s a particular breathing pattern that people sometimes=\r\n have with imminent death. I would appreciate any suggestions on how to\n co=\r\nmmunicate more with him. &lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR clear=3Dall&gt;&lt;BR&gt;-- &lt;BR&gt;Vicky&lt;BR&gt;&lt;/=\r\nDIV&gt;&lt;BR clear=3Dall&gt;&lt;BR&gt;-- &lt;BR&gt;Vicky&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/d=\r\niv&gt;&lt;/body&gt;&lt;/html&gt;\r\n--0-1819933549-1312582073=:10423--"}