{"id": "21846", "subject": "Re: [EVP-ITC] semi new", "author": "Rick Wegrzyn", "timestamp": "2011-08-05T22:02:27Z", "full_text": "--0-2119681535-1312581747=:99855\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nOk Vicky I can help you.Do you have skype? U can find me under=C2=A0=C2=A0 =\r\nrickusa5=C2=A0=C2=A0 in Littleton,Co. free 2 minute download,Or you can cal=\r\nl me @ 720-377-4048,or we can do this which Im slow at...lol,I&#39;m here for y=\r\nou and your family 24/7\n=C2=A0\nRick\n\nFrom: Vicky Cox &lt;vickyw222@...&gt;\n=\r\nTo: EVP-ITC@yahoogroups.com\nSent: Friday, August 5, 2011 10:22 AM\nSubject: =\r\n[EVP-ITC] semi new\n\n\n=C2=A0 \nHello. I&#39;m sort of new to the group. I&#39;ve been=\r\n observing but not posting much. Most of my experiences have been personal =\r\nand I have decided to take it up a notch and join a group. My trouble has b=\r\neen that most groups I have encountered are simply unorganized or unmotivat=\r\ned (in it for the t-shirts). I went with a group recently to an old cabin f=\r\nor what turned out to be an hour and a half investigation. I got around 8 E=\r\nVPs, some photos, and a couple of noise responses on my recorder. My first =\r\nattempt with a flash light got me a half an hour worth of consistent respon=\r\nses. When I got my first recorder I got 3 EVPs while reading the instructio=\r\nns. I&#39;m a magnet and for the first time in my life it doesn&#39;t scare me. Wha=\r\nt does scare me is that my kids are just as effected. So I want to learn as=\r\n much as I can on an interactive level so I can not only educate myself but=\r\n protect my kids. Is anyone in the Toledo area interested in doing investig=\r\nations?\n\nHere is my personal page. It&#39;s a freebie website that I recently s=\r\ntarted to organize some of my evidence. Don&#39;t mind the construction. But he=\r\nre&#39;s a link to my EVPs on my recent investigation I mentioned above. I very=\r\n much would appreciate any feedback or comments.\n\nclick here to see me rece=\r\nnt evps\n\nI would like to also know if anyone is familiar with the name &quot;Att=\r\noy&quot; (guess of spelling)\n\nI recently tried communicating on a box I got off =\r\nof Ebay. I asked for a name and heard &quot;toy&quot;. I asked again and I again hear=\r\nd &quot;toy&quot;.\nI didn&#39;t think much of it until later that day my 2 year old climb=\r\ns on my lap, looks at an empty space, gets very excited, starts waving and =\r\nsays &quot;toy a toy&quot;\nI later asked my 3 year old if she knew anybody named &quot;toy=\r\n&quot; and she corrected me by saying &quot;Atoy. He&#39;s a boy.&quot; I asked her how old he=\r\n was. She looked confused for a second and replied &quot;He&#39;s still 4.&quot; She said=\r\n he&#39;s happy, not sick, little like her, and only says nice words. When I as=\r\nked her where she met him she replied &quot;the living room.&quot; When I asked her h=\r\now long he&#39;s been there she unhesitatingly began to reply &quot;5 years&quot; but onl=\r\ny said &quot;5 ye&quot; She doesn&#39;t understand the concept of a year. She did say he&#39;=\r\ns been there as long as she can remember. I can remember my older daughter =\r\nin a previous house smiling and saying &quot;hi&quot; to nothing as a baby. I have EV=\r\nP&#39;s of breaths from the house as well. They all sound like children. One I =\r\nhave is of what I believe to be cheyne stokes. I only recognized this becau=\r\nse I&#39;m a nurse. It&#39;s a particular breathing pattern that people sometimes h=\r\nave with imminent death. I would appreciate any suggestions on how to commu=\r\nnicate\n more with him. \n\n\n-- \nVicky\n\n\n-- \nVicky\n\n\r\n--0-2119681535-1312581747=:99855\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;&lt;body&gt;&lt;div style=3D&quot;color:#000; background-color:#fff; font-family:bo=\r\nokman old style, new york, times, serif;font-size:14pt&quot;&gt;&lt;div style=3D&quot;RIGHT=\r\n: auto&quot;&gt;&lt;SPAN style=3D&quot;RIGHT: auto&quot;&gt;Ok Vicky I can help you.Do you have sky=\r\npe? U can find me under&nbsp;&nbsp; rickusa5&nbsp;&nbsp; in Littleton,Co. f=\r\nree 2 minute download,Or you can call me @ 720-377-4048,or we can &lt;VAR id=\r\n=3Dyui-ie-cursor&gt;&lt;/VAR&gt;do this which Im slow at...lol,I&#39;m here for you and =\r\nyour family 24/7&lt;/SPAN&gt;&lt;/div&gt;\n&lt;div style=3D&quot;RIGHT: auto&quot;&gt;&lt;SPAN style=3D&quot;RIG=\r\nHT: auto&quot;&gt;&lt;/SPAN&gt;&nbsp;&lt;/div&gt;\n&lt;div style=3D&quot;RIGHT: auto&quot;&gt;&lt;SPAN style=3D&quot;RIG=\r\nHT: auto&quot;&gt;Rick&lt;/SPAN&gt;&lt;/div&gt;\n&lt;div&gt;&lt;BR&gt;&lt;/div&gt;\n&lt;DIV style=3D&quot;FONT-FAMILY: book=\r\nman old style, new york, times, serif; FONT-SIZE: 14pt&quot;&gt;\n&lt;DIV style=3D&quot;FONT=\r\n-FAMILY: times new roman, new york, times, serif; FONT-SIZE: 12pt&quot;&gt;&lt;FONT si=\r\nze=3D2 face=3DArial&gt;\n&lt;DIV style=3D&quot;BORDER-BOTTOM: #ccc 1px solid; BORDER-LE=\r\nFT: #ccc 1px solid; PADDING-BOTTOM: 0px; LINE-HEIGHT: 0; MARGIN: 5px 0px; P=\r\nADDING-LEFT: 0px; PADDING-RIGHT: 0px; HEIGHT: 0px; FONT-SIZE: 0px; BORDER-T=\r\nOP: #ccc 1px solid; BORDER-RIGHT: #ccc 1px solid; PADDING-TOP: 0px&quot; class=\r\n=3Dhr contentEditable=3Dfalse readonly=3D&quot;true&quot;&gt;&lt;/DIV&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FON=\r\nT-WEIGHT: bold&quot;&gt;From:&lt;/SPAN&gt;&lt;/B&gt; Vicky Cox &lt;vickyw222@...&gt;&lt;BR&gt;&lt;=\r\nB&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: bold&quot;&gt;To:&lt;/SPAN&gt;&lt;/B&gt; EVP-ITC@yahoogroups.com&lt;=\r\nBR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: bold&quot;&gt;Sent:&lt;/SPAN&gt;&lt;/B&gt; Friday, August 5, =\r\n2011 10:22 AM&lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: bold&quot;&gt;Subject:&lt;/SPAN&gt;&lt;/B&gt; [=\r\nEVP-ITC] semi new&lt;BR&gt;&lt;/FONT&gt;&lt;BR&gt;\n&lt;DIV id=3Dyiv1410505485&gt;&lt;SPAN style=3D&quot;DIS=\r\nPLAY: none&quot;&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV id=3Dyiv1410505485ygrp-text&gt;\n&lt;DIV&gt;Hello. I&#39;=\r\nm sort of new to the group. I&#39;ve been observing but not posting much. Most =\r\nof my experiences have been personal and I have decided to take it up a not=\r\nch and join a group. My trouble has been that most groups I have encountere=\r\nd are simply unorganized or unmotivated (in it for the t-shirts). I went wi=\r\nth a group recently to an old cabin for what turned out to be an hour and a=\r\n half investigation. I got around 8 EVPs, some photos, and a couple of nois=\r\ne responses on my recorder. My first attempt with a flash light got me a ha=\r\nlf an hour worth of consistent responses. When I got my first recorder I go=\r\nt 3 EVPs while reading the instructions. I&#39;m a magnet and for the first tim=\r\ne in my life it doesn&#39;t scare me. What does scare me is that my kids are ju=\r\nst as effected. So I want to learn as much as I can on an interactive level=\r\n so I can not only educate myself but protect my kids. Is anyone in the Tol=\r\nedo area interested in doing investigations?&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;H=\r\nere is my personal page. It&#39;s a freebie website that I recently started to =\r\norganize some of my evidence. Don&#39;t mind the construction. But here&#39;s a lin=\r\nk to my EVPs on my recent investigation I mentioned above. I very much woul=\r\nd appreciate any feedback or comments.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;A href=\r\n=3D&quot;http://paranormalfindings.weebly.com/see-all-evps.html&quot; rel=3Dnofollow =\r\ntarget=3D_blank&gt;click here to see me recent evps&lt;/A&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV=\r\n&gt;\n&lt;DIV&gt;I would like to also know if anyone is familiar with the name &quot;Attoy=\r\n&quot; (guess of spelling)&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I recently tried communi=\r\ncating on a box I got off of Ebay. I asked for a name and heard &quot;toy&quot;. I as=\r\nked again and I again heard &quot;toy&quot;.&lt;/DIV&gt;\n&lt;DIV&gt;I didn&#39;t think much of it unt=\r\nil later that day my 2 year old climbs on my lap, looks at an empty space, =\r\ngets very excited, starts waving and says &quot;toy a toy&quot;&lt;/DIV&gt;\n&lt;DIV&gt;I later as=\r\nked my 3 year old if she knew anybody named &quot;toy&quot; and she corrected me by s=\r\naying &quot;Atoy. He&#39;s a boy.&quot; I asked her how old he was. She looked confused f=\r\nor a second and replied &quot;He&#39;s still 4.&quot; She said he&#39;s happy, not sick, litt=\r\nle like her, and only says nice words. When I asked her where she met him s=\r\nhe replied &quot;the living room.&quot; When I asked her how long he&#39;s been there she=\r\n unhesitatingly began to reply &quot;5 years&quot; but only said &quot;5 ye&quot; She doesn&#39;t u=\r\nnderstand the concept of a year. She did say he&#39;s been there as long as she=\r\n can remember. I can remember my older daughter in a previous house smiling=\r\n and saying &quot;hi&quot; to nothing as a baby. I have EVP&#39;s of breaths from the hou=\r\nse as well. They all sound like children. One I have is of what I believe t=\r\no be cheyne stokes. I only recognized this because I&#39;m a nurse. It&#39;s a part=\r\nicular breathing pattern that people sometimes have with imminent death. I =\r\nwould appreciate any suggestions on how to\n communicate more with him. &lt;/DI=\r\nV&gt;\n&lt;DIV&gt;&lt;BR clear=3Dall&gt;&lt;BR&gt;-- &lt;BR&gt;Vicky&lt;BR&gt;&lt;/DIV&gt;&lt;BR clear=3Dall&gt;&lt;BR&gt;-- &lt;B=\r\nR&gt;Vicky&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/div&gt;&lt;/body&gt;&lt;/html&gt;\r\n--0-2119681535-1312581747=:99855--"}