{"id": "21840", "subject": "Re: [EVP-ITC] Re: Another melt down?", "author": "Zack Widup", "timestamp": "2011-08-04T18:31:31Z", "full_text": "That&#39;s a great way to look at it! And it happens to be true.\n\nZack\n\n\nOn Thu, Aug 4, 2011 at 1:28 PM, Frank Sumption &lt;purplealiengirl@...&gt;wrote:\n\n&gt; **\n&gt;\n&gt;\n&gt;  I think everyone takes this stuff way tooooooo serious, with too many\n&gt; expectations. I don&#39;t care about heavan, the afterlife, or crossing over\n&gt; spirits, or getting the proof, I let &quot;them&quot; talk, and I listen. Not gonna\n&gt; judge what &quot;they&quot; say, and not gonna get offended if it doesn&#39;t fit my world\n&gt; view( or lack of world view). They tell me earth is doomed, I don&#39;t care!\n&gt; *Que Sera, Sera (Whatever Will Be, Will Be).*\n&gt; **\n&gt;  I don&#39;t know anything, and I don&#39;t wanna know anything. Everything started\n&gt; from nothing, so the only true reality is nothing. Meditate on nothing--be\n&gt; nothing! Nothing is everything, when you become nothing, you are everything,\n&gt; you know everything. Nothing to it!\n&gt;\n&gt;  Yeah, get that past the ego filters.\n&gt;\n&gt; F-S\n&gt;\n&gt; On Wed, Aug 3, 2011 at 6:29 PM, &lt;nena.razmara@...&gt; wrote:\n&gt;\n&gt;&gt; **\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; If we are not supposed to have access then why don&#39;t they just push block\n&gt;&gt; and delete? Sometimes. I think they are all insane on the otherside. Frankly\n&gt;&gt; I am a bit disappointed that heaven has a ring tone and they sing the word\n&gt;&gt; &quot;heaven&quot; over and over again. I can&#39;t say that I am looking forward to\n&gt;&gt; whatever lies beyond this mess.\n&gt;&gt; Sent via BlackBerry from T-Mobile\n&gt;&gt;\n&gt;&gt;\n&gt;  \n&gt;\n\nTha 's a g ea way o look a i ! And i happens o be ue.ZackOn Thu, Aug 4, 2011 a 1:28 PM, F ank Sump ion pu plealiengi l@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n  I hink e e yone akes his s u way ooooooo se ious, wi h oo many expec a ions. I don' ca e abou hea an, he a e li e, o c ossing o e spi i s, o ge ing he p oo , I le \" hem\" alk, and I lis en. No gonna judge wha \" hey\" say, and no gonna ge o ended i i doesn' i my wo ld iew( o lack o wo ld iew). They ell me ea h is doomed, I don' ca e!  Que Se a, Se a (Wha e e Will Be, Will Be).\n\n\n \n I don' know any hing, and I don' wanna know any hing. E e y hing s a ed om no hing, so he only ue eali y is no hing. Medi a e on no hing--be no hing! No hing is e e y hing, when you become no hing, you a e e e y hing, you know e e y hing. No hing o i ! \n\n\n \n Yeah, ge ha pas he ego il e s. \n \nF-S\nOn Wed, Aug 3, 2011 a 6:29 PM, nena. azma a@...> w o e:\n\n  \n\n\n\nI we a e no supposed o ha e access hen why don' hey jus push block and dele e? Some imes. I hink hey a e all insane on he o he side. F ankly I am a bi disappoin ed ha hea en has a ing one and hey sing he wo d \"hea en\" o e and o e again. I can' say ha I am looking o wa d o wha e e lies beyond his mess.\n\nSen ia BlackBe y om T-Mobile"}