{"id": "21845", "subject": "semi new", "author": "Vicky Cox", "timestamp": "2011-08-05T16:22:26Z", "full_text": "Hello. I&#39;m sort of new to the group. I&#39;ve been observing but not posting\nmuch. Most of my experiences have been personal and I have decided to take\nit up a notch and join a group. My trouble has been that most groups I have\nencountered are simply unorganized or unmotivated (in it for the t-shirts).\nI went with a group recently to an old cabin for what turned out to be an\nhour and a half investigation. I got around 8 EVPs, some photos, and a\ncouple of noise responses on my recorder. My first attempt with a flash\nlight got me a half an hour worth of consistent responses. When I got my\nfirst recorder I got 3 EVPs while reading the instructions. I&#39;m a magnet and\nfor the first time in my life it doesn&#39;t scare me. What does scare me is\nthat my kids are just as effected. So I want to learn as much as I can on an\ninteractive level so I can not only educate myself but protect my kids. Is\nanyone in the Toledo area interested in doing investigations?\n\nHere is my personal page. It&#39;s a freebie website that I recently started to\norganize some of my evidence. Don&#39;t mind the construction. But here&#39;s a link\nto my EVPs on my recent investigation I mentioned above. I very much would\nappreciate any feedback or comments.\n\nclick here to see me recent\nevps&lt;http://paranormalfindings.weebly.com/see-all-evps.html&gt;\n\nI would like to also know if anyone is familiar with the name &quot;Attoy&quot; (guess\nof spelling)\n\nI recently tried communicating on a box I got off of Ebay. I asked for a\nname and heard &quot;toy&quot;. I asked again and I again heard &quot;toy&quot;.\nI didn&#39;t think much of it until later that day my 2 year old climbs on my\nlap, looks at an empty space, gets very excited, starts waving and says &quot;toy\na toy&quot;\nI later asked my 3 year old if she knew anybody named &quot;toy&quot; and she\ncorrected me by saying &quot;Atoy. He&#39;s a boy.&quot; I asked her how old he was. She\nlooked confused for a second and replied &quot;He&#39;s still 4.&quot; She said he&#39;s\nhappy, not sick, little like her, and only says nice words. When I asked her\nwhere she met him she replied &quot;the living room.&quot; When I asked her how long\nhe&#39;s been there she unhesitatingly began to reply &quot;5 years&quot; but only said &quot;5\nye&quot; She doesn&#39;t understand the concept of a year. She did say he&#39;s been\nthere as long as she can remember. I can remember my older daughter in a\nprevious house smiling and saying &quot;hi&quot; to nothing as a baby. I have EVP&#39;s of\nbreaths from the house as well. They all sound like children. One I have is\nof what I believe to be cheyne stokes. I only recognized this because I&#39;m a\nnurse. It&#39;s a particular breathing pattern that people sometimes have with\nimminent death. I would appreciate any suggestions on how to communicate\nmore with him.\n\n\n-- \nVicky\n\n\n-- \nVicky\n\nHello. I'm so o new o he g oup. I' e been obse ing bu no pos ing much. Mos o my expe iences ha e been pe sonal and I ha e decided o ake i up a no ch and join a g oup. My ouble has been ha mos g oups I ha e encoun e ed a e simply uno ganized o unmo i a ed (in i o he -shi s). I wen wi h a g oup ecen ly o an old cabin o wha u ned ou o be an hou and a hal in es iga ion. I go a ound 8 EVPs, some pho os, and a couple o noise esponses on my eco de . My i s a emp wi h a lash ligh go me a hal an hou wo h o consis en esponses. When I go my i s eco de I go 3 EVPs while eading he ins uc ions. I'm a magne and o he i s ime in my li e i doesn' sca e me. Wha does sca e me is ha my kids a e jus as e ec ed. So I wan o lea n as much as I can on an in e ac i e le el so I can no only educa e mysel bu p o ec my kids. Is anyone in he Toledo a ea in e es ed in doing in es iga ions?\n\n \nHe e is my pe sonal page. I 's a eebie websi e ha I ecen ly s a ed o o ganize some o my e idence. Don' mind he cons uc ion. Bu he e's a link o my EVPs on my ecen in es iga ion I men ioned abo e. I e y much would app ecia e any eedback o commen s.\n\n \nclick he e o see me ecen e ps\n \nI would like o also know i anyone is amilia wi h he name \"A oy\" (guess o spelling)\n \nI ecen ly ied communica ing on a box I go o o Ebay. I asked o a name and hea d \" oy\". I asked again and I again hea d \" oy\".\nI didn' hink much o i un il la e ha day my 2 yea old climbs on my lap, looks a an emp y space, ge s e y exci ed, s a s wa ing and says \" oy a oy\"\nI la e asked my 3 yea old i she knew anybody named \" oy\" and she co ec ed me by saying \"A oy. He's a boy.\" I asked he how old he was. She looked con used o a second and eplied \"He's s ill 4.\" She said he's happy, no sick, li le like he , and only says nice wo ds. When I asked he whe e she me him she eplied \" he li ing oom.\" When I asked he how long he's been he e she unhesi a ingly began o eply \"5 yea s\" bu only said \"5 ye\" She doesn' unde s and he concep o a yea . She did say he's been he e as long as she can emembe . I can emembe my olde daugh e in a p e ious house smiling and saying \"hi\" o no hing as a baby. I ha e EVP's o b ea hs om he house as well. They all sound like child en. One I ha e is o wha I belie e o be cheyne s okes. I only ecognized his because I'm a nu se. I 's a pa icula b ea hing pa e n ha people some imes ha e wi h imminen dea h. I would app ecia e any sugges ions on how o communica e mo e wi h him. \n\n-- Vicky-- Vicky"}