{"id": "21887", "subject": "Re: [EVP-ITC] Activity?", "author": "Zack Widup", "timestamp": "2011-08-15T16:19:53Z", "full_text": "I&#39;m not in it to be scared; I&#39;m in it to hopefully learn something. I don&#39;t\nscare easily.\n\nI have tried for dozens, maybe hundreds of hours to get an EVP recording at\nmy home with a regular digital voice recorder. I have never gotten a peep\nthere that way. I have also tried in locations that would not be suspect of\nbeing haunted, like random open country roads and fields. I never got\nanything in those either.  I have gotten many EVP&#39;s in cemeteries and in\nsome buildings that were supposedly haunted. This makes me think that this\nmethod does tap into something that is localized and exists only in small\nareas.\n\nI guess my house isn&#39;t one of those locations.\n:-(\n\nI have gotten names on EVP&#39;s a few times and in each case the name could be\nassociated with the location from past records (newspapers, hospital\nrecords, etc.) These were names of real people long dead.\n\nThe radio scanning boxes may tap into a different kind of entity. I don&#39;t\nknow. But my experiences indicate that &quot;ghosts&quot; do only inhabit certain\nsmall areas and they do not go outside those areas.\n\nZack\n\n\nOn Mon, Aug 15, 2011 at 10:57 AM, purplespacefriend &lt;\npurplealiengirl@...&gt; wrote:\n\n&gt; **\n&gt;\n&gt;\n&gt; I don&#39;t mean paranormal activity, I mean--875 members and no one texting. I\n&gt; think most are ghost hunters or &quot;investigators&quot; and waitng for something\n&gt; scary to happen.\n&gt;\n&gt; If you want to &quot;investigate&quot; EVP, try staying home and recording. All the\n&gt; fears about demons and what not entering your home is pure BS! I&#39;ve been\n&gt; doing ths stuff since 2000, don&#39;t go the bogus haunted hot spot, record at\n&gt; home almost daily as I test my junk, no frikkin&#39; problems! Fro the most part\n&gt; spirits, and the various entities exist in a higher level or demension, they\n&gt; have full access to us anyway, there are no &quot;portals&quot;.\n&gt;\n&gt; Yeah, I know, might as tell it to my dogs!\n&gt;\n&gt; F-S\n&gt;\n&gt;  \n&gt;\n\nI'm no in i o be sca ed; I'm in i o hope ully lea n some hing. I don' sca e easily.I ha e ied o dozens, maybe hund eds o hou s o ge an EVP eco ding a my home wi h a egula digi al oice eco de . I ha e ne e go en a peep he e ha way. I ha e also ied in loca ions ha would no be suspec o being haun ed, like andom open coun y oads and ields. I ne e go any hing in hose ei he .  I ha e go en many EVP's in ceme e ies and in some buildings ha we e supposedly haun ed. This makes me hink ha his me hod does ap in o some hing ha is localized and exis s only in small a eas.\nI guess my house isn' one o hose loca ions.\n:-(\n\nI ha e go en names on EVP's a ew imes and in each case he name could be associa ed wi h he loca ion om pas eco ds (newspape s, hospi al eco ds, e c.) These we e names o eal people long dead.The adio scanning boxes may ap in o a di e en kind o en i y. I don' know. Bu my expe iences indica e ha \"ghos s\" do only inhabi ce ain small a eas and hey do no go ou side hose a eas.\nZackOn Mon, Aug 15, 2011 a 10:57 AM, pu plespace iend pu plealiengi l@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n I don' mean pa ano mal ac i i y, I mean--875 membe s and no one ex ing. I hink mos a e ghos hun e s o \"in es iga o s\" and wai ng o some hing sca y o happen. \n\nI you wan o \"in es iga e\" EVP, y s aying home and eco ding. All he ea s abou demons and wha no en e ing you home is pu e BS! I' e been doing hs s u since 2000, don' go he bogus haun ed ho spo , eco d a home almos daily as I es my junk, no ikkin' p oblems! F o he mos pa spi i s, and he a ious en i ies exis in a highe le el o demension, hey ha e ull access o us anyway, he e a e no \"po als\".\n\n\nYeah, I know, migh as ell i o my dogs! \n\nF-S"}