{"id": "21896", "subject": "EVP Maker recording", "author": "Jamie Churchill", "timestamp": "2011-08-17T17:59:36Z", "full_text": "Here&#39;s a recording I made with EVP Maker using a sound file that was\noriginally created for learning a foreign language. I don&#39;t know what\nlanguage it is. You can hear my dog in the background panting and shaking.\nHe has tags on his collar that rattle when he shakes. You can also hear\nbirds outside where I had my window open, but that&#39;s not until near the end.\n\nHere&#39;s what I think I can hear so far. Comments are welcome!\n\n:02 Yeah, Bob&#39;s in here (my father-in-law and brother-in-law, both deceased,\nare named Bob)\n:11 It&#39;s on the topic\n:25 Ghost box (this is a spoken EVP, not in the original recording)\n:42 It&#39;s a secret from ... (i don&#39;t understand the rest)\n1:07 It predicted in...(don&#39;t understand)\n1:25 Throw out this box! (this is a spoken EVP, not in the original\nrecording.)\n\nI&#39;ll be doing more of these to see what I can get. I have another one I\nhaven&#39;t analyzed yet, but I&#39;ll post it soon.\n\nJamie\n\n\n-- \nPlease consider the environment before printing this e-mail.\n\nHe e's a eco ding I made wi h EVP Make using a sound ile ha was o iginally c ea ed o lea ning a o eign language. I don' know wha language i is. You can hea my dog in he backg ound pan ing and shaking. He has ags on his colla ha a le when he shakes. You can also hea bi ds ou side whe e I had my window open, bu ha 's no un il nea he end.\nHe e's wha I hink I can hea so a . Commen s a e welcome!:02 Yeah, Bob's in he e (my a he -in-law and b o he -in-law, bo h deceased, a e named Bob):11 I 's on he opic\n:25 Ghos box ( his is a spoken EVP, no in he o iginal eco ding):42 I 's a sec e om ... (i don' unde s and he es )1:07 I p edic ed in...(don' unde s and)1:25 Th ow ou his box! ( his is a spoken EVP, no in he o iginal eco ding.)\nI'll be doing mo e o hese o see wha I can ge . I ha e ano he one I ha en' analyzed ye , bu I'll pos i soon.Jamie-- \nPlease conside he\nen i onmen be o e p in ing his e-mail."}