{"id": "21890", "subject": "Re: Activity?", "author": "purplespacefriend", "timestamp": "2011-08-17T06:24:47Z", "full_text": "Most I get exposed to are ghost hunter types, they seem to only want the fear, and refuse to use this stuff at home---with the lights on. \n\nF-S\n\n\n--- In EVP-ITC@yahoogroups.com, Zack Widup &lt;w9sz.zack@...&gt; wrote:\n&gt;\n&gt; I&#39;m not in it to be scared; I&#39;m in it to hopefully learn something. I don&#39;t\n&gt; scare easily.\n&gt; \n&gt; I have tried for dozens, maybe hundreds of hours to get an EVP recording at\n&gt; my home with a regular digital voice recorder. I have never gotten a peep\n&gt; there that way. I have also tried in locations that would not be suspect of\n&gt; being haunted, like random open country roads and fields. I never got\n&gt; anything in those either.  I have gotten many EVP&#39;s in cemeteries and in\n&gt; some buildings that were supposedly haunted. This makes me think that this\n&gt; method does tap into something that is localized and exists only in small\n&gt; areas.\n&gt; \n&gt; I guess my house isn&#39;t one of those locations.\n&gt; :-(\n&gt; \n&gt; I have gotten names on EVP&#39;s a few times and in each case the name could be\n&gt; associated with the location from past records (newspapers, hospital\n&gt; records, etc.) These were names of real people long dead.\n&gt; \n&gt; The radio scanning boxes may tap into a different kind of entity. I don&#39;t\n&gt; know. But my experiences indicate that &quot;ghosts&quot; do only inhabit certain\n&gt; small areas and they do not go outside those areas.\n&gt; \n&gt; Zack\n&gt; \n&gt; \n&gt; On Mon, Aug 15, 2011 at 10:57 AM, purplespacefriend &lt;\n&gt; purplealiengirl@...&gt; wrote:\n&gt; \n&gt; &gt; **\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; I don&#39;t mean paranormal activity, I mean--875 members and no one texting. I\n&gt; &gt; think most are ghost hunters or &quot;investigators&quot; and waitng for something\n&gt; &gt; scary to happen.\n&gt; &gt;\n&gt; &gt; If you want to &quot;investigate&quot; EVP, try staying home and recording. All the\n&gt; &gt; fears about demons and what not entering your home is pure BS! I&#39;ve been\n&gt; &gt; doing ths stuff since 2000, don&#39;t go the bogus haunted hot spot, record at\n&gt; &gt; home almost daily as I test my junk, no frikkin&#39; problems! Fro the most part\n&gt; &gt; spirits, and the various entities exist in a higher level or demension, they\n&gt; &gt; have full access to us anyway, there are no &quot;portals&quot;.\n&gt; &gt;\n&gt; &gt; Yeah, I know, might as tell it to my dogs!\n&gt; &gt;\n&gt; &gt; F-S\n&gt; &gt;\n&gt; &gt;  \n&gt; &gt;\n&gt;"}