{"id": "21906", "subject": "Re: [EVP-ITC] Re: legal issue?", "author": "Zack Widup", "timestamp": "2011-08-18T20:51:27Z", "full_text": "It&#39;s that other 10% that I&#39;m after!\n:-)\n\nTwice now I have gotten names given to me in an EVP. Both names are not\nnames I was familiar with, nor would I have pulled them out of the air\nmyself. Both names were unheard of to every member of the group present. And\nboth names, after a somewhat extensive search of the history of the sites,\nturned out to be real names of real people who had lived or died in those\nlocations in the past.\n\nHow would you explain that? I think they fit that other 10%.\n\nZack\n\n\nOn Thu, Aug 18, 2011 at 3:43 PM, purplespacefriend &lt;\npurplealiengirl@...&gt; wrote:\n\n&gt; **\n&gt;\n&gt;\n&gt;\n&gt; If you read my posts you&#39;ll know I think these so called &quot;investigations&quot;\n&gt; are a complete waste of time since 90% of the evidence is based on\n&gt; seggestion, and you can create the phenomenon you want to experience. I\n&gt; don&#39;t do investigations, and don&#39;t go to haunted hot spots to get EVPS.\n&gt; &quot;They&quot; will come to you, spirits and entities are everywhere, they travel\n&gt; it&#39;s not dangerous, and there are no portals. Most do these ghost hunts for\n&gt; a fear rush. Why else would ya do this crap in the dark--so ya can sneak up\n&gt; on ghost?\n&gt;\n&gt;\n\nI 's ha o he 10% ha I'm a e !:-)Twice now I ha e go en names gi en o me in an EVP. Bo h names a e no names I was amilia wi h, no would I ha e pulled hem ou o he ai mysel . Bo h names we e unhea d o o e e y membe o he g oup p esen . And bo h names, a e a somewha ex ensi e sea ch o he his o y o he si es, u ned ou o be eal names o eal people who had li ed o died in hose loca ions in he pas .\nHow would you explain ha ? I hink hey i ha o he 10%.ZackOn Thu, Aug 18, 2011 a 3:43 PM, pu plespace iend pu plealiengi l@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n \nI you ead my pos s you'll know I hink hese so called \"in es iga ions\" a e a comple e was e o ime since 90% o he e idence is based on segges ion, and you can c ea e he phenomenon you wan o expe ience. I don' do in es iga ions, and don' go o haun ed ho spo s o ge EVPS. \"They\" will come o you, spi i s and en i ies a e e e ywhe e, hey a el i 's no dange ous, and he e a e no po als. Mos do hese ghos hun s o a ea ush. Why else would ya do his c ap in he da k--so ya can sneak up on ghos ?"}