{"id": "21904", "subject": "Re: legal issue?", "author": "purplespacefriend", "timestamp": "2011-08-18T20:43:33Z", "full_text": "I say lets see what a judge says. Any legal action over something on the internet highly unlikely. Besides, you could counter sue and win for harrassment. I&#39;ve gotten threats like that before from people that charge big bucks for box access. Same old stupid ego crap I have heard/read from alot of these so called paranormal investigastors, most are fakes frauds and con men. \n\n If you read my posts you&#39;ll know I think these so called  &quot;investigations&quot; are a complete waste of time since 90% of the evidence is based on seggestion, and you can create the phenomenon you want to experience. I don&#39;t do investigations, and don&#39;t go to haunted hot spots to get EVPS. &quot;They&quot; will come to you, spirits and entities are everywhere, they travel it&#39;s not dangerous, and there are no portals. Most do these ghost hunts for a fear rush. Why else would ya do this crap in the dark--so ya can sneak up on ghost? \n\n BTW, my grandson plays with boxes-he&#39;s 10--no harm, no threats, no demons, no portals, no Chuckie dolls running around the house....\n\n Yeah, I know, might as well tell it to my dogs!\n\nF-S\n\n--- In EVP-ITC@yahoogroups.com, Vicky Cox &lt;vickyw222@...&gt; wrote:\n&gt;\n&gt; I have a legal question that I cannot seem to find an answer to. I recently\n&gt; went on an investigation to a public place with a  paranormal group. While\n&gt; my experience is much less than theirs, I found them to be too disorganized.\n&gt; Three people came from the group. One had no equipment and the second used\n&gt; his cell phone. I never even saw a pencil. So, I started a small group,\n&gt; specifically for amateur investigators staying in local public places so we\n&gt; don&#39;t get in over our heads. We aren&#39;t trying to get any resident\n&gt; investigations and are non competitive. On our site I put photos and evps I\n&gt; had gotten while on the investigation and put at the bottom that some\n&gt; evidence was obtained while on investigations with other groups. I didn&#39;t\n&gt; use any of their names. As with any of my photos, I blocked out any faces,\n&gt; and it was all on my equipment. I signed nothing and agreed to nothing.\n&gt; Yesterday he sent me an email saying he wants it taken down. It&#39;s\n&gt; technically and legally his ( technically and legally?). If I wanted to\n&gt; start my own group all I had to do was ask. He has said that I invited a 16\n&gt; year old to join the group (Definitely didn&#39;t). And that he thought I would\n&gt; join their group.\n&gt; -I don&#39;t believe he&#39;s right on the legal issue. Ethically, I would have\n&gt; accredited the group if he was more diplomatic and maybe even taken it down.\n&gt; \n&gt; - wouldn&#39;t making false accusations make him guilty of liable?\n&gt; - I don&#39;t need to ask him to do ****. I&#39;ve met him twice.\n&gt; \n&gt; Does anybody know of any place where I can find something written on the law\n&gt; about those photos and media being mine.\n&gt; \n&gt; -- \n&gt; Vicky\n&gt;"}