{"id": "21900", "subject": "Re: [EVP-ITC] legal issue?", "author": "M K", "timestamp": "2011-08-18T14:12:25Z", "full_text": "--0-1438236176-1313676745=:15864\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nGreetings Vicky-\n=C2=A0\nI can clear this up for you. Unless you signed a le=\r\ngal contract (reason I say legal is a contract must follow a specific forma=\r\nt to be binding), the pictures are yours. \nWithout getting too deep, ethica=\r\nlly the previous group may ask that you credit that group as it was their i=\r\nnvestigation. Example Photo Property of Vicky Cox, formerly of USA Ghost Hu=\r\nnters. This is your choice, and as they are being turds, I=E2=80=99d tell t=\r\nhem to pound sand. Keep in mind, some clients may have you sign a non-discl=\r\nosure contract, meaning that no evidence may be posted without written cons=\r\nent of the client. \nAlso, although photos taken are yours, if you post them=\r\n publically without a legal Copyright tag, or statement such as =E2=80=9CNo=\r\n photo may be copied or reproduced without written consent of Vicky Cox,=E2=\r\n=80=9D you risk anyone copying and pasting them for their own use without p=\r\nermission or acknowledgement to you. And even if you do Copyright, etc. peo=\r\nple still will do this.\nBottom line, it=E2=80=99s ghost hunting, not rocket=\r\n science. Hope that helped. \n\nMichael aka The Ghost Gadget Guy\nwww.ghostgad=\r\ngetguy.com\n\n&quot;How often have I said to you that when you have eliminated the=\r\n impossible, whatever remains, however improbable, must be the truth?&quot; Sher=\r\nlock Holmes-Sir Arthur Conan Doyle\n\n--- On Thu, 8/18/11, Vicky Cox &lt;vickyw2=\r\n22@...&gt; wrote:\n\n\nFrom: Vicky Cox &lt;vickyw222@...&gt;\nSubject: [EVP-=\r\nITC] legal issue?\nTo: EVP-ITC@yahoogroups.com\nDate: Thursday, August 18, 20=\r\n11, 1:32 PM\n\n\n=C2=A0 \n\n\n\n\nI have a legal question that I cannot seem to fin=\r\nd an answer to. I recently went on an investigation to a public place with =\r\na=C2=A0 paranormal group. While my experience is much less than theirs, I f=\r\nound them to be too disorganized. Three people=C2=A0came from the group. On=\r\ne had no equipment and the second used his cell phone.=C2=A0I never even sa=\r\nw a pencil.=C2=A0So, I started a small group, specifically for=C2=A0amateur=\r\n investigators staying in local public places so we don&#39;t get in over our h=\r\neads. We aren&#39;t trying to get any resident investigations and are non compe=\r\ntitive. On our site I put photos and evps I had gotten while on the investi=\r\ngation and put at the bottom that some evidence was obtained while on inves=\r\ntigations with other groups. I didn&#39;t use any of their names. As with any o=\r\nf my photos, I blocked out any faces, and it was all on my equipment. I sig=\r\nned nothing and agreed to nothing.\nYesterday he sent me an email saying he =\r\nwants it taken down. It&#39;s technically and legally his ( technically and leg=\r\nally?). If I wanted to start my own group all I had to do was ask. He has s=\r\naid that I invited a 16 year old to join the group (Definitely didn&#39;t). And=\r\n that he thought I would join their group.\n-I don&#39;t believe he&#39;s right on t=\r\nhe legal issue. Ethically, I would have accredited the group if he was more=\r\n diplomatic and maybe even taken it down. \n- wouldn&#39;t making false accusati=\r\nons make him guilty of liable?\n- I don&#39;t need to ask him to do ****. I&#39;ve m=\r\net him twice.\n=C2=A0\nDoes anybody know of any place where I can find someth=\r\ning written on the law about those photos and media being mine.\n\n-- \nVicky\n=\r\n\n\n\n\n\n\r\n--0-1438236176-1313676745=:15864\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;DIV&gt;Greetings Vicky-&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;=\r\n\n&lt;P class=3DMsoNormal style=3D&quot;MARGIN: 0in 0in 10pt&quot;&gt;&lt;SPAN style=3D&quot;FONT-SI=\r\nZE: 10pt; LINE-HEIGHT: 115%; FONT-FAMILY: &#39;Arial&#39;,&#39;sans-serif&#39;&quot;&gt;I can clear=\r\n this up for you. Unless you signed a legal contract (reason I say legal is=\r\n a contract must follow a specific format to be binding), the pictures are =\r\nyours. &lt;?xml:namespace prefix =3D o ns =3D &quot;urn:schemas-microsoft-com:offic=\r\ne:office&quot; /&gt;&lt;o:p&gt;&lt;/o:p&gt;&lt;/SPAN&gt;&lt;/DIV&gt;\n&lt;P class=3DMsoNormal style=3D&quot;MARGIN: =\r\n0in 0in 10pt&quot;&gt;&lt;SPAN style=3D&quot;FONT-SIZE: 10pt; LINE-HEIGHT: 115%; FONT-FAMIL=\r\nY: &#39;Arial&#39;,&#39;sans-serif&#39;&quot;&gt;Without getting too deep, ethically the previous g=\r\nroup may ask that you credit that group as it was their investigation. Exam=\r\nple Photo Property of Vicky Cox, formerly of USA Ghost Hunters. This is you=\r\nr choice, and as they are being turds, I=E2=80=99d tell them to pound sand.=\r\n Keep in mind, some clients may have you sign a non-disclosure contract, me=\r\naning that no evidence may be posted without written consent of the client.=\r\n &lt;o:p&gt;&lt;/o:p&gt;&lt;/SPAN&gt;&lt;/DIV&gt;\n&lt;P class=3DMsoNormal style=3D&quot;MARGIN: 0in 0in 10p=\r\nt&quot;&gt;&lt;SPAN style=3D&quot;FONT-SIZE: 10pt; LINE-HEIGHT: 115%; FONT-FAMILY: &#39;Arial&#39;,=\r\n&#39;sans-serif&#39;&quot;&gt;Also, although photos taken are yours, if you post them publi=\r\ncally without a legal Copyright tag, or statement such as =E2=80=9CNo photo=\r\n may be copied or reproduced without written consent of Vicky Cox,=E2=80=9D=\r\n you risk anyone copying and pasting them for their own use without permiss=\r\nion or acknowledgement to you. And even if you do Copyright, etc. people st=\r\nill will do this.&lt;o:p&gt;&lt;/o:p&gt;&lt;/SPAN&gt;&lt;/DIV&gt;\n&lt;P class=3DMsoNormal style=3D&quot;MAR=\r\nGIN: 0in 0in 10pt&quot;&gt;&lt;SPAN style=3D&quot;FONT-SIZE: 10pt; LINE-HEIGHT: 115%; FONT-=\r\nFAMILY: &#39;Arial&#39;,&#39;sans-serif&#39;&quot;&gt;Bottom line, it=E2=80=99s ghost hunting, not =\r\nrocket science. Hope that helped. &lt;/SPAN&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;Michael aka The Gh=\r\nost Gadget Guy&lt;BR&gt;www.ghostgadgetguy.com&lt;BR&gt;&lt;BR&gt;&quot;How often have I said to y=\r\nou that when you have eliminated the impossible, whatever remains, however =\r\nimprobable, must be the truth?&quot; Sherlock Holmes-Sir Arthur Conan Doyle&lt;BR&gt;&lt;=\r\nBR&gt;--- On &lt;B&gt;Thu, 8/18/11, Vicky Cox &lt;I&gt;&lt;vickyw222@...&gt;&lt;/I&gt;&lt;/B&gt;=\r\n wrote:&lt;BR&gt;&lt;/DIV&gt;\n&lt;BLOCKQUOTE style=3D&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px;=\r\n BORDER-LEFT: rgb(16,16,255) 2px solid&quot;&gt;&lt;BR&gt;From: Vicky Cox &lt;vickyw222@g=\r\nmail.com&gt;&lt;BR&gt;Subject: [EVP-ITC] legal issue?&lt;BR&gt;To: EVP-ITC@yahoogroups.=\r\ncom&lt;BR&gt;Date: Thursday, August 18, 2011, 1:32 PM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3Dyiv318407=\r\n696&gt;&lt;SPAN style=3D&quot;DISPLAY: none&quot;&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV id=3Dyiv318407696ygrp=\r\n-text&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;I have a legal question that I cannot seem to find an ans=\r\nwer to. I recently went on an investigation to a public place with a&nbsp; =\r\nparanormal group. While my experience is much less than theirs, I found the=\r\nm to be too disorganized. Three people&nbsp;came from the group. One had no=\r\n equipment and the second used his cell phone.&nbsp;I never even saw a penc=\r\nil.&nbsp;So, I started a small group, specifically for&nbsp;amateur investi=\r\ngators staying in local public places so we don&#39;t get in over our heads. We=\r\n aren&#39;t trying to get any resident investigations and are non competitive. =\r\nOn our site I put photos and evps I had gotten while on the investigation a=\r\nnd put at the bottom that some evidence was obtained while on investigation=\r\ns with other groups. I didn&#39;t use any of their names. As with any of my pho=\r\ntos, I blocked out any faces, and it was all on my equipment. I signed noth=\r\ning and agreed to nothing.&lt;/DIV&gt;\n&lt;DIV&gt;Yesterday he sent me an email saying =\r\nhe wants it taken down. It&#39;s technically and legally his ( technically and =\r\nlegally?). If I wanted to start my own group all I had to do was ask. He ha=\r\ns said that I invited a 16 year old to join the group (Definitely didn&#39;t). =\r\nAnd that he thought I would join their group.&lt;/DIV&gt;\n&lt;DIV&gt;-I don&#39;t believe h=\r\ne&#39;s right on the legal issue. Ethically, I would have accredited the group =\r\nif he was more diplomatic and maybe even taken it down. &lt;/DIV&gt;\n&lt;DIV&gt;- would=\r\nn&#39;t making false accusations make him guilty of liable?&lt;/DIV&gt;\n&lt;DIV&gt;- I don&#39;=\r\nt need to ask him to do ****. I&#39;ve met him twice.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;=\r\nDIV&gt;Does anybody know of any place where I can find something written on th=\r\ne law about those photos and media being mine.&lt;BR clear=3Dall&gt;&lt;BR&gt;-- &lt;BR&gt;Vi=\r\ncky&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;\r\n--0-1438236176-1313676745=:15864--"}