{"id": "21911", "subject": "Re: [EVP-ITC] Re: legal issue?", "author": "Zack Widup", "timestamp": "2011-08-19T03:51:51Z", "full_text": "Best advice I&#39;ve seen yet.\n;-)\n\nZack\n\n\nOn 8/18/11, Urkel23 &lt;urkel23@...&gt; wrote:\n&gt;\n&gt; Is your photos and audio so good that it&#39;s worth fighting over?  Get your\n&gt; new group going and start posting new stuff from that.  Forget about the\n&gt; other stuff for now, you still have it on your computer if you want to\n&gt; listen to it.\n&gt;\n&gt; Take it down and re-post it in 6 months when they forgotton about it.\n&gt;\n&gt; -Steve\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, Vicky Cox &lt;vickyw222@...&gt; wrote:\n&gt;&gt;\n&gt;&gt; I have a legal question that I cannot seem to find an answer to. I\n&gt;&gt; recently\n&gt;&gt; went on an investigation to a public place with a  paranormal group. While\n&gt;&gt; my experience is much less than theirs, I found them to be too\n&gt;&gt; disorganized.\n&gt;&gt; Three people came from the group. One had no equipment and the second used\n&gt;&gt; his cell phone. I never even saw a pencil. So, I started a small group,\n&gt;&gt; specifically for amateur investigators staying in local public places so\n&gt;&gt; we\n&gt;&gt; don&#39;t get in over our heads. We aren&#39;t trying to get any resident\n&gt;&gt; investigations and are non competitive. On our site I put photos and evps\n&gt;&gt; I\n&gt;&gt; had gotten while on the investigation and put at the bottom that some\n&gt;&gt; evidence was obtained while on investigations with other groups. I didn&#39;t\n&gt;&gt; use any of their names. As with any of my photos, I blocked out any faces,\n&gt;&gt; and it was all on my equipment. I signed nothing and agreed to nothing.\n&gt;&gt; Yesterday he sent me an email saying he wants it taken down. It&#39;s\n&gt;&gt; technically and legally his ( technically and legally?). If I wanted to\n&gt;&gt; start my own group all I had to do was ask. He has said that I invited a\n&gt;&gt; 16\n&gt;&gt; year old to join the group (Definitely didn&#39;t). And that he thought I\n&gt;&gt; would\n&gt;&gt; join their group.\n&gt;&gt; -I don&#39;t believe he&#39;s right on the legal issue. Ethically, I would have\n&gt;&gt; accredited the group if he was more diplomatic and maybe even taken it\n&gt;&gt; down.\n&gt;&gt;\n&gt;&gt; - wouldn&#39;t making false accusations make him guilty of liable?\n&gt;&gt; - I don&#39;t need to ask him to do ****. I&#39;ve met him twice.\n&gt;&gt;\n&gt;&gt; Does anybody know of any place where I can find something written on the\n&gt;&gt; law\n&gt;&gt; about those photos and media being mine.\n&gt;&gt;\n&gt;&gt; --\n&gt;&gt; Vicky\n&gt;&gt;\n&gt;\n&gt;\n&gt;"}