{"id": "21912", "subject": "Re: [EVP-ITC] Re: legal issue?", "author": "Vicky Cox", "timestamp": "2011-08-19T11:03:32Z", "full_text": "I left the page but removed the link from the page. I saw 2 pictures that\nthey got and I couldn&#39;t even begin to see what they say they saw. The group\nhas been around for about 5 years. It took them months to get together for\nthis investigation and not only did they have NO history on the place they\nstill couldn&#39;t tell me the name of it. BTW It&#39;s called the Monroe County\nMichigan Museum Navarre Anderson Trading Post Complex\nhttp://historicmonroe.org/muse um-navarre-anderson-traiding-p\nost-complex/country-store-site -structures.htm\nIt&#39;s the oldest wooden structure in Michigan and the rules state that you\nmay not stay there overnight but mention nothing about being there\novernight.\nHere&#39;s the evidence:\n\nhttp://paranormalarcheologysurveyteam.weebly.com/evps-1-10.html\n\nOn Thu, Aug 18, 2011 at 9:46 PM, Urkel23 &lt;urkel23@aol.com&gt; wrote:\n\n&gt; **\n&gt;\n&gt;\n&gt;\n&gt; Is your photos and audio so good that it&#39;s worth fighting over? Get your\n&gt; new group going and start posting new stuff from that. Forget about the\n&gt; other stuff for now, you still have it on your computer if you want to\n&gt; listen to it.\n&gt;\n&gt; Take it down and re-post it in 6 months when they forgotton about it.\n&gt;\n&gt; -Steve\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, Vicky Cox &lt;vickyw222@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; I have a legal question that I cannot seem to find an answer to. I\n&gt; recently\n&gt; &gt; went on an investigation to a public place with a paranormal group. While\n&gt; &gt; my experience is much less than theirs, I found them to be too\n&gt; disorganized.\n&gt; &gt; Three people came from the group. One had no equipment and the second\n&gt; used\n&gt; &gt; his cell phone. I never even saw a pencil. So, I started a small group,\n&gt; &gt; specifically for amateur investigators staying in local public places so\n&gt; we\n&gt; &gt; don&#39;t get in over our heads. We aren&#39;t trying to get any resident\n&gt; &gt; investigations and are non competitive. On our site I put photos and evps\n&gt; I\n&gt; &gt; had gotten while on the investigation and put at the bottom that some\n&gt; &gt; evidence was obtained while on investigations with other groups. I didn&#39;t\n&gt; &gt; use any of their names. As with any of my photos, I blocked out any\n&gt; faces,\n&gt; &gt; and it was all on my equipment. I signed nothing and agreed to nothing.\n&gt; &gt; Yesterday he sent me an email saying he wants it taken down. It&#39;s\n&gt; &gt; technically and legally his ( technically and legally?). If I wanted to\n&gt; &gt; start my own group all I had to do was ask. He has said that I invited a\n&gt; 16\n&gt; &gt; year old to join the group (Definitely didn&#39;t). And that he thought I\n&gt; would\n&gt; &gt; join their group.\n&gt; &gt; -I don&#39;t believe he&#39;s right on the legal issue. Ethically, I would have\n&gt; &gt; accredited the group if he was more diplomatic and maybe even taken it\n&gt; down.\n&gt; &gt;\n&gt; &gt; - wouldn&#39;t making false accusations make him guilty of liable?\n&gt; &gt; - I don&#39;t need to ask him to do ****. I&#39;ve met him twice.\n&gt; &gt;\n&gt; &gt; Does anybody know of any place where I can find something written on the\n&gt; law\n&gt; &gt; about those photos and media being mine.\n&gt; &gt;\n&gt; &gt; --\n&gt; &gt; Vicky\n&gt; &gt;\n&gt;\n&gt; \n&gt;\n\n\n\n-- \nVicky\n\nI le he page bu emo ed he link om he page. I saw 2 pic u es ha hey go and I couldn' e en begin o see wha hey say hey saw. The g oup has been a ound o abou 5 yea s. I ook hem mon hs o ge oge he o his in es iga ion and no only did hey ha e NO his o y on he place hey s ill couldn' ell me he name o i . BTW I 's called he Mon oe Coun y Michigan Museum Na a e Ande son T ading Pos Complex\nh p://his o icmon oe.o g/muse um-na a e-ande son- aiding-p os -complex/coun y-s o e-si e -s uc u es.h m\nI 's he oldes wooden s uc u e in Michigan and he ules s a e ha you may no s ay he e o e nigh bu men ion no hing abou being he e o e nigh . \nHe e's he e idence:\n \nh p://pa ano mala cheologysu ey eam.weebly.com/e ps-1-10.h ml\nOn Thu, Aug 18, 2011 a 9:46 PM, U kel23 u kel23@aol.com> w o e:\n\n  \n\n\n\nIs you pho os and audio so good ha i 's wo h igh ing o e ? Ge you new g oup going and s a pos ing new s u om ha . Fo ge abou he o he s u o now, you s ill ha e i on you compu e i you wan o lis en o i .\nTake i down and e-pos i in 6 mon hs when hey o go on abou i . -S e e--- In EVP-ITC@yahoog oups.com, Vicky Cox w o e:\n>> I ha e a legal ques ion ha I canno seem o ind an answe o. I ecen ly> wen on an in es iga ion o a public place wi h a pa ano mal g oup. While> my expe ience is much less han hei s, I ound hem o be oo diso ganized.\n> Th ee people came om he g oup. One had no equipmen and he second used> his cell phone. I ne e e en saw a pencil. So, I s a ed a small g oup,> speci ically o ama eu in es iga o s s aying in local public places so we\n> don' ge in o e ou heads. We a en' ying o ge any esiden > in es iga ions and a e non compe i i e. On ou si e I pu pho os and e ps I> had go en while on he in es iga ion and pu a he bo om ha some\n> e idence was ob ained while on in es iga ions wi h o he g oups. I didn' > use any o hei names. As wi h any o my pho os, I blocked ou any aces,> and i was all on my equipmen . I signed no hing and ag eed o no hing.\n> Yes e day he sen me an email saying he wan s i aken down. I 's> echnically and legally his ( echnically and legally?). I I wan ed o> s a my own g oup all I had o do was ask. He has said ha I in i ed a 16\n> yea old o join he g oup (De ini ely didn' ). And ha he hough I would> join hei g oup.> -I don' belie e he's igh on he legal issue. E hically, I would ha e> acc edi ed he g oup i he was mo e diploma ic and maybe e en aken i down.\n> > - wouldn' making alse accusa ions make him guil y o liable?> - I don' need o ask him o do ****. I' e me him wice.> > Does anybody know o any place whe e I can ind some hing w i en on he law\n> abou hose pho os and media being mine.> > -- > Vicky>\n-- Vicky"}