{"id": "21924", "subject": "Two more EVP Maker recordings using Urkel&#39;s wave file", "author": "Jamie Churchill", "timestamp": "2011-08-25T19:36:24Z", "full_text": "Here are two recordings I made using Steve&#39;s file at\nhttp://stevehultay.com/evpsoftware.html*. *These recordings are interesting\nbecause I get several really blatant messages that seem relevant to me\npersonally, they are incredibly clear in spots, and also because it seems\nthat the responses are better heard when you play the file back at roughly\n150% of the normal speed. I haven&#39;t altered these files in any way. These\nare both stored on SoundCloud.\n\nhttp://soundcloud.com/jamietreetalker/evp-maker-082511-1000am\n\nIn this first file, done August 25, 2011 at 10:00 a.m. It seems like they&#39;re\naddressing two things: (1) my worries that something I don&#39;t like is living\nin my basement, and (2) my concern over further developing my psychic\nabilities. Before this recording, I did a protection prayer and asked that\nthe &quot;angels&#39; or beings of love and light protect me, my family, and this\nproperty.\n\n:01 Here&#39;s Tim\n:02 Will Help. You are worried. 8-0-0\n:04 Urkel hates it out here, now hell on Earth\n:08 You worried here are? Here orb stays til the end.\n:13 They made a program that failed at psi ops.\n:16 Year we are in we will get you a mess of ??\n:20 You won&#39;t be worried.\n:22 I now like ??\n:24 I think you&#39;re a little spooked.\n:26 Bedroom\n:26 I hope I&#39;m in secret.\n:28 You have sight.\n:29 There is something difficult.\n:31 I know how to help your bedroom.\n:34 might\n:35 I help people.\n:36 A lady\n:37 We help Elvis, he developed before Elton.\n:41 How to beat their demon.\n:42 You better find mark on your neck.\n:44 Transfer\n:45 We&#39;ll be down south here.\n:47 I smell air up here and sage up here in office.\n:51 You value something beautiful too late.\n:52 Come here.\n:55 Their spiteful. I&#39;ll help you there.\n:56 Put up your ?? out over there to help you a little.\n\nhttp://soundcloud.com/jamietreetalker/evp-maker-082511-1111am\n\nHere&#39;s the second recording, done at 11:11 a.m. on August 25, 2011. Before\nthis recording, I asked that they tell me who they are and to give me some\ndetail about themselves.  At :12, they say &quot;She finds our obits.&quot; This is\ntrue. I found two obituaries for the man who built this house and his\nbrother, both of whom died within the last year or so. Further on, they talk\nabout animal therapy, which I had once discussed with my husband doing with\nour two golden retrievers, both of whom were locked out of the room while I\nrecorded.\n\n:02 Well, I&#39;m here to help people out.\n:04 Here there are people that help me\n:05 They faked it. the whole outfit.\n:07 I fear the outcome.\n:09 Down stairs I hear them\n:12 She finds our obit\n:13 You have to warn people that there&#39;s a terrible quake.\n:14 The people end earth and they&#39;re worried.\n:17 They&#39;ll thank you\n:18 Yeah, he killed Elliott\n:20 You killed Ike. I fell over, I got killed. It&#39;s Earl.?\n:24 There are people in poor houses.\n:26 I am worried\n:27 Here people are in poor health.\n:29 Year ?? Ella\n:30 You might hear Hello\n:32 You bet I miss Elmo\n:34 Yeah, that&#39;s hysterical\n:35 Layed out here\n:36 Hard to deal with this\n:37 That&#39;s Bobby Adams\n:38 Wait, hear my fill\n:40 Lady, you are a therapist\n:42 Do animal therapy. Potent.\n:44 Arf! For it will help you!\n:46 Olay never helps\n:48 You pick the mutants\n:49 He&#39;ll devise it\n:50 Belarc (or Alert?)\n:51 Couldn&#39;t find any peace\n:52 They found the colitis, and yet more bills.\n:55 After disappearing\n:56 Have more people, they&#39;re mutants\n1:00 half-mind, half-people.\n\nEnjoy!\n-- \nPlease consider the environment before printing this e-mail.\n\nHe e a e wo eco dings I made using S e e's ile a  h p://s e ehul ay.com/e pso wa e.h ml. These eco dings a e in e es ing because I ge se e al eally bla an messages ha seem ele an o me pe sonally, hey a e inc edibly clea in spo s, and also because i seems ha he esponses a e be e hea d when you play he ile back a oughly 150% o he no mal speed. I ha en' al e ed hese iles in any way. These a e bo h s o ed on SoundCloud.\nh p://soundcloud.com/jamie ee alke /e p-make -082511-1000am In his i s ile, done Augus 25, 2011 a 10:00 a.m. I seems like hey' e add essing wo hings: (1) my wo ies ha some hing I don' like is li ing in my basemen , and (2) my conce n o e u he de eloping my psychic abili ies. Be o e his eco ding, I did a p o ec ion p aye and asked ha he \"angels' o beings o lo e and ligh p o ec me, my amily, and his p ope y. \n:01 He e's Tim:02 Will Help. You a e wo ied. 8-0-0:04 U kel ha es i ou he e, now hell on Ea h:08 You wo ied he e a e? He e o b s ays il he end.:13 They made a p og am ha ailed a psi ops.\n:16 Yea we a e in we will ge you a mess o ??:20 You won' be wo ied.:22 I now like ??:24 I hink you' e a li le spooked.:26 Bed oom:26 I hope I'm in sec e .\n:28 You ha e sigh .:29 The e is some hing di icul .:31 I know how o help you bed oom.:34 migh :35 I help people.:36 A lady:37 We help El is, he de eloped be o e El on.\n:41 How o bea hei demon.:42 You be e ind ma k on you neck.:44 T ans e :45 We'll be down sou h he e.:47 I smell ai up he e and sage up he e in o ice.\n:51 You alue some hing beau i ul oo la e.:52 Come he e.:55 Thei spi e ul. I'll help you he e.:56 Pu up you ?? ou o e he e o help you a li le.h p://soundcloud.com/jamie ee alke /e p-make -082511-1111am\nHe e's he second eco ding, done a 11:11 a.m. on Augus 25, 2011. Be o e his eco ding, I asked ha hey ell me who hey a e and o gi e me some de ail abou hemsel es.  A :12, hey say \"She inds ou obi s.\" This is ue. I ound wo obi ua ies o he man who buil his house and his b o he , bo h o whom died wi hin he las yea o so. Fu he on, hey alk abou animal he apy, which I had once discussed wi h my husband doing wi h ou wo golden e ie e s, bo h o whom we e locked ou o he oom while I eco ded.\n:02 Well, I'm he e o help people ou .:04 He e he e a e people ha help me:05 They aked i . he whole ou i .:07 I ea he ou come.:09 Down s ai s I hea hem\n:12 She inds ou obi :13 You ha e o wa n people ha he e's a e ible quake.:14 The people end ea h and hey' e wo ied.:17 They'll hank you:18 Yeah, he killed Ellio \n:20 You killed Ike. I ell o e , I go killed. I 's Ea l.?:24 The e a e people in poo houses.:26 I am wo ied:27 He e people a e in poo heal h.:29 Yea ?? Ella\n:30 You migh hea Hello:32 You be I miss Elmo:34 Yeah, ha 's hys e ical:35 Layed ou he e:36 Ha d o deal wi h his:37 Tha 's Bobby Adams:38 Wai , hea my ill\n:40 Lady, you a e a he apis :42 Do animal he apy. Po en .:44 A ! Fo i will help you!:46 Olay ne e helps:48 You pick he mu an s:49 He'll de ise i \n:50 Bela c (o Ale ?):51 Couldn' ind any peace:52 They ound he coli is, and ye mo e bills.:55 A e disappea ing:56 Ha e mo e people, hey' e mu an s\n1:00 hal -mind, hal -people.Enjoy!-- Please conside he\nen i onmen be o e p in ing his e-mail."}