{"id": "21928", "subject": "Re: Directed to earlier post on evps in day time and doing it in your own home....", "author": "jamietreetalker", "timestamp": "2011-08-26T01:11:21Z", "full_text": "That&#39;s very true, Rick. It is much quieter at night. Birds aren&#39;t chirping incessantly and car traffic is much quieter. Also, I think it&#39;s easier to see the spirits at night because bright daylight washes some of them out, especially if their forms are pale and not black. Also, you can&#39;t really use IR cameras or full spectrum cameras as effectively in bright sunlight. They are much better suited to dimly lit areas. HOWEVER, you CAN use an infrared lens filter over your digital camera lens to capture spirits in broad daylight, and I have seen some very good pictures of full apparitions taken in daylight with no special filters.\n\nThere are benefits to doing it both ways, I think. Certainly, EVP is the easiest to do anytime, day or night.\n\nJamie\n\n--- In EVP-ITC@yahoogroups.com, Rick Wegrzyn &lt;rickwegrzyn@...&gt; wrote:\n&gt;\n&gt; As you know I&#39;ve been in the Paranormal Scientific Field for many years and I can say this when I use 1 of F-S Boxes no matter what time of day or &quot;Night&quot; I always get comments,mostly from which it seems from the present day or even possibly the future....However for the comment for the Paranormal groups doing it in the dark for the &quot;Fear of it&quot; is incorrect for my Team and Myself.We go to cemeteries,Personal Homes and Businesses when asked for HELP due to thing that cant be explainedat night time for 1 reason...SILENCE...I recieve messages at home in the light of day with one of FS&#39;s boxes along with me Digital recorders but also dick up the outside world.I investigate at night for the reason of contamination of evidence and I have expensive nite-vision cams and devices which are meant to pick up things which the Human eye can&#39;t see or hear.At night well after cars,people businesses and everyone goes to bed there is &quot;SILENCE&quot;...I really dont use any\n&gt;  boxes when investigating just our cams(IR stationary and Hand Held w/Fullspectrum) and digital recorders.I do it this way not for the &quot;FEAR&quot; which I dont need,but for the quietness,the aloneness,the chance to catch on film or recorders what people claim to hear and see.We Do Not Seek Out Demons or play any &quot;BullShit&quot; games for what we dedicated our lifes is to help those in need of help at our own cost both time and $$$.Sorry for the late post been busy,but this has been on my mind for days.I deal with connecting with the spirit world from our past who are still here and they do answer and ask Q&#39;s which we return the answers back to them.My familyand I have4 spirits here with us ( Steve,Robert,Eric,Mary) who respond to our every question we ask along with hearing them at night or being woken up by them in the early morning hearing them with our ownears.They turn our door knobs,turn on and off lights and play with our cats,1 comes with us on our\n&gt;  investigations because we welcomed them to be part of our family..I don&#39;t or have I ever come across 1 of these so called &quot;Paranormal Groups&quot;that use FS boxes for that purpose. www.realinvestigationsoftheparanormal.net Sorry frank I had to throw this in.\n&gt; \n&gt; Rick\n&gt;"}