{"id": "2192", "subject": "Re: [EVP-ITC] Just a normal image", "author": "Lisby", "timestamp": "2007-09-21T14:45:43Z", "full_text": "Well, if they asked for it, then I am inclined to sit back, buckle my  \nseat belt, and enjoy what is going to be a wonderful ride.\n\n:)\n\nAnn\n\nOn Sep 21, 2007, at 9:25 AM, Frank Sumption wrote:\n\n&gt;\n&gt; Yeah, matter of fact, &quot;they&quot;, or one of them asked for video on the  \n&gt; session tape Chris and I did.\n&gt;\n&gt;  If I can find a video copnverter, I can post the whole videos. I  \n&gt; found one that converts it to MP4, if ya don&#39;t mind a banner  \n&gt; blocking the video every few seconds.\n&gt;\n&gt;  Frank-S\n&gt;\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; From: lisby@...\n&gt; Date: Fri, 21 Sep 2007 00:12:07 -0400\n&gt; Subject: Re: [EVP-ITC] Just a normal image\n&gt;\n&gt; Can you ask them to do something in these images that would  \n&gt; indicate they are paranormal? I hate to say something like tell  \n&gt; them to hold up a sign that says Hi Frank! but.....\n&gt;\n&gt; Did they tell you they wanted you to go this, BTW?\n&gt;\n&gt; A.\n&gt;\n&gt; On Sep 20, 2007, at 11:16 PM, Frank Sumption wrote:\n&gt;\n&gt;  Just the way they look, like the portrait images are like floating  \n&gt; in a sea of black, yet some are coler images, the others are to big  \n&gt; for the screen, like amateur video. I wouldn&#39;t say they are all  \n&gt; paranormal images, only that most are interesting, and probably  \n&gt; something.\n&gt;\n&gt;\n&gt;  BTW, thanks to those who did take a minute to look!\n&gt;\n&gt; Frank-s\n&gt;\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; From: lisby@...\n&gt; Date: Thu, 20 Sep 2007 23:02:31 -0400\n&gt; Subject: Re: [EVP-ITC] Just a normal image\n&gt;\n&gt; Ok--now don&#39;t get wiggy on me, Frank--but what makes you think  \n&gt; these are not random broadcast images?\n&gt;\n&gt;\n&gt; On Sep 20, 2007, at 9:40 PM, Frank Sumption wrote:\n&gt;\n&gt;\n&gt; Like &quot;Cable TV&quot;, comcast.\n&gt;\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; From: lisby@...\n&gt; Date: Thu, 20 Sep 2007 19:28:39 -0400\n&gt; Subject: Re: [EVP-ITC] Just a normal image\n&gt;\n&gt; When you say connected to cable, what do you mean?\n&gt;\n&gt; On Sep 20, 2007, at 4:59 PM, Frank Sumption wrote:\n&gt;\n&gt;  Same as the voices I get, with a randomly tuned VCR tuner, removed  \n&gt; from the VCR, and connected to cable. The tuner has line level  \n&gt; video and audio out. I use a monitor to view the video, then  \n&gt; &quot;captue&quot; it with the digital camera in camcorder mode.  As with the  \n&gt; voices, you can&#39;t rule out with 100% certainty that it isn&#39;t  \n&gt; broadcast fragments, but a face surrounded in black!?\n&gt;\n&gt;  These are from last night, at around 6pm.\n&gt;\n&gt;  Frank\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; From: lisby@...\n&gt; Date: Thu, 20 Sep 2007 16:14:16 -0400\n&gt; Subject: Re: [EVP-ITC] Just a normal image\n&gt;\n&gt; Frank--how was this recorded? I can&#39;t comment on the images at all  \n&gt; unless I understand how you&#39;re getting them.\n&gt;\n&gt; Ann\n&gt; It looks really cool, tho&#39;.\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; On Sep 20, 2007, at 2:39 PM, Frank Sumption wrote:\n&gt;\n&gt;  Yeah, a woman with her face so close to the camera that the top of  \n&gt; her head is cut off, and ya can almost see her nose hairs. Probably  \n&gt; see that all the time on MTV.\n&gt;\n&gt;\n&gt; Make your little one a shining star! Shine on!\n&gt;\n&gt; &lt;091907-20Inch-a10.jpg&gt;\n&gt;\n&gt;\n&gt;\n&gt; Kick back and relax with hot games and cool activities at the  \n&gt; Messenger Café.Play now!\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; More photos; more messages; more whatever – Get MORE with Windows  \n&gt; Live™ Hotmail®. NOW with 5GB storage. Get more!\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Make your little one a shining star! Shine on!\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; More photos; more messages; more whatever – Get MORE with Windows  \n&gt; Live™ Hotmail®. NOW with 5GB storage. Get more!\n&gt;\n&gt; \n\n\nWell, i hey asked o i , hen I am inclined o si back, buckle my sea bel , and enjoy wha is going o be a wonde ul ide.:)AnnOn Sep 21, 2007, a 9:25 AM, F ank Sump ion w o e:Yeah, ma e o ac , \" hey\", o one o hem asked o ideo on he session ape Ch is and I did.   I I can ind a ideo copn e e , I can pos he whole ideos. I ound one ha con e s i o MP4, i ya don' mind a banne blocking he ideo e e y ew seconds.  F ank-STo: EVP-ITC@yahoog oups.comF om: lisby@ea hlink.ne Da e: F i, 21 Sep 2007 00:12:07 -0400Subjec : Re: [EVP-ITC] Jus a no mal imageCan you ask hem o do some hing in hese images ha would indica e hey a e pa ano mal? I ha e o say some hing like ell hem o hold up a sign ha says Hi F ank! bu .....Did hey ell you hey wan ed you o go his, BTW?A.On Sep 20, 2007, a 11:16 PM, F ank Sump ion w o e: Jus he way hey look, like he po ai images a e like loa ing in a sea o black, ye some a e cole images,  he o he s a e o big o he sc een, like ama eu ideo. I wouldn' say hey a e all pa ano mal images, only ha mos a e in e es ing, and p obably some hing.    BTW, hanks o hose who did ake a minu e o look!F ank-sTo: EVP-ITC@yahoog oups.comF om: lisby@ea hlink.ne Da e: Thu, 20 Sep 2007 23:02:31 -0400Subjec : Re: [EVP-ITC] Jus a no mal imageOk--now don' ge wiggy on me, F ank--bu wha makes you hink hese a e no andom b oadcas images?On Sep 20, 2007, a 9:40 PM, F ank Sump ion w o e:Like \"Cable TV\", comcas . To: EVP-ITC@yahoog oups.comF om: lisby@ea hlink.ne Da e: Thu, 20 Sep 2007 19:28:39 -0400Subjec : Re: [EVP-ITC] Jus a no mal imageWhen you say connec ed o cable, wha do you mean?On Sep 20, 2007, a 4:59 PM, F ank Sump ion w o e: Same as he oices I ge , wi h a andomly uned VCR une , emo ed om he VCR, and connec ed o cable. The une has line le el ideo and audio ou . I use a moni o o iew he ideo,  hen \"cap ue\" i wi h he digi al came a in camco de mode.  As wi h he oices, you can' ule ou wi h 100% ce ain y ha i isn' b oadcas agmen s, bu a ace su ounded in black!?  These a e om las nigh , a a ound 6pm.   F ankTo: EVP-ITC@yahoog oups.comF om: lisby@ea hlink.ne Da e: Thu, 20 Sep 2007 16:14:16 -0400Subjec : Re: [EVP-ITC] Jus a no mal imageF ank--how was his eco ded? I can' commen on he images a all unless I unde s and how you' e ge ing hem.AnnI looks eally cool, ho'.On Sep 20, 2007, a 2:39 PM, F ank Sump ion w o e: Yeah, a woman wi h he ace so close o he came a ha he op o he head is cu o , and ya can almos see he nose hai s. P obably see ha all he ime on MTV.Make you li le one a shining s a ! Shine on!a10.jpg>Kick back and elax wi h ho games and cool ac i i ies a he Messenge Ca é.Play now!Mo e pho os; mo e messages; mo e wha e e – Ge MORE wi h Windows Li e™ Ho mail®. NOW wi h 5GB s o age. Ge mo e!Make you li le one a shining s a ! Shine on!Mo e pho os; mo e messages; mo e wha e e – Ge MORE wi h Windows Li e™ Ho mail®. NOW wi h 5GB s o age. Ge mo e!"}