{"id": "21958", "subject": "Re: [EVP-ITC] Re: Maybe good news,", "author": "Zack Widup", "timestamp": "2011-09-07T18:24:34Z", "full_text": "Well, the same people who told us it&#39;s there in the first place put up the\nphotos of the comet as it progressively got smaller.  Since the source of\nthe info is the same people, why would you believe it was there in the first\nplace if you don&#39;t believe the photos they are now putting up? Maybe it was\nnever even there in the first place.\n\nZack\n\n\nOn Wed, Sep 7, 2011 at 12:57 PM, purplespacefriend &lt;\npurplealiengirl@...&gt; wrote:\n\n&gt; **\n&gt;\n&gt;\n&gt; Confusing! I was hearing all this stuff about it being the doomsday comet,\n&gt; so I actaully(yeah I know, not believable) went out and looked at it, and\n&gt; saw it as nothing a few weeks ago. Then all these proclamations of what a\n&gt; nothin&#39; it really is. I think the claims of it being distroyed are\n&gt; bogus--it&#39;s just the fake prophets trying to cover their asses. &quot;My guys&quot;\n&gt; have, and still maintain Christmas-2012. If that proves to be nothin&#39; as\n&gt; well, gonna pile the boxes up and lite them on fire! The lesson, don&#39;t\n&gt; listen to internet fucktards.\n&gt;\n&gt; F-S\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, SnowfireL@... wrote:\n&gt; &gt;\n&gt; &gt; David the Spirit Tech, (if I am hearing him correctly) says, that &quot;comet,\n&gt;\n&gt; &gt; Elenin was destroyed yesterday 8-31-11 he said it completely\n&gt; &gt; disintegrated.&quot; Our good old Sun took it out so, if this is true, it&#39;s a\n&gt; true blessing\n&gt; &gt; for this planet, and we should all thank God. Planet X, aka Nebaru sp is\n&gt; &gt; still on it&#39;s way, don&#39;t know what&#39;s going to happen with it yet. sf\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nWell, he same people who old us i 's he e in he i s place pu up he pho os o he come as i p og essi ely go smalle .  Since he sou ce o he in o is he same people, why would you belie e i was he e in he i s place i you don' belie e he pho os hey a e now pu ing up? Maybe i was ne e e en he e in he i s place.\nZack On Wed, Sep 7, 2011 a 12:57 PM, pu plespace iend pu plealiengi l@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n Con using! I was hea ing all his s u abou i being he doomsday come , so I ac aully(yeah I know, no belie able) wen ou and looked a i , and saw i as no hing a ew weeks ago. Then all hese p oclama ions o wha a no hin' i eally is. I hink he claims o i being dis oyed a e bogus--i 's jus he ake p ophe s ying o co e hei asses. \"My guys\" ha e, and s ill main ain Ch is mas-2012. I ha p o es o be no hin' as well, gonna pile he boxes up and li e hem on i e! The lesson, don' lis en o in e ne uck a ds.\n\n\nF-S\n\n--- In EVP-ITC@yahoog oups.com, Snow i eL@... w o e:\n>\n> Da id he Spi i Tech, (i I am hea ing him co ec ly) says, ha \"come , \n> Elenin was des oyed yes e day 8-31-11 he said i comple ely \n> disin eg a ed.\" Ou good old Sun ook i ou so, i his is ue, i 's a ue blessing \n> o his plane , and we should all hank God. Plane X, aka Neba u sp is \n> s ill on i 's way, don' know wha 's going o happen wi h i ye . s \n>"}