{"id": "21961", "subject": "Re: Maybe good news,", "author": "jamietreetalker", "timestamp": "2011-09-12T18:04:09Z", "full_text": "Hmm..I give this post a thumbs up. LOL\n\nSeriously, though, I also think that the comet is still on the way, but it&#39;s hard to say how big it is now. Regarding the 17th, there has to be SOMETHING happening on that date. I believe very strongly that the box does not lie, but it does seem to require a bit of work to figure out the message. Sometimes I don&#39;t understand until after the &quot;event&quot; has already taken place.\n\nSome people are always going to be dicks, no matter what. You can count on that. That&#39;s why I really despise the human race sometimes.\n\nJamie\n\n--- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  That&#39;s why I ain&#39;t posting what i get for the 17th, to damn many somehow, someway, always know so much better. Then when nothing happens we have to put with smug BS. Ya can&#39;t just post what ya get from the boxes, it has to be run past the judges first. As they fail to consider that much of what comes through is the thoughts of the living, but that&#39;s not good enough, it has to be absolute positive proof of spirit or it has to made fun of.  That is the sole contibution of these critical thinkers. Ignore all the facts, and other explanations in favor of Randi-isms.\n&gt; \n&gt; \n&gt;  When I get the 17th repeated over and over from every frikkin&#39; recording and box so far this year, and now they insist it is this 17th, I have to at least consider it might mean something, and whether it does or does not, ......\n&gt; F-S\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; &lt;purplealiengirl@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Awwww Crap! Foprgot to check with the experts again before posting--my bad!\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; F-S\n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, Zack Widup &lt;w9sz.zack@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; Well, the same people who told us it&#39;s there in the first place put up the\n&gt; &gt; &gt; photos of the comet as it progressively got smaller.  Since the source of\n&gt; &gt; &gt; the info is the same people, why would you believe it was there in the first\n&gt; &gt; &gt; place if you don&#39;t believe the photos they are now putting up? Maybe it was\n&gt; &gt; &gt; never even there in the first place.\n&gt; &gt; &gt; \n&gt; &gt; &gt; Zack\n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; On Wed, Sep 7, 2011 at 12:57 PM, purplespacefriend &lt;\n&gt; &gt; &gt; purplealiengirl@&gt; wrote:\n&gt; &gt; &gt; \n&gt; &gt; &gt; &gt; **\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Confusing! I was hearing all this stuff about it being the doomsday comet,\n&gt; &gt; &gt; &gt; so I actaully(yeah I know, not believable) went out and looked at it, and\n&gt; &gt; &gt; &gt; saw it as nothing a few weeks ago. Then all these proclamations of what a\n&gt; &gt; &gt; &gt; nothin&#39; it really is. I think the claims of it being distroyed are\n&gt; &gt; &gt; &gt; bogus--it&#39;s just the fake prophets trying to cover their asses. &quot;My guys&quot;\n&gt; &gt; &gt; &gt; have, and still maintain Christmas-2012. If that proves to be nothin&#39; as\n&gt; &gt; &gt; &gt; well, gonna pile the boxes up and lite them on fire! The lesson, don&#39;t\n&gt; &gt; &gt; &gt; listen to internet fucktards.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; F-S\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com, SnowfireL@ wrote:\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; David the Spirit Tech, (if I am hearing him correctly) says, that &quot;comet,\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; Elenin was destroyed yesterday 8-31-11 he said it completely\n&gt; &gt; &gt; &gt; &gt; disintegrated.&quot; Our good old Sun took it out so, if this is true, it&#39;s a\n&gt; &gt; &gt; &gt; true blessing\n&gt; &gt; &gt; &gt; &gt; for this planet, and we should all thank God. Planet X, aka Nebaru sp is\n&gt; &gt; &gt; &gt; &gt; still on it&#39;s way, don&#39;t know what&#39;s going to happen with it yet. sf\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;  \n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}