{"id": "21969", "subject": "Re: (no subject)", "author": "Adrienne", "timestamp": "2011-09-16T15:48:02Z", "full_text": "I&#39;m glad to hear we may have a second chance!  However, the idea regarding using technology to divert water or to pull it from moistire in the air to the desert won&#39;t fly.  We&#39;ve already done that with CA and Las Vegas while destroying the Colorado River and towns along its banks and setting up a water based conflict here.  In the Mideast it would probably speed up the water conflicts that are already brewing or have been realized, ie, Sudan, in Africa.  You can seed clouds all you want but there is a finite amount of fresh water and water in general on the planet and desalination just sets up another bigger problem with the oceans, which is already happening because of pollution.\n\n\nAdrienne \n\n\n--- In EVP-ITC@yahoogroups.com, SnowfireL@... wrote:\n&gt;\n&gt; Everyone&#39;s files are sounding great!  I  haven&#39;t had time to comment on \n&gt; each individual file, but have listened, and  heard them all.  One good way to \n&gt; keep some lower spirits from infiltrating  your mind, is to simply say, The \n&gt; Lord&#39;s Prayer, and they will go away  packing.  I hear them so clearly now \n&gt; on my RS 150, it&#39;s unreal, I do turn  them off more often now, because it \n&gt; gets like Grand Central Station in here  sometimes.  Luckily, I am getting more \n&gt; of the higher spirit people now,  less of the little nasty&#39;s, since they \n&gt; all got to try to get into the light  Realms now, otherwise they will find \n&gt; themselves in total darkness soon &quot;when the  door gets shut for 1000 years.&quot;   \n&gt; From what David the Spirit tech  says, &quot;we all did get a reprieve though \n&gt; from world destruction,&quot; &quot;God wants to  give us another chance to see if we, as \n&gt; a people will repent our ways, become  more spiritual, and come to Him as a \n&gt; human race.&quot;  Don&#39;t know how God  intends to convert this world to loving \n&gt; Him, but sometimes He just can turn bad  tings into good ones.  Thank God \n&gt; that TX is now getting some rain, they  have had a terrible drought for long \n&gt; time.  Things may get bad again for  some with what Muslim are trying to take \n&gt; away parts of Israel to form Palestine,  why not use some of the upper \n&gt; Arabia, it&#39;s vast place of sand, but with  technology being what it is now, they \n&gt; could send water into the desert  places.  Just a thought,\n&gt; sf\n&gt;"}