{"id": "21990", "subject": "Re: [EVP-ITC] Re: new evps", "author": "Vicky Cox", "timestamp": "2011-10-02T22:05:03Z", "full_text": "a Bell and Howell S7. 12 mp, video, night vision, voice recorder. $90. The\nsame camera is also sold as a Megxon X57nv on Ebay for $50. $55 will get\n you a second chance offer.\n\nOn Sun, Oct 2, 2011 at 5:56 PM, jamietreetalker &lt;thequilldriver@...&gt;wrote:\n\n&gt; **\n&gt;\n&gt;\n&gt; I&#39;m not sure I&#39;m hearing much in the EVPs becuase they&#39;re so distant\n&gt; sounding, but I think the photos are interesting. What were they shot with?\n&gt; The one with the man walking on the right was particularly curious!\n&gt;\n&gt; Jamie\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, Vicky Cox &lt;vickyw222@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; I was looking for some practice on investigating so I found an old small\n&gt; &gt; cemetery. It is a couple hundred yards from the state&#39;s largest supplier\n&gt; of\n&gt; &gt; crushed limestone for the last 100 years. The grass was mowed but that\n&gt; was\n&gt; &gt; the extent of the upkeep. Many tombstones were broken and tossed to the\n&gt; &gt; outside edge of the cemetery. Many children were buried there. The oldest\n&gt; &gt; tombstone we found was1815. It was 60 degrees the whole time were there.\n&gt; We\n&gt; &gt; were sooo cold and we could easily see our breath. I&#39;ve never heard of\n&gt; any\n&gt; &gt; paranormal experiences regarding here and we&#39;ve decided to keep\n&gt; &gt; it anonymous in an attempt to preserve what is left. The photos are kind\n&gt; of\n&gt; &gt; &quot;iffy&quot; I might be seeing things where there isn&#39;t anything. I&#39;d\n&gt; appreciate\n&gt; &gt; any feedback.\n&gt; &gt;\n&gt; &gt; EVPs &lt;http://paranormalarcheologysurveyteam.weebly.com/evps.html&gt;\n&gt; &gt;\n&gt; &gt; Photos &lt;http://paranormalarcheologysurveyteam.weebly.com/photos.html&gt;\n&gt; &gt;\n&gt; &gt; --\n&gt; &gt; Vicky\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\n\n\n-- \nVicky\n\na Bell and Howell S7. 12 mp, ideo, nigh ision, oice eco de . $90. The same came a is also sold as a Megxon X57n on Ebay o $50. $55 will ge  you a second chance o e .On Sun, Oc 2, 2011 a 5:56 PM, jamie ee alke hequilld i e @...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n I'm no su e I'm hea ing much in he EVPs becuase hey' e so dis an sounding, bu I hink he pho os a e in e es ing. Wha we e hey sho wi h? The one wi h he man walking on he igh was pa icula ly cu ious!\n\n\n\nJamie\n\n--- In EVP-ITC@yahoog oups.com, Vicky Cox w o e:\n>\n> I was looking o some p ac ice on in es iga ing so I ound an old small\n> ceme e y. I is a couple hund ed ya ds om he s a e's la ges supplie o \n> c ushed limes one o he las 100 yea s. The g ass was mowed bu ha was\n> he ex en o he upkeep. Many ombs ones we e b oken and ossed o he\n> ou side edge o he ceme e y. Many child en we e bu ied he e. The oldes \n> ombs one we ound was1815. I was 60 deg ees he whole ime we e he e. We\n> we e sooo cold and we could easily see ou b ea h. I' e ne e hea d o any\n> pa ano mal expe iences ega ding he e and we' e decided o keep\n> i anonymous in an a emp o p ese e wha is le . The pho os a e kind o \n> \"i y\" I migh be seeing hings whe e he e isn' any hing. I'd app ecia e\n> any eedback.\n> \n> EVPs h p://pa ano mala cheologysu ey eam.weebly.com/e ps.h ml>\n> \n> Pho os h p://pa ano mala cheologysu ey eam.weebly.com/pho os.h ml>\n> \n> -- \n> Vicky\n>\n\n\n\n \n \n\n \n \n\n\n\n\n\n\n \n\n\n\n\n\n\n-- Vicky"}