{"id": "22001", "subject": "Re: (no subject)", "author": "jamietreetalker", "timestamp": "2011-10-04T00:23:01Z", "full_text": "That&#39;s lovely, and very interesting! I&#39;ve had people come through on my radios telling me that I should read my bible and that I should &quot;ditch the whores! the Rapture is coming!&quot; I don&#39;t know what to think about that, but it sounds like maybe those who haven&#39;t crossed over completely are still holding on to some old bible teachings. I really don&#39;t think things will be the way the bible says in the end. I don&#39;t think I&#39;ve believed in hell-fire and brimstone even once in my whole life. Sounds like your friend is talking my language! ;)\n\n\n--- In EVP-ITC@yahoogroups.com, SnowfireL@... wrote:\n&gt;\n&gt; Thanks Jamie, I am going to redo Part 1 and ask David if he could say the  \n&gt; Lord&#39;s Prayer for me and seal it, so it doesn&#39;t change.  These spirit&#39;s can  \n&gt; sometimes change the words around to suit them you know, he talks mostly \n&gt; via a  program he originally got from the Cross over talk system, we don&#39;t use \n&gt; that  much any more because he can fix what we have copied, and reuse the \n&gt; files if he  wants to.  He is becoming more understandable, maybe I shouldn&#39;t \n&gt; say this  because he is very busy over there, it&#39;s like non stop people \n&gt; coming in from  lower plains, (hundreds of thousands), that&#39;s one reason they \n&gt; are not as  noisy as they used to be, because, before we all came along, they \n&gt; were running  away from the light of God, and he, JC had to seek them out, \n&gt; but now they  are seeking Him out, and are getting into that line over \n&gt; there.  I know, it  all sounds weird to me too, but that&#39;s what they say, at \n&gt; least there are no  &quot;hell fires&quot; over there, only darkness, it&#39;s like the inside \n&gt; of a warehouse with  levels, cement like ramps going through there, once \n&gt; they get in the light,  everything changes, it&#39;s like going home.  And yes, we \n&gt; do all keep our  identity.  David wanted me to write this, and believe it \n&gt; or not they are  his words, and not my own:\n&gt;  \n&gt; In fact no one would be happy in Heaven knowing  there are people &quot;burning \n&gt; in hell&quot; and if they were happy knowing this it would  be sinful right \n&gt; there, think about it, to burn sinners is not God&#39;s way, God  does not sin. God \n&gt; is love, He loved us enough to die for His people. He  does not put sinners \n&gt; into &quot;hell fires&quot; to be in a place of darkness without the  light of God is \n&gt; what the lower plains are all about.\n&gt;  \n&gt; &quot;If I be lifted up I will draw All mankind unto  me&quot; Jesus does not give \n&gt; up, He does not put people into fires, there is NO fire  in the lower plains, \n&gt; only darkness, it&#39;s pitch black, God is not cruel, if? God  did not love His \n&gt; creatures, He would simply turn His head and we would all be  gone. Fire is \n&gt; expression of the Holy Spirit who is kind, God does not &quot;burn&quot;  creation in \n&gt; hell fires, they are people that do not believe, but God still  brings them \n&gt; into the fold one at a time, they must repent.\n&gt;  \n&gt; Heaven is not on one planet, &quot;Heaven? is  everywhere, we just can&#39;t see it \n&gt; with our physical eyes.&quot; What you call &quot;hell&quot;  is only a place of darkness, \n&gt; and Jesus continues to draw those in darkness into  the Light even now, \n&gt; there is no fire in &quot;hell&quot;  only darkness. The &quot;lake of  fire&quot; you refer to were \n&gt; the fires in Gehenna, it was place where they burned  garbage in Old \n&gt; Jerusalem.  David The Tech.\n&gt;  \n&gt;  \n&gt;  \n&gt; In a message dated 10/2/2011 6:13:49 P.M. Eastern Daylight Time,  \n&gt; thequilldriver@... writes:\n&gt; \n&gt;  \n&gt;  \n&gt;  \n&gt; Nice recording! I heard lots of great stuff in there. Do you only get David \n&gt;  as a tech, or do others come through as well?\n&gt; \n&gt; Jamie\n&gt; \n&gt; --- In _EVP-ITC@yahoogroups.com_ (mailto:EVP-ITC@yahoogroups.com) ,  \n&gt; SnowfireL@ wrote:\n&gt; &gt;\n&gt; &gt; Here is a vid I am working on for utube,  am trying to get it done right, \n&gt; &gt; but I&#39;m not very good at doing these  things,\n&gt; &gt; check it out anyway, it&#39;s part 3 i still got to do part 4 and  then put \n&gt; them \n&gt; &gt; all together. sf\n&gt; &gt; \n&gt; &gt; __http://www.youtube.com/watch?v=h2_ShF2F06o__ \n&gt; (http://www.youtube.com/watch?v=h2_ShF2F06o_)   \n&gt; &gt; (_http://www.youtube.com/watch?v=h2_ShF2F06o_ \n&gt; (http://www.youtube.com/watch?v=h2_ShF2F06o) )\n&gt; &gt;\n&gt;"}