{"id": "22024", "subject": "Introduction", "author": "beth2marilyn@gmail.com", "timestamp": "2011-10-07T02:07:42Z", "full_text": "--------------Boundary-00=_T8BOIA11VA4000000000\r\nContent-Type: Multipart/Alternative;\n  boundary=&quot;------------Boundary-00=_U8BODL51VA4000000000&quot;\r\n\r\n\r\n--------------Boundary-00=_U8BODL51VA4000000000\r\nContent-Type: Text/Plain;\n  charset=&quot;utf-8&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nHello everyone! My name is Beth and I am new to this group! Thank you to th=\r\ne\nowners/moderators who approved my membership! I was looking for a group o=\r\nf\nparanormal investigators who enjoy talking about the paranormal as much a=\r\ns I\ndo. My family and friends seem to be sick of me talking about it and\nwh=\r\nenever I mention something that I&#39;ve captured I get the roll of the eyes.\nL=\r\nol!=20\r\n\r\nI&#39;ve always been interested in ghost and ghost hunting. When I was little =\r\nmy\nmother would tell me that she would always hear boxes being thrown aroun=\r\nd in\nthe basement and thought it to be a ghost. She also said that she woul=\r\nd hear\nfootsteps and feet being dragged across the long plastic runner that=\r\n we had\nin front of the basement door. She would get up thinking it was one=\r\n of us\nkids and we would be sound asleep. So, naturally my interest grew. I=\r\n never\nseen anything unusual but I would always &#39;feel&#39; something in that ho=\r\nuse.\nWhen I got older, married, and had my own kids I lived in a questionab=\r\nle\nhouse for 11 years. We would hear footsteps in the attic, the kids would=\r\n\ncomplain of seeing &#39;uncle Sam&#39; standing in the bathroom doorway, or a man\n=\r\nwalking through the bedroom. Of course I never believed them. I asked my so=\r\nn\nwhen he got older and he remembered the man in great detail. Turns out it=\r\n\nwas a man/spirit in period clothing with a long white beard and top hat.\nH=\r\nence the &#39;uncle Sam&#39; character. I have seen a female child apparition\nstand=\r\ning in the doorway to which I had a witness, my sister-in-law who saw\nthe s=\r\name thing at the same time. We thought it was one of our kids and\nquickly c=\r\nounted heads and it wasn&#39;t one of our own. The apparition vanished\nand we n=\r\never saw it again. I have heard music playing in the basement and a\nman cou=\r\nghing when I&#39;ve been home alone. A roommate of mine had her shirt\ntugged on=\r\n and she thought it was me but I wasn&#39;t home from work yet. She\nlocked hers=\r\nelf in her room, scared to death until I came home. The stories\ngo on and o=\r\nn.=20\r\n\r\nI moved from that home and now I am having strange things occur in this\nho=\r\nuse. I should note that I am over a thousand miles from my previous \nhaunte=\r\nd&#39; home. I&#39;ve lived here 4 yrs and one day I seen a little ball of\nlight (O=\r\nRB) shoot out of my bedroom and go into my husband&#39;s chair. I have\nseen a f=\r\new shadows and have felt that creepy feeling where my hair stands on\nend ma=\r\nny times. So, I decided to get a digital recorder. Not thinking that I\nwoul=\r\nd ever capture anything. I also wanted to use it to debunk EVPs and find\nso=\r\nme Scientific explanation for them. I was wrong. I captured my first EVP\nin=\r\n the master bedroom of my home. It said, &quot;I have no love&quot;. Ok, that got my\n=\r\nattention. I tried to debunk it and could not. I decided to perform many EV=\r\nP\nsessions in my bedroom and have caught a lot of them. I have asked questi=\r\nons\nand ask to knock for yes to certain questions. By doing so I figured ou=\r\nt\nthat it was a Hispanic woman who had been murdered. After some research I=\r\n\nhave since found out that yes someone had died in this house. One of the\np=\r\nrevious tenants claimed there was a ghost here and even went so far as to\ng=\r\net the house cleansed. I must have brought it back by summoning it while\nco=\r\nnducting my EVP sessions.=20\r\n\r\nMy fascination grew now that I was actually capturing real evidence. I hav=\r\ne\nsince went on tours of supposedly haunted places such as: Vulture Mine,\nA=\r\nrizona, The Bird Cage Theatre Tombstone, Arizona, the San Carlos Hotel,\nPho=\r\nenix, and Goldfield Ghost Town, Arizona. I am new at this so I haven&#39;t\nbeen=\r\n on any investigations on a team. I do it alone. The only equipment that\nI&#39;=\r\nve been using is a digital camera and recorder. My main interest is\ncapturi=\r\nng something paranormal on film or EVPs.=20\r\n\r\nI have recently made a couple of trips to a local cemetery, during the day=\r\n,\nmiddle of the afternoon and have caught amazing EVPs. I have captured man=\r\ny\ndifferent voices and personalities. Some nice, some not so nice. Some wom=\r\nen,\nmen, and children. It amazes me because I cannot debunk them. I know fo=\r\nr a\nfact that I&#39;m the only one there so they can&#39;t be explained. I know it =\r\nwasn\nt me who I was hearing, so who is it? I&#39;m not sure if ghosts really ex=\r\nist or\nif they are all residual energy. Since capturing the voices actually=\r\n\nanswering my questions I am leaning toward that they really exist. There&#39;s=\r\n\njust no denying. I now believe that some are residual and some are\nintelli=\r\ngent spirits. I enjoy EVPs because they are much harder to debunk.\nWith pho=\r\ntographs there is always that &#39;what if&#39; or well it could be a glare\nor a gl=\r\nitch in the camera. But with EVPs they are unmistakable.=20\r\n\r\nI&#39;m looking forward with getting to know everyone and sharing my experienc=\r\nes\n=20\r\n\r\nBeth\r\n=20\r\n=20\r\n=20\r\n \r\n--------------Boundary-00=_U8BODL51VA4000000000\r\nContent-Type: Text/HTML;\n  charset=&quot;utf-8&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;HTML&gt;&lt;HEAD&gt;\n&lt;META content=3D&quot;text/html; charset=3Dutf-8&quot; http-equiv=3DCont=\r\nent-Type&gt;\n&lt;META name=3DGENERATOR content=3D&quot;IncrediMail 1.0&quot;&gt;\n&lt;STYLE&gt;v&#92;:* {=\r\n\n\tBEHAVIOR: url (#default#vml)\n}\n&lt;/STYLE&gt;\n\n&lt;!--IncrdiXMLRemarkStart&gt;\n&lt;Incrd=\r\niX-Info&gt;\n&lt;X-FID&gt;FLAVOR00-NONE-0000-0000-000000000000&lt;/X-FID&gt;\n&lt;X-FVER&gt;&lt;/X-FV=\r\nER&gt;\n&lt;X-CNT&gt;;&lt;/X-CNT&gt;\n&lt;/IncrdiX-Info&gt;\n&lt;IncrdiXMLRemarkEnd--&gt;\n&lt;/HEAD&gt;\n&lt;BODY s=\r\ntyle=3D&quot;MARGIN: 5px 10px 0px; FONT-FAMILY: Arial; FONT-SIZE: 12pt&quot; backgrou=\r\nnd=3D&quot;&quot; scroll=3Dyes bgColor=3D#ffffff&gt;\n&lt;TABLE id=3DINCREDIMAINTABLE border=\r\n=3D0 cellSpacing=3D0 cellPadding=3D2 width=3D&quot;100%&quot;&gt;\n&lt;TBODY&gt;\n&lt;TR&gt;\n&lt;TD style=\r\n=3D&quot;POSITION: relative; DIRECTION: ltr; FONT-SIZE: 12pt&quot; id=3DINCREDITEXTRE=\r\nGION width=3D&quot;100%&quot;&gt;\n&lt;DIV style=3D&quot;PADDING-LEFT: 2px&quot; id=3DINCREDI_TEXT_ARE=\r\nA&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;Hello everyone! My name is Beth and I am new to this group! T=\r\nhank you to the owners/moderators who approved my membership! I was looking=\r\n for a group of paranormal investigators who enjoy talking about the parano=\r\nrmal as much as I do. My family and friends seem to be sick of me talking a=\r\nbout it and whenever I mention something that I&#39;ve captured I get the roll =\r\nof the eyes. Lol! &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I&#39;ve always been interested=\r\n in ghost and ghost hunting. When I was little my mother would tell me that=\r\n she would always hear boxes being thrown around in the basement and though=\r\nt it to be a ghost. She also said that she would hear footsteps and feet be=\r\ning dragged across the long plastic runner that we had in front of the base=\r\nment door. She would get up thinking it was one of us kids and we would be =\r\nsound asleep. So, naturally my interest grew. I never seen anything unusual=\r\n but I would always &#39;feel&#39; something in that house. When I got older, marri=\r\ned, and had my own kids I lived in a questionable house for 11 years. We wo=\r\nuld hear footsteps in the attic, the kids would complain of seeing &#39;uncle S=\r\nam&#39; standing in the bathroom doorway, or a man walking through the bedroom.=\r\n Of course I never believed them. I asked my son when he got older and he r=\r\nemembered the man in great detail. Turns out it was a man/spirit in period =\r\nclothing with a long white beard and top hat. Hence the &#39;uncle Sam&#39; charact=\r\ner. I have seen a female child apparition standing in the doorway to which =\r\nI had a witness, my sister-in-law who saw the same thing at the same time. =\r\nWe thought it was one of our kids and quickly counted heads and it wasn&#39;t o=\r\nne of our own. The apparition vanished and we never saw it again. I have he=\r\nard music playing in the basement and a man coughing when I&#39;ve been home al=\r\none. A roommate of mine had her shirt tugged on and she thought it was me b=\r\nut I wasn&#39;t home from work yet. She locked herself in her room, scared to d=\r\neath until I came home. The stories go on and on. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n=\r\n&lt;DIV&gt;I moved from that home and now I am having strange things occur in thi=\r\ns house. I should note that I am over a thousand miles from my previous &#39;ha=\r\nunted&#39; home. I&#39;ve lived here 4 yrs and one day I seen a little ball of ligh=\r\nt (ORB) shoot out of my bedroom and go into my husband&#39;s chair. I have seen=\r\n a few shadows and have felt that creepy feeling where my hair stands on en=\r\nd many times. So, I decided to get a digital recorder. Not thinking that I =\r\nwould ever capture anything. I also wanted to use it to debunk EVPs and fin=\r\nd some Scientific explanation for them. I was wrong. I captured my first EV=\r\nP in the master bedroom of my home. It said, &quot;I have no love&quot;. Ok, that got=\r\n my attention. I tried to debunk it and could not. I decided to perform man=\r\ny EVP sessions in my bedroom and have caught a lot of them. I have asked qu=\r\nestions and ask to knock for yes to certain questions. By doing so I figure=\r\nd out that it was a Hispanic woman who had been murdered. After some resear=\r\nch I have since found out that yes someone had died in this house. One of t=\r\nhe previous tenants claimed there was a ghost here and even went so far as =\r\nto get the house cleansed. I must have brought it back by summoning it whil=\r\ne conducting my EVP sessions. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;My fascination =\r\ngrew now that I was actually capturing real evidence. I have since went on =\r\ntours of supposedly haunted places such as: Vulture Mine, Arizona, The Bird=\r\n Cage Theatre Tombstone, Arizona, the San Carlos Hotel, Phoenix, and Goldfi=\r\neld Ghost Town, Arizona. I am new at this so I haven&#39;t been on any investig=\r\nations on a team. I do it alone. The only equipment that I&#39;ve been using is=\r\n a digital camera and recorder. My main interest is capturing something par=\r\nanormal on film or EVPs. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I have recently made=\r\n a couple of trips to a local cemetery, during the day, middle of the after=\r\nnoon and have caught amazing EVPs. I have captured many different voices an=\r\nd personalities. Some nice, some not so nice. Some women, men, and children=\r\n. It amazes me because I cannot debunk them. I know for a fact that I&#39;m the=\r\n only one there so they can&#39;t be explained. I know it wasn&#39;t me who I was h=\r\nearing, so who is it? I&#39;m not sure if ghosts really exist or if they are al=\r\nl residual energy. Since capturing the voices actually answering my questio=\r\nns I am leaning toward that they really exist. There&#39;s just no denying. I n=\r\now believe that some are residual and some are intelligent spirits. I enjoy=\r\n EVPs because they are much harder to debunk. With photographs there is alw=\r\nays that &#39;what if&#39; or well it could be a glare or a glitch in the camera. B=\r\nut with EVPs they are unmistakable. &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I&#39;m looki=\r\nng forward with getting to know everyone and sharing my experiences. &lt;/DIV&gt;=\r\n\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Beth&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;&lt;/DIV=\r\n&gt;&lt;/DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV style=3D&quot;FONT-FAMILY=\r\n: Arial; FONT-SIZE: 12pt&quot; dir=3Dltr id=3DIncrediOriginalFontSize&gt;&nbsp;&lt;/DI=\r\nV&gt;&lt;/DIV&gt;&lt;/TD&gt;&lt;/TR&gt;\n&lt;TR&gt;\n&lt;TD id=3DINCREDIFOOTER width=3D&quot;100%&quot;&gt;\n&lt;TABLE cellS=\r\npacing=3D0 cellPadding=3D0 width=3D&quot;100%&quot;&gt;\n&lt;TBODY&gt;\n&lt;TR&gt;\n&lt;TD width=3D&quot;100%&quot;&gt;=\r\n&lt;/TD&gt;\n&lt;TD id=3DINCREDISOUND vAlign=3Dbottom align=3Dmiddle&gt;&lt;/TD&gt;&lt;/TR&gt;&lt;/TBOD=\r\nY&gt;&lt;/TABLE&gt;&lt;/TD&gt;&lt;/TR&gt;&lt;/TBODY&gt;&lt;/TABLE&gt;&lt;SPAN id=3DIncrediStamp&gt;&lt;A href=3D&quot;http=\r\n://www.incredimail.com/?id=3D619263&amp;did=3D10500&amp;ppd=3D2723,20110804=\r\n1216,9,1,603700125098939438&amp;rui=3D141495584&amp;sd=3D20111006&quot;&gt;&lt;SPAN na=\r\nme=3D&quot;imgCache&quot; border=3D&quot;0&quot;&gt;&lt;IMG border=3D0 alt=3D&quot;FREE Animations for you=\r\nr email - by IncrediMail! Click Here!&quot; src=3D&quot;cid:F9517E6D-317F-4DD9-BE06-C=\r\nB064B06DF8C&quot;&gt;&lt;/SPAN&gt;&lt;/A&gt;&lt;/SPAN&gt;&lt;/BODY&gt;&lt;/HTML&gt;\r\n--------------Boundary-00=_U8BODL51VA4000000000--\r\n\n\r\n--------------Boundary-00=_T8BOIA11VA4000000000\r\nContent-Type: image/gif;\n  name=&quot;05_puppy_sticky_note_en.gif&quot;\r\nContent-ID: &lt;F9517E6D-317F-4DD9-BE06-CB064B06DF8C&gt;\r\n\r\n[ Attachment content not displayed ]\r\n--------------Boundary-00=_T8BOIA11VA4000000000--"}