{"id": "22030", "subject": "Re: [EVP-ITC] Introduction", "author": "Vicky Cox", "timestamp": "2011-10-12T16:22:32Z", "full_text": "I just learned a lot.\nShe didn&#39;t do anything wrong.\n\nOn Tue, Oct 11, 2011 at 7:52 PM, Frank Sumption\n&lt;purplealiengirl@...&gt;wrote:\n\n&gt; **\n&gt;\n&gt;\n&gt;  Almost 900 members and zero discussion. I see poeple join all the time\n&gt; saying they want to learn--then nothin&#39;. Probly better off on Face Book.\n&gt;\n&gt;  Part of it is that no matter what one says, there is an expert that knows\n&gt; better, someone to tell you what your EVPs really say.\n&gt;\n&gt;  I don&#39;t do investigations, and remain kinda skeptical aoubt hauntings and\n&gt; just how much &quot;evidence&quot; is suggestion or expectation.  I do know ya do not\n&gt; have to go to the huanted hot spot to get spirit communications.\n&gt;\n&gt; F-S\n&gt;\n&gt; On Thu, Oct 6, 2011 at 8:07 PM, beth2marilyn@... &lt;\n&gt; beth2marilyn@...&gt; wrote:\n&gt;\n&gt;&gt; **\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;    Hello everyone! My name is Beth and I am new to this group! Thank you\n&gt;&gt; to the owners/moderators who approved my membership! I was looking for a\n&gt;&gt; group of paranormal investigators who enjoy talking about the paranormal as\n&gt;&gt; much as I do. My family and friends seem to be sick of me talking about it\n&gt;&gt; and whenever I mention something that I&#39;ve captured I get the roll of the\n&gt;&gt; eyes. Lol!\n&gt;&gt;\n&gt;&gt; I&#39;ve always been interested in ghost and ghost hunting. When I was little\n&gt;&gt; my mother would tell me that she would always hear boxes being thrown around\n&gt;&gt; in the basement and thought it to be a ghost. She also said that she would\n&gt;&gt; hear footsteps and feet being dragged across the long plastic runner that we\n&gt;&gt; had in front of the basement door. She would get up thinking it was one of\n&gt;&gt; us kids and we would be sound asleep. So, naturally my interest grew. I\n&gt;&gt; never seen anything unusual but I would always &#39;feel&#39; something in that\n&gt;&gt; house. When I got older, married, and had my own kids I lived in a\n&gt;&gt; questionable house for 11 years. We would hear footsteps in the attic, the\n&gt;&gt; kids would complain of seeing &#39;uncle Sam&#39; standing in the bathroom doorway,\n&gt;&gt; or a man walking through the bedroom. Of course I never believed them. I\n&gt;&gt; asked my son when he got older and he remembered the man in great detail.\n&gt;&gt; Turns out it was a man/spirit in period clothing with a long white beard and\n&gt;&gt; top hat. Hence the &#39;uncle Sam&#39; character. I have seen a female child\n&gt;&gt; apparition standing in the doorway to which I had a witness, my\n&gt;&gt; sister-in-law who saw the same thing at the same time. We thought it was one\n&gt;&gt; of our kids and quickly counted heads and it wasn&#39;t one of our own. The\n&gt;&gt; apparition vanished and we never saw it again. I have heard music playing in\n&gt;&gt; the basement and a man coughing when I&#39;ve been home alone. A roommate of\n&gt;&gt; mine had her shirt tugged on and she thought it was me but I wasn&#39;t home\n&gt;&gt; from work yet. She locked herself in her room, scared to death until I came\n&gt;&gt; home. The stories go on and on.\n&gt;&gt;\n&gt;&gt; I moved from that home and now I am having strange things occur in this\n&gt;&gt; house. I should note that I am over a thousand miles from my previous\n&gt;&gt; &#39;haunted&#39; home. I&#39;ve lived here 4 yrs and one day I seen a little ball of\n&gt;&gt; light (ORB) shoot out of my bedroom and go into my husband&#39;s chair. I have\n&gt;&gt; seen a few shadows and have felt that creepy feeling where my hair stands on\n&gt;&gt; end many times. So, I decided to get a digital recorder. Not thinking that I\n&gt;&gt; would ever capture anything. I also wanted to use it to debunk EVPs and find\n&gt;&gt; some Scientific explanation for them. I was wrong. I captured my first EVP\n&gt;&gt; in the master bedroom of my home. It said, &quot;I have no love&quot;. Ok, that got my\n&gt;&gt; attention. I tried to debunk it and could not. I decided to perform many EVP\n&gt;&gt; sessions in my bedroom and have caught a lot of them. I have asked questions\n&gt;&gt; and ask to knock for yes to certain questions. By doing so I figured out\n&gt;&gt; that it was a Hispanic woman who had been murdered. After some research I\n&gt;&gt; have since found out that yes someone had died in this house. One of the\n&gt;&gt; previous tenants claimed there was a ghost here and even went so far as to\n&gt;&gt; get the house cleansed. I must have brought it back by summoning it while\n&gt;&gt; conducting my EVP sessions.\n&gt;&gt;\n&gt;&gt; My fascination grew now that I was actually capturing real evidence. I\n&gt;&gt; have since went on tours of supposedly haunted places such as: Vulture Mine,\n&gt;&gt; Arizona, The Bird Cage Theatre Tombstone, Arizona, the San Carlos Hotel,\n&gt;&gt; Phoenix, and Goldfield Ghost Town, Arizona. I am new at this so I haven&#39;t\n&gt;&gt; been on any investigations on a team. I do it alone. The only equipment that\n&gt;&gt; I&#39;ve been using is a digital camera and recorder. My main interest is\n&gt;&gt; capturing something paranormal on film or EVPs.\n&gt;&gt;\n&gt;&gt; I have recently made a couple of trips to a local cemetery, during the\n&gt;&gt; day, middle of the afternoon and have caught amazing EVPs. I have captured\n&gt;&gt; many different voices and personalities. Some nice, some not so nice. Some\n&gt;&gt; women, men, and children. It amazes me because I cannot debunk them. I know\n&gt;&gt; for a fact that I&#39;m the only one there so they can&#39;t be explained. I know it\n&gt;&gt; wasn&#39;t me who I was hearing, so who is it? I&#39;m not sure if ghosts really\n&gt;&gt; exist or if they are all residual energy. Since capturing the voices\n&gt;&gt; actually answering my questions I am leaning toward that they really exist.\n&gt;&gt; There&#39;s just no denying. I now believe that some are residual and some are\n&gt;&gt; intelligent spirits. I enjoy EVPs because they are much harder to debunk.\n&gt;&gt; With photographs there is always that &#39;what if&#39; or well it could be a glare\n&gt;&gt; or a glitch in the camera. But with EVPs they are unmistakable.\n&gt;&gt;\n&gt;&gt; I&#39;m looking forward with getting to know everyone and sharing my\n&gt;&gt; experiences.\n&gt;&gt;\n&gt;&gt; Beth\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;    [image: FREE Animations for your email - by IncrediMail! Click Here!]&lt;http://www.incredimail.com/?id=619263&did=10500&ppd=2723,201108041216,9,1,603700125098939438&rui=141495584&sd=20111006&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;  \n&gt;\n\n\n\n-- \nVicky\n\nI jus lea ned a lo .She didn' do any hing w ong.On Tue, Oc 11, 2011 a 7:52 PM, F ank Sump ion pu plealiengi l@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n  Almos 900 membe s and ze o discussion. I see poeple join all he ime saying hey wan o lea n-- hen no hin'. P obly be e o on Face Book. \n \n Pa o i is ha no ma e wha one says, he e is an expe ha knows be e , someone o ell you wha you EVPs eally say. \n \n I don' do in es iga ions, and emain kinda skep ical aoub haun ings and jus how much \"e idence\" is sugges ion o expec a ion.  I do know ya do no ha e o go o he huan ed ho spo o ge spi i communica ions. \n\n\n\n\n \nF-S\nOn Thu, Oc 6, 2011 a 8:07 PM, be h2ma ilyn@... be h2ma ilyn@...> w o e:\n\n\n\n\n\n  \n\n\n\n\n\n\n\n\n\n\nHello e e yone! My name is Be h and I am new o his g oup! Thank you o he owne s/mode a o s who app o ed my membe ship! I was looking o a g oup o pa ano mal in es iga o s who enjoy alking abou he pa ano mal as much as I do. My amily and iends seem o be sick o me alking abou i and whene e I men ion some hing ha I' e cap u ed I ge he oll o he eyes. Lol! \n\n\n\n\n \nI' e always been in e es ed in ghos and ghos hun ing. When I was li le my mo he would ell me ha she would always hea boxes being h own a ound in he basemen and hough i o be a ghos . She also said ha she would hea oo s eps and ee being d agged ac oss he long plas ic unne ha we had in on o he basemen doo . She would ge up hinking i was one o us kids and we would be sound asleep. So, na u ally my in e es g ew. I ne e seen any hing unusual bu I would always ' eel' some hing in ha house. When I go olde , ma ied, and had my own kids I li ed in a ques ionable house o 11 yea s. We would hea oo s eps in he a ic, he kids would complain o seeing 'uncle Sam' s anding in he ba h oom doo way, o a man walking h ough he bed oom. O cou se I ne e belie ed hem. I asked my son when he go olde and he emembe ed he man in g ea de ail. Tu ns ou i was a man/spi i in pe iod clo hing wi h a long whi e bea d and op ha . Hence he 'uncle Sam' cha ac e . I ha e seen a emale child appa i ion s anding in he doo way o which I had a wi ness, my sis e -in-law who saw he same hing a he same ime. We hough i was one o ou kids and quickly coun ed heads and i wasn' one o ou own. The appa i ion anished and we ne e saw i again. I ha e hea d music playing in he basemen and a man coughing when I' e been home alone. A oomma e o mine had he shi ugged on and she hough i was me bu I wasn' home om wo k ye . She locked he sel in he oom, sca ed o dea h un il I came home. The s o ies go on and on. \n\n\n\n\n \nI mo ed om ha home and now I am ha ing s ange hings occu in his house. I should no e ha I am o e a housand miles om my p e ious 'haun ed' home. I' e li ed he e 4 y s and one day I seen a li le ball o ligh (ORB) shoo ou o my bed oom and go in o my husband's chai . I ha e seen a ew shadows and ha e el ha c eepy eeling whe e my hai s ands on end many imes. So, I decided o ge a digi al eco de . No hinking ha I would e e cap u e any hing. I also wan ed o use i o debunk EVPs and ind some Scien i ic explana ion o hem. I was w ong. I cap u ed my i s EVP in he mas e bed oom o my home. I said, \"I ha e no lo e\". Ok, ha go my a en ion. I ied o debunk i and could no . I decided o pe o m many EVP sessions in my bed oom and ha e caugh a lo o hem. I ha e asked ques ions and ask o knock o yes o ce ain ques ions. By doing so I igu ed ou ha i was a Hispanic woman who had been mu de ed. A e some esea ch I ha e since ound ou ha yes someone had died in his house. One o he p e ious enan s claimed he e was a ghos he e and e en wen so a as o ge he house cleansed. I mus ha e b ough i back by summoning i while conduc ing my EVP sessions. \n\n\n\n\n \nMy ascina ion g ew now ha I was ac ually cap u ing eal e idence. I ha e since wen on ou s o supposedly haun ed places such as: Vul u e Mine, A izona, The Bi d Cage Thea e Tombs one, A izona, he San Ca los Ho el, Phoenix, and Gold ield Ghos Town, A izona. I am new a his so I ha en' been on any in es iga ions on a eam. I do i alone. The only equipmen ha I' e been using is a digi al came a and eco de . My main in e es is cap u ing some hing pa ano mal on ilm o EVPs. \n\n\n\n\n \nI ha e ecen ly made a couple o ips o a local ceme e y, du ing he day, middle o he a e noon and ha e caugh amazing EVPs. I ha e cap u ed many di e en oices and pe sonali ies. Some nice, some no so nice. Some women, men, and child en. I amazes me because I canno debunk hem. I know o a ac ha I'm he only one he e so hey can' be explained. I know i wasn' me who I was hea ing, so who is i ? I'm no su e i ghos s eally exis o i hey a e all esidual ene gy. Since cap u ing he oices ac ually answe ing my ques ions I am leaning owa d ha hey eally exis . The e's jus no denying. I now belie e ha some a e esidual and some a e in elligen spi i s. I enjoy EVPs because hey a e much ha de o debunk. Wi h pho og aphs he e is always ha 'wha i ' o well i could be a gla e o a gli ch in he came a. Bu wi h EVPs hey a e unmis akable. \n\n\n\n\n \nI'm looking o wa d wi h ge ing o know e e yone and sha ing my expe iences. \n \nBe h\n \n \n\n \n \n \n\n\n\n\n\n\n \n\n\n\n\n \n \n\n \n \n\n\n\n\n\n\n \n\n\n\n\n\n\n-- Vicky"}