{"id": "22110", "subject": "Re: Video of the &quot;Edison Box&quot;", "author": "cfelton116", "timestamp": "2011-11-08T00:06:38Z", "full_text": "Nicely said Jay!\n\nIn the end, does your device work?  That is the only thing that&#39;s important.  Anyone can clip a wire and get spirit communication, but few actually take it upon themselves to try to design something that can improve the communications with spirits.\n\nMaybe if people didn&#39;t get so offended and worked together this research could truly advance instead of remaining stagnant.\n\nFor the work I do, I need to have the most reliable spirit communication device.  I find radios to be a very poor tool, but a tool non the less.  No matter how well the sweep circuit works, it is still a radio.  That is why I got out of the box and started testing to determine the extents of what the spirits can affect so I can build something more reliable.\n\nlets move forward.\n\n-Chris\n\n\n--- In EVP-ITC@yahoogroups.com, JayW Prather &lt;jaywprather@...&gt; wrote:\n&gt;\n&gt; Wow so much for unity and research for the common good of all. I really dont give a rat&#39;s ass what anything is called as long as people keep researching,experimenting and building things. If one doesnt work, oh well we just take it back to the bench and build a new one, to hell with what is it called or who built it. I have hacked over 25 different radio brands and/or models and by hack I dont mean just snipping a wire, some I  turn it into little pieces and start over with a whole new 2,3 or even a 4 brand hybrid. And by then the name of it ,or even who I am, is irrelevent the only thing that matters is &quot;does it work or not?&quot; Not trying to piss on any shoes but this just got really weird, really quick and we (the builders)dont matter the only thing that should is the equipment and what it can do. Sorry if I offended anyone.\n&gt;  \n&gt; Jay W. Prather\n&gt; \n&gt; \n&gt; ________________________________\n&gt; From: Ursula Kalin &lt;kalinu@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Monday, November 7, 2011 6:05 PM\n&gt; Subject: Re: [EVP-ITC] Re: Video of the &quot;Edison Box&quot;\n&gt; \n&gt; \n&gt;  \n&gt;    \n&gt;  \n&gt;  \n&gt; so you call radio shacks Frank Box? because I correct people who call those Frank Boxes...for the record\n&gt;  spirit Medium Ursula Kalin\n&gt; Paranormal Tour & Events\n&gt; Readings, Private &quot;Frank Box&quot; sessions,\n&gt; Enchanted candles & more \n&gt; \n&gt; \n&gt; http://www.ursulakalin.com/page/page/8051317.htm\n&gt; \n&gt; \n&gt; Ursula Kalin \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; ________________________________\n&gt;  From: don powell &lt;dpowell7299@...&gt;\n&gt; To: &quot;EVP-ITC@yahoogroups.com&quot; &lt;EVP-ITC@yahoogroups.com&gt;\n&gt; Sent: Mon, November 7, 2011 1:25:13 PM\n&gt; Subject: Re: [EVP-ITC] Re: Video of the &quot;Edison Box&quot;\n&gt; \n&gt;   \n&gt; \n&gt;  \n&gt; Not to mention that Edison never built his spirit phone.  He only theorized that such a device *could* be built.  People really need to do 15 mins worth of research before naming these things :)) \n&gt;  \n&gt; Don \n&gt;  \n&gt; For the record, I correct everyone around me that call them anything but Frank&#39;s box. \n&gt;  \n&gt; \n&gt; ________________________________\n&gt;  From: purplespacefriend &lt;purplealiengirl@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Monday, November 7, 2011 12:19 PM\n&gt; Subject: [EVP-ITC] Re: Video of the &quot;Edison Box&quot;\n&gt; \n&gt; \n&gt;   \n&gt; 1-Calling an Edison box is sham and scam. A way of trying to lend credbility to it, and remove me from box history, and it does look suspicioulsy like what I make. It is also ignoring all EVI-ITC history of the last one hundred years. How many here realize the ghost box, or radio sweep method used to be called Direct Radio Voice, and has long history? I have never heard any stories of Edison getting radio contacts wioht spirit.\n&gt; How many have even done five minutes of research on the history of EVP. I can tell ya, none! No, y&#39;all want to sit in the dark and ask what color your shirt is then claim to be great researchers and experts. \n&gt; \n&gt; 2-I doubt that it truely random, I&#39;d like to see a scope vid of the sweep modes. \n&gt; \n&gt; I wouldn&#39;t have problem, but these people like the one putting on this video belittle and insult me in public. For what? For their own fame and fortune. Then try to copy Chirs Moon, and blame the concept on Edison--freaking\n&gt;  clueless, all of you!\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Urkel23&quot; &lt;urkel23@&gt; wrote:\n&gt; &gt;\n&gt; &gt; \n&gt; &gt; This video explains all the features of the box. So, get some popcorn and enjoy.\n&gt; &gt; \n&gt; &gt; This is the first box to have shack hack modes as well as linear and random adjustable sweeps.\n&gt; &gt; \n&gt; &gt; Also, the only box other than the &quot;Minibox&quot; to have a working random circuit in it. \n&gt; &gt; \n&gt; &gt; The video:\n&gt; &gt; \n&gt; &gt; http://www.youtube.com/watch?v=9539MtbvRc4\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; -Steve H.\n&gt; &gt;\n&gt;"}