{"id": "22113", "subject": "Re: Video of the &quot;Edison Box&quot;", "author": "purplespacefriend", "timestamp": "2011-11-08T03:59:04Z", "full_text": "I absolutely do not care about others making boxes. That is not the problem I have, it&#39;s others that try to take over the &quot;invention&quot;, almost claiming it as their own, and if you fail to properly kiss his ass, then you get publically insulted and belittled. He&#39;s done it with other people besides me, recall Joe&#39;s Box, and the Mini Box. Nothing wosre than someone that uses other people&#39;s work to make a name for himself.\n\n Then, all forget there is a history to radio voices, it goes back to the first invention of radio, in the beginning, it used to be called Direct Radio Voice, no one here is inventing anything new. As far as different sweep modes aka Random, as far as I can tell --useless. As far Edison--no evidence to show he made any of this stuff. \n\n No one gets concept, provide the raw audio and they will talk. Doesn&#39;t matter how you make bits of speech, anything will work. \n\n No matter how fancy you make the technology, it turns into a joke when people sit in a dark room and ask what color their underwear is, and insist on enhancing any fear of spirit communication.\n\n Yeah, I know---who cares--where&#39;s my fame and fortune!? is the onlyest qquestion. \n\nF-S\n \n--- In EVP-ITC@yahoogroups.com, JayW Prather &lt;jaywprather@...&gt; wrote:\n&gt;\n&gt; We all start somewhere in this field and we all have different levels of ability, but that should never stop any of us from attempting to accomplish something that we invision might be worth building. Just Do It! Now that I did steal from Nike,sry Nike get over it. Keep all the work guys and thanks to everyone that has ever even tryed to follow an idea and big thx to those that succeded.\n&gt;  \n&gt; Jay W Prather\n&gt; \n&gt; \n&gt; ________________________________\n&gt; From: cfelton116 &lt;cfelton@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Monday, November 7, 2011 7:06 PM\n&gt; Subject: [EVP-ITC] Re: Video of the &quot;Edison Box&quot;\n&gt; \n&gt; \n&gt;  \n&gt;    \n&gt;  \n&gt; \n&gt; Nicely said Jay!\n&gt; \n&gt; In the end, does your device work?  That is the only thing that&#39;s important.  Anyone can clip a wire and get spirit communication, but few actually take it upon themselves to try to design something that can improve the communications with spirits.\n&gt; \n&gt; Maybe if people didn&#39;t get so offended and worked together this research could truly advance instead of remaining stagnant.\n&gt; \n&gt; For the work I do, I need to have the most reliable spirit communication device.  I find radios to be a very poor tool, but a tool non the less.  No matter how well the sweep circuit works, it is still a radio.  That is why I got out of the box and started testing to determine the extents of what the spirits can affect so I can build something more reliable.\n&gt; \n&gt; lets move forward.\n&gt; \n&gt; -Chris\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, JayW Prather &lt;jaywprather@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Wow so much for unity and research for the common good of all. I really dont give a rat&#39;s ass what anything is called as long as people keep researching,experimenting and building things. If one doesnt work, oh well we just take it back to the bench and build a new one, to hell with what is it called or who built it. I have hacked overÂ 25 differentÂ radio brands and/or modelsÂ and by hack I dont mean just snipping a wire, some IÂ  turn it into little pieces and start over with a whole new 2,3 or even a 4 brand hybrid. And by then the name of it ,or even who I am, is irrelevent the only thing that matters is &quot;does it work or not?&quot; Not trying to piss on any shoes but this just got really weird, really quick and we (the builders)dont matter the only thing that should is the equipment and what it can do. Sorry if I offended anyone.\n&gt; &gt; Â \n&gt; &gt; Jay W. Prather\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; ________________________________\n&gt; &gt; From: Ursula Kalin &lt;kalinu@&gt;\n&gt; &gt; To: EVP-ITC@yahoogroups.com\n&gt; &gt; Sent: Monday, November 7, 2011 6:05 PM\n&gt; &gt; Subject: Re: [EVP-ITC] Re: Video of the &quot;Edison Box&quot;\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; Â  \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; so you call radio shacks Frank Box? because I correct people who call those Frank Boxes...for the record\n&gt; &gt; Â spirit Medium Ursula Kalin\n&gt; &gt; Paranormal Tour & Events\n&gt; &gt; Readings, Private &quot;Frank Box&quot; sessions,\n&gt; &gt; Enchanted candles & more \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; http://www.ursulakalin.com/page/page/8051317.htm\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; Ursula Kalin \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; ________________________________\n&gt; &gt;  From: don powell &lt;dpowell7299@&gt;\n&gt; &gt; To: &quot;EVP-ITC@yahoogroups.com&quot; &lt;EVP-ITC@yahoogroups.com&gt;\n&gt; &gt; Sent: Mon, November 7, 2011 1:25:13 PM\n&gt; &gt; Subject: Re: [EVP-ITC] Re: Video of the &quot;Edison Box&quot;\n&gt; &gt; \n&gt; &gt; Â  \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; Not to mention that Edison never built his spirit phone. Â He only theorized that such a device *could* be built. Â People really need to do 15 mins worth of research before naming these things :)) \n&gt; &gt; \n&gt; &gt; Don \n&gt; &gt; \n&gt; &gt; For the record, I correct everyone around me that call themÂ anythingÂ but Frank&#39;s box. \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; ________________________________\n&gt; &gt;  From: purplespacefriend &lt;purplealiengirl@&gt;\n&gt; &gt; To: EVP-ITC@yahoogroups.com\n&gt; &gt; Sent: Monday, November 7, 2011 12:19 PM\n&gt; &gt; Subject: [EVP-ITC] Re: Video of the &quot;Edison Box&quot;\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; Â  \n&gt; &gt; 1-Calling an Edison box is sham and scam. A way of trying to lend credbility to it, and remove me from box history, and it does look suspicioulsy like what I make. It is also ignoring all EVI-ITC history of the last one hundred years. How many here realize the ghost box, or radio sweep method used to be called Direct Radio Voice, and has long history? I have never heard any stories of Edison getting radio contacts wioht spirit.\n&gt; &gt; How many have even done five minutes of research on the history of EVP. I can tell ya, none! No, y&#39;all want to sit in the dark and ask what color your shirt is then claim to be great researchers and experts. \n&gt; &gt; \n&gt; &gt; 2-I doubt that it truely random, I&#39;d like to see a scope vid of the sweep modes. \n&gt; &gt; \n&gt; &gt; I wouldn&#39;t have problem, but these people like the one putting on this video belittle and insult me in public. For what? For their own fame and fortune. Then try to copy Chirs Moon, and blame the concept on Edison--freaking\n&gt; &gt;  clueless, all of you!\n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;Urkel23&quot; &lt;urkel23@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; \n&gt; &gt; &gt; This video explains all the features of the box. So, get some popcorn and enjoy.\n&gt; &gt; &gt; \n&gt; &gt; &gt; This is the first box to have shack hack modes as well as linear and random adjustable sweeps.\n&gt; &gt; &gt; \n&gt; &gt; &gt; Also, the only box other than the &quot;Minibox&quot; to have a working random circuit in it. \n&gt; &gt; &gt; \n&gt; &gt; &gt; The video:\n&gt; &gt; &gt; \n&gt; &gt; &gt; http://www.youtube.com/watch?v=9539MtbvRc4\n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; -Steve H.\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}