{"id": "22126", "subject": "No one gets the concept.", "author": "Frank Sumption", "timestamp": "2011-11-08T08:30:42Z", "full_text": "The purpose of the box--aka a swept radio is to provide a source of broken\nspeech and other sound--known as raw audio--a term borrowed from EVPmaker,\nwhich the entities use to form their voices. All these self proclaimed\ngeniuses and experts making all kinds of claims about how they improve the\nboxes, have no clue about how it works. It&#39;s only function is to develop\nraw audio, it make no difference how the sweep is done, it can be done by\nhand, it can be just a very small portion of any given radio band, it can\njust tune a radio between stations on a night when there is skip, distant\nstations fading in and out. Radio is just one way of developing raw audio.\n\n So, explain to me how some over complicated sweep mode  is going to make\nan improvement. If ya want self aggrandizement, go over to Hultays group,\nRTSC.\n\n True, I don&#39;t support ghost hunting, cuz I think it&#39;s a focus on darkness,\nbut that doesn&#39;t mean the boxes don&#39;t work in those conditions, and there\naren&#39;t any valid responses from it.  I can turn on a box anytime day or\nnight, and someone--disembodied--presumably, is right there to start\ntalking, even with the lights on. When I see the BS on TV, everyone sitting\nin the dark--I&#39;m thinking what is wrong with these people!? When someone\nsays they need boxes or that kind of research, I am not going to take you\nserious, it means you have no idea what this is. You think spirit is some\nkind of mindless zombie stuck in abandoned buildings--pure Hollywood! That\nhaunting idea is so ingrained, and programmed into people that y&#39;all would\nrather believe I am some lying thieving SOB than question your reality.\n\n I don&#39;t need this crap, I do this &quot;research&quot; for my own curiosity, and I\nstill believe it was a mistake--a huge mistake-- to share the box idea.\nHumanity has no clue how to use it, what it&#39;s for, and it ain&#39;t to make one\nrich and famous.\n\n Besides, who the hell is anyone to say what the boxes and EVP tell me\nabout myself and who I am, as well as a verity of topics,  to say they know\nbetter?\n\n\n F-S\n\nThe pu pose o he box--aka a swep adio is o p o ide a sou ce o b oken speech and o he sound--known as aw audio--a e m bo owed om EVPmake , which he en i ies use o o m hei oices. All hese sel p oclaimed geniuses and expe s making all kinds o claims abou how hey imp o e he boxes, ha e no clue abou how i wo ks. I 's only unc ion is o de elop aw audio, i make no di e ence how he sweep is done, i can be done by hand, i can be jus a e y small po ion o any gi en adio band, i can jus une a adio be ween s a ions on a nigh when he e is skip, dis an s a ions ading in and ou . Radio is jus one way o de eloping aw audio. \n\n \n So, explain o me how some o e complica ed sweep mode  is going o make an imp o emen . I ya wan sel agg andizemen , go o e o Hul ays g oup, RTSC.\n \n T ue, I don' suppo ghos hun ing, cuz I hink i 's a ocus on da kness, bu ha doesn' mean he boxes don' wo k in hose condi ions, and he e a en' any alid esponses om i .  I can u n on a box any ime day o nigh , and someone--disembodied--p esumably, is igh he e o s a alking, e en wi h he ligh s on. When I see he BS on TV, e e yone si ing in he da k--I'm hinking wha is w ong wi h hese people!? When someone says hey need boxes o ha kind o esea ch, I am no going o ake you se ious, i means you ha e no idea wha his is. You hink spi i  is some kind o mindless zombie s uck in abandoned buildings--pu e Hollywood! Tha haun ing idea is so ing ained, and p og ammed in o people ha y'all would a he belie e I am some lying hie ing SOB han ques ion you eali y. \n\n \n I don' need his c ap, I do his \" esea ch\" o my own cu iosi y, and I s ill belie e i was a mis ake--a huge mis ake-- o sha e he box idea. Humani y has no clue how o use i , wha i 's o , and i ain' o make one ich and amous.  \n\n \n Besides, who he hell is anyone o say wha he boxes and EVP ell me abou mysel and who I am, as well as a e i y o opics,   o say hey know be e ? \n \n \n F-S"}