{"id": "22120", "subject": "Re: Video of the &quot;Edison Box&quot;", "author": "purplespacefriend", "timestamp": "2011-11-08T05:01:24Z", "full_text": "So, just to be clear, who in fact made &quot;The Edison Box? You might see in one of Hultay&#39;s latest posts, he pretty much claims he made it. \n\n I have shared all I do, posted schematics everywhere on the web, and yet people accuse me of being negative, and the meanest bastard that ever lived when I camplain about being lied about, ripped off, disrespected and insulted. \n\n As far Edison---I don&#39;t care!! \n\n F-S\n\n--- In EVP-ITC@yahoogroups.com, &quot;cfelton116&quot; &lt;cfelton@...&gt; wrote:\n&gt;\n&gt; \n&gt; OK, I have to chime in here.\n&gt; \n&gt; A name is just a name.  Because I put Edison on the box has no bearing on whether or not he actually achieved spirit communications.  The SB#3 was labeled Edison strictly for the person that wanted it.  He said Edison helps and has helped him and there is no reason he cannot have Edison on his box.\n&gt; \n&gt; The fact is, it is a scanning radio to try to pick up the voices from spirits.  Come on. bitching about a name.  Glad my name isn&#39;t Edison.\n&gt; \n&gt; For you Frank,  not a single part of your circuit design went into SB#3.  I did analyze your design and found many flaws especially in the Random noise circuit.  For that reason alone, I could not use it.  I am not trying to put you down in any way; you were the one that brought radio scanning into the forefront.\n&gt; \n&gt; I have been designing electronic circuits since I was 7yrs old.  I am 41 now.  I completely understand electronics and love to push the limits of physics and beyond.  This radio sweep circuit is nothing.  It is not complicated electronics at all.  Just do a few calculations to make sure you are amplifying and filtering correctly and build.  I find this rather basic.\n&gt; \n&gt; I am sorry you feel I took your box design by using wood.  Maybe I will use a different stain on the next one.\n&gt; \n&gt; I will get some videos of the different modes of operation on the o-scope., just so you can see for yourself, my circuit functions as I intended it too.\n&gt; \n&gt; If you would like, I can markup your schematics so your random circuit will function correctly.  You just need to remove and replace a  component, and change a few values.  Your random circuit was off right from the very first component.  How can you possibly get a reliable low frequency random noise circuit without using a known noise amount to begin with?\n&gt; \n&gt; I am not hear to bash anyone, and I do not expect that myself.  I am sorry you feel the way you do Frank, but you are entitled to feel how ever you want.  If you would like to continue bashing, I can meet you blow for blow technically and I know I will win.\n&gt; \n&gt; Enough said.  I will back up my circuit with proof!\n&gt; \n&gt; -Chris Felton\n&gt; cfelton116@...\n&gt;"}