{"id": "22128", "subject": "Re: [EVP-ITC] Re: Video of the &quot;Edison Box&quot;", "author": "BR", "timestamp": "2011-11-08T13:13:43Z", "full_text": "As far as sitting in the dark at night -- It&#39;s simply because I&#39;ve found\nthat the rest of the world is asleep and other sounds are at a minimum.\nI&#39;ve done plenty of work in broad daylight.  Evening just allows me to cut\nout outside sounds like traffic, children, dogs, etc.\n\n\n\nOn Tue, Nov 8, 2011 at 1:51 AM, Ursula Kalin &lt;kalinu@...&gt; wrote:\n\n&gt; **\n&gt;\n&gt;\n&gt; That is what I use mine for i talk to my mom and my guides on a regular\n&gt; BASIC along with other love ones...just because i do tours does not mean I\n&gt; ghost hunt other ghost hunt I provide the service....period!!\n&gt;\n&gt; spirit Medium Ursula Kalin\n&gt; Paranormal Tour & Events\n&gt; Readings, Private &quot;Frank Box&quot; sessions,\n&gt; Enchanted candles & more\n&gt;\n&gt;\n&gt; http://www.ursulakalin.com/page/page/8051317.htm\n&gt;\n&gt;\n&gt; Ursula Kalin\n&gt;\n&gt;\n&gt;  ------------------------------\n&gt; *From:* purplespacefriend &lt;purplealiengirl@...&gt;\n&gt; *To:* EVP-ITC@yahoogroups.com\n&gt; *Sent:* Mon, November 7, 2011 11:54:51 PM\n&gt;\n&gt; *Subject:* [EVP-ITC] Re: Video of the &quot;Edison Box&quot;\n&gt;\n&gt;\n&gt;\n&gt; My aplogies! I don&#39;t mean to offend, and I am no engineer, and know\n&gt; someone can make this crap better. But after years of being insulted,\n&gt; belittled by skpetic and believers alike, I have reached a saturation\n&gt; point. I&#39;m not gonna take anymore. Have someone saying I ripped off the\n&gt; idea-someone that has no clue about electronics, yet claiming I resisted\n&gt; his help-just beyond all my tolerance a patience.\n&gt;\n&gt; I started this group, and by some accidental foresight gave owner ship to\n&gt; someone else, otherwise I would have deleted this thing. Endless\n&gt; arguements, and people seeking only to make a name for themselves off my\n&gt; work and the paranormal in general. Most get into this crap for ghost\n&gt; hunting, something I do not support as it is a focus on darkness and fear,\n&gt; nothing else. I think most--not all--hauntings are suggestion and\n&gt; Hollywood. No one wants to hear that, they want the fear, the negativity,\n&gt; and when I disagree, I am the evil bastard.\n&gt;\n&gt; I didn&#39;t make boxes for some duffus to sit in the dark with yelling\n&gt; retarded questions at a radio--that&#39;s stupid! It was to hear from guides\n&gt; and other spirits, and find there is an afterlife. You can do that at home.\n&gt; Once again, everyone is gonna know better, after all you have to go the\n&gt; haunted hot spots cuz they have the portals--more pure BS.\n&gt;\n&gt; I think I should just withdraw from this insanity, I made this stuff for\n&gt; my own curiosity, and obviously, it does not apply to the real world.\n&gt;\n&gt; F-S\n&gt;\n&gt;  \n&gt;\n\nAs a as si ing in he da k a nigh -- I 's simply because I' e ound ha he es o he wo ld is asleep and o he sounds a e a a minimum.  I' e done plen y o wo k in b oad dayligh .  E ening jus allows me o cu ou ou side sounds like a ic, child en, dogs, e c.\nOn Tue, No 8, 2011 a 1:51 AM, U sula Kalin kalinu@sbcglobal.ne > w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n \nTha is wha I use mine o i  alk o my mom and my guides on a egula BASIC along wi h o he lo e ones...jus because i do ou s does no mean I ghos hun o he ghos hun I p o ide he se ice....pe iod!! \nspi i Medium U sula KalinPa ano mal Tou & E en sReadings, P i a e \"F ank Box\" sessions,Enchan ed candles & mo e \n\nh p://www.u sulakalin.com/page/page/8051317.h m\nU sula Kalin \n\n\n\n\nF om: pu plespace iend pu plealiengi l@...>To: EVP-ITC@yahoog oups.com\nSen : Mon, No embe 7, 2011 11:54:51 PMSubjec : [EVP-ITC] Re: Video o he \"Edison Box\"\n\n  \n\nMy aplogies! I don' mean o o end, and I am no enginee , and know someone can make his c ap be e . Bu a e yea s o being insul ed, beli led by skpe ic and belie e s alike, I ha e eached a sa u a ion poin . I'm no gonna ake anymo e. Ha e someone saying I ipped o he idea-someone ha has no clue abou elec onics, ye claiming I esis ed his help-jus beyond all my ole ance a pa ience. \nI s a ed his g oup, and by some acciden al o esigh ga e owne ship o someone else, o he wise I would ha e dele ed his hing. Endless a guemen s, and people seeking only o make a name o hemsel es o my wo k and he pa ano mal in gene al. Mos ge in o his c ap o ghos hun ing, some hing I do no suppo as i is a ocus on da kness and ea , no hing else. I hink mos --no all--haun ings a e sugges ion and Hollywood. No one wan s o hea ha , hey wan he ea , he nega i i y, and when I disag ee, I am he e il bas a d. \nI\n didn' make boxes o some du us o si in he da k wi h yelling e a ded ques ions a a adio-- ha 's s upid! I was o hea om guides and o he spi i s, and ind he e is an a e li e. You can do ha a home. Once again, e e yone is gonna know be e , a e all you ha e o go he haun ed ho spo s cuz hey ha e he po als--mo e pu e BS. \nI hink I should jus wi hd aw om his insani y, I made his s u o my own cu iosi y, and ob iously, i does no apply o he eal wo ld. F-S"}