{"id": "22133", "subject": "Re: Video of the &quot;Edison Box&quot;", "author": "cfelton116", "timestamp": "2011-11-08T15:06:02Z", "full_text": "I have found, it doesn&#39;t matter what time of day or where you are physically at, the spirits can speak to you through the box.\n\nI use mine for missing person cases, and I don&#39;t need to go on site anywhere to get reliable information.  I prefer to sit in my house and ask the spirits for help or to get a spirit that can help me.  Going on site is a PIA and is not needed.\n\n-Chris\n\n--- In EVP-ITC@yahoogroups.com, BR &lt;alongadifferentpath@...&gt; wrote:\n&gt;\n&gt; As far as sitting in the dark at night -- It&#39;s simply because I&#39;ve found\n&gt; that the rest of the world is asleep and other sounds are at a minimum.\n&gt; I&#39;ve done plenty of work in broad daylight.  Evening just allows me to cut\n&gt; out outside sounds like traffic, children, dogs, etc.\n&gt; \n&gt; \n&gt; \n&gt; On Tue, Nov 8, 2011 at 1:51 AM, Ursula Kalin &lt;kalinu@...&gt; wrote:\n&gt; \n&gt; &gt; **\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; That is what I use mine for i talk to my mom and my guides on a regular\n&gt; &gt; BASIC along with other love ones...just because i do tours does not mean I\n&gt; &gt; ghost hunt other ghost hunt I provide the service....period!!\n&gt; &gt;\n&gt; &gt; spirit Medium Ursula Kalin\n&gt; &gt; Paranormal Tour & Events\n&gt; &gt; Readings, Private &quot;Frank Box&quot; sessions,\n&gt; &gt; Enchanted candles & more\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; http://www.ursulakalin.com/page/page/8051317.htm\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Ursula Kalin\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;  ------------------------------\n&gt; &gt; *From:* purplespacefriend &lt;purplealiengirl@...&gt;\n&gt; &gt; *To:* EVP-ITC@yahoogroups.com\n&gt; &gt; *Sent:* Mon, November 7, 2011 11:54:51 PM\n&gt; &gt;\n&gt; &gt; *Subject:* [EVP-ITC] Re: Video of the &quot;Edison Box&quot;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; My aplogies! I don&#39;t mean to offend, and I am no engineer, and know\n&gt; &gt; someone can make this crap better. But after years of being insulted,\n&gt; &gt; belittled by skpetic and believers alike, I have reached a saturation\n&gt; &gt; point. I&#39;m not gonna take anymore. Have someone saying I ripped off the\n&gt; &gt; idea-someone that has no clue about electronics, yet claiming I resisted\n&gt; &gt; his help-just beyond all my tolerance a patience.\n&gt; &gt;\n&gt; &gt; I started this group, and by some accidental foresight gave owner ship to\n&gt; &gt; someone else, otherwise I would have deleted this thing. Endless\n&gt; &gt; arguements, and people seeking only to make a name for themselves off my\n&gt; &gt; work and the paranormal in general. Most get into this crap for ghost\n&gt; &gt; hunting, something I do not support as it is a focus on darkness and fear,\n&gt; &gt; nothing else. I think most--not all--hauntings are suggestion and\n&gt; &gt; Hollywood. No one wants to hear that, they want the fear, the negativity,\n&gt; &gt; and when I disagree, I am the evil bastard.\n&gt; &gt;\n&gt; &gt; I didn&#39;t make boxes for some duffus to sit in the dark with yelling\n&gt; &gt; retarded questions at a radio--that&#39;s stupid! It was to hear from guides\n&gt; &gt; and other spirits, and find there is an afterlife. You can do that at home.\n&gt; &gt; Once again, everyone is gonna know better, after all you have to go the\n&gt; &gt; haunted hot spots cuz they have the portals--more pure BS.\n&gt; &gt;\n&gt; &gt; I think I should just withdraw from this insanity, I made this stuff for\n&gt; &gt; my own curiosity, and obviously, it does not apply to the real world.\n&gt; &gt;\n&gt; &gt; F-S\n&gt; &gt;\n&gt; &gt;  \n&gt; &gt;\n&gt;"}