{"id": "22148", "subject": "Re: [EVP-ITC] Mirror, mirror on the wall.......", "author": "Laura OBryant", "timestamp": "2011-11-09T18:09:52Z", "full_text": "---2114655128-1679731798-1320862192=:20149\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n\n\nI have been reading the arguments for a few weeks now and can I say what =\r\nI think? Just as Newton and Einstein and others like them are giants, they =\r\nhave people such as Stephen Hawking that stand on their shoulders. The Hawk=\r\nings that stand on the shoulders of giants are no less genius in their own =\r\nright and should also be given credit also. But we can&#39;t forget that the gi=\r\nants themselves made mistakes and had failures along the way. They are no l=\r\ness than genius for their trial and errors as well as their successes. For =\r\nhad we not had the giants, failures and all, we would not advance any furth=\r\ner in technology and wisdom. :)\n\nAnother thought is many times ideas come a=\r\nround the same time in different locations. This is a phenomenon that has f=\r\nascinated me and I often wonder how 2 or more people can get the same thoug=\r\nht in roughly the same time period. Take for instance the discovery of smal=\r\nl particles in atoms (or molecules, I am rusty at my science sorry). There =\r\nwere scientists discovering these in different locations around the world a=\r\nt the same time! I&#39;m sure it can be argued that one scientist discovered th=\r\ne break through before another but it doesn&#39;t dispute the fact that both we=\r\nre working on the same thing in the same time period.=C2=A0\n\nSo for argumen=\r\nt sake let&#39;s give credit to those who have successfully engineered the spir=\r\nit boxes and those who have stood on the shoulders of the original inventor=\r\ns and keep in mind there may be a few of the original inventors at the same=\r\n time! You discovered it. GREAT! How wonderful that you contributed to some=\r\nthing so genius! I hope that you continue to experiment and enrich us with =\r\nyour findings and failings as those are important too. (Remember that Ediso=\r\nn failed many times with the light bulb before he got it right.) I would en=\r\ncourage all of you to go forward and advance your technologies and remember=\r\n there is always someone trying to steal fame and fortune. You can protect =\r\nyour ideas with patents before releasing them to the public if you are real=\r\nly concerned with ownership of originality.=C2=A0\n\nI hope I haven&#39;t overste=\r\npped my bounds but I want to reassure those who are frustrated that there a=\r\nre those who recognize genius and those who stand on shoulders from those w=\r\nho steal. Just because we are silent doesn&#39;t mean we are blind, deaf, and m=\r\nute. I hope this helps.=C2=A0\n\nLaura\n\n________________________________\nFrom=\r\n: David Koenig &lt;floridajakeblues@...&gt;\nTo: EVP-ITC@yahoogroups.com\nSen=\r\nt: Wednesday, November 9, 2011 12:14 PM\nSubject: Re: [EVP-ITC] Mirror, mirr=\r\nor on the wall.......\n\n\n=C2=A0 \nDon&#39;t do it!\n\n\nOn Wed, Nov 9, 2011 at 12:00=\r\n PM, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n\n \n&gt;=C2=A0 \n&gt;=C2=A0T=\r\nime for me to back the fuck up and look in the mirror. Since day one, one a=\r\nrguement after another over the boxes, what they are for, who can use it, h=\r\now one jerkoff or another is the master box user and determines who can use=\r\n the box,=C2=A0and always somebody claims my work no good, while theirs sup=\r\nerior.=C2=A0 I&#39;m jumping off this track, ya want it? You got it, someone el=\r\nse can have the loonies, the con men, the tricksters, the posers, and the &quot;=\r\nones that know better&quot;. Not getting sucked into the dark with this box crap=\r\n any longer,=C2=A0it was supposed to be for my own use anyway, y&#39;all simply=\r\n can&#39;t handle that level of spirit communication. Learned the hard way that=\r\n there is a reason why certain knowledge is withheld from the uninitiated. =\r\n=C2=A0I can&#39;t fix what I have done, all I can do is walk away. Like the guy=\r\n said &quot;you can&#39;t handle=C2=A0the truth!&quot; \n&gt;=C2=A0\n&gt;=C2=A0Not gonna debate i=\r\nt, been there done that, no one hears or listens, always &quot; Oh, I know so mu=\r\nch better&quot; is the response. &quot;For my research&quot;, yeah, heard that about five =\r\nhundred times! \n&gt;=C2=A0\n&gt;=C2=A0Time for me to seek the light side of the fo=\r\nrce--while there is still time. \n&gt;=C2=A0\n&gt;=C2=A0Frank Sumption\n\n \r\n---2114655128-1679731798-1320862192=:20149\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;&lt;body&gt;&lt;div style=3D&quot;color:#000; background-color:#fff; font-family:ti=\r\nmes new roman, new york, times, serif;font-size:14pt&quot;&gt;&lt;div&gt;&lt;span&gt;&lt;br&gt;&lt;/span=\r\n&gt;&lt;/div&gt;&lt;div&gt;I have been reading the arguments for a few weeks now and can I=\r\n say what I think? Just as Newton and Einstein and others like them are gia=\r\nnts, they have people such as Stephen Hawking that stand on their shoulders=\r\n. The Hawkings that stand on the shoulders of giants are no less genius in =\r\ntheir own right and should also be given credit also. But we can&#39;t forget t=\r\nhat the giants themselves made mistakes and had failures along the way. The=\r\ny are no less than genius for their trial and errors as well as their succe=\r\nsses. For had we not had the giants, failures and all, we would not advance=\r\n any further in technology and wisdom. :)&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;Another =\r\nthought is many times ideas come around the same time in different location=\r\ns. This is a phenomenon that has fascinated me and I often wonder how\n 2 or=\r\n more people can get the same thought in roughly the same time period. Take=\r\n for instance the discovery of small particles in atoms (or molecules, I am=\r\n rusty at my science sorry). There were scientists discovering these in dif=\r\nferent locations around the world at the same time! I&#39;m sure it can be argu=\r\ned that one scientist discovered the break through before another but it do=\r\nesn&#39;t dispute the fact that both were working on the same thing in the same=\r\n time period.&nbsp;&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;So for argument sake let&#39;s giv=\r\ne credit to those who have successfully engineered the spirit boxes and tho=\r\nse who have stood on the shoulders of the original inventors and keep in mi=\r\nnd there may be a few of the original inventors at the same time! You disco=\r\nvered it. GREAT! How wonderful that you contributed to something so genius!=\r\n I hope that you continue to experiment and enrich us with your findings an=\r\nd failings as those are important too. (Remember that Edison\n failed many t=\r\nimes with the light bulb before he got it right.) I would encourage all of =\r\nyou to go forward and advance your technologies and remember there is alway=\r\ns someone trying to steal fame and fortune. You can protect your ideas with=\r\n patents before releasing them to the public if you are really concerned wi=\r\nth ownership of originality.&nbsp;&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;I hope I haven&#39;=\r\nt overstepped my bounds but I want to reassure those who are frustrated tha=\r\nt there are those who recognize genius and those who stand on shoulders fro=\r\nm those who steal. Just because we are silent doesn&#39;t mean we are blind, de=\r\naf, and mute. I hope this helps.&nbsp;&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;Laura&lt;/div&gt;=\r\n&lt;div style=3D&quot;font-size: 14pt; font-family: &#39;times new roman&#39;, &#39;new york&#39;, =\r\ntimes, serif; &quot;&gt;&lt;div style=3D&quot;font-size: 12pt; font-family: &#39;times new roma=\r\nn&#39;, &#39;new york&#39;, times, serif; &quot;&gt;&lt;font size=3D&quot;2&quot; face=3D&quot;Arial&quot;&gt;&lt;hr size=3D=\r\n&quot;1&quot;&gt;&lt;b&gt;&lt;span style=3D&quot;font-weight:bold;&quot;&gt;From:&lt;/span&gt;&lt;/b&gt; David\n Koenig &lt=\r\n;floridajakeblues@...&gt;&lt;br&gt;&lt;b&gt;&lt;span style=3D&quot;font-weight: bold;&quot;&gt;To=\r\n:&lt;/span&gt;&lt;/b&gt; EVP-ITC@yahoogroups.com&lt;br&gt;&lt;b&gt;&lt;span style=3D&quot;font-weight: bold=\r\n;&quot;&gt;Sent:&lt;/span&gt;&lt;/b&gt; Wednesday, November 9, 2011 12:14 PM&lt;br&gt;&lt;b&gt;&lt;span style=\r\n=3D&quot;font-weight: bold;&quot;&gt;Subject:&lt;/span&gt;&lt;/b&gt; Re: [EVP-ITC] Mirror, mirror on=\r\n the wall.......&lt;br&gt;&lt;/font&gt;&lt;br&gt;\n&lt;div id=3D&quot;yiv469728489&quot;&gt;\n\n\n\n\n\n\n\n\n\n\n\n\n\n&lt;div=\r\n&gt;\n&lt;span style=3D&quot;display:none;&quot;&gt;&nbsp;&lt;/span&gt;\n\n\n\n    &lt;div id=3D&quot;yiv46972848=\r\n9ygrp-text&quot;&gt;\n      \n      \n      &lt;div&gt;Don&#39;t do it!&lt;br&gt;&lt;br&gt;&lt;/div&gt;&lt;div class=\r\n=3D&quot;yiv469728489gmail_quote&quot;&gt;On Wed, Nov 9, 2011 at 12:00 PM, Frank Sumptio=\r\nn &lt;span dir=3D&quot;ltr&quot;&gt;&lt;&lt;a rel=3D&quot;nofollow&quot; ymailto=3D&quot;mailto:purplealiengi=\r\nrl@...&quot; target=3D&quot;_blank&quot; href=3D&quot;mailto:purplealiengirl@...&quot;&gt;p=\r\nurplealiengirl@...&lt;/a&gt;&gt;&lt;/span&gt; wrote:&lt;br&gt;&lt;blockquote class=3D&quot;yiv4=\r\n69728489gmail_quote&quot; style=3D&quot;border-left:1px solid rgb(204, 204, 204);&quot;&gt;\n\n=\r\n\n\n&lt;u&gt;&lt;/u&gt;\n\n\n\n\n\n\n\n\n\n\n&lt;div style=3D&quot;background-color:rgb(255, 255, 255);&quot;&gt;\n&lt;s=\r\npan&gt;&nbsp;&lt;/span&gt;\n\n\n&lt;div&gt;\n  &lt;div&gt;\n\n\n    &lt;div&gt;\n      \n      \n      &lt;div&gt;&lt;/di=\r\nv&gt;&lt;div&gt;&nbsp;Time for me to back the fuck up and look in the mirror. Since =\r\nday one, one arguement after another over the boxes, what they are for, who=\r\n can use it, how one jerkoff or another is the master box user and determin=\r\nes who can use the box,&nbsp;and always somebody claims my work no good, wh=\r\nile theirs superior.&nbsp; I&#39;m jumping off this track, ya want it? You got =\r\nit, someone else can have the loonies, the con men, the tricksters, the pos=\r\ners, and the &quot;ones that know better&quot;. Not getting sucked into the dark with=\r\n this box crap any longer,&nbsp;it was supposed to be for my own use anyway=\r\n, y&#39;all simply can&#39;t handle that level of spirit communication. Learned the=\r\n hard way that there is a reason why certain knowledge is withheld from the=\r\n uninitiated. &nbsp;I can&#39;t fix what I have done, all I can do is walk away=\r\n. Like the guy said &quot;you can&#39;t handle&nbsp;the truth!&quot; &lt;/div&gt;\n\n\n&lt;div&gt;&nbsp;=\r\n&lt;/div&gt;\n&lt;div&gt;&nbsp;Not gonna debate it, been there done that, no one hears o=\r\nr listens, always &quot; Oh, I know so much better&quot; is the response. &quot;For my res=\r\nearch&quot;, yeah, heard that about five hundred times! &lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;=\r\n\n&lt;div&gt;&nbsp;Time for me to seek the light side of the force--while there is=\r\n still time. &lt;/div&gt;\n&lt;div&gt;&nbsp;&lt;/div&gt;\n&lt;div&gt;&nbsp;Frank Sumption&lt;/div&gt;\n\n\n   =\r\n &lt;/div&gt;\n     \n\n    \n    \n\n\n&lt;/div&gt;\n\n\n\n  \n\n\n\n\n\n\n&lt;/div&gt;&lt;/div&gt;&lt;/blockquote&gt;&lt;/di=\r\nv&gt;&lt;br&gt;\n\n\n    &lt;/div&gt;\n     \n\n\n\n&lt;/div&gt;\n\n\n\n\n\n&lt;/div&gt;&lt;br&gt;&lt;br&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/=\r\nbody&gt;&lt;/html&gt;\r\n---2114655128-1679731798-1320862192=:20149--"}