{"id": "22155", "subject": "Inter Comm Box", "author": "JayW", "timestamp": "2011-11-10T02:30:09Z", "full_text": "There seems to be alot of debate these days in the EVP/ITC field of research and development. I would like to say a bit about my devices and what they are and what there are for.\n My Inter Comm boxes are, so far, all portable, battery driven devices and the models I have released so far do no use linear sweep or random sweep generators. I have built some but I do not feel they are ready yet so they are still on the bench. Most of my Inter Comm boxes do have 2 speeds of scan but that is as far as I have gone in the models I have released to date.\n I make my boxes the way I choose because I feel that each one I have released so far is the way it should be. I have some that I have not released because they just did not perform as felt they should have.\n I have my beliefs and theorys on EVP/ITC just like everyone else does and I suppose that it is only right that I should put those thought and theorys out there to the public now that I am releasing my work however I will do that in a different medium and another time. This post is only about my work as it pertains to my recent releases. \nSome in the field claim and have claimed for years that to get true ITC you shoud use a device built by yourself, that is in tune with both you and the &quot;ones&quot; you are contacting. This statement has many merits that I will not go into at the moment but this does not necceserally mean that I should not sell my boxes ,or anyone else for that matter, to the public for their use. However if a person believes this strongly but purchases a device built by someone else anyway, it very well may not work for him/her simply on the grounds that do not believe it will work.\n I am aware that using batteries instead of Ac for supply does have its drawbacks as to the noise introduced into the circuit. However I have adopted the role of trying to produce devices that can be used for many of the different aspects of the paranormal field. I will not claim that each box I produce is perfect nor is the best design for any given task, only that they have performed there intended functions while in testing and I believe they will continue to function well in the field once it is sold.\n There are many out there that are still trying or have already stated that they have/know the perfect sweep circuit, and they may. I am not one of them, my devices are simply what I have stated. I build them as a service to the general paranormal field as another tool to help them. The fact that I love coming up with and building new designs is what I get from it. Each box can take from a week to 2 weeks and sell for under $300.00. So its not the money, I use that to keep buying more materials as well as equipment.\n I feel there is so much more to say and there is. I should try again later to continue this so that the public can get to know me and my devices better. For now I just wanted to post this in light of the vast differences in opinions that are fueling the debates out there right now. If anyone has any questions or opinions please post them to my wall for all to see. Positive or negative feedback is both welcome and appreciated.\n \nThank You for reading.\n Jay W Prather\n IDC: Interdimensional Communicator"}