{"id": "22150", "subject": "Re: [EVP-ITC] Re: Mirror, mirror on the wall.......", "author": "Laura OBryant", "timestamp": "2011-11-09T19:02:42Z", "full_text": "--0-203912490-1320865362=:27055\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n\n\nI got initiated into the paranormal 4 yrs ago and accidentally got my fir=\r\nst EVP 3 yrs ago. I went crazy searching for information about spirit boxes=\r\n. And what I found is that most people sing the praises of Frank&#39;s Ghost bo=\r\nx and Frank Sumption. I didn&#39;t know who Frank Sumption was (still don&#39;t kno=\r\nw you personally) but from what I could tell there were (are) many many peo=\r\nple who believe that Frank Sumption is a giant when it comes to spirit boxe=\r\ns.=C2=A0\n\nYou can&#39;t control what people say or do. But your work seems to s=\r\ntand on it&#39;s own merit. So it doesn&#39;t matter what your competitors say, it =\r\nstill stands that Frank Sumption is the giant among spirit boxes and is up =\r\nthere with Thomas Edison. You are letting them upset you when the reality i=\r\ns, you are still on top. So let them say what they want. And let them make =\r\nimprovements and have their own merit. From my point of view, as an outside=\r\nr looking in, they are standing on your shoulders. I have no vestment in th=\r\nis argument or in you and your rivals. Don&#39;t let them drive you insane with=\r\n their claims or weigh you down with unnecessary anger and bitterness. You =\r\nare doing just fine.=C2=A0\n\nQuestion now is, are you going to believe those=\r\n who anger you and tell you you are not the original creator OR are you goi=\r\nng to believe someone that is a total stranger that did her research a few =\r\nyears ago before stumbling onto this argument? And may I remind you I have =\r\nno vestment in this argument whatsoever? You could say I&#39;m biased since whe=\r\nn I researched I came to believe myself that Frank Sumption was/is a giant =\r\nwhen it comes to spirit boxes. If I were you, I&#39;d choose to believe me and =\r\ngo on to create bad ass equipment and not reveal your secrets. :)\nLaura\n\n__=\r\n______________________________\nFrom: purplespacefriend &lt;purplealiengirl@gma=\r\nil.com&gt;\nTo: EVP-ITC@yahoogroups.com\nSent: Wednesday, November 9, 2011 1:37 =\r\nPM\nSubject: [EVP-ITC] Re: Mirror, mirror on the wall.......\n\n\n=C2=A0 \nAcade=\r\nmic! I am not going to spend the last few months of this Earth cycle arguin=\r\ng with jerk fucks that wanna rip off all things paranormal cuz they can not=\r\n make a name for themselves in any other field. &quot;The paranormal&quot; requires n=\r\no proof, no credentials, all one has to do is make some grandiose claims an=\r\nd followers fall out of the trees. \n\n&quot;My guys&quot; repeat over and over and ove=\r\nr, everytime I turn on a box the last couple months &quot;June 15th--wormwood--e=\r\nnd of Earth&quot;(paraphrasing), yeah, I know, everyone some how knows better, j=\r\nust like they know nothing to the Mayan, and all the other end of days pred=\r\nictions from around the world-- every freaking culture, and all time period=\r\ns up the present, for the same frikkin&#39; date/year.\n\nHmmm, Wormwood!? A bitt=\r\ner herb/drug--a cure for Eartha? Ahhhh, no comet/asteroid named Wormwood, i=\r\nt&#39;s an effect of an asteroid/comet/natural disaster. A drug, a cure, a clea=\r\nnsing. \n\nF-S\n\n--- In EVP-ITC@yahoogroups.com, Laura OBryant &lt;lauraobryant@.=\r\n..&gt; wrote:\n&gt;\n&gt; \n&gt; \n&gt; I have been reading the arguments for a few weeks now =\r\nand can I say what I think? Just as Newton and Einstein and others like the=\r\nm are giants, they have people such as Stephen Hawking that stand on their =\r\nshoulders. The Hawkings that stand on the shoulders of giants are no less g=\r\nenius in their own right and should also be given credit also. But we can&#39;t=\r\n forget that the giants themselves made mistakes and had failures along the=\r\n way. They are no less than genius for their trial and errors as well as th=\r\neir successes. For had we not had the giants, failures and all, we would no=\r\nt advance any further in technology and wisdom. :)\n&gt; \n&gt; Another thought is =\r\nmany times ideas come around the same time in different locations. This is =\r\na phenomenon that has fascinated me and I often wonder how 2 or more people=\r\n can get the same thought in roughly the same time period. Take for instanc=\r\ne the discovery of small particles in atoms (or molecules, I am rusty at my=\r\n science sorry). There were scientists discovering these in different locat=\r\nions around the world at the same time! I&#39;m sure it can be argued that one =\r\nscientist discovered the break through before another but it doesn&#39;t disput=\r\ne the fact that both were working on the same thing in the same time period=\r\n.=C3=82=C2=A0\n&gt; \n&gt; So for argument sake let&#39;s give credit to those who have=\r\n successfully engineered the spirit boxes and those who have stood on the s=\r\nhoulders of the original inventors and keep in mind there may be a few of t=\r\nhe original inventors at the same time! You discovered it. GREAT! How wonde=\r\nrful that you contributed to something so genius! I hope that you continue =\r\nto experiment and enrich us with your findings and failings as those are im=\r\nportant too. (Remember that Edison failed many times with the light bulb be=\r\nfore he got it right.) I would encourage all of you to go forward and advan=\r\nce your technologies and remember there is always someone trying to steal f=\r\name and fortune. You can protect your ideas with patents before releasing t=\r\nhem to the public if you are really concerned with ownership of originality=\r\n.=C3=82=C2=A0\n&gt; \n&gt; I hope I haven&#39;t overstepped my bounds but I want to rea=\r\nssure those who are frustrated that there are those who recognize genius an=\r\nd those who stand on shoulders from those who steal. Just because we are si=\r\nlent doesn&#39;t mean we are blind, deaf, and mute. I hope this helps.=C3=82=C2=\r\n=A0\n&gt; \n&gt; Laura\n&gt; \n&gt; ________________________________\n&gt; From: David Koenig &lt;=\r\nfloridajakeblues@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Wednesday, Nove=\r\nmber 9, 2011 12:14 PM\n&gt; Subject: Re: [EVP-ITC] Mirror, mirror on the wall..=\r\n.....\n&gt; \n&gt; \n&gt; =C3=82=C2=A0 \n&gt; Don&#39;t do it!\n&gt; \n&gt; \n&gt; On Wed, Nov 9, 2011 at 1=\r\n2:00 PM, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt; \n&gt; \n&gt; &gt;=C3=82=C2=A0 =\r\n\n&gt; &gt;=C3=82=C2=A0Time for me to back the fuck up and look in the mirror. Sin=\r\nce day one, one arguement after another over the boxes, what they are for, =\r\nwho can use it, how one jerkoff or another is the master box user and deter=\r\nmines who can use the box,=C3=82=C2=A0and always somebody claims my work no=\r\n good, while theirs superior.=C3=82=C2=A0 I&#39;m jumping off this track, ya wa=\r\nnt it? You got it, someone else can have the loonies, the con men, the tric=\r\nksters, the posers, and the &quot;ones that know better&quot;. Not getting sucked int=\r\no the dark with this box crap any longer,=C3=82=C2=A0it was supposed to be =\r\nfor my own use anyway, y&#39;all simply can&#39;t handle that level of spirit commu=\r\nnication. Learned the hard way that there is a reason why certain knowledge=\r\n is withheld from the uninitiated. =C3=82=C2=A0I can&#39;t fix what I have done=\r\n, all I can do is walk away. Like the guy said &quot;you can&#39;t handle=C3=82=C2=\r\n=A0the truth!&quot; \n&gt; &gt;=C3=82=C2=A0\n&gt; &gt;=C3=82=C2=A0Not gonna debate it, been th=\r\nere done that, no one hears or listens, always &quot; Oh, I know so much better&quot;=\r\n is the response. &quot;For my research&quot;, yeah, heard that about five hundred ti=\r\nmes! \n&gt; &gt;=C3=82=C2=A0\n&gt; &gt;=C3=82=C2=A0Time for me to seek the light side of =\r\nthe force--while there is still time. \n&gt; &gt;=C3=82=C2=A0\n&gt; &gt;=C3=82=C2=A0Frank=\r\n Sumption\n&gt;\n\n\n \r\n--0-203912490-1320865362=:27055\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;&lt;body&gt;&lt;div style=3D&quot;color:#000; background-color:#fff; font-family:ti=\r\nmes new roman, new york, times, serif;font-size:14pt&quot;&gt;&lt;div&gt;&lt;span&gt;&lt;br&gt;&lt;/span=\r\n&gt;&lt;/div&gt;&lt;div&gt;I got initiated into the paranormal 4 yrs ago and accidentally =\r\ngot my first EVP 3 yrs ago. I went crazy searching for information about sp=\r\nirit boxes. And what I found is that most people sing the praises of Frank&#39;=\r\ns Ghost box and Frank Sumption. I didn&#39;t know who Frank Sumption was (still=\r\n don&#39;t know you personally) but from what I could tell there were (are) man=\r\ny many people who believe that Frank Sumption is a giant when it comes to s=\r\npirit boxes.&nbsp;&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;You can&#39;t control what people s=\r\nay or do. But your work seems to stand on it&#39;s own merit. So it doesn&#39;t mat=\r\nter what your competitors say, it still stands that Frank Sumption is the g=\r\niant among spirit boxes and is up there with Thomas Edison. You are letting=\r\n them upset you when the reality is, you are still on top. So let them\n say=\r\n what they want. And let them make improvements and have their own merit. F=\r\nrom my point of view, as an outsider looking in, they are standing on your =\r\nshoulders. I have no vestment in this argument or in you and your rivals. D=\r\non&#39;t let them drive you insane with their claims or weigh you down with unn=\r\necessary anger and bitterness. You are doing just fine.&nbsp;&lt;/div&gt;&lt;div&gt;&lt;br=\r\n&gt;&lt;/div&gt;&lt;div&gt;Question now is, are you going to believe those who anger you a=\r\nnd tell you you are not the original creator OR are you going to believe so=\r\nmeone that is a total stranger that did her research a few years ago before=\r\n stumbling onto this argument? And may I remind you I have no vestment in t=\r\nhis argument whatsoever? You could say I&#39;m biased since when I researched I=\r\n came to believe myself that Frank Sumption was/is a giant when it comes to=\r\n spirit boxes. If I were you, I&#39;d choose to believe me and go on to create =\r\nbad ass equipment and not reveal your secrets.\n :)&lt;/div&gt;&lt;div&gt;Laura&lt;/div&gt;&lt;di=\r\nv style=3D&quot;font-size: 14pt; font-family: &#39;times new roman&#39;, &#39;new york&#39;, tim=\r\nes, serif; &quot;&gt;&lt;div style=3D&quot;font-size: 12pt; font-family: &#39;times new roman&#39;,=\r\n &#39;new york&#39;, times, serif; &quot;&gt;&lt;font size=3D&quot;2&quot; face=3D&quot;Arial&quot;&gt;&lt;hr size=3D&quot;1&quot;=\r\n&gt;&lt;b&gt;&lt;span style=3D&quot;font-weight:bold;&quot;&gt;From:&lt;/span&gt;&lt;/b&gt; purplespacefriend &l=\r\nt;purplealiengirl@...&gt;&lt;br&gt;&lt;b&gt;&lt;span style=3D&quot;font-weight: bold;&quot;&gt;To=\r\n:&lt;/span&gt;&lt;/b&gt; EVP-ITC@yahoogroups.com&lt;br&gt;&lt;b&gt;&lt;span style=3D&quot;font-weight: bold=\r\n;&quot;&gt;Sent:&lt;/span&gt;&lt;/b&gt; Wednesday, November 9, 2011 1:37 PM&lt;br&gt;&lt;b&gt;&lt;span style=\r\n=3D&quot;font-weight: bold;&quot;&gt;Subject:&lt;/span&gt;&lt;/b&gt; [EVP-ITC] Re: Mirror, mirror on=\r\n the wall.......&lt;br&gt;&lt;/font&gt;&lt;br&gt;\n&lt;div id=3D&quot;yiv632609295&quot;&gt;\n\n\n\n\n\n\n\n\n\n\n\n\n\n&lt;div=\r\n&gt;\n&lt;span style=3D&quot;display:none;&quot;&gt;&nbsp;&lt;/span&gt;\n\n\n\n    &lt;div id=3D&quot;yiv63260929=\r\n5ygrp-text&quot;&gt;\n      \n      \n      &lt;div&gt; Academic! I am not going to spend th=\r\ne last few months of this Earth cycle arguing with jerk fucks that wanna ri=\r\np off all things paranormal cuz they can not make a name for themselves in =\r\nany other field. &quot;The paranormal&quot; requires no proof, no credentials, all on=\r\ne has to do is make some grandiose claims and followers fall out of the tre=\r\nes. &lt;br&gt;\n&lt;br&gt;\n&quot;My guys&quot; repeat over and over and over, everytime I turn on =\r\na box the last couple months &quot;June 15th--wormwood--end of Earth&quot;(paraphrasi=\r\nng), yeah, I know, everyone some how knows better, just like they know noth=\r\ning to the Mayan, and all the other end of days predictions from around the=\r\n world-- every freaking culture, and all time periods up the present, for t=\r\nhe same frikkin&#39; date/year.&lt;br&gt;\n&lt;br&gt;\nHmmm, Wormwood!? A bitter herb/drug--a=\r\n cure for Eartha? Ahhhh, no comet/asteroid named Wormwood, it&#39;s an effect o=\r\nf an asteroid/comet/natural disaster. A drug, a cure, a cleansing. &lt;br&gt;\n&lt;br=\r\n&gt;\nF-S&lt;br&gt;\n&lt;br&gt;\n--- In &lt;a rel=3D&quot;nofollow&quot; ymailto=3D&quot;mailto:EVP-ITC%40yahoo=\r\ngroups.com&quot; target=3D&quot;_blank&quot; href=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP=\r\n-ITC@yahoogroups.com&lt;/a&gt;, Laura OBryant &lt;lauraobryant@...&gt; wrote:&lt;br&gt;=\r\n\n&gt;&lt;br&gt;\n&gt; &lt;br&gt;\n&gt; &lt;br&gt;\n&gt; I have been reading the arguments for a =\r\nfew weeks now and can I say what I think? Just as Newton and Einstein and o=\r\nthers like them are giants, they have people such as Stephen Hawking that s=\r\ntand on their shoulders. The Hawkings that stand on the shoulders of giants=\r\n are no less genius in their own right and should also be given credit also=\r\n. But we can&#39;t forget that the giants themselves made mistakes and had fail=\r\nures along the way. They are no less than genius for their trial and errors=\r\n as well as their successes. For had we not had the giants, failures and al=\r\nl, we would not advance any further in technology and wisdom. :)&lt;br&gt;\n&gt; &lt;=\r\nbr&gt;\n&gt; Another thought is many times ideas come around the same time in d=\r\nifferent locations. This is a phenomenon that has fascinated me and I often=\r\n wonder how 2 or more people can get the same thought in roughly the same t=\r\nime period. Take for instance the discovery of small particles in atoms (or=\r\n molecules, I am rusty at my science sorry). There were scientists discover=\r\ning these in different locations around the world at the same time! I&#39;m sur=\r\ne it can be argued that one scientist discovered the break through before a=\r\nnother but it doesn&#39;t dispute the fact that both were working on the same t=\r\nhing in the same time period.=C3=82&nbsp;&lt;br&gt;\n&gt; &lt;br&gt;\n&gt; So for argumen=\r\nt sake let&#39;s give credit to those who have successfully engineered the spir=\r\nit boxes and those who have stood on the shoulders of the original inventor=\r\ns and keep in mind there may be a few of the original inventors at the same=\r\n time! You discovered it. GREAT! How wonderful that you contributed to some=\r\nthing so genius! I hope that you continue to experiment and enrich us with =\r\nyour findings and failings as those are important too. (Remember that Ediso=\r\nn failed many times with the light bulb before he got it right.) I would en=\r\ncourage all of you to go forward and advance your technologies and remember=\r\n there is always someone trying to steal fame and fortune. You can protect =\r\nyour ideas with patents before releasing them to the public if you are real=\r\nly concerned with ownership of originality.=C3=82&nbsp;&lt;br&gt;\n&gt; &lt;br&gt;\n&gt; =\r\nI hope I haven&#39;t overstepped my bounds but I want to reassure those who are=\r\n frustrated that there are those who recognize genius and those who stand o=\r\nn shoulders from those who steal. Just because we are silent doesn&#39;t mean w=\r\ne are blind, deaf, and mute. I hope this helps.=C3=82&nbsp;&lt;br&gt;\n&gt; &lt;br&gt;\n&=\r\ngt; Laura&lt;br&gt;\n&gt; &lt;br&gt;\n&gt; ________________________________&lt;br&gt;\n&gt; From=\r\n: David Koenig &lt;floridajakeblues@...&gt;&lt;br&gt;\n&gt; To: &lt;a rel=3D&quot;nofollow=\r\n&quot; ymailto=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot; target=3D&quot;_blank&quot; href=3D&quot;ma=\r\nilto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups.com&lt;/a&gt;&lt;br&gt;\n&gt; Sent: =\r\nWednesday, November 9, 2011 12:14 PM&lt;br&gt;\n&gt; Subject: Re: [EVP-ITC] Mirror=\r\n, mirror on the wall.......&lt;br&gt;\n&gt; &lt;br&gt;\n&gt; &lt;br&gt;\n&gt; =C3=82&nbsp; &lt;br&gt;\n=\r\n&gt; Don&#39;t do it!&lt;br&gt;\n&gt; &lt;br&gt;\n&gt; &lt;br&gt;\n&gt; On Wed, Nov 9, 2011 at 12:00=\r\n PM, Frank Sumption &lt;purplealiengirl@...&gt; wrote:&lt;br&gt;\n&gt; &lt;br&gt;\n&gt;  =\r\n&lt;br&gt;\n&gt; &gt;=C3=82&nbsp; &lt;br&gt;\n&gt; &gt;=C3=82&nbsp;Time for me to back th=\r\ne fuck up and look in the mirror. Since day one, one arguement after anothe=\r\nr over the boxes, what they are for, who can use it, how one jerkoff or ano=\r\nther is the master box user and determines who can use the box,=C3=82&nbsp;=\r\nand always somebody claims my work no good, while theirs superior.=C3=82&nb=\r\nsp; I&#39;m jumping off this track, ya want it? You got it, someone else can ha=\r\nve the loonies, the con men, the tricksters, the posers, and the &quot;ones that=\r\n know better&quot;. Not getting sucked into the dark with this box crap any long=\r\ner,=C3=82&nbsp;it was supposed to be for my own use anyway, y&#39;all simply ca=\r\nn&#39;t handle that level of spirit communication. Learned the hard way that th=\r\nere is a reason why certain knowledge is withheld from the uninitiated. =C3=\r\n=82&nbsp;I can&#39;t fix what I have done, all I can do is walk away. Like the =\r\nguy said &quot;you can&#39;t handle=C3=82&nbsp;the truth!&quot; &lt;br&gt;\n&gt; &gt;=C3=82&nbsp=\r\n;&lt;br&gt;\n&gt; &gt;=C3=82&nbsp;Not gonna debate it, been there done that, no on=\r\ne hears or listens, always &quot; Oh, I know so much better&quot; is the response. &quot;F=\r\nor my research&quot;, yeah, heard that about five hundred times! &lt;br&gt;\n&gt; &gt;=\r\n=C3=82&nbsp;&lt;br&gt;\n&gt; &gt;=C3=82&nbsp;Time for me to seek the light side of=\r\n the force--while there is still time. &lt;br&gt;\n&gt; &gt;=C3=82&nbsp;&lt;br&gt;\n&gt; =\r\n&gt;=C3=82&nbsp;Frank Sumption&lt;br&gt;\n&gt;&lt;br&gt;\n&lt;br&gt;\n&lt;/div&gt;\n\n    &lt;/div&gt;\n     \n\n=\r\n\n\n&lt;/div&gt;\n\n\n\n\n\n&lt;/div&gt;&lt;br&gt;&lt;br&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/body&gt;&lt;/html&gt;\r\n--0-203912490-1320865362=:27055--"}