{"id": "22156", "subject": "Re: Something alot less angry!", "author": "jeremy mukes", "timestamp": "2011-11-09T22:44:36Z", "full_text": "--0-1110673567-1320878676=:45384\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nHello Frank. Ive been in your group I know for atleast 2 years. I said befo=\r\nre that although I dont often, if at all post anything, I do read every one=\r\n of them that go to my inbox. I just wanted to say that although I love ele=\r\nctronics and I have a degree in electronics, I never knew anything about Th=\r\ne Box until I saw it on TV. As far as I know, it was the first time the dev=\r\nice was ever mentioned in the mainstream and yes it was called &quot;Frank&#39;s Box=\r\n&quot; That in it&#39;s self should be respected for no matter who did what first, i=\r\nt was important enough to be given your name and on national television. I =\r\nhave been intrigued ever since and=A0 these posts that I&#39;ve read since my f=\r\nirst time requesting to be in your group ha fallen into line with the major=\r\nity of my feelings on the &quot;paranormal&quot; (such a cliche&#39; anymore is it not?) =\r\nI tip my hat to you sir for your contributations and I care nothing for the=\r\n naysayer.\nJeremy A mukes.\r\n--0-1110673567-1320878676=:45384\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;DIV&gt;Hello Frank. Ive been in your group I kn=\r\now for atleast 2 years. I said before that although I dont often, if at all=\r\n post anything, I do read every one of them that go to my inbox. I just wan=\r\nted to say that although I love electronics and I have a degree in electron=\r\nics, I never knew anything about The Box until I saw it on TV. As far as I =\r\nknow, it was the first time the device was ever mentioned in the mainstream=\r\n and yes it was called &quot;Frank&#39;s Box&quot; That in it&#39;s self should be respected =\r\nfor no matter who did what first, it was important enough to be given your =\r\nname and on national television. I have been intrigued ever since and&nbsp;=\r\n these posts that I&#39;ve read since my first time requesting to be in your gr=\r\noup ha fallen into line with the majority of my feelings on the &quot;paranormal=\r\n&quot; (such a cliche&#39; anymore is it not?) I tip my hat to you sir for your\n con=\r\ntributations and I care nothing for the naysayer.&lt;/DIV&gt;\n&lt;DIV&gt;Jeremy A mukes=\r\n.&lt;/DIV&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;\r\n--0-1110673567-1320878676=:45384--"}