{"id": "22189", "subject": "Re: Video of the &quot;Edison Box&quot; --Random Mode on a Scope", "author": "purplespacefriend", "timestamp": "2011-11-15T07:23:59Z", "full_text": "Ok, just found this vid/post today, hoping beyond hope that no one saw my most ignorant post about it earlier. \n\n Anyway, yeah, that&#39;s random, but I don&#39;t see how it can be used to sweep a radio in it&#39;s present form. Have a feeling some information with held. It almost implies Hultay made the random sweep work, which I know is highly unlikely. \n\n Anyway, trying a new idea picked off the vid. \n\n BTW, has the question ever occured to anyone--why random sweep? Answer; cuz the first box was made after I used EVPmaker, which chops up the audio and plays it back--randomly. That&#39;s why I thought the sweep had to be random. Yeah, the first 20 some boxes were random only, and did work, contrary to what you&#39;ve been told by one scumbag.\n\n My aplogoies, but guys like Hultay really piss me off, and it takes a few days to screw my head back on. Yeah, and people claiming to be psychic mediums don&#39;t see through the lies.\n\n Oh well, ain&#39;t gonna matter.\n\nF-S \n\n--- In EVP-ITC@yahoogroups.com, SnowfireL@... wrote:\n&gt;\n&gt; Wish I had one of your boxes, Frank, they are the best, what I&#39;d like is  \n&gt; one that could use electric as well as battery, that way I could save the  \n&gt; battery, they work best with electric anyway.  What ever happened to the  \n&gt; Frank&#39;s Box, that Sharon had?  It was a great box, with great sound, and I  have \n&gt; this bigger Aiwa, I&#39;d like you to fix Frank, let me know when you can take  \n&gt; it?  I have no idea how to turn it into a spirit box. sf\n&gt;  \n&gt;  \n&gt; In a message dated 11/14/2011 1:34:33 P.M. Eastern Standard Time,  \n&gt; purplealiengirl@... writes:\n&gt; \n&gt;  \n&gt;  \n&gt;  \n&gt; You gotta be freaking kidding!!! My random mode is smoothly changing  \n&gt; voltage that slowly and smoothly changes value- randomly. It looks almost like  \n&gt; DC on a scope. This crap in the vid, that would be useless for a sweep, you&#39;d \n&gt;  get nothing but buzzing from a radio.\n&gt; \n&gt; Go ask Chris Moon about his  little blue box, which he has had since, 2006 \n&gt; I think, and other larger units  before that.. ALL RANDOM SWEEP, all work \n&gt; every time it&#39;s turned on. Yet these  jerkfucks would have everyone believe \n&gt; everything I make is pure shit, plus how  they invented it first.\n&gt; \n&gt; I ran into problems trying to make the RVG run  single ended, as in a \n&gt; single power supply--instead of needing 16 batteries to  run--only 8 required for \n&gt; single ended. Y&#39;ll better step back and check your  facts! Then, put a vid \n&gt; of useless random noise--WTF is that crap!?\n&gt; \n&gt; What  makes it worse, this group been around since I don&#39;t rememeber, \n&gt; between 2004  and 2006, and yet no one stands up and says my boxes came long \n&gt; before Hultay,  long before Chapple, before Moon ripped it off and claimed it as \n&gt; Edison&#39;s  Telephone To The Dead. Even the owner of this group that watched \n&gt; how Chapple  would join the group under one name, quit the group, then come \n&gt; back under  another name, she don&#39;t stand up and say how my shit came first. \n&gt; \n&gt; And  why do I think everyone in the so called paranromal seeks only fame \n&gt; and  fotune, just making a name for themselves where no proof is required, no  \n&gt; credentials, all one has to do is proclaim how great they are, and how \n&gt; useless  everyone else is\n&gt; \n&gt; Yeah, done here. Useless to debate to with criminal  minds!\n&gt; \n&gt; F-S\n&gt; \n&gt; --- In _EVP-ITC@yahoogroups.com_ (mailto:EVP-ITC@yahoogroups.com) , \n&gt; &quot;Urkel23&quot;  &lt;urkel23@&gt; wrote:\n&gt; &gt;\n&gt; &gt; \n&gt; &gt; Here is the video of the  random raw mode as requested by frank.\n&gt; &gt; \n&gt; &gt; _http://www.youtube.com/watch?v=TmS3VseM4xA_ \n&gt; (http://www.youtube.com/watch?v=TmS3VseM4xA) \n&gt; &gt;  \n&gt; &gt; \n&gt; &gt; -Steve H.\n&gt; &gt;\n&gt;"}