{"id": "22198", "subject": "Rethinking your just thinking =)", "author": "Misty", "timestamp": "2011-11-19T10:00:40Z", "full_text": "The owner of this group has been overwhelmed with life LOL and its probably for the best. I remember quite well how it was even before you started this group Frank. I remember when the discussion of manual sweep came up between you and RetroDave and how Sum Duk AKA Bill Chappell expanded on the idea and modified a radio shack radio the 12-469 which had an awful clicking that could be resolved if one soldered in a chip...how he ran with the idea and began to market it. I also remember many of the people along the way including Steve Hultay and others who did a lot of work to research this method.\n\nYes you tend to get in a lot of arguements and that is why you made me owner of the group but you are passionate about this subject and have been from the first day I met you. Part of why our friendship never revolved around the boxes is that I agree with you that it is a method... a very good one but I developed my own methods as have many others on this group and the old one we came from. Part of why I turn you down when you offer me a box...it&#39;s not because I dont think they work...I know they work... it is simply because I value our friendship above the boxes, r the research, or &quot;proof&quot;. \n\nOne of the biggest lessons I have learned since starting this research is that life doesn&#39;t end when we take our last breath, the body dies but the energy it contains the &quot;soul&quot; carries on. Life is like a play and we are all just characters in it. We each have our parts. And so while I play my part I want to learn everything I can, help everyone I can, make the most of every moment I can squeeze out of life. Some are fantastic, some are horrific but good or bad it is life and its meant to be experienced and embraced for each lesson we can take from it.\n\nOne of my favorite sayings:\n\nLife is not measured by the amount of breaths we take but by the moments that take our breath away.\n\nI have had many such moments since starting this research and since meeting you. My first recording was of my mother and I wanted to know how to fix that crappy audio file I had saved. What I learned was that there were many more lessons and breathtaking eye opening moments in store for me. I started off wanting to speak to the dead, I learned to enjoy speaking to the living. Because really body or no body, alive or dead, good or bad, is just a matter of perspective.\n\nI know a lot of you may be offended by Frank and at times I have had to have talks with him about what I thought innappropriate actions in the group. But Frank is who he is. I received messages from people (I wont name you) saying he said this or that about me and was attacking me... ITS OK!!! I know who Frank is, I accepted Frank for who he is a long time ago just as I have accepted all of you for who you are. He just tends to get frustrated when he feels like people he gave a lot of his hard work and effort to have turned their back on him or stabbed him in his. He is right many have done that. I have watched it time and time again over the many years I have known him. He did not deserve most of the negativity that surrounds his work nor did he deserve the craziness from people he willingly donated his hard work to. I am not saying everyone deserves what Frank has said about them either.\n\nThe purpose of this group is not to be a battleground...instead the purpose of this group is to be a melting pot for new ideas, different approaches and conversation about ongoing thoughts or research. A place to meet each other, find those who are like minded, make a few new friends, learn a few different methods and ultimately RETURN TO YOUR LIFE WITH WHAT YOU HAVE LEARNED.\n\nThe archives contain the history of progress made and progress lost. I do not have to say what the truth is it speaks for itself. \n\nAndy you have been here a very long time and you are right I have defended Frank many times in the past, I still do. I also will be the first to tell him when I think he is wrong and he will tell you I am a blunt bitch when I want to be hahaha even if often I take it private face to face rather than share with the group.\n\nI am sorry that I haven&#39;t had a lot of time to join in here. Been working two jobs and that leaves very little time for much of anything including sleep. Throw in a lot of family and personal issues and I am pretty much tapped out. \n\nI am up extremely late to type this and have to work tomorrow so I will end here and just tell all of you that this group is about research... not name calling. It is about working together, sharing your ideas and results of your research...not saying my way is better than yours or you don&#39;t know what you are talking about because I am right and you are wrong. Ego needs to be kept in check for this research or you will find yourself neck deep in negative B.S.\n\nHugggzzzzzzzz\nMisty\n\n\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  How I started this group back---don&#39;t remember, sometime between 2004 and\n&gt; 2006, there has to be at least one or two that have stayed on, and were\n&gt; here long before Hultay, long before Haliday, long before Chapple, long\n&gt; before hacks. Not one stands up and says so. One I know of that knows all\n&gt; this, the one I made owner of this group due to these incessant arguements\n&gt; and even she does not say the truth.\n&gt; \n&gt;  Yeah, meeza totally disgusted with humanity.\n&gt; \n&gt; \n&gt; .\n&gt;"}