{"id": "22197", "subject": "Re: [EVP-ITC] Enough is enough...", "author": "Zack Widup", "timestamp": "2011-11-16T18:49:02Z", "full_text": "I think just about every researcher can expect others to continue the\nresearch. I believe in giving credit where credit is due, but I&#39;d be a fool\nto believe that no one else had anything good to contribute. People are\ngoing to try their own experiments with the boxes. They may or may not find\nsome surprising things. That remains to be seen. But I would never squelch\nothers&#39; research.\n\nI don&#39;t think everyone wants to use them for paranormal investigation\n(ghost hunting) &quot;in the dark&quot; and not all paranormal investigators are\ndoing it to be scared. I don&#39;t scare easily and fear is the last thing on\nmy mind in an investigation. Also, I do not believe everyone is out to\nsteal your claim to fame as the early researcher of the box. But realize\nthere may be a few who have something useful to contribute and we may yet\nlearn something from their work.\n\nZack\n\n\nOn Wed, Nov 16, 2011 at 11:04 AM, Tracy &lt;klipprchic@...&gt; wrote:\n\n&gt; **\n&gt;\n&gt;\n&gt; As others have said, i never post over here but do read it. I am disgusted\n&gt; at the recent posts lately.. and not just because Steve is my brother..\n&gt;\n&gt; The rants, name calling, and vulgarity that comes from you Frank is\n&gt; appalling. It seems to me that anyone that tries to do anything as far as\n&gt; making a box is shot down and no one knows what they are doing other than\n&gt; you.. I can&#39;t imagine why anyone would bother with you at all.. You seem to\n&gt; be the angriest person i have ever seen.. Not to mention, having one sided\n&gt; arguments.. I have been watching for days since you have thrown steve off\n&gt; the group and your rants toward him calling him every name in the book go\n&gt; unanswered..\n&gt;\n&gt; Feel free to throw me off as well.. I won&#39;t post here again.. Whatever is\n&gt; written on this board that you created shows no promise in anything\n&gt; paranormal.. Negativity will never get you anywhere.. Paranormal unity is\n&gt; about working together, not tearing everyone apart.. I have no respect for\n&gt; you, as inventor of the box or not.. Doesn&#39;t matter.. You have to give\n&gt; respect to get it..\n&gt;\n&gt; Tracy\n&gt;\n&gt;  \n&gt;\n\nI hink jus abou e e y esea che can expec o he s o con inue he esea ch. I belie e in gi ing c edi whe e c edi is due, bu I'd be a ool o belie e ha no one else had any hing good o con ibu e. People a e going o y hei own expe imen s wi h he boxes. They may o may no ind some su p ising hings. Tha emains o be seen. Bu I would ne e squelch o he s' esea ch.\nI don' hink e e yone wan s o use hem o pa ano mal in es iga ion (ghos hun ing) \"in he da k\" and no all pa ano mal in es iga o s a e doing i o be sca ed. I don' sca e easily and ea is he las hing on my mind in an in es iga ion. Also, I do no belie e e e yone is ou o s eal you claim o ame as he ea ly esea che o he box. Bu ealize he e may be a ew who ha e some hing use ul o con ibu e and we may ye lea n some hing om hei wo k. \nZackOn Wed, No 16, 2011 a 11:04 AM, T acy klipp chic@aol.com> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n As o he s ha e said, i ne e pos o e he e bu do ead i . I am disgus ed a he ecen pos s la ely.. and no jus because S e e is my b o he .. \n\nThe an s, name calling, and ulga i y ha comes om you F ank is appalling. I seems o me ha anyone ha ies o do any hing as a as making a box is sho down and no one knows wha hey a e doing o he han you.. I can' imagine why anyone would bo he wi h you a all.. You seem o be he ang ies pe son i ha e e e seen.. No o men ion, ha ing one sided a gumen s.. I ha e been wa ching o days since you ha e h own s e e o he g oup and you an s owa d him calling him e e y name in he book go unanswe ed.. \n\n\nFeel ee o h ow me o as well.. I won' pos he e again.. Wha e e is w i en on his boa d ha you c ea ed shows no p omise in any hing pa ano mal.. Nega i i y will ne e ge you anywhe e.. Pa ano mal uni y is abou wo king oge he , no ea ing e e yone apa .. I ha e no espec o you, as in en o o he box o no .. Doesn' ma e .. You ha e o gi e espec o ge i .. \n\n\nT acy"}