{"id": "22192", "subject": "Re: Wow, the ghost box scene has really devolved into new frontiers of nastiness", "author": "purplespacefriend", "timestamp": "2011-11-15T17:18:23Z", "full_text": "Yeah, my deeepest apologies! Laying in bed this moring thinking about all this, I&#39;m just as nuts, and I keep getting sucked in. I let these con men/women like bully me out of boxes, and then they realy go insane, as Hultay did, now it&#39;s as if he really invented the crap. \n\n That&#39;s enough for me, I just missed a huge oppotunity, let these crackheads go ahead a claim all trhings paranormal and I can walk away!\n\n Me too, I&#39;m outta here, these loony toon fucks can have it!\n\nF-S\n \n\n--- In EVP-ITC@yahoogroups.com, &quot;ourobouros2k2&quot; &lt;ourobouros2k2@...&gt; wrote:\n&gt;\n&gt; You know, I haven&#39;t been active on these groups in several years. I still watch though, every day until now. This is my final word on this or Hultay&#39;s group. From this point on my research will be private (as it generally has been for the past several years now). I was there during the Halliday blowup, defending you Frank, despite your claims that no one ever did so. I was there fiercely defending you and the box phenomenon during the whole skepbitch blog fiasco. I really do take a measure of offense to the notion that no one defends you. I have observed Kristen, Misty, and even Hultay defend you many times.\n&gt; \n&gt; Recently, when no one could make any money off of your boxes on ebay, I humbly asked for a box for my own personal, private research. I have the ability to build a sweep box, I just wanted one with your personal energy imprint. The request wasn&#39;t borne of fame seeking or desire to resell and make a fortune, it was simply a request for one with your own personal touch. I have several commercial boxes, hacks, and I have the ability to adapt sweep boards for linear sweep. I just wanted one created by you with, as stated above, your own energy imprint. Guess what shouldn&#39;t be too surprising is that you never even bothered to reply to my message. Never could figure out your criteria for box gifting, as so many of them end up in the hand of those you profess to hate. Guess I was offended that someone who defended you and your research didn&#39;t even merit a reply saying &quot;no&quot;, &quot;piss off&quot;, or &quot;whatever&quot;.\n&gt; \n&gt; The paranormal community as a whole is ripe with fringe personalities, but this ghost box community really takes the cake. All the hate boiling and jealousy between folks, with new alliances and enemies made every minute. It is no wonder that people look at these things with distrust. The &quot;who made what first&quot; and &quot;my box is the only one that works&quot; arguments are destroying any perceived credibility of anyone doing this research.\n&gt; \n&gt; So that&#39;s it, I have said my piece. Unsubbing from group as soon as this posts. I am not under the impression that this post will have any effect on the mindsets of those here, just believe me when I say it has been the most cathartic writing I have done in awhile. \n&gt; \n&gt; Hope y&#39;all get the &quot;Who has the biggest ghost box p***s&quot; argument figured out to y&#39;all satisfaction.\n&gt; \n&gt; peace\n&gt; Andy\n&gt;"}