{"id": "22207", "subject": "an updated---analog RVG", "author": "Frank Sumption", "timestamp": "2011-11-22T23:43:57Z", "full_text": "The problem I was having was in the random pulse stage, the DC levels\nwould shift over time, and the dual supply, teh DC level of the randomly\nvarying low freq AC signal would shift to a point where it could not be\nrectified. In the single supply version, same problem, the DC offset would\ndrift, producing the same problem. While this takes a few minutes for the\nDC levels to drift down, the random tuning voltage comes on everytime. The\ntrick was to use a single supply AC amp un biased, and let the random AC\nvoltage input settle around ground, so it&#39;s self rectifying.\n\n The radio is a Jensen clock radio ---pseudo hack(?) I can jack in external\nsweep, plugging in sweep switches between normal radio mode and box mode.\n I use it for testing sweep circuits.\n\n This presented not a some techno breakthrough, but to show I did not copy\nanyone.\n\n Chris Moon&#39;s little blue box, which I made, is random sweep only, it still\nworks after years of service, I just can&#39;t figure out what I am doing wrong\nin the present. I think God doesn&#39;t want people like Hultay to have random,\nas if they can hear anything anyway. More likely I&#39;m being shown some\nlesson on ego, just can&#39;t grasp it.\n\n There are many in the so called paranormal that claim life times of\nexperience, for me that&#39;s a red flag, it screams fake!\n\nF-S\n\nThe p oblem I was ha ing was in he andom pulse s age, he DC le els would shi o e ime, and he dual supply, eh DC le el o he andomly a ying low eq AC signal would shi o a poin whe e i could no be ec i ied. In he single supply e sion, same p oblem, he DC o se would d i , p oducing he same p oblem. While his akes a ew minu es o he DC le els o d i down, he andom uning ol age comes on e e y ime. The ick was o use a single supply AC amp un biased, and le he andom AC ol age inpu se le a ound g ound, so i 's sel ec i ying.\n\n \n The adio is a Jensen clock adio ---pseudo hack(?) I can jack in ex e nal sweep, plugging in sweep swi ches be ween no mal adio mode and box mode.  I use i o es ing sweep ci cui s.\n \n This p esen ed no a some echno b eak h ough, bu o show I did no copy anyone. \n \n Ch is Moon's li le blue box, which I made, is andom sweep only, i s ill wo ks a e yea s o se ice, I jus can' igu e ou wha I am doing w ong in he p esen . I hink God doesn' wan people like Hul ay o ha e andom, as i hey can hea any hing anyway. Mo e likely I'm being shown some lesson on ego, jus can' g asp i . \n\n \n The e a e many in he so called pa ano mal ha claim li e imes o expe ience, o me ha 's a ed lag, i sc eams ake!\n \nF-S"}