{"id": "22215", "subject": "Re: Spiricom", "author": "mikemay@ameritech.net", "timestamp": "2011-11-24T06:28:34Z", "full_text": "I used the diagram of the web about the guy with the spiricom\n\nI made a board that generated the 13 tones with sine or square wave output. Consisted of some MCUs and a mixer stage.\nI modified some surplus ham equipment to send and receive across the 26-30 mhz range.\n\nThat was 2005-6 or so. I gave up shortly after starting. I did not give much thought about it at the time.  We had trouble with transmiters close to me, bleeding through most anything with an audio stage.The summer of 2007 it was shutdown. It was to late for me to try again. I had sold the 2 transceivers before they went away.\n\nThe good news, I can try evp recordings without all the interfernce.\n\n \n\n--- In EVP-ITC@yahoogroups.com, &quot;Urkel23&quot; &lt;urkel23@...&gt; wrote:\n&gt;\n&gt; \n&gt; Hey Mike, how did you a build that device. I&#39;ve only seen block diagrams for it.  Can you describe your set up?\n&gt; \n&gt; I always wanted to try the spiricom.  A couple years ago i did a test with my wireless guitar transmitter, tape noise, spiricom tones and to make it different i used box sweep.  Got interesting results, but i&#39;d like to hear how you went about the experiment.\n&gt; \n&gt; Here is a few videos i made doing the experimenting:\n&gt; \n&gt; http://www.youtube.com/watch?v=lSCg23jkOC0\n&gt; \n&gt; http://www.youtube.com/user/urkel23#p/u/61/IKVz2iQxLqU\n&gt; \n&gt; http://www.youtube.com/user/urkel23#p/u/60/fU5ekSpSusc\n&gt; \n&gt; \n&gt; -Steve H.\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;mikemay@&quot; &lt;mikemay@&gt; wrote:\n&gt; &gt;\n&gt; &gt; yes , nothing but annoying buzzing tone so far :(\n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, Peter James Haviland ACCH &lt;docstrangeone@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; Has anyone tried to build and use the spiricom device?\n&gt; &gt; &gt; \n&gt; &gt; &gt; Pete\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}