{"id": "22276", "subject": "Re: [EVP-ITC] Re: FYI and more FYI", "author": "Joeine C.", "timestamp": "2012-01-28T21:23:38Z", "full_text": "---1488538659-84309383-1327785818=:53743\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nAll of this is just another example of=C2=A0 how the &quot;spiritually enlighten=\r\ned&quot;=C2=A0 love to devour and feed off of each other.\n=C2=A0 \n\nIS THIS WHERE=\r\n YOU LIVE? \n&quot;No, I live in heaven, and my affections\nare there. I just borr=\r\now this shack while\nwaiting for my ride home.&quot;\n\n--- On Sat, 1/28/12, don po=\r\nwell &lt;dpowell7299@...&gt; wrote:\n\n\nFrom: don powell &lt;dpowell7299@yahoo.c=\r\nom&gt;\nSubject: Re: [EVP-ITC] Re: FYI and more FYI\nTo: &quot;EVP-ITC@...=\r\nm&quot; &lt;EVP-ITC@yahoogroups.com&gt;\nDate: Saturday, January 28, 2012, 2:12 PM\n\n\n\n=\r\n=C2=A0 \n\n\n\n\n\n=C2=A0\nHow come I&#39;m not seeing these negative emails?=C2=A0 Hm=\r\nm, maybe my yahoo mail client has a positive only filter :)\n=C2=A0\nPersonal=\r\nly, I&#39;m just on here to listen to other recordings.=C2=A0 Even though I bui=\r\nlt a Frank&#39;s Box, I have not had time to really work with it.\n=C2=A0\nAlthou=\r\ngh I&#39;m amazed that people keep up the negative stuff when it really does no=\r\nt matter.=C2=A0 What matters is the cool stuff these boxes are capable of o=\r\nr whether or not they actually work.=C2=A0 What does NOT matter is who star=\r\nted it.\n=C2=A0\nOf course I know *I* did not start it so I don&#39;t have a dog =\r\nin that fight (as it were).\n=C2=A0\nStill, if you want to argue about someth=\r\ning, argue about whether the phenonomen is real or not.=C2=A0 I&#39;d be intere=\r\nsted in reading those flame wars ))\n=C2=A0\nDon\n\n\n\n\n\nFrom: Urkel23 &lt;urkel23@=\r\naol.com&gt;\nTo: EVP-ITC@yahoogroups.com \nSent: Friday, January 27, 2012 6:56 P=\r\nM\nSubject: [EVP-ITC] Re: FYI and more FYI\n\n\n\n=C2=A0 \n\n\nI&#39;m sitting here min=\r\nding my own business and i&#39;m dragged into yet another negative post.\n\nThis =\r\nused to be a great group and an original for this field, about 6 years ago =\r\nbefore anybody knew about ghost boxes a few of us were here doing our resea=\r\nrch and posting our stuff. \n\nJust look in the archives to see the activity =\r\nwe use to have here. It&#39;s true, i do use this group mainly to allow fellow =\r\nenthusiasts to own a decent box at a cheap price. \n\nThere are 900 people he=\r\nre to target, although there never is a post anymore. \n\nMe and others do al=\r\nl of our posting at my RTSC yahoo group, where i help individuals daily wit=\r\nh advice and links to FREE downloads and ideas to test and try.\n\nDespite wh=\r\nat frank says, i never claimed to invent anything or say he didn&#39;t. That al=\r\nl came from his brain and it was all made up.\n\nAll i did was add a function=\r\n generator kit for $10 to a radio to make it sweep. I got the idea from Ric=\r\nh Georgina on my group, that wasn&#39;t my idea either.\n\nAll these things are a=\r\nll documented everywhere with me giving all the credit to Bill Chappel, fra=\r\nnk, rich, joe.\n\nSomehow franks lies went mainstream about me. If you don&#39;t =\r\nbelieve what i&#39;m saying, i have all this FREE information documented on my =\r\nsite for 6 years now. I have never made any money off of anybody and i offe=\r\nr everything for Free on my site including all the hacks i did and how to m=\r\nake your own ghost boxes with a sweep circuit. I even have the links on whe=\r\nre to get the parts to build them cheap.\n\nSo before you post something else=\r\n negative, do your homework on who people are and what they have contribute=\r\nd without any fame in mind or monetary motives.\n\n-Steve H.\n\n--- In EVP-ITC@=\r\nyahoogroups.com, &quot;Country&quot; &lt;countrybumpkin1956@...&gt; wrote:\n&gt;\n&gt; Just wanted =\r\nto let everyone know who thinks they created the ghost box that I just fini=\r\nshed reading another book, 101 Ways To Find A Ghost by Melissa Martin Ellis=\r\n, printed in 2011. In her book she mentions the creator of the ghost box an=\r\nd the name in print is Frank Sumption, not Urkel /ultay or anyone else.\n&gt; \n=\r\n&gt; This should please Frank but instead he will probably be mad and bitter a=\r\nbout something. He does not seem to look at the good in this group or the g=\r\nood in life. In some areas I think this group has gotten way off course as =\r\nto the original reason for starting the group.\n&gt; \n&gt; Also, as far as I can s=\r\nee Urkel/hultay uses this group to promote whatever boxes he has for sale, =\r\neBay or otherwise. Then we have the others who heve a signature trailer of =\r\nparagrapgh length on anything and everything they offer (for a fee of cours=\r\ne).....private frank box sessions? That almost sounds like another chris mo=\r\non, spirit medium? What does that have to do with this group that was creat=\r\ned becuz of ghost box research?\n&gt; \n&gt; This group seems to have fallen apart =\r\nand the expletive words in every 3-4 message doesnt help. I really have had=\r\n enuf at this point.\n&gt; \n&gt; Good luck, Misty, hang on as long as u can :) lif=\r\ne is too short to try and keep a bunch of &quot;I am better than anyone else&quot; ha=\r\nppy and in line, meaning doing ghost box research.....\n&gt; CB\n&gt; \n&gt; \n&gt; --- In =\r\nEVP-ITC@yahoogroups.com, &quot;Country&quot; &lt;countrybumpkin1956@&gt; wrote:\n&gt; &gt; Obvious=\r\nly I am way behind in my message reading on this group, I also rarely post =\r\nfor fear of being attacked by someone as well. Anyone who has been involved=\r\n with EVP - whether radio sweep, digital recorder, Digital Dowsing gadgets,=\r\n etc etc etc - knows that Frank Sumption was the leader in radio sweep. Why=\r\n do you have to be so angry and continually use the F word. Every ghost or =\r\nparanormal book I have read ( and I have well over 100 on my bookshelf) giv=\r\nes credit to you, Frank, and every paranormal or ghost magazine has given c=\r\nredit to you when there are articles about using radios for paranormal inve=\r\nstigation. As i said earlier, most educated people in radio evp know who cr=\r\neated the wheel in this area. So why do you let a tiny little yahoo group a=\r\nnd a few uneducated posters bother you, which in turn upsets the rest of us=\r\n.\n&gt; &gt; \n&gt; &gt; CB\n&gt;\n\n\n\n\n\n\n\n\n\r\n---1488538659-84309383-1327785818=:53743\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;table cellspacing=3D&quot;0&quot; cellpadding=3D&quot;0&quot; border=3D&quot;0&quot; &gt;&lt;tr&gt;&lt;td valign=3D&quot;=\r\ntop&quot; style=3D&quot;font: inherit;&quot;&gt;&lt;DIV&gt;All of this is just another example of&n=\r\nbsp; how the &quot;spiritually enlightened&quot;&nbsp; love to devour and feed off of=\r\n each other.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp; &lt;BR&gt;&lt;BR&gt;IS THIS WHERE YOU LIVE? &lt;BR&gt;&quot;No, I l=\r\nive in heaven, and my affections&lt;BR&gt;are there. I just borrow this shack whi=\r\nle&lt;BR&gt;waiting for my ride home.&quot;&lt;BR&gt;&lt;BR&gt;--- On &lt;B&gt;Sat, 1/28/12, don powell =\r\n&lt;I&gt;&lt;dpowell7299@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;BR&gt;&lt;/DIV&gt;\n&lt;BLOCKQUOTE style=\r\n=3D&quot;BORDER-LEFT: rgb(16,16,255) 2px solid; PADDING-LEFT: 5px; MARGIN-LEFT: =\r\n5px&quot;&gt;&lt;BR&gt;From: don powell &lt;dpowell7299@...&gt;&lt;BR&gt;Subject: Re: [EV=\r\nP-ITC] Re: FYI and more FYI&lt;BR&gt;To: &quot;EVP-ITC@yahoogroups.com&quot; &lt;EVP-ITC@ya=\r\nhoogroups.com&gt;&lt;BR&gt;Date: Saturday, January 28, 2012, 2:12 PM&lt;BR&gt;&lt;BR&gt;\n&lt;DIV=\r\n id=3Dyiv1958874061&gt;\n&lt;DIV&gt;&lt;SPAN style=3D&quot;DISPLAY: none&quot;&gt;&nbsp;&lt;/SPAN&gt; \n&lt;DIV=\r\n id=3Dyiv1958874061ygrp-text&gt;\n&lt;DIV&gt;\n&lt;DIV style=3D&quot;BACKGROUND-COLOR: #fff; F=\r\nONT-FAMILY: times new roman, new york, times, serif; COLOR: #000; FONT-SIZE=\r\n: 12pt&quot;&gt;\n&lt;DIV&gt;&lt;SPAN&gt;&lt;/SPAN&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;SPAN&gt;How come I&#39;m not seeing =\r\nthese negative emails?&nbsp; Hmm, maybe my yahoo mail client has a positive=\r\n only filter :)&lt;/SPAN&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;SPAN&gt;&lt;/SPAN&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;SPAN&gt;Pers=\r\nonally, I&#39;m just on here to listen to other recordings.&nbsp; Even though I=\r\n built a Frank&#39;s Box, I have not had time to really work with it.&lt;/SPAN&gt;&lt;/D=\r\nIV&gt;\n&lt;DIV&gt;&lt;SPAN&gt;&lt;/SPAN&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;SPAN&gt;Although I&#39;m amazed that peop=\r\nle keep up the negative stuff when it really does not matter.&nbsp; What ma=\r\ntters is the cool stuff these boxes are capable of or whether or not they a=\r\nctually work.&nbsp; What does NOT matter is who started it.&lt;/SPAN&gt;&lt;/DIV&gt;\n&lt;D=\r\nIV&gt;&lt;SPAN&gt;&lt;/SPAN&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;SPAN&gt;Of course I know *I* did not start =\r\nit so I don&#39;t have a dog in that fight (as it were).&lt;/SPAN&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;SPA=\r\nN&gt;&lt;/SPAN&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;SPAN&gt;Still, if you want to argue about somethin=\r\ng, argue about whether the phenonomen is real or not.&nbsp; I&#39;d be interest=\r\ned in reading those flame wars ))&lt;/SPAN&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;SPAN&gt;&lt;/SPAN&gt;&nbsp;&lt;/DI=\r\nV&gt;\n&lt;DIV&gt;&lt;SPAN&gt;Don&lt;/SPAN&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV style=3D&quot;FONT-FAMILY: t=\r\nimes new roman, new york, times, serif; FONT-SIZE: 12pt&quot;&gt;\n&lt;DIV style=3D&quot;FON=\r\nT-FAMILY: times new roman, new york, times, serif; FONT-SIZE: 12pt&quot;&gt;\n&lt;DIV d=\r\nir=3Dltr&gt;&lt;FONT size=3D2 face=3DArial&gt;\n&lt;DIV style=3D&quot;HEIGHT: 0px; FONT-SIZE:=\r\n 0px&quot; class=3Dyiv1958874061hr&gt;&lt;/DIV&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: bold&quot;&gt;Fr=\r\nom:&lt;/SPAN&gt;&lt;/B&gt; Urkel23 &lt;urkel23@...&gt;&lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FONT-WE=\r\nIGHT: bold&quot;&gt;To:&lt;/SPAN&gt;&lt;/B&gt; EVP-ITC@yahoogroups.com &lt;BR&gt;&lt;B&gt;&lt;SPAN style=3D&quot;FO=\r\nNT-WEIGHT: bold&quot;&gt;Sent:&lt;/SPAN&gt;&lt;/B&gt; Friday, January 27, 2012 6:56 PM&lt;BR&gt;&lt;B&gt;&lt;S=\r\nPAN style=3D&quot;FONT-WEIGHT: bold&quot;&gt;Subject:&lt;/SPAN&gt;&lt;/B&gt; [EVP-ITC] Re: FYI and m=\r\nore FYI&lt;BR&gt;&lt;/FONT&gt;&lt;/DIV&gt;&lt;BR&gt;\n&lt;DIV id=3Dyiv1958874061&gt;\n&lt;DIV&gt;&lt;SPAN&gt;&nbsp;&lt;/SP=\r\nAN&gt; \n&lt;DIV id=3Dyiv1958874061ygrp-text&gt;\n&lt;DIV&gt;&lt;BR&gt;I&#39;m sitting here minding my=\r\n own business and i&#39;m dragged into yet another negative post.&lt;BR&gt;&lt;BR&gt;This u=\r\nsed to be a great group and an original for this field, about 6 years ago b=\r\nefore anybody knew about ghost boxes a few of us were here doing our resear=\r\nch and posting our stuff. &lt;BR&gt;&lt;BR&gt;Just look in the archives to see the acti=\r\nvity we use to have here. It&#39;s true, i do use this group mainly to allow fe=\r\nllow enthusiasts to own a decent box at a cheap price. &lt;BR&gt;&lt;BR&gt;There are 90=\r\n0 people here to target, although there never is a post anymore. &lt;BR&gt;&lt;BR&gt;Me=\r\n and others do all of our posting at my RTSC yahoo group, where i help indi=\r\nviduals daily with advice and links to FREE downloads and ideas to test and=\r\n try.&lt;BR&gt;&lt;BR&gt;Despite what frank says, i never claimed to invent anything or=\r\n say he didn&#39;t. That all came from his brain and it was all made up.&lt;BR&gt;&lt;BR=\r\n&gt;All i did was add a function generator kit for $10 to a radio to make it s=\r\nweep. I got the idea from Rich\n Georgina on my group, that wasn&#39;t my idea e=\r\nither.&lt;BR&gt;&lt;BR&gt;All these things are all documented everywhere with me giving=\r\n all the credit to Bill Chappel, frank, rich, joe.&lt;BR&gt;&lt;BR&gt;Somehow franks li=\r\nes went mainstream about me. If you don&#39;t believe what i&#39;m saying, i have a=\r\nll this FREE information documented on my site for 6 years now. I have neve=\r\nr made any money off of anybody and i offer everything for Free on my site =\r\nincluding all the hacks i did and how to make your own ghost boxes with a s=\r\nweep circuit. I even have the links on where to get the parts to build them=\r\n cheap.&lt;BR&gt;&lt;BR&gt;So before you post something else negative, do your homework=\r\n on who people are and what they have contributed without any fame in mind =\r\nor monetary motives.&lt;BR&gt;&lt;BR&gt;-Steve H.&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=3D&quot;http://us.mc=\r\n1613.mail.yahoo.com/mc/compose?to=3DEVP-ITC%40yahoogroups.com&quot; rel=3Dnofoll=\r\now target=3D_blank ymailto=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yah=\r\noogroups.com&lt;/A&gt;, &quot;Country&quot;\n &lt;countrybumpkin1956@...&gt; wrote:&lt;BR&gt;&gt;&lt;=\r\nBR&gt;&gt; Just wanted to let everyone know who thinks they created the ghost =\r\nbox that I just finished reading another book, 101 Ways To Find A Ghost by =\r\nMelissa Martin Ellis, printed in 2011. In her book she mentions the creator=\r\n of the ghost box and the name in print is Frank Sumption, not Urkel /ultay=\r\n or anyone else.&lt;BR&gt;&gt; &lt;BR&gt;&gt; This should please Frank but instead he w=\r\nill probably be mad and bitter about something. He does not seem to look at=\r\n the good in this group or the good in life. In some areas I think this gro=\r\nup has gotten way off course as to the original reason for starting the gro=\r\nup.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Also, as far as I can see Urkel/hultay uses this group=\r\n to promote whatever boxes he has for sale, eBay or otherwise. Then we have=\r\n the others who heve a signature trailer of paragrapgh length on anything a=\r\nnd everything they offer (for a fee of course).....private frank box sessio=\r\nns? That almost\n sounds like another chris moon, spirit medium? What does t=\r\nhat have to do with this group that was created becuz of ghost box research=\r\n?&lt;BR&gt;&gt; &lt;BR&gt;&gt; This group seems to have fallen apart and the expletive =\r\nwords in every 3-4 message doesnt help. I really have had enuf at this poin=\r\nt.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Good luck, Misty, hang on as long as u can :) life is t=\r\noo short to try and keep a bunch of &quot;I am better than anyone else&quot; happy an=\r\nd in line, meaning doing ghost box research.....&lt;BR&gt;&gt; CB&lt;BR&gt;&gt; &lt;BR&gt;&gt=\r\n; &lt;BR&gt;&gt; --- In &lt;A href=3D&quot;http://us.mc1613.mail.yahoo.com/mc/compose?to=\r\n=3DEVP-ITC%40yahoogroups.com&quot; rel=3Dnofollow target=3D_blank ymailto=3D&quot;mai=\r\nlto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups.com&lt;/A&gt;, &quot;Country&quot; &lt;c=\r\nountrybumpkin1956@&gt; wrote:&lt;BR&gt;&gt; &gt; Obviously I am way behind in my =\r\nmessage reading on this group, I also rarely post for fear of being attacke=\r\nd by someone as well. Anyone who has been involved with EVP - whether radio=\r\n sweep, digital\n recorder, Digital Dowsing gadgets, etc etc etc - knows tha=\r\nt Frank Sumption was the leader in radio sweep. Why do you have to be so an=\r\ngry and continually use the F word. Every ghost or paranormal book I have r=\r\nead ( and I have well over 100 on my bookshelf) gives credit to you, Frank,=\r\n and every paranormal or ghost magazine has given credit to you when there =\r\nare articles about using radios for paranormal investigation. As i said ear=\r\nlier, most educated people in radio evp know who created the wheel in this =\r\narea. So why do you let a tiny little yahoo group and a few uneducated post=\r\ners bother you, which in turn upsets the rest of us.&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; =\r\n&gt; CB&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/=\r\nDIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;\r\n---1488538659-84309383-1327785818=:53743--"}