{"id": "22275", "subject": "Re: [EVP-ITC] Re: FYI and more FYI", "author": "don powell", "timestamp": "2012-01-28T20:12:58Z", "full_text": "--431417050-1725703374-1327781578=:13986\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n=C2=A0\nHow come I&#39;m not seeing these negative emails?=C2=A0 Hmm, maybe my y=\r\nahoo mail client has a positive only filter :)\n=C2=A0\nPersonally, I&#39;m just =\r\non here to listen to other recordings.=C2=A0 Even though I built a Frank&#39;s =\r\nBox, I have not had time to really work with it.\n=C2=A0\nAlthough I&#39;m amazed=\r\n that people keep up the negative stuff when it really does not matter.=C2=\r\n=A0 What matters is the cool stuff these boxes are capable of or whether or=\r\n not they actually work.=C2=A0 What does NOT matter is who started it.\n=C2=\r\n=A0\nOf course I know *I* did not start it so I don&#39;t have a dog in that fig=\r\nht (as it were).\n=C2=A0\nStill, if you want to argue about something, argue =\r\nabout whether the phenonomen is real or not.=C2=A0 I&#39;d be interested in rea=\r\nding those flame wars ))\n=C2=A0\nDon\n \n\n________________________________\n Fr=\r\nom: Urkel23 &lt;urkel23@...&gt;\nTo: EVP-ITC@yahoogroups.com \nSent: Friday, Ja=\r\nnuary 27, 2012 6:56 PM\nSubject: [EVP-ITC] Re: FYI and more FYI\n  \n\n \n=C2=A0=\r\n  \n \n\nI&#39;m sitting here minding my own business and i&#39;m dragged into yet ano=\r\nther negative post.\n\nThis used to be a great group and an original for this=\r\n field, about 6 years ago before anybody knew about ghost boxes a few of us=\r\n were here doing our research and posting our stuff. \n\nJust look in the arc=\r\nhives to see the activity we use to have here.  It&#39;s true, i do use this gr=\r\noup mainly to allow fellow enthusiasts to own a decent box at a cheap price=\r\n. \n\nThere are 900 people here to target, although there never is a post any=\r\nmore. \n\nMe and others do all of our posting at my RTSC yahoo group, where i=\r\n help individuals daily with advice and links to FREE downloads and ideas t=\r\no test and try.\n\nDespite what frank says, i never claimed to invent anythin=\r\ng or say he didn&#39;t.  That all came from his brain and it was all made up.\n\n=\r\nAll i did was add a function generator kit for $10 to a radio to make it sw=\r\neep.  I got the idea from Rich Georgina on my group, that wasn&#39;t my idea ei=\r\nther.\n\nAll these things are all documented everywhere with me giving all th=\r\ne credit to Bill Chappel, frank, rich, joe.\n\nSomehow franks lies went mains=\r\ntream about me.  If you don&#39;t believe what i&#39;m saying, i have all this FREE=\r\n information documented on my site for 6 years now.  I have never made any =\r\nmoney off of anybody and i offer everything for Free on my site including a=\r\nll the hacks i did and how to make your own ghost boxes with a sweep circui=\r\nt.  I even have the links on where to get the parts to build them cheap.\n\nS=\r\no before you post something else negative, do your homework on who people a=\r\nre and what they have contributed without any fame in mind or monetary moti=\r\nves.\n\n-Steve H.\n\n--- In EVP-ITC@yahoogroups.com, &quot;Country&quot; &lt;countrybumpkin1=\r\n956@...&gt; wrote:\n&gt;\n&gt; Just wanted to let everyone know who thinks they create=\r\nd the ghost box that I just finished reading another book, 101 Ways To Find=\r\n A Ghost by Melissa Martin Ellis, printed in 2011. In her book she mentions=\r\n the creator of the ghost box and the name in print is Frank Sumption, not =\r\nUrkel /ultay or anyone else.\n&gt; \n&gt; This should please Frank but instead he w=\r\nill probably be mad and bitter about something. He does not seem to look at=\r\n the good in this group or the good in life. In some areas I think this gro=\r\nup has gotten way off course as to the original reason for starting the gro=\r\nup.\n&gt; \n&gt; Also, as far as I can see Urkel/hultay uses this group to promote =\r\nwhatever boxes he has for sale, eBay or otherwise. Then we have the others =\r\nwho heve a signature trailer of  paragrapgh length on anything and everythi=\r\nng they offer (for a fee of course).....private frank box sessions? That al=\r\nmost sounds like another chris moon, spirit medium? What does that have to =\r\ndo with this group that was created becuz of ghost box research?\n&gt; \n&gt; This =\r\ngroup seems to have fallen apart and the expletive words in every 3-4 messa=\r\nge doesnt help. I really have had enuf at this point.\n&gt; \n&gt; Good luck, Misty=\r\n, hang on as long as u can :) life is too short to try and keep a bunch of =\r\n&quot;I am better than anyone else&quot; happy and in line, meaning doing ghost box r=\r\nesearch.....\n&gt; CB\n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Country&quot; &lt;countr=\r\nybumpkin1956@&gt; wrote:\n&gt; &gt; Obviously I am way behind in my message reading o=\r\nn this group, I also rarely post for fear of being attacked by someone as w=\r\nell. Anyone who has been involved with EVP - whether radio sweep, digital r=\r\necorder, Digital  Dowsing gadgets, etc etc etc - knows that Frank Sumption =\r\nwas the leader in radio sweep. Why do you have to be so angry and continual=\r\nly use the F word. Every ghost or paranormal book I have read ( and I have =\r\nwell over 100 on my bookshelf) gives credit to you, Frank, and every parano=\r\nrmal or ghost magazine has given credit to you when there are articles abou=\r\nt using radios for paranormal investigation. As i said earlier, most educat=\r\ned people in radio evp know who created the wheel in this area. So why do y=\r\nou let a tiny little yahoo group and a few uneducated posters bother you, w=\r\nhich in turn upsets the rest of us.\n&gt; &gt; \n&gt; &gt; CB\n&gt;\n\n   \n      \r\n--431417050-1725703374-1327781578=:13986\r\nContent-Type: text/html; charset=utf-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;&lt;body&gt;&lt;div style=3D&quot;color:#000; background-color:#fff; font-family:ti=\r\nmes new roman, new york, times, serif;font-size:12pt&quot;&gt;&lt;div&gt;&lt;span&gt;&lt;/span&gt;&nb=\r\nsp;&lt;/div&gt;&lt;div&gt;&lt;span&gt;How come I&#39;m not seeing these negative emails?&nbsp; Hm=\r\nm, maybe my yahoo mail client has a positive only filter :)&lt;/span&gt;&lt;/div&gt;&lt;di=\r\nv&gt;&lt;span&gt;&lt;/span&gt;&nbsp;&lt;/div&gt;&lt;div&gt;&lt;span&gt;Personally, I&#39;m just on here to liste=\r\nn to other recordings.&nbsp; Even though I built a Frank&#39;s Box, I have not =\r\nhad time to really work with it.&lt;/span&gt;&lt;/div&gt;&lt;div&gt;&lt;span&gt;&lt;/span&gt;&nbsp;&lt;/div&gt;=\r\n&lt;div&gt;&lt;span&gt;Although I&#39;m amazed that people keep up the negative stuff when =\r\nit really does not matter.&nbsp; What matters is the cool stuff these boxes=\r\n are capable of or whether or not they actually work.&nbsp; What does NOT m=\r\natter is who started it.&lt;/span&gt;&lt;/div&gt;&lt;div&gt;&lt;span&gt;&lt;/span&gt;&nbsp;&lt;/div&gt;&lt;div&gt;&lt;sp=\r\nan&gt;Of course I know *I* did not start it so I don&#39;t have a dog in that figh=\r\nt (as it\n were).&lt;/span&gt;&lt;/div&gt;&lt;div&gt;&lt;span&gt;&lt;/span&gt;&nbsp;&lt;/div&gt;&lt;div&gt;&lt;span&gt;Still=\r\n, if you want to argue about something, argue about whether the phenonomen =\r\nis real or not.&nbsp; I&#39;d be interested in reading those flame wars ))&lt;/spa=\r\nn&gt;&lt;/div&gt;&lt;div&gt;&lt;span&gt;&lt;/span&gt;&nbsp;&lt;/div&gt;&lt;div&gt;&lt;span&gt;Don&lt;/span&gt;&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;=\r\n/div&gt;  &lt;div style=3D&quot;font-family: times new roman, new york, times, serif; =\r\nfont-size: 12pt;&quot;&gt; &lt;div style=3D&quot;font-family: times new roman, new york, ti=\r\nmes, serif; font-size: 12pt;&quot;&gt; &lt;div dir=3D&quot;ltr&quot;&gt; &lt;font size=3D&quot;2&quot; face=3D&quot;A=\r\nrial&quot;&gt; &lt;div style=3D&quot;margin: 5px 0px; padding: 0px; border: 1px solid rgb(2=\r\n04, 204, 204); height: 0px; line-height: 0; font-size: 0px;&quot; class=3D&quot;hr&quot; c=\r\nontentEditable=3D&quot;false&quot; readonly=3D&quot;true&quot;&gt;&lt;/div&gt;  &lt;b&gt;&lt;span style=3D&quot;font-w=\r\neight: bold;&quot;&gt;From:&lt;/span&gt;&lt;/b&gt; Urkel23 &lt;urkel23@...&gt;&lt;br&gt; &lt;b&gt;&lt;span=\r\n style=3D&quot;font-weight: bold;&quot;&gt;To:&lt;/span&gt;&lt;/b&gt; EVP-ITC@yahoogroups.com &lt;br&gt; &lt;=\r\nb&gt;&lt;span style=3D&quot;font-weight: bold;&quot;&gt;Sent:&lt;/span&gt;&lt;/b&gt; Friday, January 27, 2=\r\n012 6:56 PM&lt;br&gt; &lt;b&gt;&lt;span\n style=3D&quot;font-weight: bold;&quot;&gt;Subject:&lt;/span&gt;&lt;/b&gt; =\r\n[EVP-ITC] Re: FYI and more FYI&lt;br&gt; &lt;/font&gt; &lt;/div&gt; &lt;br&gt;\n&lt;div id=3D&quot;yiv155000=\r\n7960&quot;&gt;\n\n\n\n\n\n\n\n\n\n\n\n\n\n&lt;div&gt;\n&lt;span style=3D&quot;display: none;&quot;&gt;&nbsp;&lt;/span&gt;\n\n\n\n =\r\n   &lt;div id=3D&quot;yiv1550007960ygrp-text&quot;&gt;\n      \n      \n      &lt;div&gt;&lt;br&gt;\nI&#39;m si=\r\ntting here minding my own business and i&#39;m dragged into yet another negativ=\r\ne post.&lt;br&gt;\n&lt;br&gt;\nThis used to be a great group and an original for this fie=\r\nld, about 6 years ago before anybody knew about ghost boxes a few of us wer=\r\ne here doing our research and posting our stuff.  &lt;br&gt;\n&lt;br&gt;\nJust look in th=\r\ne archives to see the activity we use to have here.  It&#39;s true, i do use th=\r\nis group mainly to allow fellow enthusiasts to own a decent box at a cheap =\r\nprice.  &lt;br&gt;\n&lt;br&gt;\nThere are 900 people here to target, although there never=\r\n is a post anymore.  &lt;br&gt;\n&lt;br&gt;\nMe and others do all of our posting at my RT=\r\nSC yahoo group, where i help individuals daily with advice and links to FRE=\r\nE downloads and ideas to test and try.&lt;br&gt;\n&lt;br&gt;\nDespite what frank says, i =\r\nnever claimed to invent anything or say he didn&#39;t.  That all came from his =\r\nbrain and it was all made up.&lt;br&gt;\n&lt;br&gt;\nAll i did was add a function generat=\r\nor kit for $10 to a radio to make it sweep.  I got the idea from Rich Georg=\r\nina on my group, that wasn&#39;t my idea either.&lt;br&gt;\n&lt;br&gt;\nAll these things are =\r\nall documented everywhere with me giving all the credit to Bill Chappel, fr=\r\nank, rich, joe.&lt;br&gt;\n&lt;br&gt;\nSomehow franks lies went mainstream about me.  If =\r\nyou don&#39;t believe what i&#39;m saying, i have all this FREE information documen=\r\nted on my site for 6 years now.  I have never made any money off of anybody=\r\n and i offer everything for Free on my site including all the hacks i did a=\r\nnd how to make your own ghost boxes with a sweep circuit.  I even have the =\r\nlinks on where to get the parts to build them cheap.&lt;br&gt;\n&lt;br&gt;\nSo before you=\r\n post something else negative, do your homework on who people are and what =\r\nthey have contributed without any fame in mind or monetary motives.&lt;br&gt;\n&lt;br=\r\n&gt;\n-Steve H.&lt;br&gt;\n&lt;br&gt;\n--- In &lt;a href=3D&quot;mailto:EVP-ITC%40yahoogroups.com&quot; re=\r\nl=3D&quot;nofollow&quot; target=3D&quot;_blank&quot; ymailto=3D&quot;mailto:EVP-ITC%40yahoogroups.co=\r\nm&quot;&gt;EVP-ITC@yahoogroups.com&lt;/a&gt;, &quot;Country&quot; &lt;countrybumpkin1956@...&gt; wr=\r\note:&lt;br&gt;\n&gt;&lt;br&gt;\n&gt; Just wanted to let everyone know who thinks they cre=\r\nated the ghost box that I just finished reading another book, 101 Ways To F=\r\nind A Ghost by Melissa Martin Ellis, printed in 2011. In her book she menti=\r\nons the creator of the ghost box and the name in print is Frank Sumption, n=\r\not Urkel /ultay or anyone else.&lt;br&gt;\n&gt; &lt;br&gt;\n&gt; This should please Frank=\r\n but instead he will probably be mad and bitter about something. He does no=\r\nt seem to look at the good in this group or the good in life. In some areas=\r\n I think this group has gotten way off course as to the original reason for=\r\n starting the group.&lt;br&gt;\n&gt; &lt;br&gt;\n&gt; Also, as far as I can see Urkel/hul=\r\ntay uses this group to promote whatever boxes he has for sale, eBay or othe=\r\nrwise. Then we have the others who heve a signature trailer of  paragrapgh =\r\nlength on anything and everything they offer (for a fee of course).....priv=\r\nate frank box sessions? That almost sounds like another chris moon, spirit =\r\nmedium? What does that have to do with this group that was created becuz of=\r\n ghost box research?&lt;br&gt;\n&gt; &lt;br&gt;\n&gt; This group seems to have fallen apa=\r\nrt and the expletive words in every 3-4 message doesnt help. I really have =\r\nhad enuf at this point.&lt;br&gt;\n&gt; &lt;br&gt;\n&gt; Good luck, Misty, hang on as lon=\r\ng as u can :) life is too short to try and keep a bunch of &quot;I am better tha=\r\nn anyone else&quot; happy and in line, meaning doing ghost box research.....&lt;br&gt;=\r\n\n&gt; CB&lt;br&gt;\n&gt; &lt;br&gt;\n&gt; &lt;br&gt;\n&gt; --- In &lt;a href=3D&quot;mailto:EVP-ITC%40ya=\r\nhoogroups.com&quot; rel=3D&quot;nofollow&quot; target=3D&quot;_blank&quot; ymailto=3D&quot;mailto:EVP-ITC=\r\n%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups.com&lt;/a&gt;, &quot;Country&quot; &lt;countrybumpk=\r\nin1956@&gt; wrote:&lt;br&gt;\n&gt; &gt; Obviously I am way behind in my message re=\r\nading on this group, I also rarely post for fear of being attacked by someo=\r\nne as well. Anyone who has been involved with EVP - whether radio sweep, di=\r\ngital recorder, Digital  Dowsing gadgets, etc etc etc - knows that Frank Su=\r\nmption was the leader in radio sweep. Why do you have to be so angry and co=\r\nntinually use the F word. Every ghost or paranormal book I have read ( and =\r\nI have well over 100 on my bookshelf) gives credit to you, Frank, and every=\r\n paranormal or ghost magazine has given credit to you when there are articl=\r\nes about using radios for paranormal investigation. As i said earlier, most=\r\n educated people in radio evp know who created the wheel in this area. So w=\r\nhy do you let a tiny little yahoo group and a few uneducated posters bother=\r\n you, which in turn upsets the rest of us.&lt;br&gt;\n&gt; &gt; &lt;br&gt;\n&gt; &gt; CB&lt;=\r\nbr&gt;\n&gt;&lt;br&gt;\n&lt;br&gt;\n&lt;/div&gt;\n\n    &lt;/div&gt;\n     \n\n\n\n&lt;/div&gt;\n\n\n\n\n\n&lt;/div&gt;&lt;br&gt;&lt;br&gt; &lt;/=\r\ndiv&gt; &lt;/div&gt;  &lt;/div&gt;&lt;/body&gt;&lt;/html&gt;\r\n--431417050-1725703374-1327781578=:13986--"}