{"id": "22274", "subject": "Re: FYI and more FYI", "author": "Urkel23", "timestamp": "2012-01-28T00:56:59Z", "full_text": "I&#39;m sitting here minding my own business and i&#39;m dragged into yet another negative post.\n\nThis used to be a great group and an original for this field, about 6 years ago before anybody knew about ghost boxes a few of us were here doing our research and posting our stuff.  \n\nJust look in the archives to see the activity we use to have here.  It&#39;s true, i do use this group mainly to allow fellow enthusiasts to own a decent box at a cheap price.  \n\nThere are 900 people here to target, although there never is a post anymore.  \n\nMe and others do all of our posting at my RTSC yahoo group, where i help individuals daily with advice and links to FREE downloads and ideas to test and try.\n\nDespite what frank says, i never claimed to invent anything or say he didn&#39;t.  That all came from his brain and it was all made up.\n\nAll i did was add a function generator kit for $10 to a radio to make it sweep.  I got the idea from Rich Georgina on my group, that wasn&#39;t my idea either.\n\nAll these things are all documented everywhere with me giving all the credit to Bill Chappel, frank, rich, joe.\n\nSomehow franks lies went mainstream about me.  If you don&#39;t believe what i&#39;m saying, i have all this FREE information documented on my site for 6 years now.  I have never made any money off of anybody and i offer everything for Free on my site including all the hacks i did and how to make your own ghost boxes with a sweep circuit.  I even have the links on where to get the parts to build them cheap.\n\nSo before you post something else negative, do your homework on who people are and what they have contributed without any fame in mind or monetary motives.\n\n-Steve H.\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;Country&quot; &lt;countrybumpkin1956@...&gt; wrote:\n&gt;\n&gt; Just wanted to let everyone know who thinks they created the ghost box that I just finished reading another book, 101 Ways To Find A Ghost by Melissa Martin Ellis, printed in 2011. In her book she mentions the creator of the ghost box and the name in print is Frank Sumption, not Urkel /ultay or anyone else.\n&gt; \n&gt; This should please Frank but instead he will probably be mad and bitter about something. He does not seem to look at the good in this group or the good in life. In some areas I think this group has gotten way off course as to the original reason for starting the group.\n&gt; \n&gt; Also, as far as I can see Urkel/hultay uses this group to promote whatever boxes he has for sale, eBay or otherwise. Then we have the others who heve a signature trailer of  paragrapgh length on anything and everything they offer (for a fee of course).....private frank box sessions? That almost sounds like another chris moon, spirit medium? What does that have to do with this group that was created becuz of ghost box research?\n&gt; \n&gt; This group seems to have fallen apart and the expletive words in every 3-4 message doesnt help. I really have had enuf at this point.\n&gt; \n&gt; Good luck, Misty, hang on as long as u can :) life is too short to try and keep a bunch of &quot;I am better than anyone else&quot; happy and in line, meaning doing ghost box research.....\n&gt; CB\n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Country&quot; &lt;countrybumpkin1956@&gt; wrote:\n&gt; &gt; Obviously I am way behind in my message reading on this group, I also rarely post for fear of being attacked by someone as well. Anyone who has been involved with EVP - whether radio sweep, digital recorder, Digital  Dowsing gadgets, etc etc etc - knows that Frank Sumption was the leader in radio sweep. Why do you have to be so angry and continually use the F word. Every ghost or paranormal book I have read ( and I have well over 100 on my bookshelf) gives credit to you, Frank, and every paranormal or ghost magazine has given credit to you when there are articles about using radios for paranormal investigation. As i said earlier, most educated people in radio evp know who created the wheel in this area. So why do you let a tiny little yahoo group and a few uneducated posters bother you, which in turn upsets the rest of us.\n&gt; &gt; \n&gt; &gt; CB\n&gt;"}