{"id": "22340", "subject": "Re: [EVP-ITC] Re: Where is everybody?", "author": "David Koenig", "timestamp": "2012-05-03T02:40:25Z", "full_text": "Sorry dude the documents are all over the place ... evem iIhave copies of\nthem and so do lots of others. Simple Fact ... the JREF was Co-Founded by\nrandi&#39;s illegal alien buddy who was director of the JREF as they stole\nmillions in donations as a fraudulent organization and perpetuated a total\nscam on the skeptic community ... Serves you pseudo-skeptics right!!!! I\nwas skeptical of the skeptic !!! Jose Alvarez, illegal alien Davy Pena even\nrote articles for the JREF and had a studio at their headquarters ... The\nPseudo-Skeptics got Flim Flammed by the guy who wrote the book ..LOL  Randi\nknowingly hired an illegal alien to help him fleece his flock\n...ROTFLMAO... Now he&#39;s going to federal prison ... LOL\nOn Wed, May 2, 2012 at 8:33 PM, rasterer &lt;rasterer@...&gt; wrote:\n\n&gt; **\n&gt;\n&gt;\n&gt;\n&gt; Digging more myself, I found this on a JREF Forum:\n&gt;\n&gt; &quot;Jose Alvarez is listed as a secretary working an average of 5 hours a\n&gt; week without compensation. &quot;\n&gt;\n&gt; A far cry from &quot;Co-founder&quot; or &quot;director&quot;.\n&gt;\n&gt; But then I saw them discussing you at the JREF forum (David Koenig), and\n&gt; that you were a banned member. So if you have some kind of grudge against\n&gt; the JREF, I suspect any facts I try to post are not going to sit well with\n&gt; you. So I&#39;ll end my help at this point.\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, Dave Koenig &lt;floridajakeblues@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Director from19 97 to 2008 .. Co- founder of the group .. Arrested by\n&gt; the FBI for fraud ... Awaits a plea bargain ... He&#39;s guilty !!!!\n&gt; &gt;\n&gt; &gt; Sent from my iPhone\n&gt; &gt;\n&gt; &gt; On May 2, 2012, at 6:36 PM, &quot;rasterer&quot; &lt;rasterer@...&gt; wrote:\n&gt;\n&gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com, Dave Koenig &lt;floridajakeblues@&gt; wrote:\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; The group was infiltrated by Jose Alvarez... An illegal alien who\n&gt; was director of the JREF... He has been arrested by the FBI for fraud and\n&gt; identity theft... You can google. For more on the scandal !!!\n&gt; &gt; &gt;\n&gt; &gt; &gt; If by JREF you mean the James Randi Educational Foundation, I googled,\n&gt; and Jose Alvarez was never a JREF director.\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;  \n&gt;\n\nSo y dude he documen s a e all o e he place ... e em iIha e copies o hem and so do lo s o o he s. Simple Fac ... he JREF was Co-Founded by andi's illegal alien buddy who was di ec o o he JREF as hey s ole millions in dona ions as a audulen o ganiza ion and pe pe ua ed a o al scam on he skep ic communi y ... Se es you pseudo-skep ics igh !!!! I was skep ical o he skep ic !!! Jose Al a ez, illegal alien Da y Pena e en o e a icles o he JREF and had a s udio a hei headqua e s ... The Pseudo-Skep ics go Flim Flammed by he guy who w o e he book ..LOL  Randi knowingly hi ed an illegal alien o help him leece his lock ...ROTFLMAO... Now he's going o ede al p ison ... LOL\nOn Wed, May 2, 2012 a 8:33 PM, as e e as e e @...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n \nDigging mo e mysel , I ound his on a JREF Fo um:\n\n\"Jose Al a ez is lis ed as a sec e a y wo king an a e age o 5 hou s a week wi hou compensa ion. \"\n\nA a c y om \"Co- ounde \" o \"di ec o \".\n\nBu hen I saw hem discussing you a he JREF o um (Da id Koenig), and ha you we e a banned membe . So i you ha e some kind o g udge agains he JREF, I suspec any ac s I y o pos a e no going o si well wi h you. So I'll end my help a his poin .\n\n\n--- In EVP-ITC@yahoog oups.com, Da e Koenig w o e:\n>\n> Di ec o om19 97 o 2008 .. Co- ounde o he g oup .. A es ed by he FBI o aud ... Awai s a plea ba gain ... He's guil y !!!!\n> \n> Sen om my iPhone\n> \n> On May 2, 2012, a 6:36 PM, \" as e e \" w o e:\n> \n> > \n> > \n> > --- In EVP-ITC@yahoog oups.com, Da e Koenig w o e:\n> > >\n> > > The g oup was in il a ed by Jose Al a ez... An illegal alien who was di ec o o he JREF... He has been a es ed by he FBI o aud and iden i y he ... You can google. Fo mo e on he scandal !!!\n\n> > \n> > I by JREF you mean he James Randi Educa ional Founda ion, I googled, and Jose Al a ez was ne e a JREF di ec o .\n> > \n> >\n>"}