{"id": "22365", "subject": "Re: [EVP-ITC] i just joined", "author": "urkel23@aol.com", "timestamp": "2012-09-24T18:12:56Z", "full_text": "I saw a very good test done once on tv and it was shocking to me.  The person had 2 cameras at a location, a 35mm and a digital.\n\nThey took several pictures at the same time side by side, the digital had several &quot;Orbs&quot; and the 35mm caught no anomaly&#39;s at all in any of the pictures.\n\nI believe what could be called an &quot;Orb&quot; for the most part can be debunked quickly as dust, rain, bugs....etc\n\nAt least 99 percent anyway.  I think we have more luck in the field using different types of audio for evidence.\n\nJust my thoughts\n\n-Steve\n\n\n\nSent from my iPhone\n\nOn Sep 24, 2012, at 10:55 AM, Zack Widup &lt;w9sz.zack@...&gt; wrote:\n\n&gt; One photo has multiple &quot;orbs&quot; - this indicates it is most likely dust particle reflections. The other one, probably dust, too. Did you take multiple photos from the exact same spot to compare?\n&gt; \n&gt; Zack\n&gt; \n&gt; On Sun, Sep 23, 2012 at 6:18 AM, cannon1.kathy@... &lt;cannon1.kathy@...&gt; wrote:\n&gt;&gt;  \n&gt;&gt; help ..i put up 2 pics..are these real orbs..please take a look ..let me know what you think.please..\n&gt; \n&gt; \n\nI saw a e y good es done once on and i was shocking o me.  The pe son had 2 came as a a loca ion, a 35mm and a digi al.They ook se e al pic u es a he same ime side by side, he digi al had se e al \"O bs\" and he 35mm caugh no anomaly's a all in any o he pic u es.I belie e wha could be called an \"O b\" o he mos pa can be debunked quickly as dus , ain, bugs....e cA leas 99 pe cen anyway.  I hink we ha e mo e luck in he ield using di e en ypes o audio o e idence.Jus my hough s-S e eSen om my iPhoneOn Sep 24, 2012, a 10:55 AM, Zack Widup w9sz.zack@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n \n \n One pho o has mul iple \"o bs\" - his indica es i is mos likely dus pa icle e lec ions. The o he one, p obably dus , oo. Did you ake mul iple pho os om he exac same spo o compa e?Zack\nOn Sun, Sep 23, 2012 a 6:18 AM, cannon1.ka hy@... cannon1.ka hy@a .ne > w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n help ..i pu up 2 pics..a e hese eal o bs..please ake a look ..le me know wha you hink.please.."}