{"id": "22366", "subject": "Re: [EVP-ITC] i just joined", "author": "Zack Widup", "timestamp": "2012-09-24T18:44:46Z", "full_text": "I did a lot of experimentation with a digital still camera (Nikon D70s)\ntrying to fathom what might cause the &quot;orbs&quot; so many people come up with. I\ngot &quot;orbs&quot; in over half of the still photos I took in random places. Most\nof them were places like farmer&#39;s fields, shopping malls, country roads,\netc. Some were in places that are supposedly haunted. These places were not\nfree of dust, insects, etc. Some were in dry weather and some were taken\nwhen it was drizzling or raining. I had to conclude that I could not verify\nthat any of them were paranormal in nature. Some of them may have been, but\nbased on what I found out, I could not say for sure. I did not see any\npercentage change in the number or type of &quot;orbs&quot; that showed up in random\nplaces and those that showed up in haunted places. Most of the &quot;orbs&quot;\nshowed up in flash photos. I also got lens flare in a lot of daytime photos.\n\nI think the best way to capture &quot;orbs&quot; is with video. I have also spent\nsome time looking for things that may have been orbs on video. Usually I\nhave to say they were also dust blowing around, bits of leaves, insects,\netc. Rain or drizzle is pretty obvious. A single bright spot moving across\nthe screen at night could be dust or an insect. Large amounts of spots\nmoving in unison in a certain direction are for sure dust particles. I&#39;ve\nseen these move so fast that they were there in one fraction of a second\nand gone the next.\n\nI have seen a few things on video that I couldn&#39;t be certain of as regular\nexplainable phenomena, though. In one case I saw a spot moving along, then\nsuddenly split into two spots which went off in two different directions.\nThat was definitely not dust or moisture. It could have been two insects\nflying together which then separated. That&#39;s the only possibility I could\nthink of other than something paranormal. That one was videotaped in a\nbasement that has a reputation of being haunted. I didn&#39;t see any insects\nat all in the basement while I was there.\n\nThere is one phenomenon I have not been able to explain. I have seen it\ntwice, both in places that were supposedly haunted (they were not in the\nsame place, though), both taken in total pitch black darkness at night.\nThey were both taken with digital cameras. And in both cases I was standing\nright next to the person who took the photo and saw it on his camera&#39;s\nscreen right after. They were both orange squiggly lines that zigzagged all\nover the photo frame. I have never been able to reproduce this phenomenon\nwith my camera.\n\nZack\n\n\nOn Mon, Sep 24, 2012 at 1:12 PM, &lt;urkel23@...&gt; wrote:\n\n&gt; **\n&gt;\n&gt;\n&gt;\n&gt; I saw a very good test done once on tv and it was shocking to me.  The\n&gt; person had 2 cameras at a location, a 35mm and a digital.\n&gt;\n&gt; They took several pictures at the same time side by side, the digital had\n&gt; several &quot;Orbs&quot; and the 35mm caught no anomaly&#39;s at all in any of the\n&gt; pictures.\n&gt;\n&gt; I believe what could be called an &quot;Orb&quot; for the most part can be debunked\n&gt; quickly as dust, rain, bugs....etc\n&gt;\n&gt; At least 99 percent anyway.  I think we have more luck in the field using\n&gt; different types of audio for evidence.\n&gt;\n&gt; Just my thoughts\n&gt;\n&gt; -Steve\n&gt;\n&gt;\n&gt;\n&gt; Sent from my iPhone\n&gt;\n&gt; On Sep 24, 2012, at 10:55 AM, Zack Widup &lt;w9sz.zack@...&gt; wrote:\n&gt;\n&gt;\n&gt;\n&gt; One photo has multiple &quot;orbs&quot; - this indicates it is most likely dust\n&gt; particle reflections. The other one, probably dust, too. Did you take\n&gt; multiple photos from the exact same spot to compare?\n&gt;\n&gt; Zack\n&gt;\n&gt; On Sun, Sep 23, 2012 at 6:18 AM, cannon1.kathy@... &lt;\n&gt; cannon1.kathy@...&gt; wrote:\n&gt;\n&gt;&gt; **\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; help ..i put up 2 pics..are these real orbs..please take a look ..let me\n&gt;&gt; know what you think.please..\n&gt;&gt;\n&gt;&gt;\n&gt;   \n&gt;\n\nI did a lo o expe imen a ion wi h a digi al s ill came a (Nikon D70s) ying o a hom wha migh cause he \"o bs\" so many people come up wi h. I go \"o bs\" in o e hal o he s ill pho os I ook in andom places. Mos o hem we e places like a me 's ields, shopping malls, coun y oads, e c. Some we e in places ha a e supposedly haun ed. These places we e no ee o dus , insec s, e c. Some we e in d y wea he and some we e aken when i was d izzling o aining. I had o conclude ha I could no e i y ha any o hem we e pa ano mal in na u e. Some o hem may ha e been, bu based on wha I ound ou , I could no say o su e. I did no see any pe cen age change in he numbe o ype o \"o bs\" ha showed up in andom places and hose ha showed up in haun ed places. Mos o he \"o bs\" showed up in lash pho os. I also go lens la e in a lo o day ime pho os.\nI hink he bes way o cap u e \"o bs\" is wi h ideo. I ha e also spen some ime looking o hings ha may ha e been o bs on ideo. Usually I ha e o say hey we e also dus blowing a ound, bi s o lea es, insec s, e c. Rain o d izzle is p e y ob ious. A single b igh spo mo ing ac oss he sc een a nigh could be dus o an insec . La ge amoun s o spo s mo ing in unison in a ce ain di ec ion a e o su e dus pa icles. I' e seen hese mo e so as ha hey we e he e in one ac ion o a second and gone he nex .\nI ha e seen a ew hings on ideo ha I couldn' be ce ain o as egula explainable phenomena, hough. In one case I saw a spo mo ing along, hen suddenly spli in o wo spo s which wen o in wo di e en di ec ions. Tha was de ini ely no dus o mois u e. I could ha e been wo insec s lying oge he which hen sepa a ed. Tha 's he only possibili y I could hink o o he han some hing pa ano mal. Tha one was ideo aped in a basemen ha has a epu a ion o being haun ed. I didn' see any insec s a all in he basemen while I was he e.\nThe e is one phenomenon I ha e no been able o explain. I ha e seen i wice, bo h in places ha we e supposedly haun ed ( hey we e no in he same place, hough), bo h aken in o al pi ch black da kness a nigh . They we e bo h aken wi h digi al came as. And in bo h cases I was s anding igh nex o he pe son who ook he pho o and saw i on his came a's sc een igh a e . They we e bo h o ange squiggly lines ha zigzagged all o e he pho o ame. I ha e ne e been able o ep oduce his phenomenon wi h my came a.\nZackOn Mon, Sep 24, 2012 a 1:12 PM, u kel23@aol.com> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n I saw a e y good es done once on and i was shocking o me.  The pe son had 2 came as a a loca ion, a 35mm and a digi al.They ook se e al pic u es a he same ime side by side, he digi al had se e al \"O bs\" and he 35mm caugh no anomaly's a all in any o he pic u es.\nI belie e wha could be called an \"O b\" o he mos pa can be debunked quickly as dus , ain, bugs....e cA leas 99 pe cen anyway.  I hink we ha e mo e luck in he ield using di e en ypes o audio o e idence.\nJus my hough s-S e eSen om my iPhoneOn Sep 24, 2012, a 10:55 AM, Zack Widup w9sz.zack@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n \n \n One pho o has mul iple \"o bs\" - his indica es i is mos likely dus pa icle e lec ions. The o he one, p obably dus , oo. Did you ake mul iple pho os om he exac same spo o compa e?Zack\n\nOn Sun, Sep 23, 2012 a 6:18 AM, cannon1.ka hy@... cannon1.ka hy@...> w o e:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n \n \n \n help ..i pu up 2 pics..a e hese eal o bs..please ake a look ..le me know wha you hink.please.."}