{"id": "2315", "subject": "Re: [EVP-ITC] Re: A new gadget?", "author": "regan pederson", "timestamp": "2007-09-27T16:44:27Z", "full_text": "--0-162565113-1190911467=:74139\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nI agree Travis!!\n\nTravis &lt;vampire2kd@...&gt; wrote:          Heh yea I remember chris fleming from the show Dead Famous. He \nalso sells the K2 Meter on his site. I dont know why some people \nthink its something that can especially enable one to contact the \nother side. Its an emf reader, Im not trying to be negative or \nanything. Im just pointing out its an EMF reader instead of having a \ndigital/number indicator it uses lights. You can take a numbered EMF \nreader and accomplish communication that way also. All I am saying is \nif you are the type who wants this but has to make a choice of having \nmoney to eat for the next week or buy the meter, use what you have \navailable to you. I have had successful two way communication using \ntoys believe it or not. Where you ask a question set toy off once for \nno twice for yes, and its worked. \nI think if there is someone willing enough on the other side to \nspeak to you, they are going to do it regardless of the device. If \nthey are intelligent enough theyll find a way to establish \ncommunication. Of course sometimes you can pick up stray voices where \nthey may not trying to communicate to you, you just capture it. So \nthere are all kinds of communication, well all know that. So no Im \nnot saying the k2 is a rip off by no means, Im sure you can use it to \nestablish communication, I have friends who have the meter and swear \nby it. Im just saying if you have a regular numbered EMF reader you \ncan use that as well if you are needed the cash you have. Regards,\nT.L.\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@...&gt; \nwrote:\n&gt;\n&gt; \n&gt; Interesting, so it could be picking up signals below hearing \nlevels, like 50hz, and signals that are not sound. It might be \ninteresting to see what would be picked up in conjunction with a \ndiode detector feeding a tape deck. Wonder if it&#39;s these magnetic \nimpulses that are what modulates the raw audio in the box to ceate a \nvoice? Just a thought. \n&gt; \n&gt; Frank-S \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: sunplex_chef@...: Thu, 27 Sep 2007 08:56:04 -\n0700Subject: Re: [EVP-ITC] A new gadget?\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Hey Guys\n&gt; Here is the info taken straight off of the company&#39;s website. \nI have to say that it is a very affordable meter and very rugged. I \nam by no means a professional in this field, but I have to say that \nit is by far one of the most useful pieces I carry. The company is K \nII (2) enterprises, I got mine off of ebay and had it in about 3 \nweeks do to back log in production. I hope this helps.\n&gt; \n&gt; Lynn\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Protect your family from harmful EMFs! \n&gt; Measure the EMF (Electro magnetic Field) strength of every \nelectrical device in your home, workplace or school; outdoor power \nlines, underground lines and even when you travel and shop for \nappliances. Health concerns about the negative effects of ELECTRO \nMAGNETIC FIELDS (EMF) from appliances, power lines, and home wiring \nhave caused the U.S. Government to issue a warning to use &quot;Prudent \nAvoidance&quot; to help reduce your exposure to this risk. \n&gt; Since EMF&#39;s are everywhere it may be impossible to totally avoid \nthem. The SAFE RANGE EMF METER from K-II can help you measure these \npotentially harmful fields and determine the safe range to help \nreduce exposure. It also helps you determine which appliances produce \nhigh level emissions.\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; FEATURES INCLUDE:\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Easy to read LED Display\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; 50 & 60 Hz operation\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Five level milliGauss ranges\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; For indoor and outdoor use \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Durable plastic case\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Operates for months on a single 9V battery\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Detects the ELF range (50 to 1,000Hz) & VLF range (1,000 to \n20,000Hz)Frank Ratka &lt;warrior18eii@...&gt; wrote: \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; I haven&#39;t &quot;played&quot; with one of these yet. What is the technology \nbased on? What is it measuring to get the spikes?Regards,Frank R.\n&gt; ----- Original Message ----From: Lynn burton &lt;sunplex_chef@...&gt;To: \nEVP-ITC@...: Thursday, September 27, 2007 10:35:32 AMSubject: Re: \n[EVP-ITC] A new gadget?\n&gt; \n&gt; \n&gt; Good morning all,\n&gt; \n&gt; Chris Fleming used one on the episode about the Manson \nmurders before. I have had one for a while now, and let me be the \nfirst to say that it works. I have had numerous two way \nconversations using it, as well as captured video evidence of these \nconversations showing that there is nothing around capable of giving \noff an EMF. The only issue that I have concern with is unlike EVP \nwork or video ITC work you have no recognizable voice or image to \npositively correlate who the communication is coming from. In my \ncase, I might ask the question &quot;Are you Sylvia, my mother, show me \ntwo spikes for yes and one spike for no&quot; and the meter will spike \ntwice for yes, but I have no voice or image I would recognize to \nverify that is who is causing the meter to spike. The meter is a \nvery useful tool and I do not conduct an investigation or session \nwithout it by my side, but like the rest of the tools in this field \nit has its valuable points as well as negative points. \n&gt; \n&gt; Lynn Frank Sumption &lt;franks-boxes@ hotmail.com&gt; wrote:\n&gt; \n&gt; \n&gt; I saw on Ghost Hunters last night that they were using a &quot;K2 Meter&quot; \nto get yes-no answers from the unseen. I never heard of that meter \nbefore. Frank-S\n&gt; Invite your mail contacts to join your friends list with Windows \nLive Spaces. It&#39;s easy! Try it! \n&gt; \n&gt; \n&gt; \n&gt; Building a website is a piece of cake. Yahoo! Small Business gives \nyou all the tools to get online. \n&gt; \n&gt; \n&gt; Be a better Heartthrob. Get better relationship answers from \nsomeone who knows.Yahoo! Answers - Check it out. \n&gt; \n&gt; \n&gt; \n&gt; Fussy? Opinionated? Impossible to please? Perfect. Join Yahoo!&#39;s \nuser panel and lay it on us. \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; __________________________________________________________\n&gt; Explore the seven wonders of the world\n&gt; http://search.msn.com/results.aspx?q=7+wonders+world&mkt=en-\nUS&form=QBRE\n&gt;\n\n\n\n         \n\n       \n---------------------------------\nPinpoint customers who are looking for what you sell. \r\n--0-162565113-1190911467=:74139\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nI agree Travis!!&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;Travis &lt;vampire2kd@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;&lt;!-- Network content --&gt;  &lt;DIV id=ygrp-text&gt;  &lt;div&gt;Heh yea I remember chris fleming from the show Dead Famous. He &lt;BR&gt;also sells the K2 Meter on his site. I dont know why some people &lt;BR&gt;think its something that can especially enable one to contact the &lt;BR&gt;other side. Its an emf reader, Im not trying to be negative or &lt;BR&gt;anything. Im just pointing out its an EMF reader instead of having a &lt;BR&gt;digital/number indicator it uses lights. You can take a numbered EMF &lt;BR&gt;reader and accomplish communication that way also. All I am\n saying is &lt;BR&gt;if you are the type who wants this but has to make a choice of having &lt;BR&gt;money to eat for the next week or buy the meter, use what you have &lt;BR&gt;available to you. I have had successful two way communication using &lt;BR&gt;toys believe it or not. Where you ask a question set toy off once for &lt;BR&gt;no twice for yes, and its worked. &lt;BR&gt;I think if there is someone willing enough on the other side to &lt;BR&gt;speak to you, they are going to do it regardless of the device. If &lt;BR&gt;they are intelligent enough theyll find a way to establish &lt;BR&gt;communication. Of course sometimes you can pick up stray voices where &lt;BR&gt;they may not trying to communicate to you, you just capture it. So &lt;BR&gt;there are all kinds of communication, well all know that. So no Im &lt;BR&gt;not saying the k2 is a rip off by no means, Im sure you can use it to &lt;BR&gt;establish communication, I have friends who have the meter and swear &lt;BR&gt;by it. Im just saying if you have a regular numbered EMF reader you &lt;BR&gt;can use\n that as well if you are needed the cash you have. Regards,&lt;BR&gt;T.L.&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;, Frank Sumption &lt;franks-boxes@&lt;WBR&gt;...&gt; &lt;BR&gt;wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; &lt;BR&gt;&gt; Interesting, so it could be picking up signals below hearing &lt;BR&gt;levels, like 50hz, and signals that are not sound. It might be &lt;BR&gt;interesting to see what would be picked up in conjunction with a &lt;BR&gt;diode detector feeding a tape deck. Wonder if it&#39;s these magnetic &lt;BR&gt;impulses that are what modulates the raw audio in the box to ceate a &lt;BR&gt;voice? Just a thought. &lt;BR&gt;&gt; &lt;BR&gt;&gt; Frank-S &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; To: EVP-ITC@...: sunplex_chef@&lt;WBR&gt;...: Thu, 27 Sep 2007 08:56:04 -&lt;BR&gt;0700Subject: Re: [EVP-ITC] A new gadget?&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; Hey Guys&lt;BR&gt;&gt; Here is the info taken straight off of the company&#39;s website. &lt;BR&gt;I have to say that it is a very affordable meter and very rugged. I\n &lt;BR&gt;am by no means a professional in this field, but I have to say that &lt;BR&gt;it is by far one of the most useful pieces I carry. The company is K &lt;BR&gt;II (2) enterprises, I got mine off of ebay and had it in about 3 &lt;BR&gt;weeks do to back log in production. I hope this helps.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Lynn&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; Protect your family from harmful EMFs! &lt;BR&gt;&gt; Measure the EMF (Electro magnetic Field) strength of every &lt;BR&gt;electrical device in your home, workplace or school; outdoor power &lt;BR&gt;lines, underground lines and even when you travel and shop for &lt;BR&gt;appliances. Health concerns about the negative effects of ELECTRO &lt;BR&gt;MAGNETIC FIELDS (EMF) from appliances, power lines, and home wiring &lt;BR&gt;have caused the U.S. Government to issue a warning to use &quot;Prudent\n &lt;BR&gt;Avoidance&quot; to help reduce your exposure to this risk. &lt;BR&gt;&gt; Since EMF&#39;s are everywhere it may be impossible to totally avoid &lt;BR&gt;them. The SAFE RANGE EMF METER from K-II can help you measure these &lt;BR&gt;potentially harmful fields and determine the safe range to help &lt;BR&gt;reduce exposure. It also helps you determine which appliances produce &lt;BR&gt;high level emissions.&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; FEATURES INCLUDE:&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; Easy to read LED Display&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; 50 &amp; 60 Hz operation&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; Five level milliGauss ranges&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; For indoor and outdoor use &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; Durable plastic case&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; Operates for months on a\n single 9V battery&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; Detects the ELF range (50 to 1,000Hz) &amp; VLF range (1,000 to &lt;BR&gt;20,000Hz)Frank Ratka &lt;warrior18eii@&lt;WBR&gt;...&gt; wrote: &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; I haven&#39;t &quot;played&quot; with one of these yet. What is the technology &lt;BR&gt;based on? What is it measuring to get the spikes?Regards,&lt;WBR&gt;Frank R.&lt;BR&gt;&gt; ----- Original Message ----From: Lynn burton &lt;sunplex_chef@&lt;WBR&gt;...&gt;To: &lt;BR&gt;EVP-ITC@...: Thursday, September 27, 2007 10:35:32 AMSubject: Re: &lt;BR&gt;[EVP-ITC] A new gadget?&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; Good morning all,&lt;BR&gt;&gt; &lt;BR&gt;&gt; Chris Fleming used one on the episode about the Manson &lt;BR&gt;murders before. I have had one for a while now, and let me be the &lt;BR&gt;first to say that it works. I have had numerous two way &lt;BR&gt;conversations using it, as well as captured video evidence of these &lt;BR&gt;conversations showing that there is nothing around capable of giving &lt;BR&gt;off an EMF. The only issue\n that I have concern with is unlike EVP &lt;BR&gt;work or video ITC work you have no recognizable voice or image to &lt;BR&gt;positively correlate who the communication is coming from. In my &lt;BR&gt;case, I might ask the question &quot;Are you Sylvia, my mother, show me &lt;BR&gt;two spikes for yes and one spike for no&quot; and the meter will spike &lt;BR&gt;twice for yes, but I have no voice or image I would recognize to &lt;BR&gt;verify that is who is causing the meter to spike. The meter is a &lt;BR&gt;very useful tool and I do not conduct an investigation or session &lt;BR&gt;without it by my side, but like the rest of the tools in this field &lt;BR&gt;it has its valuable points as well as negative points. &lt;BR&gt;&gt; &lt;BR&gt;&gt; Lynn Frank Sumption &lt;franks-boxes@ hotmail.com&gt; wrote:&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; I saw on Ghost Hunters last night that they were using a &quot;K2 Meter&quot; &lt;BR&gt;to get yes-no answers from the unseen. I never heard of that meter &lt;BR&gt;before. Frank-S&lt;BR&gt;&gt; Invite your mail contacts to join your friends list with\n Windows &lt;BR&gt;Live Spaces. It&#39;s easy! Try it! &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; Building a website is a piece of cake. Yahoo! Small Business gives &lt;BR&gt;you all the tools to get online. &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; Be a better Heartthrob. Get better relationship answers from &lt;BR&gt;someone who knows.Yahoo! Answers - Check it out. &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; Fussy? Opinionated? Impossible to please? Perfect. Join Yahoo!&#39;s &lt;BR&gt;user panel and lay it on us. &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; ____________&lt;WBR&gt;_________&lt;WBR&gt;_________&lt;WBR&gt;_________&lt;WBR&gt;_________&lt;WBR&gt;_________&lt;WBR&gt;_&lt;BR&gt;&gt; Explore the seven wonders of the world&lt;BR&gt;&gt; &lt;A href=&quot;http://search.msn.com/results.aspx?q=7+wonders+world&amp;mkt=en-&quot;&gt;http://search.&lt;WBR&gt;msn.com/results.&lt;WBR&gt;aspx?q=7+&lt;WBR&gt;wonders+world&amp;&lt;WBR&gt;mkt=en-&lt;/A&gt;&lt;BR&gt;US&amp;form=QBRE&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/div&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;p&gt;&#32;\n      &lt;hr size=1&gt;&lt;a href=&quot;http://us.rd.yahoo.com/evt=48250/*http://searchmarketing.yahoo.com/arp/sponsoredsearch_v9.php?o=US2226&cmp=Yahoo&ctv=AprNI&s=Y&s2=EM&b=50&quot;&gt;Pinpoint customers &lt;/a&gt;who are looking for what you sell. \n\n\r\n--0-162565113-1190911467=:74139--"}