{"id": "2335", "subject": "Re: Another voice--native american?", "author": "Travis", "timestamp": "2007-09-27T23:01:34Z", "full_text": "Ive thought about this a long time ago. I know that in the non-\nphysical or, whatever you would want to call existing only in \nconsciousness and not physically, that time and space do not exist. \nSo when you think about it like that no matter where you go in the \nphysical world the connections you have to some that communicate \nwith you will still be there as physicalities doesnt make a \ndifference. So I would say that perhaps the majority you get will \nstill be in english no matter where in the world you are. However I \nam sure that you will get some in the common language of the country \nyou go to. You just never know who will be interested in \ncommunicating with you. Regards,\n                              T.L.\n--- In EVP-ITC@yahoogroups.com, regan pederson &lt;turningpink@...&gt; \nwrote:\n&gt;\n&gt; It would be intriguing and awesome to witness someone in their \nnative tongue having a discussion with them. One of my major \ninterests are evps in other languages. Say in Thailand, do they come \nacross in Thai, or in English?\n&gt; \n&gt; Frank Sumption &lt;franks-boxes@...&gt; wrote:          Apparently not, \nsince presumably they know who they are talking to. \n&gt; \n&gt;     \n&gt; ---------------------------------\n&gt;   To: EVP-ITC@yahoogroups.com\n&gt; From: turningpink@...\n&gt; Date: Thu, 27 Sep 2007 12:01:54 -0700\n&gt; Subject: Re: [EVP-ITC] Another voice--native american?\n&gt; \n&gt;         Frank,\n&gt;   When native americans come across, or when people of other \nethnic regions come across, do they speak in their native tongue?\n&gt; \n&gt; Frank Sumption &lt;franks-boxes@...&gt; wrote:\n&gt;       This is from 24, but I used a different deck that resulted \nin weak, and noisy recoridng. That&#39;s the first time for \nthis &quot;Blackfoot&quot;. I think they are talking about Whitley Strieber. \nI&#39;d send it to him, but there&#39;s about zero chance of it being \nrecieved, or listend to, as most of these people tend &quot;know better&quot;. \n&gt;  \n&gt;  Frank-S \n&gt; \n&gt;   \n&gt; ---------------------------------\n&gt;   Get news, entertainment and everything you care about at \nLive.com. Check it out!   \n&gt; \n&gt; \n&gt; \n&gt;     \n&gt; ---------------------------------\n&gt;   Catch up on fall&#39;s hot new shows on Yahoo! TV. Watch previews, \nget listings, and more!   \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;   \n&gt; ---------------------------------\n&gt;   Explore the seven wonders of the world Learn more!   \n&gt; \n&gt;                          \n&gt; \n&gt;        \n&gt; ---------------------------------\n&gt; Yahoo! oneSearch: Finally,  mobile search that gives answers, not \nweb links.\n&gt;"}