{"id": "2337", "subject": "Re: [EVP-ITC] Re: A new gadget?", "author": "Lynn burton", "timestamp": "2007-09-28T15:09:43Z", "full_text": "--0-1834391675-1190992183=:63375\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nGood morning all,\n   \n      I have used this meter with great success as well as with great dismay.  I have had the meter &quot;pennied down&quot; sitting on a table top, and have a toy in another room respond to me without any activity on the meter.  I feel it is the spirit&#39;s choice and in which manner it feels more comfortable in communicating with you.  I have had lights turn off and back on again in succession in response to questions and no activity on the meter, and then I have had no other responses except the meter, so once again it is entirely up to the entity and how it wishes to respond.  In regards to the new apartment building, check the history of the land that it sits on.  In a few of my occasions it has been the energy tied to the land or former land owners that has caused the activity.  I have done an investigation in a &quot;new construction&quot; home site that the family had not moved into yet and the activity was on the increase, the new owners bought this piece of property as a wooded lot with\n no prior establishment being on site, to anyones knowledge that is.  To all of our surprise, land records had nothing available for that property other than the location and the pertinent info, however further research and many phone calls later it was discovered that the property sat on the edge of a local Indian tribal settlement from the 1700&#39;s (thanks to the Dept. of the Interior and the Bureau of Native American (Indian) Affairs.  It just goes to show you that persistence and continued research pays off in the long run ( this one took about 4 months to research).  So Travis just keep checking and get all you can on the property from as far back as you can, you never know what you might fond out.\n   \n  Lynn Burton\n\nTravis &lt;vampire2kd@...&gt; wrote:\n          Chris Fleming is selling them on his website for $49.95 + $10.00 s/h. \nWhich was my point though. Im sure it can be used effectively to \ncommunicate, but anything can be used to communicate effictively as \nlong as you stay objective and dont read too much into some things. \nSo I was just suggesting if you have an emf detector already or other \nthings available why buy something which is pretty much the same \nthing you have already. Ive noted that some electronic toys work very \nwell if there really is someone on the other side wanting to make \ncontact badly enough. For instance right now I live in a brand new \napartment building.\nWe just recently got rid of our house and moved into an apartment \nto save some money up. Usually I start wondering about the history of \na house or an apartment when I first move in. Considering though this \nbuilding and everything in it or on it are brand new as the building \nwas just put up and we were the very first couple to live in this \napartment. Which is a pretty cool fresh feeling, to be the first \npeople to live in a place. So it never even ocurred to me to think \nabout its history, since it has no history. Never-the-less after \nabout 2 months of living there I start feeling things. Like Im being \nwatched. It slowly progresses to actually seeing things out of the \ncorner of my eyes, I shrug this off too. Then I actually seen a cat \nin my apartment it starts to come up to me, I kept my eyes on it \nnonstop and it just vanished right in front of me. I really thought \nthat was the last straw I no doubt lost my mind.\nIts not like I thought I saw it, its like it was really there then \nas it comes up to me it just vanishes. It looked completely solid, I \nthought how the heck did a stray cat get in my apartment. The same \nthing happened later but with a person, I was coming from the kitchen \nand seen a person walk down the hallway I run quickly to the hallway \nand nothing. I told my fiance about the cat, I didnt say nothing \nabout the person because I dont want her to think Im crazy. The odd \nthing was that just the other day she said she seen some kind of \nanimal run through our living room , when she went to find out what \nit was it was gone. Her experience was a bit different as she seen it \ncut in front of a doorway. I was standing in front of it and seen it \njust evaporate in front of my eyes. Anyway long story short I toy \nwent off on its own across the room while holding my 4 month old \ndaughter in my lap. (its an electronic toy with no remote control or \nmotion sensor, you actually have to hit a button to set it off, so \nhow it went off with no button being pressed was beyond me). So I \nsaid if there is anyone here set that toy off again, and sure enough \nwithin a second or less of my asking it did it again.\nI asked if it can understand what Im saying to do it twice, and \nit did. By that time I was really intrigued and freaked out to say \nthe least. I scrambled to find my video camera and it didnt do it \nwhile taping. I thought perhaps low batteries like some would \nsuggest. Anyway feeling discouraged I went to the restroom and I can \nhear that toy go off again. Then as Im wondering if it might be that \ntoys batters another toy in the living room starts to go off along \nwith the first toy. How this is going on in a freshly built place \nwhere there has not been a house built on the same location before is \nbeyond me, a portion of trees had to be cleared for these apartments. \nPerhaps the land itself, or a nearby house since there are a few from \nline of sight, no way for me to tell I guess. I completely lost track \nof my point, but there you have it.\n--- In EVP-ITC@yahoogroups.com, Frank Ratka &lt;warrior18eii@...&gt; wrote:\n&gt;\n&gt; Okay, its just an inexpensive EM meter. The ELF/VLF detection range \nposses a problem in that it will detect human speech and giving false \npositives. I haven&#39;t been able to find a spec sheet or the \nmanufacturer (K-II Enterprises) to get one. Also, it shows in some of \nthe product reviews that it gives false readings if moved too \nquickly. \n&gt; \n&gt; What does one cost?\n&gt; \n&gt; Regards,\n&gt; \n&gt; Frank R.\n&gt; \n&gt; ----- Original Message ----\n&gt; From: Lynn burton &lt;sunplex_chef@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Thursday, September 27, 2007 10:56:04 AM\n&gt; Subject: Re: [EVP-ITC] A new gadget?\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Hey Guys\n&gt; Here is the info taken straight off of the company&#39;s \nwebsite. I have to say that it is a very affordable meter and very \nrugged. I am by no means a professional in this field, but I have to \nsay that it is by far one of the most useful pieces I carry. The \ncompany is K II (2) enterprises, I got mine off of ebay and had it in \nabout 3 weeks do to back log in production. I hope this helps.\n&gt; \n&gt; Lynn\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Protect your family from harmful EMFs! Measure the EMF (Electro \nmagnetic Field) strength of every electrical device in your home, \nworkplace or school; outdoor power lines, underground lines and even \nwhen you travel and shop for appliances. Health concerns about the \nnegative effects of ELECTRO MAGNETIC FIELDS (EMF) from appliances, \npower lines, and home wiring have caused the U.S. Government to issue \na warning to use &quot;Prudent Avoidance&quot; to help reduce your exposure to \nthis risk. Since EMF&#39;s are everywhere it may be impossible to \ntotally avoid them. The SAFE RANGE EMF METER from K-II can help you \nmeasure these\n&gt; potentially harmful fields and determine the safe range to help \nreduce exposure. It also helps you determine which appliances produce \nhigh level emissions.\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; FEATURES INCLUDE: \n&gt; \n&gt; \n&gt; Easy to read LED Display \n&gt; \n&gt; 50\n&gt; & 60 Hz operation \n&gt; \n&gt; Five level milliGauss ranges \n&gt; \n&gt; For indoor and outdoor use \n&gt; \n&gt; Durable plastic case \n&gt; \n&gt; \n&gt; \n&gt; Operates for months on a single 9V battery \n&gt; \n&gt; \n&gt; \n&gt; Detects the ELF range (50 to 1,000Hz) & VLF range (1,000 to \n20,000Hz)\n&gt; \n&gt; Frank Ratka &lt;warrior18eii@ yahoo.com&gt; wrote: I \nhaven&#39;t &quot;played&quot; with one of these yet. What is the technology based \non? What is it measuring to get the\n&gt; spikes?\n&gt; \n&gt; Regards,\n&gt; \n&gt; Frank R.\n&gt; \n&gt; ----- Original Message ----\n&gt; From: Lynn burton &lt;sunplex_chef@ yahoo.com&gt;\n&gt; To: EVP-ITC@yahoogroups .com\n&gt; Sent: Thursday, September 27, 2007 10:35:32 AM\n&gt; Subject: Re: [EVP-ITC] A new gadget?\n&gt; \n&gt; \n&gt; Good morning all,\n&gt; \n&gt; Chris Fleming used one on the episode about the Manson \nmurders before. I have had one for a while now, and let me be the \nfirst to say that it works. I have had numerous two way \nconversations using it, as well as captured video evidence of these \nconversations showing that there is nothing around capable of giving \noff an EMF. The only issue that I have concern with is unlike EVP \nwork or video ITC work you have no recognizable\n&gt; voice or image to positively correlate who the communication is \ncoming from. In my case, I might ask the question &quot;Are you Sylvia, \nmy mother, show me two spikes for yes and one spike for no&quot; and the \nmeter will spike twice for yes, but I have no voice or image I would \nrecognize to verify that is who is causing the meter to spike. The \nmeter is a very useful tool and I do not conduct an investigation or \nsession without it by my side, but like the rest of the tools in this \nfield it has its valuable points as well as negative points. \n&gt; \n&gt; Lynn \n&gt; \n&gt; Frank Sumption &lt;franks-boxes@ hotmail.com&gt; wrote:\n&gt; \n&gt; I saw on Ghost Hunters last night that they were using a &quot;K2 Meter&quot; \nto get yes-no answers from the unseen. I never heard of that meter \nbefore. \n&gt; \n&gt; Frank-S\n&gt; \n&gt; \n&gt; \n&gt; Invite your mail contacts to join your friends list with Windows \nLive Spaces. It&#39;s easy! Try it! \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Building a website is a piece of cake. \n&gt; Yahoo! Small Business gives you all the tools to get online. \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Be a better Heartthrob. Get better relationship answers from \nsomeone who knows.\n&gt; Yahoo! Answers - Check it out. \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Fussy? Opinionated? Impossible to please? Perfect. Join Yahoo!&#39;s \nuser panel and lay it on us.\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; &lt;!--\n&gt; \n&gt; #ygrp-mkp{\n&gt; border:1px solid #d8d8d8;font-family:Arial;margin:14px \n0px;padding:0px 14px;}\n&gt; #ygrp-mkp hr{\n&gt; border:1px solid #d8d8d8;}\n&gt; #ygrp-mkp #hd{\n&gt; color:#628c2a;font-size:85%;font-weight:bold;line-\nheight:122%;margin:10px 0px;}\n&gt; #ygrp-mkp #ads{\n&gt; margin-bottom:10px;}\n&gt; #ygrp-mkp .ad{\n&gt; padding:0 0;}\n&gt; #ygrp-mkp .ad a{\n&gt; color:#0000ff;text-decoration:none;}\n&gt; --&gt;\n&gt; \n&gt; \n&gt; \n&gt; &lt;!--\n&gt; \n&gt; #ygrp-sponsor #ygrp-lc{\n&gt; font-family:Arial;}\n&gt; #ygrp-sponsor #ygrp-lc #hd{\n&gt; margin:10px 0px;font-weight:bold;font-size:78%;line-height:122%;}\n&gt; #ygrp-sponsor #ygrp-lc .ad{\n&gt; margin-bottom:10px;padding:0 0;}\n&gt; --&gt;\n&gt; \n&gt; \n&gt; \n&gt; &lt;!--\n&gt; \n&gt; #ygrp-mlmsg {font-size:13px;font-family:arial, helvetica, clean, \nsans-serif;}\n&gt; #ygrp-mlmsg table {font-size:inherit;font:100%;}\n&gt; #ygrp-mlmsg select, input, textarea {font:99% arial, helvetica, \nclean, sans-serif;}\n&gt; #ygrp-mlmsg pre, code {font:115% monospace;}\n&gt; #ygrp-mlmsg * {line-height:1.22em;}\n&gt; #ygrp-text{\n&gt; font-family:Georgia;\n&gt; }\n&gt; #ygrp-text p{\n&gt; margin:0 0 1em 0;}\n&gt; #ygrp-tpmsgs{\n&gt; font-family:Arial;\n&gt; clear:both;}\n&gt; #ygrp-vitnav{\n&gt; padding-top:10px;font-family:Verdana;font-size:77%;margin:0;}\n&gt; #ygrp-vitnav a{\n&gt; padding:0 1px;}\n&gt; #ygrp-actbar{\n&gt; clear:both;margin:25px 0;white-space:nowrap;color:#666;text-\nalign:right;}\n&gt; #ygrp-actbar .left{\n&gt; float:left;white-space:nowrap;}\n&gt; .bld{font-weight:bold;}\n&gt; #ygrp-grft{\n&gt; font-family:Verdana;font-size:77%;padding:15px 0;}\n&gt; #ygrp-ft{\n&gt; font-family:verdana;font-size:77%;border-top:1px solid #666;\n&gt; padding:5px 0;\n&gt; }\n&gt; #ygrp-mlmsg #logo{\n&gt; padding-bottom:10px;}\n&gt; \n&gt; #ygrp-vital{\n&gt; background-color:#e0ecee;margin-bottom:20px;padding:2px 0 8px 8px;}\n&gt; #ygrp-vital #vithd{\n&gt; font-size:77%;font-family:Verdana;font-weight:bold;color:#333;text-\ntransform:uppercase;}\n&gt; #ygrp-vital ul{\n&gt; padding:0;margin:2px 0;}\n&gt; #ygrp-vital ul li{\n&gt; list-style-type:none;clear:both;border:1px solid #e0ecee;\n&gt; }\n&gt; #ygrp-vital ul li .ct{\n&gt; font-weight:bold;color:#ff7900;float:right;width:2em;text-\nalign:right;padding-right:.5em;}\n&gt; #ygrp-vital ul li .cat{\n&gt; font-weight:bold;}\n&gt; #ygrp-vital a{\n&gt; text-decoration:none;}\n&gt; \n&gt; #ygrp-vital a:hover{\n&gt; text-decoration:underline;}\n&gt; \n&gt; #ygrp-sponsor #hd{\n&gt; color:#999;font-size:77%;}\n&gt; #ygrp-sponsor #ov{\n&gt; padding:6px 13px;background-color:#e0ecee;margin-bottom:20px;}\n&gt; #ygrp-sponsor #ov ul{\n&gt; padding:0 0 0 8px;margin:0;}\n&gt; #ygrp-sponsor #ov li{\n&gt; list-style-type:square;padding:6px 0;font-size:77%;}\n&gt; #ygrp-sponsor #ov li a{\n&gt; text-decoration:none;font-size:130%;}\n&gt; #ygrp-sponsor #nc{\n&gt; background-color:#eee;margin-bottom:20px;padding:0 8px;}\n&gt; #ygrp-sponsor .ad{\n&gt; padding:8px 0;}\n&gt; #ygrp-sponsor .ad #hd1{\n&gt; font-family:Arial;font-weight:bold;color:#628c2a;font-\nsize:100%;line-height:122%;}\n&gt; #ygrp-sponsor .ad a{\n&gt; text-decoration:none;}\n&gt; #ygrp-sponsor .ad a:hover{\n&gt; text-decoration:underline;}\n&gt; #ygrp-sponsor .ad p{\n&gt; margin:0;}\n&gt; o{font-size:0;}\n&gt; .MsoNormal{\n&gt; margin:0 0 0 0;}\n&gt; #ygrp-text tt{\n&gt; font-size:120%;}\n&gt; blockquote{margin:0 0 0 4px;}\n&gt; .replbq{margin:4;}\n&gt; --&gt;\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n__________________________________________________________\n______________\n&gt; Got a little couch potato? \n&gt; Check out fun summer activities for kids.\n&gt; http://search.yahoo.com/search?\nfr=oni_on_mail&p=summer+activities+for+kids&cs=bz\n&gt;\n\n\n\n                         \n\n       \n---------------------------------\nDon&#39;t let your dream ride pass you by.    Make it a reality with Yahoo! Autos. \r\n--0-1834391675-1190992183=:63375\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;DIV&gt;Good morning all,&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&nbsp;&nbsp; I have used this meter with great success as well as with great dismay.&nbsp; I have had the meter &quot;pennied down&quot; sitting on a table top, and have a toy in another room respond to me without any activity on the meter.&nbsp; I feel it is the spirit&#39;s choice and in which manner it feels more comfortable in communicating with you.&nbsp; I have had lights turn off and back on again in succession in response to questions and no activity on the meter, and then I have had no other responses except the meter, so once again it is entirely up to the entity and how it wishes to respond.&nbsp; In regards to the new apartment building, check the history of the land that it sits on.&nbsp; In a few of my occasions it has been the energy tied to the land or former land owners that has caused the activity.&nbsp; I have done an investigation in a &quot;new construction&quot; home site that the family had not moved into yet and\n the activity was on the increase, the new owners bought this piece of property&nbsp;as a wooded lot with no prior establishment being on site, to anyones knowledge that is.&nbsp; To all of our surprise, land records had nothing available for that property other than the location and the pertinent info, however further research and many phone calls later it was discovered that the property sat on the edge of a local Indian tribal settlement from the 1700&#39;s (thanks to the Dept. of the Interior and the Bureau of Native American (Indian) Affairs.&nbsp; It just goes to show you that persistence and continued research pays off in the long run ( this one took about 4 months to research).&nbsp; So Travis just keep checking and get all you can on the property from as far back as you can, you never know what you might fond out.&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;Lynn Burton&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;Travis &lt;vampire2kd@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/DIV&gt;  &lt;BLOCKQUOTE class=replbq\n style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;DIV&gt;Chris Fleming is selling them on his website for $49.95 + $10.00 s/h. &lt;BR&gt;Which was my point though. Im sure it can be used effectively to &lt;BR&gt;communicate, but anything can be used to communicate effictively as &lt;BR&gt;long as you stay objective and dont read too much into some things. &lt;BR&gt;So I was just suggesting if you have an emf detector already or other &lt;BR&gt;things available why buy something which is pretty much the same &lt;BR&gt;thing you have already. Ive noted that some electronic toys work very &lt;BR&gt;well if there really is someone on the other side wanting to make &lt;BR&gt;contact badly enough. For instance\n right now I live in a brand new &lt;BR&gt;apartment building.&lt;BR&gt;We just recently got rid of our house and moved into an apartment &lt;BR&gt;to save some money up. Usually I start wondering about the history of &lt;BR&gt;a house or an apartment when I first move in. Considering though this &lt;BR&gt;building and everything in it or on it are brand new as the building &lt;BR&gt;was just put up and we were the very first couple to live in this &lt;BR&gt;apartment. Which is a pretty cool fresh feeling, to be the first &lt;BR&gt;people to live in a place. So it never even ocurred to me to think &lt;BR&gt;about its history, since it has no history. Never-the-less after &lt;BR&gt;about 2 months of living there I start feeling things. Like Im being &lt;BR&gt;watched. It slowly progresses to actually seeing things out of the &lt;BR&gt;corner of my eyes, I shrug this off too. Then I actually seen a cat &lt;BR&gt;in my apartment it starts to come up to me, I kept my eyes on it &lt;BR&gt;nonstop and it just vanished right in front of me. I really thought\n &lt;BR&gt;that was the last straw I no doubt lost my mind.&lt;BR&gt;Its not like I thought I saw it, its like it was really there then &lt;BR&gt;as it comes up to me it just vanishes. It looked completely solid, I &lt;BR&gt;thought how the heck did a stray cat get in my apartment. The same &lt;BR&gt;thing happened later but with a person, I was coming from the kitchen &lt;BR&gt;and seen a person walk down the hallway I run quickly to the hallway &lt;BR&gt;and nothing. I told my fiance about the cat, I didnt say nothing &lt;BR&gt;about the person because I dont want her to think Im crazy. The odd &lt;BR&gt;thing was that just the other day she said she seen some kind of &lt;BR&gt;animal run through our living room , when she went to find out what &lt;BR&gt;it was it was gone. Her experience was a bit different as she seen it &lt;BR&gt;cut in front of a doorway. I was standing in front of it and seen it &lt;BR&gt;just evaporate in front of my eyes. Anyway long story short I toy &lt;BR&gt;went off on its own across the room while holding my 4 month old\n &lt;BR&gt;daughter in my lap. (its an electronic toy with no remote control or &lt;BR&gt;motion sensor, you actually have to hit a button to set it off, so &lt;BR&gt;how it went off with no button being pressed was beyond me). So I &lt;BR&gt;said if there is anyone here set that toy off again, and sure enough &lt;BR&gt;within a second or less of my asking it did it again.&lt;BR&gt;I asked if it can understand what Im saying to do it twice, and &lt;BR&gt;it did. By that time I was really intrigued and freaked out to say &lt;BR&gt;the least. I scrambled to find my video camera and it didnt do it &lt;BR&gt;while taping. I thought perhaps low batteries like some would &lt;BR&gt;suggest. Anyway feeling discouraged I went to the restroom and I can &lt;BR&gt;hear that toy go off again. Then as Im wondering if it might be that &lt;BR&gt;toys batters another toy in the living room starts to go off along &lt;BR&gt;with the first toy. How this is going on in a freshly built place &lt;BR&gt;where there has not been a house built on the same location before is\n &lt;BR&gt;beyond me, a portion of trees had to be cleared for these apartments. &lt;BR&gt;Perhaps the land itself, or a nearby house since there are a few from &lt;BR&gt;line of sight, no way for me to tell I guess. I completely lost track &lt;BR&gt;of my point, but there you have it.&lt;BR&gt;--- In &lt;A href=&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;, Frank Ratka &lt;warrior18eii@&lt;WBR&gt;...&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; Okay, its just an inexpensive EM meter. The ELF/VLF detection range &lt;BR&gt;posses a problem in that it will detect human speech and giving false &lt;BR&gt;positives. I haven&#39;t been able to find a spec sheet or the &lt;BR&gt;manufacturer (K-II Enterprises) to get one. Also, it shows in some of &lt;BR&gt;the product reviews that it gives false readings if moved too &lt;BR&gt;quickly. &lt;BR&gt;&gt; &lt;BR&gt;&gt; What does one cost?&lt;BR&gt;&gt; &lt;BR&gt;&gt; Regards,&lt;BR&gt;&gt; &lt;BR&gt;&gt; Frank R.&lt;BR&gt;&gt; &lt;BR&gt;&gt; ----- Original Message ----&lt;BR&gt;&gt; From: Lynn burton &lt;sunplex_chef@&lt;WBR&gt;...&gt;&lt;BR&gt;&gt; To: &lt;A\n href=&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;&lt;BR&gt;&gt; Sent: Thursday, September 27, 2007 10:56:04 AM&lt;BR&gt;&gt; Subject: Re: [EVP-ITC] A new gadget?&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; Hey Guys&lt;BR&gt;&gt; Here is the info taken straight off of the company&#39;s &lt;BR&gt;website. I have to say that it is a very affordable meter and very &lt;BR&gt;rugged. I am by no means a professional in this field, but I have to &lt;BR&gt;say that it is by far one of the most useful pieces I carry. The &lt;BR&gt;company is K II (2) enterprises, I got mine off of ebay and had it in &lt;BR&gt;about 3 weeks do to back log in production. I hope this helps.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Lynn&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; Protect your family from harmful EMFs! Measure the EMF (Electro &lt;BR&gt;magnetic Field) strength of every electrical device in your\n home, &lt;BR&gt;workplace or school; outdoor power lines, underground lines and even &lt;BR&gt;when you travel and shop for appliances. Health concerns about the &lt;BR&gt;negative effects of ELECTRO MAGNETIC FIELDS (EMF) from appliances, &lt;BR&gt;power lines, and home wiring have caused the U.S. Government to issue &lt;BR&gt;a warning to use &quot;Prudent Avoidance&quot; to help reduce your exposure to &lt;BR&gt;this risk. Since EMF&#39;s are everywhere it may be impossible to &lt;BR&gt;totally avoid them. The SAFE RANGE EMF METER from K-II can help you &lt;BR&gt;measure these&lt;BR&gt;&gt; potentially harmful fields and determine the safe range to help &lt;BR&gt;reduce exposure. It also helps you determine which appliances produce &lt;BR&gt;high level emissions.&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; FEATURES INCLUDE: &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; Easy to read LED Display &lt;BR&gt;&gt; &lt;BR&gt;&gt; 50&lt;BR&gt;&gt; &amp; 60 Hz operation &lt;BR&gt;&gt; &lt;BR&gt;&gt; Five level milliGauss ranges &lt;BR&gt;&gt; &lt;BR&gt;&gt; For indoor and outdoor use &lt;BR&gt;&gt; &lt;BR&gt;&gt; Durable plastic\n case &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; Operates for months on a single 9V battery &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; Detects the ELF range (50 to 1,000Hz) &amp; VLF range (1,000 to &lt;BR&gt;20,000Hz)&lt;BR&gt;&gt; &lt;BR&gt;&gt; Frank Ratka &lt;warrior18eii@ yahoo.com&gt; wrote: I &lt;BR&gt;haven&#39;t &quot;played&quot; with one of these yet. What is the technology based &lt;BR&gt;on? What is it measuring to get the&lt;BR&gt;&gt; spikes?&lt;BR&gt;&gt; &lt;BR&gt;&gt; Regards,&lt;BR&gt;&gt; &lt;BR&gt;&gt; Frank R.&lt;BR&gt;&gt; &lt;BR&gt;&gt; ----- Original Message ----&lt;BR&gt;&gt; From: Lynn burton &lt;sunplex_chef@ yahoo.com&gt;&lt;BR&gt;&gt; To: EVP-ITC@yahoogroups .com&lt;BR&gt;&gt; Sent: Thursday, September 27, 2007 10:35:32 AM&lt;BR&gt;&gt; Subject: Re: [EVP-ITC] A new gadget?&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; Good morning all,&lt;BR&gt;&gt; &lt;BR&gt;&gt; Chris Fleming used one on the episode about the Manson &lt;BR&gt;murders before. I have had one for a while now, and let me be the &lt;BR&gt;first to say that it works. I have had numerous two way &lt;BR&gt;conversations using it, as well as captured\n video evidence of these &lt;BR&gt;conversations showing that there is nothing around capable of giving &lt;BR&gt;off an EMF. The only issue that I have concern with is unlike EVP &lt;BR&gt;work or video ITC work you have no recognizable&lt;BR&gt;&gt; voice or image to positively correlate who the communication is &lt;BR&gt;coming from. In my case, I might ask the question &quot;Are you Sylvia, &lt;BR&gt;my mother, show me two spikes for yes and one spike for no&quot; and the &lt;BR&gt;meter will spike twice for yes, but I have no voice or image I would &lt;BR&gt;recognize to verify that is who is causing the meter to spike. The &lt;BR&gt;meter is a very useful tool and I do not conduct an investigation or &lt;BR&gt;session without it by my side, but like the rest of the tools in this &lt;BR&gt;field it has its valuable points as well as negative points. &lt;BR&gt;&gt; &lt;BR&gt;&gt; Lynn &lt;BR&gt;&gt; &lt;BR&gt;&gt; Frank Sumption &lt;franks-boxes@ hotmail.com&gt; wrote:&lt;BR&gt;&gt; &lt;BR&gt;&gt; I saw on Ghost Hunters last night that they were using a &quot;K2 Meter&quot; &lt;BR&gt;to get\n yes-no answers from the unseen. I never heard of that meter &lt;BR&gt;before. &lt;BR&gt;&gt; &lt;BR&gt;&gt; Frank-S&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; Invite your mail contacts to join your friends list with Windows &lt;BR&gt;Live Spaces. It&#39;s easy! Try it! &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; Building a website is a piece of cake. &lt;BR&gt;&gt; Yahoo! Small Business gives you all the tools to get online. &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; Be a better Heartthrob. Get better relationship answers from &lt;BR&gt;someone who knows.&lt;BR&gt;&gt; Yahoo! Answers - Check it out. &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; Fussy? Opinionated? Impossible to please? Perfect. Join Yahoo!&#39;s &lt;BR&gt;user panel and lay it on us.&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;!--&lt;BR&gt;&gt; &lt;BR&gt;&gt; #ygrp-mkp{&lt;BR&gt;&gt; border:1px solid #d8d8d8;font-&lt;WBR&gt;family:Arial;&lt;WBR&gt;margin:14px &lt;BR&gt;0px;padding:&lt;WBR&gt;0px 14px;}&lt;BR&gt;&gt;\n #ygrp-mkp hr{&lt;BR&gt;&gt; border:1px solid #d8d8d8;}&lt;BR&gt;&gt; #ygrp-mkp #hd{&lt;BR&gt;&gt; color:#628c2a;&lt;WBR&gt;font-size:&lt;WBR&gt;85%;font-&lt;WBR&gt;weight:bold;&lt;WBR&gt;line-&lt;BR&gt;height:122%;&lt;WBR&gt;margin:10px 0px;}&lt;BR&gt;&gt; #ygrp-mkp #ads{&lt;BR&gt;&gt; margin-bottom:&lt;WBR&gt;10px;}&lt;BR&gt;&gt; #ygrp-mkp .ad{&lt;BR&gt;&gt; padding:0 0;}&lt;BR&gt;&gt; #ygrp-mkp .ad a{&lt;BR&gt;&gt; color:#0000ff;&lt;WBR&gt;text-decoration:&lt;WBR&gt;none;}&lt;BR&gt;&gt; --&gt;&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;!--&lt;BR&gt;&gt; &lt;BR&gt;&gt; #ygrp-sponsor #ygrp-lc{&lt;BR&gt;&gt; font-family:&lt;WBR&gt;Arial;}&lt;BR&gt;&gt; #ygrp-sponsor #ygrp-lc #hd{&lt;BR&gt;&gt; margin:10px 0px;font-weight:&lt;WBR&gt;bold;font-&lt;WBR&gt;size:78%;&lt;WBR&gt;line-height:&lt;WBR&gt;122%;}&lt;BR&gt;&gt; #ygrp-sponsor #ygrp-lc .ad{&lt;BR&gt;&gt; margin-bottom:&lt;WBR&gt;10px;padding:&lt;WBR&gt;0 0;}&lt;BR&gt;&gt; --&gt;&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;!--&lt;BR&gt;&gt; &lt;BR&gt;&gt; #ygrp-mlmsg {font-size:13px;&lt;WBR&gt;font-family:&lt;WBR&gt;arial, helvetica, clean, &lt;BR&gt;sans-serif;}&lt;BR&gt;&gt; #ygrp-mlmsg table {font-size:inherit;&lt;WBR&gt;font:100%&lt;WBR&gt;;}&lt;BR&gt;&gt; #ygrp-mlmsg select,\n input, textarea {font:99% arial, helvetica, &lt;BR&gt;clean, sans-serif;}&lt;BR&gt;&gt; #ygrp-mlmsg pre, code {font:115% monospace;}&lt;BR&gt;&gt; #ygrp-mlmsg * {line-height:&lt;WBR&gt;1.22em;}&lt;BR&gt;&gt; #ygrp-text{&lt;BR&gt;&gt; font-family:&lt;WBR&gt;Georgia;&lt;BR&gt;&gt; }&lt;BR&gt;&gt; #ygrp-text p{&lt;BR&gt;&gt; margin:0 0 1em 0;}&lt;BR&gt;&gt; #ygrp-tpmsgs{&lt;BR&gt;&gt; font-family:&lt;WBR&gt;Arial;&lt;BR&gt;&gt; clear:both;}&lt;BR&gt;&gt; #ygrp-vitnav{&lt;BR&gt;&gt; padding-top:&lt;WBR&gt;10px;font-&lt;WBR&gt;family:Verdana;&lt;WBR&gt;font-size:&lt;WBR&gt;77%;margin:&lt;WBR&gt;0;}&lt;BR&gt;&gt; #ygrp-vitnav a{&lt;BR&gt;&gt; padding:0 1px;}&lt;BR&gt;&gt; #ygrp-actbar{&lt;BR&gt;&gt; clear:both;margin:&lt;WBR&gt;25px 0;white-space:&lt;WBR&gt;nowrap;color:&lt;WBR&gt;#666;text-&lt;BR&gt;align:right;&lt;WBR&gt;}&lt;BR&gt;&gt; #ygrp-actbar .left{&lt;BR&gt;&gt; float:left;white-&lt;WBR&gt;space:nowrap;&lt;WBR&gt;}&lt;BR&gt;&gt; .bld{font-weight:&lt;WBR&gt;bold;}&lt;BR&gt;&gt; #ygrp-grft{&lt;BR&gt;&gt; font-family:&lt;WBR&gt;Verdana;font-&lt;WBR&gt;size:77%;&lt;WBR&gt;padding:15px 0;}&lt;BR&gt;&gt; #ygrp-ft{&lt;BR&gt;&gt; font-family:&lt;WBR&gt;verdana;font-&lt;WBR&gt;size:77%;&lt;WBR&gt;border-top:&lt;WBR&gt;1px solid #666;&lt;BR&gt;&gt; padding:5px\n 0;&lt;BR&gt;&gt; }&lt;BR&gt;&gt; #ygrp-mlmsg #logo{&lt;BR&gt;&gt; padding-bottom:&lt;WBR&gt;10px;}&lt;BR&gt;&gt; &lt;BR&gt;&gt; #ygrp-vital{&lt;BR&gt;&gt; background-color:&lt;WBR&gt;#e0ecee;margin-&lt;WBR&gt;bottom:20px;&lt;WBR&gt;padding:2px 0 8px 8px;}&lt;BR&gt;&gt; #ygrp-vital #vithd{&lt;BR&gt;&gt; font-size:77%&lt;WBR&gt;;font-family:&lt;WBR&gt;Verdana;font-&lt;WBR&gt;weight:bold;&lt;WBR&gt;color:#333;&lt;WBR&gt;text-&lt;BR&gt;transform:uppercase&lt;WBR&gt;;}&lt;BR&gt;&gt; #ygrp-vital ul{&lt;BR&gt;&gt; padding:0;margin:&lt;WBR&gt;2px 0;}&lt;BR&gt;&gt; #ygrp-vital ul li{&lt;BR&gt;&gt; list-style-type:&lt;WBR&gt;none;clear:&lt;WBR&gt;both;border:&lt;WBR&gt;1px solid #e0ecee;&lt;BR&gt;&gt; }&lt;BR&gt;&gt; #ygrp-vital ul li .ct{&lt;BR&gt;&gt; font-weight:&lt;WBR&gt;bold;color:&lt;WBR&gt;#ff7900;float:&lt;WBR&gt;right;width:&lt;WBR&gt;2em;text-&lt;BR&gt;align:right;&lt;WBR&gt;padding-right:&lt;WBR&gt;.5em;}&lt;BR&gt;&gt; #ygrp-vital ul li .cat{&lt;BR&gt;&gt; font-weight:&lt;WBR&gt;bold;}&lt;BR&gt;&gt; #ygrp-vital a{&lt;BR&gt;&gt; text-decoration:&lt;WBR&gt;none;}&lt;BR&gt;&gt; &lt;BR&gt;&gt; #ygrp-vital a:hover{&lt;BR&gt;&gt; text-decoration:&lt;WBR&gt;underline;&lt;WBR&gt;}&lt;BR&gt;&gt; &lt;BR&gt;&gt; #ygrp-sponsor #hd{&lt;BR&gt;&gt;\n color:#999;font-&lt;WBR&gt;size:77%;&lt;WBR&gt;}&lt;BR&gt;&gt; #ygrp-sponsor #ov{&lt;BR&gt;&gt; padding:6px 13px;background-&lt;WBR&gt;color:#e0ecee;&lt;WBR&gt;margin-bottom:&lt;WBR&gt;20px;}&lt;BR&gt;&gt; #ygrp-sponsor #ov ul{&lt;BR&gt;&gt; padding:0 0 0 8px;margin:0;&lt;WBR&gt;}&lt;BR&gt;&gt; #ygrp-sponsor #ov li{&lt;BR&gt;&gt; list-style-type:&lt;WBR&gt;square;padding:&lt;WBR&gt;6px 0;font-size:&lt;WBR&gt;77%;}&lt;BR&gt;&gt; #ygrp-sponsor #ov li a{&lt;BR&gt;&gt; text-decoration:&lt;WBR&gt;none;font-&lt;WBR&gt;size:130%&lt;WBR&gt;;}&lt;BR&gt;&gt; #ygrp-sponsor #nc{&lt;BR&gt;&gt; background-color:&lt;WBR&gt;#eee;margin-&lt;WBR&gt;bottom:20px;&lt;WBR&gt;padding:0 8px;}&lt;BR&gt;&gt; #ygrp-sponsor .ad{&lt;BR&gt;&gt; padding:8px 0;}&lt;BR&gt;&gt; #ygrp-sponsor .ad #hd1{&lt;BR&gt;&gt; font-family:&lt;WBR&gt;Arial;font-&lt;WBR&gt;weight:bold;&lt;WBR&gt;color:#628c2a;&lt;WBR&gt;font-&lt;BR&gt;size:100%;line-&lt;WBR&gt;height:122%&lt;WBR&gt;;}&lt;BR&gt;&gt; #ygrp-sponsor .ad a{&lt;BR&gt;&gt; text-decoration:&lt;WBR&gt;none;}&lt;BR&gt;&gt; #ygrp-sponsor .ad a:hover{&lt;BR&gt;&gt; text-decoration:&lt;WBR&gt;underline;&lt;WBR&gt;}&lt;BR&gt;&gt; #ygrp-sponsor .ad p{&lt;BR&gt;&gt; margin:0;}&lt;BR&gt;&gt; o{font-size:&lt;WBR&gt;0;}&lt;BR&gt;&gt; .MsoNormal{&lt;BR&gt;&gt;\n margin:0 0 0 0;}&lt;BR&gt;&gt; #ygrp-text tt{&lt;BR&gt;&gt; font-size:120%&lt;WBR&gt;;}&lt;BR&gt;&gt; blockquote{margin:&lt;WBR&gt;0 0 0 4px;}&lt;BR&gt;&gt; .replbq{margin:&lt;WBR&gt;4;}&lt;BR&gt;&gt; --&gt;&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;____________&lt;WBR&gt;_________&lt;WBR&gt;_________&lt;WBR&gt;_________&lt;WBR&gt;_________&lt;WBR&gt;_________&lt;WBR&gt;_&lt;BR&gt;____________&lt;WBR&gt;__&lt;BR&gt;&gt; Got a little couch potato? &lt;BR&gt;&gt; Check out fun summer activities for kids.&lt;BR&gt;&gt; &lt;A href=&quot;http://search.yahoo.com/search?&quot;&gt;http://search.&lt;WBR&gt;yahoo.com/&lt;WBR&gt;search?&lt;/A&gt;&lt;BR&gt;fr=oni_on_mail&amp;&lt;WBR&gt;p=summer+&lt;WBR&gt;activities+&lt;WBR&gt;for+kids&amp;&lt;WBR&gt;cs=bz&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;!--End group email\n --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;p&gt;&#32;\n      &lt;hr size=1&gt;Don&#39;t let your dream ride pass you by.  &lt;a href=&quot;http://us.rd.yahoo.com/evt=51200/*http://autos.yahoo.com/index.html;_ylc=X3oDMTFibjNlcHF0BF9TAzk3MTA3MDc2BHNlYwNtYWlsdGFncwRzbGsDYXV0b3MtZHJlYW1jYXI-&quot;&gt;  Make it a reality&lt;/a&gt; with Yahoo! Autos.\n\n\n\n \n\n\r\n--0-1834391675-1190992183=:63375--"}