{"id": "2338", "subject": "Re: A new gadget?", "author": "psi_research", "timestamp": "2007-09-28T17:11:51Z", "full_text": "We&#39;ve been using the K II for about a year and a half and they&#39;re ok as a low cost emf \ndetector. Moving any emf meter too fast will likely result in false positives but a slow pan \nacross a wall to look for electrical ground leaks will increase reliabilty. We look for emf \nfields in excess of 7 milligause, the K II can detect of to 20 milligause. Studies suggest and \ncontrolled experiments verify that consistant exposure in excess of 7 milligause can result \nin the precieved feeling of being watched or a presense by an unseen force. People \nsometimes feel it&#39;s an invisible intelligence but really it&#39;s the brains response to the \nsynapse activity.  People sometimes interpret stimuli in a way that is familiar, in the case \nof high emf exposure we think it may be a spirit in the room. \n\nBut that&#39;s not to say the location can&#39;t be haunted as well. It&#39;s just that if a particular room \nhas a lot of reported paranormal activity and there is a high emf field then you may want \nto consider that fact in your evaluation of the location. Interesting, there is alternate \nresearch that suggest that exposure to substantial emf fields and the resulting increase in \nnerve ends firing in the brain that genuine psychic abilities are possible. This was referred \nto in the book Spook by Mary Roach.\n\nAny device can be repurposed as a communication tool including the K II. While some \nusers believe that the involutary muscle twitches that occur while holding down the switch \nis sort of like what happens when holding a pendulum, others prefer to have a selectable \non / off switch on their K II. The manufacturer has started offering that option according \nto some of the local groups that have been selling the modified versions on eBay.\n\n-Bill\n\n--- In EVP-ITC@yahoogroups.com, Lynn burton &lt;sunplex_chef@...&gt; wrote:\n&gt;\n&gt; Good morning all,\n&gt;    \n&gt;       I have used this meter with great success as well as with great dismay.  I have had \nthe meter &quot;pennied down&quot; sitting on a table top, and have a toy in another room respond \nto me without any activity on the meter.  I feel it is the spirit&#39;s choice and in which manner \nit feels more comfortable in communicating with you.  I have had lights turn off and back \non again in succession in response to questions and no activity on the meter, and then I \nhave had no other responses except the meter, so once again it is entirely up to the entity \nand how it wishes to respond.  In regards to the new apartment building, check the history \nof the land that it sits on.  In a few of my occasions it has been the energy tied to the land \nor former land owners that has caused the activity.  I have done an investigation in a &quot;new \nconstruction&quot; home site that the family had not moved into yet and the activity was on the \nincrease, the new owners bought this piece of property as a wooded lot with\n&gt;  no prior establishment being on site, to anyones knowledge that is.  To all of our \nsurprise, land records had nothing available for that property other than the location and \nthe pertinent info, however further research and many phone calls later it was discovered \nthat the property sat on the edge of a local Indian tribal settlement from the 1700&#39;s \n(thanks to the Dept. of the Interior and the Bureau of Native American (Indian) Affairs.  It \njust goes to show you that persistence and continued research pays off in the long run \n( this one took about 4 months to research).  So Travis just keep checking and get all you \ncan on the property from as far back as you can, you never know what you might fond out.\n&gt;    \n&gt;   Lynn Burton\n&gt;"}