{"id": "2347", "subject": "Re: Out of body? Spirit walking.", "author": "LC Duplatt", "timestamp": "2007-09-29T16:55:03Z", "full_text": "Yes, I have heard of this.  \n\nI remember one woman speaking of being on a beach and walking right \nout of her body.  This is different from the meditation type of OBE \nand is often referred to as an SOBE - or &quot;spontaneous out of body \nexperience.&quot;  I believe this is what you are describing.  \n\nThe following link has an interesting article: \nhttp://www.astraldynamics.com/tutorials/?BoardID=111&BulletinID=472\n\n\nLC\nAngels & Ghosts\n\n--- In EVP-ITC@yahoogroups.com, Misty Dawn &lt;bulletbabea@...&gt; wrote:\n&gt;\n&gt; Just kicking around some thoughts in my head, and nobody is up \ntonight to share thier ideas so I am writing it down anyway while \nit&#39;s fresh in my thoughts. \n&gt;    \n&gt;   I know and understand pretty well about OOB&#39;s and have read \npeoples experiences. So far all of my disembodied experiences were \nwhile I was &quot;unconcious&quot; with little to verify any of the \nexperiences as being anything but a dream state. However lately I \nhave begun to do something again that I havent done since I was a \nsmall child. \n&gt;    \n&gt;   You know how it is when you wake up in the morning hit the \nsnooze button, roll over and lay there thinking..... man I dont want \nto get up right now I am soooo comfortable. Well lets just say I do \nthat alot even tho I usually get up before the next alarm hits in a \nfew minutes I still press it, roll over and lay there for a minute \nLOL. Some people hit the coffee machine.. i hit the snooze.\n&gt;    \n&gt;   However, lately I am rolling over, but the body seems to stay \nstill turned the other way. I used to do it often when I was a kid I \nwould wake up in a totally different position than I thought I was \nlaying in when I had my eyes closed. I&#39;d think I was layin on my \nstomache and realize I was flat on my back or on my side. With \ngravity its pretty easy to feel which end is facing down and once I \nam fully alert its a little disorientating at first. I am curious if \nanybody else has that experience, including those who travel out of \nbody at will.\n&gt;    \n&gt;   Misty\n&gt; \n&gt;        \n&gt; ---------------------------------\n&gt; Luggage? GPS? Comic books? \n&gt; Check out fitting  gifts for grads at Yahoo! Search.\n&gt;"}