{"id": "2352", "subject": "OOBE & time future?", "author": "HKaczmarek", "timestamp": "2007-09-30T05:55:50Z", "full_text": "------=_NextPart_000_0038_01C802FC.A4D8B9A0\r\nContent-Type: text/plain;\n\tcharset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nI haven&#39;t been able to respond to this as I would have liked to :) I have h=\r\nad spontaneous OOBE&#39;s all my life as well. For a long time I experienced sl=\r\neep paralysis. I still do on occasion, but for the most part I can break ou=\r\nt before I get stuck. At first they were really scary, but because they wer=\r\ne so frequent, they just became annoying LOL! I did actually see a Dr becau=\r\nse I wanted them to stop. I don&#39;t think they believed me! The Dr literally =\r\njust looked at me and said I&#39;m probably just under too much stress, and to =\r\nnot sleep on my back. I have experienced it in ALL positions so it&#39;s not ju=\r\nst a back thing for me. Anyway! \nThe post about falling out of bed and then=\r\n still seeing you body reminded me of an interesting OBE I had experienced.=\r\n I was living in my first house with my husband. My oldest was about 6 and =\r\nmy middle son was a baby. I fell asleep with the baby next to me, but I was=\r\n sleeping in a weird position. I was locked in the sleep paralysis but deci=\r\nded to concentrate on my third eye. I was out! Floating about the room then=\r\n. There were colors swirling of all kinds. It was very pretty. Then I walke=\r\nd into my bedroom and I had a huge dresser mirror. I could not see myself. =\r\nThat was one of the things I actually feared, was looking into a mirror. I =\r\ndidn&#39;t want to see anyone else!! I was very aware that I was OBE. I decided=\r\n to look at the time to see when I would go back. I was going to explore mo=\r\nre, but I got scared and then was sucked back into my body. I had a hard ti=\r\nme fully awakening though. I was in sleep paralysis still and I kept liftin=\r\ng my arm to see if I was out of it yet or not LOL! If I couldn&#39;t see my phy=\r\nsical arm lift, I knew I was still in. It took a bit. The one thing I found=\r\n I was disappointed with was I didn&#39;t remember the time I saw. I know I loo=\r\nked and I know I saw it, but I couldn&#39;t remember it. I don&#39;t think I was in=\r\n that long.\n\nA more recent experience that I&#39;ve had and maybe someone can e=\r\nnlighten me on. I don&#39;t know if I was OBE or not. I&#39;ve had it happen more t=\r\nhan once, but I&#39;ve also been awake, it&#39;s been during the day, etc. Basicall=\r\ny I look at my watch and I see the time. I look at my watch again and it&#39;s =\r\na time that is earlier than I saw. I saw a time that was in the future basi=\r\ncally. I have a schedule that I follow and while it&#39;s not real strict, I ha=\r\nve to pick up the kids from school, etc. I always wear a watch and I watch =\r\nthe time. This happens more frequently and I&#39;m trying to determine why. Not=\r\nhing special happens at the time that I &quot;thought&quot; it was. I had one that th=\r\ne date was wrong! I knew it was wrong, yet the date displayed 9/23 in the b=\r\neginning of September more than once. Nothing happened (at least to me) on =\r\nthat day. Anyone have this time &quot;issues&quot; (for lack of a better term) happen=\r\ning too?\n\nHeather\n\n\n\n\n\n  . \n   \r\n------=_NextPart_000_0038_01C802FC.A4D8B9A0\r\nContent-Type: text/html;\n\tcharset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML 4.01 Transitional//EN&quot; &quot;http://www.=\r\nw3c.org/TR/1999/REC-html401-19991224/loose.dtd&quot;&gt;\n&lt;HTML&gt;&lt;HEAD&gt;\n&lt;META http-eq=\r\nuiv=3DContent-Type content=3D&quot;text/html; charset=3Diso-8859-1&quot;&gt;\n&lt;META conte=\r\nnt=3D&quot;MSHTML 6.00.6000.16527&quot; name=3DGENERATOR&gt;&lt;/HEAD&gt;\n&lt;BODY style=3D&quot;BACKG=\r\nROUND-COLOR: #ffffff&quot; bgColor=3D#ffffff&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;I=\r\n haven&#39;t been able to respond to this as I would \nhave liked to :) I have h=\r\nad spontaneous OOBE&#39;s all my life as well. For a long \ntime I experienced s=\r\nleep paralysis. I still do on occasion, but for the most \npart I can break =\r\nout before I get stuck. At first they were really scary, but \nbecause they =\r\nwere so frequent, they just became annoying LOL! I did actually see \na Dr b=\r\necause I wanted them to stop. I don&#39;t think they believed me! The Dr \nliter=\r\nally just looked at me and said I&#39;m probably just under too much stress, \na=\r\nnd to not sleep on my back. I have experienced it in ALL positions so it&#39;s =\r\nnot \njust a back thing for me. Anyway! &lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3DAria=\r\nl size=3D2&gt;The post about falling out of bed and then still \nseeing you bod=\r\ny reminded me of an interesting OBE I had experienced. I was \nliving in my =\r\nfirst house with my husband. My oldest was about 6 and my middle \nson was a=\r\n baby. I fell asleep with the baby next to me, but I was sleeping in a \nwei=\r\nrd position. I was locked in the sleep paralysis but decided to concentrate=\r\n \non my third eye. I was out! Floating about the room then. There were colo=\r\nrs \nswirling of all kinds. It was very pretty. Then I walked into my bedroo=\r\nm and I \nhad a huge dresser mirror. I could not see myself. That was one of=\r\n the things I \nactually feared, was looking into a mirror. I didn&#39;t want to=\r\n see anyone else!! I \nwas very aware that I was OBE. I decided to look at t=\r\nhe time to see when I would \ngo back. I was going to explore more, but I go=\r\nt scared and then was sucked back \ninto my body. I had a hard time fully aw=\r\nakening though. I was in sleep paralysis \nstill and I kept lifting my arm t=\r\no see if I was out of it yet or not LOL! If I \ncouldn&#39;t see my physical arm=\r\n lift,&nbsp;I knew I was still in. It took a bit. \nThe one thing I found I =\r\nwas disappointed with was I didn&#39;t remember the time I \nsaw. I know I looke=\r\nd and I know I saw it, but I couldn&#39;t remember it. I don&#39;t \nthink I was in =\r\nthat long.&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV=\r\n&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;A more recent experience that I&#39;ve had a=\r\nnd maybe \nsomeone can enlighten me on. I don&#39;t know if I was OBE or not. I&#39;=\r\nve had it \nhappen more than once, but I&#39;ve also been awake, it&#39;s been durin=\r\ng the day, etc. \nBasically I look at my watch and I see the time. I look at=\r\n my watch again and \nit&#39;s a time that is earlier than I saw. I saw a time t=\r\nhat was in the future \nbasically. I have a schedule that I follow and while=\r\n it&#39;s not real strict, I \nhave to pick up the kids from school, etc. I alwa=\r\nys wear a watch and I watch the \ntime. This happens more frequently and I&#39;m=\r\n trying to determine why. Nothing \nspecial happens at the time that I &quot;thou=\r\nght&quot; it was. I had one that the date was \nwrong! I knew it was wrong, yet t=\r\nhe date displayed 9/23 in the beginning of \nSeptember more than once. Nothi=\r\nng happened (at least to me) on that day. Anyone \nhave this time &quot;issues&quot; (=\r\nfor lack of a better term) happening too?&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3DAr=\r\nial size=3D2&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;Heather&lt;/=\r\nFONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT=\r\n face=3DArial size=3D2&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=3D2=\r\n&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;BLOCKQUOTE \nstyle=3D&quot;PADDING-RIGHT: 0px; PADDING-LEFT=\r\n: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #000000 2px solid; MARGIN-RIGHT: 0px&quot;=\r\n&gt;\n  &lt;DIV style=3D&quot;FONT: 10pt arial&quot;&gt;&lt;BR&gt;&nbsp;&lt;/DIV&gt;\n  &lt;DIV id=3Dygrp-text&gt;=\r\n\n  &lt;BLOCKQUOTE class=3Dreplbq style=3D&quot;BORDER-LEFT: #1010ff 2px solid&quot;&gt;\n   =\r\n &lt;DIV id=3Dygrp-text&gt;\n    &lt;DIV&gt;&lt;FONT \n  face=3DArial&gt;&lt;/FONT&gt;&lt;!-- |**|end eg=\r\np html banner|**| --&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;!-- ygrp-msg --&gt;=\r\n&lt;!-- Sponsor --&gt;\n  &lt;DIV style=3D&quot;CLEAR: both; FONT-SIZE: 1px; COLOR: #fff&quot;&gt;=\r\n.&lt;/DIV&gt;&lt;/DIV&gt;&lt;IMG \n  height=3D1 \n  src=3D&quot;http://geo.yahoo.com/serv?s=3D973=\r\n59714/grpId=3D18063865/grpspId=3D1705082731/msgId=3D2350/stime=3D1191127056=\r\n/nc1=3D4725792/nc2=3D4836045/nc3=3D4763760&quot; \n  width=3D1&gt; &lt;BR&gt;&lt;SPAN style=\r\n=3D&quot;COLOR: white&quot;&gt;&lt;/SPAN&gt; &lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;/BODY&gt;&lt;/HTML=\r\n&gt;\n\r\n------=_NextPart_000_0038_01C802FC.A4D8B9A0--"}