{"id": "2387", "subject": "Re: Wi-Fi?", "author": "wgungfu", "timestamp": "2007-10-10T04:03:46Z", "full_text": "I talked to Frank about an idea in a similar vein a while ago.  It&#39;d\nbe simpler just to get a radio card for a pc (there are some with both\nam and fm) and use that instead of trying to hack Wi-Fi.  You could\nalso reproduce the same electronics logic as software.\n\n\nMarty\n\n--- In EVP-ITC@yahoogroups.com, &quot;babiarz3&quot; &lt;babiarz3@...&gt; wrote:\n&gt;\n&gt; How would the wi-fi antennae work as compared to the current antennae?\n&gt; Better or worse do you think? I guess I was thinking more along the\n&gt; lines of recording directly into Adobe rather than broadcasting on the\n&gt; web.\n&gt; \n&gt; Babs\n&gt; www.thepsinetwork.com \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@&gt; wrote:\n&gt; &gt;\n&gt; &gt; \n&gt; &gt;  Yeah, there was some discussion and work toward boradcasting live\n&gt; streaming audio from the box onto the web, but all involved got kinda\n&gt; sidetracked with other projects, but it hasn&#39;t been forgotten. \n&gt; &gt;  \n&gt; &gt;  The box is basically a swept radio tuner. Someone good at\n&gt; programming could create a program to tune a radio on a plug in card,\n&gt; making it sweep the tuning. You could do the same thing with a TV\n&gt; tuenr on a computer card and get video images, as I&#39;ve done with my\n&gt; analog system.\n&gt; &gt;  \n&gt; &gt;  BTW, there is already a program which was the inspiration of the\n&gt; boxes, it&#39;s called EVPmaker, and it&#39;s freeware. \n&gt; &gt;  \n&gt; &gt;  Frank-S\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; To: EVP-ITC@: babiarz3@: Mon, 8 Oct 2007 20:33:39\n&gt; +0000Subject: [EVP-ITC] Wi-Fi?\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; Hey folks, been reading for a long time and am finally posting. I\n&gt; havea question in regards to a dream a friend had...The dream was\n&gt; vague but in it a woman in her low to mid 30&#39;s istalking about her\n&gt; father who has figured out a way to run Frank&#39;s Boxthrough a laptop.\n&gt; End of dream. When the dream was relayed to me, mygut response was\n&gt; &quot;Oh! They are using the wi-fi antennae&quot;. Now, don&#39;tget me wrong. I&#39;m\n&gt; about as technical as a shoe string but the dreamcame across as a\n&gt; strong message. Is this even possible? The only real &quot;visual&quot; of the\n&gt; dream was as the voices are comingthrough, they are showing up on the\n&gt; laptop as well... as if AdobeAudition or some other sound editing\n&gt; program is being used inconjunction.  \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; _________________________________________________________________\n&gt; &gt; Boo! Scare away worms, viruses and so much more! Try Windows Live\n&gt; OneCare!\n&gt; &gt;\n&gt;\nhttp://onecare.live.com/standard/en-us/purchase/trial.aspx?s_cid=wl_hotmailnews\n&gt; &gt;\n&gt;"}