{"id": "2402", "subject": "Re: [EVP-ITC] So is this proof-ative?", "author": "Lisby", "timestamp": "2007-10-10T20:43:09Z", "full_text": "I hear &quot;set to break.&quot; I don&#39;t know if changes the meaning in any  \nway, but there it is...\n\nI think that if the vet tries and fails, then &quot;freeing&quot; is an option,  \nbut I wouldn&#39;t follow that voice&#39;s advice without having made an  \nattempt to do the correct thing, from a human perspective.\n\nAnn\n\nOn Oct 10, 2007, at 4:14 PM, Frank Sumption wrote:\n\n&gt;  When you get a voice that talks about a specific situation, does  \n&gt; that prove something is talking that is not a broadcast fragment?  \n&gt; We do have a dog with a broken leg, so it would seem outrageous to  \n&gt; suggest the comment received about a dog and a break would be just  \n&gt; a stray broadcast. I hate to have an animal suffer, but what a  \n&gt; piece of evidence! This is what I mean  by judging content and  \n&gt; context.\n&gt;\n&gt;  I don&#39;t ask questions, I did not ask about the dog. I was only  \n&gt; testing the #24 box, and announced, as usuall, that I was doing an  \n&gt; EVP recording to test the box.\n&gt;\n&gt;  Frank-S\n&gt;\n&gt;\n&gt;\n&gt; Boo! Scare away worms, viruses and so much more! Try Windows Live  \n&gt; OneCare! Try now!\n&gt;\n&gt; \n&gt; &lt;FreeThatDog-CanNotSetTheBreak(100907).mp3&gt;\n&gt; &lt;FreeThatDog-CanNotSetTheBreak(100907)-slower.mp3&gt;\n\n\nI hea \"se o b eak.\" I don' know i changes he meaning in any way, bu he e i is...I hink ha i he e ies and ails, hen \" eeing\" is an op ion, bu I wouldn' ollow ha oice's ad ice wi hou ha ing made an a emp o do he co ec hing, om a human pe spec i e.AnnOn Oc 10, 2007, a 4:14 PM, F ank Sump ion w o e:  When you ge a oice ha alks abou a speci ic si ua ion, does ha p o e some hing is alking ha is no a b oadcas agmen ? We do ha e a dog wi h a b oken leg, so i would seem ou ageous o sugges he commen ecei ed abou a dog and a b eak would be jus a s ay b oadcas . I ha e o ha e an animal su e , bu wha a piece o e idence! This is wha I mean  by judging con en and con ex .   I don' ask ques ions, I did no ask abou he dog. I was only es ing  he #24 box, and announced, as usuall, ha  I was doing an EVP eco ding o es he box.   F ank-SBoo! Sca e away wo ms, i uses and so much mo e! T y Windows Li e OneCa e! T y now!"}