{"id": "2410", "subject": "Re: A new gadget?", "author": "psi_research", "timestamp": "2007-10-11T02:54:52Z", "full_text": "Frank, good point you&#39;re making that Persinger&#39;s research is confined\nto the how the brain reacts when there is substantial evidence to\nsupport that notion that thought itself may occur outside of the brain\nin a yet undefined space.\n\n Some believe the brain is a tuner to access memory and intuition that\nexist outside of the body. Of course it also acts as the switchboard\nfor the body&#39;s central nervous system but it is the non-local thought\nconcept that I find intriguing. Perhaps the &quot;tuner&quot; in a psychics\nbrain is not restricted to just their own memories but can access the\nmemories and feelings of the people the psychic targets.\n\n-Bill\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@...&gt; wrote:\n&gt;\n&gt; \n&gt; &quot;What We Have Found\n&gt; We have found moderately strong correlations between the amount of\ndaily global geomagnetic activity and the occurrence of epileptic\nseizures, aggression, immunological responses, and ambulatory\nbehaviour. Even the propensity to report experiences about death and\ncrisis of others is associated with quiet periods of geomagnetic\nactivity. Certain increments of activity, which are likely to reflect\ndifferent &quot;complex patterns&quot;, have been implicated in the occurrence\nof Sudden Infant Death and electrical cardiac anomalies resulting in\ndeath in subpopulations of adults. A correlation between two variables\ndoes not necessarily mean causation. Consequently we have imitated\nspecific geomagnetic patterns by the special application of a computer\ntechnology. When we simulated these natural conditions in the\nlaboratory by applying experimentally generated magnetic fields within\nthe 50 nT range seizures in epileptic rats were elicited with the same\nincidence and latency as those associated with increases in natural\ngeomagnetic activity.\n&gt;  \n&gt;                                                    AND\n&gt;  \n&gt;  \n&gt; What we have learned\n&gt; We have found consciousness can be described as an emergent property\nof the complex electromagnetic process generated from predictable\nbiochemical and biological processes. Although the terms soul and mind\nmay have been useful at one time to describe this process, they are no\nlonger required. They are more like the term &quot;phlogiston&quot; that was\nemployed to describe why things burned before modern chemistry\nemerged. When there is no electrical current moving through the parts\nof a television, there is no picture. When the specific\nelectromagnetic patterns are not generated within the brain structures\nthere is no consciousness or awareness. \n&gt; Some individuals with very different brain structures show different\nelectromagnetic correlates that are associated with their ability to\ndiscern stimuli others cannot detect. Counter clockwise rotation of\nweak magnetic fields around the skull at specific rates of change\n(derivatives) can affect subjective time and allow the average person\nto experience many of the altered states reported by practitioners of\nmystical traditions as well as &quot;paranormal&quot; phenomena. The critical\nvariables, like any chemical reaction, are the complexity and\nspecificity of the temporal parameters. One component of consciousness\nmay be &quot;sequestered&quot; within second or third derivatives of very narrow\nbands of changes in frequency within the theta range. Our calculations\nof resonance, based upon the power changes within quantitative\nelectroencephalographic measures, suggest that one electromagnetic\nsource of consciousness may actually exist within the 10 cm region\noutside of and surrounding the cranium.&quot;\n&gt;  \n&gt;  \n&gt;  It seems to me this guy attemptes to explain everything in terms of\nbrain alone, interesting, but to easy for the skeptic to grab this as\nan explanation for everything.  So where are these magnetic fields\nwhen one meditates unassisted, or has an out of body\nexpereience-unassisteted.  I mean without using meditation gogles, or\nsounds. What about when you see objects behind you, out of your field\nof vision, what about seeing through solid objects in a normal waking\nstate conciosuness? Persinger&#39;s articles seem interesting, but I think\nit&#39;s just another attempt to fit every expereience into a neat little\nbox.  I just wanted say I don&#39;t think the magnietic influance explains\neverything, but it&#39;s still interesting in that the part about global\ngeomagnetic influance caught my attention. Like what if that affects\nthe boxes as well? There seems to be areas in my basement where the\nbox doesn&#39;t work. I&#39;ll have to make sure I have all the bugs, and\nmalfunctions fixed, then do some more testing. Wonder how it works in\nfault(quake) zones?\n&gt;  \n&gt; I guess the magnetic fields could be weak, and in continuous flux\nall over the planet. Mostly this is thinking with my fingers (thinking\nout load).\n&gt;  \n&gt;  Frank-S\n&gt; To: EVP-ITC@...: vilhellm@...: Wed, 10 Oct 2007 05:42:24\n+0000Subject: [EVP-ITC] Re: A new gadget?\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Here are links to research referred to in my original post.\nAlso,check the book I mentioned for the alternative suggestion that\nemffield exposure can induce actual psychic experiences as opposed to\naperceived experience, not an actual one.Both links are to researchers\nthat have worked together in the\npast.-Billhttp://web.ionsys.com/~remedy/Persinger,%20Michael.htmhttp://www.shaktitechnology.com/---\nIn EVP-ITC@yahoogroups.com, Frank Ratka &lt;warrior18eii@&gt; wrote:&gt;&gt;\n&quot;Studies suggest and controlled experiments verify that\nconsistantexposure in excess of 7 milligause can result in the\nprecieved feelingof being watched or a presense by an unseen force.\nPeople sometimesfeel it&#39;s an invisible intelligence but really it&#39;s\nthe brainsresponse to the synapse activity. People sometimes interpret\nstimuliin a way that is familiar, in the case of high emf exposure we\nthinkit may be a spirit in the room.&quot;&gt; &gt; Hi Bill,&gt; &gt; Can you give me a\nreference to these studies I would be veryinterested in reading them?\nI have always heard and read articlessuggesting that low compression\n(ELF/VLF) waves in the 5Hz to 40Hzrange caused physiological responses\nand not the magnetic fields.These frequencies resonate and produce\nsecondary harmonics that cancause changes in behavior as well. Such as\naggression, euphoria,jumpiness, depression and so on. &gt; &gt; There is an\naltered state of consciousness that will give a personthe feeling of\ninvisible presences and a heightened sense of paranoia,its called the\nHypnogogic state and it is usually associated withsleep paralysis or\nthe &quot;old hag syndrome&quot;. It can be reached from apoint of total\nrelaxation or a type of trance state.&gt; &gt; Please let me know if you can\nfind those articles, I really aminterested in reading them.&gt; &gt;\nRegards,&gt; &gt; Frank R.&gt; &gt; ----- Original Message ----&gt; From:\npsi_research &lt;vilhellm@&gt;&gt; To: EVP-ITC@yahoogroups.com&gt; Sent: Friday,\nSeptember 28, 2007 12:11:51 PM&gt; Subject: [EVP-ITC] Re: A new gadget?&gt;\n&gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; We&#39;ve been using the K II for about a year\nand a halfand they&#39;re ok as a low cost emf &gt; &gt; detector. Moving any\nemf meter too fast will likely result in falsepositives but a slow pan\n&gt; &gt; across a wall to look for electrical ground leaks will\nincreasereliabilty. We look for emf &gt; &gt; fields in excess of 7\nmilligause, the K II can detect of to 20milligause. Studies suggest\nand &gt; &gt; controlled experiments verify that consistant exposure in\nexcess of7 milligause can result &gt; &gt; in the precieved feeling of being\nwatched or a presense by an unseenforce. People &gt; &gt; sometimes feel\nit&#39;s an invisible intelligence but really it&#39;s thebrains response to\nthe &gt; &gt; synapse activity. People sometimes interpret stimuli in a way\nthatis familiar, in the case &gt; &gt; of high emf exposure we think it may\nbe a spirit in the room. &gt; &gt; &gt; &gt; But that&#39;s not to say the location\ncan&#39;t be haunted as well. It&#39;sjust that if a particular room &gt; &gt; has a\nlot of reported paranormal activity and there is a high emffield then\nyou may want &gt; &gt; to consider that fact in your evaluation of the\nlocation.Interesting, there is alternate &gt; &gt; research that suggest\nthat exposure to substantial emf fields andthe resulting increase in &gt;\n&gt; nerve ends firing in the brain that genuine psychic abilities\narepossible. This was referred &gt; &gt; to in the book Spook by Mary\nRoach.&gt; &gt; &gt; &gt; Any device can be repurposed as a communication tool\nincluding the KII. While some &gt; &gt; users believe that the involutary\nmuscle twitches that occur whileholding down the switch &gt; &gt; is sort of\nlike what happens when holding a pendulum, others preferto have a\nselectable &gt; &gt; on / off switch on their K II. The manufacturer has\nstarted offeringthat option according &gt; &gt; to some of the local groups\nthat have been selling the modifiedversions on eBay.&gt; &gt; &gt; &gt; -Bill&gt; &gt; &gt;\n&gt; --- In EVP-ITC@yahoogroups .com, Lynn burton &lt;sunplex_chef@ ...&gt;\nwrote:&gt; &gt; &gt;&gt; &gt; &gt; Good morning all,&gt; &gt; &gt; &gt; &gt; &gt; I have used this meter\nwith great success as well as withgreat dismay. I have had &gt; &gt; the\nmeter &quot;pennied down&quot; sitting on a table top, and have a toy inanother\nroom respond &gt; &gt; to me without any activity on the meter. I feel it is\nthe spirit&#39;schoice and in which manner &gt; &gt; it feels more comfortable\nin communicating with you. I have hadlights turn off and back &gt; &gt; on\nagain in succession in response to questions and no activity onthe\nmeter, and then I &gt; &gt; have had no other responses except the meter, so\nonce again it isentirely up to the entity &gt; &gt; and how it wishes to\nrespond. In regards to the new apartmentbuilding, check the history &gt;\n&gt; of the land that it sits on. In a few of my occasions it has beenthe\nenergy tied to the land &gt; &gt; or former land owners that has caused the\nactivity. I have done aninvestigation in a &quot;new &gt; &gt; construction&quot; home\nsite that the family had not moved into yet andthe activity was on the\n&gt; &gt; increase, the new owners bought this piece of property as a\nwoodedlot with&gt; &gt; &gt; no prior establishment being on site, to anyones\nknowledge thatis. To all of our &gt; &gt; surprise, land records had nothing\navailable for that property otherthan the location and &gt; &gt; the\npertinent info, however further research and many phone callslater it\nwas discovered &gt; &gt; that the property sat on the edge of a local Indian\ntribalsettlement from the 1700&#39;s &gt; &gt; (thanks to the Dept. of the\nInterior and the Bureau of NativeAmerican (Indian) Affairs. It &gt; &gt;\njust goes to show you that persistence and continued research paysoff\nin the long run &gt; &gt; ( this one took about 4 months to research). So\nTravis just keepchecking and get all you &gt; &gt; can on the property from\nas far back as you can, you never know whatyou might fond out.&gt; &gt; &gt; &gt;\n&gt; &gt; Lynn Burton&gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; &lt;!--&gt; &gt; #ygrp-mlmsg\n{font-size:13px;font-family:arial, helvetica, clean,sans-serif;}&gt;\n#ygrp-mlmsg table {font-size:inherit;font:100%;}&gt; #ygrp-mlmsg select,\ninput, textarea {font:99% arial, helvetica,clean, sans-serif;}&gt;\n#ygrp-mlmsg pre, code {font:115% monospace;}&gt; #ygrp-mlmsg *\n{line-height:1.22em;}&gt; #ygrp-text{&gt; font-family:Georgia;&gt; }&gt;\n#ygrp-text p{&gt; margin:0 0 1em 0;}&gt; #ygrp-tpmsgs{&gt; font-family:Arial;&gt;\nclear:both;}&gt; #ygrp-vitnav{&gt;\npadding-top:10px;font-family:Verdana;font-size:77%;margin:0;}&gt;\n#ygrp-vitnav a{&gt; padding:0 1px;}&gt; #ygrp-actbar{&gt;\nclear:both;margin:25px0;white-space:nowrap;color:#666;text-align:right;}&gt;\n#ygrp-actbar .left{&gt; float:left;white-space:nowrap;}&gt;\n.bld{font-weight:bold;}&gt; #ygrp-grft{&gt;\nfont-family:Verdana;font-size:77%;padding:15px 0;}&gt; #ygrp-ft{&gt;\nfont-family:verdana;font-size:77%;border-top:1px solid #666;&gt;\npadding:5px 0;&gt; }&gt; #ygrp-mlmsg #logo{&gt; padding-bottom:10px;}&gt; &gt;\n#ygrp-vital{&gt; background-color:#e0ecee;margin-bottom:20px;padding:2px\n0 8px 8px;}&gt; #ygrp-vital\n#vithd{&gt;font-size:77%;font-family:Verdana;font-weight:bold;color:#333;text-transform:uppercase;}&gt;\n#ygrp-vital ul{&gt; padding:0;margin:2px 0;}&gt; #ygrp-vital ul li{&gt;\nlist-style-type:none;clear:both;border:1px solid #e0ecee;&gt; }&gt;\n#ygrp-vital ul li\n.ct{&gt;font-weight:bold;color:#ff7900;float:right;width:2em;text-align:right;padding-right:.5em;}&gt;\n#ygrp-vital ul li .cat{&gt; font-weight:bold;}&gt; #ygrp-vital a {&gt;\ntext-decoration:none;}&gt; &gt; #ygrp-vital a:hover{&gt;\ntext-decoration:underline;}&gt; &gt; #ygrp-sponsor #hd{&gt;\ncolor:#999;font-size:77%;}&gt; #ygrp-sponsor #ov{&gt; padding:6px\n13px;background-color:#e0ecee;margin-bottom:20px;}&gt; #ygrp-sponsor #ov\nul{&gt; padding:0 0 0 8px;margin:0;}&gt; #ygrp-sponsor #ov li{&gt;\nlist-style-type:square;padding:6px 0;font-size:77%;}&gt; #ygrp-sponsor\n#ov li a{&gt; text-decoration:none;font-size:130%;}&gt; #ygrp-sponsor #nc {&gt;\nbackground-color:#eee;margin-bottom:20px;padding:0 8px;}&gt;\n#ygrp-sponsor .ad{&gt; padding:8px 0;}&gt; #ygrp-sponsor .ad\n#hd1{&gt;font-family:Arial;font-weight:bold;color:#628c2a;font-size:100%;line-height:122%;}&gt;\n#ygrp-sponsor .ad a{&gt; text-decoration:none;}&gt; #ygrp-sponsor .ad\na:hover{&gt; text-decoration:underline;}&gt; #ygrp-sponsor .ad p{&gt;\nmargin:0;}&gt; o {font-size:0;}&gt; .MsoNormal {&gt; margin:0 0 0 0;}&gt;\n#ygrp-text tt{&gt; font-size:120%;}&gt; blockquote{margin:0 0 0 4px;}&gt;\n.replbq {margin:4;}&gt; --&gt;&gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt;\n__________________________________________________________&gt; Tonight&#39;s\ntop picks. What will you watch tonight? Preview thehottest shows on\nYahoo! TV.&gt; http://tv.yahoo.com/&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Climb to the top of the charts!  Play Star Shuffle:  the word\nscramble challenge with star power.\n&gt;\nhttp://club.live.com/star_shuffle.aspx?icid=starshuffle_wlmailtextlink_oct\n&gt;"}