{"id": "2436", "subject": "Re: Spur of the monet session", "author": "Steve Hultay", "timestamp": "2007-10-12T22:56:23Z", "full_text": "Yeah, anybody can buy a radio but if you don&#39;t know what your \nlistening for it causes a problem.  I&#39;m not sure of a certain # of \npeople, but i do not believe everyone can make out the voices.  I \nalso think that some files i get that are so clear and nobody else \nhears proves that it was meant for only me.  I&#39;ve accepted that now, \nbut i feel if you can understand the messages---you have a gift and \nshould use it.\n\n-Steve H.\n\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@...&gt; \nwrote:\n&gt;\n&gt; \n&gt; Thanks. This is without a box, so if interested parties would like \nto try this just send check to......JUST KIDDING! The point is you \ndon&#39;t need anything special, the technology just doesn&#39;t matter--\nother than a radio of somekind-- they use what you use! All I do is \nautomate the process. If my phone hadn&#39;t died I would have sent a \npix of the boom box. It&#39;s just a mini boom box cassette/AM/FM radio. \nProbably cost 20 bucks brand new, a GPX brand, &quot;Grand Prix Home and \nGo music system with stereo cassette recorder and bass boost&quot;. I did \nthe session at work, it shows you can do it anywhere. The dial isn&#39;t \neven a single turn dial, it takes multiple twists (revolutions) to \nscan the entire band, or one could wobble between a few stations. \n&gt;  \n&gt;  Frank-S\n&gt;  \n&gt;  \n&gt;  \n&gt;  \n&gt; \n&gt; \n&gt; To: evp-itc@...: paranormalinvestigating@...: Fri, 12 Oct 2007 \n13:43:02 -0400Subject: RE: [EVP-ITC] Spur of the monet session\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Frank, I hear both the way you hear them the &quot;doesn&#39;t bother \nfield &quot; is clear as a bell.I think the new boxes you are making are \nmore along the lines of that type of clarityas apposed to the older \nboxes that generate a lot of white noise. Every day we get a step \ncloser. Bruce\n&gt; \n&gt; Bruce Halliday Paranormal Investigating Team \n&gt; \n&gt; \n&gt; To: evp-itc@...: franks-boxes@...: Fri, 12 Oct 2007 10:39:53 -\n0600Subject: RE: [EVP-ITC] Spur of the monet session\n&gt; \n&gt; \n&gt; Yeah, it probably just depends on conditions. #3 was kinda iffy, \nand made out of noise. Here&#39;s another. I just now went out to Field \nElemenary to check a locate request. A locate request is to notify \nus that someone is digging somewhere in Littleton, and I have to \nverify that it will not hit any of our burried fiber. This was far \nenough away to not &quot;bother&quot; Field&#39;s fiber. Mostly I like to put \nthese up cuz it shows you need nothing but simple equipment, just an \nAM radio, and I used the built in recorder, so not even recording \nfrom the speaker! It&#39;s so friggin&#39; close to proof, but just can&#39;t \nquite get it there! Frustrates me to no end.  Frank-S\n&gt; \n&gt; \n&gt; To: evp-itc@...: paranormalinvestigating@...: Fri, 12 Oct 2007 \n12:10:17 -0400Subject: RE: [EVP-ITC] Spur of the monet session\n&gt; \n&gt; \n&gt; Frank, I hear 1, 2 and 4 as you do very clearly but can&#39;t make out \nmore than &#39;want&#39;in #3. I had really good sucess with the manual \nsweeps also if you remember the posts. Bruce\n&gt; \n&gt; Bruce Halliday Paranormal Investigating Team \n&gt; \n&gt; \n&gt; To: evp-itc@...: franks-boxes@...: Fri, 12 Oct 2007 09:57:22 -\n0600Subject: [EVP-ITC] Spur of the monet session\n&gt; \n&gt; \n&gt; I was checking out a little boom box here, and decided to do a \nquickie session using manual sweep of the AM band. This is at work\n(don&#39;t tell the boss!).  The one about the male dog might refer to \nthe mate to this female poodle we have now. For those unfamilar, our \ndaughter in-law knows someone that rescues dogs, and she was tryuing \nto get rid of some of her too many animals. The daughter in-law at \nfirst gave us the male poodle a few weeks ago, but he was deaf, \nblind, and someone, probably the puppy mill he came from, pulled all \nhis teeth. He was too much to deal with, he fell down our stairs \ntwice, and we felt he was suffereing too much, so we took him to the \nDumb Friends League. Now we have his mate, but she has most of her \nteeth, and can hear, see and is a little sweetie. #4 is hopefully \naccurate.   Frank-S\n&gt; \n&gt; Help yourself to FREE treats served up daily at the Messenger \nCaf. Stop by today! \n&gt; \n&gt; Windows Live Hotmail and Microsoft Office Outlook  together at \nlast. Get it now! \n&gt; \n&gt; Peek-a-boo FREE Tricks Treats for You! Get &#39;em! \n&gt; \n&gt; Climb to the top of the charts!  Play Star Shuffle:  the word \nscramble challenge with star power. Play Now! \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Help yourself to FREE treats served up daily at the Messenger \nCaf. Stop by today.\n&gt; http://www.cafemessenger.com/info/info_sweetstuff2.html?\nocid=TXT_TAGLM_OctWLtagline\n&gt;"}