{"id": "2437", "subject": "Re: [EVP-ITC] So is this proof-active?", "author": "Lisby", "timestamp": "2007-10-12T22:33:15Z", "full_text": "I will, too!\n\nOn Oct 11, 2007, at 9:24 PM, Laura Kimberley wrote:\n\n&gt;\n&gt; I agree I can do that also!!\n&gt;\n&gt; Laura\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; From: EVP-ITC@yahoogroups.com [mailto:EVP-ITC@yahoogroups.com] On  \n&gt; Behalf Of Joanne Tauferner\n&gt; Sent: Thursday, October 11, 2007 3:50 PM\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Subject: RE: [EVP-ITC] So is this proof-ative?\n&gt;\n&gt;\n&gt;\n&gt; How much will it cost to fix your little dog?  Certainly we all can  \n&gt; kick in a few bucks to help you; you&#39;ve been more than generous  \n&gt; with your sharing of your research  and  boxes.  Give us a figure  \n&gt; and maybe some of us will help  Princess.\n&gt;\n&gt; Joanne :^)\n&gt;\n&gt; Frank Sumption &lt;franks-boxes@...&gt; wrote:\n&gt;\n&gt;\n&gt;  It&#39;s not a question of whether or not the break can be set, the  \n&gt; question is &quot;How much money do you have?&quot; At this moment--I hate  \n&gt; this place, and humanity sucks!\n&gt;\n&gt;  Frank\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; From: bulletbabea@...\n&gt; Date: Wed, 10 Oct 2007 17:46:56 -0700\n&gt; Subject: Re: [EVP-ITC] So is this proof-ative?\n&gt;\n&gt; A trip to the vet will answer that question, usually most breaks  \n&gt; can be set unless there is another underlying problem. It is a cute  \n&gt; lil dog, sometimes they are very fragile bone structures because of  \n&gt; breeding. There are a few small dogs that seem to have alot of  \n&gt; problems with bad backs and breaking legs/feet.\n&gt;\n&gt;\n&gt;\n&gt; I think its proof to those who want it, and as for me...nobody is  \n&gt; talking about me on the radio, or using my full name...so it  \n&gt; definitely gets my attention when my name is being used in context  \n&gt; with things that are going on around me or happening to people I know.\n&gt;\n&gt;\n&gt;\n&gt; I dont need any proof, they just give it freely so I can share or  \n&gt; in some cases not share with everyone.\n&gt;\n&gt;\n&gt;\n&gt; I stopped lookin for proof right about the time this all started.  \n&gt; My first evp was all that I needed to get me on this path. My  \n&gt; mothers voice, so long after shes been passed, friends, relatives,  \n&gt; or even perfect strangers who I had no clue about until I found out  \n&gt; after the fact....way too many proofs have been freely given to me,  \n&gt; and I never asked for one. Earl and Bob Cox, I think thats one of  \n&gt; my favorite WOW moments, not knowing about Erland Babcock it was an  \n&gt; easy misunderstanding. Luckily I make everything phonetic so it was  \n&gt; easy to catch later. I have listened to others evp from him since  \n&gt; then and I often STILL hear earl and bob cox. They have also given  \n&gt; me names of workers on this side who I have bumped into later tho I  \n&gt; usually put off contacting anyone they mention until I think the  \n&gt; time is right. Usually it is just weird to find out its a REAL LIVE  \n&gt; person and that they just happen to be in the EVP/ITC field.\n&gt;\n&gt;\n&gt;\n&gt; I used to always assume when they say a name they are talking about  \n&gt; spirits there. Or that if I get an ITC image its a spirit face.  \n&gt; They proved thats a wrong assumption on several occasions. Probably  \n&gt; the only time I ever asked for anything was while doing an itc  \n&gt; session, after so many faces I just wanted them to show me  \n&gt; something else, anything else, &quot;show me something different&quot; led to  \n&gt; a few portraits of the living.\n&gt;\n&gt;\n&gt;\n&gt; Sometimes they speak the truth, sometimes a wayward thought creeps  \n&gt; threw that shouldnt (or just a creep)... as for the dog...take it  \n&gt; to the vet and see what they can do then you will know more.\n&gt;\n&gt;\n&gt;\n&gt; Misty\n&gt; Frank Sumption &lt;franks-boxes@...&gt; wrote:\n&gt;\n&gt;  When you get a voice that talks about a specific situation, does  \n&gt; that prove something is talking that is not a broadcast fragment?  \n&gt; We do have a dog with a broken leg, so it would seem outrageous to  \n&gt; suggest the comment received about a dog and a break would be just  \n&gt; a stray broadcast. I hate to have an animal suffer, but what a  \n&gt; piece of evidence! This is what I mean  by judging content and  \n&gt; context.\n&gt;\n&gt;  I don&#39;t ask questions, I did not ask about the dog. I was only  \n&gt; testing the #24 box, and announced, as usuall, that I was doing an  \n&gt; EVP recording to test the box.\n&gt;\n&gt;  Frank-S\n&gt;\n&gt;\n&gt; Boo! Scare away worms, viruses and so much more! Try Windows Live  \n&gt; OneCare!Try now!\n&gt;\n&gt;\n&gt;\n&gt; Tonight&#39;s top picks. What will you watch tonight? Preview the  \n&gt; hottest shows on Yahoo! TV.\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Boo! Scare away worms, viruses and so much more! Try Windows Live  \n&gt; OneCare! Try now!\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Pinpoint customers who are looking for what you sell.\n&gt;\n&gt;\n&gt;\n&gt; \n\n\nI will, oo!On Oc 11, 2007, a 9:24 PM, Lau a Kimbe ley w o e:I ag ee I can do ha also!!Lau a  F om: EVP-ITC@yahoog oups.com [mail o:EVP-ITC@yahoog oups.com] On Behal O Joanne Tau e ne Sen : Thu sday, Oc obe 11, 2007 3:50 PMTo: EVP-ITC@yahoog oups.comSubjec : RE: [EVP-ITC] So is his p oo -a i e? How much will i cos o ix you li le dog?  Ce ainly we all can kick in a ew bucks o help you; you' e been mo e han gene ous wi h you sha ing o you esea ch  and  boxes.  Gi e us a igu e and maybe some o us will help  P incess.Joanne :^) F ank Sump ion ho mail.com> w o e: I 's no a ques ion o whe he o no he b eak can be se , he ques ion is \"How much money do you ha e?\" A his momen --I ha e his place, and humani y sucks!  F ankTo: EVP-ITC@yahoog oups.comF om: bulle babea@yahoo.comDa e: Wed, 10 Oc 2007 17:46:56 -0700Subjec : Re: [EVP-ITC] So is his p oo -a i e?A  ip o he e will answe ha ques ion, usually mos b eaks can be se unless he e is ano he unde lying p oblem. I is a cu e lil dog, some imes hey a e e y agile bone s uc u es because o b eeding. The e a e a ew small dogs ha seem o ha e alo o p oblems wi h bad backs and b eaking legs/ ee . I hink i s p oo o hose who wan i , and as o me...nobody is alking abou me on he adio, o using my ull name...so i de ini ely ge s my a en ion when my name is being used in con ex wi h hings ha a e going on a ound me o happening o people I know. I don need any p oo , hey jus gi e i eely so I can sha e o in some cases no sha e wi h e e yone. I s opped lookin o p oo igh abou he ime his all s a ed. My i s e p was all ha I needed o ge me on his pa h. My mo he s oice, so long a e shes been passed, iends, ela i es, o e en pe ec s ange s who I had no clue abou un il I ound ou a e he ac ....way oo many p oo s ha e been eely gi en o me, and I ne e asked o one. Ea l and Bob Cox, I hink ha s one o my a o i e WOW momen s, no knowing abou E land Babcock i was an easy misunde s anding. Luckily I make e e y hing phone ic so i was easy o ca ch la e . I ha e lis ened o o he s e p om him since hen and I o en STILL hea ea l and bob cox. They ha e also gi en me names o wo ke s on his side who I ha e bumped in o la e ho I usually pu o con ac ing anyone hey men ion un il I hink he ime is igh . Usually i is jus wei d o ind ou i s a REAL LIVE pe son and ha hey jus happen o be in he EVP/ITC ield. I used o always assume when hey say a name hey a e alking abou spi i s he e. O ha i I ge an ITC image i s a spi i ace. They p o ed ha s a w ong assump ion on se e al occasions. P obably he only ime I e e asked o any hing was while doing an i c session, a e so many aces I jus wan ed hem o show me some hing else, any hing else, \"show me some hing di e en \" led o a ew po ai s o he li ing. Some imes hey speak he u h, some imes a waywa d hough c eeps h ew ha shouldn (o jus a c eep)... as o he dog... ake i o he e and see wha hey can do hen you will know mo e. Mis yF ank Sump ion ho mail.com> w o e: When you ge a oice ha alks abou a speci ic si ua ion, does ha p o e some hing is alking ha is no a b oadcas agmen ? We do ha e a dog wi h a b oken leg, so i would seem ou ageous o sugges he commen ecei ed abou a dog and a b eak would be jus a s ay b oadcas . I ha e o ha e an animal su e , bu wha a piece o e idence! This is wha I mean  by judging con en and con ex .   I don' ask ques ions, I did no ask abou he dog. I was only es ing  he #24 box, and announced, as usuall, ha  I was doing an EVP eco ding o es he box.   F ank-SBoo! Sca e away wo ms, i uses and so much mo e! T y Windows Li e OneCa e!T y now! Tonigh 's op picks. Wha will you wa ch onigh ? P e iew he ho es shows on Yahoo! TV.  Boo! Sca e away wo ms, i uses and so much mo e! T y Windows Li e OneCa e! T y now!  Pinpoin cus ome s who a e looking o wha you sell."}