{"id": "2537", "subject": "Re: Well that&#39;s friggin&#39; interesting--Moon on C2C!", "author": "Steve Hultay", "timestamp": "2007-10-20T23:39:36Z", "full_text": "And he doesn&#39;t send an e-mail back to friends and fellow researchers \neither.  If i had a couple hundred bucks to spare, i would get on \nthe phone and say hey.  We&#39;ve been friends, but maybe he is too busy \nto send e-mails anymore.  There are a lot of suckers out there and \nuntil recently frank...you were one of em&#39;.\n\n-Steve H.\n\np.s.  Bruce agrees !!!\n\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@...&gt; \nwrote:\n&gt;\n&gt; \n&gt;  We were supposedly working together to do a &quot;Scole&quot; like thing \nhere weekly starting last month, but that quickly bit the dust as \nMoon doesn&#39;t seem to understand weekly, nor consistencey, as the \nfirst voices requested. He also never said anything about being on \nC2C again, and &quot;Frank&#39;s Box&quot; will be  specifically discussed, as \nmentioned in the show promo on the C2C site. I think niether Moon, \nnor the C2C staff want facts to interfere with the discussions! I \nthink he can stick his &quot;Scole&quot; meetings, and any other scams up his -\n----, and may he get the spirit contacts he deserves!  \n&gt;  &quot;\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Sat 10.20 &gt;&gt;Paranormal investigator and editor of Haunted Times \nMagazine, Christopher Moon will discuss hauntings as well as his \nwork with Frank&#39;s Box, a device which summons the dead&quot;\n&gt;  \n&gt;  \n&gt;  Great, once again making public claims about a system he&#39;s never \npaid a dime for, makes untold amounts of money with, has no \nknowledge of how it works, and what it&#39;s really for....on and on! \nbetter hit send before I really get pissed!\n&gt;  \n&gt;  Frank-S\n&gt; \n&gt; \n&gt; To: EVP-ITC@...: lisby@...: Fri, 19 Oct 2007 18:21:30 -\n0400Subject: Re: [EVP-ITC] Well that&#39;s friggin&#39; interesting--Moon on \nC2C!\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Frank-- are you and he speaking or on the outs? I think I may have \nmissed a rapprochement between you this summer when I was off in the \nwilderness camping. \n&gt; \n&gt; Ann\n&gt; \n&gt;  \n&gt; \n&gt; On Oct 19, 2007, at 3:02 PM, Frank Sumption wrote:\n&gt; \n&gt; \n&gt; \n&gt; \n&gt;  Well, Moon&#39;s doing Coast To Coast again this weekend, this time \nwith Punet on Saturday--- never said a word to me--and I&#39;m \nsurprised!? or not.     Frank\n&gt; \n&gt; Peek-a-boo FREE Tricks Treats for You! Get &#39;em! \n&gt; \n&gt;  \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Help yourself to FREE treats served up daily at the Messenger \nCaf. Stop by today.\n&gt; http://www.cafemessenger.com/info/info_sweetstuff2.html?\nocid=TXT_TAGLM_OctWLtagline\n&gt;"}