{"id": "2551", "subject": "Re: [EVP-ITC] Well that&#39;s friggin&#39; interesting--Moon on C2C!", "author": "Lisby", "timestamp": "2007-10-21T23:10:51Z", "full_text": "Can I do a Scole thing with somebody? I&#39;ve got Skype-- Can I phone it  \nin from Western Maryland?\n\n;)  (But a smidge more than halfway serious)\n\nAnyway, I&#39;ll listen to the C2C show tomorrow and see how it went. Let  \nyou know what I think then.\n\nAnn\n\n\n\n\nOn Oct 20, 2007, at 7:29 PM, Frank Sumption wrote:\n\n&gt;\n&gt;  We were supposedly working together to do a &quot;Scole&quot; like thing  \n&gt; here weekly starting last month, but that quickly bit the dust as  \n&gt; Moon doesn&#39;t seem to understand weekly, nor consistencey, as the  \n&gt; first voices requested. He also never said anything about being on  \n&gt; C2C again, and &quot;Frank&#39;s Box&quot; will be  specifically discussed, as  \n&gt; mentioned in the show promo on the C2C site. I think niether Moon,  \n&gt; nor the C2C staff want facts to interfere with the discussions! I  \n&gt; think he can stick his &quot;Scole&quot; meetings, and any other scams up his  \n&gt; -----, and may he get the spirit contacts he deserves!\n&gt;  &quot;\n&gt;\n&gt;\n&gt; Sat 10.20 &gt;&gt;\n&gt; Paranormal investigator and editor of Haunted Times  \n&gt; Magazine,Christopher Moonwill discuss hauntings as well as his work  \n&gt; with Frank&#39;s Box, a device which summons the dead&quot;\n&gt;\n&gt;\n&gt;\n&gt;  Great, once again making public claims about a system he&#39;s never  \n&gt; paid a dime for, makes untold amounts of money with, has no  \n&gt; knowledge of how it works, and what it&#39;s really for....on and on!  \n&gt; better hit send before I really get pissed!\n&gt;\n&gt;  Frank-S\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; From: lisby@...\n&gt; Date: Fri, 19 Oct 2007 18:21:30 -0400\n&gt; Subject: Re: [EVP-ITC] Well that&#39;s friggin&#39; interesting--Moon on C2C!\n&gt;\n&gt; Frank-- are you and he speaking or on the outs? I think I may have  \n&gt; missed a rapprochement between you this summer when I was off in  \n&gt; the wilderness camping.\n&gt;\n&gt; Ann\n&gt;\n&gt;\n&gt; On Oct 19, 2007, at 3:02 PM, Frank Sumption wrote:\n&gt;\n&gt;  Well, Moon&#39;s doing Coast To Coast again this weekend, this time  \n&gt; with Punet on Saturday--- never said a word to me--and I&#39;m  \n&gt; surprised!? or not.\n&gt;\n&gt;\n&gt;\n&gt;  Frank\n&gt;\n&gt;\n&gt;\n&gt; Peek-a-boo FREE Tricks Treats for You! Get &#39;em!\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Help yourself to FREE treats served up daily at the Messenger Café.  \n&gt; Stop by today!\n&gt;\n&gt; \n\n\nCan I do a Scole hing wi h somebody? I' e go Skype-- Can I phone i in om Wes e n Ma yland?;)  (Bu a smidge mo e han hal way se ious)Anyway, I'll lis en o he C2C show omo ow and see how i wen . Le you know wha I hink hen. AnnOn Oc 20, 2007, a 7:29 PM, F ank Sump ion w o e: We we e supposedly wo king oge he o do a \"Scole\" like hing he e weekly s a ing las mon h, bu ha quickly bi he dus as Moon doesn' seem o unde s and weekly, no consis encey, as he i s oices eques ed. He also ne e said any hing abou being on C2C again, and \"F ank's Box\" will be  speci ically discussed, as men ioned in he show p omo on he C2C si e. I hink nie he Moon, no he C2C s a wan ac s o in e e e wi h he discussions! I hink he can s ick his \"Scole\" mee ings, and any o he scams up his -----, and may he ge he spi i con ac s he dese es!   \"Sa 10.20 >>Pa ano mal in es iga o and edi o o Haun ed Times Magazine,Ch is ophe Moonwill discuss haun ings as well as his wo k wi h F ank's Box, a de ice which summons he dead\"   G ea , once again making public claims abou a sys em he's ne e paid a dime o , makes un old amoun s o money wi h, has no knowledge o how i wo ks, and wha i 's eally o ....on and on! be e hi send be o e I eally ge pissed!  F ank-STo: EVP-ITC@yahoog oups.comF om: lisby@ea hlink.ne Da e: F i, 19 Oc 2007 18:21:30 -0400Subjec : Re: [EVP-ITC] Well ha 's iggin' in e es ing--Moon on C2C!F ank-- a e you and he speaking o on he ou s? I hink I may ha e missed a app ochemen be ween you his summe when I was o in he wilde ness camping.Ann On Oc 19, 2007, a 3:02 PM, F ank Sump ion w o e: Well, Moon's doing Coas To Coas again his weekend, his ime wi h Pune on Sa u day--- ne e said a wo d o me--and I'm su p ised!? o no .     F ankPeek-a-boo FREE T icks T ea s o You! Ge 'em!Help you sel o FREE ea s se ed up daily a he Messenge Ca é. S op by oday!"}