{"id": "2552", "subject": "Re: Well that&#39;s friggin&#39; interesting--Moon on C2C!", "author": "Steve Hultay", "timestamp": "2007-10-21T23:35:11Z", "full_text": "I am willing to do a session over Skype.  I have before with some \nsuccess.  If you want to do a box session, my name on there is \nkeyportparanormal.  It would be good if we can get a few people on \nthere at one time in a conference call.  I&#39;d like to see the \nresults.  Maybe we can set a certain time each week aside for this \nproject...not a bad idea.  All calls welcome to interested parties.  \nI could record it and send the file out to others that were involved \nin the call and we can all go over the file seperately and than \ncompare our findings later.  I have the Joe&#39;s box and if Frank wants \nto be involved in like a 10 minute session with his box, that would \nbe great.  Any more than 10 minutes takes too long to go over.  Let \nme know.\n\n-Steve H.\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, Lisby &lt;lisby@...&gt; wrote:\n&gt;\n&gt; Can I do a Scole thing with somebody? I&#39;ve got Skype-- Can I phone \nit  \n&gt; in from Western Maryland?\n&gt; \n&gt; ;)  (But a smidge more than halfway serious)\n&gt; \n&gt; Anyway, I&#39;ll listen to the C2C show tomorrow and see how it went. \nLet  \n&gt; you know what I think then.\n&gt; \n&gt; Ann\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; On Oct 20, 2007, at 7:29 PM, Frank Sumption wrote:\n&gt; \n&gt; &gt;\n&gt; &gt;  We were supposedly working together to do a &quot;Scole&quot; like thing  \n&gt; &gt; here weekly starting last month, but that quickly bit the dust \nas  \n&gt; &gt; Moon doesn&#39;t seem to understand weekly, nor consistencey, as \nthe  \n&gt; &gt; first voices requested. He also never said anything about being \non  \n&gt; &gt; C2C again, and &quot;Frank&#39;s Box&quot; will be  specifically discussed, \nas  \n&gt; &gt; mentioned in the show promo on the C2C site. I think niether \nMoon,  \n&gt; &gt; nor the C2C staff want facts to interfere with the discussions! \nI  \n&gt; &gt; think he can stick his &quot;Scole&quot; meetings, and any other scams up \nhis  \n&gt; &gt; -----, and may he get the spirit contacts he deserves!\n&gt; &gt;  &quot;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Sat 10.20 &gt;&gt;\n&gt; &gt; Paranormal investigator and editor of Haunted Times  \n&gt; &gt; Magazine,Christopher Moonwill discuss hauntings as well as his \nwork  \n&gt; &gt; with Frank&#39;s Box, a device which summons the dead&quot;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;  Great, once again making public claims about a system he&#39;s \nnever  \n&gt; &gt; paid a dime for, makes untold amounts of money with, has no  \n&gt; &gt; knowledge of how it works, and what it&#39;s really for....on and \non!  \n&gt; &gt; better hit send before I really get pissed!\n&gt; &gt;\n&gt; &gt;  Frank-S\n&gt; &gt;\n&gt; &gt; To: EVP-ITC@yahoogroups.com\n&gt; &gt; From: lisby@...\n&gt; &gt; Date: Fri, 19 Oct 2007 18:21:30 -0400\n&gt; &gt; Subject: Re: [EVP-ITC] Well that&#39;s friggin&#39; interesting--Moon on \nC2C!\n&gt; &gt;\n&gt; &gt; Frank-- are you and he speaking or on the outs? I think I may \nhave  \n&gt; &gt; missed a rapprochement between you this summer when I was off \nin  \n&gt; &gt; the wilderness camping.\n&gt; &gt;\n&gt; &gt; Ann\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; On Oct 19, 2007, at 3:02 PM, Frank Sumption wrote:\n&gt; &gt;\n&gt; &gt;  Well, Moon&#39;s doing Coast To Coast again this weekend, this \ntime  \n&gt; &gt; with Punet on Saturday--- never said a word to me--and I&#39;m  \n&gt; &gt; surprised!? or not.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;  Frank\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Peek-a-boo FREE Tricks Treats for You! Get &#39;em!\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Help yourself to FREE treats served up daily at the Messenger \nCaf.  \n&gt; &gt; Stop by today!\n&gt; &gt;\n&gt; &gt;\n&gt;"}