{"id": "2564", "subject": "RE: [EVP-ITC] Look Ma! No echo box.", "author": "Zack Widup", "timestamp": "2007-10-22T16:00:52Z", "full_text": "--297796611-1980923451-1193068852=:16748\r\nContent-Type: TEXT/PLAIN; charset=US-ASCII; format=flowed\r\nContent-Transfer-Encoding: 8BIT\r\n\r\n\nOK, no problem.  As I mentioned, it&#39;s probably going to be a winter \nproject anyway. :-)\n\nOn Mon, 22 Oct 2007, Frank Sumption wrote:\n\n&gt;\n&gt; Yes, but you have to wait till this evening, as the latest layout is at home.\n&gt;\n&gt; Frank-S\n&gt;\n&gt;\n&gt; To: EVP-ITC@yahoogroups.comFrom: w9sz@...: Mon, 22 Oct 2007 10:42:00 -0500Subject: RE: [EVP-ITC] Look Ma! No echo box.\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Hi Frank,Is there a way I can get a copy of your circuit layout? I can open Express PCB files, although I haven&#39;t used them for any boards yet. It&#39;s usually far cheaper for me to make a board myself than have them do it.A lot of the stuff I&#39;ve been doing is for amateur radio microwave frequencies. I usually make the circuit pattern with a CAD program, print it on transparent laser printer sheets, and use DATAK photoresist and developer to make boards. I&#39;ve been working with 10-mil thick Rogers Duroid 5880 board for 24 GHz and I have some of the 5-mil stuff, which is paper-thin. But I wouldn&#39;t use any of that expensive stuff for your circuit. I have lots of G-10 too.I didn&#39;t know about bdent.com. Looks like a great resource for parts. Thanks!ZackOn Sun, 21 Oct 2007, Frank Sumption wrote:&gt;&gt; I&#39;m using the LA1816 (bdent.com), it needs only the oscillator coil, a &gt; 455khz ceramic filter, and a choke I wind by hand for AM, and pretty &gt; much the same for FM. I add an AM RF amp so I can use a wire antenna. If &gt; you can work with SMT compnents, I have a layout all done. I order the &gt; boards from Express PCB for about $93 for two (min order), and if you &gt; want the silk screen on the board, that doubles the cost. There are some &gt; mistakes/changes to the current schematics that have been posted out on &gt; the net, I have up dates, but they are at work, and I can&#39;t post it from &gt; there, I keep forgetting to bring them home. FM leaves something to be &gt; desired, but I&#39;m rearranging the two FM coils on the latest board layout &gt; to see if that helps. The component values are marked for the top side &gt; with the silk screen, but there&#39;s no way to label the bottom from &gt; Express PCB. There&#39;s some jumpers needed, and I think I have them all &gt; labeled. You will have to down load the software from Express PCB to see &gt; the layout http://www.expresspcb.com/&gt;&gt; Getting the board is the easy part, assembly and wiring, that takes some time!&gt;&gt; Frank-S&gt;\n&gt;\r\n--297796611-1980923451-1193068852=:16748--"}