{"id": "2685", "subject": "Re: [EVP-ITC] No evidence is accptable!?", "author": "Lisby", "timestamp": "2007-10-28T21:07:55Z", "full_text": "No, I wasn&#39;t responding to that--I thought I was responding to this  \nongoing thread about someone who didn&#39;t hear a clip that Frank sent  \nthem. If you read down, there were quotes like this:\n\n&gt;\n&gt;  Maybe he is James Randi?s brother?\n\n&gt; How could anybody NOT see anything in that photo? It&#39;s as plain as  \n&gt; the&gt; nose on my face!!!\n\n&gt; So I just sent the guy this, bet he says he can&#39;t see a thing in  \n&gt; this picture&gt; either.&gt;&gt;&gt;&gt;\n&gt;\n&gt; &gt; This guy won&#39;t even look at, or see any evidence,\n\n&gt;\n&gt; He&#39;s not a debunker. A real debunker would actually look at the  \n&gt; evidence\n&gt; and try to find natural explanations within his frame of knowledge.\n&gt;\n&gt; This guy is an idiot.\n&gt;\n\nAnd the invective was stronger in other parts of this thread. I just  \ndon&#39;t like it when people get all mean, Bruce. Makes me sad.\n\nAnn\n\n\n\nOn Oct 28, 2007, at 3:25 PM, bruce halliday wrote:\n\n&gt; Lisby,\n&gt;\n&gt; No one was perpitrating an outrage fest the only thing I was  \n&gt; insinuating was that in the\n&gt; begging for everyone including myself evp is very hard to recognize  \n&gt; and interpret even by\n&gt; a seasoned pro like yourself. I wish there were people around when  \n&gt; I started with evp research\n&gt; to lend a hand and some constructive criticism so I didn&#39;t have to  \n&gt; flounder around for such a long\n&gt; time trying to figure it out on my own. I&#39;m sure if dave felt he  \n&gt; was being unduely crircised he would have spoken up himself.\n&gt;\n&gt; Bruce\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Bruce Halliday\n&gt; Paranormal Investigating Team\n&gt;\n&gt;\n&gt;\n&gt; To: EVP-ITC@...m\n&gt; From: lisby@...\n&gt; Date: Sun, 28 Oct 2007 13:32:42 -0400\n&gt; Subject: Re: [EVP-ITC] No evidence is accptable!?\n&gt;\n&gt; Hey guys, not to interrupt the outragefest here, but there are  \n&gt; times when what you&#39;re seeing and hearing just doesn&#39;t agree with  \n&gt; what someone else does. There where times when, for example, when a  \n&gt; late member of another group showed me pictures where he was  \n&gt; absolutely sure they showed something paranormal and all I saw was  \n&gt; zip--sometimes not even enough to blame it on pattern recognition.  \n&gt; We&#39;d argue until the old saw was trotted out, &quot;You skeptics don&#39;t  \n&gt; believe anything.&quot; I&#39;d always assure him that I did, in fact,  \n&gt; accept the reality of EVP, life after death, UFOs, time travel, and  \n&gt; any number of other paranormal issues, and just because I did not  \n&gt; perceive one piece of potential evidence was actually evidence, it  \n&gt; was very unfair to tar and feather me.\n&gt;\n&gt; There have been times when I heard a clear EVP and no one else did  \n&gt; and times that others insisted they clearly heard one and I did  \n&gt; not. (And I have to add that sometimes listening for EVPs amidst a  \n&gt; long stream of bandwidth tuning diminishes them for me--it makes  \n&gt; them sound much more likely to be broadcast fragments. Unless you  \n&gt; have good headphones and are listening very carefully to each  \n&gt; syllable, it sounds like junk.)\n&gt;\n&gt; Also, please keep in mind that when you solicit a stranger&#39;s  \n&gt; opinion, you need to accept the fact that you may not get the  \n&gt; validation you are looking for. I get hundreds of supposed  \n&gt; paranormal pics sent to me each year. 99.9 are camera artifacts. I  \n&gt; only write back to the ones I think may be possibly paranormal  \n&gt; because if I write back and say it is a camera artifact, then I end  \n&gt; up in a slanging match with the person who sent it and I assure you  \n&gt; that every conversation includes the sentence &quot;Well, you skeptics  \n&gt; don&#39;t believe anything!&quot;\n&gt;\n&gt; I don&#39;t know this person that all the slanging is going on about  \n&gt; here, but I do know that he, like me, simply may not hear it, may  \n&gt; not want to be involved for whatever reason, or may just be in a  \n&gt; bad mood that someone is demanding he agree with them when he  \n&gt; honestly doesn&#39;t. There is nothing wrong with that. It doesn&#39;t make  \n&gt; him the twin brother of James Randi or even a simple skeptic.\n&gt;\n&gt; Have some mercy on people who don&#39;t see with you eye to eye. Agree  \n&gt; to disagree. Be good to each other, for chrissakes. This is not an  \n&gt; all-or-nothing issue. And I think that once you come to the  \n&gt; conclusion that you have experienced enough high strangeness to  \n&gt; know, without a doubt, that the basic fact that the Other Side and  \n&gt; far more exists, then the need for every possible piece of evidence  \n&gt; to be real fades away. We&#39;re not looking for evidence. We have it  \n&gt; already. We&#39;re looking for the best evidence possible.\n&gt;\n&gt; /rant\n&gt;\n&gt; Ann\n&gt;\n&gt;\n&gt; On Oct 26, 2007, at 10:07 AM, Zack Widup wrote:\n&gt;\n&gt;\n&gt; He&#39;s not a debunker. A real debunker would actually look at the  \n&gt; evidence\n&gt; and try to find natural explanations within his frame of knowledge.\n&gt;\n&gt; This guy is an idiot.\n&gt;\n&gt; Zack\n&gt;\n&gt; On Fri, 26 Oct 2007, Frank Sumption wrote:\n&gt;\n&gt; &gt;\n&gt; &gt; This guy won&#39;t even look at, or see any evidence, He&#39;s a  \n&gt; debunker, I just wanted to prod him some. I can&#39;t even answer  \n&gt; wirthout getting real nasty, so I&#39;ll just drop it.\n&gt; &gt;\n&gt; &gt; Frank\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; To: EVP-ITC@yahoogroups.comFrom: w9sz@...: Thu, 25  \n&gt; Oct 2007 16:16:07 -0500Subject: RE: [EVP-ITC] No evidence is  \n&gt; accptable!?\n&gt; &gt;\n&gt; &gt; Good question ... just take the photo, show it to someone without  \n&gt; telling them ANYTHING about it and ask them what they see.I did  \n&gt; that with someone at work and he said he saw the tops of two heads  \n&gt; down to the lips, and below that another image of just lips and  \n&gt; chin.ZackOn Thu, 25 Oct 2007, Kristin Morris wrote:&gt; Maybe he is  \n&gt; James Randi?s brother?&gt;&gt; k&gt;&gt;&gt;&gt; _____&gt;&gt; From: EVP-ITC@yahoogroups.com \n&gt; [mailto:EVP-ITC@yahoogroups.com] On Behalf Of&gt; Zack Widup&gt; Sent:  \n&gt; Thursday, October 25, 2007 2:43 PM&gt; To: EVP-ITC@yahoogroups.com&gt;  \n&gt; Subject: RE: [EVP-ITC] No evidence is accptable!?&gt;&gt;&gt;&gt;&gt; How could  \n&gt; anybody NOT see anything in that photo? It&#39;s as plain as the&gt; nose  \n&gt; on my face!!!&gt;&gt; Zack&gt;&gt; On Thu, 25 Oct 2007, Frank Sumption  \n&gt; wrote:&gt;&gt;&gt;&gt;&gt; So I just the guy this, bet he says he can&#39;t see a  \n&gt; thing in this picture&gt; either.&gt;&gt;&gt;&gt; Frank&gt;&gt;&gt;&gt;&gt;&gt;\n&gt; &gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Help yourself to FREE treats served up daily at the Messenger Café.  \n&gt; Stop by today!\n&gt;\n&gt; \n\n\nNo, I wasn' esponding o ha --I hough I was esponding o his ongoing h ead abou someone who didn' hea a clip ha F ank sen hem. I you ead down, he e we e quo es like his: Maybe he is James Randi?s b o he ? How could anybody NOT see any hing in ha pho o? I 's as plain as he> nose on my ace!!! So I jus sen he guy his, be he says he can' see a hing in his pic u e> ei he .>>>> > This guy won' e en look a , o see any e idence,He's no a debunke . A eal debunke would ac ually look a he e idence and y o ind na u al explana ions wi hin his ame o knowledge.This guy is an idio .And he in ec i e was s onge in o he pa s o his h ead. I jus don' like i when people ge all mean, B uce. Makes me sad.AnnOn Oc 28, 2007, a 3:25 PM, b uce halliday w o e:Lisby, No one was pe pi a ing an ou age es he only hing I was insinua ing was ha in he begging o e e yone including mysel e p is e y ha d o ecognize and in e p e e en by a seasoned p o like you sel . I wish he e we e people a ound when I s a ed wi h e p esea ch o lend a hand and some cons uc i e c i icism so I didn' ha e o lounde a ound o such a long ime ying o igu e i ou on my own. I'm su e i da e el he was being unduely c i cised he would ha e spoken up himsel . B uce B uce Halliday Pa ano mal In es iga ing Team To: EVP-ITC@yahoog oups.comF om: lisby@ea hlink.ne Da e: Sun, 28 Oc 2007 13:32:42 -0400Subjec : Re: [EVP-ITC] No e idence is accp able!?Hey guys, no o in e up he ou age es he e, bu he e a e imes when wha you' e seeing and hea ing jus doesn' ag ee wi h wha someone else does. The e whe e imes when, o example, when a la e membe o ano he g oup showed me pic u es whe e he was absolu ely su e hey showed some hing pa ano mal and all I saw was zip--some imes no e en enough o blame i on pa e n ecogni ion. We'd a gue un il he old saw was o ed ou , \"You skep ics don' belie e any hing.\" I'd always assu e him ha I did, in ac , accep he eali y o EVP, li e a e dea h, UFOs, ime a el, and any numbe o o he pa ano mal issues, and jus because I did no pe cei e one piece o po en ial e idence was ac ually e idence, i was e y un ai o a and ea he me.The e ha e been imes when I hea d a clea EVP and no one else did and imes ha o he s insis ed hey clea ly hea d one and I did no . (And I ha e o add ha some imes lis ening o EVPs amids a long s eam o bandwid h uning diminishes hem o me--i makes hem sound much mo e likely o be b oadcas agmen s. Unless you ha e good headphones and a e lis ening e y ca e ully o each syllable, i sounds like junk.)Also, please keep in mind ha when you solici a s ange 's opinion, you need o accep he ac ha you may no ge he alida ion you a e looking o . I ge hund eds o supposed pa ano mal pics sen o me each yea . 99.9 a e came a a i ac s. I only w i e back o he ones I hink may be possibly pa ano mal because i I w i e back and say i is a came a a i ac , hen I end up in a slanging ma ch wi h he pe son who sen i and I assu e you ha e e y con e sa ion includes he sen ence \"Well, you skep ics don' belie e any hing!\"I don' know his pe son ha all he slanging is going on abou he e, bu I do know ha he, like me, simply may no hea i , may no wan o be in ol ed o wha e e eason, o may jus be in a bad mood ha someone is demanding he ag ee wi h hem when he hones ly doesn' . The e is no hing w ong wi h ha . I doesn' make him he win b o he o James Randi o e en a simple skep ic.Ha e some me cy on people who don' see wi h you eye o eye. Ag ee o disag ee. Be good o each o he , o ch issakes. This is no an all-o -no hing issue. And I hink ha once you come o he conclusion ha you ha e expe ienced enough high s angeness o know, wi hou a doub , ha he basic ac ha he O he Side and a mo e exis s, hen he need o e e y possible piece o e idence o be eal ades away. We' e no looking o e idence. We ha e i al eady. We' e looking o he bes e idence possible./ an AnnOn Oc 26, 2007, a 10:07 AM, Zack Widup w o e:He's no a debunke . A eal debunke would ac ually look a he e idence and y o ind na u al explana ions wi hin his ame o knowledge.This guy is an idio .ZackOn F i, 26 Oc 2007, F ank Sump ion w o e:>> This guy won' e en look a , o see any e idence, He's a debunke , I jus wan ed o p od him some. I can' e en answe wi hou ge ing eal nas y, so I'll jus d op i .>> F ank>>> To: EVP-ITC@yahoog oups.comF om: w9sz@p ai iene .o gDa e: Thu, 25 Oc 2007 16:16:07 -0500Subjec : RE: [EVP-ITC] No e idence is accp able!?>> Good ques ion ... jus ake he pho o, show i o someone wi hou elling hem ANYTHING abou i and ask hem wha hey see.I did ha wi h someone a wo k and he said he saw he ops o wo heads down o he lips, and below ha ano he image o jus lips and chin.ZackOn Thu, 25 Oc 2007, K is in Mo is w o e:> Maybe he is James Randi?s b o he ?>> k>>>> _____>> F om: EVP-ITC@yahoog oups.com[mail o:EVP-ITC@yahoog oups.com] On Behal O > Zack Widup> Sen : Thu sday, Oc obe 25, 2007 2:43 PM> To: EVP-ITC@yahoog oups.com> Subjec : RE: [EVP-ITC] No e idence is accp able!?>>>>> How could anybody NOT see any hing in ha pho o? I 's as plain as he> nose on my ace!!!>> Zack>> On Thu, 25 Oc 2007, F ank Sump ion w o e:>>>>> So I jus he guy his, be he says he can' see a hing in his pic u e> ei he .>>>> F ank>>>>>>>Help you sel o FREE ea s se ed up daily a he Messenge Ca é. S op by oday!"}