{"id": "2694", "subject": "Re: [EVP-ITC] Hello! Ques. about DC Six or Seven and Real Time recording", "author": "Lisby", "timestamp": "2007-10-29T21:50:29Z", "full_text": "Was this made specifically for EVP? Looking at the site, it looks  \ncommercial.  How does it work for EVP? I&#39;m very interested, but I  \nknow nothing about this type of program at all. How do you make it  \nwork for you to record EVP?\n\nAnn\n\nOn Oct 29, 2007, at 5:45 PM, wingd_with_awe wrote:\n\n&gt; Hi,it&#39;s been awhile since I&#39;ve logged on here but just popping in to\n&gt; say hi gang! Glad that y&#39;all are here!\n&gt;\n&gt; I saw some information in another ITC forum about DC Six, an audio\n&gt; editor that allows one to record EVP in Real Time... and it&#39;s\n&gt; awesome! Has anyone here tried out the demo version of this program\n&gt; that&#39;s now been updated to DC Seven?\n&gt;\n&gt; Anyway, I&#39;ve been experimenting with it and it&#39;s really amazing. I\n&gt; can talk into it and some of my EVP contacts answer back right away.\n&gt; But because I am not knowledgeable about sound recorders except for\n&gt; the basics when it comes to editing my EVP, I would like to know if\n&gt; someone here could download the 10 day trial version of DC Seven and\n&gt; let me know what you think about it. I&#39;m having a few problems with\n&gt; getting it to work as it&#39;s probably supposed to work... mainly having\n&gt; a problem with feedback and so on..\n&gt; Here&#39;s the link to DC Seven&#39;s 10 trial demo:\n&gt; http://www.enhancedaudio.com/dc_seven.htm\n&gt; Hope someone here will try it out because I would love to know if it\n&gt; works for you!\n&gt;\n&gt; wingd\n&gt;\n&gt;\n&gt; \n\n\nWas his made speci ically o EVP? Looking a he si e, i looks comme cial.  How does i wo k o EVP? I'm e y in e es ed, bu I know no hing abou his ype o p og am a all. How do you make i wo k o you o eco d EVP?AnnOn Oc 29, 2007, a 5:45 PM, wingd_wi h_awe w o e:Hi,i 's been awhile since I' e logged on he e bu jus popping in o say hi gang! Glad ha y'all a e he e!I saw some in o ma ion in ano he ITC o um abou DC Six, an audio edi o ha allows one o eco d EVP in Real Time... and i 's awesome! Has anyone he e ied ou he demo e sion o his p og am ha 's now been upda ed o DC Se en? Anyway, I' e been expe imen ing wi h i and i 's eally amazing. I can alk in o i and some o my EVP con ac s answe back igh away. Bu because I am no knowledgeable abou sound eco de s excep o he basics when i comes o edi ing my EVP, I would like o know i someone he e could download he 10 day ial e sion o DC Se en and le me know wha you hink abou i . I'm ha ing a ew p oblems wi h ge ing i o wo k as i 's p obably supposed o wo k... mainly ha ing a p oblem wi h eedback and so on.. He e's he link o DC Se en's 10 ial demo:h p://www.enhancedaudio.com/dc_se en.h mHope someone he e will y i ou because I would lo e o know i i wo ks o you! wingd"}