{"id": "2698", "subject": "A few more and some blah blah blah =)", "author": "Misty Dawn", "timestamp": "2007-10-30T22:07:00Z", "full_text": "--0-1581387052-1193782020=:64149\r\nContent-Type: multipart/alternative; boundary=&quot;0-295996018-1193782020=:64149&quot;\r\n\r\n\r\n--0-295996018-1193782020=:64149\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nHeres a few more silly ones. Some maybe hard to hear on some peoples systems. As for the shrimp boat one I dont get it I can only say that lately they have been telling me what &quot;they&quot; are doing whether its crossing others over or &quot;traveling&quot;. &quot;We are sitting having tea, we&#39;re sittin in spago with cheesecake, were on a shrimp boat in athens&quot;... and a much longer one thats a bit too big to post to this from 091607h2o says &quot;in your mind we are sitting at the table eating cheese&quot; then someone else says &quot;dont talk to me about cheese&quot; and you hear the first voice ask them &quot;did I mess up? Well then adieu&quot;\n   \n  The tea and cheese ones I get it was a favorite pasttime for many of those who have now crossed over, I didnt know spago had cheesecake til i looked it up and never went there.. but whatever floats yer boat and save me a peice will ya. As for the shrimp boat, well guess there is either work to be done or food for thought to be had LOL I have no idea\n   \n  I find it all interesting because regardless of the methods used many of the same voices tend to come thru continuing on from where they left off or offering assistance when needed. I dont expect anyone to hear what I do in any of the stuff I post but if you do hear it or hear your own message then cool. \n   \n  Since I try to record often I get a variety of evp. Different messages from different energies. Some tend to be more technical in nature while others are more personal. Many of them I never knew here but now and then one pops up that is relevant to someone else in these groups. As for the ones I do claim I knew... well you would just have to have known them to understand it on a personal level. I can say this is my mothers/friends voice but the recognition factor would only be for those who knew that persons voice. I can say this voice says they are Edison/Lennon/whoever, but since I didnt know him there is no personal recognition factoring in, so all I can do is post it and as with anything I ever post...let you decide for yourself what YOU hear because what you hear often differs from my own. It doesnt matter if you dont hear what I hear, in fact its is expected. I am more surprised when people do hear it the same because not many hear at the same frequencies I do and\n vice versa. \n   \n  When people speak to you how often do you find yourself saying &quot;huh?&quot; or wanting them to repeat. Or they ask you to repeat yourself. Notice it for the next month or so and you will see what I mean. Those of you who work with different cultures of people or in the tourism industry know what I mean. Until the connection between us is made I cant understand a darn thing ya say sometimes LOL but I try my best until we do.\n   \n  Ive been working on collecting the womans voice who used to keep me up at night in the old house. She has been coming thru now and then and the others speak about her as well. All those years of hearing the mumbled conversations and finally I have the ability to go huh? whatd ya say? and rewind that back and REPLAY. Again it is a personal recognition for me that I dont expect any of you to understand at all, but it is that voice I recognize it like my own mothers because I heard it so many times. But back then it was just to hard to make out what was being said, just sounded like a neverending thing on tv in the next room every night, but tv usually wasnt on and in one case when the house had been empty for a couple years the power wasnt even on but my friend (whos crossed now too) and I could both hear thier voices and we hadnt even entered the house yet, just at the door about to go in and she asked me how could a tv be on if there was no power. I was shocked she could\n hear it too I was so excited that finally someone could hear them talking besides me LOL.\n   \n  Anyways I will try and post more of the better stuff soon, I have just been so darn taxed for time I havent been able to keep up with sharing. So for today its a few of the crazy ones.\n   \n  Enjoy!\n   \n  Misty\n\n __________________________________________________\nDo You Yahoo!?\nTired of spam?  Yahoo! Mail has the best spam protection around \nhttp://mail.yahoo.com \r\n--0-295996018-1193782020=:64149\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;DIV&gt;Heres a few more silly ones. Some maybe hard to hear on some peoples systems. As for the shrimp boat one&nbsp;I dont get it I can only say that lately they have been telling me what &quot;they&quot; are doing whether its crossing others over or &quot;traveling&quot;. &quot;We are sitting&nbsp;having tea, we&#39;re sittin in spago with cheesecake, were on a shrimp boat in athens&quot;... and a much longer one thats a bit too big to post to this from 091607h2o says &quot;in your mind we are sitting at the table eating cheese&quot; then someone else says &quot;dont talk to me about cheese&quot; and you hear the first voice ask them &quot;did I mess up? Well then adieu&quot;&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;The&nbsp;tea and cheese&nbsp;ones&nbsp;I get it was a favorite pasttime for many of those who have now crossed over, I didnt know spago had cheesecake til i looked it up and never went there.. but whatever floats yer boat and save me a peice will ya. As for the shrimp boat, well guess there is either work to be done or&nbsp;food for\n thought&nbsp;to be had LOL I have no idea&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;I find it all interesting because regardless of the methods used many of the same voices tend to come thru continuing on from where they left off or offering assistance when needed. I dont expect anyone to hear what I do in any of the stuff I post but if you do hear it or hear your own message then cool. &lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;Since I try to record often I get a variety of evp. Different messages from different energies. Some tend to be more technical in nature while others are more personal. Many of them I never knew here but now and then one pops up that is relevant to someone else in these groups. As for the ones I do claim I knew... well you would just have to have known them to understand it on a personal level. I can say this is my mothers/friends voice but the recognition factor would only be for those who knew that persons voice. I can say this voice says they are\n Edison/Lennon/whoever, but since I didnt know him there is no personal recognition factoring in, so all I can do is post it and as with anything I ever post...let you decide for yourself what YOU hear because what you hear often differs from my own. It doesnt matter if you dont hear what I hear, in fact its is expected. I am more surprised when people do hear it the same because not many hear at the same frequencies I do and vice versa. &lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;When people speak to you how often do you find yourself saying &quot;huh?&quot; or wanting them to repeat. Or they ask you to repeat yourself. Notice it for the next month or so and you will see what I mean. Those of you who work with different cultures of people or in the tourism industry know what I mean. Until the connection between us is made I cant understand a darn thing ya say sometimes LOL but I try my best until we do.&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;Ive been working on collecting the womans voice&nbsp;who used\n to keep me up at night in the old house. She has been coming thru now and then and the others speak about her as well. All those years of hearing the mumbled conversations and finally I have the ability to go huh? whatd ya say? and rewind that back and REPLAY. Again it is a personal recognition for me that I dont expect any of you to understand at all, but it is that voice I recognize it like my own mothers because I heard it so many times. But back then it was just to hard to make out what was being said, just sounded like a neverending thing on tv in the next room every night, but tv usually wasnt on and in one case when the house had been empty for a couple years the power wasnt even on but my friend (whos crossed now too) and I could both hear thier voices and we hadnt even entered the house yet, just at the door about to go in and she asked me how could a tv be on if there was no power. I was shocked she could hear it too I was so excited that finally someone could\n hear them talking besides me LOL.&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;Anyways I will try and post more of the better stuff soon, I have just been so darn taxed for time I havent been able to keep up with sharing. So for today its a few of the crazy ones.&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;Enjoy!&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;Misty&lt;/DIV&gt;&lt;p&gt;&#32;__________________________________________________&lt;br&gt;Do You Yahoo!?&lt;br&gt;Tired of spam?  Yahoo! Mail has the best spam protection around &lt;br&gt;http://mail.yahoo.com \r\n--0-295996018-1193782020=:64149--\r\n\n\r\n--0-1581387052-1193782020=:64149\r\nContent-Type: audio/mpeg; name=&quot;102507h2o_CLRwereonashrimpboatinathens.mp3&quot;\r\nContent-Description: 804200429-102507h2o_CLRwereonashrimpboatinathens.mp3\r\nContent-Disposition: attachment; filename=&quot;102507h2o_CLRwereonashrimpboatinathens.mp3&quot;\r\n\r\n[ Attachment content not displayed ]\r\n--0-1581387052-1193782020=:64149\r\nContent-Type: audio/mpeg; name=&quot;080107ST_CLRwere sittin in spago with cheesecake - cheesecake.mp3&quot;\r\nContent-Description: 2032737645-080107ST_CLRwere sittin in spago with cheesecake - cheesecake.mp3\r\nContent-Disposition: attachment; filename=&quot;080107ST_CLRwere sittin in spago with cheesecake - cheesecake.mp3&quot;\r\n\r\n[ Attachment content not displayed ]\r\n--0-1581387052-1193782020=:64149\r\nContent-Type: audio/mpeg; name=&quot;073007h2o_CLRweresittinhavinteaandxx.mp3&quot;\r\nContent-Description: 3136138415-073007h2o_CLRweresittinhavinteaandxx.mp3\r\nContent-Disposition: attachment; filename=&quot;073007h2o_CLRweresittinhavinteaandxx.mp3&quot;\r\n\r\n[ Attachment content not displayed ]\r\n--0-1581387052-1193782020=:64149--"}