{"id": "2707", "subject": "Re: Hello! Ques. about DC Six or Seven and Real Time recording", "author": "wingd_with_awe", "timestamp": "2007-10-31T12:45:38Z", "full_text": "Hi Misty,\n\nThat&#39;s what I get too... that high pitched feedback sound that \ncrescendo&#39;s... \nI&#39;m using DC Seven now to see if it&#39;s any better but still having the \nsame problem and the software seems quirky. But unlike DC Six&#39;s trial \nversion, DC Seven allows one to keep recording live with no time \nlimits. So if you try this software out again, download the trial 10 \nday version of DC Seven... Anyway, I tried out each of the filters \nand some are better than others in keeping that feedback in check. \nBut here&#39;s what I know so far:\n-- when I talk into my mic, I talk right into it and not at a \ndistance -- and whisper as opposed to talking in my normal voice when \nI&#39;m asking any questions where I hope to get a response on and I \ndo .. so this is absolutely amazing! But by talking into the mic this \nway keeps ones voice from echoing too much.. some filters are better \nthan others. Using no filter at all, at least on my computer echos \ntoo much.. \n-- Still, whenever a spirit speaks,its voice has that echoing effect \nwhere we hear what it&#39;s saying over and over until it dies down -- \nthen the next thing it says does the same thing. Attached in one of \nmy evp&#39;s I recorded when using this software. As you see, the spirit \nis talking but that voice is echoing a lot. The first part says &quot;It&#39;s \nLinda&quot;... followed by &#39;cigerette&#39; over and over too. I was holding up \na cigerette and asking for anyone to tell me what it is. They \nanswered that question. \n\n-- The save feature is disabled on the trial versions of this \nsoftware but have been able to get around that by opening up cool \nedit, clicking on record and then switching back to DC Live and \nclicking Live Preview. Whatever was coming over the DC Live preview \nwas being recorded by Cool Edit where I had my mic close enough to \nthe speaker for it to record but not close enough to cause any \nfeedback. But as you know, that feedback problem is there with DC \nLive anyway but because I have a volume control on my speaker, I can \nadjust the volume to keep it from going into a screeching high pitch. \nLol... it&#39;s complicated. \n\nI just don&#39;t have a clue how the 2 people in the 2 links below were \nable to get the recordings they did using this software where from \nlistening to their recordings, it appears that they are not having \nthat feedback problem. I wonder how they did that? \nhttp://www.1800heaven.com/liveevp.htm\nhttp://www.itcbridge.com/forum/view_topic.php?id=192&forum_id=5\n\nLol... if they got it working then they must have been doing \nsomething right! \nHere&#39;s a link with the recording I made using this software:\nhttp://www.itcbridge.com/forum/view_topic.php?id=335&forum_id=5\n\n\n\n--- In EVP-ITC@yahoogroups.com, Misty Dawn &lt;bulletbabea@...&gt; wrote:\n&gt;\n&gt; Welcome back Linda.\n&gt;    \n&gt;   Yeah I have that, tried it, couldnt figure it out, havent had \ntime to try it again yet. Theres a couple around who have used it \nsuccessfully. One is out of town but she may reply when she gets back.\n&gt;    \n&gt;   For me it just kept feeding back louder and louder until it was \noverwhelming loud noise, so I was doing something wrong.\n&gt;    \n&gt;   Misty\n&gt; \n&gt; wingd_with_awe &lt;wingd_with_awe@...&gt; wrote:\n&gt;           Hi,it&#39;s been awhile since I&#39;ve logged on here but just \npopping in to \n&gt; say hi gang! Glad that y&#39;all are here!\n&gt; \n&gt; I saw some information in another ITC forum about DC Six, an audio \n&gt; editor that allows one to record EVP in Real Time... and it&#39;s \n&gt; awesome! Has anyone here tried out the demo version of this program \n&gt; that&#39;s now been updated to DC Seven? \n&gt; \n&gt; Anyway, I&#39;ve been experimenting with it and it&#39;s really amazing. I \n&gt; can talk into it and some of my EVP contacts answer back right \naway. \n&gt; But because I am not knowledgeable about sound recorders except for \n&gt; the basics when it comes to editing my EVP, I would like to know if \n&gt; someone here could download the 10 day trial version of DC Seven \nand \n&gt; let me know what you think about it. I&#39;m having a few problems with \n&gt; getting it to work as it&#39;s probably supposed to work... mainly \nhaving \n&gt; a problem with feedback and so on.. \n&gt; Here&#39;s the link to DC Seven&#39;s 10 trial demo:\n&gt; http://www.enhancedaudio.com/dc_seven.htm\n&gt; Hope someone here will try it out because I would love to know if \nit \n&gt; works for you! \n&gt; \n&gt; wingd\n&gt; \n&gt; \n&gt; \n&gt;                          \n&gt; \n&gt;  __________________________________________________\n&gt; Do You Yahoo!?\n&gt; Tired of spam?  Yahoo! Mail has the best spam protection around \n&gt; http://mail.yahoo.com\n&gt;"}