{"id": "2709", "subject": "Re: Hello! Ques. about DC Six or Seven and Real Time recording", "author": "wingd_with_awe", "timestamp": "2007-10-31T12:52:04Z", "full_text": "Hi Ann!\nCheck out this link for information about this software being \ndiscussed on Keith&#39;s forum:\nhttp://www.itcbridge.com/forum/view_topic.php?id=192&forum_id=5\nI also just posted a reply to Misty&#39;s comments with information you \nmight find useful. \n\nBut because a couple of people were able to get some incredible real \ntime evp results with this software is promising! Yet, because of ths \nfeedback problem I&#39;m having, regardless that I&#39;m getting EVP coming \nin, it&#39;s frustrating having to iron out these tech. issues to get it \nworking right. Hope you can try it out to see if you have any luck \nwith it! \nlinda\n\n\n--- In EVP-ITC@yahoogroups.com, Lisby &lt;lisby@...&gt; wrote:\n&gt;\n&gt; Was this made specifically for EVP? Looking at the site, it looks  \n&gt; commercial.  How does it work for EVP? I&#39;m very interested, but I  \n&gt; know nothing about this type of program at all. How do you make it  \n&gt; work for you to record EVP?\n&gt; \n&gt; Ann\n&gt; \n&gt; On Oct 29, 2007, at 5:45 PM, wingd_with_awe wrote:\n&gt; \n&gt; &gt; Hi,it&#39;s been awhile since I&#39;ve logged on here but just popping in \nto\n&gt; &gt; say hi gang! Glad that y&#39;all are here!\n&gt; &gt;\n&gt; &gt; I saw some information in another ITC forum about DC Six, an audio\n&gt; &gt; editor that allows one to record EVP in Real Time... and it&#39;s\n&gt; &gt; awesome! Has anyone here tried out the demo version of this \nprogram\n&gt; &gt; that&#39;s now been updated to DC Seven?\n&gt; &gt;\n&gt; &gt; Anyway, I&#39;ve been experimenting with it and it&#39;s really amazing. I\n&gt; &gt; can talk into it and some of my EVP contacts answer back right \naway.\n&gt; &gt; But because I am not knowledgeable about sound recorders except \nfor\n&gt; &gt; the basics when it comes to editing my EVP, I would like to know \nif\n&gt; &gt; someone here could download the 10 day trial version of DC Seven \nand\n&gt; &gt; let me know what you think about it. I&#39;m having a few problems \nwith\n&gt; &gt; getting it to work as it&#39;s probably supposed to work... mainly \nhaving\n&gt; &gt; a problem with feedback and so on..\n&gt; &gt; Here&#39;s the link to DC Seven&#39;s 10 trial demo:\n&gt; &gt; http://www.enhancedaudio.com/dc_seven.htm\n&gt; &gt; Hope someone here will try it out because I would love to know if \nit\n&gt; &gt; works for you!\n&gt; &gt;\n&gt; &gt; wingd\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt;"}