{"id": "2791", "subject": "Re: [EVP-ITC] Nothin&#39;!", "author": "Tracy", "timestamp": "2007-11-05T19:37:50Z", "full_text": "--0-830060265-1194291470=:74215\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nvery well said Frank.  With some of them, I think it is a game that they like to play.  John Keel has written about the nature of these guys that like to play this game, if you haven&#39;t read &quot;mothman prophecies&quot; (the book, not the movie) check it out.  \n  I think it warrants continuing.  The unitiated soon become baptised quickly after several rounds and if they land at the bottom of the rabbits hole instead, hopefully they know which pill to take to make them small *grin*\n\nFrank Sumption &lt;franks-boxes@...&gt; wrote:\n          This is what troubles me, I get these supposed Earthquake predictions, the last one fairly specific, and --nothin&#39;! It was supposed to be for China, today. That&#39;s what I try to get across, you can&#39;t take this shit like it&#39;s written in stone, or some kind of friggin&#39; gospel, as most seem prone to do. So far, irregardless of how clear the voice is, or what method is used, the only thing that can be said with certainty is that they consistently lie! Personally I seem to get just enough &quot;truth&quot; to keep me hooked. I don&#39;t think you can say with any certainty it&#39;s sprits of the deceased, at least not all of it, there&#39;s that level of deception that I don&#39;t kow what do to with. When someone tells me they have the knowledge to know what questions to ask to verify the personality, I have to conclude they are absolutely clueless. I don&#39;t care how many books they&#39;ve written, or how many &quot;universities&quot; they&#39;ve given. When something knows how you think, what you are perceiving,\n and how it&#39;s being perceived, you can&#39;t prevent yourself from being deceived, or more like played with. I know I&#39;ll be deceived, and tricked, and I tell them have fun with that, cuz I don&#39;t really care. I&#39;m not after any particular spirit, or piece of knowledge.  \n \n When these voices tell someone not to share the information, that&#39;s even thinner ice to on!\n \n I still, everyday, question the value of this work, and if it warrents continuing. I can do this on my own, but I don&#39;t want to drag the unitiated into hell with me! I find the communication mode itself facsinating, and don&#39;t expect that profound paranormal knowledge others seem to seek. I don&#39;t care who is talking through the box.  I think those seeking those bits of profound knowledge, or secrets will get lead right down the rabbit hole. \n \n Frank-S\n\n\n  \n---------------------------------\n  Peek-a-boo FREE Tricks Treats for You! Get &#39;em!   \n\n                         \n\r\n--0-830060265-1194291470=:74215\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;div&gt;very well said Frank.&nbsp; With some of them, I think it is a game that they like to play.&nbsp; John Keel has written about the nature of these guys that like to play this game, if you haven&#39;t read &quot;mothman prophecies&quot; (the book, not the movie) check it out.&nbsp; &lt;/div&gt;  &lt;div&gt;I think it warrants continuing.&nbsp; The unitiated soon become baptised quickly after several rounds and if they land at the bottom of the rabbits hole instead, hopefully they know which pill to take to make them small *grin*&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;Frank Sumption &lt;franks-boxes@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/div&gt;  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV\n id=ygrp-text&gt;  &lt;div&gt;This is what troubles me, I get these supposed Earthquake predictions, the last one fairly specific, and --nothin&#39;! It was supposed to be for China, today. That&#39;s what I try to get across, you can&#39;t take this shit like it&#39;s written in stone, or some kind of friggin&#39; gospel, as most seem prone to do. So far, irregardless of how clear the voice is, or what method is used,&nbsp;the only thing that can be said with certainty is that they consistently&nbsp;lie! Personally I seem to get just enough &quot;truth&quot;&nbsp;to keep me hooked. I don&#39;t think you can say with any certainty&nbsp;it&#39;s sprits of the &lt;SPAN style=&quot;FONT-SIZE: 8.5pt; COLOR: #444444; FONT-FAMILY: Verdana&quot;&gt;deceased&lt;/SPAN&gt;, at least not all of it, there&#39;s that level of deception that I don&#39;t kow what do to with. When someone tells me they have the knowledge to know what questions to ask to verify the personality,&nbsp;I have to conclude they are absolutely clueless. I don&#39;t care how many books they&#39;ve\n written, or how many &quot;universities&quot; they&#39;ve given. When something knows how you think, what you are perceiving, and how it&#39;s being perceived, you can&#39;t prevent yourself from being deceived, or more like played with. I know I&#39;ll be deceived, and tricked, and&nbsp;I tell them have fun with that, cuz I don&#39;t really care. I&#39;m not after&nbsp;any particular spirit, or piece of knowledge. &nbsp;&lt;BR&gt;&nbsp;&lt;BR&gt;&nbsp;When these voices tell someone not to share the information, that&#39;s even thinner ice to on!&lt;BR&gt;&nbsp;&lt;BR&gt;&nbsp;I still, everyday, question the value of this work, and if it warrents continuing. I can do this on my own, but I don&#39;t want to drag the unitiated into hell with me! I find the communication&nbsp;mode itself facsinating, and don&#39;t expect that profound paranormal knowledge others seem to seek. I don&#39;t care who is talking through the box. &nbsp;I think those seeking those bits of profound knowledge, or secrets will get lead right down the rabbit hole.\n &lt;BR&gt;&nbsp;&lt;BR&gt;&nbsp;Frank-S&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;  &lt;HR&gt;  Peek-a-boo FREE Tricks Treats for You! &lt;A href=&quot;http://www.reallivemoms.com/?ocid=TXT_TAGHM&amp;loc=us&quot; target=_new&gt;Get &#39;em!&lt;/A&gt;   &lt;div&gt;&lt;/div&gt;&lt;/DIV&gt;&lt;!--End group email\n --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;\r\n--0-830060265-1194291470=:74215--"}