{"id": "2806", "subject": "Re: [EVP-ITC] they&#39;re rattin&#39; me out!", "author": "Lisby", "timestamp": "2007-11-05T21:34:15Z", "full_text": "Hey--I heard George Noory the other night saying he wants a box. I  \nget one before George! ;)\n\nBTW, I meant to comment to you on Chris on C2C--he sure was cagey,  \nFrank. I could not for the life of me figure out why he&#39;d make a  \nstatement like Tesla and Edison are duking it out in the  afterlife  \nto create the first telephone to the dead (which is going to make  \nanyone with a hint of skeptical nature roll their eyes and shake  \ntheir head. God knows, I did), then not answer some of the very  \nsimple questions he was asked about other issues that the spirits had  \ncommented on through the box. I completely agreed with the the  \ninvestigator who called and said he was being deceptive. He was. But  \nwhy? And why show up on C2C with no samples--not one. It was very  \nweird. In the first interview he did on C2C he was not hiding  \nanything, it seemed (and he had samples). You backed that up to me  \nearlier. He was basically telling the true story of how you met and  \nhow he got the box and what it had done up to that point. But he was  \nnot sharing with the class in the same way this time. What&#39;s changed?\n\nProfoundly\n\nAnn\n\n\nOn Nov 5, 2007, at 2:52 PM, Frank Sumption wrote:\n\n&gt;  I was trying to get at least one made ahead of time. I don&#39;t think  \n&gt; they care what I think about this stuff, as long as I keep working.  \n&gt; I wanted one that no one knew about =:-0\n&gt;\n&gt;  Oh yeah, I do have the Mothman book, video, and the A & E special  \n&gt; about the making of the Mothman Prophesies. I also read &quot;Messagers  \n&gt; of Deceptions&quot; by Vallee.\n&gt;\n&gt;  Frank-S\n&gt;\n&gt;\n&gt; Help yourself to FREE treats served up daily at the Messenger Café.  \n&gt; Stop by today!\n&gt;\n&gt; \n&gt; &lt;Want-PeopleToUse-That-newBox.mp3&gt;\n\n\nHey--I hea d Geo ge Noo y he o he nigh saying he wan s a box. I ge one be o e Geo ge! ;)BTW, I mean o commen o you on Ch is on C2C--he su e was cagey, F ank. I could no o he li e o me igu e ou why he'd make a s a emen like Tesla and Edison a e duking i ou in he  a e li e o c ea e he i s elephone o he dead (which is going o make anyone wi h a hin o skep ical na u e oll hei eyes and shake hei head. God knows, I did), hen no answe some o he e y simple ques ions he was asked abou o he issues ha he spi i s had commen ed on h ough he box. I comple ely ag eed wi h he he in es iga o who called and said he was being decep i e. He was. Bu why? And why show up on C2C wi h no samples--no one. I was e y wei d. In he i s in e iew he did on C2C he was no hiding any hing, i seemed (and he had samples). You backed ha up o me ea lie . He was basically elling he ue s o y o how you me and how he go he box and wha i had done up o ha poin . Bu he was no sha ing wi h he class in he same way his ime. Wha 's changed?P o oundlyAnnOn No 5, 2007, a 2:52 PM, F ank Sump ion w o e:  I was ying  o ge a leas one made ahead o ime. I don' hink hey ca e wha I hink abou his s u , as long as I keep wo king. I wan ed one ha no one knew abou =:-0    Oh yeah, I do ha e he Mo hman book, ideo, and he A & E special abou he making o he Mo hman P ophesies. I also ead \"Message s o Decep ions\" by Vallee.    F ank-SHelp you sel o FREE ea s se ed up daily a he Messenge Ca é. S op by oday!"}