{"id": "2834", "subject": "Re: [EVP-ITC] You tube?", "author": "Lisby", "timestamp": "2007-11-09T01:29:08Z", "full_text": "You don&#39;t scare me. Never have.\n\nI&#39;m tempted to add &quot;nyanyanyanyanya.&quot; :)\n\nAnn\n\n\nOn Nov 8, 2007, at 1:53 PM, Frank Sumption wrote:\n\n&gt; I don&#39;t don&#39;t know, I think I just scare everyone.\n&gt;\n&gt;\n&gt; To: evp-itc@yahoogroups.com\n&gt; From: paranormalinvestigating@...\n&gt; Date: Thu, 8 Nov 2007 11:42:31 -0500\n&gt; Subject: RE: [EVP-ITC] You tube?\n&gt;\n&gt; Frank,\n&gt;\n&gt; I&#39;ll check tou tube and let you know.\n&gt;\n&gt; and if your a poor teacher how come everyone listens to what you  \n&gt; have to say ?\n&gt;\n&gt; bruce\n&gt;\n&gt;\n&gt; Bruce Halliday\n&gt; Paranormal Investigating Team\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; To: evp-itc@yahoogroups.com\n&gt; From: franks-boxes@hotmail.com\n&gt; Date: Thu, 8 Nov 2007 08:51:46 -0700\n&gt; Subject: [EVP-ITC] You tube?\n&gt;\n&gt; Hi All;\n&gt;\n&gt;  I tried to post a couple box video&#39;s on you tube last night, they  \n&gt; should come up if you do a search on Ghost Box, Frank&#39;s box, ITC,  \n&gt; EVP, or paranormal, or maybe &quot;PurpleAlienGirl&quot; (user name). It&#39;s my  \n&gt; first attempt, so I&#39;m not sure if it worked, and it&#39;s blocked here  \n&gt; at work.\n&gt;\n&gt;  BTW, I&#39;m not sure if the Purple Princess stuff puts people off,  \n&gt; that&#39;s who my guys say I am, and I accept that as an axiom. As if  \n&gt; it matters, but that&#39;s an &quot;other level&quot; identity, and has little to  \n&gt; do with physical conditions. Purple is a treacher, that&#39;s all, I  \n&gt; just happen to be a very poor teacher.\n&gt;\n&gt;  Frank\n&gt;\n&gt; Climb to the top of the charts!  Play Star Shuffle:  the word  \n&gt; scramble challenge with star power. Play Now!\n&gt;\n&gt;\n&gt; Boo! Scare away worms, viruses and so much more! Try Windows Live  \n&gt; OneCare! Try now!\n&gt;\n&gt; Peek-a-boo FREE Tricks Treats for You! Get &#39;em!\n&gt;\n&gt; \n\n\nYou don' sca e me. Ne e ha e.I'm emp ed o add \"nyanyanyanyanya.\" :)AnnOn No 8, 2007, a 1:53 PM, F ank Sump ion w o e:I don' don' know, I hink I jus sca e e e yone.To: e p-i c@yahoog oups.comF om: pa ano malin es iga ing@ho mail.comDa e: Thu, 8 No 2007 11:42:31 -0500Subjec : RE: [EVP-ITC] You ube?F ank, I'll check ou ube and le you know. and i you a poo eache how come e e yone lis ens o wha you ha e o say ? b uceB uce Halliday Pa ano mal In es iga ing Team To: e p-i c@yahoog oups.comF om: anks-boxes@ho mail.comDa e: Thu, 8 No 2007 08:51:46 -0700Subjec : [EVP-ITC] You ube?Hi All;  I ied o pos a couple box ideo's on you ube las nigh , hey should come up i you do a sea ch on Ghos Box, F ank's box, ITC, EVP, o pa ano mal, o maybe \"Pu pleAlienGi l\" (use name). I 's my i s a emp , so I'm no su e i i wo ked, and i 's blocked he e a wo k.  BTW, I'm no su e i he Pu ple P incess s u pu s people o , ha 's who my guys say I am, and I accep ha as an axiom. As i  i ma e s, bu ha 's an \"o he le el\" iden i y, and has li le o do wi h physical condi ions. Pu ple is a eache , ha 's all, I jus happen o be a e y poo eache .  F ankClimb o he op o he cha s!  Play S a Shu le:  he wo d sc amble challenge wi h s a powe . Play Now! Boo! Sca e away wo ms, i uses and so much mo e! T y Windows Li e OneCa e! T y now! Peek-a-boo FREE T icks T ea s o You! Ge 'em!"}