{"id": "2844", "subject": "Re: You tube?", "author": "Steve Hultay", "timestamp": "2007-11-09T21:01:30Z", "full_text": "Frank, most don&#39;t understand what we are doing and you need to \nlighten up before you give yourself a stroke.  Let them do what they \nwant, some have a different approach than us.  There really is no \nright and wrong way to do anything, only different ideas from very \ndifferent people.\n\n-Steve H\n\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@...&gt; \nwrote:\n&gt;\n&gt; \n&gt;  I think I&#39;ll start making a distinction between the typical \nparanormal investigator moron, and ITC. The paranormal twits seem to \nhave no concept of what spirit acutally is, and how it&#39;s possible to \ncommunicate. I&#39;m tired to arguing with the idiots. I can&#39;t get past \ntheir huge egos to make teh point that it&#39;s not white noise, and \nspirits can travel. I just had another go round with one of Rosemary \nGuiley&#39;s friends, her tech, these people just can&#39;t hear what I&#39;m \ntrying to say.\n&gt; \n&gt;  \n&gt;  \n&gt;  Frank\n&gt;  \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: urkel23@...: Fri, 9 Nov 2007 20:09:23 \n+0000Subject: [EVP-ITC] Re: You tube?\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Paranormal Experts??? Is there such a thing, are we talking about \nthe field that has ideas and theories and no solid evidence of \nanything to back it up? It&#39;s like being an expert at something that \nyou can&#39;t prove exists in the first place. We would have a better \nshot of being an expert at picking the winning lottery numbers than \nproving to someone that an afterlife exists.-Steve H.--- In EVP-\nITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@&gt; wrote:&gt;&gt; &gt; Yeah, \nhe&#39;s got the grumpy attitude! I just wanted to get some audio and \nvideo out here so the average person could hear what it&#39;s supposed \nto sound like unfiltered by some paranormal expert. Unfrotunate that \nit&#39;ll probably create some demand. &gt; &gt; Frank&gt; &gt; &gt; To: EVP-ITC@: \nurkel23@: Fri, 9 Nov 2007 19:41:44 +0000Subject: [EVP-ITC] Re: You \ntube?&gt; &gt; &gt; &gt; &gt; I can see it now ---- E-True hollywood story: Frank \nSumption. I&#39;d know i&#39;d watch, maybe they can get russell crowe to \nplay you in it.-Steve H.--- In EVP-ITC@yahoogroups.com, Frank \nSumption &lt;franks-boxes@&gt; wrote:&gt;&gt; &gt; I get grumpy, and pissed. I try \nto share to information about the box, and it&#39;s the same friggin&#39; \narguement everytime. I&#39;m just now answering e-mails generated from \nthe mistake of leaving a comment on a site about how I think most of \nwhat passes for paranormal knowledge is Hollywood. I can&#39;t get past \nthat shit, nor can I get past the egos, so I give up, they can&#39;t \nhear me. &gt; &gt; I think the problem is intellect, it takes a certain \nlevel to be able to comprehend, and use the boxes, to everyone else \nits&#39; going to look fake, and sound like gibberish. &gt; &gt; &gt; Frank-S&gt; &gt; \n&gt; &gt; &gt; To: EVP-ITC@: lisby@: Thu, 8 Nov 2007 20:29:08 -0500Subject: \nRe: [EVP-ITC] You tube?&gt; &gt; &gt; &gt; &gt; You don&#39;t scare me. Never have. &gt; &gt; \nI&#39;m tempted to add &quot;nyanyanyanyanya.&quot; :)&gt; &gt; Ann&gt; &gt; &gt; &gt; On Nov 8, \n2007, at 1:53 PM, Frank Sumption wrote:&gt; &gt; &gt; &gt; &gt; I don&#39;t don&#39;t know, \nI think I just scare everyone.&gt; &gt; &gt; To: evp-itc@: \nparanormalinvestigating@: Thu, 8 Nov 2007 11:42:31 -0500Subject: RE: \n[EVP-ITC] You tube?&gt; &gt; &gt; Frank, I&#39;ll check tou tube and let you \nknow. and if your a poor teacher how come everyone listens to what \nyou have to say ? bruce&gt; &gt; Bruce Halliday Paranormal Investigating \nTeam &gt; &gt; &gt; To: evp-itc@: franks-boxes@: Thu, 8 Nov 2007 08:51:46 -\n0700Subject: [EVP-ITC] You tube?&gt; &gt; &gt; Hi All; I tried to post a \ncouple box video&#39;s on you tube last night, they should come up if \nyou do a search on Ghost Box, Frank&#39;s box, ITC, EVP, or paranormal, \nor maybe &quot;PurpleAlienGirl&quot; (user name). It&#39;s my first attempt, so \nI&#39;m not sure if it worked, and it&#39;s blocked here at work. BTW, I&#39;m \nnot sure if the Purple Princess stuff puts people off, that&#39;s who my \nguys say I am, and I accept that as an axiom. As if it matters, but \nthat&#39;s an &quot;other level&quot; identity, and has little to do with physical \nconditions. Purple is a treacher, that&#39;s all, I just happen to be a \nvery poor teacher. Frank&gt; &gt; Climb to the top of the charts! Play \nStar Shuffle: the word scramble challenge with star power. Play Now! \n&gt; &gt; Boo! Scare away worms, viruses and so much more! Try Windows \nLive OneCare! Try now! &gt; &gt; Peek-a-boo FREE Tricks Treats for You! \nGet &#39;em! &gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; \n__________________________________________________________&gt; Help \nyourself to FREE treats served up daily at the Messenger Caf. Stop \nby today.&gt; http://www.cafemessenger.com/info/info_sweetstuff2.html?\nocid=TXT_TAGLM_OctWLtagline&gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; \n__________________________________________________________&gt; Peek-a-\nboo FREE Tricks & Treats for You!&gt; http://www.reallivemoms.com?\nocid=TXT_TAGHM&loc=us&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Help yourself to FREE treats served up daily at the Messenger \nCaf. Stop by today.\n&gt; http://www.cafemessenger.com/info/info_sweetstuff2.html?\nocid=TXT_TAGLM_OctWLtagline\n&gt;"}