{"id": "2855", "subject": "Re: [EVP-ITC] what is happening to this group ?", "author": "Lisby", "timestamp": "2007-11-10T21:52:52Z", "full_text": "Bruce--is this in reference to something I&#39;m not seeing?\n\nI listen to every file posted, but a lot of the time I don&#39;t have  \nanything intelligent to say other than &quot;I hear it,&quot; or &quot;I don&#39;t.&quot; I  \nalso don&#39;t always listen until I have a group of items days later.  \nThat doesn&#39;t mean I don&#39;t listen or don&#39;t care.\n\n:)\n\nAnn\n\n\nOn Nov 10, 2007, at 12:09 PM, bhali333 wrote:\n\n&gt; This group has turned into a first grade class when the teacher leaves\n&gt; the room !\n&gt;\n&gt; It&#39;s supposed to be about a free exchange of idea&#39;s concerning evp-itc\n&gt; not a mud slinging forum or a research bashing arena.\n&gt;\n&gt; Frank, myself and Steve are continuously posting files and asking for\n&gt; feedback and for the last three months I have gotten maybe one or two\n&gt; responses to my posts and files and I don&#39;t think Steve has gotten  \n&gt; any.\n&gt; also it seems like the only reason everyone jumps to reply to a post\n&gt; that frank makes is because he is the man with the boxes, I know there\n&gt; will be a 100 posts now saying &quot;OH THATS NOT TRUE AT ALL&quot; but be truth\n&gt; full with yourselves and you will find that it is.\n&gt;\n&gt; I myself are guilty of that to a certain extent and I have a Frank&#39;s\n&gt; box already. lets all stop the bull and play nice. Let&#39;s try to  \n&gt; further\n&gt; the research and work together with positive feedback or CONSTRUCTIVE\n&gt; criticism, CONSTRUCTIVE being the key word.\n&gt;\n&gt; Bruce\n&gt;\n&gt;\n&gt; \n\n\nB uce--is his in e e ence o some hing I'm no seeing?I lis en o e e y ile pos ed, bu a lo o he ime I don' ha e any hing in elligen o say o he han \"I hea i ,\" o \"I don' .\" I also don' always lis en un il I ha e a g oup o i ems days la e . Tha doesn' mean I don' lis en o don' ca e.:)AnnOn No 10, 2007, a 12:09 PM, bhali333 w o e:This g oup has u ned in o a i s g ade class when he eache lea es he oom !I 's supposed o be abou a ee exchange o idea's conce ning e p-i cno a mud slinging o um o a esea ch bashing a ena.F ank, mysel and S e e a e con inuously pos ing iles and asking o eedback and o he las h ee mon hs I ha e go en maybe one o wo esponses o my pos s and iles and I don' hink S e e has go en any.also i seems like he only eason e e yone jumps o eply o a pos ha ank makes is because he is he man wi h he boxes, I know he e will be a 100 pos s now saying \"OH THATS NOT TRUE AT ALL\" bu be u h ull wi h you sel es and you will ind ha i is.I mysel a e guil y o ha o a ce ain ex en and I ha e a F ank's box al eady. le s all s op he bull and play nice. Le 's y o u he he esea ch and wo k oge he wi h posi i e eedback o CONSTRUCTIVE c i icism, CONSTRUCTIVE being he key wo d.B uce"}