{"id": "2870", "subject": "RE: [EVP-ITC] More on You tube.", "author": "RetroCom", "timestamp": "2007-11-11T16:20:22Z", "full_text": "----__Part.20071111082022.20D55C66\r\nContent-Type: text/plain; charset=&quot;UTF-8&quot;\r\n\r\nFrank, on your recent (long) video where you ask for your first name to be spoken I can hear a response. I enhanced this part a bit for clarity. I can hear\n&quot;Testing with Frank&quot;\n\nDave\n\n\n\nRE: [EVP-ITC] More on You tube. \n\n\n What kind of camcorder do you have?  Is there anyway to hook a mic up to it, or is that what you mean about not being able to put an audio input?  I&#39;ll try hooking my speakers up instead of using my headset and see if I can hear it louder.\nkeep posting them!  That is fascinating, I have never seen the boxes before!\n\nFrank Sumption &lt;franks-boxes@...&gt; wrote:\n\n That&#39;s as loud as I can get it without feedback. If I had a regular camcorder with an audio input it would come though better. I stil haven&#39;t gone to yiou tube to see the videos myself! Thanks for watching!!\n \n Frank-S\n\n\n\n--------------------------------------------------------------------------------\nTo: EVP-ITC@yahoogroups.com\nFrom: loneshewolf999@...\nDate: Sat, 10 Nov 2007 21:35:11 -0800\nSubject: Re: [EVP-ITC] More on You tube.\n\n\nI thought I heard it say Frank too.  Frank is there anyway you can turn up the volume of the box?  Maybe it&#39;s my headphones but it doesn&#39;t seem very loud on the videos?  I love it, thanks so much for sharing :)\n\nFrank Sumption &lt;franks-boxes@...&gt; wrote: \nHi all;\n \n Okay, finally got a video converter to work, so up loaded longer videos to you tube. There should be three from today. I&#39;m not usre if the largest one went through, it&#39;s only 6 minutes though. then another is aobut a minute, and the next about 20 seconds. I had to do multiples cuz the random mode wouldn&#39;t work for the first run. the purpose of the videos are to show the world waht the box is supposed to soudn like. I ask them to say my name, and they may have said Frank, but I could hear them say Princess a couple times. \n \n \n Frank-S\n\n\n--------------------------------------------------------------------------------\nBoo! Scare away worms, viruses and so much more! Try Windows Live OneCare! Try now! \n\n\r\n----__Part.20071111082022.20D55C66\r\nContent-Type: audio/mpeg; name=&quot;111107testingwithfrank.mp3&quot;\r\nContent-Disposition: attachment; filename=&quot;111107testingwithfrank.mp3&quot;\r\n\r\n[ Attachment content not displayed ]\r\n----__Part.20071111082022.20D55C66--"}