{"id": "2877", "subject": "Re: [EVP-ITC] I just posted 2 new evp&#39;s in the 11-11- 07 folder.", "author": "Lisby", "timestamp": "2007-11-11T19:58:36Z", "full_text": "Art and his new wife are living in Pahrump, Nevada, again. Pahrump is  \nright on the California state line at the Death Valley Junction area  \nof Death Valley, one of my favorite places in the world. I was there  \nin late September, myself. The Bells baby, Asia, was born in May, I  \nthink. He is broadcastin on C2C only rarely right now because he  \nwants to spend his time with the baby and his wife. He does fill in  \nfor George and does specials.\n\nAnn\n\n\nOn Nov 11, 2007, at 2:53 PM, Misty Dawn wrote:\n\n&gt;\n&gt; OHHHHHHH LOL, thanks for clearing something up in my head. I&#39;ll try  \n&gt; and vice versa that with this reply.\n&gt;\n&gt; I was listening to C2C not long ago and they were saying something  \n&gt; about Art&#39;s new baby&#39;s picture being up on the webcam so I went  \n&gt; there and saw little &quot;Parump&quot; and I am sitting there wondering hmmm  \n&gt; wonder if thats phillipines name or is its from little drummer boy  \n&gt; (parump a pum pum)\n&gt;\n&gt; Now I know where it came from, and you know what Art is up to.  \n&gt; Still trying to part time it from overseas at his new home with his  \n&gt; new wife and son, and said he was retiring but I dont think people  \n&gt; will allow him to do that. So for now I think he is mostly doing  \n&gt; occasional special interest shows, someone correct me if I am wrong  \n&gt; I dont get a chance to tune in every show LOL\n&gt;\n&gt; Misty\n&gt;\n&gt; David Hogan &lt;hoodoodave54@...&gt; wrote:\n&gt; 1 is parump, a town in nevada and home to art bell a former\n&gt; paranormal talk show host ( does anyone if art is still alive?) and\n&gt; the second is &quot; hi&quot; this came in just as i was thanking the voices for\n&gt; talking to me.\n&gt;\n&gt;\n&gt; __________________________________________________\n&gt; Do You Yahoo!?\n&gt; Tired of spam? Yahoo! Mail has the best spam protection around\n&gt; http://mail.yahoo.com\n&gt;\n&gt; \n\n\nA and his new wi e a e li ing in Pah ump, Ne ada, again. Pah ump is igh on he Cali o nia s a e line a he Dea h Valley Junc ion a ea o Dea h Valley, one o my a o i e places in he wo ld. I was he e in la e Sep embe , mysel . The Bells baby, Asia, was bo n in May, I hink. He is b oadcas in on C2C only a ely igh now because he wan s o spend his ime wi h he baby and his wi e. He does ill in o Geo ge and does specials. AnnOn No 11, 2007, a 2:53 PM, Mis y Dawn w o e:OHHHHHHH LOL, hanks o clea ing some hing up in my head. I'll y and ice e sa ha wi h his eply. I was lis ening o C2C no long ago and hey we e saying some hing abou A 's new baby's pic u e being up on he webcam so I wen he e and saw li le \"Pa ump\" and I am si ing he e wonde ing hmmm wonde i ha s phillipines name o is i s om li le d umme boy (pa ump a pum pum) Now I know whe e i came om, and you know wha A is up o. S ill ying o pa ime i om o e seas a his new home wi h his new wi e and son, and said he was e i ing bu I don hink people will allow him o do ha . So o now I hink he is mos ly doing occasional special in e es shows, someone co ec me i I am w ong I don ge a chance o une in e e y show LOL Mis yDa id Hogan yahoo.com> w o e:1 is pa ump, a own in ne ada and home o a bell a o me pa ano mal alk show hos ( does anyone i a is s ill ali e?) and he second is \" hi\" his came in jus as i was hanking he oices o alking o me.__________________________________________________Do You Yahoo!?Ti ed o spam? Yahoo! Mail has he bes spam p o ec ion a ound h p://mail.yahoo.com"}