{"id": "2934", "subject": "Re: [EVP-ITC] Sound Soap 2 Sweep", "author": "RetroCom", "timestamp": "2007-11-14T00:25:03Z", "full_text": "----__Part.20071113162503.D9F6F2E7\r\nContent-Type: text/plain; charset=&quot;UTF-8&quot;\r\n\r\nThis was from the same session. There was some chatter prior about calculations and the perhaps the number 5000 or 3000. \n&quot;According to the calculus people ..want nothing but calculated bull shit&quot;\n\nNot sure what it all about but it was one of the clearer messages.\nDave\n\n--- vfp19968@... wrote:\n\nFrom: &quot; RetroCom&quot; &lt;vfp19968@...&gt;\nTo: &lt;EVP-ITC@yahoogroups.com&gt;\nSubject: Re: [EVP-ITC] Sound Soap 2 Sweep\nDate: Tue, 13 Nov 2007 09:50:08 -0800\n\nI&#39;ll post a few more examples from these sessions when I get home from work. I do not know who the speaker is, I do get many technical people speaking however they rarely use a name. Chicago is one of many &#39;stations&#39; in their network. In the last year I have heard test messages from Chicago, Madison WI, Hamilton Canada, New York, London and the Yukon. London seems to be the most active for me. As far as the content I believe they are testing a Tesla design or device, the Edison remark at the end caught me off guard. The only historic connection I know of with Tesla and Chicago would have been his fantastic exibit at the Columbian Exposition near the turn of last century.\nI believe SoundSoap 2 is available for a Mac, you can google it. The company who makes it is Bias. Keep in mind after reading this, I believe there are many ways the other side can communicate with us, this is just one example. \n\nDave\n\n--- lisby@... wrote:\n\nFrom: Lisby &lt;lisby@...&gt;\nTo: EVP-ITC@yahoogroups.com\nSubject: Re: [EVP-ITC] Sound Soap 2 Sweep\nDate: Tue, 13 Nov 2007 11:17:23 -0500\n\nDave, first up--I hear that completely clearly. I also hear a voice  \nwith a distinctive early 20th century American accent. I always  \nlisten for historic accents that that is absolutely one.\n\nWho do you think the speaker is? What does Chicago have to do with  \nthe message? How do you personally interpret it?\n\nTech: Can I use something like this on a Mac system?\n\nAnn\nDamned curious\n\n\nOn Nov 13, 2007, at 6:37 AM, RetroCom wrote:\n\n&gt; Trying a new technique on th computer using editing software called  \n&gt; Sound Soap 2. I discovered a way to do a manual forward/reverse  \n&gt; sweep of any audio file. Here is an example from last night. The  \n&gt; effect is somewhat like EVP maker and exibits some layering.\n&gt; &quot;I&#39;m down in Chicago on Tesla&#39;s device alive!...Edison, should  \n&gt; never meddle&quot;\n&gt;\n&gt; Dave\n&gt;\n&gt; \n&gt; &lt;111207teslaedisonchatterfiltered.mp3&gt;\n\n\n\n\n\n\r\n----__Part.20071113162503.D9F6F2E7\r\nContent-Type: audio/mpeg; name=&quot;111207calculuspeople.mp3&quot;\r\nContent-Disposition: attachment; filename=&quot;111207calculuspeople.mp3&quot;\r\n\r\n[ Attachment content not displayed ]\r\n----__Part.20071113162503.D9F6F2E7--"}