{"id": "2968", "subject": "Re: The Anual Stanley party.", "author": "psi_research", "timestamp": "2007-11-15T04:04:12Z", "full_text": "Actually there was a backlash against the self-proclaimed expert last\nyear. In fact, the result of that event was I don&#39;t think that\nindividual will show up any of this particular organizers events\nagain. There is a real interest in your research though. \n\n\n--- In EVP-ITC@yahoogroups.com, &quot;judy_in_hollywood&quot;\n&lt;Ticket_to_Heaven@...&gt; wrote:\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@&gt; \n&gt; wrote:\n&gt; &gt;\n&gt; &gt; \n&gt; &gt;  Every year I guess, there a \n&gt; conference/gathering/investigation/party at the Stanley Motel here. \n&gt; More box user/makers are going this year. These investigators are \n&gt; such paranormal experts that they consitently ignore what the \n&gt; inventor of the box says. I made the damn thing, it works, I \n&gt; obvioulsy know how it works and how to make it, yet they ignore what \n&gt; I say. That&#39;s this weekend, BTW. \n&gt; &gt;  \n&gt; &gt;  If the boxes, both mine and ones made by others worked for these \n&gt; people you&#39;d see the voices posted everywhere on the web, instead the \n&gt; you get &quot;oh, we had to send that off to be anayzed&quot;, what a crock! \n&gt; All these people are doing is trying to jump on Moon&#39;s bandwagon. \n&gt; &gt;  \n&gt; &gt;  Perhaps Moon&#39;s statement on his site that I don&#39;t with any groups \n&gt; was pre-cognitive. I think that&#39;s a good idea. These \n&gt; groups/investigators tend to have preconcieved ideas about what the \n&gt; evidence consists of, and ignore anything that doesn&#39;t fit into that. \n&gt; Yeah, that&#39;s scientific all to hell.\n&gt; &gt;  \n&gt; &gt;  Frank-S\n&gt; &gt;  \n&gt; &gt;  \n&gt; &gt; _________________________________________________________________\n&gt; &gt; Climb to the top of the charts!  Play Star Shuffle:  the word \n&gt; scramble challenge with star power.\n&gt; &gt; http://club.live.com/star_shuffle.aspx?\n&gt; icid=starshuffle_wlmailtextlink_oct\n&gt; &gt;\n&gt;  - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\n&gt;    Hi Frank & All, Perhaphs these Paranormal Investigators (some with \n&gt; many books they&#39;ve written, too) are the wrong types of -&quot;Experts&quot;- \n&gt; people to have or use the boxes (for their own benifits, too)? It \n&gt; seems someone who&#39;d be dedicated in doing their own &quot;independant&quot; \n&gt; Research then writting about it or doing Low-Cost demos. of the box \n&gt; (now & then) would be a better way to go with these boxes  . . . and \n&gt; of course the 1st thing to mention is WHO the maker IS; Mr. Frank \n&gt; Sumption!!!  My 2c worth, here!     =Judy=  P.S. I look at what other \n&gt; Pioneers have done with EVP&#39;s & ITC&#39;s!!!\n&gt;"}