{"id": "2982", "subject": "Re: [EVP-ITC] Oh Bruce...", "author": "Zack Widup", "timestamp": "2007-11-15T18:42:54Z", "full_text": "Hi Juli,\n\nGood to see you here!\n\nFrank has graciously provided the schematics and other data for building \none.  He also gave some info on modifications recently.  We were \ndiscussing making a circuit board that uses small surface-mount parts. I \ncan make boards that are far cheaper than ExpressPCB.\n\nAdjusting them is another matter. I have some of this work planned as \n&quot;winter projects&quot; when I can&#39;t get outside and do things. I am guessing \nlearning how to adjust them properly is hard-won experience.\n\nI do agree they should not just be given to someone who has no idea how to \nuse them. If I end up being able to make the boards easily, it would be \njust for this group. I wouldn&#39;t make any money at it, either.\n\nZack\n\nOn Thu, 15 Nov 2007, juli velazquez wrote:\n\n&gt; I agree!  I rarely post, but as I just wrote Frank under separate cover, it is all about respect!\n&gt;  Respect for Frank, respect for the unknown, and the pure intentions that must go along with the right of ownership!\n&gt;\n&gt;  I could have had a box build long ago, but I can honestly tell you that if it didn&#39;t come under Franks direction, or the directions of the guilds, then to me I shouldn&#39;t have one.\n&gt;\n&gt;  See what the others fail to see is the true mean of messages conveyed from these devises.  For the unknown to correspond these messages are of great importance, and not all people can not understand the depth in the meanings.  I can only hope that they do not work for those who are not worthy, and that those who shall come in possession who are sincere will utilize it in all position manners never expecting personal gain!\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Frank Ratka &lt;warrior18eii@...&gt; wrote:\n&gt;              I realize the time it takes to put things together. Especially units built from the ground up but if you are taking on the duty of spreading the technology to help mankind, to me it would be a labor of love. I can see and accept recovering production costs even, but this guy is looking to make a huge profit.\n&gt;\n&gt; You gained your respect and credibility on the fact that you have a system that works and you are willing to give it away when you didn&#39;t have to Frank. This guy is coming out of the gate with a cheap imitation of EVP maker and your system (both of which are free) and putting a huge price tag on it. It just don&#39;t sit right with me!\n&gt;\n&gt; Honestly, I know it is none of my business what Ron does but I guess I just needed to register my protest with this seemingly blatant attempt at exploiting good though naive people.\n&gt;\n&gt; Regards,\n&gt;\n&gt; Frank R.\n&gt;"}