{"id": "2989", "subject": "Re: [EVP-ITC] my opinion on the mini box", "author": "juli velazquez", "timestamp": "2007-11-15T20:47:47Z", "full_text": "--0-93823655-1195159667=:19787\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nHere, here Bruce.  I am glad others who a genuine support my outlook, I couldn&#39;t agree more!\n\nbhali333 &lt;paranormalinvestigating@...&gt; wrote:          since I dropped the bomb about this mini box to Frank s. yesterday I \ndid not expect such a fervent hoopla about it.So I will give my box \nexperienced opinion after lengthy research with both Frank&#39;s and \nJoe&#39;s boxes. I have contacted the manufacturer for an explanation, he \ninstructed me to listen to the audio file and view the demo video on \nhis site. After doing so my opinion on this box and the builders \nintentions for it is.\n\nThe box itself is not a knock off of Frank&#39;s box but a cheap and \nineffective version of Joe&#39;s box,It works on an AM band instead of an \nFM band as Joe&#39;s box does. Another big difference is Joe&#39;s box \nactually works and you have all heard the files I have posted from \nsessions with it. After listening to this box and seeing it in \noperation I feel that anyone who purchases this box will be very \ndisappointed and will not receive any contact from it and even if \nthey did they probably would not even realise it for the simple fact \nthat you have to have a certain amount of experience with box \nresearch and operation before developing an ear for picking up real \ntime communication and also creating a bond with the spirit friends \non the other side and also a measure of trust on both sides.\n\nI believe the manufacturer to be a capitalist and only interested in \nthe monetary reward to be gained from offering this cheap and \nineffective copy to unsuspecting and naive individuals who are \ninterested in this medium. I do not like to bad mouth anyone, it \nusually comes back to bite you in the ass but I believe that our \nfriends on the other side know of our intentions and would not allow \nsomeone with the wrong intentions to develop a working tool for \ncommunication. also I believe that a person does not pick the box the \nbox picks the person. \n\nSo let him have his short and lucrative run with this fooling \nunsuspecting clients, bad karma always comes home.\n\nBruce\n\n\n\n                         \n\n\n  The contents of this eletronic correspondence is private & confidential and meant only for the party and/or parties it is addressed to.  \n   \n  No part of this email transmission may be publicly posted or forwarded to other parties without explicit written permission.\n\n\r\n--0-93823655-1195159667=:19787\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nHere, here Bruce.&nbsp; I am glad others who a genuine support my outlook, I couldn&#39;t agree more!&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;bhali333 &lt;paranormalinvestigating@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;div&gt;since I dropped the bomb about this mini box to Frank s. yesterday I &lt;BR&gt;did not expect such a fervent hoopla about it.So I will give my box &lt;BR&gt;experienced opinion after lengthy research with both Frank&#39;s and &lt;BR&gt;Joe&#39;s boxes. I have contacted the manufacturer for an explanation, he &lt;BR&gt;instructed me to listen to the audio file and view the demo video on &lt;BR&gt;his site. After doing so my opinion on this\n box and the builders &lt;BR&gt;intentions for it is.&lt;BR&gt;&lt;BR&gt;The box itself is not a knock off of Frank&#39;s box but a cheap and &lt;BR&gt;ineffective version of Joe&#39;s box,It works on an AM band instead of an &lt;BR&gt;FM band as Joe&#39;s box does. Another big difference is Joe&#39;s box &lt;BR&gt;actually works and you have all heard the files I have posted from &lt;BR&gt;sessions with it. After listening to this box and seeing it in &lt;BR&gt;operation I feel that anyone who purchases this box will be very &lt;BR&gt;disappointed and will not receive any contact from it and even if &lt;BR&gt;they did they probably would not even realise it for the simple fact &lt;BR&gt;that you have to have a certain amount of experience with box &lt;BR&gt;research and operation before developing an ear for picking up real &lt;BR&gt;time communication and also creating a bond with the spirit friends &lt;BR&gt;on the other side and also a measure of trust on both sides.&lt;BR&gt;&lt;BR&gt;I believe the manufacturer to be a capitalist and only interested in &lt;BR&gt;the monetary reward to\n be gained from offering this cheap and &lt;BR&gt;ineffective copy to unsuspecting and naive individuals who are &lt;BR&gt;interested in this medium. I do not like to bad mouth anyone, it &lt;BR&gt;usually comes back to bite you in the ass but I believe that our &lt;BR&gt;friends on the other side know of our intentions and would not allow &lt;BR&gt;someone with the wrong intentions to develop a working tool for &lt;BR&gt;communication. also I believe that a person does not pick the box the &lt;BR&gt;box picks the person. &lt;BR&gt;&lt;BR&gt;So let him have his short and lucrative run with this fooling &lt;BR&gt;unsuspecting clients, bad karma always comes home.&lt;BR&gt;&lt;BR&gt;Bruce&lt;BR&gt;&lt;BR&gt;&lt;/div&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;&lt;DIV&gt;  &lt;div&gt;&lt;EM&gt;&lt;STRONG&gt;&lt;FONT color=#0000ff&gt;The contents of this eletronic correspondence is private &amp; confidential and meant only for the party and/or parties it is addressed to.&nbsp; &lt;/FONT&gt;&lt;/STRONG&gt;&lt;/EM&gt;&lt;/div&gt;  &lt;div&gt;&lt;EM&gt;&lt;STRONG&gt;&lt;FONT\n color=#0000ff&gt;&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/EM&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;&lt;EM&gt;&lt;STRONG&gt;&lt;FONT color=#0000ff&gt;No part of this email transmission may be publicly posted or forwarded to other parties without explicit written permission.&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/EM&gt;&lt;/div&gt;&lt;/DIV&gt;\r\n--0-93823655-1195159667=:19787--"}