{"id": "2998", "subject": "RE: [EVP-ITC] my opinion on the mini box", "author": "erick hunter", "timestamp": "2007-11-15T23:42:06Z", "full_text": "--0-186860147-1195170126=:65849\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nBruce,  the boxes aside,  I am talking about Ghosts, period.  The boxes are for simple communication,  not inter-acting.  When I say &quot;inter-acting&quot; I don&#39;t mean trade a few words,  I&#39;m referring to Meaningful interaction.  Making a Statement,  passing on a message to me or a living relative,  predicting or causing &quot;physical&quot; inferances.   I&#39;ve experienced every kind of Ghost,  I feel certain,  all over the world.  I have experience with them that most people just dream about...or fear.  I have been carressed,  molested,  poked,  probed,  slapped,  punched,  knocked down and physically Picked Up by a Ghost.  I have confronted them face-to-face while they were both visible and invisable.  I have numerous times held conversations with them via voice recorder and once even one-on-one (it was the experience of a life-time!).  I was Hunting Ghosts many, many years before it became a fad,  or cool to do so.  And,  believe me,  I am far from being an &quot;expert&quot;.  I do not presume on\n Ghosts or their personalities.  Every time in the past that I&#39;ve done so,  I&#39;ve been rocked back on my heels,  psychologically speaking. Some are good,  some are not.  Many of them very much enjoy making you the fool (that&#39;s a lot easier done with some people than are others!) .  \nIt doesn&#39;t matter in the slightest what you Think of them,  They are what they are,  and &quot;being a friend&quot; is definitely not on their list of priorities!  That goes for All of them.  They will play with you.  They will lie to you.  They will tell, or imply to you, what they know you want to hear,  that or they will laugh at you.  I have personally heard their laughter,  on more than one occasion.  The first step in beginning to understand Ghosts is to quit watching stupid TV Ghost Dramas,  and learn to be discernful about Reality.  God bless, anyway.        --Rod\n   \n   \n   \n   \n  \nbruce halliday &lt;paranormalinvestigating@...&gt; wrote:\n          Rod,\n \nNo disrespect but how do you know what ghosts have\nthe where with all to do? I speak with them through frank and joe&#39;s box on a daily basis and consider the\ntwo that are communicating daily to be friends. I believe you are speaking of grounded spirits not etherals \nand ghosts that are grounded most definately interact with us. residual ghosts and hauntings do not that is why\nthere is a distinction between the two intelligent and residual hauntings. but we are not talking generaly about \nhaunting spirits that communicate through frank and joe&#39;s boxes, but all types of entities and don&#39;t call anyone \ndillusional unless you yourself have experienced your own research with the boxes.\n \nBruce\n\n\n \n    Bruce Halliday \nParanormal Investigating Team \n\n\n\n\n    \n---------------------------------\n  To: EVP-ITC@yahoogroups.com\nFrom: erick_hunter9@...\nDate: Thu, 15 Nov 2007 14:18:55 -0800\nSubject: Re: [EVP-ITC] my opinion on the mini box\n\n        I certainly agree with the point of Bruces&#39; statement,  but I fear he&#39;s being delusional about &quot;friends&quot; from the other side affecting some inter-action between a box and the user,  not letting one work,  the box chosing it&#39;s owner,  etc., etc., etc.  In the first place Ghosts are Not our Friends!  That&#39;s pure, unadulterated Fantasy.\n  The Ghosts do not have the where-with-all to accomplish this in the first place, and even if they did they don&#39;t give a rats&#39; rear end what a Ghost Hunter does or doesn&#39;t do.  That boy really needs to get real.  Ghosts simply do not re-act to the living in that way, or much of any other way except to allow us to see or hear them and then only when they want it to happen.  Their most obvious and biggest trait is to be totally indifferent to our wishes.   Over 40 yrs. of Investigating the Paranormal has taught me nothing if it hasn&#39;t taught me this.      --Rod\n   \n   \n   velazquez &lt;ghostchasingfool@...&gt; wrote:\n      Here, here Bruce.  I am glad others who a genuine support my outlook, I couldn&#39;t agree more!\n\nbhali333 &lt;paranormalinvestigating@...&gt; wrote:       since I dropped the bomb about this mini box to Frank s. yesterday I \ndid not expect such a fervent hoopla about it.So I will give my box \nexperienced opinion after lengthy research with both Frank&#39;s and \nJoe&#39;s boxes. I have contacted the manufacturer for an explanation, he \ninstructed me to listen to the audio file and view the demo video on \nhis site. After doing so my opinion on this box and the builders \nintentions for it is.\n\nThe box itself is not a knock off of Frank&#39;s box but a cheap and \nineffective version of Joe&#39;s box,It works on an AM band instead of an \nFM band as Joe&#39;s box does. Another big difference is Joe&#39;s box \nactually works and you have all heard the files I have posted from \nsessions with it. After listening to this box and seeing it in \noperation I feel that anyone who purchases this box will be very \ndisappointed and will not receive any contact from it and even if \nthey did they probably would not even realise it for the simple fact \nthat you have to have a certain amount of experience with box \nresearch and operation before developing an ear for picking up real \ntime communication and also creating a bond with the spirit friends \non the other side and also a measure of trust on both sides.\n\nI believe the manufacturer to be a capitalist and only interested in \nthe monetary reward to be gained from offering this cheap and \nineffective copy to unsuspecting and naive individuals who are \ninterested in this medium. I do not like to bad mouth anyone, it \nusually comes back to bite you in the ass but I believe that our \nfriends on the other side know of our intentions and would not allow \nsomeone with the wrong intentions to develop a working tool for \ncommunication. also I believe that a person does not pick the box the \nbox picks the person. \n\nSo let him have his short and lucrative run with this fooling \nunsuspecting clients, bad karma always comes home.\n\nBruce\n\n\n\n\n\n\n    The contents of this eletronic correspondence is private & confidential and meant only for the party and/or parties it is addressed to.  \n   \n  No part of this email transmission may be publicly posted or forwarded to other parties without explicit written permission.\n\n  \n\n\n\n  \n\n\n\n\n\n  \n---------------------------------\n  Boo! Scare away worms, viruses and so much more! Try Windows Live OneCare! Try now!   \n\n                         \n\r\n--0-186860147-1195170126=:65849\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;div&gt;&lt;STRONG&gt;Bruce,&nbsp; the boxes aside,&nbsp; I am talking about Ghosts, period.&nbsp; The boxes are for simple communication,&nbsp; not inter-acting.&nbsp; When I say &quot;inter-acting&quot; I don&#39;t mean trade a few words,&nbsp; I&#39;m referring to &lt;EM&gt;Meaningful&lt;/EM&gt; interaction.&nbsp; Making a &lt;EM&gt;Statement&lt;/EM&gt;,&nbsp; passing on a message to me or a living relative,&nbsp; predicting or causing &quot;physical&quot; inferances.&nbsp;&nbsp;&nbsp;I&#39;ve experienced every kind of Ghost,&nbsp; I feel certain,&nbsp; all over the world.&nbsp; I have experience with them that most people just dream about...or fear.&nbsp; I have been carressed,&nbsp; molested, &nbsp;poked,&nbsp; probed,&nbsp; slapped,&nbsp; punched,&nbsp; knocked down and physically&nbsp;&lt;EM&gt;Picked Up&lt;/EM&gt;&nbsp;by a&nbsp;Ghost.&nbsp; I have confronted them face-to-face while they were both visible and invisable.&nbsp; I have numerous times held conversations with them via voice recorder and once even one-on-one (it was the experience\n of a life-time!).&nbsp; I was Hunting Ghosts many, many&nbsp;years before it became a fad,&nbsp; or cool&nbsp;to do so.&nbsp; And,&nbsp; believe me,&nbsp; I am far from being an &quot;expert&quot;.&nbsp; I do not presume on Ghosts or their personalities.&nbsp; Every time in the past that I&#39;ve done so,&nbsp; I&#39;ve been rocked back on my heels,&nbsp; psychologically speaking. Some are good,&nbsp; some are not.&nbsp; Many of them very much enjoy making you the fool (that&#39;s a lot easier done&nbsp;with some people than are&nbsp;others!)&nbsp;.&nbsp;&nbsp;&lt;/STRONG&gt;&lt;BR&gt;&lt;STRONG&gt;It doesn&#39;t matter in the slightest &lt;EM&gt;what you Think of them,&lt;/EM&gt;&nbsp; They are what they are,&nbsp; and &quot;being a friend&quot; is definitely not on their list of priorities!&nbsp; That goes for &lt;EM&gt;All &lt;/EM&gt;of them.&nbsp; They will play with you.&nbsp; They will lie to you.&nbsp; They will tell, or imply to&nbsp;you, what they know you want to hear,&nbsp; that or they will laugh at you.&nbsp; I have\n personally&nbsp;heard their laughter,&nbsp; on more than one occasion.&nbsp; The first step in beginning to understand Ghosts is to quit watching stupid&nbsp;TV Ghost Dramas,&nbsp; and learn to be discernful about &lt;EM&gt;Reality&lt;/EM&gt;.&nbsp; God bless, anyway.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; --Rod&lt;/STRONG&gt;&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;bruce halliday &lt;paranormalinvestigating@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/div&gt;  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;div&gt;Rod,&lt;BR&gt;&nbsp;&lt;BR&gt;No disrespect but how do you know what ghosts have&lt;BR&gt;the where with all\n to do? I speak with them through frank and joe&#39;s box on a daily basis and consider the&lt;BR&gt;two that are communicating daily to be friends. I believe you are speaking of grounded spirits not etherals &lt;BR&gt;and ghosts that are grounded most definately interact with us. residual ghosts and hauntings do not that is why&lt;BR&gt;there is a distinction between the two intelligent and residual hauntings. but we are not talking generaly about &lt;BR&gt;haunting spirits that communicate through frank and joe&#39;s boxes, but all types of entities and don&#39;t call anyone &lt;BR&gt;dillusional unless you yourself have experienced your own research with the boxes.&lt;BR&gt;&nbsp;&lt;BR&gt;Bruce&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;&nbsp;&lt;BR&gt;  &lt;DIV&gt;  &lt;div align=center&gt;&lt;FONT size=4&gt;&lt;FONT color=#0033cc&gt;&lt;STRONG&gt;&lt;EM&gt;&lt;FONT face=&quot;&quot; color=#000000 size=5&gt;Bruce Halliday &lt;BR&gt;&lt;/FONT&gt;&lt;/EM&gt;&lt;FONT color=#000000&gt;Paranormal Investigating Team &lt;/FONT&gt;&lt;/STRONG&gt;&lt;BR&gt;&lt;A href=&quot;http://free-paranormalinvestigating.com/%3C/div%3E%3C/div%3E%3Cp%20/%3E%3Cdiv%20class=&quot;\n target=_blank&gt;&lt;/div&gt;&lt;/FONT&gt;&lt;/FONT&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;BR&gt;  &lt;BLOCKQUOTE&gt;  &lt;HR id=EC_stopSpelling&gt;  To: EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;BR&gt;From: erick_hunter9@&lt;WBR&gt;yahoo.com&lt;BR&gt;Date: Thu, 15 Nov 2007 14:18:55 -0800&lt;BR&gt;Subject: Re: [EVP-ITC] my opinion on the mini box&lt;BR&gt;&lt;BR&gt;  &lt;DIV id=EC_ygrp-mlmsg&gt;  &lt;DIV id=EC_ygrp-msg&gt;  &lt;DIV id=EC_ygrp-text&gt;  &lt;DIV&gt;&lt;STRONG&gt;I certainly agree with the point of Bruces&#39; statement,&nbsp; but I fear he&#39;s being delusional about &quot;friends&quot; from&nbsp;the other side affecting some inter-action between a box and the user,&nbsp; not letting one work,&nbsp; the box chosing it&#39;s owner,&nbsp; etc., etc., etc.&nbsp; In the first place Ghosts are &lt;EM&gt;Not &lt;/EM&gt;our &lt;EM&gt;Friends!&nbsp; That&#39;s pure, unadulterated Fantasy.&lt;/EM&gt;&lt;/STRONG&gt;&lt;/DIV&gt;  &lt;DIV&gt;&lt;STRONG&gt;The Ghosts do not have the where-with-all to accomplish this in the first place, and even&nbsp;if they did they&nbsp;don&#39;t give a rats&#39; rear end what a Ghost Hunter does or doesn&#39;t do.&nbsp; That boy really needs to get\n real.&nbsp; Ghosts simply do not re-act to the living in that way, or much of any other way except to allow us to see or hear them and then only when they want it to happen.&nbsp; Their most obvious and&nbsp;biggest trait is to be totally indifferent to our wishes.&lt;/STRONG&gt;&nbsp;&nbsp; &lt;STRONG&gt;Over 40 yrs. of Investigating the Paranormal has taught me nothing if it hasn&#39;t taught me this.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; --Rod&lt;/STRONG&gt;&lt;/DIV&gt;  &lt;DIV&gt;&lt;B&gt;&lt;I&gt;&lt;/I&gt;&lt;/B&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;&lt;B&gt;&lt;I&gt;&lt;/I&gt;&lt;/B&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;&lt;B&gt;&lt;I&gt;&nbsp;velazquez &lt;ghostchasingfool@&lt;WBR&gt;yahoo.com&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/DIV&gt;  &lt;BLOCKQUOTE class=EC_replbq style=&quot;BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=EC_ygrp-text&gt;  &lt;DIV&gt;Here, here Bruce.&nbsp; I am glad others who a genuine support my outlook, I couldn&#39;t agree more!&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;bhali333 &lt;paranormalinvestiga&lt;WBR&gt;ting@hotmail.&lt;WBR&gt;com&gt;&lt;/I&gt;&lt;/B&gt; wrote:   &lt;BLOCKQUOTE class=EC_replbq style=&quot;BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=EC_ygrp-text&gt; \n &lt;DIV&gt;since I dropped the bomb about this mini box to Frank s. yesterday I &lt;BR&gt;did not expect such a fervent hoopla about it.So I will give my box &lt;BR&gt;experienced opinion after lengthy research with both Frank&#39;s and &lt;BR&gt;Joe&#39;s boxes. I have contacted the manufacturer for an explanation, he &lt;BR&gt;instructed me to listen to the audio file and view the demo video on &lt;BR&gt;his site. After doing so my opinion on this box and the builders &lt;BR&gt;intentions for it is.&lt;BR&gt;&lt;BR&gt;The box itself is not a knock off of Frank&#39;s box but a cheap and &lt;BR&gt;ineffective version of Joe&#39;s box,It works on an AM band instead of an &lt;BR&gt;FM band as Joe&#39;s box does. Another big difference is Joe&#39;s box &lt;BR&gt;actually works and you have all heard the files I have posted from &lt;BR&gt;sessions with it. After listening to this box and seeing it in &lt;BR&gt;operation I feel that anyone who purchases this box will be very &lt;BR&gt;disappointed and will not receive any contact from it and even if &lt;BR&gt;they did they probably would not\n even realise it for the simple fact &lt;BR&gt;that you have to have a certain amount of experience with box &lt;BR&gt;research and operation before developing an ear for picking up real &lt;BR&gt;time communication and also creating a bond with the spirit friends &lt;BR&gt;on the other side and also a measure of trust on both sides.&lt;BR&gt;&lt;BR&gt;I believe the manufacturer to be a capitalist and only interested in &lt;BR&gt;the monetary reward to be gained from offering this cheap and &lt;BR&gt;ineffective copy to unsuspecting and naive individuals who are &lt;BR&gt;interested in this medium. I do not like to bad mouth anyone, it &lt;BR&gt;usually comes back to bite you in the ass but I believe that our &lt;BR&gt;friends on the other side know of our intentions and would not allow &lt;BR&gt;someone with the wrong intentions to develop a working tool for &lt;BR&gt;communication. also I believe that a person does not pick the box the &lt;BR&gt;box picks the person. &lt;BR&gt;&lt;BR&gt;So let him have his short and lucrative run with this fooling &lt;BR&gt;unsuspecting\n clients, bad karma always comes home.&lt;BR&gt;&lt;BR&gt;Bruce&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;  &lt;DIV&gt;  &lt;DIV&gt;&lt;EM&gt;&lt;STRONG&gt;&lt;FONT color=#0000ff&gt;The contents of this eletronic correspondence is private &amp; confidential and meant only for the party and/or parties it is addressed to.&nbsp; &lt;/FONT&gt;&lt;/STRONG&gt;&lt;/EM&gt;&lt;/DIV&gt;  &lt;DIV&gt;&lt;EM&gt;&lt;STRONG&gt;&lt;FONT color=#0000ff&gt;&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/EM&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;&lt;EM&gt;&lt;STRONG&gt;&lt;FONT color=#0000ff&gt;No part of this email transmission may be publicly posted or forwarded to other parties without explicit written permission.&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/EM&gt;&lt;/DIV&gt;&lt;/DIV&gt;  &lt;DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;  &lt;div&gt;&lt;BR&gt;&lt;/div&gt;&lt;/DIV&gt;&lt;SPAN style=&quot;COLOR: white&quot;&gt;&lt;/SPAN&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;  &lt;HR&gt;  Boo!&nbsp;Scare away worms, viruses and so much more! Try Windows Live OneCare! &lt;A href=&quot;http://onecare.live.com/standard/en-us/purchase/trial.aspx?s_cid=wl_hotmailnews&quot; target=_new&gt;Try now!&lt;/A&gt;   &lt;div&gt;&lt;/div&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;\r\n--0-186860147-1195170126=:65849--"}