{"id": "3000", "subject": "Re: [EVP-ITC] Oh Bruce...(yeah someone listened)", "author": "Lisby", "timestamp": "2007-11-16T00:35:24Z", "full_text": "I always listen to them.\n\nAre Mike and Lisa people you knew in life?\n\n\nOn Nov 15, 2007, at 8:28 AM, bruce halliday wrote:\n\n&gt; Lisby,\n&gt;\n&gt; It&#39;s funny that you were the only person to reply to the files I  \n&gt; posted.\n&gt;\n&gt; The more research I do the more of a relationship I build with the  \n&gt; spirits that speak with me\n&gt; on a daily basis. it is always the same two, Mike and Lisa .  \n&gt; sometimes there is a third but he never\n&gt; gives his name. Frank&#39;s box #12 is a very good box it has am random  \n&gt; and linear also FM linear sweeps\n&gt; so you have a variety of options. I don&#39;t have the best radio  \n&gt; signal in my area but I&#39;m trying\n&gt; different things and it seems to be getting better. The box  \n&gt; generates a little more noise than usual\n&gt; but it is an older box and that is to be expected. I get about a  \n&gt; 25% rate of hearing responses and messages in real time\n&gt;\n&gt; as I receive them I will surely post them as I have been doing all  \n&gt; along only no one seems to care unless Frank\n&gt; says or posts something. It&#39;s nice to know someone listened.\n&gt;\n&gt; thanks\n&gt; Bruce\n&gt;\n&gt;\n&gt;\n&gt; Bruce Halliday\n&gt; Paranormal Investigating Team\n&gt;\n&gt;\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; From: lisby@...\n&gt; Date: Wed, 14 Nov 2007 20:42:12 -0500\n&gt; Subject: [EVP-ITC] Oh Bruce...\n&gt;\n&gt; The extreme wonderfulness of these new EVP clips from the box lies in\n&gt; their sheer normalcy. When Mike answered your greeting with\n&gt; &quot;Whatzup?&quot; I actually started crying. This is what I have been hoping\n&gt; for all my life. Please, please, send more as they come in. I&#39;m\n&gt; living vicariously through you.\n&gt;\n&gt; Ann\n&gt;\n&gt;\n&gt;\n&gt; Peek-a-boo FREE Tricks Treats for You! Get &#39;em!\n&gt;\n&gt; \n\n\nI always lis en o hem. A e Mike and Lisa people you knew in li e?On No 15, 2007, a 8:28 AM, b uce halliday w o e:Lisby, I 's unny ha you we e he only pe son o eply o he iles I pos ed. The mo e esea ch I do he mo e o a ela ionship I build wi h he spi i s ha speak wi h me on a daily basis. i is always he same wo, Mike and Lisa . some imes he e is a hi d bu he ne e gi es his name. F ank's box #12 is a e y good box i has am andom and linea also FM linea sweepsso you ha e a a ie y o op ions. I don' ha e he bes adio signal in my a ea bu I'm ying di e en hings and i seems o be ge ing be e . The box gene a es a li le mo e noise han usualbu i is an olde box and ha is o be expec ed. I ge abou a 25% a e o hea ing esponses and messages in eal ime as I ecei e hem I will su ely pos hem as I ha e been doing all along only no one seems o ca e unless F anksays o pos s some hing. I 's nice o know someone lis ened.  hanksB uceB uce Halliday Pa ano mal In es iga ing Team To: EVP-ITC@yahoog oups.comF om: lisby@ea hlink.ne Da e: Wed, 14 No 2007 20:42:12 -0500Subjec : [EVP-ITC] Oh B uce...The ex eme wonde ulness o hese new EVP clips om he box lies in hei shee no malcy. When Mike answe ed you g ee ing wi h \"Wha zup?\" I ac ually s a ed c ying. This is wha I ha e been hoping o all my li e. Please, please, send mo e as hey come in. I'm li ing ica iously h ough you.AnnPeek-a-boo FREE T icks T ea s o You! Ge 'em!"}