{"id": "3002", "subject": "Re: [EVP-ITC] Oh Bruce...", "author": "Lisby", "timestamp": "2007-11-16T01:10:30Z", "full_text": "&lt;beg&gt;Frank, Frank, or anyone here--\n\nIf you will make me a box I will pay for it and time or whatever. I  \nam a writer, not an engineer and will never be able to make my own.  \nIf any kind hearted soul ever feels the call to assist me for $$ or  \notherwise, I will be eternally grateful. &lt;/beg&gt;\n\nAnn\n\n\nOn Nov 15, 2007, at 3:29 PM, Frank Sumption wrote:\n\n&gt;  Well...Mean Bitch week was last week, so I was trying to be nice.  \n&gt; Yeah, I can make a box for like $50 if it&#39;s on perf board, and $100  \n&gt; if it on PCB, the bare board alone is about $46. The only problem I  \n&gt; have is the time. It takes two weeks minumum to get a box together  \n&gt; and working. Most people would like to get paid for their time. I  \n&gt; make about $40 an hour at my real job. ( been here 24 years!)  \n&gt; Someday this stuff will get mass produced in China, and be included  \n&gt; in every cell phone!\n&gt;\n&gt;\n&gt;  Frank-S\n&gt;\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; From: warrior18eii@...\n&gt; Date: Thu, 15 Nov 2007 08:54:53 -0800\n&gt; Subject: Re: [EVP-ITC] Oh Bruce...\n&gt;\n&gt; I realize the time it takes to put things together. Especially  \n&gt; units built from the ground up but if you are taking on the duty of  \n&gt; spreading the technology to help mankind, to me it would be a labor  \n&gt; of love. I can see and accept recovering production costs even, but  \n&gt; this guy is looking to make a huge profit.\n&gt;\n&gt; You gained your respect and credibility on the fact that you have a  \n&gt; system that works and you are willing to give it away when you  \n&gt; didn&#39;t have to Frank. This guy is coming out of the gate with a  \n&gt; cheap imitation of EVP maker and your system (both of which are  \n&gt; free) and putting a huge price tag on it. It just don&#39;t sit right  \n&gt; with me!\n&gt;\n&gt; Honestly, I know it is none of my business what Ron does but I  \n&gt; guess I just needed to register my protest with this seemingly  \n&gt; blatant attempt at exploiting good though naive people.\n&gt;\n&gt; Regards,\n&gt;\n&gt; Frank R.\n&gt;\n&gt; ----- Original Message ----\n&gt; From: Frank Sumption &lt;franks-boxes@...&gt;\n&gt; To: evp-itc@yahoogroups.com\n&gt; Sent: Thursday, November 15, 2007 10:17:20 AM\n&gt; Subject: RE: [EVP-ITC] Oh Bruce...\n&gt;\n&gt;\n&gt;  Interesting. I can see the price for early models. This stuff take  \n&gt; tons of time to put together. I don&#39;t want to fault anyone ---yet.  \n&gt; I couldn&#39;t figure out how to sell the things, and keep it honest,  \n&gt; but all that does is deny everyone from using it.\n&gt;\n&gt;  Frank-S\n&gt;\n&gt;\n&gt; To: EVP-ITC@yahoogroups .com\n&gt; From: warrior18eii@ yahoo.com\n&gt; Date: Wed, 14 Nov 2007 19:43:51 -0800\n&gt; Subject: Re: [EVP-ITC] Oh Bruce...\n&gt;\n&gt; $400 to $650 dollars a unit. This guy is retarded! If he is selling  \n&gt; this unit, he doesn&#39;t get it Frank!\n&gt;\n&gt; Frank R.\n&gt;\n&gt; ----- Original Message ----\n&gt; From: Frank Sumption &lt;franks-boxes@ hotmail.com&gt;\n&gt; To: evp-itc@yahoogroups .com\n&gt; Sent: Wednesday, November 14, 2007 8:46:47 PM\n&gt; Subject: RE: [EVP-ITC] Oh Bruce...\n&gt;\n&gt;\n&gt; Yeah, I think this stuff is starting to take off with more users  \n&gt; &quot;getting it&quot; and more people out there making different designs.\n&gt;\n&gt;\n&gt; http://paranormalsy stems.com/\n&gt;\n&gt;  Frank\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Windows Live Hotmail and Microsoft Office Outlook – together at  \n&gt; last. Get it now!\n&gt;\n&gt;\n&gt; Never miss a thing. Make Yahoo your homepage.\n&gt;\n&gt; Windows Live Hotmail and Microsoft Office Outlook – together at  \n&gt; last. Get it now!\n&gt;\n&gt;\n&gt; Get easy, one-click access to your favorites. Make Yahoo! your  \n&gt; homepage.\n&gt;\n&gt; Boo! Scare away worms, viruses and so much more! Try Windows Live  \n&gt; OneCare! Try now!\n&gt;\n&gt; \n\n\nF ank, F ank, o anyone he e--I you will make me a box I will pay o i and ime o wha e e . I am a w i e , no an enginee and will ne e be able o make my own. I any kind hea ed soul e e eels he call o assis me o $$ o o he wise, I will be e e nally g a e ul. AnnOn No 15, 2007, a 3:29 PM, F ank Sump ion w o e: Well...Mean Bi ch week was las week, so I was ying o be nice. Yeah, I can make a box o like $50 i i 's on pe boa d, and $100 i i on PCB, he ba e boa d alone is abou $46. The only p oblem I ha e is he ime. I akes wo weeks minumum o ge a box oge he and wo king. Mos people would like o ge paid o hei ime. I make abou $40 an hou a my eal job. ( been he e 24 yea s!) Someday his s u will ge mass p oduced in China, and be included in e e y cell phone!  F ank-STo: EVP-ITC@yahoog oups.comF om: wa io 18eii@yahoo.comDa e: Thu, 15 No 2007 08:54:53 -0800Subjec : Re: [EVP-ITC] Oh B uce...I ealize he ime i akes o pu hings oge he . Especially uni s buil om he g ound up bu i you a e aking on he du y o sp eading he echnology o help mankind, o me i would be a labo o lo e. I can see and accep eco e ing p oduc ion cos s e en, bu his guy is looking o make a huge p o i . You gained you espec and c edibili y on he ac ha you ha e a sys em ha wo ks and you a e willing o gi e i away when you didn' ha e o F ank. This guy is coming ou o he ga e wi h a cheap imi a ion o EVP make and you sys em (bo h o which a e ee) and pu ing a huge p ice ag on i . I jus don' si igh wi h me!Hones ly, I know i is none o my business wha Ron does bu I guess I jus needed o egis e my p o es wi h his seemingly bla an a emp a exploi ing good hough nai e people.Rega ds,F ank R.----- O iginal Message ----F om: F ank Sump ion ho mail.com>To: e p-i c@yahoog oups.comSen : Thu sday, No embe 15, 2007 10:17:20 AMSubjec : RE: [EVP-ITC] Oh B uce... In e es ing. I can see he p ice o ea ly models. This s u ake ons o ime o pu oge he . I don' wan o aul anyone ---ye . I couldn' igu e ou how o sell he hings, and keep i hones , bu all ha does is deny e e yone om using i .  F ank-STo: EVP-ITC@yahoog oups .comF om: wa io 18eii@ yahoo.comDa e: Wed, 14 No 2007 19:43:51 -0800Subjec : Re: [EVP-ITC] Oh B uce...$400 o $650 dolla s a uni . This guy is e a ded! I he is selling his uni , he doesn' ge i F ank!F ank R.----- O iginal Message ----F om: F ank Sump ion To: e p-i c@yahoog oups .comSen : Wednesday, No embe 14, 2007 8:46:47 PMSubjec : RE: [EVP-ITC] Oh B uce...Yeah, I hink his s u is s a ing o ake o wi h mo e use s \"ge ing i \" and mo e people ou he e making di e en designs.  h p://pa ano malsy s ems.com/  F ankWindows Li e Ho mail and Mic oso O ice Ou look – oge he a las . Ge i now! Ne e miss a hing. Make Yahoo you homepage. Windows Li e Ho mail and Mic oso O ice Ou look – oge he a las . Ge i now!Ge easy, one-click access o you a o i es. Make Yahoo! you homepage. Boo! Sca e away wo ms, i uses and so much mo e! T y Windows Li e OneCa e! T y now!"}