{"id": "3008", "subject": "RE: [EVP-ITC] my opinion on the mini box", "author": "Frank Sumption", "timestamp": "2007-11-16T03:55:20Z", "full_text": "--_e64561fc-8e1c-4e9e-b261-309b18114a4b_\r\nContent-Type: multipart/alternative;\n\tboundary=&quot;_e9acec32-5f7a-4e0d-bfa2-6c18b66f12f6_&quot;\r\n\r\n\r\n--_e9acec32-5f7a-4e0d-bfa2-6c18b66f12f6_\r\nContent-Type: text/plain; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n\nSo which one of these is not interactive? it&#39;s typical of what we all get =\r\nhere. That&#39;s why I say the haunting stuff is crap, and meaningless. I think=\r\n maybe it&#39;s a matter of definition, some think ghosts and spirits can only =\r\nbe at haunted location, which is untrue. Some seem to think when we die we =\r\nbecome retarted zombies incapable of any intelligent action. \n \n Frank-S\n\n\n=\r\nTo: EVP-ITC@yahoogroups.comFrom: erick_hunter9@...: Thu, 15 Nov 2=\r\n007 15:42:06 -0800Subject: RE: [EVP-ITC] my opinion on the mini box\n\n\n\n\nBru=\r\nce,  the boxes aside,  I am talking about Ghosts, period.  The boxes are fo=\r\nr simple communication,  not inter-acting.  When I say &#39;inter-acting&#39; I don=\r\n&#39;t mean trade a few words,  I&#39;m referring to Meaningful interaction.  Makin=\r\ng a Statement,  passing on a message to me or a living relative,  predictin=\r\ng or causing &#39;physical&#39; inferances.   I&#39;ve experienced every kind of Ghost,=\r\n  I feel certain,  all over the world.  I have experience with them that mo=\r\nst people just dream about...or fear.  I have been carressed,  molested,  p=\r\noked,  probed,  slapped,  punched,  knocked down and physically Picked Up b=\r\ny a Ghost.  I have confronted them face-to-face while they were both visibl=\r\ne and invisable.  I have numerous times held conversations with them via vo=\r\nice recorder and once even one-on-one (it was the experience of a life-time=\r\n!).  I was Hunting Ghosts many, many years before it became a fad,  or cool=\r\n to do so.  And,  believe me,  I am far from being an &#39;expert&#39;.  I do not p=\r\nresume on Ghosts or their personalities.  Every time in the past that I&#39;ve =\r\ndone so,  I&#39;ve been rocked back on my heels,  psychologically speaking. Som=\r\ne are good,  some are not.  Many of them very much enjoy making you the foo=\r\nl (that&#39;s a lot easier done with some people than are others!) .  It doesn&#39;=\r\nt matter in the slightest what you Think of them,  They are what they are, =\r\n and &#39;being a friend&#39; is definitely not on their list of priorities!  That =\r\ngoes for All of them.  They will play with you.  They will lie to you.  The=\r\ny will tell, or imply to you, what they know you want to hear,  that or the=\r\ny will laugh at you.  I have personally heard their laughter,  on more than=\r\n one occasion.  The first step in beginning to understand Ghosts is to quit=\r\n watching stupid TV Ghost Dramas,  and learn to be discernful about Reality=\r\n.  God bless, anyway.        --Rod\n \n \n \n \nbruce halliday &lt;paranormalinvest=\r\nigating@...&gt; wrote:\n\n\nRod, No disrespect but how do you know what g=\r\nhosts havethe where with all to do? I speak with them through frank and joe=\r\n&#39;s box on a daily basis and consider thetwo that are communicating daily to=\r\n be friends. I believe you are speaking of grounded spirits not etherals an=\r\nd ghosts that are grounded most definately interact with us. residual ghost=\r\ns and hauntings do not that is whythere is a distinction between the two in=\r\ntelligent and residual hauntings. but we are not talking generaly about hau=\r\nnting spirits that communicate through frank and joe&#39;s boxes, but all types=\r\n of entities and don&#39;t call anyone dillusional unless you yourself have exp=\r\nerienced your own research with the boxes. Bruce \n\nBruce Halliday Paranorma=\r\nl Investigating Team \n\n\nTo: EVP-ITC@yahoogroups.comFrom: erick_hunter9@yaho=\r\no.comDate: Thu, 15 Nov 2007 14:18:55 -0800Subject: Re: [EVP-ITC] my opinion=\r\n on the mini box\n\n\n\nI certainly agree with the point of Bruces&#39; statement, =\r\n but I fear he&#39;s being delusional about &#39;friends&#39; from the other side affec=\r\nting some inter-action between a box and the user,  not letting one work,  =\r\nthe box chosing it&#39;s owner,  etc., etc., etc.  In the first place Ghosts ar=\r\ne Not our Friends!  That&#39;s pure, unadulterated Fantasy.\nThe Ghosts do not h=\r\nave the where-with-all to accomplish this in the first place, and even if t=\r\nhey did they don&#39;t give a rats&#39; rear end what a Ghost Hunter does or doesn&#39;=\r\nt do.  That boy really needs to get real.  Ghosts simply do not re-act to t=\r\nhe living in that way, or much of any other way except to allow us to see o=\r\nr hear them and then only when they want it to happen.  Their most obvious =\r\nand biggest trait is to be totally indifferent to our wishes.   Over 40 yrs=\r\n. of Investigating the Paranormal has taught me nothing if it hasn&#39;t taught=\r\n me this.      --Rod\n \n \n velazquez &lt;ghostchasingfool@...&gt; wrote:\n\n\nH=\r\nere, here Bruce.  I am glad others who a genuine support my outlook, I coul=\r\ndn&#39;t agree more!bhali333 &lt;paranormalinvestigating@...&gt; wrote: \n\n\nsi=\r\nnce I dropped the bomb about this mini box to Frank s. yesterday I did not =\r\nexpect such a fervent hoopla about it.So I will give my box experienced opi=\r\nnion after lengthy research with both Frank&#39;s and Joe&#39;s boxes. I have conta=\r\ncted the manufacturer for an explanation, he instructed me to listen to the=\r\n audio file and view the demo video on his site. After doing so my opinion =\r\non this box and the builders intentions for it is.The box itself is not a k=\r\nnock off of Frank&#39;s box but a cheap and ineffective version of Joe&#39;s box,It=\r\n works on an AM band instead of an FM band as Joe&#39;s box does. Another big d=\r\nifference is Joe&#39;s box actually works and you have all heard the files I ha=\r\nve posted from sessions with it. After listening to this box and seeing it =\r\nin operation I feel that anyone who purchases this box will be very disappo=\r\ninted and will not receive any contact from it and even if they did they pr=\r\nobably would not even realise it for the simple fact that you have to have =\r\na certain amount of experience with box research and operation before devel=\r\noping an ear for picking up real time communication and also creating a bon=\r\nd with the spirit friends on the other side and also a measure of trust on =\r\nboth sides.I believe the manufacturer to be a capitalist and only intereste=\r\nd in the monetary reward to be gained from offering this cheap and ineffect=\r\nive copy to unsuspecting and naive individuals who are interested in this m=\r\nedium. I do not like to bad mouth anyone, it usually comes back to bite you=\r\n in the ass but I believe that our friends on the other side know of our in=\r\ntentions and would not allow someone with the wrong intentions to develop a=\r\n working tool for communication. also I believe that a person does not pick=\r\n the box the box picks the person. So let him have his short and lucrative =\r\nrun with this fooling unsuspecting clients, bad karma always comes home.Bru=\r\nce\n\nThe contents of this eletronic correspondence is private & confidential=\r\n and meant only for the party and/or parties it is addressed to.  \n \nNo par=\r\nt of this email transmission may be publicly posted or forwarded to other p=\r\narties without explicit written permission.\n\n\n\nBoo! Scare away worms, virus=\r\nes and so much more! Try Windows Live OneCare! Try now! \n \n\n\n\n\n\n\n__________=\r\n_______________________________________________________\nClimb to the top of=\r\n the charts!=A0 Play Star Shuffle:=A0 the word scramble challenge with star=\r\n power.\nhttp://club.live.com/star_shuffle.aspx?icid=3Dstarshuffle_wlmailtex=\r\ntlink_oct\r\n--_e9acec32-5f7a-4e0d-bfa2-6c18b66f12f6_\r\nContent-Type: text/html; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;\n&lt;head&gt;\n&lt;style&gt;\n.hmmessage P\n{\nmargin:0px;\npadding:0px\n}\nbody.hmmessa=\r\nge\n{\nFONT-SIZE: 10pt;\nFONT-FAMILY:Tahoma\n}\n&lt;/style&gt;\n&lt;/head&gt;\n&lt;body class=3D&#39;=\r\nhmmessage&#39;&gt;\n&lt;BR&gt;So which one of these is not interactive? it&#39;s typical of w=\r\nhat we all get here. That&#39;s why I say the haunting stuff is crap, and meani=\r\nngless. I think maybe it&#39;s a matter of definition, some think ghosts and sp=\r\nirits can only be at haunted location, which is untrue. Some seem to think =\r\nwhen we die we become retarted zombies incapable of any intelligent action.=\r\n &lt;BR&gt;\n&nbsp;&lt;BR&gt;\n&nbsp;Frank-S&lt;BR&gt;&lt;BR&gt;\n&lt;BLOCKQUOTE&gt;\n&lt;HR&gt;\nTo: EVP-ITC@yahoog=\r\nroups.com&lt;BR&gt;From: erick_hunter9@...&lt;BR&gt;Date: Thu, 15 Nov 2007 15:42:=\r\n06 -0800&lt;BR&gt;Subject: RE: [EVP-ITC] my opinion on the mini box&lt;BR&gt;&lt;BR&gt;\n&lt;META=\r\n content=3D&quot;Microsoft SafeHTML&quot; name=3DGenerator&gt;\n&lt;DIV id=3DEC_ygrp-mlmsg s=\r\ntyle=3D&quot;WIDTH: 655px&quot;&gt;\n&lt;DIV id=3DEC_ygrp-msg style=3D&quot;PADDING-RIGHT: 15px; =\r\nPADDING-LEFT: 0px; Z-INDEX: 1; FLOAT: left; PADDING-BOTTOM: 0px; WIDTH: 490=\r\npx; PADDING-TOP: 0px&quot;&gt;\n&lt;DIV id=3DEC_ygrp-text&gt;\n&lt;DIV&gt;&lt;STRONG&gt;Bruce,&nbsp; th=\r\ne boxes aside,&nbsp; I am talking about Ghosts, period.&nbsp; The boxes are=\r\n for simple communication,&nbsp; not inter-acting.&nbsp; When I say &#39;inter-=\r\nacting&#39; I don&#39;t mean trade a few words,&nbsp; I&#39;m referring to &lt;EM&gt;Meaningf=\r\nul&lt;/EM&gt; interaction.&nbsp; Making a &lt;EM&gt;Statement&lt;/EM&gt;,&nbsp; passing on a =\r\nmessage to me or a living relative,&nbsp; predicting or causing &#39;physical&#39; =\r\ninferances.&nbsp;&nbsp;&nbsp;I&#39;ve experienced every kind of Ghost,&nbsp; I =\r\nfeel certain,&nbsp; all over the world.&nbsp; I have experience with them t=\r\nhat most people just dream about...or fear.&nbsp; I have been carressed,&nb=\r\nsp; molested, &nbsp;poked,&nbsp; probed,&nbsp; slapped,&nbsp; punched,&nbsp=\r\n; knocked down and physically&nbsp;&lt;EM&gt;Picked Up&lt;/EM&gt;&nbsp;by a&nbsp;Ghost.=\r\n&nbsp; I have confronted them face-to-face while they were both visible and=\r\n invisable.&nbsp; I have numerous times held conversations with them via vo=\r\nice recorder and once even one-on-one (it was the experience of a life-time=\r\n!).&nbsp; I was Hunting Ghosts many, many&nbsp;years before it became a fad=\r\n,&nbsp; or cool&nbsp;to do so.&nbsp; And,&nbsp; believe me,&nbsp; I am far =\r\nfrom being an &#39;expert&#39;.&nbsp; I do not presume on Ghosts or their personali=\r\nties.&nbsp; Every time in the past that I&#39;ve done so,&nbsp; I&#39;ve been rocke=\r\nd back on my heels,&nbsp; psychologically speaking. Some are good,&nbsp; so=\r\nme are not.&nbsp; Many of them very much enjoy making you the fool (that&#39;s =\r\na lot easier done&nbsp;with some people than are&nbsp;others!)&nbsp;.&nbsp;=\r\n&nbsp;&lt;/STRONG&gt;&lt;BR&gt;&lt;STRONG&gt;It doesn&#39;t matter in the slightest &lt;EM&gt;what you =\r\nThink of them,&lt;/EM&gt;&nbsp; They are what they are,&nbsp; and &#39;being a friend=\r\n&#39; is definitely not on their list of priorities!&nbsp; That goes for &lt;EM&gt;Al=\r\nl &lt;/EM&gt;of them.&nbsp; They will play with you.&nbsp; They will lie to you.&=\r\nnbsp; They will tell, or imply to&nbsp;you, what they know you want to hear=\r\n,&nbsp; that or they will laugh at you.&nbsp; I have personally&nbsp;heard =\r\ntheir laughter,&nbsp; on more than one occasion.&nbsp; The first step in be=\r\nginning to understand Ghosts is to quit watching stupid&nbsp;TV Ghost Drama=\r\ns,&nbsp; and learn to be discernful about &lt;EM&gt;Reality&lt;/EM&gt;.&nbsp; God bless=\r\n, anyway.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; --Rod&lt;/STRONG&gt;&lt;/DIV&gt;\n&lt;D=\r\nIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;=\r\n&lt;BR&gt;&lt;B&gt;&lt;I&gt;bruce halliday &lt;paranormalinvestiga&lt;WBR&gt;ting@hotmail.&lt;WBR&gt;com&=\r\ngt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/DIV&gt;\n&lt;BLOCKQUOTE class=3DEC_replbq style=3D&quot;BORDER-LEFT=\r\n: #1010ff 2px solid&quot;&gt;\n&lt;DIV id=3DEC_ygrp-text&gt;\n&lt;DIV&gt;Rod,&lt;BR&gt;&nbsp;&lt;BR&gt;No dis=\r\nrespect but how do you know what ghosts have&lt;BR&gt;the where with all to do? I=\r\n speak with them through frank and joe&#39;s box on a daily basis and consider =\r\nthe&lt;BR&gt;two that are communicating daily to be friends. I believe you are sp=\r\neaking of grounded spirits not etherals &lt;BR&gt;and ghosts that are grounded mo=\r\nst definately interact with us. residual ghosts and hauntings do not that i=\r\ns why&lt;BR&gt;there is a distinction between the two intelligent and residual ha=\r\nuntings. but we are not talking generaly about &lt;BR&gt;haunting spirits that co=\r\nmmunicate through frank and joe&#39;s boxes, but all types of entities and don&#39;=\r\nt call anyone &lt;BR&gt;dillusional unless you yourself have experienced your own=\r\n research with the boxes.&lt;BR&gt;&nbsp;&lt;BR&gt;Bruce&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;&nbsp;&lt;BR&gt;\n&lt;DIV&gt;\n&lt;D=\r\nIV align=3Dcenter&gt;&lt;FONT size=3D4&gt;&lt;FONT color=3D#0033cc&gt;&lt;STRONG&gt;&lt;EM&gt;&lt;FONT co=\r\nlor=3D#000000 size=3D5&gt;Bruce Halliday &lt;BR&gt;&lt;/FONT&gt;&lt;/EM&gt;&lt;FONT color=3D#000000=\r\n&gt;Paranormal Investigating Team &lt;/FONT&gt;&lt;/STRONG&gt;&lt;BR&gt;&lt;A href=3D&quot;http://free-p=\r\naranormalinvestigating.com/&lt;/div&gt;&lt;/div&gt;&lt;p%20/&gt;&lt;div%20class=3D&quot; target=3D_bl=\r\nank&gt;&lt;/FONT&gt;&lt;/FONT&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;BLOCKQUOTE&gt;\n&lt;HR id=3DEC_EC_stopSpel=\r\nling&gt;\nTo: EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;BR&gt;From: erick_hunter9@&lt;WBR&gt;yahoo.co=\r\nm&lt;BR&gt;Date: Thu, 15 Nov 2007 14:18:55 -0800&lt;BR&gt;Subject: Re: [EVP-ITC] my opi=\r\nnion on the mini box&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3DEC_EC_ygrp-mlmsg&gt;\n&lt;DIV id=3DEC_EC_yg=\r\nrp-msg&gt;\n&lt;DIV id=3DEC_EC_ygrp-text&gt;\n&lt;DIV&gt;&lt;STRONG&gt;I certainly agree with the =\r\npoint of Bruces&#39; statement,&nbsp; but I fear he&#39;s being delusional about &#39;f=\r\nriends&#39; from&nbsp;the other side affecting some inter-action between a box =\r\nand the user,&nbsp; not letting one work,&nbsp; the box chosing it&#39;s owner,=\r\n&nbsp; etc., etc., etc.&nbsp; In the first place Ghosts are &lt;EM&gt;Not &lt;/EM&gt;ou=\r\nr &lt;EM&gt;Friends!&nbsp; That&#39;s pure, unadulterated Fantasy.&lt;/EM&gt;&lt;/STRONG&gt;&lt;/DIV=\r\n&gt;\n&lt;DIV&gt;&lt;STRONG&gt;The Ghosts do not have the where-with-all to accomplish this=\r\n in the first place, and even&nbsp;if they did they&nbsp;don&#39;t give a rats&#39;=\r\n rear end what a Ghost Hunter does or doesn&#39;t do.&nbsp; That boy really nee=\r\nds to get real.&nbsp; Ghosts simply do not re-act to the living in that way=\r\n, or much of any other way except to allow us to see or hear them and then =\r\nonly when they want it to happen.&nbsp; Their most obvious and&nbsp;biggest=\r\n trait is to be totally indifferent to our wishes.&lt;/STRONG&gt;&nbsp;&nbsp; &lt;ST=\r\nRONG&gt;Over 40 yrs. of Investigating the Paranormal has taught me nothing if =\r\nit hasn&#39;t taught me this.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; --Rod&lt;/STRONG&gt;&lt;/DIV=\r\n&gt;\n&lt;DIV&gt;&lt;B&gt;&lt;I&gt;&lt;/I&gt;&lt;/B&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;B&gt;&lt;I&gt;&lt;/I&gt;&lt;/B&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;B&gt;&lt;=\r\nI&gt;&nbsp;velazquez &lt;ghostchasingfool@&lt;WBR&gt;yahoo.com&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/D=\r\nIV&gt;\n&lt;BLOCKQUOTE class=3DEC_EC_replbq style=3D&quot;BORDER-LEFT: #1010ff 2px soli=\r\nd&quot;&gt;\n&lt;DIV id=3DEC_EC_ygrp-text&gt;\n&lt;DIV&gt;Here, here Bruce.&nbsp; I am glad other=\r\ns who a genuine support my outlook, I couldn&#39;t agree more!&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;bha=\r\nli333 &lt;paranormalinvestiga&lt;WBR&gt;ting@hotmail.&lt;WBR&gt;com&gt;&lt;/I&gt;&lt;/B&gt; wrote: =\r\n\n&lt;BLOCKQUOTE class=3DEC_EC_replbq style=3D&quot;BORDER-LEFT: #1010ff 2px solid&quot;&gt;=\r\n\n&lt;DIV id=3DEC_EC_ygrp-text&gt;\n&lt;DIV&gt;since I dropped the bomb about this mini b=\r\nox to Frank s. yesterday I &lt;BR&gt;did not expect such a fervent hoopla about i=\r\nt.So I will give my box &lt;BR&gt;experienced opinion after lengthy research with=\r\n both Frank&#39;s and &lt;BR&gt;Joe&#39;s boxes. I have contacted the manufacturer for an=\r\n explanation, he &lt;BR&gt;instructed me to listen to the audio file and view the=\r\n demo video on &lt;BR&gt;his site. After doing so my opinion on this box and the =\r\nbuilders &lt;BR&gt;intentions for it is.&lt;BR&gt;&lt;BR&gt;The box itself is not a knock off=\r\n of Frank&#39;s box but a cheap and &lt;BR&gt;ineffective version of Joe&#39;s box,It wor=\r\nks on an AM band instead of an &lt;BR&gt;FM band as Joe&#39;s box does. Another big d=\r\nifference is Joe&#39;s box &lt;BR&gt;actually works and you have all heard the files =\r\nI have posted from &lt;BR&gt;sessions with it. After listening to this box and se=\r\neing it in &lt;BR&gt;operation I feel that anyone who purchases this box will be =\r\nvery &lt;BR&gt;disappointed and will not receive any contact from it and even if =\r\n&lt;BR&gt;they did they probably would not even realise it for the simple fact &lt;B=\r\nR&gt;that you have to have a certain amount of experience with box &lt;BR&gt;researc=\r\nh and operation before developing an ear for picking up real &lt;BR&gt;time commu=\r\nnication and also creating a bond with the spirit friends &lt;BR&gt;on the other =\r\nside and also a measure of trust on both sides.&lt;BR&gt;&lt;BR&gt;I believe the manufa=\r\ncturer to be a capitalist and only interested in &lt;BR&gt;the monetary reward to=\r\n be gained from offering this cheap and &lt;BR&gt;ineffective copy to unsuspectin=\r\ng and naive individuals who are &lt;BR&gt;interested in this medium. I do not lik=\r\ne to bad mouth anyone, it &lt;BR&gt;usually comes back to bite you in the ass but=\r\n I believe that our &lt;BR&gt;friends on the other side know of our intentions an=\r\nd would not allow &lt;BR&gt;someone with the wrong intentions to develop a workin=\r\ng tool for &lt;BR&gt;communication. also I believe that a person does not pick th=\r\ne box the &lt;BR&gt;box picks the person. &lt;BR&gt;&lt;BR&gt;So let him have his short and l=\r\nucrative run with this fooling &lt;BR&gt;unsuspecting clients, bad karma always c=\r\nomes home.&lt;BR&gt;&lt;BR&gt;Bruce&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;DIV&gt;\n=\r\n&lt;DIV&gt;&lt;EM&gt;&lt;STRONG&gt;&lt;FONT color=3D#0000ff&gt;The contents of this eletronic corre=\r\nspondence is private &amp; confidential and meant only for the party and/or=\r\n parties it is addressed to.&nbsp; &lt;/FONT&gt;&lt;/STRONG&gt;&lt;/EM&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;EM&gt;&lt;ST=\r\nRONG&gt;&lt;FONT color=3D#0000ff&gt;&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/EM&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;EM&gt;&lt;STRO=\r\nNG&gt;&lt;FONT color=3D#0000ff&gt;No part of this email transmission may be publicly=\r\n posted or forwarded to other parties without explicit written permission.&lt;=\r\n/FONT&gt;&lt;/STRONG&gt;&lt;/EM&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;\n&lt;=\r\nDIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;SPAN style=3D&quot;COLOR: white&quot;&gt;&lt;/SPAN&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCK=\r\nQUOTE&gt;&lt;BR&gt;\n&lt;HR&gt;\nBoo!&nbsp;Scare away worms, viruses and so much more! Try W=\r\nindows Live OneCare! &lt;A href=3D&quot;http://onecare.live.com/standard/en-us/purc=\r\nhase/trial.aspx?s_cid=3Dwl_hotmailnews&quot; target=3D_blank&gt;Try now!&lt;/A&gt; \n&lt;DIV&gt;=\r\n&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;SPAN style=3D&quot;COLOR: whit=\r\ne&quot;&gt;&lt;/SPAN&gt; \n&lt;STYLE&gt;.ExternalClass #EC_ygrp-mkp{border:1px solid #d8d8d8;fon=\r\nt-family:Arial;padding:0px 14px;}.ExternalClass #EC_ygrp-mkp hr{border:1px =\r\nsolid #d8d8d8;}.ExternalClass #EC_ygrp-mkp #EC_hd{color:#628c2a;font-size:8=\r\n5%;font-weight:bold;line-height:122%;}.ExternalClass #EC_ygrp-mkp #EC_ads{m=\r\nargin-bottom:10px;}.ExternalClass #EC_ygrp-mkp .EC_ad{padding:0 0;}.Externa=\r\nlClass #EC_ygrp-mkp .EC_ad a{color:#0000ff;text-decoration:none;}&lt;/STYLE&gt;\n\n=\r\n&lt;STYLE&gt;.ExternalClass #EC_ygrp-sponsor #EC_ygrp-lc{font-family:Arial;}.Exte=\r\nrnalClass #EC_ygrp-sponsor #EC_ygrp-lc #EC_hd{font-weight:bold;font-size:78=\r\n%;line-height:122%;}.ExternalClass #EC_ygrp-sponsor #EC_ygrp-lc .EC_ad{marg=\r\nin-bottom:10px;padding:0 0;}&lt;/STYLE&gt;\n\n&lt;STYLE&gt;.ExternalClass #EC_ygrp-mlmsg{=\r\nfont-size:13px;font-family:arial,helvetica,clean,sans-serif;}.ExternalClass=\r\n #EC_ygrp-mlmsg table{font-size:inherit;font:100%;}.ExternalClass #EC_ygrp-=\r\nmlmsg select, .ExternalClass input, .ExternalClass textarea{font:99% arial,=\r\nhelvetica,clean,sans-serif;}.ExternalClass #EC_ygrp-mlmsg pre, .ExternalCla=\r\nss code{font:115% monospace;}.ExternalClass #EC_ygrp-mlmsg EC_*{line-height=\r\n:1.22em;}.ExternalClass #EC_ygrp-text{font-family:Georgia;}.ExternalClass #=\r\nEC_ygrp-text p{;}.ExternalClass #EC_ygrp-tpmsgs{font-family:Arial;clear:bot=\r\nh;}.ExternalClass #EC_ygrp-vitnav{padding-top:10px;font-family:Verdana;font=\r\n-size:77%;}.ExternalClass #EC_ygrp-vitnav a{padding:0 1px;}.ExternalClass #=\r\nEC_ygrp-actbar{clear:both;white-space:nowrap;color:#666;text-align:right;}.=\r\nExternalClass #EC_ygrp-actbar .EC_left{float:left;white-space:nowrap;}.Exte=\r\nrnalClass .EC_bld{font-weight:bold;}.ExternalClass #EC_ygrp-grft{font-famil=\r\ny:Verdana;font-size:77%;padding:15px 0;}.ExternalClass #EC_ygrp-ft{font-fam=\r\nily:verdana;font-size:77%;border-top:1px solid #666;padding:5px 0;}.Externa=\r\nlClass #EC_ygrp-mlmsg #EC_logo{padding-bottom:10px;}.ExternalClass #EC_ygrp=\r\n-vital{background-color:#e0ecee;margin-bottom:20px;padding:2px 0 8px 8px;}.=\r\nExternalClass #EC_ygrp-vital #EC_vithd{font-size:77%;font-family:Verdana;fo=\r\nnt-weight:bold;color:#333;text-transform:uppercase;}.ExternalClass #EC_ygrp=\r\n-vital ul{padding:0;}.ExternalClass #EC_ygrp-vital ul li{list-style-type:no=\r\nne;clear:both;border:1px solid #e0ecee;}.ExternalClass #EC_ygrp-vital ul li=\r\n .EC_ct{font-weight:bold;color:#ff7900;float:right;width:2em;text-align:rig=\r\nht;padding-right:.5em;}.ExternalClass #EC_ygrp-vital ul li .EC_cat{font-wei=\r\nght:bold;}.ExternalClass #EC_ygrp-vital a{text-decoration:none;}.ExternalCl=\r\nass #EC_ygrp-vital a:hover{text-decoration:underline;}.ExternalClass #EC_yg=\r\nrp-sponsor #EC_hd{color:#999;font-size:77%;}.ExternalClass #EC_ygrp-sponsor=\r\n #EC_ov{padding:6px 13px;background-color:#e0ecee;margin-bottom:20px;}.Exte=\r\nrnalClass #EC_ygrp-sponsor #EC_ov ul{padding:0 0 0 8px;}.ExternalClass #EC_=\r\nygrp-sponsor #EC_ov li{list-style-type:square;padding:6px 0;font-size:77%;}=\r\n.ExternalClass #EC_ygrp-sponsor #EC_ov li a{text-decoration:none;font-size:=\r\n130%;}.ExternalClass #EC_ygrp-sponsor #EC_nc{background-color:#eee;margin-b=\r\nottom:20px;padding:0 8px;}.ExternalClass #EC_ygrp-sponsor .EC_ad{padding:8p=\r\nx 0;}.ExternalClass #EC_ygrp-sponsor .EC_ad #EC_hd1{font-family:Arial;font-=\r\nweight:bold;color:#628c2a;font-size:100%;line-height:122%;}.ExternalClass #=\r\nEC_ygrp-sponsor .EC_ad a{text-decoration:none;}.ExternalClass #EC_ygrp-spon=\r\nsor .EC_ad a:hover{text-decoration:underline;}.ExternalClass #EC_ygrp-spons=\r\nor .EC_ad p{;}.ExternalClass EC_o{font-size:0;}.ExternalClass .EC_MsoNormal=\r\n{;}.ExternalClass #EC_ygrp-text tt{font-size:120%;}.ExternalClass blockquot=\r\ne{;}.ExternalClass .EC_replbq{;}&lt;/STYLE&gt;\n&lt;/BLOCKQUOTE&gt;&lt;br /&gt;&lt;hr /&gt;Climb to =\r\nthe top of the charts!=A0 Play Star Shuffle:=A0 the word scramble challenge=\r\n with star power. &lt;a href=3D&#39;http://club.live.com/star_shuffle.aspx?icid=3D=\r\nstarshuffle_wlmailtextlink_oct&#39; target=3D&#39;_new&#39;&gt;Play Now!&lt;/a&gt;&lt;/body&gt;\n&lt;/html=\r\n&gt;\r\n--_e9acec32-5f7a-4e0d-bfa2-6c18b66f12f6_--\r\n\n\r\n--_e64561fc-8e1c-4e9e-b261-309b18114a4b_\r\nContent-Type: audio/mpeg\r\nContent-Disposition: attachment; filename=&quot;FM-YourBeutifulBigBoobs.mp3&quot;\r\n\r\n[ Attachment content not displayed ]\r\n--_e64561fc-8e1c-4e9e-b261-309b18114a4b_\r\nContent-Type: audio/mpeg\r\nContent-Disposition: attachment; filename=&quot;AM-FrankIsLikeGirl.mp3&quot;\r\n\r\n[ Attachment content not displayed ]\r\n--_e64561fc-8e1c-4e9e-b261-309b18114a4b_\r\nContent-Type: audio/mpeg\r\nContent-Disposition: attachment; filename=\n\t&quot;MissPurple-WeWatch--WhyWon&#39;tTheyPardon--You-It&#39;sRightNow--110607.mp3&quot;\r\n\r\n[ Attachment content not displayed ]\r\n--_e64561fc-8e1c-4e9e-b261-309b18114a4b_\r\nContent-Type: audio/mpeg\r\nContent-Disposition: attachment; filename=\n\t&quot;MissPurple-WeWatch--WhyWon&#39;tTheyPardon--You-It&#39;sRightNow--EQ-110607.mp3&quot;\r\n\r\n[ Attachment content not displayed ]\r\n--_e64561fc-8e1c-4e9e-b261-309b18114a4b_\r\nContent-Type: audio/mpeg\r\nContent-Disposition: attachment;\n\tfilename=&quot;lovethesemessages-wishwecouldalldoit-(M--3-29-07)-hum-removed.mp3&quot;\r\n\r\n[ Attachment content not displayed ]\r\n--_e64561fc-8e1c-4e9e-b261-309b18114a4b_--"}