{"id": "3010", "subject": "Re: [EVP-ITC] message to Frank S. from Tesla", "author": "Zack Widup", "timestamp": "2007-11-16T04:09:31Z", "full_text": "I can tell you some of the real story of these two men (much abbreviated \nversion).\n\nNikola Tesla worked for Edison for a while but they had a falling-out \nbecause Tesla thought of improvements to Edison&#39;s inventions that Edison, \ndue to ego or whatever, didn&#39;t think much of.  Tesla also had a habit of \nordering the most expensive chateaubriand at Edison&#39;s expense when Edison \ntook him out to dinner. They eventually parted ways.\n\nTesla happened upon George Westinghouse&#39;s lab when Westinghouse needed \nrepairs to a motor.  Tesla went into the shop and machined such a \nhigh-quality repair that Westinghouse was immediately impressed.  So Tesla \nended up working for Westinghouse at that point.\n\nTesla had the idea of developing alternating-current systems for power \ndistribution and Westinghouse backed it all the way.  AC was much more \nefficient than Edison&#39;s DC power distribution systems because it lacked \nthe heat losses in the power lines that DC systems suffered from. Edison \nstood to lose much if his DC power systems were discarded in favor of AC \npower.  So he invented the electric chair to demonstrate to the public \njust how dangerous AC was.  The first attempt at using it on a death-row \ninmate failed miserably; it didn&#39;t kill him but amounted to torture \ninstead.\n\nTesla went on to do his own research; much was funded by J. P. Morgan. \nThat&#39;s a whole &#39;nother story. But he and Westinghouse remained friends; \nhe and Edison remained enemies.\n\nTesla was a very bad manager of money.  He died in a hotel room in New \nYork, with very little money at that time.\n\nAnother interesting anecdote - Tesla had taken to letting the pigeons into \nhis hotel room, which the hotel owners didn&#39;t enjoy but tolerated because \nof his notoriety. He had a favorite pigeon which sat on his phone.  He had \nsaid several times that &quot;The day that my favorite pigeon dies, I will \ndie.&quot; And so it happened.\n\nZack\n\nOn Thu, 15 Nov 2007, Lisby wrote:\n\n&gt; That&#39;s what I hear, too, Bruce.\n&gt;\n&gt; Okay-- in your opinion--what is all this Tesla/Edison stuff about? It&#39;s \n&gt; getting as weird as as John Keel book around here.\n&gt;\n&gt; Ann\n&gt;"}