{"id": "3023", "subject": "RE: [EVP-ITC] my opinion on the mini box", "author": "bruce halliday", "timestamp": "2007-11-16T13:54:48Z", "full_text": "--_262f7e35-b605-4ddf-8982-b45dc711dfc3_\r\nContent-Type: text/plain; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nBravo to both Frank&#39;s WELL SAID !\n \nbruce\n\nBruce Halliday Paranormal Invest=\r\nigating Team \n\n\nTo: EVP-ITC@yahoogroups.comFrom: warrior18eii@...=\r\n: Fri, 16 Nov 2007 05:35:38 -0800Subject: Re: [EVP-ITC] my opinion on the m=\r\nini box\n\n\n\n\n\n\n&quot;I have experience with them that most people just dream abou=\r\nt...or fear.  I have been carressed,  molested,  poked,  probed,  slapped, =\r\n punched,  knocked down and physically Picked Up by a Ghost.&quot;Rod,I have see=\r\nn these words before from many different people, both on the web and in rea=\r\nl life. Every one of them changed there tune when they made contact (real c=\r\nontact). Citing that they didn&#39;t know it was possible. In your words you ar=\r\ne a ghost hunter and not an expert (even though you give your GH resume wan=\r\nting us all to believe so). Ghost hunter thrive on proof! They almost worsh=\r\nip the words proof and evidence. The fact is that many of us; Sumption, Bru=\r\nce, Misty, Steve, myself and many others have presented proof on a daily ba=\r\nsis using a myriad of different methods to obtain it. The quote I have plac=\r\ned above, taken from your own post are just words. Open your mind a bit. As=\r\n was said earlier you will experience what you expect to experience.Frank R=\r\n.\n----- Original Message ----From: erick hunter &lt;erick_hunter9@...&gt;To=\r\n: EVP-ITC@yahoogroups.comSent: Thursday, November 15, 2007 5:42:06 PMSubjec=\r\nt: RE: [EVP-ITC] my opinion on the mini box\n\n\nBruce,  the boxes aside,  I a=\r\nm talking about Ghosts, period.  The boxes are for simple communication,  n=\r\not inter-acting.  When I say &quot;inter-acting&quot; I don&#39;t mean trade a few words,=\r\n  I&#39;m referring to Meaningful interaction.  Making a Statement,  passing on=\r\n a message to me or a living relative,  predicting or causing &quot;physical&quot; in=\r\nferances.   I&#39;ve experienced every kind of Ghost,  I feel certain,  all ove=\r\nr the world.  I have experience with them that most people just dream about=\r\n...or fear.  I have been carressed,  molested,  poked,  probed,  slapped,  =\r\npunched,  knocked down and physically Picked Up by a Ghost.  I have confron=\r\nted them face-to-face while they were both visible and invisable.  I have n=\r\numerous times held conversations with them via voice recorder and once even=\r\n one-on-one (it was the experience of a life-time!).  I was Hunting Ghosts =\r\nmany, many years before it became a fad,  or cool to do so.  And,  believe =\r\nme,  I am far from being an &quot;expert&quot;.  I do not presume on Ghosts or their =\r\npersonalities.  Every time in the past that I&#39;ve done so,  I&#39;ve been rocked=\r\n back on my heels,  psychologically speaking. Some are good,  some are not.=\r\n  Many of them very much enjoy making you the fool (that&#39;s a lot easier don=\r\ne with some people than are others!) .  It doesn&#39;t matter in the slightest =\r\nwhat you Think of them,  They are what they are,  and &quot;being a friend&quot; is d=\r\nefinitely not on their list of priorities!  That goes for All of them.  The=\r\ny will play with you.  They will lie to you.  They will tell, or imply to y=\r\nou, what they know you want to hear,  that or they will laugh at you.  I ha=\r\nve personally heard their laughter,  on more than one occasion.  The first =\r\nstep in beginning to understand Ghosts is to quit watching stupid TV Ghost =\r\nDramas,  and learn to be discernful about Reality.  God bless, anyway.     =\r\n   --Rod\n \n \n \n \nbruce halliday &lt;paranormalinvestiga ting@hotmail. com&gt; wro=\r\nte:\n\n\nRod, No disrespect but how do you know what ghosts havethe where with=\r\n all to do? I speak with them through frank and joe&#39;s box on a daily basis =\r\nand consider thetwo that are communicating daily to be friends. I believe y=\r\nou are speaking of grounded spirits not etherals and ghosts that are ground=\r\ned most definately interact with us. residual ghosts and hauntings do not t=\r\nhat is whythere is a distinction between the two intelligent and residual h=\r\nauntings. but we are not talking generaly about haunting spirits that commu=\r\nnicate through frank and joe&#39;s boxes, but all types of entities and don&#39;t c=\r\nall anyone dillusional unless you yourself have experienced your own resear=\r\nch with the boxes. Bruce \n\nBruce Halliday Paranormal Investigating Team \n\n\n=\r\nTo: EVP-ITC@yahoogroups .comFrom: erick_hunter9@ yahoo.comDate: Thu, 15 Nov=\r\n 2007 14:18:55 -0800Subject: Re: [EVP-ITC] my opinion on the mini box\n\n\n\nI =\r\ncertainly agree with the point of Bruces&#39; statement,  but I fear he&#39;s being=\r\n delusional about &quot;friends&quot; from the other side affecting some inter-action=\r\n between a box and the user,  not letting one work,  the box chosing it&#39;s o=\r\nwner,  etc., etc., etc.  In the first place Ghosts are Not our Friends!  Th=\r\nat&#39;s pure, unadulterated Fantasy.\nThe Ghosts do not have the where-with-all=\r\n to accomplish this in the first place, and even if they did they don&#39;t giv=\r\ne a rats&#39; rear end what a Ghost Hunter does or doesn&#39;t do.  That boy really=\r\n needs to get real.  Ghosts simply do not re-act to the living in that way,=\r\n or much of any other way except to allow us to see or hear them and then o=\r\nnly when they want it to happen.  Their most obvious and biggest trait is t=\r\no be totally indifferent to our wishes.   Over 40 yrs. of Investigating the=\r\n Paranormal has taught me nothing if it hasn&#39;t taught me this.      --Rod\n =\r\n\n \n velazquez &lt;ghostchasingfool@ yahoo.com&gt; wrote:\n\n\nHere, here Bruce.  I a=\r\nm glad others who a genuine support my outlook, I couldn&#39;t agree more!bhali=\r\n333 &lt;paranormalinvestiga ting@hotmail. com&gt; wrote: \n\n\nsince I dropped the b=\r\nomb about this mini box to Frank s. yesterday I did not expect such a ferve=\r\nnt hoopla about it.So I will give my box experienced opinion after lengthy =\r\nresearch with both Frank&#39;s and Joe&#39;s boxes. I have contacted the manufactur=\r\ner for an explanation, he instructed me to listen to the audio file and vie=\r\nw the demo video on his site. After doing so my opinion on this box and the=\r\n builders intentions for it is.The box itself is not a knock off of Frank&#39;s=\r\n box but a cheap and ineffective version of Joe&#39;s box,It works on an AM ban=\r\nd instead of an FM band as Joe&#39;s box does. Another big difference is Joe&#39;s =\r\nbox actually works and you have all heard the files I have posted from sess=\r\nions with it. After listening to this box and seeing it in operation I feel=\r\n that anyone who purchases this box will be very disappointed and will not =\r\nreceive any contact from it and even if they did they probably would not ev=\r\nen realise it for the simple fact that you have to have a certain amount of=\r\n experience with box research and operation before developing an ear for pi=\r\ncking up real time communication and also creating a bond with the spirit f=\r\nriends on the other side and also a measure of trust on both sides.I believ=\r\ne the manufacturer to be a capitalist and only interested in the monetary r=\r\neward to be gained from offering this cheap and ineffective copy to unsuspe=\r\ncting and naive individuals who are interested in this medium. I do not lik=\r\ne to bad mouth anyone, it usually comes back to bite you in the ass but I b=\r\nelieve that our friends on the other side know of our intentions and would =\r\nnot allow someone with the wrong intentions to develop a working tool for c=\r\nommunication. also I believe that a person does not pick the box the box pi=\r\ncks the person. So let him have his short and lucrative run with this fooli=\r\nng unsuspecting clients, bad karma always comes home.Bruce\n\nThe contents of=\r\n this eletronic correspondence is private & confidential and meant only for=\r\n the party and/or parties it is addressed to.  \n \nNo part of this email tra=\r\nnsmission may be publicly posted or forwarded to other parties without expl=\r\nicit written permission.\n\nBoo! Scare away worms, viruses and so much more! =\r\nTry Windows Live OneCare! Try now! \n\n\nGet easy, one-click access to your fa=\r\nvorites. Make Yahoo! your homepage. \n \n\n\n\n\n\n\n______________________________=\r\n___________________________________\nPeek-a-boo FREE Tricks & Treats for You=\r\n!\nhttp://www.reallivemoms.com?ocid=3DTXT_TAGHM&loc=3Dus\r\n--_262f7e35-b605-4ddf-8982-b45dc711dfc3_\r\nContent-Type: text/html; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;\n&lt;head&gt;\n&lt;style&gt;\n.hmmessage P\n{\nmargin:0px;\npadding:0px\n}\nbody.hmmessa=\r\nge\n{\nFONT-SIZE: 10pt;\nFONT-FAMILY:Tahoma\n}\n&lt;/style&gt;\n&lt;/head&gt;\n&lt;body class=3D&#39;=\r\nhmmessage&#39;&gt;Bravo to both Frank&#39;s WELL SAID !&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nbruce&lt;BR&gt;&lt;BR&gt;&lt;B=\r\nR&gt;\n&lt;DIV&gt;\n&lt;P align=3Dcenter&gt;&lt;FONT size=3D4&gt;&lt;FONT color=3D#0033cc&gt;&lt;STRONG&gt;&lt;EM=\r\n&gt;&lt;FONT face=3D&quot;&quot; color=3D#000000 size=3D5&gt;Bruce Halliday &lt;BR&gt;&lt;/FONT&gt;&lt;/EM&gt;&lt;F=\r\nONT color=3D#000000&gt;Paranormal Investigating Team &lt;/FONT&gt;&lt;/STRONG&gt;&lt;BR&gt;&lt;A hr=\r\nef=3D&quot;http://free-paranormalinvestigating.com/%3C/div%3E%3C/div%3E%3Cp%20/%=\r\n3E%3Cdiv%20class=3D&quot; target=3D_blank&gt;&lt;/P&gt;&lt;/DIV&gt;&lt;/FORM&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;BLOCKQUOTE&gt;=\r\n\n&lt;HR id=3DEC_stopSpelling&gt;\nTo: EVP-ITC@yahoogroups.com&lt;BR&gt;From: warrior18ei=\r\ni@...&lt;BR&gt;Date: Fri, 16 Nov 2007 05:35:38 -0800&lt;BR&gt;Subject: Re: [EVP-I=\r\nTC] my opinion on the mini box&lt;BR&gt;&lt;BR&gt;\n&lt;META content=3D&quot;Microsoft SafeHTML&quot;=\r\n name=3DGenerator&gt;\n&lt;DIV id=3DEC_ygrp-mlmsg style=3D&quot;WIDTH: 655px&quot;&gt;\n&lt;DIV id=\r\n=3DEC_ygrp-msg style=3D&quot;PADDING-RIGHT: 15px; PADDING-LEFT: 0px; Z-INDEX: 1;=\r\n FLOAT: left; PADDING-BOTTOM: 0px; WIDTH: 490px; PADDING-TOP: 0px&quot;&gt;\n&lt;DIV id=\r\n=3DEC_ygrp-text&gt;\n\n&lt;DIV style=3D&quot;FONT-SIZE: 12pt; FONT-FAMILY: times new rom=\r\nan, new york, times, serif&quot;&gt;\n&lt;DIV style=3D&quot;FONT-SIZE: 12pt; FONT-FAMILY: ti=\r\nmes new roman,new york,times,serif&quot;&gt;&lt;STRONG style=3D&quot;FONT-STYLE: italic&quot;&gt;&quot;I=\r\n have experience with them that most people just dream about...or fear.&nbs=\r\np; I have been carressed,&nbsp; molested, &nbsp;poked,&nbsp; probed,&nbsp; =\r\nslapped,&nbsp; punched,&nbsp; knocked down and physically&nbsp;&lt;EM&gt;Picked U=\r\np&lt;/EM&gt;&nbsp;by a&nbsp;Ghost.&quot;&lt;BR&gt;&lt;BR&gt;&lt;/STRONG&gt;&lt;STRONG&gt;&lt;SPAN style=3D&quot;FONT-W=\r\nEIGHT: normal&quot;&gt;Rod,&lt;BR&gt;&lt;BR&gt;I have seen these words before from many differe=\r\nnt people, both on the web and in real life. Every one of them changed ther=\r\ne tune when they made contact (real contact). Citing that they didn&#39;t know =\r\nit was possible. In your words you are a ghost hunter and not an expert (ev=\r\nen though you give your GH resume wanting us all to believe so). Ghost hunt=\r\ner thrive on proof! They almost worship the words proof and evidence. The f=\r\nact is that many of us; Sumption, Bruce, Misty, Steve, myself and many othe=\r\nrs have presented proof on a daily basis using a myriad of different method=\r\ns to obtain it. The quote I have placed above, taken from your own post are=\r\n just words. &lt;BR&gt;&lt;BR&gt;Open your mind a bit. As was said earlier you will exp=\r\nerience what you expect to experience.&lt;BR&gt;&lt;BR&gt;Frank R.&lt;BR&gt;&lt;/SPAN&gt;&lt;/STRONG&gt;&lt;=\r\nSTRONG style=3D&quot;FONT-STYLE: italic&quot;&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: bold&quot;&gt;&lt;SPAN=\r\n style=3D&quot;FONT-STYLE: italic&quot;&gt;&lt;SPAN style=3D&quot;FONT-WEIGHT: bold&quot;&gt;&lt;/SPAN&gt;&lt;/SP=\r\nAN&gt;&lt;/SPAN&gt;&lt;/STRONG&gt;&lt;BR&gt;\n&lt;DIV style=3D&quot;FONT-SIZE: 12pt; FONT-FAMILY: times n=\r\new roman,new york,times,serif&quot;&gt;----- Original Message ----&lt;BR&gt;From: erick h=\r\nunter &lt;erick_hunter9@&lt;WBR&gt;yahoo.com&gt;&lt;BR&gt;To: EVP-ITC@yahoogroups&lt;WBR&gt;.=\r\ncom&lt;BR&gt;Sent: Thursday, November 15, 2007 5:42:06 PM&lt;BR&gt;Subject: RE: [EVP-IT=\r\nC] my opinion on the mini box&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3DEC_ygrp-text&gt;\n&lt;P&gt;&lt;BR&gt;\n&lt;DIV&gt;=\r\n&lt;STRONG&gt;Bruce,&nbsp; the boxes aside,&nbsp; I am talking about Ghosts, peri=\r\nod.&nbsp; The boxes are for simple communication,&nbsp; not inter-acting.&n=\r\nbsp; When I say &quot;inter-acting&quot; I don&#39;t mean trade a few words,&nbsp; I&#39;m re=\r\nferring to &lt;EM&gt;Meaningful&lt;/EM&gt; interaction.&nbsp; Making a &lt;EM&gt;Statement&lt;/E=\r\nM&gt;,&nbsp; passing on a message to me or a living relative,&nbsp; predicting=\r\n or causing &quot;physical&quot; inferances.&nbsp;&nbsp;&nbsp;I&#39;ve experienced every =\r\nkind of Ghost,&nbsp; I feel certain,&nbsp; all over the world.&nbsp; I have=\r\n experience with them that most people just dream about...or fear.&nbsp; I =\r\nhave been carressed,&nbsp; molested, &nbsp;poked,&nbsp; probed,&nbsp; slapp=\r\ned,&nbsp; punched,&nbsp; knocked down and physically&nbsp;&lt;EM&gt;Picked Up&lt;/EM=\r\n&gt;&nbsp;by a&nbsp;Ghost.&nbsp; I have confronted them face-to-face while the=\r\ny were both visible and invisable.&nbsp; I have numerous times held convers=\r\nations with them via voice recorder and once even one-on-one (it was the ex=\r\nperience of a life-time!).&nbsp; I was Hunting Ghosts many, many&nbsp;years=\r\n before it became a fad,&nbsp; or cool&nbsp;to do so.&nbsp; And,&nbsp; beli=\r\neve me,&nbsp; I am far from being an &quot;expert&quot;.&nbsp; I do not presume on Gh=\r\nosts or their personalities.&nbsp; Every time in the past that I&#39;ve done so=\r\n,&nbsp; I&#39;ve been rocked back on my heels,&nbsp; psychologically speaking. =\r\nSome are good,&nbsp; some are not.&nbsp; Many of them very much enjoy makin=\r\ng you the fool (that&#39;s a lot easier done&nbsp;with some people than are&nbs=\r\np;others!)&nbsp;.&nbsp;&nbsp;&lt;/STRONG&gt;&lt;BR&gt;&lt;STRONG&gt;It doesn&#39;t matter in the =\r\nslightest &lt;EM&gt;what you Think of them,&lt;/EM&gt;&nbsp; They are what they are,&nb=\r\nsp; and &quot;being a friend&quot; is definitely not on their list of priorities!&nbs=\r\np; That goes for &lt;EM&gt;All &lt;/EM&gt;of them.&nbsp; They will play with you.&nbsp;=\r\n They will lie to you.&nbsp; They will tell, or imply to&nbsp;you, what the=\r\ny know you want to hear,&nbsp; that or they will laugh at you.&nbsp; I have=\r\n personally&nbsp;heard their laughter,&nbsp; on more than one occasion.&nbs=\r\np; The first step in beginning to understand Ghosts is to quit watching stu=\r\npid&nbsp;TV Ghost Dramas,&nbsp; and learn to be discernful about &lt;EM&gt;Realit=\r\ny&lt;/EM&gt;.&nbsp; God bless, anyway.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; =\r\n--Rod&lt;/STRONG&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n=\r\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;bruce halliday &lt;paranormalinvestiga tin=\r\ng@hotmail. com&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/DIV&gt;\n&lt;BLOCKQUOTE class=3DEC_replbq&gt;\n&lt;DIV=\r\n id=3DEC_ygrp-text&gt;\n&lt;DIV&gt;Rod,&lt;BR&gt;&nbsp;&lt;BR&gt;No disrespect but how do you kno=\r\nw what ghosts have&lt;BR&gt;the where with all to do? I speak with them through f=\r\nrank and joe&#39;s box on a daily basis and consider the&lt;BR&gt;two that are commun=\r\nicating daily to be friends. I believe you are speaking of grounded spirits=\r\n not etherals &lt;BR&gt;and ghosts that are grounded most definately interact wit=\r\nh us. residual ghosts and hauntings do not that is why&lt;BR&gt;there is a distin=\r\nction between the two intelligent and residual hauntings. but we are not ta=\r\nlking generaly about &lt;BR&gt;haunting spirits that communicate through frank an=\r\nd joe&#39;s boxes, but all types of entities and don&#39;t call anyone &lt;BR&gt;dillusio=\r\nnal unless you yourself have experienced your own research with the boxes.&lt;=\r\nBR&gt;&nbsp;&lt;BR&gt;Bruce&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;&nbsp;&lt;BR&gt;\n&lt;DIV&gt;\n&lt;DIV align=3Dcenter&gt;&lt;FONT si=\r\nze=3D4&gt;&lt;FONT color=3D#0033cc&gt;&lt;STRONG&gt;&lt;EM&gt;&lt;FONT color=3D#000000 size=3D5&gt;Bru=\r\nce Halliday &lt;BR&gt;&lt;/FONT&gt;&lt;/EM&gt;&lt;FONT color=3D#000000&gt;Paranormal Investigating =\r\nTeam &lt;/FONT&gt;&lt;/STRONG&gt;&lt;BR&gt;&lt;A href=3D&quot;http://free-paranormalinvestigating.com=\r\n/%3C/div%3E%3C/div%3E%3Cp%20/%3E%3Cdiv%20class=3D&quot; target=3D_blank rel=3Dno=\r\nfollow&gt;&lt;/A&gt;&lt;/FONT&gt;&lt;A href=3D&quot;http://free-paranormalinvestigating.com/%3C/di=\r\nv%3E%3C/div%3E%3Cp%20/%3E%3Cdiv%20class=3D&quot; target=3D_blank rel=3Dnofollow&gt;=\r\n&lt;/A&gt;&lt;/FONT&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;A href=3D&quot;http://free-paranormalinvestigating.com/%=\r\n3C/div%3E%3C/div%3E%3Cp%20/%3E%3Cdiv%20class=3D&quot; target=3D_blank rel=3Dnofo=\r\nllow&gt;&lt;BR&gt;&lt;BR&gt;&lt;/A&gt;\n&lt;BLOCKQUOTE&gt;&lt;A href=3D&quot;http://free-paranormalinvestigatin=\r\ng.com/%3C/div%3E%3C/div%3E%3Cp%20/%3E%3Cdiv%20class=3D&quot; target=3D_blank rel=\r\n=3Dnofollow&gt;&lt;/A&gt;\n&lt;HR id=3DEC_EC_stopSpelling&gt;\n&lt;A href=3D&quot;http://free-parano=\r\nrmalinvestigating.com/%3C/div%3E%3C/div%3E%3Cp%20/%3E%3Cdiv%20class=3D&quot; tar=\r\nget=3D_blank rel=3Dnofollow&gt;To: EVP-ITC@yahoogroups .com&lt;BR&gt;From: erick_hun=\r\nter9@ &lt;/A&gt;&lt;A href=3D&quot;http://yahoo.com/&quot; target=3D_blank&gt;yahoo.com&lt;/A&gt;&lt;BR&gt;Da=\r\nte: Thu, 15 Nov 2007 14:18:55 -0800&lt;BR&gt;Subject: Re: [EVP-ITC] my opinion on=\r\n the mini box&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3DEC_EC_ygrp-mlmsg&gt;\n&lt;DIV id=3DEC_EC_ygrp-msg&gt;=\r\n\n&lt;DIV id=3DEC_EC_ygrp-text&gt;\n&lt;DIV&gt;&lt;STRONG&gt;I certainly agree with the point o=\r\nf Bruces&#39; statement,&nbsp; but I fear he&#39;s being delusional about &quot;friends&quot;=\r\n from&nbsp;the other side affecting some inter-action between a box and the=\r\n user,&nbsp; not letting one work,&nbsp; the box chosing it&#39;s owner,&nbsp; =\r\netc., etc., etc.&nbsp; In the first place Ghosts are &lt;EM&gt;Not &lt;/EM&gt;our &lt;EM&gt;F=\r\nriends!&nbsp; That&#39;s pure, unadulterated Fantasy.&lt;/EM&gt;&lt;/STRONG&gt;&lt;/DIV&gt;\n&lt;DIV&gt;=\r\n&lt;STRONG&gt;The Ghosts do not have the where-with-all to accomplish this in the=\r\n first place, and even&nbsp;if they did they&nbsp;don&#39;t give a rats&#39; rear e=\r\nnd what a Ghost Hunter does or doesn&#39;t do.&nbsp; That boy really needs to g=\r\net real.&nbsp; Ghosts simply do not re-act to the living in that way, or mu=\r\nch of any other way except to allow us to see or hear them and then only wh=\r\nen they want it to happen.&nbsp; Their most obvious and&nbsp;biggest trait =\r\nis to be totally indifferent to our wishes.&lt;/STRONG&gt;&nbsp;&nbsp; &lt;STRONG&gt;Ov=\r\ner 40 yrs. of Investigating the Paranormal has taught me nothing if it hasn=\r\n&#39;t taught me this.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; --Rod&lt;/STRONG&gt;&lt;/DIV&gt;\n&lt;DIV&gt;=\r\n&lt;B&gt;&lt;I&gt;&lt;/I&gt;&lt;/B&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;B&gt;&lt;I&gt;&lt;/I&gt;&lt;/B&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;B&gt;&lt;I&gt;&nbsp=\r\n;velazquez &lt;ghostchasingfool@ &lt;A href=3D&quot;http://yahoo.com/&quot; target=3D_bl=\r\nank&gt;yahoo.com&lt;/A&gt;&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/DIV&gt;\n&lt;BLOCKQUOTE class=3DEC_EC_replbq=\r\n&gt;\n&lt;DIV id=3DEC_EC_ygrp-text&gt;\n&lt;DIV&gt;Here, here Bruce.&nbsp; I am glad others =\r\nwho a genuine support my outlook, I couldn&#39;t agree more!&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;bhali=\r\n333 &lt;paranormalinvestiga ting@hotmail. com&gt;&lt;/I&gt;&lt;/B&gt; wrote: \n&lt;BLOCKQUO=\r\nTE class=3DEC_EC_replbq&gt;\n&lt;DIV id=3DEC_EC_ygrp-text&gt;\n&lt;DIV&gt;since I dropped th=\r\ne bomb about this mini box to Frank s. yesterday I &lt;BR&gt;did not expect such =\r\na fervent hoopla about it.So I will give my box &lt;BR&gt;experienced opinion aft=\r\ner lengthy research with both Frank&#39;s and &lt;BR&gt;Joe&#39;s boxes. I have contacted=\r\n the manufacturer for an explanation, he &lt;BR&gt;instructed me to listen to the=\r\n audio file and view the demo video on &lt;BR&gt;his site. After doing so my opin=\r\nion on this box and the builders &lt;BR&gt;intentions for it is.&lt;BR&gt;&lt;BR&gt;The box i=\r\ntself is not a knock off of Frank&#39;s box but a cheap and &lt;BR&gt;ineffective ver=\r\nsion of Joe&#39;s box,It works on an AM band instead of an &lt;BR&gt;FM band as Joe&#39;s=\r\n box does. Another big difference is Joe&#39;s box &lt;BR&gt;actually works and you h=\r\nave all heard the files I have posted from &lt;BR&gt;sessions with it. After list=\r\nening to this box and seeing it in &lt;BR&gt;operation I feel that anyone who pur=\r\nchases this box will be very &lt;BR&gt;disappointed and will not receive any cont=\r\nact from it and even if &lt;BR&gt;they did they probably would not even realise i=\r\nt for the simple fact &lt;BR&gt;that you have to have a certain amount of experie=\r\nnce with box &lt;BR&gt;research and operation before developing an ear for pickin=\r\ng up real &lt;BR&gt;time communication and also creating a bond with the spirit f=\r\nriends &lt;BR&gt;on the other side and also a measure of trust on both sides.&lt;BR&gt;=\r\n&lt;BR&gt;I believe the manufacturer to be a capitalist and only interested in &lt;B=\r\nR&gt;the monetary reward to be gained from offering this cheap and &lt;BR&gt;ineffec=\r\ntive copy to unsuspecting and naive individuals who are &lt;BR&gt;interested in t=\r\nhis medium. I do not like to bad mouth anyone, it &lt;BR&gt;usually comes back to=\r\n bite you in the ass but I believe that our &lt;BR&gt;friends on the other side k=\r\nnow of our intentions and would not allow &lt;BR&gt;someone with the wrong intent=\r\nions to develop a working tool for &lt;BR&gt;communication. also I believe that a=\r\n person does not pick the box the &lt;BR&gt;box picks the person. &lt;BR&gt;&lt;BR&gt;So let =\r\nhim have his short and lucrative run with this fooling &lt;BR&gt;unsuspecting cli=\r\nents, bad karma always comes home.&lt;BR&gt;&lt;BR&gt;Bruce&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQ=\r\nUOTE&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;EM&gt;&lt;STRONG&gt;&lt;FONT color=3D#0000ff&gt;The contents=\r\n of this eletronic correspondence is private &amp; confidential and meant o=\r\nnly for the party and/or parties it is addressed to.&nbsp; &lt;/FONT&gt;&lt;/STRONG&gt;=\r\n&lt;/EM&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;EM&gt;&lt;STRONG&gt;&lt;FONT color=3D#0000ff&gt;&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/EM&gt;&nb=\r\nsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;EM&gt;&lt;STRONG&gt;&lt;FONT color=3D#0000ff&gt;No part of this email tran=\r\nsmission may be publicly posted or forwarded to other parties without expli=\r\ncit written permission.&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/EM&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;=\r\n/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;SPAN style=3D&quot;COLOR: white&quot;&gt;&lt;/=\r\nSPAN&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;SPAN style=3D&quot;HEIGHT: 2px; BACKGROUND-CO=\r\nLOR: black&quot;&gt;&lt;/SPAN&gt;Boo!&nbsp;Scare away worms, viruses and so much more! Tr=\r\ny Windows Live OneCare! &lt;A href=3D&quot;http://onecare.live.com/standard/en-us/p=\r\nurchase/trial.aspx?s_cid=3Dwl_hotmailnews&quot; target=3D_blank rel=3Dnofollow&gt;T=\r\nry now!&lt;/A&gt; \n&lt;DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;=\r\n&lt;/DIV&gt;&lt;BR&gt;\n&lt;HR SIZE=3D1&gt;\nGet easy, one-click access to your favorites. &lt;A h=\r\nref=3D&quot;http://us.rd.yahoo.com/evt=3D51443/*http://www.yahoo.com/r/hs&quot; targe=\r\nt=3D_blank&gt;Make Yahoo! your homepage.&lt;/A&gt; \n&lt;BR&gt;&lt;/DIV&gt;&lt;SPAN style=3D&quot;COLOR: =\r\nwhite&quot;&gt;&lt;/SPAN&gt; \n&lt;STYLE&gt;\n.ExternalClass #EC_ygrp-mkp\n{border:1px solid #d8d8=\r\nd8;font-family:Arial;padding:0px 14px;}\n.ExternalClass #EC_ygrp-mkp hr\n{bor=\r\nder:1px solid #d8d8d8;}\n.ExternalClass #EC_ygrp-mkp #EC_hd\n{color:#628c2a;f=\r\nont-size:85%;font-weight:bold;line-height:122%;}\n.ExternalClass #EC_ygrp-mk=\r\np #EC_ads\n{margin-bottom:10px;}\n.ExternalClass #EC_ygrp-mkp .EC_ad\n{padding=\r\n:0 0;}\n.ExternalClass #EC_ygrp-mkp .EC_ad a\n{color:#0000ff;text-decoration:=\r\nnone;}\n\n&lt;/STYLE&gt;\n\n&lt;STYLE&gt;\n.ExternalClass #EC_ygrp-sponsor #EC_ygrp-lc\n{font=\r\n-family:Arial;}\n.ExternalClass #EC_ygrp-sponsor #EC_ygrp-lc #EC_hd\n{font-we=\r\night:bold;font-size:78%;line-height:122%;}\n.ExternalClass #EC_ygrp-sponsor =\r\n#EC_ygrp-lc .EC_ad\n{margin-bottom:10px;padding:0 0;}\n\n&lt;/STYLE&gt;\n\n&lt;STYLE&gt;\n.Ex=\r\nternalClass #EC_ygrp-mlmsg\n{font-size:13px;font-family:arial,helvetica,clea=\r\nn,sans-serif;}\n.ExternalClass #EC_ygrp-mlmsg table\n{font-size:inherit;font:=\r\n100%;}\n.ExternalClass #EC_ygrp-mlmsg select, .ExternalClass input, .Externa=\r\nlClass textarea\n{font:99% arial,helvetica,clean,sans-serif;}\n.ExternalClass=\r\n #EC_ygrp-mlmsg pre, .ExternalClass code\n{font:115% monospace;}\n.ExternalCl=\r\nass #EC_ygrp-mlmsg EC_*\n{line-height:1.22em;}\n.ExternalClass #EC_ygrp-text\n=\r\n{font-family:Georgia;}\n.ExternalClass #EC_ygrp-text p\n{;}\n.ExternalClass #E=\r\nC_ygrp-tpmsgs\n{font-family:Arial;clear:both;}\n.ExternalClass #EC_ygrp-vitna=\r\nv\n{padding-top:10px;font-family:Verdana;font-size:77%;}\n.ExternalClass #EC_=\r\nygrp-vitnav a\n{padding:0 1px;}\n.ExternalClass #EC_ygrp-actbar\n{clear:both;w=\r\nhite-space:nowrap;color:#666;text-align:right;}\n.ExternalClass #EC_ygrp-act=\r\nbar .EC_left\n{float:left;white-space:nowrap;}\n.ExternalClass .EC_bld\n{font-=\r\nweight:bold;}\n.ExternalClass #EC_ygrp-grft\n{font-family:Verdana;font-size:7=\r\n7%;padding:15px 0;}\n.ExternalClass #EC_ygrp-ft\n{font-family:verdana;font-si=\r\nze:77%;border-top:1px solid #666;padding:5px 0;}\n.ExternalClass #EC_ygrp-ml=\r\nmsg #EC_logo\n{padding-bottom:10px;}\n.ExternalClass #EC_ygrp-vital\n{backgrou=\r\nnd-color:#e0ecee;margin-bottom:20px;padding:2px 0 8px 8px;}\n.ExternalClass =\r\n#EC_ygrp-vital #EC_vithd\n{font-size:77%;font-family:Verdana;font-weight:bol=\r\nd;color:#333;text-transform:uppercase;}\n.ExternalClass #EC_ygrp-vital ul\n{p=\r\nadding:0;}\n.ExternalClass #EC_ygrp-vital ul li\n{list-style-type:none;clear:=\r\nboth;border:1px solid #e0ecee;}\n.ExternalClass #EC_ygrp-vital ul li .EC_ct\n=\r\n{font-weight:bold;color:#ff7900;float:right;width:2em;text-align:right;padd=\r\ning-right:.5em;}\n.ExternalClass #EC_ygrp-vital ul li .EC_cat\n{font-weight:b=\r\nold;}\n.ExternalClass #EC_ygrp-vital a\n{text-decoration:none;}\n.ExternalClas=\r\ns #EC_ygrp-vital a:hover\n{text-decoration:underline;}\n.ExternalClass #EC_yg=\r\nrp-sponsor #EC_hd\n{color:#999;font-size:77%;}\n.ExternalClass #EC_ygrp-spons=\r\nor #EC_ov\n{padding:6px 13px;background-color:#e0ecee;margin-bottom:20px;}\n.=\r\nExternalClass #EC_ygrp-sponsor #EC_ov ul\n{padding:0 0 0 8px;}\n.ExternalClas=\r\ns #EC_ygrp-sponsor #EC_ov li\n{list-style-type:square;padding:6px 0;font-siz=\r\ne:77%;}\n.ExternalClass #EC_ygrp-sponsor #EC_ov li a\n{text-decoration:none;f=\r\nont-size:130%;}\n.ExternalClass #EC_ygrp-sponsor #EC_nc\n{background-color:#e=\r\nee;margin-bottom:20px;padding:0 8px;}\n.ExternalClass #EC_ygrp-sponsor .EC_a=\r\nd\n{padding:8px 0;}\n.ExternalClass #EC_ygrp-sponsor .EC_ad #EC_hd1\n{font-fam=\r\nily:Arial;font-weight:bold;color:#628c2a;font-size:100%;line-height:122%;}\n=\r\n.ExternalClass #EC_ygrp-sponsor .EC_ad a\n{text-decoration:none;}\n.ExternalC=\r\nlass #EC_ygrp-sponsor .EC_ad a:hover\n{text-decoration:underline;}\n.External=\r\nClass #EC_ygrp-sponsor .EC_ad p\n{;}\n.ExternalClass EC_o\n{font-size:0;}\n.Ext=\r\nernalClass .EC_MsoNormal\n{;}\n.ExternalClass #EC_ygrp-text tt\n{font-size:120=\r\n%;}\n.ExternalClass blockquote\n{;}\n.ExternalClass .EC_replbq\n{;}\n\n&lt;/STYLE&gt;\n&lt;=\r\n/BLOCKQUOTE&gt;&lt;/FONT&gt;&lt;/FONT&gt;&lt;br /&gt;&lt;hr /&gt;Peek-a-boo FREE Tricks & Treats for Y=\r\nou! &lt;a href=3D&#39;http://www.reallivemoms.com?ocid=3DTXT_TAGHM&loc=3Dus&#39; targe=\r\nt=3D&#39;_new&#39;&gt;Get &#39;em!&lt;/a&gt;&lt;/body&gt;\n&lt;/html&gt;\r\n--_262f7e35-b605-4ddf-8982-b45dc711dfc3_--"}