{"id": "3028", "subject": "Re: my opinion on the mini box", "author": "babiarz3", "timestamp": "2007-11-16T14:16:28Z", "full_text": "It would be naive of any of us to be surprised by this attempt to mass\nproduce. Truthfully, I am surprised that it took as long as it did. My\nquestion would be in regards to a guarantee. Will monies be returned\nwhen this mini-box does not work? Notice I say when and not if. \nOne of the biggest controversies surrounding the box, besides the\ninability to prove by scientific means that it truly is communication\nfrom other dimensions, is the statement regarding 30 people being able\nto use the box effectively.\nEveryone wants to balk at this thought. Egos won&#39;t allow consideration\nof a possible truth to that statement. Initially, my own ego had me\nbelieving I was one of the &quot;chosen&quot;. Thankfully I am aware of my ego\nand quickly realized that my chances were pretty slim. As time goes\nby, I hear about more and more people building their own TTTD,\nfollowing Frank&#39;s schematics. It is almost always quickly followed by\nan announcement that the box does no more than pick up neighbors pizza\norders or a child&#39;s confession of their secret crush through walkie\ntalkies. Science will not allow them to consider that the problem is\nnot with the box but, the user. \nIn the last quarter of the 1800&#39;s John Keely developed an induction\nresonance motion motor which used &quot;etheric technology&quot;. His theory\nbeing that everything in the universe worked on a vibration level. His\nexperiments to tap into the etheric involved water and vibrations.\nApparently, he was able to use his machines while his collegues were\nnot. Because of this, skeptics and pseudoskeptics claim Keely was a\nfraud. \nIn after death communication from Konstantin Raudive, Raudive says &quot;It\ncan only work when the vibrations of those present are in complete\nharmony and when their aims and intentions are pure.&quot; \nOn Contact Fields ( On communication from spirits through ITC that say\nITC depends on contact fields or a pool of life energy composed of the\nthoughts and attitudes of all researchers involved (both living and\nspirits) in an ITC project): &quot;When everyone&#39;s thoughts are in harmony,\nthe contact field is clear. They can see into our world and work with\nour equipment. But, if there is dissonance in the form of fears,\ndoubts, and animosities, the contact field becomes cloudy, and it is\nimpossible for them to see into our world and work with us. That&#39;s\nwhen negative spirit groups close to the earth in vibration can break\ninto existing bridges, with troubling results. Troubled feelings seem\nto open the field to troubled spirit worlds as they close down the\nfield to the finer worlds.&quot;\nResonance is a state of going with the flow. When vibration is\nsynchronized, less and less energy is required to excite the system.\nPure resonance allows a system, once vibrating, to keep vibrating\nindefinitely.\nSo, communication has been made from the other side that allows for\nthe idea of &quot;30&quot;. Yet, those who devote a good deal of their lives to\nattempting to communicate with the other side, choose to ignore this.\nWhen their devices do not work it because Frank, Christopher, etc are\nfrauds. \nHow will the developers of the K-Mart knock off &quot;mini-box&quot; handle the\ndemand for money back? I suggest they don&#39;t spend a dime of their\nprofit for quite some time. It&#39;s not going to be pretty. \n\nBabs\nwww.thepsinetwork.com\n\n--- In EVP-ITC@yahoogroups.com, bruce halliday\n&lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; Frank,\n&gt;  \n&gt; I think the people who should know, do know how aware they really are.\n&gt;  \n&gt; And then you have the guy&#39;s like rod that are stuck in that taps\nmentality\n&gt; and the guy has the nerve to tell me to stop watching ghost tv shows !\n&gt;  \n&gt; bruce\n&gt; \n&gt; Bruce Halliday Paranormal Investigating Team \n&gt; \n&gt; \n&gt; To: evp-itc@...: franks-boxes@...: Thu, 15 Nov 2007 21:12:55\n-0700Subject: RE: [EVP-ITC] my opinion on the mini box\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; So which one of these in not interactive, and shows they are quite\naware?  Frank-S\n&gt; \n&gt; \n&gt; Climb to the top of the charts!  Play Star Shuffle:  the word\nscramble challenge with star power. Play Now! \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Windows Live Hotmail and Microsoft Office Outlook  together at\nlast.  Get it now.\n&gt;\nhttp://office.microsoft.com/en-us/outlook/HA102225181033.aspx?pid=CL100626971033\n&gt;"}