{"id": "3029", "subject": "Re: [EVP-ITC] my opinion on the mini box", "author": "Lisby", "timestamp": "2007-11-16T14:36:36Z", "full_text": "Rod-- I think you&#39;ve missed out, buddy. I&#39;ve had loving relationships  \nwith spirit entities for decades. Too bad one never came your way. It  \nmight make you feel differently about blanket statements like &quot;&#39;being  \na friend&#39; is not on their list of priorities! That goes for all of  \nthem.&quot; My own three decades of involvement with contact with the  \nOther Side--and I have also been ghost hunting many years before it  \nbecame a fad--that they are fully capable of loving interaction, and  \ndo so on a regular basis if they so choose.\n\nAnn\n\n\nOn Nov 15, 2007, at 6:42 PM, erick hunter wrote:\n\n&gt;\n&gt; Bruce,  the boxes aside,  I am talking about Ghosts, period.  The  \n&gt; boxes are for simple communication,  not inter-acting.  When I say  \n&gt; &quot;inter-acting&quot; I don&#39;t mean trade a few words,  I&#39;m referring to  \n&gt; Meaningful interaction.  Making a Statement,  passing on a message  \n&gt; to me or a living relative,  predicting or causing &quot;physical&quot;  \n&gt; inferances.   I&#39;ve experienced every kind of Ghost,  I feel  \n&gt; certain,  all over the world.  I have experience with them that  \n&gt; most people just dream about...or fear.  I have been carressed,   \n&gt; molested,  poked,  probed,  slapped,  punched,  knocked down and  \n&gt; physically Picked Up by a Ghost.  I have confronted them face-to- \n&gt; face while they were both visible and invisable.  I have numerous  \n&gt; times held conversations with them via voice recorder and once even  \n&gt; one-on-one (it was the experience of a life-time!).  I was Hunting  \n&gt; Ghosts many, many years before it became a fad,  or cool to do so.   \n&gt; And,  believe me,  I am far from being an &quot;expert&quot;.  I do not  \n&gt; presume on Ghosts or their personalities.  Every time in the past  \n&gt; that I&#39;ve done so,  I&#39;ve been rocked back on my heels,   \n&gt; psychologically speaking. Some are good,  some are not.  Many of  \n&gt; them very much enjoy making you the fool (that&#39;s a lot easier done  \n&gt; with some people than are others!) .\n&gt; It doesn&#39;t matter in the slightest what you Think of them,  They  \n&gt; are what they are,  and &quot;being a friend&quot; is definitely not on their  \n&gt; list of priorities!  That goes for All of them.  They will play  \n&gt; with you.  They will lie to you.  They will tell, or imply to you,  \n&gt; what they know you want to hear,  that or they will laugh at you.   \n&gt; I have personally heard their laughter,  on more than one  \n&gt; occasion.  The first step in beginning to understand Ghosts is to  \n&gt; quit watching stupid TV Ghost Dramas,  and learn to be discernful  \n&gt; aboutReality.  God bless, anyway.        --Rod\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; bruce halliday &lt;paranormalinvestigating@...&gt; wrote:\n&gt; Rod,\n&gt;\n&gt; No disrespect but how do you know what ghosts have\n&gt; the where with all to do? I speak with them through frank and joe&#39;s  \n&gt; box on a daily basis and consider the\n&gt; two that are communicating daily to be friends. I believe you are  \n&gt; speaking of grounded spirits not etherals\n&gt; and ghosts that are grounded most definately interact with us.  \n&gt; residual ghosts and hauntings do not that is why\n&gt; there is a distinction between the two intelligent and residual  \n&gt; hauntings. but we are not talking generaly about\n&gt; haunting spirits that communicate through frank and joe&#39;s boxes,  \n&gt; but all types of entities and don&#39;t call anyone\n&gt; dillusional unless you yourself have experienced your own research  \n&gt; with the boxes.\n&gt;\n&gt; Bruce\n&gt;\n&gt;\n&gt;\n&gt; Bruce Halliday\n&gt; Paranormal Investigating Team\n&gt;\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; From: erick_hunter9@...\n&gt; Date: Thu, 15 Nov 2007 14:18:55 -0800\n&gt; Subject: Re: [EVP-ITC] my opinion on the mini box\n&gt;\n&gt; I certainly agree with the point of Bruces&#39; statement,  but I fear  \n&gt; he&#39;s being delusional about &quot;friends&quot; from the other side affecting  \n&gt; some inter-action between a box and the user,  not letting one  \n&gt; work,  the box chosing it&#39;s owner,  etc., etc., etc.  In the first  \n&gt; place Ghosts are Not our Friends!  That&#39;s pure, unadulterated Fantasy.\n&gt; The Ghosts do not have the where-with-all to accomplish this in the  \n&gt; first place, and even if they did they don&#39;t give a rats&#39; rear end  \n&gt; what a Ghost Hunter does or doesn&#39;t do.  That boy really needs to  \n&gt; get real.  Ghosts simply do not re-act to the living in that way,  \n&gt; or much of any other way except to allow us to see or hear them and  \n&gt; then only when they want it to happen.  Their most obvious and  \n&gt; biggest trait is to be totally indifferent to our wishes.   Over 40  \n&gt; yrs. of Investigating the Paranormal has taught me nothing if it  \n&gt; hasn&#39;t taught me this.      --Rod\n&gt;\n&gt;\n&gt;  velazquez &lt;ghostchasingfool@...&gt; wrote:\n&gt; Here, here Bruce.  I am glad others who a genuine support my  \n&gt; outlook, I couldn&#39;t agree more!\n&gt;\n&gt; bhali333 &lt;paranormalinvestigating@hotmail.com&gt; wrote:\n&gt; since I dropped the bomb about this mini box to Frank s. yesterday I\n&gt; did not expect such a fervent hoopla about it.So I will give my box\n&gt; experienced opinion after lengthy research with both Frank&#39;s and\n&gt; Joe&#39;s boxes. I have contacted the manufacturer for an explanation, he\n&gt; instructed me to listen to the audio file and view the demo video on\n&gt; his site. After doing so my opinion on this box and the builders\n&gt; intentions for it is.\n&gt;\n&gt; The box itself is not a knock off of Frank&#39;s box but a cheap and\n&gt; ineffective version of Joe&#39;s box,It works on an AM band instead of an\n&gt; FM band as Joe&#39;s box does. Another big difference is Joe&#39;s box\n&gt; actually works and you have all heard the files I have posted from\n&gt; sessions with it. After listening to this box and seeing it in\n&gt; operation I feel that anyone who purchases this box will be very\n&gt; disappointed and will not receive any contact from it and even if\n&gt; they did they probably would not even realise it for the simple fact\n&gt; that you have to have a certain amount of experience with box\n&gt; research and operation before developing an ear for picking up real\n&gt; time communication and also creating a bond with the spirit friends\n&gt; on the other side and also a measure of trust on both sides.\n&gt;\n&gt; I believe the manufacturer to be a capitalist and only interested in\n&gt; the monetary reward to be gained from offering this cheap and\n&gt; ineffective copy to unsuspecting and naive individuals who are\n&gt; interested in this medium. I do not like to bad mouth anyone, it\n&gt; usually comes back to bite you in the ass but I believe that our\n&gt; friends on the other side know of our intentions and would not allow\n&gt; someone with the wrong intentions to develop a working tool for\n&gt; communication. also I believe that a person does not pick the box the\n&gt; box picks the person.\n&gt;\n&gt; So let him have his short and lucrative run with this fooling\n&gt; unsuspecting clients, bad karma always comes home.\n&gt;\n&gt; Bruce\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; The contents of this eletronic correspondence is private &  \n&gt; confidential and meant only for the party and/or parties it is  \n&gt; addressed to.\n&gt;\n&gt; No part of this email transmission may be publicly posted or  \n&gt; forwarded to other parties without explicit written permission.\n&gt;\n&gt;\n&gt;\n&gt; Boo! Scare away worms, viruses and so much more! Try Windows Live  \n&gt; OneCare! Try now!\n&gt;\n&gt;\n&gt; \n\n\nRod-- I hink you' e missed ou , buddy. I' e had lo ing ela ionships wi h spi i en i ies o decades. Too bad one ne e came you way. I migh make you eel di e en ly abou blanke s a emen s like \"'being a iend' is no on hei lis o p io i ies! Tha goes o all o hem.\" My own h ee decades o in ol emen wi h con ac wi h he O he Side--and I ha e also been ghos hun ing many yea s be o e i became a ad-- ha hey a e ully capable o lo ing in e ac ion, and do so on a egula basis i hey so choose.AnnOn No 15, 2007, a 6:42 PM, e ick hun e w o e:B uce,  he boxes aside,  I am alking abou Ghos s, pe iod.  The boxes a e o simple communica ion,  no in e -ac ing.  When I say \"in e -ac ing\" I don' mean ade a ew wo ds,  I'm e e ing o Meaning ul in e ac ion.  Making a S a emen ,  passing on a message o me o a li ing ela i e,  p edic ing o causing \"physical\" in e ances.   I' e expe ienced e e y kind o Ghos ,  I eel ce ain,  all o e he wo ld.  I ha e expe ience wi h hem ha mos people jus d eam abou ...o ea .  I ha e been ca essed,  moles ed,  poked,  p obed,  slapped,  punched,  knocked down and physically Picked Up by a Ghos .  I ha e con on ed hem ace- o- ace while hey we e bo h isible and in isable.  I ha e nume ous imes held con e sa ions wi h hem ia oice eco de and once e en one-on-one (i was he expe ience o a li e- ime!).  I was Hun ing Ghos s many, many yea s be o e i became a ad,  o cool  o do so.  And,  belie e me,  I am a om being an \"expe \".  I do no p esume on Ghos s o hei pe sonali ies.  E e y ime in he pas ha I' e done so,  I' e been ocked back on my heels,  psychologically speaking. Some a e good,  some a e no .  Many o hem e y much enjoy making you he ool ( ha 's a lo easie done wi h some people han a e o he s!) .  I doesn' ma e in he sligh es wha you Think o hem,  They a e wha hey a e,  and \"being a iend\" is de ini ely no on hei lis o p io i ies!  Tha goes o All o hem.  They will play wi h you.  They will lie o you.  They will ell, o imply o you, wha hey know you wan o hea ,  ha o hey will laugh a you.  I ha e pe sonally hea d hei laugh e ,  on mo e han one occasion.  The i s s ep in beginning o unde s and Ghos s is o qui wa ching s upid TV Ghos D amas,  and lea n o be disce n ul abou Reali y.  God bless, anyway.        --Rod    b uce halliday ing@ho mail.com> w o e:Rod, No dis espec bu how do you know wha ghos s ha e he whe e wi h all o do? I speak wi h hem h ough ank and joe's box on a daily basis and conside he wo ha a e communica ing daily o be iends. I belie e you a e speaking o g ounded spi i s no e he als and ghos s ha a e g ounded mos de ina ely in e ac wi h us. esidual ghos s and haun ings do no ha is why he e is a dis inc ion be ween he wo in elligen and esidual haun ings. bu we a e no alking gene aly abou haun ing spi i s ha communica e h ough ank and joe's boxes, bu all ypes o en i ies and don' call anyone dillusional unless you you sel ha e expe ienced you own esea ch wi h he boxes. B uce B uce Halliday Pa ano mal In es iga ing Team To: EVP-ITC@yahoog oups.comF om: e ick_hun e 9@yahoo.comDa e: Thu, 15 No 2007 14:18:55 -0800Subjec : Re: [EVP-ITC] my opinion on he mini boxI ce ainly ag ee wi h he poin o B uces' s a emen ,  bu I ea he's being delusional abou \" iends\" om  he o he side a ec ing some in e -ac ion be ween a box and he use ,  no le ing one wo k,  he box chosing i 's owne ,  e c., e c., e c.  In he i s place Ghos s a e No ou F iends!  Tha 's pu e, unadul e a ed Fan asy.The Ghos s do no ha e he whe e-wi h-all o accomplish his in he i s place, and e en i hey did hey don' gi e a a s' ea end wha a Ghos Hun e does o doesn' do.  Tha boy eally needs o ge eal.  Ghos s simply do no e-ac o he li ing in ha way, o much o any o he way excep o allow us o see o hea hem and hen only when hey wan i o happen.  Thei mos ob ious and bigges ai is o be o ally indi e en o ou wishes.   O e 40 y s. o In es iga ing he Pa ano mal has augh me no hing i i hasn' augh me his.      --Rod    elazquez yahoo.com> w o e:He e, he e B uce.  I am glad o he s who a genuine suppo my ou look, I couldn' ag ee mo e!bhali333 ing@ho mail.com> w o e:since I d opped he bomb abou his mini box o F ank s. yes e day I did no expec such a e en hoopla abou i .So I will gi e my box expe ienced opinion a e leng hy esea ch wi h bo h F ank's and Joe's boxes. I ha e con ac ed he manu ac u e o an explana ion, he ins uc ed me o lis en o he audio ile and iew he demo ideo on his si e. A e doing so my opinion on his box and he builde s in en ions o i is.The box i sel is no a knock o o F ank's box bu a cheap and ine ec i e e sion o Joe's box,I wo ks on an AM band ins ead o an FM band as Joe's box does. Ano he big di e ence is Joe's box ac ually wo ks and you ha e all hea d he iles I ha e pos ed om sessions wi h i . A e lis ening o his box and seeing i in ope a ion I eel ha anyone who pu chases his box will be e y disappoin ed and will no ecei e any con ac om i and e en i hey did hey p obably would no e en ealise i o he simple ac ha you ha e o ha e a ce ain amoun o expe ience wi h box esea ch and ope a ion be o e de eloping an ea o picking up eal ime communica ion and also c ea ing a bond wi h he spi i iends on he o he side and also a measu e o us on bo h sides.I belie e he manu ac u e o be a capi alis and only in e es ed in he mone a y ewa d o be gained om o e ing his cheap and ine ec i e copy o unsuspec ing and nai e indi iduals who a e in e es ed in his medium. I do no like o bad mou h anyone, i usually comes back o bi e you in he ass bu I belie e ha ou iends on he o he side know o ou in en ions and would no allow someone wi h he w ong in en ions o de elop a wo king ool o communica ion. also I belie e ha a pe son does no pick he box he box picks he pe son. So le him ha e his sho and luc a i e un wi h his ooling unsuspec ing clien s, bad ka ma always comes home.B uceThe con en s o his ele onic co espondence is p i a e & con iden ial and mean only o he pa y and/o pa ies i is add essed o.  No pa o his email ansmission may be publicly pos ed o o wa ded o o he pa ies wi hou explici w i en pe mission.Boo! Sca e away wo ms, i uses and so much mo e! T y Windows Li e OneCa e! T y now!"}