{"id": "3037", "subject": "Re: [EVP-ITC] Re: my opinion on the mini box", "author": "erick hunter", "timestamp": "2007-11-16T15:56:21Z", "full_text": "--0-751982492-1195228581=:84680\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nSome people really do not have enough reality to worry about.     --Rod\n   \n   \n  \n\nbabiarz3 &lt;babiarz3@...&gt; wrote:\n          It is obvious that the goal is not to further research but to pad\nwallets. That being said, I do believe that people should be\ncompensated for both their time and their energy. We all must eat.\nHowever, when it is a blatant attempt at over compensation, I take issue. \nI commend Frank on his altruistic motives. I have not had the pleasure\nof meeting Frank but it is easy to see that his intentions are pure. I\nknow Chris and find him to be an incredibly genuine person. According\nto Konstanin Raudives communications after death, this would explain\ntheir success in using this device. \nTruly, I can only see problems with the mas production of the device.\nIf it is true that dissonance in the form of fear, doubt,\nill-intention, etc opens the pathway to lower dimensions then what\nmight happen when people everywhere are turning on and tuning in? What\nmight happen when the mentally unstable person receives, or perceives\nto receive, a message requesting an evil or dark deed? \nI can not convey in words my concern with this being produced in such\na manner. Fraud of unsuspecting people is going to abound. Ego&#39;s are\nnot going to allow for the admittance that the box is not working for\nthem. They will deliver fake messages, deceiving people for money.\nThis can only harm the credibility of the work that Frank, Chris and\nothers are doing. IMHO, the makers of this mini-box have given no\nthought or consideration to the possible outcome. If they have, they\nhave chosen to ignore it. \n\n--- In EVP-ITC@yahoogroups.com, Zack Widup &lt;w9sz@...&gt; wrote:\n&gt;\n&gt; \n&gt; If it&#39;s getting others to use the technology and experiment and find\nout \n&gt; what&#39;s out there, it&#39;s at least doing that. But right now we don&#39;t\neven \n&gt; know if their boxes work.\n&gt; \n&gt; As a radio amateur, I have the philosophy that all the designs I do\nas a \n&gt; radio amateur and all the computer/microcontroller programs I write\nshould \n&gt; be given freely by me to others. I&#39;ve even run off some pc boards and \n&gt; given them away free. I would tend to do that in this area (ITC) too as \n&gt; long as it doesn&#39;t break me.\n&gt; \n&gt; So I see your point. I guess they&#39;re just not altruistic like Frank\nS. is.\n&gt; \n&gt; Zack\n&gt; \n&gt; \n&gt; On Fri, 16 Nov 2007, Frank Ratka wrote:\n&gt; \n&gt; &gt; How can it advance the technology if he doesn&#39;t share the design?\n&gt; &gt;\n&gt; &gt; Frank R.\n&gt; &gt;\n&gt;\n\n\n\n                         \n\r\n--0-751982492-1195228581=:84680\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;div&gt;&lt;STRONG&gt;Some people really do not have enough reality to worry about.&nbsp;&nbsp;&nbsp;&nbsp; --Rod&lt;/STRONG&gt;&lt;/div&gt;  &lt;div&gt;&lt;STRONG&gt;&lt;/STRONG&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;babiarz3 &lt;babiarz3@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/div&gt;  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;div&gt;It is obvious that the goal is not to further research but to pad&lt;BR&gt;wallets. That being said, I do believe that people should be&lt;BR&gt;compensated for both their time and their energy. We all must eat.&lt;BR&gt;However, when it is a blatant attempt at over compensation, I take issue. &lt;BR&gt;I commend Frank on his altruistic motives. I have\n not had the pleasure&lt;BR&gt;of meeting Frank but it is easy to see that his intentions are pure. I&lt;BR&gt;know Chris and find him to be an incredibly genuine person. According&lt;BR&gt;to Konstanin Raudives communications after death, this would explain&lt;BR&gt;their success in using this device. &lt;BR&gt;Truly, I can only see problems with the mas production of the device.&lt;BR&gt;If it is true that dissonance in the form of fear, doubt,&lt;BR&gt;ill-intention, etc opens the pathway to lower dimensions then what&lt;BR&gt;might happen when people everywhere are turning on and tuning in? What&lt;BR&gt;might happen when the mentally unstable person receives, or perceives&lt;BR&gt;to receive, a message requesting an evil or dark deed? &lt;BR&gt;I can not convey in words my concern with this being produced in such&lt;BR&gt;a manner. Fraud of unsuspecting people is going to abound. Ego&#39;s are&lt;BR&gt;not going to allow for the admittance that the box is not working for&lt;BR&gt;them. They will deliver fake messages, deceiving people for money.&lt;BR&gt;This\n can only harm the credibility of the work that Frank, Chris and&lt;BR&gt;others are doing. IMHO, the makers of this mini-box have given no&lt;BR&gt;thought or consideration to the possible outcome. If they have, they&lt;BR&gt;have chosen to ignore it. &lt;BR&gt;&lt;BR&gt;--- In &lt;A href=&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;, Zack Widup &lt;w9sz@...&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; &lt;BR&gt;&gt; If it&#39;s getting others to use the technology and experiment and find&lt;BR&gt;out &lt;BR&gt;&gt; what&#39;s out there, it&#39;s at least doing that. But right now we don&#39;t&lt;BR&gt;even &lt;BR&gt;&gt; know if their boxes work.&lt;BR&gt;&gt; &lt;BR&gt;&gt; As a radio amateur, I have the philosophy that all the designs I do&lt;BR&gt;as a &lt;BR&gt;&gt; radio amateur and all the computer/microcontr&lt;WBR&gt;oller programs I write&lt;BR&gt;should &lt;BR&gt;&gt; be given freely by me to others. I&#39;ve even run off some pc boards and &lt;BR&gt;&gt; given them away free. I would tend to do that in this area (ITC) too as &lt;BR&gt;&gt; long as it doesn&#39;t break me.&lt;BR&gt;&gt; &lt;BR&gt;&gt; So I\n see your point. I guess they&#39;re just not altruistic like Frank&lt;BR&gt;S. is.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Zack&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; On Fri, 16 Nov 2007, Frank Ratka wrote:&lt;BR&gt;&gt; &lt;BR&gt;&gt; &gt; How can it advance the technology if he doesn&#39;t share the design?&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt; Frank R.&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/div&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;\r\n--0-751982492-1195228581=:84680--"}