{"id": "3047", "subject": "Re: [EVP-ITC] message to Frank S. from Tesla", "author": "Lisby", "timestamp": "2007-11-16T17:13:28Z", "full_text": "But what is going on now? Why all of a sudden is everyone hearing  \nfrom Edison and Tesla? If these are the real men, what are they up  \nto? Are they trying to divide and concur or are they working together?\n\nAnn\n\n\nOn Nov 15, 2007, at 11:09 PM, Zack Widup wrote:\n\n&gt;\n&gt; I can tell you some of the real story of these two men (much  \n&gt; abbreviated\n&gt; version).\n&gt;\n&gt; Nikola Tesla worked for Edison for a while but they had a falling-out\n&gt; because Tesla thought of improvements to Edison&#39;s inventions that  \n&gt; Edison,\n&gt; due to ego or whatever, didn&#39;t think much of. Tesla also had a  \n&gt; habit of\n&gt; ordering the most expensive chateaubriand at Edison&#39;s expense when  \n&gt; Edison\n&gt; took him out to dinner. They eventually parted ways.\n&gt;\n&gt; Tesla happened upon George Westinghouse&#39;s lab when Westinghouse needed\n&gt; repairs to a motor. Tesla went into the shop and machined such a\n&gt; high-quality repair that Westinghouse was immediately impressed. So  \n&gt; Tesla\n&gt; ended up working for Westinghouse at that point.\n&gt;\n&gt; Tesla had the idea of developing alternating-current systems for power\n&gt; distribution and Westinghouse backed it all the way. AC was much more\n&gt; efficient than Edison&#39;s DC power distribution systems because it  \n&gt; lacked\n&gt; the heat losses in the power lines that DC systems suffered from.  \n&gt; Edison\n&gt; stood to lose much if his DC power systems were discarded in favor  \n&gt; of AC\n&gt; power. So he invented the electric chair to demonstrate to the public\n&gt; just how dangerous AC was. The first attempt at using it on a death- \n&gt; row\n&gt; inmate failed miserably; it didn&#39;t kill him but amounted to torture\n&gt; instead.\n&gt;\n&gt; Tesla went on to do his own research; much was funded by J. P. Morgan.\n&gt; That&#39;s a whole &#39;nother story. But he and Westinghouse remained  \n&gt; friends;\n&gt; he and Edison remained enemies.\n&gt;\n&gt; Tesla was a very bad manager of money. He died in a hotel room in New\n&gt; York, with very little money at that time.\n&gt;\n&gt; Another interesting anecdote - Tesla had taken to letting the  \n&gt; pigeons into\n&gt; his hotel room, which the hotel owners didn&#39;t enjoy but tolerated  \n&gt; because\n&gt; of his notoriety. He had a favorite pigeon which sat on his phone.  \n&gt; He had\n&gt; said several times that &quot;The day that my favorite pigeon dies, I will\n&gt; die.&quot; And so it happened.\n&gt;\n&gt; Zack\n&gt;\n&gt; On Thu, 15 Nov 2007, Lisby wrote:\n&gt;\n&gt; &gt; That&#39;s what I hear, too, Bruce.\n&gt; &gt;\n&gt; &gt; Okay-- in your opinion--what is all this Tesla/Edison stuff  \n&gt; about? It&#39;s\n&gt; &gt; getting as weird as as John Keel book around here.\n&gt; &gt;\n&gt; &gt; Ann\n&gt; &gt;\n&gt;\n&gt; \n\n\nBu wha is going on now? Why all o a sudden is e e yone hea ing om Edison and Tesla? I hese a e he eal men, wha a e hey up o? A e hey ying o di ide and concu o a e hey wo king oge he ?AnnOn No 15, 2007, a 11:09 PM, Zack Widup w o e:I can ell you some o he eal s o y o hese wo men (much abb e ia ed e sion).Nikola Tesla wo ked o Edison o a while bu hey had a alling-ou because Tesla hough o imp o emen s o Edison's in en ions ha Edison, due o ego o wha e e , didn' hink much o . Tesla also had a habi o o de ing he mos expensi e cha eaub iand a Edison's expense when Edison ook him ou o dinne . They e en ually pa ed ways.Tesla happened upon Geo ge Wes inghouse's lab when Wes inghouse needed epai s o a mo o . Tesla wen in o he shop and machined such a high-quali y epai ha Wes inghouse was immedia ely imp essed. So Tesla ended up wo king o Wes inghouse a ha poin .Tesla had he idea o de eloping al e na ing-cu en sys ems o powe dis ibu ion and Wes inghouse backed i all he way. AC was much mo e e icien han Edison's DC powe dis ibu ion sys ems because i lacked he hea losses in he powe lines ha DC sys ems su e ed om. Edison s ood o lose much i his DC powe sys ems we e disca ded in a o o AC powe . So he in en ed he elec ic chai o demons a e o he public jus how dange ous AC was. The i s a emp a using i on a dea h- ow inma e ailed mise ably; i didn' kill him bu amoun ed o o u e ins ead.Tesla wen on o do his own esea ch; much was unded by J. P. Mo gan. Tha 's a whole 'no he s o y. Bu he and Wes inghouse emained iends; he and Edison emained enemies.Tesla was a e y bad manage o money. He died in a ho el oom in New Yo k, wi h e y li le money a ha ime.Ano he in e es ing anecdo e - Tesla had aken o le ing he pigeons in o his ho el oom, which he ho el owne s didn' enjoy bu ole a ed because o his no o ie y. He had a a o i e pigeon which sa on his phone. He had said se e al imes ha \"The day ha my a o i e pigeon dies, I will die.\" And so i happened.ZackOn Thu, 15 No 2007, Lisby w o e:> Tha 's wha I hea , oo, B uce.>> Okay-- in you opinion--wha is all his Tesla/Edison s u abou ? I 's > ge ing as wei d as as John Keel book a ound he e.>> Ann>"}