{"id": "3049", "subject": "Re: for rod or eric or whatever your name is", "author": "Frank Sumption", "timestamp": "2007-11-16T18:45:03Z", "full_text": "I can get that way too, but it&#39;s going over the top. I don&#39;t think \nthere is a paranromal as such, it&#39;s all normal. Banned button finger \nstands poised! \n\n Frank\n\n\n--- In EVP-ITC@yahoogroups.com, erick hunter &lt;erick_hunter9@...&gt; \nwrote:\n&gt;\n&gt; I must be getting addle-brained in my old-age...   I can&#39;t seem to \nconvey a fairly simple principle thought that is shared by many of my \ncolleagues and peers the world over.  Ah,  well,  it&#39;s not really \nimportant in the short-haul anyway.  Let me assure you Frank-S,  none \nof my intensions were to personally attack anyone!  I do attack ideas \nand statements that I strongly feel are blatantly wrong, mis-\nconstrueing and apt to mis-lead if left to themselves, especially to \nthe lay-person.  I am obviously opposed in my &quot;philosophy&quot; by several \npersons who,  in my opinion,  are prejudiced against those of us who \nare more open-minded concerning perceptions, analysis, experience, \nobjectivity and etc. concerning the Paranormal.  This is,  of \ncourse,  S.O.P.  and expected.  Don&#39;t be so sensitive,  open up and \nenjoy the contension.     --Rod\n&gt;    \n&gt;    \n&gt;        \n&gt; \n&gt; Frank Sumption &lt;franks-boxes@...&gt; wrote:\n&gt;            Most of the people here that post voices get interactive \ncommunication. Some of these comments jhave been borderline personal \nattacks, I think, cuz they are certainly not based on facts. \n&gt;  \n&gt;  Frank-S\n&gt; \n&gt; \n&gt;     \n&gt; ---------------------------------\n&gt;   To: EVP-ITC@yahoogroups.com\n&gt; From: paranormalinvestigating@...\n&gt; Date: Fri, 16 Nov 2007 13:17:01 +0000\n&gt; Subject: [EVP-ITC] for rod or eric or whatever your name is\n&gt; \n&gt;       You have been a member of this group since 2004 and still \nhave no \n&gt; idea what it&#39;s about ? As far as me not watching ghost shows on tv, \n&gt; it seems by your explanation of how you have been involved in the \nPI \n&gt; field that you are a lot like those cheesy ghost hunting shows. To \n&gt; make a statement that spirits are not interactive and could care \nless \n&gt; about us or what we are trying to do, that alone shows you know \n&gt; nothing. I am a disabled rescue worker injured in the 911 attacks \nand \n&gt; am home all day with plenty of time for research and I can \n&gt; imphatically tell you that they do pay attention they do interact \n&gt; they are definitely interested and they are working harder than we \n&gt; are to communicate. \n&gt; \n&gt; maybe you have formed your opinion because in your vast wealth of \n&gt; knowledge and experience you have never come across a spirit that \nwas \n&gt; interested in you. besides throwing you all around a room or \nlifting \n&gt; you into the air and hurling you like a shot put or whatever you \n&gt; claim some ghosts did. And if they did do that to you that sounds \n&gt; pretty interactive to me. I can see why they would want to throw \nyou \n&gt; around and kick and bite you but if I where you I would find \nanother \n&gt; hobby.\n&gt; and I say hobby because by your analogy of it that&#39;s all it is to \nyou.\n&gt; \n&gt; As far as your friend with the mini box, yeah I&#39;m not stupid I \n&gt; figured that out, you can stop trying to defend it no one here is \n&gt; gonna buy that piece of crap.\n&gt; \n&gt; I will not trade any more malicious posts with you so don&#39;t bother.\n&gt; \n&gt; Bruce\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;   \n&gt; ---------------------------------\n&gt;   Peek-a-boo FREE Tricks Treats for You! Get &#39;em!\n&gt;"}