{"id": "3052", "subject": "Re: [EVP-ITC] Re: message to Frank S. from Tesla", "author": "erick hunter", "timestamp": "2007-11-16T19:24:43Z", "full_text": "--0-1464069370-1195241083=:63438\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nFrank,  Can you tell me exactly how you know that you are making contact with the planets,  which one in particular?  I am not being facetious,  not at all,  I would really like to know.  I do not have a box,  any box.  Some time ago I enquired as to obtaining one but I think you didn&#39;t feel I was serious.  I am,  very much so.  Your reply would be most appreciated.  Thank you.     --Rod  \n   \n   \n   \n   \n  \nFrank Sumption &lt;franks-boxes@...&gt; wrote:\n          I get other planets, Mars included. Our perceptions are pretty \nlimited on this level. On the etheric level there&#39;s no reason why all \nof the plantes can&#39;t be inhabited, and it would be waste of real \nestate if they aren&#39;t. \n\nMaybe the level that contains Telsa and Edison have been opened?\n\nFrank-S\n\n--- In EVP-ITC@yahoogroups.com, juli velazquez &lt;ghostchasingfool@...&gt; \nwrote:\n&gt;\n&gt; Ann, this is a theory, maybe a crazy one and could be far off, but \nI&#39;m going to throw it out there.\n&gt; \n&gt; I think that this may be in reference to the boxes. (I think \nsome of these messages that are delivered have to be looked at from a \ndifferent angle). Correct me if I am wrong (which I probably am) but \ndon&#39;t these different boxes use different frequencies for example (am \nvs fm). Telsa was believe one worked better for long distances and \njust maybe that is the message in which is trying to be conveyed??? \nThat one may actually receive better transmission. Telsa also \nbelieve that he could in fact contact Mars and Venus (which proved to \nbe stars? (if I am correct). In any event. I think that you need to \nanalyze the parties involved and apply them to which is actually \ngoing on now at this period of time. \n&gt; \n&gt; I think that there are different plains and one may work better \nfor say contacted the death, verses another for contacting \ndifferently life forms in the universe.\n&gt; \n&gt; I know you probably think I am so out there, but this was just a \nthought from an outsiders perspective. \n&gt; \n&gt; Lisby &lt;lisby@...&gt; wrote:\n&gt; But what is going on now? Why all of a sudden is everyone \nhearing from Edison and Tesla? If these are the real men, what are \nthey up to? Are they trying to divide and concur or are they working \ntogether? \n&gt; \n&gt; Ann\n&gt; \n&gt; \n&gt; \n&gt; On Nov 15, 2007, at 11:09 PM, Zack Widup wrote:\n&gt; \n&gt; \n&gt; I can tell you some of the real story of these two men (much \nabbreviated \n&gt; version).\n&gt; \n&gt; Nikola Tesla worked for Edison for a while but they had a falling-\nout \n&gt; because Tesla thought of improvements to Edison&#39;s inventions that \nEdison, \n&gt; due to ego or whatever, didn&#39;t think much of. Tesla also had a \nhabit of \n&gt; ordering the most expensive chateaubriand at Edison&#39;s expense when \nEdison \n&gt; took him out to dinner. They eventually parted ways.\n&gt; \n&gt; Tesla happened upon George Westinghouse&#39;s lab when Westinghouse \nneeded \n&gt; repairs to a motor. Tesla went into the shop and machined such a \n&gt; high-quality repair that Westinghouse was immediately impressed. So \nTesla \n&gt; ended up working for Westinghouse at that point.\n&gt; \n&gt; Tesla had the idea of developing alternating-current systems for \npower \n&gt; distribution and Westinghouse backed it all the way. AC was much \nmore \n&gt; efficient than Edison&#39;s DC power distribution systems because it \nlacked \n&gt; the heat losses in the power lines that DC systems suffered from. \nEdison \n&gt; stood to lose much if his DC power systems were discarded in favor \nof AC \n&gt; power. So he invented the electric chair to demonstrate to the \npublic \n&gt; just how dangerous AC was. The first attempt at using it on a death-\nrow \n&gt; inmate failed miserably; it didn&#39;t kill him but amounted to torture \n&gt; instead.\n&gt; \n&gt; Tesla went on to do his own research; much was funded by J. P. \nMorgan. \n&gt; That&#39;s a whole &#39;nother story. But he and Westinghouse remained \nfriends; \n&gt; he and Edison remained enemies.\n&gt; \n&gt; Tesla was a very bad manager of money. He died in a hotel room in \nNew \n&gt; York, with very little money at that time.\n&gt; \n&gt; Another interesting anecdote - Tesla had taken to letting the \npigeons into \n&gt; his hotel room, which the hotel owners didn&#39;t enjoy but tolerated \nbecause \n&gt; of his notoriety. He had a favorite pigeon which sat on his phone. \nHe had \n&gt; said several times that &quot;The day that my favorite pigeon dies, I \nwill \n&gt; die.&quot; And so it happened.\n&gt; \n&gt; Zack\n&gt; \n&gt; On Thu, 15 Nov 2007, Lisby wrote:\n&gt; \n&gt; &gt; That&#39;s what I hear, too, Bruce.\n&gt; &gt;\n&gt; &gt; Okay-- in your opinion--what is all this Tesla/Edison stuff \nabout? It&#39;s \n&gt; &gt; getting as weird as as John Keel book around here.\n&gt; &gt;\n&gt; &gt; Ann\n&gt; &gt;\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; The contents of this eletronic correspondence is private & \nconfidential and meant only for the party and/or parties it is \naddressed to. \n&gt; \n&gt; No part of this email transmission may be publicly posted or \nforwarded to other parties without explicit written permission.\n&gt;\n\n\n\n                         \n\r\n--0-1464069370-1195241083=:63438\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;div&gt;&lt;STRONG&gt;Frank,&nbsp; Can you tell me exactly how you know that you are making contact with the&nbsp;planets,&nbsp; which one in particular?&nbsp; I am not being facetious,&nbsp; not at all,&nbsp; I would really like to know.&nbsp; I do not have a box,&nbsp; any box.&nbsp; Some time ago I enquired as to obtaining one but I think you didn&#39;t feel I was serious.&nbsp; I am,&nbsp; very much so.&nbsp; Your reply would be most appreciated.&nbsp; Thank you.&nbsp;&nbsp;&nbsp;&nbsp; --Rod&nbsp;&nbsp;&lt;/STRONG&gt;&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;Frank Sumption &lt;franks-boxes@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/div&gt;  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;div&gt;I get other planets, Mars included. Our perceptions are pretty &lt;BR&gt;limited on this level. On the etheric level there&#39;s no reason why all &lt;BR&gt;of the plantes can&#39;t be inhabited, and it would be waste of real &lt;BR&gt;estate if they aren&#39;t. &lt;BR&gt;&lt;BR&gt;Maybe the level that contains Telsa and Edison have been opened?&lt;BR&gt;&lt;BR&gt;Frank-S&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;, juli velazquez &lt;ghostchasingfool@&lt;WBR&gt;...&gt; &lt;BR&gt;wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; Ann, this is a theory, maybe a crazy one and could be far off, but &lt;BR&gt;I&#39;m going to throw it out there.&lt;BR&gt;&gt; &lt;BR&gt;&gt; I think that this may be in reference to the boxes. (I think &lt;BR&gt;some of these messages that are delivered have to be looked at from a &lt;BR&gt;different angle). Correct me if I am wrong (which I probably am) but &lt;BR&gt;don&#39;t these different boxes use different frequencies for example (am\n &lt;BR&gt;vs fm). Telsa was believe one worked better for long distances and &lt;BR&gt;just maybe that is the message in which is trying to be conveyed??? &lt;BR&gt;That one may actually receive better transmission. Telsa also &lt;BR&gt;believe that he could in fact contact Mars and Venus (which proved to &lt;BR&gt;be stars? (if I am correct). In any event. I think that you need to &lt;BR&gt;analyze the parties involved and apply them to which is actually &lt;BR&gt;going on now at this period of time. &lt;BR&gt;&gt; &lt;BR&gt;&gt; I think that there are different plains and one may work better &lt;BR&gt;for say contacted the death, verses another for contacting &lt;BR&gt;differently life forms in the universe.&lt;BR&gt;&gt; &lt;BR&gt;&gt; I know you probably think I am so out there, but this was just a &lt;BR&gt;thought from an outsiders perspective. &lt;BR&gt;&gt; &lt;BR&gt;&gt; Lisby &lt;lisby@...&gt; wrote:&lt;BR&gt;&gt; But what is going on now? Why all of a sudden is everyone &lt;BR&gt;hearing from Edison and Tesla? If these are the real men, what are &lt;BR&gt;they up to? Are\n they trying to divide and concur or are they working &lt;BR&gt;together? &lt;BR&gt;&gt; &lt;BR&gt;&gt; Ann&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; On Nov 15, 2007, at 11:09 PM, Zack Widup wrote:&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; I can tell you some of the real story of these two men (much &lt;BR&gt;abbreviated &lt;BR&gt;&gt; version).&lt;BR&gt;&gt; &lt;BR&gt;&gt; Nikola Tesla worked for Edison for a while but they had a falling-&lt;BR&gt;out &lt;BR&gt;&gt; because Tesla thought of improvements to Edison&#39;s inventions that &lt;BR&gt;Edison, &lt;BR&gt;&gt; due to ego or whatever, didn&#39;t think much of. Tesla also had a &lt;BR&gt;habit of &lt;BR&gt;&gt; ordering the most expensive chateaubriand at Edison&#39;s expense when &lt;BR&gt;Edison &lt;BR&gt;&gt; took him out to dinner. They eventually parted ways.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Tesla happened upon George Westinghouse&#39;&lt;WBR&gt;s lab when Westinghouse &lt;BR&gt;needed &lt;BR&gt;&gt; repairs to a motor. Tesla went into the shop and machined such a &lt;BR&gt;&gt; high-quality repair that Westinghouse was immediately impressed. So &lt;BR&gt;Tesla &lt;BR&gt;&gt; ended up\n working for Westinghouse at that point.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Tesla had the idea of developing alternating-&lt;WBR&gt;current systems for &lt;BR&gt;power &lt;BR&gt;&gt; distribution and Westinghouse backed it all the way. AC was much &lt;BR&gt;more &lt;BR&gt;&gt; efficient than Edison&#39;s DC power distribution systems because it &lt;BR&gt;lacked &lt;BR&gt;&gt; the heat losses in the power lines that DC systems suffered from. &lt;BR&gt;Edison &lt;BR&gt;&gt; stood to lose much if his DC power systems were discarded in favor &lt;BR&gt;of AC &lt;BR&gt;&gt; power. So he invented the electric chair to demonstrate to the &lt;BR&gt;public &lt;BR&gt;&gt; just how dangerous AC was. The first attempt at using it on a death-&lt;BR&gt;row &lt;BR&gt;&gt; inmate failed miserably; it didn&#39;t kill him but amounted to torture &lt;BR&gt;&gt; instead.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Tesla went on to do his own research; much was funded by J. P. &lt;BR&gt;Morgan. &lt;BR&gt;&gt; That&#39;s a whole &#39;nother story. But he and Westinghouse remained &lt;BR&gt;friends; &lt;BR&gt;&gt; he and Edison remained enemies.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Tesla was a\n very bad manager of money. He died in a hotel room in &lt;BR&gt;New &lt;BR&gt;&gt; York, with very little money at that time.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Another interesting anecdote - Tesla had taken to letting the &lt;BR&gt;pigeons into &lt;BR&gt;&gt; his hotel room, which the hotel owners didn&#39;t enjoy but tolerated &lt;BR&gt;because &lt;BR&gt;&gt; of his notoriety. He had a favorite pigeon which sat on his phone. &lt;BR&gt;He had &lt;BR&gt;&gt; said several times that &quot;The day that my favorite pigeon dies, I &lt;BR&gt;will &lt;BR&gt;&gt; die.&quot; And so it happened.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Zack&lt;BR&gt;&gt; &lt;BR&gt;&gt; On Thu, 15 Nov 2007, Lisby wrote:&lt;BR&gt;&gt; &lt;BR&gt;&gt; &gt; That&#39;s what I hear, too, Bruce.&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt; Okay-- in your opinion--what is all this Tesla/Edison stuff &lt;BR&gt;about? It&#39;s &lt;BR&gt;&gt; &gt; getting as weird as as John Keel book around here.&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt; Ann&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; The contents of this\n eletronic correspondence is private &amp; &lt;BR&gt;confidential and meant only for the party and/or parties it is &lt;BR&gt;addressed to. &lt;BR&gt;&gt; &lt;BR&gt;&gt; No part of this email transmission may be publicly posted or &lt;BR&gt;forwarded to other parties without explicit written permission.&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/div&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;\r\n--0-1464069370-1195241083=:63438--"}