{"id": "3062", "subject": "Re: [EVP-ITC] Re: Changing the subject on the debate of the boxes!", "author": "juli velazquez", "timestamp": "2007-11-17T01:06:12Z", "full_text": "--0-724527823-1195261572=:46380\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nSteve, thanks for the response.  To go into depth regarding addition EVP is this scenario.  Video taping a session with the box, capture evp on the video recorder and thus your so called Dead Heads come thru.  The evp I initially captured was prompting me a warning so I believe that vulgar language was about to come thru.  I have the audio and video for these, but didn&#39;t want to post them without permission from Frank or the moderators, because of the cursing.  If its ok, I will be more than happy to post them or I could send them to anyone under separate cover.\n   \n  I&#39;m always interested in what people&#39;s theories are their intake on the messages.  I think in this instance the dead head was upset and didn&#39;t want to let the other speak.  He assumed that the cursing was going to scary people, little did he realize that I was a Corrections Office in the State of Illinois, therefore my mouth could be just as bad, lol.\n   \n  Thanks for your input!\n\nSteve Hultay &lt;urkel23@...&gt; wrote: \n          Juli,\n\nQuestion one i believe it all depends on your radio signal at the \ntime it was recorded, weather can affect transmission on both \nsides. Also, it depends if the audio was an outright message or if \nit was put through several programs on the computer to dig it out. \nAt that point it could have been nothing turned into something with \nthe software out there today. Second question, i&#39;m not really sure \nwhat you mean but i have gotten additional Evp&#39;s on the recording \nafterwards that did not come out of the box at the time and i didn&#39;t \nhear it. White noise does attract them. Your third question is a \ngood one, i used to get into arguments all the time until i figured \nout it was the dark heads coming through trying to get you upset in \nsome way. If you learn to block them out, it helps communication. \nIf you don&#39;t, they win and you don&#39;t get any good research in.\n\n-Steve H.\n\n--- In EVP-ITC@yahoogroups.com, &quot;Juli Velazquez&quot; \n&lt;ghostchasingfool@...&gt; wrote:\n&gt;\n&gt; I have several questions for those who currently have devices. I \nam \n&gt; hoping you can answer.\n&gt; \n&gt; When listening to some of the messages you currently have \nposted \n&gt; like the message regarding Tesla, why is it that some come thru so \n&gt; very clear and audiable to understand vs. others? Most of mine \naudio \n&gt; I have gotten from the boxes are very clear to hear outright.\n&gt; \n&gt; Second question? In those who have tested it at a proposed \n&gt; location, have they ever gotten addition evp relating to the \nmessages \n&gt; coming over the box? The reason I asked is because I have. When \n&gt; video taping the box being used, I got a warning of sorts prior to \n&gt; the message from the box. Has anyone else experienced this?\n&gt; \n&gt; Third, has anyone ever gotten into a heated debate with \nsomeone \n&gt; over the box. A two way conversation that had the potential of \n&gt; getting nasty? Or things that came across that were not nice?\n&gt; \n&gt; I would love to know if anyone has experienced any of this events.\n&gt; \n&gt; Thanks!\n&gt; Juli\n&gt;\n\n\n\n                         \n\n\n  The contents of this eletronic correspondence is private & confidential and meant only for the party and/or parties it is addressed to.  \n   \n  No part of this email transmission may be publicly posted or forwarded to other parties without explicit written permission.\n\n\r\n--0-724527823-1195261572=:46380\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;div&gt;Steve, thanks for the response.&nbsp; To go into depth regarding addition EVP is this scenario.&nbsp; Video taping a session with the box, capture evp on the video recorder and thus your so called Dead Heads come thru.&nbsp; The evp I initially captured was prompting me a warning so I believe that vulgar language was about to come thru.&nbsp; I have the audio and video for these, but didn&#39;t want to post them without permission from Frank or the moderators, because of the cursing.&nbsp; If its ok, I will be more than happy to post them or I could send them to anyone under separate cover.&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;I&#39;m always interested in what people&#39;s theories are their intake on the messages.&nbsp; I think in this instance the dead head was upset and didn&#39;t want to let the other speak.&nbsp; He assumed that the cursing was going to scary people, little did he realize that I was a Corrections Office in the State of Illinois, therefore my mouth could be just as bad,\n lol.&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Thanks for your input!&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;Steve Hultay &lt;urkel23@...&gt;&lt;/I&gt;&lt;/B&gt; wrote: &lt;/div&gt;  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;DIV&gt;Juli,&lt;BR&gt;&lt;BR&gt;Question one i believe it all depends on your radio signal at the &lt;BR&gt;time it was recorded, weather can affect transmission on both &lt;BR&gt;sides. Also, it depends if the audio was an outright message or if &lt;BR&gt;it was put through several programs on the computer to dig it out. &lt;BR&gt;At that point it could have been nothing turned into something with &lt;BR&gt;the software out there today. Second question, i&#39;m not really sure &lt;BR&gt;what you mean but i\n have gotten additional Evp&#39;s on the recording &lt;BR&gt;afterwards that did not come out of the box at the time and i didn&#39;t &lt;BR&gt;hear it. White noise does attract them. Your third question is a &lt;BR&gt;good one, i used to get into arguments all the time until i figured &lt;BR&gt;out it was the dark heads coming through trying to get you upset in &lt;BR&gt;some way. If you learn to block them out, it helps communication. &lt;BR&gt;If you don&#39;t, they win and you don&#39;t get any good research in.&lt;BR&gt;&lt;BR&gt;-Steve H.&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;, &quot;Juli Velazquez&quot; &lt;BR&gt;&lt;ghostchasingfool@&lt;WBR&gt;...&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; I have several questions for those who currently have devices. I &lt;BR&gt;am &lt;BR&gt;&gt; hoping you can answer.&lt;BR&gt;&gt; &lt;BR&gt;&gt; When listening to some of the messages you currently have &lt;BR&gt;posted &lt;BR&gt;&gt; like the message regarding Tesla, why is it that some come thru so &lt;BR&gt;&gt; very clear and audiable to understand vs. others? Most of\n mine &lt;BR&gt;audio &lt;BR&gt;&gt; I have gotten from the boxes are very clear to hear outright.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Second question? In those who have tested it at a proposed &lt;BR&gt;&gt; location, have they ever gotten addition evp relating to the &lt;BR&gt;messages &lt;BR&gt;&gt; coming over the box? The reason I asked is because I have. When &lt;BR&gt;&gt; video taping the box being used, I got a warning of sorts prior to &lt;BR&gt;&gt; the message from the box. Has anyone else experienced this?&lt;BR&gt;&gt; &lt;BR&gt;&gt; Third, has anyone ever gotten into a heated debate with &lt;BR&gt;someone &lt;BR&gt;&gt; over the box. A two way conversation that had the potential of &lt;BR&gt;&gt; getting nasty? Or things that came across that were not nice?&lt;BR&gt;&gt; &lt;BR&gt;&gt; I would love to know if anyone has experienced any of this events.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Thanks!&lt;BR&gt;&gt; Juli&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;&lt;DIV&gt;  &lt;div&gt;&lt;EM&gt;&lt;STRONG&gt;&lt;FONT color=#0000ff&gt;The contents of this eletronic correspondence is private &amp; confidential and meant only for the party and/or parties it is addressed to.&nbsp; &lt;/FONT&gt;&lt;/STRONG&gt;&lt;/EM&gt;&lt;/div&gt;  &lt;div&gt;&lt;EM&gt;&lt;STRONG&gt;&lt;FONT\n color=#0000ff&gt;&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/EM&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;&lt;EM&gt;&lt;STRONG&gt;&lt;FONT color=#0000ff&gt;No part of this email transmission may be publicly posted or forwarded to other parties without explicit written permission.&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/EM&gt;&lt;/div&gt;&lt;/DIV&gt;\r\n--0-724527823-1195261572=:46380--"}