{"id": "3072", "subject": "RE: [EVP-ITC] LOL", "author": "RetroCom", "timestamp": "2007-11-17T14:05:43Z", "full_text": "Well said Frank. Good luck at the Stanley.\r\n\r\nDave\r\n\r\n--- franks-boxes@hotmail.com wrote:\r\n\r\nFrom: Frank Sumption <franks-boxes@hotmail.com>\r\nTo: <evp-itc@yahoogroups.com>\r\nSubject: RE: [EVP-ITC] LOL\r\nDate: Fri, 16 Nov 2007 23:25:05 -0700\r\n\r\n\r\n A little of my reluctance in manufacturing boxes is I don't think people should tie themselves to a certain technology. You can do the same thing the box does by hand, and at times I think the manual method works better. It's not the technology that matters, it's not contacting departed loved ones that matters, it's not proving a haunting that matters, it's only proving to oneself that life is forever.  What possible difference does anything else make?\r\n Frank-S\r\n\r\n\r\nTo: EVP-ITC@yahoogroups.comFrom: bulletbabea@yahoo.comDate: Fri, 16 Nov 2007 21:18:58 -0800Subject: [EVP-ITC] LOL\r\n\r\n\r\n\r\n\r\n\r\nOh my gawd, you people.. I love ya all but I wrote at least 4 reply emails and deleted them as soon as I finished LOL\r\n \r\nHmm so I will just say\r\n1)We are mostly all adults tho some younger folks may have joined. Lets try and remember that\r\n2)Franks box is what it is. The first of many. It is always evolving and changing and that is how it is presented by Sumption himself. A free design for any and all who care to build it.\r\n3)Working together as a group is important, otherwise why bother joining here.\r\n \r\nLet me know if I need to give ya 4 its a doozy hehehe\r\n \r\nReally guys and gals, I am mega busy at work so I basically do a run down thru every post before/after work and sometimes it just has me  dismayed.\r\n \r\nI know you all are capable of better, and able to work together in a positive way. Ive seen it many times. Dont worry about what everyone else thinks, just worry about what YOU think. Dont try and form the opinion of someone else, instead work on discovering your own. And research.... well? Get back to it!  and share, you just might make some connections.\r\n \r\n<<<GROUP HUGGGGGG>>>\r\n \r\nLOL\r\nMisty Dawn\r\n\r\n\r\nNever miss a thing. Make Yahoo your homepage. \r\n \r\n\r\n\r\n\r\n\r\n\r\n\r\n_________________________________________________________________\r\nWindows Live Hotmail and Microsoft Office Outlook – together at last.  Get it now.\r\nhttp://office.microsoft.com/en-us/outlook/HA102225181033.aspx?pid=CL100626971033"}