{"id": "3117", "subject": "Re: My take on this ridiculous MiniBox War 07&#39; on here", "author": "psi_research", "timestamp": "2007-11-19T17:29:47Z", "full_text": "Glad to do it. By the way, I also thought the MiniBox was well built\nand had decent clarity. April and Alex were very gracious and sincere\nin  demonstrating and explaining everything.\n\n And everyone that met you Frank was pleased to hear what you had to\nsay and as you witnessed, there are a few different ways people use\nthe Box. The attendees of the event that were not familiar with your \nBox seemed to get it almost right away. I think everyone who was there\nappreciated you explaining the concept and it was great to see a group\nof people seated up close to listen to you and your Box 25. No one was\nrushing to leave the billiards room where you were set up even though\nit was past 2 a.m. and most had been up all weekend. Thanks for\nshowing up! \n-Bill   \n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@...&gt; wrote:\n&gt;\n&gt; \n&gt; Thanks Bill!!!!!\n&gt;  \n&gt;  I have only two boxes at the moment, one is not meant for travel,\nas I have it set up with a seperate power supply, and sound chamber\nfor testing. The other is the new printed circuit version that has a\ncouple problems still.  I showed this one at the Stanley over the\nweekend. There is the box made by paranormalsystems.com, it works, and\nthere is a sound sample on the site. I saw the Mini Box at the Stanley\nand was impressed. \n&gt;  \n&gt;   Frank-S\n&gt; \n&gt; \n&gt; To: EVP-ITC@...: vilhellm@...: Mon, 19 Nov 2007 11:29:25\n+0000Subject: [EVP-ITC] Re: My take on this ridiculous MiniBox War 07&#39;\non here\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Judy, I&#39;m near Hollywood and I work with a small group of like\nmindedresearchers. We have a Frank&#39;s Box and you&#39;ll never, ever have\nto eventhink we would ask for anything from you to participate in a\nBoxsession. -Bill--- In EVP-ITC@yahoogroups.com,\n&quot;judy_in_hollywood&quot;&lt;Ticket_to_Heaven@&gt; wrote:&gt;&gt; --- In\nEVP-ITC@yahoogroups.com, &quot;Steve Hultay&quot; &lt;urkel23@&gt; wrote:&gt; &gt;&gt; &gt; &gt; &gt; I\nstarted the research with a box i was lucky to have made based &gt; off &gt;\n&gt; of Frank&#39;s idea. As all on this board one way or another would &gt;\nhave &gt; &gt; done anything to get their hands on one of Frank&#39;s boxes or &gt;\n&gt; something equivalent. So, now it&#39;s your chance to get another &gt; &gt;\nversion of an already great idea and everyone&#39;s complaining. Isn&#39;t &gt; &gt;\nthis the answer to everyone&#39;s problem, it may be pricey but i know &gt; &gt;\npeople who would have paid more in the past for a similar item. &gt; &gt;\nThis board is for research, this is just another idea just like &gt; &gt;\nJoe&#39;s idea of joe&#39;s box and frank&#39;s &quot;frank&#39;s box&quot;. If this version &gt; &gt;\ndoesn&#39;t work, than the idea will kill itself. But, now people can &gt; &gt;\nget to see if they are truly meant to work with the other side or &gt; &gt;\none of the 30 or 80 or whatever the number is up to now. I think &gt; if\n&gt; &gt; you don&#39;t like this minibox than don&#39;t buy it, but isn&#39;t anybody &gt;\n&gt; curious to see the results people get with it or don&#39;t. Just my &gt; &gt;\ntake on it, i think it&#39;s crazy that everyone is getting so upset &gt; &gt;\nabout another form of communication. It took me back at first &gt; &gt;\nbecause i felt this would kill my research, but we don&#39;t know if &gt; &gt;\nthis even works yet. These things happen for a reason by stuff out &gt; &gt;\nof our control. All we can do is sit back and watch, and who &gt; didn&#39;t\n&gt; &gt; think someone was going to mass produce this idea eventually &gt; &gt;\nanyway? &gt; &gt; &gt; &gt; -Steve H.&gt; &gt;&gt; - - - - - - - - - - - - - - - - - - - -\n- - - - - - - - - - - - -&gt; Hi Steve H., My thoughts are if the boxes\nDO work well for &gt; those that are truely interested in doing research\nwith them - &gt; daily!! I&#39;d still like to experience one, but am in L.A.\n- where no &gt; one&#39;s doing Public demos of it = UGH! Chris -who was in\nSan diego &gt; today wants $125. for the admission!! Yikes! =Judy=&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Your smile counts. The more smiles you share, the more we donate. \nJoin in.\n&gt; www.windowslive.com/smile?ocid=TXT_TAGLM_Wave2_oprsmilewlhmtagline\n&gt;"}