{"id": "3137", "subject": "Re: My take on this ridiculous MiniBox War 07&#39; on here", "author": "judy_in_hollywood", "timestamp": "2007-11-20T03:40:59Z", "full_text": "Hiya, Bill, Been trying to find out where you are (Frank said \nyou&#39;re near me)! I&#39;m In Mar Vista near Venice Beach . . not far \nfrom &quot;HollyWeird&quot;! LOL.   Would love to be present durring one of \nyour sessions! I&#39;m SOOoooo interested in this subject! I&#39;ve gotten a \nfew EVP&#39;S from my portable Sony cassette tape recorder with external \nmic - at The Hillcrest Cemetary, near me! It really surprized me - \nwhen I heard them!!    \n=Judy=                                                                \n                                                                     -\n-- In EVP-ITC@yahoogroups.com, &quot;psi_research&quot; &lt;vilhellm@...&gt; wrote:\n&gt;\n&gt; Judy, I&#39;m near Hollywood and I work with a small group of like \nminded\n&gt; researchers. We have a Frank&#39;s Box and you&#39;ll never, ever have to \neven\n&gt; think we would ask for anything from you to participate in a Box\n&gt; session. -Bill\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;judy_in_hollywood&quot;\n&gt; &lt;Ticket_to_Heaven@&gt; wrote:\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;Steve Hultay&quot; &lt;urkel23@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; \n&gt; &gt; &gt; I started the research with a box i was lucky to have made \nbased \n&gt; &gt; off \n&gt; &gt; &gt; of Frank&#39;s idea.  As all on this board one way or another would \n&gt; &gt; have \n&gt; &gt; &gt; done anything to get their hands on one of Frank&#39;s boxes or \n&gt; &gt; &gt; something equivalent.  So, now it&#39;s your chance to get another \n&gt; &gt; &gt; version of an already great idea and everyone&#39;s complaining.  \nIsn&#39;t \n&gt; &gt; &gt; this the answer to everyone&#39;s problem, it may be pricey but i \nknow \n&gt; &gt; &gt; people who would have paid more in the past for a similar \nitem.  \n&gt; &gt; &gt; This board is for research, this is just another idea just like \n&gt; &gt; &gt; Joe&#39;s idea of joe&#39;s box and frank&#39;s &quot;frank&#39;s box&quot;.  If this \nversion \n&gt; &gt; &gt; doesn&#39;t work, than the idea will kill itself.  But, now people \ncan \n&gt; &gt; &gt; get to see if they are truly meant to work with the other side \nor \n&gt; &gt; &gt; one of the 30 or 80 or whatever the number is up to now.  I \nthink \n&gt; &gt; if \n&gt; &gt; &gt; you don&#39;t like this minibox than don&#39;t buy it, but isn&#39;t \nanybody \n&gt; &gt; &gt; curious to see the results people get with it or don&#39;t.  Just \nmy \n&gt; &gt; &gt; take on it, i think it&#39;s crazy that everyone is getting so \nupset \n&gt; &gt; &gt; about another form of communication.  It took me back at first \n&gt; &gt; &gt; because i felt this would kill my research, but we don&#39;t know \nif \n&gt; &gt; &gt; this even works yet.  These things happen for a reason by stuff \nout \n&gt; &gt; &gt; of our control.  All we can do is sit back and watch, and who \n&gt; &gt; didn&#39;t \n&gt; &gt; &gt; think someone was going to mass produce this idea eventually \n&gt; &gt; &gt; anyway?  \n&gt; &gt; &gt; \n&gt; &gt; &gt; -Steve H.\n&gt; &gt; &gt;\n&gt; &gt;  - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\n&gt; &gt;       Hi Steve H., My thoughts are if the boxes DO work well for \n&gt; &gt; those that are truely interested in doing research with them - \n&gt; &gt; daily!! I&#39;d still like to experience one, but am in L.A. - where \nno \n&gt; &gt; one&#39;s doing Public demos of it = UGH! Chris -who was in San diego \n&gt; &gt; today wants $125. for the admission!! Yikes!     =Judy=\n&gt; &gt;\n&gt;"}