{"id": "3155", "subject": "Re: [EVP-ITC] Okay, I did it.", "author": "Lisby", "timestamp": "2007-11-22T15:10:01Z", "full_text": "I&#39;m supposed to be in the lot made in the second week in January. I  \nwatched the demo for it last night and it seems easy enough to  \nunderstand, even for the technically braindead like me. That said,  \nI&#39;m going to have tuning issues I think, so I will be begging for  \nadvice.\n\nHappy Thanksgiving, Frank. Let the aliens have some turkey today, too!\n\nAnn\n\nOn Nov 22, 2007, at 1:47 AM, Frank Sumption wrote:\n\n&gt;\n&gt; Well at last! I just couldn&#39;t get it together on maufacturing this  \n&gt; stuff, and couldn&#39;t get all the bugs out--yet. I&#39;m just not a  \n&gt; business person, and not even an engineer. I don&#39;t think it was for  \n&gt; me to produce that boxes, just get the concept out there.  \n&gt; Interesting that a non profit outfit is making it. That&#39;s not to  \n&gt; say they give theirs away free either.\n&gt;\n&gt;  I am very pleased that someone out not only comprehends how the  \n&gt; box is supposed to work, but can make it available. It is a relief  \n&gt; to me!\n&gt;\n&gt;  Frank-S\n&gt;\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; From: lisby@...\n&gt; Date: Wed, 21 Nov 2007 15:06:31 -0500\n&gt; Subject: [EVP-ITC] Okay, I did it.\n&gt;\n&gt; I just preordered a minibox.\n&gt;\n&gt; In January, looks like, I will finally get my chance to play, too. ;)\n&gt;\n&gt; Ann\n&gt;\n&gt;\n&gt;\n&gt; Share life as it happens with the new Windows Live. Share now!\n&gt;\n&gt; \n\n\nI'm supposed o be in he lo made in he second week in Janua y. I wa ched he demo o i las nigh and i seems easy enough o unde s and, e en o he echnically b aindead like me. Tha said, I'm going o ha e uning issues I hink, so I will be begging o ad ice.Happy Thanksgi ing, F ank. Le he aliens ha e some u key oday, oo!AnnOn No 22, 2007, a 1:47 AM, F ank Sump ion w o e:Well a las ! I jus couldn' ge i oge he on mau ac u ing his s u , and couldn' ge all he bugs ou --ye . I'm jus no a business pe son, and no e en an enginee . I don' hink i was o me o p oduce ha boxes, jus ge he concep ou he e. In e es ing ha a non p o i ou i is making i . Tha 's no o say hey gi e hei s away ee ei he .   I am e y pleased ha someone ou no only comp ehends how he box is supposed o wo k, bu can make i a ailable. I is a elie o me!  F ank-STo: EVP-ITC@yahoog oups.comF om: lisby@ea hlink.ne Da e: Wed, 21 No 2007 15:06:31 -0500Subjec : [EVP-ITC] Okay, I did i .I jus p eo de ed a minibox.In Janua y, looks like, I will inally ge my chance o play, oo. ;)AnnSha e li e as i happens wi h he new Windows Li e. Sha e now!"}