{"id": "3165", "subject": "Re: Okay, I did it.", "author": "bhali333", "timestamp": "2007-11-22T19:33:16Z", "full_text": "Frank,\n\nI know exactly what you mean, during a session the other day I heard \na small childs voice over the regular signal and it sounded like it \nwas in the room with me. It actually gave me a chill. I going to post \nthe file in the file section in the folder marked 11-22-07.\n\nthe files are both reverse files first word is forward second reversed\n\nbruce\n\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@...&gt; \nwrote:\n&gt;\n&gt; \n&gt;  Back in the days that I could play more--I used to get voices that \nwere like 3-d, they would seeimly be infront of the speaker, not \nsounding like they were coming from the speakers, if that makes any \nsense. I&#39;m trying to dulpicate, or provide the raw audio that allows \nthose effects. \n&gt;  \n&gt;  Frank-s\n&gt; \n&gt; \n&gt; To: EVP-ITC@...: piggsy@...: Thu, 22 Nov 2007 13:02:32 -\n0600Subject: Re: [EVP-ITC] Okay, I did it.\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; It will be interesting to hear responses in stereo.\n&gt; \n&gt; ----- Original Message ----- \n&gt; From: Frank Sumption \n&gt; To: evp-itc@yahoogroups.com \n&gt; Sent: Thursday, November 22, 2007 12:40 PM\n&gt; Subject: RE: [EVP-ITC] Okay, I did it.\n&gt;  Okay. I&#39;m mkaing one kinda based onthe Mini Box, just the linear \nmode, no sound sound chamber, no mics. I have a Walkman board I&#39;m \nusing as a radio, which has steroe outputs, so I&#39;ll have twin \nspeakers, and dual channel line output.   Frank-S\n&gt; \n&gt; \n&gt; To: EVP-ITC@...: lisby@...: Thu, 22 Nov 2007 10:10:01 -0500Subject: \nRe: [EVP-ITC] Okay, I did it.\n&gt; \n&gt; \n&gt; I&#39;m supposed to be in the lot made in the second week in January. I \nwatched the demo for it last night and it seems easy enough to \nunderstand, even for the technically braindead like me. That said, \nI&#39;m going to have tuning issues I think, so I will be begging for \nadvice. \n&gt; \n&gt; Happy Thanksgiving, Frank. Let the aliens have some turkey today, \ntoo!\n&gt; \n&gt; Ann\n&gt; \n&gt; \n&gt; On Nov 22, 2007, at 1:47 AM, Frank Sumption wrote:\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Well at last! I just couldn&#39;t get it together on maufacturing this \nstuff, and couldn&#39;t get all the bugs out--yet. I&#39;m just not a \nbusiness person, and not even an engineer. I don&#39;t think it was for \nme to produce that boxes, just get the concept out there. Interesting \nthat a non profit outfit is making it. That&#39;s not to say they give \ntheirs away free either.   I am very pleased that someone out not \nonly comprehends how the box is supposed to work, but can make it \navailable. It is a relief to me!  Frank-S\n&gt; \n&gt; \n&gt; To: EVP-ITC@...: lisby@...: Wed, 21 Nov 2007 15:06:31 -0500Subject: \n[EVP-ITC] Okay, I did it.\n&gt; \n&gt; \n&gt; I just preordered a minibox.In January, looks like, I will finally \nget my chance to play, too. ;)Ann\n&gt; \n&gt; Share life as it happens with the new Windows Live. Share now! \n&gt; \n&gt; \n&gt; Get the power of Windows + Web with the new Windows Live. Power up! \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Your smile counts. The more smiles you share, the more we donate. \nJoin in.\n&gt; www.windowslive.com/smile?ocid=TXT_TAGLM_Wave2_oprsmilewlhmtagline\n&gt;"}