{"id": "3183", "subject": "Re: Family hour around the radio", "author": "babiarz3", "timestamp": "2007-11-23T19:58:45Z", "full_text": "I am a fairly quiet person, most of the time. I have my thoughts and\nopinions on topics but feel strongly about &quot;to each his own&quot;. Unless\nsomething strikes me as completely wrong, I won&#39;t debate. No one here\nhas heard from me other than recently with this mini-box yet, I am\nhere several times weekly reading and offering my energy in support of\nthe research.\nHowever...something is striking me here and again, I can&#39;t keep my\nmouth shut. The discussion about the family hour with the box has led\nthe way for people to mention negativity and even &quot;the dark guys&quot; can\nbe fun if not taken seriously.\nI ask you to consider the fact that many who purchase the mini-box\nwill not be of the right frame of mind. Most will not be in harmony.\nMany will take &quot;the dark guys&quot; seriously. Yet, you feel it&#39;s a good\nidea to let anyone who wants a box have one? All in the name of\nsharing technology.\nI know that my previous posts expressing my concern over the mass\nmarketing of the box, was barely given consideration. Realize that I\nam not being selfish- I do not own a box. EVP is my passion and has\nbeen from day one 6 years ago when I jumped fully into the field. I am\nsuccessful in capturing EVP, always have been. I still do it the &quot;old\nfashioned way&quot; with open air techniques. Would I love to be able to\nhold real time 2 way communications with the other side? Of course.\nHowever, I do not think enough research into the possibilities has\nbeen done to warrant the approval let alone production of these boxes. \nThose of us who have been on countless investigations with many people\nwill quickly admit that there are some people we&#39;d rather not\ninvestigate with. When they are present, negative things tend to\nhappen. We all know one or two people who we can say &quot;felt dark&quot; from\nthe first meeting. We all admit that being mentally sound is an\nimportant quality in this field. If you have mental issues, this may\nnot be the area of research for you. We don&#39;t bring children on\ninvestigations for obvious reasons. BUT! If you want a box that could\npossibly open up a portal and bridge the gap between here and the\ndark, sure! Anyone who wants one should have it! \nYou might feel that I am over reacting or being overly dramatic.\nThat&#39;s fine. My concern is not what you think of me but that you\nconsider the possibilities here. Many of which we do not know. Can you\nbe 100% sure that this is a good idea or that it&#39;s worthy of saying\n&quot;well, we&#39;ll see what happens&quot;? \n\n\n--- In EVP-ITC@yahoogroups.com, bruce halliday\n&lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; Bill,\n&gt;  \n&gt; You have the right idea, I recently have dealt with a lot\n&gt; of negativity from my Frank&#39;s box. Harmony is very important\n&gt; as is the right frame of mind before turning the box on.\n&gt;  \n&gt; hope you & the family had a good holiday.\n&gt;  \n&gt; Bruce\n&gt; \n&gt; Bruce Halliday Paranormal Investigating Team \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: vilhellm@...: Fri, 23 Nov 2007 02:46:20\n+0000Subject: [EVP-ITC] Family hour around the radio\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Maybe we&#39;re just a little unconventional in our household, but most\nof us here are pretty open to the idea of the multiverse. Gathering in\na circle around our Frank&#39;s Box is our idea of quality family time.\nThe messages are relevent, the interest is high, and we&#39;re very well\ngrounded and do not let the tricksters push us around.Happy\nThanksgiving from our home to yours. -Bill \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Connect and share in new ways with Windows Live.\n&gt;\nhttp://www.windowslive.com/connect.html?ocid=TXT_TAGLM_Wave2_newways_112007\n&gt;"}