{"id": "3186", "subject": "RE: [EVP-ITC] Re: Family hour around the radio", "author": "bruce halliday", "timestamp": "2007-11-23T22:38:10Z", "full_text": "--_a3a2b3e7-191a-4d9e-98b3-38fb7d9f93db_\r\nContent-Type: text/plain; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nBabs,\n \nI am thinking of contacting ron the maker of the mini box and offer=\r\n \nto put a page on my box website explaining the do&#39;s and don&#39;ts of box res=\r\nearch and the dangers involved and also the resposibility involed in box \no=\r\nwnership and research. And I&#39;m hoping that will help some of the people who=\r\n are going in blind and buying a mini box will understand what the basics a=\r\nre.\n \nhopefully they can put a link on their mini box sale page.\n \nBruce\n\nB=\r\nruce Halliday Paranormal Investigating Team \n\n\nTo: EVP-ITC@yahoogroups.comF=\r\nrom: babiarz3@...: Fri, 23 Nov 2007 22:13:56 +0000Subject: [EVP-I=\r\nTC] Re: Family hour around the radio\n\n\n\n\nHi Bruce~I understand the light he=\r\nartedness of the &quot;family hour&quot; posts. I don&#39;ttake any issue with that at al=\r\nl. The families of those of us involvedin the paranormal HAVE to be a bit d=\r\nifferent then the average Joe&#39;s orSmith&#39;s. I only referred to that topic be=\r\ncause of the other stuffmentioned- negativity and dark ones.There is absolu=\r\ntely nothing in place to safe guard who purchases thebox and who doesn&#39;t be=\r\nsides the cost. If you&#39;ve got the money or acredit card, the box is yours- =\r\nwhoever &quot;you&quot; are.I don&#39;t think we should presume anything about the purcha=\r\nsers of thebox. I know people in the filed who have never experienced anyth=\r\ningevil or dark and wouldn&#39;t know what to do if they did. Admittedly,they c=\r\nan be and will be deceitful. I am in full support of further research and g=\r\nroups and individualsworking together. However, IMHO, I think this falls in=\r\nto a differentcategory. Morally and ethically, I think it is short sighted =\r\ntoapprove of or promote in any way, the distribution of this device atthis =\r\ntime. When we imagine the possibilities, we need to imagine them all.Babs -=\r\n-- In EVP-ITC@yahoogroups.com, bruce halliday&lt;paranormalinvestigating@...&gt; =\r\nwrote:&gt;&gt; babiarz3,&gt; &gt; I believe the posts you are referring to about family=\r\n hour with the box&gt; where written in a light manner in jest. I do not presu=\r\nme to speakfor anyone &gt; else on this group I&#39;m sure they can speak for them=\r\nselves.&gt; &gt; you speak of responsibility with any form of open communication,=\r\n Ibelieve the individuals that are&gt; studying and distributing the mini box =\r\nare sufficiently experiencedand know who they should sell to and who not.&gt; =\r\n&gt; I don&#39;t believe they mean to put the mini box on the shelves in toysr us.=\r\n Anyone that uses a box whether it be a Frank&#39;s box&gt; A Joe&#39;s box or a mini =\r\nbox will probably have done some research intothis method of evp and will p=\r\nrobably have some intimate experience&gt; with the paranormal field and if not=\r\n I&#39;m sure they will seek advicefrom those of us that have that experience. =\r\nThere is never a lack ofadvice here.&gt; &gt; as far as dark heads go I know thro=\r\nugh personal experience that theycan be deceiving and manipulative with som=\r\neone that does not know anybetter&gt; I have a Frank&#39;s box and a Joe&#39;s box and=\r\n do serious research on adaily basis. My opinion is the good spirits out we=\r\nigh the negativeones and anyone&gt; that experiments with a box will tell you =\r\nthat you do forge strongbonds with what I call my spirit guides or technici=\r\nans, the same twospirits communicate &gt; with me during every session and pro=\r\ntect me from negativity. As longas I do not feed the darkies with my own ne=\r\ngativity I am fine.&gt; &gt; Also I believe that the people who are distributing =\r\nthe mini boxhave set that price to deter any average person that&#39;s complete=\r\nlyignorant of the paranormal&gt; away from purchasing this device.&gt; &gt; I have n=\r\never met bill personally but know of him, he is a wellrespected researcher =\r\nand is well aware I think of the pitfalls as wellas the rewards of box comm=\r\nunication.&gt; and I don&#39;t believe he would ever endanger himself, his family =\r\noranyone else by carelessly using the box for entertainment purposes.&gt; &gt; th=\r\nat Is my opinion for what it&#39;s worth.&gt; &gt; Bruce&gt; &gt; &gt; Bruce Halliday Paranorm=\r\nal Investigating Team &gt; &gt; &gt; To: EVP-ITC@...: babiarz3@...: Fri, 23 Nov 2007=\r\n 19:58:45+0000Subject: [EVP-ITC] Re: Family hour around the radio&gt; &gt; &gt; &gt; &gt; =\r\nI am a fairly quiet person, most of the time. I have my thoughtsandopinions=\r\n on topics but feel strongly about &quot;to each his own&quot;.Unlesssomething strike=\r\ns me as completely wrong, I won&#39;t debate. No oneherehas heard from me other=\r\n than recently with this mini-box yet, Iamhere several times weekly reading=\r\n and offering my energy in supportofthe research.However...something is str=\r\niking me here and again, Ican&#39;t keep mymouth shut. The discussion about the=\r\n family hour with thebox has ledthe way for people to mention negativity an=\r\nd even &quot;the darkguys&quot; canbe fun if not taken seriously.I ask you to conside=\r\nr the factthat many who purchase the mini-boxwill not be of the right frame=\r\n ofmind. Most will not be in harmony.Many will take &quot;the dark guys&quot;seriousl=\r\ny. Yet, you feel it&#39;s a goodidea to let anyone who wants a boxhave one? All=\r\n in the name ofsharing technology.I know that my previousposts expressing m=\r\ny concern over the massmarketing of the box, wasbarely given consideration.=\r\n Realize that Iam not being selfish- I donot own a box. EVP is my passion a=\r\nnd hasbeen from day one 6 years agowhen I jumped fully into the field. I am=\r\nsuccessful in capturing EVP,always have been. I still do it the &quot;oldfashion=\r\ned way&quot; with open airtechniques. Would I love to be able tohold real time 2=\r\n waycommunications with the other side? Of course.However, I do not thinken=\r\nough research into the possibilities hasbeen done to warrant theapproval le=\r\nt alone production of these boxes. Those of us who havebeen on countless in=\r\nvestigations with many peoplewill quickly admitthat there are some people w=\r\ne&#39;d rather notinvestigate with. When theyare present, negative things tend =\r\ntohappen. We all know one or twopeople who we can say &quot;felt dark&quot; fromthe f=\r\nirst meeting. We all admitthat being mentally sound is animportant quality =\r\nin this field. If youhave mental issues, this maynot be the area of researc=\r\nh for you. Wedon&#39;t bring children oninvestigations for obvious reasons. BUT=\r\n! If youwant a box that couldpossibly open up a portal and bridge the gapbe=\r\ntween here and thedark, sure! Anyone who wants one should have it!You might=\r\n feel that I am over reacting or being overly dramatic.That&#39;sfine. My conce=\r\nrn is not what you think of me but that youconsider thepossibilities here. =\r\nMany of which we do not know. Can yoube 100% surethat this is a good idea o=\r\nr that it&#39;s worthy of saying&quot;well, we&#39;ll seewhat happens&quot;? --- In EVP-ITC@y=\r\nahoogroups.com, brucehalliday&lt;paranormalinvestigating@&gt; wrote:&gt;&gt; Bill,&gt; &gt; Y=\r\nou have theright idea, I recently have dealt with a lot&gt; of negativity from=\r\n myFrank&#39;s box. Harmony is very important&gt; as is the right frame of mindbef=\r\nore turning the box on.&gt; &gt; hope you & the family had a goodholiday.&gt; &gt; Bruc=\r\ne&gt; &gt; Bruce Halliday Paranormal Investigating Team &gt; &gt;&gt; To: EVP-ITC@: vilhel=\r\nlm@: Fri, 23 Nov 2007 02:46:20+0000Subject:[EVP-ITC] Family hour around the=\r\n radio&gt; &gt; &gt; &gt; &gt; Maybe we&#39;re just alittle unconventional in our household, b=\r\nut mostof us here are prettyopen to the idea of the multiverse. Gathering i=\r\nna circle around ourFrank&#39;s Box is our idea of quality family time.The mess=\r\nages arerelevent, the interest is high, and we&#39;re very wellgrounded and do =\r\nnotlet the tricksters push us around.HappyThanksgiving from our home toyour=\r\ns. -Bill &gt; &gt; &gt; &gt; &gt; &gt; &gt;_____________________________________________________=\r\n_____&gt; Connectand share in new ways with WindowsLive.&gt;http://www.windowsliv=\r\ne.com/connect.html?ocid=3DTXT_TAGLM_Wave2_newways_112007&gt;&gt; &gt; &gt; &gt; &gt; &gt; &gt; ____=\r\n______________________________________________________&gt; Share life as it ha=\r\nppens with the new Windows Live.Download todayit&#39;s FREE!&gt;http://www.windows=\r\nlive.com/share.html?ocid=3DTXT_TAGLM_Wave2_sharelife_112007&gt; \n\n\n\n\n\n\n_______=\r\n__________________________________________________________\nShare life as it=\r\n happens with the new Windows Live.Download today it&#39;s FREE!\nhttp://www.win=\r\ndowslive.com/share.html?ocid=3DTXT_TAGLM_Wave2_sharelife_112007\r\n--_a3a2b3e7-191a-4d9e-98b3-38fb7d9f93db_\r\nContent-Type: text/html; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;\n&lt;head&gt;\n&lt;style&gt;\n.hmmessage P\n{\nmargin:0px;\npadding:0px\n}\nbody.hmmessa=\r\nge\n{\nFONT-SIZE: 10pt;\nFONT-FAMILY:Tahoma\n}\n&lt;/style&gt;\n&lt;/head&gt;\n&lt;body class=3D&#39;=\r\nhmmessage&#39;&gt;Babs,&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nI am thinking of contacting ron the maker o=\r\nf the mini box and offer &lt;BR&gt;\nto put a page on my box website explaining th=\r\ne do&#39;s and don&#39;ts of box research and the dangers involved and also the res=\r\nposibility involed in box &lt;BR&gt;\nownership and research. And I&#39;m hoping that =\r\nwill help some of the people who are going in blind and buying a mini box w=\r\nill understand what the basics are.&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nhopefully they can put a=\r\n link on their mini box sale page.&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nBruce&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;DIV&gt;\n&lt;=\r\nP align=3Dcenter&gt;&lt;FONT size=3D4&gt;&lt;FONT color=3D#0033cc&gt;&lt;STRONG&gt;&lt;EM&gt;&lt;FONT fac=\r\ne=3D&quot;&quot; color=3D#000000 size=3D5&gt;Bruce Halliday &lt;BR&gt;&lt;/FONT&gt;&lt;/EM&gt;&lt;FONT color=\r\n=3D#000000&gt;Paranormal Investigating Team &lt;/FONT&gt;&lt;/STRONG&gt;&lt;BR&gt;&lt;A href=3D&quot;htt=\r\np://free-paranormalinvestigating.com/%3C/div%3E%3C/div%3E%3Cp%20/%3E%3Cdiv%=\r\n20class=3D&quot; target=3D_blank&gt;&lt;/P&gt;&lt;/DIV&gt;&lt;/FORM&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;BLOCKQUOTE&gt;\n&lt;HR id=\r\n=3DEC_stopSpelling&gt;\nTo: EVP-ITC@yahoogroups.com&lt;BR&gt;From: babiarz3@...=\r\n&lt;BR&gt;Date: Fri, 23 Nov 2007 22:13:56 +0000&lt;BR&gt;Subject: [EVP-ITC] Re: Family =\r\nhour around the radio&lt;BR&gt;&lt;BR&gt;\n&lt;META content=3D&quot;Microsoft SafeHTML&quot; name=3DG=\r\nenerator&gt;\n&lt;DIV id=3DEC_ygrp-mlmsg style=3D&quot;WIDTH: 655px&quot;&gt;\n&lt;DIV id=3DEC_ygrp=\r\n-msg style=3D&quot;PADDING-RIGHT: 15px; PADDING-LEFT: 0px; Z-INDEX: 1; FLOAT: le=\r\nft; PADDING-BOTTOM: 0px; WIDTH: 490px; PADDING-TOP: 0px&quot;&gt;\n&lt;DIV id=3DEC_ygrp=\r\n-text&gt;\n&lt;BR&gt;Hi Bruce~&lt;BR&gt;&lt;BR&gt;I understand the light heartedness of the &quot;fami=\r\nly hour&quot; posts. I don&#39;t&lt;BR&gt;take any issue with that at all. The families of=\r\n those of us involved&lt;BR&gt;in the paranormal HAVE to be a bit different then =\r\nthe average Joe&#39;s or&lt;BR&gt;Smith&#39;s. I only referred to that topic because of t=\r\nhe other stuff&lt;BR&gt;mentioned- negativity and dark ones.&lt;BR&gt;&lt;BR&gt;There is abso=\r\nlutely nothing in place to safe guard who purchases the&lt;BR&gt;box and who does=\r\nn&#39;t besides the cost. If you&#39;ve got the money or a&lt;BR&gt;credit card, the box =\r\nis yours- whoever &quot;you&quot; are.&lt;BR&gt;&lt;BR&gt;I don&#39;t think we should presume anythin=\r\ng about the purchasers of the&lt;BR&gt;box. I know people in the filed who have n=\r\never experienced anything&lt;BR&gt;evil or dark and wouldn&#39;t know what to do if t=\r\nhey did. Admittedly,&lt;BR&gt;they can be and will be deceitful. &lt;BR&gt;&lt;BR&gt;I am in =\r\nfull support of further research and groups and individuals&lt;BR&gt;working toge=\r\nther. However, IMHO, I think this falls into a different&lt;BR&gt;category. Moral=\r\nly and ethically, I think it is short sighted to&lt;BR&gt;approve of or promote i=\r\nn any way, the distribution of this device at&lt;BR&gt;this time. &lt;BR&gt;&lt;BR&gt;When we=\r\n imagine the possibilities, we need to imagine them all.&lt;BR&gt;&lt;BR&gt;Babs &lt;BR&gt;--=\r\n- In &lt;A href=3D&quot;mailto:EVP-ITC@yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.co=\r\nm&lt;/A&gt;, bruce halliday&lt;BR&gt;&lt;paranormalinvestig&lt;WBR&gt;ating@...&lt;WBR&gt;&gt; wrot=\r\ne:&lt;BR&gt;&gt;&lt;BR&gt;&gt; babiarz3,&lt;BR&gt;&gt; &lt;BR&gt;&gt; I believe the posts you are r=\r\neferring to about family hour with the box&lt;BR&gt;&gt; where written in a light=\r\n manner in jest. I do not presume to speak&lt;BR&gt;for anyone &lt;BR&gt;&gt; else on t=\r\nhis group I&#39;m sure they can speak for themselves.&lt;BR&gt;&gt; &lt;BR&gt;&gt; you spea=\r\nk of responsibility with any form of open communication, I&lt;BR&gt;believe the i=\r\nndividuals that are&lt;BR&gt;&gt; studying and distributing the mini box are suff=\r\niciently experienced&lt;BR&gt;and know who they should sell to and who not.&lt;BR&gt;&g=\r\nt; &lt;BR&gt;&gt; I don&#39;t believe they mean to put the mini box on the shelves in=\r\n toys&lt;BR&gt;r us. Anyone that uses a box whether it be a Frank&#39;s box&lt;BR&gt;&gt; A=\r\n Joe&#39;s box or a mini box will probably have done some research into&lt;BR&gt;this=\r\n method of evp and will probably have some intimate experience&lt;BR&gt;&gt; with=\r\n the paranormal field and if not I&#39;m sure they will seek advice&lt;BR&gt;from tho=\r\nse of us that have that experience. There is never a lack of&lt;BR&gt;advice here=\r\n.&lt;BR&gt;&gt; &lt;BR&gt;&gt; as far as dark heads go I know through personal experien=\r\nce that they&lt;BR&gt;can be deceiving and manipulative with someone that does no=\r\nt know any&lt;BR&gt;better&lt;BR&gt;&gt; I have a Frank&#39;s box and a Joe&#39;s box and do se=\r\nrious research on a&lt;BR&gt;daily basis. My opinion is the good spirits out weig=\r\nh the negative&lt;BR&gt;ones and anyone&lt;BR&gt;&gt; that experiments with a box will =\r\ntell you that you do forge strong&lt;BR&gt;bonds with what I call my spirit guide=\r\ns or technicians, the same two&lt;BR&gt;spirits communicate &lt;BR&gt;&gt; with me duri=\r\nng every session and protect me from negativity. As long&lt;BR&gt;as I do not fee=\r\nd the darkies with my own negativity I am fine.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Also I bel=\r\nieve that the people who are distributing the mini box&lt;BR&gt;have set that pri=\r\nce to deter any average person that&#39;s completely&lt;BR&gt;ignorant of the paranor=\r\nmal&lt;BR&gt;&gt; away from purchasing this device.&lt;BR&gt;&gt; &lt;BR&gt;&gt; I have never=\r\n met bill personally but know of him, he is a well&lt;BR&gt;respected researcher =\r\nand is well aware I think of the pitfalls as well&lt;BR&gt;as the rewards of box =\r\ncommunication.&lt;BR&gt;&gt; and I don&#39;t believe he would ever endanger himself, =\r\nhis family or&lt;BR&gt;anyone else by carelessly using the box for entertainment =\r\npurposes.&lt;BR&gt;&gt; &lt;BR&gt;&gt; that Is my opinion for what it&#39;s worth.&lt;BR&gt;&gt; =\r\n&lt;BR&gt;&gt; Bruce&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; Bruce Halliday Paranormal Investig=\r\nating Team &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; To: EVP-ITC@...: babiarz3@...&lt;WBR&gt;: F=\r\nri, 23 Nov 2007 19:58:45&lt;BR&gt;+0000Subject: [EVP-ITC] Re: Family hour around =\r\nthe radio&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; I am a fairly quiet p=\r\nerson, most of the time. I have my thoughts&lt;BR&gt;andopinions on topics but fe=\r\nel strongly about &quot;to each his own&quot;.&lt;BR&gt;Unlesssomething strikes me as compl=\r\netely wrong, I won&#39;t debate. No one&lt;BR&gt;herehas heard from me other than rec=\r\nently with this mini-box yet, I&lt;BR&gt;amhere several times weekly reading and =\r\noffering my energy in support&lt;BR&gt;ofthe research.However.&lt;WBR&gt;..something is=\r\n striking me here and again, I&lt;BR&gt;can&#39;t keep mymouth shut. The discussion a=\r\nbout the family hour with the&lt;BR&gt;box has ledthe way for people to mention n=\r\negativity and even &quot;the dark&lt;BR&gt;guys&quot; canbe fun if not taken seriously.I as=\r\nk you to consider the fact&lt;BR&gt;that many who purchase the mini-boxwill not b=\r\ne of the right frame of&lt;BR&gt;mind. Most will not be in harmony.Many will take=\r\n &quot;the dark guys&quot;&lt;BR&gt;seriously. Yet, you feel it&#39;s a goodidea to let anyone =\r\nwho wants a box&lt;BR&gt;have one? All in the name ofsharing technology.I know th=\r\nat my previous&lt;BR&gt;posts expressing my concern over the massmarketing of the=\r\n box, was&lt;BR&gt;barely given consideration. Realize that Iam not being selfish=\r\n- I do&lt;BR&gt;not own a box. EVP is my passion and hasbeen from day one 6 years=\r\n ago&lt;BR&gt;when I jumped fully into the field. I amsuccessful in capturing EVP=\r\n,&lt;BR&gt;always have been. I still do it the &quot;oldfashioned way&quot; with open air&lt;B=\r\nR&gt;techniques. Would I love to be able tohold real time 2 way&lt;BR&gt;communicati=\r\nons with the other side? Of course.However, I do not think&lt;BR&gt;enough resear=\r\nch into the possibilities hasbeen done to warrant the&lt;BR&gt;approval let alone=\r\n production of these boxes. Those of us who have&lt;BR&gt;been on countless inves=\r\ntigations with many peoplewill quickly admit&lt;BR&gt;that there are some people =\r\nwe&#39;d rather notinvestigate with. When they&lt;BR&gt;are present, negative things =\r\ntend tohappen. We all know one or two&lt;BR&gt;people who we can say &quot;felt dark&quot; =\r\nfromthe first meeting. We all admit&lt;BR&gt;that being mentally sound is animpor=\r\ntant quality in this field. If you&lt;BR&gt;have mental issues, this maynot be th=\r\ne area of research for you. We&lt;BR&gt;don&#39;t bring children oninvestigations for=\r\n obvious reasons. BUT! If you&lt;BR&gt;want a box that couldpossibly open up a po=\r\nrtal and bridge the gap&lt;BR&gt;between here and thedark, sure! Anyone who wants=\r\n one should have it!&lt;BR&gt;You might feel that I am over reacting or being ove=\r\nrly dramatic.That&#39;&lt;WBR&gt;s&lt;BR&gt;fine. My concern is not what you think of me bu=\r\nt that youconsider the&lt;BR&gt;possibilities here. Many of which we do not know.=\r\n Can yoube 100% sure&lt;BR&gt;that this is a good idea or that it&#39;s worthy of say=\r\ning&quot;well, we&#39;ll see&lt;BR&gt;what happens&quot;? --- In &lt;A href=3D&quot;mailto:EVP-ITC@yaho=\r\nogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;, bruce&lt;BR&gt;halliday&lt;paranor=\r\nmal&lt;WBR&gt;investigating@&lt;WBR&gt;&gt; wrote:&gt;&gt; Bill,&gt; &gt; You have the&lt;=\r\nBR&gt;right idea, I recently have dealt with a lot&gt; of negativity from my&lt;B=\r\nR&gt;Frank&#39;s box. Harmony is very important&gt; as is the right frame of mind&lt;=\r\nBR&gt;before turning the box on.&gt; &gt; hope you &amp; the family had a good=\r\n&lt;BR&gt;holiday.&gt; &gt; Bruce&gt; &gt; Bruce Halliday Paranormal Investigatin=\r\ng Team &gt; &gt;&lt;BR&gt;&gt; To: EVP-ITC@: vilhellm@: Fri, 23 Nov 2007 02:46:20=\r\n+0000Subjec&lt;WBR&gt;t:&lt;BR&gt;[EVP-ITC] Family hour around the radio&gt; &gt; &gt; =\r\n&gt; &gt; Maybe we&#39;re just a&lt;BR&gt;little unconventional in our household, but=\r\n mostof us here are pretty&lt;BR&gt;open to the idea of the multiverse. Gathering=\r\n ina circle around our&lt;BR&gt;Frank&#39;s Box is our idea of quality family time.Th=\r\ne messages are&lt;BR&gt;relevent, the interest is high, and we&#39;re very wellground=\r\ned and do not&lt;BR&gt;let the tricksters push us around.HappyThanksg&lt;WBR&gt;iving f=\r\nrom our home to&lt;BR&gt;yours. -Bill &gt; &gt; &gt; &gt; &gt; &gt; &gt;&lt;BR&gt;_____=\r\n_______&lt;WBR&gt;_________&lt;WBR&gt;_________&lt;WBR&gt;_________&lt;WBR&gt;_________&lt;WBR&gt;_______=\r\n__&lt;WBR&gt;_&gt; Connect&lt;BR&gt;and share in new ways with Windows&lt;BR&gt;Live.&gt;&lt;A h=\r\nref=3D&quot;http://www.windowslive.com/connect.html?ocid=3DTXT_TAGLM_Wave2_newwa=\r\nys_112007&quot; target=3D_blank&gt;http://www.windowsl&lt;WBR&gt;ive.com/connect.&lt;WBR&gt;htm=\r\nl?ocid=3D&lt;WBR&gt;TXT_TAGLM_&lt;WBR&gt;Wave2_newways_&lt;WBR&gt;112007&lt;/A&gt;&gt;&lt;BR&gt;&lt;BR&gt;&gt; =\r\n&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; ____________&lt;WBR&gt;____=\r\n_____&lt;WBR&gt;_________&lt;WBR&gt;_________&lt;WBR&gt;_________&lt;WBR&gt;_________&lt;WBR&gt;_&lt;BR&gt;&gt;=\r\n Share life as it happens with the new Windows Live.Download today&lt;BR&gt;it&#39;s =\r\nFREE!&lt;BR&gt;&gt;&lt;BR&gt;&lt;A href=3D&quot;http://www.windowslive.com/share.html?ocid=3DTX=\r\nT_TAGLM_Wave2_sharelife_112007&quot; target=3D_blank&gt;http://www.windowsl&lt;WBR&gt;ive=\r\n.com/share.&lt;WBR&gt;html?ocid=3D&lt;WBR&gt;TXT_TAGLM_&lt;WBR&gt;Wave2_sharelife_&lt;WBR&gt;112007=\r\n&lt;/A&gt;&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;SPAN style=3D&quot;COLOR: white&quot;&gt;&lt;/SPAN&gt; \n&lt;STYLE&gt;=\r\n\n.ExternalClass #EC_ygrp-mkp\n{border:1px solid #d8d8d8;font-family:Arial;pa=\r\ndding:0px 14px;}\n.ExternalClass #EC_ygrp-mkp hr\n{border:1px solid #d8d8d8;}=\r\n\n.ExternalClass #EC_ygrp-mkp #EC_hd\n{color:#628c2a;font-size:85%;font-weigh=\r\nt:bold;line-height:122%;}\n.ExternalClass #EC_ygrp-mkp #EC_ads\n{margin-botto=\r\nm:10px;}\n.ExternalClass #EC_ygrp-mkp .EC_ad\n{padding:0 0;}\n.ExternalClass #=\r\nEC_ygrp-mkp .EC_ad a\n{color:#0000ff;text-decoration:none;}\n\n&lt;/STYLE&gt;\n\n&lt;STYL=\r\nE&gt;\n.ExternalClass #EC_ygrp-sponsor #EC_ygrp-lc\n{font-family:Arial;}\n.Extern=\r\nalClass #EC_ygrp-sponsor #EC_ygrp-lc #EC_hd\n{font-weight:bold;font-size:78%=\r\n;line-height:122%;}\n.ExternalClass #EC_ygrp-sponsor #EC_ygrp-lc .EC_ad\n{mar=\r\ngin-bottom:10px;padding:0 0;}\n\n&lt;/STYLE&gt;\n\n&lt;STYLE&gt;\n.ExternalClass #EC_ygrp-ml=\r\nmsg\n{font-size:13px;font-family:arial,helvetica,clean,sans-serif;}\n.Externa=\r\nlClass #EC_ygrp-mlmsg table\n{font-size:inherit;font:100%;}\n.ExternalClass #=\r\nEC_ygrp-mlmsg select, .ExternalClass input, .ExternalClass textarea\n{font:9=\r\n9% arial,helvetica,clean,sans-serif;}\n.ExternalClass #EC_ygrp-mlmsg pre, .E=\r\nxternalClass code\n{font:115% monospace;}\n.ExternalClass #EC_ygrp-mlmsg EC_*=\r\n\n{line-height:1.22em;}\n.ExternalClass #EC_ygrp-text\n{font-family:Georgia;}\n=\r\n.ExternalClass #EC_ygrp-text p\n{;}\n.ExternalClass #EC_ygrp-tpmsgs\n{font-fam=\r\nily:Arial;clear:both;}\n.ExternalClass #EC_ygrp-vitnav\n{padding-top:10px;fon=\r\nt-family:Verdana;font-size:77%;}\n.ExternalClass #EC_ygrp-vitnav a\n{padding:=\r\n0 1px;}\n.ExternalClass #EC_ygrp-actbar\n{clear:both;white-space:nowrap;color=\r\n:#666;text-align:right;}\n.ExternalClass #EC_ygrp-actbar .EC_left\n{float:lef=\r\nt;white-space:nowrap;}\n.ExternalClass .EC_bld\n{font-weight:bold;}\n.External=\r\nClass #EC_ygrp-grft\n{font-family:Verdana;font-size:77%;padding:15px 0;}\n.Ex=\r\nternalClass #EC_ygrp-ft\n{font-family:verdana;font-size:77%;border-top:1px s=\r\nolid #666;padding:5px 0;}\n.ExternalClass #EC_ygrp-mlmsg #EC_logo\n{padding-b=\r\nottom:10px;}\n.ExternalClass #EC_ygrp-vital\n{background-color:#e0ecee;margin=\r\n-bottom:20px;padding:2px 0 8px 8px;}\n.ExternalClass #EC_ygrp-vital #EC_vith=\r\nd\n{font-size:77%;font-family:Verdana;font-weight:bold;color:#333;text-trans=\r\nform:uppercase;}\n.ExternalClass #EC_ygrp-vital ul\n{padding:0;}\n.ExternalCla=\r\nss #EC_ygrp-vital ul li\n{list-style-type:none;clear:both;border:1px solid #=\r\ne0ecee;}\n.ExternalClass #EC_ygrp-vital ul li .EC_ct\n{font-weight:bold;color=\r\n:#ff7900;float:right;width:2em;text-align:right;padding-right:.5em;}\n.Exter=\r\nnalClass #EC_ygrp-vital ul li .EC_cat\n{font-weight:bold;}\n.ExternalClass #E=\r\nC_ygrp-vital a\n{text-decoration:none;}\n.ExternalClass #EC_ygrp-vital a:hove=\r\nr\n{text-decoration:underline;}\n.ExternalClass #EC_ygrp-sponsor #EC_hd\n{colo=\r\nr:#999;font-size:77%;}\n.ExternalClass #EC_ygrp-sponsor #EC_ov\n{padding:6px =\r\n13px;background-color:#e0ecee;margin-bottom:20px;}\n.ExternalClass #EC_ygrp-=\r\nsponsor #EC_ov ul\n{padding:0 0 0 8px;}\n.ExternalClass #EC_ygrp-sponsor #EC_=\r\nov li\n{list-style-type:square;padding:6px 0;font-size:77%;}\n.ExternalClass =\r\n#EC_ygrp-sponsor #EC_ov li a\n{text-decoration:none;font-size:130%;}\n.Extern=\r\nalClass #EC_ygrp-sponsor #EC_nc\n{background-color:#eee;margin-bottom:20px;p=\r\nadding:0 8px;}\n.ExternalClass #EC_ygrp-sponsor .EC_ad\n{padding:8px 0;}\n.Ext=\r\nernalClass #EC_ygrp-sponsor .EC_ad #EC_hd1\n{font-family:Arial;font-weight:b=\r\nold;color:#628c2a;font-size:100%;line-height:122%;}\n.ExternalClass #EC_ygrp=\r\n-sponsor .EC_ad a\n{text-decoration:none;}\n.ExternalClass #EC_ygrp-sponsor .=\r\nEC_ad a:hover\n{text-decoration:underline;}\n.ExternalClass #EC_ygrp-sponsor =\r\n.EC_ad p\n{;}\n.ExternalClass EC_o\n{font-size:0;}\n.ExternalClass .EC_MsoNorma=\r\nl\n{;}\n.ExternalClass #EC_ygrp-text tt\n{font-size:120%;}\n.ExternalClass bloc=\r\nkquote\n{;}\n.ExternalClass .EC_replbq\n{;}\n\n&lt;/STYLE&gt;\n&lt;/BLOCKQUOTE&gt;&lt;/FONT&gt;&lt;/FO=\r\nNT&gt;&lt;br /&gt;&lt;hr /&gt;Share life as it happens with the new Windows Live. &lt;a href=\r\n=3D&#39;http://www.windowslive.com/share.html?ocid=3DTXT_TAGLM_Wave2_sharelife_=\r\n112007&#39; target=3D&#39;_new&#39;&gt;Share now!&lt;/a&gt;&lt;/body&gt;\n&lt;/html&gt;\r\n--_a3a2b3e7-191a-4d9e-98b3-38fb7d9f93db_--"}