{"id": "3191", "subject": "RE: [EVP-ITC] Re: Family hour around the radio", "author": "Frank Sumption", "timestamp": "2007-11-24T05:19:46Z", "full_text": "--_e1d32c1d-4f49-4e17-98cb-5f19c3e0d3c8_\r\nContent-Type: text/plain; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n\n I used to record sessions with my young grand son sitting on my lap cuz t=\r\nhe box would use his voice to talk me, it was a real kick, and no harm ever=\r\n came to the Grandson. I think your concerns are unfounded. \n \n I talk abou=\r\nt darkheads cuz I dont&#39; know what it is for sure, a level, or faction that =\r\nwants humanity kept inthe dark by using fear and deception. I you don&#39;t tak=\r\ne them serious therye are far less affective in their work. By getting all =\r\nfearful and full of &quot;concerns&quot; you are doing their work. \n \n I&#39;ll say it ag=\r\nain, and offend the majority, but what you all think is known about the par=\r\nanormal is mostly Hollywood. All the evidence you think you have is primari=\r\nly created out of your own expectations. This place you think is the physic=\r\nal is no more solid than the spirits you chase. You can&#39;t trust your senses=\r\n, any of them. \n \n Frank-S\n\n\nTo: EVP-ITC@yahoogroups.comFrom: babiarz3@yaho=\r\no.comDate: Fri, 23 Nov 2007 22:13:56 +0000Subject: [EVP-ITC] Re: Family hou=\r\nr around the radio\n\n\n\n\nHi Bruce~I understand the light heartedness of the &quot;=\r\nfamily hour&quot; posts. I don&#39;ttake any issue with that at all. The families of=\r\n those of us involvedin the paranormal HAVE to be a bit different then the =\r\naverage Joe&#39;s orSmith&#39;s. I only referred to that topic because of the other=\r\n stuffmentioned- negativity and dark ones.There is absolutely nothing in pl=\r\nace to safe guard who purchases thebox and who doesn&#39;t besides the cost. If=\r\n you&#39;ve got the money or acredit card, the box is yours- whoever &quot;you&quot; are.=\r\nI don&#39;t think we should presume anything about the purchasers of thebox. I =\r\nknow people in the filed who have never experienced anythingevil or dark an=\r\nd wouldn&#39;t know what to do if they did. Admittedly,they can be and will be =\r\ndeceitful. I am in full support of further research and groups and individu=\r\nalsworking together. However, IMHO, I think this falls into a differentcate=\r\ngory. Morally and ethically, I think it is short sighted toapprove of or pr=\r\nomote in any way, the distribution of this device atthis time. When we imag=\r\nine the possibilities, we need to imagine them all.Babs --- In EVP-ITC@yaho=\r\nogroups.com, bruce halliday&lt;paranormalinvestigating@...&gt; wrote:&gt;&gt; babiarz3,=\r\n&gt; &gt; I believe the posts you are referring to about family hour with the box=\r\n&gt; where written in a light manner in jest. I do not presume to speakfor any=\r\none &gt; else on this group I&#39;m sure they can speak for themselves.&gt; &gt; you spe=\r\nak of responsibility with any form of open communication, Ibelieve the indi=\r\nviduals that are&gt; studying and distributing the mini box are sufficiently e=\r\nxperiencedand know who they should sell to and who not.&gt; &gt; I don&#39;t believe =\r\nthey mean to put the mini box on the shelves in toysr us. Anyone that uses =\r\na box whether it be a Frank&#39;s box&gt; A Joe&#39;s box or a mini box will probably =\r\nhave done some research intothis method of evp and will probably have some =\r\nintimate experience&gt; with the paranormal field and if not I&#39;m sure they wil=\r\nl seek advicefrom those of us that have that experience. There is never a l=\r\nack ofadvice here.&gt; &gt; as far as dark heads go I know through personal exper=\r\nience that theycan be deceiving and manipulative with someone that does not=\r\n know anybetter&gt; I have a Frank&#39;s box and a Joe&#39;s box and do serious resear=\r\nch on adaily basis. My opinion is the good spirits out weigh the negativeon=\r\nes and anyone&gt; that experiments with a box will tell you that you do forge =\r\nstrongbonds with what I call my spirit guides or technicians, the same twos=\r\npirits communicate &gt; with me during every session and protect me from negat=\r\nivity. As longas I do not feed the darkies with my own negativity I am fine=\r\n.&gt; &gt; Also I believe that the people who are distributing the mini boxhave s=\r\net that price to deter any average person that&#39;s completelyignorant of the =\r\nparanormal&gt; away from purchasing this device.&gt; &gt; I have never met bill pers=\r\nonally but know of him, he is a wellrespected researcher and is well aware =\r\nI think of the pitfalls as wellas the rewards of box communication.&gt; and I =\r\ndon&#39;t believe he would ever endanger himself, his family oranyone else by c=\r\narelessly using the box for entertainment purposes.&gt; &gt; that Is my opinion f=\r\nor what it&#39;s worth.&gt; &gt; Bruce&gt; &gt; &gt; Bruce Halliday Paranormal Investigating T=\r\neam &gt; &gt; &gt; To: EVP-ITC@...: babiarz3@...: Fri, 23 Nov 2007 19:58:45+0000Subj=\r\nect: [EVP-ITC] Re: Family hour around the radio&gt; &gt; &gt; &gt; &gt; I am a fairly quie=\r\nt person, most of the time. I have my thoughtsandopinions on topics but fee=\r\nl strongly about &quot;to each his own&quot;.Unlesssomething strikes me as completely=\r\n wrong, I won&#39;t debate. No oneherehas heard from me other than recently wit=\r\nh this mini-box yet, Iamhere several times weekly reading and offering my e=\r\nnergy in supportofthe research.However...something is striking me here and =\r\nagain, Ican&#39;t keep mymouth shut. The discussion about the family hour with =\r\nthebox has ledthe way for people to mention negativity and even &quot;the darkgu=\r\nys&quot; canbe fun if not taken seriously.I ask you to consider the factthat man=\r\ny who purchase the mini-boxwill not be of the right frame ofmind. Most will=\r\n not be in harmony.Many will take &quot;the dark guys&quot;seriously. Yet, you feel i=\r\nt&#39;s a goodidea to let anyone who wants a boxhave one? All in the name ofsha=\r\nring technology.I know that my previousposts expressing my concern over the=\r\n massmarketing of the box, wasbarely given consideration. Realize that Iam =\r\nnot being selfish- I donot own a box. EVP is my passion and hasbeen from da=\r\ny one 6 years agowhen I jumped fully into the field. I amsuccessful in capt=\r\nuring EVP,always have been. I still do it the &quot;oldfashioned way&quot; with open =\r\nairtechniques. Would I love to be able tohold real time 2 waycommunications=\r\n with the other side? Of course.However, I do not thinkenough research into=\r\n the possibilities hasbeen done to warrant theapproval let alone production=\r\n of these boxes. Those of us who havebeen on countless investigations with =\r\nmany peoplewill quickly admitthat there are some people we&#39;d rather notinve=\r\nstigate with. When theyare present, negative things tend tohappen. We all k=\r\nnow one or twopeople who we can say &quot;felt dark&quot; fromthe first meeting. We a=\r\nll admitthat being mentally sound is animportant quality in this field. If =\r\nyouhave mental issues, this maynot be the area of research for you. Wedon&#39;t=\r\n bring children oninvestigations for obvious reasons. BUT! If youwant a box=\r\n that couldpossibly open up a portal and bridge the gapbetween here and the=\r\ndark, sure! Anyone who wants one should have it!You might feel that I am ov=\r\ner reacting or being overly dramatic.That&#39;sfine. My concern is not what you=\r\n think of me but that youconsider thepossibilities here. Many of which we d=\r\no not know. Can yoube 100% surethat this is a good idea or that it&#39;s worthy=\r\n of saying&quot;well, we&#39;ll seewhat happens&quot;? --- In EVP-ITC@yahoogroups.com, br=\r\nucehalliday&lt;paranormalinvestigating@&gt; wrote:&gt;&gt; Bill,&gt; &gt; You have theright i=\r\ndea, I recently have dealt with a lot&gt; of negativity from myFrank&#39;s box. Ha=\r\nrmony is very important&gt; as is the right frame of mindbefore turning the bo=\r\nx on.&gt; &gt; hope you & the family had a goodholiday.&gt; &gt; Bruce&gt; &gt; Bruce Hallida=\r\ny Paranormal Investigating Team &gt; &gt;&gt; To: EVP-ITC@: vilhellm@: Fri, 23 Nov 2=\r\n007 02:46:20+0000Subject:[EVP-ITC] Family hour around the radio&gt; &gt; &gt; &gt; &gt; Ma=\r\nybe we&#39;re just alittle unconventional in our household, but mostof us here =\r\nare prettyopen to the idea of the multiverse. Gathering ina circle around o=\r\nurFrank&#39;s Box is our idea of quality family time.The messages arerelevent, =\r\nthe interest is high, and we&#39;re very wellgrounded and do notlet the trickst=\r\ners push us around.HappyThanksgiving from our home toyours. -Bill &gt; &gt; &gt; &gt; &gt;=\r\n &gt; &gt;__________________________________________________________&gt; Connectand =\r\nshare in new ways with WindowsLive.&gt;http://www.windowslive.com/connect.html=\r\n?ocid=3DTXT_TAGLM_Wave2_newways_112007&gt;&gt; &gt; &gt; &gt; &gt; &gt; &gt; ______________________=\r\n____________________________________&gt; Share life as it happens with the new=\r\n Windows Live.Download todayit&#39;s FREE!&gt;http://www.windowslive.com/share.htm=\r\nl?ocid=3DTXT_TAGLM_Wave2_sharelife_112007&gt; \n\n\n\n\n\n\n_________________________=\r\n________________________________________\nConnect and share in new ways with=\r\n Windows Live.\nhttp://www.windowslive.com/connect.html?ocid=3DTXT_TAGLM_Wav=\r\ne2_newways_112007\r\n--_e1d32c1d-4f49-4e17-98cb-5f19c3e0d3c8_\r\nContent-Type: text/html; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;\n&lt;head&gt;\n&lt;style&gt;\n.hmmessage P\n{\nmargin:0px;\npadding:0px\n}\nbody.hmmessa=\r\nge\n{\nFONT-SIZE: 10pt;\nFONT-FAMILY:Tahoma\n}\n&lt;/style&gt;\n&lt;/head&gt;\n&lt;body class=3D&#39;=\r\nhmmessage&#39;&gt;\n&nbsp;I used to record sessions with my young grand son sitting=\r\n on my lap cuz the box would use his voice to talk&nbsp;me, it was a real k=\r\nick, and no harm ever came to the Grandson. I think your concerns are unfou=\r\nnded. &lt;BR&gt;\n&nbsp;&lt;BR&gt;\n&nbsp;I talk about darkheads cuz&nbsp;I dont&#39; know wh=\r\nat it is for sure, a level, or faction that wants humanity kept inthe dark =\r\nby using fear and deception. I you don&#39;t take them serious therye are far l=\r\ness affective in their work. By getting all fearful and full of &quot;concerns&quot; =\r\nyou are doing their work. &lt;BR&gt;\n&nbsp;&lt;BR&gt;\n&nbsp;I&#39;ll say it again, and offe=\r\nnd the majority, but what you all think is&nbsp;known about the paranormal =\r\nis mostly Hollywood. All the evidence you think you have is primarily creat=\r\ned out of your own expectations. This place you think is the physical is no=\r\n more solid than the spirits you chase. You can&#39;t trust your senses, any of=\r\n them. &lt;BR&gt;\n&nbsp;&lt;BR&gt;\n&nbsp;Frank-S&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;BLOCKQUOTE&gt;\n&lt;HR&gt;\nTo: EVP-=\r\nITC@yahoogroups.com&lt;BR&gt;From: babiarz3@...&lt;BR&gt;Date: Fri, 23 Nov 2007 2=\r\n2:13:56 +0000&lt;BR&gt;Subject: [EVP-ITC] Re: Family hour around the radio&lt;BR&gt;&lt;BR=\r\n&gt;\n&lt;META content=3D&quot;Microsoft SafeHTML&quot; name=3DGenerator&gt;\n&lt;DIV id=3DEC_ygrp-=\r\nmlmsg style=3D&quot;WIDTH: 655px&quot;&gt;\n&lt;DIV id=3DEC_ygrp-msg style=3D&quot;PADDING-RIGHT:=\r\n 15px; PADDING-LEFT: 0px; Z-INDEX: 1; FLOAT: left; PADDING-BOTTOM: 0px; WID=\r\nTH: 490px; PADDING-TOP: 0px&quot;&gt;\n&lt;DIV id=3DEC_ygrp-text&gt;\n&lt;BR&gt;Hi Bruce~&lt;BR&gt;&lt;BR&gt;=\r\nI understand the light heartedness of the &quot;family hour&quot; posts. I don&#39;t&lt;BR&gt;t=\r\nake any issue with that at all. The families of those of us involved&lt;BR&gt;in =\r\nthe paranormal HAVE to be a bit different then the average Joe&#39;s or&lt;BR&gt;Smit=\r\nh&#39;s. I only referred to that topic because of the other stuff&lt;BR&gt;mentioned-=\r\n negativity and dark ones.&lt;BR&gt;&lt;BR&gt;There is absolutely nothing in place to s=\r\nafe guard who purchases the&lt;BR&gt;box and who doesn&#39;t besides the cost. If you=\r\n&#39;ve got the money or a&lt;BR&gt;credit card, the box is yours- whoever &quot;you&quot; are.=\r\n&lt;BR&gt;&lt;BR&gt;I don&#39;t think we should presume anything about the purchasers of th=\r\ne&lt;BR&gt;box. I know people in the filed who have never experienced anything&lt;BR=\r\n&gt;evil or dark and wouldn&#39;t know what to do if they did. Admittedly,&lt;BR&gt;they=\r\n can be and will be deceitful. &lt;BR&gt;&lt;BR&gt;I am in full support of further rese=\r\narch and groups and individuals&lt;BR&gt;working together. However, IMHO, I think=\r\n this falls into a different&lt;BR&gt;category. Morally and ethically, I think it=\r\n is short sighted to&lt;BR&gt;approve of or promote in any way, the distribution =\r\nof this device at&lt;BR&gt;this time. &lt;BR&gt;&lt;BR&gt;When we imagine the possibilities, =\r\nwe need to imagine them all.&lt;BR&gt;&lt;BR&gt;Babs &lt;BR&gt;--- In &lt;A href=3D&quot;mailto:EVP-I=\r\nTC@yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;, bruce halliday&lt;BR&gt;&lt=\r\n;paranormalinvestig&lt;WBR&gt;ating@...&lt;WBR&gt;&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; babiarz3,=\r\n&lt;BR&gt;&gt; &lt;BR&gt;&gt; I believe the posts you are referring to about family hou=\r\nr with the box&lt;BR&gt;&gt; where written in a light manner in jest. I do not pr=\r\nesume to speak&lt;BR&gt;for anyone &lt;BR&gt;&gt; else on this group I&#39;m sure they can =\r\nspeak for themselves.&lt;BR&gt;&gt; &lt;BR&gt;&gt; you speak of responsibility with any=\r\n form of open communication, I&lt;BR&gt;believe the individuals that are&lt;BR&gt;&gt; =\r\nstudying and distributing the mini box are sufficiently experienced&lt;BR&gt;and =\r\nknow who they should sell to and who not.&lt;BR&gt;&gt; &lt;BR&gt;&gt; I don&#39;t believe =\r\nthey mean to put the mini box on the shelves in toys&lt;BR&gt;r us. Anyone that u=\r\nses a box whether it be a Frank&#39;s box&lt;BR&gt;&gt; A Joe&#39;s box or a mini box wil=\r\nl probably have done some research into&lt;BR&gt;this method of evp and will prob=\r\nably have some intimate experience&lt;BR&gt;&gt; with the paranormal field and if=\r\n not I&#39;m sure they will seek advice&lt;BR&gt;from those of us that have that expe=\r\nrience. There is never a lack of&lt;BR&gt;advice here.&lt;BR&gt;&gt; &lt;BR&gt;&gt; as far as=\r\n dark heads go I know through personal experience that they&lt;BR&gt;can be decei=\r\nving and manipulative with someone that does not know any&lt;BR&gt;better&lt;BR&gt;&gt;=\r\n I have a Frank&#39;s box and a Joe&#39;s box and do serious research on a&lt;BR&gt;daily=\r\n basis. My opinion is the good spirits out weigh the negative&lt;BR&gt;ones and a=\r\nnyone&lt;BR&gt;&gt; that experiments with a box will tell you that you do forge s=\r\ntrong&lt;BR&gt;bonds with what I call my spirit guides or technicians, the same t=\r\nwo&lt;BR&gt;spirits communicate &lt;BR&gt;&gt; with me during every session and protect=\r\n me from negativity. As long&lt;BR&gt;as I do not feed the darkies with my own ne=\r\ngativity I am fine.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Also I believe that the people who are=\r\n distributing the mini box&lt;BR&gt;have set that price to deter any average pers=\r\non that&#39;s completely&lt;BR&gt;ignorant of the paranormal&lt;BR&gt;&gt; away from purcha=\r\nsing this device.&lt;BR&gt;&gt; &lt;BR&gt;&gt; I have never met bill personally but kno=\r\nw of him, he is a well&lt;BR&gt;respected researcher and is well aware I think of=\r\n the pitfalls as well&lt;BR&gt;as the rewards of box communication.&lt;BR&gt;&gt; and I=\r\n don&#39;t believe he would ever endanger himself, his family or&lt;BR&gt;anyone else=\r\n by carelessly using the box for entertainment purposes.&lt;BR&gt;&gt; &lt;BR&gt;&gt; t=\r\nhat Is my opinion for what it&#39;s worth.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Bruce&lt;BR&gt;&gt; &lt;BR&gt;&=\r\ngt; &lt;BR&gt;&gt; Bruce Halliday Paranormal Investigating Team &lt;BR&gt;&gt; &lt;BR&gt;&gt;=\r\n &lt;BR&gt;&gt; To: EVP-ITC@...: babiarz3@...&lt;WBR&gt;: Fri, 23 Nov 2007 19:58:45&lt;BR&gt;=\r\n+0000Subject: [EVP-ITC] Re: Family hour around the radio&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;=\r\nBR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; I am a fairly quiet person, most of the time. I h=\r\nave my thoughts&lt;BR&gt;andopinions on topics but feel strongly about &quot;to each h=\r\nis own&quot;.&lt;BR&gt;Unlesssomething strikes me as completely wrong, I won&#39;t debate.=\r\n No one&lt;BR&gt;herehas heard from me other than recently with this mini-box yet=\r\n, I&lt;BR&gt;amhere several times weekly reading and offering my energy in suppor=\r\nt&lt;BR&gt;ofthe research.However.&lt;WBR&gt;..something is striking me here and again,=\r\n I&lt;BR&gt;can&#39;t keep mymouth shut. The discussion about the family hour with th=\r\ne&lt;BR&gt;box has ledthe way for people to mention negativity and even &quot;the dark=\r\n&lt;BR&gt;guys&quot; canbe fun if not taken seriously.I ask you to consider the fact&lt;B=\r\nR&gt;that many who purchase the mini-boxwill not be of the right frame of&lt;BR&gt;m=\r\nind. Most will not be in harmony.Many will take &quot;the dark guys&quot;&lt;BR&gt;seriousl=\r\ny. Yet, you feel it&#39;s a goodidea to let anyone who wants a box&lt;BR&gt;have one?=\r\n All in the name ofsharing technology.I know that my previous&lt;BR&gt;posts expr=\r\nessing my concern over the massmarketing of the box, was&lt;BR&gt;barely given co=\r\nnsideration. Realize that Iam not being selfish- I do&lt;BR&gt;not own a box. EVP=\r\n is my passion and hasbeen from day one 6 years ago&lt;BR&gt;when I jumped fully =\r\ninto the field. I amsuccessful in capturing EVP,&lt;BR&gt;always have been. I sti=\r\nll do it the &quot;oldfashioned way&quot; with open air&lt;BR&gt;techniques. Would I love t=\r\no be able tohold real time 2 way&lt;BR&gt;communications with the other side? Of =\r\ncourse.However, I do not think&lt;BR&gt;enough research into the possibilities ha=\r\nsbeen done to warrant the&lt;BR&gt;approval let alone production of these boxes. =\r\nThose of us who have&lt;BR&gt;been on countless investigations with many peoplewi=\r\nll quickly admit&lt;BR&gt;that there are some people we&#39;d rather notinvestigate w=\r\nith. When they&lt;BR&gt;are present, negative things tend tohappen. We all know o=\r\nne or two&lt;BR&gt;people who we can say &quot;felt dark&quot; fromthe first meeting. We al=\r\nl admit&lt;BR&gt;that being mentally sound is animportant quality in this field. =\r\nIf you&lt;BR&gt;have mental issues, this maynot be the area of research for you. =\r\nWe&lt;BR&gt;don&#39;t bring children oninvestigations for obvious reasons. BUT! If yo=\r\nu&lt;BR&gt;want a box that couldpossibly open up a portal and bridge the gap&lt;BR&gt;b=\r\netween here and thedark, sure! Anyone who wants one should have it!&lt;BR&gt;You =\r\nmight feel that I am over reacting or being overly dramatic.That&#39;&lt;WBR&gt;s&lt;BR&gt;=\r\nfine. My concern is not what you think of me but that youconsider the&lt;BR&gt;po=\r\nssibilities here. Many of which we do not know. Can yoube 100% sure&lt;BR&gt;that=\r\n this is a good idea or that it&#39;s worthy of saying&quot;well, we&#39;ll see&lt;BR&gt;what =\r\nhappens&quot;? --- In &lt;A href=3D&quot;mailto:EVP-ITC@yahoogroups.com&quot;&gt;EVP-ITC@yahoogr=\r\noups&lt;WBR&gt;.com&lt;/A&gt;, bruce&lt;BR&gt;halliday&lt;paranormal&lt;WBR&gt;investigating@&lt;WBR&gt;&=\r\ngt; wrote:&gt;&gt; Bill,&gt; &gt; You have the&lt;BR&gt;right idea, I recently ha=\r\nve dealt with a lot&gt; of negativity from my&lt;BR&gt;Frank&#39;s box. Harmony is ve=\r\nry important&gt; as is the right frame of mind&lt;BR&gt;before turning the box on=\r\n.&gt; &gt; hope you &amp; the family had a good&lt;BR&gt;holiday.&gt; &gt; Bruce&=\r\ngt; &gt; Bruce Halliday Paranormal Investigating Team &gt; &gt;&lt;BR&gt;&gt; To:=\r\n EVP-ITC@: vilhellm@: Fri, 23 Nov 2007 02:46:20+0000Subjec&lt;WBR&gt;t:&lt;BR&gt;[EVP-I=\r\nTC] Family hour around the radio&gt; &gt; &gt; &gt; &gt; Maybe we&#39;re just a=\r\n&lt;BR&gt;little unconventional in our household, but mostof us here are pretty&lt;B=\r\nR&gt;open to the idea of the multiverse. Gathering ina circle around our&lt;BR&gt;Fr=\r\nank&#39;s Box is our idea of quality family time.The messages are&lt;BR&gt;relevent, =\r\nthe interest is high, and we&#39;re very wellgrounded and do not&lt;BR&gt;let the tri=\r\ncksters push us around.HappyThanksg&lt;WBR&gt;iving from our home to&lt;BR&gt;yours. -B=\r\nill &gt; &gt; &gt; &gt; &gt; &gt; &gt;&lt;BR&gt;____________&lt;WBR&gt;_________&lt;WBR&gt;__=\r\n_______&lt;WBR&gt;_________&lt;WBR&gt;_________&lt;WBR&gt;_________&lt;WBR&gt;_&gt; Connect&lt;BR&gt;and =\r\nshare in new ways with Windows&lt;BR&gt;Live.&gt;&lt;A href=3D&quot;http://www.windowsliv=\r\ne.com/connect.html?ocid=3DTXT_TAGLM_Wave2_newways_112007&quot; target=3D_blank&gt;h=\r\nttp://www.windowsl&lt;WBR&gt;ive.com/connect.&lt;WBR&gt;html?ocid=3D&lt;WBR&gt;TXT_TAGLM_&lt;WBR=\r\n&gt;Wave2_newways_&lt;WBR&gt;112007&lt;/A&gt;&gt;&lt;BR&gt;&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;=\r\nBR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; ____________&lt;WBR&gt;_________&lt;WBR&gt;_________&lt;WBR&gt;____=\r\n_____&lt;WBR&gt;_________&lt;WBR&gt;_________&lt;WBR&gt;_&lt;BR&gt;&gt; Share life as it happens wi=\r\nth the new Windows Live.Download today&lt;BR&gt;it&#39;s FREE!&lt;BR&gt;&gt;&lt;BR&gt;&lt;A href=3D&quot;=\r\nhttp://www.windowslive.com/share.html?ocid=3DTXT_TAGLM_Wave2_sharelife_1120=\r\n07&quot; target=3D_blank&gt;http://www.windowsl&lt;WBR&gt;ive.com/share.&lt;WBR&gt;html?ocid=3D=\r\n&lt;WBR&gt;TXT_TAGLM_&lt;WBR&gt;Wave2_sharelife_&lt;WBR&gt;112007&lt;/A&gt;&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;&lt;/DI=\r\nV&gt;&lt;SPAN style=3D&quot;COLOR: white&quot;&gt;&lt;/SPAN&gt; \n&lt;STYLE&gt;\n.ExternalClass #EC_ygrp-mkp=\r\n\n{border:1px solid #d8d8d8;font-family:Arial;padding:0px 14px;}\n.ExternalCl=\r\nass #EC_ygrp-mkp hr\n{border:1px solid #d8d8d8;}\n.ExternalClass #EC_ygrp-mkp=\r\n #EC_hd\n{color:#628c2a;font-size:85%;font-weight:bold;line-height:122%;}\n.E=\r\nxternalClass #EC_ygrp-mkp #EC_ads\n{margin-bottom:10px;}\n.ExternalClass #EC_=\r\nygrp-mkp .EC_ad\n{padding:0 0;}\n.ExternalClass #EC_ygrp-mkp .EC_ad a\n{color:=\r\n#0000ff;text-decoration:none;}\n\n&lt;/STYLE&gt;\n\n&lt;STYLE&gt;\n.ExternalClass #EC_ygrp-s=\r\nponsor #EC_ygrp-lc\n{font-family:Arial;}\n.ExternalClass #EC_ygrp-sponsor #EC=\r\n_ygrp-lc #EC_hd\n{font-weight:bold;font-size:78%;line-height:122%;}\n.Externa=\r\nlClass #EC_ygrp-sponsor #EC_ygrp-lc .EC_ad\n{margin-bottom:10px;padding:0 0;=\r\n}\n\n&lt;/STYLE&gt;\n\n&lt;STYLE&gt;\n.ExternalClass #EC_ygrp-mlmsg\n{font-size:13px;font-fam=\r\nily:arial,helvetica,clean,sans-serif;}\n.ExternalClass #EC_ygrp-mlmsg table\n=\r\n{font-size:inherit;font:100%;}\n.ExternalClass #EC_ygrp-mlmsg select, .Exter=\r\nnalClass input, .ExternalClass textarea\n{font:99% arial,helvetica,clean,san=\r\ns-serif;}\n.ExternalClass #EC_ygrp-mlmsg pre, .ExternalClass code\n{font:115%=\r\n monospace;}\n.ExternalClass #EC_ygrp-mlmsg EC_*\n{line-height:1.22em;}\n.Exte=\r\nrnalClass #EC_ygrp-text\n{font-family:Georgia;}\n.ExternalClass #EC_ygrp-text=\r\n p\n{;}\n.ExternalClass #EC_ygrp-tpmsgs\n{font-family:Arial;clear:both;}\n.Exte=\r\nrnalClass #EC_ygrp-vitnav\n{padding-top:10px;font-family:Verdana;font-size:7=\r\n7%;}\n.ExternalClass #EC_ygrp-vitnav a\n{padding:0 1px;}\n.ExternalClass #EC_y=\r\ngrp-actbar\n{clear:both;white-space:nowrap;color:#666;text-align:right;}\n.Ex=\r\nternalClass #EC_ygrp-actbar .EC_left\n{float:left;white-space:nowrap;}\n.Exte=\r\nrnalClass .EC_bld\n{font-weight:bold;}\n.ExternalClass #EC_ygrp-grft\n{font-fa=\r\nmily:Verdana;font-size:77%;padding:15px 0;}\n.ExternalClass #EC_ygrp-ft\n{fon=\r\nt-family:verdana;font-size:77%;border-top:1px solid #666;padding:5px 0;}\n.E=\r\nxternalClass #EC_ygrp-mlmsg #EC_logo\n{padding-bottom:10px;}\n.ExternalClass =\r\n#EC_ygrp-vital\n{background-color:#e0ecee;margin-bottom:20px;padding:2px 0 8=\r\npx 8px;}\n.ExternalClass #EC_ygrp-vital #EC_vithd\n{font-size:77%;font-family=\r\n:Verdana;font-weight:bold;color:#333;text-transform:uppercase;}\n.ExternalCl=\r\nass #EC_ygrp-vital ul\n{padding:0;}\n.ExternalClass #EC_ygrp-vital ul li\n{lis=\r\nt-style-type:none;clear:both;border:1px solid #e0ecee;}\n.ExternalClass #EC_=\r\nygrp-vital ul li .EC_ct\n{font-weight:bold;color:#ff7900;float:right;width:2=\r\nem;text-align:right;padding-right:.5em;}\n.ExternalClass #EC_ygrp-vital ul l=\r\ni .EC_cat\n{font-weight:bold;}\n.ExternalClass #EC_ygrp-vital a\n{text-decorat=\r\nion:none;}\n.ExternalClass #EC_ygrp-vital a:hover\n{text-decoration:underline=\r\n;}\n.ExternalClass #EC_ygrp-sponsor #EC_hd\n{color:#999;font-size:77%;}\n.Exte=\r\nrnalClass #EC_ygrp-sponsor #EC_ov\n{padding:6px 13px;background-color:#e0ece=\r\ne;margin-bottom:20px;}\n.ExternalClass #EC_ygrp-sponsor #EC_ov ul\n{padding:0=\r\n 0 0 8px;}\n.ExternalClass #EC_ygrp-sponsor #EC_ov li\n{list-style-type:squar=\r\ne;padding:6px 0;font-size:77%;}\n.ExternalClass #EC_ygrp-sponsor #EC_ov li a=\r\n\n{text-decoration:none;font-size:130%;}\n.ExternalClass #EC_ygrp-sponsor #EC=\r\n_nc\n{background-color:#eee;margin-bottom:20px;padding:0 8px;}\n.ExternalClas=\r\ns #EC_ygrp-sponsor .EC_ad\n{padding:8px 0;}\n.ExternalClass #EC_ygrp-sponsor =\r\n.EC_ad #EC_hd1\n{font-family:Arial;font-weight:bold;color:#628c2a;font-size:=\r\n100%;line-height:122%;}\n.ExternalClass #EC_ygrp-sponsor .EC_ad a\n{text-deco=\r\nration:none;}\n.ExternalClass #EC_ygrp-sponsor .EC_ad a:hover\n{text-decorati=\r\non:underline;}\n.ExternalClass #EC_ygrp-sponsor .EC_ad p\n{;}\n.ExternalClass =\r\nEC_o\n{font-size:0;}\n.ExternalClass .EC_MsoNormal\n{;}\n.ExternalClass #EC_ygr=\r\np-text tt\n{font-size:120%;}\n.ExternalClass blockquote\n{;}\n.ExternalClass .E=\r\nC_replbq\n{;}\n\n&lt;/STYLE&gt;\n&lt;/BLOCKQUOTE&gt;&lt;br /&gt;&lt;hr /&gt;Connect and share in new wa=\r\nys with Windows Live. &lt;a href=3D&#39;http://www.windowslive.com/connect.html?oc=\r\nid=3DTXT_TAGLM_Wave2_newways_112007&#39; target=3D&#39;_new&#39;&gt;Connect now!&lt;/a&gt;&lt;/body=\r\n&gt;\n&lt;/html&gt;\r\n--_e1d32c1d-4f49-4e17-98cb-5f19c3e0d3c8_--"}