{"id": "3192", "subject": "RE: [EVP-ITC] Re: Family hour around the radio", "author": "Frank Sumption", "timestamp": "2007-11-24T05:21:06Z", "full_text": "--_05534320-2c01-478b-870a-3475c0f65120_\r\nContent-Type: text/plain; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n\n The only do I know is remember to laugh when &quot;they&quot; say something funny! =\r\nI&#39;m being serious!\n \n Frank-S\n\n\nTo: evp-itc@yahoogroups.comFrom: paranormal=\r\ninvestigating@...: Fri, 23 Nov 2007 17:38:10 -0500Subject: RE: =\r\n[EVP-ITC] Re: Family hour around the radio\n\n\n\n\nBabs, I am thinking of conta=\r\ncting ron the maker of the mini box and offer to put a page on my box websi=\r\nte explaining the do&#39;s and don&#39;ts of box research and the dangers involved =\r\nand also the resposibility involed in box ownership and research. And I&#39;m h=\r\noping that will help some of the people who are going in blind and buying a=\r\n mini box will understand what the basics are. hopefully they can put a lin=\r\nk on their mini box sale page. Bruce\n\nBruce Halliday Paranormal Investigati=\r\nng Team \n\n\nTo: EVP-ITC@yahoogroups.comFrom: babiarz3@...: Fri, 23=\r\n Nov 2007 22:13:56 +0000Subject: [EVP-ITC] Re: Family hour around the radio=\r\n\n\n\nHi Bruce~I understand the light heartedness of the &quot;family hour&quot; posts. =\r\nI don&#39;ttake any issue with that at all. The families of those of us involve=\r\ndin the paranormal HAVE to be a bit different then the average Joe&#39;s orSmit=\r\nh&#39;s. I only referred to that topic because of the other stuffmentioned- neg=\r\nativity and dark ones.There is absolutely nothing in place to safe guard wh=\r\no purchases thebox and who doesn&#39;t besides the cost. If you&#39;ve got the mone=\r\ny or acredit card, the box is yours- whoever &quot;you&quot; are.I don&#39;t think we sho=\r\nuld presume anything about the purchasers of thebox. I know people in the f=\r\niled who have never experienced anythingevil or dark and wouldn&#39;t know what=\r\n to do if they did. Admittedly,they can be and will be deceitful. I am in f=\r\null support of further research and groups and individualsworking together.=\r\n However, IMHO, I think this falls into a differentcategory. Morally and et=\r\nhically, I think it is short sighted toapprove of or promote in any way, th=\r\ne distribution of this device atthis time. When we imagine the possibilitie=\r\ns, we need to imagine them all.Babs --- In EVP-ITC@yahoogroups.com, bruce h=\r\nalliday&lt;paranormalinvestigating@...&gt; wrote:&gt;&gt; babiarz3,&gt; &gt; I believe the po=\r\nsts you are referring to about family hour with the box&gt; where written in a=\r\n light manner in jest. I do not presume to speakfor anyone &gt; else on this g=\r\nroup I&#39;m sure they can speak for themselves.&gt; &gt; you speak of responsibility=\r\n with any form of open communication, Ibelieve the individuals that are&gt; st=\r\nudying and distributing the mini box are sufficiently experiencedand know w=\r\nho they should sell to and who not.&gt; &gt; I don&#39;t believe they mean to put the=\r\n mini box on the shelves in toysr us. Anyone that uses a box whether it be =\r\na Frank&#39;s box&gt; A Joe&#39;s box or a mini box will probably have done some resea=\r\nrch intothis method of evp and will probably have some intimate experience&gt;=\r\n with the paranormal field and if not I&#39;m sure they will seek advicefrom th=\r\nose of us that have that experience. There is never a lack ofadvice here.&gt; =\r\n&gt; as far as dark heads go I know through personal experience that theycan b=\r\ne deceiving and manipulative with someone that does not know anybetter&gt; I h=\r\nave a Frank&#39;s box and a Joe&#39;s box and do serious research on adaily basis. =\r\nMy opinion is the good spirits out weigh the negativeones and anyone&gt; that =\r\nexperiments with a box will tell you that you do forge strongbonds with wha=\r\nt I call my spirit guides or technicians, the same twospirits communicate &gt;=\r\n with me during every session and protect me from negativity. As longas I d=\r\no not feed the darkies with my own negativity I am fine.&gt; &gt; Also I believe =\r\nthat the people who are distributing the mini boxhave set that price to det=\r\ner any average person that&#39;s completelyignorant of the paranormal&gt; away fro=\r\nm purchasing this device.&gt; &gt; I have never met bill personally but know of h=\r\nim, he is a wellrespected researcher and is well aware I think of the pitfa=\r\nlls as wellas the rewards of box communication.&gt; and I don&#39;t believe he wou=\r\nld ever endanger himself, his family oranyone else by carelessly using the =\r\nbox for entertainment purposes.&gt; &gt; that Is my opinion for what it&#39;s worth.&gt;=\r\n &gt; Bruce&gt; &gt; &gt; Bruce Halliday Paranormal Investigating Team &gt; &gt; &gt; To: EVP-IT=\r\nC@...: babiarz3@...: Fri, 23 Nov 2007 19:58:45+0000Subject: [EVP-ITC] Re: F=\r\namily hour around the radio&gt; &gt; &gt; &gt; &gt; I am a fairly quiet person, most of th=\r\ne time. I have my thoughtsandopinions on topics but feel strongly about &quot;to=\r\n each his own&quot;.Unlesssomething strikes me as completely wrong, I won&#39;t deba=\r\nte. No oneherehas heard from me other than recently with this mini-box yet,=\r\n Iamhere several times weekly reading and offering my energy in supportofth=\r\ne research.However...something is striking me here and again, Ican&#39;t keep m=\r\nymouth shut. The discussion about the family hour with thebox has ledthe wa=\r\ny for people to mention negativity and even &quot;the darkguys&quot; canbe fun if not=\r\n taken seriously.I ask you to consider the factthat many who purchase the m=\r\nini-boxwill not be of the right frame ofmind. Most will not be in harmony.M=\r\nany will take &quot;the dark guys&quot;seriously. Yet, you feel it&#39;s a goodidea to le=\r\nt anyone who wants a boxhave one? All in the name ofsharing technology.I kn=\r\now that my previousposts expressing my concern over the massmarketing of th=\r\ne box, wasbarely given consideration. Realize that Iam not being selfish- I=\r\n donot own a box. EVP is my passion and hasbeen from day one 6 years agowhe=\r\nn I jumped fully into the field. I amsuccessful in capturing EVP,always hav=\r\ne been. I still do it the &quot;oldfashioned way&quot; with open airtechniques. Would=\r\n I love to be able tohold real time 2 waycommunications with the other side=\r\n? Of course.However, I do not thinkenough research into the possibilities h=\r\nasbeen done to warrant theapproval let alone production of these boxes. Tho=\r\nse of us who havebeen on countless investigations with many peoplewill quic=\r\nkly admitthat there are some people we&#39;d rather notinvestigate with. When t=\r\nheyare present, negative things tend tohappen. We all know one or twopeople=\r\n who we can say &quot;felt dark&quot; fromthe first meeting. We all admitthat being m=\r\nentally sound is animportant quality in this field. If youhave mental issue=\r\ns, this maynot be the area of research for you. Wedon&#39;t bring children onin=\r\nvestigations for obvious reasons. BUT! If youwant a box that couldpossibly =\r\nopen up a portal and bridge the gapbetween here and thedark, sure! Anyone w=\r\nho wants one should have it!You might feel that I am over reacting or being=\r\n overly dramatic.That&#39;sfine. My concern is not what you think of me but tha=\r\nt youconsider thepossibilities here. Many of which we do not know. Can youb=\r\ne 100% surethat this is a good idea or that it&#39;s worthy of saying&quot;well, we&#39;=\r\nll seewhat happens&quot;? --- In EVP-ITC@yahoogroups.com, brucehalliday&lt;paranorm=\r\nalinvestigating@&gt; wrote:&gt;&gt; Bill,&gt; &gt; You have theright idea, I recently have=\r\n dealt with a lot&gt; of negativity from myFrank&#39;s box. Harmony is very import=\r\nant&gt; as is the right frame of mindbefore turning the box on.&gt; &gt; hope you & =\r\nthe family had a goodholiday.&gt; &gt; Bruce&gt; &gt; Bruce Halliday Paranormal Investi=\r\ngating Team &gt; &gt;&gt; To: EVP-ITC@: vilhellm@: Fri, 23 Nov 2007 02:46:20+0000Sub=\r\nject:[EVP-ITC] Family hour around the radio&gt; &gt; &gt; &gt; &gt; Maybe we&#39;re just alitt=\r\nle unconventional in our household, but mostof us here are prettyopen to th=\r\ne idea of the multiverse. Gathering ina circle around ourFrank&#39;s Box is our=\r\n idea of quality family time.The messages arerelevent, the interest is high=\r\n, and we&#39;re very wellgrounded and do notlet the tricksters push us around.H=\r\nappyThanksgiving from our home toyours. -Bill &gt; &gt; &gt; &gt; &gt; &gt; &gt;________________=\r\n__________________________________________&gt; Connectand share in new ways wi=\r\nth WindowsLive.&gt;http://www.windowslive.com/connect.html?ocid=3DTXT_TAGLM_Wa=\r\nve2_newways_112007&gt;&gt; &gt; &gt; &gt; &gt; &gt; &gt; __________________________________________=\r\n________________&gt; Share life as it happens with the new Windows Live.Downlo=\r\nad todayit&#39;s FREE!&gt;http://www.windowslive.com/share.html?ocid=3DTXT_TAGLM_W=\r\nave2_sharelife_112007&gt;\n\nShare life as it happens with the new Windows Live.=\r\n Share now! \n \n\n\n\n\n\n\n______________________________________________________=\r\n___________\nConnect and share in new ways with Windows Live.\nhttp://www.win=\r\ndowslive.com/connect.html?ocid=3DTXT_TAGLM_Wave2_newways_112007\r\n--_05534320-2c01-478b-870a-3475c0f65120_\r\nContent-Type: text/html; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;\n&lt;head&gt;\n&lt;style&gt;\n.hmmessage P\n{\nmargin:0px;\npadding:0px\n}\nbody.hmmessa=\r\nge\n{\nFONT-SIZE: 10pt;\nFONT-FAMILY:Tahoma\n}\n&lt;/style&gt;\n&lt;/head&gt;\n&lt;body class=3D&#39;=\r\nhmmessage&#39;&gt;\n&lt;BR&gt;&nbsp;The only do I know is remember to laugh when &quot;they&quot; s=\r\nay something funny! I&#39;m being serious!&lt;BR&gt;\n&nbsp;&lt;BR&gt;\n&nbsp;Frank-S&lt;BR&gt;&lt;BR&gt;=\r\n\n&lt;BLOCKQUOTE&gt;\n&lt;HR&gt;\nTo: evp-itc@yahoogroups.com&lt;BR&gt;From: paranormalinvestiga=\r\nting@...&lt;BR&gt;Date: Fri, 23 Nov 2007 17:38:10 -0500&lt;BR&gt;Subject: RE: [=\r\nEVP-ITC] Re: Family hour around the radio&lt;BR&gt;&lt;BR&gt;\n&lt;META content=3D&quot;Microsof=\r\nt SafeHTML&quot; name=3DGenerator&gt;\n&lt;DIV id=3DEC_ygrp-mlmsg style=3D&quot;WIDTH: 655px=\r\n&quot;&gt;\n&lt;DIV id=3DEC_ygrp-msg style=3D&quot;PADDING-RIGHT: 15px; PADDING-LEFT: 0px; Z=\r\n-INDEX: 1; FLOAT: left; PADDING-BOTTOM: 0px; WIDTH: 490px; PADDING-TOP: 0px=\r\n&quot;&gt;\n&lt;DIV id=3DEC_ygrp-text&gt;\nBabs,&lt;BR&gt;&nbsp;&lt;BR&gt;I am thinking of contacting r=\r\non the maker of the mini box and offer &lt;BR&gt;to put a page on my box website =\r\nexplaining the do&#39;s and don&#39;ts of box research and the dangers involved and=\r\n also the resposibility involed in box &lt;BR&gt;ownership and research. And I&#39;m =\r\nhoping that will help some of the people who are going in blind and buying =\r\na mini box will understand what the basics are.&lt;BR&gt;&nbsp;&lt;BR&gt;hopefully they=\r\n can put a link on their mini box sale page.&lt;BR&gt;&nbsp;&lt;BR&gt;Bruce&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;=\r\n\n&lt;DIV&gt;\n&lt;P align=3Dcenter&gt;&lt;FONT size=3D4&gt;&lt;FONT color=3D#0033cc&gt;&lt;STRONG&gt;&lt;EM&gt;&lt;=\r\nFONT color=3D#000000 size=3D5&gt;Bruce Halliday &lt;BR&gt;&lt;/FONT&gt;&lt;/EM&gt;&lt;FONT color=3D=\r\n#000000&gt;Paranormal Investigating Team &lt;/FONT&gt;&lt;/STRONG&gt;&lt;BR&gt;&lt;A href=3D&quot;http:/=\r\n/free-paranormalinvestigating.com/&lt;/div&gt;&lt;/div&gt;&lt;p%20/&gt;&lt;div%20class=3D&quot; targe=\r\nt=3D_blank&gt;&lt;BR&gt;&lt;/FONT&gt;&lt;/FONT&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;BLOCKQUOTE&gt;\n&lt;HR id=3DEC_EC_sto=\r\npSpelling&gt;\nTo: EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;BR&gt;From: babiarz3@yahoo.&lt;WBR&gt;co=\r\nm&lt;BR&gt;Date: Fri, 23 Nov 2007 22:13:56 +0000&lt;BR&gt;Subject: [EVP-ITC] Re: Family=\r\n hour around the radio&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3DEC_EC_ygrp-mlmsg&gt;\n&lt;DIV id=3DEC_EC_=\r\nygrp-msg&gt;\n&lt;DIV id=3DEC_EC_ygrp-text&gt;&lt;BR&gt;Hi Bruce~&lt;BR&gt;&lt;BR&gt;I understand the l=\r\night heartedness of the &quot;family hour&quot; posts. I don&#39;t&lt;BR&gt;take any issue with=\r\n that at all. The families of those of us involved&lt;BR&gt;in the paranormal HAV=\r\nE to be a bit different then the average Joe&#39;s or&lt;BR&gt;Smith&#39;s. I only referr=\r\ned to that topic because of the other stuff&lt;BR&gt;mentioned- negativity and da=\r\nrk ones.&lt;BR&gt;&lt;BR&gt;There is absolutely nothing in place to safe guard who purc=\r\nhases the&lt;BR&gt;box and who doesn&#39;t besides the cost. If you&#39;ve got the money =\r\nor a&lt;BR&gt;credit card, the box is yours- whoever &quot;you&quot; are.&lt;BR&gt;&lt;BR&gt;I don&#39;t th=\r\nink we should presume anything about the purchasers of the&lt;BR&gt;box. I know p=\r\neople in the filed who have never experienced anything&lt;BR&gt;evil or dark and =\r\nwouldn&#39;t know what to do if they did. Admittedly,&lt;BR&gt;they can be and will b=\r\ne deceitful. &lt;BR&gt;&lt;BR&gt;I am in full support of further research and groups an=\r\nd individuals&lt;BR&gt;working together. However, IMHO, I think this falls into a=\r\n different&lt;BR&gt;category. Morally and ethically, I think it is short sighted =\r\nto&lt;BR&gt;approve of or promote in any way, the distribution of this device at&lt;=\r\nBR&gt;this time. &lt;BR&gt;&lt;BR&gt;When we imagine the possibilities, we need to imagine=\r\n them all.&lt;BR&gt;&lt;BR&gt;Babs &lt;BR&gt;--- In &lt;A href=3D&quot;mailto:EVP-ITC@yahoogroups.com=\r\n&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;, bruce halliday&lt;BR&gt;&lt;paranormalinvesti=\r\ng&lt;WBR&gt;ating@...&lt;WBR&gt;&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; babiarz3,&lt;BR&gt;&gt; &lt;BR&gt;&gt; =\r\nI believe the posts you are referring to about family hour with the box&lt;BR&gt;=\r\n&gt; where written in a light manner in jest. I do not presume to speak&lt;BR&gt;=\r\nfor anyone &lt;BR&gt;&gt; else on this group I&#39;m sure they can speak for themselv=\r\nes.&lt;BR&gt;&gt; &lt;BR&gt;&gt; you speak of responsibility with any form of open comm=\r\nunication, I&lt;BR&gt;believe the individuals that are&lt;BR&gt;&gt; studying and distr=\r\nibuting the mini box are sufficiently experienced&lt;BR&gt;and know who they shou=\r\nld sell to and who not.&lt;BR&gt;&gt; &lt;BR&gt;&gt; I don&#39;t believe they mean to put t=\r\nhe mini box on the shelves in toys&lt;BR&gt;r us. Anyone that uses a box whether =\r\nit be a Frank&#39;s box&lt;BR&gt;&gt; A Joe&#39;s box or a mini box will probably have do=\r\nne some research into&lt;BR&gt;this method of evp and will probably have some int=\r\nimate experience&lt;BR&gt;&gt; with the paranormal field and if not I&#39;m sure they=\r\n will seek advice&lt;BR&gt;from those of us that have that experience. There is n=\r\never a lack of&lt;BR&gt;advice here.&lt;BR&gt;&gt; &lt;BR&gt;&gt; as far as dark heads go I k=\r\nnow through personal experience that they&lt;BR&gt;can be deceiving and manipulat=\r\nive with someone that does not know any&lt;BR&gt;better&lt;BR&gt;&gt; I have a Frank&#39;s =\r\nbox and a Joe&#39;s box and do serious research on a&lt;BR&gt;daily basis. My opinion=\r\n is the good spirits out weigh the negative&lt;BR&gt;ones and anyone&lt;BR&gt;&gt; that=\r\n experiments with a box will tell you that you do forge strong&lt;BR&gt;bonds wit=\r\nh what I call my spirit guides or technicians, the same two&lt;BR&gt;spirits comm=\r\nunicate &lt;BR&gt;&gt; with me during every session and protect me from negativit=\r\ny. As long&lt;BR&gt;as I do not feed the darkies with my own negativity I am fine=\r\n.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Also I believe that the people who are distributing the =\r\nmini box&lt;BR&gt;have set that price to deter any average person that&#39;s complete=\r\nly&lt;BR&gt;ignorant of the paranormal&lt;BR&gt;&gt; away from purchasing this device.&lt;=\r\nBR&gt;&gt; &lt;BR&gt;&gt; I have never met bill personally but know of him, he is a =\r\nwell&lt;BR&gt;respected researcher and is well aware I think of the pitfalls as w=\r\nell&lt;BR&gt;as the rewards of box communication.&lt;BR&gt;&gt; and I don&#39;t believe he =\r\nwould ever endanger himself, his family or&lt;BR&gt;anyone else by carelessly usi=\r\nng the box for entertainment purposes.&lt;BR&gt;&gt; &lt;BR&gt;&gt; that Is my opinion =\r\nfor what it&#39;s worth.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Bruce&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; Bruce=\r\n Halliday Paranormal Investigating Team &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; To: EVP-=\r\nITC@...: babiarz3@...&lt;WBR&gt;: Fri, 23 Nov 2007 19:58:45&lt;BR&gt;+0000Subject: [EVP=\r\n-ITC] Re: Family hour around the radio&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;=\r\nBR&gt;&gt; I am a fairly quiet person, most of the time. I have my thoughts&lt;BR=\r\n&gt;andopinions on topics but feel strongly about &quot;to each his own&quot;.&lt;BR&gt;Unless=\r\nsomething strikes me as completely wrong, I won&#39;t debate. No one&lt;BR&gt;herehas=\r\n heard from me other than recently with this mini-box yet, I&lt;BR&gt;amhere seve=\r\nral times weekly reading and offering my energy in support&lt;BR&gt;ofthe researc=\r\nh.However.&lt;WBR&gt;..something is striking me here and again, I&lt;BR&gt;can&#39;t keep m=\r\nymouth shut. The discussion about the family hour with the&lt;BR&gt;box has ledth=\r\ne way for people to mention negativity and even &quot;the dark&lt;BR&gt;guys&quot; canbe fu=\r\nn if not taken seriously.I ask you to consider the fact&lt;BR&gt;that many who pu=\r\nrchase the mini-boxwill not be of the right frame of&lt;BR&gt;mind. Most will not=\r\n be in harmony.Many will take &quot;the dark guys&quot;&lt;BR&gt;seriously. Yet, you feel i=\r\nt&#39;s a goodidea to let anyone who wants a box&lt;BR&gt;have one? All in the name o=\r\nfsharing technology.I know that my previous&lt;BR&gt;posts expressing my concern =\r\nover the massmarketing of the box, was&lt;BR&gt;barely given consideration. Reali=\r\nze that Iam not being selfish- I do&lt;BR&gt;not own a box. EVP is my passion and=\r\n hasbeen from day one 6 years ago&lt;BR&gt;when I jumped fully into the field. I =\r\namsuccessful in capturing EVP,&lt;BR&gt;always have been. I still do it the &quot;oldf=\r\nashioned way&quot; with open air&lt;BR&gt;techniques. Would I love to be able tohold r=\r\neal time 2 way&lt;BR&gt;communications with the other side? Of course.However, I =\r\ndo not think&lt;BR&gt;enough research into the possibilities hasbeen done to warr=\r\nant the&lt;BR&gt;approval let alone production of these boxes. Those of us who ha=\r\nve&lt;BR&gt;been on countless investigations with many peoplewill quickly admit&lt;B=\r\nR&gt;that there are some people we&#39;d rather notinvestigate with. When they&lt;BR&gt;=\r\nare present, negative things tend tohappen. We all know one or two&lt;BR&gt;peopl=\r\ne who we can say &quot;felt dark&quot; fromthe first meeting. We all admit&lt;BR&gt;that be=\r\ning mentally sound is animportant quality in this field. If you&lt;BR&gt;have men=\r\ntal issues, this maynot be the area of research for you. We&lt;BR&gt;don&#39;t bring =\r\nchildren oninvestigations for obvious reasons. BUT! If you&lt;BR&gt;want a box th=\r\nat couldpossibly open up a portal and bridge the gap&lt;BR&gt;between here and th=\r\nedark, sure! Anyone who wants one should have it!&lt;BR&gt;You might feel that I =\r\nam over reacting or being overly dramatic.That&#39;&lt;WBR&gt;s&lt;BR&gt;fine. My concern i=\r\ns not what you think of me but that youconsider the&lt;BR&gt;possibilities here. =\r\nMany of which we do not know. Can yoube 100% sure&lt;BR&gt;that this is a good id=\r\nea or that it&#39;s worthy of saying&quot;well, we&#39;ll see&lt;BR&gt;what happens&quot;? --- In &lt;=\r\nA href=3D&quot;mailto:EVP-ITC@yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;,=\r\n bruce&lt;BR&gt;halliday&lt;paranormal&lt;WBR&gt;investigating@&lt;WBR&gt;&gt; wrote:&gt;&gt;=\r\n Bill,&gt; &gt; You have the&lt;BR&gt;right idea, I recently have dealt with a lo=\r\nt&gt; of negativity from my&lt;BR&gt;Frank&#39;s box. Harmony is very important&gt; a=\r\ns is the right frame of mind&lt;BR&gt;before turning the box on.&gt; &gt; hope yo=\r\nu &amp; the family had a good&lt;BR&gt;holiday.&gt; &gt; Bruce&gt; &gt; Bruce Hal=\r\nliday Paranormal Investigating Team &gt; &gt;&lt;BR&gt;&gt; To: EVP-ITC@: vilhell=\r\nm@: Fri, 23 Nov 2007 02:46:20+0000Subjec&lt;WBR&gt;t:&lt;BR&gt;[EVP-ITC] Family hour ar=\r\nound the radio&gt; &gt; &gt; &gt; &gt; Maybe we&#39;re just a&lt;BR&gt;little unconve=\r\nntional in our household, but mostof us here are pretty&lt;BR&gt;open to the idea=\r\n of the multiverse. Gathering ina circle around our&lt;BR&gt;Frank&#39;s Box is our i=\r\ndea of quality family time.The messages are&lt;BR&gt;relevent, the interest is hi=\r\ngh, and we&#39;re very wellgrounded and do not&lt;BR&gt;let the tricksters push us ar=\r\nound.HappyThanksg&lt;WBR&gt;iving from our home to&lt;BR&gt;yours. -Bill &gt; &gt; &gt;=\r\n &gt; &gt; &gt; &gt;&lt;BR&gt;____________&lt;WBR&gt;_________&lt;WBR&gt;_________&lt;WBR&gt;______=\r\n___&lt;WBR&gt;_________&lt;WBR&gt;_________&lt;WBR&gt;_&gt; Connect&lt;BR&gt;and share in new ways =\r\nwith Windows&lt;BR&gt;Live.&gt;&lt;A href=3D&quot;http://www.windowslive.com/connect.html=\r\n?ocid=3DTXT_TAGLM_Wave2_newways_112007&quot; target=3D_blank&gt;http://www.windowsl=\r\n&lt;WBR&gt;ive.com/connect.&lt;WBR&gt;html?ocid=3D&lt;WBR&gt;TXT_TAGLM_&lt;WBR&gt;Wave2_newways_&lt;WB=\r\nR&gt;112007&lt;/A&gt;&gt;&lt;BR&gt;&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;=\r\nBR&gt;&gt; ____________&lt;WBR&gt;_________&lt;WBR&gt;_________&lt;WBR&gt;_________&lt;WBR&gt;________=\r\n_&lt;WBR&gt;_________&lt;WBR&gt;_&lt;BR&gt;&gt; Share life as it happens with the new Windows=\r\n Live.Download today&lt;BR&gt;it&#39;s FREE!&lt;BR&gt;&gt;&lt;BR&gt;&lt;A href=3D&quot;http://www.windows=\r\nlive.com/share.html?ocid=3DTXT_TAGLM_Wave2_sharelife_112007&quot; target=3D_blan=\r\nk&gt;http://www.windowsl&lt;WBR&gt;ive.com/share.&lt;WBR&gt;html?ocid=3D&lt;WBR&gt;TXT_TAGLM_&lt;WB=\r\nR&gt;Wave2_sharelife_&lt;WBR&gt;112007&lt;/A&gt;&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;SPAN style=3D&quot;C=\r\nOLOR: white&quot;&gt;&lt;/SPAN&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;\n&lt;HR&gt;\nShare life as it hap=\r\npens with the new Windows Live. &lt;A href=3D&quot;http://www.windowslive.com/share=\r\n.html?ocid=3DTXT_TAGLM_Wave2_sharelife_112007&quot; target=3D_blank&gt;Share now!&lt;/=\r\nA&gt; \n&lt;BR&gt;&lt;/DIV&gt;&lt;SPAN style=3D&quot;COLOR: white&quot;&gt;&lt;/SPAN&gt; \n&lt;STYLE&gt;\n.ExternalClass =\r\n#EC_ygrp-mkp\n{border:1px solid #d8d8d8;font-family:Arial;padding:0px 14px;}=\r\n\n.ExternalClass #EC_ygrp-mkp hr\n{border:1px solid #d8d8d8;}\n.ExternalClass =\r\n#EC_ygrp-mkp #EC_hd\n{color:#628c2a;font-size:85%;font-weight:bold;line-heig=\r\nht:122%;}\n.ExternalClass #EC_ygrp-mkp #EC_ads\n{margin-bottom:10px;}\n.Extern=\r\nalClass #EC_ygrp-mkp .EC_ad\n{padding:0 0;}\n.ExternalClass #EC_ygrp-mkp .EC_=\r\nad a\n{color:#0000ff;text-decoration:none;}\n\n&lt;/STYLE&gt;\n\n&lt;STYLE&gt;\n.ExternalClas=\r\ns #EC_ygrp-sponsor #EC_ygrp-lc\n{font-family:Arial;}\n.ExternalClass #EC_ygrp=\r\n-sponsor #EC_ygrp-lc #EC_hd\n{font-weight:bold;font-size:78%;line-height:122=\r\n%;}\n.ExternalClass #EC_ygrp-sponsor #EC_ygrp-lc .EC_ad\n{margin-bottom:10px;=\r\npadding:0 0;}\n\n&lt;/STYLE&gt;\n\n&lt;STYLE&gt;\n.ExternalClass #EC_ygrp-mlmsg\n{font-size:1=\r\n3px;font-family:arial,helvetica,clean,sans-serif;}\n.ExternalClass #EC_ygrp-=\r\nmlmsg table\n{font-size:inherit;font:100%;}\n.ExternalClass #EC_ygrp-mlmsg se=\r\nlect, .ExternalClass input, .ExternalClass textarea\n{font:99% arial,helveti=\r\nca,clean,sans-serif;}\n.ExternalClass #EC_ygrp-mlmsg pre, .ExternalClass cod=\r\ne\n{font:115% monospace;}\n.ExternalClass #EC_ygrp-mlmsg EC_*\n{line-height:1.=\r\n22em;}\n.ExternalClass #EC_ygrp-text\n{font-family:Georgia;}\n.ExternalClass #=\r\nEC_ygrp-text p\n{;}\n.ExternalClass #EC_ygrp-tpmsgs\n{font-family:Arial;clear:=\r\nboth;}\n.ExternalClass #EC_ygrp-vitnav\n{padding-top:10px;font-family:Verdana=\r\n;font-size:77%;}\n.ExternalClass #EC_ygrp-vitnav a\n{padding:0 1px;}\n.Externa=\r\nlClass #EC_ygrp-actbar\n{clear:both;white-space:nowrap;color:#666;text-align=\r\n:right;}\n.ExternalClass #EC_ygrp-actbar .EC_left\n{float:left;white-space:no=\r\nwrap;}\n.ExternalClass .EC_bld\n{font-weight:bold;}\n.ExternalClass #EC_ygrp-g=\r\nrft\n{font-family:Verdana;font-size:77%;padding:15px 0;}\n.ExternalClass #EC_=\r\nygrp-ft\n{font-family:verdana;font-size:77%;border-top:1px solid #666;paddin=\r\ng:5px 0;}\n.ExternalClass #EC_ygrp-mlmsg #EC_logo\n{padding-bottom:10px;}\n.Ex=\r\nternalClass #EC_ygrp-vital\n{background-color:#e0ecee;margin-bottom:20px;pad=\r\nding:2px 0 8px 8px;}\n.ExternalClass #EC_ygrp-vital #EC_vithd\n{font-size:77%=\r\n;font-family:Verdana;font-weight:bold;color:#333;text-transform:uppercase;}=\r\n\n.ExternalClass #EC_ygrp-vital ul\n{padding:0;}\n.ExternalClass #EC_ygrp-vita=\r\nl ul li\n{list-style-type:none;clear:both;border:1px solid #e0ecee;}\n.Extern=\r\nalClass #EC_ygrp-vital ul li .EC_ct\n{font-weight:bold;color:#ff7900;float:r=\r\night;width:2em;text-align:right;padding-right:.5em;}\n.ExternalClass #EC_ygr=\r\np-vital ul li .EC_cat\n{font-weight:bold;}\n.ExternalClass #EC_ygrp-vital a\n{=\r\ntext-decoration:none;}\n.ExternalClass #EC_ygrp-vital a:hover\n{text-decorati=\r\non:underline;}\n.ExternalClass #EC_ygrp-sponsor #EC_hd\n{color:#999;font-size=\r\n:77%;}\n.ExternalClass #EC_ygrp-sponsor #EC_ov\n{padding:6px 13px;background-=\r\ncolor:#e0ecee;margin-bottom:20px;}\n.ExternalClass #EC_ygrp-sponsor #EC_ov u=\r\nl\n{padding:0 0 0 8px;}\n.ExternalClass #EC_ygrp-sponsor #EC_ov li\n{list-styl=\r\ne-type:square;padding:6px 0;font-size:77%;}\n.ExternalClass #EC_ygrp-sponsor=\r\n #EC_ov li a\n{text-decoration:none;font-size:130%;}\n.ExternalClass #EC_ygrp=\r\n-sponsor #EC_nc\n{background-color:#eee;margin-bottom:20px;padding:0 8px;}\n.=\r\nExternalClass #EC_ygrp-sponsor .EC_ad\n{padding:8px 0;}\n.ExternalClass #EC_y=\r\ngrp-sponsor .EC_ad #EC_hd1\n{font-family:Arial;font-weight:bold;color:#628c2=\r\na;font-size:100%;line-height:122%;}\n.ExternalClass #EC_ygrp-sponsor .EC_ad =\r\na\n{text-decoration:none;}\n.ExternalClass #EC_ygrp-sponsor .EC_ad a:hover\n{t=\r\next-decoration:underline;}\n.ExternalClass #EC_ygrp-sponsor .EC_ad p\n{;}\n.Ex=\r\nternalClass EC_o\n{font-size:0;}\n.ExternalClass .EC_MsoNormal\n{;}\n.ExternalC=\r\nlass #EC_ygrp-text tt\n{font-size:120%;}\n.ExternalClass blockquote\n{;}\n.Exte=\r\nrnalClass .EC_replbq\n{;}\n\n&lt;/STYLE&gt;\n&lt;/BLOCKQUOTE&gt;&lt;br /&gt;&lt;hr /&gt;Connect and sha=\r\nre in new ways with Windows Live. &lt;a href=3D&#39;http://www.windowslive.com/con=\r\nnect.html?ocid=3DTXT_TAGLM_Wave2_newways_112007&#39; target=3D&#39;_new&#39;&gt;Connect no=\r\nw!&lt;/a&gt;&lt;/body&gt;\n&lt;/html&gt;\r\n--_05534320-2c01-478b-870a-3475c0f65120_--"}