{"id": "3198", "subject": "Re: [EVP-ITC] New here", "author": "Lisby", "timestamp": "2007-11-24T15:56:38Z", "full_text": "Welcome to the Mad House, Lee!\n\nAnn\n\nOn Nov 24, 2007, at 6:07 AM, pulsetalkradio wrote:\n\n&gt; Hello everyone, I thought I would introduce myself, my name is Lee\n&gt; and I own and host Pulse Talk Radio this is a show that is partly\n&gt; entertainment and partly informative.\n&gt;\n&gt; Just lately we have been covering &quot;the Box&quot; mainly Joes box but\n&gt; always with reference to Franks, I have always been fascinated by\n&gt; EVP and progressive paranormal research equipment so I caught on to\n&gt; this subject rather quickly and it now has captured my imagination.\n&gt;\n&gt; I&#39;m not electronically minded but know what a capacitor and Micro\n&gt; chip look like and I&#39;m very good with theory&#39;s and hope I can help\n&gt; with input into this amazing piece of equipment/subject, you may ask\n&gt; why should he be amazed by something he has only heard of and does\n&gt; not own, well I have been on a live box session over Skype and this\n&gt; box clearly said Hello Lee in response to a direct question, now to\n&gt; a open minded sceptic like myself this was a revelation and now I&#39;m\n&gt; hooked on the whole concept, not to say I&#39;m a believer but very much\n&gt; in to researching the idea further\n&gt;\n&gt; I would also like to say great job on Frank&#39;s part for inventing the\n&gt; box, when you get to know me you will see what a mile stone it is to\n&gt; get me to sit up and take note such is my scepticism on the whole\n&gt; paranormal subject. I respect those that strive to make new\n&gt; equipment for us the paranormal investigation world, keep up the\n&gt; good work I will be watching closely for up dates and try and pitch\n&gt; my ten cents in when I thinks it&#39;s warranted\n&gt;\n&gt;\n&gt; \n\n\nWelcome o he Mad House, Lee!AnnOn No 24, 2007, a 6:07 AM, pulse alk adio w o e:Hello e e yone, I hough I would in oduce mysel , my name is Lee and I own and hos Pulse Talk Radio his is a show ha is pa ly en e ainmen and pa ly in o ma i e. Jus la ely we ha e been co e ing \" he Box\" mainly Joes box bu  always wi h e e ence o F anks, I ha e always been ascina ed by EVP and p og essi e pa ano mal esea ch equipmen so I caugh on o  his subjec a he quickly and i now has cap u ed my imagina ion.I'm no elec onically minded bu know wha a capaci o and Mic o chip look like and I'm e y good wi h heo y's and hope I can help wi h inpu in o his amazing piece o equipmen /subjec , you may ask why should he be amazed by some hing he has only hea d o and does no own, well I ha e been on a li e box session o e Skype and his box clea ly said Hello Lee in esponse o a di ec ques ion, now o a open minded scep ic like mysel his was a e ela ion and now I'm hooked on he whole concep , no o say I'm a belie e bu e y much in o esea ching he idea u he I would also like o say g ea job on F ank's pa o in en ing he box, when you ge o know me you will see wha a mile s one i is o ge me o si up and ake no e such is my scep icism on he whole pa ano mal subjec . I espec hose ha s i e o make new equipmen o us he pa ano mal in es iga ion wo ld, keep up he good wo k I will be wa ching closely o up da es and y and pi ch my en cen s in when I hinks i 's wa an ed"}