{"id": "3199", "subject": "Thanks for having me", "author": "lalarutabaga", "timestamp": "2007-11-24T16:16:39Z", "full_text": "Hello,\nThis is my first post to the group.  My name is Ursula, and I am a \nChicago-based writer who has written a number of books on Chicago&#39;s \nsupernatural history and folklore. I just started a regular program \nof ITC experimentation a week ago today, after receiving several \nbooks from Mark Macy after he spoke at our Chicago Ghost Conference \nin October.  Macy immediately struck me as an intensely sincere, \npeaceful person, and I wanted some of what made him that way.  I soon \nfound out that his demeanor flows from his connection to and \nknowledge of the other side, which he has garnered through ITC.  With \nMark&#39;s advice to guide me, I put together a very simple setup and \nbegan recording for about ten minutes each morning at eleven.  I got \nmy first voice on Wednesday and, though it was a bit chilling, I was \nand am fascinated. This was a huge step for me because, like a lot \nof &quot;ghost hunters&quot; I was fascinated by voice phenomena but never \nwanted it in my own house!  Previously, the thought of recording in \nmy own home was terrifying, but now that I understand the bridge-\nbuilding idea of ITC (as a separate thing from recording EVP at \nhaunted sites)it&#39;s actually bringing me a lot of peace and focus.\n\nMy husband and I operate Chicago Hauntings tours, and we started our \ncompany in part to try to &quot;un-haunt&quot; some of the tragic sites in the \ncity. We feel that by taking guests to the locations to tell the \noften covered-up stories of the dead there we can help send on some \nof the negative energies/entities.  ITC seems to really speak to this \nidea, in the way that it helps us all grow spiritually BEFORE we pass \nover, so that we don&#39;t get &quot;left behind&quot; here when it&#39;s time to \ntransition.\n\nAnyway, those are some of the inital feelings and thoughts I have as \nI start this program.  I am eager to pick up feelings, thoughts (and \ntips) from other experimenters.  Thanks again for having me!"}