{"id": "3204", "subject": "Re: New here", "author": "bhali333", "timestamp": "2007-11-24T17:21:01Z", "full_text": "Lee,\n\nWelcome!\n\nEveryone Lee is the owner and host of a great paranormal talk radio \nshow based on the isle of white in the uk. Recently Steve Hultay and \nI were priveledged to be guests on Lee&#39;s international radio program \nand discuss the use and resaerch of Frank&#39;s and joe&#39;s boxes. And as a \nresult we have become friends.\n\nLee is a great guy and hosts a very informative ,entertaining and \ncutting edge radio show it airs here in the us on friday&#39;s from\n4:00 p.m. to 7:00 p.m. EST. I suggest you all give a listen you won&#39;t \nbe disapointed, espescially with guests like the famed medium from \nthe show most haunted, Derek Acorah and of course steve and myself.\n\nthe site url where you can go and listen live plus they have an \ninteractive chat board so you can actually get involved in the show.\n\ngoto \n\nhttp://pulseradio.forumarena.com/?\nsid=6f70a8cec13f45eacf12893642e29927&mforum=pulseradio\n\nagain welcome Lee I&#39;m sure you will be a great asset to the group.\n\nBruce\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;pulsetalkradio&quot; &lt;lee@...&gt; wrote:\n&gt;\n&gt; Hello everyone, I thought I would introduce myself, my name is Lee \n&gt; and I own and host Pulse Talk Radio this is a show that is partly \n&gt; entertainment and partly informative. \n&gt; \n&gt;  Just lately we have been covering &quot;the Box&quot; mainly Joes box but \n&gt; always with reference to Franks, I have always been fascinated by \n&gt; EVP and progressive paranormal research equipment so I caught on to \n&gt; this subject rather quickly and it now has captured my imagination.\n&gt; \n&gt; I&#39;m not electronically minded but know what a capacitor and Micro \n&gt; chip look like and  I&#39;m very good with theory&#39;s and hope I can help \n&gt; with input into this amazing piece of equipment/subject, you may \nask \n&gt; why should he be amazed by something he has only heard of and does \n&gt; not own, well I have been on a live box session over Skype and this \n&gt; box clearly said Hello Lee in response to a direct question,  now \nto \n&gt; a open minded sceptic like myself this was a revelation and now I&#39;m \n&gt; hooked on the whole concept, not to say I&#39;m a believer but very \nmuch \n&gt; in to researching the idea further\n&gt; \n&gt; I would also like to say great job on Frank&#39;s part for inventing \nthe \n&gt; box, when you get to know me you will see what a mile stone it is \nto \n&gt; get me to sit up and take note such is my scepticism on the whole \n&gt; paranormal subject. I respect those that strive to make new \n&gt; equipment for us the paranormal investigation world, keep up the \n&gt; good work I will be watching closely for up dates and try and pitch \n&gt; my ten cents in when I thinks it&#39;s warranted\n&gt;"}