{"id": "3205", "subject": "Re: [EVP-ITC] Newbie here...VPI Photos?", "author": "Lisby", "timestamp": "2007-11-24T17:49:01Z", "full_text": "Bruce, I have to disagree with the statement you seem to be making  \nabout animals not being able to come through from the other side.  \nMaybe I am just misunderstanding what you wrote. The way I read it  \nwas that you have some sort of doubts about the validity of the  \nphenomenon because you got animals?\n\nThe images remind me a very great deal of the Belmez faces. Are you  \nfamiliar with that case? It&#39;s a classic, so I&#39;m sure you are. :)\n\nAnn\n\n\nOn Nov 24, 2007, at 11:48 AM, bruce halliday wrote:\n\n&gt; Hi and welcome,\n&gt;\n&gt; the vpi images are my discovery.\n&gt; If you want more info you can visit my website\n&gt;\n&gt; http://free-paranormalinvestigating.com/\n&gt;\n&gt; Bruce\n&gt;\n&gt;\n&gt;\n&gt; Bruce Halliday\n&gt; Paranormal Investigating Team\n&gt;\n&gt;\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; From: heartbrkr2000@...\n&gt; Date: Sat, 24 Nov 2007 16:33:17 +0000\n&gt; Subject: [EVP-ITC] Newbie here...VPI Photos?\n&gt;\n&gt; Hello all-\n&gt;\n&gt; What are these? Photos with faces of ghosts? This is all new to me.\n&gt;\n&gt;\n&gt;\n&gt; Get the power of Windows + Web with the new Windows Live. Power up!\n&gt;\n&gt; \n\n\nB uce, I ha e o disag ee wi h he s a emen you seem o be making abou animals no being able o come h ough om he o he side. Maybe I am jus misunde s anding wha you w o e. The way I ead i was ha you ha e some so o doub s abou he alidi y o he phenomenon because you go animals?The images emind me a e y g ea deal o he Belmez aces. A e you amilia wi h ha case? I 's a classic, so I'm su e you a e. :)AnnOn No 24, 2007, a 11:48 AM, b uce halliday w o e:Hi and welcome,  he pi images a e my disco e y.I you wan mo e in o you can isi my websi e h p:// ee-pa ano malin es iga ing.com/ B uceB uce Halliday Pa ano mal In es iga ing Team To: EVP-ITC@yahoog oups.comF om: hea b k 2000@yahoo.comDa e: Sa , 24 No 2007 16:33:17 +0000Subjec : [EVP-ITC] Newbie he e...VPI Pho os?Hello all-Wha a e hese? Pho os wi h aces o ghos s? This is all new o me.Ge he powe o Windows + Web wi h he new Windows Li e. Powe up!"}