{"id": "3213", "subject": "Re: Family hour around the radio", "author": "babiarz3", "timestamp": "2007-11-24T18:51:43Z", "full_text": "Bill, \nI too can be idealistic and am usually dumbfounded by some of the\nthings that happen within the paranormal community. But, for whatever\nreason, I am not idealistic when it comes to the possibilities of the\ndistribution of the box to whoever has the money to pay for one.\nIMO, this reeks of money over-riding responsibility. This is a huge\nstep-forward in our field and I applaud the research and abilities\nbeing shown. \nLike absolutely attracts like. And, as we all know, egos abound in\nthis field. The energies present when the box is turned on has a huge\neffect on who comes through. I know this to be true.\nNow, I don&#39;t have a proposed answer to my dilemma. I do not know how\nto regulate the people who purchase. The only answer I can come up\nwith is time. Time to fully research the possibilities. The possible\npsychological effect on untrained users, scares me. And although I get\nthat the onus of responsibility ultimately falls on the owner of the\nbox, I can&#39;t help but feel the responsibility falls on all of us. True\nprofessionalism, I believe, would have the builders and distributers\ntesting the units over a period of time, at the very least. I&#39;m pretty\nsure Frank didn&#39;t call everyone on day one. \n\n--- In EVP-ITC@yahoogroups.com, &quot;psi_research&quot; &lt;vilhellm@...&gt; wrote:\n&gt;\n&gt; Hello all, although I didn&#39;t anticipate the direction this thread has\n&gt; gone, it is an important subject. There are those in the physical and\n&gt; non-physical planes that do not have the best intentions. It is\n&gt; unfortunate and sometimes I am idealistic and wish the world would be\n&gt; a place where everyone can work, live, and research together. But\n&gt; that&#39;s not the way it always is.\n&gt; \n&gt; I was brought up in a wonderful home where the possibility of the\n&gt; existence of supernatural beings was accepted by my parents. Now,\n&gt; decades later, in our home we also accept this possibility and our\n&gt; kids, even though grown, are making up their own minds. The research I\n&gt; do is not taken lightly but we attract those that have similar values\n&gt; to our own. Even in the spirit world. This technology that Frank has\n&gt; brought forth is another form of ITC, and anyone with a video camera\n&gt; and tv can engage in video ITC. I don&#39;t think it would be possible to\n&gt; regulate who can have a camera and tv, just as we can&#39;t regulate who\n&gt; has access to any other technology including radios.\n&gt; \n&gt; It&#39;s more of a matter of personal responsibility instead of the means\n&gt; we use to communicate. \n&gt; -Bill \n&gt; --- In EVP-ITC@yahoogroups.com, bruce halliday\n&gt; &lt;paranormalinvestigating@&gt; wrote:\n&gt; &gt;\n&gt; &gt; babiarz3,\n&gt; &gt;  \n&gt; &gt; I believe the posts you are referring to about family hour with\nthe box\n&gt; &gt; where written in a light manner in jest. I do not presume to speak\n&gt; for anyone \n&gt; &gt; else on this group I&#39;m sure they can speak for themselves.\n&gt; &gt;  \n&gt; &gt; you speak of responsibility with any form of open communication, I\n&gt; believe the individuals that are\n&gt; &gt; studying and distributing the mini box are sufficiently experienced\n&gt; and know who they should sell to and who not.\n&gt; &gt;  \n&gt; &gt; I don&#39;t believe they mean to put the mini box on the shelves in toys\n&gt; r us. Anyone that uses a box whether it be a Frank&#39;s box\n&gt; &gt; A Joe&#39;s box or a mini box will probably have done some research into\n&gt; this method of evp and will probably have some intimate experience\n&gt; &gt; with the paranormal field and if not I&#39;m sure they will seek advice\n&gt; from those of us that have that experience. There is never a lack of\n&gt; advice here.\n&gt; &gt;  \n&gt; &gt; as far as dark heads go I know through personal experience that they\n&gt; can be deceiving and manipulative with someone that does not know any\n&gt; better\n&gt; &gt; I have a Frank&#39;s box and a Joe&#39;s box and do serious research on a\n&gt; daily basis. My opinion is the good spirits out weigh the negative\n&gt; ones and anyone\n&gt; &gt; that experiments with a box will tell you that you do forge strong\n&gt; bonds with what I call my spirit guides or technicians, the same two\n&gt; spirits communicate \n&gt; &gt; with me during every session and protect me from negativity. As long\n&gt; as I do not feed the darkies with my own negativity I am fine.\n&gt; &gt;  \n&gt; &gt; Also I believe that the people who are distributing the mini box\n&gt; have set that price to deter any average person that&#39;s completely\n&gt; ignorant of the paranormal\n&gt; &gt; away from purchasing this device.\n&gt; &gt;  \n&gt; &gt; I have never met bill personally but know of him, he is a well\n&gt; respected researcher and is well aware I think of the pitfalls as well\n&gt; as the rewards of box communication.\n&gt; &gt; and I don&#39;t believe he would ever endanger himself, his family or\n&gt; anyone else by carelessly using the box for entertainment purposes.\n&gt; &gt;  \n&gt; &gt; that Is my opinion for what it&#39;s worth.\n&gt; &gt;  \n&gt; &gt; Bruce\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; Bruce Halliday Paranormal Investigating Team \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; To: EVP-ITC@: babiarz3@: Fri, 23 Nov 2007 19:58:45\n&gt; +0000Subject: [EVP-ITC] Re: Family hour around the radio\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; I am a fairly quiet person, most of the time. I have my thoughts\n&gt; andopinions on topics but feel strongly about &quot;to each his own&quot;.\n&gt; Unlesssomething strikes me as completely wrong, I won&#39;t debate. No one\n&gt; herehas heard from me other than recently with this mini-box yet, I\n&gt; amhere several times weekly reading and offering my energy in support\n&gt; ofthe research.However...something is striking me here and again, I\n&gt; can&#39;t keep mymouth shut. The discussion about the family hour with the\n&gt; box has ledthe way for people to mention negativity and even &quot;the dark\n&gt; guys&quot; canbe fun if not taken seriously.I ask you to consider the fact\n&gt; that many who purchase the mini-boxwill not be of the right frame of\n&gt; mind. Most will not be in harmony.Many will take &quot;the dark guys&quot;\n&gt; seriously. Yet, you feel it&#39;s a goodidea to let anyone who wants a box\n&gt; have one? All in the name ofsharing technology.I know that my previous\n&gt; posts expressing my concern over the massmarketing of the box, was\n&gt; barely given consideration. Realize that Iam not being selfish- I do\n&gt; not own a box. EVP is my passion and hasbeen from day one 6 years ago\n&gt; when I jumped fully into the field. I amsuccessful in capturing EVP,\n&gt; always have been. I still do it the &quot;oldfashioned way&quot; with open air\n&gt; techniques. Would I love to be able tohold real time 2 way\n&gt; communications with the other side? Of course.However, I do not think\n&gt; enough research into the possibilities hasbeen done to warrant the\n&gt; approval let alone production of these boxes. Those of us who have\n&gt; been on countless investigations with many peoplewill quickly admit\n&gt; that there are some people we&#39;d rather notinvestigate with. When they\n&gt; are present, negative things tend tohappen. We all know one or two\n&gt; people who we can say &quot;felt dark&quot; fromthe first meeting. We all admit\n&gt; that being mentally sound is animportant quality in this field. If you\n&gt; have mental issues, this maynot be the area of research for you. We\n&gt; don&#39;t bring children oninvestigations for obvious reasons. BUT! If you\n&gt; want a box that couldpossibly open up a portal and bridge the gap\n&gt; between here and thedark, sure! Anyone who wants one should have it!\n&gt; You might feel that I am over reacting or being overly dramatic.That&#39;s\n&gt; fine. My concern is not what you think of me but that youconsider the\n&gt; possibilities here. Many of which we do not know. Can yoube 100% sure\n&gt; that this is a good idea or that it&#39;s worthy of saying&quot;well, we&#39;ll see\n&gt; what happens&quot;? --- In EVP-ITC@yahoogroups.com, bruce\n&gt; halliday&lt;paranormalinvestigating@&gt; wrote:&gt;&gt; Bill,&gt; &gt; You have the\n&gt; right idea, I recently have dealt with a lot&gt; of negativity from my\n&gt; Frank&#39;s box. Harmony is very important&gt; as is the right frame of mind\n&gt; before turning the box on.&gt; &gt; hope you & the family had a good\n&gt; holiday.&gt; &gt; Bruce&gt; &gt; Bruce Halliday Paranormal Investigating Team &gt; &gt;\n&gt; &gt; To: EVP-ITC@: vilhellm@: Fri, 23 Nov 2007 02:46:20+0000Subject:\n&gt; [EVP-ITC] Family hour around the radio&gt; &gt; &gt; &gt; &gt; Maybe we&#39;re just a\n&gt; little unconventional in our household, but mostof us here are pretty\n&gt; open to the idea of the multiverse. Gathering ina circle around our\n&gt; Frank&#39;s Box is our idea of quality family time.The messages are\n&gt; relevent, the interest is high, and we&#39;re very wellgrounded and do not\n&gt; let the tricksters push us around.HappyThanksgiving from our home to\n&gt; yours. -Bill &gt; &gt; &gt; &gt; &gt; &gt; &gt;\n&gt; __________________________________________________________&gt; Connect\n&gt; and share in new ways with Windows\n&gt;\nLive.&gt;http://www.windowslive.com/connect.html?ocid=TXT_TAGLM_Wave2_newways_112007&gt;\n&gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; _________________________________________________________________\n&gt; &gt; Share life as it happens with the new Windows Live.Download today\n&gt; it&#39;s FREE!\n&gt; &gt;\n&gt;\nhttp://www.windowslive.com/share.html?ocid=TXT_TAGLM_Wave2_sharelife_112007\n&gt; &gt;\n&gt;"}