{"id": "3215", "subject": "Re: Box user concerns.", "author": "babiarz3", "timestamp": "2007-11-24T18:58:56Z", "full_text": "Frank, that&#39;s just it. No one knows what to do with the\nconsiderations. No one has a good feel for what the potential pitfalls\nare. No one knows. Yet, we are willing to support the distribution of\nthem. Too soon, I fear. Too soon. \nThere is no training, no guidance offered... just hand over the keys. \nFor the love of money. Power is a strong aphrodisiac. \n\n\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@...&gt; wrote:\n&gt;\n&gt; \n&gt;  It&#39;s not that concerns are not considered, I think no one knows\nwhat to do with it. There&#39;s not enough box users, and ITC researchers\nout there to really good feel for what the pitfalls are. So far after\nseven years of EVP/ITC work I can say onlly that these dark entities,\nor wahtever it is talk bad, and threaten, and that&#39;s about all they\ndo. They threaten, I tell them to bring it, and....nothin&#39;! Paper\ntigers I say. \n&gt;  \n&gt;  As far as some fears that portals are opened, and all kinds of evil\ncomes in, I don&#39;t believe that either. They are already have full\naccess, they already exist in more demensions, making this physical\nlevel about the lowest level of spiritual existence/evolution. Just\nabout all these worries are old fear crap to keep people in church. \n&gt;  \n&gt;  I don&#39;t think it&#39;s fair to with hold the stuff cuz of a few nut\njobs, you have the same problem with everything from bicycles to\nairplanes. \n&gt;  \n&gt;  I had that concern about selling my boxes, but how would you screen\nusers? You can&#39;t. Not everyone can use a quija board, and not too many\nunbalanced ding dongs get in trouble with those anyway.\n&gt;  \n&gt;  Frank-S\n&gt; \n&gt; \n&gt; To: EVP-ITC@...: babiarz3@...: Fri, 23 Nov 2007 19:58:45\n+0000Subject: [EVP-ITC] Re: Family hour around the radio\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; I am a fairly quiet person, most of the time. I have my thoughts\nandopinions on topics but feel strongly about &quot;to each his own&quot;.\nUnlesssomething strikes me as completely wrong, I won&#39;t debate. No one\nherehas heard from me other than recently with this mini-box yet, I\namhere several times weekly reading and offering my energy in support\nofthe research.However...something is striking me here and again, I\ncan&#39;t keep mymouth shut. The discussion about the family hour with the\nbox has ledthe way for people to mention negativity and even &quot;the dark\nguys&quot; canbe fun if not taken seriously.I ask you to consider the fact\nthat many who purchase the mini-boxwill not be of the right frame of\nmind. Most will not be in harmony.Many will take &quot;the dark guys&quot;\nseriously. Yet, you feel it&#39;s a goodidea to let anyone who wants a box\nhave one? All in the name ofsharing technology.I know that my previous\nposts expressing my concern over the massmarketing of the box, was\nbarely given consideration. Realize that Iam not being selfish- I do\nnot own a box. EVP is my passion and hasbeen from day one 6 years ago\nwhen I jumped fully into the field. I amsuccessful in capturing EVP,\nalways have been. I still do it the &quot;oldfashioned way&quot; with open air\ntechniques. Would I love to be able tohold real time 2 way\ncommunications with the other side? Of course.However, I do not think\nenough research into the possibilities hasbeen done to warrant the\napproval let alone production of these boxes. Those of us who have\nbeen on countless investigations with many peoplewill quickly admit\nthat there are some people we&#39;d rather notinvestigate with. When they\nare present, negative things tend tohappen. We all know one or two\npeople who we can say &quot;felt dark&quot; fromthe first meeting. We all admit\nthat being mentally sound is animportant quality in this field. If you\nhave mental issues, this maynot be the area of research for you. We\ndon&#39;t bring children oninvestigations for obvious reasons. BUT! If you\nwant a box that couldpossibly open up a portal and bridge the gap\nbetween here and thedark, sure! Anyone who wants one should have it!\nYou might feel that I am over reacting or being overly dramatic.That&#39;s\nfine. My concern is not what you think of me but that youconsider the\npossibilities here. Many of which we do not know. Can yoube 100% sure\nthat this is a good idea or that it&#39;s worthy of saying&quot;well, we&#39;ll see\nwhat happens&quot;? --- In EVP-ITC@yahoogroups.com, bruce\nhalliday&lt;paranormalinvestigating@&gt; wrote:&gt;&gt; Bill,&gt; &gt; You have the\nright idea, I recently have dealt with a lot&gt; of negativity from my\nFrank&#39;s box. Harmony is very important&gt; as is the right frame of mind\nbefore turning the box on.&gt; &gt; hope you & the family had a good\nholiday.&gt; &gt; Bruce&gt; &gt; Bruce Halliday Paranormal Investigating Team &gt; &gt;\n&gt; To: EVP-ITC@: vilhellm@: Fri, 23 Nov 2007 02:46:20+0000Subject:\n[EVP-ITC] Family hour around the radio&gt; &gt; &gt; &gt; &gt; Maybe we&#39;re just a\nlittle unconventional in our household, but mostof us here are pretty\nopen to the idea of the multiverse. Gathering ina circle around our\nFrank&#39;s Box is our idea of quality family time.The messages are\nrelevent, the interest is high, and we&#39;re very wellgrounded and do not\nlet the tricksters push us around.HappyThanksgiving from our home to\nyours. -Bill &gt; &gt; &gt; &gt; &gt; &gt; &gt;\n__________________________________________________________&gt; Connect\nand share in new ways with Windows\nLive.&gt;http://www.windowslive.com/connect.html?ocid=TXT_TAGLM_Wave2_newways_112007&gt;\n\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Your smile counts. The more smiles you share, the more we donate. \nJoin in.\n&gt; www.windowslive.com/smile?ocid=TXT_TAGLM_Wave2_oprsmilewlhmtagline\n&gt;"}