{"id": "3216", "subject": "Re: Box user concerns.", "author": "babiarz3", "timestamp": "2007-11-24T19:03:31Z", "full_text": "I guess that&#39;s all that matters. Because I&#39;m sure that groups will not\npool their 10 bucks a piece together, get a box, head into someones\nhome.... and who knows. \n\nOkay, I&#39;m done. My opinions are clear. But, we all know about opinions... \n\n--- In EVP-ITC@yahoogroups.com, Lisby &lt;lisby@...&gt; wrote:\n&gt;\n&gt; I also meant to add that this mini-box is hardly going into mass  \n&gt; production. If you want one, you have to cough up $400-$500, just  \n&gt; like I just did. That fee alone is enough to deter casual users. The  \n&gt; people who buy these are not going to buy them on a whim.\n&gt; \n&gt; Ann\n&gt; \n&gt; On Nov 24, 2007, at 12:07 AM, Frank Sumption wrote:\n&gt; \n&gt; &gt;  It&#39;s not that concerns are not considered, I think no one knows  \n&gt; &gt; what to do with it. There&#39;s not enough box users, and ITC  \n&gt; &gt; researchers out there to really good feel for what the pitfalls  \n&gt; &gt; are. So far after seven years of EVP/ITC work I can say onlly that  \n&gt; &gt; these dark entities, or wahtever it is talk bad, and threaten, and  \n&gt; &gt; that&#39;s about all they do. They threaten, I tell them to bring it,  \n&gt; &gt; and....nothin&#39;! Paper tigers I say.\n&gt; &gt;\n&gt; &gt;  As far as some fears that portals are opened, and all kinds of  \n&gt; &gt; evil comes in, I don&#39;t believe that either. They are already have  \n&gt; &gt; full access, they already exist in more demensions, making this  \n&gt; &gt; physical level about the lowest level of spiritual existence/ \n&gt; &gt; evolution. Just about all these worries are old fear crap to keep  \n&gt; &gt; people in church.\n&gt; &gt;\n&gt; &gt;  I don&#39;t think it&#39;s fair to with hold the stuff cuz of a few nut  \n&gt; &gt; jobs, you have the same problem with everything from bicycles to  \n&gt; &gt; airplanes.\n&gt; &gt;\n&gt; &gt;  I had that concern about selling my boxes, but how would you  \n&gt; &gt; screen users? You can&#39;t. Not everyone can use a quija board, and  \n&gt; &gt; not too many unbalanced ding dongs get in trouble with those anyway.\n&gt; &gt;\n&gt; &gt;  Frank-S\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; To: EVP-ITC@yahoogroups.com\n&gt; &gt; From: babiarz3@...\n&gt; &gt; Date: Fri, 23 Nov 2007 19:58:45 +0000\n&gt; &gt; Subject: [EVP-ITC] Re: Family hour around the radio\n&gt; &gt;\n&gt; &gt; I am a fairly quiet person, most of the time. I have my thoughts and\n&gt; &gt; opinions on topics but feel strongly about &quot;to each his own&quot;. Unless\n&gt; &gt; something strikes me as completely wrong, I won&#39;t debate. No one here\n&gt; &gt; has heard from me other than recently with this mini-box yet, I am\n&gt; &gt; here several times weekly reading and offering my energy in support of\n&gt; &gt; the research.\n&gt; &gt; However...something is striking me here and again, I can&#39;t keep my\n&gt; &gt; mouth shut. The discussion about the family hour with the box has led\n&gt; &gt; the way for people to mention negativity and even &quot;the dark guys&quot; can\n&gt; &gt; be fun if not taken seriously.\n&gt; &gt; I ask you to consider the fact that many who purchase the mini-box\n&gt; &gt; will not be of the right frame of mind. Most will not be in harmony.\n&gt; &gt; Many will take &quot;the dark guys&quot; seriously. Yet, you feel it&#39;s a good\n&gt; &gt; idea to let anyone who wants a box have one? All in the name of\n&gt; &gt; sharing technology.\n&gt; &gt; I know that my previous posts expressing my concern over the mass\n&gt; &gt; marketing of the box, was barely given consideration. Realize that I\n&gt; &gt; am not being selfish- I do not own a box. EVP is my passion and has\n&gt; &gt; been from day one 6 years ago when I jumped fully into the field. I am\n&gt; &gt; successful in capturing EVP, always have been. I still do it the &quot;old\n&gt; &gt; fashioned way&quot; with open air techniques. Would I love to be able to\n&gt; &gt; hold real time 2 way communications with the other side? Of course.\n&gt; &gt; However, I do not think enough research into the possibilities has\n&gt; &gt; been done to warrant the approval let alone production of these boxes.\n&gt; &gt; Those of us who have been on countless investigations with many people\n&gt; &gt; will quickly admit that there are some people we&#39;d rather not\n&gt; &gt; investigate with. When they are present, negative things tend to\n&gt; &gt; happen. We all know one or two people who we can say &quot;felt dark&quot; from\n&gt; &gt; the first meeting. We all admit that being mentally sound is an\n&gt; &gt; important quality in this field. If you have mental issues, this may\n&gt; &gt; not be the area of research for you. We don&#39;t bring children on\n&gt; &gt; investigations for obvious reasons. BUT! If you want a box that could\n&gt; &gt; possibly open up a portal and bridge the gap between here and the\n&gt; &gt; dark, sure! Anyone who wants one should have it!\n&gt; &gt; You might feel that I am over reacting or being overly dramatic.\n&gt; &gt; That&#39;s fine. My concern is not what you think of me but that you\n&gt; &gt; consider the possibilities here. Many of which we do not know. Can you\n&gt; &gt; be 100% sure that this is a good idea or that it&#39;s worthy of saying\n&gt; &gt; &quot;well, we&#39;ll see what happens&quot;?\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com, bruce halliday\n&gt; &gt; &lt;paranormalinvestigating@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; Bill,\n&gt; &gt; &gt;\n&gt; &gt; &gt; You have the right idea, I recently have dealt with a lot\n&gt; &gt; &gt; of negativity from my Frank&#39;s box. Harmony is very important\n&gt; &gt; &gt; as is the right frame of mind before turning the box on.\n&gt; &gt; &gt;\n&gt; &gt; &gt; hope you & the family had a good holiday.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Bruce\n&gt; &gt; &gt;\n&gt; &gt; &gt; Bruce Halliday Paranormal Investigating Team\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; To: EVP-ITC@: vilhellm@: Fri, 23 Nov 2007 02:46:20\n&gt; &gt; +0000Subject: [EVP-ITC] Family hour around the radio\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; Maybe we&#39;re just a little unconventional in our household, but most\n&gt; &gt; of us here are pretty open to the idea of the multiverse. Gathering in\n&gt; &gt; a circle around our Frank&#39;s Box is our idea of quality family time.\n&gt; &gt; The messages are relevent, the interest is high, and we&#39;re very well\n&gt; &gt; grounded and do not let the tricksters push us around.Happy\n&gt; &gt; Thanksgiving from our home to yours. -Bill\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; __________________________________________________________\n&gt; &gt; &gt; Connect and share in new ways with Windows Live.\n&gt; &gt; &gt;\n&gt; &gt; http://www.windowslive.com/connect.html? \n&gt; &gt; ocid=TXT_TAGLM_Wave2_newways_112007\n&gt; &gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Your smile counts. The more smiles you share, the more we donate.  \n&gt; &gt; Join in!\n&gt; &gt;\n&gt; &gt;\n&gt;"}