{"id": "3225", "subject": "Re: Family hour around the radio", "author": "psi_research", "timestamp": "2007-11-24T20:55:36Z", "full_text": "People give power over themselves to who they choose. Whether it is a\nleader, an entity, artifacts such voodoo dolls or even a grilled\ncheese sandwich with a recognizable saint on it.\n\n Heck, movie character villains have even stated this. To quote\nCandyman &quot;I live only because of the fear people have of me&quot; \n \n--- In EVP-ITC@yahoogroups.com, Lisby &lt;lisby@...&gt; wrote:\n&gt;\n&gt; \n&gt; On Nov 24, 2007, at 1:39 PM, babiarz3 wrote:\n&gt; &gt;  I definitely see the positive\n&gt; &gt; possibilities from any sort of EVP. However, I see the enormous\n&gt; &gt; potential for negative. Enormous. To not see that is, IMO, short- \n&gt; &gt; sighted.\n&gt; &gt;\n&gt; \n&gt; I see the negative, but I balance it against the positive. This is  \n&gt; called risk assessment, and we do it everyday for every action we  \n&gt; take. To me, after neutral assessment of all the possibilities, both  \n&gt; good and bad, and weighing of the evidence we do have from three to  \n&gt; four decades of EVP and ITC, the rational conclusion appears to be  \n&gt; that you take no more risk using a box then you do using a tape  \n&gt; recorder. The box&#39;s realtime talkback ability does not allow for  \n&gt; extended messages-- they tend to be of the length of an EVP and  \n&gt; sometimes fragment in the middle, just as EVP do. So  a person might  \n&gt; hear &quot;You bastard,&quot; or such, but he is very unlikely to hear a long  \n&gt; and spellbinding seduction to come to the Dark Side. The only  \n&gt; difference between the box and EVP, from what I have listened to so  \n&gt; far, is that it can be heard in realtime--there can be a quick and  \n&gt; indisputable reply to a question. That doesn&#39;t mean it can always be  \n&gt; understood in realtime. I suspect box users are having to go back and  \n&gt; re-listen to actually hear what was said.\n&gt; \n&gt; Anyway, a neutral risk assessment shows clearly that one has a lot  \n&gt; less chance of being harmed by a box than by benefiting by it.\n&gt; \n&gt; Personally, I&#39;m not afraid of these so-called dark entities. If I  \n&gt; don&#39;t let them, they can&#39;t do a darned thing to me. Never have; never  \n&gt; will. Worrying about them is a waste of time. Just approach the  \n&gt; research with a positive attitude and &quot;the stomach of a lion,&quot; the  \n&gt; quote Elizabeth I. And to quote another great leader, &quot;The only thing  \n&gt; we have to fear is fear itself.&quot;\n&gt; \n&gt; Ann\n&gt;"}