{"id": "3227", "subject": "Re: [EVP-ITC] New here", "author": "Misty Dawn", "timestamp": "2007-11-24T21:55:17Z", "full_text": "--0-246373951-1195941317=:77942\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nWelcome to the group Lee\n   \n  Yes as I have said before they are pretty direct in speech. All it takes is a mind open enough to hear. Glad you could hear them. Not everyone can/will.\n   \n  Misty\n\npulsetalkradio &lt;lee@...&gt; wrote:\n          Hello everyone, I thought I would introduce myself, my name is Lee \nand I own and host Pulse Talk Radio this is a show that is partly \nentertainment and partly informative. \n\nJust lately we have been covering &quot;the Box&quot; mainly Joes box but \nalways with reference to Franks, I have always been fascinated by \nEVP and progressive paranormal research equipment so I caught on to \nthis subject rather quickly and it now has captured my imagination.\n\nI&#39;m not electronically minded but know what a capacitor and Micro \nchip look like and I&#39;m very good with theory&#39;s and hope I can help \nwith input into this amazing piece of equipment/subject, you may ask \nwhy should he be amazed by something he has only heard of and does \nnot own, well I have been on a live box session over Skype and this \nbox clearly said Hello Lee in response to a direct question, now to \na open minded sceptic like myself this was a revelation and now I&#39;m \nhooked on the whole concept, not to say I&#39;m a believer but very much \nin to researching the idea further\n\nI would also like to say great job on Frank&#39;s part for inventing the \nbox, when you get to know me you will see what a mile stone it is to \nget me to sit up and take note such is my scepticism on the whole \nparanormal subject. I respect those that strive to make new \nequipment for us the paranormal investigation world, keep up the \ngood work I will be watching closely for up dates and try and pitch \nmy ten cents in when I thinks it&#39;s warranted \n\n\n\n                         \n\n       \n---------------------------------\nNever miss a thing.   Make Yahoo your homepage.\r\n--0-246373951-1195941317=:77942\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;div&gt;Welcome to the group Lee&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Yes as I have said before they are pretty direct in speech. All it takes is a mind open enough to hear. Glad you could hear them. Not everyone can/will.&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Misty&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;pulsetalkradio &lt;lee@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/div&gt;  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;div&gt;Hello everyone, I thought I would introduce myself, my name is Lee &lt;BR&gt;and I own and host Pulse Talk Radio this is a show that is partly &lt;BR&gt;entertainment and partly informative. &lt;BR&gt;&lt;BR&gt;Just lately we have been covering &quot;the Box&quot; mainly Joes box but\n &lt;BR&gt;always with reference to Franks, I have always been fascinated by &lt;BR&gt;EVP and progressive paranormal research equipment so I caught on to &lt;BR&gt;this subject rather quickly and it now has captured my imagination.&lt;BR&gt;&lt;BR&gt;I&#39;m not electronically minded but know what a capacitor and Micro &lt;BR&gt;chip look like and I&#39;m very good with theory&#39;s and hope I can help &lt;BR&gt;with input into this amazing piece of equipment/subject, you may ask &lt;BR&gt;why should he be amazed by something he has only heard of and does &lt;BR&gt;not own, well I have been on a live box session over Skype and this &lt;BR&gt;box clearly said Hello Lee in response to a direct question, now to &lt;BR&gt;a open minded sceptic like myself this was a revelation and now I&#39;m &lt;BR&gt;hooked on the whole concept, not to say I&#39;m a believer but very much &lt;BR&gt;in to researching the idea further&lt;BR&gt;&lt;BR&gt;I would also like to say great job on Frank&#39;s part for inventing the &lt;BR&gt;box, when you get to know me you will see what a mile stone it is to &lt;BR&gt;get\n me to sit up and take note such is my scepticism on the whole &lt;BR&gt;paranormal subject. I respect those that strive to make new &lt;BR&gt;equipment for us the paranormal investigation world, keep up the &lt;BR&gt;good work I will be watching closely for up dates and try and pitch &lt;BR&gt;my ten cents in when I thinks it&#39;s warranted &lt;BR&gt;&lt;BR&gt;&lt;/div&gt;&lt;/DIV&gt;&lt;!--End group email\n --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;p&gt;&#32;\n\n      &lt;hr size=1&gt;Never miss a thing.  &lt;a href=&quot;http://us.rd.yahoo.com/evt=51438/*http://www.yahoo.com/r/hs&quot;&gt; Make Yahoo your homepage.&lt;/a&gt;\n\n\r\n--0-246373951-1195941317=:77942--"}