{"id": "3241", "subject": "Re: Practice, practice, practice!", "author": "judy_in_hollywood", "timestamp": "2007-11-25T03:30:25Z", "full_text": "--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@...&gt; wrote:\n&gt;\n&gt; \n&gt;  Most seem to get the ones that say &quot;shut up&quot; or worse, and I think it&#39;s just testing to see what you can handle, and where your fear level is. Even the supposed dark guys, or whatever seem pretty harmless.   Good work, I hope it continues to improve!\n&gt;  \n&gt;  Frank-S\n&gt; \n&gt; \n&gt; To: EVP-ITC@...: Ticket_to_Heaven@...: Sat, 24 Nov 2007 05:03:09 +0000Subject: [EVP-ITC] Practice, practice, practice!\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Hi All, Thanks to those here on helping me understand How To Do a sweep recording with a radio (AM mostly)! Last night I finally was able to do it correctly as when I carefully listened back with headphones I heard: YOU ARE STONED, FOR . . . YOU (which sounded like Tiny Tim singing it!?), THE FIRST TIME . . . FOR YOU, then on FM, when I asked, &quot;Is anybody here?&quot; I heard: SHUT . . .UP! LOL Probably that one was a &quot;Darkie&quot;! Most of the EVP&#39;s/voice messages seemed to be OK and not negative = which is good. I&#39;m sure I&#39;m missing a lot as they tend to go by too fast and my ears are not used to it, yet! I have the time, daily to do the experimental research on this and hope to continue recording & making notes! Tune in, same time, same station (AM) as they used to say! Thanks. =Judy= P.S. I like the sterio idea & smaller boxes!  \n&gt; \n&gt; \n&gt; = = = = = (?) = = = = = = = =&gt;     Hiya Frank & All. 8-)  Frankly, I think there&#39;s some &quot;wise-guys&quot; that like to act up to test us!  The SHUT-UP was kinda funny, I thought, so I switched bands and went back to AM! Last night&#39;s session, I got:     5 cycles, GOOD LUCK! . . . then I asked, &quot;Anybody want to say anything?&quot; and got: FORGET IT!, OH GOD . . ., FOR THE BIRDS, , , , BIRDS (in) HEAVEN.    Well, so far, so good! Thanks.   =Judy=    - - - - - - - - - - - - - - - - - - - - - - - - - -   \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Share life as it happens with the new Windows Live.Download today it&#39;s FREE!\n&gt; http://www.windowslive.com/share.html?ocid=TXT_TAGLM_Wave2_sharelife_112007\n&gt;"}