{"id": "3314", "subject": "RE: [EVP-ITC] Why do you have to make every thing sound so sordid", "author": "Ron Ricketts", "timestamp": "2007-11-26T18:17:43Z", "full_text": "I&#39;m not making this out to be anything more than it is. I would like to get\nthe information out, just as Frank would, but some people, myself included,\nare not comfortable with public exposure, and particularly a &#39;live\ninterview&#39; environment. For that reason I have others who are willing to\nspeak about my version of the Box. They were there during the development,\nthey are seasoned researchers, and they are objective. There are no better\npeople than those to &#39;get the word out&#39;.\n\nAlso, I worked in the print media for ten years so thoroughly understand all\naspects of publication, promotion and interviewing. For that reason I have\nchosen to have my associates take care of the public aspects of the\ninformation distribution. Moreover, I am much more comfortable expressing\nmyself in print, and will be writing some articles in the near future. In\nthe meantime, I am still developing and testing the MiniBox, as well as some\nother devices, and will make information available to all when they are\ncompleted and working properly.\n\nThe media is a vital factor of any new scientific development. It is\nimportant to distribute and share the knowledge that has been gained, and to\nkeep everyone informed about all the events surrounding these developments.\nWithout the mainstream media, this information would be closeted and\nunavailable to others. I want to insure that all relevant developments in my\nwork are fully and accurately described, and that the information comes from\nthose with firsthand knowledge of the events. My colleagues are fully\nqualified to discuss this publicly and have my full confidence. They were\nthere.\n\nI believe this should settle this before it gets blown out of proportion.\n\nRon R.\n\n\n-----Original Message-----\nFrom: EVP-ITC@yahoogroups.com [mailto:EVP-ITC@yahoogroups.com] On Behalf Of\npulsetalkradio\nSent: Monday, November 26, 2007 11:50 AM\nTo: EVP-ITC@yahoogroups.com\nSubject: [EVP-ITC] Why do you have to make every thing sound so sordid\n\nJust because a researcher talks about the box research on a radio show \ndoesnt make them any less a researcher, the Box is already out there \nin the paranormal world, dont you think it best that the information \ngiven to the media should come from professional researchers, getting \nthe facts out there is surely more important.  Dont forget most of \ntheses paranormal radio shows are there because of their love of \nparanormal research and investigating, you really come across as a kid \nwith a new toy that dont want anyone else to play with, this research \nis no longer part of a secret club the water is already over the rim \nof the glass, let people know the facts before some fly by night gets \ntaken for his word... Rant over!!\n\n\n\n \nYahoo! Groups Links"}