{"id": "3321", "subject": "Re: Why do you have to make every thing sound so sordid", "author": "Lance Oliver", "timestamp": "2007-11-26T20:29:11Z", "full_text": "Very well put, Frank. \n\nLance\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@...&gt; \nwrote:\n&gt;\n&gt; \n&gt;  At the Stanley recently I was surprised with the box use, and what \nwas coming through for others. I just make the things, I don&#39;t know \nhow it works, and it appears to work differently than what I \nexpected. I also prefer the users speak of what it does. However, I \nexpect a reaction from those that would keep this technology a secret \nto make attempts to show that it&#39;s only for a privliged few to use, \nand &quot;interpret&quot; for the masses. I&#39;m getting hints of this reaction, \nand have already shown my hand as to what side I&#39;m on. Right now it&#39;s \nthe fear of evil spirits being released as an excuse as to why the \ncommon person should not use this stuff. That&#39;s same reasoning that \nkeeps people away from other means of communication, like the quija \nboard, channeling, dowsing, automatic writting......you name it.  No, \nyou must pay a $300 an hour medium to communicate! Much money at \nstake for our insolence. \n&gt;  \n&gt;  \n&gt;  Frank-S\n&gt; \n&gt; \n&gt; To: EVP-ITC@...: ursulabielski@...: Mon, 26 Nov 2007 18:21:28 \n+0000Subject: [EVP-ITC] Re: Why do you have to make every thing sound \nso sordid\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; I agree. As an author, I am attacked all the time for &quot;exploiting&quot; \nChicago&#39;s haunted history and those who have had personal experiences \nwith the paranormal phenomena at the sites about which I write. But I \nhave found that it is only one&#39;s jealous colleagues (or wanna-bes) \nwho complain. Those who are honestly interested in the phenomena and \nin learning about its meaning in their lives are grateful for what \nyou do.I am such a shy person, and I loathe the natural attention \nthat comes from what I do. But you have a duty as a researcher to \nbring your findings to those who are interested in them. When you do, \nthe jealous and the skeptical will attack you, make no bones about \nit, and (ironically) they will say first off that you are arrogant \nand self-serving, and that you love the limelight. Some people who \nlove attention thrive on that negative attention; for me it&#39;s \ntorture. But I have to deal with it, and so do you!I would like very \nmuch to have you publicly talk about your research. What good is it \nif it doesn&#39;t help idiots like us figure out how to do our own?:) \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; You keep typing, we keep giving. Download Messenger and join the \ni&#39;m Initiative now.\n&gt; http://im.live.com/messenger/im/home/?source=TAGLM\n&gt;"}