{"id": "3329", "subject": "Re: [EVP-ITC] C2C", "author": "Lisby", "timestamp": "2007-11-26T23:44:57Z", "full_text": "Hi Ron! You&#39;re here, too?\n\nLooking forward to my new toy!\n\nAnn\n\n\nOn Nov 26, 2007, at 12:18 PM, Ron Ricketts wrote:\n\n&gt;\n&gt; Like Frank, I have also declined all interviews. My work is in the  \n&gt; lab and not on some talk show. The reason that progress is  \n&gt; continuing to be made is that serious researchers keep away from  \n&gt; publicity and stick to what they do best.\n&gt;\n&gt;\n&gt;\n&gt; I also applaud the efforts of members here who work on alternate  \n&gt; and inexpensive methods of building communications devices. This is  \n&gt; the true work of the pioneer. By efforts such as these progress in  \n&gt; ITC will continue to be made.\n&gt;\n&gt;\n&gt;\n&gt; Ron R.\n&gt;\n&gt;\n&gt;\n&gt; From: EVP-ITC@yahoogroups.com [mailto:EVP-ITC@yahoogroups.com] On  \n&gt; Behalf Of Frank Sumption\n&gt; Sent: Sunday, November 25, 2007 11:56 PM\n&gt; To: evp-itc@yahoogroups.com\n&gt; Subject: RE: [EVP-ITC] C2C\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;  So far I have been declining all interviews. I think I&#39;ve my work  \n&gt; by helping to get these various methods started. I have not said  \n&gt; absolutely no, but I don&#39;t like attention, and don&#39;t like public  \n&gt; speaking.\n&gt;\n&gt;  Frank-S\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; From: duck@ghostshop.com\n&gt; Date: Sun, 25 Nov 2007 22:51:03 -0700\n&gt; Subject: Re: [EVP-ITC] C2C\n&gt;\n&gt; Frank,\n&gt;\n&gt;\n&gt;\n&gt; Are you going to be on C2C next month?\n&gt;\n&gt; I heard that in the Edge of darkness  chat room.\n&gt;\n&gt;\n&gt;\n&gt; -Sum\n&gt;\n&gt;\n&gt;\n&gt; ----- Original Message -----\n&gt;\n&gt; From: Frank Sumption\n&gt;\n&gt; To: evp-itc@yahoogroups.com\n&gt;\n&gt; Sent: Sunday, November 25, 2007 10:43 PM\n&gt;\n&gt; Subject: RE: [EVP-ITC] Translating?\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;  It&#39;s just practice, and that opens up your senses. We use various  \n&gt; methods of using &quot;raw&quot; audio, or providing something that the  \n&gt; entities can make voices out of. These techniques bring the  \n&gt; &quot;voices&quot; up to a level of actual communications, sometimes two way.\n&gt;\n&gt;  Frank-S\n&gt;\n&gt;\n&gt; Your smile counts. The more smiles you share, the more we donate.  \n&gt; Join in!\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Share life as it happens with the new Windows Live. Share now!\n&gt;\n&gt;\n&gt; \n\n\nHi Ron! You' e he e, oo? Looking o wa d o my new oy!AnnOn No 26, 2007, a 12:18 PM, Ron Ricke s w o e:Like F ank, I ha e also declined all in e iews. My wo k is in he lab and no on some alk show. The eason ha p og ess is con inuing o be made is ha se ious esea che s keep away om publici y and s ick o wha hey do bes . I also applaud he e o s o membe s he e who wo k on al e na e and inexpensi e me hods o building communica ions de ices. This is he ue wo k o he pionee . By e o s such as hese p og ess in ITC will con inue o be made. Ron R. F om: EVP-ITC@yahoog oups.com [mail o:EVP-ITC@yahoog oups.com] On Behal O  F ank Sump ionSen : Sunday, No embe 25, 2007 11:56 PMTo: e p-i c@yahoog oups.comSubjec : RE: [EVP-ITC] C2C  So a I ha e been declining all in e iews. I hink I' e my wo k by helping o ge   hese a ious me hods s a ed. I ha e no said absolu ely no, bu I don' like a en ion, and don' like public speaking.   F ank-STo: EVP-ITC@yahoog oups.comF om: duck@ghos shop.comDa e: Sun, 25 No 2007 22:51:03 -0700Subjec : Re: [EVP-ITC] C2CF ank, A e you going o be on C2C nex mon h?I hea d ha in he Edge o da kness  cha oom. -Sum ----- O iginal Message -----F om: F ank Sump ionTo: e p-i c@yahoog oups.comSen : Sunday, No embe 25, 2007 10:43 PMSubjec : RE: [EVP-ITC] T ansla ing?  I 's jus p ac ice, and ha opens up you senses. We use a ious me hods o using \" aw\" audio, o p o iding some hing ha he en i ies can make oices ou o . These echniques b ing he \" oices\" up o a le el o ac ual communica ions, some imes wo way.   F ank-SYou smile coun s. The mo e smiles you sha e, he mo e we dona e. Join in!   Sha e li e as i happens wi h he new Windows Li e. Sha e now!"}