{"id": "3366", "subject": "Re: [EVP-ITC] RCA 12-470 RADIO SHACK HACK FILES", "author": "Misty Dawn", "timestamp": "2007-11-27T16:29:17Z", "full_text": "--0-918353418-1196180957=:5842\r\nContent-Type: multipart/alternative; boundary=&quot;0-1458493003-1196180957=:5842&quot;\r\n\r\n\r\n--0-1458493003-1196180957=:5842\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nHiya Buce\n   \n  I hear almost all of those as labled. The help me file I hear different I hear &quot;that you bruce?&quot; \n   \n  Mike had some good results on that one too. I heard your name mentioned on his video twice as well as his name. I clipped those out for you guys and posted to a previous email post. But I will restick them to this email for you. \n   \n  Sorry I didnt clip it all for yall  just wanted to show him where I heard your names so he could maybe hear it too, which he does. \n   \n  Thats one thing I like about any method I use they are always very direct with thier approach and use my name or others to get the point across better.\n   \n  Misty\n\nbhali333 &lt;paranormalinvestigating@...&gt; wrote:\n          HEY GUY&#39;S \n\nOF COURSE I HAVE MY RS HACK AND GETTING RESULTS THE FIRST DAY.\nMY INITIAL OPINION OF THE PERFORMANCE OF THIS LITTLE GEM IS FROM TWO \nEXPERIMENTAL SESSIONS ONE PERFORMED BY STEVE HULTAY AND MYSELF AND \nTHE OTHER BY MYSELF ALONE. THE FILES I HAVE POSTED ARE GLEENED FROM \nONLY THE FIRST MINUTE OR SO OF A TEN MINUTE RECORDING.PLEASE TAKE A \nMINUTE TO LISTEN AND POST YOUR FEEDBACK.\n\nTHE FILES ARE POSTED IN THE FILE SECTION UNDER: \n\n11-26-07_radio shack hack files_Bruce \n\nAFTER DOING ONLY ONE RECORDED SESSION AND TWO SESSIONS TOTAL. I AS A \nSERIOUS BOX RESEARCHER WITH EVRYDAY EXPERIMENTING ON FRANK&#39;S,JOE&#39;S \nAND NOW THE RADIO SHACK HACK BOX CAN PREMATURELY SAY THAT THIS RADIO \nMAY BE SMALL IN SIZE BUT IT PACKS A BIG PUNCH ! AND IT WAS UNDER OUR \nVERY NOSES ALL THE TIME. THANKS TO SUM DUC FOR HIS INSIGHT IN \nDISCOVERING IT.\n\nAT THE RISK OF SOUNDING REDUNDENT I MUST REITERATE THIS RS BOX WILL \nHOLD IT&#39;S OWN WITH THE BIG BOYS. THE RESULTS AND LEVEL OF \nCOMMUNICATION BOTH IN REAL TIME DURING A SESSION AND WHAT IS MISSED \nBY OUR RUDIMENTARY HUMAN HEARING AND CAUGHT ON A RECORDING RIVALS OR \nMAY EVEN GIVEN ENOUGH TIME FOR FREQUENCY IMPRINTING BY OUR SPIRIT \nFRIENDS AND PROPER RESEARCH METHODS WILL SURPASS JOE&#39;S BOX AND PULL A \nCLOSE SECOND TO FRANK&#39;S BOX. \n\nAS A MATTER OF FACT MY FIRST IMPRESSION OF THE RS BOX WAS REMINICENT \nOF THE AM LINEAR MODE OF MY FRANKS BOX #12. LET&#39;S FACE IT A FRANKS \nBOX IS A FRANKS BOX IN AS NO TWO ARE EXACTLY THE SAME THAT IS WHAT \nMAKES THEM SO UNIQUE AND ALSO THE FACT THAT I BELIEVE A SMALL PART OF \nFRANK HIMSELF TRANSFERS INTO EVERY BOX HE MAKES AND HE IS VERY WELL \nRESPECTED ON THE OTHER SIDE FROM WHAT MY GUIDES AND TECHS TELL ME.\n\nI HAVE NOT HAD THE OPPORTUNITY TO USE RON RICKETS MINI BOX YET BUT I \nAM HEARING VERY GOOD THINGS ABOUT IT&#39;S PERFORMANCE ALSO AND CAN NOT \nWAIT TO EXPERIMENT WITH IT.\n\nI THINK OUR FRIENDS ON THE OTHER SIDE ARE FINALY DECIDING TO PUSH \nFORWARD WITH THE COMMUNICATION PROCESS AND ALLOW IT TO BECOME \nACCESABLE TO MANY MORE PEOPLE. WHAT THEY HAVE CONVEYED TO ME OVER \nNUMEROUS SESSIONS IS THE DESPERATE AND INTRIGAL NEED FOR COMBINED \nHARMONY AMONG RESEARCHERS AND COMMUNICATORS. THE MORE MINDS THAT ARE \nTHINKING AND MOVING TOGETHER FOR THIS COMMON GOAL THE STRONGER THE \nSPIRITS ABILITY TO COMMUNICATE AND THEY WILL HELP WITH DEVELOPE MENT \nOF THE TECHNOLOGY SO THINGS ARE LOOKING UP AND HEADING TO THE FUTURE. \n\nWHAT I HAVE GATHERED OVER MANY SESSIONS IS THEY DEFINATELY WANT THE \nWORD AND THE TECHNOLOGY SPREAD TO AS MANY AS ARE WILLING TO ACCEPT IT \nWITH AN OPEN MIND. I AM RATTLING ON AND HAVE DRIFTED FROM MY ORIGINAL \nPOINT WHICH WAS, THIS RADIO SHACK BOX IS AND WILL BE A VERY IMPORTANT \nAND USEFULL TOOL IN FURTHERING OUR COMMUNICATION PROCESS.\n\nTHANKS FOR LISTENING.\n\nBRUCE\n\n\n\n                         \n\n       \n---------------------------------\nNever miss a thing.   Make Yahoo your homepage.\r\n--0-1458493003-1196180957=:5842\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;DIV&gt;Hiya Buce&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;I hear almost all of those as labled. The help me file I hear different I hear &quot;that you bruce?&quot; &lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;Mike had some good results on that one too. I heard your name mentioned on his video twice as well as his name. I clipped those out for you guys and posted to a previous email post. But I will restick them to this email for you. &lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;Sorry I didnt clip it all for yall&nbsp; just wanted to show him where I heard your names so he could maybe hear it too, which he does. &lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;Thats one thing I like about any method I use they are always very direct with thier approach and use my name or others to get the point across better.&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;Misty&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;bhali333 &lt;paranormalinvestigating@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/DIV&gt;  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px\n solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;DIV&gt;HEY GUY&#39;S &lt;BR&gt;&lt;BR&gt;OF COURSE I HAVE MY RS HACK AND GETTING RESULTS THE FIRST DAY.&lt;BR&gt;MY INITIAL OPINION OF THE PERFORMANCE OF THIS LITTLE GEM IS FROM TWO &lt;BR&gt;EXPERIMENTAL SESSIONS ONE PERFORMED BY STEVE HULTAY AND MYSELF AND &lt;BR&gt;THE OTHER BY MYSELF ALONE. THE FILES I HAVE POSTED ARE GLEENED FROM &lt;BR&gt;ONLY THE FIRST MINUTE OR SO OF A TEN MINUTE RECORDING.PLEASE TAKE A &lt;BR&gt;MINUTE TO LISTEN AND POST YOUR FEEDBACK.&lt;BR&gt;&lt;BR&gt;THE FILES ARE POSTED IN THE FILE SECTION UNDER: &lt;BR&gt;&lt;BR&gt;11-26-07_radio shack hack files_Bruce &lt;BR&gt;&lt;BR&gt;AFTER DOING ONLY ONE RECORDED SESSION AND TWO SESSIONS TOTAL. I AS A &lt;BR&gt;SERIOUS BOX RESEARCHER WITH EVRYDAY EXPERIMENTING ON FRANK&#39;S,JOE&#39;&lt;WBR&gt;S &lt;BR&gt;AND NOW\n THE RADIO SHACK HACK BOX CAN PREMATURELY SAY THAT THIS RADIO &lt;BR&gt;MAY BE SMALL IN SIZE BUT IT PACKS A BIG PUNCH ! AND IT WAS UNDER OUR &lt;BR&gt;VERY NOSES ALL THE TIME. THANKS TO SUM DUC FOR HIS INSIGHT IN &lt;BR&gt;DISCOVERING IT.&lt;BR&gt;&lt;BR&gt;AT THE RISK OF SOUNDING REDUNDENT I MUST REITERATE THIS RS BOX WILL &lt;BR&gt;HOLD IT&#39;S OWN WITH THE BIG BOYS. THE RESULTS AND LEVEL OF &lt;BR&gt;COMMUNICATION BOTH IN REAL TIME DURING A SESSION AND WHAT IS MISSED &lt;BR&gt;BY OUR RUDIMENTARY HUMAN HEARING AND CAUGHT ON A RECORDING RIVALS OR &lt;BR&gt;MAY EVEN GIVEN ENOUGH TIME FOR FREQUENCY IMPRINTING BY OUR SPIRIT &lt;BR&gt;FRIENDS AND PROPER RESEARCH METHODS WILL SURPASS JOE&#39;S BOX AND PULL A &lt;BR&gt;CLOSE SECOND TO FRANK&#39;S BOX. &lt;BR&gt;&lt;BR&gt;AS A MATTER OF FACT MY FIRST IMPRESSION OF THE RS BOX WAS REMINICENT &lt;BR&gt;OF THE AM LINEAR MODE OF MY FRANKS BOX #12. LET&#39;S FACE IT A FRANKS &lt;BR&gt;BOX IS A FRANKS BOX IN AS NO TWO ARE EXACTLY THE SAME THAT IS WHAT &lt;BR&gt;MAKES THEM SO UNIQUE AND ALSO THE FACT THAT I BELIEVE A SMALL PART OF &lt;BR&gt;FRANK\n HIMSELF TRANSFERS INTO EVERY BOX HE MAKES AND HE IS VERY WELL &lt;BR&gt;RESPECTED ON THE OTHER SIDE FROM WHAT MY GUIDES AND TECHS TELL ME.&lt;BR&gt;&lt;BR&gt;I HAVE NOT HAD THE OPPORTUNITY TO USE RON RICKETS MINI BOX YET BUT I &lt;BR&gt;AM HEARING VERY GOOD THINGS ABOUT IT&#39;S PERFORMANCE ALSO AND CAN NOT &lt;BR&gt;WAIT TO EXPERIMENT WITH IT.&lt;BR&gt;&lt;BR&gt;I THINK OUR FRIENDS ON THE OTHER SIDE ARE FINALY DECIDING TO PUSH &lt;BR&gt;FORWARD WITH THE COMMUNICATION PROCESS AND ALLOW IT TO BECOME &lt;BR&gt;ACCESABLE TO MANY MORE PEOPLE. WHAT THEY HAVE CONVEYED TO ME OVER &lt;BR&gt;NUMEROUS SESSIONS IS THE DESPERATE AND INTRIGAL NEED FOR COMBINED &lt;BR&gt;HARMONY AMONG RESEARCHERS AND COMMUNICATORS. THE MORE MINDS THAT ARE &lt;BR&gt;THINKING AND MOVING TOGETHER FOR THIS COMMON GOAL THE STRONGER THE &lt;BR&gt;SPIRITS ABILITY TO COMMUNICATE AND THEY WILL HELP WITH DEVELOPE MENT &lt;BR&gt;OF THE TECHNOLOGY SO THINGS ARE LOOKING UP AND HEADING TO THE FUTURE. &lt;BR&gt;&lt;BR&gt;WHAT I HAVE GATHERED OVER MANY SESSIONS IS THEY DEFINATELY WANT THE &lt;BR&gt;WORD AND THE TECHNOLOGY\n SPREAD TO AS MANY AS ARE WILLING TO ACCEPT IT &lt;BR&gt;WITH AN OPEN MIND. I AM RATTLING ON AND HAVE DRIFTED FROM MY ORIGINAL &lt;BR&gt;POINT WHICH WAS, THIS RADIO SHACK BOX IS AND WILL BE A VERY IMPORTANT &lt;BR&gt;AND USEFULL TOOL IN FURTHERING OUR COMMUNICATION PROCESS.&lt;BR&gt;&lt;BR&gt;THANKS FOR LISTENING.&lt;BR&gt;&lt;BR&gt;BRUCE&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;!--End group email\n --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;p&gt;&#32;\n\n      &lt;hr size=1&gt;Never miss a thing.  &lt;a href=&quot;http://us.rd.yahoo.com/evt=51438/*http://www.yahoo.com/r/hs&quot;&gt; Make Yahoo your homepage.&lt;/a&gt;\n\n\r\n--0-1458493003-1196180957=:5842--\r\n\n\r\n--0-918353418-1196180957=:5842\r\nContent-Type: audio/mpeg; name=&quot;12-470-thisisntbrucelisten.mp3&quot;\r\nContent-Description: 3064767906-12-470-thisisntbrucelisten.mp3\r\nContent-Disposition: attachment; filename=&quot;12-470-thisisntbrucelisten.mp3&quot;\r\n\r\n[ Attachment content not displayed ]\r\n--0-918353418-1196180957=:5842\r\nContent-Type: audio/mpeg; name=&quot;12-470-theresmike.mp3&quot;\r\nContent-Description: 2979158178-12-470-theresmike.mp3\r\nContent-Disposition: attachment; filename=&quot;12-470-theresmike.mp3&quot;\r\n\r\n[ Attachment content not displayed ]\r\n--0-918353418-1196180957=:5842--"}