{"id": "3382", "subject": "Re: RCA 12-470 RADIO SHACK HACK FILES", "author": "Lance Oliver", "timestamp": "2007-11-27T19:37:45Z", "full_text": "Hi,\n\nWould you please explain what you mean by &quot;choose the location \ncarefully&quot;? \n\nThank You,\nLance\nDAPS\n\n--- In EVP-ITC@yahoogroups.com, &quot;psi_research&quot; &lt;vilhellm@...&gt; wrote:\n&gt;\n&gt; Bruce I tend to agree with on everything you just stated. I cherish \nmy\n&gt; FB and even though I must choose the location carefully with it it&#39;s\n&gt; the messages that come through that make it profound. But the Shack\n&gt; Hack is an important development, the timing of it is ironic\n&gt; considering other recent Box developments. \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;bhali333&quot;\n&gt; &lt;paranormalinvestigating@&gt; wrote:\n&gt; &gt;\n&gt; &gt; HEY GUY&#39;S \n&gt; &gt; \n&gt; &gt; OF COURSE I HAVE MY RS HACK AND GETTING RESULTS THE FIRST DAY.\n&gt; &gt; MY INITIAL OPINION OF THE PERFORMANCE OF THIS LITTLE GEM IS FROM \nTWO \n&gt; &gt; EXPERIMENTAL SESSIONS ONE PERFORMED BY STEVE HULTAY AND MYSELF \nAND \n&gt; &gt; THE OTHER BY MYSELF ALONE. THE FILES I HAVE POSTED ARE GLEENED \nFROM \n&gt; &gt; ONLY THE FIRST MINUTE OR SO OF A TEN MINUTE RECORDING.PLEASE TAKE \nA \n&gt; &gt; MINUTE TO LISTEN AND POST YOUR FEEDBACK.\n&gt; &gt; \n&gt; &gt; THE FILES ARE POSTED IN THE FILE SECTION UNDER: \n&gt; &gt; \n&gt; &gt; 11-26-07_radio shack hack files_Bruce \n&gt; &gt; \n&gt; &gt; AFTER DOING ONLY ONE RECORDED SESSION AND TWO SESSIONS TOTAL. I \nAS A \n&gt; &gt; SERIOUS BOX RESEARCHER WITH EVRYDAY EXPERIMENTING ON \nFRANK&#39;S,JOE&#39;S \n&gt; &gt; AND NOW THE RADIO SHACK HACK BOX CAN PREMATURELY SAY THAT THIS \nRADIO \n&gt; &gt; MAY BE SMALL IN SIZE BUT IT PACKS A BIG PUNCH ! AND IT WAS UNDER \nOUR \n&gt; &gt; VERY NOSES ALL THE TIME. THANKS TO SUM DUC FOR HIS INSIGHT IN \n&gt; &gt; DISCOVERING IT.\n&gt; &gt; \n&gt; &gt; AT THE RISK OF SOUNDING REDUNDENT I MUST REITERATE THIS RS BOX \nWILL \n&gt; &gt; HOLD IT&#39;S OWN WITH THE BIG BOYS. THE RESULTS AND LEVEL OF \n&gt; &gt; COMMUNICATION BOTH IN REAL TIME DURING A SESSION AND WHAT IS \nMISSED \n&gt; &gt; BY OUR RUDIMENTARY HUMAN HEARING AND CAUGHT ON A RECORDING RIVALS \nOR \n&gt; &gt; MAY EVEN GIVEN ENOUGH TIME FOR FREQUENCY IMPRINTING BY OUR SPIRIT \n&gt; &gt; FRIENDS AND PROPER RESEARCH METHODS WILL SURPASS JOE&#39;S BOX AND \nPULL A \n&gt; &gt; CLOSE SECOND TO FRANK&#39;S BOX. \n&gt; &gt; \n&gt; &gt; AS A MATTER OF FACT MY FIRST IMPRESSION OF THE RS BOX WAS \nREMINICENT \n&gt; &gt; OF THE AM LINEAR MODE OF MY FRANKS BOX #12. LET&#39;S FACE IT A \nFRANKS \n&gt; &gt; BOX IS A FRANKS BOX IN AS NO TWO ARE EXACTLY THE SAME THAT IS \nWHAT \n&gt; &gt; MAKES THEM SO UNIQUE AND ALSO THE FACT THAT I BELIEVE A SMALL \nPART OF \n&gt; &gt; FRANK HIMSELF TRANSFERS INTO EVERY BOX HE MAKES AND HE IS VERY \nWELL \n&gt; &gt; RESPECTED ON THE OTHER SIDE FROM WHAT MY GUIDES AND TECHS TELL ME.\n&gt; &gt; \n&gt; &gt; I HAVE NOT HAD THE OPPORTUNITY TO USE RON RICKETS MINI BOX YET \nBUT I \n&gt; &gt; AM HEARING VERY GOOD THINGS ABOUT IT&#39;S PERFORMANCE ALSO AND CAN \nNOT \n&gt; &gt; WAIT TO EXPERIMENT WITH IT.\n&gt; &gt; \n&gt; &gt; I THINK OUR FRIENDS ON THE OTHER SIDE ARE FINALY DECIDING TO PUSH \n&gt; &gt; FORWARD WITH THE COMMUNICATION PROCESS AND ALLOW IT TO BECOME \n&gt; &gt; ACCESABLE TO MANY MORE PEOPLE. WHAT THEY HAVE CONVEYED TO ME OVER \n&gt; &gt; NUMEROUS SESSIONS IS THE DESPERATE AND INTRIGAL NEED FOR COMBINED \n&gt; &gt; HARMONY AMONG RESEARCHERS AND COMMUNICATORS. THE MORE MINDS THAT \nARE \n&gt; &gt; THINKING AND MOVING TOGETHER FOR THIS COMMON GOAL THE STRONGER \nTHE \n&gt; &gt; SPIRITS ABILITY TO COMMUNICATE AND THEY WILL HELP WITH DEVELOPE \nMENT \n&gt; &gt; OF THE TECHNOLOGY SO THINGS ARE LOOKING UP AND HEADING TO THE \nFUTURE. \n&gt; &gt; \n&gt; &gt; WHAT I HAVE GATHERED OVER MANY SESSIONS IS THEY DEFINATELY WANT \nTHE \n&gt; &gt; WORD AND THE TECHNOLOGY SPREAD TO AS MANY AS ARE WILLING TO \nACCEPT IT \n&gt; &gt; WITH AN OPEN MIND. I AM RATTLING ON AND HAVE DRIFTED FROM MY \nORIGINAL \n&gt; &gt; POINT WHICH WAS, THIS RADIO SHACK BOX IS AND WILL BE A VERY \nIMPORTANT \n&gt; &gt; AND USEFULL TOOL IN FURTHERING OUR COMMUNICATION PROCESS.\n&gt; &gt; \n&gt; &gt; THANKS FOR LISTENING.\n&gt; &gt; \n&gt; &gt; BRUCE\n&gt; &gt;\n&gt;"}