{"id": "3391", "subject": "Re: One from ghostman", "author": "Lance Oliver", "timestamp": "2007-11-27T20:20:40Z", "full_text": "Hola Frank!\n\nIn a nutshell I&#39;d say it&#39;s all about the the worst four letter word \nof the english language - Fear.\n\nIf you couple that with some people&#39;s perceived loss of control over \nthe minds and hearts of others, not to mention cutting their profits, \nit&#39;s no stretch of the imagination to see those sort of discussions \nfor what they are. \n\nI&#39;ve read and studied ITC for many years. I&#39;ve long waited for some \ndevice, like my friend Ron&#39;s now making, to come along for me to \nactually experiment with. If anything, ITC research points out the  \ngrantedly subjective need for cooperation and harmony among \nresearchers, which I&#39;ve heard is due to the higher levels of \nvibration in the dimension some go to after this life.\n\nJust find your own place within of peace and tranquility. Bozo&#39;s like \nhim only have as much voice and power as we ourselves give them. But \nif you really want to mentally slap onery folks like that, why not \nask them if they&#39;re planning another Salem Witch Trial. We all should \nknow just how badly that is now seen, not to mention that Salem&#39;s now \nwitch central of the planet. Law of attraction in action!\n\nMy dream is to help in some way to build a bridge of communication \nwith the otherside, so the agony and anguish of loosing love ones can \nbe ended forever. Life is eternal!\n\nKeep up the good work Frank, Ron and everyone else!!\n\nLance\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@...&gt; \nwrote:\n&gt;\n&gt; \n&gt;  I&#39;m torqued again! I was told yesterday by ------if ya believe \nthat horse crap,  that what we are getting is &#39;false communication&#39;. \nNot only that, that we are only getting the &#39;bad guys&#39;. So which is \nit, false communication, which is no commnunication, or is it evil \nspirits. To make it worse, this idiot implies he has the backing of \nthe -------, and the church believes we are letting evil into the \nworld.    I took this as a severe slap to the face, very insulting to \nme, and every paranormal researcher in the world. He claims the &#39;real \nvoices&#39; he gets are made out of white noise combined with broadcast \nfragments. Duffus!! That is exactly the kind of voices the living \nmind creates to get the voices it wants to hear. Yet only his are the \nreal voices! My old friend, you can take your &#39;serious session&#39; and \nyour bishop, and shove &#39;em.    My apoplogies to the group, but I know \nthis will get forwarded, and this bozo finds me so easy to dismiss, \nthat normal e-mail would be useless.   I had to cut some out for nice \nsakes.   Frank-S\n&gt; _________________________________________________________________\n&gt; Put your friends on the big screen with Windows Vista + Windows \nLive.\n&gt; http://www.microsoft.com/windows/shop/specialoffers.mspx?\nocid=TXT_TAGLM_CPC_MediaCtr_bigscreen_102007\n&gt;"}