{"id": "3393", "subject": "Re: One from ghostman", "author": "Lance Oliver", "timestamp": "2007-11-27T20:23:57Z", "full_text": "LOL!\n\nTalking to a hot ghost isn&#39;t something I&#39;d be opposed to... but good \ndialog with others is a boon no matter what they look like.\n\nLance\n\n\n--- In EVP-ITC@yahoogroups.com, Misty Dawn &lt;bulletbabea@...&gt; wrote:\n&gt;\n&gt; I can hear that, I hear the miss pimples part a lil different &quot;what \ni miss are the dimples, only investigate if its a hot ghost&quot; Rest I \nhear same as you. \n&gt;    \n&gt;   Well at least someone is playin nice LOL thats a good approach \ntho I think everyone who knows ya can fill in those blanks quite \neasily for themselves. \n&gt;    \n&gt;   Misty\n&gt; \n&gt; Frank Sumption &lt;franks-boxes@...&gt; wrote:\n&gt;            I&#39;m torqued again! I was told yesterday by ------if ya \nbelieve that horse crap,  that what we are getting is &#39;false \ncommunication&#39;. Not only that, that we are only getting the &#39;bad \nguys&#39;. So which is it, false communication, which is no \ncommnunication, or is it evil spirits. To make it worse, this idiot \nimplies he has the backing of the -------, and the church believes we \nare letting evil into the world.  \n&gt;  \n&gt;  I took this as a severe slap to the face, very insulting to me, \nand every paranormal researcher in the world. He claims the &#39;real \nvoices&#39; he gets are made out of white noise combined with broadcast \nfragments. Duffus!! That is exactly the kind of voices the living \nmind creates to get the voices it wants to hear. Yet only his are the \nreal voices! My old friend, you can take your &#39;serious session&#39; and \nyour bishop, and shove &#39;em. \n&gt;  \n&gt;  \n&gt;  My apoplogies to the group, but I know this will get forwarded, \nand this bozo finds me so easy to dismiss, that normal e-mail would \nbe useless. \n&gt;  \n&gt;  I had to cut some out for nice sakes. \n&gt;  \n&gt;  Frank-S\n&gt; \n&gt;   \n&gt; ---------------------------------\n&gt;   Get the power of Windows + Web with the new Windows Live. Power \nup!   \n&gt; \n&gt;                          \n&gt; \n&gt;        \n&gt; ---------------------------------\n&gt; Be a better sports nut! Let your teams follow you with Yahoo \nMobile. Try it now.\n&gt;"}