{"id": "3403", "subject": "Re: [EVP-ITC] One from ghostman", "author": "Lisby", "timestamp": "2007-11-28T01:19:22Z", "full_text": "Care to share this e-mail?\n\nA.\n\nOn Nov 27, 2007, at 12:26 PM, Frank Sumption wrote:\n\n&gt;  I&#39;m torqued again! I was told yesterday by ------if ya believe  \n&gt; that horse crap,  that what we are getting is &#39;false  \n&gt; communication&#39;. Not only that, that we are only getting the &#39;bad  \n&gt; guys&#39;. So which is it, false communication, which is no  \n&gt; commnunication, or is it evil spirits. To make it worse, this idiot  \n&gt; implies he has the backing of the -------, and the church believes  \n&gt; we are letting evil into the world.\n&gt;\n&gt;  I took this as a severe slap to the face, very insulting to me,  \n&gt; and every paranormal researcher in the world. He claims the &#39;real  \n&gt; voices&#39; he gets are made out of white noise combined with broadcast  \n&gt; fragments. Duffus!! That is exactly the kind of voices the living  \n&gt; mind creates to get the voices it wants to hear. Yet only his are  \n&gt; the real voices! My old friend, you can take your &#39;serious session&#39;  \n&gt; and your bishop, and shove &#39;em.\n&gt;\n&gt;\n&gt;  My apoplogies to the group, but I know this will get forwarded,  \n&gt; and this bozo finds me so easy to dismiss, that normal e-mail would  \n&gt; be useless.\n&gt;\n&gt;  I had to cut some out for nice sakes.\n&gt;\n&gt;  Frank-S\n&gt;\n&gt;\n&gt; Get the power of Windows + Web with the new Windows Live. Power up!\n&gt;\n&gt;  &lt;MissPimples--InvestigateIfIt&#39;sAHotGhost.mp3&gt;\n\n\nCa e o sha e his e-mail?A.On No 27, 2007, a 12:26 PM, F ank Sump ion w o e:  I'm o qued again! I was old yes e day by ------i ya belie e ha ho se c ap,  ha wha we a e ge ing is ' alse communica ion'. No only ha , ha we a e only ge ing he 'bad guys'. So which is i , alse communica ion, which is no commnunica ion, o is i e il spi i s. To make i wo se, his idio implies he has he backing o he -------, and he chu ch belie es we a e le ing e il in o he wo ld.    I ook his as a se e e slap o he ace, e y insul ing o me, and e e y pa ano mal esea che in he wo ld. He claims he ' eal oices' he ge s a e made ou o whi e noise combined wi h b oadcas agmen s. Du us!! Tha is exac ly he kind o oices he li ing mind c ea es o ge he oices i wan s o hea . Ye only his a e he eal oices! My old iend, you can ake you 'se ious session' and you bishop, and sho e 'em.    My apoplogies o he g oup, bu I know his will ge o wa ded, and his bozo inds me so easy o dismiss, ha no mal e-mail would be useless.   I had o cu some ou o nice sakes.   F ank-SGe he powe o Windows + Web wi h he new Windows Li e. Powe up!"}