{"id": "3418", "subject": "RACHEL FILES - I posted a bit of the Rachel collection for all.", "author": "Misty Dawn", "timestamp": "2007-11-28T10:21:29Z", "full_text": "--0-220560232-1196245289=:92503\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nAs most of you know by now as a child I grew up hearing constant chatter nightly from a man and a woman. Thier voices always sounded like a tv playing in the other room but there would be no television on and no man and woman visible.\n   \n  When I moved some of the strangeness followed tho I never heard her voice again until I returned to that old house. Once I left again I didnt hear it again until I happened to start capturing thier speech in evp research. Once I realized I was able to do this and pump up the volume, replay etcetera her voice returned. Only this time I often hear her clearly thanks to technology being what it is.\n   \n  For the longest time I had no clue who she was just that now and then I would hear &quot;that womans&quot; voice pop up in my evp. Also when I started doing this research many spirits spoke of a woman named Rachel. Visiting Rachel&#39;s house, talking about her like she was an angel or a guide or even thier grandmother. One day i decided to ask a simple question. What was the name of the woman who was speaking, and the reply I got quite stunned me. It was &quot;her&quot; voice saying the name Rachel. In some weird way it made some sort of crazy sense. All this time this spirit has been around me and I dont have the foggiest idea who she is just that for some reason she has an interest in hanging around me for over 30 years now. I never saw her as a negative just slightly annoying and maybe a bit spooky as a kid hehehe\n   \n  On one hand it was quite disturbing growing up with that...on the other its quite comforting to me now to have placed some details on that &quot;figment of my imagination&quot; I was forced to live with. Shined a bit of light on the subject for me quite literally. \n   \n  Anyways a short while back it occurred to me that I should start collecting her files together in one collection so I started to do that. When I run across them in my archives I copy them over or when I record a new one I will copy it over. I plan to do the same for Otto...he has quite a number of files tho he rarely speaks the others are always quick to fill in details of what hes doing. \n   \n  Anyway check it out when you get a chance. I think if you can hear the evp at all that in quite a few you may hear the similarity in her voice, her way of speaking, and her tone. I dont expect you to hear all of it but I think most will hear quite a few of them.\n   \n  Enjoy\n  http://www.esnips.com/web/RachelFiles\n   \n  http://www.esnips.com/user/MistyDawn if link above gives problems\n   \n  Misty\n\n       \n---------------------------------\nNever miss a thing.   Make Yahoo your homepage.\r\n--0-220560232-1196245289=:92503\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;div&gt;As most of you know by now as a child I grew up hearing constant chatter nightly from a man and a woman. Thier voices always sounded like a tv playing in the other room but there would be no television on and no man and woman visible.&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;When I moved some of the strangeness followed tho I never heard her voice again until I returned to that old house. Once I left again I didnt hear it again until I happened to start capturing thier speech in evp research. Once I realized I was able to do this and pump up the volume, replay etcetera her voice returned. Only this time I often hear her clearly thanks to technology being what it is.&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;For the longest time I had no clue who she was just that now and then I would hear &quot;that womans&quot; voice pop up in my evp. Also when I started doing this research many spirits spoke of a woman named Rachel. Visiting Rachel&#39;s house, talking about her like she was an angel or a guide or\n even thier grandmother. One day i decided to ask a simple question. What was the name of the woman who was speaking, and the reply I got quite stunned me. It was &quot;her&quot; voice saying the name Rachel. In some weird way it made some sort of crazy sense. All this time this spirit has been around me and I dont have the foggiest idea who she is just that for some reason she has an interest in hanging around me for over 30 years now. I never saw her as a negative just slightly annoying and maybe a bit spooky as a kid hehehe&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;On one hand it was quite disturbing growing up with that...on the other its quite comforting to me now to have placed some details on that &quot;figment of my imagination&quot; I was forced to live with. Shined a bit of light on the subject for me quite literally. &lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Anyways a short while back it occurred to me that I should start collecting her files together in one collection so I started to do that. When I\n run across them in my archives I copy them over or when I record a new one I will copy it over. I plan to do the same for Otto...he has quite a number of files tho he rarely speaks the others are always quick to fill in details of what hes doing. &lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Anyway check it out when you get a chance. I think if you can hear the evp at all that in quite a few you may hear the similarity in her voice, her way of speaking, and her tone. I dont expect you to hear all of it but I think most will hear quite a few of them.&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Enjoy&lt;/div&gt;  &lt;div&gt;&lt;A href=&quot;http://www.esnips.com/web/RachelFiles&quot;&gt;http://www.esnips.com/web/RachelFiles&lt;/A&gt;&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;&lt;A href=&quot;http://www.esnips.com/user/MistyDawn&quot;&gt;http://www.esnips.com/user/MistyDawn&lt;/A&gt;&nbsp;if link above gives problems&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Misty&lt;/div&gt;&lt;p&gt;&#32;\n\n      &lt;hr size=1&gt;Never miss a thing.  &lt;a href=&quot;http://us.rd.yahoo.com/evt=51438/*http://www.yahoo.com/r/hs&quot;&gt; Make Yahoo your homepage.&lt;/a&gt;\n\n\r\n--0-220560232-1196245289=:92503--"}