{"id": "3442", "subject": "Re: ADDING TO THE IMPORTANT MESSAGE", "author": "Lance Oliver", "timestamp": "2007-11-28T22:39:27Z", "full_text": "Hello Bruce,\n\nForgive me for bluntness, but typing in all capital letters is \nconsidered to be shouting by some of us. It&#39;s also hard to follow. \n\nAbsolutely no offense intended... I just thought you should know.\n\nThanks,\nLance\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;bhali333&quot; \n&lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt;  HI GUY&#39;S JUST A SHORT EXPLANATION OF WHAT I HAVE BEEN ABLE TO \nGATHER.\n&gt; \n&gt; \n&gt; \n&gt; ANYONE THAT IS A SERIOUS EVP RESEARCHER HAS PROBABLY READ THE \nARTICLES \n&gt; AND OR BOOKS PERTAINING TO THE EALY TIME STREAM EXPERIMENTS AND \nWHAT \n&gt; WAS CALLED THE CIRCLE OF LIGHT. IT INVOLVED SUCH RESEARCHERS AS \nMAGGY \n&gt; HERSHBACH AND HER HUSBAND THAT WHERE THE RECIPIENTS OF LONG LENGTHY \n&gt; MESSAGES IN ALL DIFFERENT FORMATS FROM THE SPIRIT WORLD THEY IN \nTURN \n&gt; WORKED WITH SUCH EVP PIONEERS AS HANS MUELLER, KONSTANTINE \n&gt; RAUDIVA,GEORGE MEEK AND MARK MACY TO NAME A FEW. THESE EARLY \nPIONEERS \n&gt; THROUGH THE HERSHBACHS IN LUXEMBORG RECIEVED DETAILED INSTRUCTIONS \nON \n&gt; HOW TO FURTHER COMMUNICATION THAT NOT ONLY LED TO OUR CURRENT EVP \n&gt; GATHERING TECHNIQUES BUT ALSO THE MOTHER OF ALL BOXES THE SPIRICOM.\n&gt; THESE RESEARCHERS WERE TOLD THE MOST IMPORTANT INGREDIANT IN THE \n&gt; STRENGTH AND FURTHERENCE OF SPIRIT COMMUNICATION WAS HARMONY AND \nPEACE \n&gt; AND GOOD INTENTIONS WITHIN THIS CIRCLE THEY HAD BEEN LED TO FORM.\n&gt; \n&gt; BUT SADLY AS HUMAN BEINGS USUALLY DO JELOUSY AND EGO BECAME A \nPOISON TO \n&gt; THE CIRCLE AND SOME INDIVIDUALS THAT WHERE ENVIOUS OF OTHERS \nSUPERIOR \n&gt; SUCESSES BROUGHT BAD VIBRATIONSS TO THE GROUP AND THE CIRCLE WAS \nBROKEN.\n&gt; \n&gt; IMMEDIATLY FOLLOWING THE ADVANCED COMMUNICATION THAT HAD BEEN \nENJOYED \n&gt; FOR A NUMBER OF YEARS SLOWLY DWINDLED AWAY.\n&gt; \n&gt; NOW I BELIEVE WE ARE BEING GIVEN A SECOND CHANCE TO ACCOMPLISH THIS \n&gt; UNPRESIDENTED TASK AND BRIDGE THE GAP OF COMMUNICATION FULLY.\n&gt; AS OF LATE THERE HAS BEEN A FLOOD OF NEW TECHNOLOGY THAT SEEMS TO \nBE \n&gt; WORKING AS HOPED WE ARE IN OUR FETAL STAGES BUT I HAVE BEEN TOLD WE \n&gt; WILL BE BROUGHT ALONG SLOWELY AND CAREFULLY.\n&gt; \n&gt; SO MY THOUGHTS ARE LETS KEEP THE GOOD VIBES AND HARMONY GOING AND \nBLOCK \n&gt; AS MUCH OF THE NEGATIVITY AS WE CAN AND ALL WORK TOGETHER TWORD \nTHIS \n&gt; COMMON GOAL. LETS NOT LET THE SINS OF OUR FATHER SO TO SPEAK AFFECT \n&gt; WHAT WE CAN ACCOMPLISH.\n&gt; \n&gt; BRUCE HALLIDAY\n&gt;"}