{"id": "3460", "subject": "Re: ADDING TO THE IMPORTANT MESSAGE", "author": "Steve Hultay", "timestamp": "2007-11-29T01:57:13Z", "full_text": "The first one i hear &quot;Ghost would Talk&quot;.  The first part says &quot;You \nare the mover&quot; or something with the &quot;M&quot; sound in it.  I would \ndisregard the first part and say the file says &quot;Ghosts would talk&quot;, \ni think that is the message.  The second one i hear exactly like you \nand everyone else would hear it too.  Very clear, i don&#39;t know what \nit means but very clear.  \n\n-Steve H.\n\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@...&gt; \nwrote:\n&gt;\n&gt; \n&gt; One thing we have that they do not--Purple Princess! That other \nstuff not matter.\n&gt;  \n&gt;  Frank-s\n&gt; \n&gt; \n&gt; To: EVP-ITC@...: ursulabielski@...: Wed, 28 Nov 2007 16:44:58 -\n0800Subject: Re: [EVP-ITC] Re: ADDING TO THE IMPORTANT MESSAGE\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Bruce,\n&gt; I just wanted to drop a line and say Amen!   Granted, the \nelectronic element is the &#39;e&#39; in EVP (and the &#39;i&#39; in ITC), but the \nmost accomplished researchers (including Maggy and Jules, Konstantin \nand Friedrich, and yes, Mark Macy, insist that if you have the \nharmony, love, and RESONANCE among researchers, all the electronic \nproblems can be overcome.  \n&gt; Is anyone involved in the AA-EVP &#39;Big Circle&#39; group?  I see that \nthey attempt contact all at once from their own homes around the \ncountry, I think on Thursday evenings at a set time.\n&gt; Is anyone interested in this?  From what I see, and from my own \nnew interest, it seems most of us try contacts as much as possible \nthroughout the day.  Anyone want to try a set time?\n&gt; UrsulaLance Oliver &lt;orbhunterx@...&gt; wrote:\n&gt; \n&gt; \n&gt; Hello Bruce,Forgive me for bluntness, but typing in all capital \nletters is considered to be shouting by some of us. It&#39;s also hard \nto follow. Absolutely no offense intended... I just thought you \nshould know.Thanks,Lance--- In EVP-ITC@yahoogroups.com, &#39;bhali333&#39; \n&lt;paranormalinvestigating@&gt; wrote:&gt;&gt; HI GUY&#39;S JUST A SHORT \nEXPLANATION OF WHAT I HAVE BEEN ABLE TO GATHER.&gt; &gt; &gt; &gt; ANYONE THAT \nIS A SERIOUS EVP RESEARCHER HAS PROBABLY READ THE ARTICLES &gt; AND OR \nBOOKS PERTAINING TO THE EALY TIME STREAM EXPERIMENTS AND WHAT &gt; WAS \nCALLED THE CIRCLE OF LIGHT. IT INVOLVED SUCH RESEARCHERS AS MAGGY &gt; \nHERSHBACH AND HER HUSBAND THAT WHERE THE RECIPIENTS OF LONG LENGTHY \n&gt; MESSAGES IN ALL DIFFERENT FORMATS FROM THE SPIRIT WORLD THEY IN \nTURN &gt; WORKED WITH SUCH EVP PIONEERS AS HANS MUELLER, KONSTANTINE &gt; \nRAUDIVA,GEORGE MEEK AND MARK MACY TO NAME A FEW. THESE EARLY \nPIONEERS &gt; THROUGH THE HERSHBACHS IN LUXEMBORG RECIEVED DETAILED \nINSTRUCTIONS ON &gt; HOW TO FURTHER COMMUNICATION THAT NOT ONLY LED TO \nOUR CURRENT EVP &gt; GATHERING TECHNIQUES BUT ALSO THE MOTHER OF ALL \nBOXES THE SPIRICOM.&gt; THESE RESEARCHERS WERE TOLD THE MOST IMPORTANT \nINGREDIANT IN THE &gt; STRENGTH AND FURTHERENCE OF SPIRIT COMMUNICATION \nWAS HARMONY AND PEACE &gt; AND GOOD INTENTIONS WITHIN THIS CIRCLE THEY \nHAD BEEN LED TO FORM.&gt; &gt; BUT SADLY AS HUMAN BEINGS USUALLY DO \nJELOUSY AND EGO BECAME A POISON TO &gt; THE CIRCLE AND SOME INDIVIDUALS \nTHAT WHERE ENVIOUS OF OTHERS SUPERIOR &gt; SUCESSES BROUGHT BAD \nVIBRATIONSS TO THE GROUP AND THE CIRCLE WAS BROKEN.&gt; &gt; IMMEDIATLY \nFOLLOWING THE ADVANCED COMMUNICATION THAT HAD BEEN ENJOYED &gt; FOR A \nNUMBER OF YEARS SLOWLY DWINDLED AWAY.&gt; &gt; NOW I BELIEVE WE ARE BEING \nGIVEN A SECOND CHANCE TO ACCOMPLISH THIS &gt; UNPRESIDENTED TASK AND \nBRIDGE THE GAP OF COMMUNICATION FULLY.&gt; AS OF LATE THERE HAS BEEN A \nFLOOD OF NEW TECHNOLOGY THAT SEEMS TO BE &gt; WORKING AS HOPED WE ARE \nIN OUR FETAL STAGES BUT I HAVE BEEN TOLD WE &gt; WILL BE BROUGHT ALONG \nSLOWELY AND CAREFULLY.&gt; &gt; SO MY THOUGHTS ARE LETS KEEP THE GOOD \nVIBES AND HARMONY GOING AND BLOCK &gt; AS MUCH OF THE NEGATIVITY AS WE \nCAN AND ALL WORK TOGETHER TWORD THIS &gt; COMMON GOAL. LETS NOT LET THE \nSINS OF OUR FATHER SO TO SPEAK AFFECT &gt; WHAT WE CAN ACCOMPLISH.&gt; &gt; \nBRUCE HALLIDAY&gt;\n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Your smile counts. The more smiles you share, the more we donate. \nJoin in.\n&gt; www.windowslive.com/smile?ocid=TXT_TAGLM_Wave2_oprsmilewlhmtagline\n&gt;"}