{"id": "3466", "subject": "Re: RS 12-469 HackII Lives!", "author": "psi_research", "timestamp": "2007-11-29T03:07:32Z", "full_text": "I still like the idea of an audio sampler capturing your own voice to \nuse as the raw audio then slice and scramble it than play it back. It \nwould be a real time hardware version of EVP Maker. It wouldn&#39;t rely \non radio reception and if the spirits are able to manipulate \nthe &quot;randomness&quot; of the scramble then it could be interesting.\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@...&gt; \nwrote:\n&gt;\n&gt; \n&gt;  I downloaded a PIC tutorial, but it takes time for old dogs to \nlearn the new stuff. \n&gt;  \n&gt;  Frank-s\n&gt; \n&gt; \n&gt; To: EVP-ITC@...: duck@...: Wed, 28 Nov 2007 16:55:26 -0700Subject: \nRe: [EVP-ITC] RS 12-469 HackII Lives!\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Frank,\n&gt;  \n&gt; It can all be done on a single chip. I&#39;ll work on a proto next week \nwhen I get time.\n&gt;  \n&gt; -Sum\n&gt;  \n&gt; \n&gt; ----- Original Message ----- \n&gt; From: Frank Sumption \n&gt; To: evp-itc@yahoogroups.com \n&gt; Sent: Wednesday, November 28, 2007 4:47 PM\n&gt; Subject: RE: [EVP-ITC] RS 12-469 HackII Lives!\n&gt; \n&gt; \n&gt; Thanks, right now it&#39;s just an idea to try to find a solution of no \nor few radio stations in remote areas, such as the Stanley in \nColorado. I could still use the white noise transistor, and schmitt \ntrggers to convert pulse to random number, the feed a 1 of 10 counter \nor something. I&#39;m kinda behind on digital. I have a PIC chip keyer, \nbut bought it already programmed.   As wth all of this stuff, I \ncouldn&#39;t care less who actually does it.  Frank-S\n&gt; \n&gt; \n&gt; To: EVP-ITC@...: w9sz@...: Wed, 28 Nov 2007 16:56:26 -0600Subject: \nRE: [EVP-ITC] RS 12-469 HackII Lives!\n&gt; \n&gt; \n&gt; I wrote the code for a pseudo-random number generator using a PIC \nsome years ago. I&#39;ll see if I can dig it up.ZackOn Wed, 28 Nov 2007, \nFrank Sumption wrote:&gt;&gt; Now all we need is a pic chip to output \nrandom numbers which can be used to turn on and off switches that \nallow fixed tones through to a mixer/amplifier---Instant Spiricom! \nI&#39;m thinking use op amp square wave generators, and switch them in \nand out using something like the old 4066 chips. The goal being to \nhave a system that works without the presence of radio stations, such \nas remote investigations, and eliminate the concern that we&#39;re just \ncreating the messages in our minds trying make sense out of random \nvoice fragments.&gt;&gt; Frank-S&gt;\n&gt; \n&gt; Share life as it happens with the new Windows Live. Share now! \n&gt; \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Share life as it happens with the new Windows Live.Download today \nit&#39;s FREE!\n&gt; http://www.windowslive.com/share.html?\nocid=TXT_TAGLM_Wave2_sharelife_112007\n&gt;"}