{"id": "3468", "subject": "RE: [EVP-ITC] RS 12-469 HackII Lives!", "author": "Zack Widup", "timestamp": "2007-11-29T04:17:24Z", "full_text": "It just takes a little time if you understand the basics.  All the \ndifferent devices have their own nuances and peculiarities, advantages and \ndisadvantages. AVR&#39;s run faster than PIC&#39;s due to architecture, and the \ncode in an AVR for a given routine is generally 3/4 to 2/3 the size of a \nPIC program to do the same thing.\n\nThe AVR users&#39; slogan, BTW, is &quot;Come over to the dark side.&quot;\n:-)\n\nZack\n\nOn Wed, 28 Nov 2007, Frank Sumption wrote:\n\n&gt;\n&gt; I downloaded a PIC tutorial, but it takes time for old dogs to learn the new stuff.\n&gt;\n&gt; Frank-s\n&gt;\n&gt;\n&gt; To: EVP-ITC@yahoogroups.comFrom: duck@...: Wed, 28 Nov 2007 16:55:26 -0700Subject: Re: [EVP-ITC] RS 12-469 HackII Lives!\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Frank,\n&gt;\n&gt; It can all be done on a single chip. I&#39;ll work on a proto next week when I get time.\n&gt;\n&gt; -Sum\n&gt;\n&gt;\n&gt; ----- Original Message -----\n&gt; From: Frank Sumption\n&gt; To: evp-itc@yahoogroups.com\n&gt; Sent: Wednesday, November 28, 2007 4:47 PM\n&gt; Subject: RE: [EVP-ITC] RS 12-469 HackII Lives!\n&gt;\n&gt;\n&gt; Thanks, right now it&#39;s just an idea to try to find a solution of no or few radio stations in remote areas, such as the Stanley in Colorado. I could still use the white noise transistor, and schmitt trggers to convert pulse to random number, the feed a 1 of 10 counter or something. I&#39;m kinda behind on digital. I have a PIC chip keyer, but bought it already programmed.   As wth all of this stuff, I couldn&#39;t care less who actually does it.  Frank-S\n&gt;\n&gt;\n&gt; To: EVP-ITC@yahoogroups.comFrom: w9sz@...: Wed, 28 Nov 2007 16:56:26 -0600Subject: RE: [EVP-ITC] RS 12-469 HackII Lives!\n&gt;\n&gt;\n&gt; I wrote the code for a pseudo-random number generator using a PIC some years ago. I&#39;ll see if I can dig it up.ZackOn Wed, 28 Nov 2007, Frank Sumption wrote:&gt;&gt; Now all we need is a pic chip to output random numbers which can be used to turn on and off switches that allow fixed tones through to a mixer/amplifier---Instant Spiricom! I&#39;m thinking use op amp square wave generators, and switch them in and out using something like the old 4066 chips. The goal being to have a system that works without the presence of radio stations, such as remote investigations, and eliminate the concern that we&#39;re just creating the messages in our minds trying make sense out of random voice fragments.&gt;&gt; Frank-S&gt;\n&gt;\n&gt; Share life as it happens with the new Windows Live. Share now!\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; _________________________________________________________________\n&gt; Share life as it happens with the new Windows Live.Download today it&#39;s FREE!\n&gt; http://www.windowslive.com/share.html?ocid=TXT_TAGLM_Wave2_sharelife_112007"}