{"id": "3470", "subject": "Re: ADDING TO THE IMPORTANT MESSAGE", "author": "Steve Hultay", "timestamp": "2007-11-29T12:12:05Z", "full_text": "I don&#39;t think it all means nothing, but some of it does.  They want \nto see how far they can push us until we give up.  Not all have good \nintentions over there, just like on our side.  We also have good and \nbad, but we learn to deal with both.\n\n-Steve H.\n\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@...&gt; \nwrote:\n&gt;\n&gt; \n&gt; I don&#39;t know, the fact that no one hears the same is frustrating. \nWhat if it all means nothing!?\n&gt; \n&gt; \n&gt; To: EVP-ITC@...: urkel23@...: Thu, 29 Nov 2007 02:31:02 \n+0000Subject: [EVP-ITC] Re: ADDING TO THE IMPORTANT MESSAGE\n&gt; \n&gt; \n&gt; \n&gt; Ok, than i hear it like you do. Isn&#39;t the idea of posting files to \nget different theories on what is heard? What are we comprehending \nin these or any other files anyway? We are just starting to break \nground on full sentence answers, so we need to sift through them and \nmake sense. That one about the earthquake is a great file, but what \ndoes it mean??? It doesn&#39;t make any sense, we have to make sense of \nthese files. Whether it be in reverse, enhancing the audio or \nwhatever. This is our job as researchers, while they laugh their ass \noff on the other side watching us spend hours on the computer to say \nthere is going to be an earthquake somewhere that doesn&#39;t happen. If \nthey say &#39;Steve likes cupcakes in a tree in east asia&#39;, that&#39;s a \ngreat file and it will be clear. But what would it mean and what \neffect will it have on humanity.Nuff Said&#39;-Steve H.--- In EVP-\nITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@&gt; wrote:&gt;&gt; &gt; \nThat&#39;s the problem, get something that is not in human awareness to \nbe recognized, heard, and comprehended. It&#39;s almost impossible. &gt; &gt; \nFrank&gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; \n__________________________________________________________&gt; Put your \nfriends on the big screen with Windows Vista + Windows Live.&gt; \nhttp://www.microsoft.com/windows/shop/specialoffers.mspx?\nocid=TXT_TAGLM_CPC_MediaCtr_bigscreen_102007&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Your smile counts. The more smiles you share, the more we donate. \nJoin in.\n&gt; www.windowslive.com/smile?ocid=TXT_TAGLM_Wave2_oprsmilewlhmtagline\n&gt;"}