{"id": "3479", "subject": "Re: [EVP-ITC] chris(jack ass)moon at it again", "author": "Lisby", "timestamp": "2007-11-29T18:15:35Z", "full_text": "Bruce, all you did was relate Chris&#39;s own words for our inspection.\n\nAnn\n\nOn Nov 29, 2007, at 1:00 PM, bruce halliday wrote:\n\n&gt; Frank,  I know your right, It takes alot for me to lose my temper\n&gt; but what comes out of this guy&#39;s mouth just pushed all my buttons.\n&gt;\n&gt; I apologise for the negative outburst.\n&gt;\n&gt; Bruce\n&gt;\n&gt;\n&gt;\n&gt; Bruce Halliday\n&gt; Paranormal Investigating Team\n&gt;\n&gt;\n&gt;\n&gt; To: evp-itc@yahoogroups.com\n&gt; From: franks-boxes@...\n&gt; Date: Thu, 29 Nov 2007 10:56:21 -0700\n&gt; Subject: RE: [EVP-ITC] chris(jack ass)moon at it again\n&gt;\n&gt; I&#39;m trying to get away for the angry temper crap. That doesn&#39;t  \n&gt; serve anyone.\n&gt;\n&gt;  Frank\n&gt;\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; From: lisby@...\n&gt; Date: Thu, 29 Nov 2007 11:54:03 -0500\n&gt; Subject: Re: [EVP-ITC] chris(jack ass)moon at it again\n&gt;\n&gt; I&#39;ll give him this: he has amazing balls to be using Frank&#39;s device  \n&gt; and tell ing the rest who are also using them that his is the only  \n&gt; one that works. If I were Frank, I&#39;d be beating my head against the  \n&gt; wall. Oh. Wait. He already is.\n&gt;\n&gt; What a total load of ego-driven crap.\n&gt;\n&gt; Chris, if you&#39;re reading, may I suggest that you are the one who is  \n&gt; falling victim to &quot;false&quot; communication? Or that your head is  \n&gt; getting waaaay too big? Or if you already know that you&#39;re just in  \n&gt; it for the cash, that you find another way to pay your bills?\n&gt;\n&gt; You know, though, this same shit has happened to every group of  \n&gt; paranormal researchers since the field began. I&#39;ve watched group  \n&gt; after group come together and explode for thirty years because only  \n&gt; the Chosen had the right to control the message, would broke no  \n&gt; criticism of *any* of their own results *ever*, but had plenty of  \n&gt; definitive pronouncements about everyone else&#39;s.\n&gt;\n&gt; This is why I scoff at the idea of &quot;Harmony,&quot; with the capital H. I  \n&gt; have seen the concept used by everyone from the Warrens in the  \n&gt; 60s-70s to the Harsch-Fischbachs in the early 80s to Moon today  \n&gt; trying to use this idea of being somehow chosen and sacred in order  \n&gt; to get &quot;real&quot; messages from spirit. Harmony is a way to control who  \n&gt; gets to play and IMHO, it&#39;s a load of nonsense.\n&gt;\n&gt; Bruce, I have to tell you that the message you got the other day  \n&gt; about us being all Kumbaya set my alarms off, perhaps innocently,  \n&gt; but nonetheless. I&#39;ve found there is such a fine line between real  \n&gt; peace between brothers working for the real common good and peace  \n&gt; between brothers as a mechanism of control. Yes, we need to be at  \n&gt; peace to work together. But that peace has to be an inclusive  \n&gt; peace. It has to be a peace within one&#39;s self above all else. It  \n&gt; needs to be a *fearless* interior peace, too. The Harmony is  \n&gt; within, folks. It&#39;s not judging whether others have it or not  \n&gt; before we let them play. It is pure, unadulterated *internal*  \n&gt; knowledge about one&#39;s self. Judge not, lest ye be judged--remember  \n&gt; that one?\n&gt;\n&gt; HMO YMMV, toujours,\n&gt;\n&gt; Ann\n&gt;\n&gt;\n&gt; On Nov 29, 2007, at 9:15 AM, bhali333 wrote:\n&gt;\n&gt; Here is a blog steve sent me from moons myspace page as usual he&#39;s in\n&gt; a panic because his fraudulent buisness is going down the tubes. he\n&gt; claims to know the only way box communication can be achieved but who\n&gt; would know better than the box inventor. Frank says it does not\n&gt; matter what means you use it&#39;s the researcher that counts.\n&gt;\n&gt; and if moon is so omnipitent in this research where are the\n&gt; documented recordings of his research, why are they not public for\n&gt; everyone to hear maybe because he&#39;s full of bull. he said recently\n&gt; that no one but him gets legitimate communication, well I think it&#39;s\n&gt; the other way around.\n&gt;\n&gt; chris if you read this, stop the cherade and have some dignity.\n&gt; become a real researcher and stop trying to down everyone else so you\n&gt; can continue to pray on the berieved and desperate people. And while\n&gt; I&#39;m at it, if your so great why are you offering substantial\n&gt; discounts to your so called ghost hunter university. I&#39;ll tell you\n&gt; why, because people are starting to realise you are nothing but a\n&gt; carnival side show palm raeder and have fooled people long enough.\n&gt;\n&gt; the reason I am addresing moon directly on this group is I know he is\n&gt; lurking in the shadows to see what is happening with real researchers\n&gt; and will know at least what I think of him.\n&gt; I have done more legitimate box research in one week than he has done\n&gt; ever. My results are posted I challenge him to do the same.\n&gt;\n&gt; here is a copy of his malicious blog from myspace.\n&gt; chris moon&#39;s blog on myspace this morning ***\n&gt;\n&gt; Wednesday, November 28, 2007\n&gt;\n&gt; The Box has hit the fan!\n&gt; Current mood: distressed\n&gt; Category: Dreams and the Supernatural\n&gt;\n&gt; As so many of you know, I have been the primary tester of the\n&gt; Telephone to the Dead, a.k.a. &quot;Frank&#39;s Box&quot; since 2004, and have had\n&gt; great success using it in paranormal research, and more currently,\n&gt; connecting the living with those on the other side. I have recently\n&gt; been made aware that there are several replica versions of this\n&gt; device being sold. I have also been told of another device that can\n&gt; be purchased for very little from any electronics merchant and\n&gt; altered by hand, producing what some consider to be results. As I\n&gt; expected, the samples that people have sent me are nothing more than\n&gt; timed radio scans that have no validity.\n&gt;\n&gt; What is important to remember, before purchasing any of these replica\n&gt; devices, is that the Spirit Technicians and Spirit Guides on the\n&gt; other side have repeatedly explained that the way that the Telephone\n&gt; to the Dead technology works, is by spirit energy manipulating the\n&gt; random voltage generator (RVG) and using white and pink noise, as\n&gt; well as radio fragment, to create real time voice answers to\n&gt; questions posed from our side. The most important aspect to this\n&gt; device is the medium operator who works as an antenna\n&gt; or &quot;interpreter&quot; for living individuals asking the questions.\n&gt;\n&gt; Thomas Edison, in an intelligent spiritual discussion through the\n&gt; Telephone to the Dead, stated that there were only thirty of these\n&gt; individuals that could effectively use the device. Four have been\n&gt; identified to this point.\n&gt;\n&gt; I have spent nearly four years testing and doing paranormal research\n&gt; with the Telephone to the Dead, and I have built strong relationships\n&gt; with Spirit Technicians and Spirit Guides who I trust, and who trust\n&gt; me. These new &quot;radio scanners&quot; are not only a waste of money for\n&gt; people looking to do research with them in hopes of having effective\n&gt; communication with the other side, but may in fact be very dangerous.\n&gt; Should demonic and other negative entities learn to use these false\n&gt; devices, the results could be devastating. Though I rarely see eye to\n&gt; eye with the Catholic Church on the matter of using the Telephone to\n&gt; the Dead, I do admit that they predicted the widespread sale of false\n&gt; communication devices as far back as last year. I have recently begun\n&gt; to receive requests from individuals asking for help to close\n&gt; negative doorways and portals that they believe they opened using\n&gt; their purchased Telephone to the Dead replica. Others are claiming\n&gt; that I am a fraud because their purchased device doesn&#39;t produce the\n&gt; positive results I have been fortunate enough to have, and claim that\n&gt; therefore, all of my results MUST be false.\n&gt;\n&gt; I can see this spiraling out of control already. Once again, I will\n&gt; continue my research with the actual Telephone to the Dead as well as\n&gt; provide public demonstrations and private readings for those truly\n&gt; interested in real time spirit communication. Please feel free to\n&gt; contact me with any questions at\n&gt;\n&gt; Bruce\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; You keep typing, we keep giving. Download Messenger and join the  \n&gt; i’m Initiative now. Join in!\n&gt;\n&gt; Your smile counts. The more smiles you share, the more we donate.  \n&gt; Join in!\n&gt;\n&gt; \n\n\nB uce, all you did was ela e Ch is's own wo ds o ou inspec ion.AnnOn No 29, 2007, a 1:00 PM, b uce halliday w o e:F ank,  I know you igh , I akes alo o me o lose my empe bu wha comes ou o his guy's mou h jus pushed all my bu ons. I apologise o he nega i e ou bu s . B uceB uce Halliday Pa ano mal In es iga ing Team To: e p-i c@yahoog oups.comF om: anks-boxes@ho mail.comDa e: Thu, 29 No 2007 10:56:21 -0700Subjec : RE: [EVP-ITC] ch is(jack ass)moon a i againI'm ying o ge away o he ang y empe c ap. Tha doesn' se e anyone.  F ankTo: EVP-ITC@yahoog oups.comF om: lisby@ea hlink.ne Da e: Thu, 29 No 2007 11:54:03 -0500Subjec : Re: [EVP-ITC] ch is(jack ass)moon a i againI'll gi e him his: he has amazing balls o be using F ank's de ice and ell ing he es who a e also using hem ha his is he only one ha wo ks. I I we e F ank, I'd be bea ing my head agains he wall. Oh. Wai . He al eady is.Wha a o al load o ego-d i en c ap. Ch is, i you' e eading, may I sugges ha you a e he one who is alling ic im o \" alse\" communica ion? O ha you head is ge ing waaaay oo big? O i you al eady know ha you' e jus in i o he cash, ha you ind ano he way o pay you bills?You know, hough, his same shi has happened o e e y g oup o pa ano mal esea che s since he ield began. I' e wa ched g oup a e g oup come oge he and explode o hi y yea s because only he Chosen had he igh o con ol he message, would b oke no c i icism o *any* o hei own esul s *e e *, bu had plen y o de ini i e p onouncemen s abou e e yone else's.This is why I sco a he idea o \"Ha mony,\" wi h he capi al H. I ha e seen he concep used by e e yone om he Wa ens in he 60s-70s o he Ha sch-Fischbachs in he ea ly 80s o Moon oday ying o use his idea o being somehow chosen and sac ed in o de o ge \" eal\" messages om spi i . Ha mony is a way o con ol who ge s o play and IMHO, i 's a load o nonsense.B uce, I ha e o ell you ha he message you go he o he day abou us being all Kumbaya se my ala ms o , pe haps innocen ly, bu none heless. I' e ound he e is such a ine line be ween eal peace be ween b o he s wo king o he eal common good and peace be ween b o he s as a mechanism o con ol. Yes, we need o be a peace o wo k oge he . Bu ha peace has o be an inclusi e peace. I has o be a peace wi hin one's sel abo e all else. I needs o be a * ea less* in e io peace, oo. The Ha mony is wi hin, olks. I 's no judging whe he o he s ha e i o no be o e we le hem play. I is pu e, unadul e a ed *in e nal* knowledge abou one's sel . Judge no , les ye be judged-- emembe ha one?HMO YMMV, oujou s,AnnOn No 29, 2007, a 9:15 AM, bhali333 w o e:He e is a blog s e e sen me om moons myspace page as usual he's in a panic because his audulen buisness is going down he ubes. he claims o know he only way box communica ion can be achie ed bu who would know be e han he box in en o . F ank says i does no  ma e wha means you use i 's he esea che ha coun s.and i moon is so omnipi en in his esea ch whe e a e he documen ed eco dings o his esea ch, why a e hey no public o  e e yone o hea maybe because he's ull o bull. he said ecen ly  ha no one bu him ge s legi ima e communica ion, well I hink i 's  he o he way a ound. ch is i you ead his, s op he che ade and ha e some digni y. become a eal esea che and s op ying o down e e yone else so you can con inue o p ay on he be ie ed and despe a e people. And while I'm a i , i you so g ea why a e you o e ing subs an ial discoun s o you so called ghos hun e uni e si y. I'll ell you why, because people a e s a ing o ealise you a e no hing bu a ca ni al side show palm aede and ha e ooled people long enough.  he eason I am add esing moon di ec ly on his g oup is I know he is lu king in he shadows o see wha is happening wi h eal esea che s and will know a leas wha I hink o him.I ha e done mo e legi ima e box esea ch in one week han he has done e e . My esul s a e pos ed I challenge him o do he same.he e is a copy o his malicious blog om myspace.ch is moon's blog on myspace his mo ning ***Wednesday, No embe 28, 2007 The Box has hi he an! Cu en mood: dis essed Ca ego y: D eams and he Supe na u al As so many o you know, I ha e been he p ima y es e o he Telephone o he Dead, a.k.a. \"F ank's Box\" since 2004, and ha e had g ea success using i in pa ano mal esea ch, and mo e cu en ly, connec ing he li ing wi h hose on he o he side. I ha e ecen ly been made awa e ha he e a e se e al eplica e sions o his de ice being sold. I ha e also been old o ano he de ice ha can be pu chased o e y li le om any elec onics me chan and al e ed by hand, p oducing wha some conside o be esul s. As I expec ed, he samples ha people ha e sen me a e no hing mo e han  imed adio scans ha ha e no alidi y. Wha is impo an o emembe , be o e pu chasing any o hese eplica de ices, is ha he Spi i Technicians and Spi i Guides on he o he side ha e epea edly explained ha he way ha he Telephone  o he Dead echnology wo ks, is by spi i ene gy manipula ing he  andom ol age gene a o (RVG) and using whi e and pink noise, as well as adio agmen , o c ea e eal ime oice answe s o ques ions posed om ou side. The mos impo an aspec o his de ice is he medium ope a o who wo ks as an an enna o \"in e p e e \" o li ing indi iduals asking he ques ions. Thomas Edison, in an in elligen spi i ual discussion h ough he Telephone o he Dead, s a ed ha he e we e only hi y o hese indi iduals ha could e ec i ely use he de ice. Fou ha e been iden i ied o his poin . I ha e spen nea ly ou yea s es ing and doing pa ano mal esea ch wi h he Telephone o he Dead, and I ha e buil s ong ela ionships wi h Spi i Technicians and Spi i Guides who I us , and who us  me. These new \" adio scanne s\" a e no only a was e o money o  people looking o do esea ch wi h hem in hopes o ha ing e ec i e communica ion wi h he o he side, bu may in ac be e y dange ous. Should demonic and o he nega i e en i ies lea n o use hese alse de ices, he esul s could be de as a ing. Though I a ely see eye o eye wi h he Ca holic Chu ch on he ma e o using he Telephone o  he Dead, I do admi ha hey p edic ed he widesp ead sale o alse communica ion de ices as a back as las yea . I ha e ecen ly begun  o ecei e eques s om indi iduals asking o help o close nega i e doo ways and po als ha hey belie e hey opened using  hei pu chased Telephone o he Dead eplica. O he s a e claiming  ha I am a aud because hei pu chased de ice doesn' p oduce he posi i e esul s I ha e been o una e enough o ha e, and claim ha   he e o e, all o my esul s MUST be alse. I can see his spi aling ou o con ol al eady. Once again, I will con inue my esea ch wi h he ac ual Telephone o he Dead as well as p o ide public demons a ions and p i a e eadings o hose uly in e es ed in eal ime spi i communica ion. Please eel ee o con ac me wi h any ques ions a B uceYou keep yping, we keep gi ing. Download Messenge and join he i’m Ini ia i e now. Join in! You smile coun s. The mo e smiles you sha e, he mo e we dona e. Join in!"}