{"id": "3507", "subject": "Quotes from &#39;Miracles in the Storm&#39; by Mark Macy", "author": "April Slaughter", "timestamp": "2007-11-29T21:41:28Z", "full_text": "A couple of weeks ago, I had an amazing opportunity to spend some time\nwith Mark Macy. He&#39;s an ITC researcher who has published several works\non the subject. He, along with my husband, Rosemary Ellen Guiley, and\nI spent some time with the MiniBox and I have to tell you it was a\npretty incredible experience. Naturally, when I got home, I purchased\ntwo of Macy&#39;s books on ITC. The first was &#39;Miracles in the Storm&#39;, and\nnot far into it, I came across a couple of quotes I thought would be\nfitting to share.\n\n&#39;...psychic channeling involves a blending of minds of the spirit\ncommunicator and the human channel, as a result the message received\nhas been &quot;filtered&#39; by the mind of the channel. Very rarely does a\nmessage come through a human channel in a pure and unfiltered form.\nWith ITC, on the other hand, messages from spirit can come through the\nequipment virtually unfiltered by the minds of the experimenters. So,\nITC provides a more reliable means of communication with the worlds of\nspirit...&#39;\n\nIf it is indeed possible to communicate with other realms through our\nelectronics, in my opinion, there would not be a need for exclusivity\nin who could actually receive the communication. We all stand to\nbenefit greatly (and I am not speaking monetarily) if we can &#39;bridge&#39;\nthe gaps between our reality and whatever lies beyond it.\n\nI have always been taught that there is &#39;opposition in all things&#39;.\nFor every positive, there is a negative and vice versa. We, as a\ncollective of like-minded researchers could make some pretty amazing\ndiscoveries and share them for the greater good. We&#39;ll have to take\nthe negatives in stride.\n\nSorry if it seems I am waxing philosophical... I just believe there is\na huge potential for growth here. Bravo to anyone is seeking out and\ncreating new ways of communication without immediately rejecting new\nideas.\n\nEnlightenment is not meant for a select few. As human beings, we are\nall entitled. Just my two cents...\n\n~April"}