{"id": "3513", "subject": "Re: chris(jack ass)moon, Be Afraid, Be very Afraid!", "author": "judy_in_hollywood", "timestamp": "2007-11-30T00:18:13Z", "full_text": "Hi Frank & All, Hmm?! Does seem like Chris has &quot;highJacked&quot; Frank&#39;s Box(es) - for his own benifits and is now afraid of what many other researchers/experimenters are doing with Boxes they have (be it Frank&#39;s Box, Joe&#39;s Box, the Mini-Box . . or RS 12-469, 12-470)  . . . HE does NOT want competition - imagine, IF someone else were to &quot;take his spot&quot; on C2C to talk about their results with a box or better yet, do the same research he&#39;s conducting - but at a lower price, so more people can be exposed to the box to see/hear how it works!!!  He&#39;d be afraid, very, very afraid, then!!! Funny, how he claims the other&#39;s are &quot;replicas&quot; or fakes and even &quot;dangerous&quot; . . . like He&#39;s the ONLY one who can work a box correctly!!!  Blaaaa.    =Judy=    . . . . . . . . . . . . . .     . . . . . . . . . . . . . . . .  \n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@...&gt; wrote:\n&gt;\n&gt; \n&gt;  Well, hopefully the blogs are considered public. Similar forwardings in the past have resulted in slander threats. These threats themsleves are in fact illegal, but it&#39;s still disturbing to get such threats. \n&gt;  \n&gt;  The way I see it, this guy is making public claims and assertions about equimpment I make, and he admits he is only testing (primary tester), that I do not completely agree wiht. I believe I have an obligation to tell my side, and to state once again, as maker of Moon&#39;s &quot;Telephone to the dead&quot;  equipment, which is in fact is one of my boxes, that I say, all are allowed to use it for whatever they want. Moon in fact has no authority whatsoever as a box tester to restrict it&#39;s use to anyone, nor to claim that his contacts are anymore legitimate than anyone else&#39;s. Moon himself announced to the world, twice on Coast to Coast AM,  that I in fact made the boxes, and as the acknowledged creator/maker/inventor of Frank&#39;s box, I say all can use the damn things freely. In additon, I opened it up to all experimentors in an attempt to verify my results, which is in fact an application of scientific method, known as peer review.\n&gt;  \n&gt;  Moon&#39;s contacts through the box may in fact be real, I don&#39;t know, personaly, he seems like a good guy, and I find these disaggreements troubling, but everyone has their own way using any technology. If you had a cell phone that calls Mars, that would not mean all cell phones can only be used for such contacts, it&#39;s that same with boxes. There may be many levels of spirit, and who is to say which is acceptable, and which is not? I am unwilling to accept any one person&#39;s results as the only results possible. \n&gt;  \n&gt;  Frank Sumption\n&gt;   \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Your smile counts. The more smiles you share, the more we donate. Join in.\n&gt; www.windowslive.com/smile?ocid=TXT_TAGLM_Wave2_oprsmilewlhmtagline\n&gt;"}