{"id": "3514", "subject": "Re: Just the facts! = &quot;Demon&quot; Chris =", "author": "judy_in_hollywood", "timestamp": "2007-11-30T00:38:56Z", "full_text": "Hi Frank & All, All one needs to see, on Chris Moon&#39;s website or on his MySpace site, is his &quot;Demon&quot; photo with red eyes - to realise his &quot;intentions&quot; with promotting himself & Frank&#39;s Box! Remember, he&#39;s an entertaner/musician - or was- until he got a box! He wants ALL of the attention, I feel, and NO compititions from others! He should be Banned from C2C, too! Let Frank or someone else talk about Frank&#39;s box, there!  My 2c worth!  UGH! What Chris is doing is not cool.    =Judy=            . . . . . . . . . . . . . . . .  . . . . . . . . . . . . . . . .  \n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@...&gt; wrote:\n&gt;\n&gt; \n&gt;  I did, from the begining open this to anyone, and I am not amused that one person would take the technogoly, claim it as his own, and attempt to make it exclusive to himself. For one person to say he is the &quot;primary tester&quot; is inaccurate, he was the first that kinda understood how it was supposed to be used, or so I thought. I think we left the &quot;treting phase&quot; some time ago, perhaps it&#39;s time to return barrowed equipment?\n&gt;  \n&gt;  I wasn&#39;t quite finished with that e-mail-- I hit the send button in my rush to get off to work. \n&gt;  \n&gt;  \n&gt;  \n&gt;  I put out a box use guideline thing a year or two ago stating that no one has the right to take my equipment and and claim their use supercedes anyones else&#39;s use, or results.\n&gt;  \n&gt; So, to contiue...\n&gt;  \n&gt;  As a far as &quot;technicians&quot; I don&#39;t get any of that stuff, but---they do talk about a network, and connection to our equipment. When I first made my &quot;Ghostman&quot; box, last week, it wasn&#39;t working well, but a day or so later, it came to life, and one of the voices said it had been connected to &quot;the network&quot;. Supposedly there is a similar connection made to computers running EVPmaker. I&#39;m not sure if these &quot;network&quot; connections are maintained if equipment is taken out for investigations, or demostrations. Of cousre, I can&#39;t say if these networks are a fact. I would think as maker of the box, these etheric techs might want to give me, or others some hints.\n&gt;  \n&gt;  As far as the ghost box, or Frank&#39;s box, being a &quot;telephone to the dead&quot;, I think is very poor analogy, the old style phone system of Edison&#39;s day had operators, plural, not one person that recieved all calls, then interpreted what was being said to other parties. That&#39;s more of a master control schema.The old phone system didn&#39;t charge you an arm and a leg to talk to someone in the same room either! Some might say these &quot;Technicains&quot; are the operators, but even if anyone esle could hear these voices, why do you need someone to interpret what&#39;s being said. I say if not many can hear it, or something similar, it ain&#39;t real! There is a certain kind of conatct, ion that that your own mind uses the noise as a sort of psychic prop, you hear the stuff in your head, it may be accurate and real inforamntiion, but no one else is going to hear it. i think that what all this supposed converstions wiht Edison maybe.  I have in fact heard a voice that said &quot;Edison here&quot; but there was no other real information conveyed that I could understand. \n&gt;  As for portals, demons and evil spirits entering the world through these &quot;unauthorized&quot; boxes, I an only say, as the original mker of the box, I have gotten voices cuzzing, swearing, name calling, and even threatening, but nothing that has seemingly &quot;entered&quot; our world. Even those &quot;threatening entities&quot;, when pressed to bring it, fold up like paper tigers. These beings and spirits already exist all around us, and at a higher level, so they have full access to this, a lower lever. Besides. There is that &quot;network&quot; that seem to allow for better contacts, and kinda helps highter being to come through. \n&gt;  \n&gt;  I made these &quot;boxes&quot;! The idea was not &quot;Edisons Telephone...&quot; What I got was an assemblage of my own expereince and knowlegde, put together by my own mind as answer to my question of what else could I use for spirit comuncation. All technology involved was based on what I had worked on in the past for radio experimentation. I had in fact, a couple years before my interest in EVP, been experimenting with voltage tunable radio modules removed from car stereos for AM DX, that&#39;s listening to distant AM radio stations. I was hoping to find other talk shows similar to Art Bell, and there used to be one out of Cincinati(?). The idea of using a random voltage to tune the radio was after using EVPmaker, which uses a method of generating random speech bits for the entities to use. It was a small leap to apply the random technique to an anolog system. I am not the first to be focusing on a problem, and have the mind provide an solution in complete form. Nothing mystical about it. The fact is, after much work, and experimenting, the tuning doesn&#39;t have to be random, a linear tuning works much better. Yet another fact of  the box, covienently ignored.\n&gt;  \n&gt;  What really chaps my hide, as maker of the box, is to have someone, who knows nothing of electronics, and technology completely ignore everything I say about the box, and presume to tell me how it really works, how it should be used, and what is acceptable from it. This guy is so honest, he won&#39;t even use his real name, but huff and puff at at anyone that contradicts his use of my equipment. I say, as &quot;a Tester&quot; if you can&#39;t use it in an honest manor, bring the stuff back--testing over! Like it or not, the public has this technology, you can keep pissing and moaning, trying to spread fear, or you could choose the way of Light. \n&gt;  \n&gt;  Frank-S\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Share life as it happens with the new Windows Live.Download today it&#39;s FREE!\n&gt; http://www.windowslive.com/share.html?ocid=TXT_TAGLM_Wave2_sharelife_112007\n&gt;"}