{"id": "3522", "subject": "RE: [EVP-ITC] Re: Just the fact!", "author": "bruce halliday", "timestamp": "2007-11-30T01:31:59Z", "full_text": "--_d29d5862-63e8-4f24-91f0-00c496712c73_\r\nContent-Type: text/plain; charset=&quot;Windows-1252&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nBabiarz3,\n \nwell your another jack ass heard from, I hope your done.\n \nbruc=\r\ne\n\nBruce Halliday Paranormal Investigating Team \n\n\nTo: EVP-ITC@yahoogroups.=\r\ncomFrom: babiarz3@...: Fri, 30 Nov 2007 01:22:49 +0000Subject: [E=\r\nVP-ITC] Re: Just the fact!\n\n\n\n\nChris was the first and only person testing =\r\nthis device for quite sometime, making him the &quot;primary tester&quot;. The dictio=\r\nnary defines the word&quot;primary&quot; as being or standing first in a list. You of=\r\nfer that he wasalso the first to understand how it was supposed to be used.=\r\n Yet, nowas more and more people weigh in with their own opinions you quest=\r\nionyour initial judgment. The fact is that Chris&#39; opinion of how the boxsho=\r\nuld be used has never changed. He has held steadfast to hisbeliefs. That, m=\r\ny friend, is an honorable trait in this field and afact that should be cons=\r\nidered. Chris has also never claimed this technology to be his own. He hasa=\r\nlways and will always give credit where credit is due. He does thisboth pub=\r\nlicly and privately. The use of syntax here on whether we call it Frank&#39;s B=\r\nox, TheTelephone to the Dead, Maxi/Mini Box, or Granola in a can is of noim=\r\nportance. Truly, because Edison&#39;s plans were never discovered thereis no wa=\r\ny to know for sure whether or not your plans are exactly whatEdison was wor=\r\nking on. There also seems to be a bit of confusion on the role the&quot;technici=\r\nans&quot; play in this along with another syntax issue ( could thewords network =\r\nand technician be used interchangeably?). Thetechnicians are not interprete=\r\nrs. They can provide assistance to thosespirits too excited or otherwise un=\r\nable to communicate effectively.And they, the technicians, also serve to as=\r\nsist higher vibrations comethrough (just as your &quot;network&quot;). They can also =\r\nbe of benefit whenlower vibrations try to get through. You state you heard =\r\na voice say &quot;Edison here&quot; and awhile back you hadposted that you did believ=\r\ne it to in fact be Edison himself. Yet nowyou say the &quot;supposed&quot; Edison con=\r\nversation. As for portals... I&#39;ve made my concerns clear previously known.H=\r\nowever, I have witnessed the box being used in one location only tohave act=\r\nivity spike in another. I&#39;ve also heard many other storiesrelated to dark o=\r\nr lower entities. So, perhaps you have had noexperiences yet but, others ha=\r\nve and they are speaking up. You repeatedly state that Chris is a good guy =\r\nbut then you say &quot;if hecan&#39;t use it in an honest manner...&quot; What could be m=\r\nore honest thansomeone sticking to the same beliefs he&#39;s held since day one=\r\n? Whatcould be more honorable than stating his fears and providing what hef=\r\neels is a needed warning? Frank, isn&#39;t it possible that you two both bring =\r\nsomething separate tothis device? You, the technology and science said. Chr=\r\nis, the mediumand spiritual side. Someone posted separately here about Chri=\r\ns&#39; ego. I can say this...having concern for the possible negative fall out =\r\nto unsuspectingpeople is in no way ego ridden. To assume that you know Chri=\r\ns&#39;intentions is full of ego. To claim that he only wants to preventothers f=\r\nrom having a device for selfish reasons, is ego&#39;s way oftelling you that yo=\r\nu and everyone else &quot;deserves&quot; to have what we donot fully understand. Ego =\r\nwon&#39;t let you consider that because &quot;youwant what you want when you want it=\r\n&quot;.BTW- when the word &quot;harmony&quot; is referred to here it is not a &quot;feelinginsi=\r\nde&quot; like self esteem or some other warm fuzzy. It is aboutresonance, vibrat=\r\nions, that which will be matched by like resonanceand vibrations. Harmony. =\r\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@...&gt; wrote:&gt;&gt; =\r\n&gt; I did, from the begining open this to anyone, and I am not amusedthat one=\r\n person would take the technogoly, claim it as his own, andattempt to make =\r\nit exclusive to himself. For one person to say he isthe &quot;primary tester&quot; is=\r\n inaccurate, he was the first that kindaunderstood how it was supposed to b=\r\ne used, or so I thought. I think weleft the &quot;treting phase&quot; some time ago, =\r\nperhaps it&#39;s time to returnbarrowed equipment?&gt; &gt; I wasn&#39;t quite finished w=\r\nith that e-mail-- I hit the send button inmy rush to get off to work. &gt; &gt; &gt;=\r\n &gt; I put out a box use guideline thing a year or two ago stating thatno one=\r\n has the right to take my equipment and and claim their usesupercedes anyon=\r\nes else&#39;s use, or results.&gt; &gt; So, to contiue...&gt; &gt; As a far as &quot;technicians=\r\n&quot; I don&#39;t get any of that stuff, but---theydo talk about a network, and con=\r\nnection to our equipment. When I firstmade my &quot;Ghostman&quot; box, last week, it=\r\n wasn&#39;t working well, but a dayor so later, it came to life, and one of the=\r\n voices said it had beenconnected to &quot;the network&quot;. Supposedly there is a s=\r\nimilar connectionmade to computers running EVPmaker. I&#39;m not sure if these =\r\n&quot;network&quot;connections are maintained if equipment is taken out forinvestigat=\r\nions, or demostrations. Of cousre, I can&#39;t say if thesenetworks are a fact.=\r\n I would think as maker of the box, these etherictechs might want to give m=\r\ne, or others some hints.&gt; &gt; As far as the ghost box, or Frank&#39;s box, being =\r\na &quot;telephone to thedead&quot;, I think is very poor analogy, the old style phone=\r\n system ofEdison&#39;s day had operators, plural, not one person that recieved =\r\nallcalls, then interpreted what was being said to other parties. That&#39;smore=\r\n of a master control schema.The old phone system didn&#39;t charge youan arm an=\r\nd a leg to talk to someone in the same room either! Somemight say these &quot;Te=\r\nchnicains&quot; are the operators, but even if anyoneesle could hear these voice=\r\ns, why do you need someone to interpretwhat&#39;s being said. I say if not many=\r\n can hear it, or somethingsimilar, it ain&#39;t real! There is a certain kind o=\r\nf conatct, ion thatthat your own mind uses the noise as a sort of psychic p=\r\nrop, you hearthe stuff in your head, it may be accurate and real inforamnti=\r\nion, butno one else is going to hear it. i think that what all this suppose=\r\ndconverstions wiht Edison maybe. I have in fact heard a voice thatsaid &quot;Edi=\r\nson here&quot; but there was no other real information conveyedthat I could unde=\r\nrstand. &gt; As for portals, demons and evil spirits entering the world throug=\r\nhthese &quot;unauthorized&quot; boxes, I an only say, as the original mker of thebox,=\r\n I have gotten voices cuzzing, swearing, name calling, and eventhreatening,=\r\n but nothing that has seemingly &quot;entered&quot; our world. Eventhose &quot;threatening=\r\n entities&quot;, when pressed to bring it, fold up likepaper tigers. These being=\r\ns and spirits already exist all around us,and at a higher level, so they ha=\r\nve full access to this, a lowerlever. Besides. There is that &quot;network&quot; that=\r\n seem to allow for bettercontacts, and kinda helps highter being to come th=\r\nrough. &gt; &gt; I made these &quot;boxes&quot;! The idea was not &quot;Edisons Telephone...&quot; Wh=\r\natI got was an assemblage of my own expereince and knowlegde, puttogether b=\r\ny my own mind as answer to my question of what else could Iuse for spirit c=\r\nomuncation. All technology involved was based on whatI had worked on in the=\r\n past for radio experimentation. I had in fact,a couple years before my int=\r\nerest in EVP, been experimenting withvoltage tunable radio modules removed =\r\nfrom car stereos for AM DX,that&#39;s listening to distant AM radio stations. I=\r\n was hoping to findother talk shows similar to Art Bell, and there used to =\r\nbe one out ofCincinati(?). The idea of using a random voltage to tune the r=\r\nadio wasafter using EVPmaker, which uses a method of generating random spee=\r\nchbits for the entities to use. It was a small leap to apply the randomtech=\r\nnique to an anolog system. I am not the first to be focusing on aproblem, a=\r\nnd have the mind provide an solution in complete form.Nothing mystical abou=\r\nt it. The fact is, after much work, andexperimenting, the tuning doesn&#39;t ha=\r\nve to be random, a linear tuningworks much better. Yet another fact of the =\r\nbox, covienently ignored.&gt; &gt; What really chaps my hide, as maker of the box=\r\n, is to have someone,who knows nothing of electronics, and technology compl=\r\netely ignoreeverything I say about the box, and presume to tell me how it r=\r\neallyworks, how it should be used, and what is acceptable from it. This guy=\r\nis so honest, he won&#39;t even use his real name, but huff and puff at atanyon=\r\ne that contradicts his use of my equipment. I say, as &quot;a Tester&quot;if you can&#39;=\r\nt use it in an honest manor, bring the stuff back--testingover! Like it or =\r\nnot, the public has this technology, you can keeppissing and moaning, tryin=\r\ng to spread fear, or you could choose theway of Light. &gt; &gt; Frank-S&gt; &gt; &gt; &gt; &gt;=\r\n &gt; &gt; &gt; __________________________________________________________&gt; Share li=\r\nfe as it happens with the new Windows Live.Download todayit&#39;s FREE!&gt;http://=\r\nwww.windowslive.com/share.html?ocid=3DTXT_TAGLM_Wave2_sharelife_112007&gt; \n\n\n=\r\n\n\n\n\n_________________________________________________________________\nYou k=\r\neep typing, we keep giving. Download Messenger and join the i=92m Initiativ=\r\ne now.\nhttp://im.live.com/messenger/im/home/?source=3DTAGLM\r\n--_d29d5862-63e8-4f24-91f0-00c496712c73_\r\nContent-Type: text/html; charset=&quot;Windows-1252&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;\n&lt;head&gt;\n&lt;style&gt;\n.hmmessage P\n{\nmargin:0px;\npadding:0px\n}\nbody.hmmessa=\r\nge\n{\nFONT-SIZE: 10pt;\nFONT-FAMILY:Tahoma\n}\n&lt;/style&gt;\n&lt;/head&gt;\n&lt;body class=3D&#39;=\r\nhmmessage&#39;&gt;Babiarz3,&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nwell your another jack ass heard from, =\r\nI hope your done.&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nbruce&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;DIV&gt;\n&lt;P align=3Dcenter&gt;=\r\n&lt;FONT size=3D4&gt;&lt;FONT color=3D#0033cc&gt;&lt;STRONG&gt;&lt;EM&gt;&lt;FONT face=3D&quot;&quot; color=3D#0=\r\n00000 size=3D5&gt;Bruce Halliday &lt;BR&gt;&lt;/FONT&gt;&lt;/EM&gt;&lt;FONT color=3D#000000&gt;Paranor=\r\nmal Investigating Team &lt;/FONT&gt;&lt;/STRONG&gt;&lt;BR&gt;&lt;A href=3D&quot;http://free-paranorma=\r\nlinvestigating.com/%3C/div%3E%3C/div%3E%3Cp%20/%3E%3Cdiv%20class=3D&quot; target=\r\n=3D_blank&gt;&lt;/P&gt;&lt;/DIV&gt;&lt;/FORM&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;BLOCKQUOTE&gt;\n&lt;HR id=3DEC_stopSpelling&gt;\n=\r\nTo: EVP-ITC@yahoogroups.com&lt;BR&gt;From: babiarz3@...&lt;BR&gt;Date: Fri, 30 No=\r\nv 2007 01:22:49 +0000&lt;BR&gt;Subject: [EVP-ITC] Re: Just the fact!&lt;BR&gt;&lt;BR&gt;\n&lt;MET=\r\nA content=3D&quot;Microsoft SafeHTML&quot; name=3DGenerator&gt;\n&lt;DIV id=3DEC_ygrp-mlmsg =\r\nstyle=3D&quot;WIDTH: 655px&quot;&gt;\n&lt;DIV id=3DEC_ygrp-msg style=3D&quot;PADDING-RIGHT: 15px;=\r\n PADDING-LEFT: 0px; Z-INDEX: 1; FLOAT: left; PADDING-BOTTOM: 0px; WIDTH: 49=\r\n0px; PADDING-TOP: 0px&quot;&gt;\n&lt;DIV id=3DEC_ygrp-text&gt;\nChris was the first and onl=\r\ny person testing this device for quite some&lt;BR&gt;time, making him the &quot;primar=\r\ny tester&quot;. The dictionary defines the word&lt;BR&gt;&quot;primary&quot; as being or standin=\r\ng first in a list. You offer that he was&lt;BR&gt;also the first to understand ho=\r\nw it was supposed to be used. Yet, now&lt;BR&gt;as more and more people weigh in =\r\nwith their own opinions you question&lt;BR&gt;your initial judgment. The fact is =\r\nthat Chris&#39; opinion of how the box&lt;BR&gt;should be used has never changed. He =\r\nhas held steadfast to his&lt;BR&gt;beliefs. That, my friend, is an honorable trai=\r\nt in this field and a&lt;BR&gt;fact that should be considered. &lt;BR&gt;Chris has also=\r\n never claimed this technology to be his own. He has&lt;BR&gt;always and will alw=\r\nays give credit where credit is due. He does this&lt;BR&gt;both publicly and priv=\r\nately. &lt;BR&gt;The use of syntax here on whether we call it Frank&#39;s Box, The&lt;BR=\r\n&gt;Telephone to the Dead, Maxi/Mini Box, or Granola in a can is of no&lt;BR&gt;impo=\r\nrtance. Truly, because Edison&#39;s plans were never discovered there&lt;BR&gt;is no =\r\nway to know for sure whether or not your plans are exactly what&lt;BR&gt;Edison w=\r\nas working on. &lt;BR&gt;There also seems to be a bit of confusion on the role th=\r\ne&lt;BR&gt;&quot;technicians&quot; play in this along with another syntax issue ( could the=\r\n&lt;BR&gt;words network and technician be used interchangeably?&lt;WBR&gt;). The&lt;BR&gt;tec=\r\nhnicians are not interpreters. They can provide assistance to those&lt;BR&gt;spir=\r\nits too excited or otherwise unable to communicate effectively.&lt;BR&gt;And they=\r\n, the technicians, also serve to assist higher vibrations come&lt;BR&gt;through (=\r\njust as your &quot;network&quot;). They can also be of benefit when&lt;BR&gt;lower vibratio=\r\nns try to get through. &lt;BR&gt;You state you heard a voice say &quot;Edison here&quot; an=\r\nd awhile back you had&lt;BR&gt;posted that you did believe it to in fact be Ediso=\r\nn himself. Yet now&lt;BR&gt;you say the &quot;supposed&quot; Edison conversation. &lt;BR&gt;As fo=\r\nr portals... I&#39;ve made my concerns clear previously known.&lt;BR&gt;However, I ha=\r\nve witnessed the box being used in one location only to&lt;BR&gt;have activity sp=\r\nike in another. I&#39;ve also heard many other stories&lt;BR&gt;related to dark or lo=\r\nwer entities. So, perhaps you have had no&lt;BR&gt;experiences yet but, others ha=\r\nve and they are speaking up. &lt;BR&gt;You repeatedly state that Chris is a good =\r\nguy but then you say &quot;if he&lt;BR&gt;can&#39;t use it in an honest manner...&quot; What co=\r\nuld be more honest than&lt;BR&gt;someone sticking to the same beliefs he&#39;s held s=\r\nince day one? What&lt;BR&gt;could be more honorable than stating his fears and pr=\r\noviding what he&lt;BR&gt;feels is a needed warning? &lt;BR&gt;Frank, isn&#39;t it possible =\r\nthat you two both bring something separate to&lt;BR&gt;this device? You, the tech=\r\nnology and science said. Chris, the medium&lt;BR&gt;and spiritual side. &lt;BR&gt;Someo=\r\nne posted separately here about Chris&#39; ego. I can say this...&lt;BR&gt;having con=\r\ncern for the possible negative fall out to unsuspecting&lt;BR&gt;people is in no =\r\nway ego ridden. To assume that you know Chris&#39;&lt;BR&gt;intentions is full of ego=\r\n. To claim that he only wants to prevent&lt;BR&gt;others from having a device for=\r\n selfish reasons, is ego&#39;s way of&lt;BR&gt;telling you that you and everyone else=\r\n &quot;deserves&quot; to have what we do&lt;BR&gt;not fully understand. Ego won&#39;t let you c=\r\nonsider that because &quot;you&lt;BR&gt;want what you want when you want it&quot;.&lt;BR&gt;BTW- =\r\nwhen the word &quot;harmony&quot; is referred to here it is not a &quot;feeling&lt;BR&gt;inside&quot;=\r\n like self esteem or some other warm fuzzy. It is about&lt;BR&gt;resonance, vibra=\r\ntions, that which will be matched by like resonance&lt;BR&gt;and vibrations. Harm=\r\nony. &lt;BR&gt;--- In &lt;A href=3D&quot;mailto:EVP-ITC@yahoogroups.com&quot;&gt;EVP-ITC@yahoogro=\r\nups&lt;WBR&gt;.com&lt;/A&gt;, Frank Sumption &lt;franks-boxes@&lt;WBR&gt;...&gt; wrote:&lt;BR&gt;&g=\r\nt;&lt;BR&gt;&gt; &lt;BR&gt;&gt; I did, from the begining open this to anyone, and I am =\r\nnot amused&lt;BR&gt;that one person would take the technogoly, claim it as his ow=\r\nn, and&lt;BR&gt;attempt to make it exclusive to himself. For one person to say he=\r\n is&lt;BR&gt;the &quot;primary tester&quot; is inaccurate, he was the first that kinda&lt;BR&gt;u=\r\nnderstood how it was supposed to be used, or so I thought. I think we&lt;BR&gt;le=\r\nft the &quot;treting phase&quot; some time ago, perhaps it&#39;s time to return&lt;BR&gt;barrow=\r\ned equipment?&lt;BR&gt;&gt; &lt;BR&gt;&gt; I wasn&#39;t quite finished with that e-mail-- I=\r\n hit the send button in&lt;BR&gt;my rush to get off to work. &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;B=\r\nR&gt;&gt; &lt;BR&gt;&gt; I put out a box use guideline thing a year or two ago stati=\r\nng that&lt;BR&gt;no one has the right to take my equipment and and claim their us=\r\ne&lt;BR&gt;supercedes anyones else&#39;s use, or results.&lt;BR&gt;&gt; &lt;BR&gt;&gt; So, to con=\r\ntiue...&lt;BR&gt;&gt; &lt;BR&gt;&gt; As a far as &quot;technicians&quot; I don&#39;t get any of that =\r\nstuff, but---they&lt;BR&gt;do talk about a network, and connection to our equipme=\r\nnt. When I first&lt;BR&gt;made my &quot;Ghostman&quot; box, last week, it wasn&#39;t working we=\r\nll, but a day&lt;BR&gt;or so later, it came to life, and one of the voices said i=\r\nt had been&lt;BR&gt;connected to &quot;the network&quot;. Supposedly there is a similar con=\r\nnection&lt;BR&gt;made to computers running EVPmaker. I&#39;m not sure if these &quot;netwo=\r\nrk&quot;&lt;BR&gt;connections are maintained if equipment is taken out for&lt;BR&gt;investig=\r\nations, or demostrations. Of cousre, I can&#39;t say if these&lt;BR&gt;networks are a=\r\n fact. I would think as maker of the box, these etheric&lt;BR&gt;techs might want=\r\n to give me, or others some hints.&lt;BR&gt;&gt; &lt;BR&gt;&gt; As far as the ghost box=\r\n, or Frank&#39;s box, being a &quot;telephone to the&lt;BR&gt;dead&quot;, I think is very poor =\r\nanalogy, the old style phone system of&lt;BR&gt;Edison&#39;s day had operators, plura=\r\nl, not one person that recieved all&lt;BR&gt;calls, then interpreted what was bei=\r\nng said to other parties. That&#39;s&lt;BR&gt;more of a master control schema.The old=\r\n phone system didn&#39;t charge you&lt;BR&gt;an arm and a leg to talk to someone in t=\r\nhe same room either! Some&lt;BR&gt;might say these &quot;Technicains&quot; are the operator=\r\ns, but even if anyone&lt;BR&gt;esle could hear these voices, why do you need some=\r\none to interpret&lt;BR&gt;what&#39;s being said. I say if not many can hear it, or so=\r\nmething&lt;BR&gt;similar, it ain&#39;t real! There is a certain kind of conatct, ion =\r\nthat&lt;BR&gt;that your own mind uses the noise as a sort of psychic prop, you he=\r\nar&lt;BR&gt;the stuff in your head, it may be accurate and real inforamntiion, bu=\r\nt&lt;BR&gt;no one else is going to hear it. i think that what all this supposed&lt;B=\r\nR&gt;converstions wiht Edison maybe. I have in fact heard a voice that&lt;BR&gt;said=\r\n &quot;Edison here&quot; but there was no other real information conveyed&lt;BR&gt;that I c=\r\nould understand. &lt;BR&gt;&gt; As for portals, demons and evil spirits entering =\r\nthe world through&lt;BR&gt;these &quot;unauthorized&quot; boxes, I an only say, as the orig=\r\ninal mker of the&lt;BR&gt;box, I have gotten voices cuzzing, swearing, name calli=\r\nng, and even&lt;BR&gt;threatening, but nothing that has seemingly &quot;entered&quot; our w=\r\norld. Even&lt;BR&gt;those &quot;threatening entities&quot;, when pressed to bring it, fold =\r\nup like&lt;BR&gt;paper tigers. These beings and spirits already exist all around =\r\nus,&lt;BR&gt;and at a higher level, so they have full access to this, a lower&lt;BR&gt;=\r\nlever. Besides. There is that &quot;network&quot; that seem to allow for better&lt;BR&gt;co=\r\nntacts, and kinda helps highter being to come through. &lt;BR&gt;&gt; &lt;BR&gt;&gt; I =\r\nmade these &quot;boxes&quot;! The idea was not &quot;Edisons Telephone...&lt;WBR&gt;&quot; What&lt;BR&gt;I =\r\ngot was an assemblage of my own expereince and knowlegde, put&lt;BR&gt;together b=\r\ny my own mind as answer to my question of what else could I&lt;BR&gt;use for spir=\r\nit comuncation. All technology involved was based on what&lt;BR&gt;I had worked o=\r\nn in the past for radio experimentation. I had in fact,&lt;BR&gt;a couple years b=\r\nefore my interest in EVP, been experimenting with&lt;BR&gt;voltage tunable radio =\r\nmodules removed from car stereos for AM DX,&lt;BR&gt;that&#39;s listening to distant =\r\nAM radio stations. I was hoping to find&lt;BR&gt;other talk shows similar to Art =\r\nBell, and there used to be one out of&lt;BR&gt;Cincinati(?)&lt;WBR&gt;. The idea of usi=\r\nng a random voltage to tune the radio was&lt;BR&gt;after using EVPmaker, which us=\r\nes a method of generating random speech&lt;BR&gt;bits for the entities to use. It=\r\n was a small leap to apply the random&lt;BR&gt;technique to an anolog system. I a=\r\nm not the first to be focusing on a&lt;BR&gt;problem, and have the mind provide a=\r\nn solution in complete form.&lt;BR&gt;Nothing mystical about it. The fact is, aft=\r\ner much work, and&lt;BR&gt;experimenting, the tuning doesn&#39;t have to be random, a=\r\n linear tuning&lt;BR&gt;works much better. Yet another fact of the box, covienent=\r\nly ignored.&lt;BR&gt;&gt; &lt;BR&gt;&gt; What really chaps my hide, as maker of the box=\r\n, is to have someone,&lt;BR&gt;who knows nothing of electronics, and technology c=\r\nompletely ignore&lt;BR&gt;everything I say about the box, and presume to tell me =\r\nhow it really&lt;BR&gt;works, how it should be used, and what is acceptable from =\r\nit. This guy&lt;BR&gt;is so honest, he won&#39;t even use his real name, but huff and=\r\n puff at at&lt;BR&gt;anyone that contradicts his use of my equipment. I say, as &quot;=\r\na Tester&quot;&lt;BR&gt;if you can&#39;t use it in an honest manor, bring the stuff back--=\r\ntesting&lt;BR&gt;over! Like it or not, the public has this technology, you can ke=\r\nep&lt;BR&gt;pissing and moaning, trying to spread fear, or you could choose the&lt;B=\r\nR&gt;way of Light. &lt;BR&gt;&gt; &lt;BR&gt;&gt; Frank-S&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt=\r\n; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; ____________&lt;WBR&gt;_________&lt;WBR&gt;______=\r\n___&lt;WBR&gt;_________&lt;WBR&gt;_________&lt;WBR&gt;_________&lt;WBR&gt;_&lt;BR&gt;&gt; Share life as i=\r\nt happens with the new Windows Live.Download today&lt;BR&gt;it&#39;s FREE!&lt;BR&gt;&gt;&lt;BR=\r\n&gt;&lt;A href=3D&quot;http://www.windowslive.com/share.html?ocid=3DTXT_TAGLM_Wave2_sh=\r\narelife_112007&quot; target=3D_blank&gt;http://www.windowsl&lt;WBR&gt;ive.com/share.&lt;WBR&gt;=\r\nhtml?ocid=3D&lt;WBR&gt;TXT_TAGLM_&lt;WBR&gt;Wave2_sharelife_&lt;WBR&gt;112007&lt;/A&gt;&lt;BR&gt;&gt;&lt;BR&gt;=\r\n&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;SPAN style=3D&quot;COLOR: white&quot;&gt;&lt;/SPAN&gt; \n&lt;STYLE&gt;\n.ExternalClass =\r\n#EC_ygrp-mkp\n{border:1px solid #d8d8d8;font-family:Arial;padding:0px 14px;}=\r\n\n.ExternalClass #EC_ygrp-mkp hr\n{border:1px solid #d8d8d8;}\n.ExternalClass =\r\n#EC_ygrp-mkp #EC_hd\n{color:#628c2a;font-size:85%;font-weight:bold;line-heig=\r\nht:122%;}\n.ExternalClass #EC_ygrp-mkp #EC_ads\n{margin-bottom:10px;}\n.Extern=\r\nalClass #EC_ygrp-mkp .EC_ad\n{padding:0 0;}\n.ExternalClass #EC_ygrp-mkp .EC_=\r\nad a\n{color:#0000ff;text-decoration:none;}\n\n&lt;/STYLE&gt;\n\n&lt;STYLE&gt;\n.ExternalClas=\r\ns #EC_ygrp-sponsor #EC_ygrp-lc\n{font-family:Arial;}\n.ExternalClass #EC_ygrp=\r\n-sponsor #EC_ygrp-lc #EC_hd\n{font-weight:bold;font-size:78%;line-height:122=\r\n%;}\n.ExternalClass #EC_ygrp-sponsor #EC_ygrp-lc .EC_ad\n{margin-bottom:10px;=\r\npadding:0 0;}\n\n&lt;/STYLE&gt;\n\n&lt;STYLE&gt;\n.ExternalClass #EC_ygrp-mlmsg\n{font-size:1=\r\n3px;font-family:arial,helvetica,clean,sans-serif;}\n.ExternalClass #EC_ygrp-=\r\nmlmsg table\n{font-size:inherit;font:100%;}\n.ExternalClass #EC_ygrp-mlmsg se=\r\nlect, .ExternalClass input, .ExternalClass textarea\n{font:99% arial,helveti=\r\nca,clean,sans-serif;}\n.ExternalClass #EC_ygrp-mlmsg pre, .ExternalClass cod=\r\ne\n{font:115% monospace;}\n.ExternalClass #EC_ygrp-mlmsg EC_*\n{line-height:1.=\r\n22em;}\n.ExternalClass #EC_ygrp-text\n{font-family:Georgia;}\n.ExternalClass #=\r\nEC_ygrp-text p\n{;}\n.ExternalClass #EC_ygrp-tpmsgs\n{font-family:Arial;clear:=\r\nboth;}\n.ExternalClass #EC_ygrp-vitnav\n{padding-top:10px;font-family:Verdana=\r\n;font-size:77%;}\n.ExternalClass #EC_ygrp-vitnav a\n{padding:0 1px;}\n.Externa=\r\nlClass #EC_ygrp-actbar\n{clear:both;white-space:nowrap;color:#666;text-align=\r\n:right;}\n.ExternalClass #EC_ygrp-actbar .EC_left\n{float:left;white-space:no=\r\nwrap;}\n.ExternalClass .EC_bld\n{font-weight:bold;}\n.ExternalClass #EC_ygrp-g=\r\nrft\n{font-family:Verdana;font-size:77%;padding:15px 0;}\n.ExternalClass #EC_=\r\nygrp-ft\n{font-family:verdana;font-size:77%;border-top:1px solid #666;paddin=\r\ng:5px 0;}\n.ExternalClass #EC_ygrp-mlmsg #EC_logo\n{padding-bottom:10px;}\n.Ex=\r\nternalClass #EC_ygrp-vital\n{background-color:#e0ecee;margin-bottom:20px;pad=\r\nding:2px 0 8px 8px;}\n.ExternalClass #EC_ygrp-vital #EC_vithd\n{font-size:77%=\r\n;font-family:Verdana;font-weight:bold;color:#333;text-transform:uppercase;}=\r\n\n.ExternalClass #EC_ygrp-vital ul\n{padding:0;}\n.ExternalClass #EC_ygrp-vita=\r\nl ul li\n{list-style-type:none;clear:both;border:1px solid #e0ecee;}\n.Extern=\r\nalClass #EC_ygrp-vital ul li .EC_ct\n{font-weight:bold;color:#ff7900;float:r=\r\night;width:2em;text-align:right;padding-right:.5em;}\n.ExternalClass #EC_ygr=\r\np-vital ul li .EC_cat\n{font-weight:bold;}\n.ExternalClass #EC_ygrp-vital a\n{=\r\ntext-decoration:none;}\n.ExternalClass #EC_ygrp-vital a:hover\n{text-decorati=\r\non:underline;}\n.ExternalClass #EC_ygrp-sponsor #EC_hd\n{color:#999;font-size=\r\n:77%;}\n.ExternalClass #EC_ygrp-sponsor #EC_ov\n{padding:6px 13px;background-=\r\ncolor:#e0ecee;margin-bottom:20px;}\n.ExternalClass #EC_ygrp-sponsor #EC_ov u=\r\nl\n{padding:0 0 0 8px;}\n.ExternalClass #EC_ygrp-sponsor #EC_ov li\n{list-styl=\r\ne-type:square;padding:6px 0;font-size:77%;}\n.ExternalClass #EC_ygrp-sponsor=\r\n #EC_ov li a\n{text-decoration:none;font-size:130%;}\n.ExternalClass #EC_ygrp=\r\n-sponsor #EC_nc\n{background-color:#eee;margin-bottom:20px;padding:0 8px;}\n.=\r\nExternalClass #EC_ygrp-sponsor .EC_ad\n{padding:8px 0;}\n.ExternalClass #EC_y=\r\ngrp-sponsor .EC_ad #EC_hd1\n{font-family:Arial;font-weight:bold;color:#628c2=\r\na;font-size:100%;line-height:122%;}\n.ExternalClass #EC_ygrp-sponsor .EC_ad =\r\na\n{text-decoration:none;}\n.ExternalClass #EC_ygrp-sponsor .EC_ad a:hover\n{t=\r\next-decoration:underline;}\n.ExternalClass #EC_ygrp-sponsor .EC_ad p\n{;}\n.Ex=\r\nternalClass EC_o\n{font-size:0;}\n.ExternalClass .EC_MsoNormal\n{;}\n.ExternalC=\r\nlass #EC_ygrp-text tt\n{font-size:120%;}\n.ExternalClass blockquote\n{;}\n.Exte=\r\nrnalClass .EC_replbq\n{;}\n\n&lt;/STYLE&gt;\n&lt;/BLOCKQUOTE&gt;&lt;/FONT&gt;&lt;/FONT&gt;&lt;br /&gt;&lt;hr /&gt;Y=\r\nou keep typing, we keep giving. Download Messenger and join the i=92m Initi=\r\native now. &lt;a href=3D&#39;http://im.live.com/messenger/im/home/?source=3DCRM_WL=\r\n_joinnow&#39; target=3D&#39;_new&#39;&gt;Join in!&lt;/a&gt;&lt;/body&gt;\n&lt;/html&gt;\r\n--_d29d5862-63e8-4f24-91f0-00c496712c73_--"}