{"id": "3535", "subject": "RE: [EVP-ITC] Re: Just the fact!", "author": "Frank Sumption", "timestamp": "2007-11-30T04:08:17Z", "full_text": "--_1fc9e2b9-9585-4c0b-8984-115c315489b1_\r\nContent-Type: text/plain; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n\nYeah, it could be the boxes, and any of this kind of technolgy works diffe=\r\nrent for everyone, but Moon claims all others users get &quot;false communcation=\r\n&quot;, or only the &quot;bad guys&quot;, and I say he has no right, and no authority to m=\r\nake that assertion. \n \n Yes, I did hear a voice that said &quot;Edison here&quot;, wa=\r\ns it Edison?, who knows, and no other meaningful information was heard by m=\r\ne. \n \n As for the &quot;technicians&quot;, I have never gotten anyone claiming to be =\r\na technician from the other side, nor have I goten any technical assistence=\r\n what so ever for any voice from the boxes. I get only unknow voices that t=\r\nalk about a network connection, I have no idea who they are , or what the n=\r\network consists of.  \n \n I don&#39;t give a crapp who uses the box, and what th=\r\ney use if for, until one user or another claims to be the only authority on=\r\n the box.  Claiming all others are only getting demons, or false voices, an=\r\nd opening portals, is false, and deliberatly false to in an attempt to desc=\r\nredit any compeditors.  $500 an hour for box access is criminal! \n \n Portal=\r\ns is Hollywood! \n \n \n I&#39;m not the one that said harmony.  \n \n Frank-S\n\n\nTo:=\r\n EVP-ITC@yahoogroups.comFrom: babiarz3@...: Fri, 30 Nov 2007 01:2=\r\n2:49 +0000Subject: [EVP-ITC] Re: Just the fact!\n\n\n\n\nChris was the first and=\r\n only person testing this device for quite sometime, making him the &quot;primar=\r\ny tester&quot;. The dictionary defines the word&quot;primary&quot; as being or standing fi=\r\nrst in a list. You offer that he wasalso the first to understand how it was=\r\n supposed to be used. Yet, nowas more and more people weigh in with their o=\r\nwn opinions you questionyour initial judgment. The fact is that Chris&#39; opin=\r\nion of how the boxshould be used has never changed. He has held steadfast t=\r\no hisbeliefs. That, my friend, is an honorable trait in this field and afac=\r\nt that should be considered. Chris has also never claimed this technology t=\r\no be his own. He hasalways and will always give credit where credit is due.=\r\n He does thisboth publicly and privately. The use of syntax here on whether=\r\n we call it Frank&#39;s Box, TheTelephone to the Dead, Maxi/Mini Box, or Granol=\r\na in a can is of noimportance. Truly, because Edison&#39;s plans were never dis=\r\ncovered thereis no way to know for sure whether or not your plans are exact=\r\nly whatEdison was working on. There also seems to be a bit of confusion on =\r\nthe role the&quot;technicians&quot; play in this along with another syntax issue ( co=\r\nuld thewords network and technician be used interchangeably?). Thetechnicia=\r\nns are not interpreters. They can provide assistance to thosespirits too ex=\r\ncited or otherwise unable to communicate effectively.And they, the technici=\r\nans, also serve to assist higher vibrations comethrough (just as your &quot;netw=\r\nork&quot;). They can also be of benefit whenlower vibrations try to get through.=\r\n You state you heard a voice say &quot;Edison here&quot; and awhile back you hadposte=\r\nd that you did believe it to in fact be Edison himself. Yet nowyou say the =\r\n&quot;supposed&quot; Edison conversation. As for portals... I&#39;ve made my concerns cle=\r\nar previously known.However, I have witnessed the box being used in one loc=\r\nation only tohave activity spike in another. I&#39;ve also heard many other sto=\r\nriesrelated to dark or lower entities. So, perhaps you have had noexperienc=\r\nes yet but, others have and they are speaking up. You repeatedly state that=\r\n Chris is a good guy but then you say &quot;if hecan&#39;t use it in an honest manne=\r\nr...&quot; What could be more honest thansomeone sticking to the same beliefs he=\r\n&#39;s held since day one? Whatcould be more honorable than stating his fears a=\r\nnd providing what hefeels is a needed warning? Frank, isn&#39;t it possible tha=\r\nt you two both bring something separate tothis device? You, the technology =\r\nand science said. Chris, the mediumand spiritual side. Someone posted separ=\r\nately here about Chris&#39; ego. I can say this...having concern for the possib=\r\nle negative fall out to unsuspectingpeople is in no way ego ridden. To assu=\r\nme that you know Chris&#39;intentions is full of ego. To claim that he only wan=\r\nts to preventothers from having a device for selfish reasons, is ego&#39;s way =\r\noftelling you that you and everyone else &quot;deserves&quot; to have what we donot f=\r\nully understand. Ego won&#39;t let you consider that because &quot;youwant what you =\r\nwant when you want it&quot;.BTW- when the word &quot;harmony&quot; is referred to here it =\r\nis not a &quot;feelinginside&quot; like self esteem or some other warm fuzzy. It is a=\r\nboutresonance, vibrations, that which will be matched by like resonanceand =\r\nvibrations. Harmony. --- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks=\r\n-boxes@...&gt; wrote:&gt;&gt; &gt; I did, from the begining open this to anyone, and I =\r\nam not amusedthat one person would take the technogoly, claim it as his own=\r\n, andattempt to make it exclusive to himself. For one person to say he isth=\r\ne &quot;primary tester&quot; is inaccurate, he was the first that kindaunderstood how=\r\n it was supposed to be used, or so I thought. I think weleft the &quot;treting p=\r\nhase&quot; some time ago, perhaps it&#39;s time to returnbarrowed equipment?&gt; &gt; I wa=\r\nsn&#39;t quite finished with that e-mail-- I hit the send button inmy rush to g=\r\net off to work. &gt; &gt; &gt; &gt; I put out a box use guideline thing a year or two a=\r\ngo stating thatno one has the right to take my equipment and and claim thei=\r\nr usesupercedes anyones else&#39;s use, or results.&gt; &gt; So, to contiue...&gt; &gt; As =\r\na far as &quot;technicians&quot; I don&#39;t get any of that stuff, but---theydo talk abo=\r\nut a network, and connection to our equipment. When I firstmade my &quot;Ghostma=\r\nn&quot; box, last week, it wasn&#39;t working well, but a dayor so later, it came to=\r\n life, and one of the voices said it had beenconnected to &quot;the network&quot;. Su=\r\npposedly there is a similar connectionmade to computers running EVPmaker. I=\r\n&#39;m not sure if these &quot;network&quot;connections are maintained if equipment is ta=\r\nken out forinvestigations, or demostrations. Of cousre, I can&#39;t say if thes=\r\nenetworks are a fact. I would think as maker of the box, these etherictechs=\r\n might want to give me, or others some hints.&gt; &gt; As far as the ghost box, o=\r\nr Frank&#39;s box, being a &quot;telephone to thedead&quot;, I think is very poor analogy=\r\n, the old style phone system ofEdison&#39;s day had operators, plural, not one =\r\nperson that recieved allcalls, then interpreted what was being said to othe=\r\nr parties. That&#39;smore of a master control schema.The old phone system didn&#39;=\r\nt charge youan arm and a leg to talk to someone in the same room either! So=\r\nmemight say these &quot;Technicains&quot; are the operators, but even if anyoneesle c=\r\nould hear these voices, why do you need someone to interpretwhat&#39;s being sa=\r\nid. I say if not many can hear it, or somethingsimilar, it ain&#39;t real! Ther=\r\ne is a certain kind of conatct, ion thatthat your own mind uses the noise a=\r\ns a sort of psychic prop, you hearthe stuff in your head, it may be accurat=\r\ne and real inforamntiion, butno one else is going to hear it. i think that =\r\nwhat all this supposedconverstions wiht Edison maybe. I have in fact heard =\r\na voice thatsaid &quot;Edison here&quot; but there was no other real information conv=\r\neyedthat I could understand. &gt; As for portals, demons and evil spirits ente=\r\nring the world throughthese &quot;unauthorized&quot; boxes, I an only say, as the ori=\r\nginal mker of thebox, I have gotten voices cuzzing, swearing, name calling,=\r\n and eventhreatening, but nothing that has seemingly &quot;entered&quot; our world. E=\r\nventhose &quot;threatening entities&quot;, when pressed to bring it, fold up likepape=\r\nr tigers. These beings and spirits already exist all around us,and at a hig=\r\nher level, so they have full access to this, a lowerlever. Besides. There i=\r\ns that &quot;network&quot; that seem to allow for bettercontacts, and kinda helps hig=\r\nhter being to come through. &gt; &gt; I made these &quot;boxes&quot;! The idea was not &quot;Edi=\r\nsons Telephone...&quot; WhatI got was an assemblage of my own expereince and kno=\r\nwlegde, puttogether by my own mind as answer to my question of what else co=\r\nuld Iuse for spirit comuncation. All technology involved was based on whatI=\r\n had worked on in the past for radio experimentation. I had in fact,a coupl=\r\ne years before my interest in EVP, been experimenting withvoltage tunable r=\r\nadio modules removed from car stereos for AM DX,that&#39;s listening to distant=\r\n AM radio stations. I was hoping to findother talk shows similar to Art Bel=\r\nl, and there used to be one out ofCincinati(?). The idea of using a random =\r\nvoltage to tune the radio wasafter using EVPmaker, which uses a method of g=\r\nenerating random speechbits for the entities to use. It was a small leap to=\r\n apply the randomtechnique to an anolog system. I am not the first to be fo=\r\ncusing on aproblem, and have the mind provide an solution in complete form.=\r\nNothing mystical about it. The fact is, after much work, andexperimenting, =\r\nthe tuning doesn&#39;t have to be random, a linear tuningworks much better. Yet=\r\n another fact of the box, covienently ignored.&gt; &gt; What really chaps my hide=\r\n, as maker of the box, is to have someone,who knows nothing of electronics,=\r\n and technology completely ignoreeverything I say about the box, and presum=\r\ne to tell me how it reallyworks, how it should be used, and what is accepta=\r\nble from it. This guyis so honest, he won&#39;t even use his real name, but huf=\r\nf and puff at atanyone that contradicts his use of my equipment. I say, as =\r\n&quot;a Tester&quot;if you can&#39;t use it in an honest manor, bring the stuff back--tes=\r\ntingover! Like it or not, the public has this technology, you can keeppissi=\r\nng and moaning, trying to spread fear, or you could choose theway of Light.=\r\n &gt; &gt; Frank-S&gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; _______________________________________________=\r\n___________&gt; Share life as it happens with the new Windows Live.Download to=\r\ndayit&#39;s FREE!&gt;http://www.windowslive.com/share.html?ocid=3DTXT_TAGLM_Wave2_=\r\nsharelife_112007&gt; \n\n\n\n\n\n\n__________________________________________________=\r\n_______________\nShare life as it happens with the new Windows Live.Download=\r\n today it&#39;s FREE!\nhttp://www.windowslive.com/share.html?ocid=3DTXT_TAGLM_Wa=\r\nve2_sharelife_112007\r\n--_1fc9e2b9-9585-4c0b-8984-115c315489b1_\r\nContent-Type: text/html; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;\n&lt;head&gt;\n&lt;style&gt;\n.hmmessage P\n{\nmargin:0px;\npadding:0px\n}\nbody.hmmessa=\r\nge\n{\nFONT-SIZE: 10pt;\nFONT-FAMILY:Tahoma\n}\n&lt;/style&gt;\n&lt;/head&gt;\n&lt;body class=3D&#39;=\r\nhmmessage&#39;&gt;\nYeah, it could be the boxes, and any of this kind of technolgy =\r\nworks different for everyone, but Moon claims all others users get &quot;false c=\r\nommuncation&quot;, or only the &quot;bad guys&quot;, and I say he has no right, and no aut=\r\nhority to make that assertion. &lt;BR&gt;\n&nbsp;&lt;BR&gt;\n&nbsp;Yes,&nbsp;I did hear a=\r\n voice that said &quot;Edison here&quot;, was it Edison?, who knows, and no other &lt;U&gt;=\r\nmeaningful&lt;/U&gt; information was heard by me. &lt;BR&gt;\n&nbsp;&lt;BR&gt;\n&nbsp;As for th=\r\ne &quot;technicians&quot;, I have never gotten anyone claiming to be a technician fro=\r\nm the other side, nor have I goten any technical assistence what so ever fo=\r\nr any voice from the boxes. I get only unknow voices that talk about a netw=\r\nork connection, I have no idea who they are ,&nbsp;or what the network cons=\r\nists of. &nbsp;&lt;BR&gt;\n&nbsp;&lt;BR&gt;\n&nbsp;I don&#39;t give a crapp who uses the box,=\r\n and what they use if for, until one user or another claims to be the only =\r\nauthority on the box. &nbsp;Claiming all others are only getting demons, or=\r\n false voices, and opening portals, is false, and deliberatly false to in a=\r\nn attempt to descredit any compeditors.&nbsp; $500 an hour for box access i=\r\ns criminal! &lt;BR&gt;\n&nbsp;&lt;BR&gt;\n&nbsp;Portals is Hollywood! &lt;BR&gt;\n&nbsp;&lt;BR&gt;\n&nb=\r\nsp;&lt;BR&gt;\n&nbsp;I&#39;m not the one that said harmony.&nbsp;&nbsp;&lt;BR&gt;\n&nbsp;&lt;BR&gt;=\r\n\n&nbsp;Frank-S&lt;BR&gt;&lt;BR&gt;\n&lt;BLOCKQUOTE&gt;\n&lt;HR&gt;\nTo: EVP-ITC@yahoogroups.com&lt;BR&gt;Fro=\r\nm: babiarz3@...&lt;BR&gt;Date: Fri, 30 Nov 2007 01:22:49 +0000&lt;BR&gt;Subject: =\r\n[EVP-ITC] Re: Just the fact!&lt;BR&gt;&lt;BR&gt;\n&lt;META content=3D&quot;Microsoft SafeHTML&quot; n=\r\name=3DGenerator&gt;\n&lt;DIV id=3DEC_ygrp-mlmsg style=3D&quot;WIDTH: 655px&quot;&gt;\n&lt;DIV id=3D=\r\nEC_ygrp-msg style=3D&quot;PADDING-RIGHT: 15px; PADDING-LEFT: 0px; Z-INDEX: 1; FL=\r\nOAT: left; PADDING-BOTTOM: 0px; WIDTH: 490px; PADDING-TOP: 0px&quot;&gt;\n&lt;DIV id=3D=\r\nEC_ygrp-text&gt;\nChris was the first and only person testing this device for q=\r\nuite some&lt;BR&gt;time, making him the &quot;primary tester&quot;. The dictionary defines =\r\nthe word&lt;BR&gt;&quot;primary&quot; as being or standing first in a list. You offer that =\r\nhe was&lt;BR&gt;also the first to understand how it was supposed to be used. Yet,=\r\n now&lt;BR&gt;as more and more people weigh in with their own opinions you questi=\r\non&lt;BR&gt;your initial judgment. The fact is that Chris&#39; opinion of how the box=\r\n&lt;BR&gt;should be used has never changed. He has held steadfast to his&lt;BR&gt;belie=\r\nfs. That, my friend, is an honorable trait in this field and a&lt;BR&gt;fact that=\r\n should be considered. &lt;BR&gt;Chris has also never claimed this technology to =\r\nbe his own. He has&lt;BR&gt;always and will always give credit where credit is du=\r\ne. He does this&lt;BR&gt;both publicly and privately. &lt;BR&gt;The use of syntax here =\r\non whether we call it Frank&#39;s Box, The&lt;BR&gt;Telephone to the Dead, Maxi/Mini =\r\nBox, or Granola in a can is of no&lt;BR&gt;importance. Truly, because Edison&#39;s pl=\r\nans were never discovered there&lt;BR&gt;is no way to know for sure whether or no=\r\nt your plans are exactly what&lt;BR&gt;Edison was working on. &lt;BR&gt;There also seem=\r\ns to be a bit of confusion on the role the&lt;BR&gt;&quot;technicians&quot; play in this al=\r\nong with another syntax issue ( could the&lt;BR&gt;words network and technician b=\r\ne used interchangeably?&lt;WBR&gt;). The&lt;BR&gt;technicians are not interpreters. The=\r\ny can provide assistance to those&lt;BR&gt;spirits too excited or otherwise unabl=\r\ne to communicate effectively.&lt;BR&gt;And they, the technicians, also serve to a=\r\nssist higher vibrations come&lt;BR&gt;through (just as your &quot;network&quot;). They can =\r\nalso be of benefit when&lt;BR&gt;lower vibrations try to get through. &lt;BR&gt;You sta=\r\nte you heard a voice say &quot;Edison here&quot; and awhile back you had&lt;BR&gt;posted th=\r\nat you did believe it to in fact be Edison himself. Yet now&lt;BR&gt;you say the =\r\n&quot;supposed&quot; Edison conversation. &lt;BR&gt;As for portals... I&#39;ve made my concerns=\r\n clear previously known.&lt;BR&gt;However, I have witnessed the box being used in=\r\n one location only to&lt;BR&gt;have activity spike in another. I&#39;ve also heard ma=\r\nny other stories&lt;BR&gt;related to dark or lower entities. So, perhaps you have=\r\n had no&lt;BR&gt;experiences yet but, others have and they are speaking up. &lt;BR&gt;Y=\r\nou repeatedly state that Chris is a good guy but then you say &quot;if he&lt;BR&gt;can=\r\n&#39;t use it in an honest manner...&quot; What could be more honest than&lt;BR&gt;someone=\r\n sticking to the same beliefs he&#39;s held since day one? What&lt;BR&gt;could be mor=\r\ne honorable than stating his fears and providing what he&lt;BR&gt;feels is a need=\r\ned warning? &lt;BR&gt;Frank, isn&#39;t it possible that you two both bring something =\r\nseparate to&lt;BR&gt;this device? You, the technology and science said. Chris, th=\r\ne medium&lt;BR&gt;and spiritual side. &lt;BR&gt;Someone posted separately here about Ch=\r\nris&#39; ego. I can say this...&lt;BR&gt;having concern for the possible negative fal=\r\nl out to unsuspecting&lt;BR&gt;people is in no way ego ridden. To assume that you=\r\n know Chris&#39;&lt;BR&gt;intentions is full of ego. To claim that he only wants to p=\r\nrevent&lt;BR&gt;others from having a device for selfish reasons, is ego&#39;s way of&lt;=\r\nBR&gt;telling you that you and everyone else &quot;deserves&quot; to have what we do&lt;BR&gt;=\r\nnot fully understand. Ego won&#39;t let you consider that because &quot;you&lt;BR&gt;want =\r\nwhat you want when you want it&quot;.&lt;BR&gt;BTW- when the word &quot;harmony&quot; is referre=\r\nd to here it is not a &quot;feeling&lt;BR&gt;inside&quot; like self esteem or some other wa=\r\nrm fuzzy. It is about&lt;BR&gt;resonance, vibrations, that which will be matched =\r\nby like resonance&lt;BR&gt;and vibrations. Harmony. &lt;BR&gt;--- In &lt;A href=3D&quot;mailto:=\r\nEVP-ITC@yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;, Frank Sumption &=\r\nlt;franks-boxes@&lt;WBR&gt;...&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; &lt;BR&gt;&gt; I did, from th=\r\ne begining open this to anyone, and I am not amused&lt;BR&gt;that one person woul=\r\nd take the technogoly, claim it as his own, and&lt;BR&gt;attempt to make it exclu=\r\nsive to himself. For one person to say he is&lt;BR&gt;the &quot;primary tester&quot; is ina=\r\nccurate, he was the first that kinda&lt;BR&gt;understood how it was supposed to b=\r\ne used, or so I thought. I think we&lt;BR&gt;left the &quot;treting phase&quot; some time a=\r\ngo, perhaps it&#39;s time to return&lt;BR&gt;barrowed equipment?&lt;BR&gt;&gt; &lt;BR&gt;&gt; I w=\r\nasn&#39;t quite finished with that e-mail-- I hit the send button in&lt;BR&gt;my rush=\r\n to get off to work. &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; I put out a box us=\r\ne guideline thing a year or two ago stating that&lt;BR&gt;no one has the right to=\r\n take my equipment and and claim their use&lt;BR&gt;supercedes anyones else&#39;s use=\r\n, or results.&lt;BR&gt;&gt; &lt;BR&gt;&gt; So, to contiue...&lt;BR&gt;&gt; &lt;BR&gt;&gt; As a far =\r\nas &quot;technicians&quot; I don&#39;t get any of that stuff, but---they&lt;BR&gt;do talk about=\r\n a network, and connection to our equipment. When I first&lt;BR&gt;made my &quot;Ghost=\r\nman&quot; box, last week, it wasn&#39;t working well, but a day&lt;BR&gt;or so later, it c=\r\name to life, and one of the voices said it had been&lt;BR&gt;connected to &quot;the ne=\r\ntwork&quot;. Supposedly there is a similar connection&lt;BR&gt;made to computers runni=\r\nng EVPmaker. I&#39;m not sure if these &quot;network&quot;&lt;BR&gt;connections are maintained =\r\nif equipment is taken out for&lt;BR&gt;investigations, or demostrations. Of cousr=\r\ne, I can&#39;t say if these&lt;BR&gt;networks are a fact. I would think as maker of t=\r\nhe box, these etheric&lt;BR&gt;techs might want to give me, or others some hints.=\r\n&lt;BR&gt;&gt; &lt;BR&gt;&gt; As far as the ghost box, or Frank&#39;s box, being a &quot;telepho=\r\nne to the&lt;BR&gt;dead&quot;, I think is very poor analogy, the old style phone syste=\r\nm of&lt;BR&gt;Edison&#39;s day had operators, plural, not one person that recieved al=\r\nl&lt;BR&gt;calls, then interpreted what was being said to other parties. That&#39;s&lt;B=\r\nR&gt;more of a master control schema.The old phone system didn&#39;t charge you&lt;BR=\r\n&gt;an arm and a leg to talk to someone in the same room either! Some&lt;BR&gt;might=\r\n say these &quot;Technicains&quot; are the operators, but even if anyone&lt;BR&gt;esle coul=\r\nd hear these voices, why do you need someone to interpret&lt;BR&gt;what&#39;s being s=\r\naid. I say if not many can hear it, or something&lt;BR&gt;similar, it ain&#39;t real!=\r\n There is a certain kind of conatct, ion that&lt;BR&gt;that your own mind uses th=\r\ne noise as a sort of psychic prop, you hear&lt;BR&gt;the stuff in your head, it m=\r\nay be accurate and real inforamntiion, but&lt;BR&gt;no one else is going to hear =\r\nit. i think that what all this supposed&lt;BR&gt;converstions wiht Edison maybe. =\r\nI have in fact heard a voice that&lt;BR&gt;said &quot;Edison here&quot; but there was no ot=\r\nher real information conveyed&lt;BR&gt;that I could understand. &lt;BR&gt;&gt; As for p=\r\nortals, demons and evil spirits entering the world through&lt;BR&gt;these &quot;unauth=\r\norized&quot; boxes, I an only say, as the original mker of the&lt;BR&gt;box, I have go=\r\ntten voices cuzzing, swearing, name calling, and even&lt;BR&gt;threatening, but n=\r\nothing that has seemingly &quot;entered&quot; our world. Even&lt;BR&gt;those &quot;threatening e=\r\nntities&quot;, when pressed to bring it, fold up like&lt;BR&gt;paper tigers. These bei=\r\nngs and spirits already exist all around us,&lt;BR&gt;and at a higher level, so t=\r\nhey have full access to this, a lower&lt;BR&gt;lever. Besides. There is that &quot;net=\r\nwork&quot; that seem to allow for better&lt;BR&gt;contacts, and kinda helps highter be=\r\ning to come through. &lt;BR&gt;&gt; &lt;BR&gt;&gt; I made these &quot;boxes&quot;! The idea was n=\r\not &quot;Edisons Telephone...&lt;WBR&gt;&quot; What&lt;BR&gt;I got was an assemblage of my own ex=\r\npereince and knowlegde, put&lt;BR&gt;together by my own mind as answer to my ques=\r\ntion of what else could I&lt;BR&gt;use for spirit comuncation. All technology inv=\r\nolved was based on what&lt;BR&gt;I had worked on in the past for radio experiment=\r\nation. I had in fact,&lt;BR&gt;a couple years before my interest in EVP, been exp=\r\nerimenting with&lt;BR&gt;voltage tunable radio modules removed from car stereos f=\r\nor AM DX,&lt;BR&gt;that&#39;s listening to distant AM radio stations. I was hoping to=\r\n find&lt;BR&gt;other talk shows similar to Art Bell, and there used to be one out=\r\n of&lt;BR&gt;Cincinati(?)&lt;WBR&gt;. The idea of using a random voltage to tune the ra=\r\ndio was&lt;BR&gt;after using EVPmaker, which uses a method of generating random s=\r\npeech&lt;BR&gt;bits for the entities to use. It was a small leap to apply the ran=\r\ndom&lt;BR&gt;technique to an anolog system. I am not the first to be focusing on =\r\na&lt;BR&gt;problem, and have the mind provide an solution in complete form.&lt;BR&gt;No=\r\nthing mystical about it. The fact is, after much work, and&lt;BR&gt;experimenting=\r\n, the tuning doesn&#39;t have to be random, a linear tuning&lt;BR&gt;works much bette=\r\nr. Yet another fact of the box, covienently ignored.&lt;BR&gt;&gt; &lt;BR&gt;&gt; What =\r\nreally chaps my hide, as maker of the box, is to have someone,&lt;BR&gt;who knows=\r\n nothing of electronics, and technology completely ignore&lt;BR&gt;everything I s=\r\nay about the box, and presume to tell me how it really&lt;BR&gt;works, how it sho=\r\nuld be used, and what is acceptable from it. This guy&lt;BR&gt;is so honest, he w=\r\non&#39;t even use his real name, but huff and puff at at&lt;BR&gt;anyone that contrad=\r\nicts his use of my equipment. I say, as &quot;a Tester&quot;&lt;BR&gt;if you can&#39;t use it i=\r\nn an honest manor, bring the stuff back--testing&lt;BR&gt;over! Like it or not, t=\r\nhe public has this technology, you can keep&lt;BR&gt;pissing and moaning, trying =\r\nto spread fear, or you could choose the&lt;BR&gt;way of Light. &lt;BR&gt;&gt; &lt;BR&gt;&gt; =\r\nFrank-S&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&=\r\ngt; ____________&lt;WBR&gt;_________&lt;WBR&gt;_________&lt;WBR&gt;_________&lt;WBR&gt;_________&lt;WB=\r\nR&gt;_________&lt;WBR&gt;_&lt;BR&gt;&gt; Share life as it happens with the new Windows Liv=\r\ne.Download today&lt;BR&gt;it&#39;s FREE!&lt;BR&gt;&gt;&lt;BR&gt;&lt;A href=3D&quot;http://www.windowslive=\r\n.com/share.html?ocid=3DTXT_TAGLM_Wave2_sharelife_112007&quot; target=3D_blank&gt;ht=\r\ntp://www.windowsl&lt;WBR&gt;ive.com/share.&lt;WBR&gt;html?ocid=3D&lt;WBR&gt;TXT_TAGLM_&lt;WBR&gt;Wa=\r\nve2_sharelife_&lt;WBR&gt;112007&lt;/A&gt;&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;SPAN style=3D&quot;COLOR=\r\n: white&quot;&gt;&lt;/SPAN&gt; \n&lt;STYLE&gt;\n.ExternalClass #EC_ygrp-mkp\n{border:1px solid #d8=\r\nd8d8;font-family:Arial;padding:0px 14px;}\n.ExternalClass #EC_ygrp-mkp hr\n{b=\r\norder:1px solid #d8d8d8;}\n.ExternalClass #EC_ygrp-mkp #EC_hd\n{color:#628c2a=\r\n;font-size:85%;font-weight:bold;line-height:122%;}\n.ExternalClass #EC_ygrp-=\r\nmkp #EC_ads\n{margin-bottom:10px;}\n.ExternalClass #EC_ygrp-mkp .EC_ad\n{paddi=\r\nng:0 0;}\n.ExternalClass #EC_ygrp-mkp .EC_ad a\n{color:#0000ff;text-decoratio=\r\nn:none;}\n\n&lt;/STYLE&gt;\n\n&lt;STYLE&gt;\n.ExternalClass #EC_ygrp-sponsor #EC_ygrp-lc\n{fo=\r\nnt-family:Arial;}\n.ExternalClass #EC_ygrp-sponsor #EC_ygrp-lc #EC_hd\n{font-=\r\nweight:bold;font-size:78%;line-height:122%;}\n.ExternalClass #EC_ygrp-sponso=\r\nr #EC_ygrp-lc .EC_ad\n{margin-bottom:10px;padding:0 0;}\n\n&lt;/STYLE&gt;\n\n&lt;STYLE&gt;\n.=\r\nExternalClass #EC_ygrp-mlmsg\n{font-size:13px;font-family:arial,helvetica,cl=\r\nean,sans-serif;}\n.ExternalClass #EC_ygrp-mlmsg table\n{font-size:inherit;fon=\r\nt:100%;}\n.ExternalClass #EC_ygrp-mlmsg select, .ExternalClass input, .Exter=\r\nnalClass textarea\n{font:99% arial,helvetica,clean,sans-serif;}\n.ExternalCla=\r\nss #EC_ygrp-mlmsg pre, .ExternalClass code\n{font:115% monospace;}\n.External=\r\nClass #EC_ygrp-mlmsg EC_*\n{line-height:1.22em;}\n.ExternalClass #EC_ygrp-tex=\r\nt\n{font-family:Georgia;}\n.ExternalClass #EC_ygrp-text p\n{;}\n.ExternalClass =\r\n#EC_ygrp-tpmsgs\n{font-family:Arial;clear:both;}\n.ExternalClass #EC_ygrp-vit=\r\nnav\n{padding-top:10px;font-family:Verdana;font-size:77%;}\n.ExternalClass #E=\r\nC_ygrp-vitnav a\n{padding:0 1px;}\n.ExternalClass #EC_ygrp-actbar\n{clear:both=\r\n;white-space:nowrap;color:#666;text-align:right;}\n.ExternalClass #EC_ygrp-a=\r\nctbar .EC_left\n{float:left;white-space:nowrap;}\n.ExternalClass .EC_bld\n{fon=\r\nt-weight:bold;}\n.ExternalClass #EC_ygrp-grft\n{font-family:Verdana;font-size=\r\n:77%;padding:15px 0;}\n.ExternalClass #EC_ygrp-ft\n{font-family:verdana;font-=\r\nsize:77%;border-top:1px solid #666;padding:5px 0;}\n.ExternalClass #EC_ygrp-=\r\nmlmsg #EC_logo\n{padding-bottom:10px;}\n.ExternalClass #EC_ygrp-vital\n{backgr=\r\nound-color:#e0ecee;margin-bottom:20px;padding:2px 0 8px 8px;}\n.ExternalClas=\r\ns #EC_ygrp-vital #EC_vithd\n{font-size:77%;font-family:Verdana;font-weight:b=\r\nold;color:#333;text-transform:uppercase;}\n.ExternalClass #EC_ygrp-vital ul\n=\r\n{padding:0;}\n.ExternalClass #EC_ygrp-vital ul li\n{list-style-type:none;clea=\r\nr:both;border:1px solid #e0ecee;}\n.ExternalClass #EC_ygrp-vital ul li .EC_c=\r\nt\n{font-weight:bold;color:#ff7900;float:right;width:2em;text-align:right;pa=\r\ndding-right:.5em;}\n.ExternalClass #EC_ygrp-vital ul li .EC_cat\n{font-weight=\r\n:bold;}\n.ExternalClass #EC_ygrp-vital a\n{text-decoration:none;}\n.ExternalCl=\r\nass #EC_ygrp-vital a:hover\n{text-decoration:underline;}\n.ExternalClass #EC_=\r\nygrp-sponsor #EC_hd\n{color:#999;font-size:77%;}\n.ExternalClass #EC_ygrp-spo=\r\nnsor #EC_ov\n{padding:6px 13px;background-color:#e0ecee;margin-bottom:20px;}=\r\n\n.ExternalClass #EC_ygrp-sponsor #EC_ov ul\n{padding:0 0 0 8px;}\n.ExternalCl=\r\nass #EC_ygrp-sponsor #EC_ov li\n{list-style-type:square;padding:6px 0;font-s=\r\nize:77%;}\n.ExternalClass #EC_ygrp-sponsor #EC_ov li a\n{text-decoration:none=\r\n;font-size:130%;}\n.ExternalClass #EC_ygrp-sponsor #EC_nc\n{background-color:=\r\n#eee;margin-bottom:20px;padding:0 8px;}\n.ExternalClass #EC_ygrp-sponsor .EC=\r\n_ad\n{padding:8px 0;}\n.ExternalClass #EC_ygrp-sponsor .EC_ad #EC_hd1\n{font-f=\r\namily:Arial;font-weight:bold;color:#628c2a;font-size:100%;line-height:122%;=\r\n}\n.ExternalClass #EC_ygrp-sponsor .EC_ad a\n{text-decoration:none;}\n.Externa=\r\nlClass #EC_ygrp-sponsor .EC_ad a:hover\n{text-decoration:underline;}\n.Extern=\r\nalClass #EC_ygrp-sponsor .EC_ad p\n{;}\n.ExternalClass EC_o\n{font-size:0;}\n.E=\r\nxternalClass .EC_MsoNormal\n{;}\n.ExternalClass #EC_ygrp-text tt\n{font-size:1=\r\n20%;}\n.ExternalClass blockquote\n{;}\n.ExternalClass .EC_replbq\n{;}\n\n&lt;/STYLE&gt;=\r\n\n&lt;/BLOCKQUOTE&gt;&lt;br /&gt;&lt;hr /&gt;Share life as it happens with the new Windows Liv=\r\ne. &lt;a href=3D&#39;http://www.windowslive.com/share.html?ocid=3DTXT_TAGLM_Wave2_=\r\nsharelife_112007&#39; target=3D&#39;_new&#39;&gt;Share now!&lt;/a&gt;&lt;/body&gt;\n&lt;/html&gt;\r\n--_1fc9e2b9-9585-4c0b-8984-115c315489b1_--"}