{"id": "3542", "subject": "Re: Just the fact!", "author": "babiarz3", "timestamp": "2007-11-30T11:35:27Z", "full_text": "Thanks for sharing Bruce. \n\n--- In EVP-ITC@yahoogroups.com, bruce halliday\n&lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; Babiarz3,\n&gt;  \n&gt; well your another jack ass heard from, I hope your done.\n&gt;  \n&gt; bruce\n&gt; \n&gt; Bruce Halliday Paranormal Investigating Team \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: babiarz3@...: Fri, 30 Nov 2007 01:22:49\n+0000Subject: [EVP-ITC] Re: Just the fact!\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Chris was the first and only person testing this device for quite\nsometime, making him the &quot;primary tester&quot;. The dictionary defines the\nword&quot;primary&quot; as being or standing first in a list. You offer that he\nwasalso the first to understand how it was supposed to be used. Yet,\nnowas more and more people weigh in with their own opinions you\nquestionyour initial judgment. The fact is that Chris&#39; opinion of how\nthe boxshould be used has never changed. He has held steadfast to\nhisbeliefs. That, my friend, is an honorable trait in this field and\nafact that should be considered. Chris has also never claimed this\ntechnology to be his own. He hasalways and will always give credit\nwhere credit is due. He does thisboth publicly and privately. The use\nof syntax here on whether we call it Frank&#39;s Box, TheTelephone to the\nDead, Maxi/Mini Box, or Granola in a can is of noimportance. Truly,\nbecause Edison&#39;s plans were never discovered thereis no way to know\nfor sure whether or not your plans are exactly whatEdison was working\non. There also seems to be a bit of confusion on the role\nthe&quot;technicians&quot; play in this along with another syntax issue ( could\nthewords network and technician be used interchangeably?).\nThetechnicians are not interpreters. They can provide assistance to\nthosespirits too excited or otherwise unable to communicate\neffectively.And they, the technicians, also serve to assist higher\nvibrations comethrough (just as your &quot;network&quot;). They can also be of\nbenefit whenlower vibrations try to get through. You state you heard a\nvoice say &quot;Edison here&quot; and awhile back you hadposted that you did\nbelieve it to in fact be Edison himself. Yet nowyou say the &quot;supposed&quot;\nEdison conversation. As for portals... I&#39;ve made my concerns clear\npreviously known.However, I have witnessed the box being used in one\nlocation only tohave activity spike in another. I&#39;ve also heard many\nother storiesrelated to dark or lower entities. So, perhaps you have\nhad noexperiences yet but, others have and they are speaking up. You\nrepeatedly state that Chris is a good guy but then you say &quot;if hecan&#39;t\nuse it in an honest manner...&quot; What could be more honest thansomeone\nsticking to the same beliefs he&#39;s held since day one? Whatcould be\nmore honorable than stating his fears and providing what hefeels is a\nneeded warning? Frank, isn&#39;t it possible that you two both bring\nsomething separate tothis device? You, the technology and science\nsaid. Chris, the mediumand spiritual side. Someone posted separately\nhere about Chris&#39; ego. I can say this...having concern for the\npossible negative fall out to unsuspectingpeople is in no way ego\nridden. To assume that you know Chris&#39;intentions is full of ego. To\nclaim that he only wants to preventothers from having a device for\nselfish reasons, is ego&#39;s way oftelling you that you and everyone else\n&quot;deserves&quot; to have what we donot fully understand. Ego won&#39;t let you\nconsider that because &quot;youwant what you want when you want it&quot;.BTW-\nwhen the word &quot;harmony&quot; is referred to here it is not a\n&quot;feelinginside&quot; like self esteem or some other warm fuzzy. It is\naboutresonance, vibrations, that which will be matched by like\nresonanceand vibrations. Harmony. --- In EVP-ITC@yahoogroups.com,\nFrank Sumption &lt;franks-boxes@&gt; wrote:&gt;&gt; &gt; I did, from the begining\nopen this to anyone, and I am not amusedthat one person would take the\ntechnogoly, claim it as his own, andattempt to make it exclusive to\nhimself. For one person to say he isthe &quot;primary tester&quot; is\ninaccurate, he was the first that kindaunderstood how it was supposed\nto be used, or so I thought. I think weleft the &quot;treting phase&quot; some\ntime ago, perhaps it&#39;s time to returnbarrowed equipment?&gt; &gt; I wasn&#39;t\nquite finished with that e-mail-- I hit the send button inmy rush to\nget off to work. &gt; &gt; &gt; &gt; I put out a box use guideline thing a year or\ntwo ago stating thatno one has the right to take my equipment and and\nclaim their usesupercedes anyones else&#39;s use, or results.&gt; &gt; So, to\ncontiue...&gt; &gt; As a far as &quot;technicians&quot; I don&#39;t get any of that stuff,\nbut---theydo talk about a network, and connection to our equipment.\nWhen I firstmade my &quot;Ghostman&quot; box, last week, it wasn&#39;t working well,\nbut a dayor so later, it came to life, and one of the voices said it\nhad beenconnected to &quot;the network&quot;. Supposedly there is a similar\nconnectionmade to computers running EVPmaker. I&#39;m not sure if these\n&quot;network&quot;connections are maintained if equipment is taken out\nforinvestigations, or demostrations. Of cousre, I can&#39;t say if\nthesenetworks are a fact. I would think as maker of the box, these\netherictechs might want to give me, or others some hints.&gt; &gt; As far as\nthe ghost box, or Frank&#39;s box, being a &quot;telephone to thedead&quot;, I think\nis very poor analogy, the old style phone system ofEdison&#39;s day had\noperators, plural, not one person that recieved allcalls, then\ninterpreted what was being said to other parties. That&#39;smore of a\nmaster control schema.The old phone system didn&#39;t charge youan arm and\na leg to talk to someone in the same room either! Somemight say these\n&quot;Technicains&quot; are the operators, but even if anyoneesle could hear\nthese voices, why do you need someone to interpretwhat&#39;s being said. I\nsay if not many can hear it, or somethingsimilar, it ain&#39;t real! There\nis a certain kind of conatct, ion thatthat your own mind uses the\nnoise as a sort of psychic prop, you hearthe stuff in your head, it\nmay be accurate and real inforamntiion, butno one else is going to\nhear it. i think that what all this supposedconverstions wiht Edison\nmaybe. I have in fact heard a voice thatsaid &quot;Edison here&quot; but there\nwas no other real information conveyedthat I could understand. &gt; As\nfor portals, demons and evil spirits entering the world throughthese\n&quot;unauthorized&quot; boxes, I an only say, as the original mker of thebox, I\nhave gotten voices cuzzing, swearing, name calling, and\neventhreatening, but nothing that has seemingly &quot;entered&quot; our world.\nEventhose &quot;threatening entities&quot;, when pressed to bring it, fold up\nlikepaper tigers. These beings and spirits already exist all around\nus,and at a higher level, so they have full access to this, a\nlowerlever. Besides. There is that &quot;network&quot; that seem to allow for\nbettercontacts, and kinda helps highter being to come through. &gt; &gt; I\nmade these &quot;boxes&quot;! The idea was not &quot;Edisons Telephone...&quot; WhatI got\nwas an assemblage of my own expereince and knowlegde, puttogether by\nmy own mind as answer to my question of what else could Iuse for\nspirit comuncation. All technology involved was based on whatI had\nworked on in the past for radio experimentation. I had in fact,a\ncouple years before my interest in EVP, been experimenting withvoltage\ntunable radio modules removed from car stereos for AM DX,that&#39;s\nlistening to distant AM radio stations. I was hoping to findother talk\nshows similar to Art Bell, and there used to be one out\nofCincinati(?). The idea of using a random voltage to tune the radio\nwasafter using EVPmaker, which uses a method of generating random\nspeechbits for the entities to use. It was a small leap to apply the\nrandomtechnique to an anolog system. I am not the first to be focusing\non aproblem, and have the mind provide an solution in complete\nform.Nothing mystical about it. The fact is, after much work,\nandexperimenting, the tuning doesn&#39;t have to be random, a linear\ntuningworks much better. Yet another fact of the box, covienently\nignored.&gt; &gt; What really chaps my hide, as maker of the box, is to have\nsomeone,who knows nothing of electronics, and technology completely\nignoreeverything I say about the box, and presume to tell me how it\nreallyworks, how it should be used, and what is acceptable from it.\nThis guyis so honest, he won&#39;t even use his real name, but huff and\npuff at atanyone that contradicts his use of my equipment. I say, as\n&quot;a Tester&quot;if you can&#39;t use it in an honest manor, bring the stuff\nback--testingover! Like it or not, the public has this technology, you\ncan keeppissing and moaning, trying to spread fear, or you could\nchoose theway of Light. &gt; &gt; Frank-S&gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt;\n__________________________________________________________&gt; Share life\nas it happens with the new Windows Live.Download todayit&#39;s\nFREE!&gt;http://www.windowslive.com/share.html?ocid=TXT_TAGLM_Wave2_sharelife_112007&gt;\n\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; You keep typing, we keep giving. Download Messenger and join the i&#39;m\nInitiative now.\n&gt; http://im.live.com/messenger/im/home/?source=TAGLM\n&gt;"}