{"id": "3558", "subject": "Re: Please read this entire post before you jump down my throat!", "author": "Travis", "timestamp": "2007-11-30T18:42:08Z", "full_text": "I respect everyone&#39;s opinions on these matters but it bothers me \nthat some people think that the majority of the research being done \nin regards to the paranormal is in correlation or directly related to \nFrank, his boxes,chris moon, and some popular television shows. That \nis not the case and some of us have been interested in it and \nactively pursuing answers to the paranormal field years before any of \nthese television shows, or before anyone ever heard of Frank&#39;s box. \nAll that has happened is you have the popular researchers and the \nones who are in it purely for research purposes and choose not to \ntalk publicly about it because they are too wrapped up in their own \nresearch and getting answers. \n   There is an under current most people can&#39;t identify with because \nit doesn&#39;t exist to be popular or to make friends. There has been \nsome great innovations and ideas put forth to enhance the ability to \nreceive real time evp&#39;s and acheive sustained two way communication \none of these ideas involves lasers. I&#39;m not here to judge people or \nsay what their motives may be, and this message is in no way taking \nshots at frank as I greatly admire his determination to get answers \nand to communicate with the other side. I am just trying to rectify a \nlot of the misconceptions people have about paranormal research.\n   As I&#39;ve said each and everyone is entitled to their opinions but \nyou can not say that paranormal research is chris moon, Frank, or \nthese popular television shows, there was paranormal research long \nbefore these things came along and it will exist long after these \npopular things are no longer popular. If anyone deserves to be in the \nfirst few chapters of a book regarding the history of paranormal \nresearch etc.. it would be Friedrich Jrgenson, Konstantin Raudive, \nand George Meek. I&#39;m not saying Frank would be excluded here. I am \nsaying with these people I mentioned this is where a lot of \nparanormal research began especially EVP&#39;s. Now once again Im not \ntalking down to people here, if I thought badly of anyone here I \nwouldnt be a member of this group. As I&#39;ve said before also I regard \nFrank S. highly, and am in awe of his determination in regards to the \nparanormal. Keep up the great job everyone. Regards,\n                                                      T.L.\n\n--- In EVP-ITC@yahoogroups.com, &quot;Sumra Dume&quot; &lt;duck@...&gt; wrote:\n&gt;\n&gt; Chris has done more to further the research of Franks Box than \n&gt; any other individual. Agree, disagree it doesn&#39;t matter! That fact \nis \n&gt; when the book is written on the ITC and how it was perfected. Frank \n&gt; and Chris will have the first and second chapters dedicated to \nthem. \n&gt; \n&gt; No matter what side of this argument you come down on there will \n&gt; always be different opinions. ITC Paranormal research may be in \nvogue \n&gt; but the idea&#39;s certainly are not new. \n&gt; \n&gt; However, we now stand at the apex of this ride. The gates are open.\n&gt; The throttle is stuck, crash or survive we&#39;re in it till the end. Go\n&gt; away!, don&#39;t read, don&#39;t try,it won&#39;t matter! This ride has left! \nEven\n&gt; jumping off won&#39;t stop it.\n&gt; \n&gt; We are now going to see an explosion of new idea&#39;s. But that&#39;s what \nit\n&gt; takes! People have to take sides, someone has to be right , someone\n&gt; has to be wrong. Without both sides there&#39;s no advancement. \n&gt; I read &quot;too many posts&quot; I hate fence sitters either you&#39;re in or\n&gt; you&#39;re out . But learn to smile and say thank you.\n&gt; \n&gt; Here&#39;s the way it is. You say I&#39;m wrong OK!.   Thank you very much! \n&gt; And I go about my business of doing what I want to do,  there&#39;s \ntruth\n&gt; to every side of an argument. Just take what is constructive and \nfile\n&gt; the rest. Just say Thank You!\n&gt; \n&gt; PS.\n&gt; To that individual who wrote me claiming to be from the Catholic \nArch\n&gt; diocesi I doubt very much that the Catholic Church uses hot mail ...\n&gt; oh it&#39;s Catholic Archdiocese  LMAO\n&gt; \n&gt; THANK YOU VERY MUCH!\n&gt; \n&gt; -Sum\n&gt;"}