{"id": "3563", "subject": "Re: [EVP-ITC] Please read this entire post before you jump down my throat!", "author": "Lisby", "timestamp": "2007-11-30T19:06:28Z", "full_text": "I&#39;ll be looking forward to your continuously wonderful and astounding  \nresults, Bruce. Tell Mike and Linda hi! :)\n\nAnn\n\n\nOn Nov 30, 2007, at 2:01 PM, bruce halliday wrote:\n\n&gt; Sum,\n&gt;\n&gt; Your points are valid and being human beings we tend to be more\n&gt; emotional and immature than logical. I wish everyone would end this  \n&gt; nonsense including myself\n&gt; and get on with the research and development. chris has voiced his  \n&gt; opinion and we have voiced ours\n&gt; so lets put it to bed and move forward. I for one will not respond  \n&gt; to any more malicious posts from one side\n&gt; or the other. If anyone wants me I&#39;ll be conducting research.\n&gt;\n&gt; bruce\n&gt;\n&gt;\n&gt;\n&gt; Bruce Halliday\n&gt; Paranormal Investigating Team\n&gt;\n&gt;\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; From: duck@ghostshop.com\n&gt; Date: Fri, 30 Nov 2007 18:01:47 +0000\n&gt; Subject: [EVP-ITC] Please read this entire post before you jump  \n&gt; down my throat!\n&gt;\n&gt; Chris has done more to further the research of Franks Box than\n&gt; any other individual. Agree, disagree it doesn&#39;t matter! That fact is\n&gt; when the book is written on the ITC and how it was perfected. Frank\n&gt; and Chris will have the first and second chapters dedicated to them.\n&gt;\n&gt; No matter what side of this argument you come down on there will\n&gt; always be different opinions. ITC Paranormal research may be in vogue\n&gt; but the idea&#39;s certainly are not new.\n&gt;\n&gt; However, we now stand at the apex of this ride. The gates are open.\n&gt; The throttle is stuck, crash or survive we&#39;re in it till the end. Go\n&gt; away!, don&#39;t read, don&#39;t try,it won&#39;t matter! This ride has left! Even\n&gt; jumping off won&#39;t stop it.\n&gt;\n&gt; We are now going to see an explosion of new idea&#39;s. But that&#39;s what it\n&gt; takes! People have to take sides, someone has to be right , someone\n&gt; has to be wrong. Without both sides there&#39;s no advancement.\n&gt; I read &quot;too many posts&quot; I hate fence sitters either you&#39;re in or\n&gt; you&#39;re out . But learn to smile and say thank you.\n&gt;\n&gt; Here&#39;s the way it is. You say I&#39;m wrong OK!. Thank you very much!\n&gt; And I go about my business of doing what I want to do, there&#39;s truth\n&gt; to every side of an argument. Just take what is constructive and file\n&gt; the rest. Just say Thank You!\n&gt;\n&gt; PS.\n&gt; To that individual who wrote me claiming to be from the Catholic Arch\n&gt; diocesi I doubt very much that the Catholic Church uses hot mail ...\n&gt; oh it&#39;s Catholic Archdiocese LMAO\n&gt;\n&gt; THANK YOU VERY MUCH!\n&gt;\n&gt; -Sum\n&gt;\n&gt;\n&gt;\n&gt; Share life as it happens with the new Windows Live. Share now!\n&gt;\n&gt; \n\n\nI'll be looking o wa d o you con inuously wonde ul and as ounding esul s, B uce. Tell Mike and Linda hi! :)AnnOn No 30, 2007, a 2:01 PM, b uce halliday w o e:Sum, You poin s a e alid and being human beings we end o be mo eemo ional and imma u e han logical. I wish e e yone would end his nonsense including mysel and ge on wi h he esea ch and de elopmen . ch is has oiced his opinion and we ha e oiced ou sso le s pu i o bed and mo e o wa d. I o one will no espond o any mo e malicious pos s om one sideo he o he . I anyone wan s me I'll be conduc ing esea ch. b uceB uce Halliday Pa ano mal In es iga ing Team To: EVP-ITC@yahoog oups.comF om: duck@ghos shop.comDa e: F i, 30 No 2007 18:01:47 +0000Subjec : [EVP-ITC] Please ead his en i e pos be o e you jump down my h oa !Ch is has done mo e o u he he esea ch o F anks Box han any o he indi idual. Ag ee, disag ee i doesn' ma e ! Tha ac is when he book is w i en on he ITC and how i was pe ec ed. F ank and Ch is will ha e he i s and second chap e s dedica ed o hem. No ma e wha side o his a gumen you come down on he e will always be di e en opinions. ITC Pa ano mal esea ch may be in ogue bu he idea's ce ainly a e no new. Howe e , we now s and a he apex o his ide. The ga es a e open.The h o le is s uck, c ash o su i e we' e in i ill he end. Goaway!, don' ead, don' y,i won' ma e ! This ide has le ! E enjumping o won' s op i .We a e now going o see an explosion o new idea's. Bu ha 's wha i akes! People ha e o ake sides, someone has o be igh , someonehas o be w ong. Wi hou bo h sides he e's no ad ancemen . I ead \" oo many pos s\" I ha e ence si e s ei he you' e in o you' e ou . Bu lea n o smile and say hank you.He e's he way i is. You say I'm w ong OK!. Thank you e y much! And I go abou my business o doing wha I wan o do, he e's u h o e e y side o an a gumen . Jus ake wha is cons uc i e and ile he es . Jus say Thank You!PS.To ha indi idual who w o e me claiming o be om he Ca holic A chdiocesi I doub e y much ha he Ca holic Chu ch uses ho mail ...oh i 's Ca holic A chdiocese LMAOTHANK YOU VERY MUCH!-SumSha e li e as i happens wi h he new Windows Li e. Sha e now!"}