{"id": "3582", "subject": "Just The Facts!", "author": "judy_in_hollywood", "timestamp": "2007-12-01T00:27:57Z", "full_text": "Hi Frank & All,  While it may be true, that Chris has put out &quot;Publicity&quot; on Frank&#39;s Box, done his own testing, research, investigations, etc., I really doubt that Frank (creator/inventor of &quot;Frank&#39;s Box&quot; . . . not what Chris calls it; &quot;Edison&#39;s The Telephone To the Dead&quot;) ment for him to KEEP the Box(es) or to start up Businesses with them, for his Own profits & without Proper Authorization -from Frank . . . i.e. giving Private &quot;Readings&quot; for bu-ku Dollars, conducting &quot;public&quot; Ghost Hunts or Ghost Hunting University 101, training on how to use a Box, doing videos, documentaries, movies, lectures, tours, + even creating a &quot;New Science&quot; of, I beieve he calls it, &quot;Paranormal Forensics&quot; = homicide investigatons . . . ALL for a hefty price charged to people who are willing to pay him for his businesses/service!  Hey, even John Edward, international  Medium, who I&#39;ve seen work & met several times stated he gets offers to do what he does for TONS of money!!! Plus, he sells his books, too.  Is this all OK with Frank, who gets nothing in return for His Efforts & Good Nature to &quot;give&quot; out his Boxes - for Testing??? Why does the testing, research, investigations Chris does have to be &quot;public & charged&quot; - and on tour, like he did as a Musician/Entertainer??? I doubt that Frank&#39;s Box is ment to make money starting up a business with it. The real researchers, testers here are the ones - who&#39;ll report their results here to Frank & All, I feel.  What Rights or Authorization, from Frank, does Chris have to do this + make $$$$ from it?  IMHO, I think Frank needs to put him out of business & get his box(es) back from Chris via a lawyer!    Sorry, but this bugs me, what&#39;s happened, by an unscupulous (sp?) jerk.  8-(  =Judy=    P.S. I hope I haven&#39;t offended anyone here, especially Frank . . .  who I thank for creating, &quot;Frank&#39;s Box&quot;. We all need to work together - in a circle -as it were to do the most good, & as some of us here are trying to do. Chris needs to go back to his music - to make a living not abuse Frank&#39;s box HIS ways = $$$$$$$$$$$$$$$$$$$$$$$."}