{"id": "3609", "subject": "Re: OK, Now what? Help!", "author": "psi_research", "timestamp": "2007-12-01T08:05:01Z", "full_text": "Judy, I successfully hacked the 469 I picked up tonight. If you&#39;d like\nsome help we&#39;ll be on the Queen Mary Sunday, Monday, and Tuesday. I&#39;ll\nbe glad to check your radio. It was a bit tedious but after reading\nall the post I knew what to watch out for. Thanks to all who posted\nthe info. It works! \n\nI like Mikes (UFO Geek) video also, his mixer into computer method is\na way to get questions or comments into the same environment, which is\nalso something I really like about the classic Frank&#39;s Box.-Bill\n\n--- In EVP-ITC@yahoogroups.com, &quot;Sum Duc&quot; &lt;duck@...&gt; wrote:\n&gt;\n&gt; Judy,\n&gt; \n&gt; If you removed the correct pin. and Your all back together Just turn\non the power \n&gt; and press the up or down arrow for about a second the radio should\nscan and continue\n&gt; with out stopping.\n&gt; \n&gt; \n&gt;   ----- Original Message ----- \n&gt;   From: judy_in_hollywood \n&gt;   To: EVP-ITC@yahoogroups.com \n&gt;   Sent: Friday, November 30, 2007 10:27 PM\n&gt;   Subject: [EVP-ITC] Re: OK, Now what? Help!\n&gt; \n&gt; \n&gt; \n&gt;   --- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@&gt; wrote:\n&gt;   &gt;\n&gt;   &gt; \n&gt;   &gt; That&#39;s what mine did when I cut the green wire. So I patched\nthat, flipped the board over so I could see which wire the mute was\non, it was a blue wire, then miss counted, cut the worng wire again,\npatched that, then unsoldered the right one. You might make sure none\nof the pins shorted. \n&gt;   &gt; \n&gt;   &gt; Frank\n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; To: EVP-ITC@: Ticket_to_Heaven@: Sat, 1 Dec 2007 04:56:46\n+0000Subject: [EVP-ITC] OK, Now what? Help!\n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; Hi All, Well, it took longer than 10 minutes to pull the Mute\npin . . . or should I say, after moving it back & forth a bit, it\nbroke off! Oh, well, I got it off! Then after I put it all back\ntogether, I turned it on, and on AM (light comes on, but goes off, to\nsee what station number it&#39;s on), but for the most part, it still acts\nlike a digtal AM/FM radio! Am I doing something wrong??? Hmmm? Help!\n8-/ =Judy= \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; __________________________________________________________\n&gt;   &gt; Your smile counts. The more smiles you share, the more we\ndonate.  Join in.\n&gt;   &gt; www.windowslive.com/smile?ocid=TXT_TAGLM_Wave2_oprsmilewlhmtagline\n&gt;   &gt;\n&gt;   - - - - - - - - - - - - - - - - Hi Frank & All, Hmmm?! I thought\nall one has to do was remove the Mute pin! Now, you say I&#39;ve got to\nlook at the revese side from where the pin was and cut(!?) or undo\n(somehow) a wire that that pin connects to? If I do all this the right\nway, how does the radio work/sound,then? I&#39;m confused, at this point.\nI also can plug in external, but small, speakers rather than use the\nearbuds. =Judy= P.S. How can I tell if a pin has shorted?? . . . . . .\n. . . . . . . . . .\n&gt;"}