{"id": "3622", "subject": "Re: ghost box hacks", "author": "judy_in_hollywood", "timestamp": "2007-12-02T02:44:41Z", "full_text": "--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@...&gt; wrote:\n&gt;\n&gt; \n&gt;  The hack is of the bag, it&#39;s out there on the web. Only a friggin&#39; moron would think a few mean words can stop it. I say, tell all our friends about the hacks, the Mini box, my boxes, and all ITC communcation methods. I&#39;d be on the radio tonight if I could. \n&gt;  \n&gt;  Frank-S\n&gt; \n&gt; \n&gt; To: EVP-ITC@...: ghostchasingfool@...: Sat, 1 Dec 2007 17:28:43 -0800Subject: Re: [EVP-ITC] ghost box hacks\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; I am so sorry all of you are going through this.  Your in our thoughts and prayers!  You are all doing positive things and they will prevail!Sumra Dume &lt;duck@...&gt; wrote: \n&gt; \n&gt; \n&gt; Colleagues,Thank you for your concern. Events that unfolded early this morning have prompted me to effectively close the Ghostboxhacks site for the near term. Do to the nature of these events it is inappropriate to discuss the matter in a public form such as this. Please do not speculate on the nature of this event. I am sorry, after talking to council I removed my statement from Ghostboxhacks.I don&#39;t want to fuel wild speculation. I wish I could go in to greater detail, at this time I have been advised not to.Thank you, Everyone for your emails and concern.-Sum\n&gt; \n&gt; The contents of this eletronic correspondence is private & confidential and meant only for the party and/or parties it is addressed to.  \n&gt;  \n&gt; No part of this email transmission may be publicly posted or forwarded to other parties without explicit written permission.\n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Connect and share in new ways with Windows Live.\n&gt; http://www.windowslive.com/connect.html?ocid=TXT_TAGLM_Wave2_newways_112007\n&gt;\n = = = = = = = = = = = = = = = =   Hi Frank & All, Well, we ALL could email C2C&#39;s George Noorey and tell him about the RS 12-469 Am/FM radio hacks and how to work it . . . . IF he mentions it on the show, IMAGINE, the results! Plus, RS would possibly get sold out of those radios. Kinda like the now discontinued Panasonic RR DR-60 IC recorder + potentially increase in value!  Why not even post a Modified RS 12-469 on EBAY and see what happens!?  Let&#39;s advertise what we&#39;ve discovered, here! =Judy="}