{"id": "3624", "subject": "Re: ghost box hacks", "author": "M.A. Coletta (Mike)", "timestamp": "2007-12-02T03:04:45Z", "full_text": "I wrote to all the c2c people this morning about the 12-469 and 12-\n470.  I wrote to George, Art, Ian, and Rollye James. Only Rollye \nJames wrote back so far thanking me for the information. That was \nnice of her!\n- Mike\n\n--- In EVP-ITC@yahoogroups.com, &quot;judy_in_hollywood&quot; \n&lt;Ticket_to_Heaven@...&gt; wrote:\n&gt;\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@&gt; \nwrote:\n&gt; &gt;\n&gt; &gt; \n&gt; &gt;  The hack is of the bag, it&#39;s out there on the web. Only a \nfriggin&#39; moron would think a few mean words can stop it. I say, tell \nall our friends about the hacks, the Mini box, my boxes, and all ITC \ncommuncation methods. I&#39;d be on the radio tonight if I could. \n&gt; &gt;  \n&gt; &gt;  Frank-S\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; To: EVP-ITC@: ghostchasingfool@: Sat, 1 Dec 2007 17:28:43 -\n0800Subject: Re: [EVP-ITC] ghost box hacks\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; I am so sorry all of you are going through this.  Your in our \nthoughts and prayers!  You are all doing positive things and they \nwill prevail!Sumra Dume &lt;duck@&gt; wrote: \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; Colleagues,Thank you for your concern. Events that unfolded early \nthis morning have prompted me to effectively close the Ghostboxhacks \nsite for the near term. Do to the nature of these events it is \ninappropriate to discuss the matter in a public form such as this. \nPlease do not speculate on the nature of this event. I am sorry, \nafter talking to council I removed my statement from Ghostboxhacks.I \ndon&#39;t want to fuel wild speculation. I wish I could go in to greater \ndetail, at this time I have been advised not to.Thank you, Everyone \nfor your emails and concern.-Sum\n&gt; &gt; \n&gt; &gt; The contents of this eletronic correspondence is private & \nconfidential and meant only for the party and/or parties it is \naddressed to.  \n&gt; &gt;  \n&gt; &gt; No part of this email transmission may be publicly posted or \nforwarded to other parties without explicit written permission.\n&gt; &gt;  \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; _________________________________________________________________\n&gt; &gt; Connect and share in new ways with Windows Live.\n&gt; &gt; http://www.windowslive.com/connect.html?\nocid=TXT_TAGLM_Wave2_newways_112007\n&gt; &gt;\n&gt;  = = = = = = = = = = = = = = = =   Hi Frank & All, Well, we ALL \ncould email C2C&#39;s George Noorey and tell him about the RS 12-469 \nAm/FM radio hacks and how to work it . . . . IF he mentions it on the \nshow, IMAGINE, the results! Plus, RS would possibly get sold out of \nthose radios. Kinda like the now discontinued Panasonic RR DR-60 IC \nrecorder + potentially increase in value!  Why not even post a \nModified RS 12-469 on EBAY and see what happens!?  Let&#39;s advertise \nwhat we&#39;ve discovered, here! =Judy=\n&gt;"}