{"id": "3626", "subject": "Re: [EVP-ITC] ghost box hacks", "author": "Lisby", "timestamp": "2007-12-02T03:47:49Z", "full_text": "Sum,\n\nBefore things go overboard here, Please clarify something: are these  \nissues personal (as in someone is making threats against you) or have  \nyou been told by the manufacturer that there&#39;s a proprietary  \ntechnology issue here? This is this business related, then we don&#39;t  \nwant to act against the advice of your legal council.\n\nAnn\n\n\nOn Dec 1, 2007, at 7:37 PM, Sumra Dume wrote:\n\n&gt; Colleagues,\n&gt;\n&gt; Thank you for your concern.\n&gt; Events that unfolded early this morning have prompted me to\n&gt; effectively close the Ghostboxhacks site for the near term.\n&gt; Do to the nature of these events it is inappropriate to discuss the\n&gt; matter in a public form such as this.\n&gt;\n&gt; Please do not speculate on the nature of this event. I am sorry,\n&gt; after talking to council I removed my statement from Ghostboxhacks.\n&gt; I don&#39;t want to fuel wild speculation.\n&gt;\n&gt; I wish I could go in to greater detail, at this time I have been\n&gt; advised not to.\n&gt;\n&gt; Thank you, Everyone for your emails and concern.\n&gt;\n&gt; -Sum\n&gt;\n&gt;\n&gt; \n\n\nSum,Be o e hings go o e boa d he e, Please cla i y some hing: a e hese issues pe sonal (as in someone is making h ea s agains you) o ha e you been old by he manu ac u e ha he e's a p op ie a y echnology issue he e? This is his business ela ed, hen we don' wan o ac agains he ad ice o you legal council.AnnOn Dec 1, 2007, a 7:37 PM, Sum a Dume w o e:Colleagues,Thank you o you conce n. E en s ha un olded ea ly his mo ning ha e p omp ed me o e ec i ely close he Ghos boxhacks si e o he nea e m. Do o he na u e o hese e en s i is inapp op ia e o discuss he ma e in a public o m such as his. Please do no specula e on he na u e o his e en . I am so y, a e alking o council I emo ed my s a emen om Ghos boxhacks.I don' wan o uel wild specula ion. I wish I could go in o g ea e de ail, a his ime I ha e been ad ised no o.Thank you, E e yone o you emails and conce n.-Sum"}