{"id": "3634", "subject": "Re: What happened over at GhostBoxHacks.com?", "author": "overunder21", "timestamp": "2007-12-02T14:08:32Z", "full_text": "In agreement here.  My first thoughts when I started hearing about \ncommercial endeavors involving frank&#39;s box, copies, or similar \ncreations was &quot;What happens to those out there that give out this \ninfo for free, like - say - their inventor?&quot;  And of course the \nimmediate answer was threats, lawsuits, etc.\n\nNot to get too spiritual here, but in my life almost every contact \nI&#39;ve had with whatever is out there has left me with the impression \nthat they frown heavily on using them for personal or financial \ngain.  A good friend of mine, also named Frank, who is possibly the \nbest psychic I ever met (really the only one I&#39;ve met that I truly \nbelieve can speak with spirits and he has an uncanny ability to tell \nyou things about yourself that he shouldn&#39;t know) refuses to charge \nfor his services because every time he tried to use his ability for \ncommercial purposes it would fail him.  His &#39;guide&#39; as he calls it \nhas flat out told him that they will not be used to make money.  LOL.\n\nSo my thought is, if this would be true, that those that stand to \nmake money off of this might not be getting the results they used to \nor the results they want...combine that with the free availability of \nthe information and its not a good picture for them.\n\n--- In EVP-ITC@yahoogroups.com, &quot;Lance Oliver&quot; &lt;orbhunterx@...&gt; wrote:\n&gt;\n&gt; You are so right on those points!\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@&gt; \n&gt; wrote:\n&gt; &gt;\n&gt; &gt; \n&gt; &gt;  I can make two guesses One is some religous fanatic taliban type \na-\n&gt; hole thinks we are talking to demons, and letting evil into the \n&gt; world, so they have to shut it down for our own good. The other, \nand \n&gt; more likely is someone might loose money, so going to extreme \n&gt; measures.  I don&#39;t sell my boxes, so they are relatively rare, and \n&gt; have little, but controlable  impact, but the inexpensive radios \nare \n&gt; easily obtainable, and you don&#39;t need a guru to tell what you are \n&gt; really hearing. There&#39;s more than one party out there that stands \nto \n&gt; loose much if the current paranormal theories, and fear crap is \n&gt; disproven, so don&#39;t get the idea I&#39;m talking aobut one person.\n&gt; &gt;  \n&gt; &gt;  The informatin is out there, the site contents copied by many. \n&gt; Making threats over the internet to control people is federal \ncrime, \n&gt; and the FBI has a site for reproting this.    Frank-S\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; To: EVP-ITC@: michaelcoletta@: Sat, 1 Dec 2007 20:28:57 \n&gt; +0000Subject: [EVP-ITC] What happened over at GhostBoxHacks.com?\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; I just went over to their website and saw all the modification \n&gt; information was gone and a reference to a disturbing message about \na \n&gt; threat was there. Anyone know what happened?- Mike \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; _________________________________________________________________\n&gt; &gt; Share life as it happens with the new Windows Live.Download today \n&gt; it&#39;s FREE!\n&gt; &gt; http://www.windowslive.com/share.html?\n&gt; ocid=TXT_TAGLM_Wave2_sharelife_112007\n&gt; &gt;\n&gt;"}