{"id": "3636", "subject": "Re: chris(jack ass)moon at it again", "author": "Lance Oliver", "timestamp": "2007-12-02T14:12:48Z", "full_text": "His glory is short lived. Perhaps he will one day learn...\n\nLance\n\n--- In EVP-ITC@yahoogroups.com, &quot;bhali333&quot; \n&lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; Here is a blog steve sent me from moons myspace page as usual he&#39;s \nin \n&gt; a panic because his fraudulent buisness is going down the tubes. he \n&gt; claims to know the only way box communication can be achieved but \nwho \n&gt; would know better than the box inventor. Frank says it does not \n&gt; matter what means you use it&#39;s the researcher that counts.\n&gt; \n&gt; and if moon is so omnipitent in this research where are the \n&gt; documented recordings of his research, why are they not public for \n&gt; everyone to hear maybe because he&#39;s full of bull. he said recently \n&gt; that no one but him gets legitimate communication, well I think \nit&#39;s \n&gt; the other way around. \n&gt; \n&gt; chris if you read this, stop the cherade and have some dignity. \n&gt; become a real researcher and stop trying to down everyone else so \nyou \n&gt; can continue to pray on the berieved and desperate people. And \nwhile \n&gt; I&#39;m at it, if your so great why are you offering substantial \n&gt; discounts to your so called ghost hunter university. I&#39;ll tell you \n&gt; why, because people are starting to realise you are nothing but a \n&gt; carnival side show palm raeder and have fooled people long enough. \n&gt; \n&gt; the reason I am addresing moon directly on this group is I know he \nis \n&gt; lurking in the shadows to see what is happening with real \nresearchers \n&gt; and will know at least what I think of him.\n&gt; I have done more legitimate box research in one week than he has \ndone \n&gt; ever. My results are posted I challenge him to do the same.\n&gt; \n&gt; here is a copy of his malicious blog from myspace.\n&gt; chris moon&#39;s blog on myspace this morning ***\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Wednesday, November 28, 2007 \n&gt; \n&gt;   The Box has hit the fan! \n&gt; Current mood:  distressed \n&gt; Category: Dreams and the Supernatural \n&gt; \n&gt; \n&gt; As so many of you know, I have been the primary tester of the \n&gt; Telephone to the Dead, a.k.a. &quot;Frank&#39;s Box&quot; since 2004, and have \nhad \n&gt; great success using it in paranormal research, and more currently, \n&gt; connecting the living with those on the other side. I have recently \n&gt; been made aware that there are several replica versions of this \n&gt; device being sold. I have also been told of another device that can \n&gt; be purchased for very little from any electronics merchant and \n&gt; altered by hand, producing what some consider to be results. As I \n&gt; expected, the samples that people have sent me are nothing more \nthan \n&gt; timed radio scans that have no validity. \n&gt; \n&gt;  \n&gt; \n&gt; What is important to remember, before purchasing any of these \nreplica \n&gt; devices, is that the Spirit Technicians and Spirit Guides on the \n&gt; other side have repeatedly explained that the way that the \nTelephone \n&gt; to the Dead technology works, is by spirit energy manipulating the \n&gt; random voltage generator (RVG) and using white and pink noise, as \n&gt; well as radio fragment, to create real time voice answers to \n&gt; questions posed from our side. The most important aspect to this \n&gt; device is the medium operator who works as an antenna \n&gt; or &quot;interpreter&quot; for living individuals asking the questions. \n&gt; \n&gt;  \n&gt; \n&gt; \n&gt; Thomas Edison, in an intelligent spiritual discussion through the \n&gt; Telephone to the Dead, stated that there were only thirty of these \n&gt; individuals that could effectively use the device. Four have been \n&gt; identified to this point. \n&gt; \n&gt;  \n&gt; \n&gt; \n&gt; I have spent nearly four years testing and doing paranormal \nresearch \n&gt; with the Telephone to the Dead, and I have built strong \nrelationships \n&gt; with Spirit Technicians and Spirit Guides who I trust, and who \ntrust \n&gt; me. These new &quot;radio scanners&quot; are not only a waste of money for \n&gt; people looking to do research with them in hopes of having \neffective \n&gt; communication with the other side, but may in fact be very \ndangerous. \n&gt; Should demonic and other negative entities learn to use these false \n&gt; devices, the results could be devastating. Though I rarely see eye \nto \n&gt; eye with the Catholic Church on the matter of using the Telephone \nto \n&gt; the Dead, I do admit that they predicted the widespread sale of \nfalse \n&gt; communication devices as far back as last year. I have recently \nbegun \n&gt; to receive requests from individuals asking for help to close \n&gt; negative doorways and portals that they believe they opened using \n&gt; their purchased Telephone to the Dead replica. Others are claiming \n&gt; that I am a fraud because their purchased device doesn&#39;t produce \nthe \n&gt; positive results I have been fortunate enough to have, and claim \nthat \n&gt; therefore, all of my results MUST be false. \n&gt; \n&gt;  \n&gt; \n&gt; \n&gt; I can see this spiraling out of control already. Once again, I will \n&gt; continue my research with the actual Telephone to the Dead as well \nas \n&gt; provide public demonstrations and private readings for those truly \n&gt; interested in real time spirit communication. Please feel free to \n&gt; contact me with any questions at\n&gt;  \n&gt; Bruce\n&gt;"}