{"id": "3643", "subject": "Re: [EVP-ITC] I sent George (C2C) an email =11/29", "author": "Lisby", "timestamp": "2007-12-02T14:39:42Z", "full_text": "Judy, and everyone else, too--please don&#39;t promote or continue this  \nuntil we hear from Sum. This may not be what everyone is assuming at  \nall. My concern is that he has received a cease-and-desist notice  \nfrom Radio Shack, which may have been informed that someone was  \npromoting their product in a way not in compliment with their  \ncorporate image, and that his counsel is advising he comply with it.  \nWhat you are telling people to do may be exactly what his own legal  \ncounsel is advising against and may put him in a precarious situation.\n\nPlease just calm down and don&#39;t make assumption until he can clarify  \nfor us. If it comes down to someone making personal threats against  \nhim, that&#39;s a whole other matter. But he needs to ask for help before  \neveryone goes all posse, OK?\n\n\n\nAnn\n\n\nOn Dec 1, 2007, at 11:53 PM, judy_in_hollywood wrote:\n\n&gt; Hi all, I sent George an email about our group here (to look in) +  \n&gt; about the RS 12-469 AM/FM digital radio modification - for his  \n&gt; awareness! Hope he gets it & READS it. =Judy= P.S. On Friday&#39;s  \n&gt; anyone can call in (IF ya can get thru) to his show and discuse  \n&gt; anything, even the RS Hack! IDEA? Let everyone out there know about  \n&gt; it = free advertising! LOL FRANK, call in!!!\n&gt;\n&gt;\n&gt; \n\n\nJudy, and e e yone else, oo--please don' p omo e o con inue his un il we hea om Sum. This may no be wha e e yone is assuming a all. My conce n is ha he has ecei ed a cease-and-desis no ice om Radio Shack, which may ha e been in o med ha someone was p omo ing hei p oduc in a way no in complimen wi h hei co po a e image, and ha his counsel is ad ising he comply wi h i . Wha you a e elling people o do may be exac ly wha his own legal counsel is ad ising agains and may pu him in a p eca ious si ua ion.Please jus calm down and don' make assump ion un il he can cla i y o us. I i comes down o someone making pe sonal h ea s agains him, ha 's a whole o he ma e . Bu he needs o ask o help be o e e e yone goes all posse, OK?AnnOn Dec 1, 2007, a 11:53 PM, judy_in_hollywood w o e:Hi all, I sen Geo ge an email abou ou g oup he e ( o look in) + abou he RS 12-469 AM/FM digi al adio modi ica ion - o his awa eness! Hope he ge s i & READS i . =Judy= P.S. On F iday's anyone can call in (IF ya can ge h u) o his show and discuse any hing, e en he RS Hack! IDEA? Le e e yone ou he e know abou i = ee ad e ising! LOL FRANK, call in!!!"}