{"id": "3663", "subject": "Re: [EVP-ITC] I sent George (C2C) an email =11/29", "author": "Lisby", "timestamp": "2007-12-02T20:32:54Z", "full_text": "Exactly right, Frank. But corporate hackles are easily raised and  \ncompany brands are precious to them and very easily tainted. Look at  \nthe aftermath of the Tylenol poisonings of the late 1970s--people  \nassociated death with the product, despite the fact that someone  \ncompletely unassociated tampered with the drugs. For years, Johnson  \nand Johnson has been fighting against a rumor started by a competitor  \nthat their CEO was a member of the Church of Satan--they even went so  \nfar as to drop their 100-year-old company logo because it had a moon  \nand stars in it, just to try to stop the Satanism rumor. My concern  \nwas that someone had written Radio Shack Corp and told them that some  \ndevil worshipers or some such where using the company&#39;s products to  \npromote witchcraft or anti-Christian sentiment or whatever.\n\nAnyway, if that is not the case, then hooray.\n\nAnn\n\nOn Dec 2, 2007, at 2:20 PM, Frank Sumption wrote:\n\n&gt; Well why would not someone just say that. There&#39;s other ways of  \n&gt; making scanning radios without stepping on manufacturers. You buy  \n&gt; the radio chips, and make your own tuner, it&#39;s a piece of cake.\n&gt;\n&gt;\n&gt;  Frank-S\n&gt;\n&gt;\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; From: lisby@...\n&gt; Date: Sun, 2 Dec 2007 09:39:42 -0500\n&gt; Subject: Re: [EVP-ITC] I sent George (C2C) an email =11/29\n&gt;\n&gt; Judy, and everyone else, too--please don&#39;t promote or continue this  \n&gt; until we hear from Sum. This may not be what everyone is assuming  \n&gt; at all. My concern is that he has received a cease-and-desist  \n&gt; notice from Radio Shack, which may have been informed that someone  \n&gt; was promoting their product in a way not in compliment with their  \n&gt; corporate image, and that his counsel is advising he comply with  \n&gt; it. What you are telling people to do may be exactly what his own  \n&gt; legal counsel is advising against and may put him in a precarious  \n&gt; situation.\n&gt;\n&gt; Please just calm down and don&#39;t make assumption until he can  \n&gt; clarify for us. If it comes down to someone making personal threats  \n&gt; against him, that&#39;s a whole other matter. But he needs to ask for  \n&gt; help before everyone goes all posse, OK?\n&gt;\n&gt;\n&gt;\n&gt; Ann\n&gt;\n&gt;\n&gt; On Dec 1, 2007, at 11:53 PM, judy_in_hollywood wrote:\n&gt;\n&gt; Hi all, I sent George an email about our group here (to look in) +  \n&gt; about the RS 12-469 AM/FM digital radio modification - for his  \n&gt; awareness! Hope he gets it & READS it. =Judy= P.S. On Friday&#39;s  \n&gt; anyone can call in (IF ya can get thru) to his show and discuse  \n&gt; anything, even the RS Hack! IDEA? Let everyone out there know about  \n&gt; it = free advertising! LOL FRANK, call in!!!\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Share life as it happens with the new Windows Live. Share now!\n&gt;\n&gt; \n\n\nExac ly igh , F ank. Bu co po a e hackles a e easily aised and company b ands a e p ecious o hem and e y easily ain ed. Look a he a e ma h o he Tylenol poisonings o he la e 1970s--people associa ed dea h wi h he p oduc , despi e he ac ha someone comple ely unassocia ed ampe ed wi h he d ugs. Fo yea s, Johnson and Johnson has been igh ing agains a umo s a ed by a compe i o ha hei CEO was a membe o he Chu ch o Sa an-- hey e en wen so a as o d op hei 100-yea -old company logo because i had a moon and s a s in i , jus o y o s op he Sa anism umo . My conce n was ha someone had w i en Radio Shack Co p and old hem ha some de il wo shipe s o some such whe e using he company's p oduc s o p omo e wi chc a o an i-Ch is ian sen imen o wha e e .Anyway, i ha is no he case, hen hoo ay.AnnOn Dec 2, 2007, a 2:20 PM, F ank Sump ion w o e:Well why would no someone jus say ha . The e's o he ways o making scanning adios wi hou s epping on manu ac u e s. You buy he adio chips, and make you own une , i 's a piece o cake.   F ank-STo: EVP-ITC@yahoog oups.comF om: lisby@ea hlink.ne Da e: Sun, 2 Dec 2007 09:39:42 -0500Subjec : Re: [EVP-ITC] I sen Geo ge (C2C) an email =11/29Judy, and e e yone else, oo--please don' p omo e o con inue his un il we hea om Sum. This may no be wha e e yone is assuming a all. My conce n is ha he has ecei ed a cease-and-desis no ice om Radio Shack, which may ha e been in o med ha someone was p omo ing hei p oduc in a way no in complimen wi h hei co po a e image, and ha his counsel is ad ising he comply wi h i . Wha you a e elling people o do may be exac ly wha his own legal counsel is ad ising agains and may pu him in a p eca ious si ua ion.Please jus calm down and don' make assump ion un il he can cla i y o us. I i comes down o someone making pe sonal h ea s agains him, ha 's a whole o he ma e . Bu he needs o ask o help be o e e e yone goes all posse, OK?AnnOn Dec 1, 2007, a 11:53 PM, judy_in_hollywood w o e:Hi all, I sen Geo ge an email abou ou g oup he e ( o look in) + abou he RS 12-469 AM/FM digi al adio modi ica ion - o his awa eness! Hope he ge s i & READS i . =Judy= P.S. On F iday's anyone can call in (IF ya can ge h u) o his show and discuse any hing, e en he RS Hack! IDEA? Le e e yone ou he e know abou i = ee ad e ising! LOL FRANK, call in!!!Sha e li e as i happens wi h he new Windows Li e. Sha e now!"}