{"id": "3664", "subject": "Re: Idle threats from a coward", "author": "Lance Oliver", "timestamp": "2007-12-02T20:38:07Z", "full_text": "Hey Bab,\n\nEven though I&#39;ve newly begun to chime in here, it seems to me that \nsome people are guilty of wearing rose colored glasses, as far as \nChris is concerned. LOL! I don&#39;t know him personally, so I really \ndon&#39;t know what really motivates him. Right or wrong, by conducting \nhimself in the manner he has, it&#39;s understandable why his approach \nhas drawn the scrutiny from his peers. \n\nFrankly, this entire effort is a great learning experience and \npotential healing for mankind! I encourage all of us researcher types \nto simply sit back, and take a deep breath or three. Consider \ntogether why we&#39;re doing this. Let&#39;s work on making this world a \nbetter place while we have breath...\n\nSuccess!\nLance\n\n--- In EVP-ITC@yahoogroups.com, &quot;babiarz3&quot; &lt;babiarz3@...&gt; wrote:\n&gt;\n&gt; Bruce- Wow! That is a very bold statement, minus the name of the\n&gt; person you are accusing (although it&#39;s clear who you are referring \nto). \n&gt; I did read your apology for the negativity you&#39;ve helped spread \nabout\n&gt; Christopher Moon. I acknowledge that your apology took a great deal \nof\n&gt; humility. However, knee jerk reactions are exactly what I&#39;ve been\n&gt; talking about. People doing or saying without thought and \nconsideration. \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;bhali333&quot;\n&gt; &lt;paranormalinvestigating@&gt; wrote:\n&gt; &gt;\n&gt; &gt; I think someone that stands to loose there bread and butter is \nmaking \n&gt; &gt; idle threats or having someone else do it. I would like to state \nfor \n&gt; &gt; the record. SEND ME SOME DEATH THREATS YOU COWARD OR BETTER YET \nLETS \n&gt; &gt; SET UP A MEETING AND WE WILL SEE WHO IS LEFT FACE DOWN. \n&gt; &gt; \n&gt; &gt; Who ever you are you better hope I never find out, it&#39;s a bitch \nwhen \n&gt; &gt; the hunter becomes the hunted!\n&gt; &gt; \n&gt; &gt; If you got the balls contact me!\n&gt; &gt; \n&gt; &gt; Sum don&#39;t worry anyone that talks about doing something does only \nthat \n&gt; &gt; TALK!\n&gt; &gt; \n&gt; &gt; Bruce\n&gt; &gt;\n&gt;"}