{"id": "3666", "subject": "Re: ghost box hacks", "author": "Lance Oliver", "timestamp": "2007-12-02T21:07:55Z", "full_text": "Hey Frank,\n\nHave you had much success in addressing things with C2C folks?\n\nI&#39;m a C2C Streamlink member and would love to hear them interview \nyou. I had a lot of misconceptions due to what some have attributed \nto you in the past, specifically regarding your device being \nsomething Jesus personally approved. \n\nDon&#39;t get me wrong though. As a Vice President of the board of a \nUnity church, I consider Jesus to be a friend and way shower. I&#39;m \nsure glad to see you&#39;re a serious research engineer. It&#39;s painfully \nobvious that some folks are all about steering these efforts to their \nown ends by pushing the religous angle.\n\nKeep the great work moving ahead!\nLance\n\n \n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@...&gt; \nwrote:\n&gt;\n&gt; \n&gt; I think you&#39;ll find the C2C staff not as interested as they would \nlike us to believe.\n&gt;  \n&gt;  Frank-S\n&gt; \n&gt; \n&gt; To: EVP-ITC@...: michaelcoletta@...: Sun, 2 Dec 2007 03:04:45 \n+0000Subject: [EVP-ITC] Re: ghost box hacks\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; I wrote to all the c2c people this morning about the 12-469 and 12-\n470. I wrote to George, Art, Ian, and Rollye James. Only Rollye James \nwrote back so far thanking me for the information. That was nice of \nher!- Mike--- In EVP-ITC@yahoogroups.com, &quot;judy_in_hollywood&quot; \n&lt;Ticket_to_Heaven@&gt; wrote:&gt;&gt; &gt; --- In EVP-ITC@yahoogroups.com, Frank \nSumption &lt;franks-boxes@&gt; wrote:&gt; &gt;&gt; &gt; &gt; &gt; The hack is of the bag, \nit&#39;s out there on the web. Only a friggin&#39; moron would think a few \nmean words can stop it. I say, tell all our friends about the hacks, \nthe Mini box, my boxes, and all ITC communcation methods. I&#39;d be on \nthe radio tonight if I could. &gt; &gt; &gt; &gt; Frank-S&gt; &gt; &gt; &gt; &gt; &gt; To: EVP-\nITC@: ghostchasingfool@: Sat, 1 Dec 2007 17:28:43 -0800Subject: Re: \n[EVP-ITC] ghost box hacks&gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; I am so sorry all of you \nare going through this. Your in our thoughts and prayers! You are all \ndoing positive things and they will prevail!Sumra Dume &lt;duck@&gt; wrote: \n&gt; &gt; &gt; &gt; &gt; &gt; Colleagues,Thank you for your concern. Events that \nunfolded early this morning have prompted me to effectively close the \nGhostboxhacks site for the near term. Do to the nature of these \nevents it is inappropriate to discuss the matter in a public form \nsuch as this. Please do not speculate on the nature of this event. I \nam sorry, after talking to council I removed my statement from \nGhostboxhacks.I don&#39;t want to fuel wild speculation. I wish I could \ngo in to greater detail, at this time I have been advised not \nto.Thank you, Everyone for your emails and concern.-Sum&gt; &gt; &gt; &gt; The \ncontents of this eletronic correspondence is private & confidential \nand meant only for the party and/or parties it is addressed to. &gt; &gt; &gt; \n&gt; No part of this email transmission may be publicly posted or \nforwarded to other parties without explicit written permission.&gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; \n__________________________________________________________&gt; &gt; Connect \nand share in new ways with Windows Live.&gt; &gt; \nhttp://www.windowslive.com/connect.html?\nocid=TXT_TAGLM_Wave2_newways_112007&gt; &gt;&gt; = = = = = = = = = = = = = = = \n= Hi Frank & All, Well, we ALL could email C2C&#39;s George Noorey and \ntell him about the RS 12-469 Am/FM radio hacks and how to work \nit . . . . IF he mentions it on the show, IMAGINE, the results! Plus, \nRS would possibly get sold out of those radios. Kinda like the now \ndiscontinued Panasonic RR DR-60 IC recorder + potentially increase in \nvalue! Why not even post a Modified RS 12-469 on EBAY and see what \nhappens!? Let&#39;s advertise what we&#39;ve discovered, here! =Judy=&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Your smile counts. The more smiles you share, the more we donate. \nJoin in.\n&gt; www.windowslive.com/smile?ocid=TXT_TAGLM_Wave2_oprsmilewlhmtagline\n&gt;"}