{"id": "3670", "subject": "Re: [EVP-ITC] Spiraling out of control", "author": "Lisby", "timestamp": "2007-12-02T23:50:09Z", "full_text": "I&#39;m listening to Joe&#39;s EVPs right now and they are great. Thanks for  \nsharing your site URL. :)\n\nAnn\n\n\nOn Dec 2, 2007, at 6:29 PM, Steve Hultay wrote:\n\n&gt;\n&gt; I think we should all focus at the research at hand and forget what\n&gt; everyone else is doing. I personally know Chris and think he&#39;s a\n&gt; great guy and frank feels the same way most days. This has gotten\n&gt; to the point where i can&#39;t even do a session anymore because i&#39;m so\n&gt; blocked by negative thoughts from this group it&#39;s pointless to\n&gt; concentrate on the box and get results. Honestly who cares what\n&gt; chris does anyway, does it really affect everyone&#39;s lives that\n&gt; much. I have a job and this is a hobby that i used to really like,\n&gt; but now this board has brought me down. It seems all people want to\n&gt; do is make this like a street fight with challenges and negative\n&gt; views and for what reason? If anyone is concerned about hearing\n&gt; Chris&#39;s audio, i have about 2 hours of box sessions from Eastern\n&gt; State on my web site for all to listen to. It&#39;s\n&gt; www.keyportparanormal.com and go to investigation and click on\n&gt; eastern state. All the audio is at the bottom of that page and you\n&gt; guys can judge for yourself and i heard a lot come out of that box\n&gt; that night personally because i repeated a lot of stuff back to\n&gt; chris that i heard. Enough already, let&#39;s move on to the next great\n&gt; thing. That radio shack hack was a great breakthrough here, let&#39;s\n&gt; just be happy we got that before it was shut down. Now we have\n&gt; another avenue to go down, but we can&#39;t do it with all these\n&gt; negatives out there. Let&#39;s move on to new topics and anyone out\n&gt; there that bought a Radio Shack box, start sharing your files with\n&gt; the group so it&#39;s not just us same 5 that post all the time.\n&gt;\n&gt; -Steve H.\n&gt;\n&gt;\n&gt; \n\n\nI'm lis ening o Joe's EVPs igh now and hey a e g ea . Thanks o sha ing you si e URL. :)AnnOn Dec 2, 2007, a 6:29 PM, S e e Hul ay w o e:I hink we should all ocus a he esea ch a hand and o ge wha  e e yone else is doing. I pe sonally know Ch is and hink he's a g ea guy and ank eels he same way mos days. This has go en  o he poin whe e i can' e en do a session anymo e because i'm so blocked by nega i e hough s om his g oup i 's poin less o concen a e on he box and ge esul s. Hones ly who ca es wha  ch is does anyway, does i eally a ec e e yone's li es ha  much. I ha e a job and his is a hobby ha i used o eally like, bu now his boa d has b ough me down. I seems all people wan o do is make his like a s ee igh wi h challenges and nega i e  iews and o wha eason? I anyone is conce ned abou hea ing Ch is's audio, i ha e abou 2 hou s o box sessions om Eas e n S a e on my web si e o all o lis en o. I 's www.keypo pa ano mal.com and go o in es iga ion and click on eas e n s a e. All he audio is a he bo om o ha page and you guys can judge o you sel and i hea d a lo come ou o ha box  ha nigh pe sonally because i epea ed a lo o s u back o ch is ha i hea d. Enough al eady, le 's mo e on o he nex g ea   hing. Tha adio shack hack was a g ea b eak h ough he e, le 's jus be happy we go ha be o e i was shu down. Now we ha e ano he a enue o go down, bu we can' do i wi h all hese nega i es ou he e. Le 's mo e on o new opics and anyone ou   he e ha bough a Radio Shack box, s a sha ing you iles wi h  he g oup so i 's no jus us same 5 ha pos all he ime.-S e e H."}