{"id": "3674", "subject": "Re: [EVP-ITC] Spiraling out of control- Enough of the namecalling and fighting!!", "author": "Misty Dawn", "timestamp": "2007-12-03T02:26:41Z", "full_text": "--0-1490919384-1196648801=:275\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nTo ALL members of this group,\n  I agree with Steve. Ive told you all this many times yet some of you like to get caught up in the heat of the moment.\n   \n  It is very disturbing to watch you all try to win this war of words. There is no winner just a bunch of losers. And while you are busy losing theres no GOOD research being performed by YOU.\n   \n  How much research did YOU do today? How much time did you spend firing off replies to attempt to respond to someone you dont even know about something that doesnt even involve YOU? How much time did you spend replying to join in the arguments you feel do involve YOU?\n   \n  The point being, this is a research group for ITC not a boxing room and definitely your own personal battlegrounds. Take that elsewhere. Healthy discussion is one thing but I have seen very few people offering that. In fact I know a few of you joined here just to go after someone who ticked you off. Then there are those who just seem to be firing in all directions, taget doesnt matter.\n   \n  Get a grip people!! Ive seen 4 year olds with more self control. If you arent interested in researching ITC for yourself then what the heck are YOU doing HERE. \n   \n  ONCE AGAIN THIS IS AN ITC RESEARCH GROUP!! \n   \n  As for the box Frank is and always has been the first/primary tester of any box he has built. \n   \n  lol\n  Misty\n   \n  P.S. I think you all are capable of finding better things to do, if not let me know and I will give you a few ideas =)\n  \n\nSteve Hultay &lt;urkel23@...&gt; wrote:\n          \nI think we should all focus at the research at hand and forget what \neveryone else is doing. I personally know Chris and think he&#39;s a \ngreat guy and frank feels the same way most days. This has gotten \nto the point where i can&#39;t even do a session anymore because i&#39;m so \nblocked by negative thoughts from this group it&#39;s pointless to \nconcentrate on the box and get results. Honestly who cares what \nchris does anyway, does it really affect everyone&#39;s lives that \nmuch. I have a job and this is a hobby that i used to really like, \nbut now this board has brought me down. It seems all people want to \ndo is make this like a street fight with challenges and negative \nviews and for what reason? If anyone is concerned about hearing \nChris&#39;s audio, i have about 2 hours of box sessions from Eastern \nState on my web site for all to listen to. It&#39;s \nwww.keyportparanormal.com and go to investigation and click on \neastern state. All the audio is at the bottom of that page and you \nguys can judge for yourself and i heard a lot come out of that box \nthat night personally because i repeated a lot of stuff back to \nchris that i heard. Enough already, let&#39;s move on to the next great \nthing. That radio shack hack was a great breakthrough here, let&#39;s \njust be happy we got that before it was shut down. Now we have \nanother avenue to go down, but we can&#39;t do it with all these \nnegatives out there. Let&#39;s move on to new topics and anyone out \nthere that bought a Radio Shack box, start sharing your files with \nthe group so it&#39;s not just us same 5 that post all the time.\n\n-Steve H.\n\n\n\n                         \n\n       \n---------------------------------\nBe a better sports nut! Let your teams follow you with Yahoo Mobile. Try it now.\r\n--0-1490919384-1196648801=:275\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;div&gt;To ALL members of this group,&lt;/div&gt;  &lt;div&gt;I agree with Steve. Ive told you all this many times yet some of you like to get caught up in the heat of the moment.&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;It is very disturbing to watch you all try to win this war of words. There is no winner just a bunch of losers. And while you are busy losing theres no GOOD research being performed by YOU.&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;How much research did&nbsp;YOU do today? How much time did you spend firing off replies to attempt to respond to someone you dont even know about something that doesnt even involve YOU? How much time did you spend replying to join in the arguments you feel do involve YOU?&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;The point being, this is a research group for ITC not a boxing room and definitely your own personal battlegrounds. Take that elsewhere. Healthy discussion is one thing but I have seen very few people offering that. In fact I know a few of you joined here just to go\n after someone who ticked you off. Then there are those who just seem to be firing in all directions, taget doesnt matter.&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Get a grip people!! Ive seen 4 year olds with more self control. If you arent interested in researching ITC for yourself then what the heck are YOU doing HERE. &lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;ONCE AGAIN THIS IS AN ITC RESEARCH GROUP!! &lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;As for the box Frank is and always has been the first/primary tester of any box he has built. &lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;lol&lt;/div&gt;  &lt;div&gt;Misty&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;P.S. I think you all are capable of finding better things to do, if not let me know and I will give you a few ideas =)&lt;/div&gt;  &lt;div&gt;&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;Steve Hultay &lt;urkel23@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/div&gt;  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;div&gt;&lt;BR&gt;I think we should all focus at the research at hand and forget what &lt;BR&gt;everyone else is doing. I personally know Chris and think he&#39;s a &lt;BR&gt;great guy and frank feels the same way most days. This has gotten &lt;BR&gt;to the point where i can&#39;t even do a session anymore because i&#39;m so &lt;BR&gt;blocked by negative thoughts from this group it&#39;s pointless to &lt;BR&gt;concentrate on the box and get results. Honestly who cares what &lt;BR&gt;chris does anyway, does it really affect everyone&#39;s lives that &lt;BR&gt;much. I have a job and this is a hobby that i used to really like, &lt;BR&gt;but now this board has brought me down. It seems all people want to &lt;BR&gt;do is make this like a street fight with challenges and negative &lt;BR&gt;views and for what reason? If anyone is concerned about\n hearing &lt;BR&gt;Chris&#39;s audio, i have about 2 hours of box sessions from Eastern &lt;BR&gt;State on my web site for all to listen to. It&#39;s &lt;BR&gt;www.keyportparanorm&lt;WBR&gt;al.com and go to investigation and click on &lt;BR&gt;eastern state. All the audio is at the bottom of that page and you &lt;BR&gt;guys can judge for yourself and i heard a lot come out of that box &lt;BR&gt;that night personally because i repeated a lot of stuff back to &lt;BR&gt;chris that i heard. Enough already, let&#39;s move on to the next great &lt;BR&gt;thing. That radio shack hack was a great breakthrough here, let&#39;s &lt;BR&gt;just be happy we got that before it was shut down. Now we have &lt;BR&gt;another avenue to go down, but we can&#39;t do it with all these &lt;BR&gt;negatives out there. Let&#39;s move on to new topics and anyone out &lt;BR&gt;there that bought a Radio Shack box, start sharing your files with &lt;BR&gt;the group so it&#39;s not just us same 5 that post all the time.&lt;BR&gt;&lt;BR&gt;-Steve H.&lt;BR&gt;&lt;BR&gt;&lt;/div&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;p&gt;&#32;\n      &lt;hr size=1&gt;Be a better sports nut! Let your teams follow you \nwith Yahoo Mobile. &lt;a href=&quot;http://us.rd.yahoo.com/evt=51731/*http://mobile.yahoo.com/sports;_ylt=At9_qDKvtAbMuh1G1SQtBI7ntAcJ\n&quot;&gt;Try it now.&lt;/a&gt;\r\n--0-1490919384-1196648801=:275--"}