{"id": "3675", "subject": "Re: cease-and-desist notice  no!", "author": "judy_in_hollywood", "timestamp": "2007-12-03T02:27:09Z", "full_text": "--- In EVP-ITC@yahoogroups.com, &quot;Sum Duc&quot; &lt;duck@...&gt; wrote:\n&gt;\n&gt; To Clarify: \n&gt; This matter is of a personal nature. \n&gt; \n&gt; To the fans of the Hack, We have just begun! \n&gt; \n&gt; -Sum \n&gt;  . . . .. . . . . . . . . . . .. . . . ..  . . . . . . . . .      Hi All, I really doubt if it&#39;s Radio shack that&#39;s trying to do something here. Why would they want to do anything IF it&#39;s helping to sell their radios? This would be like If people promoted the fact that SONY&#39;s Cassette-corder TCM-929, or GE&#39;s 3-5027 cassette recorder were REALLY good to capture EVP&#39;s = so what? Anybody can take a manufactured item and then modify it! Agree? =Judy= = = = = = = = = = = = = = = = = = = = =   \n&gt; ----- Original Message ----- \n&gt; \n&gt;   From: Lisby \n&gt;   To: EVP-ITC@yahoogroups.com \n&gt;   Sent: Sunday, December 02, 2007 8:40 AM\n&gt;   Subject: Re: [EVP-ITC] Re: cease-and-desist notice from Radio Shack???\n&gt; \n&gt; \n&gt;   This is exactly what I expect is happening. Sum said the site would be down &quot;in the near term,&quot; which made me think he making modifications to be sure that the corporation cannot bother him again.\n&gt; \n&gt; \n&gt; \n&gt;   Ann\n&gt; \n&gt; \n&gt;   On Dec 2, 2007, at 9:55 AM, M.A. Coletta (Mike) wrote:\n&gt; \n&gt; \n&gt;     If it is in fact a cease-and-desist notice from Radio Shack, it \n&gt;     wouldn&#39;t be the first time they (RS) have done this. I receieved a \n&gt;     cease-and-desist notice from Radio Shack many years ago when I was \n&gt;     modifying their radio scanner products and posting them on the web. \n&gt;     Guess what... if you go to scanshack.com you can still see step-by-\n&gt;     step instructions on how I modified their scanners, with detailed \n&gt;     drawings I did.\n&gt;     They (RS/Tandy at that time) lost that battle with me, or I should \n&gt;     say their lawyer lost that battle with me.\n&gt;     But, as you said... we shall wait and see what is up with this issue.\n&gt;     - Mike\n&gt; \n&gt;     --- In EVP-ITC@yahoogroups.com, Lisby &lt;lisby@&gt; wrote:\n&gt;     &gt;\n&gt;     &gt; Judy, and everyone else, too--please don&#39;t promote or continue \n&gt;     this \n&gt;     &gt; until we hear from Sum. This may not be what everyone is assuming \n&gt;     at \n&gt;     &gt; all. My concern is that he has received a cease-and-desist notice \n&gt;     &gt; from Radio Shack, which may have been informed that someone was \n&gt;     &gt; promoting their product in a way not in compliment with their \n&gt;     &gt; corporate image, and that his counsel is advising he comply with \n&gt;     it. \n&gt;     &gt; What you are telling people to do may be exactly what his own \n&gt;     legal \n&gt;     &gt; counsel is advising against and may put him in a precarious \n&gt;     situation.\n&gt;     &gt; \n&gt;     &gt; Please just calm down and don&#39;t make assumption until he can \n&gt;     clarify \n&gt;     &gt; for us. If it comes down to someone making personal threats \n&gt;     against \n&gt;     &gt; him, that&#39;s a whole other matter. But he needs to ask for help \n&gt;     before \n&gt;     &gt; everyone goes all posse, OK?\n&gt;     &gt; \n&gt;     &gt; \n&gt;     &gt; \n&gt;     &gt; Ann\n&gt;     &gt; \n&gt;     &gt; \n&gt;     &gt; On Dec 1, 2007, at 11:53 PM, judy_in_hollywood wrote:\n&gt;     &gt; \n&gt;     &gt; &gt; Hi all, I sent George an email about our group here (to look in) \n&gt;     + \n&gt;     &gt; &gt; about the RS 12-469 AM/FM digital radio modification - for his \n&gt;     &gt; &gt; awareness! Hope he gets it & READS it. =Judy= P.S. On Friday&#39;s \n&gt;     &gt; &gt; anyone can call in (IF ya can get thru) to his show and discuse \n&gt;     &gt; &gt; anything, even the RS Hack! IDEA? Let everyone out there know \n&gt;     about \n&gt;     &gt; &gt; it = free advertising! LOL FRANK, call in!!!\n&gt;     &gt; &gt;\n&gt;     &gt; &gt;\n&gt;     &gt; &gt;\n&gt;     &gt;\n&gt;"}