{"id": "3676", "subject": "Re: [EVP-ITC] Spiraling out of control", "author": "joel smith", "timestamp": "2007-12-03T03:16:31Z", "full_text": "--0-205633075-1196651791=:29326\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nyes i will post what i get  if i be live it worth it that is  . it might take me awhile of playing with it and try different  things  so i do hope i can  provide so OK stuff .\n  Joel . \n  and it nice meeting all of you I  have been here awhile just reading and listing  . I also  have heard the box with Chris  and have had some really  good experiences  . but other time didn&#39;t hear much, \n    one time I  did make a observation , IE as in group with about 12 to 15 people  and it seemed  to me  that the Lady&#39;s that i was there with  heard what Chris  heard. and they would laugh  before he  had  translated with wht he had heard . from this observation I have come to believe men and women hear  different frequencies . But they were defiantly hearing what Chris was .I on the other hand  heard very little that night  as the other males in the group on that night.\n\nSteve Hultay &lt;urkel23@...&gt; wrote:\n          \nI think we should all focus at the research at hand and forget what \neveryone else is doing. I personally know Chris and think he&#39;s a \ngreat guy and frank feels the same way most days. This has gotten \nto the point where i can&#39;t even do a session anymore because i&#39;m so \nblocked by negative thoughts from this group it&#39;s pointless to \nconcentrate on the box and get results. Honestly who cares what \nchris does anyway, does it really affect everyone&#39;s lives that \nmuch. I have a job and this is a hobby that i used to really like, \nbut now this board has brought me down. It seems all people want to \ndo is make this like a street fight with challenges and negative \nviews and for what reason? If anyone is concerned about hearing \nChris&#39;s audio, i have about 2 hours of box sessions from Eastern \nState on my web site for all to listen to. It&#39;s \nwww.keyportparanormal.com and go to investigation and click on \neastern state. All the audio is at the bottom of that page and you \nguys can judge for yourself and i heard a lot come out of that box \nthat night personally because i repeated a lot of stuff back to \nchris that i heard. Enough already, let&#39;s move on to the next great \nthing. That radio shack hack was a great breakthrough here, let&#39;s \njust be happy we got that before it was shut down. Now we have \nanother avenue to go down, but we can&#39;t do it with all these \nnegatives out there. Let&#39;s move on to new topics and anyone out \nthere that bought a Radio Shack box, start sharing your files with \nthe group so it&#39;s not just us same 5 that post all the time.\n\n-Steve H.\n\n\n\n                         \n\n       \n---------------------------------\nGet easy, one-click access to your favorites.  Make Yahoo! your homepage.\r\n--0-205633075-1196651791=:29326\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;DIV&gt;yes i will post what i get&nbsp; if i be live it worth it that is&nbsp; . it might take me awhile of playing with it and try different&nbsp; things&nbsp; so i do hope i can&nbsp; provide so OK stuff .&lt;/DIV&gt;  &lt;DIV&gt;Joel . &lt;/DIV&gt;  &lt;DIV&gt;and it nice meeting all of you I&nbsp; have been here awhile just reading and listing&nbsp; . I also&nbsp; have heard the box with Chris&nbsp; and have had some really&nbsp; good experiences&nbsp; . but other time didn&#39;t hear much, &lt;/DIV&gt;  &lt;DIV&gt;&nbsp; one time I&nbsp; did make a observation , IE as in group with about 12 to 15 people&nbsp; and it seemed&nbsp; to me&nbsp; that the Lady&#39;s that i was there with&nbsp; heard what Chris&nbsp; heard. and they would laugh&nbsp; before he&nbsp; had&nbsp; translated with wht he had heard . from this observation I have come to believe men and women hear&nbsp; different frequencies . But they were defiantly hearing what Chris was .I on the other hand&nbsp; heard very little that night&nbsp; as the\n other males in the group on that night.&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;Steve Hultay &lt;urkel23@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/DIV&gt;  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;DIV&gt;&lt;BR&gt;I think we should all focus at the research at hand and forget what &lt;BR&gt;everyone else is doing. I personally know Chris and think he&#39;s a &lt;BR&gt;great guy and frank feels the same way most days. This has gotten &lt;BR&gt;to the point where i can&#39;t even do a session anymore because i&#39;m so &lt;BR&gt;blocked by negative thoughts from this group it&#39;s pointless to &lt;BR&gt;concentrate on the box and get results. Honestly who cares what &lt;BR&gt;chris does anyway, does it really affect everyone&#39;s\n lives that &lt;BR&gt;much. I have a job and this is a hobby that i used to really like, &lt;BR&gt;but now this board has brought me down. It seems all people want to &lt;BR&gt;do is make this like a street fight with challenges and negative &lt;BR&gt;views and for what reason? If anyone is concerned about hearing &lt;BR&gt;Chris&#39;s audio, i have about 2 hours of box sessions from Eastern &lt;BR&gt;State on my web site for all to listen to. It&#39;s &lt;BR&gt;www.keyportparanorm&lt;WBR&gt;al.com and go to investigation and click on &lt;BR&gt;eastern state. All the audio is at the bottom of that page and you &lt;BR&gt;guys can judge for yourself and i heard a lot come out of that box &lt;BR&gt;that night personally because i repeated a lot of stuff back to &lt;BR&gt;chris that i heard. Enough already, let&#39;s move on to the next great &lt;BR&gt;thing. That radio shack hack was a great breakthrough here, let&#39;s &lt;BR&gt;just be happy we got that before it was shut down. Now we have &lt;BR&gt;another avenue to go down, but we can&#39;t do it with all these &lt;BR&gt;negatives out\n there. Let&#39;s move on to new topics and anyone out &lt;BR&gt;there that bought a Radio Shack box, start sharing your files with &lt;BR&gt;the group so it&#39;s not just us same 5 that post all the time.&lt;BR&gt;&lt;BR&gt;-Steve H.&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;p&gt;&#32;\n      &lt;hr size=1&gt;Get easy, one-click access to your favorites. \n&lt;a href=&quot;http://us.rd.yahoo.com/evt=51443/*http://www.yahoo.com/r/hs&quot;&gt; Make Yahoo! your homepage.&lt;/a&gt;\n\n\r\n--0-205633075-1196651791=:29326--"}