{"id": "3687", "subject": "Re: Some new additions for the 12-470... I hope", "author": "Lance Oliver", "timestamp": "2007-12-03T06:02:39Z", "full_text": "What about reverse speech?\n\nHas anyone considered trying to use this technique with voice \nrecordings from the boxes? \n\nLance\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@...&gt; \nwrote:\n&gt;\n&gt; \n&gt;  Well, I can tell where that theory came from! It&#39;s been my \nexperience, they use what we use, as long as it&#39;s something they can \nform voices out of. It&#39;s also been my experience that the combo \nnoise/frag voice is what our own minds create. I suggest you play \nwith EVPmaker, with clear raw audio, you&#39;ll find no white noise \nneeded. \n&gt;  \n&gt;  I don&#39;t get any mention of technicians, or anykind of \nhelper/operators on the other side. They sometimes talk about a \nnetwork, but I couldn&#39;t tell you what that is, or if it&#39;s real. \n&gt;  \n&gt;  I think it&#39;s 99.99%PK. So not only do spirits, and other entities \nmake voices, we can do it to, mostly unconciuosly. \n&gt;  \n&gt;  Moon is still certain that it has to be random, despite the last \nseveral months of experiments that show the linear mode is far \nsuperior. \n&gt;  \n&gt;  If someone could take a digital speech recordng, stored in memory, \nand chop it up, and play it back over a speaker, I think it would \nwork just as well as radio. You could get live voices, answers to \nquestions, and never replace the raw audio. This is in fact EVPmaker, \nbut it would be nice to have it portable. EVPmaker pretty much took \nall the mystery out of this, and it&#39;s all but igonred. My system, and \nanalog version of EVPmaker using technologies I had worked wiht in \nthe past. My mind did kind of assemble all the elements, so I got an \nimage of the complete system. \n&gt;  \n&gt;  I thought I knew how the voices in my boxes worked at one \ntime..now I have no idea!\n&gt;  \n&gt;  Frank-S\n&gt;  \n&gt;  \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: michaelcoletta@...: Mon, 3 Dec 2007 00:22:35 \n+0000Subject: [EVP-ITC] Some new additions for the 12-470... I hope\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Excuse me if I mispell some things in this post, I&#39;m currently \nrunning the production board for a LIVE internet radion program going \non right now, and I&#39;m doing 100 things at once!Okay... According to \nsome, &quot;...the Spirit Technicians and Spirit Guides on the other side \nhave repeatedly explained that the way that the Telephone to the Dead \ntechnology works, is by spirit energy manipulating the random voltage \ngenerator (RVG) and using white and pink noise, as well as radio \nfragment, to create real time voice answers to questions posed from \nour side. The most important aspect to this device is the medium \noperator who works as an antenna or &quot;interpreter&quot; for living \nindividuals asking the questions.&quot;So, that said (or copied and \npasted) I have decided that my next attempt with the older version of \nthe 12-470 will be the following:1) Add a method of variable voltage \nused to adjust the tuning circuit, similar to the RVG mentioned \nabove. I went out and purchased another older 12-470 today, to do \njust this.(Frank... I did some measurements of that VT and found a \nrange to work with.. I hope!)2) Add that white or pink noise to be \nmixed with the sweeping raw audio already available from the modified \n12-470.3) Add an internal antenna for the 12-470.4) Add an interface \nso the user will be a active/passive part of the radio. As mentioned \nabove, as the antenna between the entities/spirits.So... if I can \naccomplish all that... maybe the little ole&#39; 12-470 will be \nrecognized by the &quot;experts&quot;, as having what the big mahcines now \nhave... :-)Wish me luck in my adventure... and oh, by-the-way... I \nhope to add all this, inside the existing case.- Mike \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; You keep typing, we keep giving. Download Messenger and join the \ni&#39;m Initiative now.\n&gt; http://im.live.com/messenger/im/home/?source=TAGLM\n&gt;"}