{"id": "3689", "subject": "RE: MiniBox Reply", "author": "Lance Oliver", "timestamp": "2007-12-03T06:34:13Z", "full_text": "Hey There!\n\nBelow is a copy of an email exchange I had with Rick Moran, along \nwith his reply... \n\n\nFrom: Lance Oliver [mailto:orbhunterx@...] \nSent: Sunday, December 02, 2007 5:05 PM\nTo: Rick Moran\nSubject: MiniBox Reply\n\n\nHi Rick,\n\nI finally got a chance to listen to one of the responses from Ron&#39;s \nMiniBox. I&#39;m sure you&#39;ve heard it, but for context sake here&#39;s a copy \nof a reply from the MiniBox which April posted on the EVP-ITC Yahoo \ngroup, that came through at the Stanley -\n\nhttp://www.filecrunch.com/file/~wlrn97\n\nAll I heard at first was jibberish... Then, after listening and \nconsidering it, what I slammed into my mind loud and clear is, &quot;Prey \non your own... Don&#39;t you.&quot;\n\nPretty apt for those activily involved as researchers in this \nTwilight Zone of the paranormal, eh? LOL!\n\nI&#39;m amazed by the test results so far, and I&#39;m very pleased to say \nRon&#39;s sending me an invoice and I&#39;ll be purchasing one ASAP!\n\nGeorge Noory is suppose to be interviewing Rosemary Ellen Guiley on \nCoast To Coast AM this coming week, but when I just checked the only \navailable night is Wednesday and it says TBA. Since I listen to Coast \nall the time, I warned Ron that hits from show exposure will \ndefinitely crash Ron&#39;s site... \n\nHe&#39;s cool about it... LOL! \n\nHappy Holidays!\n\nLance\n\n\nFrom: RICK MORAN [mailto:orbhunterx@...] \nSent: Sunday, December 02, 2007 18:00 PM\nTo: Lance Oliver\nSubject: RE: MiniBox Reply\n\nYea, Rosemary is very excited about doing the show and now she has \nher very own MiniBox to play with, so it would be exciting the one \nthing that has not happened, but will now that Rosemary has a box, is \nthat she can go on radio live and let people listen directly then \nlet the chips land where they may.  My posted response was to try and \ncut off all the crap from Chris Moon, it rally tweaks my nose when \nsomeone like him tries to dictate to me, a Jesuit Educated researcher \nall about how to do my job and that his truth is the only truth.\n\nAnyplace you may venture where the box is mentioned, I&#39;d appreciate \nit if you posted my response.\n \nThanks,\n\nRick"}