{"id": "3690", "subject": "Rick Moran&#39;s Response on The Box", "author": "Lance Oliver", "timestamp": "2007-12-03T06:54:37Z", "full_text": "What follows is an email I got from Rick. I&#39;m reposting it here per \nhis request...\n\nThanks,\nLance\n\n\nA Open Response to Recent Discussions on The Box\n\nBy way of introduction, my name is Rick Moran and I am the \nCoordinator of the Association for the Study of Unexplained \nPhenomenon, a 35 year old research and educational organization that \nby our own corporate charter is dedicated to seeking proof of the \nsurvival of the human spirit after death. We are a 501 (c)(3) non-\nprofit corporation that is now based in Texas, and was originally \nfounded in New York City. We have been involved in dozens of major \ncases, from Amityville and Mothman to our present day work on cases \nlike the Skinwalker Ranch, not to mention a few hundred more that \nnever got any media coverage. In the past I have counted folks like \nScott Rogo, Peter Jordan and Paul Hoffman old friends. I continue to \nwrite for Fortean Times, Fate, and yes, Haunted Times on a regular \nbasis. I am pleased to say that the ASUP is a very serious group with \nserious aims.\n\nTwo years ago a member of our group came to me with a report he \nprepared on ITC or more commonly known as Spirit Comm. I was \nintrigued and began to look a little deeper, which led me to the work \nof Frank Sumption and his creation, Frank&#39;s Box.  I reached out to \nfriends in our field for the purpose of securing a Box for testing \nand then I waited and waited.  Finally I found the flow chart for \nFrank&#39;s Box on the Internet.  I have been a ham radio operator for \nlonger than I have been researching the paranormal, so the layout was \neasy to interpret. Later I came into the possession of a schematic \ndiagram, courtesy of Frank Sumption and became even more intrigued \nbut still even more puzzled about how this device could possibly \ncommunicate. \n\nThe ASUP has several divisions, all of which rely on each other to \noperate as a team.  The smallest of these groups is the Research and \nDevelopment team, headed by an electrical engineer and fellow ham, \nRon Ricketts, a no-nonsense kind of guy who I would categorize as a \nskeptical, show-me kind of person.  The purpose of R&D is simple; \nthey take common tools and make modifications to them, based on \nfeedback from the field investigators.  When a device like the K-II \nis found to be too broad, or lacking a simple on-off switch, the R&D \nteam would modify and test the devices to make them better.  It might \nbe noteworthy here to explain that all of our directors and many of \nyour ranking members are all licensed amateur radio operators, so it \ncan be assumed that when they ask for the R&D teams help, they fully \nunderstand the technical aspects of what they are requesting. This \napproach has always worked well for us, be it in creating new \nlighting systems for night vision or as mentioned before the \nmodification of the K-II meters.\n\nI went to Ron to ask if we could not create a similar device to \nFrank&#39;s Box, based on the schematics I had secured. Ron was, as \nalways skeptical about the outcome, but set the team in motion to \ncreate a Box. The first design was noisy and lacked discrimination, \nas Ron expected, but over the next several weeks, with a lot of \npushing and cajoling from myself, Ron worked on a succession of new \ndevices, each building on the prior.  The final design was decided \nupon when Ron was sitting at a lab bench, contemplating what else he \ncould conjure up, when the device, at that point a mass of wires, a \nspeaker and bread-boarded components with a new battery attached \nsnapped his attention with a single word, &quot;Ricketts!&quot; The word came \nacross loud and clear, no noise, no static, unlike any recordings of \nother Box communications we had heard.  Ron asked the rhetorical \nquestion, &quot;What?&quot; and the Box repeated, &quot;Ricketts!&quot; The Box \nrepeated the word one more time, when I was in the room to witness it!\n\nWe built our little box and made further enhancements, a better \nantenna, a new printed circuit board made to our specifications, \nseveral better, but more expensive components. The final device was \ncreated and was set out before a group of ASUP members.  Both Ron and \nI gave the Box to our Director of Research with some very short \ninstruction on how to tune it and then moved to a neutral corner, \nabout 20 feet away.  The remaining members of the team circled the \nBox and began to ask questions. One member asked, &quot;Who built you?&quot; \nand the Box responded &quot;Ron Rick.&quot;  The member attempted to correct \nthe Box, &quot;You mean Ron Ricketts?&quot; to which the Box \nanswered, &quot;NO!&quot; in a loud, clear tone.  The group worked with the \nBox for about 40 minutes. Some questions were clearly answered, \nothers totally ignored. Then the Box said loudly, &quot;Go Home!&quot;  When \nanother member began to formulate another question, the Box said \nagain, more loudly, &quot;GO HOME!&quot; Followed by &quot;Get Rick&quot;  I walked \nover to the group and the box again said, &quot;Go Home!&quot; and so I ended \nthe session.\n\nSimilar results were found when the Box was sent to the Stanley Hotel \nthat weekend, where Frank Sumption finally got to see and work with \nthe Box and gave it a rave review.  Frank had been in contact with \nboth myself and Ron Ricketts and had helped us along, but he was \namazed at what parts we had eliminated and what circuitry we had \nadded. He told those in the room, &quot;This device works better than any \nBox I have ever built.&quot;  He also admitted that he had hopes that the \npressure would now be removed from himself. \n\nThis of course, brings us up to the point at hand.  How does the \ndevice work.  Well it simply scans the AM broadcast band, cutting \nlittle slivers from all the broadcast signals. You can change the \ntone, the cycle rate, and volume as you wish, you can use a speaker \n(the larger the better we find) or a headphone, hook up a mic so that \nyou can record your questions as well as the answers and of course \nplug in a recorder. The unit uses a rechargeable power source, which \nyou can plug in to recharge and will last about 40 hours on a charge. \nIt is totally portable.\n\nThe larger question is WHY it works, and I do not have an answer for \nyou on that.  The Box does communicate, it answers some questions and \nseems to project an intelligence. The answers are rational, but I \nhave no idea how they are being generated or by whom. Remember, the \nreason that the ASUP built this device was for research to answer \njust those questions and an in depth study will begin in January with \nthe help of a university grant. No one in the ASUP is making any \nclaims of the paranormal at this point.  Remember, when Marconi first \nsent radio signals from one side of the Atlantic to the other, there \nwere those who pronounced his accomplishment as magic and obviously \nthat was not the case. Our hope is that other serious researchers \nwill join in this study and gain some insight to how it works, but I \nwill go on record to say that those who can successfully operate the \ndevice are certainly not limited to a select few nor are they someone \nblessed, anymore than when a person turns on the TV set.\n\nI have read dozens of pop-theories about what is being heard from the \nBox and I have a long list of things that it is not.  It is not \ninterference from ham radio, CB or FRMS radio signals, we have \nchecked diligently for that, it is not simply noise or static, there \nis none from our box. It could be matrixing, but some of what I have \npersonally heard seems to rule this out, although we will be doing \nmore testing in that area shortly. I simply can&#39;t offer a good \nexplanation for what is being reported from the Box at this time.\n\nThere was of course one other problem.  How do we get these devices \ninto the hands of those who want to study them?  A non-profit \ncorporation can&#39;t go into the business of marketing, so the ASUP \ngave Ron Ricketts the full rights to the device and he in turn gave \nit to an electronics producer for mass production.  This is not a \ncheap device to build, there are no Radio Shack parts inside, we \ndemanded only top components and our design has been strictly adhered \nto in every way; the circuit board is our own design.  The device is \nnow available through www.paranormalsystems.com and you have my word \nit is being sold at as close to cost as it can possibly be.  If in \nthe future we find a less expensive way to do it, we will, but for \nnow the device is at least available to everyone, without the need to \ngain Thomas Edison&#39;s permission, or pay an hourly fee.  What the \ndevice says is now open to your own interpretation.\n\nThe Mini-Box, as it is now called, is now available and those who are \ninterested can go to the paranormal systems site to hear some audio \nclips, see the device itself and if they want one, can order it. This \nis not a fund raiser for ASUP. We are not getting anything out of \nthis, except for the Boxes we need to do the research. We have always \nattempted to support our fellow researchers and will continue to do \nso. We have also spent a lot of time trying to debunk the snake oil \nsalesmen of our field and will continue to pursue them as well.  I \nhope this answers some of the questions you have and hopefully clears \nthe air of the smoke and mirrors that seem to be popping up since we \nannounced our device. If you have any questions, I&#39;d love to have \nthe opportunity to try and answer them.\n \n\nRick Moran\n\nCoordinator, ASUP\n\nwww.asup-inc.org\n\nrick-moran@..."}