{"id": "3692", "subject": "Re: introducing myself", "author": "overunder21", "timestamp": "2007-12-03T07:20:14Z", "full_text": "I have read about tone generators myself but that seems to be almost \na step backward.  Wasn&#39;t spiricom in essence a oscillioscope/tone \ngenerator?  I know it was considered for a while to be the most \nsuccessful, but it was very electronic or synthetic in sound and \nrequired quite an operational budget and space.\n\nI think with your invention we have reached the cusp of being able to \ncreate the walkman of EVP/ITC - we&#39;re almost there.  And with the \ndiscovery of the Radioshack mod and the experience we and others have \nhad since your box first debuted I think we&#39;re almost to the point \nwhere it will be very inexpensive to make a reliable box and/or \nsomething that the average person could make following instructions.\n\nOf course the holy grail is something that reliably generates clear \nvoices every time with little or no white noise.  I know I read that \nsomeone was trying to create a device that did that, created the \nwhite noise and then cancelled it out, hopefully leaving you with \njust the voice.\n\nOh, and a reliable television ITC device would be quite the find \ntoo.  I plan on creating a RS mod box that will be self contained and \nportable...and my thought was if it works reliably I wonder if I \ncould integrate a simply video ITC generator into it as well.  It \nwould be great to be able to capture both audio and video.\n\nAnyways, carry on Frank.  I know you&#39;re doing good work.  IF you \nsearch the internet for EVP and especially ghost box recordings your \nname is constantly popping up in the recordings, so I&#39;m guessing \nthose communicating with us are quite happy with you.\n\nHow does it feel to be the first known living person to be a \ncelebrity on the other side, lol?\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@...&gt; \nwrote:\n&gt;\n&gt; \n&gt; Yeah, I do seem to get answers to question with my Ghostman box \n(one of a kind Mini box). the Ghostman is a combinatin of the linear \nsweep and an AM/FM radio with direct out put, no sound chamber  or \nmics. I have kinda palyed wiht white noise, but not for about six \nyears. There&#39;s some ideas about using tone generators instead of \nradio. \n&gt;  \n&gt;  Frank-S\n&gt;  \n&gt;  \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: overunder21@...: Sun, 2 Dec 2007 13:50:23 \n+0000Subject: [EVP-ITC] introducing myself\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Not really new to the group, been lurking for a few months just \nreading, listening, and studying.Unfortunately I&#39;m not much of an \nengineer so I&#39;ve been picking up books to help me better understand \nthe technical side of the boxes. I understand the practicality of \nthem (ie- creating random white noise to allow EVPs to be formed) but \nI hope to gain an understanding of how they work technically in hopes \nof building and tweaking my own.For me EVP has been something I&#39;ve \nbeen into all my life without knowing what it was (I&#39;m 30 now, I \nfirst learned the technical term about 22 or 23) - I guess I&#39;m what \npeople would call &quot;sensitive&quot; or whatever. But besides that, early on \nI was fascinated by seemingly coherant sounds that would come out of \nrandom noise on my clock radio in my bedroom as a kid, from what \nsounded like voices (thought I was crazy for a while) to even morse \ncode - for a long time one of my radios would produce random clicks \nor pops even when the speaker was off. My dad jokingly suggested it \nwas morse code, so I studied morse code and discovered that at least \nsome of it could be morse letters...usually they would spell one word \nand then gibberish.Anyways, once I learned what EVP was I began \nmessing around with recorders etc. My first clear recording came from \nusing EVP maker and was someone saying &quot;we have been waiting for \nyou.&quot; A few days later, after a frustrating lack of communication \nthey just told me &quot;build a box.(this happened to be after I learned \nof frank.)&quot; I&#39;ve been looking at all the boxes and their positives \nand negatives and this is what I&#39;m seeing:Franks models seem to \nproduce the most consistant results but also seem to be less two way \nthan some others (ie Joe&#39;s Box.) Joe&#39;s Box and the new radio shack \nmod seem to have some very clear voices coming through but skeptics \ncan argue that all you are hearing is snippets from radio \nbroadcasts.My thought for a cost-effective, low-tech alternative is \nto combine the two in that you create a radio shack mod like the \nUFOGeek one (multiple radios, a mixer, etc) and run it through an \necho box.Personally I believe that analog is giving the best results \noverall, and I think it has to do with ease of manipulating the \nsignal. Therefore my thought is taking a digital white noise signal \nlike that produced by the radio shack mods and then essentially \nbroadcasting it into the echo chamber and having a mic pick it up \ngives you the analog aspect.My question is has anyone tried this? And \nI was hoping for thoughts on the pros and cons of using AM vs. FM or \nboth.Oh, one other thing- any programmers/engineers out there? \nSomeone that could write code to allow us to randomly band scan a \ndigital radio? \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Share life as it happens with the new Windows Live.Download today \nit&#39;s FREE!\n&gt; http://www.windowslive.com/share.html?\nocid=TXT_TAGLM_Wave2_sharelife_112007\n&gt;"}