{"id": "3693", "subject": "Re: Some new additions for the 12-470... I hope", "author": "overunder21", "timestamp": "2007-12-03T07:24:36Z", "full_text": "Definately interested in how this turns out.  I really want to \nexperiment with the RS mods - I have an old laptop that is useless \nfor anything other than sound recording and word processing, a bunch \nof miscellaneous audio equipment (im an audiophile) and i&#39;m getting \nseveral of the radios to tweak with in hopes to find what works best \nand random seeding was something that I was wondering about.\n\nI was thinking again about white noise generation using something \nlike the echo box and relized that an old analog effects processor \nfor musicians (i&#39;m an ex-sound tech and dj, so its how i think) could \nbe perfect - running the raw signal from the radios through say a \ndelay pedal, an echo box, flanger, phaser, etc to generate more of a \nwhite tone and try to eliminate anything that could be considered \njust radio transmissions.  Besides, that gives whoever it is another \npiece of simple electronics to tweak with to communicate.\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;M.A. Coletta (Mike)&quot; \n&lt;michaelcoletta@...&gt; wrote:\n&gt;\n&gt; Excuse me if I mispell some things in this post, I&#39;m currently \n&gt; running the production board for a LIVE internet radion program \ngoing \n&gt; on right now, and I&#39;m doing 100 things at once!\n&gt; \n&gt; Okay... According to some, &quot;...the Spirit Technicians and Spirit \n&gt; Guides on the other side have repeatedly explained that the way \nthat \n&gt; the Telephone to the Dead technology works, is by spirit energy \n&gt; manipulating the random voltage generator (RVG) and using white and \n&gt; pink noise, as well as radio fragment, to create real time voice \n&gt; answers to questions posed from our side. The most important aspect \n&gt; to this device is the medium operator who works as an antenna \n&gt; or &quot;interpreter&quot; for living individuals asking the questions.&quot;\n&gt; \n&gt; So, that said (or copied and pasted) I have decided that my next \n&gt; attempt with the older version of the 12-470 will be the following:\n&gt; \n&gt; 1) Add a method of variable voltage used to adjust the tuning \n&gt; circuit, similar to the RVG mentioned above. I went out and \npurchased \n&gt; another older 12-470 today, to do just this.\n&gt; (Frank... I did some measurements of that VT and found a range to \n&gt; work with.. I hope!)\n&gt; \n&gt; 2) Add that white or pink noise to be mixed with the sweeping raw \n&gt; audio already available from the modified 12-470.\n&gt; \n&gt; 3) Add an internal antenna for the 12-470.\n&gt; \n&gt; 4) Add an interface so the user will be a active/passive part of \nthe \n&gt; radio. As mentioned above, as the antenna between the \n&gt; entities/spirits.\n&gt; \n&gt; So... if I can accomplish all that... maybe the little ole&#39; 12-470 \n&gt; will be recognized by the &quot;experts&quot;, as having what the big \nmahcines \n&gt; now have... :-)\n&gt; \n&gt; Wish me luck in my adventure... and oh, by-the-way... I hope to add \n&gt; all this, inside the existing case.\n&gt; \n&gt; - Mike\n&gt;"}