{"id": "3739", "subject": "Re: [EVP-ITC] Maybe there is only one box user allowed!?", "author": "lisby@earthlink.net", "timestamp": "2007-12-03T18:08:49Z", "full_text": "Frank--I have listened to this APSR broadcast and was incredibly impressed with what occurred at this event. Chris&#39;s box is quite capable of behaving like John Edward--directly bringing relations through to talk to those who need to hear them. Some of the responses were astoundingly clear and loud. It certainly sounded similar to what I have heard of what Bruce is getting, and honestly, it is exactly what I hope to get with my box when I receive it.\n\nIf you haven&#39;t listened to this, you really should. I think Chris made his usual statements about Edison and the 30, but aside from that, this was a wonderful session and people were extremely moved.\n\nIf you want, I&#39;ll find the URL.\n\nAnn\n\n\n\n-----Original Message-----\n&gt;From: Frank Sumption &lt;franks-boxes@...&gt;\n&gt;Sent: Dec 3, 2007 12:40 PM\n&gt;To: Group &lt;evp-itc@yahoogroups.com&gt;\n&gt;Subject: [EVP-ITC] Maybe there is only one box user allowed!?\n&gt;\n&gt;\n&gt;&quot;Christopher was immediately taken by what he had seen and heard. He was able to &gt; make a direct connection with spirits. inhabitants, victims, participants, and &gt; witnesses...describing amazing events and even some unspeakable acts that had &gt; happened within the walls of these notoriously haunted places. The details &gt; afforded by these spirits gave answers to lingering questions that could not &gt; have come from anyone but the parties involved. Already amazed by the &gt; instrument&#39;s ability to connect with these historical figures, Christopher soon &gt; realized that other entities were trying to reach out as well. Deceased fathers, &gt; sons, mothers, daughters, and friends of session participants were sending &gt; messages through the device. Talk of this spread, and last year, at the Ghost &gt; Chaser&#39;s Weekend Conference in Savannah, Georgia, Christopher was asked to do a &gt; presentation about his research with the Telephone to the Dead. This quickly &gt; turned into an impromtu public demonstration, with participants, one by one, &gt; coming forward requesting to speak with loved ones who had died. Surprisingly, &gt; even to Christopher, these requests were met with comforting and sometimes vital &gt; messages. The presentation was recorded and broadcasted by A.P.S.R. Radio.&quot;\n&gt; \n&gt; From a recent add for another presentation, but apparently the rest of us get nothing like this, so it doesn&#39;t even work for us. Guess I&#39;ll just go back to killing time wth Ham radio, and quit wasting all my time and money on useless boxes. \n&gt; \n&gt; Curious that no one else gets any &quot;real&quot; contacts--event the so called box inventor gets nothing.\n&gt; \n&gt; \n&gt; Frank-S \n&gt;_________________________________________________________________\n&gt;You keep typing, we keep giving. Download Messenger and join the i’m Initiative now.\n&gt;http://im.live.com/messenger/im/home/?source=TAGLM"}