{"id": "3744", "subject": "Re: Maybe there is only one box user allowed!?", "author": "babiarz3", "timestamp": "2007-12-03T18:27:02Z", "full_text": "Thank you for this post. it was an amazing life altering experience\nfor all. \n\n\n--- In EVP-ITC@yahoogroups.com, lisby@... wrote:\n&gt;\n&gt; Frank--I have listened to this APSR broadcast and was incredibly\nimpressed with what occurred at this event. Chris&#39;s box is quite\ncapable of behaving like John Edward--directly bringing relations\nthrough to talk to those who need to hear them. Some of the responses\nwere astoundingly clear and loud. It certainly sounded similar to what\nI have heard of what Bruce is getting, and honestly, it is exactly\nwhat I hope to get with my box when I receive it.\n&gt; \n&gt; If you haven&#39;t listened to this, you really should. I think Chris\nmade his usual statements about Edison and the 30, but aside from\nthat, this was a wonderful session and people were extremely moved.\n&gt; \n&gt; If you want, I&#39;ll find the URL.\n&gt; \n&gt; Ann\n&gt; \n&gt; \n&gt; \n&gt; -----Original Message-----\n&gt; &gt;From: Frank Sumption &lt;franks-boxes@...&gt;\n&gt; &gt;Sent: Dec 3, 2007 12:40 PM\n&gt; &gt;To: Group &lt;evp-itc@yahoogroups.com&gt;\n&gt; &gt;Subject: [EVP-ITC] Maybe there is only one box user allowed!?\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;&quot;Christopher was immediately taken by what he had seen and heard.\nHe was able to &gt; make a direct connection with spirits. inhabitants,\nvictims, participants, and &gt; witnesses...describing amazing events and\neven some unspeakable acts that had &gt; happened within the walls of\nthese notoriously haunted places. The details &gt; afforded by these\nspirits gave answers to lingering questions that could not &gt; have come\nfrom anyone but the parties involved. Already amazed by the &gt;\ninstrument&#39;s ability to connect with these historical figures,\nChristopher soon &gt; realized that other entities were trying to reach\nout as well. Deceased fathers, &gt; sons, mothers, daughters, and friends\nof session participants were sending &gt; messages through the device.\nTalk of this spread, and last year, at the Ghost &gt; Chaser&#39;s Weekend\nConference in Savannah, Georgia, Christopher was asked to do a &gt;\npresentation about his research with the Telephone to the Dead. This\nquickly &gt; turned into an impromtu public demonstration, with\nparticipants, one by one, &gt; coming forward requesting to speak with\nloved ones who had died. Surprisingly, &gt; even to Christopher, these\nrequests were met with comforting and sometimes vital &gt; messages. The\npresentation was recorded and broadcasted by A.P.S.R. Radio.&quot;\n&gt; &gt; \n&gt; &gt; From a recent add for another presentation, but apparently the\nrest of us get nothing like this, so it doesn&#39;t even work for us.\nGuess I&#39;ll just go back to killing time wth Ham radio, and quit\nwasting all my time and money on useless boxes. \n&gt; &gt; \n&gt; &gt; Curious that no one else gets any &quot;real&quot; contacts--event the so\ncalled box inventor gets nothing.\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; Frank-S \n&gt; &gt;_________________________________________________________________\n&gt; &gt;You keep typing, we keep giving. Download Messenger and join the\ni’m Initiative now.\n&gt; &gt;http://im.live.com/messenger/im/home/?source=TAGLM\n&gt;"}