{"id": "3746", "subject": "Re: I don&#39;t know about that!!", "author": "lisbyfarrum", "timestamp": "2007-12-03T18:45:31Z", "full_text": "--- In EVP-ITC@yahoogroups.com, &quot;babiarz3&quot; &lt;babiarz3@...&gt; wrote:\n&gt;\n&gt; Let&#39;s not twist words here. Show me where Chris has said you &quot;only&quot;\n&gt; get false communication or bad guys. \n&gt; BTW I thought we were trying to get the negativity behind us and move\n&gt; on to constructive discussion. Guess that&#39;s more of the wishy-washy\n&gt; depends on what my hair feels like doing ways here. \n\nfrom his own blog (clipped, but not otherwise altered):\n\n&quot;Wednesday, November 28, 2007\nThe Box has hit the fan!\nCurrent mood: distressed\n\n&quot;I have recently\nbeen made aware that there are several replica versions of this\ndevice being sold. I have also been told of another device that can\nbe purchased for very little from any electronics merchant and\naltered by hand, producing what some consider to be results. As I\nexpected, the samples that people have sent me are *nothing more\nthan timed radio scans that have no validity.* [emphasis mine]\n\n&quot;These new &quot;radio scanners&quot; are not only *a waste of money* for\npeople looking to do research with them in hopes of having\neffective communication with the other side, but may in fact be *very\ndangerous*. Should demonic and other negative entities learn to use\nthese false\n devices, *the results could be devastating.*\n\n &quot;...The Catholic Church ... predicted the widespread sale of\n*false communication devices* as far back as last year. *I have recently\nbegun to receive requests from individuals asking for help to close\nnegative doorways and portals that they believe they opened using\ntheir purchased Telephone to the Dead replica*. Others are claiming\n&gt; that I am a fraud because their purchased device doesn&#39;t produce\nthe positive results I have been fortunate enough to have.&quot;\n\nSo let&#39;s go throug this again:\n\n*nothing more than timed radio scans that have no validity.*\n\n*a waste of money*\n\n*very dangerous*\n\n*the results could be devastating.*\n\n*false communication devices*\n\n*I have recently begun to receive requests from individuals asking for\nhelp to close negative doorways and portals that they believe they\nopened using their purchased Telephone to the Dead replica.*\n\nAs you see, there are two statements that Chris is making--so much for\nhe&#39;s always consistant, which I believe was an earlier statement that\nyou made.\n\n1. The new boxes create accidental timed radio scans only.\n\n2. The new boxes are very dangerous because they draw negative results.\n\nI&#39;m not sure how the two statements can stand together, but in either\ncase, his opinion is clearly not complimentary toward the rest of the\nbox users besides the four of the 30 he says, in the same post, &quot;have\nbeen identified.&quot;\n\nRather cheeky and insulting and wrong, HMO. But if he just goes on\ndoing sessions like the one APSR recorded, I will continue to laud them.\n\nAnn"}