{"id": "3748", "subject": "Re: I don&#39;t know about that!!", "author": "babiarz3", "timestamp": "2007-12-03T19:14:28Z", "full_text": "More info about what? How to stir the pot? \n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@...&gt; wrote:\n&gt;\n&gt; \n&gt; Okay, okay. I admit it, just trying to stir the pot, but I guess it\nboiled over! But it did get me more info. \n&gt;  \n&gt;  Frank-S\n&gt; \n&gt; \n&gt; To: EVP-ITC@...: lisby@...: Mon, 3 Dec 2007 18:45:31 +0000Subject:\n[EVP-ITC] Re: I don&#39;t know about that!!\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;babiarz3&quot; &lt;babiarz3@&gt; wrote:&gt;&gt;\nLet&#39;s not twist words here. Show me where Chris has said you &quot;only&quot;&gt;\nget false communication or bad guys. &gt; BTW I thought we were trying to\nget the negativity behind us and move&gt; on to constructive discussion.\nGuess that&#39;s more of the wishy-washy&gt; depends on what my hair feels\nlike doing ways here. from his own blog (clipped, but not otherwise\naltered):&quot;Wednesday, November 28, 2007The Box has hit the fan!Current\nmood: distressed&quot;I have recentlybeen made aware that there are several\nreplica versions of thisdevice being sold. I have also been told of\nanother device that canbe purchased for very little from any\nelectronics merchant andaltered by hand, producing what some consider\nto be results. As Iexpected, the samples that people have sent me are\n*nothing morethan timed radio scans that have no validity.* [emphasis\nmine]&quot;These new &quot;radio scanners&quot; are not only *a waste of money*\nforpeople looking to do research with them in hopes of havingeffective\ncommunication with the other side, but may in fact be *verydangerous*.\nShould demonic and other negative entities learn to usethese\nfalsedevices, *the results could be devastating.*&quot;...The Catholic\nChurch ... predicted the widespread sale of*false communication\ndevices* as far back as last year. *I have recentlybegun to receive\nrequests from individuals asking for help to closenegative doorways\nand portals that they believe they opened usingtheir purchased\nTelephone to the Dead replica*. Others are claiming&gt; that I am a fraud\nbecause their purchased device doesn&#39;t producethe positive results I\nhave been fortunate enough to have.&quot;So let&#39;s go throug this\nagain:*nothing more than timed radio scans that have no validity.**a\nwaste of money**very dangerous**the results could be\ndevastating.**false communication devices**I have recently begun to\nreceive requests from individuals asking forhelp to close negative\ndoorways and portals that they believe theyopened using their\npurchased Telephone to the Dead replica.*As you see, there are two\nstatements that Chris is making--so much forhe&#39;s always consistant,\nwhich I believe was an earlier statement thatyou made.1. The new boxes\ncreate accidental timed radio scans only.2. The new boxes are very\ndangerous because they draw negative results.I&#39;m not sure how the two\nstatements can stand together, but in eithercase, his opinion is\nclearly not complimentary toward the rest of thebox users besides the\nfour of the 30 he says, in the same post, &quot;havebeen identified.&quot;Rather\ncheeky and insulting and wrong, HMO. But if he just goes ondoing\nsessions like the one APSR recorded, I will continue to laud them.Ann \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Connect and share in new ways with Windows Live.\n&gt;\nhttp://www.windowslive.com/connect.html?ocid=TXT_TAGLM_Wave2_newways_112007\n&gt;"}