{"id": "3764", "subject": "Children and research!", "author": "Frank Ratka", "timestamp": "2007-12-03T20:04:55Z", "full_text": "--0-1652160482-1196712295=:68562\r\nContent-Type: text/plain; charset=us-ascii\r\n\r\nI know where the instinct to protect your children comes from having two of my own but what do you think will happen to them if they are exposed to a box, radio, or other electronic device that allows our human senses to interpret a spirits existence. The beings that we speak to are close to our own vibrations, attitudes and dispositions. They are similar in character to ourselves otherwise they would not even notice us. We have all seen what can happen when you try to make contact while in different moods or dispositions. \n\nWhat do you think a child would come in contact with? Why is this anymore dangerous for a child than yourself? Do you honestly think you are prepared or know more about what you are doing than a child? If you think that you are fooling yourself! We are all equally ignorant!\n\nLike attracts Like! This is a phrase we have all heard for years but it took on a new meaning when we started research in ITC. Please don&#39;t fool yourselves, the beings are around you whether you operate a box or not. They influence, guide, protect and watch our lives. All negative experiences I have ever seen either when I was in the field or teaching someone at a meeting was caused by fear. Fear is the root of all hatred and evil (whatever evil is). Fear keeps us from learning and experiencing new things.\n\nI don&#39;t know about ya&#39;ll but my children are well aware of what daddy does. They are educated on how my equipment works and even know the names of some of the spirits who regularly come through. They are interested in the afterlife just like everyone else and I teach them in a completely positive light. They do not fear life or death and I hope they never make decisions while worrying about either. I will promote those ideals until the time comes for them to leave my house and they make their own decisions.\n\nWhat I am trying to say is, quit protecting your children from something you don&#39;t even know if they need protection from. All you are doing is generating fear!\n\nRegards,\n\nFrank R.\n\n\n\n\n      ____________________________________________________________________________________\nBe a better friend, newshound, and \nknow-it-all with Yahoo! Mobile.  Try it now.  http://mobile.yahoo.com/;_ylt=Ahu06i62sR8HDtDypao8Wcj9tAcJ \n\r\n--0-1652160482-1196712295=:68562\r\nContent-Type: text/html; charset=us-ascii\r\n\r\n&lt;html&gt;&lt;head&gt;&lt;style type=&quot;text/css&quot;&gt;&lt;!-- DIV {margin:0px;} --&gt;&lt;/style&gt;&lt;/head&gt;&lt;body&gt;&lt;div style=&quot;font-family:times new roman, new york, times, serif;font-size:12pt&quot;&gt;&lt;div style=&quot;font-family: times new roman,new york,times,serif; font-size: 12pt;&quot;&gt;I know where the instinct to protect your children comes from having two of my own but what do you think will happen to them if they are exposed to a box, radio, or other electronic device that allows our human senses to interpret a spirits existence. The beings that we speak to are close to our own vibrations, attitudes and dispositions. They are similar in character to ourselves otherwise they would not even notice us. We have all seen what can happen when you try to make contact while in different moods or dispositions. &lt;br&gt;&lt;br&gt;What do you think a child would come in contact with? Why is this anymore dangerous for a child than yourself? Do you honestly think you are prepared or know more about what you are doing\n than a child? If you think that you are fooling yourself! We are all equally ignorant!&lt;br&gt;&lt;br&gt;Like attracts Like! This is a phrase we have all heard for years but it took on a new meaning when we started research in ITC. Please don&#39;t fool yourselves, the beings are around you whether you operate a box or not. They influence, guide, protect and watch our lives. All negative experiences I have ever seen either when I was in the field or teaching someone at a meeting was caused by fear. Fear is the root of all hatred and evil (whatever evil is). Fear keeps us from learning and experiencing new things.&lt;br&gt;&lt;br&gt;I don&#39;t know about ya&#39;ll but my children are well aware of what daddy does. They are educated on how my equipment works and even know the names of some of the spirits who regularly come through. They are interested in the afterlife just like everyone else and I teach them in a completely positive light. They do not fear life or death and I hope they\n never make decisions while worrying about either. I will promote those ideals until the time comes for them to leave my house and they make their own decisions.&lt;br&gt;&lt;br&gt;What I am trying to say is, quit protecting your children from something you don&#39;t even know if they need protection from. All you are doing is generating fear!&lt;br&gt;&lt;br&gt;Regards,&lt;br&gt;&lt;br&gt;Frank R.&lt;br&gt;&lt;/div&gt;&lt;/div&gt;&lt;br&gt;\n\n      &lt;hr size=1&gt;Never miss a thing.  &lt;a href=&quot;http://us.rd.yahoo.com/evt=51438/*http://www.yahoo.com/r/hs&quot;&gt; Make Yahoo your homepage.&lt;/a&gt;\n\n&lt;/body&gt;&lt;/html&gt;\r\n--0-1652160482-1196712295=:68562--"}