{"id": "3765", "subject": "Re: Spiraling out of control- Enough of the namecalling and fighting!!", "author": "Lance Oliver", "timestamp": "2007-12-03T20:05:03Z", "full_text": "How about Boxonians or Boxnicks? \n\nLance\n\n--- In EVP-ITC@yahoogroups.com, lisby@... wrote:\n&gt;\n&gt; \n&gt; &quot;Boxology&quot;? I like it!\n&gt; \n&gt; Ann\n&gt; \n&gt; \n&gt; -----Original Message-----\n&gt; &gt;From: Frank Sumption &lt;franks-boxes@...&gt;\n&gt; &gt;Sent: Dec 3, 2007 10:13 AM\n&gt; &gt;To: evp-itc@yahoogroups.com\n&gt; &gt;Subject: RE: [EVP-ITC] Spiraling out of control- Enough of the \nnamecalling and fighting!!\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Yeah, I am the master! But... that&#39;s only when the Ol&#39; Lady ain&#39;t \nlooking over my shoulder! I have to tell everyone--she&#39;s pissed!!!! \nWay too much time in the basement, and way to much money spent on \nsomething she considers useless.  I&#39;m rushing on yet another proto \ntype, one that gets rid of random mode, and has all functions, \nlinear, with direct voice mode, or though a sound chamber. Then---\nit&#39;s time to play with tones. \n&gt; &gt; \n&gt; &gt; Random mode, depsite the professed theory out there, no longer \nworks for me, maybe it&#39;s psychological, but the damn circuits won&#39;t \neven function. Random in the #24 box would not work at all at the \nStanley, so I&#39; am abandoning that function. I know what Moon claims \nabout the raw having to be random--simply not true, that was based on \nmy assumptions about how the box worked in the early days of \nboxology. &quot;\n&gt; &gt; \n&gt; &gt; Frank-S\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;To: EVP-ITC@...: bulletbabea@...: Sun, 2 Dec 2007 18:26:41 -\n0800Subject: Re: [EVP-ITC] Spiraling out of control- Enough of the \nnamecalling and fighting!!\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;To ALL members of this group,\n&gt; &gt;I agree with Steve. Ive told you all this many times yet some of \nyou like to get caught up in the heat of the moment.\n&gt; &gt; \n&gt; &gt;It is very disturbing to watch you all try to win this war of \nwords. There is no winner just a bunch of losers. And while you are \nbusy losing theres no GOOD research being performed by YOU.\n&gt; &gt; \n&gt; &gt;How much research did YOU do today? How much time did you spend \nfiring off replies to attempt to respond to someone you dont even \nknow about something that doesnt even involve YOU? How much time did \nyou spend replying to join in the arguments you feel do involve YOU?\n&gt; &gt; \n&gt; &gt;The point being, this is a research group for ITC not a boxing \nroom and definitely your own personal battlegrounds. Take that \nelsewhere. Healthy discussion is one thing but I have seen very few \npeople offering that. In fact I know a few of you joined here just to \ngo after someone who ticked you off. Then there are those who just \nseem to be firing in all directions, taget doesnt matter.\n&gt; &gt; \n&gt; &gt;Get a grip people!! Ive seen 4 year olds with more self control. \nIf you arent interested in researching ITC for yourself then what the \nheck are YOU doing HERE. \n&gt; &gt; \n&gt; &gt;ONCE AGAIN THIS IS AN ITC RESEARCH GROUP!! \n&gt; &gt; \n&gt; &gt;As for the box Frank is and always has been the first/primary \ntester of any box he has built. \n&gt; &gt; \n&gt; &gt;lol\n&gt; &gt;Misty\n&gt; &gt; \n&gt; &gt;P.S. I think you all are capable of finding better things to do, \nif not let me know and I will give you a few ideas =)\n&gt; &gt;Steve Hultay &lt;urkel23@...&gt; wrote:\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;I think we should all focus at the research at hand and forget \nwhat everyone else is doing. I personally know Chris and think he&#39;s a \ngreat guy and frank feels the same way most days. This has gotten to \nthe point where i can&#39;t even do a session anymore because i&#39;m so \nblocked by negative thoughts from this group it&#39;s pointless to \nconcentrate on the box and get results. Honestly who cares what chris \ndoes anyway, does it really affect everyone&#39;s lives that much. I have \na job and this is a hobby that i used to really like, but now this \nboard has brought me down. It seems all people want to do is make \nthis like a street fight with challenges and negative views and for \nwhat reason? If anyone is concerned about hearing Chris&#39;s audio, i \nhave about 2 hours of box sessions from Eastern State on my web site \nfor all to listen to. It&#39;s www.keyportparanormal.com and go to \ninvestigation and click on eastern state. All the audio is at the \nbottom of that page and you guys can judge for yourself and i heard a \nlot come out of that box that night personally because i repeated a \nlot of stuff back to chris that i heard. Enough already, let&#39;s move \non to the next great thing. That radio shack hack was a great \nbreakthrough here, let&#39;s just be happy we got that before it was shut \ndown. Now we have another avenue to go down, but we can&#39;t do it with \nall these negatives out there. Let&#39;s move on to new topics and anyone \nout there that bought a Radio Shack box, start sharing your files \nwith the group so it&#39;s not just us same 5 that post all the time.-\nSteve H.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;Be a better sports nut! Let your teams follow you with Yahoo \nMobile. Try it now. \n&gt; &gt; \n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;_________________________________________________________________\n&gt; &gt;Connect and share in new ways with Windows Live.\n&gt; &gt;http://www.windowslive.com/connect.html?\nocid=TXT_TAGLM_Wave2_newways_112007\n&gt;"}