{"id": "3767", "subject": "Re: MiniBox - General Recommendations", "author": "Lance Oliver", "timestamp": "2007-12-03T20:08:46Z", "full_text": "I&#39;m totally in favor of prayer protection, white light, saging, ect...\n\nIt works on many levels. Better if we focus on what we want, instead \nof what we don&#39;t. Law of attraction in action!\n\nLance\n\n--- In EVP-ITC@yahoogroups.com, bruce halliday \n&lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; Frank,\n&gt;  \n&gt; That is very true there is an abundance of taps and most haunted \ninfluence on most new investigators\n&gt; and researchers coming into the field. A lot of the new researchers \nwill have the luxury of starting and learning about\n&gt; evp using a box now that the RS is available. It&#39;s a shame because \nI believe those of us that put their time in the \n&gt; trenches when there where no boxes just cassette recorders and then \ndvr&#39;s and you had to pray that the voices \n&gt; were loud enough and clear enough to attempt to understand. I have \nbeen doing evp research for a little under ten\n&gt; years and have experimented with every type of method of audio and \nvisual itc and evp and only one time using a joe&#39;s box \n&gt; did Steve and myself experience a peculiar and suspicious \noccurrence, when both our Joe&#39;s boxes where fried within 2 days \n&gt; of each other. other than that only the occasional curse word or \nnasty response. If anyone that is attempting or contemplating\n&gt; doing research with a box, if you are concerned about dark heads \njust say a short protection prayer before each session and that will \nhelp\n&gt; to calm your fears.\n&gt;  \n&gt; Bruce\n&gt; \n&gt; Bruce Halliday Paranormal Investigating Team \n&gt; \n&gt; \n&gt; To: evp-itc@...: franks-boxes@...: Mon, 3 Dec 2007 08:00:17 -\n0700Subject: RE: [EVP-ITC] MiniBox - General Recommendations\n&gt; \n&gt; \n&gt; \n&gt; \n&gt;  I use my stuff with the Grandkids in the room, never--never--never-\n-has there been a problem. The disclaimer is no doubt one of those \njust incase things. All this stuff is brand new, the theory behind it \nscetchy at best, and the infromation for site to will be inconsitent. \nIt seems some expect it to be gospel truth, right off the bat. I&#39;m \nstill seeing alot of Hollywood at work here.   Frank-S\n&gt; \n&gt; \n&gt; To: EVP-ITC@...: lisby@...: Mon, 3 Dec 2007 05:00:19 -0500Subject: \nRe: [EVP-ITC] MiniBox - General Recommendations\n&gt; \n&gt; \n&gt; Well, so much for the &quot;Oh Noes!1!! What abouts the childern!!??!1&quot; \nmisinformation. \n&gt; \n&gt; Ann\n&gt; \n&gt; \n&gt; \n&gt; On Dec 3, 2007, at 3:19 AM, Lance Oliver wrote:\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; I pulled this list of general recommendations for The MiniBox right \noff Ron&#39;s www.paranormalsystems.com page -1. Do not allow children \nunder the age of 16 to use this device 2. Although individual \nsessions are effective, group sessions are more productive.3. This is \nnot an &#39;electronic Ouija board&#39; - no harm can come from using it. 4. \nSome voices will use coarse language so be prepared for it. 5. Always \nuse a recorder to tape all sessions 6. Keep a notebook with the times \nand locations of your sessions. 7. The MiniBox will call you by name \nso don&#39;t be startled by it. Lance\n&gt; \n&gt; You keep typing, we keep giving. Download Messenger and join the \ni&#39;m Initiative now. Join in! \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Your smile counts. The more smiles you share, the more we donate. \nJoin in.\n&gt; www.windowslive.com/smile?ocid=TXT_TAGLM_Wave2_oprsmilewlhmtagline\n&gt;"}