{"id": "3779", "subject": "Re: I don&#39;t know about that!!", "author": "Lance Oliver", "timestamp": "2007-12-03T20:52:50Z", "full_text": "Taking a bodyguard or glock?\n\nLance\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@...&gt; \nwrote:\n&gt;\n&gt; \n&gt; Thanks!!!  Chris wants to meets Saturday, but I am uncertain of the \npurpose. I don&#39;t/won&#39;t endorse anyone or anything as being the \nonlyest one. \n&gt;  \n&gt;  Frank\n&gt; \n&gt; \n&gt; To: EVP-ITC@...: lisby@...: Mon, 3 Dec 2007 18:45:31 +0000Subject: \n[EVP-ITC] Re: I don&#39;t know about that!!\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;babiarz3&quot; &lt;babiarz3@&gt; wrote:&gt;&gt; \nLet&#39;s not twist words here. Show me where Chris has said you &quot;only&quot;&gt; \nget false communication or bad guys. &gt; BTW I thought we were trying \nto get the negativity behind us and move&gt; on to constructive \ndiscussion. Guess that&#39;s more of the wishy-washy&gt; depends on what my \nhair feels like doing ways here. from his own blog (clipped, but not \notherwise altered):&quot;Wednesday, November 28, 2007The Box has hit the \nfan!Current mood: distressed&quot;I have recentlybeen made aware that \nthere are several replica versions of thisdevice being sold. I have \nalso been told of another device that canbe purchased for very little \nfrom any electronics merchant andaltered by hand, producing what some \nconsider to be results. As Iexpected, the samples that people have \nsent me are *nothing morethan timed radio scans that have no \nvalidity.* [emphasis mine]&quot;These new &quot;radio scanners&quot; are not only *a \nwaste of money* forpeople looking to do research with them in hopes \nof havingeffective communication with the other side, but may in fact \nbe *verydangerous*. Should demonic and other negative entities learn \nto usethese falsedevices, *the results could be devastating.*&quot;...The \nCatholic Church ... predicted the widespread sale of*false \ncommunication devices* as far back as last year. *I have \nrecentlybegun to receive requests from individuals asking for help to \nclosenegative doorways and portals that they believe they opened \nusingtheir purchased Telephone to the Dead replica*. Others are \nclaiming&gt; that I am a fraud because their purchased device doesn&#39;t \nproducethe positive results I have been fortunate enough to have.&quot;So \nlet&#39;s go throug this again:*nothing more than timed radio scans that \nhave no validity.**a waste of money**very dangerous**the results \ncould be devastating.**false communication devices**I have recently \nbegun to receive requests from individuals asking forhelp to close \nnegative doorways and portals that they believe theyopened using \ntheir purchased Telephone to the Dead replica.*As you see, there are \ntwo statements that Chris is making--so much forhe&#39;s always \nconsistant, which I believe was an earlier statement thatyou made.1. \nThe new boxes create accidental timed radio scans only.2. The new \nboxes are very dangerous because they draw negative results.I&#39;m not \nsure how the two statements can stand together, but in eithercase, \nhis opinion is clearly not complimentary toward the rest of thebox \nusers besides the four of the 30 he says, in the same post, &quot;havebeen \nidentified.&quot;Rather cheeky and insulting and wrong, HMO. But if he \njust goes ondoing sessions like the one APSR recorded, I will \ncontinue to laud them.Ann \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Connect and share in new ways with Windows Live.\n&gt; http://www.windowslive.com/connect.html?\nocid=TXT_TAGLM_Wave2_newways_112007\n&gt;"}