{"id": "3787", "subject": "Re: Children and research!", "author": "Lance Oliver", "timestamp": "2007-12-03T21:10:08Z", "full_text": "It&#39;s nice to totally disagree in a cordial fashion...\n\nLance\n\n--- In EVP-ITC@yahoogroups.com, Frank Ratka &lt;warrior18eii@...&gt; wrote:\n&gt;\n&gt; I know where the instinct to protect your children comes from \nhaving two of my own but what do you think will happen to them if \nthey are exposed to a box, radio, or other electronic device that \nallows our human senses to interpret a spirits existence. The beings \nthat we speak to are close to our own vibrations, attitudes and \ndispositions. They are similar in character to ourselves otherwise \nthey would not even notice us. We have all seen what can happen when \nyou try to make contact while in different moods or dispositions. \n&gt; \n&gt; What do you think a child would come in contact with? Why is this \nanymore dangerous for a child than yourself? Do you honestly think \nyou are prepared or know more about what you are doing than a child? \nIf you think that you are fooling yourself! We are all equally \nignorant!\n&gt; \n&gt; Like attracts Like! This is a phrase we have all heard for years \nbut it took on a new meaning when we started research in ITC. Please \ndon&#39;t fool yourselves, the beings are around you whether you operate \na box or not. They influence, guide, protect and watch our lives. All \nnegative experiences I have ever seen either when I was in the field \nor teaching someone at a meeting was caused by fear. Fear is the root \nof all hatred and evil (whatever evil is). Fear keeps us from \nlearning and experiencing new things.\n&gt; \n&gt; I don&#39;t know about ya&#39;ll but my children are well aware of what \ndaddy does. They are educated on how my equipment works and even know \nthe names of some of the spirits who regularly come through. They are \ninterested in the afterlife just like everyone else and I teach them \nin a completely positive light. They do not fear life or death and I \nhope they never make decisions while worrying about either. I will \npromote those ideals until the time comes for them to leave my house \nand they make their own decisions.\n&gt; \n&gt; What I am trying to say is, quit protecting your children from \nsomething you don&#39;t even know if they need protection from. All you \nare doing is generating fear!\n&gt; \n&gt; Regards,\n&gt; \n&gt; Frank R.\n&gt; \n&gt; \n&gt; \n&gt; \n&gt;       \n______________________________________________________________________\n______________\n&gt; Be a better friend, newshound, and \n&gt; know-it-all with Yahoo! Mobile.  Try it now.  \nhttp://mobile.yahoo.com/;_ylt=Ahu06i62sR8HDtDypao8Wcj9tAcJ\n&gt;"}