{"id": "3789", "subject": "Re: Some new additions for the 12-470... I hope", "author": "Lance Oliver", "timestamp": "2007-12-03T21:15:44Z", "full_text": "Hey Frank,\n\nCould you please elaborate on &quot;reversing decks&quot;? \n\nI use Cool Edit Pro to import, analyze, and save my EVPs. It is \ncapable of reversals of the wave form, isn&#39;t it? And is it as simple \nas that?\n\nThank You,\nLance\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@...&gt; \nwrote:\n&gt;\n&gt; \n&gt; I have &quot;reversing decks&quot; and I do it on the computer with normal \nspeech, and EVP. It&#39;s as real as anything else.\n&gt;  \n&gt;  Frank-s\n&gt; \n&gt; \n&gt; To: EVP-ITC@...: orbhunterx@...: Mon, 3 Dec 2007 19:56:57 \n+0000Subject: [EVP-ITC] Re: Some new additions for the 12-470... I \nhope\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Kewl!Who knows... I&#39;m not totally convinced on Reverse Speech \neither. But then I suppose trying as many different things as we are \ninspired to is a good thing.Lance--- In EVP-ITC@yahoogroups.com, \nFrank Sumption &lt;franks-boxes@&gt; wrote:&gt;&gt; &gt; Yes, but only when the \nintuition hits to reverse a voice, or phrase. I don&#39;t use it on \neverything, but there is often a reverse component. &gt; &gt; Frank-S&gt; &gt; &gt; \nTo: EVP-ITC@: orbhunterx@: Mon, 3 Dec 2007 06:02:39 +0000Subject: \n[EVP-ITC] Re: Some new additions for the 12-470... I hope&gt; &gt; &gt; &gt; &gt; \nWhat about reverse speech?Has anyone considered trying to use this \ntechnique with voice recordings from the boxes? Lance--- In EVP-\nITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@&gt; wrote:&gt;&gt; &gt; Well, \nI can tell where that theory came from! It&#39;s been my experience, they \nuse what we use, as long as it&#39;s something they can form voices out \nof. It&#39;s also been my experience that the combo noise/frag voice is \nwhat our own minds create. I suggest you play with EVPmaker, with \nclear raw audio, you&#39;ll find no white noise needed. &gt; &gt; I don&#39;t get \nany mention of technicians, or anykind of helper/operators on the \nother side. They sometimes talk about a network, but I couldn&#39;t tell \nyou what that is, or if it&#39;s real. &gt; &gt; I think it&#39;s 99.99%PK. So not \nonly do spirits, and other entities make voices, we can do it to, \nmostly unconciuosly. &gt; &gt; Moon is still certain that it has to be \nrandom, despite the last several months of experiments that show the \nlinear mode is far superior. &gt; &gt; If someone could take a digital \nspeech recordng, stored in memory, and chop it up, and play it back \nover a speaker, I think it would work just as well as radio. You \ncould get live voices, answers to questions, and never replace the \nraw audio. This is in fact EVPmaker, but it would be nice to have it \nportable. EVPmaker pretty much took all the mystery out of this, and \nit&#39;s all but igonred. My system, and analog version of EVPmaker using \ntechnologies I had worked wiht in the past. My mind did kind of \nassemble all the elements, so I got an image of the complete system. \n&gt; &gt; I thought I knew how the voices in my boxes worked at one \ntime..now I have no idea!&gt; &gt; Frank-S&gt; &gt; &gt; &gt; &gt; To: EVP-ITC@: \nmichaelcoletta@: Mon, 3 Dec 2007 00:22:35 +0000Subject: [EVP-ITC] \nSome new additions for the 12-470... I hope&gt; &gt; &gt; &gt; &gt; Excuse me if I \nmispell some things in this post, I&#39;m currently running the \nproduction board for a LIVE internet radion program going on right \nnow, and I&#39;m doing 100 things at once!Okay... According to \nsome, &quot;...the Spirit Technicians and Spirit Guides on the other side \nhave repeatedly explained that the way that the Telephone to the Dead \ntechnology works, is by spirit energy manipulating the random voltage \ngenerator (RVG) and using white and pink noise, as well as radio \nfragment, to create real time voice answers to questions posed from \nour side. The most important aspect to this device is the medium \noperator who works as an antenna or &quot;interpreter&quot; for living \nindividuals asking the questions.&quot;So, that said (or copied and \npasted) I have decided that my next attempt with the older version of \nthe 12-470 will be the following:1) Add a method of variable voltage \nused to adjust the tuning circuit, similar to the RVG mentioned \nabove. I went out and purchased another older 12-470 today, to do \njust this.(Frank... I did some measurements of that VT and found a \nrange to work with.. I hope!)2) Add that white or pink noise to be \nmixed with the sweeping raw audio already available from the modified \n12-470.3) Add an internal antenna for the 12-470.4) Add an interface \nso the user will be a active/passive part of the radio. As mentioned \nabove, as the antenna between the entities/spirits.So... if I can \naccomplish all that... maybe the little ole&#39; 12-470 will be \nrecognized by the &quot;experts&quot;, as having what the big mahcines now \nhave... :-)Wish me luck in my adventure... and oh, by-the-way... I \nhope to add all this, inside the existing case.- Mike &gt; &gt; &gt; &gt; &gt; &gt; &gt; \n__________________________________________________________&gt; You keep \ntyping, we keep giving. Download Messenger and join the i&#39;m \nInitiative now.&gt; http://im.live.com/messenger/im/home/?source=TAGLM&gt; \n&gt; &gt; &gt; &gt; &gt; &gt; &gt; \n__________________________________________________________&gt; You keep \ntyping, we keep giving. Download Messenger and join the i&#39;m \nInitiative now.&gt; http://im.live.com/messenger/im/home/?source=TAGLM&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Share life as it happens with the new Windows Live.Download today \nit&#39;s FREE!\n&gt; http://www.windowslive.com/share.html?\nocid=TXT_TAGLM_Wave2_sharelife_112007\n&gt;"}