{"id": "3791", "subject": "Re: Spiraling out of control- Enough of the namecalling and fighting!!", "author": "Lance Oliver", "timestamp": "2007-12-03T21:19:42Z", "full_text": "Indeed you are, Frank!\n\nMaster of Boxology\n\nWell Wishes,\nLance\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@...&gt; \nwrote:\n&gt;\n&gt; \n&gt; Boxologist....PH.d\n&gt; \n&gt; \n&gt; To: EVP-ITC@...: orbhunterx@...: Mon, 3 Dec 2007 20:05:03 \n+0000Subject: [EVP-ITC] Re: Spiraling out of control- Enough of the \nnamecalling and fighting!!\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; How about Boxonians or Boxnicks? Lance--- In EVP-\nITC@yahoogroups.com, lisby@ wrote:&gt;&gt; &gt; &quot;Boxology&quot;? I like it!&gt; &gt; Ann&gt; \n&gt; &gt; -----Original Message-----&gt; &gt;From: Frank Sumption &lt;franks-\nboxes@&gt;&gt; &gt;Sent: Dec 3, 2007 10:13 AM&gt; &gt;To: evp-itc@yahoogroups.com&gt; \n&gt;Subject: RE: [EVP-ITC] Spiraling out of control- Enough of the \nnamecalling and fighting!!&gt; &gt;&gt; &gt;&gt; &gt; Yeah, I am the master! But... \nthat&#39;s only when the Ol&#39; Lady ain&#39;t looking over my shoulder! I have \nto tell everyone--she&#39;s pissed!!!! Way too much time in the basement, \nand way to much money spent on something she considers useless. I&#39;m \nrushing on yet another proto type, one that gets rid of random mode, \nand has all functions, linear, with direct voice mode, or though a \nsound chamber. Then---it&#39;s time to play with tones. &gt; &gt; &gt; &gt; Random \nmode, depsite the professed theory out there, no longer works for me, \nmaybe it&#39;s psychological, but the damn circuits won&#39;t even function. \nRandom in the #24 box would not work at all at the Stanley, so I&#39; am \nabandoning that function. I know what Moon claims about the raw \nhaving to be random--simply not true, that was based on my \nassumptions about how the box worked in the early days of \nboxology. &quot;&gt; &gt; &gt; &gt; Frank-S&gt; &gt;&gt; &gt;&gt; &gt;To: EVP-ITC@: bulletbabea@: Sun, 2 \nDec 2007 18:26:41 -0800Subject: Re: [EVP-ITC] Spiraling out of \ncontrol- Enough of the namecalling and fighting!!&gt; &gt;&gt; &gt;&gt; &gt;&gt; &gt;&gt; &gt;&gt; &gt;To \nALL members of this group,&gt; &gt;I agree with Steve. Ive told you all \nthis many times yet some of you like to get caught up in the heat of \nthe moment.&gt; &gt; &gt; &gt;It is very disturbing to watch you all try to win \nthis war of words. There is no winner just a bunch of losers. And \nwhile you are busy losing theres no GOOD research being performed by \nYOU.&gt; &gt; &gt; &gt;How much research did YOU do today? How much time did you \nspend firing off replies to attempt to respond to someone you dont \neven know about something that doesnt even involve YOU? How much time \ndid you spend replying to join in the arguments you feel do involve \nYOU?&gt; &gt; &gt; &gt;The point being, this is a research group for ITC not a \nboxing room and definitely your own personal battlegrounds. Take that \nelsewhere. Healthy discussion is one thing but I have seen very few \npeople offering that. In fact I know a few of you joined here just to \ngo after someone who ticked you off. Then there are those who just \nseem to be firing in all directions, taget doesnt matter.&gt; &gt; &gt; &gt;Get a \ngrip people!! Ive seen 4 year olds with more self control. If you \narent interested in researching ITC for yourself then what the heck \nare YOU doing HERE. &gt; &gt; &gt; &gt;ONCE AGAIN THIS IS AN ITC RESEARCH GROUP!! \n&gt; &gt; &gt; &gt;As for the box Frank is and always has been the first/primary \ntester of any box he has built. &gt; &gt; &gt; &gt;lol&gt; &gt;Misty&gt; &gt; &gt; &gt;P.S. I think \nyou all are capable of finding better things to do, if not let me \nknow and I will give you a few ideas =)&gt; &gt;Steve Hultay &lt;urkel23@&gt; \nwrote:&gt; &gt;&gt; &gt;&gt; &gt;I think we should all focus at the research at hand \nand forget what everyone else is doing. I personally know Chris and \nthink he&#39;s a great guy and frank feels the same way most days. This \nhas gotten to the point where i can&#39;t even do a session anymore \nbecause i&#39;m so blocked by negative thoughts from this group it&#39;s \npointless to concentrate on the box and get results. Honestly who \ncares what chris does anyway, does it really affect everyone&#39;s lives \nthat much. I have a job and this is a hobby that i used to really \nlike, but now this board has brought me down. It seems all people \nwant to do is make this like a street fight with challenges and \nnegative views and for what reason? If anyone is concerned about \nhearing Chris&#39;s audio, i have about 2 hours of box sessions from \nEastern State on my web site for all to listen to. It&#39;s \nwww.keyportparanormal.com and go to investigation and click on \neastern state. All the audio is at the bottom of that page and you \nguys can judge for yourself and i heard a lot come out of that box \nthat night personally because i repeated a lot of stuff back to chris \nthat i heard. Enough already, let&#39;s move on to the next great thing. \nThat radio shack hack was a great breakthrough here, let&#39;s just be \nhappy we got that before it was shut down. Now we have another avenue \nto go down, but we can&#39;t do it with all these negatives out there. \nLet&#39;s move on to new topics and anyone out there that bought a Radio \nShack box, start sharing your files with the group so it&#39;s not just \nus same 5 that post all the time.-Steve H.&gt; &gt;&gt; &gt;&gt; &gt;Be a better sports \nnut! Let your teams follow you with Yahoo Mobile. Try it now. &gt; &gt; &gt; \n&gt;&gt; &gt;&gt; &gt;&gt; &gt;&gt; &gt;&gt; &gt;&gt; \n&gt;__________________________________________________________&gt; &gt;Connect \nand share in new ways with Windows Live.&gt; \n&gt;http://www.windowslive.com/connect.html?\nocid=TXT_TAGLM_Wave2_newways_112007&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Put your friends on the big screen with Windows Vista + Windows \nLive.\n&gt; http://www.microsoft.com/windows/shop/specialoffers.mspx?\nocid=TXT_TAGLM_CPC_MediaCtr_bigscreen_102007\n&gt;"}