{"id": "3808", "subject": "Re: [EVP-ITC] Re: I don&#39;t know about that!!", "author": "Lisby", "timestamp": "2007-12-04T00:05:24Z", "full_text": "Yes, that was exactly what I was attempting to do. I don&#39;t think it  \nworked, sadly.\n\nAnn\n\nOn Dec 3, 2007, at 2:26 PM, Frank Sumption wrote:\n\n&gt;\n&gt;  I think it&#39;s been spelled out so clear a blind man could read it.\n&gt;\n&gt; Frank-S\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; From: babiarz3@...\n&gt; Date: Mon, 3 Dec 2007 19:14:28 +0000\n&gt; Subject: [EVP-ITC] Re: I don&#39;t know about that!!\n&gt;\n&gt; More info about what? How to stir the pot?\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@...&gt;  \n&gt; wrote:\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Okay, okay. I admit it, just trying to stir the pot, but I guess it\n&gt; boiled over! But it did get me more info.\n&gt; &gt;\n&gt; &gt; Frank-S\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; To: EVP-ITC@...: lisby@...: Mon, 3 Dec 2007 18:45:31 +0000Subject:\n&gt; [EVP-ITC] Re: I don&#39;t know about that!!\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;babiarz3&quot; &lt;babiarz3@&gt; wrote:&gt;&gt;\n&gt; Let&#39;s not twist words here. Show me where Chris has said you &quot;only&quot;&gt;\n&gt; get false communication or bad guys. &gt; BTW I thought we were trying to\n&gt; get the negativity behind us and move&gt; on to constructive discussion.\n&gt; Guess that&#39;s more of the wishy-washy&gt; depends on what my hair feels\n&gt; like doing ways here. from his own blog (clipped, but not otherwise\n&gt; altered):&quot;Wednesday, November 28, 2007The Box has hit the fan!Current\n&gt; mood: distressed&quot;I have recentlybeen made aware that there are several\n&gt; replica versions of thisdevice being sold. I have also been told of\n&gt; another device that canbe purchased for very little from any\n&gt; electronics merchant andaltered by hand, producing what some consider\n&gt; to be results. As Iexpected, the samples that people have sent me are\n&gt; *nothing morethan timed radio scans that have no validity.* [emphasis\n&gt; mine]&quot;These new &quot;radio scanners&quot; are not only *a waste of money*\n&gt; forpeople looking to do research with them in hopes of havingeffective\n&gt; communication with the other side, but may in fact be *verydangerous*.\n&gt; Should demonic and other negative entities learn to usethese\n&gt; falsedevices, *the results could be devastating.*&quot;...The Catholic\n&gt; Church ... predicted the widespread sale of*false communication\n&gt; devices* as far back as last year. *I have recentlybegun to receive\n&gt; requests from individuals asking for help to closenegative doorways\n&gt; and portals that they believe they opened usingtheir purchased\n&gt; Telephone to the Dead replica*. Others are claiming&gt; that I am a fraud\n&gt; because their purchased device doesn&#39;t producethe positive results I\n&gt; have been fortunate enough to have.&quot;So let&#39;s go throug this\n&gt; again:*nothing more than timed radio scans that have no validity.**a\n&gt; waste of money**very dangerous**the results could be\n&gt; devastating.**false communication devices**I have recently begun to\n&gt; receive requests from individuals asking forhelp to close negative\n&gt; doorways and portals that they believe theyopened using their\n&gt; purchased Telephone to the Dead replica.*As you see, there are two\n&gt; statements that Chris is making--so much forhe&#39;s always consistant,\n&gt; which I believe was an earlier statement thatyou made.1. The new boxes\n&gt; create accidental timed radio scans only.2. The new boxes are very\n&gt; dangerous because they draw negative results.I&#39;m not sure how the two\n&gt; statements can stand together, but in eithercase, his opinion is\n&gt; clearly not complimentary toward the rest of thebox users besides the\n&gt; four of the 30 he says, in the same post, &quot;havebeen identified.&quot;Rather\n&gt; cheeky and insulting and wrong, HMO. But if he just goes ondoing\n&gt; sessions like the one APSR recorded, I will continue to laud them.Ann\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; __________________________________________________________\n&gt; &gt; Connect and share in new ways with Windows Live.\n&gt; &gt;\n&gt; http://www.windowslive.com/connect.html? \n&gt; ocid=TXT_TAGLM_Wave2_newways_112007\n&gt; &gt;\n&gt;\n&gt;\n&gt;\n&gt; You keep typing, we keep giving. Download Messenger and join the  \n&gt; i’m Initiative now. Join in!\n&gt;\n&gt; \n\n\nYes, ha was exac ly wha I was a emp ing o do. I don' hink i wo ked, sadly.AnnOn Dec 3, 2007, a 2:26 PM, F ank Sump ion w o e: I hink i 's been spelled ou  so clea a blind man could ead i .  F ank-STo: EVP-ITC@yahoog oups.comF om: babia z3@yahoo.comDa e: Mon, 3 Dec 2007 19:14:28 +0000Subjec : [EVP-ITC] Re: I don' know abou ha !!Mo e in o abou wha ? How o s i he po ? --- In EVP-ITC@yahoog oups.com, F ank Sump ion ...> w o e:>> > Okay, okay. I admi i , jus ying o s i he po , bu I guess i boiled o e ! Bu i did ge me mo e in o. > > F ank-S> > > To: EVP-ITC@...: lisby@...: Mon, 3 Dec 2007 18:45:31 +0000Subjec :[EVP-ITC] Re: I don' know abou ha !!> > > > > --- In EVP-ITC@yahoog oups.com, \"babia z3\" w o e:>>Le 's no wis wo ds he e. Show me whe e Ch is has said you \"only\">ge alse communica ion o bad guys. > BTW I hough we we e ying oge he nega i i y behind us and mo e> on o cons uc i e discussion.Guess ha 's mo e o he wishy-washy> depends on wha my hai eelslike doing ways he e. om his own blog (clipped, bu no o he wiseal e ed):\"Wednesday, No embe 28, 2007The Box has hi he an!Cu en mood: dis essed\"I ha e ecen lybeen made awa e ha he e a e se e al eplica e sions o hisde ice being sold. I ha e also been old o ano he de ice ha canbe pu chased o e y li le om anyelec onics me chan andal e ed by hand, p oducing wha some conside o be esul s. As Iexpec ed, he samples ha people ha e sen me a e*no hing mo e han imed adio scans ha ha e no alidi y.* [emphasismine]\"These new \" adio scanne s\" a e no only *a was e o money* o people looking o do esea ch wi h hem in hopes o ha inge ec i ecommunica ion wi h he o he side, bu may in ac be * e ydange ous*.Should demonic and o he nega i e en i ies lea n o use hese alsede ices, * he esul s could be de as a ing.*\"...The Ca holicChu ch ... p edic ed he widesp ead sale o * alse communica ionde ices* as a back as las yea . *I ha e ecen lybegun o ecei e eques s om indi iduals asking o help o closenega i e doo waysand po als ha hey belie e hey opened using hei pu chasedTelephone o he Dead eplica*. O he s a e claiming> ha I am a audbecause hei pu chased de ice doesn' p oduce he posi i e esul s Iha e been o una e enough o ha e.\"So le 's go h oug hisagain:*no hing mo e han imed adio scans ha ha e no alidi y.**awas e o money** e y dange ous** he esul s could bede as a ing.** alse communica ion de ices**I ha e ecen ly begun o ecei e eques s om indi iduals asking o help o close nega i edoo ways and po als ha hey belie e heyopened using hei pu chased Telephone o he Dead eplica.*As you see, he e a e wos a emen s ha Ch is is making--so much o he's always consis an ,which I belie e was an ea lie s a emen ha you made.1. The new boxesc ea e acciden al imed adio scans only.2. The new boxes a e e ydange ous because hey d aw nega i e esul s.I'm no su e how he wos a emen s can s and oge he , bu in ei he case, his opinion isclea ly no complimen a y owa d he es o hebox use s besides he ou o he 30 he says, in he same pos , \"ha ebeen iden i ied.\"Ra he cheeky and insul ing and w ong, HMO. Bu i he jus goes ondoingsessions like he one APSR eco ded, I will con inue o laud hem.Ann > > > > > > > __________________________________________________________> Connec and sha e in new ways wi h Windows Li e.>h p://www.windowsli e.com/connec .h ml?ocid=TXT_TAGLM_Wa e2_newways_112007>You keep yping, we keep gi ing. Download Messenge and join he i’m Ini ia i e now. Join in!"}