{"id": "3809", "subject": "Re: [EVP-ITC] Re: Idle threats from a coward", "author": "Lisby", "timestamp": "2007-12-04T00:07:25Z", "full_text": "When do you get yours, Lance?\n\nMine is ETA 3rd week in January.\n\nI swear to god, I feel like I&#39;m adopting a child or something....\n\nAnn\n\n\nOn Dec 3, 2007, at 2:29 PM, Lance Oliver wrote:\n\n&gt; Good stuff!\n&gt;\n&gt; I&#39;ve likewise been engaged in pre-Box encouragement. For instance, I\n&gt; know I&#39;m not the only one that has ideas come to them while taking a\n&gt; shower. Sunday afternoon, while so occupied, a notion came strongly\n&gt; over me, which is just the awaited nudge I was waiting for before\n&gt; buying a MiniBox myself. I had an almost electrical feeling to\n&gt; utilize a MiniBox at a shamanic studies class my shaman teacher\n&gt; begun, and I facilitate now.\n&gt;\n&gt; You see he past away back in April and it&#39;s my impression he wishes\n&gt; for that group to try communicating with him! I&#39;ve got both eyes and\n&gt; ears open. I&#39;m also going to ask the right sort of questions to test\n&gt; whether or not is indeed the fellow.\n&gt;\n&gt; I&#39;m very hopefully but we shall see...\n&gt;\n&gt; Lance\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, Lisby &lt;lisby@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Congrats, Lance! :)\n&gt; &gt;\n&gt; &gt; I can&#39;t wait to start with mine.\n&gt; &gt;\n&gt; &gt; A few days ago I, as I was driving home alone, I turned on the\n&gt; tape\n&gt; &gt; recorder I carry for interviews. I played it back as I was still\n&gt; &gt; driving. During one part, I told them about the box and what I\n&gt; wanted\n&gt; &gt; them to do once I had it. I said, &quot;Talk to me, guys.&quot; Right\n&gt; afterward\n&gt; &gt; a male voice said, &quot;Talking.&quot; I was one big smile for an hour.\n&gt; &gt;\n&gt; &gt; Ann\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; On Dec 3, 2007, at 12:19 AM, Lance Oliver wrote:\n&gt; &gt;\n&gt; &gt; &gt; Well, I&#39;ve gone ahead and done it...\n&gt; &gt; &gt;\n&gt; &gt; &gt; I purchased one of Ron&#39;s MiniBox&#39;s!!\n&gt; &gt; &gt;\n&gt; &gt; &gt; No snowball will be safe in hell now!\n&gt; &gt; &gt;\n&gt; &gt; &gt; Tell you what, instead of asking Chris about life and death or\n&gt; heaven\n&gt; &gt; &gt; and hell, I plan to:\n&gt; &gt; &gt;\n&gt; &gt; &gt; 1)Take a training class provided freely by ASUP.\n&gt; &gt; &gt; 2)Engage in a little direct inquiry and testing of spirits.\n&gt; &gt; &gt; 3)Strongly encourage fearless people to find their own answers, by\n&gt; &gt; &gt; doing something likewise.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Thanks,\n&gt; &gt; &gt; Lance\n&gt; &gt; &gt;\n&gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;babiarz3&quot; &lt;babiarz3@&gt; wrote:\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Lance,\n&gt; &gt; &gt; &gt; I think you make my point very well. You say you don&#39;t know\n&gt; Chris\n&gt; &gt; &gt; &gt; personally but that it seems I am the one wearing rose colored\n&gt; &gt; &gt; &gt; glasses. I do know Chris. Even when Frank is upset he\n&gt; says &quot;Chris\n&gt; &gt; &gt; is a\n&gt; &gt; &gt; &gt; nice guy&quot;. Chris&#39; statements and beliefs have never changed\n&gt; while\n&gt; &gt; &gt; &gt; others can be wishy washy depending on the day. The view that\n&gt; Chris\n&gt; &gt; &gt; &gt; does not want any one to research the box besides him is BS. The\n&gt; &gt; &gt; fact\n&gt; &gt; &gt; &gt; is that prior to Franks original yahoo group disappearing, Chris\n&gt; &gt; &gt; &gt; provided a link directly to the schematics. In his\n&gt; presentations he\n&gt; &gt; &gt; &gt; would tell people that the schematics were available online.\n&gt; Yet,\n&gt; &gt; &gt; &gt; because he is against mass production, it MUST be because he\n&gt; wants\n&gt; &gt; &gt; the\n&gt; &gt; &gt; &gt; research all to himself. Rose colored glasses or a case of only\n&gt; &gt; &gt; seeing\n&gt; &gt; &gt; &gt; what is wanted? This is a fact compared to perceptions and\n&gt; &gt; &gt; opinions.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Fact: Almost each and every user of a box or it&#39;s facsimile have\n&gt; &gt; &gt; &gt; stated that lower energy/evil/dark... entities have spoken via\n&gt; the\n&gt; &gt; &gt; &gt; device.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Fact: Rick Moran states that the groups for testing will include\n&gt; &gt; &gt; &gt; believers, skeptics, senior citizens, (now here&#39;s where it gets\n&gt; &gt; &gt; scary)\n&gt; &gt; &gt; &gt; CHILDREN and HIGH SCHOOL STUDENTS!\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; - Couple the last two facts together and do the math. One\n&gt; mentally\n&gt; &gt; &gt; &gt; unstable child or youth hears the box tell him it is right to\n&gt; kill\n&gt; &gt; &gt; or\n&gt; &gt; &gt; &gt; rape or .....\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Fact: Rick Moran in his article about Tools being only as good\n&gt; as\n&gt; &gt; &gt; the\n&gt; &gt; &gt; &gt; users states, &quot;...know how they work before you go into the\n&gt; field.&quot;\n&gt; &gt; &gt; &gt; So, in one place we are still testing, in another we are sending\n&gt; &gt; &gt; them\n&gt; &gt; &gt; &gt; out in the field to be tested by groups that include children\n&gt; and\n&gt; &gt; &gt; high\n&gt; &gt; &gt; &gt; school students. The good thing is that a nice little online\n&gt; &gt; &gt; tutorial\n&gt; &gt; &gt; &gt; is available with some warnings. Phew! As long as this can&#39;t\n&gt; come\n&gt; &gt; &gt; back\n&gt; &gt; &gt; &gt; on anyone I guess all the bases are covered (tongue in cheek).\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Fact: Chris has been the primary tester of the device in the\n&gt; field.\n&gt; &gt; &gt; &gt; That fact deserves consideration, at the very least.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Fact: Last night, a radio personality on Spooky South Coast\n&gt; claimed\n&gt; &gt; &gt; &gt; that after he engaged the dark voices coming through the box,\n&gt; he was\n&gt; &gt; &gt; &gt; physically attacked.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Fact: Frank has stated that in the beginning Chris was the only\n&gt; one\n&gt; &gt; &gt; &gt; who understood how the box should be used.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Fact: Some people who have received boxes from Frank discovered\n&gt; they\n&gt; &gt; &gt; &gt; were not able to use them although they worked fine for Frank.\n&gt; These\n&gt; &gt; &gt; &gt; same people would not return the boxes to be looked at.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Fact: After death communications have been received via both\n&gt; &gt; &gt; computers\n&gt; &gt; &gt; &gt; and phones. If it were simply the devices and not the users\n&gt; would we\n&gt; &gt; &gt; &gt; not have millions of these communications?\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Fact: Mark Macy states that in an after death communication\n&gt; &gt; &gt; &gt; communication with Konstanin Raudive in which Mark asks &quot; Can\n&gt; you\n&gt; &gt; &gt; tell\n&gt; &gt; &gt; &gt; me about the equipment you use to produce a perfect, almost\n&gt; perfect\n&gt; &gt; &gt; &gt; voice on earth?&quot; Konstanin replies &quot;Well it depends on your\n&gt; &gt; &gt; reception-\n&gt; &gt; &gt; &gt; or mainly your psychic reception.&quot; This fact backs up the theory\n&gt; &gt; &gt; that\n&gt; &gt; &gt; &gt; effective users are limited.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Fact: In another after death communication Konstanin addresses\n&gt; &gt; &gt; contact\n&gt; &gt; &gt; &gt; fields saying &quot;...but if there is dissonance in the form of\n&gt; fears,\n&gt; &gt; &gt; &gt; doubts, and animosities the contact field becomes\n&gt; cloudy...that&#39;s\n&gt; &gt; &gt; when\n&gt; &gt; &gt; &gt; negative spirit groups close to earth in vibration can break\n&gt; into\n&gt; &gt; &gt; &gt; existing bridges with troubling results.&quot;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; And so yes, maybe I wear rose colored glasses. However, I am\n&gt; &gt; &gt; inclined\n&gt; &gt; &gt; &gt; to believe that I have done my research and have availed myself\n&gt; of\n&gt; &gt; &gt; &gt; quite a bit of information regarding this topic.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; With that said, I am holding an online event where people can\n&gt; ask\n&gt; &gt; &gt; &gt; Chris the questions they want as long as they are formed in an\n&gt; &gt; &gt; &gt; intelligent manner. If you are interested in attending the\n&gt; event you\n&gt; &gt; &gt; &gt; can find the information on the front page of my site at\n&gt; &gt; &gt; &gt; www.thepsinetwork.com I felt it unnecessary to attempt\n&gt; to &quot;bridge\n&gt; &gt; &gt; the\n&gt; &gt; &gt; &gt; gap&quot; as well between speculation, insinuation and fact.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Sincerely,\n&gt; &gt; &gt; &gt; Babs\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;Lance Oliver&quot; &lt;orbhunterx@&gt;\n&gt; wrote:\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; Hey Bab,\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; Even though I&#39;ve newly begun to chime in here, it seems to me\n&gt; &gt; &gt; that\n&gt; &gt; &gt; &gt; &gt; some people are guilty of wearing rose colored glasses, as\n&gt; far as\n&gt; &gt; &gt; &gt; &gt; Chris is concerned. LOL! I don&#39;t know him personally, so I\n&gt; really\n&gt; &gt; &gt; &gt; &gt; don&#39;t know what really motivates him. Right or wrong, by\n&gt; &gt; &gt; conducting\n&gt; &gt; &gt; &gt; &gt; himself in the manner he has, it&#39;s understandable why his\n&gt; &gt; &gt; approach\n&gt; &gt; &gt; &gt; &gt; has drawn the scrutiny from his peers.\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; Frankly, this entire effort is a great learning experience and\n&gt; &gt; &gt; &gt; &gt; potential healing for mankind! I encourage all of us\n&gt; researcher\n&gt; &gt; &gt; types\n&gt; &gt; &gt; &gt; &gt; to simply sit back, and take a deep breath or three. Consider\n&gt; &gt; &gt; &gt; &gt; together why we&#39;re doing this. Let&#39;s work on making this\n&gt; world a\n&gt; &gt; &gt; &gt; &gt; better place while we have breath...\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; Success!\n&gt; &gt; &gt; &gt; &gt; Lance\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;babiarz3&quot; &lt;babiarz3@&gt; wrote:\n&gt; &gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; &gt; Bruce- Wow! That is a very bold statement, minus the name\n&gt; of the\n&gt; &gt; &gt; &gt; &gt; &gt; person you are accusing (although it&#39;s clear who you are\n&gt; &gt; &gt; referring\n&gt; &gt; &gt; &gt; &gt; to).\n&gt; &gt; &gt; &gt; &gt; &gt; I did read your apology for the negativity you&#39;ve helped\n&gt; spread\n&gt; &gt; &gt; &gt; &gt; about\n&gt; &gt; &gt; &gt; &gt; &gt; Christopher Moon. I acknowledge that your apology took a\n&gt; great\n&gt; &gt; &gt; deal\n&gt; &gt; &gt; &gt; &gt; of\n&gt; &gt; &gt; &gt; &gt; &gt; humility. However, knee jerk reactions are exactly what I&#39;ve\n&gt; &gt; &gt; been\n&gt; &gt; &gt; &gt; &gt; &gt; talking about. People doing or saying without thought and\n&gt; &gt; &gt; &gt; &gt; consideration.\n&gt; &gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;bhali333&quot;\n&gt; &gt; &gt; &gt; &gt; &gt; &lt;paranormalinvestigating@&gt; wrote:\n&gt; &gt; &gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; &gt; &gt; I think someone that stands to loose there bread and\n&gt; butter\n&gt; &gt; &gt; is\n&gt; &gt; &gt; &gt; &gt; making\n&gt; &gt; &gt; &gt; &gt; &gt; &gt; idle threats or having someone else do it. I would like to\n&gt; &gt; &gt; state\n&gt; &gt; &gt; &gt; &gt; for\n&gt; &gt; &gt; &gt; &gt; &gt; &gt; the record. SEND ME SOME DEATH THREATS YOU COWARD OR\n&gt; BETTER\n&gt; &gt; &gt; YET\n&gt; &gt; &gt; &gt; &gt; LETS\n&gt; &gt; &gt; &gt; &gt; &gt; &gt; SET UP A MEETING AND WE WILL SEE WHO IS LEFT FACE DOWN.\n&gt; &gt; &gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; &gt; &gt; Who ever you are you better hope I never find out, it&#39;s a\n&gt; &gt; &gt; bitch\n&gt; &gt; &gt; &gt; &gt; when\n&gt; &gt; &gt; &gt; &gt; &gt; &gt; the hunter becomes the hunted!\n&gt; &gt; &gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; &gt; &gt; If you got the balls contact me!\n&gt; &gt; &gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; &gt; &gt; Sum don&#39;t worry anyone that talks about doing something\n&gt; does\n&gt; &gt; &gt; only\n&gt; &gt; &gt; &gt; &gt; that\n&gt; &gt; &gt; &gt; &gt; &gt; &gt; TALK!\n&gt; &gt; &gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; &gt; &gt; Bruce\n&gt; &gt; &gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;\n&gt; \n\n\nWhen do you ge you s, Lance?Mine is ETA 3 d week in Janua y.I swea o god, I eel like I'm adop ing a child o some hing....AnnOn Dec 3, 2007, a 2:29 PM, Lance Oli e w o e:Good s u !I' e likewise been engaged in p e-Box encou agemen . Fo ins ance, I know I'm no he only one ha has ideas come o hem while aking a showe . Sunday a e noon, while so occupied, a no ion came s ongly o e me, which is jus he awai ed nudge I was wai ing o be o e buying a MiniBox mysel . I had an almos elec ical eeling o u ilize a MiniBox a a shamanic s udies class my shaman eache  begun, and I acili a e now. You see he pas away back in Ap il and i 's my imp ession he wishes  o ha g oup o y communica ing wi h him! I' e go bo h eyes and ea s open. I'm also going o ask he igh so o ques ions o es  whe he o no is indeed he ellow. I'm e y hope ully bu we shall see...Lance--- In EVP-ITC@yahoog oups.com, Lisby w o e:>> Cong a s, Lance! :)> > I can' wai o s a wi h mine.> > A ew days ago I, as I was d i ing home alone, I u ned on he  ape > eco de I ca y o in e iews. I played i back as I was s ill > d i ing. Du ing one pa , I old hem abou he box and wha I wan ed > hem o do once I had i . I said, \"Talk o me, guys.\" Righ  a e wa d > a male oice said, \"Talking.\" I was one big smile o an hou .> > Ann> > > On Dec 3, 2007, a 12:19 AM, Lance Oli e w o e:> > > Well, I' e gone ahead and done i ...> >> > I pu chased one o Ron's MiniBox's!!> >> > No snowball will be sa e in hell now!> >> > Tell you wha , ins ead o asking Ch is abou li e and dea h o  hea en> > and hell, I plan o:> >> > 1)Take a aining class p o ided eely by ASUP.> > 2)Engage in a li le di ec inqui y and es ing o spi i s.> > 3)S ongly encou age ea less people o ind hei own answe s, by> > doing some hing likewise.> >> > Thanks,> > Lance> >> > --- In EVP-ITC@yahoog oups.com, \"babia z3\" w o e:> > >> > > Lance,> > > I hink you make my poin e y well. You say you don' know Ch is> > > pe sonally bu ha i seems I am he one wea ing ose colo ed> > > glasses. I do know Ch is. E en when F ank is upse he says \"Ch is> > is a> > > nice guy\". Ch is' s a emen s and belie s ha e ne e changed while> > > o he s can be wishy washy depending on he day. The iew ha  Ch is> > > does no wan any one o esea ch he box besides him is BS. The> > ac > > > is ha p io o F anks o iginal yahoo g oup disappea ing, Ch is> > > p o ided a link di ec ly o he schema ics. In his p esen a ions he> > > would ell people ha he schema ics we e a ailable online. Ye ,> > > because he is agains mass p oduc ion, i MUST be because he wan s> > he> > > esea ch all o himsel . Rose colo ed glasses o a case o only> > seeing> > > wha is wan ed? This is a ac compa ed o pe cep ions and> > opinions.> > >> > > Fac : Almos each and e e y use o a box o i 's acsimile ha e> > > s a ed ha lowe ene gy/e il/da k... en i ies ha e spoken ia  he> > > de ice.> > >> > > Fac : Rick Mo an s a es ha he g oups o es ing will include> > > belie e s, skep ics, senio ci izens, (now he e's whe e i ge s> > sca y)> > > CHILDREN and HIGH SCHOOL STUDENTS!> > >> > > - Couple he las wo ac s oge he and do he ma h. One men ally> > > uns able child o you h hea s he box ell him i is igh o kill> > o > > > ape o .....> > >> > > Fac : Rick Mo an in his a icle abou Tools being only as good as> > he> > > use s s a es, \"...know how hey wo k be o e you go in o he  ield.\"> > > So, in one place we a e s ill es ing, in ano he we a e sending> > hem> > > ou in he ield o be es ed by g oups ha include child en and> > high> > > school s uden s. The good hing is ha a nice li le online> > u o ial> > > is a ailable wi h some wa nings. Phew! As long as his can'  come> > back> > > on anyone I guess all he bases a e co e ed ( ongue in cheek).> > >> > > Fac : Ch is has been he p ima y es e o he de ice in he  ield.> > > Tha ac dese es conside a ion, a he e y leas .> > >> > > Fac : Las nigh , a adio pe sonali y on Spooky Sou h Coas  claimed> > > ha a e he engaged he da k oices coming h ough he box, he was> > > physically a acked.> > >> > > Fac : F ank has s a ed ha in he beginning Ch is was he only one> > > who unde s ood how he box should be used.> > >> > > Fac : Some people who ha e ecei ed boxes om F ank disco e ed  hey> > > we e no able o use hem al hough hey wo ked ine o F ank. These> > > same people would no e u n he boxes o be looked a .> > >> > > Fac : A e dea h communica ions ha e been ecei ed ia bo h> > compu e s> > > and phones. I i we e simply he de ices and no he use s would we> > > no ha e millions o hese communica ions?> > >> > > Fac : Ma k Macy s a es ha in an a e dea h communica ion> > > communica ion wi h Kons anin Raudi e in which Ma k asks \" Can you> > ell> > > me abou he equipmen you use o p oduce a pe ec , almos  pe ec > > > oice on ea h?\" Kons anin eplies \"Well i depends on you > > ecep ion-> > > o mainly you psychic ecep ion.\" This ac backs up he heo y> > ha > > > e ec i e use s a e limi ed.> > >> > > Fac : In ano he a e dea h communica ion Kons anin add esses> > con ac > > > ields saying \"...bu i he e is dissonance in he o m o   ea s,> > > doub s, and animosi ies he con ac ield becomes cloudy... ha 's> > when> > > nega i e spi i g oups close o ea h in ib a ion can b eak in o> > > exis ing b idges wi h oubling esul s.\"> > >> > >> > > And so yes, maybe I wea ose colo ed glasses. Howe e , I am> > inclined> > > o belie e ha I ha e done my esea ch and ha e a ailed mysel  o > > > qui e a bi o in o ma ion ega ding his opic.> > >> > > Wi h ha said, I am holding an online e en whe e people can ask> > > Ch is he ques ions hey wan as long as hey a e o med in an> > > in elligen manne . I you a e in e es ed in a ending he e en you> > > can ind he in o ma ion on he on page o my si e a > > > www. hepsine wo k.com I el i unnecessa y o a emp   o \"b idge> > he> > > gap\" as well be ween specula ion, insinua ion and ac .> > >> > > Since ely,> > > Babs> > >> > >> > > --- In EVP-ITC@yahoog oups.com, \"Lance Oli e \" > w o e:> > > >> > > > Hey Bab,> > > >> > > > E en hough I' e newly begun o chime in he e, i seems o me> > ha > > > > some people a e guil y o wea ing ose colo ed glasses, as  a as> > > > Ch is is conce ned. LOL! I don' know him pe sonally, so I  eally> > > > don' know wha eally mo i a es him. Righ o w ong, by> > conduc ing> > > > himsel in he manne he has, i 's unde s andable why his> > app oach> > > > has d awn he sc u iny om his pee s.> > > >> > > > F ankly, his en i e e o is a g ea lea ning expe ience and> > > > po en ial healing o mankind! I encou age all o us  esea che > > ypes> > > > o simply si back, and ake a deep b ea h o h ee. Conside > > > > oge he why we' e doing his. Le 's wo k on making his wo ld a> > > > be e place while we ha e b ea h...> > > >> > > > Success!> > > > Lance> > > >> > > > --- In EVP-ITC@yahoog oups.com, \"babia z3\" w o e:> > > > >> > > > > B uce- Wow! Tha is a e y bold s a emen , minus he name o he> > > > > pe son you a e accusing (al hough i 's clea who you a e> > e e ing> > > > o).> > > > > I did ead you apology o he nega i i y you' e helped sp ead> > > > abou > > > > > Ch is ophe Moon. I acknowledge ha you apology ook a g ea > > deal> > > > o > > > > > humili y. Howe e , knee je k eac ions a e exac ly wha I' e> > been> > > > > alking abou . People doing o saying wi hou hough and> > > > conside a ion.> > > > >> > > > > --- In EVP-ITC@yahoog oups.com, \"bhali333\"> > > > > a ing@> w o e:> > > > > >> > > > > > I hink someone ha s ands o loose he e b ead and bu e > > is> > > > making> > > > > > idle h ea s o ha ing someone else do i . I would like o> > s a e> > > > o > > > > > > he eco d. SEND ME SOME DEATH THREATS YOU COWARD OR BETTER> > YET> > > > LETS> > > > > > SET UP A MEETING AND WE WILL SEE WHO IS LEFT FACE DOWN.> > > > > >> > > > > > Who e e you a e you be e hope I ne e ind ou , i 's a> > bi ch> > > > when> > > > > > he hun e becomes he hun ed!> > > > > >> > > > > > I you go he balls con ac me!> > > > > >> > > > > > Sum don' wo y anyone ha alks abou doing some hing does> > only> > > > ha > > > > > > TALK!> > > > > >> > > > > > B uce> > > > > >> > > > >> > > >> > >> >> >> >>"}