{"id": "3813", "subject": "Re: [EVP-ITC] Re: Maybe there is only one box user allowed!?", "author": "Lisby", "timestamp": "2007-12-04T00:34:04Z", "full_text": "Frank--I don&#39;t think you should do that. I think you need to address  \nthis with him face to face. We don&#39;t need this turn into exactly what  \nI jokeingly proposed it might become a month ago: The Tesla Gang v.  \nthe Edison Gang. (That&#39;s kind of unappealingly like The Narwhals v.  \nThe Unicorns, isn&#39;t it?)\n\nMeet with him, be calm, and ask him to explain himself. Debate  \nlogically until you reach an understanding. You need to do this and  \nso does he.\n\nAnn\n\n\nOn Dec 3, 2007, at 5:41 PM, Frank Sumption wrote:\n\n&gt;  I already backed out of the meeting,  after re-reading what was on  \n&gt; the blog.\n&gt;\n&gt;  Frank-S\n&gt;\n&gt;\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; From: orbhunterx@...\n&gt; Date: Mon, 3 Dec 2007 21:08:28 +0000\n&gt; Subject: [EVP-ITC] Re: Maybe there is only one box user allowed!?\n&gt;\n&gt; I don&#39;t think it&#39;s wise to go unarmed. LOL!\n&gt;\n&gt; At least mentally.\n&gt;\n&gt; Lance\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@...&gt;\n&gt; wrote:\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; That&#39;s the point, Moon seemingly gets valid stuff, at least\n&gt; sometimes, but to say, and imply he is the only one allowed, in my\n&gt; eyes, pretty much negates everything else and pisses me off.\n&gt; &gt;\n&gt; &gt; I should have let this go, but I didn&#39;t want to meet woht Mr Moon\n&gt; completely unarmed.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Frank\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; __________________________________________________________\n&gt; &gt; Connect and share in new ways with Windows Live.\n&gt; &gt; http://www.windowslive.com/connect.html?\n&gt; ocid=TXT_TAGLM_Wave2_newways_112007\n&gt; &gt;\n&gt;\n&gt;\n&gt;\n&gt; Your smile counts. The more smiles you share, the more we donate.  \n&gt; Join in!\n&gt;\n&gt; \n\n\nF ank--I don' hink you should do ha . I hink you need o add ess his wi h him ace o ace. We don' need his u n in o exac ly wha I jokeingly p oposed i migh become a mon h ago: The Tesla Gang . he Edison Gang. (Tha 's kind o unappealingly like The Na whals . The Unico ns, isn' i ?)Mee wi h him, be calm, and ask him o explain himsel . Deba e logically un il you each an unde s anding. You need o do his and so does he.AnnOn Dec 3, 2007, a 5:41 PM, F ank Sump ion w o e: I al eady backed ou o he mee ing,  a e e- eading wha was on he blog.   F ank-STo: EVP-ITC@yahoog oups.comF om: o bhun e x@yahoo.comDa e: Mon, 3 Dec 2007 21:08:28 +0000Subjec : [EVP-ITC] Re: Maybe he e is only one box use allowed!?I don' hink i 's wise o go una med. LOL! A leas men ally.Lance--- In EVP-ITC@yahoog oups.com, F ank Sump ion ...> w o e:>> > Tha 's he poin , Moon seemingly ge s alid s u , a leas  some imes, bu o say, and imply he is he only one allowed, in my eyes, p e y much nega es e e y hing else and pisses me o . > > I should ha e le his go, bu I didn' wan o mee woh M Moon comple ely una med. > > > F ank> > > > > > > > > __________________________________________________________> Connec and sha e in new ways wi h Windows Li e.> h p://www.windowsli e.com/connec .h ml?ocid=TXT_TAGLM_Wa e2_newways_112007>You smile coun s. The mo e smiles you sha e, he mo e we dona e. Join in!"}