{"id": "3816", "subject": "Re: Maybe there is only one box user allowed!?", "author": "judy_in_hollywood", "timestamp": "2007-12-04T01:47:53Z", "full_text": "--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@...&gt; wrote:\n&gt;\n&gt; \n&gt; This &#39;negativity&#39; is bad enough, I wouldn&#39;t even want it on the group except Moon is the one that says everyone else,  me and the group included, gets only &#39;false communcation&#39; or &#39;bad guys&#39;, and that&#39;s from his own friggin&#39; blog, I didn&#39;t make that up, or pull it out of my butt. So it effects us all, and I think is open for discussion/comment knowing this will get forwarded back to him. In fact I&#39;ll cc Moon this posting.   When he says all these scan radio users, that means me to, since I use the things, and I prefer the linear scan mode. What I say about the box use is completely disregarded, and what I get through the box, myself, as The Box Maker, is minimalized by Moon. Moon puts my name out there connected with his so called &#39;telephone to the dead&#39;, and I very much disapprove of my name being applied to an unauthorized use of my equipment. I don&#39;t give a crap what he gets through the boxes, or does with it, but don&#39;t make it look like I designed it specificaly as the &#39;telephone to the dead&#39;, I designed it as a friggin&#39; ITC device, that is capable of two way communication--SOMETIMES, it&#39;s not like it&#39;s a guarenteed connection, and you can&#39;t just dial up anyone, anytime, that&#39;s an exageration! The &quot;box&quot; was intended by me to be used in a fixed location, just by taking it to a GHU, or an &quot;investiigation&quot; is using it in a way I did not intend, and I still say it&#39;s better if used in one place. All guide lines I have offered for box use are completely ignored, not just by Moon, to be fair.  \n&gt;  \n&gt;   It has been shown that many different approaches work for this communcation, I suggest Moon design and build his own &#39;telephone the dead&#39; and leave my name out of it. \n&gt;  \n&gt;    Frank-S\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Connect and share in new ways with Windows Live.\n&gt; http://www.windowslive.com/connect.html?ocid=TXT_TAGLM_Wave2_newways_112007\n&gt;\n = = = = = = = = = = = = = = = =   Hi Frank & All, I think Chris Moon might be afraid (fears/paranoia?) that you&#39;ll sue him, for using YOUR Frank&#39;s Box in an UNAUTHORIZED manner (by YOU the maker) of your box. At various locations, establishing businesses (of his making, now), promoting himself as the ONLY &quot;professional&quot; that knows how to use the box, and (worst yet) making False claims with the box (as he stated on his blog reposted here) to promote himself and your box that you gave him (IMHO = a big mistake) + now profiting from your invention and yet, putting YOU and all of us researchers down as getting false communications, opening up dark portals, dark entities, etc.! Frankly, I&#39;d sue his butt, as he&#39;s Highjacked the device for his own benifit (fame & fortune, kinda like selling one&#39;s soul to the Devil - for Money & Fame). Frank, You are getting nothing out of this except being Associated with Frank&#39;s Box, and even there, Chris is unauthorised by you, to rename it, &quot;The Telephone to the Dead&quot;, which is an inacurate discription of your box! Plus, he claims he&#39;s acting like a Medium connecting the living with their departed loved ones (what proof is there of this? I&#39;d love to hear from my Dad, but may have to wait a LONG time for that to happen)! I&#39;d contact a lawyer - for infringment rights to your device (unauthorised use), on a contingency basis (pay if you win the lawsuit, from the winnings). Plus, you could get your boxes, Sony cassette recorder, and Tarot CD back, as well as put him outta business, before he does more damage!  =Judy=    P.S. He may know you well enought to know you&#39;ll never sue him, too (and thus get away with it)!  8-("}