{"id": "3818", "subject": "Re: Maybe there is only one box user allowed!?", "author": "judy_in_hollywood", "timestamp": "2007-12-04T01:56:28Z", "full_text": "--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@...&gt; wrote:\n&gt;\n&gt; \n&gt; This &#39;negativity&#39; is bad enough, I wouldn&#39;t even want it on the group except Moon is the one that says everyone else,  me and the group included, gets only &#39;false communcation&#39; or &#39;bad guys&#39;, and that&#39;s from his own friggin&#39; blog, I didn&#39;t make that up, or pull it out of my butt. So it effects us all, and I think is open for discussion/comment knowing this will get forwarded back to him. In fact I&#39;ll cc Moon this posting.   When he says all these scan radio users, that means me to, since I use the things, and I prefer the linear scan mode. What I say about the box use is completely disregarded, and what I get through the box, myself, as The Box Maker, is minimalized by Moon. Moon puts my name out there connected with his so called &#39;telephone to the dead&#39;, and I very much disapprove of my name being applied to an unauthorized use of my equipment. I don&#39;t give a crap what he gets through the boxes, or does with it, but don&#39;t make it look like I designed it specificaly as the &#39;telephone to the dead&#39;, I designed it as a friggin&#39; ITC device, that is capable of two way communication--SOMETIMES, it&#39;s not like it&#39;s a guarenteed connection, and you can&#39;t just dial up anyone, anytime, that&#39;s an exageration! The &quot;box&quot; was intended by me to be used in a fixed location, just by taking it to a GHU, or an &quot;investiigation&quot; is using it in a way I did not intend, and I still say it&#39;s better if used in one place. All guide lines I have offered for box use are completely ignored, not just by Moon, to be fair.  \n&gt;  \n&gt;   It has been shown that many different approaches work for this communcation, I suggest Moon design and build his own &#39;telephone the dead&#39; and leave my name out of it. \n&gt;  \n&gt;    Frank-S\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Connect and share in new ways with Windows Live.\n&gt; http://www.windowslive.com/connect.html?ocid=TXT_TAGLM_Wave2_newways_112007\n&gt;\n = = = = = = = = = = = = = = = =   Hi Frank & All, My question is: How does Chris Moon KNOW we all are getting &quot;False communications&quot; from &quot;dark entities&quot; or whatever he is claiming???! This is an insult (slap-in-the-face comment) and untrue = thus &quot;slander&quot;! IMHO I personally don&#39;t like it! I have been researching EVP&#39;s - on & off - since about 1968-1970, when I first heard about it! Longer than Chris has been alive! 8-(     =Judy="}