{"id": "3825", "subject": "Re: [EVP-ITC] Re: Maybe there is only one box user allowed!?", "author": "Lisby", "timestamp": "2007-12-04T02:18:02Z", "full_text": "I have to opine that we really have no idea yet whether that is all  \ntrue or not. Only time will tell and only the if a wide variety of  \nresearchers use the equipment under varying circumstances.\n\nAnn\n\nOn Dec 3, 2007, at 8:49 PM, bruce halliday wrote:\n\n&gt; Frank,\n&gt;\n&gt; After doing box research for a while now and having the opportunity  \n&gt; to work with several different\n&gt; types of boxes. I would have to agree the boxes are meant for and  \n&gt; work better as a stationary communication device\n&gt; sort of like a communication station that is consistently under the  \n&gt; same basic conditions. I have never taken my boxes out of my home\n&gt; or done a session out side of my home and I don&#39;t believe that  \n&gt; taking the box , any box not just yours to a remote allegedly  \n&gt; haunted location\n&gt; will not serve to enhance communication. And if anyone is really  \n&gt; concerned about summoning dark entities they have a much better chance\n&gt; of that communicating with a grounded and maybe disgruntled or  \n&gt; confused entity at a haunted location.\n&gt;\n&gt; so I agree with your assessment of box use 100%\n&gt;\n&gt; Bruce\n&gt;\n&gt;\n&gt;\n&gt; Bruce Halliday\n&gt; Paranormal Investigating Team\n&gt;\n&gt;\n&gt;\n&gt; To: evp-itc@yahoogroups.com; hauntedtimes@...\n&gt; From: franks-boxes@...\n&gt; Date: Mon, 3 Dec 2007 14:43:43 -0700\n&gt; Subject: RE: [EVP-ITC] Re: Maybe there is only one box user allowed!?\n&gt;\n&gt; This &#39;negativity&#39; is bad enough, I wouldn&#39;t even want it on the  \n&gt; group except Moon is the one that says everyone else,  me and the  \n&gt; group included, gets only &#39;false communcation&#39; or &#39;bad guys&#39;, and  \n&gt; that&#39;s from his own friggin&#39; blog, I didn&#39;t make that up, or pull  \n&gt; it out of my butt. So it effects us all, and I think is open for  \n&gt; discussion/comment knowing this will get forwarded back to him. In  \n&gt; fact I&#39;ll cc Moon this posting.\n&gt;\n&gt;  When he says all these scan radio users, that means me to, since I  \n&gt; use the things, and I prefer the linear scan mode. What I say about  \n&gt; the box use is completely disregarded, and what I get through the  \n&gt; box, myself, as The Box Maker, is minimalized by Moon. Moon puts my  \n&gt; name out there connected with his so called &#39;telephone to the  \n&gt; dead&#39;, and I very much disapprove of my name being applied to an  \n&gt; unauthorized use of my equipment. I don&#39;t give a crap what he gets  \n&gt; through the boxes, or does with it, but don&#39;t make it look like I  \n&gt; designed it specificaly as the &#39;telephone to the dead&#39;, I designed  \n&gt; it as a friggin&#39; ITC device, that is capable of two way  \n&gt; communication--SOMETIMES, it&#39;s not like it&#39;s a guarenteed  \n&gt; connection, and you can&#39;t just dial up anyone, anytime, that&#39;s an  \n&gt; exageration! The &quot;box&quot; was intended by me to be used in a fixed  \n&gt; location, just by taking it to a GHU, or an &quot;investiigation&quot; is  \n&gt; using it in a way I did not intend, and I still say it&#39;s better if  \n&gt; used in one place. All guide lines I have offered for box use are  \n&gt; completely ignored, not just by Moon, to be fair.\n&gt;\n&gt;\n&gt;  It has been shown that many different approaches work for this  \n&gt; communcation, I suggest Moon design and build his own &#39;telephone  \n&gt; the dead&#39; and leave my name out of it.\n&gt;\n&gt;\n&gt;  Frank-S\n&gt;\n&gt;\n&gt;\n&gt; Connect and share in new ways with Windows Live. Connect now!\n&gt;\n&gt;\n&gt;\n&gt; Your smile counts. The more smiles you share, the more we donate.  \n&gt; Join in!\n&gt;\n&gt; \n\n\nI ha e o opine ha we eally ha e no idea ye whe he ha is all ue o no . Only ime will ell and only he i a wide a ie y o esea che s use he equipmen unde a ying ci cums ances.AnnOn Dec 3, 2007, a 8:49 PM, b uce halliday w o e:F ank, A e doing box esea ch o a while now and ha ing he oppo uni y o wo k wi h se e al di e en ypes o boxes. I would ha e o ag ee he boxes a e mean o and wo k be e as a s a iona y communica ion de ice so o like a communica ion s a ion ha is consis en ly unde he same basic condi ions. I ha e ne e aken my boxes ou o my homeo done a session ou side o my home and I don' belie e ha aking he box , any box no jus you s o a emo e allegedly haun ed loca ionwill no se e o enhance communica ion. And i anyone is eally conce ned abou summoning da k en i ies hey ha e a much be e chanceo ha communica ing wi h a g ounded and maybe disg un led o con used en i y a a haun ed loca ion. so I ag ee wi h you assessmen o box use 100% B uceB uce Halliday Pa ano mal In es iga ing Team To: e p-i c@yahoog oups.com; haun ed imes@comcas .ne F om: anks-boxes@ho mail.comDa e: Mon, 3 Dec 2007 14:43:43 -0700Subjec : RE: [EVP-ITC] Re: Maybe he e is only one box use allowed!?This 'nega i i y' is bad enough, I wouldn' e en wan i on he g oup excep Moon is he one ha says e e yone else,  me and he g oup included, ge s only ' alse communca ion' o 'bad guys', and ha 's om his own iggin' blog, I didn' make ha up, o pull i ou o my bu . So i e ec s us all, and I hink is open o discussion/commen knowing his will ge o wa ded back o him. In ac I'll cc Moon his pos ing.   When he says all hese scan adio use s, ha means me o, since I use he hings, and I p e e he linea scan mode. Wha I say abou he box use is comple ely dis ega ded, and wha I ge h ough he box, mysel , as The Box Make , is minimalized by Moon. Moon pu s my name ou he e connec ed wi h his so called ' elephone o he dead', and I e y much disapp o e o my name being applied o an unau ho ized use o my equipmen . I don' gi e a c ap wha he ge s h ough he boxes, o does wi h i , bu don' make i look like I designed i speci icaly as he ' elephone o he dead', I designed i as a iggin' ITC de ice, ha is capable o wo way communica ion--SOMETIMES, i 's no like i 's a gua en eed connec ion, and you can' jus dial up anyone, any ime, ha 's an exage a ion! The \"box\" was in ended by me o be used in a ixed loca ion, jus by aking i o a GHU, o  an \"in es iiga ion\" is using i in a way I did no in end, and I s ill say i 's be e i used in one place. All guide lines I ha e o e ed o box use a e comple ely igno ed, no jus by Moon, o be ai .     I has been shown ha many di e en app oaches wo k o his communca ion, I sugges Moon design and build his own ' elephone he dead' and lea e my name ou o i .     F ank-SConnec and sha e in new ways wi h Windows Li e. Connec now!You smile coun s. The mo e smiles you sha e, he mo e we dona e. Join in!"}