{"id": "3827", "subject": "Re: Maybe there is only one box user allowed!?", "author": "judy_in_hollywood", "timestamp": "2007-12-04T02:34:32Z", "full_text": "--- In EVP-ITC@yahoogroups.com, Lisby &lt;lisby@...&gt; wrote:\n&gt;\n&gt; \n&gt; On Dec 3, 2007, at 8:47 PM, judy_in_hollywood wrote:\n&gt; \n&gt; &gt; ox! Plus, he claims he&#39;s acting like a Medium connecting the living  \n&gt; &gt; with their departed loved ones (what proof is there of this? I&#39;d  \n&gt; &gt; love to hear from my Dad, but may have to wait a LONG time for that  \n&gt; &gt; to happen)!\n&gt; &gt;\n&gt; \n&gt; Again, I&#39;ve got to speak up and say that I have heard his box, the  \n&gt; one Frank gave him, do exactly that. And why in the heck shouldn&#39;t  \n&gt; it? That is exactly what human mediums--myself included--can do.  \n&gt; Isn&#39;t the box just taking it to a potentially purer, higher, and more  \n&gt; stunning level?\n&gt; &gt; I&#39;d contact a lawyer - for infringment rights to your device  \n&gt; &gt; (unauthorised use), on a contingency basis (pay if you win the  \n&gt; &gt; lawsuit, from the winnings). Plus, you could get your boxes, Sony  \n&gt; &gt; cassette recorder, and Tarot CD back, as well as put him outta  \n&gt; &gt; business, before he does more damage! =Judy= P.S. He may know you  \n&gt; &gt; well enought to know you&#39;ll never sue him, too (and thus get away  \n&gt; &gt; with it)! 8-(\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; _\n&gt; \n&gt; You can&#39;t sue for use of non-patented technology that was a gift. It  \n&gt; would be very hard for Frank to prove otherwise.\n&gt; \n&gt; Ah, but what a hell of a civil trial it would be. There&#39;s one I&#39;d  \n&gt; love to cover as a reporter....\n&gt; \n&gt; Ann\n&gt;\n = = = = = = = = = = = = = = =     Hi All, What&#39;s to keep Chris from getting a Patent of his own on HIS &quot;Telephone to The Dead&quot;? Does Frank have his &quot;Franks Box&quot; Patented by the U.S. Patent Offices (the cost is low for this, BTW)???? I think it has merit thus far, for Frank to consider a Lawsuit! So what if it was a gift, Frank stated it was to be used in 1 place (statonary) & for testing purposes ONLY. What Chris has done with it, is Run with it making several businesses with it and making a profit from it . . . . this is NOT what Frank intended HIS Box(es) to be used as!   =Judy="}