{"id": "3831", "subject": "Re: Maybe there is only one box user allowed!?", "author": "Lance Oliver", "timestamp": "2007-12-04T03:41:44Z", "full_text": "I&#39;ll take that as a challange, Bruce!\n\nAfter proper burn in time, to attune the Box to me, I will go forth.\n\nI plan to take it to several places that I know spirits dwell. \n\nWe shall see through experimental questions what is what...\n\nLance\n\n--- In EVP-ITC@yahoogroups.com, bruce halliday \n&lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; Frank,\n&gt;  \n&gt; After doing box research for a while now and having the opportunity \nto work with several different\n&gt; types of boxes. I would have to agree the boxes are meant for and \nwork better as a stationary communication device \n&gt; sort of like a communication station that is consistently under the \nsame basic conditions. I have never taken my boxes out of my home\n&gt; or done a session out side of my home and I don&#39;t believe that \ntaking the box , any box not just yours to a remote allegedly haunted \nlocation\n&gt; will not serve to enhance communication. And if anyone is really \nconcerned about summoning dark entities they have a much better chance\n&gt; of that communicating with a grounded and maybe disgruntled or \nconfused entity at a haunted location.\n&gt;  \n&gt; so I agree with your assessment of box use 100%\n&gt;  \n&gt; Bruce\n&gt; \n&gt; Bruce Halliday Paranormal Investigating Team \n&gt; \n&gt; \n&gt; To: evp-itc@yahoogroups.com; hauntedtimes@...: franks-boxes@...: \nMon, 3 Dec 2007 14:43:43 -0700Subject: RE: [EVP-ITC] Re: Maybe there \nis only one box user allowed!?\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; This &#39;negativity&#39; is bad enough, I wouldn&#39;t even want it on the \ngroup except Moon is the one that says everyone else,  me and the \ngroup included, gets only &#39;false communcation&#39; or &#39;bad guys&#39;, and \nthat&#39;s from his own friggin&#39; blog, I didn&#39;t make that up, or pull it \nout of my butt. So it effects us all, and I think is open for \ndiscussion/comment knowing this will get forwarded back to him. In \nfact I&#39;ll cc Moon this posting.   When he says all these scan radio \nusers, that means me to, since I use the things, and I prefer the \nlinear scan mode. What I say about the box use is completely \ndisregarded, and what I get through the box, myself, as The Box \nMaker, is minimalized by Moon. Moon puts my name out there connected \nwith his so called &#39;telephone to the dead&#39;, and I very much \ndisapprove of my name being applied to an unauthorized use of my \nequipment. I don&#39;t give a crap what he gets through the boxes, or \ndoes with it, but don&#39;t make it look like I designed it specificaly \nas the &#39;telephone to the dead&#39;, I designed it as a friggin&#39; ITC \ndevice, that is capable of two way communication--SOMETIMES, it&#39;s not \nlike it&#39;s a guarenteed connection, and you can&#39;t just dial up anyone, \nanytime, that&#39;s an exageration! The &quot;box&quot; was intended by me to be \nused in a fixed location, just by taking it to a GHU, or \nan &quot;investiigation&quot; is using it in a way I did not intend, and I \nstill say it&#39;s better if used in one place. All guide lines I have \noffered for box use are completely ignored, not just by Moon, to be \nfair.     It has been shown that many different approaches work for \nthis communcation, I suggest Moon design and build his own &#39;telephone \nthe dead&#39; and leave my name out of it.     Frank-S\n&gt; \n&gt; \n&gt; Connect and share in new ways with Windows Live. Connect now! \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Your smile counts. The more smiles you share, the more we donate. \nJoin in.\n&gt; www.windowslive.com/smile?ocid=TXT_TAGLM_Wave2_oprsmilewlhmtagline\n&gt;"}