{"id": "3832", "subject": "Re: Maybe there is only one box user allowed!?", "author": "Lance Oliver", "timestamp": "2007-12-04T03:43:52Z", "full_text": "Hi Judy,\n\nI&#39;m with you. \n\nLance\n\n--- In EVP-ITC@yahoogroups.com, &quot;judy_in_hollywood&quot; \n&lt;Ticket_to_Heaven@...&gt; wrote:\n&gt;\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;judy_in_hollywood&quot; \n&lt;Ticket_to_Heaven@&gt; wrote:\n&gt; &gt;\n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@&gt; \nwrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; \n&gt; &gt; &gt; This &#39;negativity&#39; is bad enough, I wouldn&#39;t even want it on the \ngroup except Moon is the one that says everyone else,  me and the \ngroup included, gets only &#39;false communcation&#39; or &#39;bad guys&#39;, and \nthat&#39;s from his own friggin&#39; blog, I didn&#39;t make that up, or pull it \nout of my butt. So it effects us all, and I think is open for \ndiscussion/comment knowing this will get forwarded back to him. In \nfact I&#39;ll cc Moon this posting.   When he says all these scan radio \nusers, that means me to, since I use the things, and I prefer the \nlinear scan mode. What I say about the box use is completely \ndisregarded, and what I get through the box, myself, as The Box \nMaker, is minimalized by Moon. Moon puts my name out there connected \nwith his so called &#39;telephone to the dead&#39;, and I very much \ndisapprove of my name being applied to an unauthorized use of my \nequipment. I don&#39;t give a crap what he gets through the boxes, or \ndoes with it, but don&#39;t make it look like I designed it specificaly \nas the &#39;telephone to the dead&#39;, I designed it as a friggin&#39; ITC \ndevice, that is capable of two way communication--SOMETIMES, it&#39;s not \nlike it&#39;s a guarenteed connection, and you can&#39;t just dial up anyone, \nanytime, that&#39;s an exageration! The &quot;box&quot; was intended by me to be \nused in a fixed location, just by taking it to a GHU, or \nan &quot;investiigation&quot; is using it in a way I did not intend, and I \nstill say it&#39;s better if used in one place. All guide lines I have \noffered for box use are completely ignored, not just by Moon, to be \nfair.  \n&gt; &gt; &gt;  \n&gt; &gt; &gt;   It has been shown that many different approaches work for \nthis communcation, I suggest Moon design and build his own &#39;telephone \nthe dead&#39; and leave my name out of it. \n&gt; &gt; &gt;  \n&gt; &gt; &gt;    Frank-S\n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n_________________________________________________________________\n&gt; &gt; &gt; Connect and share in new ways with Windows Live.\n&gt; &gt; &gt; http://www.windowslive.com/connect.html?\nocid=TXT_TAGLM_Wave2_newways_112007\n&gt; &gt; &gt;\n&gt; &gt;  = = = = = = = = = = = = = = = =   Hi Frank & All, My question \nis: How does Chris Moon KNOW we all are getting &quot;False \ncommunications&quot; from &quot;dark entities&quot; or whatever he is claiming???! \nThis is an insult (slap-in-the-face comment) and untrue = \nthus &quot;slander&quot;! IMHO I personally don&#39;t like it! I have been \nresearching EVP&#39;s - on & off - since about 1968-1970, when I first \nheard about it! Longer than Chris has been alive! 8-(     =Judy=\n&gt; &gt;\n&gt;    P.S. It seems to me he&#39;s &quot;exploiting&quot; the box & you without your \nauthorizations on it, he has NO rights or authority to even call \nhimself the ONLY &quot;professional&quot; to work the box(es) . . . that&#39;s for \nyou Frank!\n&gt;"}