{"id": "3839", "subject": "Re: Maybe there is only one box user allowed!?", "author": "Lance Oliver", "timestamp": "2007-12-04T05:49:17Z", "full_text": "Exactamundo, Ann! \n\nNothings stopping us that are activily involved investigating haunted \nlocations. Where EVP has to an extent proven a haunting, going back \nto the location to use a Box is worth a college try. I can hardly \nwait... \n\nIf it does work, helping earth bound spirits to discuss their \npredicament, and eventually crossover, would be a win win win \nsituation!\n\nLance \n\n\n\n--- In EVP-ITC@yahoogroups.com, Lisby &lt;lisby@...&gt; wrote:\n&gt;\n&gt; I have to opine that we really have no idea yet whether that is \nall  \n&gt; true or not. Only time will tell and only the if a wide variety of  \n&gt; researchers use the equipment under varying circumstances.\n&gt; \n&gt; Ann\n&gt; \n&gt; On Dec 3, 2007, at 8:49 PM, bruce halliday wrote:\n&gt; \n&gt; &gt; Frank,\n&gt; &gt;\n&gt; &gt; After doing box research for a while now and having the \nopportunity  \n&gt; &gt; to work with several different\n&gt; &gt; types of boxes. I would have to agree the boxes are meant for \nand  \n&gt; &gt; work better as a stationary communication device\n&gt; &gt; sort of like a communication station that is consistently under \nthe  \n&gt; &gt; same basic conditions. I have never taken my boxes out of my home\n&gt; &gt; or done a session out side of my home and I don&#39;t believe that  \n&gt; &gt; taking the box , any box not just yours to a remote allegedly  \n&gt; &gt; haunted location\n&gt; &gt; will not serve to enhance communication. And if anyone is really  \n&gt; &gt; concerned about summoning dark entities they have a much better \nchance\n&gt; &gt; of that communicating with a grounded and maybe disgruntled or  \n&gt; &gt; confused entity at a haunted location.\n&gt; &gt;\n&gt; &gt; so I agree with your assessment of box use 100%\n&gt; &gt;\n&gt; &gt; Bruce\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Bruce Halliday\n&gt; &gt; Paranormal Investigating Team\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; To: evp-itc@yahoogroups.com; hauntedtimes@...\n&gt; &gt; From: franks-boxes@...\n&gt; &gt; Date: Mon, 3 Dec 2007 14:43:43 -0700\n&gt; &gt; Subject: RE: [EVP-ITC] Re: Maybe there is only one box user \nallowed!?\n&gt; &gt;\n&gt; &gt; This &#39;negativity&#39; is bad enough, I wouldn&#39;t even want it on the  \n&gt; &gt; group except Moon is the one that says everyone else,  me and \nthe  \n&gt; &gt; group included, gets only &#39;false communcation&#39; or &#39;bad guys&#39;, \nand  \n&gt; &gt; that&#39;s from his own friggin&#39; blog, I didn&#39;t make that up, or \npull  \n&gt; &gt; it out of my butt. So it effects us all, and I think is open for  \n&gt; &gt; discussion/comment knowing this will get forwarded back to him. \nIn  \n&gt; &gt; fact I&#39;ll cc Moon this posting.\n&gt; &gt;\n&gt; &gt;  When he says all these scan radio users, that means me to, since \nI  \n&gt; &gt; use the things, and I prefer the linear scan mode. What I say \nabout  \n&gt; &gt; the box use is completely disregarded, and what I get through \nthe  \n&gt; &gt; box, myself, as The Box Maker, is minimalized by Moon. Moon puts \nmy  \n&gt; &gt; name out there connected with his so called &#39;telephone to the  \n&gt; &gt; dead&#39;, and I very much disapprove of my name being applied to an  \n&gt; &gt; unauthorized use of my equipment. I don&#39;t give a crap what he \ngets  \n&gt; &gt; through the boxes, or does with it, but don&#39;t make it look like \nI  \n&gt; &gt; designed it specificaly as the &#39;telephone to the dead&#39;, I \ndesigned  \n&gt; &gt; it as a friggin&#39; ITC device, that is capable of two way  \n&gt; &gt; communication--SOMETIMES, it&#39;s not like it&#39;s a guarenteed  \n&gt; &gt; connection, and you can&#39;t just dial up anyone, anytime, that&#39;s \nan  \n&gt; &gt; exageration! The &quot;box&quot; was intended by me to be used in a fixed  \n&gt; &gt; location, just by taking it to a GHU, or an &quot;investiigation&quot; is  \n&gt; &gt; using it in a way I did not intend, and I still say it&#39;s better \nif  \n&gt; &gt; used in one place. All guide lines I have offered for box use \nare  \n&gt; &gt; completely ignored, not just by Moon, to be fair.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;  It has been shown that many different approaches work for this  \n&gt; &gt; communcation, I suggest Moon design and build his own &#39;telephone  \n&gt; &gt; the dead&#39; and leave my name out of it.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;  Frank-S\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Connect and share in new ways with Windows Live. Connect now!\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Your smile counts. The more smiles you share, the more we \ndonate.  \n&gt; &gt; Join in!\n&gt; &gt;\n&gt; &gt;\n&gt;"}