{"id": "3840", "subject": "Re: Maybe there is only one box user allowed!?", "author": "judy_in_hollywood", "timestamp": "2007-12-04T06:21:57Z", "full_text": "--- In EVP-ITC@yahoogroups.com, Lisby &lt;lisby@...&gt; wrote:\n&gt;\n&gt; \n&gt; On Dec 3, 2007, at 9:34 PM, judy_in_hollywood wrote:\n&gt; \n&gt; &gt;\n&gt; &gt;  Hi All, What&#39;s to keep Chris from getting a Patent of his own on  \n&gt; &gt; HIS &quot;Telephone to The Dead&quot;? Does Frank have his &quot;Franks Box&quot;  \n&gt; &gt; Patented by the U.S. Patent Offices (the cost is low for this,  \n&gt; &gt; BTW)???? I think it has merit thus far, for Frank to consider a  \n&gt; &gt; Lawsuit! So what if it was a gift, Frank stated it was to be used  \n&gt; &gt; in 1 place (statonary) & for testing purposes ONLY. What Chris has  \n&gt; &gt; done with it, is Run with it making several businesses with it and  \n&gt; &gt; making a profit from it . . . . this is NOT what Frank intended HIS  \n&gt; &gt; Box(es) to be used as! =Judy=\n&gt; &gt;\n&gt; \n&gt; There is nothing to stop Frank from trying to patent it, if he so  \n&gt; chooses. But it&#39;s his choice.\n&gt; \n&gt; Neither I, nor you, know the details that passed between Chris and  \n&gt; Frank. Only they could testify to it. It would be a case of he/he  \n&gt; said. And what good would it serve anyone? We&#39;re back to the bull  \n&gt; crap of the Edison v. Tesla Gangs.\n&gt; \n&gt; This line of conversation needs to ends, HMO.\n&gt; \n&gt; Ann\n&gt;\n = = = = = = = = = = = = = = = =  So, Ann, You think it&#39;s OK for Chris to say all the BS he&#39;s claiming against Us & Frank? That it&#39;s OK to start up businesses, using (or abusing) Frank&#39;s Box, to make money from it, to rename Frank&#39;s box to &quot;The Telephone to the Dead&quot;, etc.  . . . without authorizations from Frank himself?  As a Legal Secretary/assistant & &quot;Independent&quot; Paranormal Investigator, etc. I disagree with you, but THAT&#39;s OK!   =Judy=  P.S.When you get your box, you can start your bussiness and make money, too, like Chris!! Perhaps that&#39;s what&#39;s needed . . . competition!"}