{"id": "3849", "subject": "My Experience with Christopher Moon and the TTTD (warning long post)", "author": "babiarz3", "timestamp": "2007-12-04T12:46:17Z", "full_text": "Here is some of a blog I wrote after my first experience with the TTTD\nor Frank&#39;s Box in March 2007:\n\nMarch 13, 2007\nChris turned on a machine that was the size of a CB Radio. The\nacoustics were poor in the room and many people moved closer to\nlisten. The first person stepped up to the mic and announced that he\nwas Jason Lewis from Atlanta and asked to speak to his father.\n\nSuddenly we begin to hear voices coming out of this small blue box.\nIt&#39;s a bit hard to discern what is being said at first then we hear\nclearly &quot;Does he know I&#39;m dead?&quot; Jason confirms that it is the voice\nof his father. He begins to ask other questions and a short 2-way\nconversation begins. Jason moved closer to the machine to hear a\nlittle better. At times Chris would ask &quot;Technicians assist&quot;. The\ntechnicians are those spirits skilled at communication and helping\nthose spirits who find it difficult.\n\nAt this point, I am bawling. There is a constant stream of tears\nrunning down my face and I begin to look around at the others in the\nroom. I see a man crossing himself, people grabbing napkins to wipe\nthe tears, and I feel an intensity in the room that I am not sure I\nhave ever experienced before.\n\nI start thinking &quot;Can this be real? Are we really communicating with\nthe other side in real time?&quot; If this was some sort of set up he would\nhave to have people stationed somewhere listening in with headphones\nand responding to the questions. Later I spoke with people who\nconfirmed that some of the messages received were about things that\nnobody could have known.\n\nA local Atlanta woman stepped up to ask a question about her daughter.\nSuddenly a loud and clear voice from device said &quot;Henry.&quot; Nobody there\nbut the woman and Chip knew that Henry is a man that Chip channels\nwhen he does readings for Rebecca. The voice went on to tell her to\nplease get a second opinion about her daughters health.\n\nAnother woman asked to speak with the spirit of her neice. The\ntechnicians advised that she wasn&#39;t able to speak because she was\nearthbound. They also advised that the woman go back to &quot;the place&quot; to\nhelp her cross over and that she was the only one the neice trusted to\ndo that. As the woman walked away trying to control herself another\nvoice differant than the technicians came through. It said &quot;Help me.&quot;\nSpeaking with the woman afterwards she told me that her neice had\ncommitted suicide by hanging. No one else in the room, besides her\ngood friend, knew that.\n\nMost everyone in the room slowly made their way to the line to ask\ntheir question. Everyone was anxious and everyone was crying.\n\nI can not begin to put in words the intensity of energy in the room.\nIt was if we had all been stripped of everything but a raw emotion. It\nwas an incredibly spiritual event and I felt like we were all\nconnected. It was a miracle in every essence of the word.\n\n\n2 days later I wrote again:\n\nMarch 15, 2007\nMany of us who attended Sunday have now moved into that caution stage.\nFrom what I understand, not all communications from the &#39;box&#39; are as\nloving as what we witnessed. Some have been downright scary.\n\nJust because it has been built and it works (I do believe that this\ndoes work and that it is not a hoax or just random noises that we are\nmaking into intelligent words) does not mean that it is all good. I\nthink the potential is there for both good and bad, equally.\n\nIs this the new hands free Ouija board? Does this act as a portal to\nwhoever wants to use it to enter our dimension? I see this becoming so\naddictive to those battling depression and suffering the loss of a\nloved ones. A good medium will not allow someone grieving to seek\ntheir services time and time again as it prohibits healing. Now we\nhave the equivalent of free long distance to the departed. No rollover\nminutes are required. If this device is used on investigations I do\nbelieve all other protocol would be thrown out the window. It is\ncurrently being used to help in cold cases. What&#39;s to prevent a\nmalicious entity to frame an innocent person or just completely\nleading law enforcement in the wrong direction?\n\nIn the infamous words of Chip Coffey &quot;We don&#39;t know what we don&#39;t know.&quot; \n\nOne month later, after attending an event at The Stanley Hotel in Co.\nI recounted my next experience:\n\nApril 17, 2007\nMy first experience with the TTTD was in Savannah. It was such a\npowerful and emotional experience for me and I walked away forever\nchanged as a result. Once I returned home, much discussion occured as\nto what exactly happened and what is this box. Good, bad... etc.\nFast forward to The Stanley. I decided that rather than join in on the\ninvestigations either night, I would experience the TTTD again. My\ngoal was to not allow myself to become emotionally involved but, to\nwatch the dynamics and energy of those attending. Ever since I was a\nyoung girl, I have been interested in the enrgy of people and it&#39;s\neffect on the environment. I had thoughts and ideas and I wanted to\nvalidate those. I think I did.\nAfter the Stanley Event, this is what I have decided. Not only is the\nfacillitator of the box important, so are those others present. The\nenergy in Savannah was so positive, the vibrational levels incredibly\nhigh, little to no &quot;bad&quot; could come through. Colorado was differant.\nThose attendees had not only probably heard the recent discussions but\nalso had just left a presentation by Demonologist Adam Blai. Fear and\nconfusion entered that room. I watched people both nights and as each\nraffle ticket number was called the energy shifted and lowered. I\ncould &quot;hear&quot; the thoughts of people as time and time again their\nnumber was not called. There was little to no emotional support for\npeers happening. And what came through the box, though only a small\npercentage was completely &quot;negative&quot;, it was no comparison to the\nmessages received in Savannah.\nNow, on to Spirit Faces... I bought this book thinking that the entire\nbook would be about the Illuminator and the polaroids Mr. Macy is\ntaking. I was wrong. Many portions validate, synchronistically, the\nthoughts about the TTTD that have mostly consumed me since Savannah.\nHere are a few excerpts:\n\n(pg 32) Speaking of a communication from the spirit of Konstantin\nRaudive through radio sounds, Konstanin says &quot;It can only work when\nthe vibrations of those present are in complete harmony, and when\ntheir aims and intentions are pure.&quot;\n\n(Pg 80) On Contact Fields ( On communication from spirits through ITC\nthat say ITC depends on contact fields or a pool of life energy\ncomposed of the thoughts and attitudes of all researchers involved\n(both living and spirits) in an ITC project): &quot;When everyone&#39;s\nthoughts are in harmony, the contact field is clear. They can see into\nour world and work with our equipment. But, if there is dissonance in\nthe form of fears, doubts, and animosities, the contact field becomes\ncloudy, and it is impossible for them to see into our world and work\nwith us. That&#39;s when negative spirit groups close to the earth in\nvibration can break into existing bridges, with troubling results.\nTroubled feelings seem to open the field to troubled spirit worlds as\nthey close down the field to the finer worlds.&quot;\n\n(Pg 81) &quot;Resonance is a state of going with the flow. When vibration\nis synchronized, less and less energy is required to excite the\nsystem. Pure resonance allows a system, once vibrating, to keep\nvibrating indefinitely.&quot;\n\nMore is said that I feel speaks directly to both the above and a\nsuccessful future for the TTTD and those using it but, I realize not\nonly how long this is but the fact that I&#39;m sure none of this is\noriginal thought. For me, it is incredibly exciting and validating to\nwhat I hold as my personal truth."}