{"id": "3850", "subject": "Negative Experience", "author": "babiarz3", "timestamp": "2007-12-04T13:28:37Z", "full_text": "Ann,\n\nI tried to relocate the post in which you asked me about my negative\nexperiences. After 10 minutes searching... new topic.\n\nAs it relates to the box, I really only have two personal experiences\nthat might be considered negative. \n\nThe first one is contained in a posting I just made prior to this. I\nwill refer you back to it, if you don&#39;t mind. The experience is\ncontained in the copy and paste from my April 17, 2007 blog. It did\nnot effect me personally  but I did witness the effects of negative\nenergy on what/who came through the box. \n\nThe second negative experience is one I have not spoken of to anyone\nbesides who was there that day and one close trusted friend. This\noccurred in September of this year:\nChris, myself and four others who will remain nameless, were gathered\nin a hotel room. For the sake of the story, I will refer to the main\nsubject as Mary. \nMary had been experiencing severe negative phenomenon for years. This\nincluded poltergeist type activity, personal harm and had since moved\ninto effecting her young son. I can not get into the exact details of\nthis negativity but suffice it to say that all accounts led everyone\nto believe that Mary was dealing with a demon or demons. \nThis was the second time Mary had sought out Chris for assistance. \nThe first time she had noticed a change for a short time but then\n&quot;things&quot; had returned as before and in some instances had worsened.\nThis particular day Mary found herself surrounded by trusted friends\nand was ready to try again. There was a psychic medium, a healer and,\nmyself, a sensitive along with another person with no stated\nabilities. Our goal was to turn on the box and receive some direction\nabout what to do and how to help. I won&#39;t reveal the details of what\nwas said as they are not relevant to the post topic. \nAs some time went on and we moved into a second session with the box,\nChris became noticeably weaker. It was obvious that his energy was\nbeing used. I noticed that I was becoming quite weepy. You&#39;ll have to\ntake my word on this when I say I am not a weepy person. Sensitive or\nnot, I do not become emotional. Yet as time passed, I found I couldn&#39;t\ncontrol the tears falling. I rationalized it by recognizing I was\nprobably becoming emotional with compassion as Mary discussed very\nprivate issues. \nThe psychic medium present told us at this point that we should place\nour hands on Mary. Not considering that I was in no state to offer\nenergy/help to anyone, I placed my hand on Mary&#39;s leg. Suddenly, I\nbegan to feel what I can only describe as &quot;thick&quot; energy move into my\nhand, up my arm, through my chest and then settle into my stomach. As\nit sat in my stomach I could literally feel it turn into sludge. It\nbegan to churn and move up into my throat. At this point, I knew I was\ngoing to vomit and I knew it would be black. I knew this was evil.\nFortunately, some focus switched to me at this point because I felt\nparalyzed. I was removed from the room and brought outside where, with\nassistance, I was able to let go of what was not mine. It took\napproximately 30 minutes before I felt myself again.\nBack to Mary for a moment; After the sessions that night, she had a\nnoticeable physical change, in particular to her face. It shocked me.\nWhere she had appeared hard or almost calloused in her expressions,\nshe was now much softer in appearance. Her life improved dramatically.\nShe has had one more session with Chris and the box and things\ncontinue to improve.\nThe TTTD or Frank&#39;s Box or whatever you want to refer to it as, is a\npowerful device. It has the ability to connect to other dimensions. It\ncan be a wonderful thing. It can also be quite scary in the wrong\nhands. I believe that just as good can be called upon to help, so can\ndark and we know that there are many people out there who are far more\nconcerned in working with lower levels than the higher."}