{"id": "3855", "subject": "Re: [EVP-ITC] It&#39;s too much!", "author": "lisby@earthlink.net", "timestamp": "2007-12-04T15:02:47Z", "full_text": "Hey Frank--\n\nIt&#39;s okay for there to be no easy answers. It doesn&#39;t reflect badly on you in any way--in fact, it proves you&#39;re honest.\n\nKeep doing your thing, buddy.\n\nAnn\n\n-----Original Message-----\n&gt;From: Frank Sumption &lt;franks-boxes@...&gt;\n&gt;Sent: Dec 4, 2007 8:58 AM\n&gt;To: Group &lt;evp-itc@yahoogroups.com&gt;\n&gt;Subject: [EVP-ITC] It&#39;s too much!\n&gt;\n&gt;\n&gt;Hi All;\n&gt; \n&gt; I feel like I&#39;m getting pulled inmultiple directions, each wanting to validate, and endorse their version of the box, and/or the results. It&#39;s nerve wracking, and making me nuts. I don&#39;t know what is the correct use, function, or output of the box, I know only how I use it. I get what most others get, and more. What everyoe else does wiht it is up to them. The box is an ITC devcie, my orignal use was to use for my own communications. It seemed rel;ated to EVP, so i shared my results on various EVP web sites, and groups. I regret that, I  wish I would have kept it to myself. Humanity doesn&#39;t even understand their own minds, and yet they want to comunicate with the higher realms. The other uses, such as spirit communcation, I tend to stay away from, it&#39;s too unpredeictable, and you can&#39;t tell who/what is talking. Personally I think 90% is your own minds talking back to you, and giving what is expected.  \n&gt; \n&gt; I&#39;ve reached a point where I&#39;ve had enough public interaction. Everyone wnat to beat up Moon, yet everyone wants to do the same friggin&#39; things, and I&#39;m stuck in the middle.  I don&#39;t vcare about demons, bad guys, or saints coming through, I have my own group that comes through, and that&#39;s what the box was made for. \n&gt; \n&gt; Frank-S\n&gt;_________________________________________________________________\n&gt;You keep typing, we keep giving. Download Messenger and join the i’m Initiative now.\n&gt;http://im.live.com/messenger/im/home/?source=TAGLM"}