{"id": "3858", "subject": "Re: It&#39;s too much!", "author": "M.A. Coletta (Mike)", "timestamp": "2007-12-04T16:07:38Z", "full_text": "babiarz3,\n\nI have no idea who you are... but based on much of what I read what you have written... you may be Mr Moons marketing/PR person. So that said, I suggest you have him put together the RS 12-469 system, then try it a few times.  Then and only then can he experience it and be able to give a real critque of how it works for him, which may be different than how it is for another person. One of the only differences between it and what he is now using is, the RS has linear sweep and his is random.  Frank said linear works better for him.\nDon&#39;t fear something new, embrase and try it...\n\nMike\n\n-- In EVP-ITC@yahoogroups.com, &quot;babiarz3&quot; &lt;babiarz3@...&gt; wrote:\n&gt;\n&gt; Frank,\n&gt; Sounds like a bad morning for you. I knew this was coming, you feeling\n&gt; overwhelmed with everyones thoughts and opinions. I&#39;ve watched you\n&gt; sway opinions depending on whats happening here on the boards, who&#39;s\n&gt; speaking the loudest, etc. The fact remains that you were able to\n&gt; build a device that allows &quot;something&quot; to occur. It is nothing short\n&gt; of amazing.\n&gt; My only suggestion to you on this obvious overwhelming day, is to\n&gt; remember that you and Chris met for a reason. You were guided to him.\n&gt; The friendship has gone back and forth since but inevitably something\n&gt; happens that validates for you the things that Chris has said. It is\n&gt; okay that you have different opinions. You both really work in\n&gt; separate environments. Your opinions are based on your experiences in\n&gt; the development of the devices and the group you interact with. Chris&#39;\n&gt; are based on the environments that he works in and the group that\n&gt; assists him. \n&gt; It would be a shame to let anyones opinions, including mine, interfere\n&gt; with your friendship and working relationship with Chris.\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@&gt; wrote:\n&gt; &gt;\n&gt; &gt; \n&gt; &gt; Hi All;\n&gt; &gt;  \n&gt; &gt;  I feel like I&#39;m getting pulled inmultiple directions, each wanting\n&gt; to validate, and endorse their version of the box, and/or the results.\n&gt; It&#39;s nerve wracking, and making me nuts. I don&#39;t know what is the\n&gt; correct use, function, or output of the box, I know only how I use it.\n&gt; I get what most others get, and more. What everyoe else does wiht it\n&gt; is up to them. The box is an ITC devcie, my orignal use was to use for\n&gt; my own communications. It seemed rel;ated to EVP, so i shared my\n&gt; results on various EVP web sites, and groups. I regret that, I  wish I\n&gt; would have kept it to myself. Humanity doesn&#39;t even understand their\n&gt; own minds, and yet they want to comunicate with the higher realms. The\n&gt; other uses, such as spirit communcation, I tend to stay away from,\n&gt; it&#39;s too unpredeictable, and you can&#39;t tell who/what is talking.\n&gt; Personally I think 90% is your own minds talking back to you, and\n&gt; giving what is expected.  \n&gt; &gt;  \n&gt; &gt;  I&#39;ve reached a point where I&#39;ve had enough public interaction.\n&gt; Everyone wnat to beat up Moon, yet everyone wants to do the same\n&gt; friggin&#39; things, and I&#39;m stuck in the middle.  I don&#39;t vcare about\n&gt; demons, bad guys, or saints coming through, I have my own group that\n&gt; comes through, and that&#39;s what the box was made for. \n&gt; &gt;  \n&gt; &gt;  Frank-S\n&gt; &gt; _________________________________________________________________\n&gt; &gt; You keep typing, we keep giving. Download Messenger and join the i&#39;m\n&gt; Initiative now.\n&gt; &gt; http://im.live.com/messenger/im/home/?source=TAGLM\n&gt; &gt;\n&gt;"}