{"id": "3859", "subject": "Re: [EVP-ITC] Re: Negative Experience", "author": "lisby@earthlink.net", "timestamp": "2007-12-04T16:29:22Z", "full_text": "Fair enough. I understand experiences that defy all attempts at Earth logic, as it were. I&#39;ve had them, too.\n\nAs I said, just food for thought.\n\nAnn\n\n-----Original Message-----\n&gt;From: babiarz3 &lt;babiarz3@...&gt;\n&gt;Sent: Dec 4, 2007 10:31 AM\n&gt;To: EVP-ITC@yahoogroups.com\n&gt;Subject: [EVP-ITC] Re: Negative Experience\n&gt;\n&gt;Ann,\n&gt;\n&gt;Without knowing me, I can understand your offering of other possible\n&gt;causes of my experience. As investigators, that is our obligation; to\n&gt;look for all possible causes of supposed paranormal phenomenon. I am\n&gt;sure that I would have the same reaction as you after having read\n&gt;about the experience. I have found that the investigators I respect\n&gt;the most are those with the ability to be skeptical. I train my new\n&gt;members to be objective.\n&gt;\n&gt;Now, all that being said... I won&#39;t attempt to try to persuade you to\n&gt;believe that my story is exactly what happened. I can&#39;t and don&#39;t feel\n&gt;a need to. I know that any story related by anyone can fall into the\n&gt;symptoms you state below, including your own. I can only offer you the\n&gt;following to consider;\n&gt;\n&gt;I am a 40 year old educated and intelligent female. I am not now, nor\n&gt;have I ever been in treatment for or taken medication for mental\n&gt;illness. I have never experienced a panic attack. I do not use drugs.\n&gt;I am not given to flights of fancy and am described as analytical and\n&gt;pragmatic. I have been fully involved in the field for 6 years. That\n&gt;night was the first and only time I ever experienced what I did. I do\n&gt;not scare. I run towards noises, shadows etc. I am a trusted sensitive\n&gt;with enough validation to discredit even my own hard core skepticism.I\n&gt;am objective. \n&gt;\n&gt;Now that the majority of a witness interview is complete LOL, I am\n&gt;done with the post.  \n&gt;\n&gt;\n&gt;\n&gt;--- In EVP-ITC@yahoogroups.com, lisby@... wrote:\n&gt;&gt;\n&gt;&gt; Thank you for sharing that so honestly with me. I really appreciate\n&gt;it. :)\n&gt;&gt; \n&gt;&gt; Let me give you my comments, none of which are meant to belittle\n&gt;your experience, rather to provide food for thought: I am sure that\n&gt;the feelings you experienced (&quot;I began to feel what I can only\n&gt;describe as &quot;thick&quot; energy move into my hand, up my arm, through my\n&gt;chest and then settle into my stomach...It began to churn and move up\n&gt;into my throat..I felt paralyzed. ...It took approximately 30 minutes\n&gt;before I felt myself again,&quot;) were very real to you. You said you\n&gt;thought it was evil; that your vomit would be black (an image straight\n&gt;out of classic demonolgy). Indeed, you said that everyone in the room\n&gt;had the similar mindset: Whatever you there to confront was\n&gt;dark/negative/evil.\n&gt;&gt; \n&gt;&gt; Speaking from my own personal experience, I have seen groups of\n&gt;people involved in the paranormal convince themselves of similar (and\n&gt;many far, far weirder) things. Hell, as a teen, I was involved in\n&gt;several of these folies-a-deux (or 10, 15, 20, or more). I saw people\n&gt;having experiences similar to what you report. At one point, friends\n&gt;of mine were receiving alledged telepathic communication from a living\n&gt;rock star who was helping them commune with spirit of Alisdar Crowley,\n&gt;for example. Others in the group or on its periphery were getting\n&gt;&quot;attacked&quot; by what we called AWOLs (from &quot;Away Without Leave&quot;). Hell,\n&gt;I thought I&#39;d been attacked by a few myself. But now, many years\n&gt;later, what I see this particular group, and others, was comprised of\n&gt;was a lot of people damned busy scaring the shit out of themselves.\n&gt;Maybe real dark forces *were* feeding off the bad vibes--I dunno. But\n&gt;what I witnessed is rendolent of the Salem hysteria in the late 1600s,\n&gt;the &quot;Amityville Horror&quot; case, and many, many others, in descending\n&gt;order of sensationalism, down to the ubiquitous freakouts of kids\n&gt;playing with the Ouija board.\n&gt;&gt; \n&gt;&gt; Fear and anxiety produce painful and uncomfortabl physical effects\n&gt;in the body that could be interpreted as caused by a negative outside\n&gt;influence. Fear causes the body to become flooded with hormones\n&gt;(particularly adrenalin). Here is a list of symptoms (from Wikipedia)\n&gt;of what we commonly call a panic attack:\n&gt;&gt; \n&gt;&gt; Physical\n&gt;&gt; \n&gt;&gt;     * An extremely unpleasant sensation of adrenaline over the\n&gt;entire body\n&gt;&gt;     * Sweating\n&gt;&gt;     * Shortness of breath\n&gt;&gt;     * Racing or pounding heartbeat or palpitations\n&gt;&gt;     * Chest pain\n&gt;&gt;     * Dizziness or vertigo\n&gt;&gt;     * Lightheadedness\n&gt;&gt;     * Nausea / stomach pains\n&gt;&gt;     * Hyperventilation\n&gt;&gt;     * Choking or smothering sensations\n&gt;&gt;     * Uncontrollable itching\n&gt;&gt;     * Tingling or numbness in the hands, face, feet or mouth\n&gt;(paresthesia)\n&gt;&gt;     * Hot/cold flashes\n&gt;&gt;     * Trembling or shaking\n&gt;&gt;     * Feeling of claustrophobia\n&gt;&gt;     * Exhaustion\n&gt;&gt;     * Feeling of physical weakness or limpness of the body\n&gt;&gt;     * Uncontrollable crying\n&gt;&gt; \n&gt;&gt; Mental\n&gt;&gt;     * Loss of the ability to react logically to stimuli\n&gt;&gt;     * Loss of cognitive ability in general\n&gt;&gt;     * Racing thoughts (often based on fear; a repeated or illogical\n&gt;worry)\n&gt;&gt;     * Loud internal dialogue\n&gt;&gt;     * Feeling of impending doom\n&gt;&gt;     * Feeling of &quot;going crazy&quot;\n&gt;&gt;     * Extreme worried feeling\n&gt;&gt;     * Feeling of extreme nervousness\n&gt;&gt;     * Feeling out of control\n&gt;&gt;     * Feeling of Threatening\n&gt;&gt;     * Feeling of anti-social behaviour from other people\n&gt;&gt;     * Feeling of excitement\n&gt;&gt;     * Feeling of nagging from other people\n&gt;&gt;     * Vision is somewhat impaired (eyes may feel like they are shaking.)\n&gt;&gt; \n&gt;&gt; Emotional\n&gt;&gt; \n&gt;&gt;     * Terror, or a sense that something unimaginably horrible is\n&gt;about to occur and one is powerless to prevent it\n&gt;&gt;     * Fear that the panic is a symptom of a serious illness\n&gt;&gt;     * Fear of losing control\n&gt;&gt;     * Fear of death\n&gt;&gt;     * Fear of going crazy\n&gt;&gt;     * Flashbacks to earlier panic trigger\n&gt;&gt; \n&gt;&gt;  Perceptual\n&gt;&gt; \n&gt;&gt;     * Tunnel vision\n&gt;&gt;     * Heightened senses\n&gt;&gt;     * The apparent slowing down or speeding up of time\n&gt;&gt;     * Dream-like sensation or perceptual distortion (derealization)\n&gt;&gt;     * Dissociation, or the perception that one is not connected to\n&gt;the body or is disconnected from space and time (depersonalization)\n&gt;&gt;     * Feeling of loss of free will, as if acting entirely\n&gt;automatically without control\n&gt;&gt; \n&gt;&gt; I have to submit that the symptoms you describe for yourself and\n&gt;others involved that night are found on this list. In fact, a lot of\n&gt;descriptions of &quot;attacks by dark forces&quot; sound like the physiological\n&gt;effects of fear and anxiety. Am I saying you had a panic attack? No.\n&gt;But I am suggesting it is a possibility to consider. Because you were\n&gt;in a situation where you believed that &quot;evil&quot; would be present, thus\n&gt;generating fear, Occam&#39;s Razor would certainly lead us to conclude\n&gt;that adrenaline that made you feel the way you did. But Occam&#39;s Razor\n&gt;proves it&#39;s general trustworthines by periodic exceptions.\n&gt;&gt; \n&gt;&gt; HMO and not an attack or judgement on your (or anyone&#39;s) beliefs,\n&gt;&gt; \n&gt;&gt; Ann\n&gt;&gt; \n&gt;&gt; \n&gt;&gt; \n&gt;&gt; -----Original Message-----\n&gt;&gt; &gt;From: babiarz3 &lt;babiarz3@...&gt;\n&gt;&gt; &gt;Sent: Dec 4, 2007 8:28 AM\n&gt;&gt; &gt;To: EVP-ITC@yahoogroups.com\n&gt;&gt; &gt;Subject: [EVP-ITC] Negative Experience\n&gt;&gt; &gt;\n&gt;&gt; &gt;Ann,\n&gt;&gt; &gt;\n&gt;&gt; &gt;I tried to relocate the post in which you asked me about my negative\n&gt;&gt; &gt;experiences. After 10 minutes searching... new topic.\n&gt;&gt; &gt;\n&gt;&gt; &gt;As it relates to the box, I really only have two personal experiences\n&gt;&gt; &gt;that might be considered negative. \n&gt;&gt; &gt;\n&gt;&gt; &gt;The first one is contained in a posting I just made prior to this. I\n&gt;&gt; &gt;will refer you back to it, if you don&#39;t mind. The experience is\n&gt;&gt; &gt;contained in the copy and paste from my April 17, 2007 blog. It did\n&gt;&gt; &gt;not effect me personally  but I did witness the effects of negative\n&gt;&gt; &gt;energy on what/who came through the box. \n&gt;&gt; &gt;\n&gt;&gt; &gt;The second negative experience is one I have not spoken of to anyone\n&gt;&gt; &gt;besides who was there that day and one close trusted friend. This\n&gt;&gt; &gt;occurred in September of this year:\n&gt;&gt; &gt;Chris, myself and four others who will remain nameless, were gathered\n&gt;&gt; &gt;in a hotel room. For the sake of the story, I will refer to the main\n&gt;&gt; &gt;subject as Mary. \n&gt;&gt; &gt;Mary had been experiencing severe negative phenomenon for years. This\n&gt;&gt; &gt;included poltergeist type activity, personal harm and had since moved\n&gt;&gt; &gt;into effecting her young son. I can not get into the exact details of\n&gt;&gt; &gt;this negativity but suffice it to say that all accounts led everyone\n&gt;&gt; &gt;to believe that Mary was dealing with a demon or demons. \n&gt;&gt; &gt;This was the second time Mary had sought out Chris for assistance. \n&gt;&gt; &gt;The first time she had noticed a change for a short time but then\n&gt;&gt; &gt;&quot;things&quot; had returned as before and in some instances had worsened.\n&gt;&gt; &gt;This particular day Mary found herself surrounded by trusted friends\n&gt;&gt; &gt;and was ready to try again. There was a psychic medium, a healer and,\n&gt;&gt; &gt;myself, a sensitive along with another person with no stated\n&gt;&gt; &gt;abilities. Our goal was to turn on the box and receive some direction\n&gt;&gt; &gt;about what to do and how to help. I won&#39;t reveal the details of what\n&gt;&gt; &gt;was said as they are not relevant to the post topic. \n&gt;&gt; &gt;As some time went on and we moved into a second session with the box,\n&gt;&gt; &gt;Chris became noticeably weaker. It was obvious that his energy was\n&gt;&gt; &gt;being used. I noticed that I was becoming quite weepy. You&#39;ll have to\n&gt;&gt; &gt;take my word on this when I say I am not a weepy person. Sensitive or\n&gt;&gt; &gt;not, I do not become emotional. Yet as time passed, I found I couldn&#39;t\n&gt;&gt; &gt;control the tears falling. I rationalized it by recognizing I was\n&gt;&gt; &gt;probably becoming emotional with compassion as Mary discussed very\n&gt;&gt; &gt;private issues. \n&gt;&gt; &gt;The psychic medium present told us at this point that we should place\n&gt;&gt; &gt;our hands on Mary. Not considering that I was in no state to offer\n&gt;&gt; &gt;energy/help to anyone, I placed my hand on Mary&#39;s leg. Suddenly, I\n&gt;&gt; &gt;began to feel what I can only describe as &quot;thick&quot; energy move into my\n&gt;&gt; &gt;hand, up my arm, through my chest and then settle into my stomach. As\n&gt;&gt; &gt;it sat in my stomach I could literally feel it turn into sludge. It\n&gt;&gt; &gt;began to churn and move up into my throat. At this point, I knew I was\n&gt;&gt; &gt;going to vomit and I knew it would be black. I knew this was evil.\n&gt;&gt; &gt;Fortunately, some focus switched to me at this point because I felt\n&gt;&gt; &gt;paralyzed. I was removed from the room and brought outside where, with\n&gt;&gt; &gt;assistance, I was able to let go of what was not mine. It took\n&gt;&gt; &gt;approximately 30 minutes before I felt myself again.\n&gt;&gt; &gt;Back to Mary for a moment; After the sessions that night, she had a\n&gt;&gt; &gt;noticeable physical change, in particular to her face. It shocked me.\n&gt;&gt; &gt;Where she had appeared hard or almost calloused in her expressions,\n&gt;&gt; &gt;she was now much softer in appearance. Her life improved dramatically.\n&gt;&gt; &gt;She has had one more session with Chris and the box and things\n&gt;&gt; &gt;continue to improve.\n&gt;&gt; &gt;The TTTD or Frank&#39;s Box or whatever you want to refer to it as, is a\n&gt;&gt; &gt;powerful device. It has the ability to connect to other dimensions. It\n&gt;&gt; &gt;can be a wonderful thing. It can also be quite scary in the wrong\n&gt;&gt; &gt;hands. I believe that just as good can be called upon to help, so can\n&gt;&gt; &gt;dark and we know that there are many people out there who are far more\n&gt;&gt; &gt;concerned in working with lower levels than the higher.  \n&gt;&gt; &gt;\n&gt;&gt;\n&gt;\n&gt;"}