{"id": "3869", "subject": "Re: Maybe there is only one box user allowed!?", "author": "Lance Oliver", "timestamp": "2007-12-05T03:58:21Z", "full_text": "Thank you, Bruce. Will do.\n\nAnd I&#39;ll be glad to report back, fruitful or not.\n\nLance\n\n--- In EVP-ITC@yahoogroups.com, bruce halliday \n&lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; Well Lance!\n&gt;  \n&gt; I guess the gauntlet has been thrown!\n&gt;  \n&gt; do your best\n&gt;  \n&gt; Bruce\n&gt; \n&gt; Bruce Halliday Paranormal Investigating Team \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: orbhunterx@...: Tue, 4 Dec 2007 03:41:44 \n+0000Subject: [EVP-ITC] Re: Maybe there is only one box user allowed!?\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; I&#39;ll take that as a challange, Bruce!After proper burn in time, to \nattune the Box to me, I will go forth.I plan to take it to several \nplaces that I know spirits dwell. We shall see through experimental \nquestions what is what...Lance--- In EVP-ITC@yahoogroups.com, bruce \nhalliday &lt;paranormalinvestigating@&gt; wrote:&gt;&gt; Frank,&gt; &gt; After doing \nbox research for a while now and having the opportunity to work with \nseveral different&gt; types of boxes. I would have to agree the boxes \nare meant for and work better as a stationary communication device &gt; \nsort of like a communication station that is consistently under the \nsame basic conditions. I have never taken my boxes out of my home&gt; or \ndone a session out side of my home and I don&#39;t believe that taking \nthe box , any box not just yours to a remote allegedly haunted \nlocation&gt; will not serve to enhance communication. And if anyone is \nreally concerned about summoning dark entities they have a much \nbetter chance&gt; of that communicating with a grounded and maybe \ndisgruntled or confused entity at a haunted location.&gt; &gt; so I agree \nwith your assessment of box use 100%&gt; &gt; Bruce&gt; &gt; Bruce Halliday \nParanormal Investigating Team &gt; &gt; &gt; To: evp-itc@yahoogroups.com; \nhauntedtimes@: franks-boxes@: Mon, 3 Dec 2007 14:43:43 -0700Subject: \nRE: [EVP-ITC] Re: Maybe there is only one box user allowed!?&gt; &gt; &gt; &gt; &gt; \nThis &#39;negativity&#39; is bad enough, I wouldn&#39;t even want it on the group \nexcept Moon is the one that says everyone else, me and the group \nincluded, gets only &#39;false communcation&#39; or &#39;bad guys&#39;, and that&#39;s \nfrom his own friggin&#39; blog, I didn&#39;t make that up, or pull it out of \nmy butt. So it effects us all, and I think is open for \ndiscussion/comment knowing this will get forwarded back to him. In \nfact I&#39;ll cc Moon this posting. When he says all these scan radio \nusers, that means me to, since I use the things, and I prefer the \nlinear scan mode. What I say about the box use is completely \ndisregarded, and what I get through the box, myself, as The Box \nMaker, is minimalized by Moon. Moon puts my name out there connected \nwith his so called &#39;telephone to the dead&#39;, and I very much \ndisapprove of my name being applied to an unauthorized use of my \nequipment. I don&#39;t give a crap what he gets through the boxes, or \ndoes with it, but don&#39;t make it look like I designed it specificaly \nas the &#39;telephone to the dead&#39;, I designed it as a friggin&#39; ITC \ndevice, that is capable of two way communication--SOMETIMES, it&#39;s not \nlike it&#39;s a guarenteed connection, and you can&#39;t just dial up anyone, \nanytime, that&#39;s an exageration! The &quot;box&quot; was intended by me to be \nused in a fixed location, just by taking it to a GHU, or \nan &quot;investiigation&quot; is using it in a way I did not intend, and I \nstill say it&#39;s better if used in one place. All guide lines I have \noffered for box use are completely ignored, not just by Moon, to be \nfair. It has been shown that many different approaches work for this \ncommuncation, I suggest Moon design and build his own &#39;telephone the \ndead&#39; and leave my name out of it. Frank-S&gt; &gt; &gt; Connect and share in \nnew ways with Windows Live. Connect now! &gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; \n__________________________________________________________&gt; Your \nsmile counts. The more smiles you share, the more we donate.  Join \nin.&gt; www.windowslive.com/smile?\nocid=TXT_TAGLM_Wave2_oprsmilewlhmtagline&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Your smile counts. The more smiles you share, the more we donate. \nJoin in.\n&gt; www.windowslive.com/smile?ocid=TXT_TAGLM_Wave2_oprsmilewlhmtagline\n&gt;"}