{"id": "3875", "subject": "Re: [EVP-ITC] RS 12-469 Recordings using the Optical Microphone", "author": "Lisby", "timestamp": "2007-12-05T09:47:38Z", "full_text": "When you say control points, are we talking real, physical places or...?\n\nAnn\n\nOn Dec 4, 2007, at 7:18 PM, RetroCom wrote:\n\n&gt; Hi Ann, I checked against the master wav file which is slightly  \n&gt; clearer and I still hear it the same. Yes, the voice sounds  \n&gt; distraught. In this very same session I can hear &#39;stations&#39; or  \n&gt; control points testing, some giving locations. Yesterday I posted  \n&gt; one that mentioned Amsterdam. In reviewing again today I can hear  \n&gt; another message that mentions New Zealand.\n&gt; &quot;Your coming through, you&#39;ve got Southern New Zealand&quot;\n&gt;\n&gt; Dave\n&gt;\n&gt; --- lisby@...t wrote:\n&gt;\n&gt; From: Lisby &lt;lisby@...&gt;\n&gt; To: EVP-ITC@...m\n&gt; Subject: Re: [EVP-ITC] RS 12-469 Recordings using the Optical  \n&gt; Microphone\n&gt; Date: Tue, 4 Dec 2007 18:56:09 -0500\n&gt;\n&gt; I&#39;m hearing &quot;I don&#39;t want to go,&quot; I think. I can&#39;t hear a D sound.\n&gt; But either way, the speaker sounds horribly distraught!\n&gt;\n&gt; Ann\n&gt;\n&gt; On Dec 4, 2007, at 6:01 PM, RetroCom wrote:\n&gt;\n&gt; &gt; Thanks Frank R. I get messages about heterodyning from time to\n&gt; &gt; time. The optical microphone system I use is ultra sensitive to low\n&gt; &gt; frequency vibrations. Perhaps they can use the &#39;Schuman resonance&#39;\n&gt; &gt; as a carrier.\n&gt; &gt; A couple more captures from this session. This first one is very\n&gt; &gt; emotional.\n&gt; &gt; &quot;I don&#39;t really wanna die&quot;\n&gt; &gt;\n&gt; &gt; &quot;Give him more secrets&quot;\n&gt; &gt;\n&gt; &gt; Dave\n&gt; &gt;\n&gt;\n&gt;  &lt;120307yourcomingthroughyougotsouthernnewzealand.mp3&gt;\n\n\nWhen you say con ol poin s, a e we alking eal, physical places o ...?AnnOn Dec 4, 2007, a 7:18 PM, Re oCom w o e: Hi Ann, I checked agains he mas e wa ile which is sligh ly clea e and I s ill hea i he same. Yes, he oice sounds dis augh . In his e y same session I can hea 's a ions' o con ol poin s es ing, some gi ing loca ions. Yes e day I pos ed one ha men ioned Ams e dam. In e iewing again oday I can hea ano he message ha men ions New Zealand. \"You coming h ough, you' e go Sou he n New Zealand\" Da e --- lisby@ea hlink.ne w o e: F om: Lisby lisby@ea hlink.ne > To: EVP-ITC@yahoog oups.com Subjec : Re: [EVP-ITC] RS 12-469 Reco dings using he Op ical Mic ophone Da e: Tue, 4 Dec 2007 18:56:09 -0500 I'm hea ing \"I don' wan o go,\" I hink. I can' hea a D sound. Bu ei he way, he speake sounds ho ibly dis augh ! Ann On Dec 4, 2007, a 6:01 PM, Re oCom w o e: > Thanks F ank R. I ge messages abou he e odyning om ime o > ime. The op ical mic ophone sys em I use is ul a sensi i e o low > equency ib a ions. Pe haps hey can use he 'Schuman esonance' > as a ca ie . > A couple mo e cap u es om his session. This i s one is e y > emo ional. > \"I don' eally wanna die\" > > \"Gi e him mo e sec e s\" > > Da e >"}