{"id": "3936", "subject": "Re: Just wondering", "author": "psi_research", "timestamp": "2007-12-06T02:22:33Z", "full_text": "Some members of the Big Circle at the AA-EVP do this. Good idea \nJulie. I seem to get a similar voice in a number of sessions that I \nguess could be considered my counter part. _Bill\n\n--- In EVP-ITC@yahoogroups.com, bruce halliday \n&lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; \n&gt; hey,\n&gt;  \n&gt; what you are suggesting was at one time and sometimes still is \npracticed by evp researchers.\n&gt; It is called a combined session and it actually serves to enhance \ncommunication by supplying\n&gt; a collective energy. It is a splendid idea and you should post an \nagenda on the group and give \n&gt; anyone who is interested an opportunity to be involved in the group \nsession.\n&gt;  \n&gt; I have not heard of this method being experimented with as far as \nbox research goes\n&gt; just with traditional evp.\n&gt;  \n&gt; And yes your assumption about having guide spirits assigned to us \nas individual researchers\n&gt; is very much correct. My techs are Mike & Lisa whom I communicate \nwith on a daily basis\n&gt; My research friend and partner Steve hultay also has the same two \nspirit guides and or technicians \n&gt; assigned to him. probably because our research always coincides and \nis interwoven with each other\n&gt; I guess they decided to save spirit work load and assign the same \ntech&#39;s to both of us.\n&gt;  \n&gt; If you decide to organise the group session count me in.\n&gt;  \n&gt; Bruce\n&gt; \n&gt; Bruce Halliday Paranormal Investigating Team \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: ghostchasingfool@...: Wed, 5 Dec 2007 23:58:01 \n+0000Subject: [EVP-ITC] Just wondering\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Guys, I have just be wondering if anyone has tried experimenting \nwith running session at the same time in different locations with the \nsame boxes?I was curious if in fact even though the frequencies would \nbe different depending our your area, if in fact some of the same \nvoices would come through to each of you.It was just a thought? In my \ntesting sessions I am coming to find out that they certainly know all \nof you, Frank, Bruce, Mike, etc.. for your names seem to be coming \nup. Therefore, I wonder if you all have so called &quot;personal \nassistants&quot; or &quot;tecs&quot; assiged to you or if they are random? \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Connect and share in new ways with Windows Live.\n&gt; http://www.windowslive.com/connect.html?\nocid=TXT_TAGLM_Wave2_newways_112007\n&gt;"}