{"id": "3940", "subject": "Re: Just wondering", "author": "psi_research", "timestamp": "2007-12-06T02:48:21Z", "full_text": "I&#39;ve been trying to call u tonight @ your home and cel. If you still \nhave my # give me a call, I&#39;d like to chat with you. -Bill\n\n--- In EVP-ITC@yahoogroups.com, juli velazquez &lt;ghostchasingfool@...&gt; \nwrote:\n&gt;\n&gt; Bill, nice talking to you again!  I just thought that since we are \nall spread out all over, it just might be something to try.  I know \nyour in CA, but I am not sure where everyone else except Frank.  \n&gt;    \n&gt;   I only have the hacked box so If we set up different boxes at \ndifferent times, we would have to see who has what and when everyone \nis available.  \n&gt;    \n&gt;   I would be more than happy to help with this exercise.  Do you \nthink it would matter if all our communication is different?\n&gt;    \n&gt;   I would be excited to see all of the Frank&#39;s Box users do a test \nand well as a combination of boxes.  I think it would make for some \nexciting EVP and confirmation that the other planes just may \ncommunication regardless of time, space and location.\n&gt; \n&gt; psi_research &lt;vilhellm@...&gt; wrote:\n&gt;           Some members of the Big Circle at the AA-EVP do this. \nGood idea \n&gt; Julie. I seem to get a similar voice in a number of sessions that I \n&gt; guess could be considered my counter part. _Bill\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, bruce halliday \n&gt; &lt;paranormalinvestigating@&gt; wrote:\n&gt; &gt;\n&gt; &gt; \n&gt; &gt; hey,\n&gt; &gt; \n&gt; &gt; what you are suggesting was at one time and sometimes still is \n&gt; practiced by evp researchers.\n&gt; &gt; It is called a combined session and it actually serves to enhance \n&gt; communication by supplying\n&gt; &gt; a collective energy. It is a splendid idea and you should post an \n&gt; agenda on the group and give \n&gt; &gt; anyone who is interested an opportunity to be involved in the \ngroup \n&gt; session.\n&gt; &gt; \n&gt; &gt; I have not heard of this method being experimented with as far as \n&gt; box research goes\n&gt; &gt; just with traditional evp.\n&gt; &gt; \n&gt; &gt; And yes your assumption about having guide spirits assigned to us \n&gt; as individual researchers\n&gt; &gt; is very much correct. My techs are Mike & Lisa whom I communicate \n&gt; with on a daily basis\n&gt; &gt; My research friend and partner Steve hultay also has the same two \n&gt; spirit guides and or technicians \n&gt; &gt; assigned to him. probably because our research always coincides \nand \n&gt; is interwoven with each other\n&gt; &gt; I guess they decided to save spirit work load and assign the same \n&gt; tech&#39;s to both of us.\n&gt; &gt; \n&gt; &gt; If you decide to organise the group session count me in.\n&gt; &gt; \n&gt; &gt; Bruce\n&gt; &gt; \n&gt; &gt; Bruce Halliday Paranormal Investigating Team \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; To: EVP-ITC@: ghostchasingfool@: Wed, 5 Dec 2007 23:58:01 \n&gt; +0000Subject: [EVP-ITC] Just wondering\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; Guys, I have just be wondering if anyone has tried experimenting \n&gt; with running session at the same time in different locations with \nthe \n&gt; same boxes?I was curious if in fact even though the frequencies \nwould \n&gt; be different depending our your area, if in fact some of the same \n&gt; voices would come through to each of you.It was just a thought? In \nmy \n&gt; testing sessions I am coming to find out that they certainly know \nall \n&gt; of you, Frank, Bruce, Mike, etc.. for your names seem to be coming \n&gt; up. Therefore, I wonder if you all have so called &quot;personal \n&gt; assistants&quot; or &quot;tecs&quot; assiged to you or if they are random? \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; __________________________________________________________\n&gt; &gt; Connect and share in new ways with Windows Live.\n&gt; &gt; http://www.windowslive.com/connect.html?\n&gt; ocid=TXT_TAGLM_Wave2_newways_112007\n&gt; &gt;\n&gt; \n&gt; \n&gt; \n&gt;                          \n&gt; \n&gt; \n&gt;   The contents of this eletronic correspondence is private & \nconfidential and meant only for the party and/or parties it is \naddressed to.  \n&gt;    \n&gt;   No part of this email transmission may be publicly posted or \nforwarded to other parties without explicit written permission.\n&gt;"}