{"id": "3960", "subject": "EVP and History (Was: Re: [EVP-ITC] Re: Comments for Bruce)", "author": "Lisby", "timestamp": "2007-12-06T19:13:38Z", "full_text": "I have done this myself and heard EVP from many historic sites that  \nseem to relate directly to the events that happened there. I&#39;ve heard  \nmultiple session tapes from Chris Moon using the box Frank gave him,  \nrecorded at various sites such as school dorms, Eastern State prison,  \netc., and the messages that come through seem to be consistent with  \nthe kinds of inhabitants one would expect. When I get my mini, I am  \ngoing to take to sites such as Antietam and see what comes through.\n\nIf you want, Juli, I can try to send you some links of interesting  \nEVP samples I have heard that were captured within a historic context.\n\nAnn\n\n\nOn Dec 6, 2007, at 12:56 PM, juli velazquez wrote:\n\n&gt;\n&gt; Anne, I was wondering if you or the others could shed some light on  \n&gt; validations received.  I have been conducting conventional EVP for  \n&gt; sometime now and have utilized it for many areas.  I believe that  \n&gt; (and this is only my theory) that you can capture EVP anywhere  \n&gt; using just a regular recorder.  In doing historical research on the  \n&gt; answers provided by the other side, I have in some cases been able  \n&gt; to validate the responses given using the conventional method,  \n&gt; backing it up with periodicals.   Since I have only conducted 2  \n&gt; test sessions with the hacked, I was curious as to those have been  \n&gt; doing this for a while been able to confirm some of responses  \n&gt; received?  I know Bruce confirmed that the other side knew what  \n&gt; they where doing by cleaning out his daughters room, but I was  \n&gt; curious as to historical facts or things of importance.\n&gt;\n&gt; The reason why I am asking is the first 2 sessions I asked direct  \n&gt; questions pertaining to reports I had which was confirmed and never  \n&gt; expected to received the responses I did in detail knowing that  \n&gt; they were in fact true.  Have you or anyone ran any experiments in  \n&gt; their sessions to see if they are consistent in proving facts or  \n&gt; predictions that have come true?\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Lisby &lt;lisby@...&gt; wrote:\n&gt; My life as a journalist has shown me this in spades. I guess we  \n&gt; can&#39;t really be surprised if the dead are a bit dodgy, too, can we?\n&gt;\n&gt;\n&gt;\n&gt; Ann\n&gt;\n&gt; On Dec 6, 2007, at 11:54 AM, juli velazquez wrote:\n&gt;\n&gt;&gt; your 100% right, lol\n&gt;&gt;\n&gt;&gt; Lisby &lt;lisby@...&gt; wrote:\n&gt;&gt; Most living humans do that, too. ;)\n&gt;&gt;\n&gt;&gt; Ann\n&gt;&gt;\n&gt;&gt; On Dec 6, 2007, at 10:54 AM, juli velazquez wrote:\n&gt;&gt;\n&gt;&gt;&gt; I am coming to notice also that if you do not address a direct  \n&gt;&gt;&gt; question, they seem to dance around giving you an answer.\n&gt;&gt;&gt;\n&gt;&gt;&gt; Lisby &lt;lisby@earthlink.net&gt; wrote:\n&gt;&gt;&gt; I&#39;m not so much worried about whether there are other types of  \n&gt;&gt;&gt; entities out there trying to communicate as I am annoyed if they  \n&gt;&gt;&gt; get in the way of the entities I really want to communicate with.  \n&gt;&gt;&gt; As you may have notices from the previous discussion, I don&#39;t  \n&gt;&gt;&gt; tend to worry about negative forces. I worry more about simple  \n&gt;&gt;&gt; human/nonhuman identity thieves. Hell, Lance--it&#39;s all in the  \n&gt;&gt;&gt; phrasing, isn&#39;t? If I want to hear from my Nanny, I&#39;d like it to  \n&gt;&gt;&gt; be my Nanny, thank you very much. And woe betide any alien/idiot  \n&gt;&gt;&gt; human/whatever who tries to mess with me. ;)\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt; Ann\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt; On Dec 6, 2007, at 1:11 AM, Lance Oliver wrote:\n&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; Hey Ann,\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; I&#39;m totally on the same page about finding out the truth,  \n&gt;&gt;&gt;&gt; whatever it\n&gt;&gt;&gt;&gt; may be. I know there are tricksters. Native Americans call them\n&gt;&gt;&gt;&gt; Coyote or Skinwalkers.\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; From the clear voices and degree of two-way dialog, for me it&#39;s\n&gt;&gt;&gt;&gt; simply about getting straight answers. I&#39;m planning to try and be\n&gt;&gt;&gt;&gt; rigorous about testing any spirits or whatever they are before\n&gt;&gt;&gt;&gt; proceeding. The last thing I wish to do is entertain some demon or\n&gt;&gt;&gt;&gt; entity that is all about lying and half-truths.\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; Lance\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;&gt; --- In EVP-ITC@yahoogroups.com, Lisby &lt;lisby@...&gt; wrote:\n&gt;&gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt; &gt; But it must raise questions, mustn&#39;t it, Bruce? Who are these\n&gt;&gt;&gt;&gt; &gt; entities we are talking to and why would it be such a problem for\n&gt;&gt;&gt;&gt; us\n&gt;&gt;&gt;&gt; &gt; to know who they were in life? If these are dead humans, it can&#39;t\n&gt;&gt;&gt;&gt; see\n&gt;&gt;&gt;&gt; &gt; how it would make any difference at all. In fact, to me, being\n&gt;&gt;&gt;&gt; able\n&gt;&gt;&gt;&gt; &gt; to talk about human things with them is rather the only way to\n&gt;&gt;&gt;&gt; prove\n&gt;&gt;&gt;&gt; &gt; that they are dead humans. It does concern me that these entities\n&gt;&gt;&gt;&gt; are\n&gt;&gt;&gt;&gt; &gt; not human, not because I would particularly care if they were\n&gt;&gt;&gt;&gt; &gt; extraterrestrial or extradimentional and just admitted that, but\n&gt;&gt;&gt;&gt; &gt; because my personal desire is to talk to people like me who have\n&gt;&gt;&gt;&gt; &gt; crossed over.\n&gt;&gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt; &gt; Can you ask them to give you some sort of reason why they can&#39;t\n&gt;&gt;&gt;&gt; tell\n&gt;&gt;&gt;&gt; &gt; you more about themselves?\n&gt;&gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt; &gt; Well, my 2 cents. I know that my line of inquiry with the box is\n&gt;&gt;&gt;&gt; &gt; going to be directed at people who have crossed. Maybe I&#39;ll get\n&gt;&gt;&gt;&gt; some\n&gt;&gt;&gt;&gt; &gt; answers of my own shortly.\n&gt;&gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt; &gt; Ann\n&gt;&gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt; &gt; On Dec 5, 2007, at 7:44 PM, bruce halliday wrote:\n&gt;&gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt; &gt; &gt; Ann,\n&gt;&gt;&gt;&gt; &gt; &gt;\n&gt;&gt;&gt;&gt; &gt; &gt; What I get from mike & Lisa when I ask personal questions about\n&gt;&gt;&gt;&gt; &gt; &gt; them is a reluctant answer at best.\n&gt;&gt;&gt;&gt; &gt; &gt; I have already thought to ask all of the questions you mention\n&gt;&gt;&gt;&gt; and\n&gt;&gt;&gt;&gt; &gt; &gt; more and have been answered with\n&gt;&gt;&gt;&gt; &gt; &gt; &quot;NO&quot; &quot;can&#39;t&quot; and things like &quot;Wait&quot; so I&#39;m assuming that they\n&gt;&gt;&gt;&gt; are\n&gt;&gt;&gt;&gt; &gt; &gt; either not allowed or are not ready for me to find\n&gt;&gt;&gt;&gt; &gt; &gt; out about their physical lives. I also get the impression that\n&gt;&gt;&gt;&gt; they\n&gt;&gt;&gt;&gt; &gt; &gt; want to remain as separate entities in my mind\n&gt;&gt;&gt;&gt; &gt; &gt; and if I where to know who and what they where in the physical\n&gt;&gt;&gt;&gt; it\n&gt;&gt;&gt;&gt; &gt; &gt; would reduce them to a lower level of spirituality\n&gt;&gt;&gt;&gt; &gt; &gt; in my mind. that is the general jist of the messages as far as\n&gt;&gt;&gt;&gt; that\n&gt;&gt;&gt;&gt; &gt; &gt; subject goes.\n&gt;&gt;&gt;&gt; &gt; &gt;\n&gt;&gt;&gt;&gt; &gt; &gt; Bruce\n&gt;&gt;&gt;&gt; &gt; &gt;\n&gt;&gt;&gt;&gt; &gt; &gt;\n&gt;&gt;&gt;&gt; &gt; &gt;\n&gt;&gt;&gt;&gt; &gt; &gt; Bruce Halliday\n&gt;&gt;&gt;&gt; &gt; &gt; Paranormal Investigating Team\n&gt;&gt;&gt;&gt; &gt; &gt;\n&gt;&gt;&gt;&gt; &gt; &gt;\n&gt;&gt;&gt;&gt; &gt; &gt;\n&gt;&gt;&gt;&gt; &gt; &gt; To: EVP-ITC@yahoogroups.com\n&gt;&gt;&gt;&gt; &gt; &gt; From: lisby@...\n&gt;&gt;&gt;&gt; &gt; &gt; Date: Wed, 5 Dec 2007 19:06:23 -0500\n&gt;&gt;&gt;&gt; &gt; &gt; Subject: [EVP-ITC] Comments for Bruce\n&gt;&gt;&gt;&gt; &gt; &gt;\n&gt;&gt;&gt;&gt; &gt; &gt; Rambling thoughts:\n&gt;&gt;&gt;&gt; &gt; &gt;\n&gt;&gt;&gt;&gt; &gt; &gt; The sound quality was not as good with this batch. Lots more\n&gt;&gt;&gt;&gt; &gt; &gt; background. Did you change anything?\n&gt;&gt;&gt;&gt; &gt; &gt;\n&gt;&gt;&gt;&gt; &gt; &gt; Okay--I am completely fascinated with who these people are who\n&gt;&gt;&gt;&gt; talk\n&gt;&gt;&gt;&gt; &gt; &gt; to us. I have two, both male, and god knows who they really  \n&gt;&gt;&gt;&gt; are,\n&gt;&gt;&gt;&gt; &gt; &gt; because one has changed identity at least six times over the\n&gt;&gt;&gt;&gt; years,\n&gt;&gt;&gt;&gt; &gt; &gt; and one won&#39;t tell anything at all about himself. Period.  \n&gt;&gt;&gt;&gt; Oh, he\n&gt;&gt;&gt;&gt; says\n&gt;&gt;&gt;&gt; &gt; &gt; that he won&#39;t talk through the box either. I&#39;m tempted to  \n&gt;&gt;&gt;&gt; add, &quot;So\n&gt;&gt;&gt;&gt; &gt; &gt; there&quot; as a direct quote. LOL. Anyway, Mike and Lisa-- So Mike\n&gt;&gt;&gt;&gt; says\n&gt;&gt;&gt;&gt; &gt; &gt; he bled to death in &#39;95; Lisa choked to death in the 1920s and\n&gt;&gt;&gt;&gt; nuts\n&gt;&gt;&gt;&gt; &gt; &gt; to you for asking, apparently. ;)\n&gt;&gt;&gt;&gt; &gt; &gt;\n&gt;&gt;&gt;&gt; &gt; &gt; Would you ask them some questions for me?\n&gt;&gt;&gt;&gt; &gt; &gt;\n&gt;&gt;&gt;&gt; &gt; &gt; Ask Mike which &#39;95 he died in--1995 or 1895?\n&gt;&gt;&gt;&gt; &gt; &gt;\n&gt;&gt;&gt;&gt; &gt; &gt; Ask Lisa what her favorite perfume was.\n&gt;&gt;&gt;&gt; &gt; &gt;\n&gt;&gt;&gt;&gt; &gt; &gt; Ask them both more biographical questions, such as where the  \n&gt;&gt;&gt;&gt; were\n&gt;&gt;&gt;&gt; &gt; &gt; born, lived, and died. Their full names. Their spouses&#39; names,\n&gt;&gt;&gt;&gt; kids,\n&gt;&gt;&gt;&gt; &gt; &gt; etc. I&#39;m a historian/geneologist and I think it would be a  \n&gt;&gt;&gt;&gt; blast\n&gt;&gt;&gt;&gt; to\n&gt;&gt;&gt;&gt; &gt; &gt; look in available records to try to identify them.\n&gt;&gt;&gt;&gt; &gt; &gt;\n&gt;&gt;&gt;&gt; &gt; &gt; Ask them the year of their birth. If they tell you, there&#39;s  \n&gt;&gt;&gt;&gt; a lot\n&gt;&gt;&gt;&gt; of\n&gt;&gt;&gt;&gt; &gt; &gt; historical questions I love to ask about events within their\n&gt;&gt;&gt;&gt; &gt; &gt; lifetimes.\n&gt;&gt;&gt;&gt; &gt; &gt;\n&gt;&gt;&gt;&gt; &gt; &gt; Ann\n&gt;&gt;&gt;&gt; &gt; &gt;\n&gt;&gt;&gt;&gt; &gt; &gt;\n&gt;&gt;&gt;&gt; &gt; &gt; Connect and share in new ways with Windows Live. Connect now!\n&gt;&gt;&gt;&gt; &gt; &gt;\n&gt;&gt;&gt;&gt; &gt; &gt;\n&gt;&gt;&gt;&gt; &gt;\n&gt;&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt; The contents of this eletronic correspondence is private &  \n&gt;&gt;&gt; confidential and meant only for the party and/or parties it is  \n&gt;&gt;&gt; addressed to.\n&gt;&gt;&gt;\n&gt;&gt;&gt; No part of this email transmission may be publicly posted or  \n&gt;&gt;&gt; forwarded to other parties without explicit written permission.\n&gt;&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; The contents of this eletronic correspondence is private &  \n&gt;&gt; confidential and meant only for the party and/or parties it is  \n&gt;&gt; addressed to.\n&gt;&gt;\n&gt;&gt; No part of this email transmission may be publicly posted or  \n&gt;&gt; forwarded to other parties without explicit written permission.\n&gt;&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; The contents of this eletronic correspondence is private &  \n&gt; confidential and meant only for the party and/or parties it is  \n&gt; addressed to.\n&gt;\n&gt; No part of this email transmission may be publicly posted or  \n&gt; forwarded to other parties without explicit written permission.\n&gt;\n&gt; \n\n\nI ha e done his mysel and hea d EVP om many his o ic si es ha seem o ela e di ec ly o he e en s ha happened he e. I' e hea d mul iple session apes om Ch is Moon using he box F ank ga e him, eco ded a a ious si es such as school do ms, Eas e n S a e p ison, e c., and he messages ha come h ough seem o be consis en wi h he kinds o inhabi an s one would expec . When I ge my mini, I am going o ake o si es such as An ie am and see wha comes h ough.I you wan , Juli, I can y o send you some links o in e es ing EVP samples I ha e hea d ha we e cap u ed wi hin a his o ic con ex .AnnOn Dec 6, 2007, a 12:56 PM, juli elazquez w o e:Anne, I was wonde ing i you o he o he s could shed some ligh on alida ions ecei ed.  I ha e been conduc ing con en ional EVP o some ime now and ha e u ilized i o many a eas.  I belie e ha (and his is only my heo y) ha you can cap u e EVP anywhe e using jus a egula eco de .  In doing his o ical esea ch on he answe s p o ided by he o he side, I ha e in some cases been able o alida e he esponses gi en using he con en ional me hod, backing i up wi h pe iodicals.   Since I ha e only conduc ed 2 es sessions wi h he hacked, I was cu ious as o hose ha e been doing his o a while been able o con i m some o esponses ecei ed?  I know B uce con i med ha he o he side knew wha hey whe e doing by cleaning ou his daugh e s oom, bu I was cu ious as o his o ical ac s o hings o impo ance. The eason why I am asking is he i s 2 sessions I asked di ec ques ions pe aining o epo s I had which was con i med and ne e expec ed o ecei ed he esponses I did in de ail knowing ha hey we e in ac ue.  Ha e you o anyone an any expe imen s in hei sessions o see i hey a e consis en in p o ing ac s o p edic ions ha ha e come ue?  Lisby ne > w o e:My li e as a jou nalis has shown me his in spades. I guess we can' eally be su p ised i he dead a e a bi dodgy, oo, can we?AnnOn Dec 6, 2007, a 11:54 AM, juli elazquez w o e:you 100% igh , lolLisby ne > w o e:Mos li ing humans do ha , oo. ;)AnnOn Dec 6, 2007, a 10:54 AM, juli elazquez w o e:I am coming o no ice also ha i you do no add ess a di ec ques ion, hey seem o dance a ound gi ing you an answe .Lisby ne > w o e:I'm no so much wo ied abou whe he he e a e o he ypes o en i ies ou he e ying o communica e as I am annoyed i hey ge in he way o he en i ies I eally wan o communica e wi h. As you may ha e no ices om he p e ious discussion, I don' end o wo y abou nega i e o ces. I wo y mo e abou simple human/nonhuman iden i y hie es. Hell, Lance--i 's all in he ph asing, isn' ? I I wan o hea om my Nanny, I'd like i o be my Nanny, hank you e y much. And woe be ide any alien/idio human/wha e e who ies o mess wi h me. ;)AnnOn Dec 6, 2007, a 1:11 AM, Lance Oli e w o e:Hey Ann,I'm o ally on he same page abou inding ou he u h, wha e e i  may be. I know he e a e icks e s. Na i e Ame icans call hem Coyo e o Skinwalke s. F om he clea oices and deg ee o wo-way dialog, o me i 's simply abou ge ing s aigh answe s. I'm planning o y and be  igo ous abou es ing any spi i s o wha e e hey a e be o e p oceeding. The las hing I wish o do is en e ain some demon o  en i y ha is all abou lying and hal - u hs.Lance--- In EVP-ITC@yahoog oups.com, Lisby w o e:>> > Bu i mus aise ques ions, mus n' i , B uce? Who a e hese > en i ies we a e alking o and why would i be such a p oblem o  us > o know who hey we e in li e? I hese a e dead humans, i can'  see > how i would make any di e ence a all. In ac , o me, being able > o alk abou human hings wi h hem is a he he only way o p o e > ha hey a e dead humans. I does conce n me ha hese en i ies a e > no human, no because I would pa icula ly ca e i hey we e > ex a e es ial o ex adimen ional and jus admi ed ha , bu  > because my pe sonal desi e is o alk o people like me who ha e > c ossed o e .> > Can you ask hem o gi e you some so o eason why hey can'   ell > you mo e abou hemsel es?> > Well, my 2 cen s. I know ha my line o inqui y wi h he box is > going o be di ec ed a people who ha e c ossed. Maybe I'll ge  some > answe s o my own sho ly.> > Ann> > > On Dec 5, 2007, a 7:44 PM, b uce halliday w o e:> > > Ann,> >> > Wha I ge om mike & Lisa when I ask pe sonal ques ions abou  > > hem is a eluc an answe a bes .> > I ha e al eady hough o ask all o he ques ions you men ion and > > mo e and ha e been answe ed wi h> > \"NO\" \"can' \" and hings like \"Wai \" so I'm assuming ha hey a e > > ei he no allowed o a e no eady o me o ind> > ou abou hei physical li es. I also ge he imp ession ha   hey > > wan o emain as sepa a e en i ies in my mind> > and i I whe e o know who and wha hey whe e in he physical i  > > would educe hem o a lowe le el o spi i uali y> > in my mind. ha is he gene al jis o he messages as a as  ha  > > subjec goes.> >> > B uce> >> >> >> > B uce Halliday> > Pa ano mal In es iga ing Team> >> >> >> > To: EVP-ITC@yahoog oups.com> > F om: lisby@...> > Da e: Wed, 5 Dec 2007 19:06:23 -0500> > Subjec : [EVP-ITC] Commen s o B uce> >> > Rambling hough s:> >> > The sound quali y was no as good wi h his ba ch. Lo s mo e> > backg ound. Did you change any hing?> >> > Okay--I am comple ely ascina ed wi h who hese people a e who  alk> > o us. I ha e wo, bo h male, and god knows who hey eally a e,> > because one has changed iden i y a leas six imes o e he yea s,> > and one won' ell any hing a all abou himsel . Pe iod. Oh, he says> > ha he won' alk h ough he box ei he . I'm emp ed o add, \"So> > he e\" as a di ec quo e. LOL. Anyway, Mike and Lisa-- So Mike says> > he bled o dea h in '95; Lisa choked o dea h in he 1920s and nu s> > o you o asking, appa en ly. ;)> >> > Would you ask hem some ques ions o me?> >> > Ask Mike which '95 he died in--1995 o 1895?> >> > Ask Lisa wha he a o i e pe ume was.> >> > Ask hem bo h mo e biog aphical ques ions, such as whe e he we e> > bo n, li ed, and died. Thei ull names. Thei spouses' names, kids,> > e c. I'm a his o ian/geneologis and I hink i would be a blas   o> > look in a ailable eco ds o y o iden i y hem.> >> > Ask hem he yea o hei bi h. I hey ell you, he e's a lo  o > > his o ical ques ions I lo e o ask abou e en s wi hin hei  > > li e imes.> >> > Ann> >> >> > Connec and sha e in new ways wi h Windows Li e. Connec now!> >> >>The con en s o his ele onic co espondence is p i a e & con iden ial and mean only o he pa y and/o pa ies i is add essed o.  No pa o his email ansmission may be publicly pos ed o o wa ded o o he pa ies wi hou explici w i en pe mission.The con en s o his ele onic co espondence is p i a e & con iden ial and mean only o he pa y and/o pa ies i is add essed o.  No pa o his email ansmission may be publicly pos ed o o wa ded o o he pa ies wi hou explici w i en pe mission.The con en s o his ele onic co espondence is p i a e & con iden ial and mean only o he pa y and/o pa ies i is add essed o.  No pa o his email ansmission may be publicly pos ed o o wa ded o o he pa ies wi hou explici w i en pe mission."}