{"id": "3965", "subject": "Re: Comments for Bruce", "author": "Lance Oliver", "timestamp": "2007-12-06T19:57:53Z", "full_text": "So what&#39;s your gut telling you about that, Juli?\n\nThanks,\nLance\n\n--- In EVP-ITC@yahoogroups.com, juli velazquez &lt;ghostchasingfool@...&gt; \nwrote:\n&gt;\n&gt; I am coming to notice also that if you do not address a direct \nquestion, they seem to dance around giving you an answer.\n&gt; \n&gt; Lisby &lt;lisby@...&gt; wrote:          I&#39;m not so much worried about \nwhether there are other types of entities out there trying to \ncommunicate as I am annoyed if they get in the way of the entities I \nreally want to communicate with. As you may have notices from the \nprevious discussion, I don&#39;t tend to worry about negative forces. I \nworry more about simple human/nonhuman identity thieves. Hell, Lance--\nit&#39;s all in the phrasing, isn&#39;t? If I want to hear from my Nanny, I&#39;d \nlike it to be my Nanny, thank you very much. And woe betide any \nalien/idiot human/whatever who tries to mess with me. ;)  \n&gt;   \n&gt; \n&gt;   Ann\n&gt;   \n&gt; \n&gt;   \n&gt;     On Dec 6, 2007, at 1:11 AM, Lance Oliver wrote:\n&gt; \n&gt;           Hey Ann,\n&gt; \n&gt; I&#39;m totally on the same page about finding out the truth, whatever \nit \n&gt; may be. I know there are tricksters. Native Americans call them \n&gt; Coyote or Skinwalkers. \n&gt; \n&gt; From the clear voices and degree of two-way dialog, for me it&#39;s \n&gt; simply about getting straight answers. I&#39;m planning to try and be \n&gt; rigorous about testing any spirits or whatever they are before \n&gt; proceeding. The last thing I wish to do is entertain some demon or \n&gt; entity that is all about lying and half-truths.\n&gt; \n&gt; Lance\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Lisby &lt;lisby@&gt; wrote:\n&gt; &gt;\n&gt; &gt; \n&gt; &gt; But it must raise questions, mustn&#39;t it, Bruce? Who are these \n&gt; &gt; entities we are talking to and why would it be such a problem for \n&gt; us \n&gt; &gt; to know who they were in life? If these are dead humans, it can&#39;t \n&gt; see \n&gt; &gt; how it would make any difference at all. In fact, to me, being \n&gt; able \n&gt; &gt; to talk about human things with them is rather the only way to \n&gt; prove \n&gt; &gt; that they are dead humans. It does concern me that these entities \n&gt; are \n&gt; &gt; not human, not because I would particularly care if they were \n&gt; &gt; extraterrestrial or extradimentional and just admitted that, but \n&gt; &gt; because my personal desire is to talk to people like me who have \n&gt; &gt; crossed over.\n&gt; &gt; \n&gt; &gt; Can you ask them to give you some sort of reason why they can&#39;t \n&gt; tell \n&gt; &gt; you more about themselves?\n&gt; &gt; \n&gt; &gt; Well, my 2 cents. I know that my line of inquiry with the box is \n&gt; &gt; going to be directed at people who have crossed. Maybe I&#39;ll get \n&gt; some \n&gt; &gt; answers of my own shortly.\n&gt; &gt; \n&gt; &gt; Ann\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; On Dec 5, 2007, at 7:44 PM, bruce halliday wrote:\n&gt; &gt; \n&gt; &gt; &gt; Ann,\n&gt; &gt; &gt;\n&gt; &gt; &gt; What I get from mike & Lisa when I ask personal questions about \n&gt; &gt; &gt; them is a reluctant answer at best.\n&gt; &gt; &gt; I have already thought to ask all of the questions you mention \n&gt; and \n&gt; &gt; &gt; more and have been answered with\n&gt; &gt; &gt; &quot;NO&quot; &quot;can&#39;t&quot; and things like &quot;Wait&quot; so I&#39;m assuming that they \n&gt; are \n&gt; &gt; &gt; either not allowed or are not ready for me to find\n&gt; &gt; &gt; out about their physical lives. I also get the impression that \n&gt; they \n&gt; &gt; &gt; want to remain as separate entities in my mind\n&gt; &gt; &gt; and if I where to know who and what they where in the physical \n&gt; it \n&gt; &gt; &gt; would reduce them to a lower level of spirituality\n&gt; &gt; &gt; in my mind. that is the general jist of the messages as far as \n&gt; that \n&gt; &gt; &gt; subject goes.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Bruce\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; Bruce Halliday\n&gt; &gt; &gt; Paranormal Investigating Team\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; To: EVP-ITC@yahoogroups.com\n&gt; &gt; &gt; From: lisby@\n&gt; &gt; &gt; Date: Wed, 5 Dec 2007 19:06:23 -0500\n&gt; &gt; &gt; Subject: [EVP-ITC] Comments for Bruce\n&gt; &gt; &gt;\n&gt; &gt; &gt; Rambling thoughts:\n&gt; &gt; &gt;\n&gt; &gt; &gt; The sound quality was not as good with this batch. Lots more\n&gt; &gt; &gt; background. Did you change anything?\n&gt; &gt; &gt;\n&gt; &gt; &gt; Okay--I am completely fascinated with who these people are who \n&gt; talk\n&gt; &gt; &gt; to us. I have two, both male, and god knows who they really are,\n&gt; &gt; &gt; because one has changed identity at least six times over the \n&gt; years,\n&gt; &gt; &gt; and one won&#39;t tell anything at all about himself. Period. Oh, \nhe \n&gt; says\n&gt; &gt; &gt; that he won&#39;t talk through the box either. I&#39;m tempted to \nadd, &quot;So\n&gt; &gt; &gt; there&quot; as a direct quote. LOL. Anyway, Mike and Lisa-- So Mike \n&gt; says\n&gt; &gt; &gt; he bled to death in &#39;95; Lisa choked to death in the 1920s and \n&gt; nuts\n&gt; &gt; &gt; to you for asking, apparently. ;)\n&gt; &gt; &gt;\n&gt; &gt; &gt; Would you ask them some questions for me?\n&gt; &gt; &gt;\n&gt; &gt; &gt; Ask Mike which &#39;95 he died in--1995 or 1895?\n&gt; &gt; &gt;\n&gt; &gt; &gt; Ask Lisa what her favorite perfume was.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Ask them both more biographical questions, such as where the \nwere\n&gt; &gt; &gt; born, lived, and died. Their full names. Their spouses&#39; names, \n&gt; kids,\n&gt; &gt; &gt; etc. I&#39;m a historian/geneologist and I think it would be a \nblast \n&gt; to\n&gt; &gt; &gt; look in available records to try to identify them.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Ask them the year of their birth. If they tell you, there&#39;s a \nlot \n&gt; of\n&gt; &gt; &gt; historical questions I love to ask about events within their \n&gt; &gt; &gt; lifetimes.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Ann\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; Connect and share in new ways with Windows Live. Connect now!\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;   \n&gt; \n&gt;                          \n&gt; \n&gt; \n&gt;   The contents of this eletronic correspondence is private & \nconfidential and meant only for the party and/or parties it is \naddressed to.  \n&gt;    \n&gt;   No part of this email transmission may be publicly posted or \nforwarded to other parties without explicit written permission.\n&gt;"}