{"id": "3967", "subject": "Re: New: Gainesville House EVPs!", "author": "Lance Oliver", "timestamp": "2007-12-06T20:16:16Z", "full_text": "Hi Ann,\n\nI guess a bit of explaining is called for. First off, the EVPs I \nuploaded to Filecrunch are there and in good working order. That site \noffers free uploads and downloads sometime too big for Yahoo, but \nthere is a trick to using it.\n\nAfter you click on the link to my page there, click on a file name \nyou wish to download. The following page has a 10 second delay before \nthey&#39;ll allow you to download. Just scroll down the page, and when \nyou see the Download Now, click and away you go...\n\nThanks for reminding me to clarify that!\n\nLance\n\n\n--- In EVP-ITC@yahoogroups.com, Lisby &lt;lisby@...&gt; wrote:\n&gt;\n&gt; I&#39;d really like to listen to these, but when I try to open them, I  \n&gt; get nothing at all. Can you upload them to our files or just \nattach  \n&gt; them to e-mail or both?\n&gt; \n&gt; \n&gt; On Dec 6, 2007, at 12:45 AM, Lance Oliver wrote:\n&gt; \n&gt; &gt; Good Evening!\n&gt; &gt;\n&gt; &gt; I&#39;ve been very busy today going through a long, intense audio\n&gt; &gt; recording taken at the Gainesville, Texas house, which my team\n&gt; &gt; investigated on Sunday, November 25th.\n&gt; &gt;\n&gt; &gt; All of the EVPs I just posted were gathered in the unoccupied\n&gt; &gt; upstairs bedroom. Only three investigators were present in the \nroom.\n&gt; &gt; Their voices have been properly taken into account and ruled out \nas\n&gt; &gt; sources of the actual EVPs.\n&gt; &gt;\n&gt; &gt; The new and resampled EVPs have been saved as .mp3 files. They \ncan be\n&gt; &gt; freely downloaded from the site here -\n&gt; &gt;\n&gt; &gt; http://www.filecrunch.com/user/orbhunterx\n&gt; &gt;\n&gt; &gt; You will hear quite a few odd words, dog barks, and even mimicry.\n&gt; &gt; Some of the voices are faint and whispery. Other EVP voices sound\n&gt; &gt; like the invisibles are standing right along side the researchers!\n&gt; &gt;\n&gt; &gt; Sexual Content Warning:\n&gt; &gt;\n&gt; &gt; Several of the EVPs have strong sexual content.\n&gt; &gt;\n&gt; &gt; Please read the file name prior to downloading.\n&gt; &gt;\n&gt; &gt; Listening to the EVPs will be at your own disgression.\n&gt; &gt;\n&gt; &gt; That stated, those that choose to listen to the EVPs, please let \nme\n&gt; &gt; know if any of them need further contextual clarification. I look\n&gt; &gt; forward to hearing feedback. As it stands, the true nature of \nwhat&#39;s\n&gt; &gt; going on in the house awaits much more serious attention.\n&gt; &gt;\n&gt; &gt; Sincerely,\n&gt; &gt; Lance Oliver, Founder\n&gt; &gt; Denton Area Paranormal Society\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt;"}