{"id": "4037", "subject": "Re: hey Mike", "author": "M.A. Coletta (Mike)", "timestamp": "2007-12-08T13:43:44Z", "full_text": "Hi Misty,\n\nHey... thanks for the kind words about the videos!  I just wanted to \nhelp get the information out there so people can had an affordable \nmethod of experimenting with some different ghost box functionality \ndevices.\n\nNo, Bruce, Steve, and I are not working together per-say unless you \ncall everyone trying to see what we can all come up with in this \nfield, is working together. I guess we are all working together using \nthat definition, huh?  I just write to them on occassion.\n\nI see you may already have been given access to the REG podcast, \nbased on another post.  Let me know if that&#39;s not the case.\n\nOrlando!  That is where I fly into, then I drive to Cocoa Beach.\nDidn&#39;t get to see the shutle take-off though... cause they postponed \nit and I had to get back.  Then I get to Denver, they cancel all \nflights to Colorado Springs because of weather, so we take a taxi \nback to the Springs, but my luggage is still in Denver.  I hope I get \nto see it someday... I had some new clothes in there!!!\n\nSorry your 12-470 radio ended up that way.  Those wires are easy \ntargets of getting snipped while closing the case.  They should use \nconectors for all that, but I guess that would be too expensive since \nthey mass produce them.\n\nHave a great day!\n- Mike\n\n--- In EVP-ITC@yahoogroups.com, Misty Dawn &lt;bulletbabea@...&gt; wrote:\n&gt;\n&gt; yep workin together gets alot more accomplished =)\n&gt;    \n&gt;   Hey Mike did you happen to get the podcast of rosemary I tried to \ncatch it but forgot til it was too late so when i turned it on it was \non the next guys. Then tonight they replay it so I was going to play \nit at work but can ya believe the dang radio there does not dial down \nlow enough to hit 540 wfla. So came home flipped it on anad again i \njust missed her LOL.\n&gt;    \n&gt;   I should get a membership there i listen enough but I havent yet.\n&gt;    \n&gt;   Oh and I did your 470 hack...great video like I said I felt I \ncould do it and I DID do it. Hacked the radio no problem its scanning \nas it should be, but in process of taking apart and putting back \ntogether a wire popped loose and had to be taken to a friends to be \nsoldered. Got it back hiome was about to put it together again and \ntheres another long wire popped off pokin out LOL first one was to \nbattery compartment second was to speaker....\n&gt;    \n&gt;   So took that and resoldered it back on...got it home put it \ntogether turned it on and its scanning its scanning...its \nstatic...all static...no stations now LOL\n&gt;    \n&gt;   Last week when I was on the phone ordering it there were voices \nand I recorded them as I spoke on the phone to the guy and while he \nstuck me on hold. They pretty much told me dont mess with that \nmethod. Too bad I didnt hear it til after I finished ordering LOL\n&gt;    \n&gt;   Oh well. C&#39;est la vie!\n&gt;    \n&gt;   And next time you are in friggin Cocoa beach let some of us know \nwe are in Florida right down the road from there in orlando =)\n&gt;    \n&gt;   I dunno if I am gonna mess with that rs radio anymore. I am \nthinkin that they didnt approve and I screwed somethin up to help \nreinforce that notion. Maybe send it to one of you guys to poke at or \ntear apart.\n&gt;    \n&gt;   So are you and bruce and Steve workin together? I heard \nthe &quot;radio show&quot; announcement and saved the link to go back and \nlisten (need to make those suckers downloadable even if its off \nesnips or somewhere LOL) so we can play em in the car on the way \nto/from work. I clicked to save from download but it only wants to \nplay and not &quot;save as&quot;\n&gt;    \n&gt;   Great job on the videos too. Really proud of you for getting that \nout there and being so professional about it and hell you even talked \nbe into tearing one open and modifying it. I still say I did it right \nbecause it scans like it is supposed to. I just think somethin else \npopped off that wont let it pick up stations now. Worked fine before \nI touched it anyway LOL\n&gt;    \n&gt;   Ok I am done rambling now. Thats 2 questions one bout the podcast \nof REG and one on your show on steves link.\n&gt;    \n&gt;   LOL\n&gt;    \n&gt;   Misty\n&gt;"}