{"id": "4058", "subject": "Re: Mike&#39;s Box 12.470 Proto 1", "author": "M.A. Coletta (Mike)", "timestamp": "2007-12-09T03:00:44Z", "full_text": "Hi LC,\n\nThe two setups I did were:\n\n1) Three 12-469&#39;s through a mixer, mixed with white noise (performed \nwith Audacity), my voice via a microphone, and all that audio \ncaptured using a free program called &quot;Scanner Recorder&quot;. You can \ndownload it here: http://www.davee.com/scanrec/\nI have not really taken that unit anywhere to test it properly.  I \nonly did the original testing you hear on the video.\n\n2) One 12-470 placed in a &quot;chamber&quot;, with a noise generator (used \na &quot;My Lil&#39; Reminder&quot; 20 second digital recorder/player) with recorded \nwhite/pink noise I captured while in Florida.  Also inside is \na &quot;Listen Up&quot; amplified microphone and an Olympus digital recorder.\nThe only wiring is a Y-connector which connects the output from the \namplified mic to the input of the recorder, and also to ear-buds for \nlistening to what is being recorded. You can also plug a small \nspeaker into this if desired.\nThe raw audio from the linear sweep of either the AM or FM band is \nprojected from the 12-470 speaker, into the closed &quot;chamber&quot;, along \nwith the audio from the speaker of the noise generator (&quot;My Lil&#39; \nReminder&quot;) unit.  Those two sources, plus any ambient noise inside \nthe &quot;chamber&quot; is picked up by the amplified mic and fed into the \nrecorder and ear-buds. The recorder produces the .wav file.\nYou can use a 12-469 instead of the 12-470. You just need to connect \na small speker to the output of the 12-469.\n\nAs with my three 12-469 system, I have so far only done the initial \ntest run on th 12-470 system.  I hope to bring both units to a place \nwhere I can do some better experimentation.  I have 2 weeks off near \nChristmas time, so that is probably when I&#39;ll be doing that.\n\nI hope I have answered your questions, LC.\n\n- Mike\n\n--- In EVP-ITC@yahoogroups.com, &quot;LC Duplatt&quot; &lt;lcdupla@...&gt; wrote:\n&gt;\n&gt; Mike,\n&gt; \n&gt; Today I modified my Radio Shack 12-469, but have some questions.  \nIt \n&gt; was easy to do, and I instantly plugged it into my Olympus voice \n&gt; recorder and recorded off of it easily.  Now I want to pipe some \n&gt; white noise in (and ambient), as well. \n&gt; \n&gt; 1) Is the set-up in your video what has worked best for you (with \nthe \n&gt; computer and all)?\n&gt; 2) Will you tell us what free computer programs you used (I think \none \n&gt; is Audacity)?\n&gt; 3) What microphone and white noise generator did you use for your \n&gt; travel pack unit pictured on UFOGeek.com (posted on December 8th)?  \n&gt; And can you give me a layout for the wiring of it - you know, how \nit \n&gt; all hooks together?  I&#39;ll figure it out sooner or later, but I&#39;d \n&gt; rather it be sooner!\n&gt; \n&gt; Thanks, LC\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;M.A. Coletta (Mike)&quot; \n&gt; &lt;michaelcoletta@&gt; wrote:\n&gt; &gt;\n&gt; &gt; I am currently putting together another video, just like my \nothers \n&gt; &gt; showing a very practical way to use the Radio Shack Hack devices.\n&gt; &gt; You probably saw my 12-469 practical use videos, now I&#39;m going to \n&gt; be \n&gt; &gt; sharing a 12-470 practical use video.  This one is of a totally \n&gt; &gt; portable system that uses a noise generator, the hacked 12-470, a \n&gt; &gt; digital (or analog) recorder, and a microphone which gathers the \n&gt; raw \n&gt; &gt; audio sweep, white noise (or in my case a special white/pink \nnoise \n&gt; file \n&gt; &gt; I created), and any ambient noise within a chamber.. and places \n&gt; that \n&gt; &gt; session int a .wav file.  It also includes an ear piece so you \ncan \n&gt; &gt; hear, real time, what the digital recorder is recording (the \nmixer \n&gt; of \n&gt; &gt; the session sound within the chamber).\n&gt; &gt; Stay tuned for that video later today....\n&gt; &gt; \n&gt; &gt; - Mike\n&gt; &gt; All my Radio Shack Hack videos can be found at\n&gt; &gt; http://www.ufogeek.com\n&gt; &gt;\n&gt;"}