{"id": "4061", "subject": "Re: Mike&#39;s Box 12.470 Proto 1", "author": "psi_research", "timestamp": "2007-12-09T10:48:16Z", "full_text": "LC, how did you plug the 469 into your Olympus? Did you just plug the\naudio from the 469 headphone jack into the mic line in on your\nrecorder? I&#39;ve been hesitant to try this as i didn&#39;t want to to\noverload the mic in jack on my recorder. Thanks, Bill\n\n--- In EVP-ITC@yahoogroups.com, &quot;LC Duplatt&quot; &lt;lcdupla@...&gt; wrote:\n&gt;\n&gt; Mike,\n&gt; \n&gt; Today I modified my Radio Shack 12-469, but have some questions.  It \n&gt; was easy to do, and I instantly plugged it into my Olympus voice \n&gt; recorder and recorded off of it easily.  Now I want to pipe some \n&gt; white noise in (and ambient), as well. \n&gt; \n&gt; 1) Is the set-up in your video what has worked best for you (with the \n&gt; computer and all)?\n&gt; 2) Will you tell us what free computer programs you used (I think one \n&gt; is Audacity)?\n&gt; 3) What microphone and white noise generator did you use for your \n&gt; travel pack unit pictured on UFOGeek.com (posted on December 8th)?  \n&gt; And can you give me a layout for the wiring of it - you know, how it \n&gt; all hooks together?  I&#39;ll figure it out sooner or later, but I&#39;d \n&gt; rather it be sooner!\n&gt; \n&gt; Thanks, LC\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;M.A. Coletta (Mike)&quot; \n&gt; &lt;michaelcoletta@&gt; wrote:\n&gt; &gt;\n&gt; &gt; I am currently putting together another video, just like my others \n&gt; &gt; showing a very practical way to use the Radio Shack Hack devices.\n&gt; &gt; You probably saw my 12-469 practical use videos, now I&#39;m going to \n&gt; be \n&gt; &gt; sharing a 12-470 practical use video.  This one is of a totally \n&gt; &gt; portable system that uses a noise generator, the hacked 12-470, a \n&gt; &gt; digital (or analog) recorder, and a microphone which gathers the \n&gt; raw \n&gt; &gt; audio sweep, white noise (or in my case a special white/pink noise \n&gt; file \n&gt; &gt; I created), and any ambient noise within a chamber.. and places \n&gt; that \n&gt; &gt; session int a .wav file.  It also includes an ear piece so you can \n&gt; &gt; hear, real time, what the digital recorder is recording (the mixer \n&gt; of \n&gt; &gt; the session sound within the chamber).\n&gt; &gt; Stay tuned for that video later today....\n&gt; &gt; \n&gt; &gt; - Mike\n&gt; &gt; All my Radio Shack Hack videos can be found at\n&gt; &gt; http://www.ufogeek.com\n&gt; &gt;\n&gt;"}