{"id": "4064", "subject": "Re: Followup on C2C Show", "author": "Lance Oliver", "timestamp": "2007-12-09T13:12:08Z", "full_text": "I agree on both counts and hope George will want to do a longer show \nsoon.\n\nThanks Again,\nLance\n\n--- In EVP-ITC@yahoogroups.com, &quot;rosemary_guiley&quot; &lt;reguiley@...&gt; \nwrote:\n&gt;\n&gt; Thanks, Lance.  I wish we&#39;d had more time, and a better place for \nthe\n&gt; equipment.  Hopefully, there will be a followup on down the road.\n&gt; \n&gt; Rosemary\n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Lance Oliver&quot; &lt;orbhunterx@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hi Rosemary,\n&gt; &gt; \n&gt; &gt; We appreciate your insights and energetic efforts to put ITC in \nthe \n&gt; &gt; spotlight where it deserves to be.\n&gt; &gt; \n&gt; &gt; Thanks,\n&gt; &gt; Lance\n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;rosemary_guiley&quot; &lt;reguiley@&gt; \n&gt; &gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; Last night’s C2C show with George Noory on Frank’s Box \nand \n&gt; &gt; similar ITC\n&gt; &gt; &gt; devices went well despite the limitations of the broadcast \nstudio in\n&gt; &gt; &gt; Sherman Oaks, CA.  We were just too well shielded for the boxes \nto\n&gt; &gt; &gt; scan properly.  I had on hand my Frank’s Ghost Box 22, Ron \n&gt; &gt; Ricketts’\n&gt; &gt; &gt; very first Mini-Box to come out of production, the Radio Shack \nHack,\n&gt; &gt; &gt; and a Craig’s Box, a modified Daewoo car stereo done by \nCraig \n&gt; &gt; Telesha.\n&gt; &gt; &gt;  In addition, I had a gold-beryllium alloy antenna made by \nMarcus \n&gt; &gt; Leader.\n&gt; &gt; &gt; \n&gt; &gt; &gt; There’s no doubt about it, the box technologies and spirit\n&gt; &gt; &gt; communication are hot topics, and will continue to be in the\n&gt; &gt; &gt; spotlight, especially as more people are able to obtain a \ndevice. \n&gt; &gt; &gt; Hopefully, this will lay to rest the nonsense about a \n“circle \n&gt; &gt; of 30”\n&gt; &gt; &gt; or any such ridiculous claims of monopoly on who can and should \nuse\n&gt; &gt; &gt; boxes.  Box technology is already democratic.  As more people \nobtain\n&gt; &gt; &gt; and work with them, many possibilities for coordinated research \nand\n&gt; &gt; &gt; experiments will unfold.\n&gt; &gt; &gt; \n&gt; &gt; &gt; As an interdimensional interface, the boxes are neutral.  They \nare \n&gt; &gt; not\n&gt; &gt; &gt; dark, demonic, negative, etc., as some fearful people worry.  \n&gt; &gt; Negative\n&gt; &gt; &gt; experiences are always possible, just as in any work in the\n&gt; &gt; &gt; paranormal.  People who don’t know what they are doing, who \nare \n&gt; &gt; in it\n&gt; &gt; &gt; for a lark, and who harbor fears and anxieties about the \nparanormal\n&gt; &gt; &gt; are not well-suited to any kind of paranormal exploration, \nwhether\n&gt; &gt; &gt; it’s with a box, in automatic writing, or with a deck of \nTarot \n&gt; &gt; cards.\n&gt; &gt; &gt; \n&gt; &gt; &gt; Rick Moran, the executive director of the Association for the \nstudy \n&gt; &gt; of\n&gt; &gt; &gt; Unexplained Phenomena, the sponsors of the research for the \nMini-\n&gt; &gt; Box,\n&gt; &gt; &gt; shared some observations with me after the show that illuminate \nthe\n&gt; &gt; &gt; topic.  Here are his comments:\n&gt; &gt; &gt; \n&gt; &gt; &gt; There is a connection between every one of the \ndesigners/technicians\n&gt; &gt; &gt; who have worked on the box from its inception by Spiricom. \nEvery one\n&gt; &gt; &gt; of them was a licensed Ham Radio Operator, including Frank, Ron \nand\n&gt; &gt; &gt; Myself.\n&gt; &gt; &gt; \n&gt; &gt; &gt; Someone asked about different antennas… because of the Ham \n&gt; &gt; connection,\n&gt; &gt; &gt; that has been done already. The original Spiricom was an \nenormous\n&gt; &gt; &gt; device and operated on the ham bands because it was the only \npart of\n&gt; &gt; &gt; the spectrum that could offer a clear channel. They tried both\n&gt; &gt; &gt; vertical and horizontal antennas. We did the same in our early\n&gt; &gt; &gt; devices, both Ron and I have “antenna farms” as do many \nof \n&gt; &gt; the ASUP\n&gt; &gt; &gt; investigators, who are also hams.\n&gt; &gt; &gt; \n&gt; &gt; &gt; Spiricom sounded very robotic, due in part to the equipment \nbeing\n&gt; &gt; &gt; used… tubes and crystals to set the frequency. This was \ncommon\n&gt; &gt; &gt; practice through the 1980s.  I recently heard someone spouting a\n&gt; &gt; &gt; theory that because the Spiricom used a crystal system, it was \n&gt; &gt; somehow\n&gt; &gt; &gt; mystical in nature. Crystals were used in all ham radios, all \n&gt; &gt; military\n&gt; &gt; &gt; radios and a lot of commercial applications… nothing \nmystical at \n&gt; &gt; all.\n&gt; &gt; &gt;  \n&gt; &gt; &gt; I think Frank dropped the crystal frequency generation due to \ncost \n&gt; &gt; in\n&gt; &gt; &gt; favor of a plain old radio tuner he pulled from an old \nreceiver. \n&gt; &gt; Most\n&gt; &gt; &gt; of his designs were admittedly adaptations of junk radios, \nwhich is\n&gt; &gt; &gt; what separates his from ours. We spared no expense in designing\n&gt; &gt; &gt; circuits that were critical to a clean signal.\n&gt; &gt; &gt; \n&gt; &gt; &gt; In your discussion last night, George did not even mention the \nEARTH\n&gt; &gt; &gt; SOUNDS project at NASA on the Ultra Low Frequency Bands. Down \nthere\n&gt; &gt; &gt; NASA has been hearing “voices” for years, which they \nadmit, \n&gt; &gt; they can’t\n&gt; &gt; &gt; explain. As you might have already guessed, that is one of our\n&gt; &gt; &gt; upcoming projects. The great problem there is the length of the\n&gt; &gt; &gt; antenna, to do it right an ULF antenna would be buried and \nwould be\n&gt; &gt; &gt; about 11 MILES long.  In the production model of the MiniBox, \nRon \n&gt; &gt; hand\n&gt; &gt; &gt; tuned the antennas, winding row upon row of fine wire to match \nthe\n&gt; &gt; &gt; necessary length of the frequencies being scanned, another \n&gt; &gt; difference\n&gt; &gt; &gt; that helped to eliminate noise and upgrade the voice quality.\n&gt; &gt; &gt; ____\n&gt; &gt; &gt; Thanks, Rick.  And thanks to Frank, Ron, Craig, Marcus and all \nthe\n&gt; &gt; &gt; other researchers in the ITC field.\n&gt; &gt; &gt; \n&gt; &gt; &gt; Rosemary\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}