{"id": "4072", "subject": "Re: Hi!  I&#39;m new to the group;", "author": "M.A. Coletta (Mike)", "timestamp": "2007-12-09T14:16:39Z", "full_text": "Greetings Ken,\n\nI am also a fellow &quot;licensed Ham Radio Operator&quot; and have been told \nby others that I am a &quot;Sensitive&quot;, which would explain much that has \nhappened in my life.\nOn the subject of licensed operators, I&#39;m guessing there may be many \nof us &quot;Hams&quot; who enjoy searching and exploring the world of heard & \nunheard frequencies. It is one that is wide open at the moment. That \nis why we enjoy finding and experimenting with new techniques, \ndevices, and ideas. We number many more than thirty, and there&#39;s room \nfor plenty more... Welcome to the group!\n\n- Mike\n\n-----\nAll my Radio Shack Hack videos can be found at:\nhttp://www.ufogeek.com\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;Ken&quot; &lt;ktm@...&gt; wrote:\n&gt;\n&gt; Greetings All,  My name is Ken & I&#39;ve been reading the group for a \nfew days now.\n&gt; I have some observations & a couple of ideas I&#39;d like to share:\n&gt; \n&gt; It amazes me how like minded intentions attract the same.\n&gt; Like Rick Moran, Frank, & Ron.  I too am a licensed Ham Radio \nOperator and \n&gt; am very interested in EVP,etc.  I&#39;m also a Remote Viewer, \nSensitive, & dowser.\n&gt; My studies have taught me that these things basically work on the \nsame principles.\n&gt; In Physics there&#39;s something called Quantum entanglement.  In a \nnutshell, Its the \n&gt; idea of all things being familiar & related due to their physical \nmake up.  Like identical \n&gt; twins separated at birth, all things are connected and aware of one \nanother, even though\n&gt; miles apart & separated for years.  Also, just as time & space \nexists in a vacuum, all\n&gt; things live forever.  Once a word is spoken or an attitude is acted \nout its effects can be \n&gt; witnessed forever, (Like dropping a pebble in water & watching the \nripples).  When I was \n&gt; teen I overdosed on some chemically treated weed.  I had an OBE & \nsaw the tunnel of \n&gt; white light thing, had the whole experience.  Ever since then I&#39;ve \nunderstood that we are \n&gt; multidimensional, nothing dies, it only evolves or changes energy \nforms.\n&gt; \n&gt; People will always shy away from & fear that which they don&#39;t \nunderstand.  \n&gt; They try to label things as evil, good, right, & wrong.  Things are \nrelative.\n&gt; Your intentions are what makes things what they are.  You will \nalways find\n&gt; what you look for.  Keep up the good work, its all very interesting.\n&gt;"}