{"id": "4079", "subject": "Re: Newbie", "author": "psi_research", "timestamp": "2007-12-09T18:14:18Z", "full_text": "Please update us if you are able to interface the USB radio to your\ncomputer and scan frequencies using software. That approach could make\nthings easier for many people. \n\n--- In EVP-ITC@yahoogroups.com, &quot;billliscomb&quot; &lt;williscomb@...&gt; wrote:\n&gt;\n&gt; Hello everyone - Bill here.  Been facinated with EVPs on C2C for \n&gt; years and a few days ago realized that I have a room full of high end \n&gt; audio and video recording equipment, 4 computers and software to do \n&gt; anything with anything...Hey!  I can set something up to do EVPs!  \n&gt; I&#39;ve got a starter set on my desktop that worked on the first try \n&gt; and &quot;Rick&quot; (my contact)has been helpful in getting it fine tuned. \n&gt; Desktop setup uses EVPmaker chewing up a 1 minute segment of a man \n&gt; giving a talk, with white noise (EVP said &quot;use that noise&quot;)in a loop \n&gt; on Soundbooth.  I use a AKG 414 mike about 18&quot; from the computer \n&gt; speakers and simply lean over it to ask questions, and record on to \n&gt; Audition. \n&gt;    My next move is to create a laptop based system using as few \n&gt; components as possible. I&#39;m looking at the RadioShark 2 USB am/fm \n&gt; radio, and hoping to leave it &quot;stock&quot; and have it scan using \n&gt; software.  I&#39;ve found some 3rd party software that might work, but \n&gt; don&#39;t know the particulars of the &quot;scan&quot; function.  Anybody here gone \n&gt; this route or know of software that will work?  My portable sytem \n&gt; would be the laptop, Radio Shark 2, and a microphone-and maybe a \n&gt; Logitec external speaker.  Play white noise and radio scan thru \n&gt; speakers, record back on computer.  Whaddya think?\n&gt;    Started my listening career in teh 1960&#39;s building Knight kit \n&gt; shortwave radios, and still enjoy Shortwave listening - utilites \n&gt; mostly.  EVP seems like the next level.\n&gt; Thanks\n&gt; Bill\n&gt;"}