{"id": "4086", "subject": "Re: Followup on C2C Show", "author": "Bobby", "timestamp": "2007-12-09T21:23:30Z", "full_text": "Dear Rosemary & Frank\n I heard C2C other night & I really enjoyed listning to it.\n I think you did great job on that. Good Luck\n                                                 bob\n--- In EVP-ITC@yahoogroups.com, &quot;rosemary_guiley&quot; &lt;reguiley@...&gt; \nwrote:\n&gt;\n&gt; I&#39;ll send this on to Rick.\n&gt; \n&gt; Rosemary\n&gt; --- In EVP-ITC@yahoogroups.com, &quot;rosemary_guiley&quot; &lt;reguiley@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Thanks, Frank, hope you forward this to Rick.\n&gt; &gt; \n&gt; &gt; Rosemary\n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;Frank Sumption&quot; &lt;franks-boxes@&gt; \nwrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt;  Interesting, but there&#39;s a few misconceptions about my work. I \nused \n&gt; &gt; &gt; quartz crytals, not as part of any circuits or for frequency, \nsome of \n&gt; &gt; &gt; the &quot;contacts&quot; request the crystals, so I place them on, or in \nsound \n&gt; &gt; &gt; chamber, it seems to help with some entities, as do magents \nused in \n&gt; &gt; &gt; the same way. There&#39;s no way to conect them to the circuit.\n&gt; &gt; &gt; \n&gt; &gt; &gt;  I used radio modules from car stereos because they were \nalready \n&gt; &gt; &gt; designed to be volatage tuned, so I could use the random \nvoltage \n&gt; &gt; &gt; generator to tune these moudules randomly. Following EVPmaker \nas an \n&gt; &gt; &gt; example, I had thought the tuning had to be random, as I \nthought \n&gt; &gt; &gt; there was somekind of quantum resonance going on to get the \nvoices. \n&gt; &gt; &gt; That assumption has proved to be false, a linear scan is far \nsuperior \n&gt; &gt; &gt; to random scan. I don&#39;t care what the &quot;primary tester&quot; claims, \nhe \n&gt; &gt; &gt; doesn&#39;t make the things. I still don&#39;t know how the voices are \nmade. \n&gt; &gt; &gt; \n&gt; &gt; &gt;  We&#39;ve also found anyone can do the same thing as a box by \nmanually \n&gt; &gt; &gt; tuning a radio across it&#39;s band slowly by hand while recording. \nIt&#39;s \n&gt; &gt; &gt; easier to have the precess automated, but the manual method is \ngood \n&gt; &gt; &gt; for quickie messages and guidence when needed. You wouldn&#39;t \nwant to \n&gt; &gt; &gt; get hooked on doing sessions to ask about every little thing in \nyour \n&gt; &gt; &gt; life though. \n&gt; &gt; &gt; \n&gt; &gt; &gt;  Personally, I don&#39;t have all these higher ideals, asperations, \nor \n&gt; &gt; &gt; goals as some seem to claim in the paranormal field. I don&#39;t \ninsist \n&gt; &gt; &gt; only the higher beings coming through with only the blessing of \nsome \n&gt; &gt; &gt; deity--I don&#39;t care what talks. I get some cussing and name \ncalling --\n&gt; &gt; &gt; sometimes, but big deal! It does in fact show it&#39;s not \nbroadcast \n&gt; &gt; &gt; fragments. As for portals some claim opened--I don&#39;t even know \nwhat \n&gt; &gt; &gt; they are talking about, I have never experienced a portal--or \n&gt; &gt; &gt; anything that might be considered evil--except perhaps some of \nthe \n&gt; &gt; &gt; living. I can&#39;t imagine box use being anymore dangerous than \nwatching \n&gt; &gt; &gt; to much TV, and taking every show as gospel truth. Wonder how \nmany \n&gt; &gt; &gt; live their lives by what&#39;s on Friends, or Saturday Night Live!? \n90% \n&gt; &gt; &gt; or more of what I get is just my familar guys, my unseen \nfriends, \n&gt; &gt; &gt; talking, mostly very non-profound comments. I get some \nrelatives, my \n&gt; &gt; &gt; son, and dad, maybe an uncle from time to time, I don&#39;t take it \nlike \n&gt; &gt; &gt; it&#39;s all profound and mystical, it&#39;s just communcations--ya \ndon&#39;t \n&gt; &gt; &gt; have to worship it, and you don&#39;t need some guru to interpret \nit! I \n&gt; &gt; &gt; don&#39;t know how many can hear this stuff rihgt away, it might \ntake \n&gt; &gt; &gt; practice, since the voices are composites of various voices and \nmusic \n&gt; &gt; &gt; bits mixed with radio noise. \n&gt; &gt; &gt;  The function of the box is to provide the &quot;raw&quot; audio \nwhich &quot;they&quot; \n&gt; &gt; &gt; use to form a voice. It is not the only way, there are many \nmethod \n&gt; &gt; &gt; that work as well, and at times better. \n&gt; &gt; &gt; \n&gt; &gt; &gt;  As far as antenna, I just use a piece of wire and an Rf \namplifier, I \n&gt; &gt; &gt; don&#39;t care about resonating for each frquency, that would be \nvery \n&gt; &gt; &gt; cumbersome, and useless. Imagine a car with 10,000 antennas \nsticking \n&gt; &gt; &gt; out it! Even on ham radio I have one 100 foot long dipole I use \non \n&gt; &gt; &gt; all hf bands, and talk all over the world on less than 5 watts. \nOf \n&gt; &gt; &gt; course I use an antenna tuner to resonate it for the band I&#39;m \non. I \n&gt; &gt; &gt; also haven&#39;t been on the air since starting EVP, it eats all my \ntime!\n&gt; &gt; &gt; \n&gt; &gt; &gt;  It&#39;s only the audio that I consider important, radio is a \nconvenient \n&gt; &gt; &gt; source of a mix of speech, music and noise that can be chopped \nup \n&gt; &gt; &gt; easily by tuning. There is a program that does this on the \ncomputer, \n&gt; &gt; &gt; called EVPmaker, and my boxes were an analog version of \nEVPmaker. I \n&gt; &gt; &gt; am still curious why some spirits seems unable to use the \ncomputer \n&gt; &gt; &gt; method, which lead to my boxes by asking waht else could I use?\n&gt; &gt; &gt; \n&gt; &gt; &gt;  Frank-s\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}