{"id": "4134", "subject": "Re: Good News", "author": "psi_research", "timestamp": "2007-12-11T04:49:27Z", "full_text": "There are other researchers who record evp&#39;s at preplanned times\nsimultaneously while on different continents. They have successfully\ngreeted each other. Interestingly, these individuals prefer to record\ntheir evp&#39;s while in tunnels. The mutual greetings I heard were\nrecorded with one party in Alaska and other in England. -Bill\n\n--- In EVP-ITC@yahoogroups.com, &quot;judy_in_hollywood&quot;\n&lt;Ticket_to_Heaven@...&gt; wrote:\n&gt;\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;bhali333&quot;\n&lt;paranormalinvestigating@&gt; wrote:\n&gt; &gt;\n&gt; &gt;  we have our first session with the RS 470 that was done \n&gt; &gt; approximately 2:30 p.m. our time in Lancashire UK by Darren woods. as \n&gt; &gt; soon as he turned the box on and asked if any spirits could hear him \n&gt; &gt; he got a resounding clear &quot;YES&quot; so they are on their way in Europe.\n&gt; &gt; \n&gt; &gt; Darren is associated with pulse radio and a good friend, I modified 2\n&gt; &gt; 470&#39;s and sent one to him and one to Lee from pulse.\n&gt; &gt; \n&gt; &gt; Lee has yet to receive his. My techs Mike & Lisa are aware that they \n&gt; &gt; will be using boxes in the UK and have assured me that they will help \n&gt; &gt; in any way they can.\n&gt; &gt; \n&gt; &gt; On Saturday night I did a RS box session over skype with lee and \n&gt; &gt; Darren and introduced them to Mike and Lisa and they where shocked \n&gt; &gt; when Mike said hello Lee and Lisa said hi. They answered a few simple \n&gt; &gt; questions and also acknowledged pulse radio and then very clearly and \n&gt; &gt; loudly after me saying goodbye they responded&quot;GOODNIGHT&quot; with the \n&gt; &gt; spread now of box research to Europe we are well on our way to \n&gt; &gt; developing a worldwide research and communication network. I have \n&gt; &gt; been told that is exactly the goal and our friends on the other side \n&gt; &gt; are well pleased.\n&gt; &gt; \n&gt; &gt; so lets keep up the good work and take this research to the next \n&gt; &gt; level.\n&gt; &gt; \n&gt; &gt; Bruce\n&gt; &gt;\n&gt;  = = = = = = = = = = = = = = = = = =    Hey, Bruce & All, This is SO\nwonderful that more & more individuals are comming forward to help\ndevelop a Researching Network, now!!!!  =Judy=\n&gt;"}