{"id": "4137", "subject": "Re: [EVP-ITC] Good News", "author": "Misty Dawn", "timestamp": "2007-12-11T05:39:48Z", "full_text": "--0-614248647-1197351588=:57182\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nThat&#39;s awesome Bruce! There are many points of light on the bridge around the world. Many ITC researchers involved with research and using multiple methods. The more connections you make on both sides the stronger the communication levels become. \n   \n  Like I always say..\n   \n  Working together is the BEST way to go... if we work with each other here then it makes working with them so much easier =) We dont have to all agree, we dont have to all think the same exact way, we dont have to all hear the same way, we just have to acknowledge that we are different and move forward.\n   \n  You will find that distance here means about as much as time there. I have been lead to meet or come into contact with people across the globe sometimes more than a year before I knew they existed. I find many similarities with most serious researchers. The method matters little, the results speak for themselves. \n   \n  Once you find a method thats comfortable for you the rest is easy. For me pretty much all methods have yeilded similar results or the same voices coming thru regardless of the medium used. Sometimes those I record with will get some of my contacts or even record thier voices which match &quot;life&quot; like voice they had.\n   \n  Misty\n\nbhali333 &lt;paranormalinvestigating@...&gt; wrote:\n          we have our first session with the RS 470 that was done \napproximately 2:30 p.m. our time in Lancashire UK by Darren woods. as \nsoon as he turned the box on and asked if any spirits could hear him \nhe got a resounding clear &quot;YES&quot; so they are on their way in Europe.\n\nDarren is associated with pulse radio and a good friend, I modified 2\n470&#39;s and sent one to him and one to Lee from pulse.\n\nLee has yet to receive his. My techs Mike & Lisa are aware that they \nwill be using boxes in the UK and have assured me that they will help \nin any way they can.\n\nOn Saturday night I did a RS box session over skype with lee and \nDarren and introduced them to Mike and Lisa and they where shocked \nwhen Mike said hello Lee and Lisa said hi. They answered a few simple \nquestions and also acknowledged pulse radio and then very clearly and \nloudly after me saying goodbye they responded&quot;GOODNIGHT&quot; with the \nspread now of box research to Europe we are well on our way to \ndeveloping a worldwide research and communication network. I have \nbeen told that is exactly the goal and our friends on the other side \nare well pleased.\n\nso lets keep up the good work and take this research to the next \nlevel.\n\nBruce\n\n\n\n                         \n\n       \n---------------------------------\nNever miss a thing.   Make Yahoo your homepage.\r\n--0-614248647-1197351588=:57182\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;div&gt;That&#39;s awesome Bruce! There are many points of light on the bridge around the world. Many ITC researchers involved with research and using multiple methods. The more connections you make on both sides the stronger the communication levels become. &lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Like I always say..&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Working together is the&nbsp;BEST way to go... if we work with each other here then it makes working with them so much easier =) We dont have to all agree, we dont have to all think the same exact way, we dont have to all hear the same way, we just have to acknowledge that we are different and move forward.&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;You will find that distance here means about as much as time there. I have been lead to meet or come into contact with people across the globe sometimes more than a year before I knew they existed. I find many similarities with most serious researchers. The method matters little, the results speak for\n themselves. &lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Once you find a method thats comfortable for you the rest is easy. For me pretty much all methods have yeilded similar results or the same voices coming thru regardless of the medium used. Sometimes those I record with will get some of my contacts or even record thier voices which match &quot;life&quot; like voice they had.&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Misty&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;bhali333 &lt;paranormalinvestigating@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/div&gt;  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;div&gt;we have our first session with the RS 470 that was done &lt;BR&gt;approximately 2:30 p.m. our time in\n Lancashire UK by Darren woods. as &lt;BR&gt;soon as he turned the box on and asked if any spirits could hear him &lt;BR&gt;he got a resounding clear &quot;YES&quot; so they are on their way in Europe.&lt;BR&gt;&lt;BR&gt;Darren is associated with pulse radio and a good friend, I modified 2&lt;BR&gt;470&#39;s and sent one to him and one to Lee from pulse.&lt;BR&gt;&lt;BR&gt;Lee has yet to receive his. My techs Mike &amp; Lisa are aware that they &lt;BR&gt;will be using boxes in the UK and have assured me that they will help &lt;BR&gt;in any way they can.&lt;BR&gt;&lt;BR&gt;On Saturday night I did a RS box session over skype with lee and &lt;BR&gt;Darren and introduced them to Mike and Lisa and they where shocked &lt;BR&gt;when Mike said hello Lee and Lisa said hi. They answered a few simple &lt;BR&gt;questions and also acknowledged pulse radio and then very clearly and &lt;BR&gt;loudly after me saying goodbye they responded&quot;GOODNIGHT&lt;WBR&gt;&quot; with the &lt;BR&gt;spread now of box research to Europe we are well on our way to &lt;BR&gt;developing a worldwide research and communication network.\n I have &lt;BR&gt;been told that is exactly the goal and our friends on the other side &lt;BR&gt;are well pleased.&lt;BR&gt;&lt;BR&gt;so lets keep up the good work and take this research to the next &lt;BR&gt;level.&lt;BR&gt;&lt;BR&gt;Bruce&lt;BR&gt;&lt;BR&gt;&lt;/div&gt;&lt;/DIV&gt;&lt;!--End group email\n --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;p&gt;&#32;\n\n      &lt;hr size=1&gt;Never miss a thing.  &lt;a href=&quot;http://us.rd.yahoo.com/evt=51438/*http://www.yahoo.com/r/hs&quot;&gt; Make Yahoo your homepage.&lt;/a&gt;\n\n\r\n--0-614248647-1197351588=:57182--"}