{"id": "4172", "subject": "Re: Min-box vs. RS hack", "author": "rosemary_guiley", "timestamp": "2007-12-11T23:43:46Z", "full_text": "At the moment, just a pair of external speakers.\n\nRosemary\n--- In EVP-ITC@yahoogroups.com, &quot;LC Duplatt&quot; &lt;lcdupla@...&gt; wrote:\n&gt;\n&gt; Rosemary,\n&gt; \n&gt; Can you expound possibly on how you are using the Radio Shack hack, \n&gt; such as the set-up you are using with the radio?\n&gt; \n&gt; LC\n&gt; http://www.AngelsGhosts.com\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;rosemary_guiley&quot; &lt;reguiley@&gt; \n&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hi Sam,\n&gt; &gt; \n&gt; &gt; I bought a Mini-Box -- the first one off the production line, in \n&gt; fact\n&gt; &gt; -- and yes, it is a lot clearer than either of my two Frank&#39;s Boxes,\n&gt; &gt; which I pointed out on the air on C2C.  I also have the RS Hack, and\n&gt; &gt; it works quite well, and certainly provides an economical \n&gt; alternative\n&gt; &gt; to people.\n&gt; &gt; \n&gt; &gt; For the record, I have no vested interest in Mini-boxes, the hacks \n&gt; or\n&gt; &gt; any ITC devices.  I have stated opinions about the Mini and it&#39;s\n&gt; &gt; advantages, and it&#39;s OK to have those used as testimonials. I am \n&gt; using\n&gt; &gt; a variety of devices in my work, and they are all valuable to me.  I\n&gt; &gt; travel a lot, so the Mini and the RSH will be the devices of choice,\n&gt; &gt; especially since they are more portable and less fragile than the \n&gt; FBs. \n&gt; &gt; \n&gt; &gt; Regards\n&gt; &gt; Rosemary\n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;sam_stout&quot; &lt;sam_stout@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; I&#39;m new to this group, but not to ITC research. I&#39;m familiar with\n&gt; &gt; &gt; spirit communications using boxes like Frank&#39;s, the mini-box, and \n&gt; RS\n&gt; &gt; &gt; hack. I&#39;ve seen the picture of Frank with the mini-box. Frank, it\n&gt; &gt; &gt; looks to me that you are promoting this mini-box. Is that \n&gt; correct? If\n&gt; &gt; &gt; so, is it the only box that you are promoting now? Or are they \n&gt; just\n&gt; &gt; &gt; using your image and a few of your statements to push their box? \n&gt; What\n&gt; &gt; &gt; I heard of the C2C show it seemed to me that it was more of a\n&gt; &gt; &gt; promotion for the mini-box. They posted something about that \n&gt; their box\n&gt; &gt; &gt; has a cleaner signal and Frank&#39;s box had more noise to it. Well,\n&gt; &gt; &gt; sometimes in this line of work you want to have a little bit of\n&gt; &gt; &gt; inherent noise. I know that the RS radio has to meet FCC Class B\n&gt; &gt; &gt; regulations Part 15. As for being a cleaner signal, I would think \n&gt; that\n&gt; &gt; &gt; the RS radio would actually be, than the mini-box. I have heard \n&gt; both\n&gt; &gt; &gt; the mini-box and the RS hack and I can&#39;t tell a lot of differences\n&gt; &gt; &gt; between the two except for the price. It&#39;s my understanding that \n&gt; the\n&gt; &gt; &gt; mini-box is selling around $400 and that&#39;s a lot of money for \n&gt; just a\n&gt; &gt; &gt; AM radio. The RS radio is selling for $24.95 and I know people are\n&gt; &gt; &gt; getting some great results with the RS hack. Just my two cents \n&gt; worth!!\n&gt; &gt; &gt; \n&gt; &gt; &gt; Sam\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}