{"id": "4184", "subject": "Re: Min-box vs. RS hack", "author": "rosemary_guiley", "timestamp": "2007-12-12T02:21:20Z", "full_text": "Congrats, Lance.  You&#39;ll really like it.\n\nRosemary\n--- In EVP-ITC@yahoogroups.com, &quot;Lance Oliver&quot; &lt;orbhunterx@...&gt; wrote:\n&gt;\n&gt; Thanks for the clarification, Rosemary and April.\n&gt; \n&gt; I just got great news! Ron&#39;s personally going to be bringing to my \n&gt; new Mini to the DAPS group meeting next Tuesday!! \n&gt; \n&gt; I&#39;ve heard such positive feedback, from him and others, I can&#39;t wait \n&gt; to start experimenting. \n&gt; \n&gt; As positive communications with the Mini are established, I&#39;ll make \n&gt; sure other researchers are in the loop. \n&gt; \n&gt; Lance \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;April Slaughter&quot; &lt;aprilrebuilt@&gt; \n&gt; wrote:\n&gt; &gt;\n&gt; &gt; On the specs side, the MiniBox has controls for both scan rate as \n&gt; well\n&gt; &gt; as sensitivity, so you can cut down on the amount of random noise \n&gt; and\n&gt; &gt; also find a speed which seems clearer, whereas you cannot with the \n&gt; RS\n&gt; &gt; Hack (as far as I know). The rechargeable battery lasts about 40-50\n&gt; &gt; hours on one charge... nothing to replace that way. It has both a\n&gt; &gt; speaker output and one for a recorder so you can not only hear it as\n&gt; &gt; loud as you like, but you can directly record your session from the \n&gt; box.  \n&gt; &gt; \n&gt; &gt; When it comes to audible differences, the quality of the electronics\n&gt; &gt; used provides clearer sound. I am not straining so much to hear\n&gt; &gt; things. It is just speculation on my part, but it seems to take less\n&gt; &gt; time and less effort for communication from the other side to come\n&gt; &gt; through with the Mini. At least, in my experiences with both \n&gt; devices.\n&gt; &gt; Though, I have gotten snippets from the RS Hack that were \n&gt; impressive.\n&gt; &gt; \n&gt; &gt; ~April \n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, Ron Lederer &lt;ronriko@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; Hi April   Can you be more specific on the &quot;marked differences&quot;   \n&gt; ron\n&gt; &gt;\n&gt;"}