{"id": "4186", "subject": "Re: Min-box vs. RS hack", "author": "Lance Oliver", "timestamp": "2007-12-12T02:50:17Z", "full_text": "Thanks Rosemary!\n\n;-)\n\nBTW, have you had time to do any other communication sessions with \nyour new MiniBox? \n\nElaborating on the voice quality improvements with the MiniBox, and \nother positive results of your own, should be a big help to others \ndeciding whether or not to grab one for their own experimentation. \n\nSince I personally know Ron, his thoughts, workmanship, ect... I&#39;ve \nbeen sold on any concept of ITC equipment he might create since \ncarrying own discussions for years running. Rick Moran deserves a big \nthanks for somehow coaxing him into finally building something that \nworks! \n\nLOL!\n\nLance\n\n--- In EVP-ITC@yahoogroups.com, &quot;rosemary_guiley&quot; &lt;reguiley@...&gt; \nwrote:\n&gt;\n&gt; Congrats, Lance.  You&#39;ll really like it.\n&gt; \n&gt; Rosemary\n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Lance Oliver&quot; &lt;orbhunterx@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Thanks for the clarification, Rosemary and April.\n&gt; &gt; \n&gt; &gt; I just got great news! Ron&#39;s personally going to be bringing to \nmy \n&gt; &gt; new Mini to the DAPS group meeting next Tuesday!! \n&gt; &gt; \n&gt; &gt; I&#39;ve heard such positive feedback, from him and others, I can&#39;t \nwait \n&gt; &gt; to start experimenting. \n&gt; &gt; \n&gt; &gt; As positive communications with the Mini are established, I&#39;ll \nmake \n&gt; &gt; sure other researchers are in the loop. \n&gt; &gt; \n&gt; &gt; Lance \n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;April Slaughter&quot; &lt;aprilrebuilt@&gt; \n&gt; &gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; On the specs side, the MiniBox has controls for both scan rate \nas \n&gt; &gt; well\n&gt; &gt; &gt; as sensitivity, so you can cut down on the amount of random \nnoise \n&gt; &gt; and\n&gt; &gt; &gt; also find a speed which seems clearer, whereas you cannot with \nthe \n&gt; &gt; RS\n&gt; &gt; &gt; Hack (as far as I know). The rechargeable battery lasts about \n40-50\n&gt; &gt; &gt; hours on one charge... nothing to replace that way. It has both \na\n&gt; &gt; &gt; speaker output and one for a recorder so you can not only hear \nit as\n&gt; &gt; &gt; loud as you like, but you can directly record your session from \nthe \n&gt; &gt; box.  \n&gt; &gt; &gt; \n&gt; &gt; &gt; When it comes to audible differences, the quality of the \nelectronics\n&gt; &gt; &gt; used provides clearer sound. I am not straining so much to hear\n&gt; &gt; &gt; things. It is just speculation on my part, but it seems to take \nless\n&gt; &gt; &gt; time and less effort for communication from the other side to \ncome\n&gt; &gt; &gt; through with the Mini. At least, in my experiences with both \n&gt; &gt; devices.\n&gt; &gt; &gt; Though, I have gotten snippets from the RS Hack that were \n&gt; &gt; impressive.\n&gt; &gt; &gt; \n&gt; &gt; &gt; ~April \n&gt; &gt; &gt; \n&gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com, Ron Lederer &lt;ronriko@&gt; wrote:\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Hi April   Can you be more specific on the &quot;marked \ndifferences&quot;   \n&gt; &gt; ron\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}