{"id": "4199", "subject": "Re: RS 12-469 Questions on How to Use", "author": "M.A. Coletta (Mike)", "timestamp": "2007-12-12T15:15:45Z", "full_text": "Hi Rita,\n\nWelcome to the group.  Yes, Bruce is correct... my sound chamber design is an experiment to see how well that design works.  I took the basic components of a typical ghost box system and placed them into the plastic enclosure. But to hear what is desired does not always require a chamber. The chamber is just a place where the three sound components can mix and be captured by the microphone.\nJust one of many different methods that can be used.\n\nI have even got good results by just using a 12-470 and a recorder in the open air.\n\nI did build a couple of new chamber systems and will probably build one more for a total of 4.  And I&#39;ll probably provide some of those to some locals here to test. I&#39;d like to get others input on this experimental design. LC is also putting one together using the 12-469. So we will have data from that area too.\n\nAgain... welcome to the group.\n\n- Mike\n\n--- In EVP-ITC@yahoogroups.com, bruce halliday &lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; \n&gt; Hi Rita,\n&gt;  \n&gt; And welcome to the group I am always pleased to see new members and new interest in our research.\n&gt;  \n&gt; You do not need anything extra to use the 12-469 you can use it with just the ear buds that are supplied with the radio.\n&gt; If you like you can purchase an inexspensive fold up speaker from radio shack. It is 19.99 and works quite well.\n&gt;  \n&gt; go to this page for a pic and description of the speaker http://www.radioshack.com/product/index.jsp?productId=2103838&cp=&sr=1&origkw=folding+speaker&kw=folding+speaker&parentPage=search\n&gt;  \n&gt; The sound chamber that mike colleta has been developing is an experiment he is doing and is in no way necessary to\n&gt; obtain good spirit communication with the RS box.\n&gt;  \n&gt; Please feel free to e-mail me with any questions you have, I will be glad to help. paranormalinvestigating@...\n&gt;  \n&gt; Bruce\n&gt; \n&gt; Bruce Halliday Paranormal Investigating Team \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: lcdupla@...: Wed, 12 Dec 2007 03:53:51 +0000Subject: [EVP-ITC] Re: RS 12-469 Questions on How to Use\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Rita, I think you will have to get a pair of amplified speakers on that 469, and put them in a sound chamber of some sort. In that chamber, you will want probably an amplified microphone running into your voice recorder, to pick up the sounds bouncing around in there. You can also add some white noise into the box, but I think people are getting results without adding the additional noise. The chamber seems to really bounce the sound around and give you a good mix to record.LC--- In EVP-ITC@yahoogroups.com, &quot;Rita&quot; &lt;nvrenuf1031@&gt; wrote:&gt;&gt; Hi Everyone,&gt; &gt; New to group here. We just completed the advance hack on our 469 &gt; model. Are you supposed to hear the voices from the radio stations or &gt; just white noise?&gt; &gt; Also, is it best to hook up an external speaker, one or two, in order &gt; to record to a digital recorder? What is the best way to record, using &gt; digital recorder, or direct into PC using Sound recorder, and using a &gt; line in/line out connection?&gt; &gt; What is the recommended length of sessions. Should I try just a minute &gt; or two, or longer at one sitting?&gt; &gt; Thanks to all!&gt; Rita&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Get the power of Windows + Web with the new Windows Live.\n&gt; http://www.windowslive.com?ocid=TXT_TAGHM_Wave2_powerofwindows_122007\n&gt;"}