{"id": "4214", "subject": "Re: [EVP-ITC] Afeter a long discussion...", "author": "Ron Lederer", "timestamp": "2007-12-12T23:13:29Z", "full_text": "--0-442902564-1197501209=:51471\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nFrank   Maybe you already have stopped reading your groups email.  If that is true, we are all sadder for your decision to quit.  Being a one week new member let me tell you the value I see in what you personally have done for me.   \n   \n  I am a North American who now lives in the Yucatan with my family (Mexican wife, two Mexican born children).  I have long been a seeker of the truth about life...and death.  I subscribe to c2c radio via the Internet and that is where I first heard about your box, via Cris Moon.   I can tell you that the whole concept of directly communicating with those on another plain absolutely blew me away.  It truly is a concept that would change the world if would be allowed to spread throughout the world and NOT be controlled by a few.   \n   \n  After hearing about your box several months ago, I had actually attempted to make contact with technical people I knew in the past who might be able to work with me to make such a box.  I had no luck with this strategy and got nowhere.  Then I found your Internet group and everything changed.   I now realize there are many others like me who seek the truth and the group working with you seem very sincere, open and willing to share....as do you.\n   \n  I can also tell you that your presence in the group is like the clear light that can be seen through all other colors.  Your precise comments always seem to get me back on tract and helps me to maintain focus on what is important.  I think many would agree with me on this.\n   \n  Regarding your issues with Moon, I can only think of how you might react to noise that would be getting in the way of your focus on the truth (that is, if you were not so emotionally locked into his universe at this moment) and I think you would say something like &quot;don&#39;t waste your time with that, just get something recorded.&quot;\n   \n  Frank, to abandon your group at this time would a great disappointment to me and certainly to many others who have been involved with you for much longer than I have.  I recognize that there may be issues that I am not aware of, nor do I care to be made aware of, however, I would simply like to learn more about your discovery and hopefully work with you and your group to make this technology known worldwide and to get it into the hands of as many people as possible....and not let a select few control it.  I hope you stay with it.  Ron\n   \n   \n   \n  \nFrank Sumption &lt;franks-boxees@...&gt; wrote:\n           After a long discussion, and at times a yelling match with Chris Moon on the phone...I have like zero memory for verbal stuff, basically I think it came down to he said-she said type deal. I could agree with some of what Mr Moon said, but the bottom line is--I don&#39;t care! I have had enough of these endless pissing contests, one person telling me one thing, someone else telling me something else. I&#39;m not wise enough to tell who is telling the truth. I&#39;m done, I&#39;m not discussing this stuff anymore, I&#39;m not making boxes anymore. I have absolutely no interest in the so called paranormal. I don&#39;t sell this shit, I don&#39;t make any money, all it does eat all my time and piss me off. I&#39;ll finish this last box I&#39;m working on, and that&#39;s it. No more e-mails, no more discussion--I have had it!\n \n Mr Moon said he would be glad to come on the group and answer question--so there ya go, now is your chance. I&#39;m not going to be the go between, nor will I participate. \n \n Frank-S\n\n  \n---------------------------------\n  Don&#39;t get caught with egg on your face. Play Chicktionary! Check it out!   \n\n                         \n\n\n       \n---------------------------------\nNever miss a thing.   Make Yahoo your homepage.\r\n--0-442902564-1197501209=:51471\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;DIV&gt;Frank&nbsp;&nbsp; Maybe you already have stopped reading your groups email.&nbsp; If that is true, we are all sadder for your decision to quit.&nbsp; Being a one week new member let me tell you the value I see in what you personally have done for me.&nbsp;&nbsp; &lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;I am a North American who now lives in the Yucatan with my family (Mexican wife, two Mexican born children).&nbsp; I have long been a seeker of the truth about life...and death.&nbsp; I subscribe to c2c radio via the Internet and that is where I first heard about your box, via Cris Moon.&nbsp;&nbsp; I can tell you that the whole concept of directly communicating with those on another plain&nbsp;absolutely blew me away.&nbsp; It truly is a concept that would change the world&nbsp;if would be allowed to spread throughout the world and NOT be controlled by a few.&nbsp;&nbsp;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;After hearing about your box several months ago, I had actually\n attempted to make&nbsp;contact with technical people I knew in the past who might be able to work with me to make such a box.&nbsp; I had no luck with this strategy and got nowhere.&nbsp; Then I found your Internet group and everything changed.&nbsp;&nbsp; I now realize there are many others like me who seek the truth and the group working with you seem very sincere, open and willing to share....as do you.&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;I can also tell you that your presence in the group is like the clear light that can be seen through all other colors.&nbsp; Your precise comments always seem to get me back on tract and helps me to maintain focus on what is important.&nbsp; I think many would agree with me on this.&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;Regarding your issues with Moon, I can only think of how you might react to&nbsp;noise that would be getting in the way of your focus on the truth (that is, if you were not so emotionally locked into his universe at this moment)\n and I think you would say something like &quot;don&#39;t waste your&nbsp;time with that, just get something recorded.&quot;&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;Frank, to abandon your group at this time would a great disappointment to me and certainly to many others who have been involved with you for much longer than I have.&nbsp; I recognize that there may be issues that I am not aware of, nor do I care to be made aware of, however, I would simply like to learn more about your discovery and hopefully work with you and your group to make this technology known&nbsp;worldwide and to get it into the hands of as many people as possible....and not let a select few control it.&nbsp;&nbsp;I hope you stay with it.&nbsp; Ron&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;Frank Sumption &lt;franks-boxees@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/DIV&gt;  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px\n solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;DIV&gt;&nbsp;After a long discussion, and at times a&nbsp;yelling match with Chris Moon on the phone...I have like zero memory for verbal stuff, basically I think it came down to he said-she said type deal. I could agree with some of what Mr Moon said, but the bottom line is--I don&#39;t care! I have had enough of these endless pissing contests, one person telling me one thing, someone else telling me something else. I&#39;m not wise enough to tell who is telling the truth. I&#39;m done, I&#39;m not discussing this stuff anymore, I&#39;m not making boxes anymore. I have absolutely no interest in the so called paranormal. I don&#39;t sell this shit, I don&#39;t make any money, all it does eat all my time\n and piss me off. I&#39;ll finish this last box I&#39;m working on, and that&#39;s it. No more e-mails, no more discussion--&lt;WBR&gt;I have had it!&lt;BR&gt;&nbsp;&lt;BR&gt;&nbsp;Mr Moon said he would be glad to come on the group and answer question--so there ya go, now is your chance. I&#39;m not going&nbsp;to be the go between, nor will I participate. &lt;BR&gt;&nbsp;&lt;BR&gt;&nbsp;Frank-S&lt;BR&gt;&lt;BR&gt;  &lt;HR&gt;  Don&#39;t get caught with egg on your face. Play Chicktionary! &lt;A href=&quot;http://club.live.com/chicktionary.aspx?icid=chick_wlhmtextlink1_dec&quot; target=_new&gt;Check it out!&lt;/A&gt;   &lt;DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;p&gt;&#32;\n\n      &lt;hr size=1&gt;Never miss a thing.  &lt;a href=&quot;http://us.rd.yahoo.com/evt=51438/*http://www.yahoo.com/r/hs&quot;&gt; Make Yahoo your homepage.&lt;/a&gt;\n\n\r\n--0-442902564-1197501209=:51471--"}