{"id": "4215", "subject": "Re: re-:-0[EVP-ITC] Min-box vs. RS hackþ", "author": "sam_stout", "timestamp": "2007-12-12T23:49:05Z", "full_text": "Well according to what I read below, it sounds to me that Frank is\nsaying that the mini-box and the RS hack are the same, because it\nprovides the raw audio that is needed. Also, he&#39;s saying you need a\nlittle bit of noise or you could lose some voices. The mini-box might\nwork, but if it&#39;s cleaner maybe it&#39;s losing some of the voices.\nInteresting maybe a redesign of the mini-box is in order?\n\nSam\n\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@...&gt; wrote:\n&gt;\n&gt; \n&gt;  Well, I suppose it&#39;s true they wanted me to endorse the Mini box. I\ndid, because it works. As do the Radio Shack hacks. It&#39;s all the same,\nto provide the raw audio. Not only that, it was alrady rehearsed on\nthe etheric level, it was like reading a script on my part. I already\nknew all the players before meeting them in the physical--that was\njust the formalities. \n&gt;  \n&gt;  As far as cleaner, that&#39;s not necessarily a good thing. I added a\nfilter chip in a couple of my boxes, the LM1894(?!), that put out\nperfectly clean audio, it also took out over half the voices. Moon is\ncorrect in that respect, you need some of the white noise cuz &quot;they&quot;\ndo use that with some of the voices to form words.  AM is noisy\nanyway, and that changes with the seasons, years, and sun spot acitivity. \n&gt;  \n&gt;  You could get the cleanest possible signal by having your tuning\njump to the center of each boardcast carrier to avoid all the skirt\nnoise, and in between station noise. \n&gt;  \n&gt;  Then, there&#39;s still the untapped raw audio of HD radio!!! Hundreds\nof clean digital broadcasts--the concept staggers the imagination!\nIt&#39;s only a matter of time before they start doing like TV, they are\ngoing to stop all analog broadcasts in the near future, wonder how far\nbehind radio is?\n&gt;  \n&gt;  Personally, I prefer analog, but what can ya do if everything is\nfriggin&#39; digital?\n&gt;  \n&gt;  Frank-S\n&gt; _________________________________________________________________\n&gt; Put your friends on the big screen with Windows Vista + Windows Live.\n&gt;\nhttp://www.microsoft.com/windows/shop/specialoffers.mspx?ocid=TXT_TAGLM_CPC_MediaCtr_bigscreen_102007\n&gt;"}