{"id": "4216", "subject": "Re: [EVP-ITC] Afeter a long discussion...", "author": "Lisby", "timestamp": "2007-12-13T00:02:32Z", "full_text": "Frank, you did what you needed to do--you spoke to him and you told  \nhim what you believe to be true. Now just let it go. I know you&#39;re  \nmad, but when you calm some, and breathe some, I think you&#39;ll feel  \nbetter for having confronted him.\n\nI think our discussions--some heated--on this list over the last few  \nweeks have purged us of the need to argue about he said/he said  \nissues concerning the boxes. We know they work. Let&#39;s just move on in  \npositive direction.\n\nAnn\n\nOn Dec 12, 2007, at 3:23 PM, Frank Sumption wrote:\n\n&gt;  After a long discussion, and at times a yelling match with Chris  \n&gt; Moon on the phone...I have like zero memory for verbal stuff,  \n&gt; basically I think it came down to he said-she said type deal. I  \n&gt; could agree with some of what Mr Moon said, but the bottom line is-- \n&gt; I don&#39;t care! I have had enough of these endless pissing contests,  \n&gt; one person telling me one thing, someone else telling me something  \n&gt; else. I&#39;m not wise enough to tell who is telling the truth. I&#39;m  \n&gt; done, I&#39;m not discussing this stuff anymore, I&#39;m not making boxes  \n&gt; anymore. I have absolutely no interest in the so called paranormal.  \n&gt; I don&#39;t sell this shit, I don&#39;t make any money, all it does eat all  \n&gt; my time and piss me off. I&#39;ll finish this last box I&#39;m working on,  \n&gt; and that&#39;s it. No more e-mails, no more discussion--I have had it!\n&gt;\n&gt;  Mr Moon said he would be glad to come on the group and answer  \n&gt; question--so there ya go, now is your chance. I&#39;m not going to be  \n&gt; the go between, nor will I participate.\n&gt;\n&gt;  Frank-S\n&gt;\n&gt;\n&gt; Don&#39;t get caught with egg on your face. Play Chicktionary! Check it  \n&gt; out!\n&gt;\n&gt; \n\n\nF ank, you did wha you needed o do--you spoke o him and you old him wha you belie e o be ue. Now jus le i go. I know you' e mad, bu when you calm some, and b ea he some, I hink you'll eel be e o ha ing con on ed him.I hink ou discussions--some hea ed--on his lis o e he las ew weeks ha e pu ged us o he need o a gue abou he said/he said issues conce ning he boxes. We know hey wo k. Le 's jus mo e on in posi i e di ec ion.AnnOn Dec 12, 2007, a 3:23 PM, F ank Sump ion w o e: A e a long discussion, and a imes a yelling ma ch wi h Ch is Moon on he phone...I ha e like ze o memo y o e bal s u , basically I hink i came down o he said-she said ype deal. I could ag ee wi h some o wha M Moon said, bu he bo om line is--I don' ca e! I ha e had enough o hese endless pissing con es s, one pe son elling me one hing, someone else elling me some hing else. I'm no wise enough o ell who is elling he u h. I'm done, I'm no discussing his s u anymo e, I'm no making boxes anymo e. I ha e absolu ely no in e es in he so called pa ano mal. I don' sell his shi , I don' make any money, all i does ea all my ime and piss me o . I'll inish his las box I'm wo king on, and ha 's i . No mo e e-mails, no mo e discussion--I ha e had i !  M Moon said he would be glad o come on he g oup and answe ques ion--so he e ya go, now is you chance. I'm no going  o be he go be ween, no will I pa icipa e.   F ank-SDon' ge caugh wi h egg on you ace. Play Chick iona y! Check i ou !"}