{"id": "4218", "subject": "Re: RS 12-469 Questions on How to Use", "author": "M.A. Coletta (Mike)", "timestamp": "2007-12-13T02:06:01Z", "full_text": "Hi Rita\n\nI only choose the clear plastic so I could see the three component \ndevices inside. (The pretty blue tint of the radio LCD while \nsweeping, the flashing red light as the noise generator is playing, \nand the blue hue of the amp microphone while it is on).  The chamber \nis closed enough to allow the sound waves to bounce around and mix.  \nAny of the materials you mentioned would work, with some very very \nslight differences in sound, I&#39;m sure, based on the properties of \nabsortion, reflection, refraction, etc.  And I think the chamber is \nsmall enough, with the devices close in proximity enough not impact \nthe sound regardless of which material is used.\n\nAs for controlling from outside, only with my prototype is there a \nneed to open the box/chamber after each session. I redesigned after \nthat. The three production units (Prod 1, Prod 2, Prod 3)I built each \nhave three access holes, which are rubber grommeted. These allow you \nto leave the chamber closed, and still allow you to start and stop \nthe noise generator, up or down sweep the radio, and turn the radio \non or off. You only open the chamber once, to remove the cable and \nturn on the microphone, then you can keep it closed and control the \nother devices with a small push pole the remainder of the time.  You \nonly need to open the chamber again when you are done with all your \nsessions.\n\n- Mike\n\n--- In EVP-ITC@yahoogroups.com, &quot;Rita&quot; &lt;nvrenuf1031@...&gt; wrote:\n&gt;\n&gt; Thank you for all of the responses.\n&gt; \n&gt; Mike,\n&gt; \n&gt; I&#39;m curious as to why the plastic enclosure.  I know on your video \n&gt; you mentioned both a shoebox or cigar box could be used as well.\n&gt; \n&gt; I&#39;m going to try this chamber experiment, but my question is what \n&gt; enclosure would be best so as not to inhibit the sounds, by the \n&gt; material of the enclosure actually absorbing any of the sound.\n&gt; \n&gt; I&#39;m no scientist by any means, so maybe my concern is mute, but it \n&gt; would seem to me that perhaps a glass (or lead crystal) or metal \n(tin \n&gt; box) enclosure would be an interesting experiment as well.\n&gt; \n&gt; Also, have you given any thought to a single toggle/power up switch \n&gt; that would power all devices on at once, perhaps from outside of \nthe \n&gt; box, thereby eliminating the need to open and close the box with \neach \n&gt; session.\n&gt; \n&gt; What do you think?\n&gt; \n&gt; thanks!\n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;M.A. Coletta (Mike)&quot; \n&gt; &lt;michaelcoletta@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hi Rita,\n&gt; &gt; \n&gt; &gt; Welcome to the group.  Yes, Bruce is correct... my sound chamber \n&gt; design is an experiment to see how well that design works.  I took \n&gt; the basic components of a typical ghost box system and placed them \n&gt; into the plastic enclosure. But to hear what is desired does not \n&gt; always require a chamber. The chamber is just a place where the \nthree \n&gt; sound components can mix and be captured by the microphone.\n&gt; &gt; Just one of many different methods that can be used.\n&gt; &gt; \n&gt; &gt; I have even got good results by just using a 12-470 and a \nrecorder \n&gt; in the open air.\n&gt; &gt; \n&gt; &gt; I did build a couple of new chamber systems and will probably \nbuild \n&gt; one more for a total of 4.  And I&#39;ll probably provide some of those \n&gt; to some locals here to test. I&#39;d like to get others input on this \n&gt; experimental design. LC is also putting one together using the 12-\n&gt; 469. So we will have data from that area too.\n&gt; &gt; \n&gt; &gt; Again... welcome to the group.\n&gt; &gt; \n&gt; &gt; - Mike\n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, bruce halliday \n&gt; &lt;paranormalinvestigating@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; \n&gt; &gt; &gt; Hi Rita,\n&gt; &gt; &gt;  \n&gt; &gt; &gt; And welcome to the group I am always pleased to see new members \n&gt; and new interest in our research.\n&gt; &gt; &gt;  \n&gt; &gt; &gt; You do not need anything extra to use the 12-469 you can use it \n&gt; with just the ear buds that are supplied with the radio.\n&gt; &gt; &gt; If you like you can purchase an inexspensive fold up speaker \nfrom \n&gt; radio shack. It is 19.99 and works quite well.\n&gt; &gt; &gt;  \n&gt; &gt; &gt; go to this page for a pic and description of the speaker \n&gt; http://www.radioshack.com/product/index.jsp?\n&gt; \nproductId=2103838&cp=&sr=1&origkw=folding+speaker&kw=folding+speaker&p\n&gt; arentPage=search\n&gt; &gt; &gt;  \n&gt; &gt; &gt; The sound chamber that mike colleta has been developing is an \n&gt; experiment he is doing and is in no way necessary to\n&gt; &gt; &gt; obtain good spirit communication with the RS box.\n&gt; &gt; &gt;  \n&gt; &gt; &gt; Please feel free to e-mail me with any questions you have, I \nwill \n&gt; be glad to help. paranormalinvestigating@\n&gt; &gt; &gt;  \n&gt; &gt; &gt; Bruce\n&gt; &gt; &gt; \n&gt; &gt; &gt; Bruce Halliday Paranormal Investigating Team \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; To: EVP-ITC@: lcdupla@: Wed, 12 Dec 2007 03:53:51 +0000Subject: \n&gt; [EVP-ITC] Re: RS 12-469 Questions on How to Use\n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; Rita, I think you will have to get a pair of amplified speakers \n&gt; on that 469, and put them in a sound chamber of some sort. In that \n&gt; chamber, you will want probably an amplified microphone running \ninto \n&gt; your voice recorder, to pick up the sounds bouncing around in \nthere. \n&gt; You can also add some white noise into the box, but I think people \n&gt; are getting results without adding the additional noise. The \nchamber \n&gt; seems to really bounce the sound around and give you a good mix to \n&gt; record.LC--- In EVP-ITC@yahoogroups.com, &quot;Rita&quot; &lt;nvrenuf1031@&gt; \n&gt; wrote:&gt;&gt; Hi Everyone,&gt; &gt; New to group here. We just completed the \n&gt; advance hack on our 469 &gt; model. Are you supposed to hear the \nvoices \n&gt; from the radio stations or &gt; just white noise?&gt; &gt; Also, is it best \nto \n&gt; hook up an external speaker, one or two, in order &gt; to record to a \n&gt; digital recorder? What is the best way to record, using &gt; digital \n&gt; recorder, or direct into PC using Sound recorder, and using a &gt; \nline \n&gt; in/line out connection?&gt; &gt; What is the recommended length of \n&gt; sessions. Should I try just a minute &gt; or two, or longer at one \n&gt; sitting?&gt; &gt; Thanks to all!&gt; Rita&gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n_________________________________________________________________\n&gt; &gt; &gt; Get the power of Windows + Web with the new Windows Live.\n&gt; &gt; &gt; http://www.windowslive.com?\n&gt; ocid=TXT_TAGHM_Wave2_powerofwindows_122007\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}