{"id": "4223", "subject": "Re: Afeter a long discussion...", "author": "judy_in_hollywood", "timestamp": "2007-12-13T07:52:33Z", "full_text": "Hi Frank! I hope you will take a 2 week vacation from all of this, then reconsider - as there&#39;s many who DO respect YOU the maker/creator of &quot;Frank&#39;s Box&quot; and the inspiration for the Mini-Box, Joe&#39;s Box, and even, to some degree, the RS Hacks! We&#39;d hate to see you leave and let Chris Moon &quot;win the war&quot; by making you leave, so HE can come on this group, for whatever reasons (remember he&#39;s a manipulative businessman & you&#39;re not)! PLEASE STAY ON, HERE! Thank you SOooo much for helping SOooooo many of use, here!  PEACE!  =Judy=                                                                   --- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@...&gt; wrote:\n&gt;\n&gt; \n&gt;  After a long discussion, and at times a yelling match with Chris Moon on the phone...I have like zero memory for verbal stuff, basically I think it came down to he said-she said type deal. I could agree with some of what Mr Moon said, but the bottom line is--I don&#39;t care! I have had enough of these endless pissing contests, one person telling me one thing, someone else telling me something else. I&#39;m not wise enough to tell who is telling the truth. I&#39;m done, I&#39;m not discussing this stuff anymore, I&#39;m not making boxes anymore. I have absolutely no interest in the so called paranormal. I don&#39;t sell this shit, I don&#39;t make any money, all it does eat all my time and piss me off. I&#39;ll finish this last box I&#39;m working on, and that&#39;s it. No more e-mails, no more discussion--I have had it!\n&gt;  \n&gt;  Mr Moon said he would be glad to come on the group and answer question--so there ya go, now is your chance. I&#39;m not going to be the go between, nor will I participate. \n&gt;  \n&gt;  Frank-S\n&gt; _________________________________________________________________\n&gt; Don&#39;t get caught with egg on your face. Play Chicktionary!\n&gt; http://club.live.com/chicktionary.aspx?icid=chick_wlhmtextlink1_dec\n&gt;"}