{"id": "4237", "subject": "Re: [EVP-ITC] Slept on it!?", "author": "Zack Widup", "timestamp": "2007-12-13T15:48:27Z", "full_text": "I might have mentioned this here before, but the late photographer and \neducator Fred Picker used to have a big rubber stamp that just said &quot;TRY \nIT!&quot;.  If you wrote to him with a question, most of the time he&#39;d just \nstamp your letter with that stamp, sign it &quot;Sincerely, Fred Picker&quot; and \nsend it back to you.\n\nWhat is &quot;logical&quot; often doesn&#39;t work out that way in the real world. \nOtherwise, why bother to do any research at all in any field?\n\nZack\n\nOn Thu, 13 Dec 2007, Frank Sumption wrote:\n\n&gt;\n&gt; Well, when ya get someone giving seemingly valid reasons why these new methods are invalid, or questionable, then I turn on the RS hack rig, and &quot;they&quot; are singing &quot;Purple&quot; across the band, and then the scan starts again at the bottom of AM with &quot;DO NOT---QUIT----GROUP&quot; (the --- indicate gaps with no broadcasts or voice fragments), I&#39;m supposed to believe that&#39;s just my imagination, that these things don&#39;t work. The fact is all these methods work, and they have in fact been used long before the box.\n&gt;\n&gt; This &quot;Researcher&quot; I was arguing with yesterday no doubt thought he had me convinced, and on his side. I can&#39;t go there after I get clear, coherent, meaningful messages with these other methods. I would like to keep the disaggreements friendly, and the discussions friendly, and I do consider the opposing viewpoint, but it just doesn&#39;t hold water in the case of these alternate radio methods. That&#39;s why no interviews, and no in person meetings--as such, I can be put into a postion of sympathy with a person when I don&#39;t actually agree. It&#39;s called lack of assertiveness, and I did in fact fail assertiveness training in the community college! As soon as the meeting is over though, I&#39;m going to tell ya to bite me, and do my own thing anyway.\n&gt;\n&gt; I think we all have to be very careful when critisizing someone&#39;s work here, research, or comments--in public. So far very little of the EVP stuff can be considered hard evidence, it&#39;s all what they call anecdotal, or it&#39;s what one or more witnesses experienced, but it&#39;s not repeatable--pretty much. Or you can&#39;t grab someone off the street, have them listen to voices and expect they&#39;ll hear it.\n&gt;\n&gt; I can&#39;t say my results are anymore valid than anyone else&#39;s&#39; but I also can&#39;t accpet that anyone else&#39;s results are more valid than my own. I am an independent researcher, I do this work on my own, it&#39;s more like just a hobby. I don&#39;t sell anything, and I make nothing by endorsing other products. When I say the Mini Box works, and the Radio Shack hack works, that is the honest thing to do, it&#39;s not cuz I get a kick back, as I get nothing in return, except to know I did the right thing.\n&gt;\n&gt; As for this other &quot;Researcher&quot;, I don&#39;t know what to tell ya. I can only ask, give us some friggin&#39; credit! There&#39;s some good peole here, and to dismiss us, and all or our results is extremely insulting.\n&gt;\n&gt; As for the possiblities of danger with this research, I&#39;ve been thinking about that. First I don&#39;t know of anyone else that has had any problems directly related to box use, and or paranormal work fro that matter.  It&#39;s like listening to some bible thumper swearing the devil is really right there, just waiting to jump down your throat, and yet, there&#39;s..... nothing. So far it&#39;s more threatening to cross the street every morning (I usually walk to work).\n&gt;\n&gt; I pretty much work by myself, I like it that way, and sharing what I get here. I don&#39;t wanna be TAPS, or any other thing. I don&#39;t care who accepts my results, I do this for myself, for my own curiosity. I&#39;m not going to accept someone else&#39;s version of reality, and I trust my own intuition.\n&gt;\n&gt; I&#39;m sorry if someone thought I implied this shit came from  Edison, or anyone else. I don&#39;t recall that. It&#39;s more likely that someone suggested it was Edison&#39;s concept, or whatever, and I kinda agreed it was like that for discussion--I don&#39;t know.  I know how it came about in my own mind, as problems are often solved, your own subconcius mind will assemble an answer based on previous experience, and I had worked with voltage tunable radios in the mid 90&#39;s, then I got interested in EVP, then I used EVPmaker, then my own mind connected all the dots, nothing mysterious, or other worldly about it. It&#39;s that same process that takes place when you sleep on a problem, and wake up with a solution. I did not understand the process at first, but it&#39;s very common.\n&gt;\n&gt; Frank-S"}