{"id": "4242", "subject": "Re: [EVP-ITC] Slept on it!?", "author": "juli velazquez", "timestamp": "2007-12-13T16:19:54Z", "full_text": "--0-2010906240-1197562794=:92384\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nFrank,  \n               You are very respected and your hard work and dedication reflects that.  What originally set out to satisfy your curiosity and flourished and developed paving the pathway for those who thirst the same knowledge as you.  You mentioned that the anyone off the street just may not decipher what we truly hear or the fact that we will not be able to convince those who are skeptics to change their minds, what I can tell you first hand is not true.\n   \n                As you know pursuant to my private correspondence, that I work will authorities on missing and murdered children.  Since obtaining a RS hacked I have worked consistently everyday trying to build a relationship and further my research.  Through the guidance of many of this group  (especially Bruce and Steve) they have assisted me in obtaining details (which were confirmed by autopsy reports, and personal statement) as well as additional information in which law enforcement did not have.  These messages which have come through the form of spirit communication have not only helped in providing the authorities with leads to follow, but may just in fact assist in bringing the remains of a child home to their family for proper burial.  The fact the the law enforce officials have opened their minds that this type of communication is possible in itself, is a huge step.  Although the recorded message would not be used as any evidence in the cases, they still provide\n a direction in where to look to collect the evidence that is needed.  If we just help one of these families, just one, then all of the time, effort and dedication is worth it.\n   \n  If it was not for you and your curiosity none of this information would be out there.  You have touched so many peoples lives many that you will never even meet.  With the continual research of yourself and those in this group, you are making the difference and a positive impact not only here in the physical but also the other side.\n\nFrank Sumption &lt;franks-boxes@...&gt; wrote:\n           Well, when ya get someone giving seemingly valid reasons why these new methods are invalid, or questionable, then I turn on the RS hack rig, and &quot;they&quot; are singing &quot;Purple&quot; across the band, and then the scan starts again at the bottom of AM with &quot;DO NOT---QUIT----GROUP&quot; (the --- indicate gaps with no broadcasts or voice fragments), I&#39;m supposed to believe that&#39;s just my imagination, that these things don&#39;t work. The fact is all these methods work, and they have in fact been used long before the box. \n \n This &quot;Researcher&quot; I was arguing with yesterday no doubt thought he had me convinced, and on his side. I can&#39;t go there after I get clear, coherent, meaningful messages with these other methods. I would like to keep the disaggreements friendly, and the discussions friendly, and I do consider the opposing viewpoint, but it just doesn&#39;t hold water in the case of these alternate radio methods. That&#39;s why no interviews, and no in person meetings--as such, I can be put into a postion of sympathy with a person when I don&#39;t actually agree. It&#39;s called lack of assertiveness, and I did in fact fail assertiveness training in the community college! As soon as the meeting is over though, I&#39;m going to tell ya to bite me, and do my own thing anyway. \n \n I think we all have to be very careful when critisizing someone&#39;s work here, research, or comments--in public. So far very little of the EVP stuff can be considered hard evidence, it&#39;s all what they call anecdotal, or it&#39;s what one or more witnesses experienced, but it&#39;s not repeatable--pretty much. Or you can&#39;t grab someone off the street, have them listen to voices and expect they&#39;ll hear it. \n \n I can&#39;t say my results are anymore valid than anyone else&#39;s&#39; but I also can&#39;t accpet that anyone else&#39;s results are more valid than my own. I am an independent researcher, I do this work on my own, it&#39;s more like just a hobby. I don&#39;t sell anything, and I make nothing by endorsing other products. When I say the Mini Box works, and the Radio Shack hack works, that is the honest thing to do, it&#39;s not cuz I get a kick back, as I get nothing in return, except to know I did the right thing. \n \n As for this other &quot;Researcher&quot;, I don&#39;t know what to tell ya. I can only ask, give us some friggin&#39; credit! There&#39;s some good peole here, and to dismiss us, and all or our results is extremely insulting.\n \n As for the possiblities of danger with this research, I&#39;ve been thinking about that. First I don&#39;t know of anyone else that has had any problems directly related to box use, and or paranormal work fro that matter.  It&#39;s like listening to some bible thumper swearing the devil is really right there, just waiting to jump down your throat, and yet, there&#39;s..... nothing. So far it&#39;s more threatening to cross the street every morning (I usually walk to work). \n \n I pretty much work by myself, I like it that way, and sharing what I get here. I don&#39;t wanna be TAPS, or any other thing. I don&#39;t care who accepts my results, I do this for myself, for my own curiosity. I&#39;m not going to accept someone else&#39;s version of reality, and I trust my own intuition.\n \n I&#39;m sorry if someone thought I implied this shit came from  Edison, or anyone else. I don&#39;t recall that. It&#39;s more likely that someone suggested it was Edison&#39;s concept, or whatever, and I kinda agreed it was like that for discussion--I don&#39;t know.  I know how it came about in my own mind, as problems are often solved, your own subconcius mind will assemble an answer based on previous experience, and I had worked with voltage tunable radios in the mid 90&#39;s, then I got interested in EVP, then I used EVPmaker, then my own mind connected all the dots, nothing mysterious, or other worldly about it. It&#39;s that same process that takes place when you sleep on a problem, and wake up with a solution. I did not understand the process at first, but it&#39;s very common. \n \n \n \n \n \n Frank-S\n\n  \n---------------------------------\n  Get the power of Windows + Web with the new Windows Live. Get it now!   \n\n                         \n\n\n\n  The contents of this eletronic correspondence is private & confidential and meant only for the party and/or parties it is addressed to.  \n   \n  No part of this email transmission may be publicly posted or forwarded to other parties without explicit written permission.\n\n\r\n--0-2010906240-1197562794=:92384\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;DIV&gt;Frank,&nbsp; &lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; You are very respected and your hard work and dedication reflects that.&nbsp; What originally set out to satisfy your curiosity and flourished and developed paving the pathway for those who thirst the same knowledge as you.&nbsp; You mentioned that the anyone off the street just may not decipher what we truly hear or the fact that we will not be able to convince those who are skeptics to change their minds, what I can tell you first hand is not true.&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; As you know pursuant to my private correspondence, that I work will authorities on missing and murdered children.&nbsp; Since obtaining a RS hacked I have worked consistently everyday trying to build a relationship and further my research.&nbsp; Through the guidance of many of this group&nbsp; (especially Bruce and\n Steve) they&nbsp;have assisted me in obtaining details (which were confirmed by autopsy reports, and personal statement) as well as additional information&nbsp;in which law enforcement did not&nbsp;have.&nbsp;&nbsp;These messages which have come through the form of spirit communication have not only helped in providing the authorities with leads to follow, but may just in fact assist in bringing&nbsp;the remains of a child home to their family&nbsp;for proper burial.&nbsp; The fact the the law enforce officials have opened their minds that this type of communication is possible in itself,&nbsp;is a huge step.&nbsp; Although the recorded message would not be used as any evidence in the cases, they still provide a direction in where to look to collect the evidence that is needed.&nbsp; If we just help one of these families, just one, then all of the time, effort and dedication is worth it.&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;If it was not for you and your curiosity none of this\n information would be out there.&nbsp; You have touched so many peoples lives many that you will never even meet.&nbsp; With the continual research of yourself and those in this group, you are making the difference and a positive impact not only here in the physical but also the other side.&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;Frank Sumption &lt;franks-boxes@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/DIV&gt;  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;DIV&gt;&nbsp;Well, when ya get someone giving seemingly valid reasons why these new methods are invalid, or questionable, then I turn on the RS hack rig, and &quot;they&quot; are singing &quot;Purple&quot; across the band, and then the\n scan starts again at the bottom of AM with &quot;DO NOT---QUIT--&lt;WBR&gt;--GROUP&quot; (the --- indicate gaps with no broadcasts or voice fragments), I&#39;m supposed to believe that&#39;s just my imagination, that these things don&#39;t work. The fact is all these methods work, and they have in fact been used long before the box. &lt;BR&gt;&nbsp;&lt;BR&gt;&nbsp;This &quot;Researcher&quot;&nbsp;I was arguing with yesterday no doubt thought he had me convinced, and on his side. I can&#39;t go there after I get clear, coherent, meaningful messages with these other methods. I would like to keep the disaggreements friendly, and the discussions friendly, and I do consider the opposing viewpoint, but it just doesn&#39;t hold water in the case of these alternate radio methods. That&#39;s why no interviews, and no in person meetings--as such, I can be put into a postion of sympathy with a person when I don&#39;t actually agree. It&#39;s called lack of assertiveness, and I did in fact fail assertiveness training in the community college! As soon as\n the meeting is over though, I&#39;m going to tell ya to bite me, and do my own thing anyway. &lt;BR&gt;&nbsp;&lt;BR&gt;&nbsp;I think we all have to be very careful when critisizing someone&#39;s work here, research, or comments--in public. So far very little of the EVP stuff can be considered hard evidence, it&#39;s all what they call anecdotal, or it&#39;s what one or more witnesses experienced, but it&#39;s not repeatable--&lt;WBR&gt;pretty much. Or you can&#39;t grab someone off the street, have them listen to voices and expect they&#39;ll hear it. &lt;BR&gt;&nbsp;&lt;BR&gt;&nbsp;I can&#39;t say my results are anymore valid than anyone else&#39;s&#39; but I also can&#39;t accpet that anyone else&#39;s results are more valid than my own. I am an independent researcher, I do this work on my own, it&#39;s more&nbsp;like just a hobby. I don&#39;t sell anything, and I make nothing by endorsing other products. When I say the Mini Box works, and the Radio Shack hack works, that is the honest thing to do, it&#39;s not cuz I get a kick back, as I get nothing in\n return, except to know I did the right thing. &lt;BR&gt;&nbsp;&lt;BR&gt;&nbsp;As for this other &quot;Researcher&quot;&lt;WBR&gt;, I don&#39;t know what to tell ya.&nbsp;I can only ask, give us some&nbsp;friggin&#39; credit! There&#39;s some good peole here, and to dismiss us, and all or our results is extremely insulting.&lt;BR&gt;&nbsp;&lt;BR&gt;&nbsp;As for the possiblities of danger with this research, I&#39;ve been thinking about that. First&nbsp;I don&#39;t know of anyone else that has&nbsp;had any problems directly related to box use, and or paranormal work fro that matter.&nbsp; It&#39;s like listening&nbsp;to some bible thumper swearing&nbsp;the devil is really right there, just waiting to jump down your throat, and yet, there&#39;s..... nothing. So far it&#39;s more threatening to cross the street every morning (I usually walk to work). &lt;BR&gt;&nbsp;&lt;BR&gt;&nbsp;I pretty much work by myself, I like it that way, and sharing what I get here. I don&#39;t wanna be TAPS, or any other thing. I don&#39;t care who accepts my results, I do this for myself,\n for my own curiosity. I&#39;m not going to accept someone else&#39;s version of reality,&nbsp;and&nbsp;I trust my own intuition.&lt;BR&gt;&nbsp;&lt;BR&gt;&nbsp;I&#39;m sorry if someone thought I implied this shit came from&nbsp; Edison, or anyone else. I don&#39;t recall that. It&#39;s more likely that someone suggested it was Edison&#39;s concept, or whatever, and I kinda agreed it was like that for discussion--&lt;WBR&gt;I don&#39;t know. &nbsp;I know how it came about in my own mind, as problems are often solved, your own subconcius mind will assemble an answer based on previous experience, and I had worked with voltage tunable radios in the mid 90&#39;s, then I got interested in EVP, then I used EVPmaker, then my own mind connected all the dots, nothing mysterious, or other worldly&nbsp;about it. It&#39;s that same process that takes place when you sleep on a problem, and wake up with a solution. I did not understand the process at first, but it&#39;s very common.\n &lt;BR&gt;&nbsp;&lt;BR&gt;&nbsp;&lt;BR&gt;&nbsp;&lt;BR&gt;&nbsp;&lt;BR&gt;&nbsp;&lt;BR&gt;&nbsp;Frank-S&lt;BR&gt;&lt;BR&gt;  &lt;HR&gt;  Get the power of Windows + Web with the new Windows Live. &lt;A href=&quot;http://www.windowslive.com/?ocid=TXT_TAGHM_Wave2_powerofwindows_122007&quot; target=_new&gt;Get it now!&lt;/A&gt;   &lt;DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;!--End\n group email --&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;&lt;DIV&gt;  &lt;div&gt;&lt;EM&gt;&lt;STRONG&gt;&lt;FONT color=#0000ff&gt;The contents of this eletronic correspondence is private &amp; confidential and meant only for the party and/or parties it is addressed to.&nbsp; &lt;/FONT&gt;&lt;/STRONG&gt;&lt;/EM&gt;&lt;/div&gt;  &lt;div&gt;&lt;EM&gt;&lt;STRONG&gt;&lt;FONT color=#0000ff&gt;&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/EM&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;&lt;EM&gt;&lt;STRONG&gt;&lt;FONT color=#0000ff&gt;No part of this email transmission may be publicly posted or forwarded to other parties without explicit written permission.&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/EM&gt;&lt;/div&gt;&lt;/DIV&gt;\r\n--0-2010906240-1197562794=:92384--"}