{"id": "4264", "subject": "Re: My first session with Joe&#39;s Box", "author": "Steve Hultay", "timestamp": "2007-12-14T02:59:04Z", "full_text": "Ursula,\n\nGreat files, i&#39;m glad to see you are getting results right away.  If \nyou need anything just let me know and i&#39;ll help the best i can.  It \nsure seems like you are doing just fine on your own though.  Keep up \nthe good work and i look forward to future posts.  Joe&#39;s box is \ndefinetely different than other boxes out there, i know i&#39;ve used \nthem all.  It&#39;s not as smooth running, but the answers are very loud \nand direct.\n\n-Steve H.\n\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;lalarutabaga&quot; &lt;ursulabielski@...&gt; \nwrote:\n&gt;\n&gt; Received and held my first session with Joe&#39;s Box yesterday, and \n&gt; thought it might be good to see what you guys think of what I got. \nI \n&gt; will upload them in a minute under Ursula- Joe&#39;s Box. \n&gt; \n&gt; The two clips are actually from the second session, which I did \nabout \n&gt; five minutes after the first, uneventful one.\n&gt; \n&gt; Both clips are from the same session.\n&gt; \n&gt; The first clip is from the beginnng of the four-minute session.  I \n&gt; have just asked, &quot;Is there something you want to say?&quot; and then \n&gt; before and while I repeat the question, a voice says, &quot;-the fuck \nup.  \n&gt; Shut the--&quot;\n&gt; \n&gt; The second clip happens later.  I had asked &quot;What is my name?&quot; and \n&gt; the earlier (&quot;shutthefuckup&quot;) smart-alecky voice had \nanswered &quot;Ursula \n&gt; Anne&quot; in a singsong way (This is a little weird because my real \nname \n&gt; is Anne Ursula, so kids used to tease me by calling me Ursula Anne \nat \n&gt; school after I started going by my middle name at age 11.) \n&gt; \n&gt; The second clip starts immediately after, when the same voice \n&gt; says, &quot;Zip It!&quot;\n&gt; Then, a second voice says, &quot;Shhh. Listen, you&#39;ll scare her.&quot; \n&gt; Then the first voice says, &quot;Aww!&quot;  Then something I can&#39;t make out \nin \n&gt; short bursts.\n&gt; Then, I say &quot;I&#39;m listening&quot; because I heard &quot;Listen&quot; from the \nsecond \n&gt; voice.\n&gt; After my voice you hear &quot;Here you go!&quot; and then &quot;What&#39;s Up?!&quot; from \n&gt; that second voice again.\n&gt; \n&gt; I&#39;m full of wonder about this box.  It was odd. People say the \nboxes \n&gt; FEEL different from anything else, and I really did.  I KNEW \nsomehow \n&gt; when I started that second session that there would be something, \nand \n&gt; it was like the language opened itself up to me.  It&#39;s a very \n&gt; different sounding sort of thing from anything else.  I can&#39;t \nreally \n&gt; describe it.  It&#39;s much, much different from anything I&#39;ve done \n&gt; before and quite Awe-some in a literal sense.\n&gt; \n&gt; I was also very surprised that I wasn&#39;t at all afraid of whatever \n&gt; idiot was swearing and saying stupid things.  Like a bully on a \n&gt; playground, really.  Nothing scarier than that.  \n&gt; \n&gt; Thanks, Steve, for giving me the chance to experience this tool.  \nAnd \n&gt; thanks, Frank, dear Frank who I&#39;ve never met, for having the box \nidea \n&gt; in the first place.\n&gt; \n&gt; Ursula\n&gt;"}