{"id": "4270", "subject": "Re: Slept on it!?", "author": "Frank Sumption", "timestamp": "2007-12-14T04:42:17Z", "full_text": "Thanks!  This field can get confusing sometimes. \n\n Frank-S\n\n --- In EVP-ITC@yahoogroups.com, Lisby &lt;lisby@...&gt; wrote:\n&gt;\n&gt; Frank, buddy, I&#39;m glad to hear that the Purples made their point \nof  \n&gt; view clear. ;)\n&gt; \n&gt; You and I go back all the way to the AA-EVP list and I always have  \n&gt; counted you as someone who told the truth, no matter how  \n&gt; uncomfortable it was. You do the right thing as often as you can.  \n&gt; I&#39;ve seen you struggle over the years, and you always choose the \npath  \n&gt; that harms no one and brings you no fame or fortune. Good on you, \nI  \n&gt; say, and more of it.\n&gt; \n&gt; We&#39;re here because we respect you, Frank, and because you provide \nan  \n&gt; honest forum for this research. We&#39;re not leaving. Just try and \nmake  \n&gt; us. ;)\n&gt; \n&gt; Ann\n&gt; \n&gt; On Dec 13, 2007, at 10:26 AM, Frank Sumption wrote:\n&gt; \n&gt; &gt;  Well, when ya get someone giving seemingly valid reasons why \nthese  \n&gt; &gt; new methods are invalid, or questionable, then I turn on the RS  \n&gt; &gt; hack rig, and &quot;they&quot; are singing &quot;Purple&quot; across the band, and \nthen  \n&gt; &gt; the scan starts again at the bottom of AM with &quot;DO NOT---QUIT---- \n&gt; &gt; GROUP&quot; (the --- indicate gaps with no broadcasts or voice  \n&gt; &gt; fragments), I&#39;m supposed to believe that&#39;s just my imagination,  \n&gt; &gt; that these things don&#39;t work. The fact is all these methods \nwork,  \n&gt; &gt; and they have in fact been used long before the box.\n&gt; &gt;\n&gt; &gt;  This &quot;Researcher&quot; I was arguing with yesterday no doubt thought \nhe  \n&gt; &gt; had me convinced, and on his side. I can&#39;t go there after I get  \n&gt; &gt; clear, coherent, meaningful messages with these other methods. I  \n&gt; &gt; would like to keep the disaggreements friendly, and the \ndiscussions  \n&gt; &gt; friendly, and I do consider the opposing viewpoint, but it just  \n&gt; &gt; doesn&#39;t hold water in the case of these alternate radio methods.  \n&gt; &gt; That&#39;s why no interviews, and no in person meetings--as such, I \ncan  \n&gt; &gt; be put into a postion of sympathy with a person when I don&#39;t  \n&gt; &gt; actually agree. It&#39;s called lack of assertiveness, and I did in  \n&gt; &gt; fact fail assertiveness training in the community college! As \nsoon  \n&gt; &gt; as the meeting is over though, I&#39;m going to tell ya to bite me, \nand  \n&gt; &gt; do my own thing anyway.\n&gt; &gt;\n&gt; &gt;  I think we all have to be very careful when critisizing \nsomeone&#39;s  \n&gt; &gt; work here, research, or comments--in public. So far very little \nof  \n&gt; &gt; the EVP stuff can be considered hard evidence, it&#39;s all what \nthey  \n&gt; &gt; call anecdotal, or it&#39;s what one or more witnesses experienced, \nbut  \n&gt; &gt; it&#39;s not repeatable--pretty much. Or you can&#39;t grab someone off \nthe  \n&gt; &gt; street, have them listen to voices and expect they&#39;ll hear it.\n&gt; &gt;\n&gt; &gt;  I can&#39;t say my results are anymore valid than anyone else&#39;s&#39; but \nI  \n&gt; &gt; also can&#39;t accpet that anyone else&#39;s results are more valid than \nmy  \n&gt; &gt; own. I am an independent researcher, I do this work on my own, \nit&#39;s  \n&gt; &gt; more like just a hobby. I don&#39;t sell anything, and I make \nnothing  \n&gt; &gt; by endorsing other products. When I say the Mini Box works, and \nthe  \n&gt; &gt; Radio Shack hack works, that is the honest thing to do, it&#39;s not  \n&gt; &gt; cuz I get a kick back, as I get nothing in return, except to know \nI  \n&gt; &gt; did the right thing.\n&gt; &gt;\n&gt; &gt;  As for this other &quot;Researcher&quot;, I don&#39;t know what to tell ya. I  \n&gt; &gt; can only ask, give us some friggin&#39; credit! There&#39;s some good \npeole  \n&gt; &gt; here, and to dismiss us, and all or our results is extremely  \n&gt; &gt; insulting.\n&gt; &gt;\n&gt; &gt;  As for the possiblities of danger with this research, I&#39;ve been  \n&gt; &gt; thinking about that. First I don&#39;t know of anyone else that has \nhad  \n&gt; &gt; any problems directly related to box use, and or paranormal work  \n&gt; &gt; fro that matter.  It&#39;s like listening to some bible thumper  \n&gt; &gt; swearing the devil is really right there, just waiting to jump \ndown  \n&gt; &gt; your throat, and yet, there&#39;s..... nothing. So far it&#39;s more  \n&gt; &gt; threatening to cross the street every morning (I usually walk to  \n&gt; &gt; work).\n&gt; &gt;\n&gt; &gt;  I pretty much work by myself, I like it that way, and sharing \nwhat  \n&gt; &gt; I get here. I don&#39;t wanna be TAPS, or any other thing. I don&#39;t \ncare  \n&gt; &gt; who accepts my results, I do this for myself, for my own \ncuriosity.  \n&gt; &gt; I&#39;m not going to accept someone else&#39;s version of reality, and I  \n&gt; &gt; trust my own intuition.\n&gt; &gt;\n&gt; &gt;  I&#39;m sorry if someone thought I implied this shit came from   \n&gt; &gt; Edison, or anyone else. I don&#39;t recall that. It&#39;s more likely \nthat  \n&gt; &gt; someone suggested it was Edison&#39;s concept, or whatever, and I \nkinda  \n&gt; &gt; agreed it was like that for discussion--I don&#39;t know.  I know \nhow  \n&gt; &gt; it came about in my own mind, as problems are often solved, your  \n&gt; &gt; own subconcius mind will assemble an answer based on previous  \n&gt; &gt; experience, and I had worked with voltage tunable radios in the \nmid  \n&gt; &gt; 90&#39;s, then I got interested in EVP, then I used EVPmaker, then \nmy  \n&gt; &gt; own mind connected all the dots, nothing mysterious, or other  \n&gt; &gt; worldly about it. It&#39;s that same process that takes place when \nyou  \n&gt; &gt; sleep on a problem, and wake up with a solution. I did not  \n&gt; &gt; understand the process at first, but it&#39;s very common.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;  Frank-S\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Get the power of Windows + Web with the new Windows Live. Get it \nnow!\n&gt; &gt;\n&gt; &gt;\n&gt;"}