{"id": "4272", "subject": "Re: Slept on it!?", "author": "Frank Sumption", "timestamp": "2007-12-14T04:59:17Z", "full_text": "Thank you very much. It&#39;s easy to lose sight of some of this stuff.\n\n Frank-S\n\n\n--- In EVP-ITC@yahoogroups.com, juli velazquez &lt;ghostchasingfool@...&gt; \nwrote:\n&gt;\n&gt; Frank,  \n&gt;                You are very respected and your hard work and \ndedication reflects that.  What originally set out to satisfy your \ncuriosity and flourished and developed paving the pathway for those \nwho thirst the same knowledge as you.  You mentioned that the anyone \noff the street just may not decipher what we truly hear or the fact \nthat we will not be able to convince those who are skeptics to change \ntheir minds, what I can tell you first hand is not true.\n&gt;    \n&gt;                 As you know pursuant to my private correspondence, \nthat I work will authorities on missing and murdered children.  Since \nobtaining a RS hacked I have worked consistently everyday trying to \nbuild a relationship and further my research.  Through the guidance \nof many of this group  (especially Bruce and Steve) they have \nassisted me in obtaining details (which were confirmed by autopsy \nreports, and personal statement) as well as additional information in \nwhich law enforcement did not have.  These messages which have come \nthrough the form of spirit communication have not only helped in \nproviding the authorities with leads to follow, but may just in fact \nassist in bringing the remains of a child home to their family for \nproper burial.  The fact the the law enforce officials have opened \ntheir minds that this type of communication is possible in itself, is \na huge step.  Although the recorded message would not be used as any \nevidence in the cases, they still provide\n&gt;  a direction in where to look to collect the evidence that is \nneeded.  If we just help one of these families, just one, then all of \nthe time, effort and dedication is worth it.\n&gt;    \n&gt;   If it was not for you and your curiosity none of this information \nwould be out there.  You have touched so many peoples lives many that \nyou will never even meet.  With the continual research of yourself \nand those in this group, you are making the difference and a positive \nimpact not only here in the physical but also the other side.\n&gt; \n&gt; Frank Sumption &lt;franks-boxes@...&gt; wrote:\n&gt;            Well, when ya get someone giving seemingly valid reasons \nwhy these new methods are invalid, or questionable, then I turn on \nthe RS hack rig, and &quot;they&quot; are singing &quot;Purple&quot; across the band, and \nthen the scan starts again at the bottom of AM with &quot;DO NOT---QUIT----\nGROUP&quot; (the --- indicate gaps with no broadcasts or voice fragments), \nI&#39;m supposed to believe that&#39;s just my imagination, that these things \ndon&#39;t work. The fact is all these methods work, and they have in fact \nbeen used long before the box. \n&gt;  \n&gt;  This &quot;Researcher&quot; I was arguing with yesterday no doubt thought he \nhad me convinced, and on his side. I can&#39;t go there after I get \nclear, coherent, meaningful messages with these other methods. I \nwould like to keep the disaggreements friendly, and the discussions \nfriendly, and I do consider the opposing viewpoint, but it just \ndoesn&#39;t hold water in the case of these alternate radio methods. \nThat&#39;s why no interviews, and no in person meetings--as such, I can \nbe put into a postion of sympathy with a person when I don&#39;t actually \nagree. It&#39;s called lack of assertiveness, and I did in fact fail \nassertiveness training in the community college! As soon as the \nmeeting is over though, I&#39;m going to tell ya to bite me, and do my \nown thing anyway. \n&gt;  \n&gt;  I think we all have to be very careful when critisizing someone&#39;s \nwork here, research, or comments--in public. So far very little of \nthe EVP stuff can be considered hard evidence, it&#39;s all what they \ncall anecdotal, or it&#39;s what one or more witnesses experienced, but \nit&#39;s not repeatable--pretty much. Or you can&#39;t grab someone off the \nstreet, have them listen to voices and expect they&#39;ll hear it. \n&gt;  \n&gt;  I can&#39;t say my results are anymore valid than anyone else&#39;s&#39; but I \nalso can&#39;t accpet that anyone else&#39;s results are more valid than my \nown. I am an independent researcher, I do this work on my own, it&#39;s \nmore like just a hobby. I don&#39;t sell anything, and I make nothing by \nendorsing other products. When I say the Mini Box works, and the \nRadio Shack hack works, that is the honest thing to do, it&#39;s not cuz \nI get a kick back, as I get nothing in return, except to know I did \nthe right thing. \n&gt;  \n&gt;  As for this other &quot;Researcher&quot;, I don&#39;t know what to tell ya. I \ncan only ask, give us some friggin&#39; credit! There&#39;s some good peole \nhere, and to dismiss us, and all or our results is extremely \ninsulting.\n&gt;  \n&gt;  As for the possiblities of danger with this research, I&#39;ve been \nthinking about that. First I don&#39;t know of anyone else that has had \nany problems directly related to box use, and or paranormal work fro \nthat matter.  It&#39;s like listening to some bible thumper swearing the \ndevil is really right there, just waiting to jump down your throat, \nand yet, there&#39;s..... nothing. So far it&#39;s more threatening to cross \nthe street every morning (I usually walk to work). \n&gt;  \n&gt;  I pretty much work by myself, I like it that way, and sharing what \nI get here. I don&#39;t wanna be TAPS, or any other thing. I don&#39;t care \nwho accepts my results, I do this for myself, for my own curiosity. \nI&#39;m not going to accept someone else&#39;s version of reality, and I \ntrust my own intuition.\n&gt;  \n&gt;  I&#39;m sorry if someone thought I implied this shit came from  \nEdison, or anyone else. I don&#39;t recall that. It&#39;s more likely that \nsomeone suggested it was Edison&#39;s concept, or whatever, and I kinda \nagreed it was like that for discussion--I don&#39;t know.  I know how it \ncame about in my own mind, as problems are often solved, your own \nsubconcius mind will assemble an answer based on previous experience, \nand I had worked with voltage tunable radios in the mid 90&#39;s, then I \ngot interested in EVP, then I used EVPmaker, then my own mind \nconnected all the dots, nothing mysterious, or other worldly about \nit. It&#39;s that same process that takes place when you sleep on a \nproblem, and wake up with a solution. I did not understand the \nprocess at first, but it&#39;s very common. \n&gt;  \n&gt;  \n&gt;  \n&gt;  \n&gt;  \n&gt;  Frank-S\n&gt; \n&gt;   \n&gt; ---------------------------------\n&gt;   Get the power of Windows + Web with the new Windows Live. Get it \nnow!   \n&gt; \n&gt;                          \n&gt; \n&gt; \n&gt; \n&gt;   The contents of this eletronic correspondence is private & \nconfidential and meant only for the party and/or parties it is \naddressed to.  \n&gt;    \n&gt;   No part of this email transmission may be publicly posted or \nforwarded to other parties without explicit written permission.\n&gt;"}