{"id": "4280", "subject": "Re: My mistruths...", "author": "babiarz3", "timestamp": "2007-12-14T13:38:35Z", "full_text": "Mike,\nI don&#39;t know if he tried to hide the article or not. It may have been\na coincidence that it disappeared within hours of me posting what had\nbeen said. It took me awhile but, I re-found it. I&#39;m going to assume\nthat if he really wanted it to completely disappear it would have.\nAlthough, writers are funny about their works. \nHis stating openly that he&#39;d like to bring it into schools... that&#39;s\nplain crazy. All my thoughts on negativity aside, do you really think\nschools and parents will allow someone to bring a spirit communication\ndevice into the class? &quot;Alright kiddos, this morning I&#39;m going to let\nyou listen to the voice of your dead relatives and who ever else might\ndecide to speak. Oh, and by the way, sometimes they use profanity. But\ndon&#39;t be scared.&quot;\nHowever, my point of contention remains the same. Children and high\nschool students should not be used as testing subjects. The attitude\nof we&#39;ll &quot;see what happens&quot; is irresponsible at best.  \nI do not know if Chris has tried the radio shack hack or not. I do\nknow that messages and emails are coming in stating no success. I do\nnot know the reasons for the lack of success. It could be as simple as\nnot hacking it correctly, lack of ability to hear the voices... It\ncould also just not work for everyone. I know that even REG has stated\nhere that she couldn&#39;t get reception on the Queen Mary in Long Beach\nCalifornia nor in a radio station for C2C, for the mini-box and other\ndevices she has. That confuses me some but... Also, another researcher\nclaimed to be unable to use his device due to fluorescent lighting. \nIt seems that the jury is still out. I&#39;m watching closely. I just hope\nthat the whole children and high school student thing is reconsidered.\nThey need to be old enough to make an informed educated decision on\nwhether or not they wish to be part of the testing group. \n\n\n--- In EVP-ITC@yahoogroups.com, &quot;M.A. Coletta (Mike)&quot;\n&lt;michaelcoletta@...&gt; wrote:\n&gt;\n&gt; I listened to an internet radio show yesterday where Mr. Moran was a \n&gt; guest.  He spoke about sending his field researchers out with mini-\n&gt; boxes to schools, nursing homes, colleges, etc.  He was very open \n&gt; about it on the show.  He advised the audience that he wanted to get \n&gt; opinions about the box from all walks of life.  I don&#39;t think this is \n&gt; something he is trying to hide...???\n&gt; \n&gt; Many of us our researchers here, and I think we would love to have \n&gt; our experimental devices tested by others.  Speaking of that, did you \n&gt; ever ask Mr. Moon to try the Radio Shack Hack 12-469/mixer setup I \n&gt; put together?  I seem to recall asking you to ask him a while back.\n&gt; \n&gt; I would like his opinion on how it works for him. I don&#39;t think he \n&gt; will melt or anything by using it...\n&gt; \n&gt; - Mike\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;babiarz3&quot; &lt;babiarz3@&gt; wrote:\n&gt; &gt;\n&gt; &gt; A few weeks ago I posted that Rick Moran had written an article\n&gt; &gt; stating that children and high school students would be part of the\n&gt; &gt; testing subjects of the mini-box. Later that day the article was\n&gt; &gt; replaced with a different article about the mini-box. I was told \n&gt; that\n&gt; &gt; I was stating mis truths. I wasn&#39;t. I finally was able to locate the\n&gt; &gt; missing article. I&#39;m providing a link to the entire article along \n&gt; with\n&gt; &gt; the statement regarding our children. If the link somehow becomes\n&gt; &gt; unavailable, I have done a screen shot and will provide it to \n&gt; whoever\n&gt; &gt; asks.\n&gt; &gt; Believe me when I say that this isn&#39;t to cause or stir crap. I was\n&gt; &gt; basically called a liar and this clears up that misconception. If I \n&gt; am\n&gt; &gt; banned from this group for telling the truth, than so be it. \n&gt; &gt; \n&gt; &gt; &quot;...it was not the question of whether the phenomenon existed to \n&gt; begin\n&gt; &gt; with, but rather what is the phenomenon.  That will require a good\n&gt; &gt; deal more effort to explore and beginning in January we will be\n&gt; &gt; undertaking test sessions all over north and east Texas as well as\n&gt; &gt; other national locations with a wide variety of folks to see what\n&gt; &gt; happens within the group dynamic.  The testing will include folks \n&gt; who\n&gt; &gt; are both believers and non-believers, skeptics, critics, other\n&gt; &gt; researchers, children, high school students, college and grad\n&gt; &gt; students, and senior citizens to name a few categories.&quot;\n&gt; &gt; \n&gt; &gt; http://www.asup-inc.org/pages/editorial11-29-07.html\n&gt; &gt; \n&gt; &gt; Are you willing to &quot;see what happens&quot; with our children?\n&gt; &gt;\n&gt;"}