{"id": "4289", "subject": "Re: Portable Ghost Box System video", "author": "LC Duplatt", "timestamp": "2007-12-14T17:32:24Z", "full_text": "Hey, no, thank you for sharing, Mike.  I went out and bought the \nmicrophone you use, and what a difference it should make.  It powers \nup with a AAA, so it probably ups the amps(?) so I can get more out \nof it than the lapel amped mic.  I am going to run experiments \ntonight and will update.\n\nThe echo chamber as Frank used might slow the mix down a bit and make \nit better to discern - so I want to test this, too.\n\nLC\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;M.A. Coletta (Mike)&quot; \n&lt;michaelcoletta@...&gt; wrote:\n&gt;\n&gt; Hi LC,\n&gt; \n&gt; Yes, the &quot;click&quot; can be cut down a bit by using a chamber.  It&#39;s \n&gt; a &quot;phase&quot; thing.  When the &quot;click&quot; (or any sound wave) is reached \nat \n&gt; the input mic at 180 degrees out of phase with the original I \n&gt; understand there is a cancel effect.  That works with any sound \nwave I \n&gt; think, so you&#39;re bound to have some &quot;clicks&quot; and their 180 out of \nphase \n&gt; wave reaching the mic nearly at the same time, cancelling somewhat.\n&gt; There is so much bouncing going on in there I would love to see \nwhat \n&gt; the entire pattern looks lke on a scope.  There must be alot of \nphase \n&gt; shifting going on.\n&gt; \n&gt; I tried my prototype with and without the chamber yesterday.  I \nfound a \n&gt; BIG different, and I&#39;m sticking with the chamber effect.  For one \n&gt; thing, it increased the amplification at least three-fold when I \nused \n&gt; the chamber, not to mention all the mixing and phasing.\n&gt; \n&gt; I hope to play some of my box audio files tonight on my internet \nradio \n&gt; show. Both from my chamber system and from the three 12-469/mixer \n&gt; system.\n&gt; \n&gt; Hey, LC... keep up the good work, and thanks for sharing!\n&gt; \n&gt; - Mike\n&gt; \n&gt; ------\n&gt; All my Radio Shack Hack videos can be found here:\n&gt; http://www.ufogeek.com\n&gt; \n&gt; My internet radio show can be found here:\n&gt; http://www.ghosttoghostpm.com\n&gt; \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;LC Duplatt&quot; &lt;lcdupla@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Thanks, Mike.  \n&gt; &gt; \n&gt; &gt; I am still working on different set-ups in a sound chamber.  I \n&gt; &gt; realize the chamber is not necessary, but I think with the 12-\n469, it \n&gt; &gt; helps to run it into a box to mix it, which helps remove \nthe &quot;click&quot; \n&gt; &gt; noise received while it sweeps the AM band.  Also, I want to try \n&gt; &gt; bouncing down an echo chamber, so it slows the sound down a bit \nto \n&gt; &gt; possibly make it easier to hear. Still experimenting here.\n&gt; &gt; \n&gt; &gt; LC\n&gt; &gt; http://www.AngelsGhosts.com\n&gt;"}