{"id": "4295", "subject": "Re: My box is shipping tomorrow!", "author": "M.A. Coletta (Mike)", "timestamp": "2007-12-15T13:27:46Z", "full_text": "Hi Ann,\n\nI&#39;m happy for your happy news!  Looks like more and more people are \ntaking possession of the many different boxes now available.  I look \nforward to reading about your adventures with your new Mini Box.\nLooking at their website, it appears the box already might have the \njack you&#39;re asking about.  The box has three connectors on the front, \n(Mic, Recorder, and Speaker)  Looks like the output is already tapped \noff in two places, one for the speaker and one for the recorder.  I&#39;m \nguessing the mic jack is so you can interface for a session, etc.\n\nLet us know how your works...\n\n- Mike\n\n--- In EVP-ITC@yahoogroups.com, Lisby &lt;lisby@...&gt; wrote:\n&gt;\n&gt; Is the speaker all I need or any kind of jack? For it?\n&gt; \n&gt; Steve, will also ask Lisa if she&#39;s aware of the &quot;technician&quot; who \nwill  \n&gt; hopefully be assisting me? I just want to get confirmation or  \n&gt; rejection of what I seem to be sensing.\n&gt; \n&gt; Thanks!\n&gt; \n&gt; Ann\n&gt; \n&gt; On Dec 13, 2007, at 10:10 PM, Steve Hultay wrote:\n&gt; \n&gt; &gt; Ann,\n&gt; &gt;\n&gt; &gt; I went to radio shack and bought a speaker model #21-549 and it \nseems\n&gt; &gt; to work fine. I got mine yesterday and didn&#39;t seem to thrilled \nabout\n&gt; &gt; the results and gave another try tonight. Tonight, i spoke to \nseveral\n&gt; &gt; different people in their own voices and really have to give \ncredit to\n&gt; &gt; Mike and Lisa for making this communication keep getting better. \nThis\n&gt; &gt; really is another valuable box in my research, as long as \ndifferent\n&gt; &gt; designs become available i will test them all. Every box is unique\n&gt; &gt; and offers different results, but they all work off the same \npremise\n&gt; &gt; of raw audio bits. Real time communication is finally here and \ngets\n&gt; &gt; better every day, some day&#39;s frank&#39;s box is better and than some \nday&#39;s\n&gt; &gt; RS box...etc. Depends on your surroundings, your mood, the weather\n&gt; &gt; but all these devices have worked for me up to this point and i&#39;m\n&gt; &gt; grateful.\n&gt; &gt;\n&gt; &gt; p.s.--here is the link to the speaker so you can get a visual.\n&gt; &gt;\n&gt; &gt; http://www.radioshack.com/search/index.jsp?kwCatId=&kw=21-\n&gt; &gt; 549&origkw=21-549&sr=1\n&gt; &gt;\n&gt; &gt; Your going to love this wild ride and watching new people get \ninvolved\n&gt; &gt; and posted results makes it all worth it for me.\n&gt; &gt;\n&gt; &gt; -Steve H.\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com, Lisby &lt;lisby@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; I just got my notice. I think I may faint from excitement.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Hey, fellow list dwellers who have one--what extra equipment to \nI\n&gt; &gt; &gt; need to have to make this function (speakers, but not computer\n&gt; &gt; &gt; speakers)? Anything else I can go out an get now? I am truly, \ntruly\n&gt; &gt; &gt; technology challenged, so guidance addressed to one like a \ntoddler\n&gt; &gt; is\n&gt; &gt; &gt; what I need.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Ann\n&gt; &gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt;"}