{"id": "4296", "subject": "Re: [EVP-ITC] Re: My box is shipping tomorrow!", "author": "Lisby", "timestamp": "2007-12-15T15:27:24Z", "full_text": "Oh don&#39;t worry, I will. I&#39;m not sure I ever ever been as excited in  \nmy life as I am about this.\n\nThank you, Mike, for the info.\n\nI listened to your shows, too, and liked them very much.\n\nAnn\n\nOn Dec 15, 2007, at 8:27 AM, M.A. Coletta (Mike) wrote:\n\n&gt; Hi Ann,\n&gt;\n&gt; I&#39;m happy for your happy news! Looks like more and more people are\n&gt; taking possession of the many different boxes now available. I look\n&gt; forward to reading about your adventures with your new Mini Box.\n&gt; Looking at their website, it appears the box already might have the\n&gt; jack you&#39;re asking about. The box has three connectors on the front,\n&gt; (Mic, Recorder, and Speaker) Looks like the output is already tapped\n&gt; off in two places, one for the speaker and one for the recorder. I&#39;m\n&gt; guessing the mic jack is so you can interface for a session, etc.\n&gt;\n&gt; Let us know how your works...\n&gt;\n&gt; - Mike\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, Lisby &lt;lisby@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Is the speaker all I need or any kind of jack? For it?\n&gt; &gt;\n&gt; &gt; Steve, will also ask Lisa if she&#39;s aware of the &quot;technician&quot; who\n&gt; will\n&gt; &gt; hopefully be assisting me? I just want to get confirmation or\n&gt; &gt; rejection of what I seem to be sensing.\n&gt; &gt;\n&gt; &gt; Thanks!\n&gt; &gt;\n&gt; &gt; Ann\n&gt; &gt;\n&gt; &gt; On Dec 13, 2007, at 10:10 PM, Steve Hultay wrote:\n&gt; &gt;\n&gt; &gt; &gt; Ann,\n&gt; &gt; &gt;\n&gt; &gt; &gt; I went to radio shack and bought a speaker model #21-549 and it\n&gt; seems\n&gt; &gt; &gt; to work fine. I got mine yesterday and didn&#39;t seem to thrilled\n&gt; about\n&gt; &gt; &gt; the results and gave another try tonight. Tonight, i spoke to\n&gt; several\n&gt; &gt; &gt; different people in their own voices and really have to give\n&gt; credit to\n&gt; &gt; &gt; Mike and Lisa for making this communication keep getting better.\n&gt; This\n&gt; &gt; &gt; really is another valuable box in my research, as long as\n&gt; different\n&gt; &gt; &gt; designs become available i will test them all. Every box is unique\n&gt; &gt; &gt; and offers different results, but they all work off the same\n&gt; premise\n&gt; &gt; &gt; of raw audio bits. Real time communication is finally here and\n&gt; gets\n&gt; &gt; &gt; better every day, some day&#39;s frank&#39;s box is better and than some\n&gt; day&#39;s\n&gt; &gt; &gt; RS box...etc. Depends on your surroundings, your mood, the weather\n&gt; &gt; &gt; but all these devices have worked for me up to this point and i&#39;m\n&gt; &gt; &gt; grateful.\n&gt; &gt; &gt;\n&gt; &gt; &gt; p.s.--here is the link to the speaker so you can get a visual.\n&gt; &gt; &gt;\n&gt; &gt; &gt; http://www.radioshack.com/search/index.jsp?kwCatId=&kw=21-\n&gt; &gt; &gt; 549&origkw=21-549&sr=1\n&gt; &gt; &gt;\n&gt; &gt; &gt; Your going to love this wild ride and watching new people get\n&gt; involved\n&gt; &gt; &gt; and posted results makes it all worth it for me.\n&gt; &gt; &gt;\n&gt; &gt; &gt; -Steve H.\n&gt; &gt; &gt;\n&gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com, Lisby &lt;lisby@&gt; wrote:\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; I just got my notice. I think I may faint from excitement.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Hey, fellow list dwellers who have one--what extra equipment to\n&gt; I\n&gt; &gt; &gt; &gt; need to have to make this function (speakers, but not computer\n&gt; &gt; &gt; &gt; speakers)? Anything else I can go out an get now? I am truly,\n&gt; truly\n&gt; &gt; &gt; &gt; technology challenged, so guidance addressed to one like a\n&gt; toddler\n&gt; &gt; &gt; is\n&gt; &gt; &gt; &gt; what I need.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Ann\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;\n&gt; \n\n\nOh don' wo y, I will. I'm no su e I e e e e been as exci ed in my li e as I am abou his.Thank you, Mike, o he in o.I lis ened o you shows, oo, and liked hem e y much.AnnOn Dec 15, 2007, a 8:27 AM, M.A. Cole a (Mike) w o e:Hi Ann,I'm happy o you happy news! Looks like mo e and mo e people a e  aking possession o he many di e en boxes now a ailable. I look  o wa d o eading abou you ad en u es wi h you new Mini Box.Looking a hei websi e, i appea s he box al eady migh ha e he jack you' e asking abou . The box has h ee connec o s on he on , (Mic, Reco de , and Speake ) Looks like he ou pu is al eady apped o in wo places, one o he speake and one o he eco de . I'm guessing he mic jack is so you can in e ace o a session, e c.Le us know how you wo ks...- Mike--- In EVP-ITC@yahoog oups.com, Lisby w o e:>> Is he speake all I need o any kind o jack? Fo i ?> > S e e, will also ask Lisa i she's awa e o he \" echnician\" who will > hope ully be assis ing me? I jus wan o ge con i ma ion o  > ejec ion o wha I seem o be sensing.> > Thanks!> > Ann> > On Dec 13, 2007, a 10:10 PM, S e e Hul ay w o e:> > > Ann,> >> > I wen o adio shack and bough a speake model #21-549 and i  seems> > o wo k ine. I go mine yes e day and didn' seem o h illed abou > > he esul s and ga e ano he y onigh . Tonigh , i spoke o se e al> > di e en people in hei own oices and eally ha e o gi e c edi o> > Mike and Lisa o making his communica ion keep ge ing be e . This> > eally is ano he aluable box in my esea ch, as long as di e en > > designs become a ailable i will es hem all. E e y box is unique> > and o e s di e en esul s, bu hey all wo k o he same p emise> > o aw audio bi s. Real ime communica ion is inally he e and ge s> > be e e e y day, some day's ank's box is be e and han some day's> > RS box...e c. Depends on you su oundings, you mood, he wea he > > bu all hese de ices ha e wo ked o me up o his poin and i'm> > g a e ul.> >> > p.s.--he e is he link o he speake so you can ge a isual.> >> > h p://www. adioshack.com/sea ch/index.jsp?kwCa Id=&kw=21-> > 549&o igkw=21-549&s =1> >> > You going o lo e his wild ide and wa ching new people ge  in ol ed> > and pos ed esul s makes i all wo h i o me.> >> > -S e e H.> >> > --- In EVP-ITC@yahoog oups.com, Lisby w o e:> > >> > > I jus go my no ice. I hink I may ain om exci emen .> > >> > > Hey, ellow lis dwelle s who ha e one--wha ex a equipmen o I> > > need o ha e o make his unc ion (speake s, bu no compu e > > > speake s)? Any hing else I can go ou an ge now? I am uly,  uly> > > echnology challenged, so guidance add essed o one like a  oddle > > is> > > wha I need.> > >> > > Ann> > >> >> >> >>"}