{"id": "4298", "subject": "Re: [EVP-ITC] Re: My box is shipping tomorrow!", "author": "Lisby", "timestamp": "2007-12-15T17:25:27Z", "full_text": "This would be wonderful, Bruce. If they have any messages for me,  \nplease let me know. I&#39;ll be delighted!\n\nAnn\n\n\nOn Dec 15, 2007, at 10:05 AM, bruce halliday wrote:\n\n&gt; Hi Ann,\n&gt;\n&gt; Since steve and I share the same technitions Mike & Lisa\n&gt; I will ask them to assist you with your sessions until you are  \n&gt; assigned your own tech/guide\n&gt; It usually takes a little while for them to adjust to your personal  \n&gt; energy and vibration and\n&gt; match you with the correct technition that is in harmony with you.\n&gt; As for the box It will also take some time for them to what we call  \n&gt; Imprint onto it\n&gt; But in most cases all the new researchers that have started in the  \n&gt; last two weeks have already\n&gt; begun to communicate with thier techs.\n&gt;\n&gt; Bruce\n&gt;\n&gt;\n&gt;\n&gt; Bruce Halliday\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; From: lisby@...\n&gt; Date: Fri, 14 Dec 2007 19:38:00 -0500\n&gt; Subject: Re: [EVP-ITC] Re: My box is shipping tomorrow!\n&gt;\n&gt; Is the speaker all I need or any kind of jack? For it?\n&gt;\n&gt; Steve, will also ask Lisa if she&#39;s aware of the &quot;technician&quot; who  \n&gt; will hopefully be assisting me? I just want to get confirmation or  \n&gt; rejection of what I seem to be sensing.\n&gt;\n&gt; Thanks!\n&gt;\n&gt; Ann\n&gt;\n&gt; On Dec 13, 2007, at 10:10 PM, Steve Hultay wrote:\n&gt;\n&gt; Ann,\n&gt;\n&gt; I went to radio shack and bought a speaker model #21-549 and it seems\n&gt; to work fine. I got mine yesterday and didn&#39;t seem to thrilled about\n&gt; the results and gave another try tonight. Tonight, i spoke to several\n&gt; different people in their own voices and really have to give credit to\n&gt; Mike and Lisa for making this communication keep getting better. This\n&gt; really is another valuable box in my research, as long as different\n&gt; designs become available i will test them all. Every box is unique\n&gt; and offers different results, but they all work off the same premise\n&gt; of raw audio bits. Real time communication is finally here and gets\n&gt; better every day, some day&#39;s frank&#39;s box is better and than some day&#39;s\n&gt; RS box...etc. Depends on your surroundings, your mood, the weather\n&gt; but all these devices have worked for me up to this point and i&#39;m\n&gt; grateful.\n&gt;\n&gt; p.s.--here is the link to the speaker so you can get a visual.\n&gt;\n&gt; http://www.radioshack.com/search/index.jsp?kwCatId=&kw=21-\n&gt; 549&origkw=21-549&sr=1\n&gt;\n&gt; Your going to love this wild ride and watching new people get involved\n&gt; and posted results makes it all worth it for me.\n&gt;\n&gt; -Steve H.\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, Lisby &lt;lisby@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; I just got my notice. I think I may faint from excitement.\n&gt; &gt;\n&gt; &gt; Hey, fellow list dwellers who have one--what extra equipment to I\n&gt; &gt; need to have to make this function (speakers, but not computer\n&gt; &gt; speakers)? Anything else I can go out an get now? I am truly, truly\n&gt; &gt; technology challenged, so guidance addressed to one like a toddler\n&gt; is\n&gt; &gt; what I need.\n&gt; &gt;\n&gt; &gt; Ann\n&gt; &gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Don&#39;t get caught with egg on your face. Play Chicktionary! Check it  \n&gt; out!\n&gt;\n&gt; \n\n\nThis would be wonde ul, B uce. I hey ha e any messages o me, please le me know. I'll be deligh ed!AnnOn Dec 15, 2007, a 10:05 AM, b uce halliday w o e:Hi Ann, Since s e e and I sha e he same echni ions Mike & LisaI will ask hem o assis you wi h you sessions un il you a e assigned you own ech/guideI usually akes a li le while o hem o adjus o you pe sonal ene gy and ib a ion andma ch you wi h he co ec echni ion ha is in ha mony wi h you. As o he box I will also ake some ime o hem o wha we call Imp in on o i Bu in mos cases all he new esea che s ha ha e s a ed in he las wo weeks ha e al eadybegun o communica e wi h hie echs. B uceB uce Halliday To: EVP-ITC@yahoog oups.comF om: lisby@ea hlink.ne Da e: F i, 14 Dec 2007 19:38:00 -0500Subjec : Re: [EVP-ITC] Re: My box is shipping omo ow!Is he speake all I need o any kind o jack? Fo i ?S e e, will also ask Lisa i she's awa e o he \" echnician\" who will hope ully be assis ing me? I jus wan o ge con i ma ion o ejec ion o wha I seem o be sensing.Thanks!AnnOn Dec 13, 2007, a 10:10 PM, S e e Hul ay w o e:Ann,I wen o adio shack and bough a speake model #21-549 and i seems  o wo k ine. I go mine yes e day and didn' seem o h illed abou   he esul s and ga e ano he y onigh . Tonigh , i spoke o se e al di e en people in hei own oices and eally ha e o gi e c edi o Mike and Lisa o making his communica ion keep ge ing be e . This  eally is ano he aluable box in my esea ch, as long as di e en  designs become a ailable i will es hem all. E e y box is unique and o e s di e en esul s, bu hey all wo k o he same p emise o aw audio bi s. Real ime communica ion is inally he e and ge s be e e e y day, some day's ank's box is be e and han some day's RS box...e c. Depends on you su oundings, you mood, he wea he  bu all hese de ices ha e wo ked o me up o his poin and i'm g a e ul.p.s.--he e is he link o he speake so you can ge a isual. h p://www. adioshack.com/sea ch/index.jsp?kwCa Id=&kw=21-549&o igkw=21-549&s =1You going o lo e his wild ide and wa ching new people ge in ol ed and pos ed esul s makes i all wo h i o me.-S e e H.--- In EVP-ITC@yahoog oups.com, Lisby w o e:>> I jus go my no ice. I hink I may ain om exci emen .> > Hey, ellow lis dwelle s who ha e one--wha ex a equipmen o I > need o ha e o make his unc ion (speake s, bu no compu e  > speake s)? Any hing else I can go ou an ge now? I am uly, uly > echnology challenged, so guidance add essed o one like a oddle  is > wha I need.> > Ann>Don' ge caugh wi h egg on you ace. Play Chick iona y! Check i ou !"}