{"id": "4325", "subject": "Re: Basic newbie questions", "author": "M.A. Coletta (Mike)", "timestamp": "2007-12-17T06:30:49Z", "full_text": "Hi Leslie,\n\nTo get you started...\n\nMini Box - (about $400 - $500)\nhttp://www.paranormalsystems.com/The_MiniBox.html\n\nFrank&#39;s Box - (Not for sale, he offers them to people every once-in-\nawhile)\nhttp://www.franks-boxes.com\n\nThere are many other websites that offer information on Franks Box, \ntoo.\n\nJoe&#39;s Box - (Price ???)\nhttp://www.keyportparanormal.com\n\nRadio Shack Hack - ($25 - $100) I&#39;ve put together a number of \nconfigurations using the Radio Shack Hack 12-469 & 12-470.  You can \nsee the detailed videos here: http://www.youtube.com/ufogeek\nYou can also see some of my Radio Shack Hack photos here:  \nhttp://www.ufogeek.com\n\nMany other people are putting together different configurations of \nthe Radio Shack Hack, and they share their findings on this forum.\n\nDigital Dowsing - (Price ???)\nhttp://www.digitaldowsing.com\n\nWelcome... I&#39;m sure others will provide additional information, as \nmany of the researchers here have their own websites. This is a very \nfriendly place!\n\n- Mike\n\n\n--- In EVP-ITC@yahoogroups.com, Aquarius &lt;laustin@...&gt; wrote:\n&gt;\n&gt; Hi, all! \n&gt; \n&gt; I&#39;m a newbie to this list, and very excited about what I&#39;ve been \nreading the\n&gt; last week or so.\n&gt; \n&gt; Briefly, though I am a corporate consultant and exective coach by\n&gt; profession, I&#39;ve been a channel since 1971, working with one \n(wonderful)\n&gt; guide. I&#39;ve also done lots of psychic work over the years, had lots \nof\n&gt; experiences, and consider the unseen world as &quot;normal&quot; and real as \nour\n&gt; so-called ordinary world.\n&gt; \n&gt; I have wanted for years to try recording voices of my unseen \nassociates, and\n&gt; am SO excited to begin to experiment, so I thank you all for the \ninvaluable\n&gt; information I&#39;m reading on this list so far!\n&gt; \n&gt; I have some very basic questions, and apologize if they are too \nsimple or\n&gt; repetitious for the more experienced and regular members of this \nlist.\n&gt; \n&gt; When some of you are mentioning that your mini-box is on the way, \nfrom where\n&gt; are you buying it? What other systems are available, other than \nmaking one\n&gt; with the Radio Shack radios (which I will experiment with for \nsure!).\n&gt; \n&gt; Would it be possible to list the possible other equipment that one \nmight\n&gt; buy, and the sources? Or is this already available somewhere on the\n&gt; yahoogroups website for this group?\n&gt; \n&gt; Thanks in advance to one and all for any help you can give me with \nthis...\n&gt; there&#39;s SO much great info here it&#39;s a bit hard to sort out as a \nnewbie on\n&gt; the list who just dove in recently!\n&gt; \n&gt; Cheers,\n&gt; \n&gt; Leslie (in NYC)\n&gt; \n&gt; &quot;A hunch is creativity trying to tell you something.&quot;\n&gt; \n&gt; \t-- Frank Capra, Film Director\n&gt; \n&gt; &quot;Honor your error as a hidden intention.&quot;\n&gt; \n&gt; \t-- Brian Eno\n&gt;"}