{"id": "4346", "subject": "Re: Laptop EVP catcher", "author": "judy_in_hollywood", "timestamp": "2007-12-18T01:52:59Z", "full_text": "Hi Bill & All, This sounds like it&#39;s working for you = awesome! However, even though I have a 1999 Compaq Armada laptop, I&#39;m still learning how to use it with software & DVD&#39;s, so all of this is complicated for me to try and do.    =Judy=             . . . . . . . . . . . . . . .                                                                  --- In EVP-ITC@yahoogroups.com, &quot;billliscomb&quot; &lt;williscomb@...&gt; wrote:\n&gt;\n&gt; Group;\n&gt;      A short time ago, I got the idea that I could do my own EVPs \n&gt; here at home,see my posting, &quot;Newbie&quot; on December 9th. I talked with \n&gt; Mike Coletta recently and he suggested I post how I set up my laptop \n&gt; and also my results.\n&gt;      My goal is to turn my laptop into a self-contained, portable EVP \n&gt; recorder.  Here&#39;s what I did, and also what happened.  I&#39;ve posted \n&gt; pictures of the setup under LapTop and Laptopmp3s so you can see and \n&gt; hear what I have been getting.  \n&gt;      For software, I am using Audacity, EVPmaker and Audition 1.0. \n&gt; The laptop is a Dell M1210 with a 1.66 ghz duo processor and 1gb of \n&gt; ram.  It is about a year and a half old.  It is a small laptop with \n&gt; little teenie speakers.  For initial playback, I have an enclosed ear \n&gt; type headset.  For portability, I also have earbuds.  Lastly, I went \n&gt; to Fry&#39;s (electronic superstore) and bought the smallest, cheapest \n&gt; ($9.95) microphone.  \n&gt; Here is how I use all of the above\n&gt;  \n&gt; First, I make sure the computer knows the microphone is plugged in \n&gt; and that it is working, open the Audition software, click &quot;new&quot;, then \n&gt; select &quot;11025, mono, 16bit&quot; from the next menu.\n&gt;  \n&gt; Second, I start the EVPmaker software and open the 1 minute .wav file \n&gt; I found online of a doctor giving a talk.  I then click the &quot;extras&quot; \n&gt; tab and select &quot;normalize signal.&quot;  This basically increases the \n&gt; volume of the EVPmaker output.  &quot;Segments&quot; are set at &quot;80&quot;, &quot;Overlap&quot; \n&gt; and &quot;Z-Cross&quot; are checked.  Under &quot;Play EVP&quot;, select &quot;continuously&quot;.  \n&gt; Then I click the yellow play button.  It is now babbling..\n&gt; \n&gt; Third, open Audacity software, and under &quot;generate&quot; select &quot;white \n&gt; noise&quot; and create a 10 second clip of white noise.  By \n&gt; holding &quot;shift&quot; on the keyboard while clicking on the play button, it \n&gt; will play the noise as an endless loop.  It usually drowns out the \n&gt; EVPmaker, and the volume is adjusted by using the slider that appears \n&gt; next to the graphic waveform of the opened file, not the volume \n&gt; control that is located higher, under the Play/Pause buttons.  The \n&gt; upper slider adjusts the master volume for .wav files playback and \n&gt; should be left at maximum.  I adjust it so it accompanies the \n&gt; EVPmaker sounds, kind of a background noise and not too loud.  Listen \n&gt; to my files and you can get an idea on how the level of the white \n&gt; noise/EVPmaker is set. \n&gt; \n&gt; Fourth, microphone is placed on the laptop keyboard right next to the \n&gt; touchpad, aimed at the computers speakers.  I use a bit of plumbers \n&gt; putty to hold it in place.  All of the programs can be sized to fit \n&gt; on the screen at the same time.  See picture in photo section.  Next, \n&gt; recording is started in Audition.   I did a few trial runs to get all \n&gt; the sound levels right.  To ask questions, I simply lean forward and \n&gt; speak into the microphone while all programs are running to check the \n&gt; sound levels.  That&#39;s it.  I record 3 minutes at a time and ask 3-4 \n&gt; questions during that time.  I&#39;ve noticed the sound from the laptop \n&gt; speakers does bounce off my chest and then the laptop screen, \n&gt; creating a Doppler effect when I lean forward.\n&gt;   \n&gt; Once everything was working, I started my sessions.  First, I read \n&gt; a &quot;statement/prayer&quot; to clear the air and set forth the rules.  I \n&gt; also remind &quot;them&quot; to be really clear because I willl not do signal \n&gt; processing to pull their messages out .  I get all the software ready \n&gt; to go, then start recording first, so I don&#39;t miss anything.  Then I \n&gt; hit play on EVPmaker and Audacity.  \n&gt; \n&gt;      My first sessions were done using my desktop computer, and \n&gt; asking questions to see if this setup would work, then I used the \n&gt; same setup the laptop and asked the same questions.  These files are \n&gt; in &quot;setup&quot; folder.  \n&gt;      My next sessions were focused on asking about an unusual light \n&gt; that my wife and I saw in the middle of the night in the desert in \n&gt; 1973.  I have no idea what we saw, but now have some answers.  These \n&gt; files are in &quot;desert experience&quot; file.  My questions were not leading \n&gt; in any way, nor did I speak aloud any details of the lights we saw.\n&gt;      I have a few other mysterious things that have happened in my \n&gt; life I want to ask about using this system.  I feel more like an \n&gt; experimenter than a researcher.\n&gt; \n&gt;     I am absolutely amazed at the answers and statements I \n&gt; have &quot;received&quot; right off the bat.  They are clear  I don&#39;t process \n&gt; the recording at all, other than to normalize the files - and \n&gt; relevant to the questions posed.  They range from Class A to Class \n&gt; C.  There are some other things I want to try in the future, but for \n&gt; now, I&#39;m happy with the results.\n&gt; Thank you to Mike Coletta for inspiration and help\n&gt; Bill Liscomb\n&gt;"}