{"id": "4359", "subject": "Re: Always check the datasheet!", "author": "psi_research", "timestamp": "2007-12-18T16:13:23Z", "full_text": "Just because we project our thoughts into a Box session or even if we \nhear our thoughts in our own voice when playing back an evp it \ndoesn&#39;t make it any less real. I don&#39;t even think it&#39;s problematic, I \nthink it&#39;s getting closer to discovering what the origin of the \nphenomena is. It&#39;s our own pk energy. Our devices may picking up our \nown psychic communication with the invisibles. -Bill \n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@...&gt; \nwrote:\n&gt;\n&gt; \n&gt;  In working with LM3820, that&#39;s the Delco radio chips I got form \nB.G. Micro at 12 cents each, I had the things working a while back on \nthe breadbord, but the chips would not work when wired up on a \ncircuit board. I drew the damn schematic wrong!!! I&#39;m wiring a new \nboard, and looking at the origninal schematic I had on -line, and I&#39;m \nthinking what the f---, this ain&#39;t right. I haven&#39;t powered up the \nboard yet, but it should work----this time.\n&gt;  \n&gt;  \n&gt;  I keep telling everyone you hear what you want to hear, or what \nthe subconcious mind projects, even onto pre-recorded tapes! \nListening last night to the tape I did Sunday night, and the Ol&#39; Lady \nyells out that the mattress heater was not working, and the very next \nvoice on the tape is about the matress heater not working! I doubt \nvery much that anyone else would hear it, but that is the probelm \nwith this stuff, few hear what others hear. Was the heater \nvoice &quot;real&quot;--I can&#39;t tell!! Maybe it&#39;s a precongnitive voice--I \ncan&#39;t tell! I think we create some this stuff on the fly, which is \nvery problematic for the research, but it has to be addressed. \n&gt;  \n&gt;  Frank-S\n&gt;  \n&gt;  \n&gt; _________________________________________________________________\n&gt; Don&#39;t get caught with egg on your face. Play Chicktionary!\n&gt; http://club.live.com/chicktionary.aspx?icid=chick_wlhmtextlink1_dec\n&gt;"}