{"id": "438", "subject": "EVPs", "author": "riverstarmyst", "timestamp": "2006-07-27T16:46:32Z", "full_text": "--3-3065701182-0291893484=:3\r\nContent-Type: text/plain; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n\nHi,\n\nHas anyone here heard of Alice Whitehill? She lives near me and has\nb=\r\nooks out on her evps she had gotten. She uses a musical instrument\ncalled a=\r\n dolcymer (unsure of spelling) to attract the voices. She gets\nclass A loud=\r\n evps sounds just like a living person is talking right into\nthe microphone=\r\n. Some even shout. She has a recording of pretty boy floyd\nthat states his =\r\nfull real name, and many from gettysburg. They all\nrespond to her questions=\r\n and conversation. One of her books is &#39;in tune\nwith spirits&#39;.\n\nYou can hea=\r\nr some of our evps at this link. These are from the groups I\nbelong to loca=\r\nlly. They are not as good as Alice Whitehills.\nhttp://iprfinc.com/uploads/m=\r\nedia/play.php\n&lt;http://iprfinc.com/uploads/media/play.php&gt;\n\nJulie\n\n\r\n--3-3065701182-0291893484=:3\r\nContent-Type: text/html; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;P&gt;Hi,&lt;/P&gt;\n&lt;P&gt;Has anyone here heard of Alice Whitehill? She lives near me a=\r\nnd has books out on her evps she had gotten. She uses a musical instrument =\r\ncalled a dolcymer (unsure of spelling) to attract the voices. She gets clas=\r\ns A loud evps sounds just like a living person is talking right into the mi=\r\ncrophone. Some even shout. She has a recording of pretty boy floyd that sta=\r\ntes his full real name, and many from gettysburg. They all respond to her q=\r\nuestions and conversation. One of her books is &#39;in tune with spirits&#39;.&lt;/P&gt;\n=\r\n&lt;P&gt;You can hear some of our evps at this link. These are from the groups I =\r\nbelong to locally. They are not as good as Alice Whitehills.&lt;BR&gt;&lt;A href=3D&quot;=\r\nhttp://iprfinc.com/uploads/media/play.php&quot;&gt;http://iprfinc.com/uploads/media=\r\n/play.php&lt;/A&gt;&lt;/P&gt;\n&lt;P&gt;Julie&lt;/P&gt;\n\r\n--3-3065701182-0291893484=:3--"}