{"id": "4381", "subject": "Re: clarification", "author": "lalarutabaga", "timestamp": "2007-12-18T22:20:57Z", "full_text": "Hi\n\nBefore I listened to your files, I went back and read the description \nof your configuration so I would understand a bit more. \nI then listened to some of your files and they are interesting.  A \nvery different sound--aren&#39;t they?\nThe voices are very fast and soft even for EVP samples.  I&#39;m laughing \nfrom empathy picturing you straining to hear them!  God bless you!  \nI&#39;d like to hear more of your samples as you get them.  Very \nintriguing answers and quite abundant, from what it looks like.\n\nKeep up the great work,\nUrsula\n\n--- In EVP-ITC@yahoogroups.com, &quot;billliscomb&quot; &lt;williscomb@...&gt; wrote:\n&gt;\n&gt;        OK, so maybe I went over the top yesterday describing my \nlaptop \n&gt; setup and how I use it  sorry.  I did post a bunch of EVPs \n&gt; under &quot;Laptop EVPs&quot; in the files.  What I didn&#39;t make clear is that \nI&#39;d \n&gt; really appreciate some comments/critiques/suggestions on what I&#39;ve \n&gt; done.  I&#39;ve gotten a lot of stuff and would really like to run it \nby \n&gt; someone else.  I asked my wife, and she got a blank look, blinked \n&gt; twice, turned and walked away.  My teenage son listened to one clip \n&gt; twice, heard what I did, then had more important stuff to do.  So, \nit \n&gt; would be nice to get some feedback on what I&#39;ve done so far.\n&gt;    I&#39;ve read that &quot;lower entities&quot; come across more on EVPmaker, \nbut so \n&gt; far I haven&#39;t had any rude experiences  yet.  Two days ago I \nforgot to \n&gt; start the sessions with protection prayer/rules of engagement, and \n&gt; right away a Scottish voice said, &quot;Aye, it smells in here.&quot;  I&#39;ve \ngot \n&gt; another folder worth of stuff to upload, but want to get some \ncomments \n&gt; about my previous files first..\n&gt;  I&#39;ve noticed two Bills here already, so to avoid confusion, I&#39;ll \ngo by \n&gt; Willy.\n&gt; Thanks\n&gt; Willy\n&gt;"}