{"id": "4383", "subject": "Re: Always check the datasheet!", "author": "psi_research", "timestamp": "2007-12-18T23:36:58Z", "full_text": "Familier voices are not uncommon in this type of recordings. I guess \nit is similar to what causes residuals, thats a good point Juli. -Bill\n\n--- In EVP-ITC@yahoogroups.com, juli velazquez &lt;ghostchasingfool@...&gt; \nwrote:\n&gt;\n&gt; Bill,   \n&gt;              I would also like to add that I have heard various \ncolleagues voices through the box while doing a session.  I think the \npositive energy they also produce as a way of coming through.  I just \nrecently heard Steve&#39;s voice and laugh during an afternoon session \nand when asked if he in fact was also conducting a session at that \ntime stated he was not.  I am wondering if we too leave a voice \nimpression, such as they do with conventional EVP?  An imprint of \nsort, kinda like a stone recording or residual haunting?\n&gt;    \n&gt;   Just something to think about!\n&gt;   Juli\n&gt; \n&gt; psi_research &lt;vilhellm@...&gt; wrote:\n&gt;           Just because we project our thoughts into a Box session \nor even if we \n&gt; hear our thoughts in our own voice when playing back an evp it \n&gt; doesn&#39;t make it any less real. I don&#39;t even think it&#39;s problematic, \nI \n&gt; think it&#39;s getting closer to discovering what the origin of the \n&gt; phenomena is. It&#39;s our own pk energy. Our devices may picking up \nour \n&gt; own psychic communication with the invisibles. -Bill \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@&gt; \n&gt; wrote:\n&gt; &gt;\n&gt; &gt; \n&gt; &gt; In working with LM3820, that&#39;s the Delco radio chips I got form \n&gt; B.G. Micro at 12 cents each, I had the things working a while back \non \n&gt; the breadbord, but the chips would not work when wired up on a \n&gt; circuit board. I drew the damn schematic wrong!!! I&#39;m wiring a new \n&gt; board, and looking at the origninal schematic I had on -line, and \nI&#39;m \n&gt; thinking what the f---, this ain&#39;t right. I haven&#39;t powered up the \n&gt; board yet, but it should work----this time.\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; I keep telling everyone you hear what you want to hear, or what \n&gt; the subconcious mind projects, even onto pre-recorded tapes! \n&gt; Listening last night to the tape I did Sunday night, and the Ol&#39; \nLady \n&gt; yells out that the mattress heater was not working, and the very \nnext \n&gt; voice on the tape is about the matress heater not working! I doubt \n&gt; very much that anyone else would hear it, but that is the probelm \n&gt; with this stuff, few hear what others hear. Was the heater \n&gt; voice &quot;real&quot;--I can&#39;t tell!! Maybe it&#39;s a precongnitive voice--I \n&gt; can&#39;t tell! I think we create some this stuff on the fly, which is \n&gt; very problematic for the research, but it has to be addressed. \n&gt; &gt; \n&gt; &gt; Frank-S\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; __________________________________________________________\n&gt; &gt; Don&#39;t get caught with egg on your face. Play Chicktionary!\n&gt; &gt; http://club.live.com/chicktionary.aspx?\nicid=chick_wlhmtextlink1_dec\n&gt; &gt;\n&gt; \n&gt; \n&gt; \n&gt;                          \n&gt; \n&gt; \n&gt;   The contents of this eletronic correspondence is private & \nconfidential and meant only for the party and/or parties it is \naddressed to.  \n&gt;    \n&gt;   No part of this email transmission may be publicly posted or \nforwarded to other parties without explicit written permission.\n&gt;"}