{"id": "4391", "subject": "Re: clarification", "author": "psi_research", "timestamp": "2007-12-19T07:15:57Z", "full_text": "Sometimes I&#39;ll sign as Bill M just for clarification.\n\n--- In EVP-ITC@yahoogroups.com, Misty Dawn &lt;bulletbabea@...&gt; wrote:\n&gt;\n&gt; Hiya Willy (hehe I like that)\n&gt;    \n&gt;   You are right there are alot of Bills around here LOL\n&gt;    \n&gt;   I did actually get to listen to some of your desert files when \nyou posted them but I had to leave for work so didnt get a chance to \ndo anything at the time. I will give you a rundown of them all here \nwith any differences or changes I hear in *asterisks*\n&gt;    \n&gt;   AndAmazinglyRicksHotIdea*Help* (same but I hear that additional \nword on end)\n&gt; ButYouCalledToUs*It&#39;s Better* (&quot;)\n&gt; CheckThis*GroupEnergyWhatDoTheyTalkToAtNight* (several differences)\n&gt; EachDifferentWavelengthMoves*InUsToSync* (same but additional words \non end)\n&gt; *WhatWeSee*ThatWasASpacecraft (I hear that as a multilayer. I hear \nwhat you hear with that other voice on top at start)\n&gt; ThereAreNoEntities*Ivebeensenttoearthtobeginthedeparted* (etcetera)\n&gt;   \n&gt;  I will try and get back to you on more and some of the other set. \nJust tired now, its been a long work day. Great stuff tho keep it up. \nGlad they answered some of your questions for you. Ive seen quite a \nbit of strangeness over the years. And I know what its like to have \nthose around you living in thier own bubble worlds...but just \nremember they think the same about us hehehe. Who&#39;s bubble is better? \n&gt;    \n&gt;   Can definitely say its all very interesting! And I enjoy bursting \nmy own bubble now and then but never touch thiers =) We cant change \nanyone, except ourselves. They have to change themselves on thier \nown. But we can try to share, for those who seek to learn.\n&gt;    \n&gt;   Misty\n&gt;   \n&gt; billliscomb &lt;williscomb@...&gt; wrote:\n&gt;           OK, so maybe I went over the top yesterday describing my \nlaptop \n&gt; setup and how I use it  sorry. I did post a bunch of EVPs \n&gt; under &quot;Laptop EVPs&quot; in the files. What I didn&#39;t make clear is that \nI&#39;d \n&gt; really appreciate some comments/critiques/suggestions on what I&#39;ve \n&gt; done. I&#39;ve gotten a lot of stuff and would really like to run it by \n&gt; someone else. I asked my wife, and she got a blank look, blinked \n&gt; twice, turned and walked away. My teenage son listened to one clip \n&gt; twice, heard what I did, then had more important stuff to do. So, \nit \n&gt; would be nice to get some feedback on what I&#39;ve done so far.\n&gt; I&#39;ve read that &quot;lower entities&quot; come across more on EVPmaker, but \nso \n&gt; far I haven&#39;t had any rude experiences  yet. Two days ago I forgot \nto \n&gt; start the sessions with protection prayer/rules of engagement, and \n&gt; right away a Scottish voice said, &quot;Aye, it smells in here.&quot; I&#39;ve \ngot \n&gt; another folder worth of stuff to upload, but want to get some \ncomments \n&gt; about my previous files first..\n&gt; I&#39;ve noticed two Bills here already, so to avoid confusion, I&#39;ll go \nby \n&gt; Willy.\n&gt; Thanks\n&gt; Willy\n&gt; \n&gt; \n&gt; \n&gt;                          \n&gt; \n&gt; \n&gt; \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt;        \n&gt; ---------------------------------\n&gt; Be a better friend, newshound, and know-it-all with Yahoo! Mobile.  \nTry it now.\n&gt;"}