{"id": "4395", "subject": "Re: [EVP-ITC] My box is here and set up", "author": "Lisby", "timestamp": "2007-12-19T13:27:17Z", "full_text": "I am the proud owner--errr, actually, I think it owns me--of minibox  \n114. :)\n\nBruce--can you shoot me a private e-mail on how to reach you if I  \nneed you today? (Have a feeling I might...)\n\nAnn\n\nOn Dec 19, 2007, at 8:22 AM, bruce halliday wrote:\n\n&gt; Ann,\n&gt;\n&gt; Don&#39;t be discouredged it was your first time.\n&gt; which box are you using?\n&gt;\n&gt; I&#39;m here if you need help.\n&gt;\n&gt; Bruce\n&gt;\n&gt;\n&gt;\n&gt; Bruce Halliday\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; From: lisby@earthlink.net\n&gt; Date: Wed, 19 Dec 2007 07:53:52 -0500\n&gt; Subject: [EVP-ITC] My box is here and set up\n&gt;\n&gt; I ran a session last night for the first time, but got nothing. There\n&gt; are a lot of radio stations in this area (Baltimore-Washington) and I\n&gt; just could not get a tuning that gave me any confidence that what I\n&gt; heard wasn&#39;t broadcast fragments--and really, nothing came through\n&gt; that made me even wonder if.... Anyway, I went bed last night\n&gt; thinking that I&#39;m going to prove the exception to the rule and this\n&gt; won&#39;t work for me, but I&#39;m gonna give it a go again today.\n&gt;\n&gt; Any of you tech guys around today if I need some help with setting\n&gt; and other tech issues?\n&gt;\n&gt; Ann\n&gt;\n&gt;\n&gt; i’m is proud to present Cause Effect, a series about real people  \n&gt; making a difference.Learn more\n&gt;\n&gt; \n\n\nI am he p oud owne --e , ac ually, I hink i owns me--o minibox 114. :)B uce--can you shoo me a p i a e e-mail on how o each you i I need you oday? (Ha e a eeling I migh ...)AnnOn Dec 19, 2007, a 8:22 AM, b uce halliday w o e:Ann, Don' be discou edged i was you i s ime. which box a e you using? I'm he e i you need help. B uceB uce Halliday To: EVP-ITC@yahoog oups.comF om: lisby@ea hlink.ne Da e: Wed, 19 Dec 2007 07:53:52 -0500Subjec : [EVP-ITC] My box is he e and se upI an a session las nigh o he i s ime, bu go no hing. The e a e a lo o adio s a ions in his a ea (Bal imo e-Washing on) and I jus could no ge a uning ha ga e me any con idence ha wha I hea d wasn' b oadcas agmen s--and eally, no hing came h ough  ha made me e en wonde i .... Anyway, I wen bed las nigh   hinking ha I'm going o p o e he excep ion o he ule and his won' wo k o me, bu I'm gonna gi e i a go again oday.Any o you ech guys a ound oday i I need some help wi h se ing and o he ech issues?Anni’m is p oud o p esen Cause E ec , a se ies abou eal people making a di e ence.Lea n mo e"}