{"id": "4397", "subject": "Re: [EVP-ITC] Re: My box is here and set up", "author": "Lisby", "timestamp": "2007-12-19T14:18:32Z", "full_text": "Well, I just ran another and nada. I can hear all the radio fragments  \njust fine however, how matter how I tune it. Anyway, I&#39;m going to  \ngive it a rest for awhile and try again later.\n\nAnn\n\nOn Dec 19, 2007, at 8:29 AM, LC Duplatt wrote:\n\n&gt;\n&gt; Ann, you are not alone.\n&gt;\n&gt; I have felt the same at times, but don&#39;t give up.  I found that  \n&gt; many times I am trying too hard to hear.  You must remain patient  \n&gt; and allow time for the spirit(s) to come through after turning the  \n&gt; device on.  In other words, let it sweep a bit.\n&gt;\n&gt; When they did come through for me, I began hearing word bits and  \n&gt; then getting replies to questions.  It is almost like it changes to  \n&gt; the trained ear, when it is manipulated.  You may try making  \n&gt; recordings at first and then playing them back a few times.  You  \n&gt; might find you have been missing someone talking to you - happened  \n&gt; to me.\n&gt;\n&gt; Hope this helps...just my take on things.\n&gt;\n&gt; LC\n&gt; http://www.AngelsGhosts.com\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, Lisby &lt;lisby@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; I ran a session last night for the first time, but got nothing.  \n&gt; There\n&gt; &gt; are a lot of radio stations in this area (Baltimore-Washington)  \n&gt; and I\n&gt; &gt; just could not get a tuning that gave me any confidence that what I\n&gt; &gt; heard wasn&#39;t broadcast fragments--and really, nothing came through\n&gt; &gt; that made me even wonder if.... Anyway, I went bed last night\n&gt; &gt; thinking that I&#39;m going to prove the exception to the rule and this\n&gt; &gt; won&#39;t work for me, but I&#39;m gonna give it a go again today.\n&gt; &gt;\n&gt; &gt; Any of you tech guys around today if I need some help with setting\n&gt; &gt; and other tech issues?\n&gt; &gt;\n&gt; &gt; Ann\n&gt; &gt;\n&gt;\n&gt;\n&gt; \n\n\nWell, I jus an ano he and nada. I can hea all he adio agmen s jus ine howe e , how ma e how I une i . Anyway, I'm going o gi e i a es o awhile and y again la e .AnnOn Dec 19, 2007, a 8:29 AM, LC Dupla w o e:Ann, you a e no alone.I ha e el he same a imes, bu don' gi e up.  I ound ha many imes I am ying oo ha d o hea .  You mus emain pa ien and allow ime o he spi i (s) o come h ough a e u ning he de ice on.  In o he wo ds, le i sweep a bi .When hey did come h ough o me, I began hea ing wo d bi s and hen ge ing eplies o ques ions.  I is almos like i changes o he ained ea , when i is manipula ed.  You may y making eco dings a i s and hen playing hem back a ew imes.  You migh ind you ha e been missing someone alking o you - happened o me.Hope his helps...jus my ake on hings.LCh p://www.AngelsGhos s.com--- In EVP-ITC@yahoog oups.com, Lisby w o e:>> I an a session las nigh o he i s ime, bu go no hing. The e > a e a lo o adio s a ions in his a ea (Bal imo e-Washing on) and I > jus could no ge a uning ha ga e me any con idence ha wha I > hea d wasn' b oadcas agmen s--and eally, no hing came h ough > ha made me e en wonde i .... Anyway, I wen bed las nigh  > hinking ha I'm going o p o e he excep ion o he ule and his > won' wo k o me, bu I'm gonna gi e i a go again oday.> > Any o you ech guys a ound oday i I need some help wi h se ing > and o he ech issues?> > Ann>"}