{"id": "4398", "subject": "Re: My box is here and set up", "author": "LC Duplatt", "timestamp": "2007-12-19T15:41:37Z", "full_text": "Ann, I posted an audio recording under LC&#39;s RS 12-469 Recordings.  It \nis entitled, &quot;Yes...I am...Gino.&quot; Be sure and listen to it, as it is \nvery convincing that these sweeping tuners can be manipulated by \nspirits.\n\nThis came through on my 5th try at one sitting. The first four \nattempts that day, I struggled badly.  The audio bits sort of changed \ninto patterns of words speaking directly to me.  So I suspect it will \nhappen if you continue working with it.  \n\nMaybe Bruce and others can tell us more about how he feels, how quick \nhe connects, etc.  I perceive that a connection with the other side \nhas to first happen, and this will require your patience, practice \nand spirituality.\n\nLC\n\n\n--- In EVP-ITC@yahoogroups.com, Lisby &lt;lisby@...&gt; wrote:\n&gt;\n&gt; Well, I just ran another and nada. I can hear all the radio \nfragments  \n&gt; just fine however, how matter how I tune it. Anyway, I&#39;m going to  \n&gt; give it a rest for awhile and try again later.\n&gt; \n&gt; Ann\n&gt; \n&gt; On Dec 19, 2007, at 8:29 AM, LC Duplatt wrote:\n&gt; \n&gt; &gt;\n&gt; &gt; Ann, you are not alone.\n&gt; &gt;\n&gt; &gt; I have felt the same at times, but don&#39;t give up.  I found that  \n&gt; &gt; many times I am trying too hard to hear.  You must remain \npatient  \n&gt; &gt; and allow time for the spirit(s) to come through after turning \nthe  \n&gt; &gt; device on.  In other words, let it sweep a bit.\n&gt; &gt;\n&gt; &gt; When they did come through for me, I began hearing word bits and  \n&gt; &gt; then getting replies to questions.  It is almost like it changes \nto  \n&gt; &gt; the trained ear, when it is manipulated.  You may try making  \n&gt; &gt; recordings at first and then playing them back a few times.  You  \n&gt; &gt; might find you have been missing someone talking to you - \nhappened  \n&gt; &gt; to me.\n&gt; &gt;\n&gt; &gt; Hope this helps...just my take on things.\n&gt; &gt;\n&gt; &gt; LC\n&gt; &gt; http://www.AngelsGhosts.com\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com, Lisby &lt;lisby@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; I ran a session last night for the first time, but got \nnothing.  \n&gt; &gt; There\n&gt; &gt; &gt; are a lot of radio stations in this area (Baltimore-\nWashington)  \n&gt; &gt; and I\n&gt; &gt; &gt; just could not get a tuning that gave me any confidence that \nwhat I\n&gt; &gt; &gt; heard wasn&#39;t broadcast fragments--and really, nothing came \nthrough\n&gt; &gt; &gt; that made me even wonder if.... Anyway, I went bed last night\n&gt; &gt; &gt; thinking that I&#39;m going to prove the exception to the rule and \nthis\n&gt; &gt; &gt; won&#39;t work for me, but I&#39;m gonna give it a go again today.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Any of you tech guys around today if I need some help with \nsetting\n&gt; &gt; &gt; and other tech issues?\n&gt; &gt; &gt;\n&gt; &gt; &gt; Ann\n&gt; &gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt;"}