{"id": "4406", "subject": "Re: Thanks and more stuff", "author": "LC Duplatt", "timestamp": "2007-12-20T00:51:14Z", "full_text": "Perhaps those on the other side are more urgent, anxious and excited \nabout the box breakthroughs than even we are.  Could it be because \nthey see a bigger picture coming to pass?\n\n- LC\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;psi_research&quot; &lt;vilhellm@...&gt; wrote:\n&gt;\n&gt; Hi Ursula,\n&gt; \n&gt; There is a certain urgency to Box messages - sort of like they need \n&gt; to convey quickly. The same thing happens in video ITC, it&#39;s like \n&gt; there is but a moment and we all better pay attention. -Bill\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Ursula Bielski &lt;ursulabielski@&gt; \n&gt; wrote:\n&gt; &gt;\n&gt; &gt; Willy, Really interested in listening to the new files.  I&#39;ll let \n&gt; you know after.\n&gt; &gt;   Just to throw in regarding EVP maker and everything else but \nthe \n&gt; boxes.  I used EVP maker and the water method AND foreign language \n&gt; broadcast method and radio static and box fan, etc etc etc before I \n&gt; got my shack hack and my Joe&#39;s box, and I must admit that I have \nput \n&gt; everything else aside even though I got good results with ALL of \n&gt; those other methods.  There&#39;s just something very exciting about \nthe \n&gt; boxes, I think, that makes us forsake all others.  When I started \n&gt; using a hack, which Jeff Rezman made for me before I got the Joe&#39;s \n&gt; Box, I felt it was a nervous sort of experimentation--that is to \nsay, \n&gt; the loud, short, fast sound clips had me on edge, as I was used to \n&gt; quiet static and water, but I think now I&#39;m addicted to the sound \nand \n&gt; the frenzy of it!  Does anyone else feel this way?\n&gt; &gt;   Ursula\n&gt; &gt; \n&gt; &gt; billliscomb williscomb@ wrote:\n&gt; &gt;           Ursula and Misty  thank you very much for your \nfeedback. \n&gt; I \n&gt; &gt; really appreciate you taking the time to listen, and for the \n&gt; &gt; comments, especially noting the dual layers of speech. \nInteresting. \n&gt; &gt; Frank S. - Thanks for the recent files from EVPmaker - nice! \n&gt; &gt; There hasn&#39;t been much discussion regarding EVPmaker lately, so I \n&gt; &gt; wasn&#39;t&#39; sure if it was a viable tool to use. I haven&#39;t read many \n&gt; &gt; older posts, but hope to get caught up during the holidays. Have \n&gt; you \n&gt; &gt; or others considered modifying speech synthesis software to \n&gt; generate \n&gt; &gt; random sounds? I wonder how something like that would work\n&gt; &gt; On the 16th I did three 3minute recordings and got 9 clips from \n&gt; &gt; them. In this session, I was asking questions regarding a \nknocking \n&gt; &gt; sound I heard while going to sleep or waking up about 12 years \nago. \n&gt; &gt; My life situation wasn&#39;t the best at that time. It was always \nthree \n&gt; &gt; knocks, and once a doorbell, but not the doorbell for where I was \n&gt; &gt; then living. Started the Knocking session by telling &quot;Rick&quot; that \nI \n&gt; &gt; got messages from previous session, got &quot;Well, he&#39;s got \npatience!&quot; \n&gt; &gt; for response. Then was told, &quot;Aye, it smells in here.&quot; Next asked \n&gt; &gt; them what sound did I hear back then, and got &quot;it was knocking \n&gt; (maybe \n&gt; &gt; nothing?)&quot; The best one so far is; &quot;Our earthbound forefathers \nare \n&gt; &gt; video programs.&quot; A second voice keeps repeating &quot;Ent&quot; syllable \n&gt; &gt; during this one. I have put these files in a new folder called \n&gt; &gt; Knocking, which is under Laptop MP3s. More comments there. \n&gt; &gt; I&#39;m making progress on getting the software needed to do \n&gt; &gt; linear scanning with the Radio Shark 2 USB am/fm radio and hope \nto \n&gt; &gt; have it up and running within the next week or two. \n&gt; &gt; Thanks again to all\n&gt; &gt; Willy\n&gt; &gt;\n&gt;"}