{"id": "4413", "subject": "Re: I didn&#39;t ask ...but please tell...about this stuff.", "author": "Frank Sumption", "timestamp": "2007-12-20T05:15:25Z", "full_text": "I would think it&#39;s pretty difficult not to talk about what some of \nthe messages say. The whoel point of EVP is life goes on. Even if the \nplanet gets physically obliterated, you still go on, just up a few \nsteps. To much tech talk gets boring after a whuile. \n\n Frank\n\n--- In EVP-ITC@...m, Ron Lederer &lt;ronriko@...&gt; wrote:\n&gt;\n&gt; Thanks for the return.  I suppose this forum could take a turn away \nfrom the tech side if we really got into analysis of all messages.  \nYet, I can&#39;t NOT think about meaning...if you know what I mean.  \nParticularly when it comes the major earth change stuff that can \naffect my kids.  If not appropriate for this group please send me \ndirect email on any EVP that might suggest any pre-warning signs we \nmight look for before the big bang.  As an aside, let me say that I \nhave been with and am currently with other groups discussing such \nissues but I am quickly putting great value in what is being shared \nhere.  I like the direct approach rather than the he-said-she-said \ntheorizing.   Thanks again Frank.\n&gt; \n&gt; Frank Sumption &lt;franks-boxes@...&gt; wrote:           I usually don&#39;t \nask questions, not even with EVPmaker, but there \n&gt; seems to be coded dates that point to 2012. They alwaya talk about \n&gt; Christmas in connection with this stuff, and that I take as number \n&gt; 12, or 2012(?).\n&gt; \n&gt; Frank-S\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Ron Lederer &lt;ronriko@&gt; wrote:\n&gt; &gt;\n&gt; &gt; That is an amazing message there Frank...seems to fit with what \n&gt; many have been saying...including remote viewers like Ed and \n&gt; company. Can you get dates or more info? Or do you want to? Ron L\n&gt; &gt; \n&gt; &gt; Frank Sumption &lt;franks-boxes@&gt; wrote: Another EVPmaker \n&gt; session this morning. When it works, there&#39;s nothing out there that \n&gt; beats EVPmaker. Dirty method I would guess means noisy. The one \n&gt; labeled all numbers is the session file.\n&gt; &gt; \n&gt; &gt; Here I use audio from an old school board meeting for the raw. \n&gt; It&#39;s speech only. \n&gt; &gt; \n&gt; &gt; Frank-S\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; ---------------------------------\n&gt; &gt; Share life as it happens with the new Windows Live. Share now! \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; ---------------------------------\n&gt; &gt; Looking for last minute shopping deals? Find them fast with \nYahoo! \n&gt; Search.\n&gt; &gt;\n&gt; \n&gt; \n&gt; \n&gt;                          \n&gt; \n&gt;        \n&gt; ---------------------------------\n&gt; Looking for last minute shopping deals?  Find them fast with Yahoo! \nSearch.\n&gt;"}