{"id": "4425", "subject": "Re: Thanks and more stuff", "author": "LC Duplatt", "timestamp": "2007-12-20T15:24:56Z", "full_text": "Oh, Bruce...I agree.  \n\nThe stuff I have been working on outside this ghost box stuff was \ncompletely led by &quot;spirits&quot; on the other side.  My job, if you will, \nwas to begin a website and build it for the sole purpose of getting \nothers to consider that there might be more than the physical realm.  \nThat led to Angels & Ghosts in 2004, and I had no idea why that name \nwas given, but I went with it.  I love the tech side, but have felt \nthe goal of A & G was to make people think and decide for themselves. \nThere are plenty of the debunkers, TAPS type investigators out there, \nand that was not the vision I had been given (though I like that \napproach).  We recieve submissions from all over the world of audio, \npictures, videos, stories, etc, and then I post much if it monthly.  \nAgain, the site&#39;s flavor is &quot;you decide.&quot;  In the digital age, there \nis no way to authenticate what&#39;s absolutely truth, from fiction.  So, \nagain my mantra has been, &quot;You decide.&quot;  Do I think everything on A & \nG is of ghosts and spirits?  Nah...not my job to anyway.  I make it \ninteresting, and allow the minds of the visitors to decide.  That&#39;s \nbeen my job and the spirits&#39; beckoning.  They want people to begin \nlooking for more than what the five sense can bring them.  I feel \nthey speak often, but we don&#39;t listen enough.  However, I also feel \nthey speak often and we think it is coincidence or better yet our own \nthoughts - LOL. ;)  \n\nJanuary of &#39;07 began with a dream and a &quot;new technology&quot; I was to \nwork on that would be big.  I sort of blew it off as a pizza dream, \nbut then was led to contact people from my past for &quot;other purposes&quot; \nof business  This of course unwittingly led back to this whole \ncommunication box, again.  They (spirits) will not let up on me.\n\nSo I am working on projects and I get nudged in the spirit to get on \nthis box thing again.  I pop on here, see the latest news with the RS \nHack (they bugged me as soon as it broke, but I stalled a few days) \nand am now running experiments, etc with it.  I am posting articles, \nvideos and audio about it to spread the word.  More to come...\n\nLC\nAngelsGhosts.com\n\n--- In EVP-ITC@yahoogroups.com, bruce halliday \n&lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; \n&gt; LC,\n&gt;  \n&gt; They not only see a bigger picture but have set all the wheels for \nit in motion.\n&gt; These new rapid developments are not pure chance or coincidence.\n&gt; We as researchers and developers have been set on a path and we \nwill follow it until our job\n&gt; is done.\n&gt;  \n&gt; Bruce\n&gt; Bruce Halliday \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: lcdupla@...: Thu, 20 Dec 2007 00:51:14 \n+0000Subject: [EVP-ITC] Re: Thanks and more stuff\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Perhaps those on the other side are more urgent, anxious and \nexcited about the box breakthroughs than even we are. Could it be \nbecause they see a bigger picture coming to pass?- LC--- In EVP-\nITC@yahoogroups.com, &quot;psi_research&quot; &lt;vilhellm@&gt; wrote:&gt;&gt; Hi Ursula,&gt; \n&gt; There is a certain urgency to Box messages - sort of like they need \n&gt; to convey quickly. The same thing happens in video ITC, it&#39;s like &gt; \nthere is but a moment and we all better pay attention. -Bill&gt; &gt; --- \nIn EVP-ITC@yahoogroups.com, Ursula Bielski &lt;ursulabielski@&gt; &gt; wrote:&gt; \n&gt;&gt; &gt; Willy, Really interested in listening to the new files. I&#39;ll let \n&gt; you know after.&gt; &gt; Just to throw in regarding EVP maker and \neverything else but the &gt; boxes. I used EVP maker and the water \nmethod AND foreign language &gt; broadcast method and radio static and \nbox fan, etc etc etc before I &gt; got my shack hack and my Joe&#39;s box, \nand I must admit that I have put &gt; everything else aside even though \nI got good results with ALL of &gt; those other methods. There&#39;s just \nsomething very exciting about the &gt; boxes, I think, that makes us \nforsake all others. When I started &gt; using a hack, which Jeff Rezman \nmade for me before I got the Joe&#39;s &gt; Box, I felt it was a nervous \nsort of experimentation--that is to say, &gt; the loud, short, fast \nsound clips had me on edge, as I was used to &gt; quiet static and \nwater, but I think now I&#39;m addicted to the sound and &gt; the frenzy of \nit! Does anyone else feel this way?&gt; &gt; Ursula&gt; &gt; &gt; &gt; billliscomb \nwilliscomb@ wrote:&gt; &gt; Ursula and Misty  thank you very much for your \nfeedback. &gt; I &gt; &gt; really appreciate you taking the time to listen, \nand for the &gt; &gt; comments, especially noting the dual layers of \nspeech. Interesting. &gt; &gt; Frank S. - Thanks for the recent files from \nEVPmaker - nice! &gt; &gt; There hasn&#39;t been much discussion regarding \nEVPmaker lately, so I &gt; &gt; wasn&#39;t&#39; sure if it was a viable tool to \nuse. I haven&#39;t read many &gt; &gt; older posts, but hope to get caught up \nduring the holidays. Have &gt; you &gt; &gt; or others considered modifying \nspeech synthesis software to &gt; generate &gt; &gt; random sounds? I wonder \nhow something like that would work&gt; &gt; On the 16th I did three \n3minute recordings and got 9 clips from &gt; &gt; them. In this session, I \nwas asking questions regarding a knocking &gt; &gt; sound I heard while \ngoing to sleep or waking up about 12 years ago. &gt; &gt; My life situation \nwasn&#39;t the best at that time. It was always three &gt; &gt; knocks, and \nonce a doorbell, but not the doorbell for where I was &gt; &gt; then \nliving. Started the Knocking session by telling &quot;Rick&quot; that I &gt; &gt; got \nmessages from previous session, got &quot;Well, he&#39;s got patience!&quot; &gt; &gt; \nfor response. Then was told, &quot;Aye, it smells in here.&quot; Next asked &gt; &gt; \nthem what sound did I hear back then, and got &quot;it was knocking &gt; \n(maybe &gt; &gt; nothing?)&quot; The best one so far is; &quot;Our earthbound \nforefathers are &gt; &gt; video programs.&quot; A second voice keeps \nrepeating &quot;Ent&quot; syllable &gt; &gt; during this one. I have put these files \nin a new folder called &gt; &gt; Knocking, which is under Laptop MP3s. More \ncomments there. &gt; &gt; I&#39;m making progress on getting the software \nneeded to do &gt; &gt; linear scanning with the Radio Shark 2 USB am/fm \nradio and hope to &gt; &gt; have it up and running within the next week or \ntwo. &gt; &gt; Thanks again to all&gt; &gt; Willy&gt; &gt;&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Share life as it happens with the new Windows Live.\n&gt; http://www.windowslive.com/share.html?\nocid=TXT_TAGHM_Wave2_sharelife_122007\n&gt;"}