{"id": "4446", "subject": "Re: help-I broke my box", "author": "LC Duplatt", "timestamp": "2007-12-20T22:47:25Z", "full_text": "Thanks, Mike.  :)\n\nHave you always been this chipper, or has the ghost box and shadow \nghost detector both driven you to Disney Land?!  LOL  Just kidding...\n\nNow, I&#39;ll have to get my collection built further with more sweeping \ndevices...  \n\nLC\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;M.A. Coletta (Mike)&quot; \n&lt;michaelcoletta@...&gt; wrote:\n&gt;\n&gt; Hey LC... Okay now you have both models and because of that... you \n&gt; are an official memeber of the Dynamic Duo Radio Shack Hack Club.  \n&gt; Welcome!!!\n&gt; \n&gt; And to boot, since your 12-470 has shorter battery leads, your \n&gt; batteries will no doubt last longer than mine because your \nelectrons \n&gt; will not have as far to travel to the radio, where mine will tire \nout \n&gt; sooner with that extra length of copper... ;-)\n&gt; \n&gt; - Mike\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;LC Duplatt&quot; &lt;lcdupla@&gt; wrote:\n&gt; &gt;\n&gt; &gt; OK - I just received my used 12-470 older version radio today and \n&gt; &gt; hacked it in about 10 minutes.  Works great, BUT I noticed on \nmine \n&gt; &gt; the length of the battery wires were not as generous as on Mike&#39;s \n&gt; &gt; video or the 12-469 I hacked previously.  Thus, I had to sort of \n&gt; keep \n&gt; &gt; it almost together, peering deep inside with a magnifying glass \nto \n&gt; &gt; make sure I had the correct wire (7th from top - green for this \n&gt; one) \n&gt; &gt; and somehow snip it.  \n&gt; &gt; \n&gt; &gt; I guess I am reporting this, because you really have to pay \n&gt; attention \n&gt; &gt; to the length of the battery box wires when you tear into these - \n&gt; &gt; they do vary, and are easy to accidentally detach off of the \nboard.\n&gt; &gt; \n&gt; &gt; LC\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, Ron Lederer &lt;ronriko@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; So dummy here couldn&#39;t even follow Mike&#39;s great video \n&gt; instructions \n&gt; &gt; with the RS12-469.  After driving two hours to Merida, Mexico and \n&gt; &gt; then back and putting down 600 pesos (about $55 dollars) it took \nme \n&gt; &gt; ten minutes to do everything UFO Geek laid out in his video for \n&gt; &gt; hacking the radio shack box.  Cut the right pin labeled mute.  \n&gt; Closed \n&gt; &gt; the box nicely.  Nothing.  Reopened the box...looked around...two \n&gt; &gt; times more...still nothing.   Not even a light or hum.  \n&gt; &gt; &gt;    \n&gt; &gt; &gt;   Until I figure the radio thing out, I am in the mean time \n&gt; getting \n&gt; &gt; nowhere (it seems) with the EVP Maker on my computer to generate \n&gt; EVP \n&gt; &gt; noise and using my hand recorder etc.   Wish I could try the \nradio \n&gt; &gt; sistem...any real geeks who can give technical suggestions would \nbe \n&gt; &gt; greatly appreciated.  Or maybe I should just throw away my 469 \nand \n&gt; &gt; start over.   Dont think RS will take it back.     geek-wanna-be, \n&gt; Ron \n&gt; &gt; L\n&gt; &gt; &gt; \n&gt; &gt; &gt;        \n&gt; &gt; &gt; ---------------------------------\n&gt; &gt; &gt; Never miss a thing.   Make Yahoo your homepage.\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}