{"id": "4489", "subject": "Re: [EVP-ITC] Re: Seven?", "author": "Lisby", "timestamp": "2007-12-21T16:24:35Z", "full_text": "Hmmm. This could very well be, Bruce. (And thanks to everyone who has  \nreplied--all great ideas and suggestions.) I heard seven again today  \nand every time I did, I asked, &quot;Who is Seven?&quot; but got no  \ndistinguishable reply. I&#39;ll keep trying. :)\n\nAnn\n\nOn Dec 21, 2007, at 10:13 AM, bruce halliday wrote:\n\n&gt; Hi Ann,\n&gt;\n&gt; I am a little late with this reply. I went back over some older  \n&gt; files that I remembered mentioned the number seven\n&gt; and it was at a time when I was engrossed with Mark Macy&#39;s book  \n&gt; &quot;Miracles in the storm&quot; It was the biography of the original time  \n&gt; stream\n&gt; team and ITC researchers such as Macy,hersch-fischbach,george meek  \n&gt; and sarah estep. Macy lists communications from  higher (angelic)\n&gt; entities that referred to themselves as the seven. they where the  \n&gt; guardians of spirit to earth communication and oversaw all aspects  \n&gt; of it.\n&gt;\n&gt; I had received messages during the time of reading this book and  \n&gt; asking questions during sessions about the seven and the circle of  \n&gt; light.\n&gt;\n&gt; I believe your guides may be trying to tell you to do some research  \n&gt; into the origins of what we are doing to better understand the  \n&gt; gravity of it.\n&gt; And I also believe it is a warning for us not to let happen to us  \n&gt; the same thing that brought an end to that fantastic communication  \n&gt; given to\n&gt; those original researchers. You see they where cut off from that  \n&gt; advanced communication due to a disharmony among them from jealousy,\n&gt; envy and a need for recognition.\n&gt;\n&gt; I&#39;m sure they do not want us to fall into the same trap, I believe  \n&gt; that this is our second chance.\n&gt;\n&gt; Bruce\n&gt;\n&gt;\n&gt;\n&gt; Bruce Halliday\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; From: midoribonsai@...\n&gt; Date: Fri, 21 Dec 2007 08:48:56 +0000\n&gt; Subject: [EVP-ITC] Re: Seven?\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, Lisby &lt;lisby@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Whose got the connection to seven, because I think my box is saying\n&gt; &gt; it repeatedly.\n&gt; &gt;\n&gt; &gt; Ann\n&gt; &gt;\n&gt; 7 is my lucky number. 7 is important to me in many things in my life\n&gt; and 777 is Gods number. I have sevens everyplace but I doubt it is me.\n&gt; I am just a newbe here. Hi by the way..Bob\n&gt;\n&gt;\n&gt;\n&gt; Get the power of Windows + Web with the new Windows Live. Get it now!\n&gt;\n&gt; \n\n\nHmmm. This could e y well be, B uce. (And hanks o e e yone who has eplied--all g ea ideas and sugges ions.) I hea d se en again oday and e e y ime I did, I asked, \"Who is Se en?\" bu go no dis inguishable eply. I'll keep ying. :)AnnOn Dec 21, 2007, a 10:13 AM, b uce halliday w o e:Hi Ann, I am a li le la e wi h his eply. I wen back o e some olde iles ha I emembe ed men ioned he numbe se enand i was a a ime when I was eng ossed wi h Ma k Macy's book \"Mi acles in he s o m\" I was he biog aphy o he o iginal ime s eam eam and ITC esea che s such as Macy,he sch- ischbach,geo ge meek and sa ah es ep. Macy lis s communica ions om  highe (angelic)en i ies ha e e ed o hemsel es as he se en. hey whe e he gua dians o spi i o ea h communica ion and o e saw all aspec s o i . I had ecei ed messages du ing he ime o eading his book and asking ques ions du ing sessions abou he se en and he ci cle o ligh . I belie e you guides may be ying o ell you o do some esea ch in o he o igins o wha we a e doing o be e unde s and he g a i y o i .And I also belie e i is a wa ning o us no o le happen o us he same hing ha b ough an end o ha an as ic communica ion gi en o hose o iginal esea che s. You see hey whe e cu o om ha ad anced communica ion due o a disha mony among hem om jealousy,en y and a need o ecogni ion. I'm su e hey do no wan us o all in o he same ap, I belie e ha his is ou second chance. B uceB uce Halliday To: EVP-ITC@yahoog oups.comF om: mido ibonsai@ea hlink.ne Da e: F i, 21 Dec 2007 08:48:56 +0000Subjec : [EVP-ITC] Re: Se en?--- In EVP-ITC@yahoog oups.com, Lisby w o e:>> Whose go he connec ion o se en, because I hink my box is saying > i epea edly.> > Ann>7 is my lucky numbe . 7 is impo an o me in many hings in my li e and 777 is Gods numbe . I ha e se ens e e yplace bu I doub i is me. I am jus a newbe he e. Hi by he way..Bob Ge he powe o Windows + Web wi h he new Windows Li e. Ge i now!"}