{"id": "4490", "subject": "Re: Not another one-- for crying out loud!!", "author": "billliscomb", "timestamp": "2007-12-21T16:26:31Z", "full_text": "Just dug out the manual for the Icom R-75 shortwave receiver that has \nbeen in box for 2 years since I moved.  It has programable scan start \nand stop frequencies, and variable scan steps and speed, along with \nvarious modes - USB/LSB/RTTY/CW/AM/FM - AND programable wide and \nnarrow filters.  All of these settings, along with AGC, ANL and other \nfunctions can be changed while the radio is scanning.  Not very \nportable and rather expensive, but it is here.  I&#39;ve got 2 projects \nahead of starting to fool around with this, but I imagine it could be \nuseful in finding frequencies/modes that work.  Ideas?\nWilly  \n\n\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@...&gt; \nwrote:\n&gt;\n&gt; \n&gt;  I have 49, and 31 meter shortwave bands, plus AM. The shortwave \ntuning might be tricky cuz the band width is less than half the size \nof the AM band, about 500 khz, so instead of tuning over a megahertz \nwith 8 volts, you&#39;re tuning about half that with the same tuning \nvoltage. So far I only have the local oscillators working, still need \nthe input RF amp for each band. The two cans close to the chip are IF \ntransformers, the three on the bottom edge o fthe board is the local \noscillator tank circuits.  On the highest band I&#39;m using a red LED \nfor a varactor, it has almost the perfect capacitance value. 31m on \nmy Sony is 9400 khz to 9800 khz, and 49m is 5900 to 6200khz.  Still, \nhow well it works, if at all, is yet to be seen.\n&gt;  \n&gt;  \n&gt;  I really-really need a life!\n&gt;  \n&gt; Frank-S  http://www.hamuniverse.com/shortwavebandfreqs.html 31 \nmeters  92509995 kHz  Good year-round night band; seasonal during \nthe day, with best reception in winter. Time stations are clustered \naround 10 MHz.  (Time station =WWV at 10.00000000MHZ)  49 meters  \n59006300 kHz  Good year-round night band; daytime reception is \nlacking\n&gt;  \n&gt;  \n&gt;  \n&gt;  \n&gt;  \n&gt;  \n&gt;    \n&gt; _________________________________________________________________\n&gt; Share life as it happens with the new Windows Live.\n&gt; http://www.windowslive.com/share.html?\nocid=TXT_TAGHM_Wave2_sharelife_122007\n&gt;"}