{"id": "4491", "subject": "Re: Not another one-- for crying out loud!!", "author": "M.A. Coletta (Mike)", "timestamp": "2007-12-21T16:58:50Z", "full_text": "Hi Bill (Willy),\n\nVery nice radio!  Expensive..??? Well, I guess that depends.  You can \nget a nice used IC R-75 for about the same price or less than a... \nahh... &quot;Mini Box&quot;(sorry April, Ron, Rick, nothing implied there \nexcept a price camparison)...\nThat Icom R-75 would be a sweet addition to a ham shack or paranormal \nshack.. :-)  sitting right next to a Franks Box, Mini Box, Joe&#39;s Box, \nand a couple of Radio Shack Hack&#39;s...\n\n- Mike\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;billliscomb&quot; &lt;williscomb@...&gt; wrote:\n&gt;\n&gt; Just dug out the manual for the Icom R-75 shortwave receiver that \nhas \n&gt; been in box for 2 years since I moved.  It has programable scan \nstart \n&gt; and stop frequencies, and variable scan steps and speed, along with \n&gt; various modes - USB/LSB/RTTY/CW/AM/FM - AND programable wide and \n&gt; narrow filters.  All of these settings, along with AGC, ANL and \nother \n&gt; functions can be changed while the radio is scanning.  Not very \n&gt; portable and rather expensive, but it is here.  I&#39;ve got 2 projects \n&gt; ahead of starting to fool around with this, but I imagine it could \nbe \n&gt; useful in finding frequencies/modes that work.  Ideas?\n&gt; Willy  \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@&gt; \n&gt; wrote:\n&gt; &gt;\n&gt; &gt; \n&gt; &gt;  I have 49, and 31 meter shortwave bands, plus AM. The shortwave \n&gt; tuning might be tricky cuz the band width is less than half the \nsize \n&gt; of the AM band, about 500 khz, so instead of tuning over a \nmegahertz \n&gt; with 8 volts, you&#39;re tuning about half that with the same tuning \n&gt; voltage. So far I only have the local oscillators working, still \nneed \n&gt; the input RF amp for each band. The two cans close to the chip are \nIF \n&gt; transformers, the three on the bottom edge o fthe board is the \nlocal \n&gt; oscillator tank circuits.  On the highest band I&#39;m using a red LED \n&gt; for a varactor, it has almost the perfect capacitance value. 31m on \n&gt; my Sony is 9400 khz to 9800 khz, and 49m is 5900 to 6200khz.  \nStill, \n&gt; how well it works, if at all, is yet to be seen.\n&gt; &gt;  \n&gt; &gt;  \n&gt; &gt;  I really-really need a life!\n&gt; &gt;  \n&gt; &gt; Frank-S  http://www.hamuniverse.com/shortwavebandfreqs.html 31 \n&gt; meters  92509995 kHz  Good year-round night band; seasonal \nduring \n&gt; the day, with best reception in winter. Time stations are clustered \n&gt; around 10 MHz.  (Time station =WWV at 10.00000000MHZ)  49 meters  \n&gt; 59006300 kHz  Good year-round night band; daytime reception is \n&gt; lacking\n&gt; &gt;  \n&gt; &gt;  \n&gt; &gt;  \n&gt; &gt;  \n&gt; &gt;  \n&gt; &gt;  \n&gt; &gt;    \n&gt; &gt; _________________________________________________________________\n&gt; &gt; Share life as it happens with the new Windows Live.\n&gt; &gt; http://www.windowslive.com/share.html?\n&gt; ocid=TXT_TAGHM_Wave2_sharelife_122007\n&gt; &gt;\n&gt;"}