{"id": "4518", "subject": "Re: Vatican supports evp_itc (long post)", "author": "judy_in_hollywood", "timestamp": "2007-12-23T01:39:48Z", "full_text": "Hi All, I am an Ex-Catholic, and was sure that what Chris Moon had \nsaid about the Catholics & EVP was erronious!  My 2c here!   \n=Judy=                                                                \n                                                                      \n--- In EVP-ITC@yahoogroups.com, Ursula Bielski &lt;ursulabielski@...&gt; \nwrote:\n&gt;\n&gt; Bruce,\n&gt;   I really appreciate this text and these links.  Being Catholic, \nmy mom and my brother have both expressed concern in light of my \nrecent experimentation with voice phenomena.  This is helpful, to say \nthe least.\n&gt;   All my best,\n&gt;   Ursula\n&gt; \n&gt; bhali333 &lt;paranormalinvestigating@...&gt; wrote:\n&gt;           this is a chapter of a document written for a case of evp \nthat was \n&gt; defended in open court.\n&gt; \n&gt; It puts to rest certain researchers claims of warning by the \nvatican \n&gt; and catholic church against evp-itc research or methods of research.\n&gt; \n&gt; as a matter of fact they support it undoubtedly.\n&gt; \n&gt; here is the urls for the main page of the article and the page \n&gt; containing this chapter\n&gt; \n&gt; http://www.victorzammit.com/book/index.html\n&gt; \n&gt; http://www.victorzammit.com/book/chapter04.html\n&gt; \n&gt; Bruce\n&gt; \n&gt; The Vatican supports EVP\n&gt; \n&gt; Unknown to many Christians?Catholics, Protestants and \nFundamentalists\n&gt; the Catholic Church has been actively positive and encouraging \n&gt; towards investigation of the Electronic Voice Phenomena.\n&gt; \n&gt;  Two of the earliest investigators were Italian Catholic priests, \n&gt; Father Ernetti and Father Gemelli, who came upon the phenomena by \n&gt; chance while they were recording Gregorian chants in 1952. \n&gt; \n&gt;  Father Gemelli heard his own father&#39;s voice on the tape calling \nhim \n&gt; by a childhood nick-name saying &#39;Zucchini, it is clear, don&#39;t you \n&gt; know it is I &#39;.\n&gt; \n&gt;  Deeply troubled by Catholic teaching in regard to contact with \nthe \n&gt; dead the two priests visited Pope Pius XII in Rome. \n&gt; \n&gt;  The Pope reassured them:\n&gt; \n&gt; Dear Father Gemelli, you really need not worry about this. The \n&gt; existence of this voice is strictly a scientific fact and has \nnothing \n&gt; to do with spiritism. The recorder is totally objective. It \nreceives \n&gt; and records only sound waves from wherever they come. This \nexperiment \n&gt; may perhaps become the cornerstone for a building for scientific \n&gt; studies which will strengthen people&#39;s faith in a hereafter .\n&gt; (Italian Journal Astra, June 1990 quoted Kubis and Macy, 1995: 102).\n&gt; \n&gt;  Pope Pius&#39; cousin, the Rev. Professor Dr Gebhard Frei, co-founder \n&gt; of the Jung Institute, was an internationally known \nparapsychologist \n&gt; who worked closely with Raudive, a pioneer in the research. He was \n&gt; also the President of the International Society for Catholic \n&gt; Parapsychologists. He himself is on record as stating: \n&gt; \n&gt; All that I have read and heard forces me to believe that the voices \n&gt; come from transcendental, individual entities. Whether it suits me \nor \n&gt; not, I have no right to doubt the reality of the voices (Kubris and \n&gt; Macy, 1995:104).\n&gt; \n&gt;  Dr Frie died on October 27, 1967. In November 1967 at numerous \n&gt; taping sessions a voice giving its name as Gebhard Frei came \nthrough. \n&gt; The voice was identified by Professor Peter Hohenwarter of the \n&gt; University of Vienna as positively belonging to Dr Frei (Ostrander \n&gt; and Schroeder, 1977: 271).\n&gt; \n&gt;  Pope Paul VI was well aware of the work being done from 1959 \n&gt; onwards on the Elecronic Voices by his good friend, Swedish film \n&gt; producer Friedrich Jurgenson, who had made a documentary film about \n&gt; him. The Pope made Jurgenson a Knight Commander of the Order of St \n&gt; Gregory in 1969 for his work (see picture left). Jurgenson wrote to \n&gt; Bander, a British voice researcher:\n&gt; \n&gt; I have found a sympathetic ear for the Voice Phenomenon in the \n&gt; Vatican. I have won many wonderful friends among the leading \nfigures \n&gt; in the Holy City. Today &#39;the bridge&#39; stands firmly on its \nfoundations \n&gt; (Ostrander and Schroeder, 1977: 264).\n&gt; \n&gt;  The Vatican also gave permission for its own priests to conduct \n&gt; research into the voicesFather Leo Schmid, a Swiss theologist, \n&gt; collected more than ten thousand of them in his book When the Dead \n&gt; Speak which was published in 1976, shortly after his death.\n&gt; \n&gt;  Another Vatican-approved researcher was Father Andreas Resch who \nas \n&gt; well as conducting his own experiments began courses in \n&gt; Parapsychology at the Vatican&#39;s school for priests in Rome (Kubris \n&gt; and Macy, 1995:104). \n&gt; \n&gt;  In 1970 the International Society for Catholic Parapsychologists \n&gt; held a conference in Austria and a major part of that conference \nwas \n&gt; concerned with papers on the Electronic Voice Phenomena.\n&gt; \n&gt;  In England in 1972 four senior members of the Catholic hierarchy \n&gt; were involved in the famous Pye recording studio tests conducted by \n&gt; Peter Bander.\n&gt; \n&gt;  Father Pistone, Superior of the Society of St Paul in England, \nsaid \n&gt; in an interview after the tests:\n&gt; \n&gt; I do not see anything against the teaching of the Catholic Church \nin \n&gt; the Voices, they are something extra-ordinary but there is no \nreason \n&gt; to fear them, nor can I see any danger (Bander 1973: 132).\n&gt; \n&gt; The Church realizes that she cannot control the evolution of \nscience. \n&gt; Here we are dealing with a scientific phenomenon; this is progress \n&gt; and the Church is progressive. I am happy to see that \nrepresentatives \n&gt; of most Churches have adopted the same attitude as we have: we \n&gt; recognize that the subject of the Voice Phenomena stirs the \n&gt; imagination even of those who have always maintained that there \ncould \n&gt; never be any proof or basis for discussion on the question of life \n&gt; after death. This book and the subsequent experiments raise serious \n&gt; doubts, even in the minds of atheists. This alone is a good reason \n&gt; for the Church supporting the experiments. A second reason may be \n&gt; found in the greater flexibility of the Church since Vatican II, we \n&gt; are willing to keep an open mind on all matters which do not \n&gt; contradict Christ&#39;s teaching (Bander 1973:103).\n&gt; \n&gt;  His excellence, Archbishop H.E. Cardinale, Apostolic Nuncio to \n&gt; Belgium, commented:\n&gt; \n&gt; Naturally it is all very mysterious, but we know the voices are \nthere \n&gt; for all to hear them (Bander 1973: 132).\n&gt; \n&gt;  The Right Reverend Monsignor Professor C. Pfleger commented:\n&gt; \n&gt; Facts have made us realize that between death and resurrection \nthere \n&gt; is another realm of post-mortal existence. Christian theology has \n&gt; little to say about this realm (Bander 1973 : 133).\n&gt; \n&gt;  Bander&#39;s book (1973: 133) contains a photograph of the Right \n&gt; Reverend Mgr. Stephen O&#39;Connor, Vicar General and Principal Roman \n&gt; Catholic Chaplain to the Royal Navy, listening to the playback of a \n&gt; recording on which a voice had manifested claiming to be that of a \n&gt; young Russian naval officer known to himself who had committed \n&gt; suicide two years earlier. Dr Raudive had recorded the message \n&gt; independently at an earlier session.\n&gt; \n&gt;  Since the 1970s the Vatican has continued to sponsor extensive \n&gt; research into all areas of parapsychology including Electronic \nVoice \n&gt; Phenomena. \n&gt; \n&gt;  Recently Father Gino Concetti, one of the most competent \n&gt; theologians in the Vatican, said in an interview:\n&gt; \n&gt; According to the modern catechism, God allows our dear departed \n&gt; persons who live in an ultra-terrestrial dimension, to send \nmessages \n&gt; to guide us in certain difficult moments of our lives. The Church \nhas \n&gt; decided not to forbid any more the dialogue with the deceased with \n&gt; the condition that these contacts are carried out with a serious \n&gt; religious and scientific purpose (printed in the Vatican newspaper \n&gt; Osservatore Romanocited in Sarah Estep&#39;s American Association \n&gt; Electronic VoicePhenomena, Inc Newsletter, vol 16 No, 2 1997 ) \n&gt; \n&gt; Clearly, the Catholic Church realizes that science is making \n&gt; enormous, inevitable, irreversible and cumulative progress which \n&gt; nobody is in a position to stop.\n&gt;"}