{"id": "4583", "subject": "Re: [EVP-ITC] New Member to Group / Scole Experiment", "author": "Lisby", "timestamp": "2007-12-27T20:56:10Z", "full_text": "Hi Debbie! This is Ann-- I think we exchanged e-mails over your  \nwonderful Website clips and Erland Babcock. Is that you?\n\nAnn\n\nOn Dec 27, 2007, at 2:28 PM, Debbie Tejada wrote:\n\n&gt; Hello all, I just signed up to this group this morning. I was talking\n&gt; with a friend about EVPs last night, and she mentioned this forum\n&gt; which I&#39;d not heard of before. I&#39;m really looking forward to reading\n&gt; through the posts and seeing/listening to your evidence.\n&gt;\n&gt; I just took a quick look at some photos, which reminded me of what I&#39;d\n&gt; seen on the Scole Experiment book. Doing a search on the word &quot;Scole&quot;\n&gt; in the forum turned up lots of results. I&#39;m so excited to be in\n&gt; contact with people who have actually even HEARD of the Scole\n&gt; experiments! It makes me feel like some of the predictions or messages\n&gt; received in the Scole communications are coming to fruition [as far as\n&gt; that as a world-wide growing awareness of ITC and the possibilities it\n&gt; represents].\n&gt;\n&gt; I&#39;m constantly surprised by the opportunities for connections and\n&gt; knowledge that turn up during my constant quest for answers.\n&gt;\n&gt; I hope I can contribute something worthwhile to this forum!\n&gt;\n&gt; Deb T.\n&gt;\n&gt;\n&gt; \n\n\nHi Debbie! This is Ann-- I hink we exchanged e-mails o e you wonde ul Websi e clips and E land Babcock. Is ha you?AnnOn Dec 27, 2007, a 2:28 PM, Debbie Tejada w o e:Hello all, I jus signed up o his g oup his mo ning. I was alkingwi h a iend abou EVPs las nigh , and she men ioned his o umwhich I'd no hea d o be o e. I'm eally looking o wa d o eading h ough he pos s and seeing/lis ening o you e idence. I jus ook a quick look a some pho os, which eminded me o wha I'dseen on he Scole Expe imen book. Doing a sea ch on he wo d \"Scole\"in he o um u ned up lo s o esul s. I'm so exci ed o be incon ac wi h people who ha e ac ually e en HEARD o he Scoleexpe imen s! I makes me eel like some o he p edic ions o messages ecei ed in he Scole communica ions a e coming o ui ion [as a as ha as a wo ld-wide g owing awa eness o ITC and he possibili ies i ep esen s].I'm cons an ly su p ised by he oppo uni ies o connec ions andknowledge ha u n up du ing my cons an ques o answe s.I hope I can con ibu e some hing wo hwhile o his o um!Deb T."}