{"id": "4592", "subject": "Re: [EVP-ITC] Re: New Member to Group / Scole Experiment", "author": "Debbie Tejada", "timestamp": "2007-12-27T21:47:25Z", "full_text": "Bruce,\n\nDon&#39;t apologize, you&#39;re not being rude or nuts. I tend to take  \neverything with a salt lick anyway.\n\nActually I&#39;m quite aware of the conflict and the parties involved!  \nIndividual #1 lives, coincidentally, within walking distance of my  \nhome and I&#39;m grateful to him for acting (unbeknownst to him) as a sort  \nof conduit or spring board to other connections and paths for me. I  \ncan see what his motivation is, and its quite different from most of  \nthe people who are interested in this sort of stuff. He&#39;s a business  \nman and he&#39;s trying to protect his golden goose.\n\nHopefully most people can see this. ;=&gt;\n\nDeb\n\nOn Dec 27, 2007, at 2:31 PM, bruce halliday wrote:\n\n&gt; Deb,\n&gt;\n&gt; You know why chip laughed when you mentioned the chosen 30\n&gt; because he knows it&#39;s a bunch of bull that was totaly made up.\n&gt;\n&gt; you are new to this group so you have no way of knowing but\n&gt; not to long ago there was a burning fued between some individuals on  \n&gt; this group\n&gt; and the individual who claims there are only thirty people.\n&gt;\n&gt; please excuse me if I sound rude nut I won&#39;t mention this again.\n&gt;\n&gt; Bruce\n&gt;\n&gt;\n&gt;\n&gt; Bruce Halliday\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; From: debbie@...m\n&gt; Date: Thu, 27 Dec 2007 21:17:11 +0000\n&gt; Subject: [EVP-ITC] Re: New Member to Group / Scole Experiment\n&gt;\n&gt; Thanks Bruce, I&#39;ll certainly need some answers once I get started\n&gt; digging thru the posts more. I&#39;m tempted to do the Shack Hack, I&#39;ve\n&gt; seen Frank&#39;s Box in use a few times in person and can&#39;t quite get the\n&gt; knack for understanding the messages yet. I need some practice! I ran\n&gt; into Chip Coffee earlier this month, he&#39;s supposedly one of the few\n&gt; &quot;chosen&quot; people who are supposed to be able to work with it. I asked\n&gt; him how it felt to be one of the &quot;chosen ones&quot; and he laughed.\n&gt;\n&gt;\n&gt;\n&gt; i’m is proud to present Cause Effect, a series about real people  \n&gt; making a difference.Learn more\n&gt;\n&gt; \n\n\nB uce,Don' apologize, you' e no being ude o nu s. I end o ake e e y hing wi h a sal lick anyway.Ac ually I'm qui e awa e o he con lic and he pa ies in ol ed! Indi idual #1 li es, coinciden ally, wi hin walking dis ance o my home and I'm g a e ul o him o ac ing (unbeknowns o him) as a so o condui o sp ing boa d o o he connec ions and pa hs o me. I can see wha his mo i a ion is, and i s qui e di e en om mos o he people who a e in e es ed in his so o s u . He's a business man and he's ying o p o ec his golden goose.Hope ully mos people can see his. ;=>Deb On Dec 27, 2007, a 2:31 PM, b uce halliday w o e:Deb, You know why chip laughed when you men ioned he chosen 30because he knows i 's a bunch o bull ha was o aly made up. you a e new o his g oup so you ha e no way o knowing bu no o long ago he e was a bu ning ued be ween some indi iduals on his g oupand he indi idual who claims he e a e only hi y people. please excuse me i I sound ude nu I won' men ion his again. B uceB uce Halliday To: EVP-ITC@yahoog oups.comF om: debbie@ ejadadesign.comDa e: Thu, 27 Dec 2007 21:17:11 +0000Subjec : [EVP-ITC] Re: New Membe o G oup / Scole Expe imen Thanks B uce, I'll ce ainly need some answe s once I ge s a eddigging h u he pos s mo e. I'm emp ed o do he Shack Hack, I' eseen F ank's Box in use a ew imes in pe son and can' qui e ge heknack o unde s anding he messages ye . I need some p ac ice! I anin o Chip Co ee ea lie his mon h, he's supposedly one o he ew\"chosen\" people who a e supposed o be able o wo k wi h i . I askedhim how i el o be one o he \"chosen ones\" and he laughed.i’m is p oud o p esen Cause E ec , a se ies abou eal people making a di e ence.Lea n mo e"}