{"id": "4610", "subject": "Re: [EVP-ITC] Digital Voice Recorder Advice", "author": "Ursula Bielski", "timestamp": "2007-12-29T01:53:21Z", "full_text": "--0-1474504404-1198893201=:14508\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nHello, Robin!\n  I&#39;m taking a couple of weeks off from recording, but I&#39;m rather new, too, to what I think of as &quot;ritualized EVP&quot; as differentiated from &quot;random EVP&quot;  I know that some group  members collect EVP at haunted locations and during ritual at-home recording sessions, but I don&#39;t participate in the former anymore at all, though I did for almost two decades.\n  I have been investigating haunted places for about twenty years and collecting EVP samples from such locations without much but negative responses.\n  I met ITC leader Mark Macy in October and only then began a ritualized collection of EVP.\n  As Mark explains it, many contemporary &quot;ghost hunters&quot; go in to ostensibly haunted places and attempt to communicate with the troubled souls present, but there is little to nothing non-sensitives can do to help these entities.\n  Our best hope is to change the way the world thinks about the other side--to build a bridge of communication between our world and the passionate and positive minds in the next world.  In this way, we can work to change the mindsets of those who are trapped close to the earth in the next world because of  bitterness, resentment, negativity, etc.\n  Building bridges takes time, dedication, and more time.  That&#39;s why the best ITC researchers today are spending less time at haunted locations and more time at home, with regular experimentation sessions at set times each day, building up trust and vibrations with individuals on the other side who are also working to this end.\n  I have received amazing communications during the past two months, but only when I am loyal to my experiments, focused on the good, and free of stress and negativity.\n  My advice to you: don&#39;t worry about your equipment. Don&#39;t worry about where you are.  In fact, don&#39;t worry at all.\n  Feel your heart and feel the the wonder of the possibility. Be loyal to your recording routine, and develop your good relationships with other experimenters.\n  Most importantly: Just believe.  Honest to God, that&#39;s all that matters.  \n   \n  Good luck to you!\n  Good luck to us all!\n  Ursula\n\nRobin Henson &lt;MudPuddleFarm@...&gt; wrote:\n          Hi all,\n\nI&#39;m new to the group but probably know some of you from another \nlist. I haven&#39;t been too active in the realm of EVP recording \nrecently, but have had what I consider excellent results in the past \nusing my little refurbished Ebay-bargain Olympus VN-120 PC.\n\nI&#39;m anxious to start recording again and am feeling pretty \noverwhelmed by the technology you all seem to be using. I know a \nlittle about using good headphones and denoiser programs, but beyond \nthat I&#39;m electronically challenged. Still, I wonder if there are \nsimple techniques I can experiment with to increase my success. I \nthink I&#39;m a little bored.\n\nI&#39;ve felt pretty strongly that I&#39;ve been communicating with a very \nsmall number of entities, and I&#39;m wondering if that&#39;s due to the \nlimitations of my equipment. My most impressive EVPs have always been \ncaptured around my own home, particularly outside on the hill and \nnear the barn. I&#39;ve gotten two inside my house (after inviting \nspirits in), and probably 75% in total have been negative messages. \n\nAnyway, I&#39;m thinking about getting another DVR and would love to hear \nyour thoughts and recommendations about which ones are best. I would \nlike to communicate with more advanced entities eventually, but \nunfortunately don&#39;t have the brain for building anything myself.\n\nThanks!\n\nRobin\n\n\n\n                         \n\r\n--0-1474504404-1198893201=:14508\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;div&gt;Hello, Robin!&lt;/div&gt;  &lt;div&gt;I&#39;m taking a couple of weeks off from recording, but I&#39;m rather new, too, to what I think of as &quot;ritualized EVP&quot; as differentiated from &quot;random EVP&quot;&nbsp; I know that some group&nbsp; members collect EVP at haunted locations and during ritual at-home recording sessions, but I don&#39;t participate in the former anymore at all, though I did for almost two decades.&lt;/div&gt;  &lt;div&gt;I have been investigating haunted places for about twenty years and collecting EVP samples from such locations without much but negative responses.&lt;/div&gt;  &lt;div&gt;I met ITC leader Mark Macy in October and only then began a ritualized collection of EVP.&lt;/div&gt;  &lt;div&gt;As Mark explains it, many contemporary &quot;ghost hunters&quot; go in to ostensibly haunted places and attempt to communicate with the troubled souls present, but there is little to nothing non-sensitives can do to help these entities.&lt;/div&gt;  &lt;div&gt;Our best hope is to change the way the world thinks about the other side--to build\n a bridge of communication between our world and the passionate and positive minds in the next world.&nbsp; In this way, we can work to change the mindsets of those who are trapped close to the earth in the next world because of&nbsp; bitterness, resentment, negativity, etc.&lt;/div&gt;  &lt;div&gt;Building bridges takes time, dedication, and more time.&nbsp; That&#39;s why the best ITC researchers today are spending less time at haunted locations and more time at home, with regular experimentation sessions at set times each day, building up trust and vibrations with individuals on the other side who are also working to this end.&lt;/div&gt;  &lt;div&gt;I have received amazing communications during the past two months, but only when I am loyal to my experiments, focused on the good, and free of stress and negativity.&lt;/div&gt;  &lt;div&gt;My advice to you: don&#39;t worry about your equipment. Don&#39;t worry about where you are.&nbsp; In fact, don&#39;t worry at all.&lt;/div&gt;  &lt;div&gt;Feel your heart and feel the the wonder of\n the possibility. Be loyal to your recording routine, and develop your good relationships with other experimenters.&lt;/div&gt;  &lt;div&gt;Most importantly: Just believe.&nbsp; Honest to God, that&#39;s all that matters.&nbsp; &lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Good luck to you!&lt;/div&gt;  &lt;div&gt;Good luck to us all!&lt;/div&gt;  &lt;div&gt;Ursula&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;Robin Henson &lt;MudPuddleFarm@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/div&gt;  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;div&gt;Hi all,&lt;BR&gt;&lt;BR&gt;I&#39;m new to the group but probably know some of you from another &lt;BR&gt;list. I haven&#39;t been too active in the realm of EVP recording &lt;BR&gt;recently, but have had what I consider\n excellent results in the past &lt;BR&gt;using my little refurbished Ebay-bargain Olympus VN-120 PC.&lt;BR&gt;&lt;BR&gt;I&#39;m anxious to start recording again and am feeling pretty &lt;BR&gt;overwhelmed by the technology you all seem to be using. I know a &lt;BR&gt;little about using good headphones and denoiser programs, but beyond &lt;BR&gt;that I&#39;m electronically challenged. Still, I wonder if there are &lt;BR&gt;simple techniques I can experiment with to increase my success. I &lt;BR&gt;think I&#39;m a little bored.&lt;BR&gt;&lt;BR&gt;I&#39;ve felt pretty strongly that I&#39;ve been communicating with a very &lt;BR&gt;small number of entities, and I&#39;m wondering if that&#39;s due to the &lt;BR&gt;limitations of my equipment. My most impressive EVPs have always been &lt;BR&gt;captured around my own home, particularly outside on the hill and &lt;BR&gt;near the barn. I&#39;ve gotten two inside my house (after inviting &lt;BR&gt;spirits in), and probably 75% in total have been negative messages. &lt;BR&gt;&lt;BR&gt;Anyway, I&#39;m thinking about getting another DVR and would love to hear &lt;BR&gt;your\n thoughts and recommendations about which ones are best. I would &lt;BR&gt;like to communicate with more advanced entities eventually, but &lt;BR&gt;unfortunately don&#39;t have the brain for building anything myself.&lt;BR&gt;&lt;BR&gt;Thanks!&lt;BR&gt;&lt;BR&gt;Robin&lt;BR&gt;&lt;BR&gt;&lt;/div&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;\r\n--0-1474504404-1198893201=:14508--"}