{"id": "4611", "subject": "Re: [EVP-ITC] Digital Voice Recorder Advice", "author": "Zack Widup", "timestamp": "2007-12-29T02:26:34Z", "full_text": "Hi Robin,\n\nRadio Shack now carries the Olympus VN-4100PC at about the same price I \npaid for my VN-960PC a couple years ago.  I&#39;ve been very happy with the \n960. The 4100 has about 4 times the recording time, I think. That would \nmake it about 24 hours.\n\nZack\n\nOn Sat, 29 Dec 2007, Robin Henson wrote:\n\n&gt; Hi all,\n&gt;\n&gt; I&#39;m new to the group but probably know some of you from another\n&gt; list.  I haven&#39;t been too active in the realm of EVP recording\n&gt; recently, but have had what I consider excellent results in the past\n&gt; using my little refurbished Ebay-bargain Olympus VN-120 PC.\n&gt;\n&gt; I&#39;m anxious to start recording again and am feeling pretty\n&gt; overwhelmed by the technology you all seem to be using.  I know a\n&gt; little about using good headphones and denoiser programs, but beyond\n&gt; that I&#39;m electronically challenged.  Still, I wonder if there are\n&gt; simple techniques I can experiment with to increase my success.  I\n&gt; think I&#39;m a little bored.\n&gt;\n&gt; I&#39;ve felt pretty strongly that I&#39;ve been communicating with a very\n&gt; small number of entities, and I&#39;m wondering if that&#39;s due to the\n&gt; limitations of my equipment. My most impressive EVPs have always been\n&gt; captured around my own home, particularly outside on the hill and\n&gt; near the barn.  I&#39;ve gotten two inside my house (after inviting\n&gt; spirits in), and probably 75% in total have been negative messages.\n&gt;\n&gt; Anyway, I&#39;m thinking about getting another DVR and would love to hear\n&gt; your thoughts and recommendations about which ones are best.  I would\n&gt; like to communicate with more advanced entities eventually, but\n&gt; unfortunately don&#39;t have the brain for building anything myself.\n&gt;\n&gt; Thanks!\n&gt;\n&gt; Robin\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Yahoo! Groups Links\n&gt;\n&gt;\n&gt;\n&gt;"}