{"id": "4612", "subject": "Re: Digital Voice Recorder Advice", "author": "Frank Sumption", "timestamp": "2007-12-29T02:44:24Z", "full_text": "You might try just recording. Announce you are doing an EVP session, \nand just record, no questions, no pre-conceptions, no expectations. I \ndo spur of the moment sessions, and almost never ask questions, I \nalso don&#39;t do investigations. &quot;They&quot; know what you need, and will \ndeliver it if given a chance. \n\n Frank-S \n\n--- In EVP-ITC@yahoogroups.com, Ursula Bielski &lt;ursulabielski@...&gt; \nwrote:\n&gt;\n&gt; Hello, Robin!\n&gt;   I&#39;m taking a couple of weeks off from recording, but I&#39;m rather \nnew, too, to what I think of as &quot;ritualized EVP&quot; as differentiated \nfrom &quot;random EVP&quot;  I know that some group  members collect EVP at \nhaunted locations and during ritual at-home recording sessions, but I \ndon&#39;t participate in the former anymore at all, though I did for \nalmost two decades.\n&gt;   I have been investigating haunted places for about twenty years \nand collecting EVP samples from such locations without much but \nnegative responses.\n&gt;   I met ITC leader Mark Macy in October and only then began a \nritualized collection of EVP.\n&gt;   As Mark explains it, many contemporary &quot;ghost hunters&quot; go in to \nostensibly haunted places and attempt to communicate with the \ntroubled souls present, but there is little to nothing non-sensitives \ncan do to help these entities.\n&gt;   Our best hope is to change the way the world thinks about the \nother side--to build a bridge of communication between our world and \nthe passionate and positive minds in the next world.  In this way, we \ncan work to change the mindsets of those who are trapped close to the \nearth in the next world because of  bitterness, resentment, \nnegativity, etc.\n&gt;   Building bridges takes time, dedication, and more time.  That&#39;s \nwhy the best ITC researchers today are spending less time at haunted \nlocations and more time at home, with regular experimentation \nsessions at set times each day, building up trust and vibrations with \nindividuals on the other side who are also working to this end.\n&gt;   I have received amazing communications during the past two \nmonths, but only when I am loyal to my experiments, focused on the \ngood, and free of stress and negativity.\n&gt;   My advice to you: don&#39;t worry about your equipment. Don&#39;t worry \nabout where you are.  In fact, don&#39;t worry at all.\n&gt;   Feel your heart and feel the the wonder of the possibility. Be \nloyal to your recording routine, and develop your good relationships \nwith other experimenters.\n&gt;   Most importantly: Just believe.  Honest to God, that&#39;s all that \nmatters.  \n&gt;    \n&gt;   Good luck to you!\n&gt;   Good luck to us all!\n&gt;   Ursula\n&gt; \n&gt; Robin Henson &lt;MudPuddleFarm@...&gt; wrote:\n&gt;           Hi all,\n&gt; \n&gt; I&#39;m new to the group but probably know some of you from another \n&gt; list. I haven&#39;t been too active in the realm of EVP recording \n&gt; recently, but have had what I consider excellent results in the \npast \n&gt; using my little refurbished Ebay-bargain Olympus VN-120 PC.\n&gt; \n&gt; I&#39;m anxious to start recording again and am feeling pretty \n&gt; overwhelmed by the technology you all seem to be using. I know a \n&gt; little about using good headphones and denoiser programs, but \nbeyond \n&gt; that I&#39;m electronically challenged. Still, I wonder if there are \n&gt; simple techniques I can experiment with to increase my success. I \n&gt; think I&#39;m a little bored.\n&gt; \n&gt; I&#39;ve felt pretty strongly that I&#39;ve been communicating with a very \n&gt; small number of entities, and I&#39;m wondering if that&#39;s due to the \n&gt; limitations of my equipment. My most impressive EVPs have always \nbeen \n&gt; captured around my own home, particularly outside on the hill and \n&gt; near the barn. I&#39;ve gotten two inside my house (after inviting \n&gt; spirits in), and probably 75% in total have been negative messages. \n&gt; \n&gt; Anyway, I&#39;m thinking about getting another DVR and would love to \nhear \n&gt; your thoughts and recommendations about which ones are best. I \nwould \n&gt; like to communicate with more advanced entities eventually, but \n&gt; unfortunately don&#39;t have the brain for building anything myself.\n&gt; \n&gt; Thanks!\n&gt; \n&gt; Robin\n&gt;"}