{"id": "4613", "subject": "Re: Digital Voice Recorder Advice", "author": "Robin Henson", "timestamp": "2007-12-29T03:15:02Z", "full_text": "Wow, thanks for your help guys!\n\nUrsula, your post was lovely.  I&#39;ve been promising myself to learn \nmore about Mark Macy&#39;s work and will check out his website ASAP. \nRitualized versus random recording makes sense to me now, as I want \nto accomplish true communication rather than continue being verbally \nabused. Have you given up &quot;ghost hunting&quot; altogether? \n\nI&#39;ve been looking at the Olympus VN-4100 PC, Zack!  I don&#39;t know if I \nneed that much recording time, but I sure have liked the one I have \nand wouldn&#39;t mind upgrading a bit.  \n\nHi Frank! I basically follow your suggestion when recording, and once \nI learned to be quiet I actually started getting responses. I think \nthe entities at my house got tired of playing with me though, and now \nthey aren&#39;t saying anything.  I kind of miss them, but I do feel it&#39;s \ntime to move on.\n\nRobin \n\n \n\n\n--- In EVP-ITC@yahoogroups.com, Zack Widup &lt;w9sz@...&gt; wrote:\n&gt;\n&gt; \n&gt; Hi Robin,\n&gt; \n&gt; Radio Shack now carries the Olympus VN-4100PC at about the same \nprice I \n&gt; paid for my VN-960PC a couple years ago.  I&#39;ve been very happy with \nthe \n&gt; 960. The 4100 has about 4 times the recording time, I think. That \nwould \n&gt; make it about 24 hours.\n&gt; \n&gt; Zack\n&gt; \n&gt; On Sat, 29 Dec 2007, Robin Henson wrote:\n&gt; \n&gt; &gt; Hi all,\n&gt; &gt;\n&gt; &gt; I&#39;m new to the group but probably know some of you from another\n&gt; &gt; list.  I haven&#39;t been too active in the realm of EVP recording\n&gt; &gt; recently, but have had what I consider excellent results in the \npast\n&gt; &gt; using my little refurbished Ebay-bargain Olympus VN-120 PC.\n&gt; &gt;\n&gt; &gt; I&#39;m anxious to start recording again and am feeling pretty\n&gt; &gt; overwhelmed by the technology you all seem to be using.  I know a\n&gt; &gt; little about using good headphones and denoiser programs, but \nbeyond\n&gt; &gt; that I&#39;m electronically challenged.  Still, I wonder if there are\n&gt; &gt; simple techniques I can experiment with to increase my success.  I\n&gt; &gt; think I&#39;m a little bored.\n&gt; &gt;\n&gt; &gt; I&#39;ve felt pretty strongly that I&#39;ve been communicating with a very\n&gt; &gt; small number of entities, and I&#39;m wondering if that&#39;s due to the\n&gt; &gt; limitations of my equipment. My most impressive EVPs have always \nbeen\n&gt; &gt; captured around my own home, particularly outside on the hill and\n&gt; &gt; near the barn.  I&#39;ve gotten two inside my house (after inviting\n&gt; &gt; spirits in), and probably 75% in total have been negative \nmessages.\n&gt; &gt;\n&gt; &gt; Anyway, I&#39;m thinking about getting another DVR and would love to \nhear\n&gt; &gt; your thoughts and recommendations about which ones are best.  I \nwould\n&gt; &gt; like to communicate with more advanced entities eventually, but\n&gt; &gt; unfortunately don&#39;t have the brain for building anything myself.\n&gt; &gt;\n&gt; &gt; Thanks!\n&gt; &gt;\n&gt; &gt; Robin\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Yahoo! Groups Links\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt;"}