{"id": "4617", "subject": "Re: Digital Voice Recorder Advice", "author": "psi_research", "timestamp": "2007-12-29T05:37:50Z", "full_text": "oops. I see it was Ursula who posted the &quot;r vs. r&quot; statement. And\nUrsula your post is so much more eloquent and you&#39;ve articulated the\npoint much better than I could. I&#39;ll bow out of your way -Bill \n\n--- In EVP-ITC@yahoogroups.com, &quot;psi_research&quot; &lt;vilhellm@...&gt; wrote:\n&gt;\n&gt; Hi Robin,\n&gt; Your phrase of &quot;ritualized vs. random&quot; is interesting. There are many\n&gt; who believe that communication is between the conscious of the\n&gt; researcher and the entity and the equipment is secondary. It&#39;s easy to\n&gt; get swept up in the technology and forget there is possibly a psychic\n&gt; connection going on. With that said, focusing on equipment actually\n&gt; can help the researcher become receptive to establishing a\n&gt; communication link. While paying attention to the equipment, we forget\n&gt; about the daily distractions and minor irritations that may prevent us\n&gt; from establishing contact. \n&gt; \n&gt; The setting up the gear we use could be considered the first part of\n&gt; the &quot;ritual&quot;. I like to clear my mind, set up equipment, mess with it\n&gt; some more, then I am mentally prepare to begin what I hope will be a\n&gt; successful session.\n&gt; \n&gt; I guess &quot;random&quot; recording to me would be what happens in the field\n&gt; during a paranormal investigation. I don&#39;t bring Box technology into a\n&gt; location with the intention of possibly contacting lingering spirits\n&gt; at that location but I do bring audio recorders in hopes of recording\n&gt; evp&#39;s.\n&gt; \n&gt; I find the Box works perhaps even better when I&#39;m in a familiar place\n&gt; like the room in my home that is designated for that purpose. I do\n&gt; desire to have the finest Box technology that is possible but more\n&gt; important is the association that seems to occur between the\n&gt; researcher and the Box that is favored. Despite some of the benefits\n&gt; of the new gear, the one that I seem to have a connection with is one\n&gt; that requires a little more finesse to operate.  -Bill\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Robin Henson&quot; &lt;MudPuddleFarm@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Wow, thanks for your help guys!\n&gt; &gt; \n&gt; &gt; Ursula, your post was lovely.  I&#39;ve been promising myself to learn \n&gt; &gt; more about Mark Macy&#39;s work and will check out his website ASAP. \n&gt; &gt; Ritualized versus random recording makes sense to me now, as I want \n&gt; &gt; to accomplish true communication rather than continue being verbally \n&gt; &gt; abused. Have you given up &quot;ghost hunting&quot; altogether? \n&gt; &gt; \n&gt; &gt; I&#39;ve been looking at the Olympus VN-4100 PC, Zack!  I don&#39;t know if I \n&gt; &gt; need that much recording time, but I sure have liked the one I have \n&gt; &gt; and wouldn&#39;t mind upgrading a bit.  \n&gt; &gt; \n&gt; &gt; Hi Frank! I basically follow your suggestion when recording, and once \n&gt; &gt; I learned to be quiet I actually started getting responses. I think \n&gt; &gt; the entities at my house got tired of playing with me though, and now \n&gt; &gt; they aren&#39;t saying anything.  I kind of miss them, but I do feel it&#39;s \n&gt; &gt; time to move on.\n&gt; &gt; \n&gt; &gt; Robin \n&gt; &gt; \n&gt; &gt;  \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, Zack Widup &lt;w9sz@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; \n&gt; &gt; &gt; Hi Robin,\n&gt; &gt; &gt; \n&gt; &gt; &gt; Radio Shack now carries the Olympus VN-4100PC at about the same \n&gt; &gt; price I \n&gt; &gt; &gt; paid for my VN-960PC a couple years ago.  I&#39;ve been very happy with \n&gt; &gt; the \n&gt; &gt; &gt; 960. The 4100 has about 4 times the recording time, I think. That \n&gt; &gt; would \n&gt; &gt; &gt; make it about 24 hours.\n&gt; &gt; &gt; \n&gt; &gt; &gt; Zack\n&gt; &gt; &gt; \n&gt; &gt; &gt; On Sat, 29 Dec 2007, Robin Henson wrote:\n&gt; &gt; &gt; \n&gt; &gt; &gt; &gt; Hi all,\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; I&#39;m new to the group but probably know some of you from another\n&gt; &gt; &gt; &gt; list.  I haven&#39;t been too active in the realm of EVP recording\n&gt; &gt; &gt; &gt; recently, but have had what I consider excellent results in the \n&gt; &gt; past\n&gt; &gt; &gt; &gt; using my little refurbished Ebay-bargain Olympus VN-120 PC.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; I&#39;m anxious to start recording again and am feeling pretty\n&gt; &gt; &gt; &gt; overwhelmed by the technology you all seem to be using.  I know a\n&gt; &gt; &gt; &gt; little about using good headphones and denoiser programs, but \n&gt; &gt; beyond\n&gt; &gt; &gt; &gt; that I&#39;m electronically challenged.  Still, I wonder if there are\n&gt; &gt; &gt; &gt; simple techniques I can experiment with to increase my success.  I\n&gt; &gt; &gt; &gt; think I&#39;m a little bored.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; I&#39;ve felt pretty strongly that I&#39;ve been communicating with a very\n&gt; &gt; &gt; &gt; small number of entities, and I&#39;m wondering if that&#39;s due to the\n&gt; &gt; &gt; &gt; limitations of my equipment. My most impressive EVPs have always \n&gt; &gt; been\n&gt; &gt; &gt; &gt; captured around my own home, particularly outside on the hill and\n&gt; &gt; &gt; &gt; near the barn.  I&#39;ve gotten two inside my house (after inviting\n&gt; &gt; &gt; &gt; spirits in), and probably 75% in total have been negative \n&gt; &gt; messages.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Anyway, I&#39;m thinking about getting another DVR and would love to \n&gt; &gt; hear\n&gt; &gt; &gt; &gt; your thoughts and recommendations about which ones are best.  I \n&gt; &gt; would\n&gt; &gt; &gt; &gt; like to communicate with more advanced entities eventually, but\n&gt; &gt; &gt; &gt; unfortunately don&#39;t have the brain for building anything myself.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Thanks!\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Robin\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Yahoo! Groups Links\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}