{"id": "4625", "subject": "Re: Digital Voice Recorder Advice", "author": "mllejade", "timestamp": "2007-12-29T19:30:20Z", "full_text": "Hi Ursula and EVP-ITC community,\n\nI&#39;m new to this group and read with great interest the experiments \nthat you&#39;ve all been involved in.  I agree totally that the \nindividual&#39;s heart and mind are the most important tools in the \ncapturing of EVPs and/or communicating with other dimensions in that \nfrom my limited personal experience and the observation of others in \nthis field, I believe the messenger is just as important as the \nmessage being conveyed.  In other words, I&#39;ve observed that in most \ncases, especially in those cases where a group of people are at a \nsupposedly haunted locale trying to capture EVP with DVRs, that \neither only one person receives a message to a question or the \nmessages received by everyone in the group is different.  This leads \nme to believe that the individual is just as an important a \nchannel/receiver as the equipment being employed.  Therefore, I feel \none must endeavor in one&#39;s personal life to strive towards all things \npositive as the laws of attraction apply in that you&#39;ll get back what \nyou put out (to put in crudely).\n\nYay, today I&#39;m trekking to Radio Shack through the cold and rain here \nin San Francisco (I know, we Californians are spoiled; we shiver at \n40 degrees and turn to ice at anything under 35 degrees), to get some \nequipment and spend New Year&#39;s making my first box (thanks to Mike \nC.&#39;s video, and to Frank S. for pointing me in the right direction)!  \n\nHappy New Year to all,\nSharon\n\n--- In EVP-ITC@yahoogroups.com, Ursula Bielski &lt;ursulabielski@...&gt; \nwrote:\n&gt;\n&gt; Robin,\n&gt;   Glad something helped.  \n&gt;   Beyond my thoughts, I totally agree that the choice of equipment \nis part of the ritual, and that having respect and passion for the \nprocess of choosing can actually add to the positive vibrations. \nAlthough, as previously stated, I believe with Mark Macy that the \nmind and heart are the most important tools in all this, how touched \nthose on the other side must be to witness our fervent and abundant \nexchanges as we try to hash out the details of our equipment trials!  \nSurely this heightens the love on their end--and their efforts to \ngive us the contacts we desire. Something to think about.\n&gt;   Best to all,\n&gt;   Ursula\n&gt; \n&gt; Robin Henson &lt;MudPuddleFarm@...&gt; wrote:\n&gt;           Wow, thanks for your help guys!\n&gt; \n&gt; Ursula, your post was lovely. I&#39;ve been promising myself to learn \n&gt; more about Mark Macy&#39;s work and will check out his website ASAP. \n&gt; Ritualized versus random recording makes sense to me now, as I want \n&gt; to accomplish true communication rather than continue being \nverbally \n&gt; abused. Have you given up &quot;ghost hunting&quot; altogether? \n&gt; \n&gt; I&#39;ve been looking at the Olympus VN-4100 PC, Zack! I don&#39;t know if \nI \n&gt; need that much recording time, but I sure have liked the one I have \n&gt; and wouldn&#39;t mind upgrading a bit. \n&gt; \n&gt; Hi Frank! I basically follow your suggestion when recording, and \nonce \n&gt; I learned to be quiet I actually started getting responses. I think \n&gt; the entities at my house got tired of playing with me though, and \nnow \n&gt; they aren&#39;t saying anything. I kind of miss them, but I do feel \nit&#39;s \n&gt; time to move on.\n&gt; \n&gt; Robin \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Zack Widup &lt;w9sz@&gt; wrote:\n&gt; &gt;\n&gt; &gt; \n&gt; &gt; Hi Robin,\n&gt; &gt; \n&gt; &gt; Radio Shack now carries the Olympus VN-4100PC at about the same \n&gt; price I \n&gt; &gt; paid for my VN-960PC a couple years ago. I&#39;ve been very happy \nwith \n&gt; the \n&gt; &gt; 960. The 4100 has about 4 times the recording time, I think. That \n&gt; would \n&gt; &gt; make it about 24 hours.\n&gt; &gt; \n&gt; &gt; Zack\n&gt; &gt; \n&gt; &gt; On Sat, 29 Dec 2007, Robin Henson wrote:\n&gt; &gt; \n&gt; &gt; &gt; Hi all,\n&gt; &gt; &gt;\n&gt; &gt; &gt; I&#39;m new to the group but probably know some of you from another\n&gt; &gt; &gt; list. I haven&#39;t been too active in the realm of EVP recording\n&gt; &gt; &gt; recently, but have had what I consider excellent results in the \n&gt; past\n&gt; &gt; &gt; using my little refurbished Ebay-bargain Olympus VN-120 PC.\n&gt; &gt; &gt;\n&gt; &gt; &gt; I&#39;m anxious to start recording again and am feeling pretty\n&gt; &gt; &gt; overwhelmed by the technology you all seem to be using. I know a\n&gt; &gt; &gt; little about using good headphones and denoiser programs, but \n&gt; beyond\n&gt; &gt; &gt; that I&#39;m electronically challenged. Still, I wonder if there are\n&gt; &gt; &gt; simple techniques I can experiment with to increase my success. \nI\n&gt; &gt; &gt; think I&#39;m a little bored.\n&gt; &gt; &gt;\n&gt; &gt; &gt; I&#39;ve felt pretty strongly that I&#39;ve been communicating with a \nvery\n&gt; &gt; &gt; small number of entities, and I&#39;m wondering if that&#39;s due to the\n&gt; &gt; &gt; limitations of my equipment. My most impressive EVPs have \nalways \n&gt; been\n&gt; &gt; &gt; captured around my own home, particularly outside on the hill \nand\n&gt; &gt; &gt; near the barn. I&#39;ve gotten two inside my house (after inviting\n&gt; &gt; &gt; spirits in), and probably 75% in total have been negative \n&gt; messages.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Anyway, I&#39;m thinking about getting another DVR and would love \nto \n&gt; hear\n&gt; &gt; &gt; your thoughts and recommendations about which ones are best. I \n&gt; would\n&gt; &gt; &gt; like to communicate with more advanced entities eventually, but\n&gt; &gt; &gt; unfortunately don&#39;t have the brain for building anything myself.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Thanks!\n&gt; &gt; &gt;\n&gt; &gt; &gt; Robin\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; Yahoo! Groups Links\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}