{"id": "4630", "subject": "Re: Digital Voice Recorder Advice", "author": "psi_research", "timestamp": "2007-12-29T20:24:19Z", "full_text": "If you ever saw the series SciFi Investigates, which briefly ran\nearlier this year, you may have seen the episode with Mark. This\nseries focuses on debunking claims of the paranormal, whether it was\nthe reported crash of a ufo in the desert (the 1951 Roswell\nincident)or the existence of the afterlife. Well, the show with Mark\nwas the only one I remember where they couldn&#39;t logically explain how\nthe double image photos were forming.\n\nAnd that is an issue we face when we present Box recordings.\nNon-believers try to explain away the recordings by applying standard\nscientific based arguments. They say we&#39;re hearing broadcast\nfragments, or it&#39;s just matrixing, whatever. But even though we use\nreadily available technology to build the Box, the results that are\nachieved go beyond conventional science. We don&#39;t yet understand how\nit is working, but it is. As you use the Box, any version of it, you\nwill discover that certain messages intended for the operator come\nthrough more frequently.\n\n-Bill\n\n--- In EVP-ITC@yahoogroups.com, Ursula Bielski &lt;ursulabielski@...&gt; wrote:\n&gt;\n&gt; As far as I know, Mark has been focusing on lecturing with his\nLuminator machine, and that is how he is bringing the ITC message to\nthe public.\n&gt;   Mark says that not even Mark really knows how it works, but the\nLuminator apparently recycles air through liquid-filled coils to sort\nof change the molecular structure of the atoms--I think!:)  This gives\ndiscarnate entities just enough mass to be photographed.\n&gt;   As a result, photographs taken of people in a room where the\nluminator is running often show spirit faces superimposed over the\nfaces of the living subjects.  You can read more in Mark&#39;s book,\n&quot;Spirit Faces.&quot;\n&gt;   I don&#39;t think Mark is a member of any experimental forums; but I\nwould say, invite him!  He just might join!\n&gt;    \n&gt;   Best,\n&gt;   Urs\n&gt; \n&gt; Debbie Tejada &lt;debbie@...&gt; wrote:\n&gt;           Wow, I&#39;m loving all this information, it&#39;s giving me a lot\nof ideas. Very exciting for me!  \n&gt; \n&gt;   Does Mark Macy belong to this forum too? I met him about 3 years\nago. My husband is a commercial photographer and Mark asked him to do\nhis portrait for a book he was coming out with. He came to our home\nstudio for the portrait, and I got to talk with him a little about\nwhat he does. At that time all I knew of EVP was from the White Noise\nmovie, wasn&#39;t sure it was real. But Mark was very nice, passionate\nabout ITC/EVP and very convincing. I wasn&#39;t quite sure what to expect\nwhen I originally heard what he did, with all the loonies out there\nclaiming all kinds of stuff, but I got a really good feeling from him\nand he&#39;s very, well, like I said, convincing. After that I went to his\nweb site and also bought one of his books, which was a nice read.\n&gt;   \n&gt; \n&gt;   I went to the Stanley Hotel in November with a ghost hunting group\nand Mark was a speaker there. I was really looking forward to his\nlecture, but ended up with a wicked stomach virus and had to come home\nearly. I missed just about everything that weekend!\n&gt;   \n&gt; \n&gt;   Deb T\n&gt;   \n&gt; \n&gt;   \n&gt; \n&gt;   \n&gt;     On Dec 29, 2007, at 9:51 AM, Ursula Bielski wrote:\n&gt; \n&gt;             \n&gt; \n&gt;   Oops! .  I forgot to answer: No, I have not given up ghost hunting\nat all, but over the years I have come to focus more on the collection\nand distribution of experiences than on encountering phenomena myself.\n ITC has really affirmed this for me.\n&gt;   I&#39;ve felt all along that my job is to make people aware that\nspiritual phenomena go on all the time in millions of lives; I&#39;m not a\nscientist and I know nothing I do will change the way science thinks.\n BUT if I can open the minds of young people today, perhaps our future\nscientists will make it their business to figure all this out. \n&gt;   I know this is a lot of what ITC experimenters are doing:\nconvincing others of the afterlife by their recorded evidence. \nAmazing things can happen when THAT happens. \n&gt;   Again, Mark Macy is so wonderful because he has dedicated his life\nto this.  He and his colleagues have received such detailed\ndescriptions of how the afterlife works, that they have helped the\nliving change their lives to erase the fear of death--and to live in a\nway that brings us to as high a spiritual level as possible right away\nwhen our bodies die.  This means, for example, dealing with issues and\naddictions, that plague us in life, since the spirits tell us we take\nit all with us!  That is, death isn&#39;t a cure-all.\n&gt;   Any glimpse at the history of ITC shows us that all of this has\nbeen gradually growing since the 19th century, when state-of-the-art\ngraphite pencils and telegraphs were used to contact the dead.  Since\nthen, there have been &quot;breakthroughs&quot; a number of times when\nastounding floods of messages have come through.\n&gt;   You experimenters are all so incredible--I&#39;m amazed every day at\nyour love, dedication and faith.  Surely something wonderful is going\nto come from all this, and I think it&#39;s going to come during our\nlifetimes.\n&gt;    \n&gt;   Ursula\n&gt;    \n&gt;    \n&gt;   \n&gt; Robin Searcy Henson &lt;MudPuddleFarm@msn.! com&gt;&lt; /i&gt; wrote:\n&gt;           Hello Bill,\n&gt;    \n&gt;   Yes, I did steal that phrase from Ursula because I thought it\ndescribed what I was doing as compared to what I would like to be doing!\n&gt;    \n&gt;   I like what you said about focus on the equipment helping to\nestablish the psychic connection.  It makes so much sense.  This\ndiscussion has definitely shown me that mental tools and preparation\nare as important as physical ones.  \n&gt;    \n&gt;   Thank you for your input.\n&gt;    \n&gt;   Robin\n&gt;    \n&gt;    \n&gt;     ----- Original Message -----\n&gt;   From: psi_research\n&gt;   To: EVP-ITC@yahoogroups.com\n&gt;   Sent: Friday, December 28, 2007 9:37 PM\n&gt;   Subject: [EVP-ITC] Re: Digital Voice Recorder Advice\n&gt;   \n&gt; \n&gt;     oops. I see it was Ursula who posted the &quot;r vs. r&quot; statement. And\n&gt; Ursula your post is so much more eloquent and you&#39;ve articulated the\n&gt; point much better than I could. I&#39;ll bow out of your way -Bill \n&gt; \n&gt; --- In EVP-ITC@...! m, &quot; psi_research&quot; &lt;vilhellm@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hi Robin,\n&gt; &gt; Your phrase of &quot;ritualized vs. random&quot; is interesting. There are many\n&gt; &gt; who believe that communication is between the conscious of the\n&gt; &gt; researcher and the entity and the equipment is secondary. It&#39;s easy to\n&gt; &gt; get swept up in the technology and forget there is possibly a psychic\n&gt; &gt; connection going on. With that said, focusing on equipment actually\n&gt; &gt; can help the researcher become receptive to establishing a\n&gt; &gt; communication link. While paying attention to the equipment, we forget\n&gt; &gt; about the daily distractions and minor irritations that may prevent us\n&gt; &gt; from establishing contact. \n&gt; &gt; \n&gt; &gt; The setting up the gear we use could be considered the first part of\n&gt; &gt; the &quot;ritual&quot;. I like to clear my mind, set up equipment, mess with it\n&gt; &gt; some more, then I am mentally prepare to begin what I hope will be a\n&gt; &gt; successful session.\n&gt; &gt; \n&gt; &gt; I guess &quot;random&quot; recording to me would be what happens in the field\n&gt; &gt; during a paranormal investigation. I don&#39;t bring Box technology into a\n&gt; &gt; location with the intention of possibly contacting lingering spirits\n&gt; &gt; at that location but I do bring audio recorders in hopes of recording\n&gt; &gt; evp&#39;s.\n&gt; &gt; \n&gt; &gt; I find the Box works perhaps even better when I&#39;m in a familiar place\n&gt; &gt; like the room in my home that is designated for that purpose. I do\n&gt; &gt; desire to have the finest Box technology that is possible but more\n&gt; &gt; important is the association that seems to occur between the\n&gt; &gt; researcher and the Box that is favored. Despite some of the benefits\n&gt; &gt; of the new gear, the one that I seem to have a connection with is one\n&gt; &gt; that requires a little more finesse to operate. -Bill\n&gt; &g! t; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;Robin Henson&quot; &lt;MudPuddleFarm@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; Wow, thanks for your help guys!\n&gt; &gt; &gt; \n&gt; &gt; &gt; Ursula, your post was lovely. I&#39;ve been promising myself to learn \n&gt; &gt; &gt; more about Mark Macy&#39;s work and will check out his website ASAP. \n&gt; &gt; &gt; Ritualized versus random recording makes sense to me now, as I want \n&gt; &gt; &gt; to accomplish true communication rather than continue being\nverbally \n&gt; &gt; &gt; abused. Have you given up &quot;ghost hunting&quot; altogether? \n&gt; &gt; &gt; \n&gt; &gt; &gt; I&#39;ve been looking at the Olympus VN-4100 PC, Zack! I don&#39;t know\nif I \n&gt; &gt; &gt; need that much recording time, but I sure have liked the one I have \n&gt; &gt; &gt; and wouldn&#39;t mind upgrading a bit. \n&gt; &gt; &gt; \n&gt; &gt; &gt; Hi Frank! I basically follow your suggestion when recording, and\nonce \n&gt; &gt; &gt; I learned to be quiet I actually started getting responses. I think \n&gt; &gt; &gt; the entities at my house got tired of playing with me though,\nand now \n&gt; &gt; &gt; they aren&#39;t saying anything. I kind of miss them, but I do feel\nit&#39;s \n&gt; &g! t; &gt; time to move on.\n&gt; &gt; &gt; \n&gt; &gt; &gt; Robin \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com, Zack Widup &lt;w9sz@&gt; wrote:\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; Hi Robin,\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; Radio Shack now carries the Olympus VN-4100PC at about the same \n&gt; &gt; &gt; price I \n&gt; &gt; &gt; &gt; paid for my VN-960PC a couple years ago. I&#39;ve been very happy\nwith \n&gt; &gt; &gt; the \n&gt; &gt; &gt; &gt; 960. The 4100 has about 4 times the recording time, I think. That \n&gt; &gt; &gt; would \n&gt; &gt; &gt; &gt; make it about 24 hours.\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; Zack\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; On Sat, 29 Dec 2007, Robin Henson wrote:\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; Hi all,\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; I&#39;m new to the group but probably know some of you from another\n&gt; &gt; &gt; &gt; &gt; list. I haven&#39;t been too active in the realm of EVP recording\n&gt; &gt; &gt; &gt; &gt; recently, but have had what I consider excellent results in the \n&gt; &gt; &gt; past\n&gt; &gt; &gt; &gt; &gt; using my little refurbished Ebay-bargain Olympus VN-120 PC.\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; I&#39;m anxious to start recording again and am feeling pretty\n&gt; &gt; &gt; &gt; &gt; overwhelmed by the technology you all seem to be using. I know a\n&gt; &gt; &gt; &gt; &gt; little about using good headphones and denoiser programs, but \n&gt; &gt; &gt; beyond\n&gt; &gt; &gt; &gt; &gt; that I&#39;m electronically challenged. Still, I wonder if there are\n&gt; &gt; &gt; &gt; &gt; simple techniques I can experiment with to increase my\nsuccess. I\n&gt; &gt; &gt; &gt; &gt; think I&#39;m a little bored.\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; I&#39;ve felt pretty strongly that I&#39;ve been communicating with\na very\n&gt; &gt; &gt; &gt; &gt; small number of entities, and I&#39;m wondering if that&#39;s due to the\n&gt; &gt; &gt; &gt; &gt; limitations of my equipment. My most impressive EVPs have\nalways \n&gt; &gt; &gt; been\n&gt; &gt; &gt; &gt; &gt; captured around my own home, particularly outside on the\nhill and\n&gt; &gt; &gt; &gt; &gt; near the barn. I&#39;ve gotten two inside my house (after inviting\n&gt; &gt; &gt; &gt; &gt; spirits in), and probably 75% in total have been negative \n&gt; &gt; &gt; messages.\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; Anyway, I&#39;m thinking about getting another DVR and would\nlove to \n&gt; &gt; &gt; hear\n&gt; &gt; &gt; &gt; &gt; your thoughts and recommendations about which ones are best. I \n&gt; &gt; &gt; would\n&gt; &gt; &gt; &gt; &gt; like to communicate with more advanced entities eventually, but\n&gt; &gt; &gt; &gt; &gt; unfortunately don&#39;t have the brain for building anything myself.\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; Thanks!\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; Robin\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &g! t; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; Yahoo! Groups Links\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}