{"id": "4647", "subject": "Re: Classic example", "author": "mllejade", "timestamp": "2007-12-29T23:29:16Z", "full_text": "I agree with you, Ursula, in that there is a fine line between \nobjective and subjective reality and that one must somehow synthesize \nthe two in digesting the information for oneself.  When exchanging \nfindings with others, however, I&#39;m always willing to give in that I \nrespect those who see images I may not see, or hear voices I may not \nhear, but I will not give to the point of patronization by saying \nthat I, too, see that image or hear that voice if, in fact, I don&#39;t.\n\nSharon\n\n--- In EVP-ITC@yahoogroups.com, Ursula Bielski &lt;ursulabielski@...&gt; \nwrote:\n&gt;\n&gt; I don&#39;t know as there are &quot;hundreds&quot; of examples available to the \npublic in the way of Luminator photographs, but there are a couple of \ndozen in Macy&#39;s book, &quot;Spirit Faces,&quot; and yes, many many of them are \nopen to wide interpretation, just as our humble recordings are.  In \naddition to that majority that make us say, &quot;Come on!{&quot; there are a \nhandful that make you say &quot;Hmmmmmmm. . . .&quot; Just like we offer a \nhandful of results from our endless recording efforts to try to \nconvince the hard-nosed.\n&gt;   I would think that many would see the Luminator efforts as a \nmodern effort at scrying.  Everything we do crosses boundaries, and \nmy point is that it&#39;s really hard to walk the line between trying to \nbe scientific and trying to be open.  It&#39;s really, really hard! But \nif we give in one area, we have to be willing to give in another.  \n&gt;   Ursula\n&gt;   \n&gt; \n&gt; Lisby &lt;lisby@...&gt; wrote:\n&gt;           This is a classic example of the kind of photo that Mark \nthinks shows \n&gt; a spirit extra. To me, clearly, this is the same woman--same hair, \n&gt; same eyes, same mouth, same nose. Again, to me, it looks like a \n&gt; classic long exposure when compared with other known long exposures-\n- \n&gt; I&#39;ve included just of hundreds of examples.\n&gt; \n&gt; Ann\n&gt;"}