{"id": "4671", "subject": "Re: Frank or any other electronics guru, please help!!", "author": "M.A. Coletta (Mike)", "timestamp": "2007-12-31T03:09:38Z", "full_text": "Hi Debbie,\n\nThose items you&#39;re calling clips are actually PC board mounted \nconnectors. There are other connectors plugged into those two (wires \nfeeding into them). Those connectors that are plugged into the pc \nboard mounted connectors are the ones that should have been removed \n(usually by pressing or pulling a small connecting tab which locks \nthe two together.\n\nBased on the photo it appears the pc board mounted connectors have \nbeen torn away from the PC board, ripping away the pc board traces as \nwell.  From the looks of a couple of those torn away, it might be \npretty tough to get them back together, allowing the six connection \npoints to have continuity again.\n\nThe main thing is that each of those wires need to be connected to \nthe points where the pc board traces connect to.\n\nThere are work-arounds, but getting the connectors to make good \nconnections very easily is going to be a challenge.\n\n- Mike\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;Debbie Tejada&quot; &lt;debbie@...&gt; wrote:\n&gt;\n&gt; Okay, one of my DIY projects this weekend has been to convert my\n&gt; husband&#39;s old Olympus to infrared. We&#39;re not extremely talented in \nthe\n&gt; electronics area, but we have fun and seem to muddle by. No guts no\n&gt; glory, huh?\n&gt; \n&gt; Well, for the most part the operation has been a success. I\n&gt; photographed every step of the way and taped screws and parts to the\n&gt; photos so we&#39;d know how to rebuild everything we took apart, and \nthat\n&gt; has worked just fine. I located the IR filter, removed it and cut \nand\n&gt; replaced it with a piece of glass slide. \n&gt; \n&gt; The one problem we ran into is that there were two wires that \nappeared\n&gt; to be clipped in place as opposed to being soldered or screwed in \nlike\n&gt; everything else. When we tried to pry the clips open, instead the\n&gt; whole thing came off the circuit board. WE HAVE NO CLUE HOW TO \nPROCEED\n&gt; FROM HERE. I don&#39;t know if we can just glue the darn things down and\n&gt; if so, what type of glue to use, or if we&#39;re just plain up the \ncreek.\n&gt; \n&gt; I immediately thought of this group of brainy electronics buffs. I&#39;m\n&gt; hoping someone out there can give us some advice, or if you live \nnear\n&gt; Highlands Ranch, CO, you could help in person & bail us out of \nthis. I\n&gt; was hoping to take this camera to the St. Augustine Lighthouse at \nthe\n&gt; end of this coming week.\n&gt; \n&gt; Is there any hope? I&#39;ve posted a photo of an extreme closeup of the\n&gt; clips (one is pink, the other is ivory) and the damaged board -- I \nhad\n&gt; to sandwich two photos together to get both in focus at the same \ntime\n&gt; (that&#39;s why it looks that way). For an idea of scale, the clips are\n&gt; both the same size, about 4 mm in width, 4 mm tall, 3 mm deep. Not\n&gt; easy to handle and even harder to see with these middle age eyes.\n&gt; http://www.tejadadesign.com/camera/splice.jpg\n&gt; \n&gt; Any advice would be GREATLY APPRECIATED!!  Deb T.\n&gt;"}