{"id": "4673", "subject": "Re: [EVP-ITC] OT ? RE:  Broken Cellphone", "author": "Zack Widup", "timestamp": "2007-12-31T03:52:27Z", "full_text": "Hi Robin,\n\nSome eBay sellers buy large quantities of things and sell them for a small \nprofit.  It could be he didn&#39;t know that particular unit was bad. That \nhappens sometimes and it&#39;s unfortunate it happened to you.\n\nHow much did you pay for it on eBay?\n\nI bought a GPS engine on eBay for $25 a few years ago and it was DOA. \nThe eBay seller sent me a new one, no questions asked, no request for \nreturn of the bad one, no cost or shipping charges, no nothing from me. \nI defintely gave him positive feedback!\n\nZack\n\n\nOn Sun, 30 Dec 2007, Robin Searcy Henson wrote:\n\n&gt; Thanks Zak, I understand now.  The seller had an excellent rating so I guess I was just unfortunate.  I&#39;ve never had a problem with Ebay before this incident either.  The repair place said they spent several days trying to clean it to no avail.\n&gt;\n&gt; Robin\n&gt;\n&gt;\n&gt;  ----- Original Message -----\n&gt;  From: Zack Widup&lt;mailto:w9sz@...&gt;\n&gt;  To: EVP-ITC@yahoogroups.com&lt;mailto:EVP-ITC@yahoogroups.com&gt;\n&gt;  Sent: Sunday, December 30, 2007 8:13 AM\n&gt;  Subject: Re: [EVP-ITC] OT ? RE: Broken Cellphone\n&gt;\n&gt;\n&gt;\n&gt;  Sorry to hear about the difficulty, Robin. What was the feedback rating of\n&gt;  the seller? I have never had problems with any eBay seller whose feedback\n&gt;  was 98% positive or better.\n&gt;\n&gt;  Water (except for distilled water) contains mineral salts that are\n&gt;  electrically conductive. When it dries it leaves behind these salts as\n&gt;  residues which are also conductive. You might be able to clean the phone\n&gt;  if you get to it fast enough, but sometimes the conductivity of water puts\n&gt;  voltages on parts where it doesn&#39;t belong and ruins them. I&#39;d guess the\n&gt;  phone is a goner.\n&gt;  :-(\n&gt;\n&gt;  Zack\n&gt;\n&gt;  On Sun, 30 Dec 2007, Robin Henson wrote:\n&gt;\n&gt;  &gt; I apologize up front for this, but it occurred to me some of you\n&gt;  &gt; electronics nuts might be able to give me a definitive answer about a\n&gt;  &gt; bad purchase I made through Ebay a few months ago.\n&gt;  &gt;\n&gt;  &gt; My kid desperately wanted this particular phone for his birthday, so\n&gt;  &gt; I\n&gt;  &gt; bid and &quot;won&quot; it. Described as brand new, box never opened, yada\n&gt;  &gt; yada. It arrived in seemingly perfect condition, and it took about a\n&gt;  &gt; week for us to get it through our pea brains that it wasn&#39;t holding a\n&gt;  &gt; charge. There was a lot going on around the house, and probably\n&gt;  &gt; another\n&gt;  &gt; couple of weeks went by before I decided it just needed a new\n&gt;  &gt; battery.\n&gt;  &gt; So I replaced the battery and got a cute little phone case to boot.\n&gt;  &gt;\n&gt;  &gt; You might guess that the new battery didn&#39;t solve the problem. By\n&gt;  &gt; this\n&gt;  &gt; time I had been in contact with the seller, who seemed genuinely\n&gt;  &gt; sympathetic and suggested I send it back to Cingular/ATT since it was\n&gt;  &gt; still &quot;on warranty&quot; (yeah, right). Instead, I sent it to an online\n&gt;  &gt; cellphone repair company that promised they could repair any kind of\n&gt;  &gt; damage for $29.95. Two weeks later they contacted me and said they\n&gt;  &gt; were very sorry but the phone had suffered irrepairable water damage,\n&gt;  &gt; and they could dispose of it for me and give me a $15. credit towards\n&gt;  &gt; merchandise or send it back. I had them send it back, probably just\n&gt;  &gt; to\n&gt;  &gt; torment myself with the reminder that altogether I wasted close to\n&gt;  &gt; $350.!!! I just kept digging the hole deeper and deeper..\n&gt;  &gt;\n&gt;  &gt; Oh, I did contact Ebay and PayPal, but I had waited too long to file\n&gt;  &gt; a\n&gt;  &gt; formal complaint with either company because I simply couldn&#39;t get it\n&gt;  &gt; through my head that someone would misrepresent what they were\n&gt;  &gt; selling.\n&gt;  &gt;\n&gt;  &gt; So my question is, IS IT TRUE A WATER-LOGGED CELLPHONE CAN&#39;T BE\n&gt;  &gt; FIXED??\n&gt;  &gt;\n&gt;  &gt; Robin\n&gt;  &gt;"}