{"id": "4692", "subject": "RE: [EVP-ITC] we have a hard row to hoe", "author": "joel smith", "timestamp": "2007-12-31T14:25:39Z", "full_text": "--0-879824894-1199111139=:64794\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n well ihave to agree here with Bruce that blog was written from someone tthan&#39;s never seen the box or any box in action first hand . This is someone who has no experience what so ever in any researches  . Has not spent the time nor the effort \nto ask the questions that need to be ask nor look for the answers .he a closed minded individual. who reached his conclusions a\n based on wha he see from the window  of is apt. never venturing out to explore  the possibility that the world has to offer. Anyone  that has veneered in to a realm\nof the questionable  has experienced things that defy   logic.\n\n    If 10 yeas ago you said that the day was coming that i could take a pic with my phone and send that pic to someone halfway around the world in 10 sec  they would told me to have scotty to beam me up. but yet here we are.\n  basically there our two type of people  based on that e out there dose that read and forum a opin. and those that step out there door and explore all possibility.\nAnd many  great  explorers were  outcast in there lifetime only to be  reg ionized \nand ahead of there time later. \n  we need to go along and present what we find and let it stand on it&#39;d own  .and ignore these small minded  arm chair  criteces  .\n\n just my thought on the subject\njoel\n bruce halliday &lt;paranormalinvestigating@...&gt; wrote:                                  Frank,\n  \n This only becomes an issue when new people get interested in our research and seek information from the usual paranormal community and are met with these type of answers and explanations. They quickly become disinterested and whenever anyone may mention box research in the future they convey the same closed minded ignorance that was spewed to them on their initial quest for answers.\n  \n Not to mention that anyone that does any serious research in this medium would I&#39;m sure like to have their efforts recognised as being legitimate in their source and taken seriously with respect. not  dismissed as nonsense or something that is written off as fake or delusional. \n  \n Frank I don&#39;t want to start a long thread with all different people sniping back and forth I posted that snip it of a blog to let everyone know what the general consensus of our research is. And I did not even mention who the blog was actually about but I&#39;m sure we all can guess. It&#39;s that kind of stupidity that stops us from getting new potential researchers involved and adding their positive energy to our own, I have received messages from our friends on the other side that instruct that the more individuals that are involved and think positively about the communication we are striving to achieve, the stronger the communication will get. I view this blog attitude as not a personal attack on what I am particularly doing but just another extremely large hurtle to get over in bringing this amazing form of spirit communication to the forefront of paranormal research.\n  \n Bruce\n\n\n \nBruce Halliday \n\n\n\n\n  \n---------------------------------\n To: EVP-ITC@yahoogroups.com\nFrom: warrior18eii@...\nDate: Mon, 31 Dec 2007 05:18:29 -0800\nSubject: Re: [EVP-ITC] we have a hard row to hoe\n\n       Why would this be an issue? I am not doing this to convince others of the validity of my messages. If someone wants to learn how, I will teach them. If someone has questions I will answer them to the best of my ability. If someone is skeptical it is a distraction from my goals to try and convince them that something is real. Its pointless to try and convince or prove the reality of a practice that is so highly subjective and mostly personal.\n\nRegards,\n\nFrank R.\n\n ----- Original Message ----\nFrom: bhali333 &lt;paranormalinvestigating@...&gt;\nTo: EVP-ITC@yahoogroups.com\nSent: Sunday, December 30, 2007 3:18:44 PM\nSubject: [EVP-ITC] we have a hard row to hoe\n\n  This statement was taken from a blog that was sent to me by steve. He \ncame across it while web surfing.\n\nIt is indicitive of the attitude 90% of the paranormal community has \ntoward box evp research.\n\nI suggest we all memorise it because as box researchers this will be \nour most formitable object.\n\nThe first thought that comes to mind about this whole &#39;box&#39; thing is \nwhat are the chances that spirits would comunicate through such a box. \nI mean there are so many different radio frequencies the chances that \nanything would or would want to use the am or fm bands seems very \nunlikely. \n\nBruce\n\n\n\n\n\n\n\n\n\n \n---------------------------------\n Looking for last minute shopping deals? Find them fast with Yahoo! Search.  \n\n       \n\n\n\n---------------------------------\nGet the power of Windows + Web with the new Windows Live. Get it now! \n     \n                               \n\n       \n---------------------------------\nLooking for last minute shopping deals?  Find them fast with Yahoo! Search.\r\n--0-879824894-1199111139=:64794\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&nbsp;well ihave to agree here with Bruce that blog was written from someone tthan&#39;s never seen the box or any box in action first hand . This is someone who has no experience what so ever in any researches  . Has not spent the time nor the effort &lt;br&gt;to ask the questions that need to be ask nor look for the answers .he a closed minded individual. who reached his conclusions a&lt;br&gt;&nbsp;based on wha he see from the window&nbsp; of is apt. never venturing out to explore&nbsp; the possibility that the world has to offer. Anyone&nbsp; that has veneered in to a realm&lt;br&gt;of the questionable&nbsp; has experienced things that defy&nbsp;  logic.&lt;br&gt;&lt;br&gt;&nbsp;&nbsp;&nbsp; If 10 yeas ago you said that the day was coming that i could take a pic with my phone and send that pic to someone halfway around the world in 10 sec&nbsp; they would told me to have scotty to beam me up. but yet here we are.&lt;br&gt;&nbsp; basically there our two type of people&nbsp; based on that e out there dose that\n read and forum a opin. and those that step out there door and explore all possibility.&lt;br&gt;And many&nbsp; great&nbsp; explorers were&nbsp; outcast in there lifetime only to be&nbsp; reg ionized &lt;br&gt;and ahead of there time later. &lt;br&gt;&nbsp; we need to go along and present what we find and let it stand on it&#39;d own&nbsp; .and ignore these small minded&nbsp; arm chair&nbsp; criteces  .&lt;br&gt;&lt;br&gt;&nbsp;just my thought on the subject&lt;br&gt;joel&lt;br&gt; &lt;b&gt;&lt;i&gt;bruce halliday &lt;paranormalinvestigating@...&gt;&lt;/i&gt;&lt;/b&gt; wrote:&lt;blockquote class=&quot;replbq&quot; style=&quot;border-left: 2px solid rgb(16, 16, 255); margin-left: 5px; padding-left: 5px;&quot;&gt;             &lt;div id=&quot;ygrp-text&quot;&gt;             &lt;div&gt;   Frank,&lt;br&gt; &nbsp;&lt;br&gt; This only becomes an issue when new people get\n interested in our research and seek information from the usual paranormal community and are met with these type of answers and explanations. They quickly become disinterested and whenever anyone may mention box research in the future they convey the same closed minded ignorance that was spewed to them on their initial quest for answers.&lt;br&gt; &nbsp;&lt;br&gt; Not to mention that anyone that does any serious research in this medium would I&#39;m sure like to have their efforts recognised as being legitimate in their source and taken seriously with respect. not&nbsp; dismissed as nonsense or something that is written off as fake or delusional. &lt;br&gt; &nbsp;&lt;br&gt; Frank I don&#39;t want to start a long thread with all different people sniping back and forth I posted that snip it of a blog to let everyone know what the general consensus of our research is. And I did not even mention who the blog was actually about but I&#39;m sure we all can guess. It&#39;s that kind of stupidity that stops us from\n getting new potential researchers involved and adding their positive energy to our own, I have received messages from our friends on the other side that instruct that the more individuals that are involved and think positively about the communication we are striving to achieve, the stronger the communication will get. I view this blog attitude as not a personal attack on what I am particularly doing but just another extremely large hurtle to get over in bringing this amazing form of spirit communication to the forefront of paranormal research.&lt;br&gt; &nbsp;&lt;br&gt; Bruce&lt;br&gt;&lt;br&gt;&lt;br&gt; &lt;/div&gt;&lt;div align=&quot;center&quot;&gt;&lt;font size=&quot;4&quot;&gt;&lt;font color=&quot;#0033cc&quot;&gt;&lt;strong&gt;&lt;em&gt;&lt;font color=&quot;#000000&quot; size=&quot;5&quot;&gt;Bruce Halliday &lt;br&gt;&lt;/font&gt;&lt;/em&gt;&lt;/strong&gt;&lt;br&gt;&lt;a href=&quot;http://free-paranormalinvestigating.com/%3C/div%3E%3C/div%3E%3Cp%20/%3E%3Cdiv%20class=&quot; target=&quot;_blank&quot;&gt;&lt;/a&gt;&lt;/font&gt;&lt;/font&gt;&lt;/div&gt;&lt;br&gt;&lt;br&gt; &lt;blockquote&gt; &lt;hr&gt; To: EVP-ITC@yahoogroups&lt;wbr&gt;.com&lt;br&gt;From: warrior18eii@&lt;wbr&gt;yahoo.com&lt;br&gt;Date: Mon, 31 Dec\n 2007 05:18:29 -0800&lt;br&gt;Subject: Re: [EVP-ITC] we have a hard row to hoe&lt;br&gt;&lt;br&gt;  &lt;div id=&quot;EC_ygrp-mlmsg&quot;&gt; &lt;div id=&quot;EC_ygrp-msg&quot;&gt; &lt;div id=&quot;EC_ygrp-text&quot;&gt;  &lt;div style=&quot;font-size: 12pt; font-family: times new roman,new york,times,serif;&quot;&gt; &lt;div style=&quot;font-size: 12pt; font-family: times new roman,new york,times,serif;&quot;&gt;Why would this be an issue? I am not doing this to convince others of the validity of my messages. If someone wants to learn how, I will teach them. If someone has questions I will answer them to the best of my ability. If someone is skeptical it is a distraction from my goals to try and convince them that something is real. Its pointless to try and convince or prove the reality of a practice that is so highly subjective and mostly personal.&lt;br&gt;&lt;br&gt;Regards,&lt;br&gt;&lt;br&gt;Frank R.&lt;br&gt;&lt;br&gt; &lt;div style=&quot;font-size: 12pt; font-family: times new roman,new york,times,serif;&quot;&gt;----- Original Message ----&lt;br&gt;From: bhali333\n &lt;paranormalinvestiga&lt;wbr&gt;ting@hotmail.&lt;wbr&gt;com&gt;&lt;br&gt;To: EVP-ITC@yahoogroups&lt;wbr&gt;.com&lt;br&gt;Sent: Sunday, December 30, 2007 3:18:44 PM&lt;br&gt;Subject: [EVP-ITC] we have a hard row to hoe&lt;br&gt;&lt;br&gt; &lt;div id=&quot;EC_ygrp-text&quot;&gt; &lt;div&gt;This statement was taken from a blog that was sent to me by steve. He &lt;br&gt;came across it while web surfing.&lt;br&gt;&lt;br&gt;It is indicitive of the attitude 90% of the paranormal community has &lt;br&gt;toward box evp research.&lt;br&gt;&lt;br&gt;I suggest we all memorise it because as box researchers this will be &lt;br&gt;our most formitable object.&lt;br&gt;&lt;br&gt;The first thought that comes to mind about this whole &#39;box&#39; thing is &lt;br&gt;what are the chances that spirits would comunicate through such a box. &lt;br&gt;I mean there are so many different radio frequencies the chances that &lt;br&gt;anything would or would want to use the am or fm bands seems very &lt;br&gt;unlikely. &lt;br&gt;&lt;br&gt;Bruce&lt;br&gt;&lt;br&gt;&lt;br&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;br&gt;&lt;/div&gt;&lt;/div&gt;&lt;br&gt; &lt;hr size=&quot;1&quot;&gt; Looking for last minute shopping deals? &lt;a\n href=&quot;http://us.rd.yahoo.com/evt=51734/*http://tools.search.yahoo.com/newsearch/category.php?category=shopping&quot; target=&quot;_blank&quot;&gt;Find them fast with Yahoo! Search.&lt;/a&gt;  &lt;br&gt;&lt;/div&gt;&lt;span style=&quot;color: white;&quot;&gt;&lt;/span&gt;       &lt;/div&gt;&lt;/div&gt;&lt;/blockquote&gt;&lt;br&gt;&lt;hr&gt;Get the power of Windows + Web with the new Windows Live. &lt;a href=&quot;http://www.windowslive.com?ocid=TXT_TAGHM_Wave2_powerofwindows_122007&quot; target=&quot;_new&quot;&gt;Get it now!&lt;/a&gt; &lt;div&gt;&lt;/div&gt;     &lt;/div&gt;          &lt;!--End group email --&gt;  &lt;/blockquote&gt;&lt;br&gt;&lt;p&gt;&#32;\n      &lt;hr size=1&gt;Looking for last minute shopping deals? &lt;a href=&quot;http://us.rd.yahoo.com/evt=51734/*http://tools.search.yahoo.com/newsearch/category.php?category=shopping&quot;&gt; \nFind them fast with Yahoo! Search.&lt;/a&gt;\r\n--0-879824894-1199111139=:64794--"}