{"id": "4694", "subject": "Re: [EVP-ITC] Frank or any other electronics guru, please help!!", "author": "Debbie Tejada", "timestamp": "2007-12-31T15:15:10Z", "full_text": "Zack,\n\nI&#39;m hoping I can get some help from Frank S since he lives close to  \nme. If that doesn&#39;t work out for some reason, I&#39;d be glad to mail the  \ncamera to you if you (you&#39;re not in New Zealand or something?), pay  \nyou for your work and shipping for return. Would that work?\n\nDeb T.\n\n\n&quot;Once you can accept the universe as matter expanding into nothing  \nthat is something, wearing stripes with plaid comes easy. &quot;  ~Albert  \nEinstein\n\nOn Dec 31, 2007, at 7:49 AM, Zack Widup wrote:\n\n&gt;\n&gt; Hi Debbie,\n&gt;\n&gt; What everyone else has said is correct. OUCH! The pc board is now\n&gt; damaged.\n&gt;\n&gt; I can&#39;t quite tell how bad it is from the photo. It might be  \n&gt; repairable\n&gt; but probably not with the original connector. That would have to be\n&gt; removed and the wires soldered directly to the board. The board itself\n&gt; would have to be repaired also, by someone who has experience in  \n&gt; repairing\n&gt; such things.\n&gt;\n&gt; I could probably do that, as I worked in electronics repair for over  \n&gt; 10\n&gt; years, but I live quite a ways from you.\n&gt;\n&gt; Zack\n&gt;\n&gt; On Mon, 31 Dec 2007, Debbie Tejada wrote:\n&gt;\n&gt; &gt; Okay, one of my DIY projects this weekend has been to convert my\n&gt; &gt; husband&#39;s old Olympus to infrared. We&#39;re not extremely talented in  \n&gt; the\n&gt; &gt; electronics area, but we have fun and seem to muddle by. No guts no\n&gt; &gt; glory, huh?\n&gt; &gt;\n&gt; &gt; Well, for the most part the operation has been a success. I\n&gt; &gt; photographed every step of the way and taped screws and parts to the\n&gt; &gt; photos so we&#39;d know how to rebuild everything we took apart, and  \n&gt; that\n&gt; &gt; has worked just fine. I located the IR filter, removed it and cut  \n&gt; and\n&gt; &gt; replaced it with a piece of glass slide.\n&gt; &gt;\n&gt; &gt; The one problem we ran into is that there were two wires that  \n&gt; appeared\n&gt; &gt; to be clipped in place as opposed to being soldered or screwed in  \n&gt; like\n&gt; &gt; everything else. When we tried to pry the clips open, instead the\n&gt; &gt; whole thing came off the circuit board. WE HAVE NO CLUE HOW TO  \n&gt; PROCEED\n&gt; &gt; FROM HERE. I don&#39;t know if we can just glue the darn things down and\n&gt; &gt; if so, what type of glue to use, or if we&#39;re just plain up the  \n&gt; creek.\n&gt; &gt;\n&gt; &gt; I immediately thought of this group of brainy electronics buffs. I&#39;m\n&gt; &gt; hoping someone out there can give us some advice, or if you live  \n&gt; near\n&gt; &gt; Highlands Ranch, CO, you could help in person & bail us out of  \n&gt; this. I\n&gt; &gt; was hoping to take this camera to the St. Augustine Lighthouse at  \n&gt; the\n&gt; &gt; end of this coming week.\n&gt; &gt;\n&gt; &gt; Is there any hope? I&#39;ve posted a photo of an extreme closeup of the\n&gt; &gt; clips (one is pink, the other is ivory) and the damaged board -- I  \n&gt; had\n&gt; &gt; to sandwich two photos together to get both in focus at the same  \n&gt; time\n&gt; &gt; (that&#39;s why it looks that way). For an idea of scale, the clips are\n&gt; &gt; both the same size, about 4 mm in width, 4 mm tall, 3 mm deep. Not\n&gt; &gt; easy to handle and even harder to see with these middle age eyes.\n&gt; &gt; http://www.tejadadesign.com/camera/splice.jpg\n&gt; &gt;\n&gt; &gt; Any advice would be GREATLY APPRECIATED!! Deb T.\n&gt; &gt;\n&gt;\n&gt; \n\n\nZack,I'm hoping I can ge some help om F ank S since he li es close o me. I ha doesn' wo k ou o some eason, I'd be glad o mail he came a o you i you (you' e no in New Zealand o some hing?), pay you o you wo k and shipping o e u n. Would ha wo k?Deb T.\"Once you can accep he uni e se as ma e expanding in o no hing ha is some hing, wea ing s ipes wi h plaid comes easy. \"  ~Albe Eins ein On Dec 31, 2007, a 7:49 AM, Zack Widup w o e:Hi Debbie,Wha e e yone else has said is co ec . OUCH! The pc boa d is now damaged.I can' qui e ell how bad i is om he pho o. I migh be epai able bu p obably no wi h he o iginal connec o . Tha would ha e o be  emo ed and he wi es solde ed di ec ly o he boa d. The boa d i sel  would ha e o be epai ed also, by someone who has expe ience in epai ing such hings.I could p obably do ha , as I wo ked in elec onics epai o o e 10 yea s, bu I li e qui e a ways om you.ZackOn Mon, 31 Dec 2007, Debbie Tejada w o e:> Okay, one o my DIY p ojec s his weekend has been o con e my> husband's old Olympus o in a ed. We' e no ex emely alen ed in he> elec onics a ea, bu we ha e un and seem o muddle by. No gu s no> glo y, huh?>> Well, o he mos pa he ope a ion has been a success. I> pho og aphed e e y s ep o he way and aped sc ews and pa s o he> pho os so we'd know how o ebuild e e y hing we ook apa , and ha > has wo ked jus ine. I loca ed he IR il e , emo ed i and cu and> eplaced i wi h a piece o glass slide.>> The one p oblem we an in o is ha he e we e wo wi es ha appea ed> o be clipped in place as opposed o being solde ed o sc ewed in like> e e y hing else. When we ied o p y he clips open, ins ead he> whole hing came o he ci cui boa d. WE HAVE NO CLUE HOW TO PROCEED> FROM HERE. I don' know i we can jus glue he da n hings down and> i so, wha ype o glue o use, o i we' e jus plain up he c eek.>> I immedia ely hough o his g oup o b ainy elec onics bu s. I'm> hoping someone ou he e can gi e us some ad ice, o i you li e nea > Highlands Ranch, CO, you could help in pe son & bail us ou o his. I> was hoping o ake his came a o he S . Augus ine Ligh house a he> end o his coming week.>> Is he e any hope? I' e pos ed a pho o o an ex eme closeup o he> clips (one is pink, he o he is i o y) and he damaged boa d -- I had> o sandwich wo pho os oge he o ge bo h in ocus a he same ime> ( ha 's why i looks ha way). Fo an idea o scale, he clips a e> bo h he same size, abou 4 mm in wid h, 4 mm all, 3 mm deep. No > easy o handle and e en ha de o see wi h hese middle age eyes.> h p://www. ejadadesign.com/came a/splice.jpg>> Any ad ice would be GREATLY APPRECIATED!! Deb T.>"}