{"id": "4696", "subject": "Re: we have a hard row to hoe", "author": "LC Duplatt", "timestamp": "2007-12-31T16:03:05Z", "full_text": "This is my two cents regarding the box and the &quot;spread&quot; of it.\n\nI would think the goal would be to get people experimenting with it \nas much as possible.  There are always going to be people who shoot \nit down, attack, etc., but you will find others who experiment with \nit, or embrace it, as well.  Nothing that is new (or old) will ever \nbe exempt from the attack of others, unless of course one keeps it \nhidden in a closet.\n\nWith this type of ITC, it is ground-breaking IMHO, as the box is \nproviding an avenue to &quot;open up the minds&quot; of those whose time has \ncome to &quot;hear.&quot;  In other words, I suspect that only a given amount \nof people will be open to it; and that will be their time to explore \nthe boxes and make contact with spirit.  That is the goal I would \nthink: more belief by the populus and especially connection to the \nunseen, whatever that may be.\n\nI just received a nasty e-mail from a TAPS lover attacking Angels & \nGhosts because I have written some articles with respect to their \nshoddy review of the Shadow Man pic at Moundsville (I am not dogging \nTAPS here).  I simply felt what was done by the TV show to the lady \nwho took the image was wrong.  I also was attacked as to some of the \nEVPs on Angels & Ghosts as being &quot;faked.&quot;  We receive submissions \nfrom all over the world and post those that are of interest (photos, \nvideos, evp, stories, etc).  The only goal of the site is to post \nthat which might cause others to consider the existence of spirit - \nthe existence of more beyond the physical realm. Of course, we don&#39;t \ntry to post that which we know was faked.  Again pointing others to \nconnect spiritually is the idea. \n\nIs that not what the boxes will be first used for?  I could see many \npeople split on this, but the idea of turning more toward the \nspiritual (whatever your definition of that is), would be a basic \ngoal.  From there, everyone must have their own personal experience \nto become a believer, no matter how good the evidence posted from \nanyone experimenting with ITC.\n\nLC\nhttp://www.AngelsGhosts.com\n\n\n--- In EVP-ITC@yahoogroups.com, joel smith &lt;sparky1j41@...&gt; wrote:\n&gt;\n&gt;  well ihave to agree here with Bruce that blog was written from \nsomeone tthan&#39;s never seen the box or any box in action first hand . \nThis is someone who has no experience what so ever in any \nresearches  . Has not spent the time nor the effort \n&gt; to ask the questions that need to be ask nor look for the \nanswers .he a closed minded individual. who reached his conclusions a\n&gt;  based on wha he see from the window  of is apt. never venturing \nout to explore  the possibility that the world has to offer. Anyone  \nthat has veneered in to a realm\n&gt; of the questionable  has experienced things that defy   logic.\n&gt; \n&gt;     If 10 yeas ago you said that the day was coming that i could \ntake a pic with my phone and send that pic to someone halfway around \nthe world in 10 sec  they would told me to have scotty to beam me up. \nbut yet here we are.\n&gt;   basically there our two type of people  based on that e out there \ndose that read and forum a opin. and those that step out there door \nand explore all possibility.\n&gt; And many  great  explorers were  outcast in there lifetime only to \nbe  reg ionized \n&gt; and ahead of there time later. \n&gt;   we need to go along and present what we find and let it stand on \nit&#39;d own  .and ignore these small minded  arm chair  criteces  .\n&gt; \n&gt;  just my thought on the subject\n&gt; joel\n&gt;  bruce halliday &lt;paranormalinvestigating@...&gt; \nwrote:                                  Frank,\n&gt;   \n&gt;  This only becomes an issue when new people get interested in our \nresearch and seek information from the usual paranormal community and \nare met with these type of answers and explanations. They quickly \nbecome disinterested and whenever anyone may mention box research in \nthe future they convey the same closed minded ignorance that was \nspewed to them on their initial quest for answers.\n&gt;   \n&gt;  Not to mention that anyone that does any serious research in this \nmedium would I&#39;m sure like to have their efforts recognised as being \nlegitimate in their source and taken seriously with respect. not  \ndismissed as nonsense or something that is written off as fake or \ndelusional. \n&gt;   \n&gt;  Frank I don&#39;t want to start a long thread with all different \npeople sniping back and forth I posted that snip it of a blog to let \neveryone know what the general consensus of our research is. And I \ndid not even mention who the blog was actually about but I&#39;m sure we \nall can guess. It&#39;s that kind of stupidity that stops us from getting \nnew potential researchers involved and adding their positive energy \nto our own, I have received messages from our friends on the other \nside that instruct that the more individuals that are involved and \nthink positively about the communication we are striving to achieve, \nthe stronger the communication will get. I view this blog attitude as \nnot a personal attack on what I am particularly doing but just \nanother extremely large hurtle to get over in bringing this amazing \nform of spirit communication to the forefront of paranormal research.\n&gt;   \n&gt;  Bruce\n&gt; \n&gt; \n&gt;  \n&gt; Bruce Halliday \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;   \n&gt; ---------------------------------\n&gt;  To: EVP-ITC@yahoogroups.com\n&gt; From: warrior18eii@...\n&gt; Date: Mon, 31 Dec 2007 05:18:29 -0800\n&gt; Subject: Re: [EVP-ITC] we have a hard row to hoe\n&gt; \n&gt;        Why would this be an issue? I am not doing this to convince \nothers of the validity of my messages. If someone wants to learn how, \nI will teach them. If someone has questions I will answer them to the \nbest of my ability. If someone is skeptical it is a distraction from \nmy goals to try and convince them that something is real. Its \npointless to try and convince or prove the reality of a practice that \nis so highly subjective and mostly personal.\n&gt; \n&gt; Regards,\n&gt; \n&gt; Frank R.\n&gt; \n&gt;  ----- Original Message ----\n&gt; From: bhali333 &lt;paranormalinvestigating@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Sunday, December 30, 2007 3:18:44 PM\n&gt; Subject: [EVP-ITC] we have a hard row to hoe\n&gt; \n&gt;   This statement was taken from a blog that was sent to me by \nsteve. He \n&gt; came across it while web surfing.\n&gt; \n&gt; It is indicitive of the attitude 90% of the paranormal community \nhas \n&gt; toward box evp research.\n&gt; \n&gt; I suggest we all memorise it because as box researchers this will \nbe \n&gt; our most formitable object.\n&gt; \n&gt; The first thought that comes to mind about this whole &#39;box&#39; thing \nis \n&gt; what are the chances that spirits would comunicate through such a \nbox. \n&gt; I mean there are so many different radio frequencies the chances \nthat \n&gt; anything would or would want to use the am or fm bands seems very \n&gt; unlikely. \n&gt; \n&gt; Bruce\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;  \n&gt; ---------------------------------\n&gt;  Looking for last minute shopping deals? Find them fast with Yahoo! \nSearch.  \n&gt; \n&gt;        \n&gt; \n&gt; \n&gt; \n&gt; ---------------------------------\n&gt; Get the power of Windows + Web with the new Windows Live. Get it \nnow! \n&gt;      \n&gt;                                \n&gt; \n&gt;        \n&gt; ---------------------------------\n&gt; Looking for last minute shopping deals?  Find them fast with Yahoo! \nSearch.\n&gt;"}