{"id": "4697", "subject": "Re: we have a hard row to hoe", "author": "Debbie Tejada", "timestamp": "2007-12-31T16:05:48Z", "full_text": "--- In EVP-ITC@yahoogroups.com, Frank Ratka &lt;warrior18eii@...&gt; wrote:\n&gt;\n&quot;I agree most people in the paranormal community (The Ghost Hunter\ngeneration) do not have the understanding to grasp what we as a group\nare saying.&quot;\n\nI find this whole debate interesting, never thought of it in this\ncontext before. I&#39;ve been interested in the paranormal most of my life\nand have wondered why, since I&#39;ve had many people give me strange\nlooks and questions about my interests that other people who are into\nstamp collecting, knitting or bird watching never get. Maybe its\nbecause of some experiences I had as a child, or maybe its just part\nof my personality. Regardless, that&#39;s who I am and I&#39;ve stopped\nquestioning myself or feeling a need to explain to others. I feel like\nthere&#39;s a legitimate purpose for my interest, just haven&#39;t found out\nexactly what it is yet.\n\nFor me, going on paranormal investigations on location means trying to\ndetermine of a place is &quot;haunted,&quot; what type of haunting it is and if\nthere is any action required. This is determined by use of certain\ntools, one of which is EVP. Haunted to me means either residual energy\nor an &quot;earth bound&quot; spirit who is not leaving a location for some\nreason. Yes, I&#39;ve heard of non-humans or demonics, but my jury is\nstill out on those.\n\nThen we come to the EVP-ITC side of me, which in ways I consider\ntotally separate from paranormal investigation. My interpretations of\nwhat is happening with this comes from The Scole Experiments book,\nwhich I read a couple of years ago. I have no idea how I found out\nabout the book, but I did have to order it from the UK because at the\ntime it was not available in the US. Although I&#39;m skeptical in nature\nand tend to take things with a salt lick until I can research\nsomething to my satisfaction, the Scole book was full of ideas and\nconcepts that I found exciting. To say it was food for thought is an\nunderstatement. To think that there are people on the &quot;other side&quot;\nwanting to communicate with us mortals makes the efforts we go through\neven that much more meaningful and satisfying.\n\nMy next project will be building my own box, although right now I\npersonally tend to trust EVPs gathered with a recorder more. My\nexposure to the Box has been thru Chris M&#39;s interpretations and I\ncan&#39;t say I&#39;ve spent enough time with the Box to actually hear or\nunderstand anything from it. Maybe if I make my own I can educate my\nhearing.\n\nIt appears the person who wrote the blog that started this thread has\nnot researched the concept behind the Box or current theories of the\nrange of the em spectrum and the relationship of spirit energy vs. our\nlimited abilities as humans to sense or perceive different ranges of\nthe spectrum. I&#39;m not educated in this part of science, most of what\nI&#39;ve learned has been over the last couple of years via the Internet,\nso I may sound like an idiot. But I feel that even what we have\nidentified in the em spectrum is limited to our equipment&#39;s abilities.\n\nSorry for the soap box, but it felt good to write down what&#39;s been in\nmy head. There aren&#39;t many people I know that are interested in this\nstuff so this Forum has been a real treat for me.\n\nBy the way, can I get a link to that blog? I&#39;d be interested in\nreading a little more of it. As others here have said, the person who\nwrote it has not done his research and may not care to. No skin off my\nnose, truth always wins out in the end, its just a matter of time. How\nlong did people believe that the world is flat?"}