{"id": "4700", "subject": "Re: [EVP-ITC] Frank or any other electronics guru, please help!!", "author": "Zack Widup", "timestamp": "2007-12-31T16:49:17Z", "full_text": "Hi Debbie,\n\nYes, that should work.\n\nI&#39;m in Urbana, Illinois.\n\nZack\n\nOn Mon, 31 Dec 2007, Debbie Tejada wrote:\n\n&gt; Zack,\n&gt;\n&gt; I&#39;m hoping I can get some help from Frank S since he lives close to me. If \n&gt; that doesn&#39;t work out for some reason, I&#39;d be glad to mail the camera to you \n&gt; if you (you&#39;re not in New Zealand or something?), pay you for your work and \n&gt; shipping for return. Would that work?\n&gt;\n&gt; Deb T.\n&gt;\n&gt;\n&gt; &quot;Once you can accept the universe as matter expanding into nothing that is \n&gt; something, wearing stripes with plaid comes easy. &quot;  ~Albert Einstein\n&gt;\n&gt; On Dec 31, 2007, at 7:49 AM, Zack Widup wrote:\n&gt;\n&gt;&gt; \n&gt;&gt; Hi Debbie,\n&gt;&gt; \n&gt;&gt; What everyone else has said is correct. OUCH! The pc board is now\n&gt;&gt; damaged.\n&gt;&gt; \n&gt;&gt; I can&#39;t quite tell how bad it is from the photo. It might be repairable\n&gt;&gt; but probably not with the original connector. That would have to be\n&gt;&gt; removed and the wires soldered directly to the board. The board itself\n&gt;&gt; would have to be repaired also, by someone who has experience in repairing\n&gt;&gt; such things.\n&gt;&gt; \n&gt;&gt; I could probably do that, as I worked in electronics repair for over 10\n&gt;&gt; years, but I live quite a ways from you.\n&gt;&gt; \n&gt;&gt; Zack\n&gt;&gt; \n&gt;&gt; On Mon, 31 Dec 2007, Debbie Tejada wrote:\n&gt;&gt; \n&gt;&gt;&gt; Okay, one of my DIY projects this weekend has been to convert my\n&gt;&gt;&gt; husband&#39;s old Olympus to infrared. We&#39;re not extremely talented in the\n&gt;&gt;&gt; electronics area, but we have fun and seem to muddle by. No guts no\n&gt;&gt;&gt; glory, huh?\n&gt;&gt;&gt; \n&gt;&gt;&gt; Well, for the most part the operation has been a success. I\n&gt;&gt;&gt; photographed every step of the way and taped screws and parts to the\n&gt;&gt;&gt; photos so we&#39;d know how to rebuild everything we took apart, and that\n&gt;&gt;&gt; has worked just fine. I located the IR filter, removed it and cut and\n&gt;&gt;&gt; replaced it with a piece of glass slide.\n&gt;&gt;&gt; \n&gt;&gt;&gt; The one problem we ran into is that there were two wires that appeared\n&gt;&gt;&gt; to be clipped in place as opposed to being soldered or screwed in like\n&gt;&gt;&gt; everything else. When we tried to pry the clips open, instead the\n&gt;&gt;&gt; whole thing came off the circuit board. WE HAVE NO CLUE HOW TO PROCEED\n&gt;&gt;&gt; FROM HERE. I don&#39;t know if we can just glue the darn things down and\n&gt;&gt;&gt; if so, what type of glue to use, or if we&#39;re just plain up the creek.\n&gt;&gt;&gt; \n&gt;&gt;&gt; I immediately thought of this group of brainy electronics buffs. I&#39;m\n&gt;&gt;&gt; hoping someone out there can give us some advice, or if you live near\n&gt;&gt;&gt; Highlands Ranch, CO, you could help in person & bail us out of this. I\n&gt;&gt;&gt; was hoping to take this camera to the St. Augustine Lighthouse at the\n&gt;&gt;&gt; end of this coming week.\n&gt;&gt;&gt; \n&gt;&gt;&gt; Is there any hope? I&#39;ve posted a photo of an extreme closeup of the\n&gt;&gt;&gt; clips (one is pink, the other is ivory) and the damaged board -- I had\n&gt;&gt;&gt; to sandwich two photos together to get both in focus at the same time\n&gt;&gt;&gt; (that&#39;s why it looks that way). For an idea of scale, the clips are\n&gt;&gt;&gt; both the same size, about 4 mm in width, 4 mm tall, 3 mm deep. Not\n&gt;&gt;&gt; easy to handle and even harder to see with these middle age eyes.\n&gt;&gt;&gt; http://www.tejadadesign.com/camera/splice.jpg\n&gt;&gt;&gt; \n&gt;&gt;&gt; Any advice would be GREATLY APPRECIATED!! Deb T.\n&gt;&gt;&gt; \n&gt;&gt; \n&gt;&gt; \n&gt;"}