{"id": "4701", "subject": "Re: [EVP-ITC] Chris Moon/Frank&#39;s Box on YouTube", "author": "Lisby", "timestamp": "2007-12-31T16:54:44Z", "full_text": "Robin-- I have watched this clip and it is the least convincing of  \nall the ones I have seen of him with the box. I have heard several  \nwhere some of the audio is clear enough to stand on its own without  \nhis interpretation, and where his interpretation generally agrees. I  \nhave also heard some where the audio I hear disagrees with his  \ninterpretation, but not to such a high degree that I was overtly  \ntroubled by it--it was in what I would call the high-end of my  \ntolerance range for subjectivity.  I have heard audio where the  \nperson asking questions of the box clearly heard answered that  \nappeared to move them greatly without dependance on Chris&#39;s  \ninterpretation.\n\nSo, to try to sum up for you, my personal investigation led me to  \nbelieve that something was happening with the box. I did not always  \nagree with Chris&#39;s interpretation, but it appeared the same or close  \nto what I heard a high enough percentage of the time that I was  \nwilling to accept he was not faking it, but giving it an honest  \nenough go. It led me to start hounding Frank for a box of my own, and  \nlater to buy a minibox from Rick, since poor Frank was beset on all  \nsides. ;)\n\nWe&#39;ve already had some spectacularly burning arguments about what  \nChris claims his guides or technicians tell him behind closed doors.  \nAs far as I know, no audio of this is public, so his claims can&#39;t be  \nevaluated. I think the proliferation of people getting results with  \nthe boxes belies his assertion that only 30 are chosen.\n\nAnn\n\n\nOn Dec 30, 2007, at 11:09 PM, Robin Henson wrote:\n\n&gt; I think some of you were discussing this recently, but I&#39;m wondering\n&gt; what you all think. I&#39;ve watched/listened to this video a number of\n&gt; times and can&#39;t figure out if the participants are actually hearing\n&gt; responses on their own or are totally relying on Chris to interpret  \n&gt; for\n&gt; them what is being said. I&#39;m disappointed because I honestly can&#39;t\n&gt; hear the words he&#39;s repeating as being from spirit.\n&gt;\n&gt;\n&gt; http://www.youtube.com/watch?v=T-wQZ7FU2Vc\n&gt;\n&gt; Robin\n&gt;\n&gt;\n&gt; \n\n\nRobin-- I ha e wa ched his clip and i is he leas con incing o all he ones I ha e seen o him wi h he box. I ha e hea d se e al whe e some o he audio is clea enough o s and on i s own wi hou his in e p e a ion, and whe e his in e p e a ion gene ally ag ees. I ha e also hea d some whe e he audio I hea disag ees wi h his in e p e a ion, bu no o such a high deg ee ha I was o e ly oubled by i --i was in wha I would call he high-end o my ole ance ange o subjec i i y.  I ha e hea d audio whe e he pe son asking ques ions o he box clea ly hea d answe ed ha appea ed o mo e hem g ea ly wi hou dependance on Ch is's in e p e a ion.So, o y o sum up o you, my pe sonal in es iga ion led me o belie e ha some hing was happening wi h he box. I did no always ag ee wi h Ch is's in e p e a ion, bu i appea ed he same o close o wha I hea d a high enough pe cen age o he ime ha I was willing o accep he was no aking i , bu gi ing i an hones enough go. I led me o s a hounding F ank o a box o my own, and la e o buy a minibox om Rick, since poo F ank was bese on all sides. ;)We' e al eady had some spec acula ly bu ning a gumen s abou wha Ch is claims his guides o echnicians ell him behind closed doo s. As a as I know, no audio o his is public, so his claims can' be e alua ed. I hink he p oli e a ion o people ge ing esul s wi h he boxes belies his asse ion ha only 30 a e chosen.AnnOn Dec 30, 2007, a 11:09 PM, Robin Henson w o e:I hink some o you we e discussing his ecen ly, bu I'm wonde ing wha you all hink. I' e wa ched/lis ened o his ideo a numbe o   imes and can' igu e ou i he pa icipan s a e ac ually hea ing  esponses on hei own o a e o ally elying on Ch is o in e p e o   hem wha is being said. I'm disappoin ed because I hones ly can'  hea he wo ds he's epea ing as being om spi i .h p://www.you ube.com/wa ch? =T-wQZ7FU2VcRobin"}