{"id": "4703", "subject": "Re: Chris Moon/Frank&#39;s Box on YouTube", "author": "immortallic2", "timestamp": "2007-12-31T18:20:52Z", "full_text": "I personally have seen Chris use his box in public forum four times.  \nI have heard the box give audible yes and no type answers to peoples \nquestions.  I do feel though that the ones that get emotionally moved \nthe most are the ones wanting with all their heart to hear from a \nloved one.  When these people get an answer that may or may not be \nheard by all, they feel that it is indeed from a loved one and it \nhits them in the heart as if it was real.  I would love to hear a \nrecorded session from start to finish as an investigator.  After all \nthis research is for all not just &quot;30&quot;....  :-)\n\n--- In EVP-ITC@yahoogroups.com, Lisby &lt;lisby@...&gt; wrote:\n&gt;\n&gt; Robin-- I have watched this clip and it is the least convincing of  \n&gt; all the ones I have seen of him with the box. I have heard several  \n&gt; where some of the audio is clear enough to stand on its own \nwithout  \n&gt; his interpretation, and where his interpretation generally agrees. \nI  \n&gt; have also heard some where the audio I hear disagrees with his  \n&gt; interpretation, but not to such a high degree that I was overtly  \n&gt; troubled by it--it was in what I would call the high-end of my  \n&gt; tolerance range for subjectivity.  I have heard audio where the  \n&gt; person asking questions of the box clearly heard answered that  \n&gt; appeared to move them greatly without dependance on Chris&#39;s  \n&gt; interpretation.\n&gt; \n&gt; So, to try to sum up for you, my personal investigation led me to  \n&gt; believe that something was happening with the box. I did not \nalways  \n&gt; agree with Chris&#39;s interpretation, but it appeared the same or \nclose  \n&gt; to what I heard a high enough percentage of the time that I was  \n&gt; willing to accept he was not faking it, but giving it an honest  \n&gt; enough go. It led me to start hounding Frank for a box of my own, \nand  \n&gt; later to buy a minibox from Rick, since poor Frank was beset on \nall  \n&gt; sides. ;)\n&gt; \n&gt; We&#39;ve already had some spectacularly burning arguments about what  \n&gt; Chris claims his guides or technicians tell him behind closed \ndoors.  \n&gt; As far as I know, no audio of this is public, so his claims can&#39;t \nbe  \n&gt; evaluated. I think the proliferation of people getting results \nwith  \n&gt; the boxes belies his assertion that only 30 are chosen.\n&gt; \n&gt; Ann\n&gt; \n&gt; \n&gt; On Dec 30, 2007, at 11:09 PM, Robin Henson wrote:\n&gt; \n&gt; &gt; I think some of you were discussing this recently, but I&#39;m \nwondering\n&gt; &gt; what you all think. I&#39;ve watched/listened to this video a number \nof\n&gt; &gt; times and can&#39;t figure out if the participants are actually \nhearing\n&gt; &gt; responses on their own or are totally relying on Chris to \ninterpret  \n&gt; &gt; for\n&gt; &gt; them what is being said. I&#39;m disappointed because I honestly can&#39;t\n&gt; &gt; hear the words he&#39;s repeating as being from spirit.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; http://www.youtube.com/watch?v=T-wQZ7FU2Vc\n&gt; &gt;\n&gt; &gt; Robin\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt;"}