{"id": "4711", "subject": "Re: [EVP-ITC] Re: Chris Moon/Frank&#39;s Box on YouTube", "author": "Lisby", "timestamp": "2007-12-31T23:53:00Z", "full_text": "That  sounds quite ominous, Zack. Not sure I like the sound of it.  \nWhat is your theory?\n\nAnn\n\nOn Dec 31, 2007, at 2:21 PM, Zack Widup wrote:\n\n&gt;\n&gt; We actually don&#39;t know who we&#39;re communicating with using the boxes. I\n&gt; suspect it isn&#39;t what we traditionally call a &quot;ghost&quot;.\n&gt;\n&gt; I also suspect that people are not hearing their loved ones. The loved\n&gt; oneshave probably been elsewhere for some time ...\n&gt;\n&gt; Zack\n&gt;\n&gt; On Mon, 31 Dec 2007, immortallic2 wrote:\n&gt;\n&gt; &gt; I personally have seen Chris use his box in public forum four times.\n&gt; &gt; I have heard the box give audible yes and no type answers to peoples\n&gt; &gt; questions. I do feel though that the ones that get emotionally moved\n&gt; &gt; the most are the ones wanting with all their heart to hear from a\n&gt; &gt; loved one. When these people get an answer that may or may not be\n&gt; &gt; heard by all, they feel that it is indeed from a loved one and it\n&gt; &gt; hits them in the heart as if it was real. I would love to hear a\n&gt; &gt; recorded session from start to finish as an investigator. After all\n&gt; &gt; this research is for all not just &quot;30&quot;.... :-)\n&gt; &gt;\n&gt;\n&gt; \n\n\nTha  sounds qui e ominous, Zack. No su e I like he sound o i . Wha is you heo y?AnnOn Dec 31, 2007, a 2:21 PM, Zack Widup w o e:We ac ually don' know who we' e communica ing wi h using he boxes. I suspec i isn' wha we adi ionally call a \"ghos \".I also suspec ha people a e no hea ing hei lo ed ones. The lo ed onesha e p obably been elsewhe e o some ime ...ZackOn Mon, 31 Dec 2007, immo allic2 w o e:> I pe sonally ha e seen Ch is use his box in public o um ou imes.> I ha e hea d he box gi e audible yes and no ype answe s o peoples> ques ions. I do eel hough ha he ones ha ge emo ionally mo ed> he mos a e he ones wan ing wi h all hei hea o hea om a> lo ed one. When hese people ge an answe ha may o may no be> hea d by all, hey eel ha i is indeed om a lo ed one and i > hi s hem in he hea as i i was eal. I would lo e o hea a> eco ded session om s a o inish as an in es iga o . A e all> his esea ch is o all no jus \"30\".... :-)>"}