{"id": "4717", "subject": "Re: Frank or any other electronics guru, please help!!", "author": "Frank Sumption", "timestamp": "2008-01-01T02:37:56Z", "full_text": "It&#39;s farily straight forward to repair, you can tell what conductor \ngoes to what conductor on the board. It&#39;s just a matter of making \nlittle jumpers with small wire to bridge the breaks. Radio shack has \n#30 wire wrap wire that works well for that kind of stuff. Maybe \nthere&#39;s enough of the original pad left on the connectors that you \ncould glue them back in place, then jumper the breaks. I could look \nat it tomorrow, as well. \n\n Frank-S\n\n--- In EVP-ITC@yahoogroups.com, Debbie Tejada &lt;debbie@...&gt; wrote:\n&gt;\n&gt; Hi Frank,\n&gt; \n&gt; I&#39;d heard you were in Littleton -- is there any chance you could \ntake  \n&gt; a look at this in person and tell me how to fix it? I had a feeling \nit  \n&gt; was going to be a serious problem, but since its messed up already \nI  \n&gt; guess I have nothing to lose. I could bring it by your place or we  \n&gt; could meet some where convenient to you if you have a few minutes. \nI  \n&gt; have a pointy tipped soldering iron that&#39;s made for smaller \nelectronic  \n&gt; stuff and have a background in botanic illustration so I&#39;m used to  \n&gt; working on details. If I could get some guidance from you I&#39;m \nwilling  \n&gt; to try myself.\n&gt; \n&gt; What do you think?\n&gt; _ _ _ _ _ _ _ _\n&gt; \n&gt; Debbie Tejada\n&gt; Tejada Design\n&gt; 4778 Adelaide Place\n&gt; Highlands Ranch CO 80130\n&gt; 303-346-1525 ph\n&gt; 303-346-1800 fax\n&gt; \n&gt; http://www.tejadadesign.com\n&gt; http://www.tejadaphoto.com\n&gt; \n&gt; &quot;Once you can accept the universe as matter expanding into nothing  \n&gt; that is something, wearing stripes with plaid comes easy. &quot;  \n~Albert  \n&gt; Einstein\n&gt; \n&gt; \n&gt; \n&gt; On Dec 30, 2007, at 11:59 PM, Frank Sumption wrote:\n&gt; \n&gt; &gt; Ouch! That redish colored torn stuff is a circuit trace torn off \nthe\n&gt; &gt; board, it&#39;s green colored on top, and copper colored on the\n&gt; &gt; underside.\n&gt; &gt;\n&gt; &gt; Those are surface mount connectors, and wires would have to be\n&gt; &gt; soldered on the connector tabs, then spliced onto the board. I \ndon&#39;t\n&gt; &gt; know if I can solder anything that small with the iron I have.\n&gt; &gt;\n&gt; &gt; I hate advertise it, but I&#39;m in Littleton.\n&gt; &gt;\n&gt; &gt; Frank-S\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;Debbie Tejada&quot; &lt;debbie@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; Okay, one of my DIY projects this weekend has been to convert my\n&gt; &gt; &gt; husband&#39;s old Olympus to infrared. We&#39;re not extremely talented \nin\n&gt; &gt; the\n&gt; &gt; &gt; electronics area, but we have fun and seem to muddle by. No \nguts no\n&gt; &gt; &gt; glory, huh?\n&gt; &gt; &gt;\n&gt; &gt; &gt; Well, for the most part the operation has been a success. I\n&gt; &gt; &gt; photographed every step of the way and taped screws and parts \nto the\n&gt; &gt; &gt; photos so we&#39;d know how to rebuild everything we took apart, and\n&gt; &gt; that\n&gt; &gt; &gt; has worked just fine. I located the IR filter, removed it and \ncut\n&gt; &gt; and\n&gt; &gt; &gt; replaced it with a piece of glass slide.\n&gt; &gt; &gt;\n&gt; &gt; &gt; The one problem we ran into is that there were two wires that\n&gt; &gt; appeared\n&gt; &gt; &gt; to be clipped in place as opposed to being soldered or screwed \nin\n&gt; &gt; like\n&gt; &gt; &gt; everything else. When we tried to pry the clips open, instead \nthe\n&gt; &gt; &gt; whole thing came off the circuit board. WE HAVE NO CLUE HOW TO\n&gt; &gt; PROCEED\n&gt; &gt; &gt; FROM HERE. I don&#39;t know if we can just glue the darn things \ndown and\n&gt; &gt; &gt; if so, what type of glue to use, or if we&#39;re just plain up the\n&gt; &gt; creek.\n&gt; &gt; &gt;\n&gt; &gt; &gt; I immediately thought of this group of brainy electronics \nbuffs. I&#39;m\n&gt; &gt; &gt; hoping someone out there can give us some advice, or if you live\n&gt; &gt; near\n&gt; &gt; &gt; Highlands Ranch, CO, you could help in person & bail us out of\n&gt; &gt; this. I\n&gt; &gt; &gt; was hoping to take this camera to the St. Augustine Lighthouse \nat\n&gt; &gt; the\n&gt; &gt; &gt; end of this coming week.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Is there any hope? I&#39;ve posted a photo of an extreme closeup of \nthe\n&gt; &gt; &gt; clips (one is pink, the other is ivory) and the damaged board --\n I\n&gt; &gt; had\n&gt; &gt; &gt; to sandwich two photos together to get both in focus at the same\n&gt; &gt; time\n&gt; &gt; &gt; (that&#39;s why it looks that way). For an idea of scale, the clips \nare\n&gt; &gt; &gt; both the same size, about 4 mm in width, 4 mm tall, 3 mm deep. \nNot\n&gt; &gt; &gt; easy to handle and even harder to see with these middle age \neyes.\n&gt; &gt; &gt; http://www.tejadadesign.com/camera/splice.jpg\n&gt; &gt; &gt;\n&gt; &gt; &gt; Any advice would be GREATLY APPRECIATED!! Deb T.\n&gt; &gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt;"}