{"id": "4729", "subject": "Re: [EVP-ITC] Re: Chris Moon/Frank&#39;s Box on YouTube", "author": "Lisby", "timestamp": "2008-01-01T04:23:50Z", "full_text": "Let&#39;s not let our heads get too swollen, tho, Jason. ;)\n\nAnn\n\n\nOn Dec 31, 2007, at 10:09 PM, Jason Lewis wrote:\n\n&gt;\n&gt; Frank,\n&gt; To someone that we all look up to as an insperation I can say that  \n&gt; you can make the best box ever and the results might just depend on  \n&gt; the person or user of the product...\n&gt; Keep working in this direction, keep being a good person.  Remember  \n&gt; one thing, we are the light in the darkness!  There will always be  \n&gt; people that will try to rain on OUR parade.  We have to be the  \n&gt; voice of reason so WE can move forward.  This is not about us!  Its  \n&gt; about TRUTH and the light and research.  Thanks for everything you  \n&gt; have done and continue to do!!\n&gt; I think personally that these devices work best when the user is  \n&gt; not using the device for personal gain, but for everyones best  \n&gt; intrests!!\n&gt;\n&gt; Happy New Year!\n&gt;\n&gt; Frank Sumption &lt;franks-boxes@...&gt; wrote:\n&gt; I don&#39;t know if maybe the audio pick up from the box wasn&#39;t very good,\n&gt; but I can&#39;t make out much of that either. It sounds like the  \n&gt; recordings\n&gt; I do with a cell phone. I think you&#39;d have to be there to judge it.\n&gt;\n&gt; Personally I&#39;m always disappointed at my stuff being out there, and\n&gt; the incredible lack of clarity obatained with it, to me that&#39;s a huge\n&gt; failure! I know the stuff works, but how to get it to a level that can\n&gt; be understood by most, that&#39;s the problem, and my focus at the moment.\n&gt; The Mini Box is big step in that direction, so some of the pressure if\n&gt; off, but I still need to get my boxes to professional level.\n&gt;\n&gt; Frank-S\n&gt;\n&gt;\n&gt;\n&gt; Be a better friend, newshound, and know-it-all with Yahoo! Mobile.  \n&gt; Try it now.\n&gt;\n&gt; \n\n\nLe 's no le ou heads ge oo swollen, ho, Jason. ;)AnnOn Dec 31, 2007, a 10:09 PM, Jason Lewis w o e:F ank,To someone ha we all look up o as an inspe a ion I can say ha you can make he bes box e e and he esul s migh jus depend on he pe son o use o he p oduc ...Keep wo king in his di ec ion, keep being a good pe son.  Remembe one hing, we a e he ligh in he da kness!  The e will always be people ha will y o ain on OUR pa ade.  We ha e o be he oice o eason so WE can mo e o wa d.  This is no abou us!  I s abou TRUTH and he ligh and esea ch.  Thanks o e e y hing you ha e done and con inue o do!!I hink pe sonally ha hese de ices wo k bes when he use is no using he de ice o pe sonal gain, bu o e e yones bes in es s!! Happy New Yea !F ank Sump ion ho mail.com> w o e:I don' know i maybe he audio pick up om he box wasn' e y good, bu I can' make ou much o ha ei he . I sounds like he eco dings I do wi h a cell phone. I hink you'd ha e o be he e o judge i . Pe sonally I'm always disappoin ed a my s u being ou he e, and  he inc edible lack o cla i y oba ained wi h i , o me ha 's a huge  ailu e! I know he s u wo ks, bu how o ge i o a le el ha can be unde s ood by mos , ha 's he p oblem, and my ocus a he momen . The Mini Box is big s ep in ha di ec ion, so some o he p essu e i  o , bu I s ill need o ge my boxes o p o essional le el. F ank-SBe a be e iend, newshound, and know-i -all wi h Yahoo! Mobile. T y i now."}