{"id": "4733", "subject": "Frank ~", "author": "Debbie Tejada", "timestamp": "2008-01-01T16:11:56Z", "full_text": "Hi Frank,\n\nI&#39;d love it if you could take a look at it for us so you give us  \nguidance, we&#39;re not experienced at this type of stuff and I&#39;d feel  \nmuch better if we were shown what /where/how. We don&#39;t want to  \ninterrupt your holiday, but if you&#39;re not a big New Years fan even 10  \nminutes of your time would be great.\n\nIf you&#39;re still willing to take a look, where would you like to  meet?  \nYou can give me a call, the number below is my home business. Don&#39;t  \nknow where in Littleton you are, but I usually meet clients at the  \nStarbucks in Aspen Grove. There&#39;s another Starbucks at Broadway &  \nLittleton Blvd. I&#39;d  need to make sure they&#39;re open today.\n\nIf you&#39;re busy, I understand. We&#39;ll just do our best!\n_ _ _ _ _ _ _ _\n\nDebbie Tejada\nTejada Design\n4778 Adelaide Place\nHighlands Ranch CO 80130\n303-346-1525 ph\n303-346-1800 fax\n\nhttp://www.tejadadesign.com\nhttp://www.tejadaphoto.com\n\n&quot;Once you can accept the universe as matter expanding into nothing  \nthat is something, wearing stripes with plaid comes easy. &quot;  ~Albert  \nEinstein\n\nOn Dec 31, 2007, at 7:37 PM, Frank Sumption wrote:\n\n&gt; It&#39;s farily straight forward to repair, you can tell what conductor\n&gt; goes to what conductor on the board. It&#39;s just a matter of making\n&gt; little jumpers with small wire to bridge the breaks. Radio shack has\n&gt; #30 wire wrap wire that works well for that kind of stuff. Maybe\n&gt; there&#39;s enough of the original pad left on the connectors that you\n&gt; could glue them back in place, then jumper the breaks. I could look\n&gt; at it tomorrow, as well.\n&gt;\n&gt;\n\n\n&gt;  There&#39;s a green coating on the circuit traces called solder mask,  \n&gt; you&#39;ll have to very gently scrap some of the mask off to solder on a  \n&gt; jumper wire. You&#39;ll see the copper colored conductor under the mask.  \n&gt; Then you aplly some solder to conductor, and some to the wire, then  \n&gt; heat the two togther to join them. Watch out for solder bridges  \n&gt; between conductors.\n&gt;\n&gt;\n\n&gt; Frank-S\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, Debbie Tejada &lt;debbie@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hi Frank,\n&gt; &gt;\n&gt; &gt; I&#39;d heard you were in Littleton -- is there any chance you could\n&gt; take\n&gt; &gt; a look at this in person and tell me how to fix it? I had a feeling\n&gt; it\n&gt; &gt; was going to be a serious problem, but since its messed up already\n&gt; I\n&gt; &gt; guess I have nothing to lose. I could bring it by your place or we\n&gt; &gt; could meet some where convenient to you if you have a few minutes.\n&gt; I\n&gt; &gt; have a pointy tipped soldering iron that&#39;s made for smaller\n&gt; electronic\n&gt; &gt; stuff and have a background in botanic illustration so I&#39;m used to\n&gt; &gt; working on details. If I could get some guidance from you I&#39;m\n&gt; willing\n&gt; &gt; to try myself.\n&gt; &gt;\n&gt; &gt; What do you think?\n&gt; &gt; _ _ _ _ _ _ _ _\n&gt; &gt;\n&gt; &gt; Debbie Tejada\n&gt; &gt; Tejada Design\n&gt; &gt; 4778 Adelaide Place\n&gt; &gt; Highlands Ranch CO 80130\n&gt; &gt; 303-346-1525 ph\n&gt; &gt; 303-346-1800 fax\n&gt; &gt;\n&gt; &gt; http://www.tejadadesign.com\n&gt; &gt; http://www.tejadaphoto.com\n&gt; &gt;\n&gt; &gt; &quot;Once you can accept the universe as matter expanding into nothing\n&gt; &gt; that is something, wearing stripes with plaid comes easy. &quot;\n&gt; ~Albert\n&gt; &gt; Einstein\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; On Dec 30, 2007, at 11:59 PM, Frank Sumption wrote:\n&gt; &gt;\n&gt; &gt; &gt; Ouch! That redish colored torn stuff is a circuit trace torn off\n&gt; the\n&gt; &gt; &gt; board, it&#39;s green colored on top, and copper colored on the\n&gt; &gt; &gt; underside.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Those are surface mount connectors, and wires would have to be\n&gt; &gt; &gt; soldered on the connector tabs, then spliced onto the board. I\n&gt; don&#39;t\n&gt; &gt; &gt; know if I can solder anything that small with the iron I have.\n&gt; &gt; &gt;\n&gt; &gt; &gt; I hate advertise it, but I&#39;m in Littleton.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Frank-S\n&gt; &gt; &gt;\n&gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;Debbie Tejada&quot; &lt;debbie@&gt; wrote:\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Okay, one of my DIY projects this weekend has been to convert my\n&gt; &gt; &gt; &gt; husband&#39;s old Olympus to infrared. We&#39;re not extremely talented\n&gt; in\n&gt; &gt; &gt; the\n&gt; &gt; &gt; &gt; electronics area, but we have fun and seem to muddle by. No\n&gt; guts no\n&gt; &gt; &gt; &gt; glory, huh?\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Well, for the most part the operation has been a success. I\n&gt; &gt; &gt; &gt; photographed every step of the way and taped screws and parts\n&gt; to the\n&gt; &gt; &gt; &gt; photos so we&#39;d know how to rebuild everything we took apart, and\n&gt; &gt; &gt; that\n&gt; &gt; &gt; &gt; has worked just fine. I located the IR filter, removed it and\n&gt; cut\n&gt; &gt; &gt; and\n&gt; &gt; &gt; &gt; replaced it with a piece of glass slide.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; The one problem we ran into is that there were two wires that\n&gt; &gt; &gt; appeared\n&gt; &gt; &gt; &gt; to be clipped in place as opposed to being soldered or screwed\n&gt; in\n&gt; &gt; &gt; like\n&gt; &gt; &gt; &gt; everything else. When we tried to pry the clips open, instead\n&gt; the\n&gt; &gt; &gt; &gt; whole thing came off the circuit board. WE HAVE NO CLUE HOW TO\n&gt; &gt; &gt; PROCEED\n&gt; &gt; &gt; &gt; FROM HERE. I don&#39;t know if we can just glue the darn things\n&gt; down and\n&gt; &gt; &gt; &gt; if so, what type of glue to use, or if we&#39;re just plain up the\n&gt; &gt; &gt; creek.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; I immediately thought of this group of brainy electronics\n&gt; buffs. I&#39;m\n&gt; &gt; &gt; &gt; hoping someone out there can give us some advice, or if you live\n&gt; &gt; &gt; near\n&gt; &gt; &gt; &gt; Highlands Ranch, CO, you could help in person & bail us out of\n&gt; &gt; &gt; this. I\n&gt; &gt; &gt; &gt; was hoping to take this camera to the St. Augustine Lighthouse\n&gt; at\n&gt; &gt; &gt; the\n&gt; &gt; &gt; &gt; end of this coming week.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Is there any hope? I&#39;ve posted a photo of an extreme closeup of\n&gt; the\n&gt; &gt; &gt; &gt; clips (one is pink, the other is ivory) and the damaged board --\n&gt; I\n&gt; &gt; &gt; had\n&gt; &gt; &gt; &gt; to sandwich two photos together to get both in focus at the same\n&gt; &gt; &gt; time\n&gt; &gt; &gt; &gt; (that&#39;s why it looks that way). For an idea of scale, the clips\n&gt; are\n&gt; &gt; &gt; &gt; both the same size, about 4 mm in width, 4 mm tall, 3 mm deep.\n&gt; Not\n&gt; &gt; &gt; &gt; easy to handle and even harder to see with these middle age\n&gt; eyes.\n&gt; &gt; &gt; &gt; http://www.tejadadesign.com/camera/splice.jpg\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Any advice would be GREATLY APPRECIATED!! Deb T.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;\n&gt; \n\n\nHi F ank,I'd lo e i i you could ake a look a i o us so you gi e us guidance, we' e no expe ienced a his ype o s u and I'd eel much be e i we we e shown wha /whe e/how. We don' wan o in e up you holiday, bu i you' e no a big New Yea s an e en 10 minu es o you ime would be g ea .I you' e s ill willing o ake a look, whe e would you like o  mee ? You can gi e me a call, he numbe below is my home business. Don' know whe e in Li le on you a e, bu I usually mee clien s a he S a bucks in Aspen G o e. The e's ano he S a bucks a B oadway & Li le on Bl d. I'd  need o make su e hey' e open oday.I you' e busy, I unde s and. We'll jus do ou bes ! _ _ _ _ _ _ _ _Debbie TejadaTejada Design4778 Adelaide PlaceHighlands Ranch CO 80130303-346-1525 ph303-346-1800 axh p://www. ejadadesign.comh p://www. ejadapho o.com\"Once you can accep he uni e se as ma e expanding in o no hing ha is some hing, wea ing s ipes wi h plaid comes easy. \"  ~Albe Eins ein On Dec 31, 2007, a 7:37 PM, F ank Sump ion w o e:I 's a ily s aigh o wa d o epai , you can ell wha conduc o  goes o wha conduc o on he boa d. I 's jus a ma e o making li le jumpe s wi h small wi e o b idge he b eaks. Radio shack has #30 wi e w ap wi e ha wo ks well o ha kind o s u . Maybe  he e's enough o he o iginal pad le on he connec o s ha you could glue hem back in place, hen jumpe he b eaks. I could look a i omo ow, as well.  The e's a g een coa ing on he ci cui aces called solde mask, you'll ha e o e y gen ly sc ap some o he mask o o solde on a jumpe wi e. You'll see he coppe colo ed conduc o unde he mask. Then you aplly some solde o conduc o , and some o he wi e, hen hea he wo og he o join hem. Wa ch ou o solde b idges be ween conduc o s. F ank-S--- In EVP-ITC@yahoog oups.com, Debbie Tejada w o e:>> Hi F ank,> > I'd hea d you we e in Li le on -- is he e any chance you could  ake > a look a his in pe son and ell me how o ix i ? I had a eeling i  > was going o be a se ious p oblem, bu since i s messed up al eady I > guess I ha e no hing o lose. I could b ing i by you place o we > could mee some whe e con enien o you i you ha e a ew minu es. I > ha e a poin y ipped solde ing i on ha 's made o smalle  elec onic > s u and ha e a backg ound in bo anic illus a ion so I'm used o > wo king on de ails. I I could ge some guidance om you I'm willing > o y mysel .> > Wha do you hink?> _ _ _ _ _ _ _ _> > Debbie Tejada> Tejada Design> 4778 Adelaide Place> Highlands Ranch CO 80130> 303-346-1525 ph> 303-346-1800 ax> > h p://www. ejadadesign.com> h p://www. ejadapho o.com> > \"Once you can accep he uni e se as ma e expanding in o no hing > ha is some hing, wea ing s ipes wi h plaid comes easy. \" ~Albe  > Eins ein> > > > On Dec 30, 2007, a 11:59 PM, F ank Sump ion w o e:> > > Ouch! Tha edish colo ed o n s u is a ci cui ace o n o   he> > boa d, i 's g een colo ed on op, and coppe colo ed on he> > unde side.> >> > Those a e su ace moun connec o s, and wi es would ha e o be> > solde ed on he connec o abs, hen spliced on o he boa d. I don' > > know i I can solde any hing ha small wi h he i on I ha e.> >> > I ha e ad e ise i , bu I'm in Li le on.> >> > F ank-S> >> > --- In EVP-ITC@yahoog oups.com, \"Debbie Tejada\" w o e:> > >> > > Okay, one o my DIY p ojec s his weekend has been o con e my> > > husband's old Olympus o in a ed. We' e no ex emely alen ed in> > he> > > elec onics a ea, bu we ha e un and seem o muddle by. No gu s no> > > glo y, huh?> > >> > > Well, o he mos pa he ope a ion has been a success. I> > > pho og aphed e e y s ep o he way and aped sc ews and pa s  o he> > > pho os so we'd know how o ebuild e e y hing we ook apa , and> > ha > > > has wo ked jus ine. I loca ed he IR il e , emo ed i and cu > > and> > > eplaced i wi h a piece o glass slide.> > >> > > The one p oblem we an in o is ha he e we e wo wi es ha > > appea ed> > > o be clipped in place as opposed o being solde ed o sc ewed in> > like> > > e e y hing else. When we ied o p y he clips open, ins ead  he> > > whole hing came o he ci cui boa d. WE HAVE NO CLUE HOW TO> > PROCEED> > > FROM HERE. I don' know i we can jus glue he da n hings down and> > > i so, wha ype o glue o use, o i we' e jus plain up he> > c eek.> > >> > > I immedia ely hough o his g oup o b ainy elec onics bu s. I'm> > > hoping someone ou he e can gi e us some ad ice, o i you li e> > nea > > > Highlands Ranch, CO, you could help in pe son & bail us ou o > > his. I> > > was hoping o ake his came a o he S . Augus ine Ligh house a > > he> > > end o his coming week.> > >> > > Is he e any hope? I' e pos ed a pho o o an ex eme closeup o   he> > > clips (one is pink, he o he is i o y) and he damaged boa d --I> > had> > > o sandwich wo pho os oge he o ge bo h in ocus a he same> > ime> > > ( ha 's why i looks ha way). Fo an idea o scale, he clips a e> > > bo h he same size, abou 4 mm in wid h, 4 mm all, 3 mm deep. No > > > easy o handle and e en ha de o see wi h hese middle age eyes.> > > h p://www. ejadadesign.com/came a/splice.jpg> > >> > > Any ad ice would be GREATLY APPRECIATED!! Deb T.> > >> >> >> >>"}