{"id": "4746", "subject": "Re: Steve H", "author": "Steve Hultay", "timestamp": "2008-01-01T20:13:36Z", "full_text": "Thanx, Misty and Happy New Year to you as well.\n\n-Steve H.\n\n\n\n--- In EVP-ITC@yahoogroups.com, Misty Dawn &lt;bulletbabea@...&gt; wrote:\n&gt;\n&gt; Hiya Steve. Happy New Year! \n&gt;    \n&gt;   All methods are welcome here. I dont post my stuff so much for \nfeedback as just to share what the messages are. If I want feedback I \nemail private to someone. No matter what method is used, people will \nhear thier own way. Sometimes they hear what I hear sometimes they \nhear a totally different message for themselves, sometimes they just \nhear blahbedeblah/nothin .\n&gt;    \n&gt;   Watch out for that negative energy thats building =) it will only \nget in the way of the research. If one method isnt your cup of tea, \ntry another. There are so many choices that I am always adding \nsomething new to the list of things I tried that had results, whether \ngood or cruddy it all gets documented and I move on.\n&gt;    \n&gt;   Yeah people have been really busy. I think we have a case of \nactive member syndrome. Either they are actively focused on another \ntopic of discussion (hopefully not a war of words) or they are like \nme and just too dang busy working to have much free time to remark on \nall the files we listen to. If you ever &quot;need&quot; feedback just \nholler...you know my email and private emails usually get priority \nresponse whether Im busy or not. \n&gt;    \n&gt;   Misty\n&gt;   \n&gt; \n&gt; Steve Hultay &lt;urkel23@...&gt; wrote:\n&gt;           Hey, Misty at least people are responding to your audio \nfiles. I \n&gt; haven&#39;t had any feedback on my posts in months. Being that this \n&gt; board has nothing to do with ITC research anymore and more about \n&gt; appliances that are broken. People are probably wondering why \n&gt; occasionally some are posting audio files, maybe we are wrong for \n&gt; imposing on their chat room. I have a toaster on the fritz so maybe \n&gt; i can join in on the chat now.\n&gt; \n&gt; -Steve H.\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Misty Dawn &lt;bulletbabea@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Bruce,\n&gt; &gt; \n&gt; &gt; Happy New Year to you too! Thanks for tryin but sometimes its \n&gt; just not for everyone ears. Never know who hears what til ya post \nit \n&gt; =) I dont worry about quality so much anymore because whats crystal \n&gt; clear for some sounds like blahbedeblah to others. \n&gt; &gt; \n&gt; &gt; Misty\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; Misty,\n&gt; &gt; \n&gt; &gt; Happy new year, I listened to the files a few times and unless \nyou \n&gt; read \n&gt; &gt; what they are labeled I could not hear anything but misty in the \n&gt; second one\n&gt; &gt; I don&#39;t think it was quality just volume of the voice itself.\n&gt; &gt; \n&gt; &gt; Bruce\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; Bruce Halliday \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; ---------------------------------\n&gt; &gt; To: EVP-ITC@yahoogroups.com\n&gt; &gt; From: bulletbabea@\n&gt; &gt; Date: Mon, 31 Dec 2007 19:42:02 -0800\n&gt; &gt; Subject: Re: [EVP-ITC] Re: Frank&#39;s Box on YouTube\n&gt; &gt; \n&gt; &gt; Every method has its moments! Happy New Year!!!! \n&gt; &gt; \n&gt; &gt; Misty\n&gt; &gt; Frank Sumption &lt;franks-boxes@&gt; wrote:\n&gt; &gt; I don&#39;t know if maybe the audio pick up from the box wasn&#39;t \n&gt; very good, \n&gt; &gt; but I can&#39;t make out much of that either. It sounds like the \n&gt; recordings \n&gt; &gt; I do with a cell phone. I think you&#39;d have to be there to judge \nit. \n&gt; &gt; \n&gt; &gt; Personally I&#39;m always disappointed at my stuff being out there, \nand \n&gt; &gt; the incredible lack of clarity obatained with it, to me that&#39;s a \n&gt; huge \n&gt; &gt; failure! I know the stuff works, but how to get it to a level \nthat \n&gt; can \n&gt; &gt; be understood by most, that&#39;s the problem, and my focus at the \n&gt; moment. \n&gt; &gt; The Mini Box is big step in that direction, so some of the \npressure \n&gt; if \n&gt; &gt; off, but I still need to get my boxes to professional level. \n&gt; &gt; \n&gt; &gt; Frank-S\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; ---------------------------------\n&gt; &gt; Be a better friend, newshound, and know-it-all with Yahoo! \n&gt; Mobile. Try it now. \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; ---------------------------------\n&gt; &gt; The best games are on Xbox 360. Click here for a special offer on \n&gt; an Xbox 360 Console. Get it now! \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; ---------------------------------\n&gt; &gt; Never miss a thing. Make Yahoo your homepage.\n&gt; &gt;\n&gt; \n&gt; \n&gt; \n&gt;                          \n&gt; \n&gt; \n&gt; \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt;        \n&gt; ---------------------------------\n&gt; Looking for last minute shopping deals?  Find them fast with Yahoo! \nSearch.\n&gt;"}