{"id": "4747", "subject": "Re: [EVP-ITC] Re: Frank&#39;s Box on YouTube", "author": "Lisby", "timestamp": "2008-01-01T20:34:35Z", "full_text": "C&#39;mon Steve--I know I&#39;ve replied to many of your files, visited your  \nsite, and spent hours listening to audio.\n\nYes, it would be nice if more people commented, but sometimes they  \ndon&#39;t because there is nothing to say other than, &quot;I hear it.&quot; Which  \nraises the question--do we want a thousand posts containing, &quot;I hear  \nit&quot;?  If you want specific feedback on a file, let people know what  \nyou&#39;re looking for (&quot;Is this really saying this?&quot;, &quot;Is this a man or  \na woman?&quot; &quot;What do you think the last word might be?&quot;) I think it  \nmight encourage meaningful participation.\n\nOddly enough, people are talking right now because no one is posting  \nloads of files, almost certainly because of the holidays. And there  \nis nothing wrong with people talking about issues that concern them.  \nSometimes I feel like the list is full of shopping tips for obscure  \nparanormal-makeover equipment, but I don&#39;t begrudge anyone for  \nposting about it.\n\nThere are many levels to this list--to any list--which is, at it&#39;s  \nbasis a social network.\n\nHMO and such and if you post a file or two today, I promise I will  \ncomment. Scout&#39;s honor! ;)\n\nAnn\n\nOn Jan 1, 2008, at 2:14 PM, Steve Hultay wrote:\n\n&gt; Hey, Misty at least people are responding to your audio files. I\n&gt; haven&#39;t had any feedback on my posts in months. Being that this\n&gt; board has nothing to do with ITC research anymore and more about\n&gt; appliances that are broken. People are probably wondering why\n&gt; occasionally some are posting audio files, maybe we are wrong for\n&gt; imposing on their chat room. I have a toaster on the fritz so maybe\n&gt; i can join in on the chat now.\n&gt;\n&gt; -Steve H.\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, Misty Dawn &lt;bulletbabea@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Bruce,\n&gt; &gt;\n&gt; &gt; Happy New Year to you too! Thanks for tryin but sometimes its\n&gt; just not for everyone ears. Never know who hears what til ya post it\n&gt; =) I dont worry about quality so much anymore because whats crystal\n&gt; clear for some sounds like blahbedeblah to others.\n&gt; &gt;\n&gt; &gt; Misty\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Misty,\n&gt; &gt;\n&gt; &gt; Happy new year, I listened to the files a few times and unless you\n&gt; read\n&gt; &gt; what they are labeled I could not hear anything but misty in the\n&gt; second one\n&gt; &gt; I don&#39;t think it was quality just volume of the voice itself.\n&gt; &gt;\n&gt; &gt; Bruce\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Bruce Halliday\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; ---------------------------------\n&gt; &gt; To: EVP-ITC@yahoogroups.com\n&gt; &gt; From: bulletbabea@...\n&gt; &gt; Date: Mon, 31 Dec 2007 19:42:02 -0800\n&gt; &gt; Subject: Re: [EVP-ITC] Re: Frank&#39;s Box on YouTube\n&gt; &gt;\n&gt; &gt; Every method has its moments! Happy New Year!!!!\n&gt; &gt;\n&gt; &gt; Misty\n&gt; &gt; Frank Sumption &lt;franks-boxes@...&gt; wrote:\n&gt; &gt; I don&#39;t know if maybe the audio pick up from the box wasn&#39;t\n&gt; very good,\n&gt; &gt; but I can&#39;t make out much of that either. It sounds like the\n&gt; recordings\n&gt; &gt; I do with a cell phone. I think you&#39;d have to be there to judge it.\n&gt; &gt;\n&gt; &gt; Personally I&#39;m always disappointed at my stuff being out there, and\n&gt; &gt; the incredible lack of clarity obatained with it, to me that&#39;s a\n&gt; huge\n&gt; &gt; failure! I know the stuff works, but how to get it to a level that\n&gt; can\n&gt; &gt; be understood by most, that&#39;s the problem, and my focus at the\n&gt; moment.\n&gt; &gt; The Mini Box is big step in that direction, so some of the pressure\n&gt; if\n&gt; &gt; off, but I still need to get my boxes to professional level.\n&gt; &gt;\n&gt; &gt; Frank-S\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; ---------------------------------\n&gt; &gt; Be a better friend, newshound, and know-it-all with Yahoo!\n&gt; Mobile. Try it now.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; ---------------------------------\n&gt; &gt; The best games are on Xbox 360. Click here for a special offer on\n&gt; an Xbox 360 Console. Get it now!\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; ---------------------------------\n&gt; &gt; Never miss a thing. Make Yahoo your homepage.\n&gt; &gt;\n&gt;\n&gt;\n&gt; \n\n\nC'mon S e e--I know I' e eplied o many o you iles, isi ed you si e, and spen hou s lis ening o audio.Yes, i would be nice i mo e people commen ed, bu some imes hey don' because he e is no hing o say o he han, \"I hea i .\" Which aises he ques ion--do we wan a housand pos s con aining, \"I hea i \"?  I you wan speci ic eedback on a ile, le people know wha you' e looking o (\"Is his eally saying his?\", \"Is his a man o a woman?\" \"Wha do you hink he las wo d migh be?\") I hink i migh encou age meaning ul pa icipa ion.Oddly enough, people a e alking igh now because no one is pos ing loads o iles, almos ce ainly because o he holidays. And he e is no hing w ong wi h people alking abou issues ha conce n hem. Some imes I eel like he lis is ull o shopping ips o obscu e pa ano mal-makeo e equipmen , bu I don' beg udge anyone o pos ing abou i .The e a e many le els o his lis -- o any lis --which is, a i 's basis a social ne wo k.HMO and such and i you pos a ile o wo oday, I p omise I will commen . Scou 's hono ! ;)AnnOn Jan 1, 2008, a 2:14 PM, S e e Hul ay w o e:Hey, Mis y a leas people a e esponding o you audio iles. I ha en' had any eedback on my pos s in mon hs. Being ha his boa d has no hing o do wi h ITC esea ch anymo e and mo e abou  appliances ha a e b oken. People a e p obably wonde ing why occasionally some a e pos ing audio iles, maybe we a e w ong o  imposing on hei cha oom. I ha e a oas e on he i z so maybe i can join in on he cha now.-S e e H.--- In EVP-ITC@yahoog oups.com, Mis y Dawn ...> w o e:>> B uce,> > Happy New Yea o you oo! Thanks o yin bu some imes i s jus no o e e yone ea s. Ne e know who hea s wha il ya pos i  =) I don wo y abou quali y so much anymo e because wha s c ys al clea o some sounds like blahbedeblah o o he s. > > Mis y> > > Mis y,> > Happy new yea , I lis ened o he iles a ew imes and unless you  ead > wha hey a e labeled I could no hea any hing bu mis y in he second one> I don' hink i was quali y jus olume o he oice i sel .> > B uce> > > B uce Halliday > > > > > > ---------------------------------> To: EVP-ITC@yahoog oups.com> F om: bulle babea@...> Da e: Mon, 31 Dec 2007 19:42:02 -0800> Subjec : Re: [EVP-ITC] Re: F ank's Box on YouTube> > E e y me hod has i s momen s! Happy New Yea !!!! > > Mis y> F ank Sump ion ...> w o e:> I don' know i maybe he audio pick up om he box wasn'   e y good, > bu I can' make ou much o ha ei he . I sounds like he  eco dings > I do wi h a cell phone. I hink you'd ha e o be he e o judge i . > > Pe sonally I'm always disappoin ed a my s u being ou he e, and > he inc edible lack o cla i y oba ained wi h i , o me ha 's a huge > ailu e! I know he s u wo ks, bu how o ge i o a le el ha  can > be unde s ood by mos , ha 's he p oblem, and my ocus a he momen . > The Mini Box is big s ep in ha di ec ion, so some o he p essu e i  > o , bu I s ill need o ge my boxes o p o essional le el. > > F ank-S> > > > > > > > > ---------------------------------> Be a be e iend, newshound, and know-i -all wi h Yahoo! Mobile. T y i now. > > > > > > > ---------------------------------> The bes games a e on Xbox 360. Click he e o a special o e on an Xbox 360 Console. Ge i now! > > > > > > > > > > > ---------------------------------> Ne e miss a hing. Make Yahoo you homepage.>"}