{"id": "4754", "subject": "Re: [EVP-ITC] Please listen if you get a moment ~", "author": "Debbie Tejada", "timestamp": "2008-01-01T22:55:33Z", "full_text": "Okay, I figured out what I was doing wrong. I&#39;m just learning how to  \nuse Audacity, I was using &quot;Invert&quot; instead of &quot;Reverse.&quot; My bad!\nDeb T\n\n&quot;Once you can accept the universe as matter expanding into nothing  \nthat is something, wearing stripes with plaid comes easy. &quot;  ~Albert  \nEinstein\n\nOn Jan 1, 2008, at 3:43 PM, Debbie Tejada wrote:\n\n&gt; Steve, holy cow, you&#39;re right, it says Margaret! That is interesting  \n&gt; that you didn&#39;t hear anything in my second clip. I had reversed my  \n&gt; clip previously, but didn&#39;t sounds like anything but backwards  \n&gt; words. How did you do that?\n&gt;\n&gt; _ _ _ _ _ _ _ _\n&gt;\n&gt; Debbie Tejada\n&gt;\n&gt; &quot;Once you can accept the universe as matter expanding into nothing  \n&gt; that is something, wearing stripes with plaid comes easy. &quot;  ~Albert  \n&gt; Einstein\n&gt;\n&gt; On Jan 1, 2008, at 3:31 PM, urkel23@... wrote:\n&gt;\n&gt;&gt; I hear nothing in the 2nd file, but i raised the volume of the  \n&gt;&gt; first file and it sounds like it says &quot;Weirdo&quot; and i reversed that  \n&gt;&gt; file and now i believe it says &quot;Margaret&quot;.  I&#39;ve attached the 2  \n&gt;&gt; files i re-worked for you.\n&gt;&gt;\n&gt;&gt; -Steve H.\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; In a message dated 1/1/2008 5:22:01 P.M. Eastern Standard Time, debbie@... \n&gt;&gt;  writes:\n&gt;&gt; Hi all,\n&gt;&gt;\n&gt;&gt; I&#39;m attaching an EVP that I picked up last week. We could hear it in\n&gt;&gt; person at the time, and it sounded like &quot;get out.&quot; Once I pulled it\n&gt;&gt; into Audacity, it sounded completely different. Slowing it down 33%\n&gt;&gt; makes it sound even more different. Any guesses? I haven&#39;t done\n&gt;&gt; anything to these files other than to slow the second version down a\n&gt;&gt; bit. Deb T\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; See AOL&#39;s top rated recipes and easy ways to stay in shape for  \n&gt;&gt; winter.\n&gt;&gt;\n&gt;&gt;  &lt;margaret.mp3&gt;&lt;weirdo.mp3&gt;\n&gt;\n&gt;\n&gt; \n\n\nOkay, I igu ed ou wha I was doing w ong. I'm jus lea ning how o use Audaci y, I was using \"In e \" ins ead o \"Re e se.\" My bad!Deb T\"Once you can accep he uni e se as ma e expanding in o no hing ha is some hing, wea ing s ipes wi h plaid comes easy. \"  ~Albe Eins ein On Jan 1, 2008, a 3:43 PM, Debbie Tejada w o e:S e e, holy cow, you' e igh , i says Ma ga e ! Tha is in e es ing ha you didn' hea any hing in my second clip. I had e e sed my clip p e iously, bu didn' sounds like any hing bu backwa ds wo ds. How did you do ha ?_ _ _ _ _ _ _ _Debbie Tejada\"Once you can accep he uni e se as ma e expanding in o no hing ha is some hing, wea ing s ipes wi h plaid comes easy. \"  ~Albe Eins einOn Jan 1, 2008, a 3:31 PM, u kel23@aol.com w o e:I hea no hing in he 2nd ile, bu i aised he olume o he i s ile and i sounds like i says \"Wei do\" and i e e sed ha ile and now i belie e i says \"Ma ga e \".  I' e a ached he 2 iles i e-wo ked o you. -S e e H.   In a message da ed 1/1/2008 5:22:01 P.M. Eas e n S anda d Time, debbie@ ejadadesign.com w i es:Hi all,I'm a aching an EVP ha I picked up las week. We could hea i in pe son a he ime, and i sounded like \"ge ou .\" Once I pulled i  in o Audaci y, i sounded comple ely di e en . Slowing i down 33% makes i sound e en mo e di e en . Any guesses? I ha en' done any hing o hese iles o he han o slow he second e sion down a bi . Deb TSee AOL's  op a ed ecipes and easy ways o s ay in shape  o win e ."}