{"id": "4758", "subject": "Re: [EVP-ITC] Please listen if you get a moment ~", "author": "Debbie Tejada", "timestamp": "2008-01-02T00:37:34Z", "full_text": "Bruce,\n\nYes, that&#39;s going to be my next project. We did have a Shack Hack with  \nus when I got that evp, but it was cycling thru the stations too  \nslowly and the person who brought it said she was going to fix that.  \nI&#39;ve heard I can get a chip from UFO Geek for that purpose. None of  \nthat makes any sense to me yet, I&#39;m new to electronics but am a real  \nDIY person so I guess I&#39;ll learn! This forum introduced me to the  \nconcept of ritual evp recording, which would be a great opportunity  \nfor me to experiment with the box and also train my ears to separate  \nthe real communication from matrixing.\n\nThanks for the offer of help, I&#39;m sure I&#39;ll need it when I get to that  \npoint!\n\nDeb T\n\n&quot;Once you can accept the universe as matter expanding into nothing  \nthat is something, wearing stripes with plaid comes easy. &quot;  ~Albert  \nEinstein\n\nOn Jan 1, 2008, at 5:24 PM, bruce halliday wrote:\n\n&gt; Hey Deb,\n&gt;\n&gt; What I think you should be experimenting with a radio shack hack.\n&gt; you can pick up a 12-469 at radio shack for 24.99 and you will be able\n&gt; to start doing box research as opposed to traditional evp . you will  \n&gt; be able\n&gt; to enter a new world of real time communication. And don&#39;t worry I  \n&gt; will be here to help get you going.\n&gt;\n&gt; Bruce\n&gt;\n&gt;\n&gt;\n&gt; Bruce Halliday\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; From: debbie@...\n&gt; Date: Tue, 1 Jan 2008 15:55:33 -0700\n&gt; Subject: Re: [EVP-ITC] Please listen if you get a moment ~\n&gt;\n&gt; Okay, I figured out what I was doing wrong. I&#39;m just learning how to  \n&gt; use Audacity, I was using &quot;Invert&quot; instead of &quot;Reverse.&quot; My bad!\n&gt; Deb T\n&gt;\n&gt; &quot;Once you can accept the universe as matter expanding into nothing  \n&gt; that is something, wearing stripes with plaid comes easy. &quot;  ~Albert  \n&gt; Einstein\n&gt;\n&gt; On Jan 1, 2008, at 3:43 PM, Debbie Tejada wrote:\n&gt;\n&gt; Steve, holy cow, you&#39;re right, it says Margaret! That is interesting  \n&gt; that you didn&#39;t hear anything in my second clip. I had reversed my  \n&gt; clip previously, but didn&#39;t sounds like anything but backwards  \n&gt; words. How did you do that?\n&gt;\n&gt;\n&gt; _ _ _ _ _ _ _ _\n&gt;\n&gt; Debbie Tejada\n&gt;\n&gt; &quot;Once you can accept the universe as matter expanding into nothing  \n&gt; that is something, wearing stripes with plaid comes easy. &quot;  ~Albert  \n&gt; Einstein\n&gt;\n&gt; On Jan 1, 2008, at 3:31 PM, urkel23@... wrote:\n&gt;\n&gt; I hear nothing in the 2nd file, but i raised the volume of the first  \n&gt; file and it sounds like it says &quot;Weirdo&quot; and i reversed that file  \n&gt; and now i believe it says &quot;Margaret&quot;.  I&#39;ve attached the 2 files i  \n&gt; re-worked for you.\n&gt;\n&gt; -Steve H.\n&gt;\n&gt;\n&gt;\n&gt; In a message dated 1/1/2008 5:22:01 P.M. Eastern Standard Time, debbie@... \n&gt;  writes:\n&gt; Hi all,\n&gt;\n&gt; I&#39;m attaching an EVP that I picked up last week. We could hear it in\n&gt; person at the time, and it sounded like &quot;get out.&quot; Once I pulled it\n&gt; into Audacity, it sounded completely different. Slowing it down 33%\n&gt; makes it sound even more different. Any guesses? I haven&#39;t done\n&gt; anything to these files other than to slow the second version down a\n&gt; bit. Deb T\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; See AOL&#39;s top rated recipes and easy ways to stay in shape for winter.\n&gt;\n&gt;  &lt;margaret.mp3&gt;&lt;weirdo.mp3&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; The best games are on Xbox 360. Click here for a special offer on an  \n&gt; Xbox 360 Console. Get it now!\n&gt;\n&gt; \n\n\nB uce,Yes, ha 's going o be my nex p ojec . We did ha e a Shack Hack wi h us when I go ha e p, bu i was cycling h u he s a ions oo slowly and he pe son who b ough i said she was going o ix ha . I' e hea d I can ge a chip om UFO Geek o ha pu pose. None o ha makes any sense o me ye , I'm new o elec onics bu am a eal DIY pe son so I guess I'll lea n! This o um in oduced me o he concep o i ual e p eco ding, which would be a g ea oppo uni y o me o expe imen wi h he box and also ain my ea s o sepa a e he eal communica ion om ma ixing.Thanks o he o e o help, I'm su e I'll need i when I ge o ha poin !Deb T\"Once you can accep he uni e se as ma e expanding in o no hing ha is some hing, wea ing s ipes wi h plaid comes easy. \"  ~Albe Eins ein On Jan 1, 2008, a 5:24 PM, b uce halliday w o e:Hey Deb, Wha I hink you should be expe imen ing wi h a adio shack hack.you can pick up a 12-469 a adio shack  o 24.99 and you will be able o s a doing box esea ch as opposed o adi ional e p . you will be able  o en e a new wo ld o eal ime communica ion. And don' wo y I will be he e o help ge you going. B uceB uce Halliday To: EVP-ITC@yahoog oups.comF om: debbie@ ejadadesign.comDa e: Tue, 1 Jan 2008 15:55:33 -0700Subjec : Re: [EVP-ITC] Please lis en i you ge a momen ~Okay, I igu ed ou wha I was doing w ong. I'm jus lea ning how o use Audaci y, I was using \"In e \" ins ead o \"Re e se.\" My bad!Deb T\"Once you can accep he uni e se as ma e expanding in o no hing ha is some hing, wea ing s ipes wi h plaid comes easy. \"  ~Albe Eins einOn Jan 1, 2008, a 3:43 PM, Debbie Tejada w o e:S e e, holy cow, you' e igh , i says Ma ga e ! Tha is in e es ing ha you didn' hea any hing in my second clip. I had e e sed my clip p e iously, bu didn' sounds like any hing bu backwa ds wo ds. How did you do ha ?_ _ _ _ _ _ _ _Debbie Tejada\"Once you can accep he uni e se as ma e expanding in o no hing ha is some hing, wea ing s ipes wi h plaid comes easy. \"  ~Albe Eins einOn Jan 1, 2008, a 3:31 PM, u kel23@aol.com w o e:I hea no hing in he 2nd ile, bu i aised he olume o he i s ile and i sounds like i says \"Wei do\" and i e e sed ha ile and now i belie e i says \"Ma ga e \".  I' e a ached he 2 iles i e-wo ked o you. -S e e H.   In a message da ed 1/1/2008 5:22:01 P.M. Eas e n S anda d Time, debbie@ ejadadesign.com w i es:Hi all,I'm a aching an EVP ha I picked up las week. We could hea i in pe son a he ime, and i sounded like \"ge ou .\" Once I pulled i  in o Audaci y, i sounded comple ely di e en . Slowing i down 33% makes i sound e en mo e di e en . Any guesses? I ha en' done any hing o hese iles o he han o slow he second e sion down a bi . Deb TSee AOL's  op a ed ecipes and easy ways o s ay in shape  o win e . The bes games a e on Xbox 360. Click he e o a special o e on an Xbox 360 Console. Ge i now!"}