{"id": "4764", "subject": "Re: Get Audio Steve", "author": "babiarz3", "timestamp": "2008-01-02T02:14:02Z", "full_text": "Thanks Juli, it&#39;s nice to be back. Holiday times always get so hectic.\n\nOn a side note here- I&#39;ve been working with a 469 shack hack and have\nyet to get anything I can consider a direct response or intelligible\ncommunication. IMO, thus far, I hear nothing besides radio fragments.\nGoing on the theory that this device enables the same real time 2-way\ncommunication as Frank&#39;s Box or it&#39;s &quot;children&quot;, requesting that my\nown name be said doesn&#39;t seem like it should be a difficult task. I\nhave even told them my name, as a just-in-case measure. Nothing even\nresembling my name, or in name for that matter. When asked what their\nname is, also nothing but radio fragment. Sessions with EVPmaker have\nalways provided intelligent responses and results.  \n\n\n\n--- In EVP-ITC@yahoogroups.com, juli velazquez &lt;ghostchasingfool@...&gt;\nwrote:\n&gt;\n&gt; Nice to see your back in the swing of things!!!\n&gt; \n&gt; babiarz3 &lt;babiarz3@...&gt; wrote:          Here are a few links to some\nof Chris&#39; public sessions with the Box.\n&gt; These files are easy enough to find. I was going to put more but...\n&gt; \n&gt; http://www.hauntedtimes.com/c2c.html (includes Edison EVP)\n&gt; http://www.hauntedtimes.com/cpg132/thumbnails.php?album=24 (go thru\n&gt; the pages here, many are from the TTTD)\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Lisby &lt;lisby@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Robin-- I have watched this clip and it is the least convincing of \n&gt; &gt; all the ones I have seen of him with the box. I have heard several \n&gt; &gt; where some of the audio is clear enough to stand on its own without \n&gt; &gt; his interpretation, and where his interpretation generally agrees. I \n&gt; &gt; have also heard some where the audio I hear disagrees with his \n&gt; &gt; interpretation, but not to such a high degree that I was overtly \n&gt; &gt; troubled by it--it was in what I would call the high-end of my \n&gt; &gt; tolerance range for subjectivity. I have heard audio where the \n&gt; &gt; person asking questions of the box clearly heard answered that \n&gt; &gt; appeared to move them greatly without dependance on Chris&#39;s \n&gt; &gt; interpretation.\n&gt; &gt; \n&gt; &gt; So, to try to sum up for you, my personal investigation led me to \n&gt; &gt; believe that something was happening with the box. I did not always \n&gt; &gt; agree with Chris&#39;s interpretation, but it appeared the same or close \n&gt; &gt; to what I heard a high enough percentage of the time that I was \n&gt; &gt; willing to accept he was not faking it, but giving it an honest \n&gt; &gt; enough go. It led me to start hounding Frank for a box of my own, and \n&gt; &gt; later to buy a minibox from Rick, since poor Frank was beset on all \n&gt; &gt; sides. ;)\n&gt; &gt; \n&gt; &gt; We&#39;ve already had some spectacularly burning arguments about what \n&gt; &gt; Chris claims his guides or technicians tell him behind closed doors. \n&gt; &gt; As far as I know, no audio of this is public, so his claims can&#39;t be \n&gt; &gt; evaluated. I think the proliferation of people getting results with \n&gt; &gt; the boxes belies his assertion that only 30 are chosen.\n&gt; &gt; \n&gt; &gt; Ann\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; On Dec 30, 2007, at 11:09 PM, Robin Henson wrote:\n&gt; &gt; \n&gt; &gt; &gt; I think some of you were discussing this recently, but I&#39;m wondering\n&gt; &gt; &gt; what you all think. I&#39;ve watched/listened to this video a number of\n&gt; &gt; &gt; times and can&#39;t figure out if the participants are actually hearing\n&gt; &gt; &gt; responses on their own or are totally relying on Chris to interpret \n&gt; &gt; &gt; for\n&gt; &gt; &gt; them what is being said. I&#39;m disappointed because I honestly can&#39;t\n&gt; &gt; &gt; hear the words he&#39;s repeating as being from spirit.\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; http://www.youtube.com/watch?v=T-wQZ7FU2Vc\n&gt; &gt; &gt;\n&gt; &gt; &gt; Robin\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt; \n&gt; \n&gt; \n&gt;                          \n&gt; \n&gt; \n&gt;   The contents of this eletronic correspondence is private &\nconfidential and meant only for the party and/or parties it is\naddressed to.  \n&gt;    \n&gt;   No part of this email transmission may be publicly posted or\nforwarded to other parties without explicit written permission.\n&gt;"}