{"id": "4769", "subject": "Re: New files in my Radio Shack Box Folder", "author": "Steve Hultay", "timestamp": "2008-01-02T03:44:58Z", "full_text": "There is no pulsing on the older style 12-470, just clear \ncommunication.  My 12-469 is sitting in the corner and i&#39;ll probably \nnever touch it again because that constant pulse noise is very \ndistracting to get past to hear any audible messages.  That&#39;s just my \npersonal opinion anyway for what it&#39;s worth.  If you listen to my \nradio shack files from today you will hear the difference between the \ntwo boxes.  The sweep between the two are both linear, but one has \nthe pulse sound and one is just a clean sweep without the pulse.  Ask \nyour local radio shack if they have any 12-470 older style models, \nthey are gray with a white top and also has a built in speaker.  The \nnew 470 is all black and can&#39;t be modified as of yet but i think Mike \nC. could figure it out if he didn&#39;t have 500 other projects going at \nthe same time....lol  Any questions just shoot me an e-mail and i \nwill help the best i can.\n\n-Steve H.\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;babiarz3&quot; &lt;babiarz3@...&gt; wrote:\n&gt;\n&gt; \n&gt; Steve, hope your holidays were wonderful. We haven&#39;t had the chance \nto\n&gt; speak in a few weeks.\n&gt; What are the difference in the 469 and the 470 besides 2 channel vs.\n&gt; 4? You are still choosing one channel and it is still a linear sweep\n&gt; right? Technically, what would be the difference in choosing AM on \nthe\n&gt; 469 and AM on the 470? The pulsing sound is absolutely annoying. \n&gt; \n&gt; Babs \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Steve Hultay&quot; &lt;urkel23@&gt; wrote:\n&gt; &gt;\n&gt; &gt; \n&gt; &gt; Had a pretty good session today, i&#39;ve been pretty blocked with \nother \n&gt; &gt; boxes yet i seem to always get great results with the RS 12-470.  \nSome \n&gt; &gt; really good responses to my questions.  Hey babs, i think you \nshould \n&gt; &gt; give the RS box a little time and maybe you will start to get \nstuff.  \n&gt; &gt; Although i have a 12-469 also and it really sux compared to the \n12-\n&gt; &gt; 470.  The constant pulsing noise in the 469 model just drives me \ncrazy \n&gt; &gt; enough to not concentrate.  Try looking for an older style model \nof the \n&gt; &gt; 12-470, that&#39;s probably the best radio i own hands down.  Instant \n&gt; &gt; results always and consistently.  All my boxes work, but they are \n&gt; &gt; finicky sometimes.  No need to comment to my posted files guys, \njust \n&gt; &gt; listen and see if i&#39;m on some sort of a right track with the \n&gt; &gt; communication.\n&gt; &gt; \n&gt; &gt; -Steve H.\n&gt; &gt;\n&gt;"}