{"id": "4777", "subject": "Re: New files in my Radio Shack Box Folder", "author": "Frank Sumption", "timestamp": "2008-01-02T04:47:28Z", "full_text": "It&#39;s been my experience that the darkside will harrass when there&#39;s \nsomething they don&#39;t want you to use. \n\n Frank-s\n\n--- In EVP-ITC@yahoogroups.com, &quot;Steve Hultay&quot; &lt;urkel23@...&gt; wrote:\n&gt;\n&gt; Yeah, everytime i ask which box i should be using they always say \n&gt; Joe&#39;s Box.  I believe that box become the portal to hell for me so \ni \n&gt; stay away or at least for now anyway.  Reception is never a problem \n&gt; for me, but not all devices work well everyday.  Frank&#39;s box #27 is \n&gt; very noisy but always gives me very direct answers to my questions \n&gt; everytime.  All of them have given me great results at some point \nand \n&gt; when newer stuff comes out i will try them too.  Never get stuck on \n&gt; one particular method or box, you have to mix it up all the time to \n&gt; get different responses.  Some days i just feel like doing a manual \n&gt; sweep, it&#39;s always different.  If i can get the Minibox to give me \n&gt; real time answers than that would be the best because of the \nclarity \n&gt; of the radio.  The minibox is so clear to listen to, but you have \nto \n&gt; go over it with headphones and patience to find out the answers.  \nThe \n&gt; answers are there though, so maybe i just have to get used to the \nway \n&gt; it works a little better.\n&gt; \n&gt; -Steve H.\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, juli velazquez &lt;ghostchasingfool@&gt; \n&gt; wrote:\n&gt; &gt;\n&gt; &gt; It funny just how they know what box&#39;s your using.  I started \nwith \n&gt; the 469 first, they told me to switch to the 470 and the reception \n&gt; stunk, so we switch back.  I alway ask them, which reception is \n&gt; better on the otherside.\n&gt; &gt;    \n&gt; &gt;   Juli\n&gt; &gt; \n&gt; &gt; Steve Hultay &lt;urkel23@&gt; wrote:\n&gt; &gt;           \n&gt; &gt; Had a pretty good session today, i&#39;ve been pretty blocked with \n&gt; other \n&gt; &gt; boxes yet i seem to always get great results with the RS 12-470. \n&gt; Some \n&gt; &gt; really good responses to my questions. Hey babs, i think you \nshould \n&gt; &gt; give the RS box a little time and maybe you will start to get \n&gt; stuff. \n&gt; &gt; Although i have a 12-469 also and it really sux compared to the \n12-\n&gt; &gt; 470. The constant pulsing noise in the 469 model just drives me \n&gt; crazy \n&gt; &gt; enough to not concentrate. Try looking for an older style model \nof \n&gt; the \n&gt; &gt; 12-470, that&#39;s probably the best radio i own hands down. Instant \n&gt; &gt; results always and consistently. All my boxes work, but they are \n&gt; &gt; finicky sometimes. No need to comment to my posted files guys, \njust \n&gt; &gt; listen and see if i&#39;m on some sort of a right track with the \n&gt; &gt; communication.\n&gt; &gt; \n&gt; &gt; -Steve H.\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt;                          \n&gt; &gt; \n&gt; &gt; \n&gt; &gt;   The contents of this eletronic correspondence is private & \n&gt; confidential and meant only for the party and/or parties it is \n&gt; addressed to.  \n&gt; &gt;    \n&gt; &gt;   No part of this email transmission may be publicly posted or \n&gt; forwarded to other parties without explicit written permission.\n&gt; &gt;\n&gt;"}