{"id": "4778", "subject": "Re: Chris Moon/Frank&#39;s Box on YouTube", "author": "Frank Sumption", "timestamp": "2008-01-02T04:51:49Z", "full_text": "Thanks! No, it&#39;s not a failure, that was the wrong word, but it&#39;s \ndisappointing that the system audio isn&#39;t clearer. \n\n Frank-S\n\n--- In EVP-ITC@yahoogroups.com, &quot;Robin Searcy Henson&quot; \n&lt;MudPuddleFarm@...&gt; wrote:\n&gt;\n&gt; Frank, I&#39;ve been impressed with your work since I was first made \naware of it several years ago.  I didn&#39;t mean to infer there was a \nproblem with the box, but rather was questioning the interpretation \nof the person using it.  You&#39;re anything but a failure, and my \ninability to hear what he hears is certainly no reflection on you.  \nI&#39;ve heard amazing stuff out of your contraptions, so I know it&#39;s \nreal and it works.  So much of this is subjective though.  The one \nEVP I consider my most profound success is inaudible to everyone I&#39;ve \nplayed it for.  Sometimes I feel like I&#39;ll go crazy because it&#39;s so \nabsolutely clear to me--How is it possible that no one else can hear \nit??  I also agree that the most success in this field will come from \ngood intentions and a pure heart, because this is spiritual work as \nmuch as it is scientific.  Just wanted to say I appreciate and admire \nyou.\n&gt; \n&gt; Robin\n&gt; \n&gt; \n&gt;   ----- Original Message ----- \n&gt;   From: Jason Lewis&lt;mailto:immortallic2@...&gt; \n&gt;   To: EVP-ITC@yahoogroups.com&lt;mailto:EVP-ITC@...m&gt; \n&gt;   Sent: Monday, December 31, 2007 8:26 PM\n&gt;   Subject: Re: [EVP-ITC] Re: Chris Moon/Frank&#39;s Box on YouTube\n&gt; \n&gt; \n&gt;   Agreed...\n&gt; \n&gt;   Lisby &lt;lisby@...&lt;mailto:lisby@...&gt;&gt; wrote: \n&gt; \n&gt;     Let&#39;s not let our heads get too swollen, tho, Jason. ;) \n&gt; \n&gt; \n&gt;     Ann\n&gt; \n&gt; \n&gt; \n&gt; \n&gt;     On Dec 31, 2007, at 10:09 PM, Jason Lewis wrote:\n&gt; \n&gt; \n&gt; \n&gt; \n&gt;       Frank,\n&gt;       To someone that we all look up to as an insperation I can say \nthat you can make the best box ever and the results might just depend \non the person or user of the product...\n&gt;       Keep working in this direction, keep being a good person.  \nRemember one thing, we are the light in the darkness!  There will \nalways be people that will try to rain on OUR parade.  We have to be \nthe voice of reason so WE can move forward.  This is not about us!  \nIts about TRUTH and the light and research.  Thanks for everything \nyou have done and continue to do!!\n&gt;       I think personally that these devices work best when the user \nis not using the device for personal gain, but for everyones best \nintrests!!\n&gt; \n&gt;       Happy New Year!\n&gt; \n&gt;       Frank Sumption &lt;franks-boxes@...&gt; wrote:\n&gt;         I don&#39;t know if maybe the audio pick up from the box wasn&#39;t \nvery good, \n&gt;         but I can&#39;t make out much of that either. It sounds like \nthe recordings \n&gt;         I do with a cell phone. I think you&#39;d have to be there to \njudge it. \n&gt; \n&gt;         Personally I&#39;m always disappointed at my stuff being out \nthere, and \n&gt;         the incredible lack of clarity obatained with it, to me \nthat&#39;s a huge \n&gt;         failure! I know the stuff works, but how to get it to a \nlevel that can \n&gt;         be understood by most, that&#39;s the problem, and my focus at \nthe moment. \n&gt;         The Mini Box is big step in that direction, so some of the \npressure if \n&gt;         off, but I still need to get my boxes to professional \nlevel. \n&gt; \n&gt;         Frank-S\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; --------------------------------------------------------------------\n------\n&gt;       Be a better friend, newshound, and know-it-all with Yahoo! \nMobile. Try it \nnow.&lt;http://us.rd.yahoo.com/evt=51733/*http://mobile.yahoo.com/;_ylt=A\nhu06i62sR8HDtDypao8Wcj9tAcJ&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; --------------------------------------------------------------------\n----------\n&gt;   Looking for last minute shopping deals? Find them fast with \nYahoo! \nSearch.&lt;http://us.rd.yahoo.com/evt=51734/*http://tools.search.yahoo.co\nm/newsearch/category.php?category=shopping&gt;\n&gt;"}