{"id": "4820", "subject": "Re: [EVP-ITC] The &#39;470 mod?", "author": "Debbie Tejada", "timestamp": "2008-01-02T17:33:33Z", "full_text": "Frank, Thanks for the extra instructions, it doesn&#39;t sound too  \ndifficult for me so I&#39;ll give it a shot.\n\nBy the way, I did listen to your tone control clip. Since I&#39;m new to  \nthis my comments are probably not &quot;worth&quot; much at this point. I  \nthought the entire clip itself was a lot smoother and clearer than  \nmost I&#39;ve heard so far from various sources (the mixed station sounds  \nare in smaller pieces so for someone like me it would be easier to  \npick out the EVPs as opposed to entire words from radio announcers).  \nThe short piece about 2/3 of the way through, where I&#39;m guessing you  \nused a clarifier, sounded muffled to me, which makes me think it would  \nalso muffle the EVPs. Definitely easier on the ears but for someone  \ninexperienced (and I seem to be the only one here!) it seems it would  \nbe harder to pick out the real words too.\n\nBy the way, in listening to the deluge of clips uploaded last night, I  \ncan&#39;t help but notice that the voices are all men. Just curious -- is  \nthat always the case?\n_ _ _ _ _ _ _ _\n\nDebbie Tejada\n\n&quot;Once you can accept the universe as matter expanding into nothing  \nthat is something, wearing stripes with plaid comes easy. &quot;  ~Albert  \nEinstein\n\nOn Jan 2, 2008, at 10:22 AM, Frank Sumption wrote:\n\n&gt;  I have the &#39;470, but I don&#39;t know if it&#39;s the older one or not. I  \n&gt; was able to modify it, but it was somewhat different than in the  \n&gt; video instruction, there was more than one green wire. You have to  \n&gt; lift the top board so you can see the wire connections on the other  \n&gt; board, they are labeled, and you can tell what wire to cut/ \n&gt; unsolder.  (mute wire).\n&gt;\n&gt;  Frank-S\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Share life as it happens with the new Windows Live. Share now!\n&gt;\n&gt; \n\n\nF ank, Thanks o he ex a ins uc ions, i doesn' sound oo di icul o me so I'll gi e i a sho .By he way, I did lis en o you one con ol clip. Since I'm new o his my commen s a e p obably no \"wo h\" much a his poin . I hough he en i e clip i sel was a lo smoo he and clea e han mos I' e hea d so a om a ious sou ces ( he mixed s a ion sounds a e in smalle pieces so o someone like me i would be easie o pick ou he EVPs as opposed o en i e wo ds om adio announce s). The sho piece abou 2/3 o he way h ough, whe e I'm guessing you used a cla i ie , sounded mu led o me, which makes me hink i would also mu le he EVPs. De ini ely easie on he ea s bu o someone inexpe ienced (and I seem o be he only one he e!) i seems i would be ha de o pick ou he eal wo ds oo.By he way, in lis ening o he deluge o clips uploaded las nigh , I can' help bu no ice ha he oices a e all men. Jus cu ious -- is ha always he case? _ _ _ _ _ _ _ _Debbie Tejada\"Once you can accep he uni e se as ma e expanding in o no hing ha is some hing, wea ing s ipes wi h plaid comes easy. \"  ~Albe Eins ein On Jan 2, 2008, a 10:22 AM, F ank Sump ion w o e: I ha e he '470, bu I don' know i i 's he olde one o no . I was able o modi y i , bu i was somewha di e en han in he ideo ins uc ion, he e was mo e han one g een wi e. You ha e o li he op boa d so you can see he wi e connec ions on he o he boa d, hey a e labeled, and you can ell wha wi e o cu /unsolde .  (mu e wi e).   F ank-SSha e li e as i happens wi h he new Windows Li e. Sha e now!"}