{"id": "4830", "subject": "Re: [EVP-ITC] For bruce:", "author": "Lisby", "timestamp": "2008-01-02T23:41:51Z", "full_text": "That isn&#39;t his dad--it&#39;s Mike, his guide.\n\nWhat you&#39;re hearing are artifacts of the sound clean-up program that  \nmakes the voices more audible.\n\nThese are not EVPs, they are realtime communication. They are heard  \nout loud as they happen. That&#39;s what boxes do--they allow two-way  \nreal-time exchange between us and them.\n\nAnn\n\nOn Jan 2, 2008, at 4:16 PM, DAna wrote:\n\n&gt; Now I am sure you arent aware of who I am being, noone else other\n&gt; than misty welcomed me to this group. Being I am not professional at\n&gt; e.v.p.s but yet have gone through listening to many of them from\n&gt; trustful resources, your e.v.p.s make me a bit leery. NOt trying to\n&gt; be rude, so dont go get all upset right off the bat. In your e.v.p.s,\n&gt; this one especially, alot of them sound like you, not the part where\n&gt; you asking questions, but where your dad is supposively answering\n&gt; you. NOw everyone has their own right to opinion so there is now need\n&gt; to get defensive, if all is real there would be nothing to get mad\n&gt; about. I just cant help but notice how odd it is that your e.v.p.\n&gt; questions to your father, seems to answer right away when you ask the\n&gt; question. Also, i notice that after you ask the question i hear\n&gt; something being turned on that has contains the answer to that\n&gt; question. Whether it be your dad or not. I feel its you that is\n&gt; answering, but let me tell you why i figure this.. and please you\n&gt; would like to defend you side of things that would be great, maybe i\n&gt; would be able to change my opinion on the matter. But as of now,\n&gt; e.v.p.s are usually done on the same tape that the questions are on,\n&gt; then in a rewind you can hear you and the e.v.p. but to me it sound\n&gt; like you put the e.v.p. response on another tape. i am not trying to\n&gt; start any kind of fight or be cruel, maybe i could learn something on\n&gt; behalf of how you do your work... thank you\n&gt;\n&gt;\n&gt; \n\n\nTha isn' his dad--i 's Mike, his guide.Wha you' e hea ing a e a i ac s o he sound clean-up p og am ha makes he oices mo e audible.These a e no EVPs, hey a e eal ime communica ion. They a e hea d ou loud as hey happen. Tha 's wha boxes do-- hey allow wo-way eal- ime exchange be ween us and hem.AnnOn Jan 2, 2008, a 4:16 PM, DAna w o e:Now I am su e you a en awa e o who I am being, noone else o he   han mis y welcomed me o his g oup. Being I am no p o essional a  e. .p.s bu ye ha e gone h ough lis ening o many o hem om  us ul esou ces, you e. .p.s make me a bi lee y. NO ying o be ude, so don go ge all upse igh o he ba . In you e. .p.s,  his one especially, alo o hem sound like you, no he pa whe e you asking ques ions, bu whe e you dad is supposi ely answe ing you. NOw e e yone has hei own igh o opinion so he e is now need  o ge de ensi e, i all is eal he e would be no hing o ge mad abou . I jus can help bu no ice how odd i is ha you e. .p. ques ions o you a he , seems o answe igh away when you ask he ques ion. Also, i no ice ha a e you ask he ques ion i hea  some hing being u ned on ha has con ains he answe o ha  ques ion. Whe he i be you dad o no . I eel i s you ha is answe ing, bu le me ell you why i igu e his.. and please you would like o de end you side o hings ha would be g ea , maybe i would be able o change my opinion on he ma e . Bu as o now, e. .p.s a e usually done on he same ape ha he ques ions a e on,  hen in a ewind you can hea you and he e. .p. bu o me i sound like you pu he e. .p. esponse on ano he ape. i am no ying o s a any kind o igh o be c uel, maybe i could lea n some hing on behal o how you do you wo k... hank you"}