{"id": "4833", "subject": "RS 470", "author": "Debbie Tejada", "timestamp": "2008-01-02T20:00:37Z", "full_text": "Thanks all for the info on the 470. I did call the RS 800 number and  \nthe person I spoke with could not guarantee that the radio pictured on  \ntheir web site would be the one that ships (it&#39;s a photo of the old  \nmodel). Confusing -- he said that he&#39;s in Louisville and the warehouse  \nis in Kentucky and so he couldn&#39;t physically check himself or contact  \nsomeone in the warehouse. The last time I looked at a map, I could  \nhave sworn Louisville was in Kentucky.\n\nIf anyone comes across the old 470 in your travels, please keep me in  \nmind. I&#39;ll continue to look myself.\n\nAny suggestions for another good hack? I did hear the clicking on the  \n469(?) and it is too much.\n_ _ _ _ _ _ _ _\n\nDeb T\n\n&quot;Once you can accept the universe as matter expanding into nothing  \nthat is something, wearing stripes with plaid comes easy. &quot;  ~Albert  \nEinstein\n\nOn Jan 2, 2008, at 10:46 AM, bruce halliday wrote:\n\n&gt; Deb,\n&gt;\n&gt; The old model of the 470 is now like hens teeth I doubt very much if  \n&gt; you will be able to find one\n&gt; If I come across one I will let you know.\n&gt;\n&gt; You may want to ask at your local radio shack if they would call  \n&gt; other stores and see if any of them have any in stock\n&gt; I did that and wound up with 8 that promptly got snatched up by new  \n&gt; researchers.\n&gt;\n&gt; If you can not get the older 470 maybe you can find the old model  \n&gt; 469 which looks exactly like the old 470 but the difference\n&gt; between the old and new model 469 is that the older model does not  \n&gt; have that annoying clicking. It scans smoothly.\n&gt;\n&gt; I am attaching a pic of the old model 470 make sure you tell the  \n&gt; person at RS you want the one in the box not the see through\n&gt; package.\n&gt;\n&gt; If you want to check out my box site it&#39;s http://free-paranormalinvestigating.com/franksboxjoesbox/\n&gt;\n&gt; Bruce\n&gt;\n&gt;\n&gt;\n&gt; Bruce Halliday\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; From: debbie@...\n&gt; Date: Wed, 2 Jan 2008 10:12:08 -0700\n&gt; Subject: Re: [EVP-ITC] Re: New files in my Radio Shack Box Folder\n&gt;\n&gt; Steve (or anyone else who knows about this),\n&gt;\n&gt; The\n&gt; new 470 is all black and can&#39;t be modified as of yet\n&gt;\n&gt; Based on your comments about the 12-469, I&#39;m going to pick up a  \n&gt; 12-470 later today. I called our local Radio Shack and the guy  \n&gt; insisted that the new 12-470 is exactly the same as the old one,  \n&gt; just the case is a different color (grey & black). I specifically  \n&gt; asked if the electronics were set up the same way and he said yes,  \n&gt; they&#39;re exactly the same. Do you suppose he&#39;s right about that? Or  \n&gt; just doesn&#39;t know the product that well?\n&gt; _ _ _ _ _ _ _ _\n&gt;\n&gt; Debbie Tejada\n&gt;\n&gt;\n&gt; &#39;Once you can accept the universe as matter expanding into nothing  \n&gt; that is something, wearing stripes with plaid comes easy. &#39;  ~Albert  \n&gt; Einstein\n&gt;\n&gt; On Jan 1, 2008, at 8:44 PM, Steve Hultay wrote:\n&gt;\n&gt; There is no pulsing on the older style 12-470, just clear\n&gt; communication. My 12-469 is sitting in the corner and i&#39;ll probably\n&gt; never touch it again because that constant pulse noise is very\n&gt; distracting to get past to hear any audible messages. That&#39;s just my\n&gt; personal opinion anyway for what it&#39;s worth. If you listen to my\n&gt; radio shack files from today you will hear the difference between the\n&gt; two boxes. The sweep between the two are both linear, but one has\n&gt; the pulse sound and one is just a clean sweep without the pulse. Ask\n&gt; your local radio shack if they have any 12-470 older style models,\n&gt; they are gray with a white top and also has a built in speaker. The\n&gt; new 470 is all black and can&#39;t be modified as of yet but i think Mike\n&gt; C. could figure it out if he didn&#39;t have 500 other projects going at\n&gt; the same time....lol Any questions just shoot me an e-mail and i\n&gt; will help the best i can.\n&gt;\n&gt; -Steve H.\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, &#39;babiarz3&#39; &lt;babiarz3@...&gt; wrote:\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Steve, hope your holidays were wonderful. We haven&#39;t had the chance\n&gt; to\n&gt; &gt; speak in a few weeks.\n&gt; &gt; What are the difference in the 469 and the 470 besides 2 channel vs.\n&gt; &gt; 4? You are still choosing one channel and it is still a linear sweep\n&gt; &gt; right? Technically, what would be the difference in choosing AM on\n&gt; the\n&gt; &gt; 469 and AM on the 470? The pulsing sound is absolutely annoying.\n&gt; &gt;\n&gt; &gt; Babs\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &#39;Steve Hultay&#39; &lt;urkel23@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; Had a pretty good session today, i&#39;ve been pretty blocked with\n&gt; other\n&gt; &gt; &gt; boxes yet i seem to always get great results with the RS 12-470.\n&gt; Some\n&gt; &gt; &gt; really good responses to my questions. Hey babs, i think you\n&gt; should\n&gt; &gt; &gt; give the RS box a little time and maybe you will start to get\n&gt; stuff.\n&gt; &gt; &gt; Although i have a 12-469 also and it really sux compared to the\n&gt; 12-\n&gt; &gt; &gt; 470. The constant pulsing noise in the 469 model just drives me\n&gt; crazy\n&gt; &gt; &gt; enough to not concentrate. Try looking for an older style model\n&gt; of the\n&gt; &gt; &gt; 12-470, that&#39;s probably the best radio i own hands down. Instant\n&gt; &gt; &gt; results always and consistently. All my boxes work, but they are\n&gt; &gt; &gt; finicky sometimes. No need to comment to my posted files guys,\n&gt; just\n&gt; &gt; &gt; listen and see if i&#39;m on some sort of a right track with the\n&gt; &gt; &gt; communication.\n&gt; &gt; &gt;\n&gt; &gt; &gt; -Steve H.\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Don&#39;t get caught with egg on your face. Play Chicktionary! Check it  \n&gt; out!\n&gt;\n&gt;  &lt;RS_12-470.jpg&gt;\n\n\nThanks all o he in o on he 470. I did call he RS 800 numbe and he pe son I spoke wi h could no gua an ee ha he adio pic u ed on hei web si e would be he one ha ships (i 's a pho o o he old model). Con using -- he said ha he's in Louis ille and he wa ehouse is in Ken ucky and so he couldn' physically check himsel o con ac someone in he wa ehouse. The las ime I looked a a map, I could ha e swo n Louis ille was in Ken ucky.I anyone comes ac oss he old 470 in you a els, please keep me in mind. I'll con inue o look mysel .Any sugges ions o ano he good hack? I did hea he clicking on he 469(?) and i is oo much. _ _ _ _ _ _ _ _Deb T\"Once you can accep he uni e se as ma e expanding in o no hing ha is some hing, wea ing s ipes wi h plaid comes easy. \"  ~Albe Eins ein On Jan 2, 2008, a 10:46 AM, b uce halliday w o e:Deb, The old model o he 470 is now like hens ee h I doub e y much i you will be able o ind oneI I come ac oss one I will le you know. You may wan o ask a you local adio shack i hey would call o he s o es and see i any o hem ha e any in s ockI did ha and wound up wi h 8 ha p omp ly go sna ched up by new esea che s. I you can no ge he olde 470 maybe you can ind he old model 469 which looks exac ly like he old 470 bu he di e encebe ween he old and new model 469 is ha he olde model does no ha e ha annoying clicking. I scans smoo hly. I am a aching a pic o he old model 470 make su e you ell he pe son a RS you wan he one in he box no he see h oughpackage. I you wan o check ou my box si e i 's h p:// ee-pa ano malin es iga ing.com/ anksboxjoesbox/ B uceB uce Halliday To: EVP-ITC@yahoog oups.comF om: debbie@ ejadadesign.comDa e: Wed, 2 Jan 2008 10:12:08 -0700Subjec : Re: [EVP-ITC] Re: New iles in my Radio Shack Box Folde S e e (o anyone else who knows abou his),The new 470 is all black and can' be modi ied as o ye  Based on you commen s abou he 12-469, I'm going o pick up a 12-470 la e oday. I called ou local Radio Shack and he guy insis ed ha he new 12-470 is exac ly he same as he old one, jus he case is a di e en colo (g ey & black). I speci ically asked i he elec onics we e se up he same way and he said yes, hey' e exac ly he same. Do you suppose he's igh abou ha ? O jus doesn' know he p oduc ha well?_ _ _ _ _ _ _ _Debbie Tejada'Once you can accep he uni e se as ma e expanding in o no hing ha is some hing, wea ing s ipes wi h plaid comes easy. '  ~Albe Eins einOn Jan 1, 2008, a 8:44 PM, S e e Hul ay w o e:The e is no pulsing on he olde s yle 12-470, jus clea  communica ion. My 12-469 is si ing in he co ne and i'll p obably ne e ouch i again because ha cons an pulse noise is e y dis ac ing o ge pas o hea any audible messages. Tha 's jus my pe sonal opinion anyway o wha i 's wo h. I you lis en o my  adio shack iles om oday you will hea he di e ence be ween he  wo boxes. The sweep be ween he wo a e bo h linea , bu one has  he pulse sound and one is jus a clean sweep wi hou he pulse. Ask you local adio shack i hey ha e any 12-470 olde s yle models,  hey a e g ay wi h a whi e op and also has a buil in speake . The new 470 is all black and can' be modi ied as o ye bu i hink Mike C. could igu e i ou i he didn' ha e 500 o he p ojec s going a   he same ime....lol Any ques ions jus shoo me an e-mail and i will help he bes i can.-S e e H.--- In EVP-ITC@yahoog oups.com, 'babia z3' .> w o e:>> > S e e, hope you holidays we e wonde ul. We ha en' had he chance  o> speak in a ew weeks.> Wha a e he di e ence in he 469 and he 470 besides 2 channel s.> 4? You a e s ill choosing one channel and i is s ill a linea sweep> igh ? Technically, wha would be he di e ence in choosing AM on  he> 469 and AM on he 470? The pulsing sound is absolu ely annoying. > > Babs > > > --- In EVP-ITC@yahoog oups.com, 'S e e Hul ay' w o e:> >> > > > Had a p e y good session oday, i' e been p e y blocked wi h o he  > > boxes ye i seem o always ge g ea esul s wi h he RS 12-470. Some > > eally good esponses o my ques ions. Hey babs, i hink you should > > gi e he RS box a li le ime and maybe you will s a o ge  s u . > > Al hough i ha e a 12-469 also and i eally sux compa ed o he 12-> > 470. The cons an pulsing noise in he 469 model jus d i es me c azy > > enough o no concen a e. T y looking o an olde s yle model o he > > 12-470, ha 's p obably he bes adio i own hands down. Ins an  > > esul s always and consis en ly. All my boxes wo k, bu hey a e > > inicky some imes. No need o commen o my pos ed iles guys, jus  > > lis en and see i i'm on some so o a igh ack wi h he > > communica ion.> > > > -S e e H.> >>Don' ge caugh wi h egg on you ace. Play Chick iona y! Check i ou !"}