{"id": "4834", "subject": "Re: Babs", "author": "LC Duplatt", "timestamp": "2008-01-03T00:03:16Z", "full_text": "I wanted to say hello, Babs, as my cousin shared a lot with me about \nhis paranormal friends in Atlanta.\n\nJuli, I agree.  The box will prove it to the user...or should we say \nthe spirits via the box will make a believer out of the user.  I kept \nhearing a couple of my names being repeated, my wife&#39;s name, etc.  \nThe gifting of the user also may play a critical part.\n\nLC\n\n--- In EVP-ITC@yahoogroups.com, juli velazquez &lt;ghostchasingfool@...&gt; \nwrote:\n&gt;\n&gt; Babs to answer you question, I believe that they can see us as well \nas hear us.  I have attached a file where they repeatedly ask for me \nby name (which could not be the radio, given the odds the radio would \nnot be saying my name over and over quickly).  The final message was \nconference call at the end of the clip.  At that time, I was actually \ngetting a conference call from Bruce and Steve via Skype and I had no \nway of knowing since the conference call came through on my other \nlaptop in my office.\n&gt;    \n&gt;   On another session, one of my Daughter&#39;s walked into my office \nand upon entry (never speaking a word) they said &quot;Hello Alexxis&quot;.  \nThis actually freaked her out.  She never said anything but yet they \nacknowledged her presences as she walked in the room.  Once again \nwhat are the odds that you would get all of my members of my families \nnames correct that happen to be in the room during a session?  \n&gt;    \n&gt;   Juli\n&gt;    \n&gt;   \n&gt; \n&gt; babiarz3 &lt;babiarz3@...&gt; wrote:\n&gt;           Hi LC. Yes, I am Babs from Atlanta and co-founder of The \nPsi Network.\n&gt; Jim had mentioned you a while back so when you signed up here I know\n&gt; who you were. I have listened to your files, the &quot;Gino&quot; one was\n&gt; interesting. \n&gt; \n&gt; Jim brought the 469 to a holiday party here at my house a few weeks\n&gt; ago. It did seem as if we were getting answers that I found \nincredibly\n&gt; easy to understand. Unfortunately we had all had cocktails so I knew\n&gt; it was no where near objective. Two days later I made the purchase \nand\n&gt; completed the hack. \n&gt; \n&gt; I have had several unsuccessful sessions which frankly (pardon the\n&gt; pun) is what I expected. My goal is to make a determination based on\n&gt; my trials. After the initial party session, subsequent sessions have\n&gt; been done by me alone. The next step for me will be to bring in a\n&gt; group of people who will make notations (non-verbal) as to what they\n&gt; think they hear. I&#39;m doing this because I believe strongly in the\n&gt; effects of energy and people on these devices. The non-verbal\n&gt; notations need no further explanations. I will also place people \nwhere\n&gt; they can&#39;t see if someone is writing something. \n&gt; \n&gt; On a recent post of Juli&#39;s (I believe) she mentions hearing Bruce \nand\n&gt; Steve&#39;s voices coming through her device. If that&#39;s the case then I\n&gt; think a lot more objective study is needed, in particular with the \nRS\n&gt; versions and the mini-box (those using linear sweep methods). Now\n&gt; don&#39;t get me wrong here... I have heard compelling files from these \nLS\n&gt; models. However, we all know the inherent problems with naming files\n&gt; what we think we hear. The listener than expects to hear the same\n&gt; thing and typically does. Also, I have heard files that seem to be a\n&gt; direct, intelligent response to the question asked but what I would\n&gt; like to see is the question asker request a certain word to be \nspoken\n&gt; and have that happen within a certain time frame. We should be able \nto\n&gt; say &quot;Say Bruce or Babs or Steve....&quot; and have that happen rather\n&gt; quickly. A list of control questions could easily be developed that\n&gt; would add to the credibility of these devices and could only help\n&gt; research move forward. Has anyone asked whether or not the spirits\n&gt; could see us as well as hear us? If the answer is yes than that \nleads\n&gt; to a whole other set of questions whose answers could easily be \nverified. \n&gt; \n&gt; I realize that the majority here are not interested in the idea of\n&gt; disproving but I think it needs to be done. Controlled study is a\n&gt; necessity. \n&gt; \n&gt; Babs\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;LC Duplatt&quot; &lt;lcdupla@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Babs,\n&gt; &gt; \n&gt; &gt; Are you out of the Atlanta area? If so are you from PSI? My \ncousin \n&gt; &gt; Jim is in PSI, and purchased a 469 for the group. He had heard \nsome \n&gt; &gt; of my initial recordings of experiments I ran for audio set-up. \nThey \n&gt; &gt; were recorded with the 469, and did not come through until the \n5th \n&gt; &gt; test for me. It was as if the mish mash began being manipulated \nand \n&gt; &gt; I could then hear responses. The recordings are under LC&#39;s... in \nthe \n&gt; &gt; file section. I currently have two 470&#39;s which will be \nexperimented \n&gt; &gt; with after the holidays...\n&gt; &gt; \n&gt; &gt; The more you work with the box, the more those on the other side \n&gt; &gt; become aware of one&#39;s attempts at making contact, IMHO. For me, I \n&gt; &gt; can feel a spiritual presence when the audio bits/white noise \nbegin \n&gt; &gt; being manipulated. When in doubt, just keep making \n&gt; &gt; recordings...sooner or later you will begin hearing words, \nresponses, \n&gt; &gt; sentences. Some of what I heard has been quite crafty, such as \n&gt; &gt; giving me my wife&#39;s name clearly, right before she phoned me, etc.\n&gt; &gt; \n&gt; &gt; LC\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;babiarz3&quot; &lt;babiarz3@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; Thanks Juli, it&#39;s nice to be back. Holiday times always get so \n&gt; &gt; hectic.\n&gt; &gt; &gt; \n&gt; &gt; &gt; On a side note here- I&#39;ve been working with a 469 shack hack \nand \n&gt; &gt; have\n&gt; &gt; &gt; yet to get anything I can consider a direct response or \nintelligible\n&gt; &gt; &gt; communication. IMO, thus far, I hear nothing besides radio \n&gt; &gt; fragments.\n&gt; &gt; &gt; Going on the theory that this device enables the same real time \n2-\n&gt; &gt; way\n&gt; &gt; &gt; communication as Frank&#39;s Box or it&#39;s &quot;children&quot;, requesting \nthat my\n&gt; &gt; &gt; own name be said doesn&#39;t seem like it should be a difficult \ntask. I\n&gt; &gt; &gt; have even told them my name, as a just-in-case measure. Nothing \neven\n&gt; &gt; &gt; resembling my name, or in name for that matter. When asked what \n&gt; &gt; their\n&gt; &gt; &gt; name is, also nothing but radio fragment. Sessions with \nEVPmaker \n&gt; &gt; have\n&gt; &gt; &gt; always provided intelligent responses and results. \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com, juli velazquez \n&lt;ghostchasingfool@&gt;\n&gt; &gt; &gt; wrote:\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Nice to see your back in the swing of things!!!\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; babiarz3 &lt;babiarz3@&gt; wrote: Here are a few links to some\n&gt; &gt; &gt; of Chris&#39; public sessions with the Box.\n&gt; &gt; &gt; &gt; These files are easy enough to find. I was going to put more \n&gt; &gt; but...\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; http://www.hauntedtimes.com/c2c.html (includes Edison EVP)\n&gt; &gt; &gt; &gt; http://www.hauntedtimes.com/cpg132/thumbnails.php?album=24 \n(go \n&gt; &gt; thru\n&gt; &gt; &gt; &gt; the pages here, many are from the TTTD)\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com, Lisby &lt;lisby@&gt; wrote:\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; Robin-- I have watched this clip and it is the least \nconvincing \n&gt; &gt; of \n&gt; &gt; &gt; &gt; &gt; all the ones I have seen of him with the box. I have heard \n&gt; &gt; several \n&gt; &gt; &gt; &gt; &gt; where some of the audio is clear enough to stand on its own \n&gt; &gt; without \n&gt; &gt; &gt; &gt; &gt; his interpretation, and where his interpretation generally \n&gt; &gt; agrees. I \n&gt; &gt; &gt; &gt; &gt; have also heard some where the audio I hear disagrees with \nhis \n&gt; &gt; &gt; &gt; &gt; interpretation, but not to such a high degree that I was \n&gt; &gt; overtly \n&gt; &gt; &gt; &gt; &gt; troubled by it--it was in what I would call the high-end of \nmy \n&gt; &gt; &gt; &gt; &gt; tolerance range for subjectivity. I have heard audio where \nthe \n&gt; &gt; &gt; &gt; &gt; person asking questions of the box clearly heard answered \nthat \n&gt; &gt; &gt; &gt; &gt; appeared to move them greatly without dependance on Chris&#39;s \n&gt; &gt; &gt; &gt; &gt; interpretation.\n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; So, to try to sum up for you, my personal investigation led \nme \n&gt; &gt; to \n&gt; &gt; &gt; &gt; &gt; believe that something was happening with the box. I did \nnot \n&gt; &gt; always \n&gt; &gt; &gt; &gt; &gt; agree with Chris&#39;s interpretation, but it appeared the same \nor \n&gt; &gt; close \n&gt; &gt; &gt; &gt; &gt; to what I heard a high enough percentage of the time that I \nwas \n&gt; &gt; &gt; &gt; &gt; willing to accept he was not faking it, but giving it an \nhonest \n&gt; &gt; &gt; &gt; &gt; enough go. It led me to start hounding Frank for a box of \nmy \n&gt; &gt; own, and \n&gt; &gt; &gt; &gt; &gt; later to buy a minibox from Rick, since poor Frank was \nbeset on \n&gt; &gt; all \n&gt; &gt; &gt; &gt; &gt; sides. ;)\n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; We&#39;ve already had some spectacularly burning arguments \nabout \n&gt; &gt; what \n&gt; &gt; &gt; &gt; &gt; Chris claims his guides or technicians tell him behind \nclosed \n&gt; &gt; doors. \n&gt; &gt; &gt; &gt; &gt; As far as I know, no audio of this is public, so his claims \n&gt; &gt; can&#39;t be \n&gt; &gt; &gt; &gt; &gt; evaluated. I think the proliferation of people getting \nresults \n&gt; &gt; with \n&gt; &gt; &gt; &gt; &gt; the boxes belies his assertion that only 30 are chosen.\n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; Ann\n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; On Dec 30, 2007, at 11:09 PM, Robin Henson wrote:\n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; &gt; I think some of you were discussing this recently, but \nI&#39;m \n&gt; &gt; wondering\n&gt; &gt; &gt; &gt; &gt; &gt; what you all think. I&#39;ve watched/listened to this video a \n&gt; &gt; number of\n&gt; &gt; &gt; &gt; &gt; &gt; times and can&#39;t figure out if the participants are \nactually \n&gt; &gt; hearing\n&gt; &gt; &gt; &gt; &gt; &gt; responses on their own or are totally relying on Chris to \n&gt; &gt; interpret \n&gt; &gt; &gt; &gt; &gt; &gt; for\n&gt; &gt; &gt; &gt; &gt; &gt; them what is being said. I&#39;m disappointed because I \nhonestly \n&gt; &gt; can&#39;t\n&gt; &gt; &gt; &gt; &gt; &gt; hear the words he&#39;s repeating as being from spirit.\n&gt; &gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; &gt; http://www.youtube.com/watch?v=T-wQZ7FU2Vc\n&gt; &gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; &gt; Robin\n&gt; &gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; The contents of this eletronic correspondence is private &\n&gt; &gt; &gt; confidential and meant only for the party and/or parties it is\n&gt; &gt; &gt; addressed to. \n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; No part of this email transmission may be publicly posted or\n&gt; &gt; &gt; forwarded to other parties without explicit written permission.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt; \n&gt; \n&gt; \n&gt;                          \n&gt; \n&gt; \n&gt;   The contents of this eletronic correspondence is private & \nconfidential and meant only for the party and/or parties it is \naddressed to.  \n&gt;    \n&gt;   No part of this email transmission may be publicly posted or \nforwarded to other parties without explicit written permission.\n&gt;"}