{"id": "4836", "subject": "Re: [EVP-ITC]", "author": "LC Duplatt", "timestamp": "2008-01-03T00:59:45Z", "full_text": "A lot more clear, Frank.  If the voices come through as clear, it is \na definite improvement.  Any messages coming through with the direct \nmethod?\n\nLC\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@...&gt; \nwrote:\n&gt;\n&gt; \n&gt;  So did anyone get a chance to listen to the one I did the tone \ncontrol test on? It&#39;s an attempt at something like a clarifier \ncontrol. It&#39;s in my folder, under the files section, and the test is \nmore toward the end of the segment. \n&gt;  \n&gt;  Frank-S\n&gt; \n&gt; \n&gt; To: evp-itc@...: paranormalinvestigating@...: Wed, 2 Jan 2008 \n08:19:59 -0500Subject: RE: [EVP-ITC]\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Frank, I heard a few words hear and there but for the most part the \nnoise over took everything. Bruce\n&gt; Bruce Halliday \n&gt; \n&gt; \n&gt; To: evp-itc@...: franks-boxes@...: Wed, 2 Jan 2008 00:13:05 -\n0700Subject: [EVP-ITC] \n&gt; \n&gt; \n&gt;  These are direct from the system output speaker, the speaker that \nwill provide the raw audio output for this box. There seems to be \nmore static on the AM band tonight, part of that is cuz I think this \nboard has more RF gain at the antenna then the previous board. It \nprobably depends on the type of core I used for the coil, and since \nthey are from the junk box, I have no idea what the permeability \nrating is for these cores. The core being a ferrite bobbin that I \nwind the coil on.   Frank-S\n&gt; \n&gt; Share life as it happens with the new Windows Live. Share now! \n&gt; \n&gt; \n&gt; Don&#39;t get caught with egg on your face. Play Chicktionary! Check it \nout! \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Share life as it happens with the new Windows Live.\n&gt; http://www.windowslive.com/share.html?\nocid=TXT_TAGHM_Wave2_sharelife_122007\n&gt;"}