{"id": "4854", "subject": "Re: [EVP-ITC] Re: For bruce:", "author": "Lisby", "timestamp": "2008-01-03T01:53:34Z", "full_text": "D&#39;Ana-- this list is full of people doing two-way communication. You  \nmay want to google &quot;Frank&#39;s box&quot; and do some reading to catch up to  \nwhere we are.\n\nWelcome  aboard.\n\nAnn\n\nOn Jan 2, 2008, at 6:56 PM, DAna wrote:\n\n&gt; it was where he was asking his dad somethionog that is all i\n&gt; know regarding the one i listened to. that makes more sense though\n&gt; for some odd reason there arent any others that have brought up two\n&gt; way communication so im afraid i was wrong! Thanks for doin that for\n&gt; me and bruce. I am glad there is other ways that specialize in\n&gt; communicating with the deceased. i have no clue why i have never\n&gt; heard of that but thanks for the heads up...tons of things everyone\n&gt; isnt aware of.. so you answered the one i wanted\n&gt; answered .\n&gt;\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, Lisby &lt;lisby@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; That isn&#39;t his dad--it&#39;s Mike, his guide.\n&gt; &gt;\n&gt; &gt; What you&#39;re hearing are artifacts of the sound clean-up program\n&gt; that\n&gt; &gt; makes the voices more audible.\n&gt; &gt;\n&gt; &gt; These are not EVPs, they are realtime communication. They are\n&gt; heard\n&gt; &gt; out loud as they happen. That&#39;s what boxes do--they allow two-way\n&gt; &gt; real-time exchange between us and them.\n&gt; &gt;\n&gt; &gt; Ann\n&gt; &gt;\n&gt; &gt; On Jan 2, 2008, at 4:16 PM, DAna wrote:\n&gt; &gt;\n&gt; &gt; &gt; Now I am sure you arent aware of who I am being, noone else other\n&gt; &gt; &gt; than misty welcomed me to this group. Being I am not professional\n&gt; at\n&gt; &gt; &gt; e.v.p.s but yet have gone through listening to many of them from\n&gt; &gt; &gt; trustful resources, your e.v.p.s make me a bit leery. NOt trying\n&gt; to\n&gt; &gt; &gt; be rude, so dont go get all upset right off the bat. In your\n&gt; e.v.p.s,\n&gt; &gt; &gt; this one especially, alot of them sound like you, not the part\n&gt; where\n&gt; &gt; &gt; you asking questions, but where your dad is supposively answering\n&gt; &gt; &gt; you. NOw everyone has their own right to opinion so there is now\n&gt; need\n&gt; &gt; &gt; to get defensive, if all is real there would be nothing to get mad\n&gt; &gt; &gt; about. I just cant help but notice how odd it is that your e.v.p.\n&gt; &gt; &gt; questions to your father, seems to answer right away when you ask\n&gt; the\n&gt; &gt; &gt; question. Also, i notice that after you ask the question i hear\n&gt; &gt; &gt; something being turned on that has contains the answer to that\n&gt; &gt; &gt; question. Whether it be your dad or not. I feel its you that is\n&gt; &gt; &gt; answering, but let me tell you why i figure this.. and please you\n&gt; &gt; &gt; would like to defend you side of things that would be great,\n&gt; maybe i\n&gt; &gt; &gt; would be able to change my opinion on the matter. But as of now,\n&gt; &gt; &gt; e.v.p.s are usually done on the same tape that the questions are\n&gt; on,\n&gt; &gt; &gt; then in a rewind you can hear you and the e.v.p. but to me it\n&gt; sound\n&gt; &gt; &gt; like you put the e.v.p. response on another tape. i am not trying\n&gt; to\n&gt; &gt; &gt; start any kind of fight or be cruel, maybe i could learn\n&gt; something on\n&gt; &gt; &gt; behalf of how you do your work... thank you\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;\n&gt; \n\n\nD'Ana-- his lis is ull o people doing wo-way communica ion. You may wan o google \"F ank's box\" and do some eading o ca ch up o whe e we a e.Welcome  aboa d. AnnOn Jan 2, 2008, a 6:56 PM, DAna w o e:i was whe e he was asking his dad some hionog ha is all i know ega ding he one i lis ened o. ha makes mo e sense hough  o some odd eason he e a en any o he s ha ha e b ough up wo way communica ion so im a aid i was w ong! Thanks o doin ha o  me and b uce. I am glad he e is o he ways ha specialize in communica ing wi h he deceased. i ha e no clue why i ha e ne e  hea d o ha bu hanks o he heads up... ons o hings e e yone isn awa e o .. so you answe ed he one i wan ed answe ed . --- In EVP-ITC@yahoog oups.com, Lisby w o e:>> Tha isn' his dad--i 's Mike, his guide.> > Wha you' e hea ing a e a i ac s o he sound clean-up p og am  ha  > makes he oices mo e audible.> > These a e no EVPs, hey a e eal ime communica ion. They a e hea d > ou loud as hey happen. Tha 's wha boxes do-- hey allow wo-way > eal- ime exchange be ween us and hem.> > Ann> > On Jan 2, 2008, a 4:16 PM, DAna w o e:> > > Now I am su e you a en awa e o who I am being, noone else o he > > han mis y welcomed me o his g oup. Being I am no p o essional a > > e. .p.s bu ye ha e gone h ough lis ening o many o hem om> > us ul esou ces, you e. .p.s make me a bi lee y. NO ying  o> > be ude, so don go ge all upse igh o he ba . In you  e. .p.s,> > his one especially, alo o hem sound like you, no he pa  whe e> > you asking ques ions, bu whe e you dad is supposi ely answe ing> > you. NOw e e yone has hei own igh o opinion so he e is now need> > o ge de ensi e, i all is eal he e would be no hing o ge mad> > abou . I jus can help bu no ice how odd i is ha you e. .p.> > ques ions o you a he , seems o answe igh away when you ask  he> > ques ion. Also, i no ice ha a e you ask he ques ion i hea > > some hing being u ned on ha has con ains he answe o ha > > ques ion. Whe he i be you dad o no . I eel i s you ha is> > answe ing, bu le me ell you why i igu e his.. and please you> > would like o de end you side o hings ha would be g ea , maybe i> > would be able o change my opinion on he ma e . Bu as o now,> > e. .p.s a e usually done on he same ape ha he ques ions a e on,> > hen in a ewind you can hea you and he e. .p. bu o me i  sound> > like you pu he e. .p. esponse on ano he ape. i am no ying  o> > s a any kind o igh o be c uel, maybe i could lea n some hing on> > behal o how you do you wo k... hank you> >> >> >>"}