{"id": "4855", "subject": "Re: For bruce:", "author": "DAna", "timestamp": "2008-01-03T02:01:15Z", "full_text": "doing that now lol but thanks i figured i was behind....hints why i \nhad no clue about the two way, all my fault though, thanks you so \nmuch for that though.. i should have done it from the start of \nthings                                                                \n                                                                      \n     --- In EVP-ITC@yahoogroups.com, Lisby &lt;lisby@...&gt; wrote:\n&gt;\n&gt; D&#39;Ana-- this list is full of people doing two-way communication. \nYou  \n&gt; may want to google &quot;Frank&#39;s box&quot; and do some reading to catch up \nto  \n&gt; where we are.\n&gt; \n&gt; Welcome  aboard.\n&gt; \n&gt; Ann\n&gt; \n&gt; On Jan 2, 2008, at 6:56 PM, DAna wrote:\n&gt; \n&gt; &gt; it was where he was asking his dad somethionog that is all i\n&gt; &gt; know regarding the one i listened to. that makes more sense though\n&gt; &gt; for some odd reason there arent any others that have brought up \ntwo\n&gt; &gt; way communication so im afraid i was wrong! Thanks for doin that \nfor\n&gt; &gt; me and bruce. I am glad there is other ways that specialize in\n&gt; &gt; communicating with the deceased. i have no clue why i have never\n&gt; &gt; heard of that but thanks for the heads up...tons of things \neveryone\n&gt; &gt; isnt aware of.. so you answered the one i wanted\n&gt; &gt; answered .\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com, Lisby &lt;lisby@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; That isn&#39;t his dad--it&#39;s Mike, his guide.\n&gt; &gt; &gt;\n&gt; &gt; &gt; What you&#39;re hearing are artifacts of the sound clean-up program\n&gt; &gt; that\n&gt; &gt; &gt; makes the voices more audible.\n&gt; &gt; &gt;\n&gt; &gt; &gt; These are not EVPs, they are realtime communication. They are\n&gt; &gt; heard\n&gt; &gt; &gt; out loud as they happen. That&#39;s what boxes do--they allow two-\nway\n&gt; &gt; &gt; real-time exchange between us and them.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Ann\n&gt; &gt; &gt;\n&gt; &gt; &gt; On Jan 2, 2008, at 4:16 PM, DAna wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Now I am sure you arent aware of who I am being, noone else \nother\n&gt; &gt; &gt; &gt; than misty welcomed me to this group. Being I am not \nprofessional\n&gt; &gt; at\n&gt; &gt; &gt; &gt; e.v.p.s but yet have gone through listening to many of them \nfrom\n&gt; &gt; &gt; &gt; trustful resources, your e.v.p.s make me a bit leery. NOt \ntrying\n&gt; &gt; to\n&gt; &gt; &gt; &gt; be rude, so dont go get all upset right off the bat. In your\n&gt; &gt; e.v.p.s,\n&gt; &gt; &gt; &gt; this one especially, alot of them sound like you, not the part\n&gt; &gt; where\n&gt; &gt; &gt; &gt; you asking questions, but where your dad is supposively \nanswering\n&gt; &gt; &gt; &gt; you. NOw everyone has their own right to opinion so there is \nnow\n&gt; &gt; need\n&gt; &gt; &gt; &gt; to get defensive, if all is real there would be nothing to \nget mad\n&gt; &gt; &gt; &gt; about. I just cant help but notice how odd it is that your \ne.v.p.\n&gt; &gt; &gt; &gt; questions to your father, seems to answer right away when you \nask\n&gt; &gt; the\n&gt; &gt; &gt; &gt; question. Also, i notice that after you ask the question i \nhear\n&gt; &gt; &gt; &gt; something being turned on that has contains the answer to that\n&gt; &gt; &gt; &gt; question. Whether it be your dad or not. I feel its you that \nis\n&gt; &gt; &gt; &gt; answering, but let me tell you why i figure this.. and please \nyou\n&gt; &gt; &gt; &gt; would like to defend you side of things that would be great,\n&gt; &gt; maybe i\n&gt; &gt; &gt; &gt; would be able to change my opinion on the matter. But as of \nnow,\n&gt; &gt; &gt; &gt; e.v.p.s are usually done on the same tape that the questions \nare\n&gt; &gt; on,\n&gt; &gt; &gt; &gt; then in a rewind you can hear you and the e.v.p. but to me it\n&gt; &gt; sound\n&gt; &gt; &gt; &gt; like you put the e.v.p. response on another tape. i am not \ntrying\n&gt; &gt; to\n&gt; &gt; &gt; &gt; start any kind of fight or be cruel, maybe i could learn\n&gt; &gt; something on\n&gt; &gt; &gt; &gt; behalf of how you do your work... thank you\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt;"}