{"id": "4886", "subject": "Re: [EVP-ITC] Not to be a wet blanket", "author": "Debbie Tejada", "timestamp": "2008-01-03T15:29:58Z", "full_text": "Hi Bruce,\n\nI got up this morning with almost 50 emails in my inbox! I did read  \nall the emails and listen to the clips. I&#39;m new at this box stuff (and  \ndon&#39;t have one of my own), so what I do is listen to the clips first  \nto see if I can pick out any words and then look at the clip name to  \nsee if I&#39;m correct. The new files posted by you and Juli were great  \nand I think I&#39;m starting to train my ears, because I was hearing what  \nthe file names indicated.\n\nI&#39;ve mentioned a couple of times how excited I am to have joined this  \nforum, a lot of really intelligent, interesting and dedicated members!  \nI&#39;ve belonged to other forums relating to different subjects  \n(software, african greys, etc.) and this forum is definitely more  \nactive than most and I&#39;m starting to get familiar with the regulars.\n\nYes, you&#39;ll get a bunch of reactions to your post (below)! The  \nInternet is a wonderful thing, to be able to connect people with the  \nsame interests despite their physical distances. Hmmmm, sounds a bit  \nlike Frank&#39;s Boxes to me . . . quantum entanglement anyone???\n\nNow I&#39;d better get some work done.\n_ _ _ _ _ _ _ _\n\nDebbie Tejada\n\n\n&quot;Once you can accept the universe as matter expanding into nothing  \nthat is something, wearing stripes with plaid comes easy. &quot;  ~Albert  \nEinstein\n\nOn Jan 3, 2008, at 8:14 AM, bhali333 wrote:\n\n&gt; But ,\n&gt;\n&gt; yesterday I posted like 20 files and did not recieve one reply on any\n&gt; of them.\n&gt;\n&gt; Yet a post about a broken cell phone recieves a hundred replies.\n&gt; What is this group about?\n&gt;\n&gt; Frank is right what the hell is the sense of posting files to an EVP- \n&gt; ITC\n&gt; group if no one pays attention to the evp&#39;s or files that are posted.\n&gt;\n&gt; I admit I do not reply to every single post myself but I do try and\n&gt; reply to most.\n&gt;\n&gt; If no one is even bothering to listen to the files you are really\n&gt; missing what this is all about.\n&gt;\n&gt; Come o9n guy&#39;s this is supposed to be about the exchange of ideas and\n&gt; constructive suggestions on evp-itc research. It&#39;s not a chat board or\n&gt; a forum for personal vendeta&#39;s\n&gt;\n&gt; Let&#39;s get with the program and do some evp work.\n&gt;\n&gt; And I&#39;ll bet I get some replies to this post that&#39;s for sure !\n&gt;\n&gt; Bruce\n&gt;\n&gt;\n&gt; \n\n\nHi B uce,I go up his mo ning wi h almos 50 emails in my inbox! I did ead all he emails and lis en o he clips. I'm new a his box s u (and don' ha e one o my own), so wha I do is lis en o he clips i s o see i I can pick ou any wo ds and hen look a he clip name o see i I'm co ec . The new iles pos ed by you and Juli we e g ea and I hink I'm s a ing o ain my ea s, because I was hea ing wha he ile names indica ed.I' e men ioned a couple o imes how exci ed I am o ha e joined his o um, a lo o eally in elligen , in e es ing and dedica ed membe s! I' e belonged o o he o ums ela ing o di e en subjec s (so wa e, a ican g eys, e c.) and his o um is de ini ely mo e ac i e han mos and I'm s a ing o ge amilia wi h he egula s.Yes, you'll ge a bunch o eac ions o you pos (below)! The In e ne is a wonde ul hing, o be able o connec people wi h he same in e es s despi e hei physical dis ances. Hmmmm, sounds a bi like F ank's Boxes o me . . . quan um en anglemen anyone???Now I'd be e ge some wo k done. _ _ _ _ _ _ _ _Debbie Tejada\"Once you can accep he uni e se as ma e expanding in o no hing ha is some hing, wea ing s ipes wi h plaid comes easy. \"  ~Albe Eins ein On Jan 3, 2008, a 8:14 AM, bhali333 w o e:Bu ,yes e day I pos ed like 20 iles and did no ecie e one eply on any o hem.Ye a pos abou a b oken cell phone ecie es a hund ed eplies.Wha is his g oup abou ?F ank is igh wha he hell is he sense o pos ing iles o an EVP-ITCg oup i no one pays a en ion o he e p's o iles ha a e pos ed.I admi I do no eply o e e y single pos mysel bu I do y and  eply o mos .I no one is e en bo he ing o lis en o he iles you a e eally missing wha his is all abou .Come o9n guy's his is supposed o be abou he exchange o ideas and cons uc i e sugges ions on e p-i c esea ch. I 's no a cha boa d o  a o um o pe sonal ende a'sLe 's ge wi h he p og am and do some e p wo k.And I'll be I ge some eplies o his pos ha 's o su e !B uce"}