{"id": "4887", "subject": "Re: [EVP-ITC] Re: A female voice / RS Hack revisited", "author": "Debbie Tejada", "timestamp": "2008-01-03T15:34:08Z", "full_text": "Thanks Bruce, I will try the 469 next week if I don&#39;t get my hands on  \nthe older model. I was wondering if I&#39;d get used to the clicking, we  \nhumans are so good at adapting. Good idea also with talking with the  \nlocal RS manager. I&#39;m also going to be in Florida this weekend and  \nwill scope out the RS stores between Orlando and St Augustine.\n_ _ _ _ _ _ _ _\n\nDebbie Tejada\n\n&quot;Once you can accept the universe as matter expanding into nothing  \nthat is something, wearing stripes with plaid comes easy. &quot;  ~Albert  \nEinstein\n\nOn Jan 3, 2008, at 8:29 AM, bhali333 wrote:\n\n&gt;\n&gt; Deb,\n&gt;\n&gt; The new model 469&#39;s have the inherent clicking after using it for a\n&gt; while you will learn to ignore it. Juli Velazquez has both 469 and\n&gt; old model 470 and she prefers the 469 and gets very good results with\n&gt; it.\n&gt;\n&gt; My suggestion is make your local radio shack manager aware that you\n&gt; are searching for these particular radios and can he please try to\n&gt; locate one for you. I&#39;m sure that there is one or two sitting on a\n&gt; shelf in some radio shack somewhere.\n&gt;\n&gt; If you can get an older model 469 that does not have the clicking, It\n&gt; looks exactly like the older model 470 and comes in the cardboard box\n&gt; nox the plastic see through rapper.\n&gt;\n&gt; hang in there something will turn up. And if not don&#39;t let that\n&gt; discourage you from your research just do your best and what you have\n&gt; will work for you.\n&gt;\n&gt; bruce\n&gt;\n&gt;\n&gt; \n\n\nThanks B uce, I will y he 469 nex week i I don' ge my hands on he olde model. I was wonde ing i I'd ge used o he clicking, we humans a e so good a adap ing. Good idea also wi h alking wi h he local RS manage . I'm also going o be in Flo ida his weekend and will scope ou he RS s o es be ween O lando and S Augus ine. _ _ _ _ _ _ _ _Debbie Tejada\"Once you can accep he uni e se as ma e expanding in o no hing ha is some hing, wea ing s ipes wi h plaid comes easy. \"  ~Albe Eins ein On Jan 3, 2008, a 8:29 AM, bhali333 w o e:Deb,The new model 469's ha e he inhe en clicking a e using i o a while you will lea n o igno e i . Juli Velazquez has bo h 469 and old model 470 and she p e e s he 469 and ge s e y good esul s wi h i .My sugges ion is make you local adio shack manage awa e ha you a e sea ching o hese pa icula adios and can he please y o loca e one o you. I'm su e ha he e is one o wo si ing on a shel in some adio shack somewhe e.I you can ge an olde model 469 ha does no ha e he clicking, I  looks exac ly like he olde model 470 and comes in he ca dboa d box nox he plas ic see h ough appe .hang in he e some hing will u n up. And i no don' le ha  discou age you om you esea ch jus do you bes and wha you ha e will wo k o you.b uce"}