{"id": "4896", "subject": "Any way to speed up the scanning on the 12-469?", "author": "mllejade", "timestamp": "2008-01-03T16:37:00Z", "full_text": "I&#39;m still relatively new to building boxes and would like to know if \nit&#39;s possible to speed up the scanning a bit on a hacked RS 12-469.  \n\nThanks,\nSharon \n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@...&gt; \nwrote:\n&gt;\n&gt; \n&gt;  Thanks for listening. Yeah, that&#39;s the problem with noise \nreduction methods, they tend to take out voices. I think if I used \nthe muffled sound consistently they would talk through it though, the \ngoal being to get higher level voices, and audio.  The clarifier is \njust a low pass filter that can be adjusted--just an idea.\n&gt;  I have some female guides that speak sometimes, and there&#39;s the \nseven sisters that come though sometimes, but I don&#39;t know much about \nthat. \n&gt;  \n&gt;  Frank-S\n&gt; \n&gt; \n&gt; To: EVP-ITC@...: debbie@...: Wed, 2 Jan 2008 10:33:33 -0700Subject: \nRe: [EVP-ITC] The &#39;470 mod?\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Frank, Thanks for the extra instructions, it doesn&#39;t sound too \ndifficult for me so I&#39;ll give it a shot. \n&gt; \n&gt; By the way, I did listen to your tone control clip. Since I&#39;m new \nto this my comments are probably not &quot;worth&quot; much at this point. I \nthought the entire clip itself was a lot smoother and clearer than \nmost I&#39;ve heard so far from various sources (the mixed station sounds \nare in smaller pieces so for someone like me it would be easier to \npick out the EVPs as opposed to entire words from radio announcers). \nThe short piece about 2/3 of the way through, where I&#39;m guessing you \nused a clarifier, sounded muffled to me, which makes me think it \nwould also muffle the EVPs. Definitely easier on the ears but for \nsomeone inexperienced (and I seem to be the only one here!) it seems \nit would be harder to pick out the real words too.\n&gt; \n&gt; By the way, in listening to the deluge of clips uploaded last \nnight, I can&#39;t help but notice that the voices are all men. Just \ncurious -- is that always the case?\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _ _ _ _ _ _ _ _\n&gt; \n&gt; Debbie Tejada\n&gt; \n&gt; &quot;Once you can accept the universe as matter expanding into nothing \nthat is something, wearing stripes with plaid comes easy. &quot;  ~Albert \nEinstein\n&gt; \n&gt; On Jan 2, 2008, at 10:22 AM, Frank Sumption wrote:\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;  I have the &#39;470, but I don&#39;t know if it&#39;s the older one or not. I \nwas able to modify it, but it was somewhat different than in the \nvideo instruction, there was more than one green wire. You have to \nlift the top board so you can see the wire connections on the other \nboard, they are labeled, and you can tell what wire to cut/unsolder.  \n(mute wire).   Frank-S\n&gt; \n&gt; Share life as it happens with the new Windows Live. Share now! \n&gt; \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Get the power of Windows + Web with the new Windows Live.\n&gt; http://www.windowslive.com?\nocid=TXT_TAGHM_Wave2_powerofwindows_122007\n&gt;"}