{"id": "4910", "subject": "Re: [EVP-ITC] Not to be a wet blanket", "author": "Lisby", "timestamp": "2008-01-03T18:34:27Z", "full_text": "Bruce--I listened to them all, every single one that got posted  \nyesterday.\n\nI didn&#39;t comment because I didn&#39;t find this batch to be as strong as  \nyours usually are. Although I meant to post and say that I was quite  \nsad that the Elvis we heard might be an impersonator. Would you ask  \nthem why they allow a fake to come through--since that EVP was quite  \nlong and elaborately &quot;staged,&quot; for lack of a better term. Surely Mike  \ncould stop a fake? I&#39;m very curious about what&#39;s happening over there  \nas we are operating the box, and it is very important to me to feel a  \ngood amount of certainty that the people coming through are who they  \nclaim to be. If you can ask, I&#39;d be grateful. I don&#39;t seem to be able  \nto get those kind of responses yet on my own.\n\n\nAnn\n\nOn Jan 3, 2008, at 10:14 AM, bhali333 wrote:\n\n&gt; But ,\n&gt;\n&gt; yesterday I posted like 20 files and did not recieve one reply on any\n&gt; of them.\n&gt;\n&gt; Yet a post about a broken cell phone recieves a hundred replies.\n&gt; What is this group about?\n&gt;\n&gt; Frank is right what the hell is the sense of posting files to an  \n&gt; EVP-ITC\n&gt; group if no one pays attention to the evp&#39;s or files that are posted.\n&gt;\n&gt; I admit I do not reply to every single post myself but I do try and\n&gt; reply to most.\n&gt;\n&gt; If no one is even bothering to listen to the files you are really\n&gt; missing what this is all about.\n&gt;\n&gt; Come o9n guy&#39;s this is supposed to be about the exchange of ideas and\n&gt; constructive suggestions on evp-itc research. It&#39;s not a chat board or\n&gt; a forum for personal vendeta&#39;s\n&gt;\n&gt; Let&#39;s get with the program and do some evp work.\n&gt;\n&gt; And I&#39;ll bet I get some replies to this post that&#39;s for sure !\n&gt;\n&gt; Bruce\n&gt;\n&gt;\n&gt; \n\n\nB uce--I lis ened o hem all, e e y single one ha go pos ed yes e day.I didn' commen because I didn' ind his ba ch o be as s ong as you s usually a e. Al hough I mean o pos and say ha I was qui e sad ha he El is we hea d migh be an impe sona o . Would you ask hem why hey allow a ake o come h ough--since ha EVP was qui e long and elabo a ely \"s aged,\" o lack o a be e e m. Su ely Mike could s op a ake? I'm e y cu ious abou wha 's happening o e he e as we a e ope a ing he box, and i is e y impo an o me o eel a good amoun o ce ain y ha he people coming h ough a e who hey claim o be. I you can ask, I'd be g a e ul. I don' seem o be able o ge hose kind o esponses ye on my own.AnnOn Jan 3, 2008, a 10:14 AM, bhali333 w o e:Bu ,yes e day I pos ed like 20 iles and did no ecie e one eply on any o hem.Ye a pos abou a b oken cell phone ecie es a hund ed eplies.Wha is his g oup abou ?F ank is igh wha he hell is he sense o pos ing iles o an EVP-ITCg oup i no one pays a en ion o he e p's o iles ha a e pos ed.I admi I do no eply o e e y single pos mysel bu I do y and  eply o mos .I no one is e en bo he ing o lis en o he iles you a e eally missing wha his is all abou .Come o9n guy's his is supposed o be abou he exchange o ideas and cons uc i e sugges ions on e p-i c esea ch. I 's no a cha boa d o  a o um o pe sonal ende a'sLe 's ge wi h he p og am and do some e p wo k.And I'll be I ge some eplies o his pos ha 's o su e !B uce"}