{"id": "4911", "subject": "Re: [EVP-ITC] Blog all should read and beware of...", "author": "Lisby", "timestamp": "2008-01-03T18:41:25Z", "full_text": "Unless some other people are really having an unfair go at him  \nsomewhere else than here, his post was the equivalent of a primate  \nbeating his chest and throwing poop.\n\nAnn\n\n\nOn Jan 3, 2008, at 12:03 PM, Zack Widup wrote:\n\n&gt;\n&gt; I find this whole thing kind of humorous for some reason. Maybe that&#39;s\n&gt; just me. Maybe if I weren&#39;t so detached from the scene, it might  \n&gt; look more\n&gt; serious.\n&gt;\n&gt; Chris Moon refers to &quot;public slander&quot;. Where has this supposedly taken\n&gt; place? I don&#39;t have hours and hours to spend looking at everything on\n&gt; internet and in fact it&#39;s tough sometimes just keeping up with the  \n&gt; e-mails\n&gt; I get from 60 Yahoogroups and about 20 other groups (mostly related to\n&gt; amateur radio and photography and a small handful having to do with  \n&gt; the\n&gt; paranormal).\n&gt;\n&gt; Zack\n&gt;\n&gt; On Thu, 3 Jan 2008, LC Duplatt wrote:\n&gt;\n&gt; &gt; http://blog.myspace.com/index.cfm?\n&gt; &gt; fuseaction=blog.view&friendID=43481649&blogID=343715947\n&gt; &gt;\n&gt;\n&gt; \n\n\nUnless some o he people a e eally ha ing an un ai go a him somewhe e else han he e, his pos was he equi alen o a p ima e bea ing his ches and h owing poop.AnnOn Jan 3, 2008, a 12:03 PM, Zack Widup w o e:I ind his whole hing kind o humo ous o some eason. Maybe ha 's jus me. Maybe i I we en' so de ached om he scene, i migh look mo e se ious.Ch is Moon e e s o \"public slande \". Whe e has his supposedly aken place? I don' ha e hou s and hou s o spend looking a e e y hing on in e ne and in ac i 's ough some imes jus keeping up wi h he e-mails I ge om 60 Yahoog oups and abou 20 o he g oups (mos ly ela ed o ama eu adio and pho og aphy and a small hand ul ha ing o do wi h he pa ano mal).ZackOn Thu, 3 Jan 2008, LC Dupla w o e:> h p://blog.myspace.com/index.c m?> useac ion=blog. iew& iendID=43481649&blogID=343715947>"}