{"id": "4914", "subject": "Re: Any way to speed up the scanning on the 12-469?", "author": "LC Duplatt", "timestamp": "2008-01-03T19:55:44Z", "full_text": "Man, if we can have those available, how cool!\n\nLC\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@...&gt; \nwrote:\n&gt;\n&gt; \n&gt;  Yeah, the guy that first made the hack was giving away a chip to \ncontrol the scan rate. I don&#39;t know if it&#39;s still available. I have \none of the chips, and no &#39;469.\n&gt;  \n&gt;  Frank-S\n&gt; \n&gt; \n&gt; To: EVP-ITC@...: leongbabe@...: Thu, 3 Jan 2008 16:37:00 \n+0000Subject: [EVP-ITC] Any way to speed up the scanning on the 12-\n469?\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; I&#39;m still relatively new to building boxes and would like to know \nif it&#39;s possible to speed up the scanning a bit on a hacked RS 12-\n469. Thanks,Sharon --- In EVP-ITC@yahoogroups.com, Frank Sumption \n&lt;franks-boxes@&gt; wrote:&gt;&gt; &gt; Thanks for listening. Yeah, that&#39;s the \nproblem with noise reduction methods, they tend to take out voices. I \nthink if I used the muffled sound consistently they would talk \nthrough it though, the goal being to get higher level voices, and \naudio. The clarifier is just a low pass filter that can be adjusted--\njust an idea.&gt; I have some female guides that speak sometimes, and \nthere&#39;s the seven sisters that come though sometimes, but I don&#39;t \nknow much about that. &gt; &gt; Frank-S&gt; &gt; &gt; To: EVP-ITC@: debbie@: Wed, 2 \nJan 2008 10:33:33 -0700Subject: Re: [EVP-ITC] The &#39;470 mod?&gt; &gt; &gt; &gt; &gt; \nFrank, Thanks for the extra instructions, it doesn&#39;t sound too \ndifficult for me so I&#39;ll give it a shot. &gt; &gt; By the way, I did listen \nto your tone control clip. Since I&#39;m new to this my comments are \nprobably not &quot;worth&quot; much at this point. I thought the entire clip \nitself was a lot smoother and clearer than most I&#39;ve heard so far \nfrom various sources (the mixed station sounds are in smaller pieces \nso for someone like me it would be easier to pick out the EVPs as \nopposed to entire words from radio announcers). The short piece about \n2/3 of the way through, where I&#39;m guessing you used a clarifier, \nsounded muffled to me, which makes me think it would also muffle the \nEVPs. Definitely easier on the ears but for someone inexperienced \n(and I seem to be the only one here!) it seems it would be harder to \npick out the real words too.&gt; &gt; By the way, in listening to the \ndeluge of clips uploaded last night, I can&#39;t help but notice that the \nvoices are all men. Just curious -- is that always the case?&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; _ _ _ _ _ _ _ _&gt; &gt; Debbie Tejada&gt; &gt; &quot;Once you can accept \nthe universe as matter expanding into nothing that is something, \nwearing stripes with plaid comes easy. &quot; ~Albert Einstein&gt; &gt; On Jan \n2, 2008, at 10:22 AM, Frank Sumption wrote:&gt; &gt; &gt; &gt; &gt; &gt; I have \nthe &#39;470, but I don&#39;t know if it&#39;s the older one or not. I was able \nto modify it, but it was somewhat different than in the video \ninstruction, there was more than one green wire. You have to lift the \ntop board so you can see the wire connections on the other board, \nthey are labeled, and you can tell what wire to cut/unsolder. (mute \nwire). Frank-S&gt; &gt; Share life as it happens with the new Windows Live. \nShare now! &gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; \n__________________________________________________________&gt; Get the \npower of Windows + Web with the new Windows Live.&gt; \nhttp://www.windowslive.com?\nocid=TXT_TAGHM_Wave2_powerofwindows_122007&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Get the power of Windows + Web with the new Windows Live.\n&gt; http://www.windowslive.com?\nocid=TXT_TAGHM_Wave2_powerofwindows_122007\n&gt;"}