{"id": "4928", "subject": "Re: Not to be a wet blanket", "author": "mllejade", "timestamp": "2008-01-04T04:45:07Z", "full_text": "Hi Bruce,\n\nI&#39;ve really tried to listen to as many files as I have time for, and \nfor the most part, am quite impressed with what people have captured \nfrom the boxes.  To echo your closing sentiment on flying a little on \nfaith that the voices coming through are who they claim to be, I&#39;d \nlike to add that one can never be 100% sure and so I simply accept \nthem at face value, giving more weight to to the message than the \nmessenger.\n\nSharon\n\n--- In EVP-ITC@yahoogroups.com, bruce halliday \n&lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; Ann,\n&gt;  \n&gt; Thanks for listening that batch of files came from a recent session \nwhen the signal was not at it&#39;s optimum.\n&gt; Some times you will receive a less than adequate session due to the \nconditions at the time the session is in progress\n&gt; I and a couple of other researchers  are now in the process of \ndocumenting the exact conditions present during\n&gt; a box session and the different affects some conditions have on the \nclarity and strength of the communication.\n&gt;  \n&gt; As far as the Elvis message goes, we have to remember that spirits \nwhere also people at one time and that when \n&gt; we go to the first spiritual level after we leave the physical we \ncarry with us many of the characteristics we had in our earthly \npersonality.\n&gt; some spirits are shy some out going some serious some are comedians.\n&gt;  \n&gt; I believe the Elvis impersonation was not meant maliciously but as \na joke. Also the way I determine the validity of the communications I \nreceive is\n&gt; I have gotten to know my techs and have built a relationship with \nthem, I recognise the way they speak and they will even go out of \ntheir way\n&gt; to manipulate certain sound fragments so that the voice they create \nis familiar and recognisable to me. I can pretty much rely on what I \nget from them.\n&gt; But you can never be 100% sure, you can only use your best \njudgement and gut instinct and fly a little on faith.\n&gt;  \n&gt; Bruce\n&gt; Bruce Halliday \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: lisby@...: Thu, 3 Jan 2008 13:34:27 -0500Subject: \nRe: [EVP-ITC] Not to be a wet blanket\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Bruce--I listened to them all, every single one that got posted \nyesterday.\n&gt; \n&gt; I didn&#39;t comment because I didn&#39;t find this batch to be as strong \nas yours usually are. Although I meant to post and say that I was \nquite sad that the Elvis we heard might be an impersonator. Would you \nask them why they allow a fake to come through--since that EVP was \nquite long and elaborately &quot;staged,&quot; for lack of a better term. \nSurely Mike could stop a fake? I&#39;m very curious about what&#39;s \nhappening over there as we are operating the box, and it is very \nimportant to me to feel a good amount of certainty that the people \ncoming through are who they claim to be. If you can ask, I&#39;d be \ngrateful. I don&#39;t seem to be able to get those kind of responses yet \non my own.\n&gt; \n&gt; \n&gt; Ann\n&gt; \n&gt; \n&gt; On Jan 3, 2008, at 10:14 AM, bhali333 wrote:\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; But ,yesterday I posted like 20 files and did not recieve one reply \non any of them.Yet a post about a broken cell phone recieves a \nhundred replies.What is this group about?Frank is right what the hell \nis the sense of posting files to an EVP-ITCgroup if no one pays \nattention to the evp&#39;s or files that are posted.I admit I do not \nreply to every single post myself but I do try and reply to most.If \nno one is even bothering to listen to the files you are really \nmissing what this is all about.Come o9n guy&#39;s this is supposed to be \nabout the exchange of ideas and constructive suggestions on evp-itc \nresearch. It&#39;s not a chat board or a forum for personal \nvendeta&#39;sLet&#39;s get with the program and do some evp work.And I&#39;ll bet \nI get some replies to this post that&#39;s for sure !Bruce\n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; i&#39;m is proud to present Cause Effect, a series about real people \nmaking a difference.\n&gt; http://im.live.com/Messenger/IM/MTV/?source=text_Cause_Effect\n&gt;"}