{"id": "4929", "subject": "Re: [EVP-ITC] Re: Any way to speed up the scanning on the 12-469?-A couple more questions", "author": "Zack Widup", "timestamp": "2008-01-04T04:57:07Z", "full_text": "The chip is a microcontroller.  It needs a program called &quot;firmware&quot; put \ninto it before it will do anything useful.  The chips have a program \nmemory which comes blank when you buy them.\n\nThe &quot;code&quot; is the representation of what is called machine language \nthat tells the various parts of the microcontroller what to do.  In this \ncase, I imagine it increases a voltage with a certain pattern and then \ndrops it down to zero, starting over again and repeating at a certain \nrate. This would produce a repetitive sweep of the radio at a certain rate \nwhen the microcontroller is hooked up to the radio correctly.\n\nIt wouldn&#39;t be difficult for me to write my own program to do this with a \nPIC microcontroller, but if someone else has already done it, why bother?\n\nIf I can&#39;t get my hands on the machine code, I&#39;ll write some myself.\n\nZack\n\nOn Fri, 4 Jan 2008, mllejade wrote:\n\n&gt; Frank, please let me know if you should, for whatever reason, decide\n&gt; to sell that chip (to control the scan rate of the &#39;469).  I&#39;d like\n&gt; to purchase it from you, if possible.\n&gt;\n&gt; Thanks,\n&gt;\n&gt; Sharon\n&gt;\n&gt; P.S.  I&#39;ve read the follow-ups to my initial question and being a\n&gt; layman at modifying electric apparatuses, what do you all mean by\n&gt; code?  Does one need the code and the chip in order to speed up the\n&gt; scanning on a hacked &#39;469; or can one do it with simply a code, or\n&gt; the chip, alone?\n&gt;\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@...&gt;\n&gt; wrote:\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;  Yeah, the guy that first made the hack was giving away a chip to\n&gt; control the scan rate. I don&#39;t know if it&#39;s still available. I have\n&gt; one of the chips, and no &#39;469.\n&gt;&gt;\n&gt;&gt;  Frank-S\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; To: EVP-ITC@...: leongbabe@...: Thu, 3 Jan 2008 16:37:00\n&gt; +0000Subject: [EVP-ITC] Any way to speed up the scanning on the 12-\n&gt; 469?\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; I&#39;m still relatively new to building boxes and would like to know\n&gt; if it&#39;s possible to speed up the scanning a bit on a hacked RS 12-\n&gt; 469. Thanks,Sharon --- In EVP-ITC@yahoogroups.com, Frank Sumption\n&gt; &lt;franks-boxes@&gt; wrote:&gt;&gt; &gt; Thanks for listening. Yeah, that&#39;s the\n&gt; problem with noise reduction methods, they tend to take out voices. I\n&gt; think if I used the muffled sound consistently they would talk\n&gt; through it though, the goal being to get higher level voices, and\n&gt; audio. The clarifier is just a low pass filter that can be adjusted--\n&gt; just an idea.&gt; I have some female guides that speak sometimes, and\n&gt; there&#39;s the seven sisters that come though sometimes, but I don&#39;t\n&gt; know much about that. &gt; &gt; Frank-S&gt; &gt; &gt; To: EVP-ITC@: debbie@: Wed, 2\n&gt; Jan 2008 10:33:33 -0700Subject: Re: [EVP-ITC] The &#39;470 mod?&gt; &gt; &gt; &gt; &gt;\n&gt; Frank, Thanks for the extra instructions, it doesn&#39;t sound too\n&gt; difficult for me so I&#39;ll give it a shot. &gt; &gt; By the way, I did listen\n&gt; to your tone control clip. Since I&#39;m new to this my comments are\n&gt; probably not &quot;worth&quot; much at this point. I thought the entire clip\n&gt; itself was a lot smoother and clearer than most I&#39;ve heard so far\n&gt; from various sources (the mixed station sounds are in smaller pieces\n&gt; so for someone like me it would be easier to pick out the EVPs as\n&gt; opposed to entire words from radio announcers). The short piece about\n&gt; 2/3 of the way through, where I&#39;m guessing you used a clarifier,\n&gt; sounded muffled to me, which makes me think it would also muffle the\n&gt; EVPs. Definitely easier on the ears but for someone inexperienced\n&gt; (and I seem to be the only one here!) it seems it would be harder to\n&gt; pick out the real words too.&gt; &gt; By the way, in listening to the\n&gt; deluge of clips uploaded last night, I can&#39;t help but notice that the\n&gt; voices are all men. Just curious -- is that always the case?&gt; &gt; &gt; &gt; &gt;\n&gt;&gt;&gt;&gt;&gt;&gt; _ _ _ _ _ _ _ _&gt; &gt; Debbie Tejada&gt; &gt; &quot;Once you can accept\n&gt; the universe as matter expanding into nothing that is something,\n&gt; wearing stripes with plaid comes easy. &quot; ~Albert Einstein&gt; &gt; On Jan\n&gt; 2, 2008, at 10:22 AM, Frank Sumption wrote:&gt; &gt; &gt; &gt; &gt; &gt; I have\n&gt; the &#39;470, but I don&#39;t know if it&#39;s the older one or not. I was able\n&gt; to modify it, but it was somewhat different than in the video\n&gt; instruction, there was more than one green wire. You have to lift the\n&gt; top board so you can see the wire connections on the other board,\n&gt; they are labeled, and you can tell what wire to cut/unsolder. (mute\n&gt; wire). Frank-S&gt; &gt; Share life as it happens with the new Windows Live.\n&gt; Share now! &gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt;\n&gt; __________________________________________________________&gt; Get the\n&gt; power of Windows + Web with the new Windows Live.&gt;\n&gt; http://www.windowslive.com?\n&gt; ocid=TXT_TAGHM_Wave2_powerofwindows_122007&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; _________________________________________________________________\n&gt;&gt; Get the power of Windows + Web with the new Windows Live.\n&gt;&gt; http://www.windowslive.com?\n&gt; ocid=TXT_TAGHM_Wave2_powerofwindows_122007\n&gt;&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Yahoo! Groups Links\n&gt;\n&gt;\n&gt;\n&gt;"}