{"id": "4961", "subject": "so what  what can  we say more", "author": "ill might tell you if you ask???", "timestamp": "2008-01-05T16:46:49Z", "full_text": "RANDI&#39;S CHALLENGE:\nA Big &quot;So What!&quot;\n\n\nLoyd Auerback\n\n\nFrom www.victorzammit.com/ \n    \n\n\n Loyd Auerbach, M.S., is the Director of the Office of Paranormal \nInvestigations. He is a Consulting Editor and columnist for FATE \nMagazine, an adjunct Professor at JFK University and President of The \nPsychic Entertainers Association. He holds a degree in Cultural \nAnthropology from Northwestern University and a graduate degree in \nParapsychology from JFK University.\nHe is the author of a number of books on the paranormal including \nGhost Hunting: How to Investigate the Paranormal, Hauntings & \nPoltergeists: A Ghost Hunter&#39;s Guide and Mind Over Matter, besides \nvideos and CDs.\nHis website is http://www.mindreader.com/ \n \n\n----------------------------------------------------------------------\n----------\n\nI might actually title this essay &quot;Why I no longer care about Randi&#39;s \nOne Million Dollar Challenge,&quot; but honestly &quot;So What!&quot; sums up my \nfeelings these days.\n\nOver the last several years, I&#39;ve been somewhat outspoken about the \nspecific details of the rules of Randi&#39;s challenge. But recently, \nwhen being harassed by yet another disbelieving type about the test, \nsome kind of light - an epiphany of sorts - went on in my head. The \nindividual made a statement, with a question, that I often hear in \nvariations from self-described Skeptics (actually disbelievers): \n&quot;The Amazing Randi offers one million dollars for anyone who can \ndemonstrate something paranormal. If psychic abilities are real, why \nhas no one won the prize?&quot; \n\nRather than responding as I have in the past with a discourse as to \nwhy I don&#39;t believe anyone will win that money, I spontaneously \nswitched gears. [The following is an approximation of the \nconversation] \n\n&quot;What would that prove?&quot; I asked.\n\n&quot;Huh?&quot; said the Skeptic.\n\n&quot;Why is Randi offering the money?&quot; I asked.\n\n&quot;For anyone who can prove something paranormal,&quot; said the Skeptic. \n\n&quot;If someone did win the million, what would that actually prove?&quot; I \nasked.\n\n&quot;Huh?&quot; said the Skeptic.\n\n&quot;I mean, if a psychic won the million dollars, other than the psychic \nwalking away one million dollars richer, what would that prove to the \nskeptical community or to Science?&quot; I asked.\n\n&quot;That someone could do something psychic,&quot; said the Skeptic with some \nconfusion in his voice.\n\n&quot;Would it? If someone won Randi&#39;s million dollars, would YOU accept \nthat psychic abilities are real? Or even just possible?&quot; I asked. \n\n&quot;Huh?&quot; said the Skeptic.\n\n&quot;Would mainstream Science accept the probability of psi, if not the \nreality, if some psychic won Randi&#39;s million?&quot; I asked.\n\n&quot;Uh-uh-huh?&quot; said the Skeptic.\n\n&quot;Would the organized Skeptics accept that psi is real, or would they \nbe more likely to believe that Randi was simply fooled, scammed out \nof his million? Would you?&quot; I asked.\n\nI received a blank stare from the Skeptic, then saw confusion \nappearing on his face. \nI continued to push at him. &quot;The fact is that people who do not \naccept the laboratory and other evidence for psi that already exists \nare unlikely to change their minds or their beliefs simply because \nsomeone beats Randi&#39;s challenge and wins Randi&#39;s money. In the name \nof Science, many keep raising the issue of parsimony, of Occam&#39;s \nRazor where psi is concerned. In this case, wouldn&#39;t the simpler \nexplanation as far as the Skeptics are concerned be that Randi was \nscammed out of the money? In the name of Science, many raise the \nissue of repeatability. If someone beat Randi&#39;s Challenge once, how \ndoes this meet the criteria of repeatability? What does this prove?&quot; \n\nThe Skeptic was silent, confusion and frustration (and a little \nanger) continuing on his face.\n\nI finished with &quot;If you can honestly tell me - I mean look me in the \neye and tell me honestly - that you would be open to psi&#39;s existence \nif a psychic won Randi&#39;s money, I&#39;ll give you 20 dollars right here \nand now. It&#39;s not a million, but to be honest, your opinion isn&#39;t \nworth that much to me.&quot; \n\nHe walked away (okay, he stormed off).\n\nI&#39;ve since used this argument on a few others, whenever Randi&#39;s \nChallenge is raised like a weapon against the field of \nParapsychology, and against the existence (real or just potential) of \npsi.\n\nTo recap: If someone wins Randi&#39;s million, he/she will be one million \ndollars richer. However, as far as Science and the Skeptics are \nconcerned, the simpler answer to this conundrum is that Randi (or his \nchosen panel of judges) was fooled. \n\nIn other words, So What if someone wins the money. It won&#39;t change \nthe prevailing attitudes towards parapsychology, or the prevailing \nbeliefs of most who waiver to the disbelieving side of the center \nwhere psi is concerned. \n\nAs this is the case (prove me wrong, somebody - please!), we waste \nour time even giving Randi&#39;s Challenge the time of day. \n\nIt&#39;s not a benchmark for Science, or even the Skeptics. Why should we \ncare?\n\nSo What! \n\nLoyd Auerback \n\nMedia Skeptics... James Randi \nThe Randi Prize \nCurrent Controversies page\n\nCopyright  Loyd Auerback January 2005\nAcknowledgement: thanks to Loyd Auerback for permission to reproduce \nthis article"}