{"id": "4992", "subject": "Re: [EVP-ITC] Check out what I broke this time", "author": "Misty Dawn", "timestamp": "2008-01-06T06:47:08Z", "full_text": "--0-1846842096-1199602028=:11740\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nWow Robin you gave me flashbacks LOL. Dont feel bad. Same thing happened to me except it didnt even fly out of my hands, the hack seemed to go fine, but when I went to put it back together the wire came undone from the battery casing so he went to his friends house and resoldered it on for me brought it back put it in my hands for me to put the screws in and I noticed now there was a big black wire from the speaker section undone as well. He then went back to his friends resoldered that wire, brought it back, I put it together and powers up, scans fine...manual...auto...BUT there are no stations being picked up at all. LOL\n   \n  Worked fine before I touched it (reception wise) but now its sittin in a box waitin for me to mail it to Franks radio graveyard soon as I get my butt in gear now that the holiday mail rush is coming to an end. He said he can probably fix it. I bet he can LOL its probably just another wire come undone I didnt see underneath. Or somethin i did wrong. I aint opening it again they will all fly off at me or somethin if i do LOL. Or he can rip it to shreds for the parts. Gonna leave the building to the builders. Mike just had to go and make it look so dang easy I couldnt resist tearing one apart hehehe\n   \n  And tear it apart I did =)\n   \n  Misty\n   \n  \njoel smith &lt;sparky1j41@...&gt; wrote:\n          you can buy new leads  at rs  for like` $2.00  and get it to work\n\nRobin Henson &lt;MudPuddleFarm@...&gt; wrote:       After viewing Mike&#39;s RS 12-469 hack video for the fifth time I felt \nready to take the plunge myself, so yesterday while dh was picking up \na pizza at Papa John&#39;s I sneaked next door and bought the radio. He \ncouldn&#39;t stop complaining about how I&#39;d wasted money on a perfectly \ngood piece of equipment only to wreck it for my dumb hobby, but once \nwe got home he took it upon himself to test it and make sure it \nworked. For some reason it really DIDN&#39;T work, so he took it back to \nRS and exchanged it for another one, and after making sure THAT one \nworked he even offered to help me with the modification. &quot;No thanks&quot; \nI told him. &quot;I think I need to do this myself.&quot; \n\nI can&#39;t pretend the process went as smoothly as I&#39;d hoped, but \nfinally I was done and making the last turn in the second screw of \nthe circuit board.. and then.. The whole thing flew out of my hands \nand both battery wires ripped away from their soldered ends in the \ncasing. It was all Bob could do to keep from gleefully yelling &quot;I \nknew you were going to break it!&quot; But then I guess he felt bad \nbecause he ran down to Walmart and got a soldering iron and solder \nand spent an hour trying to put it all back together for me. \n\nIt&#39;s dead as a doornail, and I&#39;m thinking that if I could break it \nthat easily without even knowing how or why, maybe I&#39;m not supposed \nto pursue this method (sigh). I guess I&#39;ll just think it over and \nmaybe try again later. \n\nThanks for all the helpful information though Mike!\n\nRobin\n\n\n\n\n    \n---------------------------------\n  Be a better friend, newshound, and know-it-all with Yahoo! Mobile. Try it now.  \n\n                         \n\n\n\n \n\n\n\n       \n---------------------------------\nBe a better friend, newshound, and know-it-all with Yahoo! Mobile.  Try it now.\r\n--0-1846842096-1199602028=:11740\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;div&gt;Wow Robin you gave me flashbacks LOL. Dont feel bad. Same thing happened to me except it didnt even fly out of my hands, the hack seemed to go fine, but when I went to put it back together the wire came undone from the battery casing so he went to his friends house and resoldered it on for me brought it back put it in my hands for me to put the screws in and I noticed now there was a big black wire from the speaker section undone as well. He then went back to his friends resoldered that wire, brought it back, I put it together and powers up, scans fine...manual...auto...BUT there are no stations being picked up at all. LOL&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Worked fine before I touched it (reception wise) but now its sittin in a box waitin for me to mail it to Franks radio graveyard soon as I get my butt in gear now that the holiday mail rush is coming to an end. He said he can probably fix it. I bet he can LOL its probably just another wire come undone I didnt see\n underneath. Or somethin i did wrong. I aint opening it again they will all fly off at me or somethin if i do LOL. Or he can rip it to shreds for the parts. Gonna leave the building to the builders. Mike just had to go and make it look so dang easy I couldnt resist tearing one apart hehehe&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;And tear it apart I did =)&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Misty&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;joel smith &lt;sparky1j41@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/div&gt;  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;div&gt;you can buy new leads&nbsp; at rs&nbsp; for like` $2.00&nbsp; and get it to\n work&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;Robin Henson &lt;MudPuddleFarm@&lt;WBR&gt;msn.com&gt;&lt;/I&gt;&lt;/B&gt; wrote:   &lt;BLOCKQUOTE class=replbq style=&quot;BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;DIV&gt;After viewing Mike&#39;s RS 12-469 hack video for the fifth time I felt &lt;BR&gt;ready to take the plunge myself, so yesterday while dh was picking up &lt;BR&gt;a pizza at Papa John&#39;s I sneaked next door and bought the radio. He &lt;BR&gt;couldn&#39;t stop complaining about how I&#39;d wasted money on a perfectly &lt;BR&gt;good piece of equipment only to wreck it for my dumb hobby, but once &lt;BR&gt;we got home he took it upon himself to test it and make sure it &lt;BR&gt;worked. For some reason it really DIDN&#39;T work, so he took it back to &lt;BR&gt;RS and exchanged it for another one, and after making sure THAT one &lt;BR&gt;worked he even offered to help me with the modification. &quot;No thanks&quot; &lt;BR&gt;I told him. &quot;I think I need to do this myself.&quot; &lt;BR&gt;&lt;BR&gt;I can&#39;t pretend the process went as smoothly as I&#39;d hoped, but &lt;BR&gt;finally I was done and making the last\n turn in the second screw of &lt;BR&gt;the circuit board.. and then.. The whole thing flew out of my hands &lt;BR&gt;and both battery wires ripped away from their soldered ends in the &lt;BR&gt;casing. It was all Bob could do to keep from gleefully yelling &quot;I &lt;BR&gt;knew you were going to break it!&quot; But then I guess he felt bad &lt;BR&gt;because he ran down to Walmart and got a soldering iron and solder &lt;BR&gt;and spent an hour trying to put it all back together for me. &lt;BR&gt;&lt;BR&gt;It&#39;s dead as a doornail, and I&#39;m thinking that if I could break it &lt;BR&gt;that easily without even knowing how or why, maybe I&#39;m not supposed &lt;BR&gt;to pursue this method (sigh). I guess I&#39;ll just think it over and &lt;BR&gt;maybe try again later. &lt;BR&gt;&lt;BR&gt;Thanks for all the helpful information though Mike!&lt;BR&gt;&lt;BR&gt;Robin&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;!--End group email   --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;  &lt;div&gt;  &lt;HR SIZE=1&gt;  Be a better friend, newshound, and know-it-all with Yahoo! Mobile. &lt;A\n href=&quot;http://us.rd.yahoo.com/evt=51733/*http://mobile.yahoo.com/;_ylt=Ahu06i62sR8HDtDypao8Wcj9tAcJ&quot;&gt;Try it now.&lt;/A&gt;  &lt;div&gt;&lt;/div&gt;&lt;/DIV&gt;&lt;!--End group email\n --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;&lt;P&gt;&nbsp;&lt;/P&gt;\n&lt;OBJECT width=640 height=563&gt;&lt;PARAM NAME=&quot;movie&quot; VALUE=&quot;http://webcamitc.myphotoalbum.com/slideshow.swf?xmlFile=http://webcamitc.myphotoalbum.com/albumFeed.php?set_albumName=album01&quot;&gt;&lt;PARAM NAME=&quot;wmode&quot; VALUE=&quot;transparent&quot;&gt;\n&lt;embed src=&quot;http://webcamitc.myphotoalbum.com/slideshow.swf?xmlFile=http://webcamitc.myphotoalbum.com/albumFeed.php?set_albumName=album01&quot; type=&quot;application/x-shockwave-flash&quot; width=&quot;640&quot; height=&quot;563&quot; wmode=&quot;transparent&quot;&gt;&lt;/embed&gt;&lt;/OBJECT&gt;&lt;p&gt;&#32;\n      &lt;hr size=1&gt;Be a better friend, newshound, and \nknow-it-all with Yahoo! Mobile. &lt;a href=&quot;http://us.rd.yahoo.com/evt=51733/*http://mobile.yahoo.com/;_ylt=Ahu06i62sR8HDtDypao8Wcj9tAcJ &quot;&gt; Try it now.&lt;/a&gt;\r\n--0-1846842096-1199602028=:11740--"}