{"id": "5037", "subject": "Re: [EVP-ITC] Re: MiniBox on eBay and other stuff", "author": "Ron Lederer", "timestamp": "2008-01-07T03:36:00Z", "full_text": "--0-995597621-1199676960=:54273\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nThanks Ron for your informative response.  Very professional.  I&#39;m impressed. I turst Fank is nodding agreement with what you say.   Thanks again.  Ron L in Mexico\n\nRon &lt;countglockula@...&gt; wrote:          I see that there is some speculation about the eBay auctions so want \nto put it to bed...\n\nAs I stated at the beginning of the MiniBox project, the goal is to \nget as many MiniBoxes into researchers&#39; hands as possible, and \nconsidered eBay as a marketing possibility. I arranged for two Boxes \nto go on the block with no reserves to see what open bidding would \nbring.\n\nAs it happens, both units went to active researchers on this forum, \nso in that respect I&#39;m glad it worked out that way. However both \nunits went at low prices, one below cost, so in order to survive we \nhad to set a reserve for future auctions.\n\nWe have also solicited active feedback from all our users so that \nnew ideas and improvements can be added down the line. I&#39;m pleased \nthat Bruce and Steve have been extremely helpful with their ideas \nand suggestions.\n\nAlso, I want it understood that Frank and I have an ongoing dialog \nregarding designs, uses of the Box, improvements and so on. We have \na free and open exchange of ideas. I have asked him to let me know \nif he ever has any problems with using his name. Moreover, anyone \nreading the literature and comments regarding Frank that I have made \ncan see that they are solely to give him credit for his work, and to \nquote things he has said or written to me.\n\nI think many good things come from persons dedicated to a goal. I \ncommend Mike C. for his efforts re: the Shack Hack, and consider it \na great starting place for those who are technically inclined and on \na budget. The search for other suitable radios should commence, if \nit hasn&#39;t already. The key is to cooperate with each other and share \ninformation and results. ASUP will be holding an orientation class \nand training session for users of the Box at its next meeting. They \nwill be researching using a strict testing protocol, and recording \neach session as it happens. Over time, teams using the same gear \nshould be able to collect information which can be collated and \nstudied for patterns. This is the next step in ITC research, and one \nwhich can provide the hard evidence.\n\nRon R\nParanormalSystems.com\n\n\n\n                         \n\n       \n---------------------------------\nLooking for last minute shopping deals?  Find them fast with Yahoo! Search.\r\n--0-995597621-1199676960=:54273\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nThanks Ron for your informative response.&nbsp; Very professional.&nbsp; I&#39;m impressed.&nbsp;I turst Fank is nodding agreement with what you say.&nbsp;&nbsp; Thanks again.&nbsp; Ron L in Mexico&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;Ron &lt;countglockula@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;div&gt;I see that there is some speculation about the eBay auctions so want &lt;BR&gt;to put it to bed...&lt;BR&gt;&lt;BR&gt;As I stated at the beginning of the MiniBox project, the goal is to &lt;BR&gt;get as many MiniBoxes into researchers&#39; hands as possible, and &lt;BR&gt;considered eBay as a marketing possibility. I arranged for two Boxes &lt;BR&gt;to go on the\n block with no reserves to see what open bidding would &lt;BR&gt;bring.&lt;BR&gt;&lt;BR&gt;As it happens, both units went to active researchers on this forum, &lt;BR&gt;so in that respect I&#39;m glad it worked out that way. However both &lt;BR&gt;units went at low prices, one below cost, so in order to survive we &lt;BR&gt;had to set a reserve for future auctions.&lt;BR&gt;&lt;BR&gt;We have also solicited active feedback from all our users so that &lt;BR&gt;new ideas and improvements can be added down the line. I&#39;m pleased &lt;BR&gt;that Bruce and Steve have been extremely helpful with their ideas &lt;BR&gt;and suggestions.&lt;BR&gt;&lt;BR&gt;Also, I want it understood that Frank and I have an ongoing dialog &lt;BR&gt;regarding designs, uses of the Box, improvements and so on. We have &lt;BR&gt;a free and open exchange of ideas. I have asked him to let me know &lt;BR&gt;if he ever has any problems with using his name. Moreover, anyone &lt;BR&gt;reading the literature and comments regarding Frank that I have made &lt;BR&gt;can see that they are solely to give him credit for his work,\n and to &lt;BR&gt;quote things he has said or written to me.&lt;BR&gt;&lt;BR&gt;I think many good things come from persons dedicated to a goal. I &lt;BR&gt;commend Mike C. for his efforts re: the Shack Hack, and consider it &lt;BR&gt;a great starting place for those who are technically inclined and on &lt;BR&gt;a budget. The search for other suitable radios should commence, if &lt;BR&gt;it hasn&#39;t already. The key is to cooperate with each other and share &lt;BR&gt;information and results. ASUP will be holding an orientation class &lt;BR&gt;and training session for users of the Box at its next meeting. They &lt;BR&gt;will be researching using a strict testing protocol, and recording &lt;BR&gt;each session as it happens. Over time, teams using the same gear &lt;BR&gt;should be able to collect information which can be collated and &lt;BR&gt;studied for patterns. This is the next step in ITC research, and one &lt;BR&gt;which can provide the hard evidence.&lt;BR&gt;&lt;BR&gt;Ron R&lt;BR&gt;ParanormalSystems.&lt;WBR&gt;com&lt;BR&gt;&lt;BR&gt;&lt;/div&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;p&gt;&#32;\n      &lt;hr size=1&gt;Looking for last minute shopping deals? &lt;a href=&quot;http://us.rd.yahoo.com/evt=51734/*http://tools.search.yahoo.com/newsearch/category.php?category=shopping&quot;&gt; \nFind them fast with Yahoo! Search.&lt;/a&gt;\r\n--0-995597621-1199676960=:54273--"}