{"id": "5043", "subject": "Re: Check out what I broke this time", "author": "psi_research", "timestamp": "2008-01-07T07:04:43Z", "full_text": "Awesome, thanks for letting me know Ron. Glad to help any way I can. -Bill\n\n--- In EVP-ITC@yahoogroups.com, Ron Lederer &lt;ronriko@...&gt; wrote:\n&gt;\n&gt; Hey Bill Thanks for describing your pin problem.   I&#39;m the guy in\nMexico who recently wrote about trashing his new rs hack.  First the\nbattery cable separated then when fixed nothing.  I never noticed if\nMike said to be certain to line up the pins when putting the card back\ntogether.  You said it so I check and now it actually works.  It is\nsomething like checking the refrigerator light when you try to line up\nthe pins.  The real proof is when the thing powers up.  I also needed\nto realign the five screws to make certain they were in the correct\nholes.  Thanks for the tip.  Ron in Campeche Mexico\n&gt; \n&gt; psi_research &lt;vilhellm@...&gt; wrote:           For me the tricky part\nwas getting the pins lined up to go back into\n&gt; the edge connector after the mute pin has been cut /removed. It&#39;s easy\n&gt; to misalign them and bend one by accident. -Bill\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Robin Searcy Henson&quot;\n&gt; &lt;MudPuddleFarm@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Thanks Joel. I&#39;m not sure that&#39;s the problem anymore, though, as\n&gt; the leads appear to be intact.\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; ----- Original Message ----- \n&gt; &gt; From: joel smith&lt;mailto:sparky1j41@&gt; \n&gt; &gt; To: EVP-ITC@yahoogroups.com&lt;mailto:EVP-ITC@yahoogroups.com&gt; \n&gt; &gt; Sent: Saturday, January 05, 2008 9:33 PM\n&gt; &gt; Subject: Re: [EVP-ITC] Check out what I broke this time\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; you can buy new leads at rs for like` $2.00 and get it to work\n&gt; &gt; \n&gt; &gt; Robin Henson &lt;MudPuddleFarm@&lt;mailto:MudPuddleFarm@&gt;&gt; wrote: \n&gt; &gt; \n&gt; &gt; After viewing Mike&#39;s RS 12-469 hack video for the fifth time I felt \n&gt; &gt; ready to take the plunge myself, so yesterday while dh was\n&gt; picking up \n&gt; &gt; a pizza at Papa John&#39;s I sneaked next door and bought the radio. He \n&gt; &gt; couldn&#39;t stop complaining about how I&#39;d wasted money on a perfectly \n&gt; &gt; good piece of equipment only to wreck it for my dumb hobby, but\n&gt; once \n&gt; &gt; we got home he took it upon himself to test it and make sure it \n&gt; &gt; worked. For some reason it really DIDN&#39;T work, so he took it\n&gt; back to \n&gt; &gt; RS and exchanged it for another one, and after making sure THAT one \n&gt; &gt; worked he even offered to help me with the modification. &quot;No\n&gt; thanks&quot; \n&gt; &gt; I told him. &quot;I think I need to do this myself.&quot; \n&gt; &gt; \n&gt; &gt; I can&#39;t pretend the process went as smoothly as I&#39;d hoped, but \n&gt; &gt; finally I was done and making the last turn in the second screw of \n&gt; &gt; the circuit board.. and then.. The whole thing flew out of my hands \n&gt; &gt; and both battery wires ripped away from their soldered ends in the \n&gt; &gt; casing. It was all Bob could do to keep from gleefully yelling &quot;I \n&gt; &gt; knew you were going to break it!&quot; But then I guess he felt bad \n&gt; &gt; because he ran down to Walmart and got a soldering iron and solder \n&gt; &gt; and spent an hour trying to put it all back together for me. \n&gt; &gt; \n&gt; &gt; It&#39;s dead as a doornail, and I&#39;m thinking that if I could break it \n&gt; &gt; that easily without even knowing how or why, maybe I&#39;m not supposed \n&gt; &gt; to pursue this method (sigh). I guess I&#39;ll just think it over and \n&gt; &gt; maybe try again later. \n&gt; &gt; \n&gt; &gt; Thanks for all the helpful information though Mike!\n&gt; &gt; \n&gt; &gt; Robin\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt;\n&gt; ----------------------------------------------------------\n&gt; &gt; Be a better friend, newshound, and know-it-all with Yahoo! Mobile.\n&gt; Try it\n&gt;\nnow.&lt;http://us.rd.yahoo.com/evt=51733/*http://mobile.yahoo.com/;_ylt=Ahu06i62sR8HDtDypao8Wcj9tAcJ&gt;\n&gt; &gt;\n&gt; \n&gt; \n&gt; \n&gt;                          \n&gt; \n&gt;        \n&gt; ---------------------------------\n&gt; Looking for last minute shopping deals?  Find them fast with Yahoo!\nSearch.\n&gt;"}