{"id": "5044", "subject": "Re: [EVP-ITC] Re: Classic example", "author": "Nick", "timestamp": "2008-01-07T11:21:40Z", "full_text": "With digital cameras, if you are using any kind of auto focus the  \nexposure may change all depending on the lighting and other factors.   \nWhen I can&#39;t find anything to photograph I usually boost my exposure  \nand use different coloured lights to create a neat light whirlwind...  \nthing.  Though from what I&#39;ve heard about the Luminator people are  \nusing polaroids. Most now do have auto focus I believe.  I don&#39;t no  \nmuch about polaroids or the lighting the Luminator is being used in.\n\nPeace,\nNick\nOn Dec 31, 2007, at 3:19 PM, LC Duplatt wrote:\n\n&gt; Just to add Ann&#39;s thought of lengthened exposure, with digital\n&gt; cameras (if one is being used), the flash setting (such as &quot;night\n&gt; time mode&quot;) coupled with slight camera movement will produce light\n&gt; anomalies in the image. ;)\n&gt;\n&gt; LC\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, Lisby &lt;lisby@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; What do mean by &quot;displace&quot;? A long exposure will also cause weird\n&gt; &gt; effects with light.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Ann\n&gt; &gt;\n&gt; &gt; On Dec 30, 2007, at 11:26 PM, Loretta wrote:\n&gt; &gt;\n&gt; &gt; &gt; Ann and all,\n&gt; &gt; &gt;\n&gt; &gt; &gt; About the Luminator....I have seen Luminator pictures where the\n&gt; &gt; &gt; ceiling light was displaced and somewhat distorted. If whatever\n&gt; the\n&gt; &gt; &gt; Luminator does can displace a ceiling light, surely it can also\n&gt; &gt; &gt; displace a human face.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Loretta\n&gt; &gt; &gt;\n&gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com, Lisby &lt;lisby@&gt; wrote:\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; On Dec 29, 2007, at 6:15 PM, Ursula Bielski wrote:\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; I don&#39;t know as there are &quot;hundreds&quot; of examples available to\n&gt; &gt; &gt; the\n&gt; &gt; &gt; &gt; &gt; public in the way of Luminator photographs,\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; I didn&#39;t say that. I said there are hundreds of examples on line\n&gt; &gt; &gt; of\n&gt; &gt; &gt; &gt; known long exposures. When even a few of these are compared with\n&gt; &gt; &gt; &gt; Luminator examples, I see a tremendous similarity. Do you?\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; but there are a couple of dozen in Macy&#39;s book, &quot;Spirit\n&gt; Faces,&quot;\n&gt; &gt; &gt; and\n&gt; &gt; &gt; &gt; &gt; yes, many many of them are open to wide interpretation,\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Does that mean that you agree with my point? Because, as I\n&gt; reason\n&gt; &gt; &gt; &gt; it, they are either spirit extras or they aren&#39;t. They can&#39;t\n&gt; sort-\n&gt; &gt; &gt; of\n&gt; &gt; &gt; &gt; be spirit extras. I&#39;m not sure what other interpretations there\n&gt; &gt; &gt; might\n&gt; &gt; &gt; &gt; be in this instance.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; just as our humble recordings are.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; In addition to that majority that make us say, &quot;Come on!{&quot;\n&gt; &gt; &gt; there\n&gt; &gt; &gt; &gt; &gt; are a handful that make you say &quot;Hmmmmmmm. . . .&quot; Just like we\n&gt; &gt; &gt; &gt; &gt; offer a handful of results from our endless recording efforts\n&gt; to\n&gt; &gt; &gt; &gt; &gt; try to convince the hard-nosed.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; I&#39;d agree with you wholeheartedly, if I had ever seen one that\n&gt; &gt; &gt; did,\n&gt; &gt; &gt; &gt; in fact, make me go, &quot;Hmmmm.&quot; As I said, I have never seen one\n&gt; &gt; &gt; where\n&gt; &gt; &gt; &gt; the sitter and the extra did not share a consistent set of\n&gt; &gt; &gt; features\n&gt; &gt; &gt; &gt; and coloring. If you have any examples that do, and you can\n&gt; share\n&gt; &gt; &gt; &gt; them, I&#39;d be delighted to see them. I&#39;d like my opinion to be\n&gt; &gt; &gt; swayed.\n&gt; &gt; &gt; &gt; Really, I would.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; I would think that many would see the Luminator efforts as a\n&gt; &gt; &gt; modern\n&gt; &gt; &gt; &gt; &gt; effort at scrying.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Do you mean scrying as in the psychomanteum method developed by\n&gt; &gt; &gt; &gt; Raymond Moody? My understanding, from attending a presentation\n&gt; by\n&gt; &gt; &gt; Dr.\n&gt; &gt; &gt; &gt; Moody, was that the psychomanteum produced full-blown\n&gt; apparitions\n&gt; &gt; &gt; &gt; that could converse with the bereaved. Not sure these two types\n&gt; of\n&gt; &gt; &gt; &gt; events are comparable.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; Everything we do crosses boundaries, and my point is that it&#39;s\n&gt; &gt; &gt; &gt; &gt; really hard to walk the line between trying to be scientific\n&gt; and\n&gt; &gt; &gt; &gt; &gt; trying to be open. It&#39;s really, really hard! But if we give in\n&gt; &gt; &gt; one\n&gt; &gt; &gt; &gt; &gt; area, we have to be willing to give in another.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; I don&#39;t think that is arguably true, Ursula. If the evidence\n&gt; &gt; &gt; appears\n&gt; &gt; &gt; &gt; good, I acknowledge it; if the evidence appears weak, I\n&gt; &gt; &gt; acknowledge\n&gt; &gt; &gt; &gt; it. It is simply not true to say that a person cannot be both\n&gt; open-\n&gt; &gt; &gt; &gt; minded and scientific. I really do want to believe, but I won&#39;t\n&gt; &gt; &gt; &gt; believe just because I want to. And because you, me, or anyone\n&gt; &gt; &gt; &gt; &quot;gives&quot; in one area, does not make a phenomenon any more or less\n&gt; &gt; &gt; real.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Your fellow traveler on this journey,\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Ann\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; Ursula\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; Lisby &lt;lisby@&gt; wrote:\n&gt; &gt; &gt; &gt; &gt; This is a classic example of the kind of photo that Mark\n&gt; thinks\n&gt; &gt; &gt; shows\n&gt; &gt; &gt; &gt; &gt; a spirit extra. To me, clearly, this is the same woman--same\n&gt; hair,\n&gt; &gt; &gt; &gt; &gt; same eyes, same mouth, same nose. Again, to me, it looks like\n&gt; a\n&gt; &gt; &gt; &gt; &gt; classic long exposure when compared with other known long\n&gt; &gt; &gt; exposures--\n&gt; &gt; &gt; &gt; &gt; I&#39;ve included just of hundreds of examples.\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; Ann\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;\n&gt; \n\n\nWi h digi al came as, i you a e using any kind o au o ocus he exposu e may change all depending on he ligh ing and o he ac o s.  When I can' ind any hing o pho og aph I usually boos my exposu e and use di e en colou ed ligh s o c ea e a nea ligh  whi lwind... hing.  Though om wha I' e hea d abou he Lumina o people a e using pola oids. Mos now do ha e au o ocus I belie e.  I don' no much abou pola oids o he ligh ing he Lumina o is being used in.Peace,Nick On Dec 31, 2007, a 3:19 PM, LC Dupla w o e:Jus o add Ann's hough o leng hened exposu e, wi h digi al came as (i one is being used), he lash se ing (such as \"nigh   ime mode\") coupled wi h sligh came a mo emen will p oduce ligh  anomalies in he image. ;)LC--- In EVP-ITC@yahoog oups.com, Lisby w o e:>> Wha do mean by \"displace\"? A long exposu e will also cause wei d > e ec s wi h ligh .> > > Ann> > On Dec 30, 2007, a 11:26 PM, Lo e a w o e:> > > Ann and all,> >> > Abou he Lumina o ....I ha e seen Lumina o pic u es whe e he> > ceiling ligh was displaced and somewha dis o ed. I wha e e   he> > Lumina o does can displace a ceiling ligh , su ely i can also> > displace a human ace.> >> > Lo e a> >> > --- In EVP-ITC@yahoog oups.com, Lisby w o e:> > >> > >> > > On Dec 29, 2007, a 6:15 PM, U sula Bielski w o e:> > >> > > >> > > > I don' know as he e a e \"hund eds\" o examples a ailable o> > he> > > > public in he way o Lumina o pho og aphs,> > >> > > I didn' say ha . I said he e a e hund eds o examples on line> > o > > > known long exposu es. When e en a ew o hese a e compa ed wi h> > > Lumina o examples, I see a emendous simila i y. Do you?> > >> > >> > > > bu he e a e a couple o dozen in Macy's book, \"Spi i  Faces,\"> > and> > > > yes, many many o hem a e open o wide in e p e a ion,> > >> > > Does ha mean ha you ag ee wi h my poin ? Because, as I  eason> > > i , hey a e ei he spi i ex as o hey a en' . They can'  so -> > o > > > be spi i ex as. I'm no su e wha o he in e p e a ions he e> > migh > > > be in his ins ance.> > >> > >> > > > jus as ou humble eco dings a e.> > >> > > > In addi ion o ha majo i y ha make us say, \"Come on!{\"> > he e> > > > a e a hand ul ha make you say \"Hmmmmmmm. . . .\" Jus like we> > > > o e a hand ul o esul s om ou endless eco ding e o s  o> > > > y o con ince he ha d-nosed.> > >> > > I'd ag ee wi h you wholehea edly, i I had e e seen one ha > > did,> > > in ac , make me go, \"Hmmmm.\" As I said, I ha e ne e seen one> > whe e> > > he si e and he ex a did no sha e a consis en se o > > ea u es> > > and colo ing. I you ha e any examples ha do, and you can sha e> > > hem, I'd be deligh ed o see hem. I'd like my opinion o be> > swayed.> > > Really, I would.> > >> > > > I would hink ha many would see he Lumina o e o s as a> > mode n> > > > e o a sc ying.> > >> > > Do you mean sc ying as in he psychoman eum me hod de eloped by> > > Raymond Moody? My unde s anding, om a ending a p esen a ion by> > D .> > > Moody, was ha he psychoman eum p oduced ull-blown appa i ions> > > ha could con e se wi h he be ea ed. No su e hese wo ypes o > > > e en s a e compa able.> > >> > > > E e y hing we do c osses bounda ies, and my poin is ha i 's> > > > eally ha d o walk he line be ween ying o be scien i ic and> > > > ying o be open. I 's eally, eally ha d! Bu i we gi e in> > one> > > > a ea, we ha e o be willing o gi e in ano he .> > >> > > I don' hink ha is a guably ue, U sula. I he e idence> > appea s> > > good, I acknowledge i ; i he e idence appea s weak, I> > acknowledge> > > i . I is simply no ue o say ha a pe son canno be bo h open-> > > minded and scien i ic. I eally do wan o belie e, bu I won' > > > belie e jus because I wan o. And because you, me, o anyone> > > \"gi es\" in one a ea, does no make a phenomenon any mo e o less> > eal.> > >> > > You ellow a ele on his jou ney,> > >> > > Ann> > >> > >> > >> > > > U sula> > > >> > > >> > > > Lisby w o e:> > > > This is a classic example o he kind o pho o ha Ma k  hinks> > shows> > > > a spi i ex a. To me, clea ly, his is he same woman--same hai ,> > > > same eyes, same mou h, same nose. Again, o me, i looks like a> > > > classic long exposu e when compa ed wi h o he known long> > exposu es--> > > > I' e included jus o hund eds o examples.> > > >> > > > Ann> > > >> > > >> > > >> > >> >> >> >>"}