{"id": "5045", "subject": "Re: [EVP-ITC] Cross contact for Frank R-  re: Jacob is back?", "author": "Nick", "timestamp": "2008-01-07T11:31:49Z", "full_text": "Mom, you have the mail curse!  Where is the software!?!?\nOn Jan 1, 2008, at 3:39 PM, Lisby wrote:\n\n&gt; Okay--Now I feel better about what I am hearing out of my box. I  \n&gt; get what sounds like very similar conversations. One day my darned  \n&gt; software will get here and I&#39;ll be able to post some samples.\n&gt;\n&gt;\n&gt; Ann\n&gt;\n&gt; On Jan 1, 2008, at 2:26 PM, Misty Dawn wrote:\n&gt;\n&gt;&gt;\n&gt;&gt; Hey Ratka here is one of yours, seems they are still around. I  \n&gt;&gt; decided since it came thru with the frank s stuff yesterday maybe  \n&gt;&gt; I should post this one to group never know maybe Jacob keeps  \n&gt;&gt; poppin up because they know someone around us. They are persistant  \n&gt;&gt; to say the least. A few tried to hush them from speaking over  \n&gt;&gt; others in my session.\n&gt;&gt;\n&gt;&gt; Misty\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; Be a better friend, newshound, and know-it-all with Yahoo! Mobile.  \n&gt;&gt; Try it now.\n&gt;&gt;\n&gt;&gt; &lt;123107EM-pleasemakeaclipoutofjacob.mp3&gt;&lt;123107EM- \n&gt;&gt; yeahbabyuncool.mp3&gt;&lt;123107EM-shelistening-itistoocalm- \n&gt;&gt; ithinksheis.mp3&gt;&lt;123107EM-shhh shutupjakeletslistenin-no- \n&gt;&gt; shhh.mp3&gt;&lt;123107EM-imyourfirstaccident.mp3&gt;&lt;123107EM- \n&gt;&gt; imadeitsoicouldhavehopetospeakwithyourbox.mp3&gt;\n&gt;\n&gt;\n&gt; \n\n\nMom, you ha e he mail cu se!  Whe e is he so wa e!?!?On Jan 1, 2008, a 3:39 PM, Lisby w o e:Okay--Now I eel be e abou wha I am hea ing ou o my box. I ge wha sounds like e y simila con e sa ions. One day my da ned so wa e will ge he e and I'll be able o pos some samples.AnnOn Jan 1, 2008, a 2:26 PM, Mis y Dawn w o e:Hey Ra ka he e is one o you s, seems hey a e s ill a ound. I decided since i came h u wi h he ank s s u yes e day maybe I should pos his one o g oup ne e know maybe Jacob keeps poppin up because hey know someone a ound us. They a e pe sis an o say he leas . A ew ied o hush hem om speaking o e o he s in my session. Mis y     Be a be e iend, newshound, and know-i -all wi h Yahoo! Mobile. T y i now.aclipou o jacob.mp3>cool.mp3>ng-i is oocalm-i hinksheis.mp3>nin-no-shhh.mp3> acciden .mp3>couldha ehope ospeakwi hyou box.mp3>"}