{"id": "5089", "subject": "Re: The incessant testing.", "author": "Frank Sumption", "timestamp": "2008-01-08T06:36:16Z", "full_text": "I never log anything! I used to keep track, but it seemed useless as \nfar as proof went, and not too many were iterested. It would have \nbeen nice to have kept better notes about what I have done so far. \n\n Frank-S\n\n--- In EVP-ITC@yahoogroups.com, juli velazquez &lt;ghostchasingfool@...&gt; \nwrote:\n&gt;\n&gt; I have actually composed a log sheet for each testing session.  I \nbelieve Bruce is reviewing it to make sure I didn&#39;t leave out any \nimportant information that we should also be logging.  Once I get the \nfinal ok, I will up load it and you can use it to recorded your data.\n&gt;    \n&gt;   Thanks!\n&gt;   Juli\n&gt; \n&gt; mllejade &lt;leongbabe@...&gt; wrote:\n&gt;           Frank,\n&gt; \n&gt; Since we&#39;re communicating with another dimension(s), then we should \n&gt; also note the time, weather, phases of the moon, any geomagnetic \n&gt; activity, solar flares, seismic activity, etc. in our area when \n&gt; conducting EVP sessions to see if we can determine when conditions \n&gt; are best for communicating.\n&gt; \n&gt; BTW, that&#39;s quite a colorful set-up you have! It kinda looks like \n&gt; modern art. :)\n&gt; \n&gt; Sharon\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@&gt; \n&gt; wrote:\n&gt; &gt;\n&gt; &gt; \n&gt; &gt; Never fails, when I think I have something figured out, all I \nhave \n&gt; to do is re-test, or change the set up slightly, and get totally \n&gt; different results. It seemed for a while that the sound \nchamber/echo \n&gt; box was not needed, but last night&#39;s voices were so much better--\nand \n&gt; longer, with that larger box with the crystal ball on top. I think \nit \n&gt; just depends on those undefinable conditions that govern \ncommnication \n&gt; for the other side, we have to be able to change our setup as \nneeded, \n&gt; or as intuition dictates. I didn&#39;t have time to copy the voices tot \n&gt; he computer, as I&#39;m back on a regualr sched now. \n&gt; &gt; \n&gt; &gt; Frank-S\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; __________________________________________________________\n&gt; &gt; Get the power of Windows + Web with the new Windows Live.\n&gt; &gt; http://www.windowslive.com?\n&gt; ocid=TXT_TAGHM_Wave2_powerofwindows_012008\n&gt; &gt;\n&gt; \n&gt; \n&gt; \n&gt;                          \n&gt; \n&gt; \n&gt;   The contents of this eletronic correspondence is private & \nconfidential and meant only for the party and/or parties it is \naddressed to.  \n&gt;    \n&gt;   No part of this email transmission may be publicly posted or \nforwarded to other parties without explicit written permission.\n&gt;"}