{"id": "5093", "subject": "Re: [EVP-ITC] A file from Frank&#39;s box #12 pertaining to lisby&#39;s technition", "author": "Lisby", "timestamp": "2008-01-08T10:05:57Z", "full_text": "I&#39;m assuming something similar about Seven.\n\n\nOn Jan 7, 2008, at 11:26 PM, Misty Dawn wrote:\n\n&gt;\n&gt; Maybe they just dont have a name. Some entities never were human or  \n&gt; had &quot;names&quot;. I have had a few that others have given names or used  \n&gt; terms for them.\n&gt;\n&gt; Just a thought.\n&gt;\n&gt; Misty\n&gt;\n&gt; bruce halliday &lt;paranormalinvestigating@...&gt; wrote:\n&gt; Ann,\n&gt;\n&gt; From what I can discern from mike and Lisa&#39;s communication  \n&gt; regarding techs/guardians\n&gt; is that a tech is assigned to a researcher here on earth based on  \n&gt; their compatible energy and harmonic vibration.\n&gt; That is not so easy to do, so every time you do a session there is  \n&gt; a temp assigned for that particular session.\n&gt;\n&gt; Give it some more time and keep asking but I&#39;m sure when you do get  \n&gt; yours it will be a special relationship.\n&gt;\n&gt; In other words you have to kiss the exact right frog for him to  \n&gt; turn into your prince aah or princess\n&gt;\n&gt; I will keep the subject open with mike and Lisa until I get a  \n&gt; definitive answer or you do.\n&gt;\n&gt; Bruce\n&gt;\n&gt;\n&gt; Bruce Halliday\n&gt;\n&gt;\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; From: lisby@...\n&gt; Date: Mon, 7 Jan 2008 11:27:46 -0500\n&gt; Subject: Re: [EVP-ITC] A file from Frank&#39;s box #12 pertaining to  \n&gt; lisby&#39;s technition\n&gt;\n&gt; Hmmmm. That second bit gave me the creepies, I must say. What are  \n&gt; your thoughts on that, Bruce? I hear Lisa&#39;s name at least a dozen  \n&gt; times each time I run a session, so I feel confident that she is  \n&gt; there, so I feel confident that I&#39;m not in the hands of someone I  \n&gt; don&#39;t want to be in. Maybe they are still auditioning for the role?\n&gt;\n&gt;\n&gt; On Jan 7, 2008, at 9:49 AM, bhali333 wrote:\n&gt;\n&gt; the precedeing file was from a question about Ann&#39;s technition on\n&gt; 12-08-07\n&gt;\n&gt; Bruce\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Put your friends on the big screen with Windows Vista® + Windows  \n&gt; Live™. Start now!\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Be a better friend, newshound, and know-it-all with Yahoo! Mobile.  \n&gt; Try it now.\n&gt;\n&gt; \n\n\nI'm assuming some hing simila abou Se en.On Jan 7, 2008, a 11:26 PM, Mis y Dawn w o e:Maybe hey jus don ha e a name. Some en i ies ne e we e human o had \"names\". I ha e had a ew ha o he s ha e gi en names o used e ms o hem. Jus a hough . Mis yb uce halliday ing@ho mail.com> w o e:Ann, F om wha I can disce n om mike and Lisa's communica ion ega ding echs/gua diansis ha a ech is assigned o a esea che he e on ea h based on hei compa ible ene gy and ha monic ib a ion.Tha is no so easy o do, so e e y ime you do a session he e is a emp assigned o ha pa icula session. Gi e i some mo e ime and keep asking bu I'm su e when you do ge you s i will be a special ela ionship. In o he wo ds you ha e o kiss he exac igh og o him o u n in o you p ince aah o p incess  I will keep he subjec open wi h mike and Lisa un il I ge a de ini i e answe o you do. B uceB uce Halliday To: EVP-ITC@yahoog oups.comF om: lisby@ea hlink.ne Da e: Mon, 7 Jan 2008 11:27:46 -0500Subjec : Re: [EVP-ITC] A ile om F ank's box #12 pe aining o lisby's echni ionHmmmm. Tha second bi ga e me he c eepies, I mus say. Wha a e you hough s on ha , B uce? I hea Lisa's name a leas a dozen imes each ime I un a session, so I eel con iden ha she is he e, so I eel con iden ha I'm no in he hands o someone I don' wan o be in. Maybe hey a e s ill audi ioning o he ole?On Jan 7, 2008, a 9:49 AM, bhali333 w o e: he p ecedeing ile was om a ques ion abou Ann's echni ion on 12-08-07B ucePu you iends on he big sc een wi h Windows Vis a® + Windows Li e™. S a now! Be a be e iend, newshound, and know-i -all wi h Yahoo! Mobile. T y i now."}