{"id": "5099", "subject": "Re: Box in the morning", "author": "Ron", "timestamp": "2008-01-08T15:48:05Z", "full_text": "I fully agree with Bruce&#39;s comment about not leaving a Box running \nwithout supplying input or asking questions. After I build each \nMiniBox, my original practice was to leave it running overnight as a \nburn-in to insure that if there was an early failure, it would \nhappen before the device was shipped. After a while I noticed the \nBoxes would begin cursing or calling me by name repeatedly. By then \nI realized that anytime the Box is activated, entities will attempt \nto communicate within a minute or so. They seem to sense that \na &#39;portal&#39; is open so crowd around and try to get the operators \nattention.\n\nI have since changed my procedures and have limited my tests to \npower-up and then alignment, and indicate verbally to \nwhoever/whatever is present that this is a test and I am not trying \nto communicate, but to just insure that the device is working \nproperly before sending it to its new owner. The incidence of bad \nlanguage has totally disappeared and the Box is actually remarkably \nquiet during this process. As I final test I do a very short test so \nconfirm that communications are being made, then thank the entity \nand sign off.\n\nAs I have stressed repeatedly, this device, whether a MiniBox, \nFrank&#39;s Box, RS Hack, Joe&#39;s Box, or whatever, it NOT a toy and \nshould be treated with respect. Until more is known, sessions should \nbe handled with care and documented properly. I am attempting to \ngather and rewrite my operations guidelines and welcome input from \neveryone. These guidelines are device-independent. I want to insure \nthat all persons who read them are using the device properly and \nwith the correct attitude.\n\nRon Ricketts\nParanormalSystems.com\n\n--- In EVP-ITC@yahoogroups.com, bruce halliday \n&lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; \n&gt; Nick,\n&gt;  \n&gt; My advice as a long time researcher is not to just turn the box on \nand leave it running \n&gt; unless you intend to do a session and give your friends on the \nother side that are working\n&gt; extremely hard to send you the communication your undivided \nattention.\n&gt;  \n&gt; It&#39;s kind of like calling someone on the phone and when they start \na conversation you decide to\n&gt; put the phone down and focus your attention on other things.\n&gt;  \n&gt; There are other researchers that feel that there is nothing wrong \nwith this practice and do it on occasion\n&gt; But I have come to the understanding that it is deemed \ndisrespectful and while you may be listening with \n&gt; one ear as you do something else, you will hear a loud curse word \nor nasty statement, that is their way \n&gt; of getting your attention back. I have gotten numerous messages \nabout the difficulty of the attempts for \n&gt; them to communicate so when I turn the box on it gets my full \nattention. just some experienced advice.\n&gt;  \n&gt; As for them telling you to close the portal, it could have two \nmeanings. Sometimes they refer to box that\n&gt; is turned on and in use as a portal for the simple reason that \neach time we turn a box on to communicate \n&gt; it opens a direct open link between our realm and theirs so in \nessence it is an open door for anything to pass in or out.\n&gt;  \n&gt; that is why when I end a session I always ask my technician to \nbring back any spirits that may have come through the \n&gt; portal during the session and I ask for conformation and 10 times \nout of ten will get &quot;OK&quot; or &quot;OK THEY ARE BACK&quot;\n&gt;  \n&gt; also they may have meant since you had the box running and where \nnot doing a actual session to shut the box so \n&gt; that they could go and not have to protect the open connection \nfrom any negative entities that where able cross through the open\n&gt; portal.\n&gt;  \n&gt; A few researchers have been receiving numerous messages about the \nnumber 7 within the past month. The only known \n&gt; significance that the number 7 has in evp research is the 7 \nentities that controlled communication back in the eighties and \nnineties\n&gt; during the spiricom and luxembourg era. To receive this number in \nmessages so often and by more than one researcher, odiously\n&gt; holds some importance which they have not been able or are not \nready to convey.\n&gt;  \n&gt; If you need any help or have any questions please feel free to ask.\n&gt;  \n&gt; Bruce\n&gt; Bruce Halliday \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: thegreatwolf@...: Tue, 8 Jan 2008 06:27:07 -\n0500Subject: [EVP-ITC] Box in the morning\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Hey,Anyone have any odd problems in the morning with using it. I \nam sitting here checking my email so i just thought i&#39;d turn it on \nand... not check my email. Anywho.... Then right at about 6:20 i \nheard a voice say &quot;Nicholas Etheridge please turn off the dsfnlsd&quot; \nnot quite sure what word it used... possibly portal. I just thought \nit was weird. Also under all of the jumble and this voice speaking i \nheard a deep male voice almost chanting &quot;seven&quot;. Not sure if I \nactually heard this or its the want to have an excuse to stay home \nand not take the HSAs.Anyway.. just curious if anyone has gotten \nheard this or if they know something I don&#39;t about using the box in \nthe morning.Peace,Nick \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Get the power of Windows + Web with the new Windows Live.\n&gt; http://www.windowslive.com?\nocid=TXT_TAGHM_Wave2_powerofwindows_012008\n&gt;"}