{"id": "5102", "subject": "RE: [EVP-ITC] Re: A file from Frank&#39;s box #12 pertaining to lisby&#39;s technition", "author": "lisby@earthlink.net", "timestamp": "2008-01-08T16:40:02Z", "full_text": "body{ on - amily: Gene a,A ial,Hel e ica,sans-se i ; on -size:9p ;backg ound-colo : # ;colo : black;}\n\n\n\n\n\nI'm ge ing he hough ha Lisa is bouncing a ound be ween us. She's e y dominan e e y ime I un a session and I' e go en some good s u om he , which I will sho ly be able o pos , I hope. Abou a week ago, I go a eally ex ao dina y sequence ha an some hing along he lines o a male saying, \"Lisa, can you do i ?\" ollowed by a clea emale oice saying, \"Tes ing. Beginning. G ound,\" and hen a second emale oice saying \"Kick.\" I was loo ed.Anyway, Lisa seems o be he d i e o a lo o wha is going on igh now. Maybe she in ends o wo k wi h a numbe o us?Ann-----O iginal Message-----\nF om: b uce halliday \nSen : Jan 8, 2008 9:22 AM\nTo: e p-i c@yahoog oups.com\nSubjec : RE: [EVP-ITC] Re: A ile om F ank's box #12 pe aining o lisby's echni ion\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n \n\n\nF ank,\n \nI ha e wo echs ha I speak wi h on a daily basis and one o hem\nis Lisa. She could possibly be con ac ing you wi h he echnical in o she ied o gi e me\nyes e day.\n \nB uce\nB uce Halliday \n\n\nTo: EVP-ITC@yahoog oups.comF om: anks-boxes@ho mail.comDa e: Tue, 8 Jan 2008 06:39:54 +0000Subjec : [EVP-ITC] Re: A ile om F ank's box #12 pe aining o lisby's echni ion\n\n\n\n\nI' e been ge ing Lisa oo, bu so a no in any segmen s an e ed o he PC. E en onigh I hea d he , bu no while I was aping. F ank-S--- In EVP-ITC@yahoog oups.com, Lisby w o e:>> Hmmmm. Tha second bi ga e me he c eepies, I mus say. Wha a e > you hough s on ha , B uce? I hea Lisa's name a leas a dozen > imes each ime I un a session, so I eel con iden ha she is > he e, so I eel con iden ha I'm no in he hands o someone I > don' wan o be in. Maybe hey a e s ill audi ioning o he ole?> > > On Jan 7, 2008, a 9:49 AM, bhali333 w o e:> > > he p ecedeing ile was om a ques ion abou Ann's echni ion on> > 12-08-07> >> > B uce> >> >> >> \n\n\n\n\n\nMake dis an amily no so dis an wi h Windows Vis a® + Windows Li e™. S a now!"}