{"id": "5115", "subject": "Re: Box in the morning", "author": "Steve Hultay", "timestamp": "2008-01-08T23:45:11Z", "full_text": "Just to give my take on the topic.  Bruce has done box research \nalmost as long as i have and has had similar results with various \nboxes.  However, i tend to leave the box run on occasion to help with \nthe communication.  Sometimes i get blocked or they are struggling \nfor some reason to come through and at that point i leave it run.  I \nlet them know that i am leaving the box running and to work there way \nthrough to find the right frequency again.  They usually say ok and i \nwalk away and after that the next session usually produces better \nresults.  I really don&#39;t think it&#39;s disrespectful to do that, i just \nfeel that leaving it on helps them work on their communication skills \nand seems to work for me.  I do also use the &quot;Go back&quot; theory before \ni shut it off, that theory dates back to a time i seemed to have \ntrouble with noises and stuff in my house and it was box related.  \nBox or any other device i believe opens a portal and needs to be \nclosed on completion of the session.  Although, they are always \naround and really could come and go as they please. But using these \nboxes is like a great big &quot;COME ON IN&quot; sign and you need to use \ncommon sense.\n\n-Steve H.\n\n--- In EVP-ITC@yahoogroups.com, bruce halliday \n&lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; \n&gt; Nick,\n&gt;  \n&gt; My advice as a long time researcher is not to just turn the box on \nand leave it running \n&gt; unless you intend to do a session and give your friends on the \nother side that are working\n&gt; extremely hard to send you the communication your undivided \nattention.\n&gt;  \n&gt; It&#39;s kind of like calling someone on the phone and when they start \na conversation you decide to\n&gt; put the phone down and focus your attention on other things.\n&gt;  \n&gt; There are other researchers that feel that there is nothing wrong \nwith this practice and do it on occasion\n&gt; But I have come to the understanding that it is deemed \ndisrespectful and while you may be listening with \n&gt; one ear as you do something else, you will hear a loud curse word \nor nasty statement, that is their way \n&gt; of getting your attention back. I have gotten numerous messages \nabout the difficulty of the attempts for \n&gt; them to communicate so when I turn the box on it gets my full \nattention. just some experienced advice.\n&gt;  \n&gt; As for them telling you to close the portal, it could have two \nmeanings. Sometimes they refer to box that\n&gt; is turned on and in use as a portal for the simple reason that each \ntime we turn a box on to communicate \n&gt; it opens a direct open link between our realm and theirs so in \nessence it is an open door for anything to pass in or out.\n&gt;  \n&gt; that is why when I end a session I always ask my technician to \nbring back any spirits that may have come through the \n&gt; portal during the session and I ask for conformation and 10 times \nout of ten will get &quot;OK&quot; or &quot;OK THEY ARE BACK&quot;\n&gt;  \n&gt; also they may have meant since you had the box running and where \nnot doing a actual session to shut the box so \n&gt; that they could go and not have to protect the open connection from \nany negative entities that where able cross through the open\n&gt; portal.\n&gt;  \n&gt; A few researchers have been receiving numerous messages about the \nnumber 7 within the past month. The only known \n&gt; significance that the number 7 has in evp research is the 7 \nentities that controlled communication back in the eighties and \nnineties\n&gt; during the spiricom and luxembourg era. To receive this number in \nmessages so often and by more than one researcher, odiously\n&gt; holds some importance which they have not been able or are not \nready to convey.\n&gt;  \n&gt; If you need any help or have any questions please feel free to ask.\n&gt;  \n&gt; Bruce\n&gt; Bruce Halliday \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: thegreatwolf@...: Tue, 8 Jan 2008 06:27:07 -\n0500Subject: [EVP-ITC] Box in the morning\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Hey,Anyone have any odd problems in the morning with using it. I am \nsitting here checking my email so i just thought i&#39;d turn it on \nand... not check my email. Anywho.... Then right at about 6:20 i \nheard a voice say &quot;Nicholas Etheridge please turn off the dsfnlsd&quot; \nnot quite sure what word it used... possibly portal. I just thought \nit was weird. Also under all of the jumble and this voice speaking i \nheard a deep male voice almost chanting &quot;seven&quot;. Not sure if I \nactually heard this or its the want to have an excuse to stay home \nand not take the HSAs.Anyway.. just curious if anyone has gotten \nheard this or if they know something I don&#39;t about using the box in \nthe morning.Peace,Nick \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Get the power of Windows + Web with the new Windows Live.\n&gt; http://www.windowslive.com?\nocid=TXT_TAGHM_Wave2_powerofwindows_012008\n&gt;"}