{"id": "5129", "subject": "Re: [EVP-ITC] Box in the morning", "author": "Nick", "timestamp": "2008-01-09T11:25:30Z", "full_text": "Just FYI, I had stopped checking my email at that time and was trying  \nto get someone to say something.  I usually can&#39;t get my self to not  \npay attention to the box when i turn it on.\nOn Jan 8, 2008, at 9:19 AM, bruce halliday wrote:\n\n&gt; Nick,\n&gt;\n&gt; My advice as a long time researcher is not to just turn the box on  \n&gt; and leave it running\n&gt; unless you intend to do a session and give your friends on the  \n&gt; other side that are working\n&gt; extremely hard to send you the communication your undivided attention.\n&gt;\n&gt; It&#39;s kind of like calling someone on the phone and when they start  \n&gt; a conversation you decide to\n&gt; put the phone down and focus your attention on other things.\n&gt;\n&gt; There are other researchers that feel that there is nothing wrong  \n&gt; with this practice and do it on occasion\n&gt; But I have come to the understanding that it is deemed  \n&gt; disrespectful and while you may be listening with\n&gt; one ear as you do something else, you will hear a loud curse word  \n&gt; or nasty statement, that is their way\n&gt; of getting your attention back. I have gotten numerous messages  \n&gt; about the difficulty of the attempts for\n&gt; them to communicate so when I turn the box on it gets my full  \n&gt; attention. just some experienced advice.\n&gt;\n&gt; As for them telling you to close the portal, it could have two  \n&gt; meanings. Sometimes they refer to box that\n&gt; is turned on and in use as a portal for the simple reason that each  \n&gt; time we turn a box on to communicate\n&gt; it opens a direct open link between our realm and theirs so in  \n&gt; essence it is an open door for anything to pass in or out.\n&gt;\n&gt; that is why when I end a session I always ask my technician to  \n&gt; bring back any spirits that may have come through the\n&gt; portal during the session and I ask for conformation and 10 times  \n&gt; out of ten will get &quot;OK&quot; or &quot;OK THEY ARE BACK&quot;\n&gt;\n&gt; also they may have meant since you had the box running and where  \n&gt; not doing a actual session to shut the box so\n&gt; that they could go and not have to protect the open connection from  \n&gt; any negative entities that where able cross through the open\n&gt; portal.\n&gt;\n&gt; A few researchers have been receiving numerous messages about the  \n&gt; number 7 within the past month. The only known\n&gt; significance that the number 7 has in evp research is the 7  \n&gt; entities that controlled communication back in the eighties and  \n&gt; nineties\n&gt; during the spiricom and luxembourg era. To receive this number in  \n&gt; messages so often and by more than one researcher, odiously\n&gt; holds some importance which they have not been able or are not  \n&gt; ready to convey.\n&gt;\n&gt; If you need any help or have any questions please feel free to ask.\n&gt;\n&gt; Bruce\n&gt;\n&gt;\n&gt;\n&gt; Bruce Halliday\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; From: thegreatwolf@...\n&gt; Date: Tue, 8 Jan 2008 06:27:07 -0500\n&gt; Subject: [EVP-ITC] Box in the morning\n&gt;\n&gt; Hey,\n&gt; Anyone have any odd problems in the morning with using it. I am\n&gt; sitting here checking my email so i just thought i&#39;d turn it on\n&gt; and... not check my email. Anywho.... Then right at about 6:20 i\n&gt; heard a voice say &quot;Nicholas Etheridge please turn off the dsfnlsd&quot;\n&gt; not quite sure what word it used... possibly portal. I just thought\n&gt; it was weird. Also under all of the jumble and this voice speaking i\n&gt; heard a deep male voice almost chanting &quot;seven&quot;. Not sure if I\n&gt; actually heard this or its the want to have an excuse to stay home\n&gt; and not take the HSAs.\n&gt;\n&gt; Anyway.. just curious if anyone has gotten heard this or if they know\n&gt; something I don&#39;t about using the box in the morning.\n&gt;\n&gt; Peace,\n&gt; Nick\n&gt;\n&gt;\n&gt; Get the power of Windows + Web with the new Windows Live. Get it now!\n&gt;\n&gt; \n\n\nJus FYI, I had s opped checking my email a ha ime and was ying o ge someone o say some hing.  I usually can' ge my sel o no pay a en ion o he box when i u n i on.On Jan 8, 2008, a 9:19 AM, b uce halliday w o e:Nick, My ad ice as a long ime esea che is no o jus u n he box on and lea e i unning unless you in end o do a session and gi e you iends on he o he side ha a e wo kingex emely ha d o send you he communica ion you undi ided a en ion. I 's kind o like calling someone on he phone and when hey s a a con e sa ion you decide opu he phone down and ocus you a en ion on o he hings. The e a e o he esea che s ha eel ha he e is no hing w ong wi h his p ac ice and do i on occasionBu I ha e come o he unde s anding ha i is deemed dis espec ul and while you may be lis ening wi h one ea as you do some hing else, you will hea a loud cu se wo d o nas y s a emen , ha is hei way o ge ing you a en ion back. I ha e go en nume ous messages abou he di icul y o he a emp s o   hem o communica e so when I u n he box on i ge s my ull a en ion. jus some expe ienced ad ice. As o hem elling you o close he po al, i could ha e wo meanings. Some imes hey e e o box ha is u ned on and in use as a po al o he simple eason ha each ime we u n a box on o communica e i opens a di ec open link be ween ou ealm and hei s so in essence i is an open doo o any hing o pass in o ou .  ha is why when I end a session I always ask my echnician o b ing back any spi i s ha may ha e come h ough he po al du ing he session and I ask o con o ma ion and 10 imes ou o en will ge \"OK\" o \"OK THEY ARE BACK\" also hey may ha e mean since you had he box unning and whe e no doing a ac ual session o shu he box so  ha hey could go and no ha e o p o ec he open connec ion om any nega i e en i ies ha whe e able c oss h ough he openpo al. A ew esea che s ha e been ecei ing nume ous messages abou he numbe 7 wi hin he pas mon h. The only known signi icance ha he numbe 7 has in e p esea ch is he 7 en i ies ha con olled communica ion back in he eigh ies and nine iesdu ing he spi icom and luxembou g e a. To ecei e his numbe in messages so o en and by mo e han one esea che , odiouslyholds some impo ance which hey ha e no been able o a e no eady o con ey. I you need any help o ha e any ques ions please eel ee o ask. B uceB uce Halliday To: EVP-ITC@yahoog oups.comF om: heg ea wol @ea hlink.ne Da e: Tue, 8 Jan 2008 06:27:07 -0500Subjec : [EVP-ITC] Box in he mo ningHey,Anyone ha e any odd p oblems in he mo ning wi h using i . I am si ing he e checking my email so i jus hough i'd u n i on and... no check my email. Anywho.... Then igh a abou 6:20 i hea d a oice say \"Nicholas E he idge please u n o he ds nlsd\" no qui e su e wha wo d i used... possibly po al. I jus hough  i was wei d. Also unde all o he jumble and his oice speaking i hea d a deep male oice almos chan ing \"se en\". No su e i I ac ually hea d his o i s he wan o ha e an excuse o s ay home and no ake he HSAs.Anyway.. jus cu ious i anyone has go en hea d his o i hey know some hing I don' abou using he box in he mo ning.Peace,NickGe he powe o Windows + Web wi h he new Windows Li e. Ge i now!"}