{"id": "5134", "subject": "RE: [EVP-ITC] Box in the morning", "author": "bruce halliday", "timestamp": "2008-01-09T15:51:39Z", "full_text": "--_6bb92e42-9f4a-4d02-b159-49320e33aeac_\r\nContent-Type: text/plain; charset=&quot;Windows-1252&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n\nNick,\n \nYou are a new member and a possible researcher so I do not want to=\r\n get off on the wrong foot\nIt sounds like you may have taken what I said as=\r\n criticism, It was not meant to be.\nJust experienced advice. There are some=\r\n researchers that believe it is beneficial to leave \na box running and unat=\r\ntended, so that our spirit friends can &quot;imprint&quot; to the frequency of the bo=\r\nx\n \nThat is not at all necessary, Spirit techs do need to imprint to certai=\r\nn boxes but do so through two way communication\nyou see they also imprint t=\r\nhe energy signature of the user of the box also. And that can only be accom=\r\nplished through \ncommunicative interaction during a session. If the box is =\r\nleft unattended they may only accomplish half of what they need to do.\n \nAl=\r\nso I have had first hand experience with certain researchers that do practi=\r\nce this lackadaisical us of a box and had begun to \nget less and less commu=\r\nnication during attempts at actual sessions and eventually nothing but nega=\r\ntive entities coming through.\nI am not saying this is solely due to doing a=\r\nn absent session which is what I have come to call it, It entails man6y fac=\r\ntors.\n \nBut the absent session practice definitely contributes to the ultim=\r\nate failure of communication. \nNick, it is better for you to establish soli=\r\nd research practices in the beginning that will serve to enhance your commu=\r\nnication \nskills and growth in the future.\n \nRemember your spirit contacts =\r\nor &quot;technicians&quot; will become not only the facilitators of your link and com=\r\nmunication from the\nother side but they will become your trusted friends an=\r\nd protectors. you would never leave your buddy on the phone and go \non to s=\r\nomething else while he remained on the line calling for you to speak with h=\r\nim. Our spirit friends where people just like us\nat one time and the emotio=\r\nns we carry in the physical also carry over to our spirit lives.\n \nI hope y=\r\nou do not take this as preaching or criticism it is just experience from co=\r\nmmunicating with my own techs and friends\nand gathering information on what=\r\n they feel and expect from us as researchers.\nRemember all we have to do is=\r\n turn on a box and listen and record their job to send the communication \nn=\r\no matter how short the phrase or word is a 1000x harder for them so don&#39;t y=\r\nou think they deserve a 100% \nof our attention when we open the lines of co=\r\nmmunication.\n \nAlso in closing let me say that my belief on &quot;imprinting&quot; of=\r\n a box is for boxes like Frank&#39;s box and the mini box, for the simple\nreaso=\r\nn that they are individually made and each carry a slightly different frequ=\r\nency range, indicative to that particular box.\nThe radio shack hack box on =\r\nthe other hand is manufactured in china most likely on an automated assembl=\r\ny line so each\ncircuit board is exactly like the next, this being the case =\r\nI believe that when our friends imprinted on the first of the RS boxes\nit w=\r\nas sufficient for most of the others. That is why people experience immedia=\r\nte communication right out of the box.\n \nSo therefore the RS box does not n=\r\need that grace period to &quot;Imprint&quot;\n \nThese comments and statements are my o=\r\nwn hypothesis based on my own extensive research with every type of box tha=\r\nt is made to date\nand I am only offering it so that it may help others to a=\r\nvoid the toil and mistakes that I have endured.\n \nthanks for giving me the =\r\nsoap box once again!\n \nBruce\nBruce Halliday \n\n\nTo: EVP-ITC@yahoogroups.comF=\r\nrom: thegreatwolf@...: Wed, 9 Jan 2008 06:25:30 -0500Subject:=\r\n Re: [EVP-ITC] Box in the morning\n\n\n\n\nJust FYI, I had stopped checking my e=\r\nmail at that time and was trying to get someone to say something.  I usuall=\r\ny can&#39;t get my self to not pay attention to the box when i turn it on.\n\nOn =\r\nJan 8, 2008, at 9:19 AM, bruce halliday wrote:\n\n\n\n\nNick, My advice as a lon=\r\ng time researcher is not to just turn the box on and leave it running unles=\r\ns you intend to do a session and give your friends on the other side that a=\r\nre workingextremely hard to send you the communication your undivided atten=\r\ntion. It&#39;s kind of like calling someone on the phone and when they start a =\r\nconversation you decide toput the phone down and focus your attention on ot=\r\nher things. There are other researchers that feel that there is nothing wro=\r\nng with this practice and do it on occasionBut I have come to the understan=\r\nding that it is deemed disrespectful and while you may be listening with on=\r\ne ear as you do something else, you will hear a loud curse word or nasty st=\r\natement, that is their way of getting your attention back. I have gotten nu=\r\nmerous messages about the difficulty of the attempts for them to communicat=\r\ne so when I turn the box on it gets my full attention. just some experience=\r\nd advice. As for them telling you to close the portal, it could have two me=\r\nanings. Sometimes they refer to box thatis turned on and in use as a portal=\r\n for the simple reason that each time we turn a box on to communicate it op=\r\nens a direct open link between our realm and theirs so in essence it is an =\r\nopen door for anything to pass in or out. that is why when I end a session =\r\nI always ask my technician to bring back any spirits that may have come thr=\r\nough the portal during the session and I ask for conformation and 10 times =\r\nout of ten will get &quot;OK&quot; or &quot;OK THEY ARE BACK&quot; also they may have meant sin=\r\nce you had the box running and where not doing a actual session to shut the=\r\n box so that they could go and not have to protect the open connection from=\r\n any negative entities that where able cross through the openportal. A few =\r\nresearchers have been receiving numerous messages about the number 7 within=\r\n the past month. The only known significance that the number 7 has in evp r=\r\nesearch is the 7 entities that controlled communication back in the eightie=\r\ns and ninetiesduring the spiricom and luxembourg era. To receive this numbe=\r\nr in messages so often and by more than one researcher, odiouslyholds some =\r\nimportance which they have not been able or are not ready to convey. If you=\r\n need any help or have any questions please feel free to ask. Bruce\nBruce H=\r\nalliday \n\n\nTo: EVP-ITC@yahoogroups.comFrom: thegreatwolf@...:=\r\n Tue, 8 Jan 2008 06:27:07 -0500Subject: [EVP-ITC] Box in the morning\n\n\nHey,=\r\nAnyone have any odd problems in the morning with using it. I am sitting her=\r\ne checking my email so i just thought i&#39;d turn it on and... not check my em=\r\nail. Anywho.... Then right at about 6:20 i heard a voice say &quot;Nicholas Ethe=\r\nridge please turn off the dsfnlsd&quot; not quite sure what word it used... poss=\r\nibly portal. I just thought it was weird. Also under all of the jumble and =\r\nthis voice speaking i heard a deep male voice almost chanting &quot;seven&quot;. Not =\r\nsure if I actually heard this or its the want to have an excuse to stay hom=\r\ne and not take the HSAs.Anyway.. just curious if anyone has gotten heard th=\r\nis or if they know something I don&#39;t about using the box in the morning.Pea=\r\nce,Nick\n\nGet the power of Windows + Web with the new Windows Live. Get it n=\r\now! \n\n \n\n\n\n\n\n\n_____________________________________________________________=\r\n____\nPut your friends on the big screen with Windows Vista=AE + Windows Liv=\r\ne=99.\nhttp://www.microsoft.com/windows/shop/specialoffers.mspx?ocid=3DTXT_T=\r\nAGLM_CPC_MediaCtr_bigscreen_012008\r\n--_6bb92e42-9f4a-4d02-b159-49320e33aeac_\r\nContent-Type: text/html; charset=&quot;Windows-1252&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;\n&lt;head&gt;\n&lt;style&gt;\n.hmmessage P\n{\nmargin:0px;\npadding:0px\n}\nbody.hmmessa=\r\nge\n{\nFONT-SIZE: 10pt;\nFONT-FAMILY:Tahoma\n}\n&lt;/style&gt;\n&lt;/head&gt;\n&lt;body class=3D&#39;=\r\nhmmessage&#39;&gt;\nNick,&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nYou are a new member and a possible resear=\r\ncher so I do not want to get off on the wrong foot&lt;BR&gt;\nIt sounds like you m=\r\nay have taken what I said as criticism, It was not meant to be.&lt;BR&gt;\nJust ex=\r\nperienced advice. There are some researchers that believe it is beneficial =\r\nto leave &lt;BR&gt;\na box running and unattended, so that our spirit friends can =\r\n&quot;imprint&quot; to the frequency of the box&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nThat is not at all nec=\r\nessary, Spirit techs do need to imprint to certain boxes but do so through =\r\ntwo way communication&lt;BR&gt;\nyou see they also imprint the energy signature of=\r\n the user of the box also. And that can only be accomplished through &lt;BR&gt;\nc=\r\nommunicative interaction during a session. If the box is left unattended th=\r\ney may only accomplish half of what they need to do.&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nAlso I =\r\nhave had first hand experience with certain researchers that do practice th=\r\nis lackadaisical us of a box and had begun to &lt;BR&gt;\nget less and less commun=\r\nication during attempts at actual sessions and eventually nothing but negat=\r\nive entities coming through.&lt;BR&gt;\nI am not saying this is solely due to doin=\r\ng an absent session which is what I have come to call it, It entails man6y =\r\nfactors.&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nBut the absent session practice definitely contribu=\r\ntes to the ultimate failure of communication. &lt;BR&gt;\nNick, it is better for y=\r\nou to establish solid research practices in the beginning that will serve t=\r\no enhance your communication &lt;BR&gt;\nskills and growth in the future.&lt;BR&gt;\n&nbs=\r\np;&lt;BR&gt;\nRemember your spirit contacts or &quot;technicians&quot; will become not only =\r\nthe facilitators of your link and communication from the&lt;BR&gt;\nother side but=\r\n they will become your trusted&nbsp;friends and protectors. you would never=\r\n leave your buddy on the phone and go &lt;BR&gt;\non to something else while he re=\r\nmained on the line calling for you to speak with him. Our spirit friends wh=\r\nere people just like us&lt;BR&gt;\nat one time and the emotions we carry in the ph=\r\nysical also carry over to our spirit lives.&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nI hope you do no=\r\nt take this as preaching or criticism it is just experience from communicat=\r\ning with my own techs and friends&lt;BR&gt;\nand gathering information on what the=\r\ny feel and expect from us as researchers.&lt;BR&gt;\nRemember all we have to do is=\r\n turn on a box and listen and record their job to send the communication &lt;B=\r\nR&gt;\nno matter how short the phrase or word is a 1000x harder for them so don=\r\n&#39;t you think they deserve a 100% &lt;BR&gt;\nof our attention when we open the lin=\r\nes of communication.&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nAlso in closing let me say that my beli=\r\nef on &quot;imprinting&quot; of a box is for boxes like Frank&#39;s box and the mini box,=\r\n for the simple&lt;BR&gt;\nreason that they are individually made and each carry a=\r\n slightly different frequency range, indicative to that particular box.&lt;BR&gt;=\r\n\nThe radio shack hack box on the other hand is manufactured in china most l=\r\nikely on an automated assembly line so each&lt;BR&gt;\ncircuit board is exactly li=\r\nke the next, this being the case I believe that when our friends imprinted =\r\non the first of the RS boxes&lt;BR&gt;\nit was sufficient for most of the others. =\r\nThat is why people experience immediate communication right out of the box.=\r\n&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nSo therefore the RS box does not need that grace period to =\r\n&quot;Imprint&quot;&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nThese comments and statements are my own hypothesi=\r\ns based on my own extensive research with every type of box that is made to=\r\n date&lt;BR&gt;\nand I am only offering it so that it may help others to avoid the=\r\n toil and mistakes that I have endured.&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nthanks for giving me=\r\n the soap box once again!&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nBruce&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;P align=3Dcente=\r\nr&gt;&lt;FONT size=3D4&gt;&lt;FONT color=3D#0033cc&gt;&lt;STRONG&gt;&lt;EM&gt;&lt;FONT color=3D#000000 si=\r\nze=3D5&gt;Bruce Halliday &lt;BR&gt;&lt;/FONT&gt;&lt;/EM&gt;&lt;/STRONG&gt;&lt;BR&gt;&lt;A href=3D&quot;http://free-p=\r\naranormalinvestigating.com/%3C/div%3E%3C/div%3E%3Cp%20/%3E%3Cdiv%20class=3D=\r\n&quot; target=3D_blank&gt;&lt;/P&gt;&lt;/A&gt;&lt;/FONT&gt;&lt;/FONT&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;BLOCKQUOTE&gt;\n&lt;HR&gt;\nTo: EVP-=\r\nITC@yahoogroups.com&lt;BR&gt;From: thegreatwolf@...&lt;BR&gt;Date: Wed, 9 Jan=\r\n 2008 06:25:30 -0500&lt;BR&gt;Subject: Re: [EVP-ITC] Box in the morning&lt;BR&gt;&lt;BR&gt;\n&lt;=\r\nMETA content=3D&quot;Microsoft SafeHTML&quot; name=3DGenerator&gt;\n&lt;DIV id=3DEC_ygrp-mlm=\r\nsg style=3D&quot;WIDTH: 655px&quot;&gt;\n&lt;DIV id=3DEC_ygrp-msg style=3D&quot;PADDING-RIGHT: 15=\r\npx; PADDING-LEFT: 0px; Z-INDEX: 1; FLOAT: left; PADDING-BOTTOM: 0px; WIDTH:=\r\n 490px; PADDING-TOP: 0px&quot;&gt;\n&lt;DIV id=3DEC_ygrp-text&gt;\nJust FYI, I had stopped =\r\nchecking my email at that time and was trying to get someone to say somethi=\r\nng. &nbsp;I usually can&#39;t get my self to not pay attention to the box when =\r\ni turn it on.&lt;BR&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;On Jan 8, 2008, at 9:19 AM, bruce halliday wro=\r\nte:&lt;/DIV&gt;&lt;BR class=3DEC_Apple-interchange-newline&gt;\n&lt;BLOCKQUOTE&gt;&lt;SPAN class=\r\n=3DEC_Apple-style-span style=3D&quot;FONT-WEIGHT: normal; FONT-SIZE: 12px; COLOR=\r\n: rgb(0,0,0); TEXT-INDENT: 0px; FONT-STYLE: normal; FONT-FAMILY: Helvetica;=\r\n LETTER-SPACING: normal; BORDER-COLLAPSE: separate; FONT-VARIANT: normal&quot;&gt;\n=\r\n&lt;DIV id=3DEC_ygrp-mlmsg style=3D&quot;FONT-SIZE: 13px; FONT-FAMILY: arial, helve=\r\ntica, clean, sans-serif&quot;&gt;\n&lt;DIV id=3DEC_ygrp-msg&gt;\n&lt;DIV id=3DEC_ygrp-text sty=\r\nle=3D&quot;FONT-FAMILY: Georgia&quot;&gt;\n&lt;P&gt;Nick,&lt;BR&gt;&nbsp;&lt;BR&gt;My advice as a long time=\r\n researcher is not to just turn the box on and leave it running&lt;SPAN class=\r\n=3DEC_Apple-converted-space&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;unless you intend to do a sess=\r\nion and give your friends on the other side that are working&lt;BR&gt;extremely h=\r\nard to send you the communication your undivided attention.&lt;BR&gt;&nbsp;&lt;BR&gt;It=\r\n&#39;s kind of like calling someone on the phone and when they start a conversa=\r\ntion you decide to&lt;BR&gt;put the phone down and focus your attention on other =\r\nthings.&lt;BR&gt;&nbsp;&lt;BR&gt;There are other researchers that feel that there is no=\r\nthing wrong with this practice and do it on occasion&lt;BR&gt;But I have come to =\r\nthe understanding that it is deemed disrespectful and while you may be list=\r\nening with&lt;SPAN class=3DEC_Apple-converted-space&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;one ear a=\r\ns you do something else, you will hear a loud curse word or nasty statement=\r\n, that is their way&lt;SPAN class=3DEC_Apple-converted-space&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;=\r\nof getting your attention back. I have gotten numerous messages about the d=\r\nifficulty of the attempts for&lt;SPAN class=3DEC_Apple-converted-space&gt;&nbsp;&lt;=\r\n/SPAN&gt;&lt;BR&gt;them to communicate so when I turn the box on it gets my full att=\r\nention. just some experienced advice.&lt;BR&gt;&nbsp;&lt;BR&gt;As for them telling you =\r\nto close the portal, it could have two meanings. Sometimes they refer to bo=\r\nx that&lt;BR&gt;is turned on and in use as a portal for the simple reason that ea=\r\nch time we turn a box on to communicate&lt;SPAN class=3DEC_Apple-converted-spa=\r\nce&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;it opens a direct open link between our realm and their=\r\ns so in essence it is an open door for anything to pass in or out.&lt;BR&gt;&nbsp=\r\n;&lt;BR&gt;that is why when I end a session I always ask my technician to bring b=\r\nack any spirits that may have come through the&lt;SPAN class=3DEC_Apple-conver=\r\nted-space&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;portal during the session and I ask for conforma=\r\ntion and 10 times out of ten will get &quot;OK&quot; or &quot;OK THEY ARE BACK&quot;&lt;BR&gt;&nbsp;&lt;=\r\nBR&gt;also they may have meant since you had the box running and where not doi=\r\nng a actual session to shut the box so&lt;SPAN class=3DEC_Apple-converted-spac=\r\ne&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;that they could go and not have to protect the open conn=\r\nection from any negative entities that where able cross through the open&lt;BR=\r\n&gt;portal.&lt;BR&gt;&nbsp;&lt;BR&gt;A few researchers have been receiving numerous messag=\r\nes about the number 7 within the past month. The only known&lt;SPAN class=3DEC=\r\n_Apple-converted-space&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;significance that the number 7 has =\r\nin evp research is the 7 entities that controlled communication back in the=\r\n eighties and nineties&lt;BR&gt;during the spiricom and luxembourg era. To receiv=\r\ne this number in messages so often and by more than one researcher, odiousl=\r\ny&lt;BR&gt;holds some importance which they have not been able or are not ready t=\r\no convey.&lt;BR&gt;&nbsp;&lt;BR&gt;If you need any help or have any questions please fe=\r\nel free to ask.&lt;BR&gt;&nbsp;&lt;BR&gt;Bruce&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;P align=3Dcenter&gt;&lt;FONT =\r\nsize=3D4&gt;&lt;FONT color=3D#0033cc&gt;&lt;STRONG&gt;&lt;EM&gt;&lt;FONT color=3D#000000 size=3D5&gt;B=\r\nruce Halliday&lt;SPAN class=3DEC_Apple-converted-space&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;&lt;/FONT=\r\n&gt;&lt;/EM&gt;&lt;/STRONG&gt;&lt;BR&gt;&lt;A href=3D&quot;http://free-paranormalinvestigating.com/%3C/d=\r\niv%3E%3C/div%3E%3Cp%20/%3E%3Cdiv%20class=3D&quot; target=3D_blank&gt;&lt;/A&gt;&lt;/FONT&gt;&lt;/F=\r\nONT&gt;&lt;/P&gt;&lt;FONT size=3D4&gt;&lt;FONT color=3D#0033cc&gt;&lt;A href=3D&quot;http://free-paranor=\r\nmalinvestigating.com/%3C/div%3E%3C/div%3E%3Cp%20/%3E%3Cdiv%20class=3D&quot; targ=\r\net=3D_blank&gt;&lt;/A&gt;&lt;/FONT&gt;&lt;/FONT&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;BLOCKQUOTE&gt;\n&lt;HR&gt;\nTo: EVP-ITC@yahoog=\r\nroups&lt;WBR&gt;.com&lt;BR&gt;From: thegreatwolf@&lt;WBR&gt;earthlink.&lt;WBR&gt;net&lt;BR&gt;Date: Tue, =\r\n8 Jan 2008 06:27:07 -0500&lt;BR&gt;Subject: [EVP-ITC] Box in the morning&lt;BR&gt;&lt;BR&gt;\n=\r\n&lt;DIV id=3DEC_EC_ygrp-mlmsg&gt;\n&lt;DIV id=3DEC_EC_ygrp-msg&gt;\n&lt;DIV id=3DEC_EC_ygrp-=\r\ntext&gt;Hey,&lt;BR&gt;Anyone have any odd problems in the morning with using it. I a=\r\nm&lt;SPAN class=3DEC_Apple-converted-space&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;sitting here check=\r\ning my email so i just thought i&#39;d turn it on&lt;SPAN class=3DEC_Apple-convert=\r\ned-space&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;and... not check my email. Anywho.... Then right =\r\nat about 6:20 i&lt;SPAN class=3DEC_Apple-converted-space&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;hear=\r\nd a voice say &quot;Nicholas Etheridge please turn off the dsfnlsd&quot;&lt;SPAN class=\r\n=3DEC_Apple-converted-space&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;not quite sure what word it us=\r\ned... possibly portal. I just thought&lt;SPAN class=3DEC_Apple-converted-space=\r\n&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;it was weird. Also under all of the jumble and this voice=\r\n speaking i&lt;SPAN class=3DEC_Apple-converted-space&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;heard a =\r\ndeep male voice almost chanting &quot;seven&quot;. Not sure if I&lt;SPAN class=3DEC_Appl=\r\ne-converted-space&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;actually heard this or its the want to h=\r\nave an excuse to stay home&lt;SPAN class=3DEC_Apple-converted-space&gt;&nbsp;&lt;/SP=\r\nAN&gt;&lt;BR&gt;and not take the HSAs.&lt;BR&gt;&lt;BR&gt;Anyway.. just curious if anyone has go=\r\ntten heard this or if they know&lt;SPAN class=3DEC_Apple-converted-space&gt;&nbsp=\r\n;&lt;/SPAN&gt;&lt;BR&gt;something I don&#39;t about using the box in the morning.&lt;BR&gt;&lt;BR&gt;Pe=\r\nace,&lt;BR&gt;Nick&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;SPAN style=3D&quot;COLOR: white&quot;&gt;&lt;/SPAN&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;=\r\n/BLOCKQUOTE&gt;&lt;BR&gt;\n&lt;HR&gt;\nGet the power of Windows + Web with the new Windows L=\r\nive.&lt;SPAN class=3DEC_Apple-converted-space&gt;&nbsp;&lt;/SPAN&gt;&lt;A href=3D&quot;http://w=\r\nww.windowslive.com/?ocid=3DTXT_TAGHM_Wave2_powerofwindows_012008&quot; target=3D=\r\n_blank&gt;Get it now!&lt;/A&gt; \n&lt;DIV&gt;&lt;BR class=3DEC_khtml-block-placeholder&gt;&lt;/DIV&gt;&lt;=\r\n/DIV&gt;&lt;SPAN style=3D&quot;COLOR: white&quot;&gt;&lt;/SPAN&gt;&lt;/SPAN&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/=\r\nDIV&gt;&lt;BR&gt;\n&lt;BR&gt;&lt;/DIV&gt;&lt;SPAN style=3D&quot;COLOR: white&quot;&gt;&lt;/SPAN&gt; \n&lt;STYLE&gt;\n.ExternalC=\r\nlass #EC_ygrp-mkp\n{border:1px solid #d8d8d8;font-family:Arial;padding:0px 1=\r\n4px;}\n.ExternalClass #EC_ygrp-mkp hr\n{border:1px solid #d8d8d8;}\n.ExternalC=\r\nlass #EC_ygrp-mkp #EC_hd\n{color:#628c2a;font-size:85%;font-weight:bold;line=\r\n-height:122%;}\n.ExternalClass #EC_ygrp-mkp #EC_ads\n{margin-bottom:10px;}\n.E=\r\nxternalClass #EC_ygrp-mkp .EC_ad\n{padding:0 0;}\n.ExternalClass #EC_ygrp-mkp=\r\n .EC_ad a\n{color:#0000ff;text-decoration:none;}\n\n&lt;/STYLE&gt;\n\n&lt;STYLE&gt;\n.Externa=\r\nlClass #EC_ygrp-sponsor #EC_ygrp-lc\n{font-family:Arial;}\n.ExternalClass #EC=\r\n_ygrp-sponsor #EC_ygrp-lc #EC_hd\n{font-weight:bold;font-size:78%;line-heigh=\r\nt:122%;}\n.ExternalClass #EC_ygrp-sponsor #EC_ygrp-lc .EC_ad\n{margin-bottom:=\r\n10px;padding:0 0;}\n\n&lt;/STYLE&gt;\n\n&lt;STYLE&gt;\n.ExternalClass #EC_ygrp-mlmsg\n{font-s=\r\nize:13px;font-family:arial,helvetica,clean,sans-serif;}\n.ExternalClass #EC_=\r\nygrp-mlmsg table\n{font-size:inherit;font:100%;}\n.ExternalClass #EC_ygrp-mlm=\r\nsg select, .ExternalClass input, .ExternalClass textarea\n{font:99% arial,he=\r\nlvetica,clean,sans-serif;}\n.ExternalClass #EC_ygrp-mlmsg pre, .ExternalClas=\r\ns code\n{font:115% monospace;}\n.ExternalClass #EC_ygrp-mlmsg EC_*\n{line-heig=\r\nht:1.22em;}\n.ExternalClass #EC_ygrp-text\n{font-family:Georgia;}\n.ExternalCl=\r\nass #EC_ygrp-text p\n{;}\n.ExternalClass #EC_ygrp-tpmsgs\n{font-family:Arial;c=\r\nlear:both;}\n.ExternalClass #EC_ygrp-vitnav\n{padding-top:10px;font-family:Ve=\r\nrdana;font-size:77%;}\n.ExternalClass #EC_ygrp-vitnav a\n{padding:0 1px;}\n.Ex=\r\nternalClass #EC_ygrp-actbar\n{clear:both;white-space:nowrap;color:#666;text-=\r\nalign:right;}\n.ExternalClass #EC_ygrp-actbar .EC_left\n{float:left;white-spa=\r\nce:nowrap;}\n.ExternalClass .EC_bld\n{font-weight:bold;}\n.ExternalClass #EC_y=\r\ngrp-grft\n{font-family:Verdana;font-size:77%;padding:15px 0;}\n.ExternalClass=\r\n #EC_ygrp-ft\n{font-family:verdana;font-size:77%;border-top:1px solid #666;p=\r\nadding:5px 0;}\n.ExternalClass #EC_ygrp-mlmsg #EC_logo\n{padding-bottom:10px;=\r\n}\n.ExternalClass #EC_ygrp-vital\n{background-color:#e0ecee;margin-bottom:20p=\r\nx;padding:2px 0 8px 8px;}\n.ExternalClass #EC_ygrp-vital #EC_vithd\n{font-siz=\r\ne:77%;font-family:Verdana;font-weight:bold;color:#333;text-transform:upperc=\r\nase;}\n.ExternalClass #EC_ygrp-vital ul\n{padding:0;}\n.ExternalClass #EC_ygrp=\r\n-vital ul li\n{list-style-type:none;clear:both;border:1px solid #e0ecee;}\n.E=\r\nxternalClass #EC_ygrp-vital ul li .EC_ct\n{font-weight:bold;color:#ff7900;fl=\r\noat:right;width:2em;text-align:right;padding-right:.5em;}\n.ExternalClass #E=\r\nC_ygrp-vital ul li .EC_cat\n{font-weight:bold;}\n.ExternalClass #EC_ygrp-vita=\r\nl a\n{text-decoration:none;}\n.ExternalClass #EC_ygrp-vital a:hover\n{text-dec=\r\noration:underline;}\n.ExternalClass #EC_ygrp-sponsor #EC_hd\n{color:#999;font=\r\n-size:77%;}\n.ExternalClass #EC_ygrp-sponsor #EC_ov\n{padding:6px 13px;backgr=\r\nound-color:#e0ecee;margin-bottom:20px;}\n.ExternalClass #EC_ygrp-sponsor #EC=\r\n_ov ul\n{padding:0 0 0 8px;}\n.ExternalClass #EC_ygrp-sponsor #EC_ov li\n{list=\r\n-style-type:square;padding:6px 0;font-size:77%;}\n.ExternalClass #EC_ygrp-sp=\r\nonsor #EC_ov li a\n{text-decoration:none;font-size:130%;}\n.ExternalClass #EC=\r\n_ygrp-sponsor #EC_nc\n{background-color:#eee;margin-bottom:20px;padding:0 8p=\r\nx;}\n.ExternalClass #EC_ygrp-sponsor .EC_ad\n{padding:8px 0;}\n.ExternalClass =\r\n#EC_ygrp-sponsor .EC_ad #EC_hd1\n{font-family:Arial;font-weight:bold;color:#=\r\n628c2a;font-size:100%;line-height:122%;}\n.ExternalClass #EC_ygrp-sponsor .E=\r\nC_ad a\n{text-decoration:none;}\n.ExternalClass #EC_ygrp-sponsor .EC_ad a:hov=\r\ner\n{text-decoration:underline;}\n.ExternalClass #EC_ygrp-sponsor .EC_ad p\n{;=\r\n}\n.ExternalClass EC_o\n{font-size:0;}\n.ExternalClass .EC_MsoNormal\n{;}\n.Exte=\r\nrnalClass #EC_ygrp-text tt\n{font-size:120%;}\n.ExternalClass blockquote\n{;}\n=\r\n.ExternalClass .EC_replbq\n{;}\n\n&lt;/STYLE&gt;\n&lt;/BLOCKQUOTE&gt;&lt;br /&gt;&lt;hr /&gt;Put your f=\r\nriends on the big screen with Windows Vista=AE + Windows Live=99. &lt;a href=\r\n=3D&#39;http://www.microsoft.com/windows/shop/specialoffers.mspx?ocid=3DTXT_TAG=\r\nLM_CPC_MediaCtr_bigscreen_012008&#39; target=3D&#39;_new&#39;&gt;Start now!&lt;/a&gt;&lt;/body&gt;\n&lt;/h=\r\ntml&gt;\r\n--_6bb92e42-9f4a-4d02-b159-49320e33aeac_--"}