{"id": "5144", "subject": "RE: [EVP-ITC] for Bruce Halliday - A technician request", "author": "bruce halliday", "timestamp": "2008-01-09T16:20:05Z", "full_text": "--_94cc4e07-1a3a-41f4-8f56-c045212b938b_\r\nContent-Type: text/plain; charset=&quot;Windows-1252&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n\nRon,\n \nFirst thank you for your kind comments but the only difference betw=\r\neen you and I is the time I have been researching.\nYou will surely get ther=\r\ne especially with the effort you are making in a tough situation, most woul=\r\nd have just given up.\nYou can believe that our friends on the other side ap=\r\npreciate that kind of dedication.\n \nThat being said, when you do a session =\r\nwith the box the communication is mainly formulated by our friends using th=\r\ne fragments of sound coming from the radio signal you recieve.\nIs it possib=\r\nle to get communication with this little number of available stations ? Yes=\r\n but it will be limited in the fact that the communicating spirit will need=\r\n to wait that much longer \nto try and catch coinciding fragment to form an =\r\nindividual word or phrase. The theory is, the more signal you have, the mor=\r\ne fragments of words you have , the easier for our friends to utilize them =\r\nto form mor and cuncurrent words phrases and even whole sentences.\n \nI am s=\r\nure they are aware of your particular curcumstances and are putting in the =\r\nextra effort to try and solve the problem and at least get whatever communi=\r\ncation they can across.\nBut you also have to do your level best to facilita=\r\nte a good signal and reception, working together in harmony with your spiri=\r\nt communicators and fellow researchers will aid in the strenthening of all =\r\nour communication. So don&#39;t give up and don&#39;t get to frustrated approach th=\r\ne sessions with a positive outlook and that energy alone will help boost co=\r\nmmunication. And I&#39;m sure we here will do all we can to help.\n \nAs for the =\r\nspanish language signals, It does not matter what language the transmition =\r\nof the signal is in because they do not utilise full radio words or sentenc=\r\nes to communicate, they put the words together using bits and pieces of the=\r\n radio signal so even if you where doing research in china or germany and r=\r\necieved only signals in that native language your spirit friends, knowing y=\r\nou personaly would use the fragments of sound to form their communication i=\r\nn your own language. they become your personal friends and protectors and w=\r\nill do everything in their power to communicate with you. All you need is a=\r\nn open mind and heart, they will take care of the rest.\n \nJuli valazqueaz w=\r\nill be posting a session data sheet, I suggest you use one for every sessio=\r\nn to determine if there are certain times and conditions in your location t=\r\nhat are better than others for doing a session.\n \nany other questions you h=\r\nave no matter how dumb you think they are please feel free to contact me on=\r\n the the board or by e-mail  paranormalinvestigating@...\n \nBruce\n \n=\r\nBruce Halliday \n\n\nTo: EVP-ITC@yahoogroups.comFrom: ronriko@...: W=\r\ned, 9 Jan 2008 06:46:19 -0800Subject: RE: [EVP-ITC] for Bruce Halliday - A =\r\ntechnician request\n\n\n\n\n\nThanks for the encouragement Bruce.  You are correc=\r\nt I have a rs 12-469 and I cut the pin so it scans continually when needed.=\r\n   I at times used audacity on my computer to record, thinking that speed c=\r\nontrol would be useful to interpret messages...nice thought.   I like the s=\r\nimplicity of your suggestion to just plug the radio directly into the digit=\r\nal recorder.  Not knowing exactly how all this goes down, I thought the rad=\r\nio scan sounds need to mix in the room so that the techs on the other side =\r\ncan respond.  Whatever works.  \n \nThe other main question I have is regardi=\r\nng the radio stations I can pick up here in my part of Mexico, on the Yucat=\r\nan.  I only get several stations during a complete scan of all a.m. or f.m.=\r\n channels...don&#39;t know if that is enough.  It has been suggested that I som=\r\nehow can add an antenna to search for more channels, which I would attempt =\r\nif it is really necessary.  I get mostly Spanish language stations and an o=\r\nccasional station from Texas that skips across the Gulf of Mexico.  Not muc=\r\nh to scan.  Any thoughts on this?\n \nBy the way, I think the work you are do=\r\ning is, well, extraordinary.    Like pros from any other field of endeavor,=\r\n you make this stuff look easy to do...not so.  Thanks again.   Ron L  \nbru=\r\nce halliday &lt;paranormalinvestigating@...&gt; wrote:\n\n\nHey Ron L., In m=\r\ny experience it does not matter what language you recieve the signal in.The=\r\n entities are using only fragments, small bits and pieces of the radio sign=\r\nalto form the words. Therefore it does not matter if the radio signal is in=\r\n spanish or english or any other language for that matter. Our friends on t=\r\nhe other side will manipulate the fragments they need to communicate with y=\r\nou in the language you will understand. Ron you mention that you are using =\r\nan rs 690 that is not one of the hack model numbers maybe you have gotten t=\r\nhe wrong radio model. Check the part number it must be a 12-469or a 12-470 =\r\nand if it is the 470 it would have to be the older model or it could not be=\r\n modified. Can you verify that you have modified the rs radio and that it i=\r\ns continually scanning withoutstopping on any one particular station? Also =\r\nthere would be no need for EVP maker or a microphone to be used during a se=\r\nssion with the RS boxall you would need is the RS box and a digital recorde=\r\nr, if you have the 469 you would need speakers to record the session or plu=\r\ng the digital recorder directly into the radio. Please check your equipment=\r\n and how it is operating and let me know so I can help you further.Don&#39;t wo=\r\nrry they are just waiting for you to set up the correct equipment and they =\r\nwill communicate. Bruce\nBruce Halliday \n\n\nTo: EVP-ITC@yahoogroups.comFrom: =\r\nronriko@...: Tue, 8 Jan 2008 11:16:51 -0800Subject: [EVP-ITC] for=\r\n Bruce Halliday - A technician request\n\n\nBruce, I now have done a few days =\r\ntesting with my rs 690, evp maker, audacity, a mic, and my handheld digital=\r\n recorder.  Nada, nothing, zilch.  Maybe because I only get to scan past 5 =\r\nto 8 channels on Am or FM so I don&#39;t have enough signals to muster a respon=\r\nse.  But from what you and others with experience seem to be saying, it sho=\r\nuldn&#39;t matter because I will get help from someone on the other-side.  Mayb=\r\ne they can&#39;t find me in Mexico?  Please let your techs know I am here...sho=\r\nuld be no problem with immigration papers or money exchange.  I really need=\r\n help.  Ron Lbruce halliday &lt;paranormalinvestigating@...&gt; wrote: \n\n=\r\n\nAnn,That may be, But I find that when I do a session mike and lisa both co=\r\nme through but mike seems to be the more dominant one. I have asked that mi=\r\nke and lisa help in your sessions as well as other new researchers and they=\r\n seem to comply but I think mikeis more like a supervisor and delegates act=\r\nions to other techs. I know that if you do not have a perminent tech that w=\r\nhatever techis available at the time you do your session will be assigned t=\r\no assist you. If it is lisa she is very sweet and will do her best to give =\r\nyou solid communication. I&#39;m glad she can help. Bruce\nBruce Halliday \n\n\nTo:=\r\n EVP-ITC@yahoogroups.comFrom: lisby@...: Tue, 8 Jan 2008 11:4=\r\n0:02 -0500Subject: RE: [EVP-ITC] Re: A file from Frank&#39;s box #12 pertaining=\r\n to lisby&#39;s technition\n\n\nI&#39;m getting the thought that Lisa is bouncing arou=\r\nnd between us. She&#39;s very dominant every time I run a session and I&#39;ve gott=\r\nen some good stuff from her, which I will shortly be able to post, I hope. =\r\nAbout a week ago, I got a really extraordinary sequence that ran something =\r\nalong the lines of a male saying, &quot;Lisa, can you do it?&quot; followed by a clea=\r\nr female voice saying, &quot;Testing. Beginning. Ground,&quot; and then a second fema=\r\nle voice saying &quot;Kick.&quot; I was floored.Anyway, Lisa seems to be the driver o=\r\nf a lot of what is going on right now. Maybe she intends to work with a num=\r\nber of us?Ann\n-----Original Message----- From: bruce halliday Sent: Jan 8, =\r\n2008 9:22 AM To: evp-itc@yahoogroups.com Subject: RE: [EVP-ITC] Re: A file =\r\nfrom Frank&#39;s box #12 pertaining to lisby&#39;s technition \n\n\n\nFrank, I have two=\r\n techs that I speak with on a daily basis and one of themis Lisa. She could=\r\n possibly be contacting you with the technical info she tried to give meyes=\r\nterday. Bruce\nBruce Halliday \n\n\nTo: EVP-ITC@yahoogroups.comFrom: franks-box=\r\nes@...: Tue, 8 Jan 2008 06:39:54 +0000Subject: [EVP-ITC] Re: A =\r\nfile from Frank&#39;s box #12 pertaining to lisby&#39;s technition\n\n\nI&#39;ve been gett=\r\ning Lisa too, but so far not in any segments tranfered to the PC. Even toni=\r\nght I heard her, but not while I was taping. Frank-S--- In EVP-ITC@yahoogro=\r\nups.com, Lisby &lt;lisby@...&gt; wrote:&gt;&gt; Hmmmm. That second bit gave me the cree=\r\npies, I must say. What are &gt; your thoughts on that, Bruce? I hear Lisa&#39;s na=\r\nme at least a dozen &gt; times each time I run a session, so I feel confident =\r\nthat she is &gt; there, so I feel confident that I&#39;m not in the hands of someo=\r\nne I &gt; don&#39;t want to be in. Maybe they are still auditioning for the role?&gt;=\r\n &gt; &gt; On Jan 7, 2008, at 9:49 AM, bhali333 wrote:&gt; &gt; &gt; the precedeing file w=\r\nas from a question about Ann&#39;s technition on&gt; &gt; 12-08-07&gt; &gt;&gt; &gt; Bruce&gt; &gt;&gt; &gt;&gt;=\r\n &gt;&gt;\n\nMake distant family not so distant with Windows Vista=AE + Windows Liv=\r\ne=99. Start now! \n\nWatch =93Cause Effect,=94 a show about real people makin=\r\ng a real difference. Learn more \n\n\n\nBe a better friend, newshound, and know=\r\n-it-all with Yahoo! Mobile. Try it now. \n\n\nShare life as it happens with th=\r\ne new Windows Live. Start sharing! \n\n\n\nLooking for last minute shopping dea=\r\nls? Find them fast with Yahoo! Search. \n \n\n\n\n\n\n\n___________________________=\r\n______________________________________\nWatch =93Cause Effect,=94 a show abo=\r\nut real people making a real difference.\nhttp://im.live.com/Messenger/IM/MT=\r\nV/?source=3Dtext_watchcause\r\n--_94cc4e07-1a3a-41f4-8f56-c045212b938b_\r\nContent-Type: text/html; charset=&quot;Windows-1252&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;\n&lt;head&gt;\n&lt;style&gt;\n.hmmessage P\n{\nmargin:0px;\npadding:0px\n}\nbody.hmmessa=\r\nge\n{\nFONT-SIZE: 10pt;\nFONT-FAMILY:Tahoma\n}\n&lt;/style&gt;\n&lt;/head&gt;\n&lt;body class=3D&#39;=\r\nhmmessage&#39;&gt;\nRon,&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nFirst thank you for your kind comments but =\r\nthe only difference between you and I is the time I have been researching.&lt;=\r\nBR&gt;\nYou will surely get there especially with the effort you are making in =\r\na tough situation, most would have just given up.&lt;BR&gt;\nYou can believe that =\r\nour friends on the other side appreciate that kind of dedication.&lt;BR&gt;\n&nbsp=\r\n;&lt;BR&gt;\nThat being said, when you do a session with the box the communication=\r\n is mainly formulated by our friends using the fragments of sound coming fr=\r\nom the radio signal you recieve.&lt;BR&gt;\nIs it possible to get communication wi=\r\nth this little number of available stations ? Yes but it will be limited in=\r\n the fact that the communicating spirit will need to wait that much longer =\r\n&lt;BR&gt;\nto try and catch coinciding fragment to form an individual word or phr=\r\nase. The theory is, the more signal you have, the more fragments of words y=\r\nou have , the easier for our friends to utilize them to form mor and cuncur=\r\nrent words phrases and even whole sentences.&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nI am sure they =\r\nare aware of your particular curcumstances and are putting in the extra eff=\r\nort to try and solve the problem and at least get whatever communication th=\r\ney can across.&lt;BR&gt;\nBut you also have to do your level best to facilitate a =\r\ngood signal and reception, working together in harmony with your spirit com=\r\nmunicators and fellow researchers will aid in the strenthening of all our c=\r\nommunication. So don&#39;t give up and don&#39;t get to frustrated approach the ses=\r\nsions with a positive outlook and that energy alone will help boost communi=\r\ncation. And I&#39;m sure we here will do all we can to help.&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nAs =\r\nfor the spanish language signals, It does not matter what language the tran=\r\nsmition of the signal is in because they do not utilise full radio&nbsp;wor=\r\nds or sentences to communicate, they put the words together using bits and =\r\npieces of the radio signal so even if you where doing research in china or =\r\ngermany and recieved only signals in that native language your spirit frien=\r\nds, knowing you personaly would use the fragments of sound to form their co=\r\nmmunication in your own language. they become your personal friends and pro=\r\ntectors and will do everything in their power to communicate with you. All =\r\nyou need is an open mind and heart, they will take care of the rest.&lt;BR&gt;\n&n=\r\nbsp;&lt;BR&gt;\nJuli valazqueaz will be posting a session data sheet, I suggest yo=\r\nu use one for every session to determine if there are certain times and con=\r\nditions&nbsp;in your location that are better than others for doing a sessi=\r\non.&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nany other questions you have no matter how dumb you thin=\r\nk they are please feel free to contact me on the the board or by e-mail&nbs=\r\np; &lt;A href=3D&quot;mailto:paranormalinvestigating@...&quot;&gt;paranormalinvesti=\r\ngating@...&lt;/A&gt;&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nBruce&lt;BR&gt;\n&lt;BR&gt;&lt;BR&gt;&nbsp;&lt;BR&gt;\n&lt;P align=\r\n=3Dcenter&gt;&lt;FONT size=3D4&gt;&lt;FONT color=3D#0033cc&gt;&lt;STRONG&gt;&lt;EM&gt;&lt;FONT color=3D#0=\r\n00000 size=3D5&gt;Bruce Halliday &lt;BR&gt;&lt;/FONT&gt;&lt;/EM&gt;&lt;/STRONG&gt;&lt;BR&gt;&lt;A href=3D&quot;http:=\r\n//free-paranormalinvestigating.com/%3C/div%3E%3C/div%3E%3Cp%20/%3E%3Cdiv%20=\r\nclass=3D&quot; target=3D_blank&gt;&lt;/P&gt;&lt;/A&gt;&lt;/FONT&gt;&lt;/FONT&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;BLOCKQUOTE&gt;\n&lt;HR&gt;\n=\r\nTo: EVP-ITC@yahoogroups.com&lt;BR&gt;From: ronriko@...&lt;BR&gt;Date: Wed, 9 Jan =\r\n2008 06:46:19 -0800&lt;BR&gt;Subject: RE: [EVP-ITC] for Bruce Halliday - A techni=\r\ncian request&lt;BR&gt;&lt;BR&gt;\n&lt;META content=3D&quot;Microsoft SafeHTML&quot; name=3DGenerator&gt;=\r\n\n&lt;DIV id=3DEC_ygrp-mlmsg style=3D&quot;WIDTH: 655px&quot;&gt;\n&lt;DIV id=3DEC_ygrp-msg styl=\r\ne=3D&quot;PADDING-RIGHT: 15px; PADDING-LEFT: 0px; Z-INDEX: 1; FLOAT: left; PADDI=\r\nNG-BOTTOM: 0px; WIDTH: 490px; PADDING-TOP: 0px&quot;&gt;\n&lt;DIV id=3DEC_ygrp-text&gt;\n\n&lt;=\r\nDIV&gt;Thanks for the encouragement Bruce.&nbsp; You are correct I have a rs 1=\r\n2-469 and I cut the pin so it scans continually when needed.&nbsp;&nbsp; I =\r\nat times used audacity on my computer to record, thinking that speed contro=\r\nl would be useful to interpret messages...nice thought.&nbsp;&nbsp; I like =\r\nthe simplicity of your suggestion to just plug the radio directly into the =\r\ndigital recorder.&nbsp; Not knowing exactly how all this goes down, I thoug=\r\nht the radio scan sounds need to mix in the room so that the techs on the o=\r\nther side can respond.&nbsp;&nbsp;Whatever works.&nbsp; &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;=\r\n/DIV&gt;\n&lt;DIV&gt;The other main question I have is regarding the radio stations I=\r\n can pick up here in&nbsp;my part of Mexico, on the Yucatan.&nbsp; I only g=\r\net several stations during a complete scan of all a.m. or f.m. channels...d=\r\non&#39;&lt;WBR&gt;t know if that is enough.&nbsp; It has been suggested that I someho=\r\nw can add an antenna&nbsp;to search for more channels, which I would attemp=\r\nt if it is really necessary.&nbsp; I get mostly Spanish&nbsp;language stati=\r\nons and an occasional station from Texas that skips across the Gulf of Mexi=\r\nco.&nbsp; Not much to&nbsp;scan.&nbsp; Any thoughts on this?&lt;/DIV&gt;\n&lt;DIV&gt;&nb=\r\nsp;&lt;/DIV&gt;\n&lt;DIV&gt;By the way, I think the work you are doing is, well, extraor=\r\ndinary.&nbsp; &nbsp;&nbsp;Like pros from any other field of endeavor, you m=\r\nake this stuff&nbsp;look easy to do...not so.&nbsp;&nbsp;Thanks again.&nbsp=\r\n;&nbsp; Ron&nbsp;L&nbsp; &lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;bruce halliday &lt;paranorma=\r\nlinvestiga&lt;WBR&gt;ting@hotmail.&lt;WBR&gt;com&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/DIV&gt;\n&lt;BLOCKQUOTE c=\r\nlass=3DEC_replbq style=3D&quot;BORDER-LEFT: #1010ff 2px solid&quot;&gt;\n&lt;DIV id=3DEC_ygr=\r\np-text&gt;\n&lt;DIV&gt;Hey Ron L.,&lt;BR&gt;&nbsp;&lt;BR&gt;In my experience it does not matter w=\r\nhat language you recieve the signal in.&lt;BR&gt;The entities are using only frag=\r\nments, small bits and pieces of the radio signal&lt;BR&gt;to form the words. Ther=\r\nefore it does not matter if the radio signal is in spanish &lt;BR&gt;or english o=\r\nr any other language for that matter.&lt;BR&gt;&nbsp;&lt;BR&gt;Our friends on the other=\r\n side will manipulate the fragments they need to communicate &lt;BR&gt;with you i=\r\nn the language you will understand.&lt;BR&gt;&nbsp;&lt;BR&gt;Ron you mention that you a=\r\nre using an rs 690 that is not one of the hack model numbers &lt;BR&gt;maybe you =\r\nhave gotten the wrong radio model. Check the part number it must be a 12-46=\r\n9&lt;BR&gt;or a 12-470 and if it is the 470 it would have to be the older model o=\r\nr it could not be modified.&lt;BR&gt;&nbsp;&lt;BR&gt;Can you verify that you have modif=\r\nied the rs radio and that it is continually scanning without&lt;BR&gt;stopping on=\r\n any one particular station?&lt;BR&gt;&nbsp;&lt;BR&gt;Also there would be no need for E=\r\nVP maker or a microphone to be used during a session with the RS box&lt;BR&gt;all=\r\n you would need is the RS box and a digital recorder, if you have the 469 y=\r\nou would need speakers to &lt;BR&gt;record the session or plug the digital record=\r\ner directly into the radio.&lt;BR&gt;&nbsp;&lt;BR&gt;Please check your equipment and ho=\r\nw it is operating and let me know so I can help you further.&lt;BR&gt;Don&#39;t worry=\r\n they are just waiting for you to set up the correct equipment and they wil=\r\nl communicate.&lt;BR&gt;&nbsp;&lt;BR&gt;Bruce&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;DIV align=3Dcenter&gt;&lt;FONT siz=\r\ne=3D4&gt;&lt;FONT color=3D#0033cc&gt;&lt;STRONG&gt;&lt;EM&gt;&lt;FONT color=3D#000000 size=3D5&gt;Bruc=\r\ne Halliday &lt;BR&gt;&lt;/FONT&gt;&lt;/EM&gt;&lt;/STRONG&gt;&lt;BR&gt;&lt;A href=3D&quot;http://free-paranormalin=\r\nvestigating.com/%3C/div%3E%3C/div%3E%3Cp%20/%3E%3Cdiv%20class=3D&quot; target=3D=\r\n_blank&gt;&lt;/FONT&gt;&lt;/FONT&gt;&lt;/DIV&gt;&lt;/A&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;BLOCKQUOTE&gt;\n&lt;HR&gt;\nTo: EVP-ITC@yahoo=\r\ngroups&lt;WBR&gt;.com&lt;BR&gt;From: ronriko@yahoo.&lt;WBR&gt;com&lt;BR&gt;Date: Tue, 8 Jan 2008 11=\r\n:16:51 -0800&lt;BR&gt;Subject: [EVP-ITC] for Bruce Halliday - A technician reques=\r\nt&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3DEC_EC_ygrp-mlmsg&gt;\n&lt;DIV id=3DEC_EC_ygrp-msg&gt;\n&lt;DIV id=3DE=\r\nC_EC_ygrp-text&gt;Bruce, I now have done a few days testing with my rs 690, ev=\r\np maker, audacity, a mic, and my handheld digital recorder.&nbsp; Nada, not=\r\nhing, zilch.&nbsp; Maybe because I only get to scan past 5 to 8 channels on=\r\n Am or FM so I don&#39;t have enough signals to muster a response.&nbsp; But fr=\r\nom what you and others with experience seem to be saying, it shouldn&#39;t matt=\r\ner because I will get help from someone on the other-side.&nbsp; Maybe they=\r\n can&#39;t find me in Mexico?&nbsp; Please let&nbsp;your techs&nbsp;know I am h=\r\nere...should be no problem with immigration papers or money exchange.&nbsp;=\r\n I really need help.&nbsp; Ron L&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;bruce halliday &lt;paranormal=\r\ninvestiga&lt;WBR&gt;ting@hotmail.&lt;WBR&gt;com&gt;&lt;/I&gt;&lt;/B&gt; wrote: \n&lt;BLOCKQUOTE class=\r\n=3DEC_EC_replbq style=3D&quot;BORDER-LEFT: #1010ff 2px solid&quot;&gt;\n&lt;DIV id=3DEC_EC_y=\r\ngrp-text&gt;\n&lt;DIV&gt;Ann,&lt;BR&gt;That may be, But I find that when I do a session mik=\r\ne and lisa both come through but mike seems to be the more dominant one.&lt;BR=\r\n&gt;&nbsp;&lt;BR&gt;I have asked that mike and lisa help in your sessions as well as=\r\n other new researchers and they seem to comply but I think mike&lt;BR&gt;is more =\r\nlike a supervisor and delegates actions to other techs. I know that if you =\r\ndo not have a perminent tech that whatever tech&lt;BR&gt;is available at the time=\r\n you do your session will be assigned to assist you. If it is lisa she is v=\r\nery sweet and will do her best to give you &lt;BR&gt;solid communication. I&#39;m gla=\r\nd she can help.&lt;BR&gt;&nbsp;&lt;BR&gt;Bruce&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;DIV align=3Dcenter&gt;&lt;FONT si=\r\nze=3D4&gt;&lt;FONT color=3D#0033cc&gt;&lt;STRONG&gt;&lt;EM&gt;&lt;FONT color=3D#000000 size=3D5&gt;Bru=\r\nce Halliday &lt;BR&gt;&lt;/FONT&gt;&lt;/EM&gt;&lt;/STRONG&gt;&lt;BR&gt;&lt;A href=3D&quot;http://free-paranormali=\r\nnvestigating.com/%3C/div%3E%3C/div%3E%3Cp%20/%3E%3Cdiv%20class=3D&quot; target=\r\n=3D_blank&gt;&lt;/FONT&gt;&lt;/FONT&gt;&lt;/DIV&gt;&lt;/A&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;BLOCKQUOTE&gt;\n&lt;HR&gt;\nTo: EVP-ITC@ya=\r\nhoogroups&lt;WBR&gt;.com&lt;BR&gt;From: lisby@earthlink.&lt;WBR&gt;net&lt;BR&gt;Date: Tue, 8 Jan 20=\r\n08 11:40:02 -0500&lt;BR&gt;Subject: RE: [EVP-ITC] Re: A file from Frank&#39;s box #12=\r\n pertaining to lisby&#39;s technition&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3DEC_EC_EC_ygrp-mlmsg&gt;\n&lt;D=\r\nIV id=3DEC_EC_EC_ygrp-msg&gt;\n&lt;DIV id=3DEC_EC_EC_ygrp-text&gt;I&#39;m getting the tho=\r\nught that Lisa is bouncing around between us. She&#39;s very dominant every tim=\r\ne I run a session and I&#39;ve gotten some good stuff from her, which I will sh=\r\nortly be able to post, I hope. About a week ago, I got a really extraordina=\r\nry sequence that ran something along the lines of a male saying, &quot;Lisa, can=\r\n you do it?&quot; followed by a clear female voice saying, &quot;Testing. Beginning. =\r\nGround,&quot; and then a second female voice saying &quot;Kick.&quot; I was floored.&lt;BR&gt;&lt;B=\r\nR&gt;Anyway, Lisa seems to be the driver of a lot of what is going on right no=\r\nw. Maybe she intends to work with a number of us?&lt;BR&gt;&lt;BR&gt;Ann&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;B=\r\nLOCKQUOTE&gt;-----Original Message----- &lt;BR&gt;From: bruce halliday &lt;BR&gt;Sent: Jan=\r\n 8, 2008 9:22 AM &lt;BR&gt;To: evp-itc@yahoogroups&lt;WBR&gt;.com &lt;BR&gt;Subject: RE: [EVP=\r\n-ITC] Re: A file from Frank&#39;s box #12 pertaining to lisby&#39;s technition &lt;BR&gt;=\r\n&lt;BR&gt;\n&lt;DIV id=3DEC_EC_EC_ygrp-mlmsg&gt;\n&lt;DIV id=3DEC_EC_EC_ygrp-msg&gt;\n&lt;DIV id=3D=\r\nEC_EC_EC_ygrp-text&gt;\n&lt;DIV&gt;Frank,&lt;BR&gt;&nbsp;&lt;BR&gt;I have two techs that I speak =\r\nwith on a daily basis and one of them&lt;BR&gt;is Lisa. She could possibly be con=\r\ntacting you with the technical info she tried to give me&lt;BR&gt;yesterday.&lt;BR&gt;&=\r\nnbsp;&lt;BR&gt;Bruce&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;DIV align=3Dcenter&gt;&lt;FONT size=3D4&gt;&lt;FONT col=\r\nor=3D#0033cc&gt;&lt;STRONG&gt;&lt;EM&gt;&lt;FONT color=3D#000000 size=3D5&gt;Bruce Halliday &lt;BR&gt;=\r\n&lt;/FONT&gt;&lt;/EM&gt;&lt;/STRONG&gt;&lt;BR&gt;&lt;A href=3D&quot;http://free-paranormalinvestigating.com=\r\n/%3C/div%3E%3C/div%3E%3Cp%20/%3E%3Cdiv%20class=3D&quot; target=3D_blank&gt;&lt;/A&gt;&lt;/FO=\r\nNT&gt;&lt;/FONT&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;BLOCKQUOTE&gt;\n&lt;HR&gt;\nTo: EVP-ITC@yahoogroups&lt;WBR&gt;.com=\r\n&lt;BR&gt;From: franks-boxes@&lt;WBR&gt;hotmail.com&lt;BR&gt;Date: Tue, 8 Jan 2008 06:39:54 +=\r\n0000&lt;BR&gt;Subject: [EVP-ITC] Re: A file from Frank&#39;s box #12 pertaining to li=\r\nsby&#39;s technition&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3DEC_EC_EC_EC_ygrp-mlmsg&gt;\n&lt;DIV id=3DEC_EC_=\r\nEC_EC_ygrp-msg&gt;\n&lt;DIV id=3DEC_EC_EC_EC_ygrp-text&gt;I&#39;ve been getting Lisa too,=\r\n but so far not in any segments tranfered &lt;BR&gt;to the PC. Even tonight I hea=\r\nrd her, but not while I was taping. &lt;BR&gt;&lt;BR&gt;Frank-S&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=\r\n=3D&quot;mailto:EVP-ITC@yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;, Lisby=\r\n &lt;lisby@...&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; Hmmmm. That second bit gave me th=\r\ne creepies, I must say. What are &lt;BR&gt;&gt; your thoughts on that, Bruce? I h=\r\near Lisa&#39;s name at least a dozen &lt;BR&gt;&gt; times each time I run a session, =\r\nso I feel confident that she is &lt;BR&gt;&gt; there, so I feel confident that I&#39;=\r\nm not in the hands of someone I &lt;BR&gt;&gt; don&#39;t want to be in. Maybe they ar=\r\ne still auditioning for the role?&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; On Jan 7, 2008,=\r\n at 9:49 AM, bhali333 wrote:&lt;BR&gt;&gt; &lt;BR&gt;&gt; &gt; the precedeing file was =\r\nfrom a question about Ann&#39;s technition on&lt;BR&gt;&gt; &gt; 12-08-07&lt;BR&gt;&gt; &gt=\r\n;&lt;BR&gt;&gt; &gt; Bruce&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;=\r\n&lt;BR&gt;&lt;/DIV&gt;&lt;SPAN style=3D&quot;COLOR: white&quot;&gt;&lt;/SPAN&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;=\r\n\n&lt;HR&gt;\nMake distant family not so distant with Windows Vista=AE + Windows Li=\r\nve=99. &lt;A href=3D&quot;http://www.microsoft.com/windows/digitallife/keepintouch.=\r\nmspx?ocid=3DTXT_TAGLM_CPC_VideoChat_distantfamily_012008&quot; target=3D_blank&gt;S=\r\ntart now!&lt;/A&gt; &lt;BR&gt;&lt;/DIV&gt;&lt;SPAN style=3D&quot;COLOR: white&quot;&gt;&lt;/SPAN&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/D=\r\nIV&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;SPAN style=3D&quot;COLOR: white&quot;&gt;&lt;/SPAN&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;=\r\n/BLOCKQUOTE&gt;&lt;BR&gt;\n&lt;HR&gt;\nWatch =93Cause Effect,=94 a show about real people ma=\r\nking a real difference. &lt;A href=3D&quot;http://im.live.com/Messenger/IM/MTV/?sou=\r\nrce=3Dtext_watchcause&quot; target=3D_blank&gt;Learn more&lt;/A&gt; \n&lt;DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/D=\r\nIV&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;\n&lt;DIV&gt;\n&lt;HR SIZE=3D1&gt;\nBe a better friend, newshound, and=\r\n know-it-all with Yahoo! Mobile. &lt;A href=3D&quot;http://us.rd.yahoo.com/evt=3D51=\r\n733/*http://mobile.yahoo.com/;_ylt=3DAhu06i62sR8HDtDypao8Wcj9tAcJ&quot; target=\r\n=3D_blank&gt;Try it now.&lt;/A&gt; \n&lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;SPAN style=3D&quot;COLOR: white=\r\n&quot;&gt;&lt;/SPAN&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;\n&lt;HR&gt;\nShare life as it happens =\r\nwith the new Windows Live. &lt;A href=3D&quot;http://www.windowslive.com/share.html=\r\n?ocid=3DTXT_TAGHM_Wave2_sharelife_012008&quot; target=3D_blank&gt;Start sharing!&lt;/A=\r\n&gt; \n&lt;DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;\n&lt;P&gt;\n&lt;HR SIZE=3D1&gt;\nLooking for l=\r\nast minute shopping deals? &lt;A href=3D&quot;http://us.rd.yahoo.com/evt=3D51734/*h=\r\nttp://tools.search.yahoo.com/newsearch/category.php?category=3Dshopping&quot; ta=\r\nrget=3D_blank&gt;Find them fast with Yahoo! Search.&lt;/A&gt; \n&lt;P&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;SPAN st=\r\nyle=3D&quot;COLOR: white&quot;&gt;&lt;/SPAN&gt; \n&lt;STYLE&gt;\n.ExternalClass #EC_ygrp-mkp\n{border:1=\r\npx solid #d8d8d8;font-family:Arial;padding:0px 14px;}\n.ExternalClass #EC_yg=\r\nrp-mkp hr\n{border:1px solid #d8d8d8;}\n.ExternalClass #EC_ygrp-mkp #EC_hd\n{c=\r\nolor:#628c2a;font-size:85%;font-weight:bold;line-height:122%;}\n.ExternalCla=\r\nss #EC_ygrp-mkp #EC_ads\n{margin-bottom:10px;}\n.ExternalClass #EC_ygrp-mkp .=\r\nEC_ad\n{padding:0 0;}\n.ExternalClass #EC_ygrp-mkp .EC_ad a\n{color:#0000ff;te=\r\nxt-decoration:none;}\n\n&lt;/STYLE&gt;\n\n&lt;STYLE&gt;\n.ExternalClass #EC_ygrp-sponsor #EC=\r\n_ygrp-lc\n{font-family:Arial;}\n.ExternalClass #EC_ygrp-sponsor #EC_ygrp-lc #=\r\nEC_hd\n{font-weight:bold;font-size:78%;line-height:122%;}\n.ExternalClass #EC=\r\n_ygrp-sponsor #EC_ygrp-lc .EC_ad\n{margin-bottom:10px;padding:0 0;}\n\n&lt;/STYLE=\r\n&gt;\n\n&lt;STYLE&gt;\n.ExternalClass #EC_ygrp-mlmsg\n{font-size:13px;font-family:arial,=\r\nhelvetica,clean,sans-serif;}\n.ExternalClass #EC_ygrp-mlmsg table\n{font-size=\r\n:inherit;font:100%;}\n.ExternalClass #EC_ygrp-mlmsg select, .ExternalClass i=\r\nnput, .ExternalClass textarea\n{font:99% arial,helvetica,clean,sans-serif;}\n=\r\n.ExternalClass #EC_ygrp-mlmsg pre, .ExternalClass code\n{font:115% monospace=\r\n;}\n.ExternalClass #EC_ygrp-mlmsg EC_*\n{line-height:1.22em;}\n.ExternalClass =\r\n#EC_ygrp-text\n{font-family:Georgia;}\n.ExternalClass #EC_ygrp-text p\n{;}\n.Ex=\r\nternalClass #EC_ygrp-tpmsgs\n{font-family:Arial;clear:both;}\n.ExternalClass =\r\n#EC_ygrp-vitnav\n{padding-top:10px;font-family:Verdana;font-size:77%;}\n.Exte=\r\nrnalClass #EC_ygrp-vitnav a\n{padding:0 1px;}\n.ExternalClass #EC_ygrp-actbar=\r\n\n{clear:both;white-space:nowrap;color:#666;text-align:right;}\n.ExternalClas=\r\ns #EC_ygrp-actbar .EC_left\n{float:left;white-space:nowrap;}\n.ExternalClass =\r\n.EC_bld\n{font-weight:bold;}\n.ExternalClass #EC_ygrp-grft\n{font-family:Verda=\r\nna;font-size:77%;padding:15px 0;}\n.ExternalClass #EC_ygrp-ft\n{font-family:v=\r\nerdana;font-size:77%;border-top:1px solid #666;padding:5px 0;}\n.ExternalCla=\r\nss #EC_ygrp-mlmsg #EC_logo\n{padding-bottom:10px;}\n.ExternalClass #EC_ygrp-v=\r\nital\n{background-color:#e0ecee;margin-bottom:20px;padding:2px 0 8px 8px;}\n.=\r\nExternalClass #EC_ygrp-vital #EC_vithd\n{font-size:77%;font-family:Verdana;f=\r\nont-weight:bold;color:#333;text-transform:uppercase;}\n.ExternalClass #EC_yg=\r\nrp-vital ul\n{padding:0;}\n.ExternalClass #EC_ygrp-vital ul li\n{list-style-ty=\r\npe:none;clear:both;border:1px solid #e0ecee;}\n.ExternalClass #EC_ygrp-vital=\r\n ul li .EC_ct\n{font-weight:bold;color:#ff7900;float:right;width:2em;text-al=\r\nign:right;padding-right:.5em;}\n.ExternalClass #EC_ygrp-vital ul li .EC_cat\n=\r\n{font-weight:bold;}\n.ExternalClass #EC_ygrp-vital a\n{text-decoration:none;}=\r\n\n.ExternalClass #EC_ygrp-vital a:hover\n{text-decoration:underline;}\n.Extern=\r\nalClass #EC_ygrp-sponsor #EC_hd\n{color:#999;font-size:77%;}\n.ExternalClass =\r\n#EC_ygrp-sponsor #EC_ov\n{padding:6px 13px;background-color:#e0ecee;margin-b=\r\nottom:20px;}\n.ExternalClass #EC_ygrp-sponsor #EC_ov ul\n{padding:0 0 0 8px;}=\r\n\n.ExternalClass #EC_ygrp-sponsor #EC_ov li\n{list-style-type:square;padding:=\r\n6px 0;font-size:77%;}\n.ExternalClass #EC_ygrp-sponsor #EC_ov li a\n{text-dec=\r\noration:none;font-size:130%;}\n.ExternalClass #EC_ygrp-sponsor #EC_nc\n{backg=\r\nround-color:#eee;margin-bottom:20px;padding:0 8px;}\n.ExternalClass #EC_ygrp=\r\n-sponsor .EC_ad\n{padding:8px 0;}\n.ExternalClass #EC_ygrp-sponsor .EC_ad #EC=\r\n_hd1\n{font-family:Arial;font-weight:bold;color:#628c2a;font-size:100%;line-=\r\nheight:122%;}\n.ExternalClass #EC_ygrp-sponsor .EC_ad a\n{text-decoration:non=\r\ne;}\n.ExternalClass #EC_ygrp-sponsor .EC_ad a:hover\n{text-decoration:underli=\r\nne;}\n.ExternalClass #EC_ygrp-sponsor .EC_ad p\n{;}\n.ExternalClass EC_o\n{font=\r\n-size:0;}\n.ExternalClass .EC_MsoNormal\n{;}\n.ExternalClass #EC_ygrp-text tt\n=\r\n{font-size:120%;}\n.ExternalClass blockquote\n{;}\n.ExternalClass .EC_replbq\n{=\r\n;}\n\n&lt;/STYLE&gt;\n&lt;/BLOCKQUOTE&gt;&lt;br /&gt;&lt;hr /&gt;Watch =93Cause Effect,=94 a show abou=\r\nt real people making a real difference. &lt;a href=3D&#39;http://im.live.com/Messe=\r\nnger/IM/MTV/?source=3Dtext_watchcause&#39; target=3D&#39;_new&#39;&gt;Learn more&lt;/a&gt;&lt;/body=\r\n&gt;\n&lt;/html&gt;\r\n--_94cc4e07-1a3a-41f4-8f56-c045212b938b_--"}