{"id": "5172", "subject": "Re: Box in the morning", "author": "Steve Hultay", "timestamp": "2008-01-09T23:27:45Z", "full_text": "Nick,\n\nJust so you know that all this is just personal opinions and i don&#39;t \nbelieve that Bruce stressed that to you in the post.  Every \nresearcher has their own opinions on how it is done and the results \nhave varied amongst us.  There is no way to actually explain to \nsomeone how these devices work, i couldn&#39;t tell you that leaving the \nbox on will make it imprint because there are no facts based on this \nresearch thus far.  Only personal opinions have been put out there \nand what we have experienced for ourselves up to this point.  \nEverybody needs to do their own research with a little helping hand \nfrom those who have been doing this a little while longer and that&#39;s \nit.  You will find your own niche in this communication and teach \nwhat you&#39;ve learned to others one day.  Just remember that nobody can \ntell how it should be, because there is no proof only some personal \nexperiences.  That covers all paranormal areas, you can believe or \nnot in something but you can&#39;t prove it to others or at least i don&#39;t \nthink anybody has yet??\n\n-Steve .\n\n\n\n--- In EVP-ITC@yahoogroups.com, bruce halliday \n&lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; \n&gt; Nick,\n&gt;  \n&gt; You are a new member and a possible researcher so I do not want to \nget off on the wrong foot\n&gt; It sounds like you may have taken what I said as criticism, It was \nnot meant to be.\n&gt; Just experienced advice. There are some researchers that believe it \nis beneficial to leave \n&gt; a box running and unattended, so that our spirit friends \ncan &quot;imprint&quot; to the frequency of the box\n&gt;  \n&gt; That is not at all necessary, Spirit techs do need to imprint to \ncertain boxes but do so through two way communication\n&gt; you see they also imprint the energy signature of the user of the \nbox also. And that can only be accomplished through \n&gt; communicative interaction during a session. If the box is left \nunattended they may only accomplish half of what they need to do.\n&gt;  \n&gt; Also I have had first hand experience with certain researchers that \ndo practice this lackadaisical us of a box and had begun to \n&gt; get less and less communication during attempts at actual sessions \nand eventually nothing but negative entities coming through.\n&gt; I am not saying this is solely due to doing an absent session which \nis what I have come to call it, It entails man6y factors.\n&gt;  \n&gt; But the absent session practice definitely contributes to the \nultimate failure of communication. \n&gt; Nick, it is better for you to establish solid research practices in \nthe beginning that will serve to enhance your communication \n&gt; skills and growth in the future.\n&gt;  \n&gt; Remember your spirit contacts or &quot;technicians&quot; will become not only \nthe facilitators of your link and communication from the\n&gt; other side but they will become your trusted friends and \nprotectors. you would never leave your buddy on the phone and go \n&gt; on to something else while he remained on the line calling for you \nto speak with him. Our spirit friends where people just like us\n&gt; at one time and the emotions we carry in the physical also carry \nover to our spirit lives.\n&gt;  \n&gt; I hope you do not take this as preaching or criticism it is just \nexperience from communicating with my own techs and friends\n&gt; and gathering information on what they feel and expect from us as \nresearchers.\n&gt; Remember all we have to do is turn on a box and listen and record \ntheir job to send the communication \n&gt; no matter how short the phrase or word is a 1000x harder for them \nso don&#39;t you think they deserve a 100% \n&gt; of our attention when we open the lines of communication.\n&gt;  \n&gt; Also in closing let me say that my belief on &quot;imprinting&quot; of a box \nis for boxes like Frank&#39;s box and the mini box, for the simple\n&gt; reason that they are individually made and each carry a slightly \ndifferent frequency range, indicative to that particular box.\n&gt; The radio shack hack box on the other hand is manufactured in china \nmost likely on an automated assembly line so each\n&gt; circuit board is exactly like the next, this being the case I \nbelieve that when our friends imprinted on the first of the RS boxes\n&gt; it was sufficient for most of the others. That is why people \nexperience immediate communication right out of the box.\n&gt;  \n&gt; So therefore the RS box does not need that grace period to &quot;Imprint&quot;\n&gt;  \n&gt; These comments and statements are my own hypothesis based on my own \nextensive research with every type of box that is made to date\n&gt; and I am only offering it so that it may help others to avoid the \ntoil and mistakes that I have endured.\n&gt;  \n&gt; thanks for giving me the soap box once again!\n&gt;  \n&gt; Bruce\n&gt; Bruce Halliday \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: thegreatwolf@...: Wed, 9 Jan 2008 06:25:30 -\n0500Subject: Re: [EVP-ITC] Box in the morning\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Just FYI, I had stopped checking my email at that time and was \ntrying to get someone to say something.  I usually can&#39;t get my self \nto not pay attention to the box when i turn it on.\n&gt; \n&gt; On Jan 8, 2008, at 9:19 AM, bruce halliday wrote:\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Nick, My advice as a long time researcher is not to just turn the \nbox on and leave it running unless you intend to do a session and \ngive your friends on the other side that are workingextremely hard to \nsend you the communication your undivided attention. It&#39;s kind of \nlike calling someone on the phone and when they start a conversation \nyou decide toput the phone down and focus your attention on other \nthings. There are other researchers that feel that there is nothing \nwrong with this practice and do it on occasionBut I have come to the \nunderstanding that it is deemed disrespectful and while you may be \nlistening with one ear as you do something else, you will hear a loud \ncurse word or nasty statement, that is their way of getting your \nattention back. I have gotten numerous messages about the difficulty \nof the attempts for them to communicate so when I turn the box on it \ngets my full attention. just some experienced advice. As for them \ntelling you to close the portal, it could have two meanings. \nSometimes they refer to box thatis turned on and in use as a portal \nfor the simple reason that each time we turn a box on to communicate \nit opens a direct open link between our realm and theirs so in \nessence it is an open door for anything to pass in or out. that is \nwhy when I end a session I always ask my technician to bring back any \nspirits that may have come through the portal during the session and \nI ask for conformation and 10 times out of ten will get &quot;OK&quot; or &quot;OK \nTHEY ARE BACK&quot; also they may have meant since you had the box running \nand where not doing a actual session to shut the box so that they \ncould go and not have to protect the open connection from any \nnegative entities that where able cross through the openportal. A few \nresearchers have been receiving numerous messages about the number 7 \nwithin the past month. The only known significance that the number 7 \nhas in evp research is the 7 entities that controlled communication \nback in the eighties and ninetiesduring the spiricom and luxembourg \nera. To receive this number in messages so often and by more than one \nresearcher, odiouslyholds some importance which they have not been \nable or are not ready to convey. If you need any help or have any \nquestions please feel free to ask. Bruce\n&gt; Bruce Halliday \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: thegreatwolf@...: Tue, 8 Jan 2008 06:27:07 -\n0500Subject: [EVP-ITC] Box in the morning\n&gt; \n&gt; \n&gt; Hey,Anyone have any odd problems in the morning with using it. I am \nsitting here checking my email so i just thought i&#39;d turn it on \nand... not check my email. Anywho.... Then right at about 6:20 i \nheard a voice say &quot;Nicholas Etheridge please turn off the dsfnlsd&quot; \nnot quite sure what word it used... possibly portal. I just thought \nit was weird. Also under all of the jumble and this voice speaking i \nheard a deep male voice almost chanting &quot;seven&quot;. Not sure if I \nactually heard this or its the want to have an excuse to stay home \nand not take the HSAs.Anyway.. just curious if anyone has gotten \nheard this or if they know something I don&#39;t about using the box in \nthe morning.Peace,Nick\n&gt; \n&gt; Get the power of Windows + Web with the new Windows Live. Get it \nnow! \n&gt; \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Put your friends on the big screen with Windows Vista + Windows \nLive.\n&gt; http://www.microsoft.com/windows/shop/specialoffers.mspx?\nocid=TXT_TAGLM_CPC_MediaCtr_bigscreen_012008\n&gt;"}