{"id": "5180", "subject": "RE: [EVP-ITC] Re: Box in the morning", "author": "bruce halliday", "timestamp": "2008-01-10T00:30:22Z", "full_text": "--_8c435104-130d-4098-828e-50a4f5950fbc_\r\nContent-Type: text/plain; charset=&quot;Windows-1252&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n\nsteve,\n \nvery well said, It goes without saying that this is all pure theo=\r\nry based on personal experience.\nbut as you know we also recieve advice and=\r\n knowledge from our friends on the other side from time to time\nand that he=\r\nlps us formulate the theories we do. On the premiss of the absentee session=\r\ns, lets agree to disagree\nuntil further experimentation is done or further =\r\nmore detailed messages are recieved and posted on the subject.\n \nBruce\nBruc=\r\ne Halliday \n\n\nTo: EVP-ITC@yahoogroups.comFrom: urkel23@...: Wed, 9 =\r\nJan 2008 23:27:45 +0000Subject: [EVP-ITC] Re: Box in the morning\n\n\n\n\nNick,J=\r\nust so you know that all this is just personal opinions and i don&#39;t believe=\r\n that Bruce stressed that to you in the post. Every researcher has their ow=\r\nn opinions on how it is done and the results have varied amongst us. There =\r\nis no way to actually explain to someone how these devices work, i couldn&#39;t=\r\n tell you that leaving the box on will make it imprint because there are no=\r\n facts based on this research thus far. Only personal opinions have been pu=\r\nt out there and what we have experienced for ourselves up to this point. Ev=\r\nerybody needs to do their own research with a little helping hand from thos=\r\ne who have been doing this a little while longer and that&#39;s it. You will fi=\r\nnd your own niche in this communication and teach what you&#39;ve learned to ot=\r\nhers one day. Just remember that nobody can tell how it should be, because =\r\nthere is no proof only some personal experiences. That covers all paranorma=\r\nl areas, you can believe or not in something but you can&#39;t prove it to othe=\r\nrs or at least i don&#39;t think anybody has yet??-Steve .--- In EVP-ITC@yahoog=\r\nroups.com, bruce halliday &lt;paranormalinvestigating@...&gt; wrote:&gt;&gt; &gt; Nick,&gt; &gt;=\r\n You are a new member and a possible researcher so I do not want to get off=\r\n on the wrong foot&gt; It sounds like you may have taken what I said as critic=\r\nism, It was not meant to be.&gt; Just experienced advice. There are some resea=\r\nrchers that believe it is beneficial to leave &gt; a box running and unattende=\r\nd, so that our spirit friends can &quot;imprint&quot; to the frequency of the box&gt; &gt; =\r\nThat is not at all necessary, Spirit techs do need to imprint to certain bo=\r\nxes but do so through two way communication&gt; you see they also imprint the =\r\nenergy signature of the user of the box also. And that can only be accompli=\r\nshed through &gt; communicative interaction during a session. If the box is le=\r\nft unattended they may only accomplish half of what they need to do.&gt; &gt; Als=\r\no I have had first hand experience with certain researchers that do practic=\r\ne this lackadaisical us of a box and had begun to &gt; get less and less commu=\r\nnication during attempts at actual sessions and eventually nothing but nega=\r\ntive entities coming through.&gt; I am not saying this is solely due to doing =\r\nan absent session which is what I have come to call it, It entails man6y fa=\r\nctors.&gt; &gt; But the absent session practice definitely contributes to the ult=\r\nimate failure of communication. &gt; Nick, it is better for you to establish s=\r\nolid research practices in the beginning that will serve to enhance your co=\r\nmmunication &gt; skills and growth in the future.&gt; &gt; Remember your spirit cont=\r\nacts or &quot;technicians&quot; will become not only the facilitators of your link an=\r\nd communication from the&gt; other side but they will become your trusted frie=\r\nnds and protectors. you would never leave your buddy on the phone and go &gt; =\r\non to something else while he remained on the line calling for you to speak=\r\n with him. Our spirit friends where people just like us&gt; at one time and th=\r\ne emotions we carry in the physical also carry over to our spirit lives.&gt; &gt;=\r\n I hope you do not take this as preaching or criticism it is just experienc=\r\ne from communicating with my own techs and friends&gt; and gathering informati=\r\non on what they feel and expect from us as researchers.&gt; Remember all we ha=\r\nve to do is turn on a box and listen and record their job to send the commu=\r\nnication &gt; no matter how short the phrase or word is a 1000x harder for the=\r\nm so don&#39;t you think they deserve a 100% &gt; of our attention when we open th=\r\ne lines of communication.&gt; &gt; Also in closing let me say that my belief on &quot;=\r\nimprinting&quot; of a box is for boxes like Frank&#39;s box and the mini box, for th=\r\ne simple&gt; reason that they are individually made and each carry a slightly =\r\ndifferent frequency range, indicative to that particular box.&gt; The radio sh=\r\nack hack box on the other hand is manufactured in china most likely on an a=\r\nutomated assembly line so each&gt; circuit board is exactly like the next, thi=\r\ns being the case I believe that when our friends imprinted on the first of =\r\nthe RS boxes&gt; it was sufficient for most of the others. That is why people =\r\nexperience immediate communication right out of the box.&gt; &gt; So therefore th=\r\ne RS box does not need that grace period to &quot;Imprint&quot;&gt; &gt; These comments and=\r\n statements are my own hypothesis based on my own extensive research with e=\r\nvery type of box that is made to date&gt; and I am only offering it so that it=\r\n may help others to avoid the toil and mistakes that I have endured.&gt; &gt; tha=\r\nnks for giving me the soap box once again!&gt; &gt; Bruce&gt; Bruce Halliday &gt; &gt; &gt; T=\r\no: EVP-ITC@...: thegreatwolf@...: Wed, 9 Jan 2008 06:25:30 -0500Subject: Re=\r\n: [EVP-ITC] Box in the morning&gt; &gt; &gt; &gt; &gt; Just FYI, I had stopped checking my=\r\n email at that time and was trying to get someone to say something. I usual=\r\nly can&#39;t get my self to not pay attention to the box when i turn it on.&gt; &gt; =\r\nOn Jan 8, 2008, at 9:19 AM, bruce halliday wrote:&gt; &gt; &gt; &gt; &gt; Nick, My advice =\r\nas a long time researcher is not to just turn the box on and leave it runni=\r\nng unless you intend to do a session and give your friends on the other sid=\r\ne that are workingextremely hard to send you the communication your undivid=\r\ned attention. It&#39;s kind of like calling someone on the phone and when they =\r\nstart a conversation you decide toput the phone down and focus your attenti=\r\non on other things. There are other researchers that feel that there is not=\r\nhing wrong with this practice and do it on occasionBut I have come to the u=\r\nnderstanding that it is deemed disrespectful and while you may be listening=\r\n with one ear as you do something else, you will hear a loud curse word or =\r\nnasty statement, that is their way of getting your attention back. I have g=\r\notten numerous messages about the difficulty of the attempts for them to co=\r\nmmunicate so when I turn the box on it gets my full attention. just some ex=\r\nperienced advice. As for them telling you to close the portal, it could hav=\r\ne two meanings. Sometimes they refer to box thatis turned on and in use as =\r\na portal for the simple reason that each time we turn a box on to communica=\r\nte it opens a direct open link between our realm and theirs so in essence i=\r\nt is an open door for anything to pass in or out. that is why when I end a =\r\nsession I always ask my technician to bring back any spirits that may have =\r\ncome through the portal during the session and I ask for conformation and 1=\r\n0 times out of ten will get &quot;OK&quot; or &quot;OK THEY ARE BACK&quot; also they may have m=\r\neant since you had the box running and where not doing a actual session to =\r\nshut the box so that they could go and not have to protect the open connect=\r\nion from any negative entities that where able cross through the openportal=\r\n. A few researchers have been receiving numerous messages about the number =\r\n7 within the past month. The only known significance that the number 7 has =\r\nin evp research is the 7 entities that controlled communication back in the=\r\n eighties and ninetiesduring the spiricom and luxembourg era. To receive th=\r\nis number in messages so often and by more than one researcher, odiouslyhol=\r\nds some importance which they have not been able or are not ready to convey=\r\n. If you need any help or have any questions please feel free to ask. Bruce=\r\n&gt; Bruce Halliday &gt; &gt; &gt; To: EVP-ITC@...: thegreatwolf@...: Tue, 8 Jan 2008 0=\r\n6:27:07 -0500Subject: [EVP-ITC] Box in the morning&gt; &gt; &gt; Hey,Anyone have any=\r\n odd problems in the morning with using it. I am sitting here checking my e=\r\nmail so i just thought i&#39;d turn it on and... not check my email. Anywho....=\r\n Then right at about 6:20 i heard a voice say &quot;Nicholas Etheridge please tu=\r\nrn off the dsfnlsd&quot; not quite sure what word it used... possibly portal. I =\r\njust thought it was weird. Also under all of the jumble and this voice spea=\r\nking i heard a deep male voice almost chanting &quot;seven&quot;. Not sure if I actua=\r\nlly heard this or its the want to have an excuse to stay home and not take =\r\nthe HSAs.Anyway.. just curious if anyone has gotten heard this or if they k=\r\nnow something I don&#39;t about using the box in the morning.Peace,Nick&gt; &gt; Get =\r\nthe power of Windows + Web with the new Windows Live. Get it now! &gt; &gt; &gt; &gt; &gt;=\r\n &gt; &gt; &gt; &gt; __________________________________________________________&gt; Put yo=\r\nur friends on the big screen with Windows Vista=AE + Windows Live=99.&gt; http=\r\n://www.microsoft.com/windows/shop/specialoffers.mspx?ocid=3DTXT_TAGLM_CPC_M=\r\nediaCtr_bigscreen_012008&gt; \n\n\n\n\n\n\n__________________________________________=\r\n_______________________\nMake distant family not so distant with Windows Vis=\r\nta=AE + Windows Live=99.\nhttp://www.microsoft.com/windows/digitallife/keepi=\r\nntouch.mspx?ocid=3DTXT_TAGLM_CPC_VideoChat_distantfamily_012008\r\n--_8c435104-130d-4098-828e-50a4f5950fbc_\r\nContent-Type: text/html; charset=&quot;Windows-1252&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;\n&lt;head&gt;\n&lt;style&gt;\n.hmmessage P\n{\nmargin:0px;\npadding:0px\n}\nbody.hmmessa=\r\nge\n{\nFONT-SIZE: 10pt;\nFONT-FAMILY:Tahoma\n}\n&lt;/style&gt;\n&lt;/head&gt;\n&lt;body class=3D&#39;=\r\nhmmessage&#39;&gt;\nsteve,&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nvery well said, It goes without saying th=\r\nat this is all pure theory based on personal experience.&lt;BR&gt;\nbut as you kno=\r\nw we also recieve advice and knowledge from our friends on the other side f=\r\nrom time to time&lt;BR&gt;\nand that helps us formulate the theories we do. On the=\r\n premiss of the absentee sessions, lets agree to disagree&lt;BR&gt;\nuntil further=\r\n experimentation is done or further more detailed messages are recieved and=\r\n posted on the subject.&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nBruce&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;P align=3Dcenter&gt;=\r\n&lt;FONT size=3D4&gt;&lt;FONT color=3D#0033cc&gt;&lt;STRONG&gt;&lt;EM&gt;&lt;FONT color=3D#000000 size=\r\n=3D5&gt;Bruce Halliday &lt;BR&gt;&lt;/FONT&gt;&lt;/EM&gt;&lt;/STRONG&gt;&lt;BR&gt;&lt;A href=3D&quot;http://free-par=\r\nanormalinvestigating.com/%3C/div%3E%3C/div%3E%3Cp%20/%3E%3Cdiv%20class=3D&quot; =\r\ntarget=3D_blank&gt;&lt;/P&gt;&lt;/A&gt;&lt;/FONT&gt;&lt;/FONT&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;BLOCKQUOTE&gt;\n&lt;HR&gt;\nTo: EVP-IT=\r\nC@yahoogroups.com&lt;BR&gt;From: urkel23@...&lt;BR&gt;Date: Wed, 9 Jan 2008 23:27:4=\r\n5 +0000&lt;BR&gt;Subject: [EVP-ITC] Re: Box in the morning&lt;BR&gt;&lt;BR&gt;\n&lt;META content=\r\n=3D&quot;Microsoft SafeHTML&quot; name=3DGenerator&gt;\n&lt;DIV id=3DEC_ygrp-mlmsg style=3D&quot;=\r\nWIDTH: 655px&quot;&gt;\n&lt;DIV id=3DEC_ygrp-msg style=3D&quot;PADDING-RIGHT: 15px; PADDING-=\r\nLEFT: 0px; Z-INDEX: 1; FLOAT: left; PADDING-BOTTOM: 0px; WIDTH: 490px; PADD=\r\nING-TOP: 0px&quot;&gt;\n&lt;DIV id=3DEC_ygrp-text&gt;\nNick,&lt;BR&gt;&lt;BR&gt;Just so you know that a=\r\nll this is just personal opinions and i don&#39;t &lt;BR&gt;believe that Bruce stress=\r\ned that to you in the post. Every &lt;BR&gt;researcher has their own opinions on =\r\nhow it is done and the results &lt;BR&gt;have varied amongst us. There is no way =\r\nto actually explain to &lt;BR&gt;someone how these devices work, i couldn&#39;t tell =\r\nyou that leaving the &lt;BR&gt;box on will make it imprint because there are no f=\r\nacts based on this &lt;BR&gt;research thus far. Only personal opinions have been =\r\nput out there &lt;BR&gt;and what we have experienced for ourselves up to this poi=\r\nnt. &lt;BR&gt;Everybody needs to do their own research with a little helping hand=\r\n &lt;BR&gt;from those who have been doing this a little while longer and that&#39;s &lt;=\r\nBR&gt;it. You will find your own niche in this communication and teach &lt;BR&gt;wha=\r\nt you&#39;ve learned to others one day. Just remember that nobody can &lt;BR&gt;tell =\r\nhow it should be, because there is no proof only some personal &lt;BR&gt;experien=\r\nces. That covers all paranormal areas, you can believe or &lt;BR&gt;not in someth=\r\ning but you can&#39;t prove it to others or at least i don&#39;t &lt;BR&gt;think anybody =\r\nhas yet??&lt;BR&gt;&lt;BR&gt;-Steve .&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=3D&quot;mailto:EVP-ITC@yahoogrou=\r\nps.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;, bruce halliday &lt;BR&gt;&lt;paranormal=\r\ninvestig&lt;WBR&gt;ating@...&lt;WBR&gt;&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; &lt;BR&gt;&gt; Nick,&lt;BR&gt;&g=\r\nt; &lt;BR&gt;&gt; You are a new member and a possible researcher so I do not want=\r\n to &lt;BR&gt;get off on the wrong foot&lt;BR&gt;&gt; It sounds like you may have taken=\r\n what I said as criticism, It was &lt;BR&gt;not meant to be.&lt;BR&gt;&gt; Just experie=\r\nnced advice. There are some researchers that believe it &lt;BR&gt;is beneficial t=\r\no leave &lt;BR&gt;&gt; a box running and unattended, so that our spirit friends &lt;=\r\nBR&gt;can &quot;imprint&quot; to the frequency of the box&lt;BR&gt;&gt; &lt;BR&gt;&gt; That is not a=\r\nt all necessary, Spirit techs do need to imprint to &lt;BR&gt;certain boxes but d=\r\no so through two way communication&lt;BR&gt;&gt; you see they also imprint the en=\r\nergy signature of the user of the &lt;BR&gt;box also. And that can only be accomp=\r\nlished through &lt;BR&gt;&gt; communicative interaction during a session. If the =\r\nbox is left &lt;BR&gt;unattended they may only accomplish half of what they need =\r\nto do.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Also I have had first hand experience with certain =\r\nresearchers that &lt;BR&gt;do practice this lackadaisical us of a box and had beg=\r\nun to &lt;BR&gt;&gt; get less and less communication during attempts at actual se=\r\nssions &lt;BR&gt;and eventually nothing but negative entities coming through.&lt;BR&gt;=\r\n&gt; I am not saying this is solely due to doing an absent session which &lt;B=\r\nR&gt;is what I have come to call it, It entails man6y factors.&lt;BR&gt;&gt; &lt;BR&gt;&gt=\r\n; But the absent session practice definitely contributes to the &lt;BR&gt;ultimat=\r\ne failure of communication. &lt;BR&gt;&gt; Nick, it is better for you to establis=\r\nh solid research practices in &lt;BR&gt;the beginning that will serve to enhance =\r\nyour communication &lt;BR&gt;&gt; skills and growth in the future.&lt;BR&gt;&gt; &lt;BR&gt;&g=\r\nt; Remember your spirit contacts or &quot;technicians&quot; will become not only &lt;BR&gt;=\r\nthe facilitators of your link and communication from the&lt;BR&gt;&gt; other side=\r\n but they will become your trusted friends and &lt;BR&gt;protectors. you would ne=\r\nver leave your buddy on the phone and go &lt;BR&gt;&gt; on to something else whil=\r\ne he remained on the line calling for you &lt;BR&gt;to speak with him. Our spirit=\r\n friends where people just like us&lt;BR&gt;&gt; at one time and the emotions we =\r\ncarry in the physical also carry &lt;BR&gt;over to our spirit lives.&lt;BR&gt;&gt; &lt;BR&gt;=\r\n&gt; I hope you do not take this as preaching or criticism it is just &lt;BR&gt;e=\r\nxperience from communicating with my own techs and friends&lt;BR&gt;&gt; and gath=\r\nering information on what they feel and expect from us as &lt;BR&gt;researchers.&lt;=\r\nBR&gt;&gt; Remember all we have to do is turn on a box and listen and record &lt;=\r\nBR&gt;their job to send the communication &lt;BR&gt;&gt; no matter how short the phr=\r\nase or word is a 1000x harder for them &lt;BR&gt;so don&#39;t you think they deserve =\r\na 100% &lt;BR&gt;&gt; of our attention when we open the lines of communication.&lt;B=\r\nR&gt;&gt; &lt;BR&gt;&gt; Also in closing let me say that my belief on &quot;imprinting&quot; o=\r\nf a box &lt;BR&gt;is for boxes like Frank&#39;s box and the mini box, for the simple&lt;=\r\nBR&gt;&gt; reason that they are individually made and each carry a slightly &lt;B=\r\nR&gt;different frequency range, indicative to that particular box.&lt;BR&gt;&gt; The=\r\n radio shack hack box on the other hand is manufactured in china &lt;BR&gt;most l=\r\nikely on an automated assembly line so each&lt;BR&gt;&gt; circuit board is exactl=\r\ny like the next, this being the case I &lt;BR&gt;believe that when our friends im=\r\nprinted on the first of the RS boxes&lt;BR&gt;&gt; it was sufficient for most of =\r\nthe others. That is why people &lt;BR&gt;experience immediate communication right=\r\n out of the box.&lt;BR&gt;&gt; &lt;BR&gt;&gt; So therefore the RS box does not need tha=\r\nt grace period to &quot;Imprint&quot;&lt;BR&gt;&gt; &lt;BR&gt;&gt; These comments and statements =\r\nare my own hypothesis based on my own &lt;BR&gt;extensive research with every typ=\r\ne of box that is made to date&lt;BR&gt;&gt; and I am only offering it so that it =\r\nmay help others to avoid the &lt;BR&gt;toil and mistakes that I have endured.&lt;BR&gt;=\r\n&gt; &lt;BR&gt;&gt; thanks for giving me the soap box once again!&lt;BR&gt;&gt; &lt;BR&gt;&gt=\r\n; Bruce&lt;BR&gt;&gt; Bruce Halliday &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; To: EVP-ITC@...: =\r\nthegreatwolf@&lt;WBR&gt;...: Wed, 9 Jan 2008 06:25:30 -&lt;BR&gt;0500Subject: Re: [EVP-=\r\nITC] Box in the morning&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; Just FY=\r\nI, I had stopped checking my email at that time and was &lt;BR&gt;trying to get s=\r\nomeone to say something. I usually can&#39;t get my self &lt;BR&gt;to not pay attenti=\r\non to the box when i turn it on.&lt;BR&gt;&gt; &lt;BR&gt;&gt; On Jan 8, 2008, at 9:19 A=\r\nM, bruce halliday wrote:&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; Nick, =\r\nMy advice as a long time researcher is not to just turn the &lt;BR&gt;box on and =\r\nleave it running unless you intend to do a session and &lt;BR&gt;give your friend=\r\ns on the other side that are workingextremely hard to &lt;BR&gt;send you the comm=\r\nunication your undivided attention. It&#39;s kind of &lt;BR&gt;like calling someone o=\r\nn the phone and when they start a conversation &lt;BR&gt;you decide toput the pho=\r\nne down and focus your attention on other &lt;BR&gt;things. There are other resea=\r\nrchers that feel that there is nothing &lt;BR&gt;wrong with this practice and do =\r\nit on occasionBut I have come to the &lt;BR&gt;understanding that it is deemed di=\r\nsrespectful and while you may be &lt;BR&gt;listening with one ear as you do somet=\r\nhing else, you will hear a loud &lt;BR&gt;curse word or nasty statement, that is =\r\ntheir way of getting your &lt;BR&gt;attention back. I have gotten numerous messag=\r\nes about the difficulty &lt;BR&gt;of the attempts for them to communicate so when=\r\n I turn the box on it &lt;BR&gt;gets my full attention. just some experienced adv=\r\nice. As for them &lt;BR&gt;telling you to close the portal, it could have two mea=\r\nnings. &lt;BR&gt;Sometimes they refer to box thatis turned on and in use as a por=\r\ntal &lt;BR&gt;for the simple reason that each time we turn a box on to communicat=\r\ne &lt;BR&gt;it opens a direct open link between our realm and theirs so in &lt;BR&gt;es=\r\nsence it is an open door for anything to pass in or out. that is &lt;BR&gt;why wh=\r\nen I end a session I always ask my technician to bring back any &lt;BR&gt;spirits=\r\n that may have come through the portal during the session and &lt;BR&gt;I ask for=\r\n conformation and 10 times out of ten will get &quot;OK&quot; or &quot;OK &lt;BR&gt;THEY ARE BAC=\r\nK&quot; also they may have meant since you had the box running &lt;BR&gt;and where not=\r\n doing a actual session to shut the box so that they &lt;BR&gt;could go and not h=\r\nave to protect the open connection from any &lt;BR&gt;negative entities that wher=\r\ne able cross through the openportal. A few &lt;BR&gt;researchers have been receiv=\r\ning numerous messages about the number 7 &lt;BR&gt;within the past month. The onl=\r\ny known significance that the number 7 &lt;BR&gt;has in evp research is the 7 ent=\r\nities that controlled communication &lt;BR&gt;back in the eighties and ninetiesdu=\r\nring the spiricom and luxembourg &lt;BR&gt;era. To receive this number in message=\r\ns so often and by more than one &lt;BR&gt;researcher, odiouslyholds some importan=\r\nce which they have not been &lt;BR&gt;able or are not ready to convey. If you nee=\r\nd any help or have any &lt;BR&gt;questions please feel free to ask. Bruce&lt;BR&gt;&gt;=\r\n Bruce Halliday &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; To: EVP-ITC@...: thegreatwolf@&lt;W=\r\nBR&gt;...: Tue, 8 Jan 2008 06:27:07 -&lt;BR&gt;0500Subject: [EVP-ITC] Box in the mor=\r\nning&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; Hey,Anyone have any odd problems in the morn=\r\ning with using it. I am &lt;BR&gt;sitting here checking my email so i just though=\r\nt i&#39;d turn it on &lt;BR&gt;and... not check my email. Anywho.... Then right at ab=\r\nout 6:20 i &lt;BR&gt;heard a voice say &quot;Nicholas Etheridge please turn off the ds=\r\nfnlsd&quot; &lt;BR&gt;not quite sure what word it used... possibly portal. I just thou=\r\nght &lt;BR&gt;it was weird. Also under all of the jumble and this voice speaking =\r\ni &lt;BR&gt;heard a deep male voice almost chanting &quot;seven&quot;. Not sure if I &lt;BR&gt;ac=\r\ntually heard this or its the want to have an excuse to stay home &lt;BR&gt;and no=\r\nt take the HSAs.Anyway.&lt;WBR&gt;. just curious if anyone has gotten &lt;BR&gt;heard t=\r\nhis or if they know something I don&#39;t about using the box in &lt;BR&gt;the mornin=\r\ng.Peace,&lt;WBR&gt;Nick&lt;BR&gt;&gt; &lt;BR&gt;&gt; Get the power of Windows + Web with the =\r\nnew Windows Live. Get it &lt;BR&gt;now! &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&=\r\ngt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; ____________&lt;WBR&gt;_________&lt;WBR&gt;____=\r\n_____&lt;WBR&gt;_________&lt;WBR&gt;_________&lt;WBR&gt;_________&lt;WBR&gt;_&lt;BR&gt;&gt; Put your frie=\r\nnds on the big screen with Windows Vista=AE + Windows &lt;BR&gt;Live=99.&lt;BR&gt;&gt; =\r\n&lt;A href=3D&quot;http://www.microsoft.com/windows/shop/specialoffers.mspx?&quot; targe=\r\nt=3D_blank&gt;http://www.microsof&lt;WBR&gt;t.com/windows/&lt;WBR&gt;shop/specialoffe&lt;WBR&gt;=\r\nrs.mspx?&lt;/A&gt;&lt;BR&gt;ocid=3DTXT_TAGLM_&lt;WBR&gt;CPC_MediaCtr_&lt;WBR&gt;bigscreen_&lt;WBR&gt;0120=\r\n08&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;SPAN style=3D&quot;COLOR: white&quot;&gt;&lt;/SPAN&gt; \n&lt;STYLE&gt;\n.=\r\nExternalClass #EC_ygrp-mkp\n{border:1px solid #d8d8d8;font-family:Arial;padd=\r\ning:0px 14px;}\n.ExternalClass #EC_ygrp-mkp hr\n{border:1px solid #d8d8d8;}\n.=\r\nExternalClass #EC_ygrp-mkp #EC_hd\n{color:#628c2a;font-size:85%;font-weight:=\r\nbold;line-height:122%;}\n.ExternalClass #EC_ygrp-mkp #EC_ads\n{margin-bottom:=\r\n10px;}\n.ExternalClass #EC_ygrp-mkp .EC_ad\n{padding:0 0;}\n.ExternalClass #EC=\r\n_ygrp-mkp .EC_ad a\n{color:#0000ff;text-decoration:none;}\n\n&lt;/STYLE&gt;\n\n&lt;STYLE&gt;=\r\n\n.ExternalClass #EC_ygrp-sponsor #EC_ygrp-lc\n{font-family:Arial;}\n.External=\r\nClass #EC_ygrp-sponsor #EC_ygrp-lc #EC_hd\n{font-weight:bold;font-size:78%;l=\r\nine-height:122%;}\n.ExternalClass #EC_ygrp-sponsor #EC_ygrp-lc .EC_ad\n{margi=\r\nn-bottom:10px;padding:0 0;}\n\n&lt;/STYLE&gt;\n\n&lt;STYLE&gt;\n.ExternalClass #EC_ygrp-mlms=\r\ng\n{font-size:13px;font-family:arial,helvetica,clean,sans-serif;}\n.ExternalC=\r\nlass #EC_ygrp-mlmsg table\n{font-size:inherit;font:100%;}\n.ExternalClass #EC=\r\n_ygrp-mlmsg select, .ExternalClass input, .ExternalClass textarea\n{font:99%=\r\n arial,helvetica,clean,sans-serif;}\n.ExternalClass #EC_ygrp-mlmsg pre, .Ext=\r\nernalClass code\n{font:115% monospace;}\n.ExternalClass #EC_ygrp-mlmsg EC_*\n{=\r\nline-height:1.22em;}\n.ExternalClass #EC_ygrp-text\n{font-family:Georgia;}\n.E=\r\nxternalClass #EC_ygrp-text p\n{;}\n.ExternalClass #EC_ygrp-tpmsgs\n{font-famil=\r\ny:Arial;clear:both;}\n.ExternalClass #EC_ygrp-vitnav\n{padding-top:10px;font-=\r\nfamily:Verdana;font-size:77%;}\n.ExternalClass #EC_ygrp-vitnav a\n{padding:0 =\r\n1px;}\n.ExternalClass #EC_ygrp-actbar\n{clear:both;white-space:nowrap;color:#=\r\n666;text-align:right;}\n.ExternalClass #EC_ygrp-actbar .EC_left\n{float:left;=\r\nwhite-space:nowrap;}\n.ExternalClass .EC_bld\n{font-weight:bold;}\n.ExternalCl=\r\nass #EC_ygrp-grft\n{font-family:Verdana;font-size:77%;padding:15px 0;}\n.Exte=\r\nrnalClass #EC_ygrp-ft\n{font-family:verdana;font-size:77%;border-top:1px sol=\r\nid #666;padding:5px 0;}\n.ExternalClass #EC_ygrp-mlmsg #EC_logo\n{padding-bot=\r\ntom:10px;}\n.ExternalClass #EC_ygrp-vital\n{background-color:#e0ecee;margin-b=\r\nottom:20px;padding:2px 0 8px 8px;}\n.ExternalClass #EC_ygrp-vital #EC_vithd\n=\r\n{font-size:77%;font-family:Verdana;font-weight:bold;color:#333;text-transfo=\r\nrm:uppercase;}\n.ExternalClass #EC_ygrp-vital ul\n{padding:0;}\n.ExternalClass=\r\n #EC_ygrp-vital ul li\n{list-style-type:none;clear:both;border:1px solid #e0=\r\necee;}\n.ExternalClass #EC_ygrp-vital ul li .EC_ct\n{font-weight:bold;color:#=\r\nff7900;float:right;width:2em;text-align:right;padding-right:.5em;}\n.Externa=\r\nlClass #EC_ygrp-vital ul li .EC_cat\n{font-weight:bold;}\n.ExternalClass #EC_=\r\nygrp-vital a\n{text-decoration:none;}\n.ExternalClass #EC_ygrp-vital a:hover\n=\r\n{text-decoration:underline;}\n.ExternalClass #EC_ygrp-sponsor #EC_hd\n{color:=\r\n#999;font-size:77%;}\n.ExternalClass #EC_ygrp-sponsor #EC_ov\n{padding:6px 13=\r\npx;background-color:#e0ecee;margin-bottom:20px;}\n.ExternalClass #EC_ygrp-sp=\r\nonsor #EC_ov ul\n{padding:0 0 0 8px;}\n.ExternalClass #EC_ygrp-sponsor #EC_ov=\r\n li\n{list-style-type:square;padding:6px 0;font-size:77%;}\n.ExternalClass #E=\r\nC_ygrp-sponsor #EC_ov li a\n{text-decoration:none;font-size:130%;}\n.External=\r\nClass #EC_ygrp-sponsor #EC_nc\n{background-color:#eee;margin-bottom:20px;pad=\r\nding:0 8px;}\n.ExternalClass #EC_ygrp-sponsor .EC_ad\n{padding:8px 0;}\n.Exter=\r\nnalClass #EC_ygrp-sponsor .EC_ad #EC_hd1\n{font-family:Arial;font-weight:bol=\r\nd;color:#628c2a;font-size:100%;line-height:122%;}\n.ExternalClass #EC_ygrp-s=\r\nponsor .EC_ad a\n{text-decoration:none;}\n.ExternalClass #EC_ygrp-sponsor .EC=\r\n_ad a:hover\n{text-decoration:underline;}\n.ExternalClass #EC_ygrp-sponsor .E=\r\nC_ad p\n{;}\n.ExternalClass EC_o\n{font-size:0;}\n.ExternalClass .EC_MsoNormal\n=\r\n{;}\n.ExternalClass #EC_ygrp-text tt\n{font-size:120%;}\n.ExternalClass blockq=\r\nuote\n{;}\n.ExternalClass .EC_replbq\n{;}\n\n&lt;/STYLE&gt;\n&lt;/BLOCKQUOTE&gt;&lt;br /&gt;&lt;hr /&gt;M=\r\nake distant family not so distant with Windows Vista=AE + Windows Live=99. =\r\n&lt;a href=3D&#39;http://www.microsoft.com/windows/digitallife/keepintouch.mspx?oc=\r\nid=3DTXT_TAGLM_CPC_VideoChat_distantfamily_012008&#39; target=3D&#39;_new&#39;&gt;Start no=\r\nw!&lt;/a&gt;&lt;/body&gt;\n&lt;/html&gt;\r\n--_8c435104-130d-4098-828e-50a4f5950fbc_--"}