{"id": "5184", "subject": "Re: [EVP-ITC] Sarah Estep: Rest in Peace", "author": "Lisby", "timestamp": "2008-01-10T00:59:13Z", "full_text": "Thank you, Rosemary. I wish I had been there.\n\nAnn\n\nOn Jan 8, 2008, at 7:49 PM, rosemary_guiley wrote:\n\n&gt; Today I attended the funeral and burial of a great lady: Sarah Estep,\n&gt; the founder of the American Association of Electronic Voice Phenomena.\n&gt; Sarah died on January 3, of kidney failure, following a two-week\n&gt; illness. She was 81.\n&gt;\n&gt; Everyone who has ever done EVP for investigations, research or\n&gt; personal study owes Sarah a huge debt. She has left behind a\n&gt; phenomenal legacy: the AA-EVP, an international research organization\n&gt; she established in 1982; a classification of voices; a library of\n&gt; thousands of recordings she herself made over the years; and\n&gt; inspiration and passion that have fueled countless researchers.\n&gt;\n&gt; I became friends with Sarah several years ago, when I lived a few\n&gt; miles from her home in Annapolis, Maryland. She was warm, witty and\n&gt; wonderful company, and she generously let me listen to many of her EVP\n&gt; recordings, and even experiment with her original reel-to-reel setup.\n&gt; She possessed a great store of knowledge, and a zest for\n&gt; investigating the unknown, especially the afterlife and survival.\n&gt;\n&gt; Things come full circle in remarkable ways. The casket that now\n&gt; serves as the final resting place of Sarah&#39;s physical form was also\n&gt; the beginning of her remarkable study of the afterlife. As a child,\n&gt; she once sneaked peeks into caskets at the funeral parlor owned by her\n&gt; grandparents in Altoona, Pennsylvania. It seemed obvious to her that\n&gt; death was an end, final.\n&gt;\n&gt; Later in life, she undertook EVP experiments to prove to herself that\n&gt; there is no survival after death. Night after night she recorded\n&gt; without results. Just as she was about to give up, she recorded a\n&gt; clear female voice that said, &quot;Our world is one of beauty.&quot; She was a\n&gt; believer.\n&gt;\n&gt; One of her most remarkable EVPs was, &quot;Death no more a casket.&quot;\n&gt;\n&gt; Sarah is now on the Other Side, discovering wonders that we here on\n&gt; this side only glimpse. Undoubtedly we will hear much from her –\n&gt; she&#39;s quite determined when she sets her mind to a task.\n&gt;\n&gt; The service for Sarah was lovely, and daughter Becky gave a moving\n&gt; eulogy. Three white doves were released at graveside in Annapolis.\n&gt; Among those attending were Tom and Lisa Butler, who have led the AAEVP\n&gt; at its Reno headquarters since 2000, and Richard Shenk, a longtime\n&gt; AA-EVP member and researcher from Delaware.\n&gt;\n&gt; Sarah&#39;s last public appearance was in 2006, at the AA-EVP conference\n&gt; in Atlanta. She delivered a marvelous speech on her career in EVP,\n&gt; and was recognized with a lifetime achievement award.\n&gt;\n&gt; The AA-EVP is establishing a memorial fund in Sarah&#39;s name to help\n&gt; continue research. Contributions may be made to the AAEVP, PO Box\n&gt; 1311, Reno, NV 89507.\n&gt;\n&gt; My article on Sarah, her life and research (FATE Magazine, December\n&gt; 2004), is posted on my website at\n&gt; http://www.visionaryliving.com/articles/estep.php.\n&gt; ###\n&gt;\n&gt;\n&gt; \n\n\nThank you, Rosema y. I wish I had been he e.AnnOn Jan 8, 2008, a 7:49 PM, osema y_guiley w o e:Today I a ended he une al and bu ial o a g ea lady: Sa ah Es ep, he ounde o he Ame ican Associa ion o Elec onic Voice Phenomena.Sa ah died on Janua y 3, o kidney ailu e, ollowing a wo-weekillness. She was 81.E e yone who has e e done EVP o in es iga ions, esea ch o pe sonal s udy owes Sa ah a huge deb . She has le behind aphenomenal legacy: he AA-EVP, an in e na ional esea ch o ganiza ionshe es ablished in 1982; a classi ica ion o oices; a lib a y o housands o eco dings she he sel made o e he yea s; andinspi a ion and passion ha ha e ueled coun less esea che s.I became iends wi h Sa ah se e al yea s ago, when I li ed a ewmiles om he home in Annapolis, Ma yland. She was wa m, wi y andwonde ul company, and she gene ously le me lis en o many o he EVP eco dings, and e en expe imen wi h he o iginal eel- o- eel se up.She possessed a g ea s o e o knowledge, and a zes o in es iga ing he unknown, especially he a e li e and su i al.Things come ull ci cle in ema kable ways. The caske ha nowse es as he inal es ing place o Sa ah's physical o m was also he beginning o he ema kable s udy o he a e li e. As a child,she once sneaked peeks in o caske s a he une al pa lo owned by he g andpa en s in Al oona, Pennsyl ania. I seemed ob ious o he ha dea h was an end, inal.La e in li e, she unde ook EVP expe imen s o p o e o he sel ha he e is no su i al a e dea h. Nigh a e nigh she eco dedwi hou esul s. Jus as she was abou o gi e up, she eco ded aclea emale oice ha said, \"Ou wo ld is one o beau y.\" She was abelie e .One o he mos ema kable EVPs was, \"Dea h no mo e a caske .\"Sa ah is now on he O he Side, disco e ing wonde s ha we he e on his side only glimpse. Undoub edly we will hea much om he –she's qui e de e mined when she se s he mind o a ask.The se ice o Sa ah was lo ely, and daugh e Becky ga e a mo ingeulogy. Th ee whi e do es we e eleased a g a eside in Annapolis. Among hose a ending we e Tom and Lisa Bu le , who ha e led he AAEVPa i s Reno headqua e s since 2000, and Richa d Shenk, a long imeAA-EVP membe and esea che om Delawa e.Sa ah's las public appea ance was in 2006, a he AA-EVP con e encein A lan a. She deli e ed a ma elous speech on he ca ee in EVP,and was ecognized wi h a li e ime achie emen awa d.The AA-EVP is es ablishing a memo ial und in Sa ah's name o helpcon inue esea ch. Con ibu ions may be made o he AAEVP, PO Box1311, Reno, NV 89507.My a icle on Sa ah, he li e and esea ch (FATE Magazine, Decembe 2004), is pos ed on my websi e a h p://www. isiona yli ing.com/a icles/es ep.php.###"}