{"id": "521", "subject": "virus warning", "author": "LON3_S7AR", "timestamp": "2006-08-10T13:28:54Z", "full_text": "--0-1498836814-1155216534=:6440\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nSubject: PLEASE INFORM EVERYONE \n\n\nEmails with pictures of Osama Bin-Laden hanged are being sent and the moment\nthat you open these Emails your computer will crash and you will not be able\nto fix it! If you get an email along the lines of &quot;Osama Bin Laden Captured&quot;\nor &quot;Osama Hanged&quot; don&#39;t open the attachment. This e-mail is being\ndistributed through countries around the globe, but mainly in the US and\nIsrael. Be considerate & send this warning to whomever you know. PLEASE\nFORWARD THIS WARNING AMONG FRIENDS, FAMILY AND CONTACTS: You should be alert\nduring the next days: Do not open any message with an attached filed called \nInvitation&quot; regardless of who sent it. It is a virus that opens an Olympic\nTorch which &quot;burns&quot; the whole hard disc C of your computer. This virus will\nbe received from someone who has your e-mail address in his/her contact list\nthat is why you should send this e-mail to all your contacts. It is better\nto receive this message 25 times than to receive the virus and open it. If\nyou receive a mail called &quot;invitaton&quot;, though sent by a friend, do not open\nit and shut down your computer immediately. This is the worst virus\nannounced by CNN, it has been classified by Microsoft as the most\ndestructive virus ever. This virus was discovered by McAfee yesterday, and\nthere is no repair yet for this kind of virus. This virus simply destroys\nthe Zero Sector of the Hard Disc, where the vital information is kept. \n\n\nJoin a yahoo group today! \n  OWNER           http://groups.yahoo.com/group/EVPSANANTONIO/\n  CO-OWNER     http://groups.yahoo.com/group/EVP-ITC/\n   \n  www.myspace.com/lon3_s7ar\n\n \t\t\n---------------------------------\n Open multiple messages at once with the all new Yahoo! Mail Beta. \r\n--0-1498836814-1155216534=:6440\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nSubject: PLEASE INFORM EVERYONE &lt;BR&gt;&lt;BR&gt;&lt;BR&gt;Emails with pictures of Osama Bin-Laden hanged are being sent and the moment&lt;BR&gt;that you open these Emails your computer will crash and you will not be able&lt;BR&gt;to fix it! If you get an email along the lines of &quot;Osama Bin Laden Captured&quot;&lt;BR&gt;or &quot;Osama Hanged&quot; don&#39;t open the attachment. This e-mail is being&lt;BR&gt;distributed through countries around the globe, but mainly in the US and&lt;BR&gt;Israel. Be considerate &amp; send this warning to whomever you know. PLEASE&lt;BR&gt;FORWARD THIS WARNING AMONG FRIENDS, FAMILY AND CONTACTS: You should be alert&lt;BR&gt;during the next days: Do not open any message with an attached filed called &lt;BR&gt;Invitation&quot; regardless of who sent it. It is a virus that opens an Olympic&lt;BR&gt;Torch which &quot;burns&quot; the whole hard disc C of your computer. This virus will&lt;BR&gt;be received from someone who has your e-mail address in his/her contact list&lt;BR&gt;that is why you should send this e-mail to all your contacts. It is better&lt;BR&gt;to\n receive this message 25 times than to receive the virus and open it. If&lt;BR&gt;you receive a mail called &quot;invitaton&quot;, though sent by a friend, do not open&lt;BR&gt;it and shut down your computer immediately. This is the worst virus&lt;BR&gt;announced by CNN, it has been classified by Microsoft as the most&lt;BR&gt;destructive virus ever. This virus was discovered by McAfee yesterday, and&lt;BR&gt;there is no repair yet for this kind of virus. This virus simply destroys&lt;BR&gt;the Zero Sector of the Hard Disc, where the vital information is kept. &lt;BR&gt;&lt;BR&gt;&lt;BR&gt;&lt;DIV&gt;&lt;FONT face=system color=#0000ff size=4&gt;&lt;STRONG&gt;Join a yahoo group today! &lt;/STRONG&gt;&lt;/FONT&gt;&lt;/DIV&gt;  &lt;DIV&gt;&lt;FONT color=#0080ff&gt;OWNER&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&lt;/FONT&gt;&lt;A href=&quot;http://groups.yahoo.com/group/EVPSANANTONIO/&quot;&gt;&lt;STRONG&gt;&lt;FONT face=system color=#0080ff size=4&gt;http://groups.yahoo.com/group/EVPSANANTONIO/&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/A&gt;&lt;/DIV&gt;  &lt;DIV&gt;&lt;FONT color=#0000bf&gt;CO-OWNER&nbsp;&nbsp;&nbsp;&nbsp; &lt;/FONT&gt;&lt;A\n href=&quot;http://groups.yahoo.com/group/EVP-ITC/&quot;&gt;&lt;FONT face=verdana color=#0000bf&gt;&lt;STRONG&gt;http://groups.yahoo.com/group/EVP-ITC/&lt;/STRONG&gt;&lt;/FONT&gt;&lt;/A&gt;&lt;/DIV&gt;  &lt;DIV&gt;&lt;FONT color=#0000bf&gt;&lt;STRONG&gt;&lt;/STRONG&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;&lt;FONT color=#0000bf&gt;&lt;STRONG&gt;&lt;A href=&quot;http://www.myspace.com/lon3_s7ar&quot;&gt;www.myspace.com/lon3_s7ar&lt;/A&gt;&lt;/STRONG&gt;&lt;/FONT&gt;&lt;/DIV&gt;&lt;p&gt;&#32;\n\t\t&lt;hr size=1&gt; Open multiple messages at once with the &lt;a href=&quot;http://us.rd.yahoo.com/evt=40787/*http://advision.webevents.yahoo.com/handraisers&quot;&gt;all new Yahoo! Mail Beta.&lt;/a&gt; \r\n--0-1498836814-1155216534=:6440--"}