{"id": "5210", "subject": "Re: Sarah Estep: Rest in Peace", "author": "misujoey", "timestamp": "2008-01-10T18:31:44Z", "full_text": "Hi Rosemary,  That was beautiful!  Debbie\n\n--- In EVP-ITC@yahoogroups.com, Lisby &lt;lisby@...&gt; wrote:\n&gt;\n&gt; Thank you, Rosemary. I wish I had been there.\n&gt; \n&gt; Ann\n&gt; \n&gt; On Jan 8, 2008, at 7:49 PM, rosemary_guiley wrote:\n&gt; \n&gt; &gt; Today I attended the funeral and burial of a great lady: Sarah \nEstep,\n&gt; &gt; the founder of the American Association of Electronic Voice \nPhenomena.\n&gt; &gt; Sarah died on January 3, of kidney failure, following a two-week\n&gt; &gt; illness. She was 81.\n&gt; &gt;\n&gt; &gt; Everyone who has ever done EVP for investigations, research or\n&gt; &gt; personal study owes Sarah a huge debt. She has left behind a\n&gt; &gt; phenomenal legacy: the AA-EVP, an international research \norganization\n&gt; &gt; she established in 1982; a classification of voices; a library of\n&gt; &gt; thousands of recordings she herself made over the years; and\n&gt; &gt; inspiration and passion that have fueled countless researchers.\n&gt; &gt;\n&gt; &gt; I became friends with Sarah several years ago, when I lived a few\n&gt; &gt; miles from her home in Annapolis, Maryland. She was warm, witty \nand\n&gt; &gt; wonderful company, and she generously let me listen to many of \nher EVP\n&gt; &gt; recordings, and even experiment with her original reel-to-reel \nsetup.\n&gt; &gt; She possessed a great store of knowledge, and a zest for\n&gt; &gt; investigating the unknown, especially the afterlife and survival.\n&gt; &gt;\n&gt; &gt; Things come full circle in remarkable ways. The casket that now\n&gt; &gt; serves as the final resting place of Sarah&#39;s physical form was \nalso\n&gt; &gt; the beginning of her remarkable study of the afterlife. As a \nchild,\n&gt; &gt; she once sneaked peeks into caskets at the funeral parlor owned \nby her\n&gt; &gt; grandparents in Altoona, Pennsylvania. It seemed obvious to her \nthat\n&gt; &gt; death was an end, final.\n&gt; &gt;\n&gt; &gt; Later in life, she undertook EVP experiments to prove to herself \nthat\n&gt; &gt; there is no survival after death. Night after night she recorded\n&gt; &gt; without results. Just as she was about to give up, she recorded a\n&gt; &gt; clear female voice that said, &quot;Our world is one of beauty.&quot; She \nwas a\n&gt; &gt; believer.\n&gt; &gt;\n&gt; &gt; One of her most remarkable EVPs was, &quot;Death no more a casket.&quot;\n&gt; &gt;\n&gt; &gt; Sarah is now on the Other Side, discovering wonders that we here \non\n&gt; &gt; this side only glimpse. Undoubtedly we will hear much from her \n&gt; &gt; she&#39;s quite determined when she sets her mind to a task.\n&gt; &gt;\n&gt; &gt; The service for Sarah was lovely, and daughter Becky gave a moving\n&gt; &gt; eulogy. Three white doves were released at graveside in Annapolis.\n&gt; &gt; Among those attending were Tom and Lisa Butler, who have led the \nAAEVP\n&gt; &gt; at its Reno headquarters since 2000, and Richard Shenk, a longtime\n&gt; &gt; AA-EVP member and researcher from Delaware.\n&gt; &gt;\n&gt; &gt; Sarah&#39;s last public appearance was in 2006, at the AA-EVP \nconference\n&gt; &gt; in Atlanta. She delivered a marvelous speech on her career in EVP,\n&gt; &gt; and was recognized with a lifetime achievement award.\n&gt; &gt;\n&gt; &gt; The AA-EVP is establishing a memorial fund in Sarah&#39;s name to help\n&gt; &gt; continue research. Contributions may be made to the AAEVP, PO Box\n&gt; &gt; 1311, Reno, NV 89507.\n&gt; &gt;\n&gt; &gt; My article on Sarah, her life and research (FATE Magazine, \nDecember\n&gt; &gt; 2004), is posted on my website at\n&gt; &gt; http://www.visionaryliving.com/articles/estep.php.\n&gt; &gt; ###\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt;"}