{"id": "5211", "subject": "Re: the unlabeled files_results", "author": "psi_research", "timestamp": "2008-01-10T19:41:35Z", "full_text": "I must have missed the announced beginning of the experiment. Between\ntravel and getting over 100 new emails per day it must have slipped\nby. I often don&#39;t get to hear the posted recordings until several days\nafter they are posted and that&#39;s assuming they are still on the mail\nserver.\n\nIf there is a set date when new unlabeled files will be posted I&#39;ll\nset my calender and specifically download and listen in a timely\nmatter then post what I hear. Hopefully this would be after the 20th\nof this month.  -Bill \n\n--- In EVP-ITC@yahoogroups.com, Ron Lederer &lt;ronriko@...&gt; wrote:\n&gt;\n&gt; Hi Bruce   Glad I got 3 out of 4 words in the first test.  Maybe a\ncontest is needed with prize money...just kidding.  \n&gt;    \n&gt;   I want to ask you about voice recognition systems that you and\nothers are doing but I will put that into a separate email.   Thanks\nfor the opportunity to guess.  I hope to get better at it.   Ron L\n&gt; \n&gt; bhali333 &lt;paranormalinvestigating@...&gt; wrote:\n&gt;           Hey guy&#39;s \n&gt; \n&gt; The unlabeled files experiment was a resounding flop!\n&gt; \n&gt; Only a hand full of members responded with what they did or did not \n&gt; hear.\n&gt; \n&gt; This is how I heard them\n&gt; #4_There are three circles\n&gt; \n&gt; #8_David&#39;s just their guard\n&gt; \n&gt; The percentage of people that responded that they heard what I had heard\n&gt; was about 40% the individuals that heard some of what I heard but not \n&gt; all was about 30% with the remaining 30% hearing something completely \n&gt; different.\n&gt; \n&gt; This type of experiment needs to be done on a regular basis with a \n&gt; substantial ammount of participents, otherwise the averages can not be \n&gt; calculated and a general theory formed that is acceptable to most \n&gt; researchers in this field.\n&gt; \n&gt; If there is anyone else that would like to have a go at it I will be \n&gt; glad to participate.\n&gt; \n&gt; Bruce\n&gt; \n&gt; \n&gt; \n&gt;                          \n&gt; \n&gt;        \n&gt; ---------------------------------\n&gt; Never miss a thing.   Make Yahoo your homepage.\n&gt;"}