{"id": "5222", "subject": "Re: Voice Recognition techniques", "author": "psi_research", "timestamp": "2008-01-10T21:13:51Z", "full_text": "There are several application for voice recognition (VR). Most cel\nphones can be trained to recognize voice prints from your spoken word\nwhich creates a pattern. Microsoft&#39;s Vista OS has voice recognition\nincluded for free so basic functions (open file, view, play, save, and\nso on) can be done with a mic and your voice. It can be integrated\ninto Word so you can speak and a letter can be composed. But this type\nof VR just uses a stored voice pattern and can adapted to identify the\n person who was recorded assuming there is a known sample of the\npersons voice that can be referenced. VR software of this type is\nusually priced between $100 to $200 if it&#39;s not included for free with\nanother software bundle.\n\nAnother type of VR is used for voice stress analysis. One of the more\npopular ones is Truster. You can buy this as software or as portable\nhardware piece that has an audio in jack. It measures the inflections\nthat usually indicate the stress of attempted deception. It goes for\naround $95.\n\nIn evp&#39;s it&#39;s more a matter of isolating the frequency of the sound as\nby their very nature evp&#39;s are inaudible. The audio sampling software\nI have seen allow you to easily display the frequency range. The\nvoiced speech of a typical adult male with have an average frequency\nof from 85 to 155 Hz, and that of a typical adult female from 165 to\n255 Hz. Humans can hear sounds at frequencies between 20Hz to\n20,000Hz. Evp&#39;s are usually in the very low range, below what most of\ncan hear even if they are above 20Hz.\n\nFor Box recordings, we&#39;ll have to be creative. With the rapid audio\nshifts it would be a challenge but I like the idea of further\nanalyzing the recordings. -Bill\n\n--- In EVP-ITC@yahoogroups.com, bruce halliday\n&lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; \n&gt; Ron,\n&gt;  \n&gt; I have not heard of any voice recognition systems that would enable\nyou to recognise\n&gt; a recorded evp from a box or traditional.\n&gt; I believe the simple reason being that evp&#39;s that come from any type\nof box we use today run on the same\n&gt; principle, the words are created by the entities using random bits\nof radio signal or pieces of radio chatter \n&gt; that is being scanned by the box.\n&gt;  \n&gt; Traditional evp is based on the theory that the spirit leaving the\nmessage uses the ambient energy in the surrounding area\n&gt; and manipulates it into words that are captured by the recorder.\n&gt;  \n&gt; both of these methods are very monotone is essence the box replies\nare made up of different word fragments and not fluid enough.\n&gt; The traditional evp message sounds very whispered or pitchy and is\nfilled with white noise and recorder static.\n&gt;  \n&gt; The voice recognition software being used today is like misty said\nvery expensive and is designed to recognise the inflections in human\nspeech\n&gt; it is mainly used by forensic labs to determine if two speech\npatterns are the same.\n&gt;  \n&gt; My opinion is that the software would not be capable of detecting\nevp messages, I have not personally tried it but had the idea many\nmoons ago\n&gt; and researched the possibility.\n&gt;  \n&gt; Bruce\n&gt; Bruce Halliday \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: bulletbabea@...: Thu, 10 Jan 2008 10:10:43\n-0800Subject: Re: [EVP-ITC] Voice Recognition techniques\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Theres some great software out there. Problem is the really good\nones have big price tags. Id have to use them before I could comment\non them. Clear Voice Denoiser works pretty well for me and what I do.\nIve been using it almost from the start along with the p1 filter for\nall my water sessions. It&#39;s become part of my standard practice. The\np1 helps bring the voices out without destroying the other noise.. or\nit can destroy most of the noise, its up to you and your settings.\nClear voice free demo works on all clips under 30 seconds which is\nfine for most evp work. I liked the program enough I bought it to\nsupport thier work. \n&gt;  \n&gt; Heres one from last night, may hear her maybe not. LOL but at least\nya can see the before and after results of filtered or unfiltered and\nhow CV raises the voice level. It works especially well for the -74\nspeed voices, gives them a giant boost in tone levels. Not so whispery.\n&gt;  \n&gt; This one is just normal speed, as recorded.\n&gt;  \n&gt; Misty\n&gt;  \n&gt; Ron Lederer &lt;ronriko@...&gt; wrote:\n&gt; \n&gt; \n&gt; \n&gt; Bruce&#39;s test with unlabeled messages brings up a question I have\nabout howEVP-ITC@ yahoogroups.com to better decipher what is being\nsaid on the other side (particularly for those of us who can&#39;t hear\ntoo well).  Is there a computer Voice Recognition system that can be used.\n&gt;  \n&gt; On this subject, I recently saw a video on  AOL about a secret\nsentence that actor Bill Murray mumbled at the very end of a\nmovie...don&#39;t recall the name of the movie.  Technicians somehow\nprocessed the sound to make the message VERY clear and precise.  Even\nI could understand the sentence.   In the program you could hear the\nstepped improvements of the signal till it was stepped up to the point\nof clarity.  Would that be possible or even useful for EVPs??  If so,\nhow could I do that?????   Ron L\n&gt; \n&gt; \n&gt; Be a better friend, newshound, and know-it-all with Yahoo! Mobile.\nTry it now. \n&gt; \n&gt;  \n&gt; \n&gt; \n&gt; Never miss a thing. Make Yahoo your homepage. \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Watch &quot;Cause Effect,&quot; a show about real people making a real difference.\n&gt; http://im.live.com/Messenger/IM/MTV/?source=text_watchcause\n&gt;"}