{"id": "5248", "subject": "Re: for those that are signaly challenged", "author": "Frank Sumption", "timestamp": "2008-01-11T05:27:01Z", "full_text": "There&#39;s afew things you can build very cheap to improve AM reception, \nlook up AM loops on the web for simple, and cheap antennas. \n\n Frank-S\n\n\n --- In EVP-ITC@yahoogroups.com, Ron Lederer &lt;ronriko@...&gt; wrote:\n&gt;\n&gt; Wow, what a testimony in deed.  When I get to the U.S. I will buy \none.   Ron L\n&gt; \n&gt; bhali333 &lt;paranormalinvestigating@...&gt; wrote:          I purchased \nan am coil antenna from ebay called a &quot;select-a-tenna&quot;\n&gt; \n&gt; It works by puting it in proximity to a radio or in our case a box \n&gt; and turning a tuning dial until the signal gets stronger.\n&gt; \n&gt; It does not run on ac or batteries and does not hook up to the \nradio \n&gt; in any way. So I&#39;m figuring how is this thing going to be any good, \nI \n&gt; get sucjh a crappy am signal that I was willing to try anything and \n&gt; have.\n&gt; \n&gt; Well I recieved this antenna this morning and decided to take it to \na \n&gt; part of the house where I have never gotten a signal, my basement.\n&gt; \n&gt; I turned on the 470 and as usual nothing but static, so I placed \nthis \n&gt; disc looking antenna about 8 inches from the 470 and started to \nturn \n&gt; the knob on the antenna. I was asking mike and lisa if they could \nto \n&gt; please come through. as I was turning this dial I began to hear the \n&gt; rs sweep the stations and mike said &quot;here&quot; I almost jumped out of \nthe \n&gt; chair with excitement. I asked mike or lisa to tell me when the \ndial \n&gt; was right and as I slowly turned it mike yelled &quot;STOP&quot; after a few \n&gt; minutes of small talk I ended the session with lisa saying &quot;it&#39;s \ngood&quot;\n&gt; \n&gt; That is testimony enough for me!\n&gt; \n&gt; anyone that has even a slight problem with your am reception which \nI \n&gt; consider to be the best band to use. you have to get one of these.\n&gt; \n&gt; Just go to ebay and search SELECT-A-TENNA it cost me 52.00 with \n&gt; delivery. to me it&#39;s priceless.\n&gt; \n&gt; Bruce\n&gt; \n&gt; \n&gt; \n&gt;                          \n&gt; \n&gt;        \n&gt; ---------------------------------\n&gt; Never miss a thing.   Make Yahoo your homepage.\n&gt;"}