{"id": "5281", "subject": "Re: New Box Research Log Sheet Posted", "author": "mllejade", "timestamp": "2008-01-11T16:32:23Z", "full_text": "Thanks for explanation, Juli -- Because I&#39;m relatively new to boxes, \nI&#39;m not quite up to speed on the terminology.  I&#39;ve copied your log \nsheet and will re-name &quot;Research Conducting Session&quot; to &quot;Group \nSession&quot; on my log sheet.\n\nSharon\n\n--- In EVP-ITC@yahoogroups.com, juli velazquez &lt;ghostchasingfool@...&gt; \nwrote:\n&gt;\n&gt; Thanks Sharon!\n&gt;                              I labled the Research Conducting \nSession for those who are doing sessions via Skype, or dual persons \nvia different locations.  Sometimes me and Joel do sessions together \nor by ourselves.  I know Bruce and Steve also conduct dual sessions.  \nI can change the title if it is confusing.  I was hoping that once we \ndedcide to conduct various sessions on the same day and time would \ncould name them accordingly such as Research Project_____/ (example) \nConducted by:__________.\n&gt;    \n&gt;                             I hope this helps!\n&gt;    \n&gt;   Thanks!\n&gt;   Juli\n&gt; \n&gt; \n&gt; mllejade &lt;leongbabe@...&gt; wrote:\n&gt;           Thanks for sharing your log sheet Juli. It&#39;s quite \ncomplete; the \n&gt; only thing I might add is the mood/state of mind of the researcher. \n&gt; Also, what do you mean by Research Conducting Session?\n&gt; \n&gt; Thanks again,\n&gt; Sharon\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Jules&quot; &lt;ghostchasingfool@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hi Everyone!\n&gt; &gt; \n&gt; &gt; I just uploaded a Box Research Log Sheet to our \n&gt; files. \n&gt; &gt; There are 2 there, one in PDF Format and the other in Word. \n&gt; &gt; \n&gt; &gt; When I conduct a session I use this sheet to log \n&gt; &gt; important information and questions I will be asking during the \n&gt; session \n&gt; &gt; and after. Feel free to use it.\n&gt; &gt; \n&gt; &gt; In addition, if you think there should be any \n&gt; &gt; additional items added, please let me know.\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; Thanks!\n&gt; &gt; Juli\n&gt; &gt;\n&gt; \n&gt; \n&gt; \n&gt;                          \n&gt; \n&gt; \n&gt;   The contents of this eletronic correspondence is private & \nconfidential and meant only for the party and/or parties it is \naddressed to.  \n&gt;    \n&gt;   No part of this email transmission may be publicly posted or \nforwarded to other parties without explicit written permission.\n&gt;"}