{"id": "5304", "subject": "Re: Too wierd--and perhaps frightening.", "author": "Frank Sumption", "timestamp": "2008-01-11T23:27:57Z", "full_text": "I don&#39;t know, but I think the short wave adds a new demension to \nthis demensia.\n\n Frank-S\n\n\n--- In EVP-ITC@yahoogroups.com, bruce halliday \n&lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; \n&gt; Frank,\n&gt;  \n&gt; Very clear files.\n&gt;  \n&gt; In my opinion you picked up a conversation between two entities that\n&gt; did not realise they where being heard. The last segment &quot;we should \nnot be doing this&quot;\n&gt; I think reffers to them talking about particular subjects where \nthey may be heard by us\n&gt; like maybe one of their communication stations.\n&gt;  \n&gt; something to think about!\n&gt;  \n&gt; bruce\n&gt; Bruce Halliday \n&gt; \n&gt; \n&gt; To: evp-itc@...: franks-boxes@...: Fri, 11 Jan 2008 08:08:51 -\n0700Subject: [EVP-ITC] Too wierd--and perhaps frightening.\n&gt; \n&gt; \n&gt; \n&gt; \n&gt;  This is weird, that mono tone voice coming through. This is what I \nget out of the segments I put up last night.  I wanted to see what \nothers heard, as while recording all I heard was the usual shortwave \nstations, and noise. A few English stations, some Spanish, and \nsomething that sounded maybe Korean.   One of my co-workers thinks it \nhe CIA messing with me, they just want to see what tunrs up on the \nnet.   Awhhh crap, there&#39;s only one way to go to be scientific, I&#39;ll \nhave to make another and see if it gets the same stuff for someone \nelse.   My apologies to those waiting for previous projects and e-\nmail replies, I tend to get side tracked with this stuff.   Frank-S\n&gt; \n&gt; Make distant family not so distant with Windows Vista + Windows \nLive. Start now! \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Share life as it happens with the new Windows Live.\n&gt; http://www.windowslive.com/share.html?\nocid=TXT_TAGHM_Wave2_sharelife_012008\n&gt;"}