{"id": "534", "subject": "Re: Im hearing something similar to Branden again", "author": "suwright2000", "timestamp": "2006-08-12T00:37:00Z", "full_text": "Where is this conversation posted? I would like to hear it.\n\n--- In EVP-ITC@yahoogroups.com, LON3_S7AR &lt;lon3_s7ar@...&gt; wrote:\n&gt;\n&gt; Misty,\n&gt;   here is a copy n pasted from a chat i just had with a meduim i\nknow, that lives near me. I started asking him if in a wild card draw\nhe knew sonja or brandon\n&gt;    \n&gt;   than he started this\nconversation................................................\n&gt;    \n&gt;    \n&gt;   ayinainsoph: anaka the sage: yes i know his name is bran-den\n&gt; anaka the sage: thats how i heard it when you posted it\n&gt; Amy Swanson: yes\n&gt; Amy Swanson: what else\n&gt; ayinainsoph: sounds like a kid\n&gt; Amy Swanson: ok\n&gt; ayinainsoph: a kid crying\n&gt; ayinainsoph: i want to go to the next meetup\n&gt; Amy Swanson: anything on the locationa nd name of his mom\n&gt; ayinainsoph: keep me posted\n&gt; ayinainsoph: so it is a kid?\n&gt; Amy Swanson: i think thier meeting tonight\n&gt; Amy Swanson: i think it is\n&gt; Amy Swanson: this doesnt have anythingto do with meetup\n&gt; ayinainsoph: i dont know where he is or was\n&gt; ayinainsoph: i know\n&gt; Amy Swanson: ok\n&gt; ayinainsoph: but saying that i want to go to the next one\n&gt; ayinainsoph: i do hear him\n&gt; ayinainsoph: and i can hear his mother calling him bran-den come here\n&gt; Amy Swanson: can you try to concentrate and talk to him\n&gt; ayinainsoph: no its an echo\n&gt; Amy Swanson: ok\n&gt; ayinainsoph: cant talk to those\n&gt; Amy Swanson: ok\n&gt; Amy Swanson: only what you get then \n&gt; ayinainsoph: talking to walls\n&gt; Amy Swanson: yes\n&gt; ayinainsoph: but thats all i get\n&gt; Amy Swanson: okay ty\n&gt; ayinainsoph: him crying\n&gt; ayinainsoph: but also her calling him by his name\n&gt; ayinainsoph: its weird\n&gt; Amy Swanson: does it sound like regular english\n&gt; Amy Swanson: or accent?\n&gt; ayinainsoph: its english\n&gt; ayinainsoph: but has an accent to it\n&gt; ayinainsoph: when the mom talked\n&gt; Amy Swanson: ok\n&gt; \n&gt; LON3_S7AR &lt;lon3_s7ar@...&gt; wrote:\n&gt;             the only one im getting anything is the mom im in a\nbetter mood, but have you played that in reverse? im working on that\nnow, and i can here something? &lt;im going? &gt; i dont know yet, but soon\nafter i started listenning to these, i started getting &quot;chills&quot;\n&gt;    \n&gt;   amy\n&gt; \n&gt; Misty Dawn &lt;bulletbabea@...&gt; wrote:\n&gt;         I am sorry but I dont know/remember who hes here for. Might\nbe someone from the other group. I had these messages come through\nbefore listening to others recordings when I was a member there and I\ncant remember who it was but it was important to someone off the board\nat the time. But his name wasnt exactly Brandon it was something that\nsounds similar but I hear it as &quot;Bran-den&quot; while they hear it\ndifferently. So I am posting this here hoping it finds its way to his\nmother as well as forwarding this to anyone I think may remember. The\npart about a guest today for sumption makes me think its someone in\nthis group but this group wasnt here when I had heard it last time. I\ndont know.\n&gt;    \n&gt;   I had a &quot;pop in&quot; from them during a session the other night but\nwith all the drama things have been fuzzier so today I decided to use\na newer method and I keep getting mom messages. I dont have any\nchildren so something tells me Brandon and his friend are back to let\nthier moms know they are around.\n&gt;    \n&gt;   Some of these are very hard to hear and I&#39;d apologize if there was\nanything I could do about it but theres not so if nothing else take\nthe message from the filename and leave it at that. Perhaps others\nwill hear more than my ears do. It&#39;s always hard to say if anyone can\nhear the fuzzy ones.\n&gt;    \n&gt;   Some of the new session are clearer. Hopefully its a good sign\nthat communication will improve soon. Its a method that only recently\nstarted working even tho they had me trying it for months with no\nresults... so I dont use it often. \n&gt;    \n&gt;   They were bugging me to contact Sonia Rinaldi again, but I still\nhave no clue how to do that. At least this time I know shes a real\nperson LOL. They want us to share methods/contacts. I been gettin\nthose messages for like almost a year now and I havent bumped into her\nyet so I can only assume maybe the opportunity will present itself in\nthe future. Until then I just post the info how I do stuff for anyone.\n&gt;    \n&gt;   I am not even sure she speaks english and they were speaking\nanother language after they say her name and I cant understand it at\nall. So whatever it was it wasnt for my ears to understand.\n&gt;    \n&gt;   Misty\n&gt;     \n&gt; ---------------------------------\n&gt;   Do you Yahoo!?\n&gt; Everyone is raving about the all-new Yahoo! Mail Beta.   \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;   Join a yahoo group today! \n&gt;   OWNER           http://groups.yahoo.com/group/EVPSANANTONIO/\n&gt;   CO-OWNER     http://groups.yahoo.com/group/EVP-ITC/\n&gt;    \n&gt;   www.myspace.com/lon3_s7ar\n&gt;   __________________________________________________\n&gt; Do You Yahoo!?\n&gt; Tired of spam? Yahoo! Mail has the best spam protection around \n&gt; http://mail.yahoo.com \n&gt; \n&gt;          \n&gt; \n&gt; \n&gt; Join a yahoo group today! \n&gt;   OWNER           http://groups.yahoo.com/group/EVPSANANTONIO/\n&gt;   CO-OWNER     http://groups.yahoo.com/group/EVP-ITC/\n&gt;    \n&gt;   www.myspace.com/lon3_s7ar\n&gt; \n&gt;  \t\t\n&gt; ---------------------------------\n&gt; Do you Yahoo!?\n&gt;  Next-gen email? Have it all with the  all-new Yahoo! Mail Beta.\n&gt;"}