{"id": "5342", "subject": "Re: The new RS hack", "author": "LC Duplatt", "timestamp": "2008-01-12T18:55:51Z", "full_text": "RS 20125 Hack:\n\nBruce,\n\nYes, I just finished hacking one, too.  It definitely is harder.  The \nbiggest thing I can recommend is to not remove the bottom board.  If \nyou can tear only the front section of the radio and keep the bottom \nintact, you will fare better.  Simply undo the top little board that \nhas the LCD window (4 clips), flip it back, and punch out the 7th \nwire from the right.  A Bruce mentioned, you will need to be careful \nwith the two little buttons up top for the light and SW button (that \nyou don&#39;t need). You may be able to hold them in place with a \ntoothpick for each one when you pop the board up.  If you lose them \nin the radio, don&#39;t worry about it.  Let it go and re-assemble.  The \nradio will work just fine for you.\n\nAs Steve mentioned earlier, the shortwave sweeps slow, unless you \nhold it in.  The AM and FM sweep like the RS12-470 (older version).  \nClean sweep - nice unit.  If I get some time, I took some pictures of \nwhat it looks like opened up.  I can post them on here for you to \nsee.  Are we gonna&#39; call this &quot;Steve&#39;s Box,&quot; or the RS Hack 20125?  \nLOL! ;)\n\nLC\nhttp://www.AngelsGhosts.com\n\n--- In EVP-ITC@yahoogroups.com, &quot;bhali333&quot; \n&lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; Hey guy&#39;s \n&gt; \n&gt; I just got done hacking the new box Steve H. has found.\n&gt; It works fine on all bands. It is a little tougher to modify than a \n&gt; 469 or 470 in the fact that it is harder to disassemble but with a \n&gt; little patience you will have a nice little box.\n&gt; \n&gt; It sweeps smoothly and has a telescopic antenna attached, runs on 3 \nAA\n&gt; batteries or an AC adapter, the adapter is not supplied with the \n&gt; radio but can be purchased at radio shack.\n&gt; \n&gt; I have not done a session with it as I only finished the hack about \n5 \n&gt; minutes ago, but everything is working fine and it is sweeping \nnicely.\n&gt; \n&gt;  something to beware of, when you remove the second board you \nrelease \n&gt; two small plastic buttons that are for changing the sw band and the \n&gt; lcd light they can fall out of the radio and are not so easy to \n&gt; replace so be careful of that.\n&gt; \n&gt; Both back and front covers remove, the front cover will come loose \n&gt; after removing the second board and you will see the speaker. You \n&gt; must carefully turn the second board over and you will see a grey \n&gt; ribbon wire, the individual wires are attached by an 1/8 inch of \n&gt; plastic on either side of each wire. The wire that you must clip is \n&gt; the mute wire, It is the 7th wire from the top.\n&gt; \n&gt; Cut the plastic attaching the wires together with an exacto knife \nor \n&gt; razor blade, just enough to get a small pair of scissors in to snip \n&gt; the correct wire. I like to not only snip the wire but snip out \nabout \n&gt; an 1/8 of an inch segment of the wire so that the cut ends do not \n&gt; accidentally touch to make a connection when the box is reassembled.\n&gt; \n&gt; The modification is by no means hard it is just have to be a bit \nmore \n&gt; attentive than when you modify a 469 or 470.\n&gt; \n&gt; Anyone that feels they will have a problem you can skype me under\n&gt; Bruce Halliday and I will be glad to talk you through it.\n&gt; \n&gt; Bruce\n&gt;"}