{"id": "5343", "subject": "Re: Unaccounted-for frequencies?", "author": "LC Duplatt", "timestamp": "2008-01-12T18:59:20Z", "full_text": "My opinion is that when you work with this, it becomes apparently \nclear that the responses become manipulated - meaning, they are \nintelligent and in response to questions, etc.  It becomes difficult \nto rule out other broadcasts coming through when somebody with a name \nlike &quot;Rosemary Guiley&quot; hears her name come through a box.  I mean, \nwhat are the odds it is coincidence? ;)\n\nLC\n\n--- In EVP-ITC@yahoogroups.com, &quot;mllejade&quot; &lt;leongbabe@...&gt; wrote:\n&gt;\n&gt; Dear all,\n&gt; \n&gt; From my attempts at making a quick study of EVP-ITC via use of \nboxes \n&gt; in reading your extremely informative posts and listening to posted \n&gt; files, an obvious question arises (please indulge my technical \n&gt; ignorance here):  I understand these boxes work on scanning radio \n&gt; frequencies and that boxes have been created to scan AM, FM, and \n&gt; shortwave.  What about other frequencies, e.g., walkie-talkie \n&gt; channels (public, private and government), television broadcast \n&gt; channels, and all the in-between frequencies?  In other words, \nwhile \n&gt; scanning, for example, an AM channel, would it not be possible for \n&gt; the radio receiver to pick up another band, let&#39;s say, short-wave?  \n&gt; The reason I&#39;m asking is that years ago I was dictating something \n&gt; into the hand-held mic of a cheap cassette tape recorder and \nimagine \n&gt; my surprise when in playing back what I&#39;ve just dictated, instead \nof \n&gt; hearing just my voice, I also heard in the background a two-way \n&gt; conversation between truckers using their CB radios that my cheap \nmic \n&gt; had picked up while I was recording!\n&gt; \n&gt; My point is even if we&#39;re scanning only certain frequencies, can&#39;t \n&gt; other frequencies bleed through and if so, perhaps this may be the \n&gt; reason for some of the non-sequitor responses picked by the boxes?\n&gt; \n&gt; Another question:  Astronomers use scanning devices to pick up \n&gt; signals from outer space -- are their receivors constructed on \n&gt; basically the same principles as the radio receivers in the ITC \n&gt; boxes? \n&gt; \n&gt; Thanks everyone,\n&gt; \n&gt; Sharon the Ignorant\n&gt;"}