{"id": "5346", "subject": "Re: Unaccounted-for frequencies?", "author": "mllejade", "timestamp": "2008-01-12T19:21:47Z", "full_text": "Thanks for the input; I greatly appreciate it.  I&#39;m still on the \nfence, but I&#39;m not ruling anything out.\n\nSharon the Ignorant Muller\n\n--- In EVP-ITC@yahoogroups.com, &quot;LC Duplatt&quot; &lt;lcdupla@...&gt; wrote:\n&gt;\n&gt; I meant, &quot;It becomes difficult to label responses as &quot;other \n&gt; broadcasts&quot;...\n&gt; \n&gt; I was typing too quick.\n&gt; \n&gt; LC\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;LC Duplatt&quot; &lt;lcdupla@&gt; wrote:\n&gt; &gt;\n&gt; &gt; My opinion is that when you work with this, it becomes apparently \n&gt; &gt; clear that the responses become manipulated - meaning, they are \n&gt; &gt; intelligent and in response to questions, etc.  It becomes \n&gt; difficult \n&gt; &gt; to rule out other broadcasts coming through when somebody with a \n&gt; name \n&gt; &gt; like &quot;Rosemary Guiley&quot; hears her name come through a box.  I \nmean, \n&gt; &gt; what are the odds it is coincidence? ;)\n&gt; &gt; \n&gt; &gt; LC\n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;mllejade&quot; &lt;leongbabe@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; Dear all,\n&gt; &gt; &gt; \n&gt; &gt; &gt; From my attempts at making a quick study of EVP-ITC via use of \n&gt; &gt; boxes \n&gt; &gt; &gt; in reading your extremely informative posts and listening to \n&gt; posted \n&gt; &gt; &gt; files, an obvious question arises (please indulge my technical \n&gt; &gt; &gt; ignorance here):  I understand these boxes work on scanning \nradio \n&gt; &gt; &gt; frequencies and that boxes have been created to scan AM, FM, \nand \n&gt; &gt; &gt; shortwave.  What about other frequencies, e.g., walkie-talkie \n&gt; &gt; &gt; channels (public, private and government), television broadcast \n&gt; &gt; &gt; channels, and all the in-between frequencies?  In other words, \n&gt; &gt; while \n&gt; &gt; &gt; scanning, for example, an AM channel, would it not be possible \n&gt; for \n&gt; &gt; &gt; the radio receiver to pick up another band, let&#39;s say, short-\n&gt; wave?  \n&gt; &gt; &gt; The reason I&#39;m asking is that years ago I was dictating \nsomething \n&gt; &gt; &gt; into the hand-held mic of a cheap cassette tape recorder and \n&gt; &gt; imagine \n&gt; &gt; &gt; my surprise when in playing back what I&#39;ve just dictated, \ninstead \n&gt; &gt; of \n&gt; &gt; &gt; hearing just my voice, I also heard in the background a two-way \n&gt; &gt; &gt; conversation between truckers using their CB radios that my \ncheap \n&gt; &gt; mic \n&gt; &gt; &gt; had picked up while I was recording!\n&gt; &gt; &gt; \n&gt; &gt; &gt; My point is even if we&#39;re scanning only certain frequencies, \n&gt; can&#39;t \n&gt; &gt; &gt; other frequencies bleed through and if so, perhaps this may be \n&gt; the \n&gt; &gt; &gt; reason for some of the non-sequitor responses picked by the \nboxes?\n&gt; &gt; &gt; \n&gt; &gt; &gt; Another question:  Astronomers use scanning devices to pick up \n&gt; &gt; &gt; signals from outer space -- are their receivors constructed on \n&gt; &gt; &gt; basically the same principles as the radio receivers in the ITC \n&gt; &gt; &gt; boxes? \n&gt; &gt; &gt; \n&gt; &gt; &gt; Thanks everyone,\n&gt; &gt; &gt; \n&gt; &gt; &gt; Sharon the Ignorant\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}