{"id": "5348", "subject": "Re: [EVP-ITC] Some more SW filse from last night", "author": "Lisby", "timestamp": "2008-01-12T20:58:06Z", "full_text": "This is very weird, Frank. I was just explaining to someone about the  \nFish Group and what the name supposedly meant and up pops this. I  \nhave to think that the same entities are popping around between us  \nand perhaps heard this conversation I had a few days ago just after I  \nhad finished a session.\n\nAnn\n\nOn Jan 11, 2008, at 10:28 PM, Frank Sumption wrote:\n\n&gt;  The &quot;I&#39;m a fish&quot; is bad sign, that&#39;s the &#39;Fish Group&#39; that was  \n&gt; troubling the European researchers ( sorry, memory malfunction)  \n&gt; back in the 90&#39;s. This is supposedly a group that lives on Jupiter,  \n&gt; and they delight in screwing with EVPers. Some in AAEVP may have  \n&gt; heard of these charactors.\n&gt;\n&gt;  Judging by the amount of negatives here, I would think this is  \n&gt; good developement, they just don&#39;t want me working with shortwave.\n&gt;\n&gt;  Frank-S\n&gt;\n&gt;\n&gt; Make distant family not so distant with Windows Vista® + Windows  \n&gt; Live™. Start now!\n&gt;\n&gt;  &lt;foreignLamnguage-fragment.mp3&gt;&lt;-Hate-- \n&gt; ComingForYou.mp3&gt;&lt;OhMyGod---FrankDoesn&#39;t--Know.mp3&gt;&lt;- \n&gt; TheHumansBelieveInLuck.mp3&gt;&lt;ThisIsAHelplessPlanet.mp3&gt;&lt;-- \n&gt; I&#39;mAFish.mp3&gt;&lt;MoreBroadcastFrags.mp3&gt;\n\n\nThis is e y wei d, F ank. I was jus explaining o someone abou he Fish G oup and wha he name supposedly mean and up pops his. I ha e o hink ha he same en i ies a e popping a ound be ween us and pe haps hea d his con e sa ion I had a ew days ago jus a e I had inished a session.AnnOn Jan 11, 2008, a 10:28 PM, F ank Sump ion w o e:  The \"I'm a ish\" is bad sign, ha 's he 'Fish G oup' ha was oubling he Eu opean esea che s ( so y, memo y mal unc ion) back in he 90's. This is supposedly a g oup ha li es on Jupi e , and hey deligh in sc ewing wi h EVPe s. Some in AAEVP may ha e hea d o hese cha ac o s.    Judging by he amoun o nega i es he e, I would hink his is good de elopemen , hey jus don' wan me wo king wi h sho wa e.    F ank-SMake dis an amily no so dis an wi h Windows Vis a® + Windows Li e™. S a now!"}