{"id": "5351", "subject": "Re: The new RS hack", "author": "LC Duplatt", "timestamp": "2008-01-13T00:08:44Z", "full_text": "Bruce,\n\nI think the back can remain clipped on (but I must admit, I had the \nentire thing tore down to a mess - LOL), and just do the whole hack \nthrough the front.  I will post a couple picks of me doing it on \nhere. I will create a new folder entitled RS 20-125 Hack.  That way \nwe can add to it to help others.\n\nLC\nhttp://www.AngelsGhosts.com\n\n--- In EVP-ITC@yahoogroups.com, bruce halliday \n&lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; \n&gt; LC,\n&gt;  \n&gt; all good advice I don&#39;t think you can take the front cover off \nwithout removing the back.\n&gt; But then I did not try that.\n&gt;  \n&gt; I think the box should be RSbox 125 the others were not named for \nthe original RS\n&gt; hack inventor, and this 125 is the same hack only a different \nmodel, not a new type of box.\n&gt;  \n&gt; But hey who am I to say. I&#39;m just glad someone figured out a \nreliable easy to get version.\n&gt;  \n&gt; Bruce\n&gt; Bruce Halliday \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: lcdupla@...: Sat, 12 Jan 2008 18:55:51 \n+0000Subject: [EVP-ITC] Re: The new RS hack\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; RS 20125 Hack:Bruce,Yes, I just finished hacking one, too. It \ndefinitely is harder. The biggest thing I can recommend is to not \nremove the bottom board. If you can tear only the front section of \nthe radio and keep the bottom intact, you will fare better. Simply \nundo the top little board that has the LCD window (4 clips), flip it \nback, and punch out the 7th wire from the right. A Bruce mentioned, \nyou will need to be careful with the two little buttons up top for \nthe light and SW button (that you don&#39;t need). You may be able to \nhold them in place with a toothpick for each one when you pop the \nboard up. If you lose them in the radio, don&#39;t worry about it. Let it \ngo and re-assemble. The radio will work just fine for you.As Steve \nmentioned earlier, the shortwave sweeps slow, unless you hold it in. \nThe AM and FM sweep like the RS12-470 (older version). Clean sweep - \nnice unit. If I get some time, I took some pictures of what it looks \nlike opened up. I can post them on here for you to see. Are we gonna&#39; \ncall this &quot;Steve&#39;s Box,&quot; or the RS Hack 20125? LOL! ;)\nLChttp://www.AngelsGhosts.com--- In EVP-\nITC@yahoogroups.com, &quot;bhali333&quot; &lt;paranormalinvestigating@&gt; wrote:&gt;&gt; \nHey guy&#39;s &gt; &gt; I just got done hacking the new box Steve H. has \nfound.&gt; It works fine on all bands. It is a little tougher to modify \nthan a &gt; 469 or 470 in the fact that it is harder to disassemble but \nwith a &gt; little patience you will have a nice little box.&gt; &gt; It \nsweeps smoothly and has a telescopic antenna attached, runs on 3 AA&gt; \nbatteries or an AC adapter, the adapter is not supplied with the &gt; \nradio but can be purchased at radio shack.&gt; &gt; I have not done a \nsession with it as I only finished the hack about 5 &gt; minutes ago, \nbut everything is working fine and it is sweeping nicely.&gt; &gt; \nsomething to beware of, when you remove the second board you release \n&gt; two small plastic buttons that are for changing the sw band and the \n&gt; lcd light they can fall out of the radio and are not so easy to &gt; \nreplace so be careful of that.&gt; &gt; Both back and front covers remove, \nthe front cover will come loose &gt; after removing the second board and \nyou will see the speaker. You &gt; must carefully turn the second board \nover and you will see a grey &gt; ribbon wire, the individual wires are \nattached by an 1/8 inch of &gt; plastic on either side of each wire. The \nwire that you must clip is &gt; the mute wire, It is the 7th wire from \nthe top.&gt; &gt; Cut the plastic attaching the wires together with an \nexacto knife or &gt; razor blade, just enough to get a small pair of \nscissors in to snip &gt; the correct wire. I like to not only snip the \nwire but snip out about &gt; an 1/8 of an inch segment of the wire so \nthat the cut ends do not &gt; accidentally touch to make a connection \nwhen the box is reassembled.&gt; &gt; The modification is by no means hard \nit is just have to be a bit more &gt; attentive than when you modify a \n469 or 470.&gt; &gt; Anyone that feels they will have a problem you can \nskype me under&gt; Bruce Halliday and I will be glad to talk you through \nit.&gt; &gt; Bruce&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Get the power of Windows + Web with the new Windows Live.\n&gt; http://www.windowslive.com?\nocid=TXT_TAGHM_Wave2_powerofwindows_012008\n&gt;"}