{"id": "5380", "subject": "Re: New Hack is up on my site", "author": "Steve Hultay", "timestamp": "2008-01-13T14:52:09Z", "full_text": "Yeah, i think originally i said it was the bottom board.  That was my \nmistake to you guys, but when i pulled the back off the LCD part was \nmy bottom board at that time.  I think with the diagrams and \nexplanations i put up, there should be no further mistakes.  The SW \nbutton if lost is no big deal, you can switch the SW bands by the \nnumbers on the front panel of the radio too.  \n\n-Steve H.\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;LC Duplatt&quot; &lt;lcdupla@...&gt; wrote:\n&gt;\n&gt; Yes, Steve...I agree.  The top board is all that needs to be \nlifted.  \n&gt; I became too aggressive and had the whole dang thing tore apart. I \n&gt; just lifted the board up and identified the 7th wire from the right \n&gt; matching up with the MU on the bottom board (needed a flashlight to \n&gt; see real good) and pushed my Xacto hobby knife through the wire.  \nBy \n&gt; the way, if the SW button up top is not in properly when re-\n&gt; assembling the radio, it can prevent the radio from functioning if \nit \n&gt; is stuck in the &quot;on&quot; position.  The button is not needed if you \nlose \n&gt; it down inside the radio.\n&gt; \n&gt; LC\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Steve Hultay&quot; &lt;urkel23@&gt; wrote:\n&gt; &gt;\n&gt; &gt; \n&gt; &gt; I took the radio apart to take some pictures to show the hack and \n&gt; i&#39;m \n&gt; &gt; not really sure why some had problems.  I think maybe some may \nhave \n&gt; &gt; messed with the bottom board.  You only need to access the top \n&gt; board \n&gt; &gt; with the LCD display and there is nothing that will fall off \nexcept \n&gt; the \n&gt; &gt; 2 buttoms that control the light and SW band selector, both can \n&gt; easily \n&gt; &gt; be put on after the hack in a matter of seconds.  I posted some \n&gt; &gt; pictures and a detailed description on my site, so you can see \nthe \n&gt; &gt; procedure.  It took 5 minutes the first time, but after looking \nat \n&gt; it \n&gt; &gt; again it could probably be done faster but take your time with it.\n&gt; &gt; \n&gt; &gt; The details are at www.keyportparanormal.com and look for the \n&gt; folder on \n&gt; &gt; the left that says &quot;Simple Ghost Box Hack&quot;\n&gt; &gt; \n&gt; &gt; Hope this helps.\n&gt; &gt; \n&gt; &gt; -Steve H.\n&gt; &gt;\n&gt;"}