{"id": "5399", "subject": "Protection", "author": "mllejade", "timestamp": "2008-01-13T18:40:31Z", "full_text": "Very sage advice; thanks again Bruce!\n\nP.S.  The Japanese has a word for this (which escapes me now); but it \nessentially means what you&#39;ve just outlined: negativity begets more \nnegativity; harmful entities feed on negative energies and thusly \nbecome more powerful.  Best not to give them the time of day.\n\nSharon\n\n--- In EVP-ITC@yahoogroups.com, bruce halliday \n&lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; \n&gt; Hi Ann,\n&gt;  \n&gt; The swearing you are referring to is caused by negative entities \nthat\n&gt; are coming through the box.\n&gt;  \n&gt; There are a couple of reasons why this occurs, If you do a session \nwhen you are not in the correct frame of mind\n&gt; like being stressed out or having a disagreement with someone. \nAnything that causes you to have anxiety will\n&gt; be a source of energy that empowers the negative entities and can \nlead to deeper problems if not put in check.\n&gt;  \n&gt; Another reason for negative communication is that your tech is not \ncapable of blocking them or you do not have \n&gt; a permanent tech assigned.\n&gt;  \n&gt; My advice is to only do a session when you are in a somewhat decent \nmood, Also doing  a \n&gt; protection prayer and asking your tech to block any negativity or \nnegative entity from communicating or coming\n&gt; through the box is a MUST.\n&gt;  \n&gt; When you are doing a session do not take the continuous cursing \nlightly, that is a sign that negative spirits \n&gt; are dominating the communication. Immediately shut the box and end \nthe session.\n&gt;  \n&gt; Keep in mind that sometimes your tech will use a curse word to get \nyour attention when your mind wanders from the session\n&gt; to give validation that the communication you are receiving is not \njust public radio chatter, in 99.9% of the incidents of\n&gt; your tech or any other benign spirit cursing usually they only use \none or two curse words tops.\n&gt;  \n&gt; It is not an ongoing curse fest. Also after more experience you \nwill know by gut instinct what is negative.\n&gt; The main point is, do not take any negative communication lightly. \nIt is not a joke.\n&gt;  \n&gt; Bruce\n&gt; Bruce Halliday \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: lisby@...: Sat, 12 Jan 2008 23:41:10 -0500Subject: \nRe: [EVP-ITC] New file uploaded to EVP-ITC\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Mini box. \n&gt; \n&gt; This was just one snippet of one session. I haven&#39;t noticed a lot \nof swearing since then. I just laughed at them when I heard it anyway.\n&gt; \n&gt; Ann\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; On Jan 12, 2008, at 10:03 PM, juli velazquez wrote:\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Ann, they just were not being nice to you.  Can I ask what box you \nwere using?EVP-ITC@yahoogroups.com wrote:\n&gt; \n&gt; \n&gt; Hello,This email message is a notification to let you know thata \nfile has been uploaded to the Files area of the EVP-ITC \ngroup.File : /Ann&#39;s files/1-2-08bitch.wav Uploaded by : lisbyfarrum \n&lt;lisby@...&gt; Description : Someone mad at me for quitting. You can \naccess this file at the URL:http://groups.yahoo.com/group/EVP-\nITC/files/Ann%27s%20files/1-2-08bitch.wavTo learn more about file \nsharing for your group, please \nvisit:http://help.yahoo.com/l/us/yahoo/groups/original/members/web/ind\nex.htmlfilesRegards,lisbyfarrum &lt;lisby@...&gt;\n&gt; \n&gt; The contents of this eletronic correspondence is private & \nconfidential and meant only for the party and/or parties it is \naddressed to. \n&gt;  \n&gt; No part of this email transmission may be publicly posted or \nforwarded to other parties without explicit written permission.\n&gt; \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Put your friends on the big screen with Windows Vista + Windows \nLive.\n&gt; http://www.microsoft.com/windows/shop/specialoffers.mspx?\nocid=TXT_TAGLM_CPC_MediaCtr_bigscreen_012008\n&gt;"}