{"id": "5468", "subject": "Re: A bit confusing.", "author": "Frank Sumption", "timestamp": "2008-01-14T03:53:31Z", "full_text": "Thanks. Calling it an echo box has brought some negative comments, \nas skeptics think I&#39;m adding sound effects to the signal. but using \nthe box wiht channels seems to really enhance the voices, more than \njust using an empty box, or even no box. This latest sound box was \nmade as I do everything else, just on a whim, the whole project being \nguided by intuition from day one. That&#39;s why I don&#39;t really feel like \nI actually know anything. \n \n\n Frank-S\n \n\n--- In EVP-ITC@yahoogroups.com, &quot;LC Duplatt&quot; &lt;lcdupla@...&gt; wrote:\n&gt;\n&gt; FS:\n&gt; \n&gt; Well, if the waves have to bend around corners and work their way \n&gt; through chambers, that is an echo box in my opinion, as the sound \nwaves \n&gt; are delayed and thus slowed down by doing so.  I think you are fine \nto \n&gt; call it an echo box, as slowing down the sound may be why it helps \nthe \n&gt; sound of the voices become more discernable.  Bruce slows his \n&gt; recordings down a bit to make them easier to hear, as well.  One \nway is \n&gt; by a box of chambers, the other by way of a computer program.\n&gt; \n&gt; Sounds good to me, Frank.\n&gt; \n&gt; LC\n&gt; http://www.AngelsGhosts.com\n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;franks-boxes@&gt; \nwrote:\n&gt; &gt;\n&gt; &gt; \n&gt; &gt;  This  is from #24 and the big echo box. I was going to stop \n&gt; callingit an echo box, but that despite the critisim, that still \nseem \n&gt; sotbe the best description.   First the voice says &quot;Bombs hit \nEngland&quot;, \n&gt; then &quot;length of channel doubles energy&quot;, so I&#39;m not sure if they \nmean \n&gt; the echo box channel, or the English channel. I&#39;m not sure the \nbombs \n&gt; hit england voices isn&#39;t left over energy from WWII. that&#39;s wy I \nsay \n&gt; you can&#39;t tell what l;evel is coming through, or the source, so \ndon&#39;t \n&gt; take any of this stuff as gospel, unless it&#39;s unmistakable.   Frank-\nS\n&gt; &gt; _________________________________________________________________\n&gt; &gt; Make distant family not so distant with Windows Vista + Windows \n&gt; Live.\n&gt; &gt; http://www.microsoft.com/windows/digitallife/keepintouch.mspx?\n&gt; ocid=TXT_TAGLM_CPC_VideoChat_distantfamily_012008\n&gt; &gt;\n&gt;"}