{"id": "5478", "subject": "Re: Personal Preferences", "author": "LC Duplatt", "timestamp": "2008-01-14T13:56:02Z", "full_text": "I like what everyone is saying regarding this subject, because people \nare at different places with respect to one&#39;s own spirituality. I \nagree with Frank, because mankind has a tendency to create, or \nrather &quot;mis-create&quot; through fear.  Yet, I also believe some people \nneed to believe in protection from spirits of the light, so fear does \nnot take hold.  I look at it like this: All of us believe we are \nprotected who are running these experiments; either by our own power \nand ability, or by some other unseen entity...or both. If we give \nanything power, we become its slave.  \n\nI truly have no problem with either idea, as it just could be that \nthose from the light assist, protect and guide us, because many of us \non earth do not know just how much power we really have. Fear \ntypically causes us to surrender our power over and &quot;mis-think.&quot;  \n\nThus, I say:  Whatever works to keep a person free of fear is good \nwith me.\n\nLC\n\n\n--- In EVP-ITC@yahoogroups.com, Ron Lederer &lt;ronriko@...&gt; wrote:\n&gt;\n&gt; Great to hear eveyone&#39;s point of view...based on experience.  That \nwhat is perfect about this group...you are doing...reporting and \nsharing...we are learning and we will make our own personal choice.  \nNot stop.   Ron L\n&gt; \n&gt; eastern_paranormal &lt;eparanormal@...&gt; wrote:          We have done \nEVP work since the early 90&#39;s and have never gotten a \n&gt; dark cursing EVP. The only thing I have gotten is a cursed word \nused \n&gt; describing someone and it just so happened that one night we were \n&gt; doing a white noise vs pink noise experiment and running late so we \n&gt; didn&#39;t pray. So personally I believe it makes a difference, but \nit&#39;s \n&gt; really up to the individual. Personally, I feel alike attracts \nalike. \n&gt; So staying positive and upbeat before hand and during probably \nreally \n&gt; makes a difference no matter what.\n&gt; \n&gt; We have also captured a good many apparition over the years via \n&gt; camera, and again prayer is done whenever we are going out on an \n&gt; investigation or paranormal shooting. The ones we have captured \nthey \n&gt; always seem to be running or going a different direction than us, \nso \n&gt; again I feel it makes a difference. We have two Pagans on our team. \n&gt; One prays, and one doesn&#39;t. The one that does is just starting out \n&gt; and has been getting some great shots and a few EVP&#39;s. The one that \n&gt; doesn&#39;t in 2 years has only gotten a few shots and no \nEVP&#39;s......but \n&gt; I leave the choice up to each team member.\n&gt; \n&gt; That&#39;s my thoughts on it, it really boils down to personal \n&gt; preferences.\n&gt; \n&gt; Gabreael\n&gt; www.easternparanormal.com\n&gt; \n&gt; PS - I have started a discussion group for E.P.&#39;s radio show. Is it \n&gt; OK if I post the link here? If not that&#39;s OK too :) \n&gt; \n&gt; \n&gt; \n&gt;                          \n&gt; \n&gt;        \n&gt; ---------------------------------\n&gt; Be a better friend, newshound, and know-it-all with Yahoo! Mobile.  \nTry it now.\n&gt;"}