{"id": "5484", "subject": "For Frank R. this is long but I think worth the read", "author": "bhali333", "timestamp": "2008-01-14T14:29:15Z", "full_text": "Frank,\n\nLet me say at the onset this is not meant as an attack and I will not \nget into a pissing match over it, but I did feel I needed to address \nit.\n\nI promised myself that I would not post a response to any one \nperson,only to a subject in general, but I will have to break that \npromise on this one.\n\nI think your response to the ritual protection post was egotistical, \ncareless and uninformed. That was the response I would expect from a \nclose minded sceptic that had no real experience in this field.\n\nAs a researcher in the paranormal in general you should know that \nthere is a very real and present danger from darker entities, \nespecially in the field of box research that is still in its infancy \nand our knowledge is not advanced enough using this method to be so \nhap hazard about it.\n\nAll are entitled to their own opinion as far as the way they go about \ntheir own research but to advise that protection from the negative \nmeans nothing and to do it in an open forum where there are \nimpressionable new individuals that are just entering into this \nresearch is very careless on your part.\n\nSome researchers here including Steve and myself among other have \nrecorded files with messages that tell us that the communication \nprocess is being hindered at that time by what we refer to as \n&quot;dark heads&quot; and our spirit contacts actually use that term. they \nhave also told us when asked why communication was so bad that it was \nbeing blocked by negative entities. \n\nI only one of a few that have gotten this exact communication. So \nthere is a real threat from negative energy or entities.\n\nPlus through research we have found that it is possible for entities \nto travel back and forth between our realms during an open box \nsession. If you listened to numerous files Steve and I have posted \nasking our friends mike and Lisa on the other side to insure that all \nand any spirits that may have traveled through please go back and \nhave gotten conformation from them every time.\n\nIf it is possible for an entity to travel through the portal that a \nbox MAY produce then it stands to reason it is possible that it can \nbe a dark entity.\n\nAs far as fear goes, I agree wholeheartedly, fear definitely feeds \nthe negative. And that is my point. The protection ritual does not \ncreate a relative tangible barrier, it is simply a metaphoric symbol \nof putting your mind in the right place so as not to feed this \nnegative energy.\n\nAnd the protection we receive from our tech/guides on the other side \nin my belief is very real, I believe they do actually run \ninterference for us as far as negativity goes and the part of the \nritual where we invoke their help is just a form of respect and \nacknowledgement that they are constantly watching out for us.\n\nthis being said, Of course everyone will adhere to their own beliefs \nas far as this subject is concerned. I just felt that your response \nwas a little strong and came more from the attitude that I also \nsuffer from that is to say &quot; negative spirit yeah bring it on&quot;\n\nBut that is not a logical thought out approach to an existing concern.\nSo make the ritual available for anyone that wants to use it and the \nexperienced information to go with it.\n\nMy most important concern is the welfare and teaching and eventual \nsuccess of new researcher and this research as a whole.\n\nBruce"}