{"id": "5486", "subject": "RE: [EVP-ITC] Box in the morning", "author": "bruce halliday", "timestamp": "2008-01-14T14:48:25Z", "full_text": "--_b15239c0-5a49-4795-bda9-7dc7c6329422_\r\nContent-Type: text/plain; charset=&quot;Windows-1252&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n\nNick,\n \nI&#39;m sure your gonna be a great researcher.\nIf I can help let me kn=\r\now.\n \nBruce\nBruce Halliday \n\n\nTo: EVP-ITC@yahoogroups.comFrom: thegreatwolf=\r\n@...: Sun, 13 Jan 2008 20:33:41 -0500Subject: Re: [EVP-ITC] B=\r\nox in the morning\n\n\n\n\nHey Bruce, I didn&#39;t mean to come across annoyed or of=\r\nfended by your comment.  I was just saying incase it came across like I was=\r\n ignoring the box.  I agree that it isn&#39;t a toy and to pay attention to it =\r\nwhen doing a session. \n\n\nOn Jan 9, 2008, at 10:51 AM, bruce halliday wrote:=\r\n\n\n\n\n\nNick, You are a new member and a possible researcher so I do not want =\r\nto get off on the wrong footIt sounds like you may have taken what I said a=\r\ns criticism, It was not meant to be.Just experienced advice. There are some=\r\n researchers that believe it is beneficial to leave a box running and unatt=\r\nended, so that our spirit friends can &quot;imprint&quot; to the frequency of the box=\r\n That is not at all necessary, Spirit techs do need to imprint to certain b=\r\noxes but do so through two way communicationyou see they also imprint the e=\r\nnergy signature of the user of the box also. And that can only be accomplis=\r\nhed through communicative interaction during a session. If the box is left =\r\nunattended they may only accomplish half of what they need to do. Also I ha=\r\nve had first hand experience with certain researchers that do practice this=\r\n lackadaisical us of a box and had begun to get less and less communication=\r\n during attempts at actual sessions and eventually nothing but negative ent=\r\nities coming through.I am not saying this is solely due to doing an absent =\r\nsession which is what I have come to call it, It entails man6y factors. But=\r\n the absent session practice definitely contributes to the ultimate failure=\r\n of communication. Nick, it is better for you to establish solid research p=\r\nractices in the beginning that will serve to enhance your communication ski=\r\nlls and growth in the future. Remember your spirit contacts or &quot;technicians=\r\n&quot; will become not only the facilitators of your link and communication from=\r\n theother side but they will become your trusted friends and protectors. yo=\r\nu would never leave your buddy on the phone and go on to something else whi=\r\nle he remained on the line calling for you to speak with him. Our spirit fr=\r\niends where people just like usat one time and the emotions we carry in the=\r\n physical also carry over to our spirit lives. I hope you do not take this =\r\nas preaching or criticism it is just experience from communicating with my =\r\nown techs and friendsand gathering information on what they feel and expect=\r\n from us as researchers.Remember all we have to do is turn on a box and lis=\r\nten and record their job to send the communication no matter how short the =\r\nphrase or word is a 1000x harder for them so don&#39;t you think they deserve a=\r\n 100% of our attention when we open the lines of communication. Also in clo=\r\nsing let me say that my belief on &quot;imprinting&quot; of a box is for boxes like F=\r\nrank&#39;s box and the mini box, for the simplereason that they are individuall=\r\ny made and each carry a slightly different frequency range, indicative to t=\r\nhat particular box.The radio shack hack box on the other hand is manufactur=\r\ned in china most likely on an automated assembly line so eachcircuit board =\r\nis exactly like the next, this being the case I believe that when our frien=\r\nds imprinted on the first of the RS boxesit was sufficient for most of the =\r\nothers. That is why people experience immediate communication right out of =\r\nthe box. So therefore the RS box does not need that grace period to &quot;Imprin=\r\nt&quot; These comments and statements are my own hypothesis based on my own exte=\r\nnsive research with every type of box that is made to dateand I am only off=\r\nering it so that it may help others to avoid the toil and mistakes that I h=\r\nave endured. thanks for giving me the soap box once again! Bruce\nBruce Hall=\r\niday \n\n\nTo: EVP-ITC@yahoogroups.comFrom: thegreatwolf@...: We=\r\nd, 9 Jan 2008 06:25:30 -0500Subject: Re: [EVP-ITC] Box in the morning\n\n\nJus=\r\nt FYI, I had stopped checking my email at that time and was trying to get s=\r\nomeone to say something.  I usually can&#39;t get my self to not pay attention =\r\nto the box when i turn it on.\n\nOn Jan 8, 2008, at 9:19 AM, bruce halliday w=\r\nrote:\n\n\n\n\nNick, My advice as a long time researcher is not to just turn the=\r\n box on and leave it running unless you intend to do a session and give you=\r\nr friends on the other side that are workingextremely hard to send you the =\r\ncommunication your undivided attention. It&#39;s kind of like calling someone o=\r\nn the phone and when they start a conversation you decide toput the phone d=\r\nown and focus your attention on other things. There are other researchers t=\r\nhat feel that there is nothing wrong with this practice and do it on occasi=\r\nonBut I have come to the understanding that it is deemed disrespectful and =\r\nwhile you may be listening with one ear as you do something else, you will =\r\nhear a loud curse word or nasty statement, that is their way of getting you=\r\nr attention back. I have gotten numerous messages about the difficulty of t=\r\nhe attempts for them to communicate so when I turn the box on it gets my fu=\r\nll attention. just some experienced advice. As for them telling you to clos=\r\ne the portal, it could have two meanings. Sometimes they refer to box thati=\r\ns turned on and in use as a portal for the simple reason that each time we =\r\nturn a box on to communicate it opens a direct open link between our realm =\r\nand theirs so in essence it is an open door for anything to pass in or out.=\r\n that is why when I end a session I always ask my technician to bring back =\r\nany spirits that may have come through the portal during the session and I =\r\nask for conformation and 10 times out of ten will get &quot;OK&quot; or &quot;OK THEY ARE =\r\nBACK&quot; also they may have meant since you had the box running and where not =\r\ndoing a actual session to shut the box so that they could go and not have t=\r\no protect the open connection from any negative entities that where able cr=\r\noss through the openportal. A few researchers have been receiving numerous =\r\nmessages about the number 7 within the past month. The only known significa=\r\nnce that the number 7 has in evp research is the 7 entities that controlled=\r\n communication back in the eighties and ninetiesduring the spiricom and lux=\r\nembourg era. To receive this number in messages so often and by more than o=\r\nne researcher, odiouslyholds some importance which they have not been able =\r\nor are not ready to convey. If you need any help or have any questions plea=\r\nse feel free to ask. Bruce\nBruce Halliday \n\n\nTo: EVP-ITC@yahoogroups.comFro=\r\nm: thegreatwolf@...: Tue, 8 Jan 2008 06:27:07 -0500Subject: [=\r\nEVP-ITC] Box in the morning\n\n\nHey,Anyone have any odd problems in the morni=\r\nng with using it. I am sitting here checking my email so i just thought i&#39;d=\r\n turn it on and... not check my email. Anywho.... Then right at about 6:20 =\r\ni heard a voice say &quot;Nicholas Etheridge please turn off the dsfnlsd&quot; not qu=\r\nite sure what word it used... possibly portal. I just thought it was weird.=\r\n Also under all of the jumble and this voice speaking i heard a deep male v=\r\noice almost chanting &quot;seven&quot;. Not sure if I actually heard this or its the =\r\nwant to have an excuse to stay home and not take the HSAs.Anyway.. just cur=\r\nious if anyone has gotten heard this or if they know something I don&#39;t abou=\r\nt using the box in the morning.Peace,Nick\n\nGet the power of Windows + Web w=\r\nith the new Windows Live. Get it now! \n\n\nPut your friends on the big screen=\r\n with Windows Vista=AE + Windows Live=99. Start now! \n\n \n\n\n\n\n\n\n____________=\r\n_____________________________________________________\nShare life as it happ=\r\nens with the new Windows Live.\nhttp://www.windowslive.com/share.html?ocid=\r\n=3DTXT_TAGHM_Wave2_sharelife_012008\r\n--_b15239c0-5a49-4795-bda9-7dc7c6329422_\r\nContent-Type: text/html; charset=&quot;Windows-1252&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;\n&lt;head&gt;\n&lt;style&gt;\n.hmmessage P\n{\nmargin:0px;\npadding:0px\n}\nbody.hmmessa=\r\nge\n{\nFONT-SIZE: 10pt;\nFONT-FAMILY:Tahoma\n}\n&lt;/style&gt;\n&lt;/head&gt;\n&lt;body class=3D&#39;=\r\nhmmessage&#39;&gt;\nNick,&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nI&#39;m sure your gonna be a great researcher.=\r\n&lt;BR&gt;\nIf I can help let me know.&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nBruce&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;P align=\r\n=3Dcenter&gt;&lt;FONT size=3D4&gt;&lt;FONT color=3D#0033cc&gt;&lt;STRONG&gt;&lt;EM&gt;&lt;FONT color=3D#0=\r\n00000 size=3D5&gt;Bruce Halliday &lt;BR&gt;&lt;/FONT&gt;&lt;/EM&gt;&lt;/STRONG&gt;&lt;BR&gt;&lt;A href=3D&quot;http:=\r\n//free-paranormalinvestigating.com/%3C/div%3E%3C/div%3E%3Cp%20/%3E%3Cdiv%20=\r\nclass=3D&quot; target=3D_blank&gt;&lt;/P&gt;&lt;/A&gt;&lt;/FONT&gt;&lt;/FONT&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;BLOCKQUOTE&gt;\n&lt;HR&gt;\n=\r\nTo: EVP-ITC@yahoogroups.com&lt;BR&gt;From: thegreatwolf@...&lt;BR&gt;Date: Su=\r\nn, 13 Jan 2008 20:33:41 -0500&lt;BR&gt;Subject: Re: [EVP-ITC] Box in the morning&lt;=\r\nBR&gt;&lt;BR&gt;\n&lt;META content=3D&quot;Microsoft SafeHTML&quot; name=3DGenerator&gt;\n&lt;DIV id=3DEC=\r\n_ygrp-mlmsg style=3D&quot;WIDTH: 655px&quot;&gt;\n&lt;DIV id=3DEC_ygrp-msg style=3D&quot;PADDING-=\r\nRIGHT: 15px; PADDING-LEFT: 0px; Z-INDEX: 1; FLOAT: left; PADDING-BOTTOM: 0p=\r\nx; WIDTH: 490px; PADDING-TOP: 0px&quot;&gt;\n&lt;DIV id=3DEC_ygrp-text&gt;\nHey Bruce, I di=\r\ndn&#39;t mean to come across annoyed or offended by your comment. &nbsp;I was j=\r\nust saying incase it came across like I was ignoring the box. &nbsp;I agree=\r\n that it isn&#39;t a toy and to pay attention to it when doing a session. \n&lt;DIV=\r\n&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;On Jan 9, 2008, at 10:51 AM, bruce halliday wrote:&lt;/DIV&gt;&lt;BR cl=\r\nass=3DEC_Apple-interchange-newline&gt;\n&lt;BLOCKQUOTE&gt;&lt;SPAN class=3DEC_Apple-styl=\r\ne-span style=3D&quot;FONT-WEIGHT: normal; FONT-SIZE: 12px; COLOR: rgb(0,0,0); TE=\r\nXT-INDENT: 0px; FONT-STYLE: normal; FONT-FAMILY: Helvetica; LETTER-SPACING:=\r\n normal; BORDER-COLLAPSE: separate; FONT-VARIANT: normal&quot;&gt;\n&lt;DIV id=3DEC_ygr=\r\np-mlmsg style=3D&quot;FONT-SIZE: 13px; FONT-FAMILY: arial, helvetica, clean, san=\r\ns-serif&quot;&gt;\n&lt;DIV id=3DEC_ygrp-msg&gt;\n&lt;DIV id=3DEC_ygrp-text style=3D&quot;FONT-FAMIL=\r\nY: Georgia&quot;&gt;\n&lt;P&gt;Nick,&lt;BR&gt;&nbsp;&lt;BR&gt;You are a new member and a possible rese=\r\narcher so I do not want to get off on the wrong foot&lt;BR&gt;It sounds like you =\r\nmay have taken what I said as criticism, It was not meant to be.&lt;BR&gt;Just ex=\r\nperienced advice. There are some researchers that believe it is beneficial =\r\nto leave&lt;SPAN class=3DEC_Apple-converted-space&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;a box runni=\r\nng and unattended, so that our spirit friends can &quot;imprint&quot; to the frequenc=\r\ny of the box&lt;BR&gt;&nbsp;&lt;BR&gt;That is not at all necessary, Spirit techs do nee=\r\nd to imprint to certain boxes but do so through two way communication&lt;BR&gt;yo=\r\nu see they also imprint the energy signature of the user of the box also. A=\r\nnd that can only be accomplished through&lt;SPAN class=3DEC_Apple-converted-sp=\r\nace&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;communicative interaction during a session. If the box=\r\n is left unattended they may only accomplish half of what they need to do.&lt;=\r\nBR&gt;&nbsp;&lt;BR&gt;Also I have had first hand experience with certain researchers=\r\n that do practice this lackadaisical us of a box and had begun to&lt;SPAN clas=\r\ns=3DEC_Apple-converted-space&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;get less and less communicati=\r\non during attempts at actual sessions and eventually nothing but negative e=\r\nntities coming through.&lt;BR&gt;I am not saying this is solely due to doing an a=\r\nbsent session which is what I have come to call it, It entails man6y factor=\r\ns.&lt;BR&gt;&nbsp;&lt;BR&gt;But the absent session practice definitely contributes to t=\r\nhe ultimate failure of communication.&lt;SPAN class=3DEC_Apple-converted-space=\r\n&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;Nick, it is better for you to establish solid research pr=\r\nactices in the beginning that will serve to enhance your communication&lt;SPAN=\r\n class=3DEC_Apple-converted-space&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;skills and growth in the=\r\n future.&lt;BR&gt;&nbsp;&lt;BR&gt;Remember your spirit contacts or &quot;technicians&quot; will b=\r\necome not only the facilitators of your link and communication from the&lt;BR&gt;=\r\nother side but they will become your trusted&nbsp;friends and protectors. y=\r\nou would never leave your buddy on the phone and go&lt;SPAN class=3DEC_Apple-c=\r\nonverted-space&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;on to something else while he remained on t=\r\nhe line calling for you to speak with him. Our spirit friends where people =\r\njust like us&lt;BR&gt;at one time and the emotions we carry in the physical also =\r\ncarry over to our spirit lives.&lt;BR&gt;&nbsp;&lt;BR&gt;I hope you do not take this as=\r\n preaching or criticism it is just experience from communicating with my ow=\r\nn techs and friends&lt;BR&gt;and gathering information on what they feel and expe=\r\nct from us as researchers.&lt;BR&gt;Remember all we have to do is turn on a box a=\r\nnd listen and record their job to send the communication&lt;SPAN class=3DEC_Ap=\r\nple-converted-space&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;no matter how short the phrase or word=\r\n is a 1000x harder for them so don&#39;t you think they deserve a 100%&lt;SPAN cla=\r\nss=3DEC_Apple-converted-space&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;of our attention when we ope=\r\nn the lines of communication.&lt;BR&gt;&nbsp;&lt;BR&gt;Also in closing let me say that =\r\nmy belief on &quot;imprinting&quot; of a box is for boxes like Frank&#39;s box and the mi=\r\nni box, for the simple&lt;BR&gt;reason that they are individually made and each c=\r\narry a slightly different frequency range, indicative to that particular bo=\r\nx.&lt;BR&gt;The radio shack hack box on the other hand is manufactured in china m=\r\nost likely on an automated assembly line so each&lt;BR&gt;circuit board is exactl=\r\ny like the next, this being the case I believe that when our friends imprin=\r\nted on the first of the RS boxes&lt;BR&gt;it was sufficient for most of the other=\r\ns. That is why people experience immediate communication right out of the b=\r\nox.&lt;BR&gt;&nbsp;&lt;BR&gt;So therefore the RS box does not need that grace period to=\r\n &quot;Imprint&quot;&lt;BR&gt;&nbsp;&lt;BR&gt;These comments and statements are my own hypothesis=\r\n based on my own extensive research with every type of box that is made to =\r\ndate&lt;BR&gt;and I am only offering it so that it may help others to avoid the t=\r\noil and mistakes that I have endured.&lt;BR&gt;&nbsp;&lt;BR&gt;thanks for giving me the=\r\n soap box once again!&lt;BR&gt;&nbsp;&lt;BR&gt;Bruce&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;P align=3Dcenter&gt;=\r\n&lt;FONT size=3D4&gt;&lt;FONT color=3D#0033cc&gt;&lt;STRONG&gt;&lt;EM&gt;&lt;FONT color=3D#000000 size=\r\n=3D5&gt;Bruce Halliday&lt;SPAN class=3DEC_Apple-converted-space&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;=\r\n&lt;/FONT&gt;&lt;/EM&gt;&lt;/STRONG&gt;&lt;BR&gt;&lt;A href=3D&quot;http://free-paranormalinvestigating.com=\r\n/%3C/div%3E%3C/div%3E%3Cp%20/%3E%3Cdiv%20class=3D&quot; target=3D_blank&gt;&lt;/A&gt;&lt;/FO=\r\nNT&gt;&lt;/FONT&gt;&lt;/P&gt;&lt;FONT size=3D4&gt;&lt;FONT color=3D#0033cc&gt;&lt;A href=3D&quot;http://free-p=\r\naranormalinvestigating.com/%3C/div%3E%3C/div%3E%3Cp%20/%3E%3Cdiv%20class=3D=\r\n&quot; target=3D_blank&gt;&lt;/A&gt;&lt;/FONT&gt;&lt;/FONT&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;BLOCKQUOTE&gt;\n&lt;HR&gt;\nTo: EVP-ITC@=\r\nyahoogroups&lt;WBR&gt;.com&lt;BR&gt;From: thegreatwolf@&lt;WBR&gt;earthlink.&lt;WBR&gt;net&lt;BR&gt;Date:=\r\n Wed, 9 Jan 2008 06:25:30 -0500&lt;BR&gt;Subject: Re: [EVP-ITC] Box in the mornin=\r\ng&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3DEC_EC_ygrp-mlmsg&gt;\n&lt;DIV id=3DEC_EC_ygrp-msg&gt;\n&lt;DIV id=3DE=\r\nC_EC_ygrp-text&gt;Just FYI, I had stopped checking my email at that time and w=\r\nas trying to get someone to say something. &nbsp;I usually can&#39;t get my sel=\r\nf to not pay attention to the box when i turn it on.&lt;BR&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;On Jan =\r\n8, 2008, at 9:19 AM, bruce halliday wrote:&lt;/DIV&gt;&lt;BR class=3DEC_EC_Apple-int=\r\nerchange-newline&gt;\n&lt;BLOCKQUOTE&gt;&lt;SPAN class=3DEC_EC_Apple-style-span style=3D=\r\n&quot;FONT-WEIGHT: normal; FONT-SIZE: 12px; COLOR: rgb(0,0,0); TEXT-INDENT: 0px;=\r\n FONT-STYLE: normal; FONT-FAMILY: Helvetica; LETTER-SPACING: normal; BORDER=\r\n-COLLAPSE: separate; FONT-VARIANT: normal&quot;&gt;\n&lt;DIV id=3DEC_EC_ygrp-mlmsg styl=\r\ne=3D&quot;FONT-SIZE: 13px; FONT-FAMILY: arial, helvetica, clean, sans-serif&quot;&gt;\n&lt;D=\r\nIV id=3DEC_EC_ygrp-msg&gt;\n&lt;DIV id=3DEC_EC_ygrp-text style=3D&quot;FONT-FAMILY: Geo=\r\nrgia&quot;&gt;\nNick,&lt;BR&gt;&nbsp;&lt;BR&gt;My advice as a long time researcher is not to jus=\r\nt turn the box on and leave it running&lt;SPAN class=3DEC_EC_Apple-converted-s=\r\npace&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;unless you intend to do a session and give your frien=\r\nds on the other side that are working&lt;BR&gt;extremely hard to send you the com=\r\nmunication your undivided attention.&lt;BR&gt;&nbsp;&lt;BR&gt;It&#39;s kind of like calling=\r\n someone on the phone and when they start a conversation you decide to&lt;BR&gt;p=\r\nut the phone down and focus your attention on other things.&lt;BR&gt;&nbsp;&lt;BR&gt;Th=\r\nere are other researchers that feel that there is nothing wrong with this p=\r\nractice and do it on occasion&lt;BR&gt;But I have come to the understanding that =\r\nit is deemed disrespectful and while you may be listening with&lt;SPAN class=\r\n=3DEC_EC_Apple-converted-space&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;one ear as you do something=\r\n else, you will hear a loud curse word or nasty statement, that is their wa=\r\ny&lt;SPAN class=3DEC_EC_Apple-converted-space&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;of getting your=\r\n attention back. I have gotten numerous messages about the difficulty of th=\r\ne attempts for&lt;SPAN class=3DEC_EC_Apple-converted-space&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;th=\r\nem to communicate so when I turn the box on it gets my full attention. just=\r\n some experienced advice.&lt;BR&gt;&nbsp;&lt;BR&gt;As for them telling you to close the=\r\n portal, it could have two meanings. Sometimes they refer to box that&lt;BR&gt;is=\r\n turned on and in use as a portal for the simple reason that each time we t=\r\nurn a box on to communicate&lt;SPAN class=3DEC_EC_Apple-converted-space&gt;&nbsp;=\r\n&lt;/SPAN&gt;&lt;BR&gt;it opens a direct open link between our realm and theirs so in e=\r\nssence it is an open door for anything to pass in or out.&lt;BR&gt;&nbsp;&lt;BR&gt;that=\r\n is why when I end a session I always ask my technician to bring back any s=\r\npirits that may have come through the&lt;SPAN class=3DEC_EC_Apple-converted-sp=\r\nace&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;portal during the session and I ask for conformation a=\r\nnd 10 times out of ten will get &quot;OK&quot; or &quot;OK THEY ARE BACK&quot;&lt;BR&gt;&nbsp;&lt;BR&gt;als=\r\no they may have meant since you had the box running and where not doing a a=\r\nctual session to shut the box so&lt;SPAN class=3DEC_EC_Apple-converted-space&gt;&=\r\nnbsp;&lt;/SPAN&gt;&lt;BR&gt;that they could go and not have to protect the open connect=\r\nion from any negative entities that where able cross through the open&lt;BR&gt;po=\r\nrtal.&lt;BR&gt;&nbsp;&lt;BR&gt;A few researchers have been receiving numerous messages =\r\nabout the number 7 within the past month. The only known&lt;SPAN class=3DEC_EC=\r\n_Apple-converted-space&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;significance that the number 7 has =\r\nin evp research is the 7 entities that controlled communication back in the=\r\n eighties and nineties&lt;BR&gt;during the spiricom and luxembourg era. To receiv=\r\ne this number in messages so often and by more than one researcher, odiousl=\r\ny&lt;BR&gt;holds some importance which they have not been able or are not ready t=\r\no convey.&lt;BR&gt;&nbsp;&lt;BR&gt;If you need any help or have any questions please fe=\r\nel free to ask.&lt;BR&gt;&nbsp;&lt;BR&gt;Bruce&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;P align=3Dcenter&gt;&lt;F=\r\nONT size=3D4&gt;&lt;FONT color=3D#0033cc&gt;&lt;STRONG&gt;&lt;EM&gt;&lt;FONT color=3D#000000 size=\r\n=3D5&gt;Bruce Halliday&lt;SPAN class=3DEC_EC_Apple-converted-space&gt;&nbsp;&lt;/SPAN&gt;&lt;=\r\nBR&gt;&lt;/FONT&gt;&lt;/EM&gt;&lt;/STRONG&gt;&lt;BR&gt;&lt;A href=3D&quot;http://free-paranormalinvestigating.=\r\ncom/%3C/div%3E%3C/div%3E%3Cp%20/%3E%3Cdiv%20class=3D&quot; target=3D_blank&gt;&lt;/A&gt;&lt;=\r\n/FONT&gt;&lt;/FONT&gt;&lt;/P&gt;&lt;FONT size=3D4&gt;&lt;FONT color=3D#0033cc&gt;&lt;A href=3D&quot;http://fre=\r\ne-paranormalinvestigating.com/%3C/div%3E%3C/div%3E%3Cp%20/%3E%3Cdiv%20class=\r\n=3D&quot; target=3D_blank&gt;&lt;/A&gt;&lt;/FONT&gt;&lt;/FONT&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;BLOCKQUOTE&gt;\n&lt;HR&gt;\nTo: EVP-I=\r\nTC@yahoogroups&lt;WBR&gt;.com&lt;BR&gt;From: thegreatwolf@&lt;WBR&gt;earthlink.&lt;WBR&gt;net&lt;BR&gt;Da=\r\nte: Tue, 8 Jan 2008 06:27:07 -0500&lt;BR&gt;Subject: [EVP-ITC] Box in the morning=\r\n&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3DEC_EC_EC_ygrp-mlmsg&gt;\n&lt;DIV id=3DEC_EC_EC_ygrp-msg&gt;\n&lt;DIV i=\r\nd=3DEC_EC_EC_ygrp-text&gt;Hey,&lt;BR&gt;Anyone have any odd problems in the morning =\r\nwith using it. I am&lt;SPAN class=3DEC_EC_Apple-converted-space&gt;&nbsp;&lt;/SPAN&gt;&lt;=\r\nBR&gt;sitting here checking my email so i just thought i&#39;d turn it on&lt;SPAN cla=\r\nss=3DEC_EC_Apple-converted-space&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;and... not check my email=\r\n. Anywho.... Then right at about 6:20 i&lt;SPAN class=3DEC_EC_Apple-converted-=\r\nspace&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;heard a voice say &quot;Nicholas Etheridge please turn of=\r\nf the dsfnlsd&quot;&lt;SPAN class=3DEC_EC_Apple-converted-space&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;no=\r\nt quite sure what word it used... possibly portal. I just thought&lt;SPAN clas=\r\ns=3DEC_EC_Apple-converted-space&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;it was weird. Also under a=\r\nll of the jumble and this voice speaking i&lt;SPAN class=3DEC_EC_Apple-convert=\r\ned-space&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;heard a deep male voice almost chanting &quot;seven&quot;. =\r\nNot sure if I&lt;SPAN class=3DEC_EC_Apple-converted-space&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;act=\r\nually heard this or its the want to have an excuse to stay home&lt;SPAN class=\r\n=3DEC_EC_Apple-converted-space&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;and not take the HSAs.&lt;BR&gt;&lt;=\r\nBR&gt;Anyway.. just curious if anyone has gotten heard this or if they know&lt;SP=\r\nAN class=3DEC_EC_Apple-converted-space&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;something I don&#39;t a=\r\nbout using the box in the morning.&lt;BR&gt;&lt;BR&gt;Peace,&lt;BR&gt;Nick&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;SPAN=\r\n style=3D&quot;COLOR: white&quot;&gt;&lt;/SPAN&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;\n&lt;HR&gt;\nGet the p=\r\nower of Windows + Web with the new Windows Live.&lt;SPAN class=3DEC_EC_Apple-c=\r\nonverted-space&gt;&nbsp;&lt;/SPAN&gt;&lt;A href=3D&quot;http://www.windowslive.com/?ocid=3DT=\r\nXT_TAGHM_Wave2_powerofwindows_012008&quot; target=3D_blank&gt;Get it now!&lt;/A&gt; \n&lt;DIV=\r\n&gt;&lt;BR class=3DEC_EC_khtml-block-placeholder&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;SPAN style=3D&quot;COLOR=\r\n: white&quot;&gt;&lt;/SPAN&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/SPAN&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;SPAN s=\r\ntyle=3D&quot;COLOR: white&quot;&gt;&lt;/SPAN&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;\n&lt;HR&gt;\nPut your fr=\r\niends on the big screen with Windows Vista=AE + Windows Live=99.&lt;SPAN class=\r\n=3DEC_Apple-converted-space&gt;&nbsp;&lt;/SPAN&gt;&lt;A href=3D&quot;http://www.microsoft.co=\r\nm/windows/shop/specialoffers.mspx?ocid=3DTXT_TAGLM_CPC_MediaCtr_bigscreen_0=\r\n12008&quot; target=3D_blank&gt;Start now!&lt;/A&gt; \n&lt;DIV&gt;&lt;BR class=3DEC_khtml-block-plac=\r\neholder&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;SPAN style=3D&quot;COLOR: white&quot;&gt;&lt;/SPAN&gt;&lt;/SPAN&gt;&lt;/DIV&gt;&lt;/DIV&gt;=\r\n&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;BR&gt;&lt;/DIV&gt;&lt;SPAN style=3D&quot;COLOR: white&quot;&gt;&lt;/SPAN=\r\n&gt; \n&lt;STYLE&gt;\n.ExternalClass #EC_ygrp-mkp\n{border:1px solid #d8d8d8;font-famil=\r\ny:Arial;padding:0px 14px;}\n.ExternalClass #EC_ygrp-mkp hr\n{border:1px solid=\r\n #d8d8d8;}\n.ExternalClass #EC_ygrp-mkp #EC_hd\n{color:#628c2a;font-size:85%;=\r\nfont-weight:bold;line-height:122%;}\n.ExternalClass #EC_ygrp-mkp #EC_ads\n{ma=\r\nrgin-bottom:10px;}\n.ExternalClass #EC_ygrp-mkp .EC_ad\n{padding:0 0;}\n.Exter=\r\nnalClass #EC_ygrp-mkp .EC_ad a\n{color:#0000ff;text-decoration:none;}\n\n&lt;/STY=\r\nLE&gt;\n\n&lt;STYLE&gt;\n.ExternalClass #EC_ygrp-sponsor #EC_ygrp-lc\n{font-family:Arial=\r\n;}\n.ExternalClass #EC_ygrp-sponsor #EC_ygrp-lc #EC_hd\n{font-weight:bold;fon=\r\nt-size:78%;line-height:122%;}\n.ExternalClass #EC_ygrp-sponsor #EC_ygrp-lc .=\r\nEC_ad\n{margin-bottom:10px;padding:0 0;}\n\n&lt;/STYLE&gt;\n\n&lt;STYLE&gt;\n.ExternalClass #=\r\nEC_ygrp-mlmsg\n{font-size:13px;font-family:arial,helvetica,clean,sans-serif;=\r\n}\n.ExternalClass #EC_ygrp-mlmsg table\n{font-size:inherit;font:100%;}\n.Exter=\r\nnalClass #EC_ygrp-mlmsg select, .ExternalClass input, .ExternalClass textar=\r\nea\n{font:99% arial,helvetica,clean,sans-serif;}\n.ExternalClass #EC_ygrp-mlm=\r\nsg pre, .ExternalClass code\n{font:115% monospace;}\n.ExternalClass #EC_ygrp-=\r\nmlmsg EC_*\n{line-height:1.22em;}\n.ExternalClass #EC_ygrp-text\n{font-family:=\r\nGeorgia;}\n.ExternalClass #EC_ygrp-text p\n{;}\n.ExternalClass #EC_ygrp-tpmsgs=\r\n\n{font-family:Arial;clear:both;}\n.ExternalClass #EC_ygrp-vitnav\n{padding-to=\r\np:10px;font-family:Verdana;font-size:77%;}\n.ExternalClass #EC_ygrp-vitnav a=\r\n\n{padding:0 1px;}\n.ExternalClass #EC_ygrp-actbar\n{clear:both;white-space:no=\r\nwrap;color:#666;text-align:right;}\n.ExternalClass #EC_ygrp-actbar .EC_left\n=\r\n{float:left;white-space:nowrap;}\n.ExternalClass .EC_bld\n{font-weight:bold;}=\r\n\n.ExternalClass #EC_ygrp-grft\n{font-family:Verdana;font-size:77%;padding:15=\r\npx 0;}\n.ExternalClass #EC_ygrp-ft\n{font-family:verdana;font-size:77%;border=\r\n-top:1px solid #666;padding:5px 0;}\n.ExternalClass #EC_ygrp-mlmsg #EC_logo\n=\r\n{padding-bottom:10px;}\n.ExternalClass #EC_ygrp-vital\n{background-color:#e0e=\r\ncee;margin-bottom:20px;padding:2px 0 8px 8px;}\n.ExternalClass #EC_ygrp-vita=\r\nl #EC_vithd\n{font-size:77%;font-family:Verdana;font-weight:bold;color:#333;=\r\ntext-transform:uppercase;}\n.ExternalClass #EC_ygrp-vital ul\n{padding:0;}\n.E=\r\nxternalClass #EC_ygrp-vital ul li\n{list-style-type:none;clear:both;border:1=\r\npx solid #e0ecee;}\n.ExternalClass #EC_ygrp-vital ul li .EC_ct\n{font-weight:=\r\nbold;color:#ff7900;float:right;width:2em;text-align:right;padding-right:.5e=\r\nm;}\n.ExternalClass #EC_ygrp-vital ul li .EC_cat\n{font-weight:bold;}\n.Extern=\r\nalClass #EC_ygrp-vital a\n{text-decoration:none;}\n.ExternalClass #EC_ygrp-vi=\r\ntal a:hover\n{text-decoration:underline;}\n.ExternalClass #EC_ygrp-sponsor #E=\r\nC_hd\n{color:#999;font-size:77%;}\n.ExternalClass #EC_ygrp-sponsor #EC_ov\n{pa=\r\ndding:6px 13px;background-color:#e0ecee;margin-bottom:20px;}\n.ExternalClass=\r\n #EC_ygrp-sponsor #EC_ov ul\n{padding:0 0 0 8px;}\n.ExternalClass #EC_ygrp-sp=\r\nonsor #EC_ov li\n{list-style-type:square;padding:6px 0;font-size:77%;}\n.Exte=\r\nrnalClass #EC_ygrp-sponsor #EC_ov li a\n{text-decoration:none;font-size:130%=\r\n;}\n.ExternalClass #EC_ygrp-sponsor #EC_nc\n{background-color:#eee;margin-bot=\r\ntom:20px;padding:0 8px;}\n.ExternalClass #EC_ygrp-sponsor .EC_ad\n{padding:8p=\r\nx 0;}\n.ExternalClass #EC_ygrp-sponsor .EC_ad #EC_hd1\n{font-family:Arial;fon=\r\nt-weight:bold;color:#628c2a;font-size:100%;line-height:122%;}\n.ExternalClas=\r\ns #EC_ygrp-sponsor .EC_ad a\n{text-decoration:none;}\n.ExternalClass #EC_ygrp=\r\n-sponsor .EC_ad a:hover\n{text-decoration:underline;}\n.ExternalClass #EC_ygr=\r\np-sponsor .EC_ad p\n{;}\n.ExternalClass EC_o\n{font-size:0;}\n.ExternalClass .E=\r\nC_MsoNormal\n{;}\n.ExternalClass #EC_ygrp-text tt\n{font-size:120%;}\n.External=\r\nClass blockquote\n{;}\n.ExternalClass .EC_replbq\n{;}\n\n&lt;/STYLE&gt;\n&lt;/BLOCKQUOTE&gt;&lt;=\r\nbr /&gt;&lt;hr /&gt;Share life as it happens with the new Windows Live. &lt;a href=3D&#39;h=\r\nttp://www.windowslive.com/share.html?ocid=3DTXT_TAGHM_Wave2_sharelife_01200=\r\n8&#39; target=3D&#39;_new&#39;&gt;Start sharing!&lt;/a&gt;&lt;/body&gt;\n&lt;/html&gt;\r\n--_b15239c0-5a49-4795-bda9-7dc7c6329422_--"}