{"id": "5514", "subject": "Re: [EVP-ITC] Question ..", "author": "Lisby", "timestamp": "2008-01-15T02:24:11Z", "full_text": "Debbie--right now, I have to say that I think a lot of us here-- \nBruce, me, Frank S., Steve H., and lots of others--are all  \ncommunicating with at least some common entities. More people have  \nheard the name/number &quot;Seven&quot; than is statistically conceivable. An  \nentity called Lisa seems to visit at least three of us. I&#39;m getting  \nthe name David, which seems to have a connection to others on this  \nlist. And I hear Frank S.&#39;s people calling &quot;Purple&quot; an astounding  \nnumber of times every time I do a session.\n\nWhat&#39;s happening right now is very interesting. Which is why my ears  \nperked up when someone--can&#39;t recall who off the top of my head right  \nnow (sorry)--posted a message containing &quot;Big Circle,&quot; which I  \nrecognize as a group of AA-EVP researchers with which you and I are  \nboth familiar.\n\nI think this development is both astounding and fascinating and  \nthrilling.\n\nI know it doesn&#39;t exactly answer your question, but it is food for  \nthought.\n\nDebbie--can either post that astounding clip from your site (the one  \nwith them exclaiming &quot;Who is that?&quot; when they hear you and &quot;That&#39;s  \nfabulous!&quot; after you answer) or post the URL. To me, that clip is the  \nepitome of two-communication.\n\nAnn\n\nOn Jan 14, 2008, at 6:51 PM, misujoey wrote:\n\n&gt; Does anyone find that each &quot;Box&quot; has a different group of people\n&gt; speaking and helping?\n&gt;\n&gt; I&#39;ve swept &quot;Manually&quot;, used the &quot;MiniBox&quot; and the &quot;SuperBox&quot; and there\n&gt; seems to be a different set of people on each device.\n&gt;\n&gt; Thanks,\n&gt;\n&gt; Debbie\n&gt;\n&gt;\n&gt; \n\n\nDebbie-- igh now, I ha e o say ha I hink a lo o us he e--B uce, me, F ank S., S e e H., and lo s o o he s--a e all communica ing wi h a leas some common en i ies. Mo e people ha e hea d he name/numbe \"Se en\" han is s a is ically concei able. An en i y called Lisa seems o isi a leas h ee o us. I'm ge ing he name Da id, which seems o ha e a connec ion o o he s on his lis . And I hea F ank S.'s people calling \"Pu ple\" an as ounding numbe o imes e e y ime I do a session.Wha 's happening igh now is e y in e es ing. Which is why my ea s pe ked up when someone--can' ecall who o he op o my head igh now (so y)--pos ed a message con aining \"Big Ci cle,\" which I ecognize as a g oup o AA-EVP esea che s wi h which you and I a e bo h amilia .I hink his de elopmen is bo h as ounding and ascina ing and h illing.I know i doesn' exac ly answe you ques ion, bu i is ood o hough .Debbie--can ei he pos ha as ounding clip om you si e ( he one wi h hem exclaiming \"Who is ha ?\" when hey hea you and \"Tha 's abulous!\" a e you answe ) o pos he URL. To me, ha clip is he epi ome o wo-communica ion. AnnOn Jan 14, 2008, a 6:51 PM, misujoey w o e:Does anyone ind ha each \"Box\" has a di e en g oup o people speaking and helping?I' e swep \"Manually\", used he \"MiniBox\" and he \"Supe Box\" and he e seems o be a di e en se o people on each de ice. Thanks,Debbie"}