{"id": "5515", "subject": "Re: Question ..", "author": "misujoey", "timestamp": "2008-01-15T02:43:28Z", "full_text": "Hi Ann and Bruce .. Thanks for taking the time to answer .. One more \nquestion .. Do you believe you are speaking to Heaven, Aliens, or \nboth?? Lol ..\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, bruce halliday \n&lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; \n&gt; Hi Debbie,\n&gt;  \n&gt; My experience is that it may or may not be the same entities.\n&gt;  \n&gt; I know that does not answer your question, let me explain.\n&gt; If you are an established researcher with an assigned technician\n&gt; most likely it will predominantly be the same spirit that is \ncommunicating.\n&gt;  \n&gt; There will also be other spirits that will come through with their \nindividual messages of course\n&gt; but your tech/guide will dominate the communication.\n&gt;  \n&gt; There are a couple of reasons you would get different sounding \nspirit communication\n&gt; the first being that at all different times of the day different \nradio stations are broadcasting\n&gt; a myriad of different sounds. The entities trying to communicate \nwill use whatever fragments \n&gt; of sound they need to form the message and the sound signal changes \nfrom second to second.\n&gt;  \n&gt; Thus the different sounding voices. The second reason is each \ndifferent box will produce it&#39;s own unique\n&gt; sound such as the minibox as apposed to the super radio each \nproduce a distinctive sound.\n&gt;  \n&gt; Lastly, if you are new to box research you may not have a permanent \ntech/guide assigned yet and who ever is available\n&gt; at the time of your session will take control of that session. I \nfind that your tech does not bother to seek out recognisable \n&gt; noise fragments to form his or her message until you have developed \na working relationship as well as a personal one with them.\n&gt;  \n&gt; There is no exact explanation for any of this, it is all conjecture \nby the individual researcher but I try to answer any questions based \non my experience.\n&gt;  \n&gt; I hope this answer helps. Please feel free to ask any thing at any \ntime and I&#39;ll do my best to help.\n&gt;  \n&gt; Bruce\n&gt; Bruce Halliday \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: misujoey@...: Mon, 14 Jan 2008 23:51:04 \n+0000Subject: [EVP-ITC] Question ..\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Does anyone find that each &quot;Box&quot; has a different group of people \nspeaking and helping?I&#39;ve swept &quot;Manually&quot;, used the &quot;MiniBox&quot; and \nthe &quot;SuperBox&quot; and there seems to be a different set of people on \neach device. Thanks,Debbie \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Get the power of Windows + Web with the new Windows Live.\n&gt; http://www.windowslive.com?\nocid=TXT_TAGHM_Wave2_powerofwindows_012008\n&gt;"}