{"id": "5516", "subject": "Re: [EVP-ITC] Re: Question ..", "author": "Lisby", "timestamp": "2008-01-15T03:04:53Z", "full_text": "Probably both and then some, Debbie. I&#39;m open to all possibilities.\n\nAnn :)\n\n\nOn Jan 14, 2008, at 9:43 PM, misujoey wrote:\n\n&gt; Hi Ann and Bruce .. Thanks for taking the time to answer .. One more\n&gt; question .. Do you believe you are speaking to Heaven, Aliens, or\n&gt; both?? Lol ..\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, bruce halliday\n&gt; &lt;paranormalinvestigating@...&gt; wrote:\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Hi Debbie,\n&gt; &gt;\n&gt; &gt; My experience is that it may or may not be the same entities.\n&gt; &gt;\n&gt; &gt; I know that does not answer your question, let me explain.\n&gt; &gt; If you are an established researcher with an assigned technician\n&gt; &gt; most likely it will predominantly be the same spirit that is\n&gt; communicating.\n&gt; &gt;\n&gt; &gt; There will also be other spirits that will come through with their\n&gt; individual messages of course\n&gt; &gt; but your tech/guide will dominate the communication.\n&gt; &gt;\n&gt; &gt; There are a couple of reasons you would get different sounding\n&gt; spirit communication\n&gt; &gt; the first being that at all different times of the day different\n&gt; radio stations are broadcasting\n&gt; &gt; a myriad of different sounds. The entities trying to communicate\n&gt; will use whatever fragments\n&gt; &gt; of sound they need to form the message and the sound signal changes\n&gt; from second to second.\n&gt; &gt;\n&gt; &gt; Thus the different sounding voices. The second reason is each\n&gt; different box will produce it&#39;s own unique\n&gt; &gt; sound such as the minibox as apposed to the super radio each\n&gt; produce a distinctive sound.\n&gt; &gt;\n&gt; &gt; Lastly, if you are new to box research you may not have a permanent\n&gt; tech/guide assigned yet and who ever is available\n&gt; &gt; at the time of your session will take control of that session. I\n&gt; find that your tech does not bother to seek out recognisable\n&gt; &gt; noise fragments to form his or her message until you have developed\n&gt; a working relationship as well as a personal one with them.\n&gt; &gt;\n&gt; &gt; There is no exact explanation for any of this, it is all conjecture\n&gt; by the individual researcher but I try to answer any questions based\n&gt; on my experience.\n&gt; &gt;\n&gt; &gt; I hope this answer helps. Please feel free to ask any thing at any\n&gt; time and I&#39;ll do my best to help.\n&gt; &gt;\n&gt; &gt; Bruce\n&gt; &gt; Bruce Halliday\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; To: EVP-ITC@...: misujoey@...: Mon, 14 Jan 2008 23:51:04\n&gt; +0000Subject: [EVP-ITC] Question ..\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Does anyone find that each &quot;Box&quot; has a different group of people\n&gt; speaking and helping?I&#39;ve swept &quot;Manually&quot;, used the &quot;MiniBox&quot; and\n&gt; the &quot;SuperBox&quot; and there seems to be a different set of people on\n&gt; each device. Thanks,Debbie\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; __________________________________________________________\n&gt; &gt; Get the power of Windows + Web with the new Windows Live.\n&gt; &gt; http://www.windowslive.com?\n&gt; ocid=TXT_TAGHM_Wave2_powerofwindows_012008\n&gt; &gt;\n&gt;\n&gt;\n&gt; \n\n\nP obably bo h and hen some, Debbie. I'm open o all possibili ies.Ann :)On Jan 14, 2008, a 9:43 PM, misujoey w o e:Hi Ann and B uce .. Thanks o aking he ime o answe .. One mo e ques ion .. Do you belie e you a e speaking o Hea en, Aliens, o  bo h?? Lol ..--- In EVP-ITC@yahoog oups.com, b uce halliday a ing@...> w o e:>> > Hi Debbie,> > My expe ience is ha i may o may no be he same en i ies.> > I know ha does no answe you ques ion, le me explain.> I you a e an es ablished esea che wi h an assigned echnician> mos likely i will p edominan ly be he same spi i ha is communica ing.> > The e will also be o he spi i s ha will come h ough wi h hei  indi idual messages o cou se> bu you ech/guide will domina e he communica ion.> > The e a e a couple o easons you would ge di e en sounding spi i communica ion> he i s being ha a all di e en imes o he day di e en   adio s a ions a e b oadcas ing> a my iad o di e en sounds. The en i ies ying o communica e will use wha e e agmen s > o sound hey need o o m he message and he sound signal changes  om second o second.> > Thus he di e en sounding oices. The second eason is each di e en box will p oduce i 's own unique> sound such as he minibox as apposed o he supe adio each p oduce a dis inc i e sound.> > Las ly, i you a e new o box esea ch you may no ha e a pe manen   ech/guide assigned ye and who e e is a ailable> a he ime o you session will ake con ol o ha session. I  ind ha you ech does no bo he o seek ou ecognisable > noise agmen s o o m his o he message un il you ha e de eloped a wo king ela ionship as well as a pe sonal one wi h hem.> > The e is no exac explana ion o any o his, i is all conjec u e by he indi idual esea che bu I y o answe any ques ions based on my expe ience.> > I hope his answe helps. Please eel ee o ask any hing a any  ime and I'll do my bes o help.> > B uce> B uce Halliday > > > To: EVP-ITC@...: misujoey@...: Mon, 14 Jan 2008 23:51:04 +0000Subjec : [EVP-ITC] Ques ion ..> > > > > Does anyone ind ha each \"Box\" has a di e en g oup o people speaking and helping?I' e swep \"Manually\", used he \"MiniBox\" and  he \"Supe Box\" and he e seems o be a di e en se o people on each de ice. Thanks,Debbie > > > > > > > __________________________________________________________> Ge he powe o Windows + Web wi h he new Windows Li e.> h p://www.windowsli e.com?ocid=TXT_TAGHM_Wa e2_powe o windows_012008>"}