{"id": "553", "subject": "Re: A few evp&#39;s from today", "author": "instrumental_transcommunication", "timestamp": "2006-08-30T13:58:55Z", "full_text": "--- In EVP-ITC@yahoogroups.com, Misty Dawn &lt;bulletbabea@...&gt; wrote:\n&gt;\n&gt; Here are a few from the sessions I did today. Some involved \nmusical background noise hubby had playin loud (spirit in the sky \nwas the song so I pressed record to see what I&#39;d get LOL) then later \ndid a session with the usual water/fan bg noise.\n&gt;    \n&gt;   All in all I pulled out 34 or so evp&#39;s. Some were pretty clear \nfor me, some were fuzzy as usual. It was a pretty good connection, I \nasked questions and they answered. Not going to post what I asked, \nnor am I going to post all the answers I got but I will share some \nof what came thru.\n&gt;    \n&gt;   Theres even one directed at you evp listeners.. for those who \ncan hear it. They sound alot better in wav format, mp3 is smaller in \nfile size but it does lose some clarity sometimes.\n&gt;    \n&gt;   I had to laugh at the be silent one... I usually ask questions \nin my head but today I started a session off talking aloud. \nSomething I dont usually do because it opens the door for all to \nhear and reply. Luckily I only had 2 strays pop in, but all one had \nto say was &quot;i invented the electric current&quot; and &quot;im passed away&quot; it \nwas a little strange LOL and left me rackin my brain trying to \nfigure out who it was because theres several scientists who I could \nfit into that category. Whether it was a partycrasher or the real \nthing...I have no clue. \n&gt;    \n&gt;   There was also someone talking about &quot;im not able to do the \naccent&quot; and then the guide saying to them &quot;thats fine ok keep \nmoving&quot; then he says &quot;i used to have a touch of an english accent, \npretty good i hope&quot; \n&gt;    \n&gt;   LOL\n&gt;    \n&gt;   I may post those later if anyone wants to hear them they are a \nlittle fuzzy on some words.\n&gt;    \n&gt;    \n&gt;    \n&gt;   Misty\n&gt; \n&gt;  \t\t\n&gt; ---------------------------------\n&gt; Talk is cheap. Use Yahoo! Messenger to make PC-to-Phone calls.  \nGreat rates starting at 1/min.\n&gt;\n\nHi Misty,\nI just switched my acct over to receive email from this group in my \nemail inbox. Sorry for the inconvenience, but could you re-post what \nyou feel is the best evp from your most recent batch for me to hear? \nBy the way, this is my first post here. Joined up a couple of weeks \nago but didn&#39;t have the time until now to post anything here. Found \nthis group after doing a search for ITC groups... thanks :)"}