{"id": "5553", "subject": "Re: [EVP-ITC] Re: PROTECTION RITUAL FILE POSTED", "author": "Carol B.", "timestamp": "2008-01-15T22:41:49Z", "full_text": "Robin...\nI never use protection...and have had a problem with a spirit that came\nhome with us from Waverly.  He&#39;s gone now, with the help of a great\nindividual.  I have evp&#39;s of this entity saying horrible things.  I think\nI may start using protection now...\n\nCarol B.\n\n\n\n\n\n\n\n\n&gt; As someone who has never used a protection ritual (even though I consider\n&gt; myself a very spiritual person), I&#39;m not sure I understand what the ritual\n&gt; is intended to protect the person invoking it from.  I&#39;m not being a smart\n&gt; ass; I&#39;m simply trying to learn.  Can we be hurt physically or psychically\n&gt; by certain spirits, or can our experimentation open a dark portal that&#39;s\n&gt; not meant to be opened?  My instinct has always been that if I don&#39;t\n&gt; acknowledge evil it can have no power over me, but perhaps that&#39;s\n&gt; ignorant.  I once invited spirits into my house from outside and\n&gt; immediately recorded a negative EVP while heating a cup of coffee in the\n&gt; microwave.  I was too ecstatic to be frightened by the message, but since\n&gt; then I&#39;ve wondered what kind of spirit would want to say such a thing to\n&gt; me and if I should be more cautious in the future.  I would love some\n&gt; feedback on this recording.\n&gt;\n&gt; Robin\n&gt;\n&gt;\n&gt;\n&gt;   ----- Original Message -----\n&gt;   From: Frank Sumption&lt;mailto:franks-boxes@...&gt;\n&gt;   To: EVP-ITC@yahoogroups.com&lt;mailto:EVP-ITC@yahoogroups.com&gt;\n&gt;   Sent: Sunday, January 13, 2008 8:09 PM\n&gt;   Subject: [EVP-ITC] Re: PROTECTION RITUAL FILE POSTED\n&gt;\n&gt;\n&gt;   Bad idea! In my opinion. You just create fear with that crap, and\n&gt;   fear feeds itself. Once again, you will create what you expect to\n&gt;   get. If you use protection BS, you&#39;ll have convinced yourself that\n&gt;   there is something to be affraid of, and so you will tend to creat a\n&gt;   thoughtform to fulfill that expectation.\n&gt;\n&gt;   Frank-S\n&gt;\n&gt;   --- In EVP-ITC@yahoogroups.com&lt;mailto:EVP-ITC%40yahoogroups.com&gt;,\n&gt; &quot;bhali333&quot;\n&gt;   &lt;paranormalinvestigating@...&gt; wrote:\n&gt;   &gt;\n&gt;   &gt; everyone,\n&gt;   &gt;\n&gt;   &gt; I have written up the short protection ritual I use before every\n&gt;   &gt; session, I have been using it for quite a while now and have had no\n&gt;   &gt; problems with dark heads other than the occasional curse word.\n&gt;   &gt;\n&gt;   &gt; I recommend that all researchers experienced and new use this or a\n&gt;   &gt; similar protection ritual before every box session if you are not\n&gt;   &gt; already.\n&gt;   &gt;\n&gt;   &gt; hey it&#39;s better to have it and not need it , than need it and not\n&gt;   have\n&gt;   &gt; it!\n&gt;   &gt;\n&gt;   &gt; I will post it in the files section in a folder marked\n&gt;   &gt; &quot;protection ritual&quot;\n&gt;   &gt;\n&gt;   &gt; Thanks guy&#39;s\n&gt;   &gt;\n&gt;   &gt; Bruce\n&gt;   &gt;\n&gt;\n&gt;\n&gt;\n&gt;"}