{"id": "5558", "subject": "Re: [EVP-ITC] Re: PROTECTION RITUAL FILE POSTED", "author": "Debbie Tejada", "timestamp": "2008-01-15T23:19:59Z", "full_text": "I&#39;ve been with people who do protections and some who don&#39;t and my  \npersonal feeling is that it&#39;s not religion that matters so much as the  \nintention of the person(s) reciting the words. It could be Catholic or  \nHebrew or Hindi or Wiccan, to me it&#39;s the good energy that&#39;s released  \nfor protection. A lot of psychics will try to send a white light for  \nprotection, and to me it&#39;s the same thing as prayer. I spent a little  \ntime with Chip Coffey at the Waverly in August, and he does protection  \nbefore investigating plus others are known to do it after to tell  \nspirits they are not welcome to hitch a ride back home with you.\n\nDeb T\n\n&quot;The only reason for time is so that everything doesn&#39;t happen at  \nonce. &quot;  ~Albert Einstein\n\nOn Jan 15, 2008, at 3:41 PM, Carol B. wrote:\n\n&gt; Robin...\n&gt; I never use protection...and have had a problem with a spirit that  \n&gt; came\n&gt; home with us from Waverly. He&#39;s gone now, with the help of a great\n&gt; individual. I have evp&#39;s of this entity saying horrible things. I  \n&gt; think\n&gt; I may start using protection now...\n&gt;\n&gt; Carol B.\n&gt;\n&gt; &gt; As someone who has never used a protection ritual (even though I  \n&gt; consider\n&gt; &gt; myself a very spiritual person), I&#39;m not sure I understand what  \n&gt; the ritual\n&gt; &gt; is intended to protect the person invoking it from. I&#39;m not being  \n&gt; a smart\n&gt; &gt; ass; I&#39;m simply trying to learn. Can we be hurt physically or  \n&gt; psychically\n&gt; &gt; by certain spirits, or can our experimentation open a dark portal  \n&gt; that&#39;s\n&gt; &gt; not meant to be opened? My instinct has always been that if I don&#39;t\n&gt; &gt; acknowledge evil it can have no power over me, but perhaps that&#39;s\n&gt; &gt; ignorant. I once invited spirits into my house from outside and\n&gt; &gt; immediately recorded a negative EVP while heating a cup of coffee  \n&gt; in the\n&gt; &gt; microwave. I was too ecstatic to be frightened by the message, but  \n&gt; since\n&gt; &gt; then I&#39;ve wondered what kind of spirit would want to say such a  \n&gt; thing to\n&gt; &gt; me and if I should be more cautious in the future. I would love some\n&gt; &gt; feedback on this recording.\n&gt; &gt;\n&gt; &gt; Robin\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; ----- Original Message -----\n&gt; &gt; From: Frank Sumption&lt;mailto:franks-boxes@...&gt;\n&gt; &gt; To: EVP-ITC@yahoogroups.com&lt;mailto:EVP-ITC@yahoogroups.com&gt;\n&gt; &gt; Sent: Sunday, January 13, 2008 8:09 PM\n&gt; &gt; Subject: [EVP-ITC] Re: PROTECTION RITUAL FILE POSTED\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Bad idea! In my opinion. You just create fear with that crap, and\n&gt; &gt; fear feeds itself. Once again, you will create what you expect to\n&gt; &gt; get. If you use protection BS, you&#39;ll have convinced yourself that\n&gt; &gt; there is something to be affraid of, and so you will tend to creat a\n&gt; &gt; thoughtform to fulfill that expectation.\n&gt; &gt;\n&gt; &gt; Frank-S\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com&lt;mailto:EVP-ITC%40yahoogroups.com&gt;,\n&gt; &gt; &quot;bhali333&quot;\n&gt; &gt; &lt;paranormalinvestigating@...&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; everyone,\n&gt; &gt; &gt;\n&gt; &gt; &gt; I have written up the short protection ritual I use before every\n&gt; &gt; &gt; session, I have been using it for quite a while now and have had  \n&gt; no\n&gt; &gt; &gt; problems with dark heads other than the occasional curse word.\n&gt; &gt; &gt;\n&gt; &gt; &gt; I recommend that all researchers experienced and new use this or a\n&gt; &gt; &gt; similar protection ritual before every box session if you are not\n&gt; &gt; &gt; already.\n&gt; &gt; &gt;\n&gt; &gt; &gt; hey it&#39;s better to have it and not need it , than need it and not\n&gt; &gt; have\n&gt; &gt; &gt; it!\n&gt; &gt; &gt;\n&gt; &gt; &gt; I will post it in the files section in a folder marked\n&gt; &gt; &gt; &quot;protection ritual&quot;\n&gt; &gt; &gt;\n&gt; &gt; &gt; Thanks guy&#39;s\n&gt; &gt; &gt;\n&gt; &gt; &gt; Bruce\n&gt; &gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt;\n&gt;\n&gt; \n\n\nI' e been wi h people who do p o ec ions and some who don' and my pe sonal eeling is ha i 's no eligion ha ma e s so much as he in en ion o he pe son(s) eci ing he wo ds. I could be Ca holic o Heb ew o Hindi o Wiccan, o me i 's he good ene gy ha 's eleased o p o ec ion. A lo o psychics will y o send a whi e ligh o p o ec ion, and o me i 's he same hing as p aye . I spen a li le ime wi h Chip Co ey a he Wa e ly in Augus , and he does p o ec ion be o e in es iga ing plus o he s a e known o do i a e o ell spi i s hey a e no welcome o hi ch a ide back home wi h you.Deb T\"The only eason o ime is so ha e e y hing doesn' happen a once. \"  ~Albe Eins ein On Jan 15, 2008, a 3:41 PM, Ca ol B. w o e:Robin...I ne e use p o ec ion...and ha e had a p oblem wi h a spi i ha camehome wi h us om Wa e ly. He's gone now, wi h he help o a g ea indi idual. I ha e e p's o his en i y saying ho ible hings. I hinkI may s a using p o ec ion now...Ca ol B.> As someone who has ne e used a p o ec ion i ual (e en hough I conside > mysel a e y spi i ual pe son), I'm no su e I unde s and wha he i ual> is in ended o p o ec he pe son in oking i om. I'm no being a sma > ass; I'm simply ying o lea n. Can we be hu physically o psychically> by ce ain spi i s, o can ou expe imen a ion open a da k po al ha 's> no mean o be opened? My ins inc has always been ha i I don' > acknowledge e il i can ha e no powe o e me, bu pe haps ha 's> igno an . I once in i ed spi i s in o my house om ou side and> immedia ely eco ded a nega i e EVP while hea ing a cup o co ee in he> mic owa e. I was oo ecs a ic o be igh ened by he message, bu since> hen I' e wonde ed wha kind o spi i would wan o say such a hing o> me and i I should be mo e cau ious in he u u e. I would lo e some> eedback on his eco ding.>> Robin>>>> ----- O iginal Message -----> F om: F ank Sump ion anks-boxes@ho mail.com>> To: EVP-ITC@yahoog oups.comEVP-ITC@yahoog oups.com>> Sen : Sunday, Janua y 13, 2008 8:09 PM> Subjec : [EVP-ITC] Re: PROTECTION RITUAL FILE POSTED>>> Bad idea! In my opinion. You jus c ea e ea wi h ha c ap, and> ea eeds i sel . Once again, you will c ea e wha you expec o> ge . I you use p o ec ion BS, you'll ha e con inced you sel ha > he e is some hing o be a aid o , and so you will end o c ea a> hough o m o ul ill ha expec a ion.>> F ank-S>> --- In EVP-ITC@yahoog oups.commail o:EVP-ITC%40yahoog oups.com>,> \"bhali333\"> a ing@...> w o e:> >> > e e yone,> >> > I ha e w i en up he sho p o ec ion i ual I use be o e e e y> > session, I ha e been using i o qui e a while now and ha e had no> > p oblems wi h da k heads o he han he occasional cu se wo d.> >> > I ecommend ha all esea che s expe ienced and new use his o a> > simila p o ec ion i ual be o e e e y box session i you a e no > > al eady.> >> > hey i 's be e o ha e i and no need i , han need i and no > ha e> > i !> >> > I will pos i in he iles sec ion in a olde ma ked> > \"p o ec ion i ual\"> >> > Thanks guy's> >> > B uce> >>>>>"}