{"id": "558", "subject": "Re: a few evp&#39;s", "author": "instrumental_transcommunication", "timestamp": "2006-08-31T02:07:55Z", "full_text": "--- In EVP-ITC@yahoogroups.com, Misty Dawn &lt;bulletbabea@...&gt; wrote:\n&gt;\n&gt; It&#39;s good to see another like minded researcher. Groups are good \nfor a few reasons.. you can meet other like minded people, you can \nbounce ideas off each other and get inspiration for new ideas, \nperhaps learn a few things and hear things from another perspective.\n&gt;    \n&gt;   Groups are comprised of individuals, and since everyone has \nthier own viewpoint unfortunately sometimes a conflict can arise. It \nis important to move past that and maintain some sort of harmony for \nour own sakes as well as the sake of the work we are doing. \n&gt;    \n&gt;   I&#39;d love to see some of your results, evp and imagery. I am \nalways in the &quot;learning stage&quot; as far as any of this goes. I learn \nsomething new almost every day and its refreshing to talk to others \nwith similar interests doing the same sort of work.\n&gt;    \n&gt;   My purpose for this work is to simply explore, learn, and \nimprove my contact...on both sides of the veil.\n&gt;    \n&gt;   Misty\n&gt; \n&gt; iori ke &lt;instrumental_transcommunication@...&gt; wrote:\n&gt;             Thanks for the evp Misty! Will listen to them in a \nmoment but just sending you this message to let you know that I got \nthem here. I can only listen to a few EVP at a time because after \nthat it seems like some of my own contacts butt in -- ever had that \nhappen to you? I know that sounds inexplicable but I&#39;m hoping this \ngroup will consider that even inexplicable things happen in groups \nthat focus on the well...  inexplicable. :)\n&gt;    \n&gt;   I&#39;ve been experimenting in EVP/ITC for awhile now. I don&#39;t \nbelong to any online forum/group other than this one at this present \ntime but at least for now, I think I would like to give another shot \nat it -- gulp. I&#39;m guessing there are a lot of people like me out \nthere who have been really turned off by all of the shinanigan&#39;s \nthat go on in these online forums/groups but, I read your one post \nabout how important it is that groups should strive for peace and \nharmony as much as humanly possible or else all suffers including \neven each members  contacts with these other &quot;worlds&quot;; or something \nto that effect...\n&gt;   I&#39;m a Survivalist, but I also believe that some of us are in \ncontact with those dimensions occupied by beings of various kinds -- \nperhaps even extraterrestrial -- who knows? though it&#39;s my hunch \nthat most of these other beings are terrestrial yet unseen most of \nthe time except in ITC and alternate states of consciousness -- AND, \nsome of us are better at peering into the rabbit hole than others -- \nthat&#39;s a given. Too bad there are those who have a tough time \naccepting that.  \n&gt;   I do EVP --  and also do ITC with my crappy little webcam. I&#39;ve \nseen your images in your gallery and I&#39;m very impressed by them. In \nfact, I think they are the best I&#39;ve ever seen so far and it&#39;s so \nrefreshing to see that you seem to have no ego issues which is \nremarkable in itself. Lol, I must say, a rarity indeed!\n&gt;    Perhaps this is one of the reasons why &quot;they&quot; are communicating \nto you so clearly as they are: of this I am certain. Keep up the \ngood work! Your research in this field inspires all of us (though \nmost will not admit it -- he,he) and even if we can&#39;t get the same \nkind of results you do, I for one can say that it&#39;s enough for me to \nsee that there are others, such as yourself, who have whatever it \ntakes to get the kind of images thats been granted to you, somehow, \nsomeway -- too bad there aren&#39;t more like you in this field at this \nparticular time but it could be that those who are, are not posting \nthings online and for good reason -- jealousy and envy are very \nPOWERFUL emotions and it&#39;s best to stay as far away as possible from \ngroups that are generating that. I can&#39;t emphasize this more than \nthat at this point in time but I know you already know that. \n&gt;    \n&gt;    \n&gt;    \n&gt;    \n&gt;    \n&gt;    \n&gt;   \n&gt; \n&gt; Misty Dawn &lt;bulletbabea@...&gt; wrote:\n&gt;     Welcome to the group. \n&gt;    \n&gt;   Sure I can repost for you. Deciding on which one to post...well \nthats the hard part LOL since I have had some newer ones that some \nmay find easier to hear.\n&gt;    \n&gt;   Glad to hear you are interested in ITC. It is a fascinating \nsubject. Perhaps you could tell me a little about what got you \ninterested in it or any experiences you have had with it.\n&gt;    \n&gt;   I enjoy both the voice and image aspects of it. During the last \nyear I have probably collected over 1000 sound bits and hundreds of \nimages. I never ask anyone to believe me or any of my evidence, only \nthat they look into it for themselves reguardless of what they think \nof my personal stuff.\n&gt;    \n&gt;   So everyone feel free to share and comment. Feedback is always \ngood, it helps us and it helps &quot;them&quot; too. In the meantime I will \nrepost a couple things for you including a few &quot;welcome&quot; \nintroduction files from them to start/end our sessions. \n&gt;    \n&gt;   Hope you can hear them. Enjoy!\n&gt;    \n&gt;   Misty\n&gt;    \n&gt;    \n&gt;    \n&gt;   Hi Misty,\n&gt; I just switched my acct over to receive email from this group in \nmy \n&gt; email inbox. Sorry for the inconvenience, but could you re-post \nwhat \n&gt; you feel is the best evp from your most recent batch for me to \nhear? \n&gt; By the way, this is my first post here. Joined up a couple of \nweeks \n&gt; ago but didn&#39;t have the time until now to post anything here. \nFound \n&gt; this group after doing a search for ITC groups... thanks :)\n\n\nHi Misty and thanks for your reply and sure, it&#39;s easy enough to say \nthat conflict can arise in group/forums like this but that&#39;s not the \nwhole story as to what I&#39;ve been addressing here. Granted that what \nI&#39;m really talking about is a very, very sensitive topic, I think \nRolf-Dietmar Ehrhardt from the World ITC network put it best. \nUnfortunately, I can&#39;t post the link to the page where he&#39;s \naddressing this issue because of the frame-set layout of that site, \nso I&#39;ve copy pasted that section where he&#39;s specifically addressing \nthis issue of the different kind of ITC researchers there are out \nthere in a very eloquent and very, very gentle manner so as not to \noffend. Below is that section of that page where he&#39;s talking about \nthose different kinds of EVP/ITC researchers out there. It&#39;s my \nbelief, that you fall most definitely in the Systematic Experimenter \ncategory and no matter how much you will try to convince others \notherwise, there&#39;s no doubt in my mind that this is where you are \nright now and most likely will remain in that category -- always. \n\n\nA model for TransCommunication (TC)\nby Rolf-Dietmar Ehrhardt\n\nAfter long-standing study of the phenomena in the EVP field and in \nITC in general, I came to the conclusion that there must be \nprinciples behind the diverse results received by different \nexperimenters. Much and perhaps everything that takes place probably \nhas an explanation. Also in this field the basic principle is valid: \nyou can not create something out of nothing. Nevertheless the \nquestion is: Are there common characteristics for these different \nresults in TransCommunication? I believe it is the resonance between \nsimilar or identical thought structures or states of consciousness \nwhich makes a communication possible. Please bear with me during my \nattempt to set up a verifiable model.\n\nStarting position of the experimenters:\n\nAfter observing the experimenters in the fields of EVP and ITC, I \nbelieve it is reasonable to carry out a certain division into \ndifferent personality types of experimenters. These types \ndistinguish mainly through their experimentation behavior, which is \nalso an expression of their attitudes concerning this phenomenon, \nand they distinguish also in the achieved results and the procedures \nused while experimenting. A typical experimenter might have \nqualities of two or three of these personality types in their own \npersonality make-up.\n\nMourning Experimenter\n\nThis type represents an experimenter who does not permit himself \nother thoughts than those related to the deceased loved one caused \nby the strong emotional attachment to that person. This experimenter \nis strongly focused on his desire to get in contact with that loved \none in spirit.\nIt makes a big difference whether it is love or fear. For example, a \nsurviving wife might fear economic or emotional hardship as a result \nof her husband&#39;s death, or she might fear her own death. If fear \nrepresents the main motive, unpleasant situations can occur. ( \nSee &quot;How can I avoid unpleasant situations&quot;). Experimenters that \nundertake the contact experiment from love and attachment can expect \npleasant results, although it may take time to achieve a contact.\nThis experimenter is mostly very tolerant opposite the results of \nothers and knows that the result depend much on himself. Although he \ndoes not know how the contacts are accomplished he chooses the right \nway: he is focused because of his situation.\nIn the beginning these contacts are mostly of relatively good \nquality, but decrease more and more in quality, duration and \nfrequency, unless this type of experimenter becomes a &quot;systematic \nexperimenter&quot;.\n  \n\nSpontaneous or Impulsive Experimenter\n\nThis person wants to get many good voices, even fragments of \nsentences or words, regardless of the content. He is not interested \nin background information and doesn&#39;t care how, why, why not \ndifferent, which connection is there?\nIf an experimenter of this kind learns that another experimenter \nachieved good voices with a specific device or a device combination, \nhe soon duplicates these devices, buying the necessary equipment to \nreceive these same good voices. In case he has success with these \ndevices only once, he modifies immediately again in order to better \nthe results again. Every preserved signal and voice fragment is \nanalyzed and interpreted, to find any connection with something. He \nspeaks in this case also about &quot;science&quot;, &quot;scientific \napproach&quot;, &quot;critical point of view&quot; and so on.\nThat is the way people act who call other experimenters liars if \nthey achieve good and even better results while approaching the \nwhole matter from another point of view (for example, the spiritual \nway rather than the technical way).\n  \n\nSystematic Experimenter\n\nThis experimenter has studied the relations between spiritual \nconditions and results of the experiments. He has transferred his \nknowledge, earned through experience, into daily experimental work. \nIf these experimenters should still have a surpassingly high \nmediality, highly amazing results are to be achieved then.\nIf this experimenter succeeds, holding his ego in check, he can set \nup remarkable results and (if the reader wants it) also findings for \nmankind.\nThis experimenter is exposed to extreme attacks since the achieved \nresults are put down as fraud, delusion or mischief mostly by other \nones.\nMostly it is envy which leads to these attacks. Because as soon as \nthe voice critics receive the same or similar quality (even it is \nonly a fragment), these are represented immediately as the ultimate \nresults of a new experimentation technique and praised in the \nhighest. The critics act this way although they drop back a short \ntime later again onto the old result state. Because otherwise they \nwould have come much further in quality, duration and frequency of \nvoices. \n\nThese different types of experimenters have existed from the very \nbeginning of the EVP/ITC scene. A tolerance of the other \nexperimenters and their results is practiced rarely. As a matter of \nfact there are also mixed types. Those individuals are possibly \nchanging and evolving from one type to another.\n\nThe mourning experimenter is less interested in the quarrels and \nmore interested in reassurance that there is life/existence after \nphysical death.\n\nThe systematic experimenter with his mostly overriding results \nwithdraws after sad experiences and gives insight into the results \nof his contacts to at best a small group of people.\n\nThe experimenter acting spontaneously is interested mostly in \nfinding out who has voices recorded so that he can test also \nsomething new as quickly as possible.\n\n--------------------------------------------------------------"}