{"id": "5604", "subject": "Re: [EVP-ITC] Re: Discussion on protection", "author": "lisby@earthlink.net", "timestamp": "2008-01-16T15:16:48Z", "full_text": "body{ on - amily: Gene a,A ial,Hel e ica,sans-se i ; on -size:9p ;backg ound-colo : # ;colo : black;}\n\n\n\n\n\nBingo, Rosema y. :)-----O iginal Message-----\nF om: osema y_guiley \nSen : Jan 16, 2008 8:46 AM\nTo: EVP-ITC@yahoog oups.com\nSubjec : [EVP-ITC] Re: Discussion on p o ec ion\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n I ag ee abou people who a e ull o ea . I see his all he ime in\npeople who come o haun ed weekends and in es iga ions. Usually he\nones who a e o e come, o who go home wi h a achmen s, came wi h a\nlo o buil -in ea abou he pa ano mal in gene al. These people\nshould no be in es iga ing, and de ini ely should no be seeking\ncommunica ion in e aces.\n\nBes \nRosema y\n\n--- In EVP-ITC@yahoog oups.com, \"LC Dupla \" > w o e:\n>\n> Rosema y,\n> \n> I hink i is good o y and \"disconnec \" om he physical wo ld \n> h ough medi a ion, as ha is whe e we will hea di ec ion wi hin. \n> Fo me, i comes as hough s...a \"knowing.\" This is how I hea hose \n> who a e speaking o me as o di ec ion ega ding my wo k. They ha e \n> been doing so o a long ime, so I ha e no ea o whe e I am \n> heading - e en wi h his. I ealize i is di e en o each \n> indi idual.\n> \n> Pe sonally, I hink i someone is ull o ea , hey shouldn' be \n> in es iga ing ghos s, e c. Find wha keeps you ou o ea and oll \n> wi h i ...\n> \n> LC\n> h p://www.AngelsGhos s.com\n> \n> \n> --- In EVP-ITC@yahoog oups.com, \" osema y_guiley\" \n> w o e:\n> >\n> > I hink i 's good o ai di e se opinions on whe he o no \n> p o ec ion\n> > measu es a e ad isable. I ag ee ha i 's a ma e o pe sonal\n> > p e e ence, and I hink esea che s need o expe imen o ind hei \n> > own op imum com o /pe o mance le els. Wha wo ks o some will \n> no \n> > o o he s. \n> > \n> > Pe sonally, I ind ha an o e all, daily app oach o \n> > p aye /medi a ion conce ning all o my pe sonal and p o essional\n> > endea o s is he mos e ec i e o me. I don' do i o keep \n> hings\n> > ou , bu o y o s ay o ien ed on he mos posi i e ack. Wo ds,\n> > hough s and objec s ha e all been demons a ed uni e sally o be\n> > ools o spi i ual powe . Why no use hem i i eels app op ia e?\n> > \n> > One o he bes hings we can do is sha e \"he e's wha wo ks o me\"\n> > and le o he s y i o see o hemsel es.\n> > \n> > Thanks, e e yone,\n> > Rosema y\n> >\n>"}