{"id": "5612", "subject": "this damned protection debate", "author": "bhali333", "timestamp": "2008-01-16T16:06:47Z", "full_text": "I swore I would not get wraped up in this debate\n\n\n\nBUT!\n\n\n\nThe reason I came up with this whole protection ritual was that some \nof the new researchers where\n\nexpressing a rational concern for negative responces that they were \nrecieving through thier boxes.\n\n\n\nThe short protection ritual that I posted is not meant to quell \nirrational histerical fear, and I agree\n\nwith rosemary that anyone suffering from such fear should rethink \nthier involment in the paranormal research field.\n\n\n\nthat being said, It was only meant as a source of subliminal comfort \nto those new individuals that had never \n\nexpperienced spiritual negativity. And to help ease them into \naproaching a session eventually with confidence\n\nand determination as well as full curiousity for all types of the \ncommunication we recieve.\n\n\n\nMy initial post of the ritual file was done with the best of \nintentions and meant to be another tool available for those who felt \n\nthey needed or wanted to employ it. it is a simple innocent prayer \nritual, I don&#39;t think it is really worthy of all this debate.\n\n\n\nUse it, don&#39;t use it. It&#39;s there if you want it. Also I must say \nthere are two kinds of fear the kind that is natural and a god \n\ngiven emotion for self preservation, ie the fright and flight reflex \nthat is an instinctive trait in all of us. Then you have the \n\nirrational dibilitating phobic fear that can turn an individual into \na frozen statue. That type of fear I believe is unhealthy\n\nand should be addressed and dealt with and learned how to harness. I \nalso believe that anyone that harbors that type of fear \n\nwould not be drawn to the paranormal anyway and in a case of such \nfear it would already be present and doing a small protection \n\nritual would not fuel it any further. So lets take it for what it is, \nsomething to utilize in our box of tools like an emf meter.\n\n\n\nyou may have an old rusty odd sized wrench at the bottom of your tool \nbox at home that you inherited from your grandfather and have never \nused\n\nbut if you come across that odd nut that needs tightening somedsy you \nwill be glad you have it.\n\n\n\nBruce"}