{"id": "5664", "subject": "Re: Here&#39;s a twist--they ask me a question!", "author": "Frank Sumption", "timestamp": "2008-01-18T04:50:33Z", "full_text": "That is her name, and that&#39;s what they called me at first (&quot;Kiera, \nit&#39;s time to come home&quot; in 2002). When I asked via EVPmaker back in \n2002, they she was their Princess. Then they called me Purple, and \nPurple Princess. That pretty much started with one of the first \nboxes, and cowboy like voice &quot;Well! It&#39;s Gull darn Purple Princess!&quot; \nFrom then on, they insist I&#39;m that person, even if I try to tell them \nthey are full of BS--or blind. \n\n Most people seem to refuse to follow the instructions with EVPmaker, \nuse regular speech as the raw, and adjust the settings for best \nresults. It&#39;s mind numbing to hear the various ways the program is \nadulterated in it&#39;s use. I have yet to meet anyone that used it like \nit was intended. \n\n\n Frank-S\n\n\n--- In EVP-ITC@yahoogroups.com, bruce halliday \n&lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; \n&gt; Frank,\n&gt;  \n&gt; Right on the money.\n&gt; Evp maker works better for you than it ever did for me.\n&gt;  \n&gt; They refer to kiera quite often, maybe that is the actual name of \nthe \n&gt; Purple princess?\n&gt;  \n&gt; bruce\n&gt; Bruce Halliday \n&gt; \n&gt; \n&gt; To: evp-itc@...: franks-boxes@...: Wed, 16 Jan 2008 08:42:56 -\n0700Subject: [EVP-ITC] Here&#39;s a twist--they ask me a question!\n&gt; \n&gt; \n&gt; \n&gt; \n&gt;  This is a first, as far as I can remember. I don&#39;t know who Vergi \nis, at least on this level, it&#39;s more likely this amnesia that we all \nsuffer from on this level. I like EVPmaker cuz you tend to get higher \nlevels.   When EVPmaker works, it puts everything else to shame.    \nFrank-S .\n&gt; \n&gt; Make distant family not so distant with Windows Vista + Windows \nLive. Start now! \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Put your friends on the big screen with Windows Vista + Windows \nLive.\n&gt; http://www.microsoft.com/windows/shop/specialoffers.mspx?\nocid=TXT_TAGLM_CPC_MediaCtr_bigscreen_012008\n&gt;"}