{"id": "5685", "subject": "Re: this damned protection debate--LOL!  It&#39;s not debate, it&#39;s discussion...", "author": "LC Duplatt", "timestamp": "2008-01-18T18:52:28Z", "full_text": "Thanks, Robin...  ;)\n\nLC\n\n--- In EVP-ITC@yahoogroups.com, &quot;Robin Searcy Henson&quot; \n&lt;MudPuddleFarm@...&gt; wrote:\n&gt;\n&gt; LC, that was beautifully stated, and you are so RIGHT.\n&gt; \n&gt; Robin\n&gt; \n&gt; \n&gt;   ----- Original Message ----- \n&gt;   From: LC Duplatt&lt;mailto:lcdupla@...&gt; \n&gt;   To: EVP-ITC@yahoogroups.com&lt;mailto:EVP-ITC@yahoogroups.com&gt; \n&gt;   Sent: Friday, January 18, 2008 4:35 AM\n&gt;   Subject: [EVP-ITC] Re: this damned protection debate--LOL! It&#39;s \nnot debate, it&#39;s discussion...\n&gt; \n&gt; \n&gt;   Robin:\n&gt; \n&gt;   From my perspective your first sentence is key in summing up the \n&gt;   various viewpoints from people...the word &quot;believe&quot; stands out. \nYou \n&gt;   posted, &quot;I&#39;m still giving this topic a lot of thought because I \n&gt;   absolutely BELIEVE in the power of prayer, the power of \npositivity, \n&gt;   and the power of ritual.&quot; \n&gt; \n&gt;   Belief... I think whatever works to keep a person from fear is \nthe \n&gt;   ticket. Fear is when we hand power over to something else and \nbecome \n&gt;   its slave. Your post states that you &quot;absolutely believe&quot; - that \nis \n&gt;   your power, mentally used by you to not succumb to fear, and thus \n&gt;   remain in control. ;)\n&gt; \n&gt;   I might further point out that there is something more powerful \nthan \n&gt;   belief in my opinion, and that has been the reason behind my \n&gt;   pursuits. I suggest that what a person KNOWS as truth is even \nbetter \n&gt;   than belief. Truth is eternal and has no opposite.\n&gt; \n&gt;   LC\n&gt;   http://www.AngelsGhosts.com&lt;http://www.angelsghosts.com/&gt;\n&gt; \n&gt;   --- In EVP-ITC@yahoogroups.com&lt;mailto:EVP-ITC%\n40yahoogroups.com&gt;, &quot;Robin Searcy Henson&quot; \n&gt;   &lt;MudPuddleFarm@&gt; wrote:\n&gt;   &gt;\n&gt;   &gt; I&#39;m still giving this topic a lot of thought because I \nabsolutely \n&gt;   believe in the power of prayer, the power of positivity, and the \n&gt;   power of ritual. When I first started recording EVP a couple of \n&gt;   years ago I was warned to expect negative responses, so when it \n&gt;   happened to me I felt elated rather than frightened or \ndistressed. I \n&gt;   will ask again: What physical or psychic harm is a disembodied \n&gt;   entity capable of doing? Please listen to the one EVP I&#39;ve posted \non \n&gt;   this board and tell me what, if anything, you hear. I know what I \n&gt;   hear, and I consider it distinctly threatening; yet, this is the \n&gt;   response that has created the determination in me to continue \n&gt;   researching the unknown. \n&gt;   &gt; \n&gt;   &gt; Bruce, I am in awe of your recordings. I only want to learn as \n&gt;   much as I can from you and the other dedicated researchers on \nthis \n&gt;   board. It never occurred to me to use a protection ritual in the \n&gt;   past, and that&#39;s about all I can say. I will probably use one \nfrom \n&gt;   this point on, maybe not so much to repel evil as to attract \n&gt;   goodness. \n&gt;   &gt; \n&gt;   &gt; So, thank you for this contribution. I think the debate has \nbeen \n&gt;   an excellent one, and I&#39;ve appreciated the opportunity to be \n&gt;   enlightened.\n&gt;   &gt; \n&gt;   &gt; Robin\n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; ----- Original Message ----- \n&gt;   &gt; From: bhali333&lt;mailto:paranormalinvestigating@&gt; \n&gt;   &gt; To: EVP-ITC@yahoogroups.com&lt;mailto:EVP-ITC%\n40yahoogroups.com&gt;&lt;mailto:EVP-ITC@yahoogroups.com&lt;mailto:EVP-ITC%\n40yahoogroups.com&gt;&gt; \n&gt;   &gt; Sent: Wednesday, January 16, 2008 8:06 AM\n&gt;   &gt; Subject: [EVP-ITC] this damned protection debate\n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; I swore I would not get wraped up in this debate\n&gt;   &gt; \n&gt;   &gt; BUT!\n&gt;   &gt; \n&gt;   &gt; The reason I came up with this whole protection ritual was that \n&gt;   some \n&gt;   &gt; of the new researchers where\n&gt;   &gt; \n&gt;   &gt; expressing a rational concern for negative responces that they \n&gt;   were \n&gt;   &gt; recieving through thier boxes.\n&gt;   &gt; \n&gt;   &gt; The short protection ritual that I posted is not meant to quell \n&gt;   &gt; irrational histerical fear, and I agree\n&gt;   &gt; \n&gt;   &gt; with rosemary that anyone suffering from such fear should \nrethink \n&gt;   &gt; thier involment in the paranormal research field.\n&gt;   &gt; \n&gt;   &gt; that being said, It was only meant as a source of subliminal \n&gt;   comfort \n&gt;   &gt; to those new individuals that had never \n&gt;   &gt; \n&gt;   &gt; expperienced spiritual negativity. And to help ease them into \n&gt;   &gt; aproaching a session eventually with confidence\n&gt;   &gt; \n&gt;   &gt; and determination as well as full curiousity for all types of \nthe \n&gt;   &gt; communication we recieve.\n&gt;   &gt; \n&gt;   &gt; My initial post of the ritual file was done with the best of \n&gt;   &gt; intentions and meant to be another tool available for those who \n&gt;   felt \n&gt;   &gt; \n&gt;   &gt; they needed or wanted to employ it. it is a simple innocent \n&gt;   prayer \n&gt;   &gt; ritual, I don&#39;t think it is really worthy of all this debate.\n&gt;   &gt; \n&gt;   &gt; Use it, don&#39;t use it. It&#39;s there if you want it. Also I must \nsay \n&gt;   &gt; there are two kinds of fear the kind that is natural and a god \n&gt;   &gt; \n&gt;   &gt; given emotion for self preservation, ie the fright and flight \n&gt;   reflex \n&gt;   &gt; that is an instinctive trait in all of us. Then you have the \n&gt;   &gt; \n&gt;   &gt; irrational dibilitating phobic fear that can turn an individual \n&gt;   into \n&gt;   &gt; a frozen statue. That type of fear I believe is unhealthy\n&gt;   &gt; \n&gt;   &gt; and should be addressed and dealt with and learned how to \n&gt;   harness. I \n&gt;   &gt; also believe that anyone that harbors that type of fear \n&gt;   &gt; \n&gt;   &gt; would not be drawn to the paranormal anyway and in a case of \nsuch \n&gt;   &gt; fear it would already be present and doing a small protection \n&gt;   &gt; \n&gt;   &gt; ritual would not fuel it any further. So lets take it for what \nit \n&gt;   is, \n&gt;   &gt; something to utilize in our box of tools like an emf meter.\n&gt;   &gt; \n&gt;   &gt; you may have an old rusty odd sized wrench at the bottom of \nyour \n&gt;   tool \n&gt;   &gt; box at home that you inherited from your grandfather and have \n&gt;   never \n&gt;   &gt; used\n&gt;   &gt; \n&gt;   &gt; but if you come across that odd nut that needs tightening \nsomedsy \n&gt;   you \n&gt;   &gt; will be glad you have it.\n&gt;   &gt; \n&gt;   &gt; Bruce\n&gt;   &gt;\n&gt;"}