{"id": "569", "subject": "Re: EVP&#39;s", "author": "instrumental_transcommunication", "timestamp": "2006-11-07T17:22:30Z", "full_text": "Oh.. ok, that&#39;s funny because that explains what those other spirits \non that same recording were talking about. It&#39;s just amazing when can \npick up those conversations they are having between themselves in \nthese recordings sometimes.... but good that your group is keeping \nclose eye on who&#39;s allowed in and who&#39;s not! \n\n--- In EVP-ITC@yahoogroups.com, Misty Dawn &lt;bulletbabea@...&gt; wrote:\n&gt;\n&gt; The undertaker one was pretty clear for everyone I think. Even \nhubby can hear that one. What does it mean? Well for me it meant just \nbecause they are dead doesnt mean they have lost thier senses of \nhumor. He almost got kicked out by the guides for that smarta$$ \nremark until the others came to his defense and said he means no \nharm. A few understood why he said it... they have the same sick \nsense of humor LOL\n&gt;    \n&gt;   Misty\n&gt; \n&gt; instrumental_transcommunication \n&lt;instrumental_transcommunication@...&gt; wrote:\n&gt;           --- In EVP-ITC@yahoogroups.com, Misty Dawn &lt;bulletbabea@&gt; \nwrote:\n&gt; &gt;\n&gt; &gt; Heres a few from a recent session I am sharing with the group. I \n&gt; recently bumped into one of the names they have been mentioning and \nI \n&gt; thought they meant someone who passed. Then I run across someone \nwith \n&gt; the same name who is becoming involved in the ITC field of study. \nSo \n&gt; I asked my group there why they have expressed such an interest in \n&gt; him. Someone (alive) mentioned it&#39;s because he is into studying \n&gt; reverse speech and has trained his ears to hear it. I have to agree \n&gt; he definitely hears things out of my ranges, and his methods \ntotally \n&gt; differ from my own. They only gave me a few clear answers to my \n&gt; question and one of them is the first attached file. Hope you can \n&gt; hear it easily because for me it is very clear. Probably one of the \n&gt; clearest so far. \n&gt; &gt; \n&gt; &gt; The rest of the attachments are other entities who popped in the \n&gt; conversation and some of thier chat was directed at each other. As \n&gt; for the a-hole thing on the last part when it mentioned other \nmouths \n&gt; to talk I had a flashback of Ace Ventura bending over making his \nbutt \n&gt; cheeks talk, I dont know why but I found it funny. \n&gt; &gt; \n&gt; &gt; Yes sometimes they argue amongst themselves, or bump into \n&gt; entities they know and carry on conversations.\n&gt; &gt; \n&gt; &gt; Misty\n&gt; \n&gt; Just heard that undertaker recording of your Misty -- very clear! I \n&gt; wonder what it means? \n&gt; \n&gt; \n&gt; \n&gt;          \n&gt; \n&gt;  \n&gt; ---------------------------------\n&gt; Sponsored Link\n&gt; \n&gt; Mortgage rates near historic lows: $150,000 loan as low as $579/mo. \nIntro-*Terms\n&gt;"}