{"id": "5705", "subject": "Re: this damned protection debate--Bruce", "author": "Frank Sumption", "timestamp": "2008-01-18T23:31:14Z", "full_text": "That sounds all too familar..without naming names. \n\n Frank-S\n\n\n\n--- In EVP-ITC@yahoogroups.com, bruce halliday \n&lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; \n&gt; Robin,\n&gt;  \n&gt; It&#39;s never a good idea to invite any spirits into your home.\n&gt; Some demonic spirits have to be invited in before they can \n&gt; enter, there are instinces where people have heard knocks on thier\n&gt; front door only to answer the door and have no one there.\n&gt; The knocking by an entity and the opening by the physical being \n&gt; symbolises the request to come in and the invitation of the open \ndoor.\n&gt;  \n&gt; If you give out a ready made invitation, it could be like that \nannoying\n&gt; relative that comes to visit and never leaves.\n&gt;  \n&gt; So be very careful whenever summoning any unknown entities.\n&gt;  \n&gt; If you need help with your box research or have any questions\n&gt; don&#39;t hesitate.\n&gt;  \n&gt; Bruce\n&gt; Bruce Halliday \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: MudPuddleFarm@...: Fri, 18 Jan 2008 10:49:53 -\n0800Subject: Re: [EVP-ITC] this damned protection debate--Bruce\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Yes Bruce, &quot;We want to kill you&quot; is word for word what I hear.  \nThank you for being the first person ever to validate this for me, \nbecause now I know it&#39;s REAL, I&#39;m not crazy, and it isn&#39;t my \nimagination.  This was captured on a digital voice recorder while I \nwas heating coffee in the microwave oven nearby, and I felt that the \nmicrowave must have been a powerful energy source for the &quot;speaker.&quot;  \nIt may be important to note that I had just invited spirits inside \nthe house from outside, and that after I listened to this message I \ntold them to go back outside because they were too rude to continue \ntalking to.  I&#39;ve tried to replicate this experiment a number of \ntimes since then (without the verbal invitation into my home) and \nhave had no luck whatsoever.  \n&gt;  \n&gt; Gleefully moving on to box research!\n&gt;  \n&gt; Robin\n&gt;  \n&gt;  \n&gt; \n&gt; ----- Original Message ----- \n&gt; From: bruce halliday \n&gt; To: evp-itc@yahoogroups.com \n&gt; Sent: Friday, January 18, 2008 5:18 AM\n&gt; Subject: RE: [EVP-ITC] this damned protection debate--Bruce\n&gt; \n&gt; \n&gt; Robin, In the evp file you posted I believe I&#39;m hearing &quot;we want to \nkill you&quot;please let me know if that is what you hear. Robin, I am \nglad to hear that the protection ritual will be utilized by you in \nthe purpose it was intended. To give any individual that wants to \nanopportunity to use it. You will find many forms of interaction on \nthis group, running the gamut from total agreement to calm \ndebate /discussion. To full blown arguments.  That is what makes a \ngroup, If everyone followed one single ideology and the ideas of any \nsingle person without questionit would not be a group it would be a \ncult. Welcome to the wonderful world of box research robin, I&#39;m sure \nyou will be a valued member and researcher in this community. Bruce\n&gt; Bruce Halliday \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: MudPuddleFarm@...: Thu, 17 Jan 2008 22:38:57 -\n0800Subject: Re: [EVP-ITC] this damned protection debate--Bruce\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; I&#39;m still giving this topic a lot of thought because I absolutely \nbelieve in the power of prayer, the power of positivity, and the \npower of ritual.  When I first started recording EVP a couple of \nyears ago I was warned to expect negative responses, so when it \nhappened to me I felt elated rather than frightened or distressed.  I \nwill ask again:  What physical or psychic harm is a disembodied \nentity capable of doing?  Please listen to the one EVP I&#39;ve posted on \nthis board and tell me what, if anything, you hear.  I know what I \nhear, and I consider it distinctly threatening; yet, this is the \nresponse that has created the determination in me to continue \nresearching the unknown.  \n&gt;  \n&gt; Bruce, I am in awe of your recordings.  I only want to learn as \nmuch as I can from you and the other dedicated researchers on this \nboard.  It never occurred to me to use a protection ritual in the \npast, and that&#39;s about all I can say.  I will probably use one from \nthis point on, maybe not so much to repel evil as to attract \ngoodness.  \n&gt;  \n&gt; So, thank you for this contribution.  I think the debate has been \nan excellent one, and I&#39;ve appreciated the opportunity to be \nenlightened.\n&gt;  \n&gt; Robin\n&gt;  \n&gt;  \n&gt; \n&gt; ----- Original Message -----  \n&gt; From: bhali333 \n&gt; To: EVP-ITC@yahoogroups.com \n&gt; Sent: Wednesday, January 16, 2008 8:06 AM\n&gt; Subject: [EVP-ITC] this damned protection debate\n&gt; \n&gt; \n&gt; I swore I would not get wraped up in this debateBUT!The reason I \ncame up with this whole protection ritual was that some of the new \nresearchers whereexpressing a rational concern for negative responces \nthat they were recieving through thier boxes.The short protection \nritual that I posted is not meant to quell irrational histerical \nfear, and I agreewith rosemary that anyone suffering from such fear \nshould rethink thier involment in the paranormal research field.that \nbeing said, It was only meant as a source of subliminal comfort to \nthose new individuals that had never expperienced spiritual \nnegativity. And to help ease them into aproaching a session \neventually with confidenceand determination as well as full \ncuriousity for all types of the communication we recieve.My initial \npost of the ritual file was done with the best of intentions and \nmeant to be another tool available for those who felt they needed or \nwanted to employ it. it is a simple innocent prayer ritual, I don&#39;t \nthink it is really worthy of all this debate.Use it, don&#39;t use it. \nIt&#39;s there if you want it. Also I must say there are two kinds of \nfear the kind that is natural and a god given emotion for self \npreservation, ie the fright and flight reflex that is an instinctive \ntrait in all of us. Then you have the irrational dibilitating phobic \nfear that can turn an individual into a frozen statue. That type of \nfear I believe is unhealthyand should be addressed and dealt with and \nlearned how to harness. I also believe that anyone that harbors that \ntype of fear would not be drawn to the paranormal anyway and in a \ncase of such fear it would already be present and doing a small \nprotection ritual would not fuel it any further. So lets take it for \nwhat it is, something to utilize in our box of tools like an emf \nmeter.you may have an old rusty odd sized wrench at the bottom of \nyour tool box at home that you inherited from your grandfather and \nhave never usedbut if you come across that odd nut that needs \ntightening somedsy you will be glad you have it.Bruce\n&gt; \n&gt; Need to know the score, the latest news, or you need your Hotmail-\nget your &quot;fix&quot; Check it out. \n&gt; \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Climb to the top of the charts! Play the word scramble challenge \nwith star power.\n&gt; http://club.live.com/star_shuffle.aspx?\nicid=starshuffle_wlmailtextlink_jan\n&gt;"}