{"id": "5710", "subject": "Re: this damned protection debate--Bruce", "author": "Frank Sumption", "timestamp": "2008-01-18T23:48:32Z", "full_text": "I don&#39;t know, but I tend to doubt it. I used to get all kinds of \ncrap, they even threatened to poison my coffee! I didn&#39;t quit \ndrinking coffee, I just tell them to to bring it. They&#39;ve always \nturned out to be paper tigers--nothin&#39; there. It&#39;s just something \nthat doesn&#39;t want you to wake up. \n\n \n\n Frank-S\n\n&#92; --- In EVP-ITC@yahoogroups.com, &quot;Robin Searcy Henson&quot; \n&lt;MudPuddleFarm@...&gt; wrote:\n&gt;\n&gt; You don&#39;t have to name names.. I remember!  Are they really \ndemonic?  Do you know why they have to receive an invitation before \nthey can enter?  I won&#39;t be so blas in the future.\n&gt; \n&gt; Robin\n&gt; \n&gt; \n&gt;   ----- Original Message ----- \n&gt;   From: Frank Sumption&lt;mailto:franks-boxes@...&gt; \n&gt;   To: EVP-ITC@yahoogroups.com&lt;mailto:EVP-ITC@yahoogroups.com&gt; \n&gt;   Sent: Friday, January 18, 2008 3:31 PM\n&gt;   Subject: [EVP-ITC] Re: this damned protection debate--Bruce\n&gt; \n&gt; \n&gt;   That sounds all too familar..without naming names. \n&gt; \n&gt;   Frank-S\n&gt; \n&gt;   --- In EVP-ITC@yahoogroups.com&lt;mailto:EVP-ITC@yahoogroups.com&gt;, \nbruce halliday \n&gt;   &lt;paranormalinvestigating@&gt; wrote:\n&gt;   &gt;\n&gt;   &gt; \n&gt;   &gt; Robin,\n&gt;   &gt; \n&gt;   &gt; It&#39;s never a good idea to invite any spirits into your home.\n&gt;   &gt; Some demonic spirits have to be invited in before they can \n&gt;   &gt; enter, there are instinces where people have heard knocks on \nthier\n&gt;   &gt; front door only to answer the door and have no one there.\n&gt;   &gt; The knocking by an entity and the opening by the physical being \n&gt;   &gt; symbolises the request to come in and the invitation of the \nopen \n&gt;   door.\n&gt;   &gt; \n&gt;   &gt; If you give out a ready made invitation, it could be like that \n&gt;   annoying\n&gt;   &gt; relative that comes to visit and never leaves.\n&gt;   &gt; \n&gt;   &gt; So be very careful whenever summoning any unknown entities.\n&gt;   &gt; \n&gt;   &gt; If you need help with your box research or have any questions\n&gt;   &gt; don&#39;t hesitate.\n&gt;   &gt; \n&gt;   &gt; Bruce\n&gt;   &gt; Bruce Halliday \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; To: EVP-ITC@: MudPuddleFarm@: Fri, 18 Jan 2008 10:49:53 -\n&gt;   0800Subject: Re: [EVP-ITC] this damned protection debate--Bruce\n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; Yes Bruce, &quot;We want to kill you&quot; is word for word what I hear. \n&gt;   Thank you for being the first person ever to validate this for \nme, \n&gt;   because now I know it&#39;s REAL, I&#39;m not crazy, and it isn&#39;t my \n&gt;   imagination. This was captured on a digital voice recorder while \nI \n&gt;   was heating coffee in the microwave oven nearby, and I felt that \nthe \n&gt;   microwave must have been a powerful energy source for \nthe &quot;speaker.&quot; \n&gt;   It may be important to note that I had just invited spirits \ninside \n&gt;   the house from outside, and that after I listened to this message \nI \n&gt;   told them to go back outside because they were too rude to \ncontinue \n&gt;   talking to. I&#39;ve tried to replicate this experiment a number of \n&gt;   times since then (without the verbal invitation into my home) and \n&gt;   have had no luck whatsoever. \n&gt;   &gt; \n&gt;   &gt; Gleefully moving on to box research!\n&gt;   &gt; \n&gt;   &gt; Robin\n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; ----- Original Message ----- \n&gt;   &gt; From: bruce halliday \n&gt;   &gt; To: evp-itc@yahoogroups.com&lt;mailto:evp-itc%40yahoogroups.com&gt; \n&gt;   &gt; Sent: Friday, January 18, 2008 5:18 AM\n&gt;   &gt; Subject: RE: [EVP-ITC] this damned protection debate--Bruce\n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; Robin, In the evp file you posted I believe I&#39;m hearing &quot;we \nwant to \n&gt;   kill you&quot;please let me know if that is what you hear. Robin, I am \n&gt;   glad to hear that the protection ritual will be utilized by you \nin \n&gt;   the purpose it was intended. To give any individual that wants to \n&gt;   anopportunity to use it. You will find many forms of interaction \non \n&gt;   this group, running the gamut from total agreement to calm \n&gt;   debate /discussion. To full blown arguments. That is what makes a \n&gt;   group, If everyone followed one single ideology and the ideas of \nany \n&gt;   single person without questionit would not be a group it would be \na \n&gt;   cult. Welcome to the wonderful world of box research robin, I&#39;m \nsure \n&gt;   you will be a valued member and researcher in this community. \nBruce\n&gt;   &gt; Bruce Halliday \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; To: EVP-ITC@: MudPuddleFarm@: Thu, 17 Jan 2008 22:38:57 -\n&gt;   0800Subject: Re: [EVP-ITC] this damned protection debate--Bruce\n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; I&#39;m still giving this topic a lot of thought because I \nabsolutely \n&gt;   believe in the power of prayer, the power of positivity, and the \n&gt;   power of ritual. When I first started recording EVP a couple of \n&gt;   years ago I was warned to expect negative responses, so when it \n&gt;   happened to me I felt elated rather than frightened or \ndistressed. I \n&gt;   will ask again: What physical or psychic harm is a disembodied \n&gt;   entity capable of doing? Please listen to the one EVP I&#39;ve posted \non \n&gt;   this board and tell me what, if anything, you hear. I know what I \n&gt;   hear, and I consider it distinctly threatening; yet, this is the \n&gt;   response that has created the determination in me to continue \n&gt;   researching the unknown. \n&gt;   &gt; \n&gt;   &gt; Bruce, I am in awe of your recordings. I only want to learn as \n&gt;   much as I can from you and the other dedicated researchers on \nthis \n&gt;   board. It never occurred to me to use a protection ritual in the \n&gt;   past, and that&#39;s about all I can say. I will probably use one \nfrom \n&gt;   this point on, maybe not so much to repel evil as to attract \n&gt;   goodness. \n&gt;   &gt; \n&gt;   &gt; So, thank you for this contribution. I think the debate has \nbeen \n&gt;   an excellent one, and I&#39;ve appreciated the opportunity to be \n&gt;   enlightened.\n&gt;   &gt; \n&gt;   &gt; Robin\n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; ----- Original Message ----- \n&gt;   &gt; From: bhali333 \n&gt;   &gt; To: EVP-ITC@yahoogroups.com&lt;mailto:EVP-ITC%40yahoogroups.com&gt; \n&gt;   &gt; Sent: Wednesday, January 16, 2008 8:06 AM\n&gt;   &gt; Subject: [EVP-ITC] this damned protection debate\n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; I swore I would not get wraped up in this debateBUT!The reason \nI \n&gt;   came up with this whole protection ritual was that some of the \nnew \n&gt;   researchers whereexpressing a rational concern for negative \nresponces \n&gt;   that they were recieving through thier boxes.The short protection \n&gt;   ritual that I posted is not meant to quell irrational histerical \n&gt;   fear, and I agreewith rosemary that anyone suffering from such \nfear \n&gt;   should rethink thier involment in the paranormal research \nfield.that \n&gt;   being said, It was only meant as a source of subliminal comfort \nto \n&gt;   those new individuals that had never expperienced spiritual \n&gt;   negativity. And to help ease them into aproaching a session \n&gt;   eventually with confidenceand determination as well as full \n&gt;   curiousity for all types of the communication we recieve.My \ninitial \n&gt;   post of the ritual file was done with the best of intentions and \n&gt;   meant to be another tool available for those who felt they needed \nor \n&gt;   wanted to employ it. it is a simple innocent prayer ritual, I \ndon&#39;t \n&gt;   think it is really worthy of all this debate.Use it, don&#39;t use \nit. \n&gt;   It&#39;s there if you want it. Also I must say there are two kinds of \n&gt;   fear the kind that is natural and a god given emotion for self \n&gt;   preservation, ie the fright and flight reflex that is an \ninstinctive \n&gt;   trait in all of us. Then you have the irrational dibilitating \nphobic \n&gt;   fear that can turn an individual into a frozen statue. That type \nof \n&gt;   fear I believe is unhealthyand should be addressed and dealt with \nand \n&gt;   learned how to harness. I also believe that anyone that harbors \nthat \n&gt;   type of fear would not be drawn to the paranormal anyway and in a \n&gt;   case of such fear it would already be present and doing a small \n&gt;   protection ritual would not fuel it any further. So lets take it \nfor \n&gt;   what it is, something to utilize in our box of tools like an emf \n&gt;   meter.you may have an old rusty odd sized wrench at the bottom of \n&gt;   your tool box at home that you inherited from your grandfather \nand \n&gt;   have never usedbut if you come across that odd nut that needs \n&gt;   tightening somedsy you will be glad you have it.Bruce\n&gt;   &gt; \n&gt;   &gt; Need to know the score, the latest news, or you need your \nHotmail-\n&gt;   get your &quot;fix&quot; Check it out. \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; __________________________________________________________\n&gt;   &gt; Climb to the top of the charts!  Play the word scramble \nchallenge \n&gt;   with star power.\n&gt;   &gt; http://club.live.com/star_shuffle.aspx?\n&lt;http://club.live.com/star_shuffleaspx?&gt;\n&gt;   icid=starshuffle_wlmailtextlink_jan\n&gt;   &gt;\n&gt;"}