{"id": "5720", "subject": "Re: [EVP-ITC] Re: this damned protection debate--Bruce", "author": "Lisby", "timestamp": "2008-01-19T01:46:34Z", "full_text": "Frank&#39;s comment is germane to my experience as well.\n\nAnn\n\nOn Jan 18, 2008, at 8:29 PM, LC Duplatt wrote:\n\n&gt; FS:\n&gt;\n&gt; Fantastic comment you made: &quot;It&#39;s just something that doesn&#39;t want\n&gt; you to wake up.&quot; That is right on in my opinion...if they can create\n&gt; fear in a person, then they can manipulate that person. Fear is the\n&gt; doorway to losing power and control.\n&gt;\n&gt; Think about the playground bully who takes people&#39;s lunch money until\n&gt; a kid half his size calls his bluff by smacking him in the mouth. ;)\n&gt;\n&gt; LC\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Frank Sumption&quot; &lt;franks-boxes@...&gt;\n&gt; wrote:\n&gt; &gt;\n&gt; &gt; I don&#39;t know, but I tend to doubt it. I used to get all kinds of\n&gt; &gt; crap, they even threatened to poison my coffee! I didn&#39;t quit\n&gt; &gt; drinking coffee, I just tell them to to bring it. They&#39;ve always\n&gt; &gt; turned out to be paper tigers--nothin&#39; there. It&#39;s just something\n&gt; &gt; that doesn&#39;t want you to wake up.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Frank-S\n&gt; &gt;\n&gt; &gt; &#92; --- In EVP-ITC@yahoogroups.com, &quot;Robin Searcy Henson&quot;\n&gt; &gt; &lt;MudPuddleFarm@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; You don&#39;t have to name names.. I remember! Are they really\n&gt; &gt; demonic? Do you know why they have to receive an invitation before\n&gt; &gt; they can enter? I won&#39;t be so blasé in the future.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Robin\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; ----- Original Message -----\n&gt; &gt; &gt; From: Frank Sumption&lt;mailto:franks-boxes@&gt;\n&gt; &gt; &gt; To: EVP-ITC@yahoogroups.com&lt;mailto:EVP-ITC@yahoogroups.com&gt;\n&gt; &gt; &gt; Sent: Friday, January 18, 2008 3:31 PM\n&gt; &gt; &gt; Subject: [EVP-ITC] Re: this damned protection debate--Bruce\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; That sounds all too familar..without naming names.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Frank-S\n&gt; &gt; &gt;\n&gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com&lt;mailto:EVP-ITC@yahoogroups.com&gt;,\n&gt; &gt; bruce halliday\n&gt; &gt; &gt; &lt;paranormalinvestigating@&gt; wrote:\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Robin,\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; It&#39;s never a good idea to invite any spirits into your home.\n&gt; &gt; &gt; &gt; Some demonic spirits have to be invited in before they can\n&gt; &gt; &gt; &gt; enter, there are instinces where people have heard knocks on\n&gt; &gt; thier\n&gt; &gt; &gt; &gt; front door only to answer the door and have no one there.\n&gt; &gt; &gt; &gt; The knocking by an entity and the opening by the physical\n&gt; being\n&gt; &gt; &gt; &gt; symbolises the request to come in and the invitation of the\n&gt; &gt; open\n&gt; &gt; &gt; door.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; If you give out a ready made invitation, it could be like\n&gt; that\n&gt; &gt; &gt; annoying\n&gt; &gt; &gt; &gt; relative that comes to visit and never leaves.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; So be very careful whenever summoning any unknown entities.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; If you need help with your box research or have any questions\n&gt; &gt; &gt; &gt; don&#39;t hesitate.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Bruce\n&gt; &gt; &gt; &gt; Bruce Halliday\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; To: EVP-ITC@: MudPuddleFarm@: Fri, 18 Jan 2008 10:49:53 -\n&gt; &gt; &gt; 0800Subject: Re: [EVP-ITC] this damned protection debate--Bruce\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Yes Bruce, &quot;We want to kill you&quot; is word for word what I\n&gt; hear.\n&gt; &gt; &gt; Thank you for being the first person ever to validate this for\n&gt; &gt; me,\n&gt; &gt; &gt; because now I know it&#39;s REAL, I&#39;m not crazy, and it isn&#39;t my\n&gt; &gt; &gt; imagination. This was captured on a digital voice recorder\n&gt; while\n&gt; &gt; I\n&gt; &gt; &gt; was heating coffee in the microwave oven nearby, and I felt\n&gt; that\n&gt; &gt; the\n&gt; &gt; &gt; microwave must have been a powerful energy source for\n&gt; &gt; the &quot;speaker.&quot;\n&gt; &gt; &gt; It may be important to note that I had just invited spirits\n&gt; &gt; inside\n&gt; &gt; &gt; the house from outside, and that after I listened to this\n&gt; message\n&gt; &gt; I\n&gt; &gt; &gt; told them to go back outside because they were too rude to\n&gt; &gt; continue\n&gt; &gt; &gt; talking to. I&#39;ve tried to replicate this experiment a number of\n&gt; &gt; &gt; times since then (without the verbal invitation into my home)\n&gt; and\n&gt; &gt; &gt; have had no luck whatsoever.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Gleefully moving on to box research!\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Robin\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; ----- Original Message -----\n&gt; &gt; &gt; &gt; From: bruce halliday\n&gt; &gt; &gt; &gt; To: evp-itc@yahoogroups.com&lt;mailto:evp-itc%40yahoogroups.com&gt;\n&gt; &gt; &gt; &gt; Sent: Friday, January 18, 2008 5:18 AM\n&gt; &gt; &gt; &gt; Subject: RE: [EVP-ITC] this damned protection debate--Bruce\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Robin, In the evp file you posted I believe I&#39;m hearing &quot;we\n&gt; &gt; want to\n&gt; &gt; &gt; kill you&quot;please let me know if that is what you hear. Robin, I\n&gt; am\n&gt; &gt; &gt; glad to hear that the protection ritual will be utilized by you\n&gt; &gt; in\n&gt; &gt; &gt; the purpose it was intended. To give any individual that wants\n&gt; to\n&gt; &gt; &gt; anopportunity to use it. You will find many forms of\n&gt; interaction\n&gt; &gt; on\n&gt; &gt; &gt; this group, running the gamut from total agreement to calm\n&gt; &gt; &gt; debate /discussion. To full blown arguments. That is what makes\n&gt; a\n&gt; &gt; &gt; group, If everyone followed one single ideology and the ideas\n&gt; of\n&gt; &gt; any\n&gt; &gt; &gt; single person without questionit would not be a group it would\n&gt; be\n&gt; &gt; a\n&gt; &gt; &gt; cult. Welcome to the wonderful world of box research robin, I&#39;m\n&gt; &gt; sure\n&gt; &gt; &gt; you will be a valued member and researcher in this community.\n&gt; &gt; Bruce\n&gt; &gt; &gt; &gt; Bruce Halliday\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; To: EVP-ITC@: MudPuddleFarm@: Thu, 17 Jan 2008 22:38:57 -\n&gt; &gt; &gt; 0800Subject: Re: [EVP-ITC] this damned protection debate--Bruce\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; I&#39;m still giving this topic a lot of thought because I\n&gt; &gt; absolutely\n&gt; &gt; &gt; believe in the power of prayer, the power of positivity, and\n&gt; the\n&gt; &gt; &gt; power of ritual. When I first started recording EVP a couple of\n&gt; &gt; &gt; years ago I was warned to expect negative responses, so when it\n&gt; &gt; &gt; happened to me I felt elated rather than frightened or\n&gt; &gt; distressed. I\n&gt; &gt; &gt; will ask again: What physical or psychic harm is a disembodied\n&gt; &gt; &gt; entity capable of doing? Please listen to the one EVP I&#39;ve\n&gt; posted\n&gt; &gt; on\n&gt; &gt; &gt; this board and tell me what, if anything, you hear. I know what\n&gt; I\n&gt; &gt; &gt; hear, and I consider it distinctly threatening; yet, this is\n&gt; the\n&gt; &gt; &gt; response that has created the determination in me to continue\n&gt; &gt; &gt; researching the unknown.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Bruce, I am in awe of your recordings. I only want to learn\n&gt; as\n&gt; &gt; &gt; much as I can from you and the other dedicated researchers on\n&gt; &gt; this\n&gt; &gt; &gt; board. It never occurred to me to use a protection ritual in\n&gt; the\n&gt; &gt; &gt; past, and that&#39;s about all I can say. I will probably use one\n&gt; &gt; from\n&gt; &gt; &gt; this point on, maybe not so much to repel evil as to attract\n&gt; &gt; &gt; goodness.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; So, thank you for this contribution. I think the debate has\n&gt; &gt; been\n&gt; &gt; &gt; an excellent one, and I&#39;ve appreciated the opportunity to be\n&gt; &gt; &gt; enlightened.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Robin\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; ----- Original Message -----\n&gt; &gt; &gt; &gt; From: bhali333\n&gt; &gt; &gt; &gt; To: EVP-ITC@yahoogroups.com&lt;mailto:EVP-ITC%40yahoogroups.com&gt;\n&gt; &gt; &gt; &gt; Sent: Wednesday, January 16, 2008 8:06 AM\n&gt; &gt; &gt; &gt; Subject: [EVP-ITC] this damned protection debate\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; I swore I would not get wraped up in this debateBUT!The\n&gt; reason\n&gt; &gt; I\n&gt; &gt; &gt; came up with this whole protection ritual was that some of the\n&gt; &gt; new\n&gt; &gt; &gt; researchers whereexpressing a rational concern for negative\n&gt; &gt; responces\n&gt; &gt; &gt; that they were recieving through thier boxes.The short\n&gt; protection\n&gt; &gt; &gt; ritual that I posted is not meant to quell irrational\n&gt; histerical\n&gt; &gt; &gt; fear, and I agreewith rosemary that anyone suffering from such\n&gt; &gt; fear\n&gt; &gt; &gt; should rethink thier involment in the paranormal research\n&gt; &gt; field.that\n&gt; &gt; &gt; being said, It was only meant as a source of subliminal comfort\n&gt; &gt; to\n&gt; &gt; &gt; those new individuals that had never expperienced spiritual\n&gt; &gt; &gt; negativity. And to help ease them into aproaching a session\n&gt; &gt; &gt; eventually with confidenceand determination as well as full\n&gt; &gt; &gt; curiousity for all types of the communication we recieve.My\n&gt; &gt; initial\n&gt; &gt; &gt; post of the ritual file was done with the best of intentions\n&gt; and\n&gt; &gt; &gt; meant to be another tool available for those who felt they\n&gt; needed\n&gt; &gt; or\n&gt; &gt; &gt; wanted to employ it. it is a simple innocent prayer ritual, I\n&gt; &gt; don&#39;t\n&gt; &gt; &gt; think it is really worthy of all this debate.Use it, don&#39;t use\n&gt; &gt; it.\n&gt; &gt; &gt; It&#39;s there if you want it. Also I must say there are two kinds\n&gt; of\n&gt; &gt; &gt; fear the kind that is natural and a god given emotion for self\n&gt; &gt; &gt; preservation, ie the fright and flight reflex that is an\n&gt; &gt; instinctive\n&gt; &gt; &gt; trait in all of us. Then you have the irrational dibilitating\n&gt; &gt; phobic\n&gt; &gt; &gt; fear that can turn an individual into a frozen statue. That\n&gt; type\n&gt; &gt; of\n&gt; &gt; &gt; fear I believe is unhealthyand should be addressed and dealt\n&gt; with\n&gt; &gt; and\n&gt; &gt; &gt; learned how to harness. I also believe that anyone that harbors\n&gt; &gt; that\n&gt; &gt; &gt; type of fear would not be drawn to the paranormal anyway and in\n&gt; a\n&gt; &gt; &gt; case of such fear it would already be present and doing a small\n&gt; &gt; &gt; protection ritual would not fuel it any further. So lets take\n&gt; it\n&gt; &gt; for\n&gt; &gt; &gt; what it is, something to utilize in our box of tools like an\n&gt; emf\n&gt; &gt; &gt; meter.you may have an old rusty odd sized wrench at the bottom\n&gt; of\n&gt; &gt; &gt; your tool box at home that you inherited from your grandfather\n&gt; &gt; and\n&gt; &gt; &gt; have never usedbut if you come across that odd nut that needs\n&gt; &gt; &gt; tightening somedsy you will be glad you have it.Bruce\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Need to know the score, the latest news, or you need your\n&gt; &gt; Hotmail®-\n&gt; &gt; &gt; get your &quot;fix&quot; Check it out.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; __________________________________________________________\n&gt; &gt; &gt; &gt; Climb to the top of the charts! Play the word scramble\n&gt; &gt; challenge\n&gt; &gt; &gt; with star power.\n&gt; &gt; &gt; &gt; http://club.live.com/star_shuffle.aspx?\n&gt; &gt; &lt;http://club.live.com/star_shuffleaspx?&gt;\n&gt; &gt; &gt; icid=starshuffle_wlmailtextlink_jan\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;\n&gt; \n\n\nF ank's commen is ge mane o my expe ience as well.AnnOn Jan 18, 2008, a 8:29 PM, LC Dupla w o e:FS:Fan as ic commen you made: \"I 's jus some hing ha doesn' wan  you o wake up.\" Tha is igh on in my opinion...i hey can c ea e  ea in a pe son, hen hey can manipula e ha pe son. Fea is he doo way o losing powe and con ol. Think abou he playg ound bully who akes people's lunch money un il a kid hal his size calls his blu by smacking him in he mou h. ;)LC--- In EVP-ITC@yahoog oups.com, \"F ank Sump ion\" ...> w o e:>> I don' know, bu I end o doub i . I used o ge all kinds o  > c ap, hey e en h ea ened o poison my co ee! I didn' qui  > d inking co ee, I jus ell hem o o b ing i . They' e always > u ned ou o be pape ige s--no hin' he e. I 's jus some hing > ha doesn' wan you o wake up. > > > > F ank-S> > --- In EVP-ITC@yahoog oups.com, \"Robin Sea cy Henson\" > > w o e:> >> > You don' ha e o name names.. I emembe ! A e hey eally > demonic? Do you know why hey ha e o ecei e an in i a ion be o e > hey can en e ? I won' be so blasé in he u u e.> > > > Robin> > > > > > ----- O iginal Message ----- > > F om: F ank Sump ion anks-boxes@> > > To: EVP-ITC@yahoog oups.comEVP-ITC@yahoog oups.com> > > Sen : F iday, Janua y 18, 2008 3:31 PM> > Subjec : [EVP-ITC] Re: his damned p o ec ion deba e--B uce> > > > > > Tha sounds all oo amila ..wi hou naming names. > > > > F ank-S> > > > --- In EVP-ITC@yahoog oups.comEVP-ITC@yahoog oups.com>, > b uce halliday > > a ing@> w o e:> > >> > > > > > Robin,> > > > > > I 's ne e a good idea o in i e any spi i s in o you home.> > > Some demonic spi i s ha e o be in i ed in be o e hey can > > > en e , he e a e ins inces whe e people ha e hea d knocks on > hie > > > on doo only o answe he doo and ha e no one he e.> > > The knocking by an en i y and he opening by he physical being > > > symbolises he eques o come in and he in i a ion o he > open > > doo .> > > > > > I you gi e ou a eady made in i a ion, i could be like  ha  > > annoying> > > ela i e ha comes o isi and ne e lea es.> > > > > > So be e y ca e ul whene e summoning any unknown en i ies.> > > > > > I you need help wi h you box esea ch o ha e any ques ions> > > don' hesi a e.> > > > > > B uce> > > B uce Halliday > > > > > > > > > To: EVP-ITC@: MudPuddleFa m@: F i, 18 Jan 2008 10:49:53 -> > 0800Subjec : Re: [EVP-ITC] his damned p o ec ion deba e--B uce> > > > > > > > > > > > > > > > > > > > > Yes B uce, \"We wan o kill you\" is wo d o wo d wha I hea . > > Thank you o being he i s pe son e e o alida e his o  > me, > > because now I know i 's REAL, I'm no c azy, and i isn' my > > imagina ion. This was cap u ed on a digi al oice eco de  while > I > > was hea ing co ee in he mic owa e o en nea by, and I el   ha  > he > > mic owa e mus ha e been a powe ul ene gy sou ce o  > he \"speake .\" > > I may be impo an o no e ha I had jus in i ed spi i s > inside > > he house om ou side, and ha a e I lis ened o his message > I > > old hem o go back ou side because hey we e oo ude o > con inue > > alking o. I' e ied o eplica e his expe imen a numbe o  > > imes since hen (wi hou he e bal in i a ion in o my home) and > > ha e had no luck wha soe e . > > > > > > Glee ully mo ing on o box esea ch!> > > > > > Robin> > > > > > > > > > > > ----- O iginal Message ----- > > > F om: b uce halliday > > > To: e p-i c@yahoog oups.commail o:e p-i c%40yahoog oups.com> > > > Sen : F iday, Janua y 18, 2008 5:18 AM> > > Subjec : RE: [EVP-ITC] his damned p o ec ion deba e--B uce> > > > > > > > > Robin, In he e p ile you pos ed I belie e I'm hea ing \"we > wan o > > kill you\"please le me know i ha is wha you hea . Robin, I am > > glad o hea ha he p o ec ion i ual will be u ilized by you > in > > he pu pose i was in ended. To gi e any indi idual ha wan s  o > > anoppo uni y o use i . You will ind many o ms o  in e ac ion > on > > his g oup, unning he gamu om o al ag eemen o calm > > deba e /discussion. To ull blown a gumen s. Tha is wha makes a > > g oup, I e e yone ollowed one single ideology and he ideas o  > any > > single pe son wi hou ques ioni would no be a g oup i would be > a > > cul . Welcome o he wonde ul wo ld o box esea ch obin, I'm > su e > > you will be a alued membe and esea che in his communi y. > B uce> > > B uce Halliday > > > > > > > > > To: EVP-ITC@: MudPuddleFa m@: Thu, 17 Jan 2008 22:38:57 -> > 0800Subjec : Re: [EVP-ITC] his damned p o ec ion deba e--B uce> > > > > > > > > > > > > > > I'm s ill gi ing his opic a lo o hough because I > absolu ely > > belie e in he powe o p aye , he powe o posi i i y, and  he > > powe o i ual. When I i s s a ed eco ding EVP a couple o  > > yea s ago I was wa ned o expec nega i e esponses, so when i  > > happened o me I el ela ed a he han igh ened o  > dis essed. I > > will ask again: Wha physical o psychic ha m is a disembodied > > en i y capable o doing? Please lis en o he one EVP I' e pos ed > on > > his boa d and ell me wha , i any hing, you hea . I know wha  I > > hea , and I conside i dis inc ly h ea ening; ye , his is  he > > esponse ha has c ea ed he de e mina ion in me o con inue > > esea ching he unknown. > > > > > > B uce, I am in awe o you eco dings. I only wan o lea n as > > much as I can om you and he o he dedica ed esea che s on > his > > boa d. I ne e occu ed o me o use a p o ec ion i ual in  he > > pas , and ha 's abou all I can say. I will p obably use one > om > > his poin on, maybe no so much o epel e il as o a ac  > > goodness. > > > > > > So, hank you o his con ibu ion. I hink he deba e has > been > > an excellen one, and I' e app ecia ed he oppo uni y o be > > enligh ened.> > > > > > Robin> > > > > > > > > > > > ----- O iginal Message ----- > > > F om: bhali333 > > > To: EVP-ITC@yahoog oups.commail o:EVP-ITC%40yahoog oups.com> > > > Sen : Wednesday, Janua y 16, 2008 8:06 AM> > > Subjec : [EVP-ITC] his damned p o ec ion deba e> > > > > > > > > I swo e I would no ge w aped up in his deba eBUT!The  eason > I > > came up wi h his whole p o ec ion i ual was ha some o he > new > > esea che s whe eexp essing a a ional conce n o nega i e > esponces > > ha hey we e ecie ing h ough hie boxes.The sho  p o ec ion > > i ual ha I pos ed is no mean o quell i a ional his e ical > > ea , and I ag eewi h osema y ha anyone su e ing om such > ea  > > should e hink hie in olmen in he pa ano mal esea ch > ield. ha  > > being said, I was only mean as a sou ce o subliminal com o  > o > > hose new indi iduals ha had ne e exppe ienced spi i ual > > nega i i y. And o help ease hem in o ap oaching a session > > e en ually wi h con idenceand de e mina ion as well as ull > > cu iousi y o all ypes o he communica ion we ecie e.My > ini ial > > pos o he i ual ile was done wi h he bes o in en ions and > > mean o be ano he ool a ailable o hose who el hey needed > o  > > wan ed o employ i . i is a simple innocen p aye i ual, I > don'  > > hink i is eally wo hy o all his deba e.Use i , don' use > i . > > I 's he e i you wan i . Also I mus say he e a e wo kinds o  > > ea he kind ha is na u al and a god gi en emo ion o sel  > > p ese a ion, ie he igh and ligh e lex ha is an > ins inc i e > > ai in all o us. Then you ha e he i a ional dibili a ing > phobic > > ea ha can u n an indi idual in o a ozen s a ue. Tha   ype > o  > > ea I belie e is unheal hyand should be add essed and deal  wi h > and > > lea ned how o ha ness. I also belie e ha anyone ha ha bo s > ha  > > ype o ea would no be d awn o he pa ano mal anyway and in a > > case o such ea i would al eady be p esen and doing a small > > p o ec ion i ual would no uel i any u he . So le s ake i  > o  > > wha i is, some hing o u ilize in ou box o ools like an em  > > me e .you may ha e an old us y odd sized w ench a he bo om o  > > you ool box a home ha you inhe i ed om you g and a he  > and > > ha e ne e usedbu i you come ac oss ha odd nu ha needs > > igh ening somedsy you will be glad you ha e i .B uce> > > > > > Need o know he sco e, he la es news, o you need you  > Ho mail®-> > ge you \" ix\" Check i ou . > > > > > > > > > > > > > > > > > > > > > > > > > > > __________________________________________________________> > > Climb o he op o he cha s! Play he wo d sc amble > challenge > > wi h s a powe .> > > h p://club.li e.com/s a _shu le.aspx?> h p://club.li e.com/s a _shu leaspx?>> > icid=s a shu le_wlmail ex link_jan> > >> >>"}