{"id": "5722", "subject": "Re: [EVP-ITC] Re: Very good article on closed minded skeptics", "author": "Lisby", "timestamp": "2008-01-19T01:45:03Z", "full_text": "I also agree with this definition. I am skeptical. There is nothing  \nto be ashamed of there. Being skeptical led me to the conclusion that  \nthere is some genuine paranormal phenomenon. It doesn&#39;t need to be a  \ncase of all or nothing. Some genuine events is good enough. All it  \ntakes is one white crow to prove there are white crows, not that all  \ncrows are white or need to be.\n\nAnn\nI think I&#39;m losing my cutting edge this evening already....\n\n\n\nOn Jan 18, 2008, at 8:29 PM, Guy wrote:\n\n&gt; Oh - and I tend to agree with this explanation from &quot;Skeptic&quot;\n&gt; magazine:\n&gt;\n&gt; &quot;...Some people believe that skepticism is the rejection of new\n&gt; ideas, or worse, they confuse &quot;skeptic&quot; with &quot;cynic&quot; and think that\n&gt; skeptics are a bunch of grumpy curmudgeons unwilling to accept any\n&gt; claim that challenges the status quo. This is wrong. Skepticism is a\n&gt; provisional approach to claims. It is the application of reason to\n&gt; any and all ideas — no sacred cows allowed. In other words,\n&gt; skepticism is a method, not a position. Ideally, skeptics do not go\n&gt; into an investigation closed to the possibility that a phenomenon\n&gt; might be real or that a claim might be true. When we say we\n&gt; are &quot;skeptical,&quot; we mean that we must see compelling evidence before\n&gt; we believe...&quot;\n&gt;\n&gt; (http://www.skeptic.com/about_us/discover_skepticism.html)\n&gt;\n&gt; In this regard - I consider myself a skeptic...one who practices/uses\n&gt; skepticism. Note that this concept cuts both ways. For example - some\n&gt; EVP is explained away as &quot;apophenia&quot;. When you really dig into that\n&gt; term - you find that it is used inappropriately.\n&gt;\n&gt; I&#39;ve started calling people like James Randi, etc. &quot;discreditors&quot;.\n&gt; Not only do they NOT believe in various abilities/stories/etc. (at\n&gt; least publicly) but they ACTIVELY ridicule the people and their work\n&gt; whom they disagree with and attempt to rally others to this cause.\n&gt;\n&gt; Guy\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Guy&quot; &lt;yzzzguy@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; By the way - CSICOP (the Committee for the Scientific Investigation\n&gt; &gt; of Claims Of the Paranormal) changed their name in late 2006 to\n&gt; &gt; CSI...the Committee for Skeptical Inquiry.\n&gt; &gt;\n&gt; &gt; http://csicop.org/specialarticles/csicop.html\n&gt; &gt;\n&gt; &gt; Guy\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;Robin Searcy Henson&quot;\n&gt; &gt; &lt;MudPuddleFarm@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; This is great Frank. Thank you for the link.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Robin\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; ----- Original Message -----\n&gt; &gt; &gt; From: Frank Ratka&lt;mailto:warrior18eii@&gt;\n&gt; &gt; &gt; To: EVP-ITC@yahoogroups.com&lt;mailto:EVP-ITC@yahoogroups.com&gt;\n&gt; &gt; &gt; Sent: Friday, January 18, 2008 5:31 AM\n&gt; &gt; &gt; Subject: [EVP-ITC] Very good article on closed minded skeptics\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; It&#39;s called &quot;Pathological Disbelief&quot;. The entire article is a\n&gt; &gt; good read but the case involving the paranormal starts on page 41.\n&gt; &gt; Here is the link. I will actually post the paper in the files\n&gt; section.\n&gt; &gt; &gt;\n&gt; &gt; &gt; http://lenr-\n&gt; canr.org/acrobat/JosephsonBpathologic.pdf&lt;http://lenr-\n&gt; &gt; canr.org/acrobat/JosephsonBpathologic.pdf&gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; Regards,\n&gt; &gt; &gt;\n&gt; &gt; &gt; Frank R.\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; ----------------------------------------------------------\n&gt; --\n&gt; &gt; ----------\n&gt; &gt; &gt; Be a better friend, newshound, and know-it-all with Yahoo!\n&gt; &gt; Mobile. Try it\n&gt; &gt;\n&gt; now.&lt;http://us.rd.yahoo.com/evt=51733/*http://mobile.yahoo.com/;_ylt=A\n&gt; &gt; hu06i62sR8HDtDypao8Wcj9tAcJ&gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;\n&gt; \n\n\nI also ag ee wi h his de ini ion. I am skep ical. The e is no hing o be ashamed o he e. Being skep ical led me o he conclusion ha he e is some genuine pa ano mal phenomenon. I doesn' need o be a case o all o no hing. Some genuine e en s is good enough. All i akes is one whi e c ow o p o e he e a e whi e c ows, no ha all c ows a e whi e o need o be.AnnI hink I'm losing my cu ing edge his e ening al eady....On Jan 18, 2008, a 8:29 PM, Guy w o e:Oh - and I end o ag ee wi h his explana ion om \"Skep ic\" magazine:\"...Some people belie e ha skep icism is he ejec ion o new ideas, o wo se, hey con use \"skep ic\" wi h \"cynic\" and hink ha  skep ics a e a bunch o g umpy cu mudgeons unwilling o accep any claim ha challenges he s a us quo. This is w ong. Skep icism is a p o isional app oach o claims. I is he applica ion o eason o any and all ideas — no sac ed cows allowed. In o he wo ds, skep icism is a me hod, no a posi ion. Ideally, skep ics do no go in o an in es iga ion closed o he possibili y ha a phenomenon migh be eal o ha a claim migh be ue. When we say we a e \"skep ical,\" we mean ha we mus see compelling e idence be o e we belie e...\"(h p://www.skep ic.com/abou _us/disco e _skep icism.h ml)In his ega d - I conside mysel a skep ic...one who p ac ices/uses skep icism. No e ha his concep cu s bo h ways. Fo example - some EVP is explained away as \"apophenia\". When you eally dig in o ha   e m - you ind ha i is used inapp op ia ely.I' e s a ed calling people like James Randi, e c. \"disc edi o s\". No only do hey NOT belie e in a ious abili ies/s o ies/e c. (a  leas publicly) bu hey ACTIVELY idicule he people and hei wo k whom hey disag ee wi h and a emp o ally o he s o his cause.Guy--- In EVP-ITC@yahoog oups.com, \"Guy\" > w o e:>> By he way - CSICOP ( he Commi ee o he Scien i ic In es iga ion > o Claims O he Pa ano mal) changed hei name in la e 2006 o > CSI... he Commi ee o Skep ical Inqui y.> > h p://csicop.o g/speciala icles/csicop.h ml> > Guy> > --- In EVP-ITC@yahoog oups.com, \"Robin Sea cy Henson\" > > w o e:> >> > This is g ea F ank. Thank you o he link.> > > > Robin> > > > > > ----- O iginal Message ----- > > F om: F ank Ra kawa io 18eii@> > > To: EVP-ITC@yahoog oups.comEVP-ITC@yahoog oups.com> > > Sen : F iday, Janua y 18, 2008 5:31 AM> > Subjec : [EVP-ITC] Ve y good a icle on closed minded skep ics> > > > > > > > I 's called \"Pa hological Disbelie \". The en i e a icle is a > good ead bu he case in ol ing he pa ano mal s a s on page 41. > He e is he link. I will ac ually pos he pape in he iles sec ion.> > > > h p://len -can .o g/ac oba /JosephsonBpa hologic.pd h p://len -> can .o g/ac oba /JosephsonBpa hologic.pd >> > > > Rega ds,> > > > F ank R.> > > > > > > > ------------------------------------------------------------> ----------> > Be a be e iend, newshound, and know-i -all wi h Yahoo! > Mobile. T y i  > now.h p://us. d.yahoo.com/e =51733/*h p://mobile.yahoo.com/;_yl =A> hu06i62sR8HD Dypao8Wcj9 AcJ>> >>"}