{"id": "5776", "subject": "New Subject For Research Sessions", "author": "bhali333", "timestamp": "2008-01-19T15:43:32Z", "full_text": "Hi Everyone,\n\n I have been thinking about what our friends on the other side have \nbeen saying concerning harmony, resonance and positive vibration.\nWhile thinking on this and how to achieve amongst us all, I had an \nidea for a new subject of research. I had been thinking about \nspiritual and harmonic energy connection between the spirit world and \nour physical world and contemplating how Mike & Lisa stress the \nimportance of this state in the success of better stronger \ncommunication.\n\n Then the idea of identical twins came to mind and the spiritual and \nsometimes telekinetic bonds that they have been known to share. This \nidea raised two questions in my mind. \n\n1. is this spiritual and mental energy bond between twins similar to \nthe bond we must develop with our spirit counter parts to facilitate \nbetter, stronger and longer sustained communication. \n\n2. twins in the womb are conceived when for whatever reason one \nsingle egg splits into two separate eggs and those two fetuses \ndevelop independently of each other, but with identical DNA blue \nprints and identical physical characteristics. The question is.\n\nIs their spirit or spiritual energy also divided equally between the \ntwo individuals that is existent as one spirit divided into two that \nserves as their individual spiritual energy while in the physical and \nthen after death is recombined into a single spirit?\n\nOr does the spirit at the time of fetal division become two separate \nand distinct spirits that remain as two individual spirits after \ncrossing to the spirit world?\n\nI propose a research experiment involving certain questions to our \ntechnicians involving this subject matter over say the course of \nthree 10 minute sessions. At the end all participants will submit \ntheir individual responses if any and they can be compared for \nsimilarity or dissimilarity.\n\nAny researchers interested in this project please let me know, I \nwould like to get started within the week.\n\nBruce"}