{"id": "5780", "subject": "Re: New member here !!", "author": "M.A. Coletta (Mike)", "timestamp": "2008-01-19T16:18:28Z", "full_text": "Hi Ralph... and welcome to the group!!!\nAnd thanks for the &quot;thanks&quot;.\n\nSorry you had to get caught by the &quot;green wire&quot; thing.  In most cases \nit is the green wire, as others have reported, but once-in-awhile it \nis found to be a different color.\nThat&#39;s why I went back and re-did the video to reflect that fact, \nsaying you might want to lift the top board to ensure which wire it \nreally is.  You may have seen the first edition of the video, which I \nhope) is off the internet now, unless someone copied it and posted it \nsomewhere...???\n\nAnyway... it sounds like you have much experience and lots to share \nwith the group.  That&#39;s GREAT!\n\nOnce again, WELCOME!\n\n- Mike\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;ghostthostt&quot; &lt;Ralphsmi@...&gt; wrote:\n&gt;\n&gt; Hi all,\n&gt; \n&gt;  I&#39;m a new member of the group and I am an Investigator of the \n&gt; Paranormal here in central PA. My group&#39;s name is SPIRIT Paranormal \n&gt; Investigation Team. I have been doing this in groups now for 6 \nyears.\n&gt; I had my own group H.I.P.S. (Harrisburg Independent Paranormal \n&gt; Society) and now I am in the SPIRIT group out of Selinsgrove,PA. I \n&gt; also use to be with Kelly Weaver&#39;s group Capital Ghost Forum which \nis \n&gt; now called Spirit Society of PA. I had to leave her group because \nof \n&gt; my work schedule. I have been on Ghost Investigations with TAPS to \n&gt; Waverly Hills Sanatorium,Ky, Eastern State Pennitentiary in PA. I \n&gt; have \n&gt; also investigated St. Augustine Lighthouse in Fla. I did have a \n&gt; chance \n&gt; to meet Bill Murphy here in Gettysburg,PA. on the Battlefield near \n&gt; the \n&gt; Wheatfield last year for a short time. He is a nice guy. I let him \n&gt; listen to some of my EVP&#39;s from the Wheatfield and Triangular Field \n&gt; that day we met. I have been called an &quot; EVP Medium &quot; by my peers. \nI \n&gt; have a ton of them. I would like to thank &quot;Frank Sumption&quot; for his \n&gt; inspiring work with his boxes and giving of his time and knowledge \nto \n&gt; inspire us to do our own research to find the answers we are all \n&gt; looking for in this world. Thanks, Frank for your inspiration and \n&gt; hard \n&gt; work we all appreciate it. I would also like to thank &quot;Sum Duck&quot; \n&gt; and &quot;Mike Coletta&quot; for coming up with those Hacks that made it easy \n&gt; for me and all the others out there that are Electronically \n&gt; illiterate.\n&gt; Thank you guys we all appreciate it too. Oh well I just wanted to \nput \n&gt; my two cents in to let you know I&#39;m with you all. Oh, I have two 12-\n&gt; 469&#39;s the first one I broke trying to hack it LOL. The other one \n&gt; works \n&gt; great. I also have the 12-470(old model) which I tried to hack but \nI \n&gt; cut the wrong wire. I cut the green wire (seventh wire from the top \n&gt; as \n&gt; Mike said to do)and when I put everything back together I had no AM \n&gt; Band LOL. So I opened it up again and was thinking to myself should \nI \n&gt; cut the wire before the green one I had cut or should I cut the \nwire \n&gt; after the green one. Hmmmm, I thought here goes nothing so I cut \nthe \n&gt; yellow wire after the green one number eight from the top. I put it \n&gt; together as I was crossing my fingers, I tried the FM band and \nbingo \n&gt; it worked great. Just a funny story of how electronically \nilliterate \n&gt; I \n&gt; am. I do want to say I do hear alot of voices coming across these \n&gt; boxes. I hear them saying their names and sometimes it sounds like \n&gt; they are talking to each other. I have gotten answers to questions \n&gt; too. Yesterday at my work place I like to listen to it while I&#39;m \n&gt; working here at the Post Office. I heard a male voice say to me &quot;Do \n&gt; you want a Tech ?&quot; I also hear the name Lisa alot and they \n&gt; say &quot;seven&quot; \n&gt; alot too. My name has been called alot too. So there has to be \n&gt; something to these boxes. Oh I also had one say &quot; Hurry dead \nbattery &quot;\n&gt; which my batteries did die a few minutes later which was cool. I \nwas \n&gt; recording with my voice recorder and picked that up. They say some \n&gt; funny things sometimes too. I did hear one say to me &quot; F__k Off &quot; I \n&gt; know that wasn&#39;t on any radio program LOl. Oh well you have a great \n&gt; set up here and it is nice to meet you all. Take care and keep up \nthe \n&gt; great work you all are doing in your researches. Bye for now !!\n&gt; \n&gt; Regards,\n&gt; \n&gt; Ralph Smith of &quot;SPIRIT&quot; Paranormal Investigation Team !!!!\n&gt;"}