{"id": "5786", "subject": "Re: New Ghost Radio with no Hack Involved", "author": "Steve Hultay", "timestamp": "2008-01-19T17:28:41Z", "full_text": "Yeah, as soon as Sum put the hack out there it seems like there are \nmany radios that could have the potential for ghost box \nfunctionality.  If it has a scan feature, it has potential to be \nhacked or in this case no hack involved.  If people do not want to \nhold the scan button down, you can use an old clothes line pin to \nhold it down for you.  I asked our friends on the other side if my \nnew job was to find hackable radios and they said &quot;yes&quot; loud and \nclear.  The first time i asked what my job was months ago they \nanswered &quot;To Teach Others&quot;.  These ideas just keep hitting me and \nthey are so simple anyone could figure these out.  Maybe we were \nlooking for harder solutions to the idea of a &quot;ghost box&quot;.  It seems \nsimple ideas have taken the lead thanx to Sum for getting the idea \nout there and ball rolling on this one.\n\n-Steve H.\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;LC Duplatt&quot; &lt;lcdupla@...&gt; wrote:\n&gt;\n&gt; LOL!\n&gt; \n&gt; I have had that radio on my night stand for years.  I listen to \nCOast \n&gt; to Coast AM on it at night as I fall asleep and never tried the \n&gt; scan.  Figures...;)\n&gt; \n&gt; LC\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Steve Hultay&quot; &lt;urkel23@&gt; wrote:\n&gt; &gt;\n&gt; &gt; \n&gt; &gt; I have always used this Sony Walkman the past several years to \n&gt; bring \n&gt; &gt; to the ball game with me and it&#39;s by far the best sounding radio \n&gt; i&#39;ve \n&gt; &gt; ever had.  Well, i was cleaning up today and came across it.  I \n&gt; &gt; turned it on and just held down the scan button and it scans \n&gt; through \n&gt; &gt; all the stations non-stop as long as you keep it pressed down.  \n&gt; Which \n&gt; &gt; is no big deal since the recorded sessions for me are only \nusually \n&gt; 10 \n&gt; &gt; Min. tops. This model has been out for years and you can pick it \nup \n&gt; &gt; at your local Circuit city or Best buy, it&#39;s even on Ebay for \n$20.  \n&gt; &gt; Circuit city i think is like $30.  You have to plug headphones \ninto \n&gt; &gt; it or an external speaker, but it fits in the palm of your hand \nand \n&gt; &gt; the reception is better than all the rest.  It runs off of 1 AAA \n&gt; &gt; battery and lasts forever.  For those who are afraid to hack a \n&gt; radio, \n&gt; &gt; just pick this model up and hold the scan button down and away \nyou \n&gt; go \n&gt; &gt; right out of the packaging.  I did open it up and there is a \n&gt; ribbon, \n&gt; &gt; but nothing was clearly marked so i will have to find the \n&gt; schematics \n&gt; &gt; online before i mess with it.  The radio has AM/FM/WB/TV, however \n&gt; &gt; when i did the trial scans i found that the AM worked best and \n&gt; &gt; instantly received answers to my questions.  I turned it on and \n&gt; asked \n&gt; &gt; if this is working and loud and clear they said &quot;yes&quot;.  Oh, it&#39;s \n&gt; &gt; model # SRF-M37V.\n&gt; &gt; \n&gt; &gt; I&#39;ll post more when the ideas hit me.\n&gt; &gt; \n&gt; &gt; -Steve H.\n&gt; &gt;\n&gt;"}