{"id": "5803", "subject": "Re: [EVP-ITC] New Subject For Research Sessions", "author": "Lisby", "timestamp": "2008-01-19T21:34:54Z", "full_text": "Bruce--let me know your plans and if I can participate, I will.\n\nAnn\n\nOn Jan 19, 2008, at 3:29 PM, Robin Searcy Henson wrote:\n\n&gt;\n&gt; How fascinating.  I&#39;d like to be involved with this project.\n&gt;\n&gt; Robin\n&gt;\n&gt;\n&gt; ----- Original Message -----\n&gt; From: bhali333\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Saturday, January 19, 2008 7:43 AM\n&gt; Subject: [EVP-ITC] New Subject For Research Sessions\n&gt;\n&gt; Hi Everyone,\n&gt;\n&gt; I have been thinking about what our friends on the other side have\n&gt; been saying concerning harmony, resonance and positive vibration.\n&gt; While thinking on this and how to achieve amongst us all, I had an\n&gt; idea for a new subject of research. I had been thinking about\n&gt; spiritual and harmonic energy connection between the spirit world and\n&gt; our physical world and contemplating how Mike & Lisa stress the\n&gt; importance of this state in the success of better stronger\n&gt; communication.\n&gt;\n&gt; Then the idea of identical twins came to mind and the spiritual and\n&gt; sometimes telekinetic bonds that they have been known to share. This\n&gt; idea raised two questions in my mind.\n&gt;\n&gt; 1. is this spiritual and mental energy bond between twins similar to\n&gt; the bond we must develop with our spirit counter parts to facilitate\n&gt; better, stronger and longer sustained communication.\n&gt;\n&gt; 2. twins in the womb are conceived when for whatever reason one\n&gt; single egg splits into two separate eggs and those two fetuses\n&gt; develop independently of each other, but with identical DNA blue\n&gt; prints and identical physical characteristics. The question is.\n&gt;\n&gt; Is their spirit or spiritual energy also divided equally between the\n&gt; two individuals that is existent as one spirit divided into two that\n&gt; serves as their individual spiritual energy while in the physical and\n&gt; then after death is recombined into a single spirit?\n&gt;\n&gt; Or does the spirit at the time of fetal division become two separate\n&gt; and distinct spirits that remain as two individual spirits after\n&gt; crossing to the spirit world?\n&gt;\n&gt; I propose a research experiment involving certain questions to our\n&gt; technicians involving this subject matter over say the course of\n&gt; three 10 minute sessions. At the end all participants will submit\n&gt; their individual responses if any and they can be compared for\n&gt; similarity or dissimilarity.\n&gt;\n&gt; Any researchers interested in this project please let me know, I\n&gt; would like to get started within the week.\n&gt;\n&gt; Bruce\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; \n\n\nB uce--le me know you plans and i I can pa icipa e, I will.AnnOn Jan 19, 2008, a 3:29 PM, Robin Sea cy Henson w o e:How ascina ing.  I'd like o be in ol ed wi h his p ojec . Robin  ----- O iginal Message -----F om: bhali333To: EVP-ITC@yahoog oups.comSen : Sa u day, Janua y 19, 2008 7:43 AMSubjec : [EVP-ITC] New Subjec Fo Resea ch SessionsHi E e yone,I ha e been hinking abou wha ou iends on he o he side ha e been saying conce ning ha mony, esonance and posi i e ib a ion.While hinking on his and how o achie e amongs us all, I had an idea o a new subjec o esea ch. I had been hinking abou  spi i ual and ha monic ene gy connec ion be ween he spi i wo ld and ou physical wo ld and con empla ing how Mike & Lisa s ess he impo ance o his s a e in he success o be e s onge  communica ion.Then he idea o iden ical wins came o mind and he spi i ual and some imes elekine ic bonds ha hey ha e been known o sha e. This idea aised wo ques ions in my mind. 1. is his spi i ual and men al ene gy bond be ween wins simila o  he bond we mus de elop wi h ou spi i coun e pa s o acili a e be e , s onge and longe sus ained communica ion. 2. wins in he womb a e concei ed when o wha e e eason one single egg spli s in o wo sepa a e eggs and hose wo e uses de elop independen ly o each o he , bu wi h iden ical DNA blue p in s and iden ical physical cha ac e is ics. The ques ion is.Is hei spi i o spi i ual ene gy also di ided equally be ween he  wo indi iduals ha is exis en as one spi i di ided in o wo ha  se es as hei indi idual spi i ual ene gy while in he physical and  hen a e dea h is ecombined in o a single spi i ?O does he spi i a he ime o e al di ision become wo sepa a e and dis inc spi i s ha emain as wo indi idual spi i s a e  c ossing o he spi i wo ld?I p opose a esea ch expe imen in ol ing ce ain ques ions o ou   echnicians in ol ing his subjec ma e o e say he cou se o   h ee 10 minu e sessions. A he end all pa icipan s will submi   hei indi idual esponses i any and hey can be compa ed o  simila i y o dissimila i y.Any esea che s in e es ed in his p ojec please le me know, I would like o ge s a ed wi hin he week.B uce"}