{"id": "582", "subject": "After a long absense.", "author": "Frank Sumption", "timestamp": "2006-12-21T05:12:32Z", "full_text": "Hi All;\n\n After a long absense I&#39;ve re-joined the group. Probably not too many \nknow what happened to cause me to suddenly leave the group, and \nalmost all internet/e-mail activities. I got in an e-mail arguement, \nthe other person sent all my replies to my boss, who also happened to \nbe my e-mail provider, and made me look like somekind of on-line \npredator. I almost got fired, I held on to my job by the skin of \nteeth. Interestingly, I got visions that kept me informed of what was \ngoing on, and allowed certain spiritual intervention. Anyway, I&#39;m not \nentirely sure I didn&#39;t deserve that, as I tend to get somewhat \nargumentative at times. I&#39;ll try to do better this time. Part of the \ntrouble I got into at work was for doing group e-mail wiht a school \ndistrict e-mail account, so now I can only do e-mail from home, and I \nwon&#39;t be able to check in as often as I used to. Because of my \ncircuit building, I was able to save the district a chunk of change \nthis month, which put me back on the good guy list, and off the \nprobation.  \n\n I have continued the work with my boxes, and I&#39;m trying to get a \nproduction model ready. I changed the design, and the first one \nworked, but I had trouble replicating the circuit, to make sure it \nwas a good design. I think I have the bugs worked, but still have to \nfinish the second board. I have random voltage generator part \nworking, which is what I changed. I&#39;m concerned about the system&#39;s \nfuture, as it relies on AM broadcasts. A new format, HD radio, is \nbeing pushed, and I&#39;m afraid eventually HD radio will replace \nstandard AM radio, as HDTV is doing now, with analog TV broadcasts \nalready scheduled to stop. It just means I would have to go to a \ndigital system. \n\n I was getting some weird voices concerning Christmas, and December \nfor some time, but they never mentioned blizzard, or snow storm. I \nthink that&#39;s what the voices were talking about, and I did have one I \nfound last night on my most recent tape from maybe a week ago that \nsaid they&#39;ll close the airport (Denver International). Incidenally, \nI&#39;ve tried recording during full moons with no change in the voices, \nbut recording during the recent solar flares, and meteor showers \nseems to have resulted in better voices. \n\n Besides the ghost stuff, I took up bicycle riding last summer, and \nfound I really enjoy it, so do long rides, like 40 miles, weather \npremitting. I made a recumbent bike, and I&#39;m making one for each of \nthe Grandsons. \n\n Frank"}