{"id": "5828", "subject": "Re: [EVP-ITC] Introducing myself", "author": "Debbie Tejada", "timestamp": "2008-01-20T01:17:09Z", "full_text": "Hi new members Carol and Ralph! I&#39;m pretty new myself, just today did  \nmy first 470 RS Hack (assisted by my 12 year old) and anxious to get  \nstarted. Mike, your video was as clear as day, had no problems with  \nthe hack and took me about 5 minutes. Thanks!\n\nHopefully soon I&#39;ll be posting my own EVPs, and I promise I won&#39;t  \ncomplain if I don&#39;t get any feedback. I can&#39;t keep up with this group  \nas it is.\n\nCarol and Ralph, hang on for a wild ride, this forum is very busy and  \nyou&#39;ll have your hands full trying to keep up.\n\nRalph, I&#39;ve seen your SPIRIT group somewhere in my travels. I&#39;m headed  \nout for an investigation at Eastern State in July, wanted to visit  \nGettysburg during that trip as well. Any tips/advice would be  \nappreciated!\n\nDeb T\n\n&quot;Once you can accept the universe as matter expanding into nothing  \nthat is something, wearing stripes with plaid comes easy. &quot;  ~Albert  \nEinstein\n\nOn Jan 19, 2008, at 4:20 PM, bruce halliday wrote:\n\n&gt; Carol,\n&gt;\n&gt; Welcome to the group, my name is bruce I am one of the box\n&gt; researchers here. If you have any questions please feel free to ask\n&gt; I will be glad to help.\n&gt;\n&gt; bruce\n&gt;\n&gt;\n&gt;\n&gt; Bruce Halliday\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; From: cbreck@...\n&gt; Date: Sat, 19 Jan 2008 13:43:12 -0600\n&gt; Subject: [EVP-ITC] Introducing myself\n&gt;\n&gt; Hello all,\n&gt;\n&gt; My name is Carol and I&#39;ve been an investigator for 10+ years. I&#39;m  \n&gt; new to\n&gt; the Frank&#39;s box device, and am totally fascinated by it! My husband  \n&gt; works\n&gt; in recording studios and is willing to build me my first box. I would\n&gt; like to work with the RS hack too. I&#39;ve got many great class a evp&#39;s  \n&gt; from\n&gt; my dvr...but I&#39;m really looking forwards to working with Frank&#39;s Box.\n&gt; Glad to meet y&#39;all.\n&gt;\n&gt; Carol B.\n&gt;\n&gt;\n&gt;\n&gt; Shed those extra pounds with MSN and The Biggest Loser! Learn more.\n&gt;\n&gt; \n\n\nHi new membe s Ca ol and Ralph! I'm p e y new mysel , jus oday did my i s 470 RS Hack (assis ed by my 12 yea old) and anxious o ge s a ed. Mike, you ideo was as clea as day, had no p oblems wi h he hack and ook me abou 5 minu es. Thanks!Hope ully soon I'll be pos ing my own EVPs, and I p omise I won' complain i I don' ge any eedback. I can' keep up wi h his g oup as i is.Ca ol and Ralph, hang on o a wild ide, his o um is e y busy and you'll ha e you hands ull ying o keep up.Ralph, I' e seen you SPIRIT g oup somewhe e in my a els. I'm headed ou o an in es iga ion a Eas e n S a e in July, wan ed o isi Ge ysbu g du ing ha ip as well. Any ips/ad ice would be app ecia ed!Deb T\"Once you can accep he uni e se as ma e expanding in o no hing ha is some hing, wea ing s ipes wi h plaid comes easy. \"  ~Albe Eins ein On Jan 19, 2008, a 4:20 PM, b uce halliday w o e:Ca ol, Welcome o he g oup, my name is b uce I am one o he box esea che s he e. I you ha e any ques ions please eel ee o askI will be glad o help. b uceB uce Halliday To: EVP-ITC@yahoog oups.comF om: cb eck@elkne .ne Da e: Sa , 19 Jan 2008 13:43:12 -0600Subjec : [EVP-ITC] In oducing mysel Hello all,My name is Ca ol and I' e been an in es iga o o 10+ yea s. I'm new o he F ank's box de ice, and am o ally ascina ed by i ! My husband wo ksin eco ding s udios and is willing o build me my i s box. I wouldlike o wo k wi h he RS hack oo. I' e go many g ea class a e p's ommy d ...bu I'm eally looking o wa ds o wo king wi h F ank's Box. Glad o mee y'all.Ca ol B.Shed hose ex a pounds wi h MSN and The Bigges Lose ! Lea n mo e."}