{"id": "5856", "subject": "Re: [EVP-ITC] Re: RS12469 direct recording", "author": "Ron Lederer", "timestamp": "2008-01-20T19:13:37Z", "full_text": "--0-33221915-1200856417=:29526\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nLaura   Thanks for the coaching tips.  I will try all of what you suggest.  On the 31st a friend will be bringing an antenna booster here from the U.S.  Meanwhile I will keep working with EVP maker.  Patience is probably my biggest obstacle but persistence is on my side.   I have had a taste of success and I like it.  I will post any results.   Thanks again   Ron L \n\nLC Duplatt &lt;lcdupla@...&gt; wrote:           Ron,\n\nI visited Mayan ruins in the Progresso/Merida region about 5 years \nago...fascinating to me and very spiritual.\n\nI just want to encourage you. Set-up a certain time to run sessions \nweekly. Let&#39;s say you could do it Monday -Thursday at 10:00 AM for \nexample. This way, an expectation is set and a plan is in order. \nKeep recording small sessions and then analyze them. Ask questions, \nsimple basic questions for responses each day. Don&#39;t give up. I \npesonally have noticed this has helped me and something is building \nwith the contacts and quality of the messages. For me it began with \na staggered &quot;Yes,&quot; and other one words occasionally. Now I am \nhearing sentences and very intelligable responses that I know are not \nradio bit coincidences. The biggest help any of us can give you is \nto remain patient and continue experimenting, looking for not only \nwhat works for you, but giving those on the other side time to find \nyou and get a message or two across. It will come - I am certain of \nit.\n\nFor some reason, the amount of audio bits seem to help with the \ncommunication, as I can tell...even when I have received EVP-like \nmessages above or over the audio bits in the background. I do not \nunderstand why. Here are two ideas I have for you to pick up more AM \naudio:\n\n1) Try an AM antenna booster (Radio Shack sells them. I think Juli \nhas had some success with hers).\n2) You may try more than one hacked radio sweeping at different \nplaces on the band. Pipe the audio through a mixer, and output it \nthrough amplified speakers or directly into the recorder. This way, \nyou wil have audio bits throughout - even if you have to use 3 radios \nto do it.\n\nLC\nhttp://www.AngelsGhosts.com\n\n--- In EVP-ITC@yahoogroups.com, Ron Lederer &lt;ronriko@...&gt; wrote:\n&gt;\n&gt; Laura I am on the Yucatan peninsula. The very tip of the \npeninsula is about a two hour drive for me. Nowhere near \nBrownsville, Texas. I need to fly out of here which usually takes me \nfrom Merida to Houston or Florida. Stop on by. Ron\n&gt; \n&gt; Laura Kimberley &lt;gjk1rrfan@...&gt; wrote: How far are \nyou from Brownsville?\n&gt; \n&gt; Laura\n&gt; \n&gt; From: EVP-ITC@yahoogroups.com [mailto:EVP-\nITC@yahoogroups.com] On Behalf Of Ron Lederer\n&gt; Sent: Saturday, January 19, 2008 8:56 PM\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Subject: Re: [EVP-ITC] RS12469 direct recording\n&gt; \n&gt; \n&gt; \n&gt; Thanks all for getting back so quickly. It probably \nmakes me feel a bit better if nothing is on the recording since I \ndon&#39;t seem to pick anything up anyway. The &quot;Ask Bruce is a bit of \nsurprise only because I already did ask bruce. He had suggested I \ntry a direct recording. \n&gt; \n&gt; \n&gt; \n&gt; This actually brings up a question about what Steve hears. Is \nit possible that you are getting a message given to you at the time \nyou are listening to my recording which actually does not have the \nmessage? I must say I am still overwhelmed from getting messages on \nthe other evp maker recording (that others hear). My pea brain and \nbody are still processing that information. \n&gt; \n&gt; \n&gt; \n&gt; Laui asked: I am in Campeche, Campeche, Mexico. City of, \nState of. I can skip a rock across the Gulf to hit Texas or \nLouisiana. Ron L \n&gt; \n&gt; urkel23@... wrote:\n&gt; \n&gt; I managed to pull out 1 file for you that i thought may \nbe something. I believe they say &quot;Ask Bruce----Bruce&quot;\n&gt; \n&gt; \n&gt; \n&gt; -Steve H.\n&gt; \n&gt; \n&gt; \n&gt; I think this was about 40 sec. in, i slowed it down a bit.\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; In a message dated 1/19/2008 8:57:28 P.M. Eastern Standard \nTime, ronriko@... writes:\n&gt; \n&gt; I have posted a direct recording in my file under \nRS12-469 Direct Recording. This may be a good opportunity to get \nhelp with my technical challange here in Mexico. I have posted what \nI recorded from AM signals along the beach here on the Gulf with the \nrecorder patched directly into the RS 12 469. Most channels are \nSpanish language although one or two channels skip across the Gulf \nfromTexas. So you shouldn&#39;t hear many English words from the radio \nif any.\n&gt; \n&gt; \n&gt; \n&gt; I am submitting this because, with the help of this group, I \nrecently learned that I have been missing all the messages on my \nrecordings. That is...I couldn&#39;t hear anything where others with \nexperience hear plenty.\n&gt; \n&gt; \n&gt; \n&gt; My previous post was with EVP make r. If somethng could be \nheard on the RS recording patched directly into my recorder that \nwould be another amazing event for me. I of course hear nothing from \nthe other side. Ron L\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; ---------------------------------\n&gt; \n&gt; Looking for last minute shopping deals? Find them fast with \nYahoo! Search. \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; ---------------------------------\n&gt; \n&gt; Start the year off right. Easy ways to stay in shape in the new \nyear. \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; ---------------------------------\n&gt; \n&gt; Looking for last minute shopping deals? Find them fast with \nYahoo! Search.\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; ---------------------------------\n&gt; Be a better friend, newshound, and know-it-all with Yahoo! Mobile. \nTry it now.\n&gt;\n\n\n\n                         \n\n       \n---------------------------------\nLooking for last minute shopping deals?  Find them fast with Yahoo! Search.\r\n--0-33221915-1200856417=:29526\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nLaura&nbsp;&nbsp; Thanks for the coaching tips.&nbsp; I will try all of what you suggest.&nbsp; On the 31st a friend will be bringing an antenna booster here from the U.S.&nbsp; Meanwhile I will keep working with EVP maker.&nbsp; Patience is probably my biggest obstacle but persistence is on my side.&nbsp;&nbsp; I have had a taste of success and I like it.&nbsp; I will&nbsp;post any results.&nbsp;&nbsp;&nbsp;Thanks again&nbsp;&nbsp; Ron L&nbsp;&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;LC Duplatt &lt;lcdupla@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:   &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;DIV&gt;Ron,&lt;BR&gt;&lt;BR&gt;I visited Mayan ruins in the Progresso/Merida region about\n 5 years &lt;BR&gt;ago...fascinating to me and very spiritual.&lt;BR&gt;&lt;BR&gt;I just want to encourage you. Set-up a certain time to run sessions &lt;BR&gt;weekly. Let&#39;s say you could do it Monday -Thursday at 10:00 AM for &lt;BR&gt;example. This way, an expectation is set and a plan is in order. &lt;BR&gt;Keep recording small sessions and then analyze them. Ask questions, &lt;BR&gt;simple basic questions for responses each day. Don&#39;t give up. I &lt;BR&gt;pesonally have noticed this has helped me and something is building &lt;BR&gt;with the contacts and quality of the messages. For me it began with &lt;BR&gt;a staggered &quot;Yes,&quot; and other one words occasionally. Now I am &lt;BR&gt;hearing sentences and very intelligable responses that I know are not &lt;BR&gt;radio bit coincidences. The biggest help any of us can give you is &lt;BR&gt;to remain patient and continue experimenting, looking for not only &lt;BR&gt;what works for you, but giving those on the other side time to find &lt;BR&gt;you and get a message or two across. It will come - I am certain of\n &lt;BR&gt;it.&lt;BR&gt;&lt;BR&gt;For some reason, the amount of audio bits seem to help with the &lt;BR&gt;communication, as I can tell...even when I have received EVP-like &lt;BR&gt;messages above or over the audio bits in the background. I do not &lt;BR&gt;understand why. Here are two ideas I have for you to pick up more AM &lt;BR&gt;audio:&lt;BR&gt;&lt;BR&gt;1) Try an AM antenna booster (Radio Shack sells them. I think Juli &lt;BR&gt;has had some success with hers).&lt;BR&gt;2) You may try more than one hacked radio sweeping at different &lt;BR&gt;places on the band. Pipe the audio through a mixer, and output it &lt;BR&gt;through amplified speakers or directly into the recorder. This way, &lt;BR&gt;you wil have audio bits throughout - even if you have to use 3 radios &lt;BR&gt;to do it.&lt;BR&gt;&lt;BR&gt;LC&lt;BR&gt;&lt;A href=&quot;http://www.angelsghosts.com/&quot;&gt;http://www.AngelsGh&lt;WBR&gt;osts.com&lt;/A&gt;&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;, Ron Lederer &lt;ronriko@...&lt;WBR&gt;&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; Laura I am on the Yucatan peninsula.\n The very tip of the &lt;BR&gt;peninsula is about a two hour drive for me. Nowhere near &lt;BR&gt;Brownsville, Texas. I need to fly out of here which usually takes me &lt;BR&gt;from Merida to Houston or Florida. Stop on by. Ron&lt;BR&gt;&gt; &lt;BR&gt;&gt; Laura Kimberley &lt;gjk1rrfan@.&lt;WBR&gt;..&gt; wrote: How far are &lt;BR&gt;you from Brownsville?&lt;BR&gt;&gt; &lt;BR&gt;&gt; Laura&lt;BR&gt;&gt; &lt;BR&gt;&gt; From: &lt;A href=&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt; [mailto:EVP-&lt;BR&gt;&lt;A href=&quot;mailto:ITC%40yahoogroups.com&quot;&gt;ITC@yahoogroups.&lt;WBR&gt;com&lt;/A&gt;] On Behalf Of Ron Lederer&lt;BR&gt;&gt; Sent: Saturday, January 19, 2008 8:56 PM&lt;BR&gt;&gt; To: &lt;A href=&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;&lt;BR&gt;&gt; Subject: Re: [EVP-ITC] RS12469 direct recording&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; Thanks all for getting back so quickly. It probably &lt;BR&gt;makes me feel a bit better if nothing is on the recording since I &lt;BR&gt;don&#39;t seem to pick anything up anyway. The &quot;Ask Bruce is a bit of &lt;BR&gt;surprise only\n because I already did ask bruce. He had suggested I &lt;BR&gt;try a direct recording. &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; This actually brings up a question about what Steve hears. Is &lt;BR&gt;it possible that you are getting a message given to you at the time &lt;BR&gt;you are listening to my recording which actually does not have the &lt;BR&gt;message? I must say I am still overwhelmed from getting messages on &lt;BR&gt;the other evp maker recording (that others hear). My pea brain and &lt;BR&gt;body are still processing that information. &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; Laui asked: I am in Campeche, Campeche, Mexico. City of, &lt;BR&gt;State of. I can skip a rock across the Gulf to hit Texas or &lt;BR&gt;Louisiana. Ron L &lt;BR&gt;&gt; &lt;BR&gt;&gt; urkel23@... wrote:&lt;BR&gt;&gt; &lt;BR&gt;&gt; I managed to pull out 1 file for you that i thought may &lt;BR&gt;be something. I believe they say &quot;Ask Bruce----Bruce&quot;&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; -Steve H.&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; I think this was about 40 sec. in, i slowed it\n down a bit.&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; In a message dated 1/19/2008 8:57:28 P.M. Eastern Standard &lt;BR&gt;Time, ronriko@... writes:&lt;BR&gt;&gt; &lt;BR&gt;&gt; I have posted a direct recording in my file under &lt;BR&gt;RS12-469 Direct Recording. This may be a good opportunity to get &lt;BR&gt;help with my technical challange here in Mexico. I have posted what &lt;BR&gt;I recorded from AM signals along the beach here on the Gulf with the &lt;BR&gt;recorder patched directly into the RS 12 469. Most channels are &lt;BR&gt;Spanish language although one or two channels skip across the Gulf &lt;BR&gt;fromTexas. So you shouldn&#39;t hear many English words from the radio &lt;BR&gt;if any.&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; I am submitting this because, with the help of this group, I &lt;BR&gt;recently learned that I have been missing all the messages on my &lt;BR&gt;recordings. That is...I couldn&#39;t hear anything where others with &lt;BR&gt;experience hear plenty.&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; My previous\n post was with EVP make r. If somethng could be &lt;BR&gt;heard on the RS recording patched directly into my recorder that &lt;BR&gt;would be another amazing event for me. I of course hear nothing from &lt;BR&gt;the other side. Ron L&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; ------------&lt;WBR&gt;---------&lt;WBR&gt;---------&lt;WBR&gt;---&lt;BR&gt;&gt; &lt;BR&gt;&gt; Looking for last minute shopping deals? Find them fast with &lt;BR&gt;Yahoo! Search. &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; ------------&lt;WBR&gt;---------&lt;WBR&gt;---------&lt;WBR&gt;---&lt;BR&gt;&gt; &lt;BR&gt;&gt; Start the year off right. Easy ways to stay in shape in the new &lt;BR&gt;year. &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; ------------&lt;WBR&gt;---------&lt;WBR&gt;---------&lt;WBR&gt;---&lt;BR&gt;&gt; &lt;BR&gt;&gt; Looking for last minute shopping deals? Find them fast with &lt;BR&gt;Yahoo! Search.&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt;\n ------------&lt;WBR&gt;---------&lt;WBR&gt;---------&lt;WBR&gt;---&lt;BR&gt;&gt; Be a better friend, newshound, and know-it-all with Yahoo! Mobile. &lt;BR&gt;Try it now.&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;p&gt;&#32;\n      &lt;hr size=1&gt;Looking for last minute shopping deals? &lt;a href=&quot;http://us.rd.yahoo.com/evt=51734/*http://tools.search.yahoo.com/newsearch/category.php?category=shopping&quot;&gt; \nFind them fast with Yahoo! Search.&lt;/a&gt;\r\n--0-33221915-1200856417=:29526--"}