{"id": "5866", "subject": "Re: Another weird device", "author": "ecuyler", "timestamp": "2008-01-20T21:55:20Z", "full_text": "Whatever they are, it&#39;s looks neat.  Can&#39;t wait to hear/see the\nresults of your test.  \nAbout the weird food before bed.  Have you taken a pregnancy test\nlately? Haaaa!\n\nJeremy\n\n\n\n\n\n\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;M.A. Coletta (Mike)&quot;\n&lt;michaelcoletta@...&gt; wrote:\n&gt;\n&gt; Hi LC,\n&gt; \n&gt; Oops... I loaded the wrong set of pictures.  It wasn&#39;t in the final \n&gt; state of weird yet.  Now I&#39;ve updated the pics to reflect what goes \n&gt; on those prongs.  I guess maybe those are vocal cords for the dead???\n&gt; \n&gt; http://www.ufogeek.com/?p=200\n&gt; \n&gt; I&#39;ve got to stop eating pickels, peppers, and ice cream before bed!\n&gt; \n&gt; - Mike.\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;LC Duplatt&quot; &lt;lcdupla@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Interesting, Mike.  \n&gt; &gt; \n&gt; &gt; I am wondering how it will work...nothing seems to make sense to me \n&gt; &gt; with any of this, but somehow we are getting responses. LOL  \n&gt; &gt; \n&gt; &gt; Yesterday, I thought of your little Listen Up! audio amplifier with \n&gt; the \n&gt; &gt; Y adapter, headphones and the recorder as an EVP recorder set-up \n&gt; for \n&gt; &gt; real time audio EVP on investigations.  My plan is to suit-up one \n&gt; of my \n&gt; &gt; EVP specialists and test in the field within the next couple \n&gt; weeks.  \n&gt; &gt; Perhaps, they might be able to hear the replies as it is being \n&gt; &gt; recorded, so they can then ask questions.  Interestingly enough, I \n&gt; just \n&gt; &gt; received an EVP over top of my ghost box sweeping audio on Friday.  \n&gt; &gt; Weird. However, I did not envision the chamber with &quot;prongs&quot;(?) \n&gt; like \n&gt; &gt; you built, though.  \n&gt; &gt; \n&gt; &gt; LOL  Can&#39;t wait to hear about your results.\n&gt; &gt; \n&gt; &gt; LC\n&gt; &gt; http://www.AngelsGhosts.com\n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;M.A. Coletta (Mike)&quot; \n&gt; &gt; &lt;michaelcoletta@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; You know me and my weird devices... yes I&#39;ve built another.\n&gt; &gt; &gt; This one came to me in a dream last night.  I think it was \n&gt; because \n&gt; &gt; some \n&gt; &gt; &gt; of you guys were talking about echo chambers.\n&gt; &gt; &gt; Anyway... when I woke up I went looking around the house for \n&gt; stuff to \n&gt; &gt; &gt; make this thing before I forgot what it looked like in my dream.\n&gt; &gt; &gt; I completed it but now I guess I must test it to see if it is \n&gt; what I \n&gt; &gt; &gt; think it is... an EVP Box, maybe???\n&gt; &gt; &gt; \n&gt; &gt; &gt; Read more and see a few pictures, here: http://www.ufogeek.com/?\n&gt; p=200\n&gt; &gt; &gt; \n&gt; &gt; &gt; - Mike\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}