{"id": "5869", "subject": "Re: [EVP-ITC] Re: Another weird device", "author": "Lisby", "timestamp": "2008-01-20T22:24:54Z", "full_text": "It looks like a lovely appetizer from the menu at Snork&#39;s over on  \nTau Seti XVII, Mike. Does it come with grunk sauce?\n\nAnn\n\n\nOn Jan 20, 2008, at 4:36 PM, M.A. Coletta (Mike) wrote:\n\n&gt; Hi LC,\n&gt;\n&gt; Oops... I loaded the wrong set of pictures. It wasn&#39;t in the final\n&gt; state of weird yet. Now I&#39;ve updated the pics to reflect what goes\n&gt; on those prongs. I guess maybe those are vocal cords for the dead???\n&gt;\n&gt; http://www.ufogeek.com/?p=200\n&gt;\n&gt; I&#39;ve got to stop eating pickels, peppers, and ice cream before bed!\n&gt;\n&gt; - Mike.\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, &quot;LC Duplatt&quot; &lt;lcdupla@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Interesting, Mike.\n&gt; &gt;\n&gt; &gt; I am wondering how it will work...nothing seems to make sense to me\n&gt; &gt; with any of this, but somehow we are getting responses. LOL\n&gt; &gt;\n&gt; &gt; Yesterday, I thought of your little Listen Up! audio amplifier with\n&gt; the\n&gt; &gt; Y adapter, headphones and the recorder as an EVP recorder set-up\n&gt; for\n&gt; &gt; real time audio EVP on investigations. My plan is to suit-up one\n&gt; of my\n&gt; &gt; EVP specialists and test in the field within the next couple\n&gt; weeks.\n&gt; &gt; Perhaps, they might be able to hear the replies as it is being\n&gt; &gt; recorded, so they can then ask questions. Interestingly enough, I\n&gt; just\n&gt; &gt; received an EVP over top of my ghost box sweeping audio on Friday.\n&gt; &gt; Weird. However, I did not envision the chamber with &quot;prongs&quot;(?)\n&gt; like\n&gt; &gt; you built, though.\n&gt; &gt;\n&gt; &gt; LOL Can&#39;t wait to hear about your results.\n&gt; &gt;\n&gt; &gt; LC\n&gt; &gt; http://www.AngelsGhosts.com\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;M.A. Coletta (Mike)&quot;\n&gt; &gt; &lt;michaelcoletta@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; You know me and my weird devices... yes I&#39;ve built another.\n&gt; &gt; &gt; This one came to me in a dream last night. I think it was\n&gt; because\n&gt; &gt; some\n&gt; &gt; &gt; of you guys were talking about echo chambers.\n&gt; &gt; &gt; Anyway... when I woke up I went looking around the house for\n&gt; stuff to\n&gt; &gt; &gt; make this thing before I forgot what it looked like in my dream.\n&gt; &gt; &gt; I completed it but now I guess I must test it to see if it is\n&gt; what I\n&gt; &gt; &gt; think it is... an EVP Box, maybe???\n&gt; &gt; &gt;\n&gt; &gt; &gt; Read more and see a few pictures, here: http://www.ufogeek.com/?\n&gt; p=200\n&gt; &gt; &gt;\n&gt; &gt; &gt; - Mike\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;\n&gt; \n\n\nI looks like a lo ely appe ize om he menu a Sno k's o e on Tau Se i XVII, Mike. Does i come wi h g unk sauce?AnnOn Jan 20, 2008, a 4:36 PM, M.A. Cole a (Mike) w o e:Hi LC,Oops... I loaded he w ong se o pic u es. I wasn' in he inal s a e o wei d ye . Now I' e upda ed he pics o e lec wha goes on hose p ongs. I guess maybe hose a e ocal co ds o he dead???h p://www.u ogeek.com/?p=200I' e go o s op ea ing pickels, peppe s, and ice c eam be o e bed!- Mike.--- In EVP-ITC@yahoog oups.com, \"LC Dupla \" > w o e:>> In e es ing, Mike. > > I am wonde ing how i will wo k...no hing seems o make sense o me > wi h any o his, bu somehow we a e ge ing esponses. LOL > > Yes e day, I hough o you li le Lis en Up! audio ampli ie wi h  he > Y adap e , headphones and he eco de as an EVP eco de se -up  o  > eal ime audio EVP on in es iga ions. My plan is o sui -up one o my > EVP specialis s and es in he ield wi hin he nex couple weeks. > Pe haps, hey migh be able o hea he eplies as i is being > eco ded, so hey can hen ask ques ions. In e es ingly enough, I jus  > ecei ed an EVP o e op o my ghos box sweeping audio on F iday. > Wei d. Howe e , I did no en ision he chambe wi h \"p ongs\"(?) like > you buil , hough. > > LOL Can' wai o hea abou you esul s.> > LC> h p://www.AngelsGhos s.com> > --- In EVP-ITC@yahoog oups.com, \"M.A. Cole a (Mike)\" > > w o e:> >> > You know me and my wei d de ices... yes I' e buil ano he .> > This one came o me in a d eam las nigh . I hink i was because > some > > o you guys we e alking abou echo chambe s.> > Anyway... when I woke up I wen looking a ound he house o  s u o > > make his hing be o e I o go wha i looked like in my d eam.> > I comple ed i bu now I guess I mus es i o see i i is wha I > > hink i is... an EVP Box, maybe???> > > > Read mo e and see a ew pic u es, he e: h p://www.u ogeek.com/?p=200> > > > - Mike> >>"}