{"id": "5917", "subject": "Babs has Issues!", "author": "babiarz3", "timestamp": "2008-01-21T15:34:01Z", "full_text": "Alright, you all know I&#39;m vocal and I haven&#39;t made any &quot;friends&quot; here\nbut, if we can put that aside for a moment...\n\nSpirit communication has been my passion since day one, a little over\n6 years ago. I am a believer in the afterlife and a believer in\nspirits attempting to communicate with us for a variety of reasons. I\nhave spiritual beliefs that I feel strongly about and devote much of\nmy waking (and sleeping) moments to thoughts about this field.\nHowever, I am also a researcher and a skeptic. In order for me to\nallow ideas to become part of my reality I must experiment. In order\nfor me to believe something is paranormal I HAVE to rule out all other\npossible causes. That being said, I have some questions. My hope is\nthat there are some here willing to enter into discussion with me.\n\nI have a difficult time with many of the files here. Many times, there\nis no question included in the file. I can not determine whether or\nnot the &quot;reply&quot; is an intelligent reply. Maybe this has to do with\nallowable file size.\n\nSome of the files I have been able to download. (I don&#39;t always keep\nmy email settings on for this group as I get too many - lol) When I\nlook at the file I see problems. There will be complete flat line\nsilence between the words. Many times the &quot;reply&quot; is also at the same\ndecibel as the question askers voice. Those two things should not\noccur naturally considering the devices being used. That tells me that\nthere is manipulation of the files. Now, what is manipulation to me,\nmay not be manipulation to others. To me, any altering of the recorded\nfile constitutes manipulation. I do not know if the reply was\nintelligent or manipulated to be intelligent. \n\nSome say that they simply remove the &quot;no response&quot; time. I&#39;ve been\ntold it can be as much as 18 seconds removed from between words. Now\nwe run into the problem of us deciding what word fits in with the\nquestion. What words are being ignored?  Did we take nonsense and make\nsense? Did we amp every noise/word or only what fit?\n\nI think it&#39;s great that files are offered for peer review. However, I\nthink we have to load them untouched or at the very least, offer\nexactly what was done to the entire file. Time elapsed between words,\nwhat was amped, etc. I&#39;d also love to see some of these sessions video\ntaped with the question asker facing the camera and a second hand\nclock visible. Truly, we aren&#39;t researching if we don&#39;t have some\nprotocol in place.\n\nHere is an issue I have with the RS Hacks. I have the 469. It takes\napproximately 18 seconds to scan through the AM frequencies. Now, the\ntypical person would think that we can take that 18 seconds and divide\nit by the number of AM stations to determine how long we are on each\nstation before moving on to the next one. In that way we could\ndetermine what is impossible to be said via a radio fragment. However,\nthat&#39;s not correct. The scan cycle can vary from one frequency to the\nnext and of course the biggest problem is that some stations are\npicked up over multiple frequencies; AM 640 can be heard on 630, 640,\n650, 660 and maybe even 670. That extends the time a great deal. This\nis a difficult problem because it is almost impossible for the average\nperson to be able to make a determination on time this way. \n\nI heard about the following today; An experimenter records at the same\ntime every day Mon-Fri. We hear about the importance of meditating,\nautomatic writing, etc at the same time every day but what we have to\nremember with this, is that now we are in essence tuning into the same\nradio show every day. One of my first experiments with the 469 had me\nhearing this deep male voice over and over again. What was he trying\nto tell me, I wondered. Than I realized that he was speaking\napproximately every 18 seconds; every time the scan hit that station.\nSo, if you are removing up to 18 seconds between words, then you are\nreally only recording the words from one station. \n\nThis post is IN NO WAY trying to start anything besides discussion\nabout some research problems. I know that there are those who are not\nconcerned with anything more than the communication itself but I think\nthat it is of the utmost importance to attempt to factor in some\nprotocol in order for this to be considered serious research at all."}