{"id": "5935", "subject": "Re: Babs has Issues!", "author": "LC Duplatt", "timestamp": "2008-01-21T16:38:06Z", "full_text": "Babs,\n\nI cannot answer many of your questions yet, as I am experimenting \nwith different set-ups, methods, etc.  It is I who have a set-period \nof time set aside for these experiments...and with good reason.\n\nMy personal feelings are that there needs to be a commitment - \nsomething for the other side to rely upon with respect to me.  That \nexpectation can then build to better audio responses-questions.  If \nwe think we can spot shoot this like EVP and develop consistent, \ngood, 2-way communication, I suspect we are in error.  I understand \nthe same radio shows are going on at the same time, but I am looking \nbeyond that.  It is my hope that once solid contact is proven, that I \ncan move beyond my current set-times.  Personally, I want to hear \nintelligent replies that cannot be random chance.  Several of my \nrecordings have convinced me, and they are in my files on this \nboard.  Two of them I will mention specifically:\n\n1) 11808womanghostvoice2.wav: The response I received from a woman&#39;s \nvoice over top of the audio.  This was not radio jibberish, but more \nlike an EVP.  The woman&#39;s voice was loud, and slowly annunciating the \nmessage for me to be able to hear it.\n\n2) phonecallthatsbrucebruce11808.wav: I had asked a question about \nsomeone receiving a phone call.  In the audio, you can hear, &quot;Phone \ncall? Bruce. That&#39;s Bruce.&quot;  I ask, &quot;Am I going to receive the phone \ncall?&quot; and the response is not a &quot;yes&quot; or &quot;no,&quot; but again, &quot;Bruce.&quot;  \nThat would be very hard to receive by chance, in my opinion.  You&#39;ll \nneed headphones to hear it, but it&#39;s there.\n\nRegarding the processing of audio, I am now moving to direct record \nwith only trimming the audio segment out of the entire recording, no \ncuts, and only normalizing it to about 60db.  An example of this is \nthe recording I made and uploaded this morning \nentitled, &quot;spiritsspeakchuck12108.wav.&quot; \n\nBabs, you are going to have to experiment on your own and come to \nyour own conclusions, I suspect.  That&#39;s what I am doing...trying to \nfind what works for me and proves (to me) that I have broken \nthrough.  You sound frustrated with the results you have had so far, \nand I understand (especially with the 12-469). However, I do believe \nthere is more than one person (or even 30 people) who will be able to \ndo this consistently. Also, I would say that to believe only random \nvs linear sweeps of the band will work, does not remove any of the \nsame possible errors you propose, really. ;)\n\nIn all, it&#39;s coming along I feel, but more experiments will need to \nbe done.  \n\nLC\nhttp://www.AngelsGhosts.com\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;babiarz3&quot; &lt;babiarz3@...&gt; wrote:\n&gt;\n&gt; Alright, you all know I&#39;m vocal and I haven&#39;t made any &quot;friends&quot; \nhere\n&gt; but, if we can put that aside for a moment...\n&gt; \n&gt; Spirit communication has been my passion since day one, a little \nover\n&gt; 6 years ago. I am a believer in the afterlife and a believer in\n&gt; spirits attempting to communicate with us for a variety of reasons. \nI\n&gt; have spiritual beliefs that I feel strongly about and devote much of\n&gt; my waking (and sleeping) moments to thoughts about this field.\n&gt; However, I am also a researcher and a skeptic. In order for me to\n&gt; allow ideas to become part of my reality I must experiment. In order\n&gt; for me to believe something is paranormal I HAVE to rule out all \nother\n&gt; possible causes. That being said, I have some questions. My hope is\n&gt; that there are some here willing to enter into discussion with me.\n&gt; \n&gt; I have a difficult time with many of the files here. Many times, \nthere\n&gt; is no question included in the file. I can not determine whether or\n&gt; not the &quot;reply&quot; is an intelligent reply. Maybe this has to do with\n&gt; allowable file size.\n&gt; \n&gt; Some of the files I have been able to download. (I don&#39;t always keep\n&gt; my email settings on for this group as I get too many - lol) When I\n&gt; look at the file I see problems. There will be complete flat line\n&gt; silence between the words. Many times the &quot;reply&quot; is also at the \nsame\n&gt; decibel as the question askers voice. Those two things should not\n&gt; occur naturally considering the devices being used. That tells me \nthat\n&gt; there is manipulation of the files. Now, what is manipulation to me,\n&gt; may not be manipulation to others. To me, any altering of the \nrecorded\n&gt; file constitutes manipulation. I do not know if the reply was\n&gt; intelligent or manipulated to be intelligent. \n&gt; \n&gt; Some say that they simply remove the &quot;no response&quot; time. I&#39;ve been\n&gt; told it can be as much as 18 seconds removed from between words. Now\n&gt; we run into the problem of us deciding what word fits in with the\n&gt; question. What words are being ignored?  Did we take nonsense and \nmake\n&gt; sense? Did we amp every noise/word or only what fit?\n&gt; \n&gt; I think it&#39;s great that files are offered for peer review. However, \nI\n&gt; think we have to load them untouched or at the very least, offer\n&gt; exactly what was done to the entire file. Time elapsed between \nwords,\n&gt; what was amped, etc. I&#39;d also love to see some of these sessions \nvideo\n&gt; taped with the question asker facing the camera and a second hand\n&gt; clock visible. Truly, we aren&#39;t researching if we don&#39;t have some\n&gt; protocol in place.\n&gt; \n&gt; Here is an issue I have with the RS Hacks. I have the 469. It takes\n&gt; approximately 18 seconds to scan through the AM frequencies. Now, \nthe\n&gt; typical person would think that we can take that 18 seconds and \ndivide\n&gt; it by the number of AM stations to determine how long we are on each\n&gt; station before moving on to the next one. In that way we could\n&gt; determine what is impossible to be said via a radio fragment. \nHowever,\n&gt; that&#39;s not correct. The scan cycle can vary from one frequency to \nthe\n&gt; next and of course the biggest problem is that some stations are\n&gt; picked up over multiple frequencies; AM 640 can be heard on 630, \n640,\n&gt; 650, 660 and maybe even 670. That extends the time a great deal. \nThis\n&gt; is a difficult problem because it is almost impossible for the \naverage\n&gt; person to be able to make a determination on time this way. \n&gt; \n&gt; I heard about the following today; An experimenter records at the \nsame\n&gt; time every day Mon-Fri. We hear about the importance of meditating,\n&gt; automatic writing, etc at the same time every day but what we have \nto\n&gt; remember with this, is that now we are in essence tuning into the \nsame\n&gt; radio show every day. One of my first experiments with the 469 had \nme\n&gt; hearing this deep male voice over and over again. What was he trying\n&gt; to tell me, I wondered. Than I realized that he was speaking\n&gt; approximately every 18 seconds; every time the scan hit that \nstation.\n&gt; So, if you are removing up to 18 seconds between words, then you are\n&gt; really only recording the words from one station. \n&gt; \n&gt; This post is IN NO WAY trying to start anything besides discussion\n&gt; about some research problems. I know that there are those who are \nnot\n&gt; concerned with anything more than the communication itself but I \nthink\n&gt; that it is of the utmost importance to attempt to factor in some\n&gt; protocol in order for this to be considered serious research at all.\n&gt;"}