{"id": "5941", "subject": "Re: Babs has Issues!", "author": "babiarz3", "timestamp": "2008-01-21T17:07:05Z", "full_text": "Time is absolutely being removed from the audio files. There is so\nmuch more than just listening to the files, you have too look. You\nhave to train your eyes as well as your ears to make any sort of\njudgment. The second I load some of these files, before I listen, I\nsee problems. I know the site isn&#39;t set up to really leave comments on\nfiles with the file but something should be included in the name or\nsomething. Without it, it is not true representation of what the file\nis or what has happened between the capture and the post. We listen\nand think &quot;Wow! Great catch&quot; but we really do not know. \n\nAre you starting the scan on your 3 469&#39;s at different frequencies?\nWhat is the ratio being mixed? Is it equal between the three? \n\nI believe that Mark and Debbie Constantino (sp)of Nevada use water\nalmost exclusively for their recordings. I have found that method to\nbe difficult in hearing the results. Are you feeling that those\ncommunications are from spirits or earthbounds and what makes you feel\nthat way?\n\nI&#39;ve recently started analyzing a 40 min 469 session. The results are\nscary. I&#39;d say at this point, and I&#39;m only 1/2 way through, 90% of the\ncommunication is negative in nature and mentions many supposed Demonic\nnames. The layers of voices are, in many cases, multiple. Often, the\nlistener hears very little of what is actually said. The voices can be\nmocking or downright crude. I have not yet formed an opinion fully but\nit would seem to me that these models are easy devices for lower level\nentities to figure out how to use. I can not speak of the attitudes or\nfears of those investigators present although at times, their voices\nare a bit shaky. \n\nBabs\n\n--- In EVP-ITC@yahoogroups.com, Frank Ratka &lt;warrior18eii@...&gt; wrote:\n&gt;\n&gt; Very good observation Babs. Let me say that you have many friends\nand associates here just for the simple fact that you have an interest\nin ITC, are a researcher and a complex thinker. I think we have shown\nin the past that we can have a disagreement and still remain friends.\nYou make a lot of good points in your post and I would like to know\nwho removes time from their recordings. I have never removed time from\nmy recordings and see no reason why anyone else would without saying\nso in an accompanied post.\n&gt; \n&gt; I have limited experience with the 12-469&#39;s as a single piece of\nequipment. I have arranged mine per Mike&#39;s, &quot;Spiricomp&quot; design. I have\n3, 12-469&#39;s feeding a four channel mixer, which goes into a laptop\nrunning DC6 with Soundsoap 2. Mine scan equally spaced on the FM band.\nI have had pretty good results until recently.\n&gt; \n&gt; At first the messages were pretty clear but I had a feeling I was\ngetting a different group than I normally have for the last few years.\nWhen I would ask about my friends on the other side they would tell me\nthey will look for them. Well about 2 weeks ago the 12-469 arrangement\nstarted generating a lot of interference and feedback. I started\nhearing radio static voices as I use to get with shortwave. Not voice\nfragments but voices made of static (metallic and robotic). They were\nbreaking through the sweeping. I had a feeling someone else was trying\nto force their way through. Finally the interference got so bad I was\nforced to revert back to a simpler method I used before, which is\nusing fan noise. One of the first messages to come across was from a\nfamiliar voice telling me and I quote, &quot;your method sucks&quot;. I have not\nused the 12-469&#39;s since because of the clear messages I have been\ngetting using water and fan noise. That does not mean I have given up\n&gt;  on the 12-469&#39;s but I won&#39;t use them again until I am persuaded to\nby my friends on the otherside that they are willing to use and adapt\nto it. To my knowledge only Misty, Laura and myself use water for\nrecording.\n&gt; \n&gt; Regards,\n&gt; \n&gt; Frank R.\n&gt; \n&gt; ----- Original Message ----\n&gt; From: babiarz3 &lt;babiarz3@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Monday, January 21, 2008 9:34:01 AM\n&gt; Subject: [EVP-ITC] Babs has Issues!\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;   \n&gt; \n&gt; \n&gt;     \n&gt;             Alright, you all know I&#39;m vocal and I haven&#39;t made any\n&quot;friends&quot; here\n&gt; \n&gt; but, if we can put that aside for a moment...\n&gt; \n&gt; \n&gt; \n&gt; Spirit communication has been my passion since day one, a little over\n&gt; \n&gt; 6 years ago. I am a believer in the afterlife and a believer in\n&gt; \n&gt; spirits attempting to communicate with us for a variety of reasons. I\n&gt; \n&gt; have spiritual beliefs that I feel strongly about and devote much of\n&gt; \n&gt; my waking (and sleeping) moments to thoughts about this field.\n&gt; \n&gt; However, I am also a researcher and a skeptic. In order for me to\n&gt; \n&gt; allow ideas to become part of my reality I must experiment. In order\n&gt; \n&gt; for me to believe something is paranormal I HAVE to rule out all other\n&gt; \n&gt; possible causes. That being said, I have some questions. My hope is\n&gt; \n&gt; that there are some here willing to enter into discussion with me.\n&gt; \n&gt; \n&gt; \n&gt; I have a difficult time with many of the files here. Many times, there\n&gt; \n&gt; is no question included in the file. I can not determine whether or\n&gt; \n&gt; not the &quot;reply&quot; is an intelligent reply. Maybe this has to do with\n&gt; \n&gt; allowable file size.\n&gt; \n&gt; \n&gt; \n&gt; Some of the files I have been able to download. (I don&#39;t always keep\n&gt; \n&gt; my email settings on for this group as I get too many - lol) When I\n&gt; \n&gt; look at the file I see problems. There will be complete flat line\n&gt; \n&gt; silence between the words. Many times the &quot;reply&quot; is also at the same\n&gt; \n&gt; decibel as the question askers voice. Those two things should not\n&gt; \n&gt; occur naturally considering the devices being used. That tells me that\n&gt; \n&gt; there is manipulation of the files. Now, what is manipulation to me,\n&gt; \n&gt; may not be manipulation to others. To me, any altering of the recorded\n&gt; \n&gt; file constitutes manipulation. I do not know if the reply was\n&gt; \n&gt; intelligent or manipulated to be intelligent. \n&gt; \n&gt; \n&gt; \n&gt; Some say that they simply remove the &quot;no response&quot; time. I&#39;ve been\n&gt; \n&gt; told it can be as much as 18 seconds removed from between words. Now\n&gt; \n&gt; we run into the problem of us deciding what word fits in with the\n&gt; \n&gt; question. What words are being ignored?  Did we take nonsense and make\n&gt; \n&gt; sense? Did we amp every noise/word or only what fit?\n&gt; \n&gt; \n&gt; \n&gt; I think it&#39;s great that files are offered for peer review. However, I\n&gt; \n&gt; think we have to load them untouched or at the very least, offer\n&gt; \n&gt; exactly what was done to the entire file. Time elapsed between words,\n&gt; \n&gt; what was amped, etc. I&#39;d also love to see some of these sessions video\n&gt; \n&gt; taped with the question asker facing the camera and a second hand\n&gt; \n&gt; clock visible. Truly, we aren&#39;t researching if we don&#39;t have some\n&gt; \n&gt; protocol in place.\n&gt; \n&gt; \n&gt; \n&gt; Here is an issue I have with the RS Hacks. I have the 469. It takes\n&gt; \n&gt; approximately 18 seconds to scan through the AM frequencies. Now, the\n&gt; \n&gt; typical person would think that we can take that 18 seconds and divide\n&gt; \n&gt; it by the number of AM stations to determine how long we are on each\n&gt; \n&gt; station before moving on to the next one. In that way we could\n&gt; \n&gt; determine what is impossible to be said via a radio fragment. However,\n&gt; \n&gt; that&#39;s not correct. The scan cycle can vary from one frequency to the\n&gt; \n&gt; next and of course the biggest problem is that some stations are\n&gt; \n&gt; picked up over multiple frequencies; AM 640 can be heard on 630, 640,\n&gt; \n&gt; 650, 660 and maybe even 670. That extends the time a great deal. This\n&gt; \n&gt; is a difficult problem because it is almost impossible for the average\n&gt; \n&gt; person to be able to make a determination on time this way. \n&gt; \n&gt; \n&gt; \n&gt; I heard about the following today; An experimenter records at the same\n&gt; \n&gt; time every day Mon-Fri. We hear about the importance of meditating,\n&gt; \n&gt; automatic writing, etc at the same time every day but what we have to\n&gt; \n&gt; remember with this, is that now we are in essence tuning into the same\n&gt; \n&gt; radio show every day. One of my first experiments with the 469 had me\n&gt; \n&gt; hearing this deep male voice over and over again. What was he trying\n&gt; \n&gt; to tell me, I wondered. Than I realized that he was speaking\n&gt; \n&gt; approximately every 18 seconds; every time the scan hit that station.\n&gt; \n&gt; So, if you are removing up to 18 seconds between words, then you are\n&gt; \n&gt; really only recording the words from one station. \n&gt; \n&gt; \n&gt; \n&gt; This post is IN NO WAY trying to start anything besides discussion\n&gt; \n&gt; about some research problems. I know that there are those who are not\n&gt; \n&gt; concerned with anything more than the communication itself but I think\n&gt; \n&gt; that it is of the utmost importance to attempt to factor in some\n&gt; \n&gt; protocol in order for this to be considered serious research at all. \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;     \n&gt;   \n&gt; \n&gt;     \n&gt;     \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; &lt;!--\n&gt; \n&gt; #ygrp-mkp{\n&gt; border:1px solid #d8d8d8;font-family:Arial;margin:14px\n0px;padding:0px 14px;}\n&gt; #ygrp-mkp hr{\n&gt; border:1px solid #d8d8d8;}\n&gt; #ygrp-mkp #hd{\n&gt;\ncolor:#628c2a;font-size:85%;font-weight:bold;line-height:122%;margin:10px\n0px;}\n&gt; #ygrp-mkp #ads{\n&gt; margin-bottom:10px;}\n&gt; #ygrp-mkp .ad{\n&gt; padding:0 0;}\n&gt; #ygrp-mkp .ad a{\n&gt; color:#0000ff;text-decoration:none;}\n&gt; --&gt;\n&gt; \n&gt; \n&gt; \n&gt; &lt;!--\n&gt; \n&gt; #ygrp-sponsor #ygrp-lc{\n&gt; font-family:Arial;}\n&gt; #ygrp-sponsor #ygrp-lc #hd{\n&gt; margin:10px 0px;font-weight:bold;font-size:78%;line-height:122%;}\n&gt; #ygrp-sponsor #ygrp-lc .ad{\n&gt; margin-bottom:10px;padding:0 0;}\n&gt; --&gt;\n&gt; \n&gt; \n&gt; \n&gt; &lt;!--\n&gt; \n&gt; #ygrp-mlmsg {font-size:13px;font-family:arial, helvetica, clean,\nsans-serif;}\n&gt; #ygrp-mlmsg table {font-size:inherit;font:100%;}\n&gt; #ygrp-mlmsg select, input, textarea {font:99% arial, helvetica,\nclean, sans-serif;}\n&gt; #ygrp-mlmsg pre, code {font:115% monospace;}\n&gt; #ygrp-mlmsg * {line-height:1.22em;}\n&gt; #ygrp-text{\n&gt; font-family:Georgia;\n&gt; }\n&gt; #ygrp-text p{\n&gt; margin:0 0 1em 0;}\n&gt; #ygrp-tpmsgs{\n&gt; font-family:Arial;\n&gt; clear:both;}\n&gt; #ygrp-vitnav{\n&gt; padding-top:10px;font-family:Verdana;font-size:77%;margin:0;}\n&gt; #ygrp-vitnav a{\n&gt; padding:0 1px;}\n&gt; #ygrp-actbar{\n&gt; clear:both;margin:25px\n0;white-space:nowrap;color:#666;text-align:right;}\n&gt; #ygrp-actbar .left{\n&gt; float:left;white-space:nowrap;}\n&gt; .bld{font-weight:bold;}\n&gt; #ygrp-grft{\n&gt; font-family:Verdana;font-size:77%;padding:15px 0;}\n&gt; #ygrp-ft{\n&gt; font-family:verdana;font-size:77%;border-top:1px solid #666;\n&gt; padding:5px 0;\n&gt; }\n&gt; #ygrp-mlmsg #logo{\n&gt; padding-bottom:10px;}\n&gt; \n&gt; #ygrp-vital{\n&gt; background-color:#e0ecee;margin-bottom:20px;padding:2px 0 8px 8px;}\n&gt; #ygrp-vital #vithd{\n&gt;\nfont-size:77%;font-family:Verdana;font-weight:bold;color:#333;text-transform:uppercase;}\n&gt; #ygrp-vital ul{\n&gt; padding:0;margin:2px 0;}\n&gt; #ygrp-vital ul li{\n&gt; list-style-type:none;clear:both;border:1px solid #e0ecee;\n&gt; }\n&gt; #ygrp-vital ul li .ct{\n&gt;\nfont-weight:bold;color:#ff7900;float:right;width:2em;text-align:right;padding-right:.5em;}\n&gt; #ygrp-vital ul li .cat{\n&gt; font-weight:bold;}\n&gt; #ygrp-vital a{\n&gt; text-decoration:none;}\n&gt; \n&gt; #ygrp-vital a:hover{\n&gt; text-decoration:underline;}\n&gt; \n&gt; #ygrp-sponsor #hd{\n&gt; color:#999;font-size:77%;}\n&gt; #ygrp-sponsor #ov{\n&gt; padding:6px 13px;background-color:#e0ecee;margin-bottom:20px;}\n&gt; #ygrp-sponsor #ov ul{\n&gt; padding:0 0 0 8px;margin:0;}\n&gt; #ygrp-sponsor #ov li{\n&gt; list-style-type:square;padding:6px 0;font-size:77%;}\n&gt; #ygrp-sponsor #ov li a{\n&gt; text-decoration:none;font-size:130%;}\n&gt; #ygrp-sponsor #nc{\n&gt; background-color:#eee;margin-bottom:20px;padding:0 8px;}\n&gt; #ygrp-sponsor .ad{\n&gt; padding:8px 0;}\n&gt; #ygrp-sponsor .ad #hd1{\n&gt;\nfont-family:Arial;font-weight:bold;color:#628c2a;font-size:100%;line-height:122%;}\n&gt; #ygrp-sponsor .ad a{\n&gt; text-decoration:none;}\n&gt; #ygrp-sponsor .ad a:hover{\n&gt; text-decoration:underline;}\n&gt; #ygrp-sponsor .ad p{\n&gt; margin:0;}\n&gt; o{font-size:0;}\n&gt; .MsoNormal{\n&gt; margin:0 0 0 0;}\n&gt; #ygrp-text tt{\n&gt; font-size:120%;}\n&gt; blockquote{margin:0 0 0 4px;}\n&gt; .replbq{margin:4;}\n&gt; --&gt;\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;      \n____________________________________________________________________________________\n&gt; Be a better friend, newshound, and \n&gt; know-it-all with Yahoo! Mobile.  Try it now. \nhttp://mobile.yahoo.com/;_ylt=Ahu06i62sR8HDtDypao8Wcj9tAcJ\n&gt;"}