{"id": "5947", "subject": "Re: [EVP-ITC] Babs has Issues!", "author": "Lisby", "timestamp": "2008-01-21T17:27:01Z", "full_text": "Bruce--I do think perhaps there is one point here that possibly  \nshould be considered. Hear me out, okay, my friend? I do think that  \nmaybe I will start attaching original and cleaned up samples  \ntogether, so the two can be compared. We both know that we clean them  \nup to help the message, which *is* there and not added by us, to be  \nbetter heard. That&#39;s not the argument--at least not from me. But it  \nmight be helpful, in general, to hear the two versions side by side.\n\nThis said, to Babs: You&#39;re going to have to live with the fact that  \nnot all of the communication is in response to questions. If a  \nquestion was spoken near where the communication came through, I try  \nto include it. But there are plenty of times when I am not being  \naddressed at all, as best I can tell. They&#39;re talking amonst  \nthemselves and issuing orders, etc. So, clips without questions  \naren&#39;t going to change and you need to accept them for what they are.\n\nAs far as removing time: I don&#39;t see an issue with it if the clip is  \nnoted, rather as in journalism where we add ... to denote that  \nmaterial has been removed that was tangential to the main thrust of  \nthe quote.\n\nPersonally, I have to slow my communication stuff down by about half.  \nIt comes through incredibly fast. I don&#39;t think I&#39;m alone. Another  \ndeal-with-it issue. Slowing is not manipulating. Neither is  \namplification of fainter responses or deamplification of  \nnonassociated noise.\n\nSome if us are recording mono and some stereo. Silencing one track to  \nbetter hear another is also not manipulating it falls in the  \njournalistic convention &quot;...&quot; category, to me anyway.\n\nStill, point taken on combining both unprocessed and processed clips.\n\nAs for all the rest of the fretting about counting stations and  \ndividing up times and all, I&#39;d say if you want to do it, knock  \nyourself out. I don&#39;t think it ultimately matters because we&#39;re  \nalready postulating that most of the time, the voice we hear is not  \nthe real voice of the communicant. It doesn&#39;t matter if you hear  \nblips of the same announcer coming through at 15 second intervals.  \nIt&#39;s what the voice might say that is important. I know that isn&#39;t  \nwhat you want to hear, but I think it&#39;s probably valid.\n\nAnn\n\nOn Jan 21, 2008, at 11:52 AM, bruce halliday wrote:\n\n&gt; Frank R.,\n&gt;\n&gt; Once again pal, we are on apposing sides.\n&gt; As far as Babs having many friends here\n&gt;\n&gt; Welllll???\n&gt;\n&gt; Anyway I want to address the subject of removing time from a file.\n&gt; The way I am understanding what you mean by removing time is to\n&gt; cut segments of the recording out of the file.\n&gt;\n&gt; I myself do cut out simple noise or static fragments that are  \n&gt; naturally occurring in the sweep of the box\n&gt; for instance the minibox has an inherent hum or thump as it&#39;s  \n&gt; Creator calls it.\n&gt;\n&gt; When I receive a response through the minibox it will go something  \n&gt; like this &quot;yes HUM Bruce HUM we HUM are HUM here HUM&quot;\n&gt; I will definitely remove every HUM from between the words but that  \n&gt; does not change the message or affect the words that are spoken.\n&gt; I&#39;m assuming that is what you are talking about when you and babs  \n&gt; mention &quot;removing time&quot;\n&gt;\n&gt; I&#39;m just guessing but maybe babs is trying to insinuate that  \n&gt; researchers here are altering their files.,\n&gt; If so maybe she should be looking for that in her own back yard.  \n&gt; There must be someone she knows for a fact that is\n&gt; altering communications.\n&gt;\n&gt; And mike please lets not turn this into a whole big thing!\n&gt;\n&gt; Bruce\n&gt;\n&gt;\n&gt;\n&gt; Bruce Halliday\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; From: warrior18eii@...\n&gt; Date: Mon, 21 Jan 2008 08:03:09 -0800\n&gt; Subject: Re: [EVP-ITC] Babs has Issues!\n&gt;\n&gt; Very good observation Babs. Let me say that you have many friends  \n&gt; and associates here just for the simple fact that you have an  \n&gt; interest in ITC, are a researcher and a complex thinker. I think we  \n&gt; have shown in the past that we can have a disagreement and still  \n&gt; remain friends. You make a lot of good points in your post and I  \n&gt; would like to know who removes time from their recordings. I have  \n&gt; never removed time from my recordings and see no reason why anyone  \n&gt; else would without saying so in an accompanied post.\n&gt;\n&gt; I have limited experience with the 12-469&#39;s as a single piece of  \n&gt; equipment. I have arranged mine per Mike&#39;s, &quot;Spiricomp&quot; design. I  \n&gt; have 3, 12-469&#39;s feeding a four channel mixer, which goes into a  \n&gt; laptop running DC6 with Soundsoap 2. Mine scan equally spaced on  \n&gt; the FM band. I have had pretty good results until recently.\n&gt;\n&gt; At first the messages were pretty clear but I had a feeling I was  \n&gt; getting a different group than I normally have for the last few  \n&gt; years. When I would ask about my friends on the other side they  \n&gt; would tell me they will look for them. Well about 2 weeks ago the  \n&gt; 12-469 arrangement started generating a lot of interference and  \n&gt; feedback. I started hearing radio static voices as I use to get  \n&gt; with shortwave. Not voice fragments but voices made of static  \n&gt; (metallic and robotic). They were breaking through the sweeping. I  \n&gt; had a feeling someone else was trying to force their way through.  \n&gt; Finally the interference got so bad I was forced to revert back to  \n&gt; a simpler method I used before, which is using fan noise. One of  \n&gt; the first messages to come across was from a familiar voice telling  \n&gt; me and I quote, &quot;your method sucks&quot;. I have not used the 12-469&#39;s  \n&gt; since because of the clear messages I have been getting using water  \n&gt; and fan noise. That does not mean I have given up on the 12-469&#39;s  \n&gt; but I won&#39;t use them again until I am persuaded to by my friends on  \n&gt; the otherside that they are willing to use and adapt to it. To my  \n&gt; knowledge only Misty, Laura and myself use water for recording.\n&gt;\n&gt; Regards,\n&gt;\n&gt; Frank R.\n&gt;\n&gt; ----- Original Message ----\n&gt; From: babiarz3 &lt;babiarz3@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Monday, January 21, 2008 9:34:01 AM\n&gt; Subject: [EVP-ITC] Babs has Issues!\n&gt;\n&gt; Alright, you all know I&#39;m vocal and I haven&#39;t made any &quot;friends&quot; here\n&gt; but, if we can put that aside for a moment...\n&gt;\n&gt; Spirit communication has been my passion since day one, a little over\n&gt; 6 years ago. I am a believer in the afterlife and a believer in\n&gt; spirits attempting to communicate with us for a variety of reasons. I\n&gt; have spiritual beliefs that I feel strongly about and devote much of\n&gt; my waking (and sleeping) moments to thoughts about this field.\n&gt; However, I am also a researcher and a skeptic. In order for me to\n&gt; allow ideas to become part of my reality I must experiment. In order\n&gt; for me to believe something is paranormal I HAVE to rule out all other\n&gt; possible causes. That being said, I have some questions. My hope is\n&gt; that there are some here willing to enter into discussion with me.\n&gt;\n&gt; I have a difficult time with many of the files here. Many times, there\n&gt; is no question included in the file. I can not determine whether or\n&gt; not the &quot;reply&quot; is an intelligent reply. Maybe this has to do with\n&gt; allowable file size.\n&gt;\n&gt; Some of the files I have been able to download. (I don&#39;t always keep\n&gt; my email settings on for this group as I get too many - lol) When I\n&gt; look at the file I see problems. There will be complete flat line\n&gt; silence between the words. Many times the &quot;reply&quot; is also at the same\n&gt; decibel as the question askers voice. Those two things should not\n&gt; occur naturally considering the devices being used. That tells me that\n&gt; there is manipulation of the files. Now, what is manipulation to me,\n&gt; may not be manipulation to others. To me, any altering of the recorded\n&gt; file constitutes manipulation. I do not know if the reply was\n&gt; intelligent or manipulated to be intelligent.\n&gt;\n&gt; Some say that they simply remove the &quot;no response&quot; time. I&#39;ve been\n&gt; told it can be as much as 18 seconds removed from between words. Now\n&gt; we run into the problem of us deciding what word fits in with the\n&gt; question. What words are being ignored? Did we take nonsense and make\n&gt; sense? Did we amp every noise/word or only what fit?\n&gt;\n&gt; I think it&#39;s great that files are offered for peer review. However, I\n&gt; think we have to load them untouched or at the very least, offer\n&gt; exactly what was done to the entire file. Time elapsed between words,\n&gt; what was amped, etc. I&#39;d also love to see some of these sessions video\n&gt; taped with the question asker facing the camera and a second hand\n&gt; clock visible. Truly, we aren&#39;t researching if we don&#39;t have some\n&gt; protocol in place.\n&gt;\n&gt; Here is an issue I have with the RS Hacks. I have the 469. It takes\n&gt; approximately 18 seconds to scan through the AM frequencies. Now, the\n&gt; typical person would think that we can take that 18 seconds and divide\n&gt; it by the number of AM stations to determine how long we are on each\n&gt; station before moving on to the next one. In that way we could\n&gt; determine what is impossible to be said via a radio fragment. However,\n&gt; that&#39;s not correct. The scan cycle can vary from one frequency to the\n&gt; next and of course the biggest problem is that some stations are\n&gt; picked up over multiple frequencies; AM 640 can be heard on 630, 640,\n&gt; 650, 660 and maybe even 670. That extends the time a great deal. This\n&gt; is a difficult problem because it is almost impossible for the average\n&gt; person to be able to make a determination on time this way.\n&gt;\n&gt; I heard about the following today; An experimenter records at the same\n&gt; time every day Mon-Fri. We hear about the importance of meditating,\n&gt; automatic writing, etc at the same time every day but what we have to\n&gt; remember with this, is that now we are in essence tuning into the same\n&gt; radio show every day. One of my first experiments with the 469 had me\n&gt; hearing this deep male voice over and over again. What was he trying\n&gt; to tell me, I wondered. Than I realized that he was speaking\n&gt; approximately every 18 seconds; every time the scan hit that station.\n&gt; So, if you are removing up to 18 seconds between words, then you are\n&gt; really only recording the words from one station.\n&gt;\n&gt; This post is IN NO WAY trying to start anything besides discussion\n&gt; about some research problems. I know that there are those who are not\n&gt; concerned with anything more than the communication itself but I think\n&gt; that it is of the utmost importance to attempt to factor in some\n&gt; protocol in order for this to be considered serious research at all.\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Looking for last minute shopping deals? Find them fast with Yahoo!  \n&gt; Search.\n&gt;\n&gt; Helping your favorite cause is as easy as instant messaging. You  \n&gt; IM, we give. Learn more.\n&gt;\n&gt; \n\n\nB uce--I do hink pe haps he e is one poin he e ha possibly should be conside ed. Hea me ou , okay, my iend? I do hink ha maybe I will s a a aching o iginal and cleaned up samples oge he , so he wo can be compa ed. We bo h know ha we clean hem up o help he message, which *is* he e and no added by us, o be be e hea d. Tha 's no he a gumen --a leas no om me. Bu i migh be help ul, in gene al, o hea he wo e sions side by side.This said, o Babs: You' e going o ha e o li e wi h he ac ha no all o he communica ion is in esponse o ques ions. I a ques ion was spoken nea whe e he communica ion came h ough, I y o include i . Bu he e a e plen y o imes when I am no being add essed a all, as bes I can ell. They' e alking amons hemsel es and issuing o de s, e c. So, clips wi hou ques ions a en' going o change and you need o accep hem o wha hey a e.As a as emo ing ime: I don' see an issue wi h i i he clip is no ed, a he as in jou nalism whe e we add ... o deno e ha ma e ial has been emo ed ha was angen ial o he main h us o he quo e.Pe sonally, I ha e o slow my communica ion s u down by abou hal . I comes h ough inc edibly as . I don' hink I'm alone. Ano he deal-wi h-i issue. Slowing is no manipula ing. Nei he is ampli ica ion o ain e esponses o deampli ica ion o nonassocia ed noise.Some i us a e eco ding mono and some s e eo. Silencing one ack o be e hea ano he is also no manipula ing i alls in he jou nalis ic con en ion \"...\" ca ego y, o me anyway.S ill, poin aken on combining bo h unp ocessed and p ocessed clips.As o all he es o he e ing abou coun ing s a ions and di iding up imes and all, I'd say i you wan o do i , knock you sel ou . I don' hink i ul ima ely ma e s because we' e al eady pos ula ing ha mos o he ime, he oice we hea is no he eal oice o he communican . I doesn' ma e i you hea blips o he same announce coming h ough a 15 second in e als. I 's wha he oice migh say ha is impo an . I know ha isn' wha you wan o hea , bu I hink i 's p obably alid.AnnOn Jan 21, 2008, a 11:52 AM, b uce halliday w o e:F ank R., Once again pal, we a e on apposing sides.As a as Babs ha ing many iends he e Welllll??? Anyway I wan o add ess he subjec o emo ing ime om a ile.The way I am unde s anding wha you mean by emo ing ime is ocu segmen s o he eco ding ou o he ile. I mysel do cu ou simple noise o s a ic agmen s ha a e na u ally occu ing in he sweep o he box o ins ance he minibox has an inhe en hum o hump as i 's C ea o calls i . When I ecei e a esponse h ough he minibox i will go some hing like his \"yes HUM B uce HUM we HUM a e HUM he e HUM\"I will de ini ely emo e e e y HUM om be ween he wo ds bu ha does no change he message o a ec he wo ds ha a e spoken.I'm assuming ha is wha you a e alking abou when you and babs men ion \" emo ing ime\"  I'm jus guessing bu maybe babs is ying o insinua e ha esea che s he e a e al e ing hei iles., I so maybe she should be looking o ha in he own back ya d. The e mus be someone she knows o a ac ha isal e ing communica ions. And mike please le s no u n his in o a whole big hing! B uceB uce Halliday To: EVP-ITC@yahoog oups.comF om: wa io 18eii@yahoo.comDa e: Mon, 21 Jan 2008 08:03:09 -0800Subjec : Re: [EVP-ITC] Babs has Issues!Ve y good obse a ion Babs. Le me say ha you ha e many iends and associa es he e jus o he simple ac ha you ha e an in e es in ITC, a e a esea che and a complex hinke . I hink we ha e shown in he pas ha we can ha e a disag eemen and s ill emain iends. You make a lo o good poin s in you pos and I would like o know who emo es ime om hei eco dings. I ha e ne e emo ed ime om my eco dings and see no eason why anyone else would wi hou saying so in an accompanied pos .I ha e limi ed expe ience wi h he 12-469's as a single piece o equipmen . I ha e a anged mine pe Mike's, \"Spi icomp\" design. I ha e 3, 12-469's eeding a ou channel mixe , which goes in o a lap op unning DC6 wi h Soundsoap 2. Mine scan equally spaced on he FM band. I ha e had p e y good esul s un il ecen ly.A i s he messages we e p e y clea bu I had a eeling I was ge ing a di e en g oup han I no mally ha e o he las ew yea s. When I would ask abou my iends on he o he side hey would ell me hey will look o hem. Well abou 2 weeks ago he 12-469 a angemen s a ed gene a ing a lo o in e e ence and eedback. I s a ed hea ing adio s a ic oices as I use o ge wi h sho wa e. No oice agmen s bu oices made o s a ic (me allic and obo ic). They we e b eaking h ough he sweeping. I had a eeling someone else was ying o o ce hei way h ough. Finally he in e e ence go so bad I was o ced o e e back o a simple me hod I used be o e, which is using an noise. One o he i s messages o come ac oss was om a amilia oice elling me and I quo e, \"you me hod sucks\". I ha e no used he 12-469's since because o he clea messages I ha e been ge ing using wa e and an noise. Tha does no mean I ha e gi en up on he 12-469's bu I won' use hem again un il I am pe suaded o by my iends on he o he side ha hey a e willing o use and adap o i . To my knowledge only Mis y, Lau a and mysel use wa e o eco ding.Rega ds,F ank R.----- O iginal Message ----F om: babia z3 com>To: EVP-ITC@yahoog oups.comSen : Monday, Janua y 21, 2008 9:34:01 AMSubjec : [EVP-ITC] Babs has Issues!Al igh , you all know I'm ocal and I ha en' made any \" iends\" he ebu , i we can pu ha aside o a momen ...Spi i communica ion has been my passion since day one, a li le o e 6 yea s ago. I am a belie e in he a e li e and a belie e inspi i s a emp ing o communica e wi h us o a a ie y o easons. Iha e spi i ual belie s ha I eel s ongly abou and de o e much o my waking (and sleeping) momen s o hough s abou his ield.Howe e , I am also a esea che and a skep ic. In o de o me oallow ideas o become pa o my eali y I mus expe imen . In o de o me o belie e some hing is pa ano mal I HAVE o ule ou all o he possible causes. Tha being said, I ha e some ques ions. My hope is ha he e a e some he e willing o en e in o discussion wi h me.I ha e a di icul ime wi h many o he iles he e. Many imes, he eis no ques ion included in he ile. I can no de e mine whe he o no he \" eply\" is an in elligen eply. Maybe his has o do wi hallowable ile size.Some o he iles I ha e been able o download. (I don' always keepmy email se ings on o his g oup as I ge oo many - lol) When Ilook a he ile I see p oblems. The e will be comple e la linesilence be ween he wo ds. Many imes he \" eply\" is also a he samedecibel as he ques ion aske s oice. Those wo hings should no occu na u ally conside ing he de ices being used. Tha ells me ha he e is manipula ion o he iles. Now, wha is manipula ion o me,may no be manipula ion o o he s. To me, any al e ing o he eco ded ile cons i u es manipula ion. I do no know i he eply wasin elligen o manipula ed o be in elligen . Some say ha hey simply emo e he \"no esponse\" ime. I' e been old i can be as much as 18 seconds emo ed om be ween wo ds. Nowwe un in o he p oblem o us deciding wha wo d i s in wi h heques ion. Wha wo ds a e being igno ed? Did we ake nonsense and makesense? Did we amp e e y noise/wo d o only wha i ?I hink i 's g ea ha iles a e o e ed o pee e iew. Howe e , I hink we ha e o load hem un ouched o a he e y leas , o e exac ly wha was done o he en i e ile. Time elapsed be ween wo ds,wha was amped, e c. I'd also lo e o see some o hese sessions ideo aped wi h he ques ion aske acing he came a and a second handclock isible. T uly, we a en' esea ching i we don' ha e somep o ocol in place.He e is an issue I ha e wi h he RS Hacks. I ha e he 469. I akesapp oxima ely 18 seconds o scan h ough he AM equencies. Now, he ypical pe son would hink ha we can ake ha 18 seconds and di idei by he numbe o AM s a ions o de e mine how long we a e on eachs a ion be o e mo ing on o he nex one. In ha way we couldde e mine wha is impossible o be said ia a adio agmen . Howe e , ha 's no co ec . The scan cycle can a y om one equency o henex and o cou se he bigges p oblem is ha some s a ions a epicked up o e mul iple equencies; AM 640 can be hea d on 630, 640,650, 660 and maybe e en 670. Tha ex ends he ime a g ea deal. Thisis a di icul p oblem because i is almos impossible o he a e agepe son o be able o make a de e mina ion on ime his way. I hea d abou he ollowing oday; An expe imen e eco ds a he same ime e e y day Mon-F i. We hea abou he impo ance o medi a ing,au oma ic w i ing, e c a he same ime e e y day bu wha we ha e o emembe wi h his, is ha now we a e in essence uning in o he same adio show e e y day. One o my i s expe imen s wi h he 469 had mehea ing his deep male oice o e and o e again. Wha was he ying o ell me, I wonde ed. Than I ealized ha he was speakingapp oxima ely e e y 18 seconds; e e y ime he scan hi ha s a ion.So, i you a e emo ing up o 18 seconds be ween wo ds, hen you a e eally only eco ding he wo ds om one s a ion. This pos is IN NO WAY ying o s a any hing besides discussionabou some esea ch p oblems. I know ha he e a e hose who a e no conce ned wi h any hing mo e han he communica ion i sel bu I hink ha i is o he u mos impo ance o a emp o ac o in somep o ocol in o de o his o be conside ed se ious esea ch a all. Looking o las minu e shopping deals? Find hem as wi h Yahoo! Sea ch. Helping you a o i e cause is as easy as ins an messaging. You IM, we gi e. Lea n mo e."}