{"id": "5954", "subject": "Re: [EVP-ITC] Re: Babs has Issues!", "author": "Lisby", "timestamp": "2008-01-21T17:35:30Z", "full_text": "Oh dear. Here we go again.\n\nLook, Babs--it&#39;s really just this simple: if you are scared of lower  \nentities and you think that the hacked radio you are using is really  \na channel for demon or whatever, then just stop. Put the fricking  \nradio down and go get another hobby. Leave it to those of us who  \naren&#39;t afraid and don&#39;t care if someone calls us a bitch or a slut  \nand tries to pawn themselves off as Bazoozoo.\n\nJust. Stop. Listening. And. Worrying.\n\nAnd on top of all that, in this quote below, you seem to be saying  \nthat the rest of us don&#39;t know what we&#39;re doing or are being fooled  \nby entities that only you have sussed. Guess what? You&#39;re wrong on  \nboth counts, HMO.\n\nAnn\n\n\nOn Jan 21, 2008, at 12:07 PM, babiarz3 wrote:\n&gt;\n&gt;\n&gt; I&#39;ve recently started analyzing a 40 min 469 session. The results are\n&gt; scary. I&#39;d say at this point, and I&#39;m only 1/2 way through, 90% of the\n&gt; communication is negative in nature and mentions many supposed Demonic\n&gt; names. The layers of voices are, in many cases, multiple. Often, the\n&gt; listener hears very little of what is actually said. The voices can be\n&gt; mocking or downright crude. I have not yet formed an opinion fully but\n&gt; it would seem to me that these models are easy devices for lower level\n&gt; entities to figure out how to use. I can not speak of the attitudes or\n&gt; fears of those investigators present although at times, their voices\n&gt; are a bit shaky.\n&gt;\n&gt; Babs\n&gt;\n\n\nOh dea . He e we go again.Look, Babs--i 's eally jus his simple: i you a e sca ed o lowe en i ies and you hink ha he hacked adio you a e using is eally a channel o demon o wha e e , hen jus s op. Pu he icking adio down and go ge ano he hobby. Lea e i o hose o us who a en' a aid and don' ca e i someone calls us a bi ch o a slu and ies o pawn hemsel es o as Bazoozoo.Jus . S op. Lis ening. And. Wo ying.And on op o all ha , in his quo e below, you seem o be saying ha he es o us don' know wha we' e doing o a e being ooled by en i ies ha only you ha e sussed. Guess wha ? You' e w ong on bo h coun s, HMO.AnnOn Jan 21, 2008, a 12:07 PM, babia z3 w o e:I' e ecen ly s a ed analyzing a 40 min 469 session. The esul s a esca y. I'd say a his poin , and I'm only 1/2 way h ough, 90% o hecommunica ion is nega i e in na u e and men ions many supposed Demonicnames. The laye s o oices a e, in many cases, mul iple. O en, helis ene hea s e y li le o wha is ac ually said. The oices can bemocking o down igh c ude. I ha e no ye o med an opinion ully bu i would seem o me ha hese models a e easy de ices o lowe le elen i ies o igu e ou how o use. I can no speak o he a i udes o ea s o hose in es iga o s p esen al hough a imes, hei oicesa e a bi shaky. Babs"}