{"id": "5961", "subject": "RE: [EVP-ITC] Babs has Issues!", "author": "bruce halliday", "timestamp": "2008-01-21T17:54:44Z", "full_text": "--_a64919d6-77c6-4cd8-a83d-4c46f79d04f1_\r\nContent-Type: text/plain; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n\nAnn,\n \nYou bring up a good point about posted the two versions of a file.\n=\r\nI personally do not feel that I must prove to anyone that my communications=\r\n are legitimate.\neveryone has heard my posted files and in those files my a=\r\ncknowledgement of the real time responses I hear.\nThat in itself should be =\r\nenough. when a question is asked by the researcher then answered directly b=\r\ny the\nentity and the answer repeated by the researcher directly as conforma=\r\ntion of the spirit answer. to me those files stand as a testament\nto the va=\r\nlidity and honor of the research as well as the individuals that are doing =\r\nit.\n \nI will continue to post files as I have been but will make the raw un=\r\ntouched version available to whoever wants it.\nI will not do double posts t=\r\no defend my research validity to a saboteur.\n \nBruce\nBruce Halliday \n\n\nTo: =\r\nEVP-ITC@yahoogroups.comFrom: lisby@...: Mon, 21 Jan 2008 12:2=\r\n7:01 -0500Subject: Re: [EVP-ITC] Babs has Issues!\n\n\n\n\nBruce--I do think per=\r\nhaps there is one point here that possibly should be considered. Hear me ou=\r\nt, okay, my friend? I do think that maybe I will start attaching original a=\r\nnd cleaned up samples together, so the two can be compared. We both know th=\r\nat we clean them up to help the message, which *is* there and not added by =\r\nus, to be better heard. That&#39;s not the argument--at least not from me. But =\r\nit might be helpful, in general, to hear the two versions side by side. \n\nT=\r\nhis said, to Babs: You&#39;re going to have to live with the fact that not all =\r\nof the communication is in response to questions. If a question was spoken =\r\nnear where the communication came through, I try to include it. But there a=\r\nre plenty of times when I am not being addressed at all, as best I can tell=\r\n. They&#39;re talking amonst themselves and issuing orders, etc. So, clips with=\r\nout questions aren&#39;t going to change and you need to accept them for what t=\r\nhey are.\n\nAs far as removing time: I don&#39;t see an issue with it if the clip=\r\n is noted, rather as in journalism where we add ... to denote that material=\r\n has been removed that was tangential to the main thrust of the quote.\n\nPer=\r\nsonally, I have to slow my communication stuff down by about half. It comes=\r\n through incredibly fast. I don&#39;t think I&#39;m alone. Another deal-with-it iss=\r\nue. Slowing is not manipulating. Neither is amplification of fainter respon=\r\nses or deamplification of nonassociated noise.\n\nSome if us are recording mo=\r\nno and some stereo. Silencing one track to better hear another is also not =\r\nmanipulating it falls in the journalistic convention &quot;...&quot; category, to me =\r\nanyway.\n\nStill, point taken on combining both unprocessed and processed cli=\r\nps.\n\nAs for all the rest of the fretting about counting stations and dividi=\r\nng up times and all, I&#39;d say if you want to do it, knock yourself out. I do=\r\nn&#39;t think it ultimately matters because we&#39;re already postulating that most=\r\n of the time, the voice we hear is not the real voice of the communicant. I=\r\nt doesn&#39;t matter if you hear blips of the same announcer coming through at =\r\n15 second intervals. It&#39;s what the voice might say that is important. I kno=\r\nw that isn&#39;t what you want to hear, but I think it&#39;s probably valid.\n\nAnn\n\n=\r\n\n\nOn Jan 21, 2008, at 11:52 AM, bruce halliday wrote:\n\n\n\n\nFrank R., Once ag=\r\nain pal, we are on apposing sides.As far as Babs having many friends here W=\r\nelllll??? Anyway I want to address the subject of removing time from a file=\r\n.The way I am understanding what you mean by removing time is tocut segment=\r\ns of the recording out of the file. I myself do cut out simple noise or sta=\r\ntic fragments that are naturally occurring in the sweep of the boxfor insta=\r\nnce the minibox has an inherent hum or thump as it&#39;s Creator calls it. When=\r\n I receive a response through the minibox it will go something like this &quot;y=\r\nes HUM Bruce HUM we HUM are HUM here HUM&quot;I will definitely remove every HUM=\r\n from between the words but that does not change the message or affect the =\r\nwords that are spoken.I&#39;m assuming that is what you are talking about when =\r\nyou and babs mention &quot;removing time&quot;  I&#39;m just guessing but maybe babs is t=\r\nrying to insinuate that researchers here are altering their files., If so m=\r\naybe she should be looking for that in her own back yard. There must be som=\r\neone she knows for a fact that isaltering communications. And mike please l=\r\nets not turn this into a whole big thing! Bruce\nBruce Halliday \n\n\nTo: EVP-I=\r\nTC@yahoogroups.comFrom: warrior18eii@...: Mon, 21 Jan 2008 08:03:=\r\n09 -0800Subject: Re: [EVP-ITC] Babs has Issues!\n\n\n\n\nVery good observation B=\r\nabs. Let me say that you have many friends and associates here just for the=\r\n simple fact that you have an interest in ITC, are a researcher and a compl=\r\nex thinker. I think we have shown in the past that we can have a disagreeme=\r\nnt and still remain friends. You make a lot of good points in your post and=\r\n I would like to know who removes time from their recordings. I have never =\r\nremoved time from my recordings and see no reason why anyone else would wit=\r\nhout saying so in an accompanied post.I have limited experience with the 12=\r\n-469&#39;s as a single piece of equipment. I have arranged mine per Mike&#39;s, &quot;Sp=\r\niricomp&quot; design. I have 3, 12-469&#39;s feeding a four channel mixer, which goe=\r\ns into a laptop running DC6 with Soundsoap 2. Mine scan equally spaced on t=\r\nhe FM band. I have had pretty good results until recently.At first the mess=\r\nages were pretty clear but I had a feeling I was getting a different group =\r\nthan I normally have for the last few years. When I would ask about my frie=\r\nnds on the other side they would tell me they will look for them. Well abou=\r\nt 2 weeks ago the 12-469 arrangement started generating a lot of interferen=\r\nce and feedback. I started hearing radio static voices as I use to get with=\r\n shortwave. Not voice fragments but voices made of static (metallic and rob=\r\notic). They were breaking through the sweeping. I had a feeling someone els=\r\ne was trying to force their way through. Finally the interference got so ba=\r\nd I was forced to revert back to a simpler method I used before, which is u=\r\nsing fan noise. One of the first messages to come across was from a familia=\r\nr voice telling me and I quote, &quot;your method sucks&quot;. I have not used the 12=\r\n-469&#39;s since because of the clear messages I have been getting using water =\r\nand fan noise. That does not mean I have given up on the 12-469&#39;s but I won=\r\n&#39;t use them again until I am persuaded to by my friends on the otherside th=\r\nat they are willing to use and adapt to it. To my knowledge only Misty, Lau=\r\nra and myself use water for recording.Regards,Frank R.\n----- Original Messa=\r\nge ----From: babiarz3 &lt;babiarz3@...&gt;To: EVP-ITC@yahoogroups.comSent: =\r\nMonday, January 21, 2008 9:34:01 AMSubject: [EVP-ITC] Babs has Issues!\n\nAlr=\r\night, you all know I&#39;m vocal and I haven&#39;t made any &quot;friends&quot; herebut, if w=\r\ne can put that aside for a moment...Spirit communication has been my passio=\r\nn since day one, a little over6 years ago. I am a believer in the afterlife=\r\n and a believer inspirits attempting to communicate with us for a variety o=\r\nf reasons. Ihave spiritual beliefs that I feel strongly about and devote mu=\r\nch ofmy waking (and sleeping) moments to thoughts about this field.However,=\r\n I am also a researcher and a skeptic. In order for me toallow ideas to bec=\r\nome part of my reality I must experiment. In orderfor me to believe somethi=\r\nng is paranormal I HAVE to rule out all otherpossible causes. That being sa=\r\nid, I have some questions. My hope isthat there are some here willing to en=\r\nter into discussion with me.I have a difficult time with many of the files =\r\nhere. Many times, thereis no question included in the file. I can not deter=\r\nmine whether ornot the &quot;reply&quot; is an intelligent reply. Maybe this has to d=\r\no withallowable file size.Some of the files I have been able to download. (=\r\nI don&#39;t always keepmy email settings on for this group as I get too many - =\r\nlol) When Ilook at the file I see problems. There will be complete flat lin=\r\nesilence between the words. Many times the &quot;reply&quot; is also at the samedecib=\r\nel as the question askers voice. Those two things should notoccur naturally=\r\n considering the devices being used. That tells me thatthere is manipulatio=\r\nn of the files. Now, what is manipulation to me,may not be manipulation to =\r\nothers. To me, any altering of the recordedfile constitutes manipulation. I=\r\n do not know if the reply wasintelligent or manipulated to be intelligent. =\r\nSome say that they simply remove the &quot;no response&quot; time. I&#39;ve beentold it c=\r\nan be as much as 18 seconds removed from between words. Nowwe run into the =\r\nproblem of us deciding what word fits in with thequestion. What words are b=\r\neing ignored? Did we take nonsense and makesense? Did we amp every noise/wo=\r\nrd or only what fit?I think it&#39;s great that files are offered for peer revi=\r\new. However, Ithink we have to load them untouched or at the very least, of=\r\nferexactly what was done to the entire file. Time elapsed between words,wha=\r\nt was amped, etc. I&#39;d also love to see some of these sessions videotaped wi=\r\nth the question asker facing the camera and a second handclock visible. Tru=\r\nly, we aren&#39;t researching if we don&#39;t have someprotocol in place.Here is an=\r\n issue I have with the RS Hacks. I have the 469. It takesapproximately 18 s=\r\neconds to scan through the AM frequencies. Now, thetypical person would thi=\r\nnk that we can take that 18 seconds and divideit by the number of AM statio=\r\nns to determine how long we are on eachstation before moving on to the next=\r\n one. In that way we coulddetermine what is impossible to be said via a rad=\r\nio fragment. However,that&#39;s not correct. The scan cycle can vary from one f=\r\nrequency to thenext and of course the biggest problem is that some stations=\r\n arepicked up over multiple frequencies; AM 640 can be heard on 630, 640,65=\r\n0, 660 and maybe even 670. That extends the time a great deal. Thisis a dif=\r\nficult problem because it is almost impossible for the averageperson to be =\r\nable to make a determination on time this way. I heard about the following =\r\ntoday; An experimenter records at the sametime every day Mon-Fri. We hear a=\r\nbout the importance of meditating,automatic writing, etc at the same time e=\r\nvery day but what we have toremember with this, is that now we are in essen=\r\nce tuning into the sameradio show every day. One of my first experiments wi=\r\nth the 469 had mehearing this deep male voice over and over again. What was=\r\n he tryingto tell me, I wondered. Than I realized that he was speakingappro=\r\nximately every 18 seconds; every time the scan hit that station.So, if you =\r\nare removing up to 18 seconds between words, then you arereally only record=\r\ning the words from one station. This post is IN NO WAY trying to start anyt=\r\nhing besides discussionabout some research problems. I know that there are =\r\nthose who are notconcerned with anything more than the communication itself=\r\n but I thinkthat it is of the utmost importance to attempt to factor in som=\r\neprotocol in order for this to be considered serious research at all. \n\nLoo=\r\nking for last minute shopping deals? Find them fast with Yahoo! Search. \n\nH=\r\nelping your favorite cause is as easy as instant messaging. You IM, we give=\r\n. Learn more. \n\n \n\n\n\n\n\n\n___________________________________________________=\r\n______________\nHelping your favorite cause is as easy as instant messaging.=\r\n=A0You IM, we give.\nhttp://im.live.com/Messenger/IM/Home/?source=3Dtext_hot=\r\nmail_join\r\n--_a64919d6-77c6-4cd8-a83d-4c46f79d04f1_\r\nContent-Type: text/html; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;\n&lt;head&gt;\n&lt;style&gt;\n.hmmessage P\n{\nmargin:0px;\npadding:0px\n}\nbody.hmmessa=\r\nge\n{\nFONT-SIZE: 10pt;\nFONT-FAMILY:Tahoma\n}\n&lt;/style&gt;\n&lt;/head&gt;\n&lt;body class=3D&#39;=\r\nhmmessage&#39;&gt;\nAnn,&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nYou bring up a good point about posted the =\r\ntwo versions of a file.&lt;BR&gt;\nI personally do not feel that I must prove to a=\r\nnyone that my communications are legitimate.&lt;BR&gt;\neveryone has heard my post=\r\ned files and in those files my acknowledgement of the real time responses I=\r\n hear.&lt;BR&gt;\nThat in itself should be enough. when a question is asked by the=\r\n researcher then answered directly&nbsp;by the&lt;BR&gt;\nentity and the answer re=\r\npeated by the researcher directly as conformation of the spirit answer. to =\r\nme those files stand as a testament&lt;BR&gt;\nto the validity and honor of the re=\r\nsearch as well as the individuals that are doing it.&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nI will =\r\ncontinue to post files as I have been but will make the raw untouched versi=\r\non available to whoever wants it.&lt;BR&gt;\nI will not do double posts to defend =\r\nmy research validity to a saboteur.&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nBruce&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;P ali=\r\ngn=3Dcenter&gt;&lt;FONT size=3D4&gt;&lt;FONT color=3D#0033cc&gt;&lt;STRONG&gt;&lt;EM&gt;&lt;FONT color=3D=\r\n#000000 size=3D5&gt;Bruce Halliday &lt;BR&gt;&lt;/FONT&gt;&lt;/EM&gt;&lt;/STRONG&gt;&lt;BR&gt;&lt;A href=3D&quot;htt=\r\np://free-paranormalinvestigating.com/%3C/div%3E%3C/div%3E%3Cp%20/%3E%3Cdiv%=\r\n20class=3D&quot; target=3D_blank&gt;&lt;/P&gt;&lt;/A&gt;&lt;/FONT&gt;&lt;/FONT&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;BLOCKQUOTE&gt;\n&lt;HR=\r\n&gt;\nTo: EVP-ITC@yahoogroups.com&lt;BR&gt;From: lisby@...&lt;BR&gt;Date: Mon, 21=\r\n Jan 2008 12:27:01 -0500&lt;BR&gt;Subject: Re: [EVP-ITC] Babs has Issues!&lt;BR&gt;&lt;BR&gt;=\r\n\n&lt;META content=3D&quot;Microsoft SafeHTML&quot; name=3DGenerator&gt;\n&lt;DIV id=3DEC_ygrp-m=\r\nlmsg style=3D&quot;WIDTH: 655px&quot;&gt;\n&lt;DIV id=3DEC_ygrp-msg style=3D&quot;PADDING-RIGHT: =\r\n15px; PADDING-LEFT: 0px; Z-INDEX: 1; FLOAT: left; PADDING-BOTTOM: 0px; WIDT=\r\nH: 490px; PADDING-TOP: 0px&quot;&gt;\n&lt;DIV id=3DEC_ygrp-text&gt;\nBruce--I do think perh=\r\naps there is one point here that possibly should be considered. Hear me out=\r\n, okay, my friend? I do think that maybe I will start attaching original an=\r\nd cleaned up samples together, so the two can be compared. We both know tha=\r\nt we clean them up to help the message, which *is* there and not added by u=\r\ns, to be better heard. That&#39;s not the argument--at least not from me. But i=\r\nt might be helpful, in general, to hear the two versions side by side. \n&lt;DI=\r\nV&gt;&lt;BR class=3DEC_webkit-block-placeholder&gt;&lt;/DIV&gt;\n&lt;DIV&gt;This said, to Babs: Y=\r\nou&#39;re going to have to live with the fact that not all of the communication=\r\n is in response to questions. If a question was spoken near where the commu=\r\nnication came through, I try to include it. But there are plenty of times w=\r\nhen I am not being addressed at all, as best I can tell. They&#39;re talking am=\r\nonst themselves and issuing orders, etc. So, clips without questions aren&#39;t=\r\n going to change and you need to accept them for what they are.&lt;/DIV&gt;\n&lt;DIV&gt;=\r\n&lt;BR class=3DEC_webkit-block-placeholder&gt;&lt;/DIV&gt;\n&lt;DIV&gt;As far as removing time=\r\n: I don&#39;t see an issue with it if the clip is noted, rather as in journalis=\r\nm where we add ... to denote that material has been removed that was tangen=\r\ntial to the main thrust of the quote.&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR class=3DEC_webkit-bloc=\r\nk-placeholder&gt;&lt;/DIV&gt;\n&lt;DIV&gt;Personally, I have to slow my communication&nbsp;=\r\n&lt;WBR&gt;stuff down by about half. It comes through incredibly fast. I don&#39;t th=\r\nink I&#39;m alone. Another deal-with-it issue. Slowing is not manipulating. Nei=\r\nther is amplification of fainter responses or deamplification of nonassocia=\r\nted noise.&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR class=3DEC_webkit-block-placeholder&gt;&lt;/DIV&gt;\n&lt;DIV&gt;S=\r\nome if us are recording mono and some stereo. Silencing one track to better=\r\n hear another is also not manipulating it falls in the journalistic convent=\r\nion &quot;...&quot; category, to me anyway.&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR class=3DEC_webkit-block-pl=\r\naceholder&gt;&lt;/DIV&gt;\n&lt;DIV&gt;Still, point taken on combining both unprocessed and =\r\nprocessed clips.&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR class=3DEC_webkit-block-placeholder&gt;&lt;/DIV&gt;\n=\r\n&lt;DIV&gt;As for all the rest of the fretting about counting stations and dividi=\r\nng up times and all, I&#39;d say if you want to do it, knock yourself out. I do=\r\nn&#39;t think it ultimately matters because we&#39;re already postulating that most=\r\n of the time, the voice we hear is not the real voice of the communicant. I=\r\nt doesn&#39;t matter if you hear blips of the same announcer coming through at =\r\n15 second intervals. It&#39;s what the voice might say that is important. I kno=\r\nw that isn&#39;t what you want to hear, but I think it&#39;s probably valid.&lt;/DIV&gt;\n=\r\n&lt;DIV&gt;&lt;BR class=3DEC_webkit-block-placeholder&gt;&lt;/DIV&gt;\n&lt;DIV&gt;Ann&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR=\r\n class=3DEC_webkit-block-placeholder&gt;&lt;/DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;On Jan 21, 200=\r\n8, at 11:52 AM, bruce halliday wrote:&lt;/DIV&gt;&lt;BR class=3DEC_Apple-interchange=\r\n-newline&gt;\n&lt;BLOCKQUOTE&gt;&lt;SPAN class=3DEC_Apple-style-span style=3D&quot;FONT-WEIGH=\r\nT: normal; FONT-SIZE: 12px; COLOR: rgb(0,0,0); TEXT-INDENT: 0px; FONT-STYLE=\r\n: normal; FONT-FAMILY: Helvetica; LETTER-SPACING: normal; BORDER-COLLAPSE: =\r\nseparate; FONT-VARIANT: normal&quot;&gt;\n&lt;DIV id=3DEC_ygrp-mlmsg style=3D&quot;FONT-SIZE=\r\n: 13px; FONT-FAMILY: arial, helvetica, clean, sans-serif&quot;&gt;\n&lt;DIV id=3DEC_ygr=\r\np-msg&gt;\n&lt;DIV id=3DEC_ygrp-text style=3D&quot;FONT-FAMILY: Georgia&quot;&gt;\n&lt;P&gt;Frank R.,&lt;=\r\nBR&gt;&nbsp;&lt;BR&gt;Once again pal, we are on apposing sides.&lt;BR&gt;As far as Babs ha=\r\nving many friends here&lt;BR&gt;&nbsp;&lt;BR&gt;Welllll???&lt;BR&gt;&nbsp;&lt;BR&gt;Anyway I want t=\r\no address the subject of removing time from a file.&lt;BR&gt;The way I am underst=\r\nanding what you mean by removing time is to&lt;BR&gt;cut segments of the recordin=\r\ng out of the file.&lt;BR&gt;&nbsp;&lt;BR&gt;I myself do cut out simple noise or static =\r\nfragments that are naturally occurring in the sweep of the box&lt;BR&gt;for insta=\r\nnce the minibox has an inherent hum or thump as it&#39;s Creator calls it.&lt;BR&gt;&=\r\nnbsp;&lt;BR&gt;When I receive a response through the minibox it will go something=\r\n like this &quot;yes HUM Bruce HUM we HUM are HUM here HUM&quot;&lt;BR&gt;I will definitely=\r\n remove every HUM from between the words but that does not change the messa=\r\nge or affect the words that are spoken.&lt;BR&gt;I&#39;m assuming that is what you ar=\r\ne talking about when you and babs mention &quot;removing time&quot;&lt;SPAN class=3DEC_A=\r\npple-converted-space&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;&nbsp;&lt;BR&gt;I&#39;m just guessing but maybe=\r\n babs is trying to insinuate that researchers here are altering their files=\r\n.,&lt;SPAN class=3DEC_Apple-converted-space&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;If so maybe she s=\r\nhould be looking for that in her own back yard. There must be someone she k=\r\nnows for a fact that is&lt;BR&gt;altering communications.&lt;BR&gt;&nbsp;&lt;BR&gt;And mike p=\r\nlease lets not turn this into a whole big thing!&lt;BR&gt;&nbsp;&lt;BR&gt;Bruce&lt;BR&gt;&lt;BR&gt;=\r\n&lt;BR&gt;&lt;BR&gt;\n&lt;P align=3Dcenter&gt;&lt;FONT size=3D4&gt;&lt;FONT color=3D#0033cc&gt;&lt;STRONG&gt;&lt;EM=\r\n&gt;&lt;FONT color=3D#000000 size=3D5&gt;Bruce Halliday&lt;SPAN class=3DEC_Apple-conver=\r\nted-space&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;&lt;/FONT&gt;&lt;/EM&gt;&lt;/STRONG&gt;&lt;BR&gt;&lt;A href=3D&quot;http://free-=\r\nparanormalinvestigating.com/%3C/div%3E%3C/div%3E%3Cp%20/%3E%3Cdiv%20class=\r\n=3D&quot; target=3D_blank&gt;&lt;/A&gt;&lt;/FONT&gt;&lt;/FONT&gt;&lt;/P&gt;&lt;FONT size=3D4&gt;&lt;FONT color=3D#00=\r\n33cc&gt;&lt;A href=3D&quot;http://free-paranormalinvestigating.com/%3C/div%3E%3C/div%3=\r\nE%3Cp%20/%3E%3Cdiv%20class=3D&quot; target=3D_blank&gt;&lt;/A&gt;&lt;/FONT&gt;&lt;/FONT&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;=\r\nBLOCKQUOTE&gt;\n&lt;HR&gt;\nTo: EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;BR&gt;From: warrior18eii@&lt;WB=\r\nR&gt;yahoo.com&lt;BR&gt;Date: Mon, 21 Jan 2008 08:03:09 -0800&lt;BR&gt;Subject: Re: [EVP-I=\r\nTC] Babs has Issues!&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3DEC_EC_ygrp-mlmsg&gt;\n&lt;DIV id=3DEC_EC_yg=\r\nrp-msg&gt;\n&lt;DIV id=3DEC_EC_ygrp-text&gt;\n&lt;DIV style=3D&quot;FONT-SIZE: 12pt; FONT-FAMI=\r\nLY: &#39;times new roman&#39;, &#39;new york&#39;, times, serif&quot;&gt;\n&lt;DIV style=3D&quot;FONT-SIZE: =\r\n12pt; FONT-FAMILY: &#39;times new roman&#39;, &#39;new york&#39;, times, serif&quot;&gt;Very good o=\r\nbservation Babs. Let me say that you have many friends and associates here =\r\njust for the simple fact that you have an interest in ITC, are a researcher=\r\n and a complex thinker. I think we have shown in the past that we can have =\r\na disagreement and still remain friends. You make a lot of good points in y=\r\nour post and I would like to know who removes time from their recordings. I=\r\n have never removed time from my recordings and see no reason why anyone el=\r\nse would without saying so in an accompanied post.&lt;BR&gt;&lt;BR&gt;I have limited ex=\r\nperience with the 12-469&#39;s as a single piece of equipment. I have arranged =\r\nmine per Mike&#39;s, &quot;Spiricomp&quot; design. I have 3, 12-469&#39;s feeding a four chan=\r\nnel mixer, which goes into a laptop running DC6 with Soundsoap 2. Mine scan=\r\n equally spaced on the FM band. I have had pretty good results until recent=\r\nly.&lt;BR&gt;&lt;BR&gt;At first the messages were pretty clear but I had a feeling I wa=\r\ns getting a different group than I normally have for the last few years. Wh=\r\nen I would ask about my friends on the other side they would tell me they w=\r\nill look for them. Well about 2 weeks ago the 12-469 arrangement started ge=\r\nnerating a lot of interference and feedback. I started hearing radio static=\r\n voices as I use to get with shortwave. Not voice fragments but voices made=\r\n of static (metallic and robotic). They were breaking through the sweeping.=\r\n I had a feeling someone else was trying to force their way through. Finall=\r\ny the interference got so bad I was forced to revert back to a simpler meth=\r\nod I used before, which is using fan noise. One of the first messages to co=\r\nme across was from a familiar voice telling me and I quote, &quot;your method su=\r\ncks&quot;. I have not used the 12-469&#39;s since because of the clear messages I ha=\r\nve been getting using water and fan noise. That does not mean I have given =\r\nup on the 12-469&#39;s but I won&#39;t use them again until I am persuaded to by my=\r\n friends on the otherside that they are willing to use and adapt to it. To =\r\nmy knowledge only Misty, Laura and myself use water for recording.&lt;BR&gt;&lt;BR&gt;R=\r\negards,&lt;BR&gt;&lt;BR&gt;Frank R.&lt;BR&gt;&lt;BR&gt;\n&lt;DIV style=3D&quot;FONT-SIZE: 12pt; FONT-FAMILY:=\r\n &#39;times new roman&#39;, &#39;new york&#39;, times, serif&quot;&gt;----- Original Message ----&lt;B=\r\nR&gt;From: babiarz3 &lt;babiarz3@yahoo.&lt;WBR&gt;com&gt;&lt;BR&gt;To: EVP-ITC@yahoogroups=\r\n&lt;WBR&gt;.com&lt;BR&gt;Sent: Monday, January 21, 2008 9:34:01 AM&lt;BR&gt;Subject: [EVP-ITC=\r\n] Babs has Issues!&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3DEC_EC_ygrp-text&gt;\nAlright, you all know=\r\n I&#39;m vocal and I haven&#39;t made any &quot;friends&quot; here&lt;BR&gt;but, if we can put that=\r\n aside for a moment...&lt;BR&gt;&lt;BR&gt;Spirit communication has been my passion sinc=\r\ne day one, a little over&lt;BR&gt;6 years ago. I am a believer in the afterlife a=\r\nnd a believer in&lt;BR&gt;spirits attempting to communicate with us for a variety=\r\n of reasons. I&lt;BR&gt;have spiritual beliefs that I feel strongly about and dev=\r\note much of&lt;BR&gt;my waking (and sleeping) moments to thoughts about this fiel=\r\nd.&lt;BR&gt;However, I am also a researcher and a skeptic. In order for me to&lt;BR&gt;=\r\nallow ideas to become part of my reality I must experiment. In order&lt;BR&gt;for=\r\n me to believe something is paranormal I HAVE to rule out all other&lt;BR&gt;poss=\r\nible causes. That being said, I have some questions. My hope is&lt;BR&gt;that the=\r\nre are some here willing to enter into discussion with me.&lt;BR&gt;&lt;BR&gt;I have a =\r\ndifficult time with many of the files here. Many times, there&lt;BR&gt;is no ques=\r\ntion included in the file. I can not determine whether or&lt;BR&gt;not the &quot;reply=\r\n&quot; is an intelligent reply. Maybe this has to do with&lt;BR&gt;allowable file size=\r\n.&lt;BR&gt;&lt;BR&gt;Some of the files I have been able to download. (I don&#39;t always ke=\r\nep&lt;BR&gt;my email settings on for this group as I get too many - lol) When I&lt;B=\r\nR&gt;look at the file I see problems. There will be complete flat line&lt;BR&gt;sile=\r\nnce between the words. Many times the &quot;reply&quot; is also at the same&lt;BR&gt;decibe=\r\nl as the question askers voice. Those two things should not&lt;BR&gt;occur natura=\r\nlly considering the devices being used. That tells me that&lt;BR&gt;there is mani=\r\npulation of the files. Now, what is manipulation to me,&lt;BR&gt;may not be manip=\r\nulation to others. To me, any altering of the recorded&lt;BR&gt;file constitutes =\r\nmanipulation. I do not know if the reply was&lt;BR&gt;intelligent or manipulated =\r\nto be intelligent.&lt;SPAN class=3DEC_Apple-converted-space&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;&lt;=\r\nBR&gt;Some say that they simply remove the &quot;no response&quot; time. I&#39;ve been&lt;BR&gt;to=\r\nld it can be as much as 18 seconds removed from between words. Now&lt;BR&gt;we ru=\r\nn into the problem of us deciding what word fits in with the&lt;BR&gt;question. W=\r\nhat words are being ignored? Did we take nonsense and make&lt;BR&gt;sense? Did we=\r\n amp every noise/word or only what fit?&lt;BR&gt;&lt;BR&gt;I think it&#39;s great that file=\r\ns are offered for peer review. However, I&lt;BR&gt;think we have to load them unt=\r\nouched or at the very least, offer&lt;BR&gt;exactly what was done to the entire f=\r\nile. Time elapsed between words,&lt;BR&gt;what was amped, etc. I&#39;d also love to s=\r\nee some of these sessions video&lt;BR&gt;taped with the question asker facing the=\r\n camera and a second hand&lt;BR&gt;clock visible. Truly, we aren&#39;t researching if=\r\n we don&#39;t have some&lt;BR&gt;protocol in place.&lt;BR&gt;&lt;BR&gt;Here is an issue I have wi=\r\nth the RS Hacks. I have the 469. It takes&lt;BR&gt;approximately 18 seconds to sc=\r\nan through the AM frequencies. Now, the&lt;BR&gt;typical person would think that =\r\nwe can take that 18 seconds and divide&lt;BR&gt;it by the number of AM stations t=\r\no determine how long we are on each&lt;BR&gt;station before moving on to the next=\r\n one. In that way we could&lt;BR&gt;determine what is impossible to be said via a=\r\n radio fragment. However,&lt;BR&gt;that&#39;s not correct. The scan cycle can vary fr=\r\nom one frequency to the&lt;BR&gt;next and of course the biggest problem is that s=\r\nome stations are&lt;BR&gt;picked up over multiple frequencies; AM 640 can be hear=\r\nd on 630, 640,&lt;BR&gt;650, 660 and maybe even 670. That extends the time a grea=\r\nt deal. This&lt;BR&gt;is a difficult problem because it is almost impossible for =\r\nthe average&lt;BR&gt;person to be able to make a determination on time this way.&lt;=\r\nSPAN class=3DEC_Apple-converted-space&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;&lt;BR&gt;I heard about th=\r\ne following today; An experimenter records at the same&lt;BR&gt;time every day Mo=\r\nn-Fri. We hear about the importance of meditating,&lt;BR&gt;automatic writing, et=\r\nc at the same time every day but what we have to&lt;BR&gt;remember with this, is =\r\nthat now we are in essence tuning into the same&lt;BR&gt;radio show every day. On=\r\ne of my first experiments with the 469 had me&lt;BR&gt;hearing this deep male voi=\r\nce over and over again. What was he trying&lt;BR&gt;to tell me, I wondered. Than =\r\nI realized that he was speaking&lt;BR&gt;approximately every 18 seconds; every ti=\r\nme the scan hit that station.&lt;BR&gt;So, if you are removing up to 18 seconds b=\r\netween words, then you are&lt;BR&gt;really only recording the words from one stat=\r\nion.&lt;SPAN class=3DEC_Apple-converted-space&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;&lt;BR&gt;This post i=\r\ns IN NO WAY trying to start anything besides discussion&lt;BR&gt;about some resea=\r\nrch problems. I know that there are those who are not&lt;BR&gt;concerned with any=\r\nthing more than the communication itself but I think&lt;BR&gt;that it is of the u=\r\ntmost importance to attempt to factor in some&lt;BR&gt;protocol in order for this=\r\n to be considered serious research at all.&lt;SPAN class=3DEC_Apple-converted-=\r\nspace&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;BR&gt;\n&lt;HR SIZ=\r\nE=3D1&gt;\nLooking for last minute shopping deals?&lt;SPAN class=3DEC_Apple-conver=\r\nted-space&gt;&nbsp;&lt;/SPAN&gt;&lt;A href=3D&quot;http://us.rd.yahoo.com/evt=3D51734/*http:=\r\n//tools.search.yahoo.com/newsearch/category.php?category=3Dshopping&quot; target=\r\n=3D_blank&gt;Find them fast with Yahoo! Search.&lt;/A&gt;&lt;SPAN class=3DEC_Apple-conv=\r\nerted-space&gt;&nbsp;&lt;/SPAN&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;SPAN style=3D&quot;COLOR: white&quot;&gt;&lt;/SPAN&gt;&lt;/DI=\r\nV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;\n&lt;HR&gt;\nHelping your favorite cause is as easy as in=\r\nstant messaging.&nbsp;You IM, we give.&lt;SPAN class=3DEC_Apple-converted-spac=\r\ne&gt;&nbsp;&lt;/SPAN&gt;&lt;A href=3D&quot;http://im.live.com/Messenger/IM/Home/?source=3Dte=\r\nxt_hotmail_join&quot; target=3D_blank&gt;Learn more.&lt;/A&gt; \n&lt;DIV&gt;&lt;BR class=3DEC_khtml=\r\n-block-placeholder&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;SPAN style=3D&quot;COLOR: white&quot;&gt;&lt;/SPAN&gt;&lt;/SPAN&gt;&lt;=\r\n/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;\n&lt;BR&gt;&lt;/DIV&gt;&lt;SPAN style=3D&quot;COLOR: wh=\r\nite&quot;&gt;&lt;/SPAN&gt; \n&lt;STYLE&gt;\n.ExternalClass #EC_ygrp-mkp\n{border:1px solid #d8d8d8=\r\n;font-family:Arial;padding:0px 14px;}\n.ExternalClass #EC_ygrp-mkp hr\n{borde=\r\nr:1px solid #d8d8d8;}\n.ExternalClass #EC_ygrp-mkp #EC_hd\n{color:#628c2a;fon=\r\nt-size:85%;font-weight:bold;line-height:122%;}\n.ExternalClass #EC_ygrp-mkp =\r\n#EC_ads\n{margin-bottom:10px;}\n.ExternalClass #EC_ygrp-mkp .EC_ad\n{padding:0=\r\n 0;}\n.ExternalClass #EC_ygrp-mkp .EC_ad a\n{color:#0000ff;text-decoration:no=\r\nne;}\n\n&lt;/STYLE&gt;\n\n&lt;STYLE&gt;\n.ExternalClass #EC_ygrp-sponsor #EC_ygrp-lc\n{font-f=\r\namily:Arial;}\n.ExternalClass #EC_ygrp-sponsor #EC_ygrp-lc #EC_hd\n{font-weig=\r\nht:bold;font-size:78%;line-height:122%;}\n.ExternalClass #EC_ygrp-sponsor #E=\r\nC_ygrp-lc .EC_ad\n{margin-bottom:10px;padding:0 0;}\n\n&lt;/STYLE&gt;\n\n&lt;STYLE&gt;\n.Exte=\r\nrnalClass #EC_ygrp-mlmsg\n{font-size:13px;font-family:arial,helvetica,clean,=\r\nsans-serif;}\n.ExternalClass #EC_ygrp-mlmsg table\n{font-size:inherit;font:10=\r\n0%;}\n.ExternalClass #EC_ygrp-mlmsg select, .ExternalClass input, .ExternalC=\r\nlass textarea\n{font:99% arial,helvetica,clean,sans-serif;}\n.ExternalClass #=\r\nEC_ygrp-mlmsg pre, .ExternalClass code\n{font:115% monospace;}\n.ExternalClas=\r\ns #EC_ygrp-mlmsg EC_*\n{line-height:1.22em;}\n.ExternalClass #EC_ygrp-text\n{f=\r\nont-family:Georgia;}\n.ExternalClass #EC_ygrp-text p\n{;}\n.ExternalClass #EC_=\r\nygrp-tpmsgs\n{font-family:Arial;clear:both;}\n.ExternalClass #EC_ygrp-vitnav\n=\r\n{padding-top:10px;font-family:Verdana;font-size:77%;}\n.ExternalClass #EC_yg=\r\nrp-vitnav a\n{padding:0 1px;}\n.ExternalClass #EC_ygrp-actbar\n{clear:both;whi=\r\nte-space:nowrap;color:#666;text-align:right;}\n.ExternalClass #EC_ygrp-actba=\r\nr .EC_left\n{float:left;white-space:nowrap;}\n.ExternalClass .EC_bld\n{font-we=\r\night:bold;}\n.ExternalClass #EC_ygrp-grft\n{font-family:Verdana;font-size:77%=\r\n;padding:15px 0;}\n.ExternalClass #EC_ygrp-ft\n{font-family:verdana;font-size=\r\n:77%;border-top:1px solid #666;padding:5px 0;}\n.ExternalClass #EC_ygrp-mlms=\r\ng #EC_logo\n{padding-bottom:10px;}\n.ExternalClass #EC_ygrp-vital\n{background=\r\n-color:#e0ecee;margin-bottom:20px;padding:2px 0 8px 8px;}\n.ExternalClass #E=\r\nC_ygrp-vital #EC_vithd\n{font-size:77%;font-family:Verdana;font-weight:bold;=\r\ncolor:#333;text-transform:uppercase;}\n.ExternalClass #EC_ygrp-vital ul\n{pad=\r\nding:0;}\n.ExternalClass #EC_ygrp-vital ul li\n{list-style-type:none;clear:bo=\r\nth;border:1px solid #e0ecee;}\n.ExternalClass #EC_ygrp-vital ul li .EC_ct\n{f=\r\nont-weight:bold;color:#ff7900;float:right;width:2em;text-align:right;paddin=\r\ng-right:.5em;}\n.ExternalClass #EC_ygrp-vital ul li .EC_cat\n{font-weight:bol=\r\nd;}\n.ExternalClass #EC_ygrp-vital a\n{text-decoration:none;}\n.ExternalClass =\r\n#EC_ygrp-vital a:hover\n{text-decoration:underline;}\n.ExternalClass #EC_ygrp=\r\n-sponsor #EC_hd\n{color:#999;font-size:77%;}\n.ExternalClass #EC_ygrp-sponsor=\r\n #EC_ov\n{padding:6px 13px;background-color:#e0ecee;margin-bottom:20px;}\n.Ex=\r\nternalClass #EC_ygrp-sponsor #EC_ov ul\n{padding:0 0 0 8px;}\n.ExternalClass =\r\n#EC_ygrp-sponsor #EC_ov li\n{list-style-type:square;padding:6px 0;font-size:=\r\n77%;}\n.ExternalClass #EC_ygrp-sponsor #EC_ov li a\n{text-decoration:none;fon=\r\nt-size:130%;}\n.ExternalClass #EC_ygrp-sponsor #EC_nc\n{background-color:#eee=\r\n;margin-bottom:20px;padding:0 8px;}\n.ExternalClass #EC_ygrp-sponsor .EC_ad\n=\r\n{padding:8px 0;}\n.ExternalClass #EC_ygrp-sponsor .EC_ad #EC_hd1\n{font-famil=\r\ny:Arial;font-weight:bold;color:#628c2a;font-size:100%;line-height:122%;}\n.E=\r\nxternalClass #EC_ygrp-sponsor .EC_ad a\n{text-decoration:none;}\n.ExternalCla=\r\nss #EC_ygrp-sponsor .EC_ad a:hover\n{text-decoration:underline;}\n.ExternalCl=\r\nass #EC_ygrp-sponsor .EC_ad p\n{;}\n.ExternalClass EC_o\n{font-size:0;}\n.Exter=\r\nnalClass .EC_MsoNormal\n{;}\n.ExternalClass #EC_ygrp-text tt\n{font-size:120%;=\r\n}\n.ExternalClass blockquote\n{;}\n.ExternalClass .EC_replbq\n{;}\n\n&lt;/STYLE&gt;\n&lt;/B=\r\nLOCKQUOTE&gt;&lt;br /&gt;&lt;hr /&gt;Helping your favorite cause is as easy as instant mes=\r\nsaging.=A0You IM, we give. &lt;a href=3D&#39;http://im.live.com/Messenger/IM/Home/=\r\n?source=3Dtext_hotmail_join&#39; target=3D&#39;_new&#39;&gt;Learn more.&lt;/a&gt;&lt;/body&gt;\n&lt;/html&gt;\r\n--_a64919d6-77c6-4cd8-a83d-4c46f79d04f1_--"}