{"id": "5962", "subject": "Re: Babs has Issues!", "author": "babiarz3", "timestamp": "2008-01-21T18:00:52Z", "full_text": "I think that is a great starting point Ann, posting both the raw file\nand the altered one. \n\nMost people do &quot;clean&quot; their files in all forms of EVP but, it is\nmanipulating it or changing it from it&#39;s original, even if that is\njust amping it. But, now here&#39;s an issue... what you may consider as\nsimple cleaning, others may not. Others may feel it is okay to do much\nmore and still feel they have not manipulated the file. &quot;It is what it\nis&quot; changes to &quot;It isn&#39;t what it was&quot;. Some files on here are so\nincredibly clear while others sound more like what actually happens. \n\nI fully understand that the communication received is not always in a\nquestion and answer format. But, here is an example... If I hear and\nrecord &quot;The water is blue&quot; and I asked nothing about the water and the\ncomment is completely random than is it still considered\ncommunication? Is it conveying any information? More importantly, is\nthat something that matters? What do we hold as a standard for\ncommunication? I think it&#39;s difficult at best to know how to move\nforward without having a good idea of where we are now. How can we\nimprove?\n\nI don&#39;t think I&#39;m fretting about station time counting. I think it&#39;s a\nlogical thing we need to consider. It is an easy one to do. Record\nyour session making note of the time of each word or response. Is it\nconsistent in time? It should not be. \n\nI mentioned in a reply to Frank R about a file I&#39;m analyzing. One of\nthe great things about this file is that I can hear both the\ninvestigators speaking as well as communication from the device. For\nme, it is a perfect example of how when we ask a question, our brains\nignore everything until something that makes sense to us is heard. It\nis taking me an incredibly long time to transcribe it because of the\nneed to repeat a section countless times to hear all the layers,\nneeding to amp it in places, slow it down in others so I know it needs\nto be done. However I leave the file raw. On my site,I have posted\nsome of my traditional EVP&#39;s and if I have done anything to them I\ninclude that in the file name; whoareyouamp.wav for example. \n\nThank you for you willingness to have an open discussion.\n\nBabs\n\n\n\n--- In EVP-ITC@yahoogroups.com, Lisby &lt;lisby@...&gt; wrote:\n&gt;\n&gt; Bruce--I do think perhaps there is one point here that possibly  \n&gt; should be considered. Hear me out, okay, my friend? I do think that  \n&gt; maybe I will start attaching original and cleaned up samples  \n&gt; together, so the two can be compared. We both know that we clean them  \n&gt; up to help the message, which *is* there and not added by us, to be  \n&gt; better heard. That&#39;s not the argument--at least not from me. But it  \n&gt; might be helpful, in general, to hear the two versions side by side.\n&gt; \n&gt; This said, to Babs: You&#39;re going to have to live with the fact that  \n&gt; not all of the communication is in response to questions. If a  \n&gt; question was spoken near where the communication came through, I try  \n&gt; to include it. But there are plenty of times when I am not being  \n&gt; addressed at all, as best I can tell. They&#39;re talking amonst  \n&gt; themselves and issuing orders, etc. So, clips without questions  \n&gt; aren&#39;t going to change and you need to accept them for what they are.\n&gt; \n&gt; As far as removing time: I don&#39;t see an issue with it if the clip is  \n&gt; noted, rather as in journalism where we add ... to denote that  \n&gt; material has been removed that was tangential to the main thrust of  \n&gt; the quote.\n&gt; \n&gt; Personally, I have to slow my communication stuff down by about half.  \n&gt; It comes through incredibly fast. I don&#39;t think I&#39;m alone. Another  \n&gt; deal-with-it issue. Slowing is not manipulating. Neither is  \n&gt; amplification of fainter responses or deamplification of  \n&gt; nonassociated noise.\n&gt; \n&gt; Some if us are recording mono and some stereo. Silencing one track to  \n&gt; better hear another is also not manipulating it falls in the  \n&gt; journalistic convention &quot;...&quot; category, to me anyway.\n&gt; \n&gt; Still, point taken on combining both unprocessed and processed clips.\n&gt; \n&gt; As for all the rest of the fretting about counting stations and  \n&gt; dividing up times and all, I&#39;d say if you want to do it, knock  \n&gt; yourself out. I don&#39;t think it ultimately matters because we&#39;re  \n&gt; already postulating that most of the time, the voice we hear is not  \n&gt; the real voice of the communicant. It doesn&#39;t matter if you hear  \n&gt; blips of the same announcer coming through at 15 second intervals.  \n&gt; It&#39;s what the voice might say that is important. I know that isn&#39;t  \n&gt; what you want to hear, but I think it&#39;s probably valid.\n&gt; \n&gt; Ann\n&gt; \n&gt; On Jan 21, 2008, at 11:52 AM, bruce halliday wrote:\n&gt; \n&gt; &gt; Frank R.,\n&gt; &gt;\n&gt; &gt; Once again pal, we are on apposing sides.\n&gt; &gt; As far as Babs having many friends here\n&gt; &gt;\n&gt; &gt; Welllll???\n&gt; &gt;\n&gt; &gt; Anyway I want to address the subject of removing time from a file.\n&gt; &gt; The way I am understanding what you mean by removing time is to\n&gt; &gt; cut segments of the recording out of the file.\n&gt; &gt;\n&gt; &gt; I myself do cut out simple noise or static fragments that are  \n&gt; &gt; naturally occurring in the sweep of the box\n&gt; &gt; for instance the minibox has an inherent hum or thump as it&#39;s  \n&gt; &gt; Creator calls it.\n&gt; &gt;\n&gt; &gt; When I receive a response through the minibox it will go something  \n&gt; &gt; like this &quot;yes HUM Bruce HUM we HUM are HUM here HUM&quot;\n&gt; &gt; I will definitely remove every HUM from between the words but that  \n&gt; &gt; does not change the message or affect the words that are spoken.\n&gt; &gt; I&#39;m assuming that is what you are talking about when you and babs  \n&gt; &gt; mention &quot;removing time&quot;\n&gt; &gt;\n&gt; &gt; I&#39;m just guessing but maybe babs is trying to insinuate that  \n&gt; &gt; researchers here are altering their files.,\n&gt; &gt; If so maybe she should be looking for that in her own back yard.  \n&gt; &gt; There must be someone she knows for a fact that is\n&gt; &gt; altering communications.\n&gt; &gt;\n&gt; &gt; And mike please lets not turn this into a whole big thing!\n&gt; &gt;\n&gt; &gt; Bruce\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Bruce Halliday\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; To: EVP-ITC@yahoogroups.com\n&gt; &gt; From: warrior18eii@...\n&gt; &gt; Date: Mon, 21 Jan 2008 08:03:09 -0800\n&gt; &gt; Subject: Re: [EVP-ITC] Babs has Issues!\n&gt; &gt;\n&gt; &gt; Very good observation Babs. Let me say that you have many friends  \n&gt; &gt; and associates here just for the simple fact that you have an  \n&gt; &gt; interest in ITC, are a researcher and a complex thinker. I think we  \n&gt; &gt; have shown in the past that we can have a disagreement and still  \n&gt; &gt; remain friends. You make a lot of good points in your post and I  \n&gt; &gt; would like to know who removes time from their recordings. I have  \n&gt; &gt; never removed time from my recordings and see no reason why anyone  \n&gt; &gt; else would without saying so in an accompanied post.\n&gt; &gt;\n&gt; &gt; I have limited experience with the 12-469&#39;s as a single piece of  \n&gt; &gt; equipment. I have arranged mine per Mike&#39;s, &quot;Spiricomp&quot; design. I  \n&gt; &gt; have 3, 12-469&#39;s feeding a four channel mixer, which goes into a  \n&gt; &gt; laptop running DC6 with Soundsoap 2. Mine scan equally spaced on  \n&gt; &gt; the FM band. I have had pretty good results until recently.\n&gt; &gt;\n&gt; &gt; At first the messages were pretty clear but I had a feeling I was  \n&gt; &gt; getting a different group than I normally have for the last few  \n&gt; &gt; years. When I would ask about my friends on the other side they  \n&gt; &gt; would tell me they will look for them. Well about 2 weeks ago the  \n&gt; &gt; 12-469 arrangement started generating a lot of interference and  \n&gt; &gt; feedback. I started hearing radio static voices as I use to get  \n&gt; &gt; with shortwave. Not voice fragments but voices made of static  \n&gt; &gt; (metallic and robotic). They were breaking through the sweeping. I  \n&gt; &gt; had a feeling someone else was trying to force their way through.  \n&gt; &gt; Finally the interference got so bad I was forced to revert back to  \n&gt; &gt; a simpler method I used before, which is using fan noise. One of  \n&gt; &gt; the first messages to come across was from a familiar voice telling  \n&gt; &gt; me and I quote, &quot;your method sucks&quot;. I have not used the 12-469&#39;s  \n&gt; &gt; since because of the clear messages I have been getting using water  \n&gt; &gt; and fan noise. That does not mean I have given up on the 12-469&#39;s  \n&gt; &gt; but I won&#39;t use them again until I am persuaded to by my friends on  \n&gt; &gt; the otherside that they are willing to use and adapt to it. To my  \n&gt; &gt; knowledge only Misty, Laura and myself use water for recording.\n&gt; &gt;\n&gt; &gt; Regards,\n&gt; &gt;\n&gt; &gt; Frank R.\n&gt; &gt;\n&gt; &gt; ----- Original Message ----\n&gt; &gt; From: babiarz3 &lt;babiarz3@...&gt;\n&gt; &gt; To: EVP-ITC@yahoogroups.com\n&gt; &gt; Sent: Monday, January 21, 2008 9:34:01 AM\n&gt; &gt; Subject: [EVP-ITC] Babs has Issues!\n&gt; &gt;\n&gt; &gt; Alright, you all know I&#39;m vocal and I haven&#39;t made any &quot;friends&quot; here\n&gt; &gt; but, if we can put that aside for a moment...\n&gt; &gt;\n&gt; &gt; Spirit communication has been my passion since day one, a little over\n&gt; &gt; 6 years ago. I am a believer in the afterlife and a believer in\n&gt; &gt; spirits attempting to communicate with us for a variety of reasons. I\n&gt; &gt; have spiritual beliefs that I feel strongly about and devote much of\n&gt; &gt; my waking (and sleeping) moments to thoughts about this field.\n&gt; &gt; However, I am also a researcher and a skeptic. In order for me to\n&gt; &gt; allow ideas to become part of my reality I must experiment. In order\n&gt; &gt; for me to believe something is paranormal I HAVE to rule out all other\n&gt; &gt; possible causes. That being said, I have some questions. My hope is\n&gt; &gt; that there are some here willing to enter into discussion with me.\n&gt; &gt;\n&gt; &gt; I have a difficult time with many of the files here. Many times, there\n&gt; &gt; is no question included in the file. I can not determine whether or\n&gt; &gt; not the &quot;reply&quot; is an intelligent reply. Maybe this has to do with\n&gt; &gt; allowable file size.\n&gt; &gt;\n&gt; &gt; Some of the files I have been able to download. (I don&#39;t always keep\n&gt; &gt; my email settings on for this group as I get too many - lol) When I\n&gt; &gt; look at the file I see problems. There will be complete flat line\n&gt; &gt; silence between the words. Many times the &quot;reply&quot; is also at the same\n&gt; &gt; decibel as the question askers voice. Those two things should not\n&gt; &gt; occur naturally considering the devices being used. That tells me that\n&gt; &gt; there is manipulation of the files. Now, what is manipulation to me,\n&gt; &gt; may not be manipulation to others. To me, any altering of the recorded\n&gt; &gt; file constitutes manipulation. I do not know if the reply was\n&gt; &gt; intelligent or manipulated to be intelligent.\n&gt; &gt;\n&gt; &gt; Some say that they simply remove the &quot;no response&quot; time. I&#39;ve been\n&gt; &gt; told it can be as much as 18 seconds removed from between words. Now\n&gt; &gt; we run into the problem of us deciding what word fits in with the\n&gt; &gt; question. What words are being ignored? Did we take nonsense and make\n&gt; &gt; sense? Did we amp every noise/word or only what fit?\n&gt; &gt;\n&gt; &gt; I think it&#39;s great that files are offered for peer review. However, I\n&gt; &gt; think we have to load them untouched or at the very least, offer\n&gt; &gt; exactly what was done to the entire file. Time elapsed between words,\n&gt; &gt; what was amped, etc. I&#39;d also love to see some of these sessions video\n&gt; &gt; taped with the question asker facing the camera and a second hand\n&gt; &gt; clock visible. Truly, we aren&#39;t researching if we don&#39;t have some\n&gt; &gt; protocol in place.\n&gt; &gt;\n&gt; &gt; Here is an issue I have with the RS Hacks. I have the 469. It takes\n&gt; &gt; approximately 18 seconds to scan through the AM frequencies. Now, the\n&gt; &gt; typical person would think that we can take that 18 seconds and divide\n&gt; &gt; it by the number of AM stations to determine how long we are on each\n&gt; &gt; station before moving on to the next one. In that way we could\n&gt; &gt; determine what is impossible to be said via a radio fragment. However,\n&gt; &gt; that&#39;s not correct. The scan cycle can vary from one frequency to the\n&gt; &gt; next and of course the biggest problem is that some stations are\n&gt; &gt; picked up over multiple frequencies; AM 640 can be heard on 630, 640,\n&gt; &gt; 650, 660 and maybe even 670. That extends the time a great deal. This\n&gt; &gt; is a difficult problem because it is almost impossible for the average\n&gt; &gt; person to be able to make a determination on time this way.\n&gt; &gt;\n&gt; &gt; I heard about the following today; An experimenter records at the same\n&gt; &gt; time every day Mon-Fri. We hear about the importance of meditating,\n&gt; &gt; automatic writing, etc at the same time every day but what we have to\n&gt; &gt; remember with this, is that now we are in essence tuning into the same\n&gt; &gt; radio show every day. One of my first experiments with the 469 had me\n&gt; &gt; hearing this deep male voice over and over again. What was he trying\n&gt; &gt; to tell me, I wondered. Than I realized that he was speaking\n&gt; &gt; approximately every 18 seconds; every time the scan hit that station.\n&gt; &gt; So, if you are removing up to 18 seconds between words, then you are\n&gt; &gt; really only recording the words from one station.\n&gt; &gt;\n&gt; &gt; This post is IN NO WAY trying to start anything besides discussion\n&gt; &gt; about some research problems. I know that there are those who are not\n&gt; &gt; concerned with anything more than the communication itself but I think\n&gt; &gt; that it is of the utmost importance to attempt to factor in some\n&gt; &gt; protocol in order for this to be considered serious research at all.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Looking for last minute shopping deals? Find them fast with Yahoo!  \n&gt; &gt; Search.\n&gt; &gt;\n&gt; &gt; Helping your favorite cause is as easy as instant messaging. You  \n&gt; &gt; IM, we give. Learn more.\n&gt; &gt;\n&gt; &gt;\n&gt;"}