{"id": "5988", "subject": "Re: [EVP-ITC] Re: Babs has Issues!", "author": "Lisby", "timestamp": "2008-01-21T20:46:53Z", "full_text": "Well, if it came right out and told me it was pure, unadulterated  \nevil and wanted to eat parts of me for supper or something--I suspect  \nI&#39;d tell it to get stuffed and &quot;thanks for playing,&quot; turn off the  \nradio, and ask my personal friends on the other side to make it go  \nhome. Pretty much end of story.\n\nAnn\n\n\nOn Jan 21, 2008, at 1:13 PM, Frank Ratka wrote:\n\n&gt;\n&gt; Good answer! Fear is a bitch isn&#39;t it. How it creeps in?\n&gt;\n&gt; As a matter of fact, I want everyone who is willing to tell me  \n&gt; (worse case scenario) what you think will happen to you if a purely  \n&gt; &quot;evil&quot; being was to enter your session? Just curious?!\n&gt;\n&gt; Frank R.\n&gt;\n&gt; ----- Original Message ----\n&gt; From: Lisby &lt;lisby@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Monday, January 21, 2008 11:35:30 AM\n&gt; Subject: Re: [EVP-ITC] Re: Babs has Issues!\n&gt;\n&gt;\n&gt; Oh dear. Here we go again.\n&gt;\n&gt; Look, Babs--it&#39;s really just this simple: if you are scared of  \n&gt; lower entities and you think that the hacked radio you are using is  \n&gt; really a channel for demon or whatever, then just stop. Put the  \n&gt; fricking radio down and go get another hobby. Leave it to those of  \n&gt; us who aren&#39;t afraid and don&#39;t care if someone calls us a bitch or  \n&gt; a slut and tries to pawn themselves off as Bazoozoo.\n&gt;\n&gt; Just. Stop. Listening. And. Worrying.\n&gt;\n&gt; And on top of all that, in this quote below, you seem to be saying  \n&gt; that the rest of us don&#39;t know what we&#39;re doing or are being fooled  \n&gt; by entities that only you have sussed. Guess what? You&#39;re wrong on  \n&gt; both counts, HMO.\n&gt;\n&gt; Ann\n&gt;\n&gt;\n&gt; On Jan 21, 2008, at 12:07 PM, babiarz3 wrote:\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; I&#39;ve recently started analyzing a 40 min 469 session. The results are\n&gt;&gt; scary. I&#39;d say at this point, and I&#39;m only 1/2 way through, 90% of  \n&gt;&gt; the\n&gt;&gt; communication is negative in nature and mentions many supposed  \n&gt;&gt; Demonic\n&gt;&gt; names. The layers of voices are, in many cases, multiple. Often, the\n&gt;&gt; listener hears very little of what is actually said. The voices  \n&gt;&gt; can be\n&gt;&gt; mocking or downright crude. I have not yet formed an opinion fully  \n&gt;&gt; but\n&gt;&gt; it would seem to me that these models are easy devices for lower  \n&gt;&gt; level\n&gt;&gt; entities to figure out how to use. I can not speak of the  \n&gt;&gt; attitudes or\n&gt;&gt; fears of those investigators present although at times, their voices\n&gt;&gt; are a bit shaky.\n&gt;&gt;\n&gt;&gt; Babs\n&gt;&gt;\n&gt;\n&gt;\n&gt;\n&gt; Looking for last minute shopping deals? Find them fast with Yahoo!  \n&gt; Search.\n&gt;\n&gt; \n\n\nWell, i i came igh ou and old me i was pu e, unadul e a ed e il and wan ed o ea pa s o me o suppe o some hing--I suspec I'd ell i o ge s u ed and \" hanks o playing,\" u n o he adio, and ask my pe sonal iends on he o he side o make i go home. P e y much end o s o y.AnnOn Jan 21, 2008, a 1:13 PM, F ank Ra ka w o e:Good answe ! Fea is a bi ch isn' i . How i c eeps in?As a ma e o ac , I wan e e yone who is willing o ell me (wo se case scena io) wha you hink will happen o you i a pu ely \"e il\" being was o en e you session? Jus cu ious?!F ank R.----- O iginal Message ----F om: Lisby ne >To: EVP-ITC@yahoog oups.comSen : Monday, Janua y 21, 2008 11:35:30 AMSubjec : Re: [EVP-ITC] Re: Babs has Issues!Oh dea . He e we go again.Look, Babs--i 's eally jus his simple: i you a e sca ed o lowe en i ies and you hink ha he hacked adio you a e using is eally a channel o demon o wha e e , hen jus s op. Pu he icking adio down and go ge ano he hobby. Lea e i o hose o us who a en' a aid and don' ca e i someone calls us a bi ch o a slu and ies o pawn hemsel es o as Bazoozoo.Jus . S op. Lis ening. And. Wo ying.And on op o all ha , in his quo e below, you seem o be saying ha he es o us don' know wha we' e doing o a e being ooled by en i ies ha only you ha e sussed. Guess wha ? You' e w ong on bo h coun s, HMO.AnnOn Jan 21, 2008, a 12:07 PM, babia z3 w o e:I' e ecen ly s a ed analyzing a 40 min 469 session. The esul s a esca y. I'd say a his poin , and I'm only 1/2 way h ough, 90% o hecommunica ion is nega i e in na u e and men ions many supposed Demonicnames. The laye s o oices a e, in many cases, mul iple. O en, helis ene hea s e y li le o wha is ac ually said. The oices can bemocking o down igh c ude. I ha e no ye o med an opinion ully bu i would seem o me ha hese models a e easy de ices o lowe le elen i ies o igu e ou how o use. I can no speak o he a i udes o ea s o hose in es iga o s p esen al hough a imes, hei oicesa e a bi shaky. BabsLooking o las minu e shopping deals? Find hem as wi h Yahoo! Sea ch."}