{"id": "5993", "subject": "Re: [EVP-ITC] For Those Serious About Research", "author": "Lisby", "timestamp": "2008-01-21T21:07:54Z", "full_text": "Juli--I think these are fabulous. It is amazing how &quot;creative&quot; they  \nget with the radio fragments--almost mischievous. ;) I hear each  \nclearly and as you do.\n\nAnn\n\nOn Jan 21, 2008, at 3:22 PM, Jules wrote:\n\n&gt; Guys,\n&gt; I just posted several files from a joint session this weekend in\n&gt; Kentucky. I would appreciate the imput from those who are serious\n&gt; about the research here. Many of the serious researchers have spent\n&gt; years, and countless hours a day testing these lines of communication.\n&gt; I for one refuse to allow the negitive get to me and will continue to\n&gt; work either independently or with my fellow colleages who truly  \n&gt; respect\n&gt; each other and their contributions in this area.\n&gt;\n&gt; So with that being said, I hope you enjoy the audio clips.\n&gt; They are from a Joe&#39;s Box session.\n&gt;\n&gt; In addition, I have introduced several new researchers to the\n&gt; RS hacked in hopes that their their future studies will add in our up\n&gt; hill climb in pursuing what we started.\n&gt;\n&gt; Thanks!\n&gt; Juli\n&gt;\n&gt;\n&gt; \n\n\nJuli--I hink hese a e abulous. I is amazing how \"c ea i e\" hey ge wi h he adio agmen s--almos mischie ous. ;) I hea each clea ly and as you do.AnnOn Jan 21, 2008, a 3:22 PM, Jules w o e:Guys, I jus pos ed se e al iles om a join session his weekend in Ken ucky. I would app ecia e he impu om hose who a e se ious abou he esea ch he e. Many o he se ious esea che s ha e spen  yea s, and coun less hou s a day es ing hese lines o communica ion. I o one e use o allow he negi i e ge o me and will con inue o wo k ei he independen ly o wi h my ellow colleages who uly espec  each o he and hei con ibu ions in his a ea.So wi h ha being said, I hope you enjoy he audio clips. They a e om a Joe's Box session.In addi ion, I ha e in oduced se e al new esea che s o he RS hacked in hopes ha hei hei u u e s udies will add in ou up hill climb in pu suing wha we s a ed.Thanks!Juli"}