{"id": "6003", "subject": "Re: To all my colleagues here", "author": "Jules", "timestamp": "2008-01-22T00:33:53Z", "full_text": "Anne,\n           I know just where Bruce is coming from here, cause I have \nto be honest,  I feel the same way.  If you taking a look at the \nposts from the weekend, there is nothing but mud slinging and \ndisrespect directed towards our research.  The conversations were in \nno way even a heathly debate.  It&#39;s ok to disagree and be opened \nminded, but sometimes some people you just have to shake you head and \nwalk away.  No matter what you say your response will never be right \nin their eyes.  \n \nI joinned this group over almost 2 years ago.  I have watched, \nlistened and learned from many.  I have observed those who in my \nopinion have taked advantage of Frank as well as the others and had \nnothing but selfish movities on their agenda.  I have seen people BEG \nfor boxes, have threated people via email and telephone, to the point \nwhere it has been come hate towards what we are doing.  \n \nI have stayed slient regarding this for a long while, and its about \ntime that if you can not be professional, curtious, and serious about \nwhat we are all doing here as a whole, THEN DON&#39;T LET THE DOOR HIT \nYOU IN THE ASS!\n \nSee regardless whether we post to this board or not, those who will \ncontinue the work will always be in contact and be dedicated to this \nwork no matter what!\n \nJuli\n\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, Lisby &lt;lisby@...&gt; wrote:\n&gt;\n&gt; Bruce,\n&gt; \n&gt; Please breathe and relax. You&#39;re very stressed today, obviously. \nHow  \n&gt; can so few and little flames mean anything to someone who has been  \n&gt; through the terrible fires that you have? You matter here and your  \n&gt; help is invaluable. You are also our friend and would be terribly  \n&gt; missed here.\n&gt; \n&gt; Peace and affection,\n&gt; \n&gt; Ann\n&gt; \n&gt; \n&gt; On Jan 21, 2008, at 5:58 PM, bhali333 wrote:\n&gt; \n&gt; &gt; Fellow researchers,\n&gt; &gt;\n&gt; &gt; I have decided to back away from participating in this group for a\n&gt; &gt; while. The constant clash of ego&#39;s and childish bickering of \nwhich I\n&gt; &gt; have become a big part has begun to affect my research in a \nnegative\n&gt; &gt; way.\n&gt; &gt; I have been advised to retreat from being an active part of this\n&gt; &gt; group for an undetermined amount of time. I would like to stay on \nthe\n&gt; &gt; rolls as a member but will not actively participate as far as \nposting\n&gt; &gt; results, files or opinions and advice.\n&gt; &gt;\n&gt; &gt; I will however be posting the results of my research on my box \nwebsite\n&gt; &gt; if there are any of you who would like to hear them.\n&gt; &gt;\n&gt; &gt; http://free-paranormalinvestigating.com/franksboxjoesbox/\n&gt; &gt;\n&gt; &gt; For the new members, please do not let my comments on this matter\n&gt; &gt; affect your opinion of this research. I have chosen not to\n&gt; &gt; participate here for personal reasons. I will be devoting all my\n&gt; &gt; energy to advancing the communication and technology.\n&gt; &gt;\n&gt; &gt; If any new members feel they value my advice please feel free to\n&gt; &gt; privately e-mail me paranormalinvestigating@...\n&gt; &gt;\n&gt; &gt; I will be glad to help anyone but will not offer advice on any\n&gt; &gt; subjects posted here.\n&gt; &gt;\n&gt; &gt; Thank you to all the friends that I have managed to make here you\n&gt; &gt; have been an immeasurable help.\n&gt; &gt;\n&gt; &gt; Thank you\n&gt; &gt; Bruce Halliday\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt;"}