{"id": "6006", "subject": "Re: [EVP-ITC] Re: To all my colleagues here", "author": "Lisby", "timestamp": "2008-01-22T00:49:22Z", "full_text": "Juli--\n\nThere must be a lot going on behind the scenes this weekend that I  \ndidn&#39;t see. I saw a bad thread spiral into a worse thread, but if  \nthat is all the heat it takes to kill us crabs, we&#39;re not as strong  \nas we think.\n\nIf you wanna fill me in on some of this missing back story privately,  \nI&#39;d be appreciative.\n\nAnn\n\n\nOn Jan 21, 2008, at 7:33 PM, Jules wrote:\n\n&gt;\n&gt; Anne,\n&gt; I know just where Bruce is coming from here, cause I have\n&gt; to be honest, I feel the same way. If you taking a look at the\n&gt; posts from the weekend, there is nothing but mud slinging and\n&gt; disrespect directed towards our research. The conversations were in\n&gt; no way even a heathly debate. It&#39;s ok to disagree and be opened\n&gt; minded, but sometimes some people you just have to shake you head and\n&gt; walk away. No matter what you say your response will never be right\n&gt; in their eyes.\n&gt;\n&gt; I joinned this group over almost 2 years ago. I have watched,\n&gt; listened and learned from many. I have observed those who in my\n&gt; opinion have taked advantage of Frank as well as the others and had\n&gt; nothing but selfish movities on their agenda. I have seen people BEG\n&gt; for boxes, have threated people via email and telephone, to the point\n&gt; where it has been come hate towards what we are doing.\n&gt;\n&gt; I have stayed slient regarding this for a long while, and its about\n&gt; time that if you can not be professional, curtious, and serious about\n&gt; what we are all doing here as a whole, THEN DON&#39;T LET THE DOOR HIT\n&gt; YOU IN THE ASS!\n&gt;\n&gt; See regardless whether we post to this board or not, those who will\n&gt; continue the work will always be in contact and be dedicated to this\n&gt; work no matter what!\n&gt;\n&gt; Juli\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, Lisby &lt;lisby@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Bruce,\n&gt; &gt;\n&gt; &gt; Please breathe and relax. You&#39;re very stressed today, obviously.\n&gt; How\n&gt; &gt; can so few and little flames mean anything to someone who has been\n&gt; &gt; through the terrible fires that you have? You matter here and your\n&gt; &gt; help is invaluable. You are also our friend and would be terribly\n&gt; &gt; missed here.\n&gt; &gt;\n&gt; &gt; Peace and affection,\n&gt; &gt;\n&gt; &gt; Ann\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; On Jan 21, 2008, at 5:58 PM, bhali333 wrote:\n&gt; &gt;\n&gt; &gt; &gt; Fellow researchers,\n&gt; &gt; &gt;\n&gt; &gt; &gt; I have decided to back away from participating in this group for a\n&gt; &gt; &gt; while. The constant clash of ego&#39;s and childish bickering of\n&gt; which I\n&gt; &gt; &gt; have become a big part has begun to affect my research in a\n&gt; negative\n&gt; &gt; &gt; way.\n&gt; &gt; &gt; I have been advised to retreat from being an active part of this\n&gt; &gt; &gt; group for an undetermined amount of time. I would like to stay on\n&gt; the\n&gt; &gt; &gt; rolls as a member but will not actively participate as far as\n&gt; posting\n&gt; &gt; &gt; results, files or opinions and advice.\n&gt; &gt; &gt;\n&gt; &gt; &gt; I will however be posting the results of my research on my box\n&gt; website\n&gt; &gt; &gt; if there are any of you who would like to hear them.\n&gt; &gt; &gt;\n&gt; &gt; &gt; http://free-paranormalinvestigating.com/franksboxjoesbox/\n&gt; &gt; &gt;\n&gt; &gt; &gt; For the new members, please do not let my comments on this matter\n&gt; &gt; &gt; affect your opinion of this research. I have chosen not to\n&gt; &gt; &gt; participate here for personal reasons. I will be devoting all my\n&gt; &gt; &gt; energy to advancing the communication and technology.\n&gt; &gt; &gt;\n&gt; &gt; &gt; If any new members feel they value my advice please feel free to\n&gt; &gt; &gt; privately e-mail me paranormalinvestigating@...\n&gt; &gt; &gt;\n&gt; &gt; &gt; I will be glad to help anyone but will not offer advice on any\n&gt; &gt; &gt; subjects posted here.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Thank you to all the friends that I have managed to make here you\n&gt; &gt; &gt; have been an immeasurable help.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Thank you\n&gt; &gt; &gt; Bruce Halliday\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;\n&gt; \n\n\nJuli--The e mus be a lo going on behind he scenes his weekend ha I didn' see. I saw a bad h ead spi al in o a wo se h ead, bu i ha is all he hea i akes o kill us c abs, we' e no as s ong as we hink.I you wanna ill me in on some o his missing back s o y p i a ely, I'd be app ecia i e.AnnOn Jan 21, 2008, a 7:33 PM, Jules w o e:Anne,I know jus whe e B uce is coming om he e, cause I ha e  o be hones , I eel he same way. I you aking a look a he pos s om he weekend, he e is no hing bu mud slinging and dis espec di ec ed owa ds ou esea ch. The con e sa ions we e in no way e en a hea hly deba e. I 's ok o disag ee and be opened minded, bu some imes some people you jus ha e o shake you head and walk away. No ma e wha you say you esponse will ne e be igh  in hei eyes. I joinned his g oup o e almos 2 yea s ago. I ha e wa ched, lis ened and lea ned om many. I ha e obse ed hose who in my opinion ha e aked ad an age o F ank as well as he o he s and had no hing bu sel ish mo i ies on hei agenda. I ha e seen people BEG  o boxes, ha e h ea ed people ia email and elephone, o he poin  whe e i has been come ha e owa ds wha we a e doing. I ha e s ayed slien ega ding his o a long while, and i s abou   ime ha i you can no be p o essional, cu ious, and se ious abou  wha we a e all doing he e as a whole, THEN DON'T LET THE DOOR HIT YOU IN THE ASS!See ega dless whe he we pos o his boa d o no , hose who will con inue he wo k will always be in con ac and be dedica ed o his wo k no ma e wha !Juli--- In EVP-ITC@yahoog oups.com, Lisby w o e:>> B uce,> > Please b ea he and elax. You' e e y s essed oday, ob iously. How > can so ew and li le lames mean any hing o someone who has been > h ough he e ible i es ha you ha e? You ma e he e and you  > help is in aluable. You a e also ou iend and would be e ibly > missed he e.> > Peace and a ec ion,> > Ann> > > On Jan 21, 2008, a 5:58 PM, bhali333 w o e:> > > Fellow esea che s,> >> > I ha e decided o back away om pa icipa ing in his g oup o a> > while. The cons an clash o ego's and childish bicke ing o  which I> > ha e become a big pa has begun o a ec my esea ch in a nega i e> > way.> > I ha e been ad ised o e ea om being an ac i e pa o his> > g oup o an unde e mined amoun o ime. I would like o s ay on  he> > olls as a membe bu will no ac i ely pa icipa e as a as pos ing> > esul s, iles o opinions and ad ice.> >> > I will howe e be pos ing he esul s o my esea ch on my box websi e> > i he e a e any o you who would like o hea hem.> >> > h p:// ee-pa ano malin es iga ing.com/ anksboxjoesbox/> >> > Fo he new membe s, please do no le my commen s on his ma e > > a ec you opinion o his esea ch. I ha e chosen no o> > pa icipa e he e o pe sonal easons. I will be de o ing all my> > ene gy o ad ancing he communica ion and echnology.> >> > I any new membe s eel hey alue my ad ice please eel ee o> > p i a ely e-mail me pa ano malin es iga ing@...> >> > I will be glad o help anyone bu will no o e ad ice on any> > subjec s pos ed he e.> >> > Thank you o all he iends ha I ha e managed o make he e you> > ha e been an immeasu able help.> >> > Thank you> > B uce Halliday> >> >> >>"}