{"id": "6042", "subject": "Re: Hi Group!!", "author": "psi_research", "timestamp": "2008-01-22T06:45:27Z", "full_text": "Hi Ralph, Welcome! You happened to walk in as the party was going full\nbore but stick around, you&#39;ll find most folks here really enjoy this\nfield and aren&#39;t interesting in judging others. Of course not all here\nare like that but for the most part it&#39;s a fine forum to participate\nin. -Bill\n\n--- In EVP-ITC@yahoogroups.com, &quot;Ralph Smith&quot; &lt;Ralphsmi@...&gt; wrote:\n&gt;\n&gt; Hello all you EVP and ITC Buffs,\n&gt; \n&gt; \n&gt;  Just putting my 2 cents in the mix so to speak. Hey I have posted \n&gt; some evp&#39;s in Ralph&#39;s Research Folder on here for your pleasure to \n&gt; listen to. I really don&#39;t care if anyone thinks they are fake or miss \n&gt; identified sounds. All I care about is that to me they are real and I \n&gt; did my time working on them and I don&#39;t have to prove to any Skeptics \n&gt; that what I have is evidence of the here after. You will never \n&gt; convince them and so why bother. All I know is what I got is enough \n&gt; evidence for me. You might believe it if you were here beside me at \n&gt; the time I am getting the evidence but we can&#39;t all be in one place \n&gt; at the same time and no one can prove it otherwise to others who \n&gt; question their validity unless they were there. Myself I believe all \n&gt; of those that post their evidence on here are not trying to decieve \n&gt; people with fake evidence. They are just sharing their experience \n&gt; with what they consider evidence for themselves and to let all of us \n&gt; hear that evidence and compare notes. If we are all believers in this \n&gt; field and are true to ouselves and this forum why do we have to prove \n&gt; anything to others who question our methods as long as we are sharing \n&gt; our experinces and getting results that we are satisfied with, to the \n&gt; group on here. It&#39;s nice to share our thoughts and methods and \n&gt; knowledge on this subject. Whatever method works for you and you get \n&gt; results who cares what others think as long as your happy with the \n&gt; finished results is all that matters. Can I ask what radio station \n&gt; says &quot; F--k Off &quot; on it and could that be just a snippet of some \n&gt; radio station that does not go by the rules of the FCC ? What radio \n&gt; station would say &quot; Hurry dead battery &quot; and then a few minutes later \n&gt; my batteries died ? You just can&#39;t convince a skeptic. So I say let&#39;s\n&gt; have fun with our experiments and not squabble over SKEPTICS. Let&#39;s \n&gt; enjoy the experience of sharing and not nit picking. I enjoy all the \n&gt; stuff people are presenting with all of their posts. It&#39;s very \n&gt; interesting. Keep up the good work all of you that love this field.\n&gt; I&#39;m just a Postal worker. I&#39;m no Rocket Scientist and not a \n&gt; professional by any means and I sure as heck am not an expert in this \n&gt; field, but I enjoy the friendship of those who love this exciting \n&gt; field such as all of you who are representing here. I thank you all \n&gt; for your comments whether good or bad on the postings I put on here.\n&gt; We have been getting some great stuff on the EVP postings as I have \n&gt; heard, so keep it up and have a great time doing it. Well enough of \n&gt; that 2 cents. If you have any questions on my EVPs just give me a \n&gt; holler. Peace to everyone and keep that info flowing. Knowldege is a \n&gt; terrible thing to waste LOL.\n&gt; \n&gt; Regards,\n&gt; Ralph the Ghost Hunter\n&gt;"}