{"id": "6050", "subject": "Re: How I will record my sessions, your input please.", "author": "LC Duplatt", "timestamp": "2008-01-22T12:14:05Z", "full_text": "Welcome, Rob!\n\nVery cool ideas (and programs).  Regan knocked it out of the park \nwith her ability, huh?  Cool... ;)\n\nLC\nhttp://www.AngelsGhosts.com\n\n--- In EVP-ITC@yahoogroups.com, &quot;dead.science&quot; &lt;dead.science@...&gt; \nwrote:\n&gt;\n&gt; Hello All:\n&gt; \n&gt; I am Rob Fitzgerald and I host the Dead Science Show at\n&gt; www.deadscience.com.  I  I should be receiving my mini box in about\n&gt; two weeks.  I would like to list my proposed method of \ndocumentation I\n&gt; will be using for my sessions and get your feedback if you will.\n&gt; First the mini box will be fed to a Zoom H4 so both the box and my\n&gt; audio can be recorded in very high bit rate on two separate \nchannels.\n&gt;  The entire session will be recorded on a Sony DSR-200a dvcam \nrecorder\n&gt; with an audio feed from the H4.  I will also have my data logger\n&gt; running and that captures my tri-field meter data and the magnetic\n&gt; field surrounding the area, the air temperature and the gamma\n&gt; radiation level present.  This is all saved and displayed on a \nmonitor\n&gt; and will also be fed to digital video recorder. Furthermore I will\n&gt; have my thermal imager watching the session and also record that \nvideo\n&gt; feed.  All feeds will be time code synchronized and captured. In the\n&gt; end the entire session will be saved to a DVD for study and \narchiving.\n&gt;  I will also of course keep copious notes on the session in a log \nbook\n&gt; and include my personal feelings and emotions from the session.\n&gt; \n&gt; I know this may seem over the top  and not at all necessary for a\n&gt; session to be successful, but I like to have as much data at hand to\n&gt; both rule in and out all possibilities.  The sessions should also \nmake\n&gt; for some interesting shows.\n&gt; Thanks for your time and for letting me in the group.\n&gt;"}