{"id": "6060", "subject": "Re: [EVP-ITC] Re: Scanning rates", "author": "Misty Dawn", "timestamp": "2008-01-22T17:03:16Z", "full_text": "--0-120976802-1201021396=:48677\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nI understand what you are saying Ron. I know when I use the ST method that the scan rate is SOOOOOOOO fast that nothing coherent is allowed to bleed thru from any radio station. I dont allow it to lock onto any radio station. I dont usually pick up full words much less bits of sentences. Its all just babble noise they manipulate, phonetics they can play with. \n   \n  Bearing that in mind some of the longest and most coherent replies have come from using the sweep tuning method (manually). Sometimes the sentences are so long I cant even name the files correctly LOL.\n   \n  I know for the 12-469 they were using a chip to increase the scan rate, but dont think they figured out that option for the others. Of course everyone could try out the manual ST and get a small radio with a turning dial they can rotate at a much faster rate.\n   \n  I have had live feedback during those sessions as well, even when its being scanned at such a fast rate out of the &quot;babble&quot; the voices form and carry over the entire sweep of the band in one coherent voice, parts of which can be heard live (sometimes).\n   \n  Its very easy, and simple to explore this method. No technical background needed. No building necessary. And thanks to Frank and Dave again for bringing it to the forefront of ideas in casual conversation. It works great!\n   \n  Misty\n\nRon &lt;countglockula@...&gt; wrote:\n          Although Babs and I have some fundamental disagreements, I believe \nthat posting files as pairs is beneficial in that it allows \nresearchers to hear the raw and final products together. As far as \nthe fear factor goes, if you don&#39;t like what you hear, and it really \nbothers you, then turn it off!\n\nOne potential problem with the existing hacks is that the scan rate \nis very slow and allows several full words to come through when \npassing over a station. Further, strong stations have more apparent \nbandwidth when received so complete phrases come through. While I \nhave gotten some interesting results using slow scan on the MiniBox, \nmy best results, as well as the preference of my users, tends to be \na faster scan where a word or so at most comes through per station.\n\nThe faster scan allows the entities more &#39;randomized&#39; raw material \nto work with so they can form their replies more coherently, and \nmost important, more accurately.\n\nIf experimenters wish to spend their time using the Shack Hacks, \nthen the scan rate must be increased or made variable in order to \nget the best results. While I have not inspected these radios in \ndetail, I suspect the scan is generated digitally so it will require \nan external scan generator to create the appropriate rates.\n\nUntil more is known about who and what we are communicating with, \nthis field will remain more an art than a science.\n\nRon Ricketts\nParanormalSystems.com\n\n--- In EVP-ITC@yahoogroups.com, &quot;babiarz3&quot; &lt;babiarz3@...&gt; wrote:\n&gt;\n&gt; Really??? Pointless? Is that the majority thought here, that it\n&gt; doesn&#39;t matter? That there&#39;s no room for improvement? No need for\n&gt; standards or protocols? \n&gt; The utter anger and refusal to post raw files concerns me and \nprobably\n&gt; a few others but, maybe not. My suggestions and questions are valid\n&gt; and should at least be considered regardless of what you think \nabout me. \n&gt; The whole &quot;Babs has Issues&quot; was a tongue in cheek title for the\n&gt; thread, knowing what some of you think of me. I thought it was \nfunny\n&gt; but apparently not. It is clear that some of you will not get past\n&gt; that and consider my observations. My sincere thanks to those of \nyou\n&gt; who are able to.\n&gt; \n&gt; Babs\n&gt; \n&gt; \n\n\n\n                         \n\n\n\n \n\n\n\n       \n---------------------------------\nBe a better friend, newshound, and know-it-all with Yahoo! Mobile.  Try it now.\r\n--0-120976802-1201021396=:48677\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;div&gt;I understand what you are saying Ron. I know when I use the ST method that the scan rate is SOOOOOOOO fast that nothing coherent is allowed to bleed thru from any radio station. I dont allow it to lock onto any radio station. I dont&nbsp;usually pick up full words much less bits of sentences. Its all just babble noise they manipulate, phonetics they can play with. &lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Bearing that in mind some of the longest and most coherent replies have come from using the sweep tuning method (manually). Sometimes the sentences are so long I cant even name the files correctly LOL.&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;I know for the 12-469 they were using a chip to increase the scan rate, but dont think they figured out that option for the others. Of course everyone could try out the manual ST and get a small radio with a turning dial they can rotate at a much faster rate.&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;I have had live feedback during those sessions as well, even\n when its being scanned at such a fast rate out of the &quot;babble&quot; the voices form and carry over the entire sweep of the band&nbsp;in one coherent voice, parts of which can be heard live (sometimes).&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Its very easy, and simple to explore this method. No technical background needed. No building necessary. And thanks to Frank and Dave again for bringing it to the forefront of ideas in casual conversation. It works great!&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Misty&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;Ron &lt;countglockula@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/div&gt;  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;div&gt;Although Babs and I have\n some fundamental disagreements, I believe &lt;BR&gt;that posting files as pairs is beneficial in that it allows &lt;BR&gt;researchers to hear the raw and final products together. As far as &lt;BR&gt;the fear factor goes, if you don&#39;t like what you hear, and it really &lt;BR&gt;bothers you, then turn it off!&lt;BR&gt;&lt;BR&gt;One potential problem with the existing hacks is that the scan rate &lt;BR&gt;is very slow and allows several full words to come through when &lt;BR&gt;passing over a station. Further, strong stations have more apparent &lt;BR&gt;bandwidth when received so complete phrases come through. While I &lt;BR&gt;have gotten some interesting results using slow scan on the MiniBox, &lt;BR&gt;my best results, as well as the preference of my users, tends to be &lt;BR&gt;a faster scan where a word or so at most comes through per station.&lt;BR&gt;&lt;BR&gt;The faster scan allows the entities more &#39;randomized&#39; raw material &lt;BR&gt;to work with so they can form their replies more coherently, and &lt;BR&gt;most important, more accurately.&lt;BR&gt;&lt;BR&gt;If\n experimenters wish to spend their time using the Shack Hacks, &lt;BR&gt;then the scan rate must be increased or made variable in order to &lt;BR&gt;get the best results. While I have not inspected these radios in &lt;BR&gt;detail, I suspect the scan is generated digitally so it will require &lt;BR&gt;an external scan generator to create the appropriate rates.&lt;BR&gt;&lt;BR&gt;Until more is known about who and what we are communicating with, &lt;BR&gt;this field will remain more an art than a science.&lt;BR&gt;&lt;BR&gt;Ron Ricketts&lt;BR&gt;ParanormalSystems.&lt;WBR&gt;com&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;, &quot;babiarz3&quot; &lt;babiarz3@..&lt;WBR&gt;.&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; Really??? Pointless? Is that the majority thought here, that it&lt;BR&gt;&gt; doesn&#39;t matter? That there&#39;s no room for improvement? No need for&lt;BR&gt;&gt; standards or protocols? &lt;BR&gt;&gt; The utter anger and refusal to post raw files concerns me and &lt;BR&gt;probably&lt;BR&gt;&gt; a few others but, maybe not. My suggestions and questions\n are valid&lt;BR&gt;&gt; and should at least be considered regardless of what you think &lt;BR&gt;about me. &lt;BR&gt;&gt; The whole &quot;Babs has Issues&quot; was a tongue in cheek title for the&lt;BR&gt;&gt; thread, knowing what some of you think of me. I thought it was &lt;BR&gt;funny&lt;BR&gt;&gt; but apparently not. It is clear that some of you will not get past&lt;BR&gt;&gt; that and consider my observations. My sincere thanks to those of &lt;BR&gt;you&lt;BR&gt;&gt; who are able to.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Babs&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&lt;BR&gt;&lt;/div&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;&lt;P&gt;&nbsp;&lt;/P&gt;\n&lt;OBJECT width=640 height=563&gt;&lt;PARAM NAME=&quot;movie&quot; VALUE=&quot;http://webcamitc.myphotoalbum.com/slideshow.swf?xmlFile=http://webcamitc.myphotoalbum.com/albumFeed.php?set_albumName=album01&quot;&gt;&lt;PARAM NAME=&quot;wmode&quot; VALUE=&quot;transparent&quot;&gt;\n&lt;embed src=&quot;http://webcamitc.myphotoalbum.com/slideshow.swf?xmlFile=http://webcamitc.myphotoalbum.com/albumFeed.php?set_albumName=album01&quot; type=&quot;application/x-shockwave-flash&quot; width=&quot;640&quot; height=&quot;563&quot; wmode=&quot;transparent&quot;&gt;&lt;/embed&gt;&lt;/OBJECT&gt;&lt;p&gt;&#32;\n      &lt;hr size=1&gt;Be a better friend, newshound, and \nknow-it-all with Yahoo! Mobile. &lt;a href=&quot;http://us.rd.yahoo.com/evt=51733/*http://mobile.yahoo.com/;_ylt=Ahu06i62sR8HDtDypao8Wcj9tAcJ &quot;&gt; Try it now.&lt;/a&gt;\r\n--0-120976802-1201021396=:48677--"}