{"id": "6070", "subject": "RE: [EVP-ITC] How to start", "author": "Carol B.", "timestamp": "2008-01-22T19:04:25Z", "full_text": "Bruce,\nThank you so much for the info...I&#39;m so excited to start this type of\ncommunication.  Thank you to all that have helped me to begin my new\nendeavor.\n\nCarol B.\n\n\n\n\n\n\n\n\n\n\n&gt; Carol B.,\n&gt;\n&gt; I&#39;m sure you will associate me with the hoopla that took place yesterday.\n&gt; I must apologise for my conduct. Please understand this is not a typical\n&gt; thing here\n&gt; it is a rare occasion.\n&gt;\n&gt; To answer your question, I have been a long time researcher and do\n&gt; research daily with every box that is available today\n&gt; including a Frank&#39;s box.\n&gt;\n&gt; If you already have your RS box and it is modified, you are 75% of the way\n&gt; there.\n&gt; I will explain in detail how to do a successful session.\n&gt; Let your spirit friends know you are about to turn the box on and ask if\n&gt; they would please join you in a communication session.\n&gt; Turn on your recording device(whichever you choose to record the session)\n&gt; state the date and time and number the session so you have a referral at a\n&gt; later date.\n&gt; Turn your RS box on and start the scan. I prefer and always use the AM\n&gt; band to do a session, it is less cluttered than FM and I find it easier to\n&gt; hear real time messages and answers.\n&gt; At first you can ask simple questions that will require short answers such\n&gt; as &quot; are there any spirits listening that wish to communicate with me&quot;\n&gt; &quot;can you say my name&quot;, &quot; can you tell me your name&quot; questions along those\n&gt; line will glean short understandable answers and messages. Not only for\n&gt; hearing in real time but also later when reviewing the recording.\n&gt;\n&gt; It will take time for you to develop what we call an ear for hearing the\n&gt; communication, that just means your listening skills during a session will\n&gt; become more honed and acute to the messages and answers being sent. Do not\n&gt; get discouraged if you do not hear any responses the first couple of\n&gt; sessions. Our friends need time to adjust to a new researcher and assign\n&gt; you a technician.\n&gt; But you can rest assured the communication will come.\n&gt;\n&gt; Keep the sessions to a limit of 10 to 15 minutes as to not overwhelm\n&gt; yourself when you need to listen back carefully to the recording or stress\n&gt; the energy supply of your spirit contacts.\n&gt;\n&gt; When you are done with your session let your spirit friends know you are\n&gt; about to end the session and turn the box off and give them about ten\n&gt; seconds before you do turn the box off.\n&gt;\n&gt; extend the same courtesy as you would speaking to someone on the phone,\n&gt; say goodbye and thank you and you will almost always get a cordial\n&gt; response.\n&gt;\n&gt; shut your box and again thank them for their efforts. you have now done a\n&gt; rudimentary box session. load it onto the computer and review it for\n&gt; messages and answers to your question that you missed during the live\n&gt; session. when you have done this post a message to the board and I will\n&gt; explain how to do a basic edit of the recording to better understand the\n&gt; responses that are less clear.\n&gt;\n&gt; good luck Carol and I am looking forward to researching with you.\n&gt;\n&gt; Bruce\n&gt; Bruce Halliday\n&gt;\n&gt;\n&gt; To: EVP-ITC@yahoogroups.comFrom: cbreck@...: Tue, 22 Jan 2008\n&gt; 11:05:35 -0600Subject: [EVP-ITC] How to start\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Hi all,I&#39;ve been reading all the posts for the last couple days....I&#39;m a\n&gt; littleafraid to ask but here goes....I&#39;m experienced with evp...but know\n&gt; nothingabout the radio shack hack....could someone tell me step by step\n&gt; how tohave a session? I&#39;m intrigued and really want to start delving into\n&gt; allof this.Thank youCarol B.\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; _________________________________________________________________\n&gt; Shed those extra pounds with MSN and The Biggest Loser!\n&gt; http://biggestloser.msn.com/"}