{"id": "6079", "subject": "My thoughts on &quot;Serious Research.&quot;", "author": "eastern_paranormal", "timestamp": "2008-01-23T12:17:55Z", "full_text": "I am the founder of Eastern Paranormal (www.easternparanormal.com) . \nWe have an award winning site, we actually one for &quot;Best Research \nSite,&quot; with some stiff competition. You can see it here: \n\nhttp://www.ghostworldconference.com/paranormalawards.shtml\n\nWe actually won against some teams that have the slogan &quot;We \ninvestigate by purely scientific means.&quot;\n\nI have came across many groups who say, &quot;We investigate by purely \nscientific means.&quot; In English to me that says, &quot;I watched Ghost \nHunters and wanted to start my own ghost hunting team.&quot; Many have no \nevidence simply because sometimes you have to use the paranormal to \nprove the paranormal.We don&#39;t know for sure how electricity works, \nbut it does. We don&#39;t know how bumble bees fly, but they do. There is \na lot we don&#39;t know. Science is often wrong as well about the \nsimplest things. I remember in science being taught that dogs see in \nblack and white. No color at all. It was actually a test question I \ngot wrong. Now they say dogs do see in color, different than us, but \nno less color (http://www.petplace.com/dogs/can-dogs-see-in-\ncolor/page1.aspx). Pet psychics have said forever dogs see in color. \nHow scientific is that? But they were right........Edgar Cayce was a \nvery simple man, not very educated. Yet he healed thousands of people \nand was used by many doctors where all hope had been lost. Did they \never prove scientifically how Cayce did what he did? Nope. Yet every \nyear the A.R.E. foundation is bombarded by letters from people who \nstill are being cured using his uneducated, not so scientific \nmethods.....\n\nI have several family members in the medical field. One of my closest \nfriends is a pharmacist and the other a doctor. We get along great \nbecause I respect their views and they do not try to impose their \nviews on mine.\nI am known for my soft spoken ways and a live and let live \nperson.....I believe in going to the beat of my own drum, not someone \nelse&#39;s. Being true to yourself is the hardest thing you will ever do, \nbut it&#39;s the best thing you can possibly do for yourself and everyone \naround you. That is my thoughts on &quot;Serious Research.&quot;\n\nGabreael"}