{"id": "6087", "subject": "Re: My Idea Of Serious Research", "author": "lisbyfarrum", "timestamp": "2008-01-23T16:29:55Z", "full_text": "Dear Bruce and everyone,\n\nYou know that I take this research very seriously and have done for a\nlong, long time. However, that said, please, please, please do not\nforget appreciate their humor, keep a good sense of one yourself, and\nlaugh. Be serious, but don&#39;t take everything so seriously that this\nresearch becomes a cross you have bear. One thing I have learned,\ngrowing up amongst the dead in a Spiritualist family, is that the dead\nvery much enjoy life. This communication excites and enthralls them as\nmuch as it does us. If you want to hear the proof, venture on over to\nDeb (misujoey)&#39;s site and listen to the joy and wonder in the\ntechnician&#39;s voice when he realizes she can hear him and he can hear\nher, &quot;That&#39;s Fantastic!&quot; he exclaims, and it is.\n\nWe can do this and we can enjoy it, too. Bruce, I feel that is\nespecially important for you, because you&#39;ve been through a lot, my\nfriend, and stress is worse than poison.\n\nAnn\n\n--- In EVP-ITC@yahoogroups.com, &quot;bhali333&quot;\n&lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; \n&gt; Hey guy&#39;s,\n&gt; \n&gt; I read a few posts in the last couple of days that discuss and or \n&gt; mention &quot;serious research&quot;\n&gt; \n&gt; I thought that I would throw my opinion in for what it&#39;s worth.\n&gt; \n&gt; Big surprise huh!\n&gt; \n&gt; My personal feelings are that I take this research very seriously, \n&gt; almost to the point of obsession. I am not sure whether that is a \n&gt; healthy thing or not, the other posts pertain to seriousness of \n&gt; research in the sense that some individuals believe and practice \n&gt; their research on a solely scientific and antiseptic basis.\n&gt; \n&gt; My definition of serious research is to do my best everyday to truly \n&gt; try and make the communication, technology and relationship between \n&gt; our world and the spirit world better and to continue to advance it.\n&gt; \n&gt; I know that our spirit counter parts are working a 1000% harder to \n&gt; send the communication than we are to receive it, my technitions have \n&gt; literaly told me so. With that in mind I believe they deserve our \n&gt; respect, gratitude and full effort and cooperation. To me that \n&gt; entails a high level of seriousness when approaching this research.\n&gt; \n&gt; If we are not completely serious about this gift of communication \n&gt; with other realms, then it is not research but a hobby, and in my \n&gt; opinion if your looking for a hobby take up needle point.\n&gt; \n&gt; Anyway that&#39;s the way I approach this research, just wanted to make \n&gt; my opinion known.\n&gt; \n&gt; AS USUAL!\n&gt; \n&gt; Bruce\n&gt;"}