{"id": "6149", "subject": "Re: FOR ANN Re: [EVP-ITC] rs 469 post", "author": "Lisby", "timestamp": "2008-01-24T02:41:52Z", "full_text": "Grazias. Buonas noches, amigo! Espero que usted consiga una respuesta.\n\nAnn :)\n\nOn Jan 23, 2008, at 9:21 PM, Ron Lederer wrote:\n\n&gt; Ann  I will be happy to ask.  This is actually the first (two)  \n&gt; messages that I personally believe I heard so it will be a stretch  \n&gt; for me, probably, to both ask a question and get a response.  Nice  \n&gt; thought...someday, maybe...hopefully.  I will test it tomorrow at  \n&gt; the same time of day and location outside...probably no rain  \n&gt; though.  From Mexico   Ron L\n&gt;\n&gt; Lisby &lt;lisby@...&gt; wrote:\n&gt;\n&gt; Ron,\n&gt;\n&gt; I do have someone close to me on the other side names Helen who I  \n&gt; have been asking after. Perhaps you can ask if this Helen is for me.\n&gt;\n&gt; Ann\n&gt;\n&gt; On Jan 23, 2008, at 6:00 PM, Ron Lederer wrote:\n&gt;\n&gt;&gt;\n&gt;&gt; I am posting two short sessions for hopefully others to comment  \n&gt;&gt; on.  This is completed with a RS 469 going directly into my  \n&gt;&gt; handheld digital recorder.  Coincidentally, I am outside in a  \n&gt;&gt; light rain so maybe it is ideal for me here in Mexico where I get  \n&gt;&gt; few signals.\n&gt;&gt; At first I thought I heard the word BUENO (hello in Spanish) but I  \n&gt;&gt; now hear DINO with is my wife&#39;s name...short for Dinorah.  She is  \n&gt;&gt; normally not with me for sessions and was not with me for this  \n&gt;&gt; session so I doubt what I am hearing.  Any comments would be  \n&gt;&gt; appreciated.\n&gt;&gt; The other recording I hear the name HELEN.  I don&#39;t know anyone  \n&gt;&gt; with that name.  Ron L\n&gt;&gt;\n&gt;&gt; Looking for last minute shopping deals? Find them fast with Yahoo!  \n&gt;&gt; Search.\n&gt;&gt;\n&gt;&gt; &lt;evphelen.wav&gt;\n&gt;\n&gt;\n&gt;\n&gt; Looking for last minute shopping deals? Find them fast with Yahoo!  \n&gt; Search.\n&gt;\n&gt; \n\n\nG azias. Buonas noches, amigo! Espe o que us ed consiga una espues a.Ann :)On Jan 23, 2008, a 9:21 PM, Ron Lede e w o e:Ann  I will be happy o ask.  This is ac ually he i s ( wo) messages ha I pe sonally belie e I hea d so i will be a s e ch o me, p obably, o bo h ask a ques ion and ge a esponse.  Nice hough ...someday, maybe...hope ully.  I will es i omo ow a he same ime o day and loca ion ou side...p obably no ain hough.  F om Mexico   Ron LLisby ne > w o e:Ron,I do ha e someone close o me on he o he side names Helen who I ha e been asking a e . Pe haps you can ask i his Helen is o me.AnnOn Jan 23, 2008, a 6:00 PM, Ron Lede e w o e:I am pos ing wo sho sessions o hope ully o he s o commen on.  This is comple ed wi h a RS 469 going di ec ly in o my handheld digi al eco de .  Coinciden ally, I am ou side in a ligh ain so maybe i is ideal o me he e in Mexico whe e I ge ew signals.A i s I hough I hea d he wo d BUENO (hello in Spanish) bu I now hea DINO wi h is my wi e's name...sho o Dino ah.  She is no mally no wi h me o sessions and was no wi h me o his session so I doub wha I am hea ing.  Any commen s would be app ecia ed. The o he eco ding I hea he name HELEN.  I don' know anyone wi h ha name.  Ron LLooking o las minu e shopping deals? Find hem as wi h Yahoo! Sea ch.Looking o las minu e shopping deals? Find hem as wi h Yahoo! Sea ch."}