{"id": "619", "subject": "Re: [EVP-ITC] Foreign language method-Japanese.", "author": "Frank Sumption", "timestamp": "2007-01-05T16:07:23Z", "full_text": "Thanks!\n\n\nFrank\n\n\n&gt;From: Misty Dawn &lt;bulletbabea@...&gt;\n&gt;Reply-To: EVP-ITC@yahoogroups.com\n&gt;To: EVP-ITC@yahoogroups.com\n&gt;Subject: Re: [EVP-ITC] Foreign language method-Japanese.\n&gt;Date: Wed, 3 Jan 2007 20:54:12 -0800 (PST)\n&gt;\n&gt;I played the &quot;from our system&quot; one first. That one I hear quite different \n&gt;on first impression tho I did hear some of what you did.\n&gt;\n&gt;   &quot;From a distant (three point eleven) star, tell a story today. &quot;\n&gt;   Under that I hear &quot;(theyre bombing in north kira)&quot; but I also hear the \n&gt;end the way you did if I stop/start it at the right point\n&gt;\n&gt;   Misty\n&gt;\n&gt;\n&gt;Frank Sumption &lt;franks-boxes@...&gt; wrote:\n&gt;           Typical or consistent with what I get with any method, from last \n&gt;night.\n&gt;Usually some can&#39;t hear foreign language method voices, especially those\n&gt;that speak the language. &quot;Norma&quot; is my wife, and &quot;Max&quot; is the kid from next\n&gt;door that used to be over almost everyday to work with the voices, but he&#39;s\n&gt;lost interest of the past year.\n&gt;\n&gt;The foreign language method is just using a shortwave receiver to pick up a\n&gt;foreign language broadcast, and recording it open air style, placing the\n&gt;tape deck, or recorder a short distance from the radio, and announcing you\n&gt;are doing an EVP recording. Almost any language will work, I like the voice\n&gt;that come through using Japanese, or Chinese. I use my ham rig as a\n&gt;receiver, but also have a compact Sony AM/FM/SW. Charli Claypool told me\n&gt;about this method, and she uses languages from the internet. I used this\n&gt;method to demonstrate EVP to the guys on last fall&#39;s hunting trip, they we\n&gt;able to hear the voices straight from the little tape deck I used.\n&gt;\n&gt;Frank\n&gt;\n&gt;__________________________________________________________\n&gt;Experience the magic of the holidays. Talk to Santa on Messenger.\n&gt;http://clk.atdmt.com/MSN/go/msnnkwme0080000001msn/direct/01/?href=http://imagine-windowslive.com/minisites/santabot/default.aspx?locale=en-us\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;  __________________________________________________\n&gt;Do You Yahoo!?\n&gt;Tired of spam?  Yahoo! Mail has the best spam protection around\n&gt;http://mail.yahoo.com\n\n_________________________________________________________________\nThe MSN Entertainment Guide to Golden Globes is here.  Get all the scoop. \nhttp://tv.msn.com/tv/globes2007/?icid=nctagline2"}