{"id": "621", "subject": "Re: [EVP-ITC] Did demons kill John Lennon? Haunted Times Magazine reports!", "author": "Misty Dawn", "timestamp": "2007-01-06T04:42:43Z", "full_text": "--0-1560264715-1168058563=:59660\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nEdison&#39;s Telephone to the Dead a.k.a. Franks Box?\n   \n  Sounds like fun you should post some of the results Chris =)\n   \n  Misty\n\nChristopher Moon &lt;cold12_99@...&gt; wrote:\n          The Winter 2006/2007 issue of Haunted Times Magazine is now available \nin stores as well as in the mail for our loyal subscribers! Make sure \nto stop by the official Haunted Times Magazine web site: \nhttp://www.hauntedtimes.com to subscribe! In this issue we feature a \nstory written by world renowned psychic Chip Coffee that delves into \nthe murder of Rock legend John Lennon. Did demons play a major role \nin his untimely death? Pick up an issue of HTM and find out&#8230; the \nanswer may shock you! Haunted Times Magazine is always 84 full color \nglossy pages of pure paranormal information and evidence. Also, make \nsure to stop by the Haunted Times Magazine web site to view our free \nonline winter issue. These are stories that are not featured in the \nprint issue.\n\nThe initial 2007 Ghost Hunter University schedule announced! Stop by: \nhttp://www.hauntedtimes.com to see just some of the great haunted \nlocations throughout the world where you can be trained to become a \nparanormal investigator by Christopher Moon and the Haunted Times \nMagazine staff. Each event includes a ghost hunting seminar and \ninteractive paranormal investigation of the property using real ghost \nhunting equipment&#8230; some events even include a haunted history dinner! \nThis is the only event that features the completed version of Thomas \nEdison&#39;s Telephone to the Dead where attendees can participate in \nreal time two-way E.V.P. voice communication with spirits. The \nhaunted properties include Waverly Hills Sanatorium, The Whaley \nHouse, The Hawthorne Hotel, The Lizzie Borden House, Ashmore Estates, \nThe Mason House Inn and Eastern State Penitentiary just to name a \nfew. Call toll-free: 1-877-880-6232 for tickets. Learn it and then \nlive it at a Ghost Hunter University!\n\nHaunted Times Magazine&#8230; Your Connection to the Other Side!\n\n\n\n         \n\n __________________________________________________\nDo You Yahoo!?\nTired of spam?  Yahoo! Mail has the best spam protection around \nhttp://mail.yahoo.com \r\n--0-1560264715-1168058563=:59660\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;DIV&gt;Edison&#39;s Telephone to the Dead a.k.a. Franks Box?&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;Sounds like fun you should post some of the results Chris =)&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;Misty&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;Christopher Moon &lt;cold12_99@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/DIV&gt;  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;&lt;!-- Network content --&gt;  &lt;DIV id=ygrp-text&gt;  &lt;DIV&gt;The Winter 2006/2007 issue of Haunted Times Magazine is now available &lt;BR&gt;in stores as well as in the mail for our loyal subscribers! Make sure &lt;BR&gt;to stop by the official Haunted Times Magazine web site: &lt;BR&gt;&lt;A href=&quot;http://www.hauntedtimes.com/&quot;&gt;http://www.hauntedt&lt;WBR&gt;imes.com&lt;/A&gt; to subscribe!\n In this issue we feature a &lt;BR&gt;story written by world renowned psychic Chip Coffee that delves into &lt;BR&gt;the murder of Rock legend John Lennon. Did demons play a major role &lt;BR&gt;in his untimely death? Pick up an issue of HTM and find out&#8230; the &lt;BR&gt;answer may shock you! Haunted Times Magazine is always 84 full color &lt;BR&gt;glossy pages of pure paranormal information and evidence. Also, make &lt;BR&gt;sure to stop by the Haunted Times Magazine web site to view our free &lt;BR&gt;online winter issue. These are stories that are not featured in the &lt;BR&gt;print issue.&lt;BR&gt;&lt;BR&gt;The initial 2007 Ghost Hunter University schedule announced! Stop by: &lt;BR&gt;&lt;A href=&quot;http://www.hauntedtimes.com/&quot;&gt;http://www.hauntedt&lt;WBR&gt;imes.com&lt;/A&gt; to see just some of the great haunted &lt;BR&gt;locations throughout the world where you can be trained to become a &lt;BR&gt;paranormal investigator by Christopher Moon and the Haunted Times &lt;BR&gt;Magazine staff. Each event includes a ghost hunting seminar and &lt;BR&gt;interactive paranormal\n investigation of the property using real ghost &lt;BR&gt;hunting equipment&#8230; some events even include a haunted history dinner! &lt;BR&gt;This is the only event that features the completed version of Thomas &lt;BR&gt;Edison&#39;s Telephone to the Dead where attendees can participate in &lt;BR&gt;real time two-way E.V.P. voice communication with spirits. The &lt;BR&gt;haunted properties include Waverly Hills Sanatorium, The Whaley &lt;BR&gt;House, The Hawthorne Hotel, The Lizzie Borden House, Ashmore Estates, &lt;BR&gt;The Mason House Inn and Eastern State Penitentiary just to name a &lt;BR&gt;few. Call toll-free: 1-877-880-6232 for tickets. Learn it and then &lt;BR&gt;live it at a Ghost Hunter University!&lt;BR&gt;&lt;BR&gt;Haunted Times Magazine&#8230; Your Connection to the Other Side!&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;p&gt;&#32;__________________________________________________&lt;br&gt;Do You Yahoo!?&lt;br&gt;Tired of spam?  Yahoo! Mail has the best spam protection around &lt;br&gt;http://mail.yahoo.com \r\n--0-1560264715-1168058563=:59660--"}