{"id": "6222", "subject": "Re: [EVP-ITC] Re: Posted just a few new FB#12 files some interesting sweep rate answers", "author": "Lisby", "timestamp": "2008-01-25T02:01:15Z", "full_text": "Here&#39;s an interesting one that Nick got on his first session with the  \nRS 20-125 hack. I didn&#39;t post it earlier because I didn&#39;t think it  \nwas clear enough, but I offer it now anyway, since its the first real  \n&quot;cosmic&quot; box communication we&#39;ve gotten. It was not in response to  \nany question. The file is slowed by about 40 percent. I believe it  \nsays, &quot;Look for life; look for death.&quot; The final word may be the name  \nKate. I&#39;m not sure. It&#39;s the first part that intrigues me.\n\n\n￼\nOn Jan 24, 2008, at 6:41 PM, bruce halliday wrote:\n\n&gt; LC,\n&gt;\n&gt; In my opinion what our friends mean by the messages\n&gt; of &quot;no more time&quot; or &quot;time running out&quot; Is meant\n&gt; as a warning to mankind that if we do not change and realise that life\n&gt; and mother earth are precious, and how to live together\n&gt; in &quot;harmony&quot; we are doomed to extinction.\n&gt;\n&gt; The sense of urgency I believe is meant to make us understand that  \n&gt; global tensions\n&gt; at this time could very well bring about this destruction, If  \n&gt; someone decides to turn left instead of right.\n&gt;\n&gt; That&#39;s my take on these type of messages, and I get at least one  \n&gt; every couple of sessions.\n&gt;\n&gt; Bruce\n&gt;\n&gt;\n&gt;\n&gt; Bruce Halliday\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; From: lcdupla@...\n&gt; Date: Thu, 24 Jan 2008 21:05:50 +0000\n&gt; Subject: [EVP-ITC] Re: Posted just a few new FB#12 files some  \n&gt; interesting sweep rate answers\n&gt;\n&gt; Nice, interesting files, Bruce.\n&gt;\n&gt; You and FS (his post today) got me wondering about this time no more\n&gt; thing...not to mention I heard similar statements of urgency over  \n&gt; my RS\n&gt; box set-up, too.\n&gt;\n&gt; Any more ideas regarding this, Bruce...FS...others? I personally\n&gt; believe time to be illusion, and I also know it is written &quot;time will\n&gt; be no more&quot; (biblical future prophecy).\n&gt;\n&gt; Still not sure where I fall with this, other than I do agree on this\n&gt; urgency, elevating consciousness, etc\n&gt;\n&gt; LC\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, &quot;bhali333&quot;\n&gt; &lt;paranormalinvestigating@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hey boy&#39;s and girls,\n&gt; &gt;\n&gt; &gt; Here are some new Frank&#39;s box files. You may find the ones about\n&gt; sweep\n&gt; &gt; rate interesting.\n&gt; &gt;\n&gt; &gt; There are quite a few good ones, New researchers please take note of\n&gt; &gt; the different sound between Frank&#39;s box and the RS boxes. The\n&gt; operation\n&gt; &gt; of the box and the sound and files it produces are very unique to\n&gt; each\n&gt; &gt; FB.\n&gt; &gt;\n&gt; &gt; Bruce\n&gt; &gt;\n&gt;\n&gt;\n&gt;\n&gt; Shed those extra pounds with MSN and The Biggest Loser! Learn more.\n&gt;\n&gt; \n\n\nHe e's an in e es ing one ha Nick go on his i s session wi h he RS 20-125 hack. I didn' pos i ea lie because I didn' hink i was clea enough, bu I o e i now anyway, since i s he i s eal \"cosmic\" box communica ion we' e go en. I was no in esponse o any ques ion. The ile is slowed by abou 40 pe cen . I belie e i says, \"Look o li e; look o dea h.\" The inal wo d may be he name Ka e. I'm no su e. I 's he i s pa ha in igues me.\nOn Jan 24, 2008, a 6:41 PM, b uce halliday w o e:LC, In my opinion wha ou iends mean by he messageso \"no mo e ime\" o \" ime unning ou \" Is mean  as a wa ning o mankind ha i we do no change and ealise ha li e and mo he ea h a e p ecious, and how o li e oge he in \"ha mony\" we a e doomed o ex inc ion. The sense o u gency I belie e is mean o make us unde s and ha global ensions a his ime could e y well b ing abou his des uc ion, I someone decides o u n le ins ead o igh . Tha 's my ake on hese ype o messages, and I ge a leas one e e y couple o sessions. B uceB uce Halliday To: EVP-ITC@yahoog oups.comF om: lcdupla@yahoo.comDa e: Thu, 24 Jan 2008 21:05:50 +0000Subjec : [EVP-ITC] Re: Pos ed jus a ew new FB#12 iles some in e es ing sweep a e answe sNice, in e es ing iles, B uce. You and FS (his pos oday) go me wonde ing abou his ime no mo e  hing...no o men ion I hea d simila s a emen s o u gency o e my RS box se -up, oo. Any mo e ideas ega ding his, B uce...FS...o he s? I pe sonally belie e ime o be illusion, and I also know i is w i en \" ime will be no mo e\" (biblical u u e p ophecy).S ill no su e whe e I all wi h his, o he han I do ag ee on his u gency, ele a ing consciousness, e c LC--- In EVP-ITC@yahoog oups.com, \"bhali333\" a ing@...> w o e:>> Hey boy's and gi ls,> > He e a e some new F ank's box iles. You may ind he ones abou  sweep > a e in e es ing.> > The e a e qui e a ew good ones, New esea che s please ake no e o  > he di e en sound be ween F ank's box and he RS boxes. The ope a ion > o he box and he sound and iles i p oduces a e e y unique o each > FB.> > B uce>Shed hose ex a pounds wi h MSN and The Bigges Lose ! Lea n mo e."}