{"id": "6223", "subject": "Re: For Babs--again", "author": "babiarz3", "timestamp": "2008-01-25T02:09:53Z", "full_text": "Thank you kindly for giving me the opportunity to leave one more\ncomment before &quot;banning&quot; me. \nI have given some serious thought to this group over the last few\ndays. Contrary to popular opinion, I have never been attacking. I have\nnot name called, used profanity, etc. I have brought another opinion,\nanother thought, another suggestion. \nThis group is called a &quot;discussion&quot; group. Discussions usually involve\nmore than one opinion. I did not know that I had joined a group of\n&quot;gurus&quot; as you are so quick to call others mockingly. You do not want\nany one&#39;s opinion if it is different than your own. That&#39;s fine, truly. \nYou don&#39;t have to ban me. I won&#39;t come back again. \n\n\n--- In EVP-ITC@yahoogroups.com, bruce halliday\n&lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; \n&gt; BRAVO FRANK!!!!!!!!!!!\n&gt;  \n&gt; BRUCE\n&gt; Bruce Halliday \n&gt; \n&gt; \n&gt; To: evp-itc@...: franks-boxes@...: Thu, 24 Jan 2008 13:35:41\n-0700Subject: [EVP-ITC] For Babs--again\n&gt; \n&gt; \n&gt; \n&gt; \n&gt;  I don&#39;t have my group e-mail on, so can&#39;t see posts and replies\nfrom here , my apologies to the group, but--I&#39;m such an ignorant\negoistic dumbass that I gave you the benefit of the doubt and allowed\nyou to say on the group despite the fact that most find you very\noffensive. Despite your obvious uninformed, ignorant and mean spirited\nattacks on other members character--still you were allowed to stay.\nSay good-bye Babs!  Frank-S\n&gt; \n&gt; Need to know the score, the latest news, or you need your\nHotmail-get your &quot;fix&quot;. Check it out. \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Need to know the score, the latest news, or you need your\nHotmail-get your &quot;fix&quot;.\n&gt; http://www.msnmobilefix.com/Default.aspx\n&gt;"}