{"id": "6231", "subject": "Just starting a bekind to all thread here !!!", "author": "Ralph Smith", "timestamp": "2008-01-25T06:17:16Z", "full_text": "Hi all you EVP and ITC buffs,\n\n It&#39;s me again Ralph just wanting to throw some love around here to \nmaybe get back to what this group is all about. That is friendship \nand sharing files and experiments and Ideas of how we can better \nourselves for making contact with the other side and getting down to \nthe Nitty Gritty without the negativity. That sounds like a song LOL. \nWell I myself respect everyone in this group I admire all your hard \nwork you guys do and the amount of time you put forth to try to \nunderstand what all of this is leading to. Your efforts are \nrelentless. I myself can only put forth alittle time of what I can \nspare, because of my work and my Wife ( who puts up with all this \nmanagery ). You see my Wife is Italian and she is all about Family \nand I have to deal with all of her relatives (all 2,000 of them),just \nkidding. They all like to visit and you know how that is LOL !! So I \ndo this when I have the chance. I envy all of you that can really get \ndown and dirty with all of your research and experiments like you all \ndo. I wish I had the time to be like you guys. I love the fact that \nyou all share your findings and files and thoughts on how to do \nthings better and how you help others who are new to this field like \nme. So all I can say is don&#39;t let negativity get this group down and \njust keep on doing what you all are here for people. What I hear from \nsome of you is that the other side doesn&#39;t like discord or negativty \nin this effort to communicate with them. This is just my thoughts and \nmy feelings about it. Just throwing some Love your way to get \neverybody back on track. I see your almost there. I just want to say \nPeace to all and Keep up the great work for the research.\n\n Hi Ann,\n\n  Yes I did get your emails on the Chadds Ford case and will be \ngetting back to you soon on that. It&#39;s just something with that \npicture that bothers me. I&#39;ll talk to you about that too. Have a \ngreat day Ann.\n\nHi Juli,\n\n I will call you when I can about the shadowy figure that maybe \nfollowed me home. I hope your doing okay Juli and will get back to \nyou too. Have a great day also and to everyone in the group. Frank S. \nkeep up the fanatstic work your doing too. Mike Colleta I really like \nyour Podcasts you crack me up sometimes LOL. Bruce H. that was a \ngreat interview with you and Mike I enjoyed it alot. Bye for now and \nbe good all.\n\nReagds,\n\nRalph of SPIRIT Paranormal Investigation Team"}