{"id": "6260", "subject": "Re: [EVP-ITC] Re: Posted just a few new FB#12 files some interesting sweep rate answers", "author": "Lisby", "timestamp": "2008-01-25T18:44:29Z", "full_text": "You know, Frank, I seem somehow completely agree that I don&#39;t give a  \ndarn who believes my personal research except me and needing proof.  \nIt&#39;s a disconnect, I do admit it, but there it is. God knows, I am  \nimperfect. But my affection for those on the Other Side is massive,  \nand I do always promise that if I see the proof I need, I will change  \nmy mind and let everyone know I have. So, I am very glad to hear that  \nHans and Ernst, et al, are trying to get things online. I have always  \nrespected both to them to the maximum. I will keep my eyes peeled for  \ntheir updated material. Nothing would make me happier than to be  \nwrong in this case. Really.\n\nThanks for debating with me, my friend. :)\n\nAnn\n\n\nOn Jan 25, 2008, at 1:31 PM, Frank Ratka wrote:\n\n&gt;\n&gt; Don&#39;t worry Ann, there is nothing wrong with being a skeptic. Just  \n&gt; don&#39;t fall into the category of close-minded skeptic, where you  \n&gt; dismiss a claim for the sake of dismissing it and not because you  \n&gt; have proof it is false. I don&#39;t claim to be skeptical for reasons  \n&gt; you will read below, although at one time I was....\n&gt;\n&gt; The message I posted from technician was a specific message by  \n&gt; technician for the members of INIT. It was not a general message to  \n&gt; the world. What it does a good job of is outlining their purpose  \n&gt; and identifying obstacles. What a lot of people do not realize is  \n&gt; that most of these messages you receive are not for anyone other  \n&gt; that the one who receives them. They are personal! Mark and Rolf  \n&gt; both shared a great deal of information with me as well as others.  \n&gt; Mark has personally told me he don&#39;t care who believes or doesn&#39;t  \n&gt; believe the things that happened then. Those experiences changed  \n&gt; him for life and will always will be help by him as truth.\n&gt;\n&gt; At the present moment Rolf, Dr. Senkowski and Hans are translating  \n&gt; Adolf Holmes journals and writings into English. They are being  \n&gt; posted piece by piece on the World ITC website. You may have not  \n&gt; noticed because the changes have not been announced but they have  \n&gt; been posting them since last June.\n&gt;\n&gt; As for the validity of the events of the pioneers I have to give  \n&gt; them credence just from my own experiences since I began. I have  \n&gt; had many wonderful things happen while I have been experimenting  \n&gt; with the many methods and aspects of ITC. These experiences have  \n&gt; made me realize that those events that you and I have read about  \n&gt; are not that outlandish and are absolutely possible.\n&gt;\n&gt; Regards,\n&gt;\n&gt; Frank R.\n&gt;\n&gt; ----- Original Message ----\n&gt; From: Lisby &lt;lisby@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Friday, January 25, 2008 11:04:26 AM\n&gt; Subject: Re: [EVP-ITC] Re: Posted just a few new FB#12 files some  \n&gt; interesting sweep rate answers\n&gt;\n&gt; On Jan 25, 2008, at 9:38 AM, Frank Ratka wrote:\n&gt; &gt;&gt;It really surprises me how many new and old ITC &quot;researchers&quot; have\n&gt; not gone through the old data and recordings. The pioneers of this\n&gt; &quot;field&quot; took in tens of thousands of messages and recordings through\n&gt; a wide range of media.&lt;&lt;\n&gt;\n&gt; Yes, they may have done, but how much of that was ever made public?\n&gt; Not very much. Even today. I have gone through what has been\n&gt; released, about six times over. Mark has let more out than just about\n&gt; anyone. The key players, Maggie and Jules, have made very little of\n&gt; theirs available indeed. I&#39;d love to see that change so that we can\n&gt; better access what was going on.\n&gt;\n&gt; At the time INIT was together, I was rather desperately wanting and\n&gt; asking for more information. When things began to be made public in\n&gt; the United States, it was translated newsletters- -again anecdotal--no\n&gt; attached files, obviously; photos that looked produced with 1980s\n&gt; xerox technology (It *was* the 1980s, after all); a lot of second-\n&gt; hand stories and a a few first-hand ones passed from person to person\n&gt; via letters and telephone conversations. Later, there was audio from\n&gt; researchers like Sarah who let her phone messages from Raudive be\n&gt; made public. As I noted, I don&#39;t have a problem with most of those.\n&gt; Obviously, a voice was recorded on an answering machine and can still\n&gt; be listened to today. I&#39;d prefer to think that voice really is\n&gt; Raudive, but remember that it was not EVP--it was real phone calls.\n&gt;\n&gt; When Macy wrote his book about it, Miracles in the Storm, I was\n&gt; figuratively, if not literally, the the first person who bought it. I\n&gt; thought, &quot;now I am finally going to find out what really happened and\n&gt; be awed by the incredible evidence.&quot; Only Mark&#39;s book offered none of\n&gt; that for me. I was just looking at the customer reviews for the book\n&gt; on Amazon, because I thought I had written a review of it there at\n&gt; the time. I didn&#39;t, but here is one from someone who pretty much sums\n&gt; up what I think about it: &quot;Macy&#39;s book focuses mainly on the\n&gt; personality conflicts that undermined an attempt at high-tech\n&gt; communications with the spirit world. His style is readable and\n&gt; brisk, his tone sincere and unaffected, but he provides little or no\n&gt; evidence that the phenomena he describes are authentic. The main\n&gt; researchers he depicts come off more as enthusiastic dilettantes than\n&gt; serious scientists. For me, Macy forfeits nearly all credibility when\n&gt; he casually declares that the history of the human race can be\n&gt; understood by integrating some of the spirit communications with the\n&gt; writings of Erich von Daniken (p.140)! Von Daniken, of CHARIOTS OF\n&gt; THE GODS fame, is an entirely discredited huckster. If Macy can be\n&gt; persuaded by von Daniken&#39;s pop-culture writings, he will probably\n&gt; believe just about anything. There is an unfortunate messianic tone\n&gt; pervading the book - the message that a new dawn of humanity is\n&gt; coming, courtesy of the spirit communicators and the mortals who\n&gt; spread their message. You&#39;ll probably find MIRACLES IN THE STORM\n&gt; enjoyable and easy to read (hence three stars), but it will convince\n&gt; no one who isn&#39;t already a believer.&quot;\n&gt;\n&gt; I mentioned $cientology wryly, and I should have put in a ;) or\n&gt; something--my bad--but I do stand by the similarity in message and\n&gt; tone. I&#39;m not conflating the two, I&#39;m just pointing out what makes me\n&gt; wary, and the sentence, &quot;our progress toward a free, wealthy and sane\n&gt; future in which humanity would have stripped off the chains of\n&gt; intolerance and cruelty&quot; is especially redolent.\n&gt;\n&gt; In short, while I do believe that we all need to evolve into more\n&gt; loving and spiritual beings, and I have tried all my life to do so\n&gt; with a few limited successes, I still find that becoming &quot;better&quot; is\n&gt; not tantamount to becoming less critical or buying into every\n&gt; messiah&#39;s momentum. As I&#39;ve said before, I want to believe, but I\n&gt; will not believe only because I want to. And I&#39;m not even saying that\n&gt; the whole INIT thing was a fraud. It wasn&#39;t. But I do think that\n&gt; there are aspects of it that were, or that were highly inflated. And\n&gt; we have to be honest about that or we can&#39;t really be honest about\n&gt; what is unshakable in paranormal research.\n&gt;\n&gt; And this is just my own opinion, and we know what opinions are like,\n&gt; and perhaps I am one. But I hope you will humor me and keep me around\n&gt; because even one of those has its uses. ;)\n&gt;\n&gt; Your friend,\n&gt;\n&gt; Ann\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Never miss a thing. Make Yahoo your homepage.\n&gt;\n&gt; \n\n\nYou know, F ank, I seem somehow comple ely ag ee ha I don' gi e a da n who belie es my pe sonal esea ch excep me and needing p oo . I 's a disconnec , I do admi i , bu he e i is. God knows, I am impe ec . Bu my a ec ion o hose on he O he Side is massi e, and I do always p omise ha i I see he p oo I need, I will change my mind and le e e yone know I ha e. So, I am e y glad o hea ha Hans and E ns , e al, a e ying o ge hings online. I ha e always espec ed bo h o hem o he maximum. I will keep my eyes peeled o hei upda ed ma e ial. No hing would make me happie han o be w ong in his case. Really.Thanks o deba ing wi h me, my iend. :)AnnOn Jan 25, 2008, a 1:31 PM, F ank Ra ka w o e:Don' wo y Ann, he e is no hing w ong wi h being a skep ic. Jus don' all in o he ca ego y o close-minded skep ic, whe e you dismiss a claim o he sake o dismissing i and no because you ha e p oo i is alse. I don' claim o be skep ical o easons you will ead below, al hough a one ime I was....The message I pos ed om echnician was a speci ic message by echnician o he membe s o INIT. I was no a gene al message o he wo ld. Wha i does a good job o is ou lining hei pu pose and iden i ying obs acles. Wha a lo o people do no ealize is ha mos o hese messages you ecei e a e no o anyone o he ha he one who ecei es hem. They a e pe sonal! Ma k and Rol bo h sha ed a g ea deal o in o ma ion wi h me as well as o he s. Ma k has pe sonally old me he don' ca e who belie es o doesn' belie e he hings ha happened hen. Those expe iences changed him o li e and will always will be help by him as u h.A he p esen momen Rol , D . Senkowski and Hans a e ansla ing Adol Holmes jou nals and w i ings in o English. They a e being pos ed piece by piece on he Wo ld ITC websi e. You may ha e no no iced because he changes ha e no been announced bu hey ha e been pos ing hem since las June. As o he alidi y o he e en s o he pionee s I ha e o gi e hem c edence jus om my own expe iences since I began. I ha e had many wonde ul hings happen while I ha e been expe imen ing wi h he many me hods and aspec s o ITC. These expe iences ha e made me ealize ha hose e en s ha you and I ha e ead abou a e no ha ou landish and a e absolu ely possible.Rega ds,F ank R.----- O iginal Message ----F om: Lisby ne >To: EVP-ITC@yahoog oups.comSen : F iday, Janua y 25, 2008 11:04:26 AMSubjec : Re: [EVP-ITC] Re: Pos ed jus a ew new FB#12 iles some in e es ing sweep a e answe sOn Jan 25, 2008, a 9:38 AM, F ank Ra ka w o e:>>I eally su p ises me how many new and old ITC \" esea che s\" ha e no gone h ough he old da a and eco dings. The pionee s o his \" ield\" ook in ens o housands o messages and eco dings h ough a wide ange o media.Yes, hey may ha e done, bu how much o ha was e e made public? No e y much. E en oday. I ha e gone h ough wha has been  eleased, abou six imes o e . Ma k has le mo e ou han jus abou  anyone. The key playe s, Maggie and Jules, ha e made e y li le o   hei s a ailable indeed. I'd lo e o see ha change so ha we can be e access wha was going on.A he ime INIT was oge he , I was a he despe a ely wan ing andasking o mo e in o ma ion. When hings began o be made public in  he Uni ed S a es, i was ansla ed newsle e s- -again anecdo al--no a ached iles, ob iously; pho os ha looked p oduced wi h 1980s xe ox echnology (I *was* he 1980s, a e all); a lo o second- hand s o ies and a a ew i s -hand ones passed om pe son o pe son  ia le e s and elephone con e sa ions. La e , he e was audio om esea che s like Sa ah who le he phone messages om Raudi e bemade public. As I no ed, I don' ha e a p oblem wi h mos o hose. Ob iously, a oice was eco ded on an answe ing machine and can s ill be lis ened o oday. I'd p e e o hink ha oice eally is Raudi e, bu emembe ha i was no EVP--i was eal phone calls.When Macy w o e his book abou i , Mi acles in he S o m, I was  igu a i ely, i no li e ally, he he i s pe son who bough i . I  hough , \"now I am inally going o ind ou wha eally happened and be awed by he inc edible e idence.\" Only Ma k's book o e ed none o   ha o me. I was jus looking a he cus ome e iews o he book on Amazon, because I hough I had w i en a e iew o i he e a   he ime. I didn' , bu he e is one om someone who p e y much sums up wha I hink abou i : \"Macy's book ocuses mainly on he pe sonali y con lic s ha unde mined an a emp a high- ech communica ions wi h he spi i wo ld. His s yle is eadable and b isk, his one since e and una ec ed, bu he p o ides li le o no e idence ha he phenomena he desc ibes a e au hen ic. The main  esea che s he depic s come o mo e as en husias ic dile an es han se ious scien is s. Fo me, Macy o ei s nea ly all c edibili y when he casually decla es ha he his o y o he human ace can be unde s ood by in eg a ing some o he spi i communica ions wi h he w i ings o E ich on Daniken (p.140)! Von Daniken, o CHARIOTS OF THE GODS ame, is an en i ely disc edi ed hucks e . I Macy can be pe suaded by on Daniken's pop-cul u e w i ings, he will p obably belie e jus abou any hing. The e is an un o una e messianic one pe ading he book - he message ha a new dawn o humani y is coming, cou esy o he spi i communica o s and he mo als who sp ead hei message. You'll p obably ind MIRACLES IN THE STORM enjoyable and easy o ead (hence h ee s a s), bu i will con ince no one who isn' al eady a belie e .\"I men ioned $cien ology w yly, and I should ha e pu in a ;) o  some hing--my bad--bu I do s and by he simila i y in message and  one. I'm no con la ing he wo, I'm jus poin ing ou wha makes me wa y, and he sen ence, \"ou p og ess owa d a ee, weal hy and sane  u u e in which humani y would ha e s ipped o he chains o  in ole ance and c uel y\" is especially edolen .In sho , while I do belie e ha we all need o e ol e in o mo e lo ing and spi i ual beings, and I ha e ied all my li e o do so wi h a ew limi ed successes, I s ill ind ha becoming \"be e \" is no an amoun o becoming less c i ical o buying in o e e y messiah's momen um. As I' e said be o e, I wan o belie e, bu I will no belie e only because I wan o. And I'm no e en saying ha   he whole INIT hing was a aud. I wasn' . Bu I do hink ha   he e a e aspec s o i ha we e, o ha we e highly in la ed. And we ha e o be hones abou ha o we can' eally be hones abou  wha is unshakable in pa ano mal esea ch.And his is jus my own opinion, and we know wha opinions a e like, and pe haps I am one. Bu I hope you will humo me and keep me a ound because e en one o hose has i s uses. ;)You iend,AnnNe e miss a hing. Make Yahoo you homepage."}