{"id": "6278", "subject": "Re: [EVP-ITC] Re: New Box Coming", "author": "Lisby", "timestamp": "2008-01-26T00:30:34Z", "full_text": "We hacked the 20-125 in about 10 minutes and it&#39;s working great. The  \nradio and an adaptor and some rechargeable batteries cost me $70.\n\nAnn\n\nOn Jan 25, 2008, at 6:51 PM, ecuyler wrote:\n\n&gt; Thanks for the help Juli. Now that you mention the 20-125, I remember\n&gt; reading about Steve hacking it.\n&gt;\n&gt; I&#39;ve got the 12-469 & 70 burned in my brain. Every time I&#39;m near a\n&gt; Radio Shack, I stop in to see if they have an older 470. I will\n&gt; certainly try out the 20-125.\n&gt;\n&gt; I had actually been seriously thinking about getting a Mini Box, but\n&gt; that&#39;s a hefty price tag. Especially since I have no experience with\n&gt; box research at this point.\n&gt;\n&gt; Jeremy\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, juli velazquez &lt;ghostchasingfool@...&gt;\n&gt; wrote:\n&gt; &gt;\n&gt; &gt; Jeremy: IF you are unable to find an old 470 and you dont\n&gt; care for the clicking on the 69, why don&#39;t you try the 20-125? This\n&gt; has the internal speaker and you can hack that as well. I believe\n&gt; Steve has directions on his site, keyportparanormal.com.\n&gt; &gt;\n&gt; &gt; Good luck!\n&gt; &gt;\n&gt; &gt; Juli\n&gt; &gt;\n&gt; &gt; ecuyler &lt;ecuyler@...&gt; wrote:\n&gt; &gt; I just read on the Paranormal Systems website that they\n&gt; are developing\n&gt; &gt; a new box called the MaxiBox. It has a lot of features I&#39;ve heard\n&gt; &gt; Bruce mention that would be beneficial to the boxes.\n&gt; &gt;\n&gt; &gt; Hell, I&#39;ve been trying my best to locate an older 12-470 to  \n&gt; modify so\n&gt; &gt; I could start doing the research. I know there is the 12-469, but\n&gt; &gt; I&#39;ve been hesitant because of all the talk about the annoying click.\n&gt; &gt;\n&gt; &gt; Jeremy\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; The contents of this eletronic correspondence is private &\n&gt; confidential and meant only for the party and/or parties it is\n&gt; addressed to.\n&gt; &gt;\n&gt; &gt; No part of this email transmission may be publicly posted or\n&gt; forwarded to other parties without explicit written permission.\n&gt; &gt;\n&gt;\n&gt;\n&gt; \n\n\nWe hacked he 20-125 in abou 10 minu es and i 's wo king g ea . The adio and an adap o and some echa geable ba e ies cos me $70.AnnOn Jan 25, 2008, a 6:51 PM, ecuyle w o e:Thanks o he help Juli. Now ha you men ion he 20-125, I emembe eading abou S e e hacking i . I' e go he 12-469 & 70 bu ned in my b ain. E e y ime I'm nea aRadio Shack, I s op in o see i hey ha e an olde 470. I willce ainly y ou he 20-125. I had ac ually been se iously hinking abou ge ing a Mini Box, bu ha 's a he y p ice ag. Especially since I ha e no expe ience wi hbox esea ch a his poin . Je emy--- In EVP-ITC@yahoog oups.com, juli elazquez ...>w o e:>> Je emy: IF you a e unable o ind an old 470 and you don ca e o he clicking on he 69, why don' you y he 20-125? Thishas he in e nal speake and you can hack ha as well. I belie eS e e has di ec ions on his si e, keypo pa ano mal.com.> > Good luck!> > Juli> > ecuyle > w o e:> I jus ead on he Pa ano mal Sys ems websi e ha heya e de eloping> a new box called he MaxiBox. I has a lo o ea u es I' e hea d> B uce men ion ha would be bene icial o he boxes. > > Hell, I' e been ying my bes o loca e an olde 12-470 o modi y so> I could s a doing he esea ch. I know he e is he 12-469, bu > I' e been hesi an because o all he alk abou he annoying click. > > Je emy> > > > > > > The con en s o his ele onic co espondence is p i a e &con iden ial and mean only o he pa y and/o pa ies i isadd essed o. > > No pa o his email ansmission may be publicly pos ed o o wa ded o o he pa ies wi hou explici w i en pe mission.>"}