{"id": "6382", "subject": "Re: [EVP-ITC] Re: New file uploaded to EVP-ITC", "author": "Lisby", "timestamp": "2008-01-28T03:45:08Z", "full_text": "Nothing has been cut at all, Steve. The first take is exactly as it  \ncame over the radio--no amplification, no nothing. The repeat is  \nexactly the same except slowed. Nothing is missing from in between  \nthe words.\n\nI&#39;ve been questioning how my minibox is working myself. It seems to  \nbe behaving differently from other people&#39;s. Some of this may be that  \nI live in the Baltimore-Washington broadcasting area and we have  \nliterally a hundred radio stations. Trying to get a sweep where it  \nisn&#39;t almost constant fragments is impossible. Mike, Lisa, et al may  \nbe sending things through to me differently than others. I don&#39;t  \nknow. But when I slow what I get by about 50 percent to listen on  \nplayback, this is what starts coming up--not swearing and all, mind  \nyou, but a lot of words coming with each pulse of broadcast that make  \nsense when put together--too much sense to be random. At least that  \nis how I am seeing it.\n\nThe other clip I posted, &quot;We&#39;re in heaven,&quot; I only found because I  \nwas trying to identify a nearby word and when I slowed it down to a  \nliteral crawl, &quot;We&#39;re in heaven&quot; is what I found--waay too clear to  \nbe random, again.\n\nTomorrow I will run a sample of the kind of raw sound I get when I  \nturn my box on.\n\nBelieve me, I&#39;m confused about the speed, too. It isn&#39;t what I was  \nexpected to happen with the mini. But it sure is wild stuff.\n\nI don&#39;t think the voices sound evil. I think they are just people.  \nThey don&#39;t do anything to disrupt my life, which is very pleasant and  \nhappy. Ever since I&#39;ve lived here, however, I&#39;ve been aware that  \nthere is at least one male entity in the cemetery across the street.  \nI call him the Grumpy Old Man. I can&#39;t get him to leave, but I have  \nmade a kind if deal with him to let each other go unmolested ;) This  \nmay be him. I just don&#39;t know. I know I am going to go looking for  \nAndrews or Stus over there tomorrow, however.\n\nAnn\n\n\nOn Jan 27, 2008, at 8:28 PM, Steve Hultay wrote:\n\n&gt;\n&gt; That&#39;s actually really creepy, and that&#39;s coming from someone who\n&gt; lives in a haunted location. The voice just sounds evil, why does\n&gt; your minibox sound nothing like mine? Aren&#39;t they like cookie cutter\n&gt; designed to all work the same. I don&#39;t hear the radio sweeps with\n&gt; yours, unless you cut that out in the editing process.\n&gt;\n&gt; -Steve H.\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, EVP-ITC@yahoogroups.com wrote:\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Hello,\n&gt; &gt;\n&gt; &gt; This email message is a notification to let you know that\n&gt; &gt; a file has been uploaded to the Files area of the EVP-ITC\n&gt; &gt; group.\n&gt; &gt;\n&gt; &gt; File : /Ann&#39;s files/Estepperfectnoasshole012608.mp3\n&gt; &gt; Uploaded by : lisbyfarrum &lt;lisby@...&gt;\n&gt; &gt; Description : &quot;Estep.&quot; I say, &quot;Yes?&quot; Under me is &quot;Andrew,&quot;\n&gt; then &quot;It&#39;s Stu.&quot; &quot;Perfect.&quot; &quot;No...???...asshole. Fucking scared.&quot;\n&gt; &gt;\n&gt; &gt; You can access this file at the URL:\n&gt; &gt; http://groups.yahoo.com/group/EVP-ITC/files/Ann%27s%\n&gt; 20files/Estepperfectnoasshole012608.mp3\n&gt; &gt;\n&gt; &gt; To learn more about file sharing for your group, please visit:\n&gt; &gt;\n&gt; http://help.yahoo.com/l/us/yahoo/groups/original/members/web/index.htm\n&gt; lfiles\n&gt; &gt;\n&gt; &gt; Regards,\n&gt; &gt;\n&gt; &gt; lisbyfarrum &lt;lisby@...&gt;\n&gt; &gt;\n&gt;\n&gt;\n&gt; \n\n\nNo hing has been cu a all, S e e. The i s ake is exac ly as i came o e he adio--no ampli ica ion, no no hing. The epea is exac ly he same excep slowed. No hing is missing om in be ween he wo ds.I' e been ques ioning how my minibox is wo king mysel . I seems o be beha ing di e en ly om o he people's. Some o his may be ha I li e in he Bal imo e-Washing on b oadcas ing a ea and we ha e li e ally a hund ed adio s a ions. T ying o ge a sweep whe e i isn' almos cons an agmen s is impossible. Mike, Lisa, e al may be sending hings h ough o me di e en ly han o he s. I don' know. Bu when I slow wha I ge by abou 50 pe cen o lis en on playback, his is wha s a s coming up--no swea ing and all, mind you, bu a lo o wo ds coming wi h each pulse o b oadcas ha make sense when pu oge he -- oo much sense o be andom. A leas ha is how I am seeing i .The o he clip I pos ed, \"We' e in hea en,\" I only ound because I was ying o iden i y a nea by wo d and when I slowed i down o a li e al c awl, \"We' e in hea en\" is wha I ound--waay oo clea o be andom, again.Tomo ow I will un a sample o he kind o aw sound I ge when I u n my box on.Belie e me, I'm con used abou he speed, oo. I isn' wha I was expec ed o happen wi h he mini. Bu i su e is wild s u .I don' hink he oices sound e il. I hink hey a e jus people. They don' do any hing o dis up my li e, which is e y pleasan and happy. E e since I' e li ed he e, howe e , I' e been awa e ha he e is a leas one male en i y in he ceme e y ac oss he s ee . I call him he G umpy Old Man. I can' ge him o lea e, bu I ha e made a kind i deal wi h him o le each o he go unmoles ed ;) This may be him. I jus don' know. I know I am going o go looking o And ews o S us o e he e omo ow, howe e .AnnOn Jan 27, 2008, a 8:28 PM, S e e Hul ay w o e:Tha 's ac ually eally c eepy, and ha 's coming om someone who li es in a haun ed loca ion. The oice jus sounds e il, why does you minibox sound no hing like mine? A en' hey like cookie cu e  designed o all wo k he same. I don' hea he adio sweeps wi h you s, unless you cu ha ou in he edi ing p ocess.-S e e H.--- In EVP-ITC@yahoog oups.com, EVP-ITC@yahoog oups.com w o e:>> > Hello,> > This email message is a no i ica ion o le you know ha > a ile has been uploaded o he Files a ea o he EVP-ITC > g oup.> > File : /Ann's iles/Es eppe ec noasshole012608.mp3 > Uploaded by : lisby a um  > Desc ip ion : \"Es ep.\" I say, \"Yes?\" Unde me is \"And ew,\"  hen \"I 's S u.\" \"Pe ec .\" \"No...???...asshole. Fucking sca ed.\" > > You can access his ile a he URL:> h p://g oups.yahoo.com/g oup/EVP-ITC/ iles/Ann%27s%20 iles/Es eppe ec noasshole012608.mp3 > > To lea n mo e abou ile sha ing o you g oup, please isi :> h p://help.yahoo.com/l/us/yahoo/g oups/o iginal/membe s/web/index.h ml iles> > Rega ds,> > lisby a um >"}