{"id": "6385", "subject": "Re: [EVP-ITC] File posted. Weird one.", "author": "Lisby", "timestamp": "2008-01-28T12:57:15Z", "full_text": "They might. From what I have heard of other people&#39;s cemetery EVPs,  \nit sounds like a lot of cemeteries are populated with people who  \nhaven&#39;t made it over. I find cemetery EVP to be the most fascinating  \nbecause they seem to offer a glimpse into a chaotic and not-so-pretty  \npart of the After Life that very few are willing to look at. Our  \ncemeteries seem to me to truly be cities of the dead.\n\nAnn\n\nOn Jan 28, 2008, at 4:07 AM, Robin Searcy Henson wrote:\n\n&gt;\n&gt; I hear it all!  I&#39;m envious of your location and all the activity  \n&gt; you&#39;re picking up.  Do you think some of these souls need help  \n&gt; crossing over?\n&gt;\n&gt; Robin\n&gt;\n&gt;\n&gt; ----- Original Message -----\n&gt; From: lisbyfarrum\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Sunday, January 27, 2008 5:19 PM\n&gt; Subject: [EVP-ITC] File posted. Weird one.\n&gt;\n&gt; Gimme some opinions on this one, gang. The first part of the clip is\n&gt; the speed it can through at. The repeat is slowed by about 70 percent.\n&gt; I hear it as &quot;Estep.&quot; I thought I had heard the word yes, so I ask,\n&gt; &quot;Yes?&quot; Under my voice is the name &quot;Andrew,&quot; then &quot;I&#39;m Stu.&quot; &quot;Perfect.&quot;\n&gt; &quot;No..??...asshole...fucking scared.&quot;\n&gt;\n&gt; Do you hear this as I do? I&#39;m postulating right now that because I\n&gt; live immediately across the street from a cemetery, and in a\n&gt; 100-year-old sitting atop a 200+-year-old foundation and cellar, that\n&gt; perhaps local dead folk who haven&#39;t crossed are popping in during\n&gt; sessions. The voice that said &quot;fucking scared&quot; I swear I heard in\n&gt; another file in my folder saying &quot;scared people.&quot;\n&gt;\n&gt; Ann\n&gt;\n&gt;\n&gt;\n&gt; \n\n\nThey migh . F om wha I ha e hea d o o he people's ceme e y EVPs, i sounds like a lo o ceme e ies a e popula ed wi h people who ha en' made i o e . I ind ceme e y EVP o be he mos ascina ing because hey seem o o e a glimpse in o a chao ic and no -so-p e y pa o he A e Li e ha e y ew a e willing o look a . Ou ceme e ies seem o me o uly be ci ies o he dead.AnnOn Jan 28, 2008, a 4:07 AM, Robin Sea cy Henson w o e:I hea i all!  I'm en ious o you loca ion and all he ac i i y you' e picking up.  Do you hink some o hese souls need help c ossing o e ? Robin  ----- O iginal Message -----F om: lisby a umTo: EVP-ITC@yahoog oups.comSen : Sunday, Janua y 27, 2008 5:19 PMSubjec : [EVP-ITC] File pos ed. Wei d one.Gimme some opinions on his one, gang. The i s pa o he clip is he speed i can h ough a . The epea is slowed by abou 70 pe cen .I hea i as \"Es ep.\" I hough I had hea d he wo d yes, so I ask,\"Yes?\" Unde my oice is he name \"And ew,\" hen \"I'm S u.\" \"Pe ec .\"\"No..??...asshole... ucking sca ed.\"Do you hea his as I do? I'm pos ula ing igh now ha because Ili e immedia ely ac oss he s ee om a ceme e y, and in a100-yea -old si ing a op a 200+-yea -old ounda ion and cella , ha pe haps local dead olk who ha en' c ossed a e popping in du ingsessions. The oice ha said \" ucking sca ed\" I swea I hea d inano he ile in my olde saying \"sca ed people.\"Ann"}