{"id": "6392", "subject": "Re: [EVP-ITC] Re: File posted. Weird one.", "author": "Lisby", "timestamp": "2008-01-28T13:32:27Z", "full_text": "I hope not, Rosemary! Sarah would have washed their mouth out with  \nsoap. ;)\n\nAnn\n\nOn Jan 28, 2008, at 7:59 AM, rosemary_guiley wrote:\n\n&gt; Hi Ann,\n&gt;\n&gt; Could be &quot;Estep,&quot; rest is not clear to me. Sounds like a male voice,\n&gt; maybe someone talking about Sarah?\n&gt;\n&gt; Rosemary\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, &quot;lisbyfarrum&quot; &lt;lisby@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Gimme some opinions on this one, gang. The first part of the clip is\n&gt; &gt; the speed it can through at. The repeat is slowed by about 70  \n&gt; percent.\n&gt; &gt; I hear it as &quot;Estep.&quot; I thought I had heard the word yes, so I ask,\n&gt; &gt; &quot;Yes?&quot; Under my voice is the name &quot;Andrew,&quot; then &quot;I&#39;m Stu.&quot;  \n&gt; &quot;Perfect.&quot;\n&gt; &gt; &quot;No..??...asshole...fucking scared.&quot;\n&gt; &gt;\n&gt; &gt; Do you hear this as I do? I&#39;m postulating right now that because I\n&gt; &gt; live immediately across the street from a cemetery, and in a\n&gt; &gt; 100-year-old sitting atop a 200+-year-old foundation and cellar,  \n&gt; that\n&gt; &gt; perhaps local dead folk who haven&#39;t crossed are popping in during\n&gt; &gt; sessions. The voice that said &quot;fucking scared&quot; I swear I heard in\n&gt; &gt; another file in my folder saying &quot;scared people.&quot;\n&gt; &gt;\n&gt; &gt; Ann\n&gt; &gt;\n&gt;\n&gt;\n&gt; \n\n\nI hope no , Rosema y! Sa ah would ha e washed hei mou h ou wi h soap. ;)AnnOn Jan 28, 2008, a 7:59 AM, osema y_guiley w o e:Hi Ann,Could be \"Es ep,\" es is no clea o me. Sounds like a male oice,maybe someone alking abou Sa ah?Rosema y--- In EVP-ITC@yahoog oups.com, \"lisby a um\" w o e:>> Gimme some opinions on his one, gang. The i s pa o he clip is> he speed i can h ough a . The epea is slowed by abou 70 pe cen .> I hea i as \"Es ep.\" I hough I had hea d he wo d yes, so I ask,> \"Yes?\" Unde my oice is he name \"And ew,\" hen \"I'm S u.\" \"Pe ec .\"> \"No..??...asshole... ucking sca ed.\"> > Do you hea his as I do? I'm pos ula ing igh now ha because I> li e immedia ely ac oss he s ee om a ceme e y, and in a> 100-yea -old si ing a op a 200+-yea -old ounda ion and cella , ha > pe haps local dead olk who ha en' c ossed a e popping in du ing> sessions. The oice ha said \" ucking sca ed\" I swea I hea d in> ano he ile in my olde saying \"sca ed people.\"> > Ann>"}