{"id": "6403", "subject": "Re: [EVP-ITC] New file uploaded to EVP-ITC", "author": "Lisby", "timestamp": "2008-01-28T17:38:04Z", "full_text": "I thought it might have said that, too, but when I listen to it with  \nthe noise-canceling headphones in the TwistedWave program, and even  \nnow, I&#39;m still hearing &quot;We&#39;re in heaven.&quot; I guess we have to go with  \nthe possibility that it&#39;s either. But it is still there, and you hear  \nit. Phew.\n\nYour theory is quite possible. I&#39;ve been getting both Seven and  \nHeaven. Both are welcome! I guess we&#39;ll see how it all plays out.  \nGod, this is fascinating.\n\nAnn\n\nOn Jan 28, 2008, at 10:51 AM, bruce halliday wrote:\n\n&gt; Hi Ann,\n&gt; I reviewed your file and this is what I heard on the first run.\n&gt;\n&gt; &quot;we&#39;re seven&quot;\n&gt;\n&gt; The fact that you had to slow the recording\n&gt; by 80% brings up a few questions. I have been looking into 7\n&gt; as it pertains to ITC-EVP communication and what I find I believe\n&gt; I have already mentioned. Is when the amazing communication of the  \n&gt; 80&#39;s and 90&#39;s was taking\n&gt; place in Luxembourg and with researchers like mark Macy and that  \n&gt; era of communication.\n&gt;\n&gt; The 7 represented themselves as angelic beings from a much higher  \n&gt; spiritual level than we are used to\n&gt; communicating with.\n&gt; My guess is that they have begun to communicate with us and are  \n&gt; trying to evaluate the workings of\n&gt; our present day technology. I believe they led you to slowing the  \n&gt; recording so as to discover the message hidden within.\n&gt; It could be the message was buried in the recording to test our  \n&gt; ability and ambition to look and listen further.\n&gt; Or the communication they send from a higher plane of spirituality  \n&gt; utilizes certain radio frequencies\n&gt; that need to be listened to in a certain way.\n&gt;\n&gt; In any event I&#39;m sure they will continue to become more apparent  \n&gt; and make themselves more known to us when they are ready.\n&gt; I am not suggesting you slow all your recordings to that extent and  \n&gt; sift through them with a fine tooth comb, that would take a ridiculous\n&gt; amount of time and effort. When they need you to hear a message or  \n&gt; receive a communication , they will make sure you do.\n&gt; Just like this time.\n&gt;\n&gt; This is just a theory I have but that is what I heard immediately  \n&gt; when I played the file.\n&gt;\n&gt; Bruce\n&gt;\n&gt;\n&gt;\n&gt; Bruce Halliday\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; From: EVP-ITC@yahoogroups.com\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Mon, 28 Jan 2008 01:58:23 +0000\n&gt; Subject: [EVP-ITC] New file uploaded to EVP-ITC\n&gt;\n&gt;\n&gt; Hello,\n&gt;\n&gt; This email message is a notification to let you know that\n&gt; a file has been uploaded to the Files area of the EVP-ITC\n&gt; group.\n&gt;\n&gt; File : /Ann&#39;s files/wereinheaven012608.mp3\n&gt; Uploaded by : lisbyfarrum &lt;lisby@...&gt;\n&gt; Description : And not one minute from all the swearing, I get this:  \n&gt; &quot;We&#39;re in heaven.&quot; This file is slowed by more than 80 percent. You  \n&gt; can&#39;t even hear it at regular speed. Amazing.\n&gt;\n&gt; You can access this file at the URL:\n&gt; http://groups.yahoo.com/group/EVP-ITC/files/Ann%27s%20files/ \n&gt; wereinheaven012608.mp3\n&gt;\n&gt; To learn more about file sharing for your group, please visit:\n&gt; http://help.yahoo.com/l/us/yahoo/groups/original/members/web/ \n&gt; index.htmlfiles\n&gt;\n&gt; Regards,\n&gt;\n&gt; lisbyfarrum &lt;lisby@...&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Climb to the top of the charts! Play the word scramble challenge  \n&gt; with star power. Play now!\n&gt;\n&gt; \n\n\nI hough i migh ha e said ha , oo, bu when I lis en o i wi h he noise-canceling headphones in he Twis edWa e p og am, and e en now, I'm s ill hea ing \"We' e in hea en.\" I guess we ha e o go wi h he possibili y ha i 's ei he . Bu i is s ill he e, and you hea i . Phew.You heo y is qui e possible. I' e been ge ing bo h Se en and Hea en. Bo h a e welcome! I guess we'll see how i all plays ou . God, his is ascina ing.AnnOn Jan 28, 2008, a 10:51 AM, b uce halliday w o e:Hi Ann,I e iewed you ile and his is wha I hea d on he i s un. \"we' e se en\"  The ac ha you had o slow he eco ding by 80% b ings up a ew ques ions. I ha e been looking in o 7as i pe ains o ITC-EVP communica ion and wha I ind I belie eI ha e al eady men ioned. Is when he amazing communica ion o he 80's and 90's was akingplace in Luxembou g and wi h esea che s like ma k Macy and ha e a o communica ion. The 7 ep esen ed hemsel es as angelic beings om a much highe spi i ual le el han we a e used ocommunica ing wi h.My guess is ha hey ha e begun o communica e wi h us and a e ying o e alua e he wo kings o ou p esen day echnology. I belie e hey led you o slowing he eco ding so as o disco e he message hidden wi hin.I could be he message was bu ied in he eco ding o es ou abili y and ambi ion o look and lis en u he .O he communica ion hey send om a highe plane o spi i uali y u ilizes ce ain adio equencies  ha need o be lis ened o in a ce ain way. In any e en I'm su e hey will con inue o become mo e appa en and make hemsel es mo e known o us when hey a e eady.I am no sugges ing you slow all you eco dings o ha ex en and si h ough hem wi h a ine oo h comb, ha would ake a idiculousamoun o ime and e o . When hey need you o hea a message o ecei e a communica ion , hey will make su e you do.Jus like his ime. This is jus a heo y I ha e bu ha is wha I hea d immedia ely when I played he ile. B uceB uce Halliday F om: EVP-ITC@yahoog oups.comTo: EVP-ITC@yahoog oups.comDa e: Mon, 28 Jan 2008 01:58:23 +0000Subjec : [EVP-ITC] New ile uploaded o EVP-ITCHello,This email message is a no i ica ion o le you know ha a ile has been uploaded o he Files a ea o he EVP-ITC g oup.File : /Ann's iles/we einhea en012608.mp3 Uploaded by : lisby a um lisby@ea hlink.ne > Desc ip ion : And no one minu e om all he swea ing, I ge his: \"We' e in hea en.\" This ile is slowed by mo e han 80 pe cen . You can' e en hea i a egula speed. Amazing. You can access his ile a he URL:h p://g oups.yahoo.com/g oup/EVP-ITC/ iles/Ann%27s%20 iles/we einhea en012608.mp3 To lea n mo e abou ile sha ing o you g oup, please isi :h p://help.yahoo.com/l/us/yahoo/g oups/o iginal/membe s/web/index.h ml ilesRega ds,lisby a um lisby@ea hlink.ne >Climb o he op o he cha s! Play he wo d sc amble challenge wi h s a powe . Play now!"}