{"id": "6443", "subject": "Re: [EVP-ITC] File just posted--Ben? Steven?", "author": "Lisby", "timestamp": "2008-01-29T01:27:23Z", "full_text": "I think we are all drawing from the same pool. I just don&#39;t know how  \nto explain these same names coming up again and again.\n\nAnn\nScratching my head.\n\n\nOn Jan 28, 2008, at 7:59 PM, juli velazquez wrote:\n\n&gt;\n&gt; Ann,   My tec is David who has a British Accent.  Joel&#39;s tec is  \n&gt; Steven.  I hope this helps!\n&gt;\n&gt; Juli\n&gt;\n&gt; lisbyfarrum &lt;lisby@...&gt; wrote:\n&gt; Did someone not just say they were told their technician was Ben? And\n&gt; did someone not say their technician is Steven? Sometimes I feel like\n&gt; I&#39;m losing it.\n&gt;\n&gt; I ask if my technician&#39;s name is David (which is also the name of\n&gt; someone else&#39;s guide), which is info I got from Bruce. I hear,\n&gt; &quot;Steven.&quot; followed by, &quot;It isn&#39;t.&quot; The I get the names &quot;Nicholson\n&gt; Lawson,&quot; something I can&#39;t understand, and then &quot;Ben Wilson.&quot;\n&gt; Nicholson is interesting to me because it is a family name. I&#39;m not\n&gt; sure if Nicholson Lawson is one name or it is a Nicholson and a\n&gt; Lawson. For some reason, I got the feeling the name Ben Wilson was a\n&gt; complete name.\n&gt;\n&gt; Thoughts?\n&gt;\n&gt; Ann\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; The contents of this eletronic correspondence is private &  \n&gt; confidential and meant only for the party and/or parties it is  \n&gt; addressed to.\n&gt;\n&gt; No part of this email transmission may be publicly posted or  \n&gt; forwarded to other parties without explicit written permission.\n&gt;\n&gt; \n\n\nI hink we a e all d awing om he same pool. I jus don' know how o explain hese same names coming up again and again. AnnSc a ching my head.On Jan 28, 2008, a 7:59 PM, juli elazquez w o e:Ann,   My ec is Da id who has a B i ish Accen .  Joel's ec is S e en.  I hope his helps! Julilisby a um ne > w o e:Did someone no jus say hey we e old hei echnician was Ben? Anddid someone no say hei echnician is S e en? Some imes I eel likeI'm losing i .I ask i my echnician's name is Da id (which is also he name o someone else's guide), which is in o I go om B uce. I hea ,\"S e en.\" ollowed by, \"I isn' .\" The I ge he names \"NicholsonLawson,\" some hing I can' unde s and, and hen \"Ben Wilson.\"Nicholson is in e es ing o me because i is a amily name. I'm no su e i Nicholson Lawson is one name o i is a Nicholson and aLawson. Fo some eason, I go he eeling he name Ben Wilson was acomple e name.Though s?AnnThe con en s o his ele onic co espondence is p i a e & con iden ial and mean only o he pa y and/o pa ies i is add essed o.  No pa o his email ansmission may be publicly pos ed o o wa ded o o he pa ies wi hou explici w i en pe mission."}