{"id": "6448", "subject": "Re: [EVP-ITC] Just A Little Spoiled", "author": "Lisby", "timestamp": "2008-01-29T09:45:55Z", "full_text": "Very interested. And I agree with you about the overnight change.  \nOrgs like AA-EVP that aren&#39;t dealing with the boxes are missing the  \nboat.\n\nAnn\n\nOn Jan 28, 2008, at 8:48 PM, Jules wrote:\n\n&gt; Well guys, I have to tell you that since I started box sessions in\n&gt; November I have become so spoiled that conventional EVP just don&#39;t do\n&gt; it for me.\n&gt;\n&gt; My organization was asked to come and do an investigation at a very\n&gt; historial place (here in Illinois). The owner of this home asked if I\n&gt; would bring one of the boxes to the home (he is amazed with the\n&gt; immediately 2 way communication). So upon respectfully asking my tec\n&gt; if it was alright to do a session outside the my home we did several\n&gt; box sessions along with conventional EVP. We wanted to see if we could\n&gt; discover some unanswered history about the residence, and the  \n&gt; otherside\n&gt; was more than willing to comply.\n&gt;\n&gt; I have to tell you that the regular EVP recordings were and are the\n&gt; most boring data to review. Something I use to love so much has\n&gt; actually turned into a project given I am waiting for a response\n&gt; immediately! Too funny how things can change overnight!\n&gt;\n&gt; I will be uploading some files for these sessions if you are  \n&gt; interested.\n&gt;\n&gt; Juli\n&gt;\n&gt;\n&gt; \n\n\nVe y in e es ed. And I ag ee wi h you abou he o e nigh change. O gs like AA-EVP ha a en' dealing wi h he boxes a e missing he boa .AnnOn Jan 28, 2008, a 8:48 PM, Jules w o e:Well guys, I ha e o ell you ha since I s a ed box sessions in No embe I ha e become so spoiled ha con en ional EVP jus don' do i o me. My o ganiza ion was asked o come and do an in es iga ion a a e y his o ial place (he e in Illinois). The owne o his home asked i I would b ing one o he boxes o he home (he is amazed wi h he immedia ely 2 way communica ion). So upon espec ully asking my ec i i was al igh o do a session ou side he my home we did se e al box sessions along wi h con en ional EVP. We wan ed o see i we could disco e some unanswe ed his o y abou he esidence, and he o he side was mo e han willing o comply. I ha e o ell you ha he egula EVP eco dings we e and a e he mos bo ing da a o e iew. Some hing I use o lo e so much has ac ually u ned in o a p ojec gi en I am wai ing o a esponse immedia ely! Too unny how hings can change o e nigh !I will be uploading some iles o hese sessions i you a e in e es ed.Juli"}