{"id": "6449", "subject": "Re: [EVP-ITC] File posted. Weird one.", "author": "Lisby", "timestamp": "2008-01-29T09:50:51Z", "full_text": "Until I really made a survey of cemetery EVPs--listening to every  \nexample I could find--I assumed that we were all met by loved ones or  \nhigher beings or whatever, but it does seem as if a lot of people  \nhave no personal guardian who takes them across--whatever that means.  \nEspecially kids. One would think there would be legions of angels or  \nsomething for them. But...\n\nI dunno. It&#39;s one of those things about the After Life that I don&#39;t  \nunderstand. And the very imperfection of the situation makes me think  \nit is true.\n\nAnn\n\nOn Jan 28, 2008, at 10:51 PM, Robin Searcy Henson wrote:\n\n&gt;\n&gt; That really is a sad thought, especially regarding kids.  What can  \n&gt; we do?  I can&#39;t stand thinking of them being lost.  I joke  \n&gt; sometimes about not knowing where to go when I die, but it&#39;s  \n&gt; actually an intense fear of mine because my sense of direction is  \n&gt; so terrible!\n&gt;\n&gt; Robin\n&gt;\n&gt;\n&gt; ----- Original Message -----\n&gt; From: Lisby\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Monday, January 28, 2008 5:35 PM\n&gt; Subject: Re: [EVP-ITC] File posted. Weird one.\n&gt;\n&gt; Wow. But good to know that Hannah went on. I have to wonder if  \n&gt; people follow their bodies to the graveyard and then don&#39;t know  \n&gt; what the hell to do next. Especially kids. Examples of kid EVP in  \n&gt; grave yards is so plentiful that it&#39;s heartbreaking. Maybe they get  \n&gt; there and others who are already hanging out there tell them its  \n&gt; where they should stay, because they seem to have some kind of  \n&gt; social life going on there, too.\n&gt;\n&gt;\n&gt; One example that blew me away starts with a taper asking when  \n&gt; anyone died. A male voice replies with a full date, something like,  \n&gt; &quot;September 5, 1952,&quot; then a long pause, &quot;Do you think they heard us?&quot;\n&gt;\n&gt; Ann\n&gt;\n&gt; On Jan 28, 2008, at 8:26 PM, Robin Searcy Henson wrote:\n&gt;\n&gt;&gt;\n&gt;&gt; I always wonder what spirits are doing hanging around cemeteries  \n&gt;&gt; anyway.  You&#39;d think they would gravitate somewhere more  \n&gt;&gt; meaningful than where their body was deposited, wouldn&#39;t you?  I  \n&gt;&gt; haven&#39;t had much luck picking up graveyard EVP personally, but I  \n&gt;&gt; do have one cool one.  I was standing at the door of a mausoleum  \n&gt;&gt; where a former governor and his wife are entombed, and I called  \n&gt;&gt; the wife&#39;s name out loud while recording.  The response is &quot;Hannah  \n&gt;&gt; isn&#39;t here!&quot;\n&gt;&gt;\n&gt;&gt; Robin\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; ----- Original Message -----\n&gt;&gt; From: Lisby\n&gt;&gt; To: EVP-ITC@yahoogroups.com\n&gt;&gt; Sent: Monday, January 28, 2008 4:57 AM\n&gt;&gt; Subject: Re: [EVP-ITC] File posted. Weird one.\n&gt;&gt;\n&gt;&gt; They might. From what I have heard of other people&#39;s cemetery  \n&gt;&gt; EVPs, it sounds like a lot of cemeteries are populated with people  \n&gt;&gt; who haven&#39;t made it over. I find cemetery EVP to be the most  \n&gt;&gt; fascinating because they seem to offer a glimpse into a chaotic  \n&gt;&gt; and not-so-pretty part of the After Life that very few are willing  \n&gt;&gt; to look at. Our cemeteries seem to me to truly be cities of the dead.\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; Ann\n&gt;&gt;\n&gt;&gt; On Jan 28, 2008, at 4:07 AM, Robin Searcy Henson wrote:\n&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt; I hear it all!  I&#39;m envious of your location and all the activity  \n&gt;&gt;&gt; you&#39;re picking up.  Do you think some of these souls need help  \n&gt;&gt;&gt; crossing over?\n&gt;&gt;&gt;\n&gt;&gt;&gt; Robin\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt; ----- Original Message -----\n&gt;&gt;&gt; From: lisbyfarrum\n&gt;&gt;&gt; To: EVP-ITC@yahoogroups.com\n&gt;&gt;&gt; Sent: Sunday, January 27, 2008 5:19 PM\n&gt;&gt;&gt; Subject: [EVP-ITC] File posted. Weird one.\n&gt;&gt;&gt;\n&gt;&gt;&gt; Gimme some opinions on this one, gang. The first part of the clip is\n&gt;&gt;&gt; the speed it can through at. The repeat is slowed by about 70  \n&gt;&gt;&gt; percent.\n&gt;&gt;&gt; I hear it as &quot;Estep.&quot; I thought I had heard the word yes, so I ask,\n&gt;&gt;&gt; &quot;Yes?&quot; Under my voice is the name &quot;Andrew,&quot; then &quot;I&#39;m Stu.&quot;  \n&gt;&gt;&gt; &quot;Perfect.&quot;\n&gt;&gt;&gt; &quot;No..??...asshole...fucking scared.&quot;\n&gt;&gt;&gt;\n&gt;&gt;&gt; Do you hear this as I do? I&#39;m postulating right now that because I\n&gt;&gt;&gt; live immediately across the street from a cemetery, and in a\n&gt;&gt;&gt; 100-year-old sitting atop a 200+-year-old foundation and cellar,  \n&gt;&gt;&gt; that\n&gt;&gt;&gt; perhaps local dead folk who haven&#39;t crossed are popping in during\n&gt;&gt;&gt; sessions. The voice that said &quot;fucking scared&quot; I swear I heard in\n&gt;&gt;&gt; another file in my folder saying &quot;scared people.&quot;\n&gt;&gt;&gt;\n&gt;&gt;&gt; Ann\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;\n&gt;\n&gt;\n&gt; \n\n\nUn il I eally made a su ey o ceme e y EVPs--lis ening o e e y example I could ind--I assumed ha we we e all me by lo ed ones o highe beings o wha e e , bu i does seem as i a lo o people ha e no pe sonal gua dian who akes hem ac oss--wha e e ha means. Especially kids. One would hink he e would be legions o angels o some hing o hem. Bu ...I dunno. I 's one o hose hings abou he A e Li e ha I don' unde s and. And he e y impe ec ion o he si ua ion makes me hink i is ue.AnnOn Jan 28, 2008, a 10:51 PM, Robin Sea cy Henson w o e:Tha eally is a sad hough , especially ega ding kids.  Wha can we do?  I can' s and hinking o hem being los .  I joke some imes abou no knowing whe e o go when I die, bu i 's ac ually an in ense ea o mine because my sense o di ec ion is so e ible! Robin  ----- O iginal Message -----F om: LisbyTo: EVP-ITC@yahoog oups.comSen : Monday, Janua y 28, 2008 5:35 PMSubjec : Re: [EVP-ITC] File pos ed. Wei d one.Wow. Bu good o know ha Hannah wen on. I ha e o wonde i people ollow hei bodies o he g a eya d and hen don' know wha he hell o do nex . Especially kids. Examples o kid EVP in g a e ya ds is so plen i ul ha i 's hea b eaking. Maybe hey ge he e and o he s who a e al eady hanging ou he e ell hem i s whe e hey should s ay, because hey seem o ha e some kind o social li e going on he e, oo.One example ha blew me away s a s wi h a ape asking when anyone died. A male oice eplies wi h a ull da e, some hing like, \"Sep embe 5, 1952,\" hen a long pause, \"Do you hink hey hea d us?\"AnnOn Jan 28, 2008, a 8:26 PM, Robin Sea cy Henson w o e:I always wonde wha spi i s a e doing hanging a ound ceme e ies anyway.  You'd hink hey would g a i a e somewhe e mo e meaning ul han whe e hei body was deposi ed, wouldn' you?  I ha en' had much luck picking up g a eya d EVP pe sonally, bu I do ha e one cool one.  I was s anding a he doo o a mausoleum whe e a o me go e no and his wi e a e en ombed, and I called he wi e's name ou loud while eco ding.  The esponse is \"Hannah isn' he e!\"  Robin  ----- O iginal Message -----F om: LisbyTo: EVP-ITC@yahoog oups.comSen : Monday, Janua y 28, 2008 4:57 AMSubjec : Re: [EVP-ITC] File pos ed. Wei d one.They migh . F om wha I ha e hea d o o he people's ceme e y EVPs, i sounds like a lo o ceme e ies a e popula ed wi h people who ha en' made i o e . I ind ceme e y EVP o be he mos ascina ing because hey seem o o e a glimpse in o a chao ic and no -so-p e y pa o he A e Li e ha e y ew a e willing o look a . Ou ceme e ies seem o me o uly be ci ies o he dead.AnnOn Jan 28, 2008, a 4:07 AM, Robin Sea cy Henson w o e:I hea i all!  I'm en ious o you loca ion and all he ac i i y you' e picking up.  Do you hink some o hese souls need help c ossing o e ? Robin  ----- O iginal Message -----F om: lisby a umTo: EVP-ITC@yahoog oups.comSen : Sunday, Janua y 27, 2008 5:19 PMSubjec : [EVP-ITC] File pos ed. Wei d one.Gimme some opinions on his one, gang. The i s pa o he clip is he speed i can h ough a . The epea is slowed by abou 70 pe cen .I hea i as \"Es ep.\" I hough I had hea d he wo d yes, so I ask,\"Yes?\" Unde my oice is he name \"And ew,\" hen \"I'm S u.\" \"Pe ec .\"\"No..??...asshole... ucking sca ed.\"Do you hea his as I do? I'm pos ula ing igh now ha because Ili e immedia ely ac oss he s ee om a ceme e y, and in a100-yea -old si ing a op a 200+-yea -old ounda ion and cella , ha pe haps local dead olk who ha en' c ossed a e popping in du ingsessions. The oice ha said \" ucking sca ed\" I swea I hea d inano he ile in my olde saying \"sca ed people.\"Ann"}