{"id": "6452", "subject": "Re: EVP", "author": "LC Duplatt", "timestamp": "2008-01-29T11:32:23Z", "full_text": "EVP:\n\nNot that this is always the case, but EVP seems to primarily capture \nlost people - ghosts being recorded, versus the box having the \nability to capture primarily what seems to be higher communication \nfrom spirits, (and less of the lower communication - ghosts jumping \nin).\n\nThat to me is a huge difference... ;)\n\nLC\nhttp://www.AngelsGhosts.com\n\n--- In EVP-ITC@yahoogroups.com, &quot;ecuyler&quot; &lt;ecuyler@...&gt; wrote:\n&gt;\n&gt; I agree about the difference also.  All that review time makes for a\n&gt; very tedious few hours.  By the end of it you&#39;re ready to pull your\n&gt; hair out.  I&#39;ve only done two sessions now and have gotten more\n&gt; positive results in 20 minutes time as I have in 10 years of EVP \nresearch.\n&gt; \n&gt; Jeremy\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Lisby &lt;lisby@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Very interested. And I agree with you about the overnight \nchange.  \n&gt; &gt; Orgs like AA-EVP that aren&#39;t dealing with the boxes are missing \nthe  \n&gt; &gt; boat.\n&gt; &gt; \n&gt; &gt; Ann\n&gt; &gt; \n&gt; &gt; On Jan 28, 2008, at 8:48 PM, Jules wrote:\n&gt; &gt; \n&gt; &gt; &gt; Well guys, I have to tell you that since I started box sessions \nin\n&gt; &gt; &gt; November I have become so spoiled that conventional EVP just \ndon&#39;t do\n&gt; &gt; &gt; it for me.\n&gt; &gt; &gt;\n&gt; &gt; &gt; My organization was asked to come and do an investigation at a \nvery\n&gt; &gt; &gt; historial place (here in Illinois). The owner of this home \nasked if I\n&gt; &gt; &gt; would bring one of the boxes to the home (he is amazed with the\n&gt; &gt; &gt; immediately 2 way communication). So upon respectfully asking \nmy tec\n&gt; &gt; &gt; if it was alright to do a session outside the my home we did \nseveral\n&gt; &gt; &gt; box sessions along with conventional EVP. We wanted to see if \nwe could\n&gt; &gt; &gt; discover some unanswered history about the residence, and the  \n&gt; &gt; &gt; otherside\n&gt; &gt; &gt; was more than willing to comply.\n&gt; &gt; &gt;\n&gt; &gt; &gt; I have to tell you that the regular EVP recordings were and are \nthe\n&gt; &gt; &gt; most boring data to review. Something I use to love so much has\n&gt; &gt; &gt; actually turned into a project given I am waiting for a response\n&gt; &gt; &gt; immediately! Too funny how things can change overnight!\n&gt; &gt; &gt;\n&gt; &gt; &gt; I will be uploading some files for these sessions if you are  \n&gt; &gt; &gt; interested.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Juli\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}