{"id": "6474", "subject": "Re: Just A Little Spoiled", "author": "lisbyfarrum", "timestamp": "2008-01-29T18:46:20Z", "full_text": "Thanks I got into the Wiki, but it doesn&#39;t seem to want to let me\ncreate an account to view the discussion.I&#39;ll see if I can wort that\nout, but meanwhile...\n\nHere&#39;s what I found on their Wiki on what they are calling\n&quot;Opportunistic EVP&quot;:\n\n&quot;This category of EVP is relatively new and much less understood as\ncompared to transform EVP. Opportunistic EVP devices usually have\nadditional electronic stages which are different than what is found in\nthe basic recorder technique using just an audio recorder and sound\nsource. It therefore has additional ways in which an EVP might be\nformed. There are many variations on the theme represented by radio\nsweep and EVPMaker.\n\nAs is illustrated in Figure 5, radio sweep involves rapidly scanning\navailable Amplitude Modulation (AM) radio stations to create a single\nstream of sound fragments. The sound fragments are then used as an\ninput to a recording device. In some applications, a speaker is also\nattached to the output of the sweep stage in an attempt to achieve\nreal-time communication. Although it is possible to simply turn the\ntuner on a radio with a recorder microphone nearby, there are a number\nof “boxes” designed by inventors, such as the MiniBox[5] and Frank’s\nBox.[6] From our observations, these are all variations of essentially\nthe same theme with different mechanizing techniques.\n\nThe software program, EVPMaker developed by Stefan Bion[7]is also\nopportunistic in that a single stream of conversation is chopped into\nsmall bits and then reassembled into a second stream of sound made by\nconcatenating bits based on a random number process. Bion’s research\nhas shown that message formation is caused by manipulation of the\nrandom number process.\n\nThese techniques are called “Opportunistic EVP” because it appears\nthat the EVP is formed by selecting available sound bits to form a\nword or sound that closely matches the intended utterance. This is\ndifferent from changing sound to match the required output.\n\nFigure 6 illustrates what is being referred to as Mistaken,\nOpportunistic EVP. As in transform EVP, mistaken EVP in radio sweep\nand EVPMaker result from the assigning of meaning where there is none\nintended. Because the resulting stream of sound bits does have voice,\nit is easy for the mind to assign meaning to word-like sounds, even\nthough none was intended or a second listener might hear something\nvery different. The meaning is not caused by a communicating entity,\nbut is from the tendency of the mind to find meaning in otherwise\nrandom sounds [4].\n\nFigure 7 illustrates how the analog stage might be used to induce a\ntransform EVP into a radio sweep or EVPMaker circuit. Transform EVP in\nthis circuit will tend to be interrupted by the sound bits from the\nradio sweep, causing an effect similar to an experimenter talking over\nan utterance in the basic recorder technique. EVPMaker is not as\nlikely to produce a transform EVP because all of the processing is in\nthe digital format and the output is usually the only analog stage.\n\nOpportunistic EVP Summary\n\nEVP may be formed in the sound stream resulting from the fragmentation\nof a mundane source, either pre-recorded conversation in EVPMaker or\nmultiple radio stations in radio sweep. The resulting sound stream\nmight also be mistaken as EVP when there is none, but transform EVP\nmight be formed in the device. In concept, all of the opportunistic\nEVP devices depend on the sound frequency, amplitude and inflection to\nbe present in the raw source at the time it is required for voice\nformation.&quot;\n\nAnn\n\n--- In EVP-ITC@yahoogroups.com, &quot; RetroCom&quot; &lt;vfp19968@...&gt; wrote:\n&gt;\n&gt; Try this one:\n&gt;\nhttp://etheric-studies.aaevp.com/best_practices_development/index.php?title=Locating_EVP_formation_and_detecting_false_positives\n&gt; \n&gt; --- lisby@... wrote:\n&gt; \n&gt; From: &quot;lisbyfarrum&quot; &lt;lisby@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Subject: [EVP-ITC] Re: Just A Little Spoiled\n&gt; Date: Tue, 29 Jan 2008 18:27:58 -0000\n&gt; \n&gt; I can&#39;t get the link to work at all in any way--tried copying,\n&gt; pasting, clicking, hand-typing, partial url, etc. Are you sure it is\n&gt; correct?\n&gt; \n&gt; Ann\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot; RetroCom&quot; &lt;vfp19968@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Actually, the forum there is pretty active.  I found the link I had\n&gt; mentioned. I&#39;m sure this will not be &#39;clickable&#39; because the link is\n&gt; too long for Yahoo posts like this one. You may have to cut and paste\n&gt; this into a browser. The title may come off sounding a bit negative,\n&gt; don&#39;t shoot the messanger :-).\n&gt; &gt;\n&gt;\nhttp://etheric-studies.aaevp.com/best_practices_development/index.phptitle=Locating_EVP_formation_and_detecting_false_positives\n&gt; &gt; \n&gt; &gt; Dave\n&gt; &gt; \n&gt; &gt; --- lisby@ wrote:\n&gt; &gt; \n&gt; &gt; From: &quot;lisbyfarrum&quot; &lt;lisby@&gt;\n&gt; &gt; To: EVP-ITC@yahoogroups.com\n&gt; &gt; Subject: [EVP-ITC] Re: Just A Little Spoiled\n&gt; &gt; Date: Tue, 29 Jan 2008 15:00:02 -0000\n&gt; &gt; \n&gt; &gt; Well, I&#39;m glad to hear it, but as of last week, the leaders were\n&gt; &gt; unreceptive to the idea that this phenomenon was real.\n&gt; &gt; \n&gt; &gt; Ann\n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot; RetroCom&quot; &lt;vfp19968@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; There is a radio sweep forum on AA-EVP for members. They have also\n&gt; &gt; created an Etheric studies wiki that mentions Frank&#39;s Box and the Mini\n&gt; &gt; Box. I&#39;ll see if I can find the link for this, it is accessable by the\n&gt; &gt; public.\n&gt; &gt; &gt; \n&gt; &gt; &gt; Dave\n&gt; &gt; &gt; \n&gt; &gt; &gt; --- lisby@ wrote:\n&gt; &gt; &gt; \n&gt; &gt; &gt; From: Lisby &lt;lisby@&gt;\n&gt; &gt; &gt; To: EVP-ITC@yahoogroups.com\n&gt; &gt; &gt; Subject: Re: [EVP-ITC] Just A Little Spoiled\n&gt; &gt; &gt; Date: Tue, 29 Jan 2008 04:45:55 -0500\n&gt; &gt; &gt; \n&gt; &gt; &gt; Very interested. And I agree with you about the overnight change.  \n&gt; &gt; &gt; Orgs like AA-EVP that aren&#39;t dealing with the boxes are missing\nthe  \n&gt; &gt; &gt; boat.\n&gt; &gt; &gt; \n&gt; &gt; &gt; Ann\n&gt; &gt; &gt; \n&gt; &gt; &gt; On Jan 28, 2008, at 8:48 PM, Jules wrote:\n&gt; &gt; &gt; \n&gt; &gt; &gt; &gt; Well guys, I have to tell you that since I started box sessions in\n&gt; &gt; &gt; &gt; November I have become so spoiled that conventional EVP just\n&gt; don&#39;t do\n&gt; &gt; &gt; &gt; it for me.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; My organization was asked to come and do an investigation at a\nvery\n&gt; &gt; &gt; &gt; historial place (here in Illinois). The owner of this home asked\n&gt; if I\n&gt; &gt; &gt; &gt; would bring one of the boxes to the home (he is amazed with the\n&gt; &gt; &gt; &gt; immediately 2 way communication). So upon respectfully asking\nmy tec\n&gt; &gt; &gt; &gt; if it was alright to do a session outside the my home we did\nseveral\n&gt; &gt; &gt; &gt; box sessions along with conventional EVP. We wanted to see if we\n&gt; could\n&gt; &gt; &gt; &gt; discover some unanswered history about the residence, and the  \n&gt; &gt; &gt; &gt; otherside\n&gt; &gt; &gt; &gt; was more than willing to comply.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; I have to tell you that the regular EVP recordings were and\nare the\n&gt; &gt; &gt; &gt; most boring data to review. Something I use to love so much has\n&gt; &gt; &gt; &gt; actually turned into a project given I am waiting for a response\n&gt; &gt; &gt; &gt; immediately! Too funny how things can change overnight!\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; I will be uploading some files for these sessions if you are  \n&gt; &gt; &gt; &gt; interested.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Juli\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}