{"id": "6484", "subject": "Re: second request  Fwd: Re: [EVP-ITC] Re: Need help with a one word recording", "author": "Lisby", "timestamp": "2008-01-30T00:59:52Z", "full_text": "Ron--can you send it to me as an attachment? I&#39;mm try to work some  \nTwistedWave intel-gathering magic.\n\nAnn\n\nOn Jan 29, 2008, at 12:10 PM, Ron Lederer wrote:\n\n&gt; Sorry to bug you guys but I got zero reply to this email from a few  \n&gt; days ago.  I acknowleged that working on one word is a triffle but  \n&gt; at this early stage of my testing it would be really important to  \n&gt; me have someone else confirm...or not...what I think I hear.  This  \n&gt; one word recording is also found in my files.   Thanks   Ron L\n&gt; Note: forwarded message attached.\n&gt;\n&gt;\n&gt; Be a better friend, newshound, and know-it-all with Yahoo! Mobile.  \n&gt; Try it now.\n&gt;\n&gt; \n&gt;\n&gt; From: Ron Lederer &lt;ronriko@...&gt;\n&gt; Date: January 28, 2008 9:27:06 AM EST\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Subject: Re: [EVP-ITC] Re: Need help with a one word recording\n&gt;\n&gt;\n&gt; Chuck   It is now posted in my file as &quot;one word&quot;   Ron L\n&gt;\n&gt; LC Duplatt &lt;lcdupla@...&gt; wrote:\n&gt; Ron,\n&gt;\n&gt; I wish you had a folder with your files (and this one uploaded into\n&gt; it, too), as I do not get the e-mails due to there being too many of\n&gt; them. Thus, I cannot hear your recording.\n&gt;\n&gt; Sorry...\n&gt;\n&gt; LC\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, Ron Lederer &lt;ronriko@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; I recorded this with a RS 469 patched direct into by handheld\n&gt; recorder. I hear a two sylable word over the background noise.\n&gt; Hoping I can get some help from the group to define the word or\n&gt; words. Thanks Ron L\n&gt; &gt;\n&gt; &gt; ---------------------------------\n&gt; &gt; Looking for last minute shopping deals? Find them fast with Yahoo!\n&gt; Search.\n&gt; &gt;\n&gt;\n&gt;\n&gt;\n&gt; Never miss a thing. Make Yahoo your homepage.\n\n\nRon--can you send i o me as an a achmen ? I'mm y o wo k some Twis edWa e in el-ga he ing magic.AnnOn Jan 29, 2008, a 12:10 PM, Ron Lede e w o e: So y o bug you guys bu I go ze o eply o his email om a ew days ago.  I acknowleged ha wo king on one wo d is a i le bu a his ea ly s age o my es ing i would be eally impo an o me ha e someone else con i m...o  no ...wha I hink I hea .  This one wo d  eco ding is also ound in my iles.   Thanks   Ron L  No e: o wa ded message a ached. Be a be e iend, newshound, and know-i -all wi h Yahoo! Mobile. T y i now. F om: Ron Lede e on iko@...>Da e: Janua y 28, 2008 9:27:06 AM ESTTo: EVP-ITC@yahoog oups.comSubjec : Re: [EVP-ITC] Re: Need help wi h a one wo d eco ding Chuck   I is now pos ed in my ile as \"one wo d\"   Ron LLC Dupla lcdupla@yahoo.com> w o e: Ron,I wish you had a olde wi h you iles (and his one uploaded in o i , oo), as I do no ge he e-mails due o he e being oo many o hem. Thus, I canno hea you eco ding.So y...LC--- In EVP-ITC@yahoog oups.com, Ron Lede e > w o e:>> I eco ded his wi h a RS 469 pa ched di ec in o by handheld eco de . I hea a wo sylable wo d o e he backg ound noise. Hoping I can ge some help om he g oup o de ine he wo d o wo ds. Thanks Ron L> > ---------------------------------> Looking o las minu e shopping deals? Find hem as wi h Yahoo! Sea ch.> Ne e miss a hing. Make Yahoo you homepage."}