{"id": "6502", "subject": "RE: [EVP-ITC] Re: New file uploaded to EVP-ITC", "author": "Zack Widup", "timestamp": "2008-01-30T13:48:39Z", "full_text": "During the day, there is a layer of the ionosphere, called the D layer, \nwhich is present due to direct exposure of the ionosphere by the sun.  It \nabsorbs medium-frequency radio signals (the AM band) and you can&#39;t hear \nstations much farther away than a couple hundred miles, as a rule. \nAt night the D layer breaks down and AM-band radio signals can reflect off \nthe higher F layer of the ionosphere, so you can hear stations hundreds \nand thousands of miles away in that band. The AM broadcast band becomes \nfilled with stations.\n\nThere are many small low-power AM stations on frequencies that have become \nreferred to as &quot;graveyard frequencies&quot; because there are hundreds of them \nacross the USA, spaced far enough apart that they don&#39;t interfere with \neach other in the day.  At night, many of them decrease their power or \njust go off the air. That way, they minimize interference with each other. \nListen on 1340 at night some time!\n\nLocal station WILL-AM here on 580 shares a frequency with a station in, I \nthink, Kansas.  They have a two-tower antenna array.  During the day they \ntransmit using only one tower with a pretty much omnidirectiional signal. \nAt night the two towers are energized in such a way as to produce a null \nin their pattern in the direction of Kansas, so they don&#39;t interfere with \nthe other station. When you see AM radio stations using multiple towers, \nit&#39;s usually so they can do beam-forming at night to avoid interference \nwith others.  When I was studying antenna engineering in college, we were \ngiven a homework assignment to figure out what the dual towers of WILL-AM \ndid.  :-)\n\nA few stations across the country on &quot;clear channels&quot; (there is only one \nlicensed station on that frequency) would increase their power to extend \ntheir range even further at night.  WLS radio in Chicago (890), WLW in \nCincinnati (700) and WJR in Detroit (800) were examples of this. I&#39;m not \nsure if they still do it.\n\nNighttime AM band propagation is subject to &quot;selective fading&quot;, where the \nsignals increase and decrease in strength. Sometimes they drop out \ncompletely for a minute or so.\n\nDuring the winter, when the nights are longer and static crashes from \nstorms are fewer, with a good receiver and antenna you can hear stations \nfrom Europe at night on the AM band.  I was able to hear a BBC broadcast a \ncouple weks ago.\n\nZack\n\n\nOn Tue, 29 Jan 2008, Ron Lederer wrote:\n\n&gt; I understand that sun interference would affect the day signal and a big factor is radio stations in the u.s. can boost their signal strength in later hours.  Might be urban legend.\n&gt;\n&gt; bruce halliday &lt;paranormalinvestigating@...&gt; wrote:           Jeremy,\n&gt;\n&gt; Quite a few researchers get better reception at night.\n&gt; I believe that is due to the fact that less signal traffic\n&gt; generally at night than during the day. consiquently that will\n&gt; allow for the weaker signals to be picked up.\n&gt;\n&gt; bruce\n&gt;\n&gt;\n&gt;  Bruce Halliday\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; ---------------------------------\n&gt;  To: EVP-ITC@yahoogroups.com\n&gt; From: ecuyler@...\n&gt; Date: Tue, 29 Jan 2008 20:21:51 +0000\n&gt; Subject: [EVP-ITC] Re: New file uploaded to EVP-ITC\n&gt;\n&gt;      Bruce, I will definitely ask about the name Tim and about a tech. The\n&gt; &quot;very bored&quot; part, at least if I&#39;m hearing it correctly, proceeds as\n&gt; soon and the name &quot;Tim&quot; is ending and is at a lot lower decibel level.\n&gt; Could be one of those things meant for me to hear, as in I was boring\n&gt; them. It&#39;s any body&#39;s guess.\n&gt;\n&gt; I got better reception as I did the session at around 8:45pm.\n&gt; Nighttime seems better for reception around here.\n&gt;\n&gt; Jeremy\n&gt;"}