{"id": "6506", "subject": "Re: EVP", "author": "LC Duplatt", "timestamp": "2008-01-30T14:37:17Z", "full_text": "Robin,\n\nI uploaded some of my recordings that indicate a bigger picture.\n\nSome of the messages say there are &quot;many spirits here,&quot; spirit rescue \nis &quot;very important,&quot; etc.  You can go through them under LC&#39;s folder.\n\nLast Friday, I recorded with respect to 2008, &quot;psychic event&quot; \nand &quot;universal shift.&quot;  That would indicate that there is a bigger \nthing going down, in my opinion.  However, I also acknowledge that \npeople here may have different callings/messages/uses other than what \nI am hearing.  I am going to just follow where the path before me \nleads and try to find my role in it.\n\nPersonally, I think this needs to be in many people&#39;s hands.  That&#39;s \nan interest of mine, too.  Not sure yet how it will happen, but the \nradio hacks are a nice start.  \n\nLC\n\n--- In EVP-ITC@yahoogroups.com, &quot;Robin Searcy Henson&quot; \n&lt;MudPuddleFarm@...&gt; wrote:\n&gt;\n&gt; I haven&#39;t started box recording yet.  My impression of the EVP I&#39;ve \ncaptured (which has been almost entirely obtained on the property I \nmoved to six years ago) is that someone is attached to this place.  \nThe first message was &quot;Here come some people,&quot; as I was hiking up the \nhill one day with my goats, then a kill-you threat in the house, \nthen &quot;get out of here&quot; in the barn.  I assumed it must be one of the \noriginal owners, and I still feel that it&#39;s mainly one spirit \ncommunicating that this is their home, not mine.  I&#39;ve gotten one \nuplifting message from what I believe to be the same entity, and this \nis also the last recording I&#39;ve gotten.  I asked what death is like, \ncompared to life: happy, beautiful, fulfilling--and specifically if \ndeath is less depressing.  The response was &quot;It&#39;s everything.&quot;  \nS/he/it basically stopped talking after that, and I stopped trying.  \nI know this sounds weird, but I miss whoever or whatever it was.  I \nwonder if some of us might be better at dealing with the low-life \nstuck or grounded entities rather than the highly evolved technicians \ncoming through the more sophisticated equipment.  I wonder where this \nis all going ultimately, other than to prove communication across the \nveil is possible.  I&#39;m not an engineer or technologist on this \nphysical plane, and I question what I have to offer this research \nsince I&#39;m so electronically challenged.  Meanwhile, the nurse side of \nme wants to heal and &quot;fix&quot; anyone needing help, even if they happen \nto be in the next world!  Do the guides and technicians ever \nacknowledge or make reference to the earthbound spirits, and if so, \nin what context?  Are we ever able to help unstick the stuck ones?  \nAre we supposed to ignore them?   \n&gt; \n&gt; Robin\n&gt; \n&gt; \n&gt;   ----- Original Message ----- \n&gt;   From: LC Duplatt&lt;mailto:lcdupla@...&gt; \n&gt;   To: EVP-ITC@yahoogroups.com&lt;mailto:EVP-ITC@yahoogroups.com&gt; \n&gt;   Sent: Tuesday, January 29, 2008 3:32 AM\n&gt;   Subject: [EVP-ITC] Re: EVP\n&gt; \n&gt; \n&gt;   EVP:\n&gt; \n&gt;   Not that this is always the case, but EVP seems to primarily \ncapture \n&gt;   lost people - ghosts being recorded, versus the box having the \n&gt;   ability to capture primarily what seems to be higher \ncommunication \n&gt;   from spirits, (and less of the lower communication - ghosts \njumping \n&gt;   in).\n&gt; \n&gt;   That to me is a huge difference... ;)\n&gt; \n&gt;   LC\n&gt;   http://www.AngelsGhosts.com&lt;http://www.angelsghosts.com/&gt;\n&gt; \n&gt;   --- In EVP-ITC@...m&lt;mailto:EVP-ITC%\n40yahoogroups.com&gt;, &quot;ecuyler&quot; &lt;ecuyler@&gt; wrote:\n&gt;   &gt;\n&gt;   &gt; I agree about the difference also. All that review time makes \nfor a\n&gt;   &gt; very tedious few hours. By the end of it you&#39;re ready to pull \nyour\n&gt;   &gt; hair out. I&#39;ve only done two sessions now and have gotten more\n&gt;   &gt; positive results in 20 minutes time as I have in 10 years of \nEVP \n&gt;   research.\n&gt;   &gt; \n&gt;   &gt; Jeremy\n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; \n&gt;   &gt; --- In EVP-ITC@yahoogroups.com&lt;mailto:EVP-ITC%\n40yahoogroups.com&gt;, Lisby &lt;lisby@&gt; wrote:\n&gt;   &gt; &gt;\n&gt;   &gt; &gt; Very interested. And I agree with you about the overnight \n&gt;   change. \n&gt;   &gt; &gt; Orgs like AA-EVP that aren&#39;t dealing with the boxes are \nmissing \n&gt;   the \n&gt;   &gt; &gt; boat.\n&gt;   &gt; &gt; \n&gt;   &gt; &gt; Ann\n&gt;   &gt; &gt; \n&gt;   &gt; &gt; On Jan 28, 2008, at 8:48 PM, Jules wrote:\n&gt;   &gt; &gt; \n&gt;   &gt; &gt; &gt; Well guys, I have to tell you that since I started box \nsessions \n&gt;   in\n&gt;   &gt; &gt; &gt; November I have become so spoiled that conventional EVP \njust \n&gt;   don&#39;t do\n&gt;   &gt; &gt; &gt; it for me.\n&gt;   &gt; &gt; &gt;\n&gt;   &gt; &gt; &gt; My organization was asked to come and do an investigation \nat a \n&gt;   very\n&gt;   &gt; &gt; &gt; historial place (here in Illinois). The owner of this home \n&gt;   asked if I\n&gt;   &gt; &gt; &gt; would bring one of the boxes to the home (he is amazed with \nthe\n&gt;   &gt; &gt; &gt; immediately 2 way communication). So upon respectfully \nasking \n&gt;   my tec\n&gt;   &gt; &gt; &gt; if it was alright to do a session outside the my home we \ndid \n&gt;   several\n&gt;   &gt; &gt; &gt; box sessions along with conventional EVP. We wanted to see \nif \n&gt;   we could\n&gt;   &gt; &gt; &gt; discover some unanswered history about the residence, and \nthe \n&gt;   &gt; &gt; &gt; otherside\n&gt;   &gt; &gt; &gt; was more than willing to comply.\n&gt;   &gt; &gt; &gt;\n&gt;   &gt; &gt; &gt; I have to tell you that the regular EVP recordings were and \nare \n&gt;   the\n&gt;   &gt; &gt; &gt; most boring data to review. Something I use to love so much \nhas\n&gt;   &gt; &gt; &gt; actually turned into a project given I am waiting for a \nresponse\n&gt;   &gt; &gt; &gt; immediately! Too funny how things can change overnight!\n&gt;   &gt; &gt; &gt;\n&gt;   &gt; &gt; &gt; I will be uploading some files for these sessions if you \nare \n&gt;   &gt; &gt; &gt; interested.\n&gt;   &gt; &gt; &gt;\n&gt;   &gt; &gt; &gt; Juli\n&gt;   &gt; &gt; &gt;\n&gt;   &gt; &gt; &gt;\n&gt;   &gt; &gt; &gt;\n&gt;   &gt; &gt;\n&gt;   &gt;\n&gt;"}