{"id": "6527", "subject": "New research subject proposal.", "author": "bhali333", "timestamp": "2008-01-30T21:40:51Z", "full_text": "I would like to propose a subject for some research sessions.\nIt involves Identical twins and the spiritual and mental connection \nthat they share.\n\nThe way identical twins are conceived is when the egg enters the womb \nfor some reason it splits into two separate eggs. The resulting two \nfetuses develop independently of each other, but carry the same \ngenetic\ncode and identical DNA. they are in essence clones of each other.\n\nsome cases of identical twins that where separated at birth for \nwhatever reason, and then have been reunited later in life find that \nthey have developed similar if not identical traits and habits, such \nas an interest in art or the same music or literature. They also \nshare common memory patterns that are impossible to develop other \nthan through some sort of telekinetic link. Being separated at birth \nthey could not have experienced any joint memories. There have even \nbeen cases where one twin will become gravelly ill pr have a serious \naccident and the other will to a certain extent feel the pain and \nsuffering of the other twin.\n\n\nThis raises a few questions that might be a good research subject for \nus to pursue.\n\nIs the relationship that we build with our technician/guides similar \nin content as the subconsious or spiritual bond between twins?\n\nWhen the egg separates in the womb do the individual twins share a \nsingle spirit or soul?\n\nDoes the soul get divided as well to serve both individuals in the \nphysical and then reunite as one entity after death.\n\nMost likely one twin will die before the other, when the second twin \npasses is the spirit of the second twin absorbed into the first and \nvice verse?\n\nDoes each twin receive it&#39;s own unique spirit and if so does the \nspiritual energy remain identical the same as the twins DNA and \nphysical characteristics?\n\nThese are just a few of the possibilities we could explore with this \nsubject.\n\nIf anyone is interested please contact me so we can discuss it.\n\nBruce"}