{"id": "6530", "subject": "Re: **Special Notice Regaurding Your Group Membership**", "author": "Steve Hultay", "timestamp": "2008-01-30T23:19:18Z", "full_text": "Yeah, i didn&#39;t mean to offend anyone with the suggestion of using \nMp3&#39;s.  I record in Mp3 format, so no conversion is necessary for \nme.  So, i&#39;m not familiar with the loss of audio content in the \nconversion process from wav to mp3&#39;s.  If you record in mp3 format to \nstart with is it still losing audio?  I&#39;m really not sure how it \nworks with wav files and mp3&#39;s other than the space is a lot more.  I \nthink most recorders have an option with what file type to record \nwith, i&#39;m going to do a recording later and see if i hear the \ndifference between the wav and mp3 for personal knowledge.  I may \nhave been missing audio all along.\n\n\nThanx,\n-Steve H.\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;Misty&quot; &lt;bulletbabea@...&gt; wrote:\n&gt;\n&gt; Yep I agree with a few files there is some loss in conversion. \nThats \n&gt; why I sent out that program because it has next to no loss in the \n&gt; conversion. But again I will say I would rather post 1 meg of files \n&gt; than take up the entire groups space by posting 15 megs of files. \n&gt; When I want to share more complete audio I just use my esnips.com \n&gt; account to do that. It is just as easy for people to click on my \n&gt; esnips hotlink in a notification post as it is to click on the \nfiles \n&gt; link to the left.\n&gt; \n&gt; You are right we just have to manage ourselves better.\n&gt; \n&gt; Misty\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, bruce halliday \n&gt; &lt;paranormalinvestigating@&gt; wrote:\n&gt; &gt;\n&gt; &gt; \n&gt; &gt; I post in wav. format I believe when you convert the file from \nwav \n&gt; to mp3.\n&gt; &gt; certain aspects of the file are lost. If an mp3. file is a tenth \nof \n&gt; the size of\n&gt; &gt; a wav. file where does the other 9/10&#39;s go.\n&gt; &gt;  \n&gt; &gt; If it is compressed then it definitely loses quality. \n&gt; &gt; I think every nuance in a box file is crucial for the \n&gt; &gt; correct interpretation of the file, sometimes the a word created \nby \n&gt; the entity is not only\n&gt; &gt; comprised of radio fragment but also static noise mixed with the \n&gt; fragments of radio vocal\n&gt; &gt; to form the message the entity wishes to leave. I don&#39;t know the \n&gt; technical aspects of the file \n&gt; &gt; change but I think it&#39;s common sense that when you try to pour a \n&gt; gallon of water into a shot glass\n&gt; &gt; all you wind up with is a shot glass full of water the rest is \n&gt; spilled and lost.\n&gt; &gt;  \n&gt; &gt; I keep my files posted for 5 or less days, just long enough for \n&gt; anyone that wants to listen can.\n&gt; &gt; If your going to leave your files posted indefinitely and keep \n&gt; adding to the folder then of course it will\n&gt; &gt; put pressure on the storage space.\n&gt; &gt;  \n&gt; &gt; As far as posting a notice for every file, some of us may wish to \n&gt; listen from their e-mail or not \n&gt; &gt; have to go to the file section to listen, That&#39;s probably why \nthat \n&gt; option is given.\n&gt; &gt; If I didn&#39;t like the notices cluttering up my e-mail in box you \ncan \n&gt; change that feature in the group\n&gt; &gt; membership options. So if anyone does not want that feature they \n&gt; can turn it off and only read posts on the group.\n&gt; &gt;  \n&gt; &gt; It&#39;s not the lack of space is the mismanagement of it by all of \nus. \n&gt; &gt; when I change my files from wav. to mp3 I hear a distinct \n&gt; difference, do it in an audio editor and you can visually see the \n&gt; difference.\n&gt; &gt;  \n&gt; &gt; Bruce\n&gt; &gt; Bruce Halliday \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; To: EVP-ITC@: warrior18eii@: Wed, 30 Jan 2008 05:05:37 -\n&gt; 0800Subject: Re: [EVP-ITC] Re: **Special Notice Regaurding Your \nGroup \n&gt; Membership**\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; That&#39;s a great idea Steve and it was mentioned before but either \nno \n&gt; one noticed Misty&#39;s post or it was ignored. It would be a shame \n&gt; though if people start loosing files because they are not paying \n&gt; attention to the owners instructions.Regards,Frank R.\n&gt; &gt; ----- Original Message ----From: Steve Hultay &lt;urkel23@&gt;To: EVP-\n&gt; ITC@: Wednesday, January 30, 2008 6:06:23 AMSubject: [EVP-ITC] Re: \n&gt; **Special Notice Regaurding Your Group Membership**\n&gt; &gt; \n&gt; &gt; Misty,I have and idea. One solution is to post Mp3 files instead \nof \n&gt; Wav. files or any other format. It seems like the Mp3&#39;s sound the \n&gt; same and are only 1/10th of the size. I think that would probably \n&gt; clear up 90 percent of the board right there. If i actually have \nmore \n&gt; than a couple files from here on out, i will be attaching them to \nan \n&gt; e-mail and not the board to save space here. And also, if people do \n&gt; post files maybe we can all just have one post that says we have \n&gt; uploaded files to our folder instead of 30 audio announcements in a \n&gt; row that just seems to waste a lot of e-mail space in the \nindividual \n&gt; e-mails. And it also pushes the current topic on the board to \nanother \n&gt; page and is lost for those who wanted to share. Just my thoughts on \n&gt; helping the subject. I know we are all excited, but misty is right. \nI \n&gt; went to add a file the other day and the group was at 93 percent \n&gt; capacity, so it won&#39;t be long before we run out of space.-Steve H.--\n- \n&gt; In EVP-ITC@yahoogroups .com, &quot;Misty&quot; &lt;bulletbabea@ ...&gt; wrote:&gt;&gt; \nJust \n&gt; a little friendly reminder that you all need to organize your &gt; \nfiles \n&gt; better in the files area. Space is limited here and you are all &gt; \n&gt; nearing the 100% mark so try to keep your section under 5 megs. If \n&gt; \n&gt; you need more space use www.esnips.com and you can store 50 gigs to \n&gt; \n&gt; share with the group or public.&gt; &gt; I think it is great you guys \nhave \n&gt; so much to share I just wish that &gt; our yahoo group wasnt so \nlimited \n&gt; on space (and that I wasnt so &gt; limited on time). But I have found \na \n&gt; way around it. If just a few &gt; people signed up and shared using \n&gt; esnips they can invite others to &gt; visit thier files and once they \ndo \n&gt; they also get 50 gigs of free &gt; space for audio pictures or video \nor \n&gt; whatever you want to post.&gt; &gt; I was considering setting up \n&gt; one &quot;group&quot; account to start with and &gt; inviting all members who \npost \n&gt; files to join it and be able to post to &gt; the account. It will \n&gt; automatically notify everyone thats a member &gt; when a file is added \n&gt; to it just like the yahoo group does. It also &gt; allows you to share \n&gt; with the public or privately if you so choose. &gt; You can even allow \n&gt; your friends to post to your account if you wish.&gt; &gt; This group has \n&gt; grown and expanded and we just need to make a few &gt; changes to how \nwe \n&gt; do things to keep it running more smoothly for the &gt; future. I am \n&gt; hoping that you all will help me in this endeavor. I &gt; know many of \n&gt; you have already adapted the idea to help us organize &gt; and \nmaintain \n&gt; the group.&gt; &gt; I want you to keep sharing and to be able to share \n&gt; more! &gt; &gt; So please organize and not post stray files that are \n&gt; targets for &gt; deletion once the que is 100% full. And for your own \n&gt; sake, if no one &gt; elses, be respectful to each other.&gt; &gt; MD&gt;\n&gt; &gt; \n&gt; &gt; Be a better friend, newshound, and know-it-all with Yahoo! \nMobile. \n&gt; Try it now. \n&gt; &gt;  \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; _________________________________________________________________\n&gt; &gt; Helping your favorite cause is as easy as instant messaging.You \n&gt; IM, we give.\n&gt; &gt; http://im.live.com/Messenger/IM/Home/?source=text_hotmail_join\n&gt; &gt;\n&gt;"}