{"id": "6532", "subject": "Re: [EVP-ITC] Re: **Special Notice Regaurding Your Group Membership**", "author": "Lisby", "timestamp": "2008-01-30T23:25:32Z", "full_text": "I&#39;m being a good girl and posting mp3s. I&#39;ve gone and deleted some  \nfiles well. If you need more to delete more, let me know!\n\n:)\nAnn\n\nOn Jan 30, 2008, at 11:25 AM, Misty Dawn wrote:\n\n&gt;\n&gt; Yep Steve you are right. I have even tried emailing a few people  \n&gt; programs to easily convert them to no avail. Some people just want  \n&gt; to ignore what is being said but soon they will have no choice but  \n&gt; to listen.\n&gt;\n&gt; Misty\n&gt;\n&gt; Steve Hultay &lt;urkel23@...&gt; wrote:\n&gt; Misty,\n&gt;\n&gt; I have and idea. One solution is to post Mp3 files instead of Wav.\n&gt; files or any other format. It seems like the Mp3&#39;s sound the same\n&gt; and are only 1/10th of the size. I think that would probably clear\n&gt; up 90 percent of the board right there. If i actually have more than\n&gt; a couple files from here on out, i will be attaching them to an e-\n&gt; mail and not the board to save space here. And also, if people do\n&gt; post files maybe we can all just have one post that says we have\n&gt; uploaded files to our folder instead of 30 audio announcements in a\n&gt; row that just seems to waste a lot of e-mail space in the individual\n&gt; e-mails. And it also pushes the current topic on the board to\n&gt; another page and is lost for those who wanted to share. Just my\n&gt; thoughts on helping the subject. I know we are all excited, but\n&gt; misty is right. I went to add a file the other day and the group was\n&gt; at 93 percent capacity, so it won&#39;t be long before we run out of\n&gt; space.\n&gt;\n&gt; -Steve H.\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Misty&quot; &lt;bulletbabea@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Just a little friendly reminder that you all need to organize your\n&gt; &gt; files better in the files area. Space is limited here and you are\n&gt; all\n&gt; &gt; nearing the 100% mark so try to keep your section under 5 megs. If\n&gt; &gt; you need more space use www.esnips.com and you can store 50 gigs to\n&gt; &gt; share with the group or public.\n&gt; &gt;\n&gt; &gt; I think it is great you guys have so much to share I just wish that\n&gt; &gt; our yahoo group wasnt so limited on space (and that I wasnt so\n&gt; &gt; limited on time). But I have found a way around it. If just a few\n&gt; &gt; people signed up and shared using esnips they can invite others to\n&gt; &gt; visit thier files and once they do they also get 50 gigs of free\n&gt; &gt; space for audio pictures or video or whatever you want to post.\n&gt; &gt;\n&gt; &gt; I was considering setting up one &quot;group&quot; account to start with and\n&gt; &gt; inviting all members who post files to join it and be able to post\n&gt; to\n&gt; &gt; the account. It will automatically notify everyone thats a member\n&gt; &gt; when a file is added to it just like the yahoo group does. It also\n&gt; &gt; allows you to share with the public or privately if you so choose.\n&gt; &gt; You can even allow your friends to post to your account if you wish.\n&gt; &gt;\n&gt; &gt; This group has grown and expanded and we just need to make a few\n&gt; &gt; changes to how we do things to keep it running more smoothly for\n&gt; the\n&gt; &gt; future. I am hoping that you all will help me in this endeavor. I\n&gt; &gt; know many of you have already adapted the idea to help us organize\n&gt; &gt; and maintain the group.\n&gt; &gt;\n&gt; &gt; I want you to keep sharing and to be able to share more!\n&gt; &gt;\n&gt; &gt; So please organize and not post stray files that are targets for\n&gt; &gt; deletion once the que is 100% full. And for your own sake, if no\n&gt; one\n&gt; &gt; elses, be respectful to each other.\n&gt; &gt;\n&gt; &gt; MD\n&gt; &gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Be a better friend, newshound, and know-it-all with Yahoo! Mobile.  \n&gt; Try it now.\n&gt;\n&gt; \n\n\nI'm being a good gi l and pos ing mp3s. I' e gone and dele ed some iles well. I you need mo e o dele e mo e, le me know!:)AnnOn Jan 30, 2008, a 11:25 AM, Mis y Dawn w o e:Yep S e e you a e igh . I ha e e en ied emailing a ew people p og ams o easily con e hem o no a ail. Some people jus wan o igno e wha is being said bu soon hey will ha e no choice bu o lis en. Mis yS e e Hul ay com> w o e:Mis y,I ha e and idea. One solu ion is o pos Mp3 iles ins ead o Wa .  iles o any o he o ma . I seems like he Mp3's sound he same and a e only 1/10 h o he size. I hink ha would p obably clea  up 90 pe cen o he boa d igh he e. I i ac ually ha e mo e han a couple iles om he e on ou , i will be a aching hem o an e-mail and no he boa d o sa e space he e. And also, i people do pos iles maybe we can all jus ha e one pos ha says we ha e uploaded iles o ou olde ins ead o 30 audio announcemen s in a  ow ha jus seems o was e a lo o e-mail space in he indi idual e-mails. And i also pushes he cu en opic on he boa d o ano he page and is los o hose who wan ed o sha e. Jus my  hough s on helping he subjec . I know we a e all exci ed, bu  mis y is igh . I wen o add a ile he o he day and he g oup was a 93 pe cen capaci y, so i won' be long be o e we un ou o  space.-S e e H.--- In EVP-ITC@yahoog oups.com, \"Mis y\" ...> w o e:>> Jus a li le iendly eminde ha you all need o o ganize you  > iles be e in he iles a ea. Space is limi ed he e and you a e all > nea ing he 100% ma k so y o keep you sec ion unde 5 megs. I  > you need mo e space use www.esnips.com and you can s o e 50 gigs o > sha e wi h he g oup o public.> > I hink i is g ea you guys ha e so much o sha e I jus wish ha  > ou yahoo g oup wasn so limi ed on space (and ha I wasn so > limi ed on ime). Bu I ha e ound a way a ound i . I jus a ew > people signed up and sha ed using esnips hey can in i e o he s o > isi hie iles and once hey do hey also ge 50 gigs o ee > space o audio pic u es o ideo o wha e e you wan o pos .> > I was conside ing se ing up one \"g oup\" accoun o s a wi h and > in i ing all membe s who pos iles o join i and be able o pos   o > he accoun . I will au oma ically no i y e e yone ha s a membe  > when a ile is added o i jus like he yahoo g oup does. I also > allows you o sha e wi h he public o p i a ely i you so choose. > You can e en allow you iends o pos o you accoun i you wish.> > This g oup has g own and expanded and we jus need o make a ew > changes o how we do hings o keep i unning mo e smoo hly o   he > u u e. I am hoping ha you all will help me in his endea o . I > know many o you ha e al eady adap ed he idea o help us o ganize > and main ain he g oup.> > I wan you o keep sha ing and o be able o sha e mo e! > > So please o ganize and no pos s ay iles ha a e a ge s o  > dele ion once he que is 100% ull. And o you own sake, i no one > elses, be espec ul o each o he .> > MD> Be a be e iend, newshound, and know-i -all wi h Yahoo! Mobile. T y i now."}