{"id": "6538", "subject": "Re: **Special Notice Regaurding Your Group Membership**", "author": "Laura Kimberley", "timestamp": "2008-01-30T23:42:40Z", "full_text": "ATTENTION****\n\nBruce Just put your link in a message to all and they can go there&gt;&gt;&gt;\nto Esnips and see your folder and leave comments and such!!\nYou can even posts videos and pics and be sure to make your folders \nPUBLIC for all to see. Got that?\n\nLaura\n\n--- In EVP-ITC@yahoogroups.com, bruce halliday \n&lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; \n&gt; Misty,\n&gt; I opened an esnips account what do you do to get the files to the \ngroup?\n&gt;  \n&gt; bruce\n&gt; Bruce Halliday \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: bulletbabea@...: Wed, 30 Jan 2008 10:06:21 -\n0800Subject: RE: [EVP-ITC] Re: **Special Notice Regaurding Your Group \nMembership**\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Thanks Bruce. My wish is that we had unlimited posting/filing \nspace. But til then we will have to make do with what we have. Try \nthe esnips thing out several of us are already over there forming our \nlil community for file sharing. With 50 gigs you can pretty much post \nin whatever format you like which is what we do. Some files are just \ntoo large to post here or too many of them to post all at once so we \njust use that instead.\n&gt;  \n&gt; Plus its easy to link up with others so that they get notifications \nyou have uploaded a new file. I think for now its a great way to \nexpand our group and possibly even reach more people who havent \njoined here or even heard of the things we do. It also keeps a hit \ncount for how many people visit your folders so you can see what \npeople are listening to. And it allows comments so that visitors can \ngive feedback if they wish.\n&gt;  \n&gt; Mistybruce halliday &lt;paranormalinvestigating@...&gt; wrote:\n&gt; \n&gt; \n&gt; Misty, Your wish is my command. I will convert to mp3from now on. \nbruce\n&gt; Bruce Halliday \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: bulletbabea@...: Wed, 30 Jan 2008 17:13:53 \n+0000Subject: [EVP-ITC] Re: **Special Notice Regaurding Your Group \nMembership**\n&gt; \n&gt; \n&gt; Yep I agree with a few files there is some loss in conversion. \nThats why I sent out that program because it has next to no loss in \nthe conversion. But again I will say I would rather post 1 meg of \nfiles than take up the entire groups space by posting 15 megs of \nfiles. When I want to share more complete audio I just use my \nesnips.com account to do that. It is just as easy for people to click \non my esnips hotlink in a notification post as it is to click on the \nfiles link to the left.You are right we just have to manage ourselves \nbetter.Misty--- In EVP-ITC@yahoogroups.com, bruce halliday \n&lt;paranormalinvestigating@&gt; wrote:&gt;&gt; &gt; I post in wav. format I believe \nwhen you convert the file from wav to mp3.&gt; certain aspects of the \nfile are lost. If an mp3. file is a tenth of the size of&gt; a wav. file \nwhere does the other 9/10&#39;s go.&gt; &gt; If it is compressed then it \ndefinitely loses quality. &gt; I think every nuance in a box file is \ncrucial for the &gt; correct interpretation of the file, sometimes the a \nword created by the entity is not only&gt; comprised of radio fragment \nbut also static noise mixed with the fragments of radio vocal&gt; to \nform the message the entity wishes to leave. I don&#39;t know the \ntechnical aspects of the file &gt; change but I think it&#39;s common sense \nthat when you try to pour a gallon of water into a shot glass&gt; all \nyou wind up with is a shot glass full of water the rest is spilled \nand lost.&gt; &gt; I keep my files posted for 5 or less days, just long \nenough for anyone that wants to listen can.&gt; If your going to leave \nyour files posted indefinitely and keep adding to the folder then of \ncourse it will&gt; put pressure on the storage space.&gt; &gt; As far as \nposting a notice for every file, some of us may wish to listen from \ntheir e-mail or not &gt; have to go to the file section to listen, \nThat&#39;s probably why that option is given.&gt; If I didn&#39;t like the \nnotices cluttering up my e-mail in box you can change that feature in \nthe group&gt; membership options. So if anyone does not want that \nfeature they can turn it off and only read posts on the group.&gt; &gt; \nIt&#39;s not the lack of space is the mismanagement of it by all of us. &gt; \nwhen I change my files from wav. to mp3 I hear a distinct difference, \ndo it in an audio editor and you can visually see the difference.&gt; &gt; \nBruce&gt; Bruce Halliday &gt; &gt; &gt; To: EVP-ITC@: warrior18eii@: Wed, 30 Jan \n2008 05:05:37 -0800Subject: Re: [EVP-ITC] Re: **Special Notice \nRegaurding Your Group Membership**&gt; &gt; &gt; &gt; &gt; &gt; &gt; That&#39;s a great idea \nSteve and it was mentioned before but either no one noticed Misty&#39;s \npost or it was ignored. It would be a shame though if people start \nloosing files because they are not paying attention to the owners \ninstructions.Regards,Frank R.&gt; ----- Original Message ----From: Steve \nHultay &lt;urkel23@&gt;To: EVP-ITC@: Wednesday, January 30, 2008 6:06:23 \nAMSubject: [EVP-ITC] Re: **Special Notice Regaurding Your Group \nMembership**&gt; &gt; Misty,I have and idea. One solution is to post Mp3 \nfiles instead of Wav. files or any other format. It seems like the \nMp3&#39;s sound the same and are only 1/10th of the size. I think that \nwould probably clear up 90 percent of the board right there. If i \nactually have more than a couple files from here on out, i will be \nattaching them to an e-mail and not the board to save space here. And \nalso, if people do post files maybe we can all just have one post \nthat says we have uploaded files to our folder instead of 30 audio \nannouncements in a row that just seems to waste a lot of e-mail space \nin the individual e-mails. And it also pushes the current topic on \nthe board to another page and is lost for those who wanted to share. \nJust my thoughts on helping the subject. I know we are all excited, \nbut misty is right. I went to add a file the other day and the group \nwas at 93 percent capacity, so it won&#39;t be long before we run out of \nspace.-Steve H.--- In EVP-ITC@yahoogroups .com, &quot;Misty&quot; \n&lt;bulletbabea@ ...&gt; wrote:&gt;&gt; Just a little friendly reminder that you \nall need to organize your &gt; files better in the files area. Space is \nlimited here and you are all &gt; nearing the 100% mark so try to keep \nyour section under 5 megs. If &gt; you need more space use \nwww.esnips.com and you can store 50 gigs to &gt; share with the group or \npublic.&gt; &gt; I think it is great you guys have so much to share I just \nwish that &gt; our yahoo group wasnt so limited on space (and that I \nwasnt so &gt; limited on time). But I have found a way around it. If \njust a few &gt; people signed up and shared using esnips they can invite \nothers to &gt; visit thier files and once they do they also get 50 gigs \nof free &gt; space for audio pictures or video or whatever you want to \npost.&gt; &gt; I was considering setting up one &quot;group&quot; account to start \nwith and &gt; inviting all members who post files to join it and be able \nto post to &gt; the account. It will automatically notify everyone thats \na member &gt; when a file is added to it just like the yahoo group does. \nIt also &gt; allows you to share with the public or privately if you so \nchoose. &gt; You can even allow your friends to post to your account if \nyou wish.&gt; &gt; This group has grown and expanded and we just need to \nmake a few &gt; changes to how we do things to keep it running more \nsmoothly for the &gt; future. I am hoping that you all will help me in \nthis endeavor. I &gt; know many of you have already adapted the idea to \nhelp us organize &gt; and maintain the group.&gt; &gt; I want you to keep \nsharing and to be able to share more! &gt; &gt; So please organize and not \npost stray files that are targets for &gt; deletion once the que is 100% \nfull. And for your own sake, if no one &gt; elses, be respectful to each \nother.&gt; &gt; MD&gt;&gt; &gt; Be a better friend, newshound, and know-it-all with \nYahoo! Mobile. Try it now. &gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; \n__________________________________________________________&gt; Helping \nyour favorite cause is as easy as instant messaging. You IM, we \ngive.&gt; http://im.live.com/Messenger/IM/Home/?source=text_hotmail_join&gt;\n&gt; \n&gt; Helping your favorite cause is as easy as instant messaging. You \nIM, we give. Learn more. \n&gt; \n&gt;  \n&gt; \n&gt; \n&gt; Looking for last minute shopping deals? Find them fast with Yahoo! \nSearch. \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Need to know the score, the latest news, or you need your Hotmail-\nget your &quot;fix&quot;.\n&gt; http://www.msnmobilefix.com/Default.aspx\n&gt;"}