{"id": "6562", "subject": "Re: **Special Notice Regaurding Your Group Membership**", "author": "misujoey", "timestamp": "2008-01-31T16:51:46Z", "full_text": "Hi Ann,  not sure if this is the right post to reply .. I heard \nyour &quot;Ben Wilson&quot;  .. It was really clear to me ..  :)\n\nDebbie\n\n--- In EVP-ITC@yahoogroups.com, Lisby &lt;lisby@...&gt; wrote:\n&gt;\n&gt; I&#39;m being a good girl and posting mp3s. I&#39;ve gone and deleted some  \n&gt; files well. If you need more to delete more, let me know!\n&gt; \n&gt; :)\n&gt; Ann\n&gt; \n&gt; On Jan 30, 2008, at 11:25 AM, Misty Dawn wrote:\n&gt; \n&gt; &gt;\n&gt; &gt; Yep Steve you are right. I have even tried emailing a few people  \n&gt; &gt; programs to easily convert them to no avail. Some people just \nwant  \n&gt; &gt; to ignore what is being said but soon they will have no choice \nbut  \n&gt; &gt; to listen.\n&gt; &gt;\n&gt; &gt; Misty\n&gt; &gt;\n&gt; &gt; Steve Hultay &lt;urkel23@...&gt; wrote:\n&gt; &gt; Misty,\n&gt; &gt;\n&gt; &gt; I have and idea. One solution is to post Mp3 files instead of Wav.\n&gt; &gt; files or any other format. It seems like the Mp3&#39;s sound the same\n&gt; &gt; and are only 1/10th of the size. I think that would probably clear\n&gt; &gt; up 90 percent of the board right there. If i actually have more \nthan\n&gt; &gt; a couple files from here on out, i will be attaching them to an e-\n&gt; &gt; mail and not the board to save space here. And also, if people do\n&gt; &gt; post files maybe we can all just have one post that says we have\n&gt; &gt; uploaded files to our folder instead of 30 audio announcements in \na\n&gt; &gt; row that just seems to waste a lot of e-mail space in the \nindividual\n&gt; &gt; e-mails. And it also pushes the current topic on the board to\n&gt; &gt; another page and is lost for those who wanted to share. Just my\n&gt; &gt; thoughts on helping the subject. I know we are all excited, but\n&gt; &gt; misty is right. I went to add a file the other day and the group \nwas\n&gt; &gt; at 93 percent capacity, so it won&#39;t be long before we run out of\n&gt; &gt; space.\n&gt; &gt;\n&gt; &gt; -Steve H.\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;Misty&quot; &lt;bulletbabea@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; Just a little friendly reminder that you all need to organize \nyour\n&gt; &gt; &gt; files better in the files area. Space is limited here and you \nare\n&gt; &gt; all\n&gt; &gt; &gt; nearing the 100% mark so try to keep your section under 5 megs. \nIf\n&gt; &gt; &gt; you need more space use www.esnips.com and you can store 50 \ngigs to\n&gt; &gt; &gt; share with the group or public.\n&gt; &gt; &gt;\n&gt; &gt; &gt; I think it is great you guys have so much to share I just wish \nthat\n&gt; &gt; &gt; our yahoo group wasnt so limited on space (and that I wasnt so\n&gt; &gt; &gt; limited on time). But I have found a way around it. If just a \nfew\n&gt; &gt; &gt; people signed up and shared using esnips they can invite others \nto\n&gt; &gt; &gt; visit thier files and once they do they also get 50 gigs of free\n&gt; &gt; &gt; space for audio pictures or video or whatever you want to post.\n&gt; &gt; &gt;\n&gt; &gt; &gt; I was considering setting up one &quot;group&quot; account to start with \nand\n&gt; &gt; &gt; inviting all members who post files to join it and be able to \npost\n&gt; &gt; to\n&gt; &gt; &gt; the account. It will automatically notify everyone thats a \nmember\n&gt; &gt; &gt; when a file is added to it just like the yahoo group does. It \nalso\n&gt; &gt; &gt; allows you to share with the public or privately if you so \nchoose.\n&gt; &gt; &gt; You can even allow your friends to post to your account if you \nwish.\n&gt; &gt; &gt;\n&gt; &gt; &gt; This group has grown and expanded and we just need to make a few\n&gt; &gt; &gt; changes to how we do things to keep it running more smoothly for\n&gt; &gt; the\n&gt; &gt; &gt; future. I am hoping that you all will help me in this endeavor. \nI\n&gt; &gt; &gt; know many of you have already adapted the idea to help us \norganize\n&gt; &gt; &gt; and maintain the group.\n&gt; &gt; &gt;\n&gt; &gt; &gt; I want you to keep sharing and to be able to share more!\n&gt; &gt; &gt;\n&gt; &gt; &gt; So please organize and not post stray files that are targets for\n&gt; &gt; &gt; deletion once the que is 100% full. And for your own sake, if no\n&gt; &gt; one\n&gt; &gt; &gt; elses, be respectful to each other.\n&gt; &gt; &gt;\n&gt; &gt; &gt; MD\n&gt; &gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Be a better friend, newshound, and know-it-all with Yahoo! \nMobile.  \n&gt; &gt; Try it now.\n&gt; &gt;\n&gt; &gt;\n&gt;"}