{"id": "6569", "subject": "Re: New File", "author": "ecuyler", "timestamp": "2008-01-31T22:36:12Z", "full_text": "Sorry Bruce.  I was so excited, I got carried away.  When I&#39;m excited,\nI have a totally different thought pattern.  \n\nI do understand what you are saying though about doing it one question\nat a time.  I&#39;ll be sure to do that from now on.  Thanks for the help.\n\nJeremy\n\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, bruce halliday\n&lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; \n&gt; Jeremy,\n&gt;  \n&gt; There are quite a few answer or messages just in this clip.\n&gt; My suggestion is to go over the clip a question at a time.\n&gt;  \n&gt; Put the whole recording into your editer and go to the beginning\n&gt; of a question and then save the question and the preceeding signal\nup to the next question.\n&gt; In a file of it&#39;s own. Go over the recorded data following the\nsingle question and look for specific answers.\n&gt; to that question. If there are any save that answer to a new file in\nthe editer and slow it or clean it a bit so it is compehencible.\n&gt; then paste it back where it belongs in the question file. You should\nnow have the question and answer in one file.\n&gt; Save it and label it with the question and answer as one file.\n&gt;  \n&gt; I hope you understand that explination, if not fire back some\nquestions and I&#39;ll try to clarify.\n&gt;  \n&gt; Bruce\n&gt; Bruce Halliday \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: ecuyler@...: Thu, 31 Jan 2008 02:46:17\n+0000Subject: [EVP-ITC] Re: New File\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; After listening again, I think the &quot;tells me to&quot; part is more\nthanlikely just a radio station.Jeremy--- In EVP-ITC@yahoogroups.com,\n&quot;ecuyler&quot; &lt;ecuyler@&gt; wrote:&gt;&gt; Just posted a new file on Esnips. It&#39;s\nfairly big in size so I went&gt; ahead and put it on there to help save\nspace on here. This is the\nlink:&gt;http://www.esnips.com/doc/99a4a4b1-de10-40d8-943e-85b809a2332a/Session-4-01_30_08-20-125-govt&gt;\n&gt; I did as Bruce had asked and just used the RS 20-125 with a digital&gt;\nrecorder and this is what I came up with. It&#39;s a little over 30&gt;\nseconds long. &gt; &gt; Bruce, if you still want to hear all of this\nsession, I will put it&gt; all on Esnips. Just let me know. There is\nquite a bit more to it&gt; than just this one clip. It&#39;s amazing all the\nthings that came through.&gt; &gt; Here&#39;s a little background on the file. I\nasked two questions. The&gt; first was, &quot;Is the US governemnt using ITC\nresearch?&quot; The second,&gt; &quot;How is the US goverment using ITC research?&quot;\nI hear these things in&gt; this order: &quot;Yeah it is, just stop it, just\nstop, you need help,&quot; and&gt; something toward the end that I can&#39;t quite\nmake out. Sounds like a&gt; couple of words and then &quot;tells me to.&quot; Let\nme know what you think.&gt; &gt; Jeremy&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Climb to the top of the charts! Play the word scramble challenge\nwith star power.\n&gt;\nhttp://club.live.com/star_shuffle.aspx?icid=starshuffle_wlmailtextlink_jan\n&gt;"}