{"id": "6586", "subject": "Re: [EVP-ITC] (unknown)", "author": "Lisby", "timestamp": "2008-02-01T01:15:08Z", "full_text": "Very cool indeed. When you get the OK, maybe you can give us the  \nwhole story with the clips!\n\nAnn\n\nOn Jan 31, 2008, at 7:05 PM, juli velazquez wrote:\n\n&gt;\n&gt; Yes it has Ann!  The amazing things are that some of the clips say  \n&gt; the full names of the former residents.  This is a famous story as  \n&gt; well and once we get the ok, I will be more than happy to share  \n&gt; with all of you.  This houses history go&#39;s back to the 1800&#39;s and  \n&gt; has been documents up until the current owner.\n&gt;\n&gt; One of the former residents divorced his wife (which is documented  \n&gt; in court records) because of abuse from the children.  This took  \n&gt; place in the civil war ara and in fact was able to collect his  \n&gt; civil war pension.  It is believed that some of the beating may  \n&gt; have taken place by the creek with a whip (which is actually  \n&gt; mentioned in the clips).\n&gt;\n&gt; Juli\n&gt;\n&gt; Lisby &lt;lisby@...&gt; wrote:\n&gt; I know you can&#39;t disclose the location, but can you summarize the  \n&gt; haunting and what you got from the box session? Has any of it  \n&gt; checked out in the historic records yet?\n&gt;\n&gt; Ann\n&gt;\n&gt; On Jan 31, 2008, at 6:43 PM, juli velazquez wrote:\n&gt;\n&gt;&gt;\n&gt;&gt; These files are the responses we got when asked if something  \n&gt;&gt; tragic happened in the home.  The last one clearly reflects that a  \n&gt;&gt; possible negitive spirit didn&#39;t want us asking anymore questions.\n&gt;&gt;\n&gt;&gt; Let me know what you think!\n&gt;&gt;\n&gt;&gt; Thanks!\n&gt;&gt; Juli\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; The contents of this eletronic correspondence is private &  \n&gt;&gt; confidential and meant only for the party and/or parties it is  \n&gt;&gt; addressed to.\n&gt;&gt;\n&gt;&gt; No part of this email transmission may be publicly posted or  \n&gt;&gt; forwarded to other parties without explicit written permission.\n&gt;&gt;\n&gt;&gt; &lt;Is this a joke to you, enough.mp3&gt;&lt;thomas, trader.mp3&gt;&lt;ITS A  \n&gt;&gt; CRIME.mp3&gt;&lt;They are here, they are ready to leave.mp3&gt;&lt;whore, they  \n&gt;&gt; are back, give up.mp3&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; The contents of this eletronic correspondence is private &  \n&gt; confidential and meant only for the party and/or parties it is  \n&gt; addressed to.\n&gt;\n&gt; No part of this email transmission may be publicly posted or  \n&gt; forwarded to other parties without explicit written permission.\n&gt;\n&gt; \n\n\nVe y cool indeed. When you ge he OK, maybe you can gi e us he whole s o y wi h he clips!AnnOn Jan 31, 2008, a 7:05 PM, juli elazquez w o e:Yes i has Ann!  The amazing hings a e ha some o he clips say he ull names o he o me esiden s.  This is a amous s o y as well and once we ge he ok, I will be mo e han happy o sha e wi h all o you.  This houses his o y go's back o he 1800's and has been documen s up un il he cu en owne .  One o he o me esiden s di o ced his wi e (which is documen ed in cou eco ds) because o abuse om he child en.  This ook place in he ci il wa a a and in ac was able o collec his ci il wa pension.  I is belie ed ha some o he bea ing may ha e aken place by he c eek wi h a whip (which is ac ually men ioned in he clips). JuliLisby ne > w o e:I know you can' disclose he loca ion, bu can you summa ize he haun ing and wha you go om he box session? Has any o i checked ou in he his o ic eco ds ye ?AnnOn Jan 31, 2008, a 6:43 PM, juli elazquez w o e:These iles a e he esponses we go when asked i some hing agic happened in he home.  The las one clea ly e lec s ha a possible negi i e spi i didn' wan us asking anymo e ques ions. Le me know wha you hink! Thanks!JuliThe con en s o his ele onic co espondence is p i a e & con iden ial and mean only o he pa y and/o pa ies i is add essed o.  No pa o his email ansmission may be publicly pos ed o o wa ded o o he pa ies wi hou explici w i en pe mission.The con en s o his ele onic co espondence is p i a e & con iden ial and mean only o he pa y and/o pa ies i is add essed o.  No pa o his email ansmission may be publicly pos ed o o wa ded o o he pa ies wi hou explici w i en pe mission."}