{"id": "6590", "subject": "Re: Just an observation on yesterday&#39;s file discussion", "author": "Steve Hultay", "timestamp": "2008-02-01T02:29:57Z", "full_text": "I like the personal audio clips too.  However, the fact is for those \nwho don&#39;t check their e-mail all day long and when they get home they \nhave 80 e-mails and 50 of them are just announcements to files.  I do \nlisten to them also and enjoy it, but maybe we can limit the files to \na few instead of a lot at one time.  It also seems like the board \nfreed up a lot of space as well, so people can start posting on this \nboard again.  The e-snips thing is cool, but it&#39;s better all on the \nsame board and i think the space is available now to do that.  I \npersonally listened to all your posts Bruce and so did a lot of \nothers i&#39;m sure.  Maybe there wasn&#39;t a lot in that batch to comment \non for people.  Some you hear and some you don&#39;t, i personally don&#39;t \nhear a lot of what you post with no disrespect.  Do you want 200 \npeople responding &quot;I didn&#39;t hear that&quot; to some of the files or &quot;Yeah \nGood One&quot;.  I can make out other files only if you label them and i&#39;m \nwaiting for the file to say that and i think you proved that with \nyour experiment with unlabeled files that no one got the right answer \nto.  The fact is people hear different things all the time.Your files \nsound very much like traditional EVP and are hard to make out \nsometimes, but sometimes you hit on some good ones too.   You have \nstated in a personal e-mail to not respond to any of your files, and \ni&#39;ve honored your request but if you allow me to comment on the files \nyou post i will.  It seems there are only a couple that respond to \nfiles here, but i&#39;m sure others listen as well and don&#39;t comment.  I \nwill be more than happy to add to to the group discussions on your \nfiles, but the couple people that always respond to your files have \nnothing but praise and i disagree sometimes.\n\n-Steve H. \n\n\n--- In EVP-ITC@yahoogroups.com, juli velazquez &lt;ghostchasingfool@...&gt; \nwrote:\n&gt;\n&gt; Bruce, \n&gt;               I have to agree with you.  Given the file folder \nshortage, I deleted all of my files to give the new comers room.  I \nhated to do that, given if anyone wanted to revert back to my clips, \nthey could in fact do so and now that can&#39;t.   I also hate to have to \nsend someone a link to find my audio on an additional sight.  \n&gt;    \n&gt;               Maybe we could comprise and say after &quot;x&quot; amount of \ndays, upon new files being uploaded we could clean house?  I know \nthat not everyone will take it upon themselves to do this, but if \nthey don&#39;t (after an announcement from the groups caretakers), if \nthey disappear, its their own fault.\n&gt;    \n&gt;                I personally like the single emails announcing each \nfile.  I can go straight to the audio clip and not have to search \nthrough previous clips I have already listened to.  \n&gt;    \n&gt;   Just my thoughts!\n&gt;   Juli  \n&gt; \n&gt; bhali333 &lt;paranormalinvestigating@...&gt; wrote:\n&gt;           Yesterday I decided to post some files so I posted to a \nsub folder of \n&gt; my main folder in the files section.\n&gt; I noticed that some people voiced their dislike of sending post \nnotices \n&gt; for every file , so I sent none. Just a single post stating that I \nhad \n&gt; posted the files and where they could be found.\n&gt; \n&gt; Now this is the dilemma, If you do not post an announcement for \neach \n&gt; file and you trust that the single post announcing all the files \nthat \n&gt; have been posted will suffice, well I don&#39;t think so!\n&gt; \n&gt; I know that most individuals here do not listen to or reply to \nevery \n&gt; single file posted but I will usually get some comments on the \nbetter \n&gt; or more interesting ones. So far from the posting yesterday &quot;NADA&quot;\n&gt; \n&gt; If anyone saw the post I wrote announcing the files I posted to the \n&gt; files section, please for my own satisfaction let me know.\n&gt; \n&gt; Otherwise I don&#39;t think the one post notice thing is gonna cut it!\n&gt; \n&gt; Bruce\n&gt; \n&gt; \n&gt; \n&gt;                          \n&gt; \n&gt; \n&gt;   The contents of this eletronic correspondence is private & \nconfidential and meant only for the party and/or parties it is \naddressed to.  \n&gt;    \n&gt;   No part of this email transmission may be publicly posted or \nforwarded to other parties without explicit written permission.\n&gt;"}