{"id": "6596", "subject": "Re: [EVP-ITC] Just an observation on yesterday&#39;s file discussion", "author": "Lisby", "timestamp": "2008-02-01T04:51:55Z", "full_text": "Well, I tried to listen to your files and I can&#39;t. Maybe it&#39;s a Mac  \nthing, but I cannot hear anything on esnips and never have been able  \nto. Unless someone can tell me why and help me overcome what is an  \nabsolutely shocking technical ignorance on my part, I can&#39;t hear  \nnothin&#39;!\n\nAnn\n\nOn Jan 31, 2008, at 7:30 PM, bruce halliday wrote:\n\n&gt; Jules,\n&gt;\n&gt; I agree with you 100% but lets be democratic and give the esnips  \n&gt; method a try.\n&gt; I suggest after 1 month evaluate what members think about it and  \n&gt; decide what to do from there.\n&gt;\n&gt; Bruce\n&gt;\n&gt;\n&gt;\n&gt; Bruce Halliday\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; From: ghostchasingfool@...\n&gt; Date: Thu, 31 Jan 2008 16:20:09 -0800\n&gt; Subject: Re: [EVP-ITC] Just an observation on yesterday&#39;s file  \n&gt; discussion\n&gt;\n&gt; Bruce,\n&gt;             I have to agree with you.  Given the file folder  \n&gt; shortage, I deleted all of my files to give the new comers room.  I  \n&gt; hated to do that, given if anyone wanted to revert back to my  \n&gt; clips, they could in fact do so and now that can&#39;t.   I also hate  \n&gt; to have to send someone a link to find my audio on an additional  \n&gt; sight.\n&gt;\n&gt;             Maybe we could comprise and say after &quot;x&quot; amount of  \n&gt; days, upon new files being uploaded we could clean house?  I know  \n&gt; that not everyone will take it upon themselves to do this, but if  \n&gt; they don&#39;t (after an announcement from the groups caretakers), if  \n&gt; they disappear, its their own fault.\n&gt;\n&gt;              I personally like the single emails announcing each  \n&gt; file.  I can go straight to the audio clip and not have to search  \n&gt; through previous clips I have already listened to.\n&gt;\n&gt; Just my thoughts!\n&gt; Juli\n&gt;\n&gt; bhali333 &lt;paranormalinvestigating@...&gt; wrote:\n&gt; Yesterday I decided to post some files so I posted to a sub folder of\n&gt; my main folder in the files section.\n&gt; I noticed that some people voiced their dislike of sending post  \n&gt; notices\n&gt; for every file , so I sent none. Just a single post stating that I had\n&gt; posted the files and where they could be found.\n&gt;\n&gt; Now this is the dilemma, If you do not post an announcement for each\n&gt; file and you trust that the single post announcing all the files that\n&gt; have been posted will suffice, well I don&#39;t think so!\n&gt;\n&gt; I know that most individuals here do not listen to or reply to every\n&gt; single file posted but I will usually get some comments on the better\n&gt; or more interesting ones. So far from the posting yesterday &quot;NADA&quot;\n&gt;\n&gt; If anyone saw the post I wrote announcing the files I posted to the\n&gt; files section, please for my own satisfaction let me know.\n&gt;\n&gt; Otherwise I don&#39;t think the one post notice thing is gonna cut it!\n&gt;\n&gt; Bruce\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; The contents of this eletronic correspondence is private &  \n&gt; confidential and meant only for the party and/or parties it is  \n&gt; addressed to.\n&gt;\n&gt; No part of this email transmission may be publicly posted or  \n&gt; forwarded to other parties without explicit written permission.\n&gt;\n&gt;\n&gt;\n&gt; Shed those extra pounds with MSN and The Biggest Loser! Learn more.\n&gt;\n&gt; \n\n\nWell, I ied o lis en o you iles and I can' . Maybe i 's a Mac hing, bu I canno hea any hing on esnips and ne e ha e been able o. Unless someone can ell me why and help me o e come wha is an absolu ely shocking echnical igno ance on my pa , I can' hea no hin'!AnnOn Jan 31, 2008, a 7:30 PM, b uce halliday w o e:Jules, I ag ee wi h you 100% bu le s be democ a ic and gi e he esnips me hod a y.I sugges a e 1 mon h e alua e wha membe s hink abou i and decide wha o do om he e. B uceB uce Halliday To: EVP-ITC@yahoog oups.comF om: ghos chasing ool@yahoo.comDa e: Thu, 31 Jan 2008 16:20:09 -0800Subjec : Re: [EVP-ITC] Jus an obse a ion on yes e day's ile discussionB uce,            I ha e o ag ee wi h you.  Gi en he ile olde sho age, I dele ed all o my iles o gi e he new come s oom.  I ha ed o do ha , gi en i anyone wan ed o e e back o my clips, hey could in ac do so and now ha can' .   I also ha e o ha e o send someone a link o ind my audio on an addi ional sigh .               Maybe we could comp ise and say a e  \"x\" amoun o days, upon new iles being uploaded we could clean house?  I know ha no e e yone will ake i upon hemsel es o do his, bu i hey don' (a e an announcemen om he g oups ca e ake s), i hey disappea , i s hei own aul .              I pe sonally like he single emails announcing each ile.  I can go s aigh o he audio clip and no ha e o sea ch h ough p e ious clips I ha e al eady lis ened o.  Jus my hough s!Juli  bhali333 ing@ho mail.com> w o e:Yes e day I decided o pos some iles so I pos ed o a sub olde o  my main olde in he iles sec ion.I no iced ha some people oiced hei dislike o sending pos no ices  o e e y ile , so I sen none. Jus a single pos s a ing ha I had pos ed he iles and whe e hey could be ound.Now his is he dilemma, I you do no pos an announcemen o each  ile and you us ha he single pos announcing all he iles ha  ha e been pos ed will su ice, well I don' hink so!I know ha mos indi iduals he e do no lis en o o eply o e e y single ile pos ed bu I will usually ge some commen s on he be e  o mo e in e es ing ones. So a om he pos ing yes e day \"NADA\"I anyone saw he pos I w o e announcing he iles I pos ed o he  iles sec ion, please o my own sa is ac ion le me know.O he wise I don' hink he one pos no ice hing is gonna cu i !B uceThe con en s o his ele onic co espondence is p i a e & con iden ial and mean only o he pa y and/o pa ies i is add essed o.  No pa o his email ansmission may be publicly pos ed o o wa ded o o he pa ies wi hou explici w i en pe mission.Shed hose ex a pounds wi h MSN and The Bigges Lose ! Lea n mo e."}