{"id": "6597", "subject": "Re: [EVP-ITC] New file uploaded to EVP-ITC", "author": "Lisby", "timestamp": "2008-02-01T04:49:07Z", "full_text": "Could be. Food for my thought. Thanks, buddy.\n\nAnn :)\n\nOn Jan 31, 2008, at 7:36 PM, bruce halliday wrote:\n\n&gt; Ann,\n&gt;\n&gt; In that particular file I caught maybe a word or two.\n&gt; The reason I questioned the sweep rate is that the slower\n&gt; the sweep rate the more likely you are to pick up full words\n&gt; or even sentences of radio broadcast with the minibox.\n&gt;\n&gt; Plus you get that annoying HUMMM, HUMMM when the sweep is too slow.\n&gt; Try adjusting the signal strength to accomidate the sweep.\n&gt;\n&gt; But listen if it&#39;s working for you don&#39;t mess with it!\n&gt;\n&gt; bruce\n&gt;\n&gt;\n&gt;\n&gt; Bruce Halliday\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; From: lisby@...\n&gt; Date: Thu, 31 Jan 2008 18:36:51 -0500\n&gt; Subject: Re: [EVP-ITC] New file uploaded to EVP-ITC\n&gt;\n&gt; The file was slowed by 25 percent. The sweep was at about 1:30 and  \n&gt; the signal strength at 12. If I turn the sweep up to 3, it sounds  \n&gt; like gunfire from all the stations around here. Literally. Why do  \n&gt; you think the sweep effected this? I confess that I have no clue  \n&gt; what the sweep rate does. I just know that I play with it until I  \n&gt; start hearing voices that seem to shout words like &quot;Purple,&quot;  \n&gt; &quot;Seven&quot; and &quot;Lisa&quot; and then we&#39;re golden.\n&gt;\n&gt; You really don&#39;t hear that? I thought the majority of it was pretty  \n&gt; clear. The first couple words were shaky, maybe, the &quot;We&#39;re good!&quot;  \n&gt; and &quot;Okay&quot; were loud enough that I hear it in real time and  \n&gt; answered. Did you hear it differently?\n&gt;\n&gt; Hmmmmmm. (Scratching head.)\n&gt;\n&gt; Ann\n&gt;\n&gt;\n&gt; On Jan 31, 2008, at 2:54 PM, bruce halliday wrote:\n&gt;\n&gt; Hi Ann,\n&gt;\n&gt; I did not hear this file the way you labeled it\n&gt; I think in part because you had the sweep rate on the mini box\n&gt; too slow.\n&gt;\n&gt; You want to try and keep the sweep rate between 2 and 3 o&#39;clock\n&gt; then use the signal strength knob to adjust for the weaker signals.\n&gt;\n&gt; Bruce\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Bruce Halliday\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; From: EVP-ITC@yahoogroups.com\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Date: Thu, 31 Jan 2008 01:55:33 +0000\n&gt; Subject: [EVP-ITC] New file uploaded to EVP-ITC\n&gt;\n&gt;\n&gt; Hello,\n&gt;\n&gt; This email message is a notification to let you know that\n&gt; a file has been uploaded to the Files area of the EVP-ITC\n&gt; group.\n&gt;\n&gt; File : /Ann&#39;s files/weregoodseasoned012608.mp3\n&gt; Uploaded by : lisbyfarrum &lt;lisby@earthlink.net&gt;\n&gt; Description : I say I&#39;m changing the sweep. After about four  \n&gt; seconds I seem to get, &quot;Damn it.&quot; Then, &quot;In synch...We&#39;re good!&quot;  \n&gt; &quot;Seasoned.&quot; I reply, &quot;We&#39;re good?&quot; Someone replies, &quot;Okay!&quot; then  \n&gt; &quot;David.&quot; I say, &quot;Okay, I heard you.&quot; They reply with &quot;Purple&quot; and  \n&gt; &quot;Seven.&quot; Unchanged except for 25 percent slower.\n&gt;\n&gt; You can access this file at the URL:\n&gt; http://groups.yahoo.com/group/EVP-ITC/files/Ann%27s%20files/ \n&gt; weregoodseasoned012608.mp3\n&gt;\n&gt; To learn more about file sharing for your group, please visit:\n&gt; http://help.yahoo.com/l/us/yahoo/groups/original/members/web/ \n&gt; index.htmlfiles\n&gt;\n&gt; Regards,\n&gt;\n&gt; lisbyfarrum &lt;lisby@...&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Need to know the score, the latest news, or you need your Hotmail®- \n&gt; get your &quot;fix&quot;.Check it out.\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Helping your favorite cause is as easy as instant messaging. You  \n&gt; IM, we give. Learn more.\n&gt;\n&gt; \n\n\nCould be. Food o my hough . Thanks, buddy.Ann :)On Jan 31, 2008, a 7:36 PM, b uce halliday w o e:Ann, In ha pa icula ile I caugh maybe a wo d o wo.The eason I ques ioned he sweep a e is ha he slowe   he sweep a e he mo e likely you a e o pick up ull wo ds o e en sen ences o adio b oadcas wi h he minibox. Plus you ge ha annoying HUMMM, HUMMM when he sweep is oo slow.T y adjus ing he signal s eng h o accomida e he sweep. Bu lis en i i 's wo king o you don' mess wi h i ! b uceB uce Halliday To: EVP-ITC@yahoog oups.comF om: lisby@ea hlink.ne Da e: Thu, 31 Jan 2008 18:36:51 -0500Subjec : Re: [EVP-ITC] New ile uploaded o EVP-ITCThe ile was slowed by 25 pe cen . The sweep was a abou 1:30 and he signal s eng h a 12. I I u n he sweep up o 3, i sounds like gun i e om all he s a ions a ound he e. Li e ally. Why do you hink he sweep e ec ed his? I con ess ha I ha e no clue wha he sweep a e does. I jus know ha I play wi h i un il I s a hea ing oices ha seem o shou wo ds like \"Pu ple,\" \"Se en\" and \"Lisa\" and hen we' e golden.You eally don' hea ha ? I hough he majo i y o i was p e y clea . The i s couple wo ds we e shaky, maybe, he \"We' e good!\" and \"Okay\" we e loud enough ha I hea i in eal ime and answe ed. Did you hea i di e en ly?Hmmmmmm. (Sc a ching head.)AnnOn Jan 31, 2008, a 2:54 PM, b uce halliday w o e:Hi Ann,  I did no hea his ile he way you labeled i  I hink in pa because you had he sweep a e on he mini box oo slow.  You wan o y and keep he sweep a e be ween 2 and 3 o'clock hen use he signal s eng h knob o adjus o he weake signals. B uceB uce Halliday F om: EVP-ITC@yahoog oups.comTo: EVP-ITC@yahoog oups.comDa e: Thu, 31 Jan 2008 01:55:33 +0000Subjec : [EVP-ITC] New ile uploaded o EVP-ITCHello,This email message is a no i ica ion o le you know ha a ile has been uploaded o he Files a ea o he EVP-ITC g oup.File : /Ann's iles/we egoodseasoned012608.mp3 Uploaded by : lisby a um lisby@ea hlink.ne > Desc ip ion : I say I'm changing he sweep. A e abou ou seconds I seem o ge , \"Damn i .\" Then, \"In synch...We' e good!\" \"Seasoned.\" I eply, \"We' e good?\" Someone eplies, \"Okay!\" hen \"Da id.\" I say, \"Okay, I hea d you.\" They eply wi h \"Pu ple\" and \"Se en.\" Unchanged excep o 25 pe cen slowe . You can access his ile a he URL:h p://g oups.yahoo.com/g oup/EVP-ITC/ iles/Ann%27s%20 iles/we egoodseasoned012608.mp3 To lea n mo e abou ile sha ing o you g oup, please isi :h p://help.yahoo.com/l/us/yahoo/g oups/o iginal/membe s/web/index.h ml ilesRega ds,lisby a um lisby@ea hlink.ne >Need o know he sco e, he la es news, o you need you Ho mail®-ge you \" ix\".Check i ou .Helping you a o i e cause is as easy as ins an messaging. You IM, we gi e. Lea n mo e."}