{"id": "6598", "subject": "About my files !!", "author": "Ralph Smith", "timestamp": "2008-02-01T06:02:08Z", "full_text": "Hi Bruce H. and everyone,\n\n Thanks again for the comments on my files I appreciate them. Bruce \nthanks for the criticism and advice on doing them better. I do tend \nto over kill my files with alot of noise reduction and filtering. The \nreason they don&#39;t sound like RS box files is that I weed out just the \nvoice I hear without all of the background clutter. Most of the time. \nAnother thing is that my hearing is acute in the low frequency range. \nI have hearing loss in the high upper frequencies. That&#39;s why I can \nhear what others tend not to hear. Also I find that when you listen \nto these with different types of speaker systems and different \nformats like MP3&#39;s and Wav files and Aiff files and Ogg files they \nsound completely different. I have also found that using different \nheadphones can effect the sounds too in the way you hear them. Bruce \nsome of your files I hear something all together different then what \nyou say they said ,but that could be my hearing is different than \nyours and my sound system may be different than yours. I&#39;m not sure. \nThat&#39;s why it&#39;s a difficult thing to interpret these sound files \nsometimes. You have some I can really hear what you said they were \nsaying and others not. Your right in the fact that I do tend to take \ntoo much away from the file with noice reduction and I&#39;ll have to cut \nback on that ,and to copy more of the background noise so everyone \nknows it&#39;s from the RS 12-469 model. Bruce I appreciate your advice \nalot. keep me informed on anything I&#39;m doing wrong with these boxes \nsince I am new to this and you pretty much know more about them than \nI do. Since I have mostly worked with Tradional EVP&#39;s and this is a \ncompletely different kind of venue to work with and research I hope \nyou all will help me out and point me in the right direction.  The \nthing is I hear these files as clear as anything. Maybe I&#39;m just \nmatrixing what I hear on the boxes I don&#39;t know. All I know is that \nwhat I have on here all came from the RS 12-469 Box and I have alot \nto learn from the group on recording them and so forth. I want to \nthank everyone with their comments and for their help in this \nresearch here with EVP-ITC it&#39;s very interesting to say the least. I \nhope you all are doing okay and I hope that my files get better and \nmore understandable as I do my research in this study with all of \nyou. Thanks again !!!!!\n\nRegards,\n\nRalph the Ghost Hunter\n\nI forgot I wanted to ask you Bruce and anyone else on here what is \nthe Scan rate on your boxes ? On my RS 12-469 it&#39;s 17 seconds to make \na complete linear scan. On the RS 12-470 it&#39;s 11 seconds. On the RS \n20-125 it&#39;s 11 seconds too. What should the Scan rate be ? Just \nwondering if other people have different scan rates than mine. Does \nthat make a diffence in getting better quality voices ? Thanks."}