{"id": "6600", "subject": "Re: New File", "author": "ecuyler", "timestamp": "2008-02-01T11:42:36Z", "full_text": "Thank you for the help Juli.  I&#39;ll be sure to use your log sheet.  I\ndo like their response to you telling them about the recorder. \n\nI&#39;ve gotten a couple of smart ass responses to questions I&#39;ve asked. \nI had my wife listen to them and she says it sounds like I&#39;m answering\nmyself.  It&#39;s nice to know there is some sort of personality on the\nother side.\n\nJeremy\n\n\n\n\n\n\n\n\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, juli velazquez &lt;ghostchasingfool@...&gt;\nwrote:\n&gt;\n&gt; Jeremy \n&gt;               I have posted a log sheet if you want to use it in the\nfile section. This may also help in aiding you with your sessions. \nJust remember once your rock n rolling your questions along with their\nresponses just may lead you in a direction you may never intended.  Be\nquick on your feet, but try to preplan if you can.\n&gt;    \n&gt;              Also, I always try and ask them if they have any\nquestions for me or if I can deliver a message of any kind.  I never\nwant them to think that its all about me and getting the information I\nWANT!  You would never have a conversation with a live friend always\ntaking over the topic.  For if that was the case I would not have any\nfriends, LOL.  \n&gt;    \n&gt;             You may also get communication for only you to hear, in\nwhich case you may discover that your recorder has been turned off.  I\nhave attached a clip where I tell them to stop shutting up my recorder\nand their response is sarcastic as if they had no clue to what I was\ntalking about.  I love their sense of humor!\n&gt; \n&gt;    \n&gt;   Juli\n&gt; ecuyler &lt;ecuyler@...&gt; wrote:\n&gt;           I totally agree. I&#39;ll be honest, I did just wing it on\nyesterdays\n&gt; session. In the previous sessions I did remember to write down the\n&gt; questions I wanted to ask ahead of time. \n&gt; \n&gt; Jeremy\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, bruce halliday\n&gt; &lt;paranormalinvestigating@&gt; wrote:\n&gt; &gt;\n&gt; &gt; \n&gt; &gt; Jeremy,\n&gt; &gt; \n&gt; &gt; Juli is right, it is very helpfull to have your questions thought\n&gt; out before a session especially if the session is pertaining to a\n&gt; certain topic.\n&gt; &gt; \n&gt; &gt; If you wing it, like juli said you will tend to speed up and overlap\n&gt; the next question with the previous answer and then you think you did \n&gt; &gt; not recieve a response so you ask the same question again. I had\n&gt; this happen a few day&#39;s ago and when I repeated the question my tech&#39;s\n&gt; &gt; mike and lisa both said &quot;AGAIN&quot; they start to lose patience\n&gt; sometimes, but you have to remember to them we must be like dealing\n&gt; with kindergarten children.\n&gt; &gt; \n&gt; &gt; Bruce\n&gt; &gt; Bruce Halliday \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; To: EVP-ITC@: ghostchasingfool@: Thu, 31 Jan 2008 15:18:30\n&gt; -0800Subject: Re: [EVP-ITC] Re: New File\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; Jeremy:\n&gt; &gt; You may also want to try and ask the questions\n&gt; quickly (I often times write them down prior to a session). The\n&gt; reason being I have noticed that many people drag the questions or ask\n&gt; more than one question prior to getting a response. Please note that\n&gt; in my research I have on occasion spoken over them and get not the\n&gt; immediate response because I was too busy talking. I have even gotten\n&gt; from my tec David to (&quot;I&#39;m Talking) which was funny cause anyone that\n&gt; knows me, knows I love to gab, lol. I have attached to clips so you\n&gt; can see what I am talking about. The first one David tells me that\n&gt; basicly I needed to listen and not speak, for he was not done. The\n&gt; second, Joel is asking a questions and the question seems to go on and\n&gt; on, only to have David say &quot;Joel Speak Up&quot;.\n&gt; &gt; \n&gt; &gt; In addition, I have also gotten as many as 3\n&gt; spirits responding to your question at the same time. I believe Bruce\n&gt; and Steve have experienced that on more than one occasion. Maybe they\n&gt; could post or attach one of these files for an example. \n&gt; &gt; \n&gt; &gt; They know whats going on, and they will comply\n&gt; with you and guide you along the way. Best of Luck and Great\n&gt; Job!ecuyler &lt;ecuyler@&gt; wrote:\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; Sorry Bruce. I was so excited, I got carried away. When I&#39;m\n&gt; excited,I have a totally different thought pattern. I do understand\n&gt; what you are saying though about doing it one questionat a time. I&#39;ll\n&gt; be sure to do that from now on. Thanks for the help.Jeremy--- In\n&gt; EVP-ITC@yahoogroups.com, bruce halliday&lt;paranormalinvestigating@&gt;\n&gt; wrote:&gt;&gt; &gt; Jeremy,&gt; &gt; There are quite a few answer or messages just in\n&gt; this clip.&gt; My suggestion is to go over the clip a question at a\n&gt; time.&gt; &gt; Put the whole recording into your editer and go to the\n&gt; beginning&gt; of a question and then save the question and the preceeding\n&gt; signalup to the next question.&gt; In a file of it&#39;s own. Go over the\n&gt; recorded data following thesingle question and look for specific\n&gt; answers.&gt; to that question. If there are any save that answer to a new\n&gt; file inthe editer and slow it or clean it a bit so it is\n&gt; compehencible.&gt; then paste it back where it belongs in the question\n&gt; file. You shouldnow have the question and answer in one file.&gt; Save it\n&gt; and label it with the question and answer as one file.&gt; &gt; I hope you\n&gt; understand that explination, if not fire back somequestions and I&#39;ll\n&gt; try to clarify.&gt; &gt; Bruce&gt; Bruce Halliday &gt; &gt; &gt; To: EVP-ITC@: ecuyler@:\n&gt; Thu, 31 Jan 2008 02:46:17+0000Subject: [EVP-ITC] Re: New File&gt; &gt; &gt; &gt; &gt;\n&gt; After listening again, I think the &quot;tells me to&quot; part is\n&gt; morethanlikely just a radio station.Jeremy--- In\n&gt; EVP-ITC@yahoogroups.com,&quot;ecuyler&quot; &lt;ecuyler@&gt; wrote:&gt;&gt; Just posted a\n&gt; new file on Esnips. It&#39;sfairly big in size so I went&gt; ahead and put it\n&gt; on there to help savespace on here. This is\n&gt;\nthelink:&gt;http://www.esnips.com/doc/99a4a4b1-de10-40d8-943e-85b809a2332a/Session-4-01_30_08-20-125-govt&gt;&gt;\n&gt; I did as Bruce had asked and just used the RS 20-125 with a\n&gt; digital&gt;recorder and this is what I came up with. It&#39;s a little over\n&gt; 30&gt;seconds long. &gt; &gt; Bruce, if you still want to hear all of\n&gt; thissession, I will put it&gt; all on Esnips. Just let me know. There\n&gt; isquite a bit more to it&gt; than just this one clip. It&#39;s amazing all\n&gt; thethings that came through.&gt; &gt; Here&#39;s a little background on the\n&gt; file. Iasked two questions. The&gt; first was, &quot;Is the US governemnt\n&gt; using ITCresearch?&quot; The second,&gt; &quot;How is the US goverment using ITC\n&gt; research?&quot;I hear these things in&gt; this order: &quot;Yeah it is, just stop\n&gt; it, juststop, you need help,&quot; and&gt; something toward the end that I\n&gt; can&#39;t quitemake out. Sounds like a&gt; couple of words and then &quot;tells me\n&gt; to.&quot; Letme know what you think.&gt; &gt; Jeremy&gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt;\n&gt; __________________________________________________________&gt; Climb to\n&gt; the top of the charts! Play the word scramble challengewith star\n&gt;\npower.&gt;http://club.live.com/star_shuffle.aspx?icid=starshuffle_wlmailtextlink_jan&gt;\n&gt; &gt; \n&gt; &gt; The contents of this eletronic correspondence is private &\n&gt; confidential and meant only for the party and/or parties it is\n&gt; addressed to. \n&gt; &gt; \n&gt; &gt; No part of this email transmission may be publicly posted or\n&gt; forwarded to other parties without explicit written permission.\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; __________________________________________________________\n&gt; &gt; Need to know the score, the latest news, or you need your\n&gt; Hotmail-get your &quot;fix&quot;.\n&gt; &gt; http://www.msnmobilefix.com/Default.aspx\n&gt; &gt;\n&gt; \n&gt; \n&gt; \n&gt;                          \n&gt; \n&gt; \n&gt;   The contents of this eletronic correspondence is private &\nconfidential and meant only for the party and/or parties it is\naddressed to.  \n&gt;    \n&gt;   No part of this email transmission may be publicly posted or\nforwarded to other parties without explicit written permission.\n&gt;"}