{"id": "6604", "subject": "Re: [EVP-ITC] Quality of communication", "author": "Ron Lederer", "timestamp": "2008-02-01T19:23:06Z", "full_text": "--0-2049439538-1201893786=:53233\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nOK, I believe it to be correct too.  Ron L\n\nbhali333 &lt;paranormalinvestigating@...&gt; wrote:          \nThis is , I guess you could call it a theory but I think we throw \nthat word around without it really applying to what we are saying or \nthe subject matter.\n\nSo here are my thoughts on the subject of quality of communication. \nThis is basically for the new researchers that have not had a chance \nto experience my long boring posts on my ideas of why what is what. I \nbelieve that the communication that is sent from the spirit world to \nus,\nwhether it be one word or a ten word sentence. Is always given the \nsame amount of effort on the part of the sender or tech/guide that \nsends it.\n\nWhen I say the same amount of effort I do not mean that they will \nuse the same amount of communicative properties no matter how complex \nthe message or what the conditions are at the moment they send it. \nWhat I mean is I believe that our friends always give 110% effort in \nany attempt at communication.\n\nLet me explain why I felt it necessary to write this post on this \nsubject. I received a response to the files I posted yesterday by \nRobin Searcy Henson and in the response she said and I quote\n\n&quot;Either your recordings are getting better by the moment or my \nhearing is improving&quot;\n\nWell it happens to be a little of both but not necessarily at the \nsame time.\nLet me explain, the first part of the statement was correct in that \nthe recordings or messages if you will, where getting better by the \nmoment.\n\n&quot;The Moment&quot; being the key in that part of the statement. See it is \nmy belief that it has nothing to do with the effort our spirit \nfriends are exerting to send us the messages but the quality of \nconditions that are being produced at the particular &quot;Moment&quot; the \ncommunication is being sent.\n\nThe conditions concerning the reception of spirit messages are very \ndiverse and need to be in a certain synchronization with each other \nto be affective in the sending and receiving of messages.\n\nAll conditions such as strength of radio signal, strength of our \nbox reception, weather conditions even possibly astronomical \nconditions play a part in the successful sending and receiving of an \nindividual message at any given &quot;Moment&quot; these factors are ever \nchanging from millisecond to millisecond. Can you imagine the effort \nexerted by our spirit colleagues to catch the right sequence of \nconditions to be able to send even the most rudimentary of words such \nas a &quot;yes&quot; or &quot;no&quot;.\n\nIt must be like trying to write your name on a bullet as it flies \npast you after being shot from a gun. I think that takes a very \nstrong effort on the part of our spirit communicators.\n\nOn to the later part of robin&#39;s statement, &quot;Or my hearing is \nimproving&quot; I don&#39;t think Robin realised how important a statement \nthat was. It is my belief that the individual box researcher has to \ndevelop for lack of a better word an ear for listening to live and or \nbox communication. I do not believe it is just a matter of anyone \nturning on a box and immediately being able to discern the \ncommunication coming from the box. For the simple reason, we where \nnot trained from birth to listen to the type of sound or voice that \nemanates from an EVP box.\n\nEven before we are born, in the womb we begin to hear the muffled \nsound of our mothers voice and to hear ambient sound that is being \ndistributed in the immediate vicinity of our mothers body.\nThis is set up by years of evolution so that when we are born we can \nrecognise the specific tone of our mothers voice and are imprinted to \nher so if we are ever reported as young we can utilise this effect to \ninsure that the mother we go with is our own.\n\nIt was an instinct we developed in a time gone by when we did not \nhave a nurse in a hospital to send us home with the correct parent \nand today we enjoy the luxury of not having to be separated from our \nmothers for a long time after our birth.\nMy point being is that our audio sensory perception develops over any \ngiven period of time when listening to a constant type of sound to \nmore and more easily recognise that sound without having to have it \nexplained to us.\n\nTake for instance a guitar player, after a certain period of time \nplaying the instrument he learns instinctively what each note should \nideally sound like and is able to tune his guitar and every guitar \nplayer will tell you that each guitar plays the same basic notes but \nalso has it&#39;s own unique sound.\n\nSuch is true for our instruments only they happen to be EVP boxes.\nBut like musical instruments some of them must be tuned and the user \nor researcher must develop an ear to listen for the right type of \ncommunication and become used to picking it out of the rest of the \nnoise and chatter associated with a box signal and identify it as \nspirit communication. \n\nThat is why if you have ever taken a box to the field or done a \ndemonstration with someone that has never heard the box work or had a \nprolonged exposure to the box they will ultimately say that they \nheard a yes or no but for the most part did not hear anything but \nnoise when as the session is in play the researcher is repeating \nwords, names and phrases. that the uneducated person simply is not \ncapable of hearing therefore they walk away from the experience \nthinking that the researcher is delirious or should be seeking \nprofessional help.\n\nIn any event these two subjects I felt needed to try and be \nexplained so that new researchers understand why these circumstances \nmay affect the quality of a box file or the way an individual is \nhearing it.\n\nAgain this all is a theory of mi8ne and of course I believe it to \nbe correct, but please any researchers new or experienced form your \nown opinions the way I have formed this one through research, \nexperimentation and experience.\n\nThanks\nBruce Halliday\n\n\n\n                         \n\n       \n---------------------------------\nLooking for last minute shopping deals?  Find them fast with Yahoo! Search.\r\n--0-2049439538-1201893786=:53233\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nOK, I believe it to be correct too.&nbsp; Ron L&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;bhali333 &lt;paranormalinvestigating@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;div&gt;&lt;BR&gt;This is , I guess you could call it a theory but I think we throw &lt;BR&gt;that word around without it really applying to what we are saying or &lt;BR&gt;the subject matter.&lt;BR&gt;&lt;BR&gt;So here are my thoughts on the subject of quality of communication. &lt;BR&gt;This is basically for the new researchers that have not had a chance &lt;BR&gt;to experience my long boring posts on my ideas of why what is what. I &lt;BR&gt;believe that the communication that is sent from the spirit\n world to &lt;BR&gt;us,&lt;BR&gt;whether it be one word or a ten word sentence. Is always given the &lt;BR&gt;same amount of effort on the part of the sender or tech/guide that &lt;BR&gt;sends it.&lt;BR&gt;&lt;BR&gt;When I say the same amount of effort I do not mean that they will &lt;BR&gt;use the same amount of communicative properties no matter how complex &lt;BR&gt;the message or what the conditions are at the moment they send it. &lt;BR&gt;What I mean is I believe that our friends always give 110% effort in &lt;BR&gt;any attempt at communication.&lt;BR&gt;&lt;BR&gt;Let me explain why I felt it necessary to write this post on this &lt;BR&gt;subject. I received a response to the files I posted yesterday by &lt;BR&gt;Robin Searcy Henson and in the response she said and I quote&lt;BR&gt;&lt;BR&gt;&quot;Either your recordings are getting better by the moment or my &lt;BR&gt;hearing is improving&quot;&lt;BR&gt;&lt;BR&gt;Well it happens to be a little of both but not necessarily at the &lt;BR&gt;same time.&lt;BR&gt;Let me explain, the first part of the statement was correct in that &lt;BR&gt;the recordings or\n messages if you will, where getting better by the &lt;BR&gt;moment.&lt;BR&gt;&lt;BR&gt;&quot;The Moment&quot; being the key in that part of the statement. See it is &lt;BR&gt;my belief that it has nothing to do with the effort our spirit &lt;BR&gt;friends are exerting to send us the messages but the quality of &lt;BR&gt;conditions that are being produced at the particular &quot;Moment&quot; the &lt;BR&gt;communication is being sent.&lt;BR&gt;&lt;BR&gt;The conditions concerning the reception of spirit messages are very &lt;BR&gt;diverse and need to be in a certain synchronization with each other &lt;BR&gt;to be affective in the sending and receiving of messages.&lt;BR&gt;&lt;BR&gt;All conditions such as strength of radio signal, strength of our &lt;BR&gt;box reception, weather conditions even possibly astronomical &lt;BR&gt;conditions play a part in the successful sending and receiving of an &lt;BR&gt;individual message at any given &quot;Moment&quot; these factors are ever &lt;BR&gt;changing from millisecond to millisecond. Can you imagine the effort &lt;BR&gt;exerted by our spirit colleagues to catch the\n right sequence of &lt;BR&gt;conditions to be able to send even the most rudimentary of words such &lt;BR&gt;as a &quot;yes&quot; or &quot;no&quot;.&lt;BR&gt;&lt;BR&gt;It must be like trying to write your name on a bullet as it flies &lt;BR&gt;past you after being shot from a gun. I think that takes a very &lt;BR&gt;strong effort on the part of our spirit communicators.&lt;BR&gt;&lt;BR&gt;On to the later part of robin&#39;s statement, &quot;Or my hearing is &lt;BR&gt;improving&quot; I don&#39;t think Robin realised how important a statement &lt;BR&gt;that was. It is my belief that the individual box researcher has to &lt;BR&gt;develop for lack of a better word an ear for listening to live and or &lt;BR&gt;box communication. I do not believe it is just a matter of anyone &lt;BR&gt;turning on a box and immediately being able to discern the &lt;BR&gt;communication coming from the box. For the simple reason, we where &lt;BR&gt;not trained from birth to listen to the type of sound or voice that &lt;BR&gt;emanates from an EVP box.&lt;BR&gt;&lt;BR&gt;Even before we are born, in the womb we begin to hear the muffled\n &lt;BR&gt;sound of our mothers voice and to hear ambient sound that is being &lt;BR&gt;distributed in the immediate vicinity of our mothers body.&lt;BR&gt;This is set up by years of evolution so that when we are born we can &lt;BR&gt;recognise the specific tone of our mothers voice and are imprinted to &lt;BR&gt;her so if we are ever reported as young we can utilise this effect to &lt;BR&gt;insure that the mother we go with is our own.&lt;BR&gt;&lt;BR&gt;It was an instinct we developed in a time gone by when we did not &lt;BR&gt;have a nurse in a hospital to send us home with the correct parent &lt;BR&gt;and today we enjoy the luxury of not having to be separated from our &lt;BR&gt;mothers for a long time after our birth.&lt;BR&gt;My point being is that our audio sensory perception develops over any &lt;BR&gt;given period of time when listening to a constant type of sound to &lt;BR&gt;more and more easily recognise that sound without having to have it &lt;BR&gt;explained to us.&lt;BR&gt;&lt;BR&gt;Take for instance a guitar player, after a certain period of time &lt;BR&gt;playing\n the instrument he learns instinctively what each note should &lt;BR&gt;ideally sound like and is able to tune his guitar and every guitar &lt;BR&gt;player will tell you that each guitar plays the same basic notes but &lt;BR&gt;also has it&#39;s own unique sound.&lt;BR&gt;&lt;BR&gt;Such is true for our instruments only they happen to be EVP boxes.&lt;BR&gt;But like musical instruments some of them must be tuned and the user &lt;BR&gt;or researcher must develop an ear to listen for the right type of &lt;BR&gt;communication and become used to picking it out of the rest of the &lt;BR&gt;noise and chatter associated with a box signal and identify it as &lt;BR&gt;spirit communication. &lt;BR&gt;&lt;BR&gt;That is why if you have ever taken a box to the field or done a &lt;BR&gt;demonstration with someone that has never heard the box work or had a &lt;BR&gt;prolonged exposure to the box they will ultimately say that they &lt;BR&gt;heard a yes or no but for the most part did not hear anything but &lt;BR&gt;noise when as the session is in play the researcher is repeating\n &lt;BR&gt;words, names and phrases. that the uneducated person simply is not &lt;BR&gt;capable of hearing therefore they walk away from the experience &lt;BR&gt;thinking that the researcher is delirious or should be seeking &lt;BR&gt;professional help.&lt;BR&gt;&lt;BR&gt;In any event these two subjects I felt needed to try and be &lt;BR&gt;explained so that new researchers understand why these circumstances &lt;BR&gt;may affect the quality of a box file or the way an individual is &lt;BR&gt;hearing it.&lt;BR&gt;&lt;BR&gt;Again this all is a theory of mi8ne and of course I believe it to &lt;BR&gt;be correct, but please any researchers new or experienced form your &lt;BR&gt;own opinions the way I have formed this one through research, &lt;BR&gt;experimentation and experience.&lt;BR&gt;&lt;BR&gt;Thanks&lt;BR&gt;Bruce Halliday&lt;BR&gt;&lt;BR&gt;&lt;/div&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;p&gt;&#32;\n      &lt;hr size=1&gt;Looking for last minute shopping deals? &lt;a href=&quot;http://us.rd.yahoo.com/evt=51734/*http://tools.search.yahoo.com/newsearch/category.php?category=shopping&quot;&gt; \nFind them fast with Yahoo! Search.&lt;/a&gt;\r\n--0-2049439538-1201893786=:53233--"}