{"id": "6611", "subject": "Re: [EVP-ITC] New file uploaded to EVP-ITC", "author": "Lisby", "timestamp": "2008-02-01T20:37:12Z", "full_text": "The first repetition of the clip *is* the raw audio. Not speeded up  \nor slowed. As it was recorded. No amplifying, no noise reduction.  \nThat is exactly how it came across. The second rep is 25 percent  \nslowed and the 3rd is 50 percent slowed.\n\nWhat you&#39;re hearing is exactly what happened.\n\nAnn\n\nOn Feb 1, 2008, at 3:12 PM, juli velazquez wrote:\n\n&gt;\n&gt; Ann,\n&gt;                 I heard box in there somewhere.  What do the files  \n&gt; sound like raw?  I think by slowing them down your losing the clear  \n&gt; responses.  Can you post one of the raw clips?  Don&#39;t worry about  \n&gt; slowing it down or editing it.  I think your getting some great  \n&gt; stuff, but its distored by the editing software.\n&gt;\n&gt;  Juli\n&gt;\n&gt; EVP-ITC@yahoogroups.com wrote:\n&gt;\n&gt; Hello,\n&gt;\n&gt; This email message is a notification to let you know that\n&gt; a file has been uploaded to the Files area of the EVP-ITC\n&gt; group.\n&gt;\n&gt; File : /Ann&#39;s files/ismyguidedavidstevennot012608.mp3\n&gt; Uploaded by : lisbyfarrum &lt;lisby@...&gt;\n&gt; Description : More from the techs: I ask if my technician is David.  \n&gt; The first words of the reply may be &quot;both of them,&quot; but unclear;  \n&gt; then &quot;Steven.&quot; &quot;Not.&quot;\n&gt;\n&gt; You can access this file at the URL:\n&gt; http://groups.yahoo.com/group/EVP-ITC/files/Ann%27s%20files/ \n&gt; ismyguidedavidstevennot012608.mp3\n&gt;\n&gt; To learn more about file sharing for your group, please visit:\n&gt; http://help.yahoo.com/l/us/yahoo/groups/original/members/web/ \n&gt; index.htmlfiles\n&gt;\n&gt; Regards,\n&gt;\n&gt; lisbyfarrum &lt;lisby@...&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; The contents of this eletronic correspondence is private &  \n&gt; confidential and meant only for the party and/or parties it is  \n&gt; addressed to.\n&gt;\n&gt; No part of this email transmission may be publicly posted or  \n&gt; forwarded to other parties without explicit written permission.\n&gt;\n&gt; \n\n\nThe i s epe i ion o he clip *is* he aw audio. No speeded up o slowed. As i was eco ded. No ampli ying, no noise educ ion. Tha is exac ly how i came ac oss. The second ep is 25 pe cen slowed and he 3 d is 50 pe cen slowed.Wha you' e hea ing is exac ly wha happened.AnnOn Feb 1, 2008, a 3:12 PM, juli elazquez w o e:Ann,                I hea d box in he e somewhe e.  Wha do he iles sound like aw?  I hink by slowing hem down you losing he clea esponses.  Can you pos one o he aw clips?  Don' wo y abou slowing i down o edi ing i .  I hink you ge ing some g ea s u , bu i s dis o ed by he edi ing so wa e.  JuliEVP-ITC@yahoog oups.com w o e:Hello,This email message is a no i ica ion o le you know ha a ile has been uploaded o he Files a ea o he EVP-ITC g oup.File : /Ann's iles/ismyguideda ids e enno 012608.mp3 Uploaded by : lisby a um lisby@ea hlink.ne > Desc ip ion : Mo e om he echs: I ask i my echnician is Da id. The i s wo ds o he eply may be \"bo h o hem,\" bu unclea ; hen \"S e en.\" \"No .\" You can access his ile a he URL:h p://g oups.yahoo.com/g oup/EVP-ITC/ iles/Ann%27s%20 iles/ismyguideda ids e enno 012608.mp3 To lea n mo e abou ile sha ing o you g oup, please isi :h p://help.yahoo.com/l/us/yahoo/g oups/o iginal/membe s/web/index.h ml ilesRega ds,lisby a um lisby@ea hlink.ne >The con en s o his ele onic co espondence is p i a e & con iden ial and mean only o he pa y and/o pa ies i is add essed o.  No pa o his email ansmission may be publicly pos ed o o wa ded o o he pa ies wi hou explici w i en pe mission."}