{"id": "6627", "subject": "Re: [EVP-ITC] New file uploaded to EVP-ITC", "author": "Lisby", "timestamp": "2008-02-01T21:18:28Z", "full_text": "I don&#39;t know what to tell you, Juli. The first repeat is the raw  \naudio. The second is slightly slowed and the third is more slowed.  \nNothing else has been done. I posted a section of raw audio at your  \nrequest.\n\nI am using a minibox, not a hack. The minibox plugs directly into an  \nOlympus DM-10 recorder--so direct audio from the box goes there  \nwithout any ability by me to change it. The minbox also has a jack  \nfor an external microphone. I use a broadcast quality microphone--not  \na cheap one. That also feeds into the Olympus, which records in stereo.\n\nThe file is taken off the Olympus and opened in TwistedWave, a Mac- \nbased sound editing suite. The only use are cutting, pasting,  \nslowing, and occasionally amplifying and converting from stereo to  \nmono. I can silence tracks, but I haven&#39;t been doing that since the  \nfirst couple session back before xmas. There is no noise reduction  \nfeature in this suite, so obviously I am not using it.\n\nI know that my files sounds much different from some others on this  \nlist, but I can&#39;t help that. This is what I am getting and I&#39;m  \nhonestly trying to report that. I am a journalist, so I do try to  \nlive up my profession&#39;s ethics.\n\nAnn\n\nOn Feb 1, 2008, at 3:48 PM, juli velazquez wrote:\n\n&gt;\n&gt; Anne\n&gt;\n&gt; So why does it sound so slow and robotic?  The second clip was  \n&gt; perfect.  You could hear everything and was very clear.  If its not  \n&gt; the editing software is it the signal from the session?  Just curious?\n&gt;\n&gt; Juli\n&gt;\n&gt; Lisby &lt;lisby@...&gt; wrote:\n&gt; The first repetition of the clip *is* the raw audio. Not speeded up  \n&gt; or slowed. As it was recorded. No amplifying, no noise reduction.  \n&gt; That is exactly how it came across. The second rep is 25 percent  \n&gt; slowed and the 3rd is 50 percent slowed.\n&gt;\n&gt; What you&#39;re hearing is exactly what happened.\n&gt;\n&gt; Ann\n&gt;\n&gt; On Feb 1, 2008, at 3:12 PM, juli velazquez wrote:\n&gt;\n&gt;&gt;\n&gt;&gt; Ann,\n&gt;&gt;                 I heard box in there somewhere.  What do the files  \n&gt;&gt; sound like raw?  I think by slowing them down your losing the  \n&gt;&gt; clear responses.  Can you post one of the raw clips?  Don&#39;t worry  \n&gt;&gt; about slowing it down or editing it.  I think your getting some  \n&gt;&gt; great stuff, but its distored by the editing software.\n&gt;&gt;\n&gt;&gt;  Juli\n&gt;&gt;\n&gt;&gt; EVP-ITC@yahoogroups.com wrote:\n&gt;&gt;\n&gt;&gt; Hello,\n&gt;&gt;\n&gt;&gt; This email message is a notification to let you know that\n&gt;&gt; a file has been uploaded to the Files area of the EVP-ITC\n&gt;&gt; group.\n&gt;&gt;\n&gt;&gt; File : /Ann&#39;s files/ismyguidedavidstevennot012608.mp3\n&gt;&gt; Uploaded by : lisbyfarrum &lt;lisby@...&gt;\n&gt;&gt; Description : More from the techs: I ask if my technician is  \n&gt;&gt; David. The first words of the reply may be &quot;both of them,&quot; but  \n&gt;&gt; unclear; then &quot;Steven.&quot; &quot;Not.&quot;\n&gt;&gt;\n&gt;&gt; You can access this file at the URL:\n&gt;&gt; http://groups.yahoo.com/group/EVP-ITC/files/Ann%27s%20files/ \n&gt;&gt; ismyguidedavidstevennot012608.mp3\n&gt;&gt;\n&gt;&gt; To learn more about file sharing for your group, please visit:\n&gt;&gt; http://help.yahoo.com/l/us/yahoo/groups/original/members/web/ \n&gt;&gt; index.htmlfiles\n&gt;&gt;\n&gt;&gt; Regards,\n&gt;&gt;\n&gt;&gt; lisbyfarrum &lt;lisby@...&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; The contents of this eletronic correspondence is private &  \n&gt;&gt; confidential and meant only for the party and/or parties it is  \n&gt;&gt; addressed to.\n&gt;&gt;\n&gt;&gt; No part of this email transmission may be publicly posted or  \n&gt;&gt; forwarded to other parties without explicit written permission.\n&gt;&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; The contents of this eletronic correspondence is private &  \n&gt; confidential and meant only for the party and/or parties it is  \n&gt; addressed to.\n&gt;\n&gt; No part of this email transmission may be publicly posted or  \n&gt; forwarded to other parties without explicit written permission.\n&gt;\n&gt; \n\n\nI don' know wha o ell you, Juli. The i s epea is he aw audio. The second is sligh ly slowed and he hi d is mo e slowed. No hing else has been done. I pos ed a sec ion o aw audio a you eques .I am using a minibox, no a hack. The minibox plugs di ec ly in o an Olympus DM-10 eco de --so di ec audio om he box goes he e wi hou any abili y by me o change i . The minbox also has a jack o an ex e nal mic ophone. I use a b oadcas quali y mic ophone--no a cheap one. Tha also eeds in o he Olympus, which eco ds in s e eo.The ile is aken o he Olympus and opened in Twis edWa e, a Mac-based sound edi ing sui e. The only use a e cu ing, pas ing, slowing, and occasionally ampli ying and con e ing om s e eo o mono. I can silence acks, bu I ha en' been doing ha since he i s couple session back be o e xmas. The e is no noise educ ion ea u e in his sui e, so ob iously I am no using i .I know ha my iles sounds much di e en om some o he s on his lis , bu I can' help ha . This is wha I am ge ing and I'm hones ly ying o epo ha . I am a jou nalis , so I do y o li e up my p o ession's e hics.AnnOn Feb 1, 2008, a 3:48 PM, juli elazquez w o e:Anne So why does i sound so slow and obo ic?  The second clip was pe ec .  You could hea e e y hing and was e y clea .  I i s no he edi ing so wa e is i he signal om he session?  Jus cu ious? JuliLisby ne > w o e:The i s epe i ion o he clip *is* he aw audio. No speeded up o slowed. As i was eco ded. No ampli ying, no noise educ ion. Tha is exac ly how i came ac oss. The second ep is 25 pe cen slowed and he 3 d is 50 pe cen slowed.Wha you' e hea ing is exac ly wha happened.AnnOn Feb 1, 2008, a 3:12 PM, juli elazquez w o e:Ann,                I hea d box in he e somewhe e.  Wha do he iles sound like aw?  I hink by slowing hem down you losing he clea esponses.  Can you pos one o he aw clips?  Don' wo y abou slowing i down o edi ing i .  I hink you ge ing some g ea s u , bu i s dis o ed by he edi ing so wa e.  JuliEVP-ITC@yahoog oups.com w o e:Hello,This email message is a no i ica ion o le you know ha a ile has been uploaded o he Files a ea o he EVP-ITC g oup.File : /Ann's iles/ismyguideda ids e enno 012608.mp3 Uploaded by : lisby a um lisby@ea hlink.ne > Desc ip ion : Mo e om he echs: I ask i my echnician is Da id. The i s wo ds o he eply may be \"bo h o hem,\" bu unclea ; hen \"S e en.\" \"No .\" You can access his ile a he URL:h p://g oups.yahoo.com/g oup/EVP-ITC/ iles/Ann%27s%20 iles/ismyguideda ids e enno 012608.mp3 To lea n mo e abou ile sha ing o you g oup, please isi :h p://help.yahoo.com/l/us/yahoo/g oups/o iginal/membe s/web/index.h ml ilesRega ds,lisby a um lisby@ea hlink.ne >The con en s o his ele onic co espondence is p i a e & con iden ial and mean only o he pa y and/o pa ies i is add essed o.  No pa o his email ansmission may be publicly pos ed o o wa ded o o he pa ies wi hou explici w i en pe mission.The con en s o his ele onic co espondence is p i a e & con iden ial and mean only o he pa y and/o pa ies i is add essed o.  No pa o his email ansmission may be publicly pos ed o o wa ded o o he pa ies wi hou explici w i en pe mission."}