{"id": "6640", "subject": "Re: Just an observation on yesterday&#39;s file discussion", "author": "Steve Hultay", "timestamp": "2008-02-01T23:11:46Z", "full_text": "Fair enough, i don&#39;t think anybody is going to hear what we hear \nthough unless they have been using the same boxes we have for the \nsame amount of time.  Yeah, i&#39;ve noticed that some of my files are \ngood to me and say stuff that&#39;s clear, but than i go back the next \nday and i don&#39;t even hear it at all anymore.  Doing the unlabeled \nfiles project shows that nobody hears the same as the next \nresearcher.  We just have to keep pushing on until we can get clear \ncommunication, which i don&#39;t believe any of us have got yet.  But i \ndo believe this is still moving forward.  Juli and i had a fantastic \nFrank&#39;s box session on Skype yesterday in the AM Random mode, which \nnow works.  And, we talked and had pretty clear communication for \nabout a half hour with the box.  So, we hear pretty much the same as \neach other, well we did yesterday anyway.  \n\n-Steve H.\n\n\n\n--- In EVP-ITC@yahoogroups.com, bruce halliday \n&lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; \n&gt; Steve,\n&gt;  \n&gt; You and I  have never really agreed on what constitutes a good file.\n&gt; I would say besides the ones that say a simple yes or no, I don&#39;t \nhear any of yours either.\n&gt; thats kind of funny. Maybe they want it that way? (no disrespect) \nWe have had our differences \n&gt; but that aside I consider you an excellent researcher and value \nyour profesional opinion.\n&gt;  \n&gt; So please if we can comment objectively on each others files and \nnot let personal crap get in the way.\n&gt; By all means.\n&gt;  \n&gt; Bruce\n&gt; Bruce Halliday \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: urkel23@...: Fri, 1 Feb 2008 02:29:57 \n+0000Subject: [EVP-ITC] Re: Just an observation on yesterday&#39;s file \ndiscussion\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; I like the personal audio clips too. However, the fact is for those \nwho don&#39;t check their e-mail all day long and when they get home they \nhave 80 e-mails and 50 of them are just announcements to files. I do \nlisten to them also and enjoy it, but maybe we can limit the files to \na few instead of a lot at one time. It also seems like the board \nfreed up a lot of space as well, so people can start posting on this \nboard again. The e-snips thing is cool, but it&#39;s better all on the \nsame board and i think the space is available now to do that. I \npersonally listened to all your posts Bruce and so did a lot of \nothers i&#39;m sure. Maybe there wasn&#39;t a lot in that batch to comment on \nfor people. Some you hear and some you don&#39;t, i personally don&#39;t hear \na lot of what you post with no disrespect. Do you want 200 people \nresponding &quot;I didn&#39;t hear that&quot; to some of the files or &quot;Yeah Good \nOne&quot;. I can make out other files only if you label them and i&#39;m \nwaiting for the file to say that and i think you proved that with \nyour experiment with unlabeled files that no one got the right answer \nto. The fact is people hear different things all the time.Your files \nsound very much like traditional EVP and are hard to make out \nsometimes, but sometimes you hit on some good ones too. You have \nstated in a personal e-mail to not respond to any of your files, and \ni&#39;ve honored your request but if you allow me to comment on the files \nyou post i will. It seems there are only a couple that respond to \nfiles here, but i&#39;m sure others listen as well and don&#39;t comment. I \nwill be more than happy to add to to the group discussions on your \nfiles, but the couple people that always respond to your files have \nnothing but praise and i disagree sometimes.-Steve H. --- In EVP-\nITC@yahoogroups.com, juli velazquez &lt;ghostchasingfool@&gt; wrote:&gt;&gt; \nBruce, &gt; I have to agree with you. Given the file folder shortage, I \ndeleted all of my files to give the new comers room. I hated to do \nthat, given if anyone wanted to revert back to my clips, they could \nin fact do so and now that can&#39;t. I also hate to have to send someone \na link to find my audio on an additional sight. &gt; &gt; Maybe we could \ncomprise and say after &quot;x&quot; amount of days, upon new files being \nuploaded we could clean house? I know that not everyone will take it \nupon themselves to do this, but if they don&#39;t (after an announcement \nfrom the groups caretakers), if they disappear, its their own fault.&gt; \n&gt; I personally like the single emails announcing each file. I can go \nstraight to the audio clip and not have to search through previous \nclips I have already listened to. &gt; &gt; Just my thoughts!&gt; Juli &gt; &gt; \nbhali333 &lt;paranormalinvestigating@&gt; wrote:&gt; Yesterday I decided to \npost some files so I posted to a sub folder of &gt; my main folder in \nthe files section.&gt; I noticed that some people voiced their dislike \nof sending post notices &gt; for every file , so I sent none. Just a \nsingle post stating that I had &gt; posted the files and where they \ncould be found.&gt; &gt; Now this is the dilemma, If you do not post an \nannouncement for each &gt; file and you trust that the single post \nannouncing all the files that &gt; have been posted will suffice, well I \ndon&#39;t think so!&gt; &gt; I know that most individuals here do not listen to \nor reply to every &gt; single file posted but I will usually get some \ncomments on the better &gt; or more interesting ones. So far from the \nposting yesterday &quot;NADA&quot;&gt; &gt; If anyone saw the post I wrote announcing \nthe files I posted to the &gt; files section, please for my own \nsatisfaction let me know.&gt; &gt; Otherwise I don&#39;t think the one post \nnotice thing is gonna cut it!&gt; &gt; Bruce&gt; &gt; &gt; &gt; &gt; &gt; &gt; The contents of \nthis eletronic correspondence is private & confidential and meant \nonly for the party and/or parties it is addressed to. &gt; &gt; No part of \nthis email transmission may be publicly posted or forwarded to other \nparties without explicit written permission.&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Helping your favorite cause is as easy as instant messaging.You \nIM, we give.\n&gt; http://im.live.com/Messenger/IM/Home/?source=text_hotmail_join\n&gt;"}