{"id": "6664", "subject": "Re: misty", "author": "itcdeadpeople", "timestamp": "2008-02-02T07:09:40Z", "full_text": "Hi Ann.  I&#39;m a MAC user (OS 10.4.x).  I don&#39;t know if you use Audacity, but that program \nwill change your audio output from 44100Hz to 96000Hz.  This will prevent sound from \nworking on some sites.  For me, YouTube is a good example.  I have to reset my sound \nalmost every time after using Audacity (I&#39;ve created a shortcut on my desktop to make it \nquick and easy).\n\nI don&#39;t know if this will work for you, but try this path:  Applications &gt; Utilities &gt; Audio \nMIDI Setup (launch this application).  Then on the right side, under the words &quot;Audio \nOutput&quot; there is a pulldown menu after the word FORMAT.  If it isn&#39;t 44100Hz, change it to \nthis setting.   It took me forever and day to figure out what the problem was on my \nsystem.  Hope it works for you.  If this doesn&#39;t work, I&#39;m out of suggestions.   ;-)  Margaret\n\n--- In EVP-ITC@yahoogroups.com, Misty Dawn &lt;bulletbabea@...&gt; wrote:\n&gt;\n&gt; I dont use a MAC pc, should be same as any other from here. Sounded like maybe she \nhad a browser conflict. I would suggest she try going to the site then click on file and \nwhen it goes to the page that plays it, right below the file it has a download button. Click \nthat and see if it will let ya download. If the website is not loading for you at all then \ndefinitely a browser conflict. But the downloads should work same as they do on this \ngroup\n&gt;    \n&gt;   Misty\n&gt; \n&gt; bruce halliday &lt;paranormalinvestigating@...&gt; wrote:\n&gt;           Misty,\n&gt; Maybe you should field this one, can you explain to ann how she can listen to esnips \nfiles?\n&gt;  \n&gt; Bruce\n&gt; \n&gt; \n&gt;   Bruce Halliday \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;     \n&gt; ---------------------------------\n&gt;   To: EVP-ITC@yahoogroups.com\n&gt; From: lisby@...\n&gt; Date: Thu, 31 Jan 2008 23:51:55 -0500\n&gt; Subject: Re: [EVP-ITC] Just an observation on yesterday&#39;s file discussion\n&gt; \n&gt;       Well, I tried to listen to your files and I can&#39;t. Maybe it&#39;s a Mac thing, but I cannot \nhear anything on esnips and never have been able to. Unless someone can tell me why and \nhelp me overcome what is an absolutely shocking technical ignorance on my part, I can&#39;t \nhear nothin&#39;!   \n&gt; \n&gt;   Ann\n&gt;   \n&gt;     On Jan 31, 2008, at 7:30 PM, bruce halliday wrote:\n&gt; \n&gt;           Jules,\n&gt;  \n&gt; I agree with you 100% but lets be democratic and give the esnips method a try.\n&gt; I suggest after 1 month evaluate what members think about it and decide what to do \nfrom there.\n&gt;  \n&gt; Bruce\n&gt; \n&gt; \n&gt; \n&gt;   Bruce Halliday \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;     \n&gt; ---------------------------------\n&gt;   To: EVP-ITC@yahoogroups.com\n&gt; From: ghostchasingfool@...\n&gt; Date: Thu, 31 Jan 2008 16:20:09 -0800\n&gt; Subject: Re: [EVP-ITC] Just an observation on yesterday&#39;s file discussion\n&gt; \n&gt;         Bruce,\n&gt;               I have to agree with you.  Given the file folder shortage, I deleted all of my files \nto give the new comers room.  I hated to do that, given if anyone wanted to revert back to \nmy clips, they could in fact do so and now that can&#39;t.   I also hate to have to send someone \na link to find my audio on an additional sight.  \n&gt;    \n&gt;               Maybe we could comprise and say after &quot;x&quot; amount of days, upon new files being \nuploaded we could clean house?  I know that not everyone will take it upon themselves to \ndo this, but if they don&#39;t (after an announcement from the groups caretakers), if they \ndisappear, its their own fault.\n&gt;    \n&gt;                I personally like the single emails announcing each file.  I can go straight to the \naudio clip and not have to search through previous clips I have already listened to. \n&gt;    \n&gt;   Just my thoughts!\n&gt;   Juli  \n&gt; \n&gt; bhali333 &lt;paranormalinvestigating@...&gt; wrote:\n&gt;       Yesterday I decided to post some files so I posted to a sub folder of \n&gt; my main folder in the files section.\n&gt; I noticed that some people voiced their dislike of sending post notices \n&gt; for every file , so I sent none. Just a single post stating that I had \n&gt; posted the files and where they could be found.\n&gt; \n&gt; Now this is the dilemma, If you do not post an announcement for each \n&gt; file and you trust that the single post announcing all the files that \n&gt; have been posted will suffice, well I don&#39;t think so!\n&gt; \n&gt; I know that most individuals here do not listen to or reply to every \n&gt; single file posted but I will usually get some comments on the better \n&gt; or more interesting ones. So far from the posting yesterday &quot;NADA&quot;\n&gt; \n&gt; If anyone saw the post I wrote announcing the files I posted to the \n&gt; files section, please for my own satisfaction let me know.\n&gt; \n&gt; Otherwise I don&#39;t think the one post notice thing is gonna cut it!\n&gt; \n&gt; Bruce\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;     The contents of this eletronic correspondence is private & confidential and meant only \nfor the party and/or parties it is addressed to. \n&gt;    \n&gt;   No part of this email transmission may be publicly posted or forwarded to other parties \nwithout explicit written permission.\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;   \n&gt; ---------------------------------\n&gt;   Shed those extra pounds with MSN and The Biggest Loser! Learn more.   \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;   \n&gt; ---------------------------------\n&gt;   Helping your favorite cause is as easy as instant messaging. You IM, we give. Learn \nmore.   \n&gt; \n&gt;                          \n&gt; \n&gt; \n&gt; \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt;        \n&gt; ---------------------------------\n&gt; Be a better friend, newshound, and know-it-all with Yahoo! Mobile.  Try it now.\n&gt;"}