{"id": "6688", "subject": "Re: File from tonight", "author": "Steve Hultay", "timestamp": "2008-02-03T04:01:02Z", "full_text": "I just go by what works best at the moment and i have only been doing \nsessions lately approx. once a week if that.  Look at my posts and \nsee the lack of activity from me.  Work and other stuff has consumed \nmy time and i have just recently been getting good communication and \nit happens to be with your box....you should be proud of your work.  \nI have used Evp maker and i get minimal results with it.  Frank, \nrandom does work well and you should appreciate your accomplishment \nin designing that feature.  I no longer aske for technicians, i only \nask &quot;Is there someone that would like to communicate with me today?&quot; \nand if they have trouble coming through i will ask for assistance in \nhelping them get their message across to me.  As for telepathic \nsuggestions, i have been hacking boxes and currently turned my band \nroom into a giant Spiricom device and i would never know how to do \nthese things.  They are putting ideas into my head all the time to \nbetter the communication, i open a box up and know what wires are \nwhat....that&#39;s not me at all.  But it&#39;s happening and i go with it \nand it seems to be pushing me and others on this board forward.\n\n-Steve H.\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; \n&lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  Have ya tried EVPmaker? It is based on that random principle, and \n&gt; predates the boxes.\n&gt; \n&gt;  I&#39;ve heard this stuff before, about random being the best, and I \n&gt; have to disaggree. I also think it unwise to spend every waking \n&gt; moment doing sessions. I think it creates that expectation, and \n&gt; perhaps desperation to make contact, and I would tend not to trust \n&gt; what comes through. \n&gt; \n&gt;  I don&#39;t trust some of this stuff because I have yet get any \n&gt; meaningful assistence with the boxes from the so called \ntechnicians. \n&gt; All I ever got was a telepathic &quot;suggestion&quot; to use the echo boxes. \n&gt; Everything else was a assemblage of stuff I had worked on in hte \npast \n&gt; to solve the problem of &quot;what else could I use&quot;. \n&gt; \n&gt;  I hate to see yet another go down the road of &quot;this is the onlyest \n&gt; way&quot;. \n&gt; \n&gt;  Frank-S\n&gt;"}