{"id": "6690", "subject": "Re: File from tonight", "author": "Steve Hultay", "timestamp": "2008-02-03T04:09:54Z", "full_text": "Caution from what?  You&#39;ve been burned in the past by people and \nyou&#39;re taking it out on me.  My intentions are good and have nothing \nbut positive things to say about this, but if you are going to \ncompare me with others for making a simple observation of my own than \nso be it.  Linear works too, i just currently prefer the random \nmode...that&#39;s all.  It hasn&#39;t worked in 2 months and i&#39;m excited that \nit does.  I guess i will no longer use it because you don&#39;t like it \nanymore and since you built it i will have to do as you say.\n\n-Steve H.\n\n\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@...&gt; \nwrote:\n&gt;\n&gt; \n&gt;  I would recommend extreme caution. Ego is a path to the dark side, \nand difficult to discern it is. If the RVG was that important, it \nwould be illogical for them not to &quot;make it work&quot; for me, since I \nmake the boxes.  I find linear much more consistent, easier to build, \ncauses less noise problems, and easier to understand. \n&gt;  \n&gt;  I have found &quot;the path&quot; usually leads to a bed of quicksand.\n&gt;  \n&gt;  Frank-S&gt; To: EVP-ITC@yahoogroups.com&gt; From: urkel23@...&gt; Date: \nSun, 3 Feb 2008 03:39:13 +0000&gt; Subject: [EVP-ITC] Re: File from \ntonight&gt; &gt; &gt; &gt; Frank, i&#39;m telling you it didn&#39;t work at all until \nrecently. They are &gt; making it work for a reason, they want me to \nbring your box and show &gt; others. Your box is the best communication \ni have right now and they &gt; told me that they want me to only be \nusing your box. The answers are &gt; clear and they answer right away. \nThis is my new path and they have &gt; specified i am here to teach \nothers, so that&#39;s what i will do.&gt; &gt; -Steve H.&gt; &gt; &gt;\n&gt; _________________________________________________________________\n&gt; Climb to the top of the charts!Play the word scramble challenge \nwith star power.\n&gt; http://club.live.com/star_shuffle.aspx?\nicid=starshuffle_wlmailtextlink_jan\n&gt;"}