{"id": "6710", "subject": "Re: File from tonight", "author": "purplespacefriend", "timestamp": "2008-02-03T05:17:50Z", "full_text": "I have noticed a disturbing trend of box users to develop what \nappears to be an ego based &quot;mission&quot; that seems to coincide with \nthese supposed technicains. You would think, since I make the boxes I \nwould get some assistence from the supopsoed technicains, but there \nis none! \n\n I do not know who or what communicates. I am unwilling to jump on \nthe higher spirit band wagon, as they seemly produce nothing useful, \nvery little verifiable information, nothing that makes life better, \nnothing that helps me make better boxes. I know only that something \ntalks that shouldn&#39;t be there, and that keeps me intrigued. As Sun \nBear used to say, &quot;They don&#39;t grow any corn&quot;.\n\n I have a &quot;group&quot; that insists I am their Space Princess, now how \nwise is it to just accept what they say, without question, being that \nI am niether female, nor Royalty!\n\n Curious that I make the boxes, but my input about it&#39;s use is so \neasily dismissed.\n\n There is at the very least, multiple levels that can be contacted, \nsome very manipulative, perhaps demonic if you want to go down that \nroad. If you want them to tell you how great you are, they will \ncertainly do so, that is why the caution. \n\n Frank-S\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;Robin Searcy Henson&quot; \n&lt;MudPuddleFarm@...&gt; wrote:\n&gt;\n&gt; Hi Frank, \n&gt; \n&gt; When you mention being distrustful of what comes through the boxes, \nare you saying you&#39;re skeptical of the &quot;technicians&quot; being who they \nsay they are?  Not trying to open another can of worms here, just \nwanting to continue learning from your experience and research.  I \nget what you&#39;re saying about becoming obsessive with the sessions.  \nI&#39;ve probably asked you this a half dozen times over the last couple \nof years, but who or what do YOU think you&#39;re/we&#39;re  communicating \nwith?\n&gt; \n&gt; Robin\n&gt; \n&gt; \n&gt;   ----- Original Message ----- \n&gt;   From: purplespacefriend&lt;mailto:purplealiengirl@...&gt; \n&gt;   To: EVP-ITC@yahoogroups.com&lt;mailto:EVP-ITC@yahoogroups.com&gt; \n&gt;   Sent: Saturday, February 02, 2008 7:46 PM\n&gt;   Subject: [EVP-ITC] Re: File from tonight\n&gt; \n&gt; \n&gt;   Have ya tried EVPmaker? It is based on that random principle, and \n&gt;   predates the boxes.\n&gt; \n&gt;   I&#39;ve heard this stuff before, about random being the best, and I \n&gt;   have to disaggree. I also think it unwise to spend every waking \n&gt;   moment doing sessions. I think it creates that expectation, and \n&gt;   perhaps desperation to make contact, and I would tend not to \ntrust \n&gt;   what comes through. \n&gt; \n&gt;   I don&#39;t trust some of this stuff because I have yet get any \n&gt;   meaningful assistence with the boxes from the so called \ntechnicians. \n&gt;   All I ever got was a telepathic &quot;suggestion&quot; to use the echo \nboxes. \n&gt;   Everything else was a assemblage of stuff I had worked on in hte \npast \n&gt;   to solve the problem of &quot;what else could I use&quot;. \n&gt; \n&gt;   I hate to see yet another go down the road of &quot;this is the \nonlyest \n&gt;   way&quot;. \n&gt; \n&gt;   Frank-S\n&gt;"}