{"id": "6724", "subject": "Re: File from tonight", "author": "bhali333", "timestamp": "2008-02-03T15:36:33Z", "full_text": "Steve,\nI will not get into another debate, your right I don&#39;t know what you \nhave been as of late. My comment was based on the many sessions we \nhad done together in the past. I respect your right to do your \nresearch however you see fit, but remember I knew you when ! So lets \nend this thread right here.\n\nbruce\n\n\n\n\n\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;Steve Hultay&quot; &lt;urkel23@...&gt; wrote:\n&gt;\n&gt; Bruce,\n&gt; \n&gt; I haven&#39;t asked for mike and lisa in quite a while because i felt \nit \n&gt; was silly doing that.  Maybe crutch was a poor choice of words on \nmy \n&gt; part, but we all have opinions and so far no one is right. \nRemember, \n&gt; we both have the same techs??  So, i figured to turn it on and ask \n&gt; who wants to speak with me and give others a chance to speak.  Mike \n&gt; and Lisa still come through every session in their same voice just \nto \n&gt; let me know they are there if i need them.  Besides i feel that \nthey \n&gt; must be busy getting loaned out to everybody.  My communication has \n&gt; escalated to a better level recently and i know we have worked \n&gt; together in the past, but we haven&#39;t in about a month and a half so \n&gt; don&#39;t tell others on here how i do box sessions.  You really don&#39;t \n&gt; know what i&#39;m doing and would only give new researchers bad \n&gt; information.  Although we should all work together at this, we all \n&gt; have different methods and that&#39;s what keep us tuned in to this \n&gt; message board every day.  Bruce, this is not an argument from me at \n&gt; all and i do respect what you do.  We just do things very \ndifferently \n&gt; now and that&#39;s why we no longer do research together, but a \ndifferent \n&gt; point of view is also good sometimes.\n&gt; \n&gt; -Steve H.\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, bruce halliday \n&gt; &lt;paranormalinvestigating@&gt; wrote:\n&gt; &gt;\n&gt; &gt; \n&gt; &gt; Robin,\n&gt; &gt;  \n&gt; &gt; I agree with Steve on a couple of points. First let me say that I\n&gt; &gt; do believe that we all have a &quot;technician/guide/guardian&quot; call \nthem \n&gt; what you\n&gt; &gt; may. but I usually call them by the names they introduced \n&gt; themselves by.\n&gt; &gt;  \n&gt; &gt; I know for a fact through many, many, many box sessions that when \nI \n&gt; turn\n&gt; &gt; a box on, could be Frank&#39;s box or the minibox or the RS 470 does \n&gt; not matter which.\n&gt; &gt;  \n&gt; &gt; The same two entities will come through immediately, So much so \n&gt; now, that I do not even ask for conformation that\n&gt; &gt; it is in fact them. I recognise their individual voice patterns. \nI \n&gt; have built a solid relationship with these two spirits\n&gt; &gt; I know as mike and Lisa so much so that I have even gotten to \nknow \n&gt; their individual personalities.\n&gt; &gt;  \n&gt; &gt; There are other newer researchers here that will attest to the \nfact \n&gt; that when they where doing their first sessions\n&gt; &gt; I had asked my two &quot;Friends&quot; Mike and Lisa to assist in getting \n&gt; them started and invariably the spirits that came \n&gt; &gt; through to these new researchers during their first sessions \n&gt; identified themselves as Mike and Lisa.\n&gt; &gt;  \n&gt; &gt; Steve says he does not turn on his box and use them as a crutch, \n&gt; that is not entirely true. I had done research \n&gt; &gt; very closely with Steve until recently and I would venture to say \n&gt; that 99% if not every session he starts with &quot;Mike & Lisa\n&gt; &gt; are you available to talk with me&quot; \n&gt; &gt;  \n&gt; &gt; Also I don&#39;t consider working with my technicians as using them \nas \n&gt; a crutch, They would not allow that.\n&gt; &gt; They are not there like butlers at our beckoned call when we feel \n&gt; they may be of some use.\n&gt; &gt; Quite the opposite, without them we would get no communication at \n&gt; all, they are allowing us the honor of receiving this \n&gt; &gt; celestial communication. They are the moderators, facilitators \nand \n&gt; generators of all we hear and send to and from the spirit realm.\n&gt; &gt; And they also stand as guards and protectors to do the best they \n&gt; can to keep us from being deceived or taken down a dark path.\n&gt; &gt;  \n&gt; &gt; Some here wait for others to state an opinion and then tend to \n&gt; agree with that opinion no matter what they have experienced to be \n&gt; true.\n&gt; &gt;  \n&gt; &gt; Robin, my advice to you as a new researcher in this field. Form \n&gt; your own beliefs through your experience and research.\n&gt; &gt; Listen and learn from others but do not let what you believe to \nbe \n&gt; true or not, be swayed by popular opinion.\n&gt; &gt;  \n&gt; &gt; Bruce\n&gt; &gt; Bruce Halliday \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; To: EVP-ITC@: MudPuddleFarm@: Sat, 2 Feb 2008 21:42:09 -\n&gt; 0800Subject: Re: [EVP-ITC] Re: File from tonight\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; Steve,\n&gt; &gt;  \n&gt; &gt; I certainly appreciate your thoughts.  In the back of my mind is \n&gt; always the question of whether we are being Deceived.  Just for the \n&gt; sake of argument, is it POSSIBLE we&#39;re being manipulated by \nsomething \n&gt; evil?  I&#39;m not frightened, and I won&#39;t stop my own research (the \n&gt; negative stuff just makes me more determined), but my mind does go \n&gt; there sometimes.  I hope that along with developing my &quot;ear&quot; I can \n&gt; acquire the gift of discernment.\n&gt; &gt;  \n&gt; &gt; Robin\n&gt; &gt;  \n&gt; &gt;  \n&gt; &gt; \n&gt; &gt; ----- Original Message ----- \n&gt; &gt; From: Steve Hultay \n&gt; &gt; To: EVP-ITC@...m \n&gt; &gt; Sent: Saturday, February 02, 2008 8:57 PM\n&gt; &gt; Subject: [EVP-ITC] Re: File from tonight:\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; Robin,If i may add my thoughts on this: There is no concrete \n&gt; evidence of who or what comes through is what they say they are. \n&gt; Technicians i have found were used to get you up and running and i \n&gt; only now call on them if i need assistance. I don&#39;t turn the boxes \non \n&gt; and ask for them like a crutch, i conduct my session and if i need \n&gt; help they will supply it to me if needed. I think the whole idea is \n&gt; to find out who we are communicating with, maybe we will never \nreally \n&gt; know for sure but i still try and find out as best as i can. -Steve \n&gt; H.--- In EVP-ITC@yahoogroups.com, &quot;Robin Searcy Henson&quot; \n&gt; &lt;MudPuddleFarm@&gt; wrote:&gt;&gt; Hi Frank, &gt; &gt; When you mention being \n&gt; distrustful of what comes through the boxes, are you saying you&#39;re \n&gt; skeptical of the &quot;technicians&quot; being who they say they are? Not \n&gt; trying to open another can of worms here, just wanting to continue \n&gt; learning from your experience and research. I get what you&#39;re \nsaying \n&gt; about becoming obsessive with the sessions. I&#39;ve probably asked you \n&gt; this a half dozen times over the last couple of years, but who or \n&gt; what do YOU think you&#39;re/we&#39;re communicating with?&gt; &gt; Robin&gt; &gt; &gt; ---\n--\n&gt;  Original Message ----- &gt; From: \n&gt; purplespacefriend&lt;mailto:purplealiengirl@&gt; &gt; To: EVP-\n&gt; ITC@yahoogroups.com&lt;mailto:EVP-ITC@yahoogroups.com&gt; &gt; Sent: \nSaturday, \n&gt; February 02, 2008 7:46 PM&gt; Subject: [EVP-ITC] Re: File from \ntonight&gt; \n&gt; &gt; &gt; Have ya tried EVPmaker? It is based on that random principle, \nand \n&gt; &gt; predates the boxes.&gt; &gt; I&#39;ve heard this stuff before, about random \n&gt; being the best, and I &gt; have to disaggree. I also think it unwise \nto \n&gt; spend every waking &gt; moment doing sessions. I think it creates that \n&gt; expectation, and &gt; perhaps desperation to make contact, and I would \n&gt; tend not to trust &gt; what comes through. &gt; &gt; I don&#39;t trust some of \n&gt; this stuff because I have yet get any &gt; meaningful assistence with \n&gt; the boxes from the so called technicians. &gt; All I ever got was a \n&gt; telepathic &quot;suggestion&quot; to use the echo boxes. &gt; Everything else \nwas \n&gt; a assemblage of stuff I had worked on in hte past &gt; to solve the \n&gt; problem of &quot;what else could I use&quot;. &gt; &gt; I hate to see yet another \ngo \n&gt; down the road of &quot;this is the onlyest &gt; way&quot;. &gt; &gt; Frank-S&gt;\n&gt; &gt;  \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; _________________________________________________________________\n&gt; &gt; Shed those extra pounds with MSN and The Biggest Loser!\n&gt; &gt; http://biggestloser.msn.com/\n&gt; &gt;\n&gt;"}