{"id": "6727", "subject": "I am so very sad.", "author": "Lisby", "timestamp": "2008-02-03T16:54:16Z", "full_text": "Frank surprised me yesterday, privately telling me he might come back  \nto this list. I was hoping he&#39;d pop up today and there would be a lot  \nof joy. I was very excited this morning, for a few short moments,  \nuntil I realized I&#39;d already missed Frank&#39;s return *and* his departure.\n\nI don&#39;t know if he will come back again. And I won&#39;t try to convince  \nhim.\n\nBut if Frank does come back, I hope you all can understand that you  \nare all in the same place at this time *because of Frank.*\n\nHe doesn&#39;t owe anyone an explanation for why he does what he does,  \nwith whom, and for whom. He doesn&#39;t need to believe that anyone is  \nmore special than anyone or more deserving.\n\nThings *are* getting a little messianic around here, HMO. And the one  \nthing I can say from watching this field for 30 years is that  \nmessiahs come and go and never really are. What is are the little  \nglimpses of life after death, in other dimensions, and seemingly all  \naround us, invisible. That is the *only* verifiable truth of this,  \nHMO: *Something* is out there and it will talk to you, if you let it.  \nBeyond that, we are in no way prepared to make definitive statements.\n\nNo one should be asking Frank for anything at this point. He should  \nbe free to gift his boxes on whomever he feels is the one that should  \nhave it--or not at all.\n\nBefore anyone jumps on me, yes, I used to ask for a box from him,  \nbecause there were no other alternatives then and because we had  \nknown each other on several other lists for about five years and were  \nfriends.\n\nBu now there are alternatives--lots of them. Buy a minibox, like I  \ndid. If that $400 price tag is too heavy, go to Radio Shack and make  \na hack. The radio, rechargeable batteries, and an adaptor cost us $70.\n\nNo one should be asking Frank for anything at this point. He should  \nbe free to gift his boxes on whomever he feels is the one that should  \nhave it--or on no one at all. He doesn&#39;t owe anyone anything. He  \nalready founded this feast.\n\nOkay, enough out of me. I&#39;m going to go weep in my tea.\n\nAnn"}