{"id": "6736", "subject": "Re: File from tonight", "author": "misujoey", "timestamp": "2008-02-03T17:45:35Z", "full_text": "Hi Bruce .. What happened on Halloween on SI??  I was planning to \nstop by!\n\nDebbie\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, bruce halliday \n&lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; \n&gt; Steve,\n&gt;  \n&gt; I listened to the file, It could have said what is labeled.\n&gt; It was kinda rough and I don&#39;t think anyone but an experienced\n&gt; researcher used to listening to Frank&#39;s box would hear anything\n&gt; from the random mode especially.\n&gt;  \n&gt; I think you may have gotten caught up in the moment, I know those \ngroup sessions can get exciting.\n&gt; My advice would be to hold off on any public display sessions until \nwe refine the communivation to \n&gt; where the average listener is capable of hearing a response. Don&#39;t \nforget what happened on halloween in staten Island.\n&gt; Or what happened to those knuckle heads at pulse radio.\n&gt;  \n&gt; I think it would be detrimental to the research not to go somewhere \nand have a group of people hear nothing but what \n&gt; they discern as noise. for the simple reason that they are not \nequiped to hear the actual responses.\n&gt;  \n&gt; Just my opinion as afriend and fellow researcher. also I believe \nour friend Frank believes that the box was not meant \n&gt; for field work and does not perform to the best of it&#39;s ability in \na public situation.\n&gt;  \n&gt; Bruce\n&gt; Bruce Halliday \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: urkel23@...: Sat, 2 Feb 2008 22:11:07 -\n0500Subject: [EVP-ITC] File from tonight\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;  \n&gt; I have been having weird sessions with Frank&#39;s Box #27, but in a \ngood way.  They told me to change the antenna, which it did and the \nrandom started working and never has on this box.  They told me \ntonight to put the old antenna back on and the sessions keep getting \nbetter and better.  I dragged Juli and Joel in on what i believed and \nfelt was going to be a great box session and here is a file only a \ncouple minutes in to our hour long session.  This is a bit rough \nsounding, but hearing it live is pretty clear and you can hear me \nrespond and than Joel agrees that he heard it too.  My sessions are \npretty incredible since the random mode started working on the FB#27 \nand i feel the random is the best thing out there...hands down.  I \nhave done Sessions on the internet through Skype all week and i feel \nthe energy between Juli and I are really bringing them through \nclearly.  I only use FB#27 now in random mode and it is the best \nfeature on any box, between the white noise, echo and random there is \nno competetion up to this point.  The hacks are good, but nothing is \nbetter than an original frank&#39;s box.  Our friends on the other side \ntold me that they fixed the random mode to go and teach others and i \nam going to a meeting on wednesday to demonstrate the different boxes \nand our friend made a promise to come though if i go....so we will \nsee.\n&gt;  \n&gt; Here is one of the files i got so far.\n&gt;  \n&gt; -Steve H.\n&gt; \n&gt; \n&gt; Who&#39;s never won? Biggest Grammy Award surprises of all time on AOL \nMusic.\n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Climb to the top of the charts!Play the word scramble challenge \nwith star power.\n&gt; http://club.live.com/star_shuffle.aspx?\nicid=starshuffle_wlmailtextlink_jan\n&gt;"}