{"id": "6742", "subject": "Re: [EVP-ITC] I am so very sad.", "author": "Lisby", "timestamp": "2008-02-03T18:24:45Z", "full_text": "All right then. Glad to know I&#39;m mistaken. Thanks for checking with him.\n\nI&#39;ll return to my previously scheduled programing.\n\nAnn\n\nOn Feb 3, 2008, at 1:16 PM, Misty Dawn wrote:\n\n&gt; Yep I have.\n&gt;\n&gt; Lisby &lt;lisby@...&gt; wrote:\n&gt;\n&gt; I don&#39;t suppose either of you has actually spoken to him?\n&gt;\n&gt; Not to overstep my boundaries or anything, mods.\n&gt;\n&gt; Ann\n&gt;\n&gt; On Feb 3, 2008, at 12:49 PM, Laura Kimberley wrote:\n&gt;\n&gt;&gt;\n&gt;&gt; Thanks Misty!!\n&gt;&gt; From: EVP-ITC@yahoogroups.com [mailto:EVP-ITC@yahoogroups.com] On  \n&gt;&gt; Behalf Of Misty Dawn\n&gt;&gt; Sent: Sunday, February 03, 2008 11:32 AM\n&gt;&gt; To: EVP-ITC@yahoogroups.com\n&gt;&gt; Subject: Re: [EVP-ITC] I am so very sad.\n&gt;&gt; He&#39;s still here LOL he just dumped that old email that was giving  \n&gt;&gt; him crap.\n&gt;&gt; Misty\n&gt;&gt;\n&gt;&gt; Lisby &lt;lisby@...&gt; wrote:\n&gt;&gt; Frank surprised me yesterday, privately telling me he might come back\n&gt;&gt; to this list. I was hoping he&#39;d pop up today and there would be a lot\n&gt;&gt; of joy. I was very excited this morning, for a few short moments,\n&gt;&gt; until I realized I&#39;d already missed Frank&#39;s return *and* his  \n&gt;&gt; departure.\n&gt;&gt;\n&gt;&gt; I don&#39;t know if he will come back again. And I won&#39;t try to convince\n&gt;&gt; him.\n&gt;&gt;\n&gt;&gt; But if Frank does come back, I hope you all can understand that you\n&gt;&gt; are all in the same place at this time *because of Frank.*\n&gt;&gt;\n&gt;&gt; He doesn&#39;t owe anyone an explanation for why he does what he does,\n&gt;&gt; with whom, and for whom. He doesn&#39;t need to believe that anyone is\n&gt;&gt; more special than anyone or more deserving.\n&gt;&gt;\n&gt;&gt; Things *are* getting a little messianic around here, HMO. And the one\n&gt;&gt; thing I can say from watching this field for 30 years is that\n&gt;&gt; messiahs come and go and never really are. What is are the little\n&gt;&gt; glimpses of life after death, in other dimensions, and seemingly all\n&gt;&gt; around us, invisible. That is the *only* verifiable truth of this,\n&gt;&gt; HMO: *Something* is out there and it will talk to you, if you let it.\n&gt;&gt; Beyond that, we are in no way prepared to make definitive statements.\n&gt;&gt;\n&gt;&gt; No one should be asking Frank for anything at this point. He should\n&gt;&gt; be free to gift his boxes on whomever he feels is the one that should\n&gt;&gt; have it--or not at all.\n&gt;&gt;\n&gt;&gt; Before anyone jumps on me, yes, I used to ask for a box from him,\n&gt;&gt; because there were no other alternatives then and because we had\n&gt;&gt; known each other on several other lists for about five years and were\n&gt;&gt; friends.\n&gt;&gt;\n&gt;&gt; Bu now there are alternatives--lots of them. Buy a minibox, like I\n&gt;&gt; did. If that $400 price tag is too heavy, go to Radio Shack and make\n&gt;&gt; a hack. The radio, rechargeable batteries, and an adaptor cost us  \n&gt;&gt; $70.\n&gt;&gt;\n&gt;&gt; No one should be asking Frank for anything at this point. He should\n&gt;&gt; be free to gift his boxes on whomever he feels is the one that should\n&gt;&gt; have it--or on no one at all. He doesn&#39;t owe anyone anything. He\n&gt;&gt; already founded this feast.\n&gt;&gt;\n&gt;&gt; Okay, enough out of me. I&#39;m going to go weep in my tea.\n&gt;&gt;\n&gt;&gt; Ann\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; Looking for last minute shopping deals? Find them fast with Yahoo!  \n&gt;&gt; Search.\n&gt;&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Be a better friend, newshound, and know-it-all with Yahoo! Mobile.  \n&gt; Try it now.\n&gt;\n&gt; \n\n\nAll igh hen. Glad o know I'm mis aken. Thanks o checking wi h him.I'll e u n o my p e iously scheduled p og aming.AnnOn Feb 3, 2008, a 1:16 PM, Mis y Dawn w o e:Yep I ha e. Lisby ne > w o e:I don' suppose ei he o you has ac ually spoken o him?No o o e s ep my bounda ies o any hing, mods.AnnOn Feb 3, 2008, a 12:49 PM, Lau a Kimbe ley w o e:Thanks Mis y!!F om: EVP-ITC@yahoog oups.com [mail o:EVP-ITC@yahoog oups.com] On Behal O  Mis y DawnSen : Sunday, Feb ua y 03, 2008 11:32 AMTo: EVP-ITC@yahoog oups.comSubjec : Re: [EVP-ITC] I am so e y sad.He's s ill he e LOL he jus dumped ha old email ha was gi ing him c ap.Mis yLisby ne > w o e:F ank su p ised me yes e day, p i a ely elling me he migh come back  o his lis . I was hoping he'd pop up oday and he e would be a lo  o joy. I was e y exci ed his mo ning, o a ew sho momen s, un il I ealized I'd al eady missed F ank's e u n *and* his depa u e.I don' know i he will come back again. And I won' y o con ince him.Bu i F ank does come back, I hope you all can unde s and ha you a e all in he same place a his ime *because o F ank.*He doesn' owe anyone an explana ion o why he does wha he does, wi h whom, and o whom. He doesn' need o belie e ha anyone is mo e special han anyone o mo e dese ing.Things *a e* ge ing a li le messianic a ound he e, HMO. And he one  hing I can say om wa ching his ield o 30 yea s is ha  messiahs come and go and ne e eally a e. Wha is a e he li le glimpses o li e a e dea h, in o he dimensions, and seemingly all a ound us, in isible. Tha is he *only* e i iable u h o his, HMO: *Some hing* is ou he e and i will alk o you, i you le i . Beyond ha , we a e in no way p epa ed o make de ini i e s a emen s.No one should be asking F ank o any hing a his poin . He should be ee o gi his boxes on whome e he eels is he one ha should ha e i --o no a all.Be o e anyone jumps on me, yes, I used o ask o a box om him, because he e we e no o he al e na i es hen and because we had known each o he on se e al o he lis s o abou i e yea s and we e  iends.Bu now he e a e al e na i es--lo s o hem. Buy a minibox, like I did. I ha $400 p ice ag is oo hea y, go o Radio Shack and make a hack. The adio, echa geable ba e ies, and an adap o cos us $70.No one should be asking F ank o any hing a his poin . He should be ee o gi his boxes on whome e he eels is he one ha should ha e i --o on no one a all. He doesn' owe anyone any hing. He al eady ounded his eas .Okay, enough ou o me. I'm going o go weep in my ea.AnnLooking o las minu e shopping deals? Find hem as wi h Yahoo! Sea ch. Be a be e iend, newshound, and know-i -all wi h Yahoo! Mobile. T y i now."}