{"id": "6754", "subject": "Re: File from tonight", "author": "misujoey", "timestamp": "2008-02-03T20:33:10Z", "full_text": "Hi Bruce ... so they demonstrated the &quot;box&quot; for regular people .. not \nparanormal people who understand &quot;box&quot;?? (It&#39;s almost like learning a \nnew language at first!!) eeee that must&#39;ve been tough!!  I saw \nthe &quot;box&quot; being demonstrated there once before that .. I was \nimpressed but remember that there was reception problems inside the \nmuseum ... \n\nDebbie\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, bruce halliday \n&lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; \n&gt; Hi Deb,\n&gt;  \n&gt; Let&#39;s just say, when any researcher tries to do a public box \nsession for people that \n&gt; have not only never heard a box but did not even know what one is \nuntil the actual demonstration.\n&gt;  \n&gt; Let&#39;s just say you will have 99.9% of the people walking away \ngoing &quot;what was that, the guy was listening to a scrambled radio\n&gt; and asking it questions&quot;\n&gt;  \n&gt; The chances are, even if the audience where familiar with the box \nand the theory and technical functioning that allows for real time \ncommunication\n&gt; with spirits. they would not on their first or maybe even their \ntenth attempt hear any words or responses to questions.\n&gt;  \n&gt; Not to mention, the demonstrator better hope that he or she has \nsomewhat favorable conditions for a successful session.\n&gt; It is just not a good practice unless your audience has some \nknowledge and experience with a box of some type.\n&gt;  \n&gt; Any public session I have heard of left the majority of individuals \ninvolved with a sour taste for box research.\n&gt; And that includes Staten Island ,Halloween night or so I&#39;ve been \ntold. by the presenter himself.\n&gt;  \n&gt; That&#39;s why if you ask the original box inventor he will tell you \nthat his intention was for the box to be a stationary research tool.\n&gt; not a location device.\n&gt;  \n&gt; Bruce\n&gt; Bruce Halliday \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: Debbie@...: Sun, 3 Feb 2008 17:45:35 +0000Subject: \n[EVP-ITC] Re: File from tonight\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Hi Bruce .. What happened on Halloween on SI?? I was planning to \nstop by!Debbie--- In EVP-ITC@yahoogroups.com, bruce halliday \n&lt;paranormalinvestigating@&gt; wrote:&gt;&gt; &gt; Steve,&gt; &gt; I listened to the \nfile, It could have said what is labeled.&gt; It was kinda rough and I \ndon&#39;t think anyone but an experienced&gt; researcher used to listening \nto Frank&#39;s box would hear anything&gt; from the random mode especially.&gt; \n&gt; I think you may have gotten caught up in the moment, I know those \ngroup sessions can get exciting.&gt; My advice would be to hold off on \nany public display sessions until we refine the communivation to &gt; \nwhere the average listener is capable of hearing a response. Don&#39;t \nforget what happened on halloween in staten Island.&gt; Or what happened \nto those knuckle heads at pulse radio.&gt; &gt; I think it would be \ndetrimental to the research not to go somewhere and have a group of \npeople hear nothing but what &gt; they discern as noise. for the simple \nreason that they are not equiped to hear the actual responses.&gt; &gt; \nJust my opinion as afriend and fellow researcher. also I believe our \nfriend Frank believes that the box was not meant &gt; for field work and \ndoes not perform to the best of it&#39;s ability in a public situation.&gt; \n&gt; Bruce&gt; Bruce Halliday &gt; &gt; &gt; To: EVP-ITC@: urkel23@: Sat, 2 Feb 2008 \n22:11:07 -0500Subject: [EVP-ITC] File from tonight&gt; &gt; &gt; &gt; &gt; &gt; &gt; I \nhave been having weird sessions with Frank&#39;s Box #27, but in a good \nway. They told me to change the antenna, which it did and the random \nstarted working and never has on this box. They told me tonight to \nput the old antenna back on and the sessions keep getting better and \nbetter. I dragged Juli and Joel in on what i believed and felt was \ngoing to be a great box session and here is a file only a couple \nminutes in to our hour long session. This is a bit rough sounding, \nbut hearing it live is pretty clear and you can hear me respond and \nthan Joel agrees that he heard it too. My sessions are pretty \nincredible since the random mode started working on the FB#27 and i \nfeel the random is the best thing out there...hands down. I have done \nSessions on the internet through Skype all week and i feel the energy \nbetween Juli and I are really bringing them through clearly. I only \nuse FB#27 now in random mode and it is the best feature on any box, \nbetween the white noise, echo and random there is no competetion up \nto this point. The hacks are good, but nothing is better than an \noriginal frank&#39;s box. Our friends on the other side told me that they \nfixed the random mode to go and teach others and i am going to a \nmeeting on wednesday to demonstrate the different boxes and our \nfriend made a promise to come though if i go....so we will see.&gt; &gt; \nHere is one of the files i got so far.&gt; &gt; -Steve H.&gt; &gt; &gt; Who&#39;s never \nwon? Biggest Grammy Award surprises of all time on AOL Music.&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; __________________________________________________________&gt; \nClimb to the top of the charts! Play the word scramble challenge with \nstar power.&gt; http://club.live.com/star_shuffle.aspx?\nicid=starshuffle_wlmailtextlink_jan&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Connect and share in new ways with Windows Live.\n&gt; http://www.windowslive.com/share.html?\nocid=TXT_TAGHM_Wave2_sharelife_012008\n&gt;"}