{"id": "6759", "subject": "Re: File from tonight", "author": "LC Duplatt", "timestamp": "2008-02-03T22:22:22Z", "full_text": "LOL!  I&#39;m with you, Ron!  ;)\n\nLC\n\n--- In EVP-ITC@yahoogroups.com, Ron Lederer &lt;ronriko@...&gt; wrote:\n&gt;\n&gt; Good point LC.   You did get responses that the whole group could \nwitness and participate in.  I would guess the outcome would be quite \ndifferent for participants if the message could only be heard by the \nconductor or the messages were not readily discernible.  I am not \ndoing group presentations...yet...and I would hesitate at this point \nto share a session with other than my wife, who already knows I&#39;m out \nthere.  Cheers   Ron L\n&gt; \n&gt; LC Duplatt &lt;lcdupla@...&gt; wrote:           Ron,\n&gt; \n&gt; When I ran a group (5 of us) session two weeks ago, I had members \nof \n&gt; the group formulate questions and I did the asking for about an 8 \n&gt; minute session or so. They could not hear the responses aloud, as I \n&gt; had the audio piped directly into a mixer, then outputted to the \n&gt; recorder (but I could hear & had on headphones to listen in).\n&gt; \n&gt; I immediately then uploaded the audio to my laptop, and began \nplaying \n&gt; the audio aloud, allowing the group to help me analyze what we had \n&gt; captured. We received great messages that were not lower level, but \n&gt; sentences of information (not just &quot;hi,&quot; &quot;yes,&quot; &quot;no,&quot; etc). \n&gt; \n&gt; So, I would like to add to this discussion that group sessions can \n&gt; work well, but it may depend on how you do it and what the \nintentions \n&gt; are.\n&gt; \n&gt; LC\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Ron Lederer &lt;ronriko@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hi Steve Just to jump in with a friendly point of view. I was \n&gt; really appreciative of you providing the videos on the boxes. One \n&gt; reason for my excitement is because I wanted to see the new RS 125 \n&gt; that I have ordered. The other reason was because I want to \n&gt; introduce a techie type friend to this whole phenomena and I \nthought \n&gt; your presentation would be a good starting point. After watching \n&gt; your video you satisfied my first interest, but I chose not to \nrefer \n&gt; my friend to the video. I found the video to be very interesting \n&gt; and I was only a little disappointed that responses to your \nquestions \n&gt; did not come across to my ear. But I could only imagine how a \nnewbie \n&gt; like my friend would react. Even though he is a techie, I think he \n&gt; would have wanted to HEAR something from the other side. I felt \nthat \n&gt; someone who did not previously know about the successful sessions \n&gt; that so many researchers have had here, would have experienced a \nguy \n&gt; talking to himself or, worse yet, asking\n&gt; &gt; questions to a radio and then answering himself. Again, I think \n&gt; someone who takes the time to see such a presentation also wants to \n&gt; see the results. After all, getting a message from the other end is \n&gt; the purpose of what&#39;s being done. Audience expectations should not \n&gt; be underestimated. Hope this helps. Thanks again for the \n&gt; videos. Ron L \n&gt; &gt; \n&gt; &gt; Steve Hultay &lt;urkel23@&gt; wrote: \n&gt; &gt; I appreciate the concern, however i have learned from the past \n&gt; &gt; experience. I was going to go and do a brief background on my \n&gt; &gt; limited time so far in ITC and box research and maybe turn the \n&gt; &gt; different devices on for those to hear how each one sounds. I \n&gt; &gt; probably wasn&#39;t going to ask questions due to the halloween event \n&gt; &gt; when i received no spiritual contacts, but that wasn&#39;t a meeting \n&gt; &gt; either where i could explain what i was doing. I also am going to \n&gt; &gt; bring the 4 spare hacked 470 radios i have to offer to potential \n&gt; &gt; future researchers. Nothing is etched in stone yet with me going, \ni \n&gt; &gt; have to contact them first and see if that&#39;s what they want. I \nwas \n&gt; &gt; supposed to go in November, but declined because i wasn&#39;t ready \nto \n&gt; &gt; display yet. Now, there is so many different radios out there \nthat \n&gt; i \n&gt; &gt; can offer the idea for those who wish to approach this research \n&gt; with \n&gt; &gt; an open mind.\n&gt; &gt; \n&gt; &gt; -Steve H.\n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, bruce halliday \n&gt; &gt; &lt;paranormalinvestigating@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; \n&gt; &gt; &gt; Steve,\n&gt; &gt; &gt; \n&gt; &gt; &gt; I listened to the file, It could have said what is labeled.\n&gt; &gt; &gt; It was kinda rough and I don&#39;t think anyone but an experienced\n&gt; &gt; &gt; researcher used to listening to Frank&#39;s box would hear anything\n&gt; &gt; &gt; from the random mode especially.\n&gt; &gt; &gt; \n&gt; &gt; &gt; I think you may have gotten caught up in the moment, I know \nthose \n&gt; &gt; group sessions can get exciting.\n&gt; &gt; &gt; My advice would be to hold off on any public display sessions \n&gt; until \n&gt; &gt; we refine the communivation to \n&gt; &gt; &gt; where the average listener is capable of hearing a response. \n&gt; Don&#39;t \n&gt; &gt; forget what happened on halloween in staten Island.\n&gt; &gt; &gt; Or what happened to those knuckle heads at pulse radio.\n&gt; &gt; &gt; \n&gt; &gt; &gt; I think it would be detrimental to the research not to go \n&gt; somewhere \n&gt; &gt; and have a group of people hear nothing but what \n&gt; &gt; &gt; they discern as noise. for the simple reason that they are not \n&gt; &gt; equiped to hear the actual responses.\n&gt; &gt; &gt; \n&gt; &gt; &gt; Just my opinion as afriend and fellow researcher. also I \nbelieve \n&gt; &gt; our friend Frank believes that the box was not meant \n&gt; &gt; &gt; for field work and does not perform to the best of it&#39;s ability \n&gt; in \n&gt; &gt; a public situation.\n&gt; &gt; &gt; \n&gt; &gt; &gt; Bruce\n&gt; &gt; &gt; Bruce Halliday \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; To: EVP-ITC@: urkel23@: Sat, 2 Feb 2008 22:11:07 -\n&gt; &gt; 0500Subject: [EVP-ITC] File from tonight\n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; I have been having weird sessions with Frank&#39;s Box #27, but in \na \n&gt; &gt; good way. They told me to change the antenna, which it did and \nthe \n&gt; &gt; random started working and never has on this box. They told me \n&gt; &gt; tonight to put the old antenna back on and the sessions keep \n&gt; getting \n&gt; &gt; better and better. I dragged Juli and Joel in on what i believed \n&gt; and \n&gt; &gt; felt was going to be a great box session and here is a file only \na \n&gt; &gt; couple minutes in to our hour long session. This is a bit rough \n&gt; &gt; sounding, but hearing it live is pretty clear and you can hear me \n&gt; &gt; respond and than Joel agrees that he heard it too. My sessions \nare \n&gt; &gt; pretty incredible since the random mode started working on the \n&gt; FB#27 \n&gt; &gt; and i feel the random is the best thing out there...hands down. I \n&gt; &gt; have done Sessions on the internet through Skype all week and i \n&gt; feel \n&gt; &gt; the energy between Juli and I are really bringing them through \n&gt; &gt; clearly. I only use FB#27 now in random mode and it is the best \n&gt; &gt; feature on any box, between the white noise, echo and random \nthere \n&gt; is \n&gt; &gt; no competetion up to this point. The hacks are good, but nothing \nis \n&gt; &gt; better than an original frank&#39;s box. Our friends on the other \nside \n&gt; &gt; told me that they fixed the random mode to go and teach others \nand \n&gt; i \n&gt; &gt; am going to a meeting on wednesday to demonstrate the different \n&gt; boxes \n&gt; &gt; and our friend made a promise to come though if i go....so we \nwill \n&gt; &gt; see.\n&gt; &gt; &gt; \n&gt; &gt; &gt; Here is one of the files i got so far.\n&gt; &gt; &gt; \n&gt; &gt; &gt; -Steve H.\n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; Who&#39;s never won? Biggest Grammy Award surprises of all time on \n&gt; AOL \n&gt; &gt; Music.\n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; __________________________________________________________\n&gt; &gt; &gt; Climb to the top of the charts! Play the word scramble \nchallenge \n&gt; &gt; with star power.\n&gt; &gt; &gt; http://club.live.com/star_shuffle.aspx?\n&gt; &gt; icid=starshuffle_wlmailtextlink_jan\n&gt; &gt; &gt;\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; ---------------------------------\n&gt; &gt; Be a better friend, newshound, and know-it-all with Yahoo! \nMobile. \n&gt; Try it now.\n&gt; &gt;\n&gt; \n&gt; \n&gt; \n&gt;                          \n&gt; \n&gt;        \n&gt; ---------------------------------\n&gt; Never miss a thing.   Make Yahoo your homepage.\n&gt;"}