{"id": "6770", "subject": "Re: [EVP-ITC] Re: File from tonight", "author": "Lisby", "timestamp": "2008-02-03T19:54:55Z", "full_text": "I don&#39;t think it excludes using it as a location device, however. The  \nissue is the audience, not the location. If you&#39;re on location,  \npersonally experimenting, it seems to function just fine in many cases.\n\nThe issue here is not taking a chance in front of an audience. I feel  \nmore than a bit conflicted about what the answer to that properly is.\n\nAnn\n\nOn Feb 3, 2008, at 1:24 PM, bruce halliday wrote:\n\n&gt; Hi Deb,\n&gt;\n&gt; Let&#39;s just say, when any researcher tries to do a public box  \n&gt; session for people that\n&gt; have not only never heard a box but did not even know what one is  \n&gt; until the actual demonstration.\n&gt;\n&gt; Let&#39;s just say you will have 99.9% of the people walking away going  \n&gt; &quot;what was that, the guy was listening to a scrambled radio\n&gt; and asking it questions&quot;\n&gt;\n&gt; The chances are, even if the audience where familiar with the box  \n&gt; and the theory and technical functioning that allows for real time  \n&gt; communication\n&gt; with spirits. they would not on their first or maybe even their  \n&gt; tenth attempt hear any words or responses to questions.\n&gt;\n&gt; Not to mention, the demonstrator better hope that he or she has  \n&gt; somewhat favorable conditions for a successful session.\n&gt; It is just not a good practice unless your audience has some  \n&gt; knowledge and experience with a box of some type.\n&gt;\n&gt; Any public session I have heard of left the majority of individuals  \n&gt; involved with a sour taste for box research.\n&gt; And that includes Staten Island ,Halloween night or so I&#39;ve been  \n&gt; told. by the presenter himself.\n&gt;\n&gt; That&#39;s why if you ask the original box inventor he will tell you  \n&gt; that his intention was for the box to be a stationary research tool.\n&gt; not a location device.\n&gt;\n&gt; Bruce\n&gt;\n&gt;\n&gt;\n&gt; Bruce Halliday\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; From: Debbie@...\n&gt; Date: Sun, 3 Feb 2008 17:45:35 +0000\n&gt; Subject: [EVP-ITC] Re: File from tonight\n&gt;\n&gt; Hi Bruce .. What happened on Halloween on SI?? I was planning to\n&gt; stop by!\n&gt;\n&gt; Debbie\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, bruce halliday\n&gt; &lt;paranormalinvestigating@...&gt; wrote:\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Steve,\n&gt; &gt;\n&gt; &gt; I listened to the file, It could have said what is labeled.\n&gt; &gt; It was kinda rough and I don&#39;t think anyone but an experienced\n&gt; &gt; researcher used to listening to Frank&#39;s box would hear anything\n&gt; &gt; from the random mode especially.\n&gt; &gt;\n&gt; &gt; I think you may have gotten caught up in the moment, I know those\n&gt; group sessions can get exciting.\n&gt; &gt; My advice would be to hold off on any public display sessions until\n&gt; we refine the communivation to\n&gt; &gt; where the average listener is capable of hearing a response. Don&#39;t\n&gt; forget what happened on halloween in staten Island.\n&gt; &gt; Or what happened to those knuckle heads at pulse radio.\n&gt; &gt;\n&gt; &gt; I think it would be detrimental to the research not to go somewhere\n&gt; and have a group of people hear nothing but what\n&gt; &gt; they discern as noise. for the simple reason that they are not\n&gt; equiped to hear the actual responses.\n&gt; &gt;\n&gt; &gt; Just my opinion as afriend and fellow researcher. also I believe\n&gt; our friend Frank believes that the box was not meant\n&gt; &gt; for field work and does not perform to the best of it&#39;s ability in\n&gt; a public situation.\n&gt; &gt;\n&gt; &gt; Bruce\n&gt; &gt; Bruce Halliday\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; To: EVP-ITC@...: urkel23@...: Sat, 2 Feb 2008 22:11:07 -\n&gt; 0500Subject: [EVP-ITC] File from tonight\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; I have been having weird sessions with Frank&#39;s Box #27, but in a\n&gt; good way. They told me to change the antenna, which it did and the\n&gt; random started working and never has on this box. They told me\n&gt; tonight to put the old antenna back on and the sessions keep getting\n&gt; better and better. I dragged Juli and Joel in on what i believed and\n&gt; felt was going to be a great box session and here is a file only a\n&gt; couple minutes in to our hour long session. This is a bit rough\n&gt; sounding, but hearing it live is pretty clear and you can hear me\n&gt; respond and than Joel agrees that he heard it too. My sessions are\n&gt; pretty incredible since the random mode started working on the FB#27\n&gt; and i feel the random is the best thing out there...hands down. I\n&gt; have done Sessions on the internet through Skype all week and i feel\n&gt; the energy between Juli and I are really bringing them through\n&gt; clearly. I only use FB#27 now in random mode and it is the best\n&gt; feature on any box, between the white noise, echo and random there is\n&gt; no competetion up to this point. The hacks are good, but nothing is\n&gt; better than an original frank&#39;s box. Our friends on the other side\n&gt; told me that they fixed the random mode to go and teach others and i\n&gt; am going to a meeting on wednesday to demonstrate the different boxes\n&gt; and our friend made a promise to come though if i go....so we will\n&gt; see.\n&gt; &gt;\n&gt; &gt; Here is one of the files i got so far.\n&gt; &gt;\n&gt; &gt; -Steve H.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Who&#39;s never won? Biggest Grammy Award surprises of all time on AOL\n&gt; Music.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; __________________________________________________________\n&gt; &gt; Climb to the top of the charts! Play the word scramble challenge\n&gt; with star power.\n&gt; &gt; http://club.live.com/star_shuffle.aspx?\n&gt; icid=starshuffle_wlmailtextlink_jan\n&gt; &gt;\n&gt;\n&gt;\n&gt;\n&gt; Connect and share in new ways with Windows Live. Get it now!\n&gt;\n&gt; \n\n\nI don' hink i excludes using i as a loca ion de ice, howe e . The issue is he audience, no he loca ion. I you' e on loca ion, pe sonally expe imen ing, i seems o unc ion jus ine in many cases.The issue he e is no aking a chance in on o an audience. I eel mo e han a bi con lic ed abou wha he answe o ha p ope ly is.AnnOn Feb 3, 2008, a 1:24 PM, b uce halliday w o e:Hi Deb, Le 's jus say, when any esea che ies o do a public box session o people ha  ha e no only ne e hea d a box bu did no e en know wha one is un il he ac ual demons a ion. Le 's jus say you will ha e 99.9% o he people walking away going \"wha was ha , he guy was lis ening o a sc ambled adioand asking i ques ions\" The chances a e, e en i he audience whe e amilia wi h he box and he heo y and echnical unc ioning ha allows o eal ime communica ionwi h spi i s. hey would no on hei i s o maybe e en hei en h a emp hea any wo ds o esponses o ques ions. No o men ion, he demons a o be e hope ha he o she has somewha a o able condi ions o a success ul session.I is jus no a good p ac ice unless you audience has some knowledge and expe ience wi h a box o some ype. Any public session I ha e hea d o le he majo i y o indi iduals in ol ed wi h a sou as e o box esea ch.And ha includes S a en Island ,Halloween nigh o so I' e been old. by he p esen e himsel . Tha 's why i you ask he o iginal box in en o he will ell you ha his in en ion was o he box o be a s a iona y esea ch ool.no a loca ion de ice. B uceB uce Halliday To: EVP-ITC@yahoog oups.comF om: Debbie@1800Hea en.comDa e: Sun, 3 Feb 2008 17:45:35 +0000Subjec : [EVP-ITC] Re: File om onigh Hi B uce .. Wha happened on Halloween on SI?? I was planning o s op by!Debbie--- In EVP-ITC@yahoog oups.com, b uce halliday a ing@...> w o e:>> > S e e,> > I lis ened o he ile, I could ha e said wha is labeled.> I was kinda ough and I don' hink anyone bu an expe ienced> esea che used o lis ening o F ank's box would hea any hing> om he andom mode especially.> > I hink you may ha e go en caugh up in he momen , I know hose g oup sessions can ge exci ing.> My ad ice would be o hold o on any public display sessions un il we e ine he communi a ion o > whe e he a e age lis ene is capable o hea ing a esponse. Don'   o ge wha happened on halloween in s a en Island.> O wha happened o hose knuckle heads a pulse adio.> > I hink i would be de imen al o he esea ch no o go somewhe e and ha e a g oup o people hea no hing bu wha  > hey disce n as noise. o he simple eason ha hey a e no  equiped o hea he ac ual esponses.> > Jus my opinion as a iend and ellow esea che . also I belie e ou iend F ank belie es ha he box was no mean  > o ield wo k and does no pe o m o he bes o i 's abili y in a public si ua ion.> > B uce> B uce Halliday > > > To: EVP-ITC@...: u kel23@...: Sa , 2 Feb 2008 22:11:07 -0500Subjec : [EVP-ITC] File om onigh > > > > > > > I ha e been ha ing wei d sessions wi h F ank's Box #27, bu in a good way. They old me o change he an enna, which i did and he  andom s a ed wo king and ne e has on his box. They old me  onigh o pu he old an enna back on and he sessions keep ge ing be e and be e . I d agged Juli and Joel in on wha i belie ed and  el was going o be a g ea box session and he e is a ile only a couple minu es in o ou hou long session. This is a bi ough sounding, bu hea ing i li e is p e y clea and you can hea me  espond and han Joel ag ees ha he hea d i oo. My sessions a e p e y inc edible since he andom mode s a ed wo king on he FB#27 and i eel he andom is he bes hing ou he e...hands down. I ha e done Sessions on he in e ne h ough Skype all week and i eel  he ene gy be ween Juli and I a e eally b inging hem h ough clea ly. I only use FB#27 now in andom mode and i is he bes   ea u e on any box, be ween he whi e noise, echo and andom he e is no compe e ion up o his poin . The hacks a e good, bu no hing is be e han an o iginal ank's box. Ou iends on he o he side  old me ha hey ixed he andom mode o go and each o he s and i am going o a mee ing on wednesday o demons a e he di e en boxes and ou iend made a p omise o come hough i i go....so we will see.> > He e is one o he iles i go so a .> > -S e e H.> > > Who's ne e won? Bigges G ammy Awa d su p ises o all ime on AOL Music.> > > > > > > > __________________________________________________________> Climb o he op o he cha s! Play he wo d sc amble challenge wi h s a powe .> h p://club.li e.com/s a _shu le.aspx?icid=s a shu le_wlmail ex link_jan>Connec and sha e in new ways wi h Windows Li e. Ge i now!"}