{"id": "6788", "subject": "Re: [EVP-ITC] EVP Session Log Sheet", "author": "juli velazquez", "timestamp": "2008-02-04T17:31:22Z", "full_text": "--0-575686528-1202146282=:31442\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nRon\n              You are more than welcome!  I am glad it has helped you as well as some others to get the most out of their sessions.  I like the question answer revisions you made, which can also assist when you conduct a dual session.  \n   \n                Several of us in the past have gotten together to do sessions via the internet.  I enjoy listening when others are contributing, noting the responses coming over, even though I have not asked the question.  I like to write the &quot;so called&quot; answer pertaining to that specific question down and see if in fact the others heard the same response during that period of time.  As you may have already discovered that even though you have preplanned to concentrate on one area of questioning, the &quot;spirits&quot; may just have something else on their agenda and go in a completely different direction (in which this is where your note session is an asset).  \n   \n  When  I turn any of the boxes on, I immediately start my recorder whether I am asking questions or not.  I like to run the box now prior to an question and/or answer session, with out saying a word (like Frank does) just to see what they may be discussing at that time. You just might be amazed at the conversations they are having without acknowledging us.  I have compared it to a gathering of friends gossiping over a cup of coffee and in this life time if you were to interrupt one of your friends just might find it offensive.  Therefore, when they are finished, they will bring you into the conversation or identifying you by name.\n   \n   I just go with the flow, and with each session seems to be a new and exciting adventure for me!  \n   \n   In addition I also have been exchanging my raw audio with others (mainly Joel) who in-turn seems to confirm or deny the clips that I believe I hear.   I just recently video taped a session and upon reviewing my actual data I have come to discover that the video captured very clear audio in which I either missed or overlooked on my recorder.  This has been my experience with conventional EVP and various recorders so I am not suprised that this would be any different.  It does however add another venue and opportunity to get capture as much audio as possible.  For you never know just what you could have missed.\n   \n  I wish everyone the best of luck with all their sessions and boxes, no matter what way to conduct your sessions, the results and possitive and most enjoyable to listen too!\n   \n  Juli\n   \n                 \n\nRon Lederer &lt;ronriko@...&gt; wrote:\n            Recently, Juli posted a Box Log Sheet in her file, that can be used for EVP sessions.  I want to thank Juli here for the post and to say I have been using the form to help me to organize my sessions.  Before the form, I was making notes on scrap paper about my questions, answers, etc. and at times I thought I would remember what went on during a session and would write it up later.  The results were....well...disorganization.  \n   \n  When I began using Juli&#39;s form, my sessions improved.  I had my questions written down before the session, which I think will help both sides of the communication becasue it keeps me from just grabbing my equipment and running off without prior thought.  I made a space on her form for recording notes so I know exactly where a question comes in a session and any response I that I think I heard.  In short I really feel more organized.  \n   \n  Since I am in a situation where I get week signals and I patch directly in to my recorder, it is important to me to be able to record the data from my recorder while I am recording.  For this reason I have changed Juli&#39;s form to include 10 questions and a place to log recording settings for each question.  This way I have a log of all sessions, questions and answers which I can refer to at any time without turning on my recorder and sorting through many minutes of recordings.  \n   \n  I also reduced the form to 1/2 page to save paper.  I have attached the modified form. Maybe it will useful to someone else.  Thanks again Juli.   Ron L\n    \n---------------------------------\n  Never miss a thing. Make Yahoo your homepage.   \n\n                         \n\n\n\n\n  The contents of this eletronic correspondence is private & confidential and meant only for the party and/or parties it is addressed to.  \n   \n  No part of this email transmission may be publicly posted or forwarded to other parties without explicit written permission.\n\n\r\n--0-575686528-1202146282=:31442\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;DIV&gt;Ron&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; You are more than welcome!&nbsp; I am glad it has helped you as well as some others to get the most out of their sessions.&nbsp; I like the question answer revisions&nbsp;you made, which can also assist when you conduct a dual session.&nbsp; &lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Several of us in the past have gotten together to do sessions via the internet.&nbsp; I enjoy listening when others are contributing, noting the responses coming over, even though I have not asked the question.&nbsp; I like to write the &quot;so called&quot; answer pertaining to that specific&nbsp;question down and see if in fact the others heard the same response during that period of time.&nbsp; As you may have already discovered that even though you have preplanned to concentrate on one area of questioning, the &quot;spirits&quot; may just have\n something else on their agenda and go in a completely different direction (in which this is where your note session is an asset).&nbsp; &lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;When &nbsp;I turn any of the boxes on, I immediately start my recorder whether I am asking questions or not.&nbsp; I like to run the box now prior to an question and/or answer session, with out saying a word (like Frank does) just to see what they may be discussing at that time.&nbsp;You just&nbsp;might be amazed at the conversations they&nbsp;are having without acknowledging us.&nbsp;&nbsp;I have compared it to a gathering of friends gossiping over a cup of coffee and in this life time if you&nbsp;were to interrupt one&nbsp;of your friends just might find it offensive.&nbsp; Therefore, when they are&nbsp;finished, they&nbsp;will bring you into the conversation or identifying you by name.&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;I just go with the flow, and with each session seems to be a new and exciting\n adventure for me!&nbsp; &lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;In addition I also&nbsp;have been exchanging my raw audio with&nbsp;others (mainly Joel) who in-turn seems&nbsp;to&nbsp;confirm or deny&nbsp;the clips that I believe I hear.&nbsp; &nbsp;I just recently video taped a session and upon reviewing my actual data I have come to discover that the video captured very clear audio in which I either missed or overlooked on my recorder.&nbsp; This has been my experience with conventional EVP and various recorders so I am not suprised that this would be any different.&nbsp; It does however add another venue and opportunity to get capture as much audio as possible.&nbsp; For you never know just what you could have missed.&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;I wish everyone the best of luck with all their sessions and boxes, no matter what way to conduct your sessions, the results and possitive and most enjoyable to listen too!&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;Juli&lt;/DIV&gt; \n &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;Ron Lederer &lt;ronriko@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/DIV&gt;  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;DIV&gt;  &lt;DIV&gt;Recently, Juli posted a Box Log Sheet in her file, that can be used for EVP sessions.&nbsp; I want to thank Juli here for the post and to say I have been using the form to help me to organize my sessions.&nbsp; Before the form, I was making notes on scrap paper about my questions, answers, etc. and at times I thought I would remember what went on during a session and would write it up\n later.&nbsp; The results were....well.&lt;WBR&gt;..disorganizatio&lt;WBR&gt;n.&nbsp; &lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;When I began using Juli&#39;s form, my sessions improved.&nbsp; I had my questions written down before the session, which I think will help both sides of the communication becasue it keeps me from just grabbing my equipment and running off without prior thought.&nbsp; I made a space on her form for recording notes so I know exactly where a question comes in a session and any response I that I think I heard.&nbsp; In short I really feel more organized.&nbsp; &lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;Since I am in a situation where I get week signals and I patch directly in to my recorder, it is important to me to be able to record the data from my recorder while I am recording.&nbsp; For this reason I have changed Juli&#39;s form to include 10 questions and a place to&nbsp;log recording settings&nbsp;for each question.&nbsp; This way I have a log of all sessions, questions and answers\n which I&nbsp;can refer to at any time without turning on my recorder and sorting through many minutes of recordings.&nbsp; &lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;I also reduced the form to 1/2 page to save paper.&nbsp; I have attached the modified form.&nbsp;Maybe it will useful to&nbsp;someone else.&nbsp; Thanks again Juli.&nbsp;&nbsp; Ron L&lt;/DIV&gt;  &lt;DIV&gt;  &lt;HR SIZE=1&gt;  Never miss a thing. &lt;A href=&quot;http://us.rd.yahoo.com/evt=51438/*http://www.yahoo.com/r/hs&quot;&gt;Make Yahoo your homepage.&lt;/A&gt;   &lt;DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;&lt;DIV&gt;  &lt;div&gt;&lt;EM&gt;&lt;STRONG&gt;&lt;FONT color=#0000ff&gt;The contents of this eletronic correspondence is private &amp; confidential and meant only for the party and/or parties it is addressed to.&nbsp; &lt;/FONT&gt;&lt;/STRONG&gt;&lt;/EM&gt;&lt;/div&gt;  &lt;div&gt;&lt;EM&gt;&lt;STRONG&gt;&lt;FONT color=#0000ff&gt;&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/EM&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;&lt;EM&gt;&lt;STRONG&gt;&lt;FONT color=#0000ff&gt;No part of this email transmission may be publicly posted or forwarded to other parties without explicit written permission.&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/EM&gt;&lt;/div&gt;&lt;/DIV&gt;\r\n--0-575686528-1202146282=:31442--"}