{"id": "679", "subject": "Me not hear correct.", "author": "Frank Sumption", "timestamp": "2007-01-31T14:54:24Z", "full_text": "------=_NextPart_000_61f6_65e3_793b\r\nContent-Type: text/plain; format=flowed\r\n\r\nNow I hear this very different from the other day &quot;you are the key to this \n(Reversed) they&#39;re coming to know&quot;. I don&#39;t like attention, and definitely \nnot the center of anyone&#39;s attention!  Sounds like more all nighters to me!! \nI stayed up almost all night Monday so I could build yet another board, \nwhile I&#39;m working I have these other ideas floating around in my head, \nwaiting for a place to land. Like revisiting Spircom, and trying to apply \nwhat I know to it, thanks to Ryan! I think if I were to make a square wave \naudio generator, since a square wave contains all hamonics, randomly tune it \nto get that random function, then use that to modulate a simple transmtter, \nthen receive that signal on a simple reciever a short distance away, maybe I \ncan do something like Meek did. The transmitter/receiver can be made with \nmixer chips, like the SA602, and I have some in my junk box (a techy&#39;s parts \nbins). Then the audio circuits are again just op amps, and I just got an \norder in.\n\n  I&#39;ve often wondered about the possiblity of modulating a White Noise \nsignal, then listening for a response on a White Noise based receiver, using \nWhite Noise instead of a local oscillator, yeah, using normal voice to \nmodulate the noise. You could use crystal filters to narrow the transmission \nto a small RF spectrum, something easy, like around 10mhz, but I&#39;m not sure \nif ultra sound might not be better, since there&#39;s  some that claim that&#39;s \nwhere the spirits hang out. We need an Edison set up, a room full of \nresearchers testing ideas.\n\nFrank\n\n_________________________________________________________________\nGet live scores and news about your team: Add the Live.com Football Page  \nhttp://www.live.com/?addtemplate=football\n\r\n------=_NextPart_000_61f6_65e3_793b\r\nContent-Type: audio/mpeg; name=&quot;YouAllowThePriestsIn-(R)They&#39;reComingTomorrow-EQ-stretched.mp3&quot;\r\nContent-Disposition: attachment;\n filename=&quot;YouAllowThePriestsIn-(R)They&#39;reComingTomorrow-EQ-stretched.mp3&quot;\r\n\r\n[ Attachment content not displayed ]\r\n------=_NextPart_000_61f6_65e3_793b--"}