{"id": "6793", "subject": "Re: for ann Re: [EVP-ITC] can&#39;t open email files or post s from a few members-help", "author": "Lisby", "timestamp": "2008-02-04T18:50:01Z", "full_text": "Ron--isn&#39;t this the file I worked on before? Did the wrong one get  \nattached?\n\nAnn\n\nOn Feb 2, 2008, at 10:34 AM, Ron Lederer wrote:\n\n&gt;\n&gt; Not sure about an MP3 player on my computer but I have MS Media  \n&gt; Center and Windows Media Player to handle music etc.  Don&#39;t know  \n&gt; much more about how to handle your MP3 files.  I suppose your apple  \n&gt; is more sophisticated.  If others are opening your file I would  \n&gt; think I should be able to also.\n&gt;\n&gt; I just checked another member&#39;s file and I was able to open and  \n&gt; listen to her MP3 file.  So something else is up with you and me.   \n&gt; Also, you had sent me a file via personal email and I am able to  \n&gt; open and listen to it.  Will keep trying.   Ron L\n&gt;\n&gt; Lisby &lt;lisby@...&gt; wrote:\n&gt; Ron--I&#39;m posting MP3s. Do you have an MP3 player on your computer?\n&gt;\n&gt; Ann\n&gt;\n&gt; On Feb 1, 2008, at 10:47 PM, Ron Lederer wrote:\n&gt;\n&gt;&gt; Anything I can do at my end so I can open Ann&#39;s, Steve&#39;s and a  \n&gt;&gt; couple other files and posts.  Not one of Ann&#39;s opens and  \n&gt;&gt; occasionaly I get into steve&#39;s ok.  I get a pop up sign on my  \n&gt;&gt; media player that says &quot;Cannot play file...&quot;  Ron L\n&gt;&gt;\n&gt;&gt; Never miss a thing. Make Yahoo your homepage.\n&gt;&gt;\n&gt;\n&gt;\n&gt;\n&gt; Looking for last minute shopping deals? Find them fast with Yahoo!  \n&gt; Search.\n&gt;\n&gt; \n\n\nRon--isn' his he ile I wo ked on be o e? Did he w ong one ge a ached?AnnOn Feb 2, 2008, a 10:34 AM, Ron Lede e w o e:No su e abou an MP3 playe on my compu e bu I ha e MS Media Cen e and Windows Media Playe o handle music e c.  Don' know much mo e abou how o handle you MP3 iles.  I suppose you apple is mo e sophis ica ed.  I o he s a e opening you ile I would hink I should be able o also.  I jus checked ano he membe 's ile and I was able o open and lis en o he MP3 ile.  So some hing else is up wi h you and me.  Also, you had sen me a ile ia pe sonal email and I am able o open and lis en o i .  Will keep ying.   Ron LLisby ne > w o e:Ron--I'm pos ing MP3s. Do you ha e an MP3 playe on you compu e ?AnnOn Feb 1, 2008, a 10:47 PM, Ron Lede e w o e:Any hing I can do a my end so I can open Ann's, S e e's and a couple o he iles and pos s.  No one o Ann's opens and occasionaly I ge in o s e e's ok.  I ge a pop up sign on my media playe ha says \"Canno play ile...\"  Ron LNe e miss a hing. Make Yahoo you homepage.Looking o las minu e shopping deals? Find hem as wi h Yahoo! Sea ch."}