{"id": "6802", "subject": "Re: Twins", "author": "purplespacefriend", "timestamp": "2008-02-05T04:48:35Z", "full_text": "Yeah, it never bothered me much even getting cussing voices, it&#39;just \nthat fact that something talks that keeps me hooked. \n\n Frank\n\n--- In EVP-ITC@yahoogroups.com, Marlboro63@... wrote:\n&gt;\n&gt; Hi Frank,\n&gt;  \n&gt; It is nice to see you back here again.  And I love your screen  \nname.  You \n&gt; are right when you say you can never force or coerce a spirit to  \ncommunicate \n&gt; with.  For those that are able to communicate with them we do  feel \nextremely \n&gt; priviledged and honored that they have chosen to do so.   Even when \nthere is no \n&gt; communication just listening and hearing what they have to  say is \nvery \n&gt; amazing in itself.  What they say may not always be nice but  maybe \nthey know more \n&gt; about us than we give them credit for?\n&gt;  \n&gt; Jeff\n&gt;  \n&gt;  \n&gt; In a message dated 2/3/2008 11:52:08 P.M. Central Standard Time,  \n&gt; purplealiengirl@... writes:\n&gt; \n&gt;  \n&gt;  \n&gt;  \n&gt; I made one today, same as the last except I can adjust the sweep  \nlevel, and \n&gt; where in the band the sweep starts, or do manual sweep. I used to  \nput this \n&gt; function in the boxes, but no one used it, too busy asking stupid  \nquestions, or \n&gt; showing the world what great mediums they were cuz they had a  \nbox,  so I \n&gt; started leaving it out to save parts, and front panel  space. \n&gt; \n&gt; I don&#39;t think you can force, or coerce spirit, I&#39;ve  always thought \nit best \n&gt; just to allow. \n&gt; \n&gt; Curious--these  are for me a change, and they are flying together. \nNever \n&gt; before  have I made a board in 24 hours, it required only a slight \nshift in the  \n&gt; concept.  \n&gt; \n&gt; Frank-S\n&gt; \n&gt;  \n&gt; ____________________________________\n&gt; Climb to the top of the charts! Play the word scramble challenge \nwith  star \n&gt; power. _Play now!_ \n&gt; (http://club.live.com/star_shuffle.aspx?\nicid=starshuffle_wlmailtextlink_jan)   \n&gt; \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; **************Biggest Grammy Award surprises of all time on AOL \nMusic.     \n&gt; (http://music.aol.com/grammys/pictures/never-won-a-grammy?\nNCID=aolcmp003000000025\n&gt; 48)\n&gt;"}