{"id": "6843", "subject": "Re: Greetings from a New Member", "author": "Steve Hultay", "timestamp": "2008-02-05T23:02:35Z", "full_text": "Nellie,\n\nThat one file &quot;What are you to me?&quot;  A man answers clearly i believe \nsays &quot;Nothing&quot;.  That is a real EVP, probably a class A and that did \nnot come from the box.  That was spoken directly into your recorder.  \nI get them on occasion, i feel that only happens with a grounded \nspirit in a location and is confused by the box....Maybe (I don&#39;t \nKnow)  It sounds somewhat logical though.\n\nAnyway, Great Files and welcome to the group !!!\n\n-Steve H.\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;Nellie Kampmann&quot; &lt;rednellie@...&gt; \nwrote:\n&gt;\n&gt; Hi!  My name is Nellie and I am a new convert to ITC work.  I&#39;ve \nbeen\n&gt; doing evps for a few years with a fair amount of success.  One of \nthe\n&gt; things I have been experimenting with is using music.  I play music\n&gt; from the lifetimes of the spirits I&#39;m trying to communicate with to\n&gt; get the spirits intrigued enough to talk more.  I took a quick look \nat\n&gt; some of the old messages here, and will definitely have to \nexperiment\n&gt; with some of the suggestions you all have had about using music as\n&gt; more of a carrier wave to make it easier for them to speak through.\n&gt; \n&gt; What drew me to this group, though, is that I just made a Radio \nShack\n&gt; hack a couple of days ago and have been completely stunned by the\n&gt; results.  I&#39;m getting more communications through it in 15 minutes\n&gt; than I would usually get in evps over hours.  I am absolutely blown\n&gt; away.  Even more interesting is that a spirit in my house who I&#39;ve\n&gt; never been able to get evps from is quite the chatterbox through the\n&gt; hack.  I have a couple of my first files in the folder Nellie&#39;s \nFiles\n&gt; that I found particularly interesting.\n&gt; \n&gt; http://tech.groups.yahoo.com/group/EVP-ITC/files/Nellie%27s%20Files/\n&gt; \n&gt; Anyway, I am looking forward to learning from/with you all.\n&gt; \n&gt; Nellie Kampmann\n&gt;"}