{"id": "6848", "subject": "Re: [EVP-ITC] Ann in answer to your question", "author": "Lisby", "timestamp": "2008-02-06T00:34:12Z", "full_text": "Oh yes--it does. It&#39;s the same theory I share, but I was wondering  \nwhat Mike and Lisa&#39;s answer would be. :)\n\nAnn\n\nOn Feb 5, 2008, at 6:52 PM, bhali333 wrote:\n\n&gt; Ann,\n&gt;\n&gt; I have come to the conclusion it is that when I receive a response\n&gt; like &quot;wait&quot; or &quot;I&#39;ll ask&quot; or &quot;not yet&quot; in response to asking for\n&gt; contact with\n&gt; another spirit other than a tech. The spirit that is asked for comes\n&gt; through\n&gt; in one of two ways depending on what spiritual plane that individual\n&gt; spirit resides on.\n&gt;\n&gt; I have been able to discern from communications with mike and Lisa\n&gt; that there exists\n&gt; more than one spiritual plane, the first is where our spirit awakens\n&gt; after making the\n&gt; transition from the physical. this is supposedly the only plane that\n&gt; communication with\n&gt; the physical world is capable of being sent from.\n&gt;\n&gt; When a spirit moves from this first plane to the next changes in the\n&gt; enlightenment of the spirit take place.\n&gt; The details pertaining to that are to complex to receive with our\n&gt; rudimentary equipment, evidently it can not be\n&gt; explained in short phrases or sentences. which is completely logical.\n&gt;\n&gt; To get back to the question, when a researcher asks for a spirit to\n&gt; be brought forward so they can communicate.\n&gt; The tech must locate that spirit energy and summon it to the place\n&gt; where the communication is facilitated.\n&gt; If the spirit has moved on to a higher plane of existence it must\n&gt; travel back to this lower plane to communicate.\n&gt;\n&gt; Apparently spirits that have moved up can return to the lower\n&gt; spiritual planes but spirits that have not yet\n&gt; ascended to a higher plane can not advance.\n&gt;\n&gt; I am assuming that when a spirit is called by a tech to communicate\n&gt; with the physical if it is possible it will\n&gt; journey to the communication point. If it is not possible for the\n&gt; spirit to come to that point for whatever reason\n&gt; I expect that they try to form a communication link from one point to\n&gt; another, and the tech must act as a telephone operator if you will.\n&gt;\n&gt; that is the best way I understand how to explain it, I hope it\n&gt; answers your question Ann.\n&gt;\n&gt; Bruce\n&gt;\n&gt;\n&gt; \n\n\nOh yes--i does. I 's he same heo y I sha e, bu I was wonde ing wha Mike and Lisa's answe would be. :)AnnOn Feb 5, 2008, a 6:52 PM, bhali333 w o e:Ann,I ha e come o he conclusion i is ha when I ecei e a esponselike \"wai \" o \"I'll ask\" o \"no ye \" in esponse o asking o  con ac wi h ano he spi i o he han a ech. The spi i ha is asked o comes  h ough in one o wo ways depending on wha spi i ual plane ha indi idual spi i esides on.I ha e been able o disce n om communica ions wi h mike and Lisa  ha he e exis smo e han one spi i ual plane, he i s is whe e ou spi i awakens a e making he  ansi ion om he physical. his is supposedly he only plane ha  communica ion wi h  he physical wo ld is capable o being sen om.When a spi i mo es om his i s plane o he nex changes in he enligh enmen o he spi i ake place.The de ails pe aining o ha a e o complex o ecei e wi h ou   udimen a y equipmen , e iden ly i can no beexplained in sho ph ases o sen ences. which is comple ely logical.To ge back o he ques ion, when a esea che asks o a spi i o be b ough o wa d so hey can communica e.The ech mus loca e ha spi i ene gy and summon i o he place whe e he communica ion is acili a ed.I he spi i has mo ed on o a highe plane o exis ence i mus   a el back o his lowe plane o communica e.Appa en ly spi i s ha ha e mo ed up can e u n o he lowe  spi i ual planes bu spi i s ha ha e no ye ascended o a highe plane can no ad ance.I am assuming ha when a spi i is called by a ech o communica e wi h he physical i i is possible i will jou ney o he communica ion poin . I i is no possible o he spi i o come o ha poin o wha e e easonI expec ha hey y o o m a communica ion link om one poin o ano he , and he ech mus ac as a elephone ope a o i you will. ha is he bes way I unde s and how o explain i , I hope i  answe s you ques ion Ann.B uce"}