{"id": "6849", "subject": "Re: Paranormal State!?", "author": "rosemary_guiley", "timestamp": "2008-02-06T01:08:30Z", "full_text": "I just write for the A&E blog, covering paranormal topics, I don&#39;t\nhave anything to do with the show.\n\nRosemary\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@...&gt;\nwrote:\n&gt;\n&gt; \n&gt;  At the risk of being negative yet again, all I can say is --You\nhave got to be friggin&#39; kidding!? No wonder all the &#39;serious\nresearchers&#39; call it entertainment, cuz shows like that put this work\nback with Barnum and Baily! I think they take urban myths, like the\nhaunted piano, and do a show on it, with all actors. Their demonolgist\nsupposedly worked on the Amityville case, ya mean the Hollywood\nversion, cuz the real case was nothin!?  Just watch the people\ninvolved, and you can tell they are actors, with speech training, not\na single um, ah, or stutter ever uttered! It&#39;s all just too well\nrehearshed and scripted for me to watch any more of it.   Some Googele\nresults for &#39;haunted piano&#39;; \nhttp://paranormal.about.com/library/blstory_august04_17.htm  &#39;YouTube\n- Haunted Piano Edited \n&gt; \n&gt; \n&gt; \n&gt; The classical version of the Haunted Piano is now renewed and better\nthan ever! Again, It&#39;s a documentary about a haunted house and a piano\nthat plays by ...www.youtube.com/watch?v=aBnOXfnR7WM - 73k - Cached -\nSimilar pages&#39;  &#39;Ghosts - Supernatural Message Boards &gt; Haunted Piano \n&gt; \n&gt; \n&gt; \n&gt; I have investigated a place a couple of years ago that had a haunted\npiano that had been in a fire. It was very interesting, the piano\ndidn&#39;t sound right\n...www.ghostvillage.com/ghostcommunity/lofiversion/index.php/t8231.html\n- 15k - Cached - Similar pages&#39;  haunted piano - Truveo Video Search\n&gt; \n&gt; \n&gt; \n&gt; woke up nd sumone was lpayin mah piano but nobody was there.. i was\nso scared..www.truveo.com/haunted-piano/id/4113464547 - 97k - Cached -\nSimilar pages\n&gt;  Haunted Piano - Ghosts - Supernatural Message Boards \n&gt;  \n&gt;  \n&gt;  Frank-S\n&gt; _________________________________________________________________\n&gt; Connect and share in new ways with Windows Live.\n&gt;\nhttp://www.windowslive.com/share.html?ocid=TXT_TAGHM_Wave2_sharelife_012008\n&gt;"}