{"id": "6852", "subject": "Re: Paranormal State!?", "author": "LC Duplatt", "timestamp": "2008-02-06T02:41:18Z", "full_text": "LOL ;)\n\nLC\n\n--- In EVP-ITC@yahoogroups.com, bruce halliday \n&lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; \n&gt; LC,\n&gt;  \n&gt; We all know that most of the paranormal community, given the \nopportunity would choose \n&gt; a cheesy tv sci fi ghostie show complete with mirrors, bed sheets \nand scary sound effects.\n&gt; over legitimate selfless paranormal research purely for research&#39;s \nsake.\n&gt;  \n&gt; But if it were not for these type of shows what would all the self \nproclaimed psychic mediums\n&gt; and paranormal experts do? crossword puzzles. Don&#39;t you realise \nthat it is shows like this and taps that\n&gt; have shown that anyone that can afford an emf detector, voice \nrecorder and camcorder with nightshot\n&gt; and a brand new shinny silver case to carry it all in, can start a \nparanormal investigating society and\n&gt; pay their entry fee to get into places like eastern state penn. and \ncollect &quot;REAL&quot; paranormal evidence.\n&gt;  \n&gt; maybe we should try that and stop killing ourselves doing real \nresearch and trying to gather legitimate evidence.\n&gt;  \n&gt; come on you guy&#39;s knew I had to throw my 2 cents in!\n&gt;  \n&gt; Bruce\n&gt;  \n&gt;  \n&gt; Bruce Halliday \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: lcdupla@...: Tue, 5 Feb 2008 17:49:14 \n+0000Subject: [EVP-ITC] Re: Paranormal State!?\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; I just got to add to FS&#39; point with respect to Paranormal State. \nAnyone notice Ron Milione (TAPS gadget electronics expert) appeared \non Paranormal State as now a &quot;demon expert,&quot; identifying an EVP on \nthe show as a &quot;demon&quot; by the sound of its voice on the recording?Then \nI saw Ron on the History Channel&#39;s UFO Hunters as a UFO \nresearcher/expert. I&#39;m trying to keep count, but that makes him a \nelectronics guru, UFO expert and demonologist! Nice guy, but I think \nhe just has a great agent that can get him these &quot;roles.&quot; Also, I saw \na lady have her home investigated by the Penn State bunch on \nParanormal State and supposedly in need of their help, then I turn \nthe channel and see her as a paranormal investigator on Ghost Hunters \nInternational! She must have a great agent, too. ;)LC --- In EVP-\nITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@&gt; wrote:&gt;&gt; &gt; At \nthe risk of being negative yet again, all I can say is --You have got \nto be friggin&#39; kidding!? No wonder all the &#39;serious researchers&#39; call \nit entertainment, cuz shows like that put this work back with Barnum \nand Baily! I think they take urban myths, like the haunted piano, and \ndo a show on it, with all actors. Their demonolgist supposedly worked \non the Amityville case, ya mean the Hollywood version, cuz the real \ncase was nothin!? Just watch the people involved, and you can tell \nthey are actors, with speech training, not a single um, ah, or \nstutter ever uttered! It&#39;s all just too well rehearshed and scripted \nfor me to watch any more of it. Some Googele results for &#39;haunted \npiano&#39;; \nhttp://paranormal.about.com/library/blstory_august04_17.htm &#39;YouTube -\n Haunted Piano Edited &gt; &gt; &gt; &gt; The classical version of the Haunted \nPiano is now renewed and better than ever! Again, It&#39;s a documentary \nabout a haunted house and a piano that plays \nby ...www.youtube.com/watch?v=aBnOXfnR7WM - 73k - Cached - Similar \npages&#39; &#39;Ghosts - Supernatural Message Boards &gt; Haunted Piano &gt; &gt; &gt; &gt; \nI have investigated a place a couple of years ago that had a haunted \npiano that had been in a fire. It was very interesting, the piano \ndidn&#39;t sound \nright ...www.ghostvillage.com/ghostcommunity/lofiversion/index.php/t82\n31.html - 15k - Cached - Similar pages&#39; haunted piano - Truveo Video \nSearch&gt; &gt; &gt; &gt; woke up nd sumone was lpayin mah piano but nobody was \nthere.. i was so scared..www.truveo.com/haunted-piano/id/4113464547 - \n97k - Cached -Similar pages&gt; Haunted Piano - Ghosts - Supernatural \nMessage Boards &gt; &gt; &gt; Frank-S&gt; \n__________________________________________________________&gt; Connect \nand share in new ways with Windows Live.&gt; \nhttp://www.windowslive.com/share.html?\nocid=TXT_TAGHM_Wave2_sharelife_012008&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Climb to the top of the charts!Play the word scramble challenge \nwith star power.\n&gt; http://club.live.com/star_shuffle.aspx?\nicid=starshuffle_wlmailtextlink_jan\n&gt;"}