{"id": "6875", "subject": "Re: Paranormal State!?", "author": "purplespacefriend", "timestamp": "2008-02-06T04:48:46Z", "full_text": "Thanks, glad it&#39;s just not me noticing that stuff. I wouldn&#39;t mind, \nit probably helps get some attention to this stuff, but it also helps \ncarry on the old Hollywood versions of spirit. \n\n Frank-S\n--- In EVP-ITC@yahoogroups.com, &quot;LC Duplatt&quot; &lt;lcdupla@...&gt; wrote:\n&gt;\n&gt; I just got to add to FS&#39; point with respect to Paranormal State.  \n&gt; \n&gt; Anyone notice Ron Milione (TAPS gadget electronics expert) appeared \n&gt; on Paranormal State as now a &quot;demon expert,&quot; identifying an EVP on \n&gt; the show as a &quot;demon&quot; by the sound of its voice on the recording?\n&gt; \n&gt; Then I saw Ron on the History Channel&#39;s UFO Hunters as a UFO \n&gt; researcher/expert.  I&#39;m trying to keep count, but that makes him a \n&gt; electronics guru, UFO expert and demonologist!  Nice guy, but I \nthink \n&gt; he just has a great agent that can get him these &quot;roles.&quot;  \n&gt; \n&gt; Also, I saw a lady have her home investigated by the Penn State \nbunch \n&gt; on Paranormal State and supposedly in need of their help, then I \nturn \n&gt; the channel and see her as a paranormal investigator on Ghost \nHunters \n&gt; International!  She must have a great agent, too.  ;)\n&gt; \n&gt; LC  \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@&gt; \n&gt; wrote:\n&gt; &gt;\n&gt; &gt; \n&gt; &gt;  At the risk of being negative yet again, all I can say is --You \n&gt; have got to be friggin&#39; kidding!? No wonder all the &#39;serious \n&gt; researchers&#39; call it entertainment, cuz shows like that put this \nwork \n&gt; back with Barnum and Baily! I think they take urban myths, like the \n&gt; haunted piano, and do a show on it, with all actors. Their \n&gt; demonolgist supposedly worked on the Amityville case, ya mean the \n&gt; Hollywood version, cuz the real case was nothin!?  Just watch the \n&gt; people involved, and you can tell they are actors, with speech \n&gt; training, not a single um, ah, or stutter ever uttered! It&#39;s all \njust \n&gt; too well rehearshed and scripted for me to watch any more of it.   \n&gt; Some Googele results for &#39;haunted piano&#39;;  \n&gt; \nhttp://paranormal.about.com/library/blstory_august04_17.htm  &#39;YouTube \n&gt; - Haunted Piano Edited \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; The classical version of the Haunted Piano is now renewed and \n&gt; better than ever! Again, It&#39;s a documentary about a haunted house \nand \n&gt; a piano that plays by ...www.youtube.com/watch?v=aBnOXfnR7WM - 73k -\n \n&gt; Cached - Similar pages&#39;  &#39;Ghosts - Supernatural Message Boards &gt; \n&gt; Haunted Piano \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; I have investigated a place a couple of years ago that had a \n&gt; haunted piano that had been in a fire. It was very interesting, the \n&gt; piano didn&#39;t sound \n&gt; \nright ...www.ghostvillage.com/ghostcommunity/lofiversion/index.php/t82\n&gt; 31.html - 15k - Cached - Similar pages&#39;  haunted piano - Truveo \nVideo \n&gt; Search\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; woke up nd sumone was lpayin mah piano but nobody was there.. i \nwas \n&gt; so scared..www.truveo.com/haunted-piano/id/4113464547 - 97k - \nCached -\n&gt;  Similar pages\n&gt; &gt;  Haunted Piano - Ghosts - Supernatural Message Boards \n&gt; &gt;  \n&gt; &gt;  \n&gt; &gt;  Frank-S\n&gt; &gt; _________________________________________________________________\n&gt; &gt; Connect and share in new ways with Windows Live.\n&gt; &gt; http://www.windowslive.com/share.html?\n&gt; ocid=TXT_TAGHM_Wave2_sharelife_012008\n&gt; &gt;\n&gt;"}