{"id": "6881", "subject": "Re: [EVP-ITC] Re: File from tonight--Bruce", "author": "juli velazquez", "timestamp": "2008-02-06T04:53:44Z", "full_text": "--0-1871085226-1202273624=:19598\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nRobin:\n             I don&#39;t think you motives are selfish at all.  I am a firm believer that everything happens for a reason and that people are brought into your life for a purpose as well.  You are lead down certain paths, some which you have not clue as how they came about, but nevertheless your on that road. \n   \n              I truly feel that the otherside knows of the sincere dedication of many in this group (for the files prove this) and hope the best is yet to come. There are a lot of new comers to box research and hope that with everyones contributions we will all be able to get some of the answers we seek as well as reconnected with our loved ones who have gone before us.\n   \n             Juli\n\nRobin Searcy Henson &lt;MudPuddleFarm@...&gt; wrote:\n              I very much value and appreciate everyone participating in this forum.   My selfish motive in wanting to contact the other side is my hope to hear from loved ones who have passed.  I couldn&#39;t admit this a couple of years ago because the idea of being contacted by my dead parents terrified me.  Now I long for it.  I believe guardian angels have intervened on my behalf in the past and continue to watch over me.  I&#39;ve had mystic experiences during times of crisis that make me know a spiritual world exists.  How wonderful it must be to hear their voices first hand!  I&#39;ll remind myself every day never to take any of what happens for granted.\n   \n  Robin\n   \n  \n    ----- Original Message ----- \n  From: bruce halliday \n  To: evp-itc@yahoogroups.com \n  Sent: Monday, February 04, 2008 6:58 AM\n  Subject: RE: [EVP-ITC] Re: File from tonight--Bruce\n  \n\n    Robin,\n \nI very much appreciate your comments and confidence in me, but at the end of the day I&#39;m no different than anyone else.\nThe only thing that may set me apart from some of the other researchers here is that I have a bit more experience and \nbeing disabled allows me a lot more time for research. I am always willing and hopefully able to help new researchers with \nmy advice and knowledge I have gained through experience. But my ideology is not the end all explanation or truth of box research\nall opinions here are valuable and deserving of consideration and attention.\n \nAs for your question, the fact that I am blessed enough to receive a fairly good level of communication I believe is based once \nagain on the relationship I have built with my tech/guides and the synchronization of energy we have developed.\nThe level of communication we are at I believe is only the very tip of the iceberg. My goal in &quot;MY&quot; research is to reach a level of communication that \nallows us to speak easily and freely with our spirit friends in a fluid and continual fashion as if having a pleasant telephone conversation.\n \nThe gist of the messages I am receiving now are directed toward our spirit counterparts achieving the same goal. It is already a comfort to me to know they are there and I have had the opportunity to speak with close family members and friends that have crossed over. And also recently Ms. Sarah Estep who has made the transition and is beginning to work now on the\nspirit side to further the communication. Any information I receive from the spirits I recognise to be friends is invaluable. Something as simple as a yes or no answer to a direct question that has just been asked is a small miracle in and of itself. considering how it was attained and where it is from. Most researchers I think after a certain amount of time succumb to the human flaw of complacency and take for granted that when they turn a box on they will receive communication. They loose site of the fact that this communication is a precious gift to mankind and eventually will change the way we perceive life and death.\n \nI don&#39;t know if my thinking or opinions are lucid or the rantings of a mad man, I&#39;m sure a lot of people would say both. For what it is worth this is how I believe on the questions you asked.\nfor better or worse.\n \nBruce\n\n\n  Bruce Halliday \n\n\n\n\n    \n---------------------------------\n  To: EVP-ITC@yahoogroups.com\nFrom: MudPuddleFarm@...\nDate: Sun, 3 Feb 2008 18:35:14 -0800\nSubject: Re: [EVP-ITC] Re: File from tonight--Bruce\n\n          It&#39;s always refreshing to read your input Bruce.  Funny thing is, I recognize Mike and Lisa on your recordings too.  I&#39;m aware that they are acting as facilitators and guardians, that they are consistent in their ability to use varied modes of communication, and that their contact appears to be purposeful, as compared to so much that seems to have no rhyme or reason.  \n   \n  As a newbie I&#39;m admittedly intimidated by and in awe of the results you more experienced researchers are accomplishing.  What I find most awesome is that everyone can have different methods, belief systems and opinions and come together in one forum to share and learn from one another.  I feel so lucky to have found you!  Bruce, your ability to hear and accurately repeat my one posted EVP is the only validation I&#39;ve personally ever received that makes me know I&#39;m involved in something real and life altering.  I&#39;m supposed to be here!  I think a big part of my education will continue to come from the knowledge and experience you all are willing to keep sharing.  It&#39;s also a fact that each of us needs to find his/her own individual truth.  \n   \n  I&#39;m still troubled by the possibility that we could be pawns in Someone Else&#39;s science experiment.  I can sense Frank&#39;s cynicism related to the messages being meaningless and the messengers being untrustworthy.  In your own case, what is the goal?  Is the fact that you&#39;ve established communication and continue to communicate enough?  Are we hoping to gain invaluable information from our guides, or just to have the comfort of knowing they are there?  \n   \n  This is the week I&#39;ve promised myself to start doing sessions with the Radio Shack hacks!  \n   \n  Robin\n   \n   \n   \n   \n   \n  hoogroups.com \n    Sent: Sunday, February 03, 2008 6:25 AM\n  Subject: RE: [EVP-ITC] Re: File from tonight\n  \n\n    Robin,\n \nI agree with Steve on a couple of points. First let me say that I\ndo believe that we all have a &quot;technician/guide/guardian&quot; call them what you\nmay. but I usually call them by the names they introduced themselves by.\n \nI know for a fact through many, many, many box sessions that when I turn\na box on, could be Frank&#39;s box or the minibox or the RS 470 does not matter which.\n \nThe same two entities will come through immediately, So much so now, that I do not even ask for conformation that\nit is in fact them. I recognise their individual voice patterns. I have built a solid relationship with these two spirits\nI know as mike and Lisa so much so that I have even gotten to know their individual personalities.\n \nThere are other newer researchers here that will attest to the fact that when they where doing their first sessions\nI had asked my two &quot;Friends&quot; Mike and Lisa to assist in getting them started and invariably the spirits that came \nthrough to these new researchers during their first sessions identified themselves as Mike and Lisa.\n \nSteve says he does not turn on his box and use them as a crutch, that is not entirely true. I had done research \nvery closely with Steve until recently and I would venture to say that 99% if not every session he starts with &quot;Mike & Lisa\nare you available to talk with me&quot; \n \nAlso I don&#39;t consider working with my technicians as using them as a crutch, They would not allow that.\nThey are not there like butlers at our beckoned call when we feel they may be of some use.\nQuite the opposite, without them we would get no communication at all, they are allowing us the honor of receiving this \ncelestial communication. They are the moderators, facilitators and generators of all we hear and send to and from the spirit realm.\nAnd they also stand as guards and protectors to do the best they can to keep us from being deceived or taken down a dark path.\n \nSome here wait for others to state an opinion and then tend to agree with that opinion no matter what they have experienced to be true.\n \nRobin, my advice to you as a new researcher in this field. Form your own beliefs through your experience and research.\nListen and learn from others but do not let what you believe to be true or not, be swayed by popular opinion.\n \nBruce\n\n\n  Bruce Halliday \n\n\n\n\n    \n---------------------------------\n  To: EVP-ITC@yahoogroups.com\nFrom: MudPuddleFarm@...\nDate: Sat, 2 Feb 2008 21:42:09 -0800\nSubject: Re: [EVP-ITC] Re: File from tonight\n\n          Steve,\n   \n  I certainly appreciate your thoughts.  In the back of my mind is always the question of whether we are being Deceived.  Just for the sake of argument, is it POSSIBLE we&#39;re being manipulated by something evil?  I&#39;m not frightened, and I won&#39;t stop my own research (the negative stuff just makes me more determined), but my mind does go there sometimes.  I hope that along with developing my &quot;ear&quot; I can acquire the gift of discernment.\n   \n  Robin\n   \n   \n    ----- Original Message ----- \n  From: Steve Hultay \n  To: EVP-ITC@yahoogroups.com \n  Sent: Saturday, February 02, 2008 8:57 PM\n  Subject: [EVP-ITC] Re: File from tonight:\n  \n\n  Robin,\n\nIf i may add my thoughts on this: There is no concrete evidence of \nwho or what comes through is what they say they are. Technicians i \nhave found were used to get you up and running and i only now call on \nthem if i need assistance. I don&#39;t turn the boxes on and ask for \nthem like a crutch, i conduct my session and if i need help they will \nsupply it to me if needed. I think the whole idea is to find out who \nwe are communicating with, maybe we will never really know for sure \nbut i still try and find out as best as i can. \n\n-Steve H.\n\n--- In EVP-ITC@yahoogroups.com, &quot;Robin Searcy Henson&quot; \n&lt;MudPuddleFarm@...&gt; wrote:\n&gt;\n&gt; Hi Frank, \n&gt; \n&gt; When you mention being distrustful of what comes through the boxes, \nare you saying you&#39;re skeptical of the &quot;technicians&quot; being who they \nsay they are? Not trying to open another can of worms here, just \nwanting to continue learning from your experience and research. I \nget what you&#39;re saying about becoming obsessive with the sessions. \nI&#39;ve probably asked you this a half dozen times over the last couple \nof years, but who or what do YOU think you&#39;re/we&#39;re communicating \nwith?\n&gt; \n&gt; Robin\n&gt; \n&gt; \n&gt; ----- Original Message ----- \n&gt; From: purplespacefriend&lt;mailto:purplealiengirl@...&gt; \n&gt; To: EVP-ITC@yahoogroups.com&lt;mailto:EVP-ITC@yahoogroups.com&gt; \n&gt; Sent: Saturday, February 02, 2008 7:46 PM\n&gt; Subject: [EVP-ITC] Re: File from tonight\n&gt; \n&gt; \n&gt; Have ya tried EVPmaker? It is based on that random principle, and \n&gt; predates the boxes.\n&gt; \n&gt; I&#39;ve heard this stuff before, about random being the best, and I \n&gt; have to disaggree. I also think it unwise to spend every waking \n&gt; moment doing sessions. I think it creates that expectation, and \n&gt; perhaps desperation to make contact, and I would tend not to \ntrust \n&gt; what comes through. \n&gt; \n&gt; I don&#39;t trust some of this stuff because I have yet get any \n&gt; meaningful assistence with the boxes from the so called \ntechnicians. \n&gt; All I ever got was a telepathic &quot;suggestion&quot; to use the echo \nboxes. \n&gt; Everything else was a assemblage of stuff I had worked on in hte \npast \n&gt; to solve the problem of &quot;what else could I use&quot;. \n&gt; \n&gt; I hate to see yet another go down the road of &quot;this is the \nonlyest \n&gt; way&quot;. \n&gt; \n&gt; Frank-S\n&gt;\n\n\n\n\n\n\n\n\n\n\n  \n---------------------------------\n  Shed those extra pounds with MSN and The Biggest Loser! Learn more. \n\n\n\n\n\n\n\n  \n---------------------------------\n  Connect and share in new ways with Windows Live. Get it now!   \n\n\n  \n\n                         \n\n\n  The contents of this eletronic correspondence is private & confidential and meant only for the party and/or parties it is addressed to.  \n   \n  No part of this email transmission may be publicly posted or forwarded to other parties without explicit written permission.\n\n\r\n--0-1871085226-1202273624=:19598\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;div&gt;Robin:&lt;/div&gt;  &lt;div&gt;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; I don&#39;t think you motives are selfish at all.&nbsp; I am a firm believer that everything happens for a reason and that people are brought into your life for a purpose as well.&nbsp; You are lead down certain paths, some which you have not clue as how they came about, but nevertheless your on that road.&nbsp;&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;I truly feel that the otherside knows of the sincere dedication of many in this group (for the files prove this) and hope the best is yet to come. There are a lot of new comers&nbsp;to box research&nbsp;and&nbsp;hope that with everyones contributions we will all be able to get some of the answers we seek as well as reconnected with&nbsp;our loved ones who have gone before us.&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Juli&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;Robin\n Searcy Henson &lt;MudPuddleFarm@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/div&gt;  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;div&gt;&lt;!--[gte IE 5]&gt;&lt;?xml:namespace prefix=&quot;v&quot; /&gt;&lt;?xml:namespace prefix=&quot;o&quot; /&gt;&lt;![endif]--&gt;  &lt;DIV&gt;  &lt;DIV&gt;I very much value and appreciate everyone participating in this forum.&nbsp;&nbsp; My selfish motive in wanting to contact the other side is my hope to hear from loved ones who have passed.&nbsp; I couldn&#39;t admit this a couple of years ago because the idea of being contacted by my dead parents terrified me.&nbsp; Now&nbsp;I long for it.&nbsp; I believe guardian angels have intervened on my behalf in the past and\n continue to watch over me.&nbsp; I&#39;ve had mystic experiences during times of crisis that make me know a spiritual world exists.&nbsp; How wonderful it must be to hear their voices first hand!&nbsp; I&#39;ll remind myself every day never to take any of what happens for granted.&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;Robin&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;&lt;/DIV&gt;  &lt;BLOCKQUOTE style=&quot;BORDER-LEFT: #000000 2px solid&quot;&gt;  &lt;DIV style=&quot;FONT: 10pt arial&quot;&gt;----- Original Message ----- &lt;/DIV&gt;  &lt;DIV style=&quot;FONT: 10pt arial&quot;&gt;&lt;B&gt;From:&lt;/B&gt; &lt;A title=mailto:paranormalinvestigating@... href=&quot;mailto:paranormalinvestigating@...&quot;&gt;bruce halliday&lt;/A&gt; &lt;/DIV&gt;  &lt;DIV style=&quot;FONT: 10pt arial&quot;&gt;&lt;B&gt;To:&lt;/B&gt; &lt;A title=mailto:evp-itc@yahoogroups.com href=&quot;mailto:evp-itc@yahoogroups.com&quot;&gt;evp-itc@yahoogroups&lt;WBR&gt;.com&lt;/A&gt; &lt;/DIV&gt;  &lt;DIV style=&quot;FONT: 10pt arial&quot;&gt;&lt;B&gt;Sent:&lt;/B&gt; Monday, February 04, 2008 6:58 AM&lt;/DIV&gt;  &lt;DIV style=&quot;FONT: 10pt arial&quot;&gt;&lt;B&gt;Subject:&lt;/B&gt; RE: [EVP-ITC] Re: File from tonight--Bruce&lt;/DIV&gt; \n &lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;  &lt;DIV id=ygrp-text&gt;  &lt;div&gt;Robin,&lt;BR&gt;&nbsp;&lt;BR&gt;I very much appreciate your comments and confidence in me, but at the end of the day I&#39;m no different than anyone else.&lt;BR&gt;The only thing that may set me apart from some of the other researchers here is that I have a bit more experience and &lt;BR&gt;being disabled allows me a lot more time for research. I am always willing and hopefully able to help new researchers with &lt;BR&gt;my advice and knowledge I have gained through experience. But my ideology is not the end all explanation or truth of box research&lt;BR&gt;all opinions here are valuable and deserving of consideration and attention.&lt;BR&gt;&nbsp;&lt;BR&gt;As for your question, the fact that I am blessed enough to receive a fairly good level of communication I believe is based once &lt;BR&gt;again on the relationship I have built with my tech/guides and the synchronization of energy we have developed.&lt;BR&gt;The level of communication we are at I believe is only the very tip of the iceberg.\n My goal in &quot;MY&quot; research is to reach a level of communication that &lt;BR&gt;allows us to speak easily and freely with our spirit friends in a fluid and continual fashion as if having a pleasant telephone conversation.&lt;BR&gt;&nbsp;&lt;BR&gt;The gist of the messages I am receiving now are directed toward our spirit counterparts achieving the same goal. It is already a comfort to me to know they are there and I have had the opportunity to speak with close family members and friends that have crossed over. And also recently Ms. Sarah Estep who has made the transition and is beginning to work now on the&lt;BR&gt;spirit side to further the communication. Any information I receive from the spirits I recognise to be friends is invaluable. Something as simple as a yes or no answer to a direct question that has just been asked is a small miracle in and of itself. considering how it was attained and where it is from. Most researchers I think after a certain amount of time succumb to the human flaw of\n complacency and take for granted that when they turn a box on they will receive communication. They loose site of the fact that this communication is a precious gift to mankind and eventually will change the way we perceive life and death.&lt;BR&gt;&nbsp;&lt;BR&gt;I don&#39;t know if my thinking or opinions are lucid or the rantings of a mad man, I&#39;m sure a lot of people would say both. For what it is worth this is how I believe on the questions you asked.&lt;BR&gt;for better or worse.&lt;BR&gt;&nbsp;&lt;BR&gt;Bruce&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;  &lt;div align=center&gt;&lt;FONT size=4&gt;&lt;FONT color=#0033cc&gt;&lt;STRONG&gt;&lt;EM&gt;&lt;FONT color=#000000 size=5&gt;Bruce Halliday &lt;BR&gt;&lt;/FONT&gt;&lt;/EM&gt;&lt;/STRONG&gt;&lt;BR&gt;&lt;A title=http://free-paranormalinvestigating.com/%3C/div%3E%3C/div%3E%3Cp%20/%3E%3Cdiv%20class= href=&quot;http://free-paranormalinvestigating.com/%3C/div%3E%3C/div%3E%3Cp%20/%3E%3Cdiv%20class=&quot; target=_blank&gt;&lt;/div&gt;&lt;/A&gt;&lt;/FONT&gt;&lt;/FONT&gt;&lt;BR&gt;&lt;BR&gt;  &lt;BLOCKQUOTE&gt;  &lt;HR&gt;  To: EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;BR&gt;From: MudPuddleFarm@&lt;WBR&gt;msn.com&lt;BR&gt;Date: Sun, 3 Feb 2008\n 18:35:14 -0800&lt;BR&gt;Subject: Re: [EVP-ITC] Re: File from tonight--Bruce&lt;BR&gt;&lt;BR&gt;  &lt;DIV id=EC_ygrp-mlmsg&gt;  &lt;DIV id=EC_ygrp-msg&gt;  &lt;DIV id=EC_ygrp-text&gt;  &lt;DIV&gt;  &lt;DIV&gt;It&#39;s always refreshing to read your input Bruce.&nbsp; Funny thing is, I recognize Mike and Lisa on your recordings too.&nbsp;&nbsp;I&#39;m aware that they are acting as facilitators and guardians, that they are consistent in their ability to use varied modes of communication,&nbsp;and that their contact&nbsp;appears to be purposeful, as compared to so much&nbsp;that seems to have no rhyme or reason.&nbsp; &lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;As a newbie&nbsp;I&#39;m admittedly intimidated by and in awe of the&nbsp;results you more experienced researchers are accomplishing.&nbsp; What I find most awesome is that everyone can have different methods, belief systems and opinions and come together in one forum to share and learn from one another.&nbsp; I feel so lucky to have found you!&nbsp; Bruce, your ability to hear and\n accurately repeat my one posted EVP is the only validation I&#39;ve personally ever received that makes me know I&#39;m involved in something real and life altering.&nbsp; I&#39;m supposed to be here!&nbsp; I think a big part of my education will continue to come from the knowledge and experience you all are willing to keep sharing.&nbsp; It&#39;s also a fact&nbsp;that each of us needs to find his/her own individual truth.&nbsp; &lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;I&#39;m still troubled by the possibility that we could be pawns in Someone Else&#39;s science experiment.&nbsp; I can sense Frank&#39;s cynicism related to&nbsp;the messages being meaningless and the messengers being untrustworthy.&nbsp;&nbsp;In your own case,&nbsp;what is&nbsp;the goal?&nbsp; Is the fact that you&#39;ve established communication and continue to communicate enough?&nbsp; Are we hoping&nbsp;to gain invaluable information from our guides, or just&nbsp;to have the comfort of knowing they are there?&nbsp;&nbsp;&lt;/DIV&gt; \n &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;This is the week I&#39;ve promised myself to start doing sessions with the Radio Shack hacks!&nbsp; &lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;Robin&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;&lt;A title=mailto:myself.@yahoogroups.com href=&quot;mailto:myself.@yahoogroups.com&quot;&gt;hoogroups.com&lt;/A&gt; &lt;/DIV&gt;  &lt;BLOCKQUOTE style=&quot;BORDER-LEFT: #000000 2px solid&quot;&gt;  &lt;DIV style=&quot;FONT: 10pt arial&quot;&gt;&lt;B&gt;Sent:&lt;/B&gt; Sunday, February 03, 2008 6:25 AM&lt;/DIV&gt;  &lt;DIV style=&quot;FONT: 10pt arial&quot;&gt;&lt;B&gt;Subject:&lt;/B&gt; RE: [EVP-ITC] Re: File from tonight&lt;/DIV&gt;  &lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;  &lt;DIV id=EC_ygrp-text&gt;  &lt;div&gt;Robin,&lt;BR&gt;&nbsp;&lt;BR&gt;I agree with Steve on a couple of points. First let me say that I&lt;BR&gt;do believe that we all have a &quot;technician/&lt;WBR&gt;guide/guardian&quot; call them what you&lt;BR&gt;may. but I usually call them by the names they introduced themselves by.&lt;BR&gt;&nbsp;&lt;BR&gt;I know for a fact through many, many, many box sessions that when I turn&lt;BR&gt;a box on,\n could be Frank&#39;s box or the minibox or the RS 470 does not matter which.&lt;BR&gt;&nbsp;&lt;BR&gt;The same two entities will come through immediately, So much so now, that I do not even ask for conformation that&lt;BR&gt;it is in fact them. I recognise their individual voice patterns. I have built a solid relationship with these two spirits&lt;BR&gt;I know as mike and Lisa so much so that I have even gotten to know their individual personalities.&lt;BR&gt;&nbsp;&lt;BR&gt;There are other newer researchers here that will attest to the fact that when they where doing their first sessions&lt;BR&gt;I had asked my two &quot;Friends&quot; Mike and Lisa to assist in getting them started and invariably the spirits that came &lt;BR&gt;through to these new researchers during their first sessions identified themselves as Mike and Lisa.&lt;BR&gt;&nbsp;&lt;BR&gt;Steve says he does not turn on his box and use them as a crutch, that is not entirely true. I had done research &lt;BR&gt;very closely with Steve until recently and I would venture to say that 99% if\n not every session he starts with &quot;Mike &amp; Lisa&lt;BR&gt;are you available to talk with me&quot; &lt;BR&gt;&nbsp;&lt;BR&gt;Also I don&#39;t consider working with my technicians as using them as a crutch, They would not allow that.&lt;BR&gt;They are not there like butlers at our beckoned call when we feel they may be of some use.&lt;BR&gt;Quite the opposite, without them we would get no communication at all, they are allowing us the honor of receiving this &lt;BR&gt;celestial communication. They are the moderators, facilitators and generators of all we hear and send to and from the spirit realm.&lt;BR&gt;And they also stand as guards and protectors to do the best they can to keep us from being deceived or taken down a dark path.&lt;BR&gt;&nbsp;&lt;BR&gt;Some here wait for others to state an opinion and then tend to agree with that opinion no matter what they have experienced to be true.&lt;BR&gt;&nbsp;&lt;BR&gt;Robin, my advice to you as a new researcher in this field. Form your own beliefs through your experience and research.&lt;BR&gt;Listen and\n learn from others but do not let what you believe to be true or not, be swayed by popular opinion.&lt;BR&gt;&nbsp;&lt;BR&gt;Bruce&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;  &lt;div align=center&gt;&lt;FONT size=4&gt;&lt;FONT color=#0033cc&gt;&lt;STRONG&gt;&lt;EM&gt;&lt;FONT color=#000000 size=5&gt;Bruce Halliday &lt;BR&gt;&lt;/FONT&gt;&lt;/EM&gt;&lt;/STRONG&gt;&lt;BR&gt;&lt;A title=http://free-paranormalinvestigating.com/%3C/div%3E%3C/div%3E%3Cp%20/%3E%3Cdiv%20class= href=&quot;http://free-paranormalinvestigating.com/%3C/div%3E%3C/div%3E%3Cp%20/%3E%3Cdiv%20class=&quot; target=_blank&gt;&lt;BR&gt;&lt;/A&gt;&lt;/FONT&gt;&lt;/FONT&gt;&lt;BR&gt;&lt;BR&gt;  &lt;BLOCKQUOTE&gt;  &lt;HR&gt;  To: EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;BR&gt;From: MudPuddleFarm@&lt;WBR&gt;msn.com&lt;BR&gt;Date: Sat, 2 Feb 2008 21:42:09 -0800&lt;BR&gt;Subject: Re: [EVP-ITC] Re: File from tonight&lt;BR&gt;&lt;BR&gt;  &lt;DIV id=EC_EC_ygrp-mlmsg&gt;  &lt;DIV id=EC_EC_ygrp-msg&gt;  &lt;DIV id=EC_EC_ygrp-text&gt;  &lt;DIV&gt;  &lt;DIV&gt;Steve,&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;I certainly appreciate your thoughts.&nbsp; In the back of my mind is always the question of whether we are being Deceived.&nbsp; Just for the sake of argument, is it\n POSSIBLE we&#39;re being manipulated by something evil?&nbsp; I&#39;m not frightened, and I won&#39;t stop my own research (the negative stuff just makes me more determined), but my mind does go there sometimes.&nbsp; I hope that along with developing my &quot;ear&quot;&nbsp;I can acquire the gift of discernment.&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;Robin&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;BLOCKQUOTE style=&quot;BORDER-LEFT: #000000 2px solid&quot;&gt;  &lt;DIV style=&quot;FONT: 10pt arial&quot;&gt;----- Original Message ----- &lt;/DIV&gt;  &lt;DIV style=&quot;FONT: 10pt arial&quot;&gt;&lt;B&gt;From:&lt;/B&gt; &lt;A title=mailto:urkel23@... href=&quot;mailto:urkel23@...&quot;&gt;Steve Hultay&lt;/A&gt; &lt;/DIV&gt;  &lt;DIV style=&quot;FONT: 10pt arial&quot;&gt;&lt;B&gt;To:&lt;/B&gt; &lt;A title=mailto:EVP-ITC@yahoogroups.com href=&quot;mailto:EVP-ITC@yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt; &lt;/DIV&gt;  &lt;DIV style=&quot;FONT: 10pt arial&quot;&gt;&lt;B&gt;Sent:&lt;/B&gt; Saturday, February 02, 2008 8:57 PM&lt;/DIV&gt;  &lt;DIV style=&quot;FONT: 10pt arial&quot;&gt;&lt;B&gt;Subject:&lt;/B&gt; [EVP-ITC] Re: File from tonight:&lt;/DIV&gt;  &lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;  &lt;DIV\n id=EC_EC_ygrp-text&gt;Robin,&lt;BR&gt;&lt;BR&gt;If i may add my thoughts on this: There is no concrete evidence of &lt;BR&gt;who or what comes through is what they say they are. Technicians i &lt;BR&gt;have found were used to get you up and running and i only now call on &lt;BR&gt;them if i need assistance. I don&#39;t turn the boxes on and ask for &lt;BR&gt;them like a crutch, i conduct my session and if i need help they will &lt;BR&gt;supply it to me if needed. I think the whole idea is to find out who &lt;BR&gt;we are communicating with, maybe we will never really know for sure &lt;BR&gt;but i still try and find out as best as i can. &lt;BR&gt;&lt;BR&gt;-Steve H.&lt;BR&gt;&lt;BR&gt;--- In &lt;A title=mailto:EVP-ITC@yahoogroups.com href=&quot;mailto:EVP-ITC@yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;, &quot;Robin Searcy Henson&quot; &lt;BR&gt;&lt;MudPuddleFarm@&lt;WBR&gt;...&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; Hi Frank, &lt;BR&gt;&gt; &lt;BR&gt;&gt; When you mention being distrustful of what comes through the boxes, &lt;BR&gt;are you saying you&#39;re skeptical of the &quot;technicians&quot; being who they &lt;BR&gt;say\n they are? Not trying to open another can of worms here, just &lt;BR&gt;wanting to continue learning from your experience and research. I &lt;BR&gt;get what you&#39;re saying about becoming obsessive with the sessions. &lt;BR&gt;I&#39;ve probably asked you this a half dozen times over the last couple &lt;BR&gt;of years, but who or what do YOU think you&#39;re/we&#39;re communicating &lt;BR&gt;with?&lt;BR&gt;&gt; &lt;BR&gt;&gt; Robin&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; ----- Original Message ----- &lt;BR&gt;&gt; From: purplespacefriend&lt;&lt;WBR&gt;mailto:purpleali&lt;WBR&gt;engirl@..&lt;WBR&gt;.&gt; &lt;BR&gt;&gt; To: &lt;A title=mailto:EVP-ITC@yahoogroups.com href=&quot;mailto:EVP-ITC@yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;&lt;mailto:&lt;A title=mailto:EVP-ITC@yahoogroups.com href=&quot;mailto:EVP-ITC@yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;&gt; &lt;BR&gt;&gt; Sent: Saturday, February 02, 2008 7:46 PM&lt;BR&gt;&gt; Subject: [EVP-ITC] Re: File from tonight&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; Have ya tried EVPmaker? It is based on that random principle, and &lt;BR&gt;&gt; predates the\n boxes.&lt;BR&gt;&gt; &lt;BR&gt;&gt; I&#39;ve heard this stuff before, about random being the best, and I &lt;BR&gt;&gt; have to disaggree. I also think it unwise to spend every waking &lt;BR&gt;&gt; moment doing sessions. I think it creates that expectation, and &lt;BR&gt;&gt; perhaps desperation to make contact, and I would tend not to &lt;BR&gt;trust &lt;BR&gt;&gt; what comes through. &lt;BR&gt;&gt; &lt;BR&gt;&gt; I don&#39;t trust some of this stuff because I have yet get any &lt;BR&gt;&gt; meaningful assistence with the boxes from the so called &lt;BR&gt;technicians. &lt;BR&gt;&gt; All I ever got was a telepathic &quot;suggestion&quot; to use the echo &lt;BR&gt;boxes. &lt;BR&gt;&gt; Everything else was a assemblage of stuff I had worked on in hte &lt;BR&gt;past &lt;BR&gt;&gt; to solve the problem of &quot;what else could I use&quot;. &lt;BR&gt;&gt; &lt;BR&gt;&gt; I hate to see yet another go down the road of &quot;this is the &lt;BR&gt;onlyest &lt;BR&gt;&gt; way&quot;. &lt;BR&gt;&gt; &lt;BR&gt;&gt; Frank-S&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;SPAN style=&quot;COLOR: white&quot;&gt;&lt;/SPAN&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;  &lt;HR&gt; \n Shed those extra pounds with MSN and The Biggest Loser! &lt;A title=http://biggestloser.msn.com/ href=&quot;http://biggestloser.msn.com/&quot; target=_blank&gt;Learn more.&lt;/A&gt; &lt;BR&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;SPAN style=&quot;COLOR: white&quot;&gt;&lt;/SPAN&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;  &lt;HR&gt;  Connect and share in new ways with Windows Live. &lt;A title=http://www.windowslive.com/share.html?ocid=TXT_TAGHM_Wave2_sharelife_012008 href=&quot;http://www.windowslive.com/share.html?ocid=TXT_TAGHM_Wave2_sharelife_012008&quot; target=_new&gt;Get it now!&lt;/A&gt;   &lt;div&gt;&lt;/div&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;/DIV&gt;  &lt;div&gt;&lt;/div&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;&lt;DIV&gt;  &lt;div&gt;&lt;EM&gt;&lt;STRONG&gt;&lt;FONT color=#0000ff&gt;The contents of this eletronic correspondence is private &amp; confidential and meant only for the party and/or parties it is addressed to.&nbsp; &lt;/FONT&gt;&lt;/STRONG&gt;&lt;/EM&gt;&lt;/div&gt;  &lt;div&gt;&lt;EM&gt;&lt;STRONG&gt;&lt;FONT color=#0000ff&gt;&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/EM&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;&lt;EM&gt;&lt;STRONG&gt;&lt;FONT color=#0000ff&gt;No part of this email transmission may be publicly posted or forwarded to other parties without explicit written permission.&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/EM&gt;&lt;/div&gt;&lt;/DIV&gt;\r\n--0-1871085226-1202273624=:19598--"}