{"id": "6883", "subject": "A question for the researchers ????", "author": "Ralph Smith", "timestamp": "2008-02-06T09:38:57Z", "full_text": "Hi everyone,\n\n I have been hearing the word &quot; Purple &quot; alot lately in my sessions.\nDoes anyone in the group know what it pertains to ? It&#39;s been bugging \nme alot. Could that be a special group on their side ? I have no clue. \nAlso has anyone questioned the voices if they have a last name ? All I \nhear on the RS boxes are first names and haven&#39;t recieved anyone \ntelling me their last name. Does Mike and Lisa have a last name ? Did \nanyone here ever ask the question &quot; Are you Demonic Spirits ? &quot; What \nwas their reply if any ? I did one time and got a response saying &quot; \nAll of us are &quot;. Don&#39;t know whether I believe that Spirit or not. \nProbably a Joker saying that. I have asked for specific people for \nthem to find so I could talk to and got an answer &quot; We&#39;re looking. &quot; \nThen I never heard from them after that. I&#39;m still waiting to be \ncontacted by Telephone so far nothing yet. They make me laugh \nsometimes. I had the RS-12-469 on the one day I was just listening to \nwhat they were chatting about. I found my daughters old Fart Machine \nand was playing with it while the RS radio was running to see if it \nstill works which it did. All of a sudden after I made it &quot; Toot &quot; I \nheard a female voice say &quot; Phew !!! .&quot;\nLOL, I guess she thought I really passed one. Also, the other day I \nwas on the RS 12-469 and I said &quot; Hello Lisa how are you doing \ntoday ? &quot; Then a few seconds later I hear a female voice say &quot; \nBruce ? &quot; like she thought that I was Bruce talking to her. I told her \nno it&#39;s me Ralph from Harrisburg,PA she replied &quot;Oh, okay fine. &quot; I \nhear all the time voices calling for Lisa she must be a very Popular \nTechnician. Oh well I guess it was more than one question LOL. Hey you \nall take care and &quot; Keep the Sweep &quot; a new slogan for here LOL. just \nkidding. You all have a great day.\n\nRegards,\n\nRalph the Ghost Hunter"}