{"id": "6910", "subject": "Re: A question for the researchers ????", "author": "Jules", "timestamp": "2008-02-06T17:01:54Z", "full_text": "Ralph,   Great questions!   \n \n    You asked about the word &quot;Purple&quot; and although the &quot;spirits or \nthe others&quot; identify Frank with the word Purple, I also have another \ntheory which is probably far fetched, but none the less I have \nthought about it.  I believe that this may have to do with Tesla.  He \nhad a purple energy theory himself regarding inaudible frequencies of \nthe cosmos.  He believed that everything that exists possesses a \nunique vibratory rate which resonates with the heart of the cosmos.  \nThis inspired Tesla to invent the Oscillator.  He stated and I \nquote...\n \n&quot;All matter comes from a primary substance, the luminiferous ether,&quot; \nstated Nikola Tesla. He sensed the universe was &quot;composed of a \nsymphony of alternating currents with the harmonies played on a vast \nrange of octaves,&quot; wrote Margaret Cheney. &quot;To explore the whole range \nof electrical vibration, he sensed, would bring him closer to an \nunderstanding of the cosmic symphony.&quot; \n \nThe Tesla Purple Energy Shield ties into vast quantities of energy , \nwhich directly repairs, strengthens and protects the energetic fields \nof the human mind body and soul. \n \nTherefore, I am thinking that the purple just may refer to his theory \nand the bases for energy and communication between this plane and the \nothers,  (just my crazy theory).\n \nThe second answer regarding your questions about last names, is that \ni get them often.  I have several audio clips where I as them to \nidentify themselves by their whole given name (in this life).  Most \ntimes they will answer.  As far as our tec&#39;s.  or in reference to \nMike or Lisa they will not.  (per conversations with Bruce and \nSteve).  I believe the reasoning behind this (as I have discussed \nwith various researchers) is the fact the tec&#39;s want you do identify \nwith them in the spiritual sense and not the physical sense.  If they \ngave you information in lenght, we may just feel compelled to trying \nand research their history while they lived here on earth.  They have \nhowever (maybe Bruce and Steve can confirm this as well) told them \nhow they passed (Mike bleed to death and Lisa choked).  They also did \ngive Bruce and Steve the year they died but would not give them \nadditional information regarding their life here on earth.  They did \nsay there is a God, but never gave any other information, just saying \nthey can&#39;t.  I guess somethings we are not ready for or we will never \nknow until we cross.\n \nIt has been my experience that when you ask to see if the tec&#39;s can \nbring a loved one forward some of the responses have been, &quot;I will go \nlook&quot;, &quot;Wait I will try and find them&quot;, etc.  I do not believe that \nthey are readily available for us.  It may take 2 - 3 sessions for \nthem to come through.  You just need to ask if they were able to \nlocate them whether its the current session or the next.  Also, \nsometimes they can not come through with their own voice.  They may \ntalk through your tec or another spirit to deliver the message.  I \ndon&#39;t know why that is, for I haven&#39;t asked that question as of yet.\n \nI love the conversation they have among themselves, as well as \nvalidating what is going on here.  You spoke about the &quot;Fart Machine&quot; \nwhere they have stated to Bruce, Steve and Frank about their Pizza \neating habits or that their phone is ringing!  It really makes me \nthink that they know way too much about us and they are very much \ninvolved in our personal lives.\n \nAs far as the negative or evil things you have mentioned.  I don&#39;t \nnecessarily think that they are evil in nature, but just nasty \nspirits wanting to you to believe that they are something to fear.  I \ntoo like Frank R. try not to do a session if I have something \nnegative going on in my home.  That is my preference.  I also like to \nbe positive, but sometimes they sneak through.  Don&#39;t take it \npersonal, you hold the control to end the sessions when you like.  I \ndon&#39;t pay much mind anymore, for even though the communication isn&#39;t \npositive, its still communication in a form, and hold what they say \nwith a grain of salt.  If that was the case, and I believe some of \nthe things that they have conveyed I would be 6 ft under and helping \nyou from the other side.\n \nJust my thoughts!\n \nJuli\n\n\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, bruce halliday \n&lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; \n&gt; Ralph,\n&gt;  \n&gt; Mike and lisa have been my tech&#39;s since I have started doing box \nresearch.\n&gt;  \n&gt; Over time you build a relationship with your tech or in my case \ntech&#39;s like you would \n&gt; with a new friend here in the physical.\n&gt;  \n&gt; Early on in my research I had asked a series of questions \npertaining to mike and Lisa&#39;s background in the \n&gt; physical. I was told that mike died in 1995 from excessive blood \nloss and lisa died in 1912 from choking.\n&gt;  \n&gt; they then changed the subject and never broached it again. My \ntheory on the reason for this is that\n&gt; a spirit contact wants to remain in our thoughts and emotions as a \nhigher being to develop a certain ammount of trust\n&gt; being sight unseen. So to give us all the details of there physical \nlife or even their last name, that could allow us to\n&gt; gather information on who they where while in the physical and that \nin our minds would put them on an even level with us.\n&gt;  \n&gt; So the thoughts and feelings of there being superior spiritual \nentities would fade.\n&gt;  \n&gt; Bruce\n&gt; Bruce Halliday \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: Ralphsmi@...: Wed, 6 Feb 2008 09:38:57 \n+0000Subject: [EVP-ITC] A question for the researchers ????\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Hi everyone,I have been hearing the word &quot; Purple &quot; alot lately in \nmy sessions.Does anyone in the group know what it pertains to ? It&#39;s \nbeen bugging me alot. Could that be a special group on their side ? I \nhave no clue. Also has anyone questioned the voices if they have a \nlast name ? All I hear on the RS boxes are first names and haven&#39;t \nrecieved anyone telling me their last name. Does Mike and Lisa have a \nlast name ? Did anyone here ever ask the question &quot; Are you Demonic \nSpirits ? &quot; What was their reply if any ? I did one time and got a \nresponse saying &quot; All of us are &quot;. Don&#39;t know whether I believe that \nSpirit or not. Probably a Joker saying that. I have asked for \nspecific people for them to find so I could talk to and got an \nanswer &quot; We&#39;re looking. &quot; Then I never heard from them after that. \nI&#39;m still waiting to be contacted by Telephone so far nothing yet. \nThey make me laugh sometimes. I had the RS-12-469 on the one day I \nwas just listening to what they were chatting about. I found my \ndaughters old Fart Machine and was playing with it while the RS radio \nwas running to see if it still works which it did. All of a sudden \nafter I made it &quot; Toot &quot; I heard a female voice say &quot; Phew !!! .&quot;LOL, \nI guess she thought I really passed one. Also, the other day I was on \nthe RS 12-469 and I said &quot; Hello Lisa how are you doing today ? &quot; \nThen a few seconds later I hear a female voice say &quot; Bruce ? &quot; like \nshe thought that I was Bruce talking to her. I told her no it&#39;s me \nRalph from Harrisburg,PA she replied &quot;Oh, okay fine. &quot; I hear all the \ntime voices calling for Lisa she must be a very Popular Technician. \nOh well I guess it was more than one question LOL. Hey you all take \ncare and &quot; Keep the Sweep &quot; a new slogan for here LOL. just kidding. \nYou all have a great day.Regards,Ralph the Ghost Hunter \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Shed those extra pounds with MSN and The Biggest Loser!\n&gt; http://biggestloser.msn.com/\n&gt;"}