{"id": "6926", "subject": "Re: A question for the researchers ????", "author": "ecuyler", "timestamp": "2008-02-06T21:17:46Z", "full_text": "That&#39;s very profound Bruce.  I understand what you&#39;re saying about\npassing judgment for past actions.  That makes perfect sense.  I hate\nto admit it, but I&#39;d be the first to pass judgment.\n\nJeremy\n\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, bruce halliday\n&lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; \n&gt; Frank R.\n&gt;  \n&gt; Maybe a bad choice of words, used to express what my thoughts where.\n&gt; When I say higher being, my meaning is a spirit being on a higher\nplane of spiritual existence.\n&gt; not beings that lord over us as if they are royalty and we subjects. \n&gt;  \n&gt; My theory of why they will not give any detailed information about\ntheir physical experience on earth\n&gt; is that they want our trust as colleagues in a spiritual sense. just\nsuppose Mike gave me his sir name and where he was from.\n&gt; when in the physical, say I used that information to trace his\nhistory as a physical human being. And found that he was a \n&gt; congressman or senator or supreme court judge. Someone that was\ndistinguished and held a position of high respect and standing.\n&gt; Or on the other side of the coin, I found that he was a murderer and\na rapist that had been executed.\n&gt;  \n&gt; We as physical human beings would pass judgement on his former\nphysical character and treat him or his guidance accordingly.\n&gt; I believe just the opposite of what you referred I believe that is\nthe reason we do not get the detailed information, so that we \n&gt; start on a level playing field and form a relationship according to\nexperience we have interacting as spirit and physical counterparts.\n&gt;  \n&gt; Bruce \n&gt; Bruce Halliday \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: warrior18eii@...: Wed, 6 Feb 2008 07:32:06\n-0800Subject: Re: [EVP-ITC] A question for the researchers ????\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Bruce,It has always been my understanding that they do not like\nbeing referred to as higher or superior. They only refer to themselves\nas having different experiences. To be superior means to have\nauthority over you, which they do not possess. Don&#39;t make the mistake\nof believing they are superior it can lead to some bad experiences.\nJust an observation on my part!Regards,Frank R.\n&gt; ----- Original Message ----From: bruce halliday\n&lt;paranormalinvestigating@...&gt;To: evp-itc@...: Wednesday, February 6,\n2008 8:30:39 AMSubject: RE: [EVP-ITC] A question for the researchers ????\n&gt; \n&gt; Ralph, Mike and lisa have been my tech&#39;s since I have started doing\nbox research. Over time you build a relationship with your tech or in\nmy case tech&#39;s like you would with a new friend here in the physical.\nEarly on in my research I had asked a series of questions pertaining\nto mike and Lisa&#39;s background in the physical. I was told that mike\ndied in 1995 from excessive blood loss and lisa died in 1912 from\nchoking. they then changed the subject and never broached it again. My\ntheory on the reason for this is thata spirit contact wants to remain\nin our thoughts and emotions as a higher being to develop a certain\nammount of trustbeing sight unseen. So to give us all the details of\nthere physical life or even their last name, that could allow us\ntogather information on who they where while in the physical and that\nin our minds would put them on an even level with us. So the thoughts\nand feelings of there being superior spiritual entities would fade. Bruce\n&gt; Bruce Halliday \n&gt; To: EVP-ITC@yahoogroups .comFrom: Ralphsmi@comcast. netDate: Wed, 6\nFeb 2008 09:38:57 +0000Subject: [EVP-ITC] A question for the\nresearchers ????\n&gt; \n&gt; \n&gt; Hi everyone,I have been hearing the word &quot; Purple &quot; alot lately in\nmy sessions.Does anyone in the group know what it pertains to ? It&#39;s\nbeen bugging me alot. Could that be a special group on their side ? I\nhave no clue. Also has anyone questioned the voices if they have a\nlast name ? All I hear on the RS boxes are first names and haven&#39;t\nrecieved anyone telling me their last name. Does Mike and Lisa have a\nlast name ? Did anyone here ever ask the question &quot; Are you Demonic\nSpirits ? &quot; What was their reply if any ? I did one time and got a\nresponse saying &quot; All of us are &quot;. Don&#39;t know whether I believe that\nSpirit or not. Probably a Joker saying that. I have asked for specific\npeople for them to find so I could talk to and got an answer &quot; We&#39;re\nlooking. &quot; Then I never heard from them after that. I&#39;m still waiting\nto be contacted by Telephone so far nothing yet. They make me laugh\nsometimes. I had the RS-12-469 on the one day I was just listening to\nwhat they were chatting about. I found my daughters old Fart Machine\nand was playing with it while the RS radio was running to see if it\nstill works which it did. All of a sudden after I made it &quot; Toot &quot; I\nheard a female voice say &quot; Phew !!! .&quot;LOL, I guess she thought I\nreally passed one. Also, the other day I was on the RS 12-469 and I\nsaid &quot; Hello Lisa how are you doing today ? &quot; Then a few seconds later\nI hear a female voice say &quot; Bruce ? &quot; like she thought that I was\nBruce talking to her. I told her no it&#39;s me Ralph from Harrisburg,PA\nshe replied &quot;Oh, okay fine. &quot; I hear all the time voices calling for\nLisa she must be a very Popular Technician. Oh well I guess it was\nmore than one question LOL. Hey you all take care and &quot; Keep the Sweep\n&quot; a new slogan for here LOL. just kidding. You all have a great\nday.Regards,Ralph the Ghost HunterShed those extra pounds with MSN and\nThe Biggest Loser! Learn more. \n&gt; \n&gt; Never miss a thing. Make Yahoo your homepage. \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Connect and share in new ways with Windows Live.\n&gt;\nhttp://www.windowslive.com/share.html?ocid=TXT_TAGHM_Wave2_sharelife_012008\n&gt;"}