{"id": "6927", "subject": "Re: [EVP-ITC] Observation", "author": "Lisby", "timestamp": "2008-02-06T22:23:32Z", "full_text": "I&#39;m exactly the same as Juli.\n\nAnn\n\nOn Feb 5, 2008, at 11:35 PM, juli velazquez wrote:\n\n&gt;\n&gt; It only gets better!  Wait until your in the store and can hear the  \n&gt; peoples conversation 2 isles over, mixed in the the rest of the  \n&gt; people.  Its a constant scan over and over again!  I feel like one  \n&gt; of those nosey neighbors hearing things I shouldn&#39;t, LOL.\n&gt;\n&gt; I already own a straight jacket, so I guess I&#39;m set!\n&gt;\n&gt; Juli\n&gt;\n&gt; ecuyler &lt;ecuyler@...&gt; wrote:\n&gt; I have a question for those of you who have been doing this research\n&gt; for a while. Since doing the research, have you noticed an increase\n&gt; in your &quot;intuitive&quot; senses? By that I mean, has your hearing been\n&gt; heightened to the point of hearing conversations when you are alone?\n&gt; Or seeing things more clearly spirit wise? Or am I just nuts and need\n&gt; to be committed?\n&gt;\n&gt; I had to ask. It&#39;s a very strange thing. These things have been\n&gt; happening to me and I&#39;m wondering if you have experienced the same\n&gt; thing or close to it.\n&gt;\n&gt; Jeremy\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; The contents of this eletronic correspondence is private &  \n&gt; confidential and meant only for the party and/or parties it is  \n&gt; addressed to.\n&gt;\n&gt; No part of this email transmission may be publicly posted or  \n&gt; forwarded to other parties without explicit written permission.\n&gt;\n&gt; \n\n\nI'm exac ly he same as Juli.AnnOn Feb 5, 2008, a 11:35 PM, juli elazquez w o e:I only ge s be e !  Wai un il you in he s o e and can hea he peoples con e sa ion 2 isles o e , mixed in he he es o he people.  I s a cons an scan o e and o e again!  I eel like one o hose nosey neighbo s hea ing hings I shouldn' , LOL. I al eady own a s aigh jacke , so I guess I'm se ! Juliecuyle com> w o e:I ha e a ques ion o hose o you who ha e been doing his esea ch o a while. Since doing he esea ch, ha e you no iced an inc easein you \"in ui i e\" senses? By ha I mean, has you hea ing beenheigh ened o he poin o hea ing con e sa ions when you a e alone? O seeing hings mo e clea ly spi i wise? O am I jus nu s and need o be commi ed? I had o ask. I 's a e y s ange hing. These hings ha e beenhappening o me and I'm wonde ing i you ha e expe ienced he same hing o close o i .Je emyThe con en s o his ele onic co espondence is p i a e & con iden ial and mean only o he pa y and/o pa ies i is add essed o.  No pa o his email ansmission may be publicly pos ed o o wa ded o o he pa ies wi hou explici w i en pe mission."}