{"id": "6934", "subject": "Re: Greetings from a New Member", "author": "Steve Hultay", "timestamp": "2008-02-06T23:27:05Z", "full_text": "I&#39;m glad my site made you interested in this, i guess it&#39;s \nworking !!!  We just have to get the word out there.\n\n-Steve H. ---&quot;The Recruiter&quot;\n\n\n\n--- In EVP-ITC@yahoogroups.com, rednellie &lt;rednellie@...&gt; wrote:\n&gt;\n&gt; Steve Hultay wrote:\n&gt; &gt;  Nellie,\n&gt; &gt;\n&gt; &gt;  That one file &quot;What are you to me?&quot; A man answers clearly i \nbelieve\n&gt; &gt;  says &quot;Nothing&quot;. That is a real EVP, probably a class A and that \ndid\n&gt; &gt;  not come from the box.\n&gt; \n&gt; It must be a Class B, then, as I am hearing &quot;husband&quot;.  That fits \nwith \n&gt; the other one where he says I&#39;m his wife.  He has been trying to \n&gt; convince me for over a year that I am the reincarnation of his long \ndead \n&gt; spouse, so I was quite intrigued to get these as some of the \nresults \n&gt; from my very first day trying ITC work.\n&gt; \n&gt; &gt;  That was spoken directly into your recorder. I\n&gt; &gt;  get them on occasion, i feel that only happens with a grounded \nspirit\n&gt; &gt;  in a location and is confused by the box....Maybe (I don&#39;t Know) \nIt\n&gt; &gt;  sounds somewhat logical though.\n&gt; \n&gt; Or it could just be that I have been nagging him to hear his \nvoice.  \n&gt; Like I said, I&#39;d never managed to get even one evp out of him in 15 \n&gt; months of trying.  He&#39;s pretty clever, so I couldn&#39;t imagine that \nhe \n&gt; couldn&#39;t figure out how to.  The sense I was getting from him was \nthat \n&gt; since he was shot through the throat during the Civil War, he was \n&gt; concerned that he would sound scary if I ever heard him.  It \nactually \n&gt; means a lot to me that he finally let me hear him in his own \nvoice.  I \n&gt; guess he now trusts me not to freak out.  As if I ever did.\n&gt; \n&gt; &gt;  Anyway, Great Files and welcome to the group !!!\n&gt; \n&gt; Thanks!  Actually, it was your site that convinced me to break down \nand \n&gt; give ITC work a try.\n&gt; \n&gt; \n&gt; Nellie\n&gt;"}