{"id": "6956", "subject": "Re: [EVP-ITC] A question for the researchers ????", "author": "Lisby", "timestamp": "2008-02-07T13:36:17Z", "full_text": "Ralph, I hear Purple all the time, too. It&#39;s Frank&#39;s bunch. They like  \nme. Guess they like you, too. :)\n\nAnn\n\nOn Feb 6, 2008, at 4:38 AM, Ralph Smith wrote:\n\n&gt; Hi everyone,\n&gt;\n&gt; I have been hearing the word &quot; Purple &quot; alot lately in my sessions.\n&gt; Does anyone in the group know what it pertains to ? It&#39;s been bugging\n&gt; me alot. Could that be a special group on their side ? I have no clue.\n&gt; Also has anyone questioned the voices if they have a last name ? All I\n&gt; hear on the RS boxes are first names and haven&#39;t recieved anyone\n&gt; telling me their last name. Does Mike and Lisa have a last name ? Did\n&gt; anyone here ever ask the question &quot; Are you Demonic Spirits ? &quot; What\n&gt; was their reply if any ? I did one time and got a response saying &quot;\n&gt; All of us are &quot;. Don&#39;t know whether I believe that Spirit or not.\n&gt; Probably a Joker saying that. I have asked for specific people for\n&gt; them to find so I could talk to and got an answer &quot; We&#39;re looking. &quot;\n&gt; Then I never heard from them after that. I&#39;m still waiting to be\n&gt; contacted by Telephone so far nothing yet. They make me laugh\n&gt; sometimes. I had the RS-12-469 on the one day I was just listening to\n&gt; what they were chatting about. I found my daughters old Fart Machine\n&gt; and was playing with it while the RS radio was running to see if it\n&gt; still works which it did. All of a sudden after I made it &quot; Toot &quot; I\n&gt; heard a female voice say &quot; Phew !!! .&quot;\n&gt; LOL, I guess she thought I really passed one. Also, the other day I\n&gt; was on the RS 12-469 and I said &quot; Hello Lisa how are you doing\n&gt; today ? &quot; Then a few seconds later I hear a female voice say &quot;\n&gt; Bruce ? &quot; like she thought that I was Bruce talking to her. I told her\n&gt; no it&#39;s me Ralph from Harrisburg,PA she replied &quot;Oh, okay fine. &quot; I\n&gt; hear all the time voices calling for Lisa she must be a very Popular\n&gt; Technician. Oh well I guess it was more than one question LOL. Hey you\n&gt; all take care and &quot; Keep the Sweep &quot; a new slogan for here LOL. just\n&gt; kidding. You all have a great day.\n&gt;\n&gt; Regards,\n&gt;\n&gt; Ralph the Ghost Hunter\n&gt;\n&gt;\n&gt; \n\n\nRalph, I hea Pu ple all he ime, oo. I 's F ank's bunch. They like me. Guess hey like you, oo. :)AnnOn Feb 6, 2008, a 4:38 AM, Ralph Smi h w o e:Hi e e yone,I ha e been hea ing he wo d \" Pu ple \" alo la ely in my sessions.Does anyone in he g oup know wha i pe ains o ? I 's been bugging me alo . Could ha be a special g oup on hei side ? I ha e no clue. Also has anyone ques ioned he oices i hey ha e a las name ? All I hea on he RS boxes a e i s names and ha en' ecie ed anyone  elling me hei las name. Does Mike and Lisa ha e a las name ? Did anyone he e e e ask he ques ion \" A e you Demonic Spi i s ? \" Wha  was hei eply i any ? I did one ime and go a esponse saying \" All o us a e \". Don' know whe he I belie e ha Spi i o no . P obably a Joke saying ha . I ha e asked o speci ic people o   hem o ind so I could alk o and go an answe \" We' e looking. \" Then I ne e hea d om hem a e ha . I'm s ill wai ing o be con ac ed by Telephone so a no hing ye . They make me laugh some imes. I had he RS-12-469 on he one day I was jus lis ening o wha hey we e cha ing abou . I ound my daugh e s old Fa Machine and was playing wi h i while he RS adio was unning o see i i  s ill wo ks which i did. All o a sudden a e I made i \" Too \" I hea d a emale oice say \" Phew !!! .\"LOL, I guess she hough I eally passed one. Also, he o he day I was on he RS 12-469 and I said \" Hello Lisa how a e you doing  oday ? \" Then a ew seconds la e I hea a emale oice say \" B uce ? \" like she hough ha I was B uce alking o he . I old he  no i 's me Ralph om Ha isbu g,PA she eplied \"Oh, okay ine. \" I hea all he ime oices calling o Lisa she mus be a e y Popula  Technician. Oh well I guess i was mo e han one ques ion LOL. Hey you all ake ca e and \" Keep he Sweep \" a new slogan o he e LOL. jus  kidding. You all ha e a g ea day.Rega ds,Ralph he Ghos Hun e"}