{"id": "6960", "subject": "Re: [EVP-ITC] Re: A question for the researchers ????", "author": "Lisby", "timestamp": "2008-02-07T14:13:54Z", "full_text": "I&#39;m not so sure I would, but that&#39;s just me. I&#39;m very open to the  \nconcept of redemption and to shades of gray.\n\nActually, I&#39;m here to confess to doing exactly what Bruce is  \ndiscussing. I got the name Nicholson Lawson a few sessions ago. I  \nasked if that was one person&#39;s full name or two people&#39;s last names,  \nand was told it was one. I went through records at Ancestry.com and  \nfound a Nicholson Lawson who was listed as a carpenter in the  \nLouisville, Kentucky 1890 directory, and what may be the same man in  \nNew Haven, Connecticut in 1919. These are the only two records of  \nanyone by that name in the U.S. or U.K. that are currently indexed.  \nIt might not be the same Nicholson Lawson, but its such an unusual  \nname. I didn&#39;t expect to find anyone in the historic record with that  \nname, honestly, but there he is.\n\nAnn\n\nOn Feb 6, 2008, at 4:17 PM, ecuyler wrote:\n\n&gt; That&#39;s very profound Bruce. I understand what you&#39;re saying about\n&gt; passing judgment for past actions. That makes perfect sense. I hate\n&gt; to admit it, but I&#39;d be the first to pass judgment.\n&gt;\n&gt; Jeremy\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, bruce halliday\n&gt; &lt;paranormalinvestigating@...&gt; wrote:\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Frank R.\n&gt; &gt;\n&gt; &gt; Maybe a bad choice of words, used to express what my thoughts where.\n&gt; &gt; When I say higher being, my meaning is a spirit being on a higher\n&gt; plane of spiritual existence.\n&gt; &gt; not beings that lord over us as if they are royalty and we subjects.\n&gt; &gt;\n&gt; &gt; My theory of why they will not give any detailed information about\n&gt; their physical experience on earth\n&gt; &gt; is that they want our trust as colleagues in a spiritual sense. just\n&gt; suppose Mike gave me his sir name and where he was from.\n&gt; &gt; when in the physical, say I used that information to trace his\n&gt; history as a physical human being. And found that he was a\n&gt; &gt; congressman or senator or supreme court judge. Someone that was\n&gt; distinguished and held a position of high respect and standing.\n&gt; &gt; Or on the other side of the coin, I found that he was a murderer and\n&gt; a rapist that had been executed.\n&gt; &gt;\n&gt; &gt; We as physical human beings would pass judgement on his former\n&gt; physical character and treat him or his guidance accordingly.\n&gt; &gt; I believe just the opposite of what you referred I believe that is\n&gt; the reason we do not get the detailed information, so that we\n&gt; &gt; start on a level playing field and form a relationship according to\n&gt; experience we have interacting as spirit and physical counterparts.\n&gt; &gt;\n&gt; &gt; Bruce\n&gt; &gt; Bruce Halliday\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; To: EVP-ITC@...: warrior18eii@...: Wed, 6 Feb 2008 07:32:06\n&gt; -0800Subject: Re: [EVP-ITC] A question for the researchers ????\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Bruce,It has always been my understanding that they do not like\n&gt; being referred to as higher or superior. They only refer to themselves\n&gt; as having different experiences. To be superior means to have\n&gt; authority over you, which they do not possess. Don&#39;t make the mistake\n&gt; of believing they are superior it can lead to some bad experiences.\n&gt; Just an observation on my part!Regards,Frank R.\n&gt; &gt; ----- Original Message ----From: bruce halliday\n&gt; &lt;paranormalinvestigating@...&gt;To: evp-itc@...: Wednesday, February 6,\n&gt; 2008 8:30:39 AMSubject: RE: [EVP-ITC] A question for the  \n&gt; researchers ????\n&gt; &gt;\n&gt; &gt; Ralph, Mike and lisa have been my tech&#39;s since I have started doing\n&gt; box research. Over time you build a relationship with your tech or in\n&gt; my case tech&#39;s like you would with a new friend here in the physical.\n&gt; Early on in my research I had asked a series of questions pertaining\n&gt; to mike and Lisa&#39;s background in the physical. I was told that mike\n&gt; died in 1995 from excessive blood loss and lisa died in 1912 from\n&gt; choking. they then changed the subject and never broached it again. My\n&gt; theory on the reason for this is thata spirit contact wants to remain\n&gt; in our thoughts and emotions as a higher being to develop a certain\n&gt; ammount of trustbeing sight unseen. So to give us all the details of\n&gt; there physical life or even their last name, that could allow us\n&gt; togather information on who they where while in the physical and that\n&gt; in our minds would put them on an even level with us. So the thoughts\n&gt; and feelings of there being superior spiritual entities would fade.  \n&gt; Bruce\n&gt; &gt; Bruce Halliday\n&gt; &gt; To: EVP-ITC@yahoogroups .comFrom: Ralphsmi@comcast. netDate: Wed, 6\n&gt; Feb 2008 09:38:57 +0000Subject: [EVP-ITC] A question for the\n&gt; researchers ????\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Hi everyone,I have been hearing the word &quot; Purple &quot; alot lately in\n&gt; my sessions.Does anyone in the group know what it pertains to ? It&#39;s\n&gt; been bugging me alot. Could that be a special group on their side ? I\n&gt; have no clue. Also has anyone questioned the voices if they have a\n&gt; last name ? All I hear on the RS boxes are first names and haven&#39;t\n&gt; recieved anyone telling me their last name. Does Mike and Lisa have a\n&gt; last name ? Did anyone here ever ask the question &quot; Are you Demonic\n&gt; Spirits ? &quot; What was their reply if any ? I did one time and got a\n&gt; response saying &quot; All of us are &quot;. Don&#39;t know whether I believe that\n&gt; Spirit or not. Probably a Joker saying that. I have asked for specific\n&gt; people for them to find so I could talk to and got an answer &quot; We&#39;re\n&gt; looking. &quot; Then I never heard from them after that. I&#39;m still waiting\n&gt; to be contacted by Telephone so far nothing yet. They make me laugh\n&gt; sometimes. I had the RS-12-469 on the one day I was just listening to\n&gt; what they were chatting about. I found my daughters old Fart Machine\n&gt; and was playing with it while the RS radio was running to see if it\n&gt; still works which it did. All of a sudden after I made it &quot; Toot &quot; I\n&gt; heard a female voice say &quot; Phew !!! .&quot;LOL, I guess she thought I\n&gt; really passed one. Also, the other day I was on the RS 12-469 and I\n&gt; said &quot; Hello Lisa how are you doing today ? &quot; Then a few seconds later\n&gt; I hear a female voice say &quot; Bruce ? &quot; like she thought that I was\n&gt; Bruce talking to her. I told her no it&#39;s me Ralph from Harrisburg,PA\n&gt; she replied &quot;Oh, okay fine. &quot; I hear all the time voices calling for\n&gt; Lisa she must be a very Popular Technician. Oh well I guess it was\n&gt; more than one question LOL. Hey you all take care and &quot; Keep the Sweep\n&gt; &quot; a new slogan for here LOL. just kidding. You all have a great\n&gt; day.Regards,Ralph the Ghost HunterShed those extra pounds with MSN and\n&gt; The Biggest Loser! Learn more.\n&gt; &gt;\n&gt; &gt; Never miss a thing. Make Yahoo your homepage.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; __________________________________________________________\n&gt; &gt; Connect and share in new ways with Windows Live.\n&gt; &gt;\n&gt; http://www.windowslive.com/share.html? \n&gt; ocid=TXT_TAGHM_Wave2_sharelife_012008\n&gt; &gt;\n&gt;\n&gt;\n&gt; \n\n\nI'm no so su e I would, bu ha 's jus me. I'm e y open o he concep o edemp ion and o shades o g ay.Ac ually, I'm he e o con ess o doing exac ly wha B uce is discussing. I go he name Nicholson Lawson a ew sessions ago. I asked i ha was one pe son's ull name o wo people's las names, and was old i was one. I wen h ough eco ds a Ances y.com and ound a Nicholson Lawson who was lis ed as a ca pen e in he Louis ille, Ken ucky 1890 di ec o y, and wha may be he same man in New Ha en, Connec icu in 1919. These a e he only wo eco ds o anyone by ha name in he U.S. o U.K. ha a e cu en ly indexed. I migh no be he same Nicholson Lawson, bu i s such an unusual name. I didn' expec o ind anyone in he his o ic eco d wi h ha name, hones ly, bu he e he is.AnnOn Feb 6, 2008, a 4:17 PM, ecuyle w o e:Tha 's e y p o ound B uce. I unde s and wha you' e saying abou passing judgmen o pas ac ions. Tha makes pe ec sense. I ha e o admi i , bu I'd be he i s o pass judgmen .Je emy--- In EVP-ITC@yahoog oups.com, b uce hallidaya ing@...> w o e:>> > F ank R.> > Maybe a bad choice o wo ds, used o exp ess wha my hough s whe e.> When I say highe being, my meaning is a spi i being on a highe plane o spi i ual exis ence.> no beings ha lo d o e us as i hey a e oyal y and we subjec s. > > My heo y o why hey will no gi e any de ailed in o ma ion abou hei physical expe ience on ea h> is ha hey wan ou us as colleagues in a spi i ual sense. jus suppose Mike ga e me his si name and whe e he was om.> when in he physical, say I used ha in o ma ion o ace hishis o y as a physical human being. And ound ha he was a > cong essman o sena o o sup eme cou judge. Someone ha wasdis inguished and held a posi ion o high espec and s anding.> O on he o he side o he coin, I ound ha he was a mu de e anda apis ha had been execu ed.> > We as physical human beings would pass judgemen on his o me physical cha ac e and ea him o his guidance acco dingly.> I belie e jus he opposi e o wha you e e ed I belie e ha is he eason we do no ge he de ailed in o ma ion, so ha we > s a on a le el playing ield and o m a ela ionship acco ding oexpe ience we ha e in e ac ing as spi i and physical coun e pa s.> > B uce > B uce Halliday > > > To: EVP-ITC@...: wa io 18eii@...: Wed, 6 Feb 2008 07:32:06-0800Subjec : Re: [EVP-ITC] A ques ion o he esea che s ????> > > > > > > B uce,I has always been my unde s anding ha hey do no likebeing e e ed o as highe o supe io . They only e e o hemsel esas ha ing di e en expe iences. To be supe io means o ha eau ho i y o e you, which hey do no possess. Don' make he mis akeo belie ing hey a e supe io i can lead o some bad expe iences.Jus an obse a ion on my pa !Rega ds,F ank R.> ----- O iginal Message ----F om: b uce hallidaya ing@...>To: e p-i c@...: Wednesday, Feb ua y 6,2008 8:30:39 AMSubjec : RE: [EVP-ITC] A ques ion o he esea che s ????> > Ralph, Mike and lisa ha e been my ech's since I ha e s a ed doingbox esea ch. O e ime you build a ela ionship wi h you ech o inmy case ech's like you would wi h a new iend he e in he physical.Ea ly on in my esea ch I had asked a se ies o ques ions pe aining o mike and Lisa's backg ound in he physical. I was old ha mikedied in 1995 om excessi e blood loss and lisa died in 1912 omchoking. hey hen changed he subjec and ne e b oached i again. My heo y on he eason o his is ha a spi i con ac wan s o emainin ou hough s and emo ions as a highe being o de elop a ce ainammoun o us being sigh unseen. So o gi e us all he de ails o he e physical li e o e en hei las name, ha could allow us oga he in o ma ion on who hey whe e while in he physical and ha in ou minds would pu hem on an e en le el wi h us. So he hough sand eelings o he e being supe io spi i ual en i ies would ade. B uce> B uce Halliday > To: EVP-ITC@yahoog oups .comF om: Ralphsmi@comcas . ne Da e: Wed, 6Feb 2008 09:38:57 +0000Subjec : [EVP-ITC] A ques ion o he esea che s ????> > > Hi e e yone,I ha e been hea ing he wo d \" Pu ple \" alo la ely inmy sessions.Does anyone in he g oup know wha i pe ains o ? I 'sbeen bugging me alo . Could ha be a special g oup on hei side ? Iha e no clue. Also has anyone ques ioned he oices i hey ha e alas name ? All I hea on he RS boxes a e i s names and ha en' ecie ed anyone elling me hei las name. Does Mike and Lisa ha e alas name ? Did anyone he e e e ask he ques ion \" A e you DemonicSpi i s ? \" Wha was hei eply i any ? I did one ime and go a esponse saying \" All o us a e \". Don' know whe he I belie e ha Spi i o no . P obably a Joke saying ha . I ha e asked o speci icpeople o hem o ind so I could alk o and go an answe \" We' elooking. \" Then I ne e hea d om hem a e ha . I'm s ill wai ing o be con ac ed by Telephone so a no hing ye . They make me laughsome imes. I had he RS-12-469 on he one day I was jus lis ening owha hey we e cha ing abou . I ound my daugh e s old Fa Machineand was playing wi h i while he RS adio was unning o see i i s ill wo ks which i did. All o a sudden a e I made i \" Too \" Ihea d a emale oice say \" Phew !!! .\"LOL, I guess she hough I eally passed one. Also, he o he day I was on he RS 12-469 and Isaid \" Hello Lisa how a e you doing oday ? \" Then a ew seconds la e I hea a emale oice say \" B uce ? \" like she hough ha I wasB uce alking o he . I old he no i 's me Ralph om Ha isbu g,PAshe eplied \"Oh, okay ine. \" I hea all he ime oices calling o Lisa she mus be a e y Popula Technician. Oh well I guess i wasmo e han one ques ion LOL. Hey you all ake ca e and \" Keep he Sweep\" a new slogan o he e LOL. jus kidding. You all ha e a g ea day.Rega ds,Ralph he Ghos Hun e Shed hose ex a pounds wi h MSN andThe Bigges Lose ! Lea n mo e. > > Ne e miss a hing. Make Yahoo you homepage. > > > > > > > > __________________________________________________________> Connec and sha e in new ways wi h Windows Li e.>h p://www.windowsli e.com/sha e.h ml?ocid=TXT_TAGHM_Wa e2_sha eli e_012008>"}