{"id": "7047", "subject": "Re: [EVP-ITC] Re: Looking for OJT in San Diego", "author": "Ron Lederer", "timestamp": "2008-02-09T14:52:50Z", "full_text": "--0-1516161039-1202568770=:85821\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nThanks Mike.  I assume you got the check.  Ron\n\n&quot;M.A. Coletta (Mike)&quot; &lt;michaelcoletta@...&gt; wrote:          Hi Ron,\n\nHopefully your sister has received the radio already. It got shipped \npriority mail. Have fun with it. I really like the way the FM scan \nrate is....\n\n- Mike\n\n--- In EVP-ITC@yahoogroups.com, Ron Lederer &lt;ronriko@...&gt; wrote:\n&gt;\n&gt; I will be traveling to San Diego from Mexico to visit my sister and \npick up the RS 125 Mike is sending me. I will be in the San Diego \nand El Centro area from Feb 15 to 19 and I would love to be able to \nmeet-up with someone from the area who has experience with EVP \ntechnology. Mike is sending a box already hacked so we can work with \nthe box and hopefully get something recorded. Since I have little \nexperience as a newbie to this, I would love to see how someone puts \nall of it together...recording, analyzing, etc. \n&gt; \n&gt; If you have the time and are willing to give a little on-the-job \ntraining, please let me know by email. By the way, in mid June I \nwill be traveling from Penn. to NC for two weeks and would love to \nget together with folks over in that area. I will probably be \nordering a mini-box to be sent to my folks house in Allentown, so I \nwill have that to play with. Let me know. Ron Lederer\n&gt; \n&gt; \n&gt; ---------------------------------\n&gt; Never miss a thing. Make Yahoo your homepage.\n&gt;\n\n\n\n                         \n\n       \n---------------------------------\nBe a better friend, newshound, and know-it-all with Yahoo! Mobile.  Try it now.\r\n--0-1516161039-1202568770=:85821\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nThanks Mike.&nbsp; I assume you got the check.&nbsp; Ron&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;&quot;M.A. Coletta (Mike)&quot; &lt;michaelcoletta@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;div&gt;Hi Ron,&lt;BR&gt;&lt;BR&gt;Hopefully your sister has received the radio already. It got shipped &lt;BR&gt;priority mail. Have fun with it. I really like the way the FM scan &lt;BR&gt;rate is....&lt;BR&gt;&lt;BR&gt;- Mike&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;, Ron Lederer &lt;ronriko@...&lt;WBR&gt;&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; I will be traveling to San Diego from Mexico to visit my sister and &lt;BR&gt;pick up the RS 125 Mike is sending\n me. I will be in the San Diego &lt;BR&gt;and El Centro area from Feb 15 to 19 and I would love to be able to &lt;BR&gt;meet-up with someone from the area who has experience with EVP &lt;BR&gt;technology. Mike is sending a box already hacked so we can work with &lt;BR&gt;the box and hopefully get something recorded. Since I have little &lt;BR&gt;experience as a newbie to this, I would love to see how someone puts &lt;BR&gt;all of it together...recordin&lt;WBR&gt;g, analyzing, etc. &lt;BR&gt;&gt; &lt;BR&gt;&gt; If you have the time and are willing to give a little on-the-job &lt;BR&gt;training, please let me know by email. By the way, in mid June I &lt;BR&gt;will be traveling from Penn. to NC for two weeks and would love to &lt;BR&gt;get together with folks over in that area. I will probably be &lt;BR&gt;ordering a mini-box to be sent to my folks house in Allentown, so I &lt;BR&gt;will have that to play with. Let me know. Ron Lederer&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; ------------&lt;WBR&gt;---------&lt;WBR&gt;---------&lt;WBR&gt;---&lt;BR&gt;&gt; Never miss a thing. Make Yahoo your\n homepage.&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/div&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;p&gt;&#32;\n      &lt;hr size=1&gt;Be a better friend, newshound, and \nknow-it-all with Yahoo! Mobile. &lt;a href=&quot;http://us.rd.yahoo.com/evt=51733/*http://mobile.yahoo.com/;_ylt=Ahu06i62sR8HDtDypao8Wcj9tAcJ &quot;&gt; Try it now.&lt;/a&gt;\r\n--0-1516161039-1202568770=:85821--"}