{"id": "7058", "subject": "Re: Looking for OJT in San Diego", "author": "M.A. Coletta (Mike)", "timestamp": "2008-02-10T00:41:55Z", "full_text": "Hi LC,\n\nThanks!  I sent one Gabs way, but I still have the one with the \nwires.  I&#39;m still testing it every once in awhile too.\nI need more time on it though to see if it&#39;s worth the build.\n\n-Mike\n\n--- In EVP-ITC@yahoogroups.com, &quot;LC Duplatt&quot; &lt;lcdupla@...&gt; wrote:\n&gt;\n&gt; Hey, Mike C...heard your interview on Glimpse Through the Veil with \n&gt; Gab...nice job, buddy!  Loved the cemetery note story...just \n&gt; brilliant!\n&gt; \n&gt; How&#39;s that little chamber do-hicky working for you, btw? ;)\n&gt; \n&gt; LC\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;M.A. Coletta (Mike)&quot; \n&gt; &lt;michaelcoletta@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hi Ron,\n&gt; &gt; \n&gt; &gt; Hopefully your sister has received the radio already.  It got \n&gt; shipped \n&gt; &gt; priority mail.  Have fun with it.  I really like the way the FM \n&gt; scan \n&gt; &gt; rate is....\n&gt; &gt; \n&gt; &gt; - Mike\n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, Ron Lederer &lt;ronriko@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; I will be traveling to San Diego from Mexico to visit my sister \n&gt; and \n&gt; &gt; pick up the RS 125 Mike is sending me.  I will be in the San \nDiego \n&gt; &gt; and El Centro area from Feb 15 to 19 and I would love to be able \nto \n&gt; &gt; meet-up with someone from the area who has experience with EVP \n&gt; &gt; technology.  Mike is sending a box already hacked so we can work \n&gt; with \n&gt; &gt; the box and hopefully get something recorded.  Since I have \nlittle \n&gt; &gt; experience as a newbie to this, I would love to see how someone \n&gt; puts \n&gt; &gt; all of it together...recording, analyzing, etc.  \n&gt; &gt; &gt;    \n&gt; &gt; &gt;   If you have the time and are willing to give a little on-the-\n&gt; job \n&gt; &gt; training, please let me know by email.  By the way, in mid June I \n&gt; &gt; will be traveling from Penn. to NC for two weeks and would love \nto \n&gt; &gt; get together with folks over in that area.  I will probably be \n&gt; &gt; ordering a mini-box to be sent to my folks house in Allentown, so \nI \n&gt; &gt; will have that to play with.  Let me know.  Ron Lederer\n&gt; &gt; &gt; \n&gt; &gt; &gt;        \n&gt; &gt; &gt; ---------------------------------\n&gt; &gt; &gt; Never miss a thing.   Make Yahoo your homepage.\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}