{"id": "7065", "subject": "Re: Sighhhh", "author": "LC Duplatt", "timestamp": "2008-02-10T15:34:50Z", "full_text": "&quot;You all want to communicate with the other side, how about starting \ncommunication HERE on this side with each other.&quot;\n\nThat is the best statement I have ever read on this board and all of \nus could stand to soak it in and live it in our daily lives by \nexample, myself included.  ;)\n\nLC\n\n\n--- In EVP-ITC@yahoogroups.com, Misty Dawn &lt;bulletbabea@...&gt; wrote:\n&gt;\n&gt; Hi guys. \n&gt;    \n&gt;   Just got back today. Spent the last 2 nights trying to get my pc \nup and running so I could get back online, and came back to see some \njunk had transpired. A few of you seem to completely disagree, a few \nof you seem to wholeheartedly agree.... doesnt really matter with who \nyou do or dont agree. I think thats about where we sit.\n&gt;    \n&gt;   As for Bruce, he has unjoined and can be found over on Jeremy&#39;s \ngroup. Feel free to join him if you wish. Nobody will feel bad toward \nyou if you do. A couple of you already have. As for his ban...never \nhappened. He was just put on suspension for attacking members on and \noff the board, and I have to say it wasn&#39;t cool at all what was said. \nJust very disappointing.\n&gt;    \n&gt;   I like Bruce, I think he CAN be a nice guy...I also know he can \nbe quite nasty when he gets upset. Even he admits that. A few others \nhere have that quality as well. Everyones human, we all make \nmistakes. I like everyone here, I just wish that you guys would show \nmore respect for each other with your words. You all want to \ncommunicate with the other side, how about starting communication \nHERE on this side with each other. If you can improve that who knows \nmaybe that link to the other side will improve as well?\n&gt;    \n&gt;   As for the mods, like it or not there are a couple of them. Since \nFrank S had some things going on and I work alot, two people were \nmade mods simply to help out and allow people to join or approve spam \nposts when we arent around. They never thought they would have to \ndeal with childish antics, in fact they didnt even have the ban \nbuttons in operation. I thought we would never need that here. \n&gt;    \n&gt;   They arent dictators, just people same as you and I. They havent \nbanned anyone yet nor have I and its gotten pretty nasty here a few \ntimes and on any other group those involved would be kicked to the \ncurb faster than you can say &quot;what happened&quot;.\n&gt;    \n&gt;   So to answer your questions, no Bruce was not banned, yes he was \ntemporarily suspended from posting and yes he did exit voluntarily. \nAnd yes it is sad to see, very sad indeed.\n&gt;    \n&gt;   I cant control who says what, nor can I control thier actions, I \ncan only try to control myself. If we all had a little more self \ncontrol, conflicts like this wouldnt arise.\n&gt;    \n&gt;   For those who wanted my input, there ya go. Not much more I can \nsay or do on this subject.\n&gt;    \n&gt;   Misty\n&gt; \n&gt; \n&gt; \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt;        \n&gt; ---------------------------------\n&gt; Looking for last minute shopping deals?  Find them fast with Yahoo! \nSearch.\n&gt;"}