{"id": "707", "subject": "Re: I&#39;m a new member/Lyn", "author": "angels4lyn", "timestamp": "2007-02-07T17:46:15Z", "full_text": "well so far,   the voices call our name when we are either watching tv,\nworking on the computer or trying to sleep.\nthey call the cats too, and the cats go running to them.\nthey are crystal clear voices, and just come about at the oddest times.,\nbut they call family members by name.  they usually are behind the\nperson....and will then call their name.   its become a running joke in our\nfamily now  as this has gone on for 10 years.\nI bought a voice activated tape recorder... in hopes of capturing this on\ntape. but no luck yet,.\nI was told to take Pics around the house to look for orbs and such.  we have\nnever &#39;seen&#39; anything, but we&#39;ve seen activity,  books that get picked up\noff the shelf, suspend in air and then drop to the floor (that one scared my\nson & I as we were eatchign tv when it happened), doors that open and close\nthru out the day & night when I am only one home.\nchair cushions that were yanked down while I sat there and watched it... and\nthe one that surprised us all is our house has an odd freestanding fireplace\nwith a round platform with white rocks.   something kicked the rocks one\nevening while we watched tv, and the rocks flew across the room.___\nI  was impress in ghost hunters and how they captured voices on recorders.\nand thought that might help us solve this.    we dont have ghosts, we dont\nhave orbs,m we just have something that calls us by name, calls the cats,\nand moves things in the house.\nLyn_____________________________________________________________________\n________________________________________________________________________\n&gt;\n&gt; 2b. Re: I&#39;m a new member\n&gt;     Posted by: &quot;Frank Sumption&quot; franks-boxes@... purplespacefriend\n&gt;     Date: Tue Feb 6, 2007 11:58 am ((PST))\n&gt;\n&gt; Welcome Lyn;\n&gt;\n&gt; I&#39;m not sure how to advise you. Sometimes you need some kind of background\n&gt; nosie for the spirits to make a voices out of, like running water, a fan,\nor\n&gt; white noise. I have my own method I use, but I don&#39;t have anything I can\n&gt; offer at the moment. Often it takes several attempts before you get\nresults.\n&gt;\n&gt; FRank\n&gt;"}