{"id": "708", "subject": "Re: I&#39;m New Here/Lyn", "author": "angels4lyn", "timestamp": "2007-02-07T18:02:14Z", "full_text": "HI Amy,\nI dont really think I am &#39;ghost hunting&#39;, but more just trying to find\nanswers.\nall we know is something goes on here, and we&#39;d like to know who, what, why\ntype thing.\nI was impressed with ghost hunters show because of their communication\nproof.\nthat got me to thinking maybe we can find out something here.\nits just really odd, because sometimes its very quite for 6 months.. no\nvoices, no activity, and then boom, it will be active all day long, several\ndays in a row, etc.\nwe never know.\nwe just dont get scared anymore like we use to.\nthis house sat empty for many months, they had trouble renting it.\nwe come along, and the first 2-3 years I wanted to move....but we stuck it\nout.\nI once lived in a very evil house... for some reason I get &#39;feelings&#39; about\nplaces and things.. and that house ..it had a feeling of evil , we had to\nfind someone who could help us. and then we moved as fast as we could.\nI saw the movie white noise. but I dont undertsand it.  so have tried a\nvoice activated recorder. have been told it will pick up voices in the\nhouse.\nbut not yet. but everything is so random here..I guess it could take us\nawhile.\nso I&#39;m here just reading and learning.\nLyn.\n\n\n&gt;\n&gt; 2c. Re: I&#39;m a new member\n&gt;     Posted by: &quot;LON3_S7AR&quot; lon3_s7ar@... lon3_s7ar\n&gt;     Date: Tue Feb 6, 2007 1:22 pm ((PST))\n&gt;\n&gt; ive been out on hunts, the best advice i can give is this, shut down\neverything in your house, the heat/air etc tv&#39;s. At night whenits quiet sit\nin a room and introduce yourself, and if theres anyone here that would like\nto communicate. Can as them to make a noise or stop a clock, grandfather\ntype work best, have seen one stopped by a grandmother &quot;residing&quot; in her\nsons house. The work that you will see mostly on this evp group is done at\nhome and not for &quot;ghost hunting&quot; per say, rather making contact with those\non the other side that are able to make contact. We have people here that\nare in constant contact with &quot;groups&quot; on the other side and relatives. Frank\nreceives communications about events people etc as well. This is a rather\nbroad mineded group and very evp smart.\n&gt; if you need anything else or advice you can always catch me on yahoo\nmessenger too.\n&gt; amy\n&gt;\n&gt;"}