{"id": "7101", "subject": "Re: [EVP-ITC] New file uploaded to EVP-ITC", "author": "Lisby", "timestamp": "2008-02-11T16:51:59Z", "full_text": "Welcome to the great Seven mystery, Nellie. A lot of people get the  \nname/word. I get it constantly. I can&#39;t tell if it an entity or a  \nconfirmation word like, &quot;copy,&quot; which I also get a lot. Rosemary also  \ngets Seven and know others on this list have in the past. There is  \nsome theory that this is a collective entity that was involved in the  \nITC bridge group back in the 1980s, but it could just as easily be  \nsomething the current technicians decided to use to comfort us. We  \nreally don&#39;t know at this point.\n\nAnn\n\nOn Feb 11, 2008, at 11:45 AM, Nellie Kampmann wrote:\n\n&gt; On 11 Feb 2008 16:07:53 -0000, &lt;EVP-ITC@yahoogroups.com&gt; wrote:\n&gt; &gt; File : /Ann&#39;s files/problemseven020408.mp3\n&gt; &gt; Uploaded by : lisbyfarrum &lt;lisby@...&gt;\n&gt; &gt; Description : My last session appears to have been crashed by the  \n&gt; cursing\n&gt; &gt; entities. Amidst the swearing, &quot;Problem, Seven.&quot; I hear an  \n&gt; English accent.\n&gt;\n&gt; I&#39;m at work where I can&#39;t download the file. However, this message\n&gt; has me intrigued already. A friend of mine just started experimenting\n&gt; with a Shack hack last night and also got a message of &quot;seven&quot;. When\n&gt; she asked for clarification, the response was &quot;you&#39;ll see&quot;. Hmmm.\n&gt;\n&gt; Nellie\n&gt;\n&gt; \n\n\nWelcome o he g ea Se en mys e y, Nellie. A lo o people ge he name/wo d. I ge i cons an ly. I can' ell i i an en i y o a con i ma ion wo d like, \"copy,\" which I also ge a lo . Rosema y also ge s Se en and know o he s on his lis ha e in he pas . The e is some heo y ha his is a collec i e en i y ha was in ol ed in he ITC b idge g oup back in he 1980s, bu i could jus as easily be some hing he cu en echnicians decided o use o com o us. We eally don' know a his poin .AnnOn Feb 11, 2008, a 11:45 AM, Nellie Kampmann w o e:On 11 Feb 2008 16:07:53 -0000, EVP-ITC@yahoog oups.com> w o e:> File : /Ann's iles/p oblemse en020408.mp3> Uploaded by : lisby a um lisby@ea hlink.ne >> Desc ip ion : My las session appea s o ha e been c ashed by he cu sing> en i ies. Amids he swea ing, \"P oblem, Se en.\" I hea an English accen .I'm a wo k whe e I can' download he ile. Howe e , his messagehas me in igued al eady. A iend o mine jus s a ed expe imen ingwi h a Shack hack las nigh and also go a message o \"se en\". Whenshe asked o cla i ica ion, he esponse was \"you'll see\". Hmmm.Nellie"}