{"id": "7125", "subject": "Re: Brookings Report applies?", "author": "misujoey", "timestamp": "2008-02-12T15:56:14Z", "full_text": "Hi Rob .. I like your telephone idea!  I just started \ndoing &quot;RadioSweep&quot; Conference Calls ... I&#39;m recording with others via \na &quot;Conference call recording room&quot; and it is allowing a group of \npeople at a time test out my &quot;MiniBox&quot; and &quot;SuperBox&quot; through the \ntelephone.  I&#39;m hoping this will allow longer messages from our loved \nones in Heaven!  \n\nDebbie\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;dead.science&quot; &lt;dead.science@...&gt; \nwrote:\n&gt;\n&gt; I think your right sir:\n&gt; \n&gt; I have found a way to make a box that everyone can use, and I may \njust\n&gt; do it now!  I have a way to put a box on a telephone line and set it\n&gt; up so it can be operated by the phones DTMF tones.  You can power it\n&gt; on and off, control vol, scan rate, band, ect.  I could have it all\n&gt; recorded and then emailed to the caller.  If I made it open to \nanybody\n&gt; with a phone it might be &quot;less&quot; of an ego trip for the people \ninvolved\n&gt; in this.  I would like to hear your thoughts on this idea.\n&gt; Rob.\n&gt; -- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@&gt; \nwrote:\n&gt; &gt;\n&gt; &gt; \n&gt; &gt; Hi All;\n&gt; &gt;  I&#39;m wondering why some many that do this &quot;reseach&quot; go mash \npotatoes\n&gt; in the head, developing what seems to be that messiah complex. Box\n&gt; user after box user seems to go down this road. I don&#39;t know if it&#39;s\n&gt; just human ego, or they get possessed, or what. Maybe it&#39;s blinded \nby\n&gt; dollar signs!? Maybe it&#39;s like the Brookings Report, people just can\n&gt; not handle the truth on a psychological/ego level. I think that \nreport\n&gt; applies to all encounters with  the vastness of the universe. \n&gt; &gt;  \n&gt; &gt;  I can&#39;t provide boxes for anyone else until I figure this stuff\n&gt; out. It&#39;s not ethical to give people something that has the \npotential\n&gt; of fucking them up, to be blunt. I wanted to give these boxes out to\n&gt; see how it worked for others, to see if they got something like I \ndid,\n&gt; and so far it&#39;s very disappointing. It&#39;s almost like an experiment \non\n&gt; people, except most were pretty much begging for, and demanding the\n&gt; things. Even if it&#39;s not the boxes per se`, that&#39;s even more reason \nto\n&gt; avoid the situation. \n&gt; &gt;  \n&gt; &gt;  Frank-S\n&gt; &gt; _________________________________________________________________\n&gt; &gt; Need to know the score, the latest news, or you need your\n&gt; Hotmail-get your &quot;fix&quot;.\n&gt; &gt; http://www.msnmobilefix.com/Default.aspx\n&gt; &gt;\n&gt;"}