{"id": "7129", "subject": "Re: To Frank S.", "author": "sdudly", "timestamp": "2008-02-12T20:13:01Z", "full_text": "Thank you Frank for the response. \n\nMy strength definitely isn&#39;t in the electronics end of research\nalthough I can do just about anything with a computer. \n\nI believe I tend to lean more on the philosophical end of everything.  \n\nThanks again for all your efforts in the field. Please don&#39;t let the\nfew confused eggs hinder you in any way. There are many more of us\nthat respect your efforts and value your insight more then any boxes.\n\nTo me at least it is often more then any instrumentation on this side\nbut our own mind set. \n\nThanks again.\nTT\n\n --- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot;\n&lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  I started in EVP wiht white, then various other noise methods, and \n&gt; eventuallly found EVPmaker on the web. Evepmaker worked reallly well \n&gt; fro me, but i kept getting messages realyed from spirits that \n&gt; couldn&#39;t use the computer, by the ones that could. I was ewondering \n&gt; what else I could use, and after aobut a week, the whole copncept of \n&gt; the box kinda popped int my head fully formed. I think it was my own \n&gt; subconcious mind that assembeld information from past experience, and \n&gt; presented it as a solutuion to the problem. I had worked wijht these \n&gt; radio modules from car stereos a few years previous, and knew they \n&gt; cold be voltage tuned, so I come up wiht an analog version of \n&gt; EVPmaker, pretty much. \n&gt; \n&gt;  Frank-S\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;sdudly&quot; &lt;sdudly@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Frank,\n&gt; &gt; \n&gt; &gt; To start off with no I do not want a box. =) \n&gt; &gt; \n&gt; &gt; However, I do have a question for you when you have time.  I was \n&gt; just\n&gt; &gt; curious as to where you got the inspiration for the box. \n&gt; &gt; \n&gt; &gt; Was it just an idea that popped into your head or did you have help\n&gt; &gt; from the other side?  Not to take any credit away from you at all \n&gt; with\n&gt; &gt; your accomplishments with the box. It was just something I was \n&gt; curious\n&gt; &gt; about.\n&gt; &gt; \n&gt; &gt; I believe I am looking for personal answers from the other side but\n&gt; &gt; also I feel it may help me with some more general directions I may\n&gt; &gt; want to go in after putting my own personal demons to rest. \n&gt; &gt; \n&gt; &gt; Thanks for your time in advance.\n&gt; &gt; \n&gt; &gt; Regards,\n&gt; &gt; TT\n&gt; &gt;\n&gt;"}