{"id": "7139", "subject": "Re: [EVP-ITC] Re: EVP--Ann", "author": "Lisby", "timestamp": "2008-02-12T23:43:44Z", "full_text": "Sending out a mental message can&#39;t possibly hurt. I suspect they can  \nfind you wherever you go. I&#39;m rooting for you!\n\nAnn\n\nOn Feb 12, 2008, at 6:22 PM, Robin Searcy Henson wrote:\n\n&gt;\n&gt; Ann, I&#39;m seeing this post two weeks after it was sent but wanted to  \n&gt; thank you for the pep talk.  I need it!  The DVD remote makes me  \n&gt; cry too..  I just can&#39;t understand why everything has to be so  \n&gt; complicated and why my kids and husband don&#39;t have the problems I  \n&gt; have.  I&#39;ve been carrying my two hacked radios and digital recorder  \n&gt; everywhere with me but have not sat down to seriously attempt a  \n&gt; session yet.  I work three days a week out of state and tonight am  \n&gt; planning to camp out in my car in a remote place so I can really be  \n&gt; alone with the equipment.  Do you think it would help for me to  \n&gt; send out verbal or mental messages that I&#39;m hoping to make contact  \n&gt; but don&#39;t know where I&#39;ll be yet?\n&gt;\n&gt; Robin\n&gt;\n&gt;\n&gt; ----- Original Message -----\n&gt; From: Lisby\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Wednesday, January 30, 2008 4:44 PM\n&gt; Subject: Re: [EVP-ITC] Re: EVP\n&gt;\n&gt; Robin, you can do it. It took me ages and about $900, but I finally  \n&gt; got it all together and its running well. I am a technical as an  \n&gt; onion. I can&#39;t operate the DVD remote without tears. But I hung in  \n&gt; there--and you must, too. This is a massively rewarding experience  \n&gt; and I can&#39;t wait to see what you get and who you get it from. :)\n&gt;\n&gt;\n&gt; Ann\n&gt;\n&gt; On Jan 30, 2008, at 7:03 PM, Robin Searcy Henson wrote:\n&gt;\n&gt;&gt;\n&gt;&gt; Thanks LC.  I&#39;m going to listen to your recordings tonight when I  \n&gt;&gt; get home.  I&#39;m intrigued by the box research and anxious to get  \n&gt;&gt; started, but frustrated that I&#39;m not mechanically inclined.  I  \n&gt;&gt; think you may be onto something with regard to people having  \n&gt;&gt; individual roles to play, and you must feel so inspired by the  \n&gt;&gt; messages you&#39;ve received.\n&gt;&gt;\n&gt;&gt; Robin\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; ----- Original Message -----\n&gt;&gt; From: LC Duplatt\n&gt;&gt; To: EVP-ITC@yahoogroups.com\n&gt;&gt; Sent: Wednesday, January 30, 2008 6:37 AM\n&gt;&gt; Subject: [EVP-ITC] Re: EVP\n&gt;&gt;\n&gt;&gt; Robin,\n&gt;&gt;\n&gt;&gt; I uploaded some of my recordings that indicate a bigger picture.\n&gt;&gt;\n&gt;&gt; Some of the messages say there are &quot;many spirits here,&quot; spirit rescue\n&gt;&gt; is &quot;very important,&quot; etc. You can go through them under LC&#39;s folder.\n&gt;&gt;\n&gt;&gt; Last Friday, I recorded with respect to 2008, &quot;psychic event&quot;\n&gt;&gt; and &quot;universal shift.&quot; That would indicate that there is a bigger\n&gt;&gt; thing going down, in my opinion. However, I also acknowledge that\n&gt;&gt; people here may have different callings/messages/uses other than what\n&gt;&gt; I am hearing. I am going to just follow where the path before me\n&gt;&gt; leads and try to find my role in it.\n&gt;&gt;\n&gt;&gt; Personally, I think this needs to be in many people&#39;s hands. That&#39;s\n&gt;&gt; an interest of mine, too. Not sure yet how it will happen, but the\n&gt;&gt; radio hacks are a nice start.\n&gt;&gt;\n&gt;&gt; LC\n&gt;&gt;\n&gt;&gt; --- In EVP-ITC@yahoogroups.com, &quot;Robin Searcy Henson&quot;\n&gt;&gt; &lt;MudPuddleFarm@...&gt; wrote:\n&gt;&gt; &gt;\n&gt;&gt; &gt; I haven&#39;t started box recording yet. My impression of the EVP I&#39;ve\n&gt;&gt; captured (which has been almost entirely obtained on the property I\n&gt;&gt; moved to six years ago) is that someone is attached to this place.\n&gt;&gt; The first message was &quot;Here come some people,&quot; as I was hiking up the\n&gt;&gt; hill one day with my goats, then a kill-you threat in the house,\n&gt;&gt; then &quot;get out of here&quot; in the barn. I assumed it must be one of the\n&gt;&gt; original owners, and I still feel that it&#39;s mainly one spirit\n&gt;&gt; communicating that this is their home, not mine. I&#39;ve gotten one\n&gt;&gt; uplifting message from what I believe to be the same entity, and this\n&gt;&gt; is also the last recording I&#39;ve gotten. I asked what death is like,\n&gt;&gt; compared to life: happy, beautiful, fulfilling--and specifically if\n&gt;&gt; death is less depressing. The response was &quot;It&#39;s everything.&quot;\n&gt;&gt; S/he/it basically stopped talking after that, and I stopped trying.\n&gt;&gt; I know this sounds weird, but I miss whoever or whatever it was. I\n&gt;&gt; wonder if some of us might be better at dealing with the low-life\n&gt;&gt; stuck or grounded entities rather than the highly evolved technicians\n&gt;&gt; coming through the more sophisticated equipment. I wonder where this\n&gt;&gt; is all going ultimately, other than to prove communication across the\n&gt;&gt; veil is possible. I&#39;m not an engineer or technologist on this\n&gt;&gt; physical plane, and I question what I have to offer this research\n&gt;&gt; since I&#39;m so electronically challenged. Meanwhile, the nurse side of\n&gt;&gt; me wants to heal and &quot;fix&quot; anyone needing help, even if they happen\n&gt;&gt; to be in the next world! Do the guides and technicians ever\n&gt;&gt; acknowledge or make reference to the earthbound spirits, and if so,\n&gt;&gt; in what context? Are we ever able to help unstick the stuck ones?\n&gt;&gt; Are we supposed to ignore them?\n&gt;&gt; &gt;\n&gt;&gt; &gt; Robin\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt; ----- Original Message -----\n&gt;&gt; &gt; From: LC Duplatt&lt;mailto:lcdupla@...&gt;\n&gt;&gt; &gt; To: EVP-ITC@yahoogroups.com&lt;mailto:EVP-ITC@yahoogroups.com&gt;\n&gt;&gt; &gt; Sent: Tuesday, January 29, 2008 3:32 AM\n&gt;&gt; &gt; Subject: [EVP-ITC] Re: EVP\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt; EVP:\n&gt;&gt; &gt;\n&gt;&gt; &gt; Not that this is always the case, but EVP seems to primarily\n&gt;&gt; capture\n&gt;&gt; &gt; lost people - ghosts being recorded, versus the box having the\n&gt;&gt; &gt; ability to capture primarily what seems to be higher\n&gt;&gt; communication\n&gt;&gt; &gt; from spirits, (and less of the lower communication - ghosts\n&gt;&gt; jumping\n&gt;&gt; &gt; in).\n&gt;&gt; &gt;\n&gt;&gt; &gt; That to me is a huge difference... ;)\n&gt;&gt; &gt;\n&gt;&gt; &gt; LC\n&gt;&gt; &gt; http://www.AngelsGhosts.com&lt;http://www.angelsghosts.com/&gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt; --- In EVP-ITC@yahoogroups.com&lt;mailto:EVP-ITC%\n&gt;&gt; 40yahoogroups.com&gt;, &quot;ecuyler&quot; &lt;ecuyler@&gt; wrote:\n&gt;&gt; &gt; &gt;\n&gt;&gt; &gt; &gt; I agree about the difference also. All that review time makes\n&gt;&gt; for a\n&gt;&gt; &gt; &gt; very tedious few hours. By the end of it you&#39;re ready to pull\n&gt;&gt; your\n&gt;&gt; &gt; &gt; hair out. I&#39;ve only done two sessions now and have gotten more\n&gt;&gt; &gt; &gt; positive results in 20 minutes time as I have in 10 years of\n&gt;&gt; EVP\n&gt;&gt; &gt; research.\n&gt;&gt; &gt; &gt;\n&gt;&gt; &gt; &gt; Jeremy\n&gt;&gt; &gt; &gt;\n&gt;&gt; &gt; &gt;\n&gt;&gt; &gt; &gt;\n&gt;&gt; &gt; &gt;\n&gt;&gt; &gt; &gt;\n&gt;&gt; &gt; &gt;\n&gt;&gt; &gt; &gt;\n&gt;&gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com&lt;mailto:EVP-ITC%\n&gt;&gt; 40yahoogroups.com&gt;, Lisby &lt;lisby@&gt; wrote:\n&gt;&gt; &gt; &gt; &gt;\n&gt;&gt; &gt; &gt; &gt; Very interested. And I agree with you about the overnight\n&gt;&gt; &gt; change.\n&gt;&gt; &gt; &gt; &gt; Orgs like AA-EVP that aren&#39;t dealing with the boxes are\n&gt;&gt; missing\n&gt;&gt; &gt; the\n&gt;&gt; &gt; &gt; &gt; boat.\n&gt;&gt; &gt; &gt; &gt;\n&gt;&gt; &gt; &gt; &gt; Ann\n&gt;&gt; &gt; &gt; &gt;\n&gt;&gt; &gt; &gt; &gt; On Jan 28, 2008, at 8:48 PM, Jules wrote:\n&gt;&gt; &gt; &gt; &gt;\n&gt;&gt; &gt; &gt; &gt; &gt; Well guys, I have to tell you that since I started box\n&gt;&gt; sessions\n&gt;&gt; &gt; in\n&gt;&gt; &gt; &gt; &gt; &gt; November I have become so spoiled that conventional EVP\n&gt;&gt; just\n&gt;&gt; &gt; don&#39;t do\n&gt;&gt; &gt; &gt; &gt; &gt; it for me.\n&gt;&gt; &gt; &gt; &gt; &gt;\n&gt;&gt; &gt; &gt; &gt; &gt; My organization was asked to come and do an investigation\n&gt;&gt; at a\n&gt;&gt; &gt; very\n&gt;&gt; &gt; &gt; &gt; &gt; historial place (here in Illinois). The owner of this home\n&gt;&gt; &gt; asked if I\n&gt;&gt; &gt; &gt; &gt; &gt; would bring one of the boxes to the home (he is amazed with\n&gt;&gt; the\n&gt;&gt; &gt; &gt; &gt; &gt; immediately 2 way communication). So upon respectfully\n&gt;&gt; asking\n&gt;&gt; &gt; my tec\n&gt;&gt; &gt; &gt; &gt; &gt; if it was alright to do a session outside the my home we\n&gt;&gt; did\n&gt;&gt; &gt; several\n&gt;&gt; &gt; &gt; &gt; &gt; box sessions along with conventional EVP. We wanted to see\n&gt;&gt; if\n&gt;&gt; &gt; we could\n&gt;&gt; &gt; &gt; &gt; &gt; discover some unanswered history about the residence, and\n&gt;&gt; the\n&gt;&gt; &gt; &gt; &gt; &gt; otherside\n&gt;&gt; &gt; &gt; &gt; &gt; was more than willing to comply.\n&gt;&gt; &gt; &gt; &gt; &gt;\n&gt;&gt; &gt; &gt; &gt; &gt; I have to tell you that the regular EVP recordings were and\n&gt;&gt; are\n&gt;&gt; &gt; the\n&gt;&gt; &gt; &gt; &gt; &gt; most boring data to review. Something I use to love so much\n&gt;&gt; has\n&gt;&gt; &gt; &gt; &gt; &gt; actually turned into a project given I am waiting for a\n&gt;&gt; response\n&gt;&gt; &gt; &gt; &gt; &gt; immediately! Too funny how things can change overnight!\n&gt;&gt; &gt; &gt; &gt; &gt;\n&gt;&gt; &gt; &gt; &gt; &gt; I will be uploading some files for these sessions if you\n&gt;&gt; are\n&gt;&gt; &gt; &gt; &gt; &gt; interested.\n&gt;&gt; &gt; &gt; &gt; &gt;\n&gt;&gt; &gt; &gt; &gt; &gt; Juli\n&gt;&gt; &gt; &gt; &gt; &gt;\n&gt;&gt; &gt; &gt; &gt; &gt;\n&gt;&gt; &gt; &gt; &gt; &gt;\n&gt;&gt; &gt; &gt; &gt;\n&gt;&gt; &gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;\n&gt;\n&gt;\n&gt; \n\n\nSending ou a men al message can' possibly hu . I suspec hey can ind you whe e e you go. I'm oo ing o you!AnnOn Feb 12, 2008, a 6:22 PM, Robin Sea cy Henson w o e:Ann, I'm seeing his pos wo weeks a e i was sen bu wan ed o hank you  o he pep alk.  I need i !  The DVD emo e makes me c y oo..  I jus can' unde s and why e e y hing has o be so complica ed and why my kids and husband don' ha e he p oblems I ha e.  I' e been ca ying my wo hacked adios and digi al eco de  e e ywhe e wi h me bu ha e no  sa down o se iously a emp a session ye .  I wo k h ee days a week ou o s a e and onigh am planning o camp ou in my ca in a emo e place so I can eally be alone wi h he equipmen .  Do you hink i would help o me o send ou e bal o men al messages ha I'm hoping o make con ac bu don' know whe e I'll be ye ?   Robin  ----- O iginal Message -----F om: LisbyTo: EVP-ITC@yahoog oups.comSen : Wednesday, Janua y 30, 2008 4:44 PMSubjec : Re: [EVP-ITC] Re: EVPRobin, you can do i . I ook me ages and abou $900, bu I inally go i all oge he and i s unning well. I am a echnical as an onion. I can' ope a e he DVD emo e wi hou ea s. Bu I hung in he e--and you mus , oo. This is a massi ely ewa ding expe ience and I can' wai o see wha you ge and who you ge i om. :)AnnOn Jan 30, 2008, a 7:03 PM, Robin Sea cy Henson w o e:Thanks LC.  I'm going o lis en o you eco dings onigh when I ge home.  I'm in igued by he box esea ch and anxious o ge s a ed, bu us a ed ha I'm no mechanically inclined.  I hink you may be on o some hing wi h ega d o people ha ing indi idual oles o play, and you mus eel so inspi ed by he messages you' e ecei ed. Robin  ----- O iginal Message -----F om: LC Dupla To: EVP-ITC@yahoog oups.comSen : Wednesday, Janua y 30, 2008 6:37 AMSubjec : [EVP-ITC] Re: EVPRobin,I uploaded some o my eco dings ha indica e a bigge pic u e.Some o he messages say he e a e \"many spi i s he e,\" spi i escue is \" e y impo an ,\" e c. You can go h ough hem unde LC's olde .Las F iday, I eco ded wi h espec o 2008, \"psychic e en \" and \"uni e sal shi .\" Tha would indica e ha he e is a bigge   hing going down, in my opinion. Howe e , I also acknowledge ha  people he e may ha e di e en callings/messages/uses o he han wha  I am hea ing. I am going o jus ollow whe e he pa h be o e me leads and y o ind my ole in i .Pe sonally, I hink his needs o be in many people's hands. Tha 's an in e es o mine, oo. No su e ye how i will happen, bu he  adio hacks a e a nice s a . LC--- In EVP-ITC@yahoog oups.com, \"Robin Sea cy Henson\" ...> w o e:>> I ha en' s a ed box eco ding ye . My imp ession o he EVP I' e cap u ed (which has been almos en i ely ob ained on he p ope y I mo ed o six yea s ago) is ha someone is a ached o his place. The i s message was \"He e come some people,\" as I was hiking up he hill one day wi h my goa s, hen a kill-you h ea in he house,  hen \"ge ou o he e\" in he ba n. I assumed i mus be one o he o iginal owne s, and I s ill eel ha i 's mainly one spi i  communica ing ha his is hei home, no mine. I' e go en one upli ing message om wha I belie e o be he same en i y, and his is also he las eco ding I' e go en. I asked wha dea h is like, compa ed o li e: happy, beau i ul, ul illing--and speci ically i  dea h is less dep essing. The esponse was \"I 's e e y hing.\" S/he/i basically s opped alking a e ha , and I s opped ying. I know his sounds wei d, bu I miss whoe e o wha e e i was. I wonde i some o us migh be be e a dealing wi h he low-li e s uck o g ounded en i ies a he han he highly e ol ed echnicians coming h ough he mo e sophis ica ed equipmen . I wonde whe e his is all going ul ima ely, o he han o p o e communica ion ac oss he  eil is possible. I'm no an enginee o echnologis on his physical plane, and I ques ion wha I ha e o o e his esea ch since I'm so elec onically challenged. Meanwhile, he nu se side o  me wan s o heal and \" ix\" anyone needing help, e en i hey happen  o be in he nex wo ld! Do he guides and echnicians e e  acknowledge o make e e ence o he ea hbound spi i s, and i so, in wha con ex ? A e we e e able o help uns ick he s uck ones? A e we supposed o igno e hem? > > Robin> > > ----- O iginal Message ----- > F om: LC Dupla lcdupla@...> > To: EVP-ITC@yahoog oups.comEVP-ITC@yahoog oups.com> > Sen : Tuesday, Janua y 29, 2008 3:32 AM> Subjec : [EVP-ITC] Re: EVP> > > EVP:> > No ha his is always he case, bu EVP seems o p ima ily cap u e > los people - ghos s being eco ded, e sus he box ha ing he > abili y o cap u e p ima ily wha seems o be highe  communica ion > om spi i s, (and less o he lowe communica ion - ghos s jumping > in).> > Tha o me is a huge di e ence... ;)> > LC> h p://www.AngelsGhos s.comh p://www.angelsghos s.com/>> > --- In EVP-ITC@yahoog oups.commail o:EVP-ITC%40yahoog oups.com>, \"ecuyle \" w o e:> >> > I ag ee abou he di e ence also. All ha e iew ime makes  o a> > e y edious ew hou s. By he end o i you' e eady o pull you > > hai ou . I' e only done wo sessions now and ha e go en mo e> > posi i e esul s in 20 minu es ime as I ha e in 10 yea s o  EVP > esea ch.> > > > Je emy> > > > > > > > > > > > > > > > --- In EVP-ITC@yahoog oups.commail o:EVP-ITC%40yahoog oups.com>, Lisby w o e:> > >> > > Ve y in e es ed. And I ag ee wi h you abou he o e nigh  > change. > > > O gs like AA-EVP ha a en' dealing wi h he boxes a e missing > he > > > boa .> > > > > > Ann> > > > > > On Jan 28, 2008, a 8:48 PM, Jules w o e:> > > > > > > Well guys, I ha e o ell you ha since I s a ed box sessions > in> > > > No embe I ha e become so spoiled ha con en ional EVP jus  > don' do> > > > i o me.> > > >> > > > My o ganiza ion was asked o come and do an in es iga ion a a > e y> > > > his o ial place (he e in Illinois). The owne o his home > asked i I> > > > would b ing one o he boxes o he home (he is amazed wi h  he> > > > immedia ely 2 way communica ion). So upon espec ully asking > my ec> > > > i i was al igh o do a session ou side he my home we did > se e al> > > > box sessions along wi h con en ional EVP. We wan ed o see i  > we could> > > > disco e some unanswe ed his o y abou he esidence, and  he > > > > o he side> > > > was mo e han willing o comply.> > > >> > > > I ha e o ell you ha he egula EVP eco dings we e and a e > he> > > > mos bo ing da a o e iew. Some hing I use o lo e so much has> > > > ac ually u ned in o a p ojec gi en I am wai ing o a  esponse> > > > immedia ely! Too unny how hings can change o e nigh !> > > >> > > > I will be uploading some iles o hese sessions i you a e > > > > in e es ed.> > > >> > > > Juli> > > >> > > >> > > >> > >> >>"}