{"id": "7172", "subject": "Re: To Frank S.", "author": "purplespacefriend", "timestamp": "2008-02-14T06:41:31Z", "full_text": "It&#39;s been my experience that they will use what ever we use. The \nlinear scanning of the radio s seems otbe easier fo rth entities to \ntrack and modify. I even swtiched to using only linear sweep in my \nboxes cuz i think it makes for  easier to understand messages. I have \none of the hacked Radio Shack radios, and it works, it just scans \nalittle slower than I&#39;m used to. \n\n Honestly, I don&#39;t know all the much about the paranormal per se`, \nI&#39;m guided almost entirely by intuition. I&#39;ve never done an \ninvestigation, and not sure I believe in hauntings, or accidental \nghost encounters. \n\n Frank-S\n\n--- In EVP-ITC@yahoogroups.com, &quot;Fransen, Debbie&quot; \n&lt;debbie.fransen@...&gt; wrote:\n&gt;\n&gt;   Mr. Frank Sumption ( most intelligent person in the paranormal \nfield )\n&gt;   I would like to know what your honest opinion of the Ghost Box \nHacker\n&gt; is? or ( Mike&#39;s box)\n&gt;   Can the radio at Radio Shack really do that?\n&gt;   Because it us definately a cheap device.\n&gt;   You have opened up the door to new possibilities for \nunderstanding the\n&gt; paranormal,\n&gt;   and as a person who is searching, I hope that you know how much \nwe all\n&gt; really\n&gt;    respect and admire you.\n&gt;    Thankyou for all you have done, and are doing for the future of \nthis\n&gt; field of study.\n&gt;    Best Regards\n&gt;    Debbie Fransen\n&gt;    debbie.fransen@...\n&gt; \n&gt; ________________________________\n&gt; \n&gt; From: EVP-ITC@yahoogroups.com [mailto:EVP-ITC@yahoogroups.com] On \nBehalf\n&gt; Of purplespacefriend\n&gt; Sent: Tuesday, February 12, 2008 2:05 PM\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Subject: [EVP-ITC] Re: To Frank S.\n&gt; \n&gt; \n&gt; \n&gt; I started in EVP wiht white, then various other noise methods, and \n&gt; eventuallly found EVPmaker on the web. Evepmaker worked reallly \nwell \n&gt; fro me, but i kept getting messages realyed from spirits that \n&gt; couldn&#39;t use the computer, by the ones that could. I was ewondering \n&gt; what else I could use, and after aobut a week, the whole copncept \nof \n&gt; the box kinda popped int my head fully formed. I think it was my \nown \n&gt; subconcious mind that assembeld information from past experience, \nand \n&gt; presented it as a solutuion to the problem. I had worked wijht \nthese \n&gt; radio modules from car stereos a few years previous, and knew they \n&gt; cold be voltage tuned, so I come up wiht an analog version of \n&gt; EVPmaker, pretty much. \n&gt; \n&gt; Frank-S\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com &lt;mailto:EVP-ITC%40yahoogroups.com&gt; ,\n&gt; &quot;sdudly&quot; &lt;sdudly@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Frank,\n&gt; &gt; \n&gt; &gt; To start off with no I do not want a box. =) \n&gt; &gt; \n&gt; &gt; However, I do have a question for you when you have time. I was \n&gt; just\n&gt; &gt; curious as to where you got the inspiration for the box. \n&gt; &gt; \n&gt; &gt; Was it just an idea that popped into your head or did you have \nhelp\n&gt; &gt; from the other side? Not to take any credit away from you at all \n&gt; with\n&gt; &gt; your accomplishments with the box. It was just something I was \n&gt; curious\n&gt; &gt; about.\n&gt; &gt; \n&gt; &gt; I believe I am looking for personal answers from the other side \nbut\n&gt; &gt; also I feel it may help me with some more general directions I may\n&gt; &gt; want to go in after putting my own personal demons to rest. \n&gt; &gt; \n&gt; &gt; Thanks for your time in advance.\n&gt; &gt; \n&gt; &gt; Regards,\n&gt; &gt; TT\n&gt; &gt;\n&gt;"}