{"id": "7178", "subject": "The LA1135 schematic.", "author": "Frank Sumption", "timestamp": "2008-02-14T15:12:00Z", "full_text": "--_2f826620-2c6c-4ae3-85cd-21d7633aefae_\r\nContent-Type: multipart/alternative;\n\tboundary=&quot;_98ca5627-ff0a-453a-bcb0-8323ce9f41ba_&quot;\r\n\r\n\r\n--_98ca5627-ff0a-453a-bcb0-8323ce9f41ba_\r\nContent-Type: text/plain; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n\n What was really wierd about this is that I was sharing this on Grass Harp=\r\n, and an Italian &quot;researcher&quot; claimed he made the radio and it worked, but =\r\nthe schematic he sent was right out of the datasheet for the chip. There&#39;s =\r\nerrors in the datasheet, and if you follow it 100%, the thing won&#39;t work, a=\r\nt all. I pointed out what I did--nicely, and never heard from the guy again=\r\n, weird. Why the lies in this field, it&#39;s so far beyond my comprehension. I=\r\n run into this disinformation, twist everything around stuff almost daily. =\r\n\n \n Even with the LM3820, you can&#39;t follow the data sheet at all, it&#39;s all =\r\njacked up! I found an app guide for another FM chip, and they used the LM38=\r\n20 for the AM section, that&#39;s what I went by to use that chip. The LM3820 i=\r\ns 12 cents each, so cost was the motivating factor there. It&#39;s only disadva=\r\nntage is having to use an external detector stage. \n \n The LA1135 is used i=\r\nn the car tuner modules I like to use, so I know it&#39;s capable iof decent pe=\r\nrformance. The datasheet show this as being voltage tuned, so it should be =\r\nexactly what we need. \n \n Frank-S\n_________________________________________=\r\n________________________\nClimb to the top of the charts!=A0Play the word sc=\r\nramble challenge with star power.\nhttp://club.live.com/star_shuffle.aspx?ic=\r\nid=3Dstarshuffle_wlmailtextlink_jan\r\n--_98ca5627-ff0a-453a-bcb0-8323ce9f41ba_\r\nContent-Type: text/html; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;\n&lt;head&gt;\n&lt;style&gt;\n.hmmessage P\n{\nmargin:0px;\npadding:0px\n}\nbody.hmmessa=\r\nge\n{\nFONT-SIZE: 10pt;\nFONT-FAMILY:Tahoma\n}\n&lt;/style&gt;\n&lt;/head&gt;\n&lt;body class=3D&#39;=\r\nhmmessage&#39;&gt;\n&nbsp;What was really wierd about this is that I was sharing th=\r\nis on Grass Harp, and an Italian &quot;researcher&quot; claimed he made the radio and=\r\n it worked, but the schematic he sent was right out of the datasheet for th=\r\ne chip. There&#39;s errors in the datasheet, and if you follow it 100%, the thi=\r\nng won&#39;t work, at all. I pointed out what I did--nicely, and never heard fr=\r\nom the guy again, weird. Why the lies in this field, it&#39;s so far beyond my =\r\ncomprehension. I run into this disinformation, twist everything around stuf=\r\nf almost daily. &lt;BR&gt;\n&nbsp;&lt;BR&gt;\n&nbsp;Even with the LM3820, you can&#39;t follo=\r\nw the data sheet at all, it&#39;s all jacked up! I found an app guide for anoth=\r\ner FM chip, and they used the LM3820 for the AM section, that&#39;s what I went=\r\n by to use that chip. The LM3820&nbsp;is 12 cents each, so cost was the mot=\r\nivating factor there. It&#39;s only disadvantage is having to use an external d=\r\netector stage. &lt;BR&gt;\n&nbsp;&lt;BR&gt;\n&nbsp;The LA1135 is used in the car tuner mo=\r\ndules I like to use, so I know it&#39;s capable iof decent performance. The dat=\r\nasheet show this as being voltage tuned, so it should be exactly what we ne=\r\ned. &lt;BR&gt;\n&nbsp;&lt;BR&gt;\n&nbsp;Frank-S&lt;BR&gt;&lt;br /&gt;&lt;hr /&gt;Climb to the top of the ch=\r\narts!=A0Play the word scramble challenge with star power. &lt;a href=3D&#39;http:/=\r\n/club.live.com/star_shuffle.aspx?icid=3Dstarshuffle_wlmailtextlink_jan&#39; tar=\r\nget=3D&#39;_new&#39;&gt;Play now!&lt;/a&gt;&lt;/body&gt;\n&lt;/html&gt;\r\n--_98ca5627-ff0a-453a-bcb0-8323ce9f41ba_--\r\n\n\r\n--_2f826620-2c6c-4ae3-85cd-21d7633aefae_\r\nContent-Type: image/pjpeg\r\nContent-Disposition: attachment; filename=&quot;LA1135-RVCR.jpg&quot;\r\n\r\n[ Attachment content not displayed ]\r\n--_2f826620-2c6c-4ae3-85cd-21d7633aefae_--"}