{"id": "7184", "subject": "Re: [EVP-ITC] Think I missed some.", "author": "Lisby", "timestamp": "2008-02-14T23:35:39Z", "full_text": "I hear all the pieces, too, Frank, and they do seem to be related.  \nBut the message isn&#39;t clear enough to really understand. I&#39;m racking  \nmy brain trying to recall something I told you that might shed some  \nlight--wait--it says that I told *them.*\n\nMy inclination is that this has something to do with Debbie at www. \n1800heaven.com. She got into this because of grief over the loss of  \nher son, Joey, and recently she has been experimenting with a minibox  \nfor the first time.\n\nAnn\n\n\nOn Feb 14, 2008, at 12:24 PM, Frank Sumption wrote:\n\n&gt;  This all seems to be related. &#39;&#39;Problems--It Can-Grief--Plus Death  \n&gt; Scratched Richard--and We Would Talk To Debbie-Ann Told me--- \n&gt; something--He Wants (watch) X-Box-----A Bad Place To Be For A Human&quot;\n&gt;\n&gt;  I often have to go back to relisten. Ya have to kind of tune into  \n&gt; the rythum of the recording, and mentally seperate out the gibberish.\n&gt;\n&gt;  Frank-S\n&gt;\n&gt;\n&gt;\n&gt; Connect and share in new ways with Windows Live. Get it now!\n&gt;\n&gt;  &lt;Longer.mp3&gt;\n\n\nI hea all he pieces, oo, F ank, and hey do seem o be ela ed. Bu he message isn' clea enough o eally unde s and. I'm acking my b ain ying o ecall some hing I old you ha migh shed some ligh --wai --i says ha I old * hem.*My inclina ion is ha his has some hing o do wi h Debbie a www.1800hea en.com. She go in o his because o g ie o e he loss o he son, Joey, and ecen ly she has been expe imen ing wi h a minibox o he i s ime.AnnOn Feb 14, 2008, a 12:24 PM, F ank Sump ion w o e:  This all seems o be ela ed. ''P oblems--I Can-G ie --Plus Dea h Sc a ched Richa d--and We Would Talk To Debbie-Ann Told me---some hing--He Wan s (wa ch) X-Box-----A Bad Place To Be Fo A Human\"    I o en ha e o go back  o elis en. Ya ha e o kind o une in o he y hum o he eco ding, and men ally sepe a e ou he gibbe ish.   F ank-SConnec and sha e in new ways wi h Windows Li e. Ge i now!"}