{"id": "7260", "subject": "Re: [EVP-ITC] Re: Frank&#39;s Box on Paranormal State Tonight", "author": "Lisby", "timestamp": "2008-02-19T01:34:54Z", "full_text": "Is this the audio that was mentioned during the recording of the  \nEastern State investigation?\n\nAnn\n\nOn Feb 18, 2008, at 6:11 PM, juli velazquez wrote:\n\n&gt;\n&gt; Ann, given I am from Chicago, I thought I would do it the Capone  \n&gt; way.  &quot;You never bring a knife to a gun fight&quot;  LOL.\n&gt;\n&gt; I actually have audio from Frank&#39;s Box from a alledged haunted  \n&gt; Speak Easy where Al and Frank Capone decided to come through the  \n&gt; box.  It was very interesting whether or not it was really them,  \n&gt; nevertheless I think they would be willing to help pay credit where  \n&gt; credit was do.!\n&gt;\n&gt; Juli\n&gt;\n&gt; Lisby &lt;lisby@...&gt; wrote:\n&gt; Are you going for the horse&#39;s head in the bed or the just a good  \n&gt; knee-capping? ;)\n&gt;\n&gt; Ann\n&gt;\n&gt; On Feb 18, 2008, at 1:38 PM, juli velazquez wrote:\n&gt;\n&gt;&gt;\n&gt;&gt; That&#39;s ok Nellie, I will be setting the record straight pretty  \n&gt;&gt; soon with the help of some dear friends.\n&gt;&gt;\n&gt;&gt; Juli\n&gt;&gt;\n&gt;&gt; purplespacefriend &lt;purplealiengirl@...&gt; wrote:\n&gt;&gt; I e-mailed them--no response. I don&#39;t think they are all that\n&gt;&gt; concerned with facts.\n&gt;&gt;\n&gt;&gt; Frank-S\n&gt;&gt; --- In EVP-ITC@yahoogroups.com, rednellie &lt;rednellie@...&gt; wrote:\n&gt;&gt; &gt;\n&gt;&gt; &gt; I just ran across this episode description on A&E website:\n&gt;&gt; &gt;\n&gt;&gt; &gt; &quot;PRS explores the belly of the beast: a New York State Prison that\n&gt;&gt; was\n&gt;&gt; &gt; once a mental asylum. Ryan and his team go behind bars to uncover\n&gt;&gt; the\n&gt;&gt; &gt; institution&#39;s paranormal past and present--current inmates and\n&gt;&gt; guards\n&gt;&gt; &gt; are reporting mysterious new sightings! For their biggest case yet\n&gt;&gt; PRS\n&gt;&gt; &gt; enlists the help of psychic Chip Coffey, demonologist Lorraine\n&gt;&gt; Warren\n&gt;&gt; &gt; and Chris Moon, the owner/inventor of the latest in paranormal\n&gt;&gt; &gt; technology, &quot;Frank&#39;s Box,&quot; a radio designed to communicate with the\n&gt;&gt; dead&quot;\n&gt;&gt; &gt;\n&gt;&gt; &gt; I think they have their details a bit wrong. :-P\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt; Nellie\n&gt;&gt; &gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; The contents of this eletronic correspondence is private &  \n&gt;&gt; confidential and meant only for the party and/or parties it is  \n&gt;&gt; addressed to.\n&gt;&gt;\n&gt;&gt; No part of this email transmission may be publicly posted or  \n&gt;&gt; forwarded to other parties without explicit written permission.\n&gt;&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; The contents of this eletronic correspondence is private &  \n&gt; confidential and meant only for the party and/or parties it is  \n&gt; addressed to.\n&gt;\n&gt; No part of this email transmission may be publicly posted or  \n&gt; forwarded to other parties without explicit written permission.\n&gt;\n&gt; \n\n\nIs his he audio ha was men ioned du ing he eco ding o he Eas e n S a e in es iga ion?AnnOn Feb 18, 2008, a 6:11 PM, juli elazquez w o e:Ann, gi en I am om Chicago, I hough I would do i he Capone way.  \"You ne e b ing a kni e o a gun igh \"  LOL. I ac ually ha e audio om F ank's Box om a alledged haun ed Speak Easy whe e Al and F ank Capone decided o come h ough he box.  I was e y in e es ing whe he o no i was eally hem, ne e heless I hink hey would be willing o help pay c edi  whe e c edi was do.! JuliLisby ne > w o e:A e you going o he ho se's head in he bed o he jus a good knee-capping? ;)AnnOn Feb 18, 2008, a 1:38 PM, juli elazquez w o e:Tha 's ok Nellie, I will be se ing he eco d s aigh p e y soon wi h he help o some dea iends.  Julipu plespace iend li e.com> w o e:I e-mailed hem--no esponse. I don' hink hey a e all ha  conce ned wi h ac s.F ank-S--- In EVP-ITC@yahoog oups.com, ednellie ..> w o e:>> I jus an ac oss his episode desc ip ion on A&E websi e:> > \"PRS explo es he belly o he beas : a New Yo k S a e P ison ha  was > once a men al asylum. Ryan and his eam go behind ba s o unco e   he > ins i u ion's pa ano mal pas and p esen --cu en inma es and gua ds > a e epo ing mys e ious new sigh ings! Fo hei bigges case ye  PRS > enlis s he help o psychic Chip Co ey, demonologis Lo aine Wa en > and Ch is Moon, he owne /in en o o he la es in pa ano mal > echnology, \"F ank's Box,\" a adio designed o communica e wi h he dead\"> > I hink hey ha e hei de ails a bi w ong. :-P> > > Nellie>The con en s o his ele onic co espondence is p i a e & con iden ial and mean only o he pa y and/o pa ies i is add essed o.  No pa o his email ansmission may be publicly pos ed o o wa ded o o he pa ies wi hou explici w i en pe mission.The con en s o his ele onic co espondence is p i a e & con iden ial and mean only o he pa y and/o pa ies i is add essed o.  No pa o his email ansmission may be publicly pos ed o o wa ded o o he pa ies wi hou explici w i en pe mission."}