{"id": "7314", "subject": "Re: [EVP-ITC] Better.", "author": "Lisby", "timestamp": "2008-02-26T13:11:29Z", "full_text": "Nelly is right, buddy.  You go easy on yourself. :)\n\nAnn\n\nOn Feb 26, 2008, at 7:00 AM, rednellie wrote:\n\n&gt; Frank Sumption wrote:\n&gt; &gt; The fact is, there are other methods that work as well, and probably\n&gt;  &gt; better. Often the voices are much clearer with the simple methods,\n&gt;  &gt; and they can be shared since most can hear them. I am endlessly\n&gt;  &gt; discouraged when I think I have a perfectly clear voice from the  \n&gt; box,\n&gt;  &gt; and not another person in the world can hear it.\n&gt;\n&gt; That&#39;s just the curse of being psychic. It&#39;s hard to self monitor  \n&gt; your progress before presenting it publicly when your perception is  \n&gt; different than most other people&#39;s.  But even being able to hear  \n&gt; message clearly yourself is a step in the right direction.  I know  \n&gt; that&#39;s something I couldn&#39;t have done myself 10 years ago.\n&gt;\n&gt; Don&#39;t think you&#39;re just spinning your wheels when the experiments  \n&gt; don&#39;t work out right, though.  We all learn from the failed  \n&gt; experiments as well as the ones that worked right.  It all goes to  \n&gt; help in the long run.  There are other benefits as well.  Frank&#39;s  \n&gt; Box has been helpful to the research in that it alone has created a  \n&gt; buzz in the paranormal community that has drawn in a lot more  \n&gt; researchers .  I don&#39;t remember hearing that kind of excitement  \n&gt; about EVP Maker despite how impressive the results from that have  \n&gt; been. I&#39;m pretty sure that you are doing what you are meant to be  \n&gt; doing in all this, even if you aren&#39;t making the kind of progress  \n&gt; you&#39;d like.\n&gt;\n&gt;\n&gt; Nellie\n&gt;\n&gt; \n\n\nNelly is igh , buddy.  You go easy on you sel . :)AnnOn Feb 26, 2008, a 7:00 AM, ednellie w o e:F ank Sump ion w o e:> The ac is, he e a e o he me hods ha wo k as well, and p obably > be e . O en he oices a e much clea e wi h he simple me hods, > and hey can be sha ed since mos can hea hem. I am endlessly > discou aged when I hink I ha e a pe ec ly clea oice om he box, > and no ano he pe son in he wo ld can hea i .Tha 's jus he cu se o being psychic. I 's ha d o sel moni o you p og ess be o e p esen ing i publicly when you pe cep ion is di e en han mos o he people's.  Bu e en being able o hea message clea ly you sel is a s ep in he igh di ec ion.  I know ha 's some hing I couldn' ha e done mysel 10 yea s ago.Don' hink you' e jus spinning you wheels when he expe imen s don' wo k ou igh , hough.  We all lea n om he ailed expe imen s as well as he ones ha wo ked igh .  I all goes o help in he long un.  The e a e o he bene i s as well.  F ank's Box has been help ul o he esea ch in ha i alone has c ea ed a buzz in he pa ano mal communi y ha has d awn in a lo mo e esea che s .  I don' emembe hea ing ha kind o exci emen abou EVP Make despi e how imp essi e he esul s om ha ha e been. I'm p e y su e ha you a e doing wha you a e mean o be doing in all his, e en i you a en' making he kind o p og ess you'd like.Nellie"}