{"id": "7317", "subject": "Re: Better.  FS - Enjoy the ride...", "author": "LC Duplatt", "timestamp": "2008-02-26T13:53:49Z", "full_text": "FS:\n\nThink of your work as the (purple?) mother spawning this new wave of \nITC experimentation.  Your improvements and ideas, though seeming to \nyou as little, inspires others, having led to mass experimentation, \ncurrently birthing better communication, and increasing the amount of \ncommunicators and communications; all of this eventually sweeping the \nglobe as a wave, IMHO.\n\nTherefore, don&#39;t put so much pressure on yourself.  Be patient, \ncreative, have fun, etc, and allow the ideas to flow and develop.  \nYou should be at a comfortable place right now as the inventor, \ninnovator, originator, and father of THE concept.  Let it go where it \nmust go, and complement it as you feel led to do so.  \n\nI perceive you have already made the most important contribution in \nall this, and that can never be taken away from you.  ;)\n\nLC\nhttp://www.AngelsGhosts.com\n\n\n\n --- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@...&gt; \nwrote:\n&gt;\n&gt; \n&gt;  Tuner with white noise running. There&#39;s a little noise pick up, \nbut I had the antenna wire runing very close to the RVG section.  \nAfterward I replaced the antenna wire with coax to prevent noise pick \nup from inside the box. Oh yeah, manual tuing. \n&gt;  \n&gt;  I know! There&#39;s noisy crappy boxes out there, and I should have \ndone this testing long ago, but so many wanted to be like Chris Moon, \nand I wanted to get the boxes out there so others could experience \nit, and experiment, but they function so poorly as yet, and no one \ngets anything close to what I do, or what Moon claims. So the TAPS \narticle was correct about the things being flawed, but I&#39;m working on \nit. I don&#39;t sell the stuff, and never have, so all we&#39;ve lost is \ntime. I can&#39;t make many of these, I can handle making them to test, \nand improve the thing, but I dread just having to wire and wire and \nbuild and build endlessly. I can&#39;t do that stuff anymore, just too \nbrain fried. \n&gt;  \n&gt;  The fact is, there are other methods that work as well, and \nprobably better. Often the voices are much clearer with the simple \nmethods, and they can be shared since most can hear them. I am \nendlessly discouraged when I think I have a perfectly clear voice \nfrom the box, and not another person in the world can hear it. \n&gt;  \n&gt;  Frank-S\n&gt; _________________________________________________________________\n&gt; Climb to the top of the charts!Play the word scramble challenge \nwith star power.\n&gt; http://club.live.com/star_shuffle.aspx?\nicid=starshuffle_wlmailtextlink_jan\n&gt;"}