{"id": "7322", "subject": "Re: [EVP-ITC] A voice in the noise?", "author": "Lisby", "timestamp": "2008-02-26T21:11:45Z", "full_text": "Well, maybe Mr. Edison wants pepperoni on his? ;)\n\nAnn\n\nOn Feb 26, 2008, at 3:48 PM, Frank Sumption wrote:\n\n&gt;  At about 7-8 seconds &quot;to our famous ghosts&quot; or am I hearing  \n&gt; things, and just before that &quot;give some pizza&quot;.  The shield is the  \n&gt; copper flavored structure. The pots are for sweep rate, and tone  \n&gt; control. It&#39;s just a couple voices like that to renew my faith and  \n&gt; enjoyment.\n&gt;\n&gt;  I&#39;m adding the linear sweep today, along with the monitor amp, and  \n&gt; mic amp. the point of this being to test for the elimination of  \n&gt; noise in the older tuner module boxes with a shield over the white  \n&gt; noise circuit. I don&#39;t have any of the older boxes, so have to make  \n&gt; a board to test it. I could have shielded the tuner instead but  \n&gt; usually pick the hardest way first, beside, the home made tuners  \n&gt; are more sperad out.\n&gt;\n&gt;  Frank-S\n&gt;\n&gt;\n&gt; Need to know the score, the latest news, or you need your Hotmail®- \n&gt; get your &quot;fix&quot;. Check it out.\n&gt;\n&gt;  &lt;022608-TunerWithWhiteNoise.3g2&gt;\n\n\nWell, maybe M . Edison wan s peppe oni on his? ;)AnnOn Feb 26, 2008, a 3:48 PM, F ank Sump ion w o e:  A abou 7-8 seconds \" o ou amous ghos s\" o am I hea ing hings, and jus be o e ha \"gi e some pizza\".  The shield is he coppe la o ed s uc u e. The po s a e o sweep a e, and one con ol. I 's jus a couple oices like ha o enew my ai h and enjoymen .    I'm adding he linea sweep oday, along wi h he moni o amp, and mic amp. he poin o his being o es o he elimina ion o noise in he olde une module boxes wi h a shield o e he whi e noise ci cui . I don' ha e any o he olde boxes, so ha e o make a boa d o es i . I could ha e shielded he une ins ead bu usually pick he ha des way i s , beside, he home made une s a e mo e spe ad ou .    F ank-SNeed o know he sco e, he la es news, o you need you Ho mail®-ge you \" ix\". Check i ou ."}