{"id": "7326", "subject": "Re: [EVP-ITC] Re: Frank&#39;s box on TV last night", "author": "Lisby", "timestamp": "2008-02-27T09:52:08Z", "full_text": "As far as I know, yes.\n\nAnn\n\nOn Feb 27, 2008, at 2:16 AM, Annette wrote:\n\n&gt; I saw the episode :) Was this the first time the box has been used on\n&gt; television?\n&gt;\n&gt; Annette\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, &quot;wgungfu&quot; &lt;wgungfu3@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Don&#39;t know if anyone caught it, but Frank&#39;s box was used on last\n&gt; &gt; night&#39;s episode of Paranormal State on A&E. They were investigating\n&gt; &gt; an old insane asylum, and they had Chris Moon as a guest  \n&gt; investigator\n&gt; &gt; with the box. You can see the promo clip here:\n&gt; &gt;\n&gt; &gt; http://www.pennstateprs.com/ps_asylum.mov\n&gt; &gt;\n&gt; &gt; Here&#39;s the site for the show itself:\n&gt; &gt;\n&gt; &gt; http://www.aetv.com/paranormal-state/index.jsp\n&gt; &gt;\n&gt; &gt; For those not familiar, its a half hour show that follows along the\n&gt; &gt; &quot;Penn State Paranormal Research Society&quot; and different cases they  \n&gt; take\n&gt; &gt; on. Their niche in the &quot;paranormal reality tv show&quot; market is that\n&gt; &gt; the group&#39;s leader follows a more Christian orientated skew on\n&gt; &gt; happenings. Lots of &quot;demons&quot; (they have Lorraine Warren guest all  \n&gt; the\n&gt; &gt; time), and they usually try to do investigations/communication only\n&gt; &gt; during what they call &quot;dead time&quot;, 3am-4am, or &quot;the polar  \n&gt; opposite of\n&gt; &gt; 3pm - the time Jesus gave is life for all mankind&quot; as they put  \n&gt; it. Oh,\n&gt; &gt; and they have an &quot;occult specialist&quot; on the team that so far has  \n&gt; been\n&gt; &gt; anything but.\n&gt; &gt;\n&gt; &gt; On the positive side, they did actually get (and record for later\n&gt; &gt; analysis) live communication on the box in response to questions  \n&gt; being\n&gt; &gt; asked. And on the analysis and isolation of the recorded parts, you\n&gt; &gt; could actually hear what was being said (as opposed to the usual of\n&gt; &gt; Chris acting as a go-between for very distorted sounds like on those\n&gt; &gt; youtube videos). So it was good to see it a)working in the &quot;field&quot;\n&gt; &gt; and b)get some exposure on a tv show.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Marty\n&gt; &gt;\n&gt;\n&gt;\n&gt; \n\n\nAs a as I know, yes.AnnOn Feb 27, 2008, a 2:16 AM, Anne e w o e:I saw he episode :) Was his he i s ime he box has been used on ele ision?Anne e--- In EVP-ITC@yahoog oups.com, \"wgung u\" .> w o e:>> Don' know i anyone caugh i , bu F ank's box was used on las > nigh 's episode o Pa ano mal S a e on A&E. They we e in es iga ing> an old insane asylum, and hey had Ch is Moon as a gues in es iga o > wi h he box. You can see he p omo clip he e:> > h p://www.penns a ep s.com/ps_asylum.mo > > He e's he si e o he show i sel :> > h p://www.ae .com/pa ano mal-s a e/index.jsp> > Fo hose no amilia , i s a hal hou show ha ollows along he> \"Penn S a e Pa ano mal Resea ch Socie y\" and di e en cases hey ake> on. Thei niche in he \"pa ano mal eali y show\" ma ke is ha > he g oup's leade ollows a mo e Ch is ian o ien a ed skew on> happenings. Lo s o \"demons\" ( hey ha e Lo aine Wa en gues all he> ime), and hey usually y o do in es iga ions/communica ion only> du ing wha hey call \"dead ime\", 3am-4am, o \" he pola opposi e o > 3pm - he ime Jesus ga e is li e o all mankind\" as hey pu i . Oh,> and hey ha e an \"occul specialis \" on he eam ha so a has been> any hing bu .> > On he posi i e side, hey did ac ually ge (and eco d o la e > analysis) li e communica ion on he box in esponse o ques ions being> asked. And on he analysis and isola ion o he eco ded pa s, you> could ac ually hea wha was being said (as opposed o he usual o > Ch is ac ing as a go-be ween o e y dis o ed sounds like on hose> you ube ideos). So i was good o see i a)wo king in he \" ield\"> and b)ge some exposu e on a show.> > > Ma y>"}