{"id": "7327", "subject": "Frank&#39;s Box #12", "author": "Jules", "timestamp": "2008-02-27T15:27:45Z", "full_text": "I am proud to announce that yesterday I became the bran new owner of \nFranks Box #12. This box was past on from one researcher to another \nand upon Bruce receiving his new Frank&#39;s Box #29, he has willed the \nbox #12 to me for research.  I have been longing for a box for \nseveral years now, and know that all good things come to those who \nwait.\n\nI know this is an honor and a privilege being only the second women \nin the world to own one (that I am aware of). I am extremely greatful \nto both Bruce and Frank as well as the others on this board and hope \nthat my contributions and sessions with this box can help in the \nfield with our research!\n\nThe communication I got immediately when I turned it on is truly \namazing (I will be adding files shortly marked box #12 in the file \nsection).\n\nI have started doing two types of sessions one just running the \nrecorders (like Frank does) and then a separate question and answer \nsession later during the day.  I know its hard trying to stop \nyourself from asking questions, but let them have their time as well, \nfor the communication should not be one sided, us always wanting \nsomething from them to be answered.  If they want you to jump in and \nanswer one of their questions, believe me they let you know (see my \nfile, lets get started).\n\nI have come to realize that many messages are missing when you jump \nthe gun trying to start that immediate two way communication, or you \nstart talking over them, not allowing clear audio to be received.  \nTherefore, I would highly suggest trying this as well, you just may \nbe surpised what you get!\n\nAdditionally, I have also observed that when tuning in the boxes, \nplay close attention,they may just give you directions, you don&#39;t \nhave to have the conversation going.  They seem to want that \ncommunication just as bad as you do.\n\nIt is audio clips with great communication that make all of this  \ntime worth it. Knowing that in my heart they enjoy communicating with \nus just as much as we do them.\n\nJuli"}