{"id": "7328", "subject": "Re: Frank&#39;s box on TV last night", "author": "LC Duplatt", "timestamp": "2008-02-27T16:13:24Z", "full_text": "Yes, the old &quot;demon chasing&quot; crap, once again.  \n\nI brought the following thought up elsewhere and will bring it up \nhere for consideration, too.  If ghosts are coming through the box \nand thus are not in a good state of mind, how come on Paranormal \nState CM was willing to believe the message given by the ghost via \nthe box as being truth (The ghost via the box said a &quot;demon&quot; was \nholding the ghosts captive there)?  \n\nI would suggest that perhaps a ghost (assuming we are talking about a \ndisembodied person who remains earthbound) is not in a healthy state \nof mind one would consider &quot;stable,&quot; but trapped in emotional trauma \nof some sort.  Thus, how reliable could the message of a ghost then \nbe?  ;)\n\nLC\n\n--- In EVP-ITC@yahoogroups.com, &quot;wgungfu&quot; &lt;wgungfu3@...&gt; wrote:\n&gt;\n&gt; Don&#39;t know if anyone caught it, but Frank&#39;s box was used on last\n&gt; night&#39;s episode of Paranormal State on A&E.  They were investigating\n&gt; an old insane asylum, and they had Chris Moon as a guest \ninvestigator\n&gt; with the box.  You can see the promo clip here:\n&gt; \n&gt; http://www.pennstateprs.com/ps_asylum.mov\n&gt; \n&gt; Here&#39;s the site for the show itself:\n&gt; \n&gt; http://www.aetv.com/paranormal-state/index.jsp\n&gt; \n&gt; For those not familiar, its a half hour show that follows along the\n&gt; &quot;Penn State Paranormal Research Society&quot; and different cases they \ntake\n&gt; on.  Their niche in the &quot;paranormal reality tv show&quot; market is that\n&gt; the group&#39;s leader follows a more Christian orientated skew on\n&gt; happenings.  Lots of &quot;demons&quot; (they have Lorraine Warren guest all \nthe\n&gt; time), and they usually try to do investigations/communication only\n&gt; during what they call &quot;dead time&quot;, 3am-4am, or &quot;the polar opposite \nof\n&gt; 3pm - the time Jesus gave is life for all mankind&quot; as they put it. \nOh,\n&gt; and they have an &quot;occult specialist&quot; on the team that so far has \nbeen\n&gt; anything but.\n&gt; \n&gt; On the positive side, they did actually get (and record for later\n&gt; analysis) live communication on the box in response to questions \nbeing\n&gt; asked.  And on the analysis and isolation of the recorded parts, you\n&gt; could actually hear what was being said (as opposed to the usual of\n&gt; Chris acting as a go-between for very distorted sounds like on those\n&gt; youtube videos).  So it was good to see it a)working in the &quot;field&quot;\n&gt; and b)get some exposure on a tv show.\n&gt; \n&gt; \n&gt; Marty\n&gt;"}