{"id": "7361", "subject": "Re: New here", "author": "LC Duplatt", "timestamp": "2008-02-28T13:24:15Z", "full_text": "Welcome... ;)\n\nYes, I have had that happen and would suggest that somebody was \ntrying to get your attention, perhaps.  We seem to be more &quot;open&quot; to \nspirit communication during, before and after sleep.  The left brain \ncalmes down and the right brain becomes un-suppressed and able \nto &quot;tune-in&quot; in my opinion.  ;)\n\nLC\n\n--- In EVP-ITC@yahoogroups.com, Michael Edwards &lt;f1cracker75@...&gt; \nwrote:\n&gt;\n&gt; Hi Christine, while I have yet to get a box, or have even figured \nout how to get one, may I ask you a question? On occasion at night I \nhear someone shouting my name &quot; Mike!&quot;  But that is it. I either hear \nthe voice with my mind or my ear. Have yet to figure that out yet. \nYou note that you can see spirits, but can you hear them?  I often \nwonder if this Jon Edwards guy or George Andersen are really speaking \nto spirits as they seem to be fishing in a reading, and if the \ncustomer pickis up on it, the reader says, &quot;yes that is what they are \ntellling me&quot;.  I would think if spirits spoke to you, that you would \nhear them as you would hear me speaking to you.  I am new at this \nstufff, and have much to learn.  Any comments about the above would \nbe helpful.  Mike Edwards  Cary, NC\n&gt; \n&gt; Christine &lt;ladychrissyleo@...&gt; wrote:          I am 36 years old \nand I am an Eclectic Witch, Reiki Master and\n&gt; Lightworker. I am also a psychic,medium, empath, Paranormal\n&gt; Investigator. I am involved in spirit rescue. I am taking classes to\n&gt; develop my gift more.\n&gt; I am taking psychic development, numerology, tarot, chakras,\n&gt; mediumship etc.\n&gt; \n&gt; I have seen ghosts since I was 5.\n&gt; \n&gt; Interested in evps. I bought the radio shack radio last night and I\n&gt; hacked it. I need to know what else I need to do evps and download\n&gt; them into my pc.\n&gt; \n&gt; Thank you for the help.\n&gt; hugs\n&gt; Lady Chrissy\n&gt; \n&gt; \n&gt; \n&gt;                          \n&gt; \n&gt;        \n&gt; ---------------------------------\n&gt; Looking for last minute shopping deals?  Find them fast with Yahoo! \nSearch.\n&gt;"}