{"id": "7366", "subject": "Re: Frank&#39;s box on TV last night", "author": "purplespacefriend", "timestamp": "2008-02-28T17:00:34Z", "full_text": "Personally, I don&#39;t watch that Hollywood stuff. Interesting that \nthey &quot;have to&quot; use the term demon.\n\n and No, don&#39;t ask!\n\n Frank-S \n\n\n--- In EVP-ITC@yahoogroups.com, Misty Dawn &lt;bulletbabea@...&gt; wrote:\n&gt;\n&gt; LOL I wasnt gonna touch that one but yeah me too hehehehe i was \nlike &quot;did she just???...rewindddddddd...she did!!!\n&gt;    \n&gt;   As for the demon thing.... nope not even with a 10 foot pole.\n&gt;    \n&gt;   Misty\n&gt; \n&gt; Frank Ratka &lt;warrior18eii@...&gt; wrote:\n&gt;               Because by contract PSR has to use the word demon on \neach episode (J/J). The name alone gets people interested, scared and \nso on. LOL Oh, I love Lorainne Warren&#39;s method of removing Chip from \na trance. She slapped the shit out of him. he he hehe I almost fell \nover! You could hear the sarcastic &quot;thank you&quot; from Chip. LMFAO\n&gt; \n&gt; Regards,\n&gt; \n&gt; Frank R.\n&gt; \n&gt;   ----- Original Message ----\n&gt; From: LC Duplatt &lt;lcdupla@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Wednesday, February 27, 2008 10:13:24 AM\n&gt; Subject: [EVP-ITC] Re: Frank&#39;s box on TV last night\n&gt; \n&gt;     Yes, the old &quot;demon chasing&quot; crap, once again. \n&gt; \n&gt; I brought the following thought up elsewhere and will bring it up \n&gt; here for consideration, too. If ghosts are coming through the box \n&gt; and thus are not in a good state of mind, how come on Paranormal \n&gt; State CM was willing to believe the message given by the ghost via \n&gt; the box as being truth (The ghost via the box said a &quot;demon&quot; was \n&gt; holding the ghosts captive there)? \n&gt; \n&gt; I would suggest that perhaps a ghost (assuming we are talking about \na \n&gt; disembodied person who remains earthbound) is not in a healthy \nstate \n&gt; of mind one would consider &quot;stable,&quot; but trapped in emotional \ntrauma \n&gt; of some sort. Thus, how reliable could the message of a ghost then \n&gt; be? ;)\n&gt; \n&gt; LC\n&gt; \n&gt; --- In EVP-ITC@yahoogroups .com, &quot;wgungfu&quot; &lt;wgungfu3@ .&gt; wrote:\n&gt; &gt;\n&gt; &gt; Don&#39;t know if anyone caught it, but Frank&#39;s box was used on last\n&gt; &gt; night&#39;s episode of Paranormal State on A&E. They were \ninvestigating\n&gt; &gt; an old insane asylum, and they had Chris Moon as a guest \n&gt; investigator\n&gt; &gt; with the box. You can see the promo clip here:\n&gt; &gt; \n&gt; &gt; http://www.pennstat eprs.com/ ps_asylum. mov\n&gt; &gt; \n&gt; &gt; Here&#39;s the site for the show itself:\n&gt; &gt; \n&gt; &gt; http://www.aetv. com/paranormal- state/index. jsp\n&gt; &gt; \n&gt; &gt; For those not familiar, its a half hour show that follows along \nthe\n&gt; &gt; &quot;Penn State Paranormal Research Society&quot; and different cases they \n&gt; take\n&gt; &gt; on. Their niche in the &quot;paranormal reality tv show&quot; market is that\n&gt; &gt; the group&#39;s leader follows a more Christian orientated skew on\n&gt; &gt; happenings. Lots of &quot;demons&quot; (they have Lorraine Warren guest all \n&gt; the\n&gt; &gt; time), and they usually try to do investigations/ communication \nonly\n&gt; &gt; during what they call &quot;dead time&quot;, 3am-4am, or &quot;the polar \nopposite \n&gt; of\n&gt; &gt; 3pm - the time Jesus gave is life for all mankind&quot; as they put \nit. \n&gt; Oh,\n&gt; &gt; and they have an &quot;occult specialist&quot; on the team that so far has \n&gt; been\n&gt; &gt; anything but.\n&gt; &gt; \n&gt; &gt; On the positive side, they did actually get (and record for later\n&gt; &gt; analysis) live communication on the box in response to questions \n&gt; being\n&gt; &gt; asked. And on the analysis and isolation of the recorded parts, \nyou\n&gt; &gt; could actually hear what was being said (as opposed to the usual \nof\n&gt; &gt; Chris acting as a go-between for very distorted sounds like on \nthose\n&gt; &gt; youtube videos). So it was good to see it a)working in the &quot;field&quot;\n&gt; &gt; and b)get some exposure on a tv show.\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; Marty\n&gt; &gt;\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;   \n&gt; ---------------------------------\n&gt;   Looking for last minute shopping deals? Find them fast with \nYahoo! Search.  \n&gt; \n&gt;                          \n&gt; \n&gt;        \n&gt; ---------------------------------\n&gt; Looking for last minute shopping deals?  Find them fast with Yahoo! \nSearch.\n&gt;"}