{"id": "737", "subject": "Re: I&#39;m a new member/Lyn", "author": "Guy", "timestamp": "2007-02-15T10:27:02Z", "full_text": "Hello, Lyn.\n\nHave you ever read anything on poltergeists?\n\nOne of the most common signs of a poltergeist &quot;visit&quot; (if you will) \nis the movement of objects. Less common but still a sign of a \npossible poltergeist is a disembodied voice or voices.\n\nNow - I&#39;m not saying you have a poltergeist &quot;visitation&quot; (in fact - \nanother common sign is that the phenomenon is short-lived...a few \nmonths...not an extended length of time like yours) but if you do - \nyou&#39;ll find that the phenomenon takes on the personality of a \ntrickster/practical joker. Due to this &quot;personality&quot; - it becomes \ndifficult, even impossible to &quot;catch&quot; anything using sound recorders, \nstill cameras, video, etc. As if &quot;it&quot; or &quot;they&quot; don&#39;t want evidence \nof &quot;their&quot; existence just to frustrate/annoy the people \nbeing &quot;visited&quot;.\n\nOne of the most popular theories concerning poltergeists is \nthat &quot;they&quot; are not really spirits but the outward manifestation of \nfrustration/anger/confusion of a real person (possibly even more than \none) in the house...known as the &quot;agent&quot;. The agent is creating the \nphenomena subconsciously using psychokinesis (commonly called &quot;mind \nover matter&quot;) so the theory is called RSPK for Recurrent Spontaneous \nPsychoKinesis.\n\nDo you have at least one adolescent in the house who is undergoing \npuberty?\n\nOne of the most famous poltergeist cases involving nearly every known \nsign of poltergeist activity such as moving objects AND voices was \nthe Enfield Poltergeist case back in the late &#39;70s. You might be \nfascinated to read up on the case at this web site:\n\nhttp://www.zurichmansion.org/ghosts/poltergeist.htm\n\nIn the meantime - as long as no one gets hurt and your household is \nnot totally disrupted by this...I&#39;d say just accept it and go on with \nyour lives.\n\nHope that helps you somewhat.\n\nGuy\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;angels4lyn&quot; &lt;angels4lyn@...&gt; wrote:\n&gt;\n&gt; well so far,   the voices call our name when we are either watching \ntv,\n&gt; working on the computer or trying to sleep.\n&gt; they call the cats too, and the cats go running to them.\n&gt; they are crystal clear voices, and just come about at the oddest \ntimes.,\n&gt; but they call family members by name.  they usually are behind the\n&gt; person....and will then call their name.   its become a running \njoke in our\n&gt; family now  as this has gone on for 10 years.\n&gt; I bought a voice activated tape recorder... in hopes of capturing \nthis on\n&gt; tape. but no luck yet,.\n&gt; I was told to take Pics around the house to look for orbs and \nsuch.  we have\n&gt; never &#39;seen&#39; anything, but we&#39;ve seen activity,  books that get \npicked up\n&gt; off the shelf, suspend in air and then drop to the floor (that one \nscared my\n&gt; son & I as we were eatchign tv when it happened), doors that open \nand close\n&gt; thru out the day & night when I am only one home.\n&gt; chair cushions that were yanked down while I sat there and watched \nit... and\n&gt; the one that surprised us all is our house has an odd freestanding \nfireplace\n&gt; with a round platform with white rocks.   something kicked the \nrocks one\n&gt; evening while we watched tv, and the rocks flew across the room.___\n&gt; I  was impress in ghost hunters and how they captured voices on \nrecorders.\n&gt; and thought that might help us solve this.    we dont have ghosts, \nwe dont\n&gt; have orbs,m we just have something that calls us by name, calls the \ncats,\n&gt; and moves things in the house.\n&gt; \nLyn___________________________________________________________________\n__"}