{"id": "7392", "subject": "Re: [EVP-ITC] Do you get VERY tired from your sessions?", "author": "Lisby", "timestamp": "2008-02-28T21:23:40Z", "full_text": "Robin, my personal experience sounds very much like yours, including  \nthe lingering tiredness. Frankly, I also end up quite cranky for a  \nday or so. I thought at first that all this was a coincidence, but it  \nhappens every time I run a session. I&#39;m not very fond of box  \n&quot;hangover,&quot; but I doubt it will put me off continuing.\n\nAnn\n\nOn Feb 28, 2008, at 2:53 PM, Robin Searcy Henson wrote:\n\n&gt;\n&gt; I would guess it&#39;s very common because it&#39;s literally a spiritual- \n&gt; mental-emotional-physical energy drain.  For the last two nights  \n&gt; I&#39;ve been listening to my hacked radios in my motel room, without  \n&gt; recording, just to get in-tuned with them.  I&#39;ve gotten totally  \n&gt; ovewhelmed with exhaustion both times, to the point of having to  \n&gt; stop within 10 minutes.  I agree that it&#39;s not related to physical  \n&gt; stamina.  The sessions are draining for them on the other side too,  \n&gt; right?  Do you recover from your tiredness momentarily or does it  \n&gt; take some time?  I&#39;ve felt kind of &quot;hung over&quot; the next day, and  \n&gt; the tiredness is lingering.\n&gt;\n&gt; Robin\n&gt;\n&gt;\n&gt; ----- Original Message -----\n&gt; From: dead.science\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Wednesday, February 27, 2008 11:34 PM\n&gt; Subject: [EVP-ITC] Do you get VERY tired from your sessions?\n&gt;\n&gt; I get very very tired from my sessions. I try to keep them to 10 min.\n&gt; because of this. Please remember I run marathons and have been a ham\n&gt; for over 20 years so I can listen to the radio for hours on end. I am\n&gt; not certain why this is happening. Just wondering if anybody has this\n&gt; problem.\n&gt; Rob.\n&gt;\n&gt;\n&gt;\n&gt; \n\n\nRobin, my pe sonal expe ience sounds e y much like you s, including he linge ing i edness. F ankly, I also end up qui e c anky o a day o so. I hough a i s ha all his was a coincidence, bu i happens e e y ime I un a session. I'm no e y ond o box \"hango e ,\" bu I doub i will pu me o con inuing.AnnOn Feb 28, 2008, a 2:53 PM, Robin Sea cy Henson w o e:I would guess i 's e y common because i 's li e ally a spi i ual-men al-emo ional-physical ene gy d ain.  Fo he las wo nigh s I' e been lis ening o my hacked adios in my mo el oom, wi hou eco ding, jus o ge in- uned wi h hem.  I' e go en o ally o ewhelmed wi h exhaus ion bo h imes,  o he poin o ha ing o s op wi hin 10 minu es.  I ag ee ha i 's no ela ed o physical s amina.  The sessions a e d aining o hem on he o he side oo, igh ?  Do you eco e om you i edness momen a ily o does i ake some ime?  I' e el kind o \"hung o e \" he nex day, and he i edness is linge ing. Robin  ----- O iginal Message -----F om: dead.scienceTo: EVP-ITC@yahoog oups.comSen : Wednesday, Feb ua y 27, 2008 11:34 PMSubjec : [EVP-ITC] Do you ge VERY i ed om you sessions?I ge e y e y i ed om my sessions. I y o keep hem o 10 min.because o his. Please emembe I un ma a hons and ha e been a ham o o e 20 yea s so I can lis en o he adio o hou s on end. I amno ce ain why his is happening. Jus wonde ing i anybody has hisp oblem.Rob."}