{"id": "742", "subject": "Re: I&#39;m a new member/Lyn", "author": "angels4lyn", "timestamp": "2007-02-16T03:18:00Z", "full_text": "well, what goes on here is not like a poltergiest. at least not to me.\nno pranks, nothing like that.\n\nits just like something lives here to, and occasionally it wants someone&#39;s\nattention.\nit calls our names, most of the time it occurs in only the bedroom areas,\nbut a few times voices were heard in another room.\nwhen one person hears their name called...no one else can hear it. just\nthem.\nbut every member of this household has heard their named called.\n\nmany times they call my cats, or my cats will sit and stare at something,\nwatch it move, follow it etc. when no one  or no thing is there.\n\nwhat ever it is, it always seems to be 5-6 ft off the floor..like they are\nlooking at a person maybe.\n\nI dont think its anything bad.. but I do get spooked...weird things have\nhappened to me since asge 6..and it just spooks me at times.\n\nbut we&#39;ve watched books get picked up off bookcase shelves, stand straight\nup, fan open, and then drop to the floor.. my son a nd I watched that with\nreally huge eyes !!!\nI watched something grab a chair cushion and yank on it, it was not the type\neasy to move, so it yanked again, and I screamed for my daughter to come\nsee.. and when she got in the room it yanked it down one more time. we&#39;ve\nhad the chair 20 yrs.. and its never done that before.  the cushions do not\nfall on their own as they are wedged in, but you could see the fabric\nwrinkle as it was being yanked down.\n\nand then we have this freestanding fireplace, and the base has some white\nrocks in it.\nand one evening daughter and I were watching tv, and &#39;something&#39; kicked the\nstones right next to where she was sitting, it scared her, and the rocks\nwent flying about 1 foot away,. all of the cats heard it and came running\ndown the hall to see what happened.  they were not in the room at the time.\nnothing was there when this happened.\nso we have no clue how it happened.\n\nwe have doors that close or doors that open at the oddest times.\n\nthe bedrooms are on one end of the house.\nand my bedroom is right across from the kids rooms.\none morning (when my kids were still at home /in high school )about 7am, I\nwoke up and saw my son&#39;s door opening very very slowly. I thought he was\ndoing it and was trying to be quiet. so I sat and watched it so I could\ncatch him.\nand when it finally opened... he was still sleeping in his bed across that\nroom.\nthat spooked me.because it was slow and would sometimes stop...and its done\nthat a few times ,.night, day, when I am home alone or when others are here.\nmy daughter now has that room, and it does it now.\nI have one door in room next to that ,  one day I left that room with the\ndoor open as usual , to drive my daughter to work, came home and saw this\ndoor closed. I got chills. spooked me..thought some one got ion to the house\n. then I thought oh its one of the cats, they closed themselves in... and\nthen my 3 cats came down the hall to see me since I just got home. and thats\nwhen I realized they were not in there.\nthen I thought oh sheez, someone is in this house..... but when I opened the\ndoor.\nall was well. no one was there.\nI have no idea how it closed itself while I was gone, as I dont close it.\nhave no reason to.\nbut it was  closed then. and it was not the cats.\n\nfor years I blamed my kids, and cats on many of the things , that now happen\nwhen I am alone.  but all this has gone on for 10 yrs.\nbut luckily it doesnt feel bad.  but it does still spook me.\n\nnow if you want to know about an evil house... go into the Glen.\nI had to seek out a Curandero.....that was an &#39;evil&#39; house, it scared me so\nbad I went to this cuerandero...for my own safety, we needed help ...then I\npacked and left, and we later moved our belongings out. never to look back.\nit was pure evil. and probably still is today. that was 6 months of fear...I\nam very sensitive to places, and for some reason...that one scared me\nterribly and I couldnt stay there anymore. the land lady said she had a hard\ntime keeping it rented.\n\nthis house, I dont feel anything bad.. but something is going on. and its\noff and on over the 10 yrs. no pattern that I can tell. never know when the\nhouse will be calm and quite or when it will be active.  it just comes and\ngoes.\nfor years tho, we only heard things, but in the past 2 yrs we&#39;ve begun to\nsee these weird things happen. so its getting physical now.\nmy kids are grown, my daughter moved back home to attend nursing school.\nmy son is over seas right now, army duty... but each one of us has seen ,\nheard or experienced things in this house. including the cats  but they are\nnot talking ..LOL\nbut it doesnt seem to fit poltergiest. at least I dont think so.\nnothing harmful, but we have been touched a time or two. just spooky.\nLyn\n\n----- Original Message ----- \nFrom: &quot;Guy&quot; &lt;yzzzguy@...&gt;\nTo: &lt;EVP-ITC@yahoogroups.com&gt;\nSent: Thursday, February 15, 2007 4:27 AM\nSubject: [EVP-ITC] Re: I&#39;m a new member/Lyn\n\n\n&gt; Hello, Lyn.\n&gt;\n&gt; Have you ever read anything on poltergeists?\n&gt;\n&gt; One of the most common signs of a poltergeist &quot;visit&quot; (if you will)\n&gt; is the movement of objects. Less common but still a sign of a\n&gt; possible poltergeist is a disembodied voice or voices.\n&gt;\n&gt; Now - I&#39;m not saying you have a poltergeist &quot;visitation&quot; (in fact -\n&gt; another common sign is that the phenomenon is short-lived...a few\n&gt; months...not an extended length of time like yours) but if you do -\n&gt; you&#39;ll find that the phenomenon takes on the personality of a\n&gt; trickster/practical joker. Due to this &quot;personality&quot; - it becomes\n&gt; difficult, even impossible to &quot;catch&quot; anything using sound recorders,\n&gt; still cameras, video, etc. As if &quot;it&quot; or &quot;they&quot; don&#39;t want evidence\n&gt; of &quot;their&quot; existence just to frustrate/annoy the people\n&gt; being &quot;visited&quot;.\n&gt;\n&gt; One of the most popular theories concerning poltergeists is\n&gt; that &quot;they&quot; are not really spirits but the outward manifestation of\n&gt; frustration/anger/confusion of a real person (possibly even more than\n&gt; one) in the house...known as the &quot;agent&quot;. The agent is creating the\n&gt; phenomena subconsciously using psychokinesis (commonly called &quot;mind\n&gt; over matter&quot;) so the theory is called RSPK for Recurrent Spontaneous\n&gt; PsychoKinesis.\n&gt;\n&gt; Do you have at least one adolescent in the house who is undergoing\n&gt; puberty?\n&gt;\n&gt; One of the most famous poltergeist cases involving nearly every known\n&gt; sign of poltergeist activity such as moving objects AND voices was\n&gt; the Enfield Poltergeist case back in the late &#39;70s. You might be\n&gt; fascinated to read up on the case at this web site:\n&gt;\n&gt; http://www.zurichmansion.org/ghosts/poltergeist.htm\n&gt;\n&gt; In the meantime - as long as no one gets hurt and your household is\n&gt; not totally disrupted by this...I&#39;d say just accept it and go on with\n&gt; your lives.\n&gt;\n&gt; Hope that helps you somewhat.\n&gt;\n&gt; Guy\n&gt;\n&gt;"}