{"id": "7428", "subject": "Re: [EVP-ITC]", "author": "Victoria Manion", "timestamp": "2008-02-29T08:19:15Z", "full_text": "--0-443805659-1204273155=:38559\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nWell,\n  If you actually have something...it is wrong for you to hide it...\n  I haven&#39;t slept well since the 1970&quot;s...\n  There are crimes to be solved...the dead are screaming for help...\n  Sometimes, all forensics needs is a direction...\n  Frank...if this is actually your name...jeese...do the world a favor...do the right thing and show us how to help them...if we help the dead...we help thousands of the living.\n  But understand what you do...the religious right will hate you.\n  It goes against everything &quot;they&quot; say about the human soul.\n\npurplespacefriend &lt;purplealiengirl@...&gt; wrote:\n          Wanting to be less negative sounding, I can&#39;t rule out producing the \nboxes some time in the future. I just can&#39;t provide any and do the \ntesting and problem solving I need to do. \n\nFrank-S\n\n--- In EVP-ITC@yahoogroups.com, juli velazquez \n&lt;ghostchasingfool@...&gt; wrote:\n&gt;\n&gt; Frank:\n&gt; I think your input is very important, hell you are \nthe inventor! As far a people taking what you say to be negative, \nwell if they do oh well they will get over it. I personally don&#39;t \nthink there are any experts, which is my opinion for what it is worth \nand I am sure I will catch hell over my statement. I for one can not \nsay or confirm who I am talking to, nor will I ever be able to (well \nmaybe when I&#39;m dead) if they are in fact spirits from the other side \nor other life forms from different planets. I do however know that I \nlove the communication who ever they are and pretty much have to \nleave it at that. I think this is what makes it so fascinating to \nme, that so much of the communication we receive is unknown in \norigin. You have taught us that we should take this as it comes, and \nnot hold too much truth to some of the messages. \n&gt; \n&gt; You for one designed each an every box \ndifferently, having its own unique features about them. From white \nnoise generators, to random, to lunar, etc.. You adapted them as you \nwent, so if anyone has experimented the most in this field, I would \nsay it certainly would be you. The never ending days and hours you \nhave spent creating these devices truly surpass all of us combined \ntime in the research end, so I don&#39;t think I have to say anymore \nthere.\n&gt; \n&gt; I can only speak for myself, but I feel that your contributions \nare extremely important and are needed. You have helped and touched \npeoples lives many you will probably never know of or meet. It is \nbecause of your desire and constant dedication with your building of \nperfection that you have allowed us an opportunity to experience what \nyou do knowing that there is more out there than just us, in our \nselfish world of our.\n&gt; \n&gt; Hell I&#39;m calling it a good day when I can turn my TV remote on, \nso I know I certainly count on you for your experiences in obtaining \nthe best communication!\n&gt; \n&gt; Juli\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt; I was going to make comments about box use, but so far \nit always falls on deaf ears, and gets taken as being negative, so \nscrew it, the &quot;experts&quot; can hash it out. What would I know, I just \nmake the damn things?! BTW, for the above reasons, not making boxes \nfror anyone. I don&#39;t care what you want to use it for, or how \nquailified anyone thinks they are.\n&gt; \n&gt; Frank-s\n&gt; \n&gt; \n&gt; ---------------------------------\n&gt; Helping your favorite cause is as easy as instant messaging. You \nIM, we give. Learn more.\n&gt;\n\n\n\n                         \n\r\n--0-443805659-1204273155=:38559\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;div&gt;Well,&lt;/div&gt;  &lt;div&gt;If you actually have something...it is wrong for you to hide it...&lt;/div&gt;  &lt;div&gt;I haven&#39;t slept well since the 1970&quot;s...&lt;/div&gt;  &lt;div&gt;There are crimes to be solved...the dead are screaming for help...&lt;/div&gt;  &lt;div&gt;Sometimes, all forensics needs is a direction...&lt;/div&gt;  &lt;div&gt;Frank...if this is actually your name...jeese...do the world a favor...do the right thing and show us how to help them...if we help the dead...we help thousands of the living.&lt;/div&gt;  &lt;div&gt;But understand what you do...the religious right will hate you.&lt;/div&gt;  &lt;div&gt;It goes against everything &quot;they&quot; say about the human soul.&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;purplespacefriend &lt;purplealiengirl@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/div&gt;  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;div&gt;Wanting to be less negative sounding, I can&#39;t rule out producing the &lt;BR&gt;boxes some time in the future. I just can&#39;t provide any and do the &lt;BR&gt;testing and problem solving I need to do. &lt;BR&gt;&lt;BR&gt;Frank-S&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;, juli velazquez &lt;BR&gt;&lt;ghostchasingfool@&lt;WBR&gt;...&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; Frank:&lt;BR&gt;&gt; I think your input is very important, hell you are &lt;BR&gt;the inventor! As far a people taking what you say to be negative, &lt;BR&gt;well if they do oh well they will get over it. I personally don&#39;t &lt;BR&gt;think there are any experts, which is my opinion for what it is worth &lt;BR&gt;and I am sure I will catch hell over my statement. I for one can not &lt;BR&gt;say or confirm who I am talking to, nor will I ever be able to (well &lt;BR&gt;maybe when I&#39;m dead) if they are in fact spirits from the other side\n &lt;BR&gt;or other life forms from different planets. I do however know that I &lt;BR&gt;love the communication who ever they are and pretty much have to &lt;BR&gt;leave it at that. I think this is what makes it so fascinating to &lt;BR&gt;me, that so much of the communication we receive is unknown in &lt;BR&gt;origin. You have taught us that we should take this as it comes, and &lt;BR&gt;not hold too much truth to some of the messages. &lt;BR&gt;&gt; &lt;BR&gt;&gt; You for one designed each an every box &lt;BR&gt;differently, having its own unique features about them. From white &lt;BR&gt;noise generators, to random, to lunar, etc.. You adapted them as you &lt;BR&gt;went, so if anyone has experimented the most in this field, I would &lt;BR&gt;say it certainly would be you. The never ending days and hours you &lt;BR&gt;have spent creating these devices truly surpass all of us combined &lt;BR&gt;time in the research end, so I don&#39;t think I have to say anymore &lt;BR&gt;there.&lt;BR&gt;&gt; &lt;BR&gt;&gt; I can only speak for myself, but I feel that your contributions\n &lt;BR&gt;are extremely important and are needed. You have helped and touched &lt;BR&gt;peoples lives many you will probably never know of or meet. It is &lt;BR&gt;because of your desire and constant dedication with your building of &lt;BR&gt;perfection that you have allowed us an opportunity to experience what &lt;BR&gt;you do knowing that there is more out there than just us, in our &lt;BR&gt;selfish world of our.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Hell I&#39;m calling it a good day when I can turn my TV remote on, &lt;BR&gt;so I know I certainly count on you for your experiences in obtaining &lt;BR&gt;the best communication!&lt;BR&gt;&gt; &lt;BR&gt;&gt; Juli&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; Frank Sumption &lt;purplealiengirl@&lt;WBR&gt;...&gt; wrote:&lt;BR&gt;&gt; I was going to make comments about box use, but so far &lt;BR&gt;it always falls on deaf ears, and gets taken as being negative, so &lt;BR&gt;screw it, the &quot;experts&quot; can hash it out. What would I know, I just &lt;BR&gt;make the damn things?! BTW, for the above reasons, not making\n boxes &lt;BR&gt;fror anyone. I don&#39;t care what you want to use it for, or how &lt;BR&gt;quailified anyone thinks they are.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Frank-s&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; ------------&lt;WBR&gt;---------&lt;WBR&gt;---------&lt;WBR&gt;---&lt;BR&gt;&gt; Helping your favorite cause is as easy as instant messaging. You &lt;BR&gt;IM, we give. Learn more.&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/div&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;\r\n--0-443805659-1204273155=:38559--"}