{"id": "7451", "subject": "Re: Box alternatives.", "author": "psi_research", "timestamp": "2008-02-29T17:04:39Z", "full_text": "There is a phenomena known as stochastic resonance that states a weak\nsignal can &quot;piggy back&quot; on a stronger carrier signal and then detected\nby us. In other words, we can hear audible noise and our brains and\ndevices can detect and record the embedded messages that would\notherwise be undetectable.  -Bill\n\n--- In EVP-ITC@yahoogroups.com, &quot;LC Duplatt&quot; &lt;lcdupla@...&gt; wrote:\n&gt;\n&gt; Regarding the &quot;noisy&quot; box, why do EVPs seem to come through during \n&gt; people talking?  I have noticed that I find more EVPs if I or another \n&gt; is talking, and then the voice seems to appear between and/or with \n&gt; the audio voices.  Carrier, perhaps?\n&gt; \n&gt; LC\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;psi_research&quot; &lt;vilhellm@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hey mister this is the kind of post I like! I&#39;ve been apprehensive\n&gt; &gt; about blogging here because if you don&#39;t regularly upload your audio\n&gt; &gt; files it results in being ostracized by a lot of participants here.\n&gt; &gt; And the fighting amongst some people is discouraging also. But I\n&gt; &gt; prefer video as you and some others know. So I quietly videotape\n&gt; &gt; sessions and share them with other researchers who aren&#39;t anxious to\n&gt; &gt; pounce on anyone based on opinion or frequency of posting here.\n&gt; &gt; \n&gt; &gt;  Suffice to say virtually every method of ITC is employed by me, and\n&gt; &gt; call me obsolete if you want to but I still mainly use RVG maybe\n&gt; &gt; because it&#39;s what I have to work with even though most others \n&gt; embrace\n&gt; &gt; sweep. I&#39;ve got Hacked Shack and other commercial Boxes, but always\n&gt; &gt; end up going to an early style Box with RVG only. It&#39;s noisy, and\n&gt; &gt; single mode, but it&#39;s what I use most often anyway because of the \n&gt; results.\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@&gt;\n&gt; &gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; \n&gt; &gt; &gt; Hi all; There are alternatives;  1-EVPmaker, a free program that\n&gt; &gt; runs on a PC and performs the same function as the box, that is it\n&gt; &gt; provides the raw audio spirits/entities use to form voices. It is in\n&gt; &gt; fact the inspiration for my boxes.  2-The Mini box by\n&gt; &gt; paranormalsystems.com. It&#39;s a direct output, linear sweep system \n&gt; based\n&gt; &gt; on my boxes, and it does work.  3-Use the manual sweep mathod, take \n&gt; a\n&gt; &gt; radio that can be tuned easily by hand, tune the dial up and down\n&gt; &gt; slowly while recording directly from the speaker. Always announce \n&gt; you\n&gt; &gt; are doing an EVP session before you start recording. Manual sweep \n&gt; was\n&gt; &gt; the basis for linear sweep that the Mini box uses, and that I have\n&gt; &gt; adopted for my boxes, and was first developed here on this group.  \n&gt; 3-\n&gt; &gt; Foreign language-Tune in a short wave broadcast in a language you\n&gt; &gt; don&#39;t understand, and record directly from the speaker of the radio.\n&gt; &gt; You can also use an internet foreign language boroadcast for the \n&gt; same\n&gt; &gt; purpose. See coffeepotghost.com for more information.  4-Radio \n&gt; between\n&gt; &gt; stations as a source of white noise. I like to pick a night when \n&gt; there\n&gt; &gt; lots of skip, stations fadding in and oput randomly, this is a great\n&gt; &gt; source of raw audio. You&#39;ll have ignore the critics that cliam \n&gt; you&#39;re\n&gt; &gt; only hearing broadcast fragments, you hav eto judge the result by\n&gt; &gt; meaning, that is, does the message mean anything personally?   I&#39;m\n&gt; &gt; sure there&#39;s other methods out on the web. I suggest peole start \n&gt; wiht\n&gt; &gt; white noise, and work your way up. \n&gt; &gt; &gt;  \n&gt; &gt; &gt;  There is nothing magical about the boxes, it&#39;s a swept radio,\n&gt; &gt; nothing more. It provides a higher level--louder--audio that spirits\n&gt; &gt; use to make voices, that is all it does!   I usually do not ask\n&gt; &gt; questions when I do sessions, I think that biases the mind into\n&gt; &gt; expecting, and maybe even creating the answers one wants the hear. I\n&gt; &gt; rely on the guides to give me what I need. I also don&#39;t do\n&gt; &gt; &quot;investigations&quot;, again I think it biases your mind into creating \n&gt; what\n&gt; &gt; you want. I really doubt there is any haunting if no one is there to\n&gt; &gt; experience it.   I know---what I say is to be dismissed as it \n&gt; doesn&#39;t\n&gt; &gt; jive with the Hollywood version of the paranormal.      Frank-S    \n&gt; &gt; &gt; _________________________________________________________________\n&gt; &gt; &gt; Connect and share in new ways with Windows Live.\n&gt; &gt; &gt;\n&gt; &gt; http://www.windowslive.com/share.html?\n&gt; ocid=TXT_TAGHM_Wave2_sharelife_012008\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}