{"id": "7462", "subject": "Re: Box alternatives.", "author": "LC Duplatt", "timestamp": "2008-02-29T18:51:46Z", "full_text": "Ann:\n\nYes, I have experienced this too with the box, and get mad at myself \nfor speaking over them, but maybe it cannot be helped.  Yet, even \nEVPs with no box seem to do the same...are our voices a carrier for \ntheir voices?  \n\nI know the leading theory is manipulation of audio bits and white \nnoise with the ghost box (which I admit it sounds like on the FB and \nMiniBox recordings), but I hear it more via &quot;carrier&quot; on top of the \naudio and white noise through the RS boxes.  \n\nJust looking for input here...\n\n;)\n\nLC\n\n--- In EVP-ITC@yahoogroups.com, &quot;lisbyfarrum&quot; &lt;lisby@...&gt; wrote:\n&gt;\n&gt; You know what a doofus I am when it comes to electronics and basic\n&gt; radio understanding, but I experience exactly what you mention here,\n&gt; LC. I also find that as soon as I speak, they start shouting through\n&gt; the box--almost as if they need the energy of my voice, too. I&#39;m\n&gt; always starting a question and stopping because they&#39;re suddenly\n&gt; coming through so loudly. Of course, when I stop, so do they... :(\n&gt; \n&gt; Ann\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;LC Duplatt&quot; &lt;lcdupla@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Regarding the &quot;noisy&quot; box, why do EVPs seem to come through \nduring \n&gt; &gt; people talking?  I have noticed that I find more EVPs if I or \nanother \n&gt; &gt; is talking, and then the voice seems to appear between and/or \nwith \n&gt; &gt; the audio voices.  Carrier, perhaps?\n&gt; &gt; \n&gt; &gt; LC\n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;psi_research&quot; &lt;vilhellm@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; Hey mister this is the kind of post I like! I&#39;ve been \napprehensive\n&gt; &gt; &gt; about blogging here because if you don&#39;t regularly upload your \naudio\n&gt; &gt; &gt; files it results in being ostracized by a lot of participants \nhere.\n&gt; &gt; &gt; And the fighting amongst some people is discouraging also. But I\n&gt; &gt; &gt; prefer video as you and some others know. So I quietly videotape\n&gt; &gt; &gt; sessions and share them with other researchers who aren&#39;t \nanxious to\n&gt; &gt; &gt; pounce on anyone based on opinion or frequency of posting here.\n&gt; &gt; &gt; \n&gt; &gt; &gt;  Suffice to say virtually every method of ITC is employed by \nme, and\n&gt; &gt; &gt; call me obsolete if you want to but I still mainly use RVG maybe\n&gt; &gt; &gt; because it&#39;s what I have to work with even though most others \n&gt; &gt; embrace\n&gt; &gt; &gt; sweep. I&#39;ve got Hacked Shack and other commercial Boxes, but \nalways\n&gt; &gt; &gt; end up going to an early style Box with RVG only. It&#39;s noisy, \nand\n&gt; &gt; &gt; single mode, but it&#39;s what I use most often anyway because of \nthe \n&gt; &gt; results.\n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com, Frank Sumption \n&lt;purplealiengirl@&gt;\n&gt; &gt; &gt; wrote:\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; Hi all; There are alternatives;  1-EVPmaker, a free program \nthat\n&gt; &gt; &gt; runs on a PC and performs the same function as the box, that is \nit\n&gt; &gt; &gt; provides the raw audio spirits/entities use to form voices. It \nis in\n&gt; &gt; &gt; fact the inspiration for my boxes.  2-The Mini box by\n&gt; &gt; &gt; paranormalsystems.com. It&#39;s a direct output, linear sweep \nsystem \n&gt; &gt; based\n&gt; &gt; &gt; on my boxes, and it does work.  3-Use the manual sweep mathod, \ntake \n&gt; &gt; a\n&gt; &gt; &gt; radio that can be tuned easily by hand, tune the dial up and \ndown\n&gt; &gt; &gt; slowly while recording directly from the speaker. Always \nannounce \n&gt; &gt; you\n&gt; &gt; &gt; are doing an EVP session before you start recording. Manual \nsweep \n&gt; &gt; was\n&gt; &gt; &gt; the basis for linear sweep that the Mini box uses, and that I \nhave\n&gt; &gt; &gt; adopted for my boxes, and was first developed here on this \ngroup.  \n&gt; &gt; 3-\n&gt; &gt; &gt; Foreign language-Tune in a short wave broadcast in a language \nyou\n&gt; &gt; &gt; don&#39;t understand, and record directly from the speaker of the \nradio.\n&gt; &gt; &gt; You can also use an internet foreign language boroadcast for \nthe \n&gt; &gt; same\n&gt; &gt; &gt; purpose. See coffeepotghost.com for more information.  4-Radio \n&gt; &gt; between\n&gt; &gt; &gt; stations as a source of white noise. I like to pick a night \nwhen \n&gt; &gt; there\n&gt; &gt; &gt; lots of skip, stations fadding in and oput randomly, this is a \ngreat\n&gt; &gt; &gt; source of raw audio. You&#39;ll have ignore the critics that cliam \n&gt; &gt; you&#39;re\n&gt; &gt; &gt; only hearing broadcast fragments, you hav eto judge the result \nby\n&gt; &gt; &gt; meaning, that is, does the message mean anything personally?   \nI&#39;m\n&gt; &gt; &gt; sure there&#39;s other methods out on the web. I suggest peole \nstart \n&gt; &gt; wiht\n&gt; &gt; &gt; white noise, and work your way up. \n&gt; &gt; &gt; &gt;  \n&gt; &gt; &gt; &gt;  There is nothing magical about the boxes, it&#39;s a swept radio,\n&gt; &gt; &gt; nothing more. It provides a higher level--louder--audio that \nspirits\n&gt; &gt; &gt; use to make voices, that is all it does!   I usually do not ask\n&gt; &gt; &gt; questions when I do sessions, I think that biases the mind into\n&gt; &gt; &gt; expecting, and maybe even creating the answers one wants the \nhear. I\n&gt; &gt; &gt; rely on the guides to give me what I need. I also don&#39;t do\n&gt; &gt; &gt; &quot;investigations&quot;, again I think it biases your mind into \ncreating \n&gt; &gt; what\n&gt; &gt; &gt; you want. I really doubt there is any haunting if no one is \nthere to\n&gt; &gt; &gt; experience it.   I know---what I say is to be dismissed as it \n&gt; &gt; doesn&#39;t\n&gt; &gt; &gt; jive with the Hollywood version of the paranormal.      Frank-\nS    \n&gt; &gt; &gt; &gt; \n_________________________________________________________________\n&gt; &gt; &gt; &gt; Connect and share in new ways with Windows Live.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; http://www.windowslive.com/share.html?\n&gt; &gt; ocid=TXT_TAGHM_Wave2_sharelife_012008\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}