{"id": "7465", "subject": "Re: [EVP-ITC] Shack Hack auctioned", "author": "Debbie Tejada", "timestamp": "2008-02-29T18:56:51Z", "full_text": "Hi guys, I&#39;m still here, reading all of your posts and listening to  \nyour EVPs. I haven&#39;t had much time to spend much time with my Shack  \nHack, still intend to.\n\nJust wanted to add I was pleased to hear about Darkness Radio  \nauctioning off the hacks. I&#39;ve been to a few of their events, and they  \nare all about raising money for charity (and yes, ghost hunting). They  \nput on these 2 day events at different locations (I&#39;ve been to theirs  \nat the Waverly, Stanley and Queen Mary (in December)) and they always  \nhave a dinner the first night with an auction. The guests (usually  \naround 200) bid on various items and like at any fundraiser end up  \npaying way more than an item is worth simply because they want to  \ndonate to a good cause. Dave Schrader, the Darkness Radio host, is  \nusually the auctioneer and he has a spectacular sense of humor.  \nEveryone has a blast. They usually raise around $15,000 or better and  \ndonate to different reputable charities. They are a great, fun bunch  \nof people and the events are extremely enjoyable for me because you  \nget to rub elbows with ghost hunting celebs, meet a lot of nice  \npeople, get into places you can&#39;t investigate as an individual and  \n(the best part) attend lectures also given by various celebs and  \nexperts (such as Rosemary Guiley, Jason & Grant, Chris Fleming,  \nPatrick Burns, etc.)\n\nIf you ever get the opportunity to join in on one of their &quot;retreats&quot;,  \ndon&#39;t hesitate!\n_ _ _ _ _ _ _ _\n\nDebbie T\n&quot;Once you can accept the universe as matter expanding into nothing  \nthat is something, wearing stripes with plaid comes easy. &quot;  ~Albert  \nEinstein\n\nOn Feb 29, 2008, at 10:25 AM, psi_research wrote:\n\n&gt; On the Queen Mary this week, the Darkness Radio event organizers asked\n&gt; that I provide a couple of 12-469&#39;s for their charity auction. The two\n&gt; Shack Hack&#39;s sold for a combined $260. Darkness Radio raised over\n&gt; $17,000 on this event that was donated to a Los Angeles battered\n&gt; woman&#39;s shelter. The organizers have raised a healthy six figures for\n&gt; various charities around the country. It&#39;s always with representatives\n&gt; from the recipient organization present and the checks and cash is\n&gt; publicly counted and turned over to the representatives.\n&gt;\n&gt; The people that attend these events are always eager to learn about FB\n&gt; and the other Boxes. The difference between this event and other\n&gt; public demonstrations of the Box is that no one at the Darkness\n&gt; event&#39;s wants to personally profit from ITC. I explained how to hack\n&gt; the 469&#39;s and the folks who bought them during the auction knew these\n&gt; were originally $24 radios but choose to help the auction while\n&gt; getting a Shack Hack. Later on both nights a group gathered to\n&gt; exchange ideas and listen and try to interpret for themselves what was\n&gt; coming out of the Boxes.\n&gt;\n&gt; -Bill\n&gt;\n&gt;\n&gt; \n\n\nHi guys, I'm s ill he e, eading all o you pos s and lis ening o you EVPs. I ha en' had much ime o spend much ime wi h my Shack Hack, s ill in end o.Jus wan ed o add I was pleased o hea abou Da kness Radio auc ioning o he hacks. I' e been o a ew o hei e en s, and hey a e all abou aising money o cha i y (and yes, ghos hun ing). They pu on hese 2 day e en s a di e en loca ions (I' e been o hei s a he Wa e ly, S anley and Queen Ma y (in Decembe )) and hey always ha e a dinne he i s nigh wi h an auc ion. The gues s (usually a ound 200) bid on a ious i ems and like a any und aise end up paying way mo e han an i em is wo h simply because hey wan o dona e o a good cause. Da e Sch ade , he Da kness Radio hos , is usually he auc ionee and he has a spec acula sense o humo . E e yone has a blas . They usually aise a ound $15,000 o be e and dona e o di e en epu able cha i ies. They a e a g ea , un bunch o people and he e en s a e ex emely enjoyable o me because you ge o ub elbows wi h ghos hun ing celebs, mee a lo o nice people, ge in o places you can' in es iga e as an indi idual and ( he bes pa ) a end lec u es also gi en by a ious celebs and expe s (such as Rosema y Guiley, Jason & G an , Ch is Fleming, Pa ick Bu ns, e c.)I you e e ge he oppo uni y o join in on one o hei \" e ea s\", don' hesi a e! _ _ _ _ _ _ _ _Debbie T\"Once you can accep he uni e se as ma e expanding in o no hing ha is some hing, wea ing s ipes wi h plaid comes easy. \"  ~Albe Eins ein On Feb 29, 2008, a 10:25 AM, psi_ esea ch w o e:On he Queen Ma y his week, he Da kness Radio e en o ganize s asked ha I p o ide a couple o 12-469's o hei cha i y auc ion. The woShack Hack's sold o a combined $260. Da kness Radio aised o e $17,000 on his e en ha was dona ed o a Los Angeles ba e edwoman's shel e . The o ganize s ha e aised a heal hy six igu es o a ious cha i ies a ound he coun y. I 's always wi h ep esen a i es om he ecipien o ganiza ion p esen and he checks and cash ispublicly coun ed and u ned o e o he ep esen a i es. The people ha a end hese e en s a e always eage o lea n abou FBand he o he Boxes. The di e ence be ween his e en and o he public demons a ions o he Box is ha no one a he Da knesse en 's wan s o pe sonally p o i om ITC. I explained how o hack he 469's and he olks who bough hem du ing he auc ion knew hesewe e o iginally $24 adios bu choose o help he auc ion whilege ing a Shack Hack. La e on bo h nigh s a g oup ga he ed oexchange ideas and lis en and y o in e p e o hemsel es wha wascoming ou o he Boxes.-Bill"}