{"id": "7493", "subject": "Re: [EVP-ITC] New to the board", "author": "Lisby", "timestamp": "2008-03-01T00:09:10Z", "full_text": "Holly,\n\nI tend to agree with your train of thought on the &quot;purple&quot; issue.   \nI&#39;ve also suggested to him that Purple is a vibrational frequency.  \nHowever, Frank&#39;s communicants tell him they are from Purple, a planet  \nin some other realm of life. He can explain further, if he chooses.\n\nI&#39;d like to address this meme about no women having Frank&#39;s boxes.\n\nFrank has made 31 boxes in total. Of that 31 only a small majority  \nwere given away. Many were cannibalized for parts. Others were  \nvictims of premature circuit death. Some have never left Frank&#39;s  \nhouse. Of the official Frank&#39;s boxes still alive and working out  \nthere, one is owned by Rosemary Ellen Guiley, and one is now owned by  \nJuli. There are maybe six men whom I know have a functioning one.  \nExactly how and why each person came to own theirs is their own  \nstory, but having been around, I can say that there was no concerted  \neffort on Frank&#39;s part to slight women. I think that it was mostly a  \ncase of the squeakiest wheels getting the grease. Perhaps one can  \nconclude that the men squeaked louder than the women and can view  \nthis male characteristic in its broader sociological and  \npsychological context.\n\nRemember that we are talking about boxes built by Frank only. And as  \nyou may have read, Frank isn&#39;t giving them away for free anymore,  \nsince the pool of those asking for one has expanded exponentially  \nover the last year or so. However, no one is dependent on Frank for a  \nbox now. There are miniboxes and hacks and there are plenty of women,  \nsuch as myself, who have gotten them and are using them. Our results  \nare, in every way, as real and impressive as our male counterparts.\n\nWhat really concerns me about this meme is that A.) It implies either  \nsomething ugly about Frank or that he is possessed of sad-but-true  \nparanormal insight about how much rubbish women EVP researchers are;  \nB.) Because of it, you are questioning whether women have less  \nsuccess with the research; and C.) That this incorrect idea will  \ncontinue to spread.\n\nThis meme started on this list and women themselves started it. I&#39;m  \nsorry to have to say that, but its true. There is absolutely *no*  \ncorrelation between the the number of original Frank&#39;s boxes in  \nfemale hands and the quality of our results as researchers. It is a  \nnonissue that has kept being given a fresh breath of life until it  \nnow has taken on a life of its own. Right now, I am attempting to  \nstop it not only from living, but also from taking wing.\n\nAnn\n\n\nOn Feb 29, 2008, at 11:33 AM, Holly wrote:\n\n&gt; Hello all !!\n&gt; I have been lurking on the board for awhile, feeling not much to\n&gt; contribute.\n&gt; I am interested in this connection and communication (Thanks to\n&gt; Debbie !!)\n&gt; I&#39;ve observed a few things on the board. Somehow this word &quot;purple&quot;\n&gt; keeps popping up and I can&#39;t help but to think of the color purple in\n&gt; the spectrum. Does the color relate to some sort of sound wave\n&gt; also ? or correlates to something in the electronic field that your\n&gt; helpers from the other side are trying to propose ?\n&gt;\n&gt; Also, I have noticed that the Frank boxes do not seem to be\n&gt; distributed to many women (is this because women do not have good\n&gt; results with the other side ?)\n&gt; I know Debbie has done a lot of successful work, but, does this mean\n&gt; that women have a more difficult time with communication ?\n&gt;\n&gt; I don&#39;t have a box and I don&#39;t know how to build one !! I went to\n&gt; radio shack and whatever was recommended is replaced with the new 470.\n&gt;\n&gt; I don&#39;t know where to begin except that Frank recommended starting\n&gt; with EVPMAKER. I&#39;d like to build something of my own and don&#39;t know\n&gt; where to start with a receiver/scanner of my own.\n&gt; I&#39;d be so happy if someone could share some technology with me !!!??\n&gt; thanks, Holly\n&gt;\n&gt;\n&gt; \n\n\nHolly,I end o ag ee wi h you ain o hough on he \"pu ple\" issue.  I' e also sugges ed o him ha Pu ple is a ib a ional equency. Howe e , F ank's communican s ell him hey a e om Pu ple, a plane in some o he ealm o li e. He can explain u he , i he chooses.I'd like o add ess his meme abou no women ha ing F ank's boxes.F ank has made 31 boxes in o al. O ha 31 only a small majo i y we e gi en away. Many we e cannibalized o pa s. O he s we e ic ims o p ema u e ci cui dea h. Some ha e ne e le F ank's house. O he o icial F ank's boxes s ill ali e and wo king ou he e, one is owned by Rosema y Ellen Guiley, and one is now owned by Juli. The e a e maybe six men whom I know ha e a unc ioning one. Exac ly how and why each pe son came o own hei s is hei own s o y, bu ha ing been a ound, I can say ha he e was no conce ed e o on F ank's pa o sligh women. I hink ha i was mos ly a case o he squeakies wheels ge ing he g ease. Pe haps one can conclude ha he men squeaked loude han he women and can iew his male cha ac e is ic in i s b oade sociological and psychological con ex .Remembe ha we a e alking abou boxes buil by F ank only. And as you may ha e ead, F ank isn' gi ing hem away o ee anymo e, since he pool o hose asking o one has expanded exponen ially o e he las yea o so. Howe e , no one is dependen on F ank o a box now. The e a e miniboxes and hacks and he e a e plen y o women, such as mysel , who ha e go en hem and a e using hem. Ou esul s a e, in e e y way, as eal and imp essi e as ou male coun e pa s.Wha eally conce ns me abou his meme is ha A.) I implies ei he some hing ugly abou F ank o ha he is possessed o sad-bu - ue pa ano mal insigh abou how much ubbish women EVP esea che s a e; B.) Because o i , you a e ques ioning whe he women ha e less success wi h he esea ch; and C.) Tha his inco ec idea will con inue o sp ead.This meme s a ed on his lis and women hemsel es s a ed i . I'm so y o ha e o say ha , bu i s ue. The e is absolu ely *no* co ela ion be ween he he numbe o o iginal F ank's boxes in emale hands and he quali y o ou esul s as esea che s. I is a nonissue ha has kep being gi en a esh b ea h o li e un il i now has aken on a li e o i s own. Righ now, I am a emp ing o s op i no only om li ing, bu also om aking wing.AnnOn Feb 29, 2008, a 11:33 AM, Holly w o e:Hello all !!I ha e been lu king on he boa d o awhile, eeling no much o con ibu e.I am in e es ed in his connec ion and communica ion (Thanks o Debbie !!)I' e obse ed a ew hings on he boa d. Somehow his wo d \"pu ple\" keeps popping up and I can' help bu o hink o he colo pu ple in  he spec um. Does he colo ela e o some so o sound wa e also ? o co ela es o some hing in he elec onic ield ha you  helpe s om he o he side a e ying o p opose ?Also, I ha e no iced ha he F ank boxes do no seem o be dis ibu ed o many women (is his because women do no ha e good  esul s wi h he o he side ?)I know Debbie has done a lo o success ul wo k, bu , does his mean  ha women ha e a mo e di icul ime wi h communica ion ?I don' ha e a box and I don' know how o build one !! I wen o  adio shack and wha e e was ecommended is eplaced wi h he new 470.I don' know whe e o begin excep ha F ank ecommended s a ing wi h EVPMAKER. I'd like o build some hing o my own and don' know whe e o s a wi h a ecei e /scanne o my own.I'd be so happy i someone could sha e some echnology wi h me !!!?? hanks, Holly"}