{"id": "7501", "subject": "Re: New to the board", "author": "LC Duplatt", "timestamp": "2008-03-01T04:13:42Z", "full_text": "UFOGeek.com\n\n\n--- In EVP-ITC@yahoogroups.com, Michael Edwards &lt;f1cracker75@...&gt; \nwrote:\n&gt;\n&gt; Thanks Misty.\n&gt;    \n&gt;   Would you by chance have the You Tube site where that is for the \n12-470?\n&gt;    \n&gt;   Mike Edwards Cary, NC\n&gt; \n&gt; Misty Dawn &lt;bulletbabea@...&gt; wrote:\n&gt;             Holly\n&gt;   Mike posted some videos on his website for both hacks the 12-469 \nand the 12-470. They are also on youtube. For the 470 its pretty much \njust snipping the wire that goes to the mute instead of removing a \npin in the 469.\n&gt;    \n&gt;   People say they have good results with the 470 because the 469 \nhas a clicking noise.\n&gt;    \n&gt;   Misty\n&gt; \n&gt; Holly &lt;holly2422@...&gt; wrote:\n&gt;       Hello all !!\n&gt; I have been lurking on the board for awhile, feeling not much to \n&gt; contribute.\n&gt; I am interested in this connection and communication (Thanks to \n&gt; Debbie !!)\n&gt; I&#39;ve observed a few things on the board. Somehow this word &quot;purple&quot; \n&gt; keeps popping up and I can&#39;t help but to think of the color purple \nin \n&gt; the spectrum. Does the color relate to some sort of sound wave \n&gt; also ? or correlates to something in the electronic field that your \n&gt; helpers from the other side are trying to propose ?\n&gt; \n&gt; Also, I have noticed that the Frank boxes do not seem to be \n&gt; distributed to many women (is this because women do not have good \n&gt; results with the other side ?)\n&gt; I know Debbie has done a lot of successful work, but, does this \nmean \n&gt; that women have a more difficult time with communication ?\n&gt; \n&gt; I don&#39;t have a box and I don&#39;t know how to build one !! I went to \n&gt; radio shack and whatever was recommended is replaced with the new \n470.\n&gt; \n&gt; I don&#39;t know where to begin except that Frank recommended starting \n&gt; with EVPMAKER. I&#39;d like to build something of my own and don&#39;t know \n&gt; where to start with a receiver/scanner of my own.\n&gt; I&#39;d be so happy if someone could share some technology with me !!!??\n&gt; thanks, Holly\n&gt; \n&gt; \n&gt; \n&gt; \n&gt;     \n&gt; ---------------------------------\n&gt;   Looking for last minute shopping deals? Find them fast with \nYahoo! Search.  \n&gt; \n&gt;                          \n&gt; \n&gt;        \n&gt; ---------------------------------\n&gt; Never miss a thing.   Make Yahoo your homepage.\n&gt;"}