{"id": "7502", "subject": "Re: [EVP-ITC] Thanks Juli!", "author": "juli velazquez", "timestamp": "2008-03-01T04:36:03Z", "full_text": "--0-465915450-1204346163=:71355\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nRobin, you are very welcome, and thanks for the kind words.  I may just have a temporary solution to your reception problem.  I was experiencing the same thing living in the country.  I was literally hangout my bathroom window trying to get a good signal, getting completely little or no reception.  I came up with an idea to take my camcorder input and output cord, put it into the top of the box and run it through the TV.  The TV acts as an antenna allowing a for a temporary fix to be able to conduct sessions at home.  Just put the channel on like your going to be watch a DVD and it should come right through for you.\n   \n  In addition, Joel also ran a ground with a number #12 copper wire under my sink to the box.  (I know you should see my kitchen, I&#39;m just waiting for the FBI to come think I&#39;m making bombs with my boxes, lol).  It totally increased my reception 10 times over.  I also have a copper rod (#12) looped in my window.  I know this sounds crazy, but I will do just about anything for good communication.\n   \n  I am sure that there are also some of the guys who have assembled makeshift antenna&#39;s as well.  Frank S. sent Joel the wish list for one some time back, and I will see if I can find it.  He is a wealth of knowledge and comes up with ideas to help us get to where we need to be.\n   \n  Lastly, your officially been inducted into the crazy world of box communication.  As far as your family, they will come around, (I&#39;m on my 3rd husband because of the paranormal) and if they don&#39;t you can always trade them in, lol.  They learn to adapt to our world, and just remember, Everyone else who observes you &quot;are just jealous cause we hear voices&quot; (a shirt I wear proudly)!!!\n   \n  Best of Luck!\n  Juli\n   \n   \n   \n   \n   \n  \n\nRobin Henson &lt;MudPuddleFarm@...&gt; wrote:\n          I just wanted to offer a public thank you to Juli for inviting me \ninto the recording group she participates in. I&#39;m excited to join in \nbut am experiencing some minor technical difficulties at the moment.\n\nACK! I have no radio reception! I&#39;m out in the boonies and my house \nbacks right up to a tree-covered hill. I&#39;m going to have to find \nanother private place to do my research.\n\nI had to tag along on errands with hubby and son this afternoon and \nbrought my RS 470 and digital recorder with me for the ride. You \nshoulda seen their reactions when I started asking the radio \nquestions in the car! My son said I was scaring him (geez, he&#39;s 19), \nand my husband said I was like one of the bag ladies we see walking \ndown the street talking to herself. They&#39;re both disappointed in me \nfor not having a more acceptable hobby like knitting. I stayed in \nthe car recording when they went into the store, and then I noticed \nthere was this woman in the car next to me who had been staring at me \nopen-mouthed for God knows how long. I haven&#39;t uploaded the \nrecording to the computer yet, but really don&#39;t think I got anything \nbesides radio fragment.\n\nSpeaking of that, the scan rate seems pretty fast, and yet the \nstations each hold for several seconds, so I get more like complete \nsentences than broadcast &quot;fragments.&quot; \n\nDo you think some people are chosen to be researchers in this field? \nI guess I&#39;m feeling a little discouraged right now, but I&#39;ll figure \nthis out soon. \n\nRobin\n\n\n\n                         \n\n\n  The contents of this eletronic correspondence is private & confidential and meant only for the party and/or parties it is addressed to.  \n   \n  No part of this email transmission may be publicly posted or forwarded to other parties without explicit written permission.\n\n\r\n--0-465915450-1204346163=:71355\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;DIV&gt;Robin, you are very welcome, and thanks for the kind words.&nbsp; I may just have a temporary solution to your reception problem.&nbsp; I was experiencing the same thing living in the country.&nbsp; I was literally hangout my bathroom window trying to get a good signal, getting completely little or no reception.&nbsp; I came up with an idea to&nbsp;take my camcorder input and output cord, put it into the top of the box and run it through the TV.&nbsp; The TV acts as an antenna allowing a for a temporary fix to be able to conduct sessions at home.&nbsp; Just put the channel on like your going to be watch a DVD and it should come right through for you.&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;In addition, Joel also ran a ground with a number #12 copper wire under my sink to the box.&nbsp; (I know you should see my kitchen, I&#39;m just waiting for the FBI to come think I&#39;m making bombs with my boxes, lol).&nbsp; It totally increased my reception 10 times over.&nbsp; I also have a\n copper rod (#12) looped in my window.&nbsp;&nbsp;I know this sounds crazy, but I will do just about anything for good communication.&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;I am sure that there are also some of the guys who have assembled makeshift antenna&#39;s as well.&nbsp; Frank S. sent Joel the wish list for one some time back, and I will see if I can find it.&nbsp; He is a wealth of knowledge and comes up with ideas to help us get to where we need to be.&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;Lastly, your officially been inducted into the crazy world of box communication.&nbsp; As far as your family, they will come around, (I&#39;m on my 3rd husband because of the paranormal) and if they don&#39;t you can always trade them in, lol.&nbsp; They learn to adapt to our world, and just remember, Everyone else who observes you &quot;are just jealous cause we hear voices&quot; (a shirt I wear proudly)!!!&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;Best of Luck!&lt;/DIV&gt;  &lt;DIV&gt;Juli&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt; \n &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;Robin Henson &lt;MudPuddleFarm@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/DIV&gt;  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;DIV&gt;I just wanted to offer a public thank you to Juli for inviting me &lt;BR&gt;into the recording group she participates in. I&#39;m excited to join in &lt;BR&gt;but am experiencing some minor technical difficulties at the moment.&lt;BR&gt;&lt;BR&gt;ACK! I have no radio reception! I&#39;m out in the boonies and my house &lt;BR&gt;backs right up to a tree-covered hill. I&#39;m going to have to find &lt;BR&gt;another private place to do my research.&lt;BR&gt;&lt;BR&gt;I had to tag along on errands with\n hubby and son this afternoon and &lt;BR&gt;brought my RS 470 and digital recorder with me for the ride. You &lt;BR&gt;shoulda seen their reactions when I started asking the radio &lt;BR&gt;questions in the car! My son said I was scaring him (geez, he&#39;s 19), &lt;BR&gt;and my husband said I was like one of the bag ladies we see walking &lt;BR&gt;down the street talking to herself. They&#39;re both disappointed in me &lt;BR&gt;for not having a more acceptable hobby like knitting. I stayed in &lt;BR&gt;the car recording when they went into the store, and then I noticed &lt;BR&gt;there was this woman in the car next to me who had been staring at me &lt;BR&gt;open-mouthed for God knows how long. I haven&#39;t uploaded the &lt;BR&gt;recording to the computer yet, but really don&#39;t think I got anything &lt;BR&gt;besides radio fragment.&lt;BR&gt;&lt;BR&gt;Speaking of that, the scan rate seems pretty fast, and yet the &lt;BR&gt;stations each hold for several seconds, so I get more like complete &lt;BR&gt;sentences than broadcast &quot;fragments.&quot; &lt;BR&gt;&lt;BR&gt;Do you think some people are\n chosen to be researchers in this field? &lt;BR&gt;I guess I&#39;m feeling a little discouraged right now, but I&#39;ll figure &lt;BR&gt;this out soon. &lt;BR&gt;&lt;BR&gt;Robin&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;&lt;DIV&gt;  &lt;div&gt;&lt;EM&gt;&lt;STRONG&gt;&lt;FONT color=#0000ff&gt;The contents of this eletronic correspondence is private &amp; confidential and meant only for the party and/or parties it is addressed to.&nbsp; &lt;/FONT&gt;&lt;/STRONG&gt;&lt;/EM&gt;&lt;/div&gt;  &lt;div&gt;&lt;EM&gt;&lt;STRONG&gt;&lt;FONT color=#0000ff&gt;&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/EM&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;&lt;EM&gt;&lt;STRONG&gt;&lt;FONT color=#0000ff&gt;No part of this email transmission may be publicly posted or forwarded to other parties without explicit written permission.&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/EM&gt;&lt;/div&gt;&lt;/DIV&gt;\r\n--0-465915450-1204346163=:71355--"}