{"id": "7509", "subject": "Re: Thanks Juli!", "author": "purplespacefriend", "timestamp": "2008-03-01T07:08:04Z", "full_text": "I&#39;d be cautious about long wire, and the tuner module in #12, a \nlittle static build and poof! You can use back to back diodes across \nthe wire to help discharge voltage before it gets to high. \n\n Frank-S\n\n --- In EVP-ITC@yahoogroups.com, Joel Smith &lt;shadow71414@...&gt; wrote:\n&gt;\n&gt; well now  that hill with tree  sounds perfect to have ur hubby run \nsome coppper wire there and  speaker wire  #16 or #14  depends on the \ndistance  and that should improve  your recption.\n&gt; \n&gt; joel\n&gt; \n&gt; \n&gt; ----- Original Message ----\n&gt; From: Robin Henson &lt;MudPuddleFarm@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Friday, February 29, 2008 8:51:20 PM\n&gt; Subject: [EVP-ITC] Thanks Juli!\n&gt; \n&gt; I just wanted to offer a public thank you to Juli for inviting me \n&gt; into the recording group she participates in. I&#39;m excited to join \nin \n&gt; but am experiencing some minor technical difficulties at the moment.\n&gt; \n&gt; ACK! I have no radio reception! I&#39;m out in the boonies and my house \n&gt; backs right up to a tree-covered hill. I&#39;m going to have to find \n&gt; another private place to do my research.\n&gt; \n&gt; I had to tag along on errands with hubby and son this afternoon and \n&gt; brought my RS 470 and digital recorder with me for the ride. You \n&gt; shoulda seen their reactions when I started asking the radio \n&gt; questions in the car! My son said I was scaring him (geez, he&#39;s \n19), \n&gt; and my husband said I was like one of the bag ladies we see walking \n&gt; down the street talking to herself. They&#39;re both disappointed in me \n&gt; for not having a more acceptable hobby like knitting. I stayed in \n&gt; the car recording when they went into the store, and then I noticed \n&gt; there was this woman in the car next to me who had been staring at \nme \n&gt; open-mouthed for God knows how long. I haven&#39;t uploaded the \n&gt; recording to the computer yet, but really don&#39;t think I got \nanything \n&gt; besides radio fragment.\n&gt; \n&gt; Speaking of that, the scan rate seems pretty fast, and yet the \n&gt; stations each hold for several seconds, so I get more like complete \n&gt; sentences than broadcast &quot;fragments.&quot; \n&gt; \n&gt; Do you think some people are chosen to be researchers in this \nfield? \n&gt; I guess I&#39;m feeling a little discouraged right now, but I&#39;ll figure \n&gt; this out soon. \n&gt; \n&gt; Robin\n&gt; \n&gt; \n&gt;  \n&gt; \n&gt; \n&gt;       \n______________________________________________________________________\n______________\n&gt; Looking for last minute shopping deals?  \n&gt; Find them fast with Yahoo! Search.  \nhttp://tools.search.yahoo.com/newsearch/category.php?category=shopping\n&gt;"}