{"id": "7516", "subject": "Re: New to the board", "author": "misujoey", "timestamp": "2008-03-01T14:11:39Z", "full_text": "Hi Holly,  Nice to see you here!!  It&#39;s Debbie! I lost your e-mail \naddress .. I have two RS Hacks that I bought from MC here.  Let me \nknow if you might want them .. My goal is to have long two-way \nconversations and the RS Hacks are hard for me to use.  \n\nI&#39;m fascinated by the results of the &quot;radio-sweep&quot; method and \nthe &quot;boxes&quot; are amazing to experiment with, but you can achieve the \nsame results by sweeping manually. \n\nTalk soon,\n\nDebbie \n\n  \n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; \n&lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  If anyone would care to go to my site that I set up to share \n&gt; information(http://purplealiengirl.tripod.com/), they will hear how \nmy \n&gt; contacts swear I am their long lost Purple Princess. It would be \n&gt; difficult for me to biased against women since I am one on the \ninside, \n&gt; even &quot;normal&quot; ghosts claim they see a woman. While a straight, \nalbeit \n&gt; old, male, I prefer the feminine side of things. Purple is not so \nmuch \n&gt; a type of alien, or Planet. It&#39;s a spiritual designation, as in the \n&gt; Purple Lady, or someone on a spiritual mission. I don&#39;t understand \nit \n&gt; completely either, but it&#39;s connected to the Catholics some how. I \n&gt; don&#39;t want to get caught up in religious dogma. \n&gt; \n&gt;  The people with boxes were supposed to be testing them, not going \noff \n&gt; on ego trips, and claiming to be great mediums which was somehow \n&gt; bestowed on them by box use. There is one guy that got four, and \n&gt; claimed none worked, so that&#39;s four out of circulation. Yeah, I am \na \n&gt; bit on the gullible side. There some I can&#39;t account for, like #21, \nI \n&gt; have no idea where it is, or if I skipped a number. A woman in San \n&gt; Diego did get a box directly from me last year, but somehow, Moon \nended \n&gt; up with it.  After last year, of almost non-stop box building, I \njust \n&gt; reached a point where I dread making them for people anymore.\n&gt; \n&gt;  Rosemary Guiley has one, Robin ( a local researcher&#39;s wife) got \none in \n&gt; December for thier wedding. Woman in San Diego had one. There are \nwomen \n&gt; that are deserving of boxes, and who have waited the longest, but I \n&gt; dread giving anymore because it creates more demand. \n&gt; \n&gt;  It&#39;s just a raido for crying out loud!\n&gt; \n&gt;  Frank-S\n&gt;"}