{"id": "7518", "subject": "Re: New to the board", "author": "LC Duplatt", "timestamp": "2008-03-01T14:28:46Z", "full_text": "Frank, maybe you were a female in another lifetime, Princess of the \nPlanet Purple!  Nothing wrong with being in touch with your feminine \nside, my good man, it just means you&#39;re a bit more \nsophisticate...even with the rugged, manly appearance! LOL ;) \n\nThe box has created quite a little cult phenomena, and with what it \ndoes, it is bound to create a mish-mash of different users for a \nmultitude of purposes (good/bad).  However, I would suggest that is \ntypical human nature and not a reflection on you, your device or the \nentire concept of which you conceived.  It seems no matter what is \nhanded out for free, sold, or created by mankind seems to be \nexplored, exploited, tested, experimented with, etc in umpteen \nmanners.  \n\nConsider the microwave; there have been idiots who have put an animal \nin one, and God forbid, yes, even a baby (just happened in Dayton, \nOhio last year).  Does that make the microwave bad?  Hell no, quite \nuseful a tool for popping popcorn and heating our coffee. \n\nI would suggest enjoy your exploration, and if you give some away \nalong the way, don&#39;t feel badly about it, because you have given \nsuggestions as to how it could be used in a good manner. This way you \ncan look from a bigger perspective, watching the idiots be idiots, \nand the few out there who may surprise you by doing something good \nwith what you &quot;birthed&quot; (appealing to your feminine side here). It&#39;s \nlike raising kids, educating them, sending them out into the world \nand observing them.  Some will do well, others well...you can&#39;t \nmake &#39;em drink, you can only lead them to the water. :)\n\nLC\n\n--- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; \n&lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  If anyone would care to go to my site that I set up to share \n&gt; information(http://purplealiengirl.tripod.com/), they will hear how \nmy \n&gt; contacts swear I am their long lost Purple Princess. It would be \n&gt; difficult for me to biased against women since I am one on the \ninside, \n&gt; even &quot;normal&quot; ghosts claim they see a woman. While a straight, \nalbeit \n&gt; old, male, I prefer the feminine side of things. Purple is not so \nmuch \n&gt; a type of alien, or Planet. It&#39;s a spiritual designation, as in the \n&gt; Purple Lady, or someone on a spiritual mission. I don&#39;t understand \nit \n&gt; completely either, but it&#39;s connected to the Catholics some how. I \n&gt; don&#39;t want to get caught up in religious dogma. \n&gt; \n&gt;  The people with boxes were supposed to be testing them, not going \noff \n&gt; on ego trips, and claiming to be great mediums which was somehow \n&gt; bestowed on them by box use. There is one guy that got four, and \n&gt; claimed none worked, so that&#39;s four out of circulation. Yeah, I am \na \n&gt; bit on the gullible side. There some I can&#39;t account for, like #21, \nI \n&gt; have no idea where it is, or if I skipped a number. A woman in San \n&gt; Diego did get a box directly from me last year, but somehow, Moon \nended \n&gt; up with it.  After last year, of almost non-stop box building, I \njust \n&gt; reached a point where I dread making them for people anymore.\n&gt; \n&gt;  Rosemary Guiley has one, Robin ( a local researcher&#39;s wife) got \none in \n&gt; December for thier wedding. Woman in San Diego had one. There are \nwomen \n&gt; that are deserving of boxes, and who have waited the longest, but I \n&gt; dread giving anymore because it creates more demand. \n&gt; \n&gt;  It&#39;s just a raido for crying out loud!\n&gt; \n&gt;  Frank-S\n&gt;"}