{"id": "7525", "subject": "Re: [EVP-ITC] New to the board", "author": "Lisby", "timestamp": "2008-03-01T15:39:03Z", "full_text": "If you have a mac, I recommend Twisted Wave as a sound editor.\n\nAnn\n\nOn Feb 29, 2008, at 11:55 AM, juli velazquez wrote:\n\n&gt;\n&gt; Holly:\n&gt;           WOW...so many questions, lol!\n&gt;\n&gt;           Let me address the communication with the women and the  \n&gt; Boxes!  I currently own a Frank&#39;s Box, #12, which was actually  \n&gt; willed to me via Bruce.  I had no problem with communication from  \n&gt; the get go, and actually have been present many times before and  \n&gt; worked with audio clips for several years prior to receiving a  \n&gt; Frank&#39;s Box.  There are many differences with the make up of each  \n&gt; and every box, with the exceptions of the RS.  At no time have I  \n&gt; ever had problems getting good communication given I had good  \n&gt; reception.  We all struggle at times having good or bad sessions,  \n&gt; but that is the nature of the beast.\n&gt;\n&gt;            The other women to own a Frank&#39;s Box is Rosemary Ellen  \n&gt; Guiley.  She has 2 Frank&#39;s Boxes. Ursula Bielski also owns a Joe&#39;s  \n&gt; Box.   I don&#39;t believe this was intentional on Frank&#39;s part, it  \n&gt; just happened this way.  After Chris Moon obtainning the boxes and  \n&gt; the falling out between Frank and Chris, he has just decided that  \n&gt; it is better at this time not to give anyone any.  The Mini Box as  \n&gt; well as the RS serve the same purpose and you can get just as good  \n&gt; of communication from them.\n&gt;\n&gt;               It is my theory that the color purple as to do with  \n&gt; the energy level, Tesla also believed this.  This is only my theory  \n&gt; and doubt we will ever be able to pin point the reference in my  \n&gt; life time.  I have a theory as well about vibrations and I can clue  \n&gt; you in later on that in obtaining EVP.\n&gt;\n&gt;                As far as building a box, there is a great book out  \n&gt; there called Electronic Pojects from the Next Dimension by Newton  \n&gt; C. Braga.  There are schmatics in there for different projects, as  \n&gt; well as box schmatics on all of the boards.  It&#39;s just like  \n&gt; anything else at the idea that you will have to make changes as you  \n&gt; go along to see what works for you.\n&gt;\n&gt;                 The audio software is the same, which ever you  \n&gt; think works for you.  There are so many out there.  I use Adobe  \n&gt; Audition, Bruce and Steve use Cool Edit, Ann uses something for her  \n&gt; Mac. (ect.).  There are free downloads on most of our  \n&gt; siteswww.ispiinvestigations.com.  Try them out, and see which one  \n&gt; you like the best.  There are so many of us at this point that at  \n&gt; least one of us are bound to have the experience in using it, LOL.\n&gt;\n&gt;                    I hope this helps, looking forward to hearing  \n&gt; your clips!\n&gt;\n&gt; Juli\n&gt;\n&gt; Holly &lt;holly2422@...&gt; wrote:\n&gt; Hello all !!\n&gt; I have been lurking on the board for awhile, feeling not much to\n&gt; contribute.\n&gt; I am interested in this connection and communication (Thanks to\n&gt; Debbie !!)\n&gt; I&#39;ve observed a few things on the board. Somehow this word &quot;purple&quot;\n&gt; keeps popping up and I can&#39;t help but to think of the color purple in\n&gt; the spectrum. Does the color relate to some sort of sound wave\n&gt; also ? or correlates to something in the electronic field that your\n&gt; helpers from the other side are trying to propose ?\n&gt;\n&gt; Also, I have noticed that the Frank boxes do not seem to be\n&gt; distributed to many women (is this because women do not have good\n&gt; results with the other side ?)\n&gt; I know Debbie has done a lot of successful work, but, does this mean\n&gt; that women have a more difficult time with communication ?\n&gt;\n&gt; I don&#39;t have a box and I don&#39;t know how to build one !! I went to\n&gt; radio shack and whatever was recommended is replaced with the new 470.\n&gt;\n&gt; I don&#39;t know where to begin except that Frank recommended starting\n&gt; with EVPMAKER. I&#39;d like to build something of my own and don&#39;t know\n&gt; where to start with a receiver/scanner of my own.\n&gt; I&#39;d be so happy if someone could share some technology with me !!!??\n&gt; thanks, Holly\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; The contents of this eletronic correspondence is private &  \n&gt; confidential and meant only for the party and/or parties it is  \n&gt; addressed to.\n&gt;\n&gt; No part of this email transmission may be publicly posted or  \n&gt; forwarded to other parties without explicit written permission.\n&gt;\n&gt; \n\n\nI you ha e a mac, I ecommend Twis ed Wa e as a sound edi o .AnnOn Feb 29, 2008, a 11:55 AM, juli elazquez w o e:Holly:          WOW...so many ques ions, lol!            Le me add ess he communica ion wi h he women and he Boxes!  I cu en ly own a F ank's Box, #12, which was ac ually willed o me ia B uce.  I had no p oblem wi h communica ion om he ge go, and ac ually ha e been p esen many imes be o e and wo ked wi h audio clips o se e al yea s p io o ecei ing a F ank's Box.  The e a e many di e ences wi h he make up o each and e e y box, wi h he excep ions o he RS.  A no ime ha e I e e had p oblems ge ing good communica ion gi en I had good ecep ion.  We all s uggle a imes ha ing good o bad sessions, bu ha is he na u e o he beas .             The o he women o own a F ank's Box is Rosema y Ellen Guiley.  She has 2 F ank's Boxes. U sula Bielski also owns a Joe's Box.   I don' belie e his was in en ional on F ank's pa , i jus happened his way.  A e Ch is Moon ob ainning he boxes and he alling ou be ween F ank and Ch is, he has jus decided ha i is be e a his ime no o gi e anyone any.  The Mini Box as well as he RS se e he same pu pose and you can ge jus as good o communica ion om hem.               I is my heo y ha he colo pu ple as o do wi h he ene gy le el, Tesla also belie ed his.  This is only my heo y and doub we will e e be able o pin poin he e e ence in my li e ime.  I ha e a heo y as well abou ib a ions and I can clue you in la e on ha in ob aining EVP.                As a as building a box, he e is a g ea book ou he e called Elec onic Pojec s om he Nex Dimension by New on C. B aga.  The e a e schma ics in he e o di e en p ojec s, as well as box schma ics on all o he boa ds.  I 's jus like any hing else a he idea ha you will ha e o make changes as you go along o see wha wo ks o you.                 The audio so wa e is he same, which e e you hink wo ks o you.  The e a e so many ou he e.  I use Adobe Audi ion, B uce and S e e use Cool Edi , Ann uses some hing o he Mac. (ec .).  The e a e ee downloads on mos o ou si eswww.ispiin es iga ions.com.  T y hem ou , and see which one you like he bes .  The e a e so many o us a his poin ha a leas one o us a e bound o ha e he expe ience in using i , LOL.                    I hope his helps, looking o wa d o hea ing you clips! JuliHolly com> w o e:Hello all !!I ha e been lu king on he boa d o awhile, eeling no much o con ibu e.I am in e es ed in his connec ion and communica ion (Thanks o Debbie !!)I' e obse ed a ew hings on he boa d. Somehow his wo d \"pu ple\" keeps popping up and I can' help bu o hink o he colo pu ple in  he spec um. Does he colo ela e o some so o sound wa e also ? o co ela es o some hing in he elec onic ield ha you  helpe s om he o he side a e ying o p opose ?Also, I ha e no iced ha he F ank boxes do no seem o be dis ibu ed o many women (is his because women do no ha e good  esul s wi h he o he side ?)I know Debbie has done a lo o success ul wo k, bu , does his mean  ha women ha e a mo e di icul ime wi h communica ion ?I don' ha e a box and I don' know how o build one !! I wen o  adio shack and wha e e was ecommended is eplaced wi h he new 470.I don' know whe e o begin excep ha F ank ecommended s a ing wi h EVPMAKER. I'd like o build some hing o my own and don' know whe e o s a wi h a ecei e /scanne o my own.I'd be so happy i someone could sha e some echnology wi h me !!!?? hanks, HollyThe con en s o his ele onic co espondence is p i a e & con iden ial and mean only o he pa y and/o pa ies i is add essed o.  No pa o his email ansmission may be publicly pos ed o o wa ded o o he pa ies wi hou explici w i en pe mission."}