{"id": "7526", "subject": "Re: [EVP-ITC] I should attach it", "author": "Nick", "timestamp": "2008-03-01T20:29:48Z", "full_text": "Thanks Juli!  They usually acknowledge my sister too whenever she  \nwalks in.  I can&#39;t tell what she thinks of it, though.\nOn Feb 29, 2008, at 6:58 PM, juli velazquez wrote:\n\n&gt;\n&gt; Good file Nick!  I see the apple don&#39;t fall far from the tree!   \n&gt; It&#39;s funny my girls love when I do spirit communication as well.   \n&gt; My 10 daughter thinks they are my new friends!  She is always  \n&gt; wanting to know if they can in fact see us because they always  \n&gt; acknowledge here when she walks into the room.  I wonder if she as  \n&gt; a unique energy about her?  What ever it is, she wants me to buy  \n&gt; her a box of her own, too bad she is way too young.\n&gt;\n&gt; Juli\n&gt;\n&gt; Nick &lt;thegreatwolf@...&gt; wrote:\n&gt; here is it\n&gt;\n&gt;\n&gt;\n&gt; The contents of this eletronic correspondence is private &  \n&gt; confidential and meant only for the party and/or parties it is  \n&gt; addressed to.\n&gt;\n&gt; No part of this email transmission may be publicly posted or  \n&gt; forwarded to other parties without explicit written permission.\n&gt;\n&gt; \n\n\nThanks Juli!  They usually acknowledge my sis e oo whene e she walks in.  I can' ell wha she hinks o i , hough.  On Feb 29, 2008, a 6:58 PM, juli elazquez w o e:Good ile Nick!  I see he apple don' all a om he ee!  I 's unny my gi ls lo e when I do spi i communica ion as well.  My 10 daugh e hinks hey a e my new iends!  She is always wan ing o know i hey can in ac see us because hey always acknowledge he e when she walks in o he oom.  I wonde i she as a unique ene gy abou he ?  Wha e e i is, she wan s me o buy he a box o he own, oo bad she is way oo young. JuliNick ea hlink.ne > w o e:he e is i The con en s o his ele onic co espondence is p i a e & con iden ial and mean only o he pa y and/o pa ies i is add essed o.  No pa o his email ansmission may be publicly pos ed o o wa ded o o he pa ies wi hou explici w i en pe mission."}