{"id": "7527", "subject": "Re: New member", "author": "Lisa", "timestamp": "2008-03-01T22:07:52Z", "full_text": "The radio I was going to get today is the first one listed at ufogeek,\nbut it didn&#39;t have a speaker and only used headphones, so I thought\nthat was the wrong one. I got the mini 300 model with shortwave, and\njust took the cover off, but I have NO idea what to look for since\nthis wasn&#39;t the one shown on the examples..and I don&#39;t think I have a\nscrewdriver small enough to get the circuit board off.....\n\n--- In EVP-ITC@yahoogroups.com, &quot;Kristin Morris&quot; &lt;ckmorris95@...&gt; wrote:\n&gt;\n&gt; Hi Lisa!  Welcome.  I too am fairly new.  I joined the group\nprobably back\n&gt; in November but I didn&#39;t do any actual box research myself till this\nweek. I\n&gt; am happy to report that I have had an incredible luck getting and\nhearing\n&gt; messages.  I use the RS 12-470.  This unfortunately is hard to get a\nhold of\n&gt; because it is an old model.  It is gray and white versus the black\nversion\n&gt; that RS sells now.  But the 20-125 is readily available and\nlistening to the\n&gt; files from others who use the 20-125 it seems to be great!  I am\ngoing to\n&gt; get one of those too.\n&gt; \n&gt; As for hacking - I&#39;m not technical either and didn&#39;t think I could\ndo it,\n&gt; but plenty of our members UFOGEEK.com (Mike Colletta) has step by step\n&gt; videos to walk you through.  It was not difficult.  You just have to\ntry.\n&gt; Anyway - I spent many months just listening to other people&#39;s clips\nand I\n&gt; really believe that helped to train my ear so when I began my own\nresearch\n&gt; it was a smooth transition.  I&#39;m not saying to wait a couple months like\n&gt; me.. I was just chicken sh* t (if you know what I mean :-) )  but\nlisten to\n&gt; every clip you can - believe me it helps!  The people on the board are\n&gt; extremely helpful and want to see you succeed!\n&gt; \n&gt;  \n&gt; \n&gt; Welcome !!!\n&gt; \n&gt; Kristin\n&gt; \n&gt;  \n&gt; \n&gt;   _____  \n&gt; \n&gt; From: EVP-ITC@yahoogroups.com [mailto:EVP-ITC@yahoogroups.com] On\nBehalf Of\n&gt; Lisa\n&gt; Sent: Saturday, March 01, 2008 9:11 AM\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Subject: [EVP-ITC] New member\n&gt; \n&gt;  \n&gt; \n&gt; Hello,\n&gt; \n&gt; I am new to the group and wanted to say hello. My name is Lisa and I\n&gt; am the Founder & Director of PRISM, Paranormal Researchers in\n&gt; Southeastern Michigan. My fascination with evps and all of the &#39;buzz&#39;\n&gt; about these boxes lately have me more curious than a cat lol So, here\n&gt; I am!\n&gt; \n&gt; I am wondering if you can purchase a radio anywhere to hack it, or if\n&gt; it has to be a radio from Radio Shack? Sorry if my question seems\n&gt; stupid..I am NOT a technical person at all, so this will be\n&gt; interesting, to say the least. I have been browsing through the\n&gt; messages and some are like Chinese to me right now, but none the less\n&gt; I am enjoying them :-)\n&gt; \n&gt; Best of luck to all with their ongoing research!\n&gt; \n&gt; Lisa\n&gt;"}