{"id": "7552", "subject": "Re: [EVP-ITC] Question", "author": "Lisby", "timestamp": "2008-03-02T17:19:15Z", "full_text": "Michelle, if you approach it without fear, with an honest desire to  \nreceive communication, and the willingness to slog it out to get that  \ncommunication, then I think the answer is very much a yes.\n\nAnn\n\nOn Mar 2, 2008, at 12:10 PM, geekgurl66 wrote:\n\n&gt; Hello All!\n&gt; I just recently discovered this group through the Ufogeek&#39;s website.\n&gt; I have been experiencing shadows, electrical sensations that feel like\n&gt; someone else is with me. With that being said, I ask if this\n&gt; technology you all talk about on this group would help me speak with\n&gt; those presences I feel with me? I do not claim a label such as medium,\n&gt; psychic or any other title as I think labels are limiting. I am just\n&gt; sensitive.\n&gt; It is a sense that has run in my family for generations and somewhere\n&gt; along the line we started calling it radar.\n&gt; I have had experienced a situation with a very close friend that a\n&gt; shadow literally popped in on us at the exact time her father passed\n&gt; away. She was unable to see it and I was. It literally scared the @#$\n&gt; out of me. I have been trying to figure out why he came to us and why\n&gt; I was the only one to see this. I was hoping this technology would\n&gt; help me understand the presences that come to me. I have no intentions\n&gt; of using this for monetary gain or for other people, I just want to\n&gt; understand the presences that come to me. Seems the older I get the\n&gt; more prevalent they are.\n&gt; Let me know your thoughts.\n&gt; Michelle\n&gt;\n&gt;\n&gt; \n\n\nMichelle, i you app oach i wi hou ea , wi h an hones desi e o ecei e communica ion, and he willingness o slog i ou o ge ha communica ion, hen I hink he answe is e y much a yes.AnnOn Ma 2, 2008, a 12:10 PM, geekgu l66 w o e:Hello All!I jus ecen ly disco e ed his g oup h ough he U ogeek's websi e.I ha e been expe iencing shadows, elec ical sensa ions ha eel likesomeone else is wi h me. Wi h ha being said, I ask i his echnology you all alk abou on his g oup would help me speak wi h hose p esences I eel wi h me? I do no claim a label such as medium,psychic o any o he i le as I hink labels a e limi ing. I am jus sensi i e.I is a sense ha has un in my amily o gene a ions and somewhe ealong he line we s a ed calling i ada .I ha e had expe ienced a si ua ion wi h a e y close iend ha ashadow li e ally popped in on us a he exac ime he a he passedaway. She was unable o see i and I was. I li e ally sca ed he @#$ou o me. I ha e been ying o igu e ou why he came o us and whyI was he only one o see his. I was hoping his echnology wouldhelp me unde s and he p esences ha come o me. I ha e no in en ionso using his o mone a y gain o o o he people, I jus wan ounde s and he p esences ha come o me. Seems he olde I ge hemo e p e alen hey a e.Le me know you hough s.Michelle"}