{"id": "7568", "subject": "Re: New to the board", "author": "purplespacefriend", "timestamp": "2008-03-03T06:10:54Z", "full_text": "Yep!\n\n FS\n--- In EVP-ITC@yahoogroups.com, Joanne Tauferner &lt;tauf03@...&gt; wrote:\n&gt;\n&gt; I believe it was Rosemary who was on C2C in December who stated she \nhad two of your boxes.  One of them was 22 and the other was 21 or \n23.  I can&#39;t remember which other one but they are consecutive \nnumbers.\n&gt;    \n&gt;   Joanne :^)\n&gt; \n&gt; purplespacefriend &lt;purplealiengirl@...&gt; wrote:\n&gt;           If anyone would care to go to my site that I set up to \nshare \n&gt; information(http://purplealiengirl.tripod.com/), they will hear how \nmy \n&gt; contacts swear I am their long lost Purple Princess. It would be \n&gt; difficult for me to biased against women since I am one on the \ninside, \n&gt; even &quot;normal&quot; ghosts claim they see a woman. While a straight, \nalbeit \n&gt; old, male, I prefer the feminine side of things. Purple is not so \nmuch \n&gt; a type of alien, or Planet. It&#39;s a spiritual designation, as in the \n&gt; Purple Lady, or someone on a spiritual mission. I don&#39;t understand \nit \n&gt; completely either, but it&#39;s connected to the Catholics some how. I \n&gt; don&#39;t want to get caught up in religious dogma. \n&gt; \n&gt; The people with boxes were supposed to be testing them, not going \noff \n&gt; on ego trips, and claiming to be great mediums which was somehow \n&gt; bestowed on them by box use. There is one guy that got four, and \n&gt; claimed none worked, so that&#39;s four out of circulation. Yeah, I am \na \n&gt; bit on the gullible side. There some I can&#39;t account for, like #21, \nI \n&gt; have no idea where it is, or if I skipped a number. A woman in San \n&gt; Diego did get a box directly from me last year, but somehow, Moon \nended \n&gt; up with it. After last year, of almost non-stop box building, I \njust \n&gt; reached a point where I dread making them for people anymore.\n&gt; \n&gt; Rosemary Guiley has one, Robin ( a local researcher&#39;s wife) got one \nin \n&gt; December for thier wedding. Woman in San Diego had one. There are \nwomen \n&gt; that are deserving of boxes, and who have waited the longest, but I \n&gt; dread giving anymore because it creates more demand. \n&gt; \n&gt; It&#39;s just a raido for crying out loud!\n&gt; \n&gt; Frank-S\n&gt; \n&gt; \n&gt; \n&gt;                          \n&gt; \n&gt;        \n&gt; ---------------------------------\n&gt; Looking for last minute shopping deals?  Find them fast with Yahoo! \nSearch.\n&gt;"}