{"id": "7585", "subject": "Re: [EVP-ITC] Re: New to the board", "author": "Lisby", "timestamp": "2008-03-03T16:05:30Z", "full_text": "Juli--how does a skype session work?\n\nAnn\n\nOn Mar 3, 2008, at 10:23 AM, juli velazquez wrote:\n\n&gt;\n&gt; I am extremely greatful to have gotten a box and I&#39;m more than  \n&gt; happy to share the audio as well as doing sessions with anyone if  \n&gt; they would like to experience one of Frank&#39;s wonderful devises.   \n&gt; Some of the previous owners of the boxes don&#39;t seem willing to  \n&gt; share, or feel a need to charge you for the experience.  I think  \n&gt; this is a terrible!!!  Frank had spent many hours building this  \n&gt; devices, and believe this was never his intention for people to  \n&gt; keep their experience and audio to themselves or to profit in anyway.\n&gt;\n&gt; Therefore, anyone wanting to sit in on a session is more than  \n&gt; welcome.  Some of us here get together via Skype free internet  \n&gt; phone, allowing an opportunity for anyone to take part and share  \n&gt; the experience.  Just because you don&#39;t have  FB doesn&#39;t mean you  \n&gt; can&#39;t experience and take part in great communication.  Prior to me  \n&gt; owning one, I sat in with Steve and Bruce, allowing me an  \n&gt; opportunity to listen to their FB&#39;s (which they both have  \n&gt; differently unique boxes) and do my own recordings.  To them I was  \n&gt; very greatful, and I never felt left off.\n&gt;\n&gt; Many of us have various boxes and conduct sessions differently,  \n&gt; this allows us additional ways to learn from each other and  \n&gt; experience all the boxes.\n&gt;\n&gt; If anyone is interested, please just let me know, some of you hear  \n&gt; already can confirm these get togethers and you walk away with a  \n&gt; greater respect for each other and spirit communication.\n&gt;\n&gt; Juli\n&gt;\n&gt;\n&gt;\n&gt; purplespacefriend &lt;purplealiengirl@...&gt; wrote:\n&gt; Yep!\n&gt;\n&gt; FS\n&gt; --- In EVP-ITC@yahoogroups.com, Joanne Tauferner &lt;tauf03@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; I believe it was Rosemary who was on C2C in December who stated she\n&gt; had two of your boxes. One of them was 22 and the other was 21 or\n&gt; 23. I can&#39;t remember which other one but they are consecutive\n&gt; numbers.\n&gt; &gt;\n&gt; &gt; Joanne :^)\n&gt; &gt;\n&gt; &gt; purplespacefriend &lt;purplealiengirl@...&gt; wrote:\n&gt; &gt; If anyone would care to go to my site that I set up to\n&gt; share\n&gt; &gt; information(http://purplealiengirl.tripod.com/), they will hear how\n&gt; my\n&gt; &gt; contacts swear I am their long lost Purple Princess. It would be\n&gt; &gt; difficult for me to biased against women since I am one on the\n&gt; inside,\n&gt; &gt; even &quot;normal&quot; ghosts claim they see a woman. While a straight,\n&gt; albeit\n&gt; &gt; old, male, I prefer the feminine side of things. Purple is not so\n&gt; much\n&gt; &gt; a type of alien, or Planet. It&#39;s a spiritual designation, as in the\n&gt; &gt; Purple Lady, or someone on a spiritual mission. I don&#39;t understand\n&gt; it\n&gt; &gt; completely either, but it&#39;s connected to the Catholics some how. I\n&gt; &gt; don&#39;t want to get caught up in religious dogma.\n&gt; &gt;\n&gt; &gt; The people with boxes were supposed to be testing them, not going\n&gt; off\n&gt; &gt; on ego trips, and claiming to be great mediums which was somehow\n&gt; &gt; bestowed on them by box use. There is one guy that got four, and\n&gt; &gt; claimed none worked, so that&#39;s four out of circulation. Yeah, I am\n&gt; a\n&gt; &gt; bit on the gullible side. There some I can&#39;t account for, like #21,\n&gt; I\n&gt; &gt; have no idea where it is, or if I skipped a number. A woman in San\n&gt; &gt; Diego did get a box directly from me last year, but somehow, Moon\n&gt; ended\n&gt; &gt; up with it. After last year, of almost non-stop box building, I\n&gt; just\n&gt; &gt; reached a point where I dread making them for people anymore.\n&gt; &gt;\n&gt; &gt; Rosemary Guiley has one, Robin ( a local researcher&#39;s wife) got one\n&gt; in\n&gt; &gt; December for thier wedding. Woman in San Diego had one. There are\n&gt; women\n&gt; &gt; that are deserving of boxes, and who have waited the longest, but I\n&gt; &gt; dread giving anymore because it creates more demand.\n&gt; &gt;\n&gt; &gt; It&#39;s just a raido for crying out loud!\n&gt; &gt;\n&gt; &gt; Frank-S\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; ---------------------------------\n&gt; &gt; Looking for last minute shopping deals? Find them fast with Yahoo!\n&gt; Search.\n&gt; &gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; The contents of this eletronic correspondence is private &  \n&gt; confidential and meant only for the party and/or parties it is  \n&gt; addressed to.\n&gt;\n&gt; No part of this email transmission may be publicly posted or  \n&gt; forwarded to other parties without explicit written permission.\n&gt;\n&gt; \n\n\nJuli--how does a skype session wo k?AnnOn Ma 3, 2008, a 10:23 AM, juli elazquez w o e:I am ex emely g ea ul o ha e go en a box and I'm mo e han happy o sha e he audio as well as doing sessions wi h anyone i hey would like o expe ience one o F ank's wonde ul de ises.  Some o he p e ious owne s o he boxes don' seem willing o sha e, o eel a need o cha ge you o he expe ience.  I hink his is a e ible!!!  F ank had spen many hou s building his de ices, and belie e his was ne e his in en ion o people o keep hei expe ience and audio o hemsel es o o p o i in anyway. The e o e, anyone wan ing o si in on a session is mo e han welcome.  Some o us he e ge oge he ia Skype ee in e ne phone, allowing an oppo uni y o anyone o ake pa and sha e he expe ience.  Jus because you don' ha e  FB doesn' mean you can' expe ience and ake pa in g ea communica ion.  P io o me owning one, I sa in wi h S e e and B uce, allowing me an oppo uni y o lis en o hei FB's (which hey bo h ha e di e en ly unique boxes) and do my own eco dings.  To hem I was e y g ea ul, and I ne e el le o .  Many o us ha e a ious boxes and conduc sessions di e en ly, his allows us addi ional ways o lea n om each o he and expe ience all he boxes.  I anyone is in e es ed, please jus le me know, some o you hea al eady can con i m hese ge oge he s and you walk away wi h a g ea e espec o each o he and spi i communica ion. Juli pu plespace iend li e.com> w o e:Yep!FS--- In EVP-ITC@yahoog oups.com, Joanne Tau e ne w o e:>> I belie e i was Rosema y who was on C2C in Decembe who s a ed she had wo o you boxes. One o hem was 22 and he o he was 21 o  23. I can' emembe which o he one bu hey a e consecu i e numbe s.> > Joanne :^)> > pu plespace iend ...> w o e:> I anyone would ca e o go o my si e ha I se up o sha e > in o ma ion(h p://pu plealiengi l. ipod.com/), hey will hea how my > con ac s swea I am hei long los Pu ple P incess. I would be > di icul o me o biased agains women since I am one on he inside, > e en \"no mal\" ghos s claim hey see a woman. While a s aigh , albei  > old, male, I p e e he eminine side o hings. Pu ple is no so much > a ype o alien, o Plane . I 's a spi i ual designa ion, as in he > Pu ple Lady, o someone on a spi i ual mission. I don' unde s and i  > comple ely ei he , bu i 's connec ed o he Ca holics some how. I > don' wan o ge caugh up in eligious dogma. > > The people wi h boxes we e supposed o be es ing hem, no going o  > on ego ips, and claiming o be g ea mediums which was somehow > bes owed on hem by box use. The e is one guy ha go ou , and > claimed none wo ked, so ha 's ou ou o ci cula ion. Yeah, I am a > bi on he gullible side. The e some I can' accoun o , like #21, I > ha e no idea whe e i is, o i I skipped a numbe . A woman in San > Diego did ge a box di ec ly om me las yea , bu somehow, Moon ended > up wi h i . A e las yea , o almos non-s op box building, I jus  > eached a poin whe e I d ead making hem o people anymo e.> > Rosema y Guiley has one, Robin ( a local esea che 's wi e) go one in > Decembe o hie wedding. Woman in San Diego had one. The e a e women > ha a e dese ing o boxes, and who ha e wai ed he longes , bu I > d ead gi ing anymo e because i c ea es mo e demand. > > I 's jus a aido o c ying ou loud!> > F ank-S> > > > > > > ---------------------------------> Looking o las minu e shopping deals? Find hem as wi h Yahoo! Sea ch.>The con en s o his ele onic co espondence is p i a e & con iden ial and mean only o he pa y and/o pa ies i is add essed o.  No pa o his email ansmission may be publicly pos ed o o wa ded o o he pa ies wi hou explici w i en pe mission."}