{"id": "7591", "subject": "Re: Prototype Spirit ...", "author": "LC Duplatt", "timestamp": "2008-03-03T18:20:16Z", "full_text": "Juli, don&#39;t you have your kitchen hot-wired!?  ;)\n\nLC\n\n--- In EVP-ITC@yahoogroups.com, juli velazquez &lt;ghostchasingfool@...&gt; \nwrote:\n&gt;\n&gt; Ron, You have to keep trying!   I know it gets frustrating, but \nthat is what keeps up going!  You will get past the week signal and \nwhen you get that 1 awesome session (above all the rest) it will be \nwell worth it.  \n&gt;    \n&gt;    \n&gt;   I thought the very same thing when I started.  I couldn&#39;t get \nenough of the voices, and keep wanting more and more, only not to be \nable to get the stations and scanning I needed.  I ended up \nresearching for signal strenght, asking Frank and the others for \nhelp, and hear I am now.  \n&gt;    \n&gt;   Its the hurdles we climb, but once we make it to the \ntop......WHOOO what sweet success!\n&gt;    \n&gt;   Juli\n&gt;   \n&gt; \n&gt; Ron Lederer &lt;ronriko@...&gt; wrote:\n&gt;           Just found this about your new box.  Looks and sounds \npromising.  But I suppose in my Land-of-Weak-Signals I would get \nnothing.  On the other hand, I almost feel I would sacrafice a volume \nof sessions and signals for good, clear, multi-word messages.  I am \ngetting EVP block because I am afraid I will get nothing during a \nsession or, worse yet, I may be getting messages but I cannot hear or \nunderstand them...if you get my drift.  Good stuff at your end.  Ron L\n&gt; \n&gt; LC Duplatt &lt;lcdupla@...&gt; wrote:       I had posted this elsewhere, \nbut thought I should post it here for \n&gt; group fodder. The uploaded preceding files were from a new spirit \nbox \n&gt; I am testing that scans to strong signals only on the FM band, with \n&gt; scan rate and range adjustments. This method is different sounding, \n&gt; being somewhat choppy, but may yield clearer audio. The downside, \nas I \n&gt; have been discussing elsewhere, may be the lack of weaker signals \n&gt; between, and less white noise to be utilized. I&#39;ll keep working \nwith \n&gt; it and post my results as I have them. If spirits can manipulate \n&gt; audio, then this method may have merit, too. ;)\n&gt; \n&gt; LC\n&gt; http://www.AngelsGhosts.com\n&gt; \n&gt; \n&gt; \n&gt; \n&gt;     \n&gt; ---------------------------------\n&gt;   Be a better friend, newshound, and know-it-all with Yahoo! \nMobile. Try it now.  \n&gt; \n&gt;                          \n&gt; \n&gt; \n&gt;   The contents of this eletronic correspondence is private & \nconfidential and meant only for the party and/or parties it is \naddressed to.  \n&gt;    \n&gt;   No part of this email transmission may be publicly posted or \nforwarded to other parties without explicit written permission.\n&gt;"}