{"id": "7598", "subject": "Re: [EVP-ITC] Re: Question", "author": "Zack Widup", "timestamp": "2008-03-03T20:40:23Z", "full_text": "Anybody here familiar with &quot;Imaginary Landscape #4&quot; by John Cage? I \nbelieve he gave 24 men 12 radios and had one man control the volume knob \nand another control the tuning knob on each radio. He recorded several \nminutes of it and issued it as a record.\n\nBTW John Cage was one of the fathers of the avante-garde school of music.\nI never noticed any EVP in the recording unfortunately.\n:-)\n\nZack\n\nOn Mon, 3 Mar 2008, purplespacefriend wrote:\n\n&gt; It probably would help, but may just take some patience, and\n&gt; practice. This stuff can be done on the extreme cheap. Several here\n&gt; have had good sussess with just using an AM or FM radio, tuning it\n&gt; slowly by hand while recording wiht the intention of getting EVP. I\n&gt; always announce I&#39;m doing an EVP recording, then tell thenm when I&#39;m\n&gt; stopping. it&#39;s kind of the Mini Box in manula mode. You can record\n&gt; eiterh from the speaker, or a hearphone/line ouput jack.\n&gt; there&#39;s alos EVPmaker, and well as a number of other simple EVP\n&gt; method, such as using running water as background sound.\n&gt;\n&gt; Frank\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, &quot;geekgurl66&quot; &lt;geekgurl66@...&gt; wrote:\n&gt;&gt;\n&gt;&gt; Hello All!\n&gt;&gt; I just recently discovered this group through the Ufogeek&#39;s website.\n&gt;&gt; I have been experiencing shadows, electrical sensations that feel\n&gt; like\n&gt;&gt; someone else is with me. With that being said, I ask if this\n&gt;&gt; technology you all talk about on this group would help me speak with\n&gt;&gt; those presences I feel with me? I do not claim a label such as\n&gt; medium,\n&gt;&gt; psychic or any other title as I think labels are limiting. I am just\n&gt;&gt; sensitive.\n&gt;&gt; It is a sense that has run in my family for generations and\n&gt; somewhere\n&gt;&gt; along the line we started calling it radar.\n&gt;&gt; I have had experienced a situation with a very close friend that a\n&gt;&gt; shadow literally popped in on us at the exact time her father passed\n&gt;&gt; away. She was unable to see it and I was. It literally scared the\n&gt; @#$\n&gt;&gt; out of me. I have been trying to figure out why he came to us and\n&gt; why\n&gt;&gt; I was the only one to see this. I was hoping this technology would\n&gt;&gt; help me understand the presences that come to me. I have no\n&gt; intentions\n&gt;&gt; of using this for monetary gain or for other people, I just want to\n&gt;&gt; understand the presences that come to me. Seems the older I get the\n&gt;&gt; more prevalent they are.\n&gt;&gt; Let me know your thoughts.\n&gt;&gt; Michelle\n&gt;&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Yahoo! Groups Links\n&gt;\n&gt;\n&gt;\n&gt;"}