{"id": "7602", "subject": "FOR LC Re: [EVP-ITC] Re: Prototype Spirit ...", "author": "LC Duplatt", "timestamp": "2008-03-03T22:52:12Z", "full_text": "Well, I thought Radio Shack offered some power antenna boosters, \ndefinitely for FM and maybe even AM.  In this case, I think FM is \nwhat&#39;ll plug into your RS radio.  I didn&#39;t know it would only work \nfor one channel...hhhmmm.\n\nHere is a Radio Shack item # to pop into their search box:\n15-1859 (not sure if this will work or not)\n\nThe other idea would be to buy a very long length of antenna wire and \nadd a male plug to the end of it that fits into the radio (1/8th).  I \nwould be screwing it into something big and made of metal!  That may \nnot make it too mobile, but you have to find some audio bits out \nthere somewhere to start... ;)\n\n\nLC\n\n--- In EVP-ITC@yahoogroups.com, Ron Lederer &lt;ronriko@...&gt; wrote:\n&gt;\n&gt; Yes LC, I bought a select a tenna but it must be set for one \nchannel and I think it is only for a.m.  I have tested it but don&#39;t \nnotice a difference.  I have seen some of the homemade coil deals on \nthe web...can&#39;t do that.  Any ideas, let me know.  Ron\n&gt; \n&gt; LC Duplatt &lt;lcdupla@...&gt; wrote:          Ron, have you tried a \nboosted Am or FM antenna? ;)\n&gt; \n&gt; LC\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Ron Lederer &lt;ronriko@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Just found this about your new box. Looks and sounds promising. \n&gt; But I suppose in my Land-of-Weak-Signals I would get nothing. On \nthe \n&gt; other hand, I almost feel I would sacrafice a volume of sessions \nand \n&gt; signals for good, clear, multi-word messages. I am getting EVP \nblock \n&gt; because I am afraid I will get nothing during a session or, worse \n&gt; yet, I may be getting messages but I cannot hear or understand \n&gt; them...if you get my drift. Good stuff at your end. Ron L\n&gt; &gt; \n&gt; &gt; LC Duplatt &lt;lcdupla@&gt; wrote: I had posted this \n&gt; elsewhere, but thought I should post it here for \n&gt; &gt; group fodder. The uploaded preceding files were from a new spirit \n&gt; box \n&gt; &gt; I am testing that scans to strong signals only on the FM band, \nwith \n&gt; &gt; scan rate and range adjustments. This method is different \nsounding, \n&gt; &gt; being somewhat choppy, but may yield clearer audio. The downside, \n&gt; as I \n&gt; &gt; have been discussing elsewhere, may be the lack of weaker signals \n&gt; &gt; between, and less white noise to be utilized. I&#39;ll keep working \n&gt; with \n&gt; &gt; it and post my results as I have them. If spirits can manipulate \n&gt; &gt; audio, then this method may have merit, too. ;)\n&gt; &gt; \n&gt; &gt; LC\n&gt; &gt; http://www.AngelsGhosts.com\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; ---------------------------------\n&gt; &gt; Be a better friend, newshound, and know-it-all with Yahoo! \nMobile. \n&gt; Try it now.\n&gt; &gt;\n&gt; \n&gt; \n&gt; \n&gt;                          \n&gt; \n&gt;        \n&gt; ---------------------------------\n&gt; Never miss a thing.   Make Yahoo your homepage.\n&gt;"}