{"id": "7654", "subject": "Re: Radio Shack Model 12-469: Used it for the first time today", "author": "LC Duplatt", "timestamp": "2008-03-07T02:01:36Z", "full_text": "Do a google search for a free file converter if you have to.  You can \nGoogle in quotes, &quot;convert wma to wav&quot; for example.  \n\n--- In EVP-ITC@yahoogroups.com, Michael Edwards &lt;f1cracker75@...&gt; \nwrote:\n&gt;\n&gt; Here is my problem. I have a digital recorder and it saves the \nfiles in WMA format. I tried saving the file in .wav, but it wont let \nme.  I have a 4 minute tape, but only need about 30 seconds of the \ntape as that is where I got my response. I am not very technical... \nThis is frustrating as the EVP I got is really clear. i assume I can \nplay the recorder and tape it again with sound recorder but then I \nlose clarity, I would imagine....  Does media player allow an edit of \na file to take out x number of seconds and save to a .wav? have any \nideas\n&gt; .\n&gt;    \n&gt;   My dad used to smoke Marlboro.... brings back memories\n&gt;    \n&gt;   Mike Edwards Cary, NC\n&gt; \n&gt; Marlboro63@... wrote:\n&gt;             Hi Mike,\n&gt;    \n&gt;   I am sure there are enough of us here that will help you out with \nthe file.  You can send it to any of us and we would run it thru our \nsoftware for you and send it back to you in bits and pieces.  I would \nalso recommend cool edit 2.1 for editing the software.  It works \ngreat.....\n&gt;    \n&gt;   Jeff\n&gt;    \n&gt;     In a message dated 3/6/2008 8:39:40 A.M. Central Standard Time, \nf1cracker75@... writes:\n&gt;             I used my 12-469 for the first time this morning, and \nran a 4 minute tape session. One of the questions I asked was, &quot;When \na person dies, do they see a white light?&quot;  After I asked this \nquestion the second time, I got a very distinct and crisp YES.  How \ncan I save just that section of the file? Do I need to do that in the \nrecorder, or can I do it in the .wave file I now have saved on my \ncomputer of the whole recording.\n&gt;    \n&gt;   Mike Edwards Cary, NC\n&gt;     \n&gt; ---------------------------------\n&gt;   Looking for last minute shopping deals? Find them fast with \nYahoo! Search.   \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;     \n&gt; ---------------------------------\n&gt;   It&#39;s Tax Time! Get tips, forms and advice on AOL Money Finance.\n&gt;   \n&gt; \n&gt;                          \n&gt; \n&gt;        \n&gt; ---------------------------------\n&gt; Be a better friend, newshound, and know-it-all with Yahoo! Mobile.  \nTry it now.\n&gt;"}