{"id": "7655", "subject": "Re: Digital Recorder. Olympus WS-100  How can I edit out segments and save to .wav", "author": "Steve Hultay", "timestamp": "2008-03-07T02:16:46Z", "full_text": "Mike,\n\nIf you send the audio to me and tell me where the segment is, i will \ncut that part out and send it back to you.\n\n-Steve H.\n\n\n\n--- In EVP-ITC@yahoogroups.com, Michael Edwards &lt;f1cracker75@...&gt; \nwrote:\n&gt;\n&gt; Here is my problem. I have a digital recorder and it saves the \nfiles in WMA format. I tried saving the file in .wav, but it wont let \nme.  I have a 4 minute tape, but only need about 30 seconds of the \ntape as that is where I got my response. I am not very technical... \nThis is frustrating as the EVP I got is really clear. i assume I can \nplay the recorder and tape it again with sound recorder but then I \nlose clarity, I would imagine....  Does media player allow an edit of \na file to take out x number of seconds and save to a .wav? have any \nideas\n&gt; \n&gt; Rhonda W &lt;rhondak1973@...&gt; wrote:            Hey Mike,\n&gt;   If you want to do a quick edit...you can do it using the sound \nrecorder that comes with Windows. Just go to the start menu, all \nprograms, accessories, entertainment, sound recorder....you can set \nthe position of the marker to before the question and answer and \ndelete the first part and then put the marker so its after and delete \nthe rest...just make sure to save the new one u make separately from \nthe .wav file otherwise you&#39;ll lose the whole thing.  I would make a \ncopy of the .wav and save it else where just to be safe.  That&#39;s an \noption if ya don&#39;t know which program you want to D/L yet.  You can \ndo some pretty cool stuff using that recorder too, speed things up, \nslow em down, play em backwards, add echo, etc.  Pretty nifty for \njust a basic lil thing.\n&gt; \n&gt; Michael Edwards &lt;f1cracker75@...&gt; wrote:\n&gt;         I used my 12-469 for the first time this morning, and ran a \n4 minute tape session. One of the questions I asked was, &quot;When a \nperson dies, do they see a white light?&quot;  After I asked this question \nthe second time, I got a very distinct and crisp YES.  How can I save \njust that section of the file? Do I need to do that in the recorder, \nor can I do it in the .wave file I now have saved on my computer of \nthe whole recording.\n&gt;    \n&gt;   Mike Edwards Cary, NC\n&gt;     \n&gt; ---------------------------------\n&gt;   Looking for last minute shopping deals? Find them fast with \nYahoo! Search.   \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;     \n&gt; ---------------------------------\n&gt;   Looking for last minute shopping deals? Find them fast with \nYahoo! Search.  \n&gt; \n&gt;                          \n&gt; \n&gt;        \n&gt; ---------------------------------\n&gt; Be a better friend, newshound, and know-it-all with Yahoo! Mobile.  \nTry it now.\n&gt;"}