{"id": "7665", "subject": "Re: [EVP-ITC] Digital Recorder. Olympus WS-100  How can I edit out segments and save to .wav", "author": "Debbie Tejada", "timestamp": "2008-03-07T15:48:07Z", "full_text": "Mike Edwards,\n\nI&#39;m definitely not extremely experienced with evp work, but have been  \nable to muddle my way through problems similar to yours. I&#39;m on a Mac,  \nand my audio recorder saves .wma files which like all things Windows  \nis a proprietary format.  I could not load my recordings into my evp  \nanalysis software, Audacity (free software). I was able to find  \nanother free program called Switch, which will read .wma files and  \nsave them into pretty much whatever format you need. If these programs  \nare available for Mac, they must be also available for DOS computers.  \nIf you want more info on how to make clips beyond that, just email me  \ndirectly and I&#39;ll help you as much as I can.\n\nI&#39;m pretty happy with Audacity, especially considering its a free  \nprogram. I also bought Audition for my Windows computer, but my Mac is  \nmore convenient for me (and more reliable, ha ha, a little dig there).\n_ _ _ _ _ _ _ _\n\nDebbie T\n\n&quot;Once you can accept the universe as matter expanding into nothing  \nthat is something, wearing stripes with plaid comes easy. &quot;  ~Albert  \nEinstein\n\nOn Mar 6, 2008, at 6:52 PM, Michael Edwards wrote:\n\n&gt; Here is my problem. I have a digital recorder and it saves the files  \n&gt; in WMA format. I tried saving the file in .wav, but it wont let me.   \n&gt; I have a 4 minute tape, but only need about 30 seconds of the tape  \n&gt; as that is where I got my response. I am not very technical... This  \n&gt; is frustrating as the EVP I got is really clear. i assume I can play  \n&gt; the recorder and tape it again with sound recorder but then I lose  \n&gt; clarity, I would imagine....  Does media player allow an edit of a  \n&gt; file to take out x number of seconds and save to a .wav? have any  \n&gt; ideas\n&gt;\n&gt; Rhonda W &lt;rhondak1973@...&gt; wrote:\n&gt;\n&gt; Hey Mike,\n&gt; If you want to do a quick edit...you can do it using the sound  \n&gt; recorder that comes with Windows. Just go to the start menu, all  \n&gt; programs, accessories, entertainment, sound recorder....you can set  \n&gt; the position of the marker to before the question and answer and  \n&gt; delete the first part and then put the marker so its after and  \n&gt; delete the rest...just make sure to save the new one u make  \n&gt; separately from the .wav file otherwise you&#39;ll lose the whole  \n&gt; thing.  I would make a copy of the .wav and save it else where just  \n&gt; to be safe.  That&#39;s an option if ya don&#39;t know which program you  \n&gt; want to D/L yet.  You can do some pretty cool stuff using that  \n&gt; recorder too, speed things up, slow em down, play em backwards, add  \n&gt; echo, etc.  Pretty nifty for just a basic lil thing.\n&gt;\n&gt; Michael Edwards &lt;f1cracker75@...&gt; wrote:\n&gt; I used my 12-469 for the first time this morning, and ran a 4 minute  \n&gt; tape session. One of the questions I asked was, &quot;When a person dies,  \n&gt; do they see a white light?&quot;  After I asked this question the second  \n&gt; time, I got a very distinct and crisp YES.  How can I save just that  \n&gt; section of the file? Do I need to do that in the recorder, or can I  \n&gt; do it in the .wave file I now have saved on my computer of the whole  \n&gt; recording.\n&gt;\n&gt; Mike Edwards Cary, NC\n&gt; Looking for last minute shopping deals? Find them fast with Yahoo!  \n&gt; Search.\n&gt;\n&gt; Looking for last minute shopping deals? Find them fast with Yahoo!  \n&gt; Search.\n&gt;\n&gt;\n&gt; Be a better friend, newshound, and know-it-all with Yahoo! Mobile.  \n&gt; Try it now.\n&gt;\n&gt; \n\n\nMike Edwa ds,I'm de ini ely no ex emely expe ienced wi h e p wo k, bu ha e been able o muddle my way h ough p oblems simila o you s. I'm on a Mac, and my audio eco de sa es .wma iles which like all hings Windows is a p op ie a y o ma .  I could no load my eco dings in o my e p analysis so wa e, Audaci y ( ee so wa e). I was able o ind ano he ee p og am called Swi ch, which will ead .wma iles and sa e hem in o p e y much wha e e o ma you need. I hese p og ams a e a ailable o Mac, hey mus be also a ailable o DOS compu e s. I you wan mo e in o on how o make clips beyond ha , jus email me di ec ly and I'll help you as much as I can.I'm p e y happy wi h Audaci y, especially conside ing i s a ee p og am. I also bough Audi ion o my Windows compu e , bu my Mac is mo e con enien o me (and mo e eliable, ha ha, a li le dig he e). _ _ _ _ _ _ _ _Debbie T\"Once you can accep he uni e se as ma e expanding in o no hing ha is some hing, wea ing s ipes wi h plaid comes easy. \"  ~Albe Eins ein On Ma 6, 2008, a 6:52 PM, Michael Edwa ds w o e:He e is my p oblem. I ha e a digi al eco de and i sa es he iles in WMA o ma . I ied sa ing he ile in .wa , bu i won le me.  I ha e a 4 minu e ape, bu only need abou 30 seconds o he ape as ha is whe e I go my esponse. I am no e y echnical... This is us a ing as he EVP I go is eally clea . i assume I can play he eco de and ape i again wi h sound eco de bu hen I lose cla i y, I would imagine....  Does media playe allow an edi o a ile o ake ou x numbe o seconds and sa e o a .wa ? ha e any ideasRhonda W yahoo.com> w o e:Hey Mike,I you wan o do a quick edi ...you can do i using he sound eco de ha comes wi h Windows. Jus go o he s a menu, all p og ams, accesso ies, en e ainmen , sound eco de ....you can se he posi ion o he ma ke o be o e he ques ion and answe and dele e he i s pa and hen pu he ma ke so i s a e and dele e he es ...jus make su e o sa e he new one u make sepa a ely om he .wa ile o he wise you'll lose he whole hing.  I would make a copy o he .wa and sa e i else whe e jus o be sa e.  Tha 's an op ion i ya don' know which p og am you wan o D/L ye .  You can do some p e y cool s u using ha eco de oo, speed hings up, slow em down, play em backwa ds, add echo, e c.  P e y ni y o jus a basic lil hing.Michael Edwa ds yahoo.com> w o e:I used my 12-469 o he i s ime his mo ning, and an a 4 minu e ape session. One o he ques ions I asked was, \"When a pe son dies, do hey see a whi e ligh ?\"  A e I asked his ques ion he second ime, I go a e y dis inc and c isp YES.  How can I sa e jus ha sec ion o he ile? Do I need o do ha in he eco de , o can I do i in he .wa e ile I now ha e sa ed on my compu e o he whole eco ding. Mike Edwa ds Ca y, NCLooking o las minu e shopping deals? Find hem as wi h Yahoo! Sea ch.Looking o las minu e shopping deals? Find hem as wi h Yahoo! Sea ch.Be a be e iend, newshound, and know-i -all wi h Yahoo! Mobile. T y i now."}