{"id": "7672", "subject": "Re: [EVP-ITC] Re: Recordings", "author": "Michael Edwards", "timestamp": "2008-03-07T23:55:43Z", "full_text": "--0-1008775067-1204934143=:70700\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nI am impressed! What a trooper you are, and that you are in a way assisting to get closure! I was thinking last night about this coed at Chapel Hil here in my state of NC, as he was shot in the head in a street , and they have no witnesses.  Her name is Eve Carlson.  If we can perfect this tool, and as you said have the documents to back up what messages you get, think of how many people can be helped.  So I assume the police you work with have not pushed you away as a nut job, and are quite happy to receive what you have to help them.  That is great.  \n   \n  In helping children that may still be alive, there has to be spirits out there that know they are alive and where they are.  I wonder if on the other side there is a command center or group just like this group, working to set up a working link where they can assist. Heck, if I was dead, Id join that group and link up with folks like you.  \n   \n  You are a wonderful person and thanks for sharing..\n   \n  If I get anything related to a case, I will send it to you.  \n   \n  Mike Edwards Cary NC\n\njuli velazquez &lt;ghostchasingfool@...&gt; wrote:\n            its not before LC, unfornately it is after they have gone missing or there is a wrongful death attached to their autospy report.  We have been able to get names of people who were named by the box and backed by police accounts.  This has allowed them to take a another look at the statements and requestion those to involved.  It&#39;s very little but, but has provided additional lines of questioning for authorities to pursue.\n   \n  Juli\n\nLC Duplatt &lt;lcdupla@...&gt; wrote:\n      Wow, Juli! I never thought of boxes being used this way, especially \nto try and find missing and abducted children/people, etc, BEFORE \nthey are harmed. What a great idea to discreetly work with law \nenforcement behind the scenes to see if it is viable. ;)\n\nLC\n\n--- In EVP-ITC@yahoogroups.com, juli velazquez &lt;ghostchasingfool@...&gt; \nwrote:\n&gt;\n&gt; Mike,\n&gt; I am an advocate for missing children. I actually \nhave been testing all of the boxes out regarding this, backed up with \nfactual data. I can tell you the results are amazing. \n&gt; \n&gt; I would be more than happy to speak with you regarding \nthis off the board and share some of my clips if your interested.\n&gt; \n&gt; I will tell you, that the box will never be able to be \nused to prove a death or land a conviction, just like you can not \nhave a psychic testify in a court of law. However, if something \nconcrete is received in a message or response, and does in fact \ncoincide with the coroner&#39;s inquest, autopsy reports and/or police \nreports I have in the past, noted the audio and documented it. If it \ncould at lease point us in a direction where creditable evidence \ncould be gathered that could solve the case, or lead investigators \ndown the right path to bring the remains of the missing home, then \nthis could be a amazing thing.\n&gt; \n&gt; Right now as it stands, it is being look at as an \nadditional resource from a psychics perspective and noted just the \nsame. Box communication for this purpose is so new, and most of time \nif you do not have access to the formal reports to back up the \nresponses, then you can not verify the messages from the other side \nnor can you actually trust that the information you are receiving is \ntruth.\n&gt; \n&gt; This is a very sensitive subject, and you would never \nwant to mislead the families as well as law enforcement on a wild \ngoose chase building up hope in the eyes of families who are will do \njust about anything to find answers and bring closure to grieve.\n&gt; \n&gt; I only work with law enforcement in what I do, and \nvery rarely do I ever work with the family. If I have information \nregarding a case, I will submit it to the authorities and only then \nif something I provide strikes a cord to a case, it is up to them to \ncontact me for further information.\n&gt; \n&gt; I hope this answers some of your questions, for it \nseems we all have a common goal of utilizing our communication for \nthe greater good.\n&gt; \n&gt; Juli\n&gt; \n&gt; Michael Edwards &lt;f1cracker75@...&gt; wrote:\n&gt; As most of you know, I am about two weeks old now in \nthis group, and I love it! Very happy to be a part of this team of \npeople with like minded interests.\n&gt; \n&gt; Have any of you used the Ghost boxes to assist with law \nenforcement agencies, and if so, how have they responded to any \nevidence you may have gathered from our spirit friends. \n&gt; \n&gt; I know psychics are already working with police agencies now \naround the world, but the Ghost box is a whole different method.\n&gt; \n&gt; I know the media would have a field day with this, but I would be \ninterested if any of you have received messages that have assisted \nthe police in solving a crime. \n&gt; \n&gt; Mike Edwards Cary, NC\n&gt; \n&gt; ---------------------------------\n&gt; Be a better friend, newshound, and know-it-all with Yahoo! \nMobile. Try it now. \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; The contents of this eletronic correspondence is private & \nconfidential and meant only for the party and/or parties it is \naddressed to. \n&gt; \n&gt; No part of this email transmission may be publicly posted or \nforwarded to other parties without explicit written permission.\n&gt;\n\n\n\n\n\n\n    The contents of this eletronic correspondence is private & confidential and meant only for the party and/or parties it is addressed to.  \n   \n  No part of this email transmission may be publicly posted or forwarded to other parties without explicit written permission.\n\n  \n\n                         \n\n       \n---------------------------------\nNever miss a thing.   Make Yahoo your homepage.\r\n--0-1008775067-1204934143=:70700\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;div&gt;I am impressed! What a trooper you are, and that you are in a way assisting to get closure! I was thinking last night about this coed at Chapel Hil here in my state of NC, as he was shot in the head in a street , and they have no witnesses.&nbsp; Her name is Eve Carlson.&nbsp; If we can perfect this tool, and as you said have the documents to back up what messages you get, think of how many people can be helped.&nbsp; So I assume the police you work with have not pushed you away as a nut job, and are quite happy to receive what you have to help them.&nbsp; That is great.&nbsp; &lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;In helping children that may still be alive, there has to be spirits out there that know they are alive and where they are.&nbsp; I wonder if on the other side there is a command center or group just like this group, working to set up a working link where they can assist. Heck, if I was dead, Id join that group and link up with folks like you.&nbsp; &lt;/div&gt; \n &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;You are a wonderful person and thanks for sharing..&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;If I get anything related to a case, I will send it to you.&nbsp; &lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Mike Edwards Cary NC&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;juli velazquez &lt;ghostchasingfool@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/div&gt;  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;div&gt;  &lt;DIV&gt;its not before LC, unfornately it is after they have gone missing or there is a wrongful death attached to their autospy report.&nbsp; We have been able to get names of people who were named by the box and backed by police accounts.&nbsp; This has allowed them to\n take a another look at the statements and requestion those to involved.&nbsp; It&#39;s very little but, but has provided additional lines of questioning for authorities to pursue.&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;Juli&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;LC Duplatt &lt;lcdupla@yahoo.&lt;WBR&gt;com&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/DIV&gt;  &lt;BLOCKQUOTE class=replbq style=&quot;BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;DIV&gt;Wow, Juli! I never thought of boxes being used this way, especially &lt;BR&gt;to try and find missing and abducted children/people, etc, BEFORE &lt;BR&gt;they are harmed. What a great idea to discreetly work with law &lt;BR&gt;enforcement behind the scenes to see if it is viable. ;)&lt;BR&gt;&lt;BR&gt;LC&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;, juli velazquez &lt;ghostchasingfool@&lt;WBR&gt;...&gt; &lt;BR&gt;wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; Mike,&lt;BR&gt;&gt; I am an advocate for missing children. I actually &lt;BR&gt;have been testing all of the boxes out regarding this, backed up with &lt;BR&gt;factual data. I can\n tell you the results are amazing. &lt;BR&gt;&gt; &lt;BR&gt;&gt; I would be more than happy to speak with you regarding &lt;BR&gt;this off the board and share some of my clips if your interested.&lt;BR&gt;&gt; &lt;BR&gt;&gt; I will tell you, that the box will never be able to be &lt;BR&gt;used to prove a death or land a conviction, just like you can not &lt;BR&gt;have a psychic testify in a court of law. However, if something &lt;BR&gt;concrete is received in a message or response, and does in fact &lt;BR&gt;coincide with the coroner&#39;s inquest, autopsy reports and/or police &lt;BR&gt;reports I have in the past, noted the audio and documented it. If it &lt;BR&gt;could at lease point us in a direction where creditable evidence &lt;BR&gt;could be gathered that could solve the case, or lead investigators &lt;BR&gt;down the right path to bring the remains of the missing home, then &lt;BR&gt;this could be a amazing thing.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Right now as it stands, it is being look at as an &lt;BR&gt;additional resource from a psychics perspective and noted just the\n &lt;BR&gt;same. Box communication for this purpose is so new, and most of time &lt;BR&gt;if you do not have access to the formal reports to back up the &lt;BR&gt;responses, then you can not verify the messages from the other side &lt;BR&gt;nor can you actually trust that the information you are receiving is &lt;BR&gt;truth.&lt;BR&gt;&gt; &lt;BR&gt;&gt; This is a very sensitive subject, and you would never &lt;BR&gt;want to mislead the families as well as law enforcement on a wild &lt;BR&gt;goose chase building up hope in the eyes of families who are will do &lt;BR&gt;just about anything to find answers and bring closure to grieve.&lt;BR&gt;&gt; &lt;BR&gt;&gt; I only work with law enforcement in what I do, and &lt;BR&gt;very rarely do I ever work with the family. If I have information &lt;BR&gt;regarding a case, I will submit it to the authorities and only then &lt;BR&gt;if something I provide strikes a cord to a case, it is up to them to &lt;BR&gt;contact me for further information.&lt;BR&gt;&gt; &lt;BR&gt;&gt; I hope this answers some of your questions, for it &lt;BR&gt;seems we all\n have a common goal of utilizing our communication for &lt;BR&gt;the greater good.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Juli&lt;BR&gt;&gt; &lt;BR&gt;&gt; Michael Edwards &lt;f1cracker75@&lt;WBR&gt;...&gt; wrote:&lt;BR&gt;&gt; As most of you know, I am about two weeks old now in &lt;BR&gt;this group, and I love it! Very happy to be a part of this team of &lt;BR&gt;people with like minded interests.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Have any of you used the Ghost boxes to assist with law &lt;BR&gt;enforcement agencies, and if so, how have they responded to any &lt;BR&gt;evidence you may have gathered from our spirit friends. &lt;BR&gt;&gt; &lt;BR&gt;&gt; I know psychics are already working with police agencies now &lt;BR&gt;around the world, but the Ghost box is a whole different method.&lt;BR&gt;&gt; &lt;BR&gt;&gt; I know the media would have a field day with this, but I would be &lt;BR&gt;interested if any of you have received messages that have assisted &lt;BR&gt;the police in solving a crime. &lt;BR&gt;&gt; &lt;BR&gt;&gt; Mike Edwards Cary, NC&lt;BR&gt;&gt; &lt;BR&gt;&gt;\n ------------&lt;WBR&gt;---------&lt;WBR&gt;---------&lt;WBR&gt;---&lt;BR&gt;&gt; Be a better friend, newshound, and know-it-all with Yahoo! &lt;BR&gt;Mobile. Try it now. &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; The contents of this eletronic correspondence is private &amp; &lt;BR&gt;confidential and meant only for the party and/or parties it is &lt;BR&gt;addressed to. &lt;BR&gt;&gt; &lt;BR&gt;&gt; No part of this email transmission may be publicly posted or &lt;BR&gt;forwarded to other parties without explicit written permission.&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;  &lt;DIV&gt;  &lt;DIV&gt;&lt;EM&gt;&lt;STRONG&gt;&lt;FONT color=#0000ff&gt;The contents of this eletronic correspondence is private &amp; confidential and meant only for the party and/or parties it is addressed to.&nbsp; &lt;/FONT&gt;&lt;/STRONG&gt;&lt;/EM&gt;&lt;/DIV&gt;  &lt;DIV&gt;&lt;EM&gt;&lt;STRONG&gt;&lt;FONT color=#0000ff&gt;&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/EM&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;&lt;EM&gt;&lt;STRONG&gt;&lt;FONT color=#0000ff&gt;No part of this email transmission may be publicly posted or forwarded to other\n parties without explicit written permission.&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/EM&gt;&lt;/DIV&gt;&lt;/DIV&gt;  &lt;div&gt;&lt;/div&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;p&gt;&#32;\n\n      &lt;hr size=1&gt;Never miss a thing.  &lt;a href=&quot;http://us.rd.yahoo.com/evt=51438/*http://www.yahoo.com/r/hs&quot;&gt; Make Yahoo your homepage.&lt;/a&gt;\n\n\r\n--0-1008775067-1204934143=:70700--"}