{"id": "7674", "subject": "Re: Recordings", "author": "LC Duplatt", "timestamp": "2008-03-08T00:48:52Z", "full_text": "Jules, I wondered if as you work with the PDs and achieve positive \nresults, could they tip you sooner, like as soon as they get a call \nof someone missing...  This way you might receive some clues with \nrespect to the whereabouts possibly before things escalate.  I meant \nbefore in the sense of &quot;before the abductor completes his/her \nintentions.&quot;  I could see where this could be very rewarding work for \nyou...and yes, frustrating, upsetting, too.  Nice idea, nice work, \nand nice post, Juli.  ;)\n\nLC\n\n--- In EVP-ITC@yahoogroups.com, juli velazquez &lt;ghostchasingfool@...&gt; \nwrote:\n&gt;\n&gt; its not before LC, unfornately it is after they have gone missing \nor there is a wrongful death attached to their autospy report.  We \nhave been able to get names of people who were named by the box and \nbacked by police accounts.  This has allowed them to take a another \nlook at the statements and requestion those to involved.  It&#39;s very \nlittle but, but has provided additional lines of questioning for \nauthorities to pursue.\n&gt;    \n&gt;   Juli\n&gt; \n&gt; LC Duplatt &lt;lcdupla@...&gt; wrote:\n&gt;           Wow, Juli! I never thought of boxes being used this way, \nespecially \n&gt; to try and find missing and abducted children/people, etc, BEFORE \n&gt; they are harmed. What a great idea to discreetly work with law \n&gt; enforcement behind the scenes to see if it is viable. ;)\n&gt; \n&gt; LC\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, juli velazquez &lt;ghostchasingfool@&gt; \n&gt; wrote:\n&gt; &gt;\n&gt; &gt; Mike,\n&gt; &gt; I am an advocate for missing children. I actually \n&gt; have been testing all of the boxes out regarding this, backed up \nwith \n&gt; factual data. I can tell you the results are amazing. \n&gt; &gt; \n&gt; &gt; I would be more than happy to speak with you regarding \n&gt; this off the board and share some of my clips if your interested.\n&gt; &gt; \n&gt; &gt; I will tell you, that the box will never be able to be \n&gt; used to prove a death or land a conviction, just like you can not \n&gt; have a psychic testify in a court of law. However, if something \n&gt; concrete is received in a message or response, and does in fact \n&gt; coincide with the coroner&#39;s inquest, autopsy reports and/or police \n&gt; reports I have in the past, noted the audio and documented it. If \nit \n&gt; could at lease point us in a direction where creditable evidence \n&gt; could be gathered that could solve the case, or lead investigators \n&gt; down the right path to bring the remains of the missing home, then \n&gt; this could be a amazing thing.\n&gt; &gt; \n&gt; &gt; Right now as it stands, it is being look at as an \n&gt; additional resource from a psychics perspective and noted just the \n&gt; same. Box communication for this purpose is so new, and most of \ntime \n&gt; if you do not have access to the formal reports to back up the \n&gt; responses, then you can not verify the messages from the other side \n&gt; nor can you actually trust that the information you are receiving \nis \n&gt; truth.\n&gt; &gt; \n&gt; &gt; This is a very sensitive subject, and you would never \n&gt; want to mislead the families as well as law enforcement on a wild \n&gt; goose chase building up hope in the eyes of families who are will \ndo \n&gt; just about anything to find answers and bring closure to grieve.\n&gt; &gt; \n&gt; &gt; I only work with law enforcement in what I do, and \n&gt; very rarely do I ever work with the family. If I have information \n&gt; regarding a case, I will submit it to the authorities and only then \n&gt; if something I provide strikes a cord to a case, it is up to them \nto \n&gt; contact me for further information.\n&gt; &gt; \n&gt; &gt; I hope this answers some of your questions, for it \n&gt; seems we all have a common goal of utilizing our communication for \n&gt; the greater good.\n&gt; &gt; \n&gt; &gt; Juli\n&gt; &gt; \n&gt; &gt; Michael Edwards &lt;f1cracker75@&gt; wrote:\n&gt; &gt; As most of you know, I am about two weeks old now in \n&gt; this group, and I love it! Very happy to be a part of this team of \n&gt; people with like minded interests.\n&gt; &gt; \n&gt; &gt; Have any of you used the Ghost boxes to assist with law \n&gt; enforcement agencies, and if so, how have they responded to any \n&gt; evidence you may have gathered from our spirit friends. \n&gt; &gt; \n&gt; &gt; I know psychics are already working with police agencies now \n&gt; around the world, but the Ghost box is a whole different method.\n&gt; &gt; \n&gt; &gt; I know the media would have a field day with this, but I would be \n&gt; interested if any of you have received messages that have assisted \n&gt; the police in solving a crime. \n&gt; &gt; \n&gt; &gt; Mike Edwards Cary, NC\n&gt; &gt; \n&gt; &gt; ---------------------------------\n&gt; &gt; Be a better friend, newshound, and know-it-all with Yahoo! \n&gt; Mobile. Try it now. \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; The contents of this eletronic correspondence is private & \n&gt; confidential and meant only for the party and/or parties it is \n&gt; addressed to. \n&gt; &gt; \n&gt; &gt; No part of this email transmission may be publicly posted or \n&gt; forwarded to other parties without explicit written permission.\n&gt; &gt;\n&gt; \n&gt; \n&gt; \n&gt;                          \n&gt; \n&gt; \n&gt;   The contents of this eletronic correspondence is private & \nconfidential and meant only for the party and/or parties it is \naddressed to.  \n&gt;    \n&gt;   No part of this email transmission may be publicly posted or \nforwarded to other parties without explicit written permission.\n&gt;"}