{"id": "7685", "subject": "Re: Speakjet board", "author": "purplespacefriend", "timestamp": "2008-03-09T05:29:14Z", "full_text": "I use the same thing I use with the randomly tuned boxes, a white \ngenerator, amplifier, and filter. I just added the filter so I can \nadjust the data rate if needed. I used discrete component schmit \ntrigger, inverter, and an AND gate for data control. I still remain \nkinda doubtful of this project without a processor of somekind to \nactually control the Speakjet, but --how do ya know it won&#39;t work if \nya don&#39;t try it? I think I&#39;ll end up using something like a Basic \nStamp to randomly feed the numbers for allophone access to the \nSpeakjet. \n\n I joined the Speakjet yahoo group, but so for I think the \nscience/techno dorks are ignoring my request for guidence.\n\n Frank-S\n\n--- In EVP-ITC@yahoogroups.com, Zack Widup &lt;w9sz@...&gt; wrote:\n&gt;\n&gt; \n&gt; Hi Frank,\n&gt; \n&gt; What kind of RNG are you using?\n&gt; \n&gt; I have a PRNG (pseuso-random number generator) program I&#39;ve used in \n&gt; microcontrollers.  I could add programming to generate voltages \nfrom the \n&gt; numbers it generates. That could be interesting.\n&gt; \n&gt; Zack\n&gt; \n&gt; On Sat, 8 Mar 2008, purplespacefriend wrote:\n&gt; \n&gt; &gt; Interesting! You might have to make sure the voltage levels are\n&gt; &gt; compatible. I made an RNG using white noise, and a discrete\n&gt; &gt; transistor schmitt trigger. I have my test board all ready with\n&gt; &gt; audio, and the RNG.\n&gt; &gt;\n&gt; &gt; Frank-S\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;dead.science&quot; &lt;dead.science@&gt;\n&gt; &gt; wrote:\n&gt; &gt;&gt;\n&gt; &gt;&gt; --Hi Frank.\n&gt; &gt;&gt; When my chip gets here I am going to take an emf meter (KII) and \nuse\n&gt; &gt;&gt; the outputs that power the l.e.d&#39;s to change the status lines on \nthe\n&gt; &gt;&gt; Speakjet chip.  I am also going to try the white noise via a a \nto d\n&gt; &gt;&gt; converter.  If the clock pulse is fast enough the white noise \nshould\n&gt; &gt;&gt; be close to true random even after an a to d converter.\n&gt; &gt;&gt; Rob.\n&gt; &gt;&gt; Dead Science.\n&gt; &gt;&gt; - In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@&gt;\n&gt; &gt; wrote:\n&gt; &gt;&gt;&gt;\n&gt; &gt;&gt;&gt;\n&gt; &gt;&gt;&gt;  My Speakjet test board, using a zif (zero insertion force)\n&gt; &gt; socket,\n&gt; &gt;&gt; jumpers for various modes, and audio amplifiers. I&#39;m thinking use\n&gt; &gt; the\n&gt; &gt;&gt; buffer full line to gate random numbers in from a white noise \nRNG on\n&gt; &gt;&gt; the serial line(?). I haven&#39;t read enough of the manual yet about\n&gt; &gt; the\n&gt; &gt;&gt; data, if it needs to be in a certain form or what. Is it just \nbits,\n&gt; &gt; or\n&gt; &gt;&gt; is it bytes? I&#39;m all rusty and coroded when it comes to digital.\n&gt; &gt;&gt;&gt;\n&gt; &gt;&gt;&gt;  Frank-S\n&gt; &gt;&gt;&gt; \n_________________________________________________________________\n&gt; &gt;&gt;&gt; Need to know the score, the latest news, or you need your\n&gt; &gt;&gt; Hotmail-get your &quot;fix&quot;.\n&gt; &gt;&gt;&gt; http://www.msnmobilefix.com/Default.aspx\n&gt; &gt;&gt;&gt;\n&gt; &gt;&gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Yahoo! Groups Links\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt;"}