{"id": "7689", "subject": "Re: Hello and a request", "author": "msm00", "timestamp": "2008-03-09T23:17:32Z", "full_text": "Actually I&#39;ve been there many times but still don&#39;t see written \ndirections. I see the links to the videos, which look wonderful, but \non a dialup connection, take far too long to download.  Am I missing \nsomething there? Is there a direct link to the written instructions?\n\nThanks so much.\n\nKatie\n\n--- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; \n&lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  Hi, and Welcome Katie;\n&gt; \n&gt;  There&#39;s instructions on ufo geek&#39;s site, just do a goole on UFO \n&gt; geek, and you&#39;ll go right to it. There&#39;s menu on the left side that \n&gt; should have it listed. \n&gt; \n&gt;  Those RS radios are prabably the most economical way to start \n&gt; experimenting with that method. \n&gt; \n&gt;  Frank-S\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;msm00&quot; &lt;fvshkatie@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hi everyone,\n&gt; &gt; \n&gt; &gt; I&#39;m Katie, the founder of Fox Valley Spirit Hunters in Oshkosh \nWI.  \n&gt; I \n&gt; &gt; have developed a lot of interest in the audio/video aspect of \n&gt; &gt; investigating and was pleased to find this group.\n&gt; &gt; \n&gt; &gt; I have a request.  I have been reading up on Frank&#39;s box and the \nRS \n&gt; &gt; hack and have been curious to experiment with a gadget of this \n&gt; sort. \n&gt; &gt; However, I haven&#39;t gone ahead until now, since I just \nunexpectedly \n&gt; &gt; found an older model 12-470 in our local RS store and snapped it \n&gt; up. \n&gt; &gt; \n&gt; &gt; What I need are written instructions (versus the video) for the \n&gt; &gt; modifications needed.  Unfortunately, hubby and I live in the \nstix \n&gt; and \n&gt; &gt; do not yet have high speed access. THe videos look wonderful but \n&gt; simply \n&gt; &gt; take far too long to download on dialup for us.\n&gt; &gt; \n&gt; &gt; Is someone out there in possession of written instructions and \n&gt; would \n&gt; &gt; they be willing to share them?  I would really appreciate it.  \nThx!\n&gt; &gt;\n&gt;"}