{"id": "7752", "subject": "Re: [EVP-ITC] Re: I was wondering......", "author": "Rhonda W", "timestamp": "2008-03-11T03:13:38Z", "full_text": "--0-1704168648-1205205218=:89264\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nThanks Frank.....I didnt even think about it that way, they have some new things to learn before they can do that...kinda a duh moment for me there.  I guess I just miss her so much and have so much that went unsaid and unanswered on her part that I didnt even think about that. but I know ur right...learning new things takes time.\n   \n  Rhonda\n\npurplespacefriend &lt;purplealiengirl@...&gt; wrote:\n          \nMy sympathies! That story seems all too common in this society. It \nmay take some time, first the spirit has to realize where they are, \nand then learn how to communicate. They seem to hear our thoughts, so \nI&#39;m sure your mother knows what was going on and how you feel. \n\nFrank-S\n\n--- In EVP-ITC@yahoogroups.com, Rhonda W &lt;rhondak1973@...&gt; wrote:\n&gt;\n&gt; My mom just passed away on the 21st of Feb and I wasnt able to see \nher for the past year or so mostly due to the fact that my sister was \nselfish and wouldnt tell me what nursing home she put my mom in. She \nsold my mom&#39;s house and property and gave her stuff to goodwill...and \nshe had the nerve to tell me via informal and rather rude email that \nmy mom passed and what a burden it was to her the past few months \ntaking care of her. I know my mom knows that I loved her and will \nalways...but I dont know if she knows what my sister did to keep me \nfrom her and I feel like a horrible daughter...not getting to see her \nbefore she passed. I finally got her address and phone number in a \nchristmas card she sent me and I was able to call her for like 10 \nmins before she had to go eat...and when I tried calling back that \nnight and several times after I only got her machine. I wanted to go \nsee her but didnt have a way to get all the way to where she \nwas...not even the public buses run to\n&gt; where the nursing home was.\n&gt; \n&gt; Ive tried doing some EVPs to see if there was a chance of \ncontacting her...I know ya dont usully get what ur looking for...but \nIve gotten nothing at all. So Im wondering....is there anyone who \nhas done a skype session for this type of situation and gotten any \nsuccess? And would you be willing to do a skype session with me?(Tho \nI have no idea how that would even work, Id be willing to try...heck \njust to be able to listen to a session would be awesome) \n&gt; \n&gt; Thanks,\n&gt; Rhonda\n&gt; \n&gt; \n&gt; ---------------------------------\n&gt; Be a better friend, newshound, and know-it-all with Yahoo! Mobile. \nTry it now.\n&gt;\n\n\n\n                         \n\n       \n---------------------------------\nBe a better friend, newshound, and know-it-all with Yahoo! Mobile.  Try it now.\r\n--0-1704168648-1205205218=:89264\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;div&gt;Thanks Frank.....I didnt even think about it that way, they have some new things to learn before they can do that...kinda a duh moment for me there.&nbsp; I guess I just miss her so much and have so much that went unsaid and unanswered on her part that I didnt even think about that. but I know ur right...learning new things takes time.&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Rhonda&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;purplespacefriend &lt;purplealiengirl@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/div&gt;  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;div&gt;&lt;BR&gt;My sympathies! That story seems all too common in this society. It &lt;BR&gt;may take some time, first the spirit has to\n realize where they are, &lt;BR&gt;and then learn how to communicate. They seem to hear our thoughts, so &lt;BR&gt;I&#39;m sure your mother knows what was going on and how you feel. &lt;BR&gt;&lt;BR&gt;Frank-S&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;, Rhonda W &lt;rhondak1973@&lt;WBR&gt;...&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; My mom just passed away on the 21st of Feb and I wasnt able to see &lt;BR&gt;her for the past year or so mostly due to the fact that my sister was &lt;BR&gt;selfish and wouldnt tell me what nursing home she put my mom in. She &lt;BR&gt;sold my mom&#39;s house and property and gave her stuff to goodwill...and &lt;BR&gt;she had the nerve to tell me via informal and rather rude email that &lt;BR&gt;my mom passed and what a burden it was to her the past few months &lt;BR&gt;taking care of her. I know my mom knows that I loved her and will &lt;BR&gt;always...but I dont know if she knows what my sister did to keep me &lt;BR&gt;from her and I feel like a horrible daughter...not getting to see her\n &lt;BR&gt;before she passed. I finally got her address and phone number in a &lt;BR&gt;christmas card she sent me and I was able to call her for like 10 &lt;BR&gt;mins before she had to go eat...and when I tried calling back that &lt;BR&gt;night and several times after I only got her machine. I wanted to go &lt;BR&gt;see her but didnt have a way to get all the way to where she &lt;BR&gt;was...not even the public buses run to&lt;BR&gt;&gt; where the nursing home was.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Ive tried doing some EVPs to see if there was a chance of &lt;BR&gt;contacting her...I know ya dont usully get what ur looking for...but &lt;BR&gt;Ive gotten nothing at all. So Im wondering...&lt;WBR&gt;.is there anyone who &lt;BR&gt;has done a skype session for this type of situation and gotten any &lt;BR&gt;success? And would you be willing to do a skype session with me?(Tho &lt;BR&gt;I have no idea how that would even work, Id be willing to try...heck &lt;BR&gt;just to be able to listen to a session would be awesome) &lt;BR&gt;&gt; &lt;BR&gt;&gt; Thanks,&lt;BR&gt;&gt; Rhonda&lt;BR&gt;&gt; &lt;BR&gt;&gt;\n &lt;BR&gt;&gt; ------------&lt;WBR&gt;---------&lt;WBR&gt;---------&lt;WBR&gt;---&lt;BR&gt;&gt; Be a better friend, newshound, and know-it-all with Yahoo! Mobile. &lt;BR&gt;Try it now.&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/div&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;p&gt;&#32;\n      &lt;hr size=1&gt;Be a better friend, newshound, and \nknow-it-all with Yahoo! Mobile. &lt;a href=&quot;http://us.rd.yahoo.com/evt=51733/*http://mobile.yahoo.com/;_ylt=Ahu06i62sR8HDtDypao8Wcj9tAcJ &quot;&gt; Try it now.&lt;/a&gt;\r\n--0-1704168648-1205205218=:89264--"}