{"id": "7768", "subject": "Re: I was wondering......", "author": "misujoey", "timestamp": "2008-03-11T17:13:44Z", "full_text": "Hi Rhonda,  I spend a lot of time helping people speak to their loved \nones in Heaven via Evp and telephones .. You&#39;re welcome to e-mail me \n@ www.1800Heaven.com \n\nDebbie\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;purplespacefriend&quot; \n&lt;purplealiengirl@...&gt; wrote:\n&gt;\n&gt;  I&#39;ve heard if you like pretend to talk to then im your mind, and \n&gt; listen, and imagine them taling back, sometimes you actually get \n&gt; answers like that. I&#39;ve done that with my dad, and there&#39;s times I \n&gt; swear we are talking two way--kinda mediumistically. I don&#39;t really \n&gt; hear the voice, but feel it, or feel the conversation. \n&gt; \n&gt;  frank-S\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Rhonda W &lt;rhondak1973@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Thanks Frank.....I didnt even think about it that way, they have \n&gt; some new things to learn before they can do that...kinda a duh \nmoment \n&gt; for me there.  I guess I just miss her so much and have so much \nthat \n&gt; went unsaid and unanswered on her part that I didnt even think \nabout \n&gt; that. but I know ur right...learning new things takes time.\n&gt; &gt;    \n&gt; &gt;   Rhonda\n&gt; &gt; \n&gt; &gt; purplespacefriend &lt;purplealiengirl@&gt; wrote:\n&gt; &gt;           \n&gt; &gt; My sympathies! That story seems all too common in this society. \nIt \n&gt; &gt; may take some time, first the spirit has to realize where they \nare, \n&gt; &gt; and then learn how to communicate. They seem to hear our \nthoughts, \n&gt; so \n&gt; &gt; I&#39;m sure your mother knows what was going on and how you feel. \n&gt; &gt; \n&gt; &gt; Frank-S\n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, Rhonda W &lt;rhondak1973@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; My mom just passed away on the 21st of Feb and I wasnt able to \n&gt; see \n&gt; &gt; her for the past year or so mostly due to the fact that my sister \n&gt; was \n&gt; &gt; selfish and wouldnt tell me what nursing home she put my mom in. \n&gt; She \n&gt; &gt; sold my mom&#39;s house and property and gave her stuff to \n&gt; goodwill...and \n&gt; &gt; she had the nerve to tell me via informal and rather rude email \n&gt; that \n&gt; &gt; my mom passed and what a burden it was to her the past few months \n&gt; &gt; taking care of her. I know my mom knows that I loved her and will \n&gt; &gt; always...but I dont know if she knows what my sister did to keep \nme \n&gt; &gt; from her and I feel like a horrible daughter...not getting to see \n&gt; her \n&gt; &gt; before she passed. I finally got her address and phone number in \na \n&gt; &gt; christmas card she sent me and I was able to call her for like 10 \n&gt; &gt; mins before she had to go eat...and when I tried calling back \nthat \n&gt; &gt; night and several times after I only got her machine. I wanted to \n&gt; go \n&gt; &gt; see her but didnt have a way to get all the way to where she \n&gt; &gt; was...not even the public buses run to\n&gt; &gt; &gt; where the nursing home was.\n&gt; &gt; &gt; \n&gt; &gt; &gt; Ive tried doing some EVPs to see if there was a chance of \n&gt; &gt; contacting her...I know ya dont usully get what ur looking \n&gt; for...but \n&gt; &gt; Ive gotten nothing at all. So Im wondering....is there anyone who \n&gt; &gt; has done a skype session for this type of situation and gotten \nany \n&gt; &gt; success? And would you be willing to do a skype session with me?\n&gt; (Tho \n&gt; &gt; I have no idea how that would even work, Id be willing to \n&gt; try...heck \n&gt; &gt; just to be able to listen to a session would be awesome) \n&gt; &gt; &gt; \n&gt; &gt; &gt; Thanks,\n&gt; &gt; &gt; Rhonda\n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; ---------------------------------\n&gt; &gt; &gt; Be a better friend, newshound, and know-it-all with Yahoo! \n&gt; Mobile. \n&gt; &gt; Try it now.\n&gt; &gt; &gt;\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt;                          \n&gt; &gt; \n&gt; &gt;        \n&gt; &gt; ---------------------------------\n&gt; &gt; Be a better friend, newshound, and know-it-all with Yahoo! \nMobile.  \n&gt; Try it now.\n&gt; &gt;\n&gt;"}