{"id": "7955", "subject": "Re: Schematic", "author": "purplespacefriend", "timestamp": "2008-03-18T15:52:55Z", "full_text": "So far--no work with the RNG, no ghost voices, and nothing that even \nresembles speech. I have a Bill chip, and even that isn&#39;t doing \nanything, but could be my set-up. I think what I want to try is load \nan EEPROM by hand wiht the numbers for  various allophones, then use \nthe RNG to access the memory, and send it to the Speakjet. So far \nthough, nothing beats a box, in whatever form it&#39;s in. \n\n Frank-S\n\n--- In EVP-ITC@yahoogroups.com, Rob Fitzgerald &lt;dead.science@...&gt; \nwrote:\n&gt;\n&gt; Thats the way to go, I am doing the same thing but instead of an \nRNG I am going to convert the analog signal from an emf meter to a \ndigital value and then have that summed to a random number generator \nthat will select from a table of the allophones.\n&gt; I am using a pic developer kit as it has been way to many years \nsince I wrote this kind of code.\n&gt; Rob\n&gt; \n&gt; \n&gt; \n&gt; ----- Original Message ----\n&gt; From: Frank Sumption &lt;purplealiengirl@...&gt;\n&gt; To: Group &lt;evp-itc@yahoogroups.com&gt;\n&gt; Sent: Friday, March 14, 2008 11:53:13 AM\n&gt; Subject: [EVP-ITC] Re: Schematic\n&gt; \n&gt;  The code Bill sent was something he found on the web. I take it \nform Stefan that there&#39;s a PC based software that you can just put \nthe words in, or the allophones. \n&gt;  \n&gt;  What I want to do now is get a PIC, program it with the allophones \nonly, then use the RNG to to access the memory randomly,a nd supply \nthat to the Speakjet. \n&gt;  \n&gt;  Frank-S\n&gt;  \n&gt;  \n&gt; &quot;3a. Re: Schematic\n&gt; Posted by: &quot;w9sz@prairienet. org&quot; w9sz@prairienet. org w9sz\n&gt; Date: Thu Mar 13, 2008 10:53 am ((PDT))\n&gt; \n&gt; Did he supply the code for the PIC?\n&gt; \n&gt; Zack&quot;\n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Shed those extra pounds with MSN and The Biggest Loser! Learn more. \n&gt;  \n&gt; \n&gt; \n&gt;       \n______________________________________________________________________\n______________\n&gt; Never miss a thing.  Make Yahoo your home page. \n&gt; http://www.yahoo.com/r/hs\n&gt;"}