{"id": "7963", "subject": "Re: [EVP-ITC] Re: Some RS voices", "author": "Wiliam Clarke", "timestamp": "2008-03-18T18:22:41Z", "full_text": "--0-306205334-1205864561=:68746\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nI heard that.  Do what you want.  Life to short, play hard, and have fun.  Do what make you happy!\n   \n  Rees\n\npurplespacefriend &lt;purplealiengirl@...&gt; wrote:\n          I&#39;d have to know why one person is more qualified than anyone else. \nas there are some here that have been waiting a very long time. I \nwould also have to know who it is that is talking. I think we are \ncapable of creating these voices, conciously, or unconciously.\n\nThese boxes are all made by hand, and are exceedingly tedious to \nmake. I get a bit burned out giving these things to people who want \nto parade the damn things all over the country, instead of just using \nit. It really torques my jaws to have some bozo proclaiming himslef a \ngreat medium while he&#39;s standing on my head!\n\nThere&#39;s too many other methods and systems out there that work, \nsometimes as well, sometimes better, than the so called box. That&#39;s \nwhy I don&#39;t feel obligated to drop everything, and spend every waking \nmoment building boxes to give away. While, I might add, not having \ntime to solve any of the problems with the stupid things.\n\nAnd yeah, I hear the Steve voices too, and am unable to bend it \naround in my mind to say anything else, and I have tried! That \ndoesn&#39;t mean it&#39;s God talking, and it&#39;s certainly not one of the \nsisters. That also doesn&#39;t mean I completely rule out the possiblity!\n\nAs I say, allow the force(spirit)to provide the answer.\n\nFrank-S\n\n\n\n                           \n\n       \n---------------------------------\nLooking for last minute shopping deals?  Find them fast with Yahoo! Search.\r\n--0-306205334-1205864561=:68746\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;div&gt;I heard that.&nbsp; Do what you want.&nbsp; Life to short, play hard, and have fun.&nbsp;&nbsp;Do what make you happy!&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Rees&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;purplespacefriend &lt;purplealiengirl@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/div&gt;  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;div&gt;I&#39;d have to know why one person is more qualified than anyone else. &lt;BR&gt;as there are some here that have been waiting a very long time. I &lt;BR&gt;would also have to know who it is that is talking. I think we are &lt;BR&gt;capable of creating these voices, conciously, or unconciously.&lt;BR&gt;&lt;BR&gt;These boxes are all made by hand, and are\n exceedingly tedious to &lt;BR&gt;make. I get a bit burned out giving these things to people who want &lt;BR&gt;to parade the damn things all over the country, instead of just using &lt;BR&gt;it. It really torques my jaws to have some bozo proclaiming himslef a &lt;BR&gt;great medium while he&#39;s standing on my head!&lt;BR&gt;&lt;BR&gt;There&#39;s too many other methods and systems out there that work, &lt;BR&gt;sometimes as well, sometimes better, than the so called box. That&#39;s &lt;BR&gt;why I don&#39;t feel obligated to drop everything, and spend every waking &lt;BR&gt;moment building boxes to give away. While, I might add, not having &lt;BR&gt;time to solve any of the problems with the stupid things.&lt;BR&gt;&lt;BR&gt;And yeah, I hear the Steve voices too, and am unable to bend it &lt;BR&gt;around in my mind to say anything else, and I have tried! That &lt;BR&gt;doesn&#39;t mean it&#39;s God talking, and it&#39;s certainly not one of the &lt;BR&gt;sisters. That also doesn&#39;t mean I completely rule out the possiblity!&lt;BR&gt;&lt;BR&gt;As I say, allow the force(spirit)&lt;WBR&gt;to provide the\n answer.&lt;BR&gt;&lt;BR&gt;Frank-S&lt;BR&gt;&lt;BR&gt;&lt;/div&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;p&gt;&#32;\n      &lt;hr size=1&gt;Looking for last minute shopping deals? &lt;a href=&quot;http://us.rd.yahoo.com/evt=51734/*http://tools.search.yahoo.com/newsearch/category.php?category=shopping&quot;&gt; \nFind them fast with Yahoo! Search.&lt;/a&gt;\r\n--0-306205334-1205864561=:68746--"}