{"id": "8007", "subject": "Re: for mike E. and other new people", "author": "Misty", "timestamp": "2008-03-19T16:14:32Z", "full_text": "I agree with some of what Bruce said. But dont go throwing out \neverything you have learned about ITC research it STILL applies no \nmatter what method you are using you are building a bridge of \ncontact. I get alot of the same voices coming thru no matter what \nmethod I use. There are many ways they can manipulate sound whether \nits using evpmaker, the boxes, water, laser, spiricom, etc.\n\nAs for it being the only live method that is not quite true either \nsome of the other methods allow you to hear some of the feedback you \nget live too (if you can hear them).\n\nThe basic rule of thumb is to remember there are no experts. Try it \nand see what works best for you and your own hearing.\n\nMisty\n\n\n--- In EVP-ITC@yahoogroups.com, bruce halliday \n&lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; \n&gt; mike,\n&gt;  \n&gt; I&#39;m sorry I was not around when you started, I guess no one took \nthe time to explain boxes and box research to you.\n&gt; Well here is a crash course!\n&gt;  \n&gt; I don&#39;t know what your experience is with evp_itc or any other form \nof spirit communication, but whatever you have learned about \ncapturing and analyzing traditional EVP, has to be thrown right out \nthe window. \n&gt; Box research is a horse of a whole different color. The basic \npremise for traditional evp capture is that the spirit or entity that \nis grounded or in visitation at a set location, will manipulate the \nambient energy available to it that surrounds the recording medium, \nbe it a digital or analog recorder. It uses this energy, usually \nthought to be EMF energy to place an asimally of a voice onto the \nrecorder. The recording is then uploaded to a computer and is gone \nover by the researcher/investigator to search for these little \nwhispered voices on the recording. This traditional way of gathering \nspirit communication serves it&#39;s purpose or at least has served it&#39;s \npurpose. \n&gt;  \n&gt; When you decided to pick up a box, everything you ever learned \nabout spirit communication ceased to apply.  Box communication in a \nnutshell, no matter what type of box you use is run on the same \npremise. The box or radio is made to sweep the dial fast enough so \nthat no stable or whole radio signal is captured. The signal is \ntherefore fragmented into small bits of sound and fragments of human \nspeech. The idea is for our spirit friends to be able to manipulate \nthe fragments of sound to form intelligible words, phrases and \nmessages that we can understand clearly.\n&gt;  \n&gt; As you know the major factor in the difference between box research \nand traditional EVP is the fact that you can and most certainly do \nhear spirit communication through a box live and in real time.\n&gt; That&#39;s what sets this apart from any other paranormal communication \nresearch in the world or even the history of paranormal research.\n&gt;  \n&gt; The research you are embarking on now will take time and patience \nto become accustomed too but eventually with experience comes \nstronger communication, a better relationship between you and your \nspirit tech/guides and a better ear for hearing and discerning spirit \ncommunication from ordinary radio noise.\n&gt;  \n&gt; this is just a quick explanation but don&#39;t worry anyone here that \nknows me can tell you there will be much more to come.\n&gt;  \n&gt; The reason I started this reply was your reference to class a EVP, \nin box research there is no such thing, you either hear it or you \ndon&#39;t.\n&gt;  \n&gt; Mike my ears and my mouth are always open so any questions, don&#39;t \nhesitate.\n&gt;  \n&gt; Bruce\n&gt; Bruce Halliday \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: f1cracker75@...: Tue, 18 Mar 2008 14:42:44 -\n0700Subject: RE: [EVP-ITC] New file uploaded to EVP-ITC\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Hi Bruce, yeah I am new to the group. 4 weeks now.  I have other \nfiles loaded, and only load what is closer to class &quot;A&quot;  EVP.  \n&gt;  \n&gt; I am using the radio shack hack 12-469.\n&gt;  \n&gt; I record usually in the morning. I work from home, and wait until \nthe kids and wife are out of the house, so I have no interruptions.\n&gt;  \n&gt; My personal interest is to make contact with my family members and \nfriends that have passed on. I have so many questions to ask them, \netc....\n&gt;  \n&gt; Tips are welcome.. I still am playing with the sound of the radio \nwhen in scan mode. Trying to get the volume just right where if i did \nhear a spirit, the sound of the radio does not drown it out.\n&gt;  \n&gt; Any advice you can give me after listening to my files, that would \nbe great!\n&gt;  \n&gt; Mike Edwards Cary NCbruce halliday &lt;paranormalinvestigating@...&gt; \nwrote:\n&gt; \n&gt; \n&gt; Hi Mike, I have just returned to this group after a short \nabsence.My name is Bruce I have exstensive experience with box \nresearch and do my own research with every type of box that is \navailable including the newest Frank&#39;s box that is out.I hear a \nfemale response saying &quot;YES&quot; at the very end of the file. What box \nare you using? if you can Mike keep your questions as short and to \nthe point as possible, the longer your speaking the more chance of \nstepping on a message or answer.Plus the shorter and more direct the \nquestion the easier it will be for them to answer in a reasonable \nammount of time. If you don&#39;t mind me asking, how long are you \ninvolved in box research? I do not remember you the last time I \nparticipated here. If you have any questions or I can help you with \nanything just let me know. Bruce\n&gt; Bruce Halliday \n&gt; \n&gt; \n&gt; From: EVP-ITC@...: EVP-ITC@...: Tue, 18 Mar 2008 18:37:24 \n+0000Subject: [EVP-ITC] New file uploaded to EVP-ITC\n&gt; \n&gt; \n&gt; Hello,This email message is a notification to let you know thata \nfile has been uploaded to the Files area of the EVP-ITC \ngroup.File : /Mike Edwards Files/Question to Shay Clark and a voice \nsaid yes.wav Uploaded by : f1cracker75 &lt;f1cracker75@...&gt; \nDescription : I asked a deceased friend named Shay Clark if he could \nhelp me get in touch with my father who died in 1987. I believe I \nreceived a yes. Please advise if any of you hear different. The yes \nis near the end You can access this file at the \nURL:http://groups.yahoo.com/group/EVP-ITC/files/Mike%20Edwards%\n20Files/Question%20to%20Shay%20Clark%20and%20a%20voice%20said%\n20yes.wav To learn more about file sharing for your group, please \nvisit:http://help.yahoo.com/l/us/yahoo/groups/original/members/web/ind\nex.htmlfilesRegards,f1cracker75 &lt;f1cracker75@...&gt;\n&gt; \n&gt; Connect and share in new ways with Windows Live. Get it now! \n&gt; \n&gt; \n&gt; \n&gt; Looking for last minute shopping deals? Find them fast with Yahoo! \nSearch. \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Climb to the top of the charts!Play the word scramble challenge \nwith star power.\n&gt; http://club.live.com/star_shuffle.aspx?\nicid=starshuffle_wlmailtextlink_jan\n&gt;"}