{"id": "8009", "subject": "RE: [EVP-ITC] Re: for mike E. and other new people", "author": "bruce halliday", "timestamp": "2008-03-19T16:40:22Z", "full_text": "--_a685df98-9e6f-4c41-bf82-244826da1306_\r\nContent-Type: text/plain; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n\nMisty,\n \nYou are right to a certain extent, I have found in my experience\n=\r\nthat traditional evp does not lend itself to astral communication.\n \nIt is =\r\nmore for field investigation and capturing grounded spirits.\nPersonally I f=\r\neel that each individual is comfortable with their own\nstyle of spirit comm=\r\nunication.  For the new people, The information\nI give about box research a=\r\nnd para research in general comes from personal \nof experience.\n \nBruce\nBru=\r\nce Halliday \n\n\nTo: EVP-ITC@yahoogroups.comFrom: bulletbabea@...: =\r\nWed, 19 Mar 2008 16:14:32 +0000Subject: [EVP-ITC] Re: for mike E. and other=\r\n new people\n\n\n\n\nI agree with some of what Bruce said. But dont go throwing =\r\nout everything you have learned about ITC research it STILL applies no matt=\r\ner what method you are using you are building a bridge of contact. I get al=\r\not of the same voices coming thru no matter what method I use. There are ma=\r\nny ways they can manipulate sound whether its using evpmaker, the boxes, wa=\r\nter, laser, spiricom, etc.As for it being the only live method that is not =\r\nquite true either some of the other methods allow you to hear some of the f=\r\needback you get live too (if you can hear them).The basic rule of thumb is =\r\nto remember there are no experts. Try it and see what works best for you an=\r\nd your own hearing.Misty--- In EVP-ITC@yahoogroups.com, bruce halliday &lt;par=\r\nanormalinvestigating@...&gt; wrote:&gt;&gt; &gt; mike,&gt; &gt; I&#39;m sorry I was not around wh=\r\nen you started, I guess no one took the time to explain boxes and box resea=\r\nrch to you.&gt; Well here is a crash course!&gt; &gt; I don&#39;t know what your experie=\r\nnce is with evp_itc or any other form of spirit communication, but whatever=\r\n you have learned about capturing and analyzing traditional EVP, has to be =\r\nthrown right out the window. &gt; Box research is a horse of a whole different=\r\n color. The basic premise for traditional evp capture is that the spirit or=\r\n entity that is grounded or in visitation at a set location, will manipulat=\r\ne the ambient energy available to it that surrounds the recording medium, b=\r\ne it a digital or analog recorder. It uses this energy, usually thought to =\r\nbe EMF energy to place an asimally of a voice onto the recorder. The record=\r\ning is then uploaded to a computer and is gone over by the researcher/inves=\r\ntigator to search for these little whispered voices on the recording. This =\r\ntraditional way of gathering spirit communication serves it&#39;s purpose or at=\r\n least has served it&#39;s purpose. &gt; &gt; When you decided to pick up a box, ever=\r\nything you ever learned about spirit communication ceased to apply. Box com=\r\nmunication in a nutshell, no matter what type of box you use is run on the =\r\nsame premise. The box or radio is made to sweep the dial fast enough so tha=\r\nt no stable or whole radio signal is captured. The signal is therefore frag=\r\nmented into small bits of sound and fragments of human speech. The idea is =\r\nfor our spirit friends to be able to manipulate the fragments of sound to f=\r\norm intelligible words, phrases and messages that we can understand clearly=\r\n.&gt; &gt; As you know the major factor in the difference between box research an=\r\nd traditional EVP is the fact that you can and most certainly do hear spiri=\r\nt communication through a box live and in real time.&gt; That&#39;s what sets this=\r\n apart from any other paranormal communication research in the world or eve=\r\nn the history of paranormal research.&gt; &gt; The research you are embarking on =\r\nnow will take time and patience to become accustomed too but eventually wit=\r\nh experience comes stronger communication, a better relationship between yo=\r\nu and your spirit tech/guides and a better ear for hearing and discerning s=\r\npirit communication from ordinary radio noise.&gt; &gt; this is just a quick expl=\r\nanation but don&#39;t worry anyone here that knows me can tell you there will b=\r\ne much more to come.&gt; &gt; The reason I started this reply was your reference =\r\nto class a EVP, in box research there is no such thing, you either hear it =\r\nor you don&#39;t.&gt; &gt; Mike my ears and my mouth are always open so any questions=\r\n, don&#39;t hesitate.&gt; &gt; Bruce&gt; Bruce Halliday &gt; &gt; &gt; To: EVP-ITC@...: f1cracker=\r\n75@...: Tue, 18 Mar 2008 14:42:44 -0700Subject: RE: [EVP-ITC] New file uplo=\r\naded to EVP-ITC&gt; &gt; &gt; &gt; &gt; &gt; Hi Bruce, yeah I am new to the group. 4 weeks no=\r\nw. I have other files loaded, and only load what is closer to class &quot;A&quot; EVP=\r\n. &gt; &gt; I am using the radio shack hack 12-469.&gt; &gt; I record usually in the mo=\r\nrning. I work from home, and wait until the kids and wife are out of the ho=\r\nuse, so I have no interruptions.&gt; &gt; My personal interest is to make contact=\r\n with my family members and friends that have passed on. I have so many que=\r\nstions to ask them, etc....&gt; &gt; Tips are welcome.. I still am playing with t=\r\nhe sound of the radio when in scan mode. Trying to get the volume just righ=\r\nt where if i did hear a spirit, the sound of the radio does not drown it ou=\r\nt.&gt; &gt; Any advice you can give me after listening to my files, that would be=\r\n great!&gt; &gt; Mike Edwards Cary NCbruce halliday &lt;paranormalinvestigating@...&gt;=\r\n wrote:&gt; &gt; &gt; Hi Mike, I have just returned to this group after a short abse=\r\nnce.My name is Bruce I have exstensive experience with box research and do =\r\nmy own research with every type of box that is available including the newe=\r\nst Frank&#39;s box that is out.I hear a female response saying &quot;YES&quot; at the ver=\r\ny end of the file. What box are you using? if you can Mike keep your questi=\r\nons as short and to the point as possible, the longer your speaking the mor=\r\ne chance of stepping on a message or answer.Plus the shorter and more direc=\r\nt the question the easier it will be for them to answer in a reasonable amm=\r\nount of time. If you don&#39;t mind me asking, how long are you involved in box=\r\n research? I do not remember you the last time I participated here. If you =\r\nhave any questions or I can help you with anything just let me know. Bruce&gt;=\r\n Bruce Halliday &gt; &gt; &gt; From: EVP-ITC@...: EVP-ITC@...: Tue, 18 Mar 2008 18:3=\r\n7:24 +0000Subject: [EVP-ITC] New file uploaded to EVP-ITC&gt; &gt; &gt; Hello,This e=\r\nmail message is a notification to let you know thata file has been uploaded=\r\n to the Files area of the EVP-ITC group.File : /Mike Edwards Files/Question=\r\n to Shay Clark and a voice said yes.wav Uploaded by : f1cracker75 &lt;f1cracke=\r\nr75@...&gt; Description : I asked a deceased friend named Shay Clark if he cou=\r\nld help me get in touch with my father who died in 1987. I believe I receiv=\r\ned a yes. Please advise if any of you hear different. The yes is near the e=\r\nnd You can access this file at the URL:http://groups.yahoo.com/group/EVP-IT=\r\nC/files/Mike%20Edwards%20Files/Question%20to%20Shay%20Clark%20and%20a%20voi=\r\nce%20said%20yes.wav To learn more about file sharing for your group, please=\r\n visit:http://help.yahoo.com/l/us/yahoo/groups/original/members/web/index.h=\r\ntmlfilesRegards,f1cracker75 &lt;f1cracker75@...&gt;&gt; &gt; Connect and share in new w=\r\nays with Windows Live. Get it now! &gt; &gt; &gt; &gt; Looking for last minute shopping=\r\n deals? Find them fast with Yahoo! Search. &gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; ________________=\r\n__________________________________________&gt; Climb to the top of the charts!=\r\n Play the word scramble challenge with star power.&gt; http://club.live.com/st=\r\nar_shuffle.aspx?icid=3Dstarshuffle_wlmailtextlink_jan&gt; \n\n\n\n\n\n\n_____________=\r\n____________________________________________________\nNeed to know the score=\r\n, the latest news, or you need your Hotmail=AE-get your &quot;fix&quot;.\nhttp://www.m=\r\nsnmobilefix.com/Default.aspx\r\n--_a685df98-9e6f-4c41-bf82-244826da1306_\r\nContent-Type: text/html; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;\n&lt;head&gt;\n&lt;style&gt;\n.hmmessage P\n{\nmargin:0px;\npadding:0px\n}\nbody.hmmessa=\r\nge\n{\nFONT-SIZE: 10pt;\nFONT-FAMILY:Tahoma\n}\n&lt;/style&gt;\n&lt;/head&gt;\n&lt;body class=3D&#39;=\r\nhmmessage&#39;&gt;\nMisty,&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nYou are right to a certain extent, I have=\r\n found in my experience&lt;BR&gt;\nthat traditional evp does not lend itself to as=\r\ntral communication.&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nIt is more for field investigation and c=\r\napturing grounded spirits.&lt;BR&gt;\nPersonally I feel that each individual is co=\r\nmfortable with their own&lt;BR&gt;\nstyle of spirit communication.&nbsp; For the n=\r\new people, The information&lt;BR&gt;\nI give about box research and para research =\r\nin general comes from personal&nbsp;&lt;BR&gt;\nof experience.&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nBruc=\r\ne&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;P align=3Dcenter&gt;&lt;FONT size=3D4&gt;&lt;FONT color=3D#0033cc&gt;&lt;STRON=\r\nG&gt;&lt;EM&gt;&lt;FONT color=3D#000000 size=3D5&gt;Bruce Halliday &lt;BR&gt;&lt;/FONT&gt;&lt;/EM&gt;&lt;/STRON=\r\nG&gt;&lt;BR&gt;&lt;A href=3D&quot;http://free-paranormalinvestigating.com/%3C/div%3E%3C/div%=\r\n3E%3Cp%20/%3E%3Cdiv%20class=3D&quot; target=3D_blank&gt;&lt;/P&gt;&lt;/A&gt;&lt;/FONT&gt;&lt;/FONT&gt;&lt;BR&gt;&lt;=\r\nBR&gt;\n&lt;BLOCKQUOTE&gt;\n&lt;HR&gt;\nTo: EVP-ITC@yahoogroups.com&lt;BR&gt;From: bulletbabea@yaho=\r\no.com&lt;BR&gt;Date: Wed, 19 Mar 2008 16:14:32 +0000&lt;BR&gt;Subject: [EVP-ITC] Re: fo=\r\nr mike E. and other new people&lt;BR&gt;&lt;BR&gt;\n&lt;META content=3D&quot;Microsoft SafeHTML&quot;=\r\n name=3DGenerator&gt;\n&lt;DIV id=3DEC_ygrp-mlmsg style=3D&quot;WIDTH: 655px&quot;&gt;\n&lt;DIV id=\r\n=3DEC_ygrp-msg style=3D&quot;PADDING-RIGHT: 25px; PADDING-LEFT: 0px; Z-INDEX: 1;=\r\n FLOAT: left; PADDING-BOTTOM: 0px; WIDTH: 470px; PADDING-TOP: 0px&quot;&gt;\n&lt;DIV id=\r\n=3DEC_ygrp-text&gt;\nI agree with some of what Bruce said. But dont go throwing=\r\n out &lt;BR&gt;everything you have learned about ITC research it STILL applies no=\r\n &lt;BR&gt;matter what method you are using you are building a bridge of &lt;BR&gt;cont=\r\nact. I get alot of the same voices coming thru no matter what &lt;BR&gt;method I =\r\nuse. There are many ways they can manipulate sound whether &lt;BR&gt;its using ev=\r\npmaker, the boxes, water, laser, spiricom, etc.&lt;BR&gt;&lt;BR&gt;As for it being the =\r\nonly live method that is not quite true either &lt;BR&gt;some of the other method=\r\ns allow you to hear some of the feedback you &lt;BR&gt;get live too (if you can h=\r\near them).&lt;BR&gt;&lt;BR&gt;The basic rule of thumb is to remember there are no exper=\r\nts. Try it &lt;BR&gt;and see what works best for you and your own hearing.&lt;BR&gt;&lt;BR=\r\n&gt;Misty&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=3D&quot;mailto:EVP-ITC@yahoogroups.com&quot;&gt;EVP-ITC@yah=\r\noogroups&lt;WBR&gt;.com&lt;/A&gt;, bruce halliday &lt;BR&gt;&lt;paranormalinvestig&lt;WBR&gt;ating@=\r\n...&lt;WBR&gt;&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; &lt;BR&gt;&gt; mike,&lt;BR&gt;&gt; &lt;BR&gt;&gt; I&#39;m sor=\r\nry I was not around when you started, I guess no one took &lt;BR&gt;the time to e=\r\nxplain boxes and box research to you.&lt;BR&gt;&gt; Well here is a crash course!&lt;=\r\nBR&gt;&gt; &lt;BR&gt;&gt; I don&#39;t know what your experience is with evp_itc or any o=\r\nther form &lt;BR&gt;of spirit communication, but whatever you have learned about =\r\n&lt;BR&gt;capturing and analyzing traditional EVP, has to be thrown right out &lt;BR=\r\n&gt;the window. &lt;BR&gt;&gt; Box research is a horse of a whole different color. T=\r\nhe basic &lt;BR&gt;premise for traditional evp capture is that the spirit or enti=\r\nty that &lt;BR&gt;is grounded or in visitation at a set location, will manipulate=\r\n the &lt;BR&gt;ambient energy available to it that surrounds the recording medium=\r\n, &lt;BR&gt;be it a digital or analog recorder. It uses this energy, usually &lt;BR&gt;=\r\nthought to be EMF energy to place an asimally of a voice onto the &lt;BR&gt;recor=\r\nder. The recording is then uploaded to a computer and is gone &lt;BR&gt;over by t=\r\nhe researcher/investig&lt;WBR&gt;ator to search for these little &lt;BR&gt;whispered vo=\r\nices on the recording. This traditional way of gathering &lt;BR&gt;spirit communi=\r\ncation serves it&#39;s purpose or at least has served it&#39;s &lt;BR&gt;purpose. &lt;BR&gt;&gt=\r\n; &lt;BR&gt;&gt; When you decided to pick up a box, everything you ever learned &lt;=\r\nBR&gt;about spirit communication ceased to apply. Box communication in a &lt;BR&gt;n=\r\nutshell, no matter what type of box you use is run on the same &lt;BR&gt;premise.=\r\n The box or radio is made to sweep the dial fast enough so &lt;BR&gt;that no stab=\r\nle or whole radio signal is captured. The signal is &lt;BR&gt;therefore fragmente=\r\nd into small bits of sound and fragments of human &lt;BR&gt;speech. The idea is f=\r\nor our spirit friends to be able to manipulate &lt;BR&gt;the fragments of sound t=\r\no form intelligible words, phrases and &lt;BR&gt;messages that we can understand =\r\nclearly.&lt;BR&gt;&gt; &lt;BR&gt;&gt; As you know the major factor in the difference be=\r\ntween box research &lt;BR&gt;and traditional EVP is the fact that you can and mos=\r\nt certainly do &lt;BR&gt;hear spirit communication through a box live and in real=\r\n time.&lt;BR&gt;&gt; That&#39;s what sets this apart from any other paranormal commun=\r\nication &lt;BR&gt;research in the world or even the history of paranormal researc=\r\nh.&lt;BR&gt;&gt; &lt;BR&gt;&gt; The research you are embarking on now will take time an=\r\nd patience &lt;BR&gt;to become accustomed too but eventually with experience come=\r\ns &lt;BR&gt;stronger communication, a better relationship between you and your &lt;B=\r\nR&gt;spirit tech/guides and a better ear for hearing and discerning spirit &lt;BR=\r\n&gt;communication from ordinary radio noise.&lt;BR&gt;&gt; &lt;BR&gt;&gt; this is just a q=\r\nuick explanation but don&#39;t worry anyone here that &lt;BR&gt;knows me can tell you=\r\n there will be much more to come.&lt;BR&gt;&gt; &lt;BR&gt;&gt; The reason I started thi=\r\ns reply was your reference to class a EVP, &lt;BR&gt;in box research there is no =\r\nsuch thing, you either hear it or you &lt;BR&gt;don&#39;t.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Mike my e=\r\nars and my mouth are always open so any questions, don&#39;t &lt;BR&gt;hesitate.&lt;BR&gt;&=\r\ngt; &lt;BR&gt;&gt; Bruce&lt;BR&gt;&gt; Bruce Halliday &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; To: EV=\r\nP-ITC@...: f1cracker75@&lt;WBR&gt;...: Tue, 18 Mar 2008 14:42:44 -&lt;BR&gt;0700Subject=\r\n: RE: [EVP-ITC] New file uploaded to EVP-ITC&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;=\r\n&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; Hi Bruce, yeah I am new to the group. 4 weeks now. I=\r\n have other &lt;BR&gt;files loaded, and only load what is closer to class &quot;A&quot; EVP=\r\n. &lt;BR&gt;&gt; &lt;BR&gt;&gt; I am using the radio shack hack 12-469.&lt;BR&gt;&gt; &lt;BR&gt;&gt=\r\n; I record usually in the morning. I work from home, and wait until &lt;BR&gt;the=\r\n kids and wife are out of the house, so I have no interruptions.&lt;BR&gt;&gt; &lt;B=\r\nR&gt;&gt; My personal interest is to make contact with my family members and &lt;=\r\nBR&gt;friends that have passed on. I have so many questions to ask them, &lt;BR&gt;e=\r\ntc....&lt;BR&gt;&gt; &lt;BR&gt;&gt; Tips are welcome.. I still am playing with the soun=\r\nd of the radio &lt;BR&gt;when in scan mode. Trying to get the volume just right w=\r\nhere if i did &lt;BR&gt;hear a spirit, the sound of the radio does not drown it o=\r\nut.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Any advice you can give me after listening to my files=\r\n, that would &lt;BR&gt;be great!&lt;BR&gt;&gt; &lt;BR&gt;&gt; Mike Edwards Cary NCbruce halli=\r\nday &lt;paranormalinvestig&lt;WBR&gt;ating@...&lt;WBR&gt;&gt; &lt;BR&gt;wrote:&lt;BR&gt;&gt; &lt;BR&gt;&g=\r\nt; &lt;BR&gt;&gt; Hi Mike, I have just returned to this group after a short &lt;BR&gt;a=\r\nbsence.My name is Bruce I have exstensive experience with box &lt;BR&gt;research =\r\nand do my own research with every type of box that is &lt;BR&gt;available includi=\r\nng the newest Frank&#39;s box that is out.I hear a &lt;BR&gt;female response saying &quot;=\r\nYES&quot; at the very end of the file. What box &lt;BR&gt;are you using? if you can Mi=\r\nke keep your questions as short and to &lt;BR&gt;the point as possible, the longe=\r\nr your speaking the more chance of &lt;BR&gt;stepping on a message or answer.Plus=\r\n the shorter and more direct the &lt;BR&gt;question the easier it will be for the=\r\nm to answer in a reasonable &lt;BR&gt;ammount of time. If you don&#39;t mind me askin=\r\ng, how long are you &lt;BR&gt;involved in box research? I do not remember you the=\r\n last time I &lt;BR&gt;participated here. If you have any questions or I can help=\r\n you with &lt;BR&gt;anything just let me know. Bruce&lt;BR&gt;&gt; Bruce Halliday &lt;BR&gt;&=\r\ngt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; From: EVP-ITC@...: EVP-ITC@...: Tue, 18 Mar 2008 18:3=\r\n7:24 &lt;BR&gt;+0000Subject: [EVP-ITC] New file uploaded to EVP-ITC&lt;BR&gt;&gt; &lt;BR&gt;&=\r\ngt; &lt;BR&gt;&gt; Hello,This email message is a notification to let you know tha=\r\nta &lt;BR&gt;file has been uploaded to the Files area of the EVP-ITC &lt;BR&gt;group.Fi=\r\nle : /Mike Edwards Files/Question to Shay Clark and a voice &lt;BR&gt;said yes.wa=\r\nv Uploaded by : f1cracker75 &lt;f1cracker75@&lt;WBR&gt;...&gt; &lt;BR&gt;Description : =\r\nI asked a deceased friend named Shay Clark if he could &lt;BR&gt;help me get in t=\r\nouch with my father who died in 1987. I believe I &lt;BR&gt;received a yes. Pleas=\r\ne advise if any of you hear different. The yes &lt;BR&gt;is near the end You can =\r\naccess this file at the &lt;BR&gt;URL:&lt;A href=3D&quot;http://groups.yahoo.com/group/EV=\r\nP-ITC/files/Mike Edwards%&quot; target=3D_blank&gt;http://groups.&lt;WBR&gt;yahoo.com/&lt;WB=\r\nR&gt;group/EVP-&lt;WBR&gt;ITC/files/&lt;WBR&gt;Mike%20Edwards%&lt;/A&gt;&lt;BR&gt;20Files/Question%&lt;WB=\r\nR&gt;20to%20Shay%&lt;WBR&gt;20Clark%20and%&lt;WBR&gt;20a%20voice%&lt;WBR&gt;20said%&lt;BR&gt;20yes.wav=\r\n To learn more about file sharing for your group, please &lt;BR&gt;visit:&lt;A href=\r\n=3D&quot;http://help.yahoo.com/l/us/yahoo/groups/original/members/web/ind&quot; targe=\r\nt=3D_blank&gt;http://help.&lt;WBR&gt;yahoo.com/&lt;WBR&gt;l/us/yahoo/&lt;WBR&gt;groups/original/=\r\n&lt;WBR&gt;members/web/&lt;WBR&gt;ind&lt;/A&gt;&lt;BR&gt;ex.htmlfilesRegards&lt;WBR&gt;,f1cracker75 &lt;f=\r\n1cracker75@&lt;WBR&gt;...&gt;&lt;BR&gt;&gt; &lt;BR&gt;&gt; Connect and share in new ways with=\r\n Windows Live. Get it now! &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; Looking for =\r\nlast minute shopping deals? Find them fast with Yahoo! &lt;BR&gt;Search. &lt;BR&gt;&gt;=\r\n &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; ___________=\r\n_&lt;WBR&gt;_________&lt;WBR&gt;_________&lt;WBR&gt;_________&lt;WBR&gt;_________&lt;WBR&gt;_________&lt;WBR=\r\n&gt;_&lt;BR&gt;&gt; Climb to the top of the charts!&nbsp;Play the word scramble chal=\r\nlenge &lt;BR&gt;with star power.&lt;BR&gt;&gt; &lt;A href=3D&quot;http://club.live.com/star_shu=\r\nffle.aspx?&quot; target=3D_blank&gt;http://club.&lt;WBR&gt;live.com/&lt;WBR&gt;star_shuffle.&lt;WB=\r\nR&gt;aspx?&lt;/A&gt;&lt;BR&gt;icid=3Dstarshuffle_&lt;WBR&gt;wlmailtextlink_&lt;WBR&gt;jan&lt;BR&gt;&gt;&lt;BR&gt;&lt;=\r\nBR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;SPAN style=3D&quot;COLOR: white&quot;&gt;&lt;/SPAN&gt; \n&lt;STYLE&gt;\n.ExternalClass #=\r\nEC_ygrp-mkp\n{border:1px solid #d8d8d8;font-family:Arial;padding:0px 14px;}\n=\r\n.ExternalClass #EC_ygrp-mkp hr\n{border:1px solid #d8d8d8;}\n.ExternalClass #=\r\nEC_ygrp-mkp #EC_hd\n{color:#628c2a;font-size:85%;font-weight:bold;line-heigh=\r\nt:122%;}\n.ExternalClass #EC_ygrp-mkp #EC_ads\n{margin-bottom:10px;}\n.Externa=\r\nlClass #EC_ygrp-mkp .EC_ad\n{padding:0 0;}\n.ExternalClass #EC_ygrp-mkp .EC_a=\r\nd a\n{color:#0000ff;text-decoration:none;}\n\n&lt;/STYLE&gt;\n\n&lt;STYLE&gt;\n.ExternalClass=\r\n #EC_ygrp-sponsor #EC_ygrp-lc\n{font-family:Arial;}\n.ExternalClass #EC_ygrp-=\r\nsponsor #EC_ygrp-lc #EC_hd\n{font-weight:bold;font-size:78%;line-height:122%=\r\n;}\n.ExternalClass #EC_ygrp-sponsor #EC_ygrp-lc .EC_ad\n{margin-bottom:10px;p=\r\nadding:0 0;}\n\n&lt;/STYLE&gt;\n\n&lt;STYLE&gt;\n.ExternalClass #EC_ygrp-mlmsg\n{font-size:13=\r\npx;font-family:arial,helvetica,clean,sans-serif;}\n.ExternalClass #EC_ygrp-m=\r\nlmsg table\n{font-size:inherit;font:100%;}\n.ExternalClass #EC_ygrp-mlmsg sel=\r\nect, .ExternalClass input, .ExternalClass textarea\n{font:99% arial,helvetic=\r\na,clean,sans-serif;}\n.ExternalClass #EC_ygrp-mlmsg pre, .ExternalClass code=\r\n\n{font:115% monospace;}\n.ExternalClass #EC_ygrp-mlmsg EC_*\n{line-height:1.2=\r\n2em;}\n.ExternalClass #EC_ygrp-text\n{font-family:Georgia;}\n.ExternalClass #E=\r\nC_ygrp-text p\n{;}\n.ExternalClass #EC_ygrp-tpmsgs\n{font-family:Arial;clear:b=\r\noth;}\n.ExternalClass #EC_ygrp-vitnav\n{padding-top:10px;font-family:Verdana;=\r\nfont-size:77%;}\n.ExternalClass #EC_ygrp-vitnav a\n{padding:0 1px;}\n.External=\r\nClass #EC_ygrp-actbar\n{clear:both;white-space:nowrap;color:#666;text-align:=\r\nright;}\n.ExternalClass #EC_ygrp-actbar .EC_left\n{float:left;white-space:now=\r\nrap;}\n.ExternalClass .EC_bld\n{font-weight:bold;}\n.ExternalClass #EC_ygrp-gr=\r\nft\n{font-family:Verdana;font-size:77%;padding:15px 0;}\n.ExternalClass #EC_y=\r\ngrp-ft\n{font-family:verdana;font-size:77%;border-top:1px solid #666;padding=\r\n:5px 0;}\n.ExternalClass #EC_ygrp-mlmsg #EC_logo\n{padding-bottom:10px;}\n.Ext=\r\nernalClass #EC_ygrp-reco\n{margin-bottom:20px;padding:0px;}\n.ExternalClass #=\r\nEC_ygrp-reco #EC_reco-head\n{font-weight:bold;color:#ff7900;}\n.ExternalClass=\r\n #EC_reco-grpname\n{font-weight:bold;}\n.ExternalClass #EC_reco-category\n{fon=\r\nt-size:77%;}\n.ExternalClass #EC_reco-desc\n{font-size:77%;}\n.ExternalClass #=\r\nEC_ygrp-vital\n{background-color:#e0ecee;margin-bottom:20px;padding:2px 0 8p=\r\nx 8px;}\n.ExternalClass #EC_ygrp-vital #EC_vithd\n{font-size:77%;font-family:=\r\nVerdana;font-weight:bold;color:#333;text-transform:uppercase;}\n.ExternalCla=\r\nss #EC_ygrp-vital ul\n{padding:0;}\n.ExternalClass #EC_ygrp-vital ul li\n{list=\r\n-style-type:none;clear:both;border:1px solid #e0ecee;}\n.ExternalClass #EC_y=\r\ngrp-vital ul li .EC_ct\n{font-weight:bold;color:#ff7900;float:right;width:2e=\r\nm;text-align:right;padding-right:.5em;}\n.ExternalClass #EC_ygrp-vital ul li=\r\n .EC_cat\n{font-weight:bold;}\n.ExternalClass #EC_ygrp-vital a\n{text-decorati=\r\non:none;}\n.ExternalClass #EC_ygrp-vital a:hover\n{text-decoration:underline;=\r\n}\n.ExternalClass #EC_ygrp-sponsor #EC_hd\n{color:#999;font-size:77%;}\n.Exter=\r\nnalClass #EC_ygrp-sponsor #EC_ov\n{padding:6px 13px;background-color:#e0ecee=\r\n;margin-bottom:20px;}\n.ExternalClass #EC_ygrp-sponsor #EC_ov ul\n{padding:0 =\r\n0 0 8px;}\n.ExternalClass #EC_ygrp-sponsor #EC_ov li\n{list-style-type:square=\r\n;padding:6px 0;font-size:77%;}\n.ExternalClass #EC_ygrp-sponsor #EC_ov li a\n=\r\n{text-decoration:none;font-size:130%;}\n.ExternalClass #EC_ygrp-sponsor #EC_=\r\nnc\n{background-color:#eee;margin-bottom:20px;padding:0 8px;}\n.ExternalClass=\r\n #EC_ygrp-sponsor .EC_ad\n{padding:8px 0;}\n.ExternalClass #EC_ygrp-sponsor .=\r\nEC_ad #EC_hd1\n{font-family:Arial;font-weight:bold;color:#628c2a;font-size:1=\r\n00%;line-height:122%;}\n.ExternalClass #EC_ygrp-sponsor .EC_ad a\n{text-decor=\r\nation:none;}\n.ExternalClass #EC_ygrp-sponsor .EC_ad a:hover\n{text-decoratio=\r\nn:underline;}\n.ExternalClass #EC_ygrp-sponsor .EC_ad p\n{;}\n.ExternalClass E=\r\nC_o\n{font-size:0;}\n.ExternalClass .EC_MsoNormal\n{;}\n.ExternalClass #EC_ygrp=\r\n-text tt\n{font-size:120%;}\n.ExternalClass blockquote\n{;}\n.ExternalClass .EC=\r\n_replbq\n{;}\n\n&lt;/STYLE&gt;\n&lt;/BLOCKQUOTE&gt;&lt;br /&gt;&lt;hr /&gt;Need to know the score, the =\r\nlatest news, or you need your Hotmail=AE-get your &quot;fix&quot;. &lt;a href=3D&#39;http://=\r\nwww.msnmobilefix.com/Default.aspx&#39; target=3D&#39;_new&#39;&gt;Check it out.&lt;/a&gt;&lt;/body&gt;=\r\n\n&lt;/html&gt;\r\n--_a685df98-9e6f-4c41-bf82-244826da1306_--"}