{"id": "8011", "subject": "Re: for mike E. and other new people", "author": "Misty", "timestamp": "2008-03-19T17:01:45Z", "full_text": "Bruce \n\nPerhaps it is just that you had such difficulty using other methods. \nI remember when we were helping you using other methods evpmaker and \nthe sweep method and then you got your first box. I think over time \nwe all developed our contact field and the communication becomes \nstronger. Again method doesnt matter its the intent and the \ndedication that helps us get better communication going with the \nother side. \n\nThe boxes are an exciting tool, unfortunately not everyone can hear \nthem live, same goes for the other methods not everyone can hear what \ncomes thru. Once the connection is made and they speak freely and we \ncan hear them better, then the options are endless =)\n\nFor most when starting out theres a period of time to train the ears \nto hear them. It would be nice if we could all skip that part of the \ndrill. Either way once you start making connection and you have \ntrained your ears, your results can improve.\n\nMisty\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, bruce halliday \n&lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; \n&gt; Misty,\n&gt;  \n&gt; You are right to a certain extent, I have found in my experience\n&gt; that traditional evp does not lend itself to astral communication.\n&gt;  \n&gt; It is more for field investigation and capturing grounded spirits.\n&gt; Personally I feel that each individual is comfortable with their own\n&gt; style of spirit communication.  For the new people, The information\n&gt; I give about box research and para research in general comes from \npersonal \n&gt; of experience.\n&gt;  \n&gt; Bruce\n&gt; Bruce Halliday \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: bulletbabea@...: Wed, 19 Mar 2008 16:14:32 \n+0000Subject: [EVP-ITC] Re: for mike E. and other new people\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; I agree with some of what Bruce said. But dont go throwing out \neverything you have learned about ITC research it STILL applies no \nmatter what method you are using you are building a bridge of \ncontact. I get alot of the same voices coming thru no matter what \nmethod I use. There are many ways they can manipulate sound whether \nits using evpmaker, the boxes, water, laser, spiricom, etc.As for it \nbeing the only live method that is not quite true either some of the \nother methods allow you to hear some of the feedback you get live too \n(if you can hear them).The basic rule of thumb is to remember there \nare no experts. Try it and see what works best for you and your own \nhearing.Misty--- In EVP-ITC@yahoogroups.com, bruce halliday \n&lt;paranormalinvestigating@&gt; wrote:&gt;&gt; &gt; mike,&gt; &gt; I&#39;m sorry I was not \naround when you started, I guess no one took the time to explain \nboxes and box research to you.&gt; Well here is a crash course!&gt; &gt; I \ndon&#39;t know what your experience is with evp_itc or any other form of \nspirit communication, but whatever you have learned about capturing \nand analyzing traditional EVP, has to be thrown right out the window. \n&gt; Box research is a horse of a whole different color. The basic \npremise for traditional evp capture is that the spirit or entity that \nis grounded or in visitation at a set location, will manipulate the \nambient energy available to it that surrounds the recording medium, \nbe it a digital or analog recorder. It uses this energy, usually \nthought to be EMF energy to place an asimally of a voice onto the \nrecorder. The recording is then uploaded to a computer and is gone \nover by the researcher/investigator to search for these little \nwhispered voices on the recording. This traditional way of gathering \nspirit communication serves it&#39;s purpose or at least has served it&#39;s \npurpose. &gt; &gt; When you decided to pick up a box, everything you ever \nlearned about spirit communication ceased to apply. Box communication \nin a nutshell, no matter what type of box you use is run on the same \npremise. The box or radio is made to sweep the dial fast enough so \nthat no stable or whole radio signal is captured. The signal is \ntherefore fragmented into small bits of sound and fragments of human \nspeech. The idea is for our spirit friends to be able to manipulate \nthe fragments of sound to form intelligible words, phrases and \nmessages that we can understand clearly.&gt; &gt; As you know the major \nfactor in the difference between box research and traditional EVP is \nthe fact that you can and most certainly do hear spirit communication \nthrough a box live and in real time.&gt; That&#39;s what sets this apart \nfrom any other paranormal communication research in the world or even \nthe history of paranormal research.&gt; &gt; The research you are embarking \non now will take time and patience to become accustomed too but \neventually with experience comes stronger communication, a better \nrelationship between you and your spirit tech/guides and a better ear \nfor hearing and discerning spirit communication from ordinary radio \nnoise.&gt; &gt; this is just a quick explanation but don&#39;t worry anyone \nhere that knows me can tell you there will be much more to come.&gt; &gt; \nThe reason I started this reply was your reference to class a EVP, in \nbox research there is no such thing, you either hear it or you \ndon&#39;t.&gt; &gt; Mike my ears and my mouth are always open so any questions, \ndon&#39;t hesitate.&gt; &gt; Bruce&gt; Bruce Halliday &gt; &gt; &gt; To: EVP-ITC@: \nf1cracker75@: Tue, 18 Mar 2008 14:42:44 -0700Subject: RE: [EVP-ITC] \nNew file uploaded to EVP-ITC&gt; &gt; &gt; &gt; &gt; &gt; Hi Bruce, yeah I am new to \nthe group. 4 weeks now. I have other files loaded, and only load what \nis closer to class &quot;A&quot; EVP. &gt; &gt; I am using the radio shack hack 12-\n469.&gt; &gt; I record usually in the morning. I work from home, and wait \nuntil the kids and wife are out of the house, so I have no \ninterruptions.&gt; &gt; My personal interest is to make contact with my \nfamily members and friends that have passed on. I have so many \nquestions to ask them, etc....&gt; &gt; Tips are welcome.. I still am \nplaying with the sound of the radio when in scan mode. Trying to get \nthe volume just right where if i did hear a spirit, the sound of the \nradio does not drown it out.&gt; &gt; Any advice you can give me after \nlistening to my files, that would be great!&gt; &gt; Mike Edwards Cary \nNCbruce halliday &lt;paranormalinvestigating@&gt; wrote:&gt; &gt; &gt; Hi Mike, I \nhave just returned to this group after a short absence.My name is \nBruce I have exstensive experience with box research and do my own \nresearch with every type of box that is available including the \nnewest Frank&#39;s box that is out.I hear a female response saying &quot;YES&quot; \nat the very end of the file. What box are you using? if you can Mike \nkeep your questions as short and to the point as possible, the longer \nyour speaking the more chance of stepping on a message or answer.Plus \nthe shorter and more direct the question the easier it will be for \nthem to answer in a reasonable ammount of time. If you don&#39;t mind me \nasking, how long are you involved in box research? I do not remember \nyou the last time I participated here. If you have any questions or I \ncan help you with anything just let me know. Bruce&gt; Bruce Halliday &gt; \n&gt; &gt; From: EVP-ITC@: EVP-ITC@: Tue, 18 Mar 2008 18:37:24 +0000Subject: \n[EVP-ITC] New file uploaded to EVP-ITC&gt; &gt; &gt; Hello,This email message \nis a notification to let you know thata file has been uploaded to the \nFiles area of the EVP-ITC group.File : /Mike Edwards Files/Question \nto Shay Clark and a voice said yes.wav Uploaded by : f1cracker75 \n&lt;f1cracker75@&gt; Description : I asked a deceased friend named Shay \nClark if he could help me get in touch with my father who died in \n1987. I believe I received a yes. Please advise if any of you hear \ndifferent. The yes is near the end You can access this file at the \nURL:http://groups.yahoo.com/group/EVP-ITC/files/Mike%20Edwards%\n20Files/Question%20to%20Shay%20Clark%20and%20a%20voice%20said%\n20yes.wav To learn more about file sharing for your group, please \nvisit:http://help.yahoo.com/l/us/yahoo/groups/original/members/web/ind\nex.htmlfilesRegards,f1cracker75 &lt;f1cracker75@&gt;&gt; &gt; Connect and share \nin new ways with Windows Live. Get it now! &gt; &gt; &gt; &gt; Looking for last \nminute shopping deals? Find them fast with Yahoo! Search. &gt; &gt; &gt; &gt; &gt; &gt; \n&gt; &gt; __________________________________________________________&gt; Climb \nto the top of the charts! Play the word scramble challenge with star \npower.&gt; http://club.live.com/star_shuffle.aspx?\nicid=starshuffle_wlmailtextlink_jan&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Need to know the score, the latest news, or you need your Hotmail-\nget your &quot;fix&quot;.\n&gt; http://www.msnmobilefix.com/Default.aspx\n&gt;"}