{"id": "8021", "subject": "Re: for mike E. and other new people", "author": "bhali333", "timestamp": "2008-03-19T18:42:16Z", "full_text": "William,\n\nI believe the water method is used with traditional EVP and can not \nbe used for box communication. I believe it is when a researcher \nturns on a faucet or some other type of running water source and \nproceeds to record the way you would record any traditional evp \nsession. I think the premise is that any spirits willing or wishing \nto communicate use the white noise sound of the running water to form \nthe words they place on the recording medium.\n\nI personally have never heard any files or recordings using this \nmethod that contained any spirit communication. I have a fish tank in \nmy bedroom that is continually making the sound of running water.\nAt night when it is very quiet and I am relaxed by the sound the \nwater makes, I could swear I can hear voices within the sound of the \nwater.\n\nI do not rule out any possibility but in my experience it is most \nlikely your mind manipulating the sound and trying to make sense of \nit.\n\nBruce\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, Wiliam Clarke &lt;reesclarke_69@...&gt; \nwrote:\n&gt;\n&gt; Misty\n&gt;    \n&gt;   What is the water method?\n&gt; \n&gt; Misty Dawn &lt;bulletbabea@...&gt; wrote:\n&gt;             I find some like certain methods better to make thier \nvoice. And often they will state thier approval or disapproval for \nthe method I am experimenting with. A few do not like music method \nthey say its too much noise they cant get a word in edgewise, yet \nothers enjoy it and make use of it with ease speaking very loud over \nthe music notes. For water method nobody complains (i dont know why) \nand for sweep methods, only a few seem to have trouble using it to \nform thier words.\n&gt;    \n&gt;   Perhaps it has to do with vibrational frequencies I dont know. \nOnce the lines are open and communication is flowing it gets \ninteresting to say the least =)\n&gt;    \n&gt;   Just experiment and find whats working best for you personally.\n&gt;    \n&gt;   Misty\n&gt; \n&gt; Nellie Kampmann &lt;rednellie@...&gt; wrote:\n&gt;       This is an interesting conversation. Personally, I use my \nhack to\n&gt; communicate with a spirit who is definitely grounded. Sometimes the\n&gt; communications come through as bits of radio waves put together to\n&gt; form words or sentences, and other times, they sound more like\n&gt; traditional evps. One of the little things I&#39;m trying to figure out\n&gt; is why I could never get evps from him after a year of trying, but \nhe\n&gt; has taken to communicating through the box like a fish to water.\n&gt; \n&gt; Nellie\n&gt; \n&gt; \n&gt; \n&gt;     \n&gt; ---------------------------------\n&gt;   Be a better friend, newshound, and know-it-all with Yahoo! \nMobile. Try it now.  \n&gt; \n&gt;                            \n&gt; \n&gt;        \n&gt; ---------------------------------\n&gt; Looking for last minute shopping deals?  Find them fast with Yahoo! \nSearch.\n&gt;"}