{"id": "8085", "subject": "Re: [EVP-ITC] just a general post for the new people", "author": "Misty Dawn", "timestamp": "2008-03-21T19:38:56Z", "full_text": "--0-212355140-1206128336=:39705\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n=)\n   \n  I was never involved in the &quot;friction&quot; tho a few wished I was. But I think everyone learned its not the way to go. As I said before and I will keep on saying.. it just distracts from the work and the communication.\n   \n  I am working so much these days that I have been pretty darn tired so I have low tolerance levels =) but if I can still manage to communicate positively with others then I am pretty sure you all can too. \n   \n  It&#39;s great when you all work together and much more gets acomplished. History has shown that to be a fact. Helping each other and talking is what the forums are meant for. There are many good researchers here. I dont consider anyone here an &quot;expert&quot; tho many may have experience and insight on a certain subject. We can however share our thoughts or experiences and compare and attempt to gain some knowledge from it all. \n   \n  Misty\n  \nbhali333 &lt;paranormalinvestigating@...&gt; wrote:\n          \nHi guy&#39;s \n\nThis post is for generally all the new people that are here trying to \nlearn or are seeking information. Some know me, some don&#39;t.\n\nI have recently returned to this board with the sole intention of \nhelping all the new people I can., the way I was helped when I got \nstarted. I&#39;m sure if you are reading the posts here, you are aware that \nthere is a bit of friction here between some of us older members.\n\nthat is niether here nor there. The reason for this post is to say \nthat, I have been involved in box research for a while now and have \ndevoted many, many hours to research and helping new peolpe get started.\nI have aquired Rs 470 boxes that where not readily available and made \nthem available to new researchers that could not find or afford one.\n\nI do not want to pat myself on the back, just let all you new people \nthat my experience is notable and available to you whenever you feel \nyou ned some help or have a question.\n\nAnsd I can not stress this enough, any advice or suggestions I give are \nsolely MY OPINION based on my experience in this research.\n\nAnd remember, and this has been stressed here and everywhere all the \ntime. NONE of this is carved in stone and no one really has the true \nanswers just there opinions. And that goes for everyone! including me.\n\nHere is my private e-mail if you would like to contact me off group.\n\nparanormalinvestigating@... this is for anyone to use.\n\nI am also on SKYPE under the contact name bruce halliday If anyone \nwould like to talk in person. My door is alway&#39;s open.\n\nthanks for listening\nBruce\n\n\n\n                           \n\n       \n---------------------------------\nBe a better friend, newshound, and know-it-all with Yahoo! Mobile.  Try it now.\r\n--0-212355140-1206128336=:39705\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;div&gt;=)&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;I was never involved in the &quot;friction&quot; tho a few wished I was. But I think everyone learned its not the way to go. As I said before and I will keep on saying.. it just distracts from the work and the communication.&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;I am working so much these days that I have been pretty darn tired so I have low tolerance levels =) but if I can still manage to communicate positively with others then I am pretty sure you all can too. &lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;It&#39;s great when you all work together and much more gets acomplished. History has shown that to be a fact. Helping each other and talking is what the forums are meant for. There are many good researchers here. I dont consider anyone here an &quot;expert&quot; tho many may have experience and&nbsp;insight on a certain subject. We can however share our thoughts or experiences and compare and attempt to gain some knowledge from it all. &lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt; \n &lt;div&gt;Misty&lt;/div&gt;  &lt;div&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;bhali333 &lt;paranormalinvestigating@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/div&gt;  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;div&gt;&lt;BR&gt;Hi guy&#39;s &lt;BR&gt;&lt;BR&gt;This post is for generally all the new people that are here trying to &lt;BR&gt;learn or are seeking information. Some know me, some don&#39;t.&lt;BR&gt;&lt;BR&gt;I have recently returned to this board with the sole intention of &lt;BR&gt;helping all the new people I can., the way I was helped when I got &lt;BR&gt;started. I&#39;m sure if you are reading the posts here, you are aware that &lt;BR&gt;there is a bit of friction here between some of us older members.&lt;BR&gt;&lt;BR&gt;that is\n niether here nor there. The reason for this post is to say &lt;BR&gt;that, I have been involved in box research for a while now and have &lt;BR&gt;devoted many, many hours to research and helping new peolpe get started.&lt;BR&gt;I have aquired Rs 470 boxes that where not readily available and made &lt;BR&gt;them available to new researchers that could not find or afford one.&lt;BR&gt;&lt;BR&gt;I do not want to pat myself on the back, just let all you new people &lt;BR&gt;that my experience is notable and available to you whenever you feel &lt;BR&gt;you ned some help or have a question.&lt;BR&gt;&lt;BR&gt;Ansd I can not stress this enough, any advice or suggestions I give are &lt;BR&gt;solely MY OPINION based on my experience in this research.&lt;BR&gt;&lt;BR&gt;And remember, and this has been stressed here and everywhere all the &lt;BR&gt;time. NONE of this is carved in stone and no one really has the true &lt;BR&gt;answers just there opinions. And that goes for everyone! including me.&lt;BR&gt;&lt;BR&gt;Here is my private e-mail if you would like to contact me off\n group.&lt;BR&gt;&lt;BR&gt;&lt;A href=&quot;mailto:paranormalinvestigating%40hotmail.com&quot;&gt;paranormalinvestiga&lt;WBR&gt;ting@hotmail.&lt;WBR&gt;com&lt;/A&gt; this is for anyone to use.&lt;BR&gt;&lt;BR&gt;I am also on SKYPE under the contact name bruce halliday If anyone &lt;BR&gt;would like to talk in person. My door is alway&#39;s open.&lt;BR&gt;&lt;BR&gt;thanks for listening&lt;BR&gt;Bruce&lt;BR&gt;&lt;BR&gt;&lt;/div&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;p&gt;&#32;\n      &lt;hr size=1&gt;Be a better friend, newshound, and \nknow-it-all with Yahoo! Mobile. &lt;a href=&quot;http://us.rd.yahoo.com/evt=51733/*http://mobile.yahoo.com/;_ylt=Ahu06i62sR8HDtDypao8Wcj9tAcJ &quot;&gt; Try it now.&lt;/a&gt;\r\n--0-212355140-1206128336=:39705--"}