{"id": "8145", "subject": "Re: EVP Files &gt; Need some more advice from everyone, please", "author": "misujoey", "timestamp": "2008-03-24T15:04:04Z", "full_text": "Hi Bruce .. Are you speaking to the box and responding to &quot;real time&quot; \nanswers or do you have to play it back to hear their answers?  Just \nasking because I need to play my recordings back to hear responses ..\n\nDebbie\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, bruce halliday \n&lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; \n&gt; Mike,\n&gt;  \n&gt; I usually start with asking if they will please join me in a \ncommunication session. If you have a technician and or spirits that \ncommunicate\n&gt; with you on a regular basis, and know their names, greet them and \nthank them for their efforts in communicating and to please send any \nmessages\n&gt; or respond to any question that you have, and you will do the same. \nAlso ask that they block any negative energy or communication or \nspirits themselves \n&gt; from coming through the box. then proceed with the session.\n&gt;  \n&gt; At the end I ask that any spirits that may have come through the \nopen doorway the line of live communication may create, go back \nbefore the box is turned off.\n&gt;  \n&gt; wait to here verbal conformation from the other side that it is \nclear to turn the box off. the responses I usually get are Clear, \nGood, Okay or words to that effect.\n&gt;  \n&gt; I thank my friends for their efforts and say my goodbyes and \nannounce that I am turning off the box. I turn it off and the session \nis done.\n&gt;  \n&gt; Some researchers feel comfortable as I do saying a short protection \nprayer before a session and some do not believe it is necessary. the \nchoice is yours.\n&gt;  \n&gt; I have posted a short protection ritual in the file section of my \nother group, it is there if you need it.\n&gt;  \n&gt; the link to the group is  \nhttp://tech.groups.yahoo.com/group/EVP_ITC_Researchers/ just go over \nand join.\n&gt;  \n&gt; Bruce\n&gt; Bruce Halliday \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: f1cracker75@...: Mon, 24 Mar 2008 06:45:08 -\n0700Subject: Re: [EVP-ITC] EVP Files &gt; Need some more advice from \neveryone, please\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Hi all, and hope you all had a good Easter!\n&gt;  \n&gt; I keep listening to everyone&#39;s recordings and since they are clips \nof what you are doing, my question is how do each of you start a \nrecording to even get these responses?\n&gt;  \n&gt; I write procedures and education instruction, and I am missing this \npiece.\n&gt;  \n&gt; So you pull out the radio\n&gt; You plug in the external speaker\n&gt; You turn the radio on\n&gt; Then set the recorder to record\n&gt; But how do you start the recording?\n&gt;  \n&gt; I mean, do you start off by saying, &quot;hi everyone this is Bruce, or \nKristn or Rhonda. Is anyone one there?&quot;  Or do you start calling out \nnames, or do you even pray the night before that you plan to turn the \nradio on at 9am on such and such a date, or is it when you turn it on \nthey are waiting for you?\n&gt;  \n&gt; Also lets say you turn the radio on, and a spirit says hi Rhonda!. \nFrom there what is your response? What types of questions do you ask? \n&gt;  \n&gt; Is it more like a phone call to a family member, friend, or even \njust talking on a CB radio to truckers passing by trying to learn who \nthey are etc.....\n&gt;  \n&gt; I am trying to step out a method for myself and it is frustrating \nme that I dont have a plan when I turn that rradio and recorder on.\n&gt;  \n&gt; Any guidance would be greatly appreciated!\n&gt;  \n&gt; Mike Edwards Cary, NC\n&gt;  \n&gt; \n&gt; \n&gt; Never miss a thing. Make Yahoo your homepage. \n&gt;  \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Test your Star IQ\n&gt; http://club.live.com/red_carpet_reveal.aspx?icid=redcarpet_HMTAGMAR\n&gt;"}