{"id": "8148", "subject": "Re: EVP Files &gt; Need some more advice from everyone, please", "author": "misujoey", "timestamp": "2008-03-24T16:44:52Z", "full_text": "Thanks Bruce .. It sounds like your communication is &quot;LIVE&quot; and mine \nis virtual &quot;LIVE&quot; using DC6.  I have heard the radio and my PA \nspeak &quot;real-time&quot; but it&#39;s only a word or two .. I wonder if I&#39;m just \nrecording evp?  \n\nDebbie\n\n\n\n--- In EVP-ITC@yahoogroups.com, bruce halliday \n&lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; \n&gt; Hi Debbie,\n&gt;  \n&gt; Yes I am most certainly getting and hearing messages, responses and \nanswers in real time.\n&gt; I do verbalize my sessions, I ask questions and answer questions \nthey may ask.\n&gt;  \n&gt; When you ask a question give at least ten seconds before you ask \nthe next question.\n&gt; Our friends may not be able to catch the correct signal or radio \nfragment to answer\n&gt; immediatelly. Listen carefully during the time after a question and \nif it is answered and the \n&gt; conditions are optimal, such as a good signal and strong response. \nyou should hear the answer if not all \n&gt; part of it in real time.\n&gt;  \n&gt; most of the time we miss the real time communication due to the \nspeed of the sweep of the ammount of clutter the signal\n&gt; is producing. I work with only the AM band, I find it less crowded \nthan FM and therefore easier to catch real time responses.\n&gt;  \n&gt; The yes, no and name responses are the easiest to hear real time. \nThe main thing is to listen carefully for any words or \n&gt; phrases that pertain to the question you have asked. Also when you \ndo hear a real time communication, immediatelly\n&gt; repeat what was said. That gives varification when listening back \nto the recording that you did in fact hear it real time.\n&gt;  \n&gt; At first get yourself accustomed to listening for the simple yes, \nno answers and your ear will start to develop for seperating the \n&gt; spirit communication from the radio noise.\n&gt;  \n&gt; I hope this helps.\n&gt;  \n&gt; Bruce\n&gt; Bruce Halliday \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: Debbie@...: Mon, 24 Mar 2008 15:04:04 \n+0000Subject: [EVP-ITC] Re: EVP Files &gt; Need some more advice from \neveryone, please\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Hi Bruce .. Are you speaking to the box and responding to &quot;real \ntime&quot; answers or do you have to play it back to hear their answers? \nJust asking because I need to play my recordings back to hear \nresponses ..Debbie--- In EVP-ITC@yahoogroups.com, bruce halliday \n&lt;paranormalinvestigating@&gt; wrote:&gt;&gt; &gt; Mike,&gt; &gt; I usually start with \nasking if they will please join me in a communication session. If you \nhave a technician and or spirits that communicate&gt; with you on a \nregular basis, and know their names, greet them and thank them for \ntheir efforts in communicating and to please send any messages&gt; or \nrespond to any question that you have, and you will do the same. Also \nask that they block any negative energy or communication or spirits \nthemselves &gt; from coming through the box. then proceed with the \nsession.&gt; &gt; At the end I ask that any spirits that may have come \nthrough the open doorway the line of live communication may create, \ngo back before the box is turned off.&gt; &gt; wait to here verbal \nconformation from the other side that it is clear to turn the box \noff. the responses I usually get are Clear, Good, Okay or words to \nthat effect.&gt; &gt; I thank my friends for their efforts and say my \ngoodbyes and announce that I am turning off the box. I turn it off \nand the session is done.&gt; &gt; Some researchers feel comfortable as I do \nsaying a short protection prayer before a session and some do not \nbelieve it is necessary. the choice is yours.&gt; &gt; I have posted a \nshort protection ritual in the file section of my other group, it is \nthere if you need it.&gt; &gt; the link to the group is \nhttp://tech.groups.yahoo.com/group/EVP_ITC_Researchers/ just go over \nand join.&gt; &gt; Bruce&gt; Bruce Halliday &gt; &gt; &gt; To: EVP-ITC@: f1cracker75@: \nMon, 24 Mar 2008 06:45:08 -0700Subject: Re: [EVP-ITC] EVP Files &gt; \nNeed some more advice from everyone, please&gt; &gt; &gt; &gt; &gt; &gt; Hi all, and \nhope you all had a good Easter!&gt; &gt; I keep listening to everyone&#39;s \nrecordings and since they are clips of what you are doing, my \nquestion is how do each of you start a recording to even get these \nresponses?&gt; &gt; I write procedures and education instruction, and I am \nmissing this piece.&gt; &gt; So you pull out the radio&gt; You plug in the \nexternal speaker&gt; You turn the radio on&gt; Then set the recorder to \nrecord&gt; But how do you start the recording?&gt; &gt; I mean, do you start \noff by saying, &quot;hi everyone this is Bruce, or Kristn or Rhonda. Is \nanyone one there?&quot; Or do you start calling out names, or do you even \npray the night before that you plan to turn the radio on at 9am on \nsuch and such a date, or is it when you turn it on they are waiting \nfor you?&gt; &gt; Also lets say you turn the radio on, and a spirit says hi \nRhonda!. From there what is your response? What types of questions do \nyou ask? &gt; &gt; Is it more like a phone call to a family member, friend, \nor even just talking on a CB radio to truckers passing by trying to \nlearn who they are etc.....&gt; &gt; I am trying to step out a method for \nmyself and it is frustrating me that I dont have a plan when I turn \nthat rradio and recorder on.&gt; &gt; Any guidance would be greatly \nappreciated!&gt; &gt; Mike Edwards Cary, NC&gt; &gt; &gt; &gt; Never miss a thing. Make \nYahoo your homepage. &gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; \n__________________________________________________________&gt; Test your \nStar IQ&gt; http://club.live.com/red_carpet_reveal.aspx?\nicid=redcarpet_HMTAGMAR&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Windows Live Hotmail is giving away Zunes.\n&gt; http://www.windowslive-hotmail.com/ZuneADay/?locale=en-\nUS&ocid=TXT_TAGLM_Mobile_Zune_V3\n&gt;"}