{"id": "8178", "subject": "Re: RS-12-469  How to slow down scan/voices????", "author": "judy_in_hollywood", "timestamp": "2008-03-25T01:32:39Z", "full_text": "--- In EVP-ITC@yahoogroups.com, Rhonda W &lt;rhondak1973@...&gt; wrote:\n&gt;\n&gt; If you use a recording program ...like Goldwave...you can actually \nslow them down while you listen to the playback, can ever listen to \nthem backwards.  But I dont know of a way to slow down the sweep.  \nAre you using the AM or FM band? And have you tried switching to the \nother band(the one ur not using)?  Ive tried a session on the FM band \nbut it doesnt really seem to work for some reason but the AM does \ngood and Ive gotten a response that indicates that they agree with \nthe AM being better here.\n&gt;    \n&gt;   Rhonda           Hi Rhonda, I&#39;m not sure what Goldwave is (is it \nused on a computer?)! I am currently online at the local library&#39;s PC \nas at home I only have a Webtv unit to go online & that&#39;s limited! I \nhave a Laptop, but it&#39;s not connected to the internet - as I use it \nwith DVD&#39;s or software programes only.   =Judy=   \n&gt;   \n&gt; \n&gt; judy_in_hollywood &lt;Ticket_to_Heaven@...&gt; wrote:\n&gt;           Hi All, Have been doing sessions and sometimes get a \nvoice or more that \n&gt; just jumps in and says a word or two durring the scan, but most of \nthe \n&gt; time it seems it&#39;s like a room full of people talking very fast and \n&gt; thus I can&#39;t seem to hear them well enough to hear if they are \ngiving \n&gt; me any messages! Am I the only one with this issue? How can I slow \nthis \n&gt; down to hear better? =Judy= P.S. I only use the RS 12-469 with \n&gt; portable folding Craig speakers & a Sony cassette recorder with \n&gt; earphones (cups over ears). I sometimes use an external mic or just \nthe \n&gt; cassette recorder&#39;s mic.\n&gt; \n&gt; \n&gt; \n&gt;                            \n&gt; \n&gt;        \n&gt; ---------------------------------\n&gt; Never miss a thing.   Make Yahoo your homepage.\n&gt;"}