{"id": "8206", "subject": "RE: [EVP-ITC] EVP Files &gt; Need some more advice from everyone, please", "author": "bruce halliday", "timestamp": "2008-03-25T13:32:34Z", "full_text": "--_66ccecee-4b96-4a70-9e78-a79a02fd51d4_\r\nContent-Type: text/plain; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n\nMike,\n \nThese are the responses as i heard them, listed in the order they =\r\napear in the folder.\n \n1. NO\n \n2.HEY MIKE\n \n3.WHAT NAME\n \n4.MIKE\n \n5.YEAH (=\r\nwoman)_I SEE HIM (man)\n \n6.MIKE_ said 2x\n \nthe responses are faint, you may=\r\n want to raise the volume of the box\nor move the recorder closer to it, but=\r\n the responses are there.\n \nAfter a while you will gain more experience in =\r\nlistening during a session,\nas your ear becomes trained you will hear more =\r\ncommunication in real time.\n \nThere is a tech on the other side, he happens=\r\n to be my tech and his name is Mike.\nTo insure he is not sending you his na=\r\nme and in fact they are saying your name.\nNext session ask that they call y=\r\nou a nickname of your choosing, to validate that it is you they are speakin=\r\ng about.\n \ngood work.\n \nbruce\nBruce Halliday \n\n\nTo: EVP-ITC@yahoogroups.com=\r\nFrom: f1cracker75@...: Mon, 24 Mar 2008 17:24:40 -0700Subject: Re=\r\n: [EVP-ITC] EVP Files &gt; Need some more advice from everyone, please\n\n\n\n\n\nTh=\r\nanks Rhonda!\n \nI am so thankfull for you and others that have responded.\n \n=\r\nWhen I first started, i got about 6 good recordings, but then got a two wee=\r\nk dead spot of nothing. See Files &gt; Mike Edwards Files \n \nI too am trying t=\r\no locate my parent, my dad.\n \nI wonder where they go?\n \nI am going to take =\r\nwhat I received from you Bruce and Kristin and anyone else and come up with=\r\n my own start and end recording process.\n \nThanks again\n \nMike Edwards Cary=\r\n NC\n \nRhonda W &lt;rhondak1973@...&gt; wrote:\n\n\n\nHey Mike\n \nI had a good, q=\r\nuiet Easter with just me and my son...he is 13 so we didnt do the easter eg=\r\ng hunt or basket...and didnt do anything fancy for dinner....just stuffed b=\r\nell peppers and I made him some deviled eggs earlier in the day too.  Hope =\r\nyours was a good one.\n \nI just did my first session with the RS 12-470 yest=\r\nerday. Before I turned the radio on....I started talking to the spirits tha=\r\nt might be around...&quot;Hey everybody, just wanted to let you know Im gonna do=\r\n a session with this new 470 box in about 10 mins....now Im new to it so do=\r\nnt get frustrated if I dont hear you clearly&quot;  \n \nThen right before I turne=\r\nd the 470 on I just started out imaging a white light surrounding me and pr=\r\notecting me from any negative energies or spirts out there. And I asked out=\r\nloud for God to keep me safe and asked the spirits to please keep any negat=\r\nive spirits or energy away and to keep my house safe.  Then I said &quot;OK I&#39;m =\r\ngonna turn on the box now and let it warm up a bit so you can get used to i=\r\nt&quot;  Turned it on(and my recorder...which Im using my pc right now for that)=\r\n and let it run for a couple mins, just so they could get used to how it wo=\r\nrks...I figured since I was new to this then they probably were too. \n \nI a=\r\nlso figured it couldnt hurt to talk to them beforehand...so they get to kno=\r\nw my personality a bit.  Then I gave an invite for positive spirits to come=\r\n forward and feel free to check out and try the box and send any messages t=\r\nhru they had....Then I  just introduced myself...&quot;Hi everybody my name is R=\r\nhonda&quot;(waited and listened for a bit)....&quot;Is there anyone here who would li=\r\nke to say hello?&quot; (waited for a lil bit and got a couple of Yes&#39;s and a No =\r\nlol).  Just talked to them like they were sitting right here in my living r=\r\noom and we have known each other....joked around a bit...&quot;Come on you know =\r\nyou wanna say hi&quot;  \n \nI tried to get them to say my name but that didnt hap=\r\npen...but if I turned it on and heard &quot;Hi Rhonda!&quot; I would prolly pick my j=\r\naw up off the floor and say HI!!!.  Also I felt it was polite to say thank =\r\nyou whenever they answered me...kind of a treat them how you would like to =\r\nbe treated(I do that in my normal everyday life anyways so its easy to be p=\r\nolite).\n \nJust kept any questions short and to the point...and my point was=\r\n a short get to know each other session...which Im gonna do a few more of..=\r\n.dont wanna overwhelm them or me(lol).\n \nI found too that I got the best re=\r\nsults using the AM band...but I did a short stint in both bands to try it o=\r\nut. When I went to switch bands I asked them &quot;do you find that the AM band =\r\nwas working best for us?  Heard a clear &quot;Yes&quot;  so I said &quot;Ok...thank you...=\r\nso Im gonna change it back to AM, is that ok with you?&quot; Heard an &quot;Ok&quot;\n \nI a=\r\nctually heard Frank mentioned but it was in my first part of my session whe=\r\nn I had the box too far from the mic and the mic not on loud enuff to pick =\r\nup either the box or me. So it wasnt recorded.\n \nIm also an avid CBer by th=\r\ne way...and ya its kinda like that...driving around gettin to know people, =\r\nasking names(handles in CB lingo), if anyone is out there, and just shootin=\r\n the breeze like you would do if you were talkin to ur CB friends....and ju=\r\nst letting them get to know you and vice versa.  I honestly wasnt expecting=\r\n to get much of anything...but was happy as a pig in poo with what I got.  =\r\n\n \nSo basically my whole goal or plan is just to make friends with them and=\r\n give them a chance and oppritunity to pass on their messages be it to me o=\r\nr others(which I could pass on to them).  \n \nI had come here with hopes tha=\r\nt Id be able to contact my mom, who passed away Feb 21st of this year...but=\r\n I know that when I was doing EVP you dont always get in contact with who y=\r\nou are trying to and I started thinking...that maybe our loved ones have mo=\r\nved on to a different part of heaven...or maybe there is some kind of &quot;prob=\r\nation&quot; time for them before they can get out there and use the boxes and ra=\r\ndios and do EVPs....not in a bad probation sort of way, more of a get used =\r\nto not being on earth and being in heaven kind of way.\n \nEveryone who has d=\r\none this on here has said dont go into a session if you are frustrated or a=\r\nngry, upset, irritated or even overly tired...cuz that can attract negative=\r\n energy to you....like a big flash light in the dark saying come on over Im=\r\n wide open...and thats not a good thing.  If you find yourself getting frus=\r\ntrated or upset during a session I would think it would be better to finish=\r\n up your session. \nGotta remember, that its not easy for them to use energy=\r\n and those fragments of speech going by so quickly...it takes them time to =\r\nget used to it just as it takes us time to get used to listening and gettin=\r\ng our &quot;ears&quot;. Practice makes perfect...but its sometimes not gonna be perfe=\r\nct and you cant let that frustrate you.  Most of the others on here have be=\r\nen doing this for a long time and have a strong friendship with their techs=\r\n/guides.\n \nI think Id also compare it to meeting someone in person for the =\r\nfirst time...for me, Im a shy person, very shy at times...until I get to kn=\r\now someone then ya cant get me to shut up!  But it takes time to form that =\r\nfriendship and get them to open up...and takes time to get our &quot;ears&quot;.\n \nAn=\r\nyways I have prolly rambled on way too long for you....but wanted to give y=\r\nou my input...and like I said im new to the ghost box type communication bu=\r\nt have done conventional EVPs for a while now.  Hopefully I havent steered =\r\nyou wrong and Im sure if I have someone will correct me =3D)\n \nAlso before =\r\nyou shut off your box you ask everyone who came across to please go back to=\r\n their side, give them a minute to do that and then ask them if its ok to s=\r\nhut the door(shut your radio off)...when you get a conformation(I heard a l=\r\noud and clear &quot;Do It&quot;...then you thank them and say bye and shut er down.  =\r\nThat way you dont take the chance of leaving anyone behind in your house.\n =\r\n\nHope my ramblings helped ya a bit.\n \nRhonda\n \nMichael Edwards &lt;f1cracker75=\r\n@...&gt; wrote:\n\n\n\nHi all, and hope you all had a good Easter!\n \nI keep =\r\nlistening to everyone&#39;s recordings and since they are clips of what you are=\r\n doing, my question is how do each of you start a recording to even get the=\r\nse responses?\n \nI write procedures and education instruction, and I am miss=\r\ning this piece.\n \nSo you pull out the radio\nYou plug in the external speake=\r\nr\nYou turn the radio on\nThen set the recorder to record\nBut how do you star=\r\nt the recording?\n \nI mean, do you start off by saying, &quot;hi everyone this is=\r\n Bruce, or Kristn or Rhonda. Is anyone one there?&quot;  Or do you start calling=\r\n out names, or do you even pray the night before that you plan to turn the =\r\nradio on at 9am on such and such a date, or is it when you turn it on they =\r\nare waiting for you?\n \nAlso lets say you turn the radio on, and a spirit sa=\r\nys hi Rhonda!. From there what is your response? What types of questions do=\r\n you ask? \n \nIs it more like a phone call to a family member, friend, or ev=\r\nen just talking on a CB radio to truckers passing by trying to learn who th=\r\ney are etc.....\n \nI am trying to step out a method for myself and it is fru=\r\nstrating me that I dont have a plan when I turn that rradio and recorder on=\r\n.\n \nAny guidance would be greatly appreciated!\n \nMike Edwards Cary, NC\n \n\n\n=\r\nNever miss a thing. Make Yahoo your homepage. \n\n\n\nBe a better friend, newsh=\r\nound, and know-it-all with Yahoo! Mobile. Try it now. \n\n___________________=\r\n_______________________________Do You Yahoo!?Tired of spam? Yahoo! Mail has=\r\n the best spam protection around http://mail.yahoo.com  \n\n\n\n\n\n\n____________=\r\n_____________________________________________________\nTest your Star IQ\nhtt=\r\np://club.live.com/red_carpet_reveal.aspx?icid=3Dredcarpet_HMTAGMAR\r\n--_66ccecee-4b96-4a70-9e78-a79a02fd51d4_\r\nContent-Type: text/html; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;\n&lt;head&gt;\n&lt;style&gt;\n.hmmessage P\n{\nmargin:0px;\npadding:0px\n}\nbody.hmmessa=\r\nge\n{\nFONT-SIZE: 10pt;\nFONT-FAMILY:Tahoma\n}\n&lt;/style&gt;\n&lt;/head&gt;\n&lt;body class=3D&#39;=\r\nhmmessage&#39;&gt;\nMike,&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nThese are the responses as i heard them, l=\r\nisted in the order they apear in the folder.&lt;BR&gt;\n&nbsp;&lt;BR&gt;\n1. NO&lt;BR&gt;\n&nbsp=\r\n;&lt;BR&gt;\n2.HEY MIKE&lt;BR&gt;\n&nbsp;&lt;BR&gt;\n3.WHAT NAME&lt;BR&gt;\n&nbsp;&lt;BR&gt;\n4.MIKE&lt;BR&gt;\n&nbsp=\r\n;&lt;BR&gt;\n5.YEAH (woman)_I SEE HIM (man)&lt;BR&gt;\n&nbsp;&lt;BR&gt;\n6.MIKE_ said 2x&lt;BR&gt;\n&nb=\r\nsp;&lt;BR&gt;\nthe responses are faint, you may want to raise the volume of the bo=\r\nx&lt;BR&gt;\nor move the recorder closer to it, but the responses are there.&lt;BR&gt;\n&=\r\nnbsp;&lt;BR&gt;\nAfter a while you will gain more experience in listening during a=\r\n session,&lt;BR&gt;\nas your ear becomes trained you will hear more communication =\r\nin real time.&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nThere is a tech on the other side, he happens =\r\nto be my tech and his name is Mike.&lt;BR&gt;\nTo insure he is not sending you his=\r\n name and in fact they are saying your name.&lt;BR&gt;\nNext session ask that they=\r\n call you a nickname of your choosing, to validate that it is you they are =\r\nspeaking about.&lt;BR&gt;\n&nbsp;&lt;BR&gt;\ngood work.&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nbruce&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;\n=\r\n&lt;P align=3Dcenter&gt;&lt;FONT size=3D4&gt;&lt;FONT color=3D#0033cc&gt;&lt;STRONG&gt;&lt;EM&gt;&lt;FONT co=\r\nlor=3D#000000 size=3D5&gt;Bruce Halliday &lt;BR&gt;&lt;/FONT&gt;&lt;/EM&gt;&lt;/STRONG&gt;&lt;BR&gt;&lt;A href=\r\n=3D&quot;http://free-paranormalinvestigating.com/%3C/div%3E%3C/div%3E%3Cp%20/%3E=\r\n%3Cdiv%20class=3D&quot; target=3D_blank&gt;&lt;/P&gt;&lt;/A&gt;&lt;/FONT&gt;&lt;/FONT&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;BLOCKQUO=\r\nTE&gt;\n&lt;HR&gt;\nTo: EVP-ITC@yahoogroups.com&lt;BR&gt;From: f1cracker75@...&lt;BR&gt;Date=\r\n: Mon, 24 Mar 2008 17:24:40 -0700&lt;BR&gt;Subject: Re: [EVP-ITC] EVP Files &gt; =\r\nNeed some more advice from everyone, please&lt;BR&gt;&lt;BR&gt;\n&lt;META content=3D&quot;Micros=\r\noft SafeHTML&quot; name=3DGenerator&gt;\n&lt;DIV id=3DEC_ygrp-mlmsg style=3D&quot;WIDTH: 655=\r\npx&quot;&gt;\n&lt;DIV id=3DEC_ygrp-msg style=3D&quot;PADDING-RIGHT: 25px; PADDING-LEFT: 0px;=\r\n Z-INDEX: 1; FLOAT: left; PADDING-BOTTOM: 0px; WIDTH: 470px; PADDING-TOP: 0=\r\npx&quot;&gt;\n&lt;DIV id=3DEC_ygrp-text&gt;\n\n&lt;DIV&gt;Thanks Rhonda!&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;=\r\nDIV&gt;I am so thankfull for you and others that have responded.&lt;/DIV&gt;\n&lt;DIV&gt;&n=\r\nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;When I first started, i got about 6 good recordings, but th=\r\nen got a two week dead spot of nothing. See &lt;A href=3D&quot;http://tech.groups.y=\r\nahoo.com/group/EVP-ITC/files/&quot; target=3D_blank&gt;&lt;FONT color=3D#9136ad&gt;Files&lt;=\r\n/FONT&gt;&lt;/A&gt; &gt; Mike Edwards Files &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I too am t=\r\nrying to locate my parent, my dad.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I wonder wh=\r\nere they go?&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I am going to take what I receive=\r\nd from you Bruce and Kristin and anyone else and come up with my own start =\r\nand end recording process.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Thanks again&lt;/DIV&gt;\n=\r\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Mike Edwards Cary NC&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;B=\r\nR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;Rhonda W &lt;rhondak1973@&lt;WBR&gt;yahoo.com&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/DIV=\r\n&gt;\n&lt;BLOCKQUOTE class=3DEC_replbq style=3D&quot;BORDER-LEFT: #1010ff 2px solid&quot;&gt;\n&lt;=\r\nDIV id=3DEC_ygrp-text&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;Hey Mike&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I h=\r\nad a good, quiet Easter with just me and my son...he is 13 so we didnt do t=\r\nhe easter egg hunt or basket...and didnt do anything fancy for dinner....ju=\r\nst stuffed bell peppers and I made him some deviled eggs earlier in the day=\r\n too.&nbsp; Hope yours was a good one.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I just =\r\ndid my first session with the RS 12-470 yesterday. Before I turned the radi=\r\no on....I started talking to the spirits that might be around...&quot;Hey everyb=\r\nody, just wanted to let you know Im gonna do a session with this new 470 bo=\r\nx in about 10 mins....now Im new to it so dont get frustrated if I dont hea=\r\nr you clearly&quot;&nbsp; &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Then right before I turn=\r\ned the 470 on I just started out imaging a white light surrounding me and p=\r\nrotecting me from any negative energies or spirts out there. And I asked ou=\r\ntloud for God to keep me safe and asked the spirits to please keep any nega=\r\ntive spirits or energy away and to keep my house safe.&nbsp; Then I said &quot;O=\r\nK I&#39;m gonna turn on the box now and let it warm up a bit so you can get use=\r\nd to it&quot;&nbsp; Turned it on(and my recorder...which Im using my pc right no=\r\nw for that)&nbsp;and let it run for a couple mins, just so they could get u=\r\nsed to how it works...I figured since I was new to this then they probably =\r\nwere too.&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I also figured&nbsp;it couldnt=\r\n hurt to&nbsp;talk to them beforehand..&lt;WBR&gt;.so they get to know my persona=\r\nlity a bit.&nbsp; Then I gave an invite for positive spirits to come forwar=\r\nd and feel free to check out and try the box and send any messages thru the=\r\ny had....Then I&nbsp; just introduced myself...&quot;Hi everybody my name is Rho=\r\nnda&quot;(waited and listened for a bit)....&quot;Is there anyone here who would like=\r\n to say hello?&quot; (waited for a lil bit and got a couple of Yes&#39;s and a No lo=\r\nl).&nbsp; Just talked to them like they were sitting right here in my livin=\r\ng room and we have known each other....joked around a bit...&quot;Come on you kn=\r\now you wanna say hi&quot;&nbsp; &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I tried to get the=\r\nm to say my name but that didnt happen...but if I turned it on and heard &quot;H=\r\ni Rhonda!&quot; I would prolly pick my jaw up off the floor and say HI!!!.&nbsp;=\r\n Also I felt it was polite to say thank you whenever they answered me...kin=\r\nd of a treat them how you would like to be treated(I do that in my normal e=\r\nveryday life anyways so its easy to be polite).&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DI=\r\nV&gt;Just kept any questions short and to the point...and my point was a short=\r\n get to know each other session...which Im gonna do a few more of...dont wa=\r\nnna overwhelm them or me(lol).&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I found too tha=\r\nt I got the best results using the AM band...but I did a short stint in bot=\r\nh bands to try it out. When I went to switch bands I asked them &quot;do you fin=\r\nd that the AM band was working best for us?&nbsp; Heard a clear &quot;Yes&quot;&nbsp;=\r\n so I said &quot;Ok...thank you...so Im gonna change it back to AM, is that ok w=\r\nith you?&quot; Heard an &quot;Ok&quot;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I actually heard Frank=\r\n mentioned but it was in my first part of my session when I had the box too=\r\n far from the mic and the mic not on loud enuff to pick up either the box o=\r\nr me. So it wasnt recorded.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Im also an avid CB=\r\ner by the way...and ya its kinda like that...driving around gettin to know =\r\npeople, asking names(handles in CB lingo), if anyone is out there, and just=\r\n shootin the breeze like you would do if you were talkin to ur CB friends..=\r\n..and just letting them get to know you and vice versa.&nbsp; I honestly wa=\r\nsnt expecting to get much of anything...but was happy as a pig in poo with =\r\nwhat I got.&nbsp; &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;So basically my whole goal =\r\nor plan is just to make friends with them and give them a chance and opprit=\r\nunity to pass on their messages be it to me or others(which I could pass on=\r\n to them).&nbsp; &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I had come here with hopes t=\r\nhat Id be able to contact my mom, who passed away Feb 21st of this year...b=\r\nut I know that when I was doing EVP you dont always get in contact with who=\r\n you are trying to and I started thinking...that maybe our loved ones have =\r\nmoved on to a different part of heaven...or maybe there is some kind of &quot;pr=\r\nobation&quot; time for them before they can get out there and use the boxes and =\r\nradios and do EVPs....not in a bad probation sort of way, more of a get use=\r\nd to not being on earth and being in heaven kind of way.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;=\r\n/DIV&gt;\n&lt;DIV&gt;Everyone who has done this on here has said dont go into a sessi=\r\non if you are frustrated or angry, upset, irritated&nbsp;or even overly tir=\r\ned...cuz that can attract negative energy to you....like a big flash light =\r\nin the dark saying come on over Im wide open...and thats not a good thing.&=\r\nnbsp; If you find yourself getting frustrated or upset during a session I w=\r\nould think it would be better to finish up your session. &lt;BR&gt;&lt;/DIV&gt;\n&lt;DIV&gt;Go=\r\ntta remember, that its not easy for them to use energy and those fragments =\r\nof speech going by so quickly...it takes them time to get used to it just a=\r\ns it takes us time to get used to listening and getting our &quot;ears&quot;. Practic=\r\ne makes perfect...but its sometimes not gonna be perfect and you cant let t=\r\nhat frustrate you.&nbsp; Most of the others on here have been doing this fo=\r\nr a long time and have a strong friendship with their techs/guides.&lt;/DIV&gt;\n&lt;=\r\nDIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I think Id also compare it to meeting someone in pers=\r\non for the first time...for me, Im a shy person, very shy at times...until =\r\nI get to know someone then ya cant get me to shut up!&nbsp; But it takes ti=\r\nme to form that friendship and get them to open up...and takes time to get =\r\nour &quot;ears&quot;.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Anyways I have prolly rambled on w=\r\nay too long for you....but wanted to give you my input...and like I said im=\r\n new to the ghost box type communication but have done conventional EVPs fo=\r\nr a while now.&nbsp; Hopefully I havent steered you wrong and Im sure if I =\r\nhave someone will correct me =3D)&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Also before =\r\nyou shut off your box you ask everyone who came across to please go back to=\r\n their side, give them a minute to do that and then ask them if its ok to s=\r\nhut the door(shut your radio off)...when you get a conformation(&lt;WBR&gt;I hear=\r\nd a loud and clear &quot;Do It&quot;...then you thank them and say bye and shut er do=\r\nwn.&nbsp; That way you dont take the chance of leaving anyone behind in you=\r\nr house.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Hope my ramblings helped ya a bit.&lt;/D=\r\nIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Rhonda&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;Mi=\r\nchael Edwards &lt;f1cracker75@&lt;WBR&gt;yahoo.com&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/DIV&gt;\n&lt;BLOC=\r\nKQUOTE class=3DEC_replbq style=3D&quot;BORDER-LEFT: #1010ff 2px solid&quot;&gt;\n&lt;DIV id=\r\n=3DEC_ygrp-text&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;Hi all, and hope you all had a good Easter!&lt;/DI=\r\nV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I keep listening to everyone&#39;s recordings and sin=\r\nce they are clips of what you are doing, my question is how do each of you =\r\nstart a recording to even get these responses?&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV=\r\n&gt;I write procedures and education instruction, and I am missing this piece.=\r\n&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;So you pull out the radio&lt;/DIV&gt;\n&lt;DIV&gt;You plug=\r\n in the external speaker&lt;/DIV&gt;\n&lt;DIV&gt;You turn the radio on&lt;/DIV&gt;\n&lt;DIV&gt;Then s=\r\net the recorder to record&lt;/DIV&gt;\n&lt;DIV&gt;But how do you start the recording?&lt;/D=\r\nIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I mean, do you start off by saying, &quot;hi everyone=\r\n this is&nbsp;Bruce, or Kristn or Rhonda. Is anyone one there?&quot;&nbsp; Or do=\r\n you start calling out names, or do you even pray the night before that you=\r\n plan to turn the radio on at 9am on such and such a date, or is it when yo=\r\nu turn it on they are waiting for you?&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Also le=\r\nts say you turn the radio on, and a spirit says hi Rhonda!. From there what=\r\n is your response? What types of questions do you ask? &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/=\r\nDIV&gt;\n&lt;DIV&gt;Is it more like a phone call to a family member, friend, or even =\r\njust talking on a CB radio to truckers passing by trying to learn who they =\r\nare etc.....&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;I am trying to step out a method =\r\nfor myself and it is frustrating me that I dont have a plan when I turn tha=\r\nt rradio and recorder on.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Any guidance would b=\r\ne greatly appreciated!&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Mike Edwards Cary, NC&lt;/=\r\nDIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;\n&lt;HR SIZE=3D1&gt;\nNever miss a thing. &lt;A href=3D&quot;h=\r\nttp://us.rd.yahoo.com/evt=3D51438/*http://www.yahoo.com/r/hs&quot; target=3D_bla=\r\nnk&gt;Make Yahoo your homepage.&lt;/A&gt; \n&lt;DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE=\r\n&gt;&lt;BR&gt;\n&lt;DIV&gt;\n&lt;HR SIZE=3D1&gt;\nBe a better friend, newshound, and know-it-all wi=\r\nth Yahoo! Mobile. &lt;A href=3D&quot;http://us.rd.yahoo.com/evt=3D51733/*http://mob=\r\nile.yahoo.com/;_ylt=3DAhu06i62sR8HDtDypao8Wcj9tAcJ&quot; target=3D_blank&gt;Try it =\r\nnow.&lt;/A&gt; \n&lt;DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;\n&lt;P&gt;____________&lt;WB=\r\nR&gt;_________&lt;WBR&gt;_________&lt;WBR&gt;_________&lt;WBR&gt;_________&lt;WBR&gt;__&lt;BR&gt;Do You Yaho=\r\no!?&lt;BR&gt;Tired of spam? Yahoo! Mail has the best spam protection around &lt;BR&gt;h=\r\nttp://mail.&lt;WBR&gt;yahoo.com &lt;BR&gt;&lt;/DIV&gt;&lt;SPAN style=3D&quot;COLOR: white&quot;&gt;&lt;/SPAN&gt; \n&lt;=\r\nSTYLE&gt;\n.ExternalClass #EC_ygrp-mkp\n{border:1px solid #d8d8d8;font-family:Ar=\r\nial;padding:0px 14px;}\n.ExternalClass #EC_ygrp-mkp hr\n{border:1px solid #d8=\r\nd8d8;}\n.ExternalClass #EC_ygrp-mkp #EC_hd\n{color:#628c2a;font-size:85%;font=\r\n-weight:bold;line-height:122%;}\n.ExternalClass #EC_ygrp-mkp #EC_ads\n{margin=\r\n-bottom:10px;}\n.ExternalClass #EC_ygrp-mkp .EC_ad\n{padding:0 0;}\n.ExternalC=\r\nlass #EC_ygrp-mkp .EC_ad a\n{color:#0000ff;text-decoration:none;}\n\n&lt;/STYLE&gt;\n=\r\n\n&lt;STYLE&gt;\n.ExternalClass #EC_ygrp-sponsor #EC_ygrp-lc\n{font-family:Arial;}\n.=\r\nExternalClass #EC_ygrp-sponsor #EC_ygrp-lc #EC_hd\n{font-weight:bold;font-si=\r\nze:78%;line-height:122%;}\n.ExternalClass #EC_ygrp-sponsor #EC_ygrp-lc .EC_a=\r\nd\n{margin-bottom:10px;padding:0 0;}\n\n&lt;/STYLE&gt;\n\n&lt;STYLE&gt;\n.ExternalClass #EC_y=\r\ngrp-mlmsg\n{font-size:13px;font-family:arial,helvetica,clean,sans-serif;}\n.E=\r\nxternalClass #EC_ygrp-mlmsg table\n{font-size:inherit;font:100%;}\n.ExternalC=\r\nlass #EC_ygrp-mlmsg select, .ExternalClass input, .ExternalClass textarea\n{=\r\nfont:99% arial,helvetica,clean,sans-serif;}\n.ExternalClass #EC_ygrp-mlmsg p=\r\nre, .ExternalClass code\n{font:115% monospace;}\n.ExternalClass #EC_ygrp-mlms=\r\ng EC_*\n{line-height:1.22em;}\n.ExternalClass #EC_ygrp-text\n{font-family:Geor=\r\ngia;}\n.ExternalClass #EC_ygrp-text p\n{;}\n.ExternalClass #EC_ygrp-tpmsgs\n{fo=\r\nnt-family:Arial;clear:both;}\n.ExternalClass #EC_ygrp-vitnav\n{padding-top:10=\r\npx;font-family:Verdana;font-size:77%;}\n.ExternalClass #EC_ygrp-vitnav a\n{pa=\r\ndding:0 1px;}\n.ExternalClass #EC_ygrp-actbar\n{clear:both;white-space:nowrap=\r\n;color:#666;text-align:right;}\n.ExternalClass #EC_ygrp-actbar .EC_left\n{flo=\r\nat:left;white-space:nowrap;}\n.ExternalClass .EC_bld\n{font-weight:bold;}\n.Ex=\r\nternalClass #EC_ygrp-grft\n{font-family:Verdana;font-size:77%;padding:15px 0=\r\n;}\n.ExternalClass #EC_ygrp-ft\n{font-family:verdana;font-size:77%;border-top=\r\n:1px solid #666;padding:5px 0;}\n.ExternalClass #EC_ygrp-mlmsg #EC_logo\n{pad=\r\nding-bottom:10px;}\n.ExternalClass #EC_ygrp-reco\n{margin-bottom:20px;padding=\r\n:0px;}\n.ExternalClass #EC_ygrp-reco #EC_reco-head\n{font-weight:bold;color:#=\r\nff7900;}\n.ExternalClass #EC_reco-grpname\n{font-weight:bold;}\n.ExternalClass=\r\n #EC_reco-category\n{font-size:77%;}\n.ExternalClass #EC_reco-desc\n{font-size=\r\n:77%;}\n.ExternalClass #EC_ygrp-vital\n{background-color:#e0ecee;margin-botto=\r\nm:20px;padding:2px 0 8px 8px;}\n.ExternalClass #EC_ygrp-vital #EC_vithd\n{fon=\r\nt-size:77%;font-family:Verdana;font-weight:bold;color:#333;text-transform:u=\r\nppercase;}\n.ExternalClass #EC_ygrp-vital ul\n{padding:0;}\n.ExternalClass #EC=\r\n_ygrp-vital ul li\n{list-style-type:none;clear:both;border:1px solid #e0ecee=\r\n;}\n.ExternalClass #EC_ygrp-vital ul li .EC_ct\n{font-weight:bold;color:#ff79=\r\n00;float:right;width:2em;text-align:right;padding-right:.5em;}\n.ExternalCla=\r\nss #EC_ygrp-vital ul li .EC_cat\n{font-weight:bold;}\n.ExternalClass #EC_ygrp=\r\n-vital a\n{text-decoration:none;}\n.ExternalClass #EC_ygrp-vital a:hover\n{tex=\r\nt-decoration:underline;}\n.ExternalClass #EC_ygrp-sponsor #EC_hd\n{color:#999=\r\n;font-size:77%;}\n.ExternalClass #EC_ygrp-sponsor #EC_ov\n{padding:6px 13px;b=\r\nackground-color:#e0ecee;margin-bottom:20px;}\n.ExternalClass #EC_ygrp-sponso=\r\nr #EC_ov ul\n{padding:0 0 0 8px;}\n.ExternalClass #EC_ygrp-sponsor #EC_ov li\n=\r\n{list-style-type:square;padding:6px 0;font-size:77%;}\n.ExternalClass #EC_yg=\r\nrp-sponsor #EC_ov li a\n{text-decoration:none;font-size:130%;}\n.ExternalClas=\r\ns #EC_ygrp-sponsor #EC_nc\n{background-color:#eee;margin-bottom:20px;padding=\r\n:0 8px;}\n.ExternalClass #EC_ygrp-sponsor .EC_ad\n{padding:8px 0;}\n.ExternalC=\r\nlass #EC_ygrp-sponsor .EC_ad #EC_hd1\n{font-family:Arial;font-weight:bold;co=\r\nlor:#628c2a;font-size:100%;line-height:122%;}\n.ExternalClass #EC_ygrp-spons=\r\nor .EC_ad a\n{text-decoration:none;}\n.ExternalClass #EC_ygrp-sponsor .EC_ad =\r\na:hover\n{text-decoration:underline;}\n.ExternalClass #EC_ygrp-sponsor .EC_ad=\r\n p\n{;}\n.ExternalClass EC_o\n{font-size:0;}\n.ExternalClass .EC_MsoNormal\n{;}\n=\r\n.ExternalClass #EC_ygrp-text tt\n{font-size:120%;}\n.ExternalClass blockquote=\r\n\n{;}\n.ExternalClass .EC_replbq\n{;}\n\n&lt;/STYLE&gt;\n&lt;/BLOCKQUOTE&gt;&lt;br /&gt;&lt;hr /&gt;Test =\r\nyour Star IQ &lt;a href=3D&#39;http://club.live.com/red_carpet_reveal.aspx?icid=3D=\r\nredcarpet_HMTAGMAR&#39; target=3D&#39;_new&#39;&gt;Play now!&lt;/a&gt;&lt;/body&gt;\n&lt;/html&gt;\r\n--_66ccecee-4b96-4a70-9e78-a79a02fd51d4_--"}