{"id": "8239", "subject": "Re: for Frank S regarding 7.83 hertz", "author": "psi_research", "timestamp": "2008-03-25T20:23:43Z", "full_text": "If any reserachers in S. Cali that particiapte in the forum would \nlike to experiment my Mind Mirror III EEG let me know. It&#39;s designed \nto display brainwave frequency and state of conciousness. -Bill M\n \n--- In EVP-ITC@yahoogroups.com, Saklitaboth &lt;vampire2kd@...&gt; wrote:\n&gt;\n&gt; Regarding 7.83 hz comment by Ron Lenderer. I wouldn&#39;t call it &quot;woo-\nwoo stuff&quot;. Try to reach 7.83 hz brainwave pattern while maintaining \nconsciousness, a lot of odd things start to take place. The 7.8 hz \nfrequency is also known as &quot;The Schumann resonance&quot;. I took a snippet \nof the explanation from wikipedia regarding the Schumann resonance \nfor you: \n&gt; &quot;This global electromagnetic resonance phenomenon is named after \nphysicist Winfried Otto Schumann who predicted it mathematically in \n1952. Schumann resonance occurs because the space between the surface \nof the Earth and the conductive ionosphere acts as a waveguide. The \nlimited dimensions of the Earth cause this waveguide to act as a \nresonant cavity for electromagnetic waves in the ELF band. The cavity \nis naturally excited by energy from lightning strikes. Schumann \nresonance modes are observed in the power spectra of the natural \nelectromagnetic background noise, as separate peaks at extremely low \nfrequencies (ELF) around 7.8, 14.3, 20.8, 27.3 and 33.8 Hz.\n&gt;  The fundamental mode of the Schumann resonance is a standing wave \nin the Earth-ionosphere cavity with a wavelength equal to the \ncircumference of the Earth. This lowest-frequency (and highest-\nintensity) mode of the Schumann resonance occurs at a frequency of \napproximately 7.8 Hz&quot;\n&gt; \n&gt; A while back when reading about the schumann resonance I came up \nwith an interesting idea. I wanted to find a brainwave eeg that would \ndo a tone biofeedback into an ear piece (right ear), then have the \n7.8 hz tone being played infinitely through an ear piece in the left \near, and try to force myself to match my brainwaves to the schumann \nresonance through force of will. Having the real time feedback in \ntone form would drastically help to judge where one is at and if \nhe/she is having any success changing his/her brainwaves. The idea is \nto passively listen while relaxing until one could get to the \nschumann resonance regarding the brainwaves and record the \nsensations/thoughts/experiences etc.. I haven&#39;t the time nor money to \nget a biofeedback eeg and actually give this a try, but for anyone \nwho does and decides to let me know your results.\n&gt; Ron Lederer &lt;ronriko@...&gt; wrote:            Hi Frank   I was \nlistening to C2C a few days ago and the person being interviewed \nmentioned that the frequency 7.83 hertz (not MH) is the common \nfrequency where the mind goes when it between theta and alpha states \nand this 7.83 frequency is sort of a trance state that links mind and \nuniverse.  Is this just woo-woo stuff?  Would you think it has any \nrelevance to EVP communications?   waddayathink    Ron L           \n&gt; \n&gt; ---------------------------------\n&gt; Never miss a thing.   Make Yahoo your homepage.  \n&gt; \n&gt;        \n&gt; ---------------------------------\n&gt; Be a better friend, newshound, and know-it-all with Yahoo! Mobile.  \nTry it now.\n&gt;"}