{"id": "8258", "subject": "Re: [EVP-ITC] home phone answering maching EVP", "author": "Lisby", "timestamp": "2008-03-25T22:58:01Z", "full_text": "So that is properly The Gramdma Smackdown, eh?\n\nMost people who report calls from the dead where the recipient is  \nthere to take the call say that a short and usually very normal  \nconversation takes place. Afterward, the person who got the call  \nrealized the caller was a dead person and is shocked, but during the  \ncall, they report barely even registering that something odd is  \nhappening.\n\nAnn\n\nOn Mar 25, 2008, at 2:17 PM, bruce halliday wrote:\n\n&gt; Hi Ann,\n&gt;\n&gt; Yes very close, I have spoken to her via several boxes.\n&gt; but have not been doing as many sessions lately due to the backlog  \n&gt; of recordings and the time spent with\n&gt; everyday buisness.\n&gt;\n&gt; I guess she felt that she needed to give me a reminder. I was  \n&gt; actually out of the house when the call was\n&gt; recorded. Or it is possible that they can place the message  \n&gt; directly onto the message recorder without actuall placing the  \n&gt; simulated call.\n&gt;\n&gt; My thought is, I wonder how it would have went, had I picked up the  \n&gt; phone? I sure hope I get another chance.\n&gt;\n&gt; bruce\n&gt;\n&gt;\n&gt;\n&gt; Bruce Halliday\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; From: lisby@earthlink.net\n&gt; Date: Tue, 25 Mar 2008 14:06:07 -0400\n&gt; Subject: Re: [EVP-ITC] home phone answering maching EVP\n&gt;\n&gt; I&#39;ve always hoped to get a call like this. Maybe some day, I shall.\n&gt;\n&gt; Were you close to your grandmother?\n&gt;\n&gt; Ann\n&gt;\n&gt; On Mar 25, 2008, at 11:49 AM, bhali333 wrote:\n&gt;\n&gt;\n&gt; hey everybody,\n&gt;\n&gt; I recieved this at 8:30 AM this morning on my home telephone answering\n&gt; machine. I posted it in my main folder in the files section.\n&gt;\n&gt; It is the third message I have recieved in this fashion in all the\n&gt; years I have been involved in the paranormal.\n&gt;\n&gt; this just gors to show if you don&#39;t call them they will call you!\n&gt;\n&gt; bruce\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Watch “Cause Effect,” a show about real people making a real  \n&gt; difference. Learn more.\n&gt;\n&gt; \n\n\nSo ha is p ope ly The G amdma Smackdown, eh?Mos people who epo calls om he dead whe e he ecipien is he e o ake he call say ha a sho and usually e y no mal con e sa ion akes place. A e wa d, he pe son who go he call ealized he calle was a dead pe son and is shocked, bu du ing he call, hey epo ba ely e en egis e ing ha some hing odd is happening.AnnOn Ma 25, 2008, a 2:17 PM, b uce halliday w o e:Hi Ann, Yes e y close, I ha e spoken o he ia se e al boxes.bu ha e no been doing as many sessions la ely due o he backlog o eco dings and he ime spen wi h e e yday buisness. I guess she el ha she needed o gi e me a eminde . I was ac ually ou o he house when he call was eco ded. O i is possible ha hey can place he message di ec ly on o he message eco de wi hou ac uall placing he simula ed call. My hough is, I wonde how i would ha e wen , had I picked up he phone? I su e hope I ge ano he chance. b uceB uce Halliday To: EVP-ITC@yahoog oups.comF om: lisby@ea hlink.ne Da e: Tue, 25 Ma 2008 14:06:07 -0400Subjec : Re: [EVP-ITC] home phone answe ing maching EVPI' e always hoped o ge a call like his. Maybe some day, I shall.We e you close o you g andmo he ?AnnOn Ma 25, 2008, a 11:49 AM, bhali333 w o e:hey e e ybody,I ecie ed his a 8:30 AM his mo ning on my home elephone answe ing machine. I pos ed i in my main olde in he iles sec ion.I is he hi d message I ha e ecie ed in his ashion in all he yea s I ha e been in ol ed in he pa ano mal. his jus go s o show i you don' call hem hey will call you!b uceWa ch “Cause E ec ,” a show abou eal people making a eal di e ence. Lea n mo e."}