{"id": "8263", "subject": "Re: [EVP-ITC] An idea: random event generator based on alphabet", "author": "Stefan Bion", "timestamp": "2008-03-26T01:39:52Z", "full_text": "------------22BE14B2AD9992\r\nContent-Type: text/plain; charset=us-ascii\r\nContent-Transfer-Encoding: 7bit\r\n\r\nHi Misty, &quot;inner energy&quot;, all,\n\nmaybe one could feed the SpeakJet allophones into EVPmaker. The attached\nWAV file contains the 72 allophones of the SpeakJet chip. (I used\nAudition to cut them out of the sample clip which has been posted here\nrecently, and store them in a cue list.) To use this file as an EVPmaker\nsource, the &quot;Use Cue List&quot; option must be checked. I have done a few short\nsessions, and got this strange message:\n\n                &quot;I little Sir help you eclipse.&quot;\n\n(Doesn&#39;t make any sense to me... lol)\n\nOf course, this cannot replace a hardware version of SpeakJet, since\nEVPmaker isn&#39;t able to produce the proper transitions between the\nallophones. But maybe it&#39;s worth a try...\n\nStefan\n\n\n-- \n\n&gt; I used the phrase &quot;the quick brown fox jumped over the lazy dog&quot; in Stefan&#39;s evpmaker and have had interesting results including some live. I tried other pangrams (contain every letter of english\n&gt; alphabet) but the one I felt drawn to use was the one that has had the best results.\n   \n&gt;   No two sessions are ever alike and as background sound its easily modulated into quite complicated sentences and word structures.\n   \n&gt;   Misty\n\n&gt; inner energy &lt;innergy111@...&gt; wrote:\n&gt;           You know, i was thinking:\n&gt; If you could build a random event generator built on the spoken\n&gt; letters of the alphabet,\n&gt; that would definately be nice and very good.\r\n------------22BE14B2AD9992\r\nContent-Type: audio/wav; name=&quot;SJ-Allophones.wav&quot;\r\nContent-Disposition: attachment; filename=&quot;SJ-Allophones.wav&quot;\r\n\r\n[ Attachment content not displayed ]\r\n------------22BE14B2AD9992\r\nContent-Type: audio/mpeg; name=&quot;I little Sir help you eclipse.mp3&quot;\r\nContent-Disposition: attachment; filename=&quot;I little Sir help you eclipse.mp3&quot;\r\n\r\n[ Attachment content not displayed ]\r\n------------22BE14B2AD9992--"}