{"id": "828", "subject": "Re: new members", "author": "Guy", "timestamp": "2007-03-10T02:36:55Z", "full_text": "I don&#39;t know if I properly introduced myself. I&#39;m Guy \nJackson...presently residing in Huntington Beach, CA (THE Orange \nCounty...right next to LA) but I&#39;m originally from Illinois. I have \na BS in electrical engineering from the University of Illinois at \nChampaign (in the top 5 of engineering colleges) along with a \ncertificate in advanced software technologies from the University of \nCalifornia at Irvine. I&#39;ve worked in the technical industry for many \nyears now (including 2 1/2 years at the NASA Langley Research Center \nin Hampton, VA).\n\nI&#39;ve done independent research into many areas of consciousness for \nyears now: brain wave studies, biofeedback, hypnosis, shamanism, \nisolation tanks (the politically correct term now is floatation \ntank), etc. I joined several paranormal groups a little over 2 years \nago and volunteered to be the audio data coordinator for Paranormal \nResearch Investigations out of Anaheim, CA led by OOB researcher Al \nTaylor (wrote the book &quot;Soul Traveler&quot; and has been a long-time \nguest on Coast-To-Coast AM). I&#39;m a member of the AAEVP and gave my \nfirst public lectures on EVP at the first Ghost Fest on the Queen \nMary back in November. I&#39;ve been interviewed on APSR Paranormal Talk \nRadio, Haunted Voices Radio and C2C - AM.\n\nAt present - I&#39;m doing more study on acoustics and human \nlanguage/hearing along with psychic ability in order to extend my \nresearch interests in EVP (I actually use the term &quot;PSP&quot; for \nParanormal Sound Phenomena). I&#39;ve found some interesting things out \nwith respect to the infamous Spiricom, tracked down the apartment \nwhere Ray Bayless and Attila Von Szalay did the first organized \nresearch into EVP and have obtained copies of the &quot;first spirit \nvoices&quot; ever recorded and recordings of the sounds discovered in \nwhat I feel was the first time EVP was used in an alleged haunted \nlocation.\n\nWhew!\n\nProbably more than anyone wanted to know about me...\n\nGuy\n\n--- In EVP-ITC@yahoogroups.com, LON3_S7AR &lt;lon3_s7ar@...&gt; wrote:\n&gt;\n&gt; We just want to welcome everyone that has joined recently!\n&gt;   We are seeing alot of new members here.\n&gt;   Please feel free to introduce yourself and jump in on topics.\n&gt;   If you have any problems feel free to contact either Misty or \nmyself.\n&gt;    \n&gt;   Amy\n&gt;   LON3_S7AR@...\n&gt;   same on messenger too\n&gt; \n&gt; \n&gt; Amy Sutter \n&gt; \n&gt; www.myspace.com/LON3_S7AR\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Check me out!\n&gt;  \n&gt; ---------------------------------\n&gt; It&#39;s here! Your new message!\n&gt; Get new email alerts with the free Yahoo! Toolbar.\n&gt;"}