{"id": "8286", "subject": "Re: New file uploaded to EVP-ITC", "author": "Steve Hultay", "timestamp": "2008-03-26T14:30:16Z", "full_text": "Mike,\n\nI haven&#39;t done that personally, because i don&#39;t think that the \ncommunication is at the point to receive full sentences.  You get a \ncouple words here and there that we can piece together to make \nsomewhat of a sentence, but i don&#39;t believe anybody has reached that \nstage yet.  If i got a full sentence that would be great, but it \nprobably wouldn&#39;t be clear enough to post on the board.  If i have to \nexplain what it says to convince people to hear it, than it&#39; s \nprobably nothing.  When in doubt, throw the file out.  I try to form \nthe questions for the most part in Yes and No format, it seems they \ncan always respond with yes and no.  I do get other stuff that is \ngood, but i try and keep it simple for them.  And frank just sits \nback and listens without asking questions allowing them to get that \nmessage across.  I prefer to ask questions, because i know when to \nwait for a response.  The Skype session i had with my Joe&#39;s box last \nfriday with Juli and Joel was a great example of getting good \ncommunication.  We were getting answers to all our questions and \nthat &quot;Frank Sumption&quot; file was one of the clearest i have ever heard \ncome through my Joe&#39;s Box #2, which is now broken again.  Juli has \nall the audio and will post more as she goes through it for everybody \nto hear.\n\n-Steve H.\n\n\n\n--- In EVP-ITC@yahoogroups.com, Michael Edwards &lt;f1cracker75@...&gt; \nwrote:\n&gt;\n&gt; Hi Steve, hope all is well with you.\n&gt;    \n&gt;   From this site it appears that yourself, Frank, Bruce, and \nKristin and others I can not think of at the moment, have been \nengaged in contact as such that you ask a question and they give an \nanswer. Have any of you ever taken the info you receive from lets say \none spirit and tried to contact their living relative to give them a \ncopy of the recording? Have spirits asked you more experienced \nresearchers to do that, and if so, was the person you contacted \nindeed the correct loved one, and what was their response in you \ncontacting them?  I think this would be awesome to be able to serve \nas a messenger to the deceased\n&gt;    \n&gt;   Mike Edwards Cary NC\n&gt; \n&gt; Steve Hultay &lt;urkel23@...&gt; wrote:\n&gt;           I heard &quot;Help&quot; twice and than &quot;Lord&quot;. The second &quot;help&quot; \nis in the \n&gt; static white noise area after the first really clear one.\n&gt; \n&gt; -Steve H.\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, EVP-ITC@yahoogroups.com wrote:\n&gt; &gt;\n&gt; &gt; \n&gt; &gt; Hello,\n&gt; &gt; \n&gt; &gt; This email message is a notification to let you know that\n&gt; &gt; a file has been uploaded to the Files area of the EVP-ITC \n&gt; &gt; group.\n&gt; &gt; \n&gt; &gt; File : /Rhonda&#39;s Folder/help us laurie or lordy.mp3 \n&gt; &gt; Uploaded by : rhondak1973 &lt;rhondak1973@&gt; \n&gt; &gt; Description : dont know if Im hearing things..this was in between \n&gt; questions and answers.....sounds like help us lordy or \nlaurie....but \n&gt; need another ear plz. \n&gt; &gt; \n&gt; &gt; You can access this file at the URL:\n&gt; &gt; http://groups.yahoo.com/group/EVP-ITC/files/Rhonda%27s%\n&gt; 20Folder/help%20us%20laurie%20or%20lordy.mp3 \n&gt; &gt; \n&gt; &gt; To learn more about file sharing for your group, please visit:\n&gt; &gt; \n&gt; \nhttp://help.yahoo.com/l/us/yahoo/groups/original/members/web/index.htm\n&gt; lfiles\n&gt; &gt; \n&gt; &gt; Regards,\n&gt; &gt; \n&gt; &gt; rhondak1973 &lt;rhondak1973@&gt;\n&gt; &gt;\n&gt; \n&gt; \n&gt; \n&gt;                            \n&gt; \n&gt;        \n&gt; ---------------------------------\n&gt; Looking for last minute shopping deals?  Find them fast with Yahoo! \nSearch.\n&gt;"}