{"id": "834", "subject": "Re: The Intelligence Project Description...", "author": "Laura Kimberley", "timestamp": "2007-03-12T16:21:58Z", "full_text": "HI Guy, Welcome to the group! Your expertise will be valuable I am \nsure.\nI am also a memeber of AAEVP and I have been researching EVP&#39;s and \nDVR for several years now. I have come along way in my research and \nKnow of Dave and Frank and I believe they are serious and great \ncontibutors to research in this area of communication.  I am also a \nmember on the experimentors team at ITCBRIDGE.com  We are currently \nlooking for serious people to help in creating a bridge among our \ngroup and to go to a frequency and record live the communications  \nto set questions for a limited time frame. If you or anyone might be \ninterested you may add me and Texas frank from ITC Bridge from yahoo \nto your list. We are wanting to set up a conference thru yahoo, and \ndiscuss the plan. Please let me state that we need harmony and \npeople with a good set of ethics and morals to build this bridge for \ncontact and are willing to conribute their time and their essence \nfor higher levels of contact.  Blessings All.   Laura\n\n\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;Guy&quot; &lt;yzzzguy@...&gt; wrote:\n&gt;\n&gt; [Note: the project is complete so don&#39;t try to sign up]\n&gt; \n&gt; \n&gt; The Intelligence Project \n&gt; \n&gt; A Project involving EVP and Listening\n&gt; \n&gt; If you have done EVP for a while you will already know whether or \n&gt; not what you say is responded to sometimes - you will already know \n&gt; if there seems to be some sort of awareness there.\n&gt; \n&gt; You may believe this to be so, and so may I, but the world in \n&gt; general will just take this as further evidence of \n&gt; our &quot;deteriorating mental ability&quot;!\n&gt; \n&gt; You can&#39;t prove anything - all you can do is state your firm \nbelief \n&gt; and perhaps back that up with some examples which you hope don&#39;t \n&gt; sound too &quot;made-up&quot;.\n&gt; \n&gt; This project aims to deal with that situation once and for all.  \nWe \n&gt; believe in working with science rather than against it.  Science \nis \n&gt; not our enemy, nor indeed is scepticism.\n&gt; \n&gt; Method\n&gt; What we want to find out is if there is any relationship between \n&gt; what the experimenter says and the type of EVP responses that we \nget.\n&gt; \n&gt; We are looking for signs of intelligence.\n&gt; \n&gt; We want to do that in a measurable way - for that is the way of \n&gt; science.  And this is the way that has been approved by a major \n&gt; European pharmaceutical company for funding.\n&gt; \n&gt; We have six questions. These questions are decided on in advance.  \n&gt; \n&gt; During the experiment the experimenter asks each of the questions, \n&gt; in turn, with a 30-second gap after each question to allow any \n&gt; responses to be recorded. \n&gt; \n&gt; So (for example) what you would get is,\n&gt; \n&gt; Question &#39;What is the time?&#39; \n&gt; [30 seconds delay]; \n&gt; Question &#39;What is your name?&#39; \n&gt; [30 seconds delay], \n&gt; Question &#39;What do you like best?&#39;\n&gt; [30 second delay]\n&gt; and so on.\n&gt; \n&gt; Now if an utterance is heard within the 30-second period and if \nthe \n&gt; utterance sounds as though it could be a response to the question, \n&gt; then it is treated as an actual response.  For example if we hear \n&gt; the utterance &#39;John Smith&#39; seven seconds after the question &#39;What \nis \n&gt; your name?&#39; is asked, then that looks like a response to that \n&gt; question.\n&gt; \n&gt; The experimenter carries out the session, asking each of the \n&gt; questions in turn; and then the recording of the session is turned \n&gt; over to a speech analyst.\n&gt; \n&gt; The analyst picks out from the general background noise all the \n&gt; utterances he can find in the recording.  He refines his search \n&gt; still further by selecting out the 16 utterances of the best \n&gt; quality. (sometimes it will be less than 16), and &quot;shuffles&quot; these \n&gt; so that you will not know which came first, which came second and \nso \n&gt; on.\n&gt; \n&gt; The final 16 utterances, their order shuffled, are sent out to you.\n&gt; \n&gt; What you are asked to do is decide if any of the utterances could \nbe \n&gt; a response to any of the questions, and to fill in a table like \nthat \n&gt; shown in the example below.\n&gt; \n&gt; Track No.\tCould be a response to Question Number..\n&gt; BR01\t                               4\n&gt; BR02\t                               0\n&gt; BR03\t                               0\n&gt; BRO4\t                               3\n&gt; BR05\t                               1\n&gt; BR06\t                               2\n&gt; BR07\t                               3\n&gt; BRO8\t                               3\n&gt; BR09\t                               6\n&gt; BR10\t                               0\n&gt; BR11\t                               0\n&gt; BR12\t                               0\n&gt; BR13\t                               6\n&gt; BR14\t                               5\n&gt; BR15\t                               0\n&gt; BR16\t                               0\n&gt;  \n&gt; As you can see some utterances are not considered to be a response \n&gt; to any of the questions, and so a &#39;0&#39; is inserted at that point.  \n&gt; This is not an easy test, that is why you are being asked to help.\n&gt; \n&gt; Please send your results to XXX@... and then they will get put \n&gt; into our database - and in time we will be told the results.\n&gt; \n&gt; Meanwhile, however, preliminary results look quite promising  and \n&gt; your assistance on this vital project is very much appreciated!\n&gt; \n&gt; \n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n&gt; \n&gt; Guy\n&gt;"}