{"id": "8393", "subject": "An incident that may be a concern", "author": "bhali333", "timestamp": "2008-03-27T14:02:55Z", "full_text": "for all researchers,\n\nTHIS IS NOT FOR THE REASON OF PUSHING A PANIC BUTTON OR A MATTER OF \nGIVING IN TO FEAR. \n\nIt is simply an incident that I feel researchers should be aware of \nas a possibility. Given in my opinion the boxes do open a portal due \nto the connection necessary for real time two way communication, and \nthe wide spread belief that entities can and do manipulate physical \nobjects when in the presence of them.\n\nI have just been made aware of a situation that has happened to a \nfairly new researcher whom I believe to be honest and forthcoming.\n\nthe incident involved the aftermath of a regular RS box session. The \nresearcher had finished his session with the practice of asking that \nany entities that may have traveled through the box, return and asked \nfor conformation, then proceeded to end the session and turn the box \noff. he was assured that he turned the box off by going back to the \nrecording after the incident and validating verbally that he did in \nfact turn off the box.\n\nHe left the room for a few moments , when he returned he allegedly  \nwitnessed a white cloud move across the room and noticed that his RS \nbox was turned on and running.\n\nThis is actually the first instance I have encountered where the \npossibility of an entity that may have\n\npurposely stayed behind to turn the box back on and let other \nentities through. matter of fact\n\nthat concept has not occurred to me before. but now sounds very \npossible.\n\nThis may even happen at times we are never aware of and they actually \nturn the box on and when \nwhatever comes through is through they turn it off again and we are \nnone the wiser.\n\nI will definitely address this in my sessions, what I suggest is \nuntil we come to a mutual agreement among researchers\non this occurrence, I think it best that when we end a session we \nremove at least one battery from the box to prevent it being turned\nback on.\n\n\n\nBruce"}