{"id": "8407", "subject": "Re: [EVP-ITC] Blanket Announcement:  I&#39;ve posted files.  ;-)", "author": "Misty Dawn", "timestamp": "2008-03-27T17:33:21Z", "full_text": "--0-336557270-1206639201=:6249\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nThanks Margaret everyone appreciates this. I did get a chance today to go thru your files. I can hear all of the minibox, sweep, crowd babble, exactly as you do, the SJ method I hear some words as you do and some a bit different. I love the pictures, Ive visited your site before you joined here and have gone thru the gallery. It&#39;s quite impressive and interesting. Many remind me of what I have recieved using simliar methods.\n   \n  Great stuff!\n  Misty\n\nitcdeadpeople &lt;ITCdeadpeople@...&gt; wrote:\n          Rather than generating a gazillion separate notifications, I figured I would do this one single \nannouncement stating that I have posted a couple examples in each of my subfolders. There \nare two different types of ITC, and various EVP (MiniBox, manual radio sweep, traditional, \nPortuguese crowd babble, etc.) The files are pretty small, so I&#39;m not hogging up a lot space.\n\nI always enjoy listening to and seeing other people&#39;s examples. I&#39;m hoping others might \nenjoy some of my examples as well, especially my water video ITC results (which as far as I \nknow, I was the first to come up with this technique). Other people have tried it and gotten \nreally good results, so if you&#39;re looking for something new and fun to try, please give it a \nwhirl. \n\nI really appreciate all the inspiration I&#39;ve gotten from others. I&#39;m trying to give back a little. \n\n:0) Margaret\n\n\n\n                           \n\n       \n---------------------------------\nNever miss a thing.   Make Yahoo your homepage.\r\n--0-336557270-1206639201=:6249\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;div&gt;Thanks Margaret everyone appreciates this. I did get a chance today to go thru your files. I can hear all of the minibox, sweep, crowd babble, exactly as you do, the SJ method I hear some words as you do and some a bit different. I love the pictures, Ive visited your site before you joined here and have gone thru the gallery. It&#39;s quite impressive and interesting. Many remind me of what I have recieved using simliar methods.&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Great stuff!&lt;/div&gt;  &lt;div&gt;Misty&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;itcdeadpeople &lt;ITCdeadpeople@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/div&gt;  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt; \n &lt;div&gt;Rather than generating a gazillion separate notifications, I figured I would do this one single &lt;BR&gt;announcement stating that I have posted a couple examples in each of my subfolders. There &lt;BR&gt;are two different types of ITC, and various EVP (MiniBox, manual radio sweep, traditional, &lt;BR&gt;Portuguese crowd babble, etc.) The files are pretty small, so I&#39;m not hogging up a lot space.&lt;BR&gt;&lt;BR&gt;I always enjoy listening to and seeing other people&#39;s examples. I&#39;m hoping others might &lt;BR&gt;enjoy some of my examples as well, especially my water video ITC results (which as far as I &lt;BR&gt;know, I was the first to come up with this technique). Other people have tried it and gotten &lt;BR&gt;really good results, so if you&#39;re looking for something new and fun to try, please give it a &lt;BR&gt;whirl. &lt;BR&gt;&lt;BR&gt;I really appreciate all the inspiration I&#39;ve gotten from others. I&#39;m trying to give back a little. &lt;BR&gt;&lt;BR&gt;:0) Margaret&lt;BR&gt;&lt;BR&gt;&lt;/div&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;p&gt;&#32;\n\n      &lt;hr size=1&gt;Never miss a thing.  &lt;a href=&quot;http://us.rd.yahoo.com/evt=51438/*http://www.yahoo.com/r/hs&quot;&gt; Make Yahoo your homepage.&lt;/a&gt;\r\n--0-336557270-1206639201=:6249--"}