{"id": "8408", "subject": "Re: Blanket Announcement:  I&#39;ve posted files.  ;-)", "author": "itcdeadpeople", "timestamp": "2008-03-27T17:40:07Z", "full_text": "Thank you, Misty.  It&#39;s always amazing to me that those in spirit can use such a wide \nvariety of methods to communicate with us.  \n\nQuick question... what am I doing wrong that causes the text in my posts not to wrap \naround properly?  (if that&#39;s the correct terminology)  \n\n--- In EVP-ITC@yahoogroups.com, Misty Dawn &lt;bulletbabea@...&gt; wrote:\n&gt;\n&gt; Thanks Margaret everyone appreciates this. I did get a chance today to go thru your \nfiles. I can hear all of the minibox, sweep, crowd babble, exactly as you do, the SJ method \nI hear some words as you do and some a bit different. I love the pictures, Ive visited your \nsite before you joined here and have gone thru the gallery. It&#39;s quite impressive and \ninteresting. Many remind me of what I have recieved using simliar methods.\n&gt;    \n&gt;   Great stuff!\n&gt;   Misty\n&gt; \n&gt; itcdeadpeople &lt;ITCdeadpeople@...&gt; wrote:\n&gt;           Rather than generating a gazillion separate notifications, I figured I would do this \none single \n&gt; announcement stating that I have posted a couple examples in each of my subfolders. \nThere \n&gt; are two different types of ITC, and various EVP (MiniBox, manual radio sweep, \ntraditional, \n&gt; Portuguese crowd babble, etc.) The files are pretty small, so I&#39;m not hogging up a lot \nspace.\n&gt; \n&gt; I always enjoy listening to and seeing other people&#39;s examples. I&#39;m hoping others might \n&gt; enjoy some of my examples as well, especially my water video ITC results (which as far \nas I \n&gt; know, I was the first to come up with this technique). Other people have tried it and \ngotten \n&gt; really good results, so if you&#39;re looking for something new and fun to try, please give it \na \n&gt; whirl. \n&gt; \n&gt; I really appreciate all the inspiration I&#39;ve gotten from others. I&#39;m trying to give back a \nlittle. \n&gt; \n&gt; :0) Margaret\n&gt; \n&gt; \n&gt; \n&gt;                            \n&gt; \n&gt;        \n&gt; ---------------------------------\n&gt; Never miss a thing.   Make Yahoo your homepage.\n&gt;"}