{"id": "8445", "subject": "Re: [EVP-ITC] posted earlier_An incident that may be a concern", "author": "Carol B.", "timestamp": "2008-03-27T21:39:31Z", "full_text": "Bruce,\nI, for one, appreciate the post.  I am new to this research, but not new\nto paranormal investigations.  I can see where the stated content would be\nof a concern to many...including myself.  Actually, I had suspected that\nthis research may, indeed, create a passageway.  How could it not? \nAnyway, I thank you for the post.\n\nCarol B.\n\n\n\n\n\n\n\n\n\n\n\n&gt; okay, okay!\n&gt;\n&gt; Lets put this to bed here and now.\n&gt; My post was not about fear or the acknowledgment of it.\n&gt; It was about the concerns of a new researcher!\n&gt;\n&gt; And no matter what anyone&#39;s opinion is regarding the subject matter,\n&gt; including my own.\n&gt;\n&gt; The concern was real to the person that experienced it.\n&gt; I felt that he would appreciate me addressing it publicly on the forum\n&gt; on the chance that other &quot;NEW&quot; researchers may have similar concerns.\n&gt;\n&gt; It was just what I posted it as &quot;an incident that may be a concern&quot;\n&gt;\n&gt; It is not a matter of fear or pushing any buttons, it&#39;s a matter of\n&gt; knowledge.\n&gt; Even if that knowledge is important to only one individual, that does\n&gt; not make it any less important.\n&gt;\n&gt; We have to remember that a lot of the new researchers and people\n&gt; getting interested in this field is due to the recent surge of\n&gt; publicity that we have gotten and all may not be seasoned paranormal\n&gt; veterans and adopted the philosophy of staring down the negative\n&gt; aspects of the paranormal.\n&gt;\n&gt; And I don&#39;t think that their education from any experienced\n&gt; researcher should include, if you ignore it that means it does not\n&gt; exist or can not affect any aspect of what we are doing.\n&gt;\n&gt; I don&#39;t want to open this whole can of worms again.\n&gt; If a new person voices a concern, and all concerns deserve to be\n&gt; addressed for the benefit of who ever needs it.\n&gt;\n&gt; My opinion on it or post about a certain incident is not meant to be\n&gt; the word of god or carved in stone. It is just what it is\n&gt; an opinion or a simple statement.\n&gt;\n&gt; Bruce\n&gt;\n&gt;"}