{"id": "8449", "subject": "Re: listening to posts", "author": "itcdeadpeople", "timestamp": "2008-03-27T21:55:23Z", "full_text": "Hi Misty.  I was surprised at how much smaller my files became when I changed my \nsettings in Audacity to 16-bit MONO with an 11025Hz sample rate.   I figure this is voice \nwe are recording, not the symphony.  And in my case, I&#39;m not doing any kind of frequency \nanalysis, or anything else that requires super high quality files.  Files, in almost all cases, \nreally do not need to be 32-bit stereo with a 44100Hz sample rate.  But I know how hard \nit can be to convince some people of this.\n\nI do save my individual raw files on my drive in WAV format.  But if I&#39;m going to post, I \ncreate an MP3.  Even my WAV files are small though.  Just took a look, and with my \nsettings, a short WAV file runs about 88kb.  Converted to MP3 it becomes just 16kb.  I \nhave one that is 248kb in the raw, but after editing out unrelated content and exporting to \nMP3, it was just 24kb.  \n\nIf people would just record with the lower settings to begin with, I think they would be \nsurprised at the amount of quality which remains... not to discount how much of their own \nhard drive space will be saved.  I know a 1MB WAV file with the high settings becomes just \n20kb in MP3 format with the lower settings.    \n\nI visit another forum where the max file size for a single submission is 150kb.  A person is \nphysically unable to upload any file larger than that.  People have changed to the lower \nsettings in order to meet the file size restriction, and I can tell you that plenty of members \npost, and plenty of others hear and understand their examples just fine.  Hopefully some of \nthe members here will give the lower settings a try.  :0)\n\nMargaret\n\n--- In EVP-ITC@yahoogroups.com, Misty Dawn &lt;bulletbabea@...&gt; wrote:\n   \n&gt;   You guys really do have to start using mp3 versions tho we are at 90% full again so its \ngoing to come down to either some people wont be allowed to post files if they cant make \nthe transition, or all files will have to be deleted, or nobody will be able to post at all \nbecause there will be no space left. \n&gt;"}