{"id": "8479", "subject": "Re: New file uploaded to EVP-ITC", "author": "itcdeadpeople", "timestamp": "2008-03-28T15:45:48Z", "full_text": "Hi Kristin.  I can hear the &quot;yes it does&quot; part.  I looked up some of the meanings of the word \n&#39;portal&#39; and found this:\n\n&quot;A portal in fiction is a magical or technological doorway that connects two distant \nlocations.&quot;\n\nI suppose in this regard the &#39;ghost boxes&#39; or radios used in sweep with the intent of \ncommunication could be considered a portal of sorts, but if that is the case, then wouldn&#39;t \nour digital recorders (which can be used by those in spirit to produce EVP even when it is \nnot our intent) and televisions, camcorders, ordinary cameras, etc (used by those in spirit \nto show their images, again, with our without our intent) also be portals?  I recently got an \nEVP voicemail from my next door neighbor&#39;s mother, saying her name, and when reversed, \nthe message is &quot;I love you.&quot;  So I guess we&#39;d have to toss telephones and computers onto \nthe list as well.\n\nI think the truth is, those in spirit can (and do!) basically go wherever they want, whenever \nthey choose, and do not require our permission or our technology to do so.  The only thing \nthe technology does is allow us to be aware of their presence, which in many cases would \nhave gone by unnoticed, if not for our use of the equipment.  \n\nJust my thoughts on the subject.  :0)\n\nMargaret\n\n--- In EVP-ITC@yahoogroups.com, &quot;Kristin&quot; &lt;ckmorris95@...&gt; wrote:\n&gt;\n&gt; Hey guys -I sent a message that apparently got lost in the\n&gt; stratosphere but I sent this clip because I asked about the radio as a\n&gt; portal thing back in early March and I got a fairly definite\n&gt; affirmative answer on that.  But who knows.  I have have given\n&gt; completely opposing views before but it is something to chew on.\n&gt; k\n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, EVP-ITC@yahoogroups.com wrote:\n&gt; &gt;\n&gt; &gt; \n&gt; &gt; Hello,\n&gt; &gt; \n&gt; &gt; This email message is a notification to let you know that\n&gt; &gt; a file has been uploaded to the Files area of the EVP-ITC \n&gt; &gt; group.\n&gt; &gt; \n&gt; &gt;   File        : /Kristin&#39;s Files/Radio Portal.mp3 \n&gt; &gt;   Uploaded by : nitsirk65 &lt;ckmorris95@&gt; \n&gt; &gt;   Description : I asked if the radio was used as a portal and I\n&gt; received a pretty definate answer from them: EVERYTIME  BACK&FORTH\n&gt; TO&FROM BRING IT YES IT DOES  \n&gt; &gt; \n&gt; &gt; You can access this file at the URL:\n&gt; &gt;\n&gt; http://groups.yahoo.com/group/EVP-\nITC/files/Kristin%27s%20Files/Radio%20Portal.mp3\n&gt; \n&gt; &gt; \n&gt; &gt; To learn more about file sharing for your group, please visit:\n&gt; &gt;\n&gt; http://help.yahoo.com/l/us/yahoo/groups/original/members/web/index.htmlfiles\n&gt; &gt; \n&gt; &gt; Regards,\n&gt; &gt; \n&gt; &gt; nitsirk65 &lt;ckmorris95@&gt;\n&gt; &gt;\n&gt;"}