{"id": "8524", "subject": "Re: Got some great EVP Maker responses tonight.", "author": "itcdeadpeople", "timestamp": "2008-03-29T14:49:17Z", "full_text": "Thanks for listening and for the feedback, Stefan & Rees.  \n\nStefan, just a quick clarification ... I have removed the &#39;junk&#39; between my voice and the \nanswer.  If I&#39;m going to get an answer, it&#39;s usually between .5-7 or so seconds, and I \nusually note that in my description as I don&#39;t want to mislead people about the timing of \nthe response.  Still, I guess that can be considered a fairly immediate answer.  :0)\n\nMany times the program has run for about a minute without creating any clear phrases (I \nkeep each session under 2 minutes), relevant or otherwise.  I really like this fact, because \nin my opinion, it greatly reduces the chances of a false positive.  \n\nThank you so much for sharing your creativity and giving us researchers additional tools \nto experiment with!  This has been really fun and I plan to keep exploring the potential of \nyour software and the allophones file.\n\nMargaret\n\n--- In EVP-ITC@yahoogroups.com, Stefan Bion &lt;yahoogroups@...&gt; wrote:\n&gt;\n&gt; Hi Margret,\n&gt; \n&gt; wow, except for the part &quot;Hi Margret&quot; (which sounds for me phonetically\n&gt; like &quot;I horst it&quot; which of course makes no sense), I was able to hear\n&gt; everything perfectly. I&#39;m impressed by these clear and immediate\n&gt; answers. I didn&#39;t expect that this simple method would work so well for\n&gt; some experimenters.\n&gt; \n&gt; Stefan\n&gt; \n&gt; -- \n&gt; \n&gt; &gt; Just a quick note to let y&#39;all know I&#39;ve replaced the files in my EVP Maker folder with \nfour new \n&gt; &gt; ones from tonight.  I&#39;m very impressed with the responses/answers I am being given. \n&gt; \n&gt; &gt; I received a greeting, by name.  \n&gt; &gt; Confirmation when I asked if I&#39;d heard correctly.\n&gt; &gt; An object on my desk was correctly identified.\n&gt; &gt; An object in my left hand was correctly identified (with a unique interpretation of it!)\n&gt; \n&gt; &gt; http://tech.groups.yahoo.com/group/EVP-\nITC/files/Margaret%20Downey/SJ%20Allophones/\n&gt; \n&gt; &gt; I hope you can hear some of these.  I&#39;ve been working to gather examples which show \n&gt; &gt; relevance and intent of communication.  Arthur is on a roll.  LOL.  ;0)\n&gt;"}