{"id": "8525", "subject": "Re: An incident that may be a concern", "author": "LC Duplatt", "timestamp": "2008-03-29T14:56:35Z", "full_text": "Hello, Kristin...\n\nI guess when I think about &quot;portal,&quot; it really comes down to \nwhat &quot;their&quot; definition of the word is versus &quot;my&quot; definition.  \n\nThe word &quot;portal&quot; just means &quot;doorway.&quot;  Are these ITC \ndevices &quot;doorways&quot; between both worlds for communication?  Well, yes, \nin the sense that they serve as a &quot;bridge&quot; between worlds for \ncommunication purposes.  However, I truly struggle to think that \nspirits/ghosts can use this device to physically manifest in one&#39;s \nhome.  Heck, if we&#39;re hearing them, they are already around us, \nIMHO.  This is why when these devices goes to a highly active \nlocation, we record a bunch of stuff...they are already there. \n\nNow, I will say that I have been noticing that after doing spirit \nrescue with these devices, it seems more lost souls seem to be \nbrought for help.  We recently assisted two ghosts at an apartment, \nand believed the location to be cleared.  A week later, the owner \nrecords a female EVP asking, &quot;Help me,&quot; and little attention getters \nstarted happening again (lightbulbs &quot;popping&quot;, TVs turning on by \nthemselves, etc)  None of the sensitives/psychics or the spirit box \ndetected another spirit in need of help prior. I keep thinking that \nbenevolant spirits when they know we can help, will make desperate \nattempts to bring lost earthbound spirits for assistance. ;)\n\nLC\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;Kristin Morris&quot; &lt;ckmorris95@...&gt; \nwrote:\n&gt;\n&gt; Hi LC - I just posted a file where I asked them if the radio was \nused as a\n&gt; &#39;portal&#39; and I got a very definite answer from them.  EVERYTIME - \nBACK AND\n&gt; FORTH - TO AND FROM - YES IT DOES.\n&gt; \n&gt;  \n&gt; \n&gt; Now of course this could be false info - which has happened to me \nbefore..\n&gt; but it&#39;s something to chew on\n&gt; \n&gt; k\n&gt; \n&gt;  \n&gt; \n&gt;   _____  \n&gt; \n&gt; From: EVP-ITC@yahoogroups.com [mailto:EVP-ITC@yahoogroups.com] On \nBehalf Of\n&gt; LC Duplatt\n&gt; Sent: Friday, March 28, 2008 7:31 AM\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Subject: [EVP-ITC] Re: An incident that may be a concern\n&gt; \n&gt;  \n&gt; \n&gt; Hey, I&#39;d look at this (if true) as something positive and not \n&gt; something to fear. A white cloud to me sounds like &quot;light&quot; and just \n&gt; may be a good spirit/entity or whoever, in the home. How do we know \n&gt; that this was a negative spirit/ghost trying to bring others \nthrough \n&gt; an electronic device and into a home for mischief??? ;)\n&gt; \n&gt; I personally do not subscribe to the whole portal thing. If so, \nthen \n&gt; my house would be filled with ghosts after all my watching of \n&gt; innumerable paranormal TV shows! I think my TV would make a much \n&gt; better portal than my radios... :)\n&gt; \n&gt; LC\n&gt; http://www.AngelsGh &lt;http://www.AngelsGhosts.com&gt; osts.com\n&gt; \n&gt; --- In EVP-ITC@yahoogroups &lt;mailto:EVP-ITC%40yahoogroups.com&gt; .com,\n&gt; &quot;bhali333&quot; \n&gt; &lt;paranormalinvestigating@&gt; wrote:\n&gt; &gt;\n&gt; &gt; for all researchers,\n&gt; &gt; \n&gt; &gt; THIS IS NOT FOR THE REASON OF PUSHING A PANIC BUTTON OR A MATTER \nOF \n&gt; &gt; GIVING IN TO FEAR. \n&gt; &gt; \n&gt; &gt; It is simply an incident that I feel researchers should be aware \nof \n&gt; &gt; as a possibility. Given in my opinion the boxes do open a portal \n&gt; due \n&gt; &gt; to the connection necessary for real time two way communication, \n&gt; and \n&gt; &gt; the wide spread belief that entities can and do manipulate \nphysical \n&gt; &gt; objects when in the presence of them.\n&gt; &gt; \n&gt; &gt; I have just been made aware of a situation that has happened to a \n&gt; &gt; fairly new researcher whom I believe to be honest and forthcoming.\n&gt; &gt; \n&gt; &gt; the incident involved the aftermath of a regular RS box session. \n&gt; The \n&gt; &gt; researcher had finished his session with the practice of asking \n&gt; that \n&gt; &gt; any entities that may have traveled through the box, return and \n&gt; asked \n&gt; &gt; for conformation, then proceeded to end the session and turn the \n&gt; box \n&gt; &gt; off. he was assured that he turned the box off by going back to \nthe \n&gt; &gt; recording after the incident and validating verbally that he did \nin \n&gt; &gt; fact turn off the box.\n&gt; &gt; \n&gt; &gt; He left the room for a few moments , when he returned he \nallegedly \n&gt; &gt; witnessed a white cloud move across the room and noticed that his \n&gt; RS \n&gt; &gt; box was turned on and running.\n&gt; &gt; \n&gt; &gt; This is actually the first instance I have encountered where the \n&gt; &gt; possibility of an entity that may have\n&gt; &gt; \n&gt; &gt; purposely stayed behind to turn the box back on and let other \n&gt; &gt; entities through. matter of fact\n&gt; &gt; \n&gt; &gt; that concept has not occurred to me before. but now sounds very \n&gt; &gt; possible.\n&gt; &gt; \n&gt; &gt; This may even happen at times we are never aware of and they \n&gt; actually \n&gt; &gt; turn the box on and when \n&gt; &gt; whatever comes through is through they turn it off again and we \nare \n&gt; &gt; none the wiser.\n&gt; &gt; \n&gt; &gt; I will definitely address this in my sessions, what I suggest is \n&gt; &gt; until we come to a mutual agreement among researchers\n&gt; &gt; on this occurrence, I think it best that when we end a session we \n&gt; &gt; remove at least one battery from the box to prevent it being \nturned\n&gt; &gt; back on.\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; Bruce\n&gt; &gt;\n&gt;"}