{"id": "8528", "subject": "Re: Anybody getting &#39;helper&#39; names from EVP Maker?", "author": "itcdeadpeople", "timestamp": "2008-03-29T16:31:54Z", "full_text": "Hi Bruce.  The reason I asked about the techs is, my normal guys are David & Patrick, and \na woman whose name I&#39;ve never been told.  They come through on the MiniBox or manual \nradio sweep.  It seems I have a different tech group (five people) when I work with more \ntraditional EVP methods, which I discovered nearly three years ago.   \n\nI thought it interesting to have someone named Arthur come through via EVPM, as the \nname is new to me.  I&#39;ve long suspected that perhaps different groups assist with different \ntechnologies.  For instance, I have one team that seems to be unique to my work with light \n(phototransistor modified recorder and battery operated plasma globe combo.)\n\nI&#39;m not sure what you mean by &quot;come up with the answer, backed up by a file.&quot;  \n\nMargaret\n\n--- In EVP-ITC@yahoogroups.com, bruce halliday &lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; \n&gt; Margaret,\n&gt;  \n&gt; I have had the same two techs since I began this research.\n&gt; Mike and Lisa, we built a very strong and trusting relationship.\n&gt; Within about the last month I have hardly heard from mike and received \n&gt; numerous message that lead ME to believe he has moved on, either to\n&gt; help less experienced researchers or to a higher spiritual level.\n&gt;  \n&gt; There is definitely a restructuring of the techs and guides going on.\n&gt; I am not the only researcher experiencing this phenomenon.\n&gt;  \n&gt; I still however receive messages from Lisa in every box session.\n&gt; To answer your original question, given the fact that I have only done 2 EVPM sessions \n&gt; No I have not received any conformation of either of my techs, and of course with the \n&gt; nature of the robotic sound that the EVPM file omits, Recognisable voice tones or \npatterns\n&gt; are not possible.\n&gt;  \n&gt; But the experiments continue, and hopefully one of us will come up with the answer, \nbacked\n&gt; up by a file.\n&gt;  \n&gt; Bruce\n&gt; Bruce Halliday \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: ITCdeadpeople@...: Sat, 29 Mar 2008 03:49:39 +0000Subject: [EVP-\nITC] Anybody getting &#39;helper&#39; names from EVP Maker?\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Hi All. I&#39;m wondering if anyone else has received a &#39;tech&#39; or &#39;helper&#39; name(s) while using \nEVP Maker?Just thought I&#39;d toss this out there.... Last night I asked who was speaking \nusing the EVP Maker and SJ Allophones combo, and received the direct answer, &quot;Arthur.&quot; \nThat&#39;s a bit short for my preference, as I like to rule out coincidence, but there was a \nfollowup statement made in the same session which surprised me, &quot;Arthur can help you.&quot; I \nthink when using sweep and similar techniques that relevance to session content is really \nimportant as an aid in ruling our false positives, so this followup comment helped sway \nme toward the possibility of this having been intentional communication. It&#39;s been \nfascinating to work with this combination the last couple of days!Margaret \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Windows Live Hotmail is giving away Zunes.\n&gt; http://www.windowslive-hotmail.com/ZuneADay/?locale=en-\nUS&ocid=TXT_TAGLM_Mobile_Zune_V3\n&gt;"}