{"id": "8530", "subject": "Re: Anybody getting &#39;helper&#39; names from EVP Maker?", "author": "itcdeadpeople", "timestamp": "2008-03-29T18:01:45Z", "full_text": "Thanks for the clarification, Bruce.  I&#39;ll let y&#39;all know if I hear anything.  The only thing I&#39;ve \nreceived that is even remotely close is, I was recently told one night that Patrick wasn&#39;t \nthere, and when I asked where he was, I was told, &quot;Not his schedule.&quot;  Which I thought was \na pretty interesting comment.\n\nMargaret\n\n--- In EVP-ITC@yahoogroups.com, bruce halliday &lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; \n&gt; Hi Margaret,\n&gt;  \n&gt; What I meant was, through all of us doing research, someone or a number of us are \nbound to receive\n&gt; a message or messages that will explain what and if there is an explanation for the tech \nturmoil some\n&gt; have been experiencing including myself. And that the answers and or messages will \nmost likely be recorded \n&gt; by the researchers so we can collaborate them and come up with a generally accepted \ntheory.\n&gt;  \n&gt; Bruce\n&gt; Bruce Halliday \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: ITCdeadpeople@...: Sat, 29 Mar 2008 16:31:54 +0000Subject: [EVP-\nITC] Re: Anybody getting &#39;helper&#39; names from EVP Maker?\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Hi Bruce. The reason I asked about the techs is, my normal guys are David & Patrick, \nand a woman whose name I&#39;ve never been told. They come through on the MiniBox or \nmanual radio sweep. It seems I have a different tech group (five people) when I work with \nmore traditional EVP methods, which I discovered nearly three years ago. I thought it \ninteresting to have someone named Arthur come through via EVPM, as the name is new to \nme. I&#39;ve long suspected that perhaps different groups assist with different technologies. \nFor instance, I have one team that seems to be unique to my work with light \n(phototransistor modified recorder and battery operated plasma globe combo.)I&#39;m not \nsure what you mean by &quot;come up with the answer, backed up by a file.&quot; Margaret--- In \nEVP-ITC@yahoogroups.com, bruce halliday &lt;paranormalinvestigating@&gt; wrote:&gt;&gt; &gt; \nMargaret,&gt; &gt; I have had the same two techs since I began this research.&gt; Mike and Lisa, \nwe built a very strong and trusting relationship.&gt; Within about the last month I have \nhardly heard from mike and received &gt; numerous message that lead ME to believe he has \nmoved on, either to&gt; help less experienced researchers or to a higher spiritual level.&gt; &gt; \nThere is definitely a restructuring of the techs and guides going on.&gt; I am not the only \nresearcher experiencing this phenomenon.&gt; &gt; I still however receive messages from Lisa \nin every box session.&gt; To answer your original question, given the fact that I have only \ndone 2 EVPM sessions &gt; No I have not received any conformation of either of my techs, \nand of course with the &gt; nature of the robotic sound that the EVPM file omits, \nRecognisable voice tones or patterns&gt; are not possible.&gt; &gt; But the experiments continue, \nand hopefully one of us will come up with the answer, backed&gt; up by a file.&gt; &gt; Bruce&gt; \nBruce Halliday &gt; &gt; &gt; To: EVP-ITC@: ITCdeadpeople@: Sat, 29 Mar 2008 03:49:39 \n+0000Subject: [EVP-ITC] Anybody getting &#39;helper&#39; names from EVP Maker?&gt; &gt; &gt; &gt; &gt; Hi \nAll. I&#39;m wondering if anyone else has received a &#39;tech&#39; or &#39;helper&#39; name(s) while using EVP \nMaker?Just thought I&#39;d toss this out there.... Last night I asked who was speaking using \nthe EVP Maker and SJ Allophones combo, and received the direct answer, &quot;Arthur.&quot; That&#39;s a \nbit short for my preference, as I like to rule out coincidence, but there was a followup \nstatement made in the same session which surprised me, &quot;Arthur can help you.&quot; I think \nwhen using sweep and similar techniques that relevance to session content is really \nimportant as an aid in ruling our false positives, so this followup comment helped sway \nme toward the possibility of this having been intentional communication. It&#39;s been \nfascinating to work with this combination the last couple of days!Margaret &gt; &gt; &gt; &gt; &gt; &gt; &gt; \n__________________________________________________________&gt; Windows Live Hotmail is \ngiving away Zunes.&gt; http://www.windowslive-hotmail.com/ZuneADay/?locale=en-\nUS&ocid=TXT_TAGLM_Mobile_Zune_V3&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Test your Star IQ\n&gt; http://club.live.com/red_carpet_reveal.aspx?icid=redcarpet_HMTAGMAR\n&gt;"}