{"id": "8540", "subject": "Re: [EVP-ITC Hacked my12-469", "author": "itcdeadpeople", "timestamp": "2008-03-29T23:38:34Z", "full_text": "Hi Kay.  All you have to do is plug in an external speaker, setup your computer to record \n(plug in mic, open up software and start recording - I use Audacity) turn on the radio and \nget the scan going, then start talking like you would if you were on the phone to a friend \n(but give a little extra time for them to answer).  \n\nYou can open the conversation with something like, &quot;Can you hear me?&quot; or &quot;Can anybody \nuse this radio to speak to me?&quot; or you can try asking for someone specific.  \n\nAfter you are done, close the conversation (again, like you might do if you were on the \nphone wrapping up the conversation with a friend), stop the recording, stop the radio, and \ngo back and listen for responses.  If you think you hear something &#39;real-time&#39; during your \nsession, repeat what you think you heard, so that interaction is recorded.  \n\nHave fun!  Margaret\n\n--- In EVP-ITC@yahoogroups.com, psfponies &lt;psfponies@...&gt; wrote:\n&gt;\n&gt; Well I went yesterday after work and picked up a RS12-469. Did the hack this afternoon \nsurprising simple!! So if anyone can please help me with what else I need to get started I \nwould appreciate it.  I do have some PC speakers and a small microphone to use. Not sure \nhow to set it up.\n&gt;    \n&gt;   Thanks \n&gt;   Kay\n&gt; \n&gt; Wiliam Clarke &lt;reesclarke_69@...&gt; wrote:\n&gt;             For me it was the 12-469, It has worked well with me.  I did buy a 20-125, and \nhacked it correctly, and I didn&#39;t like it.  I also didn&#39;t get very much reception.  The 20-125 \nhas a long anntena, and the 12-469 you can hold it in your hand, and you act as the \nanntena.  That way you get better reception.  Only problem with the 12-469 is that it \nclicks a little, but I can&#39;t hear it anymore.  I train not to hear it.\n&gt;    \n&gt;   Later \n&gt;   Rees\n&gt; \n&gt; psfponies &lt;psfponies@...&gt; wrote:\n&gt;         I am looking at getting either the 12-469 or 20-125. Which would be the best to \nget for someone who is just starting out. I will be doing the Hack myself with a little help \nand instructions. I want to get something fairly easy to hack and use for a beginner.\n&gt;   Thanks\n&gt;   Kay\n&gt; \n&gt; Wiliam Clarke &lt;reesclarke_69@...&gt; wrote:\n&gt;     Radio Shack FM/AM Radio 12-469 or 20-125\n&gt; \n&gt; Wiliam Clarke &lt;reesclarke_69@...&gt; wrote:\n&gt;         Radio Shack 12-469, 20-125 then you would have to modifiy it.  Some peps here \ncan tell you how to do it, or you can go to ufogeek.com, and watch a video on how to do \nit.\n&gt;    \n&gt;   Rees\n&gt; \n&gt; darkstarwolf2002 &lt;darkstarwolf2002@...&gt; wrote:\n&gt;       been camping and reading post\n&gt; \n&gt; I am the founder Of Trinity Paranormal&#39;s Western Oregon Chapter. I am \n&gt; very interested in experimenting with a box on our investigations.. how \n&gt; would a person get one??? yeh probly a lame question lol.\n&gt; \n&gt; \n&gt; \n&gt; \n&gt;     \n&gt; ---------------------------------\n&gt;   Looking for last minute shopping deals? Find them fast with Yahoo! Search.   \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;     \n&gt; ---------------------------------\n&gt;   Never miss a thing. Make Yahoo your homepage. \n&gt; \n&gt;     \n&gt; ---------------------------------\n&gt;   Looking for last minute shopping deals? Find them fast with Yahoo! Search.   \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;     \n&gt; ---------------------------------\n&gt;   Never miss a thing. Make Yahoo your homepage.  \n&gt; \n&gt; \n&gt;        \n&gt; ---------------------------------\n&gt; Never miss a thing.   Make Yahoo your homepage.\n&gt;"}