{"id": "8551", "subject": "45-sec condensed EVPM conversation", "author": "itcdeadpeople", "timestamp": "2008-03-30T06:14:14Z", "full_text": "I&#39;m not sure how to post this one.  You&#39;ll probably have to follow the text below in order to \nbetter understand the content.  This is in the SJ Allophones folder under Margaret Downey, \nand the clip is titled ConvoWIthArthur.mp3  (link at the end of the post - I think if you cut \nand paste, to open the file in another window,  you&#39;ll be able to follow the text written \nhere)\n\nI ran a bunch of short sessions tonight (about 20 seconds each) asking a question, \nlistening for the answer, then going onto the next based on what I heard previously. Most \nof these answers came very quickly. I have removed all of the non-relevant sound between \nQ&A, but very little has been modified in the answering phrase itself (just made them so it \ndidn&#39;t sound like a stutter.)  Parts 4, 5, 6, and 7 were from a single session, because I was \nhearing the answer real-time, but not understanding it.  I thought Arthur was trying to tell \nme specifically what kid of pet.  Likewise, the last 2 parts were together in one session.\n\nI have lowered my voice to hopefully make the responses more clear. I&#39;m working to \nestablish whether or not there is any indication of probable intentional communication \ntaking place. So far, I&#39;d say there are very strong indicators.  \n\nCan you say A.B.C.?\n&quot;A.B.C.D.E.&quot;  (this answer is sort of buried in the main sound)\n\nHow about Tom Butler?\n&quot;Tom Butler.&quot;\n\nDo you know the name of either of Tom Butler&#39;s cats?\n&quot;(Sh)asta&#39;s their cat.&quot; (the &quot;Sh&quot; sound is weak or missing)\n\nDo you have any pets?\n&quot;I have a pet.&quot;\n\nI heard you say I have a...?\n&quot;Pet.&quot;\n\nYou have a what?\n&quot;Pet.&quot;\n\nWhat kind of pet do you have?\n&quot;An animal.&quot; (LOL- ask a silly question, get a silly answer!)\n\nI understand you have a pet animal, but what is the species?\n&quot;A purple deer.&quot;\n\nOK, I could have sworn you said you have a purple deer.\n&quot;I told you purple deer.&quot; \n\nOK, I&#39;m gonna close for the evening.  Can you tell me goodbye?\n&quot;I love you.&quot;\n\nI heard you say I love you.  Love you too.\n&quot;Thank you.&quot;\n\nThe speed for this session was set on 106%, which is a little too fast for listening on \nplayback, but I get good responses with the setting.  I have slowed the tempo on the \nanswers by -18 in order to make them just a little clearer.  :-)\n\nhttp://f1.grp.yahoofs.com/v1/UB7vR4SGM4e8XM8JsTI-zUFjp0ELWi_d0cgCwV-\npdi39E_RQq1-\n7PSmvtA7pEVOD0V0eJQJOfnFdmcyDVHcnSJBiWzggVviQ7qOcjA/Margaret%20Downey/SJ%2\n0Allophones/ConvoWithArthur.mp3"}