{"id": "8552", "subject": "Re: New file uploaded to EVP-ITC", "author": "itcdeadpeople", "timestamp": "2008-03-30T06:40:37Z", "full_text": "Hi Stefan and Steve.  The closest thing I&#39;ve gotten to an answer from &quot;Arthur&quot; about how \nthis is working is the words &#39;air&#39; or &#39;air-to-air.&#39;  This makes little sense to me, unless there \nis some type of additional manipulation taking place acoustically, because I am not \nrecording in a closed environment.  I am playing the file from EVP Maker using an external \nspeaker and recording using the built-in mic of my MAC. \n\nI have no idea, what, if any difference this might make in terms of opportunity for &#39;them&#39; to \nspeak intelligent phrases.  Just thought I&#39;d share what I&#39;m hearing.  I&#39;ll keep asking, and \ntrying to get a clearer explanation of the process (though I&#39;ve never had much luck with \nthat in the past, in regard to getting explanations for the mechanics of any other \ntechnique!)  \n\nMargaret\n\n--- In EVP-ITC@yahoogroups.com, Stefan Bion &lt;yahoogroups@...&gt; wrote:\n&gt;\n&gt; Hi Steve,\n&gt; \n&gt; &gt; The inputed file is just tones, how are they creating words and\n&gt; &gt; sentences?  Does anybody have a logical explanation yet?  Energy \n&gt; &gt; fields, Conincidence...etc.\n&gt; \n&gt; Well, there are a lot of explanations for this, but none of them has\n&gt; been proven yet (afaik). I tend to the &quot;synchronicity&quot; explanation - at\n&gt; least when pure logical devices such as computers are used, which I\n&gt; believe can&#39;t be influenced mentally, neither by spirits nor by humans\n&gt; (otherwise they would probably crash more often than already without\n&gt; such a manipulation). ;)\n&gt; \n&gt; I think that causal models aren&#39;t sufficient to explain EVP. If no\n&gt; devices are influenced directly, there must be taking place some other\n&gt; form of &quot;manipulation&quot;. Perhaps the &quot;probability field&quot; is manipulated\n&gt; somehow in cases where random number generators (RNG) are involved? As\n&gt; we know from psychokinesis experiments in parapsychological labs, test\n&gt; persons were able to get &quot;hits&quot; even when &quot;prerecorded targets&quot; are used\n&gt; instead of a RNG. It seems that time and causality doesn&#39;t matter in\n&gt; respect to paranormal phenomena.\n&gt; \n&gt; Stefan\n&gt;"}