{"id": "8573", "subject": "Re: 45-sec condensed EVPM conversation", "author": "itcdeadpeople", "timestamp": "2008-03-30T19:38:01Z", "full_text": "Hi Stefan.  Thanks for listening.  I figured at this point, the closest to a two-way \nconversation I could get would be to shorten the time between listening to what has been \nsaid.  \n\nThe purple deer comment made me laugh too (by they way, Arthur told me purple deer eat \napples - LOL), and the way he repeated, &quot;I told you purple deer&quot; made me laugh too ... I \nwondered if perhaps he&#39;d gotten a little frustrated with me.\n\nYes, that is the correct name of Tom&#39;s cat (though not well enunciated) and I&#39;ve forwarded \nthe clip to him, but I know he gets a ton a email so it may take a short while to hear back.\n\nI&#39;m wondering the same thing about the techs.  It would certainly make sense for them to \nhave specialty areas, but still know each other (much like it works in our world).  Patrick \nand David also use the MiniBox.  What I&#39;m wondering, and will try next, is to see of Arthur \ncan use the manual sweep.  \n\nI&#39;ll keep you posted.  :-)\n\nMargaret \n\n--- In EVP-ITC@yahoogroups.com, Stefan Bion &lt;yahoogroups@...&gt; wrote:\n&gt;\n&gt; Hi Margret,\n&gt; \n&gt; very cool; if you hadn&#39;t written that it&#39;s a compilation of several\n&gt; single short sessions, one could really get the impression of a\n&gt; continuing live conversation. :)\n&gt; \n&gt; Again I had to laugh about their sense of humor when they mentioned the\n&gt; &#39;purple deer&#39;, and that it was repeated clearly shows that it was not\n&gt; only a product of chance.\n&gt; \n&gt; Is the name of Tom&#39;s cat correct? Did you send the recording to him?\n&gt; \n&gt; However, what makes me wonder, and what I didn&#39;t expect is that certain\n&gt; spirits do apparently communicate only over certain methods - in your\n&gt; case &#39;Arthur&#39; over EVPmaker, and &#39;David&#39; and your tech team over the\n&gt; manual sweep method. Any possible explanation for this? Perhaps those on\n&gt; the &#39;other side&#39; aren&#39;t &#39;allround techs&#39; but only &#39;specialists&#39; for\n&gt; certain methods?\n&gt; \n&gt; Stefan\n&gt; \n&gt; -- \n&gt; \n&gt; am 30.03.2008 um 08:14 Uhr schriebst Du (u.a.):\n&gt; am 30.03.2008 um 08:14 Uhr schrieben Sie (u.a.):\n&gt; \n&gt; &gt; I&#39;m not sure how to post this one.  You&#39;ll probably have to follow the text below in \norder to \n&gt; &gt; better understand the content.  This is in the SJ Allophones folder under Margaret \nDowney, \n&gt; &gt; and the clip is titled ConvoWIthArthur.mp3  (link at the end of the post - I think if you \ncut \n&gt; &gt; and paste, to open the file in another window,  you&#39;ll be able to follow the text written \n&gt; &gt; here)\n&gt; \n&gt; &gt; I ran a bunch of short sessions tonight (about 20 seconds each) asking a question, \n&gt; &gt; listening for the answer, then going onto the next based on what I heard previously. \nMost \n&gt; &gt; of these answers came very quickly. I have removed all of the non-relevant sound \nbetween \n&gt; &gt; Q&A, but very little has been modified in the answering phrase itself (just made them \nso it \n&gt; &gt; didn&#39;t sound like a stutter.)  Parts 4, 5, 6, and 7 were from a single session, because I \nwas \n&gt; &gt; hearing the answer real-time, but not understanding it.  I thought Arthur was trying \nto tell \n&gt; &gt; me specifically what kid of pet.  Likewise, the last 2 parts were together in one \nsession.\n&gt; \n&gt; &gt; I have lowered my voice to hopefully make the responses more clear. I&#39;m working to \n&gt; &gt; establish whether or not there is any indication of probable intentional \ncommunication \n&gt; &gt; taking place. So far, I&#39;d say there are very strong indicators.  \n&gt; \n&gt; &gt; Can you say A.B.C.?\n&gt; &gt; &quot;A.B.C.D.E.&quot;  (this answer is sort of buried in the main sound)\n&gt; \n&gt; &gt; How about Tom Butler?\n&gt; &gt; &quot;Tom Butler.&quot;\n&gt; \n&gt; &gt; Do you know the name of either of Tom Butler&#39;s cats?\n&gt; &gt; &quot;(Sh)asta&#39;s their cat.&quot; (the &quot;Sh&quot; sound is weak or missing)\n&gt; \n&gt; &gt; Do you have any pets?\n&gt; &gt; &quot;I have a pet.&quot;\n&gt; \n&gt; &gt; I heard you say I have a...?\n&gt; &gt; &quot;Pet.&quot;\n&gt; \n&gt; &gt; You have a what?\n&gt; &gt; &quot;Pet.&quot;\n&gt; \n&gt; &gt; What kind of pet do you have?\n&gt; &gt; &quot;An animal.&quot; (LOL- ask a silly question, get a silly answer!)\n&gt; \n&gt; &gt; I understand you have a pet animal, but what is the species?\n&gt; &gt; &quot;A purple deer.&quot;\n&gt; \n&gt; &gt; OK, I could have sworn you said you have a purple deer.\n&gt; &gt; &quot;I told you purple deer.&quot; \n&gt; \n&gt; &gt; OK, I&#39;m gonna close for the evening.  Can you tell me goodbye?\n&gt; &gt; &quot;I love you.&quot;\n&gt; \n&gt; &gt; I heard you say I love you.  Love you too.\n&gt; &gt; &quot;Thank you.&quot;\n&gt; \n&gt; &gt; The speed for this session was set on 106%, which is a little too fast for listening on \n&gt; &gt; playback, but I get good responses with the setting.  I have slowed the tempo on the \n&gt; &gt; answers by -18 in order to make them just a little clearer.  :-)\n&gt; \n&gt; &gt; http://f1.grp.yahoofs.com/v1/UB7vR4SGM4e8XM8JsTI-zUFjp0ELWi_d0cgCwV-\n&gt; &gt; pdi39E_RQq1-\n&gt; &gt; \n7PSmvtA7pEVOD0V0eJQJOfnFdmcyDVHcnSJBiWzggVviQ7qOcjA/Margaret%20Downey/SJ%2\n&gt; &gt; 0Allophones/ConvoWithArthur.mp3\n&gt; \n&gt; \n&gt; \n&gt; &gt; ------------------------------------\n&gt; \n&gt; &gt; Yahoo! Groups Links\n&gt;"}