{"id": "8595", "subject": "Re: New Member", "author": "itcdeadpeople", "timestamp": "2008-03-30T20:59:08Z", "full_text": "Hi Jeremy.  Sometimes it&#39;s hard to know who is communicating with us.\n\nIf you are using tape, it is recommended that you use the cassette only once, and some \nsay only use one side.  That can get pretty expensive.  I don&#39;t really have any experience \nwith tape, as all my recorders are digital, however,  I have cassettes from a sitting with a \nmedium (which the medium recorded for me) and there was EVP on it, both sides, when I \ngot him and listened back!  :0)\n\nMargaret\n\n--- In EVP-ITC@yahoogroups.com, &lt;JeremyRobertHuber@...&gt; wrote:\n&gt;\n&gt; Hello Everyone,\n&gt; \n&gt; I have recently started doing EVP/ITC research.\n&gt; \n&gt; I am using a regular cassette tape recorder for now. It has a built in microphone.\n&gt; \n&gt; So far I have gotten two different voices. \n&gt; \n&gt; Both of them are easily heard without the headphones on my tape recorder.\n&gt; \n&gt; Before I start recording I always say a prayer of protection and ask if any one wants to \ncommunicate with me, but that they must come in love, light and peace, etc.\n&gt; \n&gt; The first voice that I received was a male voice that said &quot;Peace.&quot;\n&gt; \n&gt; The second voice that I received was a female voice. I had asked if there were any Spirits \nhere that would like to talk to me. She said, &quot;No, no Spirits.&quot; Then someone walking, (I \npresume her) with very audible footsteps with heels are heard. \n&gt; \n&gt; My thoughts are that maybe she isn&#39;t aware that she has died or that she is an Angelic \npresence of some sort that never took birth. \n&gt; \n&gt; I don&#39;t know if anyone has read Mark Macy&#39;s book &quot;Miracles In The Storm&quot;, but it is \ngreat. I also enjoyed Sara Estep&#39;s book &quot;Voices Of Eternity&quot;, which is available free online. \nhttp://aaevp.com/voices_of_eternity_web.pdf\n&gt; \n&gt; Blessings ALL,\n&gt; \n&gt; Jeremy Robert Huber\n&gt; New York, New York\n&gt;"}