{"id": "8597", "subject": "Re: New file uploaded to EVP-ITC", "author": "itcdeadpeople", "timestamp": "2008-03-30T21:12:28Z", "full_text": "Hi Stefan.  Thank you for sharing your observations.  This would be in line with the \nexperimental indications of traditional EVP being formed inside the unit, as evidenced by \ndigital recorders which have had their internal mic removed, yet can still record voice.  \n\nI started thinking about acoustics when I jumped into the world of radio sweep.  I noted a \nbig difference between sweep and traditional EVP, in that with traditional EVP methods, it \nis quite rare for the same EVP to be heard at the same time when multiple recorders are \nrunning simultaneously.  However, with sweep, I have noticed that multiple units will \nindeed pick up the same messages, and in fact, when I have blended the tracks from the \ntwo separate units, the message at times was even clearer.  \n\nPerhaps in the case of sweep and the like, the manipulation is actually taking place inside \nthe radio, just as appears to be the case with various recorders in traditional EVP?  Since \nthe same thing is heard on multiple units with sweep/EVPM, this leads me to believe that \nthe change is taking place somewhere along the line prior to hitting the airwaves.  \n\nThis can all be so mind boggling!  ;0)\n\nMargaret\n\n--- In EVP-ITC@yahoogroups.com, Stefan Bion &lt;yahoogroups@...&gt; wrote:\n&gt;\n&gt; Hi Margret,\n&gt; \n&gt; yes, acoustical soundwaves - this could of course be a possible focus\n&gt; point for manipulation by &#39;them&#39;. However, I&#39;m not sure if this really\n&gt; takes place. Some time ago I had made some experiments to find out if\n&gt; the sound is changed for EVPs. I compared the original signal to the\n&gt; signal which had been transferred acoustically, and except for the\n&gt; reverberations from the room etc. I could never hear any significant\n&gt; differences; thus a manipulation of soundwaves did not take place and\n&gt; seemed to be unnecessary for the production of EVP. This led me to the\n&gt; conclusion that &#39;they&#39; usually don&#39;t manipulate our physical\n&gt; surrounding.\n&gt; \n&gt; Stefan\n&gt; \n&gt; &gt; Hi Stefan and Steve. The closest thing I&#39;ve gotten to an answer from\n&gt; &gt; &quot;Arthur&quot; about how this is working is the words &#39;air&#39; or &#39;air-to-air.&#39;\n&gt; &gt; This makes little sense to me, unless there is some type of additional\n&gt; &gt; manipulation taking place acoustically, because I am not recording in\n&gt; &gt; a closed environment. I am playing the file from EVP Maker using an\n&gt; &gt; external speaker and recording using the built-in mic of my MAC.\n&gt; \n&gt; &gt; I have no idea, what, if any difference this might make in terms of\n&gt; &gt; opportunity for &#39;them&#39; to speak intelligent phrases. Just thought I&#39;d\n&gt; &gt; share what I&#39;m hearing. I&#39;ll keep asking, and trying to get a clearer\n&gt; &gt; explanation of the process (though I&#39;ve never had much luck with that\n&gt; &gt; in the past, in regard to getting explanations for the mechanics of\n&gt; &gt; any other technique!)\n&gt; \n&gt; &gt; Margaret\n&gt;"}