{"id": "8651", "subject": "Re: EVP questions_can anyone help ?", "author": "sdudly", "timestamp": "2008-03-31T14:36:44Z", "full_text": "Lyn,\n\nI am fairly new as well but have been very lucky in that the other\nside has really come through to help me learn. I record everyday. I do\nnot post much as I am more into the spiritual journey then the actual\nresearch. I leave that to those here who are much smarter then myself\nwith all the gadgets.\n\nWhen I started I wanted to know as much as I could as well and posted\nquestions that I am sure some members who have been doing this for\nyears have heard time and again. They still however took the time to\nassist me from Misty helping me to go through files(she has the\npatience of Job I swear, even though she won&#39;t admit it), to Frank&#39;s\nsuggestion of using EVPmaker. Vicki Talbott also sent me my very first\nEVP about myself.\n\nThe recording is the easy part, they do all the work coming through. I\nhave a digital recorder as well and I simply use EVPmaker as my ears\nhave become accustomed to listening to it.\n\nSteps that I use.\n1)About 20 minutes before I let those that want to talk with me know I\nam going to be recording.\n2)Hook up an omni-directional mic to the recorder\n3)Bring up EVPmaker and load file leaving it at the default settings\n4)Set my volume to full wav and 45% main\n5)Record for approximately 2 minutes playing the EVPM file\n6)Hook the recorder to the PC using a USB cable\n7)Copy and label the file moving onto my PC\n8)I lower the HZ from the default in Audacity(free program)to 10000hz.\nThis was a suggestion by those on the other side to help me hear the\nfile better.\n9)Start to trim off small chunks of the file and listen, slowing the\ntempo by 10% after each pass and then speeding it up by 10% when it\ngets often times distorted because I went too low.\n10)Label and save the selected section and move on\n11)Let the spirits know what I heard, so this lets them know what I\ndidn&#39;t so if they feel something was important they can try to let me\nknow what I missed on the next recording.\n\nI know others ask questions while they record like a two-way\nconversation. I used to do this as well and found that I would\nsometimes talk over them or vice-versa and not get a clear message. So\nthe other side and I worked this out so that I would miss less of\ntheir messages. They do not seem to mind at all how I record.\n\nPrivately or on the forums do what you feel comfortable with and which\nhelps you have a calm about yourself when doing this. I have been told\nby them time and again it is about the spiritual journey, inner peace,\ninner strength, spiritual harmony and much more. Whatever your reasons\nfor doing this it seems with good intentions and patience they will\ntalk to you.\n\nI hope this info helps and if you have any questions if I can answer\nany I will. We were all new to this at one time or another.\n\nBest,\nTT"}