{"id": "8660", "subject": "Re: The Stanley", "author": "psi_research", "timestamp": "2008-03-31T17:08:54Z", "full_text": "Frank you really impressed people with your research, your passion for\nITC, and especially your recordings. Thanks for being a big part of\nthe retreat and  giving everyone a heartfelt talk about your work.\n\nAlso a thanks to Bill for being there and showing up with his array of\ndigital dowsing gear and data logging software. It was interesting to\nhave both of you side by side showing alternate approaches to audio ITC.\n\nBy the way, in excess of $15k was donated to the Shriner&#39;s Children&#39;s\nHospital from this event.\n\n-Bill M\n\n\n \n\n\n\n--- In EVP-ITC@yahoogroups.com, Frank Sumption &lt;purplealiengirl@...&gt;\nwrote:\n&gt;\n&gt; \n&gt;  Well, I had a good time, did several talks, and--get this! An\ninvestigation. Or rather I kinda tagged along on a group&#39;s\ninvestigation and used one of the boxes. There was entities answering\nquestions, and responding tot he group members. I gave the group the\ntape, so I won&#39;t be able able to play those. On my own recordings, the\nspirits were pretty the same as  get at home, and even my son come\nthrough wiht &quot;My father did this&quot;, which I played for a larger group.\nI loaned a box to another group, and they also got entities to answer\nquestions, and interact. \n&gt;  \n&gt;  RoboBox did perform for a group, with at least one meaningful\ncomment. A woman came to the table afte the talk, and asked &quot; Do they\nonokly talk for you&quot;&quot;, and immediately RoboBox put out &quot;for you&quot;,\nfollowed after a few seconds &quot;Loves to cook&quot;, the woman was a cook!\n&gt;  \n&gt;  The whole thing is very energy intense. \n&gt;  Frank-S\n&gt; _________________________________________________________________\n&gt; In a rush?  Get real-time answers with Windows Live Messenger.\n&gt;\nhttp://www.windowslive.com/messenger/overview.html?ocid=TXT_TAGLM_WL_Refresh_realtime_042008\n&gt;"}