{"id": "8671", "subject": "Re: A new hack?", "author": "itcdeadpeople", "timestamp": "2008-03-31T20:21:11Z", "full_text": "Hi Rees.  Try these settings with the Speak Jet Allophones file and ask for Arthur. :0)\n\nSegments: USE CUE LIST / Z-CROSS (both check marked)\nPlay EVP: CONTINUOUSLY\nSpeed Control: 106%\n\nIt takes some practice getting used to picking out the words, but since you are already \nexperienced with radio sweep, I&#39;m thinking you&#39;ll get the hang of it right away.  \n\nMargaret\n\n--- In EVP-ITC@yahoogroups.com, Wiliam Clarke &lt;reesclarke_69@...&gt; wrote:\n&gt;\n&gt; Thanks Stefan, I appreciate it.  Also tonight I haven&#39;t had much luck with my RS 469.  I \ngoing to give the EVPm a shot again.  If you have any pointers please let me know?\n&gt;   I haven&#39;t had much time to play with it.\n&gt;    \n&gt;   Thanks\n&gt;    \n&gt;   Rees\n&gt; \n&gt; Stefan Bion &lt;yahoogroups@...&gt; wrote: \n&gt;           Hi Rees,\n&gt; \n&gt; your question isn&#39;t stupid - and you&#39;re not the only one who asked it. ;)\n&gt; \n&gt; You need the QuickTime Player to watch Frank&#39;s cellphone videos.\n&gt; \n&gt; Stefan\n&gt; \n&gt; -- \n&gt; \n&gt; &gt; Frank\n&gt; \n&gt; &gt; This is probably a stupid question, what type of program can I use to open this file?\n&gt; \n&gt; &gt; Thanks\n&gt; &gt; Rees\n&gt; \n&gt; &gt; Frank Sumption &lt;purplealiengirl@...&gt; wrote:\n&gt; &gt; I mounted the &#39;469 guts on a board, and added a 3 volt regulator to run the RS radio \noff the 12 volt supply. I have the sweep working so far, hopefully tomorrow I can test the \nradio with\n&gt; &gt; external sweep to see if it actually works. The frequency display is now useless, so it&#39;s \nface down, and the power and band buttons will be added to a new front panel. I&#39;m not \nsure if I want to\n&gt; &gt; make this direct out, or make it just like any other box. The audio should be more \nbetter than anything I&#39;ve done so for, at least it sounded real good when I was using a \nmanual control, but only\n&gt; &gt; could tune half the AM or FM bands wihtout the negative tuning voltage component. \n&gt; \n&gt; &gt; The radio playing in the background is just C2C on a regular radio. \n&gt; \n&gt; &gt; Frank-S\n&gt; \n&gt; &gt; ---------------------------------\n&gt; &gt; Windows Live Hotmail is giving away Zunes. Enter for your chance to win. \n&gt; \n&gt; &gt; ---------------------------------\n&gt; &gt; No Cost - Get a month of Blockbuster Total Access now. Sweet deal for Yahoo! users \nand friends.\n&gt; \n&gt; \n&gt; \n&gt;                            \n&gt; \n&gt;        \n&gt; ---------------------------------\n&gt; OMG, Sweet deal for Yahoo! users/friends: Get A Month of Blockbuster Total Access, No \nCost. W00t\n&gt;"}