{"id": "8682", "subject": "Re: Bruce", "author": "itcdeadpeople", "timestamp": "2008-03-31T23:50:10Z", "full_text": "Hi Lyn.  I&#39;ve listened to all but your longest file.  It would be really helpful if you snipped \nout and isolated, just the area where you suspect an EVP, because they have a lot of \nirrelevant material.  I can only speak for myself, but I have a fairly short attention span \nwhen it comes to listening to other&#39;s clips (because I listen to so many).  I want to focus in \nright away on the relevant areas without having to work my way there.  ;0)\n\nI have a couple suggestions for you based on what I did listen to.  First, take your recorder \noff of voice activation.  Depending on the model, it&#39;s quite likely that you may miss an EVP \nbecause it can get cutoff (as your mom was telling you, there is - in some models - a \nslight delay from the time the VOX kicks in and when it actually records.  In some cases, \nthe EVP may cause it to kick on, but won&#39;t get recorded due to the delay).  VOX is a great \nfeature to use when you are going to leave a recorder unattended in a room for a long \nperiod of time (a practice I&#39;m not fond of, but I know some others like to do this).  \n\nNext, you have to talk much less than it seems you are.  It doesn&#39;t leave them any time to \nanswer. (though I realize if VOX was on, it&#39;s possible you were being quiet and nothing \nwas happening, just making it seem like you didn&#39;t wait between questions/comments) \nAsk a question, then wait silently for period of time to give them a chance to answer.  I like \nto wait about 10-15 seconds, but I know some people like to wait 30 seconds.  You might \neven make a list the things you want to ask, and go off of that, so your session stays on \ntrack.  \n\nAlso, set the recorder down on something.  This way you won&#39;t create any noises by \nholding it.  And make note of things in the room such as the ticking clock which runs \nthroughout the recordings.  This can also wreak havoc with your VOX, so ignore the \nblinking light as being any kind of indicator that paranormal something is happening.\n\nI don&#39;t know what other kinds of questions you have, but if you toss them out here, maybe \nsomeone (or several someones) here can give you their take.  \n\nIn the last clip, you are moving the recorder (assuming), as well as talking, moving in a \nsqueaking chair, and again the clock ticking... those are all things that will trigger the \nVOX.  If you listen to it, you will hear that it did indeed record you typing on the keyboard \nand all your conversation regarding the blinking light, etc.  I&#39;m  not hearing anything that \nseem worrisome, or even paranormal.  Maybe I&#39;m missing something that someone else \nwill catch when they listen.  \n\nKeep trying!  Sometimes it takes a while.  \n\nMargaret\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;Lyn&quot; &lt;angels4lyn@...&gt; wrote:\n&gt;\n&gt; Bruce,\n&gt; I did send you a private reply the other day.\n&gt; I know it was a long story, but hopefully you recieved it ok.\n&gt; \n&gt; and I did post on group again.\n&gt; am hoping someone will listen to the evps in the files\n&gt; and tell me what they think.\n&gt; the last one is what worried me, so we have done no more.\n&gt; \n&gt; but I am still full  of questions :)\n&gt; \n&gt; Lyn\n&gt;"}