{"id": "8696", "subject": "Re: [EVP-ITC] A new hack?", "author": "Stefan Bion", "timestamp": "2008-04-01T15:32:14Z", "full_text": "Hi Steve,\n\nMargret&#39;s EVPmaker settings are listed below (scroll down).\n\nUnfortunately, I don&#39;t have any samples of similar phoneme sets; however, I haven&#39;t yet been looking for it. What I&#39;d be interested in are German allophones of that kind, in order to get EVP also in my language. (With the SJ file, I get only English EVPs.)\n\nCommercial text-to-speech applications usually aren&#39;t &quot;low-level&quot; enough to have access to the speech elements, but perhaps research sites or university web sites are a resource for such samples?\n\nBTW, there&#39;s a program called TalkAny from Microsoft; you can type in any text and it will speak it immediately. It has many options to alter the voice, and there&#39;s also a preset called &#39;Little Robot&#39; which makes the voice sound very similar to the SpeakJet chip. I use it sometimes to counter-check / verify &quot;EVPmaker + SpeakJet&quot; EVPs.\n\nPerhaps it can be used to generate an own set of phonemes / allophones.\n\nI could upload this program, if desired.\n\nStefan\n\n----- original Nachricht --------Betreff: Re: [EVP-ITC] Re: A new hack?\nGesendet: Di, 01. Apr 2008\nVon: Frank Ratka\n\nStefan,\n\nI like the use of the SJ Allophones with the EVP maker. I did send Margaret an email asking how she sets up but have yet to hear back. I have been looking around for phoneme and formant samples of the same caliber but have come up short. Do you have any such samples?\n\nBest Regards,\n\nFrank R.\n\n----- Original Message ----\nFrom: Stefan Bion &lt;yahoogroups@...&gt;\nTo: itcdeadpeople &lt;EVP-ITC@yahoogroups.com&gt;\nSent: Monday, March 31, 2008 3:44:34 PM\nSubject: Re: [EVP-ITC] Re: A new hack?\n\n                Hi all,\n\nalthough it is possible to use &quot;Zero Cross&quot; and &quot;Use Cue List&quot; at the\nsame time, it is unnecessary, since I had already zero-crossed the cue\nranges in Audition.\n\n(Just a hint...)\n\nBut please, I don&#39;t wanna keep anyone from playing and experimenting.\nNot seldom users discover potentialities of an application even the\ndeveloper never knew of... :)\n\nStefan\n\n-- \n\n&gt; Hi Rees.  Try these settings with the Speak Jet Allophones file and ask for Arthur. :0)\n\n&gt; Segments: USE CUE LIST / Z-CROSS (both check marked)\n&gt; Play EVP: CONTINUOUSLY\n&gt; Speed Control: 106%\n\n&gt; It takes some practice getting used to picking out the words, but since you are already \n&gt; experienced with radio sweep, I&#39;m thinking you&#39;ll get the hang of it right away.  \n\n&gt; Margaret"}