{"id": "874", "subject": "Re: [EVP-ITC] Sweep Tuning of AM Radio Band", "author": "RetroCom", "timestamp": "2007-03-20T02:10:22Z", "full_text": "----__Part.20070319191022.69410275\r\nContent-Type: text/plain; charset=&quot;UTF-8&quot;\r\n\r\nHi Misty, thanks for the great feedback! Some of the messages on reverse playback are very clear. This one might be one of Frank&#39;s guys looking in.\n&quot;Circuit made manual&quot;\nThanks again,\nDave\n\n--- bulletbabea@... wrote:\n\nFrom: Misty Dawn &lt;bulletbabea@...&gt;\nTo: EVP-ITC@yahoogroups.com\nSubject: Re: [EVP-ITC] Sweep Tuning of AM Radio Band\nDate: Mon, 19 Mar 2007 19:02:04 -0700 (PDT)\n\nWow Dave cool evp. Whats really cool is when I reverse that it says &quot;your in the zone&quot;\n   \n  plug a million hertz\n  your in the zone\n   \n  Thats what I hear. That actually has reference for something Laura and I were talking about recently so thanks for the &quot;plug&quot; and sharing that! \n   \n  Misty\n\nRetroCom &lt;vfp19968@...&gt; wrote:\n          \nI have a very sensitive old AM tuner with a flywheel tuning system. I tried several recording sessions manually sweeping the tuner through the AM band late at night. I got pretty good at keeping the dial moving at a constant rate of speed. This is not nearly as good as Frank&#39;s &#39;hands off&#39; random tuning method but it still produced some results. What impressed me most is that some of the voices sound the same, even though I tuned through several channels. This attached capture could be a technical message.\n&quot;Plug a million hertz&quot; One Million Hertz = 1mhz = 1000khz, which is close the center frequency for the AM broadcast band.\nDave\n\n         \n\n \n---------------------------------\nNo need to miss a message. Get email on-the-go \nwith Yahoo! Mail for Mobile. Get started.\n\n\r\n----__Part.20070319191022.69410275\r\nContent-Type: audio/mpeg\r\nContent-Type: AUDIO/MPEG; name=&quot;031907reversecircuitmademanual.mp3&quot;\r\nContent-Disposition: attachment; filename=&quot;031907reversecircuitmademanual.mp3&quot;\r\n\r\n[ Attachment content not displayed ]\r\n----__Part.20070319191022.69410275--"}