{"id": "8747", "subject": "Re: New file uploaded to EVP-ITC", "author": "itcdeadpeople", "timestamp": "2008-04-01T19:36:09Z", "full_text": "Thanks for the info, Bruce.  I guess because I use such a wide variety of digital recorders, \ntechniques, software, and settings, what I&#39;m looking for is a way to catalog the session \nclips along with the details.  This is not counting the MiniBox, 12-469, 12-470, either of \nmy manual sweep radios, or EVP Maker.  So, like yourself, I too have much more than &quot;one \nbox&quot; to keep track of.   I also have a variety of cameras/settings used for ITC images.  LOL \n- I&#39;m in definite need of something &quot;fancy.&quot;  ;0)\n\nIf I can recall what the file is named, I can use the &quot;spotlight&quot; feature on my MAC to find it, \nthough often the content of  a single file is much longer than I could possible name it.  For \nexample, my recent results with EVP Maker/SpeakJet Allophones.  I do jot some things \ndown in a Mead notebook, but even that can be a chore to go through when I&#39;m wanting to \nfind information that is older.\n\nFor example, without electronic organization, I can pull up a file and recall that I used \nDiamond Cut Live6/Forensics software, but if I can&#39;t refer to some kind of notes, there is \nno way I can recall what the specific settings were unless the session was recent and still \nfresh in my mind (and/or the notes easily found.)\n\nWhat I&#39;m wanting is some kind of simple database.  It&#39;s looking more and more like I&#39;m just \ngoing to have to buy the software and create it.  If I do, I&#39;ll be sure to share the template \nwith others who might also be interested.\n\nMargaret\n\n--- In EVP-ITC@yahoogroups.com, bruce halliday &lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; \n&gt; hi Margaret,\n&gt;  \n&gt; I just use a folder dedicated to the individual session \n&gt; whatever files I get go in, numbered in the order I got them from the recording.\n&gt;  \n&gt; The main recording file gets named with the box used, date and session # if you use \none.\n&gt;  \n&gt; these individual session folders are placed into a main folder, or you could create sub \nfolders for each\n&gt; month and place those in a main folder.\n&gt;  \n&gt; I don&#39;t think you need anything fancy, especially since you are only using one box.\n&gt; I use 5 different boxes and now EVPM so for me it could really get confusing.\n&gt;  \n&gt; for you the simpler the better. If it&#39;s something like this\n&gt;  \n&gt; Main folder: box files/2008\n&gt;  \n&gt; sub folders1: jan., feb., mar. so forth.\n&gt;  \n&gt; sub folders2: 469_session5_3-31-08\n&gt; All files including main go into sub folders2\n&gt; in turn that folder goes into the appropriate sub folder1\n&gt; when the month is over that sub folder goes into the folder for the year.\n&gt;  \n&gt; Say you wanted to reference a file from 3-31-08, you would know exactly were to find \nit.\n&gt;  \n&gt; that&#39;s how I do it and it seems to work.\n&gt;  \n&gt; bruce\n&gt; Bruce Halliday \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: ITCdeadpeople@...: Tue, 1 Apr 2008 17:50:38 +0000Subject: [EVP-\nITC] Re: New file uploaded to EVP-ITC\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Do you have any kind of database of your clips, Steve? I have many good examples but \nno organization (other than keeping the clips from a session, or a day, grouped together \nin the same folder). It&#39;s hard for me to keep track of everything. Eons ago, I used to create \nsimple databases with Filemaker Pro. I&#39;ve been thinking lately, I need to come up with \nsomething to use as references for the details for various clips. I&#39;d be interested in \nknowing what, if anything, others are using. Margaret --- In EVP-ITC@yahoogroups.com, \n&quot;Steve Hultay&quot; &lt;urkel23@&gt; wrote:&gt;&gt; &gt; Yeah, i only post the files if they have a certain \nmeaning or are &gt; really clear for others to listen. I probably average about 15 files &gt; in a 5 \nminute session, but will only post maybe 3 or 4. If you do &gt; enough sessions, the good \nfiles with start to add up.&gt; &gt; -Steve H.&gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com, \n&quot;itcdeadpeople&quot; &lt;ITCdeadpeople@&gt; &gt; wrote:&gt; &gt;&gt; &gt; Hi Steve. Nice to hear you getting \nrelevant responses with &gt; EVPM/allophones. Good one!&gt; &gt; &gt; &gt; Margaret &gt; &gt; &gt; &gt; --- In \nEVP-ITC@yahoogroups.com, EVP-ITC@yahoogroups.com wrote:&gt; &gt; &gt;&gt; &gt; &gt; &gt; &gt; &gt; \nHello,&gt; &gt; &gt; &gt; &gt; &gt; This email message is a notification to let you know that&gt; &gt; &gt; a file \nhas been uploaded to the Files area of the EVP-ITC &gt; &gt; &gt; group.&gt; &gt; &gt; &gt; &gt; &gt; File : /Steve \nHultay Files/Evp Maker &gt; Files/yeah_take_off_reverse.mp3 &gt; &gt; &gt; Uploaded by : \nurkel232002 &lt;urkel23@&gt; &gt; &gt; &gt; Description : &quot;Yeah, Take Off Reverse&quot; &gt; &gt; &gt; &gt; &gt; &gt; You \ncan access this file at the URL:&gt; &gt; &gt; http://groups.yahoo.com/group/EVP-&gt; &gt; \nITC/files/Steve%20Hultay%20Files/Evp%20Maker%&gt; 20Files/yeah_take_off_reverse.mp3 &gt; \n&gt; &gt; &gt; &gt; &gt; To learn more about file sharing for your group, please visit:&gt; &gt; &gt; &gt; \nhttp://help.yahoo.com/l/us/yahoo/groups/original/members/web/index.htm&gt; lfiles&gt; &gt; \n&gt; &gt; &gt; &gt; Regards,&gt; &gt; &gt; &gt; &gt; &gt; urkel232002 &lt;urkel23@&gt;&gt; &gt; &gt;&gt; &gt;&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Going green? See the top 12 foods to eat organic.\n&gt; http://green.msn.com/galleries/photos/photos.aspx?\ngid=164&ocid=T003MSN51N1653A\n&gt;"}