{"id": "876", "subject": "Re: Sweep Tuning of AM Radio Band-sorry almost forgot", "author": "kenneth b thomas", "timestamp": "2007-03-20T03:48:38Z", "full_text": "on one megahertz, i had 2 old zenith transoceanics which would give \nout a persistent but weak one kilohertz tone when local 0ne meg \nstation was nulled out and flywheel rocked slowly between 900-1100 khz\n\nafter awhile myriad weak voices would appear next to the 1000hz tone, \nwhich is the peak in hearing sensitivity of most humans AND the \nSQUARE ROOT of one megahertz which seems to imply a weak \nsuperregeneration with quench as square root of carrier.  this \nhappens on no othe frequency only one meg.  it would be hard to \nautomate because the min and max is random and determined by hearing \nthe click of the spurious superregeneration kicking in.\n\non one occasion in 1986 i was fooling around with this and abruptly \ngot full rendition of a 78 rpm version of judy garland singing over \nthe rainbow and it was LOUD and extra extra clear.  i had time to run \noutside and conscript my wife as a witness before it switched off \nwith a few indecipherable male voices and a click\n\nkthomas\n\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;kenneth b thomas&quot; \n&lt;kennnthomas2000@...&gt; wrote:\n&gt;\n&gt; right on, dave,\n&gt; \n&gt; and i know what you mean, the desired voice seems to persist across \n&gt; several station hops.\n&gt; \n&gt; i took the front off the radios and removed string and just grabbed \n&gt; the flywheel if plastic or bolted a non-conductive disc on it. the \n&gt; size of the flywheel seems about right for a slow enough sweep and \n&gt; you can hear voices stretching off each station when it works.  i \n&gt; never recorded or understood anything-just noted &quot;otherworldly \n&gt; feeling&quot; or spooky resonance of sounds.  right now i have a car \nradio \n&gt; with a toothpick jammed into sweep lever. \n&gt; \n&gt; --really interested in software now, though, alas.\n&gt; \n&gt; if the spread spectrum is maxed in computer bios it has something \nof \n&gt; the same effect.\n&gt; \n&gt; kthomas\n&gt; illinois\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot; RetroCom&quot; &lt;vfp19968@&gt; wrote:\n&gt; &gt;\n&gt; &gt; \n&gt; &gt; I have a very sensitive old AM tuner with a flywheel tuning \nsystem. \n&gt; I tried several recording sessions manually sweeping the tuner \n&gt; through the AM band late at night. I got pretty good at keeping the \n&gt; dial moving at a constant rate of speed. This is not nearly as good \n&gt; as Frank&#39;s &#39;hands off&#39; random tuning method but it still produced \n&gt; some results. What impressed me most is that some of the voices \nsound \n&gt; the same, even though I tuned through several channels. This \nattached \n&gt; capture could be a technical message.\n&gt; &gt; &quot;Plug a million hertz&quot;   One Million Hertz = 1mhz = 1000khz, \nwhich \n&gt; is close the center frequency for the AM broadcast band.\n&gt; &gt; Dave\n&gt; &gt;\n&gt; \n&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&\n&gt;"}