{"id": "878", "subject": "Re: Sweep Tuning of AM Radio Band - FWIW", "author": "kenneth b thomas", "timestamp": "2007-03-20T14:46:58Z", "full_text": "for almost ten years, i  snatched spare time here and there to look \ncloser at one megahertz/1khz phenomenon. well that dave is in \nmilwaukee; in 1983 i was able to get strange otherworldly pics on vhf \nand uhf due to signals from milwaukee going out into weather \nweirdness over lake michigan and redirected to chicago area.  this is \nrare but very well known phenomenon to hams and tv/dx nuts in the \narea.  now it takes on another &quot;dimension&quot;.  to make headway you have \nto outdo science establishment ON THEIR OWN TURF.  thats where all \nthe control is; upstarts are simply put out of existence by policy or \nlegislative adjustments and reality be damned.  you cant run and you \ncant hide; the only way out is to grind ahead.\n\nby far the most critical aspect of the one meg phenom is that , as \nyou manually scan, SOMETHING  builds up until voices bleed over into \ndetectability; if you scan too far, &quot;keep alive&quot; scalar or tesla \nor &quot;other&quot; current is spilled back into to vacuum and you have to \nstart over.  once tuning is established, it locks itself in and only \nway to stop performance is to remove power source--and occasionally \neven that doesnt work.\n\none meg phenom repeats at 100khz, 100mhz, 1000mhz, 9-10000mhz but is \nstrongest at one mhz and is related to weather and ALSO(seemingly) \nAFFECTS WEATHER.  effect is not sharply notched at one mhz and \nextends from about 800-1200 khz and power spectrum has sharp peaks at \nskirts, fall-off is perfect vertical.\n\nat 100mhz am and 1ghz (blocked cell phones,uhf tv) , effect can be \nexternally swept by a phase coherent signal from space which \nsometimes locks on.  a multi element yagi  pointed south quickly \nsolves that mystery; it&#39;s jupiter, our mini-sun; it&#39;s so huge and \nclose that its electrical activities &quot;condition&quot; our local, sub-\nquantic medium-ESPECIALLY when jupiter passes between earth and the \ngalactic core, as it is doing RIGHT NOW.\n\nthis is only introductory; theres way more, more than most people \nwould ever want to know about, though. thats why im only highlighting \nkey points to be aware of.\n\nkthomas\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;Frank Sumption&quot; &lt;franks-boxes@...&gt; \nwrote:\n&gt;\n&gt; WOW!! I am amazed that someonme actually tried this! It does work. \nThere was \n&gt; a Danish(I think) researcher doing the same thing, but never could \nmake \n&gt; contact with them. I have done this myself, and it can work wiht TV \ntoo, if \n&gt; you can switch channels fast ennough. I think you could use a \nsteeper motor \n&gt; controler to randomly turn a stepper moter, to turn the dial. \nManually \n&gt; spinning the dial has one advantage, the sound is clearer! I have \nyet to see \n&gt; a method of ITC that produces better results that the random tuning \nmethods.\n&gt; \n&gt; Frank\n&gt; \n&gt; \n&gt; &gt;From: &quot; RetroCom&quot; &lt;vfp19968@...&gt;\n&gt; &gt;Reply-To: EVP-ITC@yahoogroups.com\n&gt; &gt;To: &lt;EVP-ITC@yahoogroups.com&gt;\n&gt; &gt;Subject: [EVP-ITC] Sweep Tuning of AM Radio Band\n&gt; &gt;Date: Mon, 19 Mar 2007 17:19:47 -0700\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;I have a very sensitive old AM tuner with a flywheel tuning \nsystem. I tried \n&gt; &gt;several recording sessions manually sweeping the tuner through the \nAM band \n&gt; &gt;late at night. I got pretty good at keeping the dial moving at a \nconstant \n&gt; &gt;rate of speed. This is not nearly as good as Frank&#39;s &#39;hands off&#39; \nrandom \n&gt; &gt;tuning method but it still produced some results. What impressed \nme most is \n&gt; &gt;that some of the voices sound the same, even though I tuned \nthrough several \n&gt; &gt;channels. This attached capture could be a technical message.\n&gt; &gt;&quot;Plug a million hertz&quot;   One Million Hertz = 1mhz = 1000khz, which \nis close \n&gt; &gt;the center frequency for the AM broadcast band.\n&gt; &gt;Dave\n&gt; \n&gt; \n&gt; &gt;&lt;&lt; 031907plugamillionhertz.mp3 &gt;&gt;\n&gt; \n&gt; _________________________________________________________________\n&gt; i&#39;m making a difference.Make every IM count for the cause of your \nchoice. \n&gt; Join Now. \n&gt; http://clk.atdmt.com/MSN/go/msnnkwme0080000001msn/direct/01/?\nhref=http://im.live.com/messenger/im/home/?source=hmtagline\n&gt;"}