{"id": "8835", "subject": "Re: Finally got something on EVPMkr!", "author": "Steve Hultay", "timestamp": "2008-04-03T00:13:40Z", "full_text": "I like AM on other radios, but on the 12-820 the FM works the best.  \nI really get some good answers from it, the sweep rate is a little \nquick but they can work it nicely.  So, i would suggest using the FM \non that one, but that&#39;s just my preference.  Anyway, i appreciate \nyour dedication to this research and everyday i feel i have to play \ncatch up with the awesome communication you get.  Nah, just kidding.  \nWe all work together like family, aint that right sis?\n\nAlways a great job K,\n-Steve H. (A Fan)\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;Kristin Morris&quot; &lt;ckmorris95@...&gt; \nwrote:\n&gt;\n&gt; Thanks for your input Steve! It&#39;s hard to get an ear for the \nallophones\n&gt; because I am so used to zoning in that it now goes against my grain \nto zone\n&gt; out.  But practice makes better!\n&gt; \n&gt; And yes it beats the falling out.. I mean hanging out my window any \nday!  I\n&gt; returned the badly hacked Hultay Hack and went directly to another \nRS and\n&gt; bought one (don&#39;t tell anyone).  This time I hacked correctly - But \nI swear\n&gt; I almost screwed it up again..  Those dang wires..\n&gt; \n&gt; But it works and I taped a session and a I&#39;m going over it now.  \nReception\n&gt; is much better on this but I find the Am sweeps much slower than \nthe 470 or\n&gt; 469.  Therefore I am hearing stations far longer than I want to.\n&gt; \n&gt; k\n&gt; \n&gt;  \n&gt; \n&gt;   _____  \n&gt; \n&gt; From: EVP-ITC@yahoogroups.com [mailto:EVP-ITC@yahoogroups.com] On \nBehalf Of\n&gt; Steve Hultay\n&gt; Sent: Wednesday, April 02, 2008 6:40 PM\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Subject: [EVP-ITC] Re: Finally got something on EVPMkr!\n&gt; \n&gt;  \n&gt; \n&gt; The first one i hear &quot;Arthur---employee airhole&quot;. Maybe they are \n&gt; describing a situation while alive and we just aren&#39;t understanding \n&gt; correctly. The second i hear &quot;You forget the evil eye&quot;. The last \none \n&gt; i hear as you do. Hey, this format beats hanging out the window to \nget \n&gt; a signal from the shack hack and it&#39;s clearer too. I think when we \nget \n&gt; familiar with the speech from this, it&#39;s going to be fantastic. \nOthers \n&gt; should try this method as well, who live in a bad radio signal \nlocation.\n&gt; \n&gt; -Steve H.\n&gt; \n&gt; --- In EVP-ITC@yahoogroups &lt;mailto:EVP-ITC%40yahoogroups.com&gt; .com,\n&gt; &quot;Kristin&quot; &lt;ckmorris95@&gt; wrote:\n&gt; &gt;\n&gt; &gt; I just posted three MP3 files in my folder (Kristin&#39;s Folder)from \na\n&gt; &gt; session I did today using EVP Maker and the Allophones. Please \nlisten\n&gt; &gt; to see if you hear as I do. I find this way much tougher to hear\n&gt; &gt; live... so I hope I am doign better! Please let me know. THX!\n&gt; &gt; \n&gt; &gt; k\n&gt; &gt; \n&gt; &gt; The first one actually coincides with Margaret&#39;s.. ARTHUR EMPLOYS \nAIR\n&gt; &gt; HOLES.\n&gt; &gt; \n&gt; &gt; The second ones says: YOU ARE GETTING THE EVIL EYE\n&gt; &gt; \n&gt; &gt; Third one says: YOU ARE VALUABLE\n&gt; &gt; \n&gt; &gt; Kristin\n&gt; &gt;\n&gt;"}