{"id": "884", "subject": "Re: Sweep Tuning of AM Radio Band - FWIW", "author": "kenneth b thomas", "timestamp": "2007-03-22T00:20:18Z", "full_text": "possibly related:\n\nfooling around with thunder:\n\nwe&#39;re getting those drenching t-storms with the low lightning between \nthe trees , typical of jupiter passing between earth and galactic \ncenter so april 6 should be best evp time in awhile\n\ntonite:\n\n\nheated anode gold whisker end with one match .  in live circuit tuned \nto strong local station.\n \nwhen match was two thirds burned, white noise started. match was put \nout. \n \nnow there is a steady 20mv* across input with diode in place.  \npreviously 0 mv.  no difference when diode is reversed..  diode \nremoved, v drops to zero.  formerly strong local station was barely \naudible with good audio amp.  now it is  at normal listening volume.  \ndiode is noisy, but beneath what you can hear when tuned to \nstation.  &quot;lumpy&quot; white noise; white noise with larger scale order \nappearing and vanishing- unpredictably , like candle flame- but \naveraging about 3-15 times per second\n \nother am receivers still full of crashing static from long gone t-\nstorm.\n \ntank circuit +diode + audio amp= no lightning crashes whatsoever.  no \nline noise. no fluorescent light 60hz buzz.\n\nKen Thomas &lt;kennnthomas2000@...&gt; wrote:\nim making som noise sources as soon as i collapse for awhile by \nholding a soldering iron to either end of  1n34 diode in live \ncircuit.  injection of gold from point contact into germanium block \nforms defect type dopant and microscopic p or n+ later junction which \nhas low back threshold and is very noisy but low amplitude.  noise \nthat issues from an infinitely smal point source seems to work better \nfor some reason.   i just hold a match or soldering on there while \nlistening to amplified noise till i get something that sounds good\n\n* 20mv average,  larger scale prigogine fluctuations up to 75mv.  \nunpredictable but not completely random--pinked up due to SOMETHING \nUNIDENTIFIED trying to cohere. amplified 3-15 per second voltage \npeaks drive sweep.  random except for voice or other coherent energy.\n\n\n\n\n\n\n\n&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&\n&\n\n--- In EVP-ITC@yahoogroups.com, &quot;Frank Sumption&quot; &lt;franks-boxes@...&gt; \nwrote:\n&gt;\n&gt; That&#39;s excatly what I get with an automated system. I think this \nshould be \n&gt; screamed at the world!!\n&gt; \n&gt; Frank\n&gt; \n&gt; _________________________________________________________________\n&gt; Get a FREE Web site, company branded e-mail and more from Microsoft \nOffice \n&gt; Live! http://clk.atdmt.com/MRT/go/mcrssaub0050001411mrt/direct/01/\n&gt;"}