{"id": "8855", "subject": "Re: [EVP-ITC] EVP Maker (allaphone file) Method Test", "author": "RetroCom", "timestamp": "2008-04-03T16:01:01Z", "full_text": "Stefan,\n Should we try to edit out some of these allophones on the master file as a test? Are they in order on the indexed file? \n\nThanks,\n\nDave\n\n--- yahoogroups@... wrote:\n\nFrom: &quot;Stefan Bion&quot; &lt;yahoogroups@...&gt;\nTo: EVP-ITC@yahoogroups.com\nSubject: Re: [EVP-ITC] EVP Maker (allaphone file) Method Test\nDate: Thu, 3 Apr 2008 17:20:33 +0200 (MEST)\n\nHi Bruce,\n\nin fact one has to be cautious as to &quot;false positives&quot; when using this method, especially for 1-syllable words like &quot;(h)ear, &quot;air&quot; and &quot;I&quot;. Some of the SpeakJet allophones are diphthongs, e.g. #22 (&quot;IYRR&quot; like in &quot;Clear, Hear, Year&quot;), #23 (&quot;EYRR&quot; like in &quot;Hair, Stair, Repair&quot;), or #30 (&quot;OHIH&quot; like in &quot;Sky, Five, I&quot;). There are only 72 different allophones, so the probability that one-syllable words like &quot;(h)ear/here&quot; , &quot;air&quot;, and &quot;I&quot; appear, is relatively high.\n\nI don&#39;t assume that everything that is received by this method is true communication. As with every method, it depends on various factors like meaningfulness, relatedness, length of the message, etc., if a message is regarded as a valid EVP.\n\nStefan\n\n----- original Nachricht --------\n\nBetreff: [EVP-ITC] EVP Maker (allaphone file) Method Test\nGesendet: Do, 03. Apr 2008\nVon: bhali333&lt;paranormalinvestigating@...&gt;\n\n&gt; \n&gt; To all that are experimenting with the EVPM allaphone file method.\n&gt; \n&gt; I have done a few sessions with this method as I know a  few other \n&gt; researchers have.\n&gt; There have been a couple of researchers that have done sessions and \n&gt; gotten very similar responses such as the name &quot;Arthur&quot; and responses \n&gt; pertaining to &quot;Air&quot; also &quot;I am here&quot; or &quot;here&quot;.\n&gt; \n&gt; I have also gotten direct and intelligible answers to questions \n&gt; immediately following the question, and messages that could never be \n&gt; construed as random.\n&gt; \n&gt; The test that I propose and the answer I seek is, The words that keep \n&gt; coming up to almost all researchers experimenting with this method IE \n&gt; the words I mentioned above.\n&gt; \n&gt; I would like to find out whether these certain words are simply by \n&gt; products of everyone using the same file and come up as a result of \n&gt; the file playing in evpm, or are they true entity communication.\n&gt; \n&gt; The only questionable content are these few words not all the methods \n&gt; communication. In my opinion the majority of the communication from \n&gt; this method is genuine.\n&gt; The method has produced communication including my name to me as well \n&gt; as other researchers that have gotten my name, and some of the \n&gt; statements and responses show signs of a sense of humor that would \n&gt; surely be absent in random word grouping.\n&gt; \n&gt; Who ever is involved with experimentation of this method, will you \n&gt; please on your next session ask that if there is a spirit named \n&gt; Arthur for him not to mention his name or the list of words that I \n&gt; have posted. I suggest that this request be made verbally before the \n&gt; session as well as after.\n&gt; \n&gt; And in the most polite manner. They seem to respond better to \n&gt; formality.\n&gt; \n&gt; please dedicate one session no shorter than 2 minutes to this \n&gt; experiment and post your results.\n&gt; \n&gt; Your cooperation appreciated.\n&gt; \n&gt; Bruce\n&gt; \n&gt; \n&gt; ------------------------------------\n&gt; \n&gt; Yahoo! Groups Links\n&gt; \n&gt; \n&gt; \n&gt; \n\n--- original Nachricht Ende ----"}