{"id": "8856", "subject": "Re: EVP Maker (allaphone file) Method Test", "author": "itcdeadpeople", "timestamp": "2008-04-03T16:50:19Z", "full_text": "Hi Stefan.  I couldn&#39;t agree more about relevance and length of message being important \nfactors in helping to rule out false positives.  This is the same guideline I have used all \nalong for my radio sweep sessions as well.  \n\nLike Bruce, I have noticed the repeat of the word Arthur, air, and also therapist or therapy, \nalong with lots of other single words here and there.  However, each of these words in \nsome cases has been used in a longer, relevant response.  \n\nMy feeling is the same word can be both a &#39;false positive&#39; and &#39;intentional communication&#39;, \ndepending on the context in which it is heard and whether or not it is part of a longer, \nrelevant phrase.  \n\nI agree, also... The chances of hearing these individual words is very high and, in most \ncases, should be disregarded.  Less likely, is that they are heard in a grammatically correct \nsentence.  And the chances of output being a false positive becomes even more slim when \nthat grammatically correct sentence is coupled with relevance to a proceeding question or \ncomment, and/or to the session content overall.\n\nI would suggest to everyone working with this method, or any kind of automated or \nmanual sweep, to let &#39;relevance&#39; be a golden rule, along with &#39;length.&#39;  Without relevance, \nthere is no way to determine if something is a false positive using these methods, \nespecially sweep, where the presence of whole words/sentences could have actually come \nfrom a broadcasting station at the time the session is conducted.\n\nMargaret\n \n\n--- In EVP-ITC@yahoogroups.com, &quot;Stefan Bion&quot; &lt;yahoogroups@...&gt; wrote:\n&gt;\n&gt; Hi Bruce,\n&gt; \n&gt; in fact one has to be cautious as to &quot;false positives&quot; when using this method, especially \nfor 1-syllable words like &quot;(h)ear, &quot;air&quot; and &quot;I&quot;. Some of the SpeakJet allophones are \ndiphthongs, e.g. #22 (&quot;IYRR&quot; like in &quot;Clear, Hear, Year&quot;), #23 (&quot;EYRR&quot; like in &quot;Hair, Stair, \nRepair&quot;), or #30 (&quot;OHIH&quot; like in &quot;Sky, Five, I&quot;). There are only 72 different allophones, so the \nprobability that one-syllable words like &quot;(h)ear/here&quot; , &quot;air&quot;, and &quot;I&quot; appear, is relatively \nhigh.\n&gt; \n&gt; I don&#39;t assume that everything that is received by this method is true communication. \nAs with every method, it depends on various factors like meaningfulness, relatedness, \nlength of the message, etc., if a message is regarded as a valid EVP.\n&gt; \n&gt; Stefan\n&gt; \n&gt; ----- original Nachricht --------\n&gt; \n&gt; Betreff: [EVP-ITC] EVP Maker (allaphone file) Method Test\n&gt; Gesendet: Do, 03. Apr 2008\n&gt; Von: bhali333&lt;paranormalinvestigating@...&gt;\n&gt; \n&gt; &gt; \n&gt; &gt; To all that are experimenting with the EVPM allaphone file method.\n&gt; &gt; \n&gt; &gt; I have done a few sessions with this method as I know a  few other \n&gt; &gt; researchers have.\n&gt; &gt; There have been a couple of researchers that have done sessions and \n&gt; &gt; gotten very similar responses such as the name &quot;Arthur&quot; and responses \n&gt; &gt; pertaining to &quot;Air&quot; also &quot;I am here&quot; or &quot;here&quot;.\n&gt; &gt; \n&gt; &gt; I have also gotten direct and intelligible answers to questions \n&gt; &gt; immediately following the question, and messages that could never be \n&gt; &gt; construed as random.\n&gt; &gt; \n&gt; &gt; The test that I propose and the answer I seek is, The words that keep \n&gt; &gt; coming up to almost all researchers experimenting with this method IE \n&gt; &gt; the words I mentioned above.\n&gt; &gt; \n&gt; &gt; I would like to find out whether these certain words are simply by \n&gt; &gt; products of everyone using the same file and come up as a result of \n&gt; &gt; the file playing in evpm, or are they true entity communication.\n&gt; &gt; \n&gt; &gt; The only questionable content are these few words not all the methods \n&gt; &gt; communication. In my opinion the majority of the communication from \n&gt; &gt; this method is genuine.\n&gt; &gt; The method has produced communication including my name to me as well \n&gt; &gt; as other researchers that have gotten my name, and some of the \n&gt; &gt; statements and responses show signs of a sense of humor that would \n&gt; &gt; surely be absent in random word grouping.\n&gt; &gt; \n&gt; &gt; Who ever is involved with experimentation of this method, will you \n&gt; &gt; please on your next session ask that if there is a spirit named \n&gt; &gt; Arthur for him not to mention his name or the list of words that I \n&gt; &gt; have posted. I suggest that this request be made verbally before the \n&gt; &gt; session as well as after.\n&gt; &gt; \n&gt; &gt; And in the most polite manner. They seem to respond better to \n&gt; &gt; formality.\n&gt; &gt; \n&gt; &gt; please dedicate one session no shorter than 2 minutes to this \n&gt; &gt; experiment and post your results.\n&gt; &gt; \n&gt; &gt; Your cooperation appreciated.\n&gt; &gt; \n&gt; &gt; Bruce\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; ------------------------------------\n&gt; &gt; \n&gt; &gt; Yahoo! Groups Links\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; \n&gt; --- original Nachricht Ende ----\n&gt;"}