{"id": "8860", "subject": "Re: [EVP-ITC] EVP Maker (allaphone file) Method Test", "author": "Wiliam Clarke", "timestamp": "2008-04-03T21:14:24Z", "full_text": "--0-2146307076-1207257264=:69315\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nI can&#39;t find the file ronriko. I think I&#39;ve seen before, but not sure where!\n\nRon Lederer &lt;ronriko@...&gt; wrote:          To Bruce, Stefan and others using EVPM.   I have posted a file of my test with EVPM allaphones under ronriko files.  I forward this for two reasons:  the first as a request from Bruce to determine recurring words and second because I wanted to have experienced ears hear my recording for comments.   Regarding the test, this is just 30 secs or so of a 7 minute recording.  Recorded at 90% using EVPmaker with xcross.  I was able to hear &quot;art and arthor&quot; a number of times within the 7 minutes.  This is after requesting no names be spoken.  \n   \n  Regarding my experiences with evpmaker and the allaphone file sent by Stefan, I must say my results have been underwhelming.  I hear nothing but evp gibberish.  I ask that anyone with an ear for this to give a listen and tell me if you hear anything intelligent.  I am in a terrible radio zone here in Mexico so I have high hopes on EVP maker and the file Stefan provided.  Also excited about the fact that so many others are getting excellent communications.  Thank you to anyone who takes the time to listen to and confirm my recordings.  I am beginning to feel like I am being blocked out like William had thought.  Maybe I am in a true dead zone, no pun intended, or &quot;they&quot; don&#39;t want me in the loop for some reason.  Ron L\n   \n\n\nbhali333 &lt;paranormalinvestigating@...&gt; wrote:       \nTo all that are experimenting with the EVPM allaphone file method.\n\nI have done a few sessions with this method as I know a few other \nresearchers have.\nThere have been a couple of researchers that have done sessions and \ngotten very similar responses such as the name &quot;Arthur&quot; and responses \npertaining to &quot;Air&quot; also &quot;I am here&quot; or &quot;here&quot;.\n\nI have also gotten direct and intelligible answers to questions \nimmediately following the question, and messages that could never be \nconstrued as random.\n\nThe test that I propose and the answer I seek is, The words that keep \ncoming up to almost all researchers experimenting with this method IE \nthe words I mentioned above.\n\nI would like to find out whether these certain words are simply by \nproducts of everyone using the same file and come up as a result of \nthe file playing in evpm, or are they true entity communication.\n\nThe only questionable content are these few words not all the methods \ncommunication. In my opinion the majority of the communication from \nthis method is genuine.\nThe method has produced communication including my name to me as well \nas other researchers that have gotten my name, and some of the \nstatements and responses show signs of a sense of humor that would \nsurely be absent in random word grouping.\n\nWho ever is involved with experimentation of this method, will you \nplease on your next session ask that if there is a spirit named \nArthur for him not to mention his name or the list of words that I \nhave posted. I suggest that this request be made verbally before the \nsession as well as after.\n\nAnd in the most polite manner. They seem to respond better to \nformality.\n\nplease dedicate one session no shorter than 2 minutes to this \nexperiment and post your results.\n\nYour cooperation appreciated.\n\nBruce\n\n\n\n\n    \n---------------------------------\n  You rock. That&#39;s why Blockbuster&#39;s offering you one month of Blockbuster Total Access, No Cost.  \n\n                           \n\n       \n---------------------------------\nYou rock. That&#39;s why Blockbuster&#39;s offering you one month of Blockbuster Total Access, No Cost.\r\n--0-2146307076-1207257264=:69315\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nI can&#39;t find the file ronriko. I think I&#39;ve seen before, but not sure where!&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;Ron Lederer &lt;ronriko@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;div&gt;To Bruce, Stefan and others using EVPM.   &lt;DIV&gt;I&nbsp;have posted a file of&nbsp;my test with EVPM allaphones under ronriko files.&nbsp; I forward this&nbsp;for two reasons:&nbsp; the first as a request from Bruce to determine recurring words and second because I wanted to have experienced ears hear my recording for comments.&nbsp;&nbsp; Regarding the test, this is&nbsp;just&nbsp;30 secs&nbsp;or so of a 7 minute\n recording.&nbsp; Recorded at 90% using EVPmaker with xcross.&nbsp; I was able to hear &quot;art and arthor&quot; a number of times within the 7 minutes.&nbsp; This is after requesting no names be spoken.&nbsp; &lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;  &lt;DIV&gt;Regarding my experiences with evpmaker and the allaphone file sent by Stefan, I must say my results have been underwhelming.&nbsp; I hear nothing but evp gibberish.&nbsp; I ask that anyone with an ear for this to give a listen and tell me if you hear anything intelligent.&nbsp; I am in a terrible radio zone here in &lt;SPAN class=yshortcuts id=lw_1207251113_0 style=&quot;CURSOR: hand; BORDER-BOTTOM: #0066cc 1px dashed&quot;&gt;Mexico&lt;/SPAN&gt; so I have high hopes on EVP maker and the file Stefan provided.&nbsp; Also excited about the fact that so many others are getting excellent communications.&nbsp; Thank you to anyone who takes the time to listen to and confirm my recordings.&nbsp; I am beginning to feel like I am being blocked out like William had\n thought.&nbsp; Maybe I am in a true dead zone, no pun intended, or &quot;they&quot; don&#39;t want me in the loop for some reason.&nbsp; Ron L&lt;/DIV&gt;  &lt;DIV&gt;&nbsp;&lt;/DIV&gt;&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;bhali333 &lt;paranormalinvestiga&lt;WBR&gt;ting@hotmail.&lt;WBR&gt;com&gt;&lt;/I&gt;&lt;/B&gt; wrote:   &lt;BLOCKQUOTE class=replbq style=&quot;BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;DIV&gt;&lt;BR&gt;To all that are experimenting with the EVPM allaphone file method.&lt;BR&gt;&lt;BR&gt;I have done a few sessions with this method as I know a few other &lt;BR&gt;researchers have.&lt;BR&gt;There have been a couple of researchers that have done sessions and &lt;BR&gt;gotten very similar responses such as the name &quot;Arthur&quot; and responses &lt;BR&gt;pertaining to &quot;Air&quot; also &quot;I am here&quot; or &quot;here&quot;.&lt;BR&gt;&lt;BR&gt;I have also gotten direct and intelligible answers to questions &lt;BR&gt;immediately following the question, and messages that could never be &lt;BR&gt;construed as random.&lt;BR&gt;&lt;BR&gt;The test that I propose and the answer I seek is, The words that keep &lt;BR&gt;coming up to almost all researchers\n experimenting with this method IE &lt;BR&gt;the words I mentioned above.&lt;BR&gt;&lt;BR&gt;I would like to find out whether these certain words are simply by &lt;BR&gt;products of everyone using the same file and come up as a result of &lt;BR&gt;the file playing in evpm, or are they true entity communication.&lt;BR&gt;&lt;BR&gt;The only questionable content are these few words not all the methods &lt;BR&gt;communication. In my opinion the majority of the communication from &lt;BR&gt;this method is genuine.&lt;BR&gt;The method has produced communication including my name to me as well &lt;BR&gt;as other researchers that have gotten my name, and some of the &lt;BR&gt;statements and responses show signs of a sense of humor that would &lt;BR&gt;surely be absent in random word grouping.&lt;BR&gt;&lt;BR&gt;Who ever is involved with experimentation of this method, will you &lt;BR&gt;please on your next session ask that if there is a spirit named &lt;BR&gt;Arthur for him not to mention his name or the list of words that I &lt;BR&gt;have posted. I suggest that this request be made\n verbally before the &lt;BR&gt;session as well as after.&lt;BR&gt;&lt;BR&gt;And in the most polite manner. They seem to respond better to &lt;BR&gt;formality.&lt;BR&gt;&lt;BR&gt;please dedicate one session no shorter than 2 minutes to this &lt;BR&gt;experiment and post your results.&lt;BR&gt;&lt;BR&gt;Your cooperation appreciated.&lt;BR&gt;&lt;BR&gt;Bruce&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;  &lt;div&gt;  &lt;HR SIZE=1&gt;  You rock. That&#39;s why Blockbuster&#39;&lt;WBR&gt;s offering you &lt;A href=&quot;http://us.rd.yahoo.com/evt=47523/*http://tc.deals.yahoo.com/tc/blockbuster/text5.com&quot;&gt;one month of Blockbuster Total Access&lt;/A&gt;, No Cost.  &lt;div&gt;&lt;/div&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;p&gt;&#32;\n\n\n\n      &lt;hr size=1&gt;You rock. That&#39;s why Blockbuster&#39;s offering you &lt;a href=&quot;http://us.rd.yahoo.com/evt=47523/*http://tc.deals.yahoo.com/tc/blockbuster/text5.com&quot;&gt;one month of Blockbuster Total Access&lt;/a&gt;, No Cost.\r\n--0-2146307076-1207257264=:69315--"}