{"id": "8866", "subject": "for Stefan  Re: [EVP-ITC] EVP Maker (allaphone file) Method Test", "author": "itcdeadpeople", "timestamp": "2008-04-04T00:16:48Z", "full_text": "Hi Ron.  Your example doesn&#39;t sound anything like that of my session, or the sessions of \nothers I&#39;ve heard.  I&#39;ll be interested in hearing what you get with the new download of the \n72 allophones file (there definitely should not be a beep in there) and double check to \nmake sure you&#39;ve selected the CUE option.\n\nI agree with Stephan, that it takes some getting used to the sound (by the way, turn the \nvolume of the recording down, which will have prevent the distortion that is present in \nyour current example.)  I also agree that having experience in traditional EVP work helps, \nand I, too, recommend that people (not saying this is your case, I don&#39;t know what your \nexperience is) should gain a foundation in traditional EVP work, prior to jumping into \nsweep/box/EVPM research.  Though clearly, it isn&#39;t necessary to do so in order to obtain \ngood results with these methods.  :0)\n\nMargaret\n\n--- In EVP-ITC@yahoogroups.com, Stefan Bion &lt;yahoogroups@...&gt; wrote:\n&gt;\n&gt; Hi Ron,\n&gt; \n&gt; I don&#39;t think that it&#39;s possible to *not* get EVP. However, it needs\n&gt; some practice to recognize them; one has to get used to the specific\n&gt; sound, rhythm and grammar of EVP. Perhaps it is better for newbies to\n&gt; start with the basic recording techniques to learn hearing EVP and\n&gt; distinguish between what real EVP could be, and what probably not, i.e.\n&gt; use only recorder + microphone, and later then perhaps natural or\n&gt; artificial background sounds like water or radio as a &quot;raw material&quot;.\n&gt; \n&gt; As to your EVPmaker recording, in the original file there aren&#39;t any\n&gt; beeps. You should perhaps re-download the file:\n&gt; http://tech.groups.yahoo.com/group/EVP-ITC/files/Stefan/SJ-Allophones.wav\n&gt; And also do use EVPmaker&#39;s Cue List option, since otherwise EVPmaker\n&gt; doesn&#39;t play the individual allophones but only chopped fragments from\n&gt; the file.\n&gt; \n&gt; Stefan\n&gt; \n&gt; -- \n&gt; \n&gt; &gt; Hi Stefan I used your file. I just checked the original you sent and\n&gt; &gt; there is a beep in the front which probably gets duplicated in EVP\n&gt; &gt; maker. Need to figure out a way to eliminate.\n&gt;    \n&gt; &gt; One question for you. Have you found newbees like me can do many\n&gt; &gt; sessions without results? I have done possibly 12 to 15 sessions.\n&gt; &gt; Ziltch! Nada! I trust the process but it ain&#39;t paying off yet. Gotta\n&gt; &gt; make something happen. I do appreciate your help. Ron L\n&gt;"}