{"id": "8895", "subject": "Re: Couple from Joe&#39;s Box this morning", "author": "Steve Hultay", "timestamp": "2008-04-04T12:43:49Z", "full_text": "Kristin,\n\nYeah, i went back and listened and caught the end of that file.  But \nlike you said, it is a bit rough to catch.  Yeah, i want to believe \nthat they are dead too but i can&#39;t be sure of that.  We may never \nknow who is speaking through these devices, all i know is that they \nare and it fascinates me.  We need clearer communication to get the \nwhole story, i think we have made great progress here though.  I am \nlight years ahead of where i was this time last year, so it is \ngetting better all the time.  All we can do is stay dedicated to this \nand hopefully there will be a breakthrough someday.\n\n-Steve H.\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;Kristin Morris&quot; &lt;ckmorris95@...&gt; \nwrote:\n&gt;\n&gt; I heard all of those as you did.. but I read Margaret&#39;s response to \nyour\n&gt; files and I agree that I hear Mother Fkr at the end of the Adios \nclip.  It&#39;s\n&gt; rough but there.\n&gt; \n&gt; And I have no clue who these spirits are.  My gut tells me they are \npeople\n&gt; who have died.. but I can&#39;t say if my gut is right or not.  I \nnoticed they\n&gt; don&#39;t like to talk about themselves.  Why the big secret?  To me \nthat is the\n&gt; bigger mystery.\n&gt; \n&gt; k\n&gt; \n&gt;  \n&gt; \n&gt;   _____  \n&gt; \n&gt; From: EVP-ITC@yahoogroups.com [mailto:EVP-ITC@yahoogroups.com] On \nBehalf Of\n&gt; Steve Hultay\n&gt; Sent: Thursday, April 03, 2008 10:18 PM\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Subject: [EVP-ITC] Couple from Joe&#39;s Box this morning\n&gt; \n&gt;  \n&gt; \n&gt; \n&gt; Couple pretty good files in here, sorry for the cursing file. That \n&gt; makes this more real to me and they know that. I don&#39;t believe they \n&gt; curse because they don&#39;t like me, i think they know i post the \naudio \n&gt; for others to hear and want to prove their existence. I also got \n&gt; the &quot;Are We Dead?&quot; file. That maybe the first clear message that&#39;s \n&gt; relevant to what we are doing, it must be grounded spirits asking \n&gt; that. If anyone has any thoughts of who would say that, it may be \n&gt; another discussion. Maybe it&#39;s not grounded spirits, but whom than?\n&gt; \n&gt; -Steve H.\n&gt;"}