{"id": "8975", "subject": "Re: Hi all, question from a new comer ~ mic adapter?", "author": "itcdeadpeople", "timestamp": "2008-04-05T09:47:04Z", "full_text": "Hi Laura.  I use Audacity to record box/radio sweep sessions, but I find that using it for \n&#39;traditional&#39; EVP purposes hasn&#39;t worked for me.  When I do traditional EVP sessions, I use \nany of my digital recorders (which is where the EVP seem to be formed best, not when \nusing the computer) then play the file from my recorder into my computer, so I can better \nreview the content of the session as well as edit, save, share, etc.  So yes, you still need a \npatch cable.  :-)\n\nI think the confusion may have been when you told them at Radio Shack that you wanted \nto connect your mic of the recorder to the mic of your computer??  What you want to do is \nconnect the EAR/HEADPHONE to the computer.  So, instead of listening through the \nspeaker of the recorder, or plugging in headphones and listening with your ears, you are \ngoing to play the file and let your computer hear it through the cable.  Hope that makes \nsense.\n\nJust press the record button on Audacity, then press the play button on your recorder, and \nit will start recording in the computer.  Then save your session.  After that you can edit, \nisolate areas, export WAV files, etc.  If you want to be able to export MP3 format, you have \nto download/install the LAME add-on for Audacity.  \n\nMargaret\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;lunalamia&quot; &lt;rainspirit1@...&gt; wrote:\n&gt;\n&gt; Hey, thanks Margaret.  I will look for it.  I asked about a cord for \n&gt; that yesterday when I was there and bought the 20-125 I am working on.\n&gt; \n&gt; They said no, there was nothing that would do that.  I am going to go \n&gt; back and talk to someone else now!  Thank you very much.\n&gt; \n&gt; I have audacity on my computer, just haven&#39;t used it yet.  So if I \n&gt; use that, I don&#39;t even really need a patch cord?  Just the mic?\n&gt; I am VERY new to this....can&#39;t you tell?  ;)\n&gt; \n&gt; ~ Laura\n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;itcdeadpeople&quot; &lt;ITCdeadpeople@&gt; \n&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hi Laura.  There&#39;s a patch cord available from radio shack for \n&gt; about $5.  You connect one \n&gt; &gt; end to the ear jack of the recorder and the other to the &#39;sound in&#39; \n&gt; on the computer.  I use \n&gt; &gt; a freeware program called Audacity to record.  Just play the file \n&gt; into the computer (rather \n&gt; &gt; than doing an actual transfer).  Hope this helps some.\n&gt; &gt; \n&gt; &gt; Margaret\n&gt;"}