{"id": "8976", "subject": "Re: Difference between new 12-470 and old one?", "author": "itcdeadpeople", "timestamp": "2008-04-05T10:02:12Z", "full_text": "Hi Laura.  I would recommend you buy BOTH of the old 12-470&#39;s, as those units are very \nhard to come by.  I&#39;m sure someone would be happy to buy the second one from you, and \nyou can make use of the first.  If you don&#39;t like it, you can sell it too. \n\nI&#39;ve not tried the 20-125 or the 12-820, so someone else will have to give you feedback \nabout how they all compare.  The one that really stands out (in not a good way) from the \nother hackables is the new 12-469.  It has an annoying click-click-clicking, which some \ncan easily tune out and others cannot.  I have it, as well as the old version 12-469, and old \n12-470.\n\nFor manual radio sweep (turning the dial back and forth yourself), I like to use the Duracell \nKP028.  It comes in a 2-pack for around $30, including shipping from places like Amazon \nand eBay.  You might be able to find them in a local store.  I got mine from Costco.  Not \nsure if they have those in your area or not.  I&#39;ve had better results with this unit than I have \nany of the shack hacks, though I still find the hacks fun to play with.  \n\nOthers feel they have had better results with the hacks as compared to manual sweep.  Not \nsure if it has to do with the model of radio they are using or not.  I have tried multiple \nmanual sweep units, and that is how I came to like the Duracell as my favorite so far.  I \nalso like the Durapro emergency radio, but the thumb dial gives me blisters!\n\nI guess it&#39;s just like digital recorders ... one person can get great EVP with a certain make \nand model, while another person will get nothing with it.  LOL - for me, the Olympus I \nhave seems to be like that.  I&#39;ve never had much luck with it.\n\nOK, time for me to hit the sack.  \n\nMargaret\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;lunalamia&quot; &lt;rainspirit1@...&gt; wrote:\n&gt;\n&gt; Ok, then......we have OLD versions of 12-470&#39;s at 2 of the R.S. here in \n&gt; my town...I saw &#39;em.  They&#39;re grey and white.\n&gt; Anyone looking for one of those?  \n&gt; Are they any good for the sweep...I mean results wise?\n&gt; How do they rate against the 20-125....I might want to compare while I \n&gt; submerse myself in all this......lol.\n&gt; \n&gt; ~ Laura\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;itcdeadpeople&quot; &lt;ITCdeadpeople@&gt; \n&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hi Laura.  The new version of the 12-470 is solid black.  The old one \n&gt; is grey and white.  \n&gt; &gt; \n&gt; &gt; Margaret\n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;lunalamia&quot; &lt;rainspirit1@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; How do you tell if the RS 12-470 is the new or the old version?\n&gt; &gt; &gt; ~ Laura\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}