{"id": "8979", "subject": "Re: Few more traditional evp&#39;s", "author": "itcdeadpeople", "timestamp": "2008-04-05T15:18:50Z", "full_text": "Hi Kay.  I&#39;m guessing the ones buying these units feel that having it come &#39;ready to go&#39; is \nworth it for one reason or another.  Which makes sense.  They are paying for both a good \nand a service.  Some people might not have the tools at hand, and don&#39;t want to have to \nborrow from others.  Some people are doing all their experiments in secrecy, and do not \nwant friends or loved ones to know what they are doing.  In that case, having a unit arrive \npre-hacked would be very convenient.  \n\nThis is SO completely off topic, but are you old enough to remember &quot;Pet Rocks?&quot; (mid-\n70&#39;s)  Talking about the radios made me have the thought that people will buy most \nanything, and as long as there is a market, there will be seller to take advantage of it.  \nThis, of course, lead to remember the Pet Rock craze, which lasted about six months and \nmade the guy that came up with the idea of selling rocks with two eyes glued onto them a \nmillionaire!\n\nMargaret\n\n--- In EVP-ITC@yahoogroups.com, psfponies &lt;psfponies@...&gt; wrote:\n&gt;\n&gt; I must admit when I was first looking at getting a RS radio I would of probably paid \n$49.95 plus shipping for it already hacked. Since I couldn&#39;t find one that was already done \nI got my own and did the hack. Now that I now just how simple it is to hack the radio \n$49.95 is way to much.\n&gt;    \n&gt;   Kay\n&gt; \n&gt; itcdeadpeople &lt;ITCdeadpeople@...&gt; wrote:\n&gt;   Hi Jeff. If that is your motivation, that would be entirely up to you. ;-)\n&gt; \n&gt; I fault the buyers much more so than the sellers ... who would not be able to sell units \nlike \n&gt; this at the prices he is, if the buyers would not buy at that price. \n&gt; \n&gt; I also try not to judge people without knowing their circumstances. Most of us could use \na \n&gt; little more money in our pockets, and as long as we come by the money honestly, so be \nit. \n&gt; He has set a price. Obviously others find it fair or they would not willingly pay it. And \n&gt; people would not bid against one another to the point of the price becoming ridiculous, \n&gt; but they do. Again, can&#39;t fault the sellers for that. \n&gt; \n&gt; As I said in my early post, goods and services can only be sold for whatever the market \n&gt; will bear. We are not talking necessities here. It&#39;s a radio. A &#39;luxury&#39; item, so to speak. \n&gt; And one that could be bought and hacked for half the price. But for whatever reason, \n&gt; people are willing to buy at this premium price. \n&gt; \n&gt; If you were thinking like a business man, you&#39;d do exactly the same thing and under cut \n&gt; him by $5! LOL. Now THAT would make a statement. Selling at a loss only says, &quot;I&#39;m a \n&gt; fool.&quot; Just my thoughts on the subject. Sorry. It&#39;s my corporate mentality coming \nthough. \n&gt; I spent 15-years in the highly competitive field of computer sales where the attitude \nwas \n&gt; that of looking at what is working for others, finding a way to it better, or just as well, \n&gt; offering it at lower price that is still profitable to you, and taking as much business away \n&gt; as possible from the other guy. \n&gt; \n&gt; Margaret \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Marlboro63@ wrote:\n&gt; &gt;\n&gt; &gt; Hi Margaret,\n&gt; &gt; \n&gt; &gt; I realize that but to lose a couple of bucks might be worth it just to \n&gt; &gt; aggrevate this guy.....:)\n&gt; &gt; \n&gt; &gt; Jeff\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; **************Planning your summer road trip? Check out AOL Travel Guides. \n&gt; &gt; (http://travel.aol.com/travel-guide/united-states?ncid=aoltrv00030000000016)\n&gt; &gt;\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; ------------------------------------\n&gt; \n&gt; Yahoo! Groups Links\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;        \n&gt; ---------------------------------\n&gt; You rock. That&#39;s why Blockbuster&#39;s offering you one month of Blockbuster Total Access, \nNo Cost.\n&gt;"}