{"id": "9016", "subject": "Re: Just wondering if others emails are lost- NOTICE TO ALL MEMBERS!!", "author": "Misty", "timestamp": "2008-04-06T03:31:34Z", "full_text": "Hiyas\n\nI said this before but some of you may have missed it. For those who \npost messages to group and nothing seems to go thru. No you are not \nmoderated, no you are not blocked. The yahoo groups spam filters \nsometimes view your posts as spam and make it so that a mod has to \napprove it before its posted. This is not our doing and nothing we \ncan do to change it. Bruce seems to be its favorite target and Ive \ndone everything short of makin him owner to try and get it to quit \ndoing it. But at least once a day it chooses one of his posts and \nmarks it. As well as others here who are frequent posters.\n\nThe bigger the group gets the more I see. Unfortunately for you guys \nI work and the other mods are out of town so today the posts had to \nsit in the spam box until I get home and click the approval. \n\nThings will run smoother when the others get back. So relax. I know \nits annoying sometimes its happened to all of us.\n\nThe only thing I have noticed is when it does mark a post as spam it \nusually is a run on message with lots of other peoples posts in it. I \nsaid usually...it happens to Sumption sometimes too and he always \nremoves the extra stuff now and I havent seen his posts in the spam \nbox for a long time. I dont know if thats it, all I can see is I \nnotice you can attempt to prove that one on your own. \n\nA little test for Bruce (especially you Bruce because it really likes \nto block you), Kristen, Rees, Bryan, and Jeremy. You guys posts were \nall waiting for me when I got home tonight. Upon looking at them at a \nglance I can see they are run on messages. Not doing anything wrong \njust hittin reply and it copies the previous to yours. It&#39;s just a \nfluke in thier spam filter. I guess it sees 4-5 peoples emails and \nresponses and sees it as a chain letter or something who knows? Just \ntry it and see if it helps things go thru quicker.\n\nMisty\n\n--- In EVP-ITC@yahoogroups.com, &quot;Kristin Morris&quot; &lt;ckmorris95@...&gt; \nwrote:\n&gt;\n&gt; Yes Bryan - I have had messages take as long as 4 to 5 hours to \ncome through\n&gt; and others get caught in my spam filter.  I don&#39;t&#39; know why but it \ndoes\n&gt; happen.\n&gt; \n&gt; k\n&gt; \n&gt;  \n&gt; \n&gt;   _____  \n&gt; \n&gt; From: EVP-ITC@yahoogroups.com [mailto:EVP-ITC@yahoogroups.com] On \nBehalf Of\n&gt; Bryan Whatley\n&gt; Sent: Saturday, April 05, 2008 4:04 PM\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Subject: [EVP-ITC] Just wondering if others emails are lost\n&gt; \n&gt;  \n&gt; \n&gt; Hi all,\n&gt;   I was just wondering if others have sent email messages through \nto the\n&gt; group but they never get through, or they seem to take a very long \ntime for\n&gt; it to come through. \n&gt; Thanks,\n&gt; Bryan\n&gt; \n&gt;  \n&gt; \n&gt;   _____  \n&gt; \n&gt; You rock. That&#39;s why Blockbuster&#39;s offering you one\n&gt; \n&lt;http://us.rd.yahoo.com/evt=47523/*http:/tc.deals.yahoo.com/tc/blockbu\nster/t\n&gt; ext5.com&gt;  month of Blockbuster Total Access, No Cost.\n&gt;"}