{"id": "902", "subject": "Re: [EVP-ITC] Re: Music vs no music- a short experiment in evp-exalted carrier", "author": "Misty Dawn", "timestamp": "2007-03-25T02:44:59Z", "full_text": "--0-939572406-1174790699=:31460\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nI&#39;m tryin to wrap my tired brain around what you just said Ken LOL\n   \n  I just played it over the stereo speakers I use for the pc, turned the volume down extremely low, and recorded it with the old pc mic (which has a foil cone aparatus over it which has been there for ages). \n   \n  With the music it is often a problem they are way too loud. I sometimes have to turn my volume down because the loud crackle static is often more voice layers that can only be heard at lower volume.\n   \n  I tried using oboe music...supposedly the oboe is one of the instruments which closely replicates the human voice in sound. Not great results wise, for me. They like the guitar better. \n   \n  They also like it if I sing/hum. Little known fact about me, I sometimes have musical compositions and entire songs pop into my head in an instant and it will bug me until i sing it, hum it, or write the words down....once I do then I can go on with life as usual LOL the problem is I am about as musical as I am technical. I dont play an instrument and I have never studied music so theres no way I can write down half of what I hear but I jot the words, hum the tune, whatever and get it out of my system.\n   \n  I have one here someplace I recorded with me singing/humming and evp/someone else doing backup and singing along with me. What that&#39;s all about I still couldn&#39;t tell you. Strange but true and kinda freakish. \n   \n  Either way just try some music out guys, play it low, anything without words is preferable.\n  Record and see what pops up. Make sure ya check the reverse on that file too!\n   \n  =)\n  Misty\n   \n  kenneth b thomas &lt;kennnthomas2000@...&gt; wrote:\n          music is as far away from white noise as you can get.\n\nthere are no voice fragments for entities to manipulate\n\nvoice voltage is being added to voltage of music which acts as \ncarrier, via some inductor or nonlinear element near input.\n\naudio transformer turned backwards connected to input with large \nspeaker on8 ohm side and put at bottom of sound confining container \nlike plastic garbage can would eliminate hit-or-miss voltage \nsuperposition.\n\nuse a speaker for the microphone at bottom of wastebasket hook to \nlow side of audio transformer. voices could be about 20 times louder\n\ngoing to try it myself asap..speaker as microphone\n\n--- In EVP-ITC@yahoogroups.com, Misty Dawn &lt;bulletbabea@...&gt; wrote:\n&gt;\n&gt; I know they like to use music. In particular they can make use of \ncertain instruments to propel thier voice across. So last night I \nplayed a short clip of Joe Satriani&#39;s &quot;always with you always with \nme&quot; it contains music only, no vocals. I discovered that in the first \nfew seconds of the clip the voices were able to sustain a loud, \ncomprehensive line of communication until Satriani kicked it into \nhigh gear and the guitar notes were too loud and drowned everything \nout. Some could be heard on regular playback, most could be heard \nclearer at a slowed down rate of -74% & -30%. I then did a session \nwith no music. Both sessions lasted under 1 minute and both sessions \nhad a yeild of about 18 clips/sentences. The difference being that \nmore of the music clips were louder and clearer to understand for me \nand hopefully for you too. \n&gt; \n&gt; Heres a few of the evp clips for you to download and evaluate. \nMany are very loud so I recommend you lower the sound DOWN... ALOT \ntil you play it once to see what volume level it has. I use stereo \nspeakers so I am used to blasting my head off LOL so careful you dont \nblow a speaker or your eardrums. Even I usually turn them down \nbecause the level of vibration and noise may be too much for my dogs \nears. The process I used was the same, p1 filter only, amped at +15 \nwhich works differently depending on what comes across and what I \nused for background sound. When using music the noise level is \ndefinitely alot higher and you will need to lower your sound for \nthose LOL\n&gt; \n&gt; Only sharing some of the ones I think others can hear. The music \nsession had alot more than the nonmusic session. I will send a short \nclip of satriani (the first part where the voices were the best) so \nthat if anyone wants to give it a try they can.\n&gt; \n&gt; Misty\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; ---------------------------------\n&gt; Check out the all-new Yahoo! Mail beta - Fire up a more powerful \nemail and get things done faster.\n&gt;\n\n\n\n         \n\n \n---------------------------------\nSucker-punch spam with award-winning protection.\n Try the free Yahoo! Mail Beta.\r\n--0-939572406-1174790699=:31460\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;div&gt;I&#39;m tryin to wrap my tired brain around what you just said Ken LOL&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;I just played it over the stereo speakers I use for the pc, turned the volume down extremely low, and recorded it with the old pc mic (which has a foil cone aparatus over it which has been there for ages). &lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;With the music it is often a problem they are way too loud. I sometimes have to turn my volume down because the loud crackle static is often more voice layers that can only be heard at lower volume.&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;I tried using oboe music...supposedly the oboe is one of the instruments which closely replicates the human voice in sound. Not&nbsp;great results wise, for me. They like the guitar better. &lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;They also like it if I sing/hum. Little known fact about me,&nbsp;I sometimes have musical compositions and entire songs pop into my head in an instant and it will bug me until i sing it, hum it,\n or write the words down....once I do then I can go on with life as usual LOL the problem is I am about as musical as I am technical. I dont play an instrument and I have never studied music so theres no way I can write down half of what I hear but I jot the words, hum the tune, whatever and get it out of my system.&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;I have one here someplace I recorded with me singing/humming and evp/someone else doing backup and singing along with me. What that&#39;s all about I still couldn&#39;t tell you. Strange but true and kinda freakish. &lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Either way just try some music out guys, play it low, anything without words is preferable.&lt;/div&gt;  &lt;div&gt;Record and see what pops up. Make sure ya check the reverse on that file too!&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;=)&lt;/div&gt;  &lt;div&gt;Misty&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;&lt;B&gt;&lt;I&gt;kenneth b thomas &lt;kennnthomas2000@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/div&gt;  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px;\n MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;&lt;!-- Network content --&gt;  &lt;DIV id=ygrp-text&gt;  &lt;div&gt;music is as far away from white noise as you can get.&lt;BR&gt;&lt;BR&gt;there are no voice fragments for entities to manipulate&lt;BR&gt;&lt;BR&gt;voice voltage is being added to voltage of music which acts as &lt;BR&gt;carrier, via some inductor or nonlinear element near input.&lt;BR&gt;&lt;BR&gt;audio transformer turned backwards connected to input with large &lt;BR&gt;speaker on8 ohm side and put at bottom of sound confining container &lt;BR&gt;like plastic garbage can would eliminate hit-or-miss voltage &lt;BR&gt;superposition.&lt;BR&gt;&lt;BR&gt;use a speaker for the microphone at bottom of wastebasket hook to &lt;BR&gt;low side of audio transformer. voices could be about 20\n times louder&lt;BR&gt;&lt;BR&gt;going to try it myself asap..speaker as microphone&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;, Misty Dawn &lt;bulletbabea@&lt;WBR&gt;...&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; I know they like to use music. In particular they can make use of &lt;BR&gt;certain instruments to propel thier voice across. So last night I &lt;BR&gt;played a short clip of Joe Satriani&#39;s &quot;always with you always with &lt;BR&gt;me&quot; it contains music only, no vocals. I discovered that in the first &lt;BR&gt;few seconds of the clip the voices were able to sustain a loud, &lt;BR&gt;comprehensive line of communication until Satriani kicked it into &lt;BR&gt;high gear and the guitar notes were too loud and drowned everything &lt;BR&gt;out. Some could be heard on regular playback, most could be heard &lt;BR&gt;clearer at a slowed down rate of -74% &amp; -30%. I then did a session &lt;BR&gt;with no music. Both sessions lasted under 1 minute and both sessions &lt;BR&gt;had a yeild of about 18 clips/sentences. The\n difference being that &lt;BR&gt;more of the music clips were louder and clearer to understand for me &lt;BR&gt;and hopefully for you too. &lt;BR&gt;&gt; &lt;BR&gt;&gt; Heres a few of the evp clips for you to download and evaluate. &lt;BR&gt;Many are very loud so I recommend you lower the sound DOWN... ALOT &lt;BR&gt;til you play it once to see what volume level it has. I use stereo &lt;BR&gt;speakers so I am used to blasting my head off LOL so careful you dont &lt;BR&gt;blow a speaker or your eardrums. Even I usually turn them down &lt;BR&gt;because the level of vibration and noise may be too much for my dogs &lt;BR&gt;ears. The process I used was the same, p1 filter only, amped at +15 &lt;BR&gt;which works differently depending on what comes across and what I &lt;BR&gt;used for background sound. When using music the noise level is &lt;BR&gt;definitely alot higher and you will need to lower your sound for &lt;BR&gt;those LOL&lt;BR&gt;&gt; &lt;BR&gt;&gt; Only sharing some of the ones I think others can hear. The music &lt;BR&gt;session had alot more than the nonmusic\n session. I will send a short &lt;BR&gt;clip of satriani (the first part where the voices were the best) so &lt;BR&gt;that if anyone wants to give it a try they can.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Misty&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; ------------&lt;WBR&gt;---------&lt;WBR&gt;---------&lt;WBR&gt;---&lt;BR&gt;&gt; Check out the all-new Yahoo! Mail beta - Fire up a more powerful &lt;BR&gt;email and get things done faster.&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/div&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;p&gt;&#32;\n\n&lt;hr size=1&gt;&lt;a href=&quot;\nhttp://us.rd.yahoo.com/evt=49981/*http://advision.webevents.yahoo.com/mailbeta/features_spam.html&quot;&gt;Sucker-punch spam&lt;/a&gt; with award-winning protection.&lt;br&gt; Try the &lt;a href=&quot;\nhttp://us.rd.yahoo.com/evt=49981/*http://advision.webevents.yahoo.com/mailbeta/features_spam.html&quot;&gt;free Yahoo! Mail Beta.&lt;/a&gt;\r\n--0-939572406-1174790699=:31460--"}