{"id": "9022", "subject": "Re: Difference between new 12-470 and old one? ~ Margaret", "author": "lunalamia", "timestamp": "2008-04-06T07:13:26Z", "full_text": "I am going to go check them out again, to make sure they are the old \nones, absolutely.  They are grey and white, I know that much, and \nthey are 12-470....so I&#39;ll check next week. If they are, I will buy \nthem both, even if for someone else to give away for the cost only.\nLaura\n\n--- In EVP-ITC@yahoogroups.com, &quot;itcdeadpeople&quot; &lt;ITCdeadpeople@...&gt; \nwrote:\n&gt;\n&gt; Hi Laura.  I would recommend you buy BOTH of the old 12-470&#39;s, as \nthose units are very \n&gt; hard to come by.  I&#39;m sure someone would be happy to buy the second \none from you, and \n&gt; you can make use of the first.  If you don&#39;t like it, you can sell \nit too. \n&gt; \n&gt; I&#39;ve not tried the 20-125 or the 12-820, so someone else will have \nto give you feedback \n&gt; about how they all compare.  The one that really stands out (in not \na good way) from the \n&gt; other hackables is the new 12-469.  It has an annoying click-click-\nclicking, which some \n&gt; can easily tune out and others cannot.  I have it, as well as the \nold version 12-469, and old \n&gt; 12-470.\n&gt; \n&gt; For manual radio sweep (turning the dial back and forth yourself), \nI like to use the Duracell \n&gt; KP028.  It comes in a 2-pack for around $30, including shipping \nfrom places like Amazon \n&gt; and eBay.  You might be able to find them in a local store.  I got \nmine from Costco.  Not \n&gt; sure if they have those in your area or not.  I&#39;ve had better \nresults with this unit than I have \n&gt; any of the shack hacks, though I still find the hacks fun to play \nwith.  \n&gt; \n&gt; Others feel they have had better results with the hacks as compared \nto manual sweep.  Not \n&gt; sure if it has to do with the model of radio they are using or \nnot.  I have tried multiple \n&gt; manual sweep units, and that is how I came to like the Duracell as \nmy favorite so far.  I \n&gt; also like the Durapro emergency radio, but the thumb dial gives me \nblisters!\n&gt; \n&gt; I guess it&#39;s just like digital recorders ... one person can get \ngreat EVP with a certain make \n&gt; and model, while another person will get nothing with it.  LOL - \nfor me, the Olympus I \n&gt; have seems to be like that.  I&#39;ve never had much luck with it.\n&gt; \n&gt; OK, time for me to hit the sack.  \n&gt; \n&gt; Margaret"}