{"id": "9031", "subject": "Re: mic adapter? ~ Margaret", "author": "itcdeadpeople", "timestamp": "2008-04-06T08:38:11Z", "full_text": "You&#39;re welcome, Laura.  No need for embarrassment.  There&#39;s OODLES of stuff I don&#39;t \nknow and have to ask others for technical help, so it&#39;s nice to be able to help someone \nelse once in a while.  \n\nLOL - The running joke with my husband is when I start asking for the &quot;thingymajigger&quot; \nthat goes to the &quot;doohicky&quot; when I don&#39;t know the proper names of items.  Fortunately for \nme, he can usually figure out what I&#39;m meaning! \n\nAbsolutely, you are gonna learn and get it all together correctly.  :-)\n\nMargaret\n\n--- In EVP-ITC@yahoogroups.com, &quot;lunalamia&quot; &lt;rainspirit1@...&gt; wrote:\n&gt;\n&gt; Hey thank you Margaret.  I think you are right.  At least now I know \n&gt; what to look for, thanks to you.  How embarassing...oh well, have to \n&gt; ask if I&#39;m gonna learn and get it all together correctly. \n&gt; thanks again for your help.\n&gt; Laura\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;itcdeadpeople&quot; &lt;ITCdeadpeople@&gt; \n&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hi Laura.  I use Audacity to record box/radio sweep sessions, but I \n&gt; find that using it for \n&gt; &gt; &#39;traditional&#39; EVP purposes hasn&#39;t worked for me.  When I do \n&gt; traditional EVP sessions, I use \n&gt; &gt; any of my digital recorders (which is where the EVP seem to be \n&gt; formed best, not when \n&gt; &gt; using the computer) then play the file from my recorder into my \n&gt; computer, so I can better \n&gt; &gt; review the content of the session as well as edit, save, share, \n&gt; etc.  So yes, you still need a \n&gt; &gt; patch cable.  :-)\n&gt; &gt; \n&gt; &gt; I think the confusion may have been when you told them at Radio \n&gt; Shack that you wanted \n&gt; &gt; to connect your mic of the recorder to the mic of your computer??  \n&gt; What you want to do is \n&gt; &gt; connect the EAR/HEADPHONE to the computer.  So, instead of \n&gt; listening through the \n&gt; &gt; speaker of the recorder, or plugging in headphones and listening \n&gt; with your ears, you are \n&gt; &gt; going to play the file and let your computer hear it through the \n&gt; cable.  Hope that makes \n&gt; &gt; sense.\n&gt; &gt; \n&gt; &gt; Just press the record button on Audacity, then press the play \n&gt; button on your recorder, and \n&gt; &gt; it will start recording in the computer.  Then save your session.  \n&gt; After that you can edit, \n&gt; &gt; isolate areas, export WAV files, etc.  If you want to be able to \n&gt; export MP3 format, you have \n&gt; &gt; to download/install the LAME add-on for Audacity.  \n&gt; &gt; \n&gt; &gt; Margaret\n&gt;"}