{"id": "905", "subject": "Re: Music vs no music- a short experiment in evp-exalted carrier", "author": "kenneth b thomas", "timestamp": "2007-03-25T15:57:41Z", "full_text": "speaker as mike--got voice on first try .  male, american \nsounding &quot;thank you&quot;  that was it\n\ncarbon mic without dc bias -no result\n\ndiode- no result\n\n\nall rhe above on analogue tape recorder designed for voice \nrecording , memos.  from radio shack\n\n\ndiode presumed to need preamp just tried it anyway.\n\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;kenneth b thomas&quot; \n&lt;kennnthomas2000@...&gt; wrote:\n&gt;\n&gt; \n&gt; you guys all stay up later than i do.\n&gt; \n&gt; i tried an old carbon granule element from 1950s era telephone and \nit \n&gt; sure makes a good white noise source when dc biased.  plugged it \ninto \n&gt; analog recorder .  also functions as low gain parametric amp ala \n&gt; nathan stubblefield.  since this is almost morning for me i guess i \n&gt; will set up speaker-mic recorder now.\n&gt; \n&gt; impedance mismatch for backward audio transformer was not too bad \nfor \n&gt; lower voice frequencies.  giving serious thought to using auto \n&gt; ignition coil as earth-to-beyond input impedance matcher.\n&gt; \n&gt; tried it before but everybody complained voices sounded like CB \nradio \n&gt; voices.\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; -- In EVP-ITC@yahoogroups.com, &quot; RetroCom&quot; &lt;vfp19968@&gt; wrote:\n&gt; &gt;\n&gt; &gt; I have experimented with music and a series of filters in a \nclosed \n&gt; system. I will post an example that first plays the source and then \n&gt; the filtered result which contains a message. The message I hear \n&gt; is &quot;The filters on, give us some babbling&quot; They prefer babble over \n&gt; music but I find them much easier to pick out in an all music \npassage.\n&gt; &gt; \n&gt; &gt; Dave\n&gt; &gt; \n&gt; &gt; --- kennnthomas2000@ wrote:\n&gt; &gt; \n&gt; &gt; From: &quot;kenneth b thomas&quot; &lt;kennnthomas2000@&gt;\n&gt; &gt; To: EVP-ITC@yahoogroups.com\n&gt; &gt; Subject: [EVP-ITC] Re: Music vs no music- a short experiment in \nevp-\n&gt; exalted carrier\n&gt; &gt; Date: Sat, 24 Mar 2007 22:52:23 -0000\n&gt; &gt; \n&gt; &gt; music is as far away from white noise as you can get.\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; there are no voice fragments for entities to manipulate\n&gt; &gt; \n&gt; &gt; voice voltage is being added to voltage of music which acts as \n&gt; &gt; carrier, via some inductor or nonlinear element near input.\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; audio transformer turned backwards connected to input with large \n&gt; &gt; speaker on8 ohm side and put at bottom of sound confining \ncontainer \n&gt; &gt; like plastic garbage can  would eliminate hit-or-miss voltage \n&gt; &gt; superposition.\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; use a speaker for the microphone at bottom of wastebasket  hook \nto \n&gt; &gt; low side of audio transformer.  voices could be about 20 times \n&gt; louder\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; going to try it myself asap..speaker as microphone\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, Misty Dawn &lt;bulletbabea@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; I know they like to use music. In particular they can make use \nof \n&gt; &gt; certain instruments to propel thier voice across. So last night I \n&gt; &gt; played a short clip of Joe Satriani&#39;s &quot;always with you always \nwith \n&gt; &gt; me&quot; it contains music only, no vocals. I discovered that in the \n&gt; first \n&gt; &gt; few seconds of the clip the voices were able to sustain a loud, \n&gt; &gt; comprehensive line of communication until Satriani kicked it into \n&gt; &gt; high gear and the guitar notes were too loud and drowned \neverything \n&gt; &gt; out. Some could be heard on regular playback, most could be heard \n&gt; &gt; clearer at a slowed down rate of -74% & -30%. I then did a \nsession \n&gt; &gt; with no music. Both sessions lasted under 1 minute and both \n&gt; sessions \n&gt; &gt; had a yeild of about 18 clips/sentences. The difference being \nthat \n&gt; &gt; more of the music clips were louder and clearer to understand for \n&gt; me \n&gt; &gt; and hopefully for you too. \n&gt; &gt; &gt;    \n&gt; &gt; &gt;   Heres a few of the evp clips for you to download and \nevaluate. \n&gt; &gt; Many are very loud so I recommend you lower the sound DOWN... \nALOT \n&gt; &gt; til you play it once to see what volume level it has. I use \nstereo \n&gt; &gt; speakers so I am used to blasting my head off LOL so careful you \n&gt; dont \n&gt; &gt; blow a speaker or your eardrums. Even I usually turn them down \n&gt; &gt; because the level of vibration and noise may be too much for my \n&gt; dogs \n&gt; &gt; ears. The process I used was the same, p1 filter only, amped at \n+15 \n&gt; &gt; which works differently depending on what comes across and what I \n&gt; &gt; used for background sound. When using music the noise level is \n&gt; &gt; definitely alot higher and you will need to lower your sound for \n&gt; &gt; those LOL\n&gt; &gt; &gt;    \n&gt; &gt; &gt;   Only sharing some of the ones I think others can hear. The \n&gt; music \n&gt; &gt; session had alot more than the nonmusic session. I will send a \n&gt; short \n&gt; &gt; clip of satriani (the first part where the voices were the best) \nso \n&gt; &gt; that if anyone wants to give it a try they can.\n&gt; &gt; &gt;    \n&gt; &gt; &gt;   Misty\n&gt; &gt; &gt;    \n&gt; &gt; &gt;    \n&gt; &gt; &gt; \n&gt; &gt; &gt;  \n&gt; &gt; &gt; ---------------------------------\n&gt; &gt; &gt; Check out the all-new Yahoo! Mail beta - Fire up a more \npowerful \n&gt; &gt; email and get things done faster.\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}