{"id": "9054", "subject": "Re: Another question from a new one....what&#39;s a mini box?", "author": "itcdeadpeople", "timestamp": "2008-04-06T18:33:10Z", "full_text": "Hi Laura.  The current pricing is as follows:\n\nBasic USA Version $399 - Includes Shipping and Insurance\nCrystal Enhanced Version  $449 - Includes Shipping and Insurance\nThe pricing for the soon-to-come advanced MaxiBox has not yet been released.\n\nI think the MiniBox is very different from shack hacks.  I find that I get much more \ntechnical chatter on it, and not so much from loved ones.  Though there is a group from \nThe Big Circle which particularly likes to come through on it.  I prefer the MiniBox results \nsecond to manual radio sweep, but over the hacked radio shack units.\n\nOf course, everybody will have various opinions about the multitude of techniques and \nmodels out there, depending on their preferences and the results they get with each \nmethod.\n\nGiven that both manual radio sweep and inexpensive automated sweep units provide fairly \ngood results for most people at a far more budget-friendly price, it&#39;s hard to say whether \nor not the MiniBox is worth the price.  \n\nA couple features the MiniBox offers, that are not available for use on the regular or \nhacked units is, the ability to control both the sensitivity level of the antenna, and the rate \nat which the broadcast spectrum is swept.  This allows for fine tuning, so to speak.\n\nIf you go to the paranormalsystems.com web site, there is a video you can watch, showing \none of the early MiniBoxes and it&#39;s features.\n\nMargaret\n\n--- In EVP-ITC@yahoogroups.com, bruce halliday &lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; \n&gt; Laura, \n&gt;  \n&gt; A minibox is a spirit communication box that works on the same premise as Frank&#39;s box \nor the RS hack.\n&gt; It was developed by Paranormal systems and marketed by them for sale. It was put on \nthe market before the RS boxes where discovered\n&gt; so Because it was smaller than a frank&#39;s box, I guess they decided to name it the mini \nbox. It carried a heavy price tag. 399.00 before\n&gt; the production models and 499.00 after.\n&gt;  \n&gt; It was meant for experienced resaechers and para investigating groups. Not the average \nnew person interested in experimenting with box research.\n&gt; I own one, but have never quite gotten the caliber of communication that I recieve from \nother boxes. The RS hacks came on the seen shortly after the minibox,\n&gt; they worked just as well and you could be up and running for under 50.00. So that kind \nof put the nail in the coffin for the minibox.\n&gt;  \n&gt; I have gotten information from the inventor and distributer of the minibox, that they \nhave a newer more beefed up version they are calling the Maxi box.\n&gt; And it should be available before long.\n&gt;  \n&gt; Bruce\n&gt; Bruce Halliday \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: rainspirit1@...: Sun, 6 Apr 2008 07:34:56 +0000Subject: [EVP-ITC] \nAnother question from a new one....what&#39;s a mini box?\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Ok, what&#39;s a mini box?Logically, I&#39;d think it is a small version of Frank&#39;s original box?But, \nexperience has taught me never to assume. lol~ Laura \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Use video conversation to talk face-to-face with Windows Live Messenger.\n&gt; http://www.windowslive.com/messenger/connect_your_way.html?\nocid=TXT_TAGLM_WL_Refresh_messenger_video_042008\n&gt;"}