{"id": "9083", "subject": "Re: [EVP-ITC] Re: boxes on ebay (He charges people to do box sessions)", "author": "Michael Edwards", "timestamp": "2008-04-07T15:24:19Z", "full_text": "--0-1365074230-1207581859=:40758\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nThanks Margaret.\n   \n  If your vocation is a psychic in which patrons pay a known fee up front, and this physcic uses the box as an additional tool to get that icing on the cake, the actual voice, that I have no issues with. In every field there are crooks, so we can at best hope we are with a kind person when the meeting takes place.\n   \n  But if a person just goes out and buys a radio shack hack, and this is not their field, and they do get a message, if these individuals try and make money off the recipient of the message, that would in my book be terrible. The reason is that the spirit contacted the living to get help, and now that living person is ripping off their loved one for cash before they deliver the goods. If a spirit asks for help, we should do it for free.\n   \n  I write procedures for my company, and have been outlining a process to test with a willing spirit who wants to make contact  with their loved one.  \n   \n  So what would I or any of us need to make contact? Meaning if a spirit gave me &quot;John Smith&quot; of Norfolk, VA, confirmation would be a night mare at best. I would need to perhaps lay out a list of actuall addresses in that city and state to have the spirit tell me which one on my desk, on my list is the correct oerson, and then as you say how would this person respond to my call about my research and that a voice gave me their name and I have a recorded message for them?  \n   \n  Margaret and other colleagues on this forum, if a proven process can be initiated, the information captured very clearly, and not faint, and it has to be clear that anyone listening will hear the words, and if the spirit can confirm the info we have before them to be accurate, and if the spirit can assure us that their loved one will not be offended, then would it be ok for us to proceed? And why not?\n   \n  My plan is to set up a spirit profile along with on same page the loved one&#39;s profile. But before I actually make contact, I want to be sure that who i am contacting is the real deal, and that they will not be offended. I have been laying out canned calls, for example, &quot;Hello, my name is xyz, and I am engaged in xxx research involving EVP. (Explain what that is), and a voice picked up on my recording gave me your name, and go from there. \n   \n  Thinking out loud here, I would think that the sprit would know if their loved one would be in acceptance to me contacting them. \n   \n  I am documenting everything step by step, and I do plan to attempt contact if I have the right info. I am thinking that I need to tweak my profile to get confirmation on whether the loved one would be in acceptance of me delivering the message.\n   \n  If there are any of you that have actually contacted a loved one you did not know that a spirit asked you to contact, please advise how you handled the first call.\n   \n  I know it may take me days, weeks, months and even perhaps years to get enough info on one profile to make contact, but I really want to do this and I want to perfect it, so others can become messengers for the deceased.   \n\nitcdeadpeople &lt;ITCdeadpeople@...&gt; wrote:\n          Hi Michael. I have had the honor many times of either receiving messages for someone \nfrom their loved one and passing them on (to people I know) or in helping people learn to \nrecord for and receive their own messages. Along with research in trying to improve \ncommunication with the other side, this is my primary work with EVP... helping others who \nare grieving make contact with their loved ones. I do not charge for this.\n\nI think to charge, or attempt to charge, anyone for a service (spiritual or otherwise) on the \nbackend is slimy. However, if there is an agreement in advance about fees and services, \nthen that is up to the consenting parties. People in all types of fields get paid for their \ntime, regardless of the service being offered. If the fee is clear, the service being offered \nlegitimate, so be it. As long as people aren&#39;t being scammed. grrrr...... I don&#39;t like to see \npeople taken advantage of in any field of service (as one crooked auto mechanic tried to \ndo recently with my mother.) Double grrrrrr........ \n\nAs for figuring out who a message belongs to? I think we have to be very cautious in \ncoming forward with content in recordings that were not requested by the living loved one \nof the person in spirit. It&#39;s sort of like the doctor&#39;s creed to first do no harm. I feel unless \nyou know someone well enough to be fairly certain that your doing so would not \ntraumatize them, you have to err on the side of caution and not say anything. \n\nFor instance, there are some people who, due to their religious beliefs, could feel that you \nare being fooled by a demon or some other evil and that your saying you are in a touch \nwith a loved one of theirs is not only not true, but cruel of you to claim so. Even worse, \nwould be those who actually do believe you have heard from their loved one, but take that \nto mean they are not in &#39;Heaven&#39; (as some believe those in Heaven do not have the ability \nto communicate here.) There&#39;s all kinds of beliefs which differ from our reality that our \nloved ones can be exactly where they are supposed to be, in a good place, and still talk to \nus via EVP. We have to make sure that there is a similarity in world views.\n\nIn regard to mediumship: Even as a experienced EVPer, and having made connections with \nmy own loved ones, I still benefited from my sitting for an hour with a medium. One of \nthe really neat things is, I brought my recorders and upon playback, can actually hear EVP \nthat relates to what the medium is saying. So, as you wrote, that was icing on the cake. \nBut the sitting alone, even without the EVP heard later, provided an explanation for events \nand a peace of mind to me about something I had carried with me for 25yrs and had not \nbeen able to resolve via EVP alone. The fee for that sitting was some of the best money \nI&#39;ve ever spent in my life, as what I got from it was priceless.\n\nPersonally, I&#39;d like to see some joint studies done with mediums and EVP, each modality \nhelping to validate the other in the process. :-)\n\nMargaret\n\n--- In EVP-ITC@yahoogroups.com, Michael Edwards &lt;f1cracker75@...&gt; wrote:\n&gt;\n&gt; Amazing I take a weeks vacation and come back to 350 notes, and see this one.\n&gt; \n&gt; Both of your arguments are indeed accurate. \n&gt; \n&gt; But it is an added bonus to the recipient or customer to hear their loved one&#39;s voice on \ntape rather that by word of mouth from a gifted clairaudient, clairvoyant, psychic person. \nThat is the icing on the cake.\n&gt; \n&gt; What would bother me terribly is if any of us researchers received a message from a \nspirit in which we could actually make contact with their loved one to send the tape, and \nthen to try and charge the contactee for the recording. \n&gt; \n&gt; In my opinion if any of us receive such a message with that clarity, we should \nsend/give it to the contactee free of charge as doing so is in a sense a spiritual gift from \nthe spirit to the contactee, and we are just the messenger. I have been researching this \nconcept, and I myself hope to one day be able to receive clear and concise messages which \nwould enable me to contact the spirit&#39;s loved one to give them that message should they \nwish to receive it. And I gurantee you it will be free of charge. \n&gt; \n&gt; Have any of you received on any occasion enough info from the spirits to be able to \ncontact the loved one and give them the recording?\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Early Cuyler &lt;ecuyler@...&gt; wrote:\n&gt; How true it is.\n&gt; \n&gt; Jeremy\n&gt; \n&gt; ----- Original Message ----\n&gt; From: Steve Hultay &lt;urkel23@...&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Sent: Sunday, April 6, 2008 7:53:35 AM\n&gt; Subject: [EVP-ITC] Re: boxes on ebay\n&gt; \n&gt; \n&gt; Jeremy,\n&gt; \n&gt; There will always be a market for less educated people and some to \n&gt; take advantage of that. There is a a saying out there---- &quot;Stupid \n&gt; people don&#39;t know they&#39;re stupid&quot;. How true is that.\n&gt; \n&gt; -Steve \n&gt; \n&gt; --- In EVP-ITC@yahoogroups .com, Early Cuyler &lt;ecuyler@ &gt; wrote:\n&gt; &gt;\n&gt; &gt; Margaret, I can&#39;t argue with what you&#39;ve said. I&#39;m just saying \n&gt; there are those who take advantage and should have no business in \n&gt; doing so. One example I can give is Chris Moon. He charges people \n&gt; to do box sessions. I can&#39;t remember the exact fee, but it&#39;s \n&gt; outrageous that he&#39;s doing this, not to mention, he does so with a \n&gt; Frank&#39;s box. He is a self proclaimed medium and I&#39;ve heard from many \n&gt; sources that he is nothing but a fake. \n&gt; &gt; \n&gt; &gt; So I attribute my frustration with people of this type, but again I \n&gt; say, as long as there are people dumb enough to pay for this, then \n&gt; there will always be those who take advantage.\n&gt; &gt; \n&gt; &gt; Personally, I feel anyone who is gifted with mediumship or other \n&gt; advanced intuitive abilities should use it as a gift to help others, \n&gt; not for monetary gain.. I&#39;m not being judgmental here, that&#39;s just \n&gt; how I feel. I have a friend who is also a legitimate medium and I \n&gt; don&#39;t agree that she should use her abilities for gain, but it \n&gt; doesn&#39;t mean I like her any less. My not liking it won&#39;t change the \n&gt; fact that it happens, it&#39;s just the way things go. \n&gt; &gt; \n&gt; &gt; Do I think that Ron is taking advantage of people? No I don&#39;t. \n&gt; Ron says he uses the best parts available and that the cost of the \n&gt; Minibox is very close to what it costs to manufacture it. How close, \n&gt; I have no idea. On the other hand, I don&#39;t own one as I think $399 \n&gt; or $449 for the &quot;crystal enhanced version,&quot; is a lot to pay for a \n&gt; device that, from what I&#39;ve heard, produces the same results as a \n&gt; Radio Shack radio for $25-$40. \n&gt; &gt; \n&gt; &gt; Jeremy\n&gt; &gt; \n&gt; &gt; ----- Original Message ----\n&gt; &gt; From: itcdeadpeople &lt;ITCdeadpeople@ ...&gt;\n&gt; &gt; To: EVP-ITC@yahoogroups .com\n&gt; &gt; Sent: Saturday, April 5, 2008 1:32:28 PM\n&gt; &gt; Subject: [EVP-ITC] Re: boxes on ebay\n&gt; &gt; \n&gt; &gt; Hi Jeremy. If everyone knew about these support \n&gt; boards and that other resources are \n&gt; &gt; available to them, that would be one thing. Obviously everyone \n&gt; here is aware of that. But \n&gt; &gt; not everyone knows this place exists. \n&gt; &gt; \n&gt; &gt; And even if they do know about the boards here, how many would have \n&gt; the nerve to ask \n&gt; &gt; for help from strangers? As Bruce recently shared, he gives people \n&gt; invitations to contact \n&gt; &gt; him privately in case they are too shy just ask a question \n&gt; publicly. Which means, by the \n&gt; &gt; way, to some degree they have overcome some of that shyness in \n&gt; order to post whatever it \n&gt; &gt; was to begin with, which inspired him to make this offer. What if \n&gt; they don&#39;t even have the \n&gt; &gt; gumption to be anything more than be a look-i-loo?\n&gt; &gt; \n&gt; &gt; I&#39;m guessing many people are just surfing the net, checking out \n&gt; paranormal stuff, and run \n&gt; &gt; across the hacked boxes for sale. \n&gt; &gt; \n&gt; &gt; Again, I ask people who are taking the position you and Bruce are \n&gt; regarding profits ... do \n&gt; &gt; you have this same harsh sentiment toward Ron Ricketts, who makes \n&gt; and sells the \n&gt; &gt; MiniBoxes? I realize he is passionate about this research and \n&gt; helping others. Does that \n&gt; &gt; give him amnesty for making a profit? \n&gt; &gt; \n&gt; &gt; Personally I think we need to not be so judgmental. At what point \n&gt; does &quot;profitable gain in \n&gt; &gt; the paranormal field&quot; become &quot;sickening?&quot; I have a friend who is a \n&gt; medium. I mean THE \n&gt; &gt; REAL DEAL. He charges for his services. The fee is reasonable \n&gt; compared to many in his \n&gt; &gt; field. Does he do this because he&#39;s a terrible person looking to \n&gt; take advantage of people? \n&gt; &gt; NO, he does so because he has been given a gift that changes \n&gt; people&#39;s lives for the better. \n&gt; &gt; But he has to make a living.... has to support himself in some way. \n&gt; And because he has \n&gt; &gt; chosen to provide this service full time (and is not a trust fund \n&gt; baby), he makes a profit. \n&gt; &gt; This allows him to help far more people than he could if working \n&gt; some other kind of job \n&gt; &gt; and providing his services at no cost on the side. \n&gt; &gt; \n&gt; &gt; I realize this is not exactly the same thing as gouging people on \n&gt; the price for a \n&gt; &gt; commercially available product, but making such blanket statements \n&gt; about profitability in \n&gt; &gt; the paranormal field being sickening is rather short-sighted, in my \n&gt; opinion. \n&gt; &gt; \n&gt; &gt; I have a southern friend who likes to say, &quot;It&#39;s a mighty thin \n&gt; plank that ain&#39;t got two sides.&quot; \n&gt; &gt; I just don&#39;t think we have the right to claim that simply because \n&gt; someone is offering a \n&gt; &gt; good and or service for profit to consumers in the paranormal \n&gt; market, that this \n&gt; &gt; automatically means they are taking advantage of other&#39;s \n&gt; vulnerabilities. \n&gt; &gt; \n&gt; &gt; For Pete&#39;s sake, no one is twisting the people&#39;s arms to buy those \n&gt; units on eBay. They are \n&gt; &gt; perfectly free to buy from whatever source they choose. Since the \n&gt; units do work as \n&gt; &gt; claimed, we can argue that people have overpaid, shopped unwisely, \n&gt; or whatever. I assure \n&gt; &gt; you this happens every single day throughout the retail market \n&gt; place with all types of \n&gt; &gt; products and services. \n&gt; &gt; \n&gt; &gt; I will say I have a fairly heathy dose of distain for \n&gt; charlatans/scam artists (of any flavor in \n&gt; &gt; any field) but that is not what we are talking about here. We are \n&gt; talking about people who \n&gt; &gt; are offering legitimate products to consumers. I&#39;d rather see \n&gt; people doing this for profit, \n&gt; &gt; even when obscene, than running scams that damage people&#39;s \n&gt; physical, mental, and/or \n&gt; &gt; financial well-being. \n&gt; &gt; \n&gt; &gt; Margaret\n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups .com, Early Cuyler &lt;ecuyler@ &gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; Very well put, Bruce. Profitable gain in the paranormal field is \n&gt; sickening.. Unfortunately, \n&gt; &gt; there are those who continue to support the ones profiting, so it \n&gt; will continue. It makes \n&gt; &gt; me sick that people take advantage of others vulnerabilities, \n&gt; especially when it comes to \n&gt; &gt; spiritual matters, but that&#39;s a rant for another time and place.\n&gt; &gt; &gt; \n&gt; &gt; &gt; If someone is afraid to try hacking a radio or lacks the proper \n&gt; tools, they are more than \n&gt; &gt; welcome to send them to me and I&#39;ll do it for them and ship it \n&gt; back. As Bruce said, it&#39;s not \n&gt; &gt; for recognition, but it&#39;s to help further the research. I wouldn&#39;t \n&gt; be doing this research if it \n&gt; &gt; wasn&#39;t for Frank, Bruce, Steve and the others who put in their time \n&gt; and effort. The \n&gt; &gt; possibilities are only limited by our willingness to work \n&gt; together. The more we work \n&gt; &gt; together, the better the communication will get. \n&gt; &gt; &gt; \n&gt; &gt; &gt; Jeremy\n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; ----- Original Message ----\n&gt; &gt; &gt; From: bruce halliday &lt;paranormalinvestig ating@ &gt;\n&gt; &gt; &gt; To: evp-itc@yahoogroups .com\n&gt; &gt; &gt; Sent: Saturday, April 5, 2008 11:15:21 AM\n&gt; &gt; &gt; Subject: RE: [EVP-ITC] boxes on ebay\n&gt; &gt; &gt; \n&gt; &gt; &gt; Guy&#39;s\n&gt; &gt; &gt; \n&gt; &gt; &gt; Do not give in to these demons that are trying to make a buck \n&gt; from the research we love \n&gt; &gt; and the equipment we use.\n&gt; &gt; &gt; \n&gt; &gt; &gt; I have given away including the shipping 5 RS boxes for free, 4, \n&gt; 470&#39;s and 1 469 all \n&gt; &gt; hacked by me.\n&gt; &gt; &gt; I did not do it to gain popularity or even wanted a thank you. my \n&gt; sole motivation was to \n&gt; &gt; bring new people into the research and \n&gt; &gt; &gt; in turn change someones life and perpetuate the idea of strength \n&gt; in numbers, in this \n&gt; &gt; case strength of communication.\n&gt; &gt; &gt; \n&gt; &gt; &gt; To all new people on this board, do not patronise these wolves \n&gt; that prey on the needs \n&gt; &gt; and wants of others. \n&gt; &gt; &gt; The RS 20 -125 is everything the 470 & 469 are and a little more. \n&gt; do not let the size or \n&gt; &gt; complicated button arrangement scare you off.\n&gt; &gt; &gt; the hack is as simple as the others. \n&gt; &gt; &gt; \n&gt; &gt; &gt; Do not buy any RS hacks from ebay, they are sold with the wrong \n&gt; energy attached to \n&gt; &gt; them, spirit wise.\n&gt; &gt; &gt; That is why I and all other researchers should follow the example \n&gt; of a great man to \n&gt; &gt; whom we owe all of this research.\n&gt; &gt; &gt; Mr. Frank Sumption, who was in a position at one time to make a \n&gt; substantial amount of \n&gt; &gt; money from his boxes and\n&gt; &gt; &gt; was offered the opportunity on a silver platter. But chose to \n&gt; follow what had been asked \n&gt; &gt; of him by higher entities.\n&gt; &gt; &gt; And that was to keep the research pure for research sake. And \n&gt; that at no time was this \n&gt; &gt; equipment or knowledge there of\n&gt; &gt; &gt; to be for monetary gain.\n&gt; &gt; &gt; \n&gt; &gt; &gt; I adhere to this promise made by Frank to our friends on the \n&gt; other side and feel that \n&gt; &gt; there is no need to give in to these box \n&gt; &gt; &gt; extortionists. . If a box is not attainable for a new person yet, \n&gt; the right way. Then it \n&gt; &gt; probably is not their time yet.\n&gt; &gt; &gt; \n&gt; &gt; &gt; I have coined a phrase and believe in it. &quot;The researcher does \n&gt; not choose the box, the \n&gt; &gt; box chooses the researcher&quot;\n&gt; &gt; &gt; Be patient, those that do not yet have a box. We will do all we \n&gt; can to help you obtain \n&gt; &gt; one.\n&gt; &gt; &gt; \n&gt; &gt; &gt; Bruce\n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; Bruce Halliday \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; To: EVP-ITC@yahoogroups .com\n&gt; &gt; &gt; From: reesclarke_69@ yahoo.com\n&gt; &gt; &gt; Date: Fri, 4 Apr 2008 18:49:09 -0700\n&gt; &gt; &gt; Subject: Re: [EVP-ITC] Re: Few more traditional evp&#39;s\n&gt; &gt; &gt; \n&gt; &gt; &gt; No bodies at fault, but I would do the hack just to help more \n&gt; people get in this field. As \n&gt; &gt; Bruce sayes the more people the better comunication we will have.\n&gt; &gt; &gt; \n&gt; &gt; &gt; Rees\n&gt; &gt; &gt; \n&gt; &gt; &gt; itcdeadpeople &lt;ITCdeadpeople@ aol..com&gt; wrote:\n&gt; &gt; &gt; I just took a look at eBay and these are the NEW 12-469&#39;s. \n&gt; &gt; &gt; \n&gt; &gt; &gt; Well, all I can say is the market is driven by BUYERS. If people \n&gt; are willing to pay, you \n&gt; &gt; can&#39;t \n&gt; &gt; &gt; fault the person selling for taking advantage of what the market \n&gt; will bear. Perhaps the \n&gt; &gt; &gt; people who do not have the tools, or the skills, to do their own \n&gt; hack, feel this price is \n&gt; &gt; &gt; reasonable?\n&gt; &gt; &gt; \n&gt; &gt; &gt; Margaret\n&gt; &gt; &gt; \n&gt; &gt; &gt; --- In EVP-ITC@yahoogroups .com, &quot;psfponies&quot; &lt;psfponies@ ..&gt; \n&gt; wrote:\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; http://cgi.ebay. com/Ghost- Box-Radio- EVP-Paranormal- State-\n&gt; Franks-\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; box_W0QQitemZ200212 582012QQihZ010QQ categoryZ155297Q \n&gt; QssPageNameZWDVW \n&gt; &gt; QQ\n&gt; &gt; &gt; &gt; rdZ1QQcmdZViewItem\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; Here is the Ebay ad bids up to $51.00\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; Ghost Box Radio EVP Paranormal State Franks box Telephone to \n&gt; other \n&gt; &gt; &gt; &gt; side Haunted radio Paranormal State\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; Kay\n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; --- In EVP-ITC@yahoogroups .com, Marlboro63@ wrote:\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; &gt; Stefan,\n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; This guy who sells on Ebay does get 55.00 a unit for them. He \n&gt; is \n&gt; &gt; &gt; &gt; out f New \n&gt; &gt; &gt; &gt; &gt; York. He originally wanted 129.00 for it. I was considering \n&gt; &gt; &gt; &gt; posted a 12-469 \n&gt; &gt; &gt; &gt; &gt; for 24.95 plus shipping and I will modify it for free or if \n&gt; &gt; &gt; &gt; anyone wanted \n&gt; &gt; &gt; &gt; &gt; too I was going to post the instructions to modify one on the \n&gt; &gt; &gt; &gt; same add just to \n&gt; &gt; &gt; &gt; &gt; screw with this guy. What do you thing?\n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; Jeff\n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; In a message dated 4/4/2008 4:31:03 P.M. Central Daylight \n&gt; Time, \n&gt; &gt; &gt; &gt; &gt; reesclarke_69@ writes:\n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; On ebay I just saw a RS12-469 in a auction and the bid was \n&gt; &gt; &gt; &gt; $49.95. I can&#39;t \n&gt; &gt; &gt; &gt; &gt; believe this shit that people try to pull off.\n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; Stefan Bion &lt;yahoogroups@ yahoogroupsya&gt; wrote: \n&gt; &gt; &gt; &gt; &gt; Hi Jeremy, hi group,\n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; &gt; Holy shit! That&#39;s insane! Well, if people are paying for \n&gt; it, \n&gt; &gt; &gt; &gt; then more\n&gt; &gt; &gt; &gt; &gt; &gt; power to &#39;em.\n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; On ebay.de I saw one for €25 (about €40), what is still \n&gt; &gt; &gt; &gt; expensive for\n&gt; &gt; &gt; &gt; &gt; such an old and low-quality device.\n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; &gt; I&#39;ve been wanting to try the Raudive method with a \n&gt; germanium \n&gt; &gt; &gt; &gt; diode.\n&gt; &gt; &gt; &gt; &gt; &gt; Radio shack only carries silicon, so I&#39;ll have to order the \n&gt; &gt; &gt; &gt; germanium\n&gt; &gt; &gt; &gt; &gt; &gt; and give it a shot.\n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; You could also try a schottky diode which is more sensitive \n&gt; than a\n&gt; &gt; &gt; &gt; &gt; german diode. See: http://en.wikipedia german diogerman \n&gt; digerma\n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; Stefan\n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; ------------ --------- --------- ------\n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; Yahoo! Groups Links\n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; ____________ _________ _________ ______\n&gt; &gt; &gt; &gt; &gt; You rock. That&#39;s why Blockbuster&#39; You rock. T_one month of \n&gt; &gt; &gt; &gt; Blockbuster Total \n&gt; &gt; &gt; &gt; &gt; Access_ \n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; (http://us.rd. yahoo.com/ evt=47523/ *http://tc. deals.yahoo. \n&gt; com/tc/block\n&gt; &gt; &gt; &gt; buster/text5. com) , No Cost. \n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; ************ **Planning your summer road trip? Check out AOL \n&gt; Travel \n&gt; &gt; &gt; &gt; Guides. \n&gt; &gt; &gt; &gt; &gt; (http://travel. aol.com/travel- guide/united- states?\n&gt; &gt; &gt; &gt; ncid=aoltrv00030000 000016)\n&gt; &gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; You rock. That&#39;s why Blockbuster&#39; s offering you one month of \n&gt; Blockbuster Total Access, \n&gt; &gt; No Cost. \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; Going green? See the top 12 foods to eat organic. \n&gt; &gt; &gt; \n&gt; &gt; &gt; &lt;!--\n&gt; &gt; &gt; \n&gt; &gt; &gt; #ygrp-mkp{\n&gt; &gt; &gt; border:1px solid #d8d8d8;font- family:Arial; margin:14px \n&gt; 0px;padding: 0px 14px;}\n&gt; &gt; &gt; #ygrp-mkp hr{\n&gt; &gt; &gt; border:1px solid #d8d8d8;}\n&gt; &gt; &gt; #ygrp-mkp #hd{\n&gt; &gt; &gt; color:#628c2a; font-size: 85%;font- weight:bold; line-height: \n&gt; 122%;margin: 10px 0px;}\n&gt; &gt; &gt; #ygrp-mkp #ads{\n&gt; &gt; &gt; margin-bottom: 10px;}\n&gt; &gt; &gt; #ygrp-mkp .ad{\n&gt; &gt; &gt; padding:0 0;}\n&gt; &gt; &gt; #ygrp-mkp ..ad a{\n&gt; &gt; &gt; color:#0000ff; text-decoration: none;}\n&gt; &gt; &gt; --&gt;\n&gt; &gt; &gt; \n&gt; &gt; &gt; &lt;!--\n&gt; &gt; &gt; \n&gt; &gt; &gt; #ygrp-sponsor #ygrp-lc{\n&gt; &gt; &gt; font-family: Arial;}\n&gt; &gt; &gt; #ygrp-sponsor #ygrp-lc #hd{\n&gt; &gt; &gt; margin:10px 0px;font-weight: bold;font- size:78%; line-height: \n&gt; 122%;}\n&gt; &gt; &gt; #ygrp-sponsor #ygrp-lc .ad{\n&gt; &gt; &gt; margin-bottom: 10px;padding: 0 0;}\n&gt; &gt; &gt; --&gt;\n&gt; &gt; &gt; \n&gt; &gt; &gt; &lt;!--\n&gt; &gt; &gt; \n&gt; &gt; &gt; #ygrp-mlmsg {font-size:13px; font-family: arial, helvetica, \n&gt; clean, sans-serif;}\n&gt; &gt; &gt; #ygrp-mlmsg table {font-size:inherit; font:100% ;}\n&gt; &gt; &gt; #ygrp-mlmsg select, input, textarea {font:99% arial, helvetica, \n&gt; clean, sans-serif;}\n&gt; &gt; &gt; #ygrp-mlmsg pre, code {font:115% monospace;}\n&gt; &gt; &gt; #ygrp-mlmsg * {line-height: 1.22em;}\n&gt; &gt; &gt; #ygrp-text{\n&gt; &gt; &gt; font-family: Georgia;\n&gt; &gt; &gt; }\n&gt; &gt; &gt; #ygrp-text p{\n&gt; &gt; &gt; margin:0 0 1em 0;}\n&gt; &gt; &gt; #ygrp-tpmsgs{\n&gt; &gt; &gt; font-family: Arial;\n&gt; &gt; &gt; clear:both;}\n&gt; &gt; &gt; #ygrp-vitnav{\n&gt; &gt; &gt; padding-top: 10px;font- family:Verdana; font-size: 77%;margin: 0;}\n&gt; &gt; &gt; #ygrp-vitnav a{\n&gt; &gt; &gt; padding:0 1px;}\n&gt; &gt; &gt; #ygrp-actbar{\n&gt; &gt; &gt; clear:both;margin: 25px 0;white-space: nowrap;color: #666;text- \n&gt; align:right; }\n&gt; &gt; &gt; #ygrp-actbar .left{\n&gt; &gt; &gt; float:left;white- space:nowrap; }\n&gt; &gt; &gt; .bld{font-weight: bold;}\n&gt; &gt; &gt; #ygrp-grft{\n&gt; &gt; &gt; font-family: Verdana;font- size:77%; padding:15px 0;}\n&gt; &gt; &gt; #ygrp-ft{\n&gt; &gt; &gt; font-family: verdana;font- size:77%; border-top: 1px solid #666;\n&gt; &gt; &gt; padding:5px 0;\n&gt; &gt; &gt; }\n&gt; &gt; &gt; #ygrp-mlmsg #logo{\n&gt; &gt; &gt; padding-bottom: 10px;}\n&gt; &gt; &gt; \n&gt; &gt; &gt; #ygrp-reco {\n&gt; &gt; &gt; margin-bottom: 20px;padding: 0px;}\n&gt; &gt; &gt; #ygrp-reco #reco-head {\n&gt; &gt; &gt; font-weight: bold;color: #ff7900;}\n&gt; &gt; &gt; \n&gt; &gt; &gt; #reco-grpname{\n&gt; &gt; &gt; font-weight: bold;margin- top:10px; }\n&gt; &gt; &gt; #reco-category{\n&gt; &gt; &gt; font-size:77% ;}\n&gt; &gt; &gt; #reco-desc{\n&gt; &gt; &gt; font-size:77% ;}\n&gt; &gt; &gt; \n&gt; &gt; &gt; #ygrp-vital{\n&gt; &gt; &gt; background-color: #e0ecee;margin- bottom:20px; padding:2px 0 8px \n&gt; 8px;}\n&gt; &gt; &gt; #ygrp-vital #vithd{\n&gt; &gt; &gt; font-size:77% ;font-family: Verdana;font- weight:bold; \n&gt; color:#333; text-\n&gt; &gt; transform:uppercase ;}\n&gt; &gt; &gt; #ygrp-vital ul{\n&gt; &gt; &gt; padding:0;margin: 2px 0;}\n&gt; &gt; &gt; #ygrp-vital ul li{\n&gt; &gt; &gt; list-style-type: none;clear: both;border: 1px solid #e0ecee;\n&gt; &gt; &gt; }\n&gt; &gt; &gt; #ygrp-vital ul li .ct{\n&gt; &gt; &gt; font-weight: bold;color: #ff7900;float: right;width: 2em;text- \n&gt; align:right; padding-\n&gt; &gt; right:.5em;}\n&gt; &gt; &gt; #ygrp-vital ul li .cat{\n&gt; &gt; &gt; font-weight: bold;}\n&gt; &gt; &gt; #ygrp-vital a{\n&gt; &gt; &gt; text-decoration: none;}\n&gt; &gt; &gt; \n&gt; &gt; &gt; #ygrp-vital a:hover{\n&gt; &gt; &gt; text-decoration: underline; }\n&gt; &gt; &gt; \n&gt; &gt; &gt; #ygrp-sponsor #hd{\n&gt; &gt; &gt; color:#999;font- size:77%; }\n&gt; &gt; &gt; #ygrp-sponsor #ov{\n&gt; &gt; &gt; padding:6px 13px;background- color:#e0ecee; margin-bottom: 20px;}\n&gt; &gt; &gt; #ygrp-sponsor #ov ul{\n&gt; &gt; &gt; padding:0 0 0 8px;margin:0; }\n&gt; &gt; &gt; #ygrp-sponsor #ov li{\n&gt; &gt; &gt; list-style-type: square;padding: 6px 0;font-size: 77%;}\n&gt; &gt; &gt; #ygrp-sponsor #ov li a{\n&gt; &gt; &gt; text-decoration: none;font- size:130% ;}\n&gt; &gt; &gt; #ygrp-sponsor #nc{\n&gt; &gt; &gt; background-color: #eee;margin- bottom:20px; padding:0 8px;}\n&gt; &gt; &gt; #ygrp-sponsor .ad{\n&gt; &gt; &gt; padding:8px 0;}\n&gt; &gt; &gt; #ygrp-sponsor .ad #hd1{\n&gt; &gt; &gt; font-family: Arial;font- weight:bold; color:#628c2a; font-size: \n&gt; 100%;line- height:122% ;}\n&gt; &gt; &gt; #ygrp-sponsor .ad a{\n&gt; &gt; &gt; text-decoration: none;}\n&gt; &gt; &gt; #ygrp-sponsor .ad a:hover{\n&gt; &gt; &gt; text-decoration: underline; }\n&gt; &gt; &gt; #ygrp-sponsor .ad p{\n&gt; &gt; &gt; margin:0;}\n&gt; &gt; &gt; o{font-size: 0;}\n&gt; &gt; &gt; .MsoNormal{\n&gt; &gt; &gt; margin:0 0 0 0;}\n&gt; &gt; &gt; #ygrp-text tt{\n&gt; &gt; &gt; font-size:120% ;}\n&gt; &gt; &gt; blockquote{margin: 0 0 0 4px;}\n&gt; &gt; &gt; .replbq{margin: 4;}\n&gt; &gt; &gt; --&gt;\n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; ____________ _________ _________ _________ _________ _________ _\n&gt; &gt; &gt; You rock. That&#39;s why Blockbuster&#39; s offering you one month of \n&gt; Blockbuster Total Access, \n&gt; &gt; No Cost. \n&gt; &gt; &gt; http://tc.deals. yahoo.com/ tc/blockbuster/ text5.com\n&gt; &gt; &gt;\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; &lt;!--\n&gt; &gt; \n&gt; &gt; #ygrp-mkp{\n&gt; &gt; border:1px solid #d8d8d8;font- family:Arial; margin:14px \n&gt; 0px;padding: 0px 14px;}\n&gt; &gt; #ygrp-mkp hr{\n&gt; &gt; border:1px solid #d8d8d8;}\n&gt; &gt; #ygrp-mkp #hd{\n&gt; &gt; color:#628c2a; font-size: 85%;font- weight:bold; line-\n&gt; height:122%; margin:10px 0px;}\n&gt; &gt; #ygrp-mkp #ads{\n&gt; &gt; margin-bottom: 10px;}\n&gt; &gt; #ygrp-mkp .ad{\n&gt; &gt; padding:0 0;}\n&gt; &gt; #ygrp-mkp .ad a{\n&gt; &gt; color:#0000ff; text-decoration: none;}\n&gt; &gt; --&gt;\n&gt; &gt; \n&gt; &gt; &lt;!--\n&gt; &gt; \n&gt; &gt; #ygrp-sponsor #ygrp-lc{\n&gt; &gt; font-family: Arial;}\n&gt; &gt; #ygrp-sponsor #ygrp-lc #hd{\n&gt; &gt; margin:10px 0px;font-weight: bold;font- size:78%; line-height: 122%;}\n&gt; &gt; #ygrp-sponsor #ygrp-lc .ad{\n&gt; &gt; margin-bottom: 10px;padding: 0 0;}\n&gt; &gt; --&gt;\n&gt; &gt; \n&gt; &gt; &lt;!--\n&gt; &gt; \n&gt; &gt; #ygrp-mlmsg {font-size:13px; font-family: arial, helvetica, \n&gt; clean, sans-serif;}\n&gt; &gt; #ygrp-mlmsg table {font-size:inherit; font:100% ;}\n&gt; &gt; #ygrp-mlmsg select, input, textarea {font:99% arial, helvetica, \n&gt; clean, sans-serif;}\n&gt; &gt; #ygrp-mlmsg pre, code {font:115% monospace;}\n&gt; &gt; #ygrp-mlmsg * {line-height: 1.22em;}\n&gt; &gt; #ygrp-text{\n&gt; &gt; font-family: Georgia;\n&gt; &gt; }\n&gt; &gt; #ygrp-text p{\n&gt; &gt; margin:0 0 1em 0;}\n&gt; &gt; #ygrp-tpmsgs{\n&gt; &gt; font-family: Arial;\n&gt; &gt; clear:both;}\n&gt; &gt; #ygrp-vitnav{\n&gt; &gt; padding-top: 10px;font- family:Verdana; font-size: 77%;margin: 0;}\n&gt; &gt; #ygrp-vitnav a{\n&gt; &gt; padding:0 1px;}\n&gt; &gt; #ygrp-actbar{\n&gt; &gt; clear:both;margin: 25px 0;white-space: nowrap;color: #666;text-\n&gt; align:right; }\n&gt; &gt; #ygrp-actbar .left{\n&gt; &gt; float:left;white- space:nowrap; }\n&gt; &gt; .bld{font-weight: bold;}\n&gt; &gt; #ygrp-grft{\n&gt; &gt; font-family: Verdana;font- size:77%; padding:15px 0;}\n&gt; &gt; #ygrp-ft{\n&gt; &gt; font-family: verdana;font- size:77%; border-top: 1px solid #666;\n&gt; &gt; padding:5px 0;\n&gt; &gt; }\n&gt; &gt; #ygrp-mlmsg #logo{\n&gt; &gt; padding-bottom: 10px;}\n&gt; &gt; \n&gt; &gt; #ygrp-reco {\n&gt; &gt; margin-bottom: 20px;padding: 0px;}\n&gt; &gt; #ygrp-reco #reco-head {\n&gt; &gt; font-weight: bold;color: #ff7900;}\n&gt; &gt; \n&gt; &gt; #reco-grpname{\n&gt; &gt; font-weight: bold;margin- top:10px; }\n&gt; &gt; #reco-category{\n&gt; &gt; font-size:77% ;}\n&gt; &gt; #reco-desc{\n&gt; &gt; font-size:77% ;}\n&gt; &gt; \n&gt; &gt; #ygrp-vital{\n&gt; &gt; background-color: #e0ecee;margin- bottom:20px; padding:2px 0 8px 8px;}\n&gt; &gt; #ygrp-vital #vithd{\n&gt; &gt; font-size:77% ;font-family: Verdana;font- weight:bold; color:#333; text-\n&gt; transform:uppercase ;}\n&gt; &gt; #ygrp-vital ul{\n&gt; &gt; padding:0;margin: 2px 0;}\n&gt; &gt; #ygrp-vital ul li{\n&gt; &gt; list-style-type: none;clear: both;border: 1px solid #e0ecee;\n&gt; &gt; }\n&gt; &gt; #ygrp-vital ul li .ct{\n&gt; &gt; font-weight: bold;color: #ff7900;float: right;width: 2em;text-\n&gt; align:right; padding-right: .5em;}\n&gt; &gt; #ygrp-vital ul li .cat{\n&gt; &gt; font-weight: bold;}\n&gt; &gt; #ygrp-vital a{\n&gt; &gt; text-decoration: none;}\n&gt; &gt; \n&gt; &gt; #ygrp-vital a:hover{\n&gt; &gt; text-decoration: underline; }\n&gt; &gt; \n&gt; &gt; #ygrp-sponsor #hd{\n&gt; &gt; color:#999;font- size:77%; }\n&gt; &gt; #ygrp-sponsor #ov{\n&gt; &gt; padding:6px 13px;background- color:#e0ecee; margin-bottom: 20px;}\n&gt; &gt; #ygrp-sponsor #ov ul{\n&gt; &gt; padding:0 0 0 8px;margin:0; }\n&gt; &gt; #ygrp-sponsor #ov li{\n&gt; &gt; list-style-type: square;padding: 6px 0;font-size: 77%;}\n&gt; &gt; #ygrp-sponsor #ov li a{\n&gt; &gt; text-decoration: none;font- size:130% ;}\n&gt; &gt; #ygrp-sponsor #nc{\n&gt; &gt; background-color: #eee;margin- bottom:20px; padding:0 8px;}\n&gt; &gt; #ygrp-sponsor .ad{\n&gt; &gt; padding:8px 0;}\n&gt; &gt; #ygrp-sponsor .ad #hd1{\n&gt; &gt; font-family: Arial;font- weight:bold; color:#628c2a; font-\n&gt; size:100%;line- height:122% ;}\n&gt; &gt; #ygrp-sponsor .ad a{\n&gt; &gt; text-decoration: none;}\n&gt; &gt; #ygrp-sponsor .ad a:hover{\n&gt; &gt; text-decoration: underline; }\n&gt; &gt; #ygrp-sponsor .ad p{\n&gt; &gt; margin:0;}\n&gt; &gt; o{font-size: 0;}\n&gt; &gt; .MsoNormal{\n&gt; &gt; margin:0 0 0 0;}\n&gt; &gt; #ygrp-text tt{\n&gt; &gt; font-size:120% ;}\n&gt; &gt; blockquote{margin: 0 0 0 4px;}\n&gt; &gt; .replbq{margin: 4;}\n&gt; &gt; --&gt;\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; ____________ _________ _________ _________ _________ _________ _\n&gt; ____________ __\n&gt; &gt; You rock. That&#39;s why Blockbuster&#39; s offering you one month of \n&gt; Blockbuster Total Access, No Cost. \n&gt; &gt; http://tc.deals. yahoo.com/ tc/blockbuster/ text5.com\n&gt; &gt;\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; ---------------------------------\n&gt; You rock. That&#39;s why Blockbuster&#39;s offering you one month of Blockbuster Total \nAccess, No Cost.. \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Michael Edwards: Cary, North Carolina. f1cracker75@...\n&gt; \n&gt; ---------------------------------\n&gt; You rock. That&#39;s why Blockbuster&#39;s offering you one month of Blockbuster Total Access, \nNo Cost.\n&gt;\n\n\n\n                           \n\n\nMichael Edwards: Cary, North Carolina. f1cracker75@...\n       \n---------------------------------\nYou rock. That&#39;s why Blockbuster&#39;s offering you one month of Blockbuster Total Access, No Cost.\r\n--0-1365074230-1207581859=:40758\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;div&gt;Thanks Margaret.&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;If your vocation is a psychic in which patrons pay a known fee up front, and this physcic uses the box as an additional tool to get that icing on the cake, the actual voice, that I have no issues with. In every field there are crooks, so we can at best hope we are with a kind person when the meeting takes place.&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;But if a person just goes out and buys a radio shack hack, and this is not their field, and they do get a message, if these individuals try and make money off the recipient of the message, that would in my book be terrible. The reason is that the spirit contacted the living to get help, and now that living person is ripping off their loved one for cash before they deliver the goods. If a spirit asks for help, we should do it for free.&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;I write procedures for my company, and have been outlining a process to test with a willing spirit who wants to make\n contact&nbsp; with their loved one.&nbsp; &lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;So what would I or any of us need to make contact? Meaning if a spirit gave me &quot;John Smith&quot; of Norfolk, VA, confirmation would be a night mare at best. I would need to perhaps lay out a list of actuall addresses in that city and state to have the spirit tell me which one on my desk, on my list is the correct oerson, and then as you say how would this person respond to my call about my research and that a voice gave me their name and I have a recorded message for them?&nbsp; &lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Margaret and other colleagues on this forum, if a proven process can be initiated, the information captured very clearly, and not faint, and it has to be clear that anyone listening will hear the words, and if the spirit can confirm the info we have before them to be accurate, and if the spirit can assure us that their loved one will not be offended, then would it be ok for us to proceed? And why\n not?&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;My plan is to set up a spirit profile along with on same page the loved one&#39;s profile. But before I actually make contact, I want to be sure that who i am contacting is the real deal, and that they will not be offended. I have been laying out canned calls, for example, &quot;Hello, my name is xyz, and I am engaged in xxx research involving EVP. (Explain what that is), and a voice picked up on my recording gave me your name, and go from there. &lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Thinking out loud here, I would think that the sprit would know if their loved one would be in acceptance to me contacting them. &lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;I am documenting everything step by step, and I do plan to attempt contact if I have the right info. I am thinking that I need to tweak my profile to get confirmation on whether the loved one would be in acceptance of me delivering the message.&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;If there are any of you that have\n actually contacted a loved one you did not know that a spirit asked&nbsp;you to contact, please advise how you handled the first call.&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;I know it&nbsp;may take me days, weeks, months and even perhaps years to get enough info on one profile to make contact, but I really want to do this and&nbsp;I want to perfect it, so others can&nbsp;become messengers for the deceased. &nbsp; &lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;itcdeadpeople &lt;ITCdeadpeople@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/div&gt;  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;div&gt;Hi Michael. I have had the honor many times of either receiving messages for\n someone &lt;BR&gt;from their loved one and passing them on (to people I know) or in helping people learn to &lt;BR&gt;record for and receive their own messages. Along with research in trying to improve &lt;BR&gt;communication with the other side, this is my primary work with EVP... helping others who &lt;BR&gt;are grieving make contact with their loved ones. I do not charge for this.&lt;BR&gt;&lt;BR&gt;I think to charge, or attempt to charge, anyone for a service (spiritual or otherwise) on the &lt;BR&gt;backend is slimy. However, if there is an agreement in advance about fees and services, &lt;BR&gt;then that is up to the consenting parties. People in all types of fields get paid for their &lt;BR&gt;time, regardless of the service being offered. If the fee is clear, the service being offered &lt;BR&gt;legitimate, so be it. As long as people aren&#39;t being scammed. grrrr...... I don&#39;t like to see &lt;BR&gt;people taken advantage of in any field of service (as one crooked auto mechanic tried to &lt;BR&gt;do recently with my mother.) Double\n grrrrrr.....&lt;WBR&gt;... &lt;BR&gt;&lt;BR&gt;As for figuring out who a message belongs to? I think we have to be very cautious in &lt;BR&gt;coming forward with content in recordings that were not requested by the living loved one &lt;BR&gt;of the person in spirit. It&#39;s sort of like the doctor&#39;s creed to first do no harm. I feel unless &lt;BR&gt;you know someone well enough to be fairly certain that your doing so would not &lt;BR&gt;traumatize them, you have to err on the side of caution and not say anything. &lt;BR&gt;&lt;BR&gt;For instance, there are some people who, due to their religious beliefs, could feel that you &lt;BR&gt;are being fooled by a demon or some other evil and that your saying you are in a touch &lt;BR&gt;with a loved one of theirs is not only not true, but cruel of you to claim so. Even worse, &lt;BR&gt;would be those who actually do believe you have heard from their loved one, but take that &lt;BR&gt;to mean they are not in &#39;Heaven&#39; (as some believe those in Heaven do not have the ability &lt;BR&gt;to communicate here.) There&#39;s all\n kinds of beliefs which differ from our reality that our &lt;BR&gt;loved ones can be exactly where they are supposed to be, in a good place, and still talk to &lt;BR&gt;us via EVP. We have to make sure that there is a similarity in world views.&lt;BR&gt;&lt;BR&gt;In regard to mediumship: Even as a experienced EVPer, and having made connections with &lt;BR&gt;my own loved ones, I still benefited from my sitting for an hour with a medium. One of &lt;BR&gt;the really neat things is, I brought my recorders and upon playback, can actually hear EVP &lt;BR&gt;that relates to what the medium is saying. So, as you wrote, that was icing on the cake. &lt;BR&gt;But the sitting alone, even without the EVP heard later, provided an explanation for events &lt;BR&gt;and a peace of mind to me about something I had carried with me for 25yrs and had not &lt;BR&gt;been able to resolve via EVP alone. The fee for that sitting was some of the best money &lt;BR&gt;I&#39;ve ever spent in my life, as what I got from it was priceless.&lt;BR&gt;&lt;BR&gt;Personally, I&#39;d like to see\n some joint studies done with mediums and EVP, each modality &lt;BR&gt;helping to validate the other in the process. :-)&lt;BR&gt;&lt;BR&gt;Margaret&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;, Michael Edwards &lt;f1cracker75@&lt;WBR&gt;...&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; Amazing I take a weeks vacation and come back to 350 notes, and see this one.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Both of your arguments are indeed accurate. &lt;BR&gt;&gt; &lt;BR&gt;&gt; But it is an added bonus to the recipient or customer to hear their loved one&#39;s voice on &lt;BR&gt;tape rather that by word of mouth from a gifted clairaudient, clairvoyant, psychic person. &lt;BR&gt;That is the icing on the cake.&lt;BR&gt;&gt; &lt;BR&gt;&gt; What would bother me terribly is if any of us researchers received a message from a &lt;BR&gt;spirit in which we could actually make contact with their loved one to send the tape, and &lt;BR&gt;then to try and charge the contactee for the recording. &lt;BR&gt;&gt; &lt;BR&gt;&gt; In my opinion if any of us receive such a message\n with that clarity, we should &lt;BR&gt;send/give it to the contactee free of charge as doing so is in a sense a spiritual gift from &lt;BR&gt;the spirit to the contactee, and we are just the messenger. I have been researching this &lt;BR&gt;concept, and I myself hope to one day be able to receive clear and concise messages which &lt;BR&gt;would enable me to contact the spirit&#39;s loved one to give them that message should they &lt;BR&gt;wish to receive it. And I gurantee you it will be free of charge. &lt;BR&gt;&gt; &lt;BR&gt;&gt; Have any of you received on any occasion enough info from the spirits to be able to &lt;BR&gt;contact the loved one and give them the recording?&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; Early Cuyler &lt;ecuyler@...&lt;WBR&gt;&gt; wrote:&lt;BR&gt;&gt; How true it is.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Jeremy&lt;BR&gt;&gt; &lt;BR&gt;&gt; ----- Original Message ----&lt;BR&gt;&gt; From: Steve Hultay &lt;urkel23@...&lt;WBR&gt;&gt;&lt;BR&gt;&gt; To: &lt;A href=&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;&lt;BR&gt;&gt; Sent: Sunday, April 6,\n 2008 7:53:35 AM&lt;BR&gt;&gt; Subject: [EVP-ITC] Re: boxes on ebay&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; Jeremy,&lt;BR&gt;&gt; &lt;BR&gt;&gt; There will always be a market for less educated people and some to &lt;BR&gt;&gt; take advantage of that. There is a a saying out there---- &quot;Stupid &lt;BR&gt;&gt; people don&#39;t know they&#39;re stupid&quot;. How true is that.&lt;BR&gt;&gt; &lt;BR&gt;&gt; -Steve &lt;BR&gt;&gt; &lt;BR&gt;&gt; --- In EVP-ITC@yahoogroups .com, Early Cuyler &lt;ecuyler@ &gt; wrote:&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt; Margaret, I can&#39;t argue with what you&#39;ve said. I&#39;m just saying &lt;BR&gt;&gt; there are those who take advantage and should have no business in &lt;BR&gt;&gt; doing so. One example I can give is Chris Moon. He charges people &lt;BR&gt;&gt; to do box sessions. I can&#39;t remember the exact fee, but it&#39;s &lt;BR&gt;&gt; outrageous that he&#39;s doing this, not to mention, he does so with a &lt;BR&gt;&gt; Frank&#39;s box. He is a self proclaimed medium and I&#39;ve heard from many &lt;BR&gt;&gt; sources that he is nothing but a fake. &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; So I attribute my\n frustration with people of this type, but again I &lt;BR&gt;&gt; say, as long as there are people dumb enough to pay for this, then &lt;BR&gt;&gt; there will always be those who take advantage.&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; Personally, I feel anyone who is gifted with mediumship or other &lt;BR&gt;&gt; advanced intuitive abilities should use it as a gift to help others, &lt;BR&gt;&gt; not for monetary gain.. I&#39;m not being judgmental here, that&#39;s just &lt;BR&gt;&gt; how I feel. I have a friend who is also a legitimate medium and I &lt;BR&gt;&gt; don&#39;t agree that she should use her abilities for gain, but it &lt;BR&gt;&gt; doesn&#39;t mean I like her any less. My not liking it won&#39;t change the &lt;BR&gt;&gt; fact that it happens, it&#39;s just the way things go. &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; Do I think that Ron is taking advantage of people? No I don&#39;t. &lt;BR&gt;&gt; Ron says he uses the best parts available and that the cost of the &lt;BR&gt;&gt; Minibox is very close to what it costs to manufacture it. How close, &lt;BR&gt;&gt; I have no idea. On\n the other hand, I don&#39;t own one as I think $399 &lt;BR&gt;&gt; or $449 for the &quot;crystal enhanced version,&quot; is a lot to pay for a &lt;BR&gt;&gt; device that, from what I&#39;ve heard, produces the same results as a &lt;BR&gt;&gt; Radio Shack radio for $25-$40. &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; Jeremy&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; ----- Original Message ----&lt;BR&gt;&gt; &gt; From: itcdeadpeople &lt;ITCdeadpeople@ ...&gt;&lt;BR&gt;&gt; &gt; To: EVP-ITC@yahoogroups .com&lt;BR&gt;&gt; &gt; Sent: Saturday, April 5, 2008 1:32:28 PM&lt;BR&gt;&gt; &gt; Subject: [EVP-ITC] Re: boxes on ebay&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; Hi Jeremy. If everyone knew about these support &lt;BR&gt;&gt; boards and that other resources are &lt;BR&gt;&gt; &gt; available to them, that would be one thing. Obviously everyone &lt;BR&gt;&gt; here is aware of that. But &lt;BR&gt;&gt; &gt; not everyone knows this place exists. &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; And even if they do know about the boards here, how many would have &lt;BR&gt;&gt; the nerve to ask &lt;BR&gt;&gt; &gt; for help from strangers? As\n Bruce recently shared, he gives people &lt;BR&gt;&gt; invitations to contact &lt;BR&gt;&gt; &gt; him privately in case they are too shy just ask a question &lt;BR&gt;&gt; publicly. Which means, by the &lt;BR&gt;&gt; &gt; way, to some degree they have overcome some of that shyness in &lt;BR&gt;&gt; order to post whatever it &lt;BR&gt;&gt; &gt; was to begin with, which inspired him to make this offer. What if &lt;BR&gt;&gt; they don&#39;t even have the &lt;BR&gt;&gt; &gt; gumption to be anything more than be a look-i-loo?&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; I&#39;m guessing many people are just surfing the net, checking out &lt;BR&gt;&gt; paranormal stuff, and run &lt;BR&gt;&gt; &gt; across the hacked boxes for sale. &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; Again, I ask people who are taking the position you and Bruce are &lt;BR&gt;&gt; regarding profits ... do &lt;BR&gt;&gt; &gt; you have this same harsh sentiment toward Ron Ricketts, who makes &lt;BR&gt;&gt; and sells the &lt;BR&gt;&gt; &gt; MiniBoxes? I realize he is passionate about this research and &lt;BR&gt;&gt; helping others. Does\n that &lt;BR&gt;&gt; &gt; give him amnesty for making a profit? &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; Personally I think we need to not be so judgmental. At what point &lt;BR&gt;&gt; does &quot;profitable gain in &lt;BR&gt;&gt; &gt; the paranormal field&quot; become &quot;sickening?&quot; I have a friend who is a &lt;BR&gt;&gt; medium. I mean THE &lt;BR&gt;&gt; &gt; REAL DEAL. He charges for his services. The fee is reasonable &lt;BR&gt;&gt; compared to many in his &lt;BR&gt;&gt; &gt; field. Does he do this because he&#39;s a terrible person looking to &lt;BR&gt;&gt; take advantage of people? &lt;BR&gt;&gt; &gt; NO, he does so because he has been given a gift that changes &lt;BR&gt;&gt; people&#39;s lives for the better. &lt;BR&gt;&gt; &gt; But he has to make a living.... has to support himself in some way. &lt;BR&gt;&gt; And because he has &lt;BR&gt;&gt; &gt; chosen to provide this service full time (and is not a trust fund &lt;BR&gt;&gt; baby), he makes a profit. &lt;BR&gt;&gt; &gt; This allows him to help far more people than he could if working &lt;BR&gt;&gt; some other kind of job &lt;BR&gt;&gt; &gt; and\n providing his services at no cost on the side. &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; I realize this is not exactly the same thing as gouging people on &lt;BR&gt;&gt; the price for a &lt;BR&gt;&gt; &gt; commercially available product, but making such blanket statements &lt;BR&gt;&gt; about profitability in &lt;BR&gt;&gt; &gt; the paranormal field being sickening is rather short-sighted, in my &lt;BR&gt;&gt; opinion. &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; I have a southern friend who likes to say, &quot;It&#39;s a mighty thin &lt;BR&gt;&gt; plank that ain&#39;t got two sides.&quot; &lt;BR&gt;&gt; &gt; I just don&#39;t think we have the right to claim that simply because &lt;BR&gt;&gt; someone is offering a &lt;BR&gt;&gt; &gt; good and or service for profit to consumers in the paranormal &lt;BR&gt;&gt; market, that this &lt;BR&gt;&gt; &gt; automatically means they are taking advantage of other&#39;s &lt;BR&gt;&gt; vulnerabilities. &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; For Pete&#39;s sake, no one is twisting the people&#39;s arms to buy those &lt;BR&gt;&gt; units on eBay. They are &lt;BR&gt;&gt; &gt; perfectly free to buy\n from whatever source they choose. Since the &lt;BR&gt;&gt; units do work as &lt;BR&gt;&gt; &gt; claimed, we can argue that people have overpaid, shopped unwisely, &lt;BR&gt;&gt; or whatever. I assure &lt;BR&gt;&gt; &gt; you this happens every single day throughout the retail market &lt;BR&gt;&gt; place with all types of &lt;BR&gt;&gt; &gt; products and services. &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; I will say I have a fairly heathy dose of distain for &lt;BR&gt;&gt; charlatans/scam artists (of any flavor in &lt;BR&gt;&gt; &gt; any field) but that is not what we are talking about here. We are &lt;BR&gt;&gt; talking about people who &lt;BR&gt;&gt; &gt; are offering legitimate products to consumers. I&#39;d rather see &lt;BR&gt;&gt; people doing this for profit, &lt;BR&gt;&gt; &gt; even when obscene, than running scams that damage people&#39;s &lt;BR&gt;&gt; physical, mental, and/or &lt;BR&gt;&gt; &gt; financial well-being. &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; Margaret&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; --- In EVP-ITC@yahoogroups .com, Early Cuyler &lt;ecuyler@ &gt; wrote:&lt;BR&gt;&gt; &gt;\n &gt;&lt;BR&gt;&gt; &gt; &gt; Very well put, Bruce. Profitable gain in the paranormal field is &lt;BR&gt;&gt; sickening.. Unfortunately, &lt;BR&gt;&gt; &gt; there are those who continue to support the ones profiting, so it &lt;BR&gt;&gt; will continue. It makes &lt;BR&gt;&gt; &gt; me sick that people take advantage of others vulnerabilities, &lt;BR&gt;&gt; especially when it comes to &lt;BR&gt;&gt; &gt; spiritual matters, but that&#39;s a rant for another time and place.&lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; If someone is afraid to try hacking a radio or lacks the proper &lt;BR&gt;&gt; tools, they are more than &lt;BR&gt;&gt; &gt; welcome to send them to me and I&#39;ll do it for them and ship it &lt;BR&gt;&gt; back. As Bruce said, it&#39;s not &lt;BR&gt;&gt; &gt; for recognition, but it&#39;s to help further the research. I wouldn&#39;t &lt;BR&gt;&gt; be doing this research if it &lt;BR&gt;&gt; &gt; wasn&#39;t for Frank, Bruce, Steve and the others who put in their time &lt;BR&gt;&gt; and effort. The &lt;BR&gt;&gt; &gt; possibilities are only limited by our willingness to work &lt;BR&gt;&gt;\n together. The more we work &lt;BR&gt;&gt; &gt; together, the better the communication will get. &lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; Jeremy&lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; ----- Original Message ----&lt;BR&gt;&gt; &gt; &gt; From: bruce halliday &lt;paranormalinvestig ating@ &gt;&lt;BR&gt;&gt; &gt; &gt; To: evp-itc@yahoogroups .com&lt;BR&gt;&gt; &gt; &gt; Sent: Saturday, April 5, 2008 11:15:21 AM&lt;BR&gt;&gt; &gt; &gt; Subject: RE: [EVP-ITC] boxes on ebay&lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; Guy&#39;s&lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; Do not give in to these demons that are trying to make a buck &lt;BR&gt;&gt; from the research we love &lt;BR&gt;&gt; &gt; and the equipment we use.&lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; I have given away including the shipping 5 RS boxes for free, 4, &lt;BR&gt;&gt; 470&#39;s and 1 469 all &lt;BR&gt;&gt; &gt; hacked by me.&lt;BR&gt;&gt; &gt; &gt; I did not do it to gain popularity or even wanted a thank you.\n my &lt;BR&gt;&gt; sole motivation was to &lt;BR&gt;&gt; &gt; bring new people into the research and &lt;BR&gt;&gt; &gt; &gt; in turn change someones life and perpetuate the idea of strength &lt;BR&gt;&gt; in numbers, in this &lt;BR&gt;&gt; &gt; case strength of communication.&lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; To all new people on this board, do not patronise these wolves &lt;BR&gt;&gt; that prey on the needs &lt;BR&gt;&gt; &gt; and wants of others. &lt;BR&gt;&gt; &gt; &gt; The RS 20 -125 is everything the 470 &amp; 469 are and a little more. &lt;BR&gt;&gt; do not let the size or &lt;BR&gt;&gt; &gt; complicated button arrangement scare you off.&lt;BR&gt;&gt; &gt; &gt; the hack is as simple as the others. &lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; Do not buy any RS hacks from ebay, they are sold with the wrong &lt;BR&gt;&gt; energy attached to &lt;BR&gt;&gt; &gt; them, spirit wise.&lt;BR&gt;&gt; &gt; &gt; That is why I and all other researchers should follow the example &lt;BR&gt;&gt; of a great man to &lt;BR&gt;&gt; &gt; whom we owe all of this research.&lt;BR&gt;&gt; &gt;\n &gt; Mr. Frank Sumption, who was in a position at one time to make a &lt;BR&gt;&gt; substantial amount of &lt;BR&gt;&gt; &gt; money from his boxes and&lt;BR&gt;&gt; &gt; &gt; was offered the opportunity on a silver platter. But chose to &lt;BR&gt;&gt; follow what had been asked &lt;BR&gt;&gt; &gt; of him by higher entities.&lt;BR&gt;&gt; &gt; &gt; And that was to keep the research pure for research sake. And &lt;BR&gt;&gt; that at no time was this &lt;BR&gt;&gt; &gt; equipment or knowledge there of&lt;BR&gt;&gt; &gt; &gt; to be for monetary gain.&lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; I adhere to this promise made by Frank to our friends on the &lt;BR&gt;&gt; other side and feel that &lt;BR&gt;&gt; &gt; there is no need to give in to these box &lt;BR&gt;&gt; &gt; &gt; extortionists. . If a box is not attainable for a new person yet, &lt;BR&gt;&gt; the right way. Then it &lt;BR&gt;&gt; &gt; probably is not their time yet.&lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; I have coined a phrase and believe in it. &quot;The researcher does &lt;BR&gt;&gt; not choose the box, the\n &lt;BR&gt;&gt; &gt; box chooses the researcher&quot;&lt;BR&gt;&gt; &gt; &gt; Be patient, those that do not yet have a box. We will do all we &lt;BR&gt;&gt; can to help you obtain &lt;BR&gt;&gt; &gt; one.&lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; Bruce&lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; Bruce Halliday &lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; To: EVP-ITC@yahoogroups .com&lt;BR&gt;&gt; &gt; &gt; From: reesclarke_69@ yahoo.com&lt;BR&gt;&gt; &gt; &gt; Date: Fri, 4 Apr 2008 18:49:09 -0700&lt;BR&gt;&gt; &gt; &gt; Subject: Re: [EVP-ITC] Re: Few more traditional evp&#39;s&lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; No bodies at fault, but I would do the hack just to help more &lt;BR&gt;&gt; people get in this field. As &lt;BR&gt;&gt; &gt; Bruce sayes the more people the better comunication we will have.&lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; Rees&lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; itcdeadpeople &lt;ITCdeadpeople@ aol..com&gt; wrote:&lt;BR&gt;&gt; &gt; &gt; I just took\n a look at eBay and these are the NEW 12-469&#39;s. &lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; Well, all I can say is the market is driven by BUYERS. If people &lt;BR&gt;&gt; are willing to pay, you &lt;BR&gt;&gt; &gt; can&#39;t &lt;BR&gt;&gt; &gt; &gt; fault the person selling for taking advantage of what the market &lt;BR&gt;&gt; will bear. Perhaps the &lt;BR&gt;&gt; &gt; &gt; people who do not have the tools, or the skills, to do their own &lt;BR&gt;&gt; hack, feel this price is &lt;BR&gt;&gt; &gt; &gt; reasonable?&lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; Margaret&lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; --- In EVP-ITC@yahoogroups .com, &quot;psfponies&quot; &lt;psfponies@ ..&gt; &lt;BR&gt;&gt; wrote:&lt;BR&gt;&gt; &gt; &gt; &gt;&lt;BR&gt;&gt; &gt; &gt; &gt; &lt;A href=&quot;http://cgi.ebay./&quot;&gt;http://cgi.ebay.&lt;/A&gt; com/Ghost- Box-Radio- EVP-Paranormal- State-&lt;BR&gt;&gt; Franks-&lt;BR&gt;&gt; &gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; box_W0QQitemZ200212 582012QQihZ010QQ categoryZ155297Q &lt;BR&gt;&gt; QssPageNameZWDVW &lt;BR&gt;&gt; &gt; QQ&lt;BR&gt;&gt; &gt; &gt; &gt; rdZ1QQcmdZViewItem&lt;BR&gt;&gt; &gt;\n &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &gt; Here is the Ebay ad bids up to $51.00&lt;BR&gt;&gt; &gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &gt; Ghost Box Radio EVP Paranormal State Franks box Telephone to &lt;BR&gt;&gt; other &lt;BR&gt;&gt; &gt; &gt; &gt; side Haunted radio Paranormal State&lt;BR&gt;&gt; &gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &gt; Kay&lt;BR&gt;&gt; &gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &gt; --- In EVP-ITC@yahoogroups .com, Marlboro63@ wrote:&lt;BR&gt;&gt; &gt; &gt; &gt; &gt;&lt;BR&gt;&gt; &gt; &gt; &gt; &gt; Stefan,&lt;BR&gt;&gt; &gt; &gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &gt; &gt; This guy who sells on Ebay does get 55.00 a unit for them. He &lt;BR&gt;&gt; is &lt;BR&gt;&gt; &gt; &gt; &gt; out f New &lt;BR&gt;&gt; &gt; &gt; &gt; &gt; York. He originally wanted 129.00 for it. I was considering &lt;BR&gt;&gt; &gt; &gt; &gt; posted a 12-469 &lt;BR&gt;&gt; &gt; &gt; &gt; &gt; for 24.95 plus shipping and I will modify it for free or if &lt;BR&gt;&gt; &gt; &gt; &gt; anyone wanted &lt;BR&gt;&gt; &gt; &gt; &gt; &gt; too I was going to\n post the instructions to modify one on the &lt;BR&gt;&gt; &gt; &gt; &gt; same add just to &lt;BR&gt;&gt; &gt; &gt; &gt; &gt; screw with this guy. What do you thing?&lt;BR&gt;&gt; &gt; &gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &gt; &gt; Jeff&lt;BR&gt;&gt; &gt; &gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &gt; &gt; In a message dated 4/4/2008 4:31:03 P.M. Central Daylight &lt;BR&gt;&gt; Time, &lt;BR&gt;&gt; &gt; &gt; &gt; &gt; reesclarke_69@ writes:&lt;BR&gt;&gt; &gt; &gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &gt; &gt; On ebay I just saw a RS12-469 in a auction and the bid was &lt;BR&gt;&gt; &gt; &gt; &gt; $49.95. I can&#39;t &lt;BR&gt;&gt; &gt; &gt; &gt; &gt; believe this shit that people try to pull off.&lt;BR&gt;&gt; &gt; &gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &gt; &gt; Stefan Bion &lt;yahoogroups@ yahoogroupsya&gt; wrote: &lt;BR&gt;&gt; &gt; &gt; &gt; &gt; Hi Jeremy, hi group,&lt;BR&gt;&gt; &gt; &gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &gt; &gt; &gt; Holy shit! That&#39;s\n insane! Well, if people are paying for &lt;BR&gt;&gt; it, &lt;BR&gt;&gt; &gt; &gt; &gt; then more&lt;BR&gt;&gt; &gt; &gt; &gt; &gt; &gt; power to &#39;em.&lt;BR&gt;&gt; &gt; &gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &gt; &gt; On ebay.de I saw one for €25 (about €40), what is still &lt;BR&gt;&gt; &gt; &gt; &gt; expensive for&lt;BR&gt;&gt; &gt; &gt; &gt; &gt; such an old and low-quality device.&lt;BR&gt;&gt; &gt; &gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &gt; &gt; &gt; I&#39;ve been wanting to try the Raudive method with a &lt;BR&gt;&gt; germanium &lt;BR&gt;&gt; &gt; &gt; &gt; diode.&lt;BR&gt;&gt; &gt; &gt; &gt; &gt; &gt; Radio shack only carries silicon, so I&#39;ll have to order the &lt;BR&gt;&gt; &gt; &gt; &gt; germanium&lt;BR&gt;&gt; &gt; &gt; &gt; &gt; &gt; and give it a shot.&lt;BR&gt;&gt; &gt; &gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &gt; &gt; You could also try a schottky diode which is more sensitive &lt;BR&gt;&gt; than a&lt;BR&gt;&gt; &gt; &gt; &gt; &gt; german diode. See: &lt;A href=&quot;http://en.wikipedia/&quot;&gt;http://en.wikipedia&lt;/A&gt; german diogerman &lt;BR&gt;&gt; digerma&lt;BR&gt;&gt; &gt; &gt; &gt;\n &gt; &lt;BR&gt;&gt; &gt; &gt; &gt; &gt; Stefan&lt;BR&gt;&gt; &gt; &gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &gt; &gt; ------------ --------- --------- ------&lt;BR&gt;&gt; &gt; &gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &gt; &gt; Yahoo! Groups Links&lt;BR&gt;&gt; &gt; &gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &gt; &gt; ____________ _________ _________ ______&lt;BR&gt;&gt; &gt; &gt; &gt; &gt; You rock. That&#39;s why Blockbuster&#39; You rock. T_one month of &lt;BR&gt;&gt; &gt; &gt; &gt; Blockbuster Total &lt;BR&gt;&gt; &gt; &gt; &gt; &gt; Access_ &lt;BR&gt;&gt; &gt; &gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &gt; (&lt;A href=&quot;http://us.rd./&quot;&gt;http://us.rd.&lt;/A&gt; yahoo.com/ evt=47523/ *&lt;A href=&quot;http://tc./&quot;&gt;http://tc.&lt;/A&gt; deals.yahoo. &lt;BR&gt;&gt; com/tc/block&lt;BR&gt;&gt; &gt; &gt; &gt; buster/text5. com) , No Cost. &lt;BR&gt;&gt; &gt; &gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &gt; &gt;\n &lt;BR&gt;&gt; &gt; &gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &gt; &gt; ************ **Planning your summer road trip? Check out AOL &lt;BR&gt;&gt; Travel &lt;BR&gt;&gt; &gt; &gt; &gt; Guides. &lt;BR&gt;&gt; &gt; &gt; &gt; &gt; (&lt;A href=&quot;http://travel./&quot;&gt;http://travel.&lt;/A&gt; aol.com/travel- guide/united- states?&lt;BR&gt;&gt; &gt; &gt; &gt; ncid=aoltrv00030000 000016)&lt;BR&gt;&gt; &gt; &gt; &gt; &gt;&lt;BR&gt;&gt; &gt; &gt; &gt;&lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; You rock. That&#39;s why Blockbuster&#39; s offering you one month of &lt;BR&gt;&gt; Blockbuster Total Access, &lt;BR&gt;&gt; &gt; No Cost. &lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; Going green? See the top 12 foods to eat organic. &lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &lt;!--&lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; #ygrp-mkp{&lt;BR&gt;&gt; &gt; &gt; border:1px solid\n #d8d8d8;font- family:Arial; margin:14px &lt;BR&gt;&gt; 0px;padding: 0px 14px;}&lt;BR&gt;&gt; &gt; &gt; #ygrp-mkp hr{&lt;BR&gt;&gt; &gt; &gt; border:1px solid #d8d8d8;}&lt;BR&gt;&gt; &gt; &gt; #ygrp-mkp #hd{&lt;BR&gt;&gt; &gt; &gt; color:#628c2a; font-size: 85%;font- weight:bold; line-height: &lt;BR&gt;&gt; 122%;margin: 10px 0px;}&lt;BR&gt;&gt; &gt; &gt; #ygrp-mkp #ads{&lt;BR&gt;&gt; &gt; &gt; margin-bottom: 10px;}&lt;BR&gt;&gt; &gt; &gt; #ygrp-mkp .ad{&lt;BR&gt;&gt; &gt; &gt; padding:0 0;}&lt;BR&gt;&gt; &gt; &gt; #ygrp-mkp ..ad a{&lt;BR&gt;&gt; &gt; &gt; color:#0000ff; text-decoration: none;}&lt;BR&gt;&gt; &gt; &gt; --&gt;&lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &lt;!--&lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; #ygrp-sponsor #ygrp-lc{&lt;BR&gt;&gt; &gt; &gt; font-family: Arial;}&lt;BR&gt;&gt; &gt; &gt; #ygrp-sponsor #ygrp-lc #hd{&lt;BR&gt;&gt; &gt; &gt; margin:10px 0px;font-weight: bold;font- size:78%; line-height: &lt;BR&gt;&gt; 122%;}&lt;BR&gt;&gt; &gt; &gt; #ygrp-sponsor #ygrp-lc .ad{&lt;BR&gt;&gt; &gt; &gt; margin-bottom: 10px;padding: 0 0;}&lt;BR&gt;&gt; &gt; &gt; --&gt;&lt;BR&gt;&gt; &gt; &gt;\n &lt;BR&gt;&gt; &gt; &gt; &lt;!--&lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; #ygrp-mlmsg {font-size:13px; font-family: arial, helvetica, &lt;BR&gt;&gt; clean, sans-serif;}&lt;BR&gt;&gt; &gt; &gt; #ygrp-mlmsg table {font-size:inherit; font:100% ;}&lt;BR&gt;&gt; &gt; &gt; #ygrp-mlmsg select, input, textarea {font:99% arial, helvetica, &lt;BR&gt;&gt; clean, sans-serif;}&lt;BR&gt;&gt; &gt; &gt; #ygrp-mlmsg pre, code {font:115% monospace;}&lt;BR&gt;&gt; &gt; &gt; #ygrp-mlmsg * {line-height: 1.22em;}&lt;BR&gt;&gt; &gt; &gt; #ygrp-text{&lt;BR&gt;&gt; &gt; &gt; font-family: Georgia;&lt;BR&gt;&gt; &gt; &gt; }&lt;BR&gt;&gt; &gt; &gt; #ygrp-text p{&lt;BR&gt;&gt; &gt; &gt; margin:0 0 1em 0;}&lt;BR&gt;&gt; &gt; &gt; #ygrp-tpmsgs{&lt;BR&gt;&gt; &gt; &gt; font-family: Arial;&lt;BR&gt;&gt; &gt; &gt; clear:both;}&lt;BR&gt;&gt; &gt; &gt; #ygrp-vitnav{&lt;BR&gt;&gt; &gt; &gt; padding-top: 10px;font- family:Verdana; font-size: 77%;margin: 0;}&lt;BR&gt;&gt; &gt; &gt; #ygrp-vitnav a{&lt;BR&gt;&gt; &gt; &gt; padding:0 1px;}&lt;BR&gt;&gt; &gt; &gt; #ygrp-actbar{&lt;BR&gt;&gt; &gt; &gt; clear:both;margin: 25px 0;white-space:\n nowrap;color: #666;text- &lt;BR&gt;&gt; align:right; }&lt;BR&gt;&gt; &gt; &gt; #ygrp-actbar .left{&lt;BR&gt;&gt; &gt; &gt; float:left;white- space:nowrap; }&lt;BR&gt;&gt; &gt; &gt; .bld{font-weight: bold;}&lt;BR&gt;&gt; &gt; &gt; #ygrp-grft{&lt;BR&gt;&gt; &gt; &gt; font-family: Verdana;font- size:77%; padding:15px 0;}&lt;BR&gt;&gt; &gt; &gt; #ygrp-ft{&lt;BR&gt;&gt; &gt; &gt; font-family: verdana;font- size:77%; border-top: 1px solid #666;&lt;BR&gt;&gt; &gt; &gt; padding:5px 0;&lt;BR&gt;&gt; &gt; &gt; }&lt;BR&gt;&gt; &gt; &gt; #ygrp-mlmsg #logo{&lt;BR&gt;&gt; &gt; &gt; padding-bottom: 10px;}&lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; #ygrp-reco {&lt;BR&gt;&gt; &gt; &gt; margin-bottom: 20px;padding: 0px;}&lt;BR&gt;&gt; &gt; &gt; #ygrp-reco #reco-head {&lt;BR&gt;&gt; &gt; &gt; font-weight: bold;color: #ff7900;}&lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; #reco-grpname{&lt;BR&gt;&gt; &gt; &gt; font-weight: bold;margin- top:10px; }&lt;BR&gt;&gt; &gt; &gt; #reco-category{&lt;BR&gt;&gt; &gt; &gt; font-size:77% ;}&lt;BR&gt;&gt; &gt; &gt; #reco-desc{&lt;BR&gt;&gt; &gt; &gt; font-size:77% ;}&lt;BR&gt;&gt; &gt; &gt;\n &lt;BR&gt;&gt; &gt; &gt; #ygrp-vital{&lt;BR&gt;&gt; &gt; &gt; background-color: #e0ecee;margin- bottom:20px; padding:2px 0 8px &lt;BR&gt;&gt; 8px;}&lt;BR&gt;&gt; &gt; &gt; #ygrp-vital #vithd{&lt;BR&gt;&gt; &gt; &gt; font-size:77% ;font-family: Verdana;font- weight:bold; &lt;BR&gt;&gt; color:#333; text-&lt;BR&gt;&gt; &gt; transform:uppercase ;}&lt;BR&gt;&gt; &gt; &gt; #ygrp-vital ul{&lt;BR&gt;&gt; &gt; &gt; padding:0;margin: 2px 0;}&lt;BR&gt;&gt; &gt; &gt; #ygrp-vital ul li{&lt;BR&gt;&gt; &gt; &gt; list-style-type: none;clear: both;border: 1px solid #e0ecee;&lt;BR&gt;&gt; &gt; &gt; }&lt;BR&gt;&gt; &gt; &gt; #ygrp-vital ul li .ct{&lt;BR&gt;&gt; &gt; &gt; font-weight: bold;color: #ff7900;float: right;width: 2em;text- &lt;BR&gt;&gt; align:right; padding-&lt;BR&gt;&gt; &gt; right:.5em;}&lt;BR&gt;&gt; &gt; &gt; #ygrp-vital ul li .cat{&lt;BR&gt;&gt; &gt; &gt; font-weight: bold;}&lt;BR&gt;&gt; &gt; &gt; #ygrp-vital a{&lt;BR&gt;&gt; &gt; &gt; text-decoration: none;}&lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; #ygrp-vital a:hover{&lt;BR&gt;&gt; &gt; &gt; text-decoration: underline; }&lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt;\n &gt; &gt; #ygrp-sponsor #hd{&lt;BR&gt;&gt; &gt; &gt; color:#999;font- size:77%; }&lt;BR&gt;&gt; &gt; &gt; #ygrp-sponsor #ov{&lt;BR&gt;&gt; &gt; &gt; padding:6px 13px;background- color:#e0ecee; margin-bottom: 20px;}&lt;BR&gt;&gt; &gt; &gt; #ygrp-sponsor #ov ul{&lt;BR&gt;&gt; &gt; &gt; padding:0 0 0 8px;margin:0; }&lt;BR&gt;&gt; &gt; &gt; #ygrp-sponsor #ov li{&lt;BR&gt;&gt; &gt; &gt; list-style-type: square;padding: 6px 0;font-size: 77%;}&lt;BR&gt;&gt; &gt; &gt; #ygrp-sponsor #ov li a{&lt;BR&gt;&gt; &gt; &gt; text-decoration: none;font- size:130% ;}&lt;BR&gt;&gt; &gt; &gt; #ygrp-sponsor #nc{&lt;BR&gt;&gt; &gt; &gt; background-color: #eee;margin- bottom:20px; padding:0 8px;}&lt;BR&gt;&gt; &gt; &gt; #ygrp-sponsor .ad{&lt;BR&gt;&gt; &gt; &gt; padding:8px 0;}&lt;BR&gt;&gt; &gt; &gt; #ygrp-sponsor .ad #hd1{&lt;BR&gt;&gt; &gt; &gt; font-family: Arial;font- weight:bold; color:#628c2a; font-size: &lt;BR&gt;&gt; 100%;line- height:122% ;}&lt;BR&gt;&gt; &gt; &gt; #ygrp-sponsor .ad a{&lt;BR&gt;&gt; &gt; &gt; text-decoration: none;}&lt;BR&gt;&gt; &gt; &gt; #ygrp-sponsor .ad a:hover{&lt;BR&gt;&gt; &gt;\n &gt; text-decoration: underline; }&lt;BR&gt;&gt; &gt; &gt; #ygrp-sponsor .ad p{&lt;BR&gt;&gt; &gt; &gt; margin:0;}&lt;BR&gt;&gt; &gt; &gt; o{font-size: 0;}&lt;BR&gt;&gt; &gt; &gt; .MsoNormal{&lt;BR&gt;&gt; &gt; &gt; margin:0 0 0 0;}&lt;BR&gt;&gt; &gt; &gt; #ygrp-text tt{&lt;BR&gt;&gt; &gt; &gt; font-size:120% ;}&lt;BR&gt;&gt; &gt; &gt; blockquote{margin: 0 0 0 4px;}&lt;BR&gt;&gt; &gt; &gt; .replbq{margin: 4;}&lt;BR&gt;&gt; &gt; &gt; --&gt;&lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; &gt; &lt;BR&gt;&gt; &gt; ____________ _________ _________ _________ _________ _________ _&lt;BR&gt;&gt; &gt; &gt; You rock. That&#39;s why Blockbuster&#39; s offering you one month of &lt;BR&gt;&gt; Blockbuster Total Access, &lt;BR&gt;&gt; &gt; No Cost. &lt;BR&gt;&gt; &gt; &gt; &lt;A href=&quot;http://tc.deals./&quot;&gt;http://tc.deals.&lt;/A&gt; yahoo.com/ tc/blockbuster/ text5.com&lt;BR&gt;&gt; &gt; &gt;&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; &lt;!--&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; #ygrp-mkp{&lt;BR&gt;&gt; &gt;\n border:1px solid #d8d8d8;font- family:Arial; margin:14px &lt;BR&gt;&gt; 0px;padding: 0px 14px;}&lt;BR&gt;&gt; &gt; #ygrp-mkp hr{&lt;BR&gt;&gt; &gt; border:1px solid #d8d8d8;}&lt;BR&gt;&gt; &gt; #ygrp-mkp #hd{&lt;BR&gt;&gt; &gt; color:#628c2a; font-size: 85%;font- weight:bold; line-&lt;BR&gt;&gt; height:122%; margin:10px 0px;}&lt;BR&gt;&gt; &gt; #ygrp-mkp #ads{&lt;BR&gt;&gt; &gt; margin-bottom: 10px;}&lt;BR&gt;&gt; &gt; #ygrp-mkp .ad{&lt;BR&gt;&gt; &gt; padding:0 0;}&lt;BR&gt;&gt; &gt; #ygrp-mkp .ad a{&lt;BR&gt;&gt; &gt; color:#0000ff; text-decoration: none;}&lt;BR&gt;&gt; &gt; --&gt;&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; &lt;!--&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; #ygrp-sponsor #ygrp-lc{&lt;BR&gt;&gt; &gt; font-family: Arial;}&lt;BR&gt;&gt; &gt; #ygrp-sponsor #ygrp-lc #hd{&lt;BR&gt;&gt; &gt; margin:10px 0px;font-weight: bold;font- size:78%; line-height: 122%;}&lt;BR&gt;&gt; &gt; #ygrp-sponsor #ygrp-lc .ad{&lt;BR&gt;&gt; &gt; margin-bottom: 10px;padding: 0 0;}&lt;BR&gt;&gt; &gt; --&gt;&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; &lt;!--&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; #ygrp-mlmsg {font-size:13px; font-family: arial, helvetica,\n &lt;BR&gt;&gt; clean, sans-serif;}&lt;BR&gt;&gt; &gt; #ygrp-mlmsg table {font-size:inherit; font:100% ;}&lt;BR&gt;&gt; &gt; #ygrp-mlmsg select, input, textarea {font:99% arial, helvetica, &lt;BR&gt;&gt; clean, sans-serif;}&lt;BR&gt;&gt; &gt; #ygrp-mlmsg pre, code {font:115% monospace;}&lt;BR&gt;&gt; &gt; #ygrp-mlmsg * {line-height: 1.22em;}&lt;BR&gt;&gt; &gt; #ygrp-tex\n(Message over 64 KB, truncated)"}