{"id": "9145", "subject": "Re: [EVP-ITC] Re: Any eBay sellers willing to do this?", "author": "Lisby", "timestamp": "2008-04-07T22:39:21Z", "full_text": "Hello,\n\nI&#39;m Ann and Bruce woke me up. ;)\n\nI think you should just let this whole thing go. It&#39;s not your Karma,  \nfirst of all, and second, there are some people--like me--who with  \nall the written knowledge of the universe still could not hack a  \n12-249 or any other model of Radio Shackeque device. Those people  \nneed someone else to do it for them. Period. If they need to turn to  \nsomeone on eBay, then so be it. They will pay what they think its  \nworth to them. I personally paid $400 for one of the first miniboxes.  \nI have no regrets at all and feel that in no way I was unjustly bled.\n\nI think that the proper position for me, personally, is to not  \nattempt to make a profit on this research or any mediumistic activity  \nI have done or will do. However, it is not my place to say what is  \nright for others--moreover to go on a vendetta against them. The  \nfeedback these people have received indicate that the buyers were  \nhappy with the transactions. Maybe they couldn&#39;t hack their own or  \nfind someone to do it for them. My only issue with what they&#39;ve done  \nis using the term Frank&#39;s box in their description. But if Frank has  \nno problem with it, then how can I?\n\nIf you want to become a box supplier at no profit on Ebay, however,  \nknock yourself out. It&#39;s wonderful altruism and I salute you.\n\nHMO only. And nice to meet you.:)\n\nAnn\n\n\nOn Apr 7, 2008, at 6:02 PM, Marlboro63@... wrote:\n\n&gt; Hi Kay,\n&gt;\n&gt; That was what I posted on my original idea over a week ago and I  \n&gt; was blasted about it especially that I would look like a fool that  \n&gt; I was willing to take a loss of a few bucks.  But atleast the  \n&gt; hacking information and links would have been posted on ebay for  \n&gt; all to see.\n&gt;\n&gt; Jeff\n&gt;\n&gt; In a message dated 4/7/2008 4:58:03 P.M. Central Daylight Time,  \n&gt; psfponies@... writes:\n&gt; I checked to see what it would cost to sell one of ebay. To list it\n&gt; it is $1.00 for $25.00-449.00 plus 8.75% of the initial $25.00\n&gt; ($2.19), plus 3.50% of the remaining closing value balance ($25.01\n&gt; to $1,000.00)\n&gt;\n&gt;\n&gt; I would be willing to list the one I have plus give the information\n&gt; on the free hacking and that fact that you can get one at Radio\n&gt; Shack for $24.99 just to shut this guy down. At the most I would be\n&gt; out $1.00 to not sell it!!!! Well worth it I&#39;d say.\n&gt;\n&gt; Can someone send me the written instructions on how to hack the 12-\n&gt; 249.\n&gt;\n&gt; Kay\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, &quot;LC Duplatt&quot; &lt;lcdupla@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Either that, or anyone willing to make them for $25 + shipping\n&gt; with\n&gt; &gt; no profit? You could then list them just like the ones that are\n&gt; &gt; selling...so they pull up identical to the listings that are up\n&gt; &gt; there. :)\n&gt; &gt;\n&gt; &gt; LC\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;itcdeadpeople&quot; &lt;ITCdeadpeople@&gt;\n&gt; &gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; I was thinking if someone would list a FREE DOWNLOAD of\n&gt; &gt; instructions for the various hacks\n&gt; &gt; &gt; on the Radio Shack units, it could put an end to the business\n&gt; for\n&gt; &gt; sellers that are taking\n&gt; &gt; &gt; advantage of people who are unaware that they could probably\n&gt; hack\n&gt; &gt; the units for\n&gt; &gt; &gt; themselves.\n&gt; &gt; &gt;\n&gt; &gt; &gt; I have seen &quot;downloads&quot; of various things listed before. Why\n&gt; not\n&gt; &gt; this?\n&gt; &gt; &gt;\n&gt; &gt; &gt; Margaret\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Planning your summer road trip? Check out AOL Travel Guides.\n&gt;\n&gt; \n\n\nHello,I'm Ann and B uce woke me up. ;)I hink you should jus le his whole hing go. I 's no you Ka ma, i s o all, and second, he e a e some people--like me--who wi h all he w i en knowledge o he uni e se s ill could no hack a 12-249 o any o he model o Radio Shackeque de ice. Those people need someone else o do i o hem. Pe iod. I hey need o u n o someone on eBay, hen so be i . They will pay wha hey hink i s wo h o hem. I pe sonally paid $400 o one o he i s miniboxes. I ha e no eg e s a all and eel ha in no way I was unjus ly bled.I hink ha he p ope posi ion o me, pe sonally, is o no a emp o make a p o i on his esea ch o any mediumis ic ac i i y I ha e done o will do. Howe e , i is no my place o say wha is igh o o he s--mo eo e o go on a ende a agains hem. The eedback hese people ha e ecei ed indica e ha he buye s we e happy wi h he ansac ions. Maybe hey couldn' hack hei own o ind someone o do i o hem. My only issue wi h wha hey' e done is using he e m F ank's box in hei desc ip ion. Bu i F ank has no p oblem wi h i , hen how can I?I you wan o become a box supplie a no p o i on Ebay, howe e , knock you sel ou . I 's wonde ul al uism and I salu e you.HMO only. And nice o mee you.:)AnnOn Ap 7, 2008, a 6:02 PM, Ma lbo o63@... w o e:Hi Kay, Tha was wha I pos ed on my o iginal idea o e a week ago and I was blas ed abou i especially ha I would look like a ool ha I was willing o ake a loss o a ew bucks.  Bu a leas he hacking in o ma ion and links would ha e been pos ed on ebay o all o see. Je  In a message da ed 4/7/2008 4:58:03 P.M. Cen al Dayligh Time, ps ponies@yahoo.com w i es:I checked o see wha i would cos o sell one o ebay. To lis i  i is $1.00 o $25.00-449.00 plus 8.75% o he ini ial $25.00 ($2.19), plus 3.50% o he emaining closing alue balance ($25.01  o $1,000.00)I would be willing o lis he one I ha e plus gi e he in o ma ion on he ee hacking and ha ac ha you can ge one a Radio Shack o $24.99 jus o shu his guy down. A he mos I would be ou $1.00 o no sell i !!!! Well wo h i I'd say.Can someone send me he w i en ins uc ions on how o hack he 12-249.Kay--- In EVP-ITC@yahoog oups.com, \"LC Dupla \" > w o e:>> Ei he ha , o anyone willing o make hem o $25 + shipping wi h > no p o i ? You could hen lis hem jus like he ones ha a e > selling...so hey pull up iden ical o he lis ings ha a e up > he e. :)> > LC> > --- In EVP-ITC@yahoog oups.com, \"i cdeadpeople\" > > w o e:> >> > I was hinking i someone would lis a FREE DOWNLOAD o  > ins uc ions o he a ious hacks > > on he Radio Shack uni s, i could pu an end o he business  o  > selle s ha a e aking > > ad an age o people who a e unawa e ha hey could p obably hack > he uni s o  > > hemsel es. > > > > I ha e seen \"downloads\" o a ious hings lis ed be o e. Why no  > his?> > > > Ma ga e > >>Planning you summe oad ip? Check ou  AOL T a el Guides."}