{"id": "9158", "subject": "Re: My opinion on what should be done about ebay_I know it&#39;s long but please rea", "author": "itcdeadpeople", "timestamp": "2008-04-08T01:20:11Z", "full_text": "Hi Bruce.  I don&#39;t see this so much as an assault on anyone, as it is simply bringing \nawareness into a forum (ebay) where it is desperately needed.  \n\nWas it not you who recently stated sellers who take advantage of others in this way are &quot;no \nmore than thieves without guns&quot; and &quot;should not be patronized no matter the \ncircumstances.&quot;  You have characterized them as &quot;wolves&quot; and &quot;demons&quot; but now are \nsaying &quot;do nothing.&quot;  Which, honestly, I could understand if my suggestion was coming \nfrom a place of vengeance.  It is not.\n\nTHIS IS ABOUT EDUCATION FIRST AND FOREMOST, and standing up for those who are, \nunknowingly, being taken advantage of.  The byproduct of providing this education will be \nallowing consumers to make an informed decision and if that hurts the sales of \nunscrupulous sellers, then so be it.   \n\nAnn has just echoed some of my remarks in earlier posts in support of sellers rights to \ntake advantage of the market ... that some people may find it&#39;s worth it to pay more to \nsomeone to receive a previously hacked unit.  \n\nI would venture to guess, this educational information will A) help prevent those who are \ncapable of doing the hack themselves from being duped, and B) force sellers who do offer \npre-hacked units to do so for a more &#39;reasonable&#39; fee.  \n\nThis is neither spiteful nor aggressive, and it&#39;s certainly not any kind of vengeance driven \non my part.  It&#39;s standing up for the uninformed, leveling the playing field for sellers, and \nit&#39;s bringing more people the knowledge that doing &#39;box&#39; research is not an exclusive club \nthat only the rich can take part in (and given the pricing on the bids for these units, \npeople are under the false assumption that you have a pay a high price to get your hands \non a limited resource, when that simply is not the case.)\n\nI can see nothing but positive benefits coming from educating people about their options.\n\nMargaret\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;bhali333&quot; &lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; \n&gt; Hi Everyone,\n&gt; \n&gt; I have been reading the back and forth posts about ideas on how to \n&gt; deal with the individual selling the hacks on ebay for inflated \n&gt; prices.\n&gt; \n&gt; I posted my thoughts on that individual yesterday. I would now like \n&gt; to render my opinion as to the subject of what we or anyone can do \n&gt; about it.\n&gt; \n&gt; My suggestion is DO NOTHING! Now before everybody&#39;s jaw hits the \n&gt; floor, hear me out.\n&gt; \n&gt; A couple of months ago I would have been the one to lead the charge \n&gt; in the assault on this guy in the name of box justice.\n&gt; \n&gt; I can now say with confidence, That is not the way to handle it.\n&gt; Let me explain why I believe this way. Without going into a lot of \n&gt; detail, I was a tough street kid that grew up on the streets of \n&gt; Brooklyn, I also served my country proudly for six years as a us army \n&gt; green beret, then to a career as a FDNY Fireman whose heart and \n&gt; health where both broken at 911.\n&gt; \n&gt; My point is, I have always lived my life believing that anything I \n&gt; did not agree with or that did not fit my sense of right and wrong\n&gt; whether it be right or wrong, could be easily solved with aggression \n&gt; of some kind.\n&gt; \n&gt; It took a long while and much sole searching and a lot of \n&gt; communication interpretation from our friends on the other side.\n&gt; But I have come to learn that aggressive action in any form is \n&gt; detrimental to the harmony and peace of the whole involved.\n&gt; \n&gt; Guy&#39;s like this guy on ebay do not and can not last in the face of \n&gt; good and well intentioned people that are here and willing and trying \n&gt; to get the word of this miraculous research and spirit communication \n&gt; out to as many people as are in need or want of it.\n&gt; \n&gt; That is how we can stop people like this bottom feeder. By spreading \n&gt; the knowledge of this research from one person to the next. Our \n&gt; friends have stated time and time again that any negative energy will \n&gt; be detrimental to the communication and the research, and positive \n&gt; harmony and vibration will serve to strengthen the bridge between our \n&gt; worlds.\n&gt; \n&gt; So even if you are not religious and do not believe in Jesus Christ \n&gt; as I do, these words ring true no matter what context they come from\n&gt; this wisdom was spoken by my lord two thousand years ago.\n&gt; \n&gt; &quot;do not check the splinter in your brothers eye, until you have \n&gt; checked the plank in your own&quot;\n&gt; \n&gt; Truthfully, anything we could do to sway this individuals sale of \n&gt; these boxes would be minimal. Negativity and greed always find a \n&gt; crack to seep through.\n&gt; \n&gt; My suggestion is lets try a little harder to spread the word of the \n&gt; research and educate individuals that are or may become interested, \n&gt; through all the various outlets available to us on the web concerning \n&gt; the paranormal research community. There are endless chat boards, \n&gt; groups and forums plus websites and word of mouth. \n&gt; Instead of trying to stop this idiot from defrauding innocent \n&gt; unknowledgable people. Lets make sure the knowledge is out there for \n&gt; them and we are here to help them and guy&#39;s like Mr. ebay will \n&gt; disappear on their own.\n&gt; \n&gt; And we will not have expended an ounce of negative energy in the \n&gt; process.\n&gt; That&#39;s how I feel, but that&#39;s just me.\n&gt; \n&gt; Bruce\n&gt;"}