{"id": "9174", "subject": "newbie perspective on EBAY seller", "author": "Holly", "timestamp": "2008-04-08T06:28:28Z", "full_text": "Hi guys\nI know you are all up in arms about this EBAY seller.\nI&#39;d like to say something from the view from someone new to this \ninterest.\nI for one have been desperate for answers.  I lost my mom almost a \nyear ago and have been searching desperately for an answer (do we go \nsomewhere ? can we still talk to each other somehow ?) This goes on \nto a point most of you would think is pathetic.\nI have contacted many of you offline for help, to purchase or just to \nask for help on making a device myself with limited electronic \nknowledge.  All of you have been helpful or at least responded to an \nemail.  So, I went with one suggestion, I hacked a  20-125.  I have \nto say, I am quite disappointed.  I have tried whole heartedly to sit \nand listen and wait in many sessions as you call them.  If anyone \ncould get the thing to work out of pure desperation, it is myself !!!\nof course my main goal was to reach my mother, but at this point any \nspirit would do, just to hear something in response to my questions.  \nI had nothing in return.\nI have a good ear to listen for any response, it is not as simple as  \nnot hearing properly.  In fact I seem to have capture one voice with \nmy recorder alone in the beginning, but nothing since.\nThere is a frustration in reading posts from most those that seem to \ncontinuously build these things that can work and actually \ncommunicate.\n\nTo be honest, I think this person is taking a great leap and a great \nrisk in offering these devices out to the public.  If people purchase \nthem with great hopes like myself of speaking to a deceased loved one \nand nothing comes through.  This guys reputation in mush on EBAY.\nI for one am at a frustration point ready to give up. I tried to be a \npart of all of you, with something to contribute, a voice , a \nresponse or something.  I almost feel like crying.\nThe only weird thing is the radio will turn itself on.  I have pulled \nthe batteries out of it because it&#39;s annoying. A good 40.00 gone to \nnothing in such desperation !!! If someone wants to test this box or \nto see if it works I&#39;d appreciate it.  \nHolly"}