{"id": "9175", "subject": "Re: newbie perspective on EBAY seller", "author": "itcdeadpeople", "timestamp": "2008-04-08T06:54:32Z", "full_text": "{{{ Holly }}}  I&#39;m sorry to read of your frustration and disappointment.  :-(\n\nI don&#39;t know what to say except please don&#39;t give up.  I believe you when you say you \nwould hear something if it was coming through.  Do you have a problem with reception in \nyour area?  Have you tried different areas of your home??  I know that just 10 feet can \nmake a difference where I live.\n\nHave you tried a manual radio sweep?  I&#39;m pretty sure I&#39;m in the minority among this \ngroup, but my best results have come from when I am spinning the dial back and forth on \nthe radio myself.  I&#39;ve tried several models, but my favorite so far as been the Duracell \nKP028, though really, almost any radio will do as long as you can comfortably move \nthrough the channels at a fairly good pace.  LOL - I say &#39;comfortably&#39; because I have one \nradio with nubs on the thumb dial which has actually given me blisters in the past.\n\nYour mother&#39;s name isn&#39;t Betty, by chance, is it?  Last week I received a woman&#39;s voice (not \nusing radio sweep, but foreign crowd babble) saying, &quot;This is Betty.&quot;  I also got one last \nyear that I think sounds like &quot;Faith for Holly&quot; or &quot;Faith with Holly&quot; or &quot;Faith and Holly.&quot;  \nCan&#39;t quite make out the middle word.  It morphs on me. I hang onto clips like this \nbecause I never know when I might end up making a connection with the person for whom \nthe messages are meant.\n\nHas anyone tried to reach your mom via EVP for you?  I know this isn&#39;t the same as getting \nthe message yourself, but I would be willing to give it a try and I&#39;m guessing others would \nas well.  Nothing would need to be posted to the boards.  We could just email results, if \nany, to you privately.  Please send me an email if something like this interests you.\n\nHang in there.  Have a good cry if you need to, but please please please don&#39;t give up yet.  \n\nMargaret\n\n--- In EVP-ITC@yahoogroups.com, &quot;Holly&quot; &lt;holly2422@...&gt; wrote:\n&gt;\n&gt; Hi guys\n&gt; I know you are all up in arms about this EBAY seller.\n&gt; I&#39;d like to say something from the view from someone new to this \n&gt; interest.\n&gt; I for one have been desperate for answers.  I lost my mom almost a \n&gt; year ago and have been searching desperately for an answer (do we go \n&gt; somewhere ? can we still talk to each other somehow ?) This goes on \n&gt; to a point most of you would think is pathetic.\n&gt; I have contacted many of you offline for help, to purchase or just to \n&gt; ask for help on making a device myself with limited electronic \n&gt; knowledge.  All of you have been helpful or at least responded to an \n&gt; email.  So, I went with one suggestion, I hacked a  20-125.  I have \n&gt; to say, I am quite disappointed.  I have tried whole heartedly to sit \n&gt; and listen and wait in many sessions as you call them.  If anyone \n&gt; could get the thing to work out of pure desperation, it is myself !!!\n&gt; of course my main goal was to reach my mother, but at this point any \n&gt; spirit would do, just to hear something in response to my questions.  \n&gt; I had nothing in return.\n&gt; I have a good ear to listen for any response, it is not as simple as  \n&gt; not hearing properly.  In fact I seem to have capture one voice with \n&gt; my recorder alone in the beginning, but nothing since.\n&gt; There is a frustration in reading posts from most those that seem to \n&gt; continuously build these things that can work and actually \n&gt; communicate.\n&gt; \n&gt; To be honest, I think this person is taking a great leap and a great \n&gt; risk in offering these devices out to the public.  If people purchase \n&gt; them with great hopes like myself of speaking to a deceased loved one \n&gt; and nothing comes through.  This guys reputation in mush on EBAY.\n&gt; I for one am at a frustration point ready to give up. I tried to be a \n&gt; part of all of you, with something to contribute, a voice , a \n&gt; response or something.  I almost feel like crying.\n&gt; The only weird thing is the radio will turn itself on.  I have pulled \n&gt; the batteries out of it because it&#39;s annoying. A good 40.00 gone to \n&gt; nothing in such desperation !!! If someone wants to test this box or \n&gt; to see if it works I&#39;d appreciate it.  \n&gt; Holly\n&gt;"}