{"id": "9177", "subject": "Re: [EVP-ITC] newbie perspective on EBAY seller", "author": "Lisby", "timestamp": "2008-04-08T08:47:40Z", "full_text": "Holly--you do record your sessions, right? If so, pick one and send  \nit to me in an MP3 zip file. Let me go through it with TwistedWave  \nand see what I find. The box works very differently for me than it  \ndoes for others. It might be working very different for you, too.\n\nAnn\n\nOn Apr 8, 2008, at 2:28 AM, Holly wrote:\n\n&gt; Hi guys\n&gt; I know you are all up in arms about this EBAY seller.\n&gt; I&#39;d like to say something from the view from someone new to this\n&gt; interest.\n&gt; I for one have been desperate for answers. I lost my mom almost a\n&gt; year ago and have been searching desperately for an answer (do we go\n&gt; somewhere ? can we still talk to each other somehow ?) This goes on\n&gt; to a point most of you would think is pathetic.\n&gt; I have contacted many of you offline for help, to purchase or just to\n&gt; ask for help on making a device myself with limited electronic\n&gt; knowledge. All of you have been helpful or at least responded to an\n&gt; email. So, I went with one suggestion, I hacked a 20-125. I have\n&gt; to say, I am quite disappointed. I have tried whole heartedly to sit\n&gt; and listen and wait in many sessions as you call them. If anyone\n&gt; could get the thing to work out of pure desperation, it is myself !!!\n&gt; of course my main goal was to reach my mother, but at this point any\n&gt; spirit would do, just to hear something in response to my questions.\n&gt; I had nothing in return.\n&gt; I have a good ear to listen for any response, it is not as simple as\n&gt; not hearing properly. In fact I seem to have capture one voice with\n&gt; my recorder alone in the beginning, but nothing since.\n&gt; There is a frustration in reading posts from most those that seem to\n&gt; continuously build these things that can work and actually\n&gt; communicate.\n&gt;\n&gt; To be honest, I think this person is taking a great leap and a great\n&gt; risk in offering these devices out to the public. If people purchase\n&gt; them with great hopes like myself of speaking to a deceased loved one\n&gt; and nothing comes through. This guys reputation in mush on EBAY.\n&gt; I for one am at a frustration point ready to give up. I tried to be a\n&gt; part of all of you, with something to contribute, a voice , a\n&gt; response or something. I almost feel like crying.\n&gt; The only weird thing is the radio will turn itself on. I have pulled\n&gt; the batteries out of it because it&#39;s annoying. A good 40.00 gone to\n&gt; nothing in such desperation !!! If someone wants to test this box or\n&gt; to see if it works I&#39;d appreciate it.\n&gt; Holly\n&gt;\n&gt;\n&gt; \n\n\nHolly--you do eco d you sessions, igh ? I so, pick one and send i o me in an MP3 zip ile. Le me go h ough i wi h Twis edWa e and see wha I ind. The box wo ks e y di e en ly o me han i does o o he s. I migh be wo king e y di e en o you, oo.AnnOn Ap 8, 2008, a 2:28 AM, Holly w o e:Hi guysI know you a e all up in a ms abou his EBAY selle .I'd like o say some hing om he iew om someone new o his in e es .I o one ha e been despe a e o answe s. I los my mom almos a yea ago and ha e been sea ching despe a ely o an answe (do we go somewhe e ? can we s ill alk o each o he somehow ?) This goes on  o a poin mos o you would hink is pa he ic.I ha e con ac ed many o you o line o help, o pu chase o jus o ask o help on making a de ice mysel wi h limi ed elec onic knowledge. All o you ha e been help ul o a leas esponded o an email. So, I wen wi h one sugges ion, I hacked a 20-125. I ha e  o say, I am qui e disappoin ed. I ha e ied whole hea edly o si  and lis en and wai in many sessions as you call hem. I anyone could ge he hing o wo k ou o pu e despe a ion, i is mysel !!!o cou se my main goal was o each my mo he , bu a his poin any spi i would do, jus o hea some hing in esponse o my ques ions. I had no hing in e u n.I ha e a good ea o lis en o any esponse, i is no as simple as no hea ing p ope ly. In ac I seem o ha e cap u e one oice wi h my eco de alone in he beginning, bu no hing since.The e is a us a ion in eading pos s om mos hose ha seem o con inuously build hese hings ha can wo k and ac ually communica e.To be hones , I hink his pe son is aking a g ea leap and a g ea   isk in o e ing hese de ices ou o he public. I people pu chase  hem wi h g ea hopes like mysel o speaking o a deceased lo ed one and no hing comes h ough. This guys epu a ion in mush on EBAY.I o one am a a us a ion poin eady o gi e up. I ied o be a pa o all o you, wi h some hing o con ibu e, a oice , a  esponse o some hing. I almos eel like c ying.The only wei d hing is he adio will u n i sel on. I ha e pulled  he ba e ies ou o i because i 's annoying. A good 40.00 gone o no hing in such despe a ion !!! I someone wan s o es his box o   o see i i wo ks I'd app ecia e i . Holly"}