{"id": "9189", "subject": "RE: [EVP-ITC] Re: another lengthy post about ebay in answer to margaret", "author": "bruce halliday", "timestamp": "2008-04-08T14:20:20Z", "full_text": "--_f118f78d-7742-40c8-afb5-6faff7acf25a_\r\nContent-Type: text/plain; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n\nMargaret,\n \nIn my initial reply I voiced my disdain for low lives that tak=\r\ne advantage of unwary people\nbut did not advocate any action by any researc=\r\nhers on this board.\n \nMy goal is not just pacifism for it&#39;s own sake, belie=\r\nve me any of the old timers here can attest to my temper.\nMy concern is for=\r\n the negative disruption in the energy flow of the communication.\nI think t=\r\nhat following the example of &quot;turn the other cheek&quot; will be very well recei=\r\nved on the other side and therefore \ncontribute to strengthening the bridge=\r\n.\n \nIn the past couple of days I know Kristin has received messages about t=\r\nhe seven and the circle, \nthese are metaphors for peace, harmony and cooper=\r\nation of energies within the communication.\n \nIt is not the first time we h=\r\nave received messages with these examples, I personally have received numer=\r\nous \nmessages pertaining to circle, circles and the power of seven. It has =\r\nbeen contemplated in length here more than once.\n \nI have, through interpre=\r\ntation of communication over a long period of time, come to PERSONALLY beli=\r\neve that the urgence of \nharmony and positive energy is the fertilizer of t=\r\nhe growth of our communication with the spirit world.\n \nI&#39;m sorry, I drifte=\r\nd off the subject at hand, but my reason is relevant to this commentary. \nT=\r\naking any action against this ebay fool will first and foremost serve our e=\r\ngo&#39;s and secondly\nmay help to provide information to unwary buyers that is =\r\ncontrary to what this thief is putting out.\n \nBut could that not be accompl=\r\nished through other venues that would help to educate many more people that=\r\n\nare would be box researchers and do not look to ebay as a source for an RS=\r\n hack. But are seeking general knowledge.\n \nAnd Margaret to thine own self =\r\nbe true, when this was brought up my first reaction was to figure out a way=\r\n to sabotage\nthis guy&#39;s business venture. After thinking it over and asking=\r\n myself what the first reason for doing that would be. My answer\nWas, to ge=\r\nt this asshole that is exploiting something that I hold very dear, and in t=\r\nurn help to steer unaware buyers away from getting screwed.\n \nBut still my =\r\ninitial and primal reason was to inflict some sort of punishment on a perso=\r\nn that I felt was unscrupulous. And I decided that this was\na negative emot=\r\nion and would generate negative energy, no matter how I tried to convince m=\r\nyself it was in the name of justice.\n \nThat goes without even mentioning th=\r\ne fact that we are not the say all and do all of this research. There are o=\r\nther entities involved that I would think \nhave better influential power th=\r\nan we do. If they want it stopped they will find a way to stop it. I know w=\r\nhat your going to say, maybe we are the \ntools they are using to stop this =\r\ninjustice. That may very well be, and if so then that is the way it will pl=\r\nay out.\n \nI think you mistake what I am implying. I am not saying do nothin=\r\ng, quite the opposite. It is actually our duty to do something. All I&#39;m say=\r\ning is there \nare alternative ways to educate unwary possible researchers t=\r\nhat would be 100% positive and not entail any type of stone throwing tactic=\r\ns.\n \nI have said my piece now at the expense of boring everyone to death. S=\r\no I will see how this unfolds, and during my daily session will inquire abo=\r\nut how our friends feel about it.\n \nBruce\nBruce Halliday \n\n\nTo: EVP-ITC@yah=\r\noogroups.comFrom: ITCdeadpeople@...: Tue, 8 Apr 2008 01:20:11 +0000=\r\nSubject: [EVP-ITC] Re: My opinion on what should be done about ebay_I know =\r\nit&#39;s long but please rea\n\n\n\n\nHi Bruce. I don&#39;t see this so much as an assau=\r\nlt on anyone, as it is simply bringing awareness into a forum (ebay) where =\r\nit is desperately needed. Was it not you who recently stated sellers who ta=\r\nke advantage of others in this way are &quot;no more than thieves without guns&quot; =\r\nand &quot;should not be patronized no matter the circumstances.&quot; You have charac=\r\nterized them as &quot;wolves&quot; and &quot;demons&quot; but now are saying &quot;do nothing.&quot; Whic=\r\nh, honestly, I could understand if my suggestion was coming from a place of=\r\n vengeance. It is not.THIS IS ABOUT EDUCATION FIRST AND FOREMOST, and stand=\r\ning up for those who are, unknowingly, being taken advantage of. The byprod=\r\nuct of providing this education will be allowing consumers to make an infor=\r\nmed decision and if that hurts the sales of unscrupulous sellers, then so b=\r\ne it. Ann has just echoed some of my remarks in earlier posts in support of=\r\n sellers rights to take advantage of the market ... that some people may fi=\r\nnd it&#39;s worth it to pay more to someone to receive a previously hacked unit=\r\n. I would venture to guess, this educational information will A) help preve=\r\nnt those who are capable of doing the hack themselves from being duped, and=\r\n B) force sellers who do offer pre-hacked units to do so for a more &#39;reason=\r\nable&#39; fee. This is neither spiteful nor aggressive, and it&#39;s certainly not =\r\nany kind of vengeance driven on my part. It&#39;s standing up for the uninforme=\r\nd, leveling the playing field for sellers, and it&#39;s bringing more people th=\r\ne knowledge that doing &#39;box&#39; research is not an exclusive club that only th=\r\ne rich can take part in (and given the pricing on the bids for these units,=\r\n people are under the false assumption that you have a pay a high price to =\r\nget your hands on a limited resource, when that simply is not the case.)I c=\r\nan see nothing but positive benefits coming from educating people about the=\r\nir options.Margaret--- In EVP-ITC@yahoogroups.com, &quot;bhali333&quot; &lt;paranormalin=\r\nvestigating@...&gt; wrote:&gt;&gt; &gt; Hi Everyone,&gt; &gt; I have been reading the back an=\r\nd forth posts about ideas on how to &gt; deal with the individual selling the =\r\nhacks on ebay for inflated &gt; prices.&gt; &gt; I posted my thoughts on that indivi=\r\ndual yesterday. I would now like &gt; to render my opinion as to the subject o=\r\nf what we or anyone can do &gt; about it.&gt; &gt; My suggestion is DO NOTHING! Now =\r\nbefore everybody&#39;s jaw hits the &gt; floor, hear me out.&gt; &gt; A couple of months=\r\n ago I would have been the one to lead the charge &gt; in the assault on this =\r\nguy in the name of box justice.&gt; &gt; I can now say with confidence, That is n=\r\not the way to handle it.&gt; Let me explain why I believe this way. Without go=\r\ning into a lot of &gt; detail, I was a tough street kid that grew up on the st=\r\nreets of &gt; Brooklyn, I also served my country proudly for six years as a us=\r\n army &gt; green beret, then to a career as a FDNY Fireman whose heart and &gt; h=\r\nealth where both broken at 911.&gt; &gt; My point is, I have always lived my life=\r\n believing that anything I &gt; did not agree with or that did not fit my sens=\r\ne of right and wrong&gt; whether it be right or wrong, could be easily solved =\r\nwith aggression &gt; of some kind.&gt; &gt; It took a long while and much sole searc=\r\nhing and a lot of &gt; communication interpretation from our friends on the ot=\r\nher side.&gt; But I have come to learn that aggressive action in any form is &gt;=\r\n detrimental to the harmony and peace of the whole involved.&gt; &gt; Guy&#39;s like =\r\nthis guy on ebay do not and can not last in the face of &gt; good and well int=\r\nentioned people that are here and willing and trying &gt; to get the word of t=\r\nhis miraculous research and spirit communication &gt; out to as many people as=\r\n are in need or want of it.&gt; &gt; That is how we can stop people like this bot=\r\ntom feeder. By spreading &gt; the knowledge of this research from one person t=\r\no the next. Our &gt; friends have stated time and time again that any negative=\r\n energy will &gt; be detrimental to the communication and the research, and po=\r\nsitive &gt; harmony and vibration will serve to strengthen the bridge between =\r\nour &gt; worlds.&gt; &gt; So even if you are not religious and do not believe in Jes=\r\nus Christ &gt; as I do, these words ring true no matter what context they come=\r\n from&gt; this wisdom was spoken by my lord two thousand years ago.&gt; &gt; &quot;do not=\r\n check the splinter in your brothers eye, until you have &gt; checked the plan=\r\nk in your own&quot;&gt; &gt; Truthfully, anything we could do to sway this individuals=\r\n sale of &gt; these boxes would be minimal. Negativity and greed always find a=\r\n &gt; crack to seep through.&gt; &gt; My suggestion is lets try a little harder to s=\r\npread the word of the &gt; research and educate individuals that are or may be=\r\ncome interested, &gt; through all the various outlets available to us on the w=\r\neb concerning &gt; the paranormal research community. There are endless chat b=\r\noards, &gt; groups and forums plus websites and word of mouth. &gt; Instead of tr=\r\nying to stop this idiot from defrauding innocent &gt; unknowledgable people. L=\r\nets make sure the knowledge is out there for &gt; them and we are here to help=\r\n them and guy&#39;s like Mr. ebay will &gt; disappear on their own.&gt; &gt; And we will=\r\n not have expended an ounce of negative energy in the &gt; process.&gt; That&#39;s ho=\r\nw I feel, but that&#39;s just me.&gt; &gt; Bruce&gt; \n\n\n\n\n\n\n____________________________=\r\n_____________________________________\nGoing green? See the top 12 foods to =\r\neat organic.\nhttp://green.msn.com/galleries/photos/photos.aspx?gid=3D164&oc=\r\nid=3DT003MSN51N1653A\r\n--_f118f78d-7742-40c8-afb5-6faff7acf25a_\r\nContent-Type: text/html; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;\n&lt;head&gt;\n&lt;style&gt;\n.hmmessage P\n{\nmargin:0px;\npadding:0px\n}\nbody.hmmessa=\r\nge\n{\nFONT-SIZE: 10pt;\nFONT-FAMILY:Tahoma\n}\n&lt;/style&gt;\n&lt;/head&gt;\n&lt;body class=3D&#39;=\r\nhmmessage&#39;&gt;\nMargaret,&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nIn my initial reply I voiced my disdai=\r\nn for low lives that take advantage of unwary people&lt;BR&gt;\nbut did not advoca=\r\nte any action by any researchers on this board.&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nMy goal is n=\r\not just pacifism for it&#39;s own sake, believe me any of the old timers here c=\r\nan attest to my temper.&lt;BR&gt;\nMy concern is for the negative disruption in th=\r\ne energy flow of the communication.&lt;BR&gt;\nI think that following the example =\r\nof &quot;turn the other cheek&quot; will be very well received on the other side and =\r\ntherefore &lt;BR&gt;\ncontribute to strengthening the bridge.&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nIn th=\r\ne past couple of days I know Kristin has received messages about the seven =\r\nand the circle, &lt;BR&gt;\nthese are metaphors for peace, harmony and cooperation=\r\n of energies within the communication.&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nIt is not the first t=\r\nime we have received messages with these examples, I personally have receiv=\r\ned numerous &lt;BR&gt;\nmessages pertaining to circle, circles and the power of se=\r\nven. It has been contemplated in length here more than once.&lt;BR&gt;\n&nbsp;&lt;BR&gt;=\r\n\nI have, through interpretation of communication over a long period of time=\r\n, come to PERSONALLY believe that the urgence of &lt;BR&gt;\nharmony and positive =\r\nenergy is the fertilizer of the growth of our communication with the spirit=\r\n world.&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nI&#39;m sorry, I drifted off the subject at hand, but my=\r\n reason is relevant to this commentary. &lt;BR&gt;\nTaking any action against this=\r\n ebay fool will first and foremost serve our ego&#39;s and secondly&lt;BR&gt;\nmay hel=\r\np to provide information to unwary buyers that is contrary to what this thi=\r\nef is putting out.&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nBut could that not be accomplished throug=\r\nh other venues that would help to educate many more people that&lt;BR&gt;\nare wou=\r\nld be box researchers and do not look to ebay as a source for an RS hack. B=\r\nut are seeking general knowledge.&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nAnd Margaret to thine own =\r\nself be true, when this was brought up my first reaction was to figure out =\r\na way to sabotage&lt;BR&gt;\nthis guy&#39;s business venture. After thinking it over a=\r\nnd asking myself what the first reason for doing that would be. My answer&lt;B=\r\nR&gt;\nWas, to get this asshole that is exploiting something that I hold very d=\r\near, and in turn help to steer unaware buyers away from getting screwed.&lt;BR=\r\n&gt;\n&nbsp;&lt;BR&gt;\nBut still my initial and primal reason was to inflict some sor=\r\nt of punishment on a person that I felt was unscrupulous. And I decided tha=\r\nt this was&lt;BR&gt;\na negative emotion and would generate negative energy, no ma=\r\ntter how I tried to convince myself it was in the name of justice.&lt;BR&gt;\n&nbs=\r\np;&lt;BR&gt;\nThat goes without even mentioning the fact that we are not the say a=\r\nll and do all of this research. There are other entities involved that I wo=\r\nuld think &lt;BR&gt;\nhave better influential power than we do. If they want it st=\r\nopped they will find a way to stop it. I know what your going to say, maybe=\r\n we are the &lt;BR&gt;\ntools they are using to stop this injustice. That may very=\r\n well be, and if so then that is the way it will play out.&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nI=\r\n think you mistake what I am implying. I am not saying do nothing, quite th=\r\ne opposite. It is actually our duty to do something. All I&#39;m saying is ther=\r\ne &lt;BR&gt;\nare alternative ways to educate unwary possible researchers that wou=\r\nld be 100% positive and not entail any type of stone throwing tactics.&lt;BR&gt;\n=\r\n&nbsp;&lt;BR&gt;\nI have said my piece now at the expense of boring everyone to de=\r\nath. So I will see how this unfolds, and during my daily session will inqui=\r\nre about how our friends feel about it.&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nBruce&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;P=\r\n align=3Dcenter&gt;&lt;FONT size=3D4&gt;&lt;FONT color=3D#0033cc&gt;&lt;STRONG&gt;&lt;EM&gt;&lt;FONT colo=\r\nr=3D#000000 size=3D5&gt;Bruce Halliday &lt;BR&gt;&lt;/FONT&gt;&lt;/EM&gt;&lt;/STRONG&gt;&lt;BR&gt;&lt;A href=3D=\r\n&quot;http://free-paranormalinvestigating.com/%3C/div%3E%3C/div%3E%3Cp%20/%3E%3C=\r\ndiv%20class=3D&quot; target=3D_blank&gt;&lt;/P&gt;&lt;/A&gt;&lt;/FONT&gt;&lt;/FONT&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;BLOCKQUOTE&gt;=\r\n\n&lt;HR&gt;\nTo: EVP-ITC@yahoogroups.com&lt;BR&gt;From: ITCdeadpeople@...&lt;BR&gt;Date: T=\r\nue, 8 Apr 2008 01:20:11 +0000&lt;BR&gt;Subject: [EVP-ITC] Re: My opinion on what =\r\nshould be done about ebay_I know it&#39;s long but please rea&lt;BR&gt;&lt;BR&gt;\n&lt;META con=\r\ntent=3D&quot;Microsoft SafeHTML&quot; name=3DGenerator&gt;\n&lt;DIV id=3DEC_ygrp-mlmsg style=\r\n=3D&quot;WIDTH: 655px&quot;&gt;\n&lt;DIV id=3DEC_ygrp-msg style=3D&quot;PADDING-RIGHT: 25px; PADD=\r\nING-LEFT: 0px; Z-INDEX: 1; FLOAT: left; PADDING-BOTTOM: 0px; WIDTH: 470px; =\r\nPADDING-TOP: 0px&quot;&gt;\n&lt;DIV id=3DEC_ygrp-text&gt;\nHi Bruce. I don&#39;t see this so mu=\r\nch as an assault on anyone, as it is simply bringing &lt;BR&gt;awareness into a f=\r\norum (ebay) where it is desperately needed. &lt;BR&gt;&lt;BR&gt;Was it not you who rece=\r\nntly stated sellers who take advantage of others in this way are &quot;no &lt;BR&gt;mo=\r\nre than thieves without guns&quot; and &quot;should not be patronized no matter the &lt;=\r\nBR&gt;circumstances.&lt;WBR&gt;&quot; You have characterized them as &quot;wolves&quot; and &quot;demons=\r\n&quot; but now are &lt;BR&gt;saying &quot;do nothing.&quot; Which, honestly, I could understand =\r\nif my suggestion was coming &lt;BR&gt;from a place of vengeance. It is not.&lt;BR&gt;&lt;B=\r\nR&gt;THIS IS ABOUT EDUCATION FIRST AND FOREMOST, and standing up for those who=\r\n are, &lt;BR&gt;unknowingly, being taken advantage of. The byproduct of providing=\r\n this education will be &lt;BR&gt;allowing consumers to make an informed decision=\r\n and if that hurts the sales of &lt;BR&gt;unscrupulous sellers, then so be it. &lt;B=\r\nR&gt;&lt;BR&gt;Ann has just echoed some of my remarks in earlier posts in support of=\r\n sellers rights to &lt;BR&gt;take advantage of the market ... that some people ma=\r\ny find it&#39;s worth it to pay more to &lt;BR&gt;someone to receive a previously hac=\r\nked unit. &lt;BR&gt;&lt;BR&gt;I would venture to guess, this educational information wi=\r\nll A) help prevent those who are &lt;BR&gt;capable of doing the hack themselves f=\r\nrom being duped, and B) force sellers who do offer &lt;BR&gt;pre-hacked units to =\r\ndo so for a more &#39;reasonable&#39; fee. &lt;BR&gt;&lt;BR&gt;This is neither spiteful nor agg=\r\nressive, and it&#39;s certainly not any kind of vengeance driven &lt;BR&gt;on my part=\r\n. It&#39;s standing up for the uninformed, leveling the playing field for selle=\r\nrs, and &lt;BR&gt;it&#39;s bringing more people the knowledge that doing &#39;box&#39; resear=\r\nch is not an exclusive club &lt;BR&gt;that only the rich can take part in (and gi=\r\nven the pricing on the bids for these units, &lt;BR&gt;people are under the false=\r\n assumption that you have a pay a high price to get your hands &lt;BR&gt;on a lim=\r\nited resource, when that simply is not the case.)&lt;BR&gt;&lt;BR&gt;I can see nothing =\r\nbut positive benefits coming from educating people about their options.&lt;BR&gt;=\r\n&lt;BR&gt;Margaret&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=3D&quot;mailto:EVP-ITC@yahoogroups.com&quot;&gt;EVP-I=\r\nTC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;, &quot;bhali333&quot; &lt;paranormalinvestig&lt;WBR&gt;ating@..=\r\n.&lt;WBR&gt;&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; &lt;BR&gt;&gt; Hi Everyone,&lt;BR&gt;&gt; &lt;BR&gt;&gt; I =\r\nhave been reading the back and forth posts about ideas on how to &lt;BR&gt;&gt; d=\r\neal with the individual selling the hacks on ebay for inflated &lt;BR&gt;&gt; pri=\r\nces.&lt;BR&gt;&gt; &lt;BR&gt;&gt; I posted my thoughts on that individual yesterday. I =\r\nwould now like &lt;BR&gt;&gt; to render my opinion as to the subject of what we o=\r\nr anyone can do &lt;BR&gt;&gt; about it.&lt;BR&gt;&gt; &lt;BR&gt;&gt; My suggestion is DO NOT=\r\nHING! Now before everybody&#39;s jaw hits the &lt;BR&gt;&gt; floor, hear me out.&lt;BR&gt;&=\r\ngt; &lt;BR&gt;&gt; A couple of months ago I would have been the one to lead the c=\r\nharge &lt;BR&gt;&gt; in the assault on this guy in the name of box justice.&lt;BR&gt;&g=\r\nt; &lt;BR&gt;&gt; I can now say with confidence, That is not the way to handle it=\r\n.&lt;BR&gt;&gt; Let me explain why I believe this way. Without going into a lot o=\r\nf &lt;BR&gt;&gt; detail, I was a tough street kid that grew up on the streets of =\r\n&lt;BR&gt;&gt; Brooklyn, I also served my country proudly for six years as a us a=\r\nrmy &lt;BR&gt;&gt; green beret, then to a career as a FDNY Fireman whose heart an=\r\nd &lt;BR&gt;&gt; health where both broken at 911.&lt;BR&gt;&gt; &lt;BR&gt;&gt; My point is, I=\r\n have always lived my life believing that anything I &lt;BR&gt;&gt; did not agree=\r\n with or that did not fit my sense of right and wrong&lt;BR&gt;&gt; whether it be=\r\n right or wrong, could be easily solved with aggression &lt;BR&gt;&gt; of some ki=\r\nnd.&lt;BR&gt;&gt; &lt;BR&gt;&gt; It took a long while and much sole searching and a lot=\r\n of &lt;BR&gt;&gt; communication interpretation from our friends on the other sid=\r\ne.&lt;BR&gt;&gt; But I have come to learn that aggressive action in any form is &lt;=\r\nBR&gt;&gt; detrimental to the harmony and peace of the whole involved.&lt;BR&gt;&gt;=\r\n &lt;BR&gt;&gt; Guy&#39;s like this guy on ebay do not and can not last in the face o=\r\nf &lt;BR&gt;&gt; good and well intentioned people that are here and willing and t=\r\nrying &lt;BR&gt;&gt; to get the word of this miraculous research and spirit commu=\r\nnication &lt;BR&gt;&gt; out to as many people as are in need or want of it.&lt;BR&gt;&g=\r\nt; &lt;BR&gt;&gt; That is how we can stop people like this bottom feeder. By spre=\r\nading &lt;BR&gt;&gt; the knowledge of this research from one person to the next. =\r\nOur &lt;BR&gt;&gt; friends have stated time and time again that any negative ener=\r\ngy will &lt;BR&gt;&gt; be detrimental to the communication and the research, and =\r\npositive &lt;BR&gt;&gt; harmony and vibration will serve to strengthen the bridge=\r\n between our &lt;BR&gt;&gt; worlds.&lt;BR&gt;&gt; &lt;BR&gt;&gt; So even if you are not relig=\r\nious and do not believe in Jesus Christ &lt;BR&gt;&gt; as I do, these words ring =\r\ntrue no matter what context they come from&lt;BR&gt;&gt; this wisdom was spoken b=\r\ny my lord two thousand years ago.&lt;BR&gt;&gt; &lt;BR&gt;&gt; &quot;do not check the splint=\r\ner in your brothers eye, until you have &lt;BR&gt;&gt; checked the plank in your =\r\nown&quot;&lt;BR&gt;&gt; &lt;BR&gt;&gt; Truthfully, anything we could do to sway this individ=\r\nuals sale of &lt;BR&gt;&gt; these boxes would be minimal. Negativity and greed al=\r\nways find a &lt;BR&gt;&gt; crack to seep through.&lt;BR&gt;&gt; &lt;BR&gt;&gt; My suggestion =\r\nis lets try a little harder to spread the word of the &lt;BR&gt;&gt; research and=\r\n educate individuals that are or may become interested, &lt;BR&gt;&gt; through al=\r\nl the various outlets available to us on the web concerning &lt;BR&gt;&gt; the pa=\r\nranormal research community. There are endless chat boards, &lt;BR&gt;&gt; groups=\r\n and forums plus websites and word of mouth. &lt;BR&gt;&gt; Instead of trying to =\r\nstop this idiot from defrauding innocent &lt;BR&gt;&gt; unknowledgable people. Le=\r\nts make sure the knowledge is out there for &lt;BR&gt;&gt; them and we are here t=\r\no help them and guy&#39;s like Mr. ebay will &lt;BR&gt;&gt; disappear on their own.&lt;B=\r\nR&gt;&gt; &lt;BR&gt;&gt; And we will not have expended an ounce of negative energy i=\r\nn the &lt;BR&gt;&gt; process.&lt;BR&gt;&gt; That&#39;s how I feel, but that&#39;s just me.&lt;BR&gt;&=\r\ngt; &lt;BR&gt;&gt; Bruce&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;SPAN style=3D&quot;COLOR: white&quot;&gt;&lt;/=\r\nSPAN&gt; \n&lt;STYLE&gt;\n.ExternalClass #EC_ygrp-mkp\n{border:1px solid #d8d8d8;font-f=\r\namily:Arial;padding:0px 14px;}\n.ExternalClass #EC_ygrp-mkp hr\n{border:1px s=\r\nolid #d8d8d8;}\n.ExternalClass #EC_ygrp-mkp #EC_hd\n{color:#628c2a;font-size:=\r\n85%;font-weight:bold;line-height:122%;}\n.ExternalClass #EC_ygrp-mkp #EC_ads=\r\n\n{margin-bottom:10px;}\n.ExternalClass #EC_ygrp-mkp .EC_ad\n{padding:0 0;}\n.E=\r\nxternalClass #EC_ygrp-mkp .EC_ad a\n{color:#0000ff;text-decoration:none;}\n\n&lt;=\r\n/STYLE&gt;\n\n&lt;STYLE&gt;\n.ExternalClass #EC_ygrp-sponsor #EC_ygrp-lc\n{font-family:A=\r\nrial;}\n.ExternalClass #EC_ygrp-sponsor #EC_ygrp-lc #EC_hd\n{font-weight:bold=\r\n;font-size:78%;line-height:122%;}\n.ExternalClass #EC_ygrp-sponsor #EC_ygrp-=\r\nlc .EC_ad\n{margin-bottom:10px;padding:0 0;}\n\n&lt;/STYLE&gt;\n\n&lt;STYLE&gt;\n.ExternalCla=\r\nss #EC_ygrp-mlmsg\n{font-size:13px;font-family:arial,helvetica,clean,sans-se=\r\nrif;}\n.ExternalClass #EC_ygrp-mlmsg table\n{font-size:inherit;font:100%;}\n.E=\r\nxternalClass #EC_ygrp-mlmsg select, .ExternalClass input, .ExternalClass te=\r\nxtarea\n{font:99% arial,helvetica,clean,sans-serif;}\n.ExternalClass #EC_ygrp=\r\n-mlmsg pre, .ExternalClass code\n{font:115% monospace;}\n.ExternalClass #EC_y=\r\ngrp-mlmsg EC_*\n{line-height:1.22em;}\n.ExternalClass #EC_ygrp-text\n{font-fam=\r\nily:Georgia;}\n.ExternalClass #EC_ygrp-text p\n{;}\n.ExternalClass #EC_ygrp-tp=\r\nmsgs\n{font-family:Arial;clear:both;}\n.ExternalClass #EC_ygrp-vitnav\n{paddin=\r\ng-top:10px;font-family:Verdana;font-size:77%;}\n.ExternalClass #EC_ygrp-vitn=\r\nav a\n{padding:0 1px;}\n.ExternalClass #EC_ygrp-actbar\n{clear:both;white-spac=\r\ne:nowrap;color:#666;text-align:right;}\n.ExternalClass #EC_ygrp-actbar .EC_l=\r\neft\n{float:left;white-space:nowrap;}\n.ExternalClass .EC_bld\n{font-weight:bo=\r\nld;}\n.ExternalClass #EC_ygrp-grft\n{font-family:Verdana;font-size:77%;paddin=\r\ng:15px 0;}\n.ExternalClass #EC_ygrp-ft\n{font-family:verdana;font-size:77%;bo=\r\nrder-top:1px solid #666;padding:5px 0;}\n.ExternalClass #EC_ygrp-mlmsg #EC_l=\r\nogo\n{padding-bottom:10px;}\n.ExternalClass #EC_ygrp-reco\n{margin-bottom:20px=\r\n;padding:0px;}\n.ExternalClass #EC_ygrp-reco #EC_reco-head\n{font-weight:bold=\r\n;color:#ff7900;}\n.ExternalClass #EC_reco-grpname\n{font-weight:bold;}\n.Exter=\r\nnalClass #EC_reco-category\n{font-size:77%;}\n.ExternalClass #EC_reco-desc\n{f=\r\nont-size:77%;}\n.ExternalClass #EC_ygrp-vital\n{background-color:#e0ecee;marg=\r\nin-bottom:20px;padding:2px 0 8px 8px;}\n.ExternalClass #EC_ygrp-vital #EC_vi=\r\nthd\n{font-size:77%;font-family:Verdana;font-weight:bold;color:#333;text-tra=\r\nnsform:uppercase;}\n.ExternalClass #EC_ygrp-vital ul\n{padding:0;}\n.ExternalC=\r\nlass #EC_ygrp-vital ul li\n{list-style-type:none;clear:both;border:1px solid=\r\n #e0ecee;}\n.ExternalClass #EC_ygrp-vital ul li .EC_ct\n{font-weight:bold;col=\r\nor:#ff7900;float:right;width:2em;text-align:right;padding-right:.5em;}\n.Ext=\r\nernalClass #EC_ygrp-vital ul li .EC_cat\n{font-weight:bold;}\n.ExternalClass =\r\n#EC_ygrp-vital a\n{text-decoration:none;}\n.ExternalClass #EC_ygrp-vital a:ho=\r\nver\n{text-decoration:underline;}\n.ExternalClass #EC_ygrp-sponsor #EC_hd\n{co=\r\nlor:#999;font-size:77%;}\n.ExternalClass #EC_ygrp-sponsor #EC_ov\n{padding:6p=\r\nx 13px;background-color:#e0ecee;margin-bottom:20px;}\n.ExternalClass #EC_ygr=\r\np-sponsor #EC_ov ul\n{padding:0 0 0 8px;}\n.ExternalClass #EC_ygrp-sponsor #E=\r\nC_ov li\n{list-style-type:square;padding:6px 0;font-size:77%;}\n.ExternalClas=\r\ns #EC_ygrp-sponsor #EC_ov li a\n{text-decoration:none;font-size:130%;}\n.Exte=\r\nrnalClass #EC_ygrp-sponsor #EC_nc\n{background-color:#eee;margin-bottom:20px=\r\n;padding:0 8px;}\n.ExternalClass #EC_ygrp-sponsor .EC_ad\n{padding:8px 0;}\n.E=\r\nxternalClass #EC_ygrp-sponsor .EC_ad #EC_hd1\n{font-family:Arial;font-weight=\r\n:bold;color:#628c2a;font-size:100%;line-height:122%;}\n.ExternalClass #EC_yg=\r\nrp-sponsor .EC_ad a\n{text-decoration:none;}\n.ExternalClass #EC_ygrp-sponsor=\r\n .EC_ad a:hover\n{text-decoration:underline;}\n.ExternalClass #EC_ygrp-sponso=\r\nr .EC_ad p\n{;}\n.ExternalClass EC_o\n{font-size:0;}\n.ExternalClass .EC_MsoNor=\r\nmal\n{;}\n.ExternalClass #EC_ygrp-text tt\n{font-size:120%;}\n.ExternalClass bl=\r\nockquote\n{;}\n.ExternalClass .EC_replbq\n{;}\n\n&lt;/STYLE&gt;\n&lt;/BLOCKQUOTE&gt;&lt;br /&gt;&lt;hr=\r\n /&gt;Going green? &lt;a href=3D&#39;http://green.msn.com/galleries/photos/photos.asp=\r\nx?gid=3D164&ocid=3DT003MSN51N1653A&#39; target=3D&#39;_new&#39;&gt;See the top 12 foods to=\r\n eat organic.&lt;/a&gt;&lt;/body&gt;\n&lt;/html&gt;\r\n--_f118f78d-7742-40c8-afb5-6faff7acf25a_--"}