{"id": "9199", "subject": "Re: [EVP-ITC] Re: another lengthy post about ebay in answer to margaret", "author": "Wiliam Clarke", "timestamp": "2008-04-08T17:17:33Z", "full_text": "--0-2058474365-1207675053=:62619\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nI guessing the subject of this post &quot;Re: [EVP-ITC] Re: another lengthy post about ebay in answer to margaret&quot;  are y&#39;all talking about people that answer in lengthy post.  Unless the post is worth reading, and is something about the GB research.  I will read the whole post, but if its about something not pertaining to the GB research &quot;delete&quot;.  Thats just how it is!!!\n  I am probaly totaly off subject, but I just had a look at the Subject, and that was the first thing that came out!\n   \n  Rees\n\npsfponies &lt;psfponies@...&gt; wrote:\n          Bruce\n\nI hate to admit this but when I first heard about the Franks box on \nparanormal state I went to ebay to see if there were any on there. I \nalso did a search for Ghost box but lucky for me there wasnt any on \nebay at the time, cause I would of foolishly paid the $49.95 plus \nshipping to get the RS hack that is on ebay now. (dont think I would \nof gone as high as some of the bidder have gone)\n\nKay\n\n--- In EVP-ITC@yahoogroups.com, bruce halliday \n&lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; \n&gt; Margaret,\n&gt; \n&gt; In my initial reply I voiced my disdain for low lives that take \nadvantage of unwary people\n&gt; but did not advocate any action by any researchers on this board.\n&gt; \n&gt; My goal is not just pacifism for it&#39;s own sake, believe me any of \nthe old timers here can attest to my temper.\n&gt; My concern is for the negative disruption in the energy flow of \nthe communication.\n&gt; I think that following the example of &quot;turn the other cheek&quot; will \nbe very well received on the other side and therefore \n&gt; contribute to strengthening the bridge.\n&gt; \n&gt; In the past couple of days I know Kristin has received messages \nabout the seven and the circle, \n&gt; these are metaphors for peace, harmony and cooperation of energies \nwithin the communication.\n&gt; \n&gt; It is not the first time we have received messages with these \nexamples, I personally have received numerous \n&gt; messages pertaining to circle, circles and the power of seven. It \nhas been contemplated in length here more than once.\n&gt; \n&gt; I have, through interpretation of communication over a long period \nof time, come to PERSONALLY believe that the urgence of \n&gt; harmony and positive energy is the fertilizer of the growth of our \ncommunication with the spirit world.\n&gt; \n&gt; I&#39;m sorry, I drifted off the subject at hand, but my reason is \nrelevant to this commentary. \n&gt; Taking any action against this ebay fool will first and foremost \nserve our ego&#39;s and secondly\n&gt; may help to provide information to unwary buyers that is contrary \nto what this thief is putting out.\n&gt; \n&gt; But could that not be accomplished through other venues that would \nhelp to educate many more people that\n&gt; are would be box researchers and do not look to ebay as a source \nfor an RS hack. But are seeking general knowledge.\n&gt; \n&gt; And Margaret to thine own self be true, when this was brought up \nmy first reaction was to figure out a way to sabotage\n&gt; this guy&#39;s business venture. After thinking it over and asking \nmyself what the first reason for doing that would be. My answer\n&gt; Was, to get this asshole that is exploiting something that I hold \nvery dear, and in turn help to steer unaware buyers away from \ngetting screwed.\n&gt; \n&gt; But still my initial and primal reason was to inflict some sort of \npunishment on a person that I felt was unscrupulous. And I decided \nthat this was\n&gt; a negative emotion and would generate negative energy, no matter \nhow I tried to convince myself it was in the name of justice.\n&gt; \n&gt; That goes without even mentioning the fact that we are not the say \nall and do all of this research. There are other entities involved \nthat I would think \n&gt; have better influential power than we do. If they want it stopped \nthey will find a way to stop it. I know what your going to say, \nmaybe we are the \n&gt; tools they are using to stop this injustice. That may very well \nbe, and if so then that is the way it will play out.\n&gt; \n&gt; I think you mistake what I am implying. I am not saying do \nnothing, quite the opposite. It is actually our duty to do \nsomething. All I&#39;m saying is there \n&gt; are alternative ways to educate unwary possible researchers that \nwould be 100% positive and not entail any type of stone throwing \ntactics.\n&gt; \n&gt; I have said my piece now at the expense of boring everyone to \ndeath. So I will see how this unfolds, and during my daily session \nwill inquire about how our friends feel about it.\n&gt; \n&gt; Bruce\n&gt; Bruce Halliday \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: ITCdeadpeople@...: Tue, 8 Apr 2008 01:20:11 \n+0000Subject: [EVP-ITC] Re: My opinion on what should be done about \nebay_I know it&#39;s long but please rea\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Hi Bruce. I don&#39;t see this so much as an assault on anyone, as it \nis simply bringing awareness into a forum (ebay) where it is \ndesperately needed. Was it not you who recently stated sellers who \ntake advantage of others in this way are &quot;no more than thieves \nwithout guns&quot; and &quot;should not be patronized no matter the \ncircumstances.&quot; You have characterized them as &quot;wolves&quot; and &quot;demons&quot; \nbut now are saying &quot;do nothing.&quot; Which, honestly, I could understand \nif my suggestion was coming from a place of vengeance. It is \nnot.THIS IS ABOUT EDUCATION FIRST AND FOREMOST, and standing up for \nthose who are, unknowingly, being taken advantage of. The byproduct \nof providing this education will be allowing consumers to make an \ninformed decision and if that hurts the sales of unscrupulous \nsellers, then so be it. Ann has just echoed some of my remarks in \nearlier posts in support of sellers rights to take advantage of the \nmarket ... that some people may find it&#39;s worth it to pay more to \nsomeone to receive a previously hacked unit. I would venture to \nguess, this educational information will A) help prevent those who \nare capable of doing the hack themselves from being duped, and B) \nforce sellers who do offer pre-hacked units to do so for a \nmore &#39;reasonable&#39; fee. This is neither spiteful nor aggressive, and \nit&#39;s certainly not any kind of vengeance driven on my part. It&#39;s \nstanding up for the uninformed, leveling the playing field for \nsellers, and it&#39;s bringing more people the knowledge that \ndoing &#39;box&#39; research is not an exclusive club that only the rich can \ntake part in (and given the pricing on the bids for these units, \npeople are under the false assumption that you have a pay a high \nprice to get your hands on a limited resource, when that simply is \nnot the case.)I can see nothing but positive benefits coming from \neducating people about their options.Margaret--- In EVP-\nITC@yahoogroups.com, &quot;bhali333&quot; &lt;paranormalinvestigating@&gt; wrote:&gt;&gt; \n&gt; Hi Everyone,&gt; &gt; I have been reading the back and forth posts about \nideas on how to &gt; deal with the individual selling the hacks on ebay \nfor inflated &gt; prices.&gt; &gt; I posted my thoughts on that individual \nyesterday. I would now like &gt; to render my opinion as to the subject \nof what we or anyone can do &gt; about it.&gt; &gt; My suggestion is DO \nNOTHING! Now before everybody&#39;s jaw hits the &gt; floor, hear me out.&gt; \n&gt; A couple of months ago I would have been the one to lead the \ncharge &gt; in the assault on this guy in the name of box justice.&gt; &gt; I \ncan now say with confidence, That is not the way to handle it.&gt; Let \nme explain why I believe this way. Without going into a lot of &gt; \ndetail, I was a tough street kid that grew up on the streets of &gt; \nBrooklyn, I also served my country proudly for six years as a us \narmy &gt; green beret, then to a career as a FDNY Fireman whose heart \nand &gt; health where both broken at 911.&gt; &gt; My point is, I have always \nlived my life believing that anything I &gt; did not agree with or that \ndid not fit my sense of right and wrong&gt; whether it be right or \nwrong, could be easily solved with aggression &gt; of some kind.&gt; &gt; It \ntook a long while and much sole searching and a lot of &gt; \ncommunication interpretation from our friends on the other side.&gt; \nBut I have come to learn that aggressive action in any form is &gt; \ndetrimental to the harmony and peace of the whole involved.&gt; &gt; Guy&#39;s \nlike this guy on ebay do not and can not last in the face of &gt; good \nand well intentioned people that are here and willing and trying &gt; \nto get the word of this miraculous research and spirit communication \n&gt; out to as many people as are in need or want of it.&gt; &gt; That is how \nwe can stop people like this bottom feeder. By spreading &gt; the \nknowledge of this research from one person to the next. Our &gt; \nfriends have stated time and time again that any negative energy \nwill &gt; be detrimental to the communication and the research, and \npositive &gt; harmony and vibration will serve to strengthen the bridge \nbetween our &gt; worlds.&gt; &gt; So even if you are not religious and do not \nbelieve in Jesus Christ &gt; as I do, these words ring true no matter \nwhat context they come from&gt; this wisdom was spoken by my lord two \nthousand years ago.&gt; &gt; &quot;do not check the splinter in your brothers \neye, until you have &gt; checked the plank in your own&quot;&gt; &gt; Truthfully, \nanything we could do to sway this individuals sale of &gt; these boxes \nwould be minimal. Negativity and greed always find a &gt; crack to seep \nthrough.&gt; &gt; My suggestion is lets try a little harder to spread the \nword of the &gt; research and educate individuals that are or may \nbecome interested, &gt; through all the various outlets available to us \non the web concerning &gt; the paranormal research community. There are \nendless chat boards, &gt; groups and forums plus websites and word of \nmouth. &gt; Instead of trying to stop this idiot from defrauding \ninnocent &gt; unknowledgable people. Lets make sure the knowledge is \nout there for &gt; them and we are here to help them and guy&#39;s like Mr. \nebay will &gt; disappear on their own.&gt; &gt; And we will not have expended \nan ounce of negative energy in the &gt; process.&gt; That&#39;s how I feel, \nbut that&#39;s just me.&gt; &gt; Bruce&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; __________________________________________________________\n&gt; Going green? See the top 12 foods to eat organic.\n&gt; http://green.msn.com/galleries/photos/photos.aspx?\ngid=164&ocid=T003MSN51N1653A\n&gt;\n\n\n\n                           \n\n       \n---------------------------------\nYou rock. That&#39;s why Blockbuster&#39;s offering you one month of Blockbuster Total Access, No Cost.\r\n--0-2058474365-1207675053=:62619\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;div&gt;I guessing the subject of this post &quot;&lt;STRONG&gt;Re: [EVP-ITC] Re: another lengthy post about ebay in answer to margaret&lt;/STRONG&gt;&quot;&nbsp; are y&#39;all talking about people that answer in lengthy post.&nbsp; Unless the post is worth reading, and is something about the GB research.&nbsp; I will read the whole post, but if its about something not pertaining to the GB research &quot;delete&quot;.&nbsp; Thats just how it is!!!&lt;/div&gt;  &lt;div&gt;I am probaly totaly off subject, but I just had a look at the Subject, and that was the first thing that came out!&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Rees&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;psfponies &lt;psfponies@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/div&gt;  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;div&gt;Bruce&lt;BR&gt;&lt;BR&gt;I hate to admit this but when I first heard about the Franks box on &lt;BR&gt;paranormal state I went to ebay to see if there were any on there. I &lt;BR&gt;also did a search for Ghost box but lucky for me there wasnt any on &lt;BR&gt;ebay at the time, cause I would of foolishly paid the $49.95 plus &lt;BR&gt;shipping to get the RS hack that is on ebay now. (dont think I would &lt;BR&gt;of gone as high as some of the bidder have gone)&lt;BR&gt;&lt;BR&gt;Kay&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;, bruce halliday &lt;BR&gt;&lt;paranormalinvestig&lt;WBR&gt;ating@...&lt;WBR&gt;&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; &lt;BR&gt;&gt; Margaret,&lt;BR&gt;&gt; &lt;BR&gt;&gt; In my initial reply I voiced my disdain for low lives that take &lt;BR&gt;advantage of unwary people&lt;BR&gt;&gt; but did not advocate any action by any researchers on this board.&lt;BR&gt;&gt; &lt;BR&gt;&gt; My goal is not just pacifism for it&#39;s own sake, believe me any of &lt;BR&gt;the\n old timers here can attest to my temper.&lt;BR&gt;&gt; My concern is for the negative disruption in the energy flow of &lt;BR&gt;the communication.&lt;BR&gt;&gt; I think that following the example of &quot;turn the other cheek&quot; will &lt;BR&gt;be very well received on the other side and therefore &lt;BR&gt;&gt; contribute to strengthening the bridge.&lt;BR&gt;&gt; &lt;BR&gt;&gt; In the past couple of days I know Kristin has received messages &lt;BR&gt;about the seven and the circle, &lt;BR&gt;&gt; these are metaphors for peace, harmony and cooperation of energies &lt;BR&gt;within the communication.&lt;BR&gt;&gt; &lt;BR&gt;&gt; It is not the first time we have received messages with these &lt;BR&gt;examples, I personally have received numerous &lt;BR&gt;&gt; messages pertaining to circle, circles and the power of seven. It &lt;BR&gt;has been contemplated in length here more than once.&lt;BR&gt;&gt; &lt;BR&gt;&gt; I have, through interpretation of communication over a long period &lt;BR&gt;of time, come to PERSONALLY believe that the urgence of &lt;BR&gt;&gt; harmony and positive energy is\n the fertilizer of the growth of our &lt;BR&gt;communication with the spirit world.&lt;BR&gt;&gt; &lt;BR&gt;&gt; I&#39;m sorry, I drifted off the subject at hand, but my reason is &lt;BR&gt;relevant to this commentary. &lt;BR&gt;&gt; Taking any action against this ebay fool will first and foremost &lt;BR&gt;serve our ego&#39;s and secondly&lt;BR&gt;&gt; may help to provide information to unwary buyers that is contrary &lt;BR&gt;to what this thief is putting out.&lt;BR&gt;&gt; &lt;BR&gt;&gt; But could that not be accomplished through other venues that would &lt;BR&gt;help to educate many more people that&lt;BR&gt;&gt; are would be box researchers and do not look to ebay as a source &lt;BR&gt;for an RS hack. But are seeking general knowledge.&lt;BR&gt;&gt; &lt;BR&gt;&gt; And Margaret to thine own self be true, when this was brought up &lt;BR&gt;my first reaction was to figure out a way to sabotage&lt;BR&gt;&gt; this guy&#39;s business venture. After thinking it over and asking &lt;BR&gt;myself what the first reason for doing that would be. My answer&lt;BR&gt;&gt; Was, to get this asshole that is\n exploiting something that I hold &lt;BR&gt;very dear, and in turn help to steer unaware buyers away from &lt;BR&gt;getting screwed.&lt;BR&gt;&gt; &lt;BR&gt;&gt; But still my initial and primal reason was to inflict some sort of &lt;BR&gt;punishment on a person that I felt was unscrupulous. And I decided &lt;BR&gt;that this was&lt;BR&gt;&gt; a negative emotion and would generate negative energy, no matter &lt;BR&gt;how I tried to convince myself it was in the name of justice.&lt;BR&gt;&gt; &lt;BR&gt;&gt; That goes without even mentioning the fact that we are not the say &lt;BR&gt;all and do all of this research. There are other entities involved &lt;BR&gt;that I would think &lt;BR&gt;&gt; have better influential power than we do. If they want it stopped &lt;BR&gt;they will find a way to stop it. I know what your going to say, &lt;BR&gt;maybe we are the &lt;BR&gt;&gt; tools they are using to stop this injustice. That may very well &lt;BR&gt;be, and if so then that is the way it will play out.&lt;BR&gt;&gt; &lt;BR&gt;&gt; I think you mistake what I am implying. I am not saying do\n &lt;BR&gt;nothing, quite the opposite. It is actually our duty to do &lt;BR&gt;something. All I&#39;m saying is there &lt;BR&gt;&gt; are alternative ways to educate unwary possible researchers that &lt;BR&gt;would be 100% positive and not entail any type of stone throwing &lt;BR&gt;tactics.&lt;BR&gt;&gt; &lt;BR&gt;&gt; I have said my piece now at the expense of boring everyone to &lt;BR&gt;death. So I will see how this unfolds, and during my daily session &lt;BR&gt;will inquire about how our friends feel about it.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Bruce&lt;BR&gt;&gt; Bruce Halliday &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; To: EVP-ITC@...: ITCdeadpeople@&lt;WBR&gt;...: Tue, 8 Apr 2008 01:20:11 &lt;BR&gt;+0000Subject: [EVP-ITC] Re: My opinion on what should be done about &lt;BR&gt;ebay_I know it&#39;s long but please rea&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; Hi Bruce. I don&#39;t see this so much as an assault on anyone, as it &lt;BR&gt;is simply bringing awareness into a forum (ebay) where it is &lt;BR&gt;desperately needed. Was it not you who recently stated sellers who &lt;BR&gt;take advantage of\n others in this way are &quot;no more than thieves &lt;BR&gt;without guns&quot; and &quot;should not be patronized no matter the &lt;BR&gt;circumstances.&lt;WBR&gt;&quot; You have characterized them as &quot;wolves&quot; and &quot;demons&quot; &lt;BR&gt;but now are saying &quot;do nothing.&quot; Which, honestly, I could understand &lt;BR&gt;if my suggestion was coming from a place of vengeance. It is &lt;BR&gt;not.THIS IS ABOUT EDUCATION FIRST AND FOREMOST, and standing up for &lt;BR&gt;those who are, unknowingly, being taken advantage of. The byproduct &lt;BR&gt;of providing this education will be allowing consumers to make an &lt;BR&gt;informed decision and if that hurts the sales of unscrupulous &lt;BR&gt;sellers, then so be it. Ann has just echoed some of my remarks in &lt;BR&gt;earlier posts in support of sellers rights to take advantage of the &lt;BR&gt;market ... that some people may find it&#39;s worth it to pay more to &lt;BR&gt;someone to receive a previously hacked unit. I would venture to &lt;BR&gt;guess, this educational information will A) help prevent those who &lt;BR&gt;are capable of doing the hack\n themselves from being duped, and B) &lt;BR&gt;force sellers who do offer pre-hacked units to do so for a &lt;BR&gt;more &#39;reasonable&#39; fee. This is neither spiteful nor aggressive, and &lt;BR&gt;it&#39;s certainly not any kind of vengeance driven on my part. It&#39;s &lt;BR&gt;standing up for the uninformed, leveling the playing field for &lt;BR&gt;sellers, and it&#39;s bringing more people the knowledge that &lt;BR&gt;doing &#39;box&#39; research is not an exclusive club that only the rich can &lt;BR&gt;take part in (and given the pricing on the bids for these units, &lt;BR&gt;people are under the false assumption that you have a pay a high &lt;BR&gt;price to get your hands on a limited resource, when that simply is &lt;BR&gt;not the case.)I can see nothing but positive benefits coming from &lt;BR&gt;educating people about their options.Margaret-&lt;WBR&gt;-- In EVP-&lt;BR&gt;&lt;A href=&quot;mailto:ITC%40yahoogroups.com&quot;&gt;ITC@yahoogroups.&lt;WBR&gt;com&lt;/A&gt;, &quot;bhali333&quot; &lt;paranormalinvestig&lt;WBR&gt;ating@&gt; wrote:&gt;&gt; &lt;BR&gt;&gt; Hi Everyone,&gt; &gt; I have been reading the back and\n forth posts about &lt;BR&gt;ideas on how to &gt; deal with the individual selling the hacks on ebay &lt;BR&gt;for inflated &gt; prices.&gt; &gt; I posted my thoughts on that individual &lt;BR&gt;yesterday. I would now like &gt; to render my opinion as to the subject &lt;BR&gt;of what we or anyone can do &gt; about it.&gt; &gt; My suggestion is DO &lt;BR&gt;NOTHING! Now before everybody&#39;s jaw hits the &gt; floor, hear me out.&gt; &lt;BR&gt;&gt; A couple of months ago I would have been the one to lead the &lt;BR&gt;charge &gt; in the assault on this guy in the name of box justice.&gt; &gt; I &lt;BR&gt;can now say with confidence, That is not the way to handle it.&gt; Let &lt;BR&gt;me explain why I believe this way. Without going into a lot of &gt; &lt;BR&gt;detail, I was a tough street kid that grew up on the streets of &gt; &lt;BR&gt;Brooklyn, I also served my country proudly for six years as a us &lt;BR&gt;army &gt; green beret, then to a career as a FDNY Fireman whose heart &lt;BR&gt;and &gt; health where both broken at 911.&gt; &gt; My point is, I\n have always &lt;BR&gt;lived my life believing that anything I &gt; did not agree with or that &lt;BR&gt;did not fit my sense of right and wrong&gt; whether it be right or &lt;BR&gt;wrong, could be easily solved with aggression &gt; of some kind.&gt; &gt; It &lt;BR&gt;took a long while and much sole searching and a lot of &gt; &lt;BR&gt;communication interpretation from our friends on the other side.&gt; &lt;BR&gt;But I have come to learn that aggressive action in any form is &gt; &lt;BR&gt;detrimental to the harmony and peace of the whole involved.&gt; &gt; Guy&#39;s &lt;BR&gt;like this guy on ebay do not and can not last in the face of &gt; good &lt;BR&gt;and well intentioned people that are here and willing and trying &gt; &lt;BR&gt;to get the word of this miraculous research and spirit communication &lt;BR&gt;&gt; out to as many people as are in need or want of it.&gt; &gt; That is how &lt;BR&gt;we can stop people like this bottom feeder. By spreading &gt; the &lt;BR&gt;knowledge of this research from one person to the next. Our &gt; &lt;BR&gt;friends have\n stated time and time again that any negative energy &lt;BR&gt;will &gt; be detrimental to the communication and the research, and &lt;BR&gt;positive &gt; harmony and vibration will serve to strengthen the bridge &lt;BR&gt;between our &gt; worlds.&gt; &gt; So even if you are not religious and do not &lt;BR&gt;believe in Jesus Christ &gt; as I do, these words ring true no matter &lt;BR&gt;what context they come from&gt; this wisdom was spoken by my lord two &lt;BR&gt;thousand years ago.&gt; &gt; &quot;do not check the splinter in your brothers &lt;BR&gt;eye, until you have &gt; checked the plank in your own&quot;&gt; &gt; Truthfully, &lt;BR&gt;anything we could do to sway this individuals sale of &gt; these boxes &lt;BR&gt;would be minimal. Negativity and greed always find a &gt; crack to seep &lt;BR&gt;through.&gt; &gt; My suggestion is lets try a little harder to spread the &lt;BR&gt;word of the &gt; research and educate individuals that are or may &lt;BR&gt;become interested, &gt; through all the various outlets available to us &lt;BR&gt;on the web\n concerning &gt; the paranormal research community. There are &lt;BR&gt;endless chat boards, &gt; groups and forums plus websites and word of &lt;BR&gt;mouth. &gt; Instead of trying to stop this idiot from defrauding &lt;BR&gt;innocent &gt; unknowledgable people. Lets make sure the knowledge is &lt;BR&gt;out there for &gt; them and we are here to help them and guy&#39;s like Mr. &lt;BR&gt;ebay will &gt; disappear on their own.&gt; &gt; And we will not have expended &lt;BR&gt;an ounce of negative energy in the &gt; process.&gt; That&#39;s how I feel, &lt;BR&gt;but that&#39;s just me.&gt; &gt; Bruce&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; ____________&lt;WBR&gt;_________&lt;WBR&gt;_________&lt;WBR&gt;_________&lt;WBR&gt;_________&lt;WBR&gt;_________&lt;WBR&gt;_&lt;BR&gt;&gt; Going green? See the top 12 foods to eat organic.&lt;BR&gt;&gt; &lt;A\n href=&quot;http://green.msn.com/galleries/photos/photos.aspx?&quot;&gt;http://green.&lt;WBR&gt;msn.com/gallerie&lt;WBR&gt;s/photos/&lt;WBR&gt;photos.aspx?&lt;/A&gt;&lt;BR&gt;gid=164&amp;ocid=&lt;WBR&gt;T003MSN51N1653A&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/div&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;p&gt;&#32;\n\n\n\n      &lt;hr size=1&gt;You rock. That&#39;s why Blockbuster&#39;s offering you &lt;a href=&quot;http://us.rd.yahoo.com/evt=47523/*http://tc.deals.yahoo.com/tc/blockbuster/text5.com&quot;&gt;one month of Blockbuster Total Access&lt;/a&gt;, No Cost.\r\n--0-2058474365-1207675053=:62619--"}