{"id": "9200", "subject": "Re: another lengthy post about ebay in answer to Bruce", "author": "itcdeadpeople", "timestamp": "2008-04-08T17:31:45Z", "full_text": "Hi Bruce.  The same action can be taken (sharing the information about how to hack the \nradios) for the purpose of education, in the spirit of furthering the research OR in the \nspirit of punishment.  Some might think that the first reason is positive and the second \nnegative.  But, in truth, there probably is not be a clear line of distinction in this instance.  \n\nI realize you did not initially suggest researchers on this board take any action, but you \ndid take a strong stance about doing &quot;nothing,&quot; (which might be considered an act of \n&#39;inaction&#39; if you think about it) and now you&#39;re somewhere on the middle ground ... do \nsomething, but don&#39;t do it on eBay.  All, reasonable positions to take, I might add.  \n\nI understand what you are saying about not wanting to generate negative energy.  I guess \nat this point we are talking about the motivating emotion behind a chosen action as the \ndetermining factor as to whether or not the same action would be construed as positive or \nnegative (or stone throwing, as you call it). \n\nWith ANY of the choices in this matter, there is a corresponding consequence, or \nconsequences.  Over the last couple days, a number of options have been thrown out \nthere.  The problem is, the situation is complicated, and I don&#39;t think there is any one \ncorrect, or even &#39;best&#39; solution, because any choice made carries with it some \nresponsibility and ownership on the part of the decision maker, including the choice of \ninaction.\n\nIn a group a large as this it would likely be impossible to come to a consensus of a &quot;best&quot; \nsolution.  And should that monumental task be achieved, and a single best solution \nagreed upon, it would be highly unlikely that there would be a unified motivation behind \npeople&#39;s opinions as to WHY that solution is best.  \n\nPerhaps the most positive thing that has come from all of this, thus far, is the potential for \nintrospection this discussion has brought forth, such as you recognizing your desire to \n&quot;inflict punishment.&quot;  What a marvelous gift that insight is. :-)\n\nSo, here is what we&#39;ve come up with so far and the progression of suggestions:\n\nSell hacked units on eBay at cost or at a small loss\n\nSell hacked units for profit, but undercut other sellers\n\nDo nothing\n\nOffer hack instructions on eBay for free\n\nOffer hack instructions in more places, but exclude eBay \n\nDid I miss any?  (probably)\n\nWow!  Lots for people to think about.  Seems at this point, it is up to each individual \nperson to search within, decide for themselves what action (or inaction) will be taken and \nwhy.  \n\nMargaret  \n\n\n\n--- In EVP-ITC@yahoogroups.com, bruce halliday &lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; \n&gt; Margaret,\n&gt;  \n&gt; In my initial reply I voiced my disdain for low lives that take advantage of unwary people\n&gt; but did not advocate any action by any researchers on this board.\n&gt;  \n&gt; My goal is not just pacifism for it&#39;s own sake, believe me any of the old timers here can \nattest to my temper.\n&gt; My concern is for the negative disruption in the energy flow of the communication.\n&gt; I think that following the example of &quot;turn the other cheek&quot; will be very well received on \nthe other side and therefore \n&gt; contribute to strengthening the bridge.\n&gt;  \n&gt; In the past couple of days I know Kristin has received messages about the seven and the \ncircle, \n&gt; these are metaphors for peace, harmony and cooperation of energies within the \ncommunication.\n&gt;  \n&gt; It is not the first time we have received messages with these examples, I personally have \nreceived numerous \n&gt; messages pertaining to circle, circles and the power of seven. It has been contemplated \nin length here more than once.\n&gt;  \n&gt; I have, through interpretation of communication over a long period of time, come to \nPERSONALLY believe that the urgence of \n&gt; harmony and positive energy is the fertilizer of the growth of our communication with \nthe spirit world.\n&gt;  \n&gt; I&#39;m sorry, I drifted off the subject at hand, but my reason is relevant to this commentary. \n&gt; Taking any action against this ebay fool will first and foremost serve our ego&#39;s and \nsecondly\n&gt; may help to provide information to unwary buyers that is contrary to what this thief is \nputting out.\n&gt;  \n&gt; But could that not be accomplished through other venues that would help to educate \nmany more people that\n&gt; are would be box researchers and do not look to ebay as a source for an RS hack. But \nare seeking general knowledge.\n&gt;  \n&gt; And Margaret to thine own self be true, when this was brought up my first reaction was \nto figure out a way to sabotage\n&gt; this guy&#39;s business venture. After thinking it over and asking myself what the first \nreason for doing that would be. My answer\n&gt; Was, to get this asshole that is exploiting something that I hold very dear, and in turn \nhelp to steer unaware buyers away from getting screwed.\n&gt;  \n&gt; But still my initial and primal reason was to inflict some sort of punishment on a person \nthat I felt was unscrupulous. And I decided that this was\n&gt; a negative emotion and would generate negative energy, no matter how I tried to \nconvince myself it was in the name of justice.\n&gt;  \n&gt; That goes without even mentioning the fact that we are not the say all and do all of this \nresearch. There are other entities involved that I would think \n&gt; have better influential power than we do. If they want it stopped they will find a way to \nstop it. I know what your going to say, maybe we are the \n&gt; tools they are using to stop this injustice. That may very well be, and if so then that is \nthe way it will play out.\n&gt;  \n&gt; I think you mistake what I am implying. I am not saying do nothing, quite the opposite. \nIt is actually our duty to do something. All I&#39;m saying is there \n&gt; are alternative ways to educate unwary possible researchers that would be 100% positive \nand not entail any type of stone throwing tactics.\n&gt;  \n&gt; I have said my piece now at the expense of boring everyone to death. So I will see how \nthis unfolds, and during my daily session will inquire about how our friends feel about it.\n&gt;  \n&gt; Bruce\n&gt; Bruce Halliday \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: ITCdeadpeople@...: Tue, 8 Apr 2008 01:20:11 +0000Subject: [EVP-\nITC] Re: My opinion on what should be done about ebay_I know it&#39;s long but please rea\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Hi Bruce. I don&#39;t see this so much as an assault on anyone, as it is simply bringing \nawareness into a forum (ebay) where it is desperately needed. Was it not you who recently \nstated sellers who take advantage of others in this way are &quot;no more than thieves without \nguns&quot; and &quot;should not be patronized no matter the circumstances.&quot; You have \ncharacterized them as &quot;wolves&quot; and &quot;demons&quot; but now are saying &quot;do nothing.&quot; Which, \nhonestly, I could understand if my suggestion was coming from a place of vengeance. It is \nnot.THIS IS ABOUT EDUCATION FIRST AND FOREMOST, and standing up for those who are, \nunknowingly, being taken advantage of. The byproduct of providing this education will be \nallowing consumers to make an informed decision and if that hurts the sales of \nunscrupulous sellers, then so be it. Ann has just echoed some of my remarks in earlier \nposts in support of sellers rights to take advantage of the market ... that some people may \nfind it&#39;s worth it to pay more to someone to receive a previously hacked unit. I would \nventure to guess, this educational information will A) help prevent those who are capable \nof doing the hack themselves from being duped, and B) force sellers who do offer pre-\nhacked units to do so for a more &#39;reasonable&#39; fee. This is neither spiteful nor aggressive, \nand it&#39;s certainly not any kind of vengeance driven on my part. It&#39;s standing up for the \nuninformed, leveling the playing field for sellers, and it&#39;s bringing more people the \nknowledge that doing &#39;box&#39; research is not an exclusive club that only the rich can take \npart in (and given the pricing on the bids for these units, people are under the false \nassumption that you have a pay a high price to get your hands on a limited resource, \nwhen that simply is not the case.)I can see nothing but positive benefits coming from \neducating people about their options.Margaret--- In EVP-ITC@yahoogroups.com, \n&quot;bhali333&quot; &lt;paranormalinvestigating@&gt; wrote:&gt;&gt; &gt; Hi Everyone,&gt; &gt; I have been reading \nthe back and forth posts about ideas on how to &gt; deal with the individual selling the \nhacks on ebay for inflated &gt; prices.&gt; &gt; I posted my thoughts on that individual yesterday. \nI would now like &gt; to render my opinion as to the subject of what we or anyone can do &gt; \nabout it.&gt; &gt; My suggestion is DO NOTHING! Now before everybody&#39;s jaw hits the &gt; floor, \nhear me out.&gt; &gt; A couple of months ago I would have been the one to lead the charge &gt; \nin the assault on this guy in the name of box justice.&gt; &gt; I can now say with confidence, \nThat is not the way to handle it.&gt; Let me explain why I believe this way. Without going into \na lot of &gt; detail, I was a tough street kid that grew up on the streets of &gt; Brooklyn, I also \nserved my country proudly for six years as a us army &gt; green beret, then to a career as a \nFDNY Fireman whose heart and &gt; health where both broken at 911.&gt; &gt; My point is, I have \nalways lived my life believing that anything I &gt; did not agree with or that did not fit my \nsense of right and wrong&gt; whether it be right or wrong, could be easily solved with \naggression &gt; of some kind.&gt; &gt; It took a long while and much sole searching and a lot of \n&gt; communication interpretation from our friends on the other side.&gt; But I have come to \nlearn that aggressive action in any form is &gt; detrimental to the harmony and peace of the \nwhole involved.&gt; &gt; Guy&#39;s like this guy on ebay do not and can not last in the face of &gt; \ngood and well intentioned people that are here and willing and trying &gt; to get the word of \nthis miraculous research and spirit communication &gt; out to as many people as are in need \nor want of it.&gt; &gt; That is how we can stop people like this bottom feeder. By spreading &gt; \nthe knowledge of this research from one person to the next. Our &gt; friends have stated \ntime and time again that any negative energy will &gt; be detrimental to the communication \nand the research, and positive &gt; harmony and vibration will serve to strengthen the bridge \nbetween our &gt; worlds.&gt; &gt; So even if you are not religious and do not believe in Jesus \nChrist &gt; as I do, these words ring true no matter what context they come from&gt; this \nwisdom was spoken by my lord two thousand years ago.&gt; &gt; &quot;do not check the splinter in \nyour brothers eye, until you have &gt; checked the plank in your own&quot;&gt; &gt; Truthfully, \nanything we could do to sway this individuals sale of &gt; these boxes would be minimal. \nNegativity and greed always find a &gt; crack to seep through.&gt; &gt; My suggestion is lets try a \nlittle harder to spread the word of the &gt; research and educate individuals that are or may \nbecome interested, &gt; through all the various outlets available to us on the web concerning \n&gt; the paranormal research community. There are endless chat boards, &gt; groups and \nforums plus websites and word of mouth. &gt; Instead of trying to stop this idiot from \ndefrauding innocent &gt; unknowledgable people. Lets make sure the knowledge is out there \nfor &gt; them and we are here to help them and guy&#39;s like Mr. ebay will &gt; disappear on their \nown.&gt; &gt; And we will not have expended an ounce of negative energy in the &gt; process.&gt; \nThat&#39;s how I feel, but that&#39;s just me.&gt; &gt; Bruce&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Going green? See the top 12 foods to eat organic.\n&gt; http://green.msn.com/galleries/photos/photos.aspx?\ngid=164&ocid=T003MSN51N1653A\n&gt;"}