{"id": "9207", "subject": "Re: [EVP-ITC] Re: post about ebay in answer to Rees", "author": "Wiliam Clarke", "timestamp": "2008-04-08T19:16:28Z", "full_text": "--0-503282496-1207682188=:85109\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nOK thanks for the info\n\nitcdeadpeople &lt;ITCdeadpeople@...&gt; wrote:          Hi Rees. Customer feedback suggests those who have bought these units are happy, and \ntherefore, business will continue as usual until:\n\n1 - Negative feedback is left \n(which isn&#39;t likely, because the units do work, and people are apparently unaware they&#39;ve \noverpaid - grossly, in some cases - at the time of leaving feedback)\n\n2 - People learn they can do it themselves and/or that they are overpaying for a common \nitem easily available via Radio Shack directly (BEFORE they buy on eBay - hindsight is \n20/20, but doesn&#39;t effect product demand so much unless the knowledge comes prior to \npurchase)\n\n3 - Supply exceeds demand (which could be a lot quicker if people were educated)\n\nIf he&#39;s a smart seller, he does not stock pile, but fills orders on demand. And, if he were to \nbe left with any non-selling units, I&#39;m guessing he&#39;d do as others have, and simply return \nthem to Radio Shack... hacked or not. So, no loss in his part there.\n\nYou may have been the first to bring it up on the boards recently, but I (along with others, \nI&#39;m sure) have been watching what&#39;s been going on, on eBay, before it being brought up \nhere. I think I first took note, probably in Nov or Dec of last year, shortly after the hack \ninstructions first went mainstream. Some sellers, not all, made a killing on the old \nversions of the 12-470&#39;s and 12-469&#39;s, not even pre-hacked.\n\nI&#39;ve never had strong feelings about it all one way or another, but have certainly found it to \nbe extremely fascinating as an observer, watching the market. Same with the Panasonic \nDR60&#39;s, which I&#39;ve been monitoring for a couple years now. At the height of the frenzy, \npeople were willing to pay up to a $1,000! These days, a seller is lucky to get $500. And \nI&#39;ve seen many selling in the $200-$300 range. \n\nMargaret\n\n--- In EVP-ITC@yahoogroups.com, Wiliam Clarke &lt;reesclarke_69@...&gt; wrote:\n&gt;\n&gt; But they are long way too long for the ebay discussion. (My personal opinion!) By the \nway I was the one who found that guy selling boxes on ebay, and what are y&#39;all going to \ndo about him or not. I&#39;m with Bruce, he will get what is coming to him. I would just leave \nit alone, and everybody will find out that they got ripped off. Then their he will be with a \nbunch of hacked radios, and no customers (I&#39;m not trying to piss anybody off just telling \nwhat I think!) \n&gt; \n&gt; itcdeadpeople &lt;ITCdeadpeople@...&gt; wrote: No Rees, we were not talking about \npeople that answer in lengthy post. It is just a \n&gt; continuation of the eBay/shack hack discussion. :-)\n&gt; \n\n\n\n                           \n\n       \n---------------------------------\nYou rock. That&#39;s why Blockbuster&#39;s offering you one month of Blockbuster Total Access, No Cost.\r\n--0-503282496-1207682188=:85109\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nOK thanks for the info&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;itcdeadpeople &lt;ITCdeadpeople@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;div&gt;Hi Rees. Customer feedback suggests those who have bought these units are happy, and &lt;BR&gt;therefore, business will continue as usual until:&lt;BR&gt;&lt;BR&gt;1 - Negative feedback is left &lt;BR&gt;(which isn&#39;t likely, because the units do work, and people are apparently unaware they&#39;ve &lt;BR&gt;overpaid - grossly, in some cases - at the time of leaving feedback)&lt;BR&gt;&lt;BR&gt;2 - People learn they can do it themselves and/or that they are overpaying for a common &lt;BR&gt;item easily available via Radio\n Shack directly (BEFORE they buy on eBay - hindsight is &lt;BR&gt;20/20, but doesn&#39;t effect product demand so much unless the knowledge comes prior to &lt;BR&gt;purchase)&lt;BR&gt;&lt;BR&gt;3 - Supply exceeds demand (which could be a lot quicker if people were educated)&lt;BR&gt;&lt;BR&gt;If he&#39;s a smart seller, he does not stock pile, but fills orders on demand. And, if he were to &lt;BR&gt;be left with any non-selling units, I&#39;m guessing he&#39;d do as others have, and simply return &lt;BR&gt;them to Radio Shack... hacked or not. So, no loss in his part there.&lt;BR&gt;&lt;BR&gt;You may have been the first to bring it up on the boards recently, but I (along with others, &lt;BR&gt;I&#39;m sure) have been watching what&#39;s been going on, on eBay, before it being brought up &lt;BR&gt;here. I think I first took note, probably in Nov or Dec of last year, shortly after the hack &lt;BR&gt;instructions first went mainstream. Some sellers, not all, made a killing on the old &lt;BR&gt;versions of the 12-470&#39;s and 12-469&#39;s, not even pre-hacked.&lt;BR&gt;&lt;BR&gt;I&#39;ve never had strong\n feelings about it all one way or another, but have certainly found it to &lt;BR&gt;be extremely fascinating as an observer, watching the market. Same with the Panasonic &lt;BR&gt;DR60&#39;s, which I&#39;ve been monitoring for a couple years now. At the height of the frenzy, &lt;BR&gt;people were willing to pay up to a $1,000! These days, a seller is lucky to get $500. And &lt;BR&gt;I&#39;ve seen many selling in the $200-$300 range. &lt;BR&gt;&lt;BR&gt;Margaret&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;, Wiliam Clarke &lt;reesclarke_&lt;WBR&gt;69@...&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; But they are long way too long for the ebay discussion. (My personal opinion!) By the &lt;BR&gt;way I was the one who found that guy selling boxes on ebay, and what are y&#39;all going to &lt;BR&gt;do about him or not. I&#39;m with Bruce, he will get what is coming to him. I would just leave &lt;BR&gt;it alone, and everybody will find out that they got ripped off. Then their he will be with a &lt;BR&gt;bunch of hacked radios, and no\n customers (I&#39;m not trying to piss anybody off just telling &lt;BR&gt;what I think!) &lt;BR&gt;&gt; &lt;BR&gt;&gt; itcdeadpeople &lt;ITCdeadpeople@&lt;WBR&gt;...&gt; wrote: No Rees, we were not talking about &lt;BR&gt;people that answer in lengthy post. It is just a &lt;BR&gt;&gt; continuation of the eBay/shack hack discussion. :-)&lt;BR&gt;&gt; &lt;BR&gt;&lt;BR&gt;&lt;/div&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;p&gt;&#32;\n\n      &lt;hr size=1&gt;You rock. That&#39;s why Blockbuster&#39;s offering you &lt;a href=&quot;http://us.rd.yahoo.com/evt=47523/*http://tc.deals.yahoo.com/tc/blockbuster/text5.com&quot;&gt;one month of Blockbuster Total Access&lt;/a&gt;, No Cost.\r\n--0-503282496-1207682188=:85109--"}