{"id": "921", "subject": "Re: learning from UFO hunters!?", "author": "Staten Island Paranormal", "timestamp": "2007-03-27T14:31:28Z", "full_text": "I have to admit that when I was telling someone that you didn&#39;t want \nto be involved in the &quot;Ghost Hunting aspect of paranormal research&quot; \nit seemed odd to me to be saying that.   There are many of us who are \ninto investigating the paranormal for the same reasons as you, the \nneed to know more, not for the thrill of it.  I think what you really \nmean is that you don&#39;t wish to associate with thrill seekers.  \n\nI can also understand your not wanting to use the box for personal \nreadings.  I know the box was used at the convention in GA for people \nto contact loved ones.  Of course we&#39;d all like to speak with our \nloved ones, but I understand your feelings.  \n\nWhen we used it here in NY, we were speaking with people who were \ntelling us about the location we were at, things we didn&#39;t know and \nconfirming things that the director thought, but didn&#39;t have proof \nof.  I do agree though that you don&#39;t have to be at a supposed \nhaunted place to get the same information!\n\nI&#39;m sorry to hear that you won&#39;t work with HTM anymore, but I \nunderstand and respect that decision!\n\nAmy\nSI Paranormal\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;Frank Sumption&quot; &lt;franks-boxes@...&gt; \nwrote:\n&gt;\n&gt; I was watching a thing on History about the various UFO Hunters, \nand how \n&gt; they go about digging for the evidence, and the various &quot;jobs&quot; each \ndoes. It \n&gt; occured to me that I ghost hunter was exactly the same, and I \nshould be alot \n&gt; more tolerant of theses other elevel of investigation. Anyone that \nhas known \n&gt; me for  awhile probably knows I can be dense!\n&gt; \n&gt; Frank\n&gt; \n&gt; _________________________________________________________________\n&gt; The average US Credit Score is 675. The cost to see yours: $0 by \nExperian. \n&gt; http://www.freecreditreport.com/pm/default.aspx?\nsc=660600&bcd=EMAILFOOTERAVERAGE\n&gt;"}