{"id": "9225", "subject": "Re: Question", "author": "itcdeadpeople", "timestamp": "2008-04-08T23:34:42Z", "full_text": "Hi Jeremy.  Congrats on such great EVP&#39;s!!  It hasn&#39;t happened often, but I have heard \nlaughing on both my own recordings, and that of others, but nothing there was nothing \nsinister sounding.  And one time, I heard what sound like a kiss.\n\nIf the giggle sound was that of a young girl, maybe she was just tickled to be talking on \nthe recorder?  If you think about it, it&#39;s very common for children to laugh and be silly \nwhile in the physical.  Makes sense they would do that in spirit as well.    :-)\n\nAgain, congrats on getting clear messages so quickly.  At some point, you&#39;ll want to make \nsure others can hear some of them too.  It&#39;s not uncommon for something to be heard \nabsolutely clearly by the person doing the recording but not heard clearly (or even heard \nat all) by others.  I never really know how clear what I have might be until I get feedback \nfrom others.  It&#39;s my opinion that doing EVP work can definitely increase one&#39;s \nclairaudience.  \n\nMargaret\n\n--- In EVP-ITC@yahoogroups.com, &quot;Jeremy Robert Huber&quot; &lt;JeremyRobertHuber@...&gt; \nwrote:\n&gt;\n&gt; Hello Everyone,\n&gt; \n&gt; I am relatively new to this group. I have been studying about ITC\n&gt; research and EVP&#39;s for some time. I started doing EVP&#39;s with my Sony\n&gt; tape recorder about three weeks ago. So far, I have gotten many Class\n&gt; A EVP&#39;s.\n&gt; \n&gt; On Sunday, I did my recording from my bedroom. I am disabled and was\n&gt; in quite a bit of pain that evening. I just listened to the tape a few\n&gt; minutes ago and was astounded. I can hear a good friend of mine, Jean,\n&gt; that passed in 1991, calling my name as clear as a bell. Then someone\n&gt; else, whispers my name loudly into the tape recorder. After that you\n&gt; can hear a young girl giggle. I think it was her that whispered into\n&gt; the tape recorder. \n&gt; \n&gt; I had tears of joy realizing that my good friend is trying to contact me. \n&gt; \n&gt; Has anyone else had Spirits laugh or giggle on an EVP. That part kind\n&gt; of made me nervous.\n&gt; \n&gt; Thanks everyone,\n&gt; \n&gt; Jeremy\n&gt; New York, New York\n&gt;"}