{"id": "9246", "subject": "Re: Question", "author": "itcdeadpeople", "timestamp": "2008-04-09T04:12:27Z", "full_text": "Those are wonderful messages, Jeremy.  Nice that you can share with your wife.  My hubby \nwill listen to mine sometimes, though he really doesn&#39;t have an ear for EVP.  In a way, \nthat&#39;s an advantage because if HE can hear it, I know it must be somewhat clear!  LOL.  \n\nOf course, our beloved animal companions have a good sense of spirits, so your Molly \nwould likely focus in on the presence of anyone there with you.  Aren&#39;t animals the best?!?  \nI have a dog and two cats.  The three of them are the closest of buds... though sometimes \nwe have to remind the dog to be gentle.  At 70lbs, she can get a little too wound up for my \ncomfort when the three of them are roughhousing - though the cats never seem to mind.  \n;-)\n\nMargaret\n\n--- In EVP-ITC@yahoogroups.com, &lt;JeremyRobertHuber@...&gt; wrote:\n&gt;\n&gt; Hello Margaret,\n&gt; \n&gt; Thanks so much for the replies.  (You replied to my previous email and I forgot to thank \nyou. )\n&gt; \n&gt; The first EVP that I received was a fellow saying &quot;Peace&quot;. Before I do an EVP session I \nalways say a prayer and use the quote used in Mark Macy&#39;s book which basically says that \nI would like to communicate with others who would like to see others move closer to God \nin thought, word, and deed. I always add that I would like to communicate with those that \ncome in Light, Love and Peace. He has said &quot;Peace&quot; twice now. LOL.\n&gt; \n&gt; I have my sweet wife listen to all of them also. The second EVP that I got was when I \nasked if there were any Spirits present. A woman, who sounded like she was in the living \nroom said &quot;No, no Spirits.&quot; Then you could hear her walking on our hardwood floors with \nhard soled shoes. I figured maybe she didn&#39;t know she was a Spirit. \n&gt; \n&gt; The laugh wasn&#39;t sinister. It just caught me off of guard. I have a Jack Russell Terrier, \nMolly, and I was playing with her, so it&#39;s possible that the young girl was giggling at Molly \nor as you said maybe because she was on the tape. During this EVP Molly was just a \nstaring at the right of us. I am sure she saw them. \n&gt; \n&gt; Thanks for the input. I deeply appreciate it. \n&gt; \n&gt; Many Blessings All,\n&gt; \n&gt; Jeremy \n&gt; \n&gt; \n&gt; From: itcdeadpeople \n&gt; Sent: Tuesday, April 08, 2008 7:34 PM\n&gt; To: EVP-ITC@yahoogroups.com \n&gt; Subject: [EVP-ITC] Re: Question\n&gt; \n&gt; \n&gt; Hi Jeremy. Congrats on such great EVP&#39;s!! It hasn&#39;t happened often, but I have heard \n&gt; laughing on both my own recordings, and that of others, but nothing there was nothing \n&gt; sinister sounding. And one time, I heard what sound like a kiss.\n&gt; \n&gt; If the giggle sound was that of a young girl, maybe she was just tickled to be talking on \n&gt; the recorder? If you think about it, it&#39;s very common for children to laugh and be silly \n&gt; while in the physical. Makes sense they would do that in spirit as well. :-)\n&gt; \n&gt; Again, congrats on getting clear messages so quickly. At some point, you&#39;ll want to \nmake \n&gt; sure others can hear some of them too. It&#39;s not uncommon for something to be heard \n&gt; absolutely clearly by the person doing the recording but not heard clearly (or even heard \n&gt; at all) by others. I never really know how clear what I have might be until I get feedback \n&gt; from others. It&#39;s my opinion that doing EVP work can definitely increase one&#39;s \n&gt; clairaudience. \n&gt; \n&gt; Margaret\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;Jeremy Robert Huber&quot; &lt;JeremyRobertHuber@&gt; \n&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hello Everyone,\n&gt; &gt; \n&gt; &gt; I am relatively new to this group. I have been studying about ITC\n&gt; &gt; research and EVP&#39;s for some time. I started doing EVP&#39;s with my Sony\n&gt; &gt; tape recorder about three weeks ago. So far, I have gotten many Class\n&gt; &gt; A EVP&#39;s.\n&gt; &gt; \n&gt; &gt; On Sunday, I did my recording from my bedroom. I am disabled and was\n&gt; &gt; in quite a bit of pain that evening. I just listened to the tape a few\n&gt; &gt; minutes ago and was astounded. I can hear a good friend of mine, Jean,\n&gt; &gt; that passed in 1991, calling my name as clear as a bell. Then someone\n&gt; &gt; else, whispers my name loudly into the tape recorder. After that you\n&gt; &gt; can hear a young girl giggle. I think it was her that whispered into\n&gt; &gt; the tape recorder. \n&gt; &gt; \n&gt; &gt; I had tears of joy realizing that my good friend is trying to contact me. \n&gt; &gt; \n&gt; &gt; Has anyone else had Spirits laugh or giggle on an EVP. That part kind\n&gt; &gt; of made me nervous.\n&gt; &gt; \n&gt; &gt; Thanks everyone,\n&gt; &gt; \n&gt; &gt; Jeremy\n&gt; &gt; New York, New York\n&gt; &gt;\n&gt;"}