{"id": "9264", "subject": "Re: [EVP-ITC] Re: &#39;469 availability", "author": "Zack Widup", "timestamp": "2008-04-09T14:25:13Z", "full_text": "I can produce very high-quality boards.  I recently made 8 boards for a \nham radio millimeter-wave project - 47 and 78 GHz mixers. They were etched \non 5-mil thick Duroid 5870. That stuff is like paper. The tolerances at \nthose frequencies is incredibly small. Hopefully they work. They look like \nthey should.\n\nBut run-of-the-mill boards I have no problem with.  I can make boards on \n1/16 inch thick G-10 fiberglass-epoxy board for a couple dollars each. As \nI mentioned, the only drawback is with double-sided boards. I have to use \nfeedthrough wires instead of plated-through holes.\n\nIf you (Frank) have a circuit pattern some time that you&#39;re willing to let \nme try, I can make a few boards and we can see how they work.\n\nZack\n\nOn Wed, 9 Apr 2008, Wiliam Clarke wrote:\n\n&gt; That is some expensive boards, but I&#39;m not really sure.  Hell it might be a deal.  WHat would I know.  I know how to turn on the box and start receving messages, but I&#39;m at the learning stage.  I reading a book on basic electronics.\n&gt;\n&gt;  later\n&gt;\n&gt; William Rees Clarke\n&gt;\n&gt; purplespacefriend &lt;purplealiengirl@...&gt; wrote:\n&gt;          That&#39;s what I&#39;m planning on next week, their mini boards, 3 for $60.\n&gt; I&#39;ve tried to make boards myself, but it&#39;s just one word c-r-a-p-p-y!\n&gt;\n&gt; Frank-S\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, Zack Widup &lt;w9sz@...&gt; wrote:\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; Hi Frank,\n&gt;&gt;\n&gt;&gt; I think you mentioned once before you were thinking about using\n&gt; PCBExpress\n&gt;&gt; to make boards. I could probably make them a lot cheaper than they\n&gt; do.\n&gt;&gt; The only drawback I have is that if they are double-sided boards, I\n&gt; can&#39;t\n&gt;&gt; do plated-through holes and have to use &quot;C&quot; wires for thru-board\n&gt;&gt; connections.\n&gt;&gt;\n&gt;&gt; Zack\n&gt;&gt;\n&gt;&gt; On Tue, 8 Apr 2008, Frank Sumption wrote:\n&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt; I hate to ask for anything. I can afford what I need for myself.\n&gt; What I want to do is make some printed circuit boards that have the\n&gt; sweep, and amplifiers, then I would only have to add whatever tuner I\n&gt; want to use to form a system, and I could make the boards available.\n&gt; I wouldn&#39;t mind putting this stuff together for others, but the\n&gt; requests/demands are so overwhelming, there just isn&#39;t enough time.\n&gt;&gt;&gt;\n&gt;&gt;&gt; Frank-S\n&gt;&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; __________________________________________________\n&gt; Do You Yahoo!?\n&gt; Tired of spam?  Yahoo! Mail has the best spam protection around\n&gt; http://mail.yahoo.com"}