{"id": "9265", "subject": "another lengthy post about ebay in answer to Rhonda", "author": "bruce halliday", "timestamp": "2008-04-09T12:43:55Z", "full_text": "--_8d118729-d4bd-401a-94f1-431cecc56ef5_\r\nContent-Type: text/plain; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n\nRhonda,\n \nEveryone is misunderstanding my point.\nmy whole post was about s=\r\ntopping any furtherance of the negative\nvibrations this issue was already c=\r\nausing and that would have been empowered by \nan attempt to sabotage this i=\r\ndiot on ebay.\n \nI am the first to advocate putting out information on hacki=\r\nng your own box and educating people about our research\nand to be aware of =\r\nthe snake oil salesman that are lurking in the shadows.\n \nMost of the unedu=\r\ncated people that are seeing a box or information about one, right now are =\r\ndoing so mainly because\nof the publicity the box received on the tv show pa=\r\nranormal state. So I believe that when a new individual is begging a \nsearc=\r\nh for knowledge about what is being done with this method, they are not goi=\r\nng to go to ebay first for their initial source \nof information they may vi=\r\nsit ebay after they derive their initial information and decide to get invo=\r\nlved with our work.\nBut I think their first venue for knowledge would be a =\r\ngoogle search, I know that&#39;s what mine was.\n \nAll I was trying to say was t=\r\nhat there are much more suitable places for these individuals to have acces=\r\ns to the information you want to put on ebay, and lets face it, the initial=\r\n reaction to this whole thing was not the concern of the people getting the=\r\n boxes, \nit was to stop the asshole that was selling the boxes. Which actua=\r\nlly &quot;If you cut off the head of the snake&quot; still in all the immediate \nemot=\r\nion was one of anger and subversion of this individual. That in itself brin=\r\ngs negative vibration to the field, it&#39;s the ripple in the pond affect.\n \nA=\r\nlso I believe that people that have decide to start their hunt for a box an=\r\nd wind up at ebay, already have the mindset to buy the box if they see it.\n=\r\nAnd if they see the actual box for sale and then see an advertisement that =\r\nis just that and not the actual box, chances are they will concentrate on t=\r\nhe actual box\nand ignore the advert.\n \nIf we feel as a group that something=\r\n needs to be done, we should try and reach these people before they get to =\r\nebay at all! If we can come up with an education campaign that\nutilizes all=\r\n obvious venues of paranormal information which is the first spot anyone wi=\r\nll look, then count me in 100%\n \nBut as far as launching a campaign against=\r\n this one sad individual under the guise of helping people not get swindled=\r\n, I know for myself and I am being completely truthful with you and myself\n=\r\nmy first motivation would be to stick it to this guy and if I helped some p=\r\neople avoid a bad deal in doing that all the better. So that&#39;s what I meant=\r\n by negativity attached to the box.\n \nLets get the word out to the paranorm=\r\nal community and they will steer the inquiries our way. That&#39;s when we real=\r\nly can help.\n \nBruce\nBruce Halliday \n\n\nTo: EVP-ITC@yahoogroups.comFrom: rho=\r\nndak1973@...: Tue, 8 Apr 2008 10:07:58 -0700Subject: RE: [EVP-ITC=\r\n] Re: another lengthy post about ebay in answer to margaret\n\n\n\n\n\nBruce,\n \nB=\r\nut didnt you say that those boxes that ebay guy was over charging for would=\r\n come with negative energy attached to them?  If that was the case, wouldnt=\r\n we want to prevent them from being spread around?  How can we do that if w=\r\ne &quot;turn the other cheek&quot;?  Not tryin to stir the pot, Im just curious...I t=\r\nhink the post giving free info on hacking your own RS boxes would be better=\r\n than an attack of emails and comments on the guys page and would also be b=\r\netter than doing nothing....\n \nBUT on the otherhand...wouldnt this give tho=\r\nse money hungry people out there a way to overcharge and take from innocent=\r\n people...those kind of people would then turn around and post their hacked=\r\n boxes on ebay and then we would see an outbreak of over charging and innoc=\r\nent people being taken advantage of...hmmm its kinda a catch 22......damned=\r\n if ya do and damned if ya dont!\n \nRhondabruce halliday &lt;paranormalinvestig=\r\nating@...&gt; wrote:\n\n\nMargaret, In my initial reply I voiced my disda=\r\nin for low lives that take advantage of unwary peoplebut did not advocate a=\r\nny action by any researchers on this board. My goal is not just pacifism fo=\r\nr it&#39;s own sake, believe me any of the old timers here can attest to my tem=\r\nper.My concern is for the negative disruption in the energy flow of the com=\r\nmunication.I think that following the example of &quot;turn the other cheek&quot; wil=\r\nl be very well received on the other side and therefore contribute to stren=\r\ngthening the bridge. In the past couple of days I know Kristin has received=\r\n messages about the seven and the circle, these are metaphors for peace, ha=\r\nrmony and cooperation of energies within the communication. It is not the f=\r\nirst time we have received messages with these examples, I personally have =\r\nreceived numerous messages pertaining to circle, circles and the power of s=\r\neven. It has been contemplated in length here more than once. I have, throu=\r\ngh interpretation of communication over a long period of time, come to PERS=\r\nONALLY believe that the urgence of harmony and positive energy is the ferti=\r\nlizer of the growth of our communication with the spirit world. I&#39;m sorry, =\r\nI drifted off the subject at hand, but my reason is relevant to this commen=\r\ntary. Taking any action against this ebay fool will first and foremost serv=\r\ne our ego&#39;s and secondlymay help to provide information to unwary buyers th=\r\nat is contrary to what this thief is putting out. But could that not be acc=\r\nomplished through other venues that would help to educate many more people =\r\nthatare would be box researchers and do not look to ebay as a source for an=\r\n RS hack. But are seeking general knowledge. And Margaret to thine own self=\r\n be true, when this was brought up my first reaction was to figure out a wa=\r\ny to sabotagethis guy&#39;s business venture. After thinking it over and asking=\r\n myself what the first reason for doing that would be. My answerWas, to get=\r\n this asshole that is exploiting something that I hold very dear, and in tu=\r\nrn help to steer unaware buyers away from getting screwed. But still my ini=\r\ntial and primal reason was to inflict some sort of punishment on a person t=\r\nhat I felt was unscrupulous. And I decided that this wasa negative emotion =\r\nand would generate negative energy, no matter how I tried to convince mysel=\r\nf it was in the name of justice. That goes without even mentioning the fact=\r\n that we are not the say all and do all of this research. There are other e=\r\nntities involved that I would think have better influential power than we d=\r\no. If they want it stopped they will find a way to stop it. I know what you=\r\nr going to say, maybe we are the tools they are using to stop this injustic=\r\ne. That may very well be, and if so then that is the way it will play out. =\r\nI think you mistake what I am implying. I am not saying do nothing, quite t=\r\nhe opposite. It is actually our duty to do something. All I&#39;m saying is the=\r\nre are alternative ways to educate unwary possible researchers that would b=\r\ne 100% positive and not entail any type of stone throwing tactics. I have s=\r\naid my piece now at the expense of boring everyone to death. So I will see =\r\nhow this unfolds, and during my daily session will inquire about how our fr=\r\niends feel about it. Bruce\nBruce Halliday \n\n\nTo: EVP-ITC@yahoogroups.comFro=\r\nm: ITCdeadpeople@...: Tue, 8 Apr 2008 01:20:11 +0000Subject: [EVP-I=\r\nTC] Re: My opinion on what should be done about ebay_I know it&#39;s long but p=\r\nlease rea\n\n\nHi Bruce. I don&#39;t see this so much as an assault on anyone, as =\r\nit is simply bringing awareness into a forum (ebay) where it is desperately=\r\n needed. Was it not you who recently stated sellers who take advantage of o=\r\nthers in this way are &quot;no more than thieves without guns&quot; and &quot;should not b=\r\ne patronized no matter the circumstances.&quot; You have characterized them as &quot;=\r\nwolves&quot; and &quot;demons&quot; but now are saying &quot;do nothing.&quot; Which, honestly, I co=\r\nuld understand if my suggestion was coming from a place of vengeance. It is=\r\n not.THIS IS ABOUT EDUCATION FIRST AND FOREMOST, and standing up for those =\r\nwho are, unknowingly, being taken advantage of. The byproduct of providing =\r\nthis education will be allowing consumers to make an informed decision and =\r\nif that hurts the sales of unscrupulous sellers, then so be it. Ann has jus=\r\nt echoed some of my remarks in earlier posts in support of sellers rights t=\r\no take advantage of the market ... that some people may find it&#39;s worth it =\r\nto pay more to someone to receive a previously hacked unit. I would venture=\r\n to guess, this educational information will A) help prevent those who are =\r\ncapable of doing the hack themselves from being duped, and B) force sellers=\r\n who do offer pre-hacked units to do so for a more &#39;reasonable&#39; fee. This i=\r\ns neither spiteful nor aggressive, and it&#39;s certainly not any kind of venge=\r\nance driven on my part. It&#39;s standing up for the uninformed, leveling the p=\r\nlaying field for sellers, and it&#39;s bringing more people the knowledge that =\r\ndoing &#39;box&#39; research is not an exclusive club that only the rich can take p=\r\nart in (and given the pricing on the bids for these units, people are under=\r\n the false assumption that you have a pay a high price to get your hands on=\r\n a limited resource, when that simply is not the case.)I can see nothing bu=\r\nt positive benefits coming from educating people about their options.Margar=\r\net--- In EVP-ITC@yahoogroups.com, &quot;bhali333&quot; &lt;paranormalinvestigating@...&gt; =\r\nwrote:&gt;&gt; &gt; Hi Everyone,&gt; &gt; I have been reading the back and forth posts abo=\r\nut ideas on how to &gt; deal with the individual selling the hacks on ebay for=\r\n inflated &gt; prices.&gt; &gt; I posted my thoughts on that individual yesterday. I=\r\n would now like &gt; to render my opinion as to the subject of what we or anyo=\r\nne can do &gt; about it.&gt; &gt; My suggestion is DO NOTHING! Now before everybody&#39;=\r\ns jaw hits the &gt; floor, hear me out.&gt; &gt; A couple of months ago I would have=\r\n been the one to lead the charge &gt; in the assault on this guy in the name o=\r\nf box justice.&gt; &gt; I can now say with confidence, That is not the way to han=\r\ndle it.&gt; Let me explain why I believe this way. Without going into a lot of=\r\n &gt; detail, I was a tough street kid that grew up on the streets of &gt; Brookl=\r\nyn, I also served my country proudly for six years as a us army &gt; green ber=\r\net, then to a career as a FDNY Fireman whose heart and &gt; health where both =\r\nbroken at 911.&gt; &gt; My point is, I have always lived my life believing that a=\r\nnything I &gt; did not agree with or that did not fit my sense of right and wr=\r\nong&gt; whether it be right or wrong, could be easily solved with aggression &gt;=\r\n of some kind.&gt; &gt; It took a long while and much sole searching and a lot of=\r\n &gt; communication interpretation from our friends on the other side.&gt; But I =\r\nhave come to learn that aggressive action in any form is &gt; detrimental to t=\r\nhe harmony and peace of the whole involved.&gt; &gt; Guy&#39;s like this guy on ebay =\r\ndo not and can not last in the face of &gt; good and well intentioned people t=\r\nhat are here and willing and trying &gt; to get the word of this miraculous re=\r\nsearch and spirit communication &gt; out to as many people as are in need or w=\r\nant of it.&gt; &gt; That is how we can stop people like this bottom feeder. By sp=\r\nreading &gt; the knowledge of this research from one person to the next. Our &gt;=\r\n friends have stated time and time again that any negative energy will &gt; be=\r\n detrimental to the communication and the research, and positive &gt; harmony =\r\nand vibration will serve to strengthen the bridge between our &gt; worlds.&gt; &gt; =\r\nSo even if you are not religious and do not believe in Jesus Christ &gt; as I =\r\ndo, these words ring true no matter what context they come from&gt; this wisdo=\r\nm was spoken by my lord two thousand years ago.&gt; &gt; &quot;do not check the splint=\r\ner in your brothers eye, until you have &gt; checked the plank in your own&quot;&gt; &gt;=\r\n Truthfully, anything we could do to sway this individuals sale of &gt; these =\r\nboxes would be minimal. Negativity and greed always find a &gt; crack to seep =\r\nthrough.&gt; &gt; My suggestion is lets try a little harder to spread the word of=\r\n the &gt; research and educate individuals that are or may become interested, =\r\n&gt; through all the various outlets available to us on the web concerning &gt; t=\r\nhe paranormal research community. There are endless chat boards, &gt; groups a=\r\nnd forums plus websites and word of mouth. &gt; Instead of trying to stop this=\r\n idiot from defrauding innocent &gt; unknowledgable people. Lets make sure the=\r\n knowledge is out there for &gt; them and we are here to help them and guy&#39;s l=\r\nike Mr. ebay will &gt; disappear on their own.&gt; &gt; And we will not have expende=\r\nd an ounce of negative energy in the &gt; process.&gt; That&#39;s how I feel, but tha=\r\nt&#39;s just me.&gt; &gt; Bruce&gt;\n\nGoing green? See the top 12 foods to eat organic. \n=\r\n\n\n\nYou rock. That&#39;s why Blockbuster&#39;s offering you one month of Blockbuster=\r\n Total Access, No Cost. \n \n\n\n\n\n\n\n__________________________________________=\r\n_______________________\nGet in touch in an instant. Get Windows Live Messen=\r\nger now.\nhttp://www.windowslive.com/messenger/overview.html?ocid=3DTXT_TAGL=\r\nM_WL_Refresh_getintouch_042008\r\n--_8d118729-d4bd-401a-94f1-431cecc56ef5_\r\nContent-Type: text/html; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;\n&lt;head&gt;\n&lt;style&gt;\n.hmmessage P\n{\nmargin:0px;\npadding:0px\n}\nbody.hmmessa=\r\nge\n{\nFONT-SIZE: 10pt;\nFONT-FAMILY:Tahoma\n}\n&lt;/style&gt;\n&lt;/head&gt;\n&lt;body class=3D&#39;=\r\nhmmessage&#39;&gt;\nRhonda,&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nEveryone is misunderstanding my point.&lt;B=\r\nR&gt;\nmy whole post was about stopping any furtherance of the negative&lt;BR&gt;\nvib=\r\nrations this issue was already causing and that would have been empowered b=\r\ny &lt;BR&gt;\nan attempt to sabotage this idiot on ebay.&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nI am the f=\r\nirst to advocate putting out information on hacking your own box and educat=\r\ning people about our research&lt;BR&gt;\nand to be aware of the snake oil salesman=\r\n&nbsp;that are lurking in the shadows.&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nMost of the uneducate=\r\nd people that are seeing a box or information about one, right now are doin=\r\ng so mainly because&lt;BR&gt;\nof the publicity the box received on the tv show pa=\r\nranormal state. So I believe that when a new individual is begging a &lt;BR&gt;\ns=\r\nearch for knowledge about what is being done with this method, they are not=\r\n going to go to ebay first for their initial source &lt;BR&gt;\nof information the=\r\ny may visit ebay after they derive their initial information and decide to =\r\nget involved with our work.&lt;BR&gt;\nBut I think their first venue for knowledge=\r\n would be a google search, I know that&#39;s what mine was.&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nAll =\r\nI was trying to say was that there are much more suitable places for these =\r\nindividuals to have access to the information &lt;BR&gt;you want to put on ebay, =\r\nand lets face it, the initial reaction to this whole thing was not the conc=\r\nern of the people getting the boxes, &lt;BR&gt;\nit was to stop the asshole that w=\r\nas selling the boxes. Which actually &quot;If you cut off the head of the snake&quot;=\r\n still in all the immediate &lt;BR&gt;\nemotion was one of anger and subversion of=\r\n this individual. That in itself brings negative vibration to the field, it=\r\n&#39;s the ripple in the pond affect.&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nAlso I believe that people=\r\n that have decide to start their hunt for a box and wind up at ebay, alread=\r\ny have the mindset to buy the box if they see it.&lt;BR&gt;\nAnd if they see the a=\r\nctual box for sale and then see an advertisement that is just that and not =\r\nthe actual box, chances are they will concentrate on the actual box&lt;BR&gt;\nand=\r\n ignore the advert.&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nIf we feel as a group that something nee=\r\nds to be done, we should try and reach these people before they get to ebay=\r\n at all! If we can come up with an education campaign that&lt;BR&gt;\nutilizes all=\r\n obvious venues of paranormal information which is the first spot anyone wi=\r\nll look, then count me in 100%&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nBut as far as launching a cam=\r\npaign against this one sad individual under the guise of helping people not=\r\n get swindled, I know for myself and I am being completely truthful with yo=\r\nu and myself&lt;BR&gt;\nmy first motivation would be to stick it to this guy and i=\r\nf I helped some people avoid a bad deal in doing that all the better. So th=\r\nat&#39;s what I meant by negativity attached to the box.&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nLets ge=\r\nt the word out to the paranormal community and they will steer the inquirie=\r\ns our way. That&#39;s when we really can help.&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nBruce&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;=\r\n\n&lt;P align=3Dcenter&gt;&lt;FONT size=3D4&gt;&lt;FONT color=3D#0033cc&gt;&lt;STRONG&gt;&lt;EM&gt;&lt;FONT c=\r\nolor=3D#000000 size=3D5&gt;Bruce Halliday &lt;BR&gt;&lt;/FONT&gt;&lt;/EM&gt;&lt;/STRONG&gt;&lt;BR&gt;&lt;A href=\r\n=3D&quot;http://free-paranormalinvestigating.com/%3C/div%3E%3C/div%3E%3Cp%20/%3E=\r\n%3Cdiv%20class=3D&quot; target=3D_blank&gt;&lt;/P&gt;&lt;/A&gt;&lt;/FONT&gt;&lt;/FONT&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;BLOCKQUO=\r\nTE&gt;\n&lt;HR&gt;\nTo: EVP-ITC@yahoogroups.com&lt;BR&gt;From: rhondak1973@...&lt;BR&gt;Date=\r\n: Tue, 8 Apr 2008 10:07:58 -0700&lt;BR&gt;Subject: RE: [EVP-ITC] Re: another leng=\r\nthy post about ebay in answer to margaret&lt;BR&gt;&lt;BR&gt;\n&lt;META content=3D&quot;Microsof=\r\nt SafeHTML&quot; name=3DGenerator&gt;\n&lt;DIV id=3DEC_ygrp-mlmsg style=3D&quot;WIDTH: 655px=\r\n&quot;&gt;\n&lt;DIV id=3DEC_ygrp-msg style=3D&quot;PADDING-RIGHT: 25px; PADDING-LEFT: 0px; Z=\r\n-INDEX: 1; FLOAT: left; PADDING-BOTTOM: 0px; WIDTH: 470px; PADDING-TOP: 0px=\r\n&quot;&gt;\n&lt;DIV id=3DEC_ygrp-text&gt;\n\n&lt;DIV&gt;Bruce,&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;But di=\r\ndnt you say that those boxes that ebay guy was over charging for would come=\r\n with negative energy attached to them?&nbsp; If that was the case, wouldnt=\r\n we want to prevent them from being spread around?&nbsp; How can we do that=\r\n if we &quot;turn the other cheek&quot;?&nbsp; Not tryin to stir the pot, Im just cur=\r\nious...I think the post giving free info on hacking your own RS boxes would=\r\n be better than an attack of emails and comments on the guys page and would=\r\n also be better than doing nothing....&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;STRONG=\r\n&gt;BUT&lt;/STRONG&gt; on the otherhand...&lt;WBR&gt;wouldnt this give those money hungry =\r\npeople out there a way to overcharge and take&nbsp;from innocent people...t=\r\nhose kind of people would then turn around and post their hacked boxes on e=\r\nbay and then we would see an outbreak of over charging and innocent people =\r\nbeing taken advantage of...hmmm its kinda a catch 22......damned if ya do a=\r\nnd damned if ya dont!&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Rhonda&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;bruc=\r\ne halliday &lt;paranormalinvestiga&lt;WBR&gt;ting@hotmail.&lt;WBR&gt;com&gt;&lt;/I&gt;&lt;/B&gt; wr=\r\note:&lt;/DIV&gt;\n&lt;BLOCKQUOTE class=3DEC_replbq style=3D&quot;BORDER-LEFT: #1010ff 2px =\r\nsolid&quot;&gt;\n&lt;DIV id=3DEC_ygrp-text&gt;\n&lt;DIV&gt;Margaret,&lt;BR&gt;&nbsp;&lt;BR&gt;In my initial r=\r\neply I voiced my disdain for low lives that take advantage of unwary people=\r\n&lt;BR&gt;but did not advocate any action by any researchers on this board.&lt;BR&gt;&n=\r\nbsp;&lt;BR&gt;My goal is not just pacifism for it&#39;s own sake, believe me any of t=\r\nhe old timers here can attest to my temper.&lt;BR&gt;My concern is for the negati=\r\nve disruption in the energy flow of the communication.&lt;BR&gt;I think that foll=\r\nowing the example of &quot;turn the other cheek&quot; will be very well received on t=\r\nhe other side and therefore &lt;BR&gt;contribute to strengthening the bridge.&lt;BR&gt;=\r\n&nbsp;&lt;BR&gt;In the past couple of days I know Kristin has received messages a=\r\nbout the seven and the circle, &lt;BR&gt;these are metaphors for peace, harmony a=\r\nnd cooperation of energies within the communication.&lt;BR&gt;&nbsp;&lt;BR&gt;It is not=\r\n the first time we have received messages with these examples, I personally=\r\n have received numerous &lt;BR&gt;messages pertaining to circle, circles and the =\r\npower of seven. It has been contemplated in length here more than once.&lt;BR&gt;=\r\n&nbsp;&lt;BR&gt;I have, through interpretation of communication over a long perio=\r\nd of time, come to PERSONALLY believe that the urgence of &lt;BR&gt;harmony and p=\r\nositive energy is the fertilizer of the growth of our communication with th=\r\ne spirit world.&lt;BR&gt;&nbsp;&lt;BR&gt;I&#39;m sorry, I drifted off the subject at hand, =\r\nbut my reason is relevant to this commentary. &lt;BR&gt;Taking any action against=\r\n this ebay fool will first and foremost serve our ego&#39;s and secondly&lt;BR&gt;may=\r\n help to provide information to unwary buyers that is contrary to what this=\r\n thief is putting out.&lt;BR&gt;&nbsp;&lt;BR&gt;But could that not be accomplished thro=\r\nugh other venues that would help to educate many more people that&lt;BR&gt;are wo=\r\nuld be box researchers and do not look to ebay as a source for an RS hack. =\r\nBut are seeking general knowledge.&lt;BR&gt;&nbsp;&lt;BR&gt;And Margaret to thine own s=\r\nelf be true, when this was brought up my first reaction was to figure out a=\r\n way to sabotage&lt;BR&gt;this guy&#39;s business venture. After thinking it over and=\r\n asking myself what the first reason for doing that would be. My answer&lt;BR&gt;=\r\nWas, to get this asshole that is exploiting something that I hold very dear=\r\n, and in turn help to steer unaware buyers away from getting screwed.&lt;BR&gt;&n=\r\nbsp;&lt;BR&gt;But still my initial and primal reason was to inflict some sort of =\r\npunishment on a person that I felt was unscrupulous. And I decided that thi=\r\ns was&lt;BR&gt;a negative emotion and would generate negative energy, no matter h=\r\now I tried to convince myself it was in the name of justice.&lt;BR&gt;&nbsp;&lt;BR&gt;T=\r\nhat goes without even mentioning the fact that we are not the say all and d=\r\no all of this research. There are other entities involved that I would thin=\r\nk &lt;BR&gt;have better influential power than we do. If they want it stopped the=\r\ny will find a way to stop it. I know what your going to say, maybe we are t=\r\nhe &lt;BR&gt;tools they are using to stop this injustice. That may very well be, =\r\nand if so then that is the way it will play out.&lt;BR&gt;&nbsp;&lt;BR&gt;I think you m=\r\nistake what I am implying. I am not saying do nothing, quite the opposite. =\r\nIt is actually our duty to do something. All I&#39;m saying is there &lt;BR&gt;are al=\r\nternative ways to educate unwary possible researchers that would be 100% po=\r\nsitive and not entail any type of stone throwing tactics.&lt;BR&gt;&nbsp;&lt;BR&gt;I ha=\r\nve said my piece now at the expense of boring everyone to death. So I will =\r\nsee how this unfolds, and during my daily session will inquire about how ou=\r\nr friends feel about it.&lt;BR&gt;&nbsp;&lt;BR&gt;Bruce&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;DIV align=3Dcenter=\r\n&gt;&lt;FONT size=3D4&gt;&lt;FONT color=3D#0033cc&gt;&lt;STRONG&gt;&lt;EM&gt;&lt;FONT color=3D#000000 siz=\r\ne=3D5&gt;Bruce Halliday &lt;BR&gt;&lt;/FONT&gt;&lt;/EM&gt;&lt;/STRONG&gt;&lt;BR&gt;&lt;A href=3D&quot;http://free-pa=\r\nranormalinvestigating.com/%3C/div%3E%3C/div%3E%3Cp%20/%3E%3Cdiv%20class=3D&quot;=\r\n target=3D_blank&gt;&lt;/FONT&gt;&lt;/FONT&gt;&lt;/DIV&gt;&lt;/A&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;BLOCKQUOTE&gt;\n&lt;HR&gt;\nTo: EVP=\r\n-ITC@yahoogroups&lt;WBR&gt;.com&lt;BR&gt;From: ITCdeadpeople@&lt;WBR&gt;aol.com&lt;BR&gt;Date: Tue,=\r\n 8 Apr 2008 01:20:11 +0000&lt;BR&gt;Subject: [EVP-ITC] Re: My opinion on what sho=\r\nuld be done about ebay_I know it&#39;s long but please rea&lt;BR&gt;&lt;BR&gt;\n&lt;DIV id=3DEC=\r\n_EC_ygrp-mlmsg&gt;\n&lt;DIV id=3DEC_EC_ygrp-msg&gt;\n&lt;DIV id=3DEC_EC_ygrp-text&gt;Hi Bruc=\r\ne. I don&#39;t see this so much as an assault on anyone, as it is simply bringi=\r\nng &lt;BR&gt;awareness into a forum (ebay) where it is desperately needed. &lt;BR&gt;&lt;B=\r\nR&gt;Was it not you who recently stated sellers who take advantage of others i=\r\nn this way are &quot;no &lt;BR&gt;more than thieves without guns&quot; and &quot;should not be p=\r\natronized no matter the &lt;BR&gt;circumstances.&lt;WBR&gt;&quot; You have characterized the=\r\nm as &quot;wolves&quot; and &quot;demons&quot; but now are &lt;BR&gt;saying &quot;do nothing.&quot; Which, hone=\r\nstly, I could understand if my suggestion was coming &lt;BR&gt;from a place of ve=\r\nngeance. It is not.&lt;BR&gt;&lt;BR&gt;THIS IS ABOUT EDUCATION FIRST AND FOREMOST, and =\r\nstanding up for those who are, &lt;BR&gt;unknowingly, being taken advantage of. T=\r\nhe byproduct of providing this education will be &lt;BR&gt;allowing consumers to =\r\nmake an informed decision and if that hurts the sales of &lt;BR&gt;unscrupulous s=\r\nellers, then so be it. &lt;BR&gt;&lt;BR&gt;Ann has just echoed some of my remarks in ea=\r\nrlier posts in support of sellers rights to &lt;BR&gt;take advantage of the marke=\r\nt ... that some people may find it&#39;s worth it to pay more to &lt;BR&gt;someone to=\r\n receive a previously hacked unit. &lt;BR&gt;&lt;BR&gt;I would venture to guess, this e=\r\nducational information will A) help prevent those who are &lt;BR&gt;capable of do=\r\ning the hack themselves from being duped, and B) force sellers who do offer=\r\n &lt;BR&gt;pre-hacked units to do so for a more &#39;reasonable&#39; fee. &lt;BR&gt;&lt;BR&gt;This is=\r\n neither spiteful nor aggressive, and it&#39;s certainly not any kind of vengea=\r\nnce driven &lt;BR&gt;on my part. It&#39;s standing up for the uninformed, leveling th=\r\ne playing field for sellers, and &lt;BR&gt;it&#39;s bringing more people the knowledg=\r\ne that doing &#39;box&#39; research is not an exclusive club &lt;BR&gt;that only the rich=\r\n can take part in (and given the pricing on the bids for these units, &lt;BR&gt;p=\r\neople are under the false assumption that you have a pay a high price to ge=\r\nt your hands &lt;BR&gt;on a limited resource, when that simply is not the case.)&lt;=\r\nBR&gt;&lt;BR&gt;I can see nothing but positive benefits coming from educating people=\r\n about their options.&lt;BR&gt;&lt;BR&gt;Margaret&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=3D&quot;mailto:EVP-I=\r\nTC@yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;, &quot;bhali333&quot; &lt;parano=\r\nrmalinvestig&lt;WBR&gt;ating@...&lt;WBR&gt;&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; &lt;BR&gt;&gt; Hi Ever=\r\nyone,&lt;BR&gt;&gt; &lt;BR&gt;&gt; I have been reading the back and forth posts about i=\r\ndeas on how to &lt;BR&gt;&gt; deal with the individual selling the hacks on ebay =\r\nfor inflated &lt;BR&gt;&gt; prices.&lt;BR&gt;&gt; &lt;BR&gt;&gt; I posted my thoughts on that=\r\n individual yesterday. I would now like &lt;BR&gt;&gt; to render my opinion as to=\r\n the subject of what we or anyone can do &lt;BR&gt;&gt; about it.&lt;BR&gt;&gt; &lt;BR&gt;&gt=\r\n; My suggestion is DO NOTHING! Now before everybody&#39;s jaw hits the &lt;BR&gt;&gt;=\r\n floor, hear me out.&lt;BR&gt;&gt; &lt;BR&gt;&gt; A couple of months ago I would have b=\r\neen the one to lead the charge &lt;BR&gt;&gt; in the assault on this guy in the n=\r\name of box justice.&lt;BR&gt;&gt; &lt;BR&gt;&gt; I can now say with confidence, That is=\r\n not the way to handle it.&lt;BR&gt;&gt; Let me explain why I believe this way. W=\r\nithout going into a lot of &lt;BR&gt;&gt; detail, I was a tough street kid that g=\r\nrew up on the streets of &lt;BR&gt;&gt; Brooklyn, I also served my country proudl=\r\ny for six years as a us army &lt;BR&gt;&gt; green beret, then to a career as a FD=\r\nNY Fireman whose heart and &lt;BR&gt;&gt; health where both broken at 911.&lt;BR&gt;&gt=\r\n; &lt;BR&gt;&gt; My point is, I have always lived my life believing that anything=\r\n I &lt;BR&gt;&gt; did not agree with or that did not fit my sense of right and wr=\r\nong&lt;BR&gt;&gt; whether it be right or wrong, could be easily solved with aggre=\r\nssion &lt;BR&gt;&gt; of some kind.&lt;BR&gt;&gt; &lt;BR&gt;&gt; It took a long while and much=\r\n sole searching and a lot of &lt;BR&gt;&gt; communication interpretation from our=\r\n friends on the other side.&lt;BR&gt;&gt; But I have come to learn that aggressiv=\r\ne action in any form is &lt;BR&gt;&gt; detrimental to the harmony and peace of th=\r\ne whole involved.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Guy&#39;s like this guy on ebay do not and c=\r\nan not last in the face of &lt;BR&gt;&gt; good and well intentioned people that a=\r\nre here and willing and trying &lt;BR&gt;&gt; to get the word of this miraculous =\r\nresearch and spirit communication &lt;BR&gt;&gt; out to as many people as are in =\r\nneed or want of it.&lt;BR&gt;&gt; &lt;BR&gt;&gt; That is how we can stop people like th=\r\nis bottom feeder. By spreading &lt;BR&gt;&gt; the knowledge of this research from=\r\n one person to the next. Our &lt;BR&gt;&gt; friends have stated time and time aga=\r\nin that any negative energy will &lt;BR&gt;&gt; be detrimental to the communicati=\r\non and the research, and positive &lt;BR&gt;&gt; harmony and vibration will serve=\r\n to strengthen the bridge between our &lt;BR&gt;&gt; worlds.&lt;BR&gt;&gt; &lt;BR&gt;&gt; So =\r\neven if you are not religious and do not believe in Jesus Christ &lt;BR&gt;&gt; a=\r\ns I do, these words ring true no matter what context they come from&lt;BR&gt;&gt;=\r\n this wisdom was spoken by my lord two thousand years ago.&lt;BR&gt;&gt; &lt;BR&gt;&gt;=\r\n &quot;do not check the splinter in your brothers eye, until you have &lt;BR&gt;&gt; c=\r\nhecked the plank in your own&quot;&lt;BR&gt;&gt; &lt;BR&gt;&gt; Truthfully, anything we coul=\r\nd do to sway this individuals sale of &lt;BR&gt;&gt; these boxes would be minimal=\r\n. Negativity and greed always find a &lt;BR&gt;&gt; crack to seep through.&lt;BR&gt;&gt=\r\n; &lt;BR&gt;&gt; My suggestion is lets try a little harder to spread the word of =\r\nthe &lt;BR&gt;&gt; research and educate individuals that are or may become intere=\r\nsted, &lt;BR&gt;&gt; through all the various outlets available to us on the web c=\r\noncerning &lt;BR&gt;&gt; the paranormal research community. There are endless cha=\r\nt boards, &lt;BR&gt;&gt; groups and forums plus websites and word of mouth. &lt;BR&gt;&=\r\ngt; Instead of trying to stop this idiot from defrauding innocent &lt;BR&gt;&gt; =\r\nunknowledgable people. Lets make sure the knowledge is out there for &lt;BR&gt;&g=\r\nt; them and we are here to help them and guy&#39;s like Mr. ebay will &lt;BR&gt;&gt; =\r\ndisappear on their own.&lt;BR&gt;&gt; &lt;BR&gt;&gt; And we will not have expended an o=\r\nunce of negative energy in the &lt;BR&gt;&gt; process.&lt;BR&gt;&gt; That&#39;s how I feel,=\r\n but that&#39;s just me.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Bruce&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;SPAN =\r\nstyle=3D&quot;COLOR: white&quot;&gt;&lt;/SPAN&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;\n&lt;HR&gt;\nGoing gree=\r\nn? &lt;A href=3D&quot;http://green.msn.com/galleries/photos/photos.aspx?gid=3D164&a=\r\nmp;ocid=3DT003MSN51N1653A&quot; target=3D_blank&gt;See the top 12 foods to eat orga=\r\nnic.&lt;/A&gt; \n&lt;DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;\n&lt;P&gt;\n&lt;HR SIZE=3D1&gt;\nYou ro=\r\nck. That&#39;s why Blockbuster&#39;&lt;WBR&gt;s offering you &lt;A href=3D&quot;http://us.rd.yaho=\r\no.com/evt=3D47523/*http://tc.deals.yahoo.com/tc/blockbuster/text5.com&quot; targ=\r\net=3D_blank&gt;one month of Blockbuster Total Access&lt;/A&gt;, No Cost. \n&lt;P&gt;&lt;BR&gt;&lt;/D=\r\nIV&gt;&lt;SPAN style=3D&quot;COLOR: white&quot;&gt;&lt;/SPAN&gt; \n&lt;STYLE&gt;\n.ExternalClass #EC_ygrp-mk=\r\np\n{border:1px solid #d8d8d8;font-family:Arial;padding:0px 14px;}\n.ExternalC=\r\nlass #EC_ygrp-mkp hr\n{border:1px solid #d8d8d8;}\n.ExternalClass #EC_ygrp-mk=\r\np #EC_hd\n{color:#628c2a;font-size:85%;font-weight:bold;line-height:122%;}\n.=\r\nExternalClass #EC_ygrp-mkp #EC_ads\n{margin-bottom:10px;}\n.ExternalClass #EC=\r\n_ygrp-mkp .EC_ad\n{padding:0 0;}\n.ExternalClass #EC_ygrp-mkp .EC_ad a\n{color=\r\n:#0000ff;text-decoration:none;}\n\n&lt;/STYLE&gt;\n\n&lt;STYLE&gt;\n.ExternalClass #EC_ygrp-=\r\nsponsor #EC_ygrp-lc\n{font-family:Arial;}\n.ExternalClass #EC_ygrp-sponsor #E=\r\nC_ygrp-lc #EC_hd\n{font-weight:bold;font-size:78%;line-height:122%;}\n.Extern=\r\nalClass #EC_ygrp-sponsor #EC_ygrp-lc .EC_ad\n{margin-bottom:10px;padding:0 0=\r\n;}\n\n&lt;/STYLE&gt;\n\n&lt;STYLE&gt;\n.ExternalClass #EC_ygrp-mlmsg\n{font-size:13px;font-fa=\r\nmily:arial,helvetica,clean,sans-serif;}\n.ExternalClass #EC_ygrp-mlmsg table=\r\n\n{font-size:inherit;font:100%;}\n.ExternalClass #EC_ygrp-mlmsg select, .Exte=\r\nrnalClass input, .ExternalClass textarea\n{font:99% arial,helvetica,clean,sa=\r\nns-serif;}\n.ExternalClass #EC_ygrp-mlmsg pre, .ExternalClass code\n{font:115=\r\n% monospace;}\n.ExternalClass #EC_ygrp-mlmsg EC_*\n{line-height:1.22em;}\n.Ext=\r\nernalClass #EC_ygrp-text\n{font-family:Georgia;}\n.ExternalClass #EC_ygrp-tex=\r\nt p\n{;}\n.ExternalClass #EC_ygrp-tpmsgs\n{font-family:Arial;clear:both;}\n.Ext=\r\nernalClass #EC_ygrp-vitnav\n{padding-top:10px;font-family:Verdana;font-size:=\r\n77%;}\n.ExternalClass #EC_ygrp-vitnav a\n{padding:0 1px;}\n.ExternalClass #EC_=\r\nygrp-actbar\n{clear:both;white-space:nowrap;color:#666;text-align:right;}\n.E=\r\nxternalClass #EC_ygrp-actbar .EC_left\n{float:left;white-space:nowrap;}\n.Ext=\r\nernalClass .EC_bld\n{font-weight:bold;}\n.ExternalClass #EC_ygrp-grft\n{font-f=\r\namily:Verdana;font-size:77%;padding:15px 0;}\n.ExternalClass #EC_ygrp-ft\n{fo=\r\nnt-family:verdana;font-size:77%;border-top:1px solid #666;padding:5px 0;}\n.=\r\nExternalClass #EC_ygrp-mlmsg #EC_logo\n{padding-bottom:10px;}\n.ExternalClass=\r\n #EC_ygrp-reco\n{margin-bottom:20px;padding:0px;}\n.ExternalClass #EC_ygrp-re=\r\nco #EC_reco-head\n{font-weight:bold;color:#ff7900;}\n.ExternalClass #EC_reco-=\r\ngrpname\n{font-weight:bold;}\n.ExternalClass #EC_reco-category\n{font-size:77%=\r\n;}\n.ExternalClass #EC_reco-desc\n{font-size:77%;}\n.ExternalClass #EC_ygrp-vi=\r\ntal\n{background-color:#e0ecee;margin-bottom:20px;padding:2px 0 8px 8px;}\n.E=\r\nxternalClass #EC_ygrp-vital #EC_vithd\n{font-size:77%;font-family:Verdana;fo=\r\nnt-weight:bold;color:#333;text-transform:uppercase;}\n.ExternalClass #EC_ygr=\r\np-vital ul\n{padding:0;}\n.ExternalClass #EC_ygrp-vital ul li\n{list-style-typ=\r\ne:none;clear:both;border:1px solid #e0ecee;}\n.ExternalClass #EC_ygrp-vital =\r\nul li .EC_ct\n{font-weight:bold;color:#ff7900;float:right;width:2em;text-ali=\r\ngn:right;padding-right:.5em;}\n.ExternalClass #EC_ygrp-vital ul li .EC_cat\n{=\r\nfont-weight:bold;}\n.ExternalClass #EC_ygrp-vital a\n{text-decoration:none;}\n=\r\n.ExternalClass #EC_ygrp-vital a:hover\n{text-decoration:underline;}\n.Externa=\r\nlClass #EC_ygrp-sponsor #EC_hd\n{color:#999;font-size:77%;}\n.ExternalClass #=\r\nEC_ygrp-sponsor #EC_ov\n{padding:6px 13px;background-color:#e0ecee;margin-bo=\r\nttom:20px;}\n.ExternalClass #EC_ygrp-sponsor #EC_ov ul\n{padding:0 0 0 8px;}\n=\r\n.ExternalClass #EC_ygrp-sponsor #EC_ov li\n{list-style-type:square;padding:6=\r\npx 0;font-size:77%;}\n.ExternalClass #EC_ygrp-sponsor #EC_ov li a\n{text-deco=\r\nration:none;font-size:130%;}\n.ExternalClass #EC_ygrp-sponsor #EC_nc\n{backgr=\r\nound-color:#eee;margin-bottom:20px;padding:0 8px;}\n.ExternalClass #EC_ygrp-=\r\nsponsor .EC_ad\n{padding:8px 0;}\n.ExternalClass #EC_ygrp-sponsor .EC_ad #EC_=\r\nhd1\n{font-family:Arial;font-weight:bold;color:#628c2a;font-size:100%;line-h=\r\neight:122%;}\n.ExternalClass #EC_ygrp-sponsor .EC_ad a\n{text-decoration:none=\r\n;}\n.ExternalClass #EC_ygrp-sponsor .EC_ad a:hover\n{text-decoration:underlin=\r\ne;}\n.ExternalClass #EC_ygrp-sponsor .EC_ad p\n{;}\n.ExternalClass EC_o\n{font-=\r\nsize:0;}\n.ExternalClass .EC_MsoNormal\n{;}\n.ExternalClass #EC_ygrp-text tt\n{=\r\nfont-size:120%;}\n.ExternalClass blockquote\n{;}\n.ExternalClass .EC_replbq\n{;=\r\n}\n\n&lt;/STYLE&gt;\n&lt;/BLOCKQUOTE&gt;&lt;br /&gt;&lt;hr /&gt;Get in touch in an instant. &lt;a href=3D=\r\n&#39;http://www.windowslive.com/messenger/overview.html?ocid=3DTXT_TAGLM_WL_Ref=\r\nresh_getintouch_042008&#39; target=3D&#39;_new&#39;&gt;Get Windows Live Messenger now.&lt;/a&gt;=\r\n&lt;/body&gt;\n&lt;/html&gt;\r\n--_8d118729-d4bd-401a-94f1-431cecc56ef5_--"}