{"id": "9268", "subject": "Re: [EVP-ITC] another lengthy post about ebay in answer to Rhonda", "author": "Lisby", "timestamp": "2008-04-09T16:59:04Z", "full_text": "I completely agree with this, Bruce. I&#39;ve already stated why, but  \nI&#39;ll say again: it&#39;s not your Karma; it may be the only way some  \npeople can get a box; it creates hatred and negativity; your energy  \nis better spent elsewhere.\n\nAsk the people and entities talking to you from your own hacks what  \nthey want you to do. I&#39;ll bet you&#39;ll hear something along the lines  \nof be still and know that all is very well.\n\nAnn\n\nOn Apr 9, 2008, at 8:43 AM, bruce halliday wrote:\n\n&gt; Rhonda,\n&gt;\n&gt; Everyone is misunderstanding my point.\n&gt; my whole post was about stopping any furtherance of the negative\n&gt; vibrations this issue was already causing and that would have been  \n&gt; empowered by\n&gt; an attempt to sabotage this idiot on ebay.\n&gt;\n&gt; I am the first to advocate putting out information on hacking your  \n&gt; own box and educating people about our research\n&gt; and to be aware of the snake oil salesman that are lurking in the  \n&gt; shadows.\n&gt;\n&gt; Most of the uneducated people that are seeing a box or information  \n&gt; about one, right now are doing so mainly because\n&gt; of the publicity the box received on the tv show paranormal state.  \n&gt; So I believe that when a new individual is begging a\n&gt; search for knowledge about what is being done with this method,  \n&gt; they are not going to go to ebay first for their initial source\n&gt; of information they may visit ebay after they derive their initial  \n&gt; information and decide to get involved with our work.\n&gt; But I think their first venue for knowledge would be a google  \n&gt; search, I know that&#39;s what mine was.\n&gt;\n&gt; All I was trying to say was that there are much more suitable  \n&gt; places for these individuals to have access to the information\n&gt; you want to put on ebay, and lets face it, the initial reaction to  \n&gt; this whole thing was not the concern of the people getting the boxes,\n&gt; it was to stop the asshole that was selling the boxes. Which  \n&gt; actually &quot;If you cut off the head of the snake&quot; still in all the  \n&gt; immediate\n&gt; emotion was one of anger and subversion of this individual. That in  \n&gt; itself brings negative vibration to the field, it&#39;s the ripple in  \n&gt; the pond affect.\n&gt;\n&gt; Also I believe that people that have decide to start their hunt for  \n&gt; a box and wind up at ebay, already have the mindset to buy the box  \n&gt; if they see it.\n&gt; And if they see the actual box for sale and then see an  \n&gt; advertisement that is just that and not the actual box, chances are  \n&gt; they will concentrate on the actual box\n&gt; and ignore the advert.\n&gt;\n&gt; If we feel as a group that something needs to be done, we should  \n&gt; try and reach these people before they get to ebay at all! If we  \n&gt; can come up with an education campaign that\n&gt; utilizes all obvious venues of paranormal information which is the  \n&gt; first spot anyone will look, then count me in 100%\n&gt;\n&gt; But as far as launching a campaign against this one sad individual  \n&gt; under the guise of helping people not get swindled, I know for  \n&gt; myself and I am being completely truthful with you and myself\n&gt; my first motivation would be to stick it to this guy and if I  \n&gt; helped some people avoid a bad deal in doing that all the better.  \n&gt; So that&#39;s what I meant by negativity attached to the box.\n&gt;\n&gt; Lets get the word out to the paranormal community and they will  \n&gt; steer the inquiries our way. That&#39;s when we really can help.\n&gt;\n&gt; Bruce\n&gt;\n&gt;\n&gt;\n&gt; Bruce Halliday\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; From: rhondak1973@...\n&gt; Date: Tue, 8 Apr 2008 10:07:58 -0700\n&gt; Subject: RE: [EVP-ITC] Re: another lengthy post about ebay in  \n&gt; answer to margaret\n&gt;\n&gt; Bruce,\n&gt;\n&gt; But didnt you say that those boxes that ebay guy was over charging  \n&gt; for would come with negative energy attached to them?  If that was  \n&gt; the case, wouldnt we want to prevent them from being spread  \n&gt; around?  How can we do that if we &quot;turn the other cheek&quot;?  Not  \n&gt; tryin to stir the pot, Im just curious...I think the post giving  \n&gt; free info on hacking your own RS boxes would be better than an  \n&gt; attack of emails and comments on the guys page and would also be  \n&gt; better than doing nothing....\n&gt;\n&gt; BUT on the otherhand...wouldnt this give those money hungry people  \n&gt; out there a way to overcharge and take from innocent people...those  \n&gt; kind of people would then turn around and post their hacked boxes  \n&gt; on ebay and then we would see an outbreak of over charging and  \n&gt; innocent people being taken advantage of...hmmm its kinda a catch  \n&gt; 22......damned if ya do and damned if ya dont!\n&gt;\n&gt; Rhonda\n&gt;\n&gt; bruce halliday &lt;paranormalinvestigating@...&gt; wrote:\n&gt; Margaret,\n&gt;\n&gt; In my initial reply I voiced my disdain for low lives that take  \n&gt; advantage of unwary people\n&gt; but did not advocate any action by any researchers on this board.\n&gt;\n&gt; My goal is not just pacifism for it&#39;s own sake, believe me any of  \n&gt; the old timers here can attest to my temper.\n&gt; My concern is for the negative disruption in the energy flow of the  \n&gt; communication.\n&gt; I think that following the example of &quot;turn the other cheek&quot; will  \n&gt; be very well received on the other side and therefore\n&gt; contribute to strengthening the bridge.\n&gt;\n&gt; In the past couple of days I know Kristin has received messages  \n&gt; about the seven and the circle,\n&gt; these are metaphors for peace, harmony and cooperation of energies  \n&gt; within the communication.\n&gt;\n&gt; It is not the first time we have received messages with these  \n&gt; examples, I personally have received numerous\n&gt; messages pertaining to circle, circles and the power of seven. It  \n&gt; has been contemplated in length here more than once.\n&gt;\n&gt; I have, through interpretation of communication over a long period  \n&gt; of time, come to PERSONALLY believe that the urgence of\n&gt; harmony and positive energy is the fertilizer of the growth of our  \n&gt; communication with the spirit world.\n&gt;\n&gt; I&#39;m sorry, I drifted off the subject at hand, but my reason is  \n&gt; relevant to this commentary.\n&gt; Taking any action against this ebay fool will first and foremost  \n&gt; serve our ego&#39;s and secondly\n&gt; may help to provide information to unwary buyers that is contrary  \n&gt; to what this thief is putting out.\n&gt;\n&gt; But could that not be accomplished through other venues that would  \n&gt; help to educate many more people that\n&gt; are would be box researchers and do not look to ebay as a source  \n&gt; for an RS hack. But are seeking general knowledge.\n&gt;\n&gt; And Margaret to thine own self be true, when this was brought up my  \n&gt; first reaction was to figure out a way to sabotage\n&gt; this guy&#39;s business venture. After thinking it over and asking  \n&gt; myself what the first reason for doing that would be. My answer\n&gt; Was, to get this asshole that is exploiting something that I hold  \n&gt; very dear, and in turn help to steer unaware buyers away from  \n&gt; getting screwed.\n&gt;\n&gt; But still my initial and primal reason was to inflict some sort of  \n&gt; punishment on a person that I felt was unscrupulous. And I decided  \n&gt; that this was\n&gt; a negative emotion and would generate negative energy, no matter  \n&gt; how I tried to convince myself it was in the name of justice.\n&gt;\n&gt; That goes without even mentioning the fact that we are not the say  \n&gt; all and do all of this research. There are other entities involved  \n&gt; that I would think\n&gt; have better influential power than we do. If they want it stopped  \n&gt; they will find a way to stop it. I know what your going to say,  \n&gt; maybe we are the\n&gt; tools they are using to stop this injustice. That may very well be,  \n&gt; and if so then that is the way it will play out.\n&gt;\n&gt; I think you mistake what I am implying. I am not saying do nothing,  \n&gt; quite the opposite. It is actually our duty to do something. All  \n&gt; I&#39;m saying is there\n&gt; are alternative ways to educate unwary possible researchers that  \n&gt; would be 100% positive and not entail any type of stone throwing  \n&gt; tactics.\n&gt;\n&gt; I have said my piece now at the expense of boring everyone to  \n&gt; death. So I will see how this unfolds, and during my daily session  \n&gt; will inquire about how our friends feel about it.\n&gt;\n&gt; Bruce\n&gt;\n&gt;\n&gt; Bruce Halliday\n&gt;\n&gt;\n&gt;\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; From: ITCdeadpeople@...\n&gt; Date: Tue, 8 Apr 2008 01:20:11 +0000\n&gt; Subject: [EVP-ITC] Re: My opinion on what should be done about  \n&gt; ebay_I know it&#39;s long but please rea\n&gt;\n&gt; Hi Bruce. I don&#39;t see this so much as an assault on anyone, as it  \n&gt; is simply bringing\n&gt; awareness into a forum (ebay) where it is desperately needed.\n&gt;\n&gt; Was it not you who recently stated sellers who take advantage of  \n&gt; others in this way are &quot;no\n&gt; more than thieves without guns&quot; and &quot;should not be patronized no  \n&gt; matter the\n&gt; circumstances.&quot; You have characterized them as &quot;wolves&quot; and  \n&gt; &quot;demons&quot; but now are\n&gt; saying &quot;do nothing.&quot; Which, honestly, I could understand if my  \n&gt; suggestion was coming\n&gt; from a place of vengeance. It is not.\n&gt;\n&gt; THIS IS ABOUT EDUCATION FIRST AND FOREMOST, and standing up for  \n&gt; those who are,\n&gt; unknowingly, being taken advantage of. The byproduct of providing  \n&gt; this education will be\n&gt; allowing consumers to make an informed decision and if that hurts  \n&gt; the sales of\n&gt; unscrupulous sellers, then so be it.\n&gt;\n&gt; Ann has just echoed some of my remarks in earlier posts in support  \n&gt; of sellers rights to\n&gt; take advantage of the market ... that some people may find it&#39;s  \n&gt; worth it to pay more to\n&gt; someone to receive a previously hacked unit.\n&gt;\n&gt; I would venture to guess, this educational information will A) help  \n&gt; prevent those who are\n&gt; capable of doing the hack themselves from being duped, and B) force  \n&gt; sellers who do offer\n&gt; pre-hacked units to do so for a more &#39;reasonable&#39; fee.\n&gt;\n&gt; This is neither spiteful nor aggressive, and it&#39;s certainly not any  \n&gt; kind of vengeance driven\n&gt; on my part. It&#39;s standing up for the uninformed, leveling the  \n&gt; playing field for sellers, and\n&gt; it&#39;s bringing more people the knowledge that doing &#39;box&#39; research  \n&gt; is not an exclusive club\n&gt; that only the rich can take part in (and given the pricing on the  \n&gt; bids for these units,\n&gt; people are under the false assumption that you have a pay a high  \n&gt; price to get your hands\n&gt; on a limited resource, when that simply is not the case.)\n&gt;\n&gt; I can see nothing but positive benefits coming from educating  \n&gt; people about their options.\n&gt;\n&gt; Margaret\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, &quot;bhali333&quot;  \n&gt; &lt;paranormalinvestigating@...&gt; wrote:\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Hi Everyone,\n&gt; &gt;\n&gt; &gt; I have been reading the back and forth posts about ideas on how to\n&gt; &gt; deal with the individual selling the hacks on ebay for inflated\n&gt; &gt; prices.\n&gt; &gt;\n&gt; &gt; I posted my thoughts on that individual yesterday. I would now like\n&gt; &gt; to render my opinion as to the subject of what we or anyone can do\n&gt; &gt; about it.\n&gt; &gt;\n&gt; &gt; My suggestion is DO NOTHING! Now before everybody&#39;s jaw hits the\n&gt; &gt; floor, hear me out.\n&gt; &gt;\n&gt; &gt; A couple of months ago I would have been the one to lead the charge\n&gt; &gt; in the assault on this guy in the name of box justice.\n&gt; &gt;\n&gt; &gt; I can now say with confidence, That is not the way to handle it.\n&gt; &gt; Let me explain why I believe this way. Without going into a lot of\n&gt; &gt; detail, I was a tough street kid that grew up on the streets of\n&gt; &gt; Brooklyn, I also served my country proudly for six years as a us  \n&gt; army\n&gt; &gt; green beret, then to a career as a FDNY Fireman whose heart and\n&gt; &gt; health where both broken at 911.\n&gt; &gt;\n&gt; &gt; My point is, I have always lived my life believing that anything I\n&gt; &gt; did not agree with or that did not fit my sense of right and wrong\n&gt; &gt; whether it be right or wrong, could be easily solved with aggression\n&gt; &gt; of some kind.\n&gt; &gt;\n&gt; &gt; It took a long while and much sole searching and a lot of\n&gt; &gt; communication interpretation from our friends on the other side.\n&gt; &gt; But I have come to learn that aggressive action in any form is\n&gt; &gt; detrimental to the harmony and peace of the whole involved.\n&gt; &gt;\n&gt; &gt; Guy&#39;s like this guy on ebay do not and can not last in the face of\n&gt; &gt; good and well intentioned people that are here and willing and  \n&gt; trying\n&gt; &gt; to get the word of this miraculous research and spirit communication\n&gt; &gt; out to as many people as are in need or want of it.\n&gt; &gt;\n&gt; &gt; That is how we can stop people like this bottom feeder. By spreading\n&gt; &gt; the knowledge of this research from one person to the next. Our\n&gt; &gt; friends have stated time and time again that any negative energy  \n&gt; will\n&gt; &gt; be detrimental to the communication and the research, and positive\n&gt; &gt; harmony and vibration will serve to strengthen the bridge between  \n&gt; our\n&gt; &gt; worlds.\n&gt; &gt;\n&gt; &gt; So even if you are not religious and do not believe in Jesus Christ\n&gt; &gt; as I do, these words ring true no matter what context they come from\n&gt; &gt; this wisdom was spoken by my lord two thousand years ago.\n&gt; &gt;\n&gt; &gt; &quot;do not check the splinter in your brothers eye, until you have\n&gt; &gt; checked the plank in your own&quot;\n&gt; &gt;\n&gt; &gt; Truthfully, anything we could do to sway this individuals sale of\n&gt; &gt; these boxes would be minimal. Negativity and greed always find a\n&gt; &gt; crack to seep through.\n&gt; &gt;\n&gt; &gt; My suggestion is lets try a little harder to spread the word of the\n&gt; &gt; research and educate individuals that are or may become interested,\n&gt; &gt; through all the various outlets available to us on the web  \n&gt; concerning\n&gt; &gt; the paranormal research community. There are endless chat boards,\n&gt; &gt; groups and forums plus websites and word of mouth.\n&gt; &gt; Instead of trying to stop this idiot from defrauding innocent\n&gt; &gt; unknowledgable people. Lets make sure the knowledge is out there for\n&gt; &gt; them and we are here to help them and guy&#39;s like Mr. ebay will\n&gt; &gt; disappear on their own.\n&gt; &gt;\n&gt; &gt; And we will not have expended an ounce of negative energy in the\n&gt; &gt; process.\n&gt; &gt; That&#39;s how I feel, but that&#39;s just me.\n&gt; &gt;\n&gt; &gt; Bruce\n&gt; &gt;\n&gt;\n&gt;\n&gt;\n&gt; Going green? See the top 12 foods to eat organic.\n&gt;\n&gt;\n&gt; You rock. That&#39;s why Blockbuster&#39;s offering you one month of  \n&gt; Blockbuster Total Access, No Cost.\n&gt;\n&gt;\n&gt;\n&gt; Get in touch in an instant. Get Windows Live Messenger now.\n&gt;\n&gt; \n\n\nI comple ely ag ee wi h his, B uce. I' e al eady s a ed why, bu I'll say again: i 's no you Ka ma; i may be he only way some people can ge a box; i c ea es ha ed and nega i i y; you ene gy is be e spen elsewhe e.Ask he people and en i ies alking o you om you own hacks wha hey wan you o do. I'll be you'll hea some hing along he lines o be s ill and know ha all is e y well.AnnOn Ap 9, 2008, a 8:43 AM, b uce halliday w o e:Rhonda, E e yone is misunde s anding my poin .my whole pos was abou s opping any u he ance o he nega i e ib a ions his issue was al eady causing and ha would ha e been empowe ed by an a emp o sabo age his idio on ebay. I am he i s o ad oca e pu ing ou in o ma ion on hacking you own box and educa ing people abou ou esea chand o be awa e o he snake oil salesman  ha a e lu king in he shadows. Mos o he uneduca ed people ha a e seeing a box o in o ma ion abou one, igh now a e doing so mainly becauseo he publici y he box ecei ed on he show pa ano mal s a e. So I belie e ha when a new indi idual is begging a sea ch o knowledge abou wha is being done wi h his me hod, hey a e no going o go o ebay i s o hei ini ial sou ce o in o ma ion hey may isi ebay a e hey de i e hei ini ial in o ma ion and decide o ge in ol ed wi h ou wo k.Bu I hink hei i s enue o knowledge would be a google sea ch, I know ha 's wha mine was. All I was ying o say was ha he e a e much mo e sui able places o hese indi iduals o ha e access o he in o ma ion you wan o pu on ebay, and le s ace i , he ini ial eac ion o his whole hing was no he conce n o he people ge ing he boxes, i was o s op he asshole ha was selling he boxes. Which ac ually \"I you cu o he head o he snake\" s ill in all he immedia e emo ion was one o ange and sub e sion o his indi idual. Tha in i sel b ings nega i e ib a ion o he ield, i 's he ipple in he pond a ec . Also I belie e ha people ha ha e decide o s a hei hun o a box and wind up a ebay, al eady ha e he mindse o buy he box i hey see i .And i hey see he ac ual box o sale and hen see an ad e isemen ha is jus ha and no he ac ual box, chances a e hey will concen a e on he ac ual boxand igno e he ad e . I we eel as a g oup ha some hing needs o be done, we should y and each hese people be o e hey ge o ebay a all! I we can come up wi h an educa ion campaign ha u ilizes all ob ious enues o pa ano mal in o ma ion which is he i s spo anyone will look, hen coun me in 100% Bu as a as launching a campaign agains his one sad indi idual unde he guise o helping people no ge swindled, I know o mysel and I am being comple ely u h ul wi h you and mysel my i s mo i a ion would be o s ick i o his guy and i I helped some people a oid a bad deal in doing ha all he be e . So ha 's wha I mean by nega i i y a ached o he box. Le s ge he wo d ou o he pa ano mal communi y and hey will s ee he inqui ies ou way. Tha 's when we eally can help. B uceB uce Halliday To: EVP-ITC@yahoog oups.comF om: hondak1973@yahoo.comDa e: Tue, 8 Ap 2008 10:07:58 -0700Subjec : RE: [EVP-ITC] Re: ano he leng hy pos abou ebay in answe o ma ga e B uce, Bu didn you say ha hose boxes ha ebay guy was o e cha ging o would come wi h nega i e ene gy a ached o hem?  I ha was he case, wouldn we wan o p e en hem om being sp ead a ound?  How can we do ha i we \" u n he o he cheek\"?  No yin o s i he po , Im jus cu ious...I hink he pos gi ing ee in o on hacking you own RS boxes would be be e han an a ack o emails and commen s on he guys page and would also be be e han doing no hing.... BUT on he o he hand...wouldn his gi e hose money hung y people ou he e a way o o e cha ge and ake  om innocen people... hose kind o people would hen u n a ound and pos hei hacked boxes on ebay and hen we would see an ou b eak o o e cha ging and innocen people being aken ad an age o ...hmmm i s kinda a ca ch 22......damned i ya do and damned i ya don ! Rhondab uce halliday ing@ho mail.com> w o e:Ma ga e , In my ini ial eply I oiced my disdain o low li es ha ake ad an age o unwa y peoplebu did no ad oca e any ac ion by any esea che s on his boa d. My goal is no jus paci ism o i 's own sake, belie e me any o he old ime s he e can a es o my empe .My conce n is o he nega i e dis up ion in he ene gy low o he communica ion.I hink ha ollowing he example o \" u n he o he cheek\" will be e y well ecei ed on he o he side and he e o e con ibu e o s eng hening he b idge. In he pas couple o days I know K is in has ecei ed messages abou he se en and he ci cle,  hese a e me apho s o peace, ha mony and coope a ion o ene gies wi hin he communica ion. I is no he i s ime we ha e ecei ed messages wi h hese examples, I pe sonally ha e ecei ed nume ous messages pe aining o ci cle, ci cles and he powe o se en. I has been con empla ed in leng h he e mo e han once. I ha e, h ough in e p e a ion o communica ion o e a long pe iod o ime, come o PERSONALLY belie e ha he u gence o  ha mony and posi i e ene gy is he e ilize o he g ow h o ou communica ion wi h he spi i wo ld. I'm so y, I d i ed o he subjec a hand, bu my eason is ele an o his commen a y. Taking any ac ion agains his ebay ool will i s and o emos se e ou ego's and secondlymay help o p o ide in o ma ion o unwa y buye s ha is con a y o wha his hie is pu ing ou . Bu could ha no be accomplished h ough o he enues ha would help o educa e many mo e people ha a e would be box esea che s and do no look o ebay as a sou ce o an RS hack. Bu a e seeking gene al knowledge. And Ma ga e o hine own sel be ue, when his was b ough up my i s eac ion was o igu e ou a way o sabo age his guy's business en u e. A e hinking i o e and asking mysel wha he i s eason o doing ha would be. My answe Was, o ge his asshole ha is exploi ing some hing ha I hold e y dea , and in u n help o s ee unawa e buye s away om ge ing sc ewed. Bu s ill my ini ial and p imal eason was o in lic some so o punishmen on a pe son ha I el was unsc upulous. And I decided ha his wasa nega i e emo ion and would gene a e nega i e ene gy, no ma e how I ied o con ince mysel i was in he name o jus ice. Tha goes wi hou e en men ioning he ac ha we a e no he say all and do all o his esea ch. The e a e o he en i ies in ol ed ha I would hink ha e be e in luen ial powe han we do. I hey wan i s opped hey will ind a way o s op i . I know wha you going o say, maybe we a e he  ools hey a e using o s op his injus ice. Tha may e y well be, and i so hen ha is he way i will play ou . I hink you mis ake wha I am implying. I am no saying do no hing, qui e he opposi e. I is ac ually ou du y o do some hing. All I'm saying is he e a e al e na i e ways o educa e unwa y possible esea che s ha would be 100% posi i e and no en ail any ype o s one h owing ac ics. I ha e said my piece now a he expense o bo ing e e yone o dea h. So I will see how his un olds, and du ing my daily session will inqui e abou how ou iends eel abou i . B uceB uce Halliday To: EVP-ITC@yahoog oups.comF om: ITCdeadpeople@aol.comDa e: Tue, 8 Ap 2008 01:20:11 +0000Subjec : [EVP-ITC] Re: My opinion on wha should be done abou ebay_I know i 's long bu please eaHi B uce. I don' see his so much as an assaul on anyone, as i is simply b inging awa eness in o a o um (ebay) whe e i is despe a ely needed. Was i no you who ecen ly s a ed selle s who ake ad an age o o he s in his way a e \"no mo e han hie es wi hou guns\" and \"should no be pa onized no ma e he ci cums ances.\" You ha e cha ac e ized hem as \"wol es\" and \"demons\" bu now a e saying \"do no hing.\" Which, hones ly, I could unde s and i my sugges ion was coming  om a place o engeance. I is no .THIS IS ABOUT EDUCATION FIRST AND FOREMOST, and s anding up o hose who a e, unknowingly, being aken ad an age o . The byp oduc o p o iding his educa ion will be allowing consume s o make an in o med decision and i ha hu s he sales o  unsc upulous selle s, hen so be i . Ann has jus echoed some o my ema ks in ea lie pos s in suppo o selle s igh s o  ake ad an age o he ma ke ... ha some people may ind i 's wo h i o pay mo e o someone o ecei e a p e iously hacked uni . I would en u e o guess, his educa ional in o ma ion will A) help p e en hose who a e capable o doing he hack hemsel es om being duped, and B) o ce selle s who do o e  p e-hacked uni s o do so o a mo e ' easonable' ee. This is nei he spi e ul no agg essi e, and i 's ce ainly no any kind o engeance d i en on my pa . I 's s anding up o he unin o med, le eling he playing ield o selle s, and i 's b inging mo e people he knowledge ha doing 'box' esea ch is no an exclusi e club  ha only he ich can ake pa in (and gi en he p icing on he bids o hese uni s, people a e unde he alse assump ion ha you ha e a pay a high p ice o ge you hands on a limi ed esou ce, when ha simply is no he case.)I can see no hing bu posi i e bene i s coming om educa ing people abou hei op ions.Ma ga e --- In EVP-ITC@yahoog oups.com, \"bhali333\" a ing@...> w o e:>> > Hi E e yone,> > I ha e been eading he back and o h pos s abou ideas on how o > deal wi h he indi idual selling he hacks on ebay o in la ed > p ices.> > I pos ed my hough s on ha indi idual yes e day. I would now like > o ende my opinion as o he subjec o wha we o anyone can do > abou i .> > My sugges ion is DO NOTHING! Now be o e e e ybody's jaw hi s he > loo , hea me ou .> > A couple o mon hs ago I would ha e been he one o lead he cha ge > in he assaul on his guy in he name o box jus ice.> > I can now say wi h con idence, Tha is no he way o handle i .> Le me explain why I belie e his way. Wi hou going in o a lo o  > de ail, I was a ough s ee kid ha g ew up on he s ee s o  > B ooklyn, I also se ed my coun y p oudly o six yea s as a us a my > g een be e , hen o a ca ee as a FDNY Fi eman whose hea and > heal h whe e bo h b oken a 911.> > My poin is, I ha e always li ed my li e belie ing ha any hing I > did no ag ee wi h o ha did no i my sense o igh and w ong> whe he i be igh o w ong, could be easily sol ed wi h agg ession > o some kind.> > I ook a long while and much sole sea ching and a lo o  > communica ion in e p e a ion om ou iends on he o he side.> Bu I ha e come o lea n ha agg essi e ac ion in any o m is > de imen al o he ha mony and peace o he whole in ol ed.> > Guy's like his guy on ebay do no and can no las in he ace o  > good and well in en ioned people ha a e he e and willing and ying > o ge he wo d o his mi aculous esea ch and spi i communica ion > ou o as many people as a e in need o wan o i .> > Tha is how we can s op people like his bo om eede . By sp eading > he knowledge o his esea ch om one pe son o he nex . Ou  > iends ha e s a ed ime and ime again ha any nega i e ene gy will > be de imen al o he communica ion and he esea ch, and posi i e > ha mony and ib a ion will se e o s eng hen he b idge be ween ou  > wo lds.> > So e en i you a e no eligious and do no belie e in Jesus Ch is  > as I do, hese wo ds ing ue no ma e wha con ex hey come om> his wisdom was spoken by my lo d wo housand yea s ago.> > \"do no check he splin e in you b o he s eye, un il you ha e > checked he plank in you own\"> > T u h ully, any hing we could do o sway his indi iduals sale o  > hese boxes would be minimal. Nega i i y and g eed always ind a > c ack o seep h ough.> > My sugges ion is le s y a li le ha de o sp ead he wo d o he > esea ch and educa e indi iduals ha a e o may become in e es ed, > h ough all he a ious ou le s a ailable o us on he web conce ning > he pa ano mal esea ch communi y. The e a e endless cha boa ds, > g oups and o ums plus websi es and wo d o mou h. > Ins ead o ying o s op his idio om de auding innocen  > unknowledgable people. Le s make su e he knowledge is ou he e o  > hem and we a e he e o help hem and guy's like M . ebay will > disappea on hei own.> > And we will no ha e expended an ounce o nega i e ene gy in he > p ocess.> Tha 's how I eel, bu ha 's jus me.> > B uce>Going g een? See he op 12 oods o ea o ganic.You ock. Tha 's why Blockbus e 's o e ing you one mon h o Blockbus e To al Access, No Cos .Ge in ouch in an ins an . Ge Windows Li e Messenge now."}