{"id": "9308", "subject": "Re: [EVP-ITC] Misty And Ann Welcome to the Frank&#39;s box family", "author": "Lisby", "timestamp": "2008-04-09T23:51:45Z", "full_text": "Well, we&#39;ll see if number 31 can hold a candle to mini 114. ;) Frank  \nsays that 31 is about the size of a mini, and that&#39;s good, because I  \nhaven&#39;t got a lot of space to experiment in.\n\nWe&#39;re all quite excited here--my son, Julie Stoddard, and I. And of  \ncourse, I am really happy that Frank has vetted and approved me to  \nadopt one of his babies. (I think the Purples made him do it; they&#39;ve  \nalways been sweet on me, right from the start. ;) )\n\nThanks for always cheering me on, Bruce. You&#39;re the toppermost.\n\nAnn\n\n\nOn Apr 9, 2008, at 7:03 PM, bhali333 wrote:\n\n&gt;\n&gt; Hey Guy&#39;s\n&gt;\n&gt; I read Frank&#39;s post about him shipping you two a Frank&#39;s box!\n&gt;\n&gt; That is just great two more family members, I just want to say\n&gt; I wish you guy&#39;s the same sucess that we that have Frank&#39;s boxes\n&gt; have enjoyed.\n&gt;\n&gt; And I know Chip Coffey is not a member here and I do not know him\n&gt; personally, but if someone happens to speak to him, please offer my\n&gt; congrats on getting #34, even though all three of you guy&#39;s took my\n&gt; title a newest box owner. :)\n&gt;\n&gt; I can&#39;t wait to hear the files.\n&gt; again welcome to the fold.\n&gt;\n&gt; Bruce\n&gt;\n&gt;\n&gt; \n\n\nWell, we'll see i numbe 31 can hold a candle o mini 114. ;) F ank says ha 31 is abou he size o a mini, and ha 's good, because I ha en' go a lo o space o expe imen in.We' e all qui e exci ed he e--my son, Julie S odda d, and I. And o cou se, I am eally happy ha F ank has e ed and app o ed me o adop one o his babies. (I hink he Pu ples made him do i ; hey' e always been swee on me, igh om he s a . ;) )Thanks o always chee ing me on, B uce. You' e he oppe mos .AnnOn Ap 9, 2008, a 7:03 PM, bhali333 w o e:Hey Guy's I ead F ank's pos abou him shipping you wo a F ank's box!Tha is jus g ea wo mo e amily membe s, I jus wan o say I wish you guy's he same sucess ha we ha ha e F ank's boxes ha e enjoyed.And I know Chip Co ey is no a membe he e and I do no know him pe sonally, bu i someone happens o speak o him, please o e my cong a s on ge ing #34, e en hough all h ee o you guy's ook my  i le a newes box owne . :)I can' wai o hea he iles.again welcome o he old.B uce"}