{"id": "9317", "subject": "Re: Misty And Ann Welcome to the Frank&#39;s box family", "author": "misujoey", "timestamp": "2008-04-10T14:02:53Z", "full_text": "Hi Misty and Ann .. Very exciting!!  I&#39;m looking forward to hearing \nyour recordings!!\n\nDebbie\n\n\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;lisbyfarrum&quot; &lt;lisby@...&gt; wrote:\n&gt;\n&gt; I&#39;m already so pleased with the research results I obtain that\n&gt; anything better from box 31 will be extra whipped cream and cherries\n&gt; on top of my enormous vat of ice cream. \n&gt; \n&gt; I am curious to see how the mini and Frank&#39;s compare. I feel that \nthe\n&gt; my minibox is a bit like a TARDIS in a way--I hate to say it has\n&gt; bonded with me or imprinted on me (or I&#39;ve imprinted on it), but \nthat\n&gt; does seem to describe it. The entities operating through it have \nbent\n&gt; their communication style to my circumstances. I will be curious to\n&gt; see if 31 does something similar. Who knows? It may decide it likes \nmy\n&gt; son Nick over me, or my friend Julie.\n&gt; \n&gt; Whatever happens, I shall enjoy the experience!\n&gt; \n&gt; Ann\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, juli velazquez &lt;ghostchasingfool@&gt;\n&gt; wrote:\n&gt; &gt;\n&gt; &gt; Congrats Ladies!  I wish you both the very best of luck and \nsuccess!\n&gt;  I can only tell you that I love my Franks Box for there is nothing\n&gt; like it in the world!  \n&gt; &gt;    \n&gt; &gt;   Juli \n&gt; &gt; \n&gt; &gt; Lisby &lt;lisby@&gt; wrote:\n&gt; &gt;           Well, we&#39;ll see if number 31 can hold a candle to mini\n&gt; 114. ;) Frank says that 31 is about the size of a mini, and that&#39;s\n&gt; good, because I haven&#39;t got a lot of space to experiment in.  \n&gt; &gt; \n&gt; &gt;   We&#39;re all quite excited here--my son, Julie Stoddard, and I. And\n&gt; of course, I am really happy that Frank has vetted and approved me \nto\n&gt; adopt one of his babies. (I think the Purples made him do it; \nthey&#39;ve\n&gt; always been sweet on me, right from the start. ;) )\n&gt; &gt;   \n&gt; &gt; \n&gt; &gt;   Thanks for always cheering me on, Bruce. You&#39;re the toppermost.\n&gt; &gt;   \n&gt; &gt; \n&gt; &gt;   Ann\n&gt; &gt;   \n&gt; &gt; \n&gt; &gt;   \n&gt; &gt;     On Apr 9, 2008, at 7:03 PM, bhali333 wrote:\n&gt; &gt; \n&gt; &gt;           \n&gt; &gt; Hey Guy&#39;s \n&gt; &gt; \n&gt; &gt; I read Frank&#39;s post about him shipping you two a Frank&#39;s box!\n&gt; &gt; \n&gt; &gt; That is just great two more family members, I just want to say \n&gt; &gt; I wish you guy&#39;s the same sucess that we that have Frank&#39;s boxes \n&gt; &gt; have enjoyed.\n&gt; &gt; \n&gt; &gt; And I know Chip Coffey is not a member here and I do not know him \n&gt; &gt; personally, but if someone happens to speak to him, please offer \nmy \n&gt; &gt; congrats on getting #34, even though all three of you guy&#39;s took \nmy \n&gt; &gt; title a newest box owner. :)\n&gt; &gt; \n&gt; &gt; I can&#39;t wait to hear the files.\n&gt; &gt; again welcome to the fold.\n&gt; &gt; \n&gt; &gt; Bruce\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt;   \n&gt; &gt; \n&gt; &gt;                            \n&gt; &gt; \n&gt; &gt; \n&gt; &gt;   The contents of this eletronic correspondence is private &\n&gt; confidential and meant only for the party and/or parties it is\n&gt; addressed to.  \n&gt; &gt;    \n&gt; &gt;   No part of this email transmission may be publicly posted or\n&gt; forwarded to other parties without explicit written permission.\n&gt; &gt;\n&gt;"}