{"id": "9373", "subject": "Re: [EVP-ITC] Re: Klaus Schreiber", "author": "Lisby", "timestamp": "2008-04-11T01:18:53Z", "full_text": "I dunno gang. Everyone who knows me for any length of time knows that  \nI have some real issues with the veracity of *some* of what went on  \nduring this time with this particular group. I was involved in the  \nEVP community at the time and heard about it unfolding. I&#39;m a  \njournalist who specializes in things like behavioral science, so I am  \npretty capable of separating my own feelings and beliefs and hopes  \nfrom facts. Before I get tarred again as a skeptic, I should also add  \nthat, at the time, I very much wanted everything emitting from this  \ngroup to be true. All I can say is, I remain unconvinced that there  \nwasn&#39;t hoaxing going on *to some extent*. There was also genuine  \nstuff happening. I&#39;m not here to say what was what--I&#39;m just saying,  \napproach this with an analytical mind to make your own judgement.\n\nI&#39;m never popular for stating this, but I remain convinced of my own  \nconclusions, although I am always open to any new evidence.\n\nAnn\n\nOn Apr 10, 2008, at 7:59 PM, Jeremy Robert Huber wrote:\n\n&gt;\n&gt; The communication was done not via radio, but telephone directly to\n&gt; the researchers homes. There were numerous telephone calls made to\n&gt; Maggy Harsch-Fishbach, Mark Macy and even to Sarah Estep. These phone\n&gt; calls were made by members of the group on the Other Side working with\n&gt; ITC researchers during the 1990&#39;s. The group working with the ITC\n&gt; researchers were guided by seven Ethereal beings on the Other Side\n&gt; called The Seven. Contact was not only made via telephone, but also\n&gt; fax and files placed in Maggy Fishbach&#39;s computer. :)\n&gt;\n&gt; I highly recommend Mr. Macy&#39;s book, Miracles In The Storm. He has much\n&gt; of this information on his website. http://worlditc.org\n&gt;\n&gt; Many Blessings All,\n&gt;\n&gt; Jeremy Robert Huber\n&gt; New York, New York\n&gt;\n&gt; --- In EVP-ITC@yahoogroups.com, &quot;psfponies&quot; &lt;psfponies@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; And were using Hacked Radios to talk to the dead! I am not sure I\n&gt; &gt; believe that one.\n&gt; &gt;\n&gt; &gt; Kay\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &lt;JeremyRobertHuber@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; That is the phone call made to Mark Macy by Konstantin Raudive.  \n&gt; Mr.\n&gt; &gt; Macy talked about this phone call in his excellent book &quot;Miracles In\n&gt; &gt; The Storm.&quot;\n&gt; &gt; &gt;\n&gt; &gt; &gt; Many Blessings All,\n&gt; &gt; &gt;\n&gt; &gt; &gt; Jeremy Robert Huber\n&gt; &gt; &gt; New York, New York\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;\n&gt; \n\n\nI dunno gang. E e yone who knows me o any leng h o ime knows ha I ha e some eal issues wi h he e aci y o *some* o wha wen on du ing his ime wi h his pa icula g oup. I was in ol ed in he EVP communi y a he ime and hea d abou i un olding. I'm a jou nalis who specializes in hings like beha io al science, so I am p e y capable o sepa a ing my own eelings and belie s and hopes om ac s. Be o e I ge a ed again as a skep ic, I should also add ha , a he ime, I e y much wan ed e e y hing emi ing om his g oup o be ue. All I can say is, I emain uncon inced ha he e wasn' hoaxing going on * o some ex en *. The e was also genuine s u happening. I'm no he e o say wha was wha --I'm jus saying, app oach his wi h an analy ical mind o make you own judgemen .I'm ne e popula o s a ing his, bu I emain con inced o my own conclusions, al hough I am always open o any new e idence.AnnOn Ap 10, 2008, a 7:59 PM, Je emy Robe Hube w o e:The communica ion was done no ia adio, bu elephone di ec ly o he esea che s homes. The e we e nume ous elephone calls made oMaggy Ha sch-Fishbach, Ma k Macy and e en o Sa ah Es ep. These phonecalls we e made by membe s o he g oup on he O he Side wo king wi hITC esea che s du ing he 1990's. The g oup wo king wi h he ITC esea che s we e guided by se en E he eal beings on he O he Sidecalled The Se en. Con ac was no only made ia elephone, bu also ax and iles placed in Maggy Fishbach's compu e . :)I highly ecommend M . Macy's book, Mi acles In The S o m. He has mucho his in o ma ion on his websi e. h p://wo ldi c.o gMany Blessings All,Je emy Robe Hube New Yo k, New Yo k--- In EVP-ITC@yahoog oups.com, \"ps ponies\" ..> w o e:>> And we e using Hacked Radios o alk o he dead! I am no su e I > belie e ha one. > > Kay> > --- In EVP-ITC@yahoog oups.com, > w o e:> >> > Tha is he phone call made o Ma k Macy by Kons an in Raudi e. M . > Macy alked abou his phone call in his excellen book \"Mi acles In > The S o m.\" > > > > Many Blessings All,> > > > Je emy Robe Hube > > New Yo k, New Yo k> >>"}