{"id": "9396", "subject": "Most amazing session", "author": "reesclarke_69", "timestamp": "2008-04-11T13:27:11Z", "full_text": "Hey guys\n\n     I had the most amazing session last night.  Me and my fiance \ndid a session, and this is how it went.  \n     \n     We usally do 10 min. of audio, and during the session we first \ncontacted a guy named Virgil, and we got him to say both of our \nnames.  He said &quot;William&quot; for me, and &quot;Leigh&quot; for Ashley.  We all \ncommunicated for the 10 min.  He didn&#39;t answer every question, but \nhe answered 75% of all answerslast night.  We told him that we \nwanted to prove that they exsisted on the other side.  Life after \ndeath.  He answer &quot;we are over here&quot;, very plainly.  After the 10 \nmin.  We ask for confirmation so we could shut off the radio, and we \ngot this answer &quot;that would be a bad idea&quot;.  Which freaked Ashley \nout.  So we kept the radio on and we had a conversation with this \npreacher, then while the band was still sweeping the preacher came \nthrough and he talked to us (while sweeping the band), and started \nto preach to us about our side, and how messed up it is.(the band \nwas sweeping the whole time, I never stop the band from sweeping)  \nHe said that we needed to pray for our enemies as well as our \nfriends and families.  He talked to us for 6 to eight minutes.   \nThen we finished the session (Ask for confirmation)when he didn&#39;t \ncome through any more.  We shut down.  Then of course I get up and \nput everything back the way it is supposed to be.  Leaving the \nsession that we just did on the laptop.  Then I went to take a \nshower, and I come back.  The laptop was turned off and I lost all \nof the session.  Sometimes the computer will log itself off, then \nwhen you get back it is exactly the was it was when you left it.  \nBut this wasn&#39;t the case, some reason the laptop shut itself off, \nand we lost all of the evidence that we had.  Didn&#39;t have nothing, \nand I couldn&#39;t believe that we lost everything.  So thats why I am \nsitting here typing away about what happen last night.  Instead of \nme posting files about what happen last night.  I wish so bad that \ny&#39;all would have been able to hear the communication.  It was a life \nchanging experience.  It made me think a whole lot different about \nbox research.  I still can&#39;t believe I didn&#39;t save it before the \ncomputer turned itself off.  That is what happen to me last night, \nand change box research for me for the rest of my life.\n\nThanks\n\nWilliam Rees Clarke III"}