{"id": "9409", "subject": "Re: For Rees - Crystal Enhancer", "author": "psfponies", "timestamp": "2008-04-11T16:49:06Z", "full_text": "Rees\n\nAny clear Quartz is good for bring energy into a room. Looks like \nthe crystal enhancer they are putting into the MiniBox is an Asian \nquartz crystal wand. A wand emits both positive and negative energy. \nIt strongly amplifies energy and focuses it to where it is needed. \n\nI use a lot of different kinds of crystal when meditating. The one I \nseem to have the strongest communication with are called Lemurian \nQuartz. When I use them they literal start vibrating in my palms. \n\nApophyllite is another good crystal for spirit communication but it \nusually only comes in a cluster.\n\nHope this helps. If you have any other questions on crystal I am a \nhuge rock hound and have been using and studying the properties of \ncrystal for a long time.\n\nKay\n\n\n--- In EVP-ITC@yahoogroups.com, Wiliam Clarke &lt;reesclarke_69@...&gt; \nwrote:\n&gt;\n&gt; what type of crystals would you for spirit communication!\n&gt; \n&gt; psfponies &lt;psfponies@...&gt; wrote:          Rees\n&gt; \n&gt; Crystals are used for channeling the spirits energy. I use \ncrystals \n&gt; during meditation and have had great results with spirit \n&gt; communication. I assume by adding the crystal to the Minibox it \n&gt; would increase spirit communication giving the spirit another \n&gt; channel to go though.\n&gt; \n&gt; Kay\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Wiliam Clarke &lt;reesclarke_69@&gt; \n&gt; wrote:\n&gt; &gt;\n&gt; &gt; This is going to sound crazy, but I&#39;ll keep my clicking. I don&#39;t \n&gt; hear it anymore during the session. I just like an old person when \n&gt; they get use to something, they will keep it. Nothing new. But I \n&gt; am in the market for a Mini Box with the crystal enhancer. Does \n&gt; anybody know what the crystal enhance does? I know that crystal \n&gt; have energy, but what is the enhancer?\n&gt; &gt; \n&gt; &gt; Rees\n&gt; &gt; \n&gt; &gt; \n&gt; \n&gt; \n&gt; \n&gt;                            \n&gt; \n&gt;  __________________________________________________\n&gt; Do You Yahoo!?\n&gt; Tired of spam?  Yahoo! Mail has the best spam protection around \n&gt; http://mail.yahoo.com\n&gt;"}