{"id": "9419", "subject": "Re: For Rees - Crystal Enhancer", "author": "itcdeadpeople", "timestamp": "2008-04-11T17:24:58Z", "full_text": "Hi Kay and Rees.  Just a quick suggestion about purchasing crystals ... if you get them \nfrom a local &#39;rock shop&#39; you can save a bundle.  And I&#39;ve recently purchased some beauties \noff eBay.  Some of them came on the slow boat from China (literally!) but they were worth \nthe wait (about 2 months).  And each time, I received exactly the crystal that was shown.  \nJust be sure to check the seller feedback for the ones who are delivering as promised.\n\nOnce crystals make their way into the commercial market and carry such labels as \nLemurian and the like, they become (in many cases) priced astronomically high.  If you \nknow what you&#39;re looking for, you might be able to find it for under $5.  I picked up a \nbunch of nice crystals in Las Vegas for super low pricing.  Something like $1 each or \nmaybe it was 5 for $1 (it&#39;s been years, so I don&#39;t remember exactly, but it was very low).  \nAll it required on my part was digging through the bin to find the ones I was drawn to.\n\nMargaret\n\n--- In EVP-ITC@yahoogroups.com, &quot;psfponies&quot; &lt;psfponies@...&gt; wrote:\n&gt;\n&gt; Rees\n&gt; \n&gt; Any clear Quartz is good for bring energy into a room. Looks like \n&gt; the crystal enhancer they are putting into the MiniBox is an Asian \n&gt; quartz crystal wand. A wand emits both positive and negative energy. \n&gt; It strongly amplifies energy and focuses it to where it is needed. \n&gt; \n&gt; I use a lot of different kinds of crystal when meditating. The one I \n&gt; seem to have the strongest communication with are called Lemurian \n&gt; Quartz. When I use them they literal start vibrating in my palms. \n&gt; \n&gt; Apophyllite is another good crystal for spirit communication but it \n&gt; usually only comes in a cluster.\n&gt; \n&gt; Hope this helps. If you have any other questions on crystal I am a \n&gt; huge rock hound and have been using and studying the properties of \n&gt; crystal for a long time.\n&gt; \n&gt; Kay\n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Wiliam Clarke &lt;reesclarke_69@&gt; \n&gt; wrote:\n&gt; &gt;\n&gt; &gt; what type of crystals would you for spirit communication!\n&gt; &gt; \n&gt; &gt; psfponies &lt;psfponies@&gt; wrote:          Rees\n&gt; &gt; \n&gt; &gt; Crystals are used for channeling the spirits energy. I use \n&gt; crystals \n&gt; &gt; during meditation and have had great results with spirit \n&gt; &gt; communication. I assume by adding the crystal to the Minibox it \n&gt; &gt; would increase spirit communication giving the spirit another \n&gt; &gt; channel to go though.\n&gt; &gt; \n&gt; &gt; Kay\n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, Wiliam Clarke &lt;reesclarke_69@&gt; \n&gt; &gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; This is going to sound crazy, but I&#39;ll keep my clicking. I don&#39;t \n&gt; &gt; hear it anymore during the session. I just like an old person when \n&gt; &gt; they get use to something, they will keep it. Nothing new. But I \n&gt; &gt; am in the market for a Mini Box with the crystal enhancer. Does \n&gt; &gt; anybody know what the crystal enhance does? I know that crystal \n&gt; &gt; have energy, but what is the enhancer?\n&gt; &gt; &gt; \n&gt; &gt; &gt; Rees\n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt;                            \n&gt; &gt; \n&gt; &gt;  __________________________________________________\n&gt; &gt; Do You Yahoo!?\n&gt; &gt; Tired of spam?  Yahoo! Mail has the best spam protection around \n&gt; &gt; http://mail.yahoo.com\n&gt; &gt;\n&gt;"}