{"id": "9439", "subject": "Re: For Rees - Crystal Enhancer", "author": "psfponies", "timestamp": "2008-04-11T19:50:42Z", "full_text": "Jemery \n\nMy boyfriend saw on the Cash and Treasures show where you could go \nand dig your own Black Fire Opals in Denio Nevada (which is a 5-6 \nhour drive) Some lady found one that was suppose to be worth \n$50,000! So off we went to mine for Black Fire Opals. The digging \nfee was $145 for the day per person. Need less to say it was hard \nwork and the only thing we ended up with was Opal boogers it was \nhot, dusty and windy there. But the camping was fun. \n\nI dont know how far you are from Herkimer New York but you can go \ndig for Herkimer diamonds they are awesome for spirit commucation. \nWish I was closer I would go but I am way out on the west coast in \nCalifornia.\n\nKay\n\n--- In EVP-ITC@yahoogroups.com, &lt;JeremyRobertHuber@...&gt; wrote:\n&gt;\n&gt; If anyone in this group lives near Arkansas you can go dig \ncrystals and get them free. All we had to pay was a digging fee \nwhich was, then, just a few dollars. It may of gone up by now. This \nwas in the early 90&#39;s when my (first) wife and I went a couple of \ntimes to Hot Springs, Arkansas to dig crystals. At that time I lived \nin Texas (I am originally from Oklahoma), so it was about a four \nhour drive from Dallas.\n&gt; \n&gt; We had a wonderful time and found a plethora of beautiful \ncrystals. Even some sizable clusters. The energy of the crystals is \nvery strong when you bring them out of the dirt as they have been in \nMother Earth their whole lives. They have a rust color appearance \nand they have to be soaked in the solution that you use to clean \npools. I would say all in all each trip we netted about ten pounds \nor so of crystals. \n&gt; \n&gt; \n&gt; Also, if any of you like to camp there are numerous wonderful \nstate parks in that area that have very nice camping facilities, \nplus even some cabins and shelters. The lakes there are crystal \nclear and you can see to the bottom. We found Lake De Grey the most \nbeautiful of the ones in that area that we visited.\n&gt; \n&gt; I hope this helps.\n&gt; \n&gt; Many Blessings All,\n&gt; \n&gt; Jeremy \n&gt; New York, New York\n&gt;"}