{"id": "9467", "subject": "Re: [EVP-ITC] For Margaret(itc imaging)", "author": "Rhonda W", "timestamp": "2008-04-12T00:10:59Z", "full_text": "--0-1422549412-1207959059=:57827\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nHey Bruce, \n  Im looking on your website and cant find the ITC imaging....am I missing it?(Ive been known to be blind as a bat to the obvious lol).  Im looking on http://www.free-paranormalinvestigating.com/ .  Do you have another site?\n   \n  Rhonda\n  \n\nbhali333 &lt;paranormalinvestigating@...&gt; wrote:\n          \nMargaret,\n\nBefore I became engrossed in box research I had done tons of research \nwith every method of ITC imaging.\n\nI did Video Loop, water reflection, crystal, mirror, you name it.\nAnd got pretty good results from most.\n\nMy most astounding visual itc came from a dicovery in my home.\nI have a crystal window in the front door of my house facing west, \nwhen the sun starts to go down it shines through this crystal window \nand projects onto the walls in my family room.\n\nI was sitting watching tv one day and happenned to look over at \nsomething that caught my attention, when I looked over there was a \nface looking back. I ran to get my digital camera and that started a \nyear long process of experiments and spirit images I name VPI (visual \nprojection imaging) I have literally hundreds of detailed images of \nspirits that where reflected through the crystal onto the walls in my \nhome. as far as I can discern the spirits were forming the images \ninside of the crystal window, and the sun was acting as sort of a \nslide or movie projecter. Projecting their images onto the walls when \nit came through the window.\n\nI had a page on I am haunted for the longest time, and drew quite a \nfollowing for my images. Alas since I discovered box research I have \nnot done one imaging session.\n\nWhat got my attention was the mention of the horse image. I also \ncaptured the image of a horse, very detailed and a cat that you would \nthink was sitting right in the room.\n\nMaragaret, please post the link to your site I did not get it and I \nwould love to take a look.\n\nIf anyone is interested let me know and I&#39;ll post some of my images.\n\nBruce\n\n\n\n                           \n\n __________________________________________________\nDo You Yahoo!?\nTired of spam?  Yahoo! Mail has the best spam protection around \nhttp://mail.yahoo.com \r\n--0-1422549412-1207959059=:57827\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;div&gt;Hey Bruce, &lt;/div&gt;  &lt;div&gt;Im looking on your website and cant find the ITC imaging....am I missing it?(Ive been known to be blind as a bat to the obvious lol).&nbsp; Im looking on &lt;A href=&quot;http://www.free-paranormalinvestigating.com/&quot;&gt;http://www.free-paranormalinvestigating.com/&lt;/A&gt;&nbsp;.&nbsp; Do you have another site?&lt;/div&gt;  &lt;div&gt;&nbsp;&lt;/div&gt;  &lt;div&gt;Rhonda&lt;/div&gt;  &lt;div&gt;&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;bhali333 &lt;paranormalinvestigating@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:&lt;/div&gt;  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;div&gt;&lt;BR&gt;Margaret,&lt;BR&gt;&lt;BR&gt;Before I became engrossed in box research I had done tons of research &lt;BR&gt;with every\n method of ITC imaging.&lt;BR&gt;&lt;BR&gt;I did Video Loop, water reflection, crystal, mirror, you name it.&lt;BR&gt;And got pretty good results from most.&lt;BR&gt;&lt;BR&gt;My most astounding visual itc came from a dicovery in my home.&lt;BR&gt;I have a crystal window in the front door of my house facing west, &lt;BR&gt;when the sun starts to go down it shines through this crystal window &lt;BR&gt;and projects onto the walls in my family room.&lt;BR&gt;&lt;BR&gt;I was sitting watching tv one day and happenned to look over at &lt;BR&gt;something that caught my attention, when I looked over there was a &lt;BR&gt;face looking back. I ran to get my digital camera and that started a &lt;BR&gt;year long process of experiments and spirit images I name VPI (visual &lt;BR&gt;projection imaging) I have literally hundreds of detailed images of &lt;BR&gt;spirits that where reflected through the crystal onto the walls in my &lt;BR&gt;home. as far as I can discern the spirits were forming the images &lt;BR&gt;inside of the crystal window, and the sun was acting as sort of a &lt;BR&gt;slide\n or movie projecter. Projecting their images onto the walls when &lt;BR&gt;it came through the window.&lt;BR&gt;&lt;BR&gt;I had a page on I am haunted for the longest time, and drew quite a &lt;BR&gt;following for my images. Alas since I discovered box research I have &lt;BR&gt;not done one imaging session.&lt;BR&gt;&lt;BR&gt;What got my attention was the mention of the horse image. I also &lt;BR&gt;captured the image of a horse, very detailed and a cat that you would &lt;BR&gt;think was sitting right in the room.&lt;BR&gt;&lt;BR&gt;Maragaret, please post the link to your site I did not get it and I &lt;BR&gt;would love to take a look.&lt;BR&gt;&lt;BR&gt;If anyone is interested let me know and I&#39;ll post some of my images.&lt;BR&gt;&lt;BR&gt;Bruce&lt;BR&gt;&lt;BR&gt;&lt;/div&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;p&gt;&#32;__________________________________________________&lt;br&gt;Do You Yahoo!?&lt;br&gt;Tired of spam?  Yahoo! Mail has the best spam protection around &lt;br&gt;http://mail.yahoo.com \r\n--0-1422549412-1207959059=:57827--"}