{"id": "9477", "subject": "Re: response to the sceptic link on my images", "author": "itcdeadpeople", "timestamp": "2008-04-12T03:12:57Z", "full_text": "Hi Bruce. I thought the images in your IAH gallery were very intriguing when I first saw \nthem, seems like over a year ago.  I didn&#39;t realize they were already posted here, nor that \nwouldn&#39;t want a link to them posted.  Sorry about that.  \n\nI do think the person on the other site brought up some valid concerns over how much \nenhancement has taken place, but as you pointed out, you have stated step by step what \nyour process is so this allows others to freely decide to what degree they feel the original \ncontent has been altered.\n\nI, myself, have been accused of photoshopping my images.  The main difference being \nthat I haven&#39;t done anything except for crop them from the larger frame in which they \nwere originally seen.  The colors and images are as they were discovered during the review \nprocess.\n\nAnd like yourself, I&#39;m into the two-way stuff now.  I still squeeze in a few sessions here \nand there, but my ITC work has definitely taken a temporary back seat to other research.  \n\nMargaret  \n\n--- In EVP-ITC@yahoogroups.com, bruce halliday &lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; \n&gt; Everyone,\n&gt;  \n&gt;  \n&gt; This took place about a year ago the guy stole my images from IAH and put up this page \nin one day.\n&gt; He was immediately put down and discredited and never surfaced again.\n&gt; The images where there for everyone to scrutinize and they were posted on almost a \ndaily basis for a while.\n&gt; It&#39;s like anything else in the paranormal, there will always be self appointed so called \nseekers of truth.\n&gt;  \n&gt; If you notice mine is the only item on the whole site. I don&#39;t mind sceptics or \nquestioning about how I got these images \n&gt; but this guy was an idiot. If he just would have asked, I would have explained what \nprocess I went through to bring \n&gt; the images out of the glare of the sunlight. As a matter of fact I had done a whole step \nby step instruction page on my previous website about the process. This creep was a self \nproclaimed photoshop expert and claimed my images were touched up.\n&gt; So I gave him a raw image of mine and asked him to come up with the same result. That \nwas the last I heard from him.\n&gt;  \n&gt; I did not put these images up to have to defend them, I just thought because of the \ninterest that arose regarding Margaret&#39;s images \n&gt; reminded me of my itc days, which are now long gone. My only interest is box research.\n&gt;  \n&gt; I don&#39;t feel it was necessary to did up that idiots website and post the link with my IAH \ngallery, I did not post these pictures \n&gt; to prove anything just for curiosity sake.\n&gt;  \n&gt; Bruce\n&gt;  \n&gt; Bruce Halliday \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: ITCdeadpeople@...: Fri, 11 Apr 2008 21:18:04 +0000Subject: [EVP-\nITC] Re: For Margaret(itc imaging)\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Hi Bruce. I tried to find the gal&#39;s website I saw before, but am not seeing it now. Just \nthis:http://specterweb.tripod.com/specter/id19.html--- In EVP-ITC@yahoogroups.com, \n&quot;bhali333&quot; &lt;paranormalinvestigating@&gt; wrote:&gt;&gt; &gt; Margaret,&gt; &gt; Before I became \nengrossed in box research I had done tons of research &gt; with every method of ITC \nimaging.&gt; &gt; I did Video Loop, water reflection, crystal, mirror, you name it.&gt; And got \npretty good results from most.&gt; &gt; My most astounding visual itc came from a dicovery in \nmy home.&gt; I have a crystal window in the front door of my house facing west, &gt; when the \nsun starts to go down it shines through this crystal window &gt; and projects onto the walls \nin my family room.&gt; &gt; I was sitting watching tv one day and happenned to look over at &gt; \nsomething that caught my attention, when I looked over there was a &gt; face looking back. I \nran to get my digital camera and that started a &gt; year long process of experiments and \nspirit images I name VPI (visual &gt; projection imaging) I have literally hundreds of detailed \nimages of &gt; spirits that where reflected through the crystal onto the walls in my &gt; home. \nas far as I can discern the spirits were forming the images &gt; inside of the crystal window, \nand the sun was acting as sort of a &gt; slide or movie projecter. Projecting their images \nonto the walls when &gt; it came through the window.&gt; &gt; I had a page on I am haunted for \nthe longest time, and drew quite a &gt; following for my images. Alas since I discovered box \nresearch I have &gt; not done one imaging session.&gt; &gt; What got my attention was the \nmention of the horse image. I also &gt; captured the image of a horse, very detailed and a \ncat that you would &gt; think was sitting right in the room.&gt; &gt; Maragaret, please post the \nlink to your site I did not get it and I &gt; would love to take a look.&gt; &gt; If anyone is \ninterested let me know and I&#39;ll post some of my images.&gt; &gt; Bruce&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Get in touch in an instant. Get Windows Live Messenger now.\n&gt; http://www.windowslive.com/messenger/overview.html?\nocid=TXT_TAGLM_WL_Refresh_getintouch_042008\n&gt;"}