{"id": "9526", "subject": "Re: Bruce (itc imaging)", "author": "LC Duplatt", "timestamp": "2008-04-12T16:26:46Z", "full_text": "Bruce, those ITC images are astounding!  ;)\n\nLC\n\n--- In EVP-ITC@yahoogroups.com, bruce halliday \n&lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; \n&gt; Rhonda,\n&gt;  \n&gt; I closed my old website and the new one is box research only.\n&gt; I posted the images in the photo section here on the group under \nbruce&#39;s itc images.\n&gt;  \n&gt; Bruce\n&gt; Bruce Halliday \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: rhondak1973@...: Fri, 11 Apr 2008 17:10:59 -\n0700Subject: Re: [EVP-ITC] For Margaret(itc imaging)\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Hey Bruce, \n&gt; Im looking on your website and cant find the ITC imaging....am I \nmissing it?(Ive been known to be blind as a bat to the obvious lol).  \nIm looking on http://www.free-paranormalinvestigating.com/ .  Do you \nhave another site?\n&gt;  \n&gt; Rhonda\n&gt; bhali333 &lt;paranormalinvestigating@...&gt; wrote:\n&gt; \n&gt; \n&gt; Margaret,Before I became engrossed in box research I had done tons \nof research with every method of ITC imaging.I did Video Loop, water \nreflection, crystal, mirror, you name it.And got pretty good results \nfrom most.My most astounding visual itc came from a dicovery in my \nhome.I have a crystal window in the front door of my house facing \nwest, when the sun starts to go down it shines through this crystal \nwindow and projects onto the walls in my family room.I was sitting \nwatching tv one day and happenned to look over at something that \ncaught my attention, when I looked over there was a face looking \nback. I ran to get my digital camera and that started a year long \nprocess of experiments and spirit images I name VPI (visual \nprojection imaging) I have literally hundreds of detailed images of \nspirits that where reflected through the crystal onto the walls in my \nhome. as far as I can discern the spirits were forming the images \ninside of the crystal window, and the sun was acting as sort of a \nslide or movie projecter. Projecting their images onto the walls when \nit came through the window.I had a page on I am haunted for the \nlongest time, and drew quite a following for my images. Alas since I \ndiscovered box research I have not done one imaging session.What got \nmy attention was the mention of the horse image. I also captured the \nimage of a horse, very detailed and a cat that you would think was \nsitting right in the room.Maragaret, please post the link to your \nsite I did not get it and I would love to take a look.If anyone is \ninterested let me know and I&#39;ll post some of my images.Bruce\n&gt; __________________________________________________Do You Yahoo!?\nTired of spam? Yahoo! Mail has the best spam protection around \nhttp://mail.yahoo.com  \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Use video conversation to talk face-to-face with Windows Live \nMessenger.\n&gt; http://www.windowslive.com/messenger/connect_your_way.html?\nocid=TXT_TAGLM_WL_Refresh_messenger_video_042008\n&gt;"}