{"id": "9534", "subject": "Re:First SuCcessful Recordings - Nathan re: Hoax", "author": "itcdeadpeople", "timestamp": "2008-04-12T20:54:39Z", "full_text": "Hi Nathan.  I always look to relevance as a key in determining whether or not something is \nappropriate to the session.  If this were a hoax, I would then have to seek an explanation \nfor how private information is known by the &#39;hoax perp&#39;, particularly information that \nwould require visual awareness.  \n\nSome of us have examples of appropriate responses being given when asking things like, \n&quot;Can you name something nearby me?&quot; or &quot;Please tell me what I&#39;m holding in my left \nhand.&quot;  A sophisticated multi-transmission two way radio would not explain answers \nwhich require &#39;visual&#39; information of some kind (though I&#39;ll be the first to admit my \nunderstanding of electronics is limited but I&#39;m fairly confident on this aspect.) \n\nOf course, there is always the chance that the person running the hoax is also, or in \npartnership with, an extremely talented remote viewer or psychic who is able to glean that \nvisual information from the ether or the mind of the experimenter.  \n\nAnd what of those examples where people have confirmed the sound of the voice being \n&quot;just like&quot; that of their loved one in spirit?  Surely the hoaxer isn&#39;t also able to mimic \npeople&#39;s loved ones.\n\nIf you are using EVP Maker with anything other than the allophones file, which contains no \nwords to begin with, you are also running the possibility of &#39;false positives&#39; albeit they \nwouldn&#39;t be from a hoax.  Again, I look to relevance to be key, and relevant info that \nwould not come easily to a stranger is even better.  \n\nFor example, I turned on my MiniBox for the very first time and said, &quot;Hello?&quot; and \nimmediately received the response, &quot;Hello Margaret.&quot;  If this were a hoax, how could that \nperson know in less than 10 seconds, who I was by name.  I had not given this information \nout.  Not to mention that you have people experimenting 24/7 and receiving similar \nresponses.  How in the world could an organization have the manpower, technology, or \neven the desire, to attempt such a hoax?  I mean that as a genuine inquiry, because there \nmight be an explanation I have not thought of.  \n\nI have one example where, via radio sweep, my communicator was able to correctly \nidentify the status and location of a missing person (who it turns out was alive and well, so \nwe ended up with confirmation that the info given had indeed been correct - which is \nmuch less complicated that trying to track and understand the clues when associated with \nthe dead, or missing but not found.)  Again, if a hoax, would that have simply been a \nlucky guess on the part of the hoaxer?\n\nBottom line for me is ... have I wondered if it could be a hoax?  Or simply a fortuitous \ntuning of the dial?  Yes, on both accounts.  But there is enough compelling evidence to rule \nout both of them as an explanation for the far too many relevant examples received by so \nmany of us.\n\nGood food for thought, but after digesting it, I&#39;d have to say, &quot;No, a sophisticated hoax \ndoes not sufficiently explain the phenomena on a large scale.&quot;\n\nMargaret\n\n--- In EVP-ITC@yahoogroups.com, Nathan Sharman &lt;v1230mail@...&gt; wrote:\n&gt;\n&gt; Has it ever occurred to you, that some one or\n&gt; organisation, could be using a radio to say the things\n&gt; you heard?\n&gt; \n&gt; This whole radio and spirit voices, could be a MASSIVE\n&gt; HOAX, perpetuated by some one with a sophisticated\n&gt; multi-transmission two way radio.\n&gt; \n&gt; Think about it.\n&gt; \n&gt; THAT IS WHY I USE EVPmaker only to commuincate with\n&gt; the other dimension.\n&gt; \n&gt; __________________________________________________\n&gt; Do You Yahoo!?\n&gt; Tired of spam?  Yahoo! Mail has the best spam protection around \n&gt; http://mail.yahoo.com\n&gt;"}