{"id": "9540", "subject": "Re: Hearing Your Name Called Outloud.", "author": "v1230mail", "timestamp": "2008-04-12T21:12:38Z", "full_text": "--- In EVP-ITC@yahoogroups.com, &lt;JeremyRobertHuber@...&gt; wrote:\n&gt;\n&gt; Hello Rhonda and Everyone,\n&gt; \n&gt; I have heard my name called out loud before, but it was not an EVP\nsituation it was after my first girlfriend died. I was 17. She was 15.\nShe had had her second kidney transplant a few months earlier and died\nof gas gangrene.\n&gt; \n&gt; She died at 3:15 PM and I felt it. I knew that she had died. It is\nvery difficult to explain, but I knew that she was gone. So, it wasn&#39;t\nsurprising to me when I got home from school and my eldest sister was\non the phone telling my Mother that Rena had died.\n&gt; \n&gt; My Mother had moved us to Texas from Oklahoma a few months earlier.\nI knew that Rena wasn&#39;t doing good as she was before I left, but no\none expected her to die. She made a turn for the worse late that\nmorning and by 3:15 she was gone. \n&gt; \n&gt; Late that afternoon I took the Greyhound bus back to my hometown in\nOklahoma. When I got to my sisters house, it was around 1 am. My\nsister is 18 years older than me, so I have a niece that is a year\nyounger than me. My niece and I both heard Rena call my name and I\nthen heard her call my name again a little later before I went to bed.\nThat night after I had gone to sleep, it woke me up as I felt someone\nsit on the side of my bed. I knew it was Rena telling me she was okay,\nbut this was before I knew anything about the paranormal, so I was a\nbit scared to open my eyes and see her. \n&gt; \n&gt; She was my first love and I am hoping that I will hear from her\nsomeday via EVP/ITC.\n&gt; \n&gt; I consider myself very blessed to of heard her call my name and sit\nbeside me to let me know she was okay. \n&gt; \n&gt; Wishing everyone a wonderful weekend.\n&gt; \n&gt; Jeremy \n&gt; New York, New York\n&gt;\nHi read books by Robert Monroe.\n\nHe had the ability to travel out of the body and go to the Astral.\n\nThere are Technologically advanced Aliens that seem to control the\npolitical situation in the Astral planes, and they do not want Earth\nhumans to develop full communication with human spirits in the Astral.\n\nWE HUMANS ARE BEING EXPLOITED IN THE ASTRAL PLANES, that is why when\ncommunications are going good, all of a sudden you no longer hear from\nthe spirit any more, THAT IS BECAUSE THE SPIRIT WAS FORBIDDEN to\ncommunicate further.\n\nWE NEED TO START DOING SERIOUS RESEARCH AND NOT GET ALL EXCITED TO\nJUST HEAR VOICES.\n\nWE also need to study the physics involved, this is high energy physics."}