{"id": "9569", "subject": "Re: New file uploaded to EVP-ITC - hearing voices", "author": "Misty", "timestamp": "2008-04-13T05:50:44Z", "full_text": "Does that bother you? Doing this work we all know it shouldn&#39;t. I \nhave to ask before I say &quot;join the club&quot; LOL\n\nMany involved in this research have experienced it at one time or \nanother. For those who think they can turn on or turn off the spirit \nworld or open/close some invisible doorway, it can be very unsettling \nto be communicated with when they arent expecting it and sometimes in \nways they dont appreciate. \n\nIf I am tryin to sleep thats not the time to try talking to me, \nalive, dead, etc.. makes no difference. But now and then its loud and \nclear enough to make me &quot;look&quot; for the speaker. Whispers in the \near &quot;i love you&quot; &quot;can you hear me&quot;, or even &quot;HEY WAKE UP&quot; yelled in \nthe ear... I am sure its funny to watch me run around and hunt for \nthe invisible man/woman, I know when I talked with a few people (who \nare now passed) we always said that would be fun to do if we could \ncome back to &quot;haunt&quot; people we would definitely give it our best \nshot. When I am wide awake and very much aware, it can be a different \nexperience. Especially if they answer you back. \n\nI did once get a man who sang an old fashioned song I had never heard \nand played on his fiddle the most amazing melody. I was sick in bed \nlistening to the rushing water from the fish tank when it suddenly \nchanged and his singing got louder and louder...so the whole time I \nwas hearing it I was saying to myself wow this is some fever. Hmmmm \nhow high is this fever maybe I should get up and check again. Dang! \nThat guy can really sing! I just checked my temperature 5 minutes ago \n(just under 101) it cant have changed that much surely.. This dude \nfrickin rawks! Wow now he has a violin no wait thats a fiddle. Ok \nthis is definitely a cool hallucination or I am dying. Either way \nbring it on I aint budging! So I finally just relaxed and stopped \nworrying if I was tripping and enjoyed the rest of his song. I \ndecided later if I had been hallucinating perhaps I should try \ngetting fevers more often. It was a little painful but the discomfort \nis just a distant memory...the song...well the song left quite a mark!\n\nIt&#39;s something I questioned myself about at first and them about over \nthe years using various methods.\n*h20 method = &quot;your not causing those you&#39;re hearing from the \nfountain&quot; \n*evpmaker method = &quot;they&#39;re coming by the fountain&quot;\n\nThey call the fish tank the fountain tho it has other connotations. \n*sweep tuning = &quot;its good to drink the fountains of the knowledge&quot;\n\nI am kind of thirsty now that I mention it gonna go get a drink after \nI post a couple =)\n\nMisty\n\n--- In EVP-ITC@yahoogroups.com, Michael Edwards &lt;f1cracker75@...&gt; \nwrote:\n&gt;\n&gt; She means not recording at all. Like she is in the kitchen or in \nthe garage, and her radio is stored away and not on.  Before I \nstarted box research, I have started to hear the spirits talking to \nme now, mostly when I go to bed. Rhonda is hearing them too.\n&gt; \n&gt; bruce halliday &lt;paranormalinvestigating@...&gt; wrote:          Rhonda,\n&gt; Do you mean leaving the box on and unattended?\n&gt;  \n&gt; bruce\n&gt; \n&gt; \n&gt;   Bruce Halliday \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;     \n&gt; ---------------------------------\n&gt;   To: EVP-ITC@yahoogroups.com\n&gt; From: rhondak1973@...\n&gt; Date: Sat, 12 Apr 2008 09:01:57 -0700\n&gt; Subject: RE: [EVP-ITC] New file uploaded to EVP-ITC\n&gt; \n&gt;         Have you had it happen while you were away from the boxes, \nlike going about normal errands around the house or about to fall \nasleep?\n&gt;   Rhonda\n&gt; \n&gt; bruce halliday &lt;paranormalinvestigating@...&gt; wrote:\n&gt;       Rhonda,\n&gt;  \n&gt; I have my name mentioned at least 10 times during a normal session, \nbefore the big tech mix up mike and lisa would \n&gt; adress me by my name constantly, usually one of the first things a \nnew researcher hears is their name being called\n&gt; I believe our friends do this to give immediate validation to the \nnew box user that they are indeed recieving spirit\n&gt; communication.\n&gt;  \n&gt; Bruce\n&gt; \n&gt; \n&gt;   Bruce Halliday \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;     \n&gt; ---------------------------------\n&gt;   To: EVP-ITC@yahoogroups.com\n&gt; From: rhondak1973@...\n&gt; Date: Fri, 11 Apr 2008 23:42:56 -0700\n&gt; Subject: Re: [EVP-ITC] New file uploaded to EVP-ITC\n&gt; \n&gt;         Hey Mike,\n&gt;    \n&gt;   Ive actually heard or thought I heard my name being called a few \ntimes...the first time I kinda brushed it off as me being overly \ntired but Ive had it happen a few times since when I wasnt overly \ntired.  I havent heard anything else just my name.  Id be curious to \nknow if others had this happen to them too.\n&gt;    \n&gt;   Rhonda\n&gt; \n&gt; Michael Edwards &lt;f1cracker75@...&gt; wrote:\n&gt;         That is funnny.. Yeah, I am amazed they can see us, and to \nthink even before I got involved in Box EVP, I never thought once \nthat they are right here in the room with us.\n&gt;    \n&gt;   Have a question for you. Margaret had mentioned in one of her \nposts that once we start Box Research, if we never have before, we \nare more likely to become chairaudient.\n&gt;    \n&gt;   Last night, was amazing for me while lying in bed. I heard them \ntalking to me for the first time. It was really neat.\n&gt;    \n&gt;   Has this happened to you yet, or even to Kristin since the three \nof us are relatively new at this?\n&gt;    \n&gt;   \n&gt; \n&gt; Rhonda W &lt;rhondak1973@...&gt; wrote:\n&gt;         Heard what sounded like &quot;dude whatcha make that from?&quot; and \nthe &quot;carving&quot;\n&gt;   cool that they can see us...makes me not want to walk around \nnekkid any more haha\n&gt;    \n&gt;   Rhonda\n&gt;   \n&gt; \n&gt; EVP-ITC@yahoogroups.com wrote:\n&gt;       \n&gt; Hello,\n&gt; \n&gt; This email message is a notification to let you know that\n&gt; a file has been uploaded to the Files area of the EVP-ITC \n&gt; group.\n&gt; \n&gt; File : /Mike Edwards Files/What am I holding in my hand Voice said \na Carving.mp3 \n&gt; Uploaded by : f1cracker75 &lt;f1cracker75@...&gt; \n&gt; Description : I had a wood carved sail boat in my hand, and i asked \nthe spirits what I had in my hand. A voice said a Carving \n&gt; \n&gt; You can access this file at the URL:\n&gt; http://groups.yahoo.com/group/EVP-ITC/files/Mike%20Edwards%\n20Files/What%20am%20I%20holding%20in%20my%20hand%20%20%20Voice%20said%\n20a%20Carving.mp3 \n&gt; \n&gt; To learn more about file sharing for your group, please visit:\n&gt; \nhttp://help.yahoo.com/l/us/yahoo/groups/original/members/web/index.htm\nlfiles\n&gt; \n&gt; Regards,\n&gt; \n&gt; f1cracker75 &lt;f1cracker75@...&gt;\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;   __________________________________________________\n&gt; Do You Yahoo!?\n&gt; Tired of spam? Yahoo! Mail has the best spam protection around \n&gt; http://mail.yahoo.com \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Michael Edwards: Cary, North Carolina. f1cracker75@...   \n__________________________________________________\n&gt; Do You Yahoo!?\n&gt; Tired of spam? Yahoo! Mail has the best spam protection around \n&gt; http://mail.yahoo.com \n&gt; \n&gt; \n&gt; \n&gt;   __________________________________________________\n&gt; Do You Yahoo!?\n&gt; Tired of spam? Yahoo! Mail has the best spam protection around \n&gt; http://mail.yahoo.com \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;   \n&gt; ---------------------------------\n&gt;   Pack up or back upuse SkyDrive to transfer files or keep extra \ncopies. Learn how.   \n&gt; \n&gt; \n&gt; \n&gt;   __________________________________________________\n&gt; Do You Yahoo!?\n&gt; Tired of spam? Yahoo! Mail has the best spam protection around \n&gt; http://mail.yahoo.com \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;   \n&gt; ---------------------------------\n&gt;   Pack up or back upuse SkyDrive to transfer files or keep extra \ncopies. Learn how.   \n&gt; \n&gt;                            \n&gt; \n&gt; \n&gt; Michael Edwards:  f1cracker75@...\n&gt;  __________________________________________________\n&gt; Do You Yahoo!?\n&gt; Tired of spam?  Yahoo! Mail has the best spam protection around \n&gt; http://mail.yahoo.com\n&gt;"}