{"id": "9581", "subject": "Benn busy but just caught up", "author": "Kristin", "timestamp": "2008-04-13T14:45:03Z", "full_text": "So here&#39;s my run-down of responses for the past week ;-):\n\nFrank S: Congrats on franken out the 469 to your liking!\n\nI did hear most of everyone&#39;s files posted:  Urkle and Bruce&#39;s wer\nmost clear.\n\nKATHYWEIR:  Audacity is free - google it.\n\nNATHAN:  Whatever you believe is okay.  Opinions make the world go\nround.  If you are open and want to learn more than welcome.\n\nJULI - WHATS UP GIRL!!!  I have been hanging upside down - out my\nwindow and about to throw up a ladder and sit on my roof to get better\nreception!!!  I have run out of tinfoil... can you spare some?\n\nAL from o&#39;BAMA:  I too always get contradicting answers.  Just\nyesterday I was cleaning my pool and listening to my 470 and I heard\nthem say &quot;SHE&#39;S USING US FOR ENTERTAINMENT&quot;  I replied that I was\ntrying to get experience &#39;hearing&#39;.  I heard THAT&#39;S GOOD&quot; and I also\nheard &quot;BITCH LEAVE&quot;.  I apologized if they felt I was intruding and\nasked if they wanted me to shut down or just the DH&#39;s wanted me too. \nI heard &quot;BOTH&quot; and I heard &quot;NO DON&#39;T&quot;.  Who do I choose to listen to?\n I stayed on for a bit longer - I always err on the side of positive.\n If I&#39;m looking for answers to important personal stuff.. I wouldn&#39;t\nask the box for answers.  PS:  I once asked if they could read my mind\nand they responded with &quot;OF COURSE NOT&quot; and then proceeded to answer\nmy next question before I asked!  Go figure :-)\n\nRHONDA - Are you hearing voice girl???  I knew it!  You&#39;re as crazy as\nme!!!  LOL...  I think that&#39;s cool.\n\nREES:  I really do believe your lost session was very cool.  I don&#39;t\nbelieve it&#39;s loss was a coincidence.  \n\nBRUCE:  Cool pictures in the Photos Section.  Have you ever thought\nabout doing a BOX session and a Photo session at the same time and see\nif you could get a photograph of the person talking??  That would be\nan interesting experiement.\n\nMARGARET:  Your knowledge is so emense!  I am grateful you are here\nwith us to share.  \n\nANNETTE:  Congrats on your son&#39;s wedding!\n\nJOEL:  The news item you posted is disturbing on so many levels.  I\njust pray that the universe works it out so that karma is indeed\nsomething that these people will have to deal with.  Nothing is sacred\nanymore it seems...\n\nAARON:  C O N G R A T U L A T I O N S !!  On your first successful\nsession.  You&#39;re hooked and welcome aboard the crazy train ;-)\n\nVINNIE:  CONGRATS TO YOU TOO!  Do you want us to call your Dave or\nVinnie?  \n\nRON L:  I asked about Austism for you and I heard :&quot;MAN MADE&quot; and when\nI asked about vaacines I heard &quot;YES..&quot;  I will work on trying to get\nthese files online.  But I have so much to go through...  I think I\nwill be listening for about a week...  \n\nwhew... i missed you all..\nk"}