{"id": "9583", "subject": "Re: [EVP-ITC] Benn busy but just caught up", "author": "Ron Lederer", "timestamp": "2008-04-13T15:05:00Z", "full_text": "--0-1392941990-1208099100=:4381\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nKristin   Thanks for the summary...a lot of work to be sure.  I am glad you brought up the autism question and I am encouraged by you initial results.  I was actually ready to re-post my request for other researchers to help with the question.  Since I got no response from others I figured my first post was not received by the group.  I can repost if anyone is interested in helping with this research project.  Thanks again for the summary...kind of brings us and our stuff all together as a GROUP.  Ron L \n\nKristin &lt;ckmorris95@...&gt; wrote:          So here&#39;s my run-down of responses for the past week ;-):\n\nFrank S: Congrats on franken out the 469 to your liking!\n\nI did hear most of everyone&#39;s files posted: Urkle and Bruce&#39;s wer\nmost clear.\n\nKATHYWEIR: Audacity is free - google it.\n\nNATHAN: Whatever you believe is okay. Opinions make the world go\nround. If you are open and want to learn more than welcome.\n\nJULI - WHATS UP GIRL!!! I have been hanging upside down - out my\nwindow and about to throw up a ladder and sit on my roof to get better\nreception!!! I have run out of tinfoil... can you spare some?\n\nAL from o&#39;BAMA: I too always get contradicting answers. Just\nyesterday I was cleaning my pool and listening to my 470 and I heard\nthem say &quot;SHE&#39;S USING US FOR ENTERTAINMENT&quot; I replied that I was\ntrying to get experience &#39;hearing&#39;. I heard THAT&#39;S GOOD&quot; and I also\nheard &quot;BITCH LEAVE&quot;. I apologized if they felt I was intruding and\nasked if they wanted me to shut down or just the DH&#39;s wanted me too. \nI heard &quot;BOTH&quot; and I heard &quot;NO DON&#39;T&quot;. Who do I choose to listen to?\nI stayed on for a bit longer - I always err on the side of positive.\nIf I&#39;m looking for answers to important personal stuff.. I wouldn&#39;t\nask the box for answers. PS: I once asked if they could read my mind\nand they responded with &quot;OF COURSE NOT&quot; and then proceeded to answer\nmy next question before I asked! Go figure :-)\n\nRHONDA - Are you hearing voice girl??? I knew it! You&#39;re as crazy as\nme!!! LOL... I think that&#39;s cool.\n\nREES: I really do believe your lost session was very cool. I don&#39;t\nbelieve it&#39;s loss was a coincidence. \n\nBRUCE: Cool pictures in the Photos Section. Have you ever thought\nabout doing a BOX session and a Photo session at the same time and see\nif you could get a photograph of the person talking?? That would be\nan interesting experiement.\n\nMARGARET: Your knowledge is so emense! I am grateful you are here\nwith us to share. \n\nANNETTE: Congrats on your son&#39;s wedding!\n\nJOEL: The news item you posted is disturbing on so many levels. I\njust pray that the universe works it out so that karma is indeed\nsomething that these people will have to deal with. Nothing is sacred\nanymore it seems...\n\nAARON: C O N G R A T U L A T I O N S !! On your first successful\nsession. You&#39;re hooked and welcome aboard the crazy train ;-)\n\nVINNIE: CONGRATS TO YOU TOO! Do you want us to call your Dave or\nVinnie? \n\nRON L: I asked about Austism for you and I heard :&quot;MAN MADE&quot; and when\nI asked about vaacines I heard &quot;YES..&quot; I will work on trying to get\nthese files online. But I have so much to go through... I think I\nwill be listening for about a week... \n\nwhew... i missed you all..\nk\n\n\n\n                           \n\n __________________________________________________\nDo You Yahoo!?\nTired of spam?  Yahoo! Mail has the best spam protection around \nhttp://mail.yahoo.com \r\n--0-1392941990-1208099100=:4381\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nKristin&nbsp;&nbsp; Thanks for the summary...a lot of work to be sure.&nbsp; I am glad you brought up the autism question and I am encouraged by you initial results.&nbsp; I was actually ready to re-post my request for other researchers to help with the question.&nbsp; Since I got&nbsp;no response from others I figured&nbsp;my first post was not received by the group.&nbsp; I&nbsp;can repost if anyone is interested in&nbsp;helping with this research project.&nbsp; Thanks again&nbsp;for the summary...kind of brings us and our stuff all together as a GROUP.&nbsp; Ron L&nbsp;&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;Kristin &lt;ckmorris95@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;div&gt;So here&#39;s my run-down of responses for the past week ;-):&lt;BR&gt;&lt;BR&gt;Frank S: Congrats on franken out the 469 to your liking!&lt;BR&gt;&lt;BR&gt;I did hear most of everyone&#39;s files posted: Urkle and Bruce&#39;s wer&lt;BR&gt;most clear.&lt;BR&gt;&lt;BR&gt;KATHYWEIR: Audacity is free - google it.&lt;BR&gt;&lt;BR&gt;NATHAN: Whatever you believe is okay. Opinions make the world go&lt;BR&gt;round. If you are open and want to learn more than welcome.&lt;BR&gt;&lt;BR&gt;JULI - WHATS UP GIRL!!! I have been hanging upside down - out my&lt;BR&gt;window and about to throw up a ladder and sit on my roof to get better&lt;BR&gt;reception!!! I have run out of tinfoil... can you spare some?&lt;BR&gt;&lt;BR&gt;AL from o&#39;BAMA: I too always get contradicting answers. Just&lt;BR&gt;yesterday I was cleaning my pool and listening to my 470 and I heard&lt;BR&gt;them say &quot;SHE&#39;S USING US FOR ENTERTAINMENT&quot; I replied that I was&lt;BR&gt;trying to get experience &#39;hearing&#39;. I heard THAT&#39;S GOOD&quot; and I also&lt;BR&gt;heard &quot;BITCH LEAVE&quot;. I\n apologized if they felt I was intruding and&lt;BR&gt;asked if they wanted me to shut down or just the DH&#39;s wanted me too. &lt;BR&gt;I heard &quot;BOTH&quot; and I heard &quot;NO DON&#39;T&quot;. Who do I choose to listen to?&lt;BR&gt;I stayed on for a bit longer - I always err on the side of positive.&lt;BR&gt;If I&#39;m looking for answers to important personal stuff.. I wouldn&#39;t&lt;BR&gt;ask the box for answers. PS: I once asked if they could read my mind&lt;BR&gt;and they responded with &quot;OF COURSE NOT&quot; and then proceeded to answer&lt;BR&gt;my next question before I asked! Go figure :-)&lt;BR&gt;&lt;BR&gt;RHONDA - Are you hearing voice girl??? I knew it! You&#39;re as crazy as&lt;BR&gt;me!!! LOL... I think that&#39;s cool.&lt;BR&gt;&lt;BR&gt;REES: I really do believe your lost session was very cool. I don&#39;t&lt;BR&gt;believe it&#39;s loss was a coincidence. &lt;BR&gt;&lt;BR&gt;BRUCE: Cool pictures in the Photos Section. Have you ever thought&lt;BR&gt;about doing a BOX session and a Photo session at the same time and see&lt;BR&gt;if you could get a photograph of the person talking?? That would be&lt;BR&gt;an\n interesting experiement.&lt;BR&gt;&lt;BR&gt;MARGARET: Your knowledge is so emense! I am grateful you are here&lt;BR&gt;with us to share. &lt;BR&gt;&lt;BR&gt;ANNETTE: Congrats on your son&#39;s wedding!&lt;BR&gt;&lt;BR&gt;JOEL: The news item you posted is disturbing on so many levels. I&lt;BR&gt;just pray that the universe works it out so that karma is indeed&lt;BR&gt;something that these people will have to deal with. Nothing is sacred&lt;BR&gt;anymore it seems...&lt;BR&gt;&lt;BR&gt;AARON: C O N G R A T U L A T I O N S !! On your first successful&lt;BR&gt;session. You&#39;re hooked and welcome aboard the crazy train ;-)&lt;BR&gt;&lt;BR&gt;VINNIE: CONGRATS TO YOU TOO! Do you want us to call your Dave or&lt;BR&gt;Vinnie? &lt;BR&gt;&lt;BR&gt;RON L: I asked about Austism for you and I heard :&quot;MAN MADE&quot; and when&lt;BR&gt;I asked about vaacines I heard &quot;YES..&quot; I will work on trying to get&lt;BR&gt;these files online. But I have so much to go through... I think I&lt;BR&gt;will be listening for about a week... &lt;BR&gt;&lt;BR&gt;whew... i missed you all..&lt;BR&gt;k&lt;BR&gt;&lt;BR&gt;&lt;/div&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;p&gt;&#32;__________________________________________________&lt;br&gt;Do You Yahoo!?&lt;br&gt;Tired of spam?  Yahoo! Mail has\n the best spam protection around &lt;br&gt;http://mail.yahoo.com \r\n--0-1392941990-1208099100=:4381--"}