{"id": "9587", "subject": "Re: Speakjet Box 3 Finished", "author": "bryan_whatley", "timestamp": "2008-04-13T15:35:46Z", "full_text": "My thoughts exactly Stefan.  I was wondering on how he hooked\nallophones and the emf together.  That&#39;s a hell of an idea.  I&#39;m\nworking on a few detection type boxes that I only want to run when\nsomeone is near and not all the time.  \n\nI&#39;ll be glad to post my information too for everyone once I get it all\nworked out.  \n\n--- In EVP-ITC@yahoogroups.com, Stefan Bion &lt;yahoogroups@...&gt; wrote:\n&gt;\n&gt; Yeah, and I&#39;d be interested in the schemtics, especially the EMF part.\n&gt; How did you map the EMF field intensity/frequency/whatever to the\n&gt; individual allophones?\n&gt; \n&gt; I&#39;m also looking forward to some audio clips with direct 2-way\n&gt; communication. :)\n&gt; \n&gt; Stefan\n&gt; \n&gt; -- \n&gt; \n&gt; &gt; This sounds pretty interesting.  Can you send some more info or a\nlink?\n&gt; &gt; Thanks,\n&gt; &gt; Bryan\n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;dead.science&quot; &lt;dead.science@&gt; wrote:\n&gt; &gt;&gt;\n&gt; &gt;&gt; Just finished box number 3.  And yes that&#39;s a trifield meter\nbuilt in.\n&gt; &gt;&gt;  It seems to work great.  Once the meter shows any EMF field at all\n&gt; &gt;&gt; the box starts to spit out the allophones.  The meter also has a very\n&gt; &gt;&gt; sensitive antenna and it is tied together with the\n&gt; &gt;&gt;  A to D converter antenna that I use to get the emf into the box.\n&gt; &gt;&gt; This is by far the most sensitive of the three boxes.  If you are\n&gt; &gt;&gt; building your own just let me know if you need any info.  I will of\n&gt; &gt;&gt; course upload audio files as I get them.  I did have a few headaches\n&gt; &gt;&gt; with this box as I am driving the LM386 all the way up.  Somehow the\n&gt; &gt;&gt; audio was getting back into the negative bus!  Took a couple hours to\n&gt; &gt;&gt; get the right capacitor for the ground shunt.  Funny though as it\n&gt; &gt;&gt; worked great on the breadboard but once I soldered it together\n&gt; &gt;&gt; UHHHGGG.  I think I will hang onto this one  for a while.  I have\n&gt; &gt;&gt; young lady in mind that is doing very promising work so I guess she\n&gt; &gt;&gt; gets box # 1.\n&gt; &gt;&gt;\n&gt; \n&gt; \n&gt; \n&gt; &gt; ------------------------------------\n&gt; \n&gt; &gt; Yahoo! Groups Links\n&gt;"}