{"id": "9591", "subject": "Re: Benn busy but just caught up", "author": "bryan_whatley", "timestamp": "2008-04-13T15:59:36Z", "full_text": "Hi Krisin,\n   I&#39;m basically going to setup everything like I would on a normal\nhunt by placing cameras throughout the room trying to cover everyplace\npossible, especially around the box.  I&#39;ll probably run normally light\nrecordings, night vision recordings, and thermo images with the flir.\n  If you have a video camera and a regular camera, you can do the same\nthing easily.  Let us know how it turns out. \nThanks,\nBryan\n--- In EVP-ITC@yahoogroups.com, &quot;Kristin&quot; &lt;ckmorris95@...&gt; wrote:\n&gt;\n&gt; I&#39;m super excited to hear you are going to try this!!  I have some video\n&gt; equipment.  What do I need to perform this experiment?  Maybe if I have\n&gt; all the stuff I could try it too...\n&gt; k\n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;bryan_whatley&quot; &lt;bryan_whatley@&gt;\n&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hi Kristin\n&gt; &gt;\n&gt; &gt; &gt; BRUCE:  Cool pictures in the Photos Section.  Have you ever thought\n&gt; &gt; &gt; about doing a BOX session and a Photo session at the same time and\n&gt; see\n&gt; &gt; &gt; if you could get a photograph of the person talking??  That would be\n&gt; &gt; &gt; an interesting experiement.\n&gt; &gt; &gt;\n&gt; &gt;\n&gt; &gt; I have a flir and tons of other photo/video equipment I am planning to\n&gt; &gt; setup and use during some of my sessions to see if I can detect anyone\n&gt; &gt; around me.  I&#39;ll let you guys know if I get anything. :)\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;Kristin&quot; ckmorris95@ wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; So here&#39;s my run-down of responses for the past week ;-):\n&gt; &gt; &gt;\n&gt; &gt; &gt; Frank S: Congrats on franken out the 469 to your liking!\n&gt; &gt; &gt;\n&gt; &gt; &gt; I did hear most of everyone&#39;s files posted:  Urkle and Bruce&#39;s wer\n&gt; &gt; &gt; most clear.\n&gt; &gt; &gt;\n&gt; &gt; &gt; KATHYWEIR:  Audacity is free - google it.\n&gt; &gt; &gt;\n&gt; &gt; &gt; NATHAN:  Whatever you believe is okay.  Opinions make the world go\n&gt; &gt; &gt; round.  If you are open and want to learn more than welcome.\n&gt; &gt; &gt;\n&gt; &gt; &gt; JULI - WHATS UP GIRL!!!  I have been hanging upside down - out my\n&gt; &gt; &gt; window and about to throw up a ladder and sit on my roof to get\n&gt; better\n&gt; &gt; &gt; reception!!!  I have run out of tinfoil... can you spare some?\n&gt; &gt; &gt;\n&gt; &gt; &gt; AL from o&#39;BAMA:  I too always get contradicting answers.  Just\n&gt; &gt; &gt; yesterday I was cleaning my pool and listening to my 470 and I heard\n&gt; &gt; &gt; them say &quot;SHE&#39;S USING US FOR ENTERTAINMENT&quot;  I replied that I was\n&gt; &gt; &gt; trying to get experience &#39;hearing&#39;.  I heard THAT&#39;S GOOD&quot; and I also\n&gt; &gt; &gt; heard &quot;BITCH LEAVE&quot;.  I apologized if they felt I was intruding and\n&gt; &gt; &gt; asked if they wanted me to shut down or just the DH&#39;s wanted me too.\n&gt; &gt; &gt; I heard &quot;BOTH&quot; and I heard &quot;NO DON&#39;T&quot;.  Who do I choose to listen\n&gt; to?\n&gt; &gt; &gt;  I stayed on for a bit longer - I always err on the side of\n&gt; positive.\n&gt; &gt; &gt;  If I&#39;m looking for answers to important personal stuff.. I wouldn&#39;t\n&gt; &gt; &gt; ask the box for answers.  PS:  I once asked if they could read my\n&gt; mind\n&gt; &gt; &gt; and they responded with &quot;OF COURSE NOT&quot; and then proceeded to answer\n&gt; &gt; &gt; my next question before I asked!  Go figure :-)\n&gt; &gt; &gt;\n&gt; &gt; &gt; RHONDA - Are you hearing voice girl???  I knew it!  You&#39;re as crazy\n&gt; as\n&gt; &gt; &gt; me!!!  LOL...  I think that&#39;s cool.\n&gt; &gt; &gt;\n&gt; &gt; &gt; REES:  I really do believe your lost session was very cool.  I don&#39;t\n&gt; &gt; &gt; believe it&#39;s loss was a coincidence.\n&gt; &gt; &gt;\n&gt; &gt; &gt; BRUCE:  Cool pictures in the Photos Section.  Have you ever thought\n&gt; &gt; &gt; about doing a BOX session and a Photo session at the same time and\n&gt; see\n&gt; &gt; &gt; if you could get a photograph of the person talking??  That would be\n&gt; &gt; &gt; an interesting experiement.\n&gt; &gt; &gt;\n&gt; &gt; &gt; MARGARET:  Your knowledge is so emense!  I am grateful you are here\n&gt; &gt; &gt; with us to share.\n&gt; &gt; &gt;\n&gt; &gt; &gt; ANNETTE:  Congrats on your son&#39;s wedding!\n&gt; &gt; &gt;\n&gt; &gt; &gt; JOEL:  The news item you posted is disturbing on so many levels.  I\n&gt; &gt; &gt; just pray that the universe works it out so that karma is indeed\n&gt; &gt; &gt; something that these people will have to deal with.  Nothing is\n&gt; sacred\n&gt; &gt; &gt; anymore it seems...\n&gt; &gt; &gt;\n&gt; &gt; &gt; AARON:  C O N G R A T U L A T I O N S !!  On your first successful\n&gt; &gt; &gt; session.  You&#39;re hooked and welcome aboard the crazy train ;-)\n&gt; &gt; &gt;\n&gt; &gt; &gt; VINNIE:  CONGRATS TO YOU TOO!  Do you want us to call your Dave or\n&gt; &gt; &gt; Vinnie?\n&gt; &gt; &gt;\n&gt; &gt; &gt; RON L:  I asked about Austism for you and I heard :&quot;MAN MADE&quot; and\n&gt; when\n&gt; &gt; &gt; I asked about vaacines I heard &quot;YES..&quot;  I will work on trying to get\n&gt; &gt; &gt; these files online.  But I have so much to go through...  I think I\n&gt; &gt; &gt; will be listening for about a week...\n&gt; &gt; &gt;\n&gt; &gt; &gt; whew... i missed you all..\n&gt; &gt; &gt; k\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}