{"id": "960", "subject": "to frank and dave, in particular,re: touch, circuit Q, etc", "author": "kenneth b thomas", "timestamp": "2007-03-30T18:53:57Z", "full_text": "the isuue of touch goes to the narrowness of optimum bandwidth\n\n\nit takes brains , youth, and steady nerves to solve that problem\n\nyou dont have to; i already did it.\n\n\nincidentally the british guy on franks most recent one is a regular.  \nhis voice is highly distinctive and he tends to show up when people \nstart getting serious.  you are to the state-of-art where you should \nexpect to get voices of living persons too.  also cryptic comments from \nerudite, hypereducated types who are in fact , a subculture of advanced \nhumans who have a very low opinion of the rest of us.\n\n\nthe narrowness of the tuning is so fantastic that the best way for \nunskilled person to noyice that &quot;something&quot; is there is by daves linear \nsweep.  forget about shannons info theory; full, hi-fi can be obtained \nthru a very narrow 10hz channel.  this is by internal bending of \nphotons, which has been underpinned by orthodoxy only in the last few \nweeks; 2 slit experiment has been seriously modified.\n\nTOUCH OR NON-YOUCH?\n\nits non-touch-- the observer has no effect whatsoever.\n\nBUT   adjustments are different and must be agonizingly exact, moving \ntiny wires a millimeter with an acrylic rod 10 ft long.\n\nfor practical matters, at present, KEEP THE TOUCH PLATE IN, makes \nroutine tuning easier.\n\n\nfor the future:  only permeability, inductive, magnet tuning can be made \nhigh enough in Q.  Q must be derived from REACTION ; merely inserting \n30000 Q crystal does absolutely nothing. \n\ngood example of mutual inductance of two critically coupled coils.\nfor etheric radio, this is grossly overcoupled.  only way to critically \ncouple etheric is to bring coils to normal critical coupling the \nGRADUALLY  separate them a little more.  this can take DAYS.  the \natmosphere space-time fabric around receiver has to be gradually \nconditioned.\n\nmore later if you want. and only if you want.  i dont have extra breath \nto waste.\n\nyour fellow purple fan,\n\nkt"}