{"id": "9614", "subject": "Re:First SuCcessful Recordings - Nathan re: Hoax", "author": "v1230mail", "timestamp": "2008-04-14T00:57:54Z", "full_text": "I HAVE NEVER USED THE BOX, I MADE A REQUEST TO ITCDEADPEOPLE TO SED ME\nONE.\ni WANT TO EXPERIMENT WITH IT, SOUNDS EXCITING.\n\n\n\n--- In EVP-ITC@yahoogroups.com, &quot;itcdeadpeople&quot; &lt;ITCdeadpeople@...&gt; wrote:\n&gt;\n&gt; Hi Nathan.  I always look to relevance as a key in determining\nwhether or not something is \n&gt; appropriate to the session.  If this were a hoax, I would then have\nto seek an explanation \n&gt; for how private information is known by the &#39;hoax perp&#39;,\nparticularly information that \n&gt; would require visual awareness.  \n&gt; \n&gt; Some of us have examples of appropriate responses being given when\nasking things like, \n&gt; &quot;Can you name something nearby me?&quot; or &quot;Please tell me what I&#39;m\nholding in my left \n&gt; hand.&quot;  A sophisticated multi-transmission two way radio would not\nexplain answers \n&gt; which require &#39;visual&#39; information of some kind (though I&#39;ll be the\nfirst to admit my \n&gt; understanding of electronics is limited but I&#39;m fairly confident on\nthis aspect.) \n&gt; \n&gt; Of course, there is always the chance that the person running the\nhoax is also, or in \n&gt; partnership with, an extremely talented remote viewer or psychic who\nis able to glean that \n&gt; visual information from the ether or the mind of the experimenter.  \n&gt; \n&gt; And what of those examples where people have confirmed the sound of\nthe voice being \n&gt; &quot;just like&quot; that of their loved one in spirit?  Surely the hoaxer\nisn&#39;t also able to mimic \n&gt; people&#39;s loved ones.\n&gt; \n&gt; If you are using EVP Maker with anything other than the allophones\nfile, which contains no \n&gt; words to begin with, you are also running the possibility of &#39;false\npositives&#39; albeit they \n&gt; wouldn&#39;t be from a hoax.  Again, I look to relevance to be key, and\nrelevant info that \n&gt; would not come easily to a stranger is even better.  \n&gt; \n&gt; For example, I turned on my MiniBox for the very first time and\nsaid, &quot;Hello?&quot; and \n&gt; immediately received the response, &quot;Hello Margaret.&quot;  If this were a\nhoax, how could that \n&gt; person know in less than 10 seconds, who I was by name.  I had not\ngiven this information \n&gt; out.  Not to mention that you have people experimenting 24/7 and\nreceiving similar \n&gt; responses.  How in the world could an organization have the\nmanpower, technology, or \n&gt; even the desire, to attempt such a hoax?  I mean that as a genuine\ninquiry, because there \n&gt; might be an explanation I have not thought of.  \n&gt; \n&gt; I have one example where, via radio sweep, my communicator was able\nto correctly \n&gt; identify the status and location of a missing person (who it turns\nout was alive and well, so \n&gt; we ended up with confirmation that the info given had indeed been\ncorrect - which is \n&gt; much less complicated that trying to track and understand the clues\nwhen associated with \n&gt; the dead, or missing but not found.)  Again, if a hoax, would that\nhave simply been a \n&gt; lucky guess on the part of the hoaxer?\n&gt; \n&gt; Bottom line for me is ... have I wondered if it could be a hoax?  Or\nsimply a fortuitous \n&gt; tuning of the dial?  Yes, on both accounts.  But there is enough\ncompelling evidence to rule \n&gt; out both of them as an explanation for the far too many relevant\nexamples received by so \n&gt; many of us.\n&gt; \n&gt; Good food for thought, but after digesting it, I&#39;d have to say, &quot;No,\na sophisticated hoax \n&gt; does not sufficiently explain the phenomena on a large scale.&quot;\n&gt; \n&gt; Margaret\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Nathan Sharman &lt;v1230mail@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Has it ever occurred to you, that some one or\n&gt; &gt; organisation, could be using a radio to say the things\n&gt; &gt; you heard?\n&gt; &gt; \n&gt; &gt; This whole radio and spirit voices, could be a MASSIVE\n&gt; &gt; HOAX, perpetuated by some one with a sophisticated\n&gt; &gt; multi-transmission two way radio.\n&gt; &gt; \n&gt; &gt; Think about it.\n&gt; &gt; \n&gt; &gt; THAT IS WHY I USE EVPmaker only to commuincate with\n&gt; &gt; the other dimension.\n&gt; &gt; \n&gt; &gt; __________________________________________________\n&gt; &gt; Do You Yahoo!?\n&gt; &gt; Tired of spam?  Yahoo! Mail has the best spam protection around \n&gt; &gt; http://mail.yahoo.com\n&gt; &gt;\n&gt;"}