{"id": "9617", "subject": "Re:Hearing Your Name Called Outloud.", "author": "v1230mail", "timestamp": "2008-04-14T01:20:08Z", "full_text": "HI,\n\nMY FRIEND YOU NEED TO INVESTIGATE &quot;ARTICLE 8&quot; ASK THE SPIRITS TO TO\nTELL YOU IN DETAIL WHAT &quot;ARTICLE 8&quot; MEANS AND SAYS.\n\nFolks this is what I call true RESEARCH getting information from the\nother side, so we can understand the TRUE political aspect of their\nexistence etc. on the other side.\n\nOur Human spirits may not be exploited in the EARTH sense, yet their\nis a sense of being taken advantage of because of our ignorance of the\nother dimension and how it works, understanding the physics and all.\n\nI READ IN ROBERT MONROE BOOKS ABOUT &quot;LOUSH&quot; a form of energy that is\nharvested from our souls. I cannot say more about that because of\nignorance, except what Monroe wrote about.\n\nAs for qualified Scientists, YOU GET THE BEEF THEY WILL COME. In order\nwords get the evidence and show it to those who are interested. LIKE\nFINDING OUT IN DETAIL WHAT &quot;ARTICLE 8&quot; means.\n\nALSO WHY NOT GIVE A SCIENTIST FRIEND A BOX to play with? IF you have\nan old Physics Professor, or acquaintance give them a box, tell them   \nhow to use it, and then ask them their opinions about the results\nobtained.  \n\nI WILL SAY FROM MY READINGS THE UNITED STATES GOVERNMENT HAS A NUMBER\nOF BLACK PROJECTS DEALING WITH HIGH ENERGY PHYSICS, and one of those\nprojects deals with the Astral, the soul etc. BUT THE SHAME IS, IT IS\nALL KEPT IN  SECRET.\n\nNow the Indian Mystics talk about BEINGS in the Astral planes that\nwant our souls, because our souls are IMMORTAL, and these BEINGS ARE\nNOT IMMORTAL they truly die in a few thousand years.. How they use our\nsouls to attain Immortality I do not know. \n\n\n--- In EVP-ITC@yahoogroups.com, &quot;itcdeadpeople&quot; &lt;ITCdeadpeople@...&gt; wrote:\n&gt;\n&gt; Hi Nathan.  I have taken Monroe&#39;s &quot;Gateway Experience&quot; course.  :-)\n&gt; \n&gt; I have long observed there seems to be subjects that aren&#39;t open for\ndiscussion, and was \n&gt; recently told via EVPMaker/allophones that such restrictions fall\nunder something called \n&gt; &quot;Article 8.&quot;\n&gt; \n&gt; I have not gathered any indications, personally, that we are being\nexploited.  I have always \n&gt; taken this lack of information to be similar to that of an adult,\nwho does not share with \n&gt; children, material that is age inappropriate.  In this case, WE\nhumans are the children of \n&gt; the universe.\n&gt; \n&gt; What is your definition of &quot;serious research&quot; and how do you suggest\nwe enlist of the aid \n&gt; of QUALIFIED scientists who, for the most part, are not willing to\nhave their reputations \n&gt; tarnished by associating themselves with such research?\n&gt; \n&gt; Margaret\n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Nathan Sharman &lt;v1230mail@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hi read books by Robert Monroe.\n&gt; &gt; \n&gt; &gt; He had the ability to travel out of the body and go to\n&gt; &gt; the Astral.\n&gt; &gt; \n&gt; &gt; There are Technologically advanced Aliens that seem to\n&gt; &gt; control the political situation in the Astral planes,\n&gt; &gt; and they do not want Earth humans to develop full\n&gt; &gt; communication with human spirits in the Astral.\n&gt; &gt; \n&gt; &gt; WE HUMANS ARE BEING EXPLOITED IN THE ASTRAL PLANES,\n&gt; &gt; that is why when communications are going good, all of\n&gt; &gt; a sudden you no longer hear from the spirit any more,\n&gt; &gt; THAT IS BECAUSE THE SPIRIT WAS FORBIDDEN to\n&gt; &gt; communicate further.\n&gt; &gt; \n&gt; &gt; WE NEED TO START DOING SERIOUS RESEARCH AND NOT GET\n&gt; &gt; ALL EXCITED TO JUST HEAR VOICES.\n&gt; &gt; \n&gt; &gt; WE also need to study the physics involved, this is\n&gt; &gt; high energy physics.\n&gt; &gt; \n&gt; &gt; __________________________________________________\n&gt; &gt; Do You Yahoo!?\n&gt; &gt; Tired of spam?  Yahoo! Mail has the best spam protection around \n&gt; &gt; http://mail.yahoo.com\n&gt; &gt;\n&gt;"}