{"id": "9622", "subject": "Re:First SuCcessful Recordings - Nathan re: Hoax", "author": "v1230mail", "timestamp": "2008-04-14T02:17:06Z", "full_text": "HI, \nEDWARDS\n\nNO I AM A HEALTHY SKEPTIC, AND I DO PLAY WITH EVPmaker.\n\nI WANT TO EXPERIMENT WITH THE BOX, MAYBE YOU WOULD BE SO KIND TO SEND\nME ONE? MY ADDRESS IS \n\nNATHAN SHARMAN\nP.O. BOX 1022, \nBELLAIRE, TX 77402.\n\nIF YOU WANT TO CHARGE ME FOR THE EXPENSE, KINDLY LET ME KNOW THE PRICE\nAND I WILL LET YOU KNOW IF I CAN AFFORD IT.\n\nI REALLY WANT TO EXPERIMENT WITH THE BOX.\n\nNOW DOES EVERY ONE WHO USES A BOX GET A RESPONSE?\n\nBY THE WAY I DO INTEND TO SERIOUS RESEARCH ON THIS WHEN I HAVE THE\nMONEY TO DO IT FULL TIME.\n\n\n--- In EVP-ITC@yahoogroups.com, Michael Edwards &lt;f1cracker75@...&gt; wrote:\n&gt;\n&gt; I just did an internet search on this guy, and he is associated with\nthis site. \nhttp://www.www.godlikeproductions.com/bbs/reply.php?messageid=176430&page=4&quote=2106467\n&gt;    \n&gt;   I never thought a skeptic would join our group.  Oh well. I agree\nwith you. Thanks\n&gt; \n&gt; juli velazquez &lt;ghostchasingfool@...&gt; wrote:\n&gt;             Michael:\n&gt;                There are always going to be skeptics where we go. \nAs long as we say true to ourselves as well as our data, that is all\nthat matters.  I have come to understand within the past 8 years that\nI have nothing to prove to anyone, but myself.  We have all come to\nEVP-ITC communication for various reason, and I need no one to prove\nto me life after death is there.\n&gt;    \n&gt;                When people throw the box at me, I usually have a\ngreat response, but its comes a time that I just say, don&#39;t knock it\ntill you try it and ignore their rambling given their difference in\nbeliefs.\n&gt; \n&gt;                 See, if you look at it that we are the blessed ones\nwho in fact do have the ability to receive two way communication on a\ngreater level, than I am the one that is grateful for being able to\nopen my mind and accept it.\n&gt;    \n&gt;   Just my thoughts!\n&gt;   Juli\n&gt; Michael Edwards &lt;f1cracker75@...&gt; wrote:\n&gt;         Nathan, I am amazed you would suggest or even think that!  I\nlive in Cary, North Carolina and record when I have the time. There is\nno set schedule, and when I turn my radio on and someone says hello\nMichael, or even shouts out &quot;Mike Edwards&quot;, or a spirit tells me I am\nholding a carving in my hand, who would even know I turned the radio\non? Only my wife knows I record, and we have kept this research from\nour children as well as our neighbors. So you are suggesting that\nMargaret, lets say who lives where I do not know, is playing a joke on\nme with a high tech two way radio?\n&gt;    \n&gt;   \n&gt; \n&gt; itcdeadpeople &lt;ITCdeadpeople@...&gt; wrote:\n&gt;       Hi Nathan. I always look to relevance as a key in determining\nwhether or not something is \n&gt; appropriate to the session. If this were a hoax, I would then have\nto seek an explanation \n&gt; for how private information is known by the &#39;hoax perp&#39;,\nparticularly information that \n&gt; would require visual awareness. \n&gt; \n&gt; Some of us have examples of appropriate responses being given when\nasking things like, \n&gt; &quot;Can you name something nearby me?&quot; or &quot;Please tell me what I&#39;m\nholding in my left \n&gt; hand.&quot; A sophisticated multi-transmission two way radio would not\nexplain answers \n&gt; which require &#39;visual&#39; information of some kind (though I&#39;ll be the\nfirst to admit my \n&gt; understanding of electronics is limited but I&#39;m fairly confident on\nthis aspect.) \n&gt; \n&gt; Of course, there is always the chance that the person running the\nhoax is also, or in \n&gt; partnership with, an extremely talented remote viewer or psychic who\nis able to glean that \n&gt; visual information from the ether or the mind of the experimenter. \n&gt; \n&gt; And what of those examples where people have confirmed the sound of\nthe voice being \n&gt; &quot;just like&quot; that of their loved one in spirit? Surely the hoaxer\nisn&#39;t also able to mimic \n&gt; people&#39;s loved ones.\n&gt; \n&gt; If you are using EVP Maker with anything other than the allophones\nfile, which contains no \n&gt; words to begin with, you are also running the possibility of &#39;false\npositives&#39; albeit they \n&gt; wouldn&#39;t be from a hoax. Again, I look to relevance to be key, and\nrelevant info that \n&gt; would not come easily to a stranger is even better. \n&gt; \n&gt; For example, I turned on my MiniBox for the very first time and\nsaid, &quot;Hello?&quot; and \n&gt; immediately received the response, &quot;Hello Margaret.&quot; If this were a\nhoax, how could that \n&gt; person know in less than 10 seconds, who I was by name. I had not\ngiven this information \n&gt; out. Not to mention that you have people experimenting 24/7 and\nreceiving similar \n&gt; responses. How in the world could an organization have the manpower,\ntechnology, or \n&gt; even the desire, to attempt such a hoax? I mean that as a genuine\ninquiry, because there \n&gt; might be an explanation I have not thought of. \n&gt; \n&gt; I have one example where, via radio sweep, my communicator was able\nto correctly \n&gt; identify the status and location of a missing person (who it turns\nout was alive and well, so \n&gt; we ended up with confirmation that the info given had indeed been\ncorrect - which is \n&gt; much less complicated that trying to track and understand the clues\nwhen associated with \n&gt; the dead, or missing but not found.) Again, if a hoax, would that\nhave simply been a \n&gt; lucky guess on the part of the hoaxer?\n&gt; \n&gt; Bottom line for me is ... have I wondered if it could be a hoax? Or\nsimply a fortuitous \n&gt; tuning of the dial? Yes, on both accounts. But there is enough\ncompelling evidence to rule \n&gt; out both of them as an explanation for the far too many relevant\nexamples received by so \n&gt; many of us.\n&gt; \n&gt; Good food for thought, but after digesting it, I&#39;d have to say, &quot;No,\na sophisticated hoax \n&gt; does not sufficiently explain the phenomena on a large scale.&quot;\n&gt; \n&gt; Margaret\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Nathan Sharman &lt;v1230mail@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Has it ever occurred to you, that some one or\n&gt; &gt; organisation, could be using a radio to say the things\n&gt; &gt; you heard?\n&gt; &gt; \n&gt; &gt; This whole radio and spirit voices, could be a MASSIVE\n&gt; &gt; HOAX, perpetuated by some one with a sophisticated\n&gt; &gt; multi-transmission two way radio.\n&gt; &gt; \n&gt; &gt; Think about it.\n&gt; &gt; \n&gt; &gt; THAT IS WHY I USE EVPmaker only to commuincate with\n&gt; &gt; the other dimension.\n&gt; &gt; \n&gt; &gt; __________________________________________________\n&gt; &gt; Do You Yahoo!?\n&gt; &gt; Tired of spam? Yahoo! Mail has the best spam protection around \n&gt; &gt; http://mail.yahoo.com\n&gt; &gt;\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Michael Edwards: Cary, North Carolina. f1cracker75@...  \n__________________________________________________\n&gt; Do You Yahoo!?\n&gt; Tired of spam? Yahoo! Mail has the best spam protection around \n&gt; http://mail.yahoo.com \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;     The contents of this eletronic correspondence is private &\nconfidential and meant only for the party and/or parties it is\naddressed to.  \n&gt;    \n&gt;   No part of this email transmission may be publicly posted or\nforwarded to other parties without explicit written permission.\n&gt; \n&gt;   \n&gt; \n&gt;                            \n&gt; \n&gt; \n&gt; Michael Edwards: Cary, North Carolina. f1cracker75@...\n&gt;  __________________________________________________\n&gt; Do You Yahoo!?\n&gt; Tired of spam?  Yahoo! Mail has the best spam protection around \n&gt; http://mail.yahoo.com\n&gt;"}