{"id": "9625", "subject": "Re: [EVP-ITC] Re: Nathan re: Hoax", "author": "kathyweir", "timestamp": "2008-04-14T02:29:24Z", "full_text": "everyone who has a  box has made their own\nKathy\n----- Original Message ----- \nFrom: &quot;v1230mail&quot; &lt;v1230mail@...&gt;\nTo: &lt;EVP-ITC@yahoogroups.com&gt;\nSent: Sunday, April 13, 2008 10:19 PM\nSubject: [EVP-ITC] Re: Nathan re: Hoax\n\n\n&gt; WHY ARE YOU CALLING ME A SKEPTIC? I GUESS YOU LIKE TO THROW AROUND\n&gt; LABELS AT EVERY ONE WHO HAS A QUESTION OR DOUBT? GROW UP PLEASE.\n&gt;\n&gt;\n&gt; -- In EVP-ITC@yahoogroups.com, bruce halliday\n&gt; &lt;paranormalinvestigating@...&gt; wrote:\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; Nathan,\n&gt;&gt;\n&gt;&gt; I suggest you read the headline and description of this group.\n&gt;&gt; We are a group of real time communication researchers that are\n&gt;&gt; continously seeking the truth. The founder of this board\n&gt;&gt; Mr. Frank Sumption has alway&#39;s made it clear that It is not a place\n&gt;&gt; for sceptics and they will not be tolerated. We are here to study and\n&gt;&gt; further real time soirit communication, not have to defend every post\n&gt;&gt; we make or file we add. I suggest you take your negative accusations\n&gt; and\n&gt;&gt; detrimental unfounded criticism and scepticism somewhere else.\n&gt;&gt;\n&gt;&gt; You are wearing your welcome thin here, not to mention within 5 posts\n&gt;&gt; you have contradicted yourself three times. and went from the\n&gt; philosophy\n&gt;&gt; of aliens enslaving human spirits to questioning any chance that\n&gt; this method\n&gt;&gt; of spirit communication could or does exist and is a conspiricy to\n&gt; fool unsuspecting\n&gt;&gt; people like us by means of a super transmitter.\n&gt;&gt;\n&gt;&gt; I have learned by experience to try and keep this type of post\n&gt; civil, So for any moderators that are reading this\n&gt;&gt; Please review the situation.\n&gt;&gt;\n&gt;&gt; Bruce Halliday\n&gt;&gt; Bruce Halliday\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; To: EVP-ITC@...: f1cracker75@...: Sat, 12 Apr 2008 19:24:11\n&gt; -0700Subject: Re: [EVP-ITC] Re:First SuCcessful Recordings - Nathan\n&gt; re: Hoax\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; Nathan, I am amazed you would suggest or even think that!  I live in\n&gt; Cary, North Carolina and record when I have the time. There is no set\n&gt; schedule, and when I turn my radio on and someone says hello Michael,\n&gt; or even shouts out &quot;Mike Edwards&quot;, or a spirit tells me I am holding a\n&gt; carving in my hand, who would even know I turned the radio on? Only my\n&gt; wife knows I record, and we have kept this research from our children\n&gt; as well as our neighbors. So you are suggesting that Margaret, lets\n&gt; say who lives where I do not know, is playing a joke on me with a high\n&gt; tech two way radio?\n&gt;&gt;\n&gt;&gt; itcdeadpeople &lt;ITCdeadpeople@...&gt; wrote:\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; Hi Nathan. I always look to relevance as a key in determining\n&gt; whether or not something is appropriate to the session. If this were a\n&gt; hoax, I would then have to seek an explanation for how private\n&gt; information is known by the &#39;hoax perp&#39;, particularly information that\n&gt; would require visual awareness. Some of us have examples of\n&gt; appropriate responses being given when asking things like, &quot;Can you\n&gt; name something nearby me?&quot; or &quot;Please tell me what I&#39;m holding in my\n&gt; left hand.&quot; A sophisticated multi-transmission two way radio would not\n&gt; explain answers which require &#39;visual&#39; information of some kind\n&gt; (though I&#39;ll be the first to admit my understanding of electronics is\n&gt; limited but I&#39;m fairly confident on this aspect.) Of course, there is\n&gt; always the chance that the person running the hoax is also, or in\n&gt; partnership with, an extremely talented remote viewer or psychic who\n&gt; is able to glean that visual information from the ether or the mind of\n&gt; the experimenter. And what of those examples where people have\n&gt; confirmed the sound of the voice being &quot;just like&quot; that of their loved\n&gt; one in spirit? Surely the hoaxer isn&#39;t also able to mimic people&#39;s\n&gt; loved ones.If you are using EVP Maker with anything other than the\n&gt; allophones file, which contains no words to begin with, you are also\n&gt; running the possibility of &#39;false positives&#39; albeit they wouldn&#39;t be\n&gt; from a hoax. Again, I look to relevance to be key, and relevant info\n&gt; that would not come easily to a stranger is even better. For example,\n&gt; I turned on my MiniBox for the very first time and said, &quot;Hello?&quot; and\n&gt; immediately received the response, &quot;Hello Margaret.&quot; If this were a\n&gt; hoax, how could that person know in less than 10 seconds, who I was by\n&gt; name. I had not given this information out. Not to mention that you\n&gt; have people experimenting 24/7 and receiving similar responses. How in\n&gt; the world could an organization have the manpower, technology, or even\n&gt; the desire, to attempt such a hoax? I mean that as a genuine inquiry,\n&gt; because there might be an explanation I have not thought of. I have\n&gt; one example where, via radio sweep, my communicator was able to\n&gt; correctly identify the status and location of a missing person (who it\n&gt; turns out was alive and well, so we ended up with confirmation that\n&gt; the info given had indeed been correct - which is much less\n&gt; complicated that trying to track and understand the clues when\n&gt; associated with the dead, or missing but not found.) Again, if a hoax,\n&gt; would that have simply been a lucky guess on the part of the\n&gt; hoaxer?Bottom line for me is ... have I wondered if it could be a\n&gt; hoax? Or simply a fortuitous tuning of the dial? Yes, on both\n&gt; accounts. But there is enough compelling evidence to rule out both of\n&gt; them as an explanation for the far too many relevant examples received\n&gt; by so many of us.Good food for thought, but after digesting it, I&#39;d\n&gt; have to say, &quot;No, a sophisticated hoax does not sufficiently explain\n&gt; the phenomena on a large scale.&quot;Margaret--- In\n&gt; EVP-ITC@yahoogroups.com, Nathan Sharman &lt;v1230mail@&gt; wrote:&gt;&gt; Has it\n&gt; ever occurred to you, that some one or&gt; organisation, could be using a\n&gt; radio to say the things&gt; you heard?&gt; &gt; This whole radio and spirit\n&gt; voices, could be a MASSIVE&gt; HOAX, perpetuated by some one with a\n&gt; sophisticated&gt; multi-transmission two way radio.&gt; &gt; Think about it.&gt; &gt;\n&gt; THAT IS WHY I USE EVPmaker only to commuincate with&gt; the other\n&gt; dimension.&gt; &gt; __________________________________________________&gt; Do\n&gt; You Yahoo!?&gt; Tired of spam? Yahoo! Mail has the best spam protection\n&gt; around &gt; http://mail.yahoo.com&gt;Michael Edwards: Cary, North Carolina.\n&gt; f1cracker75@...\n&gt;&gt; __________________________________________________Do You\n&gt; Yahoo!?Tired of spam? Yahoo! Mail has the best spam protection around\n&gt; http://mail.yahoo.com\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; _________________________________________________________________\n&gt;&gt; More immediate than e-mail? Get instant access with Windows Live\n&gt; Messenger.\n&gt;&gt;\n&gt; http://www.windowslive.com/messenger/overview.html?ocid=TXT_TAGLM_WL_Refresh_instantaccess_042008\n&gt;&gt;\n&gt;\n&gt;\n&gt;\n&gt; ------------------------------------\n&gt;\n&gt; Yahoo! Groups Links\n&gt;\n&gt;\n&gt;"}