{"id": "9626", "subject": "Re: Nathan re: Hoax", "author": "v1230mail", "timestamp": "2008-04-14T02:26:35Z", "full_text": "THANKS FOR YOUR HEALTHY VIEW ON THINGS.\n\nAT LEAST YOU DID NOT THROW LABELS AT ME, JUST FOR QUESTIONING A METHOD\nUSED. THANKS FOR THAT.\n\nI WANT THE TRUTH TOO, AND THE ONLY WAY TO GET THAT IS THROUGH  RESEARCH.\n\nONE DOES NOT HAVE TO BE A BELIEVER TO OBSERVE FACTS, PLEASE REMEMBER\nTHAT. SPIRIT VOICES ARE REAL, BUT WHAT ARE THEY? SPIRITS? YOUR OWN\nSUBCONSCIOUS MIND? RESEARCH WILL PROVE IT ONE WAY OR THE OTHER.\n\n&quot;&gt; The question brought up some good responses from you guys. Let&#39;s \n&gt; leave it at that and move on =)&quot;\n\nYOU CALL THROWING LABELS ON SOME ONE A GOOD RESPONSE? I THINK NOT.\n\n-- In EVP-ITC@yahoogroups.com, &quot;Misty&quot; &lt;bulletbabea@...&gt; wrote:\n&gt;\n&gt; Opinions...everyone has the right to have them. The great thing is \n&gt; nobody has to agree with me on any given subject and vice versa =)\n&gt; \n&gt; Bruce is correct that this group is founded on the belief the voices \n&gt; do exist.... as to who is on the other end well even the people here \n&gt; seem to have formed thier own ideas on that. Some based on beliefs \n&gt; some based on research some based on instinct, some just thought it \n&gt; up while watching a tv show that led them to join here. Others have \n&gt; decided it doesnt matter who what when where why or how it is being \n&gt; done, just the fact it is happening is enough to keep their interest. \n&gt; Not everyone that joins here is a believer. But everyone that joins \n&gt; here is curious and hopefully want to learn more.\n&gt; \n&gt; I have actually heard this question/idea stated before and \n&gt; rementioned recently on a talk show dealing with ufo/government \n&gt; technology. It was only mentioned as possibility and mentions of \n&gt; conducted experiments that were used on people.\n&gt; \n&gt; Look around you. The world as we see it is indeed a matrix, a peice \n&gt; of a peice of a peice of a much larger puzzle. In my own ITC many do \n&gt; not claim to be or ever have been a &quot;human&quot; some do not even have \n&gt; names/labels until they are given one.\n&gt; \n&gt; The question brought up some good responses from you guys. Let&#39;s \n&gt; leave it at that and move on =)\n&gt; \n&gt; Misty \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, bruce halliday \n&gt; &lt;paranormalinvestigating@&gt; wrote:\n&gt; &gt;\n&gt; &gt; \n&gt; &gt; Nathan, \n&gt; &gt;  \n&gt; &gt; I suggest you read the headline and description of this group.\n&gt; &gt; We are a group of real time communication researchers that are \n&gt; &gt; continously seeking the truth. The founder of this board \n&gt; &gt; Mr. Frank Sumption has alway&#39;s made it clear that It is not a place \n&gt; &gt; for sceptics and they will not be tolerated. We are here to study \n&gt; and \n&gt; &gt; further real time soirit communication, not have to defend every \n&gt; post \n&gt; &gt; we make or file we add. I suggest you take your negative \n&gt; accusations and \n&gt; &gt; detrimental unfounded criticism and scepticism somewhere else. \n&gt; &gt;  \n&gt; &gt; You are wearing your welcome thin here, not to mention within 5 \n&gt; posts \n&gt; &gt; you have contradicted yourself three times. and went from the \n&gt; philosophy \n&gt; &gt; of aliens enslaving human spirits to questioning any chance that \n&gt; this method \n&gt; &gt; of spirit communication could or does exist and is a conspiricy to \n&gt; fool unsuspecting\n&gt; &gt; people like us by means of a super transmitter.\n&gt; &gt;  \n&gt; &gt; I have learned by experience to try and keep this type of post \n&gt; civil, So for any moderators that are reading this \n&gt; &gt; Please review the situation.\n&gt; &gt;  \n&gt; &gt; Bruce Halliday\n&gt; &gt; Bruce Halliday \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; To: EVP-ITC@: f1cracker75@: Sat, 12 Apr 2008 19:24:11 -\n&gt; 0700Subject: Re: [EVP-ITC] Re:First SuCcessful Recordings - Nathan \n&gt; re: Hoax\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; Nathan, I am amazed you would suggest or even think that!  I live \n&gt; in Cary, North Carolina and record when I have the time. There is no \n&gt; set schedule, and when I turn my radio on and someone says hello \n&gt; Michael, or even shouts out &quot;Mike Edwards&quot;, or a spirit tells me I am \n&gt; holding a carving in my hand, who would even know I turned the radio \n&gt; on? Only my wife knows I record, and we have kept this research from \n&gt; our children as well as our neighbors. So you are suggesting that \n&gt; Margaret, lets say who lives where I do not know, is playing a joke \n&gt; on me with a high tech two way radio?\n&gt; &gt;  \n&gt; &gt; itcdeadpeople &lt;ITCdeadpeople@&gt; wrote:\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; Hi Nathan. I always look to relevance as a key in determining \n&gt; whether or not something is appropriate to the session. If this were \n&gt; a hoax, I would then have to seek an explanation for how private \n&gt; information is known by the &#39;hoax perp&#39;, particularly information \n&gt; that would require visual awareness. Some of us have examples of \n&gt; appropriate responses being given when asking things like, &quot;Can you \n&gt; name something nearby me?&quot; or &quot;Please tell me what I&#39;m holding in my \n&gt; left hand.&quot; A sophisticated multi-transmission two way radio would \n&gt; not explain answers which require &#39;visual&#39; information of some kind \n&gt; (though I&#39;ll be the first to admit my understanding of electronics is \n&gt; limited but I&#39;m fairly confident on this aspect.) Of course, there is \n&gt; always the chance that the person running the hoax is also, or in \n&gt; partnership with, an extremely talented remote viewer or psychic who \n&gt; is able to glean that visual information from the ether or the mind \n&gt; of the experimenter. And what of those examples where people have \n&gt; confirmed the sound of the voice being &quot;just like&quot; that of their \n&gt; loved one in spirit? Surely the hoaxer isn&#39;t also able to mimic \n&gt; people&#39;s loved ones.If you are using EVP Maker with anything other \n&gt; than the allophones file, which contains no words to begin with, you \n&gt; are also running the possibility of &#39;false positives&#39; albeit they \n&gt; wouldn&#39;t be from a hoax. Again, I look to relevance to be key, and \n&gt; relevant info that would not come easily to a stranger is even \n&gt; better. For example, I turned on my MiniBox for the very first time \n&gt; and said, &quot;Hello?&quot; and immediately received the response, &quot;Hello \n&gt; Margaret.&quot; If this were a hoax, how could that person know in less \n&gt; than 10 seconds, who I was by name. I had not given this information \n&gt; out. Not to mention that you have people experimenting 24/7 and \n&gt; receiving similar responses. How in the world could an organization \n&gt; have the manpower, technology, or even the desire, to attempt such a \n&gt; hoax? I mean that as a genuine inquiry, because there might be an \n&gt; explanation I have not thought of. I have one example where, via \n&gt; radio sweep, my communicator was able to correctly identify the \n&gt; status and location of a missing person (who it turns out was alive \n&gt; and well, so we ended up with confirmation that the info given had \n&gt; indeed been correct - which is much less complicated that trying to \n&gt; track and understand the clues when associated with the dead, or \n&gt; missing but not found.) Again, if a hoax, would that have simply been \n&gt; a lucky guess on the part of the hoaxer?Bottom line for me is ... \n&gt; have I wondered if it could be a hoax? Or simply a fortuitous tuning \n&gt; of the dial? Yes, on both accounts. But there is enough compelling \n&gt; evidence to rule out both of them as an explanation for the far too \n&gt; many relevant examples received by so many of us.Good food for \n&gt; thought, but after digesting it, I&#39;d have to say, &quot;No, a \n&gt; sophisticated hoax does not sufficiently explain the phenomena on a \n&gt; large scale.&quot;Margaret--- In EVP-ITC@yahoogroups.com, Nathan Sharman \n&gt; &lt;v1230mail@&gt; wrote:&gt;&gt; Has it ever occurred to you, that some one or&gt; \n&gt; organisation, could be using a radio to say the things&gt; you heard?&gt; &gt; \n&gt; This whole radio and spirit voices, could be a MASSIVE&gt; HOAX, \n&gt; perpetuated by some one with a sophisticated&gt; multi-transmission two \n&gt; way radio.&gt; &gt; Think about it.&gt; &gt; THAT IS WHY I USE EVPmaker only to \n&gt; commuincate with&gt; the other dimension.&gt; &gt; \n&gt; __________________________________________________&gt; Do You Yahoo!?&gt; \n&gt; Tired of spam? Yahoo! Mail has the best spam protection around &gt; \n&gt; http://mail.yahoo.com&gt;Michael Edwards: Cary, North Carolina. \n&gt; f1cracker75@ \n&gt; &gt; __________________________________________________Do You Yahoo!?\n&gt; Tired of spam? Yahoo! Mail has the best spam protection around \n&gt; http://mail.yahoo.com  \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; _________________________________________________________________\n&gt; &gt; More immediate than e-mail? Get instant access with Windows Live \n&gt; Messenger.\n&gt; &gt; http://www.windowslive.com/messenger/overview.html?\n&gt; ocid=TXT_TAGLM_WL_Refresh_instantaccess_042008\n&gt; &gt;\n&gt;"}