{"id": "9627", "subject": "Re: for Nathan Sharman", "author": "v1230mail", "timestamp": "2008-04-14T02:31:13Z", "full_text": "THANKS FOR YOUR KIND REPLY, AT LEAST YOU HAVE THE GOOD MANNERS NOT TO\n THROW LABELS AT ME.\n\nI HAVE NEVER EXPERIMENTED WITH THE BOX AND WOULD MOST CERTAINLY LIKE\nTO ACQUIRE ONE FOR TO HEAR THE VOICES SPEAK TO ME, I PLAN TO RECORD IT\nON MY COMPUTER SO I CAN DOWNLOAD AND SHARE IT.\n\nCAN YOU BE SO KIND TO SEND ME A WORKING BOX ?\n\nMY ADDRESS IS \n\nNATHAN SHARMAN\nP.O. BOX 1022, \nBELLAIRE, TEXAS 77402.\n\n--- In EVP-ITC@yahoogroups.com, bruce halliday\n&lt;paranormalinvestigating@...&gt; wrote:\n&gt;\n&gt; \n&gt; Nathan,\n&gt;  \n&gt; I do very extensive and detailed box research and including myself\nthere \n&gt; are probably three other researchers in this field right now that\nhave an \n&gt; equal amount of experience, Steve Hultay is one of them.\n&gt;  \n&gt; I have never received a message , phrase or answer to a question\nthat would lead me to the \n&gt; theory that aliens control the astral plane. and human spirits are\nno more than slaves.\n&gt;  \n&gt; As a matter of fact I have gotten numerous messages to the contrary.\nThat spirit world is a beautiful\n&gt; and serene place where there is no pain and suffering. I have also\ngotten messages pertaining to there\n&gt; being a spirit plane that exists on a lower level, between physical\nand spiritual. This may be the realm you are referring to.\n&gt;  \n&gt; I strive every day to advance the research and communication as I\nknow other researchers do, if there is a method, \n&gt; technique or new technology that we are not utilizing and you have\nknowledge of please share it with us.\n&gt;  \n&gt; Like Steve I would be very interested in hearing your audio files.\n&gt; And it is a pleasure to make your acquaintance.\n&gt;  \n&gt; Bruce\n&gt; Bruce Halliday \n&gt; \n&gt; \n&gt; To: EVP-ITC@...: v1230mail@...: Sat, 12 Apr 2008 14:11:30\n-0700Subject: [EVP-ITC] Re:Hearing Your Name Called Outloud.\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; Hi read books by Robert Monroe.He had the ability to travel out of\nthe body and go tothe Astral.There are Technologically advanced Aliens\nthat seem tocontrol the political situation in the Astral planes,and\nthey do not want Earth humans to develop fullcommunication with human\nspirits in the Astral.WE HUMANS ARE BEING EXPLOITED IN THE ASTRAL\nPLANES,that is why when communications are going good, all ofa sudden\nyou no longer hear from the spirit any more,THAT IS BECAUSE THE SPIRIT\nWAS FORBIDDEN tocommunicate further.WE NEED TO START DOING SERIOUS\nRESEARCH AND NOT GETALL EXCITED TO JUST HEAR VOICES.WE also need to\nstudy the physics involved, this ishigh energy\nphysics.__________________________________________________Do You\nYahoo!?Tired of spam? Yahoo! Mail has the best spam protection around\nhttp://mail.yahoo.com  \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; _________________________________________________________________\n&gt; Going green? See the top 12 foods to eat organic.\n&gt;\nhttp://green.msn.com/galleries/photos/photos.aspx?gid=164&ocid=T003MSN51N1653A\n&gt;"}