{"id": "9629", "subject": "THE VERY REAL DANGERS-of Operating SPIRICOM-type equipment-INCLUDING BOXES", "author": "v1230mail", "timestamp": "2008-04-14T03:01:15Z", "full_text": "FOLKS THIS IS NOT COMING FROM ME BUT FROM THE PIONEER, BUT FROM DR.\nMEEKS HIMSELF. HERE IS THE LINK. PLEASE FOLLOW HIS WARNINGS.\n\nhttp://www.worlditc.org/h_07_meek_spiri_082_089.htm\n\nCHAPTER 13\n\nTHE VERY REAL DANGERS\n(of Operating SPIRICOM-type equipment)\n\n1. Dangers which could be encountered by individual researchers\n\nUnder no circumstances do we want to encourage any enthusiastic reader\nor potential researcher to start out in this field without the\ninformation in the next few paragraphs.\n\nAs was pointed out earlier, science now knows that everything in the\ncosmos is one or more forms of energy in motion. Some energy is\nbeneficial to Man and some is harmful. X-rays for example, in small\nand carefully controlled amounts, can be of great help to Man, but in\ntoo great a concentration can destroy tissue, entire organs and even\nthe whole body. Ultra-violet light is highly beneficial to Man and\nplants, but certain wavelengths of UV can kill not only bacteria, but\nalso plants and even people. (In 1978 in our laboratory in Ft. Myers,\nFlorida, we were experimenting photographically with different\nwavelengths of UV light. After an exposure of only a few minutes at\none of the wavelengths we were using, all of our lovely 3-year-old ivy\nplants and philodendron were killed and the green leaves became as\nblack as carbon.)\n\nOn the 11&quot; x 17&quot; diagram, &quot;In Our Father&#39;s House There are Many\nMansions,&quot; please note near the left margin the vertical arrow which\nreads, &quot;MATTER (Energy) at progressively HIGHER rates of vibrations or\nfrequencies.&quot; In this diagram the energies which make up the minerals\nand water of the earth are at the bottom, (the lowest vibrational\nlevel). Man and all other living creatures and life forms on the\nsurface of the earth are composed of bodies which contain essentially\nthe same minerals and water, but in addition, they have consciousness\nwhich represents a higher rate of vibration.\n\nThe lowest astral planes shown in the above-mentioned diagram contain\npersons who have shed their mineral and water bodies and exist as\ntheir individual consciousness. Hence they are not suddenly allwise.\nThey know absolutely nothing of the &quot;worlds&quot; that exist above them.\nThey, for the most part, are truly &quot;lost&quot; and many do not even know\nthat they are dead! Many of them are desperate to get back into their\nold physical body. Some of the poor souls are filled with the\nstrongest of physical lusts and desires for alcohol or other drugs.\nThey may make a serious effort to continue their indulgence by finding\nsome person whose energy field is enough like theirs that they can be\nmerged. This is the basis for obsession.\n\nAlthough present-day psychiatry does not yet recognize it, we feel\nreasonably certain that at least 25% of the patients in our mental\nasylums are, in part, the victims of such unwanted intrusion into\ntheir individual consciousness by entities on the lowest astral planes.\n\n[We do not condemn psychiatry for this lack of understanding. It is\nonly in the last few years that Man has gained the understanding that\nthe mind is non-physical, that it is, in fact, an energy field, and\nthat it can, and in some cases does, occupy a body other than that for\nwhich it was intended. Fortunately there is now a newly formed branch\nof the psychiatric field know as Metapsychiatry Page 83 which is\nincreasingly making use of the latest scientific findings in this\narea. And it is gratifying that in 1980 the American Psychiatric\nAssociation added &quot;multiple personality&quot; to its diagnostic and\nstatistical manual of mental disorders!]\n\n  back to Top of Page  \n\nWhen any person starts to build equipment designed to &quot;talk to the\nspirits&quot; it behooves him to carefully bypass all the persons now very\nmuch alive in the lowest astral planes. (Incidentally, this area is\nalso populated with some rather frightening forms of life which do not\nbelong to the human line of evolution.)\n\nIn fact, it is not enough to just tune out the lowest astral planes.\nThere is another hazard to be encountered a little higher up. There is\na layer of spirits who are not really intending to be harmful and they\nare not likely to lock into your aura. But they are out to have some\nfun -- they are more like pranksters. Should you contact them, they\nmay pretend to be someone they are not. They may, as we say, &quot;take you\nfor a ride.&quot; They may appear much more knowledgable than they are.\n\nIt is because of these &quot;communication hazards&quot; that mediumship got\nsuch a bad name 2,000 years ago. At the time of the events in the New\nTestament, mediumship was very common. Its dangers were also well\nknown, because it was a rare medium indeed who could tap the wisdom of\nthe highest astral planes. Anyone who could tap that of the\nmental-causal or the celestial planes went down in history as a\nprophet, sage or seer! The writers of the New Testament cautioned\ntheir small flocks to &quot;Beware&quot; and to &quot;Test&quot; all spirits with whom\ncontact was made, to make certain that the communicators were good,\nfriendly, God-fearing spirits.\n\nHow does an EVP or SPIRICOM researcher make certain that he does not\nattract a cloud of undesirable spirit persons? There are two precautions:\n\nFirst, never work in this field unless you are in excellent physical\nhealth, free of serious mental or emotional stresses and strains, and\nhave an optimistic and joyful attitude about your life and toward all\nwith whom you come in contact . If you cannot honestly say that you\nfit this physical, mental and emotional profile -- then find some\nother outlet for your inquiring mind!\n\nThe second point requires a bit of background. You daily use your\nradio and/or TV. When you want to switch from one station to another,\nyou turn a channel or station control knob. By so doing you turn from\none wavelength or frequency to another -- either higher or lower. A\nSPIRICOM set operates the same way. But the\n&quot;good&quot; SPIRICOM programs come in only on the higher wavelengths or\nfrequencies. Hence you should try to use a set which will get up\nbeyond the stations which have only the &quot;bad&quot; programs.\n\nUnfortunately this is easier said than done. Most of the EVP research\nhas been done in kilohertz wavelengths. It is the consensus of the\nresearcher at Metascience Foundation that you will Page 84 never reach\nthe desired intelligence levels at these wavelengths. Even at a far\nhigher level -- 29.5 Megahertz - - we have on occasion, tuned in to\nsome very uncouth characters using language which was not fit for print.\n\nIn general we feel that, in the years ahead, researchers should\nconstantly strive to establish systems which will reach ever higher\nfrequencies. Our projections for Mark VI and Mark VII show how\nseriously we ourselves take this bit of advice.\n\nIf you as a researcher have followed the above precautions, you may\nvery well reach individuals who are highly evolved in the best\nspiritual sense. They are interested -- deeply and solely -- in\nhelping Man on earth to grow up out of the quagmire of hate, jealousy,\nmurder and materialism which he has fashioned for himself. If you want\nto narrow the gap from where you individually stand in your own\nspiritual development, and the level of spiritual growth which your\nprospective communicators possess, you will find it helpful to include\none or two short periods of meditation and prayer in your daily schedule.\n\n--------------------------------------------------------------------------\n\nDoes this prescription work? Yes, speaking from the personal\nexperiences of our associates during the past ten years. Are the\ndangers real? Yes. Among the researchers in this field who failed to\nfollow the above warnings are at least one known suicide and two cases\nof possession. Either suicide or possession is a high price to pay for\ndisregarding admonitions that have their basis in 2,000 years of history.*\n\n\n2. Dangers which Mankind faces if SPIRICOM is not used wisely\n\nSince his beginnings, Man has been faced with the fact that\nindividually and collectively he has the power to act for good or\nevil. As his knowledge of the energetic nature of the cosmos has\nexpanded, Man has found that every energy so far identified -- from\nsexual energy to atomic energy -- can be used for his benefit or for\nhis downfall. He will find that the energies involved in SPIRICOM are\nalso of a nature that can be used to help him grow mentally and\nspiritually and become more God-like (that is more like the beings on\nthe higher planes) or they can be focused on trivia which will make it\neven harder for him to grow out of the present deplorable mess in\nwhich Western civilization&#39;s social, economic and political actions\nare tending toward disintegration.\n\n----------------\n\n    * For the spiritually oriented, we report some advice given by\nhigh level spirit communicators: If SPIRICOM researchers adhere to the\nfollowing procedure they will not suffer possession by negative\nforces. First thing in the morning say, &quot;I will wear the protective\ncloak of the Christ light until I retire tonight.&quot; On retiring make a\nsimilar decree for the night hours. (Note: The Christ light is said to\nhave overshadowed and inspired Jesus of Nazareth continually during\nthe last three years of his earth life.)\n\n  back to Top of Page  \n\nPage 85\nWhen SPIRICOM instrumentation is further perfected, it will in the\nvery nature of product development, be more simplified and available\nat lower and lower cost. (Already we discern the possibility of making\nequipment to do the work of Mark IV, for example, in the form of a\nrelatively inexpensive, compact, hand-held instrument.) Will such\nequipment be used to the maximum benefit of people -- both here and in\nthe hereafter?\n\nTo the extent that it will reduce the sense of loss and grief at the\npassing of a loved one, it will be of great value. To the extent that\nit helps people learn that what we have called &quot;death&quot; is in fact,\n&quot;birth&quot; into another and potentially more glorious life, it will also\nbe a great blessing. To the extent that it is used for the purpose of\nconvincing a large portion of the 4,000,000,000 persons now on earth\nthat they should live this life in ways that will assure the best\nconditions for their next life, it could be tremendous factor in the\nupward evolution of Man.\n\nBut, sad to say, there is another side to the coin if contact is with\nonly the lower planes. Consider these two omens of why widespread use\nof SPIRICOM may not suddenly make Man into a new and noble creature.\n\nFirst consider the parallel to what has happened in the last 100 years\nin the case of those persons who became deeply interested in all forms\nof psychic phenomena and concentrated in groups to develop their\nmembers into good mediums. The mediums brought through many messages\nwhich gave seeming evidence of survival. Such messages brought great\ncomfort to many of the sitters. A few of the messages conveyed great\nspiritual truths and tried to show the wisdom of inculcating such\ntruths into the daily lives of the sitters. A new religion called\nSpiritualism took roots in England, the USA and many other countries.\nA variant called Spiritism took roots and grew in France, Brazil and\nother countries. There were many who thought that this new religion\nwould sweep the world. It has not done so. Why?\n\nThe answer has been provided during the last few years from\nSpiritualists now living on the higher planes. From their higher\nperspective (and speaking through the remarkable direct-voice\nmediumship of Leslie Flint) Sir William Crookes, Sir Oliver Lodge, Sir\nWilliam Barrett, Emma Harding Britten, Ellen Terry and Sir Arthur\nConan Doyle have said time and again, with great sadness,\n&quot;Spiritualism has lost its spirituality! It has concerned itself with\ntrivia.&quot;\n\nThey refer to the fact that Spiritualism (unlike Spiritism in Brazil)\nstill concentrates on platform clairvoyance and mediumship which is in\ncontact with only the lower astral planes. The messages brought\nthrough are primarily of a personal greeting type and very seldom\ncontain any spiritually-oriented teachings from the\nhigher levels of wisdom.\n\nIf SPIRICOM is used in the decades ahead primarily to contact loved\nones who have recently passed to the lower planes, it will have fallen\ninto the same trap of being concerned only with trivia. Those living\non the lower planes are basically no more evolved and enlightened than\nthey were when they passed over. In the main, they did not produce a\nviable civilization when they were running the show here on the\nsurface of the earth!\n\nPage 86\nOnly if Man is inventive enough to perfect forms of SPIRICOM which can\ncommunicate with the higher planes,  can he tap the desired level of\nwisdom and spiritual enlightenment. And only if he then has the wisdom\nto use the devices for tapping that wisdom and enlightenment can he\ncreate heaven on earth. Will SPIRICOM users concern themselves only\nwith trivia, or with the wisdom that could lead Man into the\nlong-promised &quot;golden age&quot;?\n\nAnd now let us look at the second reason why we should not expect that\nSPIRICOM will necessarily achieve the goal of making Man into a new\nand better creature. Let us take a strictly objective view of what has\nhappened to the rosy-hued dreams of the miracles predicted to follow\nperfection of TV, motion pictures and radio broadcasting.\n\nThe following clipping was saved about 1975 from an electronics\nmagazine (author unknown) because of its pertinence to the situation\nthat would exist when someday we, or others, succeeded in developing\nSPIRICOM.\n\n    We should recognize that new technology readily evokes rosy\nexpectations. Possible blessings are more easily glimpsed than\nproblems, and are more gratifying to contemplate. As we have seen,\nvisions of the wired world have been with us ever since the invention\nof the telephone. As early as 1882, an artist pictured a woman\nshopping via television, and another taking a course via television.\nIn the early 1900s, the motion picture was expected to have many of\nthe same effects predicted for telecommunications-wide dispersal of\nknowledge, equalization of opportunity, strengthening of democracy and\nof international understanding. Broadcasting, at the very hour of its\nbirth, was expected to have similar effects. The first issue of Radio\nBroadcast, launched early in 1922, predicted that broadcasting would ...\n    ... elicit a new national loyalty and produce a more contented\ncitizenry ...\n    ... the government will be a living thing to its citizens instead\nof an abstract and unseen force ...\n    ... at last we may have covenants literally openly arrived at ...\n    ... elected representatives will not be able to evade their\nresponsibility to those constituents who put them in office ...\n    ... the people&#39;s University of the Air will have a greater student\nbody than all the rest of our universities put together ...\n\n    That same year a former Secretary of the Navy, Josephus Daniels,\njoined in the sanguine predictions: &quot;Nobody now fears that a Japanese\nBeet could deal an unexpected blow on our Pacific possessions ...\nRadio makes surprises impossible.&quot; Magazine articles of the day\nfeatured such titles as &quot;How Radio is Remaking the WorId&quot; and &quot;Radio,\nthe modern Peace Dove&quot; and &quot;Ether Waves vs. Crime Waves.&quot;\n\nCan anyone deny that Man has failed to reap all of the early\nexpectations for these remarkable technical developments? Can he deny\nthat the increasing flood of pornographic movies and video cassettes\nmay add to the rapid destruction of family life which has been the\nbackbone of our civilization? Can he deny that there is any\nrelationship between our spiraling crime rate and the exposure of our\nchildren to 15 years of murder, rape and other crime on our TV and\nmovie screens?\n\nWill Man similarly pervert the use of SPIRICOM? Any serious student of\nhuman is compelled to answer &quot;yes.&quot;\n\n  back to Top of Page  \n\nHowever, there is one factor present in 1982 that did not exist while\nthe commercialization of radio, movies and TV was occurring. Our\ncommunicators from the higher realms of Spirit have the ability to\nlook in a dispassioned way at miniscule Man in his many senseless\npursuit on the surface of the earth. They Page 87 have the wisdom\nwhich comes from their knowledge of the workings of the cosmos. They\nlook at this small planet and are able to forsee the catastrophe which\nis soon to engulf our present civilization. Their precognitive\nstatements are now coming into print in many nations. They predict\nthat Man has passed the point-of-no-return and that our economy, our\nlife styles, our political systems and our belief systems will undergo\nchanges far beyond the scope which most persons can conceive.\n\nIn the Summer 1979 the Metascience Foundation publication COLLAPSE &\nCOMEBACK presented Riley Hansard Crabb&#39;s highly informative study of\nthe zodiacal and planetary cycles. One of Mr. Crabb&#39;s most useful\ndiagrams is reproduced herewith. Notice the pivotal time in which we\nare living.\n\nPage 88\n\nPage 89\n\nThe far-reaching implications of the cosmic forces depicted in Crabb&#39;s\ndiagram evoke serious questions in our minds -- as do the predictions\nfrom higher planes regarding impending cataclysmic chanqes:\n\nCould it be that God, the powers above, the good guys upstairs, people\non plane 6 and 7 of the &quot;Many Mansions&quot; chart --  whoever runs the\nshow -- have for 70 years intentionally slowed and frustrated efforts\nof brilliant inventors such as Marconi, Tesla and Edison to create a\nSPIRICOM?\n\nCould it be that in their infinite wisdom the higher beings decided to\nprevent the negative uses of SPIRICOM by not allowing its perfection\nuntil Man is so desperate, so frustrated, so cast down, that he will\nuse it constructively to reach up to the higher planes, join forces\nwith the God each of us carries within, and together build a new\nheaven and new earth?\n\nYes, SPIRICOM obviously has dangers for materialistic Man. But it may\nalso be the greatest single force for  helping to erect the new heaven\nand to people the new earth which will follow the cataclysmic changes\nwhich we will all be aparty to in this present decade -- and which\nwill even begin to hit us hard in 1982 and 1983.\n\nWith the above closing thoughts, the reader has a better perspective\nfor considering the:\n\n   \n\nObjectives of METASCIENCE FOUNDATION\n\nTo provide a scientific basis for knowing:\n\n    *\n\n      That life is eternal,\n    *\n\n      That each person is a son or daughter of God, the Father, the\nUniversal Mind, the Creator of all that exists,\n    *\n\n      That the life of each person is of infinite importance and has\nspecific purpose and ultimate meaning, and\n    *\n\n      That limitless love of neighbor und self leads to inner peace,\nhappiness and good health. \n\nWe believe Man can achieve this profound level of understanding by\ndirectly contacting the accumulated wisdom of the ages, currently\navailable on the Mental and Causal Planes. It is our conviction that\nthe most reliable access to this information can be provided by\nperfecting a dependable two-way electromagnetic - etheric\ncommunication system.\n\nThis would at last make possible a workable and rewarding cooperation\nbetween Man&#39;s many religions and his sciences."}