{"id": "9634", "subject": "WARNING TO EVERY ONE PLEASE HEED.", "author": "v1230mail", "timestamp": "2008-04-14T03:10:07Z", "full_text": "http://www.worlditc.org/h_07_meek_spiri_082_089.htm\n\n2. Dangers which Mankind faces if SPIRICOM is not used wisely\n\nSince his beginnings, Man has been faced with the fact that\nindividually and collectively he has the power to act for good or\nevil. As his knowledge of the energetic nature of the cosmos has\nexpanded, Man has found that every energy so far identified -- from\nsexual energy to atomic energy -- can be used for his benefit or for\nhis downfall. He will find that the energies involved in SPIRICOM are\nalso of a nature that can be used to help him grow mentally and\nspiritually and become more God-like (that is more like the beings on\nthe higher planes) or they can be focused on trivia which will make it\neven harder for him to grow out of the present deplorable mess in\nwhich Western civilization&#39;s social, economic and political actions\nare tending toward disintegration.\n\n----------------\n\n    * For the spiritually oriented, we report some advice given by\nhigh level spirit communicators: If SPIRICOM researchers adhere to the\nfollowing procedure they will not suffer possession by negative\nforces. First thing in the morning say, &quot;I will wear the protective\ncloak of the Christ light until I retire tonight.&quot; On retiring make a\nsimilar decree for the night hours. (Note: The Christ light is said to\nhave overshadowed and inspired Jesus of Nazareth continually during\nthe last three years of his earth life.)\n\n  back to Top of Page  \n\n\n\n--- In EVP-ITC@yahoogroups.com, Rhonda W &lt;rhondak1973@...&gt; wrote:\n&gt;\n&gt; LOL crazy as a fox girl!  I miss chattin on the skype thing...I\ngotta get my butt on there soon so we can catch up...havent done a\nsession in a while got my ex here recooping and he is sorta a thorn in\nmy side and a skeptic so doesnt make for a good enviroment for\nsessions and recording.  Heard all ur recordings good tho.\n&gt;    \n&gt;   Rhonda\n&gt; \n&gt; Kristin &lt;ckmorris95@...&gt; wrote:\n&gt;           So here&#39;s my run-down of responses for the past week ;-):\n&gt; \n&gt; Frank S: Congrats on franken out the 469 to your liking!\n&gt; \n&gt; I did hear most of everyone&#39;s files posted: Urkle and Bruce&#39;s wer\n&gt; most clear.\n&gt; \n&gt; KATHYWEIR: Audacity is free - google it.\n&gt; \n&gt; NATHAN: Whatever you believe is okay. Opinions make the world go\n&gt; round. If you are open and want to learn more than welcome.\n&gt; \n&gt; JULI - WHATS UP GIRL!!! I have been hanging upside down - out my\n&gt; window and about to throw up a ladder and sit on my roof to get better\n&gt; reception!!! I have run out of tinfoil... can you spare some?\n&gt; \n&gt; AL from o&#39;BAMA: I too always get contradicting answers. Just\n&gt; yesterday I was cleaning my pool and listening to my 470 and I heard\n&gt; them say &quot;SHE&#39;S USING US FOR ENTERTAINMENT&quot; I replied that I was\n&gt; trying to get experience &#39;hearing&#39;. I heard THAT&#39;S GOOD&quot; and I also\n&gt; heard &quot;BITCH LEAVE&quot;. I apologized if they felt I was intruding and\n&gt; asked if they wanted me to shut down or just the DH&#39;s wanted me too. \n&gt; I heard &quot;BOTH&quot; and I heard &quot;NO DON&#39;T&quot;. Who do I choose to listen to?\n&gt; I stayed on for a bit longer - I always err on the side of positive.\n&gt; If I&#39;m looking for answers to important personal stuff.. I wouldn&#39;t\n&gt; ask the box for answers. PS: I once asked if they could read my mind\n&gt; and they responded with &quot;OF COURSE NOT&quot; and then proceeded to answer\n&gt; my next question before I asked! Go figure :-)\n&gt; \n&gt; RHONDA - Are you hearing voice girl??? I knew it! You&#39;re as crazy as\n&gt; me!!! LOL... I think that&#39;s cool.\n&gt; \n&gt; REES: I really do believe your lost session was very cool. I don&#39;t\n&gt; believe it&#39;s loss was a coincidence. \n&gt; \n&gt; BRUCE: Cool pictures in the Photos Section. Have you ever thought\n&gt; about doing a BOX session and a Photo session at the same time and see\n&gt; if you could get a photograph of the person talking?? That would be\n&gt; an interesting experiement.\n&gt; \n&gt; MARGARET: Your knowledge is so emense! I am grateful you are here\n&gt; with us to share. \n&gt; \n&gt; ANNETTE: Congrats on your son&#39;s wedding!\n&gt; \n&gt; JOEL: The news item you posted is disturbing on so many levels. I\n&gt; just pray that the universe works it out so that karma is indeed\n&gt; something that these people will have to deal with. Nothing is sacred\n&gt; anymore it seems...\n&gt; \n&gt; AARON: C O N G R A T U L A T I O N S !! On your first successful\n&gt; session. You&#39;re hooked and welcome aboard the crazy train ;-)\n&gt; \n&gt; VINNIE: CONGRATS TO YOU TOO! Do you want us to call your Dave or\n&gt; Vinnie? \n&gt; \n&gt; RON L: I asked about Austism for you and I heard :&quot;MAN MADE&quot; and when\n&gt; I asked about vaacines I heard &quot;YES..&quot; I will work on trying to get\n&gt; these files online. But I have so much to go through... I think I\n&gt; will be listening for about a week... \n&gt; \n&gt; whew... i missed you all..\n&gt; k\n&gt; \n&gt; \n&gt; \n&gt;                            \n&gt; \n&gt;  __________________________________________________\n&gt; Do You Yahoo!?\n&gt; Tired of spam?  Yahoo! Mail has the best spam protection around \n&gt; http://mail.yahoo.com\n&gt;"}