{"id": "9642", "subject": "Re: Speakjet Box 3 Finished RE: religious spamming redorick in this group", "author": "Misty", "timestamp": "2008-04-14T03:26:19Z", "full_text": "Thanks for that Gabreael =) It&#39;s appreciated.\n\nYes I have to agree religious discussions are something to be done on \na religious forum...which this is not. \n\nWe cant fault people for wearing thier beliefs on thier sleeves for \neveryone to see, just dont try to shove your beliefs down others \nthroats and we will all get along fine =)\n\nPlease respect the groups purpose and do not attempt to overshadow it \nwith your own beliefs...whatever that may be. Those who cant do that \ncan find countless OTHER groups discussing the very things we do not \ndelve into here.\nMisty\n\n--- In EVP-ITC@yahoogroups.com, &quot;eastern_paranormal&quot; \n&lt;eparanormal@...&gt; wrote:\n&gt;\n&gt; I&#39;m sorry, but I try my best to respectful of most everyone&#39;s views \n&gt; and belief systems, but I joined this group for ITC sharing. If the \n&gt; moderators are not going to put a stop to this religious spamming \n&gt; redorick I am going to go &quot;No Mail&quot; in this group for a while again.\n&gt; \n&gt; Gabreael\n&gt; www.easternparanormal.com \n&gt; \n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;v1230mail&quot; &lt;v1230mail@&gt; wrote:\n&gt; &gt;\n&gt; &gt; 2. Dangers which Mankind faces if SPIRICOM is not used wisely\n&gt; &gt; \n&gt; &gt; Since his beginnings, Man has been faced with the fact that\n&gt; &gt; individually and collectively he has the power to act for good or\n&gt; &gt; evil. As his knowledge of the energetic nature of the cosmos has\n&gt; &gt; expanded, Man has found that every energy so far identified -- \nfrom\n&gt; &gt; sexual energy to atomic energy -- can be used for his benefit or \nfor\n&gt; &gt; his downfall. He will find that the energies involved in SPIRICOM \n&gt; are\n&gt; &gt; also of a nature that can be used to help him grow mentally and\n&gt; &gt; spiritually and become more God-like (that is more like the \nbeings \n&gt; on\n&gt; &gt; the higher planes) or they can be focused on trivia which will \nmake \n&gt; it\n&gt; &gt; even harder for him to grow out of the present deplorable mess in\n&gt; &gt; which Western civilization&#39;s social, economic and political \nactions\n&gt; &gt; are tending toward disintegration.\n&gt; &gt; \n&gt; &gt; ----------------\n&gt; &gt; \n&gt; &gt;     * For the spiritually oriented, we report some advice given by\n&gt; &gt; high level spirit communicators: If SPIRICOM researchers adhere \nto \n&gt; the\n&gt; &gt; following procedure they will not suffer possession by negative\n&gt; &gt; forces. First thing in the morning say, &quot;I will wear the \nprotective\n&gt; &gt; cloak of the Christ light until I retire tonight.&quot; On retiring \nmake \n&gt; a\n&gt; &gt; similar decree for the night hours. (Note: The Christ light is \nsaid \n&gt; to\n&gt; &gt; have overshadowed and inspired Jesus of Nazareth continually \nduring\n&gt; &gt; the last three years of his earth life.)\n&gt; &gt; \n&gt; &gt; http://www.worlditc.org/h_07_meek_spiri_082_089.htm\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;bryan_whatley&quot; &lt;bryan_whatley@&gt; \n&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; This sounds pretty interesting.  Can you send some more info or \na \n&gt; link?\n&gt; &gt; &gt; Thanks,\n&gt; &gt; &gt; Bryan\n&gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;dead.science&quot; &lt;dead.science@&gt; \n&gt; wrote:\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt; &gt; Just finished box number 3.  And yes that&#39;s a trifield meter \n&gt; built in.\n&gt; &gt; &gt; &gt;  It seems to work great.  Once the meter shows any EMF field \nat \n&gt; all\n&gt; &gt; &gt; &gt; the box starts to spit out the allophones.  The meter also \nhas \n&gt; a very\n&gt; &gt; &gt; &gt; sensitive antenna and it is tied together with the\n&gt; &gt; &gt; &gt;  A to D converter antenna that I use to get the emf into the \n&gt; box.\n&gt; &gt; &gt; &gt; This is by far the most sensitive of the three boxes.  If you \n&gt; are\n&gt; &gt; &gt; &gt; building your own just let me know if you need any info.  I \n&gt; will of\n&gt; &gt; &gt; &gt; course upload audio files as I get them.  I did have a few \n&gt; headaches\n&gt; &gt; &gt; &gt; with this box as I am driving the LM386 all the way up.  \n&gt; Somehow the\n&gt; &gt; &gt; &gt; audio was getting back into the negative bus!  Took a couple \n&gt; hours to\n&gt; &gt; &gt; &gt; get the right capacitor for the ground shunt.  Funny though \nas \n&gt; it\n&gt; &gt; &gt; &gt; worked great on the breadboard but once I soldered it together\n&gt; &gt; &gt; &gt; UHHHGGG.  I think I will hang onto this one  for a while.  I \n&gt; have\n&gt; &gt; &gt; &gt; young lady in mind that is doing very promising work so I \nguess \n&gt; she\n&gt; &gt; &gt; &gt; gets box # 1.\n&gt; &gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}