{"id": "9643", "subject": "Nathan - Are you serious?", "author": "itcdeadpeople", "timestamp": "2008-04-14T04:27:10Z", "full_text": "Hi Nathan.  I bought mine from Radio Shack and did the hack myself.  There are \ninstructions and videos on the net if you want to do this.  If you are unable to do the hack \nfor yourself, you can look on eBay for the prehacked new model 12-469, though you may \nfind the clicking on it annoying.  The other hackable models, thus far, have not shown on \neBay. \n\nIf you can operate a screw driver and a wire snipper, you should be able to do the hack \nyourself (assuming you don&#39;t have eyesight issues which would prevent you from \ndetermining what is going to the mute pin, or manual dexterity issues which would \nprevent you from being able to snip just one wire.)  You certainly could start \nexperimenting with a manual sweep, by just turning the dial of a radio for yourself.\n\nLook, most of us are trying to polite and civil to you (at least I am, I&#39;ve not read through all \nthe posts so I&#39;m not sure how others are reacting).  If you have a genuine interest in \nexperimenting with the automated sweep, great.  But from the tone the posts of yours \nthat I have read thus far, it seems you not being respectful (or maybe you&#39;re just unaware) \nof the fact that you are among a group of people here who simply do not share your &#39;world \nview.&#39;\n\nThis is akin to a person of one religion walking into the place of worship of another, vastly \ndifferent religion, and preaching to the members about the dangers of their beliefs.  It is \nextremely inappropriate and I&#39;m not quite sure why you are not understanding the \nsimilarity between this analogy and your behavior in this forum.  \n\nPerhaps you should start your own Yahoo group where you can discuss your concerns with \nlike-minded individuals?  \n\nOne last thing, and again, I realize you may not be aware, but typing in all caps is \nconsidered in cyberworlds as screaming at those whom you are addressing in your post or \nemail.  And on a practical side, all caps are more difficult to read.  \n\nMay peace be with you.\n\nMargaret\n\n--- In EVP-ITC@yahoogroups.com, &quot;v1230mail&quot; &lt;v1230mail@...&gt; wrote:\n&gt;\n&gt; I HAVE NEVER USED THE BOX, I MADE A REQUEST TO ITCDEADPEOPLE TO SED ME\n&gt; ONE.\n&gt; i WANT TO EXPERIMENT WITH IT, SOUNDS EXCITING."}