{"id": "9656", "subject": "Re: [EVP-ITC] Re: Nathan re: Hoax", "author": "Lisby", "timestamp": "2008-04-14T13:05:01Z", "full_text": "Please stop typing in all caps. It&#39;s very, very bad netiquette. It  \nmeans you&#39;re yelling.\n\nAnn\n\nOn Apr 13, 2008, at 10:26 PM, v1230mail wrote:\n\n&gt; THANKS FOR YOUR HEALTHY VIEW ON THINGS.\n&gt;\n&gt; AT LEAST YOU DID NOT THROW LABELS AT ME, JUST FOR QUESTIONING A METHOD\n&gt; USED. THANKS FOR THAT.\n&gt;\n&gt; I WANT THE TRUTH TOO, AND THE ONLY WAY TO GET THAT IS THROUGH  \n&gt; RESEARCH.\n&gt;\n&gt; ONE DOES NOT HAVE TO BE A BELIEVER TO OBSERVE FACTS, PLEASE REMEMBER\n&gt; THAT. SPIRIT VOICES ARE REAL, BUT WHAT ARE THEY? SPIRITS? YOUR OWN\n&gt; SUBCONSCIOUS MIND? RESEARCH WILL PROVE IT ONE WAY OR THE OTHER.\n&gt;\n&gt; &quot;&gt; The question brought up some good responses from you guys. Let&#39;s\n&gt; &gt; leave it at that and move on =)&quot;\n&gt;\n&gt; YOU CALL THROWING LABELS ON SOME ONE A GOOD RESPONSE? I THINK NOT.\n&gt;\n&gt; -- In EVP-ITC@yahoogroups.com, &quot;Misty&quot; &lt;bulletbabea@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Opinions...everyone has the right to have them. The great thing is\n&gt; &gt; nobody has to agree with me on any given subject and vice versa =)\n&gt; &gt;\n&gt; &gt; Bruce is correct that this group is founded on the belief the voices\n&gt; &gt; do exist.... as to who is on the other end well even the people here\n&gt; &gt; seem to have formed thier own ideas on that. Some based on beliefs\n&gt; &gt; some based on research some based on instinct, some just thought it\n&gt; &gt; up while watching a tv show that led them to join here. Others have\n&gt; &gt; decided it doesnt matter who what when where why or how it is being\n&gt; &gt; done, just the fact it is happening is enough to keep their  \n&gt; interest.\n&gt; &gt; Not everyone that joins here is a believer. But everyone that joins\n&gt; &gt; here is curious and hopefully want to learn more.\n&gt; &gt;\n&gt; &gt; I have actually heard this question/idea stated before and\n&gt; &gt; rementioned recently on a talk show dealing with ufo/government\n&gt; &gt; technology. It was only mentioned as possibility and mentions of\n&gt; &gt; conducted experiments that were used on people.\n&gt; &gt;\n&gt; &gt; Look around you. The world as we see it is indeed a matrix, a peice\n&gt; &gt; of a peice of a peice of a much larger puzzle. In my own ITC many do\n&gt; &gt; not claim to be or ever have been a &quot;human&quot; some do not even have\n&gt; &gt; names/labels until they are given one.\n&gt; &gt;\n&gt; &gt; The question brought up some good responses from you guys. Let&#39;s\n&gt; &gt; leave it at that and move on =)\n&gt; &gt;\n&gt; &gt; Misty\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; --- In EVP-ITC@yahoogroups.com, bruce halliday\n&gt; &gt; &lt;paranormalinvestigating@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; Nathan,\n&gt; &gt; &gt;\n&gt; &gt; &gt; I suggest you read the headline and description of this group.\n&gt; &gt; &gt; We are a group of real time communication researchers that are\n&gt; &gt; &gt; continously seeking the truth. The founder of this board\n&gt; &gt; &gt; Mr. Frank Sumption has alway&#39;s made it clear that It is not a  \n&gt; place\n&gt; &gt; &gt; for sceptics and they will not be tolerated. We are here to study\n&gt; &gt; and\n&gt; &gt; &gt; further real time soirit communication, not have to defend every\n&gt; &gt; post\n&gt; &gt; &gt; we make or file we add. I suggest you take your negative\n&gt; &gt; accusations and\n&gt; &gt; &gt; detrimental unfounded criticism and scepticism somewhere else.\n&gt; &gt; &gt;\n&gt; &gt; &gt; You are wearing your welcome thin here, not to mention within 5\n&gt; &gt; posts\n&gt; &gt; &gt; you have contradicted yourself three times. and went from the\n&gt; &gt; philosophy\n&gt; &gt; &gt; of aliens enslaving human spirits to questioning any chance that\n&gt; &gt; this method\n&gt; &gt; &gt; of spirit communication could or does exist and is a conspiricy to\n&gt; &gt; fool unsuspecting\n&gt; &gt; &gt; people like us by means of a super transmitter.\n&gt; &gt; &gt;\n&gt; &gt; &gt; I have learned by experience to try and keep this type of post\n&gt; &gt; civil, So for any moderators that are reading this\n&gt; &gt; &gt; Please review the situation.\n&gt; &gt; &gt;\n&gt; &gt; &gt; Bruce Halliday\n&gt; &gt; &gt; Bruce Halliday\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; To: EVP-ITC@: f1cracker75@: Sat, 12 Apr 2008 19:24:11 -\n&gt; &gt; 0700Subject: Re: [EVP-ITC] Re:First SuCcessful Recordings - Nathan\n&gt; &gt; re: Hoax\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; Nathan, I am amazed you would suggest or even think that! I live\n&gt; &gt; in Cary, North Carolina and record when I have the time. There is no\n&gt; &gt; set schedule, and when I turn my radio on and someone says hello\n&gt; &gt; Michael, or even shouts out &quot;Mike Edwards&quot;, or a spirit tells me  \n&gt; I am\n&gt; &gt; holding a carving in my hand, who would even know I turned the radio\n&gt; &gt; on? Only my wife knows I record, and we have kept this research from\n&gt; &gt; our children as well as our neighbors. So you are suggesting that\n&gt; &gt; Margaret, lets say who lives where I do not know, is playing a joke\n&gt; &gt; on me with a high tech two way radio?\n&gt; &gt; &gt;\n&gt; &gt; &gt; itcdeadpeople &lt;ITCdeadpeople@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; Hi Nathan. I always look to relevance as a key in determining\n&gt; &gt; whether or not something is appropriate to the session. If this were\n&gt; &gt; a hoax, I would then have to seek an explanation for how private\n&gt; &gt; information is known by the &#39;hoax perp&#39;, particularly information\n&gt; &gt; that would require visual awareness. Some of us have examples of\n&gt; &gt; appropriate responses being given when asking things like, &quot;Can you\n&gt; &gt; name something nearby me?&quot; or &quot;Please tell me what I&#39;m holding in my\n&gt; &gt; left hand.&quot; A sophisticated multi-transmission two way radio would\n&gt; &gt; not explain answers which require &#39;visual&#39; information of some kind\n&gt; &gt; (though I&#39;ll be the first to admit my understanding of  \n&gt; electronics is\n&gt; &gt; limited but I&#39;m fairly confident on this aspect.) Of course,  \n&gt; there is\n&gt; &gt; always the chance that the person running the hoax is also, or in\n&gt; &gt; partnership with, an extremely talented remote viewer or psychic who\n&gt; &gt; is able to glean that visual information from the ether or the mind\n&gt; &gt; of the experimenter. And what of those examples where people have\n&gt; &gt; confirmed the sound of the voice being &quot;just like&quot; that of their\n&gt; &gt; loved one in spirit? Surely the hoaxer isn&#39;t also able to mimic\n&gt; &gt; people&#39;s loved ones.If you are using EVP Maker with anything other\n&gt; &gt; than the allophones file, which contains no words to begin with, you\n&gt; &gt; are also running the possibility of &#39;false positives&#39; albeit they\n&gt; &gt; wouldn&#39;t be from a hoax. Again, I look to relevance to be key, and\n&gt; &gt; relevant info that would not come easily to a stranger is even\n&gt; &gt; better. For example, I turned on my MiniBox for the very first time\n&gt; &gt; and said, &quot;Hello?&quot; and immediately received the response, &quot;Hello\n&gt; &gt; Margaret.&quot; If this were a hoax, how could that person know in less\n&gt; &gt; than 10 seconds, who I was by name. I had not given this information\n&gt; &gt; out. Not to mention that you have people experimenting 24/7 and\n&gt; &gt; receiving similar responses. How in the world could an organization\n&gt; &gt; have the manpower, technology, or even the desire, to attempt such a\n&gt; &gt; hoax? I mean that as a genuine inquiry, because there might be an\n&gt; &gt; explanation I have not thought of. I have one example where, via\n&gt; &gt; radio sweep, my communicator was able to correctly identify the\n&gt; &gt; status and location of a missing person (who it turns out was alive\n&gt; &gt; and well, so we ended up with confirmation that the info given had\n&gt; &gt; indeed been correct - which is much less complicated that trying to\n&gt; &gt; track and understand the clues when associated with the dead, or\n&gt; &gt; missing but not found.) Again, if a hoax, would that have simply  \n&gt; been\n&gt; &gt; a lucky guess on the part of the hoaxer?Bottom line for me is ...\n&gt; &gt; have I wondered if it could be a hoax? Or simply a fortuitous tuning\n&gt; &gt; of the dial? Yes, on both accounts. But there is enough compelling\n&gt; &gt; evidence to rule out both of them as an explanation for the far too\n&gt; &gt; many relevant examples received by so many of us.Good food for\n&gt; &gt; thought, but after digesting it, I&#39;d have to say, &quot;No, a\n&gt; &gt; sophisticated hoax does not sufficiently explain the phenomena on a\n&gt; &gt; large scale.&quot;Margaret--- In EVP-ITC@yahoogroups.com, Nathan Sharman\n&gt; &gt; &lt;v1230mail@&gt; wrote:&gt;&gt; Has it ever occurred to you, that some one or&gt;\n&gt; &gt; organisation, could be using a radio to say the things&gt; you heard? \n&gt; &gt; &gt;\n&gt; &gt; This whole radio and spirit voices, could be a MASSIVE&gt; HOAX,\n&gt; &gt; perpetuated by some one with a sophisticated&gt; multi-transmission two\n&gt; &gt; way radio.&gt; &gt; Think about it.&gt; &gt; THAT IS WHY I USE EVPmaker only to\n&gt; &gt; commuincate with&gt; the other dimension.&gt; &gt;\n&gt; &gt; __________________________________________________&gt; Do You Yahoo!?&gt;\n&gt; &gt; Tired of spam? Yahoo! Mail has the best spam protection around &gt;\n&gt; &gt; http://mail.yahoo.com&gt;Michael Edwards: Cary, North Carolina.\n&gt; &gt; f1cracker75@\n&gt; &gt; &gt; __________________________________________________Do You Yahoo!?\n&gt; &gt; Tired of spam? Yahoo! Mail has the best spam protection around\n&gt; &gt; http://mail.yahoo.com\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt; __________________________________________________________\n&gt; &gt; &gt; More immediate than e-mail? Get instant access with Windows Live\n&gt; &gt; Messenger.\n&gt; &gt; &gt; http://www.windowslive.com/messenger/overview.html?\n&gt; &gt; ocid=TXT_TAGLM_WL_Refresh_instantaccess_042008\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;\n&gt;\n&gt; \n\n\nPlease s op yping in all caps. I 's e y, e y bad ne ique e. I means you' e yelling.AnnOn Ap 13, 2008, a 10:26 PM, 1230mail w o e:THANKS FOR YOUR HEALTHY VIEW ON THINGS.AT LEAST YOU DID NOT THROW LABELS AT ME, JUST FOR QUESTIONING A METHODUSED. THANKS FOR THAT.I WANT THE TRUTH TOO, AND THE ONLY WAY TO GET THAT IS THROUGH RESEARCH.ONE DOES NOT HAVE TO BE A BELIEVER TO OBSERVE FACTS, PLEASE REMEMBERTHAT. SPIRIT VOICES ARE REAL, BUT WHAT ARE THEY? SPIRITS? YOUR OWNSUBCONSCIOUS MIND? RESEARCH WILL PROVE IT ONE WAY OR THE OTHER.\"> The ques ion b ough up some good esponses om you guys. Le 's > lea e i a ha and mo e on =)\"YOU CALL THROWING LABELS ON SOME ONE A GOOD RESPONSE? I THINK NOT.-- In EVP-ITC@yahoog oups.com, \"Mis y\" ...> w o e:>> Opinions...e e yone has he igh o ha e hem. The g ea hing is > nobody has o ag ee wi h me on any gi en subjec and ice e sa =)> > B uce is co ec ha his g oup is ounded on he belie he oices > do exis .... as o who is on he o he end well e en he people he e > seem o ha e o med hie own ideas on ha . Some based on belie s > some based on esea ch some based on ins inc , some jus hough i  > up while wa ching a show ha led hem o join he e. O he s ha e > decided i doesn ma e who wha when whe e why o how i is being > done, jus he ac i is happening is enough o keep hei in e es . > No e e yone ha joins he e is a belie e . Bu e e yone ha joins > he e is cu ious and hope ully wan o lea n mo e.> > I ha e ac ually hea d his ques ion/idea s a ed be o e and > emen ioned ecen ly on a alk show dealing wi h u o/go e nmen  > echnology. I was only men ioned as possibili y and men ions o  > conduc ed expe imen s ha we e used on people.> > Look a ound you. The wo ld as we see i is indeed a ma ix, a peice > o a peice o a peice o a much la ge puzzle. In my own ITC many do > no claim o be o e e ha e been a \"human\" some do no e en ha e > names/labels un il hey a e gi en one.> > The ques ion b ough up some good esponses om you guys. Le 's > lea e i a ha and mo e on =)> > Mis y > > > --- In EVP-ITC@yahoog oups.com, b uce halliday > a ing@> w o e:> >> > > > Na han, > > > > I sugges you ead he headline and desc ip ion o his g oup.> > We a e a g oup o eal ime communica ion esea che s ha a e > > con inously seeking he u h. The ounde o his boa d > > M . F ank Sump ion has alway's made i clea ha I is no a place > > o scep ics and hey will no be ole a ed. We a e he e o s udy > and > > u he eal ime soi i communica ion, no ha e o de end e e y > pos  > > we make o ile we add. I sugges you ake you nega i e > accusa ions and > > de imen al un ounded c i icism and scep icism somewhe e else. > > > > You a e wea ing you welcome hin he e, no o men ion wi hin 5 > pos s > > you ha e con adic ed you sel h ee imes. and wen om he > philosophy > > o aliens ensla ing human spi i s o ques ioning any chance ha  > his me hod > > o spi i communica ion could o does exis and is a conspi icy o > ool unsuspec ing> > people like us by means o a supe ansmi e .> > > > I ha e lea ned by expe ience o y and keep his ype o pos  > ci il, So o any mode a o s ha a e eading his > > Please e iew he si ua ion.> > > > B uce Halliday> > B uce Halliday > > > > > > To: EVP-ITC@: 1c acke 75@: Sa , 12 Ap 2008 19:24:11 -> 0700Subjec : Re: [EVP-ITC] Re:Fi s SuCcess ul Reco dings - Na han > e: Hoax> > > > > > > > > > > > Na han, I am amazed you would sugges o e en hink ha ! I li e > in Ca y, No h Ca olina and eco d when I ha e he ime. The e is no > se schedule, and when I u n my adio on and someone says hello > Michael, o e en shou s ou \"Mike Edwa ds\", o a spi i ells me I am > holding a ca ing in my hand, who would e en know I u ned he adio > on? Only my wi e knows I eco d, and we ha e kep his esea ch om > ou child en as well as ou neighbo s. So you a e sugges ing ha  > Ma ga e , le s say who li es whe e I do no know, is playing a joke > on me wi h a high ech wo way adio?> > > > i cdeadpeople > w o e:> > > > > > Hi Na han. I always look o ele ance as a key in de e mining > whe he o no some hing is app op ia e o he session. I his we e > a hoax, I would hen ha e o seek an explana ion o how p i a e > in o ma ion is known by he 'hoax pe p', pa icula ly in o ma ion > ha would equi e isual awa eness. Some o us ha e examples o  > app op ia e esponses being gi en when asking hings like, \"Can you > name some hing nea by me?\" o \"Please ell me wha I'm holding in my > le hand.\" A sophis ica ed mul i- ansmission wo way adio would > no explain answe s which equi e ' isual' in o ma ion o some kind > ( hough I'll be he i s o admi my unde s anding o elec onics is > limi ed bu I'm ai ly con iden on his aspec .) O cou se, he e is > always he chance ha he pe son unning he hoax is also, o in > pa ne ship wi h, an ex emely alen ed emo e iewe o psychic who > is able o glean ha isual in o ma ion om he e he o he mind > o he expe imen e . And wha o hose examples whe e people ha e > con i med he sound o he oice being \"jus like\" ha o hei  > lo ed one in spi i ? Su ely he hoaxe isn' also able o mimic > people's lo ed ones.I you a e using EVP Make wi h any hing o he  > han he allophones ile, which con ains no wo ds o begin wi h, you > a e also unning he possibili y o ' alse posi i es' albei hey > wouldn' be om a hoax. Again, I look o ele ance o be key, and > ele an in o ha would no come easily o a s ange is e en > be e . Fo example, I u ned on my MiniBox o he e y i s ime > and said, \"Hello?\" and immedia ely ecei ed he esponse, \"Hello > Ma ga e .\" I his we e a hoax, how could ha pe son know in less > han 10 seconds, who I was by name. I had no gi en his in o ma ion > ou . No o men ion ha you ha e people expe imen ing 24/7 and > ecei ing simila esponses. How in he wo ld could an o ganiza ion > ha e he manpowe , echnology, o e en he desi e, o a emp such a > hoax? I mean ha as a genuine inqui y, because he e migh be an > explana ion I ha e no hough o . I ha e one example whe e, ia > adio sweep, my communica o was able o co ec ly iden i y he > s a us and loca ion o a missing pe son (who i u ns ou was ali e > and well, so we ended up wi h con i ma ion ha he in o gi en had > indeed been co ec - which is much less complica ed ha ying o > ack and unde s and he clues when associa ed wi h he dead, o  > missing bu no ound.) Again, i a hoax, would ha ha e simply been > a lucky guess on he pa o he hoaxe ?Bo om line o me is ... > ha e I wonde ed i i could be a hoax? O simply a o ui ous uning > o he dial? Yes, on bo h accoun s. Bu he e is enough compelling > e idence o ule ou bo h o hem as an explana ion o he a oo > many ele an examples ecei ed by so many o us.Good ood o  > hough , bu a e diges ing i , I'd ha e o say, \"No, a > sophis ica ed hoax does no su icien ly explain he phenomena on a > la ge scale.\"Ma ga e --- In EVP-ITC@yahoog oups.com, Na han Sha man > w o e:>> Has i e e occu ed o you, ha some one o > > o ganisa ion, could be using a adio o say he hings> you hea d?> > > This whole adio and spi i oices, could be a MASSIVE> HOAX, > pe pe ua ed by some one wi h a sophis ica ed> mul i- ansmission wo > way adio.> > Think abou i .> > THAT IS WHY I USE EVPmake only o > commuinca e wi h> he o he dimension.> > > __________________________________________________> Do You Yahoo!?> > Ti ed o spam? Yahoo! Mail has he bes spam p o ec ion a ound > > h p://mail.yahoo.com>Michael Edwa ds: Ca y, No h Ca olina. > 1c acke 75@ > > __________________________________________________Do You Yahoo!?> Ti ed o spam? Yahoo! Mail has he bes spam p o ec ion a ound > h p://mail.yahoo.com > > > > > > > > > > > > > > __________________________________________________________> > Mo e immedia e han e-mail? Ge ins an access wi h Windows Li e > Messenge .> > h p://www.windowsli e.com/messenge /o e iew.h ml?> ocid=TXT_TAGLM_WL_Re esh_ins an access_042008> >>"}