{"id": "9659", "subject": "Real Time Communication Method Using Sound Soap", "author": "bhali333", "timestamp": "2008-04-14T13:12:21Z", "full_text": "Hi Everyone,\n\nAnyone that is interested in using the sound soap program with the \nallaphone file method to do sessions. Here is a short explination of \nthe process.\n\nI also would like to thank my colleuge Steve Hultay for posting the \nstep by step instructions for using EVP maker with the allaphone file.\n\nAs Steve has offered, So will I. If anyone wants the sound soap \nprogram just e-mail me and I will send it to you.\n\nparanormalinvestigating@hotmail.com\n\nTo use the sound soap method, \n\n1.Open sound soap\n\n2.top menu bar click FILE, on the drop down menu click on \n&quot;open media file&quot;\n\n3.When the OPEN FILE window comes up, go to the folder with the \nallaphone file and double click the file.\n\n4.Set all features on the sound soap control panel to the &quot;off&quot; \nposition. There are are two up and down slide bars, left side is \nfor &quot;REMOVE CLICK AND CRACKLE&quot; the right side is for &quot;ENHANCE&quot; both \nOFF. There are  two round dials a right and left, make sure they are \nslid all the way &quot;COUNTER CLOCKWISE&quot;\n\n5.DO NOT TOUCH ANYTHING IN THE OVAL SHAPED PANEL.\n\n6.The play bar has two buttons back to back on the left side, the \nleft button is for returning the file to the beggining. The right \nbutton with the arrow is the play button. On the right side of the \nplay bar there is a button labeled apply. do not touch it.\n\n7.To use the program and do a session, click on the play button, when \nthe file begins to play click the moving slider arrow on the bottom \nof the play bar and hold down your left mouse button. Thios allows \nyou to &quot;DRAG THE SLIDER ARROW BACK AND FORTH ALONG THE PLAY BAR&quot;\n\n\nThis will facilitae manually scrambling the order the file plays in \nwhich allows our spirit friends to manipulate the tones into words.\n\nRemember to record your sessions! \nI will be posting a tutorial on how to go over a recording shortly.\n\nBruce Halliday"}