{"id": "9676", "subject": "Re: WARNING!! WARNING!!", "author": "Misty", "timestamp": "2008-04-14T17:11:50Z", "full_text": "This is a public forum so the world has access to read our research. \nPosting privledges are just that...a privledge. And this member has \nbeen informed privately and in public of this groups purpose as well \nas been offered help by other members. He has a right to his beliefs, \nhe just needs to find the correct forum to discuss them =)\n\nMisty\n\n--- In EVP-ITC@yahoogroups.com, Michael Edwards &lt;f1cracker75@...&gt; \nwrote:\n&gt;\n&gt; Misty, can you please remove Nathan&#39;s access to this site. I just \nspent the last several minutes deleting these e-mails that have \nnothing to do with our mission and research purposes of this site.\n&gt;    \n&gt;   Not sure about the rest of the members, but this guy is \ninterfering with our work and correspondence, and you have given him \nevery chance to shape up and respect our wishes.\n&gt;    \n&gt;   \n&gt; \n&gt; v1230mail &lt;v1230mail@...&gt; wrote:\n&gt;           PLEASE BE CAREFUL WITH THIS BOX EXPERIMENTATION, THERE IS \nA\n&gt; POSSIBILITY OF THE EXPERIMENTER BECOMING POSSESSED BY A SPIRIT, AND\n&gt; POSSESSION IS A REAL FACT.\n&gt; \n&gt; THE BEST WAY IS TO PROTECT ONESELF WITH A MEDITATION AND A PRAYER, \nAND\n&gt; THIS IS NOT COMING FROM ME, BUT FROM THE INVENTOR OF THE SPIRICOM \n&gt; George W. Meek, HE STATES THAT TWO EXPERIMENTERS WITH THE SPIRICOM\n&gt; BECAME POSSESSED AND ONE COMMITTED SUICIDE. \n&gt; \n&gt; HE GAVE A PRAYER TO USE BEFORE STARTING TO EXPERIMENT. HERE IS A \nLINK\n&gt; ON HOW TO AVOID UNPLEASANT SITUATIONS.\n&gt; http://www.worlditc.org/k_02_rodiehr_how_to_avoid.htm\n&gt; \n&gt; HERE IS THE LINK ABOUT THE DANGERS PLEASE READ AND FOLLOW THE\n&gt; PROTECTION GIVEN.\n&gt; http://www.worlditc.org/h_07_meek_spiri_082_089.htm \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, bruce halliday\n&gt; &lt;paranormalinvestigating@&gt; wrote:\n&gt; &gt;\n&gt; &gt; \n&gt; &gt; Holly,\n&gt; &gt; \n&gt; &gt; I certainlt do not mind you posting my advice to you or using my\n&gt; name in a post.\n&gt; &gt; \n&gt; &gt; When someone does that, it may strike a chord with someone that is\n&gt; experiencing \n&gt; &gt; a similar situation and will contact me and hopefully I can help \nthem.\n&gt; &gt; \n&gt; &gt; Please feel free to post anything you feel may br relevent.\n&gt; &gt; \n&gt; &gt; Bruce\n&gt; &gt; Bruce Halliday \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; To: EVP-ITC@: holly2422@: Sun, 13 Apr 2008 10:59:33\n&gt; +0000Subject: [EVP-ITC] testing session\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; Hi guys !!!I hope Bruce does not mind me posting this.I had\n&gt; questions whether my RS is working or not,so, I consulted with\n&gt; Bruce.He asked me a few questions on my set up and to send a test\n&gt; session. So, I let the session run on its own and sent him the raw\n&gt; file.Well, sure enough, it is working just fine. I had some static \nand\n&gt; learned to move the radio around to a better spot.But amazingly one \nof\n&gt; the messages was &quot; I want to see Bruce !&quot;You can hear it clear as \nday.\n&gt; Also, I got some vulgar messages and I wonder about this. When \nDebbie\n&gt; did a session with me in the beginning she got some eye opening\n&gt; messages for me. One was &quot;cut the bull ----&quot;. Debbie said that can&#39;t\n&gt; be !!! but it was right on !!! we were trying to contact my mom and\n&gt; that was one of her favorite sayings here !!! LOLHowever, the \nmessages\n&gt; Bruce recovered in my session were a little more vulgar and not\n&gt; something from my mom.I also had events in the house after starting\n&gt; recording sessions.The RS box would go on by itself, not while I was\n&gt; home, and I live alone. This happened several times, the third time \nI\n&gt; came home my computerized clothes dryer locked it&#39;s control panel, \nthe\n&gt; RS was on and my wireless router needed to be reset. I now need help\n&gt; with Audacity or sound booth. I don&#39;t know how to use it to clean \nthe\n&gt; background noise up.Thanks again Bruce (I hope you don&#39;t mind my\n&gt; posting !!??)Holly \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; __________________________________________________________\n&gt; &gt; Pack up or back upuse SkyDrive to transfer files or keep extra\n&gt; copies. Learn how.\n&gt; &gt;\n&gt; hthttp://www.windowslive.com/skydrive/overview.html?\nocid=TXT_TAGLM_WL_Refresh_skydrive_packup_042008\n&gt; &gt;\n&gt; \n&gt; \n&gt; \n&gt;                            \n&gt; \n&gt; \n&gt; Michael Edwards:  f1cracker75@...\n&gt;"}