{"id": "9705", "subject": "Most amazing message", "author": "Kristin", "timestamp": "2008-04-14T21:44:15Z", "full_text": "--9-3279194909-7879772872=:9\r\nContent-Type: text/plain; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nnow if anyone can actually hear it besides me it would be nice ...\n\nI have =\r\nbeen trying to get clarity about the number 7 and today&#39;s\nmessage was unusu=\r\nal.\n\nI asked them what the number 7 meant to them and in reply I heard:\nDON=\r\nT FAKE...  THE FIRST SON...  SHIVA JUSTICE...  THE SPIRIT (or could\nbe DESP=\r\nERATE).. THAT&#39;S ALL.\n\nI know what the first son probably refers to.. and I =\r\nhave heard of\nShiva but never &#39;Shiva Justice&#39;.. so I looked that up and thi=\r\ns is what\nI found in reference to the definition of Shiva Justice:\n\nfrom:  =\r\nhttp://www.experiencefestival.com/a/Siva_Shiva/id/137936\n\nSiva, Shiva (Sans=\r\nkrit) The third god of the Hindu Trimurti (trinity):\nBrahma the evolver; Vi=\r\nshnu the preserver; and Siva the regenerator or\ndestroyer.\n\nSiva is one of =\r\nthe three loftiest divinities of our solar system, and\nin his character of =\r\ndestroyer stands higher than Vishnu for he is &quot;the\ndestroying deity, evolut=\r\nion and PROGRESS personified, who is the\nregenerator at the same time; who =\r\ndestroys things under one form but\nto recall them to life under another mor=\r\ne perfect type&quot; (SD 2:182).\n\nAs the destroyer of outward forms he is called=\r\n Vamadeva.  Endowed with\nso\nmany powers and attributes, Siva possesses a gr=\r\neat number of names,\nand is represented under a corresponding variety of fo=\r\nrms. He\ncorresponds to the Palestinian Ba`al or Moloch, Saturn, the Phoenic=\r\nian\nEl, the Egyptian Seth, and the Biblical Chiun of Amos, and Greek Typhon=\r\n.\n\nSiva is known under more than a thousand names or titles and is\nrepresen=\r\nted under many different forms in Hindu writings. As the god\nof generation =\r\nand of justice, he is represented riding a white bull;\nhis own color, as we=\r\nll as that of the bull, is generally white,\nreferring probably to the unsul=\r\nlied purity of abstract justice. He is\nsometimes seen with two hands, somet=\r\nimes with four, eight, or ten; and\nwith five faces, representing among othe=\r\nr things his power over the\nfive elements.\n\n&quot;In the Rig Veda the name Siva =\r\nis unknown, but the god is called\nRudra, which is a word used for Agni, the=\r\n fire god . . .&quot;; &quot;In the\nVedas he is the divine Ego aspiring to return to =\r\nits pure, deific\nstate, and at the same time that divine ego imprisoned in =\r\nearthly\nform, whose fierce passions make of him the &#39;roarer,&#39; the &#39;terrible=\r\n&#39; &quot;\n(SD 2:613, 548).\n\nSiva is often spoken of as the patron deity of esoter=\r\nicists,\noccultists, and ascetics; he is called the Mahayogin (the great\nasc=\r\netic), from whom the highest spiritual knowledge is acquired, and\nunion wit=\r\nh the great spirit of the universe is eventually gained. Here\nhe is &quot;the ho=\r\nwling and terrific destroyer of human passions and\nphysical senses, which a=\r\nre ever in the way of the development of the\nhigher spiritual perceptions a=\r\nnd the growth of the inner eternal man\n-- mystically . . . Siva-Rudra is th=\r\ne Destroyer, as Vishnu is the\npreserver; and both are the regenerators of s=\r\npiritual as well as of\nphysical nature. To live as a plant, the seed must d=\r\nie. To live as a\nconscious entity in the Eternity, the passions and senses =\r\nof man must\nfirst die before his body does. &#39;To live is to die and to die i=\r\ns to\nlive,&#39; has been too little understood in the West. Siva, the\ndestroyer=\r\n, is the creator and the Saviour of Spiritual man, as he is\nthe good garden=\r\ner of nature. He weeds out the plants, human and\ncosmic, and kills the pass=\r\nions of the physical, to call to life the\nperceptions of the spiritual, man=\r\n&quot; (SD 1:459&n).\n\r\n--9-3279194909-7879772872=:9\r\nContent-Type: text/html; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;font face=3D&quot;arial&quot;&gt;now if anyone can actually hear it besides me it would=\r\n be nice ... &nbsp;&lt;br&gt;&lt;br&gt;I have been trying to get clarity about the numb=\r\ner 7 and today&#39;s&lt;br&gt;message was unusual.&lt;br&gt;&lt;br&gt;I asked them what the numbe=\r\nr 7 meant to them and in reply I heard:&lt;br&gt;DONT FAKE...&nbsp; THE FIRST SON=\r\n...&nbsp; SHIVA JUSTICE...&nbsp; THE SPIRIT (or could&lt;br&gt;be DESPERATE).. TH=\r\nAT&#39;S ALL.&lt;br&gt;&lt;br&gt;I know what the first son probably refers to.. and I have =\r\nheard of&lt;br&gt;Shiva but never &#39;Shiva Justice&#39;.. so I looked that up and this =\r\nis what&lt;br&gt;I found in reference to the definition of Shiva Justice:&lt;/font&gt;&lt;=\r\nbr&gt;&lt;br&gt;from:&nbsp; http://www.experiencefestival.com/a/Siva_Shiva/id/137936=\r\n&lt;br&gt;&lt;br&gt;&lt;u&gt;Siva, Shiva (Sanskrit) The third god of the Hindu Trimurti (trin=\r\nity)&lt;/u&gt;:&lt;br&gt;Brahma the evolver; Vishnu the preserver; and Siva the regener=\r\nator or&lt;br&gt;destroyer.&lt;br&gt;&lt;br&gt;Siva is one of the three loftiest divinities o=\r\nf our solar system, and&lt;br&gt;in his character of destroyer stands higher than=\r\n Vishnu for he is &quot;the&lt;br&gt;destroying deity, evolution and PROGRESS personif=\r\nied, who is the&lt;br&gt;regenerator at the same time; who destroys things under =\r\none form but&lt;br&gt;to recall them to life under another more perfect type&quot; (SD=\r\n 2:182). &lt;br&gt;&lt;br&gt;As the destroyer of outward forms he is called Vamadeva.&n=\r\nbsp; Endowed with so&lt;br&gt;many powers and attributes, Siva possesses a great =\r\nnumber of names,&lt;br&gt;and is represented under a corresponding variety of for=\r\nms. He&lt;br&gt;corresponds to the Palestinian Ba`al or Moloch, Saturn, the Phoen=\r\nician&lt;br&gt;El, the Egyptian Seth, and the Biblical Chiun of Amos, and Greek T=\r\nyphon.&lt;br&gt;&lt;br&gt;Siva is known under more than a thousand names or titles and =\r\nis&lt;br&gt;represented under many different forms in Hindu writings. &lt;u&gt;As the g=\r\nod&lt;br&gt;of generation and of justice&lt;/u&gt;, he is represented riding a white bu=\r\nll;&lt;br&gt;his own color, as well as that of the bull, is generally white,&lt;br&gt;r=\r\neferring probably to the unsullied purity of abstract justice. He is&lt;br&gt;som=\r\netimes seen with two hands, sometimes with four, eight, or ten; and&lt;br&gt;with=\r\n five faces, representing among other things his power over the&lt;br&gt;five ele=\r\nments.&lt;br&gt;&lt;br&gt;&quot;In the Rig Veda the name Siva is unknown, but the god is cal=\r\nled&lt;br&gt;Rudra, which is a word used for Agni, the fire god . . .&quot;; &quot;In the&lt;b=\r\nr&gt;Vedas he is the divine Ego aspiring to return to its pure, deific&lt;br&gt;stat=\r\ne, and at the same time that divine ego imprisoned in earthly&lt;br&gt;form, whos=\r\ne fierce passions make of him the &#39;roarer,&#39; the &#39;terrible&#39; &quot;&lt;br&gt;(SD 2:613, =\r\n548).&lt;br&gt;&lt;br&gt;Siva is often spoken of as the patron deity of esotericists,&lt;b=\r\nr&gt;occultists, and ascetics; he is called the Mahayogin (the great&lt;br&gt;asceti=\r\nc), from whom the highest spiritual knowledge is acquired, and&lt;br&gt;union wit=\r\nh the great spirit of the universe is eventually gained. Here&lt;br&gt;he is &quot;the=\r\n howling and terrific destroyer of human passions and&lt;br&gt;physical senses, w=\r\nhich are ever in the way of the development of the&lt;br&gt;higher spiritual perc=\r\neptions and the growth of the inner eternal man&lt;br&gt;-- mystically . . . Siva=\r\n-Rudra is the Destroyer, as Vishnu is the&lt;br&gt;preserver; and both are the re=\r\ngenerators of spiritual as well as of&lt;br&gt;physical nature. To live as a plan=\r\nt, the seed must die. To live as a&lt;br&gt;conscious entity in the Eternity, the=\r\n passions and senses of man must&lt;br&gt;first die before his body does. &#39;To liv=\r\ne is to die and to die is to&lt;br&gt;live,&#39; has been too little understood in th=\r\ne West. Siva, the&lt;br&gt;destroyer, is the creator and the Saviour of Spiritual=\r\n man, as he is&lt;br&gt;the good gardener of nature. He weeds out the plants, hum=\r\nan and&lt;br&gt;cosmic, and kills the passions of the physical, to call to life t=\r\nhe&lt;br&gt;perceptions of the spiritual, man&quot; (SD 1:459&amp;n).\n\r\n--9-3279194909-7879772872=:9--"}