{"id": "9708", "subject": "Re: [EVP-ITC] Re: Transfering my recorded session to my computer", "author": "Wiliam Clarke", "timestamp": "2008-04-14T22:02:56Z", "full_text": "--0-398352120-1208210576=:75013\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nI&#39;ve looked for a patch cord for a couple of months\n\nitcdeadpeople &lt;ITCdeadpeople@...&gt; wrote:          Hi Kay. Just use the patch cord I described in my previous response ... connect it from the \nheadphone jack on the recorder to the mic jack on your computer. Open Audacity (or \nwhatever), hit the record button, then hit the play button on the recorder to play the \nsession into the computer. \n\nWhen you&#39;re done, press the stop button on the recording software, the stop button on \nthe recorder itself, and then save your session. From there, you can begin to work with it, \nwithout worry of losing any data. Just be sure when you close the file DON&#39;T SAVE \nCHANGES on the original, so you always have the raw version to refer back to.\n\nYou can do this same thing with any recorder that has an earphone jack. Just go with the \none you are drawn to. There are a bunch of them on eBay. If you are doing sweep, you \ndon&#39;t even need a digital recorder, just plug in a mic into your computer and record on it. \nThis saves you all the time and hassle of moving the file from the recorder into your \ncomputer. That&#39;s what I do. You really only need a digital recorder for traditional work or \nportability (unless you have a laptop, which is pretty easy to take with you.) :-)\n\nMargaret\n\n--- In EVP-ITC@yahoogroups.com, &quot;psfponies&quot; &lt;psfponies@...&gt; wrote:\n&gt;\n&gt; Can anyone tell what would be the best way to transfer a session I \n&gt; recorded on an older microcassette recorder to my computer? \n&gt; \n&gt; I did my first recorded session last night. All went great except for \n&gt; the lousy reception. I didn&#39;t realize just how much you miss during a \n&gt; real time session when you play back what you recorded. \n&gt; \n&gt; I got two different Steve&#39;s one sounded Australian and a Mike. I also \n&gt; got the number &quot;Seven&quot; I am sure there is lots more there but my \n&gt; reception was so bad I can&#39;t hear everything.\n&gt; \n&gt; Also what would be a good digital recorder (relatively cheap) to get \n&gt; that you can easily transfer to your computer?\n&gt; \n&gt; Any help would be appreciated.\n&gt; \n&gt; Kay\n&gt;\n\n\n\n                           \n\n        \r\n--0-398352120-1208210576=:75013\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nI&#39;ve looked for a patch cord for a couple of months&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;itcdeadpeople &lt;ITCdeadpeople@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;div&gt;Hi Kay. Just use the patch cord I described in my previous response ... connect it from the &lt;BR&gt;headphone jack on the recorder to the mic jack on your computer. Open Audacity (or &lt;BR&gt;whatever), hit the record button, then hit the play button on the recorder to play the &lt;BR&gt;session into the computer. &lt;BR&gt;&lt;BR&gt;When you&#39;re done, press the stop button on the recording software, the stop button on &lt;BR&gt;the recorder itself, and then save your session.\n From there, you can begin to work with it, &lt;BR&gt;without worry of losing any data. Just be sure when you close the file DON&#39;T SAVE &lt;BR&gt;CHANGES on the original, so you always have the raw version to refer back to.&lt;BR&gt;&lt;BR&gt;You can do this same thing with any recorder that has an earphone jack. Just go with the &lt;BR&gt;one you are drawn to. There are a bunch of them on eBay. If you are doing sweep, you &lt;BR&gt;don&#39;t even need a digital recorder, just plug in a mic into your computer and record on it. &lt;BR&gt;This saves you all the time and hassle of moving the file from the recorder into your &lt;BR&gt;computer. That&#39;s what I do. You really only need a digital recorder for traditional work or &lt;BR&gt;portability (unless you have a laptop, which is pretty easy to take with you.) :-)&lt;BR&gt;&lt;BR&gt;Margaret&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;, &quot;psfponies&quot; &lt;psfponies@.&lt;WBR&gt;..&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; Can anyone tell what would be the best way to\n transfer a session I &lt;BR&gt;&gt; recorded on an older microcassette recorder to my computer? &lt;BR&gt;&gt; &lt;BR&gt;&gt; I did my first recorded session last night. All went great except for &lt;BR&gt;&gt; the lousy reception. I didn&#39;t realize just how much you miss during a &lt;BR&gt;&gt; real time session when you play back what you recorded. &lt;BR&gt;&gt; &lt;BR&gt;&gt; I got two different Steve&#39;s one sounded Australian and a Mike. I also &lt;BR&gt;&gt; got the number &quot;Seven&quot; I am sure there is lots more there but my &lt;BR&gt;&gt; reception was so bad I can&#39;t hear everything.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Also what would be a good digital recorder (relatively cheap) to get &lt;BR&gt;&gt; that you can easily transfer to your computer?&lt;BR&gt;&gt; &lt;BR&gt;&gt; Any help would be appreciated.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Kay&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/div&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;p&gt;&#32;\n\n      &nbsp;\r\n--0-398352120-1208210576=:75013--"}