{"id": "9732", "subject": "Re: [EVP-ITC] Most amazing message", "author": "Lisby", "timestamp": "2008-04-15T01:11:08Z", "full_text": "To me, &quot;Shiva justice&quot; could be interpreted as &quot;cosmic justice&quot; or  \nthe immutability of Karma as a natural element of creation--a fancy  \nway of saying that it comes right in the end, although we may not be  \nable to see it with our limited eyes. Or, as the plants at FIndhorn,  \nScotland, used to say, &quot;Be calm and know that all is very well&quot; (en  \nperpetua, as opposed to this very moment, although the eternal is  \nreflected in the moment).\n\nAnn\n\n\n\nOn Apr 14, 2008, at 8:10 PM, Kristin Morris wrote:\n\n&gt;\n&gt; I know Ann.  I am so amazed by this one message and I was hoping  \n&gt; someone else saw its significance as well.  I know I glossed over  \n&gt; the mention of the first son.. whom I believe they meant to  \n&gt; reference Jesus of course.  But when I heard Shiva Justice – and  \n&gt; then found the two words together and that they had actual meaning  \n&gt; without my previous knowledge of it (I must admit I am a bit  \n&gt; ignorant on religious icons) kinda of blew my socks off.\n&gt;\n&gt;\n&gt;\n&gt; The metaphysical meaning expressed after such as question as what  \n&gt; they though 7 meant astounds me.  And then to know that I got this  \n&gt; message the same day I received the Dr, Pepper versus Coke Cola  \n&gt; message was just icing J\n&gt;\n&gt; k\n&gt;\n&gt;\n&gt;\n&gt; From: EVP-ITC@yahoogroups.com [mailto:EVP-ITC@yahoogroups.com] On  \n&gt; Behalf Of Lisby\n&gt; Sent: Monday, April 14, 2008 6:28 PM\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Subject: Re: [EVP-ITC] Most amazing message\n&gt;\n&gt;\n&gt;\n&gt; There&#39;s one more aspect of Shiva that ought to be mentioned:  \n&gt; Nataraj--the one whose dance turns the universe. Within Lord  \n&gt; Shiva&#39;s dancing manifestation is represented not only all of time  \n&gt; and space, but also the primal creative force that is beyond the  \n&gt; circle of illusion that mortals live within, all movement and  \n&gt; vibration of the universe, and the stillness beyond all existence.  \n&gt; Shiva is the turning and churning cosmos, but also only an aspect  \n&gt; and channeler of a higher frequency--Aum, which perhaps is the  \n&gt; divine frequency, or in other words, &quot;God.&quot;\n&gt;\n&gt;\n&gt;\n&gt; The metaphysics and advanced physics expressed by the Shiva  \n&gt; symbology is stunning.\n&gt;\n&gt;\n&gt;\n&gt; Ann\n&gt;\n&gt;\n&gt;\n&gt; On Apr 14, 2008, at 5:44 PM, Kristin wrote:\n&gt;\n&gt;\n&gt; now if anyone can actually hear it besides me it would be nice ...\n&gt;\n&gt; I have been trying to get clarity about the number 7 and today&#39;s\n&gt; message was unusual.\n&gt;\n&gt; I asked them what the number 7 meant to them and in reply I heard:\n&gt; DONT FAKE... THE FIRST SON... SHIVA JUSTICE... THE SPIRIT (or could\n&gt; be DESPERATE).. THAT&#39;S ALL.\n&gt;\n&gt; I know what the first son probably refers to.. and I have heard of\n&gt; Shiva but never &#39;Shiva Justice&#39;.. so I looked that up and this is what\n&gt; I found in reference to the definition of Shiva Justice:\n&gt;\n&gt; from: http://www.experiencefestival.com/a/Siva_Shiva/id/137936\n&gt;\n&gt; Siva, Shiva (Sanskrit) The third god of the Hindu Trimurti (trinity):\n&gt; Brahma the evolver; Vishnu the preserver; and Siva the regenerator or\n&gt; destroyer.\n&gt;\n&gt; Siva is one of the three loftiest divinities of our solar system, and\n&gt; in his character of destroyer stands higher than Vishnu for he is &quot;the\n&gt; destroying deity, evolution and PROGRESS personified, who is the\n&gt; regenerator at the same time; who destroys things under one form but\n&gt; to recall them to life under another more perfect type&quot; (SD 2:182).\n&gt;\n&gt; As the destroyer of outward forms he is called Vamadeva. Endowed  \n&gt; with so\n&gt; many powers and attributes, Siva possesses a great number of names,\n&gt; and is represented under a corresponding variety of forms. He\n&gt; corresponds to the Palestinian Ba`al or Moloch, Saturn, the Phoenician\n&gt; El, the Egyptian Seth, and the Biblical Chiun of Amos, and Greek  \n&gt; Typhon.\n&gt;\n&gt; Siva is known under more than a thousand names or titles and is\n&gt; represented under many different forms in Hindu writings. As the god\n&gt; of generation and of justice, he is represented riding a white bull;\n&gt; his own color, as well as that of the bull, is generally white,\n&gt; referring probably to the unsullied purity of abstract justice. He is\n&gt; sometimes seen with two hands, sometimes with four, eight, or ten; and\n&gt; with five faces, representing among other things his power over the\n&gt; five elements.\n&gt;\n&gt; &quot;In the Rig Veda the name Siva is unknown, but the god is called\n&gt; Rudra, which is a word used for Agni, the fire god . . .&quot;; &quot;In the\n&gt; Vedas he is the divine Ego aspiring to return to its pure, deific\n&gt; state, and at the same time that divine ego imprisoned in earthly\n&gt; form, whose fierce passions make of him the &#39;roarer,&#39; the &#39;terrible&#39; &quot;\n&gt; (SD 2:613, 548).\n&gt;\n&gt; Siva is often spoken of as the patron deity of esotericists,\n&gt; occultists, and ascetics; he is called the Mahayogin (the great\n&gt; ascetic), from whom the highest spiritual knowledge is acquired, and\n&gt; union with the great spirit of the universe is eventually gained. Here\n&gt; he is &quot;the howling and terrific destroyer of human passions and\n&gt; physical senses, which are ever in the way of the development of the\n&gt; higher spiritual perceptions and the growth of the inner eternal man\n&gt; -- mystically . . . Siva-Rudra is the Destroyer, as Vishnu is the\n&gt; preserver; and both are the regenerators of spiritual as well as of\n&gt; physical nature. To live as a plant, the seed must die. To live as a\n&gt; conscious entity in the Eternity, the passions and senses of man must\n&gt; first die before his body does. &#39;To live is to die and to die is to\n&gt; live,&#39; has been too little understood in the West. Siva, the\n&gt; destroyer, is the creator and the Saviour of Spiritual man, as he is\n&gt; the good gardener of nature. He weeds out the plants, human and\n&gt; cosmic, and kills the passions of the physical, to call to life the\n&gt; perceptions of the spiritual, man&quot; (SD 1:459&n).\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; \n\n\nTo me, \"Shi a jus ice\" could be in e p e ed as \"cosmic jus ice\" o he immu abili y o Ka ma as a na u al elemen o c ea ion--a ancy way o saying ha i comes igh in he end, al hough we may no be able o see i wi h ou limi ed eyes. O , as he plan s a FIndho n, Sco land, used o say, \"Be calm and know ha all is e y well\" (en pe pe ua, as opposed o his e y momen , al hough he e e nal is e lec ed in he momen ).AnnOn Ap 14, 2008, a 8:10 PM, K is in Mo is w o e:I know Ann.  I am so amazed by his one message and I was hoping someone else saw i s signi icance as well.  I know I glossed o e he men ion o he i s son.. whom I belie e hey mean o e e ence Jesus o cou se.  Bu when I hea d Shi a Jus ice – and hen ound he wo wo ds oge he and ha hey had ac ual meaning wi hou my p e ious knowledge o i (I mus admi I am a bi igno an on eligious icons) kinda o blew my socks o . The me aphysical meaning exp essed a e such as ques ion as wha hey hough 7 mean as ounds me.  And hen o know ha I go his message he same day I ecei ed he D , Peppe e sus Coke Cola message was jus icing Jk F om: EVP-ITC@yahoog oups.com [mail o:EVP-ITC@yahoog oups.com] On Behal O  LisbySen : Monday, Ap il 14, 2008 6:28 PMTo: EVP-ITC@yahoog oups.comSubjec : Re: [EVP-ITC] Mos amazing message The e's one mo e aspec o Shi a ha ough o be men ioned: Na a aj-- he one whose dance u ns he uni e se. Wi hin Lo d Shi a's dancing mani es a ion is ep esen ed no only all o ime and space, bu also he p imal c ea i e o ce ha is beyond he ci cle o illusion ha mo als li e wi hin, all mo emen and ib a ion o he uni e se, and he s illness beyond all exis ence. Shi a is he u ning and chu ning cosmos, bu also only an aspec and channele o a highe equency--Aum, which pe haps is he di ine equency, o in o he wo ds, \"God.\" The me aphysics and ad anced physics exp essed by he Shi a symbology is s unning. Ann On Ap 14, 2008, a 5:44 PM, K is in w o e:now i anyone can ac ually hea i besides me i would be nice ... I ha e been ying o ge cla i y abou he numbe 7 and oday'smessage was unusual.I asked hem wha he numbe 7 mean o hem and in eply I hea d:DONT FAKE... THE FIRST SON... SHIVA JUSTICE... THE SPIRIT (o couldbe DESPERATE).. THAT'S ALL.I know wha he i s son p obably e e s o.. and I ha e hea d o Shi a bu ne e 'Shi a Jus ice'.. so I looked ha up and his is wha I ound in e e ence o he de ini ion o Shi a Jus ice: om: h p://www.expe ience es i al.com/a/Si a_Shi a/id/137936Si a, Shi a (Sansk i ) The hi d god o he Hindu T imu i ( ini y):B ahma he e ol e ; Vishnu he p ese e ; and Si a he egene a o o des oye .Si a is one o he h ee lo ies di ini ies o ou sola sys em, andin his cha ac e o des oye s ands highe han Vishnu o he is \" hedes oying dei y, e olu ion and PROGRESS pe soni ied, who is he egene a o a he same ime; who des oys hings unde one o m bu o ecall hem o li e unde ano he mo e pe ec ype\" (SD 2:182). As he des oye o ou wa d o ms he is called Vamade a. Endowed wi h somany powe s and a ibu es, Si a possesses a g ea numbe o names,and is ep esen ed unde a co esponding a ie y o o ms. Heco esponds o he Pales inian Ba`al o Moloch, Sa u n, he PhoenicianEl, he Egyp ian Se h, and he Biblical Chiun o Amos, and G eek Typhon.Si a is known unde mo e han a housand names o i les and is ep esen ed unde many di e en o ms in Hindu w i ings. As he godo gene a ion and o jus ice, he is ep esen ed iding a whi e bull;his own colo , as well as ha o he bull, is gene ally whi e, e e ing p obably o he unsullied pu i y o abs ac jus ice. He issome imes seen wi h wo hands, some imes wi h ou , eigh , o en; andwi h i e aces, ep esen ing among o he hings his powe o e he i e elemen s.\"In he Rig Veda he name Si a is unknown, bu he god is calledRud a, which is a wo d used o Agni, he i e god . . .\"; \"In heVedas he is he di ine Ego aspi ing o e u n o i s pu e, dei ics a e, and a he same ime ha di ine ego imp isoned in ea hly o m, whose ie ce passions make o him he ' oa e ,' he ' e ible' \"(SD 2:613, 548).Si a is o en spoken o as he pa on dei y o eso e icis s,occul is s, and asce ics; he is called he Mahayogin ( he g ea asce ic), om whom he highes spi i ual knowledge is acqui ed, andunion wi h he g ea spi i o he uni e se is e en ually gained. He ehe is \" he howling and e i ic des oye o human passions andphysical senses, which a e e e in he way o he de elopmen o hehighe spi i ual pe cep ions and he g ow h o he inne e e nal man-- mys ically . . . Si a-Rud a is he Des oye , as Vishnu is hep ese e ; and bo h a e he egene a o s o spi i ual as well as o physical na u e. To li e as a plan , he seed mus die. To li e as aconscious en i y in he E e ni y, he passions and senses o man mus i s die be o e his body does. 'To li e is o die and o die is oli e,' has been oo li le unde s ood in he Wes . Si a, hedes oye , is he c ea o and he Sa iou o Spi i ual man, as he is he good ga dene o na u e. He weeds ou he plan s, human andcosmic, and kills he passions o he physical, o call o li e hepe cep ions o he spi i ual, man\" (SD 1:459&n)."}