{"id": "9851", "subject": "A CHUCKEL", "author": "shadow71414", "timestamp": "2008-04-16T02:27:57Z", "full_text": "In the photo section I have just uploaded a few photos for your \nreview.  I would certainly like your honest opinion, for my own has \nbeen reached long ago.  They are photos of what are professed to be \nparanormal in nature, and given the initial viewing I could not \nfathom for a minute that these could in fact be taken as serious data \nand advertised as true spirit photography.\n\nIn addition, I have also listed some articles and background \ninformation on this gentleman who proclaims to be highly experienced \nin the paranormal community, with a long list of degrees under his \nbelt.\n\nThe dilemma that I am now presented with is the fact that giving the \nparanormal community is based on a belief system that life after dead \ndoes in fact exist.  With this false material being presented, we \n(the paranormal community as a whole) will never be taken seriously.  \nWhat many paranormal investigators strive for almost seems \nunreachable, and yet those who continue to display false data are a \ndirect reflection of all us in the community tarnishing our good \nname.  It&#39;s bad enough that we have do go up against skeptics \neveryday, but to have self proclaim paranormal experts producing \nfaked evidence, certainly is a disgrace to us all, and should apology \nfor his dishonesty and misleading those who ever gave him the benefit \nof the doubt.  \n\n    They were my photographs, taken with two different cameras. One \nwas an Olympus Trip AF 50, a kind of instamatic type 35mm, and the \nother was a Yashica J-7. In all photos where the anomalies were \ncaptured, the film type was fuji, ASA 400 color film. The photos were \nscanned in at 400 dpi. The digital copies were enhanced to show up \nbetter o\n\nYou can pretend you didn&#39;t see the analysis and the\naccompanying write up, but you would be lying. It was posted on the\nPP site by the Zoellers as well as passed around in an e-mail to\neveryone. You also know that the person asked to remain anonymous as\nhe is still active in the service... He also has ten years of\nexperience working for a photographic studio.\n\nThe photos are an old argument. If you recall, (and let me refresh\nyour memory as you seem to have selective memory since you came over\nto this group) when I gave the originals to John and said I would no\nlonger respond to any more questions concerning the photos. As I\nstated then, let john have them analyzed. He could just as easily\nsend them to whomever.\n\n\n\nWhen I went to College there was no degree for Audio Engineering. You \nspecialized in Acoustics and electrical Engineering.\n \n\n    Articles that he supply and that mentions his name and explains \nwhat he dose for a living. \n\nhttp://www.bssaudio.com/news_view.php?id=50\n \nhttp://systemscontractor.com/articles/publish/article_590.shtml\n \nhttp://www.admark.cn/manage/31/200677144117.htm\n \nhttp://www.aes.org/member/profile.cfm?ID=1435424442\n .\n \n The articles listed below were uncovered by Melanie K. Hale and have \ncome into question regarding the same.  Numbers don&#39;t lie, I guess \npeople do.  Mr. Roundtree seems to think  that it is right to lead us \nto believe he is something he&#39;s not, and that all published material \nis his for the taking. \n \n  So I did a little math and found the actual percentage of original \nmaterial in each of David Roundtree&#39;s papers I linked.  I did this by \nopening in word, then selecting &quot;Tools&quot;&gt;&quot;Word Count&quot; and wrote down \nthe total for Words.  Then I deleted all linked materials and did the \nsame &quot;Tools&quot; &gt; &quot;Word Count&quot;.  Then I took the second number and \ndivided it by the first number.  Here are the results linked to the \noriginal document on David&#39;s site:\n \nAnalog_or_digital. doc  =  38% original material  62% taken from \nother sources\n \nBiofeedback_ Experiment. doc = 10% original material  90% taken from \nother sources\n \nEVP_Project_ Phase_1.doc = 31% original material  69% taken from \nother sources\n \nEVP_Project_ Phase_2.doc = 43% original material  57% taken from \nother sources\n \nOrbs-The_Search_ for_the_Truth. doc = 32% original material  68% \ntaken from other sources\n \nThe_Magic_that_ is_Light. doc = 0% original material  100%\n\n\n\nPhoto in the file section under Dave Rountree\n\n\nDavid M. Rountree - AES IFSA\n&gt; &gt; &gt; &gt; Director\n&gt; &gt; &gt; &gt; Skylands Paranormal Investigations\nDavid Rountree&quot; &lt;ghost_hunter_01@... David M.. Rountree - AES  \nIFSA\nDirector\nSkylands Paranormal Investigations"}