{"id": "9855", "subject": "Re: Transfering my recorded session to my computer", "author": "itcdeadpeople", "timestamp": "2008-04-16T04:45:33Z", "full_text": "Hi Kay.  I see that it&#39;s a bug (just googled the error message).  Did you download the \nSTABLE version of Audacity or the BETA?  It seems to be a problem with version 1.3.4, and \npeople are saying uninstall it and use an older version.  Looks like the latest stable version \nfor Windows is 1.2.6\n\nBe sure you also get the LAME add-on which will allow you to export your files as MP3.  \nWithout it,  your only option is WAV, which is much larger.  \n\nHope this helps some.  :-)\n\nMargaret\n\n--- In EVP-ITC@yahoogroups.com, &quot;psfponies&quot; &lt;psfponies@...&gt; wrote:\n&gt;\n&gt; Margaret \n&gt; \n&gt; I am getting an error message when I start the record button on the \n&gt; Audacity program.\n&gt; \n&gt;  It says Error while opening sound device. Please check the imput \n&gt; device setting and the project sample rate.\n&gt; \n&gt; Any advice?\n&gt; \n&gt; Kay\n&gt; \n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;itcdeadpeople&quot; &lt;ITCdeadpeople@&gt; \n&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hi Kay.  Just use the patch cord I described in my previous \n&gt; response ... connect it from the \n&gt; &gt; headphone jack on the recorder to the mic jack on your computer.  \n&gt; Open Audacity (or \n&gt; &gt; whatever), hit the record button, then hit the play button on the \n&gt; recorder to play the \n&gt; &gt; session into the computer.  \n&gt; &gt; \n&gt; &gt; When you&#39;re done, press the stop button on the recording software, \n&gt; the stop button on \n&gt; &gt; the recorder itself, and then save your session.  From there, you \n&gt; can begin to work with it, \n&gt; &gt; without worry of losing any data.  Just be sure when you close the \n&gt; file DON&#39;T SAVE \n&gt; &gt; CHANGES on the original, so you always have the raw version to \n&gt; refer back to.\n&gt; &gt; \n&gt; &gt; You can do this same thing with any recorder that has an earphone \n&gt; jack.  Just go with the \n&gt; &gt; one you are drawn to.  There are a bunch of them on eBay.  If you \n&gt; are doing sweep, you \n&gt; &gt; don&#39;t even need a digital recorder, just plug in a mic into your \n&gt; computer and record on it.  \n&gt; &gt; This saves you all the time and hassle of moving the file from the \n&gt; recorder into your \n&gt; &gt; computer.  That&#39;s what I do.  You really only need a digital \n&gt; recorder for traditional work or \n&gt; &gt; portability (unless you have a laptop, which is pretty easy to take \n&gt; with you.)  :-)\n&gt; &gt; \n&gt; &gt; Margaret\n&gt; &gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, &quot;psfponies&quot; &lt;psfponies@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; Can anyone tell what would be the best way to transfer a session \n&gt; I \n&gt; &gt; &gt; recorded on an older microcassette recorder to my computer? \n&gt; &gt; &gt; \n&gt; &gt; &gt; I did my first recorded session last night. All went great except \n&gt; for \n&gt; &gt; &gt; the lousy reception. I didn&#39;t realize just how much you miss \n&gt; during a \n&gt; &gt; &gt; real time session when you play back what you recorded. \n&gt; &gt; &gt; \n&gt; &gt; &gt; I got two different Steve&#39;s one sounded Australian and a Mike. I \n&gt; also \n&gt; &gt; &gt; got the number &quot;Seven&quot; I am sure there is lots more there but my \n&gt; &gt; &gt; reception was so bad I can&#39;t hear everything.\n&gt; &gt; &gt; \n&gt; &gt; &gt; Also what would be a good digital recorder (relatively cheap) to \n&gt; get \n&gt; &gt; &gt; that you can easily transfer to your computer?\n&gt; &gt; &gt; \n&gt; &gt; &gt; Any help would be appreciated.\n&gt; &gt; &gt; \n&gt; &gt; &gt; Kay\n&gt; &gt; &gt;\n&gt; &gt;\n&gt;"}