{"id": "9857", "subject": "Re: Voice to Print Software Results", "author": "itcdeadpeople", "timestamp": "2008-04-16T05:15:20Z", "full_text": "Wow, Aaron.  That&#39;s awesome info.  Thanks for taking the time to do that.  Did you, by \nchance, then compare the EVP Maker recording to see if you heard any meaningful \nphrases, or if the software was interpreting it pretty close to what you are hearing?\n\nVery interesting!\n\nMargaret\n\n--- In EVP-ITC@yahoogroups.com, &quot;kolrone&quot; &lt;a.cronk@...&gt; wrote:\n&gt;\n&gt; Alright, I went ahead and practiced some with the Naturally Speaking\n&gt; Software. You have to go through training before anything is\n&gt; recognized and you have to read passages on screen. So I went ahead\n&gt; and started reading everything in a monotone type voice. I tried to\n&gt; imitate the allophone file from EVPMaker as close as possible. &quot;Or&quot;\n&gt; showed up many times, and at one point it made me laugh because it\n&gt; showed up as &quot;or you are a boy toy.&quot; Much of this was when I left the\n&gt; room and let EVPMaker play into the mic. What was interesting was that\n&gt; I left the room because I was on the phone with my friend that is a\n&gt; girl. But I don&#39;t think the boy toy remark really applied to me. lol.\n&gt; Here are the results (Sorry it is so much and not formatted very well,\n&gt; it&#39;s just a quick copy and paste job):\n&gt; \n&gt; there were born or or or or or or or the other or or or or or or or or\n&gt; or or or or or or or or or or or or or or or that it would or he or\n&gt; she should be in our own or own or your two or or or or or are you\n&gt; going to go to open it or you are or are you going to go in and go\n&gt; over there or you know you are all sure what one of only what it would\n&gt; go on for a very poor boy is over 100004 are or who one point or ergo\n&gt; I know you or you are so one or two or are you or or or or or or or\n&gt; live on only all of you are one or the other point or they will go to\n&gt; know there are good you are your own and you know you are or do you\n&gt; know all you go to her own euro hole or no clue who you or to give him\n&gt; or or or or toy that you own or her own will go you will go no more\n&gt; going for it or go you own your own if you are going to 00 you are\n&gt; able to .22 or or or oil and no 1.1 or go out with all of you will go\n&gt; to or forgo their old or older are over or two or 20211000 or go or to\n&gt; a router or two or or to go to go to a go to one or two over for a few\n&gt; photo who you go to a 120 or or or or 000 or 01 to live in their go to\n&gt; a go for older or 200 is a very good one or a go go go on one or two\n&gt; more home to you and your only hope a new photo you are or what they\n&gt; do go on a ploy to war to a go-go you are sure you will or will he go\n&gt; to go to a girl or a little over one or all you or or or or or or or\n&gt; go or rule and you shall do to total of only 442 or 412 or no audit or\n&gt; her own or only that were true or no own own own own own goal or you\n&gt; are a boy toy or do you or go her own little of you who you are or how\n&gt; they 401 or 20022 or older go go go go go or or or or or or know a\n&gt; go-go one-off or only forgo their pressure on you and your 20 yeah 200\n&gt; it while you only know 004 financial to own good are no longer for you\n&gt; only there to open all in all it will shut on their own new or old a\n&gt; girl who are all owners go to her show you how are you or are photo\n&gt; who are all more for all or go on or go to a shortage no longer auto\n&gt; auction are a little on that fall do you go to Italy they think they\n&gt; will motivate you or go or hold off or go you to look for go boy were\n&gt; you actually do all you go or no go over there or open in late 200 or own\n&gt; \n&gt; Let me know what all of you think.\n&gt; \n&gt; -Aaron\n&gt;"}