{"id": "9858", "subject": "Re: A CHUCKEL", "author": "itcdeadpeople", "timestamp": "2008-04-16T06:54:41Z", "full_text": "OMGosh, LC.  They&#39;re NOT real?!?  Are you sure???  ROFLMAO.  ;-)\n\nSadly, it&#39;s stuff like that gets serious researchers treated like we have the plague (or mental \nillness.)  And it makes establishing working relationships with the scientific community \nnearly impossible, because even those who have a genuine interest in helping fear that it \nwill be professional suicide to admit such an interest, let alone participating in any kind of \nformal &#39;paranormal&#39; research.  sigh............\n\nMargaret\n\n--- In EVP-ITC@yahoogroups.com, &quot;LC Duplatt&quot; &lt;lcdupla@...&gt; wrote:\n&gt;\n&gt; LOL! \n&gt; \n&gt; Most of these can be spotted as fakes super-easy.  The purple-colored \n&gt; shadow ghost drawn into the photo looks like it is floating on top of \n&gt; the photograph; and the light blue anomaly drawn between the fence \n&gt; slats is horribly done, also.\n&gt; \n&gt; You are right, a good chuckle they are.  :)\n&gt; \n&gt; LC\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, &quot;shadow71414&quot; &lt;shadow71414@&gt; wrote:\n&gt; &gt;\n&gt; &gt; In the photo section I have just uploaded a few photos for your \n&gt; &gt; review.  I would certainly like your honest opinion, for my own has \n&gt; &gt; been reached long ago.  They are photos of what are professed to be \n&gt; &gt; paranormal in nature, and given the initial viewing I could not \n&gt; &gt; fathom for a minute that these could in fact be taken as serious \n&gt; data \n&gt; &gt; and advertised as true spirit photography.\n&gt; &gt; \n&gt; &gt; In addition, I have also listed some articles and background \n&gt; &gt; information on this gentleman who proclaims to be highly \n&gt; experienced \n&gt; &gt; in the paranormal community, with a long list of degrees under his \n&gt; &gt; belt.\n&gt; &gt; \n&gt; &gt; The dilemma that I am now presented with is the fact that giving \n&gt; the \n&gt; &gt; paranormal community is based on a belief system that life after \n&gt; dead \n&gt; &gt; does in fact exist.  With this false material being presented, we \n&gt; &gt; (the paranormal community as a whole) will never be taken \n&gt; seriously.  \n&gt; &gt; What many paranormal investigators strive for almost seems \n&gt; &gt; unreachable, and yet those who continue to display false data are a \n&gt; &gt; direct reflection of all us in the community tarnishing our good \n&gt; &gt; name.  It&#39;s bad enough that we have do go up against skeptics \n&gt; &gt; everyday, but to have self proclaim paranormal experts producing \n&gt; &gt; faked evidence, certainly is a disgrace to us all, and should \n&gt; apology \n&gt; &gt; for his dishonesty and misleading those who ever gave him the \n&gt; benefit \n&gt; &gt; of the doubt.  \n&gt; &gt; \n&gt; &gt;     They were my photographs, taken with two different cameras. One \n&gt; &gt; was an Olympus Trip AF 50, a kind of instamatic type 35mm, and the \n&gt; &gt; other was a Yashica J-7. In all photos where the anomalies were \n&gt; &gt; captured, the film type was fuji, ASA 400 color film. The photos \n&gt; were \n&gt; &gt; scanned in at 400 dpi. The digital copies were enhanced to show up \n&gt; &gt; better o\n&gt; &gt; \n&gt; &gt; You can pretend you didn&#39;t see the analysis and the\n&gt; &gt; accompanying write up, but you would be lying. It was posted on the\n&gt; &gt; PP site by the Zoellers as well as passed around in an e-mail to\n&gt; &gt; everyone. You also know that the person asked to remain anonymous as\n&gt; &gt; he is still active in the service... He also has ten years of\n&gt; &gt; experience working for a photographic studio.\n&gt; &gt; \n&gt; &gt; The photos are an old argument. If you recall, (and let me refresh\n&gt; &gt; your memory as you seem to have selective memory since you came over\n&gt; &gt; to this group) when I gave the originals to John and said I would no\n&gt; &gt; longer respond to any more questions concerning the photos. As I\n&gt; &gt; stated then, let john have them analyzed. He could just as easily\n&gt; &gt; send them to whomever.\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; When I went to College there was no degree for Audio Engineering. \n&gt; You \n&gt; &gt; specialized in Acoustics and electrical Engineering.\n&gt; &gt;  \n&gt; &gt; \n&gt; &gt;     Articles that he supply and that mentions his name and explains \n&gt; &gt; what he dose for a living. \n&gt; &gt; \n&gt; &gt; http://www.bssaudio.com/news_view.php?id=50\n&gt; &gt;  \n&gt; &gt; http://systemscontractor.com/articles/publish/article_590.shtml\n&gt; &gt;  \n&gt; &gt; http://www.admark.cn/manage/31/200677144117.htm\n&gt; &gt;  \n&gt; &gt; http://www.aes.org/member/profile.cfm?ID=1435424442\n&gt; &gt;  .\n&gt; &gt;  \n&gt; &gt;  The articles listed below were uncovered by Melanie K. Hale and \n&gt; have \n&gt; &gt; come into question regarding the same.  Numbers don&#39;t lie, I guess \n&gt; &gt; people do.  Mr. Roundtree seems to think  that it is right to lead \n&gt; us \n&gt; &gt; to believe he is something he&#39;s not, and that all published \n&gt; material \n&gt; &gt; is his for the taking. \n&gt; &gt;  \n&gt; &gt;   So I did a little math and found the actual percentage of \n&gt; original \n&gt; &gt; material in each of David Roundtree&#39;s papers I linked.  I did this \n&gt; by \n&gt; &gt; opening in word, then selecting &quot;Tools&quot;&gt;&quot;Word Count&quot; and wrote down \n&gt; &gt; the total for Words.  Then I deleted all linked materials and did \n&gt; the \n&gt; &gt; same &quot;Tools&quot; &gt; &quot;Word Count&quot;.  Then I took the second number and \n&gt; &gt; divided it by the first number.  Here are the results linked to the \n&gt; &gt; original document on David&#39;s site:\n&gt; &gt;  \n&gt; &gt; Analog_or_digital. doc  =  38% original material  62% taken from \n&gt; &gt; other sources\n&gt; &gt;  \n&gt; &gt; Biofeedback_ Experiment. doc = 10% original material  90% taken \n&gt; from \n&gt; &gt; other sources\n&gt; &gt;  \n&gt; &gt; EVP_Project_ Phase_1.doc = 31% original material  69% taken from \n&gt; &gt; other sources\n&gt; &gt;  \n&gt; &gt; EVP_Project_ Phase_2.doc = 43% original material  57% taken from \n&gt; &gt; other sources\n&gt; &gt;  \n&gt; &gt; Orbs-The_Search_ for_the_Truth. doc = 32% original material  68% \n&gt; &gt; taken from other sources\n&gt; &gt;  \n&gt; &gt; The_Magic_that_ is_Light. doc = 0% original material  100%\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; Photo in the file section under Dave Rountree\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; David M. Rountree - AES IFSA\n&gt; &gt; &gt; &gt; &gt; &gt; Director\n&gt; &gt; &gt; &gt; &gt; &gt; Skylands Paranormal Investigations\n&gt; &gt; David Rountree&quot; &lt;ghost_hunter_01@ David M.. Rountree - AES  \n&gt; &gt; IFSA\n&gt; &gt; Director\n&gt; &gt; Skylands Paranormal Investigations\n&gt; &gt;\n&gt;"}