{"id": "9873", "subject": "Re: [EVP-ITC] Re: Voice to Print Software Results", "author": "Ron Lederer", "timestamp": "2008-04-16T16:58:09Z", "full_text": "--0-1996912418-1208365089=:88497\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nGood stuff aaron.  Stefan is the expert out of the two of us here but if he gives me specific instructions I will be glad to give it a go.  Ron L\n\nkolrone &lt;a.cronk@...&gt; wrote:          Margaret: Unfortunately I didn&#39;t record, which in retrospect, wasn&#39;t \na very smart idea. I just wanted to run it, to see if it would even \nwork. An issue that I noticed while doing this is that there is a lag \ntime. When the program does recognize the allophones, it will show \nwhat it thinks was said and will wait for a &quot;sentence&quot; to finish. The \nproblem with that is when doing that, Naturally speaking would erase \nsome of what it thought was said if the allophones kept going. When I \nwas listening, I think I recognized some things that the program \ndidn&#39;t type down. I&#39;ll try to run a few more experiments later \ntonight when I get home from work.\n\nLK: The session was probably maybe 10 minutes or so. The program \ndidn&#39;t type down everything, so I will try to tweak it some more, \nmaybe by slowing down EVPMaker. I believe it became clear longer, \nbecause I slowed it down to 80% or so during the session. I will \ndefinately trying to adjust it some more and share the results again.\n\nStefan/Ron L.: That definately does sound like a good idea. I will \nsee if I can try that. Maybe when I get home, I will see if I can \ncopy and paste the text that is supposed to be read to the group. If \nI can, anybody that can help in synthesizing the allophones to read \nthe text, that would be a great help. To do that you have to have \nAdobe Audition correct? Or is there anything else you can use/build?\n\n-Aaron\n\n\n\n                           \n\n       \n---------------------------------\nBe a better friend, newshound, and know-it-all with Yahoo! Mobile.  Try it now.\r\n--0-1996912418-1208365089=:88497\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nGood stuff aaron.&nbsp; Stefan is the expert out of the two of us here but if he gives me specific instructions I will be glad to give it a go.&nbsp; Ron L&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;kolrone &lt;a.cronk@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;div&gt;Margaret: Unfortunately I didn&#39;t record, which in retrospect, wasn&#39;t &lt;BR&gt;a very smart idea. I just wanted to run it, to see if it would even &lt;BR&gt;work. An issue that I noticed while doing this is that there is a lag &lt;BR&gt;time. When the program does recognize the allophones, it will show &lt;BR&gt;what it thinks was said and will wait for a &quot;sentence&quot; to\n finish. The &lt;BR&gt;problem with that is when doing that, Naturally speaking would erase &lt;BR&gt;some of what it thought was said if the allophones kept going. When I &lt;BR&gt;was listening, I think I recognized some things that the program &lt;BR&gt;didn&#39;t type down. I&#39;ll try to run a few more experiments later &lt;BR&gt;tonight when I get home from work.&lt;BR&gt;&lt;BR&gt;LK: The session was probably maybe 10 minutes or so. The program &lt;BR&gt;didn&#39;t type down everything, so I will try to tweak it some more, &lt;BR&gt;maybe by slowing down EVPMaker. I believe it became clear longer, &lt;BR&gt;because I slowed it down to 80% or so during the session. I will &lt;BR&gt;definately trying to adjust it some more and share the results again.&lt;BR&gt;&lt;BR&gt;Stefan/Ron L.: That definately does sound like a good idea. I will &lt;BR&gt;see if I can try that. Maybe when I get home, I will see if I can &lt;BR&gt;copy and paste the text that is supposed to be read to the group. If &lt;BR&gt;I can, anybody that can help in synthesizing the allophones to read &lt;BR&gt;the\n text, that would be a great help. To do that you have to have &lt;BR&gt;Adobe Audition correct? Or is there anything else you can use/build?&lt;BR&gt;&lt;BR&gt;-Aaron&lt;BR&gt;&lt;BR&gt;&lt;/div&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;p&gt;&#32;\n\n\n\n      &lt;hr size=1&gt;Be a better friend, newshound, and \nknow-it-all with Yahoo! Mobile. &lt;a href=&quot;http://us.rd.yahoo.com/evt=51733/*http://mobile.yahoo.com/;_ylt=Ahu06i62sR8HDtDypao8Wcj9tAcJ &quot;&gt; Try it now.&lt;/a&gt;\r\n--0-1996912418-1208365089=:88497--"}