{"id": "9876", "subject": "Re: Voice to Print Software Results", "author": "kolrone", "timestamp": "2008-04-16T21:21:02Z", "full_text": "I think it&#39;s actually an interesting idea. If we can synthesize the \nallophone tones to read the text, we might get some results. It may \nbe possible.\n\n-Aaron\n\n--- In EVP-ITC@yahoogroups.com, Michael Edwards &lt;f1cracker75@...&gt; \nwrote:\n&gt;\n&gt; I did not realize that it had to recognize a voice. I just thought \nthat it would print what was recorded. Oh well...\n&gt; \n&gt; kolrone &lt;a.cronk@...&gt; wrote:          Margaret: Unfortunately I \ndidn&#39;t record, which in retrospect, wasn&#39;t \n&gt; a very smart idea. I just wanted to run it, to see if it would even \n&gt; work. An issue that I noticed while doing this is that there is a \nlag \n&gt; time. When the program does recognize the allophones, it will show \n&gt; what it thinks was said and will wait for a &quot;sentence&quot; to finish. \nThe \n&gt; problem with that is when doing that, Naturally speaking would \nerase \n&gt; some of what it thought was said if the allophones kept going. When \nI \n&gt; was listening, I think I recognized some things that the program \n&gt; didn&#39;t type down. I&#39;ll try to run a few more experiments later \n&gt; tonight when I get home from work.\n&gt; \n&gt; LK: The session was probably maybe 10 minutes or so. The program \n&gt; didn&#39;t type down everything, so I will try to tweak it some more, \n&gt; maybe by slowing down EVPMaker. I believe it became clear longer, \n&gt; because I slowed it down to 80% or so during the session. I will \n&gt; definately trying to adjust it some more and share the results \nagain.\n&gt; \n&gt; Stefan/Ron L.: That definately does sound like a good idea. I will \n&gt; see if I can try that. Maybe when I get home, I will see if I can \n&gt; copy and paste the text that is supposed to be read to the group. \nIf \n&gt; I can, anybody that can help in synthesizing the allophones to read \n&gt; the text, that would be a great help. To do that you have to have \n&gt; Adobe Audition correct? Or is there anything else you can use/build?\n&gt; \n&gt; -Aaron\n&gt; \n&gt; \n&gt; \n&gt;                            \n&gt; \n&gt; \n&gt; Michael Edwards:  f1cracker75@...\n&gt;        \n&gt; ---------------------------------\n&gt; Be a better friend, newshound, and know-it-all with Yahoo! Mobile.  \nTry it now.\n&gt;"}