{"id": "9877", "subject": "Phonetic analysis of SpeakJet EVP", "author": "Stefan Bion", "timestamp": "2008-04-16T22:13:03Z", "full_text": "Hi all,\n\na phonetic analysis of the &quot;SpeakJet allophone EVP&quot; might be interesting as well in order to find out which allophones are combined to form an EVP, and to verify if we heard correctly. As you perhaps already know from the manual, EVPmaker can record &quot;EVP sessions&quot;, and log the labels of the used cues along with each EVP:\n\nhttp://www.stefanbion.de/evpmaker/evpmkr_e.htm#abschn38\n\nIn my initial experiments using the SJ allophones with EVPmaker of March 26, I used the &quot;EVP session&quot; functionality rather than a microphone to record the session, so my own voice wasn&#39;t recorded. Instead, the labels of the allophones, which are included in the cue list of the SJ-Allophones.wav file, were logged in the session. See screenshots for EVPmaker settings to work with &quot;EVP sessions&quot;:\n\nhttp://tech.groups.yahoo.com/group/EVP-ITC/files/Stefan/Phonetic%20analysis%20of%20SpeakJet%20/ScreenshotsEVPmakerSession.png\n\nI have examined three of the EVPs from my March 26 session and noted the allophones they are composed of:\n\n\nExample 1\n---------\n\nEVP: &quot;I little sir help you with it&quot; (or &quot;eclipse&quot;)\n\nAllophones: OHIH NGE BE PE UH SO AXRR AYWW PE IHWW BE ZH IH KO TS\n\nTranscription: OHIH = I, NGE BE PE UH = little, SO AXRR = sir, AYWW PE = help, IHWW = you, BE ZH IH KO TS = eclipse / with it\n\nLink: http://tech.groups.yahoo.com/group/EVP-ITC/files/Stefan/Phonetic%20analysis%20of%20SpeakJet%20/20080326_021629-010%20-%20I%20little%20sir%20help%20you%20with%20it.wav\n\n\nExample 2\n---------\n\nEVP: &quot;That&#39;s the help of air&quot; (or &quot;err&quot;)\n\nAllophones: TH DO WH SE BO KO AYWW HE ZZ OW VV NGO EYRR\n\nTranscription: TH DO WH SE = that&#39;s, BO = the, KO AYWW HE = help, OW VV = of, EYRR = air\n\nLink: http://tech.groups.yahoo.com/group/EVP-ITC/files/Stefan/Phonetic%20analysis%20of%20SpeakJet%20/20080326_222218-002%20-%20that%27s%20the%20help%20of%20air%20%28err%29.wav\n\n\nExample 3\n---------\n\nEVP: &quot;Eight air apples for them&quot;\n\nAllophones: EYIY TU TH EYRR EH HE LE SE NGO WW AX MM\n\nTranscription: EYIY TU TH = eight, EYRR = air, EH HE LE SE = apples, NGO WW = for, AX MM = them\n\nLink: http://tech.groups.yahoo.com/group/EVP-ITC/files/Stefan/Phonetic%20analysis%20of%20SpeakJet%20/20080326_222218-004%20-%20eight%20air%20apples%20for%20them.wav\n\n\nThe samples can be examined by selecting and playing the individual allophones in Audition - see screenshot:\nhttp://tech.groups.yahoo.com/group/EVP-ITC/files/Stefan/Phonetic%20analysis%20of%20SpeakJet%20/ScreenshotAuditionCuelist.png\n\nIn the cue list (select &quot;View &gt; Show Cue List&quot; to open it), you can see the sequence of allophones these clips are composed of. By double-clicking an entry in the cue list, the according section within the waveform will be selected, and by clicking the play button, the allophone will be played. You can also select and play more than one allophone by dragging the selection while pressing the left mouse button, and then click play.\n\nYou will notice that most EVP are composed of allophones that apparently don&#39;t match, or which obviously aren&#39;t intended by the chip designers to be used for this particular speech element. Other allophones are misplaced or superfluous, but will be simply ignored by our hearing. Nevertheless, EVPs that are composed of apparently &quot;wrong&quot; allophones sound amazingly clear to us, while &quot;correctly&quot; synthesized speech, as for instance my sample file &quot;Hello, good morning&quot; (see \nhttp://tech.groups.yahoo.com/group/EVP-ITC/files/Stefan/Speech%20Recognition%20Training/SJ-HelloGoodMorning.mp3) doesn&#39;t sound very well.\n\nThis shows that our hearing is very flexible, and that spirit entities have more possibilities than the mathematically expected number to combine allophones to their intended messages.\n\nStefan"}