{"id": "9885", "subject": "Re: [EVP-ITC] Re: Voice to Print Software Results", "author": "Stefan Bion", "timestamp": "2008-04-16T23:00:33Z", "full_text": "Hi all,\n\nOK, I&#39;ll try to write down the steps necessary to synthesize text by\ncombining allophones. In this example I will show how to synthesize the\nword &quot;hello&quot;.\n\n1. Open SJ-Allophone.wav in Audition.\n\n2. Show the Cue List, if not already opened, by selecting &quot;View &gt; Show\nCue List&quot; from the menu.\n\n3. Look up the first allophone of &quot;hello&quot;, an &quot;h&quot; with transition to\n&quot;e&quot;. Choose the allophone &quot;HE&quot; as the first one. Double-click it in the\nCue List - it will get selected in the waveform window. To listen to it,\nclick the Play button. To copy the selected allophone to a new file,\npress &lt;Ctrl&gt;&lt;C&gt;, and then &lt;Ctrl&gt;&lt;Shift&gt;&lt;N&gt;. The allophone will open in a\nnew window. Press &lt;End&gt; to set the cursor at the end of the waveform.\nPress &lt;Ctrl&gt;&lt;Tab&gt; to return to the SJ-Allophones window.\n\n4. Look up the next allophone for the word &quot;hello&quot;, which is the &quot;e&quot;\nsound. The (probably) correct allophone is labeled &quot;EH&quot;, so double-click\nit, listen to it by clicking Play, and if it&#39;s the correct one, press\n&lt;Ctrl&gt;&lt;C&gt; to copy it to the clipboard, then press &lt;Ctrl&gt;&lt;Tab&gt; to switch\nto the new created file, press &lt;Ctrl&gt;&lt;V&gt; to insert the allophone from\nthe clipboard at the and of the new file (cursor position). Press &lt;End&gt;\nto set the cursor at the end of the waveform, then again &lt;Ctrl&gt;&lt;Tab&gt; to\nreturn to the SJ-Allophones window.\n\n5. Repeat Step 4 for the remaining two allophones of &quot;hello&quot;, which are\nlabeled &quot;LO&quot; and &quot;OWWW&quot;.\n\nSo the word &quot;hello&quot; is composed of the allophones: HE + EH + LO + OWWW\n\n6. Save the new file. In my example, I saved it as\n&quot;SJ-Allophones - hello.wav&quot; and can be downloaded/listened to here:\nhttp://tech.groups.yahoo.com/group/EVP-ITC/files/Stefan/Speech%20Recognition%20Training/SJ-Allophones%20-%20hello.wav\n\nStefan\n\n-- \n\n&gt; Good stuff aaron.  Stefan is the expert out of the two of us here but if he gives me specific instructions I will be glad to give it a go.  Ron L\n\n&gt; kolrone &lt;a.cronk@...&gt; wrote:          Margaret: Unfortunately I didn&#39;t record, which in retrospect, wasn&#39;t \n&gt; a very smart idea. I just wanted to run it, to see if it would even \n&gt; work. An issue that I noticed while doing this is that there is a lag \n&gt; time. When the program does recognize the allophones, it will show \n&gt; what it thinks was said and will wait for a &quot;sentence&quot; to finish. The \n&gt; problem with that is when doing that, Naturally speaking would erase \n&gt; some of what it thought was said if the allophones kept going. When I \n&gt; was listening, I think I recognized some things that the program \n&gt; didn&#39;t type down. I&#39;ll try to run a few more experiments later \n&gt; tonight when I get home from work.\n\n&gt; LK: The session was probably maybe 10 minutes or so. The program \n&gt; didn&#39;t type down everything, so I will try to tweak it some more, \n&gt; maybe by slowing down EVPMaker. I believe it became clear longer, \n&gt; because I slowed it down to 80% or so during the session. I will \n&gt; definately trying to adjust it some more and share the results again.\n\n&gt; Stefan/Ron L.: That definately does sound like a good idea. I will \n&gt; see if I can try that. Maybe when I get home, I will see if I can \n&gt; copy and paste the text that is supposed to be read to the group. If \n&gt; I can, anybody that can help in synthesizing the allophones to read \n&gt; the text, that would be a great help. To do that you have to have \n&gt; Adobe Audition correct? Or is there anything else you can use/build?\n\n&gt; -Aaron\n\n\n\n                           \n\n       \n&gt; ---------------------------------\n&gt; Be a better friend, newshound, and know-it-all with Yahoo! Mobile.  Try it now."}