{"id": "9900", "subject": "Voice to Text Training Text", "author": "kolrone", "timestamp": "2008-04-17T01:47:33Z", "full_text": "Hey everyone. I went ahead and typed up all the text from the Voice to\nText training session. Unfortunately I could only copy and paste the\nfirst two paragraphs, everything else was done the old fashioned way.\nI won&#39;t be able to do much with this since this is the last two weeks\nof the semester and us college students have finals and papers due\n(sigh). So I figured if anyone wants to take a whack at this, more\npower to you.\n\n\n----------------------------------------------------------------------\n\n\nIn this step the computer listens to the sound of your voice and\nadjusts the volume setting of your microphone. When the computer has\nfinished adjusting the volume, it beeps to signal that the process is\ncomplete. If you reach the end of this text but you have not heard a\nbeep, start reading the text again from the beginning. You should only\nhave to read for about ten to fifteen seconds.\n\nIn this step the computer checks the audio input from your sound\nsystem. Having high-quality audio input is very important for good\nspeech recognition. Poor audio input will make it difficult or\nimpossible for the program to recognize your speech accurately. When\nthe computer has finished checking the audio quality, it beeps to\nsignal that the test is complete. If you reach the end of this text\nbut you have not heard a beep, start reading the text again from the\nbeginning. You should only have to read for about fifteen seconds.\n\nWelcome to general training\n\nTraining is about to begin\n\nWe would like you to read aloud for a few minutes while the computer\nlistens to you and learns how you speak. When you have finished\nreading, we&#39;ll make some adjustments, and then you will be able to\ntalk to your computer and see the words appear on your screen. In the\nmeantime, we would like to explain why talking to a computer is not\nthe same as talking to a person and then give you a few tips about how\nto speak when dictating.\n\nUnderstanding spoken language is something that people often take for\ngranted. Most of us develop the ability to recognize speech when we&#39;re\nvery young. We&#39;re already experts at speech recognition by the age of\nthree or so.\n\nWhen people first start using speech-recognition software, they might\nbe surprised that the computer makes mistakes. Maybe unconsciously we\ncompare the computer to another person. But the computer is not like a\nperson. What the computer does when it listens to speech is different\nfrom what a person does.\n\nThe first challenge in speech recognition is to identify what is\nspeech and what is just noise. People can filter out noise fairly\neasily, which lets us talk to each other almost anywhere. We have\nconversations in busy train stations, across the dance floor, and in\ncrowded restaurants. It would be very if we had to sit in a quiet room\nevery time we wanted to talk to each other!\n\nUnlike people, computers need help separating speech sounds from other\nsounds. When you speak to a computer, you should be in a place without\ntoo much noise. Then, you must speak clearly into a microphone that\nhas been placed in the right position. If you do this, the computer\nwill hear you just fine, and not get confused by other noises around you.\n\nA second challenge is to recognize speech from more than one speaker.\nPeople do this very naturally. We have no problem chatting one moment\nwith Aunt Grace, who has a high, thin voice, and the next moment with\nCousin Paul, who has a voice like a foghorn. People easily adjust to\nthe unique characteristics of every voice.\n\nSpeech-recognition software, on the other hand, works best when the\ncomputer has a chance to adjust to each new speaker. The process of\nteaching the computer to recognize your voice is called &quot;training,&quot;\nand it&#39;s what you are doing right now.\n\nThe training process takes only a few minutes for most people. If,\nafter you begin using the program, you find that the computer is\nmaking more mistakes that you expect, use the tools provided in the\nAccuracy Center to improve the recognition accuracy.\n\nAnother challenge is how to distinguish between two or more phrases\nthat sound alike. People use common sense and context--knowledge of\nthe topic being talked about--to decide whether a speaker said &quot;ice\ncream&quot; or &quot;I scream.&quot;\n\nSpeech-recognition programs don&#39;t understand what words mean, so they\ncan&#39;t use common sense the way people do. Instead, they keep track of\nhow frequently words occur by themselves and in the context of other\nwords. This information helps the computer choose the most likely\nwords or phrase from among several possibilities.\n\nFinally, people sometimes mumble, slur their words, or leave words out\naltogether. They assume, usually correctly, that their listeners will\nbe able to fill in the gaps. Unfortunately, computers won&#39;t understand\nmumbled speech or missing words. They only understand what was\nactually spoken and don&#39;t know enough to fill in the gaps by guessing\nwhat was meant.\n\nTo understand what it means to speak both clearly and naturally,\nlisten to the way newscasters read the news. If you copy this style\nwhen you dictate, the program should successfully recognize what you say,\n\nOne of the most effective ways to make speech recognition work better\nis to practice speaking clearly and evenly when you dictate. Try\nthinking about what you want to say before you start to speak. This\nwill help speak in longer, more natural phrases.\n\nSpeak at your normal pace without slowing down. When another person is\nhaving trouble understanding you, speaking more slowly usually helps.\nIt doesn&#39;t help, however to speak at an unnatural pace when you are\ntalking to a computer. This is because when matching sounds to words.\nIf you speak in syllables, each syllable is likely to be transcribed\nas a separate word.\n\nWith a little practice, you will develop the habitat of dictating in a\nclear, steady voice, and the computer will understand you better.\n\nWhen you read this training text, the program adapts to the pitch and\nvolume of your voice. For this reason, when you dictate, you should\ncontinue to speak at the pitch and volume you are speaking with right\nnow. If you shout or whisper when you dictate, the program won&#39;t\nunderstand you as well.\n\nAnd last but not least, avoid saying extra words you really don&#39;t want\nin your document, like &quot;you know.&quot; The computer has no way of knowing\nwhich words you say are important, so it simply transcribes everything\nyou say.\n\nWe hope you have enjoyed reading about the different ways that people\nand computers recognize spoken language as well as some tips for\neffective dictating.\n\n\n---------------------------------------------------------------------\n\n\n-Aaron"}