{"id": "9910", "subject": "Re: Editing EVP", "author": "itcdeadpeople", "timestamp": "2008-04-17T09:54:03Z", "full_text": "Hi Stefan.  I also think keeping a raw version on file is really important.  I&#39;m somewhere in \nthe middle about editing.  I&#39;m OK with it (obviously, I do it myself) but feel that the fact \nediting has taken place should be disclosed when sharing examples.  Too often people \npresent edited clips with no mention whatsoever that changes have been made, which can \nlead to false impressions being given to listeners.  \n\nI think of removing &#39;garbage&#39; in sweep and related techniques as being similar to removing \nall the silence in traditional EVP work.  Nobody wants to listen to 45 seconds (or however \nlong) of hiss if that&#39;s how long it took for the response to come.  And to the untrained ear. \nraw sweep examples can be very difficult for the average person to understand without \nediting that reflects the way we are hearing it.\n\nGranted, with sweep, we are actually removing material we have deemed as irrelevant, not \njust silence. Hopefully everyone has the good sense to not rearrange content, or take a \nresponse that came after several questions and apply it to the first.  In general, I feel an \nappropriate response must be received prior to the next question or comment being \nmade. \n\nI save all my raw files in WAV format, and my edited versions in MP3.  As well, any raw \nversions that I post will be MP3 in order to use as little server space as possible.  :-)\n\nAgain, I am with you, Stefan, in that we should always be able to present our results to a \ncritical public.  For me, that means keeping raw files for comparison, and disclosing when \nI have edited an example in order to hopefully avoid any confusion.  And since I&#39;ve been up \nfront about it, I can&#39;t be accused of deceptive practices.\n\nGlad you shared your views!\n\nMargaret\n\n--- In EVP-ITC@yahoogroups.com, Stefan Bion &lt;yahoogroups@...&gt; wrote:\n&gt;\n&gt; Hi all,\n&gt; \n&gt; just a general comment on editing EVP: For scientific reasons, I would\n&gt; suggest not to edit an EVP message partially, but only as a whole, in\n&gt; order to rule out any possible suspicion of manipulation. You can for\n&gt; instance increase the volume or dynamics of an entire clip (including\n&gt; the experimenter&#39;s voice), filter or denoise it to make it clearer, but\n&gt; not cut out individual pieces (supposed &quot;garbage&quot;) to make an EVP match\n&gt; with what it &quot;should be&quot;. At least, the unedited version should always\n&gt; be provided along with the edited version.\n&gt; \n&gt; But that&#39;s only my personal opinion which I thought I had to express, as\n&gt; we should always be able to present our results to a critical public.\n&gt; \n&gt; Stefan\n&gt; \n&gt; -- \n&gt; \n&gt; &gt; Believe or not Ron, very little editing is involved for these files.\n&gt; &gt; After my question, i isolate the response section and slow that \n&gt; &gt; section down about 20%.  Now i can actually start to hear the message \n&gt; &gt; a lot clearer, i also now see a couple sections of just noise that \n&gt; &gt; don&#39;t belong and eliminate them from the mix.  You can&#39;t piece these \n&gt; &gt; files together to make something it&#39;s not, so i keep them in true \n&gt; &gt; form pretty much to the original.\n&gt; \n&gt; &gt; -Steve\n&gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, Ron Lederer &lt;ronriko@&gt; wrote:\n&gt; &gt;&gt;\n&gt; &gt;&gt; Hey Steve   Forgot to ask...how much editing was needed to get this \n&gt; &gt; file?  Did you need to take out a lot of garbage between words \n&gt; &gt; withing the message?   Ron L\n&gt;"}