{"id": "9931", "subject": "Re: Editing EVP", "author": "psfponies", "timestamp": "2008-04-17T16:54:02Z", "full_text": "Yes I get your point Rees.  On long messages cutting out the crap \nbetween words in the message.\n\nKay\n\n--- In EVP-ITC@yahoogroups.com, Ron Lederer &lt;ronriko@...&gt; wrote:\n&gt;\n&gt; Sorry, don&#39;t get the point rees.  Ron L\n&gt; \n&gt; Wiliam Clarke &lt;reesclarke_69@...&gt; wrote:            My thoughts on \ncut out the garbage leads people to believe that the messages that \nsome people are getting messages are all in one sentence.\n&gt;    \n&gt;   Example Question: How are you today?  \n&gt;    \n&gt;   1st Answer:(Cut Up) I&#39;m good, me and my spirts friends here \nwants to give you a long message for the reseachers to here&gt;  \n&gt;    \n&gt;   2nd Answer:(Not Cut) I&#39;m blah blah blah blah blah blah blah blah \nblah blah blah good blah blah.\n&gt; \n&gt;   Does anybody see my point on cut up messages?\n&gt;    \n&gt;   Rees\n&gt;   \n&gt; bruce halliday &lt;paranormalinvestigating@...&gt; wrote:\n&gt;       Stefan,\n&gt;  \n&gt; I do remove the &quot;garbage&quot; from my files.\n&gt;  \n&gt; At this point in my research, the message is more important to me \nthan the proof of it.\n&gt; I think most of us here will agree that we are receiving some sort \nof paranormal communication.\n&gt; but it definitely exists. now we need to concentrate on the \nmessages they need us to hear and the answers to the questions\n&gt; we ask and in turn our answers to their questions. Anyone that \ncleans a file in this way should not be touching any bit of the file\n&gt; that has a semblance of speech, only the bits that are odiously \ngarbage like the &quot;EH O EH AH O EH UR&quot; in between words.\n&gt;  \n&gt; For example &quot;Is there anyone here that wishes to \ncommunicate_YES_AH ER EEH AR OOO AR_WE ARE_EH IH AHH EHH_HERE&quot;\n&gt; It is much easier for me as a researcher to be able to return to a \nfile that I recieved two weeks ago and that I believe may hold some\n&gt; relivence to a message I just received and be able to cleanly \nlisten to it, without the distraction of the garbage sounds.\n&gt;  \n&gt; At this stage in real time communication the messages are the top \npriority.\n&gt; I do however agree that the untouched version should be retained \nand made available to individuals that make a request \n&gt; for any intelligent sceptical or authenticity challenge that may \nbe made, and god knows there are always fanatical \n&gt; sceptics lurking in the shadows awaiting an opportunity to attack \nan unwary or injured researcher. I do not think that \n&gt; our research files should be made available on request by every \ntom dick and harry that is unknown to us and may potentially\n&gt; doctor the file to suit their own point and post it as such.\n&gt;  \n&gt; I have had this happen to me in the past so I believe the \nresearcher that receives the request for raw research data should \n&gt; scrutinize the requesting source and use their best judgment \nbefore handing out any research data.\n&gt;  \n&gt; These are my thoughts on the subject of cleaning a file.\n&gt;  \n&gt; Bruce\n&gt; \n&gt; \n&gt;   Bruce Halliday \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;     \n&gt; ---------------------------------\n&gt;   To: EVP-ITC@yahoogroups.com\n&gt; From: yahoogroups@...\n&gt; Date: Thu, 17 Apr 2008 09:55:42 +0200\n&gt; Subject: [EVP-ITC] Editing EVP\n&gt; \n&gt;       Hi all,\n&gt; \n&gt; just a general comment on editing EVP: For scientific reasons, I \nwould\n&gt; suggest not to edit an EVP message partially, but only as a whole, \nin\n&gt; order to rule out any possible suspicion of manipulation. You can \nfor\n&gt; instance increase the volume or dynamics of an entire clip \n(including\n&gt; the experimenter&#39;s voice), filter or denoise it to make it \nclearer, but\n&gt; not cut out individual pieces (supposed &quot;garbage&quot;) to make an EVP \nmatch\n&gt; with what it &quot;should be&quot;. At least, the unedited version should \nalways\n&gt; be provided along with the edited version.\n&gt; \n&gt; But that&#39;s only my personal opinion which I thought I had to \nexpress, as\n&gt; we should always be able to present our results to a critical \npublic.\n&gt; \n&gt; Stefan\n&gt; \n&gt; -- \n&gt; \n&gt; &gt; Believe or not Ron, very little editing is involved for these \nfiles.\n&gt; &gt; After my question, i isolate the response section and slow that \n&gt; &gt; section down about 20%. Now i can actually start to hear the \nmessage \n&gt; &gt; a lot clearer, i also now see a couple sections of just noise \nthat \n&gt; &gt; don&#39;t belong and eliminate them from the mix. You can&#39;t piece \nthese \n&gt; &gt; files together to make something it&#39;s not, so i keep them in \ntrue \n&gt; &gt; form pretty much to the original.\n&gt; \n&gt; &gt; -Steve\n&gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, Ron Lederer &lt;ronriko@&gt; wrote:\n&gt; &gt;&gt;\n&gt; &gt;&gt; Hey Steve Forgot to ask...how much editing was needed to get \nthis \n&gt; &gt; file? Did you need to take out a lot of garbage between words \n&gt; &gt; withing the message? Ron L\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt;   \n&gt; ---------------------------------\n&gt;   More immediate than e-mail? Get instant access with Windows Live \nMessenger.   \n&gt; \n&gt; \n&gt; \n&gt;     \n&gt; ---------------------------------\n&gt;   Be a better friend, newshound, and know-it-all with Yahoo! \nMobile. Try it now.  \n&gt; \n&gt;                            \n&gt; \n&gt;        \n&gt; ---------------------------------\n&gt; Be a better friend, newshound, and know-it-all with Yahoo! \nMobile.  Try it now.\n&gt;"}