{"id": "9934", "subject": "Re: Editing EVP", "author": "itcdeadpeople", "timestamp": "2008-04-17T17:01:59Z", "full_text": "Hi Ron.  There&#39;s plenty of room for long clips if people would change their software \nsettings, as well as post in MP3 format rather than WAV. \n\nHi LK.  I would add, &#39;disclose when you have edited&#39;, so others aren&#39;t mislead by your \nresults.\n\nMargaret\n\n--- In EVP-ITC@yahoogroups.com, &quot;Laura Kimberley&quot; &lt;gjk1rrfan@...&gt; wrote:\n&gt;\n&gt; Hi All,\n&gt; \n&gt; Here&#39;s my take.or 2 cents worth..:-)\n&gt; \n&gt;  \n&gt; \n&gt; Share your files all clipped without the garbage for others to listen to.\n&gt; Save your original files for further development and records, in the case a\n&gt; scientific organization wants to &quot;hear&quot; the original along with the clipped,\n&gt; walahh you have both. And everyone is Happy!\n&gt; \n&gt; LK\n&gt; \n&gt;  \n&gt; \n&gt; From: EVP-ITC@yahoogroups.com [mailto:EVP-ITC@...m] On Behalf Of\n&gt; Ron Lederer\n&gt; Sent: Thursday, April 17, 2008 11:36 AM\n&gt; To: EVP-ITC@yahoogroups.com\n&gt; Subject: RE: [EVP-ITC] Editing EVP\n&gt; \n&gt;  \n&gt; \n&gt; Bruce    To add to what you said, the capacity of the yahoo forum we are\n&gt; with does not permit long recordings and the messages we have been receiving\n&gt; seem to be getting longer and longer each passing month.  Not much room for\n&gt; the &quot;gargage.&quot;  I for one prefer to hear the important message words,\n&gt; knowing full well the author edited the file.  If someone wants to present\n&gt; false stuff so that he or she gets false praise from us,  god bless them if\n&gt; they need the praise.  For scientific research with original files...that&#39;s\n&gt; another story.  Ron L\n&gt; \n&gt; bruce halliday &lt;paranormalinvestigating@...&gt; wrote: \n&gt; \n&gt; Stefan,\n&gt;  \n&gt; I do remove the &quot;garbage&quot; from my files.\n&gt;  \n&gt; At this point in my research, the message is more important to me than the\n&gt; proof of it.\n&gt; I think most of us here will agree that we are receiving some sort of\n&gt; paranormal communication.\n&gt; but it definitely exists. now we need to concentrate on the messages they\n&gt; need us to hear and the answers to the questions\n&gt; we ask and in turn our answers to their questions. Anyone that cleans a file\n&gt; in this way should not be touching any bit of the file\n&gt; that has a semblance of speech, only the bits that are odiously garbage like\n&gt; the &quot;EH O EH AH O EH UR&quot; in between words.\n&gt;  \n&gt; For example &quot;Is there anyone here that wishes to communicate_YES_AH ER EEH\n&gt; AR OOO AR_WE ARE_EH IH AHH EHH_HERE&quot;\n&gt; It is much easier for me as a researcher to be able to return to a file that\n&gt; I recieved two weeks ago and that I believe may hold some\n&gt; relivence to a message I just received and be able to cleanly listen to it,\n&gt; without the distraction of the garbage sounds.\n&gt;  \n&gt; At this stage in real time communication the messages are the top priority.\n&gt; I do however agree that the untouched version should be retained and made\n&gt; available to individuals that make a request \n&gt; for any intelligent sceptical or authenticity challenge that may be made,\n&gt; and god knows there are always fanatical \n&gt; sceptics lurking in the shadows awaiting an opportunity to attack an unwary\n&gt; or injured researcher. I do not think that \n&gt; our research files should be made available on request by every tom dick and\n&gt; harry that is unknown to us and may potentially\n&gt; doctor the file to suit their own point and post it as such.\n&gt;  \n&gt; I have had this happen to me in the past so I believe the researcher that\n&gt; receives the request for raw research data should \n&gt; scrutinize the requesting source and use their best judgment before handing\n&gt; out any research data.\n&gt;  \n&gt; These are my thoughts on the subject of cleaning a file.\n&gt;  \n&gt; Bruce\n&gt; \n&gt; \n&gt; \n&gt; Bruce Halliday \n&gt; \n&gt;  \n&gt; &lt;http://free-paranormalinvestigating.com/%3C/div%3E%3C/div%3E%3Cp%20/%3E%3Cd\n&gt; iv%20class=&gt; \n&gt; \n&gt;  \n&gt; \n&gt;   _____  \n&gt; \n&gt; To: EVP-ITC@yahoogroups.com\n&gt; From: yahoogroups@...\n&gt; Date: Thu, 17 Apr 2008 09:55:42 +0200\n&gt; Subject: [EVP-ITC] Editing EVP\n&gt; \n&gt; Hi all,\n&gt; \n&gt; just a general comment on editing EVP: For scientific reasons, I would\n&gt; suggest not to edit an EVP message partially, but only as a whole, in\n&gt; order to rule out any possible suspicion of manipulation. You can for\n&gt; instance increase the volume or dynamics of an entire clip (including\n&gt; the experimenter&#39;s voice), filter or denoise it to make it clearer, but\n&gt; not cut out individual pieces (supposed &quot;garbage&quot;) to make an EVP match\n&gt; with what it &quot;should be&quot;. At least, the unedited version should always\n&gt; be provided along with the edited version.\n&gt; \n&gt; But that&#39;s only my personal opinion which I thought I had to express, as\n&gt; we should always be able to present our results to a critical public.\n&gt; \n&gt; Stefan\n&gt; \n&gt; -- \n&gt; \n&gt; &gt; Believe or not Ron, very little editing is involved for these files.\n&gt; &gt; After my question, i isolate the response section and slow that \n&gt; &gt; section down about 20%. Now i can actually start to hear the message \n&gt; &gt; a lot clearer, i also now see a couple sections of just noise that \n&gt; &gt; don&#39;t belong and eliminate them from the mix. You can&#39;t piece these \n&gt; &gt; files together to make something it&#39;s not, so i keep them in true \n&gt; &gt; form pretty much to the original.\n&gt; \n&gt; &gt; -Steve\n&gt; \n&gt; &gt; --- In EVP-ITC@yahoogroups.com, Ron Lederer &lt;ronriko@&gt; wrote:\n&gt; &gt;&gt;\n&gt; &gt;&gt; Hey Steve Forgot to ask...how much editing was needed to get this \n&gt; &gt; file? Did you need to take out a lot of garbage between words \n&gt; &gt; withing the message? Ron L\n&gt; \n&gt; \n&gt; \n&gt;  \n&gt; \n&gt;   _____  \n&gt; \n&gt; More immediate than e-mail? Get instant access with Windows Live Messenger.\n&gt; &lt;http://www.windowslive.com/messenger/overview.html?ocid=TXT_TAGLM_WL_Refres\n&gt; h_instantaccess_042008&gt;  \n&gt; \n&gt;  \n&gt; \n&gt;   \n&gt; \n&gt;   _____  \n&gt; \n&gt; Be a better friend, newshound, and know-it-all with Yahoo! Mobile. Try\n&gt; &lt;http://us.rd.yahoo.com/evt=51733/*http:/mobile.yahoo.com/;_ylt=Ahu06i62sR8H\n&gt; DtDypao8Wcj9tAcJ%20&gt;  it now.\n&gt;"}