{"id": "9940", "subject": "Re: [EVP-ITC] My Ebay Price For The Mini-Box", "author": "Lisby", "timestamp": "2008-04-17T17:18:10Z", "full_text": "I&#39;ve had a mini since December, when he began to produce them. Mine  \nproduces very unique results--you can hear them in the files section-- \nof which I am delighted. I have nothing but good things to say about  \nRon&#39;s minis and I hope you have the astounding success with them that  \nI feel I have.\n\nAnn\n\nOn Apr 17, 2008, at 11:59 AM, Wiliam Clarke wrote:\n\n&gt;\n&gt; On the site of paranormal systems it give you an email that is Ron  \n&gt; Ricketts email.  He told me that he builds the boxes one by one on  \n&gt; his own when you place the order and it takes 5 to 10 day to  \n&gt; receive the Mini box.  Kay, and I both are buying  a Crystal  \n&gt; enhance Mini-Box with a two year warranty.  I can&#39;t wait till I get  \n&gt; mine.\n&gt; Rees\n&gt;\n&gt; kathyweir &lt;kathy_weir@...&gt; wrote:\n&gt; Rick Moran does not run paranormal Systems, ron Ricketts does.\n&gt;\n&gt; Rick Moran runs a non-profit paranormal research site that studied the\n&gt; Mini-Box\n&gt;\n&gt; Kathy\n&gt; ----- Original Message -----\n&gt; From: &quot;bhali333&quot; &lt;paranormalinvestigating@...&gt;\n&gt; To: &lt;EVP-ITC@yahoogroups.com&gt;\n&gt; Sent: Tuesday, April 15, 2008 4:02 PM\n&gt; Subject: [EVP-ITC] My Ebay Price For The Mini-Box\n&gt;\n&gt; &gt; Hi everyone,\n&gt; &gt;\n&gt; &gt; A few people have seen my ebay listing and commented about the price\n&gt; &gt; listed.\n&gt; &gt;\n&gt; &gt; Ebay will not allow you to change a description after the item has\n&gt; &gt; been listed. They do however allow you to add and amending  \n&gt; statement.\n&gt; &gt;\n&gt; &gt; Which I have done In Big Bold Red Letters, the price listing was a\n&gt; &gt; mistake. I am certainly not trying to misrepresent the item or  \n&gt; make a\n&gt; &gt; profit on it.\n&gt; &gt;\n&gt; &gt; I have also lowered the reserve price on it as a result of the\n&gt; &gt; mistake.\n&gt; &gt; Believe me I will be taking a loss on the box.\n&gt; &gt;\n&gt; &gt; I have already sent my apologies to Rick Moran from Paranormal\n&gt; &gt; systems.\n&gt; &gt;\n&gt; &gt; And now extend my apologies for the mistake to anyone that was\n&gt; &gt; interested in it.\n&gt; &gt;\n&gt; &gt; The reason for selling the MB was not the money, it was the guilt of\n&gt; &gt; having this excellent piece of equipment go without the attention it\n&gt; &gt; deserves. And the hopes that someone or some group can utilize it\n&gt; &gt; more than myself.\n&gt; &gt;\n&gt; &gt; But I could not as much as I would have liked to, give it away.\n&gt; &gt; My intention was to get back at least a decent amount of my\n&gt; &gt; investment.\n&gt; &gt;\n&gt; &gt; I hope no one gets the wrong idea and thinks ill of me.\n&gt; &gt;\n&gt; &gt; Bruce\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; ------------------------------------\n&gt; &gt;\n&gt; &gt; Yahoo! Groups Links\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt;\n&gt;\n&gt;\n&gt; Be a better friend, newshound, and know-it-all with Yahoo! Mobile.  \n&gt; Try it now.\n&gt;\n&gt; \n\n\nI' e had a mini since Decembe , when he began o p oduce hem. Mine p oduces e y unique esul s--you can hea hem in he iles sec ion--o which I am deligh ed. I ha e no hing bu good hings o say abou Ron's minis and I hope you ha e he as ounding success wi h hem ha I eel I ha e.AnnOn Ap 17, 2008, a 11:59 AM, Wiliam Cla ke w o e:On he si e o pa ano mal sys ems i gi e you an email ha is Ron Ricke s email.  He old me ha he builds he boxes one by one on his own when you place he o de and i akes 5 o 10 day o ecei e he Mini box.  Kay, and I bo h a e buying  a C ys al enhance Mini-Box wi h a wo yea wa an y.  I can' wai ill I ge mine.Reeska hywei ne > w o e:Rick Mo an does no un pa ano mal Sys ems, on Ricke s does.Rick Mo an uns a non-p o i pa ano mal esea ch si e ha s udied he Mini-BoxKa hy----- O iginal Message ----- F om: \"bhali333\" pa ano malin es iga ing@ho mail.com>To: EVP-ITC@yahoog oups.com>Sen : Tuesday, Ap il 15, 2008 4:02 PMSubjec : [EVP-ITC] My Ebay P ice Fo The Mini-Box> Hi e e yone,>> A ew people ha e seen my ebay lis ing and commen ed abou he p ice> lis ed.>> Ebay will no allow you o change a desc ip ion a e he i em has> been lis ed. They do howe e allow you o add and amending s a emen .>> Which I ha e done In Big Bold Red Le e s, he p ice lis ing was a> mis ake. I am ce ainly no ying o mis ep esen he i em o make a> p o i on i .>> I ha e also lowe ed he ese e p ice on i as a esul o he> mis ake.> Belie e me I will be aking a loss on he box.>> I ha e al eady sen my apologies o Rick Mo an om Pa ano mal> sys ems.>> And now ex end my apologies o he mis ake o anyone ha was> in e es ed in i .>> The eason o selling he MB was no he money, i was he guil o > ha ing his excellen piece o equipmen go wi hou he a en ion i > dese es. And he hopes ha someone o some g oup can u ilize i > mo e han mysel .>> Bu I could no as much as I would ha e liked o, gi e i away.> My in en ion was o ge back a leas a decen amoun o my> in es men .>> I hope no one ge s he w ong idea and hinks ill o me.>> B uce>>> ------------------------------------>> Yahoo! G oups Links>>>Be a be e iend, newshound, and know-i -all wi h Yahoo! Mobile. T y i now."}