{"id": "9949", "subject": "Re: [EVP-ITC] My Ebay Price For The Mini-Box", "author": "Lisby", "timestamp": "2008-04-17T17:39:07Z", "full_text": "To sell it at all loss or give it away is charity on Bruce&#39;s part.\n\nA.\n\nOn Apr 17, 2008, at 1:33 PM, Wiliam Clarke wrote:\n\n&gt;  Sorry Ann, I don&#39;t understand the way you use the word Charity.   \n&gt; How is it charity when your trying to get all your investment  \n&gt; back?  No offense Bruce\n&gt;\n&gt; Lisby &lt;lisby@...&gt; wrote:\n&gt;\n&gt; Oh, and I want to jump in here and say that if anyone thinks that  \n&gt; Bruce shouldn&#39;t try to get his investment in his mini back on ebay  \n&gt; or any other sales venue, I suggest practicing such charity oneself.\n&gt;\n&gt; Ann\n&gt;\n&gt; On Apr 17, 2008, at 11:59 AM, Wiliam Clarke wrote:\n&gt;&gt;\n&gt;&gt; On the site of paranormal systems it give you an email that is Ron  \n&gt;&gt; Ricketts email.  He told me that he builds the boxes one by one on  \n&gt;&gt; his own when you place the order and it takes 5 to 10 day to  \n&gt;&gt; receive the Mini box.  Kay, and I both are buying  a Crystal  \n&gt;&gt; enhance Mini-Box with a two year warranty.  I can&#39;t wait till I  \n&gt;&gt; get mine.\n&gt;&gt; Rees\n&gt;&gt;\n&gt;&gt; kathyweir &lt;kathy_weir@...&gt; wrote:\n&gt;&gt; Rick Moran does not run paranormal Systems, ron Ricketts does.\n&gt;&gt;\n&gt;&gt; Rick Moran runs a non-profit paranormal research site that studied  \n&gt;&gt; the\n&gt;&gt; Mini-Box\n&gt;&gt;\n&gt;&gt; Kathy\n&gt;&gt; ----- Original Message -----\n&gt;&gt; From: &quot;bhali333&quot; &lt;paranormalinvestigating@...&gt;\n&gt;&gt; To: &lt;EVP-ITC@yahoogroups.com&gt;\n&gt;&gt; Sent: Tuesday, April 15, 2008 4:02 PM\n&gt;&gt; Subject: [EVP-ITC] My Ebay Price For The Mini-Box\n&gt;&gt;\n&gt;&gt; &gt; Hi everyone,\n&gt;&gt; &gt;\n&gt;&gt; &gt; A few people have seen my ebay listing and commented about the  \n&gt;&gt; price\n&gt;&gt; &gt; listed.\n&gt;&gt; &gt;\n&gt;&gt; &gt; Ebay will not allow you to change a description after the item has\n&gt;&gt; &gt; been listed. They do however allow you to add and amending  \n&gt;&gt; statement.\n&gt;&gt; &gt;\n&gt;&gt; &gt; Which I have done In Big Bold Red Letters, the price listing was a\n&gt;&gt; &gt; mistake. I am certainly not trying to misrepresent the item or  \n&gt;&gt; make a\n&gt;&gt; &gt; profit on it.\n&gt;&gt; &gt;\n&gt;&gt; &gt; I have also lowered the reserve price on it as a result of the\n&gt;&gt; &gt; mistake.\n&gt;&gt; &gt; Believe me I will be taking a loss on the box.\n&gt;&gt; &gt;\n&gt;&gt; &gt; I have already sent my apologies to Rick Moran from Paranormal\n&gt;&gt; &gt; systems.\n&gt;&gt; &gt;\n&gt;&gt; &gt; And now extend my apologies for the mistake to anyone that was\n&gt;&gt; &gt; interested in it.\n&gt;&gt; &gt;\n&gt;&gt; &gt; The reason for selling the MB was not the money, it was the  \n&gt;&gt; guilt of\n&gt;&gt; &gt; having this excellent piece of equipment go without the  \n&gt;&gt; attention it\n&gt;&gt; &gt; deserves. And the hopes that someone or some group can utilize it\n&gt;&gt; &gt; more than myself.\n&gt;&gt; &gt;\n&gt;&gt; &gt; But I could not as much as I would have liked to, give it away.\n&gt;&gt; &gt; My intention was to get back at least a decent amount of my\n&gt;&gt; &gt; investment.\n&gt;&gt; &gt;\n&gt;&gt; &gt; I hope no one gets the wrong idea and thinks ill of me.\n&gt;&gt; &gt;\n&gt;&gt; &gt; Bruce\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt; ------------------------------------\n&gt;&gt; &gt;\n&gt;&gt; &gt; Yahoo! Groups Links\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; Be a better friend, newshound, and know-it-all with Yahoo! Mobile.  \n&gt;&gt; Try it now.\n&gt;&gt;\n&gt;\n&gt;\n&gt;\n&gt; Be a better friend, newshound, and know-it-all with Yahoo! Mobile.  \n&gt; Try it now.\n&gt;\n&gt; \n\n\nTo sell i a all loss o gi e i away is cha i y on B uce's pa .A.On Ap 17, 2008, a 1:33 PM, Wiliam Cla ke w o e: So y Ann, I don' unde s and he way you use he wo d Cha i y.  How is i cha i y when you ying o ge all you in es men back?  No o ense B uce  Lisby ne > w o e:Oh, and I wan o jump in he e and say ha i anyone hinks ha B uce shouldn' y o ge his in es men in his mini back on ebay o any o he sales enue, I sugges p ac icing such cha i y onesel .AnnOn Ap 17, 2008, a 11:59 AM, Wiliam Cla ke w o e:On he si e o pa ano mal sys ems i gi e you an email ha is Ron Ricke s email.  He old me ha he builds he boxes one by one on his own when you place he o de and i akes 5 o 10 day o ecei e he Mini box.  Kay, and I bo h a e buying  a C ys al enhance Mini-Box wi h a wo yea wa an y.  I can' wai ill I ge mine.Reeska hywei ne > w o e:Rick Mo an does no un pa ano mal Sys ems, on Ricke s does.Rick Mo an uns a non-p o i pa ano mal esea ch si e ha s udied he Mini-BoxKa hy----- O iginal Message ----- F om: \"bhali333\" pa ano malin es iga ing@ho mail.com>To: EVP-ITC@yahoog oups.com>Sen : Tuesday, Ap il 15, 2008 4:02 PMSubjec : [EVP-ITC] My Ebay P ice Fo The Mini-Box> Hi e e yone,>> A ew people ha e seen my ebay lis ing and commen ed abou he p ice> lis ed.>> Ebay will no allow you o change a desc ip ion a e he i em has> been lis ed. They do howe e allow you o add and amending s a emen .>> Which I ha e done In Big Bold Red Le e s, he p ice lis ing was a> mis ake. I am ce ainly no ying o mis ep esen he i em o make a> p o i on i .>> I ha e also lowe ed he ese e p ice on i as a esul o he> mis ake.> Belie e me I will be aking a loss on he box.>> I ha e al eady sen my apologies o Rick Mo an om Pa ano mal> sys ems.>> And now ex end my apologies o he mis ake o anyone ha was> in e es ed in i .>> The eason o selling he MB was no he money, i was he guil o > ha ing his excellen piece o equipmen go wi hou he a en ion i > dese es. And he hopes ha someone o some g oup can u ilize i > mo e han mysel .>> Bu I could no as much as I would ha e liked o, gi e i away.> My in en ion was o ge back a leas a decen amoun o my> in es men .>> I hope no one ge s he w ong idea and hinks ill o me.>> B uce>>> ------------------------------------>> Yahoo! G oups Links>>>Be a be e iend, newshound, and know-i -all wi h Yahoo! Mobile. T y i now.Be a be e iend, newshound, and know-i -all wi h Yahoo! Mobile. T y i now."}