{"id": "995", "subject": "Re: [EVP-ITC] Freak me out!", "author": "Frank Sumption", "timestamp": "2007-04-02T18:03:39Z", "full_text": "Thanks Misty.\n\n&gt;From: Misty Dawn &lt;bulletbabea@...&gt;\n&gt;Reply-To: EVP-ITC@yahoogroups.com\n&gt;To: EVP-ITC@yahoogroups.com\n&gt;Subject: Re: [EVP-ITC] Freak me out!\n&gt;Date: Mon, 2 Apr 2007 09:21:58 -0700 (PDT)\n&gt;\n&gt;Cool Frank! =) I know you can handle it more than you thought you could. As \n&gt;for the phone weirdness perhaps these are for you, named a bit improperly \n&gt;but I did it for good reason. Anyway there was one on the 31st about \n&gt;ringing but I dunno if I posted that one because I couldnt comprehend what \n&gt;they were talkin bout LOL.\n&gt;\n&gt;   Here ya go, have a listen when ya get a chance I think these are 4 you. \n&gt;Its a two parter but one clip goes into the other clip as u will see.\n&gt;\n&gt;   Misty\n&gt;\n&gt;Frank Sumption &lt;franks-boxes@...&gt; wrote:\n&gt;   Well, had a film crew, and interviewers at the house for almost three \n&gt;hours\n&gt;yesterday. I was dreading it, didn&#39;t really want to go through with it, but\n&gt;as usual, not as a bad as I had imagined. We did run the box for the \n&gt;camera,\n&gt;and &quot;they&quot; were talking, and saying names of at least some prestent. It&#39;s\n&gt;hard to catch it all live, so I hope it comes out on the video, and DVRs,\n&gt;since the recordings were being done from monitor speaker on the box.\n&gt;\n&gt;It&#39;s very hard for me to accept being the focus of this kind of attention,\n&gt;but I don&#39;t see the work stopping, so guess I best get used to it.\n&gt;\n&gt;Even my little Yorkie was fascinated, instead of being scared to death of\n&gt;everything, he seemed to be very interestd in the cameras. Usually the dogs\n&gt;bark and bark when someone strange comes in the house, none of them acted\n&gt;thay way with this crew.\n&gt;\n&gt;Then there&#39;s the phone wierdness, maybe realted? for the last couple week \n&gt;my\n&gt;cell would ring about 2:30AM, blockled number, and no one on the it did \n&gt;that\n&gt;last night, same thing. Then at about 4a, my phone rang, then my wifes cell\n&gt;rang, then the house phone, all about a minute apart the last one, and the\n&gt;same thing, blocked number. When it&#39;s answered, it&#39;s dead quiet.\n&gt;\n&gt;\n&gt;\n&gt;Frank\n&gt;\n&gt;_________________________________________________________________\n&gt;i&#39;m making a difference. Make every IM count for the cause of your choice.\n&gt;Join Now.\n&gt;http://clk.atdmt.com/MSN/go/msnnkwme0080000001msn/direct/01/?href=http://im.live.com/messenger/im/home/?source=hmtagline\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;Yahoo! Groups Links\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;---------------------------------\n&gt;Finding fabulous fares is fun.\n&gt;Let Yahoo! FareChase search your favorite travel sites to find flight and \n&gt;hotel bargains.\n\n\n&gt;&lt;&lt; thiswasringin-helpsit.mp3 &gt;&gt;\n\n\n&gt;&lt;&lt; ithelpsittobreathe.mp3 &gt;&gt;\n\n_________________________________________________________________\n5.5%* 30 year fixed mortgage rate. Good credit refinance. Up to 5 free \nquotes - *Terms \nhttps://www2.nextag.com/goto.jsp?product=100000035&url=%2fst.jsp&tm=y&search=mortgage_text_links_88_h2a5d&s=4056&p=5117&disc=y&vers=910"}