{"id": "9954", "subject": "For Bruce  Re: [EVP-ITC] my opinion on the speech to text issue", "author": "Ron Lederer", "timestamp": "2008-04-17T18:31:55Z", "full_text": "--0-1620542876-1208457115=:98539\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nHi Bruce    Question...Aaron recently posted a message with results from his speech-to-text software where he dictated in a monotone fashion to train the software.  He was impersonating speakjet.  My question is, if the speech-to-text program could correctly pick out words from speakjet, then wouldn&#39;t any EVP words also be picked out since they would be in the same phonics?  I believe that is the assumption behind the new test Aaron and Stefan were discussing.  Wadayathink?  Ron L\n\nbhali333 &lt;paranormalinvestigating@...&gt; wrote:          hi everyone,\n\nI have been following the posts about voice to text experiments with \nthe allophones program.\n\nI had done some research and experiments with the speech to text \nfeature supplied with Microsoft office.\n\nI found that because all speech to text programs that are currently \navailable are based on the users voice , speech pattern.\n\nand must be trained by the user to be able to recognise the \nindividual users phonetic pattern. Such as accent, dialect and \ngeneral pronunciation.\n\nThe current speech to text software available today could not learn \nfrom or accomodate training from basic allophones tones.\n\nIt must be taught to recognize Particular human speech patterns.\n\nI had trained the speech to text program extensively and had hoped it \nwould be able to use the spirit words formed from the radio\n\nfragments coming from a box, because they where based and \nmanufactured by fragments of human speech.\n\nBut to no avail. the program would only accept my personal voice \npattern and even then needed to be retrained periodically.\n\nThese programs where basically designed for stenographic purposes and \nto be used by secretaries and stenographers.\n\nI experimented for months with this idea and never received one \nspirit message in text.\n\nBruce\n\n\n\n                           \n\n       \n---------------------------------\nBe a better friend, newshound, and know-it-all with Yahoo! Mobile.  Try it now.\r\n--0-1620542876-1208457115=:98539\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nHi Bruce&nbsp;&nbsp;&nbsp; Question...Aaron recently posted a message with results from his&nbsp;speech-to-text software where he dictated in a monotone fashion to train the software.&nbsp; He was impersonating speakjet.&nbsp; My question is, if the speech-to-text program could&nbsp;correctly pick out words from speakjet, then wouldn&#39;t any EVP words also be picked out since they would be in the same phonics?&nbsp; I believe that is the assumption behind the new test Aaron and Stefan were discussing.&nbsp; Wadayathink?&nbsp; Ron L&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;bhali333 &lt;paranormalinvestigating@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;div&gt;hi everyone,&lt;BR&gt;&lt;BR&gt;I have been following the posts about voice to text experiments with &lt;BR&gt;the allophones program.&lt;BR&gt;&lt;BR&gt;I had done some research and experiments with the speech to text &lt;BR&gt;feature supplied with Microsoft office.&lt;BR&gt;&lt;BR&gt;I found that because all speech to text programs that are currently &lt;BR&gt;available are based on the users voice , speech pattern.&lt;BR&gt;&lt;BR&gt;and must be trained by the user to be able to recognise the &lt;BR&gt;individual users phonetic pattern. Such as accent, dialect and &lt;BR&gt;general pronunciation.&lt;BR&gt;&lt;BR&gt;The current speech to text software available today could not learn &lt;BR&gt;from or accomodate training from basic allophones tones.&lt;BR&gt;&lt;BR&gt;It must be taught to recognize Particular human speech patterns.&lt;BR&gt;&lt;BR&gt;I had trained the speech to text program extensively and had hoped it &lt;BR&gt;would be able to use the spirit words formed from the radio&lt;BR&gt;&lt;BR&gt;fragments coming from a box, because\n they where based and &lt;BR&gt;manufactured by fragments of human speech.&lt;BR&gt;&lt;BR&gt;But to no avail. the program would only accept my personal voice &lt;BR&gt;pattern and even then needed to be retrained periodically.&lt;BR&gt;&lt;BR&gt;These programs where basically designed for stenographic purposes and &lt;BR&gt;to be used by secretaries and stenographers.&lt;BR&gt;&lt;BR&gt;I experimented for months with this idea and never received one &lt;BR&gt;spirit message in text.&lt;BR&gt;&lt;BR&gt;Bruce&lt;BR&gt;&lt;BR&gt;&lt;/div&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;p&gt;&#32;\n\n      &lt;hr size=1&gt;Be a better friend, newshound, and \nknow-it-all with Yahoo! Mobile. &lt;a href=&quot;http://us.rd.yahoo.com/evt=51733/*http://mobile.yahoo.com/;_ylt=Ahu06i62sR8HDtDypao8Wcj9tAcJ &quot;&gt; Try it now.&lt;/a&gt;\r\n--0-1620542876-1208457115=:98539--"}