{"id": "9974", "subject": "RE: For Juli   Re: [EVP-ITC] Re: Editing EVP- Are you Crazy?", "author": "bruce halliday", "timestamp": "2008-04-17T20:16:14Z", "full_text": "--_2aa6a674-89c3-415c-9573-c8ad0faf3ede_\r\nContent-Type: text/plain; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n\nRon,\n \nAnd anyone that does not have experience on this subject.\nEDITING D=\r\nOES NOT MEAN SPLICE!\n \nIf you splice something you are either adding or cut=\r\nting out relevant sections to make the file say what you want it to say.\nI =\r\ndon&#39;t think that is what Juli meant to convey in this post.\n \nIf every rese=\r\narcher that has or does use an editing program to clean up their recordings=\r\n and files was to stop doing research right now\nthis group and all like it =\r\nwould be a GHOST TOWN ! \n \nLets not let this thread get out of control.\n \nB=\r\nruce\nBruce Halliday \n\n\nTo: EVP-ITC@yahoogroups.comFrom: ronriko@...=\r\nte: Thu, 17 Apr 2008 12:11:03 -0700Subject: For Juli Re: [EVP-ITC] Re: Edit=\r\ning EVP- Are you Crazy?\n\n\n\n\n\nHi Juli   Questions regarding you comments:  d=\r\noes the term EDIT=3DSPLICE?  Amplification and de-hissing is o.k. and not c=\r\nonsidered EDITING?  \n \nAlso, it seems to me that something like EVPmaker an=\r\nd Speakjet sessions are in a different classification than say a live, remo=\r\nte assignment where classic EVP&#39;s are sought or where you are sharing sessi=\r\nons with the public or with clients?  It also seems that sharing sessions h=\r\nere is quite different than making your professional services available to =\r\nthe public.  Rules can be set for this forum.  Rules cannot be set for the =\r\npublic.  Have rules or guidelines been set here?  More thoughts.  Ron Ljuli=\r\n velazquez &lt;ghostchasingfool@...&gt; wrote: \n\n\n\nFor those of you who are=\r\n paranormal investigators alike, you know the first rule of thumb is NEVER =\r\nedit your clips!  If you want to be taken serious in this field and not und=\r\ner a microscope with the question of whether or not you in fact did actuall=\r\ny get a voice and/or response and that clip is edited, don&#39;t bother putting=\r\n it up for public display.  You can amplify it, take out the hiss, but you =\r\nbetter not splice it in any way, cause your just asking for trouble.  \n \nI =\r\nhad this very debate with Bruce long ago.  I know first hand that if in fac=\r\nt its edited many question your motives behind why you in fact would bother=\r\n removing the dead airtime between.  The very first thing that came into qu=\r\nestion when editing EVP from Frank&#39;s Box many moons ago (pun intended) that=\r\n a certain person was in fact splicing his audio by putting the questions a=\r\nnd response right after.  Many now consider him to be a fraud and this was =\r\njust one of the reason built upon others as a direct result.  You are alter=\r\ning the clip, no ifs and or butts about.  It can therefore hurt your credit=\r\nability as a researcher in the paranormal field.  Regardless with you save =\r\nyour original clips.  Everything you do comes into question.  You can clear=\r\nly tell by the skip in rhythm as you play the audio vs the free flowing of =\r\nthe dial when it has been altered.  Real Time is real time people, not 15 s=\r\neconds after the fact.  If you have to questions what you got....&quot;If in Dou=\r\nbt, throw It Out&quot;.\n \nPeople, there is one thing that you have to remember. =\r\n The word of box research is spreading, and there are those who are impleme=\r\nnting it as an additional tool on investigations.  This is not just some wh=\r\no are going to give up their current status as a ghost hunter to now slowly=\r\n be a box researcher ( for that was never a thought for me).  I was hoping =\r\nthat through my research I could in fact incorporate it on my investigation=\r\ns.  Because of the radio fragments itself, there are many that do not suppo=\r\nrt this research and believe we are reaching and grasping at nothing, and l=\r\niterally laugh when the subject of box research comes up.  Do you really wa=\r\nnt to give them an extra ammunition as splicing your clips?  I know myself =\r\nthat there is more that meets the eye in this line for communication, and I=\r\n do stand proud and true of pursuing real time communication, myself, but c=\r\nutting out the dead air is not just because you don&#39;t want to listen to it,=\r\n or you can&#39;t fit it all is a lame excuse.  Use a different program!\n \nI pe=\r\nrsonally have questioned many on their clips and have to tell you that if y=\r\nou truly want to be considered as a professional paranormal investigator/re=\r\nsearcher that if you intend to use this protocol for you evp/box research c=\r\nlips, you stand to loose your creditability and the word fraud may just com=\r\ne into question.\n \nHowever, if you have nothing to loose as far as your rep=\r\nutation and or not in it to prove anything to anyone, be my guest.  There a=\r\nre many here that are not involved in the paranormal field and a prefer evp=\r\n-itc researcher vs. other areas of the super natural.  If they are not putt=\r\ning themselves out there for God and Country to see, and are only doing it =\r\nfor your personal results and curiosity, and can could careless with others=\r\n thing, then clip away to your hearts content!  \n \nJust remember, if someon=\r\ne who is currently studying evp and not box research sees and hears your cl=\r\nips, don&#39;t be surprised, if they start questioning your motives and box res=\r\nearch all together!\n \nJust adding my 2 cents!\nJulipsfponies &lt;psfponies@yaho=\r\no.com&gt; wrote: \n\n\nYes I get your point Rees. On long messages cutting out th=\r\ne crap between words in the message.Kay--- In EVP-ITC@yahoogroups.com, Ron =\r\nLederer &lt;ronriko@...&gt; wrote:&gt;&gt; Sorry, don&#39;t get the point rees. Ron L&gt; &gt; Wi=\r\nliam Clarke &lt;reesclarke_69@...&gt; wrote: My thoughts on cut out the garbage l=\r\neads people to believe that the messages that some people are getting messa=\r\nges are all in one sentence.&gt; &gt; Example Question: How are you today? &gt; &gt; 1s=\r\nt Answer:(Cut Up) I&#39;m good, me and my spirts friends here wants to give you=\r\n a long message for the reseachers to here&gt; &gt; &gt; 2nd Answer:(Not Cut) I&#39;m bl=\r\nah blah blah blah blah blah blah blah blah blah blah good blah blah.&gt; &gt; Doe=\r\ns anybody see my point on cut up messages?&gt; &gt; Rees&gt; &gt; bruce halliday &lt;paran=\r\normalinvestigating@...&gt; wrote:&gt; Stefan,&gt; &gt; I do remove the &quot;garbage&quot; from m=\r\ny files.&gt; &gt; At this point in my research, the message is more important to =\r\nme than the proof of it.&gt; I think most of us here will agree that we are re=\r\nceiving some sort of paranormal communication.&gt; but it definitely exists. n=\r\now we need to concentrate on the messages they need us to hear and the answ=\r\ners to the questions&gt; we ask and in turn our answers to their questions. An=\r\nyone that cleans a file in this way should not be touching any bit of the f=\r\nile&gt; that has a semblance of speech, only the bits that are odiously garbag=\r\ne like the &quot;EH O EH AH O EH UR&quot; in between words.&gt; &gt; For example &quot;Is there =\r\nanyone here that wishes to communicate_YES_AH ER EEH AR OOO AR_WE ARE_EH IH=\r\n AHH EHH_HERE&quot;&gt; It is much easier for me as a researcher to be able to retu=\r\nrn to a file that I recieved two weeks ago and that I believe may hold some=\r\n&gt; relivence to a message I just received and be able to cleanly listen to i=\r\nt, without the distraction of the garbage sounds.&gt; &gt; At this stage in real =\r\ntime communication the messages are the top priority.&gt; I do however agree t=\r\nhat the untouched version should be retained and made available to individu=\r\nals that make a request &gt; for any intelligent sceptical or authenticity cha=\r\nllenge that may be made, and god knows there are always fanatical &gt; sceptic=\r\ns lurking in the shadows awaiting an opportunity to attack an unwary or inj=\r\nured researcher. I do not think that &gt; our research files should be made av=\r\nailable on request by every tom dick and harry that is unknown to us and ma=\r\ny potentially&gt; doctor the file to suit their own point and post it as such.=\r\n&gt; &gt; I have had this happen to me in the past so I believe the researcher th=\r\nat receives the request for raw research data should &gt; scrutinize the reque=\r\nsting source and use their best judgment before handing out any research da=\r\nta.&gt; &gt; These are my thoughts on the subject of cleaning a file.&gt; &gt; Bruce&gt; &gt;=\r\n &gt; Bruce Halliday &gt; &gt; &gt; &gt; &gt; &gt; ---------------------------------&gt; To: EVP-IT=\r\nC@yahoogroups.com&gt; From: yahoogroups@...&gt; Date: Thu, 17 Apr 2008 09:55:42 +=\r\n0200&gt; Subject: [EVP-ITC] Editing EVP&gt; &gt; Hi all,&gt; &gt; just a general comment o=\r\nn editing EVP: For scientific reasons, I would&gt; suggest not to edit an EVP =\r\nmessage partially, but only as a whole, in&gt; order to rule out any possible =\r\nsuspicion of manipulation. You can for&gt; instance increase the volume or dyn=\r\namics of an entire clip (including&gt; the experimenter&#39;s voice), filter or de=\r\nnoise it to make it clearer, but&gt; not cut out individual pieces (supposed &quot;=\r\ngarbage&quot;) to make an EVP match&gt; with what it &quot;should be&quot;. At least, the une=\r\ndited version should always&gt; be provided along with the edited version.&gt; &gt; =\r\nBut that&#39;s only my personal opinion which I thought I had to express, as&gt; w=\r\ne should always be able to present our results to a critical public.&gt; &gt; Ste=\r\nfan&gt; &gt; -- &gt; &gt; &gt; Believe or not Ron, very little editing is involved for the=\r\nse files.&gt; &gt; After my question, i isolate the response section and slow tha=\r\nt &gt; &gt; section down about 20%. Now i can actually start to hear the message =\r\n&gt; &gt; a lot clearer, i also now see a couple sections of just noise that &gt; &gt; =\r\ndon&#39;t belong and eliminate them from the mix. You can&#39;t piece these &gt; &gt; fil=\r\nes together to make something it&#39;s not, so i keep them in true &gt; &gt; form pre=\r\ntty much to the original.&gt; &gt; &gt; -Steve&gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com, =\r\nRon Lederer &lt;ronriko@&gt; wrote:&gt; &gt;&gt;&gt; &gt;&gt; Hey Steve Forgot to ask...how much ed=\r\niting was needed to get this &gt; &gt; file? Did you need to take out a lot of ga=\r\nrbage between words &gt; &gt; withing the message? Ron L&gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt; ---------=\r\n------------------------&gt; More immediate than e-mail? Get instant access wi=\r\nth Windows Live Messenger. &gt; &gt; &gt; &gt; &gt; ---------------------------------&gt; Be =\r\na better friend, newshound, and know-it-all with Yahoo! Mobile. Try it now.=\r\n &gt; &gt; &gt; &gt; &gt; ---------------------------------&gt; Be a better friend, newshound=\r\n, and know-it-all with Yahoo! Mobile. Try it now.&gt;\n\nThe contents of this el=\r\netronic correspondence is private & confidential and meant only for the par=\r\nty and/or parties it is addressed to.  \n \nNo part of this email transmissio=\r\nn may be publicly posted or forwarded to other parties without explicit wri=\r\ntten permission.\n\n\n\nBe a better friend, newshound, and know-it-all with Yah=\r\noo! Mobile. Try it now. \n \n\n\n\n\n\n\n__________________________________________=\r\n_______________________\nUse video conversation to talk face-to-face with Wi=\r\nndows Live Messenger.\nhttp://www.windowslive.com/messenger/connect_your_way=\r\n.html?ocid=3DTXT_TAGLM_WL_Refresh_messenger_video_042008\r\n--_2aa6a674-89c3-415c-9573-c8ad0faf3ede_\r\nContent-Type: text/html; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;\n&lt;head&gt;\n&lt;style&gt;\n.hmmessage P\n{\nmargin:0px;\npadding:0px\n}\nbody.hmmessa=\r\nge\n{\nFONT-SIZE: 10pt;\nFONT-FAMILY:Tahoma\n}\n&lt;/style&gt;\n&lt;/head&gt;\n&lt;body class=3D&#39;=\r\nhmmessage&#39;&gt;\nRon,&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nAnd anyone that does not have experience on=\r\n this subject.&lt;BR&gt;\nEDITING DOES NOT MEAN SPLICE!&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nIf you spli=\r\nce something you are either adding or cutting out relevant sections to make=\r\n the file say what you want it to say.&lt;BR&gt;\nI don&#39;t think that is what Juli =\r\nmeant to convey in this post.&lt;BR&gt;\n&nbsp;&lt;BR&gt;\nIf every researcher that has o=\r\nr does use an editing program to clean up their recordings and files was to=\r\n stop doing research right now&lt;BR&gt;\nthis group and all like it would be a GH=\r\nOST TOWN ! &lt;BR&gt;\n&nbsp;&lt;BR&gt;\nLets not let this thread get out of control.&lt;BR&gt;=\r\n\n&nbsp;&lt;BR&gt;\nBruce&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;P align=3Dcenter&gt;&lt;FONT size=3D4&gt;&lt;FONT color=\r\n=3D#0033cc&gt;&lt;STRONG&gt;&lt;EM&gt;&lt;FONT color=3D#000000 size=3D5&gt;Bruce Halliday &lt;BR&gt;&lt;/=\r\nFONT&gt;&lt;/EM&gt;&lt;/STRONG&gt;&lt;BR&gt;&lt;A href=3D&quot;http://free-paranormalinvestigating.com/%=\r\n3C/div%3E%3C/div%3E%3Cp%20/%3E%3Cdiv%20class=3D&quot; target=3D_blank&gt;&lt;/P&gt;&lt;/A&gt;&lt;/=\r\nFONT&gt;&lt;/FONT&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;BLOCKQUOTE&gt;\n&lt;HR&gt;\nTo: EVP-ITC@yahoogroups.com&lt;BR&gt;From:=\r\n ronriko@...&lt;BR&gt;Date: Thu, 17 Apr 2008 12:11:03 -0700&lt;BR&gt;Subject: For=\r\n Juli Re: [EVP-ITC] Re: Editing EVP- Are you Crazy?&lt;BR&gt;&lt;BR&gt;\n&lt;META content=\r\n=3D&quot;Microsoft SafeHTML&quot; name=3DGenerator&gt;\n&lt;DIV id=3DEC_ygrp-mlmsg style=3D&quot;=\r\nWIDTH: 655px&quot;&gt;\n&lt;DIV id=3DEC_ygrp-msg style=3D&quot;PADDING-RIGHT: 25px; PADDING-=\r\nLEFT: 0px; Z-INDEX: 1; FLOAT: left; PADDING-BOTTOM: 0px; WIDTH: 470px; PADD=\r\nING-TOP: 0px&quot;&gt;\n&lt;DIV id=3DEC_ygrp-text&gt;\n\n&lt;DIV&gt;Hi Juli&nbsp;&nbsp; Questions =\r\nregarding you comments:&nbsp;&nbsp;does the term EDIT=3DSPLICE?&nbsp; Ampli=\r\nfication and de-hissing is o.k. and not considered EDITING?&nbsp; &lt;/DIV&gt;\n&lt;D=\r\nIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Also, it seems to me that something like EVPmaker and =\r\nSpeakjet sessions are in a different classification than say a live, remote=\r\n assignment where classic EVP&#39;s are sought or where you are sharing session=\r\ns with the public or with clients?&nbsp; It also seems that sharing session=\r\ns here is quite different than making your professional services available =\r\nto the public.&nbsp;&nbsp;Rules can be set for this forum.&nbsp; Rules cann=\r\not be set&nbsp;for the public.&nbsp;&nbsp;Have rules or guidelines been set=\r\n here?&nbsp; More thoughts.&nbsp; Ron L&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;juli velazquez &lt;gho=\r\nstchasingfool@&lt;WBR&gt;yahoo.com&gt;&lt;/I&gt;&lt;/B&gt; wrote: &lt;/DIV&gt;\n&lt;BLOCKQUOTE class=3D=\r\nEC_replbq style=3D&quot;BORDER-LEFT: #1010ff 2px solid&quot;&gt;\n&lt;DIV id=3DEC_ygrp-text&gt;=\r\n\n&lt;DIV&gt;\n&lt;DIV&gt;For those of you who are paranormal investigators&nbsp;alike, y=\r\nou know the first rule of thumb is &lt;STRONG&gt;&lt;FONT color=3D#ff007f&gt;NEVER&lt;/FON=\r\nT&gt;&lt;/STRONG&gt; edit your clips!&nbsp; If you want to be taken serious in this =\r\nfield and not under a microscope with the question of whether or not you in=\r\n fact did actually get a voice and/or response and that clip is edited, don=\r\n&#39;t bother putting it up for public display.&nbsp; You can amplify it, take =\r\nout the hiss, but you better not &lt;FONT color=3D#0080ff&gt;splice&lt;/FONT&gt; it in =\r\nany way, cause your just asking for trouble.&nbsp; &lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;=\r\n\n&lt;DIV&gt;I had this very debate with Bruce long ago.&nbsp;&nbsp;I know first h=\r\nand that if in fact its edited many question your motives behind why you in=\r\n fact would bother removing the dead airtime between.&nbsp; The very first =\r\nthing that came into question when editing EVP from Frank&#39;s Box many moons =\r\nago (pun intended) that a certain person was in fact splicing his audio by =\r\nputting the questions and response right after.&nbsp; Many now consider him=\r\n to be a fraud and this was just one of the reason built upon others as a d=\r\nirect result.&nbsp; You are altering the clip, no ifs and or butts about.&n=\r\nbsp; It can&nbsp;therefore hurt&nbsp;your creditability as a researcher in =\r\nthe paranormal field.&nbsp;&nbsp;Regardless with you save your original cli=\r\nps.&nbsp; Everything you do comes into question.&nbsp; You can clearly tell=\r\n by the skip in rhythm as you play the audio vs the free flowing of the dia=\r\nl when it has been altered.&nbsp; Real Time is real time people, not 15 sec=\r\nonds after the fact.&nbsp; If you have to questions what you got....&quot;If in =\r\nDoubt, throw It Out&quot;.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;People, there is one thi=\r\nng that you have to remember.&nbsp; The word of box research is spreading, =\r\nand there are those who are implementing it as an additional tool on invest=\r\nigations.&nbsp; This is not just some who are going to give up their curren=\r\nt status as a ghost hunter to now slowly be a box researcher ( for that was=\r\n never a thought for me).&nbsp; I was hoping that through my research I cou=\r\nld in fact incorporate it on my investigations.&nbsp; Because of the radio =\r\nfragments itself, there are many that do not support this research and beli=\r\neve we are reaching and grasping at nothing, and literally laugh when the s=\r\nubject of box research comes up.&nbsp; Do you really want to give them an e=\r\nxtra ammunition as splicing your clips?&nbsp; I know myself that there is m=\r\nore that meets the eye in this line for communication, and I do stand proud=\r\n and true of pursuing real time communication, myself, but cutting out the =\r\ndead air is not just because you don&#39;t want to listen to it, or you can&#39;t f=\r\nit it all is a lame excuse.&nbsp; Use a different program!&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp=\r\n;&lt;/DIV&gt;\n&lt;DIV&gt;I personally have questioned many&nbsp;on their clips and have=\r\n to tell you that if you truly want to be considered as a professional para=\r\nnormal investigator/&lt;WBR&gt;researcher that if you intend to use this protocol=\r\n for you evp/box research clips, you stand to loose your creditability and =\r\nthe word fraud may just come into question.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Ho=\r\nwever, if you have nothing to loose as far as your reputation and or not in=\r\n it to prove anything to anyone, be my guest.&nbsp; There are many here tha=\r\nt are not involved in the paranormal field and a prefer&nbsp;evp-itc resear=\r\ncher vs. other areas of the super natural.&nbsp; If they are not putting th=\r\nemselves out there for God and Country to see, and are only doing it for yo=\r\nur personal&nbsp;results and curiosity,&nbsp;and can could careless with ot=\r\nhers thing, then clip away to your hearts content!&nbsp;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&=\r\nnbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Just remember, if someone who is currently studying evp an=\r\nd not box research sees and hears your clips, don&#39;t be surprised, if they s=\r\ntart questioning your motives and box research all together!&lt;/DIV&gt;\n&lt;DIV&gt;&nb=\r\nsp;&lt;/DIV&gt;\n&lt;DIV&gt;Just adding my 2 cents!&lt;/DIV&gt;\n&lt;DIV&gt;Juli&lt;BR&gt;&lt;/DIV&gt;&lt;BR&gt;&lt;BR&gt;&lt;B&gt;=\r\n&lt;I&gt;psfponies &lt;psfponies@yahoo.&lt;WBR&gt;com&gt;&lt;/I&gt;&lt;/B&gt; wrote: \n&lt;BLOCKQUOTE c=\r\nlass=3DEC_replbq style=3D&quot;BORDER-LEFT: #1010ff 2px solid&quot;&gt;\n&lt;DIV id=3DEC_ygr=\r\np-text&gt;\n&lt;DIV&gt;Yes I get your point Rees. On long messages cutting out the cr=\r\nap &lt;BR&gt;between words in the message.&lt;BR&gt;&lt;BR&gt;Kay&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=3D&quot;ma=\r\nilto:EVP-ITC@yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;, Ron Lederer=\r\n &lt;ronriko@...&lt;WBR&gt;&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; Sorry, don&#39;t get the point=\r\n rees. Ron L&lt;BR&gt;&gt; &lt;BR&gt;&gt; Wiliam Clarke &lt;reesclarke_&lt;WBR&gt;69@...&gt; =\r\nwrote: My thoughts on &lt;BR&gt;cut out the garbage leads people to believe that =\r\nthe messages that &lt;BR&gt;some people are getting messages are all in one sente=\r\nnce.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Example Question: How are you today? &lt;BR&gt;&gt; &lt;BR&gt;&gt=\r\n; 1st Answer:(Cut Up) I&#39;m good, me and my spirts friends here &lt;BR&gt;wants to =\r\ngive you a long message for the reseachers to here&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; 2n=\r\nd Answer:(Not Cut) I&#39;m blah blah blah blah blah blah blah blah &lt;BR&gt;blah bla=\r\nh blah good blah blah.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Does anybody see my point on cut up=\r\n messages?&lt;BR&gt;&gt; &lt;BR&gt;&gt; Rees&lt;BR&gt;&gt; &lt;BR&gt;&gt; bruce halliday &lt;parano=\r\nrmalinvestig&lt;WBR&gt;ating@...&lt;WBR&gt;&gt; wrote:&lt;BR&gt;&gt; Stefan,&lt;BR&gt;&gt; &lt;BR&gt;&gt;=\r\n I do remove the &quot;garbage&quot; from my files.&lt;BR&gt;&gt; &lt;BR&gt;&gt; At this point in=\r\n my research, the message is more important to me &lt;BR&gt;than the proof of it.=\r\n&lt;BR&gt;&gt; I think most of us here will agree that we are receiving some sort=\r\n &lt;BR&gt;of paranormal communication.&lt;BR&gt;&gt; but it definitely exists. now we =\r\nneed to concentrate on the &lt;BR&gt;messages they need us to hear and the answer=\r\ns to the questions&lt;BR&gt;&gt; we ask and in turn our answers to their question=\r\ns. Anyone that &lt;BR&gt;cleans a file in this way should not be touching any bit=\r\n of the file&lt;BR&gt;&gt; that has a semblance of speech, only the bits that are=\r\n odiously &lt;BR&gt;garbage like the &quot;EH O EH AH O EH UR&quot; in between words.&lt;BR&gt;&g=\r\nt; &lt;BR&gt;&gt; For example &quot;Is there anyone here that wishes to &lt;BR&gt;communicat=\r\ne_&lt;WBR&gt;YES_AH ER EEH AR OOO AR_WE ARE_EH IH AHH EHH_HERE&quot;&lt;BR&gt;&gt; It is muc=\r\nh easier for me as a researcher to be able to return to a &lt;BR&gt;file that I r=\r\necieved two weeks ago and that I believe may hold some&lt;BR&gt;&gt; relivence to=\r\n a message I just received and be able to cleanly &lt;BR&gt;listen to it, without=\r\n the distraction of the garbage sounds.&lt;BR&gt;&gt; &lt;BR&gt;&gt; At this stage in r=\r\neal time communication the messages are the top &lt;BR&gt;priority.&lt;BR&gt;&gt; I do =\r\nhowever agree that the untouched version should be retained &lt;BR&gt;and made av=\r\nailable to individuals that make a request &lt;BR&gt;&gt; for any intelligent sce=\r\nptical or authenticity challenge that may &lt;BR&gt;be made, and god knows there =\r\nare always fanatical &lt;BR&gt;&gt; sceptics lurking in the shadows awaiting an o=\r\npportunity to attack &lt;BR&gt;an unwary or injured researcher. I do not think th=\r\nat &lt;BR&gt;&gt; our research files should be made available on request by every=\r\n &lt;BR&gt;tom dick and harry that is unknown to us and may potentially&lt;BR&gt;&gt; d=\r\noctor the file to suit their own point and post it as such.&lt;BR&gt;&gt; &lt;BR&gt;&gt=\r\n; I have had this happen to me in the past so I believe the &lt;BR&gt;researcher =\r\nthat receives the request for raw research data should &lt;BR&gt;&gt; scrutinize =\r\nthe requesting source and use their best judgment &lt;BR&gt;before handing out an=\r\ny research data.&lt;BR&gt;&gt; &lt;BR&gt;&gt; These are my thoughts on the subject of c=\r\nleaning a file.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Bruce&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; Bruce Hall=\r\niday &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; ------------&lt;WBR=\r\n&gt;---------&lt;WBR&gt;---------&lt;WBR&gt;---&lt;BR&gt;&gt; To: &lt;A href=3D&quot;mailto:EVP-ITC@yaho=\r\nogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;&lt;BR&gt;&gt; From: yahoogroups@&lt;WB=\r\nR&gt;...&lt;BR&gt;&gt; Date: Thu, 17 Apr 2008 09:55:42 +0200&lt;BR&gt;&gt; Subject: [EVP-I=\r\nTC] Editing EVP&lt;BR&gt;&gt; &lt;BR&gt;&gt; Hi all,&lt;BR&gt;&gt; &lt;BR&gt;&gt; just a general co=\r\nmment on editing EVP: For scientific reasons, I &lt;BR&gt;would&lt;BR&gt;&gt; suggest n=\r\not to edit an EVP message partially, but only as a whole, &lt;BR&gt;in&lt;BR&gt;&gt; or=\r\nder to rule out any possible suspicion of manipulation. You can &lt;BR&gt;for&lt;BR&gt;=\r\n&gt; instance increase the volume or dynamics of an entire clip &lt;BR&gt;(includ=\r\ning&lt;BR&gt;&gt; the experimenter&#39;&lt;WBR&gt;s voice), filter or denoise it to make it=\r\n &lt;BR&gt;clearer, but&lt;BR&gt;&gt; not cut out individual pieces (supposed &quot;garbage&quot;=\r\n) to make an EVP &lt;BR&gt;match&lt;BR&gt;&gt; with what it &quot;should be&quot;. At least, the =\r\nunedited version should &lt;BR&gt;always&lt;BR&gt;&gt; be provided along with the edite=\r\nd version.&lt;BR&gt;&gt; &lt;BR&gt;&gt; But that&#39;s only my personal opinion which I tho=\r\nught I had to &lt;BR&gt;express, as&lt;BR&gt;&gt; we should always be able to present o=\r\nur results to a critical &lt;BR&gt;public.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Stefan&lt;BR&gt;&gt; &lt;BR&gt;&g=\r\nt; -- &lt;BR&gt;&gt; &lt;BR&gt;&gt; &gt; Believe or not Ron, very little editing is inv=\r\nolved for these &lt;BR&gt;files.&lt;BR&gt;&gt; &gt; After my question, i isolate the re=\r\nsponse section and slow that &lt;BR&gt;&gt; &gt; section down about 20%. Now i ca=\r\nn actually start to hear the &lt;BR&gt;message &lt;BR&gt;&gt; &gt; a lot clearer, i als=\r\no now see a couple sections of just noise &lt;BR&gt;that &lt;BR&gt;&gt; &gt; don&#39;t belo=\r\nng and eliminate them from the mix. You can&#39;t piece &lt;BR&gt;these &lt;BR&gt;&gt; &gt;=\r\n files together to make something it&#39;s not, so i keep them in &lt;BR&gt;true &lt;BR&gt;=\r\n&gt; &gt; form pretty much to the original.&lt;BR&gt;&gt; &lt;BR&gt;&gt; &gt; -Steve&lt;BR=\r\n&gt;&gt; &lt;BR&gt;&gt; &gt; --- In &lt;A href=3D&quot;mailto:EVP-ITC@yahoogroups.com&quot;&gt;EVP-I=\r\nTC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;, Ron Lederer &lt;ronriko@&gt; wrote:&lt;BR&gt;&gt; &g=\r\nt;&gt;&lt;BR&gt;&gt; &gt;&gt; Hey Steve Forgot to ask...how much editing was need=\r\ned to get &lt;BR&gt;this &lt;BR&gt;&gt; &gt; file? Did you need to take out a lot of ga=\r\nrbage between words &lt;BR&gt;&gt; &gt; withing the message? Ron L&lt;BR&gt;&gt; &lt;BR&gt;&g=\r\nt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; ------------&lt;WBR&gt;-=\r\n--------&lt;WBR&gt;---------&lt;WBR&gt;---&lt;BR&gt;&gt; More immediate than e-mail? Get inst=\r\nant access with Windows Live &lt;BR&gt;Messenger. &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;=\r\n&gt; &lt;BR&gt;&gt; ------------&lt;WBR&gt;---------&lt;WBR&gt;---------&lt;WBR&gt;---&lt;BR&gt;&gt; Be a=\r\n better friend, newshound, and know-it-all with Yahoo! &lt;BR&gt;Mobile. Try it n=\r\now. &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; ------------&lt;WBR&gt;---------=\r\n&lt;WBR&gt;---------&lt;WBR&gt;---&lt;BR&gt;&gt; Be a better friend, newshound, and know-it-a=\r\nll with Yahoo! &lt;BR&gt;Mobile. Try it now.&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BLOCKQU=\r\nOTE&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;\n&lt;DIV&gt;\n&lt;DIV&gt;&lt;EM&gt;&lt;STRONG&gt;&lt;FONT color=3D#0000ff&gt;The contents =\r\nof this eletronic correspondence is private &amp; confidential and meant on=\r\nly for the party and/or parties it is addressed to.&nbsp; &lt;/FONT&gt;&lt;/STRONG&gt;&lt;=\r\n/EM&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;EM&gt;&lt;STRONG&gt;&lt;FONT color=3D#0000ff&gt;&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/EM&gt;&nbs=\r\np;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;EM&gt;&lt;STRONG&gt;&lt;FONT color=3D#0000ff&gt;No part of this email trans=\r\nmission may be publicly posted or forwarded to other parties without explic=\r\nit written permission.&lt;/FONT&gt;&lt;/STRONG&gt;&lt;/EM&gt;&lt;/DIV&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/=\r\nDIV&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;\n&lt;P&gt;\n&lt;HR SIZE=3D1&gt;\nBe a better friend, newshound, and =\r\nknow-it-all with Yahoo! Mobile. &lt;A href=3D&quot;http://us.rd.yahoo.com/evt=3D517=\r\n33/*http://mobile.yahoo.com/;_ylt=3DAhu06i62sR8HDtDypao8Wcj9tAcJ&quot; target=3D=\r\n_blank&gt;Try it now.&lt;/A&gt; \n&lt;P&gt;&lt;BR&gt;&lt;/DIV&gt;&lt;SPAN style=3D&quot;COLOR: white&quot;&gt;&lt;/SPAN&gt; \n=\r\n&lt;STYLE&gt;\n.ExternalClass #EC_ygrp-mkp\n{border:1px solid #d8d8d8;font-family:A=\r\nrial;padding:0px 14px;}\n.ExternalClass #EC_ygrp-mkp hr\n{border:1px solid #d=\r\n8d8d8;}\n.ExternalClass #EC_ygrp-mkp #EC_hd\n{color:#628c2a;font-size:85%;fon=\r\nt-weight:bold;line-height:122%;}\n.ExternalClass #EC_ygrp-mkp #EC_ads\n{margi=\r\nn-bottom:10px;}\n.ExternalClass #EC_ygrp-mkp .EC_ad\n{padding:0 0;}\n.External=\r\nClass #EC_ygrp-mkp .EC_ad a\n{color:#0000ff;text-decoration:none;}\n\n&lt;/STYLE&gt;=\r\n\n\n&lt;STYLE&gt;\n.ExternalClass #EC_ygrp-sponsor #EC_ygrp-lc\n{font-family:Arial;}\n=\r\n.ExternalClass #EC_ygrp-sponsor #EC_ygrp-lc #EC_hd\n{font-weight:bold;font-s=\r\nize:78%;line-height:122%;}\n.ExternalClass #EC_ygrp-sponsor #EC_ygrp-lc .EC_=\r\nad\n{margin-bottom:10px;padding:0 0;}\n\n&lt;/STYLE&gt;\n\n&lt;STYLE&gt;\n.ExternalClass #EC_=\r\nygrp-mlmsg\n{font-size:13px;font-family:arial,helvetica,clean,sans-serif;}\n.=\r\nExternalClass #EC_ygrp-mlmsg table\n{font-size:inherit;font:100%;}\n.External=\r\nClass #EC_ygrp-mlmsg select, .ExternalClass input, .ExternalClass textarea\n=\r\n{font:99% arial,helvetica,clean,sans-serif;}\n.ExternalClass #EC_ygrp-mlmsg =\r\npre, .ExternalClass code\n{font:115% monospace;}\n.ExternalClass #EC_ygrp-mlm=\r\nsg EC_*\n{line-height:1.22em;}\n.ExternalClass #EC_ygrp-text\n{font-family:Geo=\r\nrgia;}\n.ExternalClass #EC_ygrp-text p\n{;}\n.ExternalClass #EC_ygrp-tpmsgs\n{f=\r\nont-family:Arial;clear:both;}\n.ExternalClass #EC_ygrp-vitnav\n{padding-top:1=\r\n0px;font-family:Verdana;font-size:77%;}\n.ExternalClass #EC_ygrp-vitnav a\n{p=\r\nadding:0 1px;}\n.ExternalClass #EC_ygrp-actbar\n{clear:both;white-space:nowra=\r\np;color:#666;text-align:right;}\n.ExternalClass #EC_ygrp-actbar .EC_left\n{fl=\r\noat:left;white-space:nowrap;}\n.ExternalClass .EC_bld\n{font-weight:bold;}\n.E=\r\nxternalClass #EC_ygrp-grft\n{font-family:Verdana;font-size:77%;padding:15px =\r\n0;}\n.ExternalClass #EC_ygrp-ft\n{font-family:verdana;font-size:77%;border-to=\r\np:1px solid #666;padding:5px 0;}\n.ExternalClass #EC_ygrp-mlmsg #EC_logo\n{pa=\r\ndding-bottom:10px;}\n.ExternalClass #EC_ygrp-reco\n{margin-bottom:20px;paddin=\r\ng:0px;}\n.ExternalClass #EC_ygrp-reco #EC_reco-head\n{font-weight:bold;color:=\r\n#ff7900;}\n.ExternalClass #EC_reco-grpname\n{font-weight:bold;}\n.ExternalClas=\r\ns #EC_reco-category\n{font-size:77%;}\n.ExternalClass #EC_reco-desc\n{font-siz=\r\ne:77%;}\n.ExternalClass #EC_ygrp-vital\n{background-color:#e0ecee;margin-bott=\r\nom:20px;padding:2px 0 8px 8px;}\n.ExternalClass #EC_ygrp-vital #EC_vithd\n{fo=\r\nnt-size:77%;font-family:Verdana;font-weight:bold;color:#333;text-transform:=\r\nuppercase;}\n.ExternalClass #EC_ygrp-vital ul\n{padding:0;}\n.ExternalClass #E=\r\nC_ygrp-vital ul li\n{list-style-type:none;clear:both;border:1px solid #e0ece=\r\ne;}\n.ExternalClass #EC_ygrp-vital ul li .EC_ct\n{font-weight:bold;color:#ff7=\r\n900;float:right;width:2em;text-align:right;padding-right:.5em;}\n.ExternalCl=\r\nass #EC_ygrp-vital ul li .EC_cat\n{font-weight:bold;}\n.ExternalClass #EC_ygr=\r\np-vital a\n{text-decoration:none;}\n.ExternalClass #EC_ygrp-vital a:hover\n{te=\r\nxt-decoration:underline;}\n.ExternalClass #EC_ygrp-sponsor #EC_hd\n{color:#99=\r\n9;font-size:77%;}\n.ExternalClass #EC_ygrp-sponsor #EC_ov\n{padding:6px 13px;=\r\nbackground-color:#e0ecee;margin-bottom:20px;}\n.ExternalClass #EC_ygrp-spons=\r\nor #EC_ov ul\n{padding:0 0 0 8px;}\n.ExternalClass #EC_ygrp-sponsor #EC_ov li=\r\n\n{list-style-type:square;padding:6px 0;font-size:77%;}\n.ExternalClass #EC_y=\r\ngrp-sponsor #EC_ov li a\n{text-decoration:none;font-size:130%;}\n.ExternalCla=\r\nss #EC_ygrp-sponsor #EC_nc\n{background-color:#eee;margin-bottom:20px;paddin=\r\ng:0 8px;}\n.ExternalClass #EC_ygrp-sponsor .EC_ad\n{padding:8px 0;}\n.External=\r\nClass #EC_ygrp-sponsor .EC_ad #EC_hd1\n{font-family:Arial;font-weight:bold;c=\r\nolor:#628c2a;font-size:100%;line-height:122%;}\n.ExternalClass #EC_ygrp-spon=\r\nsor .EC_ad a\n{text-decoration:none;}\n.ExternalClass #EC_ygrp-sponsor .EC_ad=\r\n a:hover\n{text-decoration:underline;}\n.ExternalClass #EC_ygrp-sponsor .EC_a=\r\nd p\n{;}\n.ExternalClass EC_o\n{font-size:0;}\n.ExternalClass .EC_MsoNormal\n{;}=\r\n\n.ExternalClass #EC_ygrp-text tt\n{font-size:120%;}\n.ExternalClass blockquot=\r\ne\n{;}\n.ExternalClass .EC_replbq\n{;}\n\n&lt;/STYLE&gt;\n&lt;/BLOCKQUOTE&gt;&lt;br /&gt;&lt;hr /&gt;Use =\r\nvideo conversation to talk face-to-face with Windows Live Messenger. &lt;a hre=\r\nf=3D&#39;http://www.windowslive.com/messenger/connect_your_way.html?ocid=3DTXT_=\r\nTAGLM_WL_Refresh_messenger_video_042008&#39; target=3D&#39;_new&#39;&gt;Get started!&lt;/a&gt;&lt;/=\r\nbody&gt;\n&lt;/html&gt;\r\n--_2aa6a674-89c3-415c-9573-c8ad0faf3ede_--"}