{"id": "9977", "subject": "Re: [EVP-ITC] Re: Editing EVP- Are you Crazy?", "author": "Michael Edwards", "timestamp": "2008-04-17T21:07:26Z", "full_text": "--0-492617447-1208466446=:95974\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nDepends. Some are fast, and others take a while. Like the one I got on the dolphin question. It was some time before I got an answer. I try and wait 30 sec, but for no special reason\n\npsfponies &lt;psfponies@...&gt; wrote:          I have a question on how much time should you allow between your \nquestion and a response before you ask another question? Is there a \nset time - 10 sec. 15 sec 30 sec. I read on paranormal systems site \nto wait at least 30 sec.? I have only recorded a few sessions and I \nhave noticed I dont always hear the response in Real Time but when I \nupload the recorded session to my computer and go over the clips I \nhear it then. \n\nKay\n\n--- In EVP-ITC@yahoogroups.com, juli velazquez \n&lt;ghostchasingfool@...&gt; wrote:\n&gt;\n&gt; For those of you who are paranormal investigators alike, you know \nthe first rule of thumb is NEVER edit your clips! If you want to be \ntaken serious in this field and not under a microscope with the \nquestion of whether or not you in fact did actually get a voice \nand/or response and that clip is edited, don&#39;t bother putting it up \nfor public display. You can amplify it, take out the hiss, but you \nbetter not splice it in any way, cause your just asking for \ntrouble. \n&gt; \n&gt; I had this very debate with Bruce long ago. I know first hand \nthat if in fact its edited many question your motives behind why you \nin fact would bother removing the dead airtime between. The very \nfirst thing that came into question when editing EVP from Frank&#39;s \nBox many moons ago (pun intended) that a certain person was in fact \nsplicing his audio by putting the questions and response right \nafter. Many now consider him to be a fraud and this was just one of \nthe reason built upon others as a direct result. You are altering \nthe clip, no ifs and or butts about. It can therefore hurt your \ncreditability as a researcher in the paranormal field. Regardless \nwith you save your original clips. Everything you do comes into \nquestion. You can clearly tell by the skip in rhythm as you play \nthe audio vs the free flowing of the dial when it has been altered. \nReal Time is real time people, not 15 seconds after the fact. If \nyou have to questions what you got....&quot;If in Doubt, throw\n&gt; It Out&quot;.\n&gt; \n&gt; People, there is one thing that you have to remember. The word \nof box research is spreading, and there are those who are \nimplementing it as an additional tool on investigations. This is \nnot just some who are going to give up their current status as a \nghost hunter to now slowly be a box researcher ( for that was never \na thought for me). I was hoping that through my research I could in \nfact incorporate it on my investigations. Because of the radio \nfragments itself, there are many that do not support this research \nand believe we are reaching and grasping at nothing, and literally \nlaugh when the subject of box research comes up. Do you really want \nto give them an extra ammunition as splicing your clips? I know \nmyself that there is more that meets the eye in this line for \ncommunication, and I do stand proud and true of pursuing real time \ncommunication, myself, but cutting out the dead air is not just \nbecause you don&#39;t want to listen to it, or you can&#39;t fit it all is a\n&gt; lame excuse. Use a different program!\n&gt; \n&gt; I personally have questioned many on their clips and have to \ntell you that if you truly want to be considered as a professional \nparanormal investigator/researcher that if you intend to use this \nprotocol for you evp/box research clips, you stand to loose your \ncreditability and the word fraud may just come into question.\n&gt; \n&gt; However, if you have nothing to loose as far as your reputation \nand or not in it to prove anything to anyone, be my guest. There \nare many here that are not involved in the paranormal field and a \nprefer evp-itc researcher vs. other areas of the super natural. If \nthey are not putting themselves out there for God and Country to \nsee, and are only doing it for your personal results and curiosity, \nand can could careless with others thing, then clip away to your \nhearts content! \n&gt; \n&gt; Just remember, if someone who is currently studying evp and not \nbox research sees and hears your clips, don&#39;t be surprised, if they \nstart questioning your motives and box research all together!\n&gt; \n&gt; Just adding my 2 cents!\n&gt; Juli\n&gt; \n&gt; \n&gt; \n&gt; psfponies &lt;psfponies@...&gt; wrote: Yes I get your point \nRees. On long messages cutting out the crap \n&gt; between words in the message.\n&gt; \n&gt; Kay\n&gt; \n&gt; --- In EVP-ITC@yahoogroups.com, Ron Lederer &lt;ronriko@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Sorry, don&#39;t get the point rees. Ron L\n&gt; &gt; \n&gt; &gt; Wiliam Clarke &lt;reesclarke_69@&gt; wrote: My thoughts on \n&gt; cut out the garbage leads people to believe that the messages that \n&gt; some people are getting messages are all in one sentence.\n&gt; &gt; \n&gt; &gt; Example Question: How are you today? \n&gt; &gt; \n&gt; &gt; 1st Answer:(Cut Up) I&#39;m good, me and my spirts friends here \n&gt; wants to give you a long message for the reseachers to here&gt; \n&gt; &gt; \n&gt; &gt; 2nd Answer:(Not Cut) I&#39;m blah blah blah blah blah blah blah blah \n&gt; blah blah blah good blah blah.\n&gt; &gt; \n&gt; &gt; Does anybody see my point on cut up messages?\n&gt; &gt; \n&gt; &gt; Rees\n&gt; &gt; \n&gt; &gt; bruce halliday &lt;paranormalinvestigating@&gt; wrote:\n&gt; &gt; Stefan,\n&gt; &gt; \n&gt; &gt; I do remove the &quot;garbage&quot; from my files.\n&gt; &gt; \n&gt; &gt; At this point in my research, the message is more important to \nme \n&gt; than the proof of it.\n&gt; &gt; I think most of us here will agree that we are receiving some \nsort \n&gt; of paranormal communication.\n&gt; &gt; but it definitely exists. now we need to concentrate on the \n&gt; messages they need us to hear and the answers to the questions\n&gt; &gt; we ask and in turn our answers to their questions. Anyone that \n&gt; cleans a file in this way should not be touching any bit of the \nfile\n&gt; &gt; that has a semblance of speech, only the bits that are odiously \n&gt; garbage like the &quot;EH O EH AH O EH UR&quot; in between words.\n&gt; &gt; \n&gt; &gt; For example &quot;Is there anyone here that wishes to \n&gt; communicate_YES_AH ER EEH AR OOO AR_WE ARE_EH IH AHH EHH_HERE&quot;\n&gt; &gt; It is much easier for me as a researcher to be able to return to \na \n&gt; file that I recieved two weeks ago and that I believe may hold some\n&gt; &gt; relivence to a message I just received and be able to cleanly \n&gt; listen to it, without the distraction of the garbage sounds.\n&gt; &gt; \n&gt; &gt; At this stage in real time communication the messages are the \ntop \n&gt; priority.\n&gt; &gt; I do however agree that the untouched version should be retained \n&gt; and made available to individuals that make a request \n&gt; &gt; for any intelligent sceptical or authenticity challenge that may \n&gt; be made, and god knows there are always fanatical \n&gt; &gt; sceptics lurking in the shadows awaiting an opportunity to \nattack \n&gt; an unwary or injured researcher. I do not think that \n&gt; &gt; our research files should be made available on request by every \n&gt; tom dick and harry that is unknown to us and may potentially\n&gt; &gt; doctor the file to suit their own point and post it as such.\n&gt; &gt; \n&gt; &gt; I have had this happen to me in the past so I believe the \n&gt; researcher that receives the request for raw research data should \n&gt; &gt; scrutinize the requesting source and use their best judgment \n&gt; before handing out any research data.\n&gt; &gt; \n&gt; &gt; These are my thoughts on the subject of cleaning a file.\n&gt; &gt; \n&gt; &gt; Bruce\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; Bruce Halliday \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; ---------------------------------\n&gt; &gt; To: EVP-ITC@yahoogroups.com\n&gt; &gt; From: yahoogroups@\n&gt; &gt; Date: Thu, 17 Apr 2008 09:55:42 +0200\n&gt; &gt; Subject: [EVP-ITC] Editing EVP\n&gt; &gt; \n&gt; &gt; Hi all,\n&gt; &gt; \n&gt; &gt; just a general comment on editing EVP: For scientific reasons, I \n&gt; would\n&gt; &gt; suggest not to edit an EVP message partially, but only as a \nwhole, \n&gt; in\n&gt; &gt; order to rule out any possible suspicion of manipulation. You \ncan \n&gt; for\n&gt; &gt; instance increase the volume or dynamics of an entire clip \n&gt; (including\n&gt; &gt; the experimenter&#39;s voice), filter or denoise it to make it \n&gt; clearer, but\n&gt; &gt; not cut out individual pieces (supposed &quot;garbage&quot;) to make an \nEVP \n&gt; match\n&gt; &gt; with what it &quot;should be&quot;. At least, the unedited version should \n&gt; always\n&gt; &gt; be provided along with the edited version.\n&gt; &gt; \n&gt; &gt; But that&#39;s only my personal opinion which I thought I had to \n&gt; express, as\n&gt; &gt; we should always be able to present our results to a critical \n&gt; public.\n&gt; &gt; \n&gt; &gt; Stefan\n&gt; &gt; \n&gt; &gt; -- \n&gt; &gt; \n&gt; &gt; &gt; Believe or not Ron, very little editing is involved for these \n&gt; files.\n&gt; &gt; &gt; After my question, i isolate the response section and slow \nthat \n&gt; &gt; &gt; section down about 20%. Now i can actually start to hear the \n&gt; message \n&gt; &gt; &gt; a lot clearer, i also now see a couple sections of just noise \n&gt; that \n&gt; &gt; &gt; don&#39;t belong and eliminate them from the mix. You can&#39;t piece \n&gt; these \n&gt; &gt; &gt; files together to make something it&#39;s not, so i keep them in \n&gt; true \n&gt; &gt; &gt; form pretty much to the original.\n&gt; &gt; \n&gt; &gt; &gt; -Steve\n&gt; &gt; \n&gt; &gt; &gt; --- In EVP-ITC@yahoogroups.com, Ron Lederer &lt;ronriko@&gt; wrote:\n&gt; &gt; &gt;&gt;\n&gt; &gt; &gt;&gt; Hey Steve Forgot to ask...how much editing was needed to get \n&gt; this \n&gt; &gt; &gt; file? Did you need to take out a lot of garbage between words \n&gt; &gt; &gt; withing the message? Ron L\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; ---------------------------------\n&gt; &gt; More immediate than e-mail? Get instant access with Windows Live \n&gt; Messenger. \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; ---------------------------------\n&gt; &gt; Be a better friend, newshound, and know-it-all with Yahoo! \n&gt; Mobile. Try it now. \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; ---------------------------------\n&gt; &gt; Be a better friend, newshound, and know-it-all with Yahoo! \n&gt; Mobile. Try it now.\n&gt; &gt;\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; The contents of this eletronic correspondence is private & \nconfidential and meant only for the party and/or parties it is \naddressed to. \n&gt; \n&gt; No part of this email transmission may be publicly posted or \nforwarded to other parties without explicit written permission.\n&gt;\n\n\n\n                           \n\n\nMichael Edwards:  f1cracker75@...\n       \n---------------------------------\nBe a better friend, newshound, and know-it-all with Yahoo! Mobile.  Try it now.\r\n--0-492617447-1208466446=:95974\r\nContent-Type: text/html; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\n\r\nDepends. Some are fast, and others take a while. Like the one I got on the dolphin question. It was some time before I got an answer. I try and wait 30 sec, but for no special reason&lt;BR&gt;&lt;BR&gt;&lt;B&gt;&lt;I&gt;psfponies &lt;psfponies@...&gt;&lt;/I&gt;&lt;/B&gt; wrote:  &lt;BLOCKQUOTE class=replbq style=&quot;PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #1010ff 2px solid&quot;&gt;  &lt;DIV id=ygrp-text&gt;  &lt;div&gt;I have a question on how much time should you allow between your &lt;BR&gt;question and a response before you ask another question? Is there a &lt;BR&gt;set time - 10 sec. 15 sec 30 sec. I read on paranormal systems site &lt;BR&gt;to wait at least 30 sec.? I have only recorded a few sessions and I &lt;BR&gt;have noticed I dont always hear the\n response in Real Time but when I &lt;BR&gt;upload the recorded session to my computer and go over the clips I &lt;BR&gt;hear it then. &lt;BR&gt;&lt;BR&gt;Kay&lt;BR&gt;&lt;BR&gt;--- In &lt;A href=&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;, juli velazquez &lt;BR&gt;&lt;ghostchasingfool@&lt;WBR&gt;...&gt; wrote:&lt;BR&gt;&gt;&lt;BR&gt;&gt; For those of you who are paranormal investigators alike, you know &lt;BR&gt;the first rule of thumb is NEVER edit your clips! If you want to be &lt;BR&gt;taken serious in this field and not under a microscope with the &lt;BR&gt;question of whether or not you in fact did actually get a voice &lt;BR&gt;and/or response and that clip is edited, don&#39;t bother putting it up &lt;BR&gt;for public display. You can amplify it, take out the hiss, but you &lt;BR&gt;better not splice it in any way, cause your just asking for &lt;BR&gt;trouble. &lt;BR&gt;&gt; &lt;BR&gt;&gt; I had this very debate with Bruce long ago. I know first hand &lt;BR&gt;that if in fact its edited many question your motives behind why you &lt;BR&gt;in fact would bother removing the\n dead airtime between. The very &lt;BR&gt;first thing that came into question when editing EVP from Frank&#39;s &lt;BR&gt;Box many moons ago (pun intended) that a certain person was in fact &lt;BR&gt;splicing his audio by putting the questions and response right &lt;BR&gt;after. Many now consider him to be a fraud and this was just one of &lt;BR&gt;the reason built upon others as a direct result. You are altering &lt;BR&gt;the clip, no ifs and or butts about. It can therefore hurt your &lt;BR&gt;creditability as a researcher in the paranormal field. Regardless &lt;BR&gt;with you save your original clips. Everything you do comes into &lt;BR&gt;question. You can clearly tell by the skip in rhythm as you play &lt;BR&gt;the audio vs the free flowing of the dial when it has been altered. &lt;BR&gt;Real Time is real time people, not 15 seconds after the fact. If &lt;BR&gt;you have to questions what you got....&quot;If in Doubt, throw&lt;BR&gt;&gt; It Out&quot;.&lt;BR&gt;&gt; &lt;BR&gt;&gt; People, there is one thing that you have to remember. The word &lt;BR&gt;of box research is\n spreading, and there are those who are &lt;BR&gt;implementing it as an additional tool on investigations. This is &lt;BR&gt;not just some who are going to give up their current status as a &lt;BR&gt;ghost hunter to now slowly be a box researcher ( for that was never &lt;BR&gt;a thought for me). I was hoping that through my research I could in &lt;BR&gt;fact incorporate it on my investigations. Because of the radio &lt;BR&gt;fragments itself, there are many that do not support this research &lt;BR&gt;and believe we are reaching and grasping at nothing, and literally &lt;BR&gt;laugh when the subject of box research comes up. Do you really want &lt;BR&gt;to give them an extra ammunition as splicing your clips? I know &lt;BR&gt;myself that there is more that meets the eye in this line for &lt;BR&gt;communication, and I do stand proud and true of pursuing real time &lt;BR&gt;communication, myself, but cutting out the dead air is not just &lt;BR&gt;because you don&#39;t want to listen to it, or you can&#39;t fit it all is a&lt;BR&gt;&gt; lame excuse. Use a different\n program!&lt;BR&gt;&gt; &lt;BR&gt;&gt; I personally have questioned many on their clips and have to &lt;BR&gt;tell you that if you truly want to be considered as a professional &lt;BR&gt;paranormal investigator/&lt;WBR&gt;researcher that if you intend to use this &lt;BR&gt;protocol for you evp/box research clips, you stand to loose your &lt;BR&gt;creditability and the word fraud may just come into question.&lt;BR&gt;&gt; &lt;BR&gt;&gt; However, if you have nothing to loose as far as your reputation &lt;BR&gt;and or not in it to prove anything to anyone, be my guest. There &lt;BR&gt;are many here that are not involved in the paranormal field and a &lt;BR&gt;prefer evp-itc researcher vs. other areas of the super natural. If &lt;BR&gt;they are not putting themselves out there for God and Country to &lt;BR&gt;see, and are only doing it for your personal results and curiosity, &lt;BR&gt;and can could careless with others thing, then clip away to your &lt;BR&gt;hearts content! &lt;BR&gt;&gt; &lt;BR&gt;&gt; Just remember, if someone who is currently studying evp and not &lt;BR&gt;box research\n sees and hears your clips, don&#39;t be surprised, if they &lt;BR&gt;start questioning your motives and box research all together!&lt;BR&gt;&gt; &lt;BR&gt;&gt; Just adding my 2 cents!&lt;BR&gt;&gt; Juli&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; psfponies &lt;psfponies@.&lt;WBR&gt;..&gt; wrote: Yes I get your point &lt;BR&gt;Rees. On long messages cutting out the crap &lt;BR&gt;&gt; between words in the message.&lt;BR&gt;&gt; &lt;BR&gt;&gt; Kay&lt;BR&gt;&gt; &lt;BR&gt;&gt; --- In &lt;A href=&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;, Ron Lederer &lt;ronriko@&gt; wrote:&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &gt; Sorry, don&#39;t get the point rees. Ron L&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; Wiliam Clarke &lt;reesclarke_&lt;WBR&gt;69@&gt; wrote: My thoughts on &lt;BR&gt;&gt; cut out the garbage leads people to believe that the messages that &lt;BR&gt;&gt; some people are getting messages are all in one sentence.&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; Example Question: How are you today? &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; 1st Answer:(Cut Up) I&#39;m good, me and my spirts friends here &lt;BR&gt;&gt; wants\n to give you a long message for the reseachers to here&gt; &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; 2nd Answer:(Not Cut) I&#39;m blah blah blah blah blah blah blah blah &lt;BR&gt;&gt; blah blah blah good blah blah.&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; Does anybody see my point on cut up messages?&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; Rees&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; bruce halliday &lt;paranormalinvestig&lt;WBR&gt;ating@&gt; wrote:&lt;BR&gt;&gt; &gt; Stefan,&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; I do remove the &quot;garbage&quot; from my files.&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; At this point in my research, the message is more important to &lt;BR&gt;me &lt;BR&gt;&gt; than the proof of it.&lt;BR&gt;&gt; &gt; I think most of us here will agree that we are receiving some &lt;BR&gt;sort &lt;BR&gt;&gt; of paranormal communication.&lt;BR&gt;&gt; &gt; but it definitely exists. now we need to concentrate on the &lt;BR&gt;&gt; messages they need us to hear and the answers to the questions&lt;BR&gt;&gt; &gt; we ask and in turn our answers to their questions. Anyone that &lt;BR&gt;&gt; cleans a file in this way should\n not be touching any bit of the &lt;BR&gt;file&lt;BR&gt;&gt; &gt; that has a semblance of speech, only the bits that are odiously &lt;BR&gt;&gt; garbage like the &quot;EH O EH AH O EH UR&quot; in between words.&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; For example &quot;Is there anyone here that wishes to &lt;BR&gt;&gt; communicate_&lt;WBR&gt;YES_AH ER EEH AR OOO AR_WE ARE_EH IH AHH EHH_HERE&quot;&lt;BR&gt;&gt; &gt; It is much easier for me as a researcher to be able to return to &lt;BR&gt;a &lt;BR&gt;&gt; file that I recieved two weeks ago and that I believe may hold some&lt;BR&gt;&gt; &gt; relivence to a message I just received and be able to cleanly &lt;BR&gt;&gt; listen to it, without the distraction of the garbage sounds.&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; At this stage in real time communication the messages are the &lt;BR&gt;top &lt;BR&gt;&gt; priority.&lt;BR&gt;&gt; &gt; I do however agree that the untouched version should be retained &lt;BR&gt;&gt; and made available to individuals that make a request &lt;BR&gt;&gt; &gt; for any intelligent sceptical or authenticity challenge that may &lt;BR&gt;&gt;\n be made, and god knows there are always fanatical &lt;BR&gt;&gt; &gt; sceptics lurking in the shadows awaiting an opportunity to &lt;BR&gt;attack &lt;BR&gt;&gt; an unwary or injured researcher. I do not think that &lt;BR&gt;&gt; &gt; our research files should be made available on request by every &lt;BR&gt;&gt; tom dick and harry that is unknown to us and may potentially&lt;BR&gt;&gt; &gt; doctor the file to suit their own point and post it as such.&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; I have had this happen to me in the past so I believe the &lt;BR&gt;&gt; researcher that receives the request for raw research data should &lt;BR&gt;&gt; &gt; scrutinize the requesting source and use their best judgment &lt;BR&gt;&gt; before handing out any research data.&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; These are my thoughts on the subject of cleaning a file.&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; Bruce&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; Bruce Halliday &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt;\n ------------&lt;WBR&gt;---------&lt;WBR&gt;---------&lt;WBR&gt;---&lt;BR&gt;&gt; &gt; To: &lt;A href=&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;&lt;BR&gt;&gt; &gt; From: yahoogroups@&lt;BR&gt;&gt; &gt; Date: Thu, 17 Apr 2008 09:55:42 +0200&lt;BR&gt;&gt; &gt; Subject: [EVP-ITC] Editing EVP&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; Hi all,&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; just a general comment on editing EVP: For scientific reasons, I &lt;BR&gt;&gt; would&lt;BR&gt;&gt; &gt; suggest not to edit an EVP message partially, but only as a &lt;BR&gt;whole, &lt;BR&gt;&gt; in&lt;BR&gt;&gt; &gt; order to rule out any possible suspicion of manipulation. You &lt;BR&gt;can &lt;BR&gt;&gt; for&lt;BR&gt;&gt; &gt; instance increase the volume or dynamics of an entire clip &lt;BR&gt;&gt; (including&lt;BR&gt;&gt; &gt; the experimenter&#39;&lt;WBR&gt;s voice), filter or denoise it to make it &lt;BR&gt;&gt; clearer, but&lt;BR&gt;&gt; &gt; not cut out individual pieces (supposed &quot;garbage&quot;) to make an &lt;BR&gt;EVP &lt;BR&gt;&gt; match&lt;BR&gt;&gt; &gt; with what it &quot;should be&quot;. At least, the unedited version should &lt;BR&gt;&gt;\n always&lt;BR&gt;&gt; &gt; be provided along with the edited version.&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; But that&#39;s only my personal opinion which I thought I had to &lt;BR&gt;&gt; express, as&lt;BR&gt;&gt; &gt; we should always be able to present our results to a critical &lt;BR&gt;&gt; public.&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; Stefan&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; -- &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; &gt; Believe or not Ron, very little editing is involved for these &lt;BR&gt;&gt; files.&lt;BR&gt;&gt; &gt; &gt; After my question, i isolate the response section and slow &lt;BR&gt;that &lt;BR&gt;&gt; &gt; &gt; section down about 20%. Now i can actually start to hear the &lt;BR&gt;&gt; message &lt;BR&gt;&gt; &gt; &gt; a lot clearer, i also now see a couple sections of just noise &lt;BR&gt;&gt; that &lt;BR&gt;&gt; &gt; &gt; don&#39;t belong and eliminate them from the mix. You can&#39;t piece &lt;BR&gt;&gt; these &lt;BR&gt;&gt; &gt; &gt; files together to make something it&#39;s not, so i keep them in &lt;BR&gt;&gt; true &lt;BR&gt;&gt; &gt; &gt; form pretty much to the original.&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt;\n &gt; -Steve&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; &gt; --- In &lt;A href=&quot;mailto:EVP-ITC%40yahoogroups.com&quot;&gt;EVP-ITC@yahoogroups&lt;WBR&gt;.com&lt;/A&gt;, Ron Lederer &lt;ronriko@&gt; wrote:&lt;BR&gt;&gt; &gt; &gt;&gt;&lt;BR&gt;&gt; &gt; &gt;&gt; Hey Steve Forgot to ask...how much editing was needed to get &lt;BR&gt;&gt; this &lt;BR&gt;&gt; &gt; &gt; file? Did you need to take out a lot of garbage between words &lt;BR&gt;&gt; &gt; &gt; withing the message? Ron L&lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; ------------&lt;WBR&gt;---------&lt;WBR&gt;---------&lt;WBR&gt;---&lt;BR&gt;&gt; &gt; More immediate than e-mail? Get instant access with Windows Live &lt;BR&gt;&gt; Messenger. &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; ------------&lt;WBR&gt;---------&lt;WBR&gt;---------&lt;WBR&gt;---&lt;BR&gt;&gt; &gt; Be a better friend, newshound, and know-it-all with Yahoo! &lt;BR&gt;&gt; Mobile. Try it now. &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt; &lt;BR&gt;&gt; &gt;\n ------------&lt;WBR&gt;---------&lt;WBR&gt;---------&lt;WBR&gt;---&lt;BR&gt;&gt; &gt; Be a better friend, newshound, and know-it-all with Yahoo! &lt;BR&gt;&gt; Mobile. Try it now.&lt;BR&gt;&gt; &gt;&lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; &lt;BR&gt;&gt; The contents of this eletronic correspondence is private &amp; &lt;BR&gt;confidential and meant only for the party and/or parties it is &lt;BR&gt;addressed to. &lt;BR&gt;&gt; &lt;BR&gt;&gt; No part of this email transmission may be publicly posted or &lt;BR&gt;forwarded to other parties without explicit written permission.&lt;BR&gt;&gt;&lt;BR&gt;&lt;BR&gt;&lt;/div&gt;&lt;/DIV&gt;&lt;!--End group email --&gt;&lt;/BLOCKQUOTE&gt;&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;&lt;STRONG&gt;&lt;FONT face=&quot;comic sans ms&quot; color=#0000ff size=5&gt;Michael Edwards:&nbsp; f1cracker75@...&lt;/FONT&gt;&lt;/STRONG&gt;&lt;p&gt;&#32;\n\n\n\n      &lt;hr size=1&gt;Be a better friend, newshound, and \nknow-it-all with Yahoo! Mobile. &lt;a href=&quot;http://us.rd.yahoo.com/evt=51733/*http://mobile.yahoo.com/;_ylt=Ahu06i62sR8HDtDypao8Wcj9tAcJ &quot;&gt; Try it now.&lt;/a&gt;\r\n--0-492617447-1208466446=:95974--"}